{
    "id": "1001802",
    "url": "https://archiveofourown.org/works/1001802?view_full_work=true",
    "author": [
        "apocryphal"
    ],
    "title": "Inertia",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen",
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale & Stiles Stilinski & Cora Hale",
        "Cora Hale & Derek Hale",
        "Derek Hale/Stiles Stilinski",
        "Cora Hale & Stiles Stilinski"
    ],
    "characters": [
        "Derek Hale",
        "Stiles Stilinski",
        "Cora Hale",
        "Lydia Martin",
        "Sheriff Stilinski",
        "Scott McCall",
        "Tara Graeme"
    ],
    "additional_tags": [
        "Post 3a",
        "Road Trips",
        "Running Away",
        "Healing",
        "Emotional Hurt/Comfort",
        "Emotional Baggage",
        "Angst",
        "Fluff",
        "Bonding",
        "Sibling Bonding",
        "Panic Attacks",
        "Nightmares",
        "Nemeton",
        "beta!derek",
        "Stilinski Family Feels",
        "Hale Family Feels",
        "ADHD",
        "Slow Burn",
        "Friendship"
    ],
    "language": "English",
    "series": "",
    "published": "2013-10-13",
    "completed": null,
    "words": "21,608",
    "chapters": "1/1",
    "comments": "355",
    "kudos": "10,105",
    "bookmarks": "2,937",
    "hits": "125,587",
    "summary": "<p>The last thing Derek and Cora are expecting to find outside their motel room is a gaunt Stiles Stilinski, lacrosse bag on one shoulder and the weight of the world on the other.</p>",
    "notes": "<p>Huge thanks to verity, Hepzheba, mshkfk, and everyone else who helped make this fic possible with betas and pre-reads and encouragement when I was whiny and insecure (you know who you are)! And a special apology for anyone who has been to the places described in this fic. I did some research, but probably not enough. </p>\n<p><b>Warnings:</b> One panic attack, and brief, non-descriptive references to child abuse/neglect, animal death, and drowning.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Listen to <i>Lawrence of My Labia</i> <a href=\"https://8tracks.com/bookgodess15/lawrence-of-my-labia/\" rel=\"nofollow\">here</a>.</p>\n<p>Listen to the soundtrack for the fic <a href=\"https://8tracks.com/bookgodess15/inertia\" rel=\"nofollow\">here</a>.</p>\n<p>Lawrence is mostly a joke, but the fic soundtrack I promise is a carefully crafted collection of quality music!</p>\n<p>Also, come say hi on <a href=\"https://the-apocrypha.tumblr.com/\" rel=\"nofollow\">Tumblr</a>! And nag me into writing faster.</p>",
    "text": "Stiles’ face takes up most of the screen, but there’s still enough room around the edges that it’s clear he’s in his bedroom, which is lit with the watery grey light of dawn. His eyes are bloodshot, wild, and his whole face twitches several times before he starts to speak.\n“Hey, Dad,” Stiles says. “This is, um. So. I have to—I’m leaving. For a while. And I thought I’d videotape this instead of leaving a note so you’d know that I wasn’t being, like, held at gunpoint or something, because I’m not. It’s just me. Leaving. I don’t know how long I’ll be gone. But you called Aunt Rose, and Dad, I’m really sorry but there is no way I’m going back there, I—”\nStiles stops. He takes in two careful, slow breaths before he continues.\n“I’m leaving my phone behind, so you can get on a cheaper plan. All State called—they’re scrapping the Jeep. I think they’re sending a check in the mail? So. Yay? Make sure you take your meds. Stay away from bacon. Have fun with Melissa on Friday night. Um.”\nStiles’ eyes flick to the right, and then down, before finally going back to the camera.\n“I love you.”\n \nTheir road trip has been very quiet.\nIt’s not that Derek’s a talker. It’s not that his last road trips—the six months he and Laura took to make it to New York, and the two days he spent racing back to Beacon Hills after her death—had been particularly filled with conversation. It’s not even that he thought Cora would fill the silence with aimless chatter. He doesn’t know what he thought, exactly, except that when he thinks back, way back, he remembers road trips filled with sing-alongs and Mad Libs and very short-lived games of Who Can Be Quiet the Longest.\nHe still doesn’t know where Cora was all these years. She hasn’t said.\n(Maybe she’s waiting on Derek to make the first move for that, too.)\nBut Cora, while quiet, isn’t cold. She might even be happy, although it’s hard for Derek to adjust to the idea that a happy Cora isn’t a Cora running around the house yelling “Pretend I’m a horse, pretend I’m a horse, ‘kay? Neeeiighh!” She’s smiling more than she did in Beacon Hills, at least. That’s something.\nShe might be getting tired of Chinese food, though.\n“We could get pizza tomorrow,” Derek offers, breaking the silence.\nCora opens her mouth to reply, but closes it as a car whips past them and leaves billows of red dust in its wake. Derek does his best to shield the bag of food, and blinks his eyes clear in time to see her shrug.\nHe coughs to clear his throat of the dust, debates, and then says, “Do you still only like cheese?”\n“I like whatever,” Cora answers.\n“Oh,” Derek says, after a beat. “Sure.”\nHe glances up at the motel to check their progress. They’re almost back. He feels vaguely sad about that; their daily trip down the road for dinner is the most exciting thing they do all day.\nThey move from the dirt path beside the road onto the pavement of the parking lot, which is still scorching hot despite the fact that the sun is almost set. Part of him wishes that they’d stayed at an actual hotel, somewhere in town, but he likes the quiet on the outskirts of town too much, and swamp coolers make the air smell better than air conditioning units do.\nHe’s fishing in his pocket for the key to the room, gratefully stepping into the shade of the awning, Cora trailing behind him, when out of the corner of his eye he spots a figure on the other side of their Toyota.\nIt takes a moment for the scent to register, probably because the last thing Derek is expecting to find in the middle of the desert is a gaunt Stiles Stilinski propped against the shady side of their Toyota, lacrosse bag stuffed full and tucked under his butt. His head keeps tipping forward and then jerking back up, like he’s just barely keeping himself from falling asleep despite the wickedly hot metal of the car.\nDerek is a second away from dismissing it as a heat-induced hallucination, because seriously, when Cora says, “Oh. My. God.”\nWhich basically nips that idea in the bud.\nStiles jerks and springs up, tripping over his lacrosse bag and smacking his hand against the side mirror of the Toyota when he flails. His shirt moves oddly, pooling into hollows that weren’t there when Derek last saw him. “Shit—Derek! Cora! Hi!”\n“What the hell are you doing here?” Cora demands.\n“Sitting,” Stiles shoots back. “Is that a crime?”\n“Maybe,” Cora says.\n“Yeah, well—it’s not,” Stiles says.\nCora looks unimpressed. “Go home, kid.”\n“Make me,” Stiles challenges, like an idiot.\nDerek just barely gets a hand out in time to stop Cora from advancing.\n“What are you doing here, Stiles?” he sighs, as Cora gleefully bares her teeth.\n“Uh,” says Stiles, looking unsure of which Hale he should be paying attention to. “Possibly. Crashing your road trip?”\nOf course he is.\n“No, you’re not,” Cora says immediately. “This is Derek’s road trip, okay, not an excuse for you to have a stupid adventure. Go home.”\n“Fuck off, nobody asked you,” Stiles snaps.\n“Nobody asked you to be here in the first place,” Cora fires back.\n“Yeah, well, I think if it’s Derek’s road trip, then Derek should be the one talking, shouldn’t he?” Stiles says.\nAnd suddenly both Cora and Stiles are glaring at him, and all Derek wants to say is that it’s really not his road trip and he wishes Cora would stop saying that. It was Cora who had wanted to go; Derek had just wanted to keep her happy.\nClearly, Stiles’ presence is making her unhappy.\nOn the other hand, Stiles is exactly the type of person who would corral everyone else into playing Mad Libs on a long car ride.\n“I believe it’s called loitering,” he tells them, and turns toward the door to their room, key in hand. “And it is a crime. Both of you get inside.”\n \nDerek pours half of his wonton soup into the ice bucket, surrenders two of the egg rolls, hands Stiles a spoon and sets the bag of shrimp chips between them. Cora doesn’t give him so much as a piece of broccoli, despite the fact that she’s been quietly hating Chinese food since Tuesday. Stiles looks skinny enough that one meal isn’t going to make a difference, anyway.\nThey eat in silence. Cora hasn’t known Stiles long, but she definitely knows that he’s doing two things wrong already: he’s not talking, and he’s not eating like pig.\nDerek hesitates. “If you don’t like it—”\n“It’s fine,” Stiles mumbles, hurriedly stuffing a shrimp chip in his mouth.\nCora grabs the remote and flips on the TV. The first shot is of an Amish woman and Harrison Ford. She scowls and pushes the UP button until it lands on the Food Network; they’re making something with steak tips and corn that looks fucking delicious.\nDerek glances at it, then at her, and then resolutely focuses on his soup.\nCora mechanically stuffs hunks of chicken into her mouth.\nThe third time Stiles picks up a dumpling and then lets it plop back into the ice bucket, Cora dumps her food on the bed and grabs Derek by the arm.\n“Can we talk for a minute?” she grits out, though Derek is already allowing her drag him up and toward the bathroom. She spares a glance at Stiles as they leave. “Don’t touch my food.”\nStiles rolls his eyes.\nCora shuts the door behind them, flips on the bathroom fan, and then pauses to check on Stiles but through the noise of the fan and the television, she can’t hear him. She turns to Derek.\n“Can you hear—”\n“I can hear whatever you can hear,” Derek reminds her. He glances ruefully at the fan behind his head. “Probably less.”\nRight. Her fault.\nShe swallows, musters her fury, and says, “He is not staying.”\n“I thought you liked him,” Derek says, like that is actually the issue.\n“I tolerated him. Barely.” She studies her brother’s face, but she hasn’t relearned it well enough yet. “Look. You can’t tell me that you want him to be here.”\nDerek shrugs.\n\"Do you want him here?” Cora asks. “He’s an asshole. He’s going to cost money and demand we go places and entertain him—he’s going to treat this like a vacation, Derek.”\n“Isn’t that what this was supposed to be?” Derek asks.\n“No, it’s—” Cora takes a breath for patience. “Derek, he wants to use you. That’s not okay.”\nDerek rolls his eyes. “It’s Stiles. He just needs a little help.”\n“Like that Jennifer bitch needed a little help?” Cora asks, eyebrows raising just as Derek’s face shuts down.\nDammit.\n“You have to stop helping people, Derek,” Cora insists.\n“I helped you,” Derek says stubbornly.\nShe looks away and grits her teeth. She tries to listen again for Stiles, but all she can hear is the damned Food Channel.\n“Why are you so against this?” Derek asks her, frowning.\n“Why are you for this?” Cora demands, whipping back to face him. “You don’t even like him! He’s not your pack. He’s not anything, he’s just some stupid kid that’s going to—”\nDerek’s face is, impossibly, shutting down even further.\nCora changes tactics, her brain scrambling for something, anything.\n“How do you think he found us?” she asks. “Hm? How did—do you think his father knows he’s gone? Scott? What’s gonna happen when they follow Stiles here and discover that he’s hiding out with us? I’ll tell you what, Derek, they’re going to think we kidnapped him across state lines and that’s a federal crime. Did you think of that?”\nFrom the expression on his face, Derek had not.\n“They take kidnapping really seriously in the US,” Cora continues. “You’ll go to prison for years. You—”\nThere’s a tapping on the bathroom door, and she and Derek both jump about a foot in the air.\n\"Uh, guys? Just FYI, no one’s gonna go to prison for kidnapping me, okay? For one, that would only count if you were the ones to transport me across state lines, which you definitely weren’t. Also, even if my dad wanted to find me, he couldn’t.”\nCora glares mutinously at the door.\n“Just saying,” Stiles adds.\n \nStiles sits on the edge of the bed. Cora very subtly stands in front of the door.\nDerek, after a moment of deliberation, sits down on the edge of the bed as well. It’s exactly as close as he needs to be to hear Stiles’ heartbeat, and also, it’s been long enough that it’s sort of nice to see Stiles again. So nice it sort of takes him by surprise, because, well, it’s Stiles. He doesn’t like it.\nFor a very quick moment he longs to be an Alpha again so he could be sitting across the room right now. Just for a moment.\n“Okay,” says Stiles. He looks at his hands, which are twisting in his lap. “Okay. I left my phone at home and all my money’s in cash. I have my computer, but it doesn’t have Lo-Jack or anything and I’m not going to turn it on. But more importantly, it’s—my dad needs some space right now. He’s not going to go after me.”\n“Really,” Derek says flatly.\nStiles’ heartbeat is steady, but he can’t imagine a world in which the Sheriff wouldn’t go after his runaway son.\n“If he’s not going after you, then why all the precautions?” Cora asks.\n“Scott,” Stiles says, and after a beat, “and Danny.”\n“You’ve been planning this,” Derek says.\nStiles shrugs, grinning a little. “I plan everything, dude. I am the master of procrastinating productively.”\nCora is scowling.\nDerek doesn’t know what to do. He should, as a reasonable adult, put Stiles on the next bus back to Beacon Hills. Stiles isn’t like them. He has a father who loves him and a pack that find him useful.\nStiles seems to sense his indecision.\n“Listen, I’m sorry that I’m crashing your road trip,” he says, slumping a little. “But my dad was going to send me away, all right, and I just—wanted to make my own choice about it. You guys get that, right?”\n“What, that even your own father doesn’t want you?” Cora asks. “Yeah, I thi—”\n“Cora,” Derek says sharply.\n“Let me stay a week,” Stiles begs. “Please. You guys have been in this motel for four days, you’re clearly not going anywhere. I’ll sleep on the floor, and pay for my own food. I’ll be quiet. I’ll give you money for the room.”\n“How do you know how long we’ve—” Derek starts to ask, eyes narrowed, when his phone vibrates with a new text message. He stops, pulls his phone out, and sighs when he sees the sender.\n\nSorry to bother you dude but weird question, you haven’t heard from Stiles right?\n\nDerek looks up at Stiles, eyebrows raised. “It’s Scott,” he says.\n“One week,” Stiles pleads. “Just give me one week.”\nOut of the three people in the room, Derek is pretty sure he is not the one who should be making this decision. Stiles looks ready to cry and Cora looks ready to bite his head off, but Derek could really care less about the outcome. What does it matter if Stiles stays? The stakes are Derek’s general level of annoyance for the next few days—if that. There are no lives in the balance, here.\nExcept, maybe Stiles’ life is. Maybe running away from home is the worst possible thing he could do for himself, the thing that will set him on a course of self-destruction that will end in a sad, lonely death, and it will all be Derek’s fault. Or, maybe, running away from home will be what ends up saving Stiles from that.\nOr maybe it’s neither, and it’s just a few days of Stiles being annoying and Cora being tetchy, and five years from now none of them will even remember it.\nNo. Sorry, Derek texts Scott.\n“One week,” he tells Stiles, and prays this won’t end in death.\n \nAs the bus rolled over mile after mile of pavement, taking Stiles away from Beacon Hills, he’d felt the cords around his heart loosen. By the time he’d made it to the dusty town Derek and Cora were staying in, he could actually feel his heart beating in his chest for the first time in weeks. The cold, silent hole was gone. Stiles had been cautiously optimistic.\n\n(“It’s only for a little while,” Dad tells him, pulling him from Mrs. McCall’s bed. He’s in his deputy uniform and he’s got a bottle of whiskey in one hand. “Do you remember your aunt Rose? She’s coming to pick you up.  It’s like an adventure. Like Sam Gribley.”\n\n\nMr. and Mrs. McCall are screaming at each other, somewhere else in the house.\n\n\n“You’re my Frightful,” Stiles whispers to little Scott, who’s hiding under the bed.\n\n\nScott lifts his dark mop of hair to reveal blood-red eyes and a mangled peregrine falcon in his mouth.\n\n\nDad shoves him down the hallway. “It’s only for a little while. You have to be brave for your dad. He loves you very much, but he’s going through a hard time and he can’t take care of you right now. Can you be brave for him, Stiles?”\n\n\nThey come to the stairs.\n\n\n“Be a hero, Stiles.”\n\n\nThen he’s falling down the stairs—he remembers his father pushing him—and he’s tumbling, banging, it’s all so dark, and he knows, he knows, he knows that when he opens his eyes he’s going to see Gerard—)\n\nHe wakes up on the floor of the Motel 6, heart pounding so hard he thinks it might break through his chest.\n \nThe noises Stiles makes during his nightmare wake Derek long before he feels the cautious poke at his arm. The acrid stench of bile and sweat and tears is nearly overwhelming now that Stiles is looming over him. He makes a face at it, because it’s fuck o’clock in the morning and Stiles’ puny human eyes won’t see it anyway.\nHe grunts in response to the poke.\n“Derek?” Stiles whispers.\n“What?”\n“I’m going for a walk.”\nDerek sighs. Very quietly.\nStiles bites his lip. “Just—don’t leave. Or something. I’m coming back. Unless I’m not back by noon, because then you should definitely go find my body.”\n“Fine,” Derek grunts, when Stiles continues to hover over him.\n“’Kay,” says Stiles. “Thanks.”\nDerek rolls over and buries his face in his pillow, which he promptly regrets, because even after four nights here the pillows still smell disgusting. A second later, he hears Stiles trip and brain himself on wall trying to find the door.\nThis is definitely going to end in death.\n \nDerek doles out Pop Tarts and Milk Chugs from the vending machine for breakfast. Stiles tries to give Derek money for it, but Derek just stares at him until he puts it back in his pocket. Cora can’t believe she’s related to such a dumbass.\nAfter breakfast, she pulls out her book of word searches and Derek pulls out whatever douchey novel he’s reading this week, and they settle in.\nStiles lasts an impressive thirty minutes.\n“Is this, uh, what you guys normally do?” he asks, sounding almost hesitant about breaking the silence.\nCora scowls at him.\nDerek, the fucking moron, looks amused. “I thought you were going to be quiet?”\n“Yeah, I will, just—I didn’t know if this was what you guys normally did, or if you were hanging around the room for me. Or something. Because if you are, you don’t… have to?” Stiles all but mumbles.\n“Not everything’s about you,” Cora says sourly.\n“This is what we do,” Derek tells him, and goes back to his book.\nStiles blinks. “Oh.”\nAnd that’s it. He goes back to staring listlessly at the wall.\n“You got a problem with that?” Cora demands, inexplicably irritated.\n“No,” Stiles says.\n“Liar.”\n“Yeah, well…” Stiles trails off, and there’s a tired pause before he eventually adds, “Your—face is a liar.”\n“Seriously?” Cora asks, eyebrow raised.\nThe corners of Stiles’ mouth twitch. “I thought it would go over better than a ‘your mom’ joke.”\nCora snarls, and Stiles flinches back a satisfactory six inches.\n“Children, behave,” Derek says, not looking up from his book.\nCora pulls her teeth back in, scowling, and goes back to her word search. She viciously circles the backwards LATVIA she found right before Stiles started being annoying. More annoying.\nOn the floor, Stiles pulls his hood up over his head and curls into a ball between their beds.\n \nLife on Derek and Cora’s Excellent Adventure is not… adventurous. It’s quiet. For the first time in his life, Stiles kind of likes that. He ends up borrowing a book from Derek—who is apparently an avid reader—and spends most of his first day with them reading and napping and feeling his muscles slowly relax. He does wish they weren’t in the desert, though, so he could go walking when it wasn’t night time, but they are and there’s no way he’s walking any distance in that heat.\nThe highlight of the day seems to be the dinner run. It’s ungodly hot outside when they set off, even though the sun is almost half-set, but Stiles gets the feeling that if he doesn’t go with them he’s not going to eat.\nOn the bright side, it turns out that the sunset is crazy beautiful in the desert.\n“So,” Stiles says eventually, and takes in a deep breath. “Derek. Thanks for the book, dude.”\nDerek glances at him. “You’re welcome.”\n“Didn’t take you for the type to read LGBT books,” Stiles continues. He hadn’t even bothered to read the back cover of The Mysteries of Pittsburgh, so boy had he been surprised when Arthur had suddenly started dating a man. There was even a sex scene. A butt sex scene.\n“I don’t,” Derek says, quirking an eyebrow at him. “I just read books.”\nStiles rolls his eyes. “Real deep, Derek.”\n“I don’t have to share my books with you,” Derek says.\n“See,” Stiles says, a hesitant grin coming onto his face, “I don’t even know if that’s a good thing or a bad thing, because your book stash is all books I’ve never even heard of.”\n“I would be surprised if you had,” Derek says.\n“That’s because you’re a total book hipster,” Cora pipes up, out of nowhere.\nDerek looks at her in surprise. “No,” he eventually says, with a hint of a smile. “I have eclectic tastes.”\n“Hipster,” Cora retorts.\nA car zooms past, and Stiles—who learned his lesson yesterday, walking to the motel—holds his breath and shuts his eyes, walking resolutely forward through the dust cloud. But he misjudges the curve of the road and stumbles into the rise of pavement.\nA hand catches his arm before he goes flying into the street, yanking him upright. His sneaker pulls away from the pavement coated in sticky black residue.\n“Gross,” Stiles says, staring at the melted asphalt in fascination. Then he looks up at Derek. “Uh. I mean, thanks.”\nDerek shrugs.\n“So, what’s for dinner?” Stiles asks eventually.\n“Pizza?” Derek says, looking to Cora.\n“Whatever,” says Cora.\n“We can get cheese,” Derek tries.\nCora shrugs.\n“Cheese is cool,” Stiles says after while, though Derek hadn’t ever looked to him for his opinion.\n \nStiles wakes him up for the second night in a row with his whimpers. Derek always wakes up when other people are having nightmares. It’s one of his least favorite things about himself, aside from his rabbit teeth and his tendency to fall for serial killers.\nJust like last night, Stiles eventually pokes him.\n“Derek. I’m going out again.”\nDerek is too uncoordinated from sleep to facepalm, so he just throws an arm over his eyes instead. “Is this going to be a nightly thing?”\nStiles doesn’t say anything for a minute. “Sorry,” he eventually mumbles.\n“You shouldn’t go walking around the desert at night,” Derek tells him, feeling inspired to say something adult-like in the face of Stiles’ uncharacteristic apology.\n“What, you think I’m gonna get mugged?”\n“I think you’re going to step on a nest of scorpions and die,” Derek replies.\n“I’ll be fine,” Stiles says, and when Derek doesn’t reply, he leaves. He doesn’t trip over anything this time.\nDerek can’t go back to sleep for a long time.\n \nThere are four phone numbers in Cora’s phone: Derek’s, Boyd’s, Scott’s, and AT&amp;T Tech Support. She used to have Uncle Peter’s, too, until Derek explained why everyone hated him nowadays.\n(She can’t bring herself to delete Boyd’s number, even though he’s dead and somebody else is using his number now. She tried calling it the night of the lunar eclipse when Derek wouldn’t wake up and Cora had felt like she couldn’t breathe. She hasn’t called it since.)\nIt had only been days after her rescue from the bank vault that Derek had taken her in to the store and told her to pick any phone in the store. She’d deliberately picked the most expensive one there. The old Derek would have taken her into a headlock until she cried for mercy or until Laura broke it up and told Derek off for beating up their baby sister—but this new Derek just nodded and signed a two-year contract for her.\nThe plan has international texting. Cora bets that if she promised to stay in touch, Derek would let her keep the phone.\nThen again, Cora bets that even if she didn’t promise to stay in touch, if she took off in the middle of the night without so much as a farewell, Derek would keep paying for the phone. He’s pathetic like that, now. Sometimes it’s all she can do to stop herself from grabbing him by the shoulders and shaking him. She learned how to be alone. Why can’t he?\nShe’s so fucking bored. She misses the estancia, and her horses, and when she only had the energy to do one word search a day.\nShe’s so very, very, very fucking bored.\n \nWhen Stiles wakes Derek up the next night, Derek surprises the hell out of him by rolling out of bed and grumbling quietly as he shoves his feet into his boots. They’re quiet as they wander through the desert, Derek occasionally pulling Stiles away from various deadly creatures hidden by the darkness (or so he claims).\n“What are you going to do about school?” Derek asks, after a long while.\n\"Summer school,” Stiles answers. “Or maybe I won’t have to. School’s been a total shit show, since, you know, half a dozen of our teachers are dead now.”\n“You’re welcome,” Derek deadpans.\n“Actually,” Stiles continues, after they walk a while longer, “if you’re looking for someone new to date, I’m pretty sure no one would miss Señora Himmelfarb—ow!”\n“Mosquito,” Derek says.\n \n\"Can I have your old crossword puzzles?” Stiles asks her on the fourth day of his invasion, after another sad lunch from the vending machine. “The ones that you’re done with, I mean.”\nCora narrows her eyes. “Why.”\n“’Cause I like to look for the words they accidentally put in the puzzle,” Stiles says, shrugging. “It’s more challenging that way.”\n“You’re an idiot,” Cora tells him.\nStiles grins, because her brother has clearly already ruined him. “So, can I?”\nAnd she’s about to say yes, because what the hell, when she realizes that she’s actually enjoying this.\n“No,” she says, scowling at him. “Go read your book.”\n“But—”\n“Shut. Up.”\nShe glares at him until he reluctantly returns to Embassytown.\nCora has no idea what the book is about, but she’ll probably find out when they walk to dinner tonight. Stiles and Derek have taken to discussing the books he’s reading then, if only for a few minutes. And she thinks the whole ‘nighttime stroll’ business is also becoming a habit for them. And this morning, when Stiles was curling up on the floor to take one of his naps, Derek had snapped at him to “Just use the bed, Stiles, you look pathetic.”\nStiles is insinuating himself, and it’s pissing her off.\nShe scowls down at her crossword puzzle and starts to look for BOJANGLES (should be easy, there’s a J), when suddenly Stiles closes his book with a snap.\n“You know what? No,” he says.\nOh, joy.\n“This is stupid,” Stiles announces. “You’re both stupid. Actually, no, that’s not my point—my point is that you’re both miserable, and for some reason you don’t seem to care. Every day here is the same. Neither of you are happy. It’s bizarre. And stupid.”\n“It’s not stupid,” Cora says haughtily.\n“Really,” Stiles says, looking unimpressed. “You’re going to tell me that you’re actually happy here? Neither of you are silently wasting away on your beds every day?”\n“No,” Cora says stubbornly.\n“Stiles,” Derek breaks in, looking gratifyingly annoyed. “We’re fine.”\nStiles flails. “Oh my God, aren’t the two of you walking lie-detectors? How is this shit flying? Why are you both such martyrs?”\n“If you’re unhappy, go home,” Cora suggests.\nStiles stares at her disbelievingly, and Cora resists the urge to eat his face off.\n\"Okay,” Stiles says, visibly centering himself. “Okay. Derek. Would you be unhappy if we packed up and got on the road? No, no, don’t look at Cora, this isn’t about Cora.”\nDerek shrugs.\nStiles turns to Cora, eyebrows raised. “Cora. Would you be unhappy?”\nCora shrugs.\nStiles throws his hands up. “Do you not see the problem here?”\nDerek hesitantly looks at Cora. “We could… try somewhere else?”\n“No,” Cora snaps, throwing her word search book down. “No, we are not going anywhere else. We’re just fine here.”\nShe stands, jams her feet into her sneakers, and marches toward the door.\n“But—”\n“Go home, Stilinski.”\n \nCora doesn’t come back for hours. Derek is restless and twitchy, irrationally pissed at Stiles, and when Cora finally stomps back into the motel room Derek understands why his mother had slapped him across the face for running away as a child. But if he’d expected Stiles to be apologetic, he’s not. Stiles goes to dinner by himself, because Cora says she isn’t hungry and Derek doesn’t want to leave her alone in the motel room, and he brings back a veritable feast of Indian food.\nIt’s the first time anyone has ever passive-aggressively eaten at him.\nWhen Stiles goes to bed, curled up on the floor between their two beds, Cora descends upon him.\n“Come on,” she says, tugging at his arm. “Or do you only take nighttime desert walks with Stiles, now?”\nDerek glares at her, before glancing at the sleeping Stiles. “We shouldn’t leave him alone. Or—we should leave a note.”\nCora stews as Derek writes out a message on the back of a receipt and then leaves it carefully next to Stiles’ head, along with his phone so Stiles can call Cora’s if there’s trouble. Just in case. Stiles is exactly the type of idiot who would wake up alone and run out into the desert to try to find them.\nWhen they walk, Cora doesn’t immediately speak. Derek wants to break the silence to ask Cora if she’s jealous, or when she started hating Stiles, but he’s pretty sure neither of those questions would go over well.\n“You shouldn’t let him guilt you into doing things,” Cora says eventually.\nDerek is thrown, and it takes him a few seconds to object with an incredulous, “That’s not what he’s doing.”\n“Maybe,” Cora allows. “But, Derek, this road trip is about you. What he was spouting off earlier about me being unhappy, that was bullshit, okay—I don’t know what the hell Stilinski cares anyway. He’s never given a shit about either of us before we were suddenly in charge of his entertainment.”\n“Cora—” Derek hesitates. He almost always says the wrong thing and all he wants in the world is to not drive Cora away. But he has to say it. He can’t keep it inside any longer. “Cora, the road trip isn’t about me, all right?”\nCora stops and stares at him. “Yes it is.”\n“It’s about us,” Derek says. “You and me. Stiles showed up, yeah, but I—what I want is—”\n“No,” Cora says flatly.\nDerek doesn’t know what to do with that. He doesn’t even want to start with that.\n“Do you… want get on the road again?” he asks instead, after a long pause and some quiet swallows.\n“It’s not about what I want, Derek,” Cora protests.\nDerek hates it when Stiles is right.\n“First thing tomorrow,” he sighs, “we’re pulling out the map and picking a highway to follow.”\n \n\n(“Where’s my dad?” Stiles demands, craning his head back.\n\n\nTara towers over him, hollow eye sockets staring straight ahead, a hand on either of his shoulders. “It’s only for a little while. You have to be brave for your dad. He loves you very much, but he’s going through a hard time and he can’t take care of you right now. Can you be brave for him, Stiles?”\n\n\nThe sheriff’s badge glints on her chest. It’s crushed and dripping with blood.\n\n\nShe’s the one who killed him.\n\n\n“It’s only for a little while,” Tara repeats, and pushes Stiles down under the water.)\n\n \nAfter a long discussion that mostly involves Stiles having opinions he isn’t entitled to, they decide to head north. Derek goes to gas up the Toyota, leaving her and Stiles alone to pack up the motel room. It’s blessedly quiet for a whole ten minutes before, of course, Stiles has to open his mouth. Cora bets he can’t wait to start rubbing it in her face that he was right.\nBut no. That isn’t it.\n“Are you jealous?” Stiles asks. “Is that why you suddenly hate me, because you think I’m, like, poaching on your territory?”\n“No,” Cora says.\n“Because seriously,” Stiles goes on, apparently impervious to her scowl now, “you had like six weeks on your own to bond with your brother, and—”\n“Listen, Stilinski, I hate you because my brother is on this road trip to get away from people using him, and you are ruining that,” Cora snaps. “Back the fuck off and let him heal.”\n“I’m ruining it?” Stiles asks incredulously. “Exactly what do you think you’re going to do to him when you take off in a week, or a month, or whenever it is that you’re planning to leave him?”\n“I’m not leaving,” she says stiffly, even though she is. She was. She wants to.\n“Uh-huh,” Stiles says.\nCora wants to punch him.\n“If you tell Derek—” she threatens.\n“I’m not going to,” Stiles says quickly, jerking back. “I won’t, oh my God, put the teeth away!”\nShe’s tempted to hurt him—to throw him around, dig her claws in, pound it into him that he will keep this secret—but she reels herself in and settles for a snarl.\n“Holy crap,” Stiles breathes.\nCora lets out a slow breath. She wants to demand to know how he knew she was leaving, and how he knew that she and Derek were miserable here, and how he knew where to find them in the first place, how he seems to know everything. But she’s not willing to give the little shit that much credit.\n“Why don’t you go home?” she demands instead, and when he opens his mouth she cuts him off. “No, I mean it, Stilinski. What the hell’s got you so scared? You faced down a pack of psycho Alphas and an evil druid chick and you didn’t even think of running. So what’s so bad there now that’s got you running?”\n“Zombies,” Stiles says petulantly.\n“Oh, I see. So that’s what’s been making you cry in your sleep every night?” she asks.\nStiles sucks in a breath.\n“At least when I leave Derek,” Cora says acidly, “I won’t be leaving behind a family member, or a packmate, or even a friend. Derek and I are nothing to each other. It would take a real selfish son to a bitch to leave all those behind.” She stares at him pointedly. “Wouldn’t it?”\n“Fuck off. You don’t know the first thing, you don’t know—you don’t know anything,” Stiles says, chest heaving. “And if you think you’re nothing to Derek, you’re a fucking dumbass, because Derek looks at you like you’re the center of the goddamn universe, all the time—”\n“Derek is nothing to me,” Cora spits, claws flying out, vision flashing red, “and whatever horseshit dreams he has about being a family again, they’re not my problem.”\nStiles gapes at her.\nEven Cora can’t believe she said it out loud. She’s been thinking it since day one but it sounds uglier hanging in the air than it ever did in her head. Worse is the way that Stiles is still staring.\n“Oh, don’t even,” she says hotly, forcing her claws back in. “Like you ever gave a flying fuck about either of us, back in Beacon Hills.”\n“Uh, excuse me?” Stiles says, flailing. “Yeah, you’re looking at the dude who saved your life, right here.”\nCora bares her teeth, advancing. “You took a bath, Stilinski. Derek saved my life.”\n“Yeah, no, I definitely gave you CPR while we were hiding out in an ambulance. These lips? Life-savers. Literally. And don’t even get me started on the number of times I’ve saved your brother’s ass.”\n“Fine,” she grits out, taking another step forward. “Fine. So I owe you, too. What do you want? Money? You wanna fuck me? I have it on good authority that a werewolf’s vag is—”\n“Oh my God, no, what the hell,” Stiles says, wide-eyed, tripping over himself in his effort to move backwards. “What the hellis wrong with you?”\n“Nothing,” Cora snarls.\n“Okay,” Stiles says incredulously. “But, you know, if you’re following through with that logic, you’re either gonna have to sex up Scott’s mom or take her on a road trip, too, because she totally restarted your heart when Dad and I brought you in to the hospital.”\nShe is so done with this.\n\"Just—shut up, Stilinski. God, you're such a child,\" she breathes, grabbing a shirt and furiously shoving it back into her duffle bag. \"Such a fucking child.\"\n\"We're the same age,\" Stiles retorts.\nCora snorts. \"We're really not.\"\nStiles makes a frustrated sound through his teeth, but takes his anger out on his clothes, violently packing up the rest of his things in silence. Cora zips the main compartment of her bag shut and disappears into the bathroom to grab her toiletries. When she comes out, Stiles is packing up Derek's things. Her anger abruptly fizzles out, leaving behind only the sickly taste of jealousy.\n \nFor the first time in days, Stiles feels restless. He doesn’t know if it’s because they’re finally in a car and going somewhere, or if it’s just an unlucky coincidence, but either way, he thanks his lucky stars that the Toyota is almost as much of a gas-guzzler as his Jeep was. The books are no longer doing it for him, and he keeps feeling the itch to turn on his computer. Which would be bad. So to distract himself, Stiles buys a handheld fishing game and fifty-pack of AA batteries at the first gas station they stop at.\nThe device is shaped like a real fishing rod handle, with the spinny thing on the side and everything. It even has cool sound effects—though Stiles only gets to use them for about two seconds before both Derek and Cora are threatening to leave him on the roadside if he doesn’t mute it.\nAt the next gas station, Stiles finds a racing game (“For Ages 5+”) that’s in the shape of a real steering wheel. He buys that, too.\n“You look like you should be in a car seat,” Cora says waspishly, glaring at him from the front seat.\n“I look like someone having fun,” Stiles replies, jerking his little red wheel to the left as he encounters a sharp turn on the race track. He’s not quick enough. His little racer spins out, and the wheel vibrates as he donuts over rumble strips.\nThe game actually is challenging, because the wheel isn’t the most responsive, but that just means it’ll be all the more satisfying when Stiles finally wins.\nHe restarts the race, this time prepared for the sharp turn at the end of the course, but he hasn’t even gotten halfway through the first lap when his concentration is broken by Derek’s phone ringing.\n“You shouldn’t answer your phone while you’re driving,” Stiles remarks, as Derek fishes it out of his pocket with one hand.\n“Werewolf,” Derek replies, and brings the phone up to his ear. “Hello?”\nStiles rolls his eyes, and makes a mental note to get Derek one of those I drive like a Cullen bumper stickers. He turns back to his game, in last place now, only to hear—\n“Stiles. It’s for you.”\nHis head shoots up. “W-what?”\nDerek stares at him via the rear view mirror. “It’s for you.”\nStiles forces himself to breathe. He wonders if Derek and Cora can hear his heartbeat, wonders if hearts get louder when they get faster or if that's just how it seems when it's your own heart inside your own chest. Stiles can hear his heart beating. And if Stiles can hear his heartbeat with his puny human ears, won't the werewolves be able to hear it?\nHe forces another breath. \"Who is it?\"\nDerek doesn't answer. He just holds the phone out, eyes on the road.\nStiles realizes that he's still gripping the toy steering wheel. When he releases it, his hands start to tremble.\nDerek's phone is heavy and expensive in his hand. Stiles’ own phone is—was plastic. Cheap. After the one he'd smashed in the gas explosion—his third phone in eight months—Stiles hadn't had the money or the optimism to buy another nice one. Derek’s phone, on the other hand, definitely cost a pretty penny. Stiles wonders if Derek is really that optimistic, or if he somehow has a lot of money to drop on phones. Neither seems likely. It's probably just another example of Derek being perpetually hopeless at long-term planning.\nHe finds it weirdly endearing, actually.\nBut. Right. The phone.\n\"Hello?\" Stiles says, feeling faintly sick.\n\"Stiles.”\nStiles chokes on air, not sure if it’s in relief or terror. \"Uh—Lydia. Hey?\"\n\"It's been five days,\" Lydia says crisply. \"I thought you at least would have checked in.\"\n\"N-no,\" Stiles says. \"I mean, yes! No, wait. I—\"\nIt hits him, then, the only reason that Lydia would be calling.\n\"What's wrong?\" he demands, heart suddenly in his throat. Images flash through his mind. Dad. Scott. Mrs. McCall. Allison.\n“You mean besides the fact that you disappeared into the night and haven’t sent us so much as a text message since?”\nStiles swallows. “So—so no one’s hurt? Everyone’s okay?”\nLydia sighs. “Yes, Stiles. Beacon Hills is still standing. Everyone’s fine.”\n“Oh,” he says, though his heart is still pounding madly. He doesn’t quite believe that. “Really?”\n“Yes,” Lydia says emphatically. “Now, tell me about you.”\n“My dad—”\n“Is fine. Tell me about you, Stiles. Are you feeling better?”\nStiles looks down at his jeans. “I’m fine. Been fine. Who said I wasn’t fine?”\nSilence.\n“Yeah,” Stiles admits, eventually. He’s speaking quietly, even though there’s no point. Derek and Cora will hear every word of this conversation. “It’s—I think I’m out of range. Or something. It’s not as bad, out here.”\n“I know I didn’t say anything,” Lydia says carefully, after another long pause, “but I did notice. I know what psychological torture looks like, Stiles.”\nStiles doesn’t say anything to that.\n“I just thought—” Lydia starts to say, but then cuts herself off with a frustrated huff. “No. Never mind.”\n“What? No, Lydia, this is so not your fault,” Stiles says immediately, sitting up straight. “One hundred percent not you. I left a note, I thought you guys would see—it wasn’t because of you, or Scott or Isaac or anyone, okay? It was my—I was—”\n“It’s fine,” Lydia says firmly. “Tell me more about you.”\nStiles exhales, recognizing a wall when he sees one. “Fine. But there’s not… much to say.” He casts around for a bit. “Did you know that Derek’s a book hipster?”\nCora snorts. Derek sighs.\nThat’s what they get for being nosy assholes.\n“Just because he reads something other than comic books doesn’t make him a book hipster, Stiles,” Lydia says archly.\nStiles smiles slightly. “They’re graphic novels, and you know it. Also, two words: Nicholas Sparks.”\n“At least those are actual books,” Lydia retorts.\n“No, I’m pretty sure they’re just snot rags in disguise,” Stiles says.\nLydia sniffs. “Please. Have you ever even read one of his books?”\n“Are you kidding me?” Stiles snorts.\n“Boys,” Lydia sighs. “But—you sound better, Stiles.”\nStiles swallows. “How did you know I was with—where I was? Does everyone know?”\n“It’s just me. And I guessed you’d gone to Derek because I knew you’d been keeping tabs on him since—”\n\"Lydia,” Stiles hisses, face flaming. His eyes go frantically to the front seat, where Derek is now staring at him with raised eyebrows in the rear view mirror.\n“Yes. Well, I have to go,” she says breezily. “I want regular updates from now on. At least every other day. Understand?”\n“Are you kidding me?”\n“I will full-name you, Stiles,” Lydia warns.\n“You don’t know my full name,” Stiles scoffs.\n“Oh? So it’s not Mel—”\nStiles hangs up.\n“Tabs?” Derek asks.\nCora’s turned around, watching him intently.\n“Yeah,” Stiles says, deflating. “Uh. Derek. Remember how you used my computer to set up your new phone after your old one died a sad, watery death in the school pool?”\n“You stalked him?” Cora demands.\nStiles exhales. “Okay, firstly, your brother has kind of written the manual on stalking. Maybe you weren’t aware. Secondly, I did not stalk you. It didn’t even occur to me until you guys took off, and even then I just… checked up on you. Once or twice.”\n“Freak,” Cora mutters, turning around, but it’s not as vitriolic as Stiles had expected.\n“I’m changing the password,” Derek sighs. “And give me my phone back.”\nStiles hands it over and settles back into his seat. The phone call comes crushing down on him, hard and fast.\nFuck.\nHe should have pressed Lydia for information about his father. At least to hear that he was eating okay, and happy with Melissa. If his father missed him. He should have told Lydia that it wasn’t her fault he left, that it was just his stupid ADHD brain making him more susceptible to the Nemeton than Allison and Scott. She should know better than that. It’s always Stiles’ stupid ADHD that’s fucking things up. Fuck, he should have asked about Lydia.\n“Hey, Stilinski,” Cora says.\nStiles looks up glumly.\n“What is your first name, anyway?” she asks.\nStiles snorts. “Hah. Sorry. Scott and my dad are the only people in the world who know it.”\n“It can’t be that bad,” Cora prods.\n“Oh yes it can,” Stiles says.\nCora gives him a skeptical look, but doesn’t press.\nStiles sighs, then forcefully pushes the phone call from his mind and grabs his racing game. This time, he makes the left turn.\n \nThey finally stop for the night in Big Arm, Montana. Cora keeps seeing signs for Wild Horse Island State Park, and it makes her ache for her girls back home. She wonders if Derek remembers her childhood obsession with Marguerite Henry. He used to tease her about it relentlessly.\nThe motel is built to look like a log cabin. There are moose on the bedspreads and the soap dispenser is in the shape of a black bear. It also shares a parking lot with a Denny’s, open twenty-four hours, so they grab an extremely late dinner there before crashing in the room. Or, at least, Stiles crashes. Cora waits until he drifts off, curled up on the floor between the two beds, then pulls Derek out for another late-night walk.\nDerek follows along silently, after he leaves his phone and a note for Stiles.\nShe walks toward the lake, the lake with the island with the horses, but doesn’t force the conversation. She doesn’t have anything in particular to say. She just—wants to be out here, with Derek.\n“You… okay?” Derek asks tentatively, after a long while. They’ve reached the shore by then, and are walking among the trees, following the lake south.\nShe nods.\n“We told Stiles a week,” Derek says, after another long while.\n“You told Stiles a week,” Cora corrects, before she can stop herself.\nDerek looks away.\n“Whatever,” she mutters. “He’s not that bad. He can stay however long he wants. Who are we, his parents?”\n“Not that bad?” Derek repeats incredulously.\n“Shut up,” says Cora.\n“Uh-huh.”\nShe whacks him on the arm and turns her gaze out to the lake, squinting. The moon is waxing, and she can see pretty well across the water, to where the island is. Derek doesn’t ask her why she’s suddenly changed her mind, but her conversation with Stiles this morning is rolling around her head anyway.\nIt’s a long while before Cora finally feels settled enough to lead them back to their motel. When she buries herself under the moose bedspread, she falls asleep almost instantly.\n \nAfter he gets back from his walk with Cora, Derek barely gets the chance to drift off before he hears the beginnings of a nightmare from Stiles. Resigning himself to not sleeping just yet, Derek rolls onto his stomach and casts a hand down, rooting around until he finds a shoulder, and then gives Stiles a rough shake.\nStiles jerks upright and gasps, pants harshly, and when Derek raises his head Stiles is staring at him with wide eyes.\n“Thanks,” Stiles whispers, when he’s calmed down.\nDerek takes in a deep breath, and tries not to sound too long-suffering when he asks, “Walk?”\n“Yeah,” Stiles breathes. “Yeah, that’d be great.”\nSo Derek once more pushes away the exhaustion from driving fifteen hours, writes a note for Cora, puts on his boots, and at the last minute yanks his leather jacket out of his duffle bag. He shoves it at Stiles before he opens the door.\n“I’m good,” Stiles tells him, fingering his hoodie.\nNot even halfway across the parking lot, Stiles starts to shiver. For a moment Derek thinks about being an asshole and putting the jacket on—three months, ago, he would have—but now, he just holds it out and waits silently as Stiles puts it on.\n“Thanks,” Stiles says, jamming his hands into the pockets. “Guess I didn’t really plan for Montana in November when I was packing.”\n“What did you pack for?” Derek asks.\n“Getting out.”\nDerek hangs a right on the road, the direction that will take them away from the lake. It would be too weird to retrace the path he and Cora had taken with Stiles.\n“I mean, like,” Stiles continues eventually, “I’d totally done the research. It’s kind of my hobby—planning things, I mean. When I can’t sleep or whatever. Like, I could give you a detailed description of how to go about becoming emancipated. Or what I would do to survive if a tsunami hit Beacon Hills. I planned how to run away years ago. But. When I thought ‘pack for all varieties of weather’, I guess I just thought… ‘pack for all varieties of Californian weather’. Kinda dumb, I guess.”\n“You knew to leave your phone behind,” Derek offers. “To take cash.”\n“Yeah, I’m a regular Jason Bourne,” Stiles mutters. “Only with ADHD, for added fun times.”\nDerek just barely keeps himself from looking over at Stiles. He has never, in ten months of knowing him, heard Stiles mention his ADHD. Derek only knew because he’d made a comment back in June and Scott had gone off on him.\n“What are you doing about Adderall?” he asks instead. “What’s your plan for that?”\n“Can we just—not talk about it?” Stiles asks.\n\"You were the one who started rambling,” Derek points out, rather shortly.\nStiles huffs. “Yeah, well. Let’s talk about you, huh?”\n“Let’s not,” says Derek.\n“No, let’s,” Stiles insists. “C’mon, man. We’ve been bonding and shit.”\nDerek carefully inhales, then exhales. “Stiles.”\n“No, dude, seriously. You’re all quiet and literary and stuff out here, and at first I was like, ‘Whoa, what universe did Bizarro!Derek step out of?’—well, no, first I was kind of a wreck and didn’t even notice you being weird. But then I did. And now I don’t know if the whole colossal asshole thing was just a Beacon Hills… thing, and this is what you’re really like? Or if you’re just switching the asshole off right now because you’re recovering or whatever? Or—or something else? Mega-confusing, dude.”\n“It doesn’t matter.”\n“Duh.” Stiles flaps a hand at him indignantly. “Of course it does. You just had the most traumatizing two months—nine months, really—six years—okay, so basically, you’ve had the most traumatizing life in the history of ever, and we all thought, you know, you were going on this big Road Trip of Healing. That’s how Scott sold it, anyway. And I’m just saying, it seems like you’re really—”\n“We’re not talking about this.”\nDerek hasn’t wanted to examine the way he feels about Stiles, why he let him stay, why he’s been going on these walks, why he feels the ever-increasing draw to protect, but right now it makes him sick. Stiles makes him sick. He can’t take this, not now. \n“But—”\n“Stiles, I am tired, and I am not doing this right now,” Derek says, trembling and barely keeping it out of his voice. “You can either shut the hell up, or we’re going back to the motel and I’m going to bed. Which one is it going to be?”\nHe can’t even wait for the response. He just starts walking, strides long and furious.\n“Hey, hey, hey!” Stiles says, jogging to catch up. “Oh my God, dramatic much? All you had to say was ‘Stiles, be quiet.’”\n“Be quiet,” Derek orders.\n“Zzzppp,” Stiles says, zipping his lips shut.\nDerek breathes deep, but it doesn’t relax him. In fact, it takes him almost a mile before he finally starts to feel the tension ease, and it has absolutely nothing to do with the fact that that’s just about when Stiles silently links their arms together.\n \nThere’s a weird, silent moment of communication with Stiles around six in the morning, when Cora raises her head and sees him handling Derek’s phone. For a moment, she thinks he’s stealing it, but then he sees her and pointedly turns the phone so that she can see it’s on the alarm screen. He makes a show of turning the alarm off, putting the whole phone on silent, and then points to a sleeping Derek.\nShe nods, gets up and quietly closes the curtains, then lays back down to go to sleep.\nThey pass the morning silently. Stiles is reading another one of Derek’s douchey books—this one with a creepy lime-green eye on the cover. The title is too small for her to read from a distance, but whatever it is, it apparently requires turning the book upside down every other page. At one point, he takes a nap. Unlike his first few days, where he’d slept at least half the day, Stiles has now weaned himself down to only a morning nap. Cora alternates between watching TV on mute with closed captioning and playing mindless games on her phone. Derek sleeps on, quiet and unmoving.\nShe doesn’t like looking at Derek like this. It’s fine when it’s night and the room is dark, because then the situations are separate in her head, but right now all she can think of is what Derek looked like the day he had to go and save her life. He hadn’t woken up for hours. She’d had Peter whispering in her ear and no Boyd and the ever-preset knowledge that Derek might die because of her.\nCora owes Derek her life. She knows that. That’s why she’s here.\nBut does he have to lie so still?\nWhen noon passes by and Derek is still sleeping, Stiles mimes that he’s going for food. She hands him a ten with a list of requests, including Derek’s favorites. Stiles comes back with almost more food than he can carry, and a two-inch stack of brochures in one hand. Literally, it’s two inches thick.\nThe floor space between their beds quickly becomes a mosaic of brochures, sorted into piles that make no sense to Cora.\nDerek finally wakes up around two, blinking muzzily at the Stiles and Cora. He has some truly spectacular bed-head going on.\n“Good morning, Starshine,” Stiles says.\nDerek grunts, rolls out of bed, and stumbles into the bathroom.\nCora glances at Stiles, who shrugs. She shrugs back. She’s pretty sure this is actually a good thing, though she doesn’t say that out loud. Once upon a time, when Derek would come down the stairs in the morning, Mom would always smile fondly and say, “Oh, look, the caveman lives,” and Derek would grunt and glare, and everyone would laugh.\nThis is the first time since then that she’s seen Derek do anything other than spring from bed, expression grim and muscles tense. So. It has to be a good thing. Right?\n \nDerek comes out of the shower feeling loose and awake, which is unquestionably strange. Judging by the hopeful looks Cora and Stiles subtly give him when he comes back into the room, they definitely conspired about this. He hopes the cessation of hostilities isn’t a temporary situation. It’s kind of nice that they’re getting along, even if he suspects that it’s mostly out of apology.\nStiles has procured at least five dozen different pamphlets for things to do in the area, and it takes Derek a moment to remember the literal wall of them that had been in the motel’s lobby.\n“I take it we’re staying here another day?” Derek asks, as he studies the multitude of stacks Stiles has sorted them into.\n“It’s so awesome here!” Stiles says happily, looking up from his piles. “I didn’t know there were actually things to do in Montana, but they’ve got, like, cherry picking and scenic drives where you can see glaciers, and snowshoeing.”\n“I think snowshoeing requires snow,” Cora says dryly.\n“And if you go hiking here, you have to watch out for bears and moose. Like, they actually cross the trails and stuff. Did you know they have pepper spray for bears? I wonder if it would work on werewolves. Oh my God, wait, wait, wait—who would win in a fight, a werewolf or a bear?”\n“The werewolf,” Derek says, “because he’d feed his annoying human to the bear and then run away while it was distracted.”\nStiles sticks his tongue out at him.\n“We got you lunch,” Cora says, pointing to a pile of vending machine items on the table.\n“I got you lunch,” Stiles corrects.\n“I paid,” Cora says, rolling her eyes.\n“Yeah, with money from Derek’s wallet.”\nDerek tunes out their bickering and opens the bottle of cranapple juice.\nAn hour later, Stiles has persuaded them to drive up to Glacier National Park, mostly because Stiles wants to stand on a glacier (“Or lick one! I’d totally lick a glacier! It’s got to be good luck, like the Blarney Stone!”). Derek doesn’t think that you can actually stand on glaciers, not without a helicopter or something, and he’s pretty sure they’re not something you’d want to lick, but he’s not going to be the one to crush Stiles’ dreams.\n \nWhen the seventh day dawns, Stiles doesn’t say anything about going home. Neither do Derek or Cora. He spends the whole day on edge, until night falls and Cora mentions that Yellowstone would be a good place to spend the upcoming full moon, and Derek looks to Stiles to ask if he’s okay with that.\nStiles is so, so okay with that.\nBefore they leave the next day, they stop at Goodwill. Derek donates the books that he and Stiles have read and buys a few new ones. Stiles finds a warm jacket of his own so he can stop stealing Derek’s, and a massive binder of mix CD’s with no track listings and totally nonsensical labels. There’s one titled Lawrence of My Labia. Stiles needs to know what music is on that CD like he needs to breathe.\nCora buys The Complete Book of Baby Names, and when they get in the car, she joins him in the backseat.\n“My fishing game has a two-player mode,” Stiles tells her, as Derek starts the car.\n\"Don’t be an idiot. I’m sitting this close so that I can hear your heartbeat,” Cora says witheringly. Then she opens The Complete Book of Baby Names.\n“Are you going to go through that whole book?” Stiles asks, horrified.\n“No,” says Cora. “I heard Lydia say the first syllable. This shouldn’t take long at all.”\nStiles doubts his name is actually in there, but peers curiously at the pages as Cora flips to M. When she gets to the Mel section, Stiles catches a glimpse of where his name would be, alphabetically, but is luckily not.\nWhew.\n“Stiles,” Cora says. “Is your name… Melancton?”\n“No,” says Stiles.\n“Melanion?”\n“No.”\n“Melbourne?”\n“No.”\nStiles also turns down Melchior, Melford, Mele, Melik, Melker, Melor, Melrose, Melun, Melville and Melvin, all with a steady heartbeat.\n“It has to be one of these,” Cora says, scowling at him. “What other Mel names are there?”\n“Told you it was bad,” Stiles says smugly.\n(Though, he’s not gonna lie, if he’d been given any of the names Cora had just listed off, he’d probably still go by Stiles. They’re not as bad, but damn, they’re still bad enough.)\n“It might not be M-E-L,” Derek offers from the front. “It could have been Mal, Mil, Mol, or Mul. Cell phones distort sounds.”\nCora brightens, and immediately starts flipping to a new section of her book.\n“Thanks, Derek,” Stiles says sarcastically.\nDerek grins.\n \nIt turns out that getting a motel at seven o’clock in the evening near Yellowstone is easier said than done. It takes them over an hour to finally find one with a room, and the manager warns them that the room is booked the following night and he’ll be double-charging them if they stay a minute past eleven. Derek doesn’t trust himself to reply to that without losing the room, so he just takes the key with a nod.\nThe room is cold. Derek turns the heat on and hopes it’ll warm up quickly.\nHe waits until after they’ve eaten dinner and are walking home, Cora between them, before Derek says to Stiles, “So, you haven’t talked to Lydia since she called on Monday.”\nHe says it very casually, non-confrontationally. He’s been working on it since they crossed into Wyoming, debating the merits of I-statements and waiting for the right time to bring it up.\n\"That was Monday?” Stiles says, startled. “Oh. Yeah. I guess it was. Weird. How do people know what day it is when they’re not in school? It’s like they’re all the same.”\n“I think you should call her,” Derek says carefully. “She asked you to.”\n“Maybe,” Stiles says.\nCora smacks him on the arm. “Call her, dickface. She’s worried about you.”\nStiles snorts. “Oh, yeah. That’s rich, coming from you.”\n“Shut up,” Cora snarls, jerking toward him, but Derek catches her wrist and pulls her back.\nStiles sticks out his tongue at her.\n“I thought you two were getting along, now,” Derek sighs, though mostly he’d just been hoping.\n“We are,” Cora says, “when Stilinski isn’t being an immature little asshole.”\nStiles glares at her. “I have a first name, you know.”\n“Oh. Do you?”\n“Yeah. Stiles. Sti-les. Say it with me.”\n“Ugh,” Cora says, disgusted.\nStiles doesn’t call Lydia.\nWhen they go to bed, the room is still cold despite the heater working at full blast, so Derek gives Stiles the comforter from his bed (these are thankfully plain green and moose-free, although Derek is dismayed to discover that the underneath it are fuzzy flannel sheets printed with little grizzly bears). Stiles looks at him in surprise for approximately half a second, before snatching the blanket and practically swaddling himself.\nOn their walk that night, following a nightmare from Stiles, Derek finds himself mumbling out before he can stop himself, “You really should call her.”\nStiles sighs. “Really, dude? You’re Mr. Passive over everything on this trip, up to and including what toppings we get on our pizza, and this is the one thing you decide to push?”\nDerek opens his mouth.\n“Don’t even deny it,” Stiles snaps, glaring at him in the darkness. “It’s like you’re terrified that if you say you want pepperoni—which I know you do, I know what you like on your pizza—the pizza dude will accidentally chop off his hand in the middle of slicing it and bleed out on the floor of the kitchen. Newsflash: the pepperoni comes pre-sliced. You can ask for it. You won’t accidentally kill anyone.”\nDerek breathes through that for a few minutes, because he knew Stiles was an asshole when he started this conversation. All teenagers are. They’re too wrapped up in self-discovery and their own invincibility to conceive of anything else.\nEventually, he sighs heavily and says, “If you call her, I’ll let you listen to that stupid CD in the car. The Lawrence one you were bothering me about.”\nStiles almost trips over his own feet. “Oh my God, really?”\n“One track for every phone call,” Derek says.\n“How about text messages?” Stiles tries, after a beat.\n“How about if you don’t call her, I’ll snap the CD in half?” Derek replies.\n“You’re an asshole,” Stiles complains.\nDerek raises an eyebrow at him, despite the fact that Stiles can’t see it, and refrains from pointing out the obvious.\nEventually, Stiles groans and kicks at a pebble. “I don’t want to.”\nDerek sighs.\n \nCora calls Lydia that night, when Derek and Stiles are out.\n“Stiles?” Lydia answers groggily, though it’s only just past midnight back in California.\n“It’s Cora,” she says shortly. “Stilinski is being a little bitch about calling you. I thought you’d appreciate knowing that he’s alive.”\n“Excuse me?” Lydia asks, her voice sharpening into something cold and hard.\n“Alive,” Cora repeats. “Of the living. Not dead.”\n“Yes, thank you, I heard. I was more concerned that you apparently feel qualified to call Stiles a ‘little bitch’, meaning not only that you are arrogant enough to judge someone else for the way that they cope and recover from extreme trauma, but also that you are under the delusion that applying the word ‘bitch’ to a man somehow strips it of its inherent misogyny.”\nWell. Lydia sure wakes up fast.\n“Whatever,” Cora says, rolling her eyes. “Next time I won’t call.”\n“The calls aren’t for my benefit,” Lydia says witheringly.\nCora scowls. “Aren’t you—he left you. He left everyone.”\n“He had reasons.”\n“What about his dad?” she challenges. “Isn’t he worried?”\n\"His dad is drowning himself in alcohol and guilt.” Lydia’s tone is cool and clinical. “That isn’t Stiles’ fault, and it certainly isn’t a reason for him to come running back, so don’t you dare tell him.”\nCora only met Mr. Stilinski for about thirty minutes, and she was pretty woozy for most of it, but she doesn’t like the image that Lydia is painting. At the same time, though, it gives her a surprising amount of satisfaction. She doesn’t like that either.\n“Didn’t he leave because of his dad?” she asks.\n“He thinks he did,” Lydia replies.\n“What does that mean?” Cora demands.\n“Oh, I’m sorry,” Lydia says. “I wasn’t aware you cared about the ‘little bitch’.”\nShe doesn’t. She definitely doesn’t.\n\"Well—how come you’re not mad?” she asks, pressing onward. “Stiles left you. He just took off and left, abandoned all of you, and it’s like you don’t even care.”\n“I love Stiles,” Lydia says plainly.\n“Exactly.”\n\"No, you’re not listening,” Lydia says sharply. “Stiles is my friend and I love him, and I want what’s best for him. Of course I was upset when he left, but what’s more important is that he heals, and that he’s happy.”\nCora grits her teeth. “But how can—”\n\"This conversation is over,” Lydia interrupts. “Unlike you, I have school tomorrow, and need to sleep. Good night.”\nShe hangs up before Cora can get in another word.\nCora scowls at the END CALL screen. She doesn’t know why she’d thought that would be anything other than a waste of time.\n \nThe following morning, Stiles calls Lydia, only to remember when he gets her voicemail that it’s Thursday and she’s in school.\n“I called!” he protests, when Derek does not let him play the first track on Lawrence of My Labia anyway. “You said call. I called.”\n“Doesn’t count,” Derek replies.\n“No fair,” Stiles whines.\n“Shut up, Stilinski,” Cora says.\nStiles rolls his eyes. “Oh my God, can you say anything else?”\nShe’s been particularly grouchy this morning, reminiscent of their desert days, for no apparent reason. Maybe the upcoming full moon.\n“Shut up, or you’re sleeping outside tonight,” Cora replies.\nStiles is at least seventy-five percent sure that Derek wouldn’t let her do that. Seventy percent sure. Stiles was kind of an asshole to him last night, possibly, so Derek might take some passive-aggressive revenge.\nBut, see, that’s Stiles’ whole point! The old Derek would have just ripped his throat out, or punched him, or at least shoved him to the ground last night. Bizarro!Derek is passive-aggressive. Not that Stiles wants to be punched or anything, but it’s not… natural. Just because Derek’s been hanging around quietly in the background while Stiles and Cora loudly and dramatically deal with their issues, doesn’t mean he’s fine. If anything, Derek’s the one who should being loudly and dramatically dealing with his issues. If issues were dollar bills, Stiles and Cora could retire comfortably at age seventeen. Derek could probably buy out NASA.\nOkay, that’s probably hyperbole. But that doesn’t mean he isn’t right.\nStiles stews about this for the rest of the drive to their next motel, which unfortunately isn’t very long, so he doesn’t have nearly enough time to get himself worked up into a good old-fashioned strop.\nThey have their new motel room for three nights. It was the only one in the area that had a room open, and it was a single king bed instead of two queens like they had been getting, but three nights is more than enough time for the full moon to come and go, so all in all they got pretty lucky. Assuming Cora and Derek don’t claw each other to death in their sleep or something.\nStiles is so glad he sleeps on the floor.\nDerek’s phone doesn’t get great service in the park, so it isn’t until they’re coming back into town for dinner that Lydia’s missed call comes up on Derek’s phone. Derek doesn’t say anything, just passes the phone back to Stiles and turns into the parking lot of a pizza place.\n \nIt’s a fancy pizza place—and by fancy, Derek means the floor isn’t sticky and the cups aren’t plastic. He’s not a pizza elitist. Laura had quickly adopted New York City cuisine snobbery, from the pizza to the bagels to the tap water, but the pickiest Derek will get is stating that if given the choice he’d prefer a Chicago-style pizza to a New York-style.\n“Wooow,” Stiles says, looking over the menu. “What’s reggianito?”\n“Cheese. From Argentina,” Cora says. She wrinkles her nose at the menu. “Ew, crab.”\nStiles squints at the bottom of the menu. “They import their tuna. Who imports tuna?”\nDerek wonders if there’s anything this restaurant doesn’t import, right before he sees the pizza with bison meat.\n“These are really weird pizzas,” Stiles says, flipping the page.\n“They’re are all douchey and gross-looking,” Cora complains.\n“What? No, we should try one!” Stiles argues.\n“Yeah, let’s spend money on food we’ll probably hate,” Cora says. “Great idea.”\n“We don’t have to get one of the specialty ones—we can build our own,” Derek interjects, as he notices their server giving them a pained look from across the room. “We could just… get pepperoni.”\nStiles perks up, and after a moment, grins tentatively at Derek.\nDerek feels a flush creeping up the back of his neck.\nBut then Cora butts in with a wrinkled nose and vehement, “No way. I hate pepperoni. Can we just get cheese?”\nStiles glares at her. “Hey, if Derek wants to get pepperoni, you—”\n“It’s fine,” Derek interrupts, staring at Cora.\nShe glares at him and looks back down at her menu, but Derek has been learning to read her and he knows she’s pleased with herself.\n“But—”\n“Cheese is fine,” Derek says firmly, unable to help the small smile tugging at the corners of his mouth.\nCora kicks his foot gently under the table.\nDerek kicks back.\nStiles sighs and slumps back in his seat. “You guys are so boring.”\nEventually, Stiles leaves to go call Lydia back while they’re waiting for the pizza to cook. Derek nudges Cora and says smugly, “I knew you still only liked cheese.”\n“Yeah, yeah,” Cora mutters.\nOutside, he can hear Stiles complaining to Lydia about unadventurous eaters, and it makes him grin even wider.\n \nThe room only has one bed.\nAs they’re changing into pajamas, Cora makes the executive decision that Stiles will not be spending the night on the floor. She remembers being relocated into the guest room with Derek and Laura whenever Dad’s siblings would visit, the three of them squishing into the tiny queen bed for nights on end, Cora relegated to the middle because she was the youngest.\n“Stilinski,” she barks, when Stiles comes out of the bathroom, jabbering on about the wolves that apparently live in Yellowstone, and whether Derek and Cora will commune with them during the full moon.\n“I have a first name,” he says.\n“And if you tell me what it is, I’d be happy to call you by it,” Cora replies.\nStiles rolls his eyes. “I bet I’m even in your phone as Stilinski.”\n“You’re not in my phone, idiot,” Cora says.\n“What? Why not?” Stiles looks betrayed.\n“You don’t even have a phone anymore,” Cora reminds him, irritated.\nStiles pauses, his face blanking. Then he blinks, visibly pulling himself back together. “Yeah,” he says. “Well, if I get one again. You’ll be getting my number.”\nCora feels bad, which mostly pisses her off, but she tries to bite it down. “Sure. Whatever. You’re sleeping in the bed, tonight.”\nDerek turns his head to stare in time with Stiles. It’s hard to say who looks more incredulous.\n“Derek kicks,” Cora says, shrugging.\n“I kick people who snore in my ear,” Derek retorts.\n“I don’t snore,” Cora insists. “And even if I did, it’s no reason to kick me. So you can kick Stiles.”\nDerek sighs.\n“Do I get a say I this?” Stiles asks.\n“Do you want to sleep on the floor?” Derek asks, raising his eyebrows at Stiles.\nStiles makes a face.\n“All right, then,” Derek says.\nThey pile in, Derek closest to the door because he’s a paranoid freak and always has to be in the bed closest to the door (as she’d eventually figured out, after she’d spent four nights in the bed closest to the door in a motel in Arizona and kept waking up to an increasingly sleep-deprived Derek). Cora rolls away from them both, facing the wall. Behind her, she can hear Derek and Stiles arranging themselves, Stiles’ heart beat pounding fast in her ears.\n“Dude. If you kick me,” Stiles whispers into the darkness, “I’m gonna kick you back.”\n“I’m not going to kick you.”\n“But if you do—”\nGo to sleep, Stiles.”\n“I’m just saying…”\nCora kicks him.\n“Ow!”\n“Shut. Up.”\n“I’m going back on the floor, if this is how I’m going to be treated.”\n“You’re going outside, if you don’t shut your mouth.”\nThere’s shifting behind her, the dull thud of bone on bone, and then suddenly Stiles’ heart is beating double-time. She wonders what her brother’s done to him (smothering comes to mind), but whatever it is, it’s shut him up, she’s not going to roll over on the off chance that it gets him started again.\n \nStiles wakes up in a tangle of werewolf limbs, morning wood fully engaged, and that’s so radically different from how he’s woken up for the past… ever… that it takes him a moment to realize that he’s waking up and it’s morning and he has only a vague memory of a nightmare last night that had ended in shushing and quiet murmurs and the feeling of safety.\nAnd, dude, erection. He hasn’t had felt his dick stir in weeks.\nOf course the first time he’s horny in two months, he’s in cramped quarters with two werewolves. Ugh. His life.\nHe knows that he should try to force it down, think nasty thoughts and all that, but—but it’s like the first green sprout of life poking its way out of a volcano-ruined landscape. His body is saying, look, we’re healing, there’s life in here still! How could Stiles destroy that? It would be cruel.\nStiles disentangles himself from Derek, who has turned out to be quite the sleep-cuddler, and Cora, who starfishes and doesn’t care who or what her limbs end up on top of, and stumbles off to the bathroom. He’ll turn on the fan and get in the shower, and that’s as much courtesy as the werewolves are getting this morning. Stiles has an orgasm to enjoy.\nIf he were older, he’d probably be able to take his sweet time with it. He’d really milk it, play with his balls, finger himself, bring himself to the edge and then back down three or four times, work his body into a dizzying fervor until he was simply overcome.\nBut Stiles is seventeen and hasn’t masturbated in weeks. It takes him about three pulls before he’s coming in long, white ropes that spatter against the shower wall with quiet thumps. As he comes, images of Derek’s smile, the feel of Cora’s leg between his thighs, the sharp sting of stubble burn on his neck against the hot water of the shower, fly though his mind.\nHe tries not to think about it, afterward.\nIt’s not like Stiles hasn’t masturbated to people he knows, before. It’s not like he hasn’t masturbated to thoughts of Derek, or Cora, before. So why does he feel so dirty right now?\nMaybe it’s because they’ve been so nice to him on this road trip, letting him know them in a way that makes objectification uncomfortable, now. It’s what had happened with Lydia.\nMaybe it’s because he thought of them both in the same session.\nMaybe it’s because they’re right outside the bathroom, and can probably hear him.\nStiles cups his hands together, collects water from the shower spray, and splashes it against the wall so it runs down and washes his come down to the bottom of the shower, and down the drain. He uses the motel-provided shampoo and conditioner, but steals some more of Derek’s body wash, because using a bar of soap makes his skin feel tight and dry, and Derek has nice shower gel. He has nice hair products, too, but Stiles feels that using those might be crossing some sort of line.\nWhen he steps out of the shower, he realizes that in his erection-induced excitement he forgot to take today’s clothes into the bathroom. He debates for a moment, but eventually decides to head out in a towel to fetch them and hope that Derek and Cora are still asleep.\nNo such luck.\nCora is waiting outside the bathroom, clothes in a bundle against her chest, and as soon as Stiles steps out she’s shoving past him.\n“No, wait—”\nShe shuts the door.\nBalls.\nStiles turns around, clutching his towel, to see that Derek is also awake, sprawled out on the bed with one lazy eye cracked open to stare at him. His shirt has ridden up, displaying about two inches of his happy trail.\n“Morning,” Stiles says, knowing his face is heating.\nHe’s getting hard again. Shit. Why had he been happy about regaining his ability to get aroused, again?\nDerek grunts and rolls over, planting his face into the pillow. The spot where Stiles had slept.\nStiles really needs to stop looking at Derek. He needs to not be hard. He needs to think of dead kittens, and Finstock in a bikini, and his dad—\nHis dad.\nWell, that certainly does the trick. The wave of sickening guilt and sorrow that crashes over him at the thought of his father is so powerful that he almost physically flinches back from it. God, his dad. It’s been creeping up more and more on his mind that maybe he was wrong, maybe he’d jumped to conclusions, maybe he’d—\nHe can’t think about that. If he starts thinking about it, he’ll go back to Beacon Hills, and the thought of going back there…\nNo. Just. No.  \nStiles changes his clothes mechanically, forcefully running through Fifty Nifty United States over and over in his head as he does.\n                                                                                                                                                              \nDerek doesn’t know if it’s the full moon, or the fact that he had an almost-uninterrupted sleep last night, but when he eventually stumbles out of bed and starts to wake up in the shower, he realizes that he feels like running. Not away from or toward something. Actually, what he wants is to run with Stiles and Cora, and for a moment he wishes he could be an Alpha again so that he could make Stiles a wolf, so they really could all run together.\nNot that Stiles would agree to the bite.\nOr maybe he would, now. He’s different than he was nine months ago, different even than he was before Derek left Beacon Hills. Derek could tell him that what had happened in Beacon Hills wasn’t what it was really like to be a werewolf. It was better. Stiles could stay with him and Cora, on the road, pack, until they found some place to call ho—\nBut it doesn’t matter. Derek isn’t an Alpha anymore.\nStiles wouldn’t say yes, even if he was.\n \nCora spends the first hour at Yellowstone trying not to hum Journey’s Open Arms. It’s all Derek’s fault. The idiot apparently bribed Stiles into calling Lydia by promising Stiles a track of one of his stupid mix CD’s for every time he called her, which Cora definitely would not have agreed to, and now she’s stuck with the corniest love song of the eighties—and that’s saying something—on repeat in her head.\nBut then Old Faithful goes off, shooting a good thirty meters into the sky, and even Cora can admit that’s pretty fucking badass.\nThey’re coming down off one of the boardwalks, into a trail that bisects a grassy valley, when out of nowhere Derek grabs both her and Stiles by the collar and yanks then to a stop.\nCora glares. Stiles gags and flails, and then opens his mouth to probably start on a diatribe about abuse of humans, but Derek claps a hand over his mouth and jerks his head to the left. They both turn to see a gigantic moose standing about twenty meters away, staring straight at them. Its antlers must be a meter and a half wide.\nOr maybe it’s an elk. Or a caribou. Are they all the same thing? It’s probably a moose.\n“Cool,” Stiles breathes, when Derek lowers his hand.\n“It won’t come closer,” Derek says quietly. “It can sense that we’re predators.”\nWell, it can sense that Derek is a predator, anyway. Cora learned a long time ago how to not only quiet that part of her so she could work with The animals, back on the estancia, but how to call them to her.\nShe turns to Derek, a spark of excitement leaping in her chest, and says, “Stay here.”\nThen she takes Stiles’ hand and pulls him forward.\nThere’s some silent communication between Stiles and Derek, where Stiles stumbles and looks back and Derek gives some nonverbal reply, but Cora isn’t watching and all that matters is that in the end, Stiles follows her and Derek stays.\nThe moose watches them as they take slow, cautious steps forward. It’s truly massive, with huge dark eyes and a fat belly that give it the illusion of stupid slowness. Cora’s been to bull fights before. She knows better. And she’s painfully aware of Stiles’ hand gripping hers. But, she’s spent the last five years hiding herself from animals she worked, lived, and occasionally slept in the stalls with, and she’s confident that she can do this.\nThere’s ten meters between them and the moose when she stops.\nI am not a predator, she thinks, breathing in air and willing herself to become like it. I am a friend. I am like you.\nMinutes pass in silence.\nCora is patient.\nThen Stiles’ heartbeat kicks into overdrive, and the moose is moving toward them. Cora grins and squeezes Stiles’ hand.\nIt’s past mating season but too early for calving season, and while she doesn’t think moose hibernate, they’re at least preparing to settle in for a long, slow winter. From the easy gait the moose is taking, she bets moose are just as friendly as cows once you stop coming off as a predator. She’s good with cows.\nThe moose stops a meter away from them.\nCora holds out a hand. The moose pauses, then leans forward to sniff it.\nStiles has stopped breathing.\nYeah, she’s just showing off, now.\n \n“Oh my God,” Stiles says, when they’re safely back on the boardwalk. “Oh my God, that was not natural. You’re like werewolf Snow White.”\nCora looks pleased.\nDerek is frowning, arms crossed over his chest. “How did you do that?”\n“Practice,” Cora says, and tugs his arm. “Come on. Jealousy isn’t a good look on you.”\nDerek scowls.\nStiles is mostly just glad that he didn’t get skewered.\nCora practically skips down the path, and Derek’s scowl only lasts as long as it takes them to find Abyss Pool about a mile down the trail (though it comes back when Stiles leans what Derek considers to be ‘too far’ off the railing to get a better look at the depths of the pool). You’d never know that the full moon was tonight, though. Not like you would with Scott. Maybe that’s a thing with born werewolves, where they’re less cranky? Or maybe Derek and Cora just have more experience?\nAlso, where Scott prefers to huddle inside with lots of snacks and video games for a full moon, Derek and Cora apparently like to go out and run around like actual wolves.\n\"Seriously?” Stiles asks—tries not to whine—when Derek informs him that he’ll be staying at the motel alone, tonight. “I was joking when I said you guys should commune with the local wolf pack!”\n“We’re not going to commune with wolves, Stilinski,” Cora says, rolling her eyes.\n“Cora might,” Derek allows, “given how she was making friends with the elk earlier. But I won’t be.”\nCora slaps him on the arm. “I wasn’t making friends. And that was a moose.”\n“It was an elk,” Derek says.\n“It was definitely an elk,” Stiles agrees. He holds up the animal safety brochures he’d picked up. “There’s a guide in here.”\n“Whatever,” Cora grouses. “The point is, neither of us are communing with wolves tonight. We’re just going out to run. It’s normal.”\n“Normal for… werewolves,” Stiles says slowly. Deliberately.\n“It’s normal for werewolves, in a pack, when they’re not threatened,” Derek explains. “It was… Beacon Hills was always too dangerous. When I was there.”\n“Oh,” says Stiles. “We just had a big, awkward sleepover where Allison and Scott wouldn’t look at each other, Isaac and Lydia had a catfight about the twins, and I got really, really drunk in the corner.”\n\"You see why we run,” Cora says dryly.\n“Yeah, but—”\nStiles stops, at a loss for how to put the awful feeling in the pit of his stomach into words.\n“We’ll leave one of the phones with you,” Derek says.\nStiles shrugs and tries for a smile. “Cool. Sure.”\n \nThey run for hours. Yellowstone is massive, more massive than any space than any space Derek has ever run in before, and it’s incredible to not have to run in circles to keep to safe zones. The night air is cold and fresh, the scent of industry as faint as Derek’s ever smelled, and Cora fights the same way she did when she was a pup.\nThere is a pack of wolves in Yellowstone, but they seem to sense that they’d be beaten by werewolves, or maybe there’s even other werewolves that run in Yellowstone sometimes. He sees a wolf or two out of the corner of his eye, watching from the shadows, but they don’t engage. At least for tonight, this is Derek and Cora’s territory.\nDerek runs hard and fast. He ran faster as an Alpha, but when he’s going fast enough that his lungs are burning and his muscles ache, he can forget that. Cora pounces from behind and Derek throws himself into a roll, and they go down the slope of the valley together, Cora clinging to his back. They pick up more and more momentum, gravity powering their roll, until finally Derek hits her on a down-roll and springs up, free.\nCora rolls the rest of the way down, pushing herself up with a backflip when the ground evens out. Derek is already running past her, toward the icy river.\nThey hit it together, splashing down and bobbing back together like corks. Cora dunks him in seconds.\nDerek comes up laughing.\n \nThey head back to the motel early, hours before dawn. Stiles is awake, wide-eyed, the television on, the bed scattered with The Private Memoirs and Confessions of a Justified Sinner, his handheld games, Derek’s phone, and the Bible that had come in one of the drawers of their motel room. He blinks a lot at them when they walk in.\n“Hey. Hi! You’re back.”\nCora strips her clothes, barely noticing the stiffness of frozen cloth as she does. Behind her, she can hear Derek doing the same.\nStiles stares, open-mouthed.\nThe moon is still singing in her veins as she slips into sweats and a t-shirt. She leaves her clothes on the floor to melt. It’s not like the carpet isn’t already stained. The television is too loud and bright, so she turns that off, then she starts picking things off of the bed.\n\"You guys… okay?” Stiles asks.\nDerek switches off the lights. “Fine. Lay down.”\n“W-what?”\nCora pushes him down, probably too hard, and crawls into bed beside him. She settles on her stomach, head facing the wall, but throws an arm over Stiles to keep him from popping back up. She hears Derek getting into bed on Stiles’ other side, and then the bedcovers are coming up over them. It’s warm. The bed smells like Stiles since he’s been sitting here for so long.\nTheir last full moon, they’d sat in a motel on the outskirts of Phoenix and stared at the walls. Cora had thought that it was too soon to ask Derek to run, thought maybe he wanted the quiet night in, and had sat in quiet misery instead. She thinks, now, that Derek was probably sitting there that whole night thinking the same thing about her.\n“Ooookay,” says Stiles, between them.\nCora is already half asleep.\n \nStiles sleeps through the night.\n \nOn their final day in Yellowstone, Stiles drags them back to the park to see Old Faithful one last time. As they wait for it to go off—Old Faithful is not as faithful as rumor would have it—they argue over where to go next. Or, Cora and Stiles argue. Derek doesn’t much care. When Cora finally sells Stiles on The Badlands, just in time for Old Faithful to go off, Derek can’t help but notice that their trajectory is headed steadily further and further away from California.\nEver since Stiles showed up, Derek has been wrestling with the guilt of pulling Stiles away from his education, his family, his pack—everything Derek had lost. Stiles was seventeen. He had no idea know what he was leaving behind.\nNow, Derek questions how he could possibly ever let Stiles go back.\n \n“Derek—plural noun.”\n“Teeth.”\n“Cora—adjective.”\n“…flatulent.”\nDerek sighs, but Stiles actually giggles as he scribbles it down.\n“Okay, Derek. Another adjective.”\n“Immature,” Derek says, with a pointed look at Cora.\nCora sticks her tongue out at him.\n“Cora—noun.”\n“Passive-aggressive older brothers.”\nStile pauses. “I… don’t think that’ll fit in the blank.”\nCora smiles with all her teeth. “Write small.”\n \nThe Badlands are exactly as bad as Stiles predicted. They’re flat and brown and the Things To Do brochure doesn’t even unfold to a three-page leaflet. It’s just the one panel. The main attraction seems to be a scenic drive around the park, and there’s no way Stiles is suffering through that tomorrow without the opportunity to spread the misery a little, so when they settle into their motel for the night, Stiles goes outside to call Lydia.\n“Stiles,” Lydia says, when she picks up.\nStiles inhales. “Hey, Lydia.”\n“How are you?”\n“Fine,” Stiles says. He can see his breath in the night air when he says it. “We’re at The Badlands, which is literally the worst place on earth.”\n“The Badlands are an important source of American geological and paleontological research, Stiles,” Lydia says primly.\n“Yeah, maybe, but that doesn’t mean I want to vacation here. It’d be like going on a vacation to CERN.”\n“People do vacation to CERN,” Lydia informs him.\nStiles wrinkles his nose. “Boring people.”\nLydia sniffs. “Do you even know what they’re accomplishing over there?”\n“Yes. Dark matter, quarks, string theory—” Stiles flaps a hand. “—Star Trek stuff.”\nLydia sighs exasperatedly, and Stiles smiles.\nShe presses him for a few more details. Stiles gives her the unimportant ones—what they ate for dinner, the funny names of towns they had passed through, the creepy gas station bathroom with dozens of dead butterflies in shadowboxes, each neatly pinned and labeled. He works toward whatever arbitrary quota Lydia has set for this phone call, wanting to get this over and done with before he gives in to the growing, sickening urge to ask about his father.\n“Aaannd… I got to level five on my racing game,” Stiles says, desperately casting around for something else to say. He hasn’t told her about the sleeping situation, or his newfound libido, or the fact that Cora is werewolf Snow White. “Uh. The vending machine here has Combos?”\n“Mm-hm,” Lydia says disinterestedly.\nStiles thinks harder. “I—”\n“Stiles,” Lydia interrupts. “This is riveting. Really. However, we have something to discuss. You’re not going to like it, but I think it’s time.”\nStiles’ mouth goes dry.\nLydia pauses. “Stiles. You need to know—and I think you already do—that you didn’t leave Beacon Hills because your father was going to send you away.”\n“Yes,” Stiles all but croaks. “Yes, I did. I—”\n“Don’t play stupid.”\n“I’m not playing stupid.”\nLydia sighs, but carries on with an obvious forced patience. “Stiles, if you really thought that your father was through with you, why did you take so many measures against being found? The cell phone, the cash, the computer—”\nStiles inhales, exhales. “Danny—”\n“No,” says Lydia flatly.\n“He was,” Stiles insists. “He was going to—”\n“Stiles, you left Beacon Hills because you wanted to,” Lydia says, steamrolling over him as she clearly abandons any pretense of patience, “and that’s okay. You weren’t wrong. You should have left. You needed to leave.”\nStiles glances at the door to their motel room. At the parking lot. Anywhere.\n“You did. I know this isn’t easy,” Lydia tells him, with all the sympathy of a hunk of steel. “But you need to accept that, because it means that when—if you come back, it can be different. It’s going to be different.”\n“Different how?” Stiles asks faintly.\n“It’s going to be better, for you. The Nemeton clearly has some hold over you that it doesn’t have over Scott and Allison, and we’re going to put a stop to it—Deaton agrees with me, and he’s concerned for what it could mean. We’re working on it together.”\nGod, of course they are.\n“That’s not—it’s not the Nemeton, Lydia,” Stiles says. “You can’t fix this.”\n“Don’t be ridiculous,” Lydia says dismissively. “You’re better than that moronic, self-deprecating teenager shit. I know you are. Deaton and I have a very good theory in the works right now ab—”\n“You don’t—”\n“Oh my God, Stiles, this isn’t that difficult!” she huffs. “Do you trust me?”\n“Of course I do,” Stiles says instantly. “But—”\n“Then trust me when I say that it will be better here, when you come back,” Lydia say sternly, so sternly that it’s like she thinks she can will it to be so with her words alone.\n“Whatever,” Stiles sighs. “Yes. I believe you.”\n“No, not whatever,” Lydia says. “Don’t patronize me, Stiles. I know it was terrible for you here, and you had every right to leave, and you have every right to not come back, but if—if you’re going to leave your family and your friends behind, then it will not be because you’re too cowardly to admit that coming back is an option.”\nStiles gapes. It’s a few seconds before he manages to form words. “F-fuck you. Fuck you, you have no idea, you—you sat on your ass for two months and watched me, apparently knew all along what I was going through, and now you’re going to call me a coward?”\n“You could have asked for help,” Lydia says frostily.\n“Yeah, with all that time we spent together—oh, wait. No. You were too busy fucking Aiden. And even if you hadn’t been, it wouldn’t have mattered, because you can’t fix this. You can’t fix me. It wasn’t the Nemeton, it was me, it was just me. So leave it alone. All right?”\nThere is a long pause, and then Lydia sighs like Stiles is inconveniencing her. “Fine. Be that way. Go sleep on it and we’ll talk more about this later.”\n“No, we won’t.”\n“Yes, we will. You’re braver than that, Stiles. I know you—”\nStiles hangs up, jabbing his thumb onto the END CALL button and then stops, standing there, clutching the phone in front of him and trembling. He’s close to hyperventilating right now. He has to calm down.\nHe can’t think about this right now.\n \nStiles comes back into the motel room pale and shaking, taking care of any lingering doubts that Derek had about getting another room with one king bed instead of two queens. And he isn’t surprised at all when Stiles wakes both him and Cora up in the middle of the night, jerking and muttering and inconsolable until they manage to wake him up.\n“C’mon,” Derek says, guiding a wide-eyed Stiles out of bed. “C’mon, let’s walk. Get out of here.”\nStiles looks back at Cora.\n“Go,” she says dismissively, waving a hand at them and already laying her head back down. “I’ll keep the bed warm.”\nThey bundle up and head outside, where it’s begun to snow. Stiles sticks close.\n“Fuck,” he breathes, ducking his head against the wind. “It’s fucking freezing, I was not built for this.”\n“Aren’t you Polish?” Derek asks.\n“You’re Welsh,” Stiles retorts. “But do you see me making sheep jokes?”\nDerek has no idea what being Welsh has to do with sheep, but he doesn’t want to ask.\n“How are you not cold right now?” Stiles demands, glaring.\n“Werewolf,” Derek reminds him.\nStiles huffs. “Yeah, okay, but you guys don’t run that much hotter than humans. Plus, if you think about it, you should be more susceptible to cold. See, because cold is just the magnitude of the difference between your body temperature and the environmental temperature, so it makes sense that you guys aren’t bothering by heat because it’s just closer to your internal temperature, but cold—”\n“Werewolf, Stiles.”\n“Science,” Stiles retorts.\n“We’ll get you a hat and a scarf, tomorrow,” Derek promises.\n\"Does that mean we’re staying in the north? Because I vote we move south. This is nuts. I thought wasn’t supposed to snow until Christmas,” Stiles grouses.\n“Wherever you guys want,” Derek says, shrugging.\nStiles stops walking, and turns to stare at Derek disbelievingly. “You don’t have any opinion on the subject? None at all?”\n“Not really,” Derek says, honestly.\n“Oh, come on,” Stiles urges. “We talked about this, dude. You can have opinions on things without killing people.”\n“I’m aware,” Derek says, gritting his teeth.\n“So, tell me where you want to go. Or where you don’t want to go. It’s just like the pizza thing, I promise, you’re not going to acci—”\n“Stiles, I don’t care,” Derek grits out, hands balling into fists. “I don’t give two shits about where we go next. That’s all there is to it.”\n\"What do you care about, then?” Stiles demands, his own hands flying up in irritation. “Huh? You don’t care if we go north or south, if we go hiking or driving, if we get steamed or fried rice, if I sleep on the floor or between you and Co—”\n“You,” Derek interrupts forcefully, grabbing Stiles’ hands and pulling them down, covering them with his own palms.\nStiles stares, mouth hanging open.\n“I care about you,” Derek says, calmer. “And Cora. I want you two to be happy. That’s all. Okay?”\nStiles blinks. His mouth is open in a perfect O, his cheeks and ears rosy with cold, and there are melted snowflakes glittering in his hair. He’s beautiful.\n“Come on,” Derek says, releasing one of Stiles’ hands but keeping the other, gripping it tightly against the cold. “If you stand still too long, you’ll turn into a snowman.”\nStiles stumbles after him, and doesn’t say anything for the rest of their walk, not even when Derek slips their joined hands into Stiles’ coat pocket.\n \nStiles is being weird, today. And by weird, Cora means annoying as shit. He basically hasn’t stopped talking since he woke up, has the attention span of a goldfish, and twitchy to the point of almost being a danger to himself. If she hadn’t heard the rattle of the pill bottle this morning, she’d think that Stiles had just decided to go without Adderall today.\nHe has also, seemingly out of nowhere, picked up an encyclopedic knowledge of the history of The Badlands, and has been spewing it at Derek and Cora whenever there’s a half-second of silence. Which, because it’s Derek and Cora… There are a lot of those.\nShe tries to tune him out, which isn’t too hard because she really likes The Badlands. They look like a literal wasteland—dead, jagged, and silent save for the winds that whip across them. It’s so different from home. In a weird way, it makes her ache to go back. But before she can delve too deeply into that ache, Stiles’ jabbering keeps pulling her out of her thoughts.\nBy mid-afternoon, she can’t take it any longer.\n“—no one really bothered to figure out exactly where the boundaries were, so when the US military started firing off—”\n“Stiles,” she interrupts.\nDerek looks over at her sharply from the driver’s seat. \nCora raises her eyebrows at him.\n“Yeah?” Stiles asks, worrying at the fur of the idiotic wolf hat he’d bought at the park’s gift shop this morning. “Shit. Sorry. I’m talking too much, aren’t I?”\nDerek shakes his head minutely.\nHe’s been oddly indulgent of Stiles, today. That’s been pissing her off, too.\n“Just a little,” Cora says eventually, through gritted teeth.\n“Oh,” says Stiles. “Sorry. I’ll.”\nShe can hear him worrying the fur, still.\nIt’s quiet for almost ten minutes before Stiles starts up again.\n \n\n(Soft, warm hands wake him. Stiles thinks it’s Mom, until he sees Tara’s face staring down at him in the soft light of his room, and the wave of disappointment is so fierce he almost starts to cry right then and there. Mom’s dead. She’s been dead for weeks. He should know better now.\n\n\n“Hi, sweetheart,” Tara whispers. “Sorry to wake you up.”\n\n\nStiles is confused. His nightlight is on and it’s still dark, so it can’t be time for school. Why is Tara here? Where’s Dad?\n\n\nThen he notices Sheriff Briggs standing in the doorway of his bedroom, which is even more confusing. Sheriff Briggs is really tall and really thick, and Dad always says he’s a ‘good man’. But why he is here, in Stiles’ bedroom?\n\n\n“You need to get up, Stiles,” Tara says, pulling him out of bed.\n\n\nStiles sleepily complies, shivering in the night air. Tara pulls a soft hoodie over his head, the one with dragon spikes on the hood, and helps Stiles push his arms through the sleeves. Sheriff Briggs is holding his Scooby Doo suitcase, the one Bubbe had gotten him for Hanukkah for when he came to visit. Is he going to see Bubbe?\n\n\nSheriff Briggs hands the suitcase to Tara and picks Stiles up, settling him easily on his hip.\n\n\nDad can’t pick Stiles up anymore. Stiles is too big. It feels nice. Sheriff Briggs is all warm and solid.\n\n\n“Where’s Dad?” Stiles mumbles against Sheriff Briggs’ collar.\n\n\n“Your dad… He isn’t in a good place right now, sonny boy,” Sheriff Briggs tells him.\n\n\nStiles yawns. “Where? Are we gonna get him? Wha’bout Bubbe?”\n\n\n“No, he means—your dad’s been really sad about your mom, sweetie, so he talked to us, and we all agreed to get him some help, and while you dad’s getting better, he thought you’d be happier somewhere else,” Tara explains gently, as she follows them down the stairs. “It’s only for a little while. Do you remember your aunt Rose? She’s coming to pick you up. It’s like an adventure. Like Sam Gribley.”\n\n\nSam Gribley is Stiles’ favorite.\n\n\nBut—\n\n\n“You gotta sign my slip,” Stiles slurs, trying to lift his head. “It’s ‘nother detention one. Miss Marquez says if I don’t get it signed, I’ll get ‘nother s’pension.”\n\n\nStiles has had a lot of detentions and suspensions, lately. He doesn’t mean to get them. They’re boring, and Dad always looks so tired when Stiles hands him the pink slips of paper to sign. He can’t get another suspension.\n\n\n“I’ll talk to Miss Marquez,” Tara promises.\n\n\n“What ‘bout Scott ‘n’ Heath’r?” Stiles asks.\n\n\n“Maybe they can come visit,” Tara says. “I don’t know. We can ask Aunt Rose.”\n\n\nAunt Rose. Stiles is going to live with Aunt Rose.\n\n\n“What about my dad?” Stiles asks, because if he lives with Aunt Rose how will he live with Dad?\n\n\n“Your dad’s gonna get better while you’re gone,” Tara says.\n\n\nStiles frowns, not like that answer at all. “I don’t want to leave. I want my dad.”\n\n\nThey stop at the bottom of the stairs, and Tara runs a hand over his hair. “I know, sweetheart. But it’s only for a little while. You have to be brave for your dad.”\n\nHe’s crying, now. “I want my dad. He wants me, too. He loves me, even when I’m bad.”\n\n“He loves you very much, but he’s going through a hard time and he can’t take care of you right now,” Tara says soothingly. “Can you be brave for him, Stiles?”\n\n\n“No. No, I want my dad, where’s my dad?” He’s really sobbing, now, squirming against Sheriff Briggs’ arms. He looks frantically around the living room for his dad through tears, but his dad isn’t on the couch like he usually is. There’s just empty bottles. “Dad? Dad! Where’s Dad?”\n\n\n“He’s at the station,” Sheriff Briggs says firmly. “He’s not in good shape, Stiles. He’s a little drunk right now.”\n\n\n\"No,” Stiles hiccups, twisting, kicking, hysterically trying to get away. “No, no, no, no, I want my dad, I want Dad, I want—I want Dad—Dad, Dad, Dad, Dad—”\n\n\nHe can’t breathe.\n\n\n“—Daddy—”\n\nHe can’t breathe.\n\n“—Dad—”)\n\nHe can’t breathe.\n \n“Stiles,” Derek says urgently, but it’s no good because Stiles is curled away from him. “Cora, tell him to breathe. Make eye contact, make him—count.”\n“Dad,” Stiles manages. “Dad, call—call Dad.”\nCora forcibly rolls Stiles over so that he’s facing Derek. “I’ll call his dad. You deal with the breathing… thing.”\nDerek passes her his cell phone and pushes down the bed covers, resisting the urge to grab Stiles by the shoulders. “Stiles. What’s your dad’s number?”\nStiles shakes his head.\n“You don’t know it?”\nHe keeps shaking his head, staring up at Derek helplessly.\n“I’ll call Lydia—she’ll have it,” Cora says.\nDerek turns his gaze back to Stiles, locking eyes. “You need to breathe, Stiles. Breathe. Deep breaths, come on.”\n“I—am,” Stiles pants, through rapid-fire breaths. “I am—I can—breathe—shit.”\nDerek snorts, suppressed panic leaking through in spurts of giddiness. “This isn’t the time to be contrary, Stiles.”\nStiles chokes for a second, lets out a sort of giggle-snerk that ends in him taking harsh, lung-filling breaths of air. They sound stressed, wheezed, but at least he’s breathing deeper.\n“Stiles, Stiles, quite contrary, how does your garden grow?” Stiles breathes, all in a high rush, giggling manically between gasps of air.\n“What?”\n“Lydia, it’s Cora. No, don’t hang up, it’s an emergency. I need Stiles’ dad’s number, right now.”\nStiles closes his eyes, his breathing picking up again.\n“Stiles, look at me,” Derek orders. “Open your eyes and look at me. It will help. I promise.”\nStiles shakes his head.\n“Stiles.”\n“Got it, I’ve got it,” Cora says, shoving the phone at Stiles, which isn’t helpful because Stiles isn’t looking. Derek takes the phone from her, cautiously takes Stiles’ hand, and when he doesn’t flinch away, he places the phone in it and brings it up to Stiles’ ear.\nHe glances up a Cora, who stares back at him.\n“Hello?” Derek hears the Sheriff say, from the other end of the line.\n“Dad,” Stiles chokes out, and bursts into tears.\n“Stiles? What’s wrong? Are you hurt? Where are you?” the Sheriff demands. “Stiles!”\n“I’m sorry,” Stiles sobs. “I’m sorry I left, it wasn’t your fault, I tried, I-I’m a bad person and a bad son and—”\nDerek definitely feels like he should no longer be within hearing range of his conversation. Judging by the look on Cora’s face, she’s feeling the same way.\n“Breathe, Stiles,” the Sheriff orders, suddenly calm. “Let me hear you breathe. One breath. In.”\nStiles breathes in, deep, until he chokes on another sob.\n“It’s okay, Stiles. Give me another one.”\nStiles breathes in again, this one better.\n“Good. That’s two. Again, now.”\n“I’m okay,” Stiles insists, sucking in a huge lungful of air. “I’m okay now, I’m okay, I’m okay—”\n“Breathe, idiot,” Derek and the Sheriff stay in unison—though it’s just Derek who tacks on the insult.\nStiles inhales again, and then again unprompted. He does sound better. Derek’s pretty sure the hyperventilation stopped the moment Stiles heard his dad’s voice, but the subsequent sobbing definitely hadn’t been good, either. He wonders what would have happened if they hadn’t been able to reach Stiles’ father.\nDerek and Cora get up to leave, but Stiles snakes a hand out, grabbing Derek as his eyes shoot to Cora.\n“W-where are you going?”\n“Stiles?” the Sheriff asks, sounding confused.\n“To give you privacy, dumbass,” Cora says.\nStiles’ heart trips a little at that. “Like—like out of the room?”\nDerek looks around. There isn’t really anywhere else to go. Except…\n \n“Really, Derek? Really?” Cora asks, as they sit on the floor of the bathroom, backs against the wall.\nDerek shrugs, not meeting her gaze.\nShe rolls her eyes and sighs, but lays her head on his shoulder, closing her eyes to go back to sleep.\n \nWith the calmness that came from finally talking to his father, comes the crushing realization that Stiles has, in fact, called his father.\n“Stiles?” his father asks tentatively, after Stiles has been quiet for too long. “Are you okay? You’re not hurt, are you?”\n\"No,” Stiles says, after a pause.\n“Okay. Are you in a safe place?” his father asks slowly.\n“Yeah.”\n“Is someone there with you? Someone you trust?”\nStiles’ eyes flick to the closed bathroom door. “Yeah.”\n“Do you want to get something to drink?”\n“No, I—” Stiles swallows, and asks in a small voice, “Dad, on—on a scale from one to ten, how disowned am I?”\n“With… ten being the most disowned?” Dad asks.\n“Uh-huh.”\n“Well,” Dad says thoughtfully, “considering that, I guess I’d have to say about a negative three. Or a negative four.”\nStiles blows out a breath.\n“Christ, Stiles. What did I do wrong that you think I’d disown you?”\n“Nothing,” Stiles says miserably. “It’s just me and my stupid brain.”\n“There’s nothing wrong with your brain, Stiles,” Dad says, like always.\n“Dad,” Stiles says quietly. “Dad, I—you remember the magic tree that the Darach held you guys hostage under?”\n“The… nematode? What does that have to do with your brain?”\n“Nematon, yeah. Well. To find you guys, Scott, Allison and I sort of had to… bind ourselves to it, a little bit. So now we all sort of have this, uh, darkness. Around our hearts. It’s sort of like the Horcrux locket from Harry Potter? The one in the seventh book?”\n“…evil?” Dad tries.\nA horrible, cold abyss right in the center of your chest, creeping around your heart and ensnaring your lungs until both are frozen and you’re sure you’re dead.\n“Kind of,” Stiles says. “It’s just—bad. Like this awful thing in your chest, all the time. And, anyway, the only way to deal with it is to ignore it. Focus on other things, you know? But. But I can’t—”\n“You can’t filter out distractions,” Dad fills in heavily, when Stiles can’t finish the sentence.\n“Yeah.”  \nDad sighs. “Dammit, Stiles. Why didn’t you tell me?”\nStiles swallows hard, feeling his throat tighten. “I’m sorry.”\nThere’s a long, long silence.\n“Dad?” Stiles asks, and there’s no helping the quaver in his voice.\n“You know when I—after your mother died, when you went to live with Aunt Rose while I—got better,” Dad says slowly, and Stiles basically stops breathing because this is like numeros uno, dos, and tres on the Stilinski List of Things We Don’t Talk About. “After that first week, when I came to visit you for the first time. It was. Stiles, the moment I saw you again, that was—it was the happiest I’d felt in months.”\nStiles remembers the hug his father had given him after that week apart, huge and sweeping and bone-crushing, like you see in movies. He remembers his shirt collar coming away wet, and his father smiling even though there were tear running down his face.\n“You being away,” Dad goes on quietly, “it made me realize how much I couldn’t ever lose you. And every visit after that, before I brought you back home—they were the brightest parts of my days. Seeing you is always the brightest part of my day, Stiles. Even when we’re fighting, or you’re bouncing off the walls, or you’re lying to me about werewolves, of all things. And I will always want you around.”\nStiles is crying again. “Dad…”\n“In that video you left me, you mentioned Aunt Rose,” Dad says, sounding old and tired. “You thought I was going to send you away again.”\n“Yeah,” Stiles says through tears. “I mean, no. It was the Nemeton, it got in my head. I had nightmares, and hallucinations, and—shit, I owe Lydia an apology—but I didn’t really think that… You. You wouldn’t. I know you wouldn’t, Dad.”\n“Stiles, I swear to you, there is nothing on this earth that would make me send you away again,” Dad says. “I wasn’t in my right mind, back then. Losing your mother was the worst thing that has ever happened to me, and I—I screwed up, kid. I screwed up bad.”\n“I’m sorry,” Stiles says thickly.\n“I’m sorry,” Dad replies.\nStiles sniffles. “…so I can come home?”\n“You can always come home, Stiles.”\nStiles chokes on a sob and nods. “Okay. Okay, I’ll come home. I love you.”\n“I love you too, kid. You gonna be okay? You need me to come get you?”\n“No. No, I’ll be okay. They’ll drive me home. Can I call you in the morning, though?”\n“Absolutely.”\nStiles sniffles again. “Okay.”\n“Okay,” Dad says.\n \nEventually, there’s a tentative knock on the bathroom door, and then it opens to reveal Stiles. His eyes are puffy, face tear-stained, and his expression is exhausted. He takes in the sight of Derek and Cora sitting on the floor of the bathroom, though, and a small smile tugs at the corners of his lips.\nCora lifts her head, yawning. Derek wonders if he should move the arm he has around her, but she doesn’t seem to mind, so he keeps it there.\n“Were you listening?” Stiles asks quietly.\nDerek shakes his head.\nStiles looks down. “I—I talked to my dad. Would it be all right if you guys drove me back home, tomorrow?”\n“Is he forcing you to go home?” Derek asks, eyes narrowing.\n“No!” Stiles says, head jerking up. “No, no, oh my God, no. I want to go home. Not that you guys haven’t been awesome. These two weeks were—you guys helped me so much. And we had fun. I got to touch an elk! I am so, so grateful—”\n“We get it,” Derek interrupts.\n“And it was a moose,” Cora puts in helpfully.\n“Elk,” Stiles and Derek reply in unison.\n“Whatever,” Cora says through another yawn. “We’re taking you home tomorrow. Awesome. Can we go to sleep?”\nDerek looks to Stiles, who nods, before he starts to get up. Cora’s already standing and leading the way back to the bed, but she waits for Stiles to get in first before laying down next to him. Derek crawls in last, on Stiles’ other side, and flicks off the lamp. The pillows smell like the three of them, the scents of others before them completely obliterated, and he can hear both Stiles’ and Cora’s hearts beating. He can hear them breathing.\nHe doesn’t need to have Alpha-level senses for this. Now, here, when they’re snuggled in close, being a Beta is just fine.\n \nThey sleep late in the morning, but luckily wake up before check-out time. Stiles packs his stuff, zips up his coat, pulls his wolf hat snugly over his head, and goes outside to call his father. Cora’s tempted to listen in, but when she makes a move toward the door, Derek gives her an exasperated look and she glares, but goes back to packing.\nThey hit the road by eleven.\nIt’s good that Stiles is going home, she guesses. He should go home. And despite everything, she does recognize that without Stiles she and Derek would probably still be miserably congealing in that motel in the desert. She’s glad that he came. She might even go so far as to say that she’ll miss him when he’s gone. Without Stiles to act as a buffer, it’ll too be weird to only get one-bed rooms any longer.\nCora had sort of been looking forward to Chicago, but she’s not crushed to be missing it. And more importantly, she thinks she has a good idea of where she wants to go after they drop Stiles off.\n \n“I’m sorry,” is the first thing Stiles says.\n“Obviously,” Lydia replies archly.\nStiles sighs, and doesn’t know why he was expecting anything more. “I’m coming home. I should be there late tomorrow night.”\n“Mm-hmm,” Lydia says, sounding utterly unsurprised.\n“Whatever you and Deaton are working on,” Stiles goes on, hesitantly now. “I’ll—well, I’ll try it, but I’m not expecting it to work. I still don’t think it has anything to do with the Nemeton taking a special interest in me, or whatever.”\n“Good,” Lydia says. “It will work.”\nStiles rolls his eyes. “Uh-huh.”\n“It will. We have an amulet almost ready to go that should definitely help. Also, in case you’d forgotten, we have finals in three weeks. I need someone halfway intelligent to study with, so you’d better be caught up with your work by then.”\n“Ugh,” Stiles says. “I was planning on failing and going to summer school.”\n“Unacceptable,” Lydia declares.\n\"We can negotiate when I get home,” Stiles says, though he already knows that he’ll lose. The word ‘negotiate’ does not exist in Lydia’s vocabulary.\n“Of course we can,” Lydia says smugly, because she knows she’s already won as well.\n“Let me keep my illusions of dignity. Good bye, Lydia.”\n“Good bye, Stiles,” she says, and then adds, in a tone of voice that is finally soft, “and… I’m glad you’re coming back.”\n \nWhen Stiles gets back in the car, he’s smiling. Derek can’t help but let Stiles’ happiness catch on, despite the impending separation hanging heavily over their heads. He’s glad, at least, that Lydia’s going to be helping Stiles out this time. It’ll make it easier to say goodbye.\nThey wait for Cora to finish using the bathroom in silence, until Stiles breaks it.\n“So, uh,” says Stiles. “Thanks for trying to talk me through that panic attack last night, instead of—kissing me. Or something.”\n“Kissing you?” Derek repeats, going for amused even as he feels a flash of worry that he’s been reading this whole thing between them wrong.\nStiles nods. “Yeah. Uh. Historically, that is a method that people have used to try to stop my panic attacks.”\n“Does it work?” Derek asks, frowning.\n“Actually, it does. Really well. But—” Stiles stops, and Derek has to stop himself from demanding Stiles finish that sentence.\nBut what?\nStiles looks up from his lap, meeting Derek’s eyes in the rearview mirror, then looks back down. “But if you were… gonna kiss me. For whatever reason. That’s kind of a crappy one.”\nDerek smiles at that, ducking his head to the side so Stiles won’t see it in the mirror. When Cora gets back and they set out on the road again, he pushes play on Stiles’ stupid mix CD, and lets him listen to it the whole way through. Just once.\n(They listen to it more than once.)\n \nIt’s their last night together.  They find a motel in the middle of Nevada, and they get a king bed for the night. None of them speak as they stumble into the bed, Derek wrapping himself around Stiles, who grabs at the starfished Cora to pull her closer. It’s the last night they’ll do this.\nSomehow, all three of them fall asleep within ten minutes anyway.\n \nStiles can feel the Nemeton, as they get closer. It feels like his chest is being slowly compressed by a block of ice, the pressure getting worse and worse as they approach, but it doesn’t seem as soul-crushing as it had when he left. He concentrates on Derek, and Cora, and the newest sheet of Mad Libs, and sings along at the top of his lung to the fantastic notes of Lawrence of My Labia, and it seems almost bearable.\n \nThey pull into Beacon Hills in the late afternoon. Stiles asks Derek to drop him off at the end of the block he lives on, if only to spare him and Cora an awkward interrogation. After Derek parks, it takes Stiles almost ten minutes to finish rooting out the last of his miscellaneous candy wrappers and soda bottles, and then a few more to stuff the winter jacket and the ridiculous wolf hat into his lacrosse bag. He leaves the fishing and the racing game in the car.\n“In case you guys get bored,” Stiles says, looking from Derek to Cora significantly. “And I left the binder of mix CD’s, if you get tired of the radio. And the Mad Libs! Though I don’t know how much fun it’ll be with just two people. Oh, and there’s extra batteries for the games, in the pouchy thing behind Derek’s seat. Are you guys sure you don’t want the rest of my Sour Patch Kids?”\n“Ew.”\n“No, thank you.”\n“All right, all right,” Stiles says. “Fine. No stale Sour Patch Kids for you.”\nStiles plays with the strap of his lacrosse bag, which is sitting at his feet. Derek and Cora are awkwardly assembled before him, and Cora can see that Derek is going to make no move to break the awkward, so she takes it upon herself.\n“Well,” she says. “Catch you later.”\n“Bet you’re happy to finally get rid of me, huh?” Stiles asks.\nCora scowls. “Don’t be an idiot, Stilinski.”\nStiles brightens at that. “Oh! Hey! Dad said he kept my phone. Gimmie yours, I’ll program my number in.”\nCora sighs, but hands her phone over. When she gets it back moments later, the new contact is not saved under ‘Stiles’ or ‘Stilinski’.\n“Mel-whatsit-what?” she says, staring at the name on the display.\nDerek peers at it curiously. His eyebrows shoot up.\n“Told you,” Stiles says smugly.\n“What the hell language even is that even from?” Cora demands.\nStiles grins. “Hebrew.”\n“Huh,” Cora says, staring at the name again, because that doesn’t help at all in figuring out how to pronounce it. She looks up when she realizes that they’ve descended into awkward silence again, and rolls her eyes before shoving her brother forward.\nBoys. Honestly.\n“You, uh,” Derek mumbles. “You okay to carry that to the house?”\nStiles rolls his eyes. “Dude. I carried it from the bus stop to your motel when it was like a thousand degrees out. I think I’ll be fine.”\n“I was just asking,” Derek says defensively.\nStiles deflates at that, stares at Derek for a moment, then comes forward and wraps his arms around Derek in a hug.\nDerek stiffens, relaxes, then gradually reciprocates. That’s something Cora’s definitely going to have to fix in the upcoming weeks. They’ve been using Stiles as their affection buffer for long enough, now.\nThen, somehow, the hug transforms into Derek kissing Stiles.\nCora watches with raised eyebrows as this time Stiles is the one to stiffen, relax, then gradually reciprocate. It’s a careful kiss, modest—there are definitely no tongues involved—and less than a minute passes before Derek breaks away but keeps Stiles steadily in his arms.\nStiles is grinning dopily.\n“Am I your pepperoni?” he asks nonsensically, when he catches his breath.\nDerek grins, small and private. “I guess so.”\nUgh. Romance. Give her horses, any day.\nCora sends a text message to Stiles’ phone—a generic it’s Cora so he’ll have her number—as Stiles and Derek grin at each other like loons for a few moments. She supposes they’ve earned that. Eventually, they both remember that the rest of the world exists and turn to look at her with weirdly guilty expressions.\n“What, do you want my blessing?” she asks.\nDerek’s eyes widen. “Uh—”\n“Move over,” Cora orders, walking over to the pair of them and elbowing Derek out of the way. He goes easily enough, allowing Cora to take Stiles’ face in her hands and plant the biggest, wettest kiss she can right on his lips.\nStiles stares at her, wide-eyed, when she pulls back. His eyes go to Derek, and then back to Cora. “Uh.”\n“I’d kiss you, too,” Cora tells Derek, “but eugh. No.”\n“So. You’re okay with…?” Derek asks tentatively.\n“Yes,” says Cora, exasperated. “Now c’mon. You’re just going to stand here staring into Stiles’ eyes and we’ve got ground to cover before the sun sets. Bye, Stiles! Thanks for traveling!”\nDerek huffs, but he’s smiling as he does.\n“Where are you guys going next?” Stiles asks, tentatively shouldering his lacrosse bag.\n“We’ll figure it out,” Derek tells him easily, and then he swoops in for a last, quick kiss, before heading around to the driver’s side. “See you later, Stiles.”\n“Wait,” Stiles says suddenly, frowning. “Wait a minute, am I dating both of you right now? Is that what’s going on?”\nDerek doesn’t answer, and Cora just smirks at Stiles through the passenger window. Stiles flips her off. She waves cheerily.\n \nIt’s weird, to have Stiles gone. Quiet. Derek wouldn’t say that he’s tempted, necessarily, to open the binder of mix CD’s. But he could perhaps see a time in the distant future when he might unzip it and pop one of the CD’s into the player. Perhaps.\nThey stop for gas just outside of Beacon Hills, at the same place where Chris Argent broke the window of the Camaro, almost a year ago.\n“So,” Derek says, as the gas pumps. Cora’s finished pushing the layer of dead bugs off the windshield with the squeegee, and is watching the numbers on the terminal go up alongside him. “You said, a while ago, that—that this trip wasn’t about us.”\nCora looks at him, and then looks back at the meter. “Yeah.”\n“Well,” Derek continues carefully, “then I want to know. If it’s not about us, then what is it about?”\nThe gas pump clicks as the tank reaches capacity. Derek doesn’t move to pull it out.\n“It wasn’t about us,” Cora sighs, not looking at him. “I didn’t want it to be. But—now it is.”\n“And that’s… okay?” Derek asks.\nCora turns to look at him. “You wanna see my home?”\n“Your—” Then Derek gets it, and he stares at her.\n“It’s a bit of a drive,” Cora admits.\n“Yes,” Derek says immediately. “Yes, I want to see.”\nCora grins.\n \n You:   About to cross the Mexican border. If you don’t have international texting, get it.\n Melchizedek:   I have it.\nMelchizedek:   Wait, do you guys have passports? How are you getting across?\n You:   Werewolves.\n Melchizedek:   OMG your answer to every plot hole cannot just be WEREWOLVES\n You:   Derek says to remind you that we don’t actually live in a movie.\n Melchizedek:   Do not even, we could make a freaking epic out of our lives. Star Wars has nothing on us. "
}