{
    "id": "1035300",
    "url": "https://archiveofourown.org/works/1035300?view_full_work=true",
    "author": [
        "mysecretashes"
    ],
    "title": "Dude, Werewolves",
    "rating": "Explicit",
    "archive_warnings": [
        "Underage"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [
        "Stiles Stilinski",
        "Derek Hale",
        "Cora Hale",
        "Scott McCall",
        "Sheriff Stilinski"
    ],
    "additional_tags": [
        "Cora Hale & Stiles Stilinski Friendship",
        "Alternate Universe - No Hale Fire",
        "Getting Together",
        "First Time",
        "Scent Marking",
        "Semi-Public Sex",
        "Oral Sex",
        "Anal Sex",
        "Loss of Virginity",
        "Frottage"
    ],
    "language": "English",
    "series": "",
    "published": "2013-11-22",
    "completed": null,
    "words": "29,623",
    "chapters": "1/1",
    "comments": "331",
    "kudos": "24,535",
    "bookmarks": "6,770",
    "hits": "396,868",
    "summary": "<p>Stiles gets partnered with Cora for a history project, and they become bros. Also, he kind of falls in love with her older brother, Derek.</p>",
    "notes": "<p>MAGGIE. I took your likes of feel good fics and canon AUs, mixed them together, and ended up with this. I hope you enjoy it. &lt;3</p>\n<p>ETA 12/28/17: Now available <a href=\"https://ficbook.net/readfic/6317119/16163185\" rel=\"nofollow\">in Russian</a>!</p>",
    "text": "The second Ms. Newman walks into the history classroom – eyes lit up with excitement and a barely contained smile on her face – Stiles just knows she's about to tell them something he is going to hate with a fiery passion.\n\"Everyone settle down,\" Ms. Newman says, clapping her hands together. \"I have an announcement.\"\nStiles hears several grumbles that match his own uneasiness, but for once it only takes a few seconds for the class to go quiet. He glances over at Scott, and the grimace he sends Stiles clearly says this is going to suck. It's the little moments like these that he's reminded of why they're best friends.\n\"It's mid October,\" Ms. Newman continues, \"and every year my seniors – that would be you guys, in case you've forgotten – must do a project which will count for half of your final semester grade in this class. Yes, I said half. These will be partnered projects, no you won't be allowed to choose your own partner, and you will have to do a joint presentation at the end of the semester. All projects must include a five page, typed report – twelve point, single spaced – and some sort of visual representation. You may choose any subject as long as you relate it to history, obviously, and I advise you to be creative. You won't be allowed to work on these in class, which is one reason why I'm giving you two months to finish. Use your time wisely.\"\nShe pauses, and Stiles can almost feel the abject horror flowing through the room. Or maybe that's just his own horror, because holy god.\nAnd he had liked Ms. Newman.\nHer smile widens, and it's obvious she's enjoying the reactions she's getting. \"Does anyone have any questions?\"\nStiles shoots his hand up.\n\"No, Mr. Stilinski, trading partners is not allowed. You will work with who I've assigned you with, or you will receive a zero.\"\nStiles drops his hand, shoulders falling. Something tells him he's not going to be lucky enough to get to work with Scott or Allison or Lydia, and those are the only friends he has in this class.\n\"Any other questions?\"\nStiles raises his hand again.\nMs. Newman sighs. \"Yes, Stiles?\"\n\"What if you and your partner can't agree on a subject?\"\n\"Then write down all of your ideas and pull one out of a hat. Anyone else?\"\n\"Rude,\" Stiles mutters under his breath.\nNobody else seems to have any questions, so Ms. Newman nods and picks up a clipboard. \"I'm going to call out partners, and then we'll be starting our unit on Ancient Rome.\"\nShe starts listing off names, and Stiles sends a mournful glance to Scott, who just shrugs helplessly. Sighing heavily, Stiles slumps down in his seat and bites at his thumbnail. Maybe they'll luck out; maybe Ms. Newman will be nice enough to pair up friends –\n\"Allison Argent and Vernon Boyd.\"\nCrap. One down.\n\"Lydia Martin and Erica Reyes.\"\nThat's two, shit.\n\"Scott McCall –\"\n\nSay Stiles, say Stiles –\n\n\"– and Isaac Lahey.\"\nWell fuck.\nStiles scowls down at his history textbook and tries not to glare at his teacher. She lists off a few more names, and then – \n\"Stiles Stilinski and Cora Hale.\"\nOh god, what.\nStiles looks over at Scott with wide eyes, and he knows his expression probably mirrors the one on his best friend's face.\nDude, Scott mouths.\nStiles just shakes his head and swallows. Cora Hale is his partner. Cora Hale, who single handedly beat everyone at dodge ball in sixth grade. Cora Hale, who held a football player inches off the ground and threatened to bash his face in if he didn't stop bullying one of the freshmen. Cora Hale, whom even Harris doesn't insult.\nSlumping further down into his seat, Stiles runs one hand over his hair and chances a backwards glance to the last desk in the corner next to the window. Cora has her chin propped on one hand and she's doodling in her notebook with the other, looking utterly bored. He stares for a moment, wondering if she even heard Ms. Newman's announcement, but then she looks up and immediately catches his eye, grinning sharply at him.\nShit, fuck. Stiles snaps his head back around to the front, trying to look casual as he bites down on one knuckle, heart pounding erratically. He can still remember the ball-shaped bruise on his ass after that sixth-grade dodge ball game. Every time he had tried to sit down for the next week, his dad had ended up laughing hysterically.\nThe rest of class goes by in a haze, Stiles' concentration shot to hell and back. He resists looking at Cora again, and when the bell rings he's grabbing his stuff and booking it without even waiting for Scott. They all have lunch next anyway, so they'll catch up. He stops by his locker to exchange his books for the ones he'll need that afternoon and then heads to the cafeteria. He knows he'll have to talk to Cora eventually, but right now he wants to drown his terror in food.\nScott, Allison, and Lydia are all at their regular table when he gets there, dropping his backpack and sliding into one of the empty chairs.\n\"Dude, Cora Hale,\" Scott says the second Stiles sets his tray down, because Scott gets it. \"What if she decides to kill you in your sleep or something?\"\nStiles shudders. \"Promise me you'll throw a party in my honor. Make sure there's curly fries for everyone.\"\n\"I promise,\" Scott says solemnly, eyes wide.\n\"Be honest,\" Lydia says, putting her phone away and reaching over to steal one of Stiles' fries. \"Is being partnered with Cora Hale for this project going to cause another situation? Because if it is I feel the need to warn her.\"\nStiles scowls. \"No. Wait, what kind of situation are we talking about?\"\nLydia gives him a flat look, gesturing between the two of them. \"A situation, Stiles. It wasn't pretty in sophomore year, and it would be even less pretty now.\"\n\"That is completely unfair,\" Stiles says, pointing at her. \"I was fifteen, and I'd had a crush on you for years already. I've grown, okay?\"\nLydia looks doubtful but she just reaches across the table for another fry. Stiles glares at her and pulls his tray closer, which earns him a smirk and the loss of two more fries.\n\"It kind of sucks that none of us got paired together,\" Allison says, frowning.\n\"I think that's the point,\" Scott says. \"Nobody got paired with any of their friends. It's like a social experiment combined with a history project.\"\nLydia scoffs. \"Well, whatever the reasoning, I'd better not get anything less than a perfect score.\"\nCora suddenly drops down into the seat next to Stiles, making him jump.\n\"Jesus Christ. Do you enjoy scaring the shit out of people?\"\nCora snorts and holds out her hand. \"Give me your phone.\"\n\"What, why?\" Stiles says, eyeing her as though she'll reach over and bite him, and not in the fun way.\n\"We need to exchange numbers, dumbass,\" Cora says, rolling her eyes. \"I'm not going to break it.\"\nStiles scowls but he digs in his pocket for his phone, handing it over with no small amount of trepidation. Cora types in a few things and then he hears a faint buzzing coming from her backpack. She reaches down and pulls her own phone out, handing his back, and then types on hers. His phone buzzes in his hand and he looks down to see a text from Cora, already added to his contacts.\n\"I sent you my address,\" she says, standing and pushing her phone into her pocket. \"You're coming for dinner tomorrow, and we'll work on the project after. Six o'clock, don't be late.\"\nShe walks away and Stiles is left staring after her, dumbfounded. Finally he turns to Scott, eyes wide.\n\"If they eat me for dinner, don't forget your promise.\"\n\"Curly fries and milkshakes?\"\n\"You know me so well.\"\n*\nThe following evening finds Stiles pulling up in front of a huge house in the middle of the fucking woods. It's like something out of a horror movie, and if it weren't for the half-dozen or so young children running around he would probably be hightailing it home right about now. As it is, he parks the Jeep behind a sleek looking black Camaro and runs one hand through his hair before opening the door and climbing out.\n\"You actually came,\" a voice says behind him, making Stiles jump. He turns to see Cora grinning at him, thumbs hooked in her belt loops. \"I had wondered, honestly.\"\n\"Yeah, well,\" Stiles says, straightening his shirt. \"It was show up and die or not show up and die twice because you and my dad would both kill me for being rude.\"\nCora rolls her eyes and grabs his arm, pulling him toward the house. \"I don't know why you're so scared of me, I've never once threatened you.\"\n\"I'm not scared of you,\" Stiles protests, and when Cora just gives him a look he scowls back. \"Is your family anything like you? Because we could totally do this at my house, it seems like it would be a lot quieter.\"\nCora stops walking and narrows her eyes. \"Are you saying you don't like my family?\"\n\"What? No! I didn't say that, I swear, your family is probably awesome –\"\n\"Probably?\"\nStiles snaps his mouth shut and shoves both hands into his pockets. \"Well, it's not like I've actually met them yet.\"\n\"Cora, stop terrorizing the poor boy and come introduce him.\"\nStiles looks over to see a woman who seems to be in her mid-twenties standing on the porch. She looks a lot like Cora, with dark hair and slightly paler eyes, and he guesses they must be sisters.\n\"Oh please,\" Cora says, crossing her arms over her chest. \"Like you're not planning on doing the same thing.\"\nThe woman grins and it's so predatory Stiles sends a longing glance at his Jeep. Alas, Cora takes his arm again and drags him the rest of the way to the house and up the stone steps to the porch.\n\"Laura, this is Stiles Stilinski, my assigned partner for the dumb ass history project Ms. Newman is making us do. Stiles, this is my sister Laura.\"\n\"Nice to meet you,\" Stiles manages weakly, and Laura's grin grows.\n\"Oh, you're just adorable,\" she says, and Stiles flushes. \"Tell me, Stiles – do you have a girlfriend?\"\n\"Um.\" Stiles blinks. \"No?\"\nLaura nods, ignoring how the word comes out more like a question, and gives him a sly look. \"What about a boyfriend?\"\nStiles laughs nervously. \"Uh, no, not one of those either, unfortunately.\"\nLaura grins in obvious delight and hooks her arm through Stiles', leading him the rest of the way into the house. \"Don't worry, Stiles, everyone new to the Hales starts off with abject terror. You'll get used to us soon enough.\"\n\"I'm here to do a history project,\" Stiles points out weakly, and hears Cora snort behind him.\n\"Of course you are.\" Laura pats his arm, and Stiles suddenly feels like he's walked straight into a wolf's den. \"Which means you'll be around more often than not.\"\nThere are a lot more Hales than Stiles thought, and he desperately tries to remember everyone's name as Laura drags him around the house introducing him. He almost wants to point out that Cora should probably be the one to do that since technically he's her guest, but judging by the slightly bored expression on her face as she follows them she doesn't really care, so he keeps his mouth shut.\n\"Welcome, Stiles,\" Talia Hale says once Laura has pulled him into the kitchen. \"Laura, let him go, he's completely overwhelmed.\"\n\"It's fine,\" Stiles says. \"I mean, I'm used to just me and my dad so yeah, kind of, but not in a bad way.\"\nTalia smiles at him, amusement clear in her eyes. \"Well, feel free to make yourself at home. And please call me Talia, all of my children's friends do.\"\n\"Uh, okay,\" Stiles says, and hears both Cora and Laura snicker.\n\"Hush, you two.\" Talia points her finger at both of them. \"Cora, go set the table. Laura, round up the little ones and make them wash up. Stiles, have a seat, dinner will be ready in about fifteen minutes.\"\nStiles swallows back a terrified noise at being left alone with Cora's mother, but he does as he's told and sits in one of the high-backed stools at the huge island in the middle of the kitchen.\n\"Relax,\" Talia says, turning to take a pan of pork chops out of the oven. \"We're not going to eat you.\"\nStiles can't help the short burst of laughter he lets out at that, and feels some of the tension in his shoulders melt away. \"Sorry,\" he says sheepishly. \"Cora can be kind of intense at school, and I wasn't sure – I mean, I'm really awkward, you can ignore at least half of the things I say.\"\nTalia shakes her head, a small smile on her face. \"Don't worry, we're all at least a little bit awkward.\"\nStiles makes a noncommittal noise, because he's pretty sure none of the Hales are anywhere close to as awkward as he's been known to be. He's trying to think of something else to say that won't make him seem like a complete asshole, but before he can somebody he hasn't been introduced to yet walks into the kitchen and his mouth goes dry.\nStiles has already figured out that the Hales are all too hot for words, but this guy beats all of them hands down. He's got black hair and green-hazel-something eyes and stubble and a fucking jaw line that Stiles wants to bite after only two seconds. There's something vaguely familiar about him, too, something that niggles at the back of Stiles' mind, but he can't pull it forward enough to turn it into a full thought.\n\"Hey, Mom, have you seen my new jacket?\" the guy says, and there's a deep scowl on his face, eyebrows drawn down angrily. \"It was in my room and I'm pretty sure Laura stole it, I can smell –\"\n\"Derek,\" Talia interrupts, and gives him a pointed look before nodding toward Stiles.\nDerek looks over at him and blinks, eyes going wide with what almost looks like shock. After a moment his expression turns neutral and he raises both eyebrows. \"Who are you, another of Cora's strays?\"\n\"Uh,\" Stiles says, completely lost. \"Pretty sure I'm not a dog, so I'm going with no.\"\nDerek narrows his eyes but before he can say anything Talia clears her throat. \"Derek, this is Stiles. He's Cora's partner for a history project they have to do.\"\n\"Oh. Yeah, Cora told me about that.\" Derek's glare lessens only slightly, and Stiles narrows his own eyes in return. \"Half your semester grade, right?\"\nStiles hesitates for a moment before nodding. \"Yeah.\"\nDerek snorts and his glare finally disappears, only to be replaced with a smirk. \"Good luck with that.\" He turns back to Talia, effectively dismissing Stiles. \"My jacket? I know Laura took it.\"\n\"Then go talk to Laura,\" Talia says, calm and even. \"You're both adults, so handle it like adults.\"\nDerek almost looks like he wants to argue, but instead he just makes a low, frustrated sound and leaves the kitchen in an obvious huff, throwing Stiles one last unreadable glance as he goes. Talia chuckles under her breath and shakes her head.\n\"Stiles, dear, would you mind taking the salad into the dining room?\"\n\"Yeah, of course,\" Stiles says, and picks up the big bowl Talia gestures to. The dining room is just off the kitchen, and as Stiles pushes through the swinging door he thinks he hears Talia tell Laura to give Derek his jacket back, but that can't be right because Laura isn't anywhere near the kitchen. Stiles glances behind him as the door swings closed, sees nobody other than Talia, and shakes his head at himself.\nDinner is chaotic. That's really the only word for it. The large table is full of people from one end to the other, and unsurprisingly Stiles ends up sitting between Cora and Laura. Far more unexpected is when Derek slides into the seat opposite, and a man Laura had called Uncle Peter takes the seat next to him.\n\"Welcome to the family, Stiles,\" Peter says, and the smile on his face is the most creeptastic thing Stiles has ever seen. \"Just so you know, it isn't always like this around here. Fridays are our big family dinner nights. Although, privacy can be… an issue, even when alone.\"\nCora rolls her eyes and shoves a bowl of green beans in Peter's face. \"Stop being weird.\"\n\"Uh,\" Stiles says, automatically taking the platter of pork chops Laura hands him. \"I'm just here for a history project Cora and I have to do.\"\n\"Oh, really?\" Peter's eyes light up, but it's not with excitement. \"Did you know that our Derek here has a degree in History? I mean, it's only a bachelor's degree, but –\"\n\"No,\" Derek says. \"And shut up, you know I'm taking a year off before I go back for my masters.\"\nCora gives him a frustrated look before saying to Peter, \"I've already asked him. He's being a stubborn asshole about it.\"\n\"Cora, language,\" Talia calls from the front of the table. Stiles frowns, glancing at her and then at the half-dozen or so loud people between them.\n\"If by 'asked' you mean 'pestered obnoxiously until I had to bodily remove you from my room and slam the door in your face', then yes, you did.\" Derek grins sharply at her. \"I'm not helping you. I had to do this project on my own, and so do you.\"\nBeside Stiles, Laura scoffs. \"Derek, please stop acting like you're an actual adult. We all know that isn't true.\"\n\"I'm twenty-two. I'm pretty sure that classifies as an adult.\"\n\"Then stop being so immature and at least offer some assistance if they need it. You do have a history degree, the least you can do is put it to some use.\"\nDerek's eyes narrow, fingers tightening around his fork.\n\"Actually,\" Stiles says, and they both turn to look at him. \"No, thanks.\"\nDerek blinks. \"No thanks?\"\n\"Yeah.\" Stiles shrugs. \"We won't need your help, even with your big bad history degree.\"\nThere's silence for a long moment, and then Laura starts to cackle in pure glee while Peter gives him a speculative look.\nDerek seems completely thrown for a second, and then raises both eyebrows in obvious disbelief. \"I'm not sure if Cora told you, but history is her worst subject.\"\n\"Eff you,\" Cora says, but it's easy and she doesn't sound too bothered by Derek's statement.\n\"Maybe it is,\" Stiles agrees, and picks up his roll to tear a bite off. \"But I've got a hundred average in Ms. Newman's class, so I don't think it'll be a problem.\"\nLaura lets out a choked noise and laughs harder.\n\"A hundred –\" Derek breaks off and scowls, stabbing at his green beans.\n\"Are you serious?\" Cora asks, and now she sounds as gleeful as Laura.\nStiles blinks, completely lost. \"Uh, yeah? It's still pretty early in the year, though.\"\n\"Derek only managed a ninety-eight in her class,\" Peter says, and smiles sharply at his nephew. \"He's always held a grudge.\"\n\"Oh.\" Stiles bites down on his bottom lip; it's probably rude to feel so smug about that, but he can't quite bring himself to care. \"Well, a ninety-eight isn't that bad.\"\nCora bursts into hard, snorting giggles, and Stiles is pretty sure Laura is having trouble breathing at this point. The glare Derek sends him makes him glad laser vision isn't actually a thing, because he's pretty sure he'd be an instant pile of ash if it was.\n\"Oh, yes,\" Peter says, smiling that creepy smile again. \"You will fit in quite nicely.\"\nStiles rolls his eyes. \"History project,\" he mutters, and hears Peter snort.\nDerek ignores him for the rest of dinner, opting instead to bicker with Laura about his precious leather jacket. Stiles doesn't care; if some guy he's barely met wants to get pissy because Stiles is making a higher grade in a high school subject than he did, then that's not his problem.\nAfterwards, Cora doesn't even give him a chance to offer to help clean up, sending him out to his Jeep to grab his History book and the notebook he'd brought with him and then dragging him upstairs to her room.\n\"It'll be quieter in here,\" she says, sitting cross-legged on her bed and reaching for her backpack. \"It can get pretty loud downstairs, with all the kids trying to out-scream each other and everyone else yelling at them to keep it down.\"\nShe grins and Stiles gets the feeling that she doesn't actually mind the noise all that much. \"Okay,\" he says, dropping down into her desk chair and opening his notebook. \"So I guess we should decide what to do this project on. Do you have any ideas?\"\n\"Not really.\" Cora shrugs. \"Derek wasn't lying when he said history isn't my best subject. He normally helps me with homework and stuff, but he said Ms. Newman would know if he helped with something like this.\"\n\"She probably would,\" Stiles concedes, however reluctantly. \"Is he normally that much of an ass?\"\nCora grins. \"Sometimes, but only when he's really annoyed or surprised by something.\"\n\"So if we threw him a surprise party he'd just glare grumpily at everyone the whole time? Maybe try to make someone spontaneously combust with the force of his sexy-scary gaze?\"\nThere's a low banging and a muffled curse on the other side of the wall behind Stiles, making him jump and glance over his shoulder, and Cora starts laughing.\n\"Something like that,\" she says after a few seconds. \"Alright, come on, project. You said you were good at history, so is there anything you really want to do?\"\nStiles shrugs, holding his open notebook out to her. \"I made a list of things that sounded interesting, but nothing specific jumped out at me. You can choose if you want to. It's the research part I like most, anyway; I once wrote a paper on the history of male circumcision because I got caught in a downward spiral of clicking random Wikipedia links.\"\nCora gives him the same odd look he always gets when he mentions that particular paper, and he just grins at her in return. Shaking her head, she takes the notebook and starts reading over the long list of random subjects he wrote down the night before. When she gets to the bottom, her eyebrows raise in obvious surprise.\n\"Dude, werewolves?\"\nThere's another thumping bang on the other side of the wall, but Stiles ignores it this time. \"Yeah, I really like mythology and stuff, so I thought it might be kind of fun to do something about the history of werewolves – like, how their mythology is perceived throughout history all over the world.\"\n\"Why werewolves?\" Cora asks, and her expression seems caught between wariness and excited curiosity. \"Why not vampires or, uh, faeries or something?\"\nStiles shrugs. \"I don't know, I like werewolves. We could do something else if you wanted to, though.\"\nCora's door opens before she can say anything, and Derek leans in to scowl at her. \"Really, Cora? Werewolves?\"\nStiles blinks.\n\"Relax, Derek.\" Cora rolls her eyes. \"He said 'werewolf mythology throughout history' not 'werewolf history'.\"\n\"There's a difference?\" Stiles asks, and Derek glares at him while Cora just looks amused.\n\"You can't do your project on that,\" Derek says flatly, flicking his gaze back to her. \"You know you can't.\"\nCora narrows her eyes. \"Hey, Stiles?\"\n\"Yeah?\"\n\"I think I'd like to do werewolf mythology for our project.\"\n\"Werewolf mythology it is,\" Stiles says, taking the notebook back and flipping to a clean page.\n\"Cora –\" Derek starts, but then he and Cora both freeze, turning their heads slightly. \nAfter a moment Cora grins triumphantly and lets out a loud, \"Ha!\"\nDerek growls – actually growls, what the fuck – and slams the door as he leaves.\n\"So,\" Stiles says after a moment. \"That wasn't weird at all.\"\nCora shrugs. \"We're a weird family.\"\n\"Do you actually want to do our project on werewolf mythology or was that just to annoy your brother?\"\n\"Yeah, totally,\" Cora says, and gets up to grab her laptop from the desk where Stiles is sitting. \"This is something I might be able to actually pull my weight on.\"\nStiles has no idea what that means, but a lot of things haven't made any sense since he arrived at the Hale house, so he lets it go. They spend the next few hours on Cora's laptop, researching the different origins of the werewolf myth for several different cultures. When he finally leaves around ten, Stiles thinks this whole thing might not be as bad as he was expecting.\n*\n\"I'm telling you, Scott, the guy is a complete asshole.\"\n\"So you've said.\" Scott pulls open one of the glass doors to the Beacon Hills Cinema, letting Stiles pass through before following. \"At least five times.\"\nStiles scowls, dodging a group of loud pre-teens. \"It's just – everyone else was so nice, you know? A lot nicer than I expected. Even Uncle Peter, who was weird as fuck. So what's Derek's problem? I didn't fucking do anything to him.\"\n\"Maybe he's just, you know, an asshole in general?\"\n\"I don't know. Cora said he usually helps her with her history homework since he's got a degree, and that doesn't sound like someone who's an asshole to everybody.\"\nScott sighs and grabs Stiles' elbow, halting him in place. \"Stiles. Why do you care?\" Stiles gives him a blank stare, and Scott rolls his eyes. \"You've had twenty minutes of interaction with the guy at most but you've been talking about how much of an asshole he is for the past hour and a half. You don't normally care when people are assholes to you, because you're just an asshole back and that's that.\"\n\"I think we've said the word asshole too much, it's starting to lose its meaning.\"\nScott groans and punches him in the arm. \"Seriously, dude. Either shut up about this Derek guy or admit that you want him to like you.\"\n\"Why would I want him to like me?\" Stiles asks, indignant. \"He was rude and he called me a stray and he got insulted and pissed off when I said we wouldn't need his help with the project – help he had already refused, by the way – and then he tried to tell us we couldn't choose werewolves as our topic. It doesn't matter that he's older and hot and has a leather jacket and apparently drives that sweet Camaro I parked behind last night. He's an asshole.\"\nScott stares at him. \"Do you even hear yourself?\"\n\"Yes, actually. I'm saying it doesn't matter how physically attracted I am to him, his personality sucks. Now are we going to go watch a movie or are we going to keep talking about Derek?\"\nScott rolls his eyes so hard Stiles thinks they might actually fall right out of his head. \"Whatever, dude, let's just get some snacks and get to the movie before it starts.\"\nExcept when they reach the front of the line leading to the counter, Derek himself is on the other side, in the black uniform t-shirt all employees wear. Stiles stares at him in complete bafflement. \"You work here?\"\nDerek sighs, like it's some kind of torture to even acknowledge him. \"Yes, Stiles, I work here. I've worked here for the past four months.\"\nDerek remembers his name. What the fuck. \"Four months?\" Stiles repeats. \"But we're in here all the time, why haven't I seen you?\"\n\"Maybe you just weren't paying attention,\" Derek says, and it comes out tight and pained and kind of annoyed.\nStiles frowns; this must be why he vaguely recognized Derek the night before, and he's more than a little put out with himself for not really seeing him before.\n\"Um,\" Scott says. \"Stiles, we're kind of holding up the line.\"\nDerek's eyes flick behind them at the reminder and then he starts moving. \"Two Cokes, two large popcorns with extra butter, three Reese's, two Whoppers, and some Skittles?\"\nStiles stares in astonishment. \"Whoa.\" \n\"Dude,\" Scott says, grinning. \"You have our order memorized?\"\nThe tips of Derek's ears turn pink but he flashes Scott a return smile as he fills their cups. \"That would be a lot harder to do if you ever ordered anything different.\"\nStiles frowns, his heart sinking slightly in disappointment. So it really is just him Derek doesn't like, for whatever reason. That shouldn't hurt as much as it does, considering this is only the second time they've exchanged words, but Stiles has to look away as Derek finishes putting their stuff together and rings it up.\nThey pay and Stiles gathers up his half of the junk food, says, \"Thanks, Derek,\" and ignores Scott's widening eyes as he turns and heads for the guy who will take the tickets they bought at the door.\nScott hurries after him. \"That's Derek?\"\n\"Yep,\" Stiles says shortly, and they each do a familiar balancing act as they hand over their tickets and are let through into the main hallway with all the individual theater doors. \"I guess he really is just an asshole to me. Can't say I blame him; I'm fully aware that some people can't handle this much awesome.\"\n\"Dude,\" Scott says, looking at him like he's insane. \"He has our order memorized.\"\n\"Yes, which he informed you of after getting annoyed at me just for talking to him.\"\n\"You're an idiot,\" Scott says. After a pause he adds, \"Are you jealous?\"\nStiles glares at him. \"Jealous of what? Need I remind you, I barely know him. If he wants to blush and smile and flirt with a guy who's already got a girlfriend, then who am I to stop him?\"\n\"You think he was flirting with me?\" Scott says, incredulous. \"Dude, you're like my brother, but I've got to tell you – you've reached stupid levels of oblivious.\"\nStiles tries to be insulted, but he just can't manage it. Scott doesn't have a truly mean bone in his body, and Stiles can never hold anything against him. \"Look, whatever, can we please just go watch this movie and forget all about Derek's weird hate-boner for me?\"\nScott's face does something funny that Stiles can't interpret. \"I don't think it's – you know what, never mind. I think I hear the previews playing.\"\nThey manage to trip their way into the correct theater without dropping anything, and for the next two and a half hours Stiles does his best to lose himself in someone else's fictional problems.\n*\nAt lunch on Monday, Stiles, Scott, Allison, and Lydia are joined by Cora, Isaac, Boyd, and Erica.\nStiles stares at them for a long, confused moment, but then he realizes that the four of them seem to be just as close as Stiles and his little group. \"So is this going to become a thing?\"\nCora shrugs. \"Why not? We're all doing these projects with each other, so we'll all be spending a lot of time together. Makes sense to me.\"\nStiles glances around the table; Scott and Allison are already deep in some sort of discussion with Isaac, and Boyd is sitting quietly next to Erica, the two of them holding hands as she and Lydia talk about things Stiles probably doesn't give two shits about.\n\"Okay,\" he says, and Cora looks amused.\n\"So Derek said you and Scott went to the movies on Saturday and you actually talked to him this time.\"\nWhat.\n\"Uh,\" Stiles says. \"Yeah, he said he's been working there for four months already, but I'm not sure I believe him. I'm pretty sure I would have noticed someone like that.\"\nCora raises both eyebrows. \"Someone like what?\"\nThere's laughter in her voice and Stiles honestly hadn't meant to say that. He flushes, reaching for his water. \"Nothing, I didn't mean anything by that. Just that I was surprised to see him.\"\n\"Uh-huh,\" Cora says, and bites into her apple. \"Did you get any more research done this weekend?\"\nStiles shakes his head, grateful for the change in subject. \"Not really. What about you?\"\n\"A little, but nothing like what we managed to find on Friday.\" Cora's eyes narrow slightly, and she gives him a considering look. \"Why don't we each see what we can pull up this week, and meet again at my house on Friday?\"\nStiles hesitates. He had liked Cora's family, and despite the noise level they had actually gotten quite a bit done once they'd separated themselves from it. Except Peter had called it 'family dinner nights' which implied the whole family was always there on Fridays, which meant that Derek would be there.\n\"Maybe we could do it at my house this time? On Saturday, since Fridays are your family night. We can order pizza or something.\"\nCora almost looks like she wants to argue, but after a moment she nods. \"Just so we're clear, you're not trying to trick me into a date or something?\"\n\"What? No,\" Stiles says, almost knocking his water bottle down as he does a small, contained flail. \"I mean, I'm not blind, you're gorgeous, but I'm not interested in you like that. Jesus Christ, don't kill me.\"\nCora laughs. \"Alright, calm down, I believe you. Text me your address before this weekend. Is six-thirty okay?\"\n\"Yeah, six-thirty is good,\" Stiles says, and doesn't bother to keep the relief out of his voice. The more he can avoid Derek, the better.\n*\nFifteen minutes before Cora is supposed to get there, Stiles grabs his history book, his notebook, and his laptop and takes them all downstairs. They could probably study in his room, but he really doesn't want his dad to get the wrong idea, so living room it is. After dumping his stuff on the coffee table he heads for the kitchen, unsurprised to find his dad sitting at the table with a cup of coffee and a few files spread out in front of him.\n\"Hey, Dad, what's up?\"\nJohn glances up, looking at him over the top of his glasses. \"Just looking over something a friend of mine out of state sent me. Is it dinner time already?\"\n\"Yep, we're going to order pizza.\" Stiles drops down in the seat opposite and reaches for the nearest paper, immediately jerking it back when John smacks it. \"Oh, come on!\"\n\"No,\" John says, taking off his glasses. \"Did you say pizza?\"\nStiles glares, rubbing the back of his hand. \"Yeah, I did, though now I'm reconsidering letting you have any with actual meat on it.\"\n\"You were going to willingly let me have pizza with meat? What's the occasion?\"\n\"No occasion.\" Stiles shrugs. \"My partner for the history project Ms. Newman is making us do is coming over to work on it, and I thought it would be easier to just order pizza than try to cook anything.\"\nJohn raises both eyebrows. \"You're doing a partnered project without Scott?\"\n\"Assigned partners, no way around it.\"\n\"Ah.\"\n\"Cora's okay, though,\" Stiles says. \"I'm only about seventy-five percent terrified of her now, which is a marked improvement.\"\nJohn shakes his head, looking far too amused than the situation warrants. \"Son, do we need to have a talk?\"\nStiles eyes him suspiciously. \"Talk? About what?\"\n\"About the fact that the last girl you were 'terrified' of you swore up and down you were going to marry. Should we have, you know, a talk?\"\n\"No.\" Stiles points a warning finger at him. \"We do not need to have any sort of talk like that, ever. Okay?\"\n\"Are you sure? Because if I end up with grandkids before you're twenty-five –\"\n\"Oh my god!\" Stiles waves his hands at his dad, and he knows he's flushed all the way to his hairline. \"I don't like Cora like that. She's just a friend.\"\nJohn doesn't look entirely convinced. \"Okay, well. Just in case, you know you should –\"\nStiles closes his eyes and plugs his ears with his fingers. \"I can't hear you, lalalalalalalalala –\"\n\"Stiles.\"\nHe squints out through half-closed eyes to see his dad with his arms crossed, giving him a flat, unimpressed look. Stiles sighs and drops his hands. \"Always use a condom, every time with no exceptions. Both parties must be completely sober and full consent must be willingly given. And yes, I know how to put on a condom.\" He winces. \"In theory.\"\nJohn looks like he wants to say something else to that, but before he can there's a knock on the door. He shakes his head and stands, patting Stiles on the shoulder as he passes. Stiles takes a deep breath and counts to five before following.\nHe's only a few steps behind when John swings the door open – and stumbles over his own feet when he sees Derek standing beside Cora on the other side. He manages not to fall flat on his face, but his dad still glances at him in exasperation. Cora looks like she's fighting back a smirk, and Derek's cheeks are a faint pink color.\n\"Uh, hey,\" Stiles says, clearing his throat. His heart is suddenly pounding. \"Dad, this is Cora and her brother Derek. And, uh, this is my dad, Sheriff Stilinski.\"\n\"Nice to meet you,\" John says, stepping aside to let Cora in before reaching to briefly shake Derek's hand. \"Stiles didn't say you were coming too.\"\n\"I'm not staying,\" Derek says, glancing at Stiles before quickly looking back at John. He shoves both hands into the pockets of his leather jacket. \"I, uh, I work down at the movie theater and I'm covering for someone for a few hours tonight. I just thought I'd drop Cora off and pick her back up, since it's on the way. It was kind of a last minute thing.\"\n\"Well that's nice of you,\" John says, sounding approving. \"No wonder Stiles was so surprised to see you.\"\nStiles only realizes he's staring at Derek when he turns a glare on his dad.\nDerek clears his throat, and Stiles' gaze snaps back to him. \"I should get going –\"\n\"Of course, don't let us make you late,\" John says, waving him off.\nDerek nods. \"Bye, Stiles,\" he says, quiet, and Stiles is so surprised all he can do is wave pathetically.\nJohn shuts the door and cuts off Stiles' view of Derek's retreating back. \"Stiles.\"\nStiles blinks, looking over to see his dad fighting back a smile. \"Yeah?\"\n\"I think we had the wrong talk,\" John says, clapping him on the shoulder, and there's a burst of laughter from the living room. Oh god, Stiles is going to die.\n\"Oh my god, you are the worst.\"\nJohn chuckles. \"Go get started on your project, I'll order the pizza.\"\nStiles narrows his eyes, but when John just raises his eyebrows and looks significantly between Stiles and the door, he lets it go. \"Fine, but don't go overboard, okay?\"\n\"Whatever you say, son.\"\nCora is waiting in the living room, having already taken off her jacket and made herself at home on the couch. She gives Stiles a wicked grin when he walks in, but he ignores her as he sits down and opens his laptop, pulling up the pages he had bookmarked over the week.\n\"So, uh,\" Stiles says, clearing his throat. \"I hope you like lots of meat on your pizza, because my dad's doing the ordering.\"\n\"That's fine.\" Cora had set her own laptop down next to Stiles', and leans forward to boot it up. \"Did you find anything interesting?\"\n\"A few things. Mostly stuff about Ovid and religion and King Lycaon. There's a lot of conflicting information out there. What about you?\"\n\"I tried,\" Cora says, shrugging. \"But I kept getting frustrated at all the bullshit.\"\nStiles frowns, pulling up one of the pages he had found most helpful. \"It's kind of all bullshit, though, isn't it?\"\nCora hums, and Stiles can't tell if it's in agreement or disagreement. \"Maybe.\"\nStiles glances over at her, but she's staring at her computer screen like it'll disappear if she looks away. \"Okay, well. I guess you should tell me what you think is bullshit so we're on the same page here. We both have to agree with what goes in this project.\"\nCora grins sharply at him. \"Show me what you've found, and I'll tell you my opinion.\"\nThey devour an entire pizza between them as they go through Stiles' project bookmarks, and as it turns out, Cora thinks almost everything is bullshit.\n\"This is ridiculous,\" Stiles finally says, throwing down the last bit of crust from his half of the pizza. \"I bookmarked over a hundred pages, and you're telling me that all but five of them are completely wrong about the history of werewolves?\"\n\"More or less.\" Cora picks a mushroom off her last slice and drops it into her mouth.\nStiles stares at her. \"That doesn't even make any sense. Some of these are like, legitimate historical sites.\"\n\"Legitimate to humans maybe.\"\nStiles throws his hands up. \"I don't know what the hell that's supposed to mean, but I think you've actually managed to fry my brain over the past three and a half hours, so I'm just going to let it go.\"\nCora laughs, and then pauses to tilt her head, glancing toward the door. \"Derek's here,\" she says cheerfully, and picks up her can of Coke to finish it off.\n\"What,\" Stiles says, and then hears the faint sound of a car door slamming. \"Wait a minute, how –\"\nA knock on the door interrupts him, and Stiles ends up gaping as Cora stands and grabs her jacket.\n\"Walk me to the door,\" she says, picking up her laptop. \"It's polite.\"\nStiles doesn't argue, just stands and trails behind her. She swings the door open before he can reach it, stepping out beside a waiting Derek.\n\"We're having a small Halloween party on Thursday,\" Cora says. \"I know it's a school night but our parents said we could, since Halloween parties are just better when they're actually on Halloween. I've already told Isaac, Erica, and Boyd to invite Scott, Allison and Lydia, so it won't just be a bunch of people you don't know.\"\nShe takes off toward the car before Stiles can answer, leaving him and Derek alone on the porch. He hesitates; it sounds like fun, and his dad is working that night anyway, but school night parties don't usually end up the greatest for him.\n\"You should come,\" Derek says, and it actually sounds like he kind of means it.\nStiles glances behind him to make sure his dad isn't within hearing range, and then turns back with a nod. \"Yeah, totally.\"\nDerek actually smiles at him, and it does something really horrible to Stiles' insides.\n\"Great,\" Derek says, and it comes out on a breath. \"It starts around eight, I think.\"\nStiles nods. \"Okay. I'll, uh, see you then.\"\nDerek nods, smile widening just a little before he turns and almost jumps down the few steps to the walkway. Stiles slowly shuts the door and then just stands there staring at it, heart going a mile a minute, until he hears Derek's car start and then drive off down the road.\n\"What the hell just happened?\" he mutters under his breath.\nJohn clears his throat behind Stiles, making him jump and spin around. He's staring at Stiles with open amusement, and crosses his arms over his chest.\n\"Really?\"\nStiles winces. \"I have no idea what you're talking about.\"\n\"Uh-huh,\" John says, expression as doubtful as his tone. \"I'm talking about the apparent attraction you have for your project partner's older brother. Emphasis on the 'older'.\"\n\"I don't – it's not – crap.\"\n\"Don't tell me you're just now realizing it.\"\n\"Maybe? I mean, I'm not blind, but I don't really know him so it's mostly just physical at this point. Uh.\"\nJohn sighs. \"Exactly how old is he?\"\nStiles rubs at his forehead with his thumb. \"Twenty-two.\"\nBoth eyebrows go up at that. \"Not as old as I was expecting, honestly. And he works down at the Beacon Hills Cinema? What about college?\"\n\"He's already got a bachelor's. I think he said something about taking a year off before going back.\"\n\"Hm,\" John says.\nStiles sighs and shakes his head. \"Dad, stop. I might have a tiny, inappropriate crush on him – which I was happily in denial about, thank you so much for that – but he's not even remotely interested in me. So quit worrying.\"\nJohn gives him an incredulous look. \"Son, I don't know if you noticed, but he wasn't wearing his uniform shirt tonight.\"\nStiles blinks. \"What?\"\n\"I've been to the movies before, Stiles. All the Beacon Hills Cinema employees wear a black t-shirt with a small logo on the front and a bigger one on the back. Right?\"\n\"Yeah?\"\n\"Derek was wearing a green Henley.\" Stiles stares at him blankly and John sighs. \"You're smart enough to figure this out on your own. I'm going to bed.\"\nStiles watches as John turns and climbs the stairs, calling out a goodnight when he reaches the top, and then he goes back into the living room to gather his stuff. His laptop is still open to one of the pages Cora had approved of, and Stiles groans as he shuts the lid with a snap. There's too much going on in his head and he just doesn't feel like dealing with any of it.\nHe takes his things upstairs, dumps his book and notebook on his desk, changes into his pajamas, and then reopens his laptop. He doesn't even bother to look at all the research still pulled up, closing all the tabs and opening a new one so he can pull up his favorite free porn site.\nOrgasms are the best kind of escapism.\nTwenty minutes later, when his pajama pants are shoved down to his knees and he's just come all over himself from watching a video of a dark-haired, scruffy, muscled guy pound into a not-quite-as-muscled, brown-haired, freckled guy, Stiles thinks he might have a problem.\n*\nCora tells them all that some sort of costume is required for the party, so Stiles goes out and buys a pair of black skinny jeans, a tight black t-shirt, a leather belt with silver studs on it, and a cheap pair of black boots. He lets Erica draw a few temporary tattoos on his arms at lunch and borrows Lydia's eyeliner to complete the look.\nIt's not much as far as costumes go, but the last time he'd gone all out on a Halloween costume he'd ended up dressed as a bunny rabbit in a toga. It hadn't been pretty.\nThe four of them decide to go together in Allison's car since she's the designated driver, so Stiles is waiting outside when they pull up to the curb and the back window rolls down.\n\"Get in, loser!\" Lydia yells, and Stiles grins.\n\"Dude, you look so weird like that,\" Scott says, turning to look at him from the passenger seat as Stiles slides into the back next to Lydia.\n\"Good weird or bad weird?\"\n\"Good weird,\" Allison and Lydia say at the same time as Allison pulls out on to the road.\nLydia grips his face in her hand, turning him every which way to examine the eyeliner. \"Not bad, Stilinski. I had my doubts, but you actually managed to do a good job.\"\n\"Thanks,\" Stiles says dryly, and swears never to tell her about the five times he poked himself in the eye.\nIt's going on eight-thirty by the time they get to the Hale house, and the party is in no way small. Stiles had wondered how many people would come to a party this far out, but apparently a house in the woods is the perfect set up for a Halloween party. \nThere's a shit ton of cars parked along the driveway, and people are going in and out of the house and milling around the yard. Music is blasting from somewhere, a strobe light is hooked up to the porch roof, and Stiles is pretty sure the line leading around the side of the house is to the kegs. Spider webs go all the way from the porch to the roof, covering several windows, and one of the windows is half-open with a fake corpse spilling from it, blood flowing down the side of the house. There's even a little cemetery set up towards the left side of the house, right next to the edge of the woods, with what looks like zombie parts scattered throughout.\n\"Dude, this is awesome,\" Scott says as they all climb from the car. \"So worth a school-day hangover.\"\n\"I'll remind you of that tomorrow,\" Allison says, hooking her arm through his and kissing his cheek.\n\"Come on.\" Lydia threads her own arm through Stiles', pulling him towards the house. \"Show me this Derek guy.\"\n\"Wait, what?\" Stiles says, digging his heels in. \"Lydia, no.\"\n\"Yes.\" Lydia tugs hard enough to make him stumble. \"He's the first person to truly capture your attention since you got over me. I have to meet him.\"\n\"Lydia,\" Stiles says, pleading even as he lets her drag him along. \"This isn't necessary. I have so far managed not to completely humiliate myself in front of him, and I would like to keep it that way. Besides, he kind of hates me. Also he's Cora's brother, not some random guy I happened to meet.\"\nLydia scoffs. \"Honey, you have no idea, do you?\"\n\"Apparently not,\" Stiles mutters to himself, because Lydia has pulled him around the side of the house to the crowded backyard.\nLaura is manning the kegs, handing out drinks to whoever doesn't already have one. She waves cheerily when she sees Stiles, but her face falls a little when she notices Lydia. \"Hey, Stiles,\" she says when they get close enough. She hands them both a drink, eyeing Lydia curiously. \"Who's this?\"\n\"My friend Lydia,\" Stiles answers, and downs half the beer in two big gulps. \"She wants to meet Derek.\"\nLaura's eyebrows shoot up. \"Stay here,\" she tells Stiles, and then grabs Lydia and pulls her several feet away. Stiles scowls after them, and then glares at a girl who tries to edge around him to the keg. A few short moments later Laura and Lydia return, Lydia looking smug and Laura with the biggest shit eating grin Stiles has ever seen. Laura grabs his cup and tops it off before handing it back. \"One is your limit, and if anyone asks, you didn't get it from me. Derek is somewhere inside, sulking because you weren't here at eight.\"\nStiles blinks at her. \"What.\"\nLydia drags him away before she can respond, but from the way Laura is already filling cups for other people he doesn't think she would have answered anyway.\nFinding Derek isn't as easy as just going inside, as it turns out. The house is packed, and the only reason Stiles doesn't lose Lydia is because she doesn't let his arm go. They walk around for close to an hour, and he hasn't seen Scott and Allison since they arrived. A lot of kids from school are there, and even more people that Stiles doesn't recognize. They're probably friends of Derek's and Laura's, though he has no way of knowing for sure.\nSomehow Stiles ends up with a cup full of punch from the kitchen, and it definitely has something stronger than beer in it. By the time he finishes it he's got a pleasant buzz going, and they still haven't found Derek.\n\"Can we give up now?\" Stiles asks, almost yelling directly in Lydia's ear to be heard over the noise level. \"This is a party, and all we're doing is walking around.\"\nLydia rolls her eyes. \"Ugh, fine. But don't for one second think I'm letting this go.\"\n\"Wouldn't dream of it.\"\nLydia grins at him and pats his cheek before disappearing into the crowd. Stiles sighs and makes his way back toward the kitchen; he needs more of that punch before it disappears.\nHis cup full and his head fuzzy just around the edges, Stiles wanders through the house. He's buzzed enough to dance a little when a good song comes on, but not drunk enough to really let loose. A few of the kids from school wave at him, and he waves back without really talking to any of them.\nIt's a fun party, but Stiles can't help but be a little disappointed that he hasn't seen Derek yet. Maybe Derek was just being polite by saying he should come, and hadn't actually cared if Stiles showed up or not. That thought makes something in Stiles' stomach twist, and he sighs, throwing back the last swallow of his drink.\nMaybe he should get more. Yeah, maybe – why the fuck not, right? He should definitely get more punch.\nOf course, when he rounds the corner into the kitchen he slams straight into Derek. He stumbles back, nearly losing his balance, but Derek reaches out and grabs his arms before he can fall.\n\"Stiles?\" Derek says, eyes going wide as he takes in Stiles' costume. \"Jesus Christ.\"\nStiles blinks at him, then grins widely. \"Oh, hey, Derek. I've been looking for you.\"\n\"You have?\"\n\"Yeah, my friend Lydia – she wanted to meet you.\"\n\"Oh.\" Derek's voice goes odd, and he drops his hands. Stiles tries not to pout at the loss, and brings his cup up for another drink before remembering that it's empty. \"How many of those have you had?\"\n\"What?\" Stiles squints his eyes as Derek nods toward the cup. \"Oh, uh. Two. And a beer.\"\nDerek sighs and takes the cup, throwing it away before he grips Stiles' elbow with his hand. \"Come on, let's get you some fresh air.\"\nStiles would argue – he wanted more punch – but Derek's hand is warm and he's volunteering to spend actual time with him, so he goes with it, letting himself be led out the back door. It's a lot cooler outside than in, and the chilly air hits him like a slap in the face.\n\"Shit.\" Stiles takes a deep breath and rubs one hand over his face. \"That punch sort of sneaks up on you, doesn't it?\"\nDerek huffs out a laugh. \"It definitely seemed strong enough to.\"\nStiles squints at him again, his brain too full of alcohol to even try to parse that one out. \"You and Cora both talk in riddles, it's extremely frustrating.\"\n\"Do you want to go for a walk?\"\n\"Wow, that came out of nowhere.\" Stiles looks around at the crowd and then back to Derek. \"Uh, yeah. Sure, let's go.\"\nDerek almost visibly relaxes, and Stiles hadn't even realized he was tense. \"Come on, I'll show you the graveyard. I don't think anybody's over there right now.\"\n\"How can you possibly know that,\" Stiles mutters, but Derek is already walking away so he just follows.\nDerek's right, of course; aside from random dismembered zombie parts, the graveyard is empty.\n\"This is really cool,\" Stiles says, walking slowly through the gravestones and reading off the names. \"I know it isn't a real cemetery since I didn't see it last time I was here, but it sure as hell seems like it. Props to whoever put it together.\"\n\"Thanks,\" Derek says, and shrugs when Stiles looks up at him. \"Laura and Cora decorated the house; I did this. I wanted it to give off that sort of weird feeling you get from an old graveyard at night. People like to be scared, so I thought it would add to the overall vibe of the night.\"\nStiles raises an eyebrow. \"You know, I'm pretty sure that's the most you've said to me since we met.\"\nHe thinks Derek flushes, but it's hard to tell in the shadows of the trees. Stiles can, however, easily see his smirk. \"Maybe you make me nervous.\"\nStiles scoffs, though he can't help but grin as well. \"Oh, really? Is that why you've been such an asshole to me?\"\nDerek shrugs, stepping closer. \"You kind of took me by surprise. Besides, if I'm an asshole, so are you.\"\n\"Oh, wow, dude. You are such a sweet talker. I'm a puddle of goo.\"\n\"Just telling it like it is.\"\nStiles laughs a little in disbelief, and the expression on Derek's face is one of wicked humor. \"I don't know if I should be insulted or proud of myself.\"\n\"Go with insulted.\" Derek grins. \"Less egotistical and makes for more interesting conversation.\"\n\"Well, in that case, fuck you.\" Derek makes a considering noise, and no, Stiles can't handle that, so he starts walking again. \"Did you come up with all of these names, too?\"\n\"No. They're, uh. They're names of family members who have passed away. Since Halloween is meant to be the one night a year the veil between the living and dead is at its thinnest, I thought it would be a nice way to include them in the fun.\"\nStiles thinks of his mom, and how she had always gone all out for Halloween and Christmas. The Nightmare Before Christmas had been her favorite movie because it included both holidays, and he smiles a little sadly as he brushes his fingers over one of the headstones.\n\"That's really nice. A little macabre, but also nice.\" He looks up and Derek is watching him curiously, but Stiles doesn't want any sympathy right now so he clears his throat. \"So what are you supposed to be?\"\nDerek blinks. \"What?\"\n\"Your costume.\" Stiles gestures to his dark jeans and black Henley, the sleeves pushed up to just under his elbows. \"Everybody else is dressed up, why not you?\"\nDerek stares at him for a moment, like he's considering something, and then smirks. \"I am, though.\"\n\"Really? Because it looks like you're just… you.\"\nDerek's smirk grows, and he takes a step closer. Stiles automatically steps back in surprise, hitting a tree just on the edge of the forest surrounding the Hale house.\n\"Oh, I'm definitely something,\" Derek says, stepping closer again, even though Stiles has nowhere else to go. They're almost touching now, Derek's converse less than inch from Stiles' boots. \"I'm one of the most dangerous creatures to ever exist. I could rip your throat out with my teeth, or tear you open with my claws.\"\nStiles stares at him, shakes his head.\nDerek chuckles, low and dangerous sounding. \"A werewolf, Stiles.\"\nAnd he smiles, teeth far more sharp and dangerous looking in the moonlight than they had seemed before.\n\"Whoa,\" Stiles says, leaning forward. \"Dude, those look so realistic. Can I touch? Have you been wearing those the whole time?\"\nDerek snorts, rolling his eyes. \"No, you can't touch,\" he says, and his words come out a bit more slurred than they were before, like he's having to talk around the teeth, but that doesn't make any sense if he's been wearing them all night. \"And sort of.\"\nStiles frowns, tilts his head as he studies them. \"But –\"\n\"What's your costume? I told you mine, it's only fair.\"\nStiles is thrown for a moment, but then he shrugs. \"Punk rocker. Doesn't matter which one, so take your pick.\"\n\"Punk rocker?\" Derek leans back far enough to drag his eyes down Stiles' body and then back up. Stiles flushes, going hot all over. \"No, I don't think so.\"\n\"What? Dude, I so am. Black clothes, studded belt –\"\nBut Derek is shaking his head. \"No, no. See, if you had someone specific in mind then that might work, but since you don't then you're not nearly punk enough.\"\nStiles narrows his eyes. \"I've got tattoos. Okay, they're fake tattoos, but Erica is an amazing artist and they look awesome.\"\nDerek smirks, slow and wicked, and when he speaks again his voice comes out low. \"Yeah, but you don't have any color in your hair.\"\nStiles' eyes go wide as Derek reaches out and runs his hand through Stiles' hair, curling his fingers and tugging slightly to pull Stiles' head back and expose his throat.\n\"And you don't have any piercings.\"\nDerek's hold on his hair doesn't loosen as he brings his free hand up to trace a finger over Stiles' eyebrow, down the ridge of his nose, over his bottom lip. Stiles' breath stutters out, and Derek's eyes flick up to his, wicked-looking even in the shadows.\n\"And I'll bet,\" Derek continues, stepping impossibly closer and pressing his body against Stiles', \"that the tattoos don't go past your arms.\"\nHis free hand drops down to Stiles' waist, fingers finding their way under the hem of his t-shirt, and he leans in to brush his nose against Stiles' cheek. He growls softly at the place where Lydia touched Stiles earlier, and then drags his nose down Stiles' jaw to his throat. Stiles' heart is pounding, brain completely offline from the combination of alcohol and blood rushing to his dick. Derek presses an open mouthed kiss to Stiles' pulse point, and those teeth are as sharp as they look as they drag gently over his skin.\nStiles whimpers, and rolls his hips against Derek's.\n\"Derek! I'm sorry but we've got a problem. Get your ass over here now!\"\nThey both jump at the sound of Laura's shout, Derek pulling back quickly, and for a moment it almost looks like his eyes are glowing yellow. Stiles blinks and it's gone; it must have been the light, or maybe the alcohol.\n\"Goddamn it,\" Derek mutters, releasing Stiles with a sigh. \"We should go back.\"\nHe sounds about as reluctant as Stiles feels, but Stiles nods anyway and follows as Derek turns to walk back to the house. He really hopes his dick goes down soon. Fucking skinny jeans.\nWhen they reach the backyard it's obvious that there's been a fight. Actually, no, there's still a fight in progress, but Laura is between the two very drunk boys, holding one of them back with one hand while the other one brandishes a broken bottle at the two of them.\nDerek swears and rushes forward, aiming for the guy with the bottle, and Stiles chokes on a shout when the guy swings around and slashes the bottle at Derek's forearm. A gash appears, blood gushing out, and Stiles winces because that's definitely going to need stitches, and maybe a tetanus shot. Except then the gash closes back up, almost like it hadn't been there, and Stiles blinks, staring for a moment in utter bewilderment before shaking his head.\nFucking punch, making him see things. \nDerek easily wrestles the guy under control and forces him to drop the bottle. Laura grabs both boys by the front of their shirts and drags them away, cursing at them loudly. Derek scowls at them before running one hand through his hair and then tugging his shirt sleeves down.\n\"Are you okay?\"\n\"Yeah, I'm fine,\" Stiles says. \"I mean – I should probably go. It's getting late, and if the cops are called –\"\nDerek winces. \"Yeah, I think we should probably clear everyone out and shut it down anyway. Do you have a ride? We promised our parents we wouldn't let anyone who's been drinking drive out of here, and we were supposed to try and keep underage drinking to a maximum of zero.\"\nHe gives Stiles a hard look, but Stiles shrugs unapologetically.\n\"Yeah, I came with Scott, Allison, and Lydia, and Allison's our designated driver for the night. So I'm good, I just need to find them.\"\nDerek nods. \"Okay, uh, I think they're in the living room with Cora.\"\n\"Great. I'll see you later?\" Derek nods again, and Stiles gives him another small smile before turning to make his way towards the house. At the last second he stops and looks back. \"By the way, you should probably check that punch. I think there was some sort of hallucinogenic in it.\"\nHe glances at Derek's arm and then back to his face. Derek has gone slightly pale, and he pulls at the cuff of his shirt sleeve.\n\"Yeah, I'll do that.\"\nStiles finds his friends in the living room just as Derek had said, with Cora, Erica, Isaac, and Boyd. As soon as he walks up to them Cora turns and grins at him.\n\"So I guess you found Derek?\"\nStiles flushes. \"Maybe. Are you guys ready to go?\"\n\"Stiles!\" Scott says, cheerful and slightly slurred. He wobbles and throws one arm around Stiles' shoulders. \"This has been the best party. The best.\"\nStiles laughs, wrapping one arm around Scott's waist to help him stay standing. \"Yeah, it's been an experience. But Derek and Laura just had to break up a fight, so I think it's time we head out.\"\n\"Oh.\" Scott looks down at his nearly empty cup, shrugs, and downs the last two swallows. \"Okay, I'm ready.\"\n\"A fight?\" Allison frowns, looking worried. \"Was it bad? Was anyone hurt?\"\n\"Nah, everyone's fine.\" Stiles adjusts his hold on an increasingly heavier Scott. \"Seriously, can we go? I think Scott is falling asleep on me, and I'm not looking forward to tomorrow's hangover.\"\nAllison sighs and steps up to Scott's other side, pulling his free arm around her shoulders. \"Okay, come on. We're going to have to take him home first so you can help me get him up to bed.\"\nStiles calls out a bye as they make their way toward the door, and between the two of them he and Allison manage to get Scott to her car and dumped into the passenger seat. Allison buckles him in before going around to her side, and Stiles climbs in back with Lydia.\n\"Was Cora right, did you find Derek?\" Lydia asks as Allison slowly makes her way down the driveway, trying not to hit anyone.\n\"Yeah, I did. I ran into him in the kitchen. Literally.\"\nLydia reaches out to run one hand through his hair. \"So what happened?\"\nStiles hums and closes his eyes, leaning his head back against the seat. \"We took a walk through the little graveyard. We talked.\"\n\"And?\"\n\"And I'm willing to concede that he might not be as much of an asshole as I originally thought.\"\nLydia sighs, sounding completely exasperated. \"Did anything happen? Did he kiss you, at least?\"\n\"No, he didn't kiss me.\"\n\"What? Why not?\"\n\"Lydia, it's fine. We've had all of one decent, non-antagonistic conversation. Kissing is so far from being in the realm of possibilities it's almost funny.\"\nThough apparently sexually-charged neck sniffing is okay.\n\"Whatever,\" Lydia says, scratching her fingers on his head. \"You'll get there.\"\nStiles hopes she's right, so he just sighs and tries not to fall asleep before they get to Scott's.\n*\nWhen he gets to school the next morning Cora is waiting for him at his locker. Stiles grunts a greeting at her and she steps aside so he can put in the combination. It takes him a few long moments before he can remember what it is; his head hurts like a motherfucker.\n\"Derek told me what happened last night. Are you okay?\"\n\"I'm fine,\" Stiles says as his locker door finally pops open and he starts grabbing what he needs. \"Aside from the hallucinogenic effects of the punch and the massive hangover that's happening right now.\"\nCora doesn't say anything for a moment, and Stiles glances over at her. She's looking at him with an unreadable expression. Finally she sighs.\n\"Look, I'm grounded this weekend and next weekend we're going out for Derek's birthday –\"\n\"Derek's birthday is next weekend?\"\n\"It's on the seventh, actually,\" Cora says. \"Anyway, my point is that we won't be able to work on the project together for a couple of weeks.\"\n\"Oh.\" Stiles frowns, trying not to be disappointed. Cora's fun to hang out with, and right now she's his only link with Derek. \"Maybe we could go to the library after school? Or text whatever we find? Skype it? I don't know, my head hurts.\"\nCora shakes her head, looking amused. \"Grounded, Stiles. I don't know what that means for you, but for me it means straight home after school, no friends, no phone, no laptop.\"\n\"Oh, wow, that really sucks.\"\n\"We'll just have to work on it separately for a while, I guess. You can go over those sites I told you were okay, see what you find out.\" \nCora gives him a pointed look, but whatever she's trying to say goes right over Stiles' throbbing head.\n\"Yeah, sure, I'll definitely do that.\"\nCora sighs and rolls her eyes. \"See you at lunch?\"\n\"Hell yeah, today is pizza day.\"\nCora shakes her head again before disappearing into the crowd of students, and Stiles makes his way to first period English. He's unsurprised to find Scott slumped down in a seat at the back, furthest away from the big windows, his hoodie pulled over his head and his face buried in the crook of his arm.\nStiles pats him on the shoulder as he plops down in the seat beside him, and Scott lets out a pitiful moan, raising his head to blink blearily.\n\"Am I dead yet? Because I feel dead.\"\n\"Nope, sorry buddy,\" Stiles says. \"You're just going to have to wait this one out.\"\n\"I think I'm still drunk.\" Scott rubs at his eyes, sliding down in his seat. \"What the fuck was in that punch?\"\n\"I have no idea, but whatever it was made me see shit.\"\nScott drops his hand and stares at him with wide eyes. \"Seriously?\"\n\"Yeah.\" Stiles frowns. \"You didn't hallucinate anything?\"\n\"No way. Dude, what did you see?\"\nStiles shrugs, suddenly uncomfortable, and starts pulling what he needs from his backpack. \"Nothing major. It's no big deal, don't worry about it.\"\nScott squints at him, and he doesn't look entirely convinced but he does look too wrecked to care. \"If you say so. Hey, do you have a pen I can borrow?\"\nStiles hands over one of his extras, grateful when Scott doesn't ask any more questions. Maybe it wasn't the punch itself but something in the punch that he had some sort of reaction to. It's the only explanation that makes any sense, even though Stiles has never had an allergic reaction to anything before.\nBoth he and Scott flinch when the classroom door shuts behind the teacher, and he decides to let it go until a day when his head doesn't feel like it's been bashed in.\n*\nScott stays the weekend at Stiles' house, the two of them playing video games and eating as much junk food as they can, and then Stiles spends the first few days of the week trying to catch up on the homework he's been ignoring in favor of doing research for the history project.\nAfter school on the seventh, Stiles goes to the little Hallmark card store in town and buys a birthday card for Derek. It had taken him all week to make the decision to acknowledge Derek's birthday in some way, and his stomach is in knots the whole time he's perusing the cards. They've only known each other for about three weeks, and so far Halloween is the only positive interaction they've had with each other.\nStiles has no idea what he's doing. He's attracted to Derek on a very physical level, but he doesn't know if he likes the person Derek actually is. He thinks he could – he enjoyed their little back and forth on Halloween, and he thinks Derek did as well. Not to mention the fact that the sexual attraction definitely seems to be mutual.\nStiles shivers, remembering the feel of Derek's mouth against his neck, and finally picks a card that has a cartoon cake and a stupid pun. Once he gets back out to his Jeep he writes on the inside:\n\nA little birdie named Cora told me it was your birthday today.\n\n\nI hope you have a happy one.\n\n\n– Stiles\n\nBelow his name he writes out his phone number, and then panics for the next twenty minutes.\n\"Fuck,\" Stiles says out loud. He tucks the card into the envelope, writes Derek's name on the front, and tosses it into the passenger seat before starting the Jeep. He'll drive by the movie theater, and if Derek's Camaro is there he'll stop and leave the card; if it isn't then he'll go home and try to forget the way Derek's body felt pressed against his.\nThe Camaro is there, of course, and Stiles is both relieved and scared shitless. He swallows hard, heart pounding, and pulls his Jeep into the empty space beside the sleek black car. Refusing to let himself rethink it, he jumps out and puts the card beneath the driver's side windshield wiper, jumps back in his Jeep, and tears out of there far too fast.\n\"You're such an idiot,\" he mutters to himself, but he doesn't go back.\n*\nJust after dinner, his phone chimes with an incoming text from a number he doesn't recognize. Heart in his throat, Stiles opens it.\n\nthanks for the card.\n\n\"Oh god,\" Stiles breathes out, and sends back a simple you're welcome.\nHe saves the number into his contacts, fingers shaking as he types out Derek's name. He's just finished when his phone chimes again with another text.\n\nI know it's late, but are you busy?\n\n\"Oh god,\" Stiles says again.\n\nnah, not really. what's up?\n\n\ndo you want to come grab a bite to eat with me?\n\nStiles makes a truly embarrassing noise and nearly drops his phone in his haste to answer.\n\nI've actually just finished eating dinner, but we could totally do dessert if that's ok.\n\n\nsounds great. meet me at Scoops in twenty?\n\n\nI'll be there.\n\n\"Oh god,\" Stiles says for the third time, letting his phone fall to his bed as he jumps up. He stumbles his way out of his room and into the bathroom to brush his teeth, and then rushes back to his room to change his t-shirt and pull on a zip-up hoodie. His hands are shaking as he grabs his phone, wallet, and keys and shoves them in his pockets.\nHe takes the stairs two at a time, and when he reaches the bottom he calls out, \"Bye, Dad, going out!\"\n\"Wait a minute, Stiles –\"\nStiles swears under his breath, pausing with his hand on the front door knob. \"Yeah?\"\nJohn steps out of the kitchen, taking his glasses off to give Stiles a hard look. \"Where are you going?\"\nFor just a second Stiles considers lying, but if he does and his dad finds out then any chance there was of parental approval will go right out the metaphorical window. \"Uh, actually I'm going to meet Derek at Scoops.\"\n\"Derek? As in your history partner's older brother Derek?\"\n\"Yeah, he – see, it's his birthday so I left him a card on his car with my number in it, and he texted me and asked if I'd like to go out tonight –\"\nJohn sighs and holds up one hand, making Stiles snap his mouth shut. \"So he's twenty-three now?\"\n\"Um, yeah. Yes.\"\n\"That's six years, son. I don't know if I'm comfortable with that.\"\nStiles winces. \"I know. I just – Dad, come on, I'm not going to let him 'take advantage' of me or whatever you're thinking. I'll be eighteen in April, and off to college in less than a year. Besides, when have you ever known me to do something I didn't want to do? Don't give me that look, I'm talking about the stuff that really matters.\"\nJohn's expression goes pinched and he rubs at his forehead. \"Or to not do something you do want to do,\" he mutters, and Stiles does his best to look innocent. \"Okay, listen up, because this is how it's going to be. I'm going to let you do this –\"\nStiles throws both hands in the air. \"Yes!\"\nJohn glares. \"But. You only go out when I'm not working, you won't miss whatever curfew I give you on those nights – ever, even by five minutes – and if this starts getting serious I'm going to want to have a proper father-to-boyfriend meeting.\"\n\"You mean interrogation.\"\n\"I mean meeting. And if I get any sort of indication that he's not treating you with respect, I swear to god –\"\n\"Dad,\" Stiles interrupts, and then strides over to wrap his dad in a tight hug. \"If he's a jerk I'll totally let you kick his ass, no complaints.\"\nJohn sighs and hugs him back. \"Be careful, okay?\"\n\"I will, I promise.\" Stiles pulls back and grins. \"Thanks.\"\n\"Yeah, yeah.\" John waves him off. \"Go on, you're going to be late. Be back by ten.\"\nStiles doesn't need to be told twice. It's a fifteen minute drive into the part of town where Scoops – the only ice cream parlor in Beacon Hills – is located, and when he pulls into a parking spot he can see Derek waiting just outside the door. He's wearing jeans, another damned Henley – this one blue – and his leather jacket. Stiles takes a deep breath and jumps out of the Jeep, trying to keep his pace casual as he makes his way over.\n\"Hey.\"\nDerek barely smiles, just a little uptick of his mouth, but he looks happy. \"Hey. I hope your dad didn't freak out or anything.\"\n\"Nah.\" Stiles grins. \"As long as I'm home by ten it's fine.\"\nDerek's smile widens and he gestures to the door. \"Ice cream?\"\n\"After you, birthday boy.\"\nDerek rolls his eyes at that, but he goes first, holding the door open for Stiles to follow. \"So I was thinking we could get a couple of cones and then walk over to that park nearby.\"\n\"Yeah, that sounds great.\"\nDerek orders a mint chocolate chip, Stiles gets a rocky road, and Derek pays before Stiles can even begin to offer. The park is only two blocks away, and they walk slowly as they make their way over, Stiles trying his best not to stare as Derek eats his cone.\n\"So,\" Stiles says, shoving his free hand in his pocket as he licks up a line of melting chocolate. \"Is this some sort of over-dramatic thank you for the birthday card?\"\nDerek hums, and when Stiles glances over he thinks Derek's cheeks might be flushed, but it's hard to tell in the combination of moonlight and streetlamps. Derek is also staring at his mouth, which makes Stiles' stomach clench in a really good way.\n\"Maybe a little,\" Derek says, and snaps his eyes to Stiles'. \"Mostly I was just hoping it could be a date.\"\nThe clenching turns to full-blown flip-flopping, and Stiles can't stop the stupid grin that bursts over his face. \"Date it is, then.\"\nDerek grins back, and then clears his throat. \"So, uh, to keep with today's theme, when is your birthday?\"\n\"April eighth,\" Stiles says, and the happy fluttering turns to nervousness. What if Derek thought he was already of legal age? \"I'll be eighteen.\"\nBut Derek just nods. \"And your dad's really okay with this tonight?\"\n\"It's fine.\" Stiles shrugs and takes a bite of his cone. \"I mean, I don't think he's ecstatic, but it's not like you're forty.\"\nDerek huffs out a laugh. \"Let me guess, you had to point that out to him.\"\n\"Surprisingly, no, though I was definitely prepared to.\" Stiles grins. \"What about your parents? Would they have a problem with this?\" He pulls his hand from his pocket to gesture between them. \"Or are you too old to care and just do whatever?\"\nDerek's face does something weird, almost like he's wincing but trying not to laugh at the same time. \"No, I'm pretty sure I'll never be too old to not listen to my parents, especially Mom. Our family is really close. But to answer your question, they're fine with it. They met when Dad was sixteen and Mom nineteen, so they understand.\"\n\"Three years is closer than six,\" Stiles points out.\n\"Five and a half.\"\n\"Semantics,\" Stiles says with a grin, and Derek shrugs.\nBy the time they reach the park they've both finished with their cones, and Stiles really hopes he doesn't have any chocolate on his face. He sucks on his fingers to clean them, and is pretty sure he hears Derek make a quiet choking sound. Stiles glances over at him but Derek is looking away, out toward the empty swing set.\n\"Bet I can swing higher than you.\"\nDerek looks at him and raises both eyebrows. \"Are you challenging me? I should warn you, I was voted King of the Swings in fifth grade.\"\n\"Well, I was voted King in fourth grade and held the title two years running. Besides, you've got at least fifty pounds on me, and lighter totally goes higher.\"\nDerek narrows his eyes. \"You're on.\"\nStiles cackles and runs for the swing set, rubbing his hands together before taking a seat in one and grabbing onto the chains. Derek takes the one next to him, his face so seriously determined that Stiles kind of wants to kiss the hell out of him.\nOr challenge him on something every day for the rest of forever, but that thought is more than a little scary so he sticks to the kissing one.\n\"Ready? On go.\"\nHe counts down from three and they both push off. It's slow at first, but pretty soon Stiles has gained some good momentum. When he's certain that he's reached his maximum height he closes his eyes and tilts his head back, enjoying the cool night air rushing over him. His mom used to bring him out here when he was little, before she got sick, and they would spend hours running around doing everything.\nStiles opens his eyes and looks over at Derek, only to see him looking back, expression something he can't place. He's not ready for that yet, so he grins and yells, \"I win,\" before letting go and flying through the air. He lands on his feet but has to tuck into a roll, ending up on his back and laughing up at the stars.\nAfter a moment he sits up and watches Derek, still on the swings. \"Do a better jump than me and we'll call it even.\"\nDerek must accept the new challenge, because on the next swing out he jumps into a wide arc. His body stays fluid, and when he lands on both feet he ends up in a graceful crouch instead of flailing around on the ground like Stiles had.\nStiles gapes. \"Dude, that was awesome. How did you do that?\"\nDerek shrugs and stands, reaching down to help Stiles to his feet. \"It kind of comes naturally.\"\nStiles snorts, but Derek hasn't let go of his hand so he isn't going to argue. \"Well, whatever, I'm totally impressed. Which I'm guessing was your goal?\"\nDerek smirks. \"So what does the winner get?\"\n\"That was a tie, dude. I won height, you won jump.\"\n\"Sounds like we're both winners to me.\"\nStiles swallows, darts his tongue out to wet his lips. Derek is still holding his hand. \"Then it should probably be something mutually beneficial.\"\n\"Exactly what I was thinking,\" Derek says, voice low. He pulls Stiles in by his hand, wrapping his free arm around Stiles' waist and pressing them together.\n\"Fuck,\" Stiles breathes, twisting the front of Derek's shirt in his fingers.\nWhen Derek finally presses their mouths together, Stiles thinks his spine just might melt right out of him. He lets out a soft noise, arching even closer, and opens his mouth so Derek can lick inside. He tastes like mint chocolate chip ice cream and something Stiles can't even begin to describe, something that's just Derek, and heat rushes through his veins, pooling low in his stomach.\nDerek moans – a short, whimpery punch of noise – and Stiles is pretty sure this is the best moment of his life. After several minutes Derek pulls away, and Stiles gasps for air.\n\"Oh my god.\"\nDerek hums in agreement, nosing along Stiles jaw to his throat. He stays there as Stiles tries to remember how to breathe, alternating between open-mouthed kisses and dragging deep breaths in through his nose. They both cause Stiles to shiver, and he tilts his head back, baring his throat. Derek lets out a low, rumbling noise and Stiles shudders at the vibrations.\n\"So, uh, is this a thing for you? This neck-sniffing thing?\" Derek freezes, and Stiles tries not to panic, tightening his fingers where they're still tangled in Derek's shirt. \"No, no, it's okay, I was just wondering. I mean, I like it. Really like it. So it's more than okay, actually.\"\nDerek relaxes, licking up Stiles' throat to his jaw line. \"Yeah, it's kind of a thing,\" he says, pulling back to look Stiles in the eye. \"It doesn't bother you?\"\n\"God no.\" Stiles bites his lip, reaching up to drag a finger down Derek's nose to his mouth. \"Not even a little.\"\nDerek shudders, expression going painfully vulnerable for a moment, and then he leans forward to kiss Stiles again. It's slower this time, less heated, and Stiles feels an ache bloom in his chest. He doesn't want Derek to ever look like that again, and that's such an overwhelming thought that he has to pull back. He grins, untwisting his fingers from Derek's shirt, and wriggles away.\n\"Race you to the merry-go-round.\"\nHe doesn't give Derek time to respond, turning and taking off. The merry-go-round is all the way on the other side of the large park, and Stiles has to twist and turn around different pieces of playground equipment as he runs. He can hear Derek behind him, the dull, steady thump of his shoes on the ground, and Stiles suddenly feels like he's being chased. A shiver goes down his spine, but it isn't fear, it's excitement, and a burst of adrenaline has him speeding through the last few feet.\nStiles jumps onto the metal center of the merry-go-round with a wild laugh, throwing his arms up into the air in victory. He turns, expecting Derek to jump on right behind him, but instead Derek grabs onto a couple of the painted yellow bars and keeps running. The merry-go-round starts to turn, quickly gaining speed, and Stiles laughs again, planting his feet and holding onto to two of the bars so as not to lose his balance.\nFinally, when they're spinning so fast everything is one big blur and Stiles is getting dizzy, Derek jumps on with him. He blinks at Derek's face and tries to glare at him, though he's pretty sure his eyes look ridiculous and unfocused.\n\"Fuck you, you let me win just so you could do that.\"\nDerek grins, looking far too smug. \"Maybe I did.\"\nStiles laughs breathlessly and holds on for dear life; Derek must be a really fast runner. When the merry-go-round finally starts to slow down, Stiles manages to ease himself down, sprawling between the two big handle bars he'd been holding on to. Derek sits in front of him, tangling their legs together.\n\"Do you have any plans for college?\"\nStiles nods, playing with the drawstring on his hoodie. \"Yeah, I'm going to UCLA.\"\nDerek raises an eyebrow. \"How do you know for sure? Do you have any backup plans or anything?\"\n\"Well, I would, but I've already been accepted through early admissions.\" Stiles grins. \"I had a few backup applications ready if UCLA didn't accept me, but since they did and they're my first choice, then I don't feel the need to use them.\"\nDerek huffs, shaking his head. \"I feel like I should have expected that.\"\n\"What about you? You said you were going back for your masters; where do you go?\"\n\"Believe it or not, I go to UCLA.\"\nStiles feels his eyes widen. \"No shit?\"\n\"Yeah.\" Derek shrugs. \"Laura wanted me to go out of state to NYU like she did, but I couldn't stand to be that far away from my family. I needed somewhere close enough that I could keep in touch more easily, but also far enough away that I could be my own person for a while. Everybody needs that, I think.\"\nStiles nods; he knows exactly what Derek is talking about. \"Yeah, my dad is all I have left. The thought of going so far I can't get to him within a day doesn't feel right.\"\n\"What, uh –\" Derek hesitates, looking vaguely uncomfortable. \"Can I ask what happened to your mom?\"\nStiles swallows, glancing out at the slowing scenery before looking back at Derek. \"Cancer. She died when I was eight. It's been… really hard on me and my dad.\"\nDerek nods, watching him closely. \"That sucks. I can't imagine losing my mom, or any of my family.\"\nStiles is so stupidly grateful that Derek didn't say I'm sorry, and lets out a hard breath. \"It really does.\"\n\"Right,\" Derek says, grimacing. \"And now that I've made this date completely depressing –\"\nStiles laughs. \"No way, dude, don't worry about it. I miss her, every fucking day, but not talking about her makes it worse.\" The merry-go-round has finally slowed to a stop, and Stiles wriggles around until he's splayed out on his back, staring up at the stars. \"She used to love the night sky. She gave me a telescope for my fifth birthday, and I've still got it. I can't name all the stars like she used to, but I still love to look at them. Especially the moon; she would say there was something magical about it, and I like to think maybe there is.\"\n\"There is,\" Derek says with quiet surety, and lies down next to Stiles, reaching to entwine their hands.\nThey're quiet for a while, and then Stiles turns his head to look at Derek. \"Can we make out now?\"\n\"Fuck yes,\" Derek breathes, and moves to climb on top of Stiles. \"I thought I might have ruined it.\"\nStiles snorts. \"I'm a seventeen year old virgin, I'm pretty much always horny.\"\n\"Jesus fucking –\"\nDerek crashes their mouths together in a hard, demanding kiss, one hand burying itself in Stiles' hair and the other sliding down his side to rest on Stiles' hip. Derek's weight presses into him, and part of Stiles wishes he was on something more comfortable than bumpy metal, but a much bigger part of him doesn't give a flying fuck.\nHe whines, opening his mouth for Derek's tongue and spreading his legs, allowing Derek to settle between them. He's already hard, and he can feel Derek's erection in the cradle of his hip. Derek gasps into his mouth, nipping at his bottom lip.\n\"Oh god, Stiles, you have no idea –\"\n\"Kind of think I do,\" Stiles says, pushing his hips up, but Derek just shakes his head. He mouths down Stiles' jaw to the side of his neck, nosing at him before sucking the skin in between his teeth. \"Oh fuck.\"\nDerek sucks until Stiles is writhing, fingers clutching at Derek's jacket and short, broken-off sobs nearly choking him. It feels like electric currents are shooting straight down his spine to his dick, making it throb almost painfully, and his shoes scrabble on the slick metal of the merry-go-round as he tries to find purchase.\nDerek finally releases him, licking gently at the spot while Stiles tries desperately to catch his breath. \"You okay?\"\n\"Am I – Jesus fucking Christ, Derek.\"\nDerek smirks up at him. \"Can I suck you off?\"\nWhat's left of Stiles' brain short circuits, and he stares at Derek for a moment. \"Yes? I mean yes, yes, oh my god yes.\"\nDerek huffs a laugh and presses a quick kiss to Stiles' mouth. He pushes the sides of Stiles' open hoodie out of the way and then shoves his t-shirt up, the cold night air causing goosebumps to rise on Stiles' heated skin. Derek mouths at the line of hair that disappears into the waistband of his boxer-briefs and then sits up, reaching for the button on Stiles' jeans.\n\"I feel I should warn you,\" Stiles says, and Derek pauses, waiting. \"I'm probably going to come in like, two seconds.\"\n\"It's fine,\" Derek says, popping the button free and pulling the zip down. \"I'm not going to last much longer than that myself.\"\nThat spins Stiles' thoughts off in another direction entirely, because holy shit, Derek's dick. He wants to see it, and touch it, and taste it –\nDerek curls his fingers around the top of both Stiles' jeans and his boxer-briefs, pulling them down together. Stiles lifts his hips to help, swearing when his ass comes down on cold metal.\n\"Shit, wait,\" Derek says, and takes his jacket off. \"Here, up again. You can lay on this.\"\n\"Are you sure?\" Stiles asks, even as he does as he's told. Derek spreads it out so that Stiles settles back down on the body-warm inside. \"Dude, this is your leather jacket. I don't want to get come all over it.\"\nDerek grins wickedly. \"You won't.\"\n\"Fuck,\" Stiles says, and he and Derek both look down at his hard dick. The cold hasn't done a damned thing to make it go down, and Stiles bites at his bottom lip.\nDerek reaches down and wraps his hand tightly around the base. \"I think you deserve more than two seconds.\"\nStiles laughs breathlessly, which quickly turns into a choked sounding moan when Derek leans down and sucks the head into his mouth. \"Oh god, oh fuck.\"\nHe's gentler than he was on Stiles' neck, which Stiles is grateful for since he's so hard he thinks that might have hurt. Derek licks around the head, and then further down, taking him in bit by bit until his nose is pressed against his fingers and Stiles can feel the back of his throat.\nStiles can barely breathe it feels so good. Soft, wet heat all the way around him, Derek's tongue moving along the underside, the fluttering of Derek's throat around the head.\nDerek pulls back slowly, looking up at Stiles with a dark, heated gaze that makes him whimper. He slips his tongue into the slit on the tip, licking at it until Stiles is arching his back, fingers twisted in Derek's jacket underneath him, and then sucks him back down. He goes all the way to his fingers again, and Stiles throws one arm over his eyes, letting out a moan.\n\"Derek – Derek, please –\"\nDerek pulls back again, and then off, just long enough to catch his breath before diving back in. His pace is faster this time, taking Stiles in deep over and over, sometimes holding it until Stiles is swearing and desperately hitching his hips. He knows he probably shouldn't but fuck if he can help it, and Derek doesn't seem to mind.\nStiles loses track of time, thinks Derek's jaw has to be aching by now. His dick definitely is, throbbing and rock hard, Derek's hand just tight enough to hold back the orgasm that's been building since he first started. He fumbles down with his free hand, tangling his fingers in Derek's soft hair, and drops his arm from his eyes, blinking the blurriness away.\nDerek is watching him, eyes half-lidded, mouth stretched around Stiles' dick.\n\"Oh god, I can't – I need –\"\nIt's completely incoherent but Derek seems to understand, releasing the base of Stiles dick and bracing himself on the merry-go-round with both hands. He loosens his jaw, and that's all the permission Stiles needs to fuck up into his mouth, fingers tightening in Derek's hair. He goes further back than Derek had before, pushing his dick almost all the way in, and Derek groans. The vibrations hit Stiles like an electric shock, and his eyes roll back in his head as he comes, muscles tensing so hard he ends up holding Derek in place without meaning to.\n\"Fuck,\" Stiles gasps, forcing his fingers to let go of Derek's hair. \"Shit, I'm sorry, I –\"\nDerek pulls back with a gasp, shaking his head, and lunges up, crashing his mouth to Stiles'. He's already swallowed Stiles' come down but Stiles can still taste it, sour on Derek's tongue, and sweeps his own over it with a whimper.\nDerek shifts, bracing himself with one hand and shoving the other between them to fumble at his own fly, and Stiles reaches down to help him. \"Fuck,\" Derek breathes as they both pull his dick out, heavy and hard.\n\"Let me, please,\" Stiles says, and Derek nods, letting go to lift his shirt out of the way. He looks down at where Stiles has his hand wrapped around him and shudders.\nStiles lets go long enough to lick generously at his palm, not wanting to rub at him dry, and slides his slick palm over the tip to gather the pre-come already leaking out. Derek is uncut, and so hard the foreskin is already stretched back, the tip almost completely uncovered.\n\"God, you're beautiful,\" Stiles says, and starts stroking, hard and fast.\nDerek gasps, eyelids fluttering briefly before his gaze snaps back to his dick in Stiles' hand. It takes maybe a dozen strokes before he's coming hotly all over Stiles stomach. Derek whines, high in the back of his throat, and actually puts the end of his shirt between his teeth so he can reach down and drag his fingers through the mess, rubbing it into Stiles' skin.\n\"Fuck, that's hot,\" Stiles says, hand still wrapped loosely around Derek's dick.\nDerek freezes, blinking like he's just realized what he's doing, and glances up at Stiles with a sheepish expression. His shirt falls from his mouth, and Stiles thinks he might be blushing.\n\"Sorry.\"\nStiles rolls his eyes. \"Shut up, I said it was hot.\"\nDerek shakes his head, lips quirking up into a small smile. His fingers start moving again, swirling through the tacky come. \"I don't have anything to clean you up with.\"\nStiles makes a face, and then shrugs. He feels too good to care. \"I'll do it when I get home.\"\nDerek makes a small noise and then clears his throat, nodding. \"You can probably let go of me now.\"\n\"Shit!\" Stiles snatches his hand back from where it had still been holding Derek's softening dick, and feels his face heat. \"Sorry.\"\n\"It's fine,\" Derek says, sounding amused. He reaches to fix his jeans and Stiles does the same, lifting his hips to pull them and his boxer-briefs back up. The come on his stomach isn't all the way dry yet, and he wrinkles his nose at the weird feeling. Derek reaches for his jacket while Stiles' hips are up, slipping it back on. \"What time is it?\"\nStiles' eyes go wide. \"Fuck.\" He fumbles in his pocket for his phone and hits a button, lighting up the lock screen. \"Nine-twenty,\" he says, both relieved he hasn't missed curfew and disappointed that he's going to have to go in the next five minutes.\nDerek nods, and leans down to kiss Stiles slow and deep before moving to climb off the merry-go-round. \"Come on, I'll walk you back to your Jeep.\"\nStiles shoves his phone back in his pocket and takes Derek's offered hand, letting himself be pulled up. His legs are still kind of shaky from his orgasm, but it helps to steady him when Derek tangles their fingers together.\nThe walk back to Scoops takes less time than Stiles remembers, and when his Jeep comes into view he can't stop his mouth from twisting down into a frown. Derek walks him all the way to the door, and then pushes him against it, pressing into him and kissing him softly.\n\"So, uh,\" Stiles says when Derek pulls away, fingers fiddling with the zip on Derek's jacket. There's a nervous fluttering in his stomach, and he can't help but wonder if maybe the sex was all Derek actually wanted. \"We're going to do this again, right?\"\n\"The date or the blow job?\"\nDerek sounds hesitant and unsure, and Stiles looks up into those gorgeous eyes and swallows back his fear. \"Both. Definitely both, but especially the date.\"\nDerek smiles, and there's such obvious relief in it that Stiles' heart skips. \"Yeah, I'd like that.\"\n\"Great. That's – yeah, awesome.\"\nDerek hums and leans forward to lick across the mark he'd made earlier, burying his nose behind Stiles' ear and breathing deep before stepping back. \"You should go. You can't be late, and you've got school tomorrow.\"\n\"Ugh, no,\" Stiles says, poking Derek in the chest. \"I get enough reminders about school from my dad and the pile of homework on my desk, you're not allowed to do that too.\"\nDerek grins and hauls him in for another quick kiss, reaching behind Stiles to open his Jeep door. \"Go. I don't think your dad would appreciate it if I kept you.\"\n\"I'm going,\" Stiles grumbles, stealing one last kiss before climbing into the driver's seat and letting Derek slam the door shut. He pulls out his keys and cranks the engine, waiting until Derek has stepped out of the way before waving and backing out of the parking space.\nThere's a stupid grin on his face the whole ride home, and Stiles is pretty sure he looks ridiculous. He doesn't care; he's giddy and relaxed and possibly at the beginning of a new, real relationship, and he doesn't think there's anything that can bring him down right now.\nHe walks in the door with five minutes to spare, yells a quick hello and goodnight to where his dad is waiting in the living room, and books it up the stairs. He grabs a pair of pajamas from his room and locks himself in the bathroom, wetting a washcloth to wipe down his stomach. If he takes an actual shower his dad will know exactly what when on, and it's going to be hard enough to try and hide the epic hickey on the side of his neck.\nOnce he's cleaned up and changed Stiles hurries back to his room, diving under the covers and arranging himself so that the side of his neck with the mark is facing away from the door. Sure enough, it's only a few minutes later that his dad knocks lightly and pokes his head in.\n\"So how did it go?\"\n\"It was great,\" Stiles says honestly, grinning over at him. \"We got some ice cream at Scoops and then walked down to that park Mom used to take me to. Played on the swings and the merry-go-round and talked.\"\nJohn hums, eyeing him suspiciously. \"Are you going to go out again?\"\nStiles nods, biting at his lip. \"Yeah, we are. I mean, there's no details yet, but we both want to.\"\n\"Okay, well,\" John says, and sighs. \"Just remember the rules.\"\n\"I will, I promise.\"\n\"Goodnight, Stiles.\"\n\"Night, Dad.\"\nJohn closes the door and Stiles lets out a quiet breath. He's safe for tonight, but he's going to have to get creative for tomorrow.\n*\n\"Dude,\" Scott says the next morning, leaning on the locker next to Stiles'. \"Why are you wearing a scarf?\"\nStiles shrugs, focusing on getting his books out, but he knows he's blushing. \"I felt like it?\"\n\"But you don't own a scarf.\" Scott narrows his eyes, and before Stiles can stop him he reaches out and pulls it down just enough to expose Stiles' neck. \"Holy shit! Is that a hickey?\"\nStiles glares at him and yanks the scarf back in place. \"Maybe.\"\nScott grins. \"That is so a hickey. I've had enough from Allison to know.\"\n\"Too much information, dude.\"\n\"You're the one walking around with a bright red scarf around your neck. That is literally the most obvious way of telling people you've had your neck sucked on.\"\nStiles groans, slamming his locker door shut. \"God, shut up. I don't have that many options, okay?\"\n\"So who was it?\" Scott falls in beside him as he starts toward English class. \"Was it Derek? I bet ten bucks it was.\"\n\"I hate you so much.\"\nScott laughs. \"I'm right! So what happened?\"\nStiles tries to fight it but he can't help the stupid little grin that breaks free. \"I gave him a birthday card yesterday, and he texted to ask me out. We went to Scoops, and then the park nearby.\"\n\"Dude, I'm so happy for you. Like, for real. It's about time someone realized how awesome you are.\"\n\"I take it back; I don't hate you at all.\"\nAt lunch, Cora drops down into the seat next to him and immediately wrinkles her nose. \"Ugh, you reek.\"\n\"What?\" Stiles says, completely baffled. \"I showered this morning.\"\n\"That's not –\" Cora breaks off, sighing like he's the most frustrating thing in the world. \"Forget it. Have you done any more research?\"\nStiles flushes. \"Have you? You're always on my case to do research, but what are you doing? This is a partnered project.\"\n\"I'm trying to help you,\" Cora says through gritted teeth. \"If only you'd stop being so stupidly stubborn.\"\n\"Oh my god!\" Stiles throws up both hands. \"I don't have any idea what you're talking about.\"\n\"That's the problem!\"\nStiles gapes at her. Everyone else is quiet, and Scott, Allison, and Lydia look just as confused as Stiles feels. Across the table, Erica, Boyd, and Isaac are giving him pitying looks. Well, Isaac is giving his scarf a pitying look, but Stiles had kind of expected that from the amount of scarves Isaac wears.\nCora sighs, running one hand through her hair. \"Forget it,\" she says again. \"I'm just worried.\"\n\"We'll get it done,\" Stiles says, tugging absently at the ends of his scarf. \"The project isn't due for more than a month.\"\nCora gives him the most exasperated look in existence, and then shakes her head. \"Yeah, the project.\"\nStiles doesn't have any idea what else she could have meant, so he lets it go. He's come to accept that Cora's crypticness is just part of her personality.\n*\nStiles kind of forgets about everything for the next couple of weeks, spending most of his free time texting Derek. Stiles sends stupid, random little facts that cross through his mind, Derek complains about annoyances from his shifts at the theater, and they both send pictures of things that catch their eye. They play twenty questions, Stiles talks more about his mom, and Derek tells him how close he used to be to his Uncle Peter before he realized how manipulative he was.\nIt's good, really good, and even though there's a part of Stiles that's waiting for the other shoe to drop – his dad to change his mind, or, hell, for Derek to change his mind – mostly he's just enjoying it.\n*\nThe first Saturday of Thanksgiving break, Stiles is startled awake by his phone chiming loudly. Groaning, he fumbles blindly for it and then blinks blearily at the group text sent by Cora.\n\n\nmovie night at my house. six pm.\n\n\nStiles checks the time, and it's barely past seven in the morning. \"Ugh,\" he mutters and types back a barely coherent response. How anyone can be awake this early on a Saturday is beyond him.\nHe wakes up again a few hours later with his phone still in his hand and drool on his pillow. He spares a grateful thought that Derek can't see him before rolling out of bed and stumbling his way to the bathroom. A hot shower manages to wake him up, and he grabs his phone from his room before heading downstairs to find something to eat.\nThere's a series of confirmation texts about the movie night from everyone else, and after scrolling through them Stiles opens his texts to Derek and types out a new one.\n\nhey, are you working tonight?\n\nStiles fixes himself a bowl of cereal and a cup of coffee, and has just sat down when Derek responds.\n\nyeah, I've got the five to midnight shift. why?\n\n\nCora invited everyone over for a movie night tonight. just wanted to know if you'd be there.\n\n\nare you busy now? we could hang out until I have to leave for work.\n\n\nyeah, sure. what do you want to do?\n\n\nI'll pick you up in half an hour.\n\nStiles raises an eyebrow because that's not exactly an answer, but he kind of likes the idea of a surprise date. He finishes his breakfast and then heads upstairs to brush his teeth and throw on clothes that aren't sweats and a ratty t-shirt. He's just typed out a text to his dad to let him know his plans for the day when the doorbell rings. A stupid grin bursts over his face, but he manages to work it down to a less ridiculous level by the time he pulls the door open.\n\"Hey.\" The word comes out kind of breathless, and Stiles clears his throat, flushing slightly.\nDerek smiles. \"You ready?\"\n\"Uh, yeah. Yeah.\" Stiles tries to ignore his own awkwardness, double checking that he has his phone, keys, and wallet before stepping out onto the porch, pulling the door shut behind him. Except Derek doesn't move back and Stiles ends up pressed against him, chest to chest. \"Um.\"\nDerek's smile spreads into a grin, and then he raises one hand to rest against the back of Stiles' neck and brings their mouths together. Stiles makes a noise, eyes sliding closed as he presses closer, opening for Derek's tongue. His hands come up to rest on Derek's waist, under his jacket, and Stiles can already feel the heat of arousal spreading through him.\nDerek pulls back far too soon, and Stiles has to swallow back a disappointed sound. He opens his eyes and flicks his tongue over his damp bottom lip, pulling it between his teeth, and a thrill goes through him when Derek stares.\n\"You know,\" Stiles starts, moving his fingers so that they're sliding up under Derek's shirt, \"we could just stay here.\"\n\"Tempting,\" Derek says, eyes tearing away from Stiles' mouth. His lips twitch. \"Very tempting. But I don't want this entire relationship to be based on sex, so you're just going to have to deal with an actual date.\"\nOh, well. Stiles can't really argue with that. \"I don't think that will be too much of a hardship.\"\nDerek's smile brightens his whole face, and Stiles feels his heart give an extra hard thump. He reluctantly removes his hands from beneath Derek's shirt and tangles their fingers together, tugging Derek off the porch and towards his Camaro.\n\"So where are we going?\"\n\"You'll see when we get there.\"\nStiles doesn't really know what he's expecting, but when they pull up to the mini-golf course on the edge of town, he can't help but give Derek a hard side eye.\n\"Mini golf?\"\nDerek looks amused. \"You don't like mini golf?\"\n\"Yeah, of course,\" Stiles says, raising an eyebrow. \"But it just seemed like you were planning some big, exciting thing.\"\n\"But mini golf is exciting,\" Derek says, just over-exaggerated enough that it's obvious he's teasing.\nStiles starts laughing; he honestly can't help it. \"Maybe to a five year old. But Scott and I have mastered this course, dude. They even put our names up on the Beacon Hills Mini-Golf Champions board behind the main counter.\"\n\"Hm,\" Derek says, and there's a wicked glint in his eye that Stiles is pretty sure means danger, danger. \"Did you ever read the other names that are up there?\"\nStiles narrows his eyes. \"You're a Champion, too, aren't you.\"\nDerek gives him a shit-eating grin. \"Overall high scorer three years in a row.\"\n\"Ha!\" Stiles points at him. \"Scott and I have shared that title for the past four years. Dude, this makes twice that I'm better than you at something. Do you really want to go there?\"\nTo Stiles' surprise, Derek's grin grows even wider. \"I bet I can beat you blindfolded.\"\nStiles blinks. \"Blindfolded? Both of us?\"\n\"Nope. Just me.\"\n\"Oh, you are so on.\"\nThe girl at the counter seems to recognize both of them, and smirks a tiny bit as she hands them each a club and a golf ball – Stiles' purple, Derek's orange. \"Have fun,\" she says with a wink, and Stiles waggles his eyebrows for the hell of it.\nDerek rolls his eyes and pulls him toward the entrance to the course. \"Stop flirting with other people when you're on a date with me.\"\n\"Dude.\" Stiles laughs and pulls Derek in for a quick kiss. \"I wouldn't do that. I'm just a ridiculous person.\"\nDerek just shakes his head, looking more amused than actually bothered, and when they reach the first hole he pulls a black cloth from his back pocket. \"Would you do the honors?\"\n\"I feel so important,\" Stiles says, placing one hand over his heart as he takes the cloth with the other. \"I will remember this moment forever. Mostly because it's the moment you give up any chance of beating me.\"\n\"Uh-huh,\" Derek says, and sets up his ball on the little square at the beginning of the green. \nStiles grins widely as he moves to tie the blindfold over Derek's eyes. Just before pulling away, Stiles leans in and whispers directly into Derek's ear. \"When this is over, I'm keeping the blindfold for later use.\"\nDerek's breath catches, and Stiles bites down on his bottom lip to keep from laughing.\n\"Stop trying to distract me.\"\n\"I have no idea what you're talking about.\" Stiles ignores Derek's snort and pats the knot of cloth at the back of his head. \"All right, you're all set.\"\nHe steps back, leaning one hand on his golf club as he waits for Derek to completely screw up the shot.\nExcept – except Derek pauses, tilts his head like he's listening for something, and then taps the golf ball in a direct hit. It goes straight down the green – the first hole is the easiest – and right into the little cup.\nStiles gapes, and Derek removes the blindfold to see where his ball went. He nods, and looks back at Stiles with the smuggest expression to ever exist.\nStiles narrows his eyes. \"That was a lucky shot.\"\n\"If you say so.\" Derek grins and goes to get his ball. \"Your turn.\"\nStiles gets his in one, too, because the first hole really is the easiest and he's played this course a countless number of times with Scott. They quickly move on to the second, and then the third and fourth and fifth. Each time, Stiles waits for Derek to set his ball up and then ties the blindfold around Derek's eyes, and each time Derek manages to get the ball into the little cup with only one shot.\nStiles does too, but he isn't blindfolded.\n\"Oh my god,\" Stiles says after Derek makes his ninth hole-in-one without being able to see what the hell he's doing. He reaches up and snatches the blindfold off, ignoring Derek's obvious amusement as he unties the knot and holds the damn thing up to his own eyes.\nNope, he can't see a fucking thing.\nDerek is outright laughing at him now, and Stiles glares at him.\n\"How the hell are you doing this?\"\nDerek shrugs, but there's a smirk on his face. \"Maybe I'm just that good.\"\n\"Are you kidding me?\"\n\"You should take your shot, there's people waiting.\"\nStiles grumbles under his breath but sets up his ball and takes his shot. He manages to get it in one, but only barely, and for the first time he thinks he might not win after all.\nAt the twelfth hole Derek misses with his first shot and Stiles crows in victory. \"Ha! I knew you had to screw up at some point.\"\nDerek pushes the blindfold up far enough to see where his ball went, and shoots Stiles an amused look before going over to it. He tugs the cloth back into place over his eyes, and taps the ball right into the little cup.\n\"You know what? I don't even care,\" Stiles says, setting his own ball up and waiting for Derek to move out of the way.\nIt takes him three shots, and he glares so hard at the ball when it finally lands in the cup that he's almost surprised it doesn't explode into dust.\nDerek claps a hand on his shoulder. \"I'm pretty sure that puts me in the lead.\"\n\"Fuck you.\" Stiles stomps over and snatches his ball up. \"We've still got six holes to go.\"\nDerek gestures grandly toward the thirteenth hole. \"After you, then.\"\nBy the time they reach the eighteenth and final hole, Stiles is losing so badly it makes him wince to look at the scorecard. Derek gets his stupid ball past the stupid windmill in one shot, and it takes Stiles four. It's never taken him that many before, and he sighs as his ball disappears into the opening, on its way back to wherever they go at the end.\n\"Ugh,\" Stiles says. \"I hate you.\"\nDerek chuckles and tangles their fingers together, tugging Stiles toward the doors leading back into the main building. \"If I feed you will you forgive me?\"\n\"Maybe.\" Stiles eyes him cautiously. \"What kind of food are we talking about?\"\n\"The good kind.\"\n\"That tells me nothing.\"\nDerek just grins at him, and they turn their clubs in before heading out to the Camaro. Stiles might have lost spectacularly, but knowing that Derek doesn't want to end the date yet chases off any lingering annoyance.\n\"So where are we going?\" Stiles asks, buckling his seatbelt. When Derek just starts the engine and raises an eyebrow, Stiles rolls his eyes. \"Okay, well, I hope it's better than mini golf.\"\n\"I know you had fun.\"\n\"I will deny it forever and ever, until my dying breath.\"\nDerek snorts but there's a smile tugging at his mouth, and Stiles has to turn away and stare out the window to hide his own grin.\nThey end up at the preserve.\n\"Um,\" Stiles says, ducking his head to stare out the front windshield at the tall trees surrounding them. \"In case you didn't notice, this isn't exactly a restaurant.\"\n\"Yes, I'm aware,\" Derek says, and presses a button that pops the trunk open. He jumps out without saying anything else, and Stiles scrambles to follow him.\n\"Dude.\" Stiles grins at the actual straw basket Derek drags out. \"You packed us a picnic lunch?\"\nDerek shrugs, but the tips of his ears go bright pink. \"It's not – I didn't have time to make anything, so it's mostly just leftovers from the family dinner last night.\"\n\"Oh my god, this is awesome.\" Stiles grabs the blanket that was folded neatly next to the basket and steps out of the way so Derek can close the trunk. \"You're actually romantic as hell, aren't you?\"\n\"Shut up,\" Derek mutters, flush spreading, and Stiles can't help but lean over and kiss his cheek.\n\"I like it. You're adorable.\"\nDerek rolls his eyes at that, but he takes Stiles' hand and pulls him into the center of the clearing they're parked in. Stiles spreads the blanket out and plops down, reaching for the basket when Derek sets it down next to him.\n\"Alright, let's see what you brought. Barbeque chicken, potato salad – ooh, are these candied carrots? Rolls – oh god, they're homemade aren't they – and mm, chocolate chip cookies. Dude, I so forgive you for the complete ass kicking you just give me.\"\n\"Good to know I can always bribe you with food,\" Derek says, pulling out two bottles of Coke and handing one to Stiles.\n\"And sex.\" Stiles digs around at the bottom of the basket for the plates and utensils. \"Sex would work too.\"\nTwo seconds later, Stiles finds himself flat on his back, staring up at the wicked grin Derek is giving him.\n\"What will both get me?\"\nStiles makes a noise in the back of his throat, hands coming up to slip under the hem of Derek's shirt. \"Uh. I don't know exactly but it's probably good, so we should find out.\"\nDerek kisses him hard, licking right inside Stiles' mouth, and Stiles groans loudly. He shifts his legs, letting them fall open around Derek's hips and bringing their groins flush together. His dick is already half hard, and when Derek bites down on his bottom lip it fills the rest of the way, pushing against the zipper on his jeans.\n\"Jesus fuck,\" Stiles gasps, moving his hands to try and push Derek's jacket off. It doesn't work, since Derek doesn't seem inclined to move, and Stiles gives up. \"How the hell do you turn me on so fast?\"\nDerek whines, sucking quick little biting kisses down Stiles' throat. He doesn't answer, but Stiles wasn't really expecting one. Rolling his hips up, Stiles slides his hands down the back of Derek's jeans and underwear, gripping his ass. Derek gasps, hips stuttering, and Stiles can feel his hard dick pressing against his own.\n\"Oh god,\" Stiles moans, thrusting up, and Derek nips sharply at his jaw.\n\"Wait, wait.\" Derek balances himself on one hand and lifts up just enough to slide his other between them and open Stiles' fly. He tugs the material down enough to free Stiles' hard dick, and then does the same to himself.\n\"Fu –uck,\" Stiles breathes when Derek settles back down, their bare cocks sliding together. \"Oh my god.\"\nDerek's hands slide down to Stiles' hips, holding him in place as he starts to snap his own. His whole body is covering Stiles', face buried against Stiles' neck, and Stiles' fingers scrabble along Derek's jacket, trying to find purchase. Derek's dick is hot and hard against his, the head catching just under Stiles' on every thrust. It's too dry, even with the pre-come both of them are leaking, but it's just the right side of painful. Stiles knows he's making all kinds of embarrassing noises but he can't bring himself to care.\nDerek leans up and kisses him once, hard, their mouths parting on a hitching breath. Stiles stares up at Derek's half-lidded eyes, completely lost to the world around him, and Derek's thrusts go wild and messy.\n\"Fuck, I'm gonna –\" Derek grits out, and then gasps, hips rocking down hard against Stiles.\nFor a split second it looks like his eyes flash yellow, but Stiles forgets about it the moment it happens because there's a hot wetness spreading over his dick that isn't his and fuck, fuck that's hot. He whines, rolling his hips up and sliding his dick through the mess. He comes, back arching and a shout caught in his lungs.\nStiles goes boneless and Derek collapses on top of him, weight pinning Stiles to the ground. They stay that way until Stiles is having trouble pulling in a deep enough breath, and then Derek rolls off of him and reaches for the basket.\n\"Napkins,\" he says, and gives Stiles a handful of them.\nStiles wipes himself clean as best he can, tossing the napkins to the side and fixing his clothes. \"Now I'm really starving.\"\nDerek snorts, leaning down to give him a quick kiss before reaching for the food. \"Good thing I brought plenty, then.\"\nStiles grins, skin still buzzing with his orgasm, and takes the plate Derek hands him. They eat lazily, leaving nothing but empty containers, and then suddenly it's four o'clock and Stiles is helping pack everything back up so Derek can take him home.\n\"I had a lot of fun today,\" Stiles says when they pull up to his house. \"I kind of don't want it to end.\"\nDerek smiles at him, that bright, happy smile that makes Stiles' breath catch. \"Does that mean you'd be interested in a third date?\"\n\"So interested,\" Stiles says, and Derek huffs a laugh before leaning in to give him a kiss. It lasts longer than it probably should, until Stiles finally pushes Derek away. \"Dude, you're going to be late.\"\n\"I'll text you tomorrow,\" Derek says, and Stiles gets the hell out of the car so he won't give in to the urge to convince Derek to call in sick.\nHe takes another quick shower to get rid of the dried come the napkins didn't manage to get, and then texts Scott, Allison, and Lydia to see if they want a ride to the Hale house. They all do, so he double checks the fridge to make sure his dad has something to eat for dinner and heads out.\n\"Dude,\" Scott says when he climbs into the passenger seat. \"Why do you look so happy?\"\nStiles shrugs, but he can feel himself flush. \"I had another date with Derek today. It was good.\"\n\"Awesome,\" Scott says, and holds his hand up for a fist bump.\nThey pick up Allison and Lydia, and it's just before six when Stiles parks the Jeep in the Hales' yard. Erica opens the door before any of them even have a chance to knock, and she immediately wrinkles her nose.\n\"Cora, you might want to plug your nose,\" she says, and then turns and makes her way back into the house. \"Isaac, come help me make popcorn.\"\n\"What was that about?\" Allison asks, and Lydia shrugs.\n\"She does that kind of stuff all the time.\"\nCora pops her head around the side of the living room door. \"Hey guys, come on in. I'm still trying to get this idiotic DVD player set up correctly, so it might be a few more minutes, though I did go ahead and set out some movies we can choose from.\"\n\"Let's watch The Notebook,\" Lydia suggests, dropping her purse and jacket onto an armchair. Stiles snags a prime seat on the couch directly in front of the big screen TV and starts going through the stack of movies on the coffee table.\n\"Oh, hell no,\" Erica yells from the kitchen at the back of the house. \"This is movie night, not date night. We're not watching some sappy, lovey-dovey shit.\"\nLydia scowls, and everybody starts bickering about which movie to watch first and whether or not romance is okay.\nExcept Stiles. Stiles is frozen, staring down at the cover to An American Werewolf in London, head spinning and eyes locked on the word Werewolf. It's such a small thing to focus on, the name of a movie; it's something he wasn't even thinking about, something that really shouldn't have even registered. \nBut nobody else seems to have noticed that Erica responded to a suggestion that there's no way she could have heard.\nCora does that all the time – reacts to things that logically she shouldn't have heard. Talia did it that first night Stiles came over. So had Derek.\nNo, Stiles thinks. It's not possible. But once his brain has latched on to an idea it doesn't like to let go, and so many things start clicking into place.\nPeter complaining about privacy; Derek growling at Cora, getting upset that they were going to do a project on fucking werewolves. \nThe odd way Derek and Cora continuously phrase certain things.\nThe way Derek had jumped from the swing and landed like it was the most natural thing in the world. The massive mark he had put on Stiles' neck, the way he'd rubbed his come into Stiles' skin.\nHalloween night comes back in a rush: sharp teeth on his throat, a flash of yellow eyes, a deep wound that healed itself. Derek had told him flat out that he was a werewolf – I'm one of the most dangerous creatures to ever exist. I could rip your throat out with my teeth, or tear you open with my claws.\nHe had said it like a joke, like it wasn't real, like it was something he was playing at, and Stiles had been too drunk to notice the truth behind the words.\nEarlier that day, when Derek had come and for a moment his eyes had seemed to glow yellow.\n\"Are you okay?\"\nStiles looks up to see Cora staring at him, brows drawn together. He bites back a hysterical laugh and carefully sets the DVD case on the coffee table. \"Yeah, yeah, I'm fine. Just going through the movies.\"\nCora frowns, and Stiles wonders if she can hear the way his heart is pounding like he's just ran ten miles. Her eyes flick down to the DVD case and then back up to him, widening. Stiles can't deal with that right now, so he focuses on the stack of movies, going through them one by one, placing them all down on top of the one he suddenly wants to break.\nEventually something gets chosen and Cora puts it on, but damned if Stiles knows what. He's moved to the corner of the couch, and sits there in a haze of unfocused thoughts. He eats popcorn and pizza and drinks Coke and pretends to pay attention to the movie he can't name. Nobody except Cora seems to notice, as she's the only one who keeps glancing at him worriedly.\nAt some point he pulls his phone out and starts going through his texts with Derek.\nwhat color are your eyes, really? are they green or hazel? usually, yes.\nhave you ever broken any bones? a few times. I can't remember specifics, though.\ndid you ever get into any fights when you were younger? do siblings count? Laura and I used to claw and bite at each other so bad mom spent a whole year ordering us apart. puberty was rough.\nThere are more, lots more. They're all vague references, things Stiles brushed off or didn't even notice. He feels sick to his stomach; how has he been so blind?\nIt's close to midnight when the others decide to call it a night. Stiles follows Scott, Allison, and Lydia out the door as they head for his Jeep, and when Cora tries to reach for his arm he sidesteps away, not meeting her eyes.\n\"Happy Thanksgiving,\" he calls out over his shoulder, climbing into the driver's seat and slamming the door shut.\n\"That was fun,\" Allison says from the back as Stiles drives down the driveway. \"We should do it again.\"\nLydia sniffs, crossing her arms. \"I still don't understand what's so wrong with romance movies.\"\nStiles tunes them all out, dropping off Lydia first and then Allison, waiting in her driveway as Scott climbs into the front seat.\n\"Okay, spill,\" Scott says as Stiles turns the Jeep toward his house. \"You've been acting weird all night.\"\n\"I don't know what you're talking about.\"\n\"Don't give me that shit. I know you too well, and something's wrong.\"\nStiles' fingers tighten on the steering wheel. \"I don't know how to explain it without sounding crazy. I just – I think Derek's been keeping something from me. And Cora, too, maybe. Well, definitely, though I think maybe she was trying to tell me in her own way.\"\n\"Like what?\" Scott scowls. \"Is it something huge, like he has a girlfriend? Or something stupid, like he paints his toenails?\"\nStiles laughs, he can't help it, but it comes out slightly choked. \"Dude. No, I don't think he has a girlfriend, but if I'm right then it could be pretty fucking huge.\"\nScott is quiet for a moment. \"Maybe you should just ask him.\"\n\"I will.\" Stiles swallows. \"I will, eventually. But I think I need to figure some stuff out first.\"\n\"If it's something bad you'll let me help beat him up, right?\"\n\"You couldn't beat up a butterfly.\"\n\"Why would I want to beat up a butterfly? They never hurt anyone.\"\n\"Anyway, I'm pretty sure it's not possible for us to beat up Derek Hale.\"\n\"We could try.\"\n\"You'd end up having an asthma attack and I'd be left to fend for myself. Badly.\"\n\"Not if I use my inhaler first. Preventive measures. Though I can't say much about your fighting abilities.\"\n\"Shut up, I'm better than you are.\"\nScott grins and reaches over to punch his arm. \"Do you want me to come over?\"\n\"Nah,\" Stiles says, sighing. \"This isn't something I can avoid any longer.\"\nHe drops Scott off and then drives back to his own house. His dad is working so he's alone, and he goes through and double checks all the locks before going up to his room. It's well past midnight now, but he's not even remotely tired. The shocked haze from earlier has faded into a familiar buzz, and he sits down at his desk and opens his laptop. He pulls up the pages Cora had repeatedly told him to look at and takes a deep breath.\nIt's time to do some research.\n*\nThe sound of an incoming text jars Stiles out of the page he was reading on pack hierarchy, and he blinks at the early morning light coming in through his window. If he had a hundred bucks he'd bet it all on Talia being the Hale family Alpha.\nThe text is from Derek. did you have fun last night?\nStiles stares at it for a long moment, trying to decide how to answer that. I don't remember much of it, to be honest. too distracted.\n\nby what?\n\n\"Fuck,\" Stiles mutters.\n\njust some stuff. actually, I was up all night and was just about to crash, so I think I'm going to cut my phone off for a while.\n\nDerek's reply takes a few minutes, and Stiles can almost feel his hesitancy. okay. talk to you later?\n\nyeah.\n\nStiles drops his phone on his desk and stares at it. He feels like an ass, but he's just not ready to talk about this yet. Exhaustion hits him all of a sudden, and he rubs one hand over his face before closing his laptop and climbing into bed, fully dressed.\nMaybe things will make more sense after some sleep.\n*\nThey don't, not really, and they don't get any easier.\nStiles doesn't hear from Derek for the rest of Sunday, or throughout all of Monday, and he doesn't try to contact him, either. He's lost in a downward spiral of internet websites, deep ones he probably never would have found with Google – and damn it, he's good at Google – and part of him wonders why this stuff is even online in the first place.\nThen again, maybe it was put up by someone like himself, who accidentally discovered that werewolves actually fucking existed and wanted to warn others.\nThere are several points where he thinks he's lost his fucking mind. Mythological creatures are just that – mythological. He fights computer animated versions of them on the internet, they can't possibly be real.\nExcept some things just don't add up, and maybe the crazy explanation really is the only one.\n*\nAt some point, Stiles gets pissed.\nReally pissed.\nMore than that, though, he's hurt and mortified. Going on the assumption that werewolves are real, then if all these websites are true the enhanced hearing and smelling is more than the little bit he thought it was. It's like, epic amounts of more.\nWhich means that Derek and Cora both – and everyone who had been at the Hale house that first night – could hear all of the things he thought he was mumbling to himself, or conversations that were meant to be private. The one he'd had with his dad the night Derek brought Cora over – the way Cora had smirked and Derek had looked embarrassed. They had heard that entire, humiliating thing.\nAnd Derek. Derek had been able to smell the interest Stiles had in him, right from the beginning.\nThat one hurts the most, Stiles thinks.\nAnd fuck, Cora had been able to smell the sex they'd had. That's what she had meant that day, when she'd told him he reeked.\nStiles flushes hot and slams his laptop shut. He's had enough for now.\n*\nOn Wednesday, Derek texts him again.\n\nhey, is everything okay?\n\nStiles stares at it for a moment, and then closes it out without answering.\n*\nThursday is Thanksgiving, and Stiles and his dad have invited Scott and Melissa over, like they do every year. Stiles is determined to have a good day, and opens the door with a wide grin.\n\"Please tell me that's pumpkin pie,\" he says, pointing at the pie plate Melissa is holding.\n\"Fresh from the oven.\" Melissa pulls it out of reach as he grabs for it. \"I don't think so. You're not allowed to have any until after we eat and everyone else has had a slice.\"\n\"What? But –\"\n\"Dude, you ate the whole thing last year,\" Scott says as Melissa edges by Stiles, taking the pie with her.\nStiles glares at him. \"Traitor.\"\n\"Yeah, whatever.\" Scott grins, handing over a casserole dish. \"Here, you can carry the macaroni and cheese.\"\nStiles sniffs, taking it. \"Homemade?\"\n\"Of course.\"\nThey follow Melissa into the kitchen, where she's helping John peel sweet potatoes. Stiles puts the macaroni and cheese on the stove, where the heat from the oven should keep it warm, and mournfully eyes the pumpkin pie on the counter.\n\"So, Stiles,\" Melissa says. \"John tells me you're dating an older boy.\"\nStiles tenses, and then runs a hand through his hair to cover it. \"Uh, yeah. Well, I mean, it's only been two dates so far, so…sort of?\"\n\"And you're being careful, right? He's being nice?\"\nStiles flushes. \"Yeah, I am. And he is. Do you need our help with anything?\"\nJohn chuckles. \"I think that's a hint, don't you?\"\n\"Sounds like one.\" Melissa grins at him. \"Go on, we've got this.\"\nScott follows him up to his room, shutting the door behind them. \"Okay, what's going on?\"\n\"When did you become so perceptive?\"\n\"I just know my best friend.\"\n\"Ugh.\" Stiles makes a face and starts setting up a movie on his laptop. \"I don't know if Derek and I actually are dating.\"\n\"Why not? Does this have to do with that potentially huge thing?\"\nStiles sighs and sits on the end of his bed. \"Yeah. I'm not sure what to think, and I'm kind of really fucking pissed and humiliated, but at the same time I really like him. Like, a lot.\"\nScott sits next to him, frowning. \"Have you talked to him about it yet?\"\n\"No.\" Stiles winces. \"I've maybe been ignoring him.\"\nScott gives him a flat, unimpressed look. \"Stiles. You really need to talk to him. Like, as soon as possible.\"\nStiles groans and falls back on his bed. \"Fuck, dude. Relationships are hard.\"\n\"Yeah.\" Scott grabs Stiles' laptop and finishes getting the movie ready. \"But I think it can wait until tomorrow.\"\n\"That is a total contradiction to what you just said.\"\n\"Thanksgiving doesn't count. Thanksgiving is for family, food comas, and football, not fighting with significant others.\"\n\"Nice alliteration there.\"\nScott beams. \"Thanks.\"\nThey don't get far into the movie before it's time to eat, and Stiles tries to forget about Derek and werewolves for a while. After stuffing himself beyond full he ends up moaning on the living room floor next to Scott, both of them clutching their stomachs pitifully while their parents drink coffee and watch the football game. Stiles doesn't know if Melissa is even interested in football, but she watches along and cheers with his dad, so Stiles figures it doesn't really matter.\nScott and Melissa don't leave until nine, and when the door closes behind them Stiles collapses onto the couch and blinks blearily at his dad.\n\"Is there any pie left?\"\nJohn snorts. \"You haven't eaten enough already?\"\n\"There's always room for pie.\"\nJohn shakes his head but goes into the kitchen, reappearing a couple of minutes later with two small plates, each with a slice of pumpkin pie and a spoonful of whip cream on the top.\n\"Happy Thanksgiving, Dad,\" Stiles says, taking his.\n\"Happy Thanksgiving, son.\"\n*\nStiles dubs Friday Thanksgiving Recovery Day. It's his dad's last day off before going back to work on Saturday, so they spend the day camped out in the living room, eating turkey sandwiches and watching random movies on Netflix.\nIt's a good day.\n*\nOn Saturday morning, Stiles is woken to his window sliding open with a sharp snap. He flails up out of a dead sleep, tumbling out of his bed and landing on the floor in a tangle of bed covers.\n\"Fuck,\" he coughs, fighting his way out. Cora is standing next to his open window, arms crossed over her chest. She looks seriously pissed. \"Did you come through my window?\"\nShe bares her teeth in a silent snarl. \"What the fuck do you think you're doing?\"\nStiles is not awake enough for this. \"Well, I was sleeping, until you scared the shit out of me by climbing through my window.\"\nCora stalks toward him and grabs onto his t-shirt, easily hauling him to his feet. \"Don't pretend you don't know what I'm talking about.\"\n\"Oh, oh really?\" Stiles yanks away, though he doesn't go far. The anger from earlier in the week surges forward, waking him up the rest of the way. \"You mean like you and Derek pretended not to be fucking werewolves?\"\nHe doesn't realize just how crazy it sounds until he says it out loud.\nExcept Cora's eyes blaze bright yellow and she lets out a low growl, and suddenly Stiles doesn't feel crazy anymore.\n\"Fuck you,\" Cora says, eyes fading back to brown. \"It's not like we can just go around telling whoever we want what we are. Not only would people think we were crazy, but we could get killed. But that obviously means nothing to you.\"\n\"I didn't – no, you know what? You're not turning this around on me. I deserved to know I was getting involved with someone who shouldn't even exist!\"\n\"Why?\" Cora laughs, but it comes out bitter and hurt. \"So you could break Derek's heart before even getting the chance to know him?\"\nStiles blinks. \"That doesn't even make sense.\"\n\"God, you're so stupid.\" Cora turns and takes two steps away before turning back. \"Just because you didn't notice Derek until you came to our house doesn't mean he didn't notice you.\"\n\"That – doesn't help. That sounds really creepy, actually.\"\nCora looks furious, clenching her fists. \"I'm talking about the fucking movie theater, you moron. He told me and Laura – told us about this gorgeous, smart-mouthed kid that would come in with his friends all the time, and never once paid him a bit of attention so he left him alone. He had overheard your friends talking to you, so when he told us your name I knew exactly who he was talking about. Why do you think I insisted you come to my house that first night? Or why I jumped at the chance to do werewolves for our project? I wanted to make my big brother happy – but now he's just miserable, because you turned out to be a gigantic fucking asshole.\"\nOh. So maybe not that creepy.\nIt still makes Stiles' stomach sink, because he's painfully familiar with pining, and it never turns out well.\n\"I still don't understand why he didn't just tell me. Or why you didn't, for that matter. All it would have taken was showing me. Why give me all these hints, why play fucking games with me?\"\n\"It wasn't a game!\" Cora yells. \"But you know what? I'm done explaining. If you really want to know, pull your head out of your ass and ask Derek.\"\nShe's out the window before he can say another word, and Stiles goes over to slam it shut just because he can. He's still pissed, but now he feels massively guilty on top of it, not to mention scared that Derek will have realized that Stiles probably isn't who he thought he was.\n\"Fucking goddamn it.\"\nStiles grabs his phone and types out a quick text to Derek. can you come over?\nHe doesn't wait for an answer, dropping his phone on his bed and heading for the bathroom. It's too early for Derek to be at work, so he'll either ignore Stiles or come over, and there's no point in stressing about it.\nStiles takes an extra long, extra hot shower, and when he gets out he takes the time to shave and brush his teeth. He pulls on the clean sweats and t-shirt he brought in with him, not bothering with underwear, and heads back to his room.\nWhen he opens the door Derek is standing in front of the window, leaning against the sill. Stiles nearly brains himself on his door.\n\"Jesus fucking – is this a werewolf thing or just a Hale thing?\"\nDerek blinks. \"What?\"\n\"The window.\" Stiles waves at it, kicking his door shut behind him. \"Cora climbed through earlier to yell at me.\"\n\"Oh.\" Derek looks uncomfortable, his shoulders hunching up as he scowls.\nStiles sighs. \"So I think we have some things to talk about.\" He walks to the side of his bed and sits, facing Derek. \"Starting with the fact that not only are werewolves real, but you are one.\"\nDerek stares hard at the floor and nods. \"We are, and I am.\"\nStiles waits, but when Derek doesn't say any more he glares. \"Come on, dude. Give me something here, because all I know is what I've read online, and that's not necessarily accurate.\"\n\"What do you want to know?\"\nStiles lets out a breath. \"Okay, well. Let's start with why you didn't tell me. I mean, just how long were you planning on keeping this a secret?\"\nDerek flinches. \"I didn't –\" he starts, and breaks off to close his eyes. \"It's not that I was planning on keeping it from you, I just – fuck. Look, when I was fifteen I got my first real girlfriend. She was smart, and she figured it out, but she wasn't scared. She accepted it, and we were together until senior year. We broke up for other reasons, things that had nothing to do with what I was, and the whole thing distorted my perception of what people – humans – were okay with.\"\nHe pauses, taking a deep breath, and Stiles frowns in confusion. After a few moments of silence in which Derek stares at the far wall with his jaw clenched, Stiles huffs in frustration.\n\"So you didn't tell me because your first girlfriend was amazing and figured it out and loved you anyway? That doesn't make any sense, Derek.\"\n\"No,\" Derek snaps, and then swears, pinching the bridge of his nose. \"My first year of college, I fell for this guy, and after dating for about six months I decided to tell him. And he freaked. He called me all kinds of names and he – he got a fucking restraining order, said I had threatened him. So I figured that Paige was the exception to the rule, and I haven't told anyone else, ever. I've never again let myself get close enough to someone for them to figure it out. Until you.\"\n\"Wow,\" Stiles says. \"Wow, and I just totally ignored you for a week after finding out. Jesus fuck I'm stupid. And an even bigger asshole than I thought.\"\nDerek frowns, shrugging, but he doesn't meet Stiles' eye. \"It's not that big of a deal. You didn't know.\"\nStiles laughs hollowly. \"No, I didn't. I didn't know anything. I thought I did but I was so fucking wrong.\"\n\"Stiles, I –\" Derek draws in a breath. \"I'm sorry I didn't tell you.\"\nHe sounds utterly defeated, like he's already accepted that Stiles won't want to have anything to do with him.\n\"I thought it was a game.\"\nDerek finally looks up at that. \"A game? What –\"\n\"You, being interested in me,\" Stiles admits, and fuck, that thought still hurts. \"Not at first, but when I realized how much more enhanced your senses were compared to mine – to any human's, I guess – I knew you had overheard the things I've said and – and smelled it when I –\"\n\"So you thought I was taking advantage of that and having some fun,\" Derek says, eyes going wide. \"Fuck, Stiles, no. I swear that's not – I wouldn't do that.\"\n\"I know.\" Stiles bites at his bottom lip. \"I mean, I know now. Cora – Cora told me that you noticed me at the theater, while you were working, before I ever showed up as her partner for the history project.\"\nDerek flushes deep red. \"Goddamn it, Cora,\" he mutters, and then sighs. \"I – yeah. My first day, you and your friends came in, and you were laughing at something and I couldn't take my eyes off of you. I never bothered you, though, I didn't – I'm not a fucking stalker, and at the time I didn't even know how old you were.\"\n\"Fuck.\" Stiles feels like he can't breathe, and has to force his next words out. \"I wanted the same girl for years. Years, and I built her up so much in my head that when we finally became friends it was a hard realization that she wasn't anything like that. It was even harder to accept that we weren't right for each other, romantically. And I'm not anywhere close to in love with her now – not like that, I love her as a friend but that's it. Actually, I'm pretty sure I'm falling for you, so if you – if you've built me up like that, then I need to know now.\"\nDerek's head jerks up and he stares at Stiles, eyes wide and shocked. \"You're – fuck. Stiles, I –\"\nStiles smiles, and it feels tight and brittle. \"Just be honest, okay? Because if you've got certain expectations about me, then I can tell you right now I'm not going to meet them.\"\n\"Shut up, you –\" Derek stumbles forward, falls to his knees in front of Stiles. His fingers dig into Stiles' thighs and the look on his face is so hopeful it makes Stiles' breath catch. \"I did. I did build you up, I admit it. I didn't know anything about you. But then I met you for real, and you – you're better. You're so much better than I had imagined. You're funny and sarcastic and smart. You'll talk about your mom with me, and about how much your dad means to you. I like that you won't take my shit, but at the same time I hate it because it means you won't let me get away with anything. You argue with me and prove me wrong and drive me crazy, but then you do things like challenge me to swinging competitions and kiss me like you're drowning. I'm falling so hard for you, the real you, not the one that lived in my head for four months.\"\n\"Fuck,\" Stiles says. \"Fuck you.\"\nHe places his hand on the back of Derek's head and leans down, pulling him into a kiss, slipping his tongue between Derek's lips and drinking down the noise he makes. The kiss is edged with desperation, almost frantic in its intensity, and Stiles can't stop himself from whimpering helplessly.\nDerek pulls back with a soft gasp, licking at Stiles' bottom lip before resting their foreheads together. \"So does this mean you're going to stop ignoring me?\"\n\"Dude, you are going to get so sick of me.\"\nDerek smiles. \"Prove it.\"\nStiles chokes on a laugh. \"Okay, let's start with this – is it true or false that werewolves can't carry diseases?\"\n\"True,\" Derek says, and it comes out soft, in a way that makes it obvious he thinks the question is about Stiles' mom. But it really, really isn't.\n\"So if you were to fuck me, we wouldn't have to use a condom? Since I've only ever done anything with you and you can't carry anything.\"\nDerek draws in a sharp breath, eyes going dark. \"No, we wouldn't.\"\n\"Good.\" Stiles reaches for the hem of his t-shirt, pulling it over his head. His hands are shaking and his heart is pounding – what if Derek says no? \"I want that. I want you to fuck me, and I want you to come inside me.\"\n\"God, Stiles –\" \nDerek pushes forward, kisses him hard and bruising, his hands gripping at Stiles' waist, just above his hips. He licks his way inside, hot and demanding, his stubble scraping against Stiles' skin. Stiles makes a desperate sort of noise in the back of his throat and starts pushing at Derek's jacket.\n\"Off,\" Stiles mumbles. He tugs at Derek's shirt, biting another kiss into his mouth. \"This too. All of it. I want you naked, like, five minutes ago.\"\nDerek laughs, breathless, and pulls back just far enough to do as he's told, dropping both his jacket and his shirt to Stiles' floor. He stands, toeing off his shoes and reaching for the fly on his jeans.\n\"Wait, hold on.\" Stiles moves to bat Derek's hands away. \"Let me. It was dark last time, I didn't get as good of a look as I wanted.\"\nDerek makes a choked noise, like he doesn't know if he wants to laugh or not. He gestures towards his crotch. \"Don't let me stop you.\"\nStiles grins up at him and then flicks his eyes back down. Derek's dick is straining against the front of his jeans, large and thick even through the restricting material, and Stiles has to bite back a groan. He works open the fly, not bothering to try and be graceful as he pulls down Derek's jeans and underwear.\n\"Fuck, you're amazing,\" Stiles breathes, taking the hard length in hand. He strokes it a few times and then leans forward, licking his tongue over the exposed tip.\nDerek gasps, hips jerking, and Stiles can't help but open his mouth and suck him down. He can't go far before his gag reflex kicks in and he chokes, but Derek groans like Stiles has killed him. Stiles pulls back and drags in a breath, stroking him gently.\n\"I'm going to need a lot of practice at that.\"\n\"That's – we can do that,\" Derek says, sounding strained.\n\"Not today.\" Stiles looks back up at him. \"I've wanted you to hold me down and fuck me stupid since I first saw you walk into the kitchen at your house.\"\nDerek groans, rolling his hips so that his dick slides through Stiles' hand. \"Please tell me dirty talk is a thing that you like.\"\n\"I honestly don't know the answer to that,\" Stiles says, though he thinks maybe it is. He grins. \"I guess we'll just have to find out.\"\nDerek leans down and presses his mouth to Stiles' ear. \"We are going to have so much sex there won't be any question about what you like.\"\nStiles shudders. \"Jesus fuck.\" He lets go of Derek's dick and scoots back on the bed, lying down and lifting his hips to push his sweats down and off. \"How about you tell me what you like.\"\nDerek watches him, kicking his jeans and underwear the rest of the way off. \"I like a lot of things.\" He crawls onto the bed, eyes dark and predatory, and Stiles shivers. \"I like to breathe in the scent of you.\" Derek buries his nose in Stiles' groin, taking a deep breath. \"I like it when you smell like me; I want you to always smell like me.\" He licks at Stiles' stomach, where he had come on him at the park. \"I like to leave my mark.\" He sucks on the skin of Stiles' hip, making Stiles whimper and jerk. \"And I like to bite.\" \nHe nips at the same spot, teeth sharp.\n\"Ah, fuck,\" Stiles breathes, dick giving a hard twitch.\nDerek grins up at him, wicked and beautiful. \"I like to fuck.\" He pushes Stiles' legs open and settles between them, his hard dick grazing against Stiles'. \"I like you beneath me, willing and eager. I want to hear you beg for me to fill you up. I want to hold you down – \" He captures Stiles' wrists in his hands, pinning them to the bed. \"– and fuck you until you forget your own name.\"\nStiles heaves in a deep breath, closing his hands into fists and straining against Derek's hold, testing. Derek smirks, not moving at all, and Stiles whines at just how turned on that makes him.\nDerek leans down and whispers into Stiles' ear, \"I also like to be fucked.\"\nStiles' eyes flutter closed and his mouth falls open. Derek keeps talking.\n\"I want to feel your dick inside of me, filling me up. It would be so good, the way you would stretch me open, pushing as deep and hard as you can. I could come from that, you know – I could come just from you fucking me.\"\n\"Derek,\" Stiles says, unsurprised when his voice comes out tight. \"I need you inside of me right now.\"\nDerek hums, dragging his tongue over the skin just beneath Stiles' jaw. \"Ask me nicely.\"\n\"Please.\" Stiles can't bring himself to care that it bursts out of him without permission, doesn't care how desperate he sounds. \"Please, please, oh god please –\"\nDerek kisses him, deep and messy, lips bruising against Stiles'. His tongue pushes in deep, sweeping through, and Stiles whimpers, opening his mouth as far as he can.\n\"Lube,\" Derek breathes when he pulls back. \"Where –?\"\n\"Bedside table, top drawer.\"\nDerek lets him go to reach for it, and the movement puts his chest right above Stiles' face. Stiles leans up and licks at a hard nipple, grinning when Derek jerks and swears. Derek sits back, lube bottle in hand, and flicks a finger over Stiles' in retaliation. It shoots sparks all the way down to Stiles' dick, and he jerks his hips, gasping.\nDerek looks smug for a moment, and then he pushes Stiles' legs open as far as they can go. \"Have you ever fingered yourself?\"\nStiles snorts, watching as Derek pours out a generous amount of lube onto his fingers. \"Uh, yeah. All the time.\"\n\"Good,\" Derek says, and slides one finger all the way in to the knuckle.\n\"Fu - uck.\"\nDerek pumps his finger a few times before adding second, and Stiles grabs his knees, pulling them back to give Derek more room. Derek's fingers are thicker than his, and the angle allows him to go deeper than Stiles ever manages on his own. He groans, fingers digging into his knees, and wriggles his hips.\n\"More?\" Derek asks, but he's already pulling back to add a third.\nThe push back in burns more than it had with just two, and Stiles lets out a breath, trying to relax.\n\"That's it, that's good,\" Derek murmurs, eyes on his fingers as he moves them. The pain is already starting to fade, replaced with the feeling of building pleasure. \"God, you loosen up so easily. This is going to be so good, Stiles, I'm going to make you come so hard.\"\nStiles shudders. \"Fuck, Derek. You're killing me.\"\n\"Not even close.\" Derek grins and pulls his fingers free. \"Is there any particular way you want to do this?\"\nStiles swallows, and there's a sudden nervous fluttering in his stomach. Oh god, this is really happening. \"Uh – I've kind of always imagined it from behind –\"\nDerek makes a quiet noise in the back of his throat. \"Yeah, okay. That – that sounds good.\"\nStiles drops his legs and squirms around until he's on his stomach, thankfully managing not to accidentally kick Derek while doing so. He pushes his pillows down to the floor, flushing deeply when he glances back and sees Derek staring at his ass.\n\"Fuck, you're gorgeous,\" Derek says, palming Stiles' ass cheeks and spreading them open. \"I can't wait to get inside of you.\"\n\"So fucking do it.\" \nStiles arches his hips back, and Derek groans, reaching for the bottle of lube. He opens it and pours some directly onto Stiles' hole, making him jerk, and then slicks his dick with more. It seems like a bit of overkill to Stiles, but then Derek presses the head of his dick to Stiles' hole and starts pushing inside.\n\"Fuck,\" Stiles gasps, fingers clenching in the sheets. Fucking shit that hurts. \"Oh god.\"\n\"It's okay,\" Derek murmurs, hitching his hips in short little thrusts, slowly working his way deeper. \"It's okay, I've got you.\"\nHe slides a hand over Stiles' lower back, pressing down with his palm, and some of the pain eases off. It's just enough for Stiles to breathe and focus on relaxing.\nWhen Derek is finally balls deep he pauses, both of his hands coming to rest by Stiles' sides. \"You okay?\" he asks, and his voice sounds strained.\n\"Yeah – yeah, just –\" Stiles starts to count, and when he reaches thirty he lets out a breath. \"Okay.\"\n\"You sure?\"\n\"Yes, god, come on –\"\nDerek rolls his hips, his dick deep inside of Stiles' ass, stretching him open like he never has been before.\n\"Fuck, you feel so good,\" Derek says, the slow hitches of his hips gradually morphing into something harder.\nStiles whines, burying the sound in his sheets as he pushes back, gasping when Derek thrusts in hard. The pain has faded to something more manageable now, the feel of Derek moving inside of him making his softening erection harden back up. It's trapped against the mattress and he groans, wriggling to try and give himself some friction.\n\"Wait.\" Derek pauses halfway out, shifts to a wider stance, and grabs Stiles' hips, hauling him up to his knees. The movement pulls Stiles back onto Derek's dick, the hard length pushing deep inside, and he cries out, shaking at the wave of pleasure. \"That's it; there we go.\"\nAnd then Derek starts to fuck him hard, slamming in again and again and again and again. Stiles' eyes roll back, mouth falling open, and he widens his knees, angling his ass up.\n\"Fuck, fuck, fuck, oh my god –\"\nDerek groans, fingers bruising in their hold on Stiles' ass cheeks, squeezing tight as he holds him open. \"Oh god, oh fuck – Stiles –\"\nStiles' fingers are twisted in his sheets, clenched so hard his knuckles are turning white, a broken-off sob punched out of him with every one of Derek's pounding thrusts. His entire body is thrumming, tingling heat pooling at the base of his spine, and he lets go of the sheets with one hand to reach for his dick. He's so hard it hurts, pre-come leaking from the tip and making a small wet spot on the bed below.\n\"Gotta – Derek, I need –\"\nFour hard strokes is all it takes, and Stiles comes with a shout. His whole body tenses, ass clenching down around Derek's dick, drawing the orgasm out until he's whimpering and shaking. Derek fucks him through it, his balls slapping against Stiles', short fingernails digging grooves into Stiles' skin.\nAnd then Derek pushes deep, deeper, and goes still. He leans down and bites Stiles' shoulder, making Stiles' spent dick twitch.\n\"Fuck,\" Stiles gasps, struggling to keep himself up as Derek comes inside of him.\nDerek whines and pulls back, licking at the spot he just bit. Stiles is pretty sure he didn't break skin, but his fried brain tells him that every time he presses at the spot for the next few days it's going to make him painfully hard.\nDerek pulls out slowly, gripping Stiles' hips to keep him in place. Stiles feels open and exposed, his hole fucked wide, and Derek swears softly as he dips two fingers inside.\n\"I think,\" Derek says, sounding completely wrecked as he plays with Stiles' stretched hole, \"that one day I'm going to buy a plug, and I'm going to fuck you like this and then slide it in. And then do it again and again and again, until you're so full of my come and so stretched it starts to leak out anyway.\"\n\"Oh god.\" Stiles shudders. \"That day better be one day soon.\"\nDerek hums and finally pulls his fingers free, moving to lie down next to Stiles. Stiles collapses face first, grimacing at the wet spot he lands in. Neither of them move to clean up, and Stiles is pretty sure he could easily fall asleep.\nInstead, he turns his head to look at Derek. \"If you were interested in me from seeing me at the theater, why did you pretend not to know who I was that day in the kitchen, when I came over for dinner?\"\nDerek shrugs, shifting so he can card his fingers through Stiles' hair. \"I panicked. Cora hadn't told me who her partner was so I didn't know why you were there. I figured it was safer to pretend I didn't want to drag you up to my room and ravish you.\"\nStiles snorts. \"Ravish?\"\n\"Shut up.\"\n\"Can I see?\"\nDerek frowns, brows drawing together. \"See what?\"\n\"You.\" Stiles gestures to his face. \"I mean, I kind of did on Halloween, but I was drunk and thought I was hallucinating.\"\nDerek flushes and looks guilty at that, but then his eyes shift from green to yellow, and he bares long, sharp teeth. He pulls his hand from Stiles' hair and shows him the sharp claws where fingernails used to be.\n\"Whoa,\" Stiles says, trying to take it all in. \"Dude, that's so awesome.\"\n\"This is only a partial shift,\" Derek says, though he looks pleased. His voice comes out thicker with the teeth in the way. \"I can show you the full if you want?\"\nStiles eyes him warily. \"Does it involve, like, a full-on transformation?\"\nDerek grins, and it looks weird around his teeth. \"No, although my Mom can shift into an actual wolf. Most werewolves can only go so far.\"\n\"Oh. Okay, then, show me.\"\nDerek sits up and Stiles shuffles around until he's propped against the wall. He watches as Derek's face changes, hair sprouting along his jaw, and his forehead and bridge of his nose shift into something broader.\nStiles blinks. \"Where did your eyebrows go?\"\n\"I don't know.\" Derek shrugs. \"Some werewolves have them in full shift, some don't.\"\n\"That's so weird.\"\n\"Are you done ogling me now?\"\n\"Hell no. Have you seen yourself?\"\nDerek shifts back to human and rolls his eyes. \"How long do we have until your dad gets home?\"\n\"Hours,\" Stiles says. \"Hours and hours.\"\n\"Good.\" Derek grabs his hand and yanks him forward, falling back at the same time. Stiles ends up sprawled on top of him, dick cradled in the space next to Derek's. \"Let's see if we can find out what else you like.\"\n\"I like the way you think.\"\n\"I thought you might.\"\n*\nLater, when they're tangled together and both too exhausted to move, something occurs to Stiles.\n\"Oh my god. You totally cheated at mini golf.\"\nDerek freezes, and then laughs until he can't breathe.\n*\nJohn stares hard at Derek over the kitchen table.\nDerek shuffles uncomfortably in his seat.\nStiles sighs. \"Dad, come on. You said you were okay with this, and I'm trying to follow the rules you gave me.\"\nJohn points at him. \"Don't ruin my parenting moment.\"\nStiles holds both hands up in surrender, barely restraining from rolling his eyes.\n\"So. Twenty-three.\"\nDerek nods. \"Yes, sir.\"\n\"No offense to my son,\" John starts, \"because lord knows I love him – but why are you interested in a seventeen year old?\"\n\"Awesome, Dad, thanks for that,\" Stiles mutters.\nDerek glances at him, and then back to John. \"He'll be eighteen soon. Five and a half years isn't that big of a difference.\"\n\"That's not what I asked.\"\nDerek flushes. \"He's – he makes me laugh. And he's smart, and he challenges me like no one else does.\"\nJohn hums. \"That's a start, I guess. Now, I know Stiles likes to think I'm blind or stupid, but I expect you to answer my next question honestly.\"\n\"Okay,\" Derek says warily.\n\"Are you using protection when the two of you have sex?\"\n\"Oh my god,\" Stiles says, horrified.\n\"We're always safe, yes,\" Derek answers evenly, and now that he knows about the whole werewolf thing Stiles can appreciate the phrasing.\n\"And you've never done anything Stiles hasn't one-hundred percent been okay with?\"\n\"Dad.\"\n\"No, sir, definitely not.\"\nJohn sighs. \"Well, I can't say I'm particularly happy with the thought that my underage son is sleeping with someone old enough to buy alcohol – which you absolutely will not be doing for him, by the way – but thank you for both your honesty and your responsibility.\"\nDerek nods, and Stiles wants to crawl under the table and die.\n\"Stiles tells me you're a student at UCLA, and you're going back next year.\"\n\"Yes, sir. I'll be getting my masters in history, and I'm thinking about going for a doctorate as well.\"\nJohn nods. \"Do you know what you're going to do with your degree once you have it?\"\nDerek looks uncomfortable at that. \"Not exactly. I've thought about teaching, though.\"\n\"Did Stiles tell you he's going to UCLA as well?\"\n\"Yes, sir.\"\n\"And what are your plans for the two of you going to the same school? I want him to live in the dorms for at least freshman year. He deserves to have that experience.\"\n\"I agree,\" Derek says, looking over at Stiles with a half smile. \"That was some of the best times I had at college, and I don't want him to miss out on anything just because he'll have a boyfriend going in.\"\n\"So you plan on being together that long?\"\nDerek snaps his eyes back to John. \"With all due respect, sir, I plan on being with Stiles for as long as he'll let me.\"\nStiles smiles, wide and bright.\n\"And what if, once he gets to school, he decides he doesn't want a boyfriend after all?\"\nDerek goes pale, and takes a deep breath. \"Then I'll have to respect that.\"\nJohn narrows his eyes, considering, and then nods. \"Okay. I know Stiles probably told you the rules I've already set down, but I'm going to go over them again anyway. Dates where the two of you will be alone will only happen on nights I'm not working a late shift. Stiles is required to be home by whatever curfew I feel like giving him that night. You will be coming over for dinner with both of us twice a month. And even though I can reluctantly accept that you're having sex, overnight visits won't happen until after Stiles' eighteenth birthday. And if at any point his grades start to slip, there will be far more restrictions than this. Understood?\"\n\"Yes, sir.\"\n\"Stiles?\"\n\"Right-o, Dadd-io,\" Stiles says, giving him a salute.\nJohn rolls his eyes. \"Alright, get out of here. You've got a movie night to get to. I won't give you a curfew since you'll be with friends, but you'd better not be too late.\"\n\"Thank you, sir,\" Derek says, standing and holding his hand out.\nJohn stands and takes it. \"Christ, son, just call me John. We might as well both get used to it.\"\nDerek smiles, and Stiles can see him relax just the tiniest bit. \"I'll do my best.\"\nStiles gives his dad a tight hug before following Derek out to his Camaro and climbing into the passenger seat. \"As mortifying as that was, I think it went about as well as could be expected.\"\n\"It definitely went better than I expected,\" Derek says, starting the car and turning in the direction of the Hale house. \"I thought he was going to threaten to shoot me.\"\n\"I promised him we could have steak tomorrow night if he didn't.\"\n\"Oh, really?\"\nStiles narrows his eyes. \"Don't even think about it.\"\nDerek's expression goes innocent. \"About what?\"\n\"About bribing my dad with heart attack food.\"\n\"I wasn't thinking that!\"\n\"Uh-huh.\"\n\"Maybe just a steak every now and then.\"\nStiles sighs. \"Okay, but only with my permission.\"\n\"That defeats the purpose of it, though.\"\n\"He doesn't have to know that I know.\"\nDerek smiles, shaking his head.\nWhen they reach the Hale house everyone else is already there, the living room a mess of junk food and scattered movies.\n\"Took you long enough,\" Scott says. \"I was starting to think your dad had arrested him.\"\n\"Nah, we lucked out this time.\" Stiles flops onto the couch, throwing his feet over Cora's lap. She glares and he grins at her. \"I think it helped that we got an A on the history project without Derek helping.\"\nCora huffs in irritation. \"I did most of the work, trying to get you to see what was right in front of your face.\"\n\"Uh, excuse you,\" Stiles says, indignant. \"I'm the one who had to go through everything and separate the stuff we could actually use, while you just sat there complaining about inaccuracies.\"\nCora scowls. \"It's not my fault people are idiots. And by people I mean you and Derek.\"\n\"We're not idiots.\" Derek glares at her, poking at Stiles' shoulder until he sits up enough to let Derek slide in behind him. Stiles immediately flops back down with his head in Derek's lap, and grins at the mock-annoyed huff it earns him.\n\"No, just willfully oblivious,\" Isaac says, and Erica high fives him.\n\"I'm so lost,\" Scott mutters. \"Again.\"\nAllison frowns, pulling her legs up into the big armchair she's sitting in and crossing them. \"So am I. I feel like there's something going on we don't know about.\"\n\"There is,\" Lydia says, glaring around at all of them.\nStiles feels a sharp stab of guilt and looks up at Derek pleadingly. \"Did you ask your mom?\"\nDerek smiles down at him, tugging gently on his hair. \"I did, and after thoroughly questioning everyone she said it was okay.\"\n\"Yes!\" Stiles throws both hands up in the air and then sits up. \"Come on, do it now, I want to see.\"\nDerek looks over at Cora, raising both eyebrows, and Cora grins.\n\"You first?\"\nDerek shakes his head. \"I'll let you do the honors.\"\n\"Oh, this is going to be good,\" Erica says, and Boyd smirks as he pulls her down into his lap.\nCora stands and faces Scott, Allison, and Lydia. \"Don't freak out, okay?\"\nShe doesn't give them a chance to respond, shifting into her full beta form.\n\"Holy shit!\" Scott jumps up and stumbles backwards, falling over an ottoman and landing in a heap on the floor. \"What the hell?\"\nAllison and Lydia both stare in shock.\n\"Werewolves,\" Stiles says, and then cackles at all three of their expressions.\n\"Are you serious?\" Scott's voice has gone high and he's looking back and forth between Cora and Stiles with wide eyes, still crouched behind the ottoman. His gaze lands on Derek. \"Are you –\"\nDerek snarls and flashes his eyes.\n\"Well this explains a lot,\" Lydia says, eyeing them all curiously.\nAllison looks over at Erica, Boyd, and Isaac. \"You, too?\"\n\"Yep,\" Isaac says, tossing a piece of popcorn up and catching it in his mouth, teeth extended.\n\"Show off,\" Erica says, kicking at him.\n\"For the record,\" Derek says, glancing quickly at Allison and then to Lydia and Scott, \"Mom requires a full year of training and pack integration before she gives anyone the bite.\"\nScott is staring at Stiles, eyes still wide but more excited than shocked now. \"Dude,\" he breathes, and Stiles grins. \"Werewolves.\"\n\"I know, right?\"\n\"Can we pick a movie now?\" Boyd asks, sounding bored. \"This is supposed to be movie night.\"\n\"No romances,\" Cora says. She shifts back to human and plops down on the couch, throwing her feet up on Stiles' lap.\nLydia scowls. \"One day you will all realize what you're missing out on.\"\n\"Nothing with sex in it, either,\" Isaac adds, glaring at Derek and Stiles.\nStiles blinks innocently at him. \"It's not my fault you have an over sensitive nose. Besides, we are so not the only ones.\" He points accusingly to Erica and Boyd and then to Scott and Allison.\n\"Exactly,\" Isaac says, gesturing between them. \"I'm surrounded by it all the fucking time.\"\n\"So get a girlfriend,\" Lydia says, raising an eyebrow.\n\"Thank you so much for the advice,\" Isaac mutters, and Erica reaches out to pet his hair.\nAllison helps Scott up, pulling him into the big armchair with her. \"Why don't we watch bad werewolf movies, and all of you in the know can point out what they got wrong.\"\n\"Most of them got everything wrong,\" Derek says, and Stiles snorts.\n\"Don't pretend you don't love those movies. Bitching about them is one of your favorite things to do.\"\nCora starts laughing and Derek flushes, glaring at him. Stiles just grins and pulls him into a kiss, ignoring the loud complaints.\nUntil Cora throws a pillow at them, and well, Stiles can't be expected to ignore a challenge like that."
}