{
    "id": "10547500",
    "url": "https://archiveofourown.org/works/10547500?view_full_work=true",
    "author": [
        "orphan_account"
    ],
    "title": "For Now You Love Me",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Regulus Black/James Potter",
        "Sirius Black/Remus Lupin"
    ],
    "characters": [
        "Remus Lupin",
        "Sirius Black",
        "James Potter",
        "Regulus Black",
        "Peter Pettigrew",
        "Lily Evans",
        "Marlene McKinnon"
    ],
    "additional_tags": [
        "Alternate Universe-No Voldemort",
        "fake dating au",
        "fake relationships",
        "Enemies to Lovers",
        "established relationships - Freeform",
        "Pining",
        "Slow Burn",
        "Fluff"
    ],
    "language": "English",
    "series": "",
    "published": "2017-04-05",
    "completed": "2017-06-16",
    "words": "14,068",
    "chapters": "5/5",
    "comments": "151",
    "kudos": "9,392",
    "bookmarks": "1,383",
    "hits": "105,307",
    "summary": "<p>It just sort of happens. The way it spills out at dinner. \"I'm dating James Potter.\" Sirius, of course, refuses to believe James and Regulus could ever be a thing. And he's determined to find out the truth.</p>",
    "notes": "<p>I said I wasn't going to be writing any more HP, then I was cruelly bullied by Jprongs over text! It went something like this...</p>\n<p>Steph: I love fake dating AUs!</p>\n<p>Me: I should write you a Jegulus one.</p>\n<p>Steph: I would love that.</p>\n<p>So here it is. Chapter one of five. Side notes- this is a no voldemort AU where Sirius doesn't run away from his family--though they're still fairly terrible and purist.</p>\n<p>Warnings for this chapter: Mild emotionally abusive language from Walburga directed at both Sirius and Regulus. Feel free to skip this chapter if this triggers you.</p>\n<p>Random, extra special thanks to mxlfoydraco for being amazing and letting me vent over the last few days and generally just being the best person ever. ILY so much and you got me motivated to write a little bit, so this chapter is for you.</p>\n<p>Welllll this took me ages, sorry about that! But it's finished and there's enough fluff I think at the end to make up for it. Or well...here's hoping. Thanks for sticking through it.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>And they all lived happily ever after, madly in love, and no one died ever.</p>",
    "text": "“…as much as I appreciate your efforts,” Regulus said, very little inflection in his voice as he stabbed at a bit of chicken on his plate, “I’m afraid you can’t arrange a marriage for me. I’m dating someone.”\nSirius glanced across the table at him, one eyebrow quirked—almost daring in a way, as if to say, ‘Oh yes, little brother? Your moment to rebel?’\nIt made sense, as Sirius had been taking the piss about Regulus not doing a single thing that would upset his parents. Regulus had argued there had been no need, but Sirius—as Sirius was wont to do—was relentless about it until Regulus had grabbed him by the front of his robes and said, “Just you watch!”\nSirius, of course, didn’t think Regulus claiming he was dating some fussy Slytherin pureblood wasn’t exactly rebelling. Whichever bird he was laying claim to was probably already on his parents’ list.\n“This is…the first we’ve heard of it,” Walburga said. She cast a quick side-eye at Sirius as though her eldest had put Regulus up to this which…well in a way, he had. “Who is she?”\nRegulus blinked, a bit owlish and faux innocent which made Sirius want to gag.\n“Yes, Regs,” Sirius added sweetly, folding his hands under his chin. “Who is she?”\n“Well,” Regulus said, slow and a bit sly with a hint of a smirk playing at his lips. “You know him.”\nThere was a pointed silence, and the tiniest cough from Orion, who followed it up by dabbing the corners of his mouth.\n“Do we?” Walburga eventually managed. Her jaw was tense, but Sirius knew she was trying to console herself with the fact that children were not off the table entirely, and at least her baby boy was a Slytherin so chances were it was someone they could tolerate.\n“The Potters. James Potter,” Regulus deadpanned.\nIf only Sirius hadn’t chosen a moment to take a sip from his goblet. But he had. And pumpkin juice went spraying across his mother’s finest linen, staining a faint orange.\nRegulus still hadn’t blinked.\nWalburga’s already pale face managed to go paler, a bit green as she swallowed and her eyes darted to Orion who was covering a half-smile with the edge of his goblet. He took a moment to compose himself as Sirius gaped like a fish and Walburga was waiting for Sirius’ mates to jump out of the walls and shout, “April Fools!”\nRegulus heaved a sigh. “The heart wants what the heart wants.”\nSirius blinked.\nWalburga made a strange noise, like a dying kneazle.\n“Well,” Orion said after the pointed silence, “at least he’s a pureblood?”\n*** \nIn the corridor, Sirius paused to listen to his mother’s wailing before grabbing Regulus by the collar, hauling him into his room. He fought back the urge to hex the little grin off Regulus’ face before crowding him up against the wall, finger pointed into Regulus’ nose.\n“What do you think you’re playing at?”\n“Nothing,” Regulus said, shrugging. “I’m not playing at anything. They asked, I told them.”\n“You and James are not dating.”\nRegulus blinked innocently. “Says who?”\n“James, for one!” Sirius howled, stepping back from his sibling. “He’s going to lose his mind the moment he hears about this rubbish. I swear to Merlin he’s going to hex you from now until the end of the world if he…”\n“Is he?” Regulus asked. His voice was so quiet, so small, so bloody sure that Sirius actually paused in his ranting. Staring at the look on Regulus’ face, Sirius scrambled over to his bed, diving into his trunk for his mirror.\nSeveral books and Moony’s jumpers went flying until he came out with a triumphant, “AHA!” and held the mirror in his hand. He tapped it, and said, “Prongs,” and waited, pacing the floor until James’ face appeared.\n“Pads?”\n“You’ll never believe this, Prongs,” Sirius said, his hand flailing in the air. “You will never believe what my brother told my parents tonight at dinner.”\nJames blinked, then said, “Ah. Came clean about us dating, did he?”\nSirius froze, like he’d been hit with a petrificus totalus—apart from the shaking in his hands. “You. He. I.” He swallowed. “What?”\nJames’ smile was soft, and so genuine Sirius started to panic as he said, “Dating? He didn’t want to tell anyone, of course. Being that it would probably upset you, but…”\n“Prongs,” Sirius said, his voice barely above a whisper. He cleared his throat and tried again. “Prongs. Are you…are you tell…” His voice cracked and he glanced up to see Regulus watching with careful, narrowed eyes. “Are you telling me that Lily fucks off to go shag Marlene and you decide…you decide to date Regulus?”\n“The heart wants what the heart wants, Pads,” James said.\nSirius’ gaze snapped up to his brother who gave an agreeing shrug. “You’re lying. You’re…you’re both lying. Your taking the fucking piss and I will not…I will not stand for this. I will not stand here and listen to this rubbish, this…this utter and absolute…this…”\n“Padfoot,” James said quietly.\nSirius blinked at his friend, then at his brother, then ended the spell. The mirror went blank, and he dropped it to the bed. “I will find out the truth,” he hissed.\nRegulus shrugged. “You already have. I’ll be here when you’re ready to accept it.”\n*** \nSirius didn’t speak to James again until the end of the hols. He didn’t answer his mirror, or so much as look across the table at Regulus who sat every meal with a smirk on his face. Sirius lurked outside of Regulus’ rooms during the final days, trying to intercept owls with letters to James, but he was so traumatised by the lovey-dovey rubbish in the one he’d managed to catch he decided it wasn’t worth it.\nJames was a determined prankster, and it was clear Regulus had inherited some of the decent genes from Sirius. He’d have to be more clever in breaking them.\nSirius managed to duck away from his parents and brother on the platform, and pushed his way through the crowd until he found Remus talking with Peter and his parents near the luggage compartment. Sirius ducked his head low, came up behind Moony, and grabbed him by the arm.\n“Nice to see you, Wormtail! Moony and I have some business to attend to!”\n“Sirius what the bloody hell…” Remus spluttered as Sirius dragged him onto the train, into an empty compartment, and spelled the door shut. “What are you doing? I told you we are not having sex…”\n“This isn’t for shagging, Moons,” Sirius said, then stopped and narrowed his eyes. “Although honestly I feel like we’re missing a prime opportunity here to…”\n“Sirius,” Remus said, crossing his arms over his chest. His brown eyes were narrowed, his mouth set in a firm line. “What the bloody hell is going on?”\n“Regulus said he’s dating James.” Sirius locked eyes with Remus, who stared back, and when the corners of his lips began to twitch, Sirius threw his hands up. “I’m not joking, Remus! Regulus told my parents at dinner,” he spat, “and then when I tried to catch him at the lie…James…James agreed with him!”\nRemus’ smile faded. “Did he? You know he’s probably taking the piss, right?”\n“Yes, I know that,” Sirius wailed. “That’s beside the point, Remus. He’s…lying to me. About dating my brother. Regulus,” he said, grabbing the sides of his head. “This is literally the worst thing that has ever happened in possibly the entire world.”\nRemus snorted, putting his hand on Sirius’ back, easing him to the seat. “Pads. I think there have been worse things than a younger sibling dating a friend.” When Sirius’ head snapped up to glare, Remus poked the end of Sirius’ nose. “But I still think he’s lying.”\n“I know he’s lying. He’s just trying to get back at me for…something.”\nRemus’ brows furrowed. “What did you do?”\n“Nothing!” Sirius immediately protested. “I mean…nothing I can think of. I love James most in the world apart from you, Moons. And if…bloody hell if he wanted to date Regs…” He shuddered. “But this is…it has to be crossing a line, right? He’s not using Regs to get over Lils.”\n“I don’t think James was…was under Lils,” Remus pointed out. “Not really, anyway. I think he was fixated on the idea of her, you know? He wasn’t even that upset when she started dating Marls.”\nSirius worried his bottom lip between his teeth. “You’ll help me break them?”\nRemus sighed. “Yeah, Pads.”\nJust then, the train gave a lurch, and it started forward. Sirius knew they ought to go find their mates, get on with the ride—possibly buy some sweets, maybe attempt to climb on the roof and dodge the trolley witch…business as usual. But Remus’ arms had come round him tight, soft and soothing. And he was feeling fragile.\nHe turned his face, nuzzling into Remus’ neck, and heard his boyfriend chuckle softly. “I’m not joking about no shagging on the train, Pads.”\n“I know,” Sirius said with a pout. “But you didn’t say anything about no snogging and I need a kiss, Moony.”\nRemus laughed, but cupped Sirius’ chin in his hands, and drew their lips together.\nFor just a little while, Sirius managed to forget about the issue that was his best friend, and his little brother.\n*** \nJames found himself sat near the Slytherin part of the train, uncomfortable to say the least. But their compartment was empty apart from him and Regulus, and Regulus had cast a clever charm on the windows to obscure the view.\n“If you’re worried about taking too long,” Regulus said with a wave of his hand, “just tell them all we were snogging.”\nJames rolled his eyes, but held out his hand. Regulus stared for a minute, horror on his face until he realised what James was asking for. Digging into his pockets, he produced a small handful of sickles and galleons.\n“Dunno what you need the money for. I’ve seen your family’s vault. It’s near ours,” he sneered.\n“Yes well, this is for a good cause,” James said, pocketing the coin.\nRegulus raised a brow. “Is it?”\n“It’s also a secret,” James told him. And it was. He hadn’t even told the others about it, and didn’t plan to until he had everything solid. He’d been trying to come up with a way to work it all out when Regulus had owled, and it was just too good an opportunity to pass up.\nWhat was a little hand-holding in front of Sirius to make him squirm?\nNot like James hadn’t gone on dates with boys before, and Regulus wasn’t terrible looking. Especially when he was hurtling round the pitch on his broom after the snitch and…\nJames shook himself out of that before things got…awkward. He cleared his throat. “Alright so. D’you want to come and sit with us?”\n“Well,” Regulus said slowly, “you could always sit with me and my housemates?”\nJames pulled a face. “I’m not sitting with Slytherins. Snape’s in that compartment.”\nRegulus sighed, clearly not going to argue. “You don’t think I’m really going to open myself up to all the hexing just because you don’t want to smell that greasy git?”\nJames snorted, and took a step in close to Regulus. He saw the high blush on his cheeks, and wondered if Regulus had actually ever had a proper boyfriend or girlfriend before. It wasn’t the time to ask, but he could use this to his advantage.\n“My friends won’t hurt you,” he said, pitching his voice low. “And if you really want to sell this…”\n“I don’t want the whole bloody school to know,” Regulus snapped, his voice a bit hoarse.\nJames sighed. “So tell them you’ve got business with your brother. We’ll have a few sweets, play a game of snap, then you can fuck off back to your friends and we’ll call it a day.”\nRegulus bit his lip. “How long are we carrying this on for, anyway?”\nJames took a step back, shrugging. “Your call, mate. Pay me, and I’ll be the best boyfriend in the world.”\nRegulus pinked even further. “I erm…”\n“Or we can just tell him the truth now.”\nWith a scowl, Regulus shook his head. “I’m not letting him have that triumph. We won’t be telling him anything, not until he believes we’re together. Honestly believes it.”\n“You realise how stubborn he is, right?” James countered.\nRegulus huffed. “Which is why I chose you. You’re even more pig-headed than he is.”\nAt that, James threw his head back and laughed, and Regulus seemed startled by it as though maybe he expected James to hit him or curse him. “I suppose that’s true, innit? Well…I guess we’ll give it a try, won’t we?”\n“I guess we will.” Regulus hesitated, then stepped forward, and tangled their hands together.\nJames only barely managed to contain a hitch in his breath as warm palm pressed to warm palm. Regulus’ hands were just a little smaller, and fit almost perfect inside his own. Better than Lily’s ever had, a traitorous voice in the back of his mind said.\nHe told it promptly to fuck off.\n“We’re going out there like this, then?” he asked, waggling Regulus’ arm.\n“No,” Regulus snapped. “It’s only…I wanted to see how it would feel. If I could…stand touching you, is all.”\n“Right,” James said.\nRegulus rolled his eyes and snatched his hand back. “At any rate, I only want your mates fooled. I’d rather not have all of Slytherin house thinking I’m shagging King Gryffindor behind tapestries.”\nJames grinned happily. “Is that what your house calls me? King Gryffindor?”\n“Oh my god,” Regulus groaned. “You are…absurd. Anyway can we please get this over with? I’m already regretting every choice I ever made which led me here today.”\nJames snickered, then held the compartment door open and stepped to the side. “After you, love.”\nRegulus glared. “I hate you.”\nJames winked as he followed him down the corridor. “Yes, but for now, you also love me.”\nIt was the second most awkward train ride to Hogwarts James had ever experienced, if he wanted to count sixth year and the pants incident in Potions. But really he didn’t want to think of that ever, so he’d rather just go with most awkward.\nHe and Regulus were near the window, his arm loosely round the younger Black. Sirius and Remus sat across from them, Remus looking befuddled, Sirius looking mutinous. There were a pile of sweets between their feet, and a game of snap which never got started. Both Peter and Lily sat near the door, Peter looking the most confused of all of them, and Lily on the edge of her seat like she was unsure whether or not she should be present for any of this.\nJames hadn’t dared look at Regulus just yet.\n“Well,” Lily said, breaking the strained silence, “congratulations you two.”\nJames’ face instantly went soft as he beamed at her. She truly was a good person, and he did love her. “Thanks, Lils. I…”\n“Don’t congratulate him,” Sirius interrupted, leaning forward in his seat. James could see Remus hook fingers into Sirius’ robes, holding him back. “It’s obvious they’re lying.”\nLily’s brows rose. “Is it?”\nIf James had thought the silence had been thick before, it was nothing compared to how it was now. He glanced at Peter who’d made a sort of aborted noise, then said, “You…think Prongs and Regulus were…going to happen?”\nLily shrugged. “Well, I mean…it makes sense.”\n“How the bloody hell,” Sirius demanded through clenched teeth, “does it make sense?”\nLily sat back, a tiny smile playing at her lips and James wasn’t sure if she was taking the piss now, or if she meant it. If it was the former, he was realising they’d missed out on having another clever mind added to years’ of potentially wasted pranks.\n“I mean, he’s not going to fall in love with you,” she said to Sirius.\n“Rude,” he shot back.\nLily shrugged. “And Regulus plays Quidditch which should have been your first clue.”\nAt that, James felt his cheeks heat up, and he didn’t miss the faint rise of colour in Regulus’ cheeks. “Oh come on, I’m not…”\n“Apart from me,” Lily challenged, “who have you dated or at the very least had a couple of dark corridor snogs with who wasn’t on a house team?”\nWell…she had him there. “Yeah, but I mean…it’s not a requirement,” James finished lamely.\nShe snorted. “Sure, Potter. But Regulus is also clever, and nice when he wants to be, but not too nice. Gives better than he gets if he can be bothered. Not bad looking, either.”\nJames watched Regulus’ face turn pinker and pinker, and he thought maybe if it weren’t for the iron grip he had on the Slytherin, he might have run away. Instead he was forced to endure the scrutiny and attention he hated so much. But…well. It was Regulus’ choice. He was the one who insisted.\n“See,” James said after a moment. “It’s obvious, and if you’d take your face away from Moony’s face long enough to notice other people…”\n“Is that what this is?” Sirius drawled, crossing his arms as he flung himself back, nearly knocking Remus in the chest with his elbow. “You’re cross because I haven’t been paying you enough attention? So you want to fake snog my brother…”\n\"Not everything is about you,\" James said with a huff. \"He and I are interested in each other.\" When Sirius' expression remained unmoving, full of challenge, James said, \"We can make a bet on it. Anything you like.\"\nSirius' eyes glinted. \"Fine. If I can prove the two of you aren't dating, I get whatever you've been hoarding away in that little sack of yours in your trunk.\"\nJames tried not to grin triumphantly, forcing a look of irritation and mild horror on his face. \"F-fine,\" he said. \"Fine. Because this isn't a prank.\" He gripped Regulus a litlte tighter.\n“And anyway, James isn’t going to date a Slytherin to get back at you,” Peter added helpfully. “If anything he’d go for Dori. Or me.”\nJames blinked at him, barely managing to hide a chuckle. He didn’t dare look over at Evans who he was certain now was on to the whole thing. “Evans, isn’t McKinnon expecting you?”\n“She is,” Lily said. “I just had to see what the fuss was about.”\n“I’ll walk you,” he said helpfully. “I mean, we have Head business to discuss anyway.”\nThere was a vague protest by both Black brothers, but with a firm glower, they stayed put and James followed Lily into the corridor.\nJust as he was about to open his mouth and ask how she figured it out, she turned to him. “You’re cute together, you two. I think you’d be good for him.”\nJames deflated. There was a small part of him disappointed he’d managed to fool even her. He knew he could convince her to keep her mouth shut, if only to upset Sirius, and he’d wanted someone to confide in.\n“Erm. Well. Thanks,” he muttered.\nShe snorted. “He’s going to figure it out eventually, though. I just hope you two get sorted first.”\nJames blinked at her, trying to process what she’d said. “So you know…”\n“That you two aren’t dating?” she offered, and shook her head. “Potter, you know I’m not an idiot.”\n“Yes well, Sirius is as clever as they come…”\n“And he knows you’re full of shit,” she replied. “I’m just waiting to see who will hold out longer. Anyway, I ought to get back to…”\n“Hang on,” he said, and tugged on her robe. “What did you mean get sorted first?”\nShe sighed, reaching out to give him a pat on the cheek. “I’m sure you’ll figure it out, James. You did with me, in the end. I suppose…it’s Regulus I worry most about, but I’m sure it’ll be fine.”\nThen she was gone, and James was left in the corridor, more confused than ever before.\n*** \n“You know, they might not actually be lying,” Peter said as they headed back to the Gryffindor Tower. James and Lily, along with the other Prefects, had been called to a meeting. Which meant Regulus was with them as well.\nSirius scowled at his friend. “You can’t seriously believe that. Wormtail…you…you have known James seven bloody years. You know this isn’t real!”\n“I dunno,” Remus said quietly, making Sirius freeze in his footsteps. “I’m not saying you’re wrong, Pads. I’m just saying…”\n“Do not. Do not betray me, Moony. My heart is small and fragile and I cannot take my every mate, the love of my life betraying me right now.”\nRemus rolled his eyes, but pulled Sirius in for a kiss as Peter huffed and elbowed past them. The portrait open, then swung shut, and Sirius let Remus crowd him into a secluded corner. The kisses lasted just a little while, and then Remus pulled back and cupped his face.\n“You want me to ask Dumbledore if he can reinstate me? Then I can get proper intel?”\nSirius sighed, but grinned at his boyfriend and tugged at one of Remus’ curls. “That’s wonderful, but no. I know it was too much stress for you with the moons and everything. Honestly it’s just…it feels like the joke has carried on a bit far.”\n“What if…”\n“Please don’t say it’s not a joke,” Sirius said. “Because it meant Jamie didn’t bother to tell me he fancied my brother. It means he was sneaking round with Regs for…Merlin only knows how long and didn’t say a word.”\n“What’s worse?” Remus prodded. “James lying to you for a prank, or lying about who he fancies?” Remus bit his bottom lip, then brought up the words Sirius really didn’t want to hear, “Because you know we hid us from him for nearly a full year.”\nSirius groaned, dropping his forehead against Remus’ collarbone and sighed at him several times in a row. “It’s different with us, okay? Because we were mates, you know. Like anything that could upset the dynamic of the group…”\n“That’s what you told him when he started dating Lily,” Remus pointed out.\n“I was young and naïve then,” Sirius muttered.\n“Six months ago?” Remus asked with a laugh. “Really…I know you and Regulus don’t see eye to eye all the time but…”\n“Remus,” Sirius said, and pulled back, “he’s…like them. Like my parents. He…he probably wants to rebel, but he’d only do it with a pureblood because he knows he can get away with it.” Things started to churn in Sirius’ head. “And that, my darling Moony, is going to be their undoing!”\nRemus looked a bit dubious as Sirius tore away from him and bolted down the corridor. “Where are you going?”\n“To put an end to this. Their way!”\n*** \nWhat was a bit of hand holding, eh? Regulus’ hands were nice, and softer than James would expect from a Seeker. He was shorter than James, which he quite fancied, and he truly wasn’t bad to look at. And since they only had to keep the ruse up for Sirius’ sake, they didn’t have to be overtly public about it.\nReally, things were working out quite nicely.\nThey hadn’t had to fake a snog yet, and Sirius had stopped pestering James.\nJames was, in fact, having a lovely breakfast at the Gryffindor table, exchanging looks with Regulus across the Hall when the mail came in. It was a bit early, and James was startled to see his parents’ tawny brown swooping round them, but it wasn’t unlikely he’d forgotten something over the hols.\nOnly…it dropped a letter. It wasn’t Howler red, thank god, but neither of his parents were really in the habit of writing notes these days. He was a seventh year, after all, he didn’t need checking in on. But he recognised his father’s untidy scrawl on the front, and he offered Mani a bit of juice before he flew off.\n“What’s that?” Sirius asked, his mouth stuffed full of beans and toast.\nJames rolled his eyes. “No idea.” He pulled at the seal and stared down at the words. It took him a moment to process what it said, but when he did, his gaze snapped up to Sirius who was smirking in triumph.\n“You…didn’t.”\n“Didn’t what?” Sirius asked, clasping his hands under his chin. “Oh, you mean I didn’t write to mummy and daddy and tell them that you and Regulus seemed like you were maybe getting…serious,” he smirked at his own tired, old pun. “That maybe the families ought to meet and talk this over before the pair of you made any rash decisions.”\n“We were keeping this private, Sirius,” James growled.\n“Well you’re so in love,” Sirius shot back, “I didn’t think you’d mind who knew. I mean, you shouted bloody sonnets at Evans over dinner all last year so…if you think I’m going to let you treat my darling brother worse than her…”\nJames took a breath, his head spinning, but he pocketed the letter and stood up. “You’re right,” he said, and Sirius clamped his mouth shut. James darted a look at Peter and Remus who were determinedly staring down at their breakfast plates. “I should be declaring my love publicly. And I wasn’t going to tell you yet but I might as well now since I have to address it with my parents,” he all-but sneered. “But since I’m going to ask Regulus to move in with me over the summer, maybe it’s a good time for our families to…meet.”\nSirius’ grey eyes blinked at James. “I…but you and I meant to…”\n“Well I reckoned you and Moony had changed those plans,” James said plainly, not meaning that at all because he knew it wasn’t true. But he was not letting Sirius get the best of him. He wasn’t the only one in this little arrangement determined to be more stubborn than Sirius was. “Anyway, I should chat with Regulus first. Since you didn’t give me a chance before arranging all…this.”\nWith that, James spun on his heel, marched to the Slytherin table where Regulus was watching, pink-cheeked, and held out his hand. “A word?”\nRegulus spluttered. “Erm…”\n“It’s important,” James said. When Regulus rose, James tugged him close and whispered in his ear, “Sorry about this, but I haven’t a choice. Unless you want to give this bet up now.”\nRegulus gave the most minute shake of his head, and then turned his head and brushed his lips over James’. There was a collective hush, but James ignored the all, and ignored the furious blush in his cheeks, as he dragged Regulus from the hall.\n*** \nIt was sorted. James was exhausted trying to manage classes—not sitting with his mates was enough to drive him a bit spare—and how he was going to handle his parents. They seemed...less than thrilled, but more confused than anything, and yet maybe not even that since he was James Potter and he didn’t do things ordinary or by halves.\nRegulus was furious when he’d learnt what Sirius had done, but in the end decided he’d rather endure taunts from his yearmates and well…all of Slytherin really, in order to get one over on Sirius. He even offered James more money, which James refused.\n“It’s my thick-headed mate that’s got us further in,” James said. “And at this point I’d take winning this over getting paid at all.”\nRegulus bit down on his thumbnail, watching a few first years pass by. “Will you tell me what the money’s for after?”\nJames licked his lips, then ruffled his hair. “I…suppose it can’t hurt. Not yet, mind, but…”\n“Curiosity is getting to me,” Regulus admitted, and James was struck, suddenly, with how sweet that sounded. So unlike the Regulus he’d known when he and Sirius had been at each other’s throats.\nJames shuffled his feet a bit. “Why’re you so determined to convince Sirius we’re a couple? I mean…surely there could have been someone more annoying than I am.”\n“Maybe Evans, but she’s far too into McKinnon now,” Regulus said with a wry grin. “And erm. It’s…” He stopped and looked away. James reacted without really thinking, closing his fingers round Regulus’ wrist and tugged at him. Regulus looked back, a bit pained. “It’s only just…he doesn’t think anyone like you would fancy someone like me.”\n“What…someone like me? What do you mean?” James asked.\nRegulus’ blush darkened. “You. Popular, attractive, good at nearly everything you do without even trying. So good it makes me want to hex things,” Regulus said through gritted teeth. He sighed after a second and relaxed. “And I’m just…you know. Me.”\nJames blinked. “I don’t…”\n“Please don’t play daft, Potter,” Regulus insisted. “You and I both know if you didn’t love winding Sirius up this much, you wouldn’t bother. I mean, you have loads of money, it’s not like you need it.”\nThat was true, yes. But the fact that Regulus thought so low of himself…\n“Lily wasn’t lying,” he said quickly. “When she said all those things about you. You’re someone who deserves to be fancied. Sirius knows it, too. He…cares. He wants you to be happy. Winding him up is just a…bonus.”\nRegulus stared for a second, then his face relaxed into a rare, genuine smile. “You’re an idiot.”\nJames laughed. “Yeah well…everyone knows that.” He dropped his hand from Regulus’ wrist, and ruffled his hair again. “So. Shall we do this?”\nRegulus shrugged. “Fake a big public relationship, then fake a big public split. Can’t be too hard, can it?”\n“No,” James said, grinning toothy at him. “I don’t think it’ll be that hard at all.”\nJames hadn’t intended on letting his mood get to him, and in all honesty he hadn’t been on the outs with Sirius like this since second year when they fought over who was going to cast the detonation spell on the fireworks they’d put in the Great Hall. But not having night time chats, not having Sirius crawling into his bed when Moony was too warm, or sharing glances in class…\nIt was a lot.\nJames and Sirius were nearly adults and he should be able to handle something like this.\nBut he wasn’t.\nHe stabbed at his eggs, feeling moody and irritated, pointedly not looking over where Sirius was also poking forcefully at his breakfast. It was not the state of mind James wanted to be in before their Quidditch match. He had exactly thirty minutes before he had to be on the pitch, his head in Captain space, and prepared to beat Slytherin.\nWhich, in hindsight, held its own set of problems considering Regulus was on the team and now that they were dating—at least according to the Student and Staff body, people were watching.\nIntently.\nHe sighed and reached for his tea when he heard Peter make a sort of strangled, squeaking noise. James glanced up, and his vision was suddenly full of green and silver Quidditch robes. He blinked, his mouth opened to say something, but the words died on his tongue when a calloused, warm hand fell on his cheek.\n“Erm.”\nRegulus gave a pointed look to Sirius who was trying not to look like he was watching. Then he leant down and dragged his lips, slow and easy, across James’. “I shouldn’t tell you good luck today but…good luck, James.”\n“Erm.” James blinked rapidly, and was stunned by Regulus’ smirk, and the way he moved in the robes, and the way he squared his shoulders as he walked out.\nThe hall doors slammed, and James was forced back into himself. He glanced over and saw the way Remus and Peter were smirking at him, and his blush rose so fast it made him dizzy. “Shut it.”\nRemus snickered. “We didn’t say anything, Prongs.”\nPeter smiled. “Yeah. But you know…good luck.”\n*** \nJames spun in a circle, his hands in his hair tugging almost frantically. He’d been dragged under the bleachers by one flustered Regulus Black, who looked equally as panicked. “They’re here. How…what…why. Why are they here?” Reaching out, he grabbed Regs by the front of his robes and shook him. “Why the bloody hell are they here?”\n“Your stupid best mate has done this,” Regulus spat, shoving James’ hand away. “This is his fault. And by proxy your fault. He would have been a decent, quiet Slytherin if it hadn’t been for you on the train.”\nJames rolled his eyes. “That is a lie and we both know it. And frankly you know I’ve been good for him. Your parents are terrible and…”\n“Can we not do this right now?” Regulus begged. “We have to go play a sodding quidditch match, and then pretend to be dating in front of our parents. Who, by the way, are probably trying to arrange our wedding.” He sighed, pinching the bridge of his nose. “Why was I cursed with this family? And you?”\n“Who owled whom, eh?” James asked moodily, kicking at Regulus’ shin. “And you could do a lot worse, Black.”\nRegulus looked up with a quirked brow. “Yeah. And you’d be fine chained to me the rest of your life, would you? Sharing a marital bed?”\nRegulus clearly meant it to be a dig, but James found the idea…well, rather tingly in his fingers and toes, and he couldn’t do more than flap his mouth open and shut in lieu of answer.\nRegulus rolled his eyes, clearly taking James’ lack of speech for disgust. “Exactly. So you’d better get better at convincing my brother that this is all very real so we’re not stuck actually getting married.”\n“You’d take it that far?” James croaked.\nRegulus raised his brows and crossed his arms over his head. “Try me.”\nThey didn’t have much time to row longer. They were being summoned to the pitch, and James had to get his head out of this mess, and in the match. It would not do to lose in front of the whole school—and his parents—and Black’s parents—all the while pretending to fancy him and date him.\nPretending.\nHe was…pretending.\nHe sighed, and glowered at his team who looked on the verge of taking the piss, and he shouted at them to get ready. He adjusted his googles, gripped his broom, and when the whistle blew, he took off.\n*** \nGryffindor had been favoured to win, and by a stroke of luck and James’ sheer determination, they had. Not to mention Slytherin was working with their reserve Keeper who was only alright. Regulus had missed the snitch by a centimetre, and the whole stadium erupted in cheers as Gryffindor bowled each other over and hugged as the rest of their house stormed the pitch.\nJames caught a glance of Regulus heading off in a sulk with the rest of his team, and he caught a glimpse of the unimpressed faces of Walburga and Orion who were giving a polite golf-clap as the Potters roared and cheered. James had to laugh at that, and even nudged Sirius and nodded at his parents.\nSirius, who was still not thrilled with James, managed a smug grin anyway, and even clapped James on the back.\nIt was the most he’d get for the rest of the evening.\nLunch was tense. James, Regulus, Sirius, the Potters and the Blacks were offered private dining from Dumbledore, and they sat in a pointed silence as they all poked at their food. The House Elves had outdone themselves, with various curries, and several tagine filled with couscous, lamb, chicken, and veg.\nJames was scooping rice, aloo, and saag paneer onto his plate, ignoring the tension, but he glanced up at his father who was grinning over his goblet of pumpkin juice.\n“Good game there, Jamie,” Fleamont said, breaking the silence.\nSirius choked on a swallow of his drink as Walburga’s face managed to go even more sour.\n“Thanks,” James said, and cleared his throat. “It erm…was pretty close.”\n“It was embarrassing,” Walburga snapped, her eyes narrow on Regulus. “Honestly the money we’ve put into your training and team…”\n“I can’t win them all,” Regulus said in a small voice.\n“Well I expect better than that. It’s really no wonder we don’t bother to show up for more of these. Then again I suppose you’ve had your head…” She glanced over at James with a sneer. “Elsewhere.”\n“Well,” Effie said with a polite smile, “we’re happy if they’re happy.”\n“Right,” Walburga said with a sigh. “I suppose it could be worse. We had Potter here pegged as a muggle-lover, and didn’t expect he’d have eyes for any proper wizard. We’d hoped for a better match for Regulus, but seeing how he is, it’s really the best we can hope for.”\nJames watched Regulus’ cheeks darken, his brow furrow, his shoulders hunch, and he felt his fingers tingle, itching to reach for his wand and test out a few of the new curses he and the boys had been working on. But of course he knew that would go over as well as a Niffler inside Gringotts, so he let out a breath, and stretched his leg under the table until it curled round Regulus’ ankle.\nRegulus startled, but glanced up and gave James an appreciative nod.\n“Honestly, can you save the heavy petting for later?” Walburga snapped. “It’s bad enough I’m eating…this, surrounded by the smell of half-bloods. But I must watch the two of you paw at each other as well?”\n“I’ve lost my appetite. May I be excused?” Sirius blurted.\n“No,” Walburga snapped. “I’ve a thing or two to talk to you about. Heard you’ve been consorting with muggle-borns, and I swear you couldn’t sink any lower, but here we are.”\nJames could see the way his parents bristled, the way his father sucked in a breath to say something. He begged silently with his eyes for them to let it go. It would only be worse for Sirius and Regulus if they caused a scene. It ate him up inside, but there it was.\n“Did you see Sirius had top marks last term?” James said. “In both Charms and Transfigurations.”\n“Mm,” Walburga said.\n“We were very proud,” Fleamont cut in. “Very proud indeed. He’s got a bright future ahead of him. Both these boys do.”\nJames watched a pleased flush mirror each other on the brothers’ faces, and it lasted until Walburga let out a small laugh. “Yes. We shall see. Won’t we. I’m suppose I’m glad someone in the world has faith in these two, because they certainly haven’t earnt it in this home.”\nThe mood deflated, and all James could do was keep his foot pressed where it was, and move a little closer to Sirius, to remind them both whatever their mother said, it wasn’t what the rest of the world believed.\n*** \nJames slipped out from under the cloak, glancing down at the map in his hands before stuffing it into his pocket, and slipping through the stable doors. The Thestrals and other creatures Hagrid minded were either sleeping, or out to graze, and the only thing breathing besides James was the small, robe-covered lump curled up at the tall window.\nJames hefted himself up into the massive sill, and edged over until his knee pressed into Regulus’. “Do you want to talk about it?”\n“Considering I came out here to be away from people,” Regulus snapped, then sighed and shrugged, moving the hood back from his face. He looked tired, face drawn, mouth in a straight line. “Today was ridiculous. I don’t…I don’t know why I thought this was a good idea at all.”\n“Well I can’t pretend like I know why you blurted out that you and I were dating. Or why you wanted to upset your parents when you never have before…”\n“Because I never have,” Regulus blurted out. “Sirius ran away!”\n“Well…he went back,” James said, and closed his eyes against the stinging memory of Sirius packing up his things and going back to a house he knew would crush him. But he also understood why he’d done it. The reason was sat there, next to him, and he didn’t think Regulus had any idea.\n“He came back because he’s braver than I am,” Regulus admitted after a moment of silence. James blinked at him, startled. “He…he got a bit pissed the night my parents finally let him out of his room and…he told me. It was stupid. I dunno why he was so worried about me. I could have handled it.”\n“Is that why all this happened?” James asked. He hesitated, but then reached over and offered out his hand. He’d always been a tactile sort of person, and it bothered him not being allowed to give comfort in that way, even if he and Regulus weren’t exactly friends. And even if thinking about it did funny things to his insides.\nRegulus stared down at him for a minute, then sighed and let his palm slide against James’. He didn’t put up any resistance when James tugged him over, and into a firm embrace. Regulus grumbled, but let the side of his face rest against James’ chest.\n“Is this what you force Sirius to put up with?” he groused.\nJames laughed, brushing his hand along Regulus’ hair. “Yes. Awful torture, you know. Being comforted and loved.” The words died on his tongue, and he felt Regulus stiffen, but still he didn’t pull away. “Anyway I…I’m sorry your parents are rubbish.”\nRegulus let out a shaking sigh, his eyes drifting closed. “My dad isn’t so bad. Or well…he is, I guess. I reckon no one knows if he’d be better or worse without my hag of a mother always speaking for the pair of them. I asked Andromeda once, what mother and father were like.”\n“What did she say?” James asked softly, still stroking along Regulus’ hair, down his back.\n“She didn’t know. Their marriage had been arranged since they were little, and they were married before she was born.” He let out a breath, shaking slightly, and he shrugged. “There was a part of me that thought if I made them proud—maybe proud enough for the both of us, me and Sirius—they’d…be better? Like maybe they were just waiting for one of us to live up to their expectations. But…every time I think I’ve got it, they just…pile on more.”\n“Moving target,” James murmured. He tucked Regulus in close.\n“Yeah. Moving target. I think that’s…that’s why I owled you. I realised I’d spent my entire life living up to a moving target, and I’d never get there. It was too late for me to be like Sirius. I’m already in Slytherin, already a prefect, my marks are good, I’m a top Seeker. So I did the only thing I could think of…”\n“Started fake-shagging a blood-traitor,” James said.\nRegulus tensed, then lifted his head and he looked at James with the most sincerity James had ever seen on his face. “You know I…I don’t actually think that, right? That you’re…that anyone’s a blood traitor.” He licked his lips, then leant in and said, “We’ve got squibs in our family, you know. Not that you’d ever find out. Their records have been erased. But I heard mother and father talking about a cousin who lives in America doing some sort of… muggle celebrity thing. Singing, maybe? Dunno, but they sounded like maybe they were happy and I was pretty little when I heard it but it sort of…made me think.” He paused and then said, “And I really like Evans. She’s pretty and clever.”\nJames chuckled. “She’s taken you know.”\nRegulus pinked, and he shoved at James’ shoulder. “I don’t…I don’t fancy her.” He hesitated, then breathed out and said, “I don’t fancy any girls.”\nJames nudged him back, smiling as he swung his legs over the ledge. “I sort of figured that out. Being that you chose me for your little prank.” He glanced down and realised that their hands were still tangled together, and he gave Regulus’ a squeeze. “For the record, I’m glad you picked me. And for the record, if you want to leave, you’re just as welcome at mine as Sirius ever was. You’re not going to be alone.”\n“Even if she disinherits me?” Regulus asked, his voice small.\nJames touched his chin, drawing his gaze back up. “I’m rich. Like…absurdly rich. Enough for several people to inherit a small fortune. I think I can handle it. And besides, you’re clever enough, whatever you want to do after school—you’re going to be great at it.” James paused, then let go of Regulus and pushed himself up. “And I meant it. You’ll never be alone. Not if you don’t want to be.”\n“And even when I do,” Regulus pointed out.\nJames laughed and hopped off the sill, reaching for his cloak and the map to check if the coast was clear. “I reckon so. But I’ll go now. Leave you to your thoughts. You just erm…you just let me know what you want to do.”\nThere was silence, and just before James reached the door he heard Regulus call out, “I don’t think Sirius quite believes us yet. I think we’d better dial it up a bit.”\nJames grinned, and waved, and turned before Regulus could notice the open desire on his face.\nJames woke to the faint smell of cigarette smoke, and he rolled over onto his side, eyes fixed at the window where he could see the silhouette of Sirius leant against the stone wall. The faint glow of the cherry, and the white of the smoke against the dark sky was a familiar sight, but it had been a while since Sirius stayed up at night.\nRemus was in hospital, his aches this close to the moon too much for him to bear, and he’d needed a pain potion to sleep. Sirius had walked him there and back, and hadn’t said much to James since the visit with his parents. James worried—he always worried when it came to the weight Sirius had to bear living in that house, but their relationship was strained.\nIt was his own fault—he knew that. He could solve the problem by just confessing, but he just had to hang on a little longer. He wasn’t going to last, he knew that. His feelings for Regulus were becoming a bit more complicated than he’d anticipated, and he wasn’t sure where to put them, really. For now, stuffing them into a tiny box, in the corner of his mind, was good enough.\nFor now, swinging his feet onto the cold stone floor and shuffling to the window was all he focused on.\nSirius made a disgruntled noise when James hopped up next to him. It was reminiscent of the other night, when James had comforted Regulus in the stables. Only this was more familiar—more comfortable. This was what James had been doing the last seven years, and likely would dedicate the rest of his life to, so long as Sirius needed him.\nHe nudged his friend, and Sirius rolled his eyes, glancing away.\n“Moony fall asleep alright?”\n“Right as he can be. Not that you care much these days,” Sirius bit.\nJames raised a brow at him. “Moony and I are getting on fine, thanks. It’s you who doesn’t seem to want to accept the situation.”\n“Situation,” Sirius said, his voice in a bit of a sneer. “Is that what it is?”\nJames sighed. “I don’t know what you want from me.”\n“The truth.” Sirius sucked one last drag from the cigarette, and let it tumble down the tower, smearing bits of burning ash on the way down. “You’ve never lied to me before.”\nJames’ insides twisted and he reminded himself this was a good thing. Sirius would forgive him. “I like your brother.” That wasn’t a lie. It was a bit of something he didn’t want to unpack right then, but it was the truth. “I think he deserves better. Just like you.”\nSirius rolled his eyes up as he let his head fall against the stone. “I’m getting nothing, you know? I mean…I won’t have nothing. I’ll get a job and have a flat and…and it’ll be whatever. But I went back for Regs. I knew they’d cut me out of the will and I don’t…bloody hell I don’t actually care. But he doesn’t care, either. He’s happy to let them shit on me, and whittle him down to nothing, all for what? A vault full of galleons and cursed, dark objects?”\nJames sighed, then pulled Sirius into his arms. Sirius resisted in the way he did when he wanted comfort, but didn’t want to sacrifice his pride. James kept his hold on him, but went lax until Sirius gave up and climbed into the embrace. “I think you should talk to Regulus. I think…he doesn’t want any of that, either.”\n“S’that what he told you? He hoping to marry into the Potter fortune so he doesn’t feel so shite when our parents decide to cut us both off and give everything away to some House Elf oppression league.”\nJames sighed, brushing his fingers through Sirius’ hair. “I don’t think he much cares about the money. I think…I think he wants to feel safe. Like he’s got somewhere to go. It just took him a little longer than you.”\n“He’s soft,” Sirius complained.\n“He’s stronger than you give him credit for,” James said. When Sirius stiffened, James cupped his chin and drew his gaze up. “I love you. You are the most important person in my life, and that will never change. Understand? I don’t care what happens between us, or how furious you are at me for whatever ridiculous thing I’ve done. Whatever I feel for Regulus, that’s not going to change this. Just like when you fell in love with Moony. Nothing’s different.”\nSirius licked his lips. “Did you tell him?”\nWith a frown, James leant back a little. “About what?”\n“Moony. You love him so much, I assumed you’d…”\n“If you think I’d betray our most precious secret to anyone…that I’d tell anyone without Remus telling me it was alright…” James couldn’t hide the sting in his voice, and he watched as Sirius’ eyes filled with regret.\n“I didn’t mean…”\n“Yes, you did,” James said. He sighed, and drew Sirius close again. He expected it. He understood why Sirius didn’t trust anyone, why he was looking to always be betrayed. When you had parents like his—parents who were supposed to love you and care for you unconditionally, and never did—it was bound to happen. “It’s alright. I didn’t tell him. I won’t.”\nSirius said nothing, apart from a small humming noise, and he sagged into James’ arms.\nIt wasn’t better, but James had bought some time, at least.\n*** \n“Why do you look like your pet goldfish has just died?”\nJames glanced up at Evans who was wearing a tiny smirk, and he sighed. “I’ve never had a goldfish.”\nShe laughed. “Right. Your parents probably bought you a Unicorn or something, didn’t they?”\nJames kicked at her, which she laughed as she dodged. “Shut up, Evans. You’ve met my parents. I…might have been spoilt, but they’re not ridiculous.”\nShe laughed again, but sighed fondly. “It was almost worth dating you just to keep them around. But your mum still writes me every week so I guess I won custody of them after all.”\nJames couldn’t help his own laugh. “She wanted a dozen children, and when she could only have me, she counted on me being so charming I could pick up strays.” He bit his lip. “Not that erm…that you’re…a stray or anything. I mean…they just like my friends and…”\n“Calm down, boyo,” Lily said, nudging him. “You haven’t been this ridiculous with your mouth since I agreed to go on a date with you. What’s going on?”\nJames didn’t say anything straight away. They continued their patrol, then started for the doors to begin their rounds of the courtyard. Stepping into the night air, James glanced up at the moon, a day away from being full. A day away from when they’d sneak out and meet Moony, and run the forest.\n“I like Regulus,” he finally said.\nLily snorted. “S’good, isn’t it? That you fancy the person you’re dating. We sort of learnt the hard way about dating when you don’t.”\nJames’ cheeks heated up, and he dragged a hand through his hair. “Well. Alright, so you obviously know that this is all…”\n“A prank?” she offered. “Which makes no sense, of course. Why you’d want to torment Sirius like that is beyond me.”\nJames felt tired, suddenly, weighed down, and he sagged against the wall. After a moment of hesitation, Lily did the same, and nudged him with her knee. Ruffling his hair, James leant his head back and said, “His parents cut him off. Even after he went back, they cut him off. And with Remus being…sick,” he said.\nLily rolled her eyes. “I won’t make you say it, but you do know I’ve known for about three years, right?”\nJames wanted to be surprised, but it was Lily so… “Well anyway, getting a job for him is going to be dreadful. And Sirius won’t take anything from my parents so I figured, if I could get some money, then lose it to him in a bet…”\n“So you are going to lose the bet?” she asked.\nJames sighed. “Yeah. I haven’t told Regs yet, but yeah. And then Sirius will have a sack of galleons for him and Remus to…you know. Get started.”\n“You were counting on him to want whatever it was you had in your trunk,” Lily said. Then she laughed. “Clever you, Potter. How long had you been working on that one?”\nJames shrugged. “Since fifth year. When I was doing tutoring sessions for a sickle each? I’d let Sirius see me fuss with the sack, but I asked him to leave it when he’d try and snoop. He tried to break in a few times, but he couldn’t get past my spells.”\n“And the dating thing?” she asked.\nJames shrugged. “Well that just ended up being convenient. I never expected Regulus would ask me that. But I had to take the chance.”\n“Even if it meant torturing yourself with this crush.”\nRolling his eyes at her, he sighed. “Well it’s not as if I realised it at first. I thought it would be something fun to play at. But turns out…you were right. He’s rather…my type.”\nShe sighed, giving him a pat on the arm. “I know you better than you know yourself, you stupid sod. But for what it’s worth, I think he fancies you back. The two of you just need to talk it out.”\nJames laughed, the sound a little hollow and a little bitter. “He’s…well I’m not sure he does. Or that he’d go for it, in the end. I know I can be a bit overwhelming, and I’m not sure he wants to put up with that.”\n“James,” Lily said quietly, then pushed to her feet and offered him her hand. When he took it, she straightened the front of his robes and met his gaze firmly. “Your love is a lot. Bloody hell, just your crushes are a lot. But when it’s the right person, it won’t be. It’ll be just enough. Maybe you should actually talk to him, hmm? Tell him how you feel?”\n“Seems like that would be a bit too logical, Lils,” James said, but he was smiling, and at the very least, feeling a little better.\n*** \nHe didn’t speak with Regulus. Not straight away. \nThe moon ended up being rough on Moony, and consequently rough on James, Sirius, and Peter who walked away a little worse for the wear having spent the night trying to keep Moony from tearing himself up, and tearing into Hogsmeade.\nJames found himself with a slight limp, and heavy bags under his eyes the next afternoon. It was Saturday, which meant his morning patrol was taken by Lily, and he did a cursory afternoon round of the grounds.\nAs he passed by the willows, his legs decided it was as good a time as any to give way, and he collapsed against the trunk of a shady tree. Wrapping his robes close round him, he let the soft ground soothe the ache in his bones, and his eyes shut.\nHe wasn’t sure how much time had passed, but he startled when a warm hand touched his cheek, and his eyes flew open. “Wazzit? Wasn’t sleeping…just…resting…” His words died off when he found himself staring into grey eyes. “Erm. Regulus?”\nRegulus’ lips were twisted into a smirk. “You look like shit, you know.”\n“Cheers,” James deadpanned.\nRegulus huffed a laugh, then to James’ great surprise, settled back in the grass and pushed his head against James’ shoulder. “People were telling me I ought to take better care of my boyfriend. Said you were walking with a limp and looked like you hadn’t slept in days.”\nJames sighed, scrubbing his eyes with the heels of his palms. “Rough night.”\n“Pranks?” Regulus asked. “What fresh hell can we expect to be unleashed today?”\n“Not a prank. Just…Remus had a rough night. He’s in hospital now, but we were…dealing with it for hours. And I’m just a bit knackered.”\nRegulus hummed, then rolled onto his side and tucked closer to James. “So have a kip here then? Is that what we’re doing?”\nJames opened his mouth to argue, but frankly the body next to him felt too nice, too warm and soothing. So he did the next best thing to arguing—he pulled Regs as close as he could, nuzzled his nose into his hair, and closed his eyes.\nHe’d have to tell him sometime. How he’d always planned to lose the bet—and why. And how it was tearing him up inside because he wanted nothing more than to actually call Regulus his boyfriend. To take Regulus’ face between his hands and kiss him soft and slow, and pour every ounce of love into the gesture. To maybe give Regulus a little peace, moments of safety where the darkness of his family couldn’t touch him.\nHe wondered if Lily was right—if maybe he wasn’t always overwhelming. Not if it was the right person.\nSo yeah. He’d have to bring it up eventually.\nBut right now, with Regulus warm and comfortable in his arms, James chose that moment to be selfish. To lose himself in the pretend. To forget that this was nothing more than a prank.\nJames was certain he’d be able to drag it out until the end of the quarter, maybe even the end of the year if Regulus would be game, if things would stay uncomplicated. Only things were never uncomplicated.\nWalking into the dorm room after Quidditch, James didn’t expect to find Sirius sat at the foot of Moony’s bed, the curtains drawn shut, a spell humming quietly round them. There was a tension in the room that wasn’t there when he’d left, and Peter was mysteriously missing.\nWith a small sigh, James lowered himself, crossing his legs and pushing close so his knees brushed against Sirius’. “What happened?”\nSirius didn’t answer, but thrust a crumpled bit of parchment at James which smelt of owl post. He unfolded it, and though his eyes read over the writing, he was having trouble comprehending it. “What…”\n“The Anti-Werewolf legislation passed, by a landslide,” Sirius said, his voice hoarse, devoid of emotion. “Registration has become mandatory, and registered wolves are prohibited from holding any jobs in public service, public office, transport, or anything relating to the Ministry. They’re to transform at pre-determined locations, and will not be covered under the Ministry health care.”\nJames’ hand were shaking before he realised it, curling into parchment, making it bow under his rage and sweat. “What…”\n“I thought,” Sirius said, and his voice broke, making him stop to clear his throat. “Moony said he’d be fine. Said he’d be fine, then he spelled himself behind his curtains and hasn’t come out since. His status is still unknown, but it probably won’t be long before someone figures it out. I mean, we’re not that clever.”\n“We’re clever enough,” James said fiercely.\nSirius looked up, his dark eyes furious and terrified. “It’ll be on me, you know. Because he won’t be able to work. It’ll take a month, maybe two, before anyone connects Moony’s absences with the moon. So it’ll be on me to do well, and I could have…I could have made it work, but I was such a stupid fucking prat, and had to go and piss off my parents and now I have nothing and what…what am I going to…what do I do?” Sirius’ eyes were wide, full of tears, wild as his voice broke and a few tears slipped down his cheeks. “Prongs,” he whispered.\nJames gathered him close, holding Sirius to his chest, kissing the top of his head. “It’ll be fine. You’ve got us, you know. Me, Peter, Lils and Marls. Regulus, even…”\n“Don’t,” Sirius bit. “Because you don’t know him. He’ll run off and tell my parents just to get back into their good graces and…”\n“I know you don’t believe me, but he won’t. He’s not…he’s not like that, Pads. He hasn’t been for so long.” James squeezed his eyes shut and let his fingers brush through Sirius’ hair. “I won’t tell him, but he won’t rat you out. And…Si…you’ve got me. You’ve got mum and dad and they’ll do anything they can. Everything,” James said.\nSirius pulled his head away. “I can’t ask them to take us on like that. I won’t. I’m not afraid to hold up the money side of things. I just need to get started, you know, and I’ll…figure it out. I can sell my broom, sell whatever I have left from my bedroom and it’ll be enough.”\nJames said nothing, in spite of knowing his solution was sat under a bed, waiting for Sirius to take it. And he’d have to, in the end. Because he’d win it, and it was enough to set them up for a little while, and he’d feel less bad when he realised none of it had been charity. James had earnt it all, and half of it was from Regulus.\nIt wasn’t going to make them millionaires, but it was enough that they’d be alright for meals and rent, and whatever else. Until Sirius could get started. And James wouldn’t rob Sirius of his pride. And he wouldn’t do it to Remus, either.\n“We’ll figure it out,” James vowed.\n“Just don’t leave us, alright?” Sirius said, his voice quiet. “Whatever the bloody hell you’ve got with Regs, just…don’t leave us.”\n“Never,” James swore. And he realised then it was time to call it an end.\n*** \n Map in hand, James managed to sneak out after doing rounds, and it wasn’t long until he was waiting near the lake, under the cover of his cloak as Regulus was on his way. James had sent a note through the fire, and had watched Regulus on the map as he got it, likely made excuses, then slipped away.\nHis heart was beating in his chest, anxiety thrumming through his veins because he didn’t want to do this. He didn’t want it to end now, to lose the excuse he had to touch Regulus, to pretend like all of this was more than it was. But Remus and Sirius were too important to him, and ending this meant that they would be less afraid, and less lost as the year raced toward its end.\nJames pulled the cloak off when he saw Regulus was outside, and he leant against the tree as he watched the dark form hurrying along the bank of the lake until he spotted James. Regulus’ cheeks were slightly pink, the darker colour visible under the light of the moon just past full, and James ached to reach out and press the tips of his fingers to the heat there.\n“What’s so important it couldn’t wait until breakfast?” Regulus demanded, his voice slightly hoarse, and just out of breath.\nJames bit his lip, then shrugged helpessly. “It’s…time. To end this.”\nRegulus blinked at him. “What? Why? Potter…if you’ve gone and done something stupid…”\n“I,” James said, and faltered. He couldn’t tell Regulus why, or what he was up to, but he needed him to be willing.\n“Sirius doesn’t believe us yet, and if you think I’m letting him get away with being such a prat…”\n“Lily wants to rekindle things,” James blurted, hating himself for that being the first thing he thought of, but he didn’t think it would really matter in the end. Regulus didn’t actually fancy him, but he was fond of Lily so if he thought it was for Lily, he might be willing. “She told me…she’s unsure about Marlene and well…I still love her so…” The lie fell from his lips like he was speaking through treacle, but he got the words out in spite of himself.\nHe watched as Regulus took a step back, something crossing his face that James couldn’t read. Hurt, his mind supplied, but then he laughed at himself, because that would make no sense. “I see,” Regulus finally replied.\nJames swallowed thickly. “I don’t…want to lie to her, or lead her on. So…I mean I know it’s not great to lose the bet but…”\n“Why not just stage a split, then?” Regulus asked, crossing his arms. “Why let my brother have the victory?”\n“Because I…” James floundered for a good reason without giving it away. He came up blank, and felt his heart sink. “Regulus…if I told you it was important, and that I needed you to trust me…”\n“You’ve never given me reason to,” Regulus spat, now sounding angry. “Why should I do this now?”\nJames stepped back, feeling like he’d been slapped. “Haven’t I? I’ve kept your secret, not told anyone about it, have gone this far. I can’t tell you why, but I can tell you it’s a very good reason and I need…” James’ voice fell into begging, unable to hide his emotions, “I just need Sirius to know it was a prank.”\nRegulus stared at him a long time, his stormy eyes narrow and angry, but James could see he was relenting. He could see it in the way the tension in his jaw eased, and something else, a raw, unreadable emotion, flickering across his face. “You owe me. If we do this, you owe me.”\nJames nodded, breathing out in a rush. “Anything, I swear. Whatever you want.”\n“I don’t…there’s nothing I want from you,” he said, sounding even angrier somehow. “Not now, but if I do…in the future…”\n“I will always be there for you,” James vowed, meaning every word. “I don’t care what it is, I swear. I’ll…anything you need. Any time.”\nRegulus gave a stiff nod. “Alright. Then how do we do it?”\nJames worried his bottom lip, then said, “I think I have a way. There’s just a few things we need to do, and we need to get to the owlry.”\nRegulus sighed, rubbing a hand down his face. When he looked back up at James, there was defeat in his eyes, and sadness, but also resolution. “Fine. Let’s get going. I’d like to put this whole mess behind me, and forget we ever met.”\n*** \nJames didn’t know why he felt the ache of heartbreak as he curled into himself on a sofa in the common room. His eyes were roving over his texts, but he wasn’t paying much attention to the words. He was waiting on edge, for Sirius to find the evidence, to come down here and confront him, level the accusation, and wait for James to confess.\nIt had all been a prank.\nAnd it was true, it was. However James had set it up, the whole thing had been a farce. So why did it feel like he was losing something?\n“Potter.”\nJames’ head turned to the side, and he saw Lily walking into the room, her hair twisted into a plait, hanging over her shoulder. She sat primly, her bare feet crossed at the ankles, one arm slung along the back of the sofa.\n“Evans. Bored, are we?”\nShe rolled her eyes. “Care to tell me why your boyfriend was glaring daggers at me this morning? I had to check all my food for hexes.”\nJames’ eyebrows shot up. “I think it’s…for show. We erm. We split up.”\n“Split up like…”\n“Like this whole mess is over, and Sirius is going to work it out in about twenty minutes, I rec, and…and it’s done.”\n“And he was glaring at me because…”\n“Because…because I told him we had to end it.” Her look was unimpressed, so he sighed and said, “I might have told him it was because you were considering working things out with me, and I was still in love with you.”\nShe burst out with a giggle, covering it with the back of her hand. “Why the bloody hell would you say a thing like that? I don’t want you…”\n“Thanks,” James said dryly.\n“And I’ll eat Merlin’s thousand year old pants if you still love me,” she added.\n“And disgusting,” James finished. When it was clear Lily had no intention of giving up until he gave her an answer, he decided honest was his best option, and would probably feel the nicest since he’d been sort of living about a hundred lies over the past few weeks. “I needed Sirius to win the bet, and Regulus wouldn’t give the game up if I didn’t have a good reason.”\n“And telling him why Sirius needed to win the bet wasn’t good reason?” she pushed.\nJames scrubbed a hand down his face. “Might have been, but it also might have meant Regulus would have tried to get involved and Sirius would have never forgiven me. And right now, with everything else…”\n“Merlin, James, what have you got yourself into?” Lily demanded.\nJames threw his hands up. “It isn’t me, Lils. If Remus and Sirius weren’t such bloody, fucking full of pride, this wouldn’t even be an issue!”\nHer face fell. “It’s that registry thing the Ministry just passed, isn’t it?”\nJames swallowed against a lump in his throat. “Something like that, yeah. I’m just trying to help. I want…I want to help get them started but you know how they are. So this was the only way.”\nShe reached across the distance between them and squeezed his thigh. “You’re a good friend, James. A really good friend. They’ll get their heads out of their arses and let you help eventually.”\nHe rolled his eyes. “Not bloody likely, but I can hope. Either way, it’s done. Regulus agreed to…everything and it’s…done.”\n“So why do you look like someone killed your pet Kneazle?”\nJames shrugged. “Dunno. Just feels a bit shit, is all.”\n“Because you fancy him.” He spluttered as she stood, straightening her robes, and she gave him a firm pat on the cheek. “Telling him will solve all that nonsense, you know. Swap rounds with me tonight. Because it seems like those two idiots aren’t the only ones who need to get their heads out of their arses.”\nJames might have argued, but just then Sirius came tromping down the stairs, crowing victory.\n*** \n“I knew it. I bloody knew it.”\nPeter sighed into his stew, spinning chunks of potato round with his spoon. “Yes. You’ve only said about five hundred times since you found the letters.”\n“And how stupid were they to just leave them lying about where I could find them,” Sirius declared.\nRemus’ eyes narrowed on James, and James ducked his head because they all knew the truth. James wasn’t stupid enough to just leave evidence lying about where Sirius could find it. But at the moment, Sirius needed a victory so badly, he needed the win, and he was going to soak in it for ages.\n“Yes well, that’s me. Giant idiot,” James said. He tried not to look behind him, across the hall at the Slytherin table where he knew Regulus was sat, probably not looking at him at all. “I’m full, and I’ve got rounds in a bit. See you gents later.”\n“With my prize!” Sirius shouted after him.\nJames gave a mock salute. “With your prize.”\n“Sounds ominous,” Remus muttered, which was the last thing James heard before hurrying out of earshot.\nJames hadn’t entirely decided—at least not out loud—that he was going to swap with Lily, but as he rounded the corner to Gryffindor Tower, he realised it wasn’t even a decision he had to make. Yes, he had to end the bet so he could get this over with and give Sirius and Remus the damn money, but he was also feeling emptiness in his gut, worse than when he thought Lily hated him. And he’d never been the sort to not do something about it.\nSo why hesitate because it was Regulus?\nHe checked his watch and saw he’d have to meet Regulus just after dinner, which would give him the exact amount of time he’d need to get everything set up for Sirius, and deal with any potential fall-out, as he was sure Sirius wasn’t going to love what was in the bag.\nBut…\nHe’d take it. Because he’d won it fair and square.\nJames was sat on his bed, the bag in his lap when Sirius came bursting through the door. He was alone, which was a relief for James, and he stood there with his hands on his hips.\n“Let’s see it, then. Whatever thing you thought you could be crafty in hiding from me.”\nJames hesitated, then handed it out. Sirius seemed perplexed by the weight, and slightly hesitant to put his hand in the bag seeing as it was James, and there was no telling what might be in it, or spelled on it. But he turned to his bed, and dumped out the contents.\nThe coins made a rushing sound, the bag having been charmed, so there was more than expected. James watched as Sirius’ eyes widened, his jaw tensed, his hands curling into fists. “You…did this on purpose,” Sirius said. “Where did this come from?”\nJames swallowed thickly. “When you ah…when you left,” he said. “I knew your parents wouldn’t be giving you anything, that it was done. For you. So I started tutoring and doing…odd jobs here and there. Winning bets. None of it’s from my parents,” he said.\nSirius turned, his face unreadable. “And you think I’ll just take it?”\n“You won it,” James pointed out.\n“You tricked me!” Sirius howled, throwing the now-empty bag at James’ face. “I’m not some…you can’t just…”\nJames was on his feet, gathering Sirius to his chest. “Shut up, Padfoot,” he growled, and for the first time, Sirius listened to him. His jaw snapped shut, and he sagged in James’ embrace. “I love you, and we both know you’re a bit of an idiot. But you won the fucking bet, you were right, it was all rubbish and…you’re going to take the money and get you and Moons a decent fucking flat, and start work and be…and be fine. Do you hear me?”\nSirius sniffed once, twice, then nodded. “You’re a bigger idiot than I am, Prongs.”\nJames pulled back, lifting a brow. “Oh yeah?”\n“Yeah,” Sirius said. “He was staring at you all through dinner, like I’ve never seen him. Whatever you’ve had with him…it wasn’t fake. Not on his end.”\nJames let out a small laugh. “Yeah well…wasn’t on mine, either. But…”\n“But nothing. Go fix it, you stupid prat. If you really want me to take this money…”\n“You’ll take it regardless, Pads,” James insisted, shoving Sirius away from him. “Marauder bylaws. Can’t be broken, not even by you.”\n“I hate you a lot,” Sirius said.\nJames laughed, then leant forward and pressed a kiss to the centre of Sirius’ forehead. “Yeah, but you love me a lot too. I’ll…see you later.”\n“Good luck,” Sirius called, and maybe said a few other things, but James had stopped listening. He was running, gasping for breath, hurrying to right the one, massive wrong he’d done during this whole thing. Because whether or not Regulus accepted him, he wouldn’t be leaving these halls without Regulus knowing exactly how he felt.\n*** \nRegulus was always quite good at hiding his feelings, but tonight felt like torture. Rounds with Evans, which meant he’d be staring at her, trying to play nice, knowing that she got the boy. She had won, in a game he hadn’t even meant to play, and no one would expect him to be hurt. He wasn’t supposed to have caught feelings.\nAll of this was…so wrong.\nAs he approached the corridor where she’d be waiting, Regulus panicked, turned, and fled. His feet tapped along the stone, taking him out the doors and to the paddock where he couldn’t be found. He’d be in trouble, possibly lose his badge for it, but what did he care. It wasn’t something he’d wanted, and regardless of his accomplishments, his parents would never see him as being good enough.\nHe collapsed round the back of the stables, his back pressed to the wood, his forehead against his knees as he curled into himself. Taking a breath, he felt it come out in a shaking gasp, and he hated himself for it. Why? Why did he have to be like this, why couldn’t he just…be like his brother, carefree and brave and…\n“Regulus.”\nHis head snapped up, and for a moment he thought maybe he wanted so much, he dreamt it. Maybe his mind—which was clearly working against him—had conjured the image of James Potter with his stupid smirk and his stupid cloak, and his terrible hair, and his bright eyes behind those dumb glasses.\nExcept James was there. He was kneeling next to Regulus, and Regulus could feel the heat coming off him as he sat close, not quite touching, but nearly.\n“Why are you out here. We had rounds.”\nRegulus blinked at him, his tongue feeling too thick for his mouth as he tried to force words out. “I had…” he cleared his throat. “I had rounds with Evans.”\n“She swapped me,” James said simply.\nRegulus blinked again, doe-eyed and owlish. “Why?”\n“Because she told me I needed a chance to tell you what a fucking idiot I was.”\nRegulus couldn’t help the laugh that burst out of him, punched like a blow to the gut, and too loud in the quiet evening. “You didn’t need rounds with me for me to know that, Potter. I’ve known that since first year.”\nJames’ smile was soft, fond even, and was making Regulus reconsider everything he’d ever known. Making him reconsider feeling the longing, and pining, and pain so he could take James up on the offer to stay with him, even if it would feel like walking on broken glass every morning to be with a man he couldn’t have.\n“Well, of course you knew,” James said. “I mean, you are the cleverest one of us all.” He reached out then, his fingers long, a little crooked at the top knuckles, but they were soft and sweet as they brushed back a lock of Regulus’ fringe. He didn’t pull back. Instead he let his hand linger, curling into a fist, brushing the backs of his knuckles down Regulus’ cheek, over the cut of his jaw, stealing any chance of breath he had.\n“Potter,” he managed.\nJames shook his head. “I should have said before, but I needed…it was important I do things the way I did them. It was for Sirius and Remus, and I love them more than anything.”\nRegulus’ laugh was bitter and wet, and he shook his head, pulling back away from James’ touch. “Yeah, I knew that already.”\nJames shifted closer, and Regulus bit back the urge to hex him. “You don’t understand. I…I should have said, because you would have probably understood and I was a bloody fool for not just trusting you. Because I know you care about your brother…”\n“Of course I do,” Regulus snapped.\n“But I wasn’t really…thinking. Which of course everyone agrees is my biggest flaw, but I can only hope I’ll make up for it with this. Assuming…I’m not wrong.”\n“About what?” Regulus said, but his voice faded to a whisper as James’ fist uncurled, and pressed warm and here against Regulus’ cheek. It moved down, two fingers and a thumb pinching his chin, turning his face up. “Potter,” he breathed.\nJames’ lips curled into a soft grin. “In case I’m not being obvious—which I’m not sure is possible for me—I’m going to…well I’d like to, that is. Kiss you. If you…”\nRegulus had heard enough, had enough of James’ blabbering and goings on. He was tired of Potter second guessing himself and taking his time because bloody hell if Regulus wasn’t kissed right now he was going to die.\nSo he grabbed the front of James’ robes with both hands, cutting off his words, and yanked him in. The kiss was too hard and messy, and James started laughing halfway through which made their teeth click together. And he tasted of anise which was bloody awful, but it was also the best kiss Regulus had ever had.\nWhen they finally broke away, he was kiss-dumb, staring with wide eyes as James cupped his face in both hands and pulled him in to leave a series of small, sweet pecks across his lips, down his cheeks, one lingering just under his ear.\n“I’ll take that as you fancy me back,” James murmured against Regulus’ burning-hot skin.\nThat was enough to bring him back, at least with enough wits to get the fingers of both hands buried in his hair, gripping hard. “You’re an idiot, Potter.”\nJames fought his grip as he pulled back a little, so he could look him in the eye with his stupid, beautiful smile. “Well, we both knew that.”\nRegulus huffed and tugged. “Will you just shut up and kiss me again?”\n“What about rounds?” James said.\nRegulus rolled his eyes. “Sod the rounds. You know Evans has us covered. Now kiss me or I’m breaking up with you.”\nJames threw his head back and laughed, then dragged Regulus into his lap and did just that. “Your brother’s not going to like this,” he said once they’d parted to catch their breaths. “And I bet he won’t believe us.”\nRegulus smiled wickedly as he pushed his forehead against James’. “Isn’t that more incentive to do it?”\n“Evil,” James muttered.\n“Which is why you like me,” Regulus countered.\nJames touched Regulus on the jaw again, then down to the front of his robes to hold him tight, possessive, which made Regulus feel like he was flying. “Yeah,” he said, and kissed him once, twice, quick on the mouth. “I suppose I do.”"
}