{
    "id": "1078856",
    "url": "https://archiveofourown.org/works/1078856?view_full_work=true",
    "author": [
        "Yuu_chi"
    ],
    "title": "I'll tabletop you any day",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Avatar: The Last Airbender"
    ],
    "relationships": [
        "Sokka/Zuko (Avatar)"
    ],
    "characters": [
        "Sokka (Avatar)",
        "Zuko (Avatar)",
        "Katara (Avatar)",
        "Aang (Avatar)",
        "Suki (Avatar)"
    ],
    "additional_tags": [
        "Alternate Universe",
        "Alternate Universe - Coffee Shops & Cafés",
        "boys being oblivious morons",
        "sokka's probably not a stalker",
        "Alternate Universe - Modern Setting",
        "being massive nerds",
        "star wars conversations double as sweet pickup lines"
    ],
    "language": "English",
    "series": "",
    "published": "2013-12-11",
    "completed": null,
    "words": "12,245",
    "chapters": "1/1",
    "comments": "327",
    "kudos": "16,277",
    "bookmarks": "2,822",
    "hits": "145,621",
    "summary": "<p>Sokka's the high school drop-out and closet nerd working at his sister's coffee shop - Zuko is the gorgeous rich guy who comes in three times a week and orders cinnamon tea. Sokka may or may not have his entire schedule memorized. </p>\n<p>Thank god for Star Wars.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>If you have time, please take a look at these <a href=\"https://antidurian.tumblr.com/post/110327803027/so-i-was-lucky-enough-to-find-this-masterpiece-of\" rel=\"nofollow\">absolutely</a> <a href=\"https://antidurian.tumblr.com/post/110328138572/this-is-a-continuation-from-this-post-its-all\" rel=\"nofollow\">gorgeous</a> fan arts done by the amazingly talented antidurian over on tumblr. They're beautiful and put this work itself to shame.</p>\n<p> <span><a href=\"https://www.instagram.com/p/CCnzszQBKBU/?utm_source=ig_web_button_share_sheet\" rel=\"nofollow\">This absolutely stunning pic</a> of the boys by emkniight on tumblr, which features Zuko’s bad boy piercings! </span> </p>\n<p>And another <a href=\"https://moved-to-queazyy.tumblr.com/post/621417098867064832/coffee-shop-zukka\" rel=\"nofollow\">beautiful picture</a> by <a href=\"https://queazyy.tumblr.com/\" rel=\"nofollow\">queazyy</a> over on tumblr - I can't get over how smooth Sokka looks, and Zuko's flustered expression!</p>\n<p>Edit: 23/05/20: Given the resurgence in atla love lately, I used it as motivation to FINALLY - after seven years - go back and edit this fic bcs frankly, the grammar and typos were appalling and I am amazed anybody read it. I'm not super crazy about the writing either, but it IS seven years old at this point, so if you enjoyed this in any capacity at all, I encourage you to check out some of my newer writing which is much better, I promise. </p>\n<p>The fic remains the exact same fic as it was when first posted, just with improved readability and one or two lines that did not age well pulled and replaced. Thank you all so much to the readers who have enjoyed this fic over the years, and welcome to the people who are only just finding it now! I hope you'll enjoy reading it in a slightly cleaner format!</p>",
    "text": "Sokka’s not a stalker. He’s not \nAnd okay, without context that did sound a bit creepy, but Jesus freakin’ Christ it shouldn’t matter anyway because he swears to dear god he’s not a stalker – no matter what Aang said, or how often he said it, or how loudly he said it because Aang was secretly a twelve year old brat at heart and didn’t kiss a girl until he was fourteen and thus his opinion was invalid and – \nOkay, deep breathes and rewind.\nIt wasn’t – it wasn’t anything creepy, it’s just that, there’s this guy – and if that wasn’t a phrase that pretty much defined Sokka’s high school life – and yeah, okay, maybe it was a bit creepy because even Sokka admits he kind of stared too much. He didn’t even know his name – just that he was tall, pale, despised coffee, liked cinnamon tea and had the sexiest scar sprawled across the left of his face.\n(Sokka can’t help it – scars were sexy, okay?)\nTo get back to the start of the whole stalker-not-stalker thing Sokka has going on, he should probably explain that he didn’t just aggressively stalk men through facebook until they let slip their favorite drink and their preference for tea over coffee.\n(not often anyway; it was just that one time – and he was getting off track again.)\nSokka worked at a coffee shop.\nCorrection; he worked at Katara’s coffee shop, because while Sokka had spent his high school years dicking around like the complete ass he was, Katara had grown up, gone to college and emerged with enough business know-how to drag him out of his dead-end Starbucks career track and slam him down at the counter of her own little coffee joint. It’d been humiliating at first, working for his younger sister, partly out of pride but mostly out of shame because he was meant to take care of her and somehow, without even noticing, he’d dropped the ball and now it was Katara who was looking after him. Working for his younger sister wasn’t exactly how he’d pictured his life going, but before she’d intervened he’d been working thirty hours a week at a job he hated and living off Aang’s couch, so he guessed he’d call it an improvement.\nAll things considered, it was pretty alright. He just stood behind the counter flicking sugar packets at Aang while the kid pretended he was studying and made twenty or thirty non-fat, almond-milk whipped cream mocha-lattes for the parade of over-achieving arts students that swanned in with their preppy hats, band shirts and sympathy in their eyes when he passed over their drink because Sokka was the twenty-two year old drop-out who worked at his sister’s shop and spent his days sprinkling chocolate on foam.\nAnd then one day that guy came in – which had been more than a little weird because Katara’s Koffee had kind of adopted a selected crowd of hipsters and dead-eyed arts students and seeing somebody come in without a fedora or several copies of Nietzsche tucked under their arm was something of a bizarre sight.\nAang was on break so it was just Sokka minding the counter. It had been kind of a slow morning with only a crowd of college kids tucked into a corner with their books spread all out in front of them and Sokka had always had kind of a short attention span so an anomaly in his day usually proved to brighten things up a bit.\nAnd then wow – because the closer the guy got to the counter the nicer the anomaly was looking to be because hot damn, Sokka always had a thing for tall, dark and handsome and this guy was. Tall, dark and handsome, that is, not something Sokka had a thing for – he wasn’t that pathetic – but wow he had functioning eyes at least.\n“Hey there, what can I get you?” he asked, leaning nonchalantly at the counter. “And please tell me you don’t want anything with whipped cream because the kids in the corner had the last of it and I’ve been too burnt out to do stock up yet.”\nAn annoyed gold eye flicked over to him from beneath a scruff of dark hair and Sokka choked aloud a little because holy flying fuck, that was one spectacular burn scar peeking out from beneath shaggy hair and the lining of a hood and Sokka wasn’t exactly sure how he’d missed that until he’d gone and spoken and put his foot in his mouth as he always somehow managed to do.\n“Very funny,” Scar-face said coolly and Sokka winced. “I was actually hoping for some tea; if that wasn’t too much trouble for you. You do look awfully ‘burnt out’, as you said.”\nThere wasn’t much Sokka could really say to that without sounding like an insincere jerk-off, because no matter how much the guy’s tone rankled him, he’d gone and stupidly blurted out something first. Deciding discretion was the better part of valor he elected to say, “No problem man, we can do tea. Anything in particular you want?”\nA brief flash of surprise shifted across the stranger’s face followed quickly by chagrin before his features fell once more back into an impassive mask. “Cinnamon,” he said, then hesitated briefly before adding, “please.”\nSokka let out a soft whoosh of relief because he was pretty sure that was Scar-face’s silent acknowledgment that he wasn’t going to burn Sukko to a crisp and – sweet Jesus, he really had no brain filter at all, did he?\nHe considered asking for a name to go with that, but this wasn’t Starbucks and Katara had never been really impressed by the whole “name on cup thing” since the shop was so small that even rush-hour was rarely overwhelming. He bit down the impulse and turned around to the quiet little bench space away from the looming coffee machines and started putting together his drink.\nIt was silent in the shop except for snapping of cinnamon sticks and the soft giggles of the art girls sprawled out in the corner and by the time Sokka was sliding the cup over to the counter he’d started to think maybe the dude had been offended and had just decided to leave. Which would kind of piss him off because cinnamon tea was kind of bothersome to make and Sokka was kind-of-a-little lazy.\nExcept he hadn’t and was standing exactly where Sokka had left him – like there wasn’t a perfectly good chair just two feet down the counter he could have sat at while waiting – and he accepted the tea stiffly.\n“If it’s not any good, just let me know. I don’t get to make it too often, so yeah.” Sokka rubbed awkwardly at the back of his neck. “Not a coffee fan?” he asked for no other real reason than making conversation.\nBright eyes flicked up to him and then back down at his drink. “No, not really, I suppose. How much do I owe you?”\nSokka waved a hand as the guy reached into his pocket and stared maybe a little at the way his dark pants crinkled tightly at the front. “On the house,” he said. “Least I can do for being such an ass before.”\nScar-face blinked in surprise and seemed about to open his mouth to argue but Sokka cut him off before he could even try. “Dude, don’t worry about it. It’s just a cup of tea; swear to dear God I’m not going to demand your first-born child in a few years for it.”\nHe was aiming for levity and hoping for a smile but all his words generated was a bemused sort of blink and a baffled blankness. “I see… That would be… Good?” Scar-face frowned slightly and it was such an effortless flow of tension that Sokka couldn’t help but think he must get in a lot of practice. Without another word, he turned and strode off to the other side of the store and Sokka was so startled he didn’t even remember to watch his ass as he went.\nWell, he blinked, that couldn’t have been any weirder.\nHe glanced over a few times during his shift to see that Scar-face had pulled out a book – soft pages folding lightly beneath long fingers and the corners rugged and dog-eared with love – and thought a few times about bringing him another cup of tea but ultimately decided it would probably be too weird and stalker-ish, and let’s be honest here, he’d probably just piss him off again.\nTwenty minutes later a gaggle of dark-haired girls with headphones loose around their necks bustled in and by the time Sokka looked over again, Scar-face was gone. He tried not to feel too disappointed but it was hard when he’d left a twenty buck tip for a free drink.\n(and that was how it started.)\n.\nSokka hadn’t honestly thought Scar-face would come back again.\nHe wore nice clothes and had one color in his hair – which Sokka was pretty sure was even his natural color – and had an aloof aura that was significantly different than the nonchalant front their usual clientele tried to radiate. Katara’s Koffee was nice enough, but it wasn’t in a good neighborhood and it was kind of on the small side and yeah, most definitely not the kind of scene that attracted the kids who were as well-off as Scar-face looked.\nAnd if he hadn’t come back, that probably would have been the end of it. Just another attractive guy Sokka had irritated by opening his mouth at all and he would have forgotten about the encounter altogether.\nExcept Scar-face did come back. Often, actually. Usually three days a week – Monday, Wednesday and Thursday; sometimes even Sunday, but not often enough for Sokka to actually log it into his memory as a fixed ‘Cinnamon tea’ day and yeah, no wonder Aang thought it was a stalker.\nHe ordered the same thing every time and Sokka always refused to let him pay for it and he always left a tip that was large enough to make Sokka uncomfortable but hey, it wasn’t like he didn’t need the money.\nSokka didn’t try striking up conversation after the first horrible visit, partly because he suspected his brand of patented sarcasm wouldn’t really appeal to Scar-face and partly because he suspected that any conversation at all would probably just irritate him.\nHe wasn’t exactly sure what interested him so much about the guy because while he was good-looking, he was also kind of a jackass, and Sokka wasn’t shallow enough to ride out interest on physical attraction alone. He wasn’t; no matter what Katara said.\nHe begun to sort of look forward to the days when he’d come in, and sometimes he’d even plan out awkward conversation starters before he figured out that ‘So, Star Wars VII – Lucas’ biggest fuck up or possibly cinematic genius waiting to happen?’ wasn’t exactly the kind of conversations someone who drank cinnamon tea and read dog-eared books in the soft rays of evening light would probably be that interested in.\nAnd then there was the whole awkward Katara thing.  \nKatara had noticed when he’d started signing himself on for specific shifts partly because he never volunteered to work and partly because she was his sister and thus automatically psychic and privy to his every thought.\n“Sokka, what’s this?”\nSokka looked up from where he was sprawled across the floor. It was kind of hard to see over Aang who had found a comfortable position leaning against the couch with his legs slung over Sokka’s stomach as they played Mario Kart, but he could just make out Katara brandishing a sheet of paper from where she loomed in the doorway.\n“… The work roster?” he tried, swallowing down his mouthful of marshmallows.\n“I know it’s the work roster, Sokka,” she said as if he were slow. “What I’m asking is why you’re names on here three times?”\n“What do you mean – shit, shit Aang, you little fucker, that was dirty – what do you mean why ‘is my name on there three times’? I work there. Remember, you – fuck, fuck, drive Luigi, drive – you hired me. Pretty sure you were there for that.”\nAang let out a shout of victory and nearly whacked Sokka in the chin with his foot.\n“Oh my god, Aang would you pause that for one minute.”\nAang – pretty much always willing to listen to Katara – sheepishly hit the pause button.\n“You never sign up for shifts. I wasn’t even aware you knew how. You usually just let me sign you on and whine when it interferes with your Dungeon and Dragons night.”\n“Okay first off?” Sokka said as he set the controller down. “It’s Vampire Masquerade – I don’t know how many times I have to say this. Its two words guys, it’s not that hard to remember. It’s not my fault if you can’t keep your tabletop games straight. And secondly Katara, I am frankly offended at your appraisal of my work ethic. Can’t a guy try to be a hard worker without his motives being questioned? I’m just thinking I should put in my hours, and, uh, do stuff, you know?”\nSokka was a terrible liar. He knew it, Aang knew it, Katara knew it.\n“Okay,” Katara said. “I don’t know why you’re getting all defensive –”\n“I’m not getting defensive,” Sokka snapped and then pulled a face when he realized how defensive it sounded. “I’m just –”\n“Sokka has a crush on a customer,” Aang blurted out like the filthy traitor he was.\n“Oh my god Aang! Is nothing sacred between friends? And it’s not a crush – stop saying that, it’s just, do we really have to talk about this?” he asked desperately but judging from the look on Katara’s face, yeah, they probably really did.\n“A crush on a customer?” she asked disbelievingly. “Holy crap Sokka, do I have to buy you a chastity belt or something?”\n“What does that even mean?” Sokka snapped. “It’s not like I just go around throwing myself at people, you know. I’m not actually a dog, Katara.”\n“Sorry.” She frowned. “That was a bit harsh. You know I didn’t mean it like that but just – Sokka, really? Do you go out of your way to find the least available guys to give your heart to?”\n“This isn’t an eighteenth-century romance novel,” Sokka said, and yeah, his voice might have been a little high pitched but this was embarrassing and goddamn it Aang, throwing him under the bus like this just to get a favor in with Katara. “I’m not ‘giving my heart’ to anyone, oh my god, do I have to burn your Stephanie Myer books? It’s just, there’s this guy and –”\nBoth Katara and Aang groaned in unison.\n“There it is,” Aang marveled, “it’s started.”\n“Oh, brother,” Katara said with genuine sympathy that was frankly a little alarming. “If only you could hear yourself.”\n“Oh, fuck you both,” Sokka snapped, bright red, as he flopped back down and picked up his controller again. “I don’t want to talk about this anymore. Aang, unpause the damn thing and I’ll show you what a real racer can do.”\nAang did and Katara left, but not before throwing him a sympathetic look over her shoulder. Sokka viciously stuffed another fistful of marshmallows into his mouth and pretended he wasn’t as pathetic as he felt.\n.\nThe thing is, Sokka had so many excellent conversation ideas planned out.\nHe’d moved on from Star Wars – it was stupid to begin with anyway; even Aang didn’t like to talk Star Wars with him and Aang was like his bro of bros and would probably be his brother-in-law one day at this rate – and onto bigger and better things. Like the weather. Or traffic. Maybe even the weird German guy who’d started sitting at the counter four days a week. Anything that didn’t give away Sokka’s raging nerdhood and his borderline creepy interest.\nWhat actually came out of his mouth one day as he was handing over his tea was: “So what’s your name anyway? It’s a little distracting calling you Scar-face all the time.”\nOh my god, Sokka thought as his teeth slammed down hard on his lip. Smooth, soldier. Real smooth. And probably seven different kinds of offensive too.\nScar-face, to his credit, didn’t do much more than blink awkwardly at him, like he was unsure Sokka had even spoken at all – which was a step up from throwing his scalding drink in his face, but a step or two below suave conversation.\n“My – what? My name?”  He sounded almost as incredulous as he looked.\nAnd okay yeah, this was awkward but Sokka saw things through once he started so he settled for an exasperated eye roll and prayed the Scar-face thing had slipped by him because awkward.\n“Yeah, your name? The little thing that people scream on the streets when they want your attention? You’ve been a regular for like – what? Three weeks now? It just feels weird not having anything to call you when you come up in passing conversation.”\nScar-face’s expression came even more confused. “I… I come up in passing conversation?”\nOh shit.\nSokka flushed bright red. “Not like anything special. Don’t go getting all big-headed. Fredrick over there comes up in passing conversation now and then too,” he said nodding to the weird German guy over at the counter edge even though he didn’t have a fucking clue what his name was although he was eighty-percent certain it probably wasn’t Fredrick.\nIf anything, Scar-face just looked more weirded out and Sokka was so glad Aang wasn’t here to witness his moment of shame because this was humiliating.\n“Zuko,” he said after a moment and it took Sokka a whole ten seconds to realize he meant his name.\n“Zuko,” he repeated and gave him a winning smile. “Awesome, got a z in it, won’t go forgetting that anytime soon.”\nScar-face – Zuko, Sokka corrected himself and tried not to smile like a teenage girl – shifted uncomfortably and Sokka waited patiently for him to turn and flee back to his designated little corner by the window. Instead he hesitated a moment and set his cup back down at the counter and took a seat.\nSokka was so busy outright staring in surprise that he missed whatever words it was Zuko’s mouth was forming. He blinked. “Wait, sorry. What was that?”\nZuko’s mouth twitched almost like a smile but more closely resembling a smirk. “I said you?” He gestured towards Sokka’s apron. “You don’t wear a name-tag.”\n“Oh,” Sokka said as his fingers fluttered up to his bare apron. “Um, yeah. Lost it. I’m pretty good at that. Katara’s still too pissed to order me a new one. It’s Sokka.”\n“Sokka,” Zuko repeated and the sound of his name rolling off that tongue was almost enough to make him shiver like he was sixteen again. “Katara?” he said next, frowning slightly. “As in the owner of Katara’s Koffee?”\n“One and same. She’s my sister. Gave me a job to stop me from being a useless shit; didn’t work, but points to her for trying. She likes to pretend that if she just acts like I’m not an embarrassment we won’t be related anymore. I could have told her that doesn’t work; I’ve been trying since she turned twelve.”\nZuko actually laughed. It wasn’t loud or quiet or anything too extraordinary; just a puff of air and a surprised chuckle like he hadn’t figured Sokka to be quite so mouthy but it did things to him because two days ago they hadn’t even really spoken and now Sokka was making Zuko laugh and he knew his name and – woah there cowboy, better slow down before you do something dumb like ask for his number.\nSokka grinned though, still pleased all the same at the response before scrubbing half-heartedly at a smudge of coffee on the counter. “How about you big-shot? Got any sisters wishing you into non-existence?”\nZuko raised an eyebrow at him. “Big-shot?”\n“Well yeah,” Sokka deadpanned, waving a hand at the nice coat and the nice shirt and really, the nice everything. “Anybody who doesn’t buy their clothes from a discount retailer is a big-shot. Learn your facts, man.”\nAnybody else might have been offended, but Zuko’s eyebrows just climbed a little higher and he took a sip of his tea before giving a mild shrug. “My family does okay,” he said, but a little uneasily like he didn’t really want to talk about it before adding quickly, like he wanted to change the subject, “I have a sister. One.”\n“Hot damn,” Sokka said, easily ignoring Zuko’s clear discomfort about the previous topic. “She got the whole charming pale-and-black thing going on there too? Is it a family thing?”\nZuko snorted. “I could ask that of you. Does your sister look anything like you? If so, my condolences to her.”\n“Okay, you are not funny,” Sokka said, jabbing a finger at Zuko. “Leave the jokes up to the professionals before you hurt yourself, pretty boy.”\nZuko raised an eyebrow. “Pretty boy?”\n“That’s not – you know what I mean,” Sokka spluttered a bit uselessly as Zuko laughed at his clear embarrassment. “You are the worst. I don’t know why I ever thought it’d be a good idea to talk to you.”\n“You wanted to talk to me?” Zuko asked, clearly surprised.\n“Uh, duh, yeah. I don’t just ask the names of everyone who comes in.”\n“I thought you wanted my name because I came up in passing conversation?” Zuko said and he looked half amused and half confused. Sokka had that effect on lot of people.\n“That too,” he said because it was the easier thing to say. “But like, yeah. I’m not a stalker, don’t freak out.”\n\nProbably.\n\n“Oh,” Zuko blinked before adding, clearly rushed, “I wanted to talk to you, too. To apologize for the first day.”\nSokka paused for a moment and stared. “Apologize? What for? I was the one who went and said something really stupid. If anything, I should be apologizing to you.”\n“It’s…” Zuko hesitated for a second, long fingers curling warm around his tea. “It’s no excuse for how rude I acted afterwards, especially seeing as how you’ve gone out of your way to make me feel welcome since.”\n“It’s just some free tea, man,” Sokka said awkwardly as his face heated up. “Let’s not go getting all sentimental over a few sticks of cinnamon.”\nZuko actually cracked a smile at that and god, was that a face designed for smiling. It was a bit awkward around the edges, a little bit unsure, a tad defensive even, like Sokka might call him out on it, but it was an honest-to-god smile.\nThey talked for the next hour or so, and when a crush of students poured in to steal Sokka’s attention, Zuko actually said goodbye before he left.\nSokka was actually doomed.\n.\n“So, you going to ask him out?” Aang asked the next day while Sokka scrubbed at the counter and Aang pretended like he was doing his gender studies work on the opposite side of the bench.\n“I don’t know who you mean,” Sokka said with as much dignity as he could muster. Aang raised an eyebrow at him which was always something that tended to look a little weird on somebody with as little hair as Aang had.\n“Oh, nobody. Just that guy in the corner you’ve been staring at for the past half hour. I’m going to go ahead and assume he’s ‘the guy’ that you’ve been waxing poetry about for the past month.”\n“Could be you quieter?” Sokka hissed under his breath as he shot a concerned glance to the corner that Zuko was sitting in. He didn’t appear to have heard anything, however, and just calmly turned a page in his book and took another sip of his tea. Sokka breathed out a sigh of relief and shot Aang a nasty look. “I haven’t been waxing anything about anyone, okay? And I keep saying it’s not like that. He’s just… he’s just really interesting, okay?”\n“Why won’t you just admit you like him?” Aang asked looking honestly baffled as he sat aside his pen and gave up all pretense of studying which meant he was in his Definitely Very Serious mood.\n“There’s nothing to admit,” Sokka said through gritted teeth. “Hi, welcome to Katara’s Koffee; what can I get you today?”\nAang waited patiently for Sokka to serve off a few hot chocolates to the giggly high school girls that kept looking at him out of the corner of their eyes. Dude was impervious to anybody who wasn’t Katara, really. “I mean, what’s the worst that could happen from saying it aloud?”\n“I could lose my dignity? My self-respect? My reason to live?”\n“Now you’re just being dramatic,” Aang scolded and it was weird. When did it reach a part in his life where it was okay for Aang to scold him for being stupid? Kid still couldn’t even legally drink.\nSokka sighed and thunked the rag he was wiping the counter with down. “Just let it go, Aang,” he said tiredly.\n“No,” said Aang stubbornly because he could be perceptive at the worst of times. “Not until you tell me why you won’t admit you like him.”\n“Because, because… oh my god, I can’t believe you need me to say this aloud.” Sokka winced. “Just… Just look at him.” He gestured over to where Zuko was sitting, back turned to them. Aang gave him a concerned look.\n“Yeah?” he said. “What’s your point?\n“He’s way out of my league,” Sokka snapped. “Okay? Are you happy now? People like that don’t wind up with people like this by any stretch of imagination.” He waved a hand in front of himself. “I mean, yeah, I’m pretty fucking fine, don’t get me wrong, but… it’s just not happening, Aang.”\n“Do you really think that?” Aang asked, looking crestfallen.\n“Yes, I really think that. So thanks for making me so it. Are we done? Shut up and do your homework.”\nAang did go silent and do his homework after that, biting his lip and casting concerned glances at Sokka all the while.\nThey didn’t speak again.\n.\nSokka managed to keep his raging crush to himself for nearly a week after that. Which, all things considered, was something of a personal record for him.\nIt was late on a Thursday evening and Sokka was alone closing up shop. The last of the customers had trickled out fifteen minutes ago and he had his earphones in and was humming along to a rousing rendition of nothing in particular which was why it took him so long to realize that the shop wasn’t empty after all.\nZuko was sitting over in a nook just behind the counter, completely different from his usual place. Sokka paused, chair half in his hands and half resting on the table he was setting it on. He’d thought Zuko had left hours ago because, well, he wasn’t sitting over where he normally sat.\nIt was strange, okay?\nHe hesitated for a moment, considering him. Zuko wasn’t reading a book this time. Instead he was typing at a laptop, brow creased unfavorably and tea forgotten by his elbow. He looked pretty stressed.\nSokka stared for a moment longer before coming to his decision. He turned around and continued closing up, putting chairs on tables and pulling blinds closed. He went slower than usual, but he still finished in only a matter of ten minutes or so. When he turned back, Zuko was still sitting in the corner and showing no signs of moving.\nHe had a Vampire Masquerade game scheduled for tonight. He had to be at Haru’s in under an hour. He hesitated.\nZuko did look really stressed.\nIn the end, there wasn’t even a decision to make. Sokka sighed and headed back behind the counter to make another cup of cinnamon tea, pulling out his phone and dialing absently at he went.\nBy the time he had the game rescheduled for the night after next, he’d set the fresh cup of tea down at the table with Zuko and taken the empty cup into the back. Zuko didn’t even look up from his typing and Sokka couldn’t stop the fond smile from pulling at his lips even though he really was kind of worried for the intensity with which Zuko was focused on his computer.\nIt wasn’t like it was exactly a hardship for Sokka to stay behind. Yeah, he’d miss his RP session with the guys, but it wasn’t like they didn’t understand. It was a good chance to get some of the stock reports Katara had been nagging him for done, and he couldn’t fault the view tucked behind the counter with Zuko’s serious face to glance at from time to time when he got bored of numbers.\nIn the end, Sokka did wind up getting sucked into his work. He’d never had a great head for math, but when he hit a rhythm in his work he could go for hours. He was just working out how much they were short by this week when a shadow fell over him and Sokka looked up to see Zuko standing on the opposite side of the counter.\n“Oh,” he said in surprise and offered him a grin as he pulled his earphones out, cutting off Freddie Mercury’s explanation as to why love wasn’t so crash hot anyway. “Sorry, didn’t see you there for a moment.”\nZuko had the oddest look on his face as he stared at him. Sokka frowned. “What? Is there something on my face? Oh my god, it was probably Aang, that bastard –”\nSokka’s ranting seemed to jerk Zuko out of whatever trance he was in because he blinked and then said, “No, that’s not…” he paused again. “It’s eleven-thirty,” he said uncertainly.\n“Oh wow,” Sokka marveled because holy crap time could fly. “That late already?”\n“You close at nine,” Zuko said and yeah, he was definitely frowning now.\n“Um,” Sokka said intelligibly, “Yeah. I did close hours ago. You just looked like you needed to…” he waved a hand over to where Zuko’s laptop still stood open. “Keep doing whatever you were doing?”\nZuko was still looking at him like he’d never seen him before in his life and Sokka flushed, suddenly wondering if he’d overstepped his bounds, if maybe the whole thing had come off as creepy rather than just casually concerned. “Sorry, I, uh, I didn’t mean to make you uncomfortable or anything,” he said.\nZuko was still looking at him blankly. “So you just… stayed behind so as not to bother me?”\nSokka cringed because it hadn’t seemed like such a big deal until Zuko had gone and pointed it out. “Pretty much, yeah.”\n“For two and a half hours?”\n“Okay, to be fair, numbers are really fucking fascinating, okay? Not my fault I got sucked into the whole stock counting thing. You should try it. Very therapeutic.” It was complete bullshit but the way Zuko just kept staring at him was making him seriously nervous.\n“You didn’t have to do that,” Zuko said. “I didn’t want to impose or –”\n“Okay, dude, trust me. It was no imposition,” Sokka said, relieved to finally have something to say that had a basis in sanity. “I had stuff to do anyway, and you looked like you were on a role. If you didn’t even notice when I dropped a chair in the middle of close, you definitely needed to keep doing whatever it was you were doing.”\nZuko looked so baffled that Sokka was honestly confused. Had he really never had anyone do something that simple for him before?\n“I’m –” Zuko started to say before stopping and starting again. “Would you like a lift home?”\nSokka blinked at him. “Like, with you?”\nZuko nodded stiffly. “It’s late. It’s not really safe to walk home at this hour.”\nSokka blinked again. “How do you know I walk?” he asked, viciously, terribly confused. The back of Zuko’s neck looked like it might have reddened slightly and he very carefully avoided Sokka’s eyes.\n“I’ve seen you walking by in the evenings sometimes. I’d previously considered offering you a lift, but you seemed, uh, distracted.”\nIt took everything Sokka had not to turn bright red because he was fully aware that his walks home generally consisted of listening to his music louder than was probably healthy and dancing his way down the street like he thought he was Shakira. “Oh,” he said faintly, and wondered if he could chance an attempt at drowning in the sink. “Uh, yeah.”\nZuko raised an eyebrow at him. “So is that a yes to a lift home?”\n“Um, only if I’m not out of your way or anything,” he said blankly because this was all a bit fucking strange and he wasn’t entirely convinced he hadn’t just dreamt all of this up.\nZuko smiled and Sokka’s heart did something that probably would have qualified it for the Russian Olympic gymnastics team. “It’s no problem,” he said. “After everything you’ve done for me, it’s the least I can offer in return. Just give me a moment to pack up.”\n“No problem,” Sokka said and could only watch blankly as Zuko packed away his laptop and belongings with ease.\nHe slipped the reports he’d finished under the register for Katara to find in the morning and ducked in back to take off his apron and grab his bag. When he came back out, Zuko was waiting for him patiently by the door. “Sorry,” he said, “let’s go.”\nZuko’s car was a smooth black thing that looked like it probably cost more than his yearly rent. He was half completely and utterly impressed, and half horrified about the smell of coffee he was probably going to leave clinging to the upholstery as he climbed delicately into the passenger seat.\n“You’re not going to break it, you know,” Zuko said, amused. “I’m pretty sure it’s designed to hold your scrawny weight.”\n“Oh, shut up captain muscles,” Sokka snapped as gingerly pulled the door closed.\n“Captain muscles?” Zuko repeated and Sokka really wished he could think before opening his mouth. \n“Oh my god, would you just drive already,” he moaned and Zuko obliged with a light snicker.\nIt was much warmer in the car than it had been outside, but Sokka shivered a bit through his thin shirt and was absurdly touched when Zuko directed all the heat vents towards him without so much as a word. Dude was totally not helping Sokka get over his absurd crush though.\n“Where to?” Zuko asked and it took Sokka a moment to realize he meant his address.\nSokka rattled off his address and watched as Zuko’s fingers easily turned the wheel beneath his sure and confident grip. Hands like that should be illegal on a man.\nSokka quickly turned his attention to the window before he got caught staring and pulled at his short ponytail with his fingers. It was coming loose and he tugged it free easily, sticking the band between his teeth as he brushed his fingers through his hair with an irritated sigh. He was pretty sure he felt the faintest slick of cream in there from a handsy toddler. By god, did he hate children.\nZuko made a sound from the driver’s seat and Sokka looked over as tugged his hair back up. He was staring straight ahead at the road, fingers tight on the wheel. “What’s up?” Sokka asked around the band in his mouth, before making a face and using his teeth to tug it over his wrist instead. “You doing okay, big guy?”\nZuko shook his head. “Nothing,” he said with the faintest strain in his voice. He cleared his throat. “Your hair looks nice like that. Down, I mean.”\nSokka blinked. Did Zuko just compliment him?\nHeat flooded through his face in an instant and he worked to school his face into a smirk that didn’t make him look like a lovestruck puppy. “I could leave it down if you’d prefer,” he said because flirting was kind of his default when he didn’t know what the hell to say.\nZuko’s fingers seemed to flex on the steering wheel. “It’s cold out,” he hedged, which made absolutely no sense to Sokka, but his brain was still a bit fried from the compliment. Zuko slid a sidelong glance at him, burnished brown darting over to peer at him from beneath a fan of dark lashes. “It’d probably be… warmer to leave it out.”\nSokka swallowed and thought through a hazy fog, bullshit.\nSomething sat heavy and thick in his gut and he was pretty certain he wasn’t imagining the crackling tension in the car. He was suddenly conscious of his breathing, the way it sounded loud and rough in the air. He cleared his throat. “Yeah,” he rasped, “I, um, I’ll do that. Leave it out, I mean.”\nZuko turned the wheel easily and didn’t look at him. “Good,” he said, and Sokka’s brain short circuited because what did that even mean?\nThere was the crunch of road giving way to gravel and Sokka glanced up in surprise as he realized they were pulling up by the drive of his apartment complex. He’d known it’d be a short ride – it was within reasonable walking distance after all – and he couldn’t honestly say he wasn’t glad for it. Being stuck in close quarters when Zuko was in such a strange mood spouting things about his hair and looking at him like that, like he mattered - Christ.\nSokka was broken. Undeniably, irreversibly broken, because he was doing so good at pretending like he didn’t notice the little things like the fact Zuko’s eyes were more gold than brown or the way his collarbone dipped in a pale slide of skin and bone beneath the neck of his shirt but then Zuko had to go and say stupid things and give him hope and that was just too cruel.\nSokka dragged in a deep breath and unclicked his seatbelt with thick, clumsy fingers. “Uh, thanks for the ride, man. I’d say I owe you one, but we’ll just consider this as an advance on all your future cinnamon teas,” he said as steadily as he could manage. He fumbled for the door handle and pasted a frankly shitty excuse for a smile on his lips.\nZuko’s hands rested lightly on the wheel, the car still thrumming beneath them. He wasn’t even looking at Sokka and his heart sunk a little bit, because he so desperately wanted just the briefest glance of his eyes, his mouth, his scar – anything to assure him that this was Zuko sitting here with him in this weirdly electric moment before he opened the door and it was lost to the chill of night air.\n“Um,” Sokka said intelligibly and he really should just leave, “I guess I’ll see you Monday then.”\nThat got Zuko’s attention, his eyes flicked up quick as you like and his lips parted just lightly in surprise. And then Sokka realized what he – in his moment of infinite wisdom – had said.\n“Oh shit,” he breathed as Zuko’s eyes remained locked with his own and Sokka knew in instance with the way they widened and his mouth dropped, fingers slacking on the wheel, that whatever he saw in Sokka’s expression meant there was probably no talking his way out of this one.\n\nSokka had just gone and revealed his complete infatuation and he’d ruined everything, and oh god, what was he going to do without the smell of cinnamon and sugar and Zuko was, Zuko was -\n\nZuko was unclicking his seatbelt and before Sokka could really think about what was happening there was a hand on the back of his neck pulling him forward and he was being kissed deeply and messily, pressed back into his seat with Zuko’s hand hot on his skin, lips pushing at his own.\nHe reacted on instinct – because fuck, fuck, fuck; this couldn’t possibly be actually happening – fingers wrapping around Zuko’s biceps, curling over thick flexing muscles and hot skin and kissing back with all the energy he had, taking the kiss deeper and further and making it as filthy as he could make it as quick as he could because he might only get one chance at this and then –\nZuko groaned into his mouth – an honest to god groan – and Sokka’s stomach flipped at the thought that he was doing that to him and he wrapped his arms around Zuko’s shoulders to pull him in further until he was pretty much on top of him.\nIt should have been awkward. The front seat of a car really wasn’t made with this sort of activity in mind – design error, Sokka should complain – and in any other circumstance it would be. There was a gear stick digging into his side and Zuko couldn’t possibly be comfortable with the way Sokka had all but hauled him over the center console, but Sokka really couldn’t be fucked to waste vital brain space on things like comfort or awkward right now.\nThe kiss turned open mouth and the kind of desperately messy though Sokka had thought he was done with in highschool – so very fucking wrong he was then, because the way Zuko’s tongue felt as it licked inside in his mouth should be illegal.\nSokka didn’t think he’d ever been this aroused in all his life because just kissing Zuko was better than any sex he’d had with anyone ever and he didn’t think he wanted to do anything ever again in his life.\nZuko pulled away and Sokka tried to follow him up only to have on hand sprawl across his stomach and push him back into his seat as lips mouthed down his throat. “Sokka,” Zuko breathed against his skin and Sokka couldn’t help the ragged gasp that tore itself from his mouth, fisting one hand in Zuko’s shirt as he –\nA sharp rapping came from the window, knuckles knocking hand against glass, and Sokka’s eyes flashed open and Zuko was hauling himself up and – fuck no – off of him and unwinding the window with a steady finger on one button.\nSokka flung himself desperately back into his seat ad tried not to look like he’d been about to engage in anything dubious, shoving a fist against his mouth to muffle the way his breath came in uneven pants and shifting uneasily in the seat because there was no was in hell he could have Zuko sprawled across him like that and not get a little hard.\nThe face that appeared in the window was that of Mrs. Shoddery; the woman who lived two doors down from Sokka and was looking in on them with a mixture of concern and suspicion.\n“Are you boys okay?” she asked. “You’ve been stalled here an awful long while.”\nSokka worked to contain a hysterical giggle. They’d been doing more than okay until she’d gone and ruined it all.\n“Sorry Ma’am,” Zuko said, and how he managed to sound so smooth and apologetic when he’d had his tongue down Sokka’s throat a moment ago, he’d never know. “We were just discussing something and –”\n“– we’re done now,” Sokka interjected as he scrambled one-handed for the bag by his feet, the fingers on the other hand finally catching on the door handle. “Thanks-for-the-lift-Zuko-bye.”\nHe catapulted himself out of the car and slammed the door behind him, catching only the briefest glance of the complete surprise on Zuko’s face before the tinted passenger window blocked him from view.\nOh good, Sokka thought a little deliriously, at least Mrs. Shoddery will never know exactly what it was that was happening in there.\nHe turned and fled up to his apartment.\n.\nThe next day at work was hell.\nIf Sokka was still working at Starbucks, he probably would have called in sick. Unfortunately stunts like that were considerably harder to get away with when your own flesh and blood was your manager. He didn’t quite know how he did it, but he got himself out of bed – not like he’d really slept, replaying the smooth glide of Zuko’s lips and the careless slide of his hands – and into work just on time.\nSokka spent the day fumbling mugs and spilling coffee beans. He was lucky he was the only person working. He could just imagine Katara’s face if she’d seen him spill the sugar-packet holder for the third time.\nHe’d made out with Zuko.\n Zuko had made out with him.\nSokka took in a deep shuddering breath and focused on scrubbing the counter with more vigor than was probably advisable considering its ability to absorb water like a sponge.\nThere had been making out and hands and Sokka was absolutely certain he hadn’t imagined the way Zuko’s fingers has fluttered along the inseam of his pants, flitting dangerously upwards.\nSokka probably would have blown him in the car without a second thought if those fingers had just inched a little higher.\nFucking Christ, Sokka couldn’t stop his fingers from shaking. He was going to drive himself insane at this rate and it wasn’t like they’d even really done anything. He was a twenty-two year old man; he absolutely could handle a little bit of making out and backseat fumbling without turning into a fucking Disney princess about the whole thing.\nExcept for the fact he really couldn’t, apparently, because every time the bell rang he couldn’t stop himself from looking up with the faintest flicker of hope skittering like nerves down his spine even though it was only Friday and Zuko had never been in a Friday in his life.\nIt was just… Zuko was unobtainable. He came into the shop and sat by the full-wall window to read books – pages worn thin with love –and drank cinnamon tea and made Sokka’s heart stutter just by being there with his gorgeous face and gorgeous arms and stupidly gorgeous everything.\nSokka was an expert at lusting after things he could not have. He had it down to a fine art, nearly. He’d been all but prepared to hopelessly moon after him for the rest of eternity, because that’s what guys like Sokka did.\nOnly Zuko had kissed him like he’d been craving it and Sokka could cry because now he had no fucking clue where that left them only that he’d had the hottest guy in the Northern hemisphere all but in his lap yesterday and he really wouldn’t be opposed to doing it again.\nWhen Suki came into relive him off his shift at three o’clock, she frowned.\n“What’s got you looking constipated?” she asked with all her usual tact. “I know you’re not a fan of the morning shift, but you don’t usually look like you can’t decide whether to throw yourself off a cliff or cry in the corner like a little boy.”\n“What do you mean?” Sokka blinked, because he hadn’t thought his inner turmoil was that obvious.\nShe flapped a hand at him as he undid the knot around his waist. “You’re distracted. Now, I’m not saying you’re usually a down to earth person or anything, but something must be up to have you as covered in coffee stains as you are.”\nSokka made a noise at the back of his throat and focused on hanging up his apron. “It’s nothing,” he said, not looking at her even though he could feel her doubtful gaze boring like a drill in the back of his skull. He fussed with his jacket, pulling it on deliberately slowly like she might just drop it if he appeared immersed in the task.\nShe sighed. “It’s that guy isn’t it?”\nSokka whirled around spluttering wordlessly, because Jesus Christ, who the fuck keeps telling people about these things? Is Sokka not allowed one little romantic crisis without it becoming water-cooler fodder for anybody and everybody even remotely involved in his life?\nWhile he wasn’t quite able to verbalize everything he wanted to, something must have shown through in his expression for Suki’s face softened slightly. “You can relax. I’m not going to tell you my opinion on the whole debacle – although if Toph is to be believed, you’re star crossed lovers who are planning a Romeo and Juliet to escape the disapproval of your families.”\n“Oh my god,” Sokka breathed, burying his face into his hands, because at this point he didn’t even know who to blame for the fact that his romantic life was apparently a daily soap for his friends. Suki snorted in sympathy.\n“But,” she continued, “hypothetically, if I were to give you my opinion on the whole debacle –”\n“–I don’t really want to –”\n“– I’d say,” she continued, like Sokka hadn’t cut over her at all, “Jump that boy’s bones and be done with it.”\n“I hate you,” Sokka said furtively as he stalked towards the door. “I hate you all.”\n.\nSokka used his weekend off to viciously repress anything related in any way, shape or form to the mess that was his romantic life.\nHe kicked off Saturday with a Buffy marathon and a tub of icecream before having Aang over for a few rounds of anything that had a multiplayer function. They ordered pizza and Sokka schooled his ass in Street Fighter. Aang wound up crashing for the night, which suited Sokka just fine as he really needed the distraction.\nIf Aang picked up on his near desperate will not to be left alone, he graciously didn’t say anything.\nWhen Aang left Sunday Sokka headed over to Haru’s for the game of Vampire Masquerade that he’d been forced to postpone the other night when – no, that’s not the line of thinking that Sokka wanted his brain going down right now.\nAnyway, he headed over to Haru’s for a game of Vampire Masquerade in which his Malkavian kicked some serious butt. Sokka focused as hard as he could on being the biggest nerd he could possibly be, which really shouldn’t have been as difficult as it was seeing as how Sokka’s entire life had been a complete and utter nerdery. His first boyfriend had been a Dungeon Master at the local hobby shop. Seriously.\nNone of the guys asked why Sokka was viciously murdering any characters they came across like it was his due. They were great like that.\nBy the time Sokka got home that evening he’d done such a good job at just ignoring his problems and hoping they’d go away that he almost had a panic attack at the realization that Monday was in less than two hours and providing he hadn’t scared him off, Zuko would be back.\nAnd oh god. What if he did scare him off? What if while Sokka had been busy swooning over the whole yours-mine-and-ours possibility looming on the horizon that making out with somebody with whom you’d been getting along with seemed to imply, Zuko had just shrugged and thought thanks, no thanks.\nSokka had to sit down and tell himself to breath.\nThis whole thing had spiraled out of control. It was meant to be a crush on a cute guy who had managed to pique his interest. That was all. Somewhere along the line while Sokka wasn’t paying attention, it had gone to hell and now he was sitting alone in the fucking dark at midnight contemplating his life choices.\nHe was more than a little gone on the bastard, and he figured maybe this was what Katara and Aang had been trying to warn him about all along.\nTomorrow, he thought as his folded his fingers into a fist. Tomorrow everything would become clear.\n.\nEverything was not clear. Everything was fucking chaos.\nSokka had been so distracted, completely wrapped up in his own little world of Zuko, Zuko, Zuko that he’d completely forgotten that life didn’t just stop for the whims of mortal men.\nIt was the start of the holiday period and even though Katara’s Koffee was small and empty and not in the best neighborhood, the day classes let out usually meant the biggest inpouring of business they’d see all year.\n“Where the fuck is Yue?” Sokka snapped as Suki swept past with a tray carefully balancing several drinks. He could barely hear her answer over the sheer crowd noise.\n“I don’t know,” Suki growled as the press of people around her nearly sent the drinks toppling to the floor. “I can barely see myself in this crowd, and you expect me to keep an eye out for somebody else?”\nSokka would have argued but it was packed and he couldn’t just stand around arguing with people, he had to get actual shit done.\nThe constant ebb and flow of the customers meant that he really couldn’t keep an eye out for Zuko. Not that it really mattered anyway. Zuko would probably take one look at the amount of people crammed in and turn around and leave out of sheer horror.\nThings didn’t slow down until about six in the evening when most of the excitement of being let free from their respective education systems had abated enough to allow the shambles of students to leave and go do whatever it was students did when they weren’t studying or cramming themselves into Sokka’s coffee shop. As the numbers dwindled down to the spare two or three customers, Sokka allowed himself to look to the door again and hope.\nBut six became seven, and seven became eight and suddenly the shop was empty, it was time to close and Sokka was all alone at the front counter with fingers tight around the grip of a mug and something bitter like disappointment hot against the back of his tongue.\nZuko had never missed a Monday before Sokka had to go and open his big mouth.\nSokka cleaned with unnecessary attention, slamming mugs and cups away like they’d done him a personal wrong and scrubbing at tables so hard it was amazing he didn’t wear the cloth to scrap.\nHe was starting to wonder if maybe Zuko hadn’t seemed as involved as he’d thought that night in the car. If maybe it was his mind twisting things just because that was how he wanted it to seem. There was no denying Zuko’s mouth had been on his, his hand low on his thigh. That, at the very least, had happened. But Sokka couldn’t help but wonder if maybe he’d just imagined the way his breath had hitched when he kissed back, if maybe those fingers hadn’t been gripping quite as tightly as he remembered. If maybe the look he’d seen fluttering across that face when he’d hauled him closer was more shock than arousal.\nSokka’s face was burning with something that was a mix of humiliation and dread.\nOkay. So maybe Zuko wasn’t that interested in him. Or maybe he’d been looking for a quick fling only to be completely turned off from pursing the idea when Sokka bolted from the car like a madman. Maybe, if he were lucky, Zuko would come in at his usual time tomorrow and sit at his usual table, order his usual tea and the two of them could just pretend the whole thing never happened.\nSokka sighed and ran a hand over his face, suddenly feeling limp and devoid of energy. He was tired. He couldn’t think about this right now; possibly never again. Whatever had happened in the car had been a good thing and Sokka had probably gone and ruined it. He did that a lot, shouldn’t be much of a surprise by now. He was a twenty-two year old screw up that couldn’t even finish high school properly let alone hold a steady job without his sister there to help him.\nFuck it. Fuck it all.\nHe finished the last of the shop cleaning, flipping one last chair over on the counter, before trailing into the back office to do other responsible grown up things like scribble down some quick notes for whoever had the opening shift tomorrow.\nSokka had just finished scrawling across a receipt on the office bench when he heard the tinkle of the bell from the front. Blinking in surprise, he craned his neck to try and peer out the door even though it wasn’t strictly possible from that angle. He’d flipped the sign from open to closed but hadn’t bothered to turn the lock over.\nHis mouth went dry and his fingers tightened around the pen in his hand. If this was mother fucking robbery, he was so not in the goddamn mood, swear to god he would put this pen through the goddamn fucker’s eye and –\nZuko paused at the door and blinked at the violent death grip Sokka had on his pen and the way he was weighing it in his hand as debating turning it into a dart.\n“Sorry, I…” Zuko paused and looked adorably unsure because Sokka was standing stock still in the exact same spot he was when Zuko entered. “Is now a bad time? I, uh, know you’re closed but I thought I might be able to … talk to you? I should probably go, shouldn’t I? Fuck, I knew this was a bad idea.”\nSokka had never heard quite so many words tumble out of his mouth before and he realized with a shock that Zuko was rambling and dear god - the word fuck sounded like heaven with the way it slipped between his teeth. Sokka knew he was staring but he couldn’t help it - the red blooming across the base of Zuko’s throat couldn't possibly be his imagination.\n“It’s… its fine,” he managed to choke out in a brilliant impersonation of a functioning human being. Hastily, he dropped the pen back to the counter. “I was just finishing some things. You’re always welcome here. I mean, you’re not, like, intruding or anything, so, um, yeah.”\nIf one or both of them didn't stop stuttering like a grade-schooler on their first sugar trip, they were probably never going to get anywhere.\nSokka took a deep breath, let it out, and worked for a façade of casualness as he placed his palms on the counter he was leaning on and hoisted himself up so he could sit with his hands splayed behind him, feet dragging lightly along the ground as he faced Zuko. “You can come in, you know,” he said because Zuko was still hovering in the doorway between the café and the office space like he half expected Sokka to call the cops on him.\nHe visibly hesitated for a moment and Sokka wondered if that was the wrong thing to say, but then Zuko stepped forward, fingers pulling lightly on the edge of the door so it swung shut behind him and Sokka struggled to breathe.\nZuko approached with slow, even steps, like Sokka was a skittish stray that might bolt. He wasn’t quite sure whether he should be offended by that notion or not, but when Zuko stood close enough that Sokka could smell the pleasant musk of his aftershave it was hard to mind so much.\n“I wanted to apologize,” Zuko said before Sokka could even open his mouth; face a determined scraping of angles and lines and Sokka blinked at him, still a bit high off the close-enough-to-touch scent of his aftershave.\n“Apologize?” he echoed vaguely and Zuko nodded.\n“For the other day.”\n“The other day…” Sokka really needed to find something to say that wasn’t just parroting Zuko, but his thoughts were stuck in third gear. What happened the other day? The image of lips on lips and hands sliding low beneath his shirt roared to life in the back of his mind and Sokka’s heart rate ratcheted up a notch. Hope tasted deceptively sweet.\nAnd then the rest of his brain caught up with the other words Zuko had been saying and his heart froze. “You wanted to apologize?”\nZuko’s eyes were grim and guilty and he’d not made a single move to close the foot of space between them. There was stiffness in his back and an air of formality around him that reminded Sokka of the first time he came into the shop back before they’d had a real conversation or he’d made him laugh.\nSokka felt like he was going to be sick, and then Zuko was talking again.\n“I shouldn’t have done that. I wasn’t thinking straight, but that’s no excuse. I understand completely if you don’t want anything more to do with me. I won’t come here again.”\nSokka stared blankly as the meaning caught up with the word. Shouldn’t have done that … won’t come here again.\nSuddenly, Sokka felt dizzy and he was lucky he was already propped up on the counter or else he might have had to find somewhere to sit down until the unsteady thumping of his heart evened out.\nHope was sweet – and disappointment was sickening. \n“Yeah,” he mumbled as he sat up straighter, lifting his sweaty palms from the desk and knotting them together in his lap so Zuko couldn’t see the slick glide and the way they trembled. He tried out a laugh and it nearly winded him. “Yeah, no. I get it. No problem.”\nAnd he did. He got it alright. Not like Sokka hadn’t heard that before. Not like hadn’t thought it himself. He was a twenty-something deadbeat who hadn’t bought a new pair of jeans in a year and Zuko looked like he was on the receiving end of an inheritance that was simply mind boggling.\nHe didn’t know why he’d let himself hope. Didn’t he tell Aang that only the other day? People like him didn’t end up with people like that.\n“Sokka…” Zuko’s expression looked pained and Sokka desperately wanted to be pleased by that, but he couldn’t quite do it.\n“It’s fine. Don’t worry about it. I’m a big boy, I can handle a rejection.” Sokka waved a hand in his general direction and hoped that it wasn’t shaking enough to be visible. “It was kiss dude, not marriage. You don’t have to act like I’m your responsibility. I’ll get over it.”\nSomething interesting happened with Zuko’s face that Sokka wasn’t really sure he could put a name to and he blinked, opening his mouth to say something else only to realize that Zuko was right in front of him, hands on the bench either side of him and his face a bare inch away from his own. His eyes were bright and Sokka had the distant impression that he looked furious.\n“You think this is a rejection?” he hissed and Sokka stared blankly. He could feel the way Zuko’s knuckles tightened on the edge of the counter, white knuckled with tension. “You think… you think I’m rejecting you?”\n“Uh…” Sokka leaned back a bit, but Zuko followed him. “I … weren’t you?” he asked, baffled.\n“No.” The word was almost violent. “I was… Sokka, I took advantage of you.”\n“What?” He couldn’t follow this conversation with a map, a GPS and his own personal tour guide. “No, you didn’t. I would have remembered something like that.”\n(and enjoyed it too.)\nZuko took in a deep breath and his eyes fluttered closed. Sokka watched with fascination, fighting the impulse to raise a finger to trace the scar that peaked out from beneath the spray of dark hair but Zuko’s eyes were open again before he could even try.\n“You did… you’ve been nothing but polite and accommodating to me, even after I was so rude.”\n“Being polite and accommodating is kind of my job,” Sokka reminded him even if it wasn’t strictly true.\nZuko’s face spasmed like it wanted to crumple but couldn’t quite remember what muscles pulled which way for that expression to work. Sokka blinked in alarm, because apparently that had been the wrong thing to say.\n“I know,” Zuko said, and his voice was almost tired, certainly lacking in the fire that had been running through it earlier. He pulled back a bit, not quite stepping away from the counter but retreating from the way he’d been all up in Sokka’s personal space. Sokka didn’t like it as much as he should have and resisted the urge to grab him Zuko the collar and haul him back down. Clearly they were having communication issues here and trying to stick his tongue down Zuko’s throat probably wouldn’t solve them.\nZuko ran a hand through his hair, and Sokka wanted to snort with the way it shot up in every direction, but figured now probably wasn’t the time. “Zuko,” Sokka said slowly, and Zuko’s golden gaze flicked to him. “What’s really going on here?”\nAll the energy seemed to deflate out of him at once and he stared determinedly and a stain on the ceiling that Sokka knew for a fact wasn’t even that interesting. “You’ve done nothing but your job, I knew that, but still I chose to interpret in a way that suited me.” Zuko’s words sounded like he’d rehearsed them in front of the mirror. “I all but attacked you in the car; I would understand completely if you don’t want anything more to do with me.”\nSokka stared and tried to figure out whether he was dreaming or not, but his dreams had all been about sweaty grinding and naked bodies and tracing the edges of that scar with his tongue.\nThe reality was far better.\n“Zuko, you crazy moron,” he said as calmly as he could manage and Zuko looked part offended part surprised. “I kissed back – I’m pretty sure I even moaned a time or two. That is not the actions of someone who never wants to see you again.”\n“But –”\n“And I was an idiot,” Sokka talked over him, not giving him a chance to contribute because if he let Zuko say anything thing the adorable fool would probably ruin it. “I … I panicked when that old bat knocked on the window and ran when I should have stayed to talk to you. If I’d known you’d think you were taking advantage of me or something equally as stupid, I never would have done it, I thought –” Sokka choked a little on his words. They didn’t want to come up, he didn’t want to admit to being so stupid, but if there was ever a time for secrets, it wasn’t now. He needed to say this. He needed to get things sorted out. “I thought you regretted it,” he admitted quietly and Zuko stared, stunned.\n“Why would I regret it?” he asked and Sokka refrained from self-deprecating chuckle.\n“Why would you not?” he asked in return, gesturing between the two of them. “I’m … me and you’re you. I mean, I don’t mean to sound like a dick or anything, but you look like a super model with a bank account big enough to buy half a country and I’m – well, you get what I’m saying.”\nZuko was back in his space again, but this time his fingers were on Sokka’s cheeks tilting his face so that he could stare right into his eyes and wow who had eyes that fucking gold? Sokka suddenly had a new appreciation for Katara’s Twilight books and the monologues Bella Swan could wax about the Edward Cullen’s fucking eyes\n“Sokka, I have no clue what you’re saying, but I’d like you to stop.”\n“Okay,” Sokka agreed easily as his hands found Zuko’s waist.\nZuko took a deep breath and rested his forehead against Sokka’s. “I’ve been enamored by you since the first day,” he admitted and Sokka’s heat absolutely did not skip at that. “And when you talked to me for that first time, I actually started to hope that … that it might have been mutual. But then when I kissed you and you ran, I started to doubt myself. I thought you were just being kind to me because that’s your job. “\n“It’s not,” Sokka said quickly. “I mean, well it is but…” His cheeks were bright red, he knew it. He closed his eyes and muttered, “I don’t make that ridiculous tea for just anyone, you know?”\nZuko chuckled and Sokka could feel the way it vibrated against his skin, sending a jolt of sudden want down his spine, and Sokka should probably stop talking at this point but he was kind of really bad at that.\n“And I mean, in case you weren’t listening earlier when you were freaking out, but I like you a lot, okay? I mean, I seriously thought you came here to reject me, and then you didn’t even get the notice when –”\n“Sokka?”\n“Yeah?”\n“Shut up,” Zuko said, and bent down and kissed him.\nHis mouth was soft and the kiss was heartbreakingly tender, and Sokka didn’t think he could have breathed even if he wanted to. His fingers slipped along Zuko’s hips hooking into the belt hoops of his pants to drag him closer so he was pressed right up against him, fitting easily between his legs.\nThey broke apart with a silent gasp and Sokka leaned back. “Jesus,” he swore and Zuko pressed his smile into the crook of Sokka’s neck, hands sliding down Sokka’s sides to slip underneath his thin shirt and stroke along warm skin.\nSokka’s breath hitched – there was no way Zuko couldn’t feel that with the way his mouth was pressing little kisses along his throat – and he tightened his knees to draw him in closer, tilting his neck to the side.\nZuko got the hint, grazing his teeth along Sokka’s skin and Sokka couldn’t contain the moan that slipped through his lips as a result. Zuko’s hand on his waist tightened, the other one edging its way up his ribs. Sokka pressed them closer, wrapping his legs lightly around Zuko’s waist to tug him close enough to feel the press in the front of his jeans. Sokka didn’t even think about it as he rocked forward.\nA gasp slipped out against his throat, and Sokka grinned and did it again, biting the inside of his cheek to stop himself from making a noise at the solid heat pressing back against his own.\n“You’re going to be the death of me, I swear,” Zuko muttered and the hands that had been sliding along his skin fell back to his waist and Zuko yanked him forward with such sudden ferocity that Sokka yelped only to have Zuko lift his head and kiss him again.\nIf the first kiss had been about emotion and acceptance and confirmation, this one was about heat and body and sex. Sokka opened his mouth and Zuko pressed back, licking his way inside as Sokka let slip small noises that intermingled with harsh pants. Zuko’s hands were on his back, warm and heavy and firm as they slid low enough cup his ass through his way-way-way too tight jeans. He broke the kiss long enough to suck in a messy breath, but then Zuko’s lips were on his again, and he knew there would be bruises later.\nSokka dug his heels into small of Zuko’s back, urging his hips against his own and they both groaned into the kiss, panting against each other’s mouths and Sokka was aware that this whole thing was sliding rapidly out of control, he was at work for, and the door wasn’t even locked, anybody  could walk in –\nSokka had no idea how he found the strength as he ripped himself away, pushing Zuko to arms-length.\n“Okay, time out,” he blurted and he sounded more winded than he’d care to admit. “Oh my god. As much as I would love to have hot, sweaty office sex with you –” Sokka was going to have to ignore the animal glint in Zuko’s eyes at that or they were never going to get out of here “– The door is unlocked and Katara would kill me if she knew that I jumped you against this desk.”\nZuko leaned forward and pressed his forehead back against Sokka’s shoulder. “Is that a promise?” he asked and Sokka could feel the smirk twisting against his skin.\n“Zuko, I swear to god, I will ride you so hard you'll think I’m a goddamn cowboy,” Sokka swore as he threaded fingers through thick strands of hair.\n“You’re such a dork,” Zuko snorted and yeah, Sokka couldn’t argue with that.\nThey stood still for a moment, Zuko’s arms aroung his waist, resting just lightly under his shirt so that the pads of his thumbs could rub soft and tender along his hip bones and Sokka’s fingers gliding gracefully through Zuko’s hair as they caught their breath.\n“I should probably finish closing shop,” Sokka admitted after several long lazy minutes.\nZuko shifted slightly in his grip and sighed in protest as his fingers tightened against Sokka’s skin. “Or we could stay here and talk?” he offered.\nIt was Sokka’s turn to give a fond snort. “Talk about what?”\nZuko angled his face so Sokka could see his eyes and grinned as he asked, “So; Star Wars VII – possible cinematic legend or Lucas’ next train wreck waiting to happen?”\n "
}