{
    "id": "10990518",
    "url": "https://archiveofourown.org/works/10990518?view_full_work=true",
    "author": [
        "monpetitpois"
    ],
    "title": "The Crown Hangs Heavy",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "Graphic Depictions Of Violence"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Avatar: The Last Airbender"
    ],
    "relationships": [
        "Hakoda & Zuko (Avatar)"
    ],
    "characters": [
        "Zuko (Avatar)",
        "Hakoda (Avatar)"
    ],
    "additional_tags": [
        "hakoda is a good father",
        "ozai is not",
        "and zuko needs more adult guidance in his life",
        "Warning: child abuse",
        "this is a zuko story after all",
        "Canon Compliant",
        "tag to The Boiling Rock"
    ],
    "language": "English",
    "series": "",
    "published": "2017-05-24",
    "completed": null,
    "words": "5,807",
    "chapters": "1/1",
    "comments": "257",
    "kudos": "16,266",
    "bookmarks": "3,112",
    "hits": "103,822",
    "summary": "<p>\"They asked if we'd heard the news... about the Fire Nation prince. He was thirteen. Sokka's age. I was... fascinated.\" Hakoda does not know Zuko, but he knows of him. [set after 3x15 TBR]</p>",
    "notes": "",
    "text": "They told the story late at night around a campfire. A harrowing tale, truly—one of risk, action, reunion, and love. Everyone, even those who had witnessed the events firsthand, listened with rapt attention over cups of steaming tea. Ginseng. Zuko brewed and served it himself, to high praise from the ex-prisoners.\n“My uncle makes it better,” he promised, and gave a small nod, “but thank you.” He was almost certain he’d forgotten a step or two. The Jasmine Dragon felt years removed from his memory.\nThe tea served, he took his place at the periphery. He was half shadow, sitting back just slightly from the others as he listened. After months as the center of attention, it was a welcome reprieve. He did not miss the spotlight of royalty, nor the hundreds of eyes—belonging to servants, citizens, palanquin bearers, fathers—that had studied his every move at the Palace. There were, it now seemed, some benefits to treason and disgrace; namely, that he could drop his guard, drink his tea, and listen to Chief Hakoda regale the group with the tale of their escape.\nThe water tribe warrior was a master storyteller. He wove in just enough suspense to keep his listeners hooked, incorporated just enough detail to paint a vivid picture of the scene. His voice rose and fell, the cadence perfectly matching the action he described. Zuko had to remind himself, every now and then, that he shouldn’t be on the edge of his seat—he knew Chit Sang hadn’t identified Sokka as the imposter—but he felt the suspense regardless. Hakoda was good. Very good.\n“And then the gondola started moving, farther and farther from the platform,” Sokka chimed in. “But Zuko wasn’t on it. He was trying to break the lever so they couldn’t stop us. It took a few tries, but he chopped it right in half.” Sokka looked over at Zuko with a grin and made a huge swiping gesture with his hand. “Kapow!”\nToph frowned, inclining her head toward Zuko. “Wait, how’d you get on the gondola?”\nZuko shrugged. “I jumped.”\n“Oh no,” Sokka interjected, shaking his head. “He more than jumped. He leaped. I thought he wasn’t going to make it. For a few seconds, I was sure he was going to fall into the boiling lake. \n“I didn’t,” Zuko added. Across the circle Katara snorted.\n“Really? I never would have guessed.”\nThey laughed, and he smiled along with them.\n“That was all on me,” Sokka continued. “He was a few feet short, but I reached out and grabbed his arm mid-air. We make a good team.” He grinned, and Zuko offered a smile in return.\nSokka seemed to have a similar gift as his father. Uncle Iroh possessed it as well—the talent of storytelling. Zuko, on the other hand, would probably have described their trip to the Boiling Rock in the most bland, straightforward of ways. He was happy to just listen, and leave the storytelling to those with an ear for embellishment.\n“We’re so glad to have you back, Dad.” There was a gentleness in Katara’s eyes that Zuko hadn’t seen since Ba Sing Se.\n“It’s good to be back. Although, it really has only been a few weeks. \nAcross the fire, Aang frowned. “Still, you were in prison. That must have been hard.”\n“Well, I was lucky you kids came along. We all were,” the chief noted, looking at the other two still wearing the rough, red uniform. “The food wasn’t so good, either. I’ve really been missing Stewed Seaprunes.”\n“Eugh.”\nHakoda barked a laugh at Aang’s disgust. “They’re definitely an acquired taste.”\n“Remember that time Sokka got sick and was only allowed to drink seaprune juice for a whole week?”\n“Ugh.” Sokka grimaced at his sister’s words. “Don’t remind me.”\n“We’d been out hunting for seaotter-lions, right, son? And you lost your parka somehow…”\nThe story of the icy tundra disappeared somewhere in Zuko’s mind. He simply observed as they reminisced, the chief with the booming laugh flanked by Katara on his left and Sokka on his right. The fire swelled in front of them, lighting their faces as they smiled at memory. Zuko hardly noticed it becoming lighter, lighter, the flames climbing higher and swelling even larger. \n“Uh, Zuko?”\nHe blinked at Aang’s voice, and saw the fire deflate. He had interrupted their story—everyone was looking at him, now.\n“Oh. Sorry. I didn’t even realize…” He felt the good side of his face grow red. Stupid. He hadn’t been paying attention. He was better than that. Across the circle he caught Chief Hakoda studying him. Zuko stood and changed the subject. “Is everyone done with their tea?”\nHe collected the cups in a balancing act fit for Ty Lee’s circus, taking them over to where the dishes and pots from their late dinner sat forgotten. He took a deep breath and turned back toward the fire, toward the circle of friends and allies and former enemies. Laughs bounced off the stone pillars of the temple—Sokka must have cracked a joke. Zuko felt his mouth pull into a soft smile. A foreign expression for years, the motion had become familiar since arriving here.\nIt made little sense, logically. In the past two weeks, he had turned on everything he’d once believed, been condemned as a traitor, and nearly killed twice by his only remaining immediate family. The fate of the world rested on his shoulders, and his destiny was upon him.\nAnd still, he felt as if his ragged edges had been sanded smooth. He smiled. Softly.\nHe sat down again not at the fire but at the temple’s edge. His feet dangled over the precipice, daring gravity; his firebender’s eyes, made for the white-hot light of flame, couldn’t make out a thing despite how much they strained. Pitch-black opened beyond the ledge. He thought of Toph, then unwittingly of three-year-old panic that had eclipsed even the searing pain engulfing the left side of his face…\n…I can’t…Father! I can’t see! Father?...Uncle? I can’t…\nHe shut his eyes against the memory. The bandages had come off, eventually, and the world had returned. But Father wasn’t there, and what he saw beneath the gauze had made him wish…\nTonight, though, he did not mind the darkness. It quieted the noise in his head. Soothed him.\n“Prince Zuko?”\nHe had not heard the footsteps approaching; that was twice in one night he’d let his mind drift. Zuko stood and bowed the traditional Fire Nation greeting. “Chief Hakoda.”\n“Please, just Hakoda. Mind if I sit?”\n“Not at all.”\nHakoda took a seat at Zuko’s left, folding his legs under him. “I should thank you, Prince Zuko.”\n“If you are just Hakoda, then I’m just Zuko,” the boy pointed out. “And you don’t have to thank me.” \n“Well, Sokka told me that he’d tried to go alone and that you’d insisted on coming with him. So I really do have to thank you, because frankly I’m not sure my son would have made it back without you.”\nZuko smirked. “Can’t disagree with you there. He was going to try to take Appa.”\n“You risked a lot to go with him. I appreciate it.” \nZuko waved it away with his hand. “I wasn’t going to let him infiltrate a maximum security prison without backup. That’s just stupid.”\n“Still, the punishment for treason is execution,” Hakoda pointed out. “It’s pretty gutsy to break into the most heavily guarded Fire Nation prison with a price just placed on your head.”\nA shrug. “I’m pretty used to being unwelcome in my homeland.” And to the bounty isn’t exactly new either.\n“Yeah, I noticed that it wasn’t exactly the warmest of homecomings,” Hakoda admitted, scratching the back of his head. “No pun intended.” Zuko almost laughed. Almost.\n“My sister isn’t the warmest of people.”\n“Blue-fire-girl, right?”\n“Yeah.”\nSomething peculiar crossed Hakoda’s face, and Zuko fidgeted. “What?” \nHakoda leaned back on his hands and uncrossed his legs, letting them dangle over the edge. The chasm yawned at their feet. “She just seemed awfully eager to watch us get boiled alive in that lake.” \nAs the father of two children with a sibling relationship that was actually functional, Zuko doubted the chief could understand why he’d chuckled at the statement. To Hakoda, Azula’s presumed final words to her brother would have seemed cold at best. Goodbye, Zuko. \n“Azula’s wanted me out of the picture for a long time,” Zuko dismissed.\n“I see. Birthright?”\nHe just shrugged. “It’s more complicated than that. Azula… she’s got a lot of our father in her.” \n“And you?” \nZuko did not hesitate in his answer. “I take after our mother.” And her grandfather. \n“Where is she n—”\n“Gone.” Zuko’s eyes searched the darkness. The other cliff-face was over there, somewhere. “For years now.”\n“I’m sorry.”\nZuko nodded, and remembered something. The cave had been lit by a soft green glow, and his own words had echoed…\n…that’s something we have in common… \n“I’m sorry about your wife.”\nHakoda sighed wearily. “This war has taken something from everyone.” He cast a sideways glance, and Zuko felt the chief’s eyes tracing the outline of his scar—where pale skin met wrinkled, leathery flesh. \nHis ruined eye drifted shut. “Katara and Sokka were lucky to have you… after.” The words reached his ears and he hated how transparent they sounded.\n“I wasn’t around very long after Kya died. All of the men left to fight in the war.” Hakoda bowed his head. “My children… That was the hardest thing I’ve ever had to do. Six years, before I’d see them again.”\nZuko looked away, a phantom burning in the left side of his face.\n“Sokka did a good job protecting the village. You should be proud. He built a watchtower and everything.”\nHakoda quirked an eyebrow. “You’ve been there?”\n“Once.” Zuko paused. “When I was a different person.”\nHakoda seemed to catch on. “Ah. When you were chasing Aang?”\nOh, how even the memory of that blue-white beam of light still filled his stomach with vestigial hope and desperation. Three years of sickening obsession were not so easily left behind.\n“I crashed my ship into the village.” Shut up, came a cry from the corner of his mind, but Zuko didn’t listen. He could not stop. “I threatened them. Women and children. I bent fire.” They were emotionless declarations. He looked to Hakoda to gauge his reaction, searching for the anger that had to be there somewhere, beneath that calm and forgiving demeanor. Zuko prodded one more time: “I fought Sokka. I broke his spear in half.” He looked again, out of the corner of his slotted eye. Where was the rage, the explosive fury at such wrongdoing? The other shoe had to drop.\nPerhaps Hakoda realized he was being tested, because he didn’t take the bait. Instead, he quirked an eyebrow. “Sokka tried coming at a group of armored firebenders with a spear?”\nTension drained from Zuko’s shoulders, and he felt his rigid posture give a little. A small smile crept onto his face. “He actually managed to get the best of me, at one point.”\n“The boomerang?”\nZuko grimaced and rubbed the back of his head. Hakoda clapped him on the shoulder with a throaty laugh. The contact was unexpected, and Zuko stiffened. “I’ve been hit by accident a few times on hunting trips. Saw stars for hours afterwards. Sokka’s gotten a lot better since those days, though—wish I could take credit for it.”\n“You didn’t teach him?”\n“Nope, he taught himself to use that thing. It took him forever and got a lot of bumps on his head, but he’s nothing if not persistent.”\nZuko pursed his lips. “Uncle Iroh always said the same about me, but I’m not sure it was a good thing.”\n“It’s gotten you this far, hasn’t it?”\nThere are four characters inscribed on a pearl blade and engraved in his mind. “There were some things I should have given up on a long time ago. But I was too stubborn to see the truth.” What could he have saved, if he hadn’t been so blinded by determination? Time, heartache? Lives? He’d been consumed for three years, entirely.\nMost of that time blurred together. There were deeds, fuelled by grief and desperation, that he could not even remember. When Suki had said he’d burnt down her village, he’d had to stop himself from asking and which one was that?\nIn those three years, he’d disobeyed his mother’s final command.\nHakoda was silent for a moment, but never looked away from the young man before him. His gaze was heavy and thoughtful.\n“I’ve spent a lot of time at sea in the past six years. You know how it is, one port to the next, not much to break the boredom.”\nZuko responded with a curt nod, and waited for the chief to go on.\n“And you know how sailors love scuttlebutt. Rumors flew around at every port we ever went to.”\n“That was mainly how I tracked Aang.”\n“It’s an efficient network, as long as you don’t take everything at face value. Rumors are still rumors. And I heard a lot of stories over the years.” Something in his demeanor shifted. Zuko stiffened. “But there was one, a few years after we left the South, that I still think about.”\nZuko swallowed, eyes fixed on the darkness in front of him. “Yeah?”\n“Mhmm. We were docked in some seedy Earth Kingdom port, waiting for a storm to pass. A merchant had come to trade with us. Talking passed the time.” Hakoda paused for a moment. “He asked if we’d heard the news. About the Fire Nation prince.”\nZuko’s face froze. He stared straight ahead as the water tribe chief continued.\n“He was thirteen, according to the merchant. Sokka’s age. I was… fascinated.”\nFascinated. Zuko had grown accustomed to this reaction. He’d seen morbid curiosity shining in the eyes of onlookers—who didn’t know the first thing—for years now. His life was a curious exhibition and few could bring themselves to look away.\n“The merchant said that the boy had been exiled and sent to complete an impossible mission. He’d disrespected one of his father’s generals and been ordered to fight a fire duel.” Hakoda shook his head. “But I guess it wasn’t the general he had to fight.”\nThree-year-old horror settled in Zuko’s gut. He did not want to hear this, but he made no move to stop the chief. His throat had sealed shut, and he could only stare forward into the black. Hakoda’s weighted words hung in the air for a moment before dropping like stones into the void.\n“The boy prostrated himself before his father and pledged his loyalty. He refused to fight.”\nZuko’s knees ached from where he’d fallen, hard, on the cold white stones. He remembered just how the desperate pleas had tasted on his tongue—like salt water and bubbling, acrid horror. He had never felt so small.\n“Then the Firelord decreed that the boy would suffer. He reached out a hand as if to wipe away the tears…”\nOh, a great storyteller indeed. Zuko waited for the blow.\n“And he lit his child’s face on fire.”\nSomething strangled rose from Zuko’s throat as Hakoda’s words tore through him like his father’s damning flames. He sucked in a breath and found that his lips were once again damp with salt water. He tasted burning flesh.\nZuko knew the story better than anyone. That scene had replayed through his mind on a torturous loop for three years—but always from his own perspective. Never before had he heard the story from someone else’s mouth. Was this what his uncle had seen that day? His sister? The general he’d insulted?\nIt was devastating; even more so, to think that this boy curled up around his agony—whose screams had long since grown hoarse and whose young body was a spectacle of seeping crimson upon cold, white tiles—would spend the next three years fighting for nothing more than the love of the man who’d done this to him. The air filled with foul, flesh-burning smoke and Zuko wanted to go to the writhing form, to force open the bubbling, mutilated eye and make it see everything that had recently become so obvious. So painfully obvious.\nHis own voice echoed off the walls of the bunker. It was cruel, and it was wrong!\nHakoda was looking at his scar. He was looking straight through it. “I didn’t believe him.”\nZuko looked up. “What?” His voice was hoarse from the child’s screaming.\n“The merchant. Sailors love to exaggerate and spin tales. I refused to believe it.” Hakoda heaved a weighty sigh. “But then Sokka told me you were there, at the Boiling Rock. He said you were on our side. And then I saw you. I saw the scar. And I…”\nHakoda was a brave man, Zuko decided, to be speaking of such things. Very few had ever acknowledged his disfigurement outright—the work of pity, he knew. But Sokka’s father spoke freely of the taboo, and Zuko wasn’t sure if he was relieved or affronted.\nThere was a peculiar weariness in the older man’s face that Zuko had seen many times on his uncle’s. “I’d refused to believe it… but it was all true, wasn’t it?” Hakoda looked to the prince for confirmation. Zuko couldn’t bring himself to nod, and that was answer enough.\n“You were just a kid.” Sokka’s age, Zuko heard.\n“I know.”\n“Your father didn’t deserve your loyalty. And you didn’t deserve what he did to you.”\n“I know.” Zuko ran a hand through his long, unkempt hair, over his mangled stub of an ear. “I told him as much. When I left.”\n“I’m sure he took that well.” So, sarcasm ran in the family. Zuko’s mouth turned upward in morbid amusement.\n“He shot me full of lightning.” Zuko looked down at his fingertips, and with the soft light from the campfire behind them could make out the fading patches of black from where the bolt had entered and exited his body. Sometimes when he lay in bed at night, he could still feel residual tingles and jolts that lay dormant in his chi.\nHakoda quirked an eyebrow. “And you’re still here? When that happened to Aang he… well, died.”\nZuko was still looking at his fingertips. “My uncle taught me how to redirect the lightning. Between my sister and father, I guess he knew I’d need it.” Zuko had been so eager that day on the hilltop to practice with real lightning. He’d been ready. He’d needed practice, and Iroh refused…\n…What, are you crazy?! I’m not going to shoot lightning at you!\nOzai would have, Zuko had thought then—and Ozai did. Shame and regret filled his stomach, and he tasted sick on the back of his throat. Ginseng tea and residual, metallic electricity. So many mistakes.\n“Redirect lightning? I’ve never heard of that before.”\n“Uncle invented it, by studying waterbenders.” How ridiculous the notion had seemed initially, to his closed mind. Zuko now knew it was nothing short of genius.\n“Your uncle, is he still…?” Hakoda treaded lightly. He must have known he’d left the prince raw.\nZuko blinked. “I made a mistake, in Ba Sing Se, and Uncle paid the price. Ask Katara, she’ll tell you all about it.” Chest-crushing guilt masquerading as bitterness. “But he’s alive. He escaped from prison during the eclipse.”\nThere was a hand on Zuko’s shoulder and once he resisted the urge to pull away, it was actually quite comforting. “Your uncle will forgive you.”\nThe uncertainty ate Zuko’s words and stifled him silent. He could not bear the other possibility. Hakoda waited him out.\n“My uncle travelled with me for three years. And I was not the… easiest person to deal with, then.” Angry jerk with a ponytail, Toph had quoted Sokka. “He was the true father to me, and I didn’t appreciate him. The whole time, he knew the truth about my banishment, but he couldn’t tell me because I wouldn’t listen. He just…” Zuko shook his head, baffled. “Supported me. And tried to guide me in the right direction.”\nHakoda’s brow furrowed. “The truth of your banishment?”\nZuko shoulders were heavy. “That my father never intended for me to capture the Avatar. That he favored Azula as his heir and had been looking for an excuse since mom—” He stopped himself, composed himself, breathed. “He was looking for a reason, and speaking out of turn was as good as any.”\nHakoda raised an eyebrow in disbelief. “That was all you did? Speak out of turn?”\nZuko shrugged. “I was foolish and brash. Inexperienced in politics.”\n“You were a child.”\n“You keep saying that,” Zuko noted pointedly.\n“Because it’s true!” Hakoda shook his head, and spoke to himself, “The fate of the world rests on the shoulders of children.”\nZuko gritted his teeth. “We are more than capable—”\n“Believe me,” the chief chuckled humorlessly, “I know. I’m only saddened. It’s a great burden to bear. And you’ve had to bear one heavier than most.”\nSomething flared within the prince. “I don’t want your pity.”\n“Not pity,” Hakoda corrected, turning his whole body to face the boy. “Respect.”\nZuko’s shoulders deflated and both eyes, good and bad, widened slightly. Doubt burned gold in his irises and he stole a glance behind them, across the temple to the group still gathered around the fire. Hakoda seemed to understand.\n“Your mistakes are in the past. You’re righting them, now.”\n“I’m trying to,” Zuko agreed. “But there’s… a lot.”\n“They’ve already welcomed you into their group,” Hakoda pointed out. “They know that you only did all those things because you wanted to go home.”\nZuko paused. Oh. His eyes fell to the side. He couldn’t see Hakoda, but he could feel the pointed, almost disbelieving stare.\n“You haven’t told them?”\nHis answer was quick. “It hasn’t come up.”\n“Not even when you were trying to explain why you were suddenly on their side?”\n“I didn’t want to seem like I was making excuses for my actions. And I didn’t want pity.”\nHakoda hummed. “You are a proud man, Prince Zuko.”\nOne good eyebrow slanted downward, the younger looked up at the older. The chief was certainly not the first to accuse him of that. Usually, that word had come with others—arrogant, selfish, spoiled. But that was then.\nHakoda held up his hand. “I don’t mean that in a bad way. I meant that you are… dignified. Noble.”\nHonorable, he might have said.\nZuko’s face softened, but still the fact remained: “They didn’t need to know.” Sure, joining the group probably would have gone a lot more smoothly if he’d whipped out his sob story, but he’d managed without it. Barely.\n“Even after all those months of chasing and attacking them?”\nZuko’s gut twisted. He bristled. “What, so I owe it to them?” His hands made fists at his side.\n“No,” Hakoda asserted, and Zuko relaxed. “A man’s past is his own business.”\n“Then…?”\n“There are other reasons to do things besides necessity or obligation.”\nZuko absorbed this, methodically. “What are you saying?”\nThe chief studied him. “I’m sure you know by now that when you came here, you weren’t just signing on as Aang’s firebending teacher. From what I can tell, there’s a lot more that goes with being a part of their group.\"\n“They’re really close,” Zuko agreed. He’d ridiculed them for that, when he was chasing them. Always letting their emotions interfere. Weakness, his father would have said.\nZuko knew now it was their greatest strength.\n“My son is a warrior,” Hakoda began, “and in the watertribe, we warriors are like brothers. We trust that the other will follow our lead. We trust that the other will fight bravely. And we look out for one another.” A knowing smile plays at the chief’s mouth. “That’s exactly what I saw you two doing at the Boiling Rock. To Sokka, you’re a fellow warrior now.” He let that settle, then added, “A brother.\"\nZuko felt that soft smile on his lips again.\n“And Aang,” Hakoda continued, “Well you’ve heard him talk about all the friends he had from all over the world, before the war.” A word drifted to Zuko from months ago, unconsciousness lingering around the edges of the name Kuzon…\n\nDo you think we could have been friends, too?\n\n“Zuko, you’re not just Aang’s teacher, but a friend—and from what Katara’s told me, since the kid never had a family, he takes friendship very seriously. Look at how he’s stuck by my children.” Hakoda glanced back at the group around the fire. The group sat laughing. “Now, the earthbender… I don’t know her very well. But it seems to me that she’s found in you a partner in crime.”\nHakoda’s argument had begun to take shape, but there was one piece quite notably missing.\n“And Katara?” It was a vulnerable question, Zuko knew. Doubt colored her name.\nHakoda gave a wry smile. “She’s been giving you a hard time, huh?”\n“She still blames me.”\n“Zuko, my daughter is…” A heavy sigh. “When we lost Kya, Katara stepped up. She’s fiercely protective of her family, and this…” he gestured around them, “is her family. Not just Sokka, but Aang and Toph, too. Up until recently, you’ve always been a threat to that. She doesn’t take that lightly.”\nIn the darkness before them, the prince saw light rippling off a pond. That’s what mothers are like, Zuko…\n“I was with Katara for quite a while after Ba Sing Se,” Hakoda continued. “I watched her heal Aang. It was a… tense time. This war has taken its toll on everyone.”\n\n…every time I pictured the face of the enemy…\n\nZuko’s blackened fingertips drifted to his disfigured eye. “She needed someone to blame. I understand.”\nThere was a hand on his arm, suddenly. Calloused and firm and sympathetic. Hakoda moved Zuko’s hand away from the scar—he wanted the boy to look at him. “My daughter is protective and she can certainly hold a grudge,” Hakoda guaranteed, “but she is also a healer at heart; she helps those who need her. And she always wants to believe the best in people, although the war’s made her a bit more like Sokka.” The father gave a light chuckle. “She’ll forgive you, in time. But even until then, you are still a part of her family. She, and all of them, care about you.” Hakoda’s eyes were bright blue even in the low light—like water, calm and reassuring. “They would want to understand.”\nZuko didn’t know how to tell the chief that he couldn’t tell that story—that in the three years he’d carried this mark, he’d never once found the words to describe that day in the arena. He’d never had to. It was his story to keep locked inside.\nBut there were words, he knew. There were always words, but he would not speak them.\n\nI begged for mercy and he was my father and I wouldn’t do it and he branded me like a—\n\nZuko was years older and wiser, now. He understood all of what the boy shaking at his father’s feet could not. But even now, that boy was still inside him, tearing at bandages that blocked the world and crying, Father, is that you?\nHe’d only just heard the story told for the first time tonight. He wasn’t ready yet to hear it from his own mouth.\n“I’m not a very good storyteller,” he told Hakoda instead.\nThe chief waved a hand dismissively. “You don’t have to be. What happened that day shaped you into the man you are now—one way or another, they would just want to know. They’re your family now. They care.\"\nPrivately, Zuko made his decision. After the war, he vowed, after the world is saved. He realized (as that soft smile found a home on his lips once again) that he wanted them to know. Understanding was an enticing offer.\n“You remind me of my uncle, Chief Hakoda. He always knew what to say.”\nA grin. “I’ll take that as a compliment. I’d like to meet this Uncle Iroh of yours, once this whole mess is over.”\n“Hopefully he’ll be Firelord Iroh by then,” Zuko mused.\nA frown touched Hakoda’s lips. “You aren’t going to take the throne?”\n“My uncle is the rightful heir.” If Lu Ten hadn’t died and Ozai hadn’t suggested and Azulon hadn’t ordered and Ursa hadn’t loved her son enough to…\n“You don’t want to be Firelord?”\nSomehow, Hakoda knew just how to cut right to the heart of Zuko’s inner struggle. Maybe it was a father’s skill—Ozai had known, too, but he’d wielded that knowledge as a weapon. Where Zuko’s father had sought to tear him apart, Hakoda sought to mend.\nMaybe that was why the chief reminded Zuko of his uncle.\nZuko looked down at his hands. There was warmth in his fingertips, seeking a way out. He allowed a small flame to dance in the open air and stared, entranced, at its movement. “I try not to think about it.”\n“Because you don’t think you’re ready?” The little flame cast light on Hakoda’s curious expression.\nZuko closed his fist around the fire. “Because it’s a distraction. Right now I need to focus on training Aang so he has at least a chance at ending the war. What happens afterward…” He shook his head. “We’ll worry about that once my father’s dead.”\nPerhaps Hakoda was surprised by this—that would explain the sharp intake of breath that the chief couldn’t quite hide. Perhaps he was horrified that a son could speak so callously of his father’s death, no matter past abuse. Perhaps, when he caught Zuko’s shoulder and turned square to face him, Hakoda was expecting bloodlust in the boy’s eyes.\nPerhaps he was relieved to find sadness instead.\nZuko shuddered and pulled away. It was easier to face the pitch-black void than Hakoda’s searching, liquid gaze.\n“You don’t want him to die.”\nThe prince’s heart sent up a shield of flames. “He deserves it.”\n“And you deserve a father that wouldn’t sear half your face off. That’s not what I meant.”\nWere all men of the Water Tribe this blunt?\n“He needs to be stopped. This is the only way.”\n“But if it were up to you—”\n“It’s not up to me!” A flaming fist collided with the concrete, the impact resonating up Zuko’s arm. He grimaced. “My father is responsible for the death of thousands—he’s made his bed. There is no choice involved here. The Firelord has to be taken out.”\n“But…” Hakoda prompted, and Zuko sighed.\n“I know what needs to be done, but I’m not happy about it.” His hand ached. Dormant electricity prickled up his spine.\n“That’s because you are a good son, Prince Zuko.”\nAnd oh, what a tragic compliment.\n“Don’t think it will interfere with how I train Aang,” came Zuko’s steely promise. “I won’t hesitate to show him how to… do what he needs to do.” He was not looking forward to having that conversation with a twelve-year-old, pacifist monk.\n“You’re allowed to be sad, you know.”\n“I know.” His voice was barely a whisper. “But that’s for afterward.”\nAfterward, alone, at the graveside. Once the world was saved.\n“He wasn’t always evil, you know.” Zuko flicked a piece of loose stone into the ravine. He did not hear it land. “Our family was happy, once.” There was a hand on his shoulder that wasn’t Hakoda’s—it was bigger, warmer, and ghostly. There had been laughter, before the burning screams. Azula had liked to make sandcastles.\n“Pride and power can do terrible things to a man,” Hakoda nodded. “Some are more easily corrupted than others.”\n“I think it runs in the family.” From Sozin to Azulon to Ozai to…\nHakoda must have anticipated that train of thought. “You’re not your father, Zuko.”\n“Sozin was good once, too. And I’ve chosen the wrong path many times before.”\n“No.” Hakoda’s mouth was pressed into a firm line. “You were deliberately misguided, but never corrupted.”\n“You don’t kn—”\n“Your presence here is all the proof I need.”\n\nFrom Roku to Rina to Ursa to Zuko.\n\n“The crown still has a long and bloody history.”\nHakoda quirked an eyebrow. “The crown is only as good as the man who’s wearing it. Firelord Ozai has had to grab for power because he cannot earn respect. Instead, he relies on fear. That’s no leader—there’s no honor in that.”\nPerhaps, cried a little voice in Zuko’s head, that’s why he tried so hard to steal yours.\n“Your men respect you, Chief Hakoda.” A reasonable assumption. “And you’re so sure of yourself. But I can barely figure out my own path—how can I expect others to follow?” His eyes were wide with doubt and he looked to Hakoda for answers.\n“You’ve had to struggle. But you have found your path now, and you did it on your own. Your people will respect you all the more for that.” The chief gave a small smile. There was a proud hand on Zuko’s back, real this time. “You will be an honorable leader, Prince Zuko. History will look fondly on you.”\nZuko’s inner fire breathed with him, swelled, and calmed.\n“C’mon,” the chief encouraged, giving Zuko’s shoulder a final pat and standing up from the edge of the ravine. “Let’s go join the others at the fire. It’s getting cold over here.” Hakoda offered his arm to help Zuko up.\nThe prince accepted it with wry smile. “You’re from the South Pole! I didn’t know you could get cold.”\n“But in the South Pole we have parkas,” Hakoda noted, “not Fire Nation prison uniforms. And I’m freezing.” The chief turned to walk toward the others. Blinking, Zuko reached out to stop him.\n“Uh, I…” He scratched the back of his head. “Thank you.”\nHakoda simply grinned. “You stopped my son from trying to break me out of prison on a flying bison. Consider us even.”\nWith that, they walk back toward the fire, their friends and their family. Zuko found a place near Sokka, who grinned and held up his favorite weapon.\n“Zuko! You just missed it! I was just telling Suki, Toph, and Chit Sang all about when boomerang and I kicked your butt the first time we met.”\nToph punched him in the arm.“I’d love to have been there for that one.”\n“Yeah, and then there was that time with the pirates…!”\nZuko looked around the fire, closed his eyes, and smiled softly."
}