{
    "id": "11047995",
    "url": "https://archiveofourown.org/works/11047995?view_full_work=true",
    "author": [
        "geoffaree"
    ],
    "title": "Amethyst",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [],
    "characters": [
        "Harry Potter",
        "Petunia Evans Dursley",
        "Vernon Dursley",
        "Dudley Dursley",
        "Various Snakes"
    ],
    "additional_tags": [
        "Pre-Hogwarts",
        "Alternate Universe",
        "Parseltongue"
    ],
    "language": "English",
    "series": "Part 1 of A Very Slytherin Harry",
    "published": "2017-05-30",
    "completed": "2017-06-03",
    "words": "18,434",
    "chapters": "2/2",
    "comments": "539",
    "kudos": "10,403",
    "bookmarks": "1,160",
    "hits": "141,389",
    "summary": "<p>A lonely eight year old Harry Potter learns he can talk to snakes, shaping future events in a way not many would have expected.</p>",
    "notes": "<p>This is the first half of part one in a series. These parts will be pre-Hogwarts, and the next in the series should be first year. I hope you enjoy what I've written so far.</p>\n<p>I know it's probably obvious, because you guys are pretty smart, but I'll say this just in case: Most italicized sentences and words are going to mean that it's Parseltongue being spoken. You should be able to tell anyway from context what is and isn't but there's the heads up anyway. Thank you.</p>\n<p>And a thank you to <a href=\"https://archiveofourown.org/users/HopingFor/profile\" rel=\"nofollow\">HopingFor</a> for looking over this for me!</p>\n<p>Very kindly beta read by <a href=\"https://archiveofourown.org/users/a_stands_for/pseuds/a_stands_for\" rel=\"nofollow\">a_stands_for</a></p>",
    "text": "Harry James Potter (of Number Four Privet Drive, Little Whinging, Surrey) was a very lonely boy. He did not have any friends at school, due in part to his innate shyness, but mostly because his cousin Dudley would beat up any children that would try to make friends with him. Harry had not tried too hard to connect with the rest of the kids in his class after the first time his cousin had given Harry a black eye and then smashed the toy trucks of the boy who had dared to ask him to play.\nHarry didn't want other people to hurt because of him, and he didn't want to get hurt because of other people's kindness. It was easier to avoid the conflict altogether. So Harry Potter would spend most of his free school time hiding in the library, or behind the kitchen building. It smelled pretty bad back there because of the dumpsters, but was also mostly free of other people, so Harry would make do. \nSometimes there would be mice that scuttled around, looking for scraps. And once, there had been a grass snake that slithered in from the empty lot next door to snatch up a fat little gray mouse that was too distracted by a glob of peanut butter on the ground to notice the predator slinking silently towards it. Harry watched with wide green eyes as the snake reared up a few inches before snapping down on the hapless mouse in a lightning quick strike.\n“Wow.” He whispered, hugging his knees where he sat on an old milk crate, pushed up against the side of the building. “You're so fast.”\nThe snake was busy swallowing the mouse, but turned its dark eyes on Harry in an unnerving fashion, as if he was next to be snatched up and gobbled down in a single bite.\nThey stared at each other for a few moments, as the snake continued to swallow the mouse until it was able to fully close its mouth and then it bobbed its shiny green head at Harry and hissed.\n“Thank you, human, though the rodent was no challenge. Tasty morsel, in any case.”\nHarry just stared at it, mouth gaping, until the snake bobbed again and slithered away back to the empty lot, a noticeable lump along its sleek body. Harry stared after it, unblinking, until he could no longer see the snake. He wondered if he had imagined the whole thing, if his hungry stomach was playing tricks on his mind. Dudley had taken his lunch tray that day, pushing him down for good measure. He'd not had time to eat breakfast after cooking it for his relatives and cleaning the dishes while they ate, before it was time to leave for school. Yeah, it was probably just the hunger playing tricks.\nA bell rang above his head, making Harry jump. Lunch was over, it was time to get back to class. It was the last week of school before the summer holidays, which Harry did not really care for. Not that he particularly liked school either, but it at least got him away from the Dursleys for a few hours of the day. \nHe still had to deal with Dudley, yes, but he'd gotten quite good at avoiding the larger boy. When summer came, he'd have nowhere to really hide. Not to mention the increase in chores he would be expected to take up, so that he would not be a lazy, good for nothing burden, as his Uncle Vernon was fond of calling him. Along with Boy and Freak.\nHarry trudged his way back to class, putting the snake incident to the back of his mind. It was where he kept the rest of weird, freakish, things that tended to happen to him. The ones that made his Aunt Petunia purse her lips into a thin, angry line and his Uncle turn varying shades of puce.\nThe things that usually ended with him in his cupboard for extended periods of time with minimal food and water. \nYes, Harry would forget about the snake. Besides, how many talking snakes could there really be in the world anyway? He doubted he'd come across any more.\n~~~~~~~&gt;\nWith summer came the expected increased workload. Harry was turning eight in a few weeks, which Aunt Petunia took to mean he could handle all the gardening on his own now. So while Dudley laid about, eating ice lollies and playing games with his friends, Harry spent hours in the hot sun, weeding and pruning and planting and whatever else his aunt told him to do.\nIt was hard work and his hands soon got blisters and splinters from the tools. He'd not been able to find any gloves in the shed. The hurts usually healed up quickly enough, though, sometimes even overnight. Which was another freakish thing he never mentioned to his aunt. Even though it was freaky healing, it was still freaky. Harry still remembered the punishment he'd gotten for turning his teacher's hair blue, though how his aunt knew he'd been the one to accidentally do that, he'd never know. Harry had just been thinking that Mrs. Jones had been wearing way too much makeup that day and looked kind of like a clown, that all she needed was a funny wig, and suddenly her hair had burst into a vibrant sapphire perm.\nThe class had giggled loudly as Mrs. Jones scrambled for a mirror in confusion. Dudley had wasted no time telling his mother about the incident, laughing between words and not noticing the way Aunt Petunia’s mouth got thinner and her eyes trained sharply on Harry, anger in every line of her being. \nYeah, that had been a bad few weeks. Harry did not want a repeat of it.\nSo he did his work and didn't complain about the heat or the blisters that healed quicker than normal. He snuck drinks from the hose when he could and on his birthday, just for once, he even crept into the empty kitchen and stole one of Dudley's ice lollies.\nHe slurped it quickly, in the bushes by the back fence. It was grape flavored, cold, and wonderful. Harry hummed happy birthday to himself while he carefully buried the wooden stick in the soil of the hydrangea bushes he was supposed to be pruning. \nIt was a sweltering day out, so Dudley would most likely stay inside the cool of the house and not bother Harry while he worked. Which was more than fine with him. Between the lifted lolly and presumed solitude, it was shaping up to be one of his better birthdays. \nHe didn't even care when a snake slithered in through a crack in the boards of the back fence. It was a grass snake again, a different one, though how he knew that Harry had no clue.\nFeeling a bit adventurous after his successful theft, Harry bent forward a little and whispered a greeting at the serpent now basking in the grass by the bushes.\n“Hullo there, Mr. Snake.”\nThe snake trained its beady eyes on Harry, lifting its head a couple inches off the grass and tasting the air with a bright red flick of tongue. Harry was starting to feel a little foolish, sitting there on his knees in the dirt, talking to a snake, when it spoke back.\n“Hello, human, it has been a long time since I, or my kin, have spoken with one of your kind.\nHarry grinned, bending down closer so that he was nearly lying on the grass with the snake.\n“Why? Do you not like talking to people?” he asked, curious. The snake hissed a negative, bobbing its green head a little and tasting the air again.\n“No, human. Not many know our language, or care to learn.”\n“My name is Harry.” he told the snake, who he was pretty sure was male, “Do you mean I'm speaking a different language right now? It sounds like English to me.”\nThe snake bobbed its head again, hissing, in what Harry was sure was a laughing kind of way.\n“You are a special hatchling, human-Harry. It would be wise to use this gift.”\n“Just Harry, please,” he said, then impulsively, “Can I pet you?”\nThe Dursleys didn't have pets, unless you counted the goldfish Dudley killed because he forgot to feed them. Or his Aunt Marge’s bulldogs that she let chase Harry around the yard and up the tree to avoid the vicious snapping teeth while the rest of the family laughed.\nHarry did not count those.\nThe snake flicked his tongue in and out a few times before bobbing his head in a gracious manner. \n“Very well, human-just-Harry. I will allow the privilege, though not too hard.”\nHarry nodded eagerly, not bothering to correct the snake on his name again, lest he end up with an even longer title, and lowered himself fully onto the ground.\nHe carefully reached out and ran tentative fingers along the smooth scales of the snake’s back. It was warm from the sun and dry. The snake lowered his head back to the grass and closed its eyes while Harry continued to run a gentle hand down its body, over and over. The snake hissed in a contented fashion and Harry grinned harder.\nThis was definitely the best birthday he’d ever had.\n~~~~~~~&gt;\nThe summer continued in much the same fashion for the next couple weeks. Harry cooked breakfast for his aunt and uncle while Dudley slept in, sneaking bites of scrambled eggs or beans as he did so. Next, whatever inside chores his aunt decided he needed to do before sending him out to garden. Harry didn’t mind the gardening so much anymore. His hands had toughened a bit so he no longer got blisters from the tools, and there really wasn’t that much upkeep that needed doing once he’d got the bulk of the pre-summer weeding done. Not that he told his aunt as much. No, he spent most of his outside time pretending to prune the bushes and manage the grass, when really he was talking to whichever snake had shown up that day.\nWord seemed to have spread that he could, and enjoyed, talking to snakes. So every day one or two would show up for a chat, or a good petting in the sun. It was mostly grass snakes, though a couple sleek vipers had come by. Harry had been extra polite to them, though they promised not to bite, hissing laughs at his nervous pats down their spotted sides.\nOne time there had even been a large, albino python, who said his name was Monty with a long-suffering, hissing sigh. He had escaped from his humans for the afternoon to see what all the fuss was about: apparently, he was acquaintances with the snake that Harry had met on his birthday. Monty also seemed to like escaping his humans often.\n“To keep them alert,” he hissed to Harry, as the boy ran a hand down his long pale body. “Plus, they always feed me the good mice when I show up again.” Harry snickered as Monty winked a pink eye at him.\nHarry figured Monty didn't really mind his humans so much, but did like to stretch his scales every once in a while.\nMonty was the only snake Harry had met so far with a name. Snakes didn’t really seem to need them, relying more on scent to tell others apart, or just not caring too much either way. The grass snake from Harry’s birthday, though, did consent to let Harry name him, since he kept coming back for chats (and pets). It had taken nearly a whole afternoon, but they finally settled on Alex. Alex the snake seemed to like how the ‘x’ sounded at the end of the name.\nThe snakes mostly talked about the best places to get mice or sunbathe or where the best spot for nesting was. Harry learned a lot more than he wanted to about serpent mating rituals and how to tell the strongest males and more fertile females than he ever really wanted to. Monty, however, mostly talked to him about Doctor Who; his humans apparently had the tapes and watched them on a loop.\nSometimes he had to shoo the snakes away, if his aunt came to check on his work, or Dudley and his smaller-than-Dudley-but-still-bigger-than-Harry friends came to taunt him. On one occasion, one of the viper ladies offered to bite him for Harry, “Though no promises on eating the lump, I doubt there is any snake big enough for that task.”\nHarry had politely declined, though admittedly with a bit of hesitation. Dudley had lumbered back into the house after a few minutes anyway, yelling for ice cream and fizzy drinks.\nIt was towards the tail end of August that a different kind of snake showed up. It was just after noon, Harry having been banished to the garden about an hour ago to hang up the laundry, trim the hedges, and weed the roses. School would be starting up again soon, and Aunt Petunia wanted to get as much work out of Harry as she could. He’d snuck a piece of buttered toast with his bits of egg that morning, so he was feeling pretty good when the dark grey and red-spotted serpent slithered over the grass straight at Harry.\nThe snake stopped about a few paces from the laundry basket, where Harry was pulling out wet sheets to hang up to dry.\n“Hello, pretty,” he greeted, stretching as far he could to clip the fabric to the line. The snake was pretty. Not just a dark grey as he’d thought at first glance, but also a dark green, with red and orange speckles like fire sparks across her scales. He’d never seen a snake like her before, not in his aunt’s yard, nor the book he’d checked out from the library and hidden under the cot in his cupboard. \nIt was definitely a her, her swollen belly looking like an overstuffed sausage. It was a wonder she could move at all, let alone as smooth and swiftly as she’d crossed the grass. Harry quickly finished pinning up the last sheet and knelt down on the warm grass in front of her.\n“Little wizard, I require your assistance.” She had a regal sounding hiss, but Harry could hear the weariness in it.\nHarry stared at the very pregnant serpent. She had red and orange eyes, slitted in either tiredness or pain, or just because the sun seemed to be extra bright that day, Harry didn’t know. \n“Wizard? What--?” Harry stuttered. The snake glared at him.\n“Yes, little wizard. You reek of magic, do not think you can hide it from one such as I.”\nHarry sniffed himself in what he hoped was a surreptitious manner, but knew it fell far short. \n“Magic? Is that what I can do? Magic is real?”\nThe snake hissed at him in exasperation, showing a very sharp set of fangs as she did so. Harry fought the urge to move the laundry basket between them.\n“Of course, what did you think it was? Have you not started your training? This whole area stinks of magic.” Harry continued to stare at her for a moment; she had risen as far up as her swollen midsection would allow and was glaring again, if she’d even stopped in the first place.\n“Erm, right. How-- How can I help you then?” he asked, hoping to lessen her glare, or at least his chances of getting bitten by those deadly looking fangs.\n“As you can see, little wizard,” she bobbed her dark head at her belly, “I am very close to my time.”\nHarry gulped, afraid he knew where this was going.\n“Ah, well, the grass snakes say the creek has some nice soft dirt to dig a nest into,” he said, pointing in the direction of the little park the creek ran through, a block or so over. “Would you like me to carry you over there?” He could probably make it there and back without his aunt noticing; it was time for her stories right about now.\nThe snake hissed a sharp negative.\n“No. I need a fire nest, not a water nest.”\n“Fire?!” Harry nearly yelped, covering his mouth a second later, but fortunately no noises emerged from the house. He stared back at the snake, who bobbed her head. \n“Fire. Wizard fire.\" She gave a pained hiss. “Quickly! Or my brood and I shall perish.”\nHarry jumped up at her command, grabbing at his mess of black hair in panic. Fire? He didn’t know how to make fire! He didn’t even know that what he had was magic until five minutes ago, when the snake told him. Which, in hindsight, was a pretty big giveaway. \n“Little wizard!\"\n“Right! Fire, just a second, I’ll be right back!” Harry rushed to the little shed, looking around frantically.\nThere! Under a nearly empty bag of fertilizer was a large, metal wash basin. Harry pulled it out, grabbed a bag of lawn clippings that he’d planned to drag to the curb the next morning, and emptied the bag’s contents into the basin for some cushioning and a fuel source.\n“Is this okay?” he asked after he had lugged the big basin back out to the snake. She stretched her dark head up over the rim and glared down at the bed of dead plants.\n“Yes, fine,” she hissed. “If you would be so kind, lift me inside--carefully--and then start the fire.” Harry hesitated a moment, grabbing his hair again, probably leaving behind grass clippings.\n“Are you sure it won’t hurt you?”\nHarry had not known it was possible for snakes to roll their eyes, “Right. Magic.”\nHe knelt down and carefully scooped up the heavy serpent, mindful of the soft bulges. She was really heavy for his underfed, eight year old arms, but he managed it with as much dignity as he could. She slithered her dark swollen body onto the soft bed of grass and stared up at him.\n“Good. Now the fire, little wizard.”\nHarry gulped again, and not knowing what else to do, held his hands over the basin and thought really hard about heat and flames and that one time Dudley had knocked the frying pan out of Harry’s hand and splashed grease all over the hob and Harry’s shoulder. He remembered the burning smell and the fear and the anger that had surged through him. \n FWOOSH.\nThe grass in the basin lit up in a bright burst of orange and red flames. Harry fell back with a hiss, checking his hands, but they were fine. He looked back at the basin; the fire was bright, but he could see a dark shape wriggling in it.\nHe didn’t hear any cries of pain or screams for help, so he figured she was fine. He watched the fire and the smoke rising from it, hoping that the neighbors wouldn’t notice and his aunt wouldn’t feel the need to suddenly come check on him and find Harry starting fires like the little freak he was. He didn’t really want to imagine what the punishment for that would be. Harry hugged his middle, feeling the ribs under the too big shirt and the bruise where Dudley had kicked him as he was coming out of his cupboard that morning. He hadn’t been expecting his cousin to be up so early. Harry would need to pay closer attention. \nHe looked back at the basin. The fire seemed to be dying down, but also giving off purple, green, and blue sparks. Harry hoped that was normal for a magical fire serpent birth. He wondered if he should get anything for the snake and her babies. What did baby snakes eat? What did magic baby snakes eat? Before Harry could work himself into even more of a panic, the last of the flames died out, leaving only the occasional bright spark shooting out over the lip every now and then. Harry peered into it, being mindful of the hot metal.\nThe lady snake was coiled around a pile of pale ash colored eggs, looking relieved and much less like an overstuffed sausage. Harry grinned brightly.\n“Congratulations!” he told her. “How many did you have?”\nShe hissed a contented sigh, eyes half lidded as she rested on her clutch. “Fifteen.”\nHarry whistled, unsure if that was normal or not for her species, magical snakes not being covered in his library encyclopedia. She hissed her agreement, so he figured it was good.\n“Do you need anything?” he asked.\n“Privacy, and darkness if possible. It will be a few hours before they hatch.”\n“That soon?” Magic sure sped things up, “I can put you guys in the shed, it’s nice and dark and no one but me ever goes in there. I can check on you again later.”\n“Acceptable,” was her sleepy reply.\nHarry carefully touched the basin, and finding it cool enough, began dragging it back to the little shed. It left a bit of a soot streak on the lawn, but a quick spray from the hose would fix that. Plus no one ever really came into the back anyway. Harry carefully maneuvered the basin into its previous corner, draping a spare bit of cloth over the top, just in case. He hissed a promise to be back in a few hours.\n~~~~~~~&gt;\nThe rest of the afternoon passed in a sort of slow haze. He finished up the pruning and weeding just as Aunt Petunia called for him to bring the laundry in. He did his best to wash the dirt and soot off his hands and arms before carefully unpinning the sheets and folding them into the basket. His aunt then had him hoover the stairs and mop the kitchen before allowing him a cheese sandwich and some tap water. He thanked her and went to clean the bathrooms before starting the dinner prep, which was mostly cutting the vegetables for roasting before his aunt booted him back outside to water the roses. He did so quickly so he could dash around back to check on the snakes before his uncle was due home.\nHarry snuck into the shed, closing the door behind him and creeping quietly to the basin.\n“Hullo?” he hissed quietly, not wanting to wake the babies if they were hatched.\n“Little wizard,” she answered, serenely, “You arrived just in time, come look.”\nHarry carefully lifted away the cloth. It was dim in the shed, but there was enough light filtering through a dirty window to see by. The mother snake was coiled loosely around her clutch of wriggling eggs. Harry watched, wide eyed, as little noses started poking through the thin, ash colored shells. The first one to flop out was a shockingly bright shade of green. It yawned, showing sharp needle teeth. It was so tiny and cute, Harry wanted to reach out and stroke its little jewel bright body with his finger.\n“Careful, little wizard, that one is highly venomous and won’t know yet not to bite,” she chided, looking down at her baby with motherly pride.\nThe next one out was mostly ash colored, with eyes red as hot coals. There was another green one, though a shade darker and with a few red stripes circling its tail. Next came a couple with the same dark coloring as their mother, then three more ashy ones. An albino with bright blue eyes slipped out of its egg, along with two rust red snakes that started immediately racing each other around the soot lined basin, much to the amusement of their mother.\nAn orange and red spotted one was next, followed by a pitch black baby with eyes like cut onyx. Then a dark green with ash gray stripes down its entire length.\nThe last one took a while to emerge, and Harry feared the worst. The mother snake must have felt the same because she let out a relieved hiss when the egg finally started to wriggle and a dark nose struggled to poke through.\n“Come on, little guy, you can do it,” Harry hissed encouragingly, as the tiny snake managed to poke his head through the opening and let gravity help with pulling him the rest of the way free from his soft prison.\nThis one was a green so dark it was almost black, with random swirls of purple scales up and down its length, like fireworks or constellations. The eyes, when they opened, were also purple, like amethysts. This one was secretly Harry’s favorite.\n“Hi,” he hissed quietly at it, not sure if the snake could even comprehend him at such a young age. It yawned at him, showing off needle teeth and a purple forked tongue. Harry giggled.\n“They are all so beautiful,\" he told the mother snake, smiling happily at her. “You’re very lucky.” He didn’t say anything about the ache in his own heart when he thought about the mother he never got a chance to know. Or the deep longing he had for a family to love, not one that treated him like dirt on their boots at best. \nAs she stared at him with her red and orange eyes, it almost seemed like they glowed with an inner fire. For all he knew, they really did. The little snakes were wriggling all over the bottom of the basin now, getting soot all over their egg-goopy bodies and mother. She didn’t seem to mind so much. The littlest one was just starting to get the hang of the slithering thing, wriggling determinedly up the line of his mother’s closest coil and following it to its logical conclusion to squirm right up under her jaw and curl up for what looked to be a good nap. Harry grinned, wishing he had a camera.\n“You can stay as long as you need to,” Harry said, wanting to stay in the shed for the next eternity but knowing he’d need to get back to the house soon to help with dinner. “Do you need anything? Food? Water? Er... fire?”\n“Just rest for now, little wizard. Perhaps tomorrow you can find me a nice mouse or toad.” Harry nodded, looking at the babies in various states of exhaustion already.\n“And them?” She shook her head slightly, careful not to disturb the hatchling under her chin.\n“The magic from the birthing fire will sustain them long enough.” Harry nodded again.\n“Okay, I need to get back to the house now, I’ll see you tomorrow.” He waited for her hiss of approval before pulling the cloth back over the basin and wishing them a warm and safe night.\nHe hurried back into the house, with just enough time to wash up and finish helping with dinner. Harry had a feeling, this time next year, he might be in charge of the whole meal, like he was breakfast and the gardening. Even that thought wasn’t enough to keep the happy little grin off his face as he thought of the family of snakes. Though he had schooled his face into its normal impassive mask by the time the table was set, inside he felt truly warm for the first time he could ever remember.\n~~~~~~~&gt;\nThe next few days were hectic, what with snake care and dodging Aunt Petunia when she tried to give him even more chores. One afternoon he spent stuck with Mrs. Figg, from down the street, while his aunt took Dudley for some school shopping. Harry wished he could go back to Number Four and spend time with the snakes, but Mrs. Figg had roped him into looking at endless cat photo albums again. She did give him a stale cranberry scone to go with his weak tea, though, so that was nice.\nThe snakes were growing so fast; it had only been a few days and already they were big enough to wrap around his wrist twice. He knew this because the little dark green and purple one had slithered right into his hand when Harry had asked. Harry had tiny wrists, so that wasn’t really saying much, but with fifteen of them, plus the mother, they were quickly outgrowing the basin.\nHe’d managed to catch a couple toads at the creek that ran through the park down the street, for which the mother was very grateful. Though Harry knew she would have preferred a mouse, Aunt Petunia kept such a meticulous house that no mouse would dare step a paw within a mile of the place.\nThe snakes were also learning to talk very rapidly too. Harry liked to just sit there and listen to them hissing at each other, with their sibling bickering and boasting that one could definitely outrace the other, or bragging about who had the most venomous bite. Harry was almost roped into gathering up fifteen frogs, just to see who could kill the swiftest, before their mother settled them down with a few firm swipes of her tail.\nSome of them let Harry pick them up, while others shied away; he didn’t press them any further. The little green and purple guy was always up for a cuddle. His mother even let Harry carry him around the shed (carefully cupped in his hands and wrapped once around his wrist) to show him all the weird human stuff in there. He was boundlessly curious about everything and asked endless questions about shovels (Why would you need a hole bigger than you can wriggle out for yourself?) and buckets (is this where you sleep?) and pruning shears (why not just bite the plants into submission?)\nHarry was going to miss them when they left. He knew they couldn’t stay forever, as much as he’d love that. They had to move on to safer pastures, away from humans. The mother snake had told Harry a little about the wizard that she had escaped from; he was not a very nice man. He didn’t care for the animals in his charge. only about what profits he could eke out of them. Apparently, she didn’t even know what breed she was. She was already pregnant when she escaped, her instincts kicking in as she got closer to term to inform her that she needed some magic fire to complete the process with any hope of survival for her or her babies. It wouldn’t have been such a problem if she had stayed near other wizards; she could have snuck into a fireplace. But in her haste to escape, she’d become too separated from the magical world to find her way back in time.\n“Then I came across a grass snake that mentioned a human child that talked to him regularly, and here we are. I was very fortunate to have found you. Snake language is very rare among wizard kind, not even my old keeper had it.”\nHarry had sat rapt through the whole tale, little green/purple snoozing coiled warmly in his cupped palms. \n“Wow,\" he hissed reverently, rubbing an absent thumb over his baby snake’s sleeping head. “I would never have been able to do that. Escape like that.”\n“You underestimate your own strength, little wizard,” she hissed back, coiling tighter about her sleeping children.\nShe had been there nearly two weeks. School would be starting in two days, which meant they were no longer safe in the shed. Aunt Petunia might take it upon herself to do some gardening while Harry was away at school. The babies were big enough to travel, if the constant complaining about being stuck in the metal basin was anything to go by. They would be leaving in the morning and Harry did not know how he would be able to stand it. He clutched little green/purple close, savoring those last few moments they would have. He knew he would never see any of them again, knew it was safer for them away from people. But oh, how Harry wished he could turn into a snake himself and join them. Life would be so much simpler. He would never have to see the Dursleys again. Never be smacked over the head, or hit with a belt or denied food on a whim. \nHarry knew a pipe dream when he saw one, though. He would just have to buck up and wish them all happy, long lives filled with fat mice and sunny rocks. Maybe Harry could learn to control this magic stuff and find his own escape. Yeah, he could do that. Nodding his head firmly, he carefully placed green/purple back amongst his brothers and sisters. He was filled with a new determination. He would get free of the Dursleys, find his escape, and maybe even find a new family at the end of it, too.\n“Thank you,” he hissed, roughly wiping the tears away from under his glasses. She didn’t say anything, just bobbed her head in a little nod as he pulled the cloth over the basin for the last time.\nHe was done crying. It was time to start planning.\n~~~~~~~&gt;\nThe next morning, Harry rushed through making breakfast and his inside chores. Aunt Petunia didn’t say anything about it, so neither did Harry.\nHe headed outside, making a pretense of watering the roses while his aunt watched from the window. As soon as she left for her stories, Harry made his way to the shed. The hissing was so excited that it sounded like a leaky water heater. Harry peeked under the cloth at the family of snakes, all wriggling excitedly and staring up at Harry with their jewel eyes and hissing happy greetings. Harry felt his heart clench but forced a bright grin.\n“Hey guys. You ready for the big day?” A chorus of affirmative, happy hisses floated up at him from the basin. “Okay, just like we planned. I’m going to drag you over to the back fence where there’s a nice gap and you guys are all gonna escape unseen. Free and clear, got it?”\n“Yesss!”\n“Okay.” Harry dropped the cloth before the hotness behind his eye turned into tears and started dragging the heavy basin out into the back garden.\nIt was a lot harder this time around, due to the sheer mass of snakes filling it, but he determinedly trudged on until he reached the hydrangea bushes that hid the snake hole. He slipped off the cloth and grinned weakly as the babies got their first real look at the sky. He was happy for them, he really was, but why did it have to hurt so much?\nMother snake started corralling her offspring out of the basin. A few were somewhat reluctant to leave the only home they had ever known, but she got them all out eventually. Strangely, little green/purple was the last one out. Harry would have thought he’d be the first to wriggle over the edge into freedom and a new world full of things to discover. But he paused when he touched down on the grass, his mother following him out. He kept looking from his nestmates huddled together under the bushes to Harry, kneeling on the grass and trying not to cry, before finally looking up at his mother.\nHe hissed out a confused noise that wasn’t any real word, but seemed to convey its meaning to his mother all the same. She dipped her head down to his level, hissing softly in a sad tone.\n“Are you sure, little one?” she asked, and he nodded, amethyst eyes glinting in the sunlight. \nHarry just kneeled there, confused, until she slithered smoothly over to him, rearing up high enough to look him in the eye as well.\n“I must ask one last favor of you, little wizard.” Her voice was stern, commanding, like the first time she had spoken to him. Harry nodded, still confused.\n“I ask that you take this little one, my littlest one, as your familiar. To keep with you forever more, to protect and be protected by, to share your life and magic and love.”\n“Wha--” Harry stammered, not comprehending what was happening, feeling dangerously close to the tears that he’d promised himself he wouldn’t shed.\n“Do you swear to do this, for me?” She paused, and a warmth drove past the sternness in her reptilian gaze. Harry looked from her, down to the little snake on the ground, and back, hardly daring to hope but finding it difficult to stop himself from doing so.\nHe nodded, the heart in his throat making it hard to speak.\n“I swear,” he managed after a few moments. She leaned forward and rested the flat of her dark head against his. Harry felt the little snake slither over one of his hands on the ground and wind his way up under the sleeve of his oversized hand-me-down shirt, until he lay draped across Harry’s bony shoulders, feeling like the world’s warmest necklace. Mother snake pulled away, hissing a final goodbye to her smallest and the little wizard that saved her and her clutch from certain death. \n“Goodbye,” Harry hissed after her, unable to stop a few tears from falling despite his vow. He and little green/purple watched the family of snakes disappear one by one through the fence, knowing they would never see them again but wishing them good fortune and long lives.\nHarry brought up a hand to stroke his new familiar’s tiny scaly head as the last flick of dark tail disappeared.\n“Come on, I’ll show you where I sleep,\" he said, standing up and grabbing the depressingly light basin to drag back to the shed. “And we’ll need to give you a name.”\nHarry had been afraid to name any of the mother snake’s brood, fearing the pain it would cause when they left, but now? Now Harry didn’t have to worry about that. They were together forever, wizard and familiar, his first friend, his only real family now. They would make it out of here.\nTogether.\n“Frank?”\n“No.”\n“Jason?”\n“No.”\n“Steven?”\n“Hmm, no.”\nHarry sighed, laying on his back and staring up at the underside of the stairs. His little snake was coiled on his chest, beneath his oversized jumper. He occasionally flicked his purple tongue out to taste the air or tickle Harry’s chin.\nIt had been a few weeks since the others had left, and school had started back up. They had yet to be able to settle on a name. At first Harry had tried to think of something clever and regal sounding, like Algernon or Julius. The snake had considered Emerson briefly before bobbing his head in a negative. They had moved on to more common names, each met with a hissed no or flick of tongue or wriggle of displeasure.\nHarry didn't really mind too much, names were important and he was glad his snake was giving it thought. But at the same time, Harry was running out of suggestions.\nThe snake uncoiled from his collarbone and slithered down and out of the bottom of Harry’s jumper, making the boy squirm as he tried to hold in the ticklish giggles. It was late and he didn't want to wake his relatives. \nIt was usually pretty dark in the cupboard, but Harry had pulled the little chain that dangled over his cot so they were bathed in a dim light. He watched his familiar slither around the pile of clothes that took up most of the shallower part of the cupboard, where the stairs sloped too low for even Harry to sit comfortably. The snake had been steadily growing larger every day, now long enough to coil three times around his wrist. Harry worried about how big he would get and how he was supposed to hide him from the Dursleys if he ended up the size of Monty.\nFor now it was easy to carry the little guy around in his pocket or draped across his shoulders under the baggy folds of his hand-me-downs. Harry liked carrying him around, answering hissed questions about chalkboards or pencils or why that girl’s hair had shiny things in it and could Harry put shiny things in his hair? \nHarry had a hard time holding in his giggles and got the feeling his classmates were avoiding him even more now. Not just for fear of Dudley, but because he kept hissing to himself and grinning at odd times.\nHis snake popped a dark green head out from under a hideous orange and brown sock and flicked his tongue at Harry, purple eyes glinting in the dim light.\n“I do not like any of these names.” He hissed as grumpily as it was possible for a baby snake to do. “We should ask Alex for help.”\nHarry grinned, knowing it was just an excuse to see the bigger grass snake. Alex the snake had visited a couple times while Harry was hiding out in the back garden to work on his school assignments away from Dudley's cheating eyes. Also, so his snake could get some exercise by slithering around under the bushes chasing bugs and asking questions about passing cars or why the sky was so big. Harry didn't know much about cars or the sky, but they had been learning about different types of clouds that week, so he talked about that instead.\nAlex had slipped in through the fence for the first time after the baby snake’s arrival while Harry was laying back on the grass, his snake coiled on his belly as they both tried to find shapes in the clouds. Harry thought one looked kind of like a lumpy hippo, but his familiar mostly saw frogs.\n“Greetings, human-just-Harry,” Alex said, slithering up and presenting his long body for the customary pats. Harry gave them happily, even as his little serpent rushed under his shirt with an alarmed hiss.\n“Hullo, Alex,” he said, stroking the warm scales as his familiar poked a curious head out to look at the older snake, flicking a taste out of the air.\n“Who is that?” his snake asked, getting over his startle quickly as curiosity took over, as it so often did. “He’s so big.”\nAlex seemed to preen at the attention, flexing his long body. Harry snorted and fished the snake out of his shirt so they could be properly acquainted. Alex seemed to approve of the tiny guy and Harry let them chat about snake things while he finished his spelling assignment.\nHis snake seemed fascinated by the stories of mouse hunts and grass fields. Harry felt guilty about having to keep the baby snake cooped up so much, but at least they were cooped up together. He had promised it wouldn’t be forever, that they would figure something out. It might take a long time, but Harry knew they'd make good their escape eventually. \nBack in their cupboard, Harry shook his head. “Alex left to find a good nesting place for winter, he won't be back for a long time,” Harry reminded his friend. The weather was rapidly cooling as September neared its end and fall started showing its colors. His snake slumped down on the sock pile dejectedly.\n“How about Jack?” Harry suggested, in an effort to distract the little guy.\nHis snake lifted back up a little, “Maybe...” he hissed uncertainty.\nHarry thought hard. “What about Jax?” he tried. “It has an ‘x’ in it, like Alex”\nThat did the trick, and his little snake bobbed excitedly. “Yes! Yes, I will be Jax.”\nHarry grinned, sitting forward a little and offering his palm for the newly christened Jax to wriggle onto. He cupped the warm body with both hands and brought him up to eye level.\n“Hullo, Jax, it's nice to meet you.”\nJax licked Harry’s nose with a forked tongue, making him giggle softly.\nHe was happy. Even though they were stuck in a cupboard and the future was so uncertain. He knew they had each other, and magic, and love. It was enough for now, Harry thought as he reached up to pull the little chain and bathe them in darkness once more. Jax slipped up his sleeve to settle back on Harry’s collarbone where it was nice and warm.\n“Goodnight, Harry,” Jax sleepily hissed through a yawn.\n“Goodnight, Jax.” He laid a hand over the coiled bundle under his shirt, taking comfort and giving warmth. They would make it, he swore, as he did every night. They would survive this and escape and live happy and free.\n~~~~~~~&gt;\nThe weeks passed swiftly after that, autumn with its colorful leaves and sweet air making way for barren trees and a sharp chill.\nHarry worried about Jax as winter approached. Snakes and cold weather did not generally mix very well. But Jax seemed to be holding up alright, if a bit listlessly.\nHarry, after much trial and error (and no less than three burned up shirts) had figured out how to warm up his clothes and ratty blanket with magic. It was hard at first, and left him nearly as sleepy as Jax, but he managed eventually to be able to reliably heat the large front pocket of a pullover and have it last most of the day, so that Jax would have a comfortable place to sleep while Harry went about his day.\nIt was good for Harry too, he was used to his baggy, holey clothes not keeping him warm at all. It was nice to not be shivering while he wandered around the schoolyard, avoiding Dudley and his friends. He used the magic on his too-big shoes also, and wriggled his toasty feet happily.\nJax seemed to stop growing as the weather turned colder, which Harry was thankful for, as his snake was long enough now to wrap his green and purple body around his waist. Harry doubted even Dudley’s oversized hand-me-downs would be enough to hide Jax from curious eyes if he grew much bigger. \nAt least he didn't eat too much; Harry had been worried about that, too. He barely got enough himself, though it was better now that he was at school and could almost always count on a filling, if not very tasty, lunch. As long as he avoided Dudley and his gang, anyway. But Jax was happy enough with a whole egg every few days, snuck into his pocket while he made breakfast. It was too cold for the toads to be out now, and Harry doubted Jax was ready for one of those yet anyway. So eggs it was, along with whatever spiders were dumb enough to hang around the cupboard. Jax liked to chase the tiny scuttling forms around the small space and snatch them up, which was fine with Harry. He was tired of picking cobwebs out of his messy hair.\n“Harry?” Jax poked his head out of the magically warmed pocket, looking up at him with purple eyes that shone brightly in the weak winter light. There was a splash of purple scales scattered like freckles across his snout.\n“Yes? Are you cold? Do you need me to do the warming thing again?” Jax shook his dark head.\n“When will it stop being cold all the time?” he asked sleepily. Harry got the feeling he didn't like napping so often and not being able to explore as much.\n“Just a few more months, not long,” Harry promised, rubbing a thumb over the dark scales between his eyes. “It's almost Christmas holidays, I promise we can go to the park then.”\nJax hissed contentedly, withdrawing back into the warmth of Harry’s pocket as the bell chimed the end of break. Harry felt him settle into the start of another long nap and gave the pocket a soft pat.\n~~~~~~~&gt;\nChristmas that year was just the same as the previous ones, with Dudley getting showered in gifts and sweets and snatching all the best biscuits out of the tin on the table. Harry usually spent the day stewing in a jealous funk as he was made to clean up all the wrappings and mess while his cousin taunted him with all his shiny new toys.\nThis year though, as Dudley was tearing into his mountain of boxes while his aunt and uncle looked on indulgently, Harry slipped from the house with Jax secure in his pocket. The park wasn't too far from Number Four, but it was a cold morning and Harry had to put the warming magic on not only his pullover and shoes, but also his lumpy knit cap and trousers.\nIt was getting easier to do each time and Harry hardly felt tired at all by the time he finished.\n“You ready for the park, Jax?” he asked, sticking his hands into the warm pocket to stroke the snake. Jax nudged his hand in affirmative.\nThe park was mostly empty, everyone being at home with their families. Harry didn't mind, it meant he got the swings to himself, with no one to push him around or into a snowdrift for a laugh. Jax came out of the pocket for brief periods to look around curiously at all the frosted bushes and trees and brittle, dead grass. He flicked his forked tongue out frequently to taste the brisk air and even demanded at one point to be put down so he could feel the snow on his scales.\nThat didn't last long. Harry laughed at the indignant hisses Jax was throwing at the frozen ground.\n“Snow is awful, why can't it be warm all the time?” he demanded, slithering not into the pocket but up and under Harry’s collar and wrapping himself around like a shivering, scaly scarf. Harry pet him, laughing again.\n“It is in some places, far away,” he said, walking towards the empty swing set and brushing the snow off of the best one before sitting down and starting a gentle sway.\n“We should go to one of those places. When we leave. I don't like the cold.”\n“Okay,” Harry agreed easily, swinging higher. He didn't mind the cold, but he didn't particularly enjoy it either.\nAs he reached the top of his highest swing, a silly feeling came over him about how nice it would be to fly. Then he could go anywhere with no problem. The thought made him laugh and let go of the chain to sail through the air and pretend, for a few seconds at least, that he could. Harry seemed to hang for a long time in the air, laughing as he landed far more gently than expected.\nJax hissed that snakes were creatures of the ground, not air. Harry just smiled and patted the scaly head poking out of the v-neck of his pullover, like an angry brooch.\n“Let's head back before Aunt Petunia notices we've been gone so long and makes me scrub the toilets.”\nJax grumbled but agreed, slinking back into the shirt with a snakey yawn.\nHarry hummed Christmas jingles as they made their way back to the house. The sun was higher in the sky now, nearing noon. Harry hadn't meant for them to be out so long, but couldn't bring himself to regret it.\nAunt Petunia had noticed, judging by the sour look on her face when Harry tried to slip in quietly.\n“And just where have you been, boy?” she demanded. Harry looked down, shrinking away from her sharp tone.\n“I just went for a walk, Aunt Petunia, sorry.”\nShe was silent for so long that Harry chanced a glance up. His aunt did not look happy, but not like she was gonna smack him or shove him into his cupboard. Just stared down at him sternly for a moment longer before snorting through her horsey nose and pointing to the kitchen.\n“Go clean up the breakfast things.”\nHarry scarpered before she changed her mind. There were even a good amount of leftovers he was able to scavenge. All told, it hadn’t been too bad a Christmas after all.\n~~~~~~~&gt;\nWinter slowly passed, and Harry got into the habit of taking walks more and more often. His aunt, surprisingly, didn’t tell him off for it. He figured she was happy enough to not have to see him for most of the day that she didn’t even give him extra chores to do as the days grew warmer and spring approached.\nJax liked the walks, especially when the snow had melted and he was able to slither around on the muddy paths next to Harry and explore all the strange sights (as long as there were no other people around to see him.) Jax still wasn’t growing much bigger, staying slender enough to easily fit in Harry’s front pocket, or sometimes coiled in his hood so the serpent could look up at the sky or ride across Harry’s shoulders, slipping into the hood at the first sign of trouble. \nJax also seemed to have inherited his mother’s gift for sniffing out magic. He sometimes would pop his head up and flick out his tongue before hissing excitedly at a house, or a big stray cat, or one time even an old beat-up kettle in an ally. Harry had wanted to pick it up to see what was so magical about it, but Jax hissed at him that he didn’t like the smell, like something might happen if they touched it. Harry left it alone.\nApparently, Mrs. Figg’s house smelled of magic too, which Harry found fascinating and he no longer dreaded being sent there while the rest of the family went to the cinema or dinner or any number of things that definitely did not include Harry.\n“It’s strange here,” Jax would say, hiding from the many cats by coiling around Harry’s right arm under his baggy jumper, the little wedge of his snake head resting over his shoulder as Harry sipped weak tea and watched Mrs. Figg nap on a fur covered chair. “I can smell magic, but it’s stale.”\n“Is she a witch, do you think?” Harry hissed quietly back, nudging a too friendly cat away with his shoe.\n“No...” Jax answered slowly, “It’s strongest over by the fireplace.”\nHarry set down his tea and quietly crept over to the old fashioned wood-burning fireplace (carefully avoiding stepping on any cat tails or squeaky mice.) It wasn’t lit right now but had a pile of ashes around the grate. The mantle was covered in kitschy knick-knacks of dancing ceramic cats and little touristy things like a miniature Eiffel Tower and a replica of the Great Pyramid. There was even a snow globe with a castle in it that Harry shook, watching the glitter of fake snow swirl and settle on the towers and grounds.\n“That smells magical,” Jax flicked at the globe, “But just barely.”\nHarry looked closer at the little castle, turning it in his hands. For a second the flakes seemed to change color into a swirling rainbow before fading back to white. Harry smiled, placing it carefully back on the mantle next to a black cat in a top hat. There was also a little jar of glittering powder that made Jax sneeze, so Harry swiftly replaced the lid. He was about to go explore one of the bookcases when Mrs. Figg gave a snort and startled herself awake. Jax disappeared back under the shirt.\n“Oh, dear. Must have dozed off.” She smiled at Harry as he sat back down on the cat covered sofa. “How terribly rude of me, would you like some more tea? And perhaps a couple biscuits.” She winked. “It’ll be our little secret.”\n“Thank you, Mrs. Figg,” he said, nibbling at a chocolate biscuit that was very dry, but better after he dipped it in the tea. Mrs. Figg puttered around, feeding the cats and subjecting Harry to her newest album of fuzzy pictures.\n~~~~~~~&gt;\nHarry and Jax explored further and further each day, as the weather turned from cold and wet, to warmer but still quite wet. Sometimes they followed Jax’s magic radar, but mostly they just picked a random direction and started walking. Harry had also been working on doing other magic things, besides warming his clothes and regrowing his hair after Aunt Petunia would try and shave it all off in disgust at its messiness. \nHe hadn’t meant to grow it back overnight, and his aunt had been furious when he’d come out of his cupboard to start breakfast with his dark tufts stubbornly intact. It had earned him a week in his cupboard, during which Harry used the time to try and learn the trick of it. He had snuck in a pair of safety scissors from an unused craft set in Dudley’s second bedroom, and would fill the long hours between bathroom breaks or being let out for school by cutting a dark chunk of hair off and trying to will it to grow back. It took a lot of concentration and energy, but eventually Harry managed it by thinking of the ivy that crept up so quickly over the school buildings. By the end of the week there was a sock filled with little dark tufts and an exhausted, but satisfied, Harry.\nJax had not liked being stuck in the cupboard so long, after getting used to the long walks and fresh air. But Harry tried to keep his spirits up by making silly plans about what they would do and where they would go when they escaped for good. He talked about warm beaches and tropical jungles and endless fields of fat mice and slow toads.\n“And lots of eggs?” Jax hissed eagerly, coiled warmly on Harry’s stomach, “I like eggs.”\n“All the eggs you can eat.”\nIt was nice to dream about, but Harry knew it would be a long time before they could really do anything. Harry was too young, was small for his age, and knew very little of how the world really worked. He knew the Dursleys weren’t very nice, that they withheld food for dumb reasons and sometimes hit him to make a point. But they did put a roof over his head and let him go to primary school, as they often reminded Harry.\nHe knew that if he and Jax left now, just started one of their walks and never looked back, that it would not end well. Yes, the weather was turning warmer, but it wouldn’t last. They had no money to buy food or shelter, and Harry did not want to live on the streets. They needed to be smart about leaving, needed to find a way to scrounge up some funds, to plan out where to go and how to get there and what to do when they did. Harry needed to work on his magic; it was all well and good to be able to keep them warm and to make his hair grow, but to survive out there, he knew they would need more. \nSo they would wait, and go to school and learn about the world. They would have their walks and explore as far as his little feet would take him. Harry would learn new tricks, like being able to cup some dim light in his palms and even managing to shrink his ratty shoes to fit better. The shrinking thing was iffy at best, hard to control and impossible to reverse, as evidenced by the myriad of tiny socks that now littered his cupboard.\nSoon it was summer again, with Harry and Jax spending as much of it as possible away from Number Four. His aunt tasked him with the gardening again, but he was able to get it done quickly and slink off before she assigned him more chores. The longer days meant they could venture further afield than ever before. Jax was even able to catch his first mouse, sneaking silently up on the tiny rodent and snapping at it with lightning speed. Harry congratulated his friend, fascinated by how quickly the lump disappeared down.\n“I got it!” he hissed proudly.\n“You were so fast, it never saw you coming.” Harry crouched down to pet his snake fondly as Jax preened. “You’re a great hunter now.”\n~~~~~~~&gt;\nOne day, towards the end of June, they got on a bus (paying with change scrounged from the sofa cushions) to a neighboring village. It was thrilling being in a new place, where nobody knew him as the delinquent nephew. He pulled his cap down further, just in case, as they made their way around the village square. Jax was coiled into a cargo pocket of his shorts, because it was too warm out for the pullover and he didn’t want to draw too much attention to himself by having a snake ride around on his shoulders. Jax was almost too big for the pocket, but seemed to enjoy sticking his little wedge of a head out and watching all the people go by.\n“What’s that?” he hissed. Harry looked over to see a massive dog on a lead, as the guy holding the other end struggled to keep from stumbling at the eager pulls of the hound. The guy didn’t seem to mind though, laughing as it paused to sniff at flowers or to accept pets from passing strangers.\nHarry didn’t really care for dogs as a rule, too many times being chased around and bitten by his Aunt Marge’s little monsters, but that one seemed friendly enough.\n“A dog,” he answered as Jax scented the air, still staring with his glinting purple eyes.\n“It’s as big as Dudley!” he exclaimed. Harry snorted.\n“Nothing’s as big as Dudley.” Jax let out a hissing laugh and looked away from the hound.\n“Let’s go that way, I think I smell some magic.”\n“Really?” Harry perked up, following his snake’s hissing directions until they came across a mostly empty side street. The stores here were all antique shops and tiny tea houses. Harry could see little old ladies nursing cups at dainty tables, while the smell of fresh baked scones made his tummy growl in a familiar way that he ignored with ease.\n“That way, it’s getting stronger.” Harry continued down the street, where there was a secondhand bookshop with dusty windows and an empty storefront followed by a clothes shop that seemed to specialize in flower dresses.\n“There!” Harry didn’t really need the direction, because he had just spotted what was unmistakably a magical storefront. It had baskets overflowing with weird looking things by the door, little signs saying “Beetle Eyes, 3 knuts a scoop” and “Yarrow Root, 1 sickle a pound.” In the window were display jars of crushed plants and weird floating things, all neatly labeled. Hanging above the door was an old fashioned wooden sign with a mortar and pestle next to what looked like a smoking cauldron. It read: JACOBI APOTHECARY across the top in bright green letters that were starting to flake a little, with: QUALITY BREWING SUPPLIES AND POTIONS MADE TO ORDER, in a smaller script along the bottom.\nThe few people that walked by didn’t seem to think it strange, their eyes sliding from the tea shop on one side to the clothier on the other. Not one of them spared a glance at the little sandwich board on the sidewalk exclaiming: “Today’s special! Powdered Dragon Bone, 16 sickles an oz.” It must not have been a very good deal, because everyone seemed to just walk on by.\nHarry was just gathering his courage to approach the shop when he spotted a woman in a funny looking teal dress, almost like a robe, as if she forgot to get dressed before leaving the house. She made her way determinedly into the apothecary, and making up his mind quickly, Harry followed in behind her.\n“It smells weird in here,” Jax hissed softly, as Harry looked around the dim interior at all the jars sitting neatly on the shelves, with little baggies and scoops next to each one. It did smell strange, a bit musty and like a million different flowers. It wasn’t a bad smell, just different.\nThere was a man behind the counter, talking to the lady he had followed in. He was tall, even if everyone seemed tall to Harry. He had short brown hair, cut close to his scalp, and was also wearing robes, though his were a nice dark blue. Harry walked further into the shop before he was noticed, reading labels on the jars as he went.\nScarab wings. Horklump juice. Aconite. Dandelion root. Peacock feathers. Boomslang skin. It went on and on. Along the back wall there were various cauldrons stacked high: iron, silver, pewter and even crystal ones in varying sizes. There were stirring rods and sharp looking knives, scales for measuring and endless rows of empty vials in every shape and size imaginable.\n“Wow...” Harry hissed quietly to Jax. The snake was reaching his head up to peer into one of the little pewter cauldrons on the floor, and bobbed in agreement. Harry made his way over to a tall bookcase that had been squeezed into a corner and was filled to bursting with titles like Potioneering and You: A Guide to Not Blowing Yourself to Bits, and Dragon’s Blood: Twelve Uses Explained. Harry carefully extracted a copy of The Beginners Guide to Potions and began to flip through it. Jax slithered out of his pocket and up to drape over Harry’s shoulders to better see the book.\n“Look here, this one cures boils, and this one lets you change shape into someone else.” The book was fascinating, it had little pictures of ingredients and the effects of taking them. Some of the drawings even moved.\nHarry and Jax lost track of time, pouring over the book and trying to figure out what some of the weird ingredients were. Harry was so completely distracted that he didn’t even hear the approaching footsteps until the man spoke.\n“Enjoy potions do you, kid?”\nHarry jumped, dropping the book and spinning around. Jax had risen up on his shoulder and was hissing threats and showing off his sharp fangs. The man held up his hands in a placating manner, eyeing Jax warily but giving Harry a bit of a grin despite it all. Harry backed up a few paces; he didn’t trust adults, not even ones that ran magic potions shops and smiled at cursing snakes.\n“Whoa there, little guy. No harm meant.” Harry eyed him until his easy grin faltered a bit. “Would you mind calling off the snake? I fear I’m all out of antivenom at the moment and I doubt I’d live long enough to brew a batch if your fierce little protector decided to snack on me.”\n“What’s he saying? Should I bite him? I’ll bite him for you, no problem,” Jax hissed, not taking his amethyst eyes off the man. Harry shook his head after a moment and reached up a hand to stroke along Jax’s tail.\n“No. It’s fine, Jax. You can calm down, maybe he’ll tell us more about magic if you play nice,” Harry hissed softly, still stoking the agitated snake. Jax let out a final warning hiss before settling back down, but he didn’t take his eyes off the man, who was now grinning again.\n“Many thanks. I’m Mr. Jacobi, by the way, owner and proprietor of this little establishment,” he said, sweeping his arms up in an all-encompassing manner. “And who might you, and your scary friend, be?”\nHarry hesitated before answering. “Evan,” he said eventually, thinking of his mother’s maiden name, not wanting to trust this stranger with his real one. “This is Jax.” He pet his snake again.\n“A pleasure to meet you both.” He paused, looking contemplative. “If you don’t mind me asking, where are your parents? Surely they must be worried by you running off.”\n“They’re around,” Harry answered hastily, and before the man could ask anything else, “Are you a wizard?”\nMr. Jacobi laughed. It was a nice sound and Harry got the feeling he wasn’t being laughed at for asking a silly question, but that Mr. Jacobi just liked to laugh. It made Harry relax a bit more.\n“Indeed I am, Evan. Have you always been able to talk to snakes?” Mr. Jacobi asked, eyeing Jax again.\nHarry shrugged and nodded, “Can you talk to snakes too?”\n“Oh no, that is a rare gift, you should feel special to have it.” He paused again. “Though many other wizards might see it as a Dark gift, I don’t believe that myself. A language can’t be evil in and of itself, just what one chooses to do with it.” He nodded at Jax, laying docile across Harry’s shoulders and smiled.\nFeeling brave, he asked, “Can you teach me magic? I can work for it, sweep up or cook or something.” This was his chance; if he could learn real magic, from another wizard, he’d be able to escape the Dursleys much sooner.\nMr. Jacobi chuckled. “Too eager to wait for Hogwarts? How old are you? Six? Seven?” \n“I’ll be nine in a month,” Harry bristled, sensitive about his small stature, “What’s Hogwarts?”\nMr. Jacobi nodded to himself, as if Harry’s answer confirmed something for him.\n“Hogwarts is a school for magic. Went there myself; Ravenclaw. Your parents must be muggles I take it, non-magical people,” he said, forestalling Harry’s question. “No wonder you came wandering in here all by your lonesome, muggles can’t see past the wards.” He gestured around again, and Harry just nodded along, letting him make assumptions.\n“Where’s Hogwarts? Can I go there?” A magic school sounded amazing; he could learn so much and Dudley wouldn’t be there to beat him up or chase off any potential friends. Maybe there would be other kids who could talk to snakes.\n“Oh, I’m sure you’ll get your letter, Evan. First years start at eleven, though, so I’m afraid you have a bit of a wait ahead of you.” \nHarry slumped. Two years, that was such a long time. Mr. Jacobi looked down at him for a silent moment before letting out a little sigh.\n“Tell you what, Evan. I was never one to deny a search for knowledge. So let's say you come back here a couple times a week, do some sweepin’ and whatnot, and I'll tell ya all about magic,” he said, running a hand over the fuzz on his head, “S’long as your parents say it’s fine, yeah?”\nHarry nodded eagerly, daring to let the warm feeling of hope rise up in him. He hastily picked up his dropped book and held it up to the man.\n“Can you show me how to make real magic potions?”\nMr. Jacobi laughed again and reached down like he was gonna pat Harry on the head, but a hiss from Jax made him change direction and grab the book instead.\n“Perhaps,” he said, returning the book to its place on the shelf. “Now how about we have some tea, then you can run along home and I'll see you in a couple days, alright?”\nMr. Jacobi turned then and led them to the front of the shop where he pulled a dented looking kettle from behind the counter along with a couple chipped mugs. Harry watched, fascinated, as the man pulled a thin bit of wood from his sleeve and tapped the kettle, making it whistle.\nHe gave Harry a wink as he flicked the wand again and the kettle floated up to pour steaming water neatly into the mugs.\nHarry vowed to work on the floating thing that night in his cupboard. He wished he didn't have to wait so long to come back, but also did not want to risk being denied by seeming too pushy or eager. He knew from experience that whenever he really wanted something, be it to play with one of Dudley’s toys or an extra piece of toast at breakfast, it was gleefully denied him. And although Mr. Jacobi did not look like the kind of man to kick around kids for fun, Harry wasn’t going to take the chance. So he gratefully accepted the tea, which was much nicer than Mrs. Figg’s, and promised to ask his parents for permission to come back.\nMr. Jacobi sent them on their way as soon as they finished the tea, but with a pocket of ginger newt biscuits and soft admonishment about worrying his parents by being away so long. Harry nodded and put on an ashamed face as he tucked Jax into the pocket that didn't hold the biscuits.\n“Thank you, Mr. Jacobi,” Harry said in his most polite tone, which earned him another wink and a shooing motion.\n“Yeah, yeah. See you around, kid.”\nThe bus ride back to Little Whinging was not nearly as exciting as the one earlier. Not when it was taking them further away from Harry’s first real encounter with other magical people. But he contented himself by hissing at Jax about all the new stuff he'd learned and nibbling on a ginger newt. \n“A school, Jax, just for learning magic. It sounds amazing.”\n“Will there be mice there? Or other magic snakes?” Jax hissed from his pocket. Harry slipped a hand in to stroke the warm scales.\n“I don't see why not,” he answered, kicking his short legs and staring out the window.\n“Do you think it will be warm there?” Jax was curling around his wrist in a snakey hug. Harry tickled under his chin.\n“I hope so.”\n~~~~~~~&gt;\nThe summer passed swifter than Harry would have liked. Now that he had a contact in the magical world, he was loath to give it up for the mundane classes at primary school.\nMr. Jacobi was strange; he laughed too much. Harry didn't really trust people who were overly friendly. People weren't nice to Harry as a rule, so he was hesitant to trust the shop owner too much. So he swept up the dusty stone floors and accepted mugs of tea and biscuits and absorbed as much knowledge of the magical world as he could. He didn't tell Mr. Jacobi his real name and made up stories of his home life when asked. And in return, Mr. Jacobi told him about Hogwarts and magical society. He explained the hierarchy of blood status with a rare sour look on his face. Harry was unsurprised to find out that bullies and prejudice were not unique to the muggle world. \nMr. Jacobi would answer his questions, most of the time, and even lent Harry a book of wizard children's stories that Harry found kind of silly. But he enjoyed the moving pictures as he sat in his cupboard with light cupped in one hand and Jax in his lap, turning the pages with the blunt end of his nose. He didn't dare keep the book for long, afraid of the Dursley’s finding it and punishing him.\nHe’d managed to reach a sort of silent accord with Aunt Petunia, that as long as he cooked breakfast and did his outside chores, she didn’t care what he did with the rest of his day. Out of sight, out of mind. Though he knew if she caught sight of any of his freakishness it would mean missed meals and locked cupboards, maybe even the belt.\nSo Harry read about Babbity Rabbity turning into a bunny and the three brothers who were clever enough to trick Death, at least for a time. Harry liked it when the characters won by being clever. Jax didn't like the rabbit story so much, though.\n“Do you think any of the mice I've eaten were actually witches?” He hissed worriedly, poking at the drawing of the stump in the book. “I don't want to accidentally eat people!”\nHarry ran a soothing hand over his dark scales.\n“Did any of them smell like magic?”\nJax took a moment to think about it, before shaking his head, “No, I don't think so.” Harry scratched under his jaw.\n“Well then, they were probably just regular old mice.”\n“Really?”\n“Absolutely. Just don't eat anything that smells too much like magic and I think you'll be fine.”\nJax gave a relieved sounding hiss and settled down.\nSometimes Mr. Jacobi would let him help with his potion orders, by shredding dandelion roots or measuring out ounces of beetle eyes. Harry enjoyed potions; it was like cooking, but with way more interesting ingredients and results. Once, there was even a shower of purple sparks that erupted from the little crystal cauldron Mr. Jacobi was using. He laughed at Harry’s startled face and waved a calming hand.\n“No worries, Evan, that’s just the spider eggs reacting to unicorn hair, totally normal.” \nHarry gave a weak grin in reply and stepped closer again, watching as Mr. Jacobi stirred in a figure eight pattern a few times, making the potion turn from dark orange to light yellow, like butter creme.\nSometimes the customers would try and talk to Harry as he swept up, wearing a little brown apron and with a blue and bronze handkerchief covering his messy locks. They oohed and awwed and tried to pat his head, calling him adorable and precious with his tiny broom. They usually stopped when Jax would pop out of the apron pocket and hiss creative curses at them.\nMr. Jacobi, along with answering his questions and lending him books, also paid him a few galleons every day he came in to work. The first time he had tossed Harry the coins had led to a conversation about wizarding currency and Gringotts Bank and from there to Diagon Alley in London. It sounded like a fascinating place.\nHe kept the steadily growing pile of galleons in an old sock, shoved to the smallest, darkest corner of his cupboard. They would need funds for their escape and he was glad to be able to start building them.\nOnce, Mr. Jacobi had brought in a bright green snake to the shop. The coloring reminded Harry of one of Jax’s siblings.\n“This is a boomslang, Evan, highly venomous.” He winked, grinning. “Venom that is also highly sought after for certain potions.”\nHarry could see where this was going and raised an eyebrow.\n“If I get her to give you a lot, will you pay me extra today?”\nThat made Mr. Jacobi laugh and pat Harry’s kerchief covered head. Harry mostly didn't mind when he did it now, but only Mr. Jacobi.\n“Oh, it's Slytherin House for you, Evan, no doubt,” he chuckled. “Yeah, I'll give you a nice ten galleon bonus if you can manage it.”\nHarry nodded determinedly, making his way over to the snake tank Mr. Jacobi had levitated onto the workbench in the back room. Jax was already next to it, hissing at the green serpent happily.\nHer coloring reminded him so much of some of the baby snakes that Harry wondered if Jax was maybe part boomslang. He certainly seemed venomous enough.\n“Hi, I'm Harry, how are you?” he hissed softly to her, after climbing up onto a stool.\nThe boomslang stopped eyeing the overly friendly Jax and looked at him.\n“Speaker, what do you want?”\nHer voice was a cold hiss, and Harry got the feeling she was only humoring him because he could truly talk to her.\n“Are you cold? I could warm your tank up for you.”\nShe stared at him some more, beady reptilian eyes unblinking, before slowly bobbing her head in a nod. Harry quickly laid his hands on the warded glass and thought warm things, satisfied when it heated up quickly.\n“My thanks.” She seemed a bit more amiable after that, and they talked about snake things for a while before Harry broached the subject of her venom. She was hesitant at first, but after a few compliments on the shininess of her scales and a promise of a mouse and some warm sand for her tank she agreed to fill a few vials.\nMr. Jacobi had a squeaking box of mice already; apparently the snake breeder had sent it along with the boomslang. Harry dropped one in the tank and watched the bright green blur of serpent make quick work of it. He dropped another on the floor for Jax to chase around. Harry was a bit worried about finding some sand, but Mr. Jacobi just gave him another wink and waved his wand, conjuring a bucket of red sand out of thin air with a muttered spell.\nHarry really wished he had a wand, he bet he could do all sorts of neat things like that effortlessly, instead of having to struggle just to make a pencil hover shakily for a few seconds.\nHarry lugged the bucket of sand back into the workroom as Mr. Jacobi tuned to help a newly arrived customer. It was a bit of an effort to get the bucket up onto a stool and then onto the table, but Harry managed. He carefully shoveled the red sand into the tank with a large metal scoop usually used to measure out insect parts for sale. He sent warm thoughts through every scoopful until the bucket was empty and the boomslang was happily wriggling in the bottom of her travel tank.\n“Ahh, much better, speaker.” She sighed, sleepily. “I suppose I shall fulfill my end of the bargain now.”\nHarry thanked her graciously and grabbed the first of the rubber-topped vials. He’d done this once before, with Jax. Mr. Jacobi had insisted on making an antivenom to keep on hand if there was going to be a snake loose in his store at all hours of the day. Jax had grumbled that he would never bite anyone without permission, and when Harry relayed the message, Mr. Jacobi reminded him of how he’d very well near bitten him when startled that first day. Jax relented and bit the vial as petulantly as a snake could.\nThe boomslang was much quicker about it than Jax had been, obviously used to doing it. Harry wondered how much venom would be considered enough to earn his bonus, before figuring he could probably come out with half a vial and Mr. Jacobi would still pay him. He was kinda soft like that. Either way, Harry ended up with most of three vials full before the boomslang shooed him away so she could nap in her new warm sand. Harry thanked her again as he carefully took the punctured rubber off and corked the last vial, gathering them all up to take to the front.\nMr. Jacobi was just accepting a steaming package of takeaway from a dark skinned wizard with colorfully patterned robes that said PURI’S CURRY across the back in friendly gold script.\n“Yer usual, Jacobi, extra spicy.” \n“Ta, Raj.”\nRaj turned and gave Harry a friendly wink. “Little treat in there for you too, little Evan,” he tapped his large nose before walking over to the hearth in the corner and disappearing in a burst of green fire.\nHarry hurried over to the counter where Mr. Jacobi was dishing up fragrant curry and rice for them both. That was another thing he loved about coming to the apothecary, Mr. Jacobi always gave him a big lunch. Most of the time it was curry, which Harry had never had before but loved from the first taste. Sometimes it was Italian though, which was also good. The treat Raj had mentioned was a little pile of pinni and Harry grabbed one right away, savoring the chewy almond ball. He stashed the rest, after offering some to Mr. Jacobi, in one of his pockets, as a treat for back in his cupboard.\nThe curry was very spicy in the best way, and Harry happily inhaled it quickly in between sips of chilled pumpkin juice that Mr. Jacobi poured for both of them. By now the man was used to the pace that Harry scarfed down his food, and thankfully never asked about it, though he always offered leftovers to him. Harry always declined, his stomach overfull from just the normal portion.\n“I got your venom,” he said, as Mr. Jacobi steadily ate through his lunch, beads of sweat dotting his hairline and his nose a bright red.\nHarry set the vials down on the counter with a satisfied air, feeling he’d done pretty well at negotiating with the serpent. Jax had slithered up Harry’s stool to coil in his lap and flick a tongue out to scent the takeaway remnants, recoiling quickly with a sharp hiss. He’d tried a chunk of chicken once and hadn’t stopped complaining about the heat of the spices for hours. Harry had tried reminding him that he had been literally born in a fire, but Jax would have none of it.\n“Oh, wow, you sure did, kid. That’s twice the yield I usually manage,” he said, chewing on some naan to cool his mouth.\nHarry gave him a rare grin, feeling a warm sense of accomplishment.\n“Do you usually get the venom yourself? Why doesn’t the snake breeder do it?” he asked, curious. The boomslang had spoken little about her home, other than that there were lots of snakes and a couple wizards, and that it wasn’t so bad. Lots of mice to go around and it was always warm.\n“Venom is best fresh,” he answered, before shoveling that last bite of sauce and rice into his mouth. “I usually go down to the breeders to get it, but I figured you’d like a shot at milking one.”\nHarry gave him another small grin; it was nice to be thought of.\n“Now,” Mr. Jacobi said, waving his wand over the food cartons and dirty dishes, banishing the trash and sending the plates and cutlery floating off to wash themselves in the workroom sink. Harry was really jealous of that last part, imagining how much time he could save if his chores did themselves. Then again, Aunt Petunia would probably burn the house down in a rage if she saw the pots and pans scrubbing themselves in her kitchen. “How about I show you how to brew some Dreamless Sleep. I’ll even let you chop up the yarrow root.”\nMr. Jacobi scooped up the vials and led the way into the workroom. Harry eagerly followed with Jax across his shoulders.\n~~~~~~~&gt;\nThe end of summer meant the end of his visits to the apothecary and the start of school. For once, Harry was not happy to return. He would miss the freedom of his exploring and his work at the shop. He felt even more ostracized from his muggle classmates, just knowing how different he was from them, and made even less of an effort to get to know any of the other children. He spent a lot of time in the school’s library, not just avoiding Dudley and his gang, but also trying to find traces of the wizarding world in the mundane texts. He figured normal people couldn’t be so blind as to miss everything. But he found little proof of magic, other than weird unexplained weather phenomena or strange animal sightings.\nAs the weather turned cold again, Jax reverted to his sleepy state, making Harry feel even lonelier. He contented himself by reading the thick texts that Mr. Jacobi had pressed upon him at their last meeting.\n“For those dark winter nights. I’ll see you again next year, Evan.” He had given him a pat on the kerchief that he’d charmed green and silver after the boomslang incident, which Harry learned were Slytherin colors, rather than the Ravenclaw ones he’d been unwittingly sporting before. It seemed to amuse Mr. Jacobi, so Harry didn’t mind the change so much.\nThe books he’d given Harry were a little dry. One seemed to tell an unbiased view of recent wizarding history, while the other was a thick volume on wizard customs and rites, from Lordships and successions and courting customs, to a breakdown of the differences between Noble and Most Ancient houses and those that were just regular Ancient and Noble. It was complete with convoluted family trees and their ties to each other through alliances and marriage.\nIt all sounded very posh and stuffy, but Harry studied the book all the same. He did not want to be caught unawares and make himself out to be a fool. He had even found a tree for the Potters, and had run a finger along the branches with a slightly bitter smile as he imagined what it would have been like to grow up in a wizarding home. One with loving parents who encouraged his thirst for magical knowledge and accepted Harry as he was. \nHe hid the books under the shallow part of the stairs, beneath a pile of oversized jumpers. Though they were mostly free of moving pictures, the texts were obviously non-muggle and Harry did not want to risk his aunt and uncle's wrath were they to be found. So he only read them at night, while the family slept, which was why it took him until nearly Christmas to find out that he was famous. That his parents had not died in a car crash because his father was a drunken fool. That they had sacrificed themselves to fight a great evil, that the scar on his head was from a curse he had no reason to have survived.\nHarry started getting nightmares again; he’d not had any for a couple of years, after coming to terms with the fact that his family would never love him and he should stop agonizing over his failures to get them to. These nightmares were different though, filled with towering dark figures and flashes of terrible green light. Harry would wake up sweating and shaking with Jax hissing worriedly at him, a comforting weight on his chest. Harry would curl up as best he could in the cupboard, holding the serpent close and crying as silently as he could.\nWinter could not end soon enough.\n~~~~~~~&gt;\nSpring came, bringing new light and fresh air. Harry had finished reading the books, had in fact read through them a couple of times. It helped put the knowledge in perspective, like he could read about Harry Potter as if he were some other unfortunate child that had lost his parents and done a great deed he could not even explain or remember. The nightmares lessened to only a couple times a month, rather than nightly. And with the Easter Hols quickly approaching, Harry made the decision that it was time to visit Diagon Alley.\nJax readily agreed, both of them eager to stretch their legs and scales, respectively. So on the second day of break, after he finished up cooking breakfast and quickly did his chores, Harry pocketed a handful of precious galleons from his stash, pulled a green and purple knit cap carefully over his head (he’d mastered the color change charm for the most part, though some things still came out an odd shade of orange now and again,) and wandered over to Mrs. Figg’s house. It was a Tuesday, the day Mrs. Figg set aside to do her shopping and visit with friends in the next village over. It was easy enough to slip into her house, using the spare key under the mat, and steal a pinch of Floo powder from the jar on her mantle.\nHe understood now that the old woman must be a squib, and wondered if it was just coincidence that she lived so close to him. He didn’t think so and it made him leery of spending time with her alone, though he supposed she’d had ample opportunity to do any number of things to him over the years and hadn’t. On the other hand, he was sure she knew about his mistreatment by the Dursleys and did nothing about that either. So he found he didn’t much care for the older woman anymore, despite the number of stale scones and weak cups of tea she’d plied him with over the years.\n“You ready?” he whispered to Jax, who was coiled up in the heated pocket of Harry’s pullover.\n“Let’s do it,” he hissed in excited agreement.\nThey’d never traveled by floo before, but Harry had seen enough witches and wizards (and one memorable time a house elf) do so at the apothecary that he was mostly confident he could do it right.\nHarry tossed the pinch of gritty powder into the cold hearth and said, “Diagon Alley!” as he stepped into the wash of green flames. They tickled for a second before he and Jax were sent spinning like mad through the void for what felt like endless seconds before being spit out onto the wooden floor of a bookstore, covered in soot and feeling a bit queasy.\n“Whoa there, bit of a rough landing lad, let’s get you up, yeah?” Harry found himself being lifted to his feet by a genial sounding wizard in plain gray robes and an apron emblazoned with a fancy looking F&amp;B. He started roughly patting the soot from Harry’s pullover until he was able to pull away with a stuttered thanks. He stuck his hands in his pocket to pat at Jax, who nudged him reassuringly as the clerk eyed him.\n“Where’re your parents, lad? S’not good for someone small as you t’be wandering around by yourself.”\n“I’m off to meet them now,” Harry lied, edging towards what he hoped was the exit. “Gotta get new robes.”\nThe clerk seemed to take this at face value, nodding at Harry’s less than wizardly attire.\n“Off you go then, don’t wanna keep ‘em waitin’ now.” He led Harry helpfully to the exit.\n“No, sir, thank you,” he managed before hurrying off into the crowded street.\nJax poked his head out of the pocket, looking every which way, in much the same manner Harry was doing. There were all kinds of shops, from posh robe shops to second-hand bookstores. Ones selling wizarding supplies and one just for cauldrons. There was a sweet shop and a bakery next to a stall selling shiny trinkets and baubles. Jax slithered out of his pocket and up to Harry’s shoulders to see better. Harry figured it was fine because they passed a witch with a parrot on her shoulder and no one was batting an eye. The Alley was crowded, but for once Harry’s small stature was helping him as he slipped in and out of groups of people crowding around stalls and window displays. Harry stopped at one that a bunch of other children were milling about. There was a broomstick on display in the window and the kids were all talking about Quidditch excitedly. Harry liked Quidditch well enough, from what he’d heard on the wizarding wireless that Mr. Jacobi used to follow his team. Harry wondered what it would be like to fly on a broomstick. Jax decidedly did not. Harry’s shoulders were as far off the ground as he was willing to go, though sometimes he would let Harry float him back and forth in the cupboard for practice. Harry figured he was just humoring his human during those times.\nThey moved on, past an apothecary that Harry would feel guilty going into, before slipping into a second-hand bookstore. It was dusty inside but brightly lit, and oddly enough, had a couple of thin books fluttering around a light fixture like moths. He and Jax browsed the overflowing shelves, Harry pulling volumes down based on title and Jax nudging at the ones that smelled the most interesting.\nHe ended up getting a battered copy of Hogwarts: A History, along with a mostly new looking journal with a deep purple cover that Jax liked the smell of and which had a magic lock that the witch at the counter promised only he could open once she tapped first Harry and then the journal with her wand. He also got a book about magical plants and their uses, but stopped there, because he knew if he bought more there was a higher chance of the Dursleys finding them. He paid six knuts for the lot, which Harry felt was a pretty good deal as he handed over one of his galleons and got change back. The witch had even smiled at Jax and called him handsome, which made the serpent preen when Harry repeated it to him as they left the shop, bag in hand. He made sure to whisper, remembering Mr. Jacobi’s warning about people's preconceptions towards Parselmouths. He understood it better now, knowing about the Dark Lord, but still found it irritating that people could make snap judgements about your supposed morality based on what kind of animal you happened to be able to understand.\nThe next stop they made was to the Magical Menagerie. Harry wanted to see if they could identify what kind of snake Jax was, so they could be better prepared about what to expect as he grew older. Harry doubted he was done growing, that it was more that they were confined to such a small space much of the time that he had halted his growth for the time being. His mother had been much bigger.\nThe Menagerie was filled with all kinds of animals, rats and cats and birds. Harry even saw what looked like a chameleon in one corner rapidly changing colors in a dizzying kaleidoscope of variations.\nThere was a girl in line at the counter already, buying what looked like a metric tonne of magical catnip. Harry got in line behind her, staring at a large tarantula in a terrarium as it scuttled back and forth on hairy legs.\n“Can I help you, young man?”\nHarry jumped, hurrying up to the counter with a flush. The wizard behind it grinned down at him good naturedly.\n“Erm, I have this snake.” He gestured at Jax, who obligingly slithered down onto the counter.\n“So I see.” The man raised an eyebrow and Harry flushed again.\n“I was wondering if you could tell me what species he is?”\nThe wizard nodded, peering closely at Jax for a few moments.\n“Interesting, yes, hmm.” He pulled out his wand and looked to Harry. “If I may?”\nHarry nodded, watching closely as the man whispered a spell, causing a light sprinkling of gold dust to fall on his snake. Jax sneezed and glared up at the wizard, who chuckled. “Apologies, master serpent, it will just take a moment.”\nNo sooner had he finished speaking did the dust turn a dark color and siphon off onto a piece of parchment to form words. Harry couldn’t read them upside down from across the wide counter, but the man hmmed in interest.\n“A curious snake you have here, young man.” He eyed Harry. “Where, pray chance, did you get him?”\nHarry hesitated a moment, but figured it was best to tell the truth (mostly,) if only to make sure he knew what to expect as Jax grew.\n“I found him as his mother was giving birth; it was in a fire, and his egg was a kind of ash color.”\nThe wizard nodded, as if expecting this. “What happened to the mother, and the other snakes?”\nHarry shrugged, “They were gone when I came to check the next day. Jax had been left behind,” he fibbed. “I think it was ‘cause he was a runt and wasn’t strong enough to follow them.”\nJax turned his glare on Harry, who ran a soothing hand down his green and purple scales. The man nodded again, getting out a quill and inkpot to scribble on the parchment.\n“As best I can figure, I’d say he’s a boomslang ashwinder mix, with some extra bits an’ bobs thrown in. No idea how that came about, it’s near impossible to breed ashwinders with anything else, but hey, it’s in the nature of magic to be strange and unpredictable at times.” He finished writing on the parchment and tapped it with his wand to dry the ink, then rolled it up and handed it to Harry.\n“There’s some instructions on care and feeding, though it looks like you’ve been doing a right fine job so far.” He gave Harry an approving nod. “Also some speculation on what to expect as he matures. You can count on a vicious and fast acting venom for sure, so I would highly suggest getting some antivenom brewed up to carry about with you, just in case. Make sure it’s made with his venom, I doubt any run of the mill stuff will work too well with his makeup.” Harry nodded, making a mental note to ask Mr. Jacobi to make some for him, whenever he saw him next, probably not until the summer.\n“As he matures, he might start making little fires now and again, completely natural, so don’t panic, but make sure to keep an eye out so he don’t accidentally burn down the house.” Harry’s eyes widened, looking at Jax and thinking about their very flammable cupboard. Harry made another note to think of ways to suppress fires.\n“Other than that, I think you have yourself quite a fine little serpent.” He chuckled, “Though I doubt he’ll be little too much longer, so make sure you up his food allotment accordingly.”\nHarry nodded a final time, reaching out for Jax to slither back into place across his shoulders. He thanked the wizard, who waved a dismissive hand and wished Harry a fine day. He stuck the rolled up scroll into the bag with his books, planning to copy its contents into the journal so they wouldn’t get lost, and made his way out of the shop.\nHarry checked the time on the large clock that hung over the imposing facade of Gringotts at the end of the Alley. It was nearing three, he needed to get back to Mrs. Figg’s soon if he wanted to beat her home. Harry made his way back to the bookstore he’d fallen out of first and used their floo for the return trip, Jax safely back in his pocket.\nHarry wished he could have stayed out longer, but he didn’t want to risk getting caught. Perhaps during the summer he would be allowed to use Mr. Jacobi’s floo.\n~~~~~~~&gt;\nSpring passed in its usual wet and muddy manner. Harry was sent out to try and wrangle the garden back into order, which he didn’t mind so much now that he’d mastered the warming charms so thoroughly. Alex came to visit a few times; he’d apparently sired a clutch of snakes, though grass snakes were not known for being very parental so he’d not stuck around long after the conception. He did regale Jax with tales of a pond he’d found that was simply overflowing with toads.\nEven Monty came by for a visit as the weather finally turned over to a warmer state. Jax was impressed by Monty’s sheer size and knowledge of Doctor Who, which Jax sometimes liked to listen to while hiding under the sitting room sofa. \nWhen the summer holidays finally came, Harry took the first opportunity he could to bus down to Jacobi’s Apothecary. He’d been feeling so stifled and closed in at the Dursley’s for the winter and spring, like the walls of the perfect little cookie cutter house were collapsing in on him. He liked being at the apothecary, not having to hide his magic or be afraid to ask questions. Harry was extra careful about wearing his handkerchief now though, all too aware of how people might react if they really knew who he was.\nMr. Jacobi welcomed him back with a happy laugh and rough pat on the back.\n“Evan, kid, it’s been too quiet around here without you!”\nHarry gave an honest grin, not even shying away from the pats. It was nice to be back.\nThat summer seemed to fly by at an even quicker pace than previously. Harry turned ten and did not feel much bigger for it. Mr. Jacobi let him help more with making the potions, letting him chop and slice and crush things into powder to his heart's desire. Though he wouldn’t let Harry use the floo by himself, he did let him and Jax accompany him to Diagon a few times when he needed to pick up a delicate piece of equipment or to deliver potions to clients that couldn’t make it all the way to his shop.\nHarry got to fill up on curries again and read the books at the shop all he liked. Mr. Jacobi lent him some more about wizard costumes, handing them over with a strangely melancholic kind of smile. “Best learn up on that stuff now, kid. If you’re heading where I think you are,” he said with a nod at the green and silver kerchief, “it’s better to err on the side of well informed. Some don’t take too kindly to muggleborns, but don’t let that stop you from seeking greatness. ‘Cause for every one that looks down on you, that’s another that won’t see you coming as you walk over them to the top.”\nHarry had nodded seriously, a desire to prove himself burning deep inside of him. He, Harry, would be great. He would escape his disaster of a so-called home, and he would make a name for himself. Not because he was the fabled Boy-Who-Lived, but because he was Harry Potter, and unafraid to do what was necessary to not only survive, but thrive. Even if it had to be just him and Jax against the world, Harry knew they would make it. They had no other choice.\n~~~~~~~&gt;\nSummer ended, as it always did, and Harry looked at the changing leaves with no small amount of dread. It was almost Halloween, the night his parents had died. He’d never known the date before; it made him feel both better and worse. Better, because he could set aside a day to mourn the loss of a life he never had, and worse, because it made the knowledge of their absence that much more real.\nHe spent the night in his cupboard, slowly tracing the names on the family tree from the genealogy book. He wasn’t on it, but his dad was, the name James Potter written in a flowing black script. He followed the connecting branch up to Fleamont and Euphemia, grandparents that he would never know. Harry wondered if they had been nice, if they would have let him sit in their laps and fed him sweets while they told stories of his dad as a child.\nThere was a hot prickling behind his eyes and Harry quickly closed the book, shoving it back into its hiding place. He would not cry.\nHe had a nightmare that night, of course he did, but Jax hissed comforting words to him from his spot coiled protectively in his arms, so it wasn’t all bad.\n~~~~~~~&gt;\nAnother long winter and the cupboard was feeling smaller every day. Harry wondered if he was finally growing, or if it was just cabin fever. Either way, they were both relieved when spring dawned and they were able to once again stretch their legs and scales. Harry had even managed to figure out how to charm his clothes to stay mostly dry in the near constant drizzling, which Jax appreciated as much as Harry did.\nSummer rolled in at its own pace and Harry was happy to be back at the shop, knowing he would very soon be eleven and awaiting his Hogwarts letter eagerly. Mr. Jacobi seemed nearly as excited as he was, going on long tangents about his schooldays and the wonders of the Hogwarts library and potions labs.\n“Though when I went there, it was ‘ol Sluggy teaching.” Mr. Jacobi made a face like he’d stepped in something smelly. “Like a fat spider that man was, always casting nets and gathering hapless students into his webs. I never did try for his Slug Club, preferring to make my own way. I think I did pretty nice if I do say so myself,” he said, looking around proudly at his shop, Harry readily agreed with him, he liked the shop too.\n“I hear Severus Snape is teaching potions now, these past few years.” Another look, like a cross between admiration and irritation. “Man’s a genius at brewing, youngest Master in a century, but a bit on the surly side.”\nHe leaned down to whisper as Harry worked on crushing beetle eyes into a smooth paste, as if they weren’t alone in the shop. “Met him once, at a potioneers conference. I may have been a bit sauced and propositioned him in a less than smooth manner. Never in my life have I been given such a scathingly creative tongue lashing.”\nHarry stared up as Mr. Jacobi laughed like it had been one of the best moments of his life. Adults were weird.\n~~~~~~~&gt;\nDudley’s birthday arrived with the usual fanfare and shower of gifts. Harry was quick to make good his escape from the kitchen, before the paper started flying and Dudley could rub all his new acquisitions in his face. Harry and Jax slipped out the front door just as Uncle Vernon was promising to buy him extra presents while they were out at the zoo. \nHe and Jax spent an enjoyable day at the park, Jax chasing the toads around while Harry tried to skip rocks in the little duck pond, more or less successfully.\nWhen they eventually made their way back, Harry nearly tripped over the large stuffed tiger Dudley had left in the hallway. He could hear his cousin and his friend Piers playing roughly upstairs and so quietly crept into the kitchen to make himself a hasty cheese sandwich. He even dared to steal a bit of frosting off Dudley’s monstrosity of a birthday cake. It was too sweet, but the knowledge that he was taking it from Dudley made it quite bearable.\nA week later, there was a thick envelope mixed in between the bills and advertisements. It was made of a cream colored parchment, with a handwritten address across the front in dark green ink.\nMr H. Potter\nThe Cupboard under the Stairs\n4 Privet Drive\nLittle Whinging\nSurrey "
}