{
    "id": "1104020",
    "url": "https://archiveofourown.org/works/1104020?view_full_work=true",
    "author": [
        "lettered"
    ],
    "title": "He Who Must Not Be Normal",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Draco Malfoy/Harry Potter"
    ],
    "characters": [
        "Harry Potter",
        "Draco Malfoy"
    ],
    "additional_tags": [],
    "language": "English",
    "series": "",
    "published": "2013-12-31",
    "completed": null,
    "words": "40,913",
    "chapters": "1/1",
    "comments": "552",
    "kudos": "13,357",
    "bookmarks": "3,386",
    "hits": "243,633",
    "summary": "<p>Potter has fame and fortune and posh clothes and all he wants is a simple life. Draco has a flat and a cat and a steady job and all he wants is a complicated life. Which makes you think this story has something exciting like body-swapping, but it doesn’t. Instead it has Indian takeaway and a blue jumper and people wanting a whole lot of what they can’t have, discovering themselves as they discover each other.</p>",
    "notes": "<p><b>Content/Enticements: </b> anal sex, blow jobs, dirty talk, verbal humiliation, scar kink, reference to self-harm, mental instability, PTSD, substance abuse, social class, self-invention, self-image, public perception, anonymity, self-image, fame, mundanity, normality<br><b>Author's Notes: </b> So much thanks that it’s actually impossible to convey all of it to L, who beta’ed like a fiend. She is brilliant, and all mistakes are mine. Also I have no idea how to express the wealth of gratitude I have for the mods, who helped make my holiday wonderful by being patient and giving me time.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>You can leave a comment here or <a href=\"http://hd-erised.livejournal.com/17847.html\" rel=\"nofollow\">on Livejournal.</a> Or find me on tumblr at letteredlettered</p>",
    "text": "When Harry Potter walked into that apothecary shop that day Draco really didn’t think Potter was there to ruin his life. Potter had already done that several times and once more just seemed excessive.\nPotter’s presence merely seemed inevitable, for the war had ended over nine years ago and since the trials, Draco could not remember ever having been in the same room as Harry Potter. Draco had read about him plenty in the papers, but the papers were full of filthy lies unless Draco was writing them and then they were golden. \nFor a long time, Draco had loathed the very idea of seeing or speaking to any of the people who had contributed to ruining his life, but over the years—no matter how hard he tried to avoid it—it had gradually begun to happen. He had seen Susan Bones in the market, and he had waited next to Lee Jordan to cross a street. Every once in a while, Anthony Goldstein came into the shop to buy herbs. \nOn that day in late spring, after the hubbub of hols and before the hullaballoo of summer, Draco Malfoy sat behind the counter in Tamanam’s Apothecary writing anonymous articles for The Daily Prophet when Harry Potter opened the door. For a moment Draco stopped writing. Potter turned toward a shelf without having seen him, and Draco tried to decide whether he felt anything, anything at all.\nLooking messy and expensive, Potter examined the bottles on the shelves. He wore his Lovegood cloak worn as though it had been just thrown on, and the potion-product in his hair gave it that tousled, untamed look, as though he had just tumbled out of bed. It was the look Potter had in all the papers and all the glossy magazines and it still remained effective; he looked decadent, dangerous, like a person one dared not approach. \nDraco supposed that was what happened when you were the hero of the wizarding world and your friends were famous fashion designers and award winning photographers. Lovegood had come a long way from the radish earrings, but her style was still singular, and Creevey had taken after his dead brother with his penchant for the camera. There was a reason Potter was always on the cover of every wizarding magazine in print, and it had more to do with his inner circle than his inner beauty.\nHis outer beauty was perhaps not insignificant but Draco was unwilling to consider it.\nPicking up one of the bottles, Potter turned and saw Draco. “No.”\nThis should be interesting.\n“You’re not,” said Potter. Then he came over, stopping in front of the counter. “Malfoy?”\n“Potter.” Draco straightened his sleeve.\n“What the hell are you doing here?”\nDraco’s lips tightened. “My primary function appears to be answering the imbecilic inquiries of customers.”\nPotter scowled his Witch Weekly scowl, the one that struck fear into the hearts of his enemies and lust into the loins of his friends and fans. \n“Do you have any further questions?” Draco said politely.\n“You work here?” \n“I wouldn’t subject myself to it for any other reason.”\n“But—why?”\n“It’s called wage labour. A socioeconomic relationship between an employee and employer. Speaking of which, we also employ the market system here in wizarding Britain.” Draco nodded at the little purple bottle in Potter’s hand. “It’s two Galleons.”\nPotter’s eyes were so thoroughly fixed on Draco that he didn’t even seem to be aware that he was holding the Dreamless Sleep. “I haven’t seen you since . . .” \n“The trials.”\n“No. I saw you on the street. Seven years ago.” \n“All right,” Draco said, because it was.\n“Where have you been?” \n“For the past seven years?”\n“I haven’t seen you.” \nMost people would probably think that the hero of the wizarding world had a right to ask any questions he pleased. They wouldn’t think Draco had any right to protest. Straightening his sleeve again, he answered Potter in his most precise tones. “I worked for a while in Dagenham, then Tower Hamlets. I attained my present occupation three years ago. Sometimes I visit my mother. She lives near Sunderland now, in case you want to know.”\n“But . . .” Potter frowned harder, if that was even possible. “Where do you live?”\n“I can give you my address, if you’d like to stage further invasion of my privacy.” \nPotter unfrowned, blinking. “I only meant . . .\nHe’d only meant that he still thought of Draco as a criminal. Potter must be surprised to discover that Draco led an inconspicuous, inconsequential life, and Draco didn’t really blame him. If his own life were at all like Potter’s—bringing dark wizards to justice, getting his photo taken for Accio Style, being worshipped by everyone—he probably would have thought someone like Draco was a criminal, too. \nAs it was the war seemed as though it had taken place in a different world, a world with big important people and big important things, and Draco was no longer a part of it. He had left long ago.\n“No doubt my employer Mister Tamanam has some record of my work history,” Draco said, “if you’d like to examine it.”\n“Never mind,” said Potter. “I just . . . didn’t know. How did you . . . ?”\nDraco waited, but Potter didn’t finish his question. \n“Never mind.” Potter turned as though to leave, then must have realized that the bottle of Dreamless Sleep was still in his hand. “It’s—” he said turning back. “It’s just strange I haven’t seen you.”\n“I had no idea you were looking.”\nSomething twitched in Potter’s face, and he put the Dreamless Sleep on the counter. Shoving his hand in his trouser pocket, he rooted around, as though they were the kind of pockets one should actually use. They weren’t. They were for show. The trousers were evening-wear, quite posh evening-wear at that, but Potter wore them just like any other trousers. His hand came out with several coins, which he plunked down on the counter.\n“That’s too much,” Draco said.\nPotter’s eyes slanted to the left, just over Draco’s shoulder. “Be quiet.”\nDraco’s jaw clamped down so hard it almost hurt.\nPotter’s eyes snapped to Draco’s again, a strangely guilty look passing over his face. “Keep the change.” Abruptly turning, Potter went to the door, flung it open, and dashed into the street just like a crazy person.\nOnce he was gone, Draco loosened his jaw, and realized he had not been holding his breath. His chest did not feel tight in the way it used to, and his arm didn’t even itch. It was over. Harry Potter had come in and Draco had faced him; Draco had talked to him, and nothing had happened. Draco didn’t feel any different. His life felt exactly the same.\nIt really was a different world.\nPotter had left over ten galleons on the counter. Opening up the register, Draco put the money in the till.\n*\nPotter may have been on every magazine cover, in every paper, the topic of every conversation on the wireless, but as far as Draco could tell most people didn’t actually know anything about him. They didn’t seem to understand that the blazing eyes, the stalking about, all the crazy—that was all just part and parcel of the Harry Potter show. Potter did it on purpose, exactly the same way that he did everything. He’d always been popular. He’d always known how to please a crowd.\nDraco was neither foolish nor vindictive enough to believe that Potter had slain the Dark Lord simply as a bid for attention. He knew that Potter had worked hard and he had suffered; he knew that Potter had lost loved ones and made sacrifices. He also knew that worship of Potter—which over the last decade had increased to the level of fanaticism—was misplaced. \nEvery single one of them who had played any part in the war had suffered, had lost loved ones, had paid the price of violence and of loss. Potter had been a child just like the rest of them. None of them were special and Potter wasn’t either. Sometimes Potter had been petty, sometimes even cruel. Sometimes he had been funny; no doubt he had even been kind to some people—but he had still been just a boy. \nThe public and the press made Potter out to be a god. It wasn’t simply the glowing image of a hero on a pedestal—Godric Gryffindor Harry Potter was not. Instead he was their grim protector, willing to commit the darker deeds other heroes feared. All Potter had to do was act like a child—scowling all the time, acting like he didn’t love the attention, stamping his foot and using “accidental” magic the second he didn’t get his way. Sometimes he would slag off public appearances for weeks at a time, just because he was having a tantrum. The papers would say it was because life was just so difficult for him, as though it was truly terrible being filthy rich and famous.\nPotter used it to his advantage. The more arrogant he became, the more his fans obsessed about him. The more wild he acted, the more they swooned. His quitting the Aurors had been nothing but a publicity stunt to play into his image, for as soon as he was out of the scarlet robes, he’d gone back to catching criminals. Despite the fact that he was no longer authorized to do so, no one cared—Potter could do anything he wanted if it was to protect them. He didn’t have to play by any rules, and now that he had no profession, he could slag off even more responsibilities. Potter was eating it up. \nIn the days before Potter dominated the press and the entire field of fashion, Witch Weekly celebrities used to smile and wave. Accio Style, the premier monthly for haute couture, used to feature mostly Purebloods who instead of waving politely used to look away from the magic cameras, generally with coy expressions or stately indifference. Since the advent of Potter onto the celebrity scene, however, the vogue was now to stare aggressively at cameras and scowl. \nThe look had been originally calculated in order to strike fear into the hearts of his enemies. No doubt it had worked, but it had had the unfortunate side effect of making fans swoon, and so Potter had cultivated his glares and glowers into a veritable masquerade that he trotted out at any opportunity. Crazy was the new sexy, and no one was better at making furious or insane look erotic than Potter. The carefully tousled hair, the expertly maintained stubble, the studied thoughtlessness of the way he wore expensive clothes—all of it was calculated to make his public love him, right down to the scowl.\nDraco didn’t care.\nEven if he still read all the papers and periodicals, still listened to the wireless, he knew he didn’t live in Potter’s world anymore. Father had had a high political and social standing. He had been right in the thick of that which was important in the wizarding world, but then the war had happened, and now Draco lived on the edges. He wasn’t exactly happy with it, but he was content. He had his flat, his job, his few friends, his remaining family, his cat. They were all that really concerned him, and that other life was like some forgotten dream—pretty, sweet to think about, but inaccessible, unreal.\nDraco hardly thought about Harry Potter at all these days.\nHe only wished that it had stayed that way.\n*\nOne week later Potter walked into the apothecary again.\nHe wore a different cloak just as expensive as the first, and he slouched when he walked. The stubble on his chin was a perfect study in carelessness, and his hands were shoved down in his pockets as though good carriage deeply troubled him.\n“Can I help you?” Draco said politely. Potter had come straight up to the counter. There was no one else in the shop.\n“I checked on you.” \n“Oh?”\n“You worked odd jobs.” Potter said it like an accusation.\n“I’m sorry I didn’t mention it.” In all the news articles, Potter claimed he didn’t find criminals, that they found him. What they never mentioned was that Potter spied on people who hadn’t even thought about him in over seven years, people who were minding their own business, going about their lives. It had to be a lot of work for Potter to be this gorgeous and insane—maintaining that five o’ clock shadow, styling his hair so wild and untamed, suspecting everyone of criminal activity. Potter’s life must be incredibly intense. Draco wondered how he kept it up.\n“You worked in Tower Hamlets,” Potter went on.\n“I believe I did mention that.”\n“Do you have a spell?”\n“Pardon?”\n“Some kind of spell.” Potter sounded frustrated, and the bottles on the shelves were beginning to shake. “Keeps you hidden. From being noticed?”\n“The melodrama is hardly necessary,” Draco said. “I suggest you keep it to yourself.”\n“I . . . what?” The shaking stopped.\nDraco looked down at his sleeve, adjusting the cuff. “Not everyone who isn’t falling at your feet is trying to hide from you, Potter. Some of us know you’re sane.”\nPotter’s mouth made a weird shape—it always had been a disturbing mouth. “Sane?” he said, as though he didn’t know what the word meant.\n“Yes, sane.” Draco stopped fiddling with the cuff. “Some of us have moved on with our lives.”\nPotter’s eyes slid over to the side. “No, he can’t.”\n“No who can’t?” Draco looked over his shoulder.\n“You can’t just live a normal life,” Potter said.\n“Ah,” Draco said, because Potter was still pretending to be crazy.\n“I kept track of you,” Potter said. “After the war. Narcissa is in Sunderland; Lucius is dead. Goyle is in Azkaban; his father and Crabbe’s father are in Azkaban; his mother is in Australia. Parkinson is—”\n“She’s fine, thank you.”\n“—in Norfolk.”\n“It’s good of you to stay in touch with the alumni of your alma mater, but it’s not necessary,” Draco said. “Really.”\n“And you were in Dagenham.”\n“I worked there,” said Draco. “I got another job.”\n“How?”\n“Is this a formal inquest? Or is it just for old time’s sake?”\n“I know them. I know them all; I know where they all are. You can’t have just . . .” Potter’s eyes darted to the left. “I’m not talking to you.”\nDraco looked over his shoulder again. “There’s no one there.” \n“What?” Potter’s eyes snapped back to him.\n“It’s no use pretending to be psychotic,” Draco said. “It doesn’t work on me.”\n“It doesn’t?” Potter’s mouth made that funny shape again.\n“No. You’re a wizard just like any other wizard.”\nPotter stared at him. Draco didn’t like the gleam in his eye.\n“I’m not impressed,” Draco reiterated. “You don’t intimidate me.” \n“I want some Dreamless Sleep,” Potter finally said.\nDraco hesitated, and Potter leaned closer. He leaned closer and closer, and then he wasn’t leaning at all anymore. “Where is it?” he asked, his voice perfectly normal.\nPotter had found it for himself last time, but Draco knew better than to provoke someone pretending to be crazy, so he pointed.\n“Excellent.” Potter tossed a handful of galleons on the counter then went over to get the bottle. Removing it from the shelf, he looked at it a while, and Draco started playing with his sleeve again.\nDraco’s shirt was a silk weave, for it had always been important to him to look presentable, and that hadn’t changed with circumstances. The price meant that he could only afford to buy a new shirt once or twice a year and new trousers even less often than that, but quality was more essential than quantity. No one except Mister Tamanam would see him often enough to notice, and he kept everything so well pressed and in such good repair that there was no telling the age of any of it. He used to fancy that if a stranger saw him on the street they would never be able to tell.\nPotter’s shirt and trousers were stained and crumpled, while the cloak had a tear on the edge, and it was this that gave Draco to realize how deeply he had been fooling himself. The clothes on which he had spent so many hard-earned galleons—the clothes that Draco had fancied still fashionable—were still impossibly middle class compared to Potter’s, as well as old and worn. Somehow Draco had managed to convince himself that neatness could be mistaken for fashion, perhaps because it had been so long since he’d been in the company of people who knew how to dress.\nPotter just made it so obvious; when one was rich one didn’t even bother with one’s clothes; one cast them off and threw them away as soon as they obtained flaws. Despite the fact that Potter was wrinkled everywhere and Draco was almost hopelessly tidy, Draco was the one who looked like a bedraggled dog.\nFinally slipping the phial of dark liquid into the pocket of his cloak, Potter slowly turned around, causing Draco to realize he had been staring. Hastily, Draco looked away. “Pleasure doing business with you,” Potter said, and then walked out.\nDraco watched him go.\n*\nAfter his second visit to Tamanam’s, Potter began following Draco. He must be “checking in”, as Potter had called it. He must think Draco was the same person he had been at Hogwarts—someone who would follow Death Eaters blindly, someone who could be ruthless in order to get ahead, someone who would hurt people in order to impress his father. Perhaps he thought that Draco was still a Death Eater, a dark wizard—a criminal, a grave robber, a baby snatcher; Draco didn’t know what Potter thought he was, because Death Eaters didn’t exist anymore. \nDraco had been a Death Eater because it had seemed like the thing to do at the time, not because he’d invented the idea. There was no logical way to maintain blood purity. The Dark Lord and all of his followers had been mad, and were Draco to try to follow their teachings now he wouldn’t even know how to begin. It had been so long ago and so foolish. It seemed ridiculous now, the idea that killing people could do anyone any good, and the thought of wasting all that effort on something so abstract and petty simply made him tired.\nYet Potter obviously assumed that Draco was still that foolish boy he had been, if the way he followed Draco around was any indication. For one thing, he didn’t seem to be trying hard to hide himself. Even if he was no longer an Auror, Potter should have been experienced at tailing people, but Draco kept catching sight of him—around street corners, behind him in the street. At the very least, everyone knew that Potter had an Invisibility Cloak, but he definitely wasn’t using it. He must have thought it didn’t matter—he must have known that if Draco had tried to go to the authorities, they would have laughed in his face.\nStill, there might have been other ways to stop Potter from following him. Draco might have confronted him. He also might have tried to hide his tracks with charms and traps; he knew a way to lock his Apparition coordinates such that no one could detect where he was going. In the end, though, Draco didn’t do anything. After all that Draco had been through, sneaking about was the last thing that he wanted to do, and confronting Potter seemed like too much trouble.\nIf Potter wanted to treat Draco like a criminal, he’d treat Draco like a criminal. Eventually he would find out that Draco’s life was normal—he went to work, he did his job, he went to sleep. Sometimes he went out with the few friends he had, sometimes he visited Mother, sometimes he sent anonymous articles to be published in the Prophet. If Potter wanted to get Draco arrested for doing any of that, he probably could; if he wanted Draco to go to Azkaban for it then Draco would. \nDraco had fought tooth and nail to live this life, this stupidly normal life with its stupidly bourgeois job and his stupidly mundane flat. He was done fighting; he’d gone on to the part where he was living—really living, even if it was boring and inconsequential and dull. He didn’t care what Potter thought, or what the Wizengamot thought, what any of them thought. If they were going to take it from him then they would. What was going to happen was going to happen.\nDraco would let them come.\n*\n“Where did you get that?”\nDraco had been writing with one hand, using his other hand to hold his wand as he directed bites of tikka masala into his mouth without dripping any of the sauce. No one had been in the shop, and the question took him by so much surprise that he almost spilled tikka masala all over his parchment.\nWhen he looked up, Potter was standing there, his eyes gleaming green and his teeth biting on his lips. He was wearing his designer cloak again, still sporting the same stains, and yet it was obviously on purpose. He looked tousled, debauched, like a million galleon painting of a messy, lurid night.\n“The tikka masala,” said Potter. “Where did you get it?”\nPulling down his sleeve, Draco looked at his food. For a moment, he didn’t even know what he was looking at. “Village Tandoori.”\n“I haven’t seen food that colour since . . .”\nThe colour was a fluorescent orange unlike anything found in the natural world. Muggle people used chemicals to make it; they were much like reagents for potions except further distilled, more elemental. Draco had read a book about it once. Muggles were far more interesting than they led you to believe in Muggle studies.\n“. . . a long time ago,” Potter said.\nDraco looked up. “Muggles call them preservatives.”\n“You’re eating Muggle food?” Leaning in, Potter picked up the aluminium takeaway container. For a moment, Draco thought he was going to take the fork and start eating. Instead he smelled it, then put it back on the counter. “How much?”\nDraco glanced at the tikka masala again, trying not to be shocked. “I’ve eaten half of it.”\n“I meant how much is it at the—what was it called—Village Tandoori.”\n“I’m . . . it’s . . . . accio menu,” Draco said, swishing his wand. “It’s three pounds. Two more for the onion bhaji, but they never charge me for that part anymore.” Seven or eight takeaway menus flew into Draco’s hand—he’d forgot he had so many. Mister Tamanam often let him close the shop and bring something back if he couldn’t come in to give Draco a lunch break. Sorting through the menus, he handed Potter the menu for Village Tandoori.\nPotter took it, looking it over. “I never imagined you liking Muggle food,” he said.\n“It’s food,” said Draco. “I can’t taste the Muggles at all.”\nPotter barked.\nAfter a moment Draco determined that it must have been a laugh—a guffaw perhaps—but it didn’t sound that way; it had sounded like a bark. Like a dog. Like a wild dog, possibly with rabies.\n“That’s funny.” Potter folded the menu back up and put it on the counter. “You were joking, right?”\n“I don’t hate Muggles,” Draco said.\n“Why?” \n“They’re not a threat to us.”\n“That’s all?” Potter looked interested. “That’s your whole opinion of them? They’re not a threat?”\n“Should I be thinking something else?”\n“I don’t know.” Potter looked thoughtful. “I suppose I thought you might hate them.”\n“The war was ten years ago, Potter.”\n“Or fear them. Or love them; I don’t know; it was nine.”\n“What?”\n“Nine years ago. The war. Nine years, four months, three days. It’s just that you always used to have strong feelings about things. About everything. It was really . . .” Potter looked thoughtful again. “Annoying.”\n“Well.” Draco looked down at his shirt sleeve. “I don’t anymore.”\nThere was a pause.\n“No, I didn’t,” Potter snapped. “You did.”\nDraco’s head jerked up. Potter wasn’t looking at him. “That still doesn’t work,” Draco said, keeping his voice soft.\nPotter’s eyes met his, and the green light in them seemed to dim somewhat. Potter took the menu off the counter and put it in his pocket. “Thanks for telling me about the takeaway. I’ll try it sometime.” \nPotter started to go away, getting to the door before he turned around again and walked back to the counter, smiling ruefully. “I forgot,” he said, laying a handful of coins on the counter. “Dreamless Sleep.” \nHe got the bottle, then left the store as though he had never been there.\n*\nPotter came into the apothecary for Dreamless Sleep once a week. Sometimes he didn’t say anything at all, but other times he would stop to talk, only for several minutes. For some reason Potter never wanted to talk about anything that mattered, aside from his question about Muggles when he had asked about the takeaway. \nThey talked about brooms and Quidditch and even the weather. One afternoon Potter asked Draco where he had got his morning tea, which was more than slightly maddening since Potter still followed him around everywhere. Before the conversation about takeaway, Potter had merely been trailing him, but now Potter was out-and-out stalking him. \nDraco would have lost interest long ago had he been Potter. The only thing that Potter could possibly be watching was Draco going to the shop, going to his flat, then going to the shop again, because that was all that Draco did. The highlight of his day was the occasions when he could pop over to Village Tandoori or the May Flower for lunch, and sometimes he got owls from Mother. Every once in a while Mister Tamanam invited Draco over to his family’s house for dinner, and once a week Draco visited Pansy.\nDraco thought about it as he walked down the street, certain that Potter was following him. It was the middle of the day, but Mister Tamanam had arrived to cover the register so that Draco could have lunch, so Draco was trying to be quick about it. Potter kept up with every step, about ten paces behind him. Apparating away from him wasn’t an option as they were in a Muggle part of London.\nSurely by now Potter had figured out Draco wasn’t up to anything nefarious. Maybe Potter was following him because he had made those badges when they were in school together. Maybe it was because Draco had made such a fuss about that sodding Hippogriff. Maybe it was because he’d almost killed that Bell girl and Weasley and Dumbledore, but it just seemed like so much energy to waste on a stupid revenge that hardly seemed like revenge at all. Maybe being famous meant you took a constant supply of Pepper Up; maybe that was why Potter was always buying Dreamless Sleep.\n“Malfoy?” said a voice. “Hallo, Malfoy?”\nDraco stopped, slowly turned around. Potter was jogging toward him.\n“I thought that looked like you,” Potter said when he caught up. “Imagine running into you here.”\nDraco opened his mouth to point out that it was no coincidence, but then he closed it. Potter was in shirt sleeves, a waistcoat and wool trousers. None of them matched, but the colours were neutral and each item was so subtle and well-made that it didn’t matter. If one had a whole closet of clothes that looked like that one could just throw on anything, Draco supposed, which no doubt was what Potter was going for. \nDraco looked away.\n“Are you going there?” Potter nodded at Shu Castle.\n“I.” Draco tugged on his sleeve. “Yes.”\nThe side of Potter’s mouth twisted. “Is it any good?”\n“It’s Sichuan,” said Draco.\n“Okay.” Potter looked around the street. “Hey! Mind if I join you?”\n“Pardon?”\n“It’ll be great.” Potter didn’t look like he thought it would be great. He looked kind of scary actually, but then he put his arm around Draco’s shoulders and Draco didn’t know what to do. Potter was big—he was muscular and he was male and he was touching him. He was warmer than a normal person, and he had always hated Draco. Potter hadn’t even cared about him enough to hate him; Potter had ignored him; he’d been scum under Potter’s shoe. “Just like old times,” said Potter, propelling him into the restaurant. “I’ve never had Sichuan. What do you get?”\nPotter kept talking about food, and then somehow they were sitting down and Draco had a menu, and Potter had one too. Potter was acting as though they really were just two friends who had run into each other on the street, as though it were the most normal thing. In fact this was the most normal Draco had ever seen Potter act; he hadn’t even acted this way in school. He wasn’t glaring and he wasn’t cross; he was talking about Tesco actually, Muggle Tesco with its bright white lights and crowded aisles.\n“You’ve been there, haven’t you?” Potter was saying. “Tesco, it’s Muggle.”\nOf course Draco had been there. Draco went there because it was Muggle, because he could only stand the wizard markets so often, the wizard markets where sometimes they still stopped and stared, where once or twice they had even refused to sell him food. Potter must have seen him go to Tesco; he knew the answer to this question and yet he was still asking, as though this were a normal conversation, as though they were normal people. Potter was acting as though neither of them had ever tried to kill anyone, and so Draco said, “Sometimes.”\n“Biscuits!” said Potter.\n“Pardon?” \n“I remember the biscuits there,” Potter said. “They had these orange things, with chocolate, and—it was like a marmalade, on top of a biscuit, covered in chocolate—”\n“Jaffa Cakes.”\n“Jaffa Cakes!” Potter picked up his fork and clunked it back on the table. “That’s exactly right. There were Jaffa Cakes. Petunia used to get them.” Potter looked down at his menu. “Petunia is my aunt.”\nDraco didn’t feel it necessary to remind Potter of who his own aunts were.\n“They also had these . . . sandwiches.” Potter was still looking at his menu, as though he would find a Tesco sandwich there when it was a Chinese restaurant. “Eggs, bacon, and some kind of . . . I think it was mayonnaise, but you know, I’ve never been able to recreate that sandwich. There’s something about the way that Tesco does them. Muggle preservatives, maybe. Have you ever had them?”\n“Preservatives?”\n“No.” Potter laughed. It was a normal laugh, and Draco wasn’t quite sure whether it made him feel more or less terrified. “The egg and bacon sandwiches. You can’t get them in a wizard market either.” Potter folded up his menu and looked at him. “I don’t go to wizard markets.” \n“Oh?” said Draco, feeling faint.\nPotter was always doing things with his mouth that looked wrong. Just now, for instance, he was frowning, and it made him seem intimidating and yet also strangely wistful, and usually those emotions did not go together. “They all know who I am there,” Potter said. \nAnd then Draco understood. He understood it all—Potter following him around, this conversation they were having, even the senseless, stupid conversations at the apothecary. Draco understood it and he felt much better, because he knew what Potter was about, now. The truth was merely this: Potter wanted to see how the other side lived.\nPotter was rich, famous, and extremely, almost painfully fit, and he wanted to know what it was like to be nobody, just nobody. It was ignorant and nouveau riche, the kind of thing one did if one was not born into pureblood society but somehow entered into it, and yet Draco felt relieved. Potter wasn’t going to arrest him and he wasn’t going to abduct or murder him like psychopaths sometimes did. Potter didn’t think that Draco was dangerous at all. He thought that he was harmless—so harmless, in fact, that Potter thought that Draco was now the very epitome of a common man.\nThere was something farcical about it, about the fact that Draco had striven so hard to work against the prejudice aimed at former Death Eaters that he had somehow come out on the other side. Now not only was Draco no longer a threat, he wasn’t anything; he wasn’t anyone at all. It was almost hilarious, actually, in an exhausting sort of way, and Draco didn’t care. He didn’t actually care, and Potter wasn’t threatening him, and this was more entertaining than anything that had happened in weeks, so Draco said, “I like Hobnobs.”\n“What?” Potter had been staring into space.\n“I like Hobnobs,” said Draco. “Jaffa Cakes are too sweet. But Hobnobs are . . . acceptable.”\n“Those are awful.”\n“No, they’re not.”\n“I’ve never actually had them,” Potter confessed.\n“Maybe you should try them before you disparage them.” Draco picked up Potter’s menu, opened it, and gave it back to Potter. “I usually order the pickled beans with pork mince. It sounds abhorrent, but it is, in fact, delicious.”\n“I’ve never actually had Jaffa Cakes either,” said Potter, taking back the menu. “I found a half of one, once. It was sort of old, but I ate it anyway. Dudley left it.”\nDraco didn’t know who Dudley was. “The dumplings in the chili oil are also exquisite.”\n“Okay.” With that stupid mouth of his, Potter smiled just like a child. \nStaring at him, Draco couldn’t help but notice that Potter’s waistcoat was open. It was not how one was supposed to wear a waistcoat, but there were buttons missing on it, so it was obviously purposefully done. His shirt was open at the throat, revealing a deeper triangle of skin than one really should in a shirt with a collar. That glimpse of throat was on purpose, just like the waistcoat. They both looked like satin. They both made you want to touch.\nDraco opened his menu and looked at that instead.\n*\nThe possibility of having sex with Harry Potter didn’t even cross Draco’s mind that afternoon.\nInstead he spent the rest of the day thinking about the fact that he was not a part of Potter’s world, and the fact that Potter didn’t think he was a criminal was the final proof. If Potter had thought of him as a criminal, Draco would still have some kind of importance in the wizarding world. Even though Draco had done nothing wrong, it would mean that people still thought of him—the Ministry still knew who he was, the Malfoy name still meant something, the bigwigs of the wizarding world thought he was significant somehow. As it was, Potter was interested in him only for his insignificant. \nBeing hated was familiar to Draco. He was used to being despised, abused, and humiliated; he was even used to being abandoned and neglected. He was not used to being insignificant, and he was trying to decide what to do with the feeling. Sex was pretty much the last thing on his mind.\nThe next time Potter came into the apothecary, Draco thought he finally understood—not only why Potter was stalking him and talking to him, but why Potter had come to Tamanam’s in the first place. It was a second-rate potions shop, for although Mister Tamanam was a fine brewer, he did not have the galleons for top-end reagents. He made practical, everyday potions for wizards who needed them, and most the shops on Sop Lane were the same.\nDiagon Alley was for tourists and for children, for people going back to Hogwarts and for witches and wizards to see and be seen. Sop Lane was not as bright or as expensive as Diagon, and not as seedy or crowded as Knockturn Alley. It was where one came to get what one needed cheaply—used clothing and quick cleaning spells, little Charms for little things. It was the perfect place to be among everyday people, to remain forgotten and unseen—which was exactly what Potter wanted.\nPotter was like a king who dressed in peasants’ clothing to see how people “really” lived. He was having a lark, another great adventure; trawling about unrecognized was like a game for him. As summer approached the shop became more crowded, which made the game more difficult. Now when he came to buy his Dreamless Sleep, Potter had to pull his cloak about himself. He started wearing hats and Charms to disguise his face, but just like a king in peasants’ clothes, he had no idea how peasants really lived.\nHis cloaks were still Lovegoods, and the hats he wore were as expensive as most people’s monthly wage. The Charms he used were too elaborate—anyone could do a quick Morphing Charm to make his chin grow longer, but instead Potter wore a careful illusion that he had probably paid for. People who had only seen Potter in the streets and on the front page of the papers might have been fooled, but anyone who had known Potter would know the truth. The very quality of the spellwork made him stick out like a sore thumb.\n“You can come out now,” Draco said, when the last of the other customers left the shop. \nPotter, who had been hanging about in back, slowly turned around. If he came in when there were people there he usually went into a corner and stared at the shelves until everybody left, only buying his Dreamless Sleep once no one else was there. \nEventually Potter came over to the counter. He stood there for a while, then waved his hand over his face. The Charms disappeared. “You knew it was me,” he said.\n“You’re not exactly subtle.”\nPotter bit his lips. Since that night at Shu Castle they’d talked a bit every time that Potter came to the shop. The conversation was always still about inconsequential things, but now that Draco finally understood what Potter was up to, he felt easier about it. \n“I wasn’t going to mention it,” Draco said, “but you’re coming up on your limit.”\n“Limit?” \n“We can’t sell more than a litre of Dreamless Sleep to the same person within a three month span. You’ve almost got a litre and it’s only been two months. I’m sure it doesn’t matter, seeing as how you’re . . . you, but still I’m supposed to—”\n“Right. No. You shouldn’t—” Potter stopped himself, looking lost. “I’ll—I’ll just get it elsewhere.”\nDraco felt badly and didn’t know why. Potter could get as much Dreamless Sleep as he wanted, and Draco shouldn’t care. Instead Draco said, “There’s always Sweet Dreams.”\nPotter must have been wool-gathering, for he was staring into space, but now his gaze jerked back to Draco. “What?”\n“It’s Mister Tamanam’s recipe,” Draco said, moving across the store. “It’s a lot like a Sleeping Draught, but it doesn’t make you groggy. And unregulated, since it doesn’t have mermaid gravestone. Here.” He handed the bottle to Potter, who looked down at it.\n“There will still be dreams,” he said.\n“Well,” said Draco. “Yes.”\nPressing his lips together, Potter looked back up at him. “Thank you.”\n“You’re welcome,” Draco said, because that was what he said to customers. \nPotter just stood there staring. Then he said, “I enjoyed having supper with you.”\nDraco blinked. Shu Castle had been three weeks ago. “It was lunch.”\n“Was it?” Potter tilted his head. “Oh. Oh, right. It was. I still enjoyed it. It was very . . . tasty.”\nDraco didn’t know what he was supposed to say. \n“Do you like other restaurants?” Potter asked.\n“Yes,” said Draco, because of course he did.\n“Are they all Muggle?”\n“No. I . . .” There were hidden places, places where the people didn’t recognize him or they did and didn’t mind so much, places where the food was cheap but warm. Potter had to know them all as he had been following him around, and Draco didn’t know what Potter wanted from him—perhaps a tour: all the places one went when one wore trousers that were six years old.\n“Can’t think of any?” Potter asked.\n“No,” said Draco.\nPotter turned to the right. “I’m talking to him now, thank you,” he snapped, then turned back to Draco and smiled. “That’s okay. I usually eat in.”\n“There still isn’t anyone there.”\n“Where?” Potter looked marvelously innocent. “At my flat? No, no. I live alone.”\n“No, I meant . . .” Draco looked at the space to Potter’s right, which was empty. He supposed he didn’t put it past Potter to bring around his friends under his Invisibility Cloak. He didn’t understand why Potter would do that, but he also didn’t understand why Potter would keep pretending to be crazy.\n“What? Oh.” Potter laughed completely mirthlessly. “No—that’s just—it’s nothing. Do you have a flat?”\n“You already know where I live,” Draco said. “You’ve been following me.”\n“Oh,” said Potter, looking surprised. Then he looked at his shoes. “I suppose I should have told you. I didn’t want it to . . . I didn’t want to seem creepy.”\n“It’s a little late for that,” said Draco.\n“Well, since we’re on the subject.” Lifting his head, Potter did that weird thing with his mouth, the one where he wet the corner of his lips with the point of his tongue, then swallowed. “Maybe I could—I could come over sometime,” Potter said. “You could show it to me.” \nLooking back on it later, this was the moment Draco really should have figured it out. It was just so incomprehensible then—so far from his mind, the thought of sex with Potter—it didn’t even occur to Draco that that was what Potter wanted. He just thought Potter was a tourist; Potter just wanted to play, wanted to see what it was like to be un-extraordinary. It never crossed Draco’s mind that Potter wanted to fuck him, even though it should have. It was part and parcel to the course—you ate greasy food, you slept on flea-ridden mattresses, you fucked someone beneath you. That was how the tour went.\nBut Draco wasn’t thinking about that. Instead he was thinking that it was Harry Potter, and how did you say no to Harry Potter; you couldn’t, even when you didn’t care that it was Harry Potter, even when you weren’t impressed. The fact remained that it was Harry Potter; he could hurt you and he could kill you; he could have you put away for life. What did it matter anyway, so Draco said yes.\nPotter’s mouth curled at the side the way it sometimes did—rarely a full smile, just that little curl that was slightly mournful and just a little sweet, like a little boy. “Great,” he said. “I’ll swing by.”\nThen he left, the Sweet Dreams on the counter, and for the first time didn’t buy his Dreamless Sleep.\nDraco stood there, wondering what in the world he had just agreed to.\n*\nWhen Potter did come to Draco’s flat, Draco still didn’t know why he was there.\nIt was an evening just like any other evening. Draco was sitting on his old worn-out sofa, wearing his old, worn-out jumper he almost always wore when at home. A long time ago the blue jumper had been one of his nicer items of clothing, but now even magic couldn’t patch the holes. It was still comfortable, however, and wearing it when he was all alone meant that his other clothes would last longer for when he went out in public.\nThe sofa had a similar story, though Draco couldn’t imagine a point in time when it might have actually been presentable. He’d bought it used and it was cheaply made, but he had repaired it many, many times with carefully charmed stitches. Now, however, time had got the better of it, and there was no way to hide the way it sagged or how thin the fabric was.\nDraco sat upon it, Aloysius curled beside him. The cat was a tortoise shell with a nick in the ear, who rarely did anything but eat, chase insects, and get under Draco’s feet. These other tasks having been performed, Aloysius was engaged in his only other activity, which was napping. \nDraco was eating pasta from a pan while working on another article for The Daily Prophet. Being a former Death Eater provided a unique perspective on happenings in the wizarding world, but Draco avoided any direct mention of his history. His articles were fairly popular, but only because they were anonymous. If anyone knew that a former Death Eater was writing them, they likely would have been banned.\nInstead Draco usually wrote about the Ministry and wizarding society; since he wasn’t involved in any of it he was in an excellent position to provide commentary. Usually he steered clear of Potter and his particular brand of nonsense, focusing instead on the important things, forgotten things, things people were too far inside their own heads to think about.\nFor this article, Draco had been inspired by his meal with Potter to write about the difference between different wizarding districts and how they compared to different areas in Muggle London. He was just starting to write about the relationship between Peckham and Sop when the Muggle chime sounded. \nPutting down the pan of pasta, Draco put his jumper to rights—it was probably only a Muggle at the door, but he still refused to be seen with holes. Covering them up with some quick illusions, he glanced at Aloysius, who went on sleeping blissfully. Draco went to answer the door and found Harry Potter standing there, wearing his strange curled smile.\n“Can I come in?” Potter said.\nDraco was taken completely by surprise. He remembered Potter’s request, and yet he hadn’t been able to convince itself it was real somehow; Potter looked so wrong standing in his doorway. He was just—just—so tall, his hair so inky black. It wasn’t natural, that hair; he had to be using at least several different potions to get it to look that way, and he was wearing dragon leather boots. Owning dragon leather boots was just like owning an island, and Potter probably owned several. Draco didn’t even own this flat.\nInstead of saying so, Draco opened the door wider and let Potter inside.\n“I hope I’m not . . .” Potter looked around, then turned to land his eyes on Draco. “Disturbing anything.”\n“No,” said Draco, and shut the door.\n“Thanks for letting me come.” Potter walked farther inside, stopping at the coffee table. The scratched surface was covered in scrolls, the pan of pasta beside them with the fork still inside. “You have a cat.” Potter’s voice sounded blank and surprised.\n“You grow more perceptive with time.”\n“It’s brown.”\n“What colour is it supposed to be?”\n“I—nothing. Were you eating?”\n“No.” Draco sent the pan into the kitchen with a spell, then hastily started cleaning up the scrolls. “What are you doing here?”\n“I wanted to see your flat.” Potter walked over to Aloysius, hand stretched out.\nAloysius, with the sixth sense inherent in his species, startled awake, looked up, then jumped off the couch. “He doesn’t like strangers,” Draco said.\n“That’s fantastic.” Potter sounded surprised and sincere, and Draco had no idea what he was talking about. “This whole place is fantastic,” Potter went on, wandering around the sitting room. “It’s so long since I’ve been anyplace . . .”\nPotter didn’t finish, and Draco tried to think what he must mean. The main room was crammed half full of odds and ends from the manor, the other half full of used furniture and Muggle things. Draco should have hated it, but after having lived not knowing where he would sleep, after having rented tiny cupboards for more than he could afford and sleeping in grates, he found the flat acceptable. It was livable, and he’d done a lot of work with both spells and his hands to make it comfortable, from the Charms in the Muggle light fixtures to make them glow warm and slightly yellow, to the spells in the sofa’s cushions. \nBut now Draco was seeing his home through Potter’s eyes. Potter knew that Draco had once lived in a mansion full of marble halls and mahogany staircases, crystal chandeliers and velvet curtains. Draco hardly thought of the manor at all anymore, but Potter’s presence made him see the flat for what it really was.\nIt was not much more than a hovel, a lonely little dump, a hole in the ground in which no clean, dignified person could live.\n“What made you decide to live in a Muggle building?” Potter said.\nDraco pressed his lips together. “Availability.”\n“I just wouldn’t have thought of it,” Potter said. “Not since—well, I don’t know. There’s just so much hiding you’d have to do—from the Muggles, I mean, and they’d find you anyway, the wizarding world. Then you’d have a great big cover up, a lot of Obliviate, and it doesn’t seem fair to . . .” Potter trailed off, looking at a picture on the wall. It was a painting of Draco’s mum, and Potter turned around. “But this is working out?”\nDraco stared at him. Potter pulled his upper lip in over his lower one, then did the opposite—his lower lip under his upper one, and Draco had no idea why he was here. No earthly idea. \n“It seems all right,” Potter said. “No one knows you live here. No one you don’t want to, I mean, and it . . . it seems cozy.” Potter turned back to the painting. “Is this your mum when she was little?”\n“Don’t look at it,” Draco said, going over to the painting.\nPotter looked at him in surprise. “She’s very pretty.”\n“Of course she’s pretty. She’s my mum.”\nPotter stared at him. Then he wet his lips. “Yeah,” was all he said.\n“What are you doing here?” Draco asked.\nPotter looked surprised again. “I wanted to see your flat. Can I see the other rooms?”\n“I’m . . . I’m,” but Draco couldn’t think of an excuse, so he said, “yes.”\nThere wasn’t much to the flat beside the main room, the kitchen and the bedroom, and Potter was already heading down the corridor. Following Potter, it still didn’t occur to Draco that Potter wanted to shag, not even once they were in the bedroom. \n“I wouldn’t have thought you’d live in a place like this,” Potter said. “I wouldn’t have thought you’d have a cat.” Of course Potter hadn’t thought that Draco would live like this, because the bedroom was a travesty. It was decorated with Draco’s old things—very old things, things he had had since he was a child, things he had never been able to replace since the manor and their fortune had been taken from them. Draco had not been able to keep most of it, but the few things he had were extremely sentimental, and it wasn’t until just now that he saw that they were frightfully trite.\nThe bed was an old four poster, the kind that children had, with canopies, the kind you could give a false sky inside for cowards who were afraid of the dark. The desk was carved with dragons that twisted up the legs and then flew across the surface, down the opposite side, making it impossible to write upon it. There were old Hogwarts things in here, embarrassing things, a ridiculous crystal dragon lamp and a Slytherin blanket; it was all so awful and Potter was looking at it, just looking.\nAloysius had curled up on the bed, and Draco was suddenly desperately aware of the cat hair on the duvet, despite the fact that he had spelled it clean just that morning.\nPotter looked at the room so long that Draco almost couldn’t stand it. Then Potter turned toward him, his eyes just like wet leaves. “Malfoy,” he said.\nDraco turned swiftly and walked out the door. “The kitchen is this way,” he said.\nThe kitchen was the worst. The bedroom could be excused as sentimentality, but it was obvious that what was in the kitchen was there for necessity. Even if it hadn’t been cramped, with cheap Muggle material on the counters and poor paint on the cupboards, it was obvious how Draco used this space. There was no way that Potter, looking at this mess, could not know that Draco did all of his own cooking, his own mending and his own chores. When Draco looked down he saw that the illusions he had cast at his jumper had worn out, and the holes were back.\nSomething much like panic was filling Draco’s lungs, the panic that made his arm itch terribly and he was back in an alley—back in an alley with the wet cardboard boxes and the smell of rubbish and the thoughts of Alice—\nAlice—\nDraco hadn’t thought of Alice in several years at least, and it was Potter’s fault; Potter, what did he want, what did he possibly want—\n“This is perfect.” Potter was looking around the kitchen. “This is the most perfect kitchen I’ve ever seen. It’s just like—it’s just like a real home.”\nAnd then Draco knew, and he could breathe.\nHe looked at the pans on the stove, spoons turning in them, the sponge cleaning dishes in the sink, another drying them. There were at least three mending projects going on at the kitchen table, needles sewing Draco’s carefully Charmed stiches into stockings and into trousers, and Draco knew that Potter wanted to fuck him. \nHe was almost relieved. Of course Potter wanted to fuck him. There was no other reason you could call a kitchen like this perfect; Potter thought that it was perfect because it was cheap and lowdown—something ordinary in his extraordinary life. Sex was nothing; sex was simple; sex was much, much easier than making up for Alice, or any of the things that Draco had imagined.\n“Molly Weasley used to have a kitchen like this,” Potter said, walking over to the sink. “When they lived in The Burrow. There were always Charms going in the sink, and pots stirring on the stove. It always smelled like—”\n“I’m not going to have sex with you,” Draco said, finally finding his voice.\nPotter swallowed a little cough. \n“That’s why you’re here,” Draco said.\n“Oh,” said Potter.\n“I’m not going to. We’re not going to shag.” \n“We’re not?”\n“You’re Harry Potter.”\n“Oh.” Potter looked down at his boots—his thousand galleon dragonhide boots. “I thought you didn’t care about that?”\n“I don’t mean that you’re too good for it.”\n“That’s good.” Potter looked up. “I’m not.” \n“I know you’re not.”\nPotter’s mouth curled in that sad, strange way. “Honestly, I’m just like anyone else.”\n“I know that. You think I don’t know that? You put on a show, you give them your dramatics, but it’s all false, a façade. You’re a fake, an arrogant pretender—you try, but you will never be the god they worship, the ideal they idolize. I know you. I know you right down to the core, and I know that you’re not a saint. You’re just—you’re just some boy with a scar who can’t comb his hair.” \nDraco let out a breath. That had come out of nowhere, because he wasn’t supposed to care. He didn’t care about Potter or his whole stupid world, the Ministry and its heroes and everyone who had won. \nPotter was staring at him, just staring. Then, very slowly, he wet the corner of his mouth with his tongue. “Are you sure about the shagging?” he asked, his voice cracking a little. “Because I’d—I’d really like to kiss you now.”\n“Yes, I’m sure!”\n“Oh.” Potter took a step forward. “Are you still certain?”\n“Yes,” Draco said uncertainly.\n“Quite sure?” Another step.\n“Quite!” Draco backed up.\n“Not even a little bit?” asked Potter, and he’d always been a bully. He was crowding Draco against the wall of the kitchen, still not touching him but there wasn’t any room; there wasn’t any room to breathe, and it was shocking that Potter wasn’t really any taller than him. If anything he was shorter, but his presence was so imposing—big shoulders, strong arms, and Draco wasn’t turned on; he wasn’t— \n“Maybe just this once,” Potter murmured, and snogged him.\nDraco didn’t know what to do. It was Harry Potter, and Draco didn’t want to be used, but Potter was kissing him and he smelled fantastic. He felt fantastic; he tasted fantastic—clean, like some kind of minty mouth potion, as though he had prepared for this, as though he had known it would happen—and of course, he’d known it would. He was Harry Potter; he could do anything he wanted.\nHe smelled so subtle, like some perfect kind of cologne that caught at the very edges of Draco’s senses, and Draco wanted to lick him all over just to chase the scent. Potter’s cloak—that expensive cloak—was in Draco’s hands and it was soft and warm, so smooth, and Draco didn’t even know this fabric. He always knew the fabric and he didn’t know this; it was wool but it wasn’t; it was softer, some sort of magical vicuna and Draco didn’t know. He didn’t know. He just wanted to roll up in it and die.\nPotter pulled away.\n“I still don’t think you’re anything special,” Draco told him.\n“Jesus,” Potter said. “You’re brilliant.”\nDraco thought it was a joke at first, a jeer. Potter’s fingers had found the holes on his jumper and the jumper wasn’t vicuna. It wasn’t even cashmere. But then Potter was taking off his cloak, sinking down, and Draco finally registered the breathlessness in Potter’s voice. It sounded like honesty, and Potter was on his knees.\n“This isn’t shagging, if you don’t want shagging,” Potter said, opening Draco’s trousers. His hands were hotter than other people’s hands, so hot that when he touched Draco’s pants, Draco wondered whether Potter was sick; maybe Potter had a fever. “I won’t do it if you don’t want me to. But can I—?” Then he was reaching in and taking out Draco’s cock, his hand so hot and calloused. “Please?” Potter said, looking up.\nUnable to speak, Draco nodded, and then Potter’s mouth was on him. His tongue was circling the head, then he was opening his mouth, then he was taking it—he was taking it and taking it, all of it, all the way down, down into his fiery hot mouth and Merlin. Merlin and the Prophets, all the Delphic Oracles, oh God. Oh God.\nIt had been so long. So, so long and Draco couldn’t even remember the last time. He couldn’t remember it. He couldn’t look—couldn’t look at Potter’s mouth, that horrible hated mouth, wrapped wide around his cock and the inside of Potter’s throat was—God it was—it was tight, it was horrifically tight—hot and silky—and Potter’s hair—Potter’s hair—\nDraco’s hands were in it, Potter’s magical hair and he would have thought it would feel like potions but it didn’t. It was soft, softer than Potter’s cloak, softer than anything in the world except for maybe Potter’s throat, and the way his throat felt wrapped around his cock, and the way it was even tighter, even sweeter, even more awful when Potter swallowed and slid off.\n“Oh,” said Draco—just that one little cry, and his hips bucked up in Potter’s face; he couldn’t help it.\nPotter just wrapped his hard warm hand around Draco’s cock again and held it, held it steady for his tongue and that terrible mouth and all the horrible things Potter started doing to it—licking his way up, then down, then twisting all around.\nDraco moved his hands through Potter’s hair as Potter did these things and he couldn’t stop despising himself, because he knew he was going to let Potter fuck him. He was going to let Potter use him; he would have been Potter's slave had Potter asked him, and Potter had to know it. Potter had all the power here; he could have power over anyone he wanted. He had killed the Dark Lord; he could make anyone do anything. Draco must just have been a particularly easy mark.\nWhat Draco hated most about it was that maybe it was what he had always wanted. When Draco remembered all those days of hating Potter, maybe he had really wanted this. When he’d stepped on Potter, broke his nose, told on Potter and sabotaged him, tried to give him to the Dark Lord—maybe it was because he had known that he would do anything for attention, anything just to have some part of Harry Potter, any part of him, because Potter was big and important, and deep down Draco knew that he himself was nothing.\nHe’d worked for the life that he had now, fought for it, earned it. He was happy with it most days; he was fine. Sometimes he was even proud of it, all that he had got himself—and yet, deep down, he’d always known how worthless it all was. He’d always remembered that other world—that big expensive world with its big expensive houses and its fame, its heroes and its hatred, and no matter what he did, Draco would always want it. He’d always be a slave to it.\n“You’re amazing,” Potter said. One hand was cupping Draco’s testicles and the other was tugging at the broken hem of Draco’s jumper, and his lips were mouthing the base of Draco’s cock. “You’re really goddamn good,” said Potter, and Draco jerked Potter’s head away.\n“I’m going to—”\n“Give it to me,” Potter said, and wrapped his hand around the tip of Draco’s cock.\nDraco couldn’t help it. He jerked into Potter’s hand, hips moving uncontrollably, and Potter held on to him, got it all inside his hand. When it was over, Potter had it all, this sickly white mess sticking to his fingers. Then he stood up, and licked his hand.\n“Ugh.” Draco looked away. “Wash your hands.”\n“Okay,” Potter said, and went over to the kitchen sink.\nUnable to bear the sound of the running water, Draco closed his eyes. A moment went by, a minute—Draco didn’t know how long, and then Potter was back. Feeling the heat of his body, Draco cracked his eyes open.\n“I’m,” said Potter. “That was . . . thank you.” Then Potter kissed him—on the cheek this time, gently, like a kiss of fire.\nDraco felt completely drained, so tired. He honestly could not remember the last time he had had sex, but he wasn’t about to let Potter think that he didn’t know how it was done—as if Draco would ever let anyone do that to him without reciprocating. “Okay,” he said, catching the edge of Potter’s shirt before he could pull away. “We can shag.”\n“Well, you know, I lied a little.”\nDraco found himself opening his eyes again. He didn’t know he’d closed them. “What?”\n“Some people would call what we just did shagging.”\n“I meant cock.” Draco closed his eyes. “In the arse.”\n“Oh.” Potter leaned in closer. “I’d like that.”\nPushing him away a little, Draco moved out from against the wall and did his trousers up again. “The bedroom, then.”\nPotter turned to look at him, but didn’t move. “Can we stay in here?”\n“No.”\nThe corner of Potter’s lips turned down in a wistful way.\nDraco rolled his eyes. “I’m not getting fucked on the kitchen table, Potter.”\n“Oh no, that’s—I’m . . . I’d much rather you do the—the fucking.”\n“I—what?”\n“If you like,” Potter said hastily. “I’d rather, you know . . .” Potter gestured vaguely, and Draco didn’t know at all. Potter took a quick breath. “I’d rather bend over the table and have you fuck me. From behind. If you want. Please.”\nDraco stared at him. \nIt wasn’t that he was opposed to Potter’s suggestion—and Potter wanting to get fucked really should have been no more shocking than Potter wanting to be the one to fuck him. There was something about the way that Potter had said it, however, that took Draco by surprise. The king who dressed in peasants’ clothes shagged the barmaid because that was what he thought a peasant would do. It was just another great adventure, and when it was over he would go back to his queen.\nPotter didn’t have a queen, Draco thought wildly. The last person he could remember he’d heard was shagging Potter was the Weasley chit, and that had been ages ago.\n“We don’t have to.” Potter’s voice was quiet. “I’ll shag you if you want me to. I’d just really rather have you do it to me.”\n“Okay,” said Draco.\n“Okay?”\n“Do I have to say it twice? Okay, yes, okay, I’ll fuck you.”\n“Great.” Potter’s mouth ticked up at the side, and he looked around. “Do you have any . . . lube, because really I prefer—”\n“Yes.” The answer was actually no, because usually when Draco wanked he was in the shower, and shampoo did as well as anything, but Draco wasn’t about to mention how rarely he had sex.\n“Okay.” Potter still wore that strange smile. “Where—”\n“Accio oil.” A bottle snapped into Draco’s hand. It was the same vegetable oil he’d used on his pasta.\n“Thank you,” Potter said, taking the bottle.\nDraco looked away. “I’m—I’m going to clear the table.” There were several mending spells going on, and shagging wasn’t an excuse for ruining his few good clothes. Picking up the garments, Draco put them on a clean spot on the counter. He thought about leaving the spells running so that the mending could be finished, but it seemed so desperately practical. He was going to fuck Harry Potter. With a wave of his hand, Draco stopped the spells.\n“Can you leave them on?”\n“What?” Draco looked over his shoulder.\nPotter had his hands on his trousers, but his eyes were on Draco. “The mending spells,” Potter said. “I like them.”\nDraco looked down at the torn clothing. “That’s a weird kink, Potter.”\n“I know,” Potter said, and pulled his trousers down.\nAs Draco cleared the rest of the table, Potter prepared himself. It was strangely disturbing, the way that Potter did it—casting protection spells on his arse like a job to be done, beginning to finger himself in the most utilitarian way. He hadn’t even taken all his clothes off, just pulled his trousers and underpants down. He wasn’t doing it to entice anyone or to get himself excited—if the looks of his front were anything to go by, Potter was already excited.\nAsking Draco to fuck him didn’t really change anything—maybe Potter always preferred it that way, maybe he thought that it would be more of an “experience.” But it occurred to Draco, watching Potter prepare himself, that maybe Potter wasn’t just trying to have an “experience.” Maybe it wasn’t all just a laugh.\nMaybe Potter was actually tired of being rich and famous and gorgeous and celebrated and well-liked and popular. Maybe he was tired of not being able to go anywhere without people knowing his name, and Draco could even almost understand it. \nDraco couldn’t walk some streets without people hissing, without people throwing vegetables, without people whispering and jeering—all because they knew his face. They knew who he was. It had taken a long time for anyone to begin to forget, and it had taken just as long or longer for Draco to find the places where it didn’t matter as much, where people didn’t care. Nine years later, he was still finding those places—pockets in wizarding London, low-end districts with lots of newly-arrived immigrants and high turn-over, parts of Muggle London in which it was possible for a wizard to get by.\nPotter didn’t have quite the same reasons for wanting to remain unrecognized. It must be very difficult kissing babies, listening to applause when he entered a room, sleeping on unicorn-hair sheets. Draco understood. He understood perfectly, and suddenly he wanted to show Potter, show him that he understood. Something tight coiled within him, something hard and mean, and then he was glad that he was fucking Potter—glad, because he could show him. He could show him exactly how much he understood.\n“Stop it,” Draco said, putting the last sock on the counter.\n“I’m sorry?” Potter said, arching to look at Draco.\n“Let me do it.” Coming over to the other side of the table, Draco picked the bottle up, poured a small pool of oil in the curl of his fingers, then spread it around. “Come here. Turn around. Face the table.”\nPotter looked a little lost, but he did what he was told. Draco pushed down on the middle of Potter’s back with his greasy hand. The shirt was linen and expensive, and Draco wanted to ruin it. He wanted to tear it apart, but instead he just trailed his hand down over it, down to Potter’s buttocks, pressing a finger inside, pushing. The inside of Potter’s arse was as silky as his hair, decadent as his trousers, hot as his throat. “Merlin,” Draco said, releasing a breath.\n“I can take more,” Potter said.\n“Do you ever tell anyone?” Draco said, and slid another finger in. It was slick but tight, and Potter’s arse clamped down on his fingers, contracting as though trying to suck him deeper inside. “You ever tell anyone you take it up the arse?”\nPotter sounded surprised. “Usually they find out, if they’re going to fuck me.”\n“Anyone else?” Draco said. “You ever tell your fans?”\n“I.” Potter sounded confused. “It’s not their business.”\n“No. It isn’t.” Draco put another finger in and he could feel Potter working the muscles of his arse, trying to accommodate it. “None of it is their business, is it? They think they know you, but they don’t. Do they?” Draco’s fingers twisted, and Potter gasped.\n“Jesus.”\n“They think you’re special, don’t they,” Draco said, and put another finger in. There were four fingers, slicked and greasy, pushing into Potter’s hole and Potter was taking it, stretching for it, arse wrapping tight around those fingers and squeezing hard. “But you’re not special, are you?” Draco said.\n“That’s good,” Potter said. “Christ, that’s so good.”\n“Are you special?” Draco jammed his fingers in, hard.\n“Don’t stop,” Potter said.\nDraco stopped, pulling his fingers out even as Potter’s arse wrapped tight around them, trying to hold them in. Unfastening his own trousers once again, Draco was a little bit surprised to find that he was fully hard. That hadn’t happened twice in a row in a very long time, and the hot, mean thing inside of him coiled tighter. “This is why you want me to fuck you,” Draco said, putting his hand on Potter’s posh shirt again, smearing it with grease and sweat from Potter’s arse. “It’s because I know you’re not special.”\n“Malfoy.” Potter’s hips made a little movement up against him, arse brushing Draco’s dick even as Draco held him down. “Please—please—I want . . .”\nPushing him down harder, Draco leaned over him, cock lined up with Potter’s arse, breath brushing the shell of Potter’s ear. “What you want is for me to treat you just like anyone else.”\n“Yes.” Potter’s hips bucked against the table.\n“You want me to fuck you just like anyone else.”\n“Yes—Malfoy—yes—” \n“Say it.” Draco reached between them, lined up his cock with Potter’s entrance. “Tell me you’re not special, and I’ll give you what you want.”\n“I’m not,” Potter said.\n“You’re not what?”\n“I’m not special; I never was; I’m not anything—I’m just—I’m just—just—Jesus. Malfoy,” Potter said, and Draco pushed in.\nIt was good. It was slick and warm and really, really good, the small muscle of Potter’s rim squeezed tight around Draco’s cock, pulling him farther in, sucking him into this clinging wet space that was so dark and secret, forbidden in this moment to anyone but him. \n“This is just an arse like any other arse,” Draco told him, pushing in again. “You’re hot like any arse,” he said, and thrust; “you’re wet like any other arse,” he said, and thrust, “and you get fucked,” he said, and thrust—“just like any—other—arse.” Draco pushed in hard, Potter bucking up under him.\n“Malfoy, Jesus, Malfoy, yes, just like that, just like that—”\n“You’re not anybody are you?” Draco said, and sank one of his hands into Potter’s hair, Potter’s magic, perfect hair. “You’re not anyone at all, you’re just a nobody, just a nobody—”\n“Please don’t stop—” Potter’s hips jumped hard against the table; it had to hurt his cock, but Draco hadn’t even seen it yet and Potter was pressed down too hard. Draco couldn’t get his hand between Potter and the table, so he settled for stroking his fingers around Potter’s rim, touching it while he fucked him, his other hand in Potter’s hair. “Please,” Potter said. “More, please, harder, don’t stop—”\n“What if this is all you’re good for?” Draco said, and God, he was close; he was so close. “What if this was all you were meant for?”\n“Don’t—Malfoy, don’t, please, please don’t stop—”\n“I know you, Potter,” Draco whispered, breathing into Potter’s hair. “You’re no better or worse than anybody else.”\nThen Potter came—a long, hard arch of his back, a stiffness in his shoulders, a jerking of his hips. Draco put his hand inside Potter’s expensive shirt to hold him down. Potter’s skin was soft, supple over long, hard muscle—feeling that and the soft linen, Potter’s hole tightening convulsively around him, Draco came too.\nIt went on so long and there was so much that Draco couldn’t remember having ever come that hard. Potter just took it all; he took it and took it, hips coming back for it again and again.\nWhen they were done there was a long, hot moment, Potter still bent over the table, Draco slumped against him. He could fall asleep like this, softening inside of Potter, and God, he’d fucked Harry Potter. He’d fucked Harry Potter over his kitchen table and his socks were on the counter, being slowly mended by a sewing spell.\n“That was brilliant,” Potter said, as Draco pulled out.\nDraco found his wand, cleaned up Potter, cleaned up himself. As he pulled his underpants and trousers up, Potter stood, slowly stretching. “That was bloody amazing,” Potter said. “I feel like I could sleep forever.”\nDraco paused as he buttoned up his trousers. “You can’t sleep.” \n“I didn’t mean I was going to do it here.”\n“I meant, you can’t . . . normally?”\nPotter smiled, a little sadly. “You thought I was buying all that Dreamless Sleep just for fun?”\nFor some reason Draco had never thought about it until now. \n“I should go.” Potter buttoned up his trousers. “They’re naming a school in Belfast after me. I’m supposed to go to the opening ceremony.”\n“A school?” Draco said.\n“It’s some posh private school.” \n“In Belfast.” \n“It’s a load of bull, if you ask me. Hogwarts should be good enough.”\nFor some reason, Draco couldn’t look at him. The spells on the counter were still going, and pan half full of pasta was in the sink. It was full of dirty dishes; there were cracks in the tile on the floor, and Potter was going to Belfast to get a private school named after him. “You’ve stained your trousers,” was all that Draco said. \n“What?” Potter looked down.\nDraco gestured vaguely at the wet spot on the front. Potter hadn’t pulled them down far enough. “There.”\n“Oh,” said Potter. “I don’t care. I hate these anyway. They’re too tight.”\nDraco mumbled.\n“What?”\n“Then why did you wear them?” Draco said loudly.\nPotter looked down at the trousers again, surprised. “I found them on the floor.”\n“I think you should go.” Draco looked around. He needed a drink, but he couldn’t remember where he’d put the firewhiskey.\n“Are you okay?” Potter said.\n“I’m fine.” Draco went over to the sink, started spelling the dishes clean himself. “Belfast is several Apparition points away.”\n“No, he doesn’t,” Potter said. “Go away.”\nPotter’s voice was low, and Draco ignored him. Draco couldn’t deal with Potter talking to himself right now.\n“Thank you for the shag,” Potter said, his voice normal.\nDraco banged a pan in the sink, loudly. “Any time.”\n“I’ll take you up on that.” Then Potter was there, his fingers light on Draco’s back, his lips by Draco’s ear. “Good bye,” he said, and kissed his cheek.\nDraco didn’t turn around until after Potter went away, when he realized that Potter had left his cloak, crumpled in a puddle on the floor. Draco wanted to stomp on it. He wanted to pour oil all over it. He wanted to cut it up in little pieces, but then he picked it up and it was so soft, so smooth. It was so expensive, and it smelled like him.\nInstead of ruining it, Draco repaired the little rip along the edge with a careful spell and hung it up in the closet.\n*\nDespite what Potter had said, Draco didn’t think that he would see Potter again.\nWhen Draco thought about it, he couldn’t regret it. It had been forever since he’d last shagged, and he’d forgot how good it felt. He felt loose and limber for days afterward, like something tight inside him had uncoiled, although he wasn’t completely sure if it was the sex or Potter that had done it in the end. \nThe sex had certainly been nice, but there’d been something about shagging Potter over the table—something about the way he’d talked to Potter while he’d done it—that made Draco feel as though something had finally been resolved. It was as though he’d proven something he’d always believed—that he and Potter were the same, that Potter was no more and no less than he was. They were equals, he and Potter, and what had happened all those years ago was less about good and evil and far more about being young and making mistakes.\nDraco had never believed that Potter was a saint, any more than he had believed that he himself was a demon, and deep down, Draco knew now that Potter didn’t believe it either. Even if the world would never know, the two of them were finally even, the score between them finally settled. That chapter of his life was closed at last.\nIt stayed closed until the door to the apothecary opened five days later, and Potter once again walked inside.\nIt was the height of the busy season, such that even though it was close to closing time, there were still several customers in the shop. As was his wont Potter went toward a back corner, wearing a truly awful curly brown wig. No one paid him any heed, minding their own business. After several minutes of this, Draco came out from around the counter, walking to the back toward Potter.\n“You’re not fooling anyone,” Draco said, his voice low.\n“I’m not?” Potter looked surprised.\nDraco rolled his eyes. “I can spot you from a mile away.”\n“Most people can’t.”\n“Your scarf is angora.”\n“What?”\n“Your scarf,” Draco said, “is angora.”\n“Oh,” said Potter. “I thought it was tartan.”\n“It is tartan. It’s also angora.”\n“All right,” Potter said.\n“And that wig,” Draco said, deeply annoyed. “It’s frightfully ostentatious.”\n“It is?” Potter sounded surprised again.\n“Why on earth wouldn’t you just transfigure your hair?”\n“It won’t take,” Potter said.\n“At the very least you could change your eye color, if you were truly trying to disguise yourself.”\n“Spells don’t take to my eyes, either.”\n“Yes, they do.”\nPotter looked still more surprised. “No, they don’t.”\nDraco rolled his eyes again. “Everyone remembers you were a specky git at Hogwarts, Potter.”\n“Oh, that.” Potter frowned. “I got Muggle surgery.”\n“Muggle . . . surgery?”\nPotter nodded. “I thought I’d be less recognizable without the glasses. Instead everyone started taking even more pictures of me.”\n“Less recognizable.” \n“Sometimes I just don’t want to . . .”\nDraco tried not to grit his teeth. “Sometimes you just don’t want to what?”\nPotter touched his tongue to the corner of his lips. “Stand out,” he said at last.\n“You don’t want to stand out.”\n“No.”\nThey were going to shag again, Draco realized with a sinking feeling. Potter was dismal at disguising himself, which made it all just seem like a joke, but it wasn’t. It really wasn’t. He was obviously trying—it wasn’t just about eating the local food and fucking the local peasants; it wasn’t just about the mystique of something new. In between statues being carved in his likeness and schools getting named after him in Belfast, he wanted to be seen for who he really was. \nMerlin, it must be so hard for him, no one knowing who he was deep down, no one knowing the real Harry Potter, the Potter who wasn’t a hero, who wasn’t a king, the Potter who was just a man. He must really feel all by his ickle lonesome, just like no one understood, because it was so difficult riding nothing but luxury brooms, wearing nothing but hand-tailored designer clothing.\n“Why don’t you just use Polyjuice?” Draco asked finally, trying not to let his resentment show.\n“Bicorn horn is regulated.”\nDraco marched over to the other side of the shop. Searching the shelves, he picked out a potion, then came back to Potter. “Here,” Draco said, holding out the bottle.\n“What is it?” Potter said, taking it. \n“A cosmetic.”\n“Make-up?”\n“Stop wearing wigs,” Draco said. “Brush your hair for once. Cover up your scar. Trust me. It will make you look a trifle less like you should be in a Halloween pageant and a great deal more like—like a normal person.”\n“It wouldn’t make you look like any less of a reptile.”\nDraco stared at him, but Potter wasn’t looking at him. Instead he was cocking his head, eyes off to the side. “It wouldn’t be that way if it wasn’t for you,” he said, his voice low and tight, the way it was when he was being crazy.\n“Potter,” Draco said impatiently.\nPotter’s eyes snapped over to him. “Do you wear this stuff?” he said, his voice back to normal.\n“I . . .” Draco touched his sleeve. “Why should I?”\n“You just look so . . .”\nDraco straightened his spine. \n“Good. You look really good,” Potter said, and licked his lips.\nDraco felt his face heat. “There are other customers,” he said, ducking his head down.\n“Of course,” Potter said. “When does the shop close?”\n“Ten minutes.”\n“Good. Want to get supper?”\n“I had intended to go home.” Draco still couldn’t look at him.\n“Even better. I like pasta.”\n“Pardon?” \n“Last time,” Potter said. “You were eating pasta from a pan. I can make you supper. I like to cook.”\nLast time, Potter had been sucking Draco’s cock. Draco swallowed hard. He shouldn’t let Potter do this. He shouldn’t let Potter do this to him—so what if Potter was bored, so what if Potter was tired of being worshipped, so what if Potter felt really fucking sorry for himself; Potter didn’t deserve pity. He didn’t deserve anything; he was just a bloke. He was just a bloke just like any other bloke.\n“Let me cook for you,” said Potter. “Don’t say no.”\nDraco said yes.\n*\nPotter didn’t cook for him. \nDraco closed the shop and they Apparated to a Muggle alley. It was the closest place to Draco’s flat to which it was safe to Apparate without Muggle witnesses, and after that they had to walk three blocks. Draco had stopped Apparating directly to the flat after Muggle neighbors started asking why he never left but also rarely answered the door. Being seen leaving and entering helped allay many Muggle suspicions—and that way, too, he got to know the neighbors. It was useful sometimes.\nAs they walked, Potter talked about cooking. “I used to cook a lot,” he was saying, “when I was little. I’d do it with my aunt. She taught me all the basic things—you know, how to boil the water, how to cut the vegetables. I still know how to poach an egg. I didn’t like it then, but I sort of miss it now.”\nDraco could picture it very well: ickle Potter with his rudimentary magic, producing a sloppy plate of runny eggs, while Potter’s awestruck Muggle relatives oohed and ahhed, praising him to the skies. It was no wonder Potter never thought that he could fail—most likely he never had. Draco thought about the first time he’d tried to ride a broom, how disappointed Father had been. Then he put one foot in front of the other, and didn’t think about it anymore. \n“I haven’t done it much since then,” Potter went on. “Well, sometimes when we were camping. Did you ever go camping with your friends?”\nDraco shook his head. They entered his building, and started going up the stairs.\n“I did it quite a few times,” said Potter. “Some nights were a complete disaster. But other nights . . . . Sometimes food tastes better that way, just bangers over the fire, and coffee cooked in a pan. Nothing fancy. It feels like you’re the only people in the world. Like nothing could ever touch you, because you’re together, and the stars are all around you.”\nAs Draco opened his door with the Muggle key, he tried to imagine Pansy or Vincent willingly going camping just for fun. They would have thought that it was tremendously stupid. He would have thought that it was stupid too, and he opened the door.\n“I still don’t have any lubricant,” Draco said, as they went inside the flat.\n“That doesn’t go in pasta.” Potter closed the door behind them.\n“No.” Draco went into the kitchen to feed Aloysius, who was nowhere in sight. He usually hid when other people came here. “Take off that ridiculous wig,” Draco told Potter, who had followed him.\n“Okay.” Potter took it off, and put it in his pocket.\n“And those charms.”\n“Okay,” said Potter, and closed his eyes. The charms slid off, and Draco sucked in his breath. He’d yet to see Potter use a wand, he realized. \nDraco pulled out a chair at the kitchen table. “Sit down.”\n“What are we doing?”\n“I’m going to suck you.” \n“I . . .” Potter’s lips made a strange, confused shape, just like a strung bow.\n“That’s what you want, isn’t it?” Draco asked, coming closer. “It’s why you’re here.”\n“I.” Potter backed up against the wall between the kitchen and the sitting room. “Honestly, I just wanted to see if I still knew how to boil water the Muggle way.”\n“You want to be ordinary.” Draco smiled, not in a nice way, and came closer. “I make you feel ordinary.”\n“I—well, I—I don’t think I would have phrased it that way, Malfoy.”\n“But that’s what you want, isn’t it? It’s what you desire.” Draco had Potter up against the wall now, and Potter was big but Draco was tall. He was lean but strong, and he knew that when he wrapped his hand around Potter’s stupid scarf, he could hold him there. “You desire to feel ordinary,” Draco told him, his tone almost mocking.\n“I—yes.”\n“Excellent. Then what could be more ordinary—” Draco leaned in to Potter’s ear, his voice low—“than wanting a good cocksucking? That’s desperately common.”\n“I suppose it’s fairly regular—”\n“Any man.” Draco’s voice was a harsh whisper. “Any man will tell you that they want it. They want a good cocksucking. Say it.” He pressed his hips in, and Potter made no move to escape. “Say you want it.”\nPotter swallowed hard. “You just get right down to business, don’t you?”\nDraco moved his hand down between them, over Potter’s silky wool trousers. “Say it, Potter.”\n“I—oh. God. Um, okay, I want—” Potter tried to move his hips, and Draco held him hard against the wall. “I want—”\n“Say you want me to suck your cock,” Draco said.\n“I’ll tell you want I want,” Potter said, and kissed him.\nTaken completely by surprise, Draco let him, and then Potter’s tongue was in his mouth, his hands on either side of Draco’s face. Potter kept kissing him and kissing him, as if snogging was the best thing ever invented, and Draco was losing control of the situation. \nHe didn’t want Potter to cook for him. He didn’t want Potter to kiss him. He didn’t want to be seduced, for this to be treated as anything other than it was—Potter wanting a break from his real life. Potter wanted to drop the charade, wanted to be like anyone else, and honestly it was fine. Draco could do it. He would do it, but he’d do it on his own terms—he’d use Potter just like Potter was using him; if this was going to happen, Draco wanted to make a choice about it. \n“Stop.” Draco pushed Potter away. Then he got on his knees, and started opening Potter’s trousers.\n“Okay,” said Potter, and leaned back against the wall. “I—it’s good you’re honest.”\nDraco got Potter’s cock out, reached one hand up to hold onto Potter’s stupid, ridiculously soft angora scarf, then swirled his tongue around the head.\n“God,” said Potter. “God, that’s—” His head thunked back against the wall. “That’s good.”\nDraco slid his tongue against the side of Potter’s cock. He knew he wouldn’t be able to get all of it in his mouth—he didn’t have the skill that Potter did, which was nothing new. Potter probably could have a bloke any time he wanted; he was probably turning them away, they all wanted him so badly, whereas Draco—Draco—\n“God,” Potter said again, and his hand slid down into Draco’s hair. \nDraco’s hands clutched tighter in Potter’s scarf.\n“Draco,” Potter said, and Draco took the tip of Potter’s cock in his mouth. Potter tilted his hips upward slightly. \nIt didn’t really matter that Potter was an expert cocksucker just like he was an expert everything, or that as it happened Draco was pants at it just like he’d turned out to be pants at everything, just because he never got much opportunity to do anything he wanted. Potter liked it anyway.\nDraco pulled away, squeezing the base of Potter’ cock tight with one hand, the other still twisted in Potter’s scarf. “Just like anyone else,” he said again, then swirled his tongue around the head.\n“I—I yes.” Potter’s voice was breathy. “Yes, it’s just—I’m just—” Draco traced the vein down Potter’s cock with his tongue, and Potter’s hips moved in a shaky way. “I’m just like everyone else.”\n“You need it.” Draco swirled his tongue again.\n“Yes. Yes, Draco. Yes.” Potter’s hips shook again, obviously involuntarily. \n“I can make you need it.” Draco’s hand twisted on his scarf, tightened on his cock. “Just like anybody else.”\n“Yes. Please, yes. I need—” Draco twisted the scarf, and Potter’s words came all in a rush. “I need a good cocksucking, just like anybody else.”\nDraco filled his mouth with cock and Potter filled his hands with Draco’s hair—not pulling him inward, not forcing his throat, but petting him and stroking, exactly the way that Mother used to do. Draco should not have found it hot, but he did, and Potter kept saying, “You’re right, you know what I need, you know me, Draco; I need it; I need you—”\nAnd then he was coming. Draco kept his mouth around Potter’s cock, and it was strange because it was Potter’s cock, but he had told Potter the truth—Potter was just like anyone else, and this wasn’t special because it was Potter. It was just sex, and neither of them particularly cared for each other; Potter just wanted to be normal and Draco just wanted to get off, but he didn’t know why swallowing made him grow so much harder between the thighs. Merlin, he was going to come just from sucking Potter off.\nThen Potter was pulling him off his knees and kissing him, wildly kissing him, a flurry of limbs and hands and teeth, and Draco wasn’t sure what was happening. His mouth had to taste like come, but Potter just kept snogging him, snogging him and snogging him and snogging him. Potter’s lips were on his jaw, along his jaw, behind his ear until he found a spot that made Draco writhe, and then Potter’s hand was on Draco’s cock and Potter’s tongue was in Draco’s ear. Potter was everywhere, hotter than any person Draco had ever felt.\n“No,” Draco said, locking a hand around Potter’s wrist.\n“No?” Pulling his tongue out of Draco’s ear, Potter stopped fumbling with the zipper on Draco’s trousers.\n“I want you to fuck me,” Draco said.\n“Oh.” Potter pulled away, looking like he’d walked into a post.\n“I’m not going to treat you any different,” Draco said. “I’m not going to worship your cock. I don’t want it in me because you’re Harry Potter—was that what you were afraid of last time?”\nPotter frowned. “I wasn’t afraid.”\n“Of course not. You never are.” Taking Potter’s hand, Draco turned toward the bedroom.\nPotter pulled out of his grip. “Sometimes I am.”\n“Pardon?”\n“Scared.” Potter still wore his little frown. “Sometimes I’m scared.”\n“Merlin, Potter.” Draco rolled his eyes. “You think I don’t know that? You think I don’t know the bravado’s all an act? I know. Trust me. You don’t need to convince me that beneath the façade of fearless leader, action hero, you’re a vulnerable person with just as many insecurities and needs and dreams as the rest of us, I know.”\n“Oh. Just so long as that’s clear.”\n“It is clear, Potter. It’s crystal. Will you fuck me, now?”\n“Sure.” Potter licked his lips.\nHe was ridiculously attractive, and it occurred to Draco that in that moment, Potter wasn’t trying to be. He wasn’t trying to be attractive like he usually was. He just was. Draco looked away. “Accio oil,” he said, and stalked into the bedroom.\nAloysius came out from under the bed, meowing. Draco unfastened his trousers, started taking them off. When Potter came into the room at last, Aloysius streaked out the door.\n“Lumos,” Potter said, just as Draco said, “Don’t.”\n“I want to—”\n“I don’t want to see you,” Draco said. \n“Okay,” Potter said quietly, and the light went out.\nIt wasn’t true. There were very few things Draco would have liked to see more than the sight of Harry Potter fucking him, but Draco didn’t want Potter to see the scars, much less the Dark Mark. Potter would make a big deal out of them, and Draco didn’t fancy the idea of getting shagged with his shirt on. There was light from the corridor and light from the moon streaming in the window—more than enough to see by. Once he’d got undressed, Draco picked up the bottle of oil again.\n“Can I,” Potter said. “Can I do it?”\n“Fine.” Draco cast the spells he needed to on his arse, then handing Potter the oil, he went and got on the bed.\nPotter undressed and then came over, still hotter than a normal person, warm as though sick. His fingertips touched Draco’s chest, just moving there for several moments in the darkness. Potter was probably amused by the light, fine hairs there—Draco never had been able to grow very much. Then Potter’s hand slid down and down, bumped over a scar, and went still.\n“Don’t.” Grabbing his wrist, Draco pulled Potter’s hand farther down.\n“Draco,” Potter said.\n“I said, don’t. Just get me wet, Potter, or I’ll do it.”\n“I’m—okay.” Potter’s voice was shaky, and Draco had known that Potter would make a big deal; he was clumsy pouring the oil in his hand and he was clumsy reaching between Draco’s legs, parting his thighs—\n“What is this,” Draco said, “your first time? Come along and hurry up.”\n“Yes,” Potter breathed, and pushed a finger in.\nIt was slow and aching, a firm, thick slide toward inevitability. That give of muscle, that necessary stretch to accommodate another person—Draco knew the way that it could make him want to open all the way, just stretch wide and surrender everything and he wouldn’t. He wouldn’t, because it was just Potter; it was just sex, so he said, “Potter, you’re not going to be the cock that finally breaks me. Just grease me up and put it in.”\nPotter’s breath caught, and he slid in another finger. “I just—I just don’t want to hurt you.”\nDespite the fact that Potter couldn’t see him in the dim light, Draco rolled his eyes. “Don’t tell me you think it’s bigger than everyone else’s.”\n“No. Well, I don’t think so. I haven’t exactly measured—”\nDraco sat up, felt down Potter’s body. Potter was still fully clothed, but Draco found the flies of his trousers in the darkness, and opened them. “It isn’t,” Draco said, which wasn’t quite true. Potter was bigger and thicker than most cocks Draco had had—of course he was. He was Harry Potter; he had to be bigger and better in everything, but it wasn’t actually saying much because Draco had had so few opportunities to take anyone’s cock, and he wasn’t about to let Potter know that. \n“It isn’t any better,” Draco said, pushing down Potter’s pants and trousers. “It’s just a cock; it’s just for fucking; you’re going to put it in me and it won’t be any different than anyone else.”\nPotter’s breath caught again. It actually caught several times and then Potter was kissing him, pushing Draco back on the bed and fumbling around between them, and Potter was saying things. “Yes, please,” he said. “Yes.”\n“Come on,” Draco said, spreading his legs, trying to help Potter get into position. “Get it in.”\n“It’s not any different,” Potter said, holding himself Draco with a forearm, positioning his cock with the other. “It isn’t,” he said, and then he got it in.\nPotter was pushing in him and it was just like his finger only bigger, thicker, more inevitable, and Draco could feel himself opening, opening, opening, trying to relax, trying to take more and more and more of Potter, all of him. God, all of him. “It’s,” Draco tried to say, and had to catch his breath. He swallowed hard. “It’s just like any other cock.”\n“Please,” Potter said, and damn it all to Merlin’s crystal cave, Potter was so slow about it, his cock coming in so slowly, as though he was just so big, he was afraid of tearing Draco apart. “Please, it is, isn’t it; tell me, Draco. Tell me.”\n“Faster, Potter.” Draco scratched his nails hard down onto Potter’s bicep—but Merlin, it was so thick and strong, roped with dense muscle; Draco wasn’t even sure Potter felt it. And Potter’s cock—his cock—it felt like time itself, coming so slowly and gradually, and yet it changed you, warped you around it, made you change your shape to accommodate it until you would never be who you once were. “Faster, Potter,” Draco said, and scratched again. “Get it in and fuck it—”\n“Draco,” Potter said, and then he was all the way inside.\n“Merlin.” Draco scratched his nails hard down Potter’s back—his hard, planar shoulder blades, sheathed in tight muscle. “Merlin, Potter, you do know how to fuck, don’t you—just fuck; just fucking fuck me like a normal person—”\n“Yes,” Potter said, in his shaky way. He jerked his hips. “Yes—”\n“You want it just like any other person—”\n“Yes,” Potter said again, and thrust.\n“Like that.” Draco arched under him. “Like that; keep doing it like that; you fuck just like any other person; you want to get off like any other person—”\n“Yes.” Potter thrust again, then again. “Yes, I want it, I want you, I want—”\n“You act like you don’t want to fuck,” Draco said.\n“Yes, I want it; I want to fuck you—”\n“But you do.” Draco nails dug down hard into Potter’s shoulder, and Potter was still going too slow—too thoughtfully—but it felt so good. It felt so fucking good. “You really do,” Draco said. “You want to.”\n“Yes,” Potter said, and thrust. “Everything you say. All the things you say. I want you; I want to be you; you’re perfect.”\n“Merlin.” Draco threw his head back. “Harder.”\n“You’re perfect,” Potter said again. “You’re just so good; you’re everything—”\n“What’s wrong with you?” Draco brought his legs up, tightened them behind Potter’s back. “Can’t you go any harder?”\n“Jesus, yes.” Potter gasped, then started thrusting harder. “Like that, Draco, keep on—I need you; I need you all the time—”\nDraco was trying not to listen to Potter’s words. He could fall into those words; he could believe those words; he could want those words. No one had ever talked to him like that before, but he didn’t want it; he just wanted to be fucked—he just wanted to be fucked— \n“Is this all you’ve got?” Draco asked, and tightened his legs again.\nPotter gasped again, then pushed on the backs of Draco’s thighs—spreading him into a new angle and then Potter was giving it to him deeply—so deeply, all the way down, and his hand was on Draco’s cock and he was saying things; he was saying—“Yes, God, yes, it’s all I’ve got; it’s everything I am this is all I am I’ll give it to you you can have it—” \nAnd honestly Potter was really brilliant at this; he was really better than other people; it really was pretty much the best sex of Draco’s life, but he wasn’t going to think about it and God—God, Potter’s cock and his hand and his stupid, rough, croaking voice—his stupid hair, his stupid eyes that were bright even in the darkness—goddamn stupid Harry Potter, who’d just been a specky git no better than anyone else—\nHarry Potter, who was the hero of the wizarding world, was saying—\n“You’re perfect, you’re so perfect—”\n“Potter—”\n“You’re the best, the best, there’s no one else like you—”\nDraco heard a strange sound, then realized he was making it.\n“No one else, no one like you, no one; you’re everything, everything I want—”\nAnd Merlin, that was just too much. It was too much, and Draco was coming; he couldn’t believe Potter was saying those things—Potter, Harry Potter, the hero of the wizarding world. Draco came harder than he’d ever come, and for several moments, he couldn’t even see. Then he was slowing down, gradually slowing down, and Potter’s hand was still on him, but he wasn’t inside him any more; Potter was lying beside him, muttering something.\nDraco could just go to sleep like this; he could curl around Potter in all this messy, sticky sweat and come and he didn’t even care, when suddenly it occurred to him that he didn’t even know whether Potter had come. When Draco pushed Potter’s hand off his softening cock he realized Potter’s other hand was around his own cock, and he could hear what Potter was saying.\n“Draco, please, can you just say those things; say some of those things—”\n“Potter.” Draco tried to push aside Potter’s hand, but Potter was holding his own cock tight, and then Draco could see why—Potter had not only not got off, he was softening. Draco held his breath, listening to Potter’s hoarse broken whispers.\n“Just tell me, please tell me I’m normal—”\n“Potter,” Draco said again, panic slowly starting to rise in his chest.\n“Please. Please, just say it a few more times, the way you do; I can believe it when you say it; I can—”\n“All right,” Draco said, swallowing the sudden bile in his throat. He could do it. He was perfect and he was wonderful and he was exactly what Potter needed; he could do it. He knew what Potter needed. Potter actually needed him; he honestly needed him—\n“Let me touch you,” Draco said, moving away Potter’s hand. Potter finally let him, let Draco wrap long fingers around his half-hard cock, still wet with sweat and slick from Draco’s arse.\n“Please, you’ve got to do it again or he’ll come back; he’ll—”\n“All right,” Draco said again, tightening his hand around his cock.\n“Draco,” Potter said. “He’s coming back.”\nDraco didn’t know who was coming back, but he knew what Potter wanted. Draco knew and no one else knew; no one knew but him. That knowledge made warmth coarse through him, making his voice soft and warm as honey, his words right in the shell of Potter’s ear. He could do this for Potter—only he could.\n“You’re not special,” Draco said. “You’re not different.” His hand moved steadily on Potter’s cock, and under Draco’s words, it began to harden again. “You’re not crazy and you’re not frightening and you’re not anything they say you are.”\n“Please,” Potter whispered.\nDraco tightened his hand and his voice was soft, the way Mother would have talked to him. “You’re not a hero and you’re not a warrior. Nothing is your fault but what you yourself have done.”\n“Draco—” \n“You are not to blame; you aren’t responsible. No one will ever use you, not ever again. You’re not a savior, Harry Potter. You’re a man.” \n“Christ,” Potter said, and came.\nDraco held on, held on through the convulsions and the long white ropes of it, held on tight and finally set his teeth into the taut muscle of Potter’s shoulder and bit down. Hard.\n“Christ,” Potter said again, when he came down. “I’m sorry. I’m so—”\nDraco pulled his mouth off of Potter’s shoulder. Now that Draco’s eyes had accustomed to the light, he saw that Potter had a large scar at the centre of his chest, as well as other scars—all over, little nicks and scratches. “Yes, you’re sorry,” Draco said quickly, instead of commenting on the scars. “You’re terribly sorry. Potter, don’t you know that plenty of men can’t keep it up? They can’t keep it up to save their lives.”\n“But I—”\n“No, you’re not. You’re really not.”\nPotter shuddered. “God. You really are perfect.”\n“I know.”\nThey were silent for a moment—Potter’s breath still laboured until gradually, it evened out. Draco listened to it for a while, thinking. Something was wrong with Potter—he needed this more than Draco had originally thought, and Draco wondered whether Potter even knew he needed it. He should have stopped getting schools named after him in Belfast, if what he really wanted was to be normal. Maybe he just needed it to get off. Maybe he thought he was too special to come. \nThere were too many scars on him for a normal person, and his body heat was ridiculous.\nDraco leveraged himself up to look down at Potter, though he couldn’t see him in this light. “You didn’t go camping for fun, did you.”\n“What?”\n“When you mentioned camping,” Draco said. “It wasn’t for fun. You were talking about when you were on the run from—from You Know Who.”\n“Oh. Yes.” Potter was licking his lips; Draco could tell. “It wasn’t for fun.”\nDraco lay back down beside him, and there was a long moment of silence. \n“Honestly,” Potter said after a while, his voice croaking. “Some of those nights feel more real to me than . . . than anything else since.”\n“Naturally.” Draco’s voice wasn’t quite sincere. “Who were you afraid is coming back?”\n“What?” \n“You said someone was coming back. You were afraid of him.”\n“Oh—oh that.” Potter wet his lips again. “It—it wasn’t anyone. It’s not anything.”\n“Right.”\nThey lay there for several long moments, staring at the ceiling. After about ten minutes, Draco had started to doze.\n“Your cat.” Potter’s voice was breathy beside him, and Draco propped himself up to look.\nAloysius had crept into the room, looking like he thought that he was being very stealthy. He’d edged around the clothes and was surreptitiously sniffing at Potter’s scarf, which had slipped down to the floor.\n“What about him?” said Draco, who couldn’t see anything wrong.\n“It’s just . . .” Potter swallowed hard. “Wonderful. It’s a wonderful cat.”\nDraco flopped back down. “He’s a bag of fleas,” he said, even though Aloysius wasn’t.\n“Then why do you have him?”\nDraco remembered the alley—the wet cardboard boxes, the smell of rubbish. He remembered Alice, even though he had no idea who Alice was.\nIt had been a long time ago. Draco had been running out of what money they had left after all the reparations. The manor had been auctioned off and Draco had been staying with Mother in an inn, when Draco found out that the man who had been keeping their remaining possessions from the manor in storage had swindled them. Draco couldn’t go to the authorities as a former Death Eater, and the worst part was the man who had swindled them had had a point.\n“You need to pay,” he had said. \n“I’ve paid,” Draco said.\nThe man had shaken his head. “You’ve paid the Ministry. You haven’t paid me. Someone needs to pay for Alice.”\n“Who is—” Draco had started to ask, but he had already known.\n“My girl Alice,” he’d said. “My only girl.”\nDeath Eaters had killed her, Draco knew. They had killed so many people, and Draco remembered Dumbledore falling from the tower, falling falling falling, and he was falling too. \nHe was no one; he had nothing, and the man was right. He had to pay for Alice; he had to pay and pay and pay. He would pay his whole life, and he had nothing. There was nowhere to go and nothing to do and no way to take care of Mother—Mother, who was not okay, who never had been since the war, and Draco Apparated—\nAnd just kept Apparating; he didn’t know where he was going; he just knew that he couldn’t go back to Mother; he couldn’t go back to anything he had known or once felt that he deserved; he had to pay for Alice—\nHe had to pay for Alice—\nAnd that was how Draco had ended in that alley, that lowest point in his life with nowhere to go and no one to help him and no money he could use to pay, pay for this life that wasn’t worth anything at all, and the smell of rubbish was overwhelming but he knew; he knew that it still smelled better than he did because he was nothing—he was worse than nothing—\nAnd then he had looked down at his arm. His arm. The one that made the people sneer, the one that made them hate him, the one that they all feared and the one he had to pay for; he had to pay for Alice and if he could not do it with galleons, perhaps he could do it with blood.\nThere had been so much blood, and Draco just wanted it off. He’d wanted it all off, all the skin and muscle and even bone and blood; if he could just get it off, maybe he could pay.\n“Draco?” Potter said.\n“What?” Draco croaked.\n“How did you get your cat?”\nDraco swallowed hard. “He found me.”\n“That’s an interesting reason to get a cat,” Potter said, and a soft chime sounded. Rustling beside him, Potter took something out of his pocket. Then he sighed. “I—I have to go.” \nDraco just kept lying there. He could hear his heart beat. It sounded like it filled the whole room. \n“It’s Kingsley,” Potter said.\nOf course. Naturally. Obviously. Harry Potter was the Boy Who Lived; who was Draco fooling. He rolled over onto his side, away from Potter. “Then you had better go.” \n“I want to stay.”\nDraco closed his eyes, opened them. “One mustn’t keep Kingsley waiting.”\n“Draco—”\nHeaving himself off the bed, Draco found his trousers as Potter watched him silently from the bed. “Accio Potter’s clothes.” The shoes snapped into his hand, and Draco dropped them on the floor beside the bed. “Make sure you clean off the come before you put your trousers on,” Draco said. “You wouldn’t want the Minister to see.”\nDraco left the room. Several minutes later, he heard the pop of Apparition.\n*\nThree days later, Potter came into the apothecary once more.\nDraco had just helped his last customer before lunch and was picking up his quill to finish another paragraph on his next article when the door opened.\n“Was that Anthony Goldstein?” Potter asked.\nDraco looked up. There was no one else in the shop, so Potter was not in hiding, though he had still attempted to disguise himself. Though he wasn’t wearing a wig, his headgear today was not an improvement. It was a plain knitted cap, which did not at all match his rumpled linen suit. Honestly he should just let someone else dress him, but at least he had listened to Draco’s advice and was wearing a potion over his scar instead of an ostentatious charm.\n“Um, is this a bad time?” asked Potter.\n“Yes,” Draco said, making himself peel his eyes off of the linen.\n“Yes, it’s a bad time, or yes, that was—”\n“That was Goldstein. He comes in periodically to buy herbs. Is that a problem?” Draco didn’t mean to sound upset, but he didn’t like that Potter could make his heart beat harder, just by looking at him. \n“No,” Potter said, looking uncertain. “No problem. I just . . . didn’t know anyone else knew you worked here.”\n“I’m sure you would enjoy it if you were, but you actually aren’t the only person in the universe.”\n“Okay.” Potter’s mouth curled in his strange way. “Have lunch with me.”\nDraco’s heart leapt in his chest. “I’m working,” he said.\n“Doesn’t your boss cover your lunch?”\n“Not every day.”\n“But he does every Wednesday.” Potter leaned over the counter. “Today’s Wednesday.”\nDraco’s heart was beating somewhere in the vicinity of his throat. If he wasn’t careful, it could come right out his mouth. If he kept that closed and kept looking at Potter, it would come right out his eyes.\nDraco didn’t know how it could have come to this after just two shags, and yet he wanted Potter. He wanted him so very very badly that the thought of having him again—in the middle of the day!—was making him hard already, and the thought that Potter was using all of his spying to keep tabs on his schedule made him feel a little shaky.\nSwallowing, Draco looked down at his parchment. “Maybe I’m busy.”\n“Oh.” Potter leaned in closer to look down at his writing. “Are you writing another article for the Prophet?”\nDraco’s heart went into free fall. “Who told you?”\nSurprised, Potter leaned back. “Why do you look that way?”\n“Who told you?”\n“No one. I usually don’t read the paper at all. Hermione likes them. She gave me your last one to read.”\n“Does she know?”\n“That you write them? She’s never said anything.” Potter frowned. “Draco, I’m—no one told me. I just thought it sounded like you.”\nThat couldn’t be right. No one had ever figured out that Draco was writing the articles, no matter how much they sounded like him—not that there were many people who knew what he sounded like these days. Mother might have known, but she never read the paper any more. Pansy might have known, but she . . . couldn’t read the paper any more. Mister Tamanam didn’t seem to know, though, and neither did Mister Tamanam’s family; Millie and Montague didn’t know. “Someone had to tell you,” Draco said.\n“No. Honestly, Draco, I swear. I was just reading that last one, and it was about Muggle neighborhoods. Some of the comparisons you made were things you talked about when we had Chinese.”\nSlowly, it began to sink in. “You can’t—” Draco needed to breathe. He tried. “You can’t ever tell anyone.”\n“No. No, of course—”\n“You can’t. I—it’s the one thing that I can—”\n“Draco—”\n“It’s the only way that I can—”\n“Draco.” Potter put a warm, firm hand over Draco’s. “Please listen. I’m the last person on earth that would ever make something public you didn’t want to be public. You know me.”\nDraco stared at him.\n“I just thought it was a nice article,” Potter said, taking his hand away. “You’re a bloody good writer. Even I thought so, and normally you won’t catch me dead reading the Prophet.”\nDraco was trying to think of how to reply to that when Mister Tamanam walked in the door. “Hullo, Draco,” he said. “Time for break!”\nMister Tamanam was a great round man in his fifties, with a balding head and a beard halfway down his chest. He was of a jolly nature, which was why he had been willing to take a chance on Draco. Draco thought that he was an excellent brewer, but had never been able to convince Mister Tamanam to expand the shop. It was a family business, Mister Tamanam said, and he wanted it to stay that way. Despite his lack of ambition, over the years Draco had grown quite fond of him.\n“Sir,” Draco said, standing up.\n“Ravi!” said Mister Tamanam, which was what he always said when Draco called him sir—just another example of his inability to run a formal business. Draco tried to educate him when he could.\nDraco gestured at Potter, who was turning around. “Mister Tamanam, this is—”\n“Barry.” Potter turned around and smiled.\nHe had added disguise charms, Draco realized, half-stunned.\n“Hullo, Barry!” Mister Tamanam said, in his convivial way. “Anything I can help you with?”\n“Yes,” said Potter, moving away from the counter. “I’ve been trying the Sweet Dreams potion from this shop, and I was wondering if you could tell me a little more about your recipe.”\n“Of course,” said Mister Tamanam happily. “Draco, you can go on break. Now,” he went on, turning back to Potter. “What do you want to know?”\n“Well, there are several different varieties,” Potter said, and started walking across the shop, bringing Mister Tamanam with him.\nPotter’s voice faded as they moved across the room. They stood over there talking, just as though Draco were nothing but a salesclerk, and Barry only came here to buy potions.\n“Lunch! Draco! Lunch!” Mister Tamanam called after a minute, making a shooing motion at Draco. “Sometimes if you don’t remind him . . .”\nNo doubt Mister Tamanam was giving Potter a lecture about Draco needing more meat on his bones, which might have been embarrassing had Draco been able to think straight. Instead, he could only think about getting out, getting away, because Potter—of course Potter—\nOf course Potter didn’t want to be seen, didn’t want to be recognized. That was the whole reason Potter was here, wasn’t it; it was why he was wearing that ridiculous hat, wasn’t it; it was why he kept shagging Draco. It was just that it was Mister Tamanam, Draco’s friend—one of Draco’s only friends—that had Draco feeling differently about it, but he shouldn’t. He really shouldn’t, and yet his heart begged to differ. It was in his shoes, then in his stomach like a stone. Once Draco was outside the shop, it beat so hard inside his chest again that it was physically painful, and Draco couldn’t breathe.\nHis arm itched like the bloody dickens.\nDraco walked along the street and didn’t know where he was going. He walked that way for several moments, and the Potter was there beside him.\n“Sorry,” Potter said, looking sort of breathless, but keeping pace beside Draco. Potter had taken off most of the extra charms, but the essential disguise still remained. “I didn’t want him to recognize me.”\n“Barry?” was all that Draco could think of to say.\nPotter shrugged, looking a little chagrined. “It’s the one I use in a pinch. Did you want to go to Shu Castle again, or Village Tandoori?”\n“I’m—I’m not hungry.” Draco tugged on his sleeve.\nPotter stopped walking. “Are you all right? You look pale.”\n“I’m fine.”\n“We could go to Tesco, get those sandwiches, and find somewhere outside to eat. We could do a Muggle park.”\n“You can’t,” Draco began, and stopped. \nPotter frowned, looking down Sop Lane. “It’s a nice day.”\n“I don’t want to,” Draco said instead.\n“Well,” said Potter, “what are you in the mood for?”\nDraco grabbed Potter’s arm, and before he could protest, Side-alonged. They had still been in Sop when they Disapparated, and by Apparating directly into Draco’s flat, they avoided Muggle eyes. None of the Muggles expected him to come home for lunch, so it was not odd that they didn’t see him come or go during the day, but by that point Draco didn’t care.\nHe was kissing Potter; he had Potter up against the wall in his bedroom before Potter could even open his mouth, though when Draco finally let him up to breathe the only thing that Potter said was, “I thought we were going to have lunch.”\n“Shut up,” Draco said, and kissed him again.\nPotter didn’t seem to mind, kissing him back with abandon. Apparently when other people weren’t looking, Potter was all for it, and Draco knew he shouldn’t blame him. Potter didn’t want to be seen at all—not when he was wearing caps and shopping in Sop; there was no reason why he should want to be seen with Draco any more than he should want to be seen when buying potions.\n“I missed you too,” Potter said, when Draco pulled away to unbutton Potter’s trousers.\n“Shut up,” Draco said, yanking down the fabric. He got Potter’s pants down, too. “Shut up. You’re not any different.”\n“No,” Potter agreed. \nDraco got his hands on Potter’s cock, got his hand around his hot thick cock and it was getting hotter, harder. “You’re not any different than me,” Draco said. “We’re the same.”\nThere was a thump across the room, and Aloysius streaked between their tangled legs, out the bedroom door. Draco watched him go.\n“Draco.” Potter’s hands were at his trousers. “Draco, Draco, Draco, please—” Potter got his hands in, down Draco’s pants, tugging the trousers down enough that he could access it easily.\nDraco turned his head to look at him again. “We’re the same,” he said. “You and me.”\n“Draco.” Then Potter was pulling on Draco, changing their positions so Draco was against the wall and Potter was pressing into him, holding both their cocks.\nDraco leaned against the wall, letting Potter do it, letting Potter stroke them both, because Potter could pretend that he was special. He could pretend that he didn’t want to acknowledge Draco, that Draco was nothing to him; he could pretend he didn’t know Draco in public, but Draco knew the truth. He knew the truth. He knew what Potter looked like when he came; he knew that Potter couldn’t keep it up; he knew that Potter needed him, needed him, needed him, and even when Potter eventually got bored and this was over, Draco would still know. He’d still know who Potter really was.\n“I know who you really are,” Draco said, sagging against the door.\n“Yes.” Potter’s hand was around both of them; his cock was touching Draco’s, stinging and warm. “You do.”\n“You don’t deserve any more than me,” Draco said.\n“No,” said Potter. “Please, Draco.”\n“We’re equals, you and I.”\n“Yes, please.”\nPotter was practically holding Draco up and Draco could hardly even see straight; he could hardly even feel it, Potter’s hand warm and tight around them. He just kept thinking of Mister Tamanam, Potter pretending like he didn’t know him; it wasn’t right. It wasn’t right, and yet Draco understood. He understood, but God, he didn’t want to understand, because it wasn’t fair. It wasn’t fair. “It’s not fair,” Draco said, and Potter pushed even closer, hotter, faster. “You’re just like me, you’re not any better than me, you’re not any better; I’m just as good as you; I’m just as—”\n“You’re better.”\n“I’m a man just like you,” Draco said. “You’re not any better; I’m just the same as you—”\n“Draco, please, you’re better.”\n“Oh, God.” Draco’s toes curled; he nearly came off his feet, and then he was coming, coming all over Potter’s cock and in his hand and the rush was so hot and so fast, so full that he felt like he couldn’t feel anything anymore. There wasn’t anything inside him.\n“Draco—”\nPotter was still hard beside him, still frantically touching himself but not quite there, not quite there—\n“Just come on and do it, Potter,” Draco said, exhausted.\n“Oh.” Potter jerked, slamming Draco unpleasantly against the wall.\n“Don’t be a hero,” Draco whispered. “Just do it.”\n“Yes,” Potter hissed, and then he did do it—plastering Draco up against the door as he came, leaning into him so that Draco couldn’t escape, but Draco didn’t mind. He really didn’t mind at all, even when Potter’s hip banged his and Potter was sagging against him such that Draco couldn’t breathe.\n“Shh,” was all that Draco said, and his hands came up so he could touch Potter’s hair. Potter’s thick, rich, luxurious hair, and Draco didn’t care if Potter ignored him in public or was fucking him just for the sake of novelty. No one else got to see Potter like this. No one else knew Potter like this. Draco knew who Potter was; he was the only one. “Shh. Shut it, Potter. There’s no need to whinge about it.”\nPotter was still shuddering, making whimpering sounds.\n“There, there.” Draco patted his head. “One day you’ll be a grown up.”\nPotter made a terrifying sound, leaning deeper into him.\nIt was a laugh, Draco realized.\n“You’re so dramatic about everything,” Draco said, but went back to stroking Potter’s hair.\n“You’re the one who dragged me off in the middle of the street.” Potter’s lips were moving against Draco’s neck.\nTaking his hands out of Potter’s hair, Draco pushed him back, began fastening his trousers. “It was what you wanted, wasn’t it?”\n“Well,” said Potter. “I also wanted lunch.”\nDraco cast a spell to clean his trousers, another to straighten his shirt. “I’m sure you’ll manage.”\nPotter stood there watching him, making no move to fix himself. “I love the way you dress,” he said suddenly.\nDraco paused in the middle of making sure his shirt was tucked in properly. Then he went back to doing it, not meeting Potter’s eyes.\n“It’s just so . . . careful.”\nDraco straightened his hair, not looking at Potter. Potter, of course, didn’t even know what he was saying, but it was just another reminder that while Draco’s hovel of a flat and dead-end job were somehow fascinating to Potter now, they wouldn’t always be. Draco had thought that he didn’t care, but the way he had reacted to Potter pretending like he didn’t know him in front of Mister Tamanam was proof that that was not the case. Slowly, very slowly, Draco was realizing that this thing with Potter was dangerous.\nIt was really dangerous. He shouldn’t keep it up, and yet Draco knew he would. He’d jump the moment Potter asked, and he’d keep jumping right up until Potter decided he didn’t need him anymore. \n“Some of us do not have fifteen hundred galleon suits to rumple,” was all that Draco said. \n“This suit was free.” Potter sounded like he was frowning. \nGlancing in the mirror, Draco found that he did not look at all like he’d just been shagged. Good. “I have to go back to work.”\n“What?” said Potter. “Don’t you get a full hour?”\n“I don’t like to take advantage of Mister Tamanam.”\n“He’s a nice bloke.” Potter finally started fastening his trousers. “Is he a nice boss?”\n“He’s a fine employer. Now, if you’ll excuse me, Potter, I really do have to return to work.”\n“Hey.” Having just got his trousers fastened, Potter grabbed Draco’s arm. “What’s wrong?”\n“Nothing. I simply don’t want to be late.”\n“Okay.” Slowly, Potter released him.\n“It was an excellent shag, Potter,” Draco said, just to be obtuse.\n“Yeah,” Potter said slowly. “But next time, let’s get lunch.”\n*\nThe next time, they got lunch.\nThe time after that, they got lunch and then they shagged.\nIt became a pattern, eating and shagging. The shagging was usually hurried and quick, though always spectacular. Sometimes Potter still couldn’t keep it up long enough to fuck him, but he seemed to want to—one time when it happened he fucked Draco with his fingers for so long that tears were leaking out of Draco’s eyes by the time he finally came. He came so hard he couldn’t see for nearly a whole minute, but when he opened his eyes it was to find Potter sucking come out of Draco’s jumper. \nAs far as Draco could tell, Potter didn’t have a lot of kinks, but he had a few weird ones. Draco’s jumper seemed to be one of them—Potter’s hands were always in it, always finding the holes, always clutching at it, and Draco supposed that it was like the sofa. They’d fucked on the kitchen table again, against the cupboards, in the sitting room, against the wall, in the bedroom, on Draco’s bed, but Potter had asked specifically to be fucked on the sofa. Draco guessed Potter liked the run-down look, things that were not nice or had once been nice but had fallen from grace, just like Draco.\nPotter also still got off on the things that Draco said to him, as though he couldn’t come without Draco telling him that he was a normal person, that he was worth no special notice. Draco didn’t mind it. Those things just came out of his mouth without him thinking about them, because instead he was thinking that any time could be the last time. \nEventually Potter would leave. Maybe it was true that Potter wanted to be treated like a normal person; maybe it was even true that there was something wrong with his head, if the way he talked to air was any indication. It didn’t change the fact that Potter was Harry Potter and Draco was Draco Malfoy, and Potter wasn’t going to keep this up. He wasn’t ever going to stay, and Draco knew he couldn’t get used to this. He shouldn’t get used to this.\nIt should have been easy enough, because they hardly spent much time together. Usually they had time for a meal and a shag, a conversation and a shag, a conversation and a meal, before Potter had another speech to make or trial to speak at or crisis at the Ministry to solve. He didn’t have a job at all, and yet he was always busy. Even when he said he planned to have an evening free, he got another chime on a coin he kept in his pocket, and then he was off fighting a dragon somewhere or modeling for Accio Style. There just wasn’t any way he was going to continue making time for Draco, and Draco knew that.\nHe knew that he was Potter’s bit on the side. He knew that Potter was probably fucking other people, even if Draco couldn’t find evidence of it in the papers. He knew that he was just a shag, and that even if he could make Potter feel better than he had ever felt, it was all just fucking in the end. Draco knew because every time there was a chance they could have been recognized, Potter separated himself from Draco.\nIt would have been different had Potter simply disappeared. He did that several times too—when he thought someone might recognize him, when they stumbled upon a wizard in the Muggle part of Peckham, or when someone came into the shop when it had previously been empty. Other times he threw on a disguise. When it was too late to avoid recognition, however, Potter simply moved away from him.\nOne notable time when they were walking down the street, very close to a barrier between the wizard world and Muggle, a gaggle of witches had noticed Potter from afar. They’d begun pointing and squealing, making a general ruckus. Instead of simply Disapparating, Potter had Apparated directly to them, and then he started talking to them, signing autographs, letting them take pictures with him.\nDraco stood there in the street. He could have gone over to them, but there was always the possibility that the witches would recognize him too. This was why Draco usually stayed away from crowds and didn’t often walk on streets—he’d grown too used to vegetables being thrown at him in early days. The weather was very fine, however, and it was autumn. The leaves were had bled into brilliant red, and Potter had wanted to walk outside.\nDraco could go over to them. Potter was usually so attention-averse when he was with Draco that perhaps he was just humouring the witches. Maybe he was secretly trying to get away, and Draco could help him. Just as he was thinking this, however, a silver mouse appeared upon his shoulder, and talked in Potter’s voice. “Go on to your flat,” the Patronus said. “I’ll be a while.”\nWhen Draco glanced up, Potter was walking with the witches, going in the opposite direction. They were all talking, and Potter was deliberately diverting their attention from Draco, whom he was telling to hide. \nDraco’s heart clenched so hard in his chest that he’d thought something was happening to it; the twisting, churning muscle was sending blood straight down into his arm, which was throbbing. When it filled up like this it itched, and it was all Draco could do not to scratch it out, not to cut and just keep cutting until it was all out of him, all gone.\nGod, he couldn’t do this. He couldn’t do this, he couldn’t do this, he couldn’t do this, and he was going to tell Potter so. He was going to tell him straight away, as soon as Potter got to the flat; he was going to tell him it was over, that they weren’t going to shag anymore, that he couldn’t do it. Draco knew that he was nothing; he knew it, and yet somehow being nothing to Potter was worse than anything else. It was worse than anything he’d felt since that day in the alley, the day he’d almost cut his arm off and the day he’d met Aloysius.\nInstead, Potter showed up in the flat half an hour later and Draco was snogging him like mad. He kept snogging him and snogging him; he couldn’t stop, and Potter made warm, close sounds in Draco’s ear. “You’re a wanker,” Draco told him. “You’re a fucking goddamn wanker. You’re not even worth it,” and it drove Potter crazy.\n“Yes,” he kept on saying. “Yes. Oh God, yes.”\nDraco took him against the door; he put Potter’s face against it—smashed Potter’s face against it, and Potter didn’t care. Potter liked it, apparently; Potter started moaning like a bitch in heat. Draco told him so, and Potter liked that too. “You’re a fucking bastard,” Draco told him, “a waste of space. You don’t deserve it; you don’t deserve anything—”\n“Oh God,” said Potter, arching against the wall. “Oh God, Draco, I don’t deserve anything.”\n“Listen to you moan for it,” Draco told him. “This is who you are. It’s all you want.”\n“That’s all I want,” Potter said, and Draco didn’t even have his fingers in him yet. “Please, it’s all I want.”\n“It’s all you are,” said Draco. “It all comes down to this; you can’t stop it, can you. You think you’re so important; everyone thinks you’re so important, but I know the truth. I know you’re nothing but a slut.”\n“Oh God. Please. Please.”\n“Nothing but a slut,” Draco said, “and you know how worthless you are. You’re nothing but a freak who goes wild at the thought that someone might realize what you are; someone might fill you up with cock just like you were made for it—”\n“Yes, God yes,” Potter said. “You know what I am; you know—”\nThen Draco’s fingers were inside him—greasy and slick, because he’d finally bought lubricant. He’d bought lubricant for this—explicitly for this, just this, just Potter, him and Potter, Potter inside of him and him inside of Potter, and it seemed intimate, somehow, that Draco had bought it just for them. He hated that, hated that Potter could make it feel so special when it was nothing to him, absolutely nothing. “You’re nothing,” Draco said. “You’re not anything but a hole to fuck, are you. You’re just a willing hole, and all you want is cock.”\n“Yes, that’s all I want,” Potter said. “All I want is you.”\nDraco slowly eased it in, and Potter was just as hot and tight as ever. Draco didn’t understand why it had to be so good, why Potter had to feel so good. Potter’s arse just took him; it took him and took him and took him. “You just want a cock to fill you, fill you up. This is all you are.”\n“All I am,” said Potter. “I need you to fill me up; I need you to make me feel—make me feel—”\n“You’re just for fucking, just a slut; you’re no better than this. Nothing more than this.”\n“Nothing, nothing, you’re perfect, Draco; you’re so perfect—”\nWhat Potter didn’t understand was that it was the other way around. Draco was the one who would have taken it any way he could have got it from Potter, and Potter was the one who was perfect. He was just so perfect, even in all the ways that Draco hated. He was a hero and he was rich and famous, well-dressed and well-loved, and Draco wanted that too. God, he wanted to fuck that too, because Draco was just a slut that way, just a whore. It was Potter who could have had anyone he wanted, and Draco who needed things he could only get from Potter—so many sweet, sad, perfect things, and only Potter could give them to him. \n“You’re a slut,” Draco said, and pretended that he wasn’t talking to himself. “You’re just a slut.”\n“Yes,” Potter said, arching against the door. “Yes, yours, I’m yours.”\nLater, after they’d both come and Aloysius was peeking out from around a corner, Potter couldn’t seem to stop snogging him. “That was good,” he kept saying. “That was so good. Draco, you’re so good. You’re perfect.”\nDraco shuddered in his arms, and knew he would not be able to give it up even if he tried. \n*\nWhat made it more difficult was everything they did when they weren’t shagging. Potter did end up finally cooking pasta for him, and it wasn’t bad. They talked a lot as well, and even though they rarely talked about anything that mattered, it meant something to Draco. \nFor instance, sometimes Potter talked about Draco’s articles, and at first, Draco was still afraid of how much power Potter had over him. Potter could reveal him to the Prophet; he could sever that one thread, the one role Draco could still play in order to feel important. But Potter didn’t seem interested in that, and he never talked about the articles that were political, and rarely about the ones that were about other people. He seemed to like the ones that were about wizard relations with the Muggle world the best, which seemed fairly typical of Potter.\nTo some extent, Draco was grateful that Potter didn’t talk about important things. It would have slowly killed him had they had to discuss Potter’s exploits—the parties he attended, the political leaders he entertained, the periodicals that interviewed him. It would have driven home to Draco that much more deeply that he was not a part of Potter’s world and never could be.\nInstead they talked about things like Quidditch—tentatively at first and then with more enthusiasm, since Potter was a ridiculous person who did not understand that the Tornadoes were the best thing coming. They argued about players, scores, and matches, as well as the best techniques of play. Draco told Potter about the Quidditch book he was reading—really, it was very good, and Draco lent Potter his copy. Potter said that he didn’t read much, but then he saw how ragged and old the paperback was and his weird kinks likely kicked in.\nThey talked about pets—not how Draco had come to have Aloysius, but Potter wanted to know how old he was and what he liked and whether Aloysius would get used to him. Potter was keen on him, though he seemed less interested in interacting with him than he was with Draco interacting with him. Draco had caught Potter staring more than once when Draco fed Aloysius or leaned down to scratch between Aloysius’s ears. It could be another weird kink, Draco supposed, but it seemed more likely that Potter realized how incongruous it was, that Draco Malfoy owned a former stray.\nPotter mentioned that he had had an owl, but he didn’t really talk about it. Sometimes he talked about things in weird ways, obliquely, as he had when he’d mentioned going camping. He talked about doing a flip on a broom and didn’t mention that he was talking about a specific time that he’d been flying away from Death Eaters; he talked about how much he liked teaching people and didn’t mention he’d been raising an army.\nIn the months that followed Draco gradually learned to speak Potter. He knew that when Potter mentioned seeing Longbottom’s parents in St Mungo’s that he was talking about the time he’d gone to St Mungo’s because Mister Weasley had been attacked. When Potter talked about feeding strange animals in forests with a friend, Draco eventually figured out that the friend was Lovegood and that the animals they’d been feeding were thestrals, which Potter had been able to see since long before most normal people.\nDraco usually didn’t point out that Potter talked in circles. Possibly Potter thought that he was so famous he didn’t even need to give settings to his anecdotes, but as time wore on Draco began to think that more and more Potter didn’t like talking about the past. He didn’t like talking about the Ministry or famous people, important events or magazines, politics or high society. Potter really did enjoy the time he spent with Draco, doing things like talking and cooking and shagging in every position possible. Part of Potter wanted it, even if he didn’t want it enough to give up all of his fame and fortune. A part of him actually needed it.\nPotter wasn’t going to stop being the Boy Who Lived, hero of the wizarding world. He wasn’t going to stop making appearances at dedication ceremonies; he wasn’t going to stop appearing in Lovegood’s fashion magazines. He wasn’t going to stop acting like he was the center of the universe, and yet a part of him knew the truths that Draco told him. A part of him knew that he wasn’t any different, he was just a man, and a part of him wanted to be seen for who he really was. A part of him wanted to be recognized, and that was the part that Draco got.\nDraco planned to hold on to it as long as humanly possible.\n*\nThe fight happened in early December, after they’d been shagging for several months.\nThey were in the kitchen, having just shagged once again. Draco was still sitting at the table with his trousers open while Potter, fully dressed, moved about the kitchen talking about something extremely unimportant such as doxies or gnomes. Watching Potter fiddle with the tea things, Draco felt warmth pool into him in such a slow trickle that it took a while for him to identify that the feeling was fondness.\nPotter just looked so happy, despite the fact that he was too gorgeous, really, for this kitchen. He looked like a Quidditch model that had been slapped in drab surroundings just for a unique contrast, but he didn’t act that way. It wasn’t even clear that the sex had made him happy; he seemed just as content with the tea and gibbering about gnomes as he had with sucking Draco all the way down to the root, and it was then that Draco made the connection.\n“You like it,” Draco said, surprised.\n“What?” Potter said, fetching the cups from the cupboard beside the stove.\n“Chores.” Draco fastened his trousers, spelled himself clean. “Making tea.”\n“Well,” said Potter. “Yes.”\n“You like it all,” said Draco. “Dusting doxies. De-gnoming. Sewing and—and feeding the cat. You really genuinely . . . enjoy it.” \n“Yes, well, I don’t . . .” Potter trailed off. “I don’t often get the chance,” he said at last.\n“Why would you want the chance?”\nPotter measured out the tea, spelled it into little balls inside the cups. When he spoke, he sounded as though he’d been thinking. He’d probably been doing that weird thing with his tongue, that thing that made Draco want to bite him. “It’s.” He turned around. “I’d never seen a gnome before we did it at the Weasleys,” he said at last.\nDraco tugged at his sleeve. “Never?”\nShaking his head, Potter turned back to the kettle. “I’d never seen a doxy before Grimmauld Place.”\n“And this is relevant?” Draco asked. “They’re pests, Potter. I don’t care if I never see one again in my whole life.”\n“I’m . . . I just . . . you take it for granted, your magic, but I didn’t grow up that way. I like to do all those little things I used to do—cook and clean and sew and all that—and not just because it gets done quicker with the spells. It’s more interesting.”\n“Interesting.”\n“It’s fun.”\n“Fun.”\nPotter took the kettle off the stove. “I told you I used to cook with my aunt Petunia. What I didn’t tell you was that those times were . . . that was one of the few times we got along together—really well, I mean. Dudley and Uncle Vernon would never do any of that. They’d be outside, or watching the telly, or off at some sports match, and it would be just me and Petunia cooking, and . . . she didn’t shriek or yell. She’d show me how to chop things right. She taught me what sautéing meant, and how to cook asparagus. It was like a team almost, like we were on the same side, and sometimes it was almost . . . nice.”\nPotter poured the water into the cups, then put the kettle back on the stove. Picking up the cups and saucers with a wandless spell, he directed them over to the table, then got out some spoons. Then he came and sat down, and Draco couldn’t stop staring.\nPotter’s hair looked wild with sex and his shirt was rumpled, but it was hand-tailored. Before Draco had ripped it off of him to touch his hair as Potter sucked him down, Potter had been wearing a kitsune-fur hat—a silly one with flaps that looked perfect on him anyway. His trousers today were that same magical vicuna wool as the cloak still hanging in Draco’s closet, and Potter’s happiest memory of his childhood was chopping vegetables with his aunt. Potter had slain the Dark Lord, become an Auror in under a year, and as far as Draco could tell no longer had to use a wand to do magic at all, and his best memory was his aunt not yelling at him and letting him chop vegetables the Muggle way. \nDraco had heard the rumors, of course. He’d even read the stories. He simply had not believed them—could not believe them, because what kind of Muggles could do that to a wizard, much less the Boy Who Lived; it had not made sense. Draco had always simply assumed it was just another bid for attention. Obviously being raised by Muggles would have been hard for any wizard, but Muggleborns did it all the time, and Potter just wanted everyone to think he had it worse than everyone.\nDraco had been wrong, he realized. He’d been dreadfully, horribly wrong. It was possible he had been wrong about a great many things.\n“Are you okay?” Potter said.\n“Yes,” Draco said, the answer automatic.\n“I could show you Petunia’s method of cutting apples.” Potter sipped his tea. “It’s much better than the traditional way. Fewer slices, fewer spells. Are you sure you’re all right?”\n“It’s true, then,” Draco said. “About your Muggle relatives.”\n“True?” Potter held teacup still. There was a fine, hairline crack along the side.\n“What they say,” Draco said. “They didn’t let you use magic.”\nCarefully, Potter put the cup back on the saucer. “They didn’t tell me I had magic. I didn’t know.”\n“And the other things.” Draco couldn’t make his voice right. “Are they true?”\n“Not all of them. We don’t have to talk about this.” Standing up, Potter went back over to the counter, started putting the tea things away.\n“Which of them?” Draco got a little louder. “Which of them aren’t true?”\n“Oh, you know.” Still faced away, Potter shrugged. \n“No,” said Draco. “No, I don’t.”\n“It’s not a big deal.” Potter turned around. “Do you want some more milk? You haven’t touched your—”\n“They neglected you,” Draco said. “They locked you up. They hurt you.” Standing up, he went closer. “Did they hit you?”\n“Don’t.” Turning around again, Potter waved a hand, bring both cups to the sink.\n“Did they hit you?” Draco was very close, his voice a low snarl.\n“I said don’t.” Potter turned the Muggle tap on, started washing out the cups.\n“Don’t what? Ask about you? Know what really—”\n“Don’t be like everyone else.” Potter slammed the cup down in the sink, and the dishes in it began to rattle. “Don’t be—be worried about me, feel sorry for me. Pity is just as bad as all the other things.”\nDraco recoiled. “I don’t pity you.”\n“I didn’t think you did,” Potter said, the dishes still trembling in the sink. “That’s why I—if they don’t want something from me, don’t expect something from me—they pity me; they pity me because of who I am and what I had to do and they pity me because they know that other people pity me, and they think how awful it is to be pitied by everyone—well, it is awful. It’s stupid. And I don’t need you right now!” Voice rising, Potter whirled on empty space.\n“Potter.” Draco came closer again. “Potter. There’s no one there.”\nPotter whirled back. “I know there’s no one there. Don’t you think I know?” Then he was looking at the empty space again. “Jesus Christ, just give me a minute; just give me one minute with him alone.”\nThe tea-cup in the sink shattered into pieces, and the dishes finally stopped shaking.\n“With whom?” Draco asked quietly.\n“What?” Potter turned back.\n“With whom did you want to be alone, Potter?”\n“With you.” Potter sagged. “I want to be alone with you. I want—I want what you have. I want to be . . . I want—I want to be left alone.”\nDraco stared at him. “Why don’t you do it, then?”\n“Because there’s nowhere I can go,” said Potter. “There’s nothing I can do. They know me everywhere; I’ll never be—”\n“Bullshit.” Draco swallowed hard. “That’s bullshit, Potter. You could get it if you really wanted it. All you have to do is try.”\n“You’re not listening. There’s no way I—”\n“There are a thousand ways. Go to another country. Get Polyjuice on the black market. You’re Harry Potter; make a law.”\nPotter’s mouth twisted. “It doesn’t work that way.”\n“I thought you were an arrogant prat.” Draco tilted his head. “That you wanted the attention. Are you telling me you’re merely an idiot?”\n“I’m—”\n“It does work that way,” Draco said. “You’re the hero of the wizarding world. You could have anything you wanted. You could live like a hermit in a forest if you wanted to. You could live like a king within a palace. It’s the rest of us who have to scrape by, make do—never getting what we want, never being what we want.”\n“You are.”\nDraco’s jaw went tight. “Excuse me?”\n“You.” Potter licked his lips. “You have it all. You have everything.”\nFor a long moment, Draco didn’t know how to speak. “Pardon?”\n“No I’m not; you are,” Potter said, and it took a moment for Draco to realize he wasn’t talking to him. Then Potter turned back to Draco, and started talking. “No one notices you,” Potter said. “You eat out in Muggle places and you don’t have to worry that they’ll find you and make a scene; people talk to you like you’re a normal person. Anthony Goldstein buys herbs from you!”\n“I don’t see what Goldstein—”\n“You have a normal life.” Turning slightly, Potter told the air, “No it’s not,” then turned back. “You have a flat and a job and your friends; you have a cat; you have a life.”\n“This isn’t a life, Potter.”\n“I—what?”\n“It’s not a life,” Draco said. “You think I like this flat? You think I like living among Muggles? You think I like working at Tamanam’s?”\nPotter’s mouth came open. “Ravi is—”\n“A wonderful man, and a fair employer. Potter, did you think I wanted to be employed? What, you think this is the dream life, working everyday with twenty minute breaks for lunch? Five friends I see every other week? A cat?”\n“I—I thought you wanted it,” said Potter.\n“Merlin, Potter; what is wrong with you? Who in their right mind would want this?” Draco spread his hands.\n“I would.”\nFor a moment, there was silence.\n“No,” said Draco.\n“Yes, I—”\n“You think you would. I bet you think you would. I bet you think you’d be perfectly happy, no one paying you any heed, no one giving you two thousand galleon suits to wear, no one taking your picture. You’d be wrong. No one would know you, Potter. No one would care about you; no one would care if you lived or died; you’d live in this shithole of a flat—”\nPotter had on his fierce look, the one that all the papers and criminals found so terrifying. “I like this flat.”\n“You don’t,” Draco said. “You think you like this flat. You think this is what you want.”\n“It is what I want.”\n“It isn’t. It’s—”\n“I thought you wanted it too.”\n“Well, you thought wrong.”\n“Then why don’t you . . .” Potter turned around, rubbing his forehead like it hurt. “Hell, Draco. Why don’t you do something different?”\n“You’re the one with all the choices, Potter.”\n“No, I’m not.” The confused look on Potter’s face made him look much younger than he actually was. “I’m not—you could do something different, Draco. It’s not like you’re trapped here.”\nDraco’s jaw was clenched so hard that for a long moment, he couldn’t even speak. “You don’t know what you’re talking about.”\n“Yeah. I do.” Potter scowled. “Do you know how popular those articles you write are? If you put your name to them—”\n“My Death Eater name?”\n“I—what? No, honestly, what? Draco, if you put your Death Eater name to them, you’d probably be famous. You could get a job at the Prophet. Everyone reads them; everyone loves them. No one cares you fucked up ten years ago; do you honestly think that’s why you can’t—”\n“Yes, I honestly think that’s why I can’t. Merlin, Potter. Are you even listening to yourself?”\n“You paid reparations,” Potter said. “You were cleared.”\n“Tell that to the people throwing vegetables at me in the streets.”\n“That was seven years ago!\"\n“They’d do it again if I gave them the chance.” Draco’s voice was savage.\n“That’s not true,” said Potter. “Things are different now. People are tired of fighting about it. They just want to—”\n“People are tired of it?” Draco held Potter’s gaze. “That’s why they go running you down in the streets?”\n“Well.” Potter looked at his shoes, swallowing hard. “That’s a different issue.”\n“People throw vegetables at me for the same reason they ask you for your autograph. The only difference is you could stop them if you wanted. You don’t have to live with it. I do.”\n“He’s being unreasonable,” Potter muttered, and it took another moment for Draco to once again realize that Potter wasn’t talking to him. “You took that away.”\n“Potter,” Draco said, his voice low.\n“Those times you told me I was like you,” Potter said, meeting Draco’s eyes now. “Those times you said I was just like you, that we were equals—you’re saying you didn’t mean it?”\nDraco opened his mouth. Then he closed it, swallowing hard. “I—it’s complicated.”\n“No, it’s not. It’s simple. We’re the same. We’re exactly the same; I’m just like you—”\n“You have it easier than I do.”\nPotter stared at him. He stared and stared and stared. “Yes,” he said finally. “I see it now.”\n“Potter—”\n“No.” Potter turned away slightly, giving Draco the sharp line of his profile. “I can see how being a spineless Death Eater would make things very hard.” Then he turned and started walking toward the door.\nDraco wanted to say something vitriolic in return, something that would sting, but in the end he couldn’t think of anything, because in the end Potter was right. Draco had been spineless, and he’d been a Death Eater. The fact that he had worked nearly a decade didn’t change who he was, and it didn’t change who Potter was either.\nThey weren’t the same at all.\n*\nAfter the argument, Potter stopped coming into the apothecary. He didn’t come see Draco after work, drop in for lunch, catch him on the street, visit at the flat. The hols came and went, Christmas and then New Years, and Draco spent them just as he always had for the last ten years—alone with Mother.\nDraco should have been grateful. Potter obviously wanted something else. He thought he wanted someone who was happy living at the bottom of the barrel, someone who was content with being nothing, someone who didn’t want more than what he had. It made sense, since Potter seemed to think that was what he wanted as well. \nIn those few hours every several days Potter had free, he wanted a quiet getaway, a hidey-hole in which no one would bother him, not even the person he was with. He didn’t want to hear about their desires or dreams; he just wanted to play house, so that a few hours later he could go back to his world of fame and fortune as though he’d never left.\nDraco could offer his flat, his body, a few hours of privacy and a cat, but he couldn’t pretend that this was what he wanted out of life. Even though he had worked hard to have the life he had now, a part of him still wanted to be a part of Potter’s world. A part of Draco still wanted to be what his father had been—a political and social figure to whom people listened, someone with clout, someone who could make a difference. If there had been a way for Draco to be that person, Draco would have leapt at the opportunity.\nPotter seemed to think that it was possible, which showed just how little he knew. Despite the fact that Draco had thought that he understood Potter, Potter most certainly didn’t understand him. The whole affair hadn’t been a good idea in the first place, and Draco should have been glad to get it over with.\nHe wasn’t.\nEver since Father had been sent to Azkaban, Mother had not been the same. When they had had to give over most of the Malfoy and Black fortunes and auction the manor in order to pay reparations, she had said very little. Draco had handled most of the details, and he had been glad that Mother had let him. She so rarely trusted him to do anything that involved any kind of responsibility and she would have to now, as he was the man of the family.\nHe had been so worried that she might seek an occupation so that he wouldn’t have to work that he had tried to preempt her, attempting to find work before she could even conceive of the notion. Draco had also found them lodging and accommodation—managing their galleons very economically, he had thought, until he had realized he didn’t even know what managing galleons meant.\nAll the places at which he had applied to work—high-end broom design companies, expensive brew developers—spat in his face. It took month after month of searching and scouring to find work, and even then he had had to work the lowest of low-end jobs, even working for three months under Muggle employ at his very lowest.\nThe inn at which he had booked their stay was entirely impractical for long term. He had also misjudged how they would survive after he became employed, for he had imagined that they would very quickly be able to afford a house of moderate size in a good neighborhood. In fact, they could afford no accommodation for almost a year, and his idea of a ‘moderate’ size had been preposterous.\nAt the very end of his tether, Draco had gone to sell their things in storage, only to find that the man keeping their storage had sold it all. His name was Manning, and he had lost his girl, Alice. Though Draco never really did learn who Alice was, it was the name he thought of when he became resentful of who he had become, what he had to do. Alice. He had to pay for Alice. Someone had to pay.\nThat had been Draco’s lowest day, the day that he had almost cut his own arm to pieces, and the day that he had found Aloysius in the alley.\nHe had slowly been able to crawl up after that, but through it all, Mother remained the same. She did not at all acknowledge their circumstances—spending just as many galleons as she might have otherwise, giving them to poor people in the street as was her generous wont, talking about her winged horses club and her snap group. \nShe must have noticed what was happening. She must have noticed that Draco was gone at all hours when he was beating the streets to find work. She must have noticed that they moved into successively cheaper and cheaper inns. She must have noticed too when Draco wasn’t staying at an inn with her at all, when he was paying for her lodgings and he was sleeping on the streets—and yet she still said nothing.\nDraco had always admired her strength, her ability to weather any storm with the same grace and nobility as she always had, her head held high. She was like a queen, regal even in rags, and nothing could touch her. After that first year of pulling them through their poverty by the very skin of his teeth, Draco realized that this was her method of coping. She let nothing touch her because if it did touch her, she might break.\nDraco worked even harder after that.\nAfter those first hard years, he’d found Mister Tamanam’s shop, working in the store rooms at first and gradually being a reliable enough employee that he could run the register, too. Mister Tamanam knew Draco’s past and yet was kind to him, and at last Draco could afford a roof over his and Mother’s head, and food to eat.\nAfter another three years, Draco sent Narcissa away to live in her own little house with a garden, sending her galleons every month to pay the rent. He had found that he could not stand her blankness, her refusal to acknowledge the situation. He still loved her—he would always love her—but they could both be happier if they could get on with their lives. She could still pretend that she had the winged saddle club, and he would go on doing his best to survive.\nTheir holidays were always strained, however, for Narcissa seemed to be drifting further from sanity. When she saw Draco she acted as though he hadn’t left, and if he mentioned his job or money or Muggles, she simply acted as though she hadn’t heard.\nWith this change came a distance between them that had never been there in his youth. She used to hold him, to comfort him, to whisper sweet words to him all the time. She might still have done so, but Draco couldn’t bear to hear such things when she no longer seemed to know who he really was. The things that she had called him—sweetness, dear heart, love—were names for another person. That Draco didn’t exist anymore, and Draco didn’t even really miss him. He just missed her.\nBreaking up with Potter made seeing Mother even more difficult, because it made Draco realize he had gotten used to company, to being touched. For years, Draco had hardly dated, much less been shagged. There were just not many people willing to sleep with a former Death Eater, and Draco didn’t know how he could possibly sleep with a Muggle. It had less to do with their lack of magic and everything to do with the lack of anything in common; he could never tell a Muggle the truth of his world without legal repercussions.\nIn the few months Potter had been coming around, Draco’s body had got used to shagging. He’d got used to not having to touch himself, to having warm flesh gripping his cock as he came. He’d got used to his arse being filled, to being stretched and loose; he’d got used to snogging, to touching Potter’s body, Potter’s hair. Draco had got used to being touched and now he felt like he was starving for it.\nDraco did have a few other friends, but they were not close, except for Pansy, and Pansy’s case was similar to Mother’s. Pansy had trouble dealing with the aftermath of the war, and as a result she had been partially Obliviated by Healers. She should have been in the Janus Thickley ward, but she had relatives who wouldn’t hear of it, and they cared for her now. Draco visited her often, but there were times that she did not seem to recognize him.\nMillie and Montague were the only other friends that Draco had from his old life, and he only saw them every once in a while. They both had inconspicuous jobs in the wizarding world—Montague worked in an inn, and Millie was a clerk for a wizarding lawyer. Mister Tamanam was very kind, and had Draco over to eat with his family at least once a month, but Draco never forgot that Mister Tamanam was his employer. They could not enjoy each other’s company as equals. \nBefore Potter, Draco had forgotten what it was like to have a good friend—not just people with whom he occasionally spent time, but people who wanted to be with him often. He’d forgotten what it was like to have things happen during the day and have someone to tell them to at the end of it; he’d forgotten what it was like to have someone who asked him how he was and what he had read recently and what he wanted for supper.\nBefore Potter, Draco had been all right—his flat, his job, and his life weren’t ideal, but they were what he had, and they were acceptable. Now all Draco could think about was the fact that his flat was small and cramped, full of sagging furniture and cheap Muggle appliances. His job was provincial and demeaning, not to mention boring, and it ate up all his time. His life was—it was miserable; Draco was miserable. He had no say in anything and had very few friends and no one cared about him particularly. If he were to die tomorrow, no one would really notice.\nNo doubt Potter was spending Christmas with one thousand and one Weasleys, not to mention all of his important friends—Weasley, the Head Auror; Granger, who had a seat on the Wizengamot; Longbottom, who was Deputy Headmaster at Hogwarts, and Lovegood and Creevey, who only served to make Potter even more famous. Draco seriously doubted that through all the ten course meals and expensive gifts from everyone on Earth, Potter was secretly wishing he could be miserable and lonely on Christmas. \nPotter may think he wanted a different life. A part of him might even really want it, but he was obviously quite partial to what he had, and no one could blame him. On New Year’s Eve, Potter was most likely raising a crystal glass full of cloud-lily nectar to a diamond chandelier. Surely, the last thing on his mind was surely Draco, while all Draco could think of that night was Potter.\nHe wanted Potter with him. He didn’t care how wrong they were together, or how much Potter had misconstrued about his life. All he wanted was Potter’s arms around him, Potter’s lips against his ear, telling him that he was good, that he was worth something. Potter used to tell him he was special, and even though he didn’t mean it, Draco still needed it. He needed someone; he needed to believe that someone cared.\nDraco woke up the next morning, trying to look forward to an entire year without a single person on Earth knowing he was even there.\n*\nOn New Year’s Day, Potter came back.\nDraco had returned from Sunderland by then; it wasn’t very late in the evening, but it was late enough for Draco. He had already turned the lights out and gone to bed. As pajamas were an unnecessary expense, he had forgone wearing them ages ago, instead sleeping in shorts and bundling inside lots of warming charms.\nWhen he heard the knock on his door, he almost didn’t get out of bed. It would mean getting dressed again, and besides, the knock probably wasn’t even for him. Someone had made a mistake, or else it was a drunkard—overexcited from the New Year’s Days festivities, no doubt. No one would come to his flat at this hour otherwise. Still, the nearly non-existent hope that it might be Potter after all propelled Draco out of bed. Hastily transfiguring a threadbare towel into a robe, he went out to see who it was.\nPotter stood there, eyes so bright and hair so wild that the latter looked like fuel to feed the fire, sucking light from the corridor so that it could burn in Potter’s eyes. His mouth was open and he was breathing through it, as though he couldn’t quite catch enough air.\nDraco swallowed hard. “Potter?” \n“Draco.”\n“I . . .” Draco reached for him, his hand stopping before it reached its destination, fingers uncertain and unsteady. \n“Please,” said Potter. “I need—”\nIt was going to happen. Like death or the weather, it was impossible to stop it, change its course, convince it otherwise, the inevitability of it a simple reality that must be accepted or else pay the price of madness. It was going to happen and there was nothing Draco could do about it, because it was all there in Potter’s face—Potter’s lean hungry face. He looked like he was starving.\n“Come inside,” Draco said.\nIn one swift movement, Potter was there, his hands on Draco—hot, so hot, clamped down on Draco’s wrists. Draco thought that Potter might have a fever. The front door was still open.\n“I need you. I can’t do this without you,” Potter said, then put his hands inside Draco’s robe.\nDraco spelled the door closed.\n“Tell me I’m not good.” Potter’s voice was a croak, his hands clenching rather than caressing. “Tell me I’m not a hero.”\n“Potter—are you all right?”\n“No. I’m not. I need—” Then Potter kissed him, kissed him in a way that didn’t feel like kissing and felt instead like hunger, like need. Potter didn’t seem to want to taste him; he felt like he wanted to crawl inside of him, all the way inside of him as though Draco could cover him completely.\nPutting his hands in Potter’s hair, his lips beside Potter’s ear, Draco whispered quietly. “Calm down. Come with me. It’s all right.” He pulled on Potter’s hand.\n“I can’t.”\n“You can,” Draco said, and Side-alonged Potter to the bedroom. Once Draco had dispelled the Lumos, he started kissing Potter. He didn’t know what else to do—he’d seen Potter frantic with need before, but in the past Draco had interpreted it as Potter really wanting to come, even when he couldn’t. Now, however, Draco wasn’t so sure that that was what Potter needed, but it was Potter and he was here, and it had been too long. Draco needed him too, and his hand went for Potter’s trousers, opening them up so he could put his hands inside.\nPotter made a low whimpering noise, just like an animal.\n“Come on to the bed,” Draco said, leading him. He pushed Potter down, then took his shorts off so he could crawl on top of him. Potter kept trembling, so Draco just kept kissing him.\nPotter’s shaking hands swept down the bare skin of Draco’s back, down to his hips. Then Potter was reaching between them, over Draco’s stomach. Softly, Potter started touching the scars. The scars from the Sectumsempra were long and jagged, no longer red but gone pale and white with time.\nDraco went still.\n“I did this,” Potter said, and Draco couldn’t protest because it was true.\nEven with Potter lying under him—even after all those other times, with Potter touching and licking every part of him—Draco had thought he managed to avoid Potter noticing the scars—or else he didn’t know or remember what they were. Obviously, it wasn’t true. Potter knew exactly what they were.\n“I did this to you,” Potter said again. “I hurt you.”\n“It was an accident.”\nPotter shuddered, his hand clenching convulsively against the scar. “It’s not okay, just because I meant well.”\n“Potter—”\nPotter pushed Draco back, flipped him on the bed. Then it was Potter leaning over Draco, pushing him down. Potter’s hand came back and found one of the scars, stubby nails pressing into the ruined flesh. “Don’t make it okay for me,” he said. “Tell me that it’s not okay. Tell me that not everything I’ve done is justifiable.”\n“Potter—”\nPotter’s nails dug into the scar. “Tell me.”\nDraco swallowed. “Not everything you’ve done is justifiable.”\nPotter shuddered once, hard.\n“It’s not okay,” Draco said. \nA sound came out of Potter’s mouth; it sounded like a sob. He convulsed against Draco’s body. “Tell me that I hurt you. That I should pay.”\n“You hurt me,” Draco said, because Potter had, but Draco didn’t mean the scars. He meant Christmas, and weeks without touching, weeks without Potter’s disturbing mouth and happy chatting about household chores and Potter asking how he’d been. “You should pay,” Draco said.\n“Tell me that I’m not right all the time.”\n“Potter,” Draco said, and put his hands on Potter’s face. “You are rarely right.”\n“Tell me that I hurt people, that it’s not okay, that I should be punished just like any other person—”\n“Potter—”\n“I’m just like any other person.” Potter’s fingers dug into the scar. “Tell me that I cut you open. I slashed you up.”\nConsciously, Draco didn’t blame Potter for the scars. Even if Draco might never have followed the Dark Lord without his father’s influence, the horrible things that had happened as a result were still a part of who Draco was. He had been trying to let Death Eaters into Hogwarts. He deserved what he got. The scars were testament to bad choices, mistakes, a past that should never be repeated. \nHe had to pay for Alice, and deep down, Draco didn’t blame Potter in the least.\nThat didn’t change the fact that Potter had been the one to do it to him. Potter had sliced him open, nearly killed him, and then got off scot-free. Potter had won everything; people had given him everything. He had everything. Potter never had to pay for anything, while Draco had lost it all. \nDraco knew that he needed to accept that suffering. He needed to accept who he was, what he’d been given. He had to pay, and protesting that price was part of the selfish, shallow person he had once been; he needed to simply come to terms with the fact that he was nothing, that he deserved nothing—\nAnd then Potter was moving up slightly, sinking down not between Draco’s legs but upon his abdomen, Potter’s cock heavy and hard against the scars. Draco’s voice stuttered. “What—what are you—?”\n“Tell me I hurt you,” Potter said, and rocked his hips. “Tell me you haven’t forgotten.”\n“You’re—you’re—” Potter was thrusting his cock along Draco’s scars, and Draco didn’t know what to do; he didn’t know how to stop him. He didn’t know how to want to stop him, because entirely against his will, Draco was responding to it. \n“You know what I’m capable of,” Potter said, rocking his hips again.\nIt was wrong. It shouldn’t be hot. Potter had done this to him, had hurt him, had given him these scars—besides which, it was Draco’s midriff. It wasn’t an erogenous zone. If anything, it should seem awkward and strange, the rough drag of hard flesh against the softer muscles of Draco’s middle, but instead it was driving Draco wild. Potter had his cock on Draco’s scars and he was telling Draco he could blame him; he didn’t have to accept everything that had happened; he could be angry; he could resent it; he was allowed to react like a person, a real person; he was allowed to feel—\nHe didn’t have to pay for Alice, because Alice was not his fault.\n“Please,” Potter said again. “Tell me.”\n“I know what you’re capable of,” Draco said, pulling Potter closer in. “You cut me open.”\n“Yes.” Potter’s body was pressed against Draco, so close that his cock was trapped between them. Draco could feel the hard flesh rutting against his stomach. “Yes. Yes, I did it to you—”\n“You slashed me up,” Draco said, and this wasn’t normal, getting off on this. There was nothing normal about this. “You hurt me.”\n“God, yes, I hurt you; I hurt you—you know, Draco. You know—”\n“You—you don’t deserve it.” Draco’s breath was juddering. “You don’t deserve—it; you hurt me; you cut me to pieces. You made me bleed.”\n“Yes,” Potter whispered. “Yes. Yes, please—”\n“You pulled my guts out, Potter. You nearly eviscerated me; you ruined me—”\n“Yes, I ruined you; I ruin people; that’s what I—”\n“You made me this way,” Draco said. “You made me.”\n“I cut you in half,” said Potter. \n“You left me in pieces,” Draco whispered, and then Potter lurched, thrusting against soft skin and there was hot come on Draco’s belly, spurts of it stinging and wet. For several long, hot moments while Potter came, Draco couldn’t even think about what Potter was doing. The thought of it kept glancing away, touching his mind and then slipping out again. \nEventually he realized that Potter was still on top of him, that Potter’s thighs were straddled across not his hips but his waist, and Potter’s cock was limp on Draco’s belly. Draco hadn’t even come, and he knew that he should push Potter off; the ugly scars across his abdomen were covered in Potter’s come. It was too strange to even think about—that ten years ago, that same flesh had been covered in blood, and it had been all Potter’s fault, and now Potter was—\nPotter was rolling off of him, positioning himself so that Draco’s head was on his bicep and Potter was still half leaning over him, one of his lean, strong hands moving through his own come, over Draco’s abdomen, down to Draco’s cock. “It’s been torture,” Potter said.\nDraco angled his face, eyes right by Potter’s mouth. He could see Potter doing weird things with his tongue as he wrapped his hand around Draco’s cock.\n“I don’t ever want to do that again.”\n“Do—do what?” Draco hated how his voice sounded.\n“Hols,” said Potter. “Spend that long without you. I can’t stand it. I can’t fucking stand it, Draco.”\nDraco swallowed hard.\n“I thought about what you said.” Potter’s hand was working Draco warmly, steadily, just like reassurance and comfort all in one. “About how I could just—I could just give it up, and the problem is, I’m—I can’t. I’m no good alone. I lose it completely when I’m alone; he comes and he won’t leave and I go crazy; I just go fucking crazy—”\n“You don’t have to be alone,” Draco said, and God, he was shaking. Draco was shaking.\nPotter’s hand tightened around his cock. “I can’t be with Ron and Hermione, they’re just—just so concerned and it hurts them; I hurt them, and they don’t understand why—”\n“You hurt people,” Draco said, understanding.\n“God, yes.” Potter’s hand moved faster. “Yes. You’re the only person I can be with.”\n“You don’t mean to, but you do.”\n“Yes—”\n“It still counts, Potter. It’s not okay just because you killed the Dark Lord.”\n“Yes.”\n“Not to mention that you nearly eviscerated me, and then you wanted to come all over the mess you made, you sick bastard.”\n“Yes,” Potter breathed. “Yes, God, yes, Draco, I missed you—”\n“You’re a sick fuck.”\n“Yes. I’m sick. I’m so sick.” Potter’s other hand grabbed Draco’s bare arm, the one with the Dark Mark and the scars riddled all over it, and rubbed one dry, warm thumb across its ruined surface. \n“You’re a fucking freak.”\n“Draco, you’re beautiful, come now, you’re so bloody beautiful—”\nDraco didn’t mean to obey. He simply arched up into Potter’s hand, Potter leaned down to lick the head of his cock, and then Draco came; he came and came and he couldn’t stop. Potter’s thumb just kept rubbing the marks on his arm, back and forth, back and forth.\nWhen Draco finally stopped shuddering, he pulled his arm away. “Don’t touch me there.”\n“I don’t care.” \n“Don’t do it.”\nPotter touched the corner of his lips with his pointed tongue. “It’s made you who you are.”\n“You don’t know anything, Potter.”\n“All right,” Potter said, and put his hand over Draco’s heart instead. “Can I touch you here?”\n“I suppose,” Draco said. \n“You can tell me anything,” Potter said. “I’ll do anything.”\n“All right then,” Draco said, and turned away from him in the darkness. “Stay.”\n*\nPotter stayed.\nHe was there when Draco woke up the next morning, and still in bed by the time Draco left for work. When Draco got back from the apothecary he expected to find Potter long gone, but Potter was there cooking supper, just as though he belonged. He stayed that night, and the next, and the next.\nAt first, Draco assumed Potter was going about his daily business while Draco was at the apothecary. He assumed Potter was just coming home earlier than was his wont and staying in nights, but after several days, the headlines began reporting Potter’s absence. Potter had been slagging off public appearances, missing at parties and celebrations, absent at court cases and meetings. When Draco thought about it, he realized that Potter no longer had the coin that used to chime whenever the Ministry needed him.\nAs the news sank in, Draco realized that he’d read it all before. Sometimes Potter would just disappear from the public eye, but Draco had always assumed that it was a bid for attention. Potter would throw a fit for several days, a couple weeks, then appear back on the public stage, even more grumpy and arrogant than before. \nDraco had no way of telling whether this time was any different. Maybe all those other times, Potter had just been shacked up in some other wizard’s flat, sleeping in their bed, petting their cat, shagging at every opportunity. It must be like a vacation for him, an escape from the real world, a paradise of peace and calm in the storm of his chaotic life. \nPotter slept in Draco’s bed. It happened naturally at first, and then it became routine—they shagged there, then fell asleep in each other’s arms. In the morning Draco woke to Potter’s body, hot as a furnace, wrapped around him as though Potter were a limpet and Draco were the substrate. Sometimes Draco awoke to Potter’s hot mouth wrapped around him, underneath the blankets, and even had Draco wanted to, it would have been hard to demand that Potter sleep somewhere else with such awakenings.\nThe bed was not really big enough for such activities, but after the first night Draco enlarged it so that they could both be comfortable. The second day when he came home Potter had made it even sturdier, reinforcing it with spells so that structurally, it could hold them for a while. The bigger bed made the small room seem even tinier, but Potter didn’t seem to mind.\nAfter waking up in the morning, Draco usually used his Muggle shower, where sometimes Potter joined him too. Potter touched his scars now, often, slippery hands sliding up Draco’s torso and then back down, over and over. Potter’s mouth moved over the water sluicing down Draco’s shoulders as though Potter had been in the desert, and Draco was a glass of something sweet to drink.\nPotter always acted like that, as though he was desperate for it, as though he couldn’t get enough of it, but the best part of Potter staying was somehow not the shagging. While Draco was gone at work, Potter cleaned the flat. He did so meticulously, but with joy, as though all he had ever wanted was to straighten the bookshelves, clean out the grout, organize the Muggle icebox, analyze the sticky residue in the Muggle cook-box-thing. \nPotter didn’t seem to be the most organized person, but he loved to stay busy with tasks like that, sometimes to a ridiculous extent. One day he took apart the whole sofa and put it back together again. Draco could see no real improvement, but Potter was proud of himself, and said it was more comfortable. He even figured out how to fix the Muggle drain in the shower, from which Draco had been spelling away water for months.\nWhen Draco was gone, Potter also cooked. He was not phenomenal at this either, but he seemed to enjoy learning. He started out with simple things like pasta and eggs, then went to the Muggle Tesco and started adding things like salad and chicken. One night he made a lasagna and it was terrible; he was spattered in sauce, and there was something burning in the Muggle box—but Draco ate it anyway.\nHe ate it because Potter was just so happy—Potter greeted Draco at the door when Draco got home; he snogged him; he asked about his day. They ate together and then sat together in the sitting room, and sometimes they didn’t even shag. Sometimes they simply sat there quietly—Draco reading or writing his articles, Potter working on his projects. Potter had even made friends with Aloysius, who curled up in Potter’s lap more often than Draco’s. Draco didn’t mind it. He wasn’t fond of cat hair.\nIt was all disgustingly domestic, but that was all it was. Potter never left the flat as far as Draco could tell, except to go to Tesco and one trip he made over to his own flat to pick up some more clothes. Potter never made appearances in public at all anymore, and he even seemed unwilling to eat out at Muggle restaurants as they had used to do, before Potter started living with him. They never walked together anywhere, not even in Sop Lane. Potter did not want to be seen, and that was why he was here with Draco. With Draco, he would never be seen at all.\nSometimes Draco could hardly bear it. He read articles in the paper speculating about where Potter was, and it was overwhelming to know that Potter was waiting for him at home—warm and smudged in tomato sauce, ready to snog him silly the moment Draco opened the door. Passing people on the street, Draco wondered what they would say if they knew—if they knew—Harry Potter was sleeping with a Death Eater, that Potter was happy that way; Draco could make him happy.\nDraco thought about it in the shop as well, thought about whether they would look at him differently, whether they would finally see that Potter was no better or worse than he was. It had been different when Potter would just stop in for the random shag. Then Draco had supposed that Potter might be shagging all kinds of people; Draco had thought he was just mere entertainment then, no matter how many times he had told Potter they were equals. Then, Draco had known that he was one of the few people who could really understand Potter, but he had assumed Potter didn’t know it.\nNow, Draco was sure that Potter knew it. Potter knew it; Potter wanted it; Potter needed that from Draco, needed that understanding and that equality. Draco made Potter happy; Potter didn’t want anything else. \nAnd yet, Potter stayed with Draco because Draco could be his secret. A part of Potter wanted to be seen for who he really was, that was not a hero, nor a saint. He wanted to be punished as well as forgiven; he wanted to be understood, not taken for granted—but he wouldn’t want it forever. \nDraco understood penance better than anyone, and being Potter’s secret was his own punishment for everything he had done. No matter how well he understood Potter, no matter how easily he could give Potter all that he needed, Draco could never give it to him in the light of day. He could never be Potter’s boyfriend or significant other, and Potter wanted it that way. He might have wanted to be seen for who he really was, but he didn’t want the world to know it, or else he would have shown them.\nInstead, Potter showed his true face only to Draco, so that when he was done with this affair Potter could go back and be who he had always been. Eventually, Potter would get what he needed, and then he would be done. Draco had no illusions. It was important to be realistic.\nOnly gradually Draco began to realize that the reality he thought he knew was not the one that Potter was experiencing. Potter had been living with Draco an entire month, in fact, before Draco realized that Potter wasn’t having a tantrum at all. He wasn’t having a break from his real world; he was not having a vacation. He wasn’t having an escape from which he would return, the same Potter as before.\nHe was having a mental breakdown.\n*\nDraco began thinking differently the day that Potter cut his hair.\n“Potter?” Draco called. \nWhen Draco found him, Potter was in the closet, and his hair was everywhere.\nDraco put down his bag from work and got down on his knees. “Potter?” he said. “What have you done?”\nPotter had been staring at the wall, but when Draco spoke, he turned his head. His gaze was blank. \n“Potter,” Draco said, and tried to keep the catch from sounding in his voice. Potter’s hair was all gone, shorn right down to the scalp, odds and ends sticking out like a crazy person had cut it. Tentatively, Draco put his hand on Potter’s head. “Why?” he asked.\n“It grows back,” Potter said dully.\n“Yes, but . . .” Draco kept moving his hand on Potter’s head, and he thought that he was going to cry. Potter’s hair—Potter’s beautiful soft lovely hair—it was all gone. “Why did you do it?”\n“It grows back,” Potter said again. “It will be there tomorrow.”\n“What?” Draco took his hand away.\n“I never could get rid of it. I thought I was just a freak, and then I thought . . .” Potter’s tongue touched the corner of his lips. “I thought that it was him, but it’s not. It’s just me.”\n“It comes back?” Swallowing hard, Draco traced the line of Potter’s scalp, down around Potter’s ear.\n“Yes.” Putting his head down, Potter leaned into Draco’s touch. “I can’t change it. I can’t look any different. I can’t be any different; I just . . .”\nPotter’s voice was breaking, and Draco didn’t know what to do. Potter was here because he thought Draco would treat him like a normal person. He was supposed to be what Potter needed, and yet Draco couldn’t stop the flood of pity that came over him, and all he knew was that he couldn’t let Potter see it.\nHe could never let Potter see it.\nFeeling fear rising in his chest, feeling the itch begin on his left arm, Draco looked at all the scattered hair, Potter’s wand on the floor. At least he had used his wand for this, and it was a new one, different from the one he’d taken from Draco all those years ago. Draco remembered the day in the alley in which he’d tried to cut off his own arm. The hair all around them reminded Draco of the blood, and what Draco had been saying all along was true: they were no different. \nPotter was even less different than Draco had thought, but Draco didn’t know the words to tell him so. Instead, Draco kept petting Potter’s shorn head, and said, “Only you would whinge about having gorgeous hair.”\n“It’s not gorgeous,” Potter said. “I hate it.”\n“It is too gorgeous,” Draco said, keeping his voice light, “if you like that sort of thing.”\nPotter looked at him, and Draco moved closer to him, sitting beside him in the closet.\n“Platinum blond is by far more attractive, and your hair was always a frightful mess. I used to think that magpies were living in it.” Draco pulled Potter closer, and Potter leaned into him. Draco put his arm around him, and went on, “But only you would make an ordeal of it. Some people don’t have hair at all; do you know that? But that’s you, isn’t it? Always calling attention to yourself.”\n“Jesus, Draco,” Potter said, and put his hand over Draco’s heart.\nIt was beating wildly, because Draco was just talking. He was just opening his mouth and words were coming out, the kind of words he always said, but he no longer even knew if it was true. “You’re not special just because you have magic hair,” Draco said. “And so what if you are? Boo bloody hoo. It doesn’t make you a martyr, Potter.”\n“Stay with me.” Potter shivered. “Stay with me; stay—”\n“How could I possibly leave you?” Draco held him tighter. “You’re the one who’s in my flat, eating my food, wearing my jumper. I should kick you out.”\n“Don’t.” Potter shivered again. “Don’t—”\n“Don’t have a conniption,” Draco said, murmuring in his ear. “You can stay.” Potter’s shivering stopped. “At least until I get bored of you.”\n“I think you’re the perfect person.” Hungrily, Potter’s lips moved along his jaw. “I think you’re lovely. I think you’re bloody—”\n“Let’s not get carried away,” Draco said, doing nothing to stop the path of Potter’s lips. “I’m not sure I want to shag a bald person.”\n“I want to suck you until you can’t even see straight,” Potter said.\n“I suppose that could be arranged,” Draco said, and let Potter snog him senseless.\n*\nFor the first week that Potter lived with Draco, he did not take Dreamless Sleep. Draco didn’t really think about it until the nightmares started, and later when he thought about it he remembered the first time they had shagged. Potter had said he felt like he could sleep forever, and Draco guessed the shagging made Potter feel loose enough—relaxed enough—to sleep through the night. After several weeks, however, Potter’s sleep became more fitful—as though he had grown used to having Draco beside him, and it was not enough. \nThe first time it happened was several days after Potter cut his hair. True to Potter’s word, the hair had all grown back by the next day, and Draco tried to act as though it was normal. He didn’t want Potter getting any ideas about being better than everyone else just because he had the most fabulous hair in existence. Besides, Mother’s hair was prettier.\n“Potter,” Draco said, shaking Potter’s arm. It was late in the night, and Potter was making strange sounds. “Wake up. Potter.”\n“I killed him,” Potter said.\n“Wake up,” Draco said. “You’re dreaming.”\nPotter sat straight up in bed. “I killed him,” he said. “I killed him.”\n“Potter,” Draco said again. He got an arm around him, hand in Potter’s hair. “Potter, you didn’t—”\n“I did.” Potter’s voice cracked. “They don’t know. No one knows—”\n“Potter, you were dreaming,” Draco told him. \n“They think it was an accident, but I did it. I killed him.”\n“Who?”\n“Tom.”\n“Who is—”\n“They think they saw it,” Potter said, “but they didn’t. I killed him. I murdered him. I destroyed pieces of his soul.”\nDraco didn’t know what Potter was talking about. He only knew that Potter sounded broken, just so broken. Potter was here because he needed help, and Draco didn’t know how to tell Potter he was a normal person when he was talking about murder and destroying someone’s soul.\n“Shut up!” Potter said, putting his hands over his ears. “Just shut up! You’re dead. I killed you.”\nDraco pulled Potter’s hands off of his ears. “Who are you talking to?”\n“No one; he’s not there; he’s not there—”\n“Don’t be a ponce,” Draco said, and his heart ached to say it, because Potter wasn’t a ponce. Potter was scared, but Draco got on his knees anyway and held Potter’s face, hands on either side of his cheeks, holding tightly. “Don’t put on this act with me. Tell me who’s there.”\nPotter’s eyes widened.\n“I’m warning you, Potter,” Draco said. “I’m not very nice when I’m awakened in the middle of the night.”\nPotter licked his lips. “It’s—it’s Tom,” he said finally.\n“That’s a ridiculous name,” Draco said. “Tell me his real name.”\n“That is his real name.”\n“No. We are who we make ourselves to be, Potter. Tell me who’s over there.”\n“I . . . Voldemort.” Potter’s eyes were as green as Adava Kedavra.\n“Fine,” Draco said, resisting a shudder. He could do this; he knew that he could do this. It was what Potter needed, and Draco would have done anything.\nHe’d do anything; Draco would have faced down Voldemort for Potter. For Potter, Draco could pretend like Voldemort was nothing.\n“So you see old Snake Face,” Draco said. “So what? No big deal.” \nPotter’s voice stuttered. “H-hold me. Please, Draco, hold me; I can’t—”\n“Yes, you can,” Draco said, and held him. “Don’t be such a baby, Potter.”\n“Hermione and Ron think—they think that I had to, but I didn’t. You know. You know who I really am.”\nDraco didn’t know anything. He just held him tighter, put his lips in Potter’s hair, just like Mother used to do. “I know,” Draco said. “I know you. I know you whinge a lot.”\n“You know I’m no good.”\n“I know you’re Potter,” Draco said. “Just Potter. That’s all you are.”\n“I think that I’m in love with you,” Potter said, and Draco held him so tight that he could barely breathe.\n“Go to sleep,” Draco said.\n“I do.” Potter turned his face up, and his eyes were wet. “I love you.”\n“I’ll be here when you wake up,” Draco said, and he was.\n*\nAfter that, Potter began to take Dreamless Sleep again, and Draco began to feel things wildly spiral out of control. He had thought he knew Potter, thought he knew how to handle him, thought he knew what Potter needed. As Potter began relying more and more heavily on the potions, Draco started thinking about it all—the way that Potter talked to air, the way he sat there sometimes as though listening to something that wasn’t there. Draco thought about the fact that sometimes Potter still could not maintain an erection, or the fact that other times, he could not control his magic. \nWhen Draco read articles about Potter in the Prophet, he began to see them differently. Draco used to skim such things, since the paper never said anything true about Potter anyway. He’d dismissed such things as sensationalism, assuming Potter’s fits in public and rudeness toward the press were simply Potter being an arrogant, self-indulgent prat. \nPotter was still a prat, but if you took his claim that he didn’t want the attention at face value, it became a very different story. According to Potter, dark wizards really did just find him. Neo-Death Eaters attacked him as retribution; criminals saw him as a threat; Purebloods who saw him as the cause of their misery cast random hexes at him, and that was saying nothing of his fans.\nThey made him relive the war every time they asked for his autograph, every time they stopped him in the street. They made him relive it and they made him celebrate it, and at least no one was telling Draco that all the horrible things in his past were good things; no one was commemorating them. No one was telling him he was a hero.\nOne of the most appalling examples of what was being done to Potter was the ceremony that had been held by the Ministry on New Year’s Day. The Dark Lord had been defeated in early spring, but ever since then the wizarding world had wasted no opportunity to celebrate it. This May would be the ten year anniversary of Potter’s conquest, and the Ministry had kicked it off with a great big victory ceremony. For the ceremony, several wizards had constructed a giant Pensieve, as big as the back wall of the Atrium. On that wall, using Lumos and a mirror, they had projected memory after memory of Potter’s final battle against the Dark Lord.\nThey even had a picture of the set-up in the paper—the silvery, projected image of Potter holding Draco’s wand against the Dark Lord, a ghostly shadow against the ceremony’s audience. Potter from the present-day sat there staring at the memories, his face stark and empty.\nAfter that ceremony, Draco realized, was the evening Potter had come back to his flat, touching Draco’s scars. It was the evening Potter stayed. After that, he’d never seemed to want to go back.\nThey had done that to him—the people in the Ministry, the officials who had thrown that ceremony, the public who had attended. They had made him watch himself face down the Dark Lord, and Draco never would have been able to stomach it. He never wanted to relive any of those moments in which he had faced the Dark Lord, and yet they made Potter relive it over and over again.\nThe next thing that Draco noticed was Potter’s clothes. Since Potter was staying at Draco’s flat, he didn’t have his own expensive clothes to wear, and so instead wore Draco’s. More than anything else, he seemed to favour Draco’s blue jumper, the one with all the holes, and if he found his own vicuna cloak in the closet, he ignored it completely. Potter wasn’t trying to be fashionable. He was trying to be comfortable.\nThe carelessness that made Potter look so decadent and devastating was an actual lack of care in his appearance. Even when Potter finally brought some of his own clothes to the flat, they were in a laundry basket, as though that was Potter’s idea of a suitcase. He threw them on, mixing his own clothes with Draco’s, and did not look in the mirror. He didn’t put potions in his hair; he forgot to shave; he didn’t take care to rumple his garments so that he looked fashionably tousled.\nHe merely was that way, and Draco might have assumed Potter was doing it because he wasn’t going out in public, but he looked just the same as he always did—expensive, handsome, untouchable, except for the fact that he was touching Draco all over. He couldn’t seem to stop, and Draco began to wonder what Potter really cared about, if not his image. Once, Draco had assumed that that was the most important thing in Potter’s life—now, however, Draco was beginning to doubt he knew Potter at all.\n*\nThere was something wrong with Harry Potter.\nEverything Draco had once assumed was a bid for attention now seemed like Potter merely trying to deal with his own existence. He was singularly bad at it, and Draco did not know how to help him when what Potter wanted was to be normal and he wasn’t. He just wasn’t. \nIt wasn’t Potter’s fault. If anything, it was everyone else’s fault, for making Potter feel this way—but that wasn’t fair either. They’d all been through the war, hadn’t they; they all dealt with it in different ways, and this was what was wrong with everything. That war had happened and they’d all had to go on afterwards; they’d all had to make their lives, and the lives that they had now were not the lives they’d had before.\nDraco couldn’t talk to Potter about any of it, and it was becoming a problem. Draco didn’t want Potter to see his pity. He knew that that was not what Potter needed, because Potter didn’t need to be treated differently. He wasn’t different. He was just like Pansy, just like Draco—just like Alice. They were equal. They were the same. \nAlice—that burden that Draco had carried so long—had been a victim, but so had they all. They’d been victims of things that were bigger than themselves, and they had been children. Draco had made mistakes, but he knew that now. He’d grown. He’d paid and would always pay, and that didn’t change the fact that he’d been hurt as well. \nNot knowing what else to do, Draco started writing. This article was more personal than his other ones, and he didn’t know how to make it less so. He wanted to write about those first hard years, being hissed at in the streets, unable to find a job. He wanted to write about Potter, being mobbed while in the streets, unable to simply be alone. He wanted to write about all the ceremonies and dedications and celebrations with the memory of a killing illuminated in the Atrium for everyone to see, and Draco wanted to write about Alice.\nHe wanted to write about the man who had lost Alice, who had taken things from other people to pay for it, and how it would never be enough. None of it would ever be enough, but they could still live. They could move on. They could grow, and they were still people. They were human beings.\nDraco wrote the article a little bit at a time, in bits and pieces. He knew that he couldn’t work on it at home, just in case Potter took a sudden interest and read it. Potter would not want to hear about it, but Draco still had to say it, so he worked on it solely at work, stashing the manuscript under the till.\nAt night, when he came home, Draco tried to be what he could for Potter—the person that Potter wanted, the person who could tell him that he was just the same as anybody else. It was becoming more and more difficult—sometimes, Draco just wanted to hold him, and Potter still talked to his invisible companion. Sometimes he still cried out in his sleep, and worst of all, Potter kept taking Dreamless Sleep.\nPotter’s sleep was so fitful now that Draco was almost relieved sometimes when Potter took the potion, but it wasn’t right. No one should need that much sleeping potion—no normal person, anyway, and Draco didn’t know how to make it better. He wanted to be what Potter needed; he wanted to be the one who could make him feel normal, but he didn’t know what to do with this.\nDraco should have known that he would fail.\nSometimes when Draco thought about it, his arm began to hurt. He was nothing; he could do nothing. He didn’t know what had made him think that he could be with Potter. And yet, there was his article, and Draco believed in that, too. Potter’s own trauma made it so that Draco could believe; when Draco saw how much Potter suffered, he realized that it had been all right for him to suffer too.\nDraco didn’t know what to do, and he continued not to know until the day he walked into the apothecary to find Mister Tamanam reading his manuscript.\nDraco was in the store-room after hours, and came out to let Mister Tamanam know he was going home. Mister Tamanam was sitting behind the register, holding a long scroll. When Draco recognized it, he went white as a sheet.\nWhen Mister Tamanam looked up, his eyes were wet. “This is beautiful,” he said.\n“I . . .” Draco couldn’t find his voice. His head jerked back and forth. “I didn’t write it.”\n“Of course you did.” Mister Tamanam rolled it up. “I always knew you were too good for this place.”\n“Too good—Mister Tamanam.” Draco walked swiftly over to the counter. “Don’t let me go.”\n“Let you go?” Mister Tamanam looked confused. “My boy, whyever would I? They’ll take you.”\n“Don’t tell the Aurors.” Draco leaned in, and didn’t care that his voice sounded desperate. “I’ll go quietly.”\n“The Aurors?” Mister Tamanam’s confusion deepened. “I meant the Prophet. You wrote those other articles, didn’t you? The anonymous ones that everybody always talks about.”\n“No.” Draco’s head kept jerking. \n“Draco.” Mister Tamanam’s voice was soft, and just a little stern. When he got that way, Draco knew that they weren’t going to advertise in richer districts; they weren’t going to lobby for better ingredients; they weren’t going to try experimental brews. Mister Tamanam was a family man, and he never liked the idea of business growing; it was the one thing they butted heads about.\nThis time, Mister Tamanam wasn’t talking about business. “You’ve always wanted me to expand. You always wanted this shop to become more than it is, high end, a classier product, a finer clientele.”\nDraco swallowed hard. “I was out of order. I apologize.”\n“Just you listen,” said Mister Tamanam. “I wasn’t interested because I have no ambition. You do. And for years I’ve watched you, right behind this counter, never doing anything for yourself because you thought you never could. You never even call me by my first name, you’re so afraid of getting taken to task. It’s time you stretched your wings, my boy. Take a chance.”\n“Pardon,” Draco began, but then found that he could not speak.\nMister Tamanam went on. “The other articles in the Prophet are popular. I can tell this is the same writer; I can’t believe I didn’t guess it before. This article, though—” Mister Tamanam tapped the scroll, and Draco wanted to do nothing more than snatch it from his hands. “This is gold. These are things that need to be said, and I hope you do so. I hope this time you believe in yourself enough to put your name to it.”\nDraco opened his mouth, then closed it. He didn’t know what to say.\n“I especially liked the parts about Harry Potter,” Mister Tamanam said, handing Draco the scroll. “That poor man.”\n“I’m sure he’s fine,” Draco said quickly, taking the scroll and shrinking it. He shoved it into the bag on his shoulder.\n“Maybe,” Mister Tamanam said. “But if that gets printed, maybe some people might finally give him some peace.”\nMister Tamanam’s words were like nails in a coffin, and Draco couldn’t hear anything after them, not even his own voice. “Thank you, Mister Tamanam,” he said.\nMister Tamanam smiled widely. “It’s Ravi.”\n*\nThat night, before going home, Draco stopped by the owlery on Sop Lane. Draco didn’t have an owl any longer, and didn’t receive owls at his flat, since it was a Muggle location. This was his owl post address, and where he sent off articles to The Daily Prophet.\nDraco could always send the article anonymously. There were personal details in it—enough to know that it was written by a young, former Death Eater, but not enough to pin it to Draco Malfoy. There weren’t personal details about Potter—it was no more than what the general public knew about him. On the other hand, Draco hadn’t written the article to be published. He’d written it for himself, because he needed to, because he needed to say those things. Unrolling the scroll in the warm, quiet owlery that night, Draco reread what he had written. \nIn some ways, the article was about Harry Potter. At first, Draco hadn’t thought of him as a human being. He’d conjured his own image of Potter instead of seeing who he really was, just like everyone else. Even though Draco had always thought of Potter as an equal, he’d seen whom he wanted to see, instead of whom he really was. Potter was desperately flawed, but not in the ways that Draco had thought, and it had taken a while for Draco to see that Potter was fragile. Potter was damaged; he was just as scarred as Draco was.\nPotter thought that because no one saw him as a man, he deserved to be punished, and while Potter did not deserve worship either, he didn’t deserve to be hurt. He didn’t deserve to be frightened and alone. He deserved to be treated as a human being, and it was seeing this that made Draco realize, at last, that perhaps he deserved something too. It was Potter who had first made him feel that he didn’t have to pay for Alice, that each of them was only human. Draco had made mistakes, but he had paid for them. \nHe’d keep on paying, and if this article was a way to pay as well, then he would do that too. If this article was a way to remind people that they were human beings—that Potter was a human being, then it was worth it.\nPicking up a quill on one of the shelves in the owlery, Draco signed his name at the bottom of the scroll. He gave the scroll to one of the owls and put a galleon in the slot. Telling the owl the address for the Prophet, Draco gave it a treat. The owl spread its wings, and took flight.\nWrapping his cloak about himself, Draco Apparated to the alley near his flat. He knew what he needed to do.\n*\nThat night, Draco finally said something about the Dreamless Sleep. “You know you can’t have that every night.”\n“What?” said Potter. \nThey were in bed together, and Potter was settling beside him. “Dreamless Sleep.”\n“It’s all right,” said Potter.\nIt was too dark to see Potter’s face, but Draco turned toward him on the bed anyway. “It’s no wonder you can’t keep it up, if that’s what you’ve been doing.”\n“It’s better than the alternative,” said Potter.\n“I don’t care about your nightmares, Potter.”\n“Maybe I do.” Potter put one of his hot arms around him—he was always hot, always too hot, and Draco was beginning to wonder whether it was another side effect of Dreamless Sleep. “Go to sleep.”\n“You shouldn’t mix it with Sweet Dreams.” \n“Why not?” Potter said.\n“Don’t be so entirely moronic. The poppy seed reacts badly with the bat’s wing. That’s third year potions.”\n“I haven’t noticed anything.”\n“Why do you think your accidental magic is so bad?”\n“What accidental magic?”\nDraco sat up in bed. “It also causes memory loss. It’s extremely irresponsible, Potter.”\n“Oh.” Potter looked down at the sheets over his knees. “Maybe I can take more than anybody else. Maybe I need it more than—” \n“Don’t act like an imbecile.” Draco purposely kept his voice light. “You’re not special. You’re not superhuman. You’re just a sad, scarred simpleton who can’t handle a little extra attention.”\n“Draco—” Potter started, then stopped.\n“Is this turning you on?” and it was killing Draco to say these things, but he knew that he could do it. He knew that if he did this right, he could make Potter see the truth. “You get turned on when I insult you, is that it? Does it get you hard?”\n“Yes,” Potter said, and licked his lips.\n“You’re sad,” Draco said, and moved over closer, straddling Potter’s hips, leaning in toward his ear. “You’re so sad, and so messed up; you can’t even get it up without hearing how worthless you are. I know you. I know you, Potter.”\n“You know me.” Potter arched up under him. “You know all about me.”\n“I know what’s best for you,” Draco said, reaching between them so that he could have Potter’s cock. “I know what you need.”\n“Yes. Yes—”\n“I know you don’t need more Dreamless Sleep than other people,” Draco said. “I know you’re just like other people, no matter how sorry you feel for yourself—”\n“This,” Potter gasped. “This was a dirty trick, Draco.”\n“It’s the only way I could get you to listen.” Draco’s hand moved down and back, caressing Potter’s balls, then back further still. “You think you’re so special, think you don’t have to follow the rules; the only way you’ll listen is if someone brings you down.”\n“Yes,” Potter said. “Take me down; you can take me—”\nPotter lifted up his hips, and Draco pushed a finger inside of him—dry, and Potter was so tight, too tight for this, too tense to take it without the proper preparation, and Draco did it anyway. “You think you’re above the rest of us? You think you’re special? You’re not. You need just what the rest of us need. You should get just what the rest of us get.”\n“Put another in.” Potter’s voice was strained, too high. “Put another one in; hurt me; please—”\n“I’m not going to hurt you,” Draco whispered, and pushed another one in anyway. Potter’s rim was dry and clenched so tightly that Draco’s finger almost ached in sympathy, and yet he kept going, putting it into Potter, putting it in. “You don’t get special treatment; you don’t get it any rougher or harder than anyone else; you get just what anyone else gets—”\n“Please. Please, I need—”\n“You deserve just what everyone else gets,” Draco said, arching over Potter’s body to look down into his wet eyes. “You deserve to have someone who looks out for you, who touches you, who tells you when you’re stupid. It’s what other people have, Potter. It’s not any more than plenty of other people have.”\nPotter was whimpering. “Fuck me. Fuck me, I need—”\n“You need this,” Draco said, “and I can give it to you. Tell me you’ll stop taking Dreamless Sleep.”\n“Draco—”\nDraco pushed his fingers in again, hard. “Tell me you don’t think you’re special or too bad for it; tell me you’re not an idiot; tell me you deserve to be healthy and happy and get what you want, because you do, Potter. Everyone does.”\n“Draco—”\n“Tell me,” Draco said, twisting his fingers. “Tell me, and you can come.”\n“I’m not,” Potter said. “I don’t.”\n“You do,” Draco said. “You do deserve it. Tell me that you do.”\n“I—I do.”\n“And you’ll stop taking the Dreamless Sleep.”\n“I, I’ll stop.”\n“Tell me all of it,” Draco said, and put his other hand around both of their cocks.\n“I’ll.” Potter swallowed. “I’ll stop taking Dreamless Sleep.”\n“Good.” Draco leaned in, squeezing Potter’s cock. “Now come.”\nPotter came. \n* \nThe next day, Draco became famous.\nOn the way out of his Muggle flat, he saw an owl, and thought that it was odd. The few owls that Draco usually received knew to deliver to the owlery on Sop Lane. Only someone who did not know how to contact him would send an owl to Peckham, and even then, they would have to know where he lived. Concerned, Draco walked several blocks to the Muggle Alley, then Apparated to Tamanam’s on Sop Lane. \nThe shop was mobbed with people. The giant crowd was exactly the sort that Draco usually avoided, but he thought about his article, and what he had told Potter. Draco was a human being. He did not deserve vitriol and hatred, not anymore. Despite the fact that it felt like his left arm was going to burn a hole through his sleeve, he wasn’t going to hide.\nDraco took a step into the crowd, and they all turned toward him. Then they cheered.\nThey wanted to interview him and they wanted to take his picture. The article had resonated with the public, the reporters said, and the public wanted him too. They wanted to talk to him and about him and share with him their stories about after the war, what it was like to live and be different and carry all those burdens, all that guilt. They wanted to talk about their scars, and what it was like to learn that you were human after all.\nDespite the fact that Draco had remained unnoticed for all those years, he hadn’t been hiding. Anyone could have found him had they wanted; they just hadn’t wanted to before. Now, apparently, they did, and throughout the day there was a steady stream of visitors to the shop who didn’t want to buy anything; they just wanted to talk to Draco.\nDraco didn’t know how to handle it, at first, or what to say. People kept shaking Draco’s hand, his Death Eater hand, and they touched him like they didn’t care. They said his name like they didn’t care, and it felt like a whole new world. There was too much going on and too much happening, and Mister Tamanam had to shut down the shop because of all the crowds, but he still seemed very happy for Draco, happy and proud.\nBefore the shop closed, a representative from The Daily Prophet contacted Draco and asked him to their offices, where they offered him a job. It was just like everything Draco had ever dreamed during all those hard years of poverty and drudgery. The salary, while not enormous, was over three times what Draco made at the apothecary, and Draco would be doing something important, something integral to the wizarding world. He would finally be somebody; his name would be in the paper, and the only thing that Draco could think was now that Potter might want to be seen with him.\nNow they might walk the streets together, and when a gaggle of witches recognized Potter, Potter wouldn’t send him away. Now Potter could meet Mister Tamanam, and Draco could introduce him—they could be together like a couple, a real couple, and Draco didn’t know but he thought maybe Potter would be his boyfriend now. Now, maybe they could go on real dates, dates in places that weren’t the Muggle Tesco or Shu Castle; now Potter could be seen with him in places like Diagon Alley and no one would point or throw things.\nDraco knew that Potter still wouldn’t want all the attention, but Draco could finally shield him from it, instead of simply running away and hiding. He could give Potter a regular life, and Potter would be grateful for it. Potter would snog him silly for it; Potter would tell him again that he loved him, and Draco would finally be able to say it back.\nBy the end of the day, Draco’s heart was in his throat. He couldn’t wait to go back to Potter, Harry Potter in his flat, Harry Potter whom he loved, who loved him back. They were finally really equal, and Draco could finally give Potter everything he wanted.\nWhen Draco got back to the flat, Potter snogged him, just like he always did. “Congratulations,” he said, when he pulled away. \nDraco knew that his face was ridiculously pink, but he didn’t care. “Did you read it?”\n“Not yet,” Potter said. “I only saw the fall-out from it. I told you a long time ago that you’d be famous if you signed one of those articles.”\n“I really am quite clever, aren’t I?”\nPotter smiled, that strange curled smile that always looked a little sad. “You got about a thousand owls today. The Aurors aren’t going to like that.”\nDraco looked at him then, really looked at him. “Why are you wearing that?”\nPotter was wearing the vicuna cloak from the closet, the one that Draco had put there the very first time they had shagged, and had not taken out since. “I found it in the closet,” was all that Potter said.\n“Yes, but . . .” Reaching out, Draco parted the cloak. “You’re wearing all your own clothes.”\n“I thought I’d better.”\n“Why?”\n“They’re your clothes, Draco.” Potter scraped his lower lip over his teeth. “I shouldn’t have been wearing them anyway.”\nDraco pressed his lips together. “What are you saying?”\n“I’m not saying anything.”\n“Yes, you are. You’re saying something, and you’re saying it—extremely poorly. What are you saying? Use your words, Potter.”\nPotter stared at him a while, and then his head turned, ever so slightly, to the empty space beside him.\nDraco grabbed Potter’s arm, jerking him so that Potter faced him. “Don’t listen to him. Listen to me. You can’t go. You can’t leave me—”\nPotter’s eyes went out of focus, then abruptly locked on Draco’s. “I’m not leaving. I just . . . have to go.” His tongue touched the corner of his lips, his eyes darting to the side. “Draco,” he said, turning back to Draco again. “The Ministry is going to come here. There were too many owls.”\n“And?” \n“I can’t go back. Not yet.”\n“You’re embarrassed. You’re embarrassed to be seen with me.”\n“What?” Potter recoiled. “No.”\n“Are you afraid I’ll tell them? Afraid that now they can actually say my name, now they can look me in the eye—now that they respect me, you’re afraid I won’t be your dirty little secret?”\n“My dirty—what?”\nDraco walked forward. Potter was bigger than he was, but Draco didn’t care; he started pushing and kept pushing until he had Potter against the wall. “I know what this was for you,” Draco said. “I know what I am. I could give you everything, because no one would ever find out.”\n“You did give me everything. You gave me everything I wanted.” Potter’s fingers touched Draco’s cheek, and Draco pulled away.\n“And now it’s over,” he said without turning around. “Is that it?”\n“No, I’m . . . I just can’t . . . Jesus God. Just go away.” Draco turned around to find Potter rubbing his forehead. “I can’t—if people are going to know who you are—where you are—they’re going to find me and I can’t—I can’t—”\n“You can’t have them knowing that you shag me.”\n“Draco, it has nothing to do with you.”\nDraco took a step back forward, shoving Potter hard against the wall. His hand was square against Potter’s chest, right over the scar that Draco knew was there. “You have to do with me. If you can’t handle that I’ve finally made something of myself—”\n“It isn’t that. Christ, Draco, it’s . . .”\nDraco waited, but Potter didn’t finish. “It’s that you preferred me when I was nothing,” Draco said, his voice icy.\nPotter darkened. “You were never nothing to me.”\n“Prove it,” Draco said. “Stay with me.”\nPotter stood there for several long moments. When he spoke, his voice was blank. Matter-of-fact. “I can’t,” he said, and didn’t stay.\nDraco stood in the middle of his flat, famous now, and all alone. \n*\nWhen the Aurors did come to take Draco away, they weren’t coming to arrest him. It had been a month since the publication of his article, and in those last four weeks, the owls, wizards, and witches in that vicinity of Muggle Peckham had made too much of a disturbance. The Aurors informed Draco that he had to move, so as not to continue to draw attention to the wizarding world.\nBy then, Draco had already taken a job at The Daily Prophet. Mister Tamanam had wished him well, and they remained in touch. Some of the furor surrounding Draco’s instant fame had died down, but Draco still felt like he lived in a different world. Reporters at the Prophet told him how much they respected his articles; friends who had long since refused to communicate with him came out of the woodwork. \nBlaise Zabini and Theo Nott were suddenly sending him owls. Draco might have resented it, but for the fact that he understood. The article that had made Draco famous was about the fact that they had each dealt with the war in different ways, and many of those ways had been necessary to the individuals that enacted them. Even those that had done wrong things, bad things, were just trying to deal with it in their own ways. The man who had stolen from Draco, claiming that it was to pay for Alice, had been hurting just like everyone else—just like Zabini, just like Nott. \nDraco forgave them and they were friends again. Everything had changed, but some things still remained the same, and it was invigorating to talk to people who cared about society and politics, who were interested in other things. \nThey, and every new person that Draco met, were still no replacement for Potter. When the Aurors told him he had to move, Potter was all Draco could think of—Potter, who had loved this flat; Potter, who had shagged him on this couch. There had been a time when Draco had thought that Potter wanted to stay here forever, and Draco would have let him. Now with Potter gone, there was no reason to stay. Aloysius could live anywhere, and Draco had never been fond of the flat to begin with.\nDespite what Draco had said to Potter, he knew that Potter had left because he didn’t want the attention. That didn’t make it hurt less. He wouldn’t have made Potter acknowledge their relationship. Potter could have still pretended that he didn’t know him. They could have gone on as they had before, keeping it a secret—it would have been better than losing Potter altogether.\nStill, had Draco had to choose, he would have chosen this. It wasn’t because he cared about Potter less than he cared for this new life; it was because this was who Draco was. He’d been fine as a salesclerk, but it was never who he had wanted to be; he had managed living in a Muggle district, but it was never where he had wanted to live. Now he could have so many of the things he wanted—all of the things, except for Potter.\nAccording to the news, Potter was living with Weasley and Granger now. He’d come out of hiding, just as he always did after a disappearance. Draco supposed that he was just another interval in Potter’s life, just another chapter—but Draco knew the truth. He knew about Potter, through and through, and even if Potter could never admit it, Draco knew that he could have made it work. They could have made it work, had Potter been willing to give it a chance.\nHe hadn’t, though, and Draco moved. He took Aloysius with him, setting up in Radik Alley, a wizarding District in London. Draco supposed he might see Potter again one day. They would pass each other in the street, and nothing would change.\nPotter hadn’t ruined his life after all.\n*\nWhen Draco did cross paths with Potter once again, it wasn’t in the streets. It was at a Ministry gathering, and it did not happen at all as Draco supposed it would.\nThe gathering was an acknowledgment of the ten year anniversary of Voldemort’s defeat. There would be two Ministry events—one was a large gala celebration, the other a quiet remembrance. The events had been orchestrated partly in response to Draco’s article—he had called for ways to commemorate the war without making people relive what had happened. In the end, people had acknowledged that different people wanted to deal with their memories in different ways. Some needed them to be projected on Ministry walls; others needed quiet gatherings. \nSome needed to just stay home, and most people assumed that that was what Harry Potter would do. He had made several appearances since his absence after the New Year’s ceremony, but he had not returned in full force. Public appearances were still relatively rare, and no one expected him at this one.\nDraco certainly didn’t. He knew that Potter had been invited, but couldn’t really believe it when the quiet murmur started in the attendees, and everyone turned to stare. Draco himself had been invited both as a reporter and as a guest, and he had been surprised and pleased by how many people stopped to talk to him. When Potter appeared, however, most of the talking stopped.\nPotter looked just as devastating as ever—the messy hair, the fine cloak. He was ridiculously attractive, and somehow it was even more compelling that Draco finally knew Potter wasn’t even trying. He wasn’t trying to look stern and unhappy; he didn’t know that it made people want to eat him alive. He just was that way, and underneath the cloak, he wore a blue jumper.\nDraco knew that it was his blue jumper. He hadn’t been able to find it since Potter had left, and yet he had been so sure that Potter hadn’t taken it. Potter hadn’t been wearing it that fatal night, and he had left everything else. Still, it was definitely Draco’s jumper. Potter had come to the Ministry with holes in his jumper and a tear at the hem, and it only made him look more debauched and seductive, like something you wanted to take home and unwrap before the fire.\nEveryone was looking at him that way—everyone, or at least they were looking at him like they had questions and he had all the answers, and they weren’t going to leave him alone. Draco couldn’t stand it. He simply couldn’t stand it; this was not meant to be the sort of celebration where people got called out, where a fuss was made for just one person. This whole gathering was happening so that people could share quiet memories in peace, but with Potter there, it was turning into the other kind of event. \nPeople just wanted to stare at him, touch him, talk to him—and they couldn’t even seem to see that it hurt him, that he hadn’t come there for this. Presumably, Potter had come for the same reason everyone else had, and when Draco looked, he could see it in Potter’s eyes. They had that same wild gleam they did when Voldemort was talking to him, and Draco didn’t care that Potter hadn’t loved him enough to stay.\nDraco would still do anything for him.\n“I’m going to write another article,” Draco told the person beside him. He had written several articles since he had been hired by the Prophet, but he hadn’t written any more editorials. \nNow, however, Draco told the people around him that he was going to give his side of the story, during the war. The Dark Lord had lived in his manor, and he was going to talk about it. It wasn’t something Draco had ever planned on sharing, but it was the most distracting thing that he could think of, and gradually it moved through the crowd.\nDraco moved through the crowd too, until he was in the center, cutting Potter off. Draco used to do fairly well at holding court in school—it was a skill he hadn’t used much since then, but now that he was trying it he realized he was fairly good at holding other people’s attention. The crowd gradually moved away from Potter, focusing instead on Draco.\nWhen Draco had a moment free, he took out his wand. Thinking of Potter, he cast his Patronus. \nThe spell did not cause much disturbance; Draco’s Patronus was small and looked exactly like Aloysius. “Tell Potter that he can go to my flat, if he wants,” Draco said. “Tell him I’ll cover him.”\nThe silver cat nodded once, then slipped through the crowd.\nLater when Draco looked up, Potter was gone. Draco didn’t know if Potter had listened to the Patronus, or whether he had simply disappeared. Either way, Draco felt as though a final debt had been repaid.\n*\nLate that night when Draco Apparated to his new flat, Potter was waiting.\n“Hello, Harry,” Draco said, slipping his wand into his pocket.\nPotter stood in the shadows, next to some unpacked boxes. His hands were in the pockets of his cloak. “I did want you to be a secret,” he said.\n“I know you didn’t mean it that way.” Draco took off his own cloak, hung it on the hook by the door.\nPotter took a step forward, into the light. “I’m not sure you know which way I did mean it.”\nDraco couldn’t meet his eyes. “I saw how you looked today. How you reacted when they started swarming you. I should have realized that . . .” Swallowing, Draco lifted his gaze. “I should have realized that when I became successful, you would fear you could not escape them.”\n“It wasn’t just that. I didn’t want to share you.”\nDraco pressed his lips together, and Potter took another step closer. \n“I did want you to be a secret,” Potter said. “I wanted you to be my secret. I didn’t want anyone else to have you. I didn’t want them to have a single piece of what I had.”\n“You can have it again.” Draco looked away again. “You can have anything you like. I’ll give it to you.”\n“Draco.” Potter took another step, then he was reaching out, taking Draco’s left hand, and Draco let him have it. \n“I’ll give you anything,” Draco said. He had thought that he was a man; he was a human being. He could make it through—but he didn’t want to. Not without Potter. He didn’t want any of it without Potter, and Draco hated him; he hated him, for making him feel this way. \n“I’ll go away with you, if that’s what you want,” Draco went on. “We can live in the Muggle world. I’ll change my face, if that’s what you want; I’ll . . .” He looked at the floor. He had thought that he was beyond this, beyond groveling, beyond being willing to give up who he was and what he really wanted, but he wasn’t. He could never be, where Potter was concerned. Potter had ruined him after all.\nPotter didn’t say anything. Instead, he opened up Draco’s sleeve, and started touching inside.\nDraco tugged his hand, but Potter didn’t let him go. “Don’t,” Draco said.\nPotter’s fingers were on Draco’s arm, but his eyes were on Draco. “When you said that you embarrassed me, I realized you didn’t understand me. Not really. Those things you used to say to me—those hard, hurtful things I needed so much to hear—you were saying them to yourself.”\nDraco tried to pull away again, but Potter held tight. “You didn’t understand me,” Potter said. “But I didn’t understand you either.”\nDraco tried to make his voice cool. “I suppose we were both at odds, then.”\n“No.” Potter’s hand wrapped even tighter, and it was still hot—ever so hot, just like a brand. “We were perfect. Do you hear me, Draco? We were perfect.”\n“Well,” Draco said lightly, “I’ve always been perfect, Potter; I really was the clever one between us; I’m really very—”\n“God,” said Potter. “God,” and he yanked on Draco’s arm, yanked hard, and then Draco was against him, and the arm not holding Draco’s arm was around Draco, holding Draco to Potter’s long hard body. “I love you,” Potter said, and kissed him, hot and hard. “I love you and your stupid face, your stupid fucking insecurity, didn’t you ever know that?”\n“Certainly,” Draco said breathlessly. “You told me I was perfect.”\n“You are,” Potter said, and held him closer. “Didn’t you know that I meant every word I ever said to you?”\nDraco tried to look away, but Potter was holding him so tightly that it was difficult. “I didn’t mean the things I said to you.”\n“But you said them anyway.” Potter’s voice was low, almost savage. “You said them because I needed to hear them, and do you know what person would do that for me? You know who will do that for me?”\nDraco swallowed hard, and still couldn’t meet Potter’s eyes. “Ronald Weasley?”\n“No one.” Potter put both arms around him and then hugged him. He hugged him very very hard. “No one will tell me when I’m a stupid git or when I’m self-absorbed; they pity me when I can’t come and—and he laughs. He laughs and laughs and laughs at me, and if I’m going to have someone laughing at me, I want it to be you.”\nIt was hard to breathe, Potter was holding him so tightly. “I’ll laugh at you any time you like,” Draco said. “As long as you don’t go away again.”\n“Jesus, Draco. Jesus.” Potter finally pulled away, and then he was kissing him again, his tongue almost brutal in Draco’s mouth, and Draco could feel himself being bent backward, back and back and back. “I’ll do anything,” Potter said, finally breaking away, bringing Draco back up with him. His lips murmured along Draco’s neck. “I’ll go to any of the parties any of the Ministry celebrations; I’ll do anything you want; anything; just let me be with you. Let me be with you.”\n“You don’t need to go to any Ministry celebrations.” Draco played with the corner of the collar of Potter’s cloak, feeling the soft, magical material slide between his fingers.\n“I would though,” said Potter. “Anything.”\n“You don’t have to do anything,” Draco said, and just kept touching the fabric. “You really just have to do one thing.”\n“What? What is it?”\n“Can you get Lovegood to make me one of these cloaks? I’m desperately in love with it, and I really don’t think you do it justice.”\n“I . . . think that that can be arranged.” Potter’s smile curled on both sides, now.\n“You really are a hero.” Draco put his arms around Potter’s neck. “Just like they say.”\n“Hey. You said something that wasn’t an insult.” Potter didn’t seem upset about it.\n“Don’t get used to it.”\n“Why not?”\n“Potter,” Draco said, and kissed him. “This is at least the tenth time you’ve ruined my life.”\n“I guess I’ll go on ruining it,” Potter said, and kissed him back."
}