{
    "id": "11147544",
    "url": "https://archiveofourown.org/works/11147544?view_full_work=true",
    "author": [
        "kkeomtae"
    ],
    "title": "Bubblegum Bitch",
    "rating": "Explicit",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "방탄소년단 | Bangtan Boys | BTS"
    ],
    "relationships": [
        "Jeon Jungkook/Kim Taehyung | V"
    ],
    "characters": [
        "Jeon Jungkook",
        "Kim Taehyung | V",
        "Park Jimin (BTS)",
        "Min Yoongi | Suga",
        "Jeon Jiwoo",
        "Ahn Heeyeon | Hani"
    ],
    "additional_tags": [
        "Fashion Magazine AU",
        "Fake/Pretend Relationship",
        "Romance",
        "Hate to Love",
        "Dislike to Love more like it actually",
        "High Heels",
        "Tattoos"
    ],
    "language": "English",
    "series": "",
    "published": "2017-06-09",
    "completed": "2017-06-18",
    "words": "33,948",
    "chapters": "3/3",
    "comments": "329",
    "kudos": "15,435",
    "bookmarks": "3,793",
    "hits": "169,521",
    "summary": "<p>Jungkook is but a simple delivery boy; the last thing he needs is a high maintenance fake boyfriend.</p>",
    "notes": "<p>if you think this looks vaguely familiar i had a fic like this ages ago and deleted it,,,, anyway</p>\n<p>this is done. im just splitting it because i'm a bitch. \"will she finish a fic this time\" you may ask. </p>\n<p>[jay park-the promise.mp3]</p>\n<p>title(s) from marina and the diamonds' song bubblegum bitch</p>\n<p>(proofreading is for losers)</p>\n<p>me: *updates quick*<br>everyone: *surprised*</p>\n<p>still not proofread yadda yadda</p>\n<p>stayin true to myself and not proofreading</p>\n<p>please dont get your hopes up i suck at ending fics (which is why i never do)</p>\n<p>(also changing the rating bc i wrote a little more than 'mild smut',,, even tho its not super explicit or anything)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>i hate this bye i cant write endings (or smut) lol bye</p>",
    "text": "\nOn the home page of Muscle Pig Delivery Service it did specifically say 'We Deliver Everywhere!', but that didn't mean Jungkook had expected to get an order from a business district in Gangnam on 33 vegetarian sandwiches.\n\n \n\nHonestly Jungkook's fanciest delivery until now was a few cakes for a shotgun wedding, and driving onto the parking lot of a high-rise skyscraper on his ratty motorcycle looked a little sad. He parked his bike between two humongous SUVs, took off his helmet and stared at the intimidating glass building. Everyone walking in and out of the front doors were dressed in stylish suits, and Jungkook took one look down at his ripped jeans and sighed. \n\n \n\n Whatever. \n\n \n\nWhile Gangnam was generally considered intimidating in Jungkook's books, it also meant money, and Jungkook had counted a lot of zeros behind the sum his employer offered for the delivery of these vegetarian sandwiches. \n\n \n\nJungkook pulled the box off the back of his motorcycle, grabbed his bag with the card machine his co-worker Jiwoo had invested in for their small company, and walked towards the front doors of the high-rise building. He entered with a throng of businessmen just finishing their lunch break, and took a swift turn towards the reception area upon realizing he had no idea where he was going. \n\n \n\nHe cleared his throat awkwardly in front of the disastrously bored-looking receptionist. \n\n \n\n\"Hello,\" Jungkook greeted, \"I have a delivery for a Kim Namjoon from Bangtan Magazine?\" \n\n \n\nJungkook thought it was an awful name for a fashion magazine, but maybe that's why he wasn't in the fashion industry. \n\n \n\n“It’s lunch hour, I’ll call their office for you to make sure he’s in,\" the receptionist said, pressing a button on the phone in front of her. She placed the phone to her ear, all while keeping uncomfortable eye contact with Jungkook. \"Hello, this is the lobby reception. There's a delivery for Kim Namjoon.\" \n\n \n\nJungkook didn't hear what was being said on the phone, but tried to look very interested in the art hanging over them to avoid a sudden, awkward staring contest. He probably looked very out of place. \n\n \n\n\"Kim Namjoon is not in his office right now, he's working on a photoshoot,\" the reception finally said after a short while on the phone. \"I suppose that's where your delivery is going. Floor 16, studio 3.\" \n\n \n\n\"Thank you.\" \n\n \n\nJungkook didn't forget his manners and bowed at the receptionist while taking his leave towards the elevators. He entered with a rowdy bunch of office-workers, all of them talking animatedly about some deadline, and Jungkook barely managed to press the button for floor 16 before being squeezed into a corner. \n\n \n\nThey barely let him out of the elevator again a little later, as if Jungkook's presence was bothering them somehow, and Jungkook stumbled into a pretty bare hallway with a large, red, '16' painted on the wall. The door to studio 3 was already in sight, and Jungkook could hear loud voices from inside, incoherent arguments floating into the hallway. \n\n \n\nJungkook used his elbow to press down the handle and kicked he door open with his foot, entering a large studio set; he saw a large array of artificial plants in front of a blue screen and tall, pretty girls in swimsuits surrounded by cameras. He only managed to take the scene in for a few seconds before being interrupted by a harsh voice.\n\n \n\n\"Who are you?\" \n\n \n\nJungkook tried his hardest not to gape at the man talking to him, but he had always been horrible at masking his expressions. The stranger had a deep voice but a small, pretty face, tan skin and bleached blond hair falling across his forehead. His eyes were large, he had a sharp nose and full lips, and Jungkook's eyes fretted between the many piercings in his ears. He was taller than Jungkook by quite a lot, but Jungkook only realized why when letting his eyes travel down his intricately patterned suit to the tall designer heels on his feet. \n\n \n\n\"Uhm,\" Jungkook started, not knowing where to look, \"I'm just here with the delivery -\" \n\n \n\nThe guy didn't seem to have heard him, his head snapping around to look over his shoulder at someone shouting loudly about the lighting. His ear-piercings made soft, jingling sounds and Jungkook was immensely distracted by the guy's side profile, so much that he almost forgot what the hell he was even there for.\n\n \n\n\"Ah,\" the guy said when he turned around again, wide eyes scrutinizing Jungkook's attire as he chewed obnoxiously on the piece of sweet-smelling gum in his mouth, \"you must be the new intern.\" \n\n \n\nNo, Jungkook thought in panic, no, I'm absolutely not. His mouth was opening and closing but no sound seemed to come out, and it didn't seem like this guy was listening either, eyes moving towards the set behind them. It was like he had already decided Jungkook was the intern. \n\n \n\n\"Put the food on the table over there, the models will get hungry and are allowed a break in about thirty minutes.\" The guy was sizing him up again, managing to blow a small, pink bubble with his gum with a grimace on his face. \"I'm Kim Taehyung, fashion editor. You better discard that sweater before tomorrow or I will personally burn it.\" \n\n \n\nJungkook stared down at his black sweater, frown on his face. This was a brand name sweater, and one of Jungkook's favorites, even. He always wore it to work because it covered all of his tattoos, so old ladies wouldn’t deduct payment for how he looked. It happened before. \"Listen, I'm just here for Kim Namjoon -\" \n\n \n\n\"Ah, Namjoon has been showing you around?\" \n\n \n\nNo! Jungkook's mind screamed. \n\n \n\nKim Taehyung sighed and put a hand on Jungkook's shoulder; his hands were large and his fingers were thin and long and covered in rings, nails painted black. \"Do you know who Kim Namjoon answers to, intern?\" \n\n \n\nJungkook would answer, but the guy was leaning close and he was very pretty and tall and intimidating, and his high cheekbones had a little glitter on them. He smelled exactly like the sweet gum he was chewing, and it was distracting the way his tongue would occasionally peek out to lick sugar off his lips. Jungkook’s own mouth was a little dry as he opened it to reply. \n\n \n\n\"You?\" he guessed, voice almost failing him. \n\n \n\nKim Taehyung looked pleased, a fake smile sliding onto his face. \"That's right, intern. So why don't you leave those sandwiches on the table, pull the sleeves of your horrid sweater up and come help me?\" \n\n \n\nIt wasn't like Jungkook wanted to, because Kim Taehyung was wrong and Jeonggguk had already tried telling him that. He would like to say he just didn’t say anything because he could exploit this opinionated, well-dressed asshole, but Jungkook was honestly just too flustered to say anything. \n\n \n\nSo, he did what Kim Taehyung told him to. \n\n \n\n\"Okay, intern,\" Taehyung said, clapping his hands together. \"I need you to carry some heavy boxes for me. They're going to the fashion department after the shoot, so I want all of them moved to the main studio entrance. A trolley is coming to pick everything up after the shoot, but it’ll be easier to pick them up from there.” He pointed at a large stack of cardboard boxes in the corner of the room. \"Every box with fashion printed on them. I'm sure you can read that word, even if your own sense of fashion is questionable.\"\n\n \n\nJungkook was a little offended, but he also owned primarily white shirts, so a part of him definitely agreed. \"Alright,\" he said, as if he really was an intern. \n\n \n\n\"They're quite heavy, be mindful of your back,\" Taehyung voiced, blowing another bubble, and while it was words of kindness he sounded very nonchalant saying them. Like he just didn't want to be responsible if Jungkook did injure something. \n\n \n\n\"It's okay,\" Jungkook said, \"I'm quite strong.\" \n\n \n\nTaehyung's eyes seemed to inspect him again, and then he huffed a right, whatever, and told Jungkook to be responsive. And do his fucking job. \n\n \n\nObviously, it wasn't Jungkook's job, but Kim Taehyung did turn around and walk away, so Jungkook could technically leave this post and find Kim Namjoon, whoever that was. Jungkook was starting to doubt he was going to get his money by the end of the day, because this set seemed extremely busy and no one looked particularly approachable. \n\n \n\nJungkook reckoned he would have more luck when things had calmed down, and so he took a deep breath and lifted one of the boxes. \n\n \n\nHonestly, it wasn't exactly difficult work. It was just lifting kind-of heavy cardboard-boxes labeled 'fashion' and putting them down by the exit (gently, because Jungkook didn't know what was in them). It wasn't until Jungkook had placed the final box down by the entrance that someone finally approached him, deep furrow between his brows; the commotion by the cameras seemed to have died down a little behind them, Jungkook noticed.\n\n \n\n\"You're not the intern,\" the guy said. He was dressed in a slim, navy suit and his haircut looked more expensive than everything Jungkook owned. \"Taehyung-ssi said he set my intern to work but the intern isn't arriving until tomorrow.\" \n\n \n\nJungkook smiled sheepishly. \"Uh, well, Kim Taehyung was very convinced I worked here, for some reason.\" He brushed some imaginary dust off his sweater. \"I'm just the delivery guy. I got your sandwiches here in time, but then the he set me to work.\" \n\n \n\n\"Jesus fucking Christ,\" the guy sighed, palming his face in his hands. \"I'm so sorry. I ordered those sandwiches, I'm very sorry to have delayed you. I'll pay you for your hard work here as well, I'm very sorry.\" He said sorry so many times Jungkook almost felt bad, even if he was the victim in this situation. \n\n \n\n\"It's okay. I was too flustered to say much, I was at fault too,\" Jungkook said quickly, before he could apologize again. \"Pay by cash or card?\" \n\n \n\n\"Cash,\" the guy Jungkook supposed was Kim Namjoon said, hurriedly pulling a wallet out of his inner pocket. He handed Jungkook a wad of 50 000 won bills, and Jungkook tried his best to mask his expression. \"Again, I'm very sorry. This should hopefully compensate for your troubles.\"\n\n \n\nJungkook took the offered money without question, because honestly who was he to decline. He had done what Kim Taehyung asked him, and whether he was employed here or not he should get paid for the work he had done. “It’s more than enough,” Jungkook offered a small smile as he shoved the money into his bag, “thank you for using Muscle Pig Delivery Service.” \n\n \n\n“Yes, uh - sorry, once again.” \n\n \n\nJungkook shook his head. “Don’t sweat it. I was free anyway. Then - I’ll take my leave.” \n\n \n\n“Yes, of course - don't let me keep you any longer.” \n\n \n\nBowing slightly to Namjoon, Jungkook mumbled a formal goodbye and went towards the exit of the studio. On his way, he caught the gaze of Kim Taehyung, and Jungkook might have sent him a small, too-forced smile and wave before walking outside. \n\n \n\nMaybe.\n\n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n \n\nOn Thursdays and Fridays, Muscle Bunny Delivery Service was not, well, in service, because those days Jungkook worked as a receptionist for his cousin’s small tattoo studio in Insa-dong. Jimin didn’t have many employees, but Jungkook was one of them, though with his relatively profitable delivery service Jimin wouldn’t let him work more than two days a week. \n\n \n\nSomething about raising him to be independent, or whatever. \n\n \n\nNot that Jimin actually raised Jungkook or anything. Jimin was too busy with grades and cram school for most of his life for them to even hang out much, and Jungkook only realized why when Jimin suddenly moved to Seoul and opened his own tattoo studio. His cousin hadn’t seemed like the type who wanted to be a tattoo artist, but Jungkook remembered Jimin had always been a pretty decent artist, and one of the things they used to do together when they were younger was draw. The fact that Jimin had actually gone through with his parents’ wishes for such a long time only so that they would send him to Seoul by himself without question was positively genius.\n\n \n\nWhen Jungkook decided he didn’t want to stay in Busan after high school, Jimin welcomed him with open arms to the hustle and bustle of Seoul, even when Jungkook said he didn’t want to go to university. \n\n \n\nJungkook had never been very good at school. He wasn’t fond of studying, and neither was he particularly good at it, but Jimin had always said there was nothing he couldn’t do. So, well, academics wasn’t Jungkook’s greatest strength, but he was good at adapting. He was good at just throwing himself into things, good at manual labour, good at fixing things. Muscle Pig Delivery Service had started with him just doing odd jobs around their neighborhood, helping old people change their lightbulbs, go get their groceries and drive them places for some quick cash. It was only one year ago he made an actual business out of it, with the help of Jimin and his second-in-command, Heeyeon. \n\n \n\nOf course, Jungkook knew just having a service that said “I’ll help you with anything,” was highly dubious, so he decided a delivery service was the best way to market himself. You could still book him for other stuff, but then it was a more detailed process than just ‘go there, pick this up, deliver here’. He got some very odd jobs now and then, like that time he had dressed up as a mascot for a children’s birthday, and another time he was hired to babysit a teenager only a few years younger than himself. \n\n \n\nMoney is money. \n\n \n\nJungkook did have an assistant of sorts; a girl named Jiwoo, who usually took care of and declined the weirder requests they got (no, the teenager-sitting job was not the oddest thing Jungkook had been asked to do) and she also managed their online finances. She was only in her first year of university and juggled the work with a demanding schedule in school, and Jungkook always appreciated her help, even if they hardly actually saw each other. \n\n \n\nJiwoo was another reason why Jungkook agreed to have some days off every week, so that his only employee could actually get her education. As much as Jungkook disliked school, he wasn’t going to get in the way of Jiwoo doing well. \n\n \n\nWorking at Jimin’s tattoo studio was pretty easy work anyway. Jungkook only handled the incoming calls and made sure to send arriving customers in the direction of either Jimin or Heeyeon. In Jimin’s words, his job was just to ‘greet people and look pretty’. \n\n \n\n“Do I have any more appointments today?” \n\n \n\nJimin had just sent his customer out the door, reminding the quite young girl to keep her shoulder wrapped. Jungkook checked the planner on the computer and shook his head. “You’re all free,” Jungkook said, returning to the game he’d been playing on his phone. He was ten thousand points away from a new high score in anipang. “Heeyeon-noona is done, too, she’s cleaning up her station.” \n\n \n\nHis cousin hummed. “Let’s order some food and eat here, then. You hungry?” \n\n \n\n“Starving,” Jungkook groaned. \n\n \n\n“Heeyeon!” Jimin called. “We’re getting food!” \n\n \n\nHeeyeon exited her room, bunch of take-out pamphlets already in her hands. When Jungkook first met her he had been extremely intimidated; her whole demeanor screamed I’m in charge, and Jungkook would never dare go against her. She had a large array of colorful, pretty tattoos on her thighs and shoulders and always wore dark lipstick and long, fake nails. For a long time Jungkook wondered how Jimin had managed to befriend someone as cool as her. \n\n \n\nJimin was probably the nicest person Jungkook knew, and while Jungkook always made fun of his cousin he also respected him a lot. It was a shame that people judged Jimin so harshly when meeting him, because behind the intricate patterns of ink on his upper body and arms, his cousin was a ray of sunshine. Sometimes Jungkook wondered if they were even related, because Jimin was outgoing and patient and Jungkook was certainly not. \n\n \n\n“Should we just get pizza?” Heeyeon asked, throwing the pamphlets onto the front desk. She pulled her green hair into a small, low ponytail. “I’ve been craving.” \n\n \n\nWith no complaints, they ended up ordering a meal deal from the nearest Mr. Pizza, getting enough for them to be fully satisfied when they each went back to their own respective apartments later. Jungkook used to live with Jimin up until a few months ago, but after saving up enough money with a steady income of delivery money Jungkook had found himself a small two-room apartment. It was still in the same neighborhood as Jimin’s place, but it felt better having a place for himself, no matter how shitty the apartment was. \n\n \n\n“So,” Heeyeon said as they were seated on the sofa area with two large gold crust pizzas in front of them, “how’s the business, Guk?” \n\n \n\nJungkook nodded through a mouthful that was mostly cheese and strips of tender beef. “Pretty good,” he uttered, trying his best not to spit his food into Very Intimidating Girl Heeyeon’s face. “Jiwoo’s filtering out the bad requests, so business is a lot more effective now than I used to be on my own. Though yesterday was weird.” \n\n \n\nJimin lifted one eyebrow. If it was one thing Jungkook knew, it was that Jimin loved hearing about Jungkook doing odd jobs. He had nearly pissed himself laughing when Jungkook told him about the time he was hired as a magician for some kid’s party despite not knowing how to do magic tricks. “So what happened this time?” he asked, smile already crawling onto his face. \n\n \n\nShaking his head lightly, an image of Kim Taehyung popped up in the back of Jungkook’s head. Weird. “I mean, the job in itself wasn’t anything special,” he started, licking some bbq-sauce from his fingers, “just a regular food delivery. But it was for this high fashion magazine photo shoot or something, and one of the people working there thought I was an intern. And I was an idiot and wasn’t able to say anything about it, so I just - I just ended up doing what he told me to do?” \n\n \n\nHeeyeon and Jimin both squinted at him. “Sorry, what?” Jimin voiced. “You just - did it? Why didn’t you say anything?” \n\n \n\n“I don’t know!” Jungkook said, feeling a blush rise to his cheeks. “I was just very flustered, and the guy was - uh - he didn’t seem like he would take no for an answer, anyway, so I just -” He paused, suddenly feeling like something was stuck in his throat. Maybe it was his dignity. “I got paid for it,” he finally mumbled, as an excuse.\n\n \n\n“You’re such a pushover,” Heeyeon snorted, “a big, muscular pushover.” \n\n \n\nJimin, for a short second, looked concerned. “You said you got paid for it, right?” he voiced. “Then that’s good. But that was kind of…” Jimin snorted, and shook his head. “Wow, Jeonggukie.” \n\n \n\nWith a grimace, Jungkook took a big bite of his slice of pizza and tried to stare anywhere but Heeyeon and Jimin. “Whatever. It was a weird job, but I got paid for it. It’s not that big of a deal, it’s just - I hope they don’t call us again, you know? Is that stupid of me to say?”\n\n \n\n“Did they pay a lot?” \n\n \n\n“… yeah?” \n\n \n\nHeeyeon nodded. “Then it’s stupid.” \n\n \n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n\nJungkook woke up at the crack of dawn the following Monday with his cell phone blaring out the newest Red Velvet track. He groaned, picked up his phone, and managed to read Jiwoo's name on his screen through the morning grogginess. With a sigh - because Jiwoo calling meant it was a job - Jungkook rolled out of bed and put the phone on speaker as he started stretching his sore limbs. He might have overdone himself at the gym yesterday.\n\n \n\n\"Yeah? What you got for me Jiwoo?\" \n\n \n\nJiwoo hummed, sounding sleepy as well. \"Coffee delivery. Same place as the veggie sandwiches from last Wednesday.” \n\n \n\nJungkook paused mid-action of pulling on his cleanest pair of pants and stared at his phone. As if expecting Jiwoo to say just kidding. \"Again?\" he questioned when she didn't pull it off as a prank immediately. Not that she did prank him often with fake calls for for jobs (she had never - Jeon Jiwoo was very professional), but Jungkook had shared with her the odd experience he had at Bangtan Magazine last Friday, so she knew he wouldn't be all too pumped on going back there. \n\n \n\n\"Yep,\" Jiwoo confirmed. \"They're paying well again. It's not the same guy ordering this time, though, this time it's a...\" she paused to find the customer's name in their orders, but for some reason Jungkook could already guess who had asked for an early morning delivery, \"... Kim Taehyung.\"\n\n \n\nGreat. \n\n \n\nWell, Jungkook was never one to say no to a well-paying job, even if he had to go through a probably very awkward conversation to get that money. He could manage. Jungkook had been in far more awkward situations than this before, he was sure. He just couldn't remember them at the top of his head. \n\n \n\nTeenager-sitting. Teenager-sitting was worse than this, right? \n\n \n\nYeah, definitely. \n\n \n\n\"Okay, I'll get it done as soon as possible.\" Jungkook stared at the small, digital clock on his wall and frowned. 6:30. Fucking hell. \"Where do they want me to pick the coffee up from?\" \n\n \n\nJiwoo repeated the address of a Twosome Palace quite close to the office building, and said she would text it to him as well. \"The order should be under Kim Taehyung's name, they’ll start it up for you when you get there\" Jiwoo finished. \"You don't have any more appointments until 4 after this, so just finish this quickly and you can go back to sleep.\" \n\n \n\nShe knew him too well. \"Thanks. I'll be going.\" \n\n \n\n\"Good luck.\"\n\n \n\nJungkook placed his hands on his hips and stared at the pile of have-used-but-is-still-usable clothes lying on his office chair. He spotted the brand name sweater he had been wearing last time and wrinkled his nose. Why do I even bother, Jungkook thought as he went to his closet to find a clean, casual long-sleeved shirt. It was nice enough that Kim Taehyung wouldn't burn it, hopefully. He slipped quickly into the bathroom, freshened up a little - he could take a shower later, whatever - and tripped out of his bedroom. \n\n \n\n“Oh, hey.” \n\n \n\nJungkook had almost forgotten he’d let Jimin crash on his couch. His cousin had been out clubbing last night with Heeyeon, and Heeyeon had accidentally taken Jimin’s stuff with her when she went back home, including his cellphone and the keys to his apartment. Jimin had knocked on Jungkook’s door at three AM after what he described as “the best lay ever” and promptly fell asleep in the middle of Jungkook’s living room. \n\n \n\n“I’m not awake enough for you to be speaking to me,” Jimin mumbled, rubbing his eyes. He still had smudges of eyeliner on his face.\n\n \n\n“Sorry,” Jungkook grinned, sheepishly. “Forgot you were here.” \n\n \n\n“Rude.” \n\n \n\nJungkook walked over and ruffled Jimin’s hair. “Make yourself something to eat before leaving, hyung. I went grocery shopping the other day, so there should still be edible stuff in the fridge.” \n\n \n\n“Mhm,” Jimin mumbled, “thanks, Guk. You’re the best, sometimes.” \n\n \n\n“Oh fuck you.” Jungkook flicked his forehead at that. “Whatever, I’m leaving. Go back to dreaming about whatever hot chick you were banging last night. If you’re still here when I come back I’ll cook something.” \n\n \n\nGrabbing his leather jacket and helmet from the hallway closet, Jungkook took a wistful look at the clock before slipping on his Timberlands and leaving the apartment. “Bye hyung!” he yelled, shutting the door and jogging towards the stairwell. His motorcycle was parked at the bottom floor, in the garage of the apartment complex, next to his neighbor’s old-as-balls Ford. Jungkook checked the time again before turning the engine on; he had only used a few minutes getting ready, which was good. Muscle Pig Delivery Service prided itself on being timely. \n\n \n\nThe traffic was pretty bad, but Jungkook still made it to the Twosome Palace to pick up Kim Taehyung's coffee order - one vanilla soy latte; one - within twenty minutes. The ride to the now slightly familiar business building was a very short one, and Jungkook was pretty certain Taehyung could easily have walked over in his designer heels to get his own damn coffee. He couldn't believe Kim Taehyung had made him wake up at the ass-crack of dawn for one coffee. \n\n \n\nThere were significantly less people there this morning, and Jungkook found himself walking towards the lobby receptionist - it was the same lady, of course - to ask for Kim Taehyung. \"Hello,\" he uttered, smiling awkwardly look of recognition flashed over the receptionist's face. \"I'm here with a delivery to Kim Taehyung.\" \n\n \n\nThe receptionist nodded, slowly, sizing him up and down. \"Aha. Bulletproof Magazine, floor 26. He should be in.” \n\n \n\n\"Thanks.\" \n\n \n\nThe elevator ride was also a much more quiet and less claustrophobic one. It was only Jungkook and a well-dressed, short, thin man with inky black hair and a sour expression on his pretty face, and they were apparently both going to floor 26. The man looked at Jungkook and narrowed his eyes as the elevator doors closed, taking in his appearance in the numerous mirrors on the walls. \"You don't work for me,\" he stated, and Jungkook wondered if every one of these fashion people just assumed boys dressed like him were interns. \"Who are you?\" \n\n \n\n\"I'm just delivering coffee.\" \n\n \n\nThe man looked at the vanilla latte in Jungkook's hand. \"One coffee?\" he voiced. \n\n \n\n\"Yes. One coffee for Kim Taehyung,\" Jungkook said, and honestly he couldn't help but sound immensely bitter about it. Jungkook treasured his sleep, damn it. \n\n \n\nThe guy snorted. \"Ah. Taehyung. That makes sense.\" \n\n \n\nJungkook eyed the numbers of the floors slowly rising. This was taking too long. \"Does he usually send people who doesn't work here out for random coffee runs?\" \n\n \n\n\"No, he's supposed to have an assistant for that,\" the guy answered. \"I might be Taehyung's boss, technically, but I can't do much about who he sends for his coffee. I'm afraid he doesn't listen to me, either.\" Oh, so this was the guy who was actually in charge, then. \"How does he even know you?\" \n\n \n\nJungkook wasn’t even sure why this guy wanted to know. ”Someone else hired me last Friday - Kim Namjoon?\" the man grunted to show that he knew who Jungkook was talking about. \"And then I showed up and Taehyung thought I was the new intern, so he made me move all this shit that was going back after your photo shoot or whatever, and I was a little too flustered to say no. So. Yeah. But I do actually do deliveries, I just don't - I usually don't end up in situations like those.\" \n\n \n\nThe guy - Kim Taehyung's boss - clicked his tongue. \"Understandable. Kim Taehyung is pretty difficult to say against, isn't he?\" \n\n \n\n Tell me about it.  \n\n \n\nThe elevator finally dinged, and Jungkook stepped outside after the other man. For someone so short, the guy had an impressive aura. ”I’ll show you Taehyung's office, if you'd like,\" he said, motioning for Jungkook to follow him in a nonchalant manner; Jungkook was in unfamiliar territory here, so who was he to decline? Bangtan Magazine HQ had a reception of its own, tall roofs and large fashion spreads blown up on the walls. Jungkook tried not to bump into too much of the minimalistic furniture as he followed the guy through the lit-up halls, attracting stares from several well-dressed people as he passed them. \n\n \n\n\"Here,\" the boss-guy voiced as they stopped in front of a door so suddenly Jungkook nearly faltered. He didn't, though, that's what's important. \n\n \n\n\"Thank you,\" Jungkook said, bowing his head. \n\n \n\n\"No problem. Don't let him bully you,” the guy smirked, and then he paced off, leaving Jungkook standing in front of Kim Taehyung's office door.\n\n \n\nJungkook cleared his throat rather nervously and turned to knock on the door, only to have it suddenly open on him. He managed to step back before the door hit him in the face, but then Kim Taehyung ran straight into him, and honestly Jungkook should have seen it coming. This morning was obviously doomed the moment he realized he had to go back here on Kim Taehyung’s orders. \n\n \n\nTaehyung’s body collided with his, and Jungkook caught a whiff of sweet-smelling bubblegum before disaster struck.\n\n \n\nThe still-hot coffee - as fate had it - decided to spill all over Jungkook’s shirt, seeping through the material effectively. Jungkook hissed out a timely ‘motherfucker’ just as Kim Taehyung finally seemed to realize the situation. He stared down at Jungkook - those designer heels gave him an unfair advantage - frown slowly etching onto his face. Not a single drop of the drink had made it onto Taehyung’s navy blue designer suit.\n\n \n\n“Is that my coffee on your shirt?” \n\n \n\nJungkook usually wasn’t good at talking back, but at this point he was tired and angry and his chest was burning. “Oh whose fucking fault is that?” he growled out. It was unlike himself, because Jungkook was never rude to customers. Not really. He might come off as uninterested and detached, but Jungkook was never deliberately rude. “Fuck this,” Jungkook voiced, examining the shirt closely, “why the fuck did I even come here.” \n\n \n\n“Because I’m paying you to bring me coffee, duh,” Kim Taehyung scoffed. “And I guess you have to go get me another one, now, since this one spilled. And I’m cutting down the payment, since it’s taking too long.” \n\n \n\nJungkook couldn't help it when his jaw dropped. Was this guy serious? “You’re fucking joking, right?” he said. “You’ve got to be joking?” Jungkook was pretty sure he had never met a more pretentious asshole in his life. “I’m just - I’m just going to leave, and I won’t take your stupid fucking money, and then you can just never contact my delivery service again, how is that?” Jungkook pressed the now-empty cup into Taehyung’s chest. “Here. I’m sure you can lick some of that stupid-ass vanilla soy latte out of the cup, if you try hard enough. If not,” he pointed to his chest, “there is more than enough here, because you ran straight into me causing it to spill.” \n\n \n\nKim Taehyung actually looked surprised at that, eyes dropping to the stain on Jungkook’s shirt. “What… what exactly are you offering here, delivery boy? For me to lick your chest?” \n\n \n\nOh, fuck. Fuck, that wasn’t at all what Jungkook meant. He was just pissed, and when he got pissed he tended to say a lot of stupid shit. “I - ”\n\n \n\nShaking his head, Taehyung held the door to his office open and motioned for Jungkook to go inside with a jerk of his head. “Get in, delivery boy.” \n\n \n\n“I did not mean -”\n\n \n\n“Get. In.” \n\n \n\nMumbling under his breath, Jungkook did as he was told - fucking idiot as he was; he should have just walked away - and Taehyung slammed the door shut after them both. Jungkook cleared his throat awkwardly as Kim Taehyung took long strides around him, to a rack of clothes standing behind his impressive desk. His office was huge, with large fashion spreads on the wall, a small seating area in one corner, and multiple clothing items hanging around and filling up the half-empty shelves on the wall. Jungkook noticed a whole shelf of glass-jars filled with bubblegum.\n\n \n\n“Strip,” Taehyung said suddenly, effectively stopping Jungkook from examining the interior of the office. \n\n \n\nJungkook spluttered. “Excuse me?!” \n\n \n\nTaehyung lifted one eyebrow, but for one second Jungkook thought he saw his cheeks flush. Probably the lighting. “Your shirt, delivery boy. I’m going to give you something to change into, and then you’ll go get my coffee and we’ll settle this business deal like adults. How’s that?” \n\n \n\nWow, okay. \n\n \n\nFucking asshole. \n\n \n\nGrumbling, Jungkook moved to lift his shirt over his head, because honestly it was growing uncomfortable to wear coffee-stained fabric. He had a feeling borrowing anything from Kim Taehyung would have consequences, but once again Jungkook was just agreeing to whatever Taehyung told him to do. \n\n \n\nTaehyung cleared his throat to get Jungkook’s attention, and no, the lighting was not fucking with him; Taehyung’s ears were bright red, and Jungkook was not imagining it. His eyes flickered between the tattoos on Jungkook’s arm and on his chest, and Jungkook wondered if it was possible to maybe just sink into the floor. Yeah, no, this was definitely a very awkward experience, and he wasn’t entirely sure how to feel about Kim Taehyung quite obviously checking him out. \n\n \n\n“S-shirt?” Jungkook voiced, weakly. \n\n \n\n“Hm? Oh, yeah.” Taehyung pulled a piece of clothing - it looked innocent enough - from the rack, and walked over to Jungkook with it. He held it up to Jungkook’s chest, seemingly measuring it. “This should do. It’s last season, but I’m sure the likes of you don’t really mind?” \n\n \n\nJungkook was sure that was an insult, but he couldn’t find himself to care. The shirt was nice enough - white with some blue patterns on it - and while it wasn’t anything Jungkook would normally wear it was better than something coffee-stained. As Taehyung handed him the shirt, he hastily pulled it on, because honestly he didn’t want to stand shirtless in Taehyung’s office one second longer. \n\n \n\n“Hey, Taehyung-ssi -” \n\n \n\nOf course, just as Jungkook was shrugging on the shirt, the door to Taehyung’s office opened and someone stepped inside. He had orange hair brighter than Jimin’s personality and tanned skin and he looked more than just a little surprised to see that Kim Taehyung had company in his office. Jungkook wasn’t stupid - the second he saw the stranger’s eyes widen, he realized how this might look, and he hurriedly buttoned the rest of the shirt with his cheeks on fire. \n\n \n\n“Did you want anything, Hoseok?” Taehyung asked. “I’m a little busy.” \n\n \n\nNo. No, stop, you’re making it worse. \n\n \n\n“I - I can see that,” the guy named Hoseok uttered, staring between Taehyung and Jungkook with what seemed to be genuine curiosity. “I’m just here to remind you that you have a meeting in thirty minutes, and you should finish whatever… business you have until then.” He smiled, in a way that said I have just witnessed something brilliant, and then he was out the door as fast as he appeared. \n\n \n\nJungkook wondered if Kim Taehyung was daft and just hadn’t been able to read the situation, and he was about to ask why the hell he hadn’t said anything but then Taehyung’s hands were on his collar and he was so close. It was like Jungkook had forgotten just how pretty Kim Taehyung was up close just from last Wednesday and was seeing him again for the first time. He had such gorgeous tanned skin and glittering cheeks and long eyelashes and nice lips, and it hit Jungkook all at once and left him just a little breathless. \n\n \n\n“There, now you look presentable enough, I suppose,” Taehyung voiced, and he was still a in Jungkook’s space and he smelled of bubblegum and his voice was smooth and deep and had a very obvious, forced Seoul dialect. Taehyung’s eyes sparkled, and for a very, very short moment it looked like he smiled. \n\n \n\n“Uhm,” Jungkook stuttered, like an idiot. \n\n \n\nTaehyung lifted one eyebrow at Jungkook’s response and finally stepped away. “Why are you just standing there like an idiot?” he snapped, voice suddenly harsh again. “Go get my coffee.” \n\n \n\nAnd like that the moment was shattered, because honestly no matter how gorgeous Kim Taehyung was it couldn’t mask the fact that he was a fucking bitch. \n\n \n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n \n\nOn Tuesday morning, Jungkook was once again woken up by Jiwoo’s phone call at 6:30 AM. \n\n \n\n“Let me guess,” he groaned into the phone, “Kim Taehyung?” \n\n \n\n“Yep.” \n\n \n\nGreat. \n\n \n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n \n\nThe fourth time Jungkook pressed the button to floor 26 to deliver Kim Taehyung his daily coffee he started wondering whether he was slowly accepting that this was just supposed to become routine. It was stupid, because after the first coffee delivery nothing really happened. Jungkook just delivered the usual vanilla soy latte, got his money, and then he was on his merry way. Taehyung didn’t hold him back or try to make him to intern work, and after getting the borrowed shirt back there was absolutely no reason for Jungkook to return to Bangtan Magazine. Yet, here he was, in the elevator on the way up to Kim Taehyung’s office, again. \n\n \n\n“I’m getting used to seeing you.” \n\n \n\nJungkook shared a short, acknowledging smile with Taehyung’s boss - he had introduced himself as Min Yoongi - and held up the cup of coffee. “Yeah. I guess this is an everyday job now.” \n\n \n\nYoongi chucked. “Taehyung is insufferable, but as long as you are getting paid I’m sure you can manage.” It was true. Taehyung paid him good money for just picking up coffee, which was one of the reasons why Jungkook still agreed to doing this. It was easy money. “I didn’t see you on Thursday though. Or Friday?” \n\n \n\n“Not working, then,” Jungkook said, because Yoongi was quite pleasant to hold conversations with compared to certain other people. “I have part time at my cousin’s tattoo parlor those days, but I’m in service on Saturdays. Sunday’s my only day off.” \n\n \n\n“You’re busy, then,” Yoongi said, nodding his head slowly. “You don’t go to school? You look like you could be in college.” \n\n \n\nAh. College. “School isn’t really for me,” Jungkook said simply, because that was the truth. Usually people didn’t understand, because what could you do without college nowadays? \n\n \n\n“I see.” The silence was a little defeating as the elevator came to stop on their floor and the doors dinged open. As usual, Jungkook let Min Yoongi out first. “Well, I suppose I might see you tomorrow, then, Jungkook-ssi. Please tell Taehyung to stop terrorizing you and rather find himself a new assistant?” \n\n \n\nBefore Jungkook had the time to answer or even ask why Taehyung didn’t have an assistant, Min Yoongi was gone, fretting down the hall to the right. Jungkook frowned, passing by the reception to get to Taehyung’s office. The receptionist - Jungkook didn’t know her name, but she was pretty and seemed nice - looked up from where she was filing her nails and offered Jungkook a good morning. Her quirk of her lips was just a little mysterious, but Jungkook tried not to think too much of it. \n\n \n\n“Just here to deliver Kim Taehyung his coffee,” Jungkook said, just in case. \n\n \n\n“Mhm,” the receptionist nodded, odd smile never leaving her lips. \n\n \n\nWhat the fuck, Jungkook thought, looking over his shoulder as he ventured down the brightly-lit hallway. The road to Taehyung’s office was familiar now, and since Taehyung didn’t seem to want anything but coffee nowadays, Jungkook could manage. There had been no accidents and no Taehyung pushing him around to do odd jobs, so Jungkook could always leave as soon as he got his money. \n\n \n\nHe knocked on Taehyung’s office door - the plaque read Kim Taehyung, fashion editor in both hangul and english - and let himself in. \n\n \n\n“Coffee delivery,” he voiced, peeking inside the office. Taehyung was on the phone, barely looking up as Jungkook entered. He motioned for Jungkook to put the coffee on his desk, and so Jungkook closed the door behind him and approached.\n\n \n\n“No, hyung, I’m not going to ditch the launch party,” Taehyung said, his voice strung and mouth set in a deep frown. “Why would I?” \n\n \n\nJungkook barely heard the indistinct sound of someone talking on the other end of the line. He felt like he shouldn’t be there, but Taehyung hadn’t paid him yet so he really didn’t have a choice but to stand there awkwardly. Taehyung grabbed his vanilla soy latte and took a small sip of it, humming. “I’m not going to drop out on the launch party just because you were an asshole and gave the chief editor position to Yoongi. I’m not that petty,” Taehyung said, sounding extremely petty. “I’ll come, hyung. Don’t worry.” \n\n \n\nThe smile on Taehyung’s face was strained, and his eyes flickered up to Jungkook briefly. “Oh. Uh, yeah, sure. I’ll… think about it. He might be busy.” Taehyung cleared his throat and sat up straighter in his chair. “See you, hyung. Now hang up, international calls are really expensive, you know.” \n\n \n\nJungkook watched as Taehyung ended his call, put the phone back on his desk and groaned, resting his head in his hands. Awkwardly clearing his throat, Jungkook shifted the weight on his feet where he stood. \n\n \n\n“May I have my money now, Taehyung-ssi?” \n\n \n\n“Huh?” Taehyung met his gaze, wide-eyed, and Jungkook felt his heart stutter because Taehyung looked so confused, like he had no idea why Jungkook was still there. \n\n \n\n“My payment, Taehyung-ssi. I have another job to get to, so if you wouldn’t mind…?” \n\n \n\n“Oh! Oh, right!” Taehyung hurriedly stood up from his seat, heels clicking against the expensive wooden floor as he walked over to the seating area in the corner, picking up a sleek, black bag. “You have another delivery this early?” Taehyung asked, and Jungkook was very surprised he actually tried making conversation. He hadn’t said many nice things to Jungkook following up to this, so it was… unexpected. \n\n \n\n“No, it’s… another sort of job.” \n\n \n\nTaehyung turned and looked at Jungkook over his shoulder. “That sounds really dubious, delivery boy.” \n\n \n\nAt this point Jungkook was pretty sure Taehyung knew his name, but for some reason he kept insistingly calling Jungkook delivery boy. “It’s not anything weird,” Jungkook said. Not this time, he added in his head. “I was asked to do a self defense class at a girl’s high school, and they’re paying me for it. Simple as that.” \n\n \n\n“Are you even certified to do that?” Taehyung asked, scoffing. Jungkook wasn’t really, but both he and Jiwoo did martial arts when they were younger, and the school didn’t mind. It was the first job they had agreed to take on as a team in a long while, and Jungkook was looking forward to it. “I was not aware that’s how your business worked.” \n\n \n\n“I’m sure you didn’t read everything on our webpage, then,” Jungkook said. \n\n \n\nTaehyung pursed his lips as he walked over to Jungkook, Jungkook’s payment in his hand. “I suppose I didn’t,” Taehyung said. “I’ll make sure to read it thoroughly until next time. I’m sure it explains why you aren’t in service on Thursdays and Fridays, too?” \n\n \n\n“I have a part time job,” Jungkook uttered, voice faltering now that Taehyung was standing close to him. He always tried to talk in a stable, nonchalant manner to make himself appear more confident, but whenever Kim Taehyung got into his personal space Jungkook became a stuttering mess. Jungkook hated how effected he was, just because Taehyung was attractive and tall and had very pretty eyes. “My co-worker is quite busy with university, so for her sake I keep the delivery service closed a few days every week.” \n\n \n\nTaehyung lifted his brows, quickly. “How considerate of you.” \n\n \n\n“I know, I’m pretty nice.” \n\n \n\nTo Jungkook’s surprise, Taehyung chuckled, and for once the smile on his face didn’t look the least bit smug. Oh no, Jungkook thought. Oh no, he can’t have a cute smile that is so unfair. “I guess you are. Well, there is your money -” Jungkook startled as Taehyung promptly shoved the money into the front pocket of his jeans, “- so you are free to go. I’m a very busy person, and it seems you are as well, so let’s not keep each other occupied.” \n\n \n\nJungkook, still in shock that Taehyung had actually just done that barely managed a nod before turning around to leave the office. “Hey, delivery boy?” Taehyung spoke up, and Jungkook turned around again embarrassingly fast. \n\n \n\n“Y-yes?” \n\n \n\nTaehyung shot him another smile, an adorable box-shaped one, and lifted his coffee cup. “See you tomorrow.” \n\n \n\n“Y-yeah,” Jungkook said, fumbling to open the door, “tomorrow.”\n\n \n\nWhat the fuck, he thought as he passed by the reception on his way to the elevator with flaming cheeks. What the actual fuck. \n\n \n \n \n \n \n \n\n“Man, that was fun,” Jiwoo voiced, stretching her arms over her head as they exited the premises of the all-girls high school. They had just spent one hour teaching fourteen-year-olds how to throw grown men (read: Jungkook) into the ground, and Jiwoo had been in her element, enthusiastically showing off about thirty different ball-kicking techniques. Jungkook, with a very sore back, groaned at her enthusiasm. \n\n \n\n“Yeah, I could tell you enjoyed yourself,” he said. “Thanks for not actually kneeing me in the balls during all that. I could tell you were tempted.” \n\n \n\nJiwoo patted Jungkook’s hurting shoulder. “I do technically work for you, Jungkook, so I wasn’t going to hurt you too much. I’ll buy you some lunch as compensation for throwing you to the ground?” \n\n \n\n“I accept.” \n\n \n\nThey left Jungkook’s bike on the school’s parking lot - Jiwoo didn’t drive, but Jungkook had promised to give her a lift back home - and started scouting the nearby area for a decent restaurant. They found one without much difficulty, the old waitress ushering them in and taking their orders even before they had time to sit down. \n\n \n\nJungkook counted through the money the school’s principal had given them, pulling out Jiwoo’s share and handing it to her immediately. Usually Jungkook got most of the payment, since he was the one actually doing the job, but this time they split it 50/50. Jiwoo, already on her phone, barely looked up to accept the money. “Oh, thanks,” she voiced, and Jungkook choked on nothing as she simply stuffed the money into her bra. “I saw I’d gotten a few e-mails during the self defense class, so -” \n\n \n\nShe paused, her brows furrowing deeply at whatever she was reading on her screen. “What the fuck,” she voiced, looking up from her screen, “what the fuck.” \n\n \n\n“What’s wrong?” Jungkook asked. “Is it a weird request?” \n\n \n\n“Oh, it’s weird alright,” Jiwoo confirmed. She continued scrolling down her phone, eyes widening more and more the further she read. “It’s really weird.” \n\n \n\nJungkook frowned, leaning over the table. “Then just reject it?” \n\n \n\n“I mean -” Jiwoo hesitated, “- it’s from that guy at Bangtan Magazine, Kim Taehyung -” \n\n \n\nJungkook hated how he could already feel his face heating up, but he tried to fake a grim expression at the mention of Taehyung’s name. “W-what about him? What does he want?” Jungkook asked, and Jiwoo grimaced before handing him her phone. Jungkook scrolled to the top of the e-mail and started reading. \n\n \n\nFrom: Kim Taehyung ([email protected])\n\n\nSubject: Job Request\n\n \n\n Hello.  \n\n \n\n This is a formal request for Muscle Pig Delivery Service to help me with a simple, one-evening task. I might have gotten myself in sort of a… situation, and I am in need of a date for a launch party three weeks from now. As I have used your services before I am sure you know who I am asking for; I’m willing to pay a large sum for Jeon Jungkook’s company thorough the night, and for him to pretend we have been dating for a while.  \n\n \n\n I will request for him to join me on a few occasions to take pictures and make it a little believable, but I will pay you extra for the trouble. I am not sure how much is appropriate payment for this sort of job, so please contact me on that notion. If you agree to the job I am willing to discuss details. \n\n \n\n Best wishes, \n\n\n Kim Taehyung \n\n \n\nJungkook almost dropped Jiwoo’s phone after reading the e-mail, staring up at his co-worker with wide eyes. The old waitress came over with their food but Jungkook couldn’t even focus on how delicious it looked, because what the hell. When he told Taehyung about his business and how it wasn’t just a delivery service this morning he hadn’t expected Taehyung to actually take use of that information. Was this why he had been acting weirdly nice? \n\n \n\n“This is on you, Jungkook,” Jiwoo said, pulling a bowl of kimchi stew closer to her. “I mean, it’s a weird-ass request, but you’ve done some pretty bizarre shit for money, so this might not be that bad? Anyway, I’m putting the decision on your shoulders, since you’re the one that has to do this shit.” \n\n \n\nJungkook should say no, because Kim Taehyung was pretty and intimidating but also a complete bitch, and now that Taehyung wasn’t even here, enthralling Jungkook with his looks, he should be able to. He should be able to tell Jiwoo to reject the offer. He could honestly just tell Jiwoo to reject all of Taehyung’s offers, because Jungkook was his own boss, damn it, but for some reason he felt like he would lose. He would not only lose a customer, but he would lose whatever game Taehyung was playing by constantly hiring Jungkook just to get him his fucking coffee. \n\n \n\nDetermined to find out just what Taehyung wanted from him - because this couldn’t possibly have been Taehyung’s plan to begin with - Jungkook gave the phone back to Jiwoo and said, “accept it.” \n\n \n\nJiwoo paused in the action of taking a spoonful of soup, staring at Jungkook. “Are you for real?” \n\n \n\nJungkook nodded, already knowing he was going to regret this. “Yeah. If it’s Kim Taehyung we can be sure to milk a lot of money out of it, so I’m sure it’ll be worth it. I’ll ask him about it tomorrow. When I deliver his coffee.” \n\n \n\n“Oh. Right. Yeah, he already put in the order for you to come by tomorrow, I forgot to tell you.” \n\n \n\nFor a second, Taehyung’s grin when he had said see you tomorrow flashed in front of Jungkook’s eyes, and he could feel himself flushing for absolutely no reason. “Hm. Though so,” he mumbled, hiding his reddening face in the steam of the boiling hot soup in front of him. \n\n \n\nHe was so going to regret this.\n\n \n \n \n\nscream to me on tumblr\n\n\n“Good morning, Jungkook-ssi,” Yoongi greeted as they met inside the elevators. Jungkook felt like shit, having spent the whole night thinking too much - thinking too much about Kim Taehyung at that - but he still managed a polite smile in Yoongi’s direction. “I see you’ve brought two coffees today?” \n\n \n\nJungkook took a look at the coffees in his hand. He’d bought a simple iced americano for himself together with Taehyung’s usual order, knowing they might have to talk over the new… job for a while. Jungkook was already regretting it, the closer he got to Taehyung’s office, but every time he got a little too comfortable with the idea of bailing he reminded himself of the money. Money. And of course, figuring out just what the fuck was going on inside Kim Taehyung’s head. \n\n \n\n“Yeah, I was thirsty,” Jungkook said in excuse, letting Yoongi walk out of the elevator first as soon as it stopped on the floor of Bangtan Magazine. He greeted the receptionist, said a small goodbye to Yoongi as he walked down to the right, and went on his way to Taehyung’s office. The walk there was just a little too short, but Jungkook hadn’t spent the whole evening writing down every question he had for Taehyung to back out now. It might sound really stupid, but Jungkook was slowly coming to terms with how affected he was by Kim Taehyung. \n\n \n\nHe shortly knocked on Taehyung’s door, not even waiting for him to reply before entering. Taehyung wasn’t on the phone this time, but he was tapping furiously on the keyboard of his computer, deep furrow between his brows. “Oh. Delivery boy.” \n\n \n\nJungkook nearly rolled his eyes as he closed the door behind him. “Good morning,” he said, placing Taehyung’s coffee on his desk. \n\n \n\n“Morning,” Taehyung answered, grabbing his coffee immediately. He pointed towards a chair sitting by the wall; it was simple and looked very uncomfortable. “Bring that chair, sit down.” \n\n \n\nJungkook wanted to protest, but he didn’t. He dragged the chair — deliberately being very loud — towards Taehyung’s desk and sat down, taking a long sip of his coffee as he met Taehyung’s eyes. Taehyung slowly raised one eyebrow as he brought his own cup to his lips. “So,” Jungkook said, thinking back to the notes he had jotted down last night. “I have a few questions about that… job.” \n\n \n\nTaehyung nodded, placing the cup down and folding his arms over his chest; he leaned back in his chair, pushed back a little, and threw one long leg over the other. Jungkook’s eyes dropped to the bright red heels on his feet, and he gulped. Suddenly he forgot everything he had spent the whole night thinking about; everything he was supposed to ask. “Uhm,” he started, looking up at Taehyung’s face. He was smiling, now, but it was the sly, smug kind again. “I was just - I was really just wondering why. Why me?” \n\n \n\n“Ah.” Taehyung tilted his head to the side, and the smile fell off his face just as quick as it had appeared. “I guess it’s kind of my fault, and I’ll do my best to explain. Remember that you already agreed to take the job!” \n\n \n\nTaehyung actually looked a little nervous at that, and Jungkook might have scooted his chair just a little closer to his desk. “Yeah. I already took the job, I’m not going to bail on you,” he said, trying to sound a little bit comforting though he had no idea why. “You’re still paying me for this.” \n\n \n\nTaehyung nodded, pushing a hand through his hair. Even though it was bleached, it looked soft as it fell perfectly over his forehead again. “Well - you remember the first time you came for coffee delivery here? That day we were interrupted?” Jungkook vaguely remembered the man with the bright orange hair bursting into Taehyung’s office, so he nodded. “Well, Jung Hoseok is kind of a gossip, so he might have spread some… rumors about the two of us. Long story short the entirety of Bangtan Magazine think we are dating.” \n\n \n\nJungkook was very happy he wasn’t drinking in that exact moment, but he still felt his jaw drop comically. Suddenly the knowing looks the receptionist gave him every morning made sense. “What the fuck,” he blurted out, “why haven't you - I don’t know - cleared it up?” \n\n \n\n“It’s not like I specifically said that you were my boyfriend, I just didn’t say anything to reject it either,” Taehyung said, and he looked embarrassed, which Jungkook would have found kind of adorable if he wasn’t a little pissed. “I might have this… reputation of not being able to have exclusive relationships, and maybe I just wanted people to believe that wasn’t true. I didn’t really think far ahead, since, uh…” Taehyung was actively avoiding Jungkook’s eyes at this point, “my brother owns the magazine. Well. My family does.” \n\n \n\nOh no. \n\n \n\n“Oh no,” Jungkook voiced. “Your family is going to be -” \n\n \n\n“Yes,” Taehyung cut him off, quickly, “they are. And my brother heard about my supposed boyfriend and wasted no time calling me and having me promise to bring him to his launch party. My parents will be there but - but,” he sat up a little straighter and looked at Jungkook pleadingly, “my parents live abroad and will only be in Seoul for a short while and my brother travels a lot so he’s never really here either. It’s just a one-time thing, they don’t really need to see you in person more than once. I just need a few pictures as proof that we have been on dates, and then the only time we really have to pretend we are together is during the launch party.” \n\n \n\nJungkook pinched the bridge of his nose trying to process this information. This was more complicated than just pretending to be Kim Taehyung’s boyfriend for one night, because Taehyung actually needed Jungkook of all people. He couldn’t actually believe Taehyung had willingly let all his co-workers think they were dating. Jungkook was pretty sure he wasn’t as romantic that he would willingly wake up every morning to give his boyfriend coffee. \n\n \n\nWell, he had already been doing that for a week, but he was paid for that. \n\n \n\n“We just have to meet up a few times before the party,” Taehyung continued, and Jungkook noticed how his voice was slowly growing more desperate. “We’ll take some cute pictures that I can send to my family and stuff, and then during the launch we can act all lovey-dovey and - and then I’ll stop. I’ll stop asking for deliveries, and I’ll never contact you again.” \n\n \n\n“Okay,” Jungkook said, quickly, and maybe that was mean. But Taehyung was weird and made Jungkook feel weird, and if Taehyung promised leaving him alone the moment this was over, that was good. He already agreed to take this job anyway, there was little he could do but agree. Jiwoo had been thrilled at the potential fortune they could make off this job. \n\n \n\n“Oh thank God,” Taehyung sighed, and it looked like his entire body just deflated in relief. “Great, fantastic.” \n\n \n\nHe looked so relieved Jungkook almost felt bad about even considering not doing this. Which was really fucking stupid, because this whole agreement was just bizarre. \n\n \n\n“When do you want to start?” Jungkook asked, because the sooner then got this whole thing going the better. Hopefully he would be able to leave soon so he could start to man himself up for the next time he met Taehyung. \n\n \n\n“Now,” Taehyung said, immediately standing up from his seat. Jungkook’s eyes widened, because he hadn’t expected that, and he squeezed his forgotten coffee-cup in his hands. He watched as Taehyung walked over to the glass jars on the shelf behind his desk and took out a bright pink ball of gum and popped it into his mouth. When he walked closer to Jungkook, the sugary smell hit him like a freight train. “First, your number,” Taehyung said, pulling his own phone out of the inner pocket of his fancy-looking suit jacket. \n\n \n\nJungkook felt like Taehyung was staring a hole into his head as he plotted in his number on Taehyung’s smartphone. Seconds after giving it back to him, Jungkook felt his own phone vibrate in his pocket. “There we go. Now, I’m still very busy today, but when are you free on Thursday?” \n\n \n\n“Uhm - after six?” \n\n \n\n“Okay. Text me the address to wherever you’re at and I’ll pick you up. Where do you want to go?” \n\n \n\nJungkook’s mind blanked out for a second. “I don’t… know?” \n\n \n\nTaehyung sighed. “Okay, then - we’ll go to the movies. That’s simple enough. Let’s just remember to take a few pictures before the movie starts.” Taehyung put his phone back into his pocket and popped a large bubble with his gum. “I’ll follow you to the elevator.” \n\n \n\nYou really don’t need to do that, Jungkook thought, thinking of the looks the receptionist would give them if they came out together, but Taehyung had already walked past him and to the front door. Jungkook scurried out of his seat and followed Taehyung like some pathetic puppy, because what else could he do. \n\n \n\n“Don’t forget to send me that address,” Taehyung said as they walked down the hallway. Jungkook felt stupidly small walking next to him, and it was more because of the looks they attracted rather than the height difference. A few of Taehyung’s co-workers actively popped their heads out of their offices to look after them.\n\n \n\n“I’ll remember,” Jungkook promised. He dropped his gaze to the floor when he met the eyes of the receptionist and she smiled knowingly at him. “Thanks for - following me, I guess.” \n\n \n\nTaehyung nodded. “I can be nice, you know?” \n\n \n\nJungkook had still to actually see that, honestly, but he tried not to make it so obvious that he didn’t believe Taehyung’s words. “See you on Thursday, then,” he said, pressing the elevator button. \n\n \n\nCocking his head to the side, Taehyung pursed his lips. “What makes you think this means you’re exempted from coffee runs, baby?” \n\n \n\nOh no. Oh no, abort mission. Jungkook was not prepared for pet names, much less pet names like that, because Taehyung was too close again, sweet-smelling bubblegum clogging up his brain. When did Taehyung think it was a good idea to go from delivery boy to baby. “Uh,” Jungkook uttered, brain short-circuiting. “I - uh - s-see you tomorrow?” \n\n \n\nAs if the pet name wasn’t enough, Taehyung leaned down and pressed a small, lipgloss-sticky kiss to to Jungkook’s cheek just as the elevator dinged to signalize it’s arrival. Jungkook was pretty sure his whole face was red as he spluttered out a goodbye, and hurriedly made his way into the elevator. \n\n \n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n \n \n\nJungkook tapped his fingers against the counter, eyes stuck on the clock on the wall. It was slowly but surely moving towards six o’ clock, and Jungkook wasn’t sure how he felt about knowing that Kim Taehyung would very soon pick him up from his cousin’s tattoo parlor. He tried telling Taehyung - through a series of awkward messages - that it might be better for them to meet at the cinema, but Taehyung insisted on picking Jungkook up after work. Jungkook might also have told Jimin that someone was coming to bring him on a date, and maybe he had left out the part where this was technically a job. It would be easier if the two of them didn’t have to pretend in front of both their families, obviously, but Jungkook imagined he would have troubles explaining to Jimin just why he had agreed to take on a job like this. \n\n \n\nHell, he had trouble justifying it for himself. \n\n \n\nEvery time the bell over the door chimed Jungkook would feel his heart stutter and every time it wasn’t Taehyung he would be just a little bit disappointed. Which was silly, because he shouldn’t exactly expect Taehyung to be early. \n\n \n\nAt exactly 6:01 PM however, the door to the tattoo parlor opened, and Jungkook was about to say a practiced “we’re closed for the evening,” until he saw that it was Taehyung. He was dressed in tight-hugging dark jeans and a silky shirt that looked just a little too big on him. The platform boots on his feet were ridiculously tall and Jungkook wondered if he’d have to invest in shoe-lifts if he was going to be able to walk anywhere in Taehyung’s company without feeling really short. \n\n \n\nSuddenly he realized how Jimin felt most of the time. \n\n \n\n“Hey,” Taehyung greeted, walking over to the counter. Somehow, without the suit and atmosphere of the workplace he seemed a little more… approachable. “Wasn’t aware you worked at a tattoo parlor.” \n\n \n\n“Really?” Jungkook voiced. “The tattoos didn’t give it away?” \n\n \n\nTaehyung shrugged. “Of course not. Even I have a tattoo.” \n\n \n\n“You’re kidding,” Jungkook deadpanned. For a hot moment he imagined intricate ink swirling around Taehyung’s tan skin and then he mentally scolded himself because wow, Jeon Jungkook, way to be creepy. \n\n \n\n“Wish I was,” Taehyung snorted and leaned his body onto the counter. Pop. “Not that tattoos are bad, or whatever, but I got it when I was drunk, in college, and it’s - you know - it’s a tramp stamp.”\n\n \n\nJungkook lifted his eyebrows far beyond his hairline, and maybe he leaned just a little to the side and eyed Taehyung’s lower back, just to check if he could see a hint of it through the silky shirt, but the material of it wasn’t nearly sheer enough. “Really?” he said, because for some reason Jungkook just couldn’t believe it, “you have a lower back tattoo?” \n\n \n\n“Yes,” Taehyung confirmed again, and maybe he sounded a little annoyed. “What? Do I need to show you or something for you to believe me?” \n\n \n\nJungkook spluttered, and he was about to say no, absolutely not, when Jimin emerged from his studio. Taehyung whipped his head around, eyeing Jimin as he sent his customer out the door. The boy looked like he was crying, so Jungkook suspected he’d chickened out on the tattoo he was supposed to be getting. “Come back some other time, Seungcheol-ssi,” Jimin said with a kind smile, and the boy muttered something inaudible as he exited. “I swear,” Jimin sighed, “he seemed like he would be able to do it this ti - huh?” Jimin paused at the sight of Taehyung. “Who are you?” \n\n \n\nClearing his throat, Jungkook walked out from behind the counter. “Uh, this is Taehyung, who’s - uh - taking me out today. Taehyung, this is my cousin, Jimin.” Referring to Taehyung as just Taehyung was weird, but they had kind of agreed to at least speak informally to each other from the very beginning, just so they wouldn’t be awkward about it at the launch party. Through a simple ‘questionnaire’ over text Jungkook had learned that Taehyung was Jimin’s age - merely two years older than him - and Jungkook hated formal speech anyway. So, yeah, it was odd, but for some reason it felt more comfortable too. \n\n \n\n“Oh,” Jimin uttered, eyes widening as he looked Taehyung up and down. “Wow. Wow, Jeonggukie, what the fuck did you do to reel in someone like him?” \n\n \n\nJungkook groaned at his cousin’s words, feeling his cheeks heating up. This was too early in the night for him to be blushing already. \n\n \n\nMeanwhile Taehyung was positively beaming at the compliment, and Jungkook definitely wasn’t ready for Round Two of Kim Taehyung’s Brilliant Smile. It stretched across his whole face and made him look young and carefree and ugh, Jungkook could not deal with that right now. “That’s very nice of you to say, Jimin-ssi, but Jeonggukie is quite the catch himself, wouldn’t you agree?” \n\n \n\n“Okay,” Jungkook said, his voice embarrassingly high-pitched. “Let’s just leave, Taehyung.” \n\n \n\n“Sure, baby.” \n\n \n\nThey walked outside the tattoo parlor to the sound of Jimin cackling, but Jungkook could barely hear it with the ringing in his ears. He was just very bad with pet names, and maybe it was because he liked it a little too much, but Taehyung didn’t need to know that. \n\n \n\nTaehyung’s car was impressive without a doubt; sleek and in a matte black color, but Jungkook didn’t have time to check out the brand before Taehyung ushered him into the passenger seat. The interior was luxurious as well, and Jungkook felt like he shouldn’t even be sitting there. “I got us tickets to the new Marvel movie,” Taehyung said when they were both inside, “I don’t know if you like superheroes, but I do, and I’m paying, so.” \n\n \n\nI own Iron Man socks, Jungkook almost said, but he figured that information was not necessary. “Marvel movies are okay. I like superheroes, too.” \n\n \n\n“Ah, that’s good, then,” Taehyung said, and then he rolled out of the small parking space in front of Jimin’s tattoo parlor. \n\n \n\nThe beginning of the ride to the cinema was smooth and relatively silent, save for Taehyung asking a few questions about Jimin. Jungkook shared that Jimin was his only family in Seoul and that Jimin ran the parlor with a friend his age. “So you both came from Busan on your own then?” Taehyung asked. “Was it not that long ago that you came here? I mean - you guys don’t speak Seoul dialect.” \n\n \n\n“I just don’t care to,” Jungkook said. “I mean, your Seoul dialect sounds really forced, too.” \n\n \n\nTaehyung shot Jungkook a very small look. “Does it? Shit, I’ve been working on it. They don’t really take you seriously at job meetings with a heavy accent, you know.” \n\n \n\nJungkook didn’t know, because he had never been in a job where people cared about that. But he supposed the fashion industry was different that doing deliveries in that way; there was more to lose in terms of appearance, more behind it than just covering up your tattoos not to scare off older citizens. “Well, you don’t have to force it with me,” Jungkook found himself saying. “I mean - I don’t care.” \n\n \n\nTaehyung scoffed. “That’s sweet of you, but I’m trying to get used to it. I’ll have to put in an effort.” \n\n \n\n“Sounds tiring.” \n\n \n\n“It is,” Taehyung said. “But if I want to snatch the chief editor position from Min Yoongi I’ll have to work harder than anyone else.” \n\n \n\nJungkook thought it sounded weird, because he could have sworn Taehyung said his family owned the magazine. Wasn’t that the main reason how the rumor had spread and why Jungkook was going out on fake dates to collect evidence of him and Taehyung being a thing? \n\n \n\n“I thought you said your brother owns Bangtan Magazine?” he asked.\n\n \n\n“He does,” Taehyung confirmed. “But I’m still very young, and just giving me the position would show bias, obviously, since I’m family. Not like I’ve worked for this since forever.” He shook his head. “I get it, because Yoongi has technically worked at the Seoul branch longer. I’m just petty about it, and my brother knows, and he’s trying to comfort me about it but it isn’t actually working.” His lips formed into a pout and it looked like Taehyung was really sulking about this matter. “Sorry, this isn’t what we should be talking about.” \n\n \n\n“Yeah, I’m -” Jungkook cleared his throat, “I’m really bad at comforting people, too, so I don’t think we should.” \n\n \n\nIt was quiet after that, Taehyung merely turning on the radio for some background noise. Taehyung had apparently bought tickets at the biggest cinema in Yongsan, and while Jungkook agreed it was the best place to go it also meant Taehyung had to find parking space pretty far away. Jungkook was okay with walking, but honestly he couldn’t imagine Taehyung wanting to move too much in those shoes of his. \n\n \n\n“It’s okay, I’m very used to walking in heels,” Taehyung stated, as if it wasn’t obvious. \n\n \n\nJungkook only shrugged, sliding out of the car and closing the door behind him. Taehyung locked the car, shoved his keys in his pockets, and jogged up to Jungkook to grab his upper arm. “Wha -” Jungkook uttered, but Taehyung pulled up his phone and turned on the self-camera. “Really? In the parking lot?” \n\n \n\n“Why not?” Taehyung said. “My family knows me, which means they know how clingy I am in an actual relationship. And they are not going to believe we have been dating for even a month if I don’t show up with a camera roll completely filled with photos of you.” \n\n \n\nWhen Taehyung pressed a little closer and asked him to smile, Jungkook did just so, allowing himself to grin wide into the camera. Taehyung leaned down and snapped the photo of them both. “I thought your reputation was that you don’t do relationships,” Jungkook said, because he did remember Taehyung saying that was the case. \n\n \n\n“It’s not true,” Taehyung groaned. “I just haven’t been with anyone since I came to Seoul. I’ve focused too much on getting somewhere at work to think about dating, and maybe I have had a few one night stands and kind of refused to see it through after. You know, rejecting them. Harshly.” \n\n \n\n“Stone cold.” \n\n \n\n“I’m not,” Taehyung protested. “I am a very warm person.” \n\n \n\nAt that Jungkook couldn’t help but actually snort, and Taehyung stopped dead in his tracks to look down at him, disbelievingly. “I’m sorry,” Jungkook said, quickly, pulling them along to continue walking, “I just - you haven’t exactly given me good impressions of that you know?” Don’t get him wrong, Jungkook realized there was something underneath Taehyung’s prickly exterior, but there was also a reason why he was named Bubblegum Bitch on Jungkook’s contact list. \n\n \n\n“How come?” Taehyung said. “Have I been that terrible?” \n\n \n\n“Uhm.” Jungkook couldn’t really fathom that Taehyung was asking about this. “I mean, our first meetings were not fortunate. And I’m doing this for the money, not your personality.” \n\n \n\n“Ouch,” Taehyung grimaced. “I mean, I know you didn’t exactly like me, Jungkook, but that’s harsh.” \n\n \n\nJungkook shrugged, but maybe he felt bad because Taehyung’s voice seemed fainter, a little sad. “It’s the truth. But maybe we can change it, eventually.” \n\n \n\n“Right,” Taehyung scoffed. “Mission: Get Jungkook To Not Actively Hate Me set in motion.” \n\n \n\nI don’t hate you, Jungkook wanted to say, but something about Taehyung’s face told him it wouldn’t help much. Taehyung’s mouth was set in a deep frown, and he detached himself from Jungkook’s arm slowly. \n\n \n\nGood job, Jeon Jungkook. You really nailed that one. \n\n \n\nThe walk up to the cinema was far worse than the ride there, the silence now more uncomfortable without background music, and Jungkook couldn’t stop himself from grimacing thinking about what he’d said. It was stupid of him to assume saying stuff like that wouldn’t affect Taehyung, even if Taehyung acted the way he did. He supposed it was one way to find out that Taehyung was a bit sensitive, seeing the way he was actively shutting Jungkook out. \n\n \n\nThe quiet followed them all the way to the queue to get their snacks. The line was long, but it was a Marvel movie so Jungkook had expected there to be a lot of people. More people unfortunately also meant more judging stares, and Jungkook really should have expected that not everyone would be okay with the way Taehyung dressed. His tall height already gained attention, and once they saw the heels on his feet the attention usually turned into subtle, negative remarks. \n\n \n\nWhoever standing right behind them in the queue were not very subtle however, continuously making comments about how weird and freaky it was, and Jungkook - well, Jungkook had never had the best of patience with idiots. \n\n \n\nThey were just being so obvious, they were right behind them, but when Jungkook might have started contemplating turning around and giving them a piece of his mind, Taehyung lightly elbowed him. “It’s okay,” he said quickly, “don’t bother. Causing a scene doesn’t help.” \n\n \n\nJungkook frowned. “Okay. If you say so.” \n\n \n\nJungkook knew Taehyung was right however. He had encountered enough assholes in his life to know that making a fuss in public was never the way to go. Still, he wasn’t going to just let them be, so, as he slowly looped one arm around Taehyung’s hips - go Jeon, go! - he turned his head briefly around just to glare at the idiots. They were only teenagers, so knocking them out would have been bad anyway, but Jungkook felt a little better when they cowered under his gaze. \n\n \n\nAs Jungkook turned back around, Taehyung threw his arm over Jungkook’s shoulders and leaned down slightly. “How mature of you,” he mumbled, and Jungkook felt the tips of his ears turn red. \n\n \n\n“Shut up.”\n\n \n\nTaehyung looked like he forced back a smile. \"Okay. Thanks, anyway.\" \n\n \n\nJungkook grumbled a small reply his own mind couldn't even comprehend, he was too flustered.\n\n \n\nThey got their snacks, and while sitting down to wait for the doors to open, Taehyung took a few more pictures, indulging Jungkook in doing some funny faces every now and then, trying out possibly every filter he owned. He had thrown his legs over Jungkook’s, cradling their shared box of popcorn to his chest as he scrolled through his camera library and deleted a few of the blurry ones. \n\n \n\nHonestly, Jungkook thought it was weird, sitting here with Taehyung and having something as mundane as a movie date with him. Not that it was an actual date, not really, but then again it kind of felt like one, because they were here, together, and it wasn’t like they were pretending for any of Taehyung’s co-workers. \n\n \n\nWeird. \n\n \n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n \n \n\nfrom: bubblegum bitch you free after work on tuesday?\n\n \n\nto: bubblegum bitch only after seven? is that too late\n\n \n\nfrom: bubblegum bitch\n\n\n no, that’s okay, lotte world is open during the night too \n\n \n\nto: bubblegum bitch ?????? you wanna go to lotte world???????\n\n \n \n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n \n \n\nJungkook had not been to Lotte World since he first arrived in Seoul, when Jimin had taken him as a welcome to the big city-present. He learned quickly that Taehyung had never been there, and he had also never been on an amusement-park date; much less one that wasn’t really a date, but more like a getting to know each other so we dislike each other less and will be able to go through with this agreement-hangout. \n\n \n\nThe biggest change from the previous ‘date’ was clearly Taehyung’s attire. He was wearing jeans again, and a sweater Jungkook assumed was very expensive, but the fact that he was wearing sneakers was what threw Jungkook off. Without the designer heels they were about the same height, and Jungkook was really not used to being on Taehyung’s eye-level. “This is so weird,” he mumbled, measuring their height with his hand. “So weird.” \n\n \n\n“I thought heels in an amusement park would be a sure-fire way to tire me out completely,” Taehyung scoffed. “And I’m already quite drained from working, so it seemed like a good idea.” \n\n \n\n“Yeah - it’s definitely better to walk around in sneakers,” Jungkook agreed, “you look good either way.” \n\n \n\nJungkook obviously hadn’t meant to say that last part out loud, but he did anyway. Taehyung gave him a soft smile for it. \n\n \n\nThey bought matching rabbit-ear headbands to wear, so that their pictures would show that they had the full theme park date experience, and with a lot of dead time between rides while waiting in line, they managed to make civil conversation. The more they talked the more Jungkook realized Taehyung was kind of sweet, and while he had always been sure there was something behind the bitchy front he sure hadn’t expected to see it come out whenever they saw a kid running past them. Taehyung just hadn’t seemed like a person who adored kids, but it wasn’t hard to figure out he most certainly did, as Jungkook watched him coo over a toddler sitting next to them on their cotton candy break. \n\n \n\n“Aw, she’s so cute,” Taehyung voiced as the mother picked her little girl up. It was getting late, so it seemed like they were leaving the park before night hours. “I love kids.” \n\n \n\n“Yeah - I didn’t expect that.” \n\n \n\nTaehyung shrugged, taking a small bite of his cotton candy. “I could tell, but - well,” he looked at Jungkook, quickly, “now you know. My deep dark secret. Better not tell the tabloids.” \n\n \n\nJungkook pressed his lips together and scooted a little closer to Taehyung on the bench. “Sorry,” he said, “sorry if I - say things that make you feel bad. I just - I have this very bad picture of you in my head because we had a shitty first meeting, and I feel like you’ve - like you’ve taken advantage of me?” \n\n \n\n“Huh?” Taehyung uttered. “Why would you say that?” \n\n \n\nOh shit. Maybe this wasn’t making things better at all. “I just - I have a hard time saying no to you, and I might have felt like this whole fake-dating deal was made because you knew I would say yes for the money. I didn’t know about the thing with your family or anything, and - yeah, I don’t know why I’m still talking.” \n\n \n\n“So…” Taehyung narrowed his eyes. “You feel like I’ve been taking advantage of you because of your business? Am I understanding this right?” \n\n \n\nYeah, he was right. Jungkook didn’t know why it made him feel weird, because he had admitted to agreeing to this for the money. But he still felt like Taehyung had too tight of a grip around this deal - like he was calling all the shots. And fair enough - Taehyung was the one paying for everything, but Jungkook had been pushed around by Taehyung since the moment they met. “Yes,” Jungkook confirmed. “I mean, I get that it sounds weird, but -” \n\n \n\n“No,” Taehyung cut him off, “I can understand that. I’ve been kind of bossy.” \n\n \n\nKind of. Jungkook bit his tongue. “A little, maybe.”\n\n \n\n“Okay,” Taehyung nodded, “next date you decide. Everything.” \n\n \n\nJungkook frowned. “What?” \n\n \n\n“You heard me.” Taehyung stood up, made his way to the closest trashcan, and threw away what was left of melted sugar on the cotton candy stick. “Now - let’s go have fun, baby.” \n\n \n\n“No - wait!” Jungkook exclaimed, jumping up from his seat to run after Taehyung. One downside to him wearing sneakers was that he was now harder to keep up with. Jungkook followed him into line to one of the rollercoasters; Taehyung tugged him to his side and linked their arms together. “I don’t - why would you - where do you even want to go?” \n\n \n\nTaehyung shrugged. “Surprise me,” he said. “Half of the fun going on a date is not knowing what your boyfriend has planned, you know?” \n\n \n\nJungkook didn’t know. He was also very confused, because he was certain Taehyung had said the only reason they were going around having ‘dates’ was because they needed picture proof. “But we’re - we’re not really dating?” \n\n \n\nTaehyung sighed deeply, dramatically, a deep furrow appearing between his brows. “Listen, Jungkook - you need to stop thinking this much. I’m going to make this very simple for your pretty head so that this whole ordeal will be all the better for both of us.” \n\n \n\n“Uh -” \n\n \n\n“From now, until the launch party, we are dating. All you have to do is treat me like I’m your boyfriend, and everything will be fine.” He smiled, but it was condescending in a way. “Don’t think too much about it, and just… think of it as actual courting. Stop reminding yourself that it’s fake all the time, because that’s just going to make the launch party awkward. We need to get to know each other like - like we actually want to date. Get it?” \n\n \n\nJungkook kind of got it, but he supposed his facial expression did not show that, because Taehyung sighed deeply again.\n\n \n\n“For example,” he stated, voicing every syllable, and then he cupped Jungkook’s face, leaned forward, and kissed him. Jungkook reeled back in shock, crashing into a high school boy standing behind them, but he couldn’t even utter an apology because Kim Taehyung pulled him back in. Chased after his lips. Kissed him again. \n\n \n\nTaehyung tasted of sugar.\n\n \n\nJungkook was partially frozen, because, well, he hadn’t expected that. A part of him was yelling do something you idiot, but before he could act on that Taehyung pulled away, smacked his shoulder and said, “as my boyfriend, you are supposed to kiss back, you imbecile,” clearly agitated. There was also a slight blush on his cheeks, which threw Jungkook off. \n\n \n\n“Oh. Oh, yeah, of course,” Jungkook mumbled, awkwardly. He met the eyes of someone else in the queue, who was gaping at the both of them. “Uhm - right. Let me just -”\n\n \n\nTaehyung groaned. “Do you have to be so painfully awkward doing everything?” he voiced, pulling away. “You lost it. The moment is gone. Man.” \n\n \n\n“Sorry,” Jungkook mumbled. “C-can I awkwardly hold your hand instead?” \n\n \n\nHe didn’t wait for Taehyung’s reply, just interlaced their fingers. \n\n \n\n“Good save,” Taehyung uttered. \n\n \n\nJungkook breathed in deep. “I’m sorry. I’ll really — I’ll try not to act this awkward from now on. I don’t — I don’t actually want us to be weird around each other. It would be horrible at the launch party thing.”\n\n \n\nTaehyung snorted. “Launch party thing,” he repeated shaking his head. “It’s okay, I don’t want that either. Let’s — let’s aim for civil? Not going at each others throats and also not being painfully awkward?” \n\n \n\nTaehyung smiled brighter than the sun, squeezed Jungkook’s hand a little.\n\n \n\n“Yeah,” Jungkook voiced, lips still tingling from the kiss, “civil.”\n\n \n \n\n.\n\n \n \n\n.\n\n \n \n\n.\n\n \n \n \n\nDespite what Taehyung had said, Jungkook was not the one to organize the next date. Taehyung spontaneously planned their outings before Jungkook managed to even think about where to bring him. It made him a little nervous, because he felt like Taehyung was expecting something, and Jungkook had no idea what to do not to disappoint. \n\n \n\nJungkook did try to act little less awkward around Taehyung however. He made sure to initiate holding Taehyung’s hand whenever they walked the streets together, and even if they hadn’t kissed since the amusement park date, Jungkook felt like it was getting somewhere. They were hanging out, asking questions about each other, and whatever hostility that had been between them was slowly dimming. It was a lot more comfortable just sitting next to Taehyung, holding his hand and taking sickeningly cute pictures together. \n\n \n\n“Okay, so — question,” Taehyung said through a mouthful of churros. It was Thursday afternoon, and Taehyung had dragged Jungkook to this quaint little café-slash-flower shop in Yongsan. It was cozy, quiet, and Taehyung looked painstakingly beautiful surrounded by colorful plants. Sigh. \n\n \n\n“Bring it.” \n\n \n\nTaehyung licked his fingers free of sugar. “I read your webpage more thoroughly after you told me you don’t only do deliveries. So — what’s the weirdest job you’ve gotten?” \n\n \n\n“Gotten?” Jungkook said. “Or done?” \n\n \n\nTaehyung’s eyebrows raised to his hairline, and suddenly his eyes were glittering with interest. “Done. Definitely done.” \n\n \n\nJungkook had done a lot of stuff — things he never imagined doing — but he knew what the weirdest thing was. He knew Taehyung was probably going to laugh, too, but - go big or go home. “Well — I was a stripper, once. For a bachelorette party.” \n\n \n\nTaehyung’s mouth dropped. “No? For real?” \n\n \n\nNodding his head, Jungkook took a tentative sip of his coffee. It wasn’t a job he liked thinking about often (unless he was very drunk), but he’d taken it before Jiwoo started filtering through weird requests and he was really desperate for money. Jimin liked reminding him about his dark past on the pole, even if there was never a pole involved and Jungkook only did it once. \n\n \n\n“Yeah, for real.” \n\n \n\nTaehyung looked like he really did not believe it. “I mean — isn’t that kind of… illegal?” \n\n \n\nShrug. Jungkook wasn’t entirely sure, actually, but he didn’t really see why it should have been. His client had been very upfront about what they wanted and Jungkook had just showed up to… deliver. “I mean, I don’t remember a lot of it because I was trying to just dance and get it over with —” \n\n \n\n“You danced.” \n\n \n\n“Yeah. Lapdance. Sexy dance. Magic Mike style.” Jungkook grimaced. “Not my proudest moment.” \n\n \n\nJungkook didn’t miss the way Taehyung’s eyes seemed to trail over his body for a moment. “Huh. Did you dress up, too?” \n\n \n\n“Yep.” Jungkook frowned. “Police uniform. Didn't stay on long.” \n\n \n\n“Oh my God.” Taehyung leaned over the table, resting his chin in his hands and staring at Jungkook with interest. “Were your clients happy with your performance? All like ‘oh yeah handcuff me, officer’?” Taehyung grinned wickedly. “You good at dancing sensually and taking your clothes off, baby?”\n\n \n\nJungkook tried to hide the fact that the stupid nickname was affecting him, bringing his almost-empty cup of coffee to his lips. “Wouldn’t you like to know.” \n\n \n\nTaehyung didn’t answer to the last statement (Jungkook hadn’t expected him to, either), but Jungkook could feel the piercing gaze the older was giving him. \n\n \n\n“Hm.” Taehyung leaned back in his seat, grin slowly sliding off his face. “I think — as understanding as my parents and brother are, we shouldn’t mention that to them at the launch party. Like — that’s more of an ice breaker during a boring Christmas gathering, not fitted for somewhere with paparazzi and stuff.” \n\n \n\nWell, Jungkook hadn’t exactly planned on telling Taehyung’s parents what he was working with at all. The thought of them asking, ‘so what do you do, kid,’ sent a small chill down his spine, which was a little silly because he wasn’t even Taehyung’s real boyfriend. But, somehow, Jungkook imagined Taehyung’s parents not being very happy with him dating a delivery boy. “I mean — that was not the first thing I had planned on sharing with them,” Jungkook said, slowly. “Should we even say what my job is? I mean — I just,” he hesitated, “I haven’t even gone to college.” \n\n \n\nTaehyung waved it off, like it was no big deal. “Neither did my father, but he’s still considered a genius in the fashion industry. It’s just a different time, and honestly the fact that you don’t go to school doesn’t make you any less valid. Or at least it shouldn’t.” Shrugging his shoulders, Taehyung gave Jungkook a small, reassuring smile that made Jungkook’s insides all warm. “Don’t worry, Jungkook. With me having dated mostly male models, I’m sure my parents wouldn’t mind me bringing someone with a bit more life experience.” \n\n \n\nMale models. Jungkook gulped. “You’ve dated models?” \n\n \n\n“Mhm, quite a few.” Taehyung snorted. “They all get tired of me real fast. Guess I’m not that easy for them to handle.” \n\n \n\n“Maybe you just have bad taste.” \n\n \n\nTaehyung lifted one eyebrow. “Referring to yourself?” \n\n \n\nScoffing, Jungkook leaned a little back in his chair. “I’m a catch.” \n\n \n\n“I’m downgrading from male models to a delivery boy,” Taehyung pointed out, lips quirking into a smile. Jungkook knew he wasn’t serious, but he still pursed his lips a little at Taehyung’s words. “So far the only thing you have in common with all my previous boyfriends is that you’re just as much of an asshole.” \n\n \n\n“Excuse you,” Jungkook said, a little offended, “but I am a delight behind all this awkwardness.” \n\n \n\nThrowing his head back, Taehyung laughed, loudly, and the sound itself made Jungkook grin. He couldn’t even stop it from happening; Taehyung’s laugh was oddly carefree and childish, so far from the person he'd met at studio three a few weeks ago. It made Jungkook unexplainably happy seeing him loosen up. \n\n \n\n“I was serious, though,” Taehyung said when he had finally stopped laughing, drying away a fake tear. “My parents won’t mind that you’re not like my previous boyfriends. If anything that might make them more interested in you, honestly. But don’t worry — I’ll make sure we don’t have to talk to them that much.” He smiled again, in that reassuring way, and Jungkook was sure his breath hitched. \n\n \n\n No, Jungkook. Don’t.  \n\n \n\n“Hey — I,” Jungkook cleared his throat, suddenly feeling like he couldn't leave fast enough, “I might have some work later today, so could we get going? This was nice and all, but —” \n\n \n\n“Oh. Oh, yeah, sure,” Taehyung said, hurrying to gather his things. “I was going to send you the photos we took today, but I guess that can wait?” \n\n \n\nJungkook blinked. “Oh. Why?” \n\n \n\n“Just,” Taehyung started, hesitating, “it would be more believable if we both had pictures of each other? Just put one of them as your screensaver or something, for the time being.” \n\n \n\nIt probably wasn’t necessary for them to play it out to this extent, but Jungkook wasn’t going to say anything against it. “Yeah okay — send them to me now, then, I’ll go use the bathroom in the meantime.” He gave Taehyung a short smile and the practically fled to the bathroom, blood ringing in his ears. His heart was beating wildly as he shut the door to one of the small stalls behind him. \n\n \n\nStop. Jesus Christ, Jeon Jungkook, get a grip. \n\n \n\nIt was one thing that Taehyung was attractive — that much was known, and Jungkook couldn’t say anything against it. Taehyung was gorgeous, but thankfully he had seemed to have a sort of shitty personality. Jungkook wasn’t expecting Taehyung to be a little bit soft underneath that bitchy exterior. His smile made Jungkook feel all warm and gooey inside and fuck, this was not good. \n\n \n\nJungkook didn’t actually use the bathroom, but he spent a good ten minutes just staring at himself in the mirror, trying to calm himself down. This wasn’t the end of the world, he tried to tell himself. It was just a tiny, tiny crush. He’d been infatuated with Taehyung before this deal even started, starstruck by his appearance alone, so honestly this development shouldn’t surprise him. No matter how untimely it was. \n\n \n\n“Sorry that took a while,” Jungkook said when he returned, trying not to make it obvious he’d been splashing water in his own face. “I’m — are you ready to leave?” \n\n \n\n“Yep,” Taehyung said, curtly. “Sent you all the photos, too.” \n\n \n\nThe slight shift in the mood didn’t go unnoticed by Jungkook. He considered asking if something was wrong, but Taehyung was already heading towards the exit, and Jungkook barely managed to get all his stuff — including the phone he almost left on their table — before following. “H-hey, Taehyu —” \n\n \n\n“How about you manage the next date, baby?” Taehyung said suddenly, still not looking in Jungkook’s direction. The way he said the pet name gave Jungkook the creeps. “We already talked about it, but you haven’t exactly taken initiative.” \n\n \n\n“N-no, I — I mean, I can… do that?” \n\n \n\nTaehyung turned then, finally, and gave Jungkook a small smile. \n\n \n\n Ba-bump. \n\n \n\n“Good. I’ll look forward to it.” \n\n \n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n \n\nThat night Jungkook anxiously googled “where to take your rich, high-maintenance boyfriend on a date”. \n\n \n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n \n \n\nTurns out, Jungkook had no idea exactly what sort of date Taehyung would like. He had been panicking about it the entire night, and so when he arrived at Jimin’s tattoo parlor the next morning without any plan his inner turmoil might have been very obvious. At least that’s what he assumed, because Heeyeon stopped dead in her tracks when she saw him and said, “wow, you look like shit.” \n\n \n\n“More than usual?” Jungkook asked. \n\n \n\nShe nodded. \n\n \n\nPalming his face in his hands, Jungkook let out a long groan. “I have no idea what to do. Noona - what do I do?” \n\n \n\n“‘Bout what?” she asked, quirking one perfect eyebrow. \n\n \n\n“About -” Jungkook paused, remembering the talk he and Taehyung had at Lotte World, how he’d said Jungkook should just treat their fake relationship as a real one until the launch party. Jungkook was still coming to terms with it, but this was as good of a time as any to test it out. Before his small crush, this was a job, and Jungkook might as well get some money with the heartbreak. “About my boyfriend,” he continued, feeling the flush on his cheeks already. “I have no idea where to take him on a date.” \n\n \n\n“Boyfriend?” Jimin stuck his head out from his studio. “Your sorry ass got a boyfriend?” \n\n \n\n“Thanks for the vote of confidence, hyung,” Jungkook drawled. “Y-yes. I guess. You a-already met him.” \n\n \n\nJimin’s mouth dropped open, and he pointed an accusing finger in Jungkook’s direction. “You’re joking? The hot guy in the designer heels is your boyfriend?” He shared a look with Heeyeon. “Seriously, Heeyeon-ah, you didn’t see him. He had like - perfect face, perfect proportions, great legs -” Jimin shook his head, as if he really couldn’t believe it. Jungkook would be offended, but he was pretty sure he wouldn’t have been able to get someone like Kim Taehyung to date him under normal circumstances. “Anyway, he’s hot. And really pretty, like - how did you get that much game, Jeon Jungkook?” \n\n \n\nJungkook shrugged, because he honestly didn’t know how to answer that question. He knew he wasn’t a bad-looking guy by anyone’s standards, but Taehyung prowled in male models and superstars. Jungkook couldn’t live up to that. “Anyway - I need to take him on a date. But I have no idea where he would like to go.” \n\n \n\n“He didn’t give you a hint?” Jimin asked. \n\n \n\n“I don’t know,” Jungkook frowned. “He’s hard to read.” \n\n \n\nThere was Kim Taehyung, bubblegum bitch, who bossed Jungkook around and stepped all over him in his limited edition Valentinos; and then there was just Taehyung, the guy who spoke in a forced Seoul accent, cooed over children, laughed with his whole body and blushed after kissing Jungkook in the line to the rollercoaster. Jungkook was becoming well-aware Taehyung was a mix of both hard ambition and a warm heart, and it confused him how much he liked it. \n\n \n\n“Just bring him out with us today,” Jimin said, like it was no big deal. “We’re going to Hongdae to drink, it’ll be fun if we have someone new with us. Hyerin is joining as well.” \n\n \n\nA part of Jungkook screamed that it was a bad idea. Why would Kim Taehyung be happy hanging out with Jungkook and his friends for a date, just walking around Hongdae, getting food and drinks and staying out all night? But then again Taehyung had said treat me like you would treat anyone you are dating, and Jungkook always brought potential boyfriends to meet his friends. Usually not this early, but it would be good practice for the launch party. \n\n \n\nBefore he could change his mind, Jungkook grabbed his phone and texted Taehyung. \n\n \n\n to:  bubblegum bitch \n\n\nhey, let’s go out tonight. i’m going out with my friends and my cousin that you met last time. \n\n \n\n from:  bubblegum bitch \n\n\nis that your idea of a date, baby?\n\n \n\n to:  bubblegum bitch \n\n\nit’s good practice for the launch party\n\n \n\n from:  bubblegum bitch \n\n\ni see. when? \n\n \n\nJungkook felt like he had made a mistake, but he quickly typed 9PM, i’ll tell you where later, and closed the screen on his phone. At least no he didn’t have to think too much about it for a few hours, and could focus on work. \n\n \n\nOr that’s what he told himself, but instead he was all the more aware of the fact that Taehyung was coming to drink with them in Hongdae, Taehyung had agreed to do so, and now Jungkook was even more nervous. Just hanging out with Taehyung and getting to know him was one thing, but now they actually had to act like a couple. \n\n \n\nSo, maybe Jungkook realized what a bad fucking idea it was when he stood outside Hongdae station, exit 3, waiting for Taehyung to show up. He had left the restaurant they had picked out to pick Taehyung up - because Taehyung was a little late and honestly Jungkook could understand that looking that good would take time - and it had given Jungkook time to think. Think about everything Taehyung had said that he liked, what he usually did in a relationship, and compared it to himself. Jungkook hadn’t had terribly many boyfriends, but he had introduced them all to Jimin at one point, and Jimin always made fun of it because Jungkook was apparently a fool in love. \n\n \n\nJungkook wasn’t exactly sure what that meant, but Taehyung had called him idiot enough times for Jungkook to realize there must be a pattern. All Jungkook had to do was act stupidly in love, right? He could do that. He was an extra at his middle school’s play once. Ladybug number five. He got this. \n\n \n\n“Hey!” \n\n \n\nTaehyung was suddenly there, looking a little out of breath. He was wearing a white sweater with plenty of holes down the sides on it - probably fashion purposes, damned if Jungkook knew - and a pair of nice, light jeans. The stilettos on his feel were gold, with a thin heel and sequins. “Sorry I’m late, the subway was delayed as well.” \n\n \n\nJungkook was going to ask you took the subway? but instead he pulled Taehyung in by the waist, leaned up and planted a kiss to his cheek. Taehyung looked baffled, black-lined eyes widening at Jungkook’s open display of affection. “Look at you,” Taehyung voiced, cocking his head to the side as he threw his arms over Jungkook’s shoulders. “You’re learning.” \n\n \n\n“Don’t know what you’re talking about,” Jungkook said. “I’m just greeting my boyfriend.” \n\n \n\nThe look Taehyung gave him clearly said good job, but he didn’t say anything about it, rather leaned down to peck Jungkook’s lips, quickly. “Hello, baby.” \n\n \n\nJungkook made a small sound in the back of his throat, immediately avoiding Taehyung’s eyes. “Can you not call me that?” \n\n \n\n“Why?” Taehyung asked, smirking. “Don’t you like it?” \n\n \n\n“No,” Jungkook lied, immediately, blush rising to his cheeks. It probably wasn’t good for him, how much he blushed in the presence of Taehyung. “I mean - no, I like it, it’s just -” \n\n \n\n“Like it a bit too much, do ya?” Taehyung asked, grinning widely, and the mix of him not forcing his accent and throwing that smile in Jungkook’s direction was just… too much. He groaned, and pushing his face into Taehyung’s shoulder, the holes in his sweater placed conveniently enough so that his lips pressed against bare skin. “Come on baby,” Taehyung crooned, voice low, “it’s cute how much it affects you, you know?” \n\n \n\nCute. Jungkook gritted his teeth through the embarrassment. “Shut up, Tae.” \n\n \n\nTaehyung grinned even wider. “Now that’s better. Let’s go!” \n\n \n\nJungkook willed his flaming face to cool down and started leading Taehyung through the bustling crowd of Hongdae’s streets. They held hands the whole way, Jungkook looking over his shoulder now and then to meet Taehyung’s eyes, but they walked in silence. It wasn’t uncomfortable however, because Taehyung’s hand was warm in his and Jungkook - Jungkook already had high hopes for tonight. Being with his cousin meant they had to act fully in love, and that meant Jungkook had an excuse to act on his crush for the evening. \n\n \n\nIt was something. \n\n \n\nJimin and the others had decided on a quiet bar, located in the cellar under a few cheaper shops. It sold about every soju flavor possible and had really good food as well, and Jungkook was pretty sure they’d been here at least three times just the past month. Taehyung walked down the steep stairs before him, still holding onto Jungkook’s hand for support. Jungkook told the waiter approaching them that they already had a table, and they were let inside. \n\n \n\nHonestly, as soon as Hyerin was involved it was difficult not to find their little group in a crowd. Heeyeon and Jimin already stood out with their kind-of intimidating appearances, but Hyerin was loud. She worked as a tour bus guide while finishing her journalism degree, and was just accustomed to screaming about sixty percent of everything she said. She was in the middle of a dramatic monologue when he and Taehyung found their seats at the table - Jimin had moved out of his seat and made them squeeze into the booth together - and even the arrival of Taehyung couldn’t shut her up. \n\n \n\n“Hey! Taehyung, right? Nice to meet you,” Hyerin said quickly, “anyway, as I was saying -” \n\n \n\nJungkook couldn’t help but snort at Taehyung’s baffled expression. “Is she always this high-energy?” he asked, and Jungkook nodded. “Impressive.” \n\n \n\n“You met Jimin already,” Jungkook said, motioning towards his cousin. “And that’s Heeyeon, the co-owner of the tattoo parlor.” \n\n \n\n“Good to meet you,” Heeyeon grinned, winking at Taehyung, “I’ve heard lots about you.” \n\n \n\n“Have you, now?” Taehyung voiced, glancing in Jungkook’s direction. \n\n \n\n“You have?” Jungkook asked, just as surprised. \n\n \n\nHeeyeon pointed in Jimin’s direction with her thumb. “He met you for like ten seconds and wouldn’t shut up about it.” \n\n \n\n“It was a meaningful meeting,” Jimin said. Hyerin seemed to have finally finished her dramatic tour bus story, and was drinking from a large pint of beer that was probably meant to be shared. Everyone’s full attention was now on Taehyung — and Jungkook — and Jimin was leaning over the table, head resting in his hands. “You know, Taehyung-ssi — Jungkook is awfully boring. I’m sure the two of us could have a lot more fun together.” \n\n \n\nJungkook blinked at the sultry look Jimin was giving Taehyung. “Are you — are you flirting with my boyfriend, hyung —” \n\n \n\n(He almost stuttered over that word; boyfriend. Almost.)\n\n \n\n“I’m giving him a chance to back out on a possible life filled with your nerdy ass and vanilla sex,” Jimin grinned, cocking his head to the side innocently. Jungkook wasn’t entirely sure how to reply to an insult like that, not when Taehyung was right there. Especially not when Jimin’s words made him imagine waking up to Taehyung in the morning. Abort. “I mean — Jungkook is plenty attractive and all, but damn. Everything kind of pales in comparison to Taehyung.” \n\n \n\n“Though I appreciate your concern, Jimin, as well as the compliment,” Taehyung started — Jungkook could hear the amusement in his voice — “I’m more than happy with my boring ass vanilla man, thanks.” \n\n \n\n“Tae—” Jungkook’s voice go cut off as Taehyung latched onto him like cling-wrap, arms wrapping around Jungkook’s midsection and nuzzling into his neck. His breath hitched, barely, as Taehyung’s arms squeezed around him, and his glossy lips pressed a kiss right under Jungkook’s ear. Jungkook took a deep breath before allowing himself to turn his head, and then Taehyung was staring right at him, eyes warm and smile bright, and Jungkook let himself forget that this was not real. \n\n \n\nHe leaned forward, slightly, and barely brushed his lips against Taehyung’s. “Thanks, babe,” he said, relishing in Taehyung’s eyes widening briefly at the public display of affection. Jungkook supposed he didn’t have any expectations of Jungkook actually initiating any intimacy. Hah. \n\n \n\nTaehyung caught himself quickly, however, grinning wide. “Give me a kiss,” he said, puckering his lips up, and Jungkook leaned forward to press his mouth against Taehyung’s before he could think too much and possibly regret it. Taehyung had probably intended for it to be a quick peck, but as he moved away Jungkook pulled him in again, angling his head and deepening the kiss. \n\n \n\nThe kiss in the queue to the rollercoaster hadn’t been like this. This time Jungkook had taken initiative, because he wasn’t going to upset Taehyung by having a slow reaction again. The kiss was soft, warm, and Taehyung pressed his lips against Jungkook’s just right, fingers playing with the short hairs in the nape of his neck. It was just very… pleasant, to the point where Jungkook thought he wouldn’t mind doing it again. Or continue doing it for the rest of the night, at least. Or maybe for another year. \n\n \n\n(Stop, a voice reminded him.)\n\n \n\n“Ugh,” Jimin complained noisily from the other side of the table, and Jungkook barely opened one eye to look at him without breaking the kiss. “You guys are gross.” \n\n \n\n“I would say I’m sorry, hyung,” Jungkook voiced, barely pulling away from Taehyung’s lips; kissing him was kind of addictive. “But not really.” \n\n \n\nTaehyung laughed, pressing a loud peck to Jungkook’s cheek.\n\n \n\nIt felt so natural, to the point where Jungkook had no idea why he had been the slightest bit nervous about acting like he was in love with Taehyung. Taehyung… he he made it easy, which was weird, because it shouldn’t be easy pretending you’re in love with someone you kind of used to dislike. \n\n \n\nThough Jungkook was pretty sure he really didn’t dislike Taehyung anymore. \n\n \n\nTaehyung was actually kind of great. \n\n \n\nYou’re crushing on him so hard, a voice that sounded eerily much like Jiwoo’s told him, in a disappointed tone. Jungkook shrugged it off. He could deal with his own bad decisions without the conscience of his co-worker whispering at the back of his head.\n\n \n\n“Can you guys stop being cute for like, five seconds so we can order?” Heeyeon commented, sweet smile on her burgundy lips. \n\n \n\n“We’re still going to be cute,” Taehyung grinned, keeping his arm around Jungkook’s waist. “But I’m also starving, and I haven’t had really greasy chicken in so long.” \n\n \n\nThey ordered enough chicken and beer to keep them satisfied for the whole night, probably, and the food arrived and conversations flowed naturally, Jungkook thought less about trying to convince his cousin him and Taehyung were actually a thing and more about having fun. Sure, the kiss was a burning reminder on his lips still after two shots of soju, and he was blissfully aware of Taehyung touching him at all times, but it’s not like he was nervous anymore. Not at all — they could totally fool Taehyung’s family at that fancy gala, or whatever. \n\n \n\n“So you work for Bangtan Magazine?” Heeyeon said, mouth slightly open in surprise. “I read you guys’ articles all the time. I loved the photoshoot that was on your New Years’ edition last year, man — it was so beautiful I shed a tear.” \n\n \n\nTaehyung looked immensely proud. “Thank you! It was my idea, actually —”\n\n \n\n“Shut up,” Heeyeon hissed. “Damn, you’re great. I love you. I’ll subscribe to you magazine. Please break up with Jungkook so I can have you instead.” \n\n \n\nJungkook frowned, tightening his arms around Taehyung. “What is this? Steal-Jungkook’s-hot-boyfriend-day?” \n\n \n\n“I can’t help it that I’m popular, baby.” Taehyung winked, chewing around a piece of spicy chicken. “But we already established that I’m not going anywhere, so don’t you worry too much. Have something more to drink, instead —” \n\n \n\nJungkook grunted as Jimin shoved a bottle of beer towards him. “No thanks,” he said, shaking his head. “I might have deliveries tomorrow, so I can’t really be too hungover. Or, you know, still drunk.” Of course, it was a little rude to decline drinks since he was the youngest, but Jungkook valued being able to drive everywhere for his morning deliveries. He would rather not want to rely on public transport. \n\n \n\n“Ugh, buzzkill.” Jimin rolled his eyes. “You can handle another beer, Jeon. You’re from Busan, it’s in your blood.” \n\n \n\nSighing in defeat, Jungkook grabbed for the bottle, but Taehyung’s hand shot out and took it instead. “I’ll just drink for him, Jimin,” he grinned, pressing the bottle to his lips. He peered up at Jungkook, giving him a quite sultry look through his eyelashes. “I’ll be your Black Knight*, Jeon Jungkook. So I guess that means you’re mine for the rest of the evening.” \n\n \n\n“That works, I guess,” Jungkook mumbled, ignoring Jimin’s loud wolf-whistle. “If it’s okay, I mean. How’s your tolerance?” \n\n \n\n“Pretty shit,” Taehyung laughed. \n\n \n\nIt did turn out Taehyung’s tolerance was pretty shit, and Jungkook could clearly tell when Taehyung tipped the line from tipsy to pretty intoxicated. Jungkook did not really mind, because as Jimin and Heeyeon and Hyerin started talking about a second round at the nearest karaoke place, they had an excuse to leave. Jungkook could easily drape Taehyung’s arm over his shoulder and lead him out of the chicken place. With his arm around Taehyung’s waist, Jungkook supported his fake boyfriend down the streets of Hongdae once again, hand systematically placed over one of the holes in Taehyung’s flimsy shirt. Great. \n\n \n\nTaehyung wasn’t really loud drunk. He said some weird things — and cute things — but mostly it seemed he just got sleepy. \n\n \n\n“Sure you guys don’t want to join us?” Jimin asked as they finally hailed down a cab. “I mean — I was planning on wooing Taehyung with my singing abilities, but here you are dragging him away from having a good time! I cannot believe you would foil my plan like this, Jeon Jungkook. We’re supposed to be family.” It was all for fun, obviously, but Jungkook couldn’t help but roll his eyes.\n\n \n\nTaehyung laughed at Jimin’s comment; Jungkook helped him get into the awaiting cab, making sure he didn’t hit his head on the way in. “He gets tired when he’s drunk,” Jungkook said as excuse, giving Jimin a small grin. “I’m sure you’ll meet again, you can try woo him next time, Jimin-hyung. We’ll leave first — you guys have a nice time!” \n\n \n\n“Bye!” Taehyung said from inside the cab; Hyerin and Heeyeon chorused his goodbye and waved at him with drunken smiles on their flushed faces. Jungkook followed Taehyung into the car, sliding into the seat next to him and closing the door behind him. \n\n \n\n“Where are you going?” the cab driver asked them once they settled. \n\n \n\n“I live too far away,” Taehyung mumbled, falling onto Jungkook’s shoulder. They didn’t need to sit close, there was no reason for them to act lovey dovey in front of a stranger, but Taehyung still clung to Jungkook’s side, like gum. “I’m your Black Knight, baby, so you still owe me. Let’s just go to your place, yeah?” \n\n \n\nJungkook gulped, mind envisioning all possible outcomes of this situation. Most of them included very little clothes. “Yeah, okay,” he uttered, telling the taxi driver his address. Then he leaned back into the seat and stared into the roof of the car, asking whatever higher being was up there for strength. \n\n \n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n*Black Knight(/Black Rose): Someone who volunteers to take a drink for another person, and in return the person they drink for is theirs for the rest of the evening (or owes them a wish). \n \n\ncome scream to me on tumblr\n\n \n\n“Nice place you have here. Cute.” \n\n \n\nTaehyung looked around the tiny apartment from where he was sitting by Jungkook’s dining table nursing a cup of chamomile tea. Jungkook assumed Taehyung and his family had enough money to live in a mansion, so he was pretty sure the older was just making fun of him. “Sorry. It’s a little messy, I wasn’t really expecting company.” \n\n \n\n“It’s okay, I’m the one who is intruding,” Taehyung said, though he did not sound particularly apologetic about the fact. He took a loud sip of the tea, and even though he still looked a little bit flushed and drunk he didn’t seem it. He’d kicked off his heels by the entrance, the gold-sequin designer shoes looking very out of place next to Jungkook’s many pairs of Timberlands. Still, Taehyung looked surprisingly comfortable in Jungkook’s bachelor pad, and Jungkook would say the sight of Taehyung sipping tea in his kitchen wasn’t… unwelcome. \n\n \n\n(He’d love to get used to the sight.)\n\n \n\n“I’ll just crash on your couch for the night, then,” Taehyung said, resting his head in his hands. He looked very kid-like, cheeks cutely smushed up and small smile on his lips. “May I borrow something to sleep in?” \n\n \n\n“Uh — yeah,” Jungkook stuttered. “But — but it’s probably better if you stay in my room, honestly, since I’m probably going out tomorrow morning for deliveries. So I wouldn’t want to wake you up or anything, and — I’ll go get you something to change into.” His voice grew more quiet the more he spoke, because honestly Jungkook wasn’t completely grasping the situation. “You can — you can come with, if you want to.” \n\n \n\nTaehyung hummed, took another small sip of his tea, and then followed Jungkook into his bedroom. If you told Jungkook about two weeks ago that Kim Taehyung would ever be in his bedroom, he would have thought you were crazy. Not that Jungkook minded having Taehyung in his bedroom — that was a completely different discourse — but he wouldn’t have thought it possible. \n\n \n\n“Nice. I like your G-Dragon poster,” Taehyung commented as Jungkook stepped over a small pile of clothes to get to his closet. Taehyung didn’t seem to mind the small mess, or at least he made no move to snidely mention it, which Jungkook appreciated. That, or Taehyung was still too drunk to notice. \n\n \n\nJungkook threw one of his many white t-shirts in Taehyung’s general direction. “Do you want some sweatpants, too?” he asked, turning around to look at Taehyung over his shoulder. His breath got stuck in his throat when Taehyung proceed to simply pull his own sweater over his head. \n\n \n\n“It’s okay, I’ll just sleep in my underwear,” Taehyung said. Jungkook was long lost staring at Taehyung’s exposed skin like some creep, but could you blame him? He was so flawless, body slim and tummy surprisingly soft-looking, and he had a navel piercing. It glinted under the dim light before he pulled Jungkook’s oversized sweater over his head. If Taehyung could just have bothered to turn around so Jungkook could check if he was serious about the tattoo as well —\n\n \n\n“Oh, this is very comfortable,” Taehyung hummed. The t-shirt reached him mid-thigh, but honestly thats how big they were on Jungkook, too, so it wasn’t all that surprising. This visual however was at least three of Jungkook’s sexual fantasies in one, and he was not sure how long he could manage standing here, just watching. “Thanks, baby,” Taehyung said, pulling Jungkook out of his perverted daze. \n\n \n\n ‘Get a grip, Jeon.’  \n\n \n\n“No problem,” Jungkook said, voice strained. ‘Yes problem. Yes very much growing problem.’ “Uhm — the bathroom is over there, if you want to wash up. I’m afraid I don’t have an extra toothbrush or anything, but — but you c-can borrow —” he gulped as Taehyung advanced towards him, smile on his face just a little bit wicked, “— toothpaste,” Jungkook finished weakly. \n\n \n\nTaehyung leaned in, and then he pecked Jungkook’s cheek, and giggled. He giggled. \n\n \n\n“Thank you, baby.” Taehyung slowly wrapped his arms around Jungkook’s neck and pressed their foreheads together, and Jungkook took a deep breath at the close proximity.\n\n \n\nTaehyung still smelled like bubblegum. \n\n \n\n“I’ll let you wash up,” Jungkook mumbled. “Uhm — I might accidentally wake you up tomorrow morning, but I’ll try to be quiet —” \n\n \n\n“Sleep in the bed with me, Jeon Jungkook.” Taehyung was smiling, and he threaded his fingers through Jungkook’s messy hair. “It’s your place, and if you’re leaving early tomorrow morning, so should I.” \n\n \n\nJungkook closed his eyes as Taehyung pecked his nose, and then his cheeks, and his lips. “This is so weird,” Jungkook mumbled, carefully cupping Taehyung’s face; he smushed Taehyung’s soft cheeks together, feeling how warm his skin was thanks to the alcohol. “You’re so nice. And also very drunk. Why can’t you be this nice to me all the time, we’d get along so well, then.” \n\n \n\nTaehyung laughed, leaning against Jungkook’s frame. “You want me to be nice and kiss you all the time, Jeon Jungkook?” \n\n \n\n“Yes.” \n\n \n\nIt was kind of embarrassing, how fast he replied. It brought an even bigger smile to Taehyung’s face. “Well, sober Taehyung will definitely work on that,” he said, and Jungkook knew he was for sure blushing down to his neck. “I’m really sleepy, baby.” \n\n \n\n“O-okay,” Jungkook stuttered, and Taehyung effectively pulled him onto the mattress; Taehyung snuggling into his blankets was the cutest fucking thing Jungkook had ever seen, and he barely managed to school his expression before sliding in under the covers with his… fake-boyfriend. Fake-boyfriends were really, really not supposed to share beds, yet here they were. \n\n \n\nThey laid face to face, just staring at each other, for what felt like the longest time. Taehyung looked so soft, so far away from the person Jungkook had saved as bubblegum bitch in his phone those weeks ago. He looked like he belonged there, in Jungkook’s springy bed. \n\n \n\n“It’s so fun hanging out with you,” Taehyung mumbled, face partially smushed into Jungkook’s pillow. “You don’t care.” \n\n \n\nJungkook frowned. “What do you mean?” I care about you. \n\n \n\n“You don’t care what I wear,” Taehyung started, “you said I look nice in everything. And you don’t care that I eat a lot of sugar and junk food. You probably don’t care that I’ve neglected my diet, or that my Seoul dialect is horrible.” He smiled, tiredly. “It’s nice.” \n\n \n\n“Yeah?” Jungkook cleared his throat as Taehyung moved a little closer to him. “That’s — I’m glad — what are you d-doing?” \n\n \n\n“I’m a cuddler,” Taehyung grinned. \n\n \n\n“I’m not,” Jungkook whispered back. \n\n \n\n“Too bad,” Taehyung said, and hugged Jungkook tight. \n\n \n \n\n.\n\n \n\n.\n\n \n \nfrom: tae babe thanks for letting me stay over really\n\nthank you, i had a great time \n\n \n\n.\n\n \n\n.\n\n \n \n\n“Morning.” \n\n \n\nIt was the week of The Party, four days away from doomsday, and Jungkook felt just a little weird entering Taehyung’s office. He had sent Taehyung a message last night with the bold promise of I’ll show up every morning this week as your boyfriend, not a delivery boy, so don’t bother Jiwoo anymore with emails. Taehyung had sent a lovely cluster of heart emojis, and Jungkook’s own heart stupidly stuttered. \n\n \n\nBecause of fucking emojis. \n\n \n\nBoy, this was getting out of hand, and at this point Jungkook wasn’t sure how he was going to feel about not seeing Taehyung again after Friday. That was the deal after all, and Taehyung hadn’t said anything about change of plans. \n\n \n\n“Oh, hey baby!” \n\n \n\nThe cheerful tone in Taehyung’s voice made Jungkook realize something was amiss. His eyes had only zoned in on his fake boyfriend behind his desk, so he hadn’t realized someone else was in the room; a tall man dressed in a silken shirt, bright trousers and an extravagant fur coat. His hair was a pretty shade of blondish pink, and his features positively striking. \n\n \n\n“Is this a bad time?” Jungkook asked, slowly, staying close to the door. \n\n \n\n“No, no, absolutely not!” Taehyung smiled, but there was a slight, distinct panic in his eyes. “This is my brother, Seokjin. He just returned from his Milan trip!” \n\n \n\nOh.  \n\n \n\nOh shit. \n\n \n\n“Oh!” Jungkook exclaimed. Holy shit what was he supposed to say? \n\n \n\nMake Taehyung proud, you nitwit, his brain helpfully supplied. \n\n \n\n“Lovely to meet you, Seokjin. It’s a pleasure. I’m Taehyung’s boyfriend, Jeon Jungkook,” Jungkook said, a little too quickly, but at least he didn’t stutter. He hurriedly placed the coffee on Taehyung’s table, wiped his hand on his pants and held it out for Taehyung’s brother to take. Seokjin’s smile was Colgate-commercial worthy. \n\n \n\n“What a sweet boy,” he crooned, and instead of taking Jungkook’s hand, Seokjin leaned in and kissed both his cheeks in greeting. Jungkook was a little stunned. “Aw, you’re definitely Taetae’s type! So cute! You did well on this one, little brother.” \n\n \n\nUh. Jungkook wasn’t sure what to say at that. He looked over his shoulder to Taehyung, whose face was a bright pink. “Yeah,” Taehyung said, looking up to meet Jungkook’s eyes. “Jungkook is pretty great.” \n\n \n\nBa-bump. \n\n \n\n“Mh, he seems very nice,” Seokjin said, devious smile on his face. “Well — I do need to get to a meeting, it’s the only reason I’m here at this godforsaken hour, so I suppose I should leave you two alone. I believe we will see each other again this Friday, Jeon Jungkook? We’ll talk a lot more then.” The way he stared straight at Jungkook was a little unnerving, even if there was a smile on his face. Seokjin was officially more intimidating than Taehyung had ever been. \n\n \n\nJungkook gulped. “Y-yes, sir. S-see you on Friday, sir.” \n\n \n\nSeokjin winked. “Ciao.” \n\n \n\nWhen Seokjin closed the door behind him, Taehyung let out a long sigh of relief, slumping back in his chair. “Holy shit,” he whispered after an excruciating minute. “We did it. I think we fooled him.” \n\n \n\n“Why are we whispering?” \n\n \n\n“He could still be listening. Actually —” Taehyung hurriedly stood up from his seat and made his way towards Jungkook at an incredible speed; he threw his arms around Jungkook’s shoulders, putting his whole weight on the younger and leaning down until their mouths were nearly touching. “Kiss me.” \n\n \n\nWhy, Jungkook should have asked, and a week ago he would have. He was sure Taehyung only wanted Jungkook to kiss him because Seokjin might come back, but Jungkook didn’t care. He just wanted an excuse to kiss Taehyung, and if Taehyung was presenting him with one Jungkook wasn’t going to back down. He’d thought about it ever since Taehyung slept over. \n\n \n\nTaehyung's lips were just as soft as Jungkook remembered, sugary and sweet and addictive. He wasted no time pressing against the older, cupping Taehyung's face in his hands tilting his head for a better angle. Taehyung audibly sighed against his mouth. Maybe that was supposed to a sign of yeah, okay, that's good for now delivery boy, but Jungkook had no plans on stopping at that, even if their kisses up until now had been mostly innocent. He hadn't been reliving his embarrassing wet dreams from his teenage years the whole weekend to stop at a few pecks, no sir. If Kim Seokjin walked back through those doors within the next five minutes he was going to actually interrupt something. \n\n \n\nJungkook rubbed his thumbs over Taehyung's soft cheeks, tilted his head and pried Taehyung's lips open with his tongue; he received minimal resistance, Taehyung's tall height practically melting over him at the action. Taehyung responded eagerly, warm mouth and tongue moving skillfully over Jungkook's own, hands fretting over Jungkook's shoulders, chest and nape, as if he didn't know where he wanted to touch first.\n\n \n\nThey only realized they were moving when the back of Taehyung’s thighs hit his office desk, and Jungkook wasted no time hoisting his fake-boyfriend onto the surface of the table. Taehyung let out a small squeak of surprise, breaking away from Jungkook's lips. \"This is an expensive desk, Jeon Jungkook, I'd rather we didn't -\" \n\n \n\nParting Taehyung's long legs, Jungkook stepped between them and wrapped his arms around Taehyung's midsection. The words died on Taehyung's lips immediately. \"I - uh, Jungkook -\"\n\n \n\n\"Less talking, more making out,\" Jungkook whispered, pressing his mouth to the column of Taehyung's throat this time. \"I've wanted to kiss you again since we went out with Jimin and the others — fuck, you’re hot.” Jungkook probably shouldn’t have admitted to that, but, oh well.\n\n \n\n\"Really?\" Taehyung breathed, fingers curling into Jungkook's hair. \"This is quite a new side of you, baby, I haven't seen you like this b-before - oh.\" He sucked in a deep breath as Jungkook pressed wet kisses under his ear. \"I like it. I like it a lot.\" \n\n \n\n\"You do?\" Jungkook voiced, pulling away to meet Taehyung's eyes; they were dark with intent and his lips were red and spit-slicked. \"I thought -\" Jungkook rubbed a thumb over Taehyung's lips, bit his own bottom lip when Taehyung's tongue peeked out to lick at it, \"- you would like being - in control?\" \n\n \n\n\"In any other situation except the bedroom, yes,\" Taehyung replied, cocking his head to the side with a mockingly innocent-looking smile. \"So - you going to kiss me again, baby?\" \n\n \n\nJeongguk nodded enthusiastically, diving in for another kiss with a grin on his face, voice at the back of his head playfully telling him it seemed like Seokjin wasn't coming back. That they were alone in Taehyung's office, making out, and he was between Taehyung's legs. Not to mention the fact that Taehyung seemed to want this just as much as Jungkook did, and that possibility had Jungkook a little dizzy. \n\n \n\nEventually, it wasn't Kim Seokjin that forced them to pull apart and get back to reality, but rather a phone call from an angry-sounding Jiwoo reminding Jungkook of his next job. At that point Taehyung seemed like he was trying to pull Jungkook's shirt off, so honestly it was just shitty timing. Or fantastic timing, considering the fact that this was not a part of their agreement and could very well turn everything on its head. But Jungkook did groan loudly in protest as his ringtone blasted through Taehyung's minimalistic office. \n\n \n\n\"Yeah, yeah, I'm on my way,\" Jungkook told Jiwoo, even though he still had Taehyung's hand under his shirt and glossy lips on his throat. \"I'll be there in time, no worry.\" \n\n \n\n\"Don't screw it up,\" Jiwoo grunted before hanging up. \n\n \n\nJungkook sighed, regretfully stepping away from between Taehyung's legs. He immediately missed the heat of the older's body, but - he had work to do. As much as he liked being in Taehyung’s presence he had a job, and they had been scarily scarce recently. \"Sorry,\" he mumbled, as Taehyung let out a small sound of protest, hands grabbing after Jungkook. \"I really need to go, I have more work today than expected. Jiwoo's keeping me busy.\" \n\n \n\nTaehyung huffed, leaning back on his hands. He looked ridiculously good where he was sitting on his own desk with his thighs spread apart and lips bitten red and hair mussed up. It was positively a crime leaving him. \"Hm, well, I'm busy too.\" \n\n \n\n\"Yeah. Well,\" Jungkook hesitated, straightening his shirt and pulling a hand through his hair. He wasn't sure how presentable he looked at the moment. \"Did you,\" Jungkook lowered his voice, \"did you think your brother would come back? Uh — is that why you let me kiss you like that?”\n\n \n\nTaehyung's whole face turned red, and suddenly he was looking away, avoiding Jungkook’s eyes actively. “Uh — yeah, of course,” he said, but his whole body language told Jungkook he was lying. Jungkook didn’t mention anything about it, however. He wasn’t sure if he was reading this all wrong. “You should get going, then, delivery boy.” \n\n \n\nDelivery boy. The sudden change of nicknames was a little baffling, because Taehyung had called him baby for days now. Did he do something wrong? Oh, dear, Taehyung was regretting it, wasn’t he? Was he creating distance between them on purpose? Fuck, did Jungkook fuck up? Or was Taehyung just teasing him? Jungkook couldn’t tell.\n\n \n\nTaehyung didn’t seem to notice that Jungkook was panicking, having hopped down from the desk and seated himself in his office chair. “Hey — I’ll stop by your place tomorrow after work,” he said, still not looking in Jungkook’s direction. “I got you a suit for the launch party.” \n\n \n\n“Y-you did?” \n\n \n\n“Mhm.” Taehyung nodded. “It’s supposed to show up tomorrow morning, but I’ll probably need to make adjustments to it, so I need your measurements. Are you free?” \n\n \n\n“Uh — yeah.” \n\n \n\n“Good.” Finally, he looked up and met Jungkook’s eyes, face a mask of nonchalance, like they hadn’t just been heavily making out. Like they hadn’t gotten much closer this week. Fuck. “I’ll see you tomorrow. Bye.” \n\n \n\nJungkook’s mouth was suddenly very dry. “Bye.” His voice cracked a little. \n\n \n\nShit. \n\n \n \n\n.\n\n \n\n.\n\n \n \n \n\nThe last time Taehyung had been to his place he had been slightly buzzed, happy and clingy. When Taehyung knocked on Jungkook’s door the following Tuesday, he was very much in work mode, and Jungkook was hit with the dread of holy shit we really fucked up. Jungkook knew they had been moving in the right direction, with the teasing and kissing and civil conversations, but suddenly it was like they were back at square one. \n\n \n\nExcept instead of always being mildly annoyed by Taehyung, Jungkook looked at him and felt all warm inside. \n\n \n\nAn inconvenient development, truly. \n\n \n\n“Isn’t it a little too much? You —” Jungkook paused as Taehyung put the clothes bag on his couch with the utmost care, “you shouldn’t have gotten me a suit.” \n\n \n\n“Consider it repayment for having had to hang out with me for three weeks,” Taehyung said dismissively. He zipped the bag open. “It’s nothing all too fancy, so don’t worry. You can pull of a simple suit with your good looks. Besides — ” he looked over his shoulder briefly, sent Jungkook a small wink, “I still need to be the best-looking. The attention needs to be on me at all times.” \n\n \n\n“Everyone’s attention is always on you,” Jungkook said, because honestly he couldn’t imagine Taehyung walking into a room and not having all eyes on him. \n\n \n\nTaehyung hummed. “Yours, too?” \n\n \n\n“Of course.” \n\n \n\nTaehyung stood up straight and looked at Jungkook a little too seriously. He had taken his heels off by the front door and was only a tiny centimeter taller than Jungkook now. “You answered that too fast for someone who’s only my fake boyfriend, delivery boy,” Taehyung said, frowning. \n\n \n\nOw. That stings. \n\n \n\n“You — you’re the one who told met treat this as a real relationship, Tae — Taehyung.” Jungkook cleared his throat. If Taehyung wasn’t using nicknames and pet names anymore, then Jungkook shouldn’t either, right? “You’re sending mixed signals, suddenly. The deal isn’t over until after the launch party, right?” \n\n \n\nWhy was he rambling all of a sudden? It wasn’t like Jungkook to let his mouth run, but Taehyung’s behavior was bothering him more than he’d like to admit. “You’re paying me to act like your boyfriend, and you’re telling me to really commit, but when I do you suddenly start acting weird —” \n\n \n\n“I — you —” spluttering, Taehyung hurriedly avoided Jungkook’s eyes, “I asked you to act as my boyfriend around people, not to make out with me to that extent —” \n\n \n\n“You’re the one who asked me to do that too, though.” \n\n \n\nMaybe Jungkook hadn’t protested to making out with him, but Taehyung had definitely asked first. Taehyung couldn’t exactly say Jungkook was at fault in this situation, not when he so clearly remembered the older whispering “kiss me” into his ear. \n\n \n\n“I — I didn’t —” \n\n \n\n“You did.” \n\n \n\nPressing his lips into a tight line, Taehyung crossed his arms over his chest and turned away from Jungkook. “Whatever. Just — just get undressed, and try on the suit. I’m busy, I don’t have the whole day to do this, especially not if I have to get it fitted for you.” \n\n \n\n“You said you liked it,” Jungkook mumbled, not letting it go, because Taehyung’s mood swings were annoying him at this point. He’d said he enjoyed it when Jungkook had taken control of their kiss, told him to do it again, but now he was acting like he’d never wanted it to happen. Jungkook called bullshit. If anything, he had a feeling Taehyung was a little attracted to him physically. There had to be a reason for his sudden hostility, at least. “If you regret it that much,” Jungkook continued, “then okay. Now we know where to draw the line.” \n\n \n\nNot really okay. Jungkook had liked the idea of Taehyung enjoying kissing him. It gave him a little hope. \n\n \n\nHope for… a little more. \n\n \n\nWhich was stupid, because in what world would someone as beautiful and successful as Taehyung actually date a delivery boy with tattoos and no college education? He was wondering if it was even a good idea to introduce him to Taehyung’s family. Even if it was just for show Jungkook wasn’t really someone who fit into their world. \n\n \n\nYeah, it was probably for the better that him and Taehyung weren’t really dating. \n\n \n\n“Whatever,” Jungkook mumbled, moving to pull his sweater over his head. If Taehyung was going to be an asshole about this, then the faster they got this over with, the better. It was probably for the best, anyway — Jungkook’s stupid developing feelings were going to get in the way after the launch party if Taehyung said he wanted more. Jungkook was probably just reading into the situation too much; Taehyung had certainly just been caught up in the moment, right? \n\n \n\nYeah, probably. \n\n \n\n“I just —” Jungkook continued, discarding his sweater to the floor, “— you shouldn’t have asked me to treat this as a real relationship if you were not able to handle it. That’s all. You’re just making this annoyingly awkward.” \n\n \n\nTaehyung’s lips were pressed into a tight line as Jungkook turned to look at him, his ears read and jaw clenched. Jungkook had probably said something wrong, as usual; he certainly wouldn’t put it past himself. Not that Jungkook wanted to anger Taehyung in any way — not now, when he was slowly coming to terms with his fucking feelings — but perhaps it was for the better. They were toeing over the line, and Jungkook was aware that he himself would not be able to get over Taehyung quickly if this… affair of theirs got a little more passionate. \n\n \n\n“I’m making this awkward?” Taehyung hissed through gritted teeth. He approached Jungkook, narrowed his eyes and jabbed a manicured finger into Jungkook’s very naked chest. “Need I remind you that I was the one who had to take initiative for you to even consider holding my hand? You’re the very definition of awkward! Your fucking picture is next to the word in the fucking dictionary!” \n\n \n\n“Exactly,” Jungkook seethed right back, already tired of Taehyung’s excuses and insults. He was getting a little too defensive for Jungkook’s taste. “You wanted this, you told me to act like we were really in a relationship, so honestly I do not understand why you are upset with me when you’re just continuously contradicting your own words. You’re the one paying for this whole ordeal, so tell me — what the fuck do you want?” \n\n \n\nIn an ideal scenario, Taehyung would have said ‘you’ and then proceed to grab Jungkook’s face and kiss him silly. Jungkook knew he was a bit of a romantic, and maybe he let himself hope, because Taehyung turning around with a huff hurt a little more than he’d expected. “Forget it. I was caught off guard by how passionate you were, and it was confusing me,” Taehyung said, quickly. “It would just be a real bother if you really started to like me, is all. Wouldn’t want that to happen. Just — let’s just stick to holding hands and hugging. That’s enough for the public.” \n\n \n\nBoom. There is was. The remainder of Jungkook’s hope — why had he let himself hope? — dwindled. He hurriedly schooled his (probably crestfallen) expression in case Taehyung decided to turn to look at him again. \n\n \n\nDon’t let him know, don’t let him know, don’t let him know. \n\n \n\n“You flatter yourself,” Jungkook voiced. “I have better standards than that.” \n\n \n\nTaehyung snorted, not even looking away from what he was doing. He’d brought a big handbag with him, and was pulling out a long measuring band and a notepad. “Yeah, okay. You seemed plenty eager when making out with me, though. It’s understandable that I’d come to that conclusion.” \n\n \n\n“You’re the one who said you liked it, so what does that make you?” Taehyung’s shoulders tensed, and he didn’t reply; Jungkook was sure there was something else going on, but Taehyung was too stubborn to admit it and Jungkook had no energy left. He was tired and his heart was a little broken. “Whatever. What do you want me to say? You’re attractive, you know that. Maybe if you’d dress up that personality of yours as well as you make yourself pretty every morning, boyfriends would stop leaving you.” \n\n \n\nAt that, Taehyung finally turned around. “You’re an asshole.” \n\n \n\n Yeah. That was an asshole thing to say. \n\n \n\n“And you’re still a bitch.” \n\n \n\nScoffing, Taehyung rolled his eyes. “Right. Bubblegum bitch. That’s what you called me, wasn’t it? On your phone?” \n\n \n\nJungkook frowned, genuinely surprised Taehyung knew about that. Yes, Jungkook named him that after their first meetings, but he hadn’t referred to him with that name to anyone else. “How’d you know that?” \n\n \n\n“That day, in the café,” Taehyung started, crossing his arms over his chest. “I sent the photos we’d taken via message and you left your phone on the table when you went to the bathroom. I happened to see the name you’d saved my number under. Thanks for that, Jeon.” \n\n \n\n“It was a joke,” Jungkook found himself saying, “don’t take it seriously.” \n\n \n\n“You still mean it,” Taehyung seethed. “Just say it, whatever you want. You’re a bitch, and that’s all there is too you under those clothes. Too bad you were given that face when you can’t make anyone like you. Well, at least you’re rich, Kim Taehyung.” Taehyung’s voice grew angrier as he spoke, and — to Jungkook’s horror — his eyes grew glassy as well. “Come on, say it. I’ve heard all of it before, Jungkook! You’re not even my real fucking boyfriend, you’re not allowed to hurt me!” \n\n \n\nJungkook wanted to comfort Taehyung, he really did, but at this point he just seemed angry and it didn’t seem like he wanted Jungkook anywhere near him. Jungkook wasn’t sure what he was supposed to say. “Just — let’s just get this over with, Taehyung.” \n\n \n\nYeah, okay. Probably not that. \n\n \n\nFuck you, Taehyung muttered under his breath, rubbing his eyes with the back of his hand. Jungkook wasn’t really grasping the situation, but he realized he must have really hurt Taehyung if he was on the verge of really crying. He felt like garbage, and his heart was screaming at him to move forward and engulf Taehyung into a hug and make it all better. \n\n \n\nBut his mind was tactfully reminding him to stay away. That this would make it easier for him on Friday. \n\n \n\nSo as Taehyung dried his tears and started getting to work on actually measuring Jungkook, Jungkook kept quiet. He stood as still as possible, listening to Taehyung’s directions as he told Jungkook to lift his arms, straighten his back and the like. It was a short process, one that probably wouldn’t have been painful at all if they had just kept their mouths shut to begin with. \n\n \n\nWell, Jungkook thought as Taehyung left his apartment, fuming, that went horribly. \n\n \n \n\n.\n\n \n\n.\n\n \n \nto: tae babe i already changed your name on my phone it hasn’t been like that since we went out with jimin\n \nfrom: tae babe you changed it to something worse?  to: tae babe no\njust taehyung \n\nfrom: tae babe\n\n\n okay, don’t care \n\n \n \n\n . \n\n \n\n . \n\n \n \n \n\nThe launch party was quickly approaching, and Jungkook could feel himself dreading it more than he’d ever done when he woke up on Friday morning. It hit him, that after today — after the party — he’d have no reason to step into Bangtan Magazine’s offices with Taehyung’s vanilla soy latte. There would be no reason for them to meet up and take cute pictures, hug and kiss. \n\n \n\nFuck. \n\n \n\nJungkook had stopped by the offices yesterday to pick up the suit on Taehyung’s request, perfectly tailored. According to Taehyung he didn’t have to alter it much, his ‘genius’ having been able to pretty much determine Jungkook’s size. Jungkook would say he was impressed, but it was just a suit. A nice one, probably expensive, but it would look bland next to Taehyung anyway. \n\n \n\nWhich was probably a good thing, because Taehyung mentioned there would be paparazzi at this event, and even celebrities. He supposed Taehyung’s family was technically celebrities in their own field, but Jungkook had been shaking ever since Taehyung mentioned how IU went to their runway show once. \n\n \n\nTaehyung had been right, however — he did look very good in the suit. It wasn’t something extravagant, but then again that wasn’t really Jungkook, either. He prided himself in being able to pull of a simple outfit, and the tie brought a little more pizzazz to the black. It had a slightly familiar pattern, reminding Jungkook of Taehyung’s intricate suits, and Taehyung had off-handedly mentioned that Jungkook’s tie would match his own jacket. “Because we’re a couple,” he’d said, monotonously. \n\n \n\nWell, they were supposed to be a couple, but with how things had been between them these past days Jungkook wasn’t sure they would be able to bring it to the Actual Show. He told himself it was now or never, because he wouldn’t have a chance at being close to his (very unfortunate) crush again. The launch party was his excuse to indulge in the fantasy of dating Taehyung a little longer, but with how upset Taehyung was at him right now Jungkook wasn’t sure if he dared. \n\n \n\nHe hadn’t even dared going to Bangtan Magazine to give him his coffee this morning. He’d chickened out at the bottom of the elevator, pushed the vanilla soy latte into Min Yoongi’s hands and quickly excused himself. \n\n \n\nSorry I wasn’t there to give you coffee, I had work at Jimin’s, Jungkook sent via message as excuse, and it wasn’t technically a lie. He did have work at Jimin’s, but he’d had time to give Taehyung his coffee yesterday morning and picked up the suit while doing so, so Taehyung probably knew he was bullshitting. \n\n \n\nHe didn’t get a reply anyway. \n\n \n\nIt was less than an hour before the launch party even started that Taehyung finally contacted Jungkook, telling him “you better be ready” and “I’m picking you up in five minutes”. Jungkook was ready, having struggled with his tie for almost fifteen minutes and another twenty getting his hair presentable. Jimin said he looked ready to rock (sigh) and gave him thumbs up, but Jimin didn’t work for a fashion magazine. For all Jungkook knew he looked like a walking disaster. \n\n \n\nTaehyung arrived down the road to Jungkook’s neighborhood in his fancy-ass car, car sticking out like a sore thumb. \n\n \n\n\"Hey,\" Jungkook said as he carefully slid into the car. Taehyung had given him these pointy-toes shiny shoes to wear as well, and he had been scared to even put them on. Pair that with the suit, tie and Taehyung's fancy vehicle, and you had a Jeon Jungkook on the edge. \n\n \n\n\"Hey,\" Taehyung replied, eyes scanning over Jungkook. He was dressed in a deep purple suit, the jacket embroidered with floral patterns matching the ones on Jungkook's tie. His pants were one color, a slightly darker purple, slim fit all the way down to his legs, where - \n\n \n\nJungkook frowned. Taehyung wasn't wearing heels. He was wearing a similar pair of dress shoes to Jungkook’s instead, and Jungkook’s first thought was that it looked odd. There was no polish on his nails, either, he had simple rings in his ears, and he was wearing a minimal amount of makeup. No gloss, no eyeliner, no glitter on his cheeks. \"Why - why are you dressed like that?\" Jungkook asked, genuinely worried. \"Why do you look like that, Taehyung?\" The only times Taehyung had worn flat shoes around him was when they had planned on walking over a longer period of time. Taehyung loved his heels, and he made sure to tell Jungkook how expensive they were every time they met. Why the hell was he wearing a pair of simple formal shoes at an event like this? \n\n \n\n\"Look like what?\" Taehyung asked, rolling his expensive car back onto the main road. He stared straight ahead, jaw set. \n\n \n\n\"You - you look so... not you?\" \n\n \n\nTaehyung gave him a brief look. Pressed his lips into a line. He was chewing gum, at least; the sugary smell in the car assured Jungkook this was still the same Kim Taehyung. \n\n \n\n\"It's easier this way,\" Taehyung eventually said.\n\n \n\n\"What... do you mean?\" Jungkook asked, slowly. \n\n \n\nTaehyung shook his head. ”You know people judge. You've seen it yourself when we have been hanging out together,\" Taehyung started, frown on his lips. Jungkook briefly remembered judging stares and snide remarks, but he also remembered Taehyung not acting bothered by it at all. \"Not even the fashion industry is that accepting yet. My family doesn't mind how I dress, not at all, but the world does. They wrote lots of articles about me last time I showed up at a public event in heels and full makeup, I'd rather not have my brother's launch party ruined because of that.\"\n\n \n\n\"That...\" Jungkook paused. It didn’t sound right. \"Okay. If you say so.”\n\n \n\n“I’m not — I would wear my usual stuff, but it’s… it’s Seokjin’s party, not mine, I don’t want to take the focus off him. As much as I’m saying I want all the attention on me —” \n\n \n\n“I get that, but —” Jungkook paused, tried finding the right words, “shouldn’t you wear what you want, still? Like — shouldn’t you be happy what you wear all the time?” \n\n \n\nTaehyung spluttered. “Y-yes, but — ugh, just, don’t argue with me on this one, Jungkook. I’m — I don’t have time to change —” \n\n \n\n“Would your brother care?” Jungkook cut him off. “If you showed up wearing your heels and makeup?” \n\n \n\n“You’re being insufferable.” \n\n \n\n“I’m just asking.” \n\n \n\nTaehyung barely looked away from the road to give Jungkook a small glare. Then he pouted. “No, he wouldn’t,” he finally said, voice barely above whisper. “I don’t think. I just — people are going to ask enough with me bringing you there, I wouldn’t want you getting unwanted attention either, and — I just thought it was for the best, okay? There will be reporters and representatives from other magazines and I’m just… nervous.” \n\n \n\nTaehyung did actually look a little nervous where he was sitting, staring straight onto the road with his bottom lip between his teeth; Jungkook was hit with the sudden urge to comfort.  He tryingly patted Taehyung’s shoulder. “Hey — sorry if it seemed like I was pressuring you. You should do what you want, obviously. It’s not anyone else’s decision but yours.” Taehyung briefly glanced at him, lips pursed. “If you feel comfortable going to the launch party like this I’m not stopping you. I was just trying to understand why, okay?” \n\n \n\nSighing, Taehyung suddenly switched lanes, driving onto the intersection leading towards Gangnam. Jungkook was pretty sure that was not where the launch party was to be (Taehyung had mentioned it was held around Dongdaemun, in the fashion district). “Well then, you persuasive little shit,” Taehyung muttered as he gripped the steering wheel tight, “I sure hope you’re ready to wait for another hour. We’re gonna me late.” \n\n \n\n“Fashionably late?” \n\n \n\nTaehyung glared. “Too late.” \n\n \n\nTaehyung drove them to an apartment complex in Apgujeon, a district Jungkook hardly went to, much less imagined hanging around in. It was definitely in the wealthiest part of Gangnam; Jungkook felt himself shrinking in his seat as Taehyung drove into the parking house the gigantic building he called home. \n\n \n\nWith little time, Taehyung ushered Jungkook out of the car as soon as they’d parked and towards the elevators. Jungkook watched in awe as Taehyung pressed the penthouse button and leaned back agains the mirrors, checking his wrist for the time. “We can just aim for making it to the runway show, and Seokjin’s showcase,” Taehyung said. “The mingling in the beginning isn’t the important, anyway, though I’m sure my brother will give me hell for it.” \n\n \n\n“He’ll understand, probably,” Jungkook said, “just say we got caught up.” \n\n \n\n“Caught up,” Taehyung repeated, sarcastically. “And what, exactly, would we be caught up in, baby?” \n\n \n\n“Exactly what you’d expect, Tae,” Jungkook grunted, crossing his arms over his chest. He tried avoiding Taehyung’s eyes, but their gazes met in the elevator’s mirror. Taehyung quirked one brow at him. “What?” Jungkook spluttered. “You honestly think your brother doesn’t expect you to have sex?” \n\n \n\nTaehyung let out a mocking gasp. “Oh my, such crude words, my darling!” he exclaimed, bringing a hand to his chest. “Whatever happened to my pure boyfriend? My boring vanilla man?” \n\n \n\nPure. Jungkook snorted. He knew Taehyung was teasing him, so he couldn’t really be mad; not when the light banter was a welcome change from how hostile they’d been to each other lately. “You wouldn’t be saying that if we were really dating, Mr. Fashion Editor.” \n\n \n\n“Hm,” Taehyung hummed as the elevator dinged open, signalizing their arrival on the penthouse floor. “I can believe that.” \n\n \n\nJungkook didn’t want to think too much about what that meant. \n\n \n \n \n\n.\n\n \n\n.\n\n \n \n \n\n“You’re not allowed to laugh.” \n\n \n\nJungkook looked up from his phone screen as Taehyung stuck his head into the walk-in closet. He looked a bit more like himself already, with the shimmer on his cheeks and eyes rimmed with glittery eyeshadow. Taehyung had already been running around in his room for 40 minutes, mumbling curses — mostly directed at Jungkook — while searching through his belongings. Jungkook had never even seen a closet that big and fancy, much less that amount of clothing, but Taehyung seemed to know where everything was. It even had a small leather couch (Taehyung had placed him there with a small glass of expensive-looking wine and told him to “be good”) as well as a minibar. In other words; Jungkook could have lived there. \n\n \n\n(But he was done living in a closet, obviously.)\n\n \n\n“Why would I laugh?” Jungkook asked, taking a sip of the wine. He wasn’t really a wine person, but this particular one was good. It probably also cost more than his entire monthly salary. \n\n \n\n“Just — I don’t know, you might not like it. Not that it matters, I think I’ll wear it anyway. Unless you think it’s too weird —” \n\n \n\n“I’m sure you look great.” \n\n \n\nTaehyung snorted. “Of course I look great, I always do.” \n\n \n\n“Then what’s the hold up? You said we were late.” \n\n \n\nTaehyung grimaced, sighed, and then stepped out. \n\n \n\nNow, Jungkook would like to say he was a strong man in the face of beautiful men, but he’d lost the battle with Kim Taehyung as soon as they met. When Taehyung came into full view Jungkook actually choked, which was fucking pathetic, but could you blame him? Taehyung was dressed in this thin-looking, cream-colored silk shirt that seemed to constantly want to slip off both his shoulders at the same time; his wide-legged pants were sat high on his hips and had large splits on the sides, all the way up to his thigh, so when Taehyung shifted the weight on his feet and moved his leg out, all Jungkook could see was golden tan skin. On his feet were the tallest pair of heels Jungkook had ever seen him wear — probably closer to fifteen centimeters — and Jungkook knew he would be the perfect height to hug.\n\n \n\nJungkook gulped, audibly. \n\n \n\nOh boy. \n\n \n\n“Oh. Wow,” Jungkook uttered. \n\n \n\n“How’s it look?” Taehyung asked, doing a quick twirl in his ridiculously tall heels. The look on his face was clearly expectant. “Well?” \n\n \n\nJungkook didn’t feel like he could even find words to describe how good Taehyung looked. He couldn’t even believe someone as beautiful as this wanted to fake date him. “I mean — I —” Jungkook cleared his throat, put the glass of wine down on the small table next to the leather couch. He stood up from his seat, slowly, and took a few steps towards the older. “You look… stunning.” \n\n \n\n“Flatterer,” Taehyung said, lips quirking into a small smile. It looked surprisingly shy. He approached Jungkook with confident strides however, and before Jungkook knew it, Taehyung had thrown his arms around him; he made a lot of noise while doing so, wrists heavily adorned with jewelry. Man, he was a lot taller than Jungkook in those heels. “You really think I look good?” Taehyung continued. “Good enough to be on your arm tonight?” \n\n \n\n“I mean —” Jungkook cleared his throat and slowly slipped his arms around Taehyung’s waist. His mind was screaming at him not to, to make distance, because there was still no one here to act for, but Jungkook justified it to himself that it was practice. Warm up. “I think I’ll look awfully dull next to you as always, but that’s nothing new.” \n\n \n\nTaehyung made a protesting sound. “You don’t look dull, I think you look wonderfully gorgeous. We’ll turn heads, both of us.” He leaned down and pressed a kiss to Jungkook’s cheek, and Jungkook honest-to-god almost squealed. This was the effect fucking Kim Taehyung had on him. “You look beautiful. We both do.” \n\n \n\nJungkook tried not to smile too wide. “If you say so.” \n\n \n\n“I do say so, and my words are law,” Taehyung nodded. “Now — please let go of my waist, villain, as we really do need to leave.”\n\n \n\n“Maybe I don’t want to let go. Maybe I’ll just stay here, all night, hugging you,” Jungkook — the Idiot™ — said, hugging Taehyung a little tighter while doing so, and the older tensed in his hold. We’re supposed to be fighting, Jungkook reminded himself, but Taehyung was close and smelled sugary and he looked so beautiful that not flirting didn’t seem like an option.\n\n \n\n“You trying to get in my pants before we break up tonight, Jeon Jungkook?” Taehyung asked, cocking his head to the side.\n\n \n\nMaybe. \n\n \n\nJungkook looked up at him, lifting one brow at the challenging expression on Taehyung’s face. Slowly, without breaking eye contact, he trailed his hand down Taehyung’s waist and down his hips and thighs, towards the slits in his pants. Taehyung seemed to tense even more, hands moving to Jungkook’s shoulders, and then to the nape of his neck. “I mean —” Jungkook started, blood ringing in his ears and he slipped a hand under the fabric of the pants, “there isn’t much pants to get into, babe.” \n\n \n\nTaehyung was peering down at him, bottom lip between his teeth, and in any situation where Jungkook wasn’t fully aware of how fake their relationship was, and how hurt he was going to be when Taehyung said goodbye to him later, he would have pushed Taehyung against the closest wall and kiss him hard; he’d probably hoist Taehyung up, wrap his long legs around him, hold him close and suck marks onto his pretty skin, because honestly, as beautiful as Taehyung looked in these clothes the thing Jungkook wanted most was to get Taehyung out of them. \n\n \n\nDon’t, Jungkook. Don’t do it. \n\n \n\nJungkook was weak, he really was. One second longer of Taehyung staring at him with hooded eyes, and he’d probably snap. \n\n \n\nInstead he managed to look away, remove his hand from under Taehyung’s pants, and gave his (admittedly very nice) butt a light slap. Taehyung made a startled sound. “Okay, I’m done playing. Let’s leave. We shouldn’t be too late.” \n\n \n\nTaehyung’s mouth dropped open just a little, and Jungkook enjoyed the surprised look on his face a little too much, probably. “You’re a tease, what the fuck.” \n\n \n\nJungkook grinned. “You really wanted to make that excuse a reality, huh? I don’t think we’ll even get to the launch party at all, then, Taehyung, if you wanted to sleep with me first.” \n\n \n\nSpluttering, Taehyung pushed Jungkook away. “I do not —” \n\n \n\nJungkook rolled his eyes lightly. Here they go again. “Yes, Taehyung, I know. We already argued about this. I’m not your type, you don’t like me, this is all because you want to prove a point to your coworkers — got it.” He sighed, gathered the jacket he’d taken off while waiting for Taehyung to get ready. “I’m not in the mood to fight, Taehyung, and if you want to make this believable, I don’t think we should be either. So let’s — let’s just enjoy ourselves today, yeah? Take your own advice — don’t think about it too much.” \n\n \n\n“Fine,” Taehyung snapped. “Sorry, then. We’ll — let’s go all out, yeah? Make them all think we’re a super gross obnoxious couple?” \n\n \n\n“Yeah.” Jungkook coughed. “I mean, we already managed to fool Jimin. He thinks we’re gross and cute, apparently. So — I think we can manage one more time.” \n\n \n\n“Really?” The smile on Taehyung’s face looked surprisingly genuine. Jungkook assumed he was happy to know they had fooled someone. “Jimin thought we were cute together?” \n\n \n\nJungkook nodded, gave a slight sound of confirmation. “Yeah. He thinks we’re cute.” \n\n \n\n“We are,” Taehyung agreed, and, well, Jungkook could get behind that. They would have looked really cute together; Jungkook had a whole folder of nice photos him and Taehyung had taken for Evidence, to show they were really an item, and — well, they looked great. They looked like a couple. \n\n \n\nLinking their arms together, Taehyung pressed up against Jungkook again, leaned down, and gave Jungkook a small, sticky kiss at the corner of his mouth. “Let’s go, baby,” he said, and Jungkook could feel his heart beating fast and hard in his chest. \n\n \n\n“Yeah. Let’s.” \n\n \n \n\n.\n\n \n\n.\n\n \n \n\nThe launch party was held in a nice, fancy complex in Dongdaemun, and it wasn’t really as extravagant as Jungkook had expected. There weren’t any photographers waiting outside, no chaos, and no nationwide famous celebrities; instead there was a large amount of well-dressed people mingling and drinking champagne, soft music playing in the background, and a multitude of fashion spreads on the walls. \n\n \n\nIt was a relief, honestly. Jungkook had already had nightmares about flashing cameras for about a week.\n\n \n\n“Most reporters here have been invited here by my brother himself,” Taehyung informed as he led Jungkook inside the welcoming hall. No one seemed remotely interested in them arriving a little late, carrying on with their conversations. “Seokjin hates the stress of having to talk to too many people at once, so this is honestly a pretty private affair. It might not seem like it, since so many people are attending —” Taehyung skillfully grabbed two glasses of champagne from a passing waiter, “— but this would have been a much bigger party if it was mine.” \n\n \n\n“Yeah, you seem like the type to throw extravagant parties. Thanks.” The champagne tasted a little sweet. Bubbly. Jungkook linked arms with Taehyung again, because even if he wasn’t in full panic mode, he felt a lot better with Taehyung at his side. “I don’t look completely out of place, right?” \n\n \n\nHe hoped he didn’t. The suit didn’t look any different from what other people were wearing, and covered most of his tattoos except the ones on his right hand and fingers, but Jungkook was scared he just looked… awkward. That it seemed too obvious he didn’t belong. \n\n \n\n“Don’t worry. You look exactly like every other dude dressed in Armani on this party.” Jungkook took a small look at his suit. Armani. Okay, he was certainly going to be more careful from now on. He should probably have checked the tag on the jacket. \n\n \n\n“Well,” Jungkook mumbled, moving his arm around Taehyung’s waist, “every other dude in Armani on this party isn’t being accompanied by the most beautiful man on the planet, though.” \n\n \n\n“Oh, wow,” Taehyung said, throwing a small look in Jungkook’s direction that he didn’t really know what meant. “That was smooth as fuck. What happened to my awkward boyfriend?” \n\n \n\n“You like the compliments,” Jungkook excused. “I’m just stating the facts, babe.” \n\n \n\n“Well — keep them coming.” Taehyung grinned, but there was something about his smile that didn’t completely reach his eyes. He lifted his glass, clinked it against Jungkook’s, and then almost downed the whole drink. Jungkook supposed something was wrong but — he didn’t want to ask. This was certainly not the place for them to talk; they had a relationship to fake. Jungkook could ask later. \n\n \n\nOr not. \n\n \n\n“Oh, Taehyung!” \n\n \n\nThe slightly familiar voice of Kim Seokjin rang across the room, and turned his head to see Taehyung’s older brother come towards them with a large, pink-lipped smile. The sequins on his jacket nearly blinded Jungkook. “You made it! You guys are pretty late, you know?” \n\n \n\n“Sorry, hyung,” Taehyung grinned. “We got caught up.” \n\n \n\nAha. Caught up. \n\n \n\nSeokjin lifted one eyebrow. “Caught up, you say?” His eyes moved from Taehyung towards Jungkook, and Jungkook tried his best not to shrink in his position. “I see. Lover-boy can’t keep his hands to himself, huh?” \n\n \n\nJungkook spluttered, tried hiding a little behind Taehyung as if that was going to help him in this situation. Seokjin and Taehyung apparently both thought it was hilarious. “Oh, I’m sorry, didn’t mean to assume,” Seokjin said, the lilt in his voice definitely insinuating that he assumed something; but that was the point, obviously. “It’s nice seeing you again, Jungkook. Glad you didn’t get cold feet about coming here, I know it may be a lot to take in.” \n\n \n\n“Yeah it’s — nothing like I’ve ever been to before, that’s true. Uhh — congratulations, on… all of this?” \n\n \n\nTaehyung snorted next to him, and Seokjin also looked pretty amused. “Thank you, Jungkook. And thank you for coming, despite this being somewhat out of your comfort zone. Don’t worry too much and just stay close to Taehyung and you should be just fine — now.” Seokjin clapped his hands together. “I believe I have to mingle, I promised a few news sites some small interviews. Runway starts in thirty minutes, don’t be late for that!” With a small wink in Taehyung’s direction and a pat on Jungkook’s shoulder, Seokjin walked away in his shiny, sequined jacket, and Jungkook let out a small breath of relief. \n\n \n\n“That was quick and painless,” Taehyung said, sounding reassured as well. He moved his arm, trailed his hand down to link his and Jungkook’s fingers together. “Want to just get it over with? I saw my mother over by the refreshments, so my father shouldn’t be too far away either. Let’s just — get it out of the way? Rip it off, quickly, like a band-aid.” \n\n \n\nIt dawned on Jungkook then, that Taehyung must have been just as nervous as him — if not more. In the end this was his family they were trying to fool, and if everything went to hell Taehyung was the one who had to live with the consequences. If Jungkook fucked up, sure he’d feel pretty embarrassed about it, but then he wasn’t going to see them again. Taehyung was the one who would get the short end of the stick if this didn’t work out. \n\n \n\nSo, really — Jungkook should just do his best. For Taehyung’s sake. Even if it was going to hurt like a bitch when Taehyung waved him goodbye in approximately two hours. He was going to make sure Taehyung’s parents thought he was the nicest fucking boyfriend Taehyung ever had — much better than those stupid model boys. \n\n \n\nNodding, Jungkook clutched Taehyung’s hand a little tighter. “Let’s do it.” \n\n \n\nTaehyung’s mother, Kim Taemi, was a model-turned-actress who apparently had a good number of popular dramas back in the 80’s, before retiring from the big screen to work with her new husband on his fashion magazine. Her husband, Kim Seokho, had been a pretty famous shoes designer before deciding to start Bangtan Magazine; he was a lot kinder-looking than Jungkook had expected — they both were, honestly — but maybe Jungkook had just been watching too much Ugly Betty. Taehyung had assured him since the beginning that they were very nice people — just very busy — and it was obvious. \n\n \n\n“Taehyung has talked lots about you,” Kim Taemi said, her lips stretched into a smile that reminded Jungkook a lot of Taehyung’s. She was a beautiful woman, and looked far too young to have two sons in their later twenties; her black hair was in a nice up-do and she was dressed in a gorgeous royal blue pants suit. Taehyung looked a lot like her. “Wouldn’t shut up about you when we met at lunch yesterday. Jungkook this and Jungkook that.” \n\n \n\nTaehyung grumbled from the side. “Thanks, mom.” \n\n \n\n“That’s very flattering,” Jungkook said, shooting a small look in Taehyung’s direction. “I hope you’re saying nice things about me, though.” \n\n \n\n“Huh? You saying you have nice sides about you, Mr. Jeon?” Taehyung teased, tilting his head to the side. “I have yet to see them.” \n\n \n\nJungkook grimaced, letting his arm travel around Taehyung’s waist to pinch his side. Taehyung let out an honest-to-God squeaky giggle and Jungkook was so far gone. What a fucking cutie. There the hell was bubblegum bitch? Where was the asshole Jungkook had met in studio 3 who had ordered him around like some dog? “Of course I’ve only said nice things about you, baby,” Taehyung smiled, and when Jungkook saw how fondly Taehyung’s parents were looking at them both he felt bad. Damn, they were swallowing it up. Jungkook imagined it had a lot to do with Taehyung sending photos of them both and talking about Jungkook even before meeting him, but damn. \n\n \n\nGod he felt bad. He just didn’t know what was more upsetting; the fact that Taehyung’s parents seemed to genuinely believe they were together, or the fact that they weren’t. \n\n \n\nAvoiding the gazes of the parents, Jungkook turned to Taehyung, who leaned down and pressed his forehead against Jungkook’s. It was too cute, Jungkook honestly felt like his whole face was going to burn up when Taehyung bumped their noses together and grinned with his whole face. Jungkook suddenly wanted to be far away from all of this, preferably in Taehyung’s or his own apartment, where he could have pulled Taehyung in and kissed him like he deserved to be kissed. He couldn’t exactly do that here, with reporters mingling amongst the well-dressed upper class — much less in front of Taehyung’s parents — so Jungkook settled for smiling back and pecking Taehyung’s nose before pulling away.\n\n \n\n“I’m so sad I can’t take you out on a dinner, Jungkook,” Kim Taemi sighed, shaking her head. “We would have loved to have taken you guys somewhere a little more private than this whole affair and have a nice meal and talk more, but we’re all very busy people, yeah? We’re leaving right after the runway, too.” \n\n \n\nHer husband nodded. “Yes, our plane leaves a little after midnight, so we need to get to the airport in time,” he said, “we barely made it here this week, but I’m glad we managed to at least meet the boy Taehyung has been talking so much about. We’re afraid he’s overworking himself, you know, he’s so dedicated, and we’re hardly ever in the country to support him.” With a fatherly smile, he raised his hand and ruffled Taehyung’s bangs with his fingers, much to his son’s protest. “It’s good that he has someone around that can take care of him a little. His brother is here, obviously, but with the launch of his clothing line Seokjin will be traveling even more too.” \n\n \n\n“Dad —”\n\n \n\n“We’re scared he’s getting lonely here in the big city,” Taemi continued, and Jungkook heard Taehyung groan audibly. “He’s been living in Daegu most of his life with his grandparents, you know, so we were a little surprised he wanted to move to the Seoul branch by himself. But —” she smiled, in such a motherly way it nearly made Jungkook a little homesick, “— you know how stubborn he is. What Taehyung wants, Taehyung gets.” \n\n \n\nTaehyung grumbled. “You make me sound like a spoiled brat.” \n\n \n\n“You’re a little bit of a spoiled brat,” his dad quipped, and Jungkook snorted unattractively. “But you’re our spoiled brat.” \n\n \n\nTaemi made a sound of agreement, while Taehyung nearly rolled his eyes back into his head. His ears were tipped red. Jungkook was having the time of his life, seeing Taehyung speechless like this. “Point is,” Seokho continued, “we’re glad he has someone to spend time with. And we wish we could have gotten to be here longer to get to know you better too, Jungkook, and thank you properly for making our son smile so much.” \n\n \n\nThey were giving him too much credit. It’s not like Taehyung was lonely and unhappy without a boyfriend; in fact, judging by the previous idiots he’d dated, Taehyung was doing well on his own. Jungkook couldn’t even say in confidence that he made Taehyung happy, because for all he knew Taehyung was just doing his very best to convince his parents they were in a relationship. \n\n \n\nBut one thing was certain; Taehyung made Jungkook happy. Sad, too, obviously, knowing this was going to end soon, but Taehyung draping himself all over Jungkook, kissing him, hugging him and teasing him, made Jungkook smile wider than he’d done in a long time. “Well, sir,” Jungkook started, “the feelings are mutual. We both take care of each other and make each other happy, so — honestly, Taehyung is great. Thank you for, you know, your support. I hope you’re okay with me dating your son for a while. As long as he doesn’t get tired of me, of course.” \n\n \n\n“Oh, he’s yours,” Taemi said, at the same time as Taehyung squeezed Jungkook’s upper arm a little too hard. “Take him forever, please!” \n\n \n\nForever. \n\n \n\nTaehyung sucked in a very audible breath as his mother said that. Jungkook shot him a small look, squeezed his hip. “I do wish we had better time,” Seokho said again, looking dejectedly at the clock on his wrist, “but the runway is about to start, too. It’s unfortunate our first meeting is cut so short, but — perhaps we can find time to meet later this year?” \n\n \n\n“Yeah, maybe,” Taehyung said, possibly a little too fast. Suddenly he was busy looking anywhere but his parents.\n\n \n\n“This winter, perhaps?” Taehyung’s mother looked hopeful, and Jungkook stuttered. Shit, this probably wasn’t in the plan. Were they that convincing that Taehyung’s parents believed they would stay together for a very long time? “We have a vacation house in Hainan, that shouldn’t be too far for you guys to travel. That would be very nice.” \n\n \n\n“Let’s see, when the time comes,” Taehyung hastily smiled. “I mean — we don’t know how busy either of us will be around next summer, so let’s not get ahead of ourselves. You guys might visit before then. Ah — the runway should be starting soon.” \n\n \n\nTaehyung was fretting. He was nervous, shifting the weight on his heels, and he pulled away from Jungkook’s grasp to run a hand through his blond hair. His mother eyed him with a little suspicion. “Taehyung? You alright, sweetie?” she asked, that Concerned Mom-expression in place. Taehyung looked very distressed, Jungkook would agree, like he was about to pass out any moment. \n\n \n\n“I’ll — uhh,” Jungkook put a hand on the small of Taehyung’s back, “I’ll take him outside for a moment, have him get some fresh air. That okay, babe?” \n\n \n\nTaehyung nodded, curtly.\n\n \n\nKim Taemi frowned. “Okay, sweetie. But — the runway starts very soon so make sure you’re in place by then, okay? Be there to support your brother, he worked very hard for this.” \n\n \n\nBoth nodding, Jungkook started leading Taehyung towards the exit of the complex, the older not protesting the slightest at the hand on his back. As soon as they were outside, Taehyung grabbed Jungkook by the arm and dragged him aside, farther away from the entrance, towards a brightly-lit fountain. Then he stopped, turned to face Jungkook and said, eyes wild, “I can’t fucking do this.” \n\n \n\nWhat. \n\n \n\n“What?” Jungkook voiced, raising one eyebrow. “You can’t do what?” \n\n \n\nTaehyung gestured wildly around them. “This! All of it! You — they fucking love you!” \n\n \n\nJungkook was genuinely confused here, mind you. This made zero sense to him. “Yeah, I guess? Was that not the point? We were supposed to be believable, right?” \n\n \n\n“Believable, yes,” Taehyung hissed, “but you’re acting like a fucking heaven-sent son-in-law!” He placed his hands on his hips, leaned down a little to get more on eye-level with Jungkook. “You’re making this ten times more difficult for me! I’m the one who has to drop the news that we've broken up in two weeks time, and they’re actually going to be sad about it! ‘Oh, we take care of each other and make each other happy’. What sort of sappy ass shit was that!?” \n\n \n\nJungkook schooled his expression into one of nonchalance, despite feeling anger and hurt bubble under his skin. “You’re doing it again,” he said, a little surprised at how low his own voice was. “You’re contradicting yourself.” He looked around them, making sure no one was nearby, but still lowered his voice even more, to a mere whisper. “Do I need to remind you you’re paying me for this, still? My business is for tonight — and tonight only. What happens after is your fucking problem, Kim Taehyung.” \n\n \n\nMaybe Jungkook was being a little harsh again, but Taehyung had no right to say that Jungkook was doing anything wrong at this point. He was doing exactly what Taehyung had asked him to do in the e-mail: act like a loving boyfriend to fool his family into thinking they were actually dating. He wasn’t crossing any line, not really, because what happened after this night was over was not something Jungkook should be concerned about. Sure, he was a little scared at the fallout of this, but it wasn’t supposed to have anything to do with him. \n\n \n\n“Also,” Jungkook continued, gulping, “that sappy shit came straight from the fucking heart, Taehyung. You might not want to admit it, but this whole thing has been kind of fun, and I’ve enjoyed myself in your company.” \n\n \n\nTaehyung looked doubtful. “You… enjoy my company?” \n\n \n\n“Obviously,” Jungkook snorted. “Of course I was just going along with what a good boyfriend would have said in that situation,” he lied (because Taehyung genuinely made him happy), “but it’s not like it came from a completely baseless place. The stripping job was still worse than this.” \n\n \n\nTaehyung bit back a smile, but somehow he still looked upset. Jungkook wasn’t sure what he was supposed to fix this situation, because it seemed like Taehyung just… didn’t want to continue. “If…” Jungkook started, “if you really don’t want me here —” his heart dropped a little at the thought of saying goodbye a few hours too early, “— I can just leave. You can tell everyone I got a sudden phonemail for a job, or something. But — you still kind of have to pay me.” \n\n \n\n“No.” Taehyung shook his head, quickly. “Fuck — I’m sorry. I’m being a bitch again, I didn’t — you’re just… you’re just so much better at acting than I thought you would be. It’s… throwing me off.” \n\n \n\nIt’s because I’m not acting, Jungkook thought, sadly, because fuck, he was a horrible actor. \n\n \n\nHe was just so, helplessly smitten. He was falling stupidly in love with Kim Taehyung; diving headfirst, even, and at this point all he could do was enjoy the time they had left together and hope that he would get over Taehyung, eventually. \n\n \n\nJungkook shrugged, once again trying very hard to look completely unaffected. His heart was beating loudly in his chest. “Guess I got used to it. Didn’t want you to leave a bad review on my website, either, when all of this is over. Need to do a good job, you know, no matter how awkward was in the beginning.” \n\n \n\nAt this, Taehyung smiled for real. “Yeah, okay. I’ll make sure to leave a very nice review for you. 8/10.” \n\n \n\n“Excuse me,” Jungkook said, pulling an affronted face, “what exactly is pulling my grade down?” \n\n \n\n“You horrible kissing,” Taehyung teased, smirk sliding onto his face. Then he walked forward, bumped his shoulder with Jungkook’s, and headed back towards the fashion complex, heels clicking against the ground. \n\n \n\n“Horrible kissing,” Jungkook repeated, looking after Taehyung, mouth dropping open. “Who — what — who are you kidding here, Kim Taehyung? I’m a fantastic kisser, and you know it! You can’t fool me, you think I’m an excellent kisser!” \n\n \n\n“Keep telling yourself that, darling!” Taehyung shouted back. \n\n \n\nIf this was a nighttime drama, this was the part where Jungkook would run up to Taehyung, grab his arm, turn him around and kiss him. Prove to Taehyung — or at least remind him — what a great kisser he is. However — this wasn’t a drama. Jungkook knew that kissing Taehyung at this point would probably only make him more upset, and he didn’t want to deal with that. He just wanted to stay close to the older and enjoy his company one last time, even if he was itching to say something. Anything. \n\n \n\n“You’re an ass,” Jungkook said as he jogged up to Taehyung’s side and grabbed his hand. “And a horrible boyfriend.” \n\n \n\nTaehyung threw his head back and laughed, and Jungkook thought, God, I could stare at him the whole day if it was socially acceptable and not very creepy. “Well, just wait a little more, and you’re a single man again, Jungkook. About —- an hour and a half until we can break up.” He winked as the automatic doors to the complex opened and they walked back into the hall. The words were like a punch to Jungkook’s gut. \n\n \n\n“What if I don’t want to.” \n\n \n\n Oh.  \n\n \n\nOh no, Jungkook said that out loud. \n\n \n\nTaehyung’s head whipped around, and Jungkook stopped dead in his tracks; Taehyung pulled his hand to his chest, as if Jungkook’s skin suddenly burned him. Shit, Jungkook had really gone ahead and dropped the bomb like that, could he really not have waited just a little longer? Could he not just have kept his mouth shut? “W-what?” Taehyung uttered, voice sounding uncharacteristically weak. “What… did you say?” \n\n \n\n“Kim Taehyung!” \n\n \n\nA tall fellow approached them, suddenly, panting. His arrival immediately cut off any chance of them talking this out at the moment, and Jungkook praised the heavens for the timely intervention. Jungkook spared the new arrival a brief look, recognized him as Kim Namjoon — the sole reason he and Taehyung even met in the first place. If Kim Namjoon hadn’t ordered those 33 vegetarian sandwiches and had Jungkook deliver them to studio 3 that very day, Jungkook and Taehyung would never have met. At this point Jungkook wasn’t sure if Namjoon was someone he should thank or curse. Not with the way Taehyung was looking at him, as if his whole world had just crashed around him. \n\n \n\n“Taehyung — the show is starting,” Kim Namjoon said, looking between the two of them from behind his thick-rimmed glasses. “The doors are closing, so we need to — are you coming?” \n\n \n\nTaehyung swallowed. “Y—yeah. I’m coming. Jungkook — uhh — come on, let’s go.” \n\n \n\nJungkook had half expected Taehyung to just tell him to leave, cut this whole thing short and send Jungkook away. It would have made sense if he did, because Jungkook had suddenly dropped a I wanna date you for real bomb and distance would have been the most obvious option. Instead, Taehyung took Jungkook’s hand again — it was a little clammy, and Jungkook though it looked like Taehyung’s shoulders were shaking — and dragged them towards where the runway was supposed to be. \n\n \n\nNamjoon followed them both, but all of Jungkook’s attention was on Taehyung and how warm his hand was. It was a bit of a blur as Taehyung pulled him along past rows of occupied seats and made Jungkook sit down on a less-than-comfortable chair, right in front of a long, brightly lit stage. \n\n \n\nTaehyung placed his chin on Jungkook’s shoulder, and whispered a short, “we need to talk. After this.” \n\n \n\nJungkook gulped. \n\n \n\nOh boy. \n\n \n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n \n \n\nIt felt like forever until Seokjin finally stepped on stage after the show with a microphone and thanked everyone for coming. Jungkook’s eyes were watering at that point, and he wasn’t sure if it was because he was dreading the talk he needed to have with Taehyung or because of the flash photography going off around him. It hadn’t been obvious how many journalists and photographers had been present in the welcoming hall, but now Jungkook felt like they were everywhere. It put him a little on the edge, especially with the way Taehyung was still holding his hand. \n\n \n\nWe need to talk, Taehyung had said, but Jungkook knew they couldn’t talk here. Not with Taehyung’s co-workers around them, not with the journalist from a rivaling magazine sitting right next to them both. Min Yoongi was also seated right across the stage from them, and Jungkook might have shared slightly uncomfortable eye-contact with him a few times. \n\n \n\n“Let’s go to your place,” Taehyung said when people started moving and it seemed like he couldn’t stand up from hie seat fast enough. He pulled Jungkook up with him, serious expression on his face, and Jungkook didn’t feel like he could protest. “Let’s move before I’m stopped for some bullshit interview. The reporter behind me kept tapping my shoulder the whole fucking runway.” \n\n \n\n“Okay,” Jungkook mumbled, looking around them both. Part of him wanted to stall the inevitable talk they were supposed to have, because honestly he didn’t know what Taehyung was going to say. How harshly was Jungkook about to be rejected? “Are you sure, though? Won’t your brother want you to stay behind?” \n\n \n\nTaehyung shook his head. “Seokjin can manage on his own. He’s not dependent on me, I’m still kind of convinced he just wanted me here to rub his success in my face.” Jungkook wanted to say that probably wasn’t the case, but he didn’t know enough about Taehyung and Seokjin’s relationship to do so. It was obvious Taehyung was a little upset about not getting the Chief Editor position, despite having said he wasn’t, so Jungkook wasn’t going to assume. \n\n \n\n“Why my place?” Jungkook asked. \n\n \n\n“Because I need that suit back.” \n\n \n\nAh. More rejection. If they went to Taehyung’s place, Jungkook could easily have borrowed something from his gigantic closet to wear. The future was looking bleak indeed, and Jungkook’s remaining hope was dwindling. \n\n \n\nSigh. \n\n \n\n“Hurry, Jeon! Kim Heechul is moving in this direction and if he gets his claws in me we’re not leaving until morning.” \n\n \n\n“Fine.” \n\n \n\nWhen Taehyung said hurry he meant let’s fucking zoom out of this place. Jungkook barely managed to say a hello to Yoongi as they passed him, Taehyung swiftly maneuvering them both through the suddenly bustling crowd. Luckily Seokjin was busy with a whole pack of hungry reporters, so he didn’t spot them as Taehyung led Jungkook out of the complex. It was a swift, mostly painless exit, though Jungkook felt like his arm was going to fall off with the force Taehyung was pulling it. \n\n \n\nAs they slid into Taehyung’s car, the silence finally caught up to them, and it dawned on Jungkook that, fuck, now they had to talk. \n\n \n\nBut Jungkook was not going to open his mouth first. Hell no. \n\n \n\n“Not gonna say anything?” Taehyung asked as he started the engine. \n\n \n\nJungkook huffed and childishly crossed his arms over his chest. “You wanted to talk.”\n\n \n\n“And you don’t want to talk?” Taehyung spoke, shooting a quick glance in Jungkook’s direction. Taehyung was obviously focused on safely getting out of the parking lot, but his knuckles were white from how hard he was gripping the steering wheel. “Mr. I-don’t-want-to-break-up? Newsflash, Jungkook: we weren’t even dating in the first place.” \n\n \n\nJungkook hurriedly looked out of the window, chewing his bottom lip between his teeth. “You think I don’t know that? You made sure to remind me every time I got a little too close.” He sank into the seat, sadness welling over him suddenly. Don’t cry, Jungkook. Don’t you dare cry, you big baby. “Doesn’t mean it didn’t feel real, sometimes.” \n\n \n\n“Well —” Jungkook could hear Taehyung shift a little in his seat, “— I admit it felt real, at times, but — you —” he paused, hesitated; “you said you were just following fucking orders. That you were doing this because I’m paying you. That’s what you’ve been saying all along, Jungkook, how dare you suddenly change your mind —” \n\n \n\n“You think I suddenly changed my mind?” Jungkook snorted. “I’ve been slowly falling for you over the course of these weeks, knowing you didn’t want anything to do with me as soon as this was over. I was just supposed to be another one of your asshole boyfriends, but then I got invested, and I started getting to know you and — fuck.” Yeah, okay, the moisture was definitely gathering in his eyes at this point. “You know how beautiful and charming you are, Kim Taehyung. You really expected me not to fall head over heels?” \n\n \n\nTaehyung stuttered, which definitely wasn’t a regular occurrence. “I — you — I thought you were just acting —”\n\n \n\n“I’m a horrible actor.”\n\n \n\n“So,” Taehyung mumbled, “that stuff you said — about me making you happy? Was… was that true, then?” \n\n \n\nAt that Jungkook might actually have had to choke back a sob. “Yeah,” he croaked out, pressing his forehead against the cool glass window. Stop crying, he told himself as the stupid tears rolled down his cheeks. Oh dear God, you’re pathetic, Jeon, it’s just one guy. A stupid crush. \n\n \n\nExcept maybe it wasn’t. Jungkook hadn’t allowed himself to think too much about it, but even Taehyung’s parents seemed to think they could have stayed together for a long time. Of course he was going to fantasize a little.\n\n \n\nThe silence then stretched out for a good fifteen minutes, neither of them saying a word as Taehyung drove in the direction of Jungkook’s apartment. Jungkook wasn’t sure what more he was supposed to say, because honestly he’d laid himself bare at this point. Taehyung knew now, and honestly there was nothing Jungkook could do to change it. \n\n \n\nThe second Taehyung’s car stopped outside Jungkook’s apartment complex, Jungkook opened the door and tailed out of the car. Taehyung shouted after him, but Jungkook just slammed the door closed and paced towards the entrance, drying his eyes hurriedly. Yes, Jungkook cried a lot when he got upset, sue him. He was a fucking ugly crier. \n\n \n\n“Hey, bastard!” Taehyung’s voice rang after him. “Are you seriously going to make me run after you in heels!?” \n\n \n\nJungkook stalled in front of the entrance door, hearing Taehyung slam the door to the driver’s side shut and approach him with fast, clicking steps. “You can just wait o-outside,” Jungkook muttered when he felt Taehyung’s presence behind him, “I’ll just take the suit off and come out with it —” \n\n \n\n“Jungkook,” Taehyung sighed, and then he gripped the sleeve of Jungkook’s suit jacket, turning him around. Jungkook didn’t have any time to read Taehyung’s expression before the older’s lips was on his, hands cupping Jungkook’s face and body pressing him against the entrance door. The doorknob was jabbing uncomfortably into Jungkook’s back, but he couldn’t bring himself to care when Taehyung’s kiss made him both so confused and hopeful. Taehyung’s thumbs grazed over Jungkook’s still tear-strained cheeks, and he hummed against the younger’s lips. \n\n \n\n“What’s this?” Taehyung mumbled, briefly pulling away to press a kiss to Jungkook’s left cheek. “You crying and everything?” \n\n \n\nSniffling, Jungkook rested back against the entrance door, hoping none of his neighbors suddenly decided they’d come through this very moment. “Y-yeah,” he voiced in answer to Taehyung’s question. \n\n \n\nTaehyung pouted, moving his hand to card his fingers through Jungkook’s fringe. “You — really like me that much, Jeon Jungkook?” \n\n \n\nJungkook nodded, weakly. \n\n \n\n“Oh.” Taehyung’s ears were turning a little pink; be bit his bottom lip, looked at Jungkook through his lashes; pressed himself a little closer. “I’m sorry,” he mumbled, and Jungkook’s heart stuttered. “I’m sorry for pushing you away, I — I really, honestly thought you were only doing this for the money. I — you didn’t give me many signs showing you didn’t, and every time I tried to mention something about it you just shut it down.” \n\n \n\nJungkook spluttered. “Well, you — it seemed like you really hated the idea of me liking you, so I just… I didn’t want to get hurt, so I said stupid shit to hurt you instead. I mean, me getting my heart broken was obviously inevitable anyway, because honestly this was bound to happen to one of us. I’ve seen the movies, you know? This is a thing that happens, and I should have known better because you’re… You’re you. You’re kind of perfect.” \n\n \n\nTaehyung lowered his head. He was blushing furiously at this point, but that was okay, because Jungkook was pretty sure he was as well. “I’m not. Obviously. I mean, you even mentioned that I needed to fix my personality.” Before Jungkook could try and explain that he definitely didn’t mean that, that he just said it because he was mad, Taehyung held up a finger to shush him. “I know you didn’t mean it, you’re not that much of an asshole. It sure hit home, though.” \n\n \n\n“I’m really sorry,” Jungkook stressed, “no one is more sorry than me. Sorry, sorry, sorry —”\n\n \n\n“Shh,” Taehyung silenced him by pressing a manicured finger to Jungkook’s lips. “I know you didn’t mean it, you dramatic ass. But — I still thought you didn’t want anything to do with me personally, that you were just sticking with it for the money, because I’ve had those experiences with boys before; they’ve dated me because I have money and contacts and can get them jobs. And you — you weren’t even really dating me, so why would you actually like me?” Taehyung paused, briefly, took a deep breath before continuing. “After Hongdae, with Jimin and Heeyeon and them, I, uhh, it got a little too real. You let me sleep over, and I — fuck, I thought about you the whole weekend. And then I couldn’t stop thinking about you. When you kissed me in my office like that I — God, I was so close going on my fucking knees for you.” \n\n \n\nWell. Jungkook certainly wasn’t expecting those words out of Taehyung’s mouth. The mental image had blood rushing immediately from his face and straight south. “Are you —” Jungkook cleared his throat, his voice embarrassingly high-pitched, “— what are you saying —” \n\n \n\n“I’m saying I like you, Jungkook,” Taehyung said, voice the softest Jungkook had ever heard. He didn’t meet Jungkook’s eyes, fingers playing with the collar of his shirt. Suddenly he looked so small, despite towering over Jungkook in his 7-inch heels. “And — I think you should take responsibility,” he continued, “for making me fall for your stupid face.” \n\n \n\nHonestly, Jungkook didn’t know what he was feeling. Relief? Happiness? He wasn’t sure, but all of it seemed to make him cry even more, and it also made him smile so wide he thought his face was going to split. “Are you crying more?!” Taehyung exclaimed, cupping Jungkook’s face again. “You crybaby! I sure hope those are happy tears!” \n\n \n\nJungkook nodded wildly in confirmation, because yes, those were definitely happy tears. Sure, he was still not sure what was happening — was this even happening, or was he in some sort of dream state? — but he felt light and content and Taehyung liked him back. Taehyung actually wanted him. He could kiss Taehyung just the way he wanted, now. \n\n \n\n“Do you… can we maybe go upstairs?” Jungkook asked. “Because I feel like my neighbors can show up any time now, and we are kind of standing in the way.” \n\n \n\nTaehyung snorted. “Sure. I’m not really into being watched, anyway.” Jungkook choked at those words, yet Taehyung only grinned and threw his arms over Jungkook’s shoulders. Leaning down, he pressed a soft kiss to Jungkook’s lips again, and Jungkook let his eyes slide close, wrapping his arms around Taehyung’s midsection as he responded. Kissing Taehyung felt natural, simple, and without the nagging of you guys are not real, he doesn’t like you it was also ten times more enjoyable. \n\n \n\nFinishing off with a loud peck to the corner of Jungkook’s mouth, Taehyung pulled away and grinned. “Let’s go upstairs, baby. We can talk more and —” Taehyung’s hand gripped Jungkook’s tie, smile turning just a bit smug, “I can even help you out of this suit.” \n\n \n\n“Yeah?” Jungkook breathed. “I’d love that.” \n\n \n \n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n \n \n\nThere was little talking. \n\n \n\nHonestly, Jungkook was pleasantly surprised they even made it to the bed, because the idea of just bending Taehyung over any piece of furniture sounded more than enjoyable enough. However, Taehyung told him (with a scoff) to, “be a little romantic, you ass”, so Jungkook navigated them towards the bedroom between heated kisses after a good thirty minutes of making out and grinding. Taehyung had already stripped Jungkook of his jacket and shirt — honestly Jungkook was a little surprised at how quickly Taehyung could undress someone when it took him ages to put on an outfit — and was now slowly wriggling out of his sinful pants. \n\n \n\n“Undress completely, baby, we aren’t wasting any time,” Taehyung breathed. His lips were puffy from how much kissing they had been doing, and he looked flushed and pretty and happy. “Those dress pants are too expensive to fuck in.” \n\n \n\nHurriedly following instructions, Jungkook unbuttoned the pants, pulled them down and kicked them away. “How you wanna do this?” he asked, a little breathlessly, because at this point he wasn’t picky. “Want me to fuck you? Or do you want to fuck me?” \n\n \n\n“Both are tempting options, baby,” Taehyung grinned as he slowly (and sensually) slid off his silky shirt. “But I might have fantasized about your dick in me since God knows when. Fuck you’re hot.” \n\n \n\n“Yeah?” Jungkook bit his lip, chest swelling with simple pride. “I can definitely help with that fantasy.” \n\n \n\n“Mhm. Don’t doubt it baby. You have lube? Condoms?” \n\n \n\nBoy did he. Not that he actually used a lot of it, Jungkook’s sex life wasn’t that spectacular; just a one night stand here, maybe a hook-up there. But he always made sure to have it on hand. “Yeah,” he said, moving towards his drawers to pull out everything necessary to make it as easy as possible. “Hey — question. Or, uh, request.” \n\n \n\n“Hm?” \n\n \n\nJungkook gulped as he watched Taehyung lay down on his bed, tan skin a beautiful contrast to his light blue bedsheets. Taehyung sure hadn’t wasted time, having already discarded his underwear as well, and fucking hell, he looked stunning. He was already half hard, his navel piercing was glinting under the soft light of the bedroom lamp, and he was on Jungkook’s bed, completely naked, waiting for him — fuck. “What is it?” Taehyung asked, lips quirking into a sly smile. “How’d you want me, baby? On all fours? Or —” Taehyung slowly parted his legs, “wide open? Like this?” \n\n \n\nJungkook was pretty sure he was losing years of his life thanks to this man. “Just — uhh —” Jungkook hesitated, made himself busy finding the lube and condoms. He threw them on the bed, right next to Taehyung. “Could you — wear your heels?” \n\n \n\nTaehyung’s eyes widened, lips parting slightly in surprise. “You — want to fuck me in my heels?” \n\n \n\nJungkook shrunk a little in his position. But his dick sure didn’t. “M-maybe?” \n\n \n\nThe smile on Taehyung’s face was a mix of surprised and very obviously pleased. “You kinky little shit,” he voiced, pushing himself up and out of the bed. “Wait here for me, baby, I’ll go put them on again.” \n\n \n\nJungkook didn’t trust his voice to reply, because yes he might have thought about doing it, but he hadn’t actually expected himself to ask. Thankfully, it seemed like Taehyung was up for it, which was honestly the hottest thing ever. \n\n \n\nOr, well, Taehyung wearing only his heels, strutting in tall and confident was the hottest thing he’d ever seen. Jungkook was sure he must have saved some kingdom in his past life to be rewarded like this. He could only watch with his mouth hanging open as Taehyung laid back down on bed and rolled onto his stomach. Jungkook’s eyes zoned in on the ink on Taehyung’s lower back, the floral pattern swirling over his skin. “Ah, there is that tattoo,” Jungkook said. It was a little tacky, he’d admit that, but he’d definitely seen worse. \n\n \n\n“Ah, yes, my college regrets,” Taehyung snorted. “Let’s not talk too much about that and get to the fucking instead. Come on baby — hurry up.” \n\n \n\nTaehyung — as Jungkook had learned — was an impatient person. They had barely made out for a few more minutes before Taehyung grew impatient, picked up a condom and threw it with extreme precision into Jungkook’s forehead. “Prep me, you ass,” he mumbled, “fuck, i want you so bad.” Jungkook was never one to say against Taehyung — honestly, that’s how he even got into this position to begin with — so he picked up the bottle of lube and uncapped it. \n\n \n\nWorking Taehyung open was a painless process — just tedious — and Jungkook was sure he could get off by the image of Taehyung rocking against his fingers for years to come. If not the visual, then the sound would certainly also help, because Taehyung was vocal, and the older panting his name and staring up at him with hooded eyes and spit-slicked lips nearly made Jungkook come on the spot. “I’m — fuck —” Taehyung’s back arched off the bed, and he lifted his legs one of them resting onto Jungkook’s shoulder. “Fuck me, Jungkook.” \n\n \n\n“You sure you’re ready?” Jungkook asked, hitching Taehyung’s leg up a little bit further as he pressed forward. He looked ready, but Jungkook just wanted to make sure, because it had been a while and he wanted Taehyung to be comfortable. \n\n \n\n“Yes, I’m really fucking ready —” Taehyung breathed, whining as Jungkook pulled his fingers out. “Shit, I can’t believe you’re about to fuck me with that stupid G-Dragon poster staring straight into my soul.” \n\n \n\nJungkook doubled over laughing, face pressing into Taehyung’s soft stomach and forgetting for a second what they were even doing. Taehyung was shaking underneath him, both with laughter and arousal, and he said, “come on, I know I’m funny, but please fuck me,” with laughter in his voice. When Jungkook pushed himself back up Taehyung was grinning, wide, cheeks flushed and blond hair spread around his head like a discount halo. \n\n \n\n“Hold your legs up for me, babe,” Jungkook said, and Taehyung did as told, pulling his legs up to his chest, and Jungkook moved forward, holding back a smile. “Good boy.” \n\n \n\nTaehyung groaned. “That would have been kind of hot if I didn't know you just said that as a GD reference, you stupid little — ah.” \n\n \n\nPushing inside, slowly, Jungkook studied the expression changing on Taehyung’s face. “Okay?” he muttered, and Taehyung nodded, rapidly. Jungkook started with slow, careful movements to get Taehyung used to his size, only bottoming out when the blond uttered a jumbled, “deeper, baby.” Fuck, it felt so fucking good, Jungkook was honestly surprised he was this controlled in the situation. Taehyung was tight and hot around him, looked like heaven under his body, and with this angle Jungkook could lean down and connect their lips. It was like every wet dream these past weeks had come together and manifested right under him, except it was real. Kim Taehyung was really there, mumbling almost-incoherent demands for Jungkook to fucking fuck him good.\n\n \n\n“Didn’t — shit — know you were this flexible,” Jungkook mumbled as he started moving his hips, slowly building his pace. \n\n \n\nTaehyung stuttered, throwing his head back. “N-neither did I — ah, fuck, fuck!” Jungkook felt one of the heels scratching at his back as he started thrusting harder, Taehyung’s small curses turning into long-drawn moans. \n\n \n\nThey didn’t last long, but Jungkook hadn’t exactly expected that either. He fucked Taehyung — hard — until he came across his own chest and stomach with a silent scream. Taehyung scrambled at Jungkook’s shoulders when he continued fucking him through his orgasm; with his lips on Taehyung’s neck, Jungkook spilled inside the condom. Taehyung wasted no time pushing him away, forcing Jungkook to pull out, falling back on his ass with an un-sexy grunt. \n\n \n\nJungkook tried catching his breath, eyes raking over Taehyung’s body; his thighs were shaking, chest heaving, and he barely moved to kick Jungkook’s side lightly with his heel-clad foot. “F-fuck you,” he muttered, nearly breathless. “I nearly blacked out — fuck.” \n\n \n\n“You ok?” Jungkook panted, pulling the condom off. \n\n \n\n“A-fucking-okay,” Taehyung laughed, showing thumbs up. He was still breathing a little hard. “That was great. Wouldn’t mind making it a thing.” \n\n \n\n“A regular thing?” Jungkook voiced as he stood up and walked towards the bathroom to discard of the condom. \n\n \n\n“A very regular thing,” Taehyung confirmed.\n\n \n\nJungkook helped Taehyung take off his heels again, put them next to the bedroom door, and then he laid back down into bed. Taehyung immediately latched to his side, a little sweaty and sticky, but Jungkook assumed they could take a shower a little later. When Taehyung felt like it. “We should probably wash up,” Taehyung mumbled. “Ugh, worst part about sex, honestly. Having to wash up. I just wanna cuddle.” \n\n \n\n“I’ll cuddle with you all night,” Jungkook mumbled, throwing his arm around Taehyung. “But washing up sounds like a good idea.” \n\n \n\nTaehyung grumbled, clearly dissatisfied. “Yeah. Soon. Just — five minutes?” \n\n \n\nJungkook pressed their foreheads together, loving the way Taehyung scrunched his nose up and grinned at the action. “Whatever you want, babe,” Jungkook said, connecting their lips in another kiss far too sweet for their state of undress. Humming against Jungkook’s lips, Taehyung moved his arms around Jungkook’s waist and hugged him tight. Jungkook thought that this was pretty perfect. Sure, they still had things to talk about and work out, but they didn’t have to solve everything immediately. As long as he knew Taehyung liked him — wanted him — then Jungkook was content. They could work it out.\n\n \n\n“Can we make kissing and hugging a regular thing, too?” Taehyung suddenly asked, voice soft. “Or will I need to pay extra?” \n\n \n\nJungkook rolled his eyes. “Just ask me out like a normal person, Taehyung.” \n\n \n\n“Fuck, okay,” Taehyung sighed, moving away to stare Jungkook straight in the eyes. They were so close Jungkook felt like he was going cross-eyed. “Jeon Jungkook,” Taehyung started, eyes fond. “Be my boyfriend for real, you lame-ass fashion disaster.” \n\n \n\nJungkook grinned so hard it hurt. “Sure. I’d love to.” \n\n \n \n\n.\n\n \n\n.\n\n \n\n.\n\n \n \n \n\n(“Fuck,” Taehyung said, sitting up in sudden realization. “Holy shit, Jimin is a fucking liar. Boring ass vanilla man my ass!” He stared at Jungkook with narrowed eyes. “You’re kinky as hell, aren’t you?” \n\n \n\nJungkook snorted, pulling Taehyung back onto the clean sheets. “Have no idea what you’re talking about, babe. I’m pure. The purest.” \n\n \n\n“You fucked me in my heels, you nasty little—”)\n\n \n\n.\n\n \n\n.\n\n \n\n.\n"
}