{
    "id": "11249700",
    "url": "https://archiveofourown.org/works/11249700?view_full_work=true",
    "author": [
        "a_dale"
    ],
    "title": "Raising a Wizard",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Multi"
    ],
    "fandoms": [
        "The Avengers (Marvel Movies)",
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [],
    "characters": [
        "Natasha Romanov (Marvel)",
        "Harry Potter",
        "Clint Barton",
        "Tony Stark",
        "Steve Rogers",
        "Sam Wilson (Marvel)",
        "Phil Coulson",
        "Bruce Banner"
    ],
    "additional_tags": [
        "Natasha Romanov as the youngest Evans",
        "Natasha is Harry's bio aunt",
        "co-parenting avengers",
        "Harry is raised by the avengers instead of the dursleys",
        "Harry Potter's childhood",
        "up to book 1",
        "Lots of domestic fluff",
        "Some angst",
        "ok probably a fair amount of angst",
        "Protective Natasha",
        "Protective Clint Barton",
        "Protective Avengers really",
        "Harry Needs a Hug",
        "lots of hugs",
        "Deaf Clint Barton",
        "not super relevant but still",
        "raising a wizard",
        "Young Harry",
        "Background Relationships",
        "Minor Clint Barton/Phil Coulson",
        "Don't copy to another site"
    ],
    "language": "English",
    "series": "Part 1 of Raising a Wizard",
    "published": "2017-06-20",
    "completed": "2017-08-24",
    "words": "28,977",
    "chapters": "10/10",
    "comments": "485",
    "kudos": "8,960",
    "bookmarks": "1,362",
    "hits": "143,720",
    "summary": "<p>When S.H.I.E.L.D. dumps everyone's secrets post CA:WS, Natasha discovers who her biological family was and that she wasn't born Natalia Romanova, but Mallory Evans. When she goes looking for her family, what she finds is a 6 year old Harry Potter and for the first time in her life she has someone who is all her own. Together, with the family she chose, they decide to raise him as their own. This is the story of how the avengers raise a young wizard, and how they teach him and each other how they all deserve the love and comfort having a family can offer.</p>",
    "notes": "<p>Alright so this is something I've been working on for AGES and I've decided to just start posting and hope for the best. This work is inspired by another one and I've posted the link to it below. I will try and post chapters in a timely manner. sorry in advance if it's not as fast as I hope.<br>I do not own the avengers or Harry Potter.<br>Currently there is no major violence or trigger warnings but if anything changes I will post it in the tags as well as in the notes.<br>also, everything is edited by me myself and I, so all mistakes are my own.<br>I hope ya'll enjoy!</p>\n<p>this may actually be nearing the end of this fic? I'm planning on the sequel being like a rewrite of year 1, and we've nearly reached that point. there may be one or two more chapters, but this fic is nearly done!! updates might be a bit slower because up until now I've had everything already written and have just been posting updates when I've stopped in at home but I'll try my best to keep things fairly speedy! <br>once again, big thank yous to everyone who's been reading/leaving kudos/leaving comments, you're what makes writing all of this worth it &lt;3<br>also, here's to introducing Fury.</p>\n<p>Wow! It's finally done. I'm so sorry it took longer than expected. Life got ahead of me. It's super open ended with the conclusion cause I really really want to rewrite the whole series in this verse, but we'll see how it goes. I hope everyone reading this enjoys this final chapter. There may be quite a few mistakes as I wrote it under the influence of pain killers (I just broke my ankle whoops). </p>\n<p>As with all the chapters before, the ideas are mostly mine, but the characters belong to Marvel and JK Rowling.<br>I did borrow a little more directly from Rowling in this chapter but you'll see why. </p>\n<p>Thank you everyone for reading and please continue to comment!</p>",
    "text": "Natasha wasn't one to talk about her past, partially because there were things that she'd done, or that had been done to her, that she didn't want to talk about. The other part, was because she didn't remember. There were a couple of reasons for her lack of memory; or so she assumed. One, was that there were some things that the brain forgot, whether you wanted it to or not, the other though, was because the memories had been removed. It was no secret that the ones who'd trained her in Russia had been less than kind, but now, as Natasha read through her own history, her own list of secrets that she'd released to the world, she couldn't help but feel a slow burn of fury sliding through her veins like fire. She stared at the photo she'd found of a beaming, average sized family. There were two attractive parents, a beautiful red-headed woman with bright green eyes holding a small child who could only be a year at most. Beside her, an arm wrapped around her waist was the father of the children, a man with strawberry blonde hair, blue eyes, and an equally wide smile as his wife. The other two children were older; probably four and six. The four year old stood in front of her father, his hand on her shoulder, bright smile on her face with bright green eyes that matched her mother. She was a beautiful, smaller duplicate of her mother, and Natasha allowed herself a small smile in response to the one beaming out at her from the photograph. The older of the two stood in front of her mother, with dark brown hair, and blue eyes. Despite the visual appear of the rest of the family, the dark haired girl had sharp, almost austere features, and despite the grins of her family around her, that girls smile was tight, as if she resented those around her. \n“The moment we saw everything was out I had Skye go through our records – she hid the most important things – like this. Wiped it from the databases. Except for our copy, of course.” Natasha looked up at her former handler, now director of S.H.I.E.L.D. and nodded. She still wasn't happy with him; hiding his status that he was alive; but she understood and that's why she didn't hate him. Clint on the other hand, while he still understood, was far more upset than a simple apology could fix. Not that Natasha had forgiven him, just stopped being furious.\n“She's good.” Phil Coulson smiled, and she recognized the pride in that smile as something similar to what a father would have for their child. \n“Yes, she is.” he looked down at the photo then as well, frown now marring his features. “The baby, that would be you. Born Mallory Evans, you were kidnapped from the hospital shortly after this photo was taken. You were there for a routine check up. The doctor who'd pretended to be the replacement for the doctor who should have been on call, stole you, leaving no trace. Of course, we know now who he worked for, but then, we had nothing.” Natasha nodded, not wanting to dredge up those details. \n“Are any of them still alive?” she asked, voice carefully neutral, but a part of her couldn't help but ache for the possibility of a family. \n“Your biological parents both died of old age. Your oldest sister, Petunia, is alive and lives at number 4 Privet Drive, Little Whinging, Surrey with her husband, Vernon Dursley, their son, Dudley Dursley, and your mutual nephew, Harry Potter.” at the mention of a nephew, Natasha's gaze flew up to meet Phil's, draws pulling together. \n“Why is our nephew living with her?” she asked, and Phil sighed.\n“It would seem the younger of your two older sisters, Lily, and her husband James, both died on October 31, the year their son was born. Official reports say it was from a car crash.” he broke off and Natasha lifted a brow.\n“And the unofficial reports?” Phil could only shake his head.\n“That's part of the problem. We honestly have no idea. All we know is that they died, and since Mallory Evans was declared dead after 5 years of searching with no luck, Petunia Dursley was the only living relative who could claim custody of Harry.” Natasha nodded, eyes returning to the photo again. Despite the fact that the only living relative in the photo was the girl with the jealous smile, she still wanted to meet her, as well as her two nephews. They were the only ones that were hers by blood, and she'd be damned if she'd pass up the opportunity to at least meet them.\n“We're sure Privet Drive is their current address?” she asked, and Phil nodded.\n“Yes. We're sure.” he paused, watching her. “Do you want me to call Barton?” though part of her wanted just that, to have her partner as back up, she shook her head and Phil nodded, turning away and moving back towards his desk before settling behind it to flip through some files. He looked up and smiled at her as she stood. “Enjoy your flight. Keep me posted.” it was such a mundane phrase that Natasha couldn't help but smile. She moved around the desk, leaning down to press a kiss to his cheek.\n“Thank you.” she murmured, and behind the two words, were his forgiveness. He gave a nod, and a relieved smile, and with that, she left. \n \nIt took her only a day to arrive in London and book a hotel room. She booked it for a week, having no idea how long she'd be staying. It's not as if she could go on any assignments with S.H.I.E.L.D. being down. Once the room was settled, she rented a car, having decided to drive to Little Whinging. She'd considered calling in advance, but really, she wasn't sure if she'd meet them today or just canvas the area. It was a Saturday after all and she had no real way of knowing if these people she wanted to meet were even home. That's how she found herself driving through Little Whinging and down Privet Drive. She saw a car in the driveway at number 4 and before she could stop herself she pulled into the drive, parking the silver sedan she'd rented. She could feel the eyes of of the neighbours on her the moment she stepped out of the car and it made her skin crawl. She hated suburbs. Even so, she gave a cursory glance around; counting the neighbours who were watching, noting that despite their sharp eyes, all of them were nosy rather than professional. She made her way up the walk, knowing even from her quick inventory of the neighbourhood that her jeans, t-shirt, and leather jacket were probably not appreciated. She reached the door and knocked immediately, the stares of the neighbours already proving far too irritating to allow to linger, and was therefore not surprised when the door opened almost immediately. Despite how often she'd stared at the photograph on her way to England, Natasha still hadn't been prepared to come face to face with one of its occupants. In front of her, Petunia was tall, slim, and severe, with features that had aged to look more horse-like than in the childhood photo. She had black hair in tight curls on the top of her head, and though obviously aided a bit with product, Natasha could tell the woman had hair that curled much as her own did. She was momentarily glad she'd allowed the curls to remain instead of straightening it as she'd been prone to do lately. That positive feeling however quickly faded when Petunia finally spoke. Natasha knew the woman had recognized her, had seen the horror, surprise, jealousy, and finally disbelieving suspicion. This family reunion obviously wasn't going to be as pleasant as Natasha had hoped, but she pushed the thought aside.\n“Who are you?” the words were sharp but spoken softly, as if afraid of being overheard. Natasha suspected that was probably the truth.\n“My name is Natasha Romanov, but I was born Mallory Evans.” Petunia stared at her for a moment before finally stepping back, hideous green floral print dress swishing around her calves.\n“You'd best come in.” she stepped past her biological sister and into the front hall, eyes doing a cursory once over. She could see the kitchen up ahead, a sitting room to the left, and a set of stairs leading to the second story on her immediate right. Under the stairs was an average cupboard, the only strange thing about it being the small scuff mark right by the corner of the door, which struck her as strange since all the coats were hung up on hooks beside the door. She pushed it aside however in favour of looking around the rest of the house. As she followed Petunia towards the kitchen, she heard the sound of a TV playing, and found the man who must have been her sister's husband, Vernon Dursley, sitting in an armchair in front of the television in the small living room space next to the dining room table, across the from kitchen. Even as they stepped into the kitchen, she saw a flash of movement out of the corner of her eye, and as she was ushered into the living room and into a seat next to where Mr. Dursley sat, Natasha heard the soft sound of a door opening and closing. She hid a frown since most of the doorways seemed to have no doors, but she supposed she could have heard a door from upstairs. She could feel both sets of eyes on her, and so she decided to introduce herself to the husband this time.\n“Hello, my name is Natasha Romanov, you must be Mr. Dursley. It's a pleasure.” she said, keeping it friendly, and the man nodded, eyes narrowing shrewdly as he looked up at his wife who hovered behind his chair. When he didn't make any move to answer, she continued. “I recently found out that I was born Mallory Evans.” and at that, both sets of eyes snapped back to her. \n“Do you have any proof?” it was Mr. Dursley who asked, and though Natasha found him repellant; from his round, sausage body, to his walrus moustache and his beady eyes, she reached into her pocket for the photo. \n“You probably saw on the news that in America, the government agency formerly known as S.H.I.E.L.D. collapsed, releasing all of their secrets out into the world in order to attack the group originally founded during the second world war known as Hydra.” both husband and wife nodded, though they looked much more skeptical. “I was an agent of S.H.I.E.L.D. so when the agency went under, and all it's secrets were posted online, mine were as well.” she paused, wondering how much information she should divulge considering they would be able to find most of it themselves if they so much as logged onto the internet, but she gave an internal shrug, moving on. “A friend of mine managed to find certain details about my childhood that even I hadn't known before, and also, luckily, managed to hide them before anyone else could see them.” she hoped her tone let them know just how dangerous those other parties could be. “I won't lie to you.” she said abruptly, fingers toying with the edges of the photograph. “I was part of the team that posted all the secrets online, and there were a lot of secrets that I had a hand in.” she shook the thought away, finally offering the photograph to Petunia, only lifting a brow when Vernon reached for it, immediately pulling his hand back sharply and allowing his wife to take the photo. While Petunia stared at the photo, Natasha stared at her, noting every slight change in expression, including both the sadness and resentment. Finally, Petunia handed the photo back.\n“You look just like our mother.” Petunia said, and it was an obvious concession. \"And Lily.\" The name was said hesitantly. \"Your face is sharper than hers was, like fathers – but otherwise, you look just like her.” Natasha heard the slightest tremor in her voice, proof that the sadness was for her lost parents – but that didn't quite explain the resentment – unless it was something as simple as jealousy over physical beauty. Natasha was very aware that she herself was beautiful, and the same could not be said about her sister. \n“Thank you.” she replied, despite the thoughts swirling around in her thoughts. \n“I have some photographs.” Petunia said next, and though her gaze darted to her husband, she seemed resolute in offering them. \n“I would very much like to see them.” Petunia hesitated once more, hands all but wringing together as she glanced once more at her husband before nodding and hurrying away, the hideous dress swirling around her calves again. \n“She was an odd one, that Lily.” Vernon said, as soon as his wife was out of earshot, his beady eyes fixed on her face. “Her and that good for nothing husband of hers.” there was a soft sound from down the hall, too close to have been Petunia, but there wasn't anybody else in the house that she'd seen.\n“Are Dudley and Harry here?” Natasha asked, and though Vernon looked surprised, he still managed a sharp,\n“No.” lie. Natasha was an expert at lies, and she knew when she saw one. With a quick glance around, she saw the photos of a round boy, clearly the son of the man sitting across from her, and yet none of another boy, none that could be their shared nephew. She kept the knowledge to herself, however, turning instead as she heard Petunia returning, appearing with two dusty albums in her arms. \n“These are the only two family albums that were left of our parents.” Petunia admitted, and again there was that mix of sadness and resentment. “The rest were lost in a fire.” Natasha didn't pursue the subject, happy to just flip through the albums that existed since they were more than she ever thought she'd get. At Natasha's request, Petunia finally sat down beside her, going through the photos with her, since as Natasha had pointed out, they would be meaningless without the background only Petunia could provide. Though it felt like they spent hours pouring over photos, and Natasha felt a nostalgia for the family she could have had, they were all too rudely interrupted by the door banging open.\n“Mum!” the voice was rude and demanding and Petunia all but leapt to her feet, rushing towards the front door.\n“Dudley! You're back early? Are you hungry? Thirsty? Let me get you something to eat.” Petunia's voice all but crooned, and Natasha couldn't help but be surprised by the sudden difference in the other woman's personality. \n“I don't want food, mum. I want Harry to come out and play.” the words were said with a sneer, but they had Natasha's attention. Harry had been here all along? She knew both boys were supposed to be 6, and yet what 6 year old boy could remain silent for all this time? She got to her feet, and when Vernon stood to try and stop her, she let her gaze go icy. \n“I'd like to meet my nephews.” she said sweetly, but her eyes, she knew, were cold. Even as she spoke, she heard the same familiar door sound that she'd heard earlier, opening and closing before she could so much as get past Mr. Dursley. Despite the obvious terror her glare had instilled, the man still managed to look smug that she hadn't been able to witness whatever he'd wanted to hide. Natasha was beginning to suspect it was their shared nephew.  \n“I can't come play, Dudley. Our aunt is here. Aunt Petunia's sister.” the words caught Natasha off guard. Though she'd just referred to the two boys as her nephews to the man she supposed was her brother-in-law, that didn't change the shock she felt at hearing herself be referred to as aunt. It implied a tie she hadn't even really realized she'd had. \n“Aunt? The only sister mummy had is dead.” the boy sneered, and the complete disrespect had Natasha swinging around the corner.\n“Last time I checked I was very alive. But you're welcome to judge for yourself.” she smirked at the shock on the rounder boy's face, but she didn't miss how Petunia's face went ghastly pale, eyes darting to the smaller boy and in turn drawing Natasha's gaze. The boy had round glasses propped on his face and black shaggy hair that hung nearly in front of his glasses. Despite how the boy pushed it back in order to see her, it didn't seem tameable, immediately moving back in the way. \n“Who are you?” the rounder boy, Dudley finally demanded, cheeks going pink with rage at having been embarrassed, ignoring the mother's attempts to calm him.\n“Natasha Romanov. I'm your mother's youngest sister.” she replied with a smirk, but her eyes were unable to help but be drawn back to the slighter boy. The longer she looked, the angrier she got. He was so skinny she could practicality see his bones through his pale, almost sickly skin, and the clothes on his frame were at least 3 sizes too big, if not more. He seemed to be swimming in the clothing, the cuffs of the trousers rolled up, the t-shirt sleeves hanging down to his elbows. “You're Harry.” she stated, and the small boy just glanced at his other aunt before finally giving a nod. “And you heard who I am?” again there was another nod, but then he finally spoke.\n“You're my mum's sister.” Natasha didn't miss how Harry referred to her in relation to his mother, despite the fact that she knew Harry's parents died when he was only a baby. She nodded, and once again her eyes fell on the only door within sight inside the house, the one that lead to the cupboard under the stairs. \n“Were you hiding under there?” though Petunia had managed to keep her son quiet until then, he finally didn't seem to be able to help himself.\n“No. That's where the freak sleeps.” Petunia went absolutely still, eyes widening in horror as she glanced over at Natasha, but Natasha was looking at Harry, who hadn't even flinched, just look resigned. \n“Freak, huh? You know, the person I trust most in the world is considered a freak, and because of it he's one of the most talented people I know.” all eyes were on her now, and she gave a dangerous smile. “In fact, he's one of the top assassins in the world.” even Dudley went pale at that, and her smile became sharp before she turned back to Harry, softening.\n“Why do you sleep under the stairs?” she asked, and Harry shrugged, though he looked worried, glancing at his aunt, and moments later his uncle who'd appeared in the hallway behind her. It was almost as if they wanted to box her in, and the thought was amusing enough to ignore. \n“I don't know.” he said, though from the way he glanced at his cousin, Natasha assumed it was probably because of the insult, and it made her blood boil. She looked at her sister then, who'd drawn herself up to height, but despite her stern expression, looked frightened. Natasha supposed thats what happened when you said your best friend was an assassin, and she hid a smirk at the fact that they were lucky she hadn't mentioned she was as well. She lifted a brow at her sister, but the other woman actually managed to stand firm, chin jutting forward. \n“You have no idea what it's like. Living with someone of his kind.” Natasha had the sudden urge to slap the woman across the face, but she held back, tucking her hands in her pockets. \n“What exactly do you mean by that?” Natasha asked coolly, and this time it was the husband that answered.\n“He's a freak, that's what he is. Just like his mother and father.” Natasha gave a sharp laugh, shaking her head in disgust.\n“He's a child.” she snapped, before turning her back on him. He wasn't worth her attention so instead she looked at her sister. “Look at him.” she ordered, and watched Petunia's gaze waver towards Harry and then away. “Look.” Petunia's gaze snapped to Harry's face, and she continued. “He's a 6 year old boy who only ever needed your love and affection and instead you put him in a cupboard. You disgust me.” Petunia's head snapped around as if she'd actually been slapped and Natasha watched her imperiously. “I'll take him back to America with me.” she said it before she realized what it meant, but the absolute shock and hope that filled the bright green eyes made it worth it. \n“You can't just take him.” Vernon stuttered behind her angrily, and she gave him a deadly glare.\n“You really think you could stop me?” she knew her words were threatening, knew her body language was too, but she couldn't help herself. This boy was supposed to be their family. \n“You think you can take care of him properly?” Petunia asked, and there was both contempt and – was that hope in her voice? She nodded, and all eyes turned to Harry. On instinct, Natasha crouched down in front of him, so that she looked up at him. His green eyes stared right into her own blue eyes as he waited, obviously anxious.\n“Would you like to come with me?”\n“Leave London?” he asked softly, and she nodded.\n“I live in New York. But we could visit London if you wanted.” his eyes widened, and it told her just how little this child had been allowed. \n“Would I live with you?”\n“If you wanted to, yes.” he seemed to pause, thinking, and Natasha watched the thoughts whiz behind the scratched glasses. \n“I can cook, and clean. I won't be a burden. I don't need much of anything at all, just a bed would be nice, but even just a mattress would do!” it was the most he'd said since she'd arrived, and it broke her heart.\n“Harry, I won't make you work. You don't have to cook or clean, just take care of yourself. And you'll have your own bedroom.” she added, shooting a glare at her sister and her husband. Harry's eyes were impossibly wide, but then he seemed to deflate, looking back towards his aunt and uncle. \n“It would make coming back hard.” he said finally, and Natasha stood then, running a hand of her own through his mess of hair. \n“You wouldn't have to come back.”\n \n \nNatasha stood in the doorway to the hotel bedroom, staring at the boy as he slept. It'd been a long and exhausting day for the both of them. Though it'd been clear that Harry was wary of her, his home life was obviously bad enough that the offer from a complete stranger was enough to send him running, and she hadn't been shocked when he'd asked to leave with her. The ensuing reaction had only come as a mild surprised, though equally as irritating. \n“I'LL CALL THE POLICE!” Vernon had been shouting, but the moment he'd tried to touch her, he'd been on the ground.\n“Do not ever presume to touch me again.” she’d snapped as he stared at her in terror. She’d known he'd hardly even have a bruise, but her goal had been to scare, not injure. “You think my friend is bad, look me up. I'm the Black Widow.” She'd stood straight, looking at her sister.\n“I'll be in touch.” she told her simply, and then offered Harry her hand. When he took it, she lead the way out of the house, and together they drove away. The next couple days had been spent getting the papers in order so that he could stay with her in New York, and shopping for him so that he was no longer in his fat cousin's hand-me-downs. She'd been feeding him way more than he normally ate – obvious to her by the way he nearly went green after eating nearly a whole small pizza, but grinning from ear to ear the whole time. Even if he had been sick, Natasha was sure it would have been worth it. Currently, the boy was taking a nap, but then she'd promised to sit down and tell him about her job and the people she lived with. She left the room, moving to sit in the tiny living room space, putting her head in her hands. \n“Are you okay?” her head shot up, she hadn't even realized he was awake, and the fearful expression on his face had her softening. \n“Of course. Are you?” he nodded, coming closer, fidgeting with his sleeve. \n“I know that children are a bother, so I would be okay with going back.” the words not only broke her heart, but fuelled her hate for the Dursley’s all the more. She stood, moving towards him to put her hands on his shoulders. \n“Having you here doesn't bother me.” she said firmly. “And as long as it's what you want, I would like it if you stayed with me. If you don't, that could be arranged too.” even as she said it though, he was shaking his head.\n“I want to stay.” he admitted. “But I don't want to be a bother.” Natasha looked at the forlorn child in front of her, and before she could help herself, she pulled him in, one hand on his head, the other across the back of his shoulders.\n“You will never be a bother.” she promised, and was rewarded with his tiny arms wrapping around her in return. Then she smirked. “I just hate paperwork.” Harry giggled at that, but his shoulders were shaking too, and she could feel the tears soaking through her t-shirt against her stomach where his face was pressed. Alarmed, she pulled back, dropping to her knees in front of him, checking him over for any sign that she might have accidentally injured him somehow. “What's wrong?” Harry sniffed, tiny fists rubbing at his eyes.\n“You're the bestest person in the whole world.” it took every ounce of self control not to drive back and destroy the people she'd taken him from. Family or not, that a friendly touch could so reduce him to tears, made her see red. She wiped the tears from his cheeks before pulling him in again. \n“I'm going to take care of you.” she vowed, cuddling him close. “I will always keep you safe.” when she felt the tears slow, she pulled back again, giving a soft smile. “I think today we should get you new glasses. I made you an appointment with an eye doctor. Is that okay?” she didn't mention that she'd actually had Phil arrange everything for her, trusting her to get things done while keeping her nephew away from prying eyes. \n“Will you be coming too?”\n“Of course. I'll always be here if you need me.” she couldn't help but wonder where all these promises came from, all she knew was that she meant every one. \n“Let's get you cleaned up then.”\n \nThe trip to the optometrist was easy and they walked out of the shopping centre two hours later with a new prescription for Harry and new glasses to go with them. The frames were still circular, since Harry seemed to actually like them best, though these ones were brand new and not broken. They went out for dinner together at a restaurant they wandered by, and Natasha answered all of Harry's questions on New York. \n“We leave tomorrow?” he asked, seeming both nervous and full of awe for this new place and the new experiences that came along with it. \n“In two days. In the afternoon. We'll be meeting with a friend of mine on the other side.”\n“Who?”\n“His name is Phil Coulson. We met through work, but we became friends.”\n“Do you have other friends?” Harry asked, curious about all these new people.\n“Yes. My best friend is a man named Clint Barton. And then there are the people he and I live with.”\n“Is he your – boyfriend?” Harry asked, having had to pause and think of the word, and Natasha just smiled.\n“No. What I meant was, we all live in the same building, but with our own rooms. Sometimes we all sleep in the same room to watch movies.”\n“Do you sleep in the same room for bad dreams?” Harry asked, voice quiet, and Natasha nodded seriously.\n“If you have bad dreams, you can come and sleep with me you know.” Harry nodded, looking pleased though hesitant. Natasha didn't push it though, steering it to other subjects. She was good at reading people, and this was a time when the subject needed to be more lighthearted. \n \n&gt;&gt;&gt;\n \nThey were having spaghetti and meatballs which Harry was eating with gusto, but that didn't stop the wary looks he kept sending her, a clear sign something was on his mind. \n“What are you thinking about, Harry?” she finally asked, careful to look at her plate so he wouldn't feel pressured by her gaze. She wondered briefly if she'd been too blunt when Harry didn't speak for a moment, but before she could apologize, he spoke up.\n“What am I supposed to call you?” he finally asked, and at that she did look up, noting that he was now staring at his plate, fork idly playing with the food, mouth turned down in a frown. \n“What would you like to call me?” was her first reply, but at his defeated shrug, she continued, thinking quickly. Natasha was a bit of a mouthful, and Nat seemed too adult and therefore too formal – which left the perfect solution, a nickname Clint only used when he was really sick and needed taking care of like a child. It would do perfectly. “You can call me aunt Tasha.” she said, decided, and Harry looked up in surprise.\n“Really?” he asked, hopeful smile on his face, and rather than grow angry once more at the poor treatment he'd previously received, she smiled back.\n“Really. Now eat up. I want to go get ice cream for dessert.” Harry's eyes shined with gratitude and it was later that night after ice cream when Natasha was tucking Harry into bed for a mid afternoon nap that he used his new title for her for the first time. \n“I love you, aunt Tasha.” were his murmured words, said so quietly she knew she wasn't supposed to hear them, but they had a burst of fondness welling up in her chest and she leaned down to press a kiss to his forehead.\n“I love you too, Harry.” and she knew that the words were a bit preemptive. What she was feeling probably wasn't love yet, but she knew that's what it would become, and knew she was willing to feel it for this boy who'd been without it for so long. \n \n&gt;&gt;&gt;\n \nNatasha's head snapped around at the sound of the knock on the door. She'd been sitting with Harry, explaining the basic dangers of her job as best as she could without terrifying the poor boy, but the surprise knock still had Harry's eyes going wide and moving closer to her for safety. Natasha gave him a smile but fingered the knife against her hip as she strolled silently towards the door. Of course, the moment she looked through the peephole, she was relaxing. The door swung open to reveal Clint Barton leaning casually against the doorframe, and his clear blue eyes fell on her the second the door opened before switching to Harry in the room behind her. Everything about her partner softened when he caught sight of the child, and he gave her the barest of smiles.\n“Is he yours?”\n“My late sister's.” Clint just nodded, though she saw his regret in the slight shift in posture. “I'm bringing him back to New York.” she admitted, and she could practically see a puppy-like joy in Clint's eyes at the idea of having a kid around. He really was a huge softie. \n“Gonna introduce me?” She smirked, stepping back to let him in.\n“Harry? This is my friend Clint Barton. Clint, this is my nephew, Harry Potter.”\n“Pleasure to meet you sir.” Harry greeted softly, but Clint made a face.\n“Please don't call me sir. It makes me feel old. And no matter what Nat here tells you, I am only 15.” Harry's eyes went round at the obvious lie, and Natasha just rolled her eyes. “You can call me Clint, since that's my name.” Harry just glanced at Natasha, and now she did smile, moving closer to put a gentle hand on his shoulder.\n“Don't mind him. He really is just a child in a grown-up's body.” Clint just nodded in eager agreement.\n“It's true. In fact, I even have a deck of cards with me for games at all times in case I get bored. Want to play a game?” \nHarry just frowned a bit at the deck of card that seemed to appear out of nowhere. \n“I don't – I don't know any card games.” Clint just gave an easy smile.\n“No problem, I'll teach you. Go fish is a favourite of mine. Come on, your aunt has to make a few phone calls to our boss, so we'll hang out in your room, sound good?” Harry nodded, looking a bit lost but warily excited to learn a new game. As soon as the two of them had left the room, Natasha dropped back onto the couch again, this time pulling out her phone. She dialled the number without even thinking, letting it ring in her ear. \n“Natasha, is everything all right?” the sound of her former handler's voice had her relaxing and replied an affirmative.\n“Everything's fine. We saw the doctor and the optometrist today. Harry's files should be arriving to you shortly.”\n“I've already got them. Just looking through them now.” then there was a pause and she knew it meant he was deciding whether or not to ask his next question.\n“Does anyone else know about this yet?” he finally asked, and Natasha couldn't help her smile. Her boys really were oblivious. \n“Clint knows. He's here. He's entertaining Harry in the other room.”\n“I had a feeling he'd gone looking for you. But he's not actually who I was talking about. I meant Tony or Pepper or even Maria. Someone to prepare things at the tower.” the moment he said it Natasha wanted to groan. It was the very thing she'd been avoiding. \n“Not yet.” Phil made a noise of disapproval.\n“You arrive tomorrow. He needs to have a space ready to receive him especially since everything's going to be so different. I suggest you speak with Pepper. She'll ask the least amount of questions and get the most done for it. Would you like me to patch you through?” Natasha bit back a comment about Phil's secretarial abilities and just sighed.\n“Yes, thank you.” he said a quick goodbye and then the phone was ringing in her ear again, and this time the greeting was much brighter.\n“Natasha! It's good to hear from you. How's London?”\nTogether the three of them got off the plane, Harry sticking close to both Natasha and Clint, clearly feeling safest between them. The two of them didn't let anyone in the crowded airport get too close to him in return, and the way they could both see he was nearly shaking like a leaf made it worth it. That is, until the boy stopped dead in his tracks, face ghostly pale. \n“Harry, what's wrong?” Natasha asked, immediately crouching in front of him, Clint standing off beside her, glaring at anyone who stepped too close.\n“Can't you hear it?” he asked, and Natasha frowned.\n“What do you hear, Harry?” He seemed to go even paler then, leaning away from her. \n“I'm not lying, I swear it aunt Tasha.” she soothed him with a touch to his cheek and a soft smile. \n“I would never think you were a liar. Just tell me what's scaring you.”\n“There's someone close – they keep saying they want to kill. I'm scared, aunt Tasha.” he whispered, and Natasha was already looking around. \n“What does the voice sound like, Harry?”\n“It's a whisper – it's saying it's trapped but when it gets out-” her gaze snapped to Clint's who gave the tiniest shrug, but neither disbelieved him. They both knew quite a few people with peculiar talents and this wouldn't even make it close to the top of the weird list. \n“Girl or boys voice?” Clint asked, and Harry hesitated.\n“I don't know – but it's coming closer.” he murmured, eyes wide and frightened.\n“Do you know what it's trapped in?” Natasha asked next, and Harry shook his head.\n“No – but it's getting closer. It's right over there!” she followed his frightened gaze to a group of luggage trolleys and her eyes immediately fell on a box with small holes in it. She met Clint's gaze again and he nodded. He saw it too. She stood, protective hand on Harry's shoulder and Clint eased his way towards the luggage cart. Even as he reached it, a man rushed over, trying to make him move away, but without even batting an eye Clint managed to dodge around the man and knock the cart over. The large box burst open and a 13 foot king cobra spilled out. The panic was immediate and the snake's hood went wide as the snake lifted itself up, preparing to strike at the first person who got too close. Harry sucked in a breath, and without a thought Natasha lifted his tiny form into her arms, keeping him out of reach of the panicked civilians. Before the snake could strike anyone though, two gunshots rang through the air, the snake collapsing from it's threatening pose into a dead heap. A second later, the man who'd been hiding the serpent dropped as well, this time from a well aimed throw of Clint's fist. He was back beside Natasha in an instant and despite the fact that he knew the snake hadn't been anywhere close to them, his eyes still checked them for injuries. \n“You okay Harry?” he asked, and the boy nodded though he kept his face pressed against Natasha's neck, shaking like a leaf from the scare. Having known the shots hadn't come from Clint, Natasha looked for the one she knew should be behind the gun. He appeared seconds later with a handful of guards following close behind. The guards immediately converged on the snake's corpse and the man while Phil walked directly over to where Natasha stood with Clint.\n“I'm glad to see you made it back safe.” was the first thing he said, and Natasha just shot him a look, carefully setting Harry down when he made it clear that's what he wanted. When he was on the ground again, he looked up at Phil from where he stood partially behind Natasha. “Welcome to America, Mr. Potter.” Phil greeted, offering a friendly smile, and Natasha gave Harry a soft smile when he tossed a nervous glance in her direction.\n“Harry, this is Phil Coulson.” Phil watched the understanding cross Harry's face and he gave a tentative smile, offering a tiny hand. \n“It's a pleasure to meet you, sir.” Phil shook the hand carefully before watching the boy tuck it back in his pocket, looking between Natasha and Clint before moving over beside Clint and taking the man's hand. He watched how Clint reacted immediately, the tension that had appeared with Phil disappearing as his whole self turned to centre around this tiny person.\n“How did you know about the snake?” Phil asked curiously, focusing on Natasha, and didn't miss how Harry tensed and Clint soothed with murmured words of comfort, but he brushed it off as a scare from the dangerous animal. \n“Clint saw movement – with Harry here we decided it was better to be safe than sorry.” Phil accepted the words with a nod. \n“Well, that's enough excitement for today. We should get to the tower before anyone recognizes you.” the words reminded Natasha of just how much harder she'd made her life by exposing those secrets, but looking at Harry, seeing him laugh at the undoubtedly stupid joke Clint had just told him – made it all worth it. So she nodded and moved to take Harry's other hand, leading the way out.\n \n&gt;&gt;&gt;\n \nThey stood together in the elevator, Harry holding Natasha's hand with Clint on his other side, Coulson standing between him and the door.\n“I don't wish to be a bother.” Harry repeated for the fourth time since they'd entered the building, and Natasha was at a loss for what to say. She'd already told him it was fine because they were like a family, but no matter how she'd reassured him, he hadn't calmed. What surprised her, was how Clint then took over.\n“Hey, Harry.” the boy looked up at him, expression pinched with worry, and Clint just gave him a bright smile. “If any of them say anything you don't like, me and your aunt Tasha will kick their asses.” Harry looked shocked before giving Clint a scolding look. \n“It isn't nice to say things like that Mr. Clint.” Clint gave a dramatic wince.\n“Aw, come on kid. I told you. Just Clint is fine. Plus, we're friends, aren't we?” he asked with a sappy grin. Harry gave an embarrassed nod, but none of the adults missed the small smile that accompanied it. “That's what I thought. Well, friends protect friends. Alright kid?” Clint said with the same easy grin, ruffling Harry's hair, and Harry finally relaxed. They reached their floor and Natasha just smiled at her best friend.\n \nThe elevator doors slid open and Harry automatically gave a small, sharp intake of breath, stepping back behind Natasha. Though Natasha had expected the group welcome, she could also understand just why Harry was so uneasy. As they stepped out of the elevator they were faced with the rest of the team lounging in the communal living room but clearly waiting for them. Maria Hill and Pepper were sitting together at the bar, each with a glass of wine in their hands, but the most shocking was that Pepper's feet were bare and she was wearing loose fitting torn jeans and a shirt that obviously belonged to Tony. Tony was on the other side of the bar with Bruce, chattering away happily while he mixed himself a drink. Steve and Sam were sitting together on the couch, listening to the news as they poured over files spread out on the coffee table. The moment the elevator door closed, all eyes turned in their direction and Natasha could already feel the tremors beginning in Harry's hand. \nShe had never been prouder to call Sam her friend than in that moment. He was off the couch in an instant but in the slow and easy manner to make him seem harmless. \n“Hey Phil, Clint, Nat. Good to have you guys back!” he was grinning from ear to ear with his perfect Disney quality friendly grin. “And who's your friend? I'm Sam by the way. It's great to meet you.” Natasha couldn't help but smile at Sam's ability to help and gently tugged Harry forward. \n“This is my nephew, Harry. He's going to be living with me.” Sam didn't even miss a beat, immediately turning the beaming grin on Harry.\n“Wow, that's pretty awesome. Your aunt is a pretty swell gal, little man. Hey – do you like card games? I learned a new one that I wanted to teach Clint, but it's always more fun with more people. Why don't you come play with us?” Harry looked up at Natasha who gave a small nod and then to Clint who gave an agreeable smile before looking back to Sam. Then he finally spoke, small voice carrying in the silence.\n“Clint taught me Go Fish. That was fun.” he said tentatively, looking back at Clint for reassurance, and Clint grinned. \n“Sure was. The kid was a natural.”\n“Great. Come on, cards are this way. We can play Go Fish again if you want.” Sam offered, and Harry just took Clint's hand, giving a surprised squeak when Clint scooped him up and dropped him on his shoulders. The scolding look was immediate but he still threaded his fingers through Clint's hair, giving a little giggle as Clint all but dashed out of the room, Sam on his heels. As soon as they were gone, all eyes turned back to Natasha.\n“So, a nephew, huh?” Tony asked, and Natasha just stared at him for a moment before nodding. That's when Pepper intervened, sliding off her stool and wandering over, giving Natasha a peck on the cheek. \n“Welcome back. Everything's ready, just like you asked. If you need anything else just let me know.” she said, and Natasha gave her a warm smile. \n“Thanks, Pepper.” \n“Wait – what's ready? Why did nobody tell me about this?” Tony was collectively ignored and Steve stood. \n“How did you find out about him?” the question was pointed but kind and Natasha tried to let the tension out of her shoulders but she was already worrying about Harry and the tight muscles wouldn't relax. \n“When S.H.I.E.L.D. fell and everything  was posted to the internet Phil's analyst found as much personal information as she could of our teams and hid it. Our addresses, family. Those sort of things. In all of that she found some details about my past that even I didn't know.” At that she paused, not sure how much she wanted to share, then she decided that they probably knew everything anyways. “As it turns out, my father was not my biological father. I was kidnapped from my family at a very young age and declared dead after 5 years of searching without any result. It turns out I had two sisters, both married with a child. The younger of the two, Lily, died alongside her husband, leaving their son, Harry, to the only living relatives. As a baby, he was left to my other sister, Petunia.” she knew they'd seen her distaste because Steve's eyebrows had winged up. “Their treatment of our mutual nephew left something to be desired.” she said coldly, and she realized her hands had tightened to fists. \n“What happened to him?” Maria asked, frowning between her and Coulson, and Natasha let out a breath.\n“They had him sleeping in a cupboard under the stairs.” she said softly, and the shock in the room was palpable. Phil took over then.\n“The doctor's noticed malnutrition among other things. It would be safe to say Harry has been previously neglected and it will take some time to make up for that.” he looked at Natasha who nodded.\n“I understand that having a child here is a lot of responsibility and I don't expect help from any of you.” before Steve could argue, she smiled and continued. “But I won't stop any of you from being a part of my nephew's life. Just be gentle with him.” she sighed. “The first time I held him, he cried because he couldn't remember an affectionate touch. So be careful with him. And don't ever tell him to do a chore. In his last home he was expected to cook and clean. I want him just to be a child.” there were nods all around and so Natasha finally made to follow the path Clint and Sam had taken. When she was gone, Coulson pulled a file from his coat and handed it to Steve, the others converging. \n“Here are the results of Harry's medical exams.” he said, and there was no missing the dark tone.\n \n&gt;&gt;&gt;\n \nTheir first night in the tower went much as Natasha had expected it to. She put Harry to bed at 8 since that seemed an appropriate time for a 6 year old to sleep and he was exhausted, and at 9:30, Harry had found her in their private living room with Clint. Both had known the instant Harry was out of bed and had waited for him to appear. When he did, it was to hide in the shadows of the doorway, invisible except to those who had been trained to notice such things. \n“Couldn't sleep, kid?” Clint called, and Harry stiffened before slowly coming into the room, shaking his head. Natasha just waved him closer.\n“We were going to watch a movie. Would you like to watch one with us?” \n“I don't want to be a bother.” came the usual reply, so Natasha just slid to her feet, scooped him up, and settled him between herself and Clint on the couch. \n“We should totally watch Robin Hood – the one with the fox.” Clint said, and Harry frowned at him.\n“Robin hood isn't a fox. He's a man. And he's a thief. Thief’s are bad.” Clint just grinned at him.\n“But that's not the whole story, kid. Sure he's a thief, but he's stealing things back from a bigger thief. Cause you see, the prince was taking all the money that everyone had and so nobody could be very happy anymore, so Robin, he took the money back and gave it to the poor so that they didn't have to go hungry.” Harry was silent for a moment as he digested the story then looked to Natasha.\n“Can we watch that, aunt Tasha?” she nodded, pulling him in to cuddle.\n“Of course. Jarvis?”\n“Right away Ms. Romanov.” Harry startled at the voice.\n“Is Jarvis in every room?” Harry whispered, having been unnerved by the AI since he'd first heard it speak to Sam during their game of cards. \n“Yes, but don't worry. He's here to keep us all safe. That includes you.”\n“How?”\n“Jarvis has control of the whole security system, and he can tell you wherever anyone is. If you're ever lost, he can help you get unlost.” \n“Wow. But if he's protecting us, who's protecting him? If he's the whole house he could be hurt very easily.” Natasha smiled down at Harry, amazed by his empathy.\n“Tony protects him. He made Jarvis so he knows how to fix him if anything goes wrong.” Harry nodded and then his attention was caught by the movie beginning. \nHe was asleep by the time the credits rolled, and Clint looked over, carefully removing the glasses from his face.\n“He's a great kid, Nat.” Clint said, and Natasha nodded, smoothing the hair back from his face.\n“I know.”\n“So then what are you worried about?”\n“What if I hurt him – if we hurt him?” Clint shook his head, taking her hand. \n“Nat, he's a good kid. And you're a great guardian. He's going to be okay, and so are you. Plus, from what I heard, between Sam and Pepper you'll have all the information you could ever need.”\n“Phil's been a big help too, Clint.” she replied, and Clint scowled.\n“He also pretended to be dead for a couple of years, Nat.”\n“He's trying, Clint. But your radio silence is hurting him. He doesn't get it, Clint. How could he? You never told him.” Clint just made a face.\n“Yeah well. He was my S.O he should've figured it out.” Natasha just scoffed.\n“идиот.” she said, but it was fond, and Clint's scowl softened. \n“Okay, let's get the little tyke to bed.”\nWhile Natasha had expected Harry to have some trouble sleeping, she hadn't expected it quite to the extent that it was. Although the first night was okay, the next few nights had Harry nightmaring, a fact that kept Natasha up worrying. Of course, despite the nightmares, Harry seemed to be doing really well, the rest of the team slowly warming up to him. Steve had brought him a book to colour in with a pack of crayons and Harry had been so in awe of the gift that the sweetest smile had spread across his face and he'd quickly thanked Steve before running to Natasha, excitedly whispering about the gift. Since then, everyone in the tower had been presented with a drawing. Steve got the first bunch, obvious thank you's for the gift, and he'd put each of them up on his own floor which had thrilled Harry to no end. Clint got the next picture, which Harry had quickly explained was him as Robin Hood because he had a bow and arrow. Clint had tucked the picture away into the case he kept his bow in and promised to keep it forever. Natasha got the next picture, and it had been so sweet that her chest ached. The picture was of her and Harry, both little stick figures, Harry's with big round glasses, Natasha's with bright red hair. They were holding hands in what was supposed to be a flower garden. Above the image in scrawling 6 year old print read 'to aunt Tasha', and then at the bottom it said 'I love you'. His name was signed under it and Natasha had squeezed him in a tight hug, peppering his head with kisses until he was flushing bright red but beaming.\n“I love you too, Harry. Thank you for the drawing. I'm going to put it up on my bedroom wall.” he nodded before immediately scrambling back to his crayons. \nWhat surprised everyone was that the next drawing was for Tony. Though the billionaire hadn't actively avoided Harry, he hadn't searched him out either, and while the rest of the team had tried to include the boy in their lives, Tony had remained consistently distant. When Harry approached him it was hesitant, but with a smile, and he nervously handed him the drawing where he sat at the kitchen table, scrambling onto the chair next to him so he could reach. \n“This is you.” Harry said, pointing at the stick figure with the blue circle on it's chest. “This is Pepper and Mr. Rhodes.”\n“Who's this?” Tony asked, pointing to the shapeless grey blob with a smiley face next to his own character.\n“Jarvis. He's your family. Like aunt Tasha is my family.” Tony was silent at first and then he reached over to ruffle Harry's hair. \n“Nice job, kid. Isn't it, Jarvis?”\n“Indeed, sir. It if a very interesting interpretation of if I had a physical form. Well done, Mr. Potter.” Tony nodded in agreement and stood, walking over to the fridge and attaching it there with a magnet. \n“There. What do you think?” Harry just beamed at him, nodding his own agreement. Then he was off, Tony assumed to draw some more and leaving the billionaire behind, bemused. He turned back, fixing the picture so it was straight, and with a small smile, went back to work.\n \n&gt;&gt;&gt;\n \nThe first incident happened only a week later, and it had Natasha in a panic. She appeared in the common room and had everyone jumping in surprise, immediately wary of the fire dancing in her eyes.\n“Have any of you seen Harry?” there was a beat of silence and then everyone was on their feet.\n“He's missing?” Clint asked, almost instantly as panicked as Natasha, and she winced.\n“I – I can't find him anywhere.”\n“Jarvis! Where's Harry?” Tony demanded, and the pause had everyone's nerves on edge. \n“Mr. Potter disappeared from all of my sensors 20 minutes ago.” Natasha felt instantly ill.\n“Did he leave the tower?”\n“I do not know, Ms. Romanov. Mr. Potter was in the common room 21 minutes ago and then completely vanished.” for the first time she could remember, Natasha felt pure terror. \n“It has to be a glitch. We have to find him.” she snapped, and then she cracked, shouting his name. “Harry!” the others followed suit, combing through the tower, calling out the boy's name. \n \nClint was on the roof, having taken an off chance in searching it, when he heard the sniffle. Moving as silently as he could, he approached the sound, turning the corner to find Harry folded into a small, safe niche, arms wrapped around his knees, face hidden against them, shoulders shaking with tears. Clint made noise then, making sure Harry would hear him coming and wouldn't scare, and though he watched Harry stiffen the boy didn't try and escape.\n“You're a hard man to find, Harry.” Clint said easily, sliding forward cautiously, and Harry curled up smaller. “Hey, whoa there, I'm not mad. I've been worried.” at that, Harry finally lifted his head, and the sight of the tears was heartbreaking. “Aw, kid, come on, please don't cry!” he finally reached him, crouching down next to the hiding spot. \n“I'm sorry.” Harry apologized miserably, and Clint gave a small smile.\n“No apology necessary. How come you're out here?” new tears filled Harry's eyes, spilling over faster. \n“I didn't mean to cause trouble, I swear it!” he sobbed, hiding his face again, and Clint's face fell. He couldn't help himself anymore, he reached out, pulling Harry from his hiding spot and into a hug. \n“Harry, you haven't caused any trouble, except for hiding. Everyone's been really worried. Speaking of-” he touched the button on his hearing aid, connecting to Jarvis. “Jarvis, let the other's know I've found him. He was hiding on the roof.” Harry flinched but didn't try to pull away from his embrace. “Come on, your aunt's worried sick.” the words had Harry crying harder, and so at a loss, Clint stood, Harry curled up in his arms, and carried him inside. He saw Nat the moment she was on the floor and she moved so fast she was practically a blur, appearing directly in front of them.\n“Harry, thank God.” at the sound of her voice, Harry started sobbing again.\n“I'm sorry aunt Tasha. I didn't mean to be a troublemaker – please don't give me away!” Clint could see the heartbreak in Natasha's eyes, watched how her touch faltered. \n“Harry, I would never, ever, give you away even if you did the naughtiest thing you could think of. What made you think you were a troublemaker?” Harry didn't seem to hear the question at first because he'd finally calmed down enough to look at his aunt.\n“Really?” he sniffed, and she nodded. He reached for her with new tears, hugging her as tightly as she hugged him. \n“I'm never going to give you up, Harry. You never have to be anywhere but here. I will never give you away.” she held him tight until he'd calmed down, and that's when Clint finally spoke up.\n“What made you think you were being a troublemaker, Harry?” he didn’t hear the answer at first since his face was hidden in Natasha's shoulder, but then she eased him back.\n“Tony said aunt Tasha looked tired and Jarvis said it was cause I kept her awake with bad dreams and Tony said I was a troublemaker.” As he heard the story, Clint could remember the incident, could remember how Tony had ruffled Harry's hair affectionately and given a smile as he said it, making Clint think nothing of it at the time. Now he realized he'd have to pay more attention. Of course, then he saw how still Nat had gone, how violence shimmered off her skin. The elevator chose that moment to ding, Tony, Steve, and Bruce piling out of it, rushing over to make sure Harry was okay. Before any of them could speak, Natasha had passed Harry to Clint and had Tony pinned against a wall. She was spitting curses in Russian while Tony shouted in pain, and before Clint realized what was happening, Harry was running towards the pair of them.\n“Aunt Tasha! Aunt Tasha! Stop! Stop!” he shouted, the loudest voice any of them had ever heard him use, tugging on her arm as soon as he reached her. Natasha immediately let go, following Harry's touch, though her hand went to a knife. \n“What the hell is your problem?” Tony demanded, and When Natasha snarled at him, Harry tugged her back again.\n“Alright, everyone needs to calm down.” Steve's voice left no room for argument and the room went silent. “Okay. Now, Harry, can you tell us why you were hiding?” Harry fidgeted under everyone's stares, and so Clint stepped in, ignoring Steve's glare that he was supposed to let Harry talk.\n“Miscommunication. Harry thought he was causing trouble.” he cast Tony a pointed look and watched realization hit followed by guilt.\n“Shit – kid. I didn't mean it like that. I was only joking. You aren't a troublemaker.” he looked at Natasha then, and for once there was nothing but humble apology. She stared at him for another tense minute before finally stepping back, taking Harry's hand. \n“Come on, Harry, let's go get some ice cream.”\n“From outside the tower?” came the soft but excited reply, but then there was a pause where Harry looked back. He tugged his hand free of Natasha's and ran right over to where Tony still stood.\n“Sorry for getting you in trouble.” he murmured, green eyes wide with apology. Tony just shrugged, but again gave an affectionate ruffle of Harry's hair. \n“Seems fair. I made you cry first. We're even now.” Harry nodded but then hesitated again, looking back at his aunt. Knowing what he was going to ask, she gave a resigned sigh but nodded. Harry turned back to Tony. \n“Do you want to come for ice cream?”\n \n&gt;&gt;&gt;\n \nNatasha had known there was something different about Harry from the moment she'd taken him from her sister's home, but that didn't make it any less surprising each time something happened. \nClint and Natasha had decided to take Harry to the zoo, Natasha because she'd seen his longing gaze when he'd heard about it on the radio station he liked listening to, and Clint because Coulson was spending the day at the tower and he needed out of there. Though Natasha had given him a scolding look, she hadn't denied his company, especially when he offered to carry Harry around on his back, running the two of them around as if he was also 6. Natasha found it endearing and allowed it to continue. Of course, that's when she noticed the odd things. It happened first in desert exhibit where the sidewinders seemed to show off for Harry who would giggle appreciatively, and again when they saw the rattlesnakes who seemed to actually rattle in response to Harry's awe, but the final incident happened in the rain forest pavilion, when they found the boa constrictor, and at Harry's awed gasp, it moved as if in reaction, slithering over to the glass, lifting itself up as if to look at him. It hissed in Harry's direction and Harry asked to be put down, little hands pressing against the glass, nose millimetres away. \n“You're very beautiful.” Harry murmured, and the snake seemed to bob it's head in answer, hissing back. Clint glanced at Natasha, but Natasha just shrugged. She'd thought it might be possible considering the incident at the airport when they'd first arrived, but there'd been no way to prove it. “You must be lonely, aren't you? I used to be lonely, but then my new family found me.” there was another hiss from the snake and Harry looked nearly apologetic. “I don't know my parents either.” he said softly, and that's when the other kids started gathering, noticing that the snake was moving. Before either Clint or Natasha could react, other kids stormed over, an older boy knocking Harry out of the way. As he was closer, Clint caught him before he could hit the ground, but that didn't stop Harry's hurt glare. That's when everything changed. One second the glass was separating the kids from the snake, and the next moment the glass was gone, the snake sliding out of the cage, menacing hiss escaping it whenever someone was too close. It turned towards where Clint held Harry, offering a hiss before sliding off into the pavilion, and for a moment the three of them just stared at each other before they heard the screams of other visitors and Natasha watched the tears well in Harry's eyes.\n“I didn't mean to.” he whispered, terrified, and Clint lifted him off the ground before the tears could really start to fall. \n“Don't worry about it kid. Know what I think this means? We should go to the pet store.” the surprise had Harry blinking the tears away, and Natasha just smiled. Of course she knew she'd never get angry at Harry for something like this – not when it was obviously not intended, and from Harry's words he'd empathized with how lonely the snake seemed to feel, but if she understood what Clint was saying, if Harry had his own pet, then perhaps he'd be less likely to set free the zoo animals. They left the zoo, avoiding the zoo keepers rushing around to recapture the snake, and soon found themselves in a large pet store, wandering the aisles. Despite their initial idea of what pet they thought they'd end up getting, Harry went right past the reptiles with only brief admiration, and they soon found themselves in front of a group of kittens. As if sensing the sale, a young woman appeared with a bright smile, facing them across the one cage Harry was admiring.\n“Do you see one that you like?” Harry just looked at Natasha who moved forward beside him. Harry then pointed at the smallest one in there, a little black cat with white tipped ears and a white cap on the end of it's tail and paws. It had bright blue eyes and Harry seemed charmed by it. Natasha nodded at the woman, motioning at the cat and watched as she gently brought it out of the cage. \n“She's brand new.” the woman told them. “A friend of the owner, her cat just had kittens but they didn't have space for them so they donated them here.”\n“She's beautiful.” Harry said softly, eyes lit up with wonder, and the woman agreed. \n \nOne hour later, Harry carried his new kitten into the tower, same expression of awe on his face. \n“What are you going to name her, Harry?”\n“Lily.” he said, without hesitation, and once again Natasha felt her chest tighten. \n“That's a really pretty name.” \nThe first time Harry was sick under their care, it took days for anybody to notice because Harry worked so hard to hide it, and they only noticed because the kitten drew their attention. Despite the fact that Harry didn't need naps anymore, it wasn't unusual for him to disappear for the afternoon, dozing off in his room with a book or a movie and so nobody thought anything of it until the kitten caused a scene. Clint was alone with the boy since Natasha had to go into headquarters that day, and he'd been watching TV in the living room while Harry presumably did something similar in his bedroom, but that's when the kitten started. First it was just a soft tap of paws against a door, but soon the mewing started, and when it turned into soft cries, Clint stood, frown in place, heading for Harry's room. He scooped up the kitten when it looked up at him mournfully and pushed open the door after he knocked with no answer.\n“Hey, Harry, you forgot Lily in the-” his sentence broke off when he saw the boy, pale and sticky with sweat, hair stuck to his forehead. He was buried under the blankets, sniffling, boxes of tissues piled on one side of him, a garbage bin next to his bed. From the looks of it, Harry had been hiding his cold for days until he couldn't any longer, but what it meant was it had turned into a full blown flu. \n“Aw, kid, no.” Clint complained softly, knowing that Natasha would be pissed that he hadn't noticed sooner. Making sure not to be too loud, he approached the bed, reaching out a hand to check Harry's temperature. He had to resist the urge to yank his hand back with a hiss, but he still winced. “Jarvis, I need flu medicine for kids. And stat.” he sat on the bed, settling the kitten down at the end, and watched as Harry's eyes blinked open slowly, turning to look up at him miserably.\n“Uncle Clint, my head hurts.”\n“I'm not surprised, kid. Why didn't you tell anyone you weren't feeling well?”\n“I didn't want to be a bother. And I wasn't feeling that bad. Just a little bad.” Clint just shook his head, standing up to head to the bathroom to get a cold cloth, but that's when Harry's hand snaked out to grab his, and when Clint looked down he saw fear in Harry's eyes. “I'm okay, it won't last long I promise. Please don't tell aunt Tasha. I didn't mean to get sick.” Clint dropped back down on the bed, making sure his touch was as gentle as possible as he pushed Harry's hair away from his face. \n“It's okay that you're sick, Harry.” Clint said, and then he frowned. “Well, no, it's not good that you're sick because I'm sure it feels pretty awful, but it's okay to get sick sometimes. It happens to everybody.” then he smiled. “Well, everybody but Steve.” that had Harry cracking a tiny smile. “But we have to tell you're aunt or else she'll be worried. She won't be mad though, promise.” the smile dropped into a frown as Harry clearly thought it over, but then he finally nodded. \n“Okay.” but he clearly had more to say so Clint waited. “Will you stay with me?” the request was whisper quiet, but Clint just offered his most comforting smile. \n“Of course. I'm just going to go get some stuff to help you feel better, okay? I'll be right back.” Harry nodded, finally letting go of Clint's hand, and Clint ducked into the bathroom, filling up a cup with cold water and soaking a cloth at the same temperature. \n“Jarvis?”\n“Yes agent Barton?”\n“Who else is in the building right now?”\n“Miss Potts and Doctor Banner.” \n“Are they busy?”\n“Miss Potts is filing paperwork for the new building Master Stark wishes to acquire and doctor Banner is in his laboratory reading a book on astrophysics.”\n“Great. Can you call Bruce for me? Let him know the kid's sick and I need help 'cause I can't leave him but I need some soup for him, and some ice and that medicine.” \n“Right away Agent Barton.”\n“Thanks Jarvis.” Clint returned to Harry's side then, and offered a smile when the relief was clear on Harry's features. He'd obviously been afraid that Clint wouldn't come back. “Alright come on let's sit you up. You need to drink some water.” the boy groaned but didn't fight Clint when Clint pushed back the covers and gently pulled the boy up, helping him sip at the water. When the glass was empty, he sat it down and reached for the cloth. “Alright, now I'm going to put this cloth on the back of your neck, okay? We need to get your temperature down. It's going to feel really cold. Are you ready?” Harry nodded, expression miserable, but he hardly even moved as the cloth lay against his skin, leaning fully against Clint. “You okay, Harry?” Harry nodded, but it was clear he didn't mean it so Clint gently eased him back so he could see his face again. “Hey, it's okay not to be okay, but you gotta tell me what's wrong, kid, or I can't help you and you'll be sick even longer.” He watched the tears well in Harry's eyes, but they didn't fall, he just nodded. \n“My head hurts. And talking hurts. And breathing hurts. Coughing hurts. Everything hurts.” Harry admitted, and Clint winced in sympathy. \n“Mr. Potter, Agent Barton, Doctor Banner wishes to inform you that he's on his way to your location with the requested supplies.” \n“Great, thanks Jarvis.” \n“Of course, Agent Barton.”\nWhen the reply came, Clint lifted Harry off the bed despite his mild protest, sitting him on the small sofa a couple feet away.\n“What are you doing?” Harry asked, obviously confused as Clint started to strip his bed of all it's sheets. \n“You can't keep laying in these sheets, Harry. They've got all your sick germs and stuff. We gotta wash them. We're gonna hang out in the living room.” Harry just frowned.\n“But that will be in everyone's way.”\n“Nobody will mind, isn't that right Bruce?” Harry's head whipped around in surprise and then he groaned, hands pressing to his temple. Both adults winced in sympathy. \n“Clint's right, Harry. None of us mind. It's easier for us to keep an eye on you that way. Make sure you're getting better.”\n“But why?” Harry finally asked, face pinched in confusion, and Bruce frowned at him. \n“Why what?”\n“Why do you need to keep an eye on me and make sure I'm getting better?” he repeated, and now both men were frowning at him. \n“Why do you think we're doing it, Harry?” Bruce asked instead of answering, approaching with the soup and passing it to Harry. When his hands shook with the effort to hold it, the doctor gently helped lift it to his lips, watching as he drank it down as if he'd been starving. As soon as he was done, he curled in on himself, clothes sticking to his sweaty skin, face drawn and pale and eyes practically luminescent. \n“Because if I'm sick for too long it'll cause you all trouble.” Harry said, and Bruce shook his head, looking at Clint who was staring, looking like Harry had just punched him right in the stomach. \n“Kid, no.” Clint responded vehemently, “It's because we care about you. We want you to be better because you look miserable and none of us want that, we all just want you to be healthy and happy.” Harry shook his head but didn't respond. The only benefit being he didn't argue it either. “Now come on. We have to get you out of these clothes. You need some fresh pj's.” Harry just glanced at Bruce who was immediately on his feet.\n“I'm going to go get some blankets set up in the common room. Ask Jarvis to queue some movies and make some more soup.” with that he left, and Clint approached Harry slowly, bringing new pyjamas. \n“What's on your mind, kid.” Clint asked even as he helped shaky limbs out of his sweat soaked clothes and into the new ones. \n“When I used to get sick aunt Petunia would leave medicine and soup next to my cupboard. It was usually cold and I hated the taste but it made me better very quickly. And she didn't let Dudley bother me for a day. That was always nice.” It was the most Clint had ever heard Harry say about his old family, and it bothered him that Harry was so grateful for such poor treatment. \n“You know what else is nice, Harry?” Harry shook his head so Clint just crouched down in front of him, offering his back. “Piggy back rides. Come on. Time to get out of here while the windows are open to air it out.” Harry leaned forward, clinging to Clint's back, face pressed against the top of his spine and though the heat coming off him was nearly blistering, Clint didn't miss the feel of the cool tears against his skin. \n“Uncle Clint?” Harry said softly as Clint carried him out of the room, arms hooked under Harry's scrawny legs. \n“Yeah, Harry?”\n“I love you.” Clint felt a lump in his throat but he just gave the boy's legs a gentle squeeze.\n“Love you too, kid.” \n \nNatasha came home to find Bruce puttering around in the kitchen, the smell of chicken noodle soup filling the air. Her eyes caught sight of the many bottles of water and extra hydrating juices and frowned. \n“Who's sick?” she asked, and Bruce turned in surprise, frowning at her. \n“I thought Clint called you.” he said, but before she could question that, Bruce waved towards the common room. “It's Harry. We finally got his temperature down, he's asleep with Clint on the couch.” she was moving before he'd even finished speaking, stopping in the doorway of the common room to see Harry bundled in blankets against Clint's side, head pillowed on Clint's chest and the archer in question fast asleep, arms wrapped carefully around the bundle that was Harry. She knew that if she left them like that Clint would wake with a sore neck, but the picture they made made her want to leave them be. Instead, she took a photo with her phone before slinking forward to wake Clint. The archer woke the moment her fingers brushed his shoulder and he blinked at her a moment before wincing.\n“Aw man, sorry Nat. I meant to call you but I got a bit distracted.” Natasha shook her head, giving a smile.\n“It's fine. How is he?”\n“Well his fever's down but I think he's got the flu. I practically had to drag it out of him but he's all achy and he's only been able to keep liquids down. If it goes on too much longer we should probably call a doctor.”\n \nWhen Harry woke up, he found himself with his head resting on his aunt Tasha's lap, his legs thrown over his uncle Clint's. His aunts fingers were combing through his hair and when he turned to look up at her she offered him a smile. \n  \"How do you feel, Harry?\" He blinked up at her again, feeling unsure, but a glance at his uncle who gave him an encouraging smile and he spoke up. \n  \"Everything still hurts.\" He admitted, frowning at how his throat felt like sandpaper. Recognizing the expression, he found a bottle of water pressed into his hands and he gulped it down. \"I feel a little better though.\" Rather than be upset like he expected, his aunt just smiled at him. \n  \"Thank you for telling me.\" Harry just nodded. He still didn't understand why they were so worried - but he supposed aunt Petunia and uncle Vernon had been worried when Dudley had been sick - he frowned at the thought, unsure how he felt about comparing himself to Dudley, but since his aunt Tasha and uncle Clint were nothing like the Dursleys he supposed it was alright. \n  \"Will you stay with us?\" He found himself asking, and his aunt leaned over to press a kiss to his forehead. \n  \"Always.\" Harry smiled, and cuddling back in, fell right back to sleep.\n \nThe next time Harry woke up, he found the room a lot more full than it had been the last time. Tony, Bruce and uncle Steve were also all in the room and he found himself staring in surprise. \n  \"I don't mean to be a bother.\" He said and found all eyes on him.\n  \"Looks who's awake!\" Tony exclaimed, and Harry realized he was still tapping away on a tablet despite the fact that he wasn't looking at it but at Harry. \"How are you feeling, kiddo?\" Harry blinked in surprise at the endearment. \n  \"I feel much better, thank you Tony.\"\n  \"That's uncle Tony to you,\" Tony corrected, and earned a bemused look from Harry. But before he could say anything Tony was speaking again. “I already had Jarvis order a whole box full of chicken noodle soup for you since your uncle Clint said you liked it. Once you're better, you can graduate from soup to rice.” Harry just blinked, perplexed, but seemed willing to go along with it.\n“Thank you T- uncle Tony.” Harry corrected himself, and Tony beamed. \n“If you're hungry now, we've already got some soup warmed up for you.” Harry hadn't realized how hungry he was until food was mentioned and immediately moved to sit up, struggling for barely even a second before both his aunt Tasha and uncle Clint had helped him up. He didn't even have to ask before a cup was being pressed into his hands, kept from spilling by his aunt Tasha's hands over his own. The soup was guided to his mouth and as he started to notice the room around them he realized that it was a children's movie on the television, and it was one he liked. The soup made his tummy feel very warm, but the warmth in his chest was for the people around him. For some reason they were choosing to take care of them just because they wanted to, and he loved them for it. He felt the tears before he could help it and felt his aunt Tasha's fingers brushing them from his cheek. \n“What's wrong, Harry?”\n“Nothing, I love you.” \n“I love you too, Harry.” and Harry just smiled, settling in to watch the movie, the warm feeling never leaving.\n \nThe first time both Natasha and Clint had to go to work was a hard day for everyone. They'd had to leave before Harry was even awake and despite Natasha's distress, the situation couldn't wait. Phil's team had gotten into some trouble and there were very real chances that if the two assassins didn't leave immediately their old handler would die a very real death this time. It was Sam who'd pushed her out the door, assuring her that he'd be around all day and that him and Steve would take care of Harry until she got back. Though reluctant, she'd managed a nod before disappearing. \nIt was nearly 3 hours after she'd left that Harry woke up and wandered into Natasha's living room where Sam and Steve sat together, going through some files. They both looked up when Harry's sleepy form wandered in, tiny fists rubbing at his eyes behind his glasses, black hair sticking out in every direction. He was terrifyingly adorable and fragile looking, his fragility made all the more clear when he realized it was not his aunt waiting for him. The moment he looked up his bright green eyes widened in surprise and just a hint of fear at not seeing his aunt but instead two burly men who despite having always been kind to him had never been there in this space in this capacity before. Before the hint could grow to real fear though, Sam spoke up.\n“Good morning, Harry. Sorry for the surprise, I know you're not used to seeing us in the morning.” at the words Harry blinked in surprise but seemed to relax marginally as soon as the problem at hand was addressed. He was still wary, of course, but the fear had dimmed behind curiosity. “Your aunt Nat and uncle Clint had to go to work really early. It was an emergency but they should be back tonight. Would you like some breakfast? I make really good pancakes.” He continued brightly, but the fear had returned.\n“Her work is dangerous.” he said softly instead, and there was a wobble to his lips that threatened tears. “An emergency means extra danger.” Steve didn't know what came over him but before he could help himself he was up and around the coffee table, crouching down low in front of Harry. The boy started at the motion, but didn't retreat any farther than his initial flinch from the quick motions. \n“Hey, I know your aunt told you all about her work, but you don't have to worry. Her and your uncle Clint are the best of the best. And your aunt loves you very much. She'll always come back to you.”\n“But why did she leave?” he asked, and though the tears had receded, the lip wobble hadn't. \n“Phil Coulson's in trouble. He needed their help.” at the words Harry finally nodded, shoulders sagging a bit with understanding. \n“He's one of her best friends.” Harry admitted, and Steve nodded. \n“Exactly. She's just gone to get him. That's all.” Harry nodded, tiny hands rubbing at his eyes again as if trying to rub away the tears that had threatened to overwhelm him. “Hey Harry?” the boy met his gaze and though the tears had abated he still looked wary. “Is it okay if I hug you?” the boy looked surprised by the question but then he nodded and Steve leaned forward, pulling the small body into a comforting hug. He felt a moment of terror that he might accidentally break the small boy but he forced the thought away, trying to share all the comfort he could. When he made to pull back, however, Harry wouldn't let go, and so rather than force the issue, Steve just stood, keeping Harry close. The boy gave a small gasp, shifting a bit to see and that's when Steve felt the cool touch of tears on his neck, understanding now why the boy hadn't wanted to let go. He gave a gentle squeeze before nodding Sam towards the kitchen. \n“Come on, Harry. Let's get some breakfast. I hear you like chocolate chips. Well Sam wasn't lying when he said his pancakes were the best, and I bet if we ask real nice he'll make chocolate chip pancakes for us.” there was a small giggle followed by a sniffle and it comforted Steve into knowing the kid would be okay, but he avoided Sam's knowing gaze. He knew what his friend would say, that he was now latching onto Harry to focus on since they couldn't find Bucky, but he refused to think about it. Not when this tiny child needed his help. \n \nThe day went better than Steve had expected. Not that he'd expected that day to go poorly, but in the grand scheme of things he knew nothing about children and he'd been worried he'd somehow manage to scar the boy. Harry, on the other hand, had been quite content to stick to Steve's side.\n \nThe day had started with Steve feeling bad for the boy who always seemed to be ferried around to shield or avenger owned property and so he had Jarvis find them an old fashioned pizza parlor for them to visit for lunch - because Steve still missed things from his childhood and he knew Harry loved pizza. He'd invited Sam along too, but his friend had gotten a strange look in his eyes before waving them off. So he'd helped Harry pick out some clothes and then watched how the boy tied neat little bows on his shoes and together they'd left the tower. Stepping into the bustling streets of New York, Steve didn't think twice before scooping Harry up and out of the way onto his shoulders. His baseball cap was in the way so he pocketed it, hoping that without his uniform nobody would recognize him. It seemed he didn't have to worry because the crowd just ignored them and with a breath of relief, Steve made his way through the city, Harry on his shoulders, tiny fingers caught in his hair. He liked this anonymous feel - liked being able to walk around and enjoy everything the city had to offer without being swarmed by the press, and though Harry didn't have those things to worry about, he seemed to be enjoying himself just as much.\n  \"Oh wow! Look at what that man is painting!\" Harry exclaimed, bouncing slightly with his excitement, and Steve grinned, making his way over the the street artist spray painting galaxies on cardboard. It was amazing and Steve didn't even hesitate to buy a small one, handing it up to Harry who oohed and awed with the infectious excitement of a child. They made their way through the city like that, following whatever caught Harry's eye, and ended up with a small bag full of trinkets and prints and when they finally reached the pizza parlour and found a table Steve and Harry emptied out the bag to look at it all. As Harry looked at it all, touch reverent, he gave Steve the most awed look.\n  \"Thank you.\" He said, and it was so sincere Steve could all but feel it in the air. \n  \"You're welcome.\" He watched the boy marvel over the trinkets as he ordered their pizza, eyes bright with wonder, and Steve could understand now why Natasha had been so forceful in telling them to be gentle. When the pizza was brought to their table, Harry's eyes went even wider. \n  \"Wow. This is all for us?\" He asked, and Steve nodded. \n  \"It is. Come on, lets get this stuff away so we can eat.\" They ever so carefully replaced everything into the little bag before they started to eat. Once Harry looked full enough to burst, Steve just smiled at him across the table. \n  \"Where would you like to go this afternoon?\" And Harry looked about ready to swoon with happiness, grinning from ear to ear. \n  \"You pick, uncle Steve.\" He decided with that same grin, and so Steve nodded. \n  \"You got it, Harry. Ready?\" Harry nodded, standing on his chair and reaching for Steve. \n  \"Ready!\"\n \n&gt;&gt;&gt;\n \nHarry was 7 1/2 when he broke his first bone under the care of the avengers. It was also the first time Harry met Thor. Harry wanted the book on the top shelf. It was about mutants in this world but it was also about all the bad things that had happened to them. Uncle Steve had put it on the top shelf on purpose, he knew that, but nobody had actually told him he couldn't read it and he was beginning to wonder if maybe he was a mutant - after all he could talk to snakes and nobody else could do that. He was climbing the shelf because he didn't want to ask anyone in case someone actually said no and it had been going fairly well. \n  \"Mr. Potter, your current course is unadvisable. The risk of possible injury is at 78%.\" Jarvis informed him, but Harry shook his head. \n  \"I can do it, Jarvis, I'm almost there.\" \n  \"If you do not reverse your course I will be forced to inform agent Romanov of your actions.\" \n  \"That isn't true. You can't be forced to do anything except by uncle Tony.\" Harry argued, and oh the book was in reach! He lifted a hand off the shelf, swaying precariously as he reached for it. His fingers only just brushed the spine when the lightning struck just outside the windows, sending quakes through the floor. Harry lost his balance, limbs flailing for purchase, but all they found with air. He turned, catching himself on one arm and distantly heard a crack as pain swept through him. He cried out from the pain, head hitting the ground, hard. Everything went dark.\n \n&gt;&gt;&gt;\n \nThe whole tower shook with the crack of thunder and Pepper huffed out a breath, not missing how Natasha rolled her eyes. \n  \"He has to make an entrance.\" She noted, and Natasha gave a smile.\n  \"Ms. Potts, agent Romanov. Mr. Potter is in need of immediate assistance. He has fractured his left forearm and is unconscious with a minor concussion. At the moment of his injuries a wave of energy was released and all power is now down on the communal floor.\" Pepper barely had time to blink before Natasha was across the room, at the stairs. \n  \"We need to get him to a hospital.\" Natasha said and Pepper grabbed her phone. \n  \"I'll get a line of Clint. Ambulance or helicopter?\"\n  \"Thor.\" \n \n&gt;&gt;&gt;\n \nThe first thing Harry heard was beeping. He felt weird - everything was floaty but also really heavy. He opened his eyes and everything was blurry but then his glasses were carelly put on his face and he saw his aunt Tasha hovering over him. \n  \"Where am I?\" And the moment he spoke she looked so relieved.\n  \"We're at the hospital, Harry. You fell and broke your arm and hit your head.\" Now the relief faded and she looked upset. \n  \"If you wanted to know about mutants why didn't you just ask?\" \n  \"Because uncle Steve didn't want me to know.\"\n  \"And you thought sneaking around was a good solution?\" Harry shook his head, but he was upset too.\n  \"I want to know too.\" He said, and he'd never talked back before, but it felt right. \"I'm not the same as you and I want to know why. And nobody will tell me. It's not fair!\" He exclaimed, and with the exclamation the electricity flickered. Harry didn't notice though, frowning with his frustration. Natasha just closed her eyes, taking a breath. When she opened them, Harry looked unsure of himself but seemed ready to stand firm. Natasha was proud of him. \n  \"You're right, Harry. It isn't fair that we haven't talked to you about it. But it also isn't fair that you put yourself in danger instead of asking me for help.\" She took his good hand in hers. \"I will always help you do something if it's what you really want. But as punishment for climbing the shelf when you knew you shouldn't, no TV for a week.\" Harry blinked in disbelief.\n  \"That's all?\" Natasha raised her eyebrow and Harry frowned.\n  \"You aren't going to lock me in a cupboard?\" He finally asked, confused, and Natasha remembered the cupboard he'd been sleeping in when she found him. It took a great amount of effort to keep her expression neutral. \n  \"Never. And if anyone ever does that to you again I will destroy them.\" Harry just shook his head, exasperated.\n  \"You can't just destroy people, aunt Tasha.\" Harry scolded, and Natasha smiled, squeezing his hand briefly before pulling a marker from her jacket.\n  \"Can I sign your cast?\" Harry nodded so quickly it looked like his head might come off and so Natasha leaned forward, picking the inside of the cast. She wrote get well soon with 5 x's and o's and signed it aunt Tasha. Then she handed him the marker. \"So you can get other people to sign your cast too.\" \n \n&gt;&gt;&gt;\n \nHarry didn't think he'd ever had so many people caring for his injuries. He had dozens of signatures on his cast - so many in fact that he could hardly even see the white of the cast underneath. He looked up from his observations at the sound of the door and he saw his aunt come in with a large man on her heels. The man was taller than his aunt by a couple of heads, with big broad shoulders, golden hair that matched his beard, and eyes that looked much too old for his face. \n  \"It is an honour to finally meet you, Harry Potter.\" The man intoned, and Harry blinked in surprise. \n  \"Likewise.\" He responded, then he flushed. \"I don't know your name.\"\n  \"Forgive me.\" The man said, smile widening. And now ad he stepped into the room Harry noticed that the silver gleam he'd noticed was actually armour, a red cape hanging down the man's back. \"I am Thor, a friend of your aunt. Your aunt and uncles are my brothers - and sister - of arms.\"\n  \"So you fight together?\" \n  \"Aye, that we do.\" Harry turned the information over for a moment, watching Thor all along. \n  \"Why do you look sorry? Aunt Tasha said that people only look sorry when they've done something they know they shouldn't have - that's why she says uncle Tony always looks sorry.\" The words had Thor giving a short laugh and the sound rumbled like thunder. \n  \"I myself appear as such because it is because of my actions that you fell and caused yourself such injury.\"\n  \"But it was the thunder.\" Harry said frowning, and Thor nodded. \n  \"Aye.\" Thor agreed once again. Harry found himself frowning again. \n  \"Do you mean that you created the thunder?\" Harry asked, tentative but ever so curious, and Thor nodded. \n  \"Aye.\" He repeated. \"That was me.\" Harry just stared, trying to make sense of it.\n  \"How?\"\n  \"In your terms, you would call it magic.\" Harry's eyes widened in wonder.\n  \"Can I see?\" Thor looked at Natasha who was watching her nephew fondly. When Thor caught her eye, she shrugged, offering a smile.\n  \"It's fine with me.\" That nodded, moving closer to Harry. \n  \"Such things are best shown out of doors.\" He reached for Harry but stopped just short of touching. \"May I?\" Harry nodded and reached out, pausing with a bit of a pout at his trapped arm. Thor lifted him with no effort, holding him in a single arm. Harry couldn't help his giggle. \n  \"Look how tall I am aunt Tasha!\" His aunt just smiled at him, following him and Thor outside. He set Harry down carefully. \n  \"Ready then?\" Harry nodded excitedly, eyes glued to Thor, but Natasha was watching her nephew out of the corner of her eye she saw Thor raise his arm, hammer pointed towards the sky, and the clouds gathered immediately, thunder rumbling, and she watched Harry's eyes widen in awe. The first strand of lightning struck and Natasha watched Harry's eyes go bright with wonder, but she also didn't miss the ethereal glow that seemed to surround her nephew in the reflection of this magically induced lightning. \n \nHarry was 8 years old when the thing that Natasha feared most happening, happened. Harry'd gone to the park with Tony since Natasha and Clint had to go file paperwork under pain of death from Coulson. Natasha was just signing for the last detail when her phone rang. Ignoring Coulson's glare and Clint's curiosity, she answered it.\n“Romanov.”\n“Ms. Romanov, I am no longer receiving vital signals from Master Stark.” Jarvis' voice informed her, and if an AI could sound worried, Jarvis did. She was on her way out the door in an instant, motioning the others after her. \n“Where?” Jarvis listed the park that Tony had taken Harry too and Natasha felt like the floor had fallen out from under her. “I'm on my way. Call the others, and the authorities.”\n“The authorities have already been alerted. There seems to be a large disturbance within the park and it's disturbing all electrical signals.”  she switched from her phone to a com and kept moving, Clint and Coulson on her heels. \n“What's going on?” Clint asked, and Natasha only spared a quick glance before she sped up. \n“Jarvis lost of trace of Tony's vitals. Last known location is at the park with Harry.” Clint paled be before his expression hardened. \n“What are we waiting for?”\n \nTony had thought taking Harry to the park would be a safe venture. They'd done it dozens of times before since Harry had moved in with them, and he had Happy on stand by at the coffee shop across the street. Bruce had also ventured out of the tower with them, having decided to visit a small independent bookstore around the corner that had apparently caught his interest. Tony new better than to think Bruce would happily wander New York on his own, but he certainly wouldn't begrudge Bruce's protective feelings for Harry. Of course, while he would never be surprised about attacks against himself, he'd never once considered that someone would target Harry. \nThe first sign that something was wrong was when Harry didn't immediately come zooming down the slide on the promised last turn. Tony had been getting tired of the glances being tossed his way and had promised Harry ice cream if they could leave this park and find a new one. The idea of two treats had thrilled the boy and he'd happily agreed on the promise that he could go down the slide one last time. Tony of course waved him towards the slide and Harry had torn off – but he hadn't appeared back at the bottom yet. Not yet worried, Tony wandered around the equipment, intent on telling Harry to hurry when he saw Harry talking to an unfamiliar pretty blonde woman. She was about his own age and he frowned, quickening his pace. \n“Harry!” he called, and both sets of eyes turned his way, Harry's green eyes clouded with confusion and the blonde's grey eyes hardening the moment she saw Tony. Her hand snapped out and she grabbed Harry's wrist with bruising force. Harry's eyes went instantly from confused to afraid, and he was tugging away. Even as she grabbed him though, Tony was lashing out with a fist, punching her in the face. \n“Get away from my nephew.” he snarled, and even as his fist connected, sending her to the ground, she was releasing Harry's wrist and the boy hid behind Tony. \n“What's going on uncle Tony?” Harry asked, afraid, and Tony just gave him a reassuring smile, standing between him and the military looking group that was bleeding out of the space around the park. The other families had cleared out in the moments between Harry being grabbed and released, and it left Tony on his own. He pressed call on his ear piece and heard Happy answer.\n“I need my suit. And you need to call Bruce and Cap. They're both in the area. We've got trouble.” \n“On it, boss.” Tony hung up, turning to check on the woman, but before he could, a searing pain sent him to his knees, electricity burning through him even as he heard Harry shout out for him with fear. He was hit again with what he was assuming was a cattle prod before he could even consider getting up. \n“Stop hurting my uncle!” he heard Harry shout, and this time it was not only afraid but angry. Tony knew he hadn't passed out because he could still hear everything, but that didn't explain how everything went suddenly darker. He realized moments later it was from the storm clouds that were suddenly building, and the crack of thunder had him wondering how on earth Thor had known they were in trouble. Of course, no god of thunder appeared, instead when the woman went to hit him with the rod again, Harry shouted again. “Stay away!” and he threw up his hands as if to ward off any attack. Tony watched, gaze blurry, as the woman and the men closest behind her were sent flying back, and he blinked in disbelief. He had to be seeing things. \n “Leave Stark, we only need the boy.” Tony felt Harry hesitate at the words, felt the air grow thicker as if Tony could taste Harry's fear. The hands gripping his arms began to shake before Harry started to retreat, obviously trying to run from whoever was reaching for him. Tony tried to push to his feet, tried to get to Harry, but before he could, he was hit with the rod again, and just as everything went dark he heard the Hulk's roar. He prayed harder than ever before that the Hulk would recognize Harry and that the boy wouldn't be hurt. \n \nHarry was terrified. He didn't think he'd ever been so afraid in his life. There were men with guns everywhere, and a woman who kept hurting his uncle, but no matter where he looked there didn't seem to be anywhere to escape to. He thought of his aunt Tasha and his uncle Clint, wondering briefly what they would do if they were here. He was sure they wouldn't act afraid, but that's because they were strong and could fight. Despite knowing that he himself was tiny and weak, that didn't stop him from drawing himself up to his full height, trying to be brave. \n“If you hurt me, my family will be mad.” he said, trying to sound threatening, but the woman who'd hurt his uncle Tony just laughed. It was a mean laugh – a laugh like Dudley used to give when he was allowed to chase Harry around with his friends, playing a game of Beat the Freak. The memory had him shuddering, but he did his best to remain tall even as the woman came closer, obviously meaning to scare him.  \n“Your family doesn't scare me. They should be scared of me. After all, you're the Black Widow's nephew, do you know how powerful that will make me? Having you in my grasp?” the words didn't really make sense to Harry – he had no idea why taking him away from his aunt would make anyone powerful, but that didn't mean the woman scared him any less. Despite himself, he retreated away from her, eyes once more flying around the clearing, feeling panic at the sheer number of men with guns. Even as he felt the panic, he heard a deep, bellowing roar, and he was torn between relief and apprehension. He knew just who it was who was roaring, but he'd also never seen his uncle Bruce's hero shape, and could only wonder if the stories he'd heard were true or not. Even as he wondered that, the large green shape burst into view. Harry was struck immediately by the sheer size of the Hulk, but when their gazes met, Harry didn't feel even the slightest hint of fear. Instead, the Hulk just leapt over to where he was, the ground shaking with the force, but even as Harry stumbled, one big green hand steadied him gently while the other reached out to grab the woman, yanking her in close. \n“NO TOUCH HARRY!” he bellowed, before tossing her like a rag doll into a group of the men. \n“Order Delta, order Delta!” Harry could hear the shouting beginning and he flinched towards the Hulk, feeling safe behind the green bulk, but then he caught sight of Tony, and tugged on Hulk's hand.\n“Uncle Tony's hurt!” he said when he had Hulk's attention, and he was immediately scooped up in one broad palm and brought over to where Tony was. Even as he blinked, he saw the guns lift in their direction, and even as he screamed, the Hulk curled around him and Tony, covering them with his bulk. The sound of gunshots had Harry in a panic and the sound of lightning had Tony struggling to pull himself back to fully aware. Harry was crying somewhere close, but he couldn't see anything behind the green bulk of the hulk. \n“Harry,” he managed to wheeze out, and the sound of tears slowed.\n“Uncle Tony?”\n“Yeah, kid. I'm okay. Are you okay?” there was a bellowing roar paired with loud crashes of thunder, and then suddenly there were no more gunshots. The lightning stopped moments later, and that's when they both heard Natasha's voice.\n“Harry!” The Hulk uncurled around them, and soon Natasha was in sight, Clint and Coulson on her heels. Hulk set Harry down, but rather than put Tony down, he frowned down at the genius, one giant finger touching the arc reactor. \n“I'm okay, big guy.” Tony assured, and with a grunt, the hulk set him down as well then, and Clint was quick to move forward to help him stay on his feet. Harry just ran towards his aunt, tears streaming down his face, and Natasha immediately dropped down, hugging him tightly. \n“Shh, it's alright. You're alright. I've got you.”\n“They wanted to take me away. They wanted to hurt you by taking me away.” Natasha's grip tightened on him, and she cradled him to her body. \n“How do you know, Harry?”\n“The lady said so. She said she'd be,” he paused, sniffling, “Powerful if she could take me away from you, and that you should be scared.” The words were all too true, and Natasha just looked up at her friends, her family, wondering just how they were supposed to protect this precious boy.\n \n&gt;&gt;&gt;\n \nHarry couldn't sleep. It's not that he didn't want to, it's that everytime he closed his eyes he was back in the park with uncle Tony and those people were attacking them again but this time, there was no uncle Bruce to save them. He was sitting in the window seat, staring out over the city with no intention of crawling back into bed when Jarvis' voice interrupted his thoughts. \n  \"Mr. Potter, if you do not rest you will be too tired to participate in tomorrows activities.\"\n  \"I don't want to participate.\" Harry responded sadly, and there was a pause before Jarvis asked,\n  \"Why?\" \n  \"Because it's my fault uncle Tony got hurt. I don't want anyone else to get hurt because of me.\"\n  \"Mr. Stark was not caused any permanent injury. He is in perfect health.\" \n  \"But they attacked us because they wanted to take me away. Uncle Tony was hurt for protecting me.\" There was another pause before Jarvis spoke, and Harry suspected it was because he was deciding what to say. \n  \"You recognize Mr. Stark as your family, is that not correct?\" \n  \"Yes it is.\" \n  \"As I have been informed, it is the purpose of family to protect family. It would follow then, that it is Mr. Stark's duty as your family to protect you.\"\n  \"But what about me? I'm little. I can't protect anyone. That isn't fair.\"\n  \"You will not always be little, Mr. Potter.\" This time it was Harry's turn not to answer right away. \n  \"Jarvis?\"\n  \"Yes Mr. Potter?\"\n  \"Do you think one day I'll be able to protect them like they protect me?\"\n  \"I do, Mr. Potter.\" Harry nodded, finally relaxing, but he didn't leave the window seat. \n  \"Is uncle Tony still awake?\" \n  \"He is. Would you like me to guide you to him?\" At that, Harry finally stood. \n  \"Yes please.\"\n \nTony looked up at the sound of Jarvis' voice and saw Harry carefully making his way down the stairs to the lab. When he looked up and caught sight of Tony he gave a relieved smile, and Tony heard him thank Jarvis before coming carefully into the workshop.\n  \"You're up late.\" Tony noted, but he understood, he was fairly certain he couldn't sleep for the same reason Harry couldn't. Today had been a scare for both of them. \"Couldn't sleep?\" Harry shook his head and Tony beckoned him forward, hauling the kid onto his lap when he was close enough to reach. \"Me either. Want to help me build some new arrows for Clint?\" Harry nodded again, settling in against Tony, relaxed now, and Tony just reached around him, carefully showing him how to assemble the shafts he was working on. He pressed his cheek against Harry's hair, taking a deep breath. They were good. The kid was safe and he didn't even have any bruises from the day. All in all the turnout was pretty okay, but that didn't stop him from remembering Harry's terrified voice, or the lost look on Natasha's face when she'd held on to Harry for dear life. But no, they were okay, and they'd be more careful in the future because there was no way he'd let this ruin the kid's whole childhood. \n \nWhen Natasha woke up she went immediately to Harry's room to find her nephew not in his bed. The panicked thought didn't even have time to form before Jarvis was interrupting.\n  \"Mr. Potter is with Mr. Stark in the workshop.\" He informed her, and she realized she probably should have looked there first. Both of her boys would have been anxious after the events of the day before. She made her way down to the workshop then and wasn't at all surprised to find the two of them curled up together on the couch kept for this very purpose, fast asleep. She moved forward, keeping her steps silent so as not to wake them. Since they were both deceptively light sleepers she didn't reach out, but she did smile. \n  \"Jarvis, let me know when they wake up.\"\n  \"Of course agent Romanov.\" With one last look, she left the two to sleep, and knew without a doubt that they'd both be okay. \n \nPhil Coulson was halfway across the Mediterranean Sea when his cell phone rang, and he frowned down at the phone, unable to see anything other than that it was Jarvis calling. That on it's own was odd – the AI usually directed calls rather than making them and Phil answered curiously.\n“Jarvis?”\n“Good afternoon, Agent Coulson. I am calling on behalf of Mr. Potter. Do you have a moment to speak with him?” the request was not something Phil had ever expected to hear but he immediately agreed.\n“Of course. Put him through.” A moment later, Harry's tentative voice was in his ear. \n“Mr. Coulson?”\n“I'm here, Harry, and like I keep telling you, you can call me Phil. What can I do for you?” \n“I was wondering if you knew the day of uncle Clint's birthday.” the boy admitted. “He said it was in June but he didn't say when.” though his chest had tightened at the mention of the archer, Phil answered.\n“It's the 18th, Harry. Why?”\n“Because I need your help with something.”\n“Anything.” Phil found himself saying before he realized what he was promising, and boy did he hope Harry wouldn't ask for anything crazy or both Nat and Clint would kill him. \n“I'd like to learn American Sign Language for his birthday.” the request was the last thing Phil had ever expected to hear and he laughed.\n“I'll teach you.” he could all but hear Harry's answering grin.\n“Thank you very much! When are you getting back to New York?” Despite the fact that Phil had had no intention of returning to New York anytime soon, he answered easily. \n“Saturday. I'll make sure to come by as soon as I get back.”\n“See you then!” Harry replied excitedly before hanging up, and Phil found himself smiling at his phone. He'd known that to be related to Natasha the boy had to be special, and he'd seen it time and time again, but it never ceased to amaze him. \n \nWhen Phil arrived on Natasha's floor in Stark tower on the Saturday, Harry was waiting for him, and he greeted him with a wide grin and a signed 'hello'. Phil blinked in surprise, before signing 'hello' back, and watched the grin widen impossibly. \n“Did you teach yourself that?”\n“I asked Jarvis for some help. He brought up videos and stuff for me to watch and told me when I wasn't doing it quite right. We both think you'd be more help though, right Jarvis?”\n“Indeed, Mr. Potter.” Phil just nodded, looking around.\n“Where's your aunt?”\n“She's upstairs with uncle Steve. Uncle Clint's not here today.” \n“Bruce and Tony?”\n“In the lab.” Phil nodded. \n“Alright, well we better get started. Why don't we start with the alphabet?” \n \n&gt;&gt;&gt;\n \nIt took a month of spending almost every afternoon together for Harry to have a good handle on the language, but when he was able to say most basic words and at least spell things when he couldn't remember the sign for them, Phil found himself feeling extremely gratified of their work. They were out for the afternoon – Harry had come up with the excuse that he wanted to explore the city and Phil expanded it by saying Natasha and Clint were being too protective. That had shut them both up and allowed Phil to take Harry out for the afternoons. They'd visited museums, galleries, parks, outdoor festivals, fresh markets, and anything that caught Harry's eye. While they'd spent most of their time signing and learning the words for what they saw in ASL, Phil also found himself enjoying the month much more than he'd enjoyed anything in years. \nIt was on an afternoon where Phil wondered if maybe there sessions could end soon – they were getting ice cream and Harry had signed that he wanted chocolate which Phil had then dutifully ordered, when Harry started to look thoughtful. \n“What's the sign for uncle again?” he asked, and Phil showed him slowly, watching Harry mimic him until it looked like he had it. \n“If you're such good friends with aunt Tasha, and all of her good friends are my aunts and uncles, why aren't you my uncle too?” Harry asked with the unabashed curiosity of an almost-9-year-old. \n“I don't know.” he replied honestly. “Did you want me to be your uncle?” Harry shrugged, but he was pointedly looking anywhere but at Phil. \n“I don't know.” he mimicked. “Would you mind terribly if I was your nephew?” Phil could have laughed. Would he mind? This boy was certainly something else.\n“Not at all. Do you think your aunt would mind?” Harry shook his head. \n“She's happy that I -” he paused, thinking of the words. “When I develop relationships. Jarvis told me so.” Phil couldn't help his smile at the words, wondering what else Jarvis had told the boy. \n“I would be happy to be your uncle, Harry.” Phil said, and watched the beaming grin spread across the boy's face. The boy lifted his free hand to sign. 'Thank you uncle Phil' and Phil just reached over to ruffle the boy's hair. He'd certainly entered himself into this for the long haul.\n \n&gt;&gt;&gt;\n \nClint woke up on June 18th feeling like he did every other day. Well actually, he felt much less aware than usual. He looked around the room and realized it was barely even light out and wondered what had woken him. Then movement caught his attention in the corner of his eye and he watched the door open, Harry's tiny form peeking out from behind the door. \n“Hey kid. Just give me a minute.” Clint muttered, knowing his speech was a tad slurred, but before he could reach for his hearing aids he watched the boy's hand lift, fingers twisting to form a sign.\n'Good morning uncle Clint. Happy birthday.' Clint could only stare a moment and watched Harry frown, looking down at his hands in concentration. When he signed the same two phrases again, Clint actually laughed. \n“You learned sign language?” he asked unable to believe his eyes, and Harry smiled, signing 'Yes'. \n“Why?” at that Harry frowned. \n'For your birthday.' he signed, and Clint could actually feel the tears in his eyes. He rolled out of bed, rushing over to scoop the kid up in a hug, holding him close. \n“Thank you.” He could hear Harry's  laugh and then the kid was pushing him back a bit, bringing his hands between them.\n'I love you, uncle Clint' he signed, and Clint held him in one arm so he could bring up his hand as well.\n'I love you too, kid.' he signed back, and hugged him tightly again. \n \n&gt;&gt;&gt;\n \nPhil Coulson was just settling in for the night when the knock came at his door. His first instinct was to go for his gun, but then he remembered that there were only 3 people who knew where he lived, and none of them required him to use a gun. Or at least, not usually in his home. He went to the door, looking through the peephole just out of habit more than necessity, and the man he saw on the other side of the door had him swinging the door open before he could think twice.\n“Happy Birthday.” he said automatically, and Clint blinked at him, taking in the pyjamas he was wearing. It was only years of practice that didn't have Phil blushing at the fact that he was standing in front of Clint in his old worn pyjamas. \n“Thanks.” was the automatic reply before the assassin pushed into his apartment, moving to pace in the living room. There was a frantic sort of energy about him and Phil followed cautiously, not really sure what was going on. This was the first time Clint had willingly been in the same space as him since he'd been announced back from the dead to the team; the archer had been furious – but also hurt – and Phil had seen that in his eyes clear as day when he'd finally convinced Fury to let him tell the Avengers that he was alive. He'd been fairly certain that Clint hated him now, and it had hurt because despite everything else, Phil Coulson was in love with one Clint Barton and there was absolutely nothing he could do about it because the archer hated him for pretending to be dead for years. And in all honesty, Phil couldn't blame him because he hated himself for it too. \n“Harry told me that you taught him to sign language.” Clint said suddenly, spinning to face him, and Phil nodded, frown forming.\n“He asked to learn for your birthday.” was his response, and Clint just stared, his eyes were unreadable. \n“You've been spending afternoons with Harry for a month.” and once again, Phil nodded. None of this was a secret, but clearly Clint was looking for confirmation so he gave it. \n“Yes.”\n“Why?” and Phil's frown deepened. \n“Why what?”\n“Why teach him?”\n“Because he asked.” Clint took a step forward and it took everything in Phil not to take a step back.\n“That's it? You were in the Mediterranean.” and Phil wondered how exactly Clint knew that. “And you came back just because he wanted to learn sign language.”\n“No, I came back because he wanted to learn sign language in time for your birthday. It was very important to him to be able to do something meaningful for you. Harry idolizes you. You're a hero to him, and not because you're an avenger, but because you make him feel like he belongs and you love him because you can, not because you have to.” \n“Natasha doesn't love him because she has to.” was Clint's automatic response, and Phil agreed.\n“Of course not, and he doesn't think she does – but she's blood. It makes things different. They're family no matter what happens – but you chose him. You're the first person to ever choose him. So he learned sign language to show that he chooses you too.” \nClint couldn't believe the words he was hearing – well no, that wasn't true. He believed them, and it made his heart ache. He couldn't even decide if it was a good or bad ache, only that it made his eyes burned. Phil was right, he did choose Harry, he'd always choose Harry. Harry was his family as much as Natasha and the rest of them were. As much as Phil was, despite how angry he'd been – how angry he was.\n“Well that explains Harry.” Clint said, but then his eyes narrowed. “What's your excuse?” and Phil couldn't help himself from pinching the bridge of his nose. He was tired, and no matter how angry Clint was at him, he couldn't believe he thought he had to ask this.\n“Do I need an excuse to help Harry do something for your birthday?”\n“Well it's a bit out of character since you wouldn't even tell me you weren't dead for two years.” this time it was Phil who took a step forward.\n“I've apologized to you for that. I've told you why, even though I know no excuse will ever be good enough. I haven't said anything about the fact that you would rather be anywhere else but in the same room as me because I know you're mad and I deserve that. What I don't deserve? You doubting that I would ever be willing to do something nice for you.” and while Clint agreed that was kind of unfair, he certainly wasn't going to admit it now.\n“Maybe I just don't know why you'd bother.” was what Clint replied harshly, and Phil had had enough at this point. Ever since he'd died and been brought back to life, his life had been hell. Not having Clint and Natasha at his side or in his ear, had been disorienting and like he was missing limbs. Even when he'd been given permission to tell them he was alive, it hadn't quite been the same but at least he'd been able to see them; and then he'd spent the last month with Harry. He'd spent the month with a child who saw the world with such big curious eyes and he'd heard all about the people he considered family coming together to raise this amazing child, and he'd missed them so much it hurt. Natasha he was able to speak to – had been able to speak to since she'd found Harry, but Clint had still be separate, Harry his only real link, the only person who'd told him how the archer was actually doing. Not that they'd talked about Clint much or even often; Harry was also intuitive, and seemed to only tell Phil about Clint when he thought the man needed it before easily changing the conversation to other things. But now, faced with Clint for the first time in months, alone in his apartment, Phil couldn't take it anymore. He closed the distance between them, hands cupping Clint's face and bringing their mouths together in a heated kiss. In the back of his mind, Phil registered that Clint hadn't fought him at all, hadn't tried to fight him in the slightest, instead he'd banded his arms around Phil, returning the kiss easily. When Phil finally pulled back, he didn't release Clint's face, only made it so their eyes met and the archer would be able to see he meant every word. \n“Because I've loved you for a very long time, and I'm not about to stop.” he felt the shudder run through Clint's body, watched his eyes close as he slumped forward and Phil caught his weight easily. \n“Say it again.” was the request murmured against his next, and Phil smiled, holding Clint tight. \n“I love you.” and he felt Clint shudder again, his arms tightening around Phil as if he was afraid he'd run away otherwise.\n“Me too.” \n \n“Jarvis – do you wish sometimes that you had a body?” Harry asked one day when he was playing with Lily on the floor, watching as she leapt at his hand only to scratch behind her ears just to start the cycle all over again. \n“I am of far more use as I am, Mr. Potter. A physical form would be limiting.” Harry nodded, but pressed on. \n“But do you ever want one?” There was a pause as Harry assumed Jarvis decided on an answer.\n“As I do not possess emotions such as desire, I cannot therefore 'want' anything. However, the concept of a physical form does hold some use such as physical security, and the ability to enforce proper meal regiments by serving food in a physical form of my own. In this respect, it could be reflected as desire.” Harry nodded sagely. \n“What do you think you'd look like if you had a body?”\n“The name master Stark gave me, Jarvis, belonged to a butler that master Stark had when he was a child.” that had Harry looking up.\n“What did he look like?” In front of Harry's eyes, the image of a man was projected and Harry stood, entranced, circling the image twice before shaking his head. \n“No, I don't think you should like like him. You're someone new, Jarvis. You should have your own face.” Harry smiled towards one of the cameras in the room. “Will you help me?” \n“Of course, Mr. Potter.” Harry grinned, excited, and he grabbed a chair from his desk, pulling it over so he could be eye level with the projection. \n“When did uncle Tony create you? You sound English. What did people in England look like when you were made?” Before Jarvis could answer, Harry continued. “And uncle Tony has lots of money so you would look like someone who works for a family with lots of money. What's the word for that, Jarvis?”\n“I believe the word you're looking for, Mr. Potter, is aristocracy. And how is this?” In front of Harry's eyes, a bland looking man with a pale complexion appeared in front of him. Harry looked at him and frowned.\n“It's not quite right. What's your favourite colour, Jarvis?”\n“If you mean to ask in order to establish eye colour, the colour green is a recesive eye colour gene that many attempt to gain in the conception of their child.”\n“I have green eyes!” Harry said, and Jarvis confirmed that fact. \n“You do. A trait shared by your biological mother.” Harry just hummed.\n“Would you like green eyes?” Rather than answer, Harry found himself staring into grey-green eyes. “What about your hair? I think most people have brown hair.” Harry admitted. “But maybe a light brown? That would look nice I think. If you like it.”\n \nIt was Tony that found the two of them – Harry still on his chair, chatting with the projection that appeared to be chatting back, in Jarvis' voice. \n“There. It's perfect. We're a good team, Jarvis.”\n“Indeed, Mr. Potter.” \n“I'm glad you're part of my family too.” Harry said then, and Tony found his chest clench at the words. \n“As am I, Mr. Potter.” without a word, Tony turned on his heels and left, not aware that two sets of green eyes had followed his progress out of the room. \n \n&gt;&gt;&gt;\n \nThough it had been accepted from the moment Harry had moved in with then all that he was special, it wasn't classified as magic until the boy was 9. There had been electrical issues and the whole talking to snakes thing, but after his 9th birthday it became all too clear. For the very first time, Harry met Nick Fury and it could not have gone worse. The former director of SHIELD found Harry alone in Tony Stark's office, and Fury found himself at a loss as the boy stared at him, the door closing behind him and leaving him alone with the boy.\n\"I'm looking for Tony Stark.\" He said carefully, and Harry nodded.\n\"This is his office.\" Harry said, turning back to his colouring book, and Fury took a step closer. \n\"I need to see him.\" Fury continued, and Harry looked back up, frowning. \n\"Visitors are supposed to wait downstairs.\" \n\"I'm a - I'm an old friend.\" The boy's frown darkened and Fury found himself wondering just who this boy was. \n  \"What's your name?\" Fury's eyes narrowed. \n  \"Nick.\" \n  \"He never talks about a Nick. If you don't go away I'll call security.\" The words were very grownup coming from a child, and Fury grew suspicious. \n  \"I need to talk to Stark. Now.\" He moved forward and watched the boy's eyes zero in on the weapon at his hip. Damnit. The boy's eyes widened with fear and his tiny hands were reaching for the cellphone beside him. Fury moved forward to stop him but it seemed to only frighten the boy more and this time the  boy's hands flew up in defense and Fury was sent flying back. \n  \"Help! He has a gun and he tried to grab me!\" Fury tried to push himself off the ground but Harry just threw out a hand and he was forced back. Rather than receive a response, moments later the door was exploding inwards, iron man suit appearing, putting itself in front of Harry, thrusters coming up to point at Fury. \n  \"Shit.\" The faceplate came down and Tony's face became visible. \n  \"Fury?\" The shock faded and a dark glare formed. Fury didn't think he'd ever actually seen Tony so angry. \n  \"You okay, Harry?\" Tony called back, and Fury heard Harry coming forward, coming up behind Tony. \n  \"I'm okay. I think he wanted to hurt you.\" \n  \"Nah. Nick's an old friend.\" There was a bite to the words that Fury had expected. \n  \"You never talk about him.\" The boy, Harry, said apologetically, and Tony looked down, one gauntlet pulling back to he could ruffle the kids hair gently. \n  \"Yeah. We thought he was dead. Guess we were wrong.\" Harry looked up in surprise and Fury knew his own surprise was clear on his face. Who was this boy?\n  \"Hey Jarvis, let everyone know Harry's okay.\" Then he looked back at Fury, gaze hardening. \"We need to talk.\" The suit retreated into the suitcase then and Tony lifted the case in one hand, taking Harry's hand with his other. \"Come on. Time to head back to the tower. The others will want to see him too.\" Then he nodded at Fury. \"You first. I'm not letting you out of my sight.\" Fury obliged but he was scowling. This boy was something new, and he intended to find out what. \n \nThey reached the tower and Fury found himself freezing inside the door. The whole team was there, but instead of Bruce Banner the Hulk was in his place. \n  \"Hulk!\" Harry exclaimed, seeming overjoyed, and Fury watched as Tony actually let go of the boy's hand so he could run over to the green beast and nobody stopped him. Even more surprising, the Hulk hunkered down, cupping his hands so Harry could clamber onto them and then lifting him so the boy was more cradled in his arms. The boy just went on to tell the creature all about his day at the office with his uncle Tony and how when Tony had gone to get some papers from Pepper this strange man with bad manners had come in and was actually his uncle's friend. The word threw him for a loop. Uncle? But he said nothing and neither did anyone else until the Hulk slowly shrank down to Bruce so Harry was sitting in his lap. Harry just cuddled in, obviously content, and the doctor kept his arms around the boy, seeming equally as content. \nThere was silence then, as everyone stared at each other and then finally Steve broke the silence. \n  \"This is becoming a bad habit of yours, Fury.\" He said, and Fury just stared back a moment before answering.\n  \"You seem to have the same problem with collecting the enhanced.\" He didn't expect the reaction he got. Natasha all but tried to throw herself forward and it was only because Clint managed to get an arm around her waist and Steve got an arm out in front that she didn't get far. There was a fire in her eyes that threatened pain and that she was so protective of this boy spoke volumes. \n  \"Well. You're wrong there, Nick. He's not an enhanced.\" Stark stated, and there was no missing the sharp tone. Another warning. Fury resisted narrowing his eyes. Did this boy have them all under his power? He'd never seen any of them act this protective and it made him suspicious.\n  \"Then what is he?\" Clint released Natasha then and moved to lift the boy to his feet from Bruce's arms, helping the man up as well. \n  \"Come on, kid. You and me are gonna make sure Bruce gets something to eat, alright?\" The boy nodded, taking Clint's hand, though he did shoot another frown at Fury before they disappeared through the door.\n  \"He's a child.\" The words were laced with simmering rage and Fury watched Steve place a hand on her shoulder. To comfort or restrain, Fury wasn't sure. That didn't mean he was afraid.\n  \"He's more than that. He should be tested.\" \n  \"If you lay a finger on my nephew I will make you wish you'd never been born.\" The words were snarled but they were also words he'd never expected to hear. \n  \"Your nephew.\" And even he could hear the disbelief in his voice.\n  \"I think maybe we should be more focused on just why you came back from the dead this time.\" Tony cut in, and Fury eyed him warily. He needed to know more about this boy but he also didn't need to end up dead for real and he knew better than to think Romanov wouldn't put a bullet through his head if he didn't let the subject drop.\n  \"Same reason I came back last time. Hydra. The Winter Soldier.\"\n  \"His name is James Buchanan Barnes.\" Steve corrected stiffly. The look Fury gave him was blank before he continued.\n  \"There have been sightings up in Canada.\"\n  \"Of Barnes or of hydra?\" Natasha asked, and all emotion had fled her expression and her voice. Fury couldn't tell which was more dangerous.\n  \"We aren't sure.\" \n  \"Who is this we? Because it isn't Shield or we would've heard something of your not-dead status ages ago.\" Tony pointed out, and got a glare from the ex-director of shield for his efforts. \n  \"I have my sources.\" Tony just snorted out a laugh.\n  \"Yeah, me too. Mine are better. Jarvis?\" \n  \"Right away, sir.\" With that, Tony waved Fury off dismissively. \n  \"There. If Barnes is in Canada, we'll know. If it's just hydra - well. I'm sure Phil will be thrilled to hear from you.\"\n  \"Aunt Tasha! Uncle Clint said if you cooked dinner, he'd teach me how to play jacks!\" Harry announced excitedly, and Natasha was careful that when she turned towards the boy she was still angled towards Fury.\n  \"What did he want?\" \n  \"Perogies!\" Natasha rolled her eyes and reached for Harry's hand. She saw Fury move out of the corner of her eyes, but so did Harry, and it had been made clear that Harry didn't trust him. With only a glare, the man he thought was a danger was trussed up like a chicken, hitting the ground with a thump. \n  \"You're not allowed to use guns inside.\" He told the man, and then took his aunts hand and tugged her from the room. Barely a second later, there was the click and flash of a camera and Fury shot a threatening glare in Tony's direction. The man in question didn't even bother trying to stifle his laugh.\n  \"This is priceless.\" Then he followed Harry and Natasha out of the room. It seemed Steve took pity on him because he approached with a sigh, though the first thing he did was take all his weapons before undoing the rope. \n  \"He's Natasha's biological nephew. When we dumped all the intel Coulson found her history buried somewhere. She found her family and took him in. We all did.\" It was a clear warning but Fury could understand Natasha's reaction now. For the first time in her life she had a connection that was all her own. \"You should probably get out of here. Let everyone get used to you being back.\" He offered a hand up and Fury accepted it. Steve escorted him to the elevator and didn't hand his weapons back till he was inside. \"If you're looking to reconnect, I suggest speaking to Coulson. But Nick - stay away from Harry.\" The doors closed and Fury didn't react at all, but even he knew that the fact Steve threatened him outright like that was meant more to protect Fury than Harry - it was a warning that they would do anything to protect the boy, regardless of who attacked. It was valuable information and he didn't plan to waste it.\n \n&gt;&gt;&gt;\n \n  \"Aunt Pepper, why are we being followed?\" Pepper looked down in surprise but didn't break stride, though her hand tightened minutely around Harry's. \n  \"Who's following us, Harry?\" \n  \"I don't know who they are, but they're wearing normal clothes.\"\n  \"And you're sure they're following us?\" Harry nodded.\n  \"They keep looking at us and then touching their ear before they talk.\" Pepper nodded, giving Harry an easy smile. \n  \"We're going to lose them.\" She told him cheerfully, and he blinked up at her in surprise. \n  \"How?\" \n  \"We're going to get in a cab and go to the ice cream shop near the museum instead.\" \n  \"Okay. Should we call aunt Tasha?\" Pepper just shook her head.\n  \"She doesn't need to worry, we can do it.\" Harry nodded and followed his aunt as she turned suddenly and slid them both in a taxi. He turned back to see the men following them start to run towards them but it was too late. The taxi sped away and they were gone. \nThey were sitting in the ice cream shop when Harry brought the men up again.\n  \"Why do you think they were following us, aunt Pepper?\" He asked, and though she didn't answer right away it was clear she was deciding how to answer. \n  \"I can't know for sure.\" Pepper admitted. \"But I know that if they were supposed to be following us to keep us safe we would have been told.\"\n  \"So they were bad?\" Pepper gave a delicate shrug. \n  \"We can't know for sure.\" She repeated. \"But Harry?\" He looked up from his ice cream. \"It's very good that you saw them. It's always better to be safe than sorry.\" He accepted the compliment, finishing his ice cream. When he was done however, he looked back up.\n  \"Aunt Pepper, do you think that man who came back sent people to follow us?\" \n  \"Do you mean Nick Fury?\" Harry nodded. \"Why do you think he would send people to follow us?\" \n  \"Because I think he's scared of me.\" the words weren't ones Pepper had expected to hear and she found herself frowning. Careful now, she leaned forward, reaching for Harry's hand. She wasn't afraid of him, and she wanted to be sure he knew that. \n“Why would he be afraid of you, Harry?”\n“Because I'm different.” And Pepper was so proud that he no longer showed any shame in that fact. “I did something he didn't understand and he wanted to do tests to find out why. Uncle Clint said that people only experiment on other people when they're scared.” For a moment, Pepper imagined a life where this little boy was taken from them; where he was experimented on and used against his own interests and it burned in her chest like fire. She reached her other hand out, enveloping his in her own and made sure to catch his gaze so he would see the complete honestly behind her words. \n“You are an incredible person, Harry, and I love you very much. We all do. And no matter what, we will never let anyone experiment on you, okay?” Harry offered a smile.\n“I love you too, aunt Pepper.” then he hesitated. “You're not scared of me, are you?” he asked, clearly afraid of the answer, and Pepper gave him a bright smile.\n“Never.”\n \n&gt;&gt;&gt;\n \n  Pepper found Tony in his workshop and he looked up in surprise at the sight of her, anxious frown creasing her brow.\n  \"Hey Pep. What's wrong?\"\n  \"We were followed.\" She said, and watched Tony's expression cloud. \"Harry and I - he noticed them first and I put us in a cab before they could consider following us further, but there were men following us today, Tony.\" She paused and Tony knew it was because she was deciding whether it was a good idea to tell Tony whatever she was thinking. Then she stepped in closer, taking one of Tony's hands. \"Harry thinks Fury sent them.\" Tony didn't answer right away, but his anger was clear in his expression.\n  \"Does Natasha know?\" \n  \"Not yet.\" \n  \"Keep it that way. Call Phil. He'll probably have an idea on how to deal with dear old Nick that won't put Natasha on another most wanted list.\" Pepper smiled, leaning forward to press a kiss to Tony's forehead. \nThe moment she left the room, Tony was calling Steve. \n  \"Cap, we have a problem. Pep and Harry were followed today, and they think they were Fury's people.\"\n  \"You think he would risk that? Risk Natasha?\"\n  \"I think he's paranoid enough, yeah. Natasha doesn't know yet and I think we should keep it that way, but this can't happen again.\"\n  \"Does Phil know?\" \n  \"Pep's calling him now.\"\n  \"Good. Try and keep Natasha from hearing about this. I'm going to go have a talk with our friend Nick.\"\n \n&gt;&gt;&gt;\n \n  \"You're going to get yourself killed. Again.\" Nick Fury looked up from his desk at Steve Rogers who was standing casually in the doorway, but he knew enough about soldiers to tell that Steve was ready to fight if he had to. When he didn't respond, Steve spoke again. \"Harry's off limits, Nick. If you go after him, you go after us. And none of us will stop Natasha and Clint from doing whatever they feel they have to do.\" Nick didn't respond but even he knew that between Natasha and Clint that he'd never be able to win. It was why he'd made them a team, because nobody could come up against them and win. \n  \"I'm not quite sure why you're making this visit. You already told me to stay away, and I have.\" He leaned back with the words, putting off an air of innocent calm, but Steve obviously didn't believe him. \n  \"I know you had men follow him and Pepper today. That's as good as you doing it yourself. This is your only warning, Nick. If anything happens to that kid, we're going to have a problem.”\n“That kid is enhanced.”\n“Yeah, well so am I. Are you going to start having me tailed again? We know how well that went last time.”\n“If anything happens because we weren't prepared-”\n“We'll deal with it. If something happens, and if it's going to be a problem, we'll notify you. Until then, back off.” having no other choice, Fury nodded his head, and with that, Steve turned and left. They both knew now that Fury wouldn't risk acting. Not if it meant all of the Avengers would turn against him. \n \nSteve walked back into the communal floor and found Natasha waiting for him, and knew with only a glance that she knew where he'd been.\n“He's not going to be a problem.” Natasha didn't react at first, but then she came forward, moving to press a kiss to his cheek.\n“Thank you.” was all she said before disappearing, and Steve smiled at the empty room. \n \nHarry's 10th birthday was spent in London. He'd been so curious about the place he was from - the place his parents were from - that he'd finally asked to take a family trip for his birthday. They'd all been so shocked that he asked for anything at all that they'd been happy to give him that. Despite the fact that Harry had lived with them all for 4 years, he still never asked for anything - never had to really - but they'd all wished at some point that he would. That wasn't to say he wasn't vocal about things he enjoyed. He loved going to the movies and always spent hours talking about any film they saw at length. He loved theme parks too, and then loved the rollercoasters the best. He enjoyed swimming though wasn't overly fond of it and loved taking airplanes where he would sit plastered against the window taking everything in. He loved pumpkin pie but not pumpkin seeds, and despite the fact that he always ate all his vegetables he really didn't like peas. He also really loved to run. It had taken a while to discover that one fact, but the day Clint had been able to coax Harry into playing a game of tag was the day they all discovered that not only did he like to run, but he was fast. He'd only needed a single compliment on his speed to announce why he was so fast - needing to run away from Dudley and his friends had been hard work - and though none of them liked the words, none of them could deny the enjoyment he got from being able to run. But now Harry was turning 10 and he finally asked if something big and they left for England before Harry could even consider what he'd asked. They rented a house - not wanting the in and out a hotel plus with all of them travelling together, the privacy of a home was better for their purposes. They booked all of the tourist attractions - went on all the tours; following the footsteps of Jack the Ripper, all the ghost tours, Buckingham Palace, the Tower of London; and Harry clearly loved every minute of it.\nThey were out for lunch, just Clint, Steve, and Harry since the others were planning something of a surprise for Harry. It was two weeks into their trip and Harry was approached by a middle aged man in robes, who bustled forward from who knew where and shook Harry’s hand profusely.\n“Such a pleasure, such a pleasure to meet you Mr. Potter! Welcome back to London. Welcome back!” And before either Steve or Clint could protest or say a word, the man bustled off and disappeared back to wherever he’d appeared from.\n“He knew my name.” Harry mused, earning a frown from both adults. “Kind of like how everyone knows your name, wasn’t it uncle Steve?” He added, and Steve nodded though he gave a smile, ruffling Harry’s hair in a gesture to ease them both of any worry.\n“It was kind of like that, wasn't it?” He shrugged, taking Harry’s hand now, and Harry took Clint’s hand in his others, glint in his eyes. It earned a laugh from Clint.\n“Wanna see how high we can get those feet?” He asked, and Harry laughed, getting ready to swing between them, and they swung him the rest of the way to the that didn’t shake the odd feeling the man knowing Harry had given both adults, nor had it escaped their notice that it really had been like when people saw Steve, or Tony; a form of hero worship, and it made both of them uncomfortable to think people were approaching their 10 year old nephew with something akin to that.\n&gt;&gt;&gt;\nHarry loved London. He loved the fact that he was getting to see where he was from in a whole new light. He loved the fact that his whole family was here with him, and nobody had been pulled away on a mission or anything aside from consulting that could be done over the phone or video calls. Despite the fact that they’d always treated him very well, perfectly in fact, he’d still been stunned by the fact that they’d agreed so easily to a trip for his birthday, though he supposed that was a bit silly. They travelled all the time, he’d been all over the world with his family, but he’d never requested it, and he thinks that was the major difference. He’d asked for something so important, and there had been no hesitation, no moment of maybe, and he was ever so grateful. However, there were some things he found odd; more than once when they’d gone out, people had recognized him, and they were always people dressed up in funny robes and hats. Not that he minded if they wanted to wear strange clothes, after all, his way of dressing was strange in some places too he imagined. But that didn’t change the fact that people seemed to know him; waving, shaking his hand, a wink or two, as if they were sharing a secret. He realized there must have been a secret of some sort, and it somehow involved him, but then, how could it? The Dursleys had always pretended he’d never existed so it couldn’t involve them, and his parents, well they’d never been able to find any real information on his parents. And even if that were true, his family now was full of incredible and unusual people; super spies and super soldiers, a Hulk, Iron man, and a literal god of thunder. So what sort of thing could possibly be so important to have all these people recognizing him? People he was sure he’d never met before in his life. But then, he supposed a lot of people probably knew of him, considering once again who his family was. He’d been homeschooled ever since he moved in with his aunts and uncles, and he knew that was partly to keep him away from the public. The incident in the park when he’d been 8 only proved that point. And he didn’t mind the homeschooling - he supposed it made his education quite eclectic, but he was certain that between all of his aunts and uncles they’d made sure he had a well rounded knowledge base. And that sounded rather adult. The one downside, he thought, was that he didn’t know any other children his own age, and as much as he loved his family, and considered them all his best friends, it wasn’t quite the same. All the same, he had a wonderful birthday trip, and when they arrived home, he was thrilled to share all of his stories with his uncle Phil, aunt Pepper, and uncle Sam, who hadn’t been able to come with.\nGoing home, however, hadn’t gotten rid of the nagging feeling that there had been more going on in London than he or his family had been aware of. Nor did it change that slowly growing desire to have more experiences, and hopefully some with others his own age.\n&gt;&gt;&gt;\nHarry was nearly 11 when he got his first letter. It wasn't that he hadn't received mail before – his family had been sure to send him postcards whenever they travelled somewhere new and always mailed them despite the fact that they'd see him first because everyone loved receiving things in the mail – but he was nearly 11 when he received his first handwritten letter. He was sitting in the window seat in his bedroom reading a book about pirate adventures when the sound of tapping met his ears and he looked up to see an owl perching on the windowsill, letter in it's beak. Harry could immediately see that the letter was addressed to him, and curiosity peaked he set down his book and opened the window, inviting the owl in and accepting the letter. The owl just looked at him, waiting for something, and so Harry looked around his room, spotting the chocolate bar he'd been nibbling at. Breaking off a square he offered it to the bird who accepted it happily before swooping off back out the window. Harry watched until he couldn't see the owl anymore and then turned his attention back to the letter. It was heavier than a normal letter and the paper felt thick. The address was handwritten and addressed as such;\nMr. H Potter\nNorth-facing Bedroom on the 27th Floor\n200 Park Avenue\nNew York, NY.\nOn the reverse, the letter was sealed with red wax with a crest pressed into it, the symbol of the place where the letter had come from, but Harry didn't know what it could mean. Curious, Harry tentatively began to pull at the seal of the letter before hesitating. He knew his aunt would likely wish to see the letter first – to make sure it wasn't dangerous – but Harry had never had a letter addressed to himself before and it did seem a bit curious that the letter knew exactly where he was – without being able to help himself he broke the seal and pulled out the letter. His surprise only grew as he read what the envelope had contained.\nThe letter read as follows;\n\nHOGWARTS SCHOOL OF WITCHCRAFT AND WIZARDRY\nHeadmaster: Albus Dumbledore\n(Order of Merlin, First Class, Grand Sorc., Chf. Warlock,\nSupreme Mugwump, International Confed. Of Wizards)\nDear Mr. Potter,\nWe are pleased to inform you that you have a place at Hogwarts School of Witchcraft and Wizardry. Please find enclosed a list of all necessary books and equipment.\nTerm begins on 1 September. We await your owl by no later than 31 July.\n\nYours sincerely,\n\n\nMinerva McGonagall\nDeputy Headmistress\n\nIf that wasn't strange enough, the list that accompanied the letter confused Harry even further.\nHOGWARTS SCHOOL OF WITCHCRAFT AND WIZARDRY\nUniform\nFirst year students will require:\nThree sets of plain work robes (black)\nOne plain pointed hat (black) for day wear\nOne pair of protective gloves (dragon hide or similar)\none winter cloak (black, silver fastenings)\nPlease note that all pupils' clothes should carry nametags.\nSet Books\nAll students should have a copy of each of the following:\nThe Standard Book of Spells (Grade 1) by Miranda Goshawk\nA History of Magic by Bathilda Bagshot\nMagical Theory by Adalbert Waffling\nA Beginners' Guide to Transfiguration by Emeric Switch\nOne Thousand Magical Herbs and Fungi by Phyllida Spore\nMagical Drafts and Potions by Arsenius Jigger\nFantastic Beasts and Where to Find Them by Newt Scamader\nThe Dark Forces: A Guide to Self-Protection by Quentin Trimble\nOther Equipment\n1 wand\n1 cauldron (pewter, standard size 2)\n1 set glass or crystal phials\n1 telescope\n1 set brass scales\nStudents may also bring an owl OR a cat OR a toad\n\nPARENTS ARE REMINDED THAT FIRST YEARS ARE NOT ALLOWED THEIR OWN BROOMSTICKS\n\nHarry reread the contents of the envelope three times before finally making for the door, papers in hand.\n“Jarvis, could you please tell me where my aunt Tasha is?”\n“Of course, sir. Your aunt is currently located in your private kitchen with agent Barton. They appear to be making grilled cheeses.” the thought had Harry hurrying his steps excitedly even as he thanked Jarvis, and he found the two adults in the kitchen as promised. The smell of food had Harry's stomach grumbling and his aunt turned as he entered, an affectionate smile on her face. Then her eyes narrowed in on the papers in Harry's hand.\n“What's that, Harry?” Remembering his purpose, Harry dutifully held up the letter for his aunts inspection.\n“I received a letter. An owl brought it to my bedroom window. It says I've been accepted to Hogwarts School of Witchcraft and Wizardry, but I didn't know there was such a thing.” Harry told her even as she read the letter for herself, tilting the paper so Clint could read it over her shoulder.\n“Jarvis?” Clint asked, and the AI didn't need to be directed further.\n“Though there are no official records of any school under the name of Hogwarts, there is sufficient evidence that schools serving the same purpose could exist.” Natasha nodded and since it was obvious the letter wasn't harmful returned it to Harry's eager hands. She watched her nephew read the letter over again, eyes wide with childlike joy, and Natasha just exchanged a look with Clint.\n“Go talk to Stark. I'm going to call Coulson, see if he knows anything.” she turned to Harry then who at her words looked markedly less excited.\n“Are you angry with me? For opening the letter?”\n“A bit worried it might have been dangerous, but no, I'm not angry. It must have been really exciting to have a letter delivered by an owl.” Harry's excitement returned full force.\n“May I have an owl to send letters with, aunt Tasha? The list says I could bring one – then I can write to you everyday!” the words had Natasha blinking in shock.\n“You want to go?” Harry was nodding before he could even help himself.\n“It will be so exciting! Everyone there will know magic too and it would be quite fun, I would think, to have friends my own age.” then he flushed, embarrassed. “Not to say you aren't wonderful company aunt Tasha.” He hastily added and Natasha smiled though her chest felt tight with anxiety. If by some strange chance this school was real and was safe – was she ready to let Harry go off to school? Even as she had the thought the excitement on Harry's face was enough to sway her. If this was real and it was something he really wanted, she wouldn't deny it from him. Before she could help herself she found herself nodding.\n“Well I better call Coulson then. We have to find the school first before you can go.”\nIt took only took them 2 days to find out the truth about the school but it didn't come in the form of any research done by the team or their outside sources, instead it came in the form of a hulking giant of a man riding a motorbike that appeared out of thin air to land on the helicarier pad. Harry was drawing with Steve when the man arrived and they both found themselves staring in shock as the giant man got off his bike and caught sight of them through the window. Then he was waving cheerfully, big grin visible even through his bushy beard. The two exchanged glances before Steve got up, Harry right behind him, opening the door that lead outside.\n“Yeh must be Harry. Mind, yeh were a tiny little thing when I last saws yeh.” the man said cheerfully. “Who are you?” the man said next, looking at Steve, and Harry piped up, fascinated by this giant man.\n“This is my uncle, Steve.”\n“Well then, it sure is a pleasure, let me introduce meself. Rubeus Hagrid, Keeper of Keys and Grounds at Hogwarts, but yeh can call me Hagrid, everyone does.”\n“So it is a real place then?” Harry asked, unable to believe his luck, but Steve was frowning.\n“Harry, don't you think your aunt would like to meet Hagrid?” Steve said carefully, and Harry nodded so hard it looked like his head might roll right from his shoulders.\n“Jarvis? Could you please call my aunt and tell her that a man from Hogwarts has arrived?”\n“She is already on her way, sir.” Jarvis replied, but unlike most people Hagrid didn't startle at the disembodied voice.\n“Well then, Harry. Dumbledore, that's professor Dumbledore, mind, he sent me to make sure ye'd read and understood yer letter – he was very surprised yeh were able to open it at all!”\n“Why's that?” Harry asked, and Steve frowned again, wondering just how it was this Dumbledore character – the Headmaster if he remembered correctly – knew that Harry had opened his letter. Of course, if the letter was true, he supposed it was magic. Before Hagrid could answer Harry's question, the elevator dinged and Natasha appeared, moving right over to stand beside Harry. At the sight of her though, Hagrid looked as surprised as Harry thought he should have upon hearing Jarvis.\n“Blimey, yeh look an awful lot like 'er.” Natasha's eyes narrowed but Harry found himself looking up at his aunt curiously.\n“Like who?”\n“Like yer mum.” At those words Harry stilled and Natasha reached for him, placing a soothing hand on his shoulder. Realizing what he'd said Hagrid shifted awkwardly, looking around before his eyes settled on Steve and he seemed to realize what he was there for. With a cough, he started again. “Right then, well it would only be right, you going to Hogwarts – following in their footsteps.”\n“My parents went to Hogwarts?” Hagrid nodded eagerly.\n“Where did yeh think they learnt it all?”\n“All what?” Hagrid just stared, and seemed to notice that all three faces were looking back at him in confusion.\n“Well, magic of course.” It took a moment but then Harry was grinning wide, looking up at his aunt with that same thrilled expression.\n“My mum and dad knew magic.” Harry murmured, awed, and she managed a smile for him before she turned her gaze back on the giant.\n“How do we know you're telling the truth?” Natasha asked, and Hagrid frowned as if he'd never considered that they wouldn't believe him. Then he just looked at Harry.\n“Haven't yeh ever done somethin', somethin' that nobody else could do?” Harry could only nod, and even Natasha and Steve couldn't argue with that.\n“But I don't understand.” Harry said after a pause, and despite having all eyes on him now it didn't dissuade him from speaking as it once would have. “If my parents could use magic – how could something as normal as a car crash kill them?” Steve looked like Harry had just stomped on his heart and Natasha felt him take her hand even as she felt the throb of regret in her chest. She never had been able to figure out what did actually happen to her late-sister and her husband, and she wished she could've found a way for the question to never be asked.\n“Car crash?” Hagrid repeated, obviously seeming shocked, and then he just shook his head, hands all but wringing with unease. He looked at Natasha but she could only shake her head, admitting to knowing nothing. The giant seemed to sigh and glanced back at the bike almost as if he was considering running, but then he heaved another sigh and spoke. “Yer parents didn't die in a car crash, Harry.”\n&gt;&gt;&gt;\nMurdered. The word crashed around in Harry's skull like a car wreck of it's own, and Harry wondered how on earth the Dursleys could keep such a thing from him. Hagrid had told him, his aunt Tasha, and his uncle Steve the story – how a dark wizard named Voldemort had gone after his family intent on killing them, but after having killed his parents, when he went to finally kill Harry the spell rebounded and killed him instead, leaving Harry with the lightning bolt scar on his forehead and no parents to speak of. After telling the story, his aunt had politely but firmly ordered Hagrid to leave and Harry supposed even magical giants could be afraid of his aunt because with an apologetic dip of his head the man had climbed back on his motorcycle and flown off. Curled up in his hiding spot on the roof Harry wondered briefly when his uncle Clint would be home because despite his joking exterior, Harry always found it easiest to talk to uncle Clint about his family – or perhaps, better put, the Dursleys and the Potters. It wasn't that he didn't talk to his aunt Tasha – he talked to her about a whole number of things, and often the same things he spoke of with his uncle Clint, but sometimes it was easier to go to his uncle with them first. It didn't help that ever since he'd heard the story he kept remembering the same flash of green light that always lived in his nightmares, but this time it was paired with a high, cold, and cruel laugh. He curled up smaller in his hiding place, wondering now if his aunt was still with his uncle Steve in the common room, and wondered if they were talking about what Hagrid had told them.\n“So I hear you're famous.” his uncle Clint's voice cut through his thoughts and his head shot up, smile coming to his face despite the turmoil in his thoughts. Then he realized just what his uncle had said and his smile dropped.\n“He said my scar is the mark of a dark curse.” Harry finally replied, and Clint shrugged, dropping down on the roof next to Harry's hiding spot, unfurling his legs so he could lounge against the side of the building.\n“Do you believe him?”\n“I don't disbelieve him. After all, it does hurt whenever I have nightmares.” Clint just shrugged.\n“Cursed or not, it's just a scar. Not you.” the words made him feel better before he'd even realized he was looking for them, and he managed another smile.\n“Does this mean the school is real then?” Harry asked, and Clint just tilted his gaze in Harry's direction.\n“Seems likely. Still wanna go?”\n“I wouldn't mind. I haven't been to school since I lived with the Dursleys. I think I would enjoy it.”\n“Plus you could learn how to hex your way out of being grounded.” at the words Harry's smile widened, sparkle of mischief gleaming in his eyes. It made Clint happy to see the light there, when in his younger years there had mostly been fear and anxiety. The mischief disappeared behind worry though and a shadow of the old anxiety returned.\n“I don't think aunt Tasha wants me to go. She's never seen it before, and I know how she feels about strange places she's neither seen nor heard of.”\n“Your aunt Tasha just wants what's best for you. Even if it means going off to a magical school she knows nothing about.” Clint paused. “I would've liked to meet that Hagrid guy, though. I want to know where we're supposed to find all the stuff on that list of yours.”\n“You think going to Hogwarts is what's best for me?” Harry asked, and Clint turned his head to regard the boy, seeing in the open curiosity just how much the boy had grown into himself. He was proud to have been a part of it, he realized, proud that Harry cared enough for his opinion to ask for it sincerely, and proud that they'd been able to raise him to no longer be afraid to speak his mind.\n“I do, kid.” was the reply he gave, watching Harry's face carefully for his reaction. “I think it'll be good for you to mingle with kids your own age, get into some trouble, spend some time away from home. We'll be here if you need us. In fact, I wouldn't mind travelling to wherever this school was to visit.”\n“It sounds like a boarding school, uncle Clint. I don't think we're allowed visitors really.”\n“Not even on weekends?” at that Harry rolled his eyes.\n“Well, maybe on weekends.” Clint grinned, climbing to his feet and ruffling Harry's hair.\n“That's the spirit. Come on. Time for dinner, then I think we're going to play capture the flag. Thor, Jane, and Darcy are coming. I heard even Parker might show up.” Harry grinned, climbing to his feet to follow his uncle inside and wondering just when he'd find out more about the school he was more and more desperate to attend.\nHarry's wishes were answered even sooner than the last time when another owl appeared with another letter attached to it's leg. He was with his aunt this time, and she watched, bemused, as Harry retrieved the letter, giving the bird a treat before watching it fly off. With a glance at his aunt who offered a nod, he opened the letter.\n\nDear Mr. Potter,\n\n\nDue to your unusual circumstances, it has been agreed upon that a representative of Hogwarts School of Witchcraft and Wizardry will be sent to meet with you and your family to discuss your enrolment into our school.\nOur representative will arrive before dusk tomorrow evening.\n\n\nYours sincerely,\n\n\nMinerva McGonagall\nDeputy Headmistress\n\nOnce read, he passed the letter to his aunt for her inspection, watching her surprise in the way her eyebrows rose ever so slightly. Then she looked up at him, and he didn't know what she saw, but whatever it was had her smiling, an expression he returned happily.\n“We should tell everyone else. They'll want to meet whoever it is too.” Harry said, and his aunt nodded.\n“You're right. Let's find them all.”\nThe moment dusk fell the next day, a middle aged woman with sharp features and rectangular glasses appeared in the lobby. It was an improvement to Hagrid's appearance on the balcony, but her dark emerald robes still drew much attention. Upon her request for an audience with Mr. Potter, she was met in the lobby by Tony and Clint, and upon confirming that she was indeed from Hogwarts, was escorted upstairs to where Harry, his aunt, and the rest were waiting. Her eyes passed over the group, resting on Natasha and Harry, and nobody missed how her eyes lingered on Natasha before falling on the boy.\n“Hello Mr. Potter. I'm deputy headmistress Minerva McGonagall, and professor of transfiguration at Hogwarts.”\nHarry offered her a slight smile.\n\"It's a pleasure to meet you.\" Harry offered, gratified at the small smile he received in return. Then her expression grew stern and Harry realized it was an expression he'd probably see a lot of.\n\"Now then. Before I begin, do any of you have any questions?\"\n\"Where is this school?\" Natasha asked first, and the professor didn't even hesitate.\n\"Scotland. Though it is protected by hundreds of spells to make it impossible to find if you don't already know where it is.\" Clint and Natasha exchanged glances, taking it more as a challenge than a warning before turning their attention back to the professor who seemed to be watching them with something akin to amusement.\n\"What currency do they use in your world? Is it the euro or do you have your own monetary system?\" Tony asked, and McGonagall's look was appraising as she looked at the billionaire over her glasses.\n\"We do have our own form of currency, but Mr. Potter needn't worry about that - his parents left him enough to live comfortably in our world alone.\" The words were said gently, but that didn't take away the reminder that his parents were dead and this was their world he was stepping into.\n\"Does everyone really know me?\"\nThe look in McGonagall's eyes softened further.\n\"They know of you, Mr. Potter. The only people who know you will be the ones who care enough to befriend you all on their own.\" That earned her a smile from not only Harry but the rest as well, and so with a wave of her hand she conjured up a chair, enjoying the awe at the show of magic before settling in. \"Now. In regards to your books and classes.\"\n \n \n \n "
}