{
    "id": "11314398",
    "url": "https://archiveofourown.org/works/11314398?view_full_work=true",
    "author": [
        "sincere_lies"
    ],
    "title": "(honey) there is no right way",
    "rating": "General Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Gen",
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Cedric Diggory/Harry Potter"
    ],
    "characters": [
        "Harry Potter",
        "Cedric Diggory",
        "Ron Weasley",
        "Hermione Granger",
        "Luna Lovegood",
        "Viktor Krum"
    ],
    "additional_tags": [
        "Groundhog Day",
        "Temporary Character Death",
        "Time Loop",
        "Cedric Diggory Lives",
        "repeating scenes",
        "Happy Ending",
        "more like",
        "Hopeful Ending",
        "Pre-Relationship",
        "but everyone knows they are stupid for each other",
        "the author apologizes for not sticking to a verb tense",
        "中文翻译 | Translation in Chinese"
    ],
    "language": "English",
    "series": "",
    "published": "2017-06-27",
    "completed": null,
    "words": "24,511",
    "chapters": "1/1",
    "comments": "352",
    "kudos": "11,685",
    "bookmarks": "2,621",
    "hits": "119,356",
    "summary": "<p>‘Have you tried everything?’ Hermione asked insistently.</p>\n<p>‘Yes! Every time I get to the cup and Cedric doesn’t take it with me I go immediately back to my bed in the morning. But all the times he is with me, he dies and after I fall asleep I return too.’</p>\n<p>‘I guess it is obvious then, isn’t it?’ Both Harry and Hermione turned to stare at Ron, who looked at them defensively and shrugged ‘You have to go with Diggory and make sure he survives.’</p>\n<p>Harry/Cedric - Groundhog day AU</p>",
    "notes": "<p>Groundhog Day AU. Another trope I have no idea why I love so much. Anyways, I actually have another Hadric fic on the works but this one begged me to be finished and posted first. It is easier since it is only an oneshot.</p>\n<p>A lot of this will come out straight from the book for me to meddle with so; all recognizable writing is J.K. Rowling’s and of course not my own.</p>\n<p>Title from Someone New by Hozier.</p>\n<p>******<br>Translation in Chinese now available thanks to @Aurora7195!!!</p>\n<p>①【授权翻译】【HP/塞哈】(honey) there is no right way 今日复今日<br><a href=\"http://www.luvharry.net/bbs/forum.php?mod=viewthread&amp;tid=49418\" rel=\"nofollow\">http://www.luvharry.net/bbs/forum.php?mod=viewthread&amp;tid=49418</a><br>(出处: 猫爪论坛)<br>②<a href=\"https://bjyxszd3895.lofter.com/post/1dceadb1_2b49b51a5\" rel=\"nofollow\">https://bjyxszd3895.lofter.com/post/1dceadb1_2b49b51a5</a></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>(Edit 12/06/2018) First of all, please go see the amazing work <a href=\"https://archiveofourown.org/users/ElenaHana/pseuds/ElenaHana\" rel=\"nofollow\">ElenaHana</a> made for this: <a href=\"https://twitter.com/Hanatsuki89/status/1069790372140863488\" rel=\"nofollow\">On twitter</a><br><a href=\"https://hanatsuki89.tumblr.com/post/180778319908/harrycedric-groundhog-day-au-inspired-by-the\" rel=\"nofollow\">On tumblr</a></p>\n<p>This story has art, I can't believe it. It is amazing please give the artist lots of love.</p>\n<p>(Now the original end note)</p>\n<p>Know how I said in at the first note that this was easier? Forget it; it was a lot of work. Can you tell I was fed up with repeating scenes by the end of it? I was.</p>\n<p>But I’m actually pretty happy with it? This grew more than I expected and I really wanted to post it on the 24th or 25th at least. Alas, it didn’t happen. But the 20th anniversary of The Sorcerer’s Stone is a good date too right? (posting date says 27th but is the freaking 26th where I'm at, wtf ao3)</p>\n<p>If you got until this point thank you very much for reading and if you would please tell me what you think? I love Harry Potter so much and was never brave to really write about it. But as I said before I have another Hadric fic on the works and I would really like to know if this didn’t suck you know? Or if anyone is even interested in it.</p>\n<p>Anyway, thanks!</p>",
    "text": "\n \n\n\n\"Mysterious thing, time. Powerful, and when meddled with, dangerous.\" \n\n\n- Albus Dumbledore\n\n \n \nHarry slumped back against his pillows as Dumbledore disappeared. Hermione, Ron and Mrs Weasley were all looking at him. None of them spoke for a very long time.\n \n‘You’ve got to take the rest of your potion, Harry,’ Mrs Weasley said at last. Her hand nudged the sack of gold on his bedside cabinet as she reached for the bottle and the goblet. ‘You have a good long sleep. Try and think about something else for a while … think about what you’re going to buy with your winnings!’\n \n‘I don’t want that gold,’ said Harry in an expressionless voice. ‘You have it. Anyone can have it. I shouldn’t have won it. It should’ve been Cedric’s.’\n \nThe thing against which he had been fighting on and off ever since he had come out of the maze was threatening to overpower him. He could feel a burning, prickling feeling in the inner corners of his eyes. He blinked and stared up at the ceiling.\n \n‘It wasn’t your fault, Harry,’ Mrs Weasley whispered.\n \n‘I told him to take the Cup with me,’ said Harry.\n \nNow the burning feeling was in his throat, too. He wished Ron would look away.\n \nMrs Weasley set the potion down on the bedside cabinet, bent down, and put her arms around Harry. He had no memory of ever being hugged like this, as though by a mother. The full weight of everything he had seen that night seemed to fall in upon him as Mrs Weasley held him to her. His mother’s face, his father’s voice, the sight of Cedric, dead on the ground, all started spinning in his head until he could hardly bear it, until he was screwing up his face against the howl of misery fighting to get out of him.\n \nThere was a loud slamming noise, and Mrs Weasley and Harry broke apart. Hermione was standing by the window. She was holding something tight in her hand.\n \n‘Sorry,’ she whispered.\n \n‘Your potion, Harry,’ said Mrs Weasley quickly, wiping her eyes on the back of her hand.\n \nHarry drank it in one. The effect was instantaneous. Heavy, irresistible waves of dreamless sleep broke over him, he fell back onto his pillows, and thought no more.\n \nWhen Harry opened his eyes he didn’t immediately notice anything wrong. He saw the blurry top of his four poster bed and the red curtains blocking the light. It wasn’t until he put his glasses on that he remembered he should be in bed in the hospital wing; with its white linen sheets and not a red comforter. He looked down at it and wondered if someone had moved him in the middle of the night.\n \nNo. Madam Pomfrey would never allow him out of her sight so easily.\n \nHarry got up and noticed none of his roommates were in their beds; Ron must have known he would not want anyone waking him. So he got dressed mechanically and dared not look in the mirror. When he got down he saw Ron and Hermione were actually waiting for him.\n \n‘Finally, mate. Breakfast has started already.’ Ron said and Harry had to pause for a moment. Neither of them looked like anything was wrong; Ron was fidgeting to get to breakfast and Hermione was doing what looked last minute History of Magic revising.\n \n‘Hermione, why are you reading that? Exams ended yesterday.’ Harry was astonished at how she could be studying at a time like this, like Voldemort hadn’t just returned the night before and Cedric wasn’t dead.\n \n‘What are you talking about, Harry? Yesterday was Charms; today is the last one. Are you okay?’ Hermione put down her notes and looked at Harry in concern; he was starting to frown.\n \n‘She’s right, mate. You look a little off. Nervous about the third task? We practiced loads; I’m sure you’ll be fine.’ Ron smiled encouragingly at him but Harry could honestly not understand a word his friend had just said.\n \n‘What?’\n \n‘Harry, maybe you should sit a bit. You look like you’re about to fall over.’ Hermione got up from her chair and came to stand close to Harry as if she thought she might have to catch him if he did fall over.\n \n‘The third task is today?’ That couldn’t be right; the third task had been yesterday.\n \n‘Did someone throw a confundus on you mate? How could you forget it?’\n \n‘Maybe we should take him to the hospital wing.’\n \n‘No! I’m fine. Just – today is still the 24th?’\n \n‘Yes, Harry.’ Hermione said warily, still looking at him as though Harry might fall over.  ‘Are you sure –’\n \n‘Yes, Hermione, let’s just – let’s go to breakfast.’ It was a testament on how really off he must look that Ron didn’t immediately agree; he and Hermione just shared a long look before sighing and heading toward the portrait entrance. Before they left Harry caught a look of himself in one of the mirrors in the common room.\n \nThe face looking back at him indeed seemed very confused and nervous but otherwise the same as always. No bruising or cuts anywhere. Of course Madam Pomfrey could have gotten rid of them in a second but Harry was beginning to wonder if he had got them at all. While he walked there was no pain on his leg and discretely he pulled his sleeve up and on his arm there was also no long cut from Wormtail.\n \nWas it all just a terrible dream?\n \nBreakfast was a very noisy affair at the Gryffindor table on the morning of the third task. The post owls appeared, bringing Harry a good-luck card from Sirius. He stared at the folded parchment knowing it only bore a muddy paw print on it; he opened and was right. The paw didn’t give him the assurance it had the first time he saw it. Wasn’t this his first time seeing it?\n \nSoon enough a screech owl arrived for Hermione, carrying her morning copy of the Daily Prophet as usual. Harry counted the seconds before Hermione would spat out a mouthful of pumpkin juice all over it.\n \nSeven seconds.\n \n‘What?’ said Ron, staring at her. Harry also stared but he knew what was written on the paper. He knew.\n \n‘Nothing,’ said Hermione quickly, trying to shove the paper out of sight, but Ron grabbed it.\n \nHe stared at the headline, and said, ‘No way. Not today. That old cow.’\n \n ‘Rita Skeeter again?’ said Harry, if only for the fact that he didn’t know what else to do. Had no idea what the hell was happening.\n \n‘No,’ said Ron, and just like Hermione, he attempted to push the paper out of sight.\n \n‘Let me guess, she is saying that I’m ‘disturbed and dangerous’, isn’t she?’ said Harry.\n \nRon and Hermione gaped identically at him and it would have been very funny if Harry wasn’t feeling very off kilter. But soon enough Draco Malfoy shouted across the Great Hall from the Slytherin table.\n \n‘Hey, Potter! Potter! How’s your head? You feeling all right? Sure you’re not going to go berserk on us?’\n \nMalfoy was holding a copy of the Daily Prophet, too. Slytherins up and down the table were sniggering, twisting in their seats to see Harry’s reaction.\n \nHarry gave none; he just stared vaguely at the paper Ron was still holding. His friend must have thought that meant Harry wanted to see it and very reluctantly, Ron handed over the newspaper. Harry turned it over, and found himself staring at his own picture, beneath a banner headline:\n \n\nHARRY POTTER ‘DISTURBED AND DANGEROUS’\n\n\n \n\n\n \n\nHe didn’t bother to read any of it; he already knew what it said. But he kept staring at it as if it would change. As if the date would change or the words; anything that didn’t say he was going crazy.\n \n‘Gone off me a bit, hasn’t she?’ said Harry once again faintly, folding up the paper and ignoring Malfoy make an idiot of himself back over the Slytherin table.\n \nRon and Hermione kept talking about how it was possible that Skeeter could have known Harry’s scar hurt in Divination but Harry paid no attention to them. He just kept on thinking how everything was just the same.\n \nIt couldn’t be right. He couldn’t really have dreamt a whole day before it happened could he? Maybe he should start considering applying himself more in Divination because things were starting to get eerie when Harry looked up and saw Hermione rushing out of the Great Hall. To the library certainly.\n \n‘Oi!’ Ron called after her. ‘We’ve got our History of Magic exam in ten minutes! Blimey,’ he said, turning back to Harry, ‘she must really hate that Skeeter woman to risk missing the start of an exam. What’re you going to do in Binns’s class – read again?’\n \n‘I don’t think so.’ If he was right McGonagall would come up to him any moment now; he didn’t know if he rather be wrong or not. ‘Why did Hermione run off?’ Harry remembered she had run off before after he said something about bugging; he said nothing this time though. Maybe something changed, maybe nothing changed. Maybe he was dreaming right now and he actually made no difference in the occurrences of the day.\n \n‘I asked her about that insect thing you were talking about that Skeeter could be doing. Then she just did that Hermione thing she does; starting talking nothing that made sense and ran off to the library. Honestly, we have an exam; whatever it is must be bloody important.’\n \n‘S’pose so,’ Harry said to Ron; but he didn’t really know since Hermione never actually told them whatever she had figured it out. Just then Professor McGonagall came walking along the Gryffindor table towards him, just like he knew she would.\n \n‘Potter, the champions are congregating in the chamber off the Hall after breakfast,’ she said.\n \n‘Yeah, alright.’ said Harry not even reacting and McGonagall raised an eyebrow at him like she expected more of an argument.\n \n‘The champions’ families are invited to watch the final task, you know. This is a chance for you to greet them.’ She looked at him expectantly and when Harry just nodded he could see a slight frown forming on her face.\n \nShe moved away. Harry just looked after her.\n \nRon seemed oddly uncomfortable, most likely thinking about the so called family Harry had. So he just cleared his throat and got up. ‘Harry, I’d better hurry, I’m going to be late for Binns. See you later.’ Exactly like he had said before.\n \nHarry played with the remains of his breakfast in the emptying Great Hall and watched. He saw Fleur Delacour get up from the Ravenclaw table and join Cedric as he crossed to the side chamber and entered. Krum slouched off to join them shortly afterwards. Harry stayed where he was. It was exactly the same. Any moment now Cedric would come out and tell him how they were waiting for him; Mrs. Weasley and Bill. But Harry wasn’t supposed to know that.\n \nHe almost hoped for no one to show up if only it would make him feel more normal but no luck. The door of the side chamber opened, and Cedric stuck his head out.\n \n‘Harry, come on, they’re waiting for you!’ Harry felt his breath hitch hearing the voice. There Cedric was, his handsome face looking back at him and smiling at Harry. There Cedric was very much alive and Harry had to close his eyes at the onslaught of images of that face cold and pale on the ground of the graveyard.   \n \nSo, shaking himself of the images - memories? -, Harry got up walked across the Hall and opened the door into the chamber.\n \nCedric and his parents were just inside the door. Viktor Krum was over in a corner, conversing with his dark-haired mother and father in rapid Bulgarian. He had inherited his father’s hooked nose. On the other side of the room, Fleur was jabbering away in French to her mother. Fleur’s little sister, Gabrielle, was holding her mother’s hand. She waved at Harry, who waved back. Then he saw Mrs Weasley and Bill standing in front of the fireplace, beaming at him just like they had the day before.\n \nToday.\n \nHarry had no idea.\n \n‘Surprise!’ Mrs Weasley said excitedly, as Harry couldn’t help but smile back even with the way his mind was spinning. ‘Thought we’d come and watch you, Harry!’ She bent down and kissed him on the cheek.\n \n‘You all right?’ said Bill, grinning at Harry and shaking his hand. ‘Charlie wanted to come, but he couldn’t get time off. He said you were incredible against the Horntail.’\n \n‘This is really nice of you,’ Harry muttered to Mrs Weasley.\n \n‘It’s great being back here,’ said Bill, looking around the chamber (Violet, the Fat Lady’s friend, winked at him from her frame). ‘Haven’t seen this place for five years. Is that picture of the mad knight still around? Sir Cadogan?’\n \n‘Oh, yeah,’ said Harry, who had met Sir Cadogan the previous year.\n \n‘And the Fat Lady?’ said Bill.\n \n‘She was here in my time,’ said Mrs Weasley. ‘She gave me such a telling-off one night when I got back to the dormitory at four in the morning –’\n \n‘What were you doing out of your dormitory at four in the morning?’ said Bill, surveying Mrs Weasley with amazement.\n \nMrs Weasley grinned, her eyes twinkling.\n \n‘Your father and I had been for a night-time stroll,’ she said. ‘He got caught by Apollyon Pringle – he was the caretaker in those days – your father’s still got the marks.’\n \n‘Fancy giving us a tour, Harry?’ said Bill.\n \n‘Yeah, OK,’ said Harry, and he was glad he hadn’t actually eaten much at breakfast because he felt like he would be sick.\n \nHe had no way of knowing that story but he did. He had heard the exact same thing before. And any moment now they would pass the Diggorys and Cedric’s father would call him out.\n \n ‘There you are, are you?’ And there it was. Amos Diggory looking Harry up and down. ‘Bet you’re not feeling quite as full of yourself now Cedric’s caught you up on points, are you?’\n \nHarry said nothing, just stared.\n \n‘Ignore him,’ said Cedric in a low voice to Harry, frowning after his father. ‘He’s been angry ever since Rita Skeeter’s article about the Triwizard Tournament – you know, when she made out you were the only Hogwarts champion.’\n \n‘Didn’t bother to correct her, though, did he?’ said Amos Diggory, loudly enough for Harry to hear as he made to walk out of the door with Mrs Weasley and Bill. ‘Still … you’ll show him, Ced. Beaten him once before, haven’t you?’\n \n‘Rita Skeeter goes out of her way to cause trouble, Amos!’ Mrs Weasley said angrily. ‘I would have thought you’d know that, working at the Ministry!’\n \nMr Diggory looked as though he was going to say something angry, but his wife laid a hand on his arm, and he merely shrugged and turned away.\n \nHarry tried very hard to enjoy the walk over the sunny grounds with Bill and Mrs Weasley, showing them the Beauxbatons carriage and the Durmstrang ship. Mrs Weasley kept talking about Whomping Willow, which had been planted after she had left school, and reminisced at length about the gamekeeper before Hagrid, a man called Ogg. But every now and then she would just throw a very concerned look at Harry, probably noticing his mind was elsewhere and assuming it was about the tournament.\n \n‘How’s Percy?’ Harry asked, as they walked around the greenhouses if only to have something to talk about.\n \nThey talked about how the Ministry was hushing up Mr. Crouch disappearance and Harry heard nothing. He was thinking about another particular Crouch and how, if he was not going crazy, there was an insane murderer in the Castle.\n \nThey returned to the castle for lunch.\n \n‘Mum – Bill!’ said Ron, looking stunned, as he joined the Gryffindor table. ‘What’re you doing here?’\n \n‘Come to watch Harry in the last task!’ said Mrs Weasley brightly. ‘I must say, it makes a lovely change, not having to cook. How was your exam?’\n \n‘Oh … OK,’ said Ron. ‘Couldn’t remember all the goblin rebels’ names, so I invented a few. It’s all right,’ he said, helping himself to a Cornish pasty, while Mrs Weasley looked stern, ‘they’re all called stuff like Bodrod the Bearded and Urg the Unclean, it wasn’t hard.’\n \nFred, George and Ginny came to sit next to them, too, and Harry almost relaxed completely with how it felt they were back at The Burrow; he even tried hard to ignore how he had to explain once again to Mrs. Weasley how Hermione was in no way his girlfriend and how the older woman became so much warmer to his friend later.\n \nHarry, Bill and Mrs Weasley whiled away the afternoon with a long walk around the castle, and then returned to the Great Hall for the evening feast. Everything was again the same and once the enchanted ceiling overhead began to fade from blue to a dusky purple, Dumbledore rose to his feet at the staff table, and silence fell.\n \n‘Ladies and gentlemen, in five minutes’ time, I will be asking you to make your way down to the Quidditch pitch for the third and last task of the Triwizard Tournament. Will the champions please follow Mr Bagman down to the stadium now.’\n \nHarry got up. The Gryffindors all along the table were applauding him; the Weasleys and Hermione all wished him good luck, and he headed off out of the Great Hall, with Cedric, Fleur and Krum.\n \n‘Feeling all right, Harry?’ Bagman asked, as they went down the stone steps into the grounds. ‘Confident?’\n \n‘I’m OK,’ said Harry. It was a complete lie; he was nervous, he kept expecting something to change. Anything. He hoped once he was inside the maze it would.\n \nThere was no way he could know exactly what was in the maze.\n \nThey walked onto the Quidditch pitch, which was now completely unrecognisable. A twenty-foot-high hedge ran all the way around the edge of it. There was a gap right in front of them; the entrance to the vast maze. The passage beyond it looked dark and creepy.\n \nFive minutes later, the stands had begun to fill; the air was full of excited voices and the rumbling of feet as the hundreds of students filed into their seats. The sky was a deep, clear blue now, and the first stars were starting to appear. Hagrid, Professor Moody, Professor McGonagall and Professor Flitwick came walking into the stadium and approached Bagman and the champions. They were wearing large, red, luminous stars on their hats, all except Hagrid, who had his on the back of his moleskin waistcoat.\n \n‘We are going to be patrolling the outside of the maze,’ said Professor McGonagall to the champions. ‘If you get into difficulty, and wish to be rescued, send red sparks into the air, and one of us will come and get you, do you understand?’\n \nThe champions nodded.\n \n‘Off you go, then!’ said Bagman brightly to the four patrollers.\n \n‘Good luck, Harry,’ Hagrid whispered, and the four of them walked away in different directions, to station themselves around the maze. Bagman now pointed his wand at his throat, muttered ‘Sonorus’, and his magically magnified voice echoed into the stands.\n \n‘Ladies and gentlemen, the third and final task of the Triwizard Tournament is about to begin! Let me remind you how the points currently stand! Tied in first place, on eighty-five points each – Mr Cedric Diggory and Mr Harry Potter, both of Hogwarts School!’ The cheers and applause sent birds from the Forbidden Forest fluttering into the darkening sky. ‘In second place, on eighty points – Mr Viktor Krum, of Durmstrang Institute!’ More applause. ‘And in third place – Miss Fleur Delacour, of Beauxbatons Academy!’\n \n‘So … on my whistle, Harry and Cedric!’ said Bagman. ‘Three – two – one –’\n \nHe gave a short blast on his whistle, and Harry and Cedric hurried forwards into the maze.\n \nThe towering hedges cast black shadows across the path, and, whether because they were so tall and thick, or because they had been enchanted, the sound of the surrounding crowd was silenced the moment they entered the maze. Harry felt his trepidation increase, so far it was all the same still. He pulled out his wand, muttered ‘Lumos’, and heard Cedric do the same just behind him.\n \nAfter about fifty yards, they reached a fork. They looked at each other.\n \n‘See you,’ Harry said, and he took the left one, while Cedric took the right. For a moment he almost changed his path and went right but he had to know.\n \nTo know if it was the same.\n \nIt was.\n \nHarry walked and walked and nothing came. He didn’t use the ‘point me’ spell this time. He knew where he was going and just kept going. And there was nothing beside the hedges of the maze growing darker and darker and that feeling of being watched upon him.\n \nFinally he heard movement right behind him. He held out his wand, and its beam fell only upon Cedric, who had just hurried out of a path on the right-hand side like Harry already knew he would. Cedric looked severely shaken. The sleeve of his robes was smoking.\n \n‘Hagrid’s Blast-Ended Skrewts!’ he hissed. ‘They’re enormous – I only just got away!’\n \nHe shook his head, and dived out of sight, along another path. Keen to put plenty of distance between himself and the Skrewts, Harry hurried off again. Then, as he turned a corner, he saw –\n \nA Dementor was gliding towards him. But it wasn’t a Dementor, Harry knew better this time and immediately cast a Riddikulus at it and making it explode in a wisp of smoke.\n \nHe almost cast his patronus again anyway; if only he could have the reassuring presence of his stag near. He carried on.\n \nLeft … right … left again … right turn, and saw the odd golden mist floating ahead of him.\n \nHarry approached it cautiously, pointing the wand’s beam at it. He still hesitated, because any moment now a scream would shatter the silence.\n \nAnd there it was and the silence afterword once again. Krum attacked Fleur most likely. Because he was under an Imperius that a lunatic Death Eater cast on him.\n \nHarry didn’t know what to do but he did know what came next. He kept going.\n \nThe world turned upside-down. Harry was hanging from the ground, with his hair on end, his glasses dangling off his nose, threatening to fall into the bottomless sky. He clutched them to the end of his nose and hung there, terrified. Because it didn’t matter if he had done this before; to have the world turn upside down was always going to be upsetting.\n \nBut then he closed his eyes again and just took a step as far as he could and the world righted itself. Harry fell forwards onto his knees on the wonderfully solid ground. He stayed there for a moment before getting up again and putting distance between him and the golden mist.\n \nHe continued to meet nothing and when he came upon the path that he knew would bring him to the Blast-Ended Skrewt he briefly considering taking another one.\n \nBut he didn’t want to risk missing something. There was something important happening and Harry could not back down from it.\n \nSo he rounded another corner, and found himself facing a Blast-Ended Skrewt. Cedric was right – it was enormous. Ten feet long, it looked more like a giant scorpion than anything. Its long sting was curled over its back. Its thick armour glinted in the light from Harry’s wand, which he pointed at it.\n \n‘Impedimenta!’ Harry yelled immediately since he already knew stupefy did not work against it. The spell hit the Skrewt’s armour again and ricocheted off; Harry tried again. ‘IMPEDIMENTA!’\n \nThe Skrewt was inches from him when it froze – he had managed to hit it on its fleshy, shell-less underside. Panting, Harry pushed himself away from it and ran, hard, in the opposite direction – soon enough Cedric would run into Krum and Harry really didn’t feel that was something that had to repeat itself.\n \nHe took a left path, and hit a dead end, a right, and hit another: forcing himself to stop and cursing because now was not the time to forget the path, so he performed the Four-Point Spell, backtracked, and chose a path that would take him north-west.\n \nHe had been hurrying along the new path for a few minutes, when he heard it.\n \n‘What are you doing?’ yelled Cedric’s voice. ‘What the hell d’you think you’re doing?’\n \nAnd then Harry heard Krum’s voice.\n \n\n‘Crucio!’\n\n \nThe air was suddenly full of Cedric’s yells. Felling sick, Harry began sprinting up his path, trying to find the way into Cedric’s. When none appeared, he tried the Reductor curse knowing it wasn’t very effective but it was all he had. It burnt a small hole in the hedge, through which Harry forced his leg, kicking at the thick brambles and branches until they broke and made an opening; he struggled through it, tearing his robes and, looking to his right, saw Cedric jerking and twitching on the ground, Krum standing over him.\n \nHarry pulled himself up and pointed his wand at Krum just as Krum looked up. Krum turned and began to run.\n \n‘Stupefy!’ Harry yelled.\n \nThe spell hit Krum in the back; he stopped dead in his tracks, fell forwards and lay motionless, face down in the grass. Harry dashed over to Cedric, who had stopped twitching, and was lying there panting, his hands over his face.\n \n‘Are you all right?’ Harry said roughly, grabbing Cedric’s arm.\n \n‘Yeah,’ panted Cedric. ‘Yeah … I don’t believe it … he crept up behind me … I heard him, I turned round, and he had his wand on me …’\n \nCedric got up. He was still shaking. He and Harry looked down at Krum and the weight on Harry stomach just got heavier. He could have stopped this.\n \n‘Did you hear Fleur scream earlier?’ Cedric asked.  ‘You don’t think Krum got her, too?’\n \n‘I don’t know,’ said Harry slowly. But he did.\n \n‘Should we leave him here?’ Cedric muttered.\n \n‘No,’ said Harry. ‘I reckon we should send up red sparks. Someone’ll come and collect him … otherwise he’ll probably be eaten by a Skrewt.’\n \n‘He’d deserve it,’ Cedric muttered, but all the same, he raised his wand and shot a shower of red sparks into the air, which hovered high above Krum, marking the spot where he lay.\n \nHarry and Cedric stood there in the darkness for a moment, looking around them. Then Cedric said, ‘Well … I s’pose we’d better go on …’\n \n‘What?’ said Harry. ‘Oh … yeah … right …’\n \nAnd once more Harry felt odd. He and Cedric worked well together, he knew it because of the spider they fought together; would have to fight again soon probably. But then the fact that they were opponents came back to them both. They proceeded up the dark path without speaking, and then Harry turned left and Cedric right. Cedric’s footsteps soon died away.\n \nHarry moved on, continuing to use the Four-Point Spell, making sure he was moving in the right direction once again. He couldn’t stop thinking about Krum. The older boy seemed to play fair and what he did, what he was forced to do, was so incredibly wrong that Harry couldn’t help feeling even angrier. It was something that could ruin Krums career; his whole life.\n \nHe shook his head and continued on. Soon he was on the long straight path he knew had a wonderful being on the end.\n \nIt was the sphinx. It had the body of an overlarge lion; great clawed paws, and a long yellowish tail ending in a brown tuft. Its head, however, was that of a woman. She turned her long, almond-shaped eyes upon Harry as he approached.\n \nWhen Harry was close enough she spoke, in a deep, hoarse voice. ‘You are very near your goal. The quickest way is past me.’\n \n‘I have to answer a riddle, right?’ said Harry, knowing what the answer was going to be.\n \n‘Yes,’ she said, continuing to pace and looking pleased that he knew as much. ‘Answer on your first guess – I let you pass. Answer wrongly – I attack. Remain silent – I will let you walk away from me, unscathed.’\n \n‘OK,’ he said. ‘Can I hear the riddle?’ He didn’t have to, he knew the answer already. But it would probably look suspicious and he didn’t dare to risk that she changed it.\n \nThe sphinx sat down upon her hind legs, in the very centre of the path, and recited:\n \n\n‘First think of the person who lives in disguise,\n\n\nWho deals in secrets and tells naught but lies.\n\n\nNext, tell me what’s always the last thing to mend,\n\n\nThe middle of middle and end of the end?\n\n\nAnd finally give me the sound often heard\n\n\nDuring the search for a hard-to-find word.\n\n\nNow string them together, and answer me this,\n\n\nWhich creature would you be unwilling to kiss?’\n\n \nHarry just stared at her. It was the exact same riddle.\n \nHarry just kept on thinking on what to do. The sphinx must have thought he was just thinking on the riddle since she just stared patiently back at him.\n \nIf he answered immediately would she suspect something and attack him anyway? That didn’t seem fair but he couldn’t risk it either. So he asked all the things he asked the first time again.\n \n‘A creature I wouldn’t want to kiss … a spider!’ He finally answered, pretending it was a surprise.\n \nThe sphinx smiled at him. She got up, stretched her front legs, and then moved aside for him to pass.\n \n‘Thanks!’ said Harry, because all in all, the sphinx was rather gracious to him, and he dashed forwards.\n \nHe knew he was close now so he kept forward until he saw it.\n \nThe Triwizard Cup was gleaming on a plinth a hundred yards away. Harry had just broken into a run, when a dark figure hurtled out onto the path in front of him.\n \nCedric was sprinting as fast as he could towards the Cup, and Harry knew he would never catch up, but he also knew that near them was an enormous spider. And soon enough he saw it move.\n \n‘Cedric!’ Harry bellowed. ‘On your left!’\n \nCedric looked around just in time to hurl himself past the thing and avoid colliding with it but, in his haste, he tripped. Harry saw Cedric’s wand fly out of his hand, as a gigantic spider stepped into the path, and began to bear down upon Cedric.\n \n‘Stupefy!’ Harry yelled again; the spell hit the spider’s gigantic, hairy black body but, for all the good it did, he might as well have thrown a stone at it; the spider jerked, scuttled around, and ran at Harry instead.\n \n\n‘Stupefy! Impedimenta! Stupefy!’\n\n \nAnd it was no use – the spider was either so large, or so magical, that the spells were doing no more than aggravating it – Harry knew it was no use but there was nothing else he could do without Cedric’s help so he just kept going until the spider lifted him again.\n \nThis time he went immediately for the Disarming spell and rolling so he wouldn’t fall on his leg again, he managed to point his wand at its underbelly and shout Stupefy just at the same moment Cedric did.\n \nThe two spells combined did what one alone had not – the spider keeled over sideways, flattening a nearby hedge, and strewing the path with a tangle of hairy legs.\n \n‘Harry!’ he heard Cedric shouting. ‘You all right? Did it fall on you?’\n \n‘No,’ Harry called back, panting. He was glad his leg was fine this time though, so he got up leant against the hedge, gasping for breath, and looked around.\n \nCedric was standing a foot from the Triwizard Cup, which was gleaming behind him.\n \nHarry didn’t say anything. He couldn’t. If Cedric touched that cup he could die. Most likely would die.\n \nBut Cedric once again didn’t move. He merely stood there, looking at Harry. Then he turned to stare at the Cup. Harry saw the longing expression on his face in its golden light. Cedric looked around at Harry again, who was now holding onto the hedge to support himself.\n \nCedric took a deep breath and Harry knew what would come out of his mouth. ‘You take it. You should win. That’s twice you’ve saved my neck in here.’\n \n‘That’s not how it’s supposed to work,’ Harry said. He felt lost. He could never just agree to that and at the same time he feared so much that if Cedric touched that cup he would have the same end as before. But Cedric had beaten him to it and he wanted it so much. ‘The one who reaches the Cup first gets the points. That’s you. You actually volunteered for this, you deserve it.’\n \nCedric took a few paces nearer to the Stunned spider, away from the Cup, shaking his head.\n \n‘No,’ he said.\n \nHarry stayed silent because hell if Cedric wasn’t making this harder than it had to be. If Harry was anyone else he could just take it. Take the cup and face Voldemort all on his own and no one had to die.\n \nBut there was still a part of Harry that doubted this was all real. Maybe he had dreamt it. Maybe he was dreaming now.\n \nSo he couldn’t let Cedric miss his chance and he knew the other boy was too fair to have it any other way. So once again he suggested it.\n \n‘Both of us,’ Harry said.\n \n‘What?’\n \n‘We’ll take it at the same time. It’s still a Hogwarts victory. We’ll tie for it.’\n \nCedric stared at Harry. He unfolded his arms. ‘You – you sure?’\n \n‘Yeah,’ said Harry. ‘Yeah … we’ve helped each other out, haven’t we? We both got here. Let’s just take it together.’\n \nFor a moment, Cedric looked as though he couldn’t believe his ears; then his face split in a grin.\n \n‘You’re on,’ he said. ‘Come on.’\n \nHe waited for Harry to start walking and walked together with him, shooting him looks together with that grin like he still couldn’t believe Harry was doing this. When they had reached it, they both held out a hand over one of the Cup’s gleaming handles.\n \n‘On three, right?’ said Harry. ‘One – two – three –’\n \nHe and Cedric both grasped a handle.\n \nInstantly, Harry felt a jerk somewhere behind his navel. His feet had left the ground. He could not unclench the hand holding the Triwizard Cup; it was pulling him onwards, in a howl of wind and swirling colour, Cedric at his side.\n \n \nHarry felt his feet slam into the ground; his hand let go of the Triwizard Cup at last. He raised his head and blanched.\n \nThey were in the graveyard.\n \n‘Cedric, get the cup again.’ he said.\n \nCedric shook his head. He got up, pulled Harry to his feet, and just looked around. Cedric looked down at the Triwizard Cup and then up at Harry.\n \n‘Did anyone tell you the Cup was a Portkey?’ he asked.\n \n‘No,’ said Harry. He was looking around the graveyard panicked. They had to get out of there. But than his scar exploded with pain and he feel to his knees again.\n \nFrom far away, above his head, he heard a high, cold voice say, ‘Kill the spare.’\n\n \n\n\nNo. No…\n\n \nA swishing noise and a second voice, which screeched the words to the night: ‘Avada Kedavra!’\n \nA blast of green light blazed through Harry’s eyelids, and he heard something heavy fall to the ground beside him; but he couldn’t look. Couldn’t look because he knew.\n \nCedric was lying spread-eagled on the ground beside him. He was dead and it was Harry’s fault.\n \nAgain.\n \n \n \nEverything was the same.\n \nThe graveyard. The potion. The Death Eaters.\n \n\nPriori Incantatem.\n\n \nHis parents. Cedric.\n \n\nTake my body back to my parents. \n\n \nAll the same.\n \nSo when it was all done (again) and Harry once more took his dreamless sleep potion, he hoped it was to wake up on the next day.\n \n \n \nWhen Harry opened his eyes and once again wasn’t in the hospital wing Harry knew something was Very Wrong.\n \nHe had just lived the same day twice. Seen everyone do the same things twice. Witnessed Voldemort come back twice. Watched Cedric Diggory die twice…\n \nHe sure as hell didn’t want to do that again.\n \nHarry, however, had absolutely no clue how to fix it.\n \nHis first thought was to go to Hermione. She was sure to have read all about time last year because of the time-turner. Harry was sure he didn’t have a time-turner but it was a start.\n \nThat is if his friends didn’t think he was completely mental.\n \nSo he got dressed in a hurry and went down to find Ron and Hermione exactly like before. Ron fidgeting and Hermione revising.\n \n‘Finally, mate. Breakfast has started already.’ Ron said and Harry felt his eye twitch at the repeated phrase. He just nodded though and once Hermione was up they went to breakfast.\n \nOn the way there Harry asked in what he hoped was a casual manner ‘Hermione, did you read a lot about time last year? I mean – with the time-turner and all.’\n \nHermione turned to look at him startled but at once she started to talk excitedly about it. ‘Oh sure. It was fascinating stuff really. Time related magic is very unstable so it is very closely inspected by the Ministry.’\n \n‘Was there ever any case of someone getting like –stuck in time?’\n \n‘Well, there was Eloise Mintumble who tried to go back in time more than just a few hours. She got stuck in the 1400’s for a few days before managing to come back to her time. But the strain of it made her body deteriorate the five centuries difference and she ended up dying shortly after.’\n \n‘Bloody hell.’ Ron exclaimed looking perturbed and Harry wholeheartedly agreed; but it wasn’t what he was looking for.\n \n‘I meant more like someone living the same day over and over again.’\n \n‘What? Like in Groundhog Day?’ Hermione said looking amused.\n \n‘What the hell is a groundhog?’ Ron asked confused.\n \n‘Kind off like a squirrel I guess. It’s an American thing. But I meant the muggle movie. It’s about a man who gets stuck on a day – Groundhog Day – and lives it until he finally manages to go to the next day.’\n \n‘But what makes it end?!’ He exclaimed and both Ron and Hermione started at his tone.\n \n‘It’s never really clear. But it is just a movie, Harry; nothing like it ever really happened. Why are you so worked up over this?’\n \n‘Nothing, I just – had a dream like that.’ He couldn’t tell them; he didn’t even know how to explain it.\n \n‘It’s just the nerves because of the task. Tomorrow it will all be fine.’ Hermione put her hand on his arm and squeezed in reassurance before they finally got to the Great Hall and went in.\n \n‘Sure – tomorrow.’ Whenever tomorrow would be.\n \n \nThe day went exactly the same again but when it came the time to go into the maze Harry had decided.\n \nThis time he would take the cup alone.\n \nHe knew the way, knew the obstacles and could very well get there before Cedric.\n \nHe could do this.\n \nWhen he got to the sphinx he heard Cedric scream and felt his blood freeze. Why did Crouch made Krum still crucio Cedric when Harry was obviously winning?\n \nHe turned around but then there was silence and red sparks. Had Cedric gotten free by himself? Had Krum stopped once Crouch saw that Harry would go back for Cedric?\n \nThe thought of Neville’s parents came to Harry’s mind and he shut his eyes tight. He had to continue. Had to hope that like Fleur, Cedric didn’t die at the hands of this Death Eater. Any Death Eater.\n \nSo he continued. Answered the riddle very quickly and was not attacked. He got to the Cup and there was no spider. Odd. But then again this whole thing was rigged so he could win it. Crouch probably had some way for the spider not to attack him.\n \nHarry stood in front of the Cup, took a deep breath, and took it.\n \n \nAnd fell right into his bed. The morning he had already lived three times and was now seeing it again.\n \n‘What the hell?’ He said to the ceiling of his four poster bed. This made no sense. He took the cup and felt the portkey activate but then instead of falling on the ground of the graveyard he was on his bed.\n \nNo, it definitely made even less sense than it already didn’t make.\n \nWhat the hell was this that he was stuck in? Why couldn’t he go alone to confront Voldemort? Did someone have to die? Did Cedric? What was he doing wrong?\n \nHarry must have stared at the ceiling for longer than he thought because a knock on the door made him jump. Ron stuck his head over the door and looked at Harry in concern.\n \n‘Alright there mate? You are taking a while.’\n \n‘Yeah, sorry. You and Hermione go ahead.’\n \n‘If you are sure.’ Ron lingered a bit but eventually went off, still a look of concern on his face.\n \nAfter he left Harry sat up properly in bed buried his face on his hand in frustration. He had to do something. He couldn’t just live this day again and again forever.\n \nHe had to do something different and suddenly the culprit for all of this came to mind.\n \nBarty Crouch.\n \nHarry got dressed as fast as he could and ran towards the DADA professor’s office. Before he could get to the second floor however he collided with someone who was coming out of the fifth floor corridor and they both almost fell over.\n \n‘Hey, Harry. Late for breakfast too?’ It was Cedric and Harry felt his heart constrict a little. Cedric must have just gotten out of the prefect’s bathroom; his hair was a little damp. Otherwise he looked as great as always.\n \nMore importantly he was alive.\n \n‘Yeah, I need to see Professor Moody about something.’ Cedric raised an eyebrow at this and suddenly Harry was very aware of how the other boy had put a hand on his arm so they wouldn’t fall.\n \n‘Our families are gonna be here after breakfast you know.’\n \n‘Yeah, could you just tell Mrs. Weasley I’ll meet her and Bill a little late?’ With that Cedric’s other eyebrow went up and Harry just belatedly noticed what he said.\n \n‘Sure – I’ll walk with you until the second floor then?’ Harry almost said no, but there was really no reason to so he just nodded. ‘Getting some last minute advice?’\n \n‘What?’\n \n‘With Moody.’\n \n‘Oh. Right, for the task.’ That was a good excuse ‘My shield charm isn’t really all that great yet.’\n \n‘I could help you.’ Cedric said quickly and then cleared his throat as if embarrassed ‘I mean, I guess it makes more sense for you to go for a teacher for that. We are competitors after all.’\n \n‘You helped me a lot though. With the egg.’\n \n‘I didn’t even give you the clue right. I mean.’ Cedric ruffled the back of his head and gave a self-depreciating laugh.  ‘I kept thinking later that it wasn’t very clear was it?’\n \n‘I got it eventually. If you hadn’t said anything I wouldn’t have. Not even Hermione had any idea about it.’\n \n‘You were very good at the task. That thing you took; it was like you were a merman!’ Cedric turned to him with a grin looking genuinely excited with Harry’s accomplishment. Something in Harry’s stomach flipped.\n \n‘Gillyweed. I didn’t really know how to manage to breathe underwater for an hour either. That charm you and Fleur used looked very useful. I sure as hell wouldn’t be able to transfigure myself into a shark.’\n \n‘Krum sure went all out for it. But the bubble head charm is easy, really. You should learn it in fifth year or – well, again, I could teach you if you’d like.’ Cedric ruffled the back of his head and the thing in Harry’s stomach flipped again.\n \n‘I’d like that. Later though.’ Harry stopped and looked at the second floor corridor that they had just arrived at.\n \n‘Right, here is your stop. See you later.’ Cedric shot one last smile at Harry and turned to continue down the stairs. \n \nHarry then turned and walked until he was face to face with Moody’s door. Crouch’s door. It was all still confusing in his head but he shook it and let himself in. There was no one there yet but Harry was pretty sure he had activated some ward while entering so Crouch should be here any moment now. Until then Harry looked around.\n \nHe remembered when he had been here before, right after he had told Cedric about the dragons. Fake Moody told him how his dark detector kept humming; how the sneakoscope had to be turned off because it would not stop spinning.\n \nSeemed very obvious as to why now.\n \nThe clunking of Moody walking finally arrived and Harry turned to see the man walk in. Moody didn’t seem surprised to see him, but then again he had Harry’s map. Which in hindsight was another bloody obvious mistake.\n \n‘Potter. Any reason you are in my office?’\n \n‘Wanted to ask you something, sir.’ It felt foul calling this man sir after everything but Harry couldn’t let his pretense go so soon.\n \n‘About the task? Reckon you are ready for it, boy. All will go perfectly.’ The man went farther into the office and the door closed behind him with a finality. Harry felt his skin prickle. This was it.\n \n‘You made sure of that didn’t you.’ There was a tense moment of silence in which Moody’s fake eye spun like crazy before coming to look right at Harry together with his normal eye.\n \n‘Figure it out did you? And came to confront me alone? Maybe you are just as big headed as Snape says you are.’ He gave an incredibly nasty grin that together with the fake eye just made him look madder than normal.\n \n‘What? And risk you killing anyone? At least you need me alive for your Master don’t you?’ Harry gripped his wand very tightly and the thought that this was probably not really a good idea finally made itself known in Harry’s mind.\n \n‘Do I? The Dark Lord has many enemies; he can rise with any of those. Maybe he will be grateful if I finally get rid of the pest that is Harry Potter.’ And Harry had to dodge very fast because apparently Crouch was very serious.\n \nSpell after spell the office was getting destroyed but Harry had no way of getting pass Crouch and getting through the door.\n \nOne spell connected and Harry felt very light all of a sudden before snapping out of it. Crouch had tried to imperius him.\n \n‘Probably not your best idea to have taught me how to break that.’ Harry turned to look at Crouch, and it was Crouch; the polyjuice must have run out while they were playing this game of cat and mouse.\n \n‘That is it Potter.’ Crouch said and there was an insane and angry glint on his eyes. He cast something nonverbal and Harry suddenly could not move at all and then ‘Avada Kedrava’\n \nIt ended.\n \n \nThis time Harry was very glad to open his eyes and see his ceiling. He almost cried in relief.\n \nMerlin, that had been incredibly stupid. What the hell was he thinking? He probably wasn’t thinking and that was just it wasn’t it? He needed someone to help him.\n \nHe had to convince Ron and Hermione of what was happening somehow. He needed their help. But how could he do that?\n \nHe got up and got dressed. Once he was down in the common room there they were again. Ron fidgeting and Hermione revising.\n \n‘Finally, mate. Breakfast – ’\n \n‘ – has started already. So let’s go.’ Ron stared at him and even Hermione gave him a look from over the top of her notes but shrugged. This was typical enough of Ron that it wasn’t weird. He had to do something better.\n \nSo they went down to breakfast and Harry waited for the post to arrive. Because if knowing every word to an article that had not come out yet didn’t do it, he didn’t know what would. Soon enough a screech owl arrived for Hermione, carrying her morning copy of the Daily Prophet as usual.\n \n‘I wouldn’t drink that right now if I were you.’ Harry said just seconds before Hermione would spat out a mouthful of pumpkin juice all over it. She ignored him and did it anyway.\n \n‘What?’ said Ron, staring at her but also giving Harry an odd look.\n \n‘Nothing,’ said Hermione quickly, trying to shove the paper out of sight, but Ron grabbed it.\n \nHe stared at the headline, and said, ‘No way. Not today. That old cow.’\n \n ‘Rita Skeeter again?’ said Harry, if only to give his friends a little leeway.\n \n‘No,’ said Ron, and just like Hermione, he attempted to push the paper out of sight.\n \n‘The article says I’m ‘disturbed and dangerous’ and it goes on how I’m an attention seeker liar, that speaks parseltongue and even talks about what happened in divination the other day.’ said Harry and Ron and Hermione were looking at him with very wide eyes and very open mouths. ‘Any second now Malfoy is gonna say the words ‘Hey, Potter! Potter! How’s your head? You feeling all right? Sure you’re not going to go berserk on us?’’\n \nAnd soon enough Draco Malfoy shouted across the Great Hall from the Slytherin table.\n \n‘Hey, Potter! Potter! How’s your head? You feeling all right? Sure you’re not going to go berserk on us?’\n \nRon seemed to be choking on air while Hermione was very pale. It took more than a minute for her to manage to say anything.\n \n‘Harry – wha – what?’\n \n‘How did you like de Groundhog Day movie, Hermione?’\n \n‘Oh my God.’ Hermione continued to gape at him but her eyes had gone far away, that dreamy expression that meant she was thinking. ‘Impossible.’\n \n‘I really wish it was impossible but this the fifth time I’m on this day and I really not looking forward to staying in it much more.’\n \n‘What the hell is going on?’ Ron exclaimed and Harry swept a look over the hall and noticed how everyone was giving him wary looks.\n \n‘We should go somewhere else.’ Hermione nodded and she and Ron got up after him but before they could reach the doors someone was calling for Harry.\n \n‘Mr. Potter!’ McGonagall exclaimed when she approached them, probably not wanting him to leave. Harry had forgotten about her.\n \n‘Hi, Professor. Could you please tell Mrs. Weasley and Bill that I’ll be with them later?’ Harry said as normally as he could and McGonagall looked at him with a start.\n \n‘How did – Very well, Mr. Potter. But don’t keep them waiting too much. Your friends have their exams to do too.’ She gave them all one of her reproachful looks and turned back towards the staff table. Harry quickly went out of the Great Hall and started looking for somewhere he could talk to his friends.\n \n‘Wait, my mum and Bill are here?’ Ron asked confusedly before Harry finally settled on one of the several classrooms which were not regularly used and, as such, had the slightly neglected feeling of a cupboard or storeroom.\n \n‘They came to see the third task. That’s not important right now. I need you to help me figure this out.’ Harry looked pleadingly at his friends and Hermione was still with that dreamy thinking face and Ron just looked frustratingly confused.\n \n‘This what, mate? I have no idea what you are going about just that it looks that suddenly you became very good at Divination.’\n \n‘Harry is stuck in a time space continuum.’ Hermione said finally snapping out of her daze.\n \n‘A what?’ Ron just looked even more confused.\n \n‘A time loop.’ Hermione said as if it were obvious and turned back at Harry with a crease in her brow.  ‘Are you sure Harry?’\n \n‘I’m very sure. Unless I going completely insane. Which according to Skeeter is not very unlikely.’ He said with a snort but Hermione just frowned harder.\n \n‘That’s not funny. Have you talked to anyone else? Have you talked to us already?’\n \n‘No, this is the first time I’ve tried to talk to you.’ Both Ron and Hermione looked at him in disapproval probably not liking that he had not trusted them with this yet. ‘I was sure you were going to think I was crazy okay. I don’t know if I’m not.’\n \n‘Tell us what happens.’ Ron asked in an incredibly calm voice for the situation.\n \nAnd Harry does. Tells them all that happens until the task and then inside the maze and in the graveyard. Ron and Hermione look properly horrified and when he is done Harry feels slightly guilty.\n \n‘And then I just woke up here again. The first time I thought it had been a very vivid dream and just… did it all over again.’\n \n‘Oh, Harry.’ Hermione sounded so sad and concerned that Harry felt a little guilty for it.\n \n‘I don’t know what to do.’ He said pleadingly and Ron and Hermione shared a look before turning back to him in sympathy.\n \n‘You have to try different things I imagine.’ Hermione said simply and Harry had to stop a scream of frustration from coming out of his mouth.\n \n‘I have.’ He tugged at his hair in frustration. \n \n‘You have to try more. I mean, the ones you did weren’t the right combination to get you out of it.’ Hermione seemed to be running possibilities in her mind before turning back to Harry ‘What did you try differently so far?’\n \n‘I got to the cup without Cedric but it immediately brought me back to the start of the day again.’ He left out Crouch and how he almost died before. That sure would not go over well.\n \n‘Huumm.’ Hermione started thinking deeply again and Harry and Ron just looked at her waiting; they were used to this. A knock on the door made the three of them jump however. The door opened and there was McGonagall looking at them.\n \n‘Like I said Mr. Potter. You have people waiting for you and Ms. Granger and Mr. Weasley have exams to go.’\n \n‘I’ll see you guys later.’ Harry said and both his friends looked like they wanted to continue discussing whatever was happening but they couldn’t ditch their exam; specially not with McGonagall staring them down like that.\n \nHarry went on into the day the same as the other times. Showing around the Weasleys and then when they went back for lunch Hermione grabbed hold of him immediately and dragged him and Ron to a near alcove.\n \n‘The portkey.’ She said immediately like it was a great revelation.\n \n‘What?’ Harry and Ron of course didn’t understand it.\n \n‘The Cup. It must be what is causing all this. It must need two magical signatures to work properly so when you go alone it brings you back to the start.’ It was a good theory, however –\n \n‘That kind of makes sense but – well when I come back I only have Cedric’s body and the day continues until I fall asleep.’ Hermione made a frustrated sound like that was exactly what she didn’t understand either.\n \n‘I didn’t get to that little problem yet, but just – try to go with someone else this time won’t you? Maybe it’ll work.’\n \n‘How? With Fleur knocked out at the start and Krum imperiused?’\n \n‘Just – try Harry. Like you said, you can’t live this day forever. What of the consequences to your body? You know when Eloise Mintumble experimented with a time-turner –’\n \n‘She got stuck in the past and then when she returned she aged five hundred years. Yeah, you told me that already before.’ Both Ron and Hermione just looked at him astonished.\n \n‘That’s so weird, mate.’ Ron shook his head as if it would turn everything back on its place. Harry understood the sentiment perfectly.\n \n‘Tell me about it, Ron.’\n \n \nSo when the time came Harry chose to stupefy both Krum and Cedric on the maze once it reached the moment Krum used crucio. He looked down remorsefully at Cedric but went to Krum and rennervated him.\n \nKrum opened his eyes. He looked dazed. When he saw Harry, he tried to sit up, and Harry helped him lean against the hedge.\n \n‘I attacked him!’ Krum muttered, putting a hand up to his head. ‘But it vasn’t – I didn’t –’\n \n‘You were under the Imperius. I know.’ Krum turned his dark and guilty gaze towards Harry and an edge of suspicion entered his eyes.\n \n‘How do you know?’\n \n‘There a many strange things happening in this maze Krum, in this whole tournament.’ Harry was thinking how he could get Krum to trust him but the boy’s next words surprised him.\n \n‘Like your name coming out of the goblet.’\n \n‘You believe that wasn’t me?’ Many people still thought he did it, people he knew for years. And here Krum was just easily believing him.\n \n‘From vot I gathered about you and vot Hermy-own-ninny tells me off you, no, I’m not thinking you vonted to be here.’ Harry decided then to just try and be as truthful as he could to Krum.\n \n‘I need you to take the Cup with me.’ Krum was visibly startled and Harry couldn’t really blame him.\n \n‘Vot? And share the title?’ Krum frowned and looked at Cedric’s laying frame once again with guilt on his face.  ‘Vouldn’t your friend make more sense?’\n \n‘This isn’t about wining really. Could we talk while we walk?’ Krum just got up and started walking, one last remorseful look towards Cedric before continuing. Harry kneeled next to the Hufflepuff and felt also very guilty. He was the one that stunned him after all.\n \n‘Sorry, Cedric.’ Harry said before throwing up red sparks and rushing to catch up to Krum.\n \nThey walked on and Harry could feel that Krum was waiting for him to speak. He should do it soon because ahead there was the sphinx and then possibly a spider and the finally the damned cup. If Harry never saw that cup again it would be too soon.\n \n‘Do you know anything about time loops?’ Might as well throw himself out there but he wasn’t really expecting much. Hermione was sure they were just a fabrication until the moment Harry fell into one. But Krum actually gave a moment of thought to it.\n \n‘Very rare things. Only granted to very significant people in crucial moments.’ Krum said very seriously and Harry felt a sudden relief that someone seemed to know what was happening. There was just one problem.\n \n‘Granted? Like it’s a gift? This is more like a nightmare.’  Krum turned his dark eyes towards Harry once more and they looked at him in a very calculating manner.\n \n‘Is this vot is happening? You already know vat is in front of us.’ Krum turned his eye back forward as if expecting to see whatever Harry knew was coming.\n \n‘I do and – there is great danger waiting after we touch the cup. And it is a lot to ask of you to come with me but –’ Harry looked over his shoulder and once he looked back Krum had a very knowing look on his face. It was oddly disturbing.\n \n‘Something happens with Diggory ven he goes vit you.’ Krum said with certainty and Harry could only nod.\n \n‘He dies and then I just begin again.’ Krum considered Harry for a very long and serious moment before offering him his hand. Startled, Harry took it.\n \n‘Vell, it’ll be an honor to try and help you vit you quest from Chronos.’ He said before shaking Harry’s hand once. dropping it and starting back on their path again.\n \n‘Wait, what? Who?’ Harry rushed to catch up.\n \n‘Ven време контур happens – vot you called time loop – in my culture ve learn it is because Chronos – ancient Greek God of time – vasn’t satisfied vit how something happened. Then the person would go back and back until he was satisfied.’ Krum explained simply and Harry was suddenly reminded of Hermione. No wonder the other boy liked her so much.\n \n‘That seems very random, I mean. What if this God decides he doesn’t like the way I dress in the morning and I have to live a day endlessly until I get the colour of my shirt right?’ Krum actually snorted at Harry and shook his head.\n \n‘It is never frivolous things. A very dangerous thing time. Even for the God who is responsible for it. Him and The Fates have to be in complete agreement for it to happen. Hence why is very rare. The Three Sisters are very difficult to get on someone’s side.’\n \nHarry’s mind was spinning like it did when this all began. He knew nothing about mythology but Krum seemed pretty sure this was the case and Harry wasn’t really in a place to disregard any theory.\n \nThey finally arrived at the sphinx, who didn’t seem to mind there were two of them, and once she was done saying the riddle Harry didn’t even have time to open his mouth and Krum was already answering. Harry looked at him impressed.\n \n‘I already knew that one.’ Krum shrugged and Harry barked out a laugh.\n \n‘You know, there might appear a giant spider ahead of us. I wonder if that riddle was actually a clue.’ Harry said in wonder; it really did seem a little foreboding.\n \n‘A giant spider? And you are not sure?’ Krum looked around as if the spider could jump out of anywhere and had his wand at the ready.\n \n‘It’s right at the path of the Cup and it only appeared the times I was with Cedric.’ Krum went silent for a very long moment and only spoke when they could see the cup.\n \n‘The only obstacle ve met vas that sphinx. Someone is altering this maze so you can vin.’ Krum stopped and stared once again at Harry.\n \n‘Yes.’\n \n‘You talk of a great danger; that Diggory died. Vot is after that cup?’ Harry felt panic suddenly grip his heart thinking that this was the moment Krum backed out. But he deserved the truth and Harry would not lead someone on a lie.\n \n‘Voldemort. This was all a lure so he could get me. So he could return.’  Krum stared very hard at Harry and Harry didn’t dare look away.\n \n‘If there is one thing I despise is dark lords.’ Krum said eventually after what felt like an eternity and Harry almost fell with the relief that came to him. But the other boy wasn’t finished. ‘Have you tried not taking the cup?’\n \n‘I don’t really think that would work either.’ Harry thinks of the previous day on the office with Crouch and how he almost died but woke up once again on this day. No, whatever this time-loop had to do with was surely about what happened on the graveyard.\n \n‘I imagined that. I think I’m not right person for you to go vit either.’\n \n‘I understand. You don’t have to come really. I’ll just start again tomorrow anyway. Today I guess.’ Harry sighed but didn’t really blame Krum. It was a lot to ask of someone, especially someone he didn’t even know that well.\n \n‘I meant vot I said earlier. This is an honor and I’ll very gladly take the cup vit you now.’ Krum then turned his gaze towards where they had come from and frowned. ‘I just mean it is not my honor to be had.’\n \nHarry frowned and looked back also. He thought of Cedric. Of how he indeed had gotten farther with Cedric than alone.\n \nBut Cedric had died and now Harry was stuck.\n \nKrum suddenly gave Harry’s shoulder a pat and nodded back to the Cup. He was right, they better go. And so they walked ahead. The spider was easier to beat once they knew it was coming and very soon they were in front of the cup.\n \n‘Once we land we go back to the cup right away and it will bring us back.’ Krum tore his eyes from the cup and raise one thick eyebrow at Harry.\n \n‘You know that von’t vork either.’\n \n‘No, but I have to at least try. On three?’ Krum nodded and the both of them readied their hands to touch the cup. ‘One – two – three –’\n \nHe and Krum both grasped a handle. \n \nHarry was back on his bed again and this time he smothered himself with his pillow and screamed.\n \nKrum must have been right. It will not work if it is not Cedric taking the cup with Harry. But why? If they were both supposed to live through this why was only Harry remembering it?\n \nHe must have taken too long again because there was a knock on the door and Ron poking his head over the door once more.\n \n‘Alright there mate? You are taking a while.’\n \n‘Yeah, sorry. You and Hermione go ahead.’\n \n‘If you are sure.’ Ron lingered a bit but eventually went off, still a look of concern on his face. Harry didn’t feel like trying to convince Ron and Hermione this time so he just put on his clothes and went down on his own, not really knowing where he was going until suddenly he collided with someone who was coming out of the fifth floor corridor and they both almost fell over.\n \n‘Hey, Harry. Late for breakfast too?’ It was Cedric again. Harry had forgotten how he had met with him before. It seemed as though all these same days were blurring together and he could not keep track properly.\n \n‘Yeah, I mean – not really sure I’m up for breakfast honestly. And you?’\n \n‘Me? Just took a bath you know – trying to relax I guess.’ He tilted his head to indicate the corridor he just came off and probably the prefect’s bathroom. ‘Couldn’t really sleep last night – even if Scott wasn’t snoring like a freight train.’\n \n‘That bathroom is really amazing.’ Harry said truthfully, remembering all the taps on the pool-like tub.\n \n‘I know right. First time I used it I think I turned on all the taps just to see what each one was.’ Cedric said and then laughed as if embarrassed by his own admission.\n \n‘I did that too that time I went there. Until I remembered I had to figure out the egg that is.’\n \n‘I didn’t really help you a lot with that right? I mean,’ Cedric ruffled the back of his head and gave a self-depreciating laugh. ‘I kept thinking later that it wasn’t very clear was it?’\n \n‘It helped me more than anyone else. I really had no idea what to do.’\n \n‘It was only fair. I would be a pile of ash if you hadn’t told me about the dragons.’ Cedric looked at Harry and grinned and Harry could not help but smile back. They stood like that for a moment before Cedric seemed to shake himself and look away embarrassed again. ‘We should probably head down. Professor Sprout told me our families would arrive after breakfast to be with us before the task.’ He started going down the stairs and Harry followed.\n \n‘I’m not really waiting for anyone.’ Not really a lie since Harry wasn’t supposed to know the Weasleys were coming for him. He chanced a glance at Cedric and noticed the other boy was looking at him in question. ‘I live with my aunt and uncle, they are muggles. We don’t really get along.’ And that was a really nice way of putting his relationship with the Dursleys.\n \nCedric’s hand was suddenly on his shoulder and when Harry looked up at him the other boy had a half smile on his face and more importantly no pity in his eyes. Harry felt very warm all of a sudden.\n \n‘I’m sorry to hear that, Harry. Know that if you need anything you can come to me.’ The half smile turned into a full one and Harry felt his mouth go dry.\n \n‘Thanks, Cedric. I –er. Think I’m gonna head to the library actually.’ They had just arrived at the first floor landing and Harry very suddenly felt the need to be anywhere but near Cedric.\n \n‘Okay, I’ll see you later than.’ Cedric grinned at him once more before continuing down the stairs and Harry just stared for a moment before shaking himself and actually thinking that going to the library wasn’t a bad idea.\n \nHe arrived just at the same time Hermione was rushing out.\n \n‘Harry! There you are. You didn’t come for breakfast.’ She said in disapproval and looked at him concernedly.\n \n‘I felt like staying in bed a little longer.’ A little lie but saying he lost track of time talking to Cedric Diggory on the stairs wouldn’t go overly well. ‘What are you doing here?’\n \n‘Oh, Harry! I think I figured it out what Skeeter is doing to get all that information she shouldn’t have.’ Hermione’s eyes were sparkling and Harry felt himself grow curious. Hermione didn’t mention what she figured out to him and Ron.\n \n‘What is it?’ Hermione looked around as if Skeeter would pop out of nowhere and came closer so she could whisper to Harry.\n \n‘I’m pretty sure she is an illegal animagus.’\n \n‘What?!’ Harry whispered back incredulously. Skeeter could go to Azkaban for that.\n \n‘I know. I reckon she turns into something really small so she can lurk around without anyone noticing her.’ Hermione sounded very proud and smug of her own discovery and Harry couldn’t help but smile at his friend.\n \n‘That’s brilliant Hermione.’\n \n‘Ron gave me the idea actually. He asked at breakfast about the insect thing we talked about – he meant bugging – and it just came to me.’ Just then the bell signifying classes were starting chimed and Hermione got a panicked look on her face. ‘Oh my God. The History of Magic exam. See you later, Harry!’ Harry just watched as she ran but then suddenly a thought clicked.\n \nGod. Chronos.\n \nIt was probably more than worth it to look up the things Krum had told him. So he went into the library and even ventured to ask Madam Pince where he could find books about ancient Greece. She gave him that incredibly suspicious look she always gave every student who dared breathe near her books but even so directed him to the right section.\n \nOnce there Harry realized he had no idea where to start. So he grabbed a huge tome and went to sit on an empty table nearby hoping it could give him some information. He hadn’t even turned a page when another huge tome was put next to his and he lifted his head to look startled at the person who did it.\n \n‘You might want to try this one instead.’ It was a girl, a little younger then him and a Ravenclaw by what he could see of her uniform. She had straggly, waist-length, dirty blonde hair, very pale eyebrows, and protuberant eyes that gave her a surprised look. ‘Hello.’ She said as if it was an afterthought. Like she wasn’t really completely there.\n \n‘Er…Hi.’\n \n‘I’m Luna Lovegood, we haven’t met yet.’\n \n‘Right, I’m Harry. Look, sorry but I’m kind of busy right now –’ She interrupted him and her voice was also as if she had stepped out of a dream.\n \n‘We can do this again tomorrow if you like. Or today I guess there isn’t really a difference.’ She said as if it really didn’t make a difference and it probably didn’t but Harry was boggled.\n \n‘Wait you – you know.’\n \n‘It’s very interesting watching everyone doing the same things every day or changing things. Yesterday I switched Cornhill’s tea with coffee and she spat all over her papers.’\n \n‘What? Why?’\n \n‘I think she took all my quills. Just a little harmless prank.’\n \n‘No, I mean – why aren’t you stuck like everyone else?’\n \n‘Oh. I always sleep with all my protection stones.’ She took out of a pocket a chain interwoven with a multitude of different stones and what even looked like crystals, ‘You know, the usual; negativity, harmful spirits, possession, umgubulars, evil eye. Those I usually take with me, but the ones for physical travel, world distortion, alternate realities and timeshares I just keep when I sleep.’ She fiddled with some specially large and odd looking stones before looking back up at Harry. ‘Ever since this started I keep them with me too. It seems to keep me out of this loop we are having.’\n \n‘That – that’s great!’ Harry thought it was great but he honestly didn’t think he fully understood. However here was an apparent solution. ‘Do you have more of those?’ Luna gave him a vague smile.\n \n‘I’ve tried that. I gave one to Ginny in one of todays and it just returned to my trunk in the next today.’ She turned her dreamy stare at a nerby window; Harry supposed that was her way of thinking things over. ‘I think it just worked on me because I had it on the original today and it just went from there.’\n \n‘Why didn’t you talk to me before?’ Here was someone who was living the same day he was and said nothing about it when they could be thinking together.\n \n‘You didn’t seem very approachable before. I mean, I’ve been watching you some and you just trusted you friends with this yesterday. I don’t think you would open to me much before.’ Harry could see her point.\n \n‘I guess you are right.’ Luna nodded and perched herself on top of the desk and gestured to the book she brought.\n \n‘It’s good that you are researching Greek entities. They are fascinating and have always had a great influence in occidental magic.’\n \n‘You think this is it too then? Chronos or whoever messing with my life?’ But Luna just shook her head and stared at a point ahead as if she could see things Harry could not.\n \n‘I think is so much more than just your life, Harry. Whatever the outcome of what happens tonight will affect the whole of England, don’t you think?’\n \nHarry was stunned. Because she was right, so right. This was so much bigger than just himself and he didn’t consider it; wasn’t seeing the bigger picture.\n \nVoldemort would return. He was certain that was something he could not change but he had no idea how Cedric fell into the equation of all things. Because that was the link somehow.\n \nCedric.\n \n‘Do you think –’ But Harry could not finish his thought since very hurried steps were coming their way. Soon enough McGonagall was upon them and she looked at them – especially Luna still sat on top of the table – very disapprovingly.\n \n‘Ms. Lovegood we sit in chairs, not tables.’ Luna didn’t look as if she particularly agreed but got off the table anyway. McGonagall turned back to Harry. ‘Mr. Potter, Mr. Diggory said I would find you here. There are people waiting for you, if you would be so kind to follow me.’ Harry grimaced at his teacher’s sarcasm; there was no arguing with that tone. He looked back at Luna and she just gazed back at him.\n \n‘I’ll talk to you again tomorrow?’\n \n‘Sure, tomorrow or today.’ They both knew it was the same and Harry probably wouldn’t be getting them out of this on this try.\n \nSo he followed McGonagall and braced himself for going through the grounds with Mrs. Weasley and Bill for the nth time.\n \n \nWhen Harry got to the maze that time he had no plan. So he just repeated everything once more. When he and reached the cup together with Cedric he thought back to what Krum had said.\n \n\n‘Have you tried not taking the cup?’\n\n\n \n\nHarry was almost sure that would not work but he had to at least try it once like every other possibility. So when Harry counted to three he let Cedric touch the Cup alone.\n \nThe Cup seemed to glow ominously red to Harry for a moment before Harry’s vision went black.\n \nYeah, that didn’t work. Whatever God was this, Chronos sure was a piece of work.\n \nHarry hurried to put on his clothes and find his friends downstairs. They didn’t really have time between breakfast and their exams and Harry needed all the time he could get.\n \nWhich was ironic considering he had nothing but time nowadays.\n \n‘Finally, mate. Breakfast – ’\n \n‘– has started already. So let’s go.’ He had to perfect everything. Notice everything because he was sure he would need it later. This day wasn’t the day either but maybe he could make it the next the last one.\n \nRon and Hermione traded a look but they continued on. Harry just looked at everything and tried to remember it. There were a few fifth and seventh doing last minute studying on the halls. A little Ravenclaw second year tripped and would have almost rolled down the stairs if it weren’t for a third year Gryffindor pulling them backwards. When they got to the fifth floor landing Mrs. Norris passed and gave them a glare. Harry thought about how Cedric would be in the prefect’s bathroom right now and almost stayed but decided against it. He had to focus on Ron and Hermione right now; he would convince Cedric in another way.\n \nThe Gryffindor table was as noisy as always but Harry kept looking at everything else. Luna was at the Ravenclaw table and she gave him a slight smile even as she moved a pitcher slightly so the boy in front of her missed it; Harry just shook his head, amused. Then the doors to the Great Hall opened and in came Cedric, just some minutes before the post arrived. Harry observed.\n \nCedric approached the Hufflepuff table and everyone seemed to get louder. Cedric smiled at everyone, even at Hannah Abbot when she accidently hit him in her enthusiasm. Then he sat next to his year mates and got such a strong pat on the back from one of them he ended up knocking a glass of juice over. His friend laughed and used his wand to clean it all up. Cedric just smiled back.\n \nThe post arrived and Harry braced himself for the repeated scene with Ron and Hermione. He just hoped that all he had on Cedric would be enough too.\n \n‘I wouldn’t drink that right now if I were you.’ Harry said just seconds before Hermione would spat out a mouthful of pumpkin juice all over it. She ignored him and did it anyway.\n \n‘What?’ said Ron, staring at her but also giving Harry an odd look.\n \n‘Nothing,’ said Hermione quickly, trying to shove the paper out of sight, but Ron grabbed it.\n \nHe stared at the headline, and said, ‘No way. Not today. That old cow.’\n \n‘Rita Skeeter again?’ said Harry again and he really hoped he wouldn't have to repeat it.\n \n‘No,’ said Ron, and just like Hermione, he attempted to push the paper out of sight.\n \n‘The article says I’m ‘disturbed and dangerous’ and it goes on how I’m an attention seeker liar, that speaks parseltongue and even talks about what happened in divination the other day.’ said Harry and Ron and Hermione were looking at him with very wide eyes and very open mouths. ‘Any second now Malfoy is gonna say the words ‘Hey, Potter! Potter! How’s your head? You feeling all right? Sure you’re not going to go berserk on us?’’\n \nAnd soon enough Draco Malfoy shouted across the Great Hall from the Slytherin table.\n \n‘Hey, Potter! Potter! How’s your head? You feeling all right? Sure you’re not going to go berserk on us?’\n \nRon seemed to be choking on air while Hermione was very pale. It took more than a minute for her to manage to say anything.\n \n‘Harry – wha – what?’\n \n‘How did you like the Groundhog Day movie, Hermione?’\n \n‘Oh my God.’ Hermione continued to gape at him and just like before her eyes had gone far away, that dreamy expression that meant she was thinking. ‘Impossible.’\n \n‘Yeah, you said that before too.’ It was getting annoying really, having to repeat everything. ‘Come on, let’s go before McGonagall calls after me saying there’s people waiting for me.’ No such luck since McGonagall was on them as soon as they got to the doors. I was useful to make Ron and Hermione more convinced at least. Quick enough they were once again on the unused classroom and his friends were looking at him in concern.\n \nHe went as fast as he could through Hermione’s questions and getting Ron to understand. In the end the both of them were just staring at Harry with a mix of awe and concern.\n \n‘I know this seems really crazy okay, but I’m stuck on this day and I not sure how to get out just that Cedric is probably a part of the whole thing too.’ They were all silent for a moment and then Hermione sighed.\n \n‘Have you tried everything?’ Hermione asked insistently.\n \n‘Yes! Every time I get to the cup and Cedric doesn’t take it with me I go immediately back to my bed in the morning. But the times he is with me he dies and after I fall asleep I return too.’\n \n‘I guess it is obvious then, isn’t it?’ Both Harry and Hermione turned to stare at Ron, who looked at them defensively and shrugged ‘You have to go with Diggory and make sure he lives.’\n \nHarry was once more stunned speechless. It was so obvious; so fucking obvious. It was staring him in the face the whole time. He had an inkling that might be it but to Ron to say it so simply.\n \n‘I don’t know how to do that.’ Harry admitted because that was just the thing. He was scared of not being able to manage, scared of being stuck on this day that Cedric Diggory just died and died.\n \n‘You should try and convince him too and have you help each other every step of the way.’ Ron said and his friend sounded so sure that Harry looked at him with new eyes. ‘I think you know that, mate. The moment Diggory got to the Great Hall you didn’t take his eyes off him. You can convince him too.’ Harry felt his face heat with Ron’s comment but otherwise was still doubtful.\n \n‘You two are my friends. Cedric and I don’t really have anything for him to trust me about this.’ Ron and Hermione just shared an exasperated look before turning back to Harry incredulously. Hermione took a breath and started talking again.\n \n‘I really doubt you’ll have a very hard time convincing Cedric of anything.’ Ron snorted and Hermione shot him a glare before returning to a very confused Harry ‘You just have to try Harry, even if you think it won’t work.’\n \n‘You basically described all these days so far.’\n \n \nHe was back at the library with Luna, Ron and Hermione had gone to their History of Magic exam and Harry managed to leave Mrs. Weasley and Bill. He felt slightly bad about it but he really didn’t have the mind to listen to them this time around; he could probably recite back about Mr. and Mrs. Weasley time at Hogwarts by now.\n \n‘ –and then Hermione said I wouldn’t have a hard convincing Cedric of anything. I didn’t really get it. What?’ Luna was actually giggling at him from her place perched once more on the table.\n \n‘Nothing, Harry. You’ll figure it out; it is just really amusing from who is on the outside.’ Harry didn’t really want to try and figure that one out so he just ignored it.\n \n‘Do you think she is right though?’ He asked while flipping through the book about Greek Gods. It wasn’t actually that helpful, just telling him how Chronos and his consort circled the cosmos driving the rotation of heaven and the eternal passage of time. Also something about how he ate all his children but Harry wasn’t sure that was the same God.\n \n‘Cedric is a very nice person. We grew up near each other you know. He has always been nice to me and has a very open mind.’ Harry looked up at Luna and saw she had a gentle smile on her face. She genuinely liked Cedric, but then again who didn’t.\n \n‘I don’t think I can manage it today. I have to start it at the beginning of the day.’\n \n‘What are you going to do this time then?’ Luna asked honestly curious and Harry grimaced.\n \n‘I’m going to do the first day again and see if I can come up with a strategy’\n \nWhen Harry woke up looking at his bed ceiling he was determined. He got up and dressed and went to meet his friends in the common room.\n \n‘Finally, mate. Breakfast – ’\n \n‘– has started already. So let’s go.’ Ron and Hermione traded a look but they continued on. And so Harry started.\n \n‘There’s going to be two fifth years going over their OWL notes in the next corner; one has their quill behind their ear and is frantically looking for it.’ And soon enough there they were.\n \n‘Where is my quill, have you seen it? It is my lucky one.’ Ron and Hermione shot him astonished looks but he carried on.\n \n‘There’s a seventh year just at the window seat studying and drawing runes in the air with their wand.’ They passed said student and his friends continued to gape at Harry. They arrived at the stairs. ‘That little Ravenclaw is going to trip but that third year is going to pull them back and stop them from falling down the stairs.’ Harry started down the stairs but his friends stopped and just stared at him. He motioned for them to keep going and they rushed down the stairs. ‘And Mrs. Norris is going to be at the fifth floor landing and glare at us.’ And there she was.\n \nHarry stopped then and just looked at his friends who were staring at him with very wide eyes.\n \n‘Harry, what’s going on? When did you become a seer?’ Ron asked and Harry snorted. He supposed it was the more logical assumption than my best friend is stuck in time one.\n \n‘I’m not a seer, Ron. I’m on a time-loop, like in that muggle movie Hermione.’ Harry saw realization come to his friends’ eyes and let a breath out in relief; he thought maybe this way wouldn’t work.\n \n‘Harry, that – that’s –’\n \n‘Impossible? Yeah, not really. Look you guys go down to breakfast I have something I need to do here.’ Ron and Hermione just kept looking at Harry like they had never seen him before. ‘Please just go, I’ll be down before the post arrives and then we can talk better.’\n \nLooking very reluctant and still somewhat dazed Harry’s friends eventually continued down the stairs. So Harry stood there and waited. Those upperclassmen that were studying made their way down and then some stragglers but then it was just Harry waiting for sound to come from the corridor.\n \nA few moments later he could hear steps approaching and taking a breath to reassure himself Harry stepped forward just at the right moment. He collided with someone who was coming out of the fifth floor corridor and they both almost fell over.\n \n‘Hey, Harry. Late for breakfast too?’ And there was Cedric smiling down at Harry and with an arm out so he could stabilize the both of them.\n \n‘Yeah, just going down now. And you? Enjoyed your bath? Relaxed?’ Harry started going down the stairs and soon enough Cedric was next to him with a faint blush on his cheeks.\n \n‘How did you –’\n \n‘You didn’t sleep well last night right? Because of the task; not that Scott snoring like a freight train really helped you anyway.’\n \n‘Wha – how – you know Scott?’\n \n‘No, I have no idea who he is actually.’\n \n‘Harry, what are you going on about?’ A frown was starting to form on Cedric's face and Harry looked ahead and rushed his speech. \n \n‘You did help me you know? With the egg; even if you think you weren’t clear with your clue. You helped me a lot.’ Harry chanced a glance up at Cedric and the other boy was looking at him in astonishment. ‘And I got to use the prefect’s bathroom. Play with all the taps just like you did on your first time there.’\n \n‘I never told you any of those things.’ They arrived at the entrance to the Great Hall and it was just the both of them. Harry would have to do it here.\n \n‘You did, you just don’t remember. Look, Cedric’ Harry braced himself, this was it. ‘There’s something really weird happening to me and I don’t know how to make you believe me so I’m just going to say somethings that are going to sound crazy.’ Harry took a breath and Cedric stared at him with a very red face and very wide eyes. ‘When you go to the Hufflepuff table they are all going to cheer for you, and I guess that is not really so weird but Hannah Abbott is going to accidently hit you. Then when you sit down one of your mates is gonna pat you in the back so hard that you knock over a glass of juice. He laughs and clears the mess.\n \n‘When the Prophet arrives today there is a story about how Skeeter thinks I’m ‘disturbed and dangerous’. She goes on about the pain in my scar and how I collapsed the other day in divination. How I’m a power and attention seeking lunatic. Mostly rubbish really. But at some point Malfoy will go and shout ‘Hey, Potter! Potter! How’s your head? You feeling all right? Sure you’re not going to go berserk on us?’ and just make an idiot of himself –which I suppose isn’t really unusual either.’\n \n‘That – that’s a lot to take in.’ Cedric said now looking kind of pale and frowning.\n \n‘I know, just one more thing before we have to enter.’ Harry looked at the great clock on the Entrance Hall and he had just a couple of minutes more before the time Cedric originally enters the Great Hall. ‘McGonagall just tells me today at breakfast that our families are coming here. I’m not expecting anyone since I don’t get along with my aunt and uncle. You come to get me from the hall – well, I don’t know if you will now but, anyway – Mrs. Weasley comes with one of her older sons; it is a surprise. Before we go out of the chamber your dad calls out to me and says how I should not be feeling so full of myself now that you caught up to me on points. You tell me how he is upset ever since Skeeter made out like I was the only Hogwarts champion. Mrs. Weasley goes on about how Skeeter is nothing but trouble and your father should know better since he works at the ministry.’ Cedric was outright gaping at Harry now.\n \n‘I sound crazy, I know. But please – if all of this happens and you have anyway of believing what I have to tell you – come talk to me later.’ With a last look at Cedric, Harry walked into the Great Hall and went to sit next to Ron and Hermione who were obviously very impatiently waiting for him.\n \n‘Harry, you can’t just drop something like that and –’\n \n‘Wait Hermione, I have something to watch.’ Hermione gave an indignant squawk but kept quiet after trading a look with Ron.\n \nHarry watched as Cedric got to the Hufflepuff table and everyone greeted him. He smiled at them but not as wide as before, especially when Hannah Abbott accidently hit him. Cedric brushed off her apology and went to sit with his friends, but not before shooting Harry a look. After he was sat he got a strong pat on the back from one of his mates and he ended up knocking a glass of juice over. His friend laughed and used his wand to clean it all up. Cedric just locked his eyes with Harry’s and stared. When the post arrived Harry gestured towards the owls and finally broke his gaze away from Cedric’s.\n \n‘What was that?’ Ron asked sounding suspicious.\n \n‘I’ll tell you later if it works. Oh, don’t bother with the paper, Hermione.’ Too late she spat her juice and Harry sighed. ‘Honestly, it’s not important right now and you’ll get back at her.’\n \n‘What’s on the paper?’\n \n‘What do you mean I’ll get back at her?’ Hermione asked very interested while passing the Prophet to Ron who started sputtering obscenities. Harry gestured to Hermione to lean closer to him and whispered to her.\n \n‘You figured out how she had been listening to everyone. You reckon she is an illegal animagus, something small to go undetected. Like a bug.’ Hermione got her dreamy thinking face for a moment before snapping her gaze back at Harry.\n \n‘Oh, that’s brilliant.’ Hermione said smiling and Harry smiled back.\n \n‘Yeah, you are brilliant.’ Harry said but then came the shout form Malfoy.\n \n‘Hey, Potter! Potter! How’s your head? You feeling all right? Sure you’re not going to go berserk on us?’\n \nHarry just rolled his eyes before turning to look at the Hufflepuff table and was surprised to see Cedric glaring at Malfoy just before he turned his gaze once again on Harry. Harry felt that odd stomach flip he felt around Cedric and just shrugged before looking back at Hermione. Both she and Ron were giving him very knowing looks that made him nervous.\n \n‘What?’ Harry asked oddly defensive.\n \n‘Something you want to tell us, mate?’ Ron said with a teasing grin but Harry just raised an eyebrow at him.\n \n‘Lots, but not here.’\n \n‘Yeah, let’s get down to busyness. What is happening Harry and how do we help?’\n \n‘You already helped me a lot, actually. I think we are not going to be able to talk now. McGonagall is coming to tell me the campions’ families were invited to see the third task and are meeting in the chamber next to the Hall.’\n \n‘She doesn’t expect the Dursleys to turn up, does she?’ Hermione asked exactly like he had before and Harry laughed.\n \n‘No, it’s Mrs. Weasley and Bill.’ Ron blanched.\n \n‘What? Mom is here?!’ Harry would have said something but right at that moment McGonagall reached them.\n \n‘Potter, the champions are congregating in the chamber off the Hall after breakfast,’ she said.\n \n‘Yeah, alright.’ said Harry not even reacting and McGonagall raised an eyebrow at him like she expected more of an argument.\n \n‘The champions’ families are invited to watch the final task, you know. This is a chance for you to greet them.’ She looked at him expectantly and when Harry just nodded he could see a slight frown forming on her face again.\n \nShe moved away. Harry, Ron and Hermione just watched her go.\n \n‘This is bloody weird mate.’\n \n‘I know, Ron. I know.’\n \n \nSoon enough Harry was once again alone in the Great Hall. He watched Ron and Hermione go to their History exam and then saw Fleur Delacour get up from the Ravenclaw table and join Cedric as he crossed to the side chamber and entered, but not before shooting Harry a look. Krum slouched off to join them shortly afterwards. Harry stayed where he was waiting to see if Cedric would call him. Soon enough the older boy came out and just stared at Harry with an expectant look.\n \n‘What am I going to say now?’ Cedric asked in a light tone and Harry couldn’t help but smile in relief.\n \n‘Harry, come on, they’re waiting for you!’ Harry parroted Cedric’s words and Cedric gave an incredulous laugh and nodded.\n \n‘Indeed they are. Come on.’ Harry got up and went to Cedric who started opening his mouth to ask something most likely but Harry shook his head.\n \n‘Wait until everything I told you happens.’ They entered together and Cedric went to his parents while Harry made his way to the fireplace where he knew Mrs Weasley and Bill were. He just waved back at Fleur’s little sister before beaming back at Mrs Weasley.\n \n‘Surprise!’ Mrs Weasley said excitedly, and Harry chanced a glance at the Diggorys where sure enough Cedric was watching him back. ‘Thought we’d come and watch you, Harry!’ She bent down and kissed him on the cheek. They exchanged the usual pleasantries before heading out the chamber.\n \n‘There you are, are you?’ Amos Diggory looked Harry up and down as usual and Cedric gave him a defeated look. ‘Bet you’re not feeling quite as full of yourself now Cedric’s caught you up on points, are you?’\n \n‘I’m sorry about him,’ said Cedric in a low voice to Harry, frowning after his father. ‘Honestly dad, it’s not Harry’s fault if Rita Skeeter’s made him out to be the only Hogwarts champion.’ Harry was slightly impressed how different and the same Cedric speech was.\n \n‘Didn’t bother to correct her, though, did he?’ said Amos Diggory. ‘Still … you’ll show him, Ced. Beaten him once before, haven’t you?’\n \n‘Rita Skeeter goes out of her way to cause trouble, Amos!’ Mrs Weasley said angrily. ‘I would have thought you’d know that, working at the Ministry!’\n \nMr Diggory looked as though he was going to say something angry, but his wife laid a hand on his arm, and he merely shrugged and turned away. And Harry would have continued on as usual if Cedric hadn’t just spoken.\n \n‘I need to discuss somethings about the tournament with Harry, actually. Would it be a terrible bother if we were to come with you?’ Cedric gave Mrs Weasley a very charming smile but Harry could only gape at him much like Cedric’s father was doing.\n \n‘Aren’t you polite?’ Mrs Weasley said with a giggle before turning a slightly frosty look back at Mr Diggory. ‘Is no problem with us dear, you and Harry can talk all you want while we reminisce around the grounds.’ Mrs Weasley smiled once more before finally exiting the chamber, Bill right behind her. Mrs Diggory pulled her grumbling husband but gave both Cedric and Harry a smile too before exiting and leaving only Harry and Cedric alone on the chambers.\n \n‘Well, this never happened before.’ Harry said faintly and Cedric snorted.\n \n‘Good to know I can surprise you.’ Harry gave Cedric a questioning look and the other boy just shook his head and started walking outside like their families before. ‘I’ve been stunned speechless this morning Harry, you can’t say this is all normal. Not counting the other times you’ve made me speechless during the tournament.’\n \n‘Today I can understand but the tournament? I was competing the same as you.’ Harry squinted when they got outside; ahead of them he could see the others admiring the Beauxbatons carriage.\n \n‘You out flew a dragon and basically turned into a merman. Not to mention not letting any of the hostages stay behind. All of that and you didn’t even want to compete.’\n \n‘You didn’t believe that before.’ Harry said quietly and something shifted inside him once Cedric turned to look at him fully. His gray eyes were very serious.\n \n‘I believe in you now. I’ll believe in anything you have to tell me.’ That thing inside Harry shifted again and seemed to get incredibly warm. Harry couldn’t stop staring at Cedric who just stared trustingly back. It was a while before Harry felt he could start talking.\n \n‘I’ve been living this day over and over again for more than I can bear. It’s been almost two weeks if I would guess and with all of these days repeating I finally came to the conclusion that only you can really help me end this.’\n \nCedric stood silently looking at Harry; he was frowning but didn’t look like he didn’t believe Harry. He looked mostly confused and concerned.\n \n‘Why me? I mean – why would I be important to whatever is happening?’\n \n‘You are important, especially to what happens.’ Harry said immediately and Cedric blushed. Only then Harry noticed what he said and blushed too; he continued ‘I’ll tell you everything but I also have to tell Ron and Hermione again too. So do you mind if we wait for them?’\n \n‘No, that’s fine.’ They started walking again; they could see the others near the lake, probably looking at the Durmstrang ship now. ‘Have we had this conversation a lot? You said you had to tell everything to your friends again. It must get tiring.’\n \n‘You have no idea. But no, this is the first time we talk about this.’ And hopefully the last.\n \n‘But you knew things about me, things I would have to have told you before; like Scott and the prefect’s bathroom.’\n \n‘Right, well.’ Harry ruffled his hair suddenly embarrassed, then he noticed he was doing exactly what Cedric did and dropped his hand. ‘Somedays I would bump into you out of the fifth floor like today and we would just talk for some time. About the tasks, school or family. You even offered to help me with some spells.’\n \n‘Did I? Well –’ Cedric cleared his throat and, like Harry before, ruffled his hair before shooting Harry a half smile. ‘I wish I could remember that. The offer still stands though, even if I don’t remember making it.’\n \n‘I’d like that.’ Harry was very glad they reached the lake and Bill interrupted them because he could feel his face going red.\n \n‘Hey, you two. Lunch is at any moment now, you joining us?’\n \n‘We have to go to the library for something actually. Meet you guys later?’ And Harry would have felt bad for not spending any time with the Weasleys but then Bill just looked between Harry and Cedric and smirked.\n \n‘Sure, Harry. See you later.’ Bill walked back to his mother, shaking his head like he was very amused.\n \n‘I’m really tired of those looks.’ Harry muttered without thinking and then heard Cedric choke next to him. When he looked up the other boy had a flush on his cheeks.\n \n‘Why do we need to go to the library?’ Cedric turned and started walking back to the castle, obviously pretending nothing happened. Harry was very thankful.\n \n‘I asked Ron and Hermione to meet me there at lunch; hopefully Luna will be there too.’\n \n‘Luna? Little Luna Lovegood?’ Cedric smiled fondly and Harry was reassured to see he liked the odd girl just as much as she seemed to like him.\n \n‘Yeah, for some reason she is the only one who isn’t stuck either.’\n \n‘That is actually not as surprising as it should be. She always had a way of not fitting into whatever is called normal.’\n \n‘I don’t really think any of this could be called normal.’\n \n \n \nThey all probably made a very odd sight; a sixth year Hufflepuff, three fourth year Gryffindors and a third year Ravenclaw. All they were missing was a Slytherin but then Harry would really think he was going crazy. Ron and Hermione kept shooting Luna questioning looks and Harry sighed; he had to start talking.\n \n‘I know you guys are probably wondering what the hell is going on,’\n \n‘Not really.’ Luna interrupted from what seemed to be her favourite perch on the desk. ‘I’m glad you have Cedric here this time though, Harry. I told you he was very understanding.’\n \n‘Thanks, Luna.’ Cedric smiled at the girl who happily smiled back.\n \n‘Why is she here?’ Ron asked tilting his head towards Luna.\n \n‘Luna is the only other person who seems aware we are living this day over and over again.’\n \n‘Really? How?’ Hermione seemed very interested but once Luna got her crystals out of her robes she frowned.\n \n‘Protection crystals; I always sleep with them.’ Luna said simply and Hermione scoffed.\n \n‘That makes no sense.’ Harry could see Hermione would continue on about it and Luna was for once looking a little angry so he interrupted; they didn’t have time for this.\n \n‘Hermione, nothing about this makes sense and they obviously worked. So please let it go.’ Hermione seemed ready to start an argument but she kept quiet and nodded. ‘I suppose I better start from the maze.’\n \nSo he did; talked about how he encountered almost no obstacles on the maze since someone was working for him to get to the cup first. How he encountered Cedric once more after he had an encounter with Hagrid’s Blast-Ended Skrewts and then a Dementor who turned out to be a Boggart.  How he heard Fleur scream and how Krum was imperiused and how he later attacked Cedric too. How Harry helped Cedric and then they separated again and he met a sphinx. How after he answered the riddle he was close to the cup but Cedric was closer but then the spider appeared and they fought it together. And then how they argued who should get the cup before Harry suggested they both take it and after it…\n \nThe graveyard.\n \nHarry faltered then and Cedric squeezed his shoulder while giving him an encouraging look. Harry carried on.\n \nHe told them how the cup was actually a portkey and how it took them to a graveyard very far away from Hogwarts. How his scar exploded with pain and Wormtail appearing. How that awful, awful voice said ‘Kill the spare.’ like it was nothing. And how then Cedric was dead.\n \nThere was a pause and Cedric’s hand on Harry’s shoulder dropped. Harry dared to look up at the other boy and saw how pale he was; almost like when he was dead again.\n \n‘Go on.’ Cedric said very quietly, almost faintly. So Harry did.\n \nHe told them about the potion. \"Bone of the father, unknowingly given, you will renew your son! Flesh of the servant, willingly sacrificed, you will revive your master. Blood of the enemy, forcibly taken, you will resurrect your foe.\" And them Voldemort had risen again.\n \nThere was silence once more and all of them thought of the horror that was to come. But Harry wasn’t finished.\n \nHe spoke about how he called his Death Eaters and how they came to him. How he punished some them and talked of who was faithful and who was not. But then he returned his attention to Harry and explained all that happened for them to be at that place. How Wormtail had found him and how he had a faithful servant at the castle who did everything for Harry to enter and win the tournament. And then how Voldemort made him duel him. How he cast unforgivables at him and then once he was done playing with Harry, the killing curse.\n \n‘Oh my god, Harry.’ Hermione gasped but Harry barely heard her; he was focused on the tale.\n \nHe explained Priori Incantatem to them. How Voldemort’s wand could not cast against a wand that was its brother and how Harry saw the spirits of the people Voldemort had recently killed come out of the wand. Cedric and his parents. How they managed to stop Voldemort for a moment and then Harry got to Cedric’s body and the cup and came back to Hogwarts.\n \nAnd once again silence reined in their little corner of the library. His friends seemed to be barely breathing and Harry could relate very well to that.\n \n‘That’s awful, Harry.’ Hermione said with a very wobbly voice, as if she would start crying.\n \n‘You reckon you have to stop it somehow? You-know-who returning?’ Ron said, his freckles contrasting very much with his pale face.\n \n‘No, I don’t think I’m supposed to stop that. I think I need someone to witness it with me.’ Harry turned his gaze to Cedric who just shook his head.\n \n‘Why would you need me Harry? I’m supposed to die.’\n \n‘No! You’re not!’ Harry practically shouted and continued to look at Cedric with urgency ‘If you were this day wouldn’t be repeating. After I come back, the Minister acts as if all I say are lies. Even with Dumbledore backing me up and all the evidence. He acts like you dropped dead out of nowhere and that I’m just as disturbed and attention seeking as Skeeter painted me out to be. He is scared, scared of what will do to his position to have Voldemort return. So he denies it.’\n \n‘That would work out great for You-Know-Who wouldn’t it? He could do whatever he needed in the cover of the Ministry's blind eye before the war finally started again.’\n \n‘War?’ Ron said faintly and Harry felt his heart drop a little for his friend.\n \n‘Yeah, Ron. We are going to war.’\n \n‘What I don’t get is why we aren’t going to Dumbledore with this.’ Cedric said after they all had a long moment to let the concept of war sink in.\n \n‘Harry has trouble with authority figures.’ Hermione said simply.\n \n‘Hey! That’s not true!’ Harry exclaimed indignantly and Ron snorted. ‘I respect Dumbledore a lot okay; I just feel this really is something I can’t have him interfere with. Once it is all done I’ll tell him everything.’\n \n‘I think Harry is right; Chronos wouldn’t have too many factors interfering with the time fabric.’ Luna said simply while absentmindedly playing with her stones chain.\n \n‘Who?’ Ron asked but Hermione said at the same time.\n \n‘Surely you don’t mean the mythological god of time. That is –’ Hermione started to rant but Harry interrupted her.\n \n‘Krum’s theory actually.’ Hermione closed her mouth and turned to look at Harry incredulously. ‘In one of the days I told him what was happening and had him take the cup with me – it didn’t work. He told me how in his culture they have known of times that this has happened. When Chronos was unsatisfied with the, how did he say? Something about significant occurrences in time and that the person has to go back until whatever it is he wants happens.’\n \n‘That sounds really vague, Harry.’ He could see that all this was killing Hermione’s logical analytical mind but Harry could only shrug.\n \n‘Yeah, but I’m not really ready to dismiss anything. Nothing makes sense, Hermione.’ His friend sighed and shook her head before looking at one of the clocks nearby.\n \n‘Come on, Ron; we are going to be late for our DADA exam.’ Ron groaned but got up and gave Harry’s shoulder a pat.\n \n‘Bye, mate, see you later.’ They nodded to Cedric and Luna and then left.\n \n‘I suppose I have to go and take my Divination exam seriously this time.’ Luna said while finally getting off the desk. She turned to them with a smile. ‘I’ve had fun the last few times inventing all kinds of things; I think Professor Trelawney was really impressed.’ Harry and Cedric laughed.\n \n‘Well, you actually know what happens; shouldn’t be hard to go well on that.’ Luna gave a small laugh too and then left the two of them alone.\n \nThere was a moment of silence before Cedric cleared his throat and turned on his seat to look at Harry.\n \n‘So what’s the plan?’\n \n‘If you are not opposed I would have us both take my path on the maze; I already know all the right ways so it would be easier to get to the cup.’\n \n‘No, that is fine. But you know I meant after we take the cup.’ Harry fell silent and Cedric frowned. ‘Harry.’\n \n‘I don’t think you are going to like it.’ Cedric already had a look like he wasn’t liking it but Harry carried on.  ‘I would ask you to hide until the right moment – no, Cedric please. None of these people would even think twice before killing you. I need you here.’\n \n‘You are right, I don’t like it.’ Cedric let out a frustrated breath. ‘But I know you are probably right.’\n \n‘Thank you.’ Harry smiled at Cedric and the other boy smiled back. They stayed like that for a while before Harry shook himself out of it and felt his cheeks redden. ‘Er – I should probably find Mrs Weasley and Bill before dinner.’\n \n‘Yeah, my parents most likely aren’t all too happy either.’ Cedric grimaced and got up.\n \n‘Sorry about that.’ Harry apologized while they made their way out of the library.\n \n‘No, don’t be.’ Cedric put his hand on Harry’s shoulder and gave a reassuring grin. ‘We are going to get through this.’\n \nSoon enough dinner had come and gone and Harry and Cedric were in position to get into the maze. Harry tried to act as normal as he could through dinner but with Ron and Hermione shooting him worried looks it was kind of difficult not to get nervous. He was glad to be out of their sight for the moment.\n \n‘So … on my whistle, Harry and Cedric!’ said Bagman. ‘Three – two – one –’\n \nHe gave a short blast on his whistle, and Harry and Cedric hurried forwards into the maze.\n \nThe towering hedges cast black shadows across the path, and, whether because they were so tall and thick, or because they had been enchanted, the sound of the surrounding crowd was silenced the moment they entered the maze. He pulled out his wand, muttered ‘Lumos’, and heard Cedric do the same next to him.\n \nAfter about fifty yards, they reached a fork. They looked at each other.\n \n‘We go left,’ Harry said, and Cedric nodded. They walked together.\n \nThey walked and walked and nothing came. There was nothing beside the hedges of the maze growing darker and darker and that feeling of being watched upon them. Harry could see Cedric was starting to get anxious.\n \n‘It really doesn’t happen much on my end. That corner there was where I met you again after you escaped Hagrid’s Skrewts and soon ahead there will be a Boggart.’ Harry said if only to make Cedric relax a little; it worked and the older boy’s shoulders dropped a fraction.\n \nSoon they turned another corner, and there it was –\n \nA Dementor was gliding towards him and he heard Cedric draw a startled breath. But it wasn’t a Dementor, Harry knew and immediately cast a Riddikulus at it and making it explode in a wisp of smoke.\n \n‘Your boggart is a Dementor.’ Cedric said in awe as they continued walking.\n \n‘Yeah, ever since third year it was one.’ Harry shrugged but Cedric continued to look at him amazed. That thing inside of Harry flipped.\n \n‘Your biggest fear is fear itself. That is incredibly brave, Harry.’\n \n‘Professor Lupin told me that too when he was teaching me how to cast a Patronus.’\n \n‘You know how to cast a Patronus? Really?’ Cedric sounded excited and not doubtful, so Harry more than readily cast his Patronus. His stag came galloping out of his wand and circled them before disappearing. Cedric gave a delighted laugh. ‘That’s amazing, Harry.’\n \n‘It is very helpful.’ Harry said truthfully, thinking back on last year and how it had saved Sirius and himself from a horde of Dementors.\n \n‘I guess you could teach me something too then.’ Cedric said smiling down at Harry and the thing inside him was full out flipping. But then suddenly they turned and saw the odd golden mist floating ahead of them.\n \n‘What’s that?’ Cedric asked and Harry grimaced.\n \n‘Right, I forgot to mention that mist.’ Harry sighed and started explaining it. ‘It turns everything upside down for a moment. It is not really harmful just really disorienting. However any moment now – ’ No sooner did the words leave Harry’s mouth there was a scream followed quickly by silence.\n \n‘What was that?’\n \n‘Fleur. Krum must have gotten to her.’ Cedric turned to look backwards with an enraged look on his face and Harry took hold of his arm to make sure he wouldn’t walk towards the noise. ‘I told you he is imperiused, there is a Death Eater controlling him; he is not responsible for his actions and he will cast a crucio at you.’ Cedric blanched but nodded and turned back towards the mist ahead of them.\n \n‘We just have to go over it them?’\n \n‘Yeah, just take a step after it goes upside down and it rights itself over again.’\n \nAnd so they did and the world turned upside-down. Harry was hanging from the ground, with his hair on end, his glasses dangling off his nose, threatening to fall into the bottomless sky. He clutched them to the end of his nose and hung there, terrified. Because it didn’t matter how many times he had done this before; to have the world turn upside down was always going to be upsetting.\n \nBut then he felt Cedrid’s hand closing on his own and it was better. They took a large breath together and then took a step as far as they could and the world righted itself. Harry fell forwards onto his knees on the wonderfully solid ground, Cedric right next to him, hand still in his. They stayed there for a moment before getting up, Cedric first and using the hand still in his to help Harry before letting go.\n \n‘Come on, the Skrewt is next. We have to try and hit it on its underbelly.’ Cedric just nodded and they continued on in silent for about ten minutes before rounding a corner and coming to face with it.\n \nIt was as enormous as always. Ten feet long, it looked more like a giant scorpion than anything. Its long sting was curled over its back. Its thick armour glinted in the light from Harry’s wand, which he pointed at it.\n \n‘Impedimenta!’ Harry yelled at the same time Cedric did and one of their spells hit the mark .The Skrewt froze – they had managed to hit it on its fleshy, shell-less underside.\n \n‘That was never that easy.’ Harry said to Cedric who huffed a laugh but soon they continued walking not wanting to risk the skrewt starting to move again. ‘At some point ahead was the place that Krum attacked you; I don’t know what will happen now that you are with me.’\n \n‘You never say who is it that is the Death Eater inside the castle.’ Cedric said very quietly and Harry really shouldn’t be surprised that Cedric would want to know who it was.\n \n‘I didn’t want to risk any of you doing something to let him know. He is very dangerous.’ After a moment of consideration Harry decided to be truthful. ‘But I guess it would be better for you to know now. It’s Moody.’\n \n‘Moody?! But he is a famous Auror!’ Cedric sounded indignant.\n \n‘It is not really Moody; we never even met the real Moody. The Death Eater has been polyjuicing himself as Moody the entire year. He is actually Barty Crouch Jr.’\n \n‘Mr Crouch’s son? I thought he died a long time ago.’\n \n‘A lie. Mrs Crouch traded places with him in Azkaban before she died and he has been hiding with his father ever since and now – well,’ They fell silent and Harry was glad. He couldn’t stop thinking about Barty Crouch and what his family did for him and yet he still killed his own father like it was nothing.\n \n‘Harry.’ Cedric called and Harry snapped out of it and looked ahead. There was the sphinx. Harry let out a breath and thanked everything that they didn’t encounter Krum; he really didn’t want to have to attack Viktor.\n \nWhen they were close enough she spoke, in a deep, hoarse voice like always. ‘You are very near your goal. The quickest way is past me.’\n \n‘There is a riddle, right?’ said Harry, knowing what the answer was going to be.\n \n‘Yes,’ she said, continuing to pace and looking pleased. ‘Answer on your first guess – I let you pass. Answer wrongly – I attack. Remain silent – I will let you walk away from me, unscathed.’\n \n‘OK,’ he said. ‘Can we hear the riddle?’ He was humoring her and Cedric shot him a look that told him he knew exactly what Harry was doing.\n \nThe sphinx sat down upon her hind legs, in the very centre of the path, and recited:\n \n\n‘First think of the person who lives in disguise,\n\n\nWho deals in secrets and tells naught but lies.\n\n\nNext, tell me what’s always the last thing to mend,\n\n\nThe middle of middle and end of the end?\n\n\nAnd finally give me the sound often heard\n\n\nDuring the search for a hard-to-find word.\n\n\nNow string them together, and answer me this,\n\n\nWhich creature would you be unwilling to kiss?’\n\n \nHarry looked at Cedric and gave him a cheeky grin. ‘Do you wanna have a go?’\n \nCedric shook his head and laughed ‘We can solve all the riddles you want after we get out of here. You can have this one.’\n \n‘A creature I wouldn’t want to kiss is a spider!’  Harry answered easily and smiled back at Cedric.\n \nThe sphinx smiled at them. She got up, stretched her front legs, and then moved aside for him to pass.\n \n‘Thanks!’ said Harry and Cedric at the same moment before they dashed forwards.\n \n‘It is close now, just ahead. If the spider appears it is the same thing we did with the Skrewt; we aim it for its underbelly. Be aware of your left.’ Cedric just nodded and soon they saw it.\n \nThe Triwizard Cup was gleaming on a plinth a hundred yards away. Harry and Cedric broke into a run, when a dark figure hurtled out of the left. Cedric rolled and brought Harry down with him; both of them out of the path of the spider and in a good position to aim at it.\n \n‘Stupefy!’ They yelled together and the spider keeled over sideways, flattening a nearby hedge, and strewing the path with a tangle of hairy legs.\n \n ‘You all right?’ Cedric asked already sitting up and giving Harry a hand.\n \n‘Yeah, again; never that easy.’ Cedric pulled him up and huffed a laugh.\n \n‘Guess it is easier when both parties know what is going on.’ They turned back to the path of the cup and walked more sedately towards it.\n \nThis was it.\n \n‘Promise me once we get to the graveyard you will hide immediately.’ Harry pleaded and he could see how hard it was on Cedric to agree.\n \n‘I promise.’ Cedric said and Harry felt more at ease, so he took out the thing he had hidden on his robes’ pocket.\n \n‘Here, have this.’\n \n‘What is it?’ Cedric took the silky fabric and looked at it in confusion.\n \n‘My invisibility cloak. Use it carefully.’ Cedric gaped at it before nodding and putting it in his own pocket before turning back towards the cup; Harry turned too. ‘On three, right?’ said Harry. ‘One – two – three –’\n \nHe and Cedric both grasped a handle.\n \nInstantly, Harry felt a jerk somewhere behind his navel. His feet had left the ground. He could not unclench the hand holding the Triwizard Cup; it was pulling him onwards, in a howl of wind and swirling colour, Cedric at his side.\n \nHarry felt his feet slam into the ground; his hand let go of the Triwizard Cup. He raised his head and looked at the now familiar view of the graveyard.\n \n‘Cedric, the cloak.’ Cedric frowned but nodded and soon enough he disappeared completely. Harry breathed out in relief.\n \nHarry got to his feet and waited. Soon enough a dark figure approached and Harry’s scar exploded with pain. He was being dragged towards a marble headstone and he knew what came next.\n \n\n\"Bone of the father, unknowingly given, you will renew your son! Flesh of the servant, willingly sacrificed, you will revive your master. Blood of the enemy, forcibly taken, you will resurrect your foe.\"\n\n\n \n\n\n \n\nAnd then for how many times Harry could not even remember anymore.\n \nLord Voldemort rose again.\n \n \nThis time when Priori Incantatem happened Harry could only feel relief to see the old man come out of Voldemort’s wand first.\n \n‘He was a real wizard, then?’ the old man said, his eyes on Voldemort. ‘Killed me, that one did … you fight him, boy …’\n \nHarry just nodded and noticed how the Death Eaters were falling to the ground suddenly. But then a feeling of loss came to him suddenly; this was probably the last time he would see his parents, but he shook it off. And soon enough there they were.\n \nThe smoky shadow of a young woman with long hair fell to the ground as Bertha had done, straightened up, and looked at him … and Harry, his arms shaking madly now, looked back into the ghostly face of his mother.\n \n‘Your father’s coming …’ she said quietly. ‘He wants to see you … it will be all right … hold on …’\n \nAnd he came … first his head, then his body … tall and untidy-haired like Harry, the smoky, shadowy form of James Potter blossomed from the end of Voldemort’s wand, fell to the ground, and straightened like his wife. He walked close to Harry, looking down at him, and he spoke in the same distant, echoing voice as the others, but quietly, so that Voldemort, his face now livid with fear as his victims prowled around him, could not hear …\n \n‘When the connection is broken, we will linger for only moments … but we will give you time … you must get to the Portkey, it will return you to Hogwarts … do you understand, Harry?’\n \n‘Yes,’ Harry gasped; fighting now to keep a hold on his wand, which was slipping and sliding beneath his fingers.\n \n‘Do it now,’ whispered his father’s voice. ‘Be ready to run … do it now …’\n \n‘NOW!’ Harry yelled; he didn’t think he could have held on for another moment anyway – he pulled his wand upwards with an almighty wrench, and the golden thread broke; the cage of light vanished, the phoenix song died – but the shadowy figures of Voldemort’s victims did not disappear – they were closing in upon Voldemort, shielding Harry from his gaze –\n \nAnd Harry ran as he had never run in his life, jumping over two stunned Death Eaters as he passed; he zig-zagged behind headstones, feeling their curses following him, hearing them hit the headstones – suddenly he felt a hand on his own and almost jumped before remembering it was Cedric and breathing out in relief.\n \n‘Stun him!’ he heard Voldemort scream before turning and locking his gaze with the Dark Lord's.\n \nVoldemort’s red eyes flamed in the darkness. Harry saw his mouth curl into a smile, saw him raise his wand.\n \n‘Accio!’ Harry yelled, pointing his wand at the Triwizard Cup.\n \nIt flew into the air, and soared towards them – Harry caught it by the handle and saw Cedric’s hand come out of the cloak to do the same –\n \nHe heard Voldemort’s scream of fury at the same moment as he felt the jerk behind his navel that meant the Portkey had worked – it was speeding him away in a whirl of wind and colour, Cedric along with him … they were going back …\n \n \nHarry felt himself slam flat into the ground; his face was pressed into grass; the smell of it filled his nostrils. He had closed his eyes while the Portkey transported him, and he kept them closed now. He did not move. All the breath seemed to have been knocked out of him; his head was swimming so badly he felt as though the ground beneath him was swaying like the deck of a ship. To hold himself steady, he tightened his hold on the two things he was still clutching – the smooth, cold handle of the Triwizard Cup, and Cedric’s hand.\n \nSuddenly he started laughing.\n \n‘Harry? Are you OK?’ He could hear Cedric next to him ask worriedly but he continued sniggering and at once the other boy sat up, turned him over and looked down at Harry, who just laughed harder.\n \n‘Did you honestly go around stunning Death Eaters while you were invisible?’ Harry said between laughs and struggling to sit up; Cedric started laughing too.\n \n‘I couldn’t really do nothing and I stayed hidden so – I kept my promise.’ Cedric said simply with a shrug and a bashful grin.\n \n‘And here I thought Slytherins were the cunning ones. You are unbelievable.’ Harry said but then suddenly a pair of hands seized his shoulders roughly and sat him up properly. He stopped smiling.\n \n‘Harry! Harry!’\n \nAlbus Dumbledore was crouched next him. The dark shadows of a crowd of people pressed in around them, pushing nearer; they had come back to the edge of the maze. He could see the stands rising above him, the shapes of people moving in them, the stars above.\n \nHarry let go of the Cup, but clutched Cedric’s hand to him even more tightly. He raised his free hand and seized Dumbledore’s wrist.\n \n‘He’s back,’ Harry whispered. ‘He’s back. Voldemort.’\n \n‘What’s going on? What’s happened?’\n \nCornelius Fudge appeared and frowned at Harry and Cedric and the cup next to them.\n \n‘Did – did the both of you grab it?!’ He sounded appalled and Harry felt the urge to laugh again. Honestly, two champions were the least of his problem.\n \n‘Professor, Moody is gonna appear and try to take me with him any minute now,’ Harry ignored Fudge and the crowd of students that had started to cheer for either him or Cedric or both. He needed Dumbledore to listen to him. ‘Don’t let him; he is not who you think he is. He is polyjuiced and he is the one who did all this.’\n \nDumbledore’s eyes looked very deeply into his and Harry had that odd feeling he had from time to time that the Headmaster could read minds. Blue eyes then took in Harry’s haggard appearance; how his arm had a bleeding cut and he was shaking both from exhaustion and from being tortured. Dumbledore regarded Cedric and how he still had Harry’s cloak in his hand and then the Cup. Soon enough there was the distinct clunking of Moody approaching.\n \n‘I’ll take Harry to the hospital wing, Dumbledore, I’ll take him –’ But Moody said no more because as fast as lighting Dumbledore stunned him. The whole crowd fell silent.\n \n‘Dumbledore! What on earth!’ The Minister looked like he would have a stroke. ‘Attacking one of your teachers! An ex-Auror!’\n \n‘This is not Alastor Moody, Severus if you’d please.’ Harry never in his life was so relieved to see Snape; Dumbledore was taking him seriously. ‘If you would be so kind to lend us your office; we will need the strongest Truth Potion you possess, and then go down to the kitchens, and bring up the house-elf called Winky. Minerva, kindly go down to Hagrid’s house, there you will find a large black dog sitting in the pumpkin patch. Take the dog up to my office, tell him I will be with him shortly, then come back here.\n \n‘Cornelius, do come with us and interrogate the suspect too.’ Dumbledore said as an afterthought to Fudge before helping Harry to his feet, then Harry ended up pulling Cedric too since they were yet to let go of each other; neither of them seemed inclined to.\n \nDumbledore levitated the stunned Moody and started walking back into the castle, Snape, Harry, Cedric and, once he seemed to get his act together, Minister Fudge.\n \nOnce they were inside Snape’s dudgeon office, Dumbledore tied Moody to one of the chairs, pulled out the one at the desk and sat down upon it, his eyes fixed upon the unconscious Moody. Harry stared at him, too knowing already what would happen. Minutes passed in silence …\n \nThen, before Harry’s very eyes, the face of the man on the chair began to change. The scars were disappearing, the skin was becoming smooth; the mangled nose became whole, and started to shrink. The long mane of grizzled grey hair was withdrawing into the scalp, and turning the colour of straw. Suddenly, with a loud clunk, the wooden leg fell away as a normal leg regrew in its place; next moment, the magical eyeball had popped out of the man’s face as a real eye replaced it; it rolled away across the floor and continued to swivel in every direction.\n \nHarry heard Cedric gasp and even Professor McGonagal,l who had returned sometime before, gasped too.\n \n‘Crouch!’ Snape said, looking stunned. ‘Barty Crouch!’\n \n‘Good heavens,’ said Professor McGonagall.\n \nFilthy, dishevelled, Winky peered around Snape’s legs. Her mouth opened wide and she let out a piercing shriek. ‘Master Barty, Master Barty, what is you doing here?’\n \nShe flung herself forwards onto the young man’s feet. ‘You is killed him! You is killed him! You is killed master’s son!’\n \n‘He is simply Stunned, Winky,’ said Dumbledore. ‘Step aside, please. Severus, you have the Potion?’\n \nSnape handed Dumbledore a small glass bottle of completely clear liquid; the Veritaserum and then Harry was listening once more the tale of Barty Crouch.\n \nHow his parents helped him escape from Azkaban, about Bertha Jonkins and the Dark Mark at the Quidditch World Cup. How Voldemort appeared at his house with Wormtail and put his father under an Imperius. How Voldemort gave him a task to prove his loyalty, and then about trading places with Moody so that he could assure that Harry entered the tournament and how he killed his own father. And then…\n \n‘I offered to carry the Triwizard Cup into the maze before dinner,’ whispered Barty Crouch. ‘Turned it into a Portkey. My master’s plan worked. He is returned to power and I will be honoured by him beyond the dreams of wizards.’\n \nThe insane smile lit his features once more, and his head drooped onto his shoulder as Winky wailed and sobbed at his side.\n \nCornelius Fudge was incredibly silent trough out the whole ordeal and Harry knew he had to stop whatever was going on in the Minister’s head.\n \n‘You are thinking about having him Kissed.’ Harry said suddenly in the silence that had reigned in Snape’s office once Crouch was done talking. Everyone but Dumbledore jumped, like they forgot Harry was even there; Cedric’s hand in his squeezed hard.\n \n‘A Legilimens now, Mr Potter?’ Fudge said stonily, refusing to look at Harry or anyone else. Harry glanced at Dumbledore and saw the Headmaster give him a nod; it was all he needed.\n \n‘This man is our proof, he has all the evidence. You have him kissed and you are deliberately destroying that.’ Fudge then turned to Harry, enraged; Harry heard McGonagall gasp and once again Cedric’s hand squeezed his.\n \n‘This man is a lunatic!’ Fudge sputtered and gestured at Crouch while still staring at Harry ‘I would be very careful with what you say Potter. It seems like you are accusing me of something.’\n \n‘I am.’ Harry agreed and knew he was being stupidly brave at that moment. ‘You don’t want to admit that Voldemort is back but he is. I saw everything, I was there.’\n \n‘Not like your word counts for much either, Potter.’ And it wasn’t the first time Harry heard it but it angered him all the same.\n \n‘Reading much Rita Skeeter, Minister?’ Fudge reddened slightly, but a defiant and obstinate look came over his face.\n \n‘And if I have?’ he said, looking at Dumbledore. ‘If I have discovered that you’ve been keeping certain facts about the boy very quiet? A Parselmouth, eh? And having funny turns all over the place –’\n \n‘You mean the pains in my scar? The pains that always tells me when Voldemort is up to something! And look at that, he is back!’\n \n‘He can’t be back!’ Fudge screamed and for once everyone in the office seemed stunned speechless. ‘He can’t. It would ruin me.’\n \n‘You are blinded,’ said Dumbledore finally, his voice rising, the aura of power around him palpable, his eyes blazing, ‘by the love of the office you hold, Cornelius! I tell you now – take the steps you know you have to, and you will be remembered, in office or out, as one of the bravest and greatest Ministers for Magic we have ever known. Fail to act – and history will remember you as the man who stepped aside, and allowed Voldemort a second chance to destroy the world we have tried to rebuild!’\n \n‘Insane,’ whispered Fudge, backing away. ‘Mad …’\n                                                           \nSnape strode forwards from his place on the corner, pulling up the left sleeve of his robes as he went. He stuck out his forearm, and showed it to Fudge, who recoiled.\n \n‘There,’ said Snape harshly. ‘There. The Dark Mark. It is not as clear as it was, an hour or so ago, when it burnt black, but you can still see it. Every Death Eater had the sign burnt into him by the Dark Lord. It was a means of distinguishing each other, and his means of summoning us to him. When he touched the Mark of any Death Eater, we were to Disapparate, and Apparate, instantly, at his side. This Mark has been growing clearer all year. Karkaroff’s, too. Why do you think Karkaroff fled tonight? We both felt the Mark burn. We both knew he had returned. Karkaroff fears the Dark Lord’s vengeance. He betrayed too many of his fellow Death Eaters to be sure of a welcome back into the fold.’\n \nFudge stepped back from Snape, too. He was shaking his head. He did not seem to have taken in a word Snape had said. He stared, apparently repelled, at the ugly mark on Snape’s arm, then looked up at Dumbledore and whispered, ‘I don’t know what you and your staff are playing at, Dumbledore, but I have heard enough. I must return to the Ministry.’\n \nHe had almost reached the door but then Cedric steeped away from Harry and came to stand in front of it. Fudge stopped and seemed to recoil again.\n \n‘I was there too you know Minister. I saw everything that happened. You have no claims on my mental health; can ask anyone who knows me to pledge for it.’ Fudge was starting to look around as if to find another exit. ‘I’m overage you know, had to be to enter the tournament. I can very willingly volunteer myself for an interrogation under Veritaserum. I can give anyone who asks my memories. I can stand in the atrium of The Ministry all day, every day, and talk about it to anyone who wants to hear about the night You-Know-Who returned.’ Cedric was impassable and Harry never felt so awed by someone before.\n \nFudge seemed to lose all the fight in him; it was like he shrunk in size. He turned to look at Dumbledore and sighed.\n \n‘Very well, Dumbledore. You win.’\n \n‘Oh, my dear Cornelius. I don’t think anyone is a winner in this.’ The Headmaster got up and strode to the door. ‘If you would please wait in Minerva’s office, I still have to talk to Harry about tonight’s happenings before you and I can discuss all that will have to be done.’ Fudge just nodded and let himself be led by McGonagall. Dumbledore turned to Harry and Cedric.\n \n‘You were both very brave tonight, but if I might ask that you let me talk to Harry alone for a moment Mr Diggory.’ Cedric seemed like he would argue for a moment but caught himself. ‘I will want to talk to you too, but now why don’t you go to the hospital wing. I’ll send word for both your families to meet you there and bring Harry down once we are done.’\n \n \nOnce Harry was done telling his tale, all of it this time – with the ever resetting days and all – it felt like Sirius would snap his shoulder with all the force he was putting over it. But Harry could only look at Dumbledore sad blue eyes.\n \n‘To have endured such hardship over and over again, Harry. You indeed have shown bravery beyond anything I could have expected of you. I just ask why you didn’t come to me at any moment.’\n \n‘I didn’t know what I was doing most of the time, Professor. I can’t even be sure if I won’t wake next and I’ll be staring at my ceiling again.’ Harry admitted what he was dreading. Because if this wasn’t it he had no idea what was.\n \n‘Time, is a very dangerous magic; very fickle. Let us hope that you were right. But if not, please come to me next time.’\n \n‘I will, sir.’\n \n‘Good. You will come with me to the hospital wing. I do not want you returning to the dormitory tonight. A Sleeping Potion, and some peace … Sirius, would you like to stay with him?’\n \nSirius nodded, and stood up. He transformed back into the great black dog, and walked with Harry and Dumbledore out of the office, accompanying them down a flight of stairs to the hospital wing.\n \nWhen Dumbledore pushed open the door, Harry saw Mrs Weasley, Bill, Ron and Hermione grouped around a harassed-looking Cedric, who had his parents next to him, together with Luna and one of his year mates. They appeared to be demanding to know where Harry was and what had happened to him.\n \nAll of them whipped around as Harry, Dumbledore and the black dog entered, and Mrs Weasley let out a kind of muffled scream. ‘Harry! Oh, Harry!’\n \nShe started to hurry towards him, but Dumbledore moved between them.\n \n‘Molly,’ he said, holding up a hand, ‘please listen to me for a moment. Harry and Cedric have been through a terrible ordeal tonight. Harry has just had to relive it for me. If you would please also not bother Cedric. What they needs now is sleep, and peace, and quiet. If they would like you all to stay with them,’ he added, looking around at Ron, Hermione, Bill, the Diggorys, Luna and Cedric's friend too, ‘you may do so. But I do not want you questioning them until they are ready to answer, and certainly not this evening.’\n \nMrs Weasley nodded. She was very white.\n \nShe rounded on Ron, Hermione and Bill as though they were being noisy, and hissed, ‘Did you hear? They need quiet!’\n \n‘Headmaster,’ said Madam Pomfrey who had been standing back and was staring down at the great black dog that was Sirius, ‘may I ask what –?’\n \n‘This dog will be remaining with Harry for a while,’ said Dumbledore simply. ‘I assure you, he is extremely well trained. Harry – I will wait while you get into bed.’\n \nHarry went straight over to the bed next to the one Cedric had already laid, suddenly feeling very exhausted.\n \n‘I will be back to see you as soon as I have met with Fudge, Harry,’ said Dumbledore. ‘I would like you to remain here tomorrow, until I have spoken to the school.’ He left.\n \n‘Are you OK?’ Harry turned his head and asked Cedric who gave him a half smile.\n \n‘I should be asking you that. I didn’t even really do anything.’\n \n‘You did so much.’ Harry said with so much feeling that made Cedric’s lips part in wonder. Thankfully a throat clearing made they break the probably too long stare.\n \nMadam Pomfrey was stood next to Harry’s bed, she handed him some pyjamas and pulled screens around him. He took off his robes, pulled on the pyjamas, opened the screens and got into bed. Ron, Hermione, Bill, Mrs Weasley and the black dog came and settled themselves in chairs on either side of him; same as Cedric’s parents, Luna and his friend did next to him. Ron and Hermione were looking at him almost cautiously, as though scared of him.\n \n‘I’m all right,’ he told them. ‘Just tired.’\n \nMrs Weasley’s eyes filled with tears as she smoothed his bedcovers unnecessarily.\n \nMadam Pomfrey, who had bustled off to her office, returned holding two goblets and a small bottle of some purple potion.\n \n‘You two will need to drink all of this.’ she said. ‘It’s a potion for dreamless sleep.’ Harry knew very well what it was and was very wary of it. Cedric noticed.\n \n‘It’s alright.’ \n \n‘What if it all goes back again?’ Harry asked nervously and was glad when Hermione took his hand in hers. He was aware half the room didn’t really understand what he was talking about but he didn’t care.\n \n‘If that happens you know you can count on us either way.’ Hermione said giving him the best smile that she could and it actually did make him feel better. So he took the goblet and drank it. He felt himself becoming drowsy at once and soon he was asleep.\n  \nHarry woke up to a very loud and unknown sound. He opened his eyes and everything was blurry.\n \n‘What the hell is that noise?’ He mumbled while looking for his glasses, someone must have moved them.\n \n‘That would be Scott.’ A voice next to him said and for a moment Harry heart skipped. He hurried to find his glasses and once they were on he could have cried in relief.\n \nHe was in the Hospital wing, with its white linen sheets and vaulted ceiling. Next to him in all manners of sleep were Ron, Hermione – his friend had a jar with what looked like a beetle next to her and Harry could very well imagine what that was –, Mrs Weasley and Bill and he could even see Sirius' animagus form at the foot of his bed. Looking to the other side he could equally see Mr and Mrs Digorry also asleep, Luna sleeping like a cat in one of the beds farther away and Cedric’s friend – Scott – folded over it with his head on top of his arms and sleeping; and snoring indeed very loudly.\n \nMost importantly he could see the sunshine coming through the windows.\n \nHe turned his eyes – which he felt were suspiciously wet – back at Cedric who was smiling very softly back at him.\n \n‘It’s tomorrow.’ Harry could feel his voice catching but he didn’t really care either. Cedric just nodded and continued smiling at him.\n \n‘It’s tomorrow.’"
}