{
    "id": "11399586",
    "url": "https://archiveofourown.org/works/11399586?view_full_work=true",
    "author": [
        "XenophonSpeaks"
    ],
    "title": "Whatever It Takes",
    "rating": "Explicit",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Bakugou Katsuki/Todoroki Shouto"
    ],
    "characters": [
        "Bakugou Katsuki",
        "Todoroki Shouto",
        "Todoroki Enji | Endeavor",
        "Kirishima Eijirou",
        "Kaminari Denki",
        "Uraraka Ochako",
        "Bakugou Mitsuki"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence",
        "Dorm Living",
        "fake dating au",
        "Homophobia",
        "Awkward Dates",
        "Awkward Flirting",
        "Making Out",
        "Biting",
        "Marking",
        "Oral Sex",
        "Hand Jobs",
        "Angst with a Happy Ending",
        "Bakugou Katsuki Swears A Lot",
        "bakugou pov",
        "Pining",
        "kirikami side pairing"
    ],
    "language": "English",
    "series": "Part 6 of TodoBaku Week 2017",
    "published": "2017-07-04",
    "completed": null,
    "words": "19,969",
    "chapters": "1/1",
    "comments": "383",
    "kudos": "16,000",
    "bookmarks": "3,103",
    "hits": "187,536",
    "summary": "<p>Bakugou Katsuki, in typical fashion, makes a brash decision that changes his life irrevocably. Anger has always had a way of bringing Bakugou what he wants, though. He just hadn't realized dating someone would be so fucking difficult.</p>\n<p> </p>\n<p>(Or, that one where Bakugou agrees to pretend to date Todoroki just to piss off Endeavor, and ends up falling in love instead.)</p>",
    "notes": "<p>Happy (belated) TodoBaku Week. Day six brought to you by the prompt: Family. </p>\n<p>Lord have mercy on me, this fic was originally going to be fairly short and then it just kept going and going and then it became SMUT and eventually it was 20k. Have you ever written so much in such a short amount of time that you don't even know if it's making sense anymore? That's where I'm at. Yet again. Ffffffffff</p>\n<p>I'm also dedicating this fic to mybrainproblems, who honestly gave me the entire inspiration for this story. Our mutual hatred of Endeavor has brought something useful to the fandom, I hope, lmfao. ILU FRIEND.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>For the love of all that is holy, please come scream at me about bnha on tumblr. This guy needs fandom friends. xenophonspeaks.tumblr.com</p>",
    "text": "Bakugou was wandering around the dorms of U.A. aimlessly on a day much like any other when he made a decision that would change his life irrevocably.\nHe had been walking the hallways in an effort to stretch his legs after finishing up an assignment, hoping to relieve some of the built-up frustration that came with working on math for several hours. It was an unusually hot day, the kind that left a strong feeling of discomfort lingering in the air even when Bakugou was nice and comfortable inside his dorm room, AC cranked up to the max. As a result, he was already in a pretty terrible fucking mood, truth be told, but he was also feeling exceptionally good because he knew without a doubt he’d at least done the homework perfectly.\nBakugou loved being right. Specifically, Bakugou loved being more right than everyone else. Being the best was a better feeling than just about anything else he’d ever known.\nThis combination of emotions lead to what Kirishima sometimes called Bakugou’s worst mood of all: the sort where he went out looking for a fight because he was convinced he could win.\nHe wasn’t actively seeking out a confrontation, though. After three years, getting yelled at by Aizawa was starting to lose it’s charm, so picking a fight needlessly wasn’t  exactly something he was intent on. But maybe he’d stumble on some poor soul who was also out wandering the halls, and who would be foolish enough to agree to spar with him.\nOr maybe he’d just hit the kitchen and grab some food.\nHe was feeling unpredictable like that.\nAs he rounded the corner of the bottom stairwell connecting to the downstairs lobby, Bakugou heard raised voices coming from near the front doors. He recognized one raised voice in particular immediately as Todoroki’s, Bakugou’s hair raising on end at the unexpected anger he could hear even from where he stood. The other voice Bakugou was less familiar with, but it was still one he’d recognize anywhere from countless hours watching him on TV growing up.\n“I’m tired of this rebellious behavior, Shouto,” Endeavor’s voice rang, loud enough to echo through the open space of the lobby. “You will go to the omiai.”\n“I am not a child anymore, father,” Todoroki’s disembodied voice replied, clearly aggitated. “I refuse.”\nBakugou felt his hackles rise for some inexplicable reason.\n“You will marry a woman who will bring you strong heirs, Shouto. I won’t hear any arguments about this,” Endeavor replied. As though this were obvious and Todoroki should already know it. As if he didn’t have a fucking say in his own life at all. “There is no one else better suited to mix your quirk with. You will attend. I won’t take no for an answer.”\nBakugou peered surreptitiously around the corner before padding forward quietly, somehow instinctively knowing Todoroki’s next response would be harder to hear if he didn’t.\nThis wasn’t eaves-dropping, he told himself. He wasn’t being rude by listening in. Hell, they were standing in the middle of the goddamn foyer; their conversation wasn’t exactly private in the first place.\nBut Bakugou couldn’t deny he had a personal investment in hearing what was taking place, either. Ever since their first year in school, Bakugou had born a powerful hatred of Endeavor. He hadn’t liked him well before that, but once he’d seen how he treated his son, that dislike had turned into an active feeling so powerful it was nearly visceral at times.\nLike now, for example.\nBakugou didn’t feel particularly endeared towards Todoroki most of the time. They’d reached a tentative state of truce over the years, their relationship fading from outright hostility to civil rivalry and slowly into an unspoken mutual respect.\nThat didn’t make them friends, though. Bakugou shouldn’t really care what happened between Todoroki and his father.\nBut he did. Intensely. At least when it came to this, for reasons he couldn’t fully explain.\n“I’m not going to marry a woman who will give me strong heirs,” Todoroki responded through what sounded like gritted teeth, “Because I won’t be marrying a woman. I’m gay, father. I have told you this. Many times, in fact. It’s not something I can change or help.”\nBakugou felt his eyebrows climb into his hairline. Well, that wasn’t something he had ever been sure about, but he’d always had his suspicions. He suddenly felt a kinship with Todoroki he hadn’t known he’d even been capable of until that moment.\n“I won’t hear any more of this nonsense, Shouto,” Endeavor boomed, Bakugou watching as Todoroki flinched back in response. “You will marry whoever I say. I will not have my son be so disgraceful as to lay with another man.”\nBakugou felt like he’d been stabbed in the gut, something in him that had been wrought tight suddenly snapping like a frayed wire.\nMaybe it was the mood he’d already been in earlier, maybe it was the idea that Endeavor was trying to make something so fucking unimportant and perfectly normal into something so shameful, or maybe it was the idea that Todoroki would flinch away from absolutely anyone, but Bakugou was suddenly prepared to do whatever he had to do to make sure Endeavor regretted ever having uttered those fucking words.\nWithout further thought, he marched straight up to Todoroki, wrapping one arm around his waist before dropping his chin to rest possessively on his shoulder. “Hey, babe. You didn’t tell me your dad was coming by today,” he said, voice flat and eyes hard.\n“B-Bakugou?” Todoroki stammered, turning his head to look at him with wide eyes.\nBut Bakugou wasn’t looking at Todoroki. Bakugou was looking at Endeavor.\nHe smiled, knowing the expression was anything but friendly. “Hello, dad,” Bakugou said, eyes dancing with barely-suppressed rage. “I’m sure you already know who I am, but let me reintroduce myself. I’m Bakugou Katsuki, Shouto’s boyfriend.”\nHe felt Todoroki seize up beneath him, but he made no move to pull away. Bakugou didn’t know what to make of that, but continued talking anyway.\n“Great to see you again,” Bakugou finished, voice full of false cheer. “Looking forward to being a part of the family someday.”\nIt wasn’t often Bakugou had the chance to show up the world’s Number Two hero, but based on the look Endeavor was currently sporting, he was pretty confident he could mark this moment down as a life achievement.\nEndeavor’s face was red—not with flame, but with anger. He looked like he was about to have a fucking aneurism, much to Bakugou’s amusement. Bakugou didn’t bother to suppress his grin, which was a lot more of a threat than it was a friendly gesture, teeth sharp and gleaming.\nEndeavor shook with visible outrage, his skin mottled, eyes burning. “Shouto. What is the meaning of this?”\nBakugou opened his mouth to reply, assuming Todoroki would be too baffled and probably weirded out to respond himself, but was shocked when he felt a sudden pressure against the top of his head, Todoroki tilting his own to rest it against Bakugou’s. One of his hands came to rest on top of his where it rested against Todoroki’s waist, entertwining their fingers as if it was the most natural thing in the world. “Precisely what it sounds like, father. This is my boyfriend, Bakugou Katsuki.”\n“Boyfriend?” Endeavor repeated, as though he couldn’t comprehend it.\nTodoroki made a motion that felt like a careless shrug. “I did try to tell you, but you wouldn’t listen.”\n“But—he can’t possibly be, he’s—“\n“Yep, his boyfriend,” Bakugou confirmed. “So I’d appreciate it if you’d stop trying to get him to date women and shit. Otherwise we’re gonna have ourselves a problem, dad.”\nEndeavor’s face contorted at the word, and Bakugou felt a spike of absolute glee shoot through his veins. It was probably that sense of victory going to his head that made his next action seem perfectly reasonable.\nHe turned slightly, jostling Todoroki just enough to reach up and plant a kiss on the side of his face. The fingers around his own squeezed reflexively in surprise, but again, Todoroki made no move to pull away from him.\n“Because he’s mine,” Bakugou continued darkly, lips brushing Todoroki’s skin with every word. He shot a look at Endeavor from the corner of his eyes, voice low. “And I don’t take kindly to people taking shit from me.”\nEndeavor opened his mouth and closed it several times, clearly attempting to find something to say to this but apparently beyond comprehensible thought or speech.\n“We will discuss this later,” he finally managed to hiss at Todoroki before he turned abruptly on his heel and marched out the front door, not bothering to look back even once, the door slamming shut behind him with a sense of finality.\nNeither of them moved or said anything until he was out of sight, Bakugou suddenly hit with the realization that he had maybe, possibly, over-stepped his bounds.\nHe’d just gone and done that. Even he almost couldn’t believe it.\nFuck.\nWell, at least his itch to fight had been scratched, he supposed.\nHe loosened his hold on Todoroki, pulling away slightly but stopping when he realized Todoroki was shaking.\nOh, god. Fuck, what were people supposed to do in this kind of situation? Bakugou hadn’t signed up for crying today, no fucking thank you, and yet he somehow felt responsible enough that he was obligated to do something about it.\n“Hey, uh,” he began, not sure where the hell he was going with this. “Are you fucking ok?”\nTodoroki suddenly threw his head back, the widest grin Bakugou had ever seen on his face as he laughed, full-bodied, hands clutching his stomach, the sound of his laughter ringing throughout the hallway radiantly.\nThe sight of it stole the breath from Bakugou’s lungs, and apparently took Bakugou’s remaining sanity along with it. Because all he could think as he watched Todoroki giggling like a fucking child was how captivating he looked when he laughed like that.\nAfter a moment Bakugou realized he, too, was grinning, a surprised snort escaping him before he could stop it.\nTodoroki looked up at him at the sound, their eyes locking briefly.\nAnd then they were both doubled over, Bakugou cackling, Todoroki wheezing with laughter until tears threatened to leak from the corners of his eyes.\n“I can’t believe that just fucking happened,” Bakugou gasped once he’d calmed down slightly, still grinning at the memory of Endeavor’s scandalized expression.\nTodoroki snorted, breath labored as he tried to get himself under control. “I—I can’t believe you did that.”\n“Fuck, me either,” Bakugou admitted in a rare show of honesty, likely due to the euphoria he was experiencing. “He just really pissed me off.”\nAwareness seemed to return to Todoroki abruptly, his expression sobering and turning cautiously curious as he gazed at Bakugou.\nBakugou could immediately tell they were about to have some kind of talk about feelings and shit, and as a result he instantly felt uncomfortable.\nFuck. This is why he didn’t get involved in other people’s shit.\n“What did he do to piss you off?” Todoroki asked, seeming genuinely confused.\nUgh. Jesus, he hated conversations like this.\nHe scrubbed a hand angrily through his hair, groaning. “Fuck, I don’t know, everything?”\nHe received a questioning look in response. This asshole wasn’t going to give up unless he got a real answer, he knew. Todoroki was annoyingly persistent when he wanted to be.\n\nFuck my life.This is why I’m never nice to anyone.\n\n“I didn’t like the way he was talking to you. Like you were fucking—fucking property or something,” Bakugou spat, turning to glare at the front door and wishing he could’ve punched Endeavor just once. “You can do whatever you want and fuck whoever you like, and he should keep his fucking nose out of it.”\nThere was silence following this statement. He turned, jolting when he found Todoroki looking at him with something close to awe. Like he’d never really seen Bakugou before this moment and was now pleasantly surprised by what he found.\nWhich was just wrong. Bakugou wasn’t a nice person. He didn’t deserve to be looked at like that. Not for that reason, at least. It was just common sense. Just because Endeavor didn’t possess a shred of decency didn’t mean Bakugou deserved a medal because he did.\nYet he couldn’t stop himself from adding, “There’s nothing wrong with being gay, alright? So don’t let that fucker make you feel stupid about it.”\nTodoroki’s eyes widened further, like he couldn’t believe what he was hearing.\n“Fuck, whatever. That’s all I’m saying about it,” Bakugou mumbled, turning away. He was prepared to march straight back up to his room but froze when a hand clasped firmly around his wrist.\n“I—I know you don’t like talking about things like this. Or to me,” Todoroki added as an afterthought. “But I want you to know that I am sincerely grateful for what you did. That was the greatest moment of my life, I think.”\nBakugou flushed, something pleasant thrumming in his chest at the words, but he didn’t turn around. “Yeah, well. If you ever need a fake boyfriend again,” he mumbled, waiving his free hand around as if that explained absolutely anything.\nIt apparently did, though, because Todoroki slowly let him go. “Yeah. Ok,” he mumbled, voice soft.\nWithout looking back, Bakugou made a hasty retreat to his room, practically running most of the way there. He slammed his door closed before dropping heavily onto his bed to stare at the ceiling.\nHe had no idea what he’d just done. Not really. But something in his gut told him that what he’d done was more serious than he’d first realized, and that he couldn’t take back.\nHe didn’t know how he felt about that.\n \n---\n \nA week later and Bakugou had mostly forgotten the incident. School had a way of distracting him from most personal problems in his life simply because he was determined to be the best in the class and spent a shitload of his time studying as a result.\nHe also occasionally threw himself into school work and hero training as a way to distract himself from said personal problems, but no one else had to know that.\nSo a week later, when he was in his room studying late one night, he was not too shocked to hear a knock on his door. Probably Kirishima wanting to see his answers to the calculus homework, he figured.\nHe was shocked when he opened the door to find Todoroki fucking Shouto standing there instead. Todoroki looked almost as surprised as he was, mouth hanging open a little, his eyes looking Bakugou up and down.\nBakugou blinked, looking down at himself and remembering he was wearing nothing but his boxers and one of his fitted black tank tops. It was fucking hot out, what was he supposed to do?\n“The fuck do you want?” Bakugou bit out, trying not to feel self-conscious.\nTodoroki’s eyes snapped up to look him in the face at the words as if suddenly remembering himself. “I, um. May I come in? I had something I wanted to… discuss with you.”\n“Am I going to like this?” Bakugou asked, feeling a headache rapidly coming on.\n“No. Probably not.”\nFor fuck’s sake.\nHe sighed, giving a long groan as he weighed his options, his fingers rubbing at the crease between his brows. Slam the door in Todoroki’s face, or invite him in and figure out what the fuck was going on?\nCuriosity won out, much to Bakugou’s annoyance. He opened the door wider, gesturing sharply at Todoroki to come in wordlessly.\nTodoroki stepped swiftly across the threshold and into the room as though afraid Bakugou might change his mind if he didn’t hurry, stopping to stand awkwardly in the center of the dorm as Bakugou slammed the door closed behind them.\nBakugou leaned back against the wall beside the door, crossing his arms over his chest and cocking one hip. “Alright, asshole. Talk.”\nTodoroki looked uncomfortable, his shoulders tense, a slight frown turning down the corners of his mouth. He swallowed visibly, seeming to steel himself. “Right. I wanted to ask you if—if—“\nHis fists clenched at his sides, like he was struggling to force the words out.\n“You said I could come to you if I ever needed a fake boyfriend again,” he said in a sudden rush. “Were you… serious about that?”\nBakugou felt his eyes widen, his arms dropping to his sides in surprise. Was he serious about that?\n“I wasn’t not serious. I guess,” he said, thinking aloud and finding it was true.\nTodoroki nodded, looking relieved. “If that’s the case, then I may have a favor to ask you.”\nA sense of foreboding loomed over Bakugou. Sadly, caution wasn’t something really in his vocabulary.\nHe sighed, walking across the room to sit on the edge of his bed, gesturing vaguely at Todoroki to take his desk chair. “Sit the fuck down and explain what the hell you’re talking about.”\n“Alright. But first, I’m going to ask you something because it’s… it’s bothering me, to be honest, and I also want to avoid making you unnecessarily uncomfortable,” Todoroki said as he pulled out the chair, straddling it to face Bakugou and gripping the back of the seat hard enough that his knuckles were white.\n“Kay,” Bakugou said, annoyed. “Just fucking ask me, idiot. I’m already fucking uncomfortable as it is.”\nTodoroki sighed, sounding pained. “Are you gay, Bakugou?”\nBakugou felt his eye twitch.\n“Whelp, you’re right. I’m definitely fucking uncomfortable as hell now,” Bakugou groused, closing his eyes and rubbing at his forehead, because he now had a full-on headache pounding behind his eyeballs. “Jesus christ, I hate that we even have to talk about shit like this.”\n“You don’t have to answer if you don’t want to,”Todoroki said, sounding embarrassed. “I shouldn’t have asked something so personal. I just—“\n“I’m not fucking gay, idiot,” Bakugou sighed. “I’m also not straight. Alright? Happy?”\nHe opened his eyes to find Todoroki blinking at him, that same look on his face from the week before, when he’d looked like he was really seeing Bakugou like he’d never actually looked until just then.\n“I don’t fucking care what’s in someone’s pants,” Bakugou clarified, irritated beyond all reason. “As long as someone is strong, smart, dedicated, and reasonably attractive, I’d probably like them. Doesn’t mean I’d date everyone though. Most people are fucking horrible to deal with outside of sex.”\nSilence followed this statement before Todoroki suddenly huffed, a small smile gracing his features.\n“That… somehow it’s both surprising and yet not to hear you say that,” he admitted.\nBakugou shrugged. Uncomfortably. Because they were talking about feelings and personal shit and this was starting to feel suspiciously like a bonding moment.\n“So what was the point of you asking me this shit again?” he prompted, voice strained.\nTodoroki shook his head as if to clear it. “I wanted to make sure my real purpose wouldn’t make you uncomfortable before I bothered to ask. And now that I’ve ascertained that I’m at least not outright excluded from your criteria,” he murmured, eyes trained on Bakugou with such intensity that he felt like Todoroki was attempting to see into his soul. “Would you mind pretending to be my boyfriend again? Perhaps on a more… extended basis?”\nBakugou blanched, not fully understanding. His face must have conveyed his confusion well enough, because Todoroki rushed to explain.\n“My father is attempting to manipulate me into marriage to a woman I have never even met and have no desire to spend the rest of my life with. I have thought about this long and hard, and the only way I can think to stop him is to out myself. Publically.”\nBakugou’s eyes widened, understanding dawning on him as Todoroki continued to speak.\n“What I’m asking for you to do is to pretend to go on dates with me where reporters might catch a glimpse of us. They will be tipped off ahead of time, of course. My father will be unable to force a marriage on me without hurting his own hero image socially, so this is the only real pressure I am able to put on him in order to make him stop pursuing his little project,” Todoroki said, venom dripping off the last word.\n“But in doing so, you will basically be my official boyfriend, according to the public. And as a result, you will be outed as well.”\nHe couldn’t believe what he was hearing. Frankly, it was an excellent plan, and Bakugou could completely see the merit in it. He just absolutely hated the idea that he was the one who had to take part as Todoroki’s significant other.\n“I am aware that this is a lot to ask of you, and I’m not exactly thrilled to be putting myself in your debt here. But if you do this,” Todoroki said, swallowing, his eyes dancing with something that wasn’t quite fear but was definitely something close to it, “I will grant you any one request.”\n“You want me to be your boyfriend, and take you on dates and do couple shit with you,” Bakugou summarized, “And in return, I get a favor from you back?”\n“Any one request,” Todoroki emphasized. “It can be anything. I will do whatever you want without question.”\n“So if I asked you to intentionally let me have the number one hero spot, you’d step down and give it to me?”\n“Yes,” Todoroki said without hesitation, though his eyes hardened. “I would.”\nBakugou felt his throat close up. He would never actually use something so fucking underhanded to win the number one spot, but just knowing that Todoroki was willing to give that up if it meant Bakugou agreed to help him with this made made Bakugou realize how serious he was.\nIt also made him weirdly aware of two things:\n1.Todoroki desperately needed his help. Him, Bakugou, and no one else. It made Bakugou feel strangely important to Todoroki in a way he had never anticipated he would be, suddenly holding a spot of such significance in the life of someone he had previously tried to keep at arms length.\n2. Bakugou hated helping people unless he had a very good reason for doing so. Those reasons were nearly always to his benefit in some way, and while Todoroki was offering him a very serious consolation prize for participating in this, Bakugou realized some part of him wanted to help even if he got nothing in return.\nMaybe it was just the thought of how much this would inevitably piss off Endeavor. That alone was a strong motivator. Bakugou wanted to believe that was his reason and not something as stupid and weird as actually giving a shit about Todoroki.\nWhich he didn’t. Obviously.\n“Fine,” he blurted abruptly. “I’ll do it. But you will owe me for it.”\nTodoroki’s mouth dropped open. His hands clutched at the wood of the desk chair so hard it was a wonder he didn’t somehow snap it in half. “You will? You really will?”\n“I just fucking said I would, didn’t I?” Bakugou hissed, turning his head away in embarrassment. Because now his brain was supplying him with all kinds of useless images of him and Todoroki doing stupid mushy couple things and it was so gross and disgusting it was making his heart race.\n“Sorry, I just didn’t think you’d actually agree. At least, not that easily,” Todoroki acknowledged.\nBakugou huffed, indignant, but didn’t feel up to arguing any more just then. “Can we maybe finish talking about this some other time? Never, preferably, but definitely not right fucking now?”\nTodoroki snorted, standing up from the chair. “We can discuss the details later, I suppose.”\nBakugou felt a childish urge to trip Todoroki as he walked across the room towards the door. He didn’t like how fucking amused and pleased Todoroki seemed to be by the whole thing.\n“I’ll text you later, then?” he asked as he swung the door open, glancing back to give Bakugou one last lingering look.\nBakugou scowled. “Do whatever you want. Just get out of my room.”\nThe door closed, leaving Bakugou with the image of Todoroki’s smile flashing just before he disappeared from sight.\nHe flopped back heavily against his bed, arms splayed out. His head was fucking pounding, his heart racing, blood rushing in his ears.\nNone of this really made a lot of sense to Bakugou, and yet for some reason, he found he was weirdly excited by the whole thing.\nHe wouldn’t admit to that aloud even under threat of death, however.\n \n---\n \nHe was sitting at lunch the next day with Kirishima and Kaminari when his phone vibrated in his pocket. Which was unusual, because only a handful of people texted him, and he could see them all in the lunch room at that very moment.\nHe pulled it out curiously, attempting to keep the two idiots at his table from noticing what he was doing. Which wasn’t too hard, given that they were in the middle of flirting obnoxiously with one another.\n[Half ‘n Half]: Are you free this coming Saturday?\nBakugou frowned. He’d forgotten he even had Todoroki’s number in his phone.\n[Explodo-King]: yeah i guess im free why?\nBarely ten seconds went by before his phone jolted with a reply.\n[Half ‘n Half]: I’d like to go on our first date, if you’re willing.\nBakugou felt his face redden immediately, his hand gripping his phone hard enough to threaten to break the damn thing.\nRight. They had to go on a date. He was aware of this. He just hadn’t thought it would happen so soon.\nHe didn’t feel mentally prepared. Which was stupid, because Bakugou believed in being prepared for anything at all times. He replied immediately, largely out of spite for himself.\n[Explodo-King]: fuck, fine i guess. when and where?\n[Half ‘n Half]: I was thinking something simple. Maybe coffee in the evening, if that works for you.\n[Explodo-King]: whatever, idc. meet me in front of the dorms at 6 then.\n[Half ‘n Half]: Alright.\nBakugou stared at his phone, feeling awkward. The conversation seemed over, but also ended abruptly enough that he felt like he should be saying something else, though he wasn’t sure what.\nChrist. Even fake dating was hard. He couldn’t imagine doing this shit for real.\n“Why are you making that face?” Kirishima asked suddenly, jarring Bakugou out of his thoughts.\nHe stuffed his phone hastily back into his pocket. “What fucking face, shitty hair?”\n“You know, the stupid one,” Kaminari replied, waving a hand at him as if that explained everything. Beside him, Kirishima nodded as though it actually did.\nBakugou glared. “Do you want to finish the rest of your lunch, or d’ya want to watch it go up in flames, asshole?”\nKaminari’s mouth shut immediately, though he still looked pleased with himself. Bakugou didn’t miss the fact that he surreptitiously scooted his plate closer to himself, however.\n“Seriously though man, what’s up? You’ve been staring at your phone for a while now. Everything ok?” Kirishima asked, eyes gleaming with genuine concern and affection.\nBakugou suddenly realized that he and Todoroki had neglected to discuss a very important aspect of this whole dating bullshit, which was what they were supposed to tell their friends. Or if they were supposed to tell them at all, though he had a feeling they’d find out once this shit all hit the news—which Bakugou knew without a doubt it would.\n“Can’t talk about it,” Bakugou mumbled, stuffing a spoonful of spicy curry into his mouth. He chewed, watching Kirishima and Kaminari’s eyebrows draw together in concern and knowing they weren’t going to shut up about it now. “I’m fuckin serious, I can’t tell you right now, alright? Christ. Everything’s fine, just—just fucking be patient or something and I’ll tell you when I can.”\n“This is sounding way more serious than I thought it was gonna be,” Kaminari said.\nKirishima was frowning. “Yeah. I thought you were gonna tell me your battery was dying or something. What the hell is going on, dude?”\n“What did I just fucking say?” Bakugou hissed, pounding his fist on the table. “I will tell you later. I’m not gonna talk about this right now so just fucking let it go.”\nThe mood surrounding their lunch table was tense, but after a minute Kirishima sighed, deflating. “Alright. I trust you, man.”\nKaminari snorted. “That’s going a little far, don’t you think?”\n“Shut the fuck up,” Bakugou bit out without much heat, kicking Kaminari under the table, who winced and grabbed at his shin in response, Kirishima offering to kiss it better immediately, Bakugou rolling his eyes.\nThe two of them lapsed into banter, leaving Bakugou with his thoughts. Which he supposed was kind of nice of them, but it also meant that Bakugou actually had time to think, which he sort of hated.\nSaturday. That was only a few days away.\nFuck.\n \n---\n \nThe rest of the week passed in a blur of school and physical training, and before he knew it, Saturday had already arrived.\nHe tried and failed to focus on homework for most of the day, managing to finish up only some of what he’d actually wanted to get done.\nMost of his day was spent pacing back and forth in his room, glaring at the clock as it steadily ticked closer and closer to six.\nWhy had he agreed to this. What a fucking horrible idea.\nHe didn’t know the first thing about dating. Sure, he’d seen plenty of it around him growing up, so he knew how it was supposed to work—in theory, anyway, because he’d never actually done it. Bakugou had fooled around with a few people before, but keeping anyone around for longer than a few days just seemed like too much work.\nWhat if he fucked up and made Todoroki uncomfortable? What if he did something stupid in front of a reporter? Hell, what the fuck was he supposed to wear?\nBakugou hated a lot of things, but right now it felt like he hated virtually everything ever. This was a fucking nightmare.\nBy five minutes till 6PM, Bakugou was a ball of angry nerves and no closer to knowing what the hell he was supposed to do. He stomped over to his closet in frustration, pulling on a nicely fitted shirt rather than the loose-fitting monstrosities he sometimes wore. It was black, but most of his clothing was, so he supposed that couldn’t be helped.\nHe glanced at himself in the mirror, turning slightly. His pants were baggy but hung low on his hips, clinging to the swell of his ass just right. The shirt showed off his arms, his abs just barely visible when he turned a certain way and the fabric pulled a little tighter as a result.\nWell. He’d fuck himself, so he couldn’t look that bad, he guessed.\nHe stuffed his hands in his pockets, storming down the stairs rapidly before he had any more time to dwell on what he was about to do.\nBakugou Katsuki was the best. Bakugou Katsuki was amazing. There was no way he’d be bad at dating anyway, so worrying was clearly a waste of his time.\nHe came to a stop at the bottom of the stairs, looking out the windows to the front lawn to find Todoroki already standing near the entrance, his hands in his pockets as he gazed up at the passing clouds, a slight flush to his face. He was dressed slightly nicer than usual in a light blue button-up shirt, which was rolled up to his elbows, and had on a pair of brown cargo shorts that fit him too well to be accidental.\nBakugou realized he was still frozen in place, staring. He shook his head, forcing himself back into motion.\nWhen he stepped outside, Todoroki turned to look at him, eyes widening as they looked Bakugou over.\nBakugou glared. “What? Got a problem?”\n“Not—not at all,” Todoroki replied, eyes locked on Bakugou’s arms for some reason. “You look… good. Very good, actually.”\nThe light was playing off of Todoroki’s eyes in a way that made them seem like they were glowing, and Bakugou wanted to argue that he wasn’t the only one looking unfairly attractive just then.\nBut he didn’t. That might seem like flirting. Which he wasn’t doing.\nBecause they weren’t actually dating. They were just supposed to look like they were.\n“Of course I look good,” Bakugou said instead, turning away. “Obviously. You look… decent, I guess.”\nHe glanced at Todoroki just in time to see him roll his eyes. “That’s high praise coming from you, I suppose.”\nThey managed to catch one another’s eye on accident, both breaking into an awkward flush.\nJesus christ this was going to be difficult.\n“Alright, fuck this. I’m not having this awkward crap all damn night, I can’t fucking deal,” he growled, stomping up to Todoroki and abruptly clasping his hand in his own.\nTodoroki made a sound that Bakugou would have called a startled gasp it had come from anyone else.\n“Where the fuck are we going?” Bakugou asked without preamble. “I’m hungry.”\nTodoroki seemed stunned, but still managed to reply. “I was planning on going to the coffee shop a few blocks over.”\n“Fan-fucking-tastic,” Bakugou responded before pulling Todoroki along down the street in that direction. “You’re paying.”\nTodoroki didn’t even stumble, damn him, keeping up easily, though he did sigh. “I had a feeling you might say something like that.”\n“Yeah, well, you know me,” Bakugou said. “Always thoughtful and shit.”\nTodoroki didn’t reply, but Bakugou saw him smile out of the corner of his eye as he entwined his fingers between Bakugou’s own, following him down the road without further comment.\nAnd if Bakugou wordlessly paid for their food and drinks when they arrived at the coffee shop, Todoroki was wise enough not to say anything about it.\n \n---\n \nThey spent a couple of hours sitting in the coffee shop. This was the part Bakugou had figured would be most difficult, given that he and Todoroki had never really been great at conversation, but he was surprised to find that Todoroki was shockingly easy to talk to.\nBakugou had assumed they had nothing in common. He had assumed completely wrong, apparently.\n“Alright, I’m not gonna argue with you that they’re a good band,” Bakugou was saying, “But I am going to say that they’re definitely not the fucking best, alright.”\n“Have you even listened to them, Bakugou?” Todoroki asked, resting his chin in the palm of his hand as he gazed at Bakugou.\nBakugou opened his mouth before closing it again briefly. “That’s entirely beside the point. Nothing is better than Metallica. Absolutely nothing.”\n“They’re a symphonic metal band. They made their break into the industry by playing Metallica cover songs. I am fairly certain you’d love them.” When Bakugou made to argue, Todoroki waved him off. “You know what? I’ll just lend you my CDs. You can tell me they’re not the best after you’ve actually heard what they can do.”\n“What the fuck ever, man,” Bakugou mumbled, leaning back and crossing his arms over his chest as he attempted to fight off the flush threatening to rise on his cheeks. For some reason, Todoroki letting Bakugou borrow something that was obviously so important to him made him feel— well, it made him feel something. He wasn’t sure what, exactly. But it definitely made him uncomfortable.\nHe glanced out the window, blinking in surprise when he saw a camera pointed directly at them. “Uh,” he said eloquently.\nTodoroki turned to look, eyebrows raising. “Oh. Looks like they’ve noticed.”\nThere was a sudden tension between them that hadn’t been there before. This was the part they were supposed to play up, wasn’t it? And weren’t they meant to seem like they’d been maybe dating for a while now anyway?\n“Give me your hand,” Bakugou said, stretching his arm across the table.\nTodoroki looked quietly stunned but complied without comment, reaching his hand out to Bakugou slowly, as if afraid of startling a wild animal. Bakugou grasped it firmly in his own, entwining their fingers. Without thinking, he moved his feet forward under the table, pressing his legs against Todoroki’s own.\nHe wasn’t sure the cameras could see that. He also wasn’t sure they couldn’t, either, he reasoned.\n“Look at me like you like me or something,” Bakugou mumbled, staring at Todoroki.\nTodoroki’s mouth quirked up in amusement, though the tension in his eyes belied the fact that he was actually somewhat nervous. “That might be easier to do if you weren’t glaring at me like you were hoping I’d catch fire.”\n“Shut the fuck up,” Bakugou said, his scowl deepening.\n“I can catch on fire if you want, you know,” Todoroki offered, eyes dancing.\nHe’s flirting with me, Bakugou realized suddenly. Was that part of this act? Surely the reporters couldn’t hear what they were talking about. Todoroki had no real reason to flirt with him.\nUnless he was trying to rile him up, perhaps. But two could play at that game.\n“Pretty sure I could make you catch fire if I really wanted to,” Bakugou replied, voice low as he rubbed his thumb over the skin of Todoroki’s wrist.\nTodoroki’s eyes widened, his face reddening, mouth opening slightly in shock.\n“Oh?” Todoroki asked, swallowing. “How so?”\nBakugou wasn’t sure what was going on anymore. He also wasn’t willing to back down, either.\nHe raised his eyebrows, pulling Todoroki’s hand slowly towards him and giving Todoroki plenty of time to stop him if he wanted.\nHe didn’t.\nBakugou brough their entwined hands close to his face, tilting his head slightly before turning to press his lips to Todoroki’s pulse. He made sure not to break eye contact, opening his mouth slightly to graze his teeth briefly along the skin of Todoroki’s inner wrist before darting out his tongue to taste him.\nHe heard Todoroki give a sharp intake of breath, his eyes wide and dark as they tracked the movement of Bakugou’s mouth, seemingly unable to look away. His hand squeezed Bakugou’s impulsively, his expression looking slightly lost and more than a little turned on.\n“Like that,” Bakugou murmured quietly, lowering their hands back to the table.\nFuck.\nWhat the fuck. What the fuck did he just do.\nShit. Shit.\nThis almost certainly qualified as taking things too fucking far or making Todoroki uncomfortable.\nAnd yet Todoroki was looking at him with that fucking look again, like he couldn’t believe Bakugou was real. Only this time there was a flush riding high on his cheeks, his mouth hanging open, eyes hungry.\n“That was—“ Todoroki started, breaking off when his voice cracked.\nBakugou swallowed, looking back out the window. “Yeah, well. You asked. I was just proving a point. Doesn’t mean anything.”\nBut that was a lie, and Bakugou knew it, because that had definitely meant something. At least to him.\nTodoroki’s hand went slack in his own at the words, Bakugou’s eyes snapping up to his face to find him looking out the window with an odd expression. “Ah. Right,” was all he said.\nA silence hung in the air between them. Bakugou watched the reporter across the street with detachment, his stomach churning.\nHe felt like he’d fucked up and now he wasn’t sure how to fix it.\n“I wanted to talk to you about something,” Bakugou said, mostly to break the quiet, which now felt suffocating. “The fuck are we supposed to tell the people we know about this?” he asked, gesturing at the two of them.\nTodoroki gave him a cautious look, his eyes still seeming distant. Bakugou hated it. “What would you like to tell them?”\n“I’m asking you, asshole.”\n“And I’m wondering about your own opinion.”\n“I don’t have an opinion, ok? I’ll do whatever you want,” Bakugou hissed, throwing his free hand up in the air. “This is all for you anyway. I don’t give a shit.”\n“Fine,” Todoroki said, sounding mildly annoyed. “We’ll tell everyone we’re dating for real, then.”\n“Fine,” Bakugou agreed, face reddening when he realized what he’d just agreed to.\nThat meant telling Kirishima and Kaminari that he was dating this idiot. And probably Ashido and Sero, too. Not to mention Ochako, who couldn’t keep her nose out of anything he did most of the time.\nFuck.\nWhat really bothered him was not the fact that he’d have to talk about his feelings, though he definitely hated that part too. But the thing that didn’t sit well with him was knowing he’d be lying when he did it.\n“We should probably head back soon,” Todoroki noted, draining the last of his drink. He let Bakugou’s hand go as he stood up. Bakugou felt weirdly bereft, but stood to join him.\nThey didn’t hold hands the rest of the way back. For some weird reason, Bakugou had to stop himself from reaching out to grasp at Todoroki’s hand repeatedly during the walk home.\nWhat the fuck was wrong with him?\n \n---\n \nThe next morning, he woke up to pounding on his dorm door. Which was a bad fucking move for whoever was on the other side, because if there was one thing most people knew, it was that you did not wake Bakugou up suddenly with loud noises.\n“What the FUCK do you want?” he yelled, slamming his open palm against the wall and letting off an explosion with a resounding boom.\nThe pounding stopped briefly. “I told you he was still asleep, he’s gonna be so pissed, man.”\n“Don’t care,” came another voice just before the pounding resumed.\n“For fucks sake,” Bakugou hissed, throwing the blankets off of himself as he stormed across the room to whip the door open with a flourish.\nKaminari’s fist was still raised as if to hit the door again, Kirishima hovering nervously behind him but looking determined.\n“What do you fucks want that couldn’t possibly wait, hah?” Bakugou growled.\nKaminari thrust his cellphone in Bakugou’s face accusingly. “What the hell is this, dude?”\nBakugou snatched the offending object from his hands, peering at the screen.\n\nLove Alive And Well at U.A.?\nHeroes in Training Todoroki Shouto and Bakugou Katsuki spotted on a romantic evening out!\n\nBeneath the headline of the article were several pictures of him and Todoroki sitting at the café together. In one, Bakugou appeared to be almost smiling, and in another Todoroki was gazing at Bakugou was a soft and obviously very fond expression.\nThe final photo was like a punch to the gut, the picture showing him kissing Todoroki’s wrist, their eyes locked. Just the sight of the picture was enough to make Bakugou’s mouth dry, a spike of desire shooting through him.\n“So?” Bakugou finally said, looking up from the pictures to find Kaminari and Kirishima both giving him questioning looks. “What’s the problem?”\n“Are you fucking dating Todoroki?” Kaminari accused.\nBakugou handed his phone back to him—without breaking it even slightly, which was new. “Yeah. I am,” he answered, surprised at how easy it was to say aloud.\n“And you didn’t tell us?” Kirishima pressed, sounding hurt.\nOh.\n“Look, remember the other day when I told you I had something serious I couldn’t talk to you about just yet?” he said, sighing.\nBoth of their eye widened in recognition.\n“Yeah. So, there you go. We’re fucking dating. Or whatever,” Bakugou finished anticlimactically.\n“Dude,” Kaminari sighed. “Thank god.”\n“Yeah, I am so happy this finally happened,” Kirishima gushed. “Congratulations, man. That’s awesome.”\n“Wait, finally?” Bakugou asked, eyebrows drawing down in confusion.\n“Well, obviously,” Kaminari replied, sharing a look with Kirishima. “I mean Todoroki’s been so obvious about being into you for like, at least a good year now, man. It wasn’t exactly a secret. And you’ve always been sort of weirdly fixated on him. We figured it was just a matter of time before you two worked things out.”\nBakugou gaped at them both, unable to speak.\n“Plus now this means we can go on double dates and stuff!” Kirishima cheered excitedly. “It’ll be great, I can’t wait.”\n“Whaaat,” Kaminari groaned. “I don’t want to go anywhere with them. Didn’t you see how mushy they were in those pictures? I’ll puke, man. I can’t handle that.”\nBakugou heard Kirishima laugh, saying something in response, but it all sounded like it was coming from far away. He couldn’t get past the words he’s been so obvious about being into you for like at least a year now. They just kept ringing in his head, over and over, his heart feeling like it was about to jump straight out of his chest.\n“It’s too early for this shit,” he said suddenly. “Don’t bother trying to wake me up again. I won’t answer.”\nHe then slammed the door in their faces, hearing Kirishima whine before Kaminari said something to him in response and they both walked off laughing.\nWhat the fuck was going on?\nTodoroki wasn’t into him. Not like really into him, not for real. He couldn’t be. It didn’t make any fucking sense.\n“Dating people is horrible,” he said aloud to himself. But despite that there was no one there to tell him that he was full of shit, he still knew he wasn’t exactly upset by what was going on.\n \n---\n \nA few hours later, as he laid in bed moping about how much he hated everything and everyone –a typical day, really—his phone suddenly vibrated with an incoming text.\n[Half ‘n Half]: We made the news.\n[Explodo-King]: i fucking heard, dumbass. congrats.\n[Half ‘n Half]: Are you mad?\n[Explodo-King]: no?\n[Half ‘n Half]: Did you see the pictures?\nBakugou had seen the fucking pictures. He’d spent the last few hours gazing at them on and off after saving them all to his phone for reason he couldn’t explain. Todoroki didn’t need to know that, though.\n[Explodo-King]: yah i saw. not bad.\n[Half ‘n Half]: I liked the last one best.\nBakugou swallowed, burying his face into his pillow for a moment before attempting to respond. This felt strangely like flirting again.\n[Explodo-King]: who wouldn’t. it looked hot.\n[Half ‘n Half]: That’s a good way of describing it.\nBakugou’s face flushed. What the fuck did he want from him? Christ.\n[Explodo-King]: i’m new to dating, ok, not sex. ffs give me some credit here.\nThere was no immediate reply to this, and for a while Bakugou began to wonder if he’d perhaps said the wrong thing. But a few minutes later, he finally got a response.\n[Half ‘n Half]: I think we should go on another date. Maybe a few, if you’re willing. I want to keep the publicity going.\nThat… did sound reasonable. One date probably wasn’t enough to put enough pressure on Endeavor to leave Todoroki alone. He supposed he could suffer through a few more.\n[Explodo-King]: fuck. fine, i guess. when and where?\n[Half ‘n Half]: Is Wednesday night too soon?\n[Explodo-King]: it’s fine, idc.\n[Half ‘n Half]: Good. We’re going to dinner and a movie this time.\nBakugou immediately imagined sitting in the dark with Todoroki for several hours. He also immediately began to fidget, the mental image almost too much.\n[Explodo-King]: whatever. just tell me what time and i’ll meet u out front again.\n[Half ‘n Half]: 5:30PM. Don’t be late.\n[Explodo-King]: fuck u, as if i would be.\nBakugou threw his phone across his bed, listening to it land with a thump near his feet. So they had another date. Alright, fine. And so what if this one was a little more intimate that the last? Bakugou could handle it. Bakugou could handle anything, goddammit.\nThe butterflies swarming in his stomach said otherwise, but really? Fuck them.\n \n---\n \nThe next day, as he was walking back from class, his phone starting ringing in his pocket.\nWhy the fuck was everyone determined to bother him all the time now?\nHe sighed, pulling it out and blanching when he saw it was his mother. He had a sense of foreboding as he pressed the button to take the call, bracing himself for the worst.\n“BAKUGOU KATSUKI, YOU LITTLE SHIT,” his mother screamed into the phone. He winced, holding it away from his ear slightly.\n“The fuck do you want, hag?” he yelled back.\n“How dare you, you ungrateful brat.”\n“How dare I what?” Bakugou growled, fearing the worst.\n“You have a goddamn boyfriend and you didn’t even bother to tell your own mother before she read about it in the paper? I can’t believe you. My own neighbors know more about your love life than I do, for gods sake.”\nOh. That… had not actually occurred to Bakugou. “Looks, it’s kind of a recent development, alright? I just didn’t think about it. I’m not, like. Leaving you out or whatever, so just chill the fuck out.”\n“I will chill the fuck out precisely when you tell me everything I want to know about you and this boy,” she answered, clearly on a mission.\nCould he literally never catch a break? Jesus.\n“Fine,” he hissed into the phone, stomping his way across campus. “What do you want to know?”\n“Everything, damn you. You’d better start talking or I’ll come down there myself and wring it out of you.”\nHe knew better than to think that was an empty threat.\nHe spent the next several minutes rambling on to her about Todoroki as a result.\n“He sounds perfect for you,” she told him once he was done.\n“He’s an asshole and he’s confusing and his hair is distracting, mom.”\n“I said he was perfect, didn’t I?” Bakugou could practically hear her grin.\n“Ugh, fucking—whatever,” he mumbled, wiping a hand across his face. “Can I go now? I have to study.”\n“You’d better be studying, dammit. Just because you’re in love now doesn’t mean you can let your grades drop, got it?”\n“Shut the fuck up,” he hissed. He’d never said anything about love, not even once. What the fuck.\nShe had the audacity to laugh, damn her. “Alright. Well good luck on your date, kiddo. I love you.”\n“Yeah, yeah. Love you too. Bye,” he replied, abruptly ending the call.\nSome part of Bakugou felt weirdly grateful that she’d called, even though he’d never tell her so. It was nice to know your parents had your back.\nThe thought made something in Bakugou’s chest hurt, like he’d just been stabbed with a needle, when he thought about how Todoroki must feel.\nFuck Endeavor. He was lucky to have a son like Todoroki in the first place. The fact that he was hung up on something so fucking stupid was nothing short of infuriating.\nBakugou had a brief mental image of Todoroki the day he’d found them in the foyer, flinching back from his father’s tone. Something in him turned from molten rage to cold hard steel.\nHe’d make damn sure Endeavor never made Todoroki feel like that ever again.\n \n---\n \nWednesday arrived too soon in Bakugou’s opinion. By the time they were done with class, Bakugou barely had enough time to run back to his dorm to get ready. He showered as fast as he possibly could, throwing on one of his usual t-shirts but opting for a pair of tight-fitting dark jeans this time around.\nThe combination of the skull on his shirt, the tight pants, and the combat boots he threw over them gave him a distinctly bad-boy look, he noted with no small amount of pride, gazing at himself in the mirror.\nDid it pass the test?\n“Yep. I’d fuck myself,” he said aloud in confirmation that yes, it did indeed pass the test.  He turned to march out the door and down the hall.\nTodoroki was once again waiting for him outside, and like before, Bakugou paused to give him a thorough once-over before Todoroki could notice he was there. He was dressed similarly to Bakugou, jeans hugging his long legs as he cocked a hip, leaning against the wall of the dorm hall. His shirt was dark this time, and he looked all the better for it in Bakugou’s opinion. Not to mention that it was a very tight-fitting shirt.\nBakugou swallowed.\nWhatever. It didn’t really matter what he was wearing, he supposed. He was just worried about how it would look for the cameras. That was all.\n“Yo,” Bakugou greeted flatly as he stepped outside, enjoying the way Todoroki’s eyes raked over him quickly and not missing the way they lingered over his legs. “Are we eating first or watching a movie?”\n“Dinner first,” Todoroki responded, pushing off the building to walk up to Bakugou. He noticed that Todoroki didn’t bother to ask if that was ok with him this time, and somehow Bakugou felt like that was some kind of progress.\n“Good. I’m fucking hungry,” Bakugou answered, falling into step seamlessly beside him and reaching out to clasp their hands together. Todoroki linked their fingers wordlessly, seeming much more at ease this time around, mumbling something under his breath about Bakugou always being hungry, which he kindly chose to ignore. “Where are we eating?” he asked instead.\nHe got an amused look in response. “I was thinking that Chinese food place you like so much. It’s fairly close to the theater anyway.”\nBakugou’s mouth fell open. How did Todoroki know his favorite place to eat?\nBut when he thought about it, he realized he was also aware of the fact that Todoroki’s favorite place to go for food was a particular ramen bar a few blocks away because they served cold soba noodles there.\nHow in the fuck did he know that? Or more importantly, why? Todoroki’s likes and dislikes had never been something that Bakugou had cared enough about to pay attention to.\nExcept that he apparently had, because he suddenly realized he knew a lot of them.\n“Alright. But only if we can go to the ramen shop next time,” Bakugou agreed, just to see Todoroki’s eyes widen in surprise, that fucking look on his face again and dammit Bakugou wasn’t sure if he liked that or not honestly. He couldn’t figure out what it meant.\nThere was a soft squeeze of his hand before Todoroki managed to reply. “I think I can agree to that.”\nOnce they reached the Chinese restaurant, they spent most of their time talking again. It came even easier this time, Bakugou finding himself almost teasing Todoroki rather than antagonizing him on multiple occasions. Todoroki refused to tell him what movie they were seeing once they finished eating, on the grounds that it was “a surprise,” but Bakugou was convinced Todoroki was mostly doing it just to piss him off.\nAs they were leaving the restaurant, Bakugou noticed a camera pointed at them from across the road. He wrapped one arm around Todoroki’s shoulders, pulling him in close. That seemed like the sort of thing two people who were dating might do.\nRight? He thought so, anyway.\nTodoroki turned to give him a surprised look. Bakugou gestured at the reporter slightly with a tilt of his head.\n“Ah. I see we’ve been noticed again,” Todoroki murmured.\nBakugou snorted. “That’s the plan, isn’t it?”\nHe felt a pressure on his waist and looked down, Todoroki’s hand resting gentle but firm on his hip, his arm wrapped around his lower back comfortably as they continued to walk leisurely toward the theater.\nIt was… nice. Bakugou wasn’t used to this kind of casual affection—other than the stuff he sometimes got from Kirishima, who was too touchy-feely for Bakugou’s sanity sometimes. This was different, though. Warm and casual, yet with something deeper attached to it. The feel of their arms wrapped around one another like this was a different kind of intimate than holding hands. Protective, almost. Or maybe possessive was a better word.\nRegardless, Bakugou found he was reluctant to drop his arm from Todoroki’s shoulders once they reached the theater, but he did when Todoroki let his hand fall from his waist as he purchased two tickets for them without even bothering to ask Bakugou. Bakugou wasn’t exactly keen on stopping him, either, to be fair.\n“Do you want to get anything to eat or drink?” Todoroki asked him once they’d made their way past the ticket booth.\nBakugou shot him an incredulous look. “We just fucking ate.”\n“No harm in checking,” Todoroki muttered under his breath, stalking off past Bakugou towards Theater Six, where their movie was apparently playing. Bakugou hadn’t caught the name when Todoroki was buying the tickets, and Todoroki still refused to tell him –“It was on your ticket, didn’t you look before you handed it over?”—but had assured him that it wasn’t a romantic comedy at least.\nBakugou didn’t necessarily hate that sort of movie, exactly. He just wasn’t sure he could handle any more romance than he already was at the moment.\nThey passed through the doors into the dim room, Bakugou taking in the screen and the fact that not many people were in the theater with them. Must be a movie that had been out for a while already, then. Todoroki seemed intent on where he was going, so Bakugou followed him without complaint towards the back of the theater, even though he usually preferred sitting right up front. He was feeling unusually charitable, though, deciding not to bother arguing.\nHe was also feeling a sudden bout of extreme nerves for some fucking reason. That could have been part of his silence, too.\nBakugou had been to the movies plenty of times. In fact it was pretty common for Kaminari and Kirishima to drag their group of friends out to see something at least once a month. The experience was always loud and full of laughter, Ashido throwing popcorn at something Sero had said while Kirishima laughed obnoxiously at some lame comment Kaminari had made, everyone taking turns shouting commentary out at the screen when something particularly noteworthy happened. They’d been nearly kicked out on more than one occasion. On more than several, honestly.\nThis was different, though, Bakugou noted uncomfortably as he sat down beside Todoroki in the back row. Everything was too quiet, and the familiar chatter that always accompanied an outing with his so-called friends was completely absent—and strangely missed.\nBakugou kicked his feet up on the seat in front of him, resting his elbows on the arm rests and stretching out. He wasn’t really sure what to do with himself otherwise.\n“You haven’t seen this yet, have you?” Todoroki asked quietly as they waited for the show to begin.\nBakugou shot him a look. “I don’t know, since some asshole still won’t tell me what the fuck we’re even seeing.”\n“Are you telling me you can’t figure it out for yourself?” Todoroki asked, voice kind, but there was a glint in his eye that told Bakugou he was being mocked.\n“I will fucking punch you. I swear to god,” he warned, upset with himself for knowing he didn’t actually mean it. He must be going soft. What the fuck.\nTodoroki gave him a soft smile, like he knew Bakugou didn’t mean it either. Damn him.\nThe lights suddenly dimmed completely, a hush falling over the room as the movie began to play.\nIf you asked Bakugou what the movie was about, he wouldn’t have been able to tell you, because an hour into the film he wasn’t sure he could remember a single goddamn thing about it.\nHis mind was completely elsewhere, hyper-fixated on the man sitting beside him.\nHe couldn’t stop thinking about how close Todoroki’s hand was resting to his own, or how their shoulders touched in a barely-there brush of fabric if he breathed in too deeply; how dark it was in the room and how they were completely alone and they were both sitting so, so close to one another and yet it might as well be miles away.\nBakugou didn’t know what he wanted, but he had a suspicion it was more than he should be wanting regardless.\nYou don’t have fucking feelings for Todoroki Shouto, he told himself internally as he watched Todoroki’s eyes reflect the light of the movie on the screen, face awash in shadows and swirls of color.\nYou don’t have any right to want more than you already have, he told himself when Todoroki gave a quiet laugh at something in the film, Bakugou’s hand twitching reflexively as he suppressed the urge to take his hand in his own.\nThere aren’t even any cameras around, you can’t get away with passing it off as part of some fucking plan, he berated himself, hating everything but especially hating himself for wanting to lean in and press his lips against Todoroki’s skin.\nBakugou blinked slowly, an idea occurring to him.\n“Hey,” he said, leaning closer to Todoroki. “Just how far are we going to take this, anyway?”\nHe felt Todoroki turn to look at him but kept his own eyes forward, unable to look at him just then, knowing what he was about to do and feeling guilty for it already.\n“What do you mean?” Todoroki whispered back, confused.\n“I mean, how much PDA do you want to do for the cameras?” Bakugou asked nonchalantly, as if this were nothing at all. “Are we gonna kiss in front of them, or what?”\nThe silence that stretched out after this question was long enough that Bakugou began to worry, and made the mistake of actually turning to glance at Todoroki as a result.\nTodoroki was looking at him with wide eyes, his expression unreadable. “I suppose that would probably be wise,” he said slowly. “It would leave no question as to the nature of our relationship, if we did.”\nBakugou nodded, as if that was exactly what he’d been thinking all along. “Alright. Whatever. But have you ever actually kissed anyone before?”\nTodoroki’s eyes widened further. Bakugou couldn’t look away, watching his irises shift and dilate in the dark of the room. “Once or twice,” Todoroki murmured. “But nothing very serious, if that’s what you’re asking.”\n“I’m asking if you’d feel fucking confident kissing in front of a camera, idiot,” Bakugou mumbled.\nIt looked like Todoroki was warring with himself internally over how honest to be. “Then no,” he replied. “Probably not.”\n“I fucking figured,” Bakugou replied, though his voice lacked bite. In fact he sounded slightly nervous. “If you want to practice before giving it a go for all the world to see, now is probably as good a time as any.”\nTodoroki froze. It sounded like he wasn’t breathing.\n“You don’t fucking have to, obviously,” Bakugou mumbled, finally looking away. “Just throwing it out there or whatever so you don’t fucking embarrass yourself later and then blame me for it.”\nA few minutes passed in silence, wherein Bakugou stared blankly at the moving images before him while his heart raced like it was trying to win an Olympic fucking medal, his stomach clenched tight with nerves.\nHe couldn’t fucking believe he’d just suggested that. God, of all the stupid, lame-ass things he could have possibly said—\n“You really wouldn’t mind?” Todoroki asked, voice quiet, but Bakugou would have been able to pick out the words in a crowd of thousands.\nHe turned his head cautiously, finding Todoroki leaning towards him and sitting even closer than they already had been. “Guess not,” he mumbled, when inside he felt like he was screaming.\n“Then I’d like to. Um,” Todoroki started, seeming unsure of how to go about this. “Practice, I mean.”\nRight. Ok. Bakugou was definitely not panicking right now. He was also definitely not feeling like he’d just won a prize greater than every medal or trophy he’d received in his life.\nHe clearly had more experience with this than Todoroki, so he figured it only made sense to try and take control of the situation. Probably.\nIt didn’t really matter because Bakugou would have done so regardless, but still.\nHe nodded at Todoroki in response, gesturing for him to scoot back far enough that he could lift up the arm of the seat that was between them. Once he did so it felt like something shifted in the air, like a safety net he hadn’t even known existed had been pulled away, because now there was nothing separating them at all.\nTodoroki Shouto wants you to kiss him, his brain supplied completely uselessly, as if he’d fucking forgotten.\nHe still somehow couldn’t believe it, though.\n“Come here,” Bakugou murmured, turning to face him and scooting slightly closer. Todoroki did as he asked, shifting nearer hesitantly, seeming unsure of himself—which was so fucking unusual that Bakugou almost couldn’t believe what he was seeing.\nHe rested a hand on Todoroki’s shoulder gently, watching the way Todoroki’s eyes widened infinitesimally at the contact. He took one of Todoroki’s free hands with his own, bringing it up and resting it along the juncture of his collar bone.\nThey both stared at each other, getting used to the feeling of their hands on one another.\n“This ok?” Bakugou asked, because he wasn’t about to force himself on anyone no matter how much he wanted this.\nAnd he did want this. Desperately, he realized.\nTodoroki nodded, still looking disbelieving.\n“I’m gonna kiss you now then, alright?” Bakugou clarified, watching a flush work its way up to settle high on Todoroki’s face. “If you don’t like it or if you want me to stop, tell me. “\nHe could see emotions lurking in Todoroki’s eyes but the only one he was able to discern for certain was resolve. “Alright,” Todoroki whispered, tongue darting out to wet his lips.\nBakugou tracked the movement with his eyes, captivated, unconsciously mirroring the action.\nAnd then he leaned forward, letting his eyes drop closed as he touched his mouth to Todoroki’s own.\nThe kiss was soft, gentle and searching, full of nerves as they both tried to feel each other out. Todoroki pressed back against him, mouth moving ever so slightly but enough to be encouraging, so Bakugou pulled back just slightly before pressing in to do it again, his hand sliding up from Todoroki’s shoulder and working its way around his neck to pull him in closer.\nTodoroki made a quiet noise at the touch, his mouth opening slightly as he did so. Bakugou didn’t waste the opportunity, using his newfound grip to tilt Todoroki’s head just so before pressing back in against him, open mouthed.\nSomething changed immediately. Bakugou could feel it, the hairs rising on the back of his neck and arms with a sort of electricity that went straight to his head. Todoroki’s own hand shifted to grasp more firmly at Bakugou, wandering high enough to run through the base of his hair as he gripped along the back of his neck firmly, moving them even closer together.\nBakugou gasped, not knowing how Todoroki had managed to find one of his weaknesses but also not caring because it felt fucking amazing. He curled his free hand around Todoroki’s hip in response, squeezing as he slid his lips along his with an impending loss of control.\nWithout thinking, Bakugou slipped his tongue along Todoroki’s open mouth, letting it glide wetly along his bottom lip before sucking it between his own and biting down gently.\nTodoroki moaned, the sound sending a spark of desire to his groin like a shock of lightning. The sound seemed to startling them both enough that they broke apart, gazing at one another wide-eyed, breathing labored.\n“Good?” Bakugou asked.\n“Good,” Todoroki agreed, voice rough.\n“More?” Bakugou tried, testing his luck.\n“Please,” Todoroki replied, hand fisting fully in Bakugou’s hair.\nAnd then they weren’t just kissing, they were making out, and Bakugou frankly wondered why they hadn’t done this years ago.\nHe pressed Todoroki backwards, lifting the arm of the seat behind him barely in time as he pushed Todoroki down across the seats. He figured Todoroki would be embarrassed, or at least shy about the move. He was shocked in the best possible way when instead Todoroki fisted his hands in the front of Bakugou’s shirt, hauling him down bodily on top of him.\nTheir mouths found each other again immediately, hands seeming to be everywhere all at once. Bakugou would never have guessed Todoroki to be inexperienced with kissing at all, because he was downright great at it. Bakugou honestly wasn’t sure he’d ever made out with anyone and had it feel this fucking good.\nHe licked against Todoroki’s open mouth, swallowing his gasp greedily, repeating the action. When Todoroki’s own tongue suddenly slid tentatively against his own, Bakugou sucked in a sharp breath, groaning at the feeling of the wet glide and the heat of Todoroki’s mouth.\n“Fuck,” Bakugou hissed, breaking away just long enough to latch onto Todoroki’s neck. “You’re too good at this.”\nTodoroki moaned in response, head dropping to the side to give Bakugou better access.\nBakugou licked his way up the straining muscle, kissing and biting affection into every inch of skin he could reach. “You taste amazing,” he murmured without thinking, meaning it, because Todoroki tasted like something Bakugou wasn’t sure he’d ever get enough of.\nBeneath him, Todoroki’s arched, pressing up and into Bakugou, his arms wrapped firmly around his torso, hands fisted in the back of Bakugou’s shirt. He seemed half out of his mind.\nBakugou could relate.\nHe bit down hard against the skin Todoroki’s neck, sucking a mark into his flesh and almost shaking at the broken sound Todoroki made in response.\nTwo hands were suddenly tangled in his hair, pulling his head back sharply. Bakugou broke away with a cry, face flushed, eyes wild.\n“Get back here,” Todoroki growled, the sound going straight to Bakugou’s groin before he surged up, mouth sealing over Bakugou’s possessively once more.\nThey spent the rest of the entire movie making out, just barely managing to keep things from going any further than they already had. Bakugou wanted to, fuck, he desperately wanted to, but he wasn’t sure if he’d be able to forgive himself for doing so later.\nThis was already taking way too much advantage of Todoroki as it was. Bakugou knew he was going to feel horrible about it later, but right then, he couldn’t find it in him to care about anything beyond the feel of Todoroki against him.\nWhen the credits started rolling and the lights came back on, they finally managed to pull apart. Bakugou was frankly shocked that so much time had passed so quickly. He was also possibly slightly disappointed that his opportunity was now over.\nWhen he looked down at Todoroki to find his face flushed, hair wild, lips swollen and red, he wondered if maybe he’d gone too far. He also knew he’d do it all over again if given half the chance.\nHe didn’t know if that made him feel better about it, or worse.\n“We should go,” he said, moving away from him and standing awkwardly, unable to look Todoroki in the eye anymore.\nHe heard Todoroki shuffle around before standing up beside him as well.\nThey both adjusted their clothes and hair into a more normal position, faces red and dazed as they walked out of the theater.\nBy the time they made it out onto the street, they still hadn’t said anything to one another. Bakugou wasn’t sure if he was physically capable of doing so without saying something completely stupid like “hey can we maybe try that again forever?” so he kept his mouth firmly shut.\nWhen they’d turned the corner down the road, Bakugou noticed a reporter lurking around. Probably waiting for them, he realized, reaching out to take Todoroki’s hand in his own without further thought.\nHe did have a job to do, after all.\nTodoroki jolted, as if shocked by the touch. His eyes pinned Bakugou with a curious stare, Bakugou tilting his head towards the reporter wordlessly in reply.\n“Right,” he heard Todoroki murmur, more to himself than anyone else.\nBefore he could think too much about it, Bakugou turned to face him, hand cradling the curve of his face as he pulled him down for a chaste kiss right there in front of everyone.\nTodoroki made a sound of surprise before pressing into the kiss. Bakugou felt his pulse pounding in his ears, but he was reluctant to let Todoroki go. He didn’t know if he’d ever get a chance to do this again.\nAfter a while though he finally did pull back, clearing his throat awkwardly. “If that’s not front page tomorrow I’ll eat my own fucking shoe.”\nTodoroki blinked, looking stunned.\nThe guilt over what had just happened between them seemed to hit Bakugou all at once, and he turned away, frowning. “Look, I’m sorry if I made you uncomfortable in the theater,” he forced himself to say, not used to apologizing for—well, anything, really. “I probably took that too far. I won’t do it again.”\nSomething in his chest hurt, sharp and painful as he spoke.\nHe heard a disbelieving sound come from Todoroki but was too afraid to look at him to find out what it meant. “You—you think you took it too far?”\nBakugou raised his eyes then, glancing at him sternly. “Don’t make me say it again, asshole.”\n“I’m not, I’m just—“ Todoroki broke off, clearly trying to gather his thoughts. “I didn’t think you did.”\nOh.\nWell, in that case.\nUh.\nBakugou had no fucking idea how to respond to that, actually.\n“The fuck does that mean?” he managed to ask, feeling half afraid of the answer.\nTodoroki’s hand squeezed his in response, as if grounding himself with the contact. “I mean I didn’t dislike it. So there’s no need to apologize.”\nWhat the fuck? He didn’t dislike it?\n“What, are you saying I can do it again, then?” Bakugou blurted, regretting the words the moment they left his mouth.\nTodoroki’s head snapped to look at him. “I… wouldn’t say no to more practice,” he responded, voice careful.\nAh. Right.\nPractice.\nBecause they weren’t actually dating.\nSome part of Bakugou had actually forgotten.\n“Well if you ever feel like you need more fucking practice, you know where to find me,” Bakugou said, trying and failing to not sound disappointed.\nHe could see Todoroki frowning at him out of the corner of his eye, like he was fucking confused. Well, good then. Bakugou didn’t give a shit.\nNeither of them said anything further for the rest of the walk home.\n \n---\n \nBakugou barely slept that night. He couldn’t get Todoroki out of his fucking head. The feel of him writhing beneath him, the sound of his breath heavy in Bakugou’s ear, the taste of him warm and wet against his tongue.\nIt was three o’clock in the fucking morning, and Bakugou Katsuki was having a crisis. He was feeling feelings. The kind he wasn’t supposed to fucking feel.\nHe knew he couldn’t deny what he felt for Todoroki anymore. He just also knew he couldn’t do anything about it at this point because he’d agreed to be part of the smartest and yet stupidest plan of all time.\nBakugou sighed, hating himself.\nHe spent his night silently replaying their date over and over in his mind because there was nothing he could do to fucking stop it.\n \n---\n \nThe next morning, Bakugou was walking to class when Ochako ran up beside him, sporting a grin that Bakugou knew from experience meant trouble.\n“The fuck do you want now,” he sighed as she fell into step with him.\n“Oh, not much. Just wanted to congratulate you on the new romance,” she hummed, eyes gleaming with something Bakugou knew was going to give him a headache. “And on the date last night, too. Looks like it must have gone reeeeeally well.”\nBakugou’s brows drew together in a frown. “What the fuck is that supposed to mean, angelface.”\n“Well, I saw Todoroki on my way back from breakfast this morning,” she replied, teeth gleaming in a way that wasn’t necessarily nice. “I noticed he had a very interesting mark on the side of his neck. I don’t suppose you’d know anything about that, would you?”\nBakugou was very familiar with explosions. And right now he was pretty certain he was about to explode with embarrassment.\n“Shut the fuck up,” he hissed, taking a swing at her. “Mind your own goddamn business!”\nShe dodged easily, laughing at him as she took off down the hall in the direction of class. “Might want to be more careful about where you leave those next time, then!”\nFuck. Fuck. He was going to get shit from everyone about this all fucking day, he just knew it.\nHe let out a frustrated yell, stomping off towards class with resignation.\n \n---\n \nLater that night, he got a text.\n[Half ‘n Half]: You marked me.\nJesus fucking christ. As if he hadn’t been hearing about this exact thing for literal hours.\n[Explodo-King]: it wasn’t on purpose. ffs no one will shut up about it.\n[Half ‘n Half]: I’m not mad.\nBakugou was suspicious of that. It seemed like the sort of thing he would have been mad about if it’d been done to him. He watched, his phone showing Todoroki was typing again.\n[Half ‘n Half]: I was just wondering how you did it.\nBakugou almost dropped his fucking phone.\nWhat the fuck was he supposed to say to that? Was this flirting? It felt suspiciously like flirting, but maybe he was just projecting.\n[Explodo-King]: the fuck kind of question is that? idk how to explain it i just kno how to do it.\n[Half ‘n Half]: Then can you show me?\n[Explodo-King]: are u asking for more practice?\n[Half ‘n Half]: I’d like to learn, so yes.\nWell. Bakugou was a lot of things, but despite knowing how much this would probably hurt him in the long-run, he wasn’t stupid enough to turn an offer like that down.\n[Explodo-King]: fine. when and where?\n[Half ‘n Half]: Is tonight too soon?\n[Explodo-King]: what like rn?\n[Half ‘n Half]: If you’re not too busy.\nBakugou’s heart felt like it was about to jump out of his fucking chest, adrenaline suddenly spiking through him.\n[Explodo-King]: fine. come 2 my room then.\nHe received no reply, and somehow he knew that meant Todoroki was probably on his way already.\nFuck. He couldn’t believe he’d just agreed to that. What the fuck was he supposed to do?\nSomehow this was a completely different situation than making out in a fucking dark movie theater.\nThere’s no real reason to stop things from going further when you’re in the dorms, a voice in his mind pipped up, and he had a moment of internal panic when he realized that was actually true.\nShit.\nSelf-control suddenly sounded a helluva lot more difficult when you had the object of your affections willingly in your room. Alone. With a nice, comfy bed available.\nFuck.\nThere was a tentative knock on his door. Bakugou jumped, cursing at himself for being so fucking stupid about this.\nHe was just going to show Todoroki how to leave a hickey on someone. Probably. Which would likely involve either leaving another on Todoroki, or Todoroki leaving one on him.\n“Fuck fuck fuck,” he muttered, scrubbing a hand over his face in an effort to reign himself in before he pulled the door open.\nTodoroki stood on the otherside, a neutral expression in his face, the eerie quiet of the hallway seeming to follow him into the room.\n“Well? Are you fucking coming in or what?” Bakugou asked, gesturing sharply at him to come inside.\nOnce the door shut behind them both, Bakugou forced himself to take a deep breath, trying to keep rational about this.\nHe had no idea what the fuck he was doing. Or what Todoroki was doing, for that matter.\n“Alright, explain to me what the hell it is you’re wanting right now. Because I honestly don’t fucking know anymore,” Bakugou finally said, breaking the quiet and opting for complete and utter sincerity for once.\nTodoroki’s face colored slightly, but he tilted his head to the side, pointing at his neck where a vibrant redish purple mark sat prominently right over his pulse.\nBakugou’s heart skipped a beat, something possessive roaring inside him with victory at the sight.\n“I want to know how you did this,” Todoroki said, voice too calm for Bakugou’s liking. “And I want to know how to do it to someone else.”\nBakugou swallowed, feeling his palms break out in a sweat. “Are you asking for a demonstration?”\n“Are you willing to give me one?” Todoroki asked, the first hint of nerves showing in the way his voice sounded slightly strained.\nBakugou took a step forward, feeling a little more confident at the show of weakness.\n“Are you fucking asking me to mark you?” he wondered aloud, his voice low. Dark. Bakugou saw the way the sound if it made Todoroki’s eyes widen. He took another step forward.\nHe brought a hand up, reaching out to lightly trace the bruise on Todoroki’s neck with the pad of his index finger and reveling in the way Todoroki shivered in response.\nOne of Todoroki’s hands came up abruptly to grasp Bakugou firmly by the wrist, stopping the motion against his skin instantly.\nBakugou froze. He opened his mouth to say something, hell, maybe even to apologize, suddenly worried he’d crossed a line, but Todoroki spoke before he could get a word out.\n“I am,” he said, voice firm. “I don’t have a lot of experience with this sort of thing,” he admitted. “But you said you do, right?”\nBakugou couldn’t believe what he was hearing. “Right,” he agreed.\n“I know this isn’t explicitly part of our deal,” Todoroki went on, “But I’d like to learn whatever you’re willing to teach me.”\nWhatever you’re willing to teach, Bakugou’s mind repeated, over and over, until the words stopped making sense.\n“What the fuck are you actually asking for?” he asked, voice cracking. He was too stunned to even care.\nTodoroki, for his part, looked slightly terrified. “For whatever you’re willing to give me.”\nThis couldn’t be real. There was no way.\n“If you don’t like something, you tell me to stop,” Bakugou said, voice rough with repressed emotion as he leaned in slowly.\nTodoroki’s eyes fluttered closed, Bakugou’s doing the same a moment later. “I’m not going to tell you to stop, Bakugou,” Todoroki whispered, their lips brushing with the words.\nSomething in Bakugou came undone.\nThey pressed against one another, Bakugou wrapping his arms around Todoroki fully, pulling him flush against his chest, Todoroki repeating the action in kind. They kissed, mouths open and hot, god, so fucking hot, the two of them sharing the same air between them with greedy sighs and quiet gasps of breath.\nBakugou steadily walked Todoroki backwards until the backs of his legs hit the edge of his bed, Todoroki pulling away from him with a surprised jolt.\n“Lay down,” Bakugou told him, his breath sounding labored.\nTodoroki sat on the edge of the bed, allowing Bakugou to push him down as he climbed on top of him much like he had the day before.\nI could do this forever and fucking like every minute of it, Bakugou realized distractedly, knowing it was true.\nHe was too busy taking in the sight of Todoroki stretched out on his own fucking bed to think about it for very long, though.\nThey left off right where they’d been the day before, making out for who knew how long, the wet glide of tongues and the sharp feel of teeth making Bakugou lose track of time. At some point, Bakugou finally couldn’t stand it any longer.\n“Take this off,” he mumbled against the underside of Todoroki’s jaw, tugging at his shirt with a frustrated noise.\nHe felt more than heard Todoroki’s sharp intake of breath. “Fine. But only if you take yours off, too.”\n“Fine,” Bakugou said, pulling back to whip his over his head in short order, because that did seem like a fair request he guessed.\nHe looked down at Todoroki impatiently, but Todoroki seemed frozen, his gaze locked on Bakugou’s torso like he was physically incapable of looking away.\nBakugou felt himself flushing from the undivided attention. “What? You’ve seen me shirtless before. It’s not a big fucking deal.”\nWhich was true. They’d shared changing rooms for years. This wasn’t anything new.\n“Not like this I haven’t,” Todoroki answered, raising one hand to run it reverently along the planes of Bakugou’s abs, which tensed at the touch. Todoroki licked his lips distractedly, eyes roving lower, and Bakugou felt his blood rush immediately south.\nWho was supposed to be the experienced one here again? Fuck.\n“Whatever,” Bakugou mumbled, finally managing to wrestle Todoroki’s shirt awkwardly over his head.\nAnd then Bakugou was having a crisis of his own, staring down at the sight before him.\nThe pale skin on display was almost too good to be true, smooth and lean and muscular in a way that drove Bakugou absolutely mad. Bakugou could see a few scars scattered here and there and had a strange desire to kiss each and every one.\n“I call bullshit,” Bakugou blurted, running his fingers over Todoroki’s chest.\nTodoroki blinked, finally looking away from Bakugou’s exposed skin to give him a confused look. “What?”\n“This is unfair,” Bakugou said, his mouth running without a filter. “No one warned me.”\n“Warned you?” Todoroki asked, his head tilting slightly.\nBakugou let one finger trace across Todoroki’s right nipple, Todoroki giving a startled groan, his back arching into the touch as his eyes fluttered closed.\n“That you were this fucking beautiful,” Bakugou finished, Todoroki’s eyes flying open just before Bakugou leaned forward and kissed him for all he was worth.\nTodoroki wrapped his arms around Bakugou’s waist, pulling him down to lie against him fully, the feeling of skin on skin almost too much for Bakugou to handle. He moaned at the contact, loving the heat, the feeling of controlled power lurking in every subtle shift and move of Todoroki’s body turning him on more thoroughly than just about anything else ever could.\nBakugou knew he would never forget this. Something instinctive in him told him this was an experience he’d best treasure while he had it, because it was the sort that didn’t come along often.\nHe was suddenly fucking hell-bent on making damn sure Todoroki never forgot this night either.\nHe pulled back, moving down Todoroki’s torso and slowly working his lips against every bit of Todoroki he could reach until he had him gasping and writhing beneath him.\nBakugou moved lower still, licking his way slowly down Todoroki’s navel and not stopping until he reached the waistline of his jeans. He tugged them down just enough to expose the sharp jut of his hips, raising his eyes to lock with Todoroki’s own.\n“You wanted to know how to leave a mark?” Bakugou asked.\nTodoroki made a choked noise before nodding, eyes wide.\n“Then fucking watch and learn something,” Bakugou breathed, flashing his teeth before leaning down to bite at the juncture of Todoroki’s hip sharply.\nHe cried out, and Bakugou could see one of his hands fisting in the sheets out of the corner of his eye. Bakugou opened his mouth, licking languidly at the bite mark before sealing his lips over it and giving a harsh suck.\n“Oh my god,” Todoroki gasped. Bakugou raised his eyes again to find Todoroki’s gaze locked on him, his eyes wild, his face flushed and wanting.\nBakugou raised his eyebrows, moving lower, letting his tongue slide suggestively along the hem of Todoroki’s pants before slipping it ever so slightly beneath them.\nTodoroki’s hand suddenly fisted in his hair, though he didn’t push or pull at Bakugou either way.\nBakugou knew Todoroki was hard. He could feel the heat of it, could smell it even through the layers of clothing.\nHe wondered what it would taste like, too.\n“Anyone ever sucked you off before?” Bakugou asked, like it was a perfectly normal topic of conversation.\nThe hand in Bakugou’s hair squeezed reflexively, Todoroki’s face reddening even further. “No,” he answered, sounding strained.\n“Want to change that?” Bakugou offered, trailing a hand along Todoroki’s inner thigh and rubbing distracted little circles into his skin.\nTodoroki shivered, his eyes falling closed as he bit his bottom lip. “Yes,” he said in a rush.\n“Then take your fucking pants off,” Bakugou murmured, licking his lips. “I don’t have all night.”\nExcept that he kind of did, and they both knew it.\nTodoroki looked like he was about to combust, his eyes almost wide enough that Bakugou wondered if they might fall right out of his head. Bakugou briefly wondered if Todoroki would complain about the fact that Bakugou wasn’t removing any more of his own clothing, but was surprised when he made no further comment, hands simply dropping to his waist to undo the button of his jeans.\nBakugou’s eyes honed in on the movement, watching as Todoroki slid down the zipper before lifting up his hips and sliding them down over the swell of his ass.\nThere was a very obvious tent in his boxers. Bakugou thought it was probably weird that the sight made his mouth water, but he couldn’t be bothered to give a shit.\nHe settled himself in between Todoroki’s legs, getting comfortable before pressing his open mouth against the skin of his navel again. He let his tongue trace lower, dipping under the hem of Todoroki’s boxers once more, able to go much farther now that the jeans were out of the way.\nTodoroki’s hand was suddenly back in his hair, sifting through the strands almost in silent wonder. Bakugou hooked his fingers around the top of the fabric of his boxers, glancing up at him briefly before pulling down to expose Todoroki’s flushed cock.\nHis mouth actually watered. He wasn’t sure he’d ever been this turned on his in life.\nHe leaned down, opening his mouth to let his breath gust warmly over the head, Todoroki’s cock twitching in response.\nBakugou leaned forward to lick at the skin of his navel again, inhaling the musky scent of arousal—one of those things that Bakugou always found to be ridiculously attractive for some reason. His moved further, tongue tracing through a bead of precum that had found its way from Todoroki’s cock to his abdomen, letting the bitter taste sink into him and licking his lips in response.\nTodoroki’s breathing was labored, the hand in Bakugou’s hair clenching and unclenching with impatience.\nBakugou smirked.\nHe still didn’t put his mouth where Todoroki clearly wanted it most, grinning as he moved lower, biting and sucking marks into the skin of Todoroki’s thighs just to feel them quivering around him.\n“B-Bakugou,” Todoroki bit out, sounding winded. “Stop teasing me.”\nBakugou looked up at him, raising an eyebrow as he breathed hotly against Todoroki again. “Who said I was fucking teasing?”\n“Bakugou,” he hissed, pulling at his hair lightly.\n“What’s the magic word?”\nTodoroki clamped his mouth shut, clearly fighting with himself internally to keep from begging.\nThat was fine. Bakugou liked a challenge.\nHe wrapped his fingers loosely around the base of Todoroki’s cock, moving it closer to his mouth— only to stop just before he could touch it with his lips, licking exaggeratedly at the air just a hairs-breadth away from Todoroki’s skin.\n“F-fuck,” Todoroki cursed, throwing his head back with a frustrated noise. “Fine. Please.”\n“What was that?” Bakugou asked again, letting his lips just barely brush the head as he spoke.\n“Please, dammit,” Todoroki bit out, sounding half broken.\nBakugou wrapped his mouth around him abruptly, swallowing him down as far as he could go.\nTodoroki cried out, clearly not expecting that, falling back slightly against the bed. His hand pulled almost painfully tight in Bakugou’s hair now, the feeling of it going straight to Bakugou’s own cock. He swirled his tongue, licking the entire shaft before taking him in again, able to go even further this time, Todoroki gasping beneath him.\n“Oh my god,” he chanted, voice strained. “Oh my god, Bakugou. I—slow down, please, or I’ll—“\nBakugou pulled off, giving Todoroki a moment to catch his breath. He looked at him, amusement gleaming in his eyes. “That’s kind of the idea, idiot.”\n“I know that, but I’m—“ Todoroki broke of, sounding as though words were difficult.\n“Having fun?”\n“Yes.”\n“Don’t want it to end too soon?”\n“Exactly,” he breathed, sounding relieved.\nBakugou hummed as though considering this. “Too bad. I’m not that nice.”\nBefore Todoroki had a chance to respond, Bakugou’s mouth was back around him, pressing down as far as he could go, taking whatever he couldn’t swallow in his hand and pumping in time with the movement of his mouth. He flattened his tongue, letting it glide smoothly over the underside of Todoroki’s cock, pressing down harder each time he reached the tip. His pace was unrelenting, fast and hard, and he could feel Todoroki falling apart rapidly as a result.\n“Ah, Bakugou,” Todoroki cried out, hands letting go of Bakugou’s hair to fist in the sheets of the bed, his harsh breathing echoing in the small room. “Oh, god.”\nBakugou hummed encouragingly, lips still around Todoroki’s cock, Todoroki’s legs shaking beneath him in response. “Bakugou, please, I’m—I’m going to—“\nBakugou knew damn good and well he was about to come, and he wanted it more than he’d ever wanted just about anything in his life.\nHe gave a particularly hard suck, twisting his hand and swirling his tongue just right, eyes looking up to lock with Todoroki’s as he watched him move over his cock.\nTodoroki threw his head back with a silent shout, his entire body seizing up as he came down Bakugou’s throat, Bakugou gladly swallowing everything given to him.\nHe wiped his mouth when he was done, moving further back up the bed to lie beside Todoroki with a grin. There were few things more fun than knowing he’d successfully given someone one of the best orgams of their life. And Bakugou was certain it was one of the best. He was the best at everything, after all.\nTodoroki’s eyes were closed as he gasped for air, chest rising and falling as he tried to catch is breath. His face looked more relaxed and at peace than Bakugou had ever seen it, the sight of it twisting something in Bakugou’s chest.\nWithout thinking, he reached one hand out, tracing it along the curve of Todoroki’s cheek gently, his eyes blinking open as he turned his head to look at him with an awed expression.\n“That was—“ Todoroki started, seeming unable to continue.\nBakugou’s grin widened. “Great?”\n“That is a severe understatement,” Todoroki told him.\nBakugou snorted. “Obviously.”\nHe received a surprised laugh in response, Todoroki’s hand reaching up to tangle with his. Bakugou’s heart gave another tug, thinking it was too sweet somehow, but he didn’t try and stop him.\n“I want to make you come,” Todoroki said suddenly, Bakugou’s grin dropping from his face instantly, an embarrassed flush rising it it’s place.\nHe scowled, uncomfortable to suddenly be the center of attention. “You don’t need to.”\n“I’m sure I don’t,” Todoroki agreed. “But I want to.”\nI want to. Bakugou couldn’t get past the words.\n“Well I’m not stupid enough to stop you if you’re offering,” he told him instead, but his voice came out far too soft.\nTodoroki tucked himself back into his boxers before rolling over, pressing Bakugou back against the bed and laying half on top of him. He bent down, kissing him gently, the passion and the rush they were in earlier seemingly forgotten in favor of slow and curious now that Todoroki was sated.\nBakugou felt himself flushing at the attention, conflicted. He didn’t know how to respond to this. Bakugou hadn’t exactly had a lot partners, true, but the ones he did have had never taken their time with him like this.\nTodoroki took Bakugou apart methodically, like he was a puzzle Todoroki was trying to figure out, seeming intent on finding all the places that made Bakugou’s breathing sharpen and his voice turn breathy. His hands wandered along his skin, slowly working their way to his shorts before sliding them carefully down.\n“Is it alright if I use my hands?” Todoroki asked, seeming unsure. “I don’t know if I’m ready to try what you just did.”\n“That’s—more than fine,” Bakugou replied, breath coming to him in gasps already. He hadn’t expected to get anything in return at all, honestly.\nHe also liked the idea of Todoroki using his hands in general, because it meant Bakugou could keep kissing him, which he found himself strangely reluctant to stop.\nTodoroki paused, raising his palm to his mouth and slicking it generously with his tongue. Bakugou felt his eyes darken, tracking the motion hungrily.\n“Fuck,” he murmured, Todoroki smirking at him briefly before lowering his hand again to wrap around Bakugou’s straining cock and giving a slow, firm stroke.\nBakugou’s head fell back against the pillow, his eyes falling closed. “God, yeah. Just like that.”\nTodoroki’s head fell to the crook of Bakugou’s neck as he continued to pump him, keeping up the same slow, hard rhythm, Bakugou’s arms wrapped around his waist and skating along the skin of his back distractedly. He felt something warm and wet lick at the skin of his shoulder, Todoroki slowly working his way up Bakugou’s neck with his mouth before biting down suddenly at the juncture of his collar bone.\nBakugou arched up beneath him, crying out, eyes flying wide. Fuck, it felt so good, Todoroki’s mouth sucking at his skin as if trying to devour him.\n“Fuck, yes,” he gasped, his hips thrusting forward unconsciously, Todoroki speeding up his pace slightly in response, his tongue still working along his throat. “God, you’re so good, shit.”\n“You’re surprisingly vocal during sex,” Todoroki murmured into his ear, biting gently at the soft skin of his ear lobe and giving a light tug. “I like it,” he continued, voice husky, his hand tightening around Bakugou’s shaft at the words.\n“Oh god, don’t stop, please, ah, fuck, fuck,” Bakugou babbled, eyes squeezing shut, feeling his desire peaking, everything coiling into one white-hot point within him.\nTodoroki pulled back to seal his mouth over Bakugou’s, his tongue sliding sinfully against his own.\n“You’re amazing,” Todoroki breathed against his mouth, voice full of wonder.\nAnd just like that, Bakugou was gone.\nHe threw his head back, crying out loudly as he came, Todoroki’s name falling from his lips.\nHis brain was swimming, his whole body seizing up before suddenly feeling completely lax, everything warm and comfortable. He opened his eyes in a daze to find Todoroki gazing down at him, his eyes wide. He had that same fucking look on his face again, like Bakugou had just shown him something he could hardly believe was real.\nBakugou was in no shape to deal with that shit right now, so he simply wrapped his arms tighter around Todoroki, pulling him down against him and not giving a shit about the fact that he had come all over his stomach. Todoroki didn’t seem to mind too much either, to be fair, if the way he curled up around Bakugou was anything to go by.\nThey lay there in silence, Bakugou’s heart slowly calming. The way it felt to be curled up in bed like this with Todoroki felt far, far too easy. It was wonderful. Bakugou hadn’t ever felt anything in his life he felt comfortable calling wonderful before. It was like being given a gift he hadn’t ever expected to receive, and now wondered how he’d ever lived without.\nExcept it wasn’t his gift to receive, because none of this was real.\nThe realization washed over him like a bucket of ice cold water, Bakugou’s heart freezing.\n All at once, he was suddenly fucking angry.\nHe’d never wanted a relationship with anyone for fucks sake, and yet here he was, mooning over the guy who was just using him as a way to get back at his father.\nHe hated himself. He couldn’t believe what he’d just done, knowing full well what he couldn’t fucking have.\nSomething hot and bitter coiled low in his stomach.\n“Well, I hope you learned something,” he said evenly, glaring at the ceiling.\nTodoroki made a contented sort of hum. “I think I learned several things,” he answered, sounding happy.\nThat only made Bakugou angrier.\n“Great. Happy to be of fucking service,” he replied, disentangling himself from Todoroki abruptly. “You can go now.”\nTodoroki sat up, looking like he’d been slapped. “What?”\n“I said you can go. Get out of my room. You got what you wanted.”\nBakugou made the mistake of looking him in the eye briefly before snapping his head away to glare at the door, gesturing to it angrily.\nA heavy tension settled between them. After a moment, Todoroki climbed off the bed, collecting his discarded clothing before throwing it all on in silence.\nHe left the room without another word, slamming the door behind him.\nBakugou tried everything he could, but couldn’t get the look of hurt Todoroki had worn on his face out of his head.\nBakugou didn’t sleep that night, either.\n \n---\n \nThe next morning, he woke up to a picture of the two of them gracing the front page of just about every news source he came across.\nIt was a photo of them kissing on a street corner, their hands clasped, Bakugou’s free hand loving resting against the side of Todoroki’s face as their mouths pressed sweetly to each other. Todoroki had such a fond expression on his face, a smile resting on the corners of his mouth.\nBakugou wanted to cry.\nHe didn’t go to class. He didn’t think he could bare it if he did.\nBitterness simmered under every last inch of his skin. He could still feel Todoroki’s lips against his own if he closed his eyes.\nWhen he looked in the mirror, he laughed humorlessly, realizing his neck was covered in bite marks. The sight of it made him feel sick with longing.\nAround lunch time, he finally received a text.\n[Half ‘n Half]: We made the front page. I guess we don’t need to go on any more dates after all.\nBakugou didn’t reply, and after an hour, he finally received another.\n[Half ‘n Half]: Thank you.\nBakugou threw his phone across the room, hearing it crash loudly against his dresser and hoping it shattered.\nHe buried his face in his pillow, pretending the water soaking into the fabric beneath him didn’t exist.\n \n---\n \n“Yooo, Bakugou,” a voice called from the other side of the door.\nBakugou blinked his eyes for what felt like the first time in hours, his gaze drifting from the ceiling to look toward the source of the noise.\n“You ok man? You weren’t in class and we didn’t see you at lunch,” another voice called.\n“Maybe he’s not here,” Kaminari thought out loud.\nHe heard Kirishima make a confused sort of noise and could almost see his frown through the door. “Where else would he be, though?”\n“On a run? At the gym? Visiting his mom? Who knows, man.”\n“Bakugou, if you’re in there, I’m coming back to check on you later. And I won’t take no for an answer, I’ll break the door down if I have to. You know I’m serious.”\nBakugou closed his eyes. He didn’t reply.\n“The fuck is going on. Todoroki looked really upset today too. Almost heartbroken,” he heard Kaminari say as they moved down the hall.\nBakugou sat up in bed abruptly, straining to hear the conversation.\n“I don’t know, man. You don’t think they actually broke up, do you?”\n“No way. Even Bakugou isn’t stupid enough to let someone like Todoroki out of his grasp,” he heard, their voices slowly fading away.\nBakugou stood, walking across the room in a daze and leaning his head against the closed door, his eyes burning. He looked down, noticing his phone, which was disappointingly not broken.\nHe picked it up numbly, unlocking it and dialing the only number he knew by heart.\n“Mom?” he said into the receiver, voice thick. “I… need some help.”\n \n---\n \nThe next day dawned, bright and clear, and with it dawned a tentative renewal of Bakugou’s hope.\nHe had a fucking plan now, thanks to his mother. He’d spent most of the night telling her absolutely everything (though he did skimp on some of the finer details of his sex life, to be fair) and in true Bakugou fashion, she’d found a way for him to fix things.\nOr at least, a way for him to do something, dammit.\nHe checked his phone after breakfast, seeing a text from his mother.\n[Old Hag]: Meeting the reporter to give an interview at 2pm kiddo. I’ll let you know how it goes. Make sure you go to class today dammit. No more sulking.\nHe sent back a hasty reply, but walked to class with a smile on his face for the first time in what felt like years.\nHe might have fucked things up with Todoroki, but he wasn’t going to stop until he’d done everything he could to help him.\nHe wished he could see the look on Endeavor’s face.\n \n---\n \nBy the time the weekend rolled around, Bakugou was ready. Which was wise, because there was an absolute shit-storm waiting for him when he woke up Saturday morning.\nHe had about fifteen unopened texts and several missed calls—none from Todoroki, he noted, not bothering to open the rest.\nHe clicked on the app that connected him to the hero news network, seeing his own face first thing.\nThere was a picture of himself kissing Todoroki on the street corner, only this time a photo of Bakugou’s parents appeared next to it, his mother grinning in a way that looked utterly victorious.\nThe New Generation of Hero Romance!\n Mitsuki Bakugou gives us an inclusive interview about her son, Bakugou Katsuki, and his new budding romance with Endeavor’s son Todoroki Shouto!\nBakugou scanned the article, honing in on a few snippets here and there. One stood out to him more than the rest.\n\n“My son is head over heels for that boy,” Mitsuki told Hero Action News. “He’s never been so serious about anyone else in his whole life. It’s frankly a bit terrifying, but I can’t think of anyone who’d be a better match for my kid’s explosive personality.”\n\nBakugou blushed, skipping towards the bottom of the interview.\n\n“I encourage you to hit up Endeavor for an interview next. I’m sure he’d love to talk about how happy and in love Shouto is,” Mitsuki told this reporter. “He’s so proud of that boy. A constant well of support for his son. I’m sure he’d be thrilled at the chance to gush to you about one of the world’s next top heroes!”\n\n\nThis reporter contacted Endeavor Hero Office yesterday and is happy to report that we have a scheduled interview with Todoroki Endeavor in the works for early next week! Look forward to hearing more from us at Hero Action News soon! And to the two happy love birds, best wishes from us all!\n\nBakugou sat his phone down on his bedside table before standing up, walking over to his closet to pull on some fresh clothes. He selected his outfit carefully, as per his mother’s advice, going for something slightly less aggressive in appearance than he usually would.\nWhat he ended up pulling on was a white tank-top, one of the few articles of clothing he owned that was not black, and a pair of blue jeans that weren’t baggy, black, or camo print.\nHe figured that was about the best he could do.\nWhen he was finished, he turned to look at himself in the mirror. He looked reasonably more angelic than usual. Or at least, not entirely fucking demonic for once.\nHe grabbed his phone, shoving it in his pocket as he turned to leave the room before glancing one last time at his reflection in the mirror.\nHope swelled in his chest, and as stupid as it sounded, Bakugou was reluctant to try and stop it.\nHe was fucking smiling. He couldn’t stop, and honestly, he didn’t really want to.\n \n---\n \nOnce he was out in the hallway, he whipped his phone back out, texting as he walked towards the stairs.\n[Explodo-King]: r u busy right now?\nHe was pleased when he got a response almost immediately. A part of him had been scared he wouldn’t get one at all.\n[Half ‘n Half]: I’m not busy, no.\nWell. That wasn’t… discouraging, exactly. But close.\nBakugou shook it off though, determined.\n[Explodo-King]: meet me outside.\n[Half ‘n Half]: Right now?\n[Explodo-King]: yeah\n[Half ‘n Half]: Why?\n[Explodo-King]: just fucking do it ok? please.\nThe please was hard to type, but not as hard as he thought it would be. He guessed some things were easier to sacrifice his pride for than others. Todoroki Shouto’s affection appeared to be one of them.\nHe was all the way at the bottom of the stairs when he finally got a reply.\n[Half ‘n Half]: Fine. I’ll be there in a minute.\nHe stuffed his phone back in his pocket, fighting off the urge to pump his fist in victory as he walked out the front doors and stood out on the concrete in the early morning sun.\nExcept he couldn’t sit still, because he was fucking nervous as hell, so he just ended up pacing back and forth on the sidewalk, a scowl on his face. He kept running his hand through is hair, a nervous gesture he sometimes had.\nAbout five minutes later, the front door of the dorms swung open. Bakugou froze, looking up with wide eyes to find Todoroki stepping out onto the sidewalk.\nBakugou had never thought he’d be glad to see Todoroki, and yet here he was, happy to be being glared at. He was clearly out of his fucking mind.\n“Well?” Todoroki prompted, sounding just polite enough to not be considered rude. “What did you want?”\nBakugou squaring his shoulders. “Did you see the hero news this morning?”\nTodoroki scowled, crossing his arms over his chest, his eyes darting away from Bakugou’s. “I did.”\n“And the interview my mom gave?”\n“Yes. What of it?”\n“You’re free now,” Bakugou said, taking a step forward. “Don’t you get it?”\nTodoroki’s eyes flicked back to him, his eyebrows drawing down in confusion.\n“My mother publically acknowledged you’re dating me. There’s a picture of us kissing with the article, for fucks sake. And at the end, she said they should contact Endeavor for an interview, too. And they did. And he fucking agreed to give one.”\nTodoroki’s eyes widened, understanding dawning on him.\n“He can’t deny anything now without making himself look bad,” Bakugou continued. “He’s going to be forced to come out in support of you if he doesn’t want to hurt his precious fucking image.”\nTodoroki looked absolutely stunned, his mouth falling open. “You… set this up. For me.”\n“Yeah. Yeah, I fucking did,” Bakugou agreed, something warm and elated rising dangerously in his chest.\nTodoroki’s expression flashed with pain for a moment before settling back into something more neutral, but the tremor in his voice betrayed him when he said, “But why? You don’t even like me, why would you—“\n“Don’t be a fucking idiot,” Bakugou cut in, taking a step forward. “Look. Honestly, I didn’t really even call you out here to talk about the fucking article.”\nHe watched Todoroki’s expression falter, his arms finally dropping to his sides. “Then why did you call me out here?”\n“Remember that one request you owe me for doing all this shit? I’m fucking calling it in.”\nTodoroki’s eyes registered shock, his hands twitching. Bakugou stepped closer again, Todoroki backing up half a step before seeming to forget there was a closed door behind him as he came into contact with it.\n“You swore. Any one request,” Bakugou reminded him, eyes a silent challenge.\nTodoroki nodded, eyes steeling with resolve. “I did. Name it, and it’s yours.”\n“Fucking wonderful,” Bakugou said, taking one final step forward and reaching out to clasp Todoroki’s hand in his own without further comment. “Then from today on, you’re dating me.”\nTodoroki’s mouth dropped open. “What?”\n“My request, idiot. Date me for real,” Bakugou answered with a scowl, bringing Todoroki’s hand up to his mouth to plant a kiss across his knuckles briefly.\nHe watched Todoroki shake his head in disbelief. “You have to be kidding. There’s no way you—you kicked me out of your room after we—“\n“I was a fucking idiot, alright? I was mad because I thought you were just—just fucking using me or something, and I—“ Bakugou took a deep breath, swallowing his pride. “I wanted it to be real. And I was pissed because it wasn’t.”\nHe wasn’t sure he’d ever been so open and apologetic in his entire life, honestly. But he also knew he’d fucked up royally, and knew exactly where and how, thanks to his fucking mother.\n“Look, I’m sorry, alright?” he muttered, looking down and letting Todoroki’s hand drop reluctantly. “I know I fucked up. And I can’t promise I won’t fuck up again, but I’d at least like the chance not to.”\nIf saying sorry was what he had to do to get what he wanted, then he’d fucking do it, goddammit, pride be damned.\nIt was weird, realizing there was something he valued more than his own pride.\nHe waited, heart aching painfully behind his ribs. This was the part he’d dreaded most, truth be told. It was one thing to have control over his own fate; it was another thing entirely to let his fate rest on the decisions of someone else. It made him feel vulnerable in a way almost nothing else ever had.\nTwo hands suddenly grasped either side of his face, hauling him forward with enough force to make him stumble, Bakugou’s hands landing on Todoroki’s shoulders in an effort to keep himself upright. Todoroki’s eyes were absolutely blazing, anger and something else dancing in their depths. But he had that fucking look on his face again.\nBakugou finally thought that this time, he maybe understood what it was.\n“Don’t ever do that to me again,” Todoroki threatened, voice wobbling slightly.\nBakugou swallowed thickly, nodding as much as he could in Todoroki’s hold. “I won’t,” he told him, because he meant it.\n“Good,” Todoroki said with an air of finality. “Now make it up to me.”\nBakugou’s face drew down into a small frown, his mouth opening to ask how the fuck he was supposed to do that, exactly.\nBut before he could say anything, Todoroki sealed his mouth over Bakugou’s own, kissing him with a kind of ferocity that made Bakugou’s knees feel weak. Todoroki’s tongue pushed into his mouth, rough and demanding, and Bakugou moaned in response, not fighting it at all, tilting his head to give him better access and understanding that Todoroki wanted him to know he’d been thoroughly conquered and claimed. That’d he’d lost, and he was at Todoroki’s mercy.\nFrankly, Bakugou wasn’t about to fucking complain.\nBakugou wasn’t sure how long they stood there pressed up against the door. Eventually, the sound of someone clearing their throat loudly came from behind them, the two of them broking apart, startled.\n“Look, not that I’m not happy for you guys, but can you maybe not block the door at least?” Ochako asked, sounding thoroughly amused.\n“Shut the fuck up, angelface,” Bakugou muttered, face beat red as he pulled Todoroki to the side so she could move through the doorway.\n“By the way, Bakugou. I like your matching neck accessories. Very cute,” she said just as the door closed, winking at them both.\nBakugou clasped a hand over his neck, almost having forgotten that the marks were still in fact there, even days later. “We need to work on your technique,” he muttered to Todoroki when she’d left. “You made them too deep.”\nTodoroki made a noise that sounded like a poorly restrained laugh. “Is that so?”\n“Yeah,” Bakugou said, leaning forward to speak against Todoroki’s ear suggestively. “How about you come up to my room and I’ll show you how it’s really done?”\nTodoroki shivered. “Is this you offering to make it up to me?”\n“Oh, I’ll make it up to you, alright,” Bakugou promised, nipping at his ear lightly before pulling back with a feral grin.\nThey made their way inside, running up the stairs in an unspoken race to Bakugou’s dorm room before pushing each other through the door, Bakugou cursing loudly when he nearly fell on his face as a result.\nThey didn’t come out of Bakugou’s room for the rest of the day. When Kirishima, Kaminari, and Izuku began to worry, Ochako made sure to assure them that everything was absolutely fine and that if they wanted to preserve their sanity, it was probably wise to let the two of them be.\n \n---\n \n A Tale of Fire and Ice: Endeavor Tells All!  \n Todoroki Enji sat down with Hero Action News to dish the goods on his son’s new beau!\n\nTodoroki Enji has always had high hopes for his son, but having his son score one of the biggest names in the up and coming hero scene in this season’s hottest whirlwind romance shocked even the world’s Number Two hero.\n\n\n“My son has always been destined for great things,” Endeavor told this reporter last Monday in a one on one interview. “This was certainly not expected, but Bakugou Katsuki is a formidable rising name in the industry. My son would accept nothing less than the best in life, so why should his love life be any different.”\n\n\nThis reporter was lucky enough to sit down with Bakugou Mitsuki just last week. The mother of Bakugou Katsuki had nothing but great things to say about Endeavor’s son and heir to his empire of skill and acclaim, and Endeavor was no different in his review of the young hero who has stolen his son’s heart.\n\n\n“They’re very happy together,” Endeavor told this reporter. “Bakugou is the sort of man who is unafraid of virtually anything, myself included. I feel as though he will be more than capable of standing up to and standing up for my son.”\n\n\nAs far as plans for marriage, Endeavor played his cards close to his chest. “It’s still a new romance. I don’t want to make assumptions about my son’s future, but I will say that I would not discount it as a possibility.”\n\n\nWell folks, you heard it here first! This romance is sure to be one for the history books! With the blessing of both parents under their belts, this reporter can only wonder where these two young heroes will go in life (and love)! From all of us here at Hero Action News, congratulations and a very happy future to both Bakugou Katsuki and Todoroki Shouto!\n"
}