{
    "id": "11652117",
    "url": "https://archiveofourown.org/works/11652117?view_full_work=true",
    "author": [
        "I_dont_know_man"
    ],
    "title": "If I'm Being Honest....",
    "rating": "Not Rated",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Midoriya Izuku/Todoroki Shouto",
        "Midoriya Izuku & Todoroki Shouto",
        "Bakugou Katsuki/Kirishima Eijirou"
    ],
    "characters": [
        "Todoroki Shouto",
        "Midoriya Izuku",
        "Asui Tsuyu",
        "Uraraka Ochako",
        "Ashido Mina",
        "Kaminari Denki",
        "Kirishima Eijirou",
        "Bakugou Katsuki",
        "Tokoyami Fumikage",
        "Aoyama Yuuga",
        "Yaoyorozu Momo",
        "Jirou Kyouka",
        "Ojiro Mashirao",
        "Sero Hanta",
        "pretty much all of class 1 A",
        "as it should be - Character",
        "Iida Tenya",
        "Hagakure Tooru"
    ],
    "additional_tags": [
        "Humor",
        "truth telling shenanigans - oh my!",
        "tododeku - Freeform",
        "bakushima",
        "theyre in third year",
        "cussing - of course",
        "bakugo is in this after all",
        "Friends to Lovers",
        "Mutual Pining",
        "Socially awkward Todoroki",
        "embarrassed af Todoroki",
        "poor poor todoroki",
        "midoriya is the sun itself",
        "if you like humor and fluff and gay shit then this is for you",
        "UST",
        "Pining",
        "Fluff and Humor",
        "canonverse",
        "McDonalds runs",
        "jesus this is a lot of tags",
        "gratuitous Twitter references"
    ],
    "language": "English",
    "series": "",
    "published": "2017-08-02",
    "completed": "2018-04-28",
    "words": "26,612",
    "chapters": "6/6",
    "comments": "1,383",
    "kudos": "22,758",
    "bookmarks": "4,278",
    "hits": "279,868",
    "summary": "<p>Midoriya scrunched up his nose in confusion. “Uh, Shouto, why are you glaring at me like that?”</p>\n<p>“I-” Todoroki began to lie, until nausea slammed him like a door to any room that Bakugou entered. “I--” Todoroki grit his teeth, and glared daggers into the wall behind Midoriya. <i>Goodbye, friendship.</i> It had been absolutely divine while it lasted. “Because you’re very attractive.”<br></p>\n<p><br>They say honesty is the best policy, but it sure as hell had a knack for Todoroki making a complete and utter fool of himself.</p>\n<p>In which Todoroki is placed under a mysterious truth-telling quirk and suffers, Uraraka laughs at him, Midoriya is confused but smitten nonetheless, and Twitter is the thirstiest site on the planet.<br></p>\n<p>Todoroki suffers. Need I say more?</p>\n<p>Poor Todoroki, he's a nice kid.</p>\n<p>Boy howdy!</p>\n<p>Tomfoolery abounds.</p>\n<p>My Hero Academia is a manga serialized in Weekly Shonen Jump and written by Kōhei Horikoshi. </p>\n<p>The story is set in the modern day, except people with special powers have become commonplace throughout the world. Heroes have now filled the world to defeat villains. A boy named Izuku Midoriya has no powers, but he still dreams of becoming a hero one day.</p>\n<p>Shoto Todoroki (轟とどろき焦しょう凍と Todoroki Shōto?) is a student at U.A. High School training to become a Pro Hero. He got into U.A. through official recommendations. He is one of the main protagonists of My Hero Academia.</p>",
    "notes": "<p>first HeroAca fic *insert Longest Yeah Boy Ever* !!!</p>\n<p>inspired by the wonderfully Extra<sup>TM</sup> film <i>Liar, Liar</i> with Jim Carry. </p>\n<p>Another quick note - this fic takes place during third year! dont ask me why they still have the same class roster and dorm arrangements lmao</p>\n<p>beta'd by the amazing <a href=\"https://screaming-l0rd-byr0n.tumblr.com\" rel=\"nofollow\">screaming-l0rd-bry0n</a>, i owe them my life tbh</p>\n<p>Enjoy!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>So ive done something ive never done before, and this fic is already 95% written! that being said, what do y'all want the update schedule to look like? weekly? lemme know ;)</p>\n<p>Next time on <i>Shouto Suffers~</i>: Uraraka and Ashido achieve critical mass of sass, Todoroki discovers the greasy wonders of capitalism, and Tokoyami is a fucking bird.</p>\n<p>holy shit guys, thanks so much for all the response on the last chapter!! i guess im not used to writing for big fandoms, but each and every comment genuinely means the world to me, thank you :D</p>\n<p>\"Are you my appendix? Because I don’t understand how you work, but this feeling in my stomach makes me want to take you out.\"</p>\n<p>\"Do you have a bandaid? Because I scraped my knee falling for you.\"</p>\n<p>--you'll need these for later</p>\n<p>once again, i owe <a href=\"https://screaming-l0rd-byr0n.tumblr.com/\" rel=\"nofollow\">my beta</a> my life. thank u so much</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>for the record, i prefer Frostys myself.</p>\n<p>this fic takes place in an AU where winking is actually cute and doesnt look creepy as shit like irl. dare i dream?</p>\n<p>i've settled on weekly updates! university starts next week, and as such i'll be quite Busy, as the kids say.</p>\n<p><i>Next week!</i> Todoroki figures shit out, Asui is sick of his hogwash, and the entire fifth floor sweats profusely.</p>\n<p>fucking HECK you guys i am so fuckign sorry about how long this took to come out. Over the past couple weeks I've moved not only into my dorm but across the country, and already have a shit ton of homework, so i hope y'all can understand!!</p>\n<p>Regardless, i hope y'all enjoy this new chapter. i was actually gonna split this in two but i feel really bad about the delay so here's a nice long chappy for your enjoyment</p>\n<p>have i ever told y'all about <a href=\"https://screaming-l0rd-byr0n.tumblr.com/\" rel=\"nofollow\">my beta</a>? good!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>(dont ask why Watergate is apparently also cannon in the BNHA universe [what quirk would Nixon have??])</p>\n<p>i adore Tsuyu with all my heart, and so should u guys</p>\n<p>did anybody catch the really obscure connection between the chapter title and a line in this chapter? i'd be hella impressed</p>\n<p>sorry this chapter is a little boring, but it's certainly necessary and i want to keep some semblance of a logical flow of events lmao, so what can ya do. NEXT CHAPTEr, however, will contain much much more spice so dont jump ship just yet!!</p>\n<p>again thank you so very much for all the comments. even if i don't reply, i genuinely read each one multiple times and it brings a huge smile to my face !</p>\n<p><i>Next chapter:</i> Shouto unwillingly shares with the class, Bakugou is angry, and popcorn is...sexy?</p>\n<p> </p>\n<p>\n<i>See you Space Cowboy...</i>\n</p>\n<p>FOR REFERENCE: <a href=\"https://youtu.be/EkLnFYXsNe8\" rel=\"nofollow\">watch like 20 secs of this</a>. this happens in the middle of every episode lol</p>\n<p>it just occurred to me that i made a huge misstep not making the chapter summary for the mcDonalds chapter \"yeah can i get a fuckin uhhhhhhhh- Borger\" bc that shit cracks me up.</p>\n<p>also, sorry about the tardiness once agin. But rest assured knowing that I'm busy as FUCK, its honestly horrible but what can yo do lmao. hopefully y'all enjoy this chapter, i had a hell of a time writing it. </p>\n<p><a href=\"https://screaming-l0rd-byr0n.tumblr.com/\" rel=\"nofollow\">my beta</a> is a huge help, as always~</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>deadass that \"fullmetal alchemist.\" \"fullmetal alchemist\" (slightly different tone) is one of my fav fandom memes so if nothing else, i cracked myself tf up thinking about it. </p>\n<p>again i apologize for the delay! and this chapter is so self-indulgent, i cry. it's about time i label this a crack fic tbh. but enough about me....</p>\n<p>Just FYI the next chapter has some of my very fav bits!! so get ready kiddos ;)</p>\n<p>Thank you so much for all comments/kudos/etc! they really do mean a ton, I read each and every one!</p>\n<p>Thanks for all the encouraging comments!! I never would've (slowly) finished this if not for the encouragement! It genuinely means a lot.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>Oh boy oh boy! Hope this wasn't too disappointing after that dreadfully long wait! Once again, I really appreciated the comments, so thank you :D</p>\n<p>(also if you were wondering why Midoriya just didnt take the elevator down to his room the answer is shhhhhhhh)</p>\n<p><i>Next chapter</i>: Todoroki reaches Absolute Zero of embarrassment, so much so that I as the author want to perish while writing it. Poor kid.</p>\n<p>*Roblox voice* Ooef!!</p>\n<p>I do have my reasons for taking so long with this, but who gives a shit lmao. All that matters is that it's finally out! I hope this is somewhat remotely satisfying, part of the reason I never updated was fear of providing a solid ending. I really wanna deliver for y'all!</p>\n<p>Also, I just realized this has been a pretty smut-free fic (which is fucking unbelievable just given my history of fic writing lol), so if you don't like that sort of thing, skip from \"<i>Hell, with Todoroki's luck</i>... to \"<i>Are you alright? I'm pretty sure I smell smoke!</i>\".</p>\n<p>that's all for now, thanks for reading!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>dude idk why but posting the official Wiki descriptions craacked me tf up.</p>\n<p>i'm sorry i made it so obnoxiously obvious that Bakugou is my favorite character to write, he's just such a loser I can't resist including him a lot lmao</p>\n<p>OH WOW! I have a lot to say, feel free to skip it all!</p>\n<p>Firstly, thank you so much for each and every comment. I mean that sincerely; the comments and overall response were literally the only motivation that actually got me to finish this sonuvabitch. I would feel super discouraged and like a piece of shit because of subpar writing, but then I'd think about all the times I'd cry over abandoned fics, and I didnt wanna do that to y'all so it helped me get off my ass and finish it! So thank you SO MUCH, I genuinely mean it. </p>\n<p>Also, it's highly possible that I didn't really round out themes and motifs that i set up early, just because I wrote this ending almost a year after writing all the other stuff aha. (I'm the worst). That being said, I'm willing to write a headass epilogue-thingy that involves more of the other characters, because i feel like I didn't really include them enough but didn't wanna bog down the pacing. also, i feel like i should have more of midoriya reacting to the truth quirk lol. Idk, y'all tell me what you think! I adore constructive criticism in general.</p>\n<p>That should be about it! It means so much that y'all stuck with me for nearly a year. I have a Kiribaku fic in the works that I can't wait to post, so be on the lookout if that pairing tickles your pickle.</p>\n<p>&lt;3 &lt;3 &lt;3</p>\n<p>I <a href=\"https://www.tumblr.com/blog/i-d-k-man\" rel=\"nofollow\">tumble</a>. Do u?? ;)</p>",
    "text": " \nBright sunlight made Todoroki squint as he stepped through the hospital’s automatic doors.  \nIt was a beautiful day - surprisingly cool for June - with a pleasant breeze tossing Todoroki’s bangs.  Even the hospital had seemed cheerful, his mother smiling softly as Todoroki opened her window, then laughing behind her hand as the wind caught the curtain and smacked her son in the face.  \nShe had been laughing more and more lately, each giggle (and occasional snort) threading one more stitch across the fractures of the past between them.  After all, Todoroki had heard that broken bones grow back stronger.\nClosing his eyes leisurely, Todoroki basked in the sunlight.\nA short buzz in Todoroki’s pocket interrupted his musings, and he pulled his phone out.  Midoriya Izuku, the screen read. Speaking of broken bones...\nAs Todoroki typed in his passcode, another buzz rattled the phone, also courtesy of Midoriya Izuku.  A perfectly suitable contact name, intentionally dull so as not to raise any suspicion.  Kirishima had more than provided a cautionary tale last year, when Ashido had discovered that his contact name for Bakugou was “BakuuuBabe”, accompanied by a rather unfortunate string of emojis (the water droplets especially stood out).  For nearly a month, a chorus of “Bakuuu!”s chimed whenever Bakugou entered a room or hallway, like some occult ritual.  \nA couple charred streaks remained on the hallway floors to this day.  Needless to say, Todoroki wasn’t about to go putting Midoriya’s contact as ‘light of my life’, ‘reason green is my favorite color’, or any of those other intrusive thoughts that spun right ‘round like a record through Todoroki’s head whenever he was around the boy.   Midoriya Izuku was proper, professional.\n(Midoriya Izuku somehow still managed to send a pleasant chill up Todoroki’s spine.)\n \n&gt;&gt; hey man, u still wanna join us or should we just go ahead and start ? \n \nTodoroki glanced at the time, 10:37.  Ah, he was running late.  The unofficial little “Men of Class 1-A Weekend Workout Squad” (or “Swole Team 6,” as Kirishima called it) usually started an hour or so before lunch.\n \n&lt;&lt;  Count me in, if nobody minds waiting.  I should be back on campus in half an hour. \n \n&gt;&gt; great !!  Midoriya replied almost immediately.  see u there, Freezer Burn :) \n \n‘Freezer Burn’, huh?  That was a new one.\nIt really was a beautiful day, so Todoroki let the butterflies flit freely within him as he basked in the sun at the train stop.  He liked when Midoriya called him nicknames.  Or called him his real name.  Or looked Todoroki’s way in general.  It didn't take much, with Midoriya.\nThe breeze smelled like roses.\nA couple minutes passed, and the train pulled into the station, rumbling to a halt.  The doors slid open, revealing an angry couple, screeching hysterically.  The warmth of the sun dissipated as Todoroki boarded and found a seat, as far from the racket as possible.  He sighed - the peace had been nice while it lasted.\n“Don’t even try giving me that bullshit again, Subaru!”  some lady was yelling, her eyes cocooned in black eyeliner and long nails glittering in the fluorescent light.  “I’ve seen the way you look at her, it’s like a dog drooling over a piece of meat.  Or its own vomit.  You’re disgusting, Subaru, a fucking disgrace!”\nA man - presumably Subaru - threw his arms up in frustration.  “For the last time, Mitsubishi, I told you that she’s just a friend.  I’d hang out with any of my friends at 3 am, that’s no big deal!  In fact, I’d love to go out late with you, but you insist on sleeping before midnight, like some senior citizen.”\n“Yeah, so I love sleeping.  Sue me!”  Mitsubishi was really fuming now - it reminded Todoroki of someone, but he couldn’t quite put his finger on it.  “At least I do it alone.  Unlike you, you fuck!”\nBakugou!  The answer clicked in Todoroki’s head.  That’s who Mitsubishi reminded him of.  It must be the homicide in her eyes.\n“T-that’s ridi- I can’t believe you’d say-!”  Subaru stammered.  “Mitsubishi, I would never.”\nA wicked smile uncoiled across glossy red lips.  “Is that so?  Then why don’t we make ourselves 100% certain?”\nDread eclipsed Subaru’s face, and he began backpedaling both literally and figuratively, retreating into Todoroki’s personal space.  Great.  “N-now, there’s no need for extremes, babe.  Have I mentioned how sexy you look in that lipstick color?  Why would I ever even look at another girl when I have you!”\n“Let’s find out,” Mitsubishi menaced, eyes positively sparking with ill-intent as she stretched out a hand towards her (soon to be ex, in Todoroki’s opinion) boyfriend.  Her expression was downright murderous - had Bakugou mentioned having an aunt in the area?\nAny musings surrounding Mitsubishi and possible relation to Bakugou were dispelled as Todoroki felt his phone vibrating on his knee.  Midoriya Izuku.  Ahhh.  Todoroki put the phone up to his ear.  “Hello, Midor--”\nThree things then happened in quick succession:\n1)  The train cabin shuddered suddenly without warning.  \n2)  Mitsubishi, caught off guard, lost her balance, desperately grabbing Todoroki’s shoulder in order to stay upright.\n3)  A violent bolt of nausea crackled through Todoroki, and his head swam painfully.\nThankfully, the train returned to its original course as quickly as it had left it.  Todoroki’s stomach smoothly unwound, the nausea disappearing completely.  He breathed heavily, eyebrows knit in confusion as he rubbed his shoulder where Mitsubishi had speared him with her nails.   What the hell was that about?  Had he eaten something bad?\nA loud gasp tore Todoroki from his thoughts.  Mitsubishi looked downright horrified, her hands slapping over her mouth.  “Oh shit, shit, shit!  Fuck, do you feel sick at- hey, wait.”  Her heavily outlined eyes popped even wider, if possible.  “Are you that Todoroki kid, from U.A.?”\n“Yes,” Todoroki replied, curiously quickly.  He normally tried to avoid drawing attention in public.\n“Oh, I see you all over Twitter!  You were so cool in the sports festival last year - I was totally rooting for you, by the way.”  Mitsubishi beamed widely, a small blotch of lipstick disrupting the glare of her white teeth.  Todoroki nodded weakly.  To think, just a minute ago he had been calling her a relative of Bakugou.  \nStill smiling unnaturally wide, Mitsubishi beat a hasty retreat.  Subaru, for his part, looked even more horrified than before.  He opened his mouth, but Mitsubishi sent him another Bakugou glare, yanking her thumb and pointer across her lips harshly in the universal ‘zip your lips’ gesture.  \nTodoroki frowned.  What was that about?  And wait, what was up with that whole nausea thing?\nHe opened his mouth to inquire as such, but Midoriya chose that moment to conduct his own questioning.  “Todoroki?  Are you there?  You stopped replying!”\nThe warm crackle of Midoriya’s voice, as always, quickly monopolized all of Todoroki’s brainpower, and soon enough, all thoughts of Mitsubishi and possible food poisoning had vanished.\n“Yeah, I’m here.  Sorry, the train got a little bumpy for a second…”\nTodoroki exited the train station as carefree as he had entered it.  It really was a beautiful day.  \n \n  \nAn hour later, Todoroki walked into the men’s locker room, a small duffel bag and water bottle in tow.\n“Hey, bro!”  Kirishima looked up from where he was tying his shoes, grinning.  “Glad you decided to come!”  \n“Of course,”  Todoroki replied a bit awkwardly, unsure of what to say.  Kirishima always greeted him like it was Todoroki’s first time working out with them, while in reality he attended nearly every week.  Todoroki had actually been one of the founding members of the group (along with Midoriya and Iida), despite actually preferring to exercise alone.  \nWorking out in groups was great, is all.  Very important for both mind and body, building camaraderie.  And if Todoroki had had an ulterior motive for forming Swole Team 6, then nobody had to know.  \n“Took you fucking long enough to get here, asshole,” Bakugou grumbled with a scowl, and in retrospect, Mitsubishi’s harshest expressions seemed downright welcoming.\n“I’m so glad you could make it!”  Midoriya, the ulterior motive himself, beamed.  “Taking the train can be such a pain.”\nTodoroki only allowed his mind to dwell on gooey thoughts concerning green hair and bright eyes for a moment before he forcibly ejected them.  “Thanks for waiting.  So, what are we doing today?”\nIida raised his hand and sprung upright.  “I would like to present an idea!  Last night, I had a dream about Mr. Aizawa, and--” \n“--Wow, how scandalous of our very own class president!  I never knew you liked older men, Iida,”  Kaminari interrupted, waggling his eyebrows.  \nIida glared at Kaminari sternly, adjusting his glasses.  “Not that kind of dream.  Which should go without saying.”  Another pointed glare.  “In it, I forgot to turn in a large assignment, and Mr. Aizawa erased my quirk forever as punishment.”  Iida shuddered.  “It was an unpleasant dream.  However, I began thinking about my abilities without my quirk, and I realized I’d like to work on my hand to hand combat skills without quirks.”  \n“That’s not a bad idea,”  Tokoyami nodded.  “We should always be prepared for scenarios where our quirks are disabled.  Darkness surely lurks behind every corner.”  \nThe entire locker room chimed in agreement, collectively ignoring Tokoyami’s comment.  Kaminari pulled a die from his pocket.  “We can use this to pair up.”\n“Why..are you carrying around dice?”   Midoriya asked.\n“I use them to do magic tricks,”  Kaminari winked.  “The ladies love them.”\nTodoroki wasn’t so sure.  \nAfter a couple minutes, the group had split up.  Todoroki ended up paired with Midoriya - of course he did.  Why would the universe ever cut him a break, especially when his self-control was already on the wobbly side, crippled by changing in the same room as Midoriya?  Sparring with his crush was a double-edged sword if ever one was forged, and there was no way he’d escape without any nicks.\n“Hey, partner,”  Midoriya jogged over to Todoroki.  “This will be great training, don't you think?”\n“I think. Yes, I do,”  Todoroki babbled, a little thrown off by Midoriya’s radiance, then wanted to die when he realized what he'd said.  God, there was no way he'd survive this, at this rate.  The sword was already unsheathed.   \nYet, impossibly, with 15 minutes past, Todoroki had managed to avoid any overtly self-incriminating actions.  The sparring session couldn't make up its mind between rapture and torture.  \nA pro:  Midoriya unconsciously licking his lips in concentration.\nA con:  Todoroki taking a hit every time Midoriya unconsciously licked his lips in concentration.\nPro:  getting to ogle Midoriya’s neck when he tossed his head back to drink water.\nCon:  resisting the urge to kiss Midoriya’s neck when he tossed his head back to drink water.\nPro:  falling on top of Midoriya on more than one occasion, their bodies pressed close.  \nCon:  desperately reciting mathematical formulas in his head to avoid a more, ahem, prominent reaction when Todoroki fell on top of Midoriya, their bodies pressed close.\nPro:  practicing hand-to-hand combat technique, one of Todoroki’s rustier skills.\nCon:  Todoroki was not focusing on his hand-to-hand combat technique, one of his rustier skills.\nStars twinkled in Todoroki’s skull as Midoriya landed a particularly nasty right hook - Aoyama would have been delighted.  \n“C-crap, Todoroki, I didn’t mean to hit you that hard!”  Midoriya’s eyebrows were knit in concern.  “Does it hurt?”\n “No,”  Todoroki lied - or at least tried to.  Somehow, the word wouldn’t come out.  Todoroki frowned.  “No”, he said, more firmly.  Still, nothing came out but a raspy exhale.  \nSomething akin to panic began rising in Todoroki.  Had the punch screwed with his vocal chords?  There was no way, right?  He was just overreacting.\nMidoriya, meanwhile, was wringing his hands anxiously.  “T-todoroki?  Oh my god.  Please don’t tell me I gave you a concussion.  Do you feel alright?”\nCrap, he hadn’t meant to worry Midoriya.  Todoroki took a deep breath, forcibly calming himself.  Just say ‘Yes.’  He took one last deep exhale, focused, and…\nAn empty huff croaked out of Todoroki as agony suddenly cracked through his skull, and nausea slammed his body like a door in Paranormal Activity.  Holy fuck, was he having an aneurysm?  Todoroki groaned as a fresh wave of pain bowled him over, his head on the verge of imploding.  \nMidoriya appeared to be panicking, grabbing Todoroki’s shoulders.  Todoroki yelped again, his side splitting.  Fucking hell, he could hardly even see Midoriya through this haze in his head.  His stomach tweaked in all the wrong ways.  \n“No!” Todoroki shouted desperately, completely involuntarily.  Midoriya’s eyes, all watery, widened in confusion at his outburst.  “No, I don’t feel ‘alright’.”\nAnd just like that, all traces of pain vanished.  What the hell?!  \n“Todoroki?  S-shouto?”  Midoriya’s voice and eyes wobbled in unison.  “Can you hear me?”\n“Yes,” Todoroki whispered, with complete ease.  Huh?  Unease settled in Todoroki’s bones.  He had absolutely no idea what was happening to him.  \nAbsently, Todoroki caught a vague scent of smoke, and a breeze tickled his side.  Shit, he must have partially singed through his shirt because of the pain.\n“Do you feel stable?”  Midoriya implored, hands tightening their grip on Todoroki’s shoulders.  \n“Yes,”  Todoroki replied again, perfectly fine.  \n“Oh my god, thank heavens,” Midoriya sobbed, wrapping Todoroki in a desperate hug.  Todoroki could feel the boy’s heart pounding through his charred shirt, which was, well… If Todoroki didn’t feel so freaked out, he certainly would’ve ascended to Cloud 9 by now.  \n“I’m so, so sorry, Todoroki!”  Midoriya squeezed him even tighter, hands balling up against Todoroki’s back.  “Y-you just normally dodge punches, and I banked on that and put too much force into it, and then you started grabbing your head and smoking and curling up and oh my god it was so terrifying, and I’m so sorry, and I would never ever hit you that hard on purpose, you know that right?!”  \nTodoroki nodded, Midoriya’s soft hair tickling his chin.  He focused on the warm, solid body pressed up against his and melted into the embrace, pulse relaxing.  Whatever the hell that episode had been, it was over now.  \nExcept-- the beginnings of a headache began unfurling in Todoroki’s temples and he stiffened.  As soon as he opened his mouth to suck in a nervous breath, however, he found himself murmuring “Of course I know that, Izuku” into Midoriya’s hair.  \nTodoroki’s burgeoning headache dissipated as his confusion returned in full force.  He hadn’t meant to say that, even though it was true.  And wait, had he just called Midoriya ‘Izuku’?\nA slight flush rose in Todoroki.  He really hadn’t meant to say that.  What was happening to him?!  Maybe I do have a concussion...    \nTodoroki broke the hug, taking a few tentative steps back.  He still didn’t entirely trust his body to not belly flop into a swimming pool of agony at any moment.\nSpecks of ash from Todoroki’s shirt stuck to Midoriya’s own.  The boy picked at them absently.  “You, uh, did you just call me ‘Izuku’?”\n“Ah, um, yes.”  Todoroki flushed further.  “I wasn't thinking.  I'm sorry.”\n“No, no!”  Midoriya’s hands waved in protest.  “It's..nice.  You should call me Izuku all the time.”  \n“Huh?”  Todoroki breathed, quite eloquently.    \n“I said,”  oh man, apparently it was now Midoriya’s turn to glow bright red,  “that you should call me Izuku.  If you want.”\n“Oh,” Todoroki replied, lamely. “I do want to. And call me Shouto. -only if you want to.  Too.”\n“Whatever you say, Shouto,” Midoriya grinned, and began gathering his things. “I think we’ve done enough for today. I'll see you at lunch!”\n“Yeah. See you.”  \nMidoriya looked expectant.  Oh.  “...Izuku.”\nThe name melted pleasantly in Todoroki’s mouth, like cotton candy, and Midoriya bounced on his heels.\n“And just so you know-”\nTodoroki paused with his water bottle halfway to his face, glancing at Midoriya.\n“Just so you know,” Midoriya repeated, eyes flickering down.  “You should, uh, put on another shirt before lunch. Yeah. Bye!”\nMidoriya left, and Todoroki looked down at his tattered top, only half remaining.\nThe walk back to the locker room was occupied by Todoroki berating himself for allowing himself to think that Midoriya’s cheeks had glowed ever-so-brighter with his parting comment.\nIf wishes were fishes, Todoroki could open a goddamn aquarium.\n \n  \nBack in the locker room, Todoroki mindlessly slipped on a fresh shirt, as if his brain had subconsciously labeled Midoriya’s suggestion as its top priority.  \nIt wasn't far fetched.  \nTodoroki’s stomach surged softly as his mind replayed his inexplicable agony earlier, and a cold sweat broke out over his skin.\nToo freaked out to shower just yet, Todoroki collapsed onto a sink in the locker room, knuckles white as they clenched the porcelain.  What’s wrong with me?  How can the headaches appear and disappear so quickly?\nMismatched eyes found themselves in the mirror, and Todoroki stared intensely at the glass, imploring his own reflection for answers.\n\n Does the pain only activate with questions, like some strange cousin of Shinsou’s quirk?  But the pain only happened twice, and Midoriya definitely asked more than two questions. \n\nUnfortunately, Todoroki’s reflection seemed just as confused as he was, and offered no solutions.  The glass fogged as Todoroki sighed in frustration.\n\n Is it even the work of a quirk in the first place?  I could just be getting random headaches...  Midoriya did hit me pretty hard. \n\n“Checking yourself out, Todoroki?”  Kirishima’s grinning face joined Todoroki’s in the mirror, creating a pretty decent rendition of the comedy/tragedy mask.  Todoroki stiffened - he hadn’t heard his classmate enter and wasn’t quite in the mood for conversation.  \n“I, I wasn’t checking myself out.”  Todoroki felt the strange urge to clarify.  Thankfully, no tendrils of pain began unfurling in his head.  So it's not question-based?\n“Sure you weren’t,”  Kirishima grinned even wider.  “Besides, I’m pretty sure that the entire rest of the class has got that covered.  Hell, more like the entire rest of the country.”\nWell that was...generous.  “Thanks?”\n“Don’t mention it, Pretty Boy.”  Kirishima crowded closer to Todoroki in the mirror, eyes scanning Todoroki’s reflection.  “Damn dude, speaking of that iconic face, what the hell happened to your jaw?  That’s shaping up to be quite the bruise.”\nAh, Kirishima was right - only then did Todoroki notice the throbbing along his jawline.  “I accidentally let my guard down during my spar with Midoriya.  It was a stupid mistake.”\nKirishima clapped an arm around Todoroki’s shoulders.  “Don’t be too hard on yourself there, everybody loves a guy with some battle scars.  It shows moxie.  Besides, I know exactly what you're talking about.”  Kirishima winked.\nTodoroki simply nodded, a bit lost.  \n“So tell me, Hot Stuff - or should it be Cold Stuff?  I’m gonna go with Lukewarm Stuff.  So tell me, Lukewarm Stuff, just what did Midoriya do to cost you that bruise?”  He winked again.  Kirishima seemed to like winking.  “My bet is he got hot and took his shirt off.”  \nSpeaking of getting hot, the air in the room suddenly felt quite oven-like, and Todoroki desperately battled three scrapbooks’ worth of mental images.  Midoriya did tend to shed clothing when warm, a fact that reflected quite poorly on Todoroki’s faint, gay heart.  \nTodoroki gripped the sink even tighter, refusing to encourage Kirishima with an answer.  \nKirishima bulldozed on, encouraged.  “Don’t worry, man, there's no shame here.  I of all people understand the deadly combo of shirtlessness and sweat.  It’ll really get ya.  For a while I’d nearly turn Katsuki down if he asked to spar because I knew I'd end up staring and leave with a game of connect-the-bruises across my body.”  Kirishima hummed.  “Plus, he's just really freaking good at hand-to-hand.”\nTodoroki didn’t even have a chance to become flustered before that terrifying, now-familiar flutter of nausea laced through his gut.  His jaw throbbed as he grit his teeth in apprehension.\nKirishima seemed to notice his unease.  “Woah, dude, I’m sorry if I went a little too far there.  I really am!”  The nausea grew, becoming just this side of excruciating.  “In my own dumbass way, I was just trying to let you know that I’ve been in your situation and I’d be more than happy to-”\n“His pants were tight!”  Todoroki spit out, feeling the nausea recede.  “Midoriya was wearing these ridiculous pants that started clinging everywhere when he sweat, and…”  \nA palm swung up to stop Todoroki.  “Say no more.  We’re more than on the same wavelength.  Katsuki likes to wear these thin tank tops that really fuck me up.”  Kirishima sighed fondly.  “In a good way.”\nThe mirror, helpfully, supplied Todoroki with knowledge of just how lost he looked, and Kirishima blessedly took mercy.\n“I'm oversharing, aren't I?”  He scratched his neck sheepishly.  \nFlatly:  “Yes.”\n“That's my bad.  Again, I just want you to know that I've been there, and I get it.  I know you like Midoriya for way more than that sort of thing, don't worry.  Mind above the gutter, yeah?”\nTodoroki opened his mouth to demand how Kirshima had figured him out, to deflect, to agree - practically anything except what actually came out.  “Not all of the time, no.  I fantasize about Midoriya quite regularly, sometimes even in my dreams.”  \nOh god, oh hell no.  Why did he keep saying stuff like this, stuff that was way too...personal?  And true, disgustingly true.  Kirishima, bless him, just laughed awkwardly.\nTodoroki turned red and away from Kirishima, snatching up his things.  “I’m.  I'll be in my room.  Alright bye.”\nKirishima didn't even protest.\nOutside of the locker room, Todoroki collapsed against the wall, clutching his water bottle to his heaving chest.\nJust what - to reiterate - the actual fuck was going on?\n \n \n \nIt took two flights of stairs for Todoroki’s own post-workout stench to pierce through the cloud of mild panic surrounding his brain.\nIt took the next flight of stairs for Todoroki to decide that he didn't give a single shit, and that his one and only goal at this point was to retreat to safety of his room so he could think.\nOn the fourth flight of stairs, Todoroki finished the last of his water, throat clogged like a BP pipeline as embarrassment over his incident with Midoriya resurfaced.  He screwed the cap of his bottle back on clumsily.  Just focus on getting back.  \nOnly the fifth flight of stairs remained between Todoroki and victory when it was cruelly yanked out from under him, in the form of three chattering figures entering the stairwell.\n“- only has a shelf life of like a week, but he still ate the whole pack!  Oh, hey, Todoroki!”  Ashido greeted enthusiastically.\nRight behind Ashido, Uraraka waved with a friendly smile.  Tokoyami, somewhat unexpectedly, rounded out the trio, nodding cooly at Todoroki.\n“What incident has befallen your face, Todoroki?”\n“...Hello, Tokoyami.  And I got punched during training today.  Nothing exciting.”  The girls oooo’ed sympathetically.   Please just let me go, Todoroki prayed, eyes flickering nervously over the trio.  \n“So, Uraraka and I were having a debate, and we need your opinion.”\nTodoroki’s eyebrow twitched, ever so slightly.\nIf Ashido noticed, she didn’t care.  “Uraraka  here thinks - very sadly, in my opinion - that a Frosty is better than a McFlurry, and I need you to be the voice of reason here.”\n“Alright, let’s not get ahead of ourselves here…”  Uraraka countered, before Todoroki could even respond.  “I don’t appreciate the way that you just  assumed   Todoroki would choose the McFlurry, and how you  insinuated  that it was the ‘reasonable’ answer.”  Her voice raised with genuine conviction.  “Need I remind you that a Frosty is only 99 yen?!  Hell, you couldn’t find a better deal than that if you -”  \nThe doorway to the fifth floor taunted Todoroki as he tuned the conversation out; just mere meters away.  He even tried inching towards it, until Ashido grasped his forearm with surprising strength.\n“Please, Todoroki,”  her eyes blazed.  “You’re like, one of the smartest dudes in class.  Set the record straight, once and for all.”\nAshido’s grip tightened.  Todoroki frowned slightly.  “Why can’t you just ask Tokoyami?”  \nBoth girls scoffed in unison.  “As if!  That weirdo gets salads at fast food restaurants.”\n“I don’t enjoy grease,”  Tokoyami stated, arms folded primly.\n“See what we’re dealing with!  You gotta help us, Todoroki.  Which is better, the McFlurry or Frosty?”\nTodoroki opened his mouth, fully intent on just picking one at random and retreating upstairs, but what came out instead was:  “I have never had either.”\nTwin gasps echoed up the stairs.  Even Tokoyami appeared shocked.  “Todoroki, what kind of depraved life have you been leading?”\n“A lonely one,”  he blurted truthfully, yet again.  What is wrong with me?   He really needed time to think, not -\n“Todoroki, I vow to save you from your tragic depravity!”  Ashido declared passionately, clasping his hand.  \n- not this, this  tomfoolery.  Todoroki shook off Ashido’s grip.  “I’m afraid that I must decline.  “I’m…”\n ‘busy’.    Nope, the word refused to exit his mouth.    ‘tired’    and  ‘sick’   met a similar fate.  Todoroki startled as his left temple throbbed.\n“...sweaty,”  he finished quickly, lamely.  “I, um, still need to shower.”\n“We just learned that you’ve never had a McFlurry  or  Frosty, and your mind is on showering?”  Uraraka looked affronted.\n“Yes?”\n“Well, then, that’s just too bad.”  Uraraka crossed her arms resolutely.  “Because you’re gonna come join us on our fast food run, right now, and there’s nothing you can do about it.”\n“Besides instantly freeze all of us in place,”  Tokoyami muttered.  Uraraka glared at him.\n“No,”  Todoroki added more firmness to his voice.  “I’d really rather not, right now.  Besides, if I don't shower I'll gross people out.”\nAshido scoffed.  “As if  you could gross people out.  Besides, body odor is practically celebrated at fast food restaurants.”  She put her hands on her hips.  “Have you even had lunch today?”\n“...No.”\n“Aren’t you hungry, then?”\nOf course, Todoroki’s stomach took that precise moment to grumble loudly.  He sighed.  “Yes, I am.”  Damn traitorous organs.\n“Betrayal often comes from those closest to us, perhaps even from ourselves.”  Tokoyami noted, sagely.  \nAshido blinked.  “What?”\n“If we’re going to go, then let’s get on with it,”  Todoroki interjected.  Seeing no way out, he had no choice but to embrace his plight and adapt.  Now, his goal was expediency.  \nUraraka and Ashido cheered, grabbing Todoroki’s hands and dragging him down the stairs.  Tokoyami followed, murmuring something to himself about knives and backs.\n Just stay calm, Shouto.  It’ll all turn out fine.\n \n \nBlessedly, their destination was a mere five minute walk from campus, no trains required.  Todoroki felt relieved, especially considering the obnoxious passengers that morning.  And his captors had at least had the decency to let him drop off his bag in the men's community bathroom.  The sun warmed Todoroki's back pleasantly as he walked, and he inhaled deeply.\nIt was still a beautiful day, if nothing else.  \nUraraka traced his line of vision, landing on the feathery clouds.  She smiled.  “Do you like the summertime, Todoroki?”\n“I do.”  The sun broke from behind its cloudy gate, and Todoroki had to redirect his gaze to the road.  “A lot of people complain about the heat, but I can just keep myself comfortable with my quirk.”\n“That’s so awesome!  And so unfair!”  Ashido pouted.  \nTodoroki shrugged.\n“The only thing that makes life unfair is the delusion that it should be fair.”\nAshido rolled her eyes.  “Shut up, Tokoyami, you have a freaking invincible shadow bird living inside of you.”  \nDespite himself, Todoroki found a smile pushing at the corner of his lips.\n \n \nGolden arches cast an imposing shadow on the foursome, shimmering in the sunlight.\n“Oh, I understand now,”  Todoroki muttered, mostly to himself.  “The ‘Mc’ in McFlurry is a reference to McDonalds.”\nUraraka eyed him warily.  “I mean, yeah... How has someone as smart as you never put that together?”\nTodoroki hummed.  “Probably because I’ve never been to McDonald’s.”\n“WHAT?!”  \nThe synchronized shriek literally scared birds from their roosts on a telephone wire, wings flapping wildly.  A flight-type quirk suddenly seemed very appealing to Todoroki.\n“I said, I’ve never been to McDona-”\n“Yeah, yeah, we got that.”  Uraraka threw her hands up.  “How not, though?!  Were you raised under a rock?”\n“No.  I was raised in my home.”\nUraraka simply gaped at him.  \n“What a mad banquet of darkness,”  Tokoyami supplied.\n“Hey, now, we need to look at this as an opportunity!”  Ashido threw her arms over Uraraka’s and Todoroki’s shoulders convivially.  “We get to be the ones to see Mr. Blue Blood here pop his fast food cherry.”  Todoroki cringed at the comparison, shaking off Ashido’s embrace.  “Uraraka, Tokoyami, we have truly been blessed on this day.\"\n“You’re right!”  Uraraka smiled.  “Let’s go, then!  We should make Todoroki eat a McRib.”\n Blessed, huh?  Todoroki braced himself as they approached the restaurant, the vast unknown lying just behind smudged glass doors.  \n \n \nThe first thing to hit Todoroki was the smell, a pungent mix of delight and horror.  He could practically taste the grease in the air.  \n“So, Todoroki,”  Ashido nudged his side.  “First impressions?”\nMismatched eyes scanned the spectacle before him.  “The space is somewhat… cluttered, yet also efficient.  The smell is also quite thick.”\n“Ahh, that’s the golden aroma of their ‘World Famous Fries’.”  Uraraka clasped her chest.  “They’re heavenly.”\nA bold claim, certainly.  Todoroki turned his attention to the menu boards.  And was promptly stunned.  “Holy hell, everything is so cheap!\"\n“Wow, Todoroki, that might be the most emotion I’ve heard in your voice, like, ever,”  Ashido joked.\nUraraka was delighted.  “I know, right, Todoroki?  It’s perfect for a broke high school student like me.”\nTodoroki made a tactical decision not to mention his vast checking account.  \n“So, what do you think you’ll get?”\nTodoroki scanned the menu once more.  “I’m still deciding.”\n“Take your time,”  Ashido nodded reassuringly.  “Nobody’s first time should be rushed.”\n“Mine was,”  Tokoyami said, and was met with complete silence.  \n“I think I’m ready to order,”  Todoroki declared, strategically.\n \n \nUraraka ordered a Big Mac, a ‘splurge’ in her words, which made Todoroki even more secure in his decision not to draw attention to his finances.  Ashido took the road less travelled by ordering McNuggets, and Tokoyami remained true to his values by ordering a salad.  \nTodoroki stepped up to the counter, inexplicably nervous.  He had faced countless villains, defeated the infamous Hero Killer, even taken two freaking knives to the arm, yet here he was, stumbling over the order he had rehearsed seven times in his head.\n“A, um, quarter pounder with cheese.  Except, can I take off the onions, mustard, and onions?  Damn, I meant - ah shit, sorry, I didn’t mean to cuss.  And a small fountain frink -  drink  - please.”\nTodoroki wanted to die.  The cashier, a girl about his age with bright green eyes, smiled benevolently.  “Don’t worry about it.  So, no onion or mustard?”\n“Yes, please.  And no pickle.  Please.”  The girl’s nametag read ‘Suzuki’, decorated with little squiggles.\n“So demanding,”  she joked, eyeing Todoroki.  “But I can make it happen.  Has anybody ever told you that you have incredible eyes?”\nBehind him, Uraraka stopped munching on her fries.  “Yes,”  Todoroki replied.  “One of my doctors said heterochromia affects less than .67% of the population, so I was an ‘incredible’ case.”\nSuzuki giggled, much to Todoroki’s confusion.  He’d been serious.  “So, you’re quite a standout, huh?”  She leaned onto her cash register.\n“Statistically, yes.”  \n“Mmm,”  her green eyes flashed, and Todoroki found himself enjoying their color.  Old habits.   “What’re the odds of me getting your number, then?”\nTodoroki stared down at his order ticket, #73.  “I’d say 100%.  Don’t I need to give it to you to get my food?”\nAshido choked on her drink.  \n“Well, yes,”  Suzuki soldiered on.  “But I was more talking about your phone number.”\n“Oh.”  Green eyes occupied Todoroki’s attention again, but this time they didn’t belong to Suzuki.  “I’d, um, prefer not to.”  \n“Aw, damn,”  Suzuki sighed, but good-naturedly.  “I can’t say I'm surprised, though.  Already got a special somebody?”\nA spotlight may as well have been shone on Todoroki.  No signs of movement were evident behind Todoroki, and he could practically feel Uraraka, Ashido, and Tokoyami’s eyes on the back of his head.  \nTodoroki may not have any idea what the hell was going on, but he knew questions initiated what the kids called a Bad Time.  Sure enough, a godforsaken throbbing emerged in Todoroki’s temples, and he stiffened.\n“I, um.”  Todoroki unconsciously crumbled his order ticket in his fist.  “That depends on what you mean by ‘already got’.”\n“Ahh.”  Suzuki winced sympathetically.  “You stuck in the friend zone?”\nCrap, another question.  And a painful one, at that.  “It...seems that way,” Todoroki forced.\n“Well, I think they’re missing the hell out, whoever they are.  They must be crazy to pass up on a .67 in a hundred guy like you.”\nSuzuki was smiling, and the sincere kindness in her green eyes made Todoroki sigh -  a little close to home.  “‘Crazy’ isn't too far off, actually.”  Midoriya’s mad grin at their first sports festival flashed through Todoroki’s head, and fondness traced the fairest hint of a smile on his lips.  “Thanks.”  \n“No problem.”  Suzuki winked, and handed him a bag that was practically dripping with grease.  “Try not to get diabetes too quickly, now.”  \n \n \nUnexpectedly, Todoroki made it a solid four bites into his burger before the interrogation began.\nThe first introduced Todoroki to the surprisingly delicious taste of the famed Big Mac, and he give himself a split second to surrender himself to the lovely flavor of grease before switching gears to more pressing matters.  \nBite two was marked by the illumination of a mental lightbulb.  His inability to make excuses, his adverse reaction to avoiding questions...there was no way it was just coincidence, it  couldn't be.\nBy bite three, Todoroki was convinced - as crazy as it sounded - that he was unable to lie.  He didn't know how, or why, or even if his theory was correct, but the puzzle pieces seemed to point to that, if not a very similar, picture.  \nA picture where Todoroki was trapped with two talkative classmates and a shadow demon’s host in a fast food chain, unable to dodge questions or rely on trusty old Awkward Silence.\nBite four was quite hard to swallow.\nNow - cue the interrogation.  \n“Sooo, Todoroki…”  Ashido grinned, dangerously, and Todoroki could already hear the funeral bells.  “You like someone, huh?”\nHe forced his bite of burger down.  “Yes.  And wasn’t the whole point of this trip to make fun of my reaction to fast food or something?”\nYes, change the subject.  Easy.  He could do this.\n“Originally, yeah.”  Ashido leaned forward.  “But now, there are more pressing matters to attend to.”\nDamn, he couldn't do this.  \n“You mean you haven’t noticed before?”  Uraraka rolled her eyes.  “You just saw a perfect example of Todoroki’s social prowess, and you think he’d be able to hide a crush?”\nAshido burst out laughing, spewing bits of chicken nuggets.  “Oh my god, your little eye statistics.  My abs were  aching.”\n“I, too, felt I underwent a satisfactory abdominal workout.”  Tokoyami -  that traitor  - pitched in.  \nTodoroki frowned.  “I’m right here, you know.”\n“...No offense.”  Uraraka patted his arm.\n“Uraraka makes a good point.”  Tokoyami dapped at the ranch on his beak with a napkin.  “Todoroki does not interact naturally with people, like oil suspended in a sea of water.”\nThe burger in Todoroki’s hands sagged.\n“The both of you are right,”  Ashido nodded.  “Which is why we need to help him!  Todoroki, who do you like?”\nTodoroki panicked, dropping his burger with a wet flop.  Like hell he was going to tell this peanut gallery!  Knowing Ashido, she'd probably take it upon herself to lock Todoroki and Midoriya in a closet until they made out, or something.  A definite no-go.  \n“Someone in our class.”  Alright, no pain jumpkicked Todoroki’s skull - vague answers seemed to check out.\n“Well, duh.”  Ashido flapped her hand.  “Do you even keep up with anybody our age outside of U.A.?”\n“No.”\nWow, this quirk was kind of -\n“Any friends from childhood?”\n“...No.”\n-depressing.  \n“Oh, ok!”  Ashido tried to recover with forced enthusiasm.  “I'm glad that we get to be your first friends, then!  You've had fun, I hope?”  \n“Once I got past the initial awkwardness, yes, I have made several fond memories,”  Todoroki babbled, then inwardly groaned.  He was oversharing.  It must be part of the condition.\nUraraka raised an eyebrow.  “What initial awkwardness?”\n“During first year, I had absolutely no idea how to interact with people my age.  Once, I accidentally called Kouda ‘Gouda’, like the cheese, and I was too embarrassed to talk to him again for four months.  That's just one example.”  \n“Oh my god,”  Uraraka whispered.  “He always asked us if we thought that you were trying to intimidate him.”  \nTodoroki groaned - outwardly, this time.  “I'm the worst.  How am I ever supposed to become close with M- er, my crush if I can't even flirt with a random cashier?”\nHe didn't know why he was actively slapping his heart on his sleeve like this - maybe it had to do with his current predisposition towards honesty - but he allowed himself to continue.\n“I'm just, I never have any idea what the hell I’m doing, and they're so, so  incredible, so far out of my league that it’s laughable.  I don't even know how to begin.”  \nUraraka patted his shoulder.  “I can't be sure who you're talking about, Todoroki, but that cashier was right.  You can't sell yourself short.  And I don't just mean appearance-wise,”  she teased.\n“You'll always have good ole Twitter as a confidence booster,”  Ashido added, sagely.  \n“Inner beauty is great, but a little mascara never hurt.”\nTodoroki blinked.  “But I don't even wear make-up?”\n“I think,”  Uraraka chimed in,  “what Tokoyami was trying to say is that you're the whole package, Todoroki!  Whoever it is that you're interested in, you should tell them how you feel!”\n“Yes!”  Ashido balled a fist in conviction.  “Love is the spice of life!  What have you got to lose?”\n“A meaningful friendship, a large chunk of self-confidence, the relative ease of interaction between my crush and I, and a huge amount of sleep.”\n“Well, alright, it sounds pretty dismal when you put it that way.  But between you and me, Todoroki,”  Uraraka leaned over to whisper to Todoroki.  “If it’s a certain green-eyed dude with no sense of self-preservation like I think it is, then I wouldn't worry about it at all.  If I were you.”  \nTodoroki’s heart bungee jumped into his gut, springing back up into his throat.  “What?”  he choked.\n“You heard me,”  Uraraka smirked.\n“And I didn't!”  Ashido protested loudly.  “Secrets are no fair.  Right, Tokoyami?”  She grabbed his shoulders and started whispering obvious gibberish into the side of his head.  “Wait, do you even have ears?”\nTodoroki took in the scene absently, mind still hooked on the fact that Uraraka, one of Midoriya’s closest friends, felt confident that Midoriya, well...Todoroki wasn’t quite sure, actually, but it was definitely good news, no matter how vague.  Right?\n“So, Todoroki, how are you gonna confess?”  Ashido asked, yanking Todoroki’s attention back before he could delve too deep into fantasy over Uraraka’s words.  “Are you gonna go for a classic approach like a rooftop or just suddenly dip her into a kiss one day?”\nAnd just like that, Todoroki plunged neck deep into fantasy again.  “I, I.”  His ears burned.  “No, I'm not planning to do either.”  ‘Her’ , Ashido had said, and Todoroki deemed it in his best strategic interest to not correct her.     \n“Aww, boo.”  Ashido gave a thumbs down.  “And you still haven’t even told me who it is, which is a double boo.”\n“Let’s not boo Todoroki too harshly now,”  Uraraka - his beautiful, shining guardian angel - intervened.  “Not everybody likes to share like Kirishima.”\n“Bakuuu~”  Ashido crooned, and Tokoyami smiled into his salad.\n“Exactly.  So, for the sake of privacy, let’s call Todoroki’s mystery crush by a codename.  Like Toyota!”\nAnd just like that, the guardian angel lost her wings.  \n“Please, I’d rather not talk at all about...Toyota.”\n“They have excellent crash safety ratings,”  Tokoyami said.\n“The same can’t be said for Todoroki’s Toyota,”  Uraraka mumbled, and Todoroki glared at her. \n“I think this Toyota talk has been a long time coming, Todoroki.”  Ashido rested her chin in her hands.  “I mean, what was your plan?  Were you just gonna live your life infatuated with someone from the sidelines, staring at them longingly like some really cute outfit in a shop window that you know you’ll never be able to afford so you just cry in bed at night thinking about how great it would have looked on you?”\n“What a concise simile,”  Tokoyami sniped.\nTodoroki sighed.  “Yes.”  Because that was the truth, wasn't it?  If he kept going as he was, he and Midoriya’s fates were sealed as parallel rather than intertwined.  Somehow, admitting it out loud made Todoroki feel rather…\n“Lame.”  Ashido tutted.  “That’s pretty lame, dude.  No offense.”\n “None taken,”  Todoroki attempted, but the words wouldn’t come out.\n“I’m always happy to help!  If you want, I can lock you and Toyota in a storage room closet or something until you inevitably start making out.”\nAaand there it was.  \n“In my opinion, you should scribe this Toyota a heartfelt letter, spill your very soul onto the ink, and deliver it personally with care so that you may await their response with bated breath.”\nTodoroki relaxed a bit.  That scenario actually sounded quite pleasant, really.  “I’m grateful for the advice, Tokoyami.”\nTokoyami nodded.  “Of course, after receiving your joyous response, you shall then proceed to make out, passionately.”\n“Why is everyone so adamant that I make out with T...Toyota?!”  A nearby customer shot Todoroki a concerned look, and he debating sinking under the table.  \nUraraka laughed as Ashido grinned.  “Aww, Todoroki, you're blushing!  Thinking about swapping spit with Toyota?”\n“Yes!”  Todoroki croaked, and fuck his voice for cracking, honestly.  “And holding hands, and cuddling, and sparring until we fall on top of each other like always, but this time I’ll actually move forward and, um.  Nevermind.”\n“So you  have thought about it, after all?”  Ashido looked triumphant.\n“Of course I've thought about it.”  Todoroki’s voice softened.  “I've thought about it every night for nearly two years.”\nFor a few moments, Todoroki’s only response was the beeping of cash registers and whir of industrial air conditioning.\n“Two years?”  \nAnd if Uraraka had sounded incredulous, Todoroki couldn't find it in him to blame her, because it was kind of shocking, really.  Admitting aloud just how long he'd had feelings for Midoriya made it seem all the longer, all the more real.  “Yeah.  Pretty long, huh.”\nThe cash registers kept on beeping.  Todoroki sighed.  \nThen jumped out of his own skin when Ashido slammed her fist onto her plastic tray, voice raised in conviction.  “Then that's all the more reason to make a move!  You’re gonna go back to school, and you're gonna ask Toyota out!  Now, who are you?”\n“Todoroki Shouto,”  he whispered, still a little alarmed.\n“Nope, you gotta say it like you mean it.  Now, who are you?!”\n“...Todoroki Shouto!”  Another customer glared their way, and Todoroki shrank into his seat.\n“Damn straight you are!  And now that that's settled, the three of us are gonna help you make all your dreams come true.  Right?”\n“Right!”  Uraraka giggled.  Tokoyami inclined his head.  \nTodoroki felt embarrassed, helpless, and a tap on his shoulder as a girl with navy blue hair suddenly appeared at their table, with impressive stealth.  “Did you say that you're Todoroki Shouto?”\n“Hell yeah!”  Ashido exclaimed, still in motivation-mode as Todoroki confirmed his identity with a sinking feeling.  \n“Oh my god!”  Navy Hair squealed, and retreated to another table, chock-full of prepubescent girls.  She pointed in their direction, and a dissonant chorus of shrieks followed.\n“It’s time to go.”\nUraraka pouted.  “But we didn’t even get you a McFlurry-”\n\"Now.”\nWhen the gaggle of girls arrived at Todoroki’s table, their only greeting was three unused ketchup packets.\n \n \nThe walk home was marked by a tempest in Todoroki’s gut, and he wasn't sure how much he could blame on the Big Mac.\nAshido and Tokoyami occupied themselves arguing over the fine line between goth and scene, and Uraraka turned to face Todoroki, brown hair swaying.  \n“Is it nice to constantly run into hordes of fans?”\n“No.  In fact, their ever-increasing presence has put me on edge in public lately, and I get nervous.”\n“...Oh.”\nSilence reigned after that, excepting Ashido and Tokoyami’s heated debate, and Todoroki sighed into the warm air.  Christ, what a mess this whole impromptu affair had been, from the cashier, to customers likely thinking that Todoroki had a hard-on for his car, to Uraraka telling Todoroki not to worry about liking Midoriya.  \n Wait.  Todoroki stopped in his tracks, then zeroed in on the messenger herself, walking with her hands in her pockets.  \n“Uraraka,”  he called, jogging slightly to catch up.  “You remember what you said earlier about me not needing to worry about Midoriya?”\nShe twirled her hair with her pointer finger.  “Ah, yeah, I do.”\n“Is there any way you could explain what you meant?”  he asked, failing to tamp out an excited edge as his stupid, smitten brain began anticipating her response, jumping to conclusions.\n “Yes, of course, Todoroki!”   Dream Uraraka beamed.  “I was just saying that Midoriya is deeply in love with you and wants to date immediately and kiss in the locker room and let you play with his hair!” \nReal Uraraka opened her mouth.  Todoroki felt his chest flutter.  “Nope,”  she stated - simply, devastatingly.  \nTodoroki could practically hear his hopes shattering.\nUraraka must have heard it, too, because she smiled sympathetically.  “I'm sorry, Todoroki, but I made a promise that I fully intend to keep.  I’ve already run my mouth too much.  You’re a smart guy, though.  I’m 100% sure you’ll be able to work things out on your own.”  Her smile shifted into an encouraging one.\n“But-”  A buzz in Todoroki’s pocket cut him off, and he pulled out his phone.\n \n\n Midoriya Izuku: \n\n\n &gt;&gt;&gt;  how’s the face??? \n\n \nTodoroki kept his phone close to his chest, inexplicably nervous.  It buzzed again.\n \n\n &gt;&gt;&gt;  hopefully not too bruised to keep random hordes of girls from attacking \n\n\n &gt;&gt;&gt; or maybe thats a good thing ? \n\n \n“What’s got you all smiley, Todor- oh my god.”  Ashido peered at the phone cradled against his chest and broke out into a dangerous grin.  Suddenly, his nerves didn’t seem so inexplicable anymore.  “You’re texting Toyota, aren’t you?”\nShit.  Todoroki may just end up shoved into a closet with Midoriya, yet.  “..Yeah.”\nBefore Todoroki could even react, Tokoyami appeared out of genuine fucking nowhere beside Todoroki.  “It’s Midoriya Izuku,”  he reported, straightlaced, straightforward, straight to the point.  \nThe common syllable, of course, being in direct opposition to a certain Todoroki Tidbit that had just been exposed to an incredulous Ashido, her black eyes popping.\n“No freaking way…”  She abandoned Uraraka to join Tokoyami beside Todoroki.  “Holy shit,”  she whispered, eyes glued to the phone.  “I’ve been such a fool - I don’t know how I didn’t see it.  The gym fire makes so much sense now!”\n“The important thing is that nobody got hurt!”  Uraraka piped up, across from the three of them.\n“Let’s really not talk about that, please.”\n“You’re right, Todoroki, there are more important things to attend to.  Like the fact that the Twitter heartthrob himself bats for the other team.  I think we should take a moment of silence for all the broken hearts of Todoroki’s fangirls,”  Ashido stated solemnly.\nTokoyami bowed his head in respect.  Uraraka missed the entire point by laughing.\nAnd Todoroki just stood helplessly, the conversation completely out of his control.\nThen leapt out of his skin when his phone was swiftly swiped from his hand, Ashido whooping victoriously.  \n“I’m gonna text him~”  she sang, and fear drenched Todoroki’s very core.  \n“Don’t,” he pled, desperately.\n“Do,” she retorted, mercilessly.  “Now which pickup line should I send him: the appendix one or the bandaid one?”\n“I enjoy the appendix one,”  Tokoyami voted, and Todoroki knew it was only a matter of seconds before his most valued friendship lay in shambles.  It was pure adrenaline, then, that made him lunge.  Pure survival instinct that made him grab for the phone, right as Ashido was typing.\nAshido -  damn her  - dodged, holding the phone behind her back and cackling.  Todoroki lunged again, seemingly to the right, but then changing to the left at the last moment.  With a loud smack, he took hold of the top of the phone.\n“That was a well-executed feint,”  Tokoyami praised.\nThe perpetrator squawked, but maintained her grip.  Todoroki yanked at the device - Christ, was Uraraka literally on the ground laughing in the background? - yanked with all his might.\n“I’m trying to help you!”  Ashido gasped, eyes twinkling a bit too much for her intentions to be merely altruistic.\n“And I don’t want to be helped by talking like Kaminari!”  \nAshido snorted at that, losing focus just enough for Todoroki to concentrate all his strength into one final tug.  \nThe phone - he’d gotten it back!  Todoroki released a huge sigh of relief and stuffed it into his pocket.\nThen stiffened as a muffled, disembodied voice trickled from his pocket.  “Hello?” \nSwearing under his breath, Todoroki pulled out the godforsaken device.  A full-screen photo of a smiling Midoriya affronted him, along with the knowledge that he must have accidentally dialed Midoriya up during his struggle with Ashido.\nFucking  hell, couldn’t the universe cut him a single break?!\n“Shouto?  Are you there?”\n“Yep!”  His voice squeaked out on the wrong side of puberty, and Uraraka fell back down onto the street.\n “Shouto?”   Ashido mouthed, waggling her eyebrows suggestively.  Todoroki’s cheeks glowed red.  Of course they’d be able to hear Midoriya talking.\n“Oh alright!  It seemed like you may have called on accident.”\n“Oh yeah.  That’s because I did.”\n“Oh, haha.”\n“Ha, yeah.”\nTodoroki stood there awkwardly, toeing at the road.  \n“What inspiring dialogue,”  Tokoyami deadpanned.\n“For real, dude, this is horrible,”  Ashido whispered fiercely.  “Say something funny.  Flirt!”\nAs if he could  ever pull that off.  Todoroki consulted the asphalt, mind coming up blank.  “So, uh, do you prefer a Frosty or McFlurry?”\nOh god, he instantly regretted that one.  Uraraka, who had only just stood back up, collapsed against a (rightfully) unimpressed Ashido, shaking violently.  \n“Probably a Frosty.  They’re cheaper.”  From her slump on top of Ashido, Uraraka fist pumped.  “What about you?”\n“I’ve actually never had either.”\n“Oh!  Haha, that’s too bad.  To be honest though, I can’t really remember the last time I had either.”\n“Ask him on a date!!”  Ashido whisper-yelled.\nTokoyami nodded.  “A perfect tactical opening.”\nBut instead of doing just that, of following perhaps the only sound advice he’d been offered all day, Todoroki glared and covered his free ear.  He’d had it to hell and back with making a fool of himself publicly.\n“I know, I know, the tragedy must have shocked you into silence,”  Midoriya joked, and Todoroki felt fuzzy.\n“Ah, not quite.”\nMidoriya laughed.  The fuzziness increased.  “That’s cold.”\nForgetting his audience, Todoroki hummed.  “Maybe, sometimes cold is a good thing.”\nA muffled cough echoed through the receiver.  “Of course I like - I mean, cold things are awesome.  And hot things too!  Like, uh, I enjoy the winter and summer a lot separately, so if they came together or something it would be amazing.  Yep.”\n“You’re so in there,”  Ashido giggled.\n“Very much so,”  Tokoyami agreed, and Uraraka flashed the OK gesture with a huge grin.  \nTodoroki’s face blazed even brighter.  It was high time to end this call before he slipped up again.\n“Alright, well I think I’m going to go now.  Sorry for bothering you.”\n“You never bother me, Shouto,”  Midoriya’s voice crackled cheerfully, and Ashido awww’ed.  “Seeya later!”\n“Bye, love you.”  Todoroki hung up calmly.\n...\n...\nThen promptly dropped his phone, swaying violently on his feet.  \nDark Shadow instantly darted out to catch the phone, and Todoroki would’ve been grateful if it wasn’t for the tiny little fact that his entire world had just ended.  \n“Oh my god,”  he whispered distantly.  \nNearly instantly, his phone buzzed again, and when Todoroki made no move to take it, to react in any way, to continue living, Uraraka grabbed it herself.\n“Oh my god,”  he repeated.  Even Dark Shadow seemed to be cringing in secondhand embarrassment.  \n“Deku wants to, uh,”  Uraraka spoke softly, like a paramedic to a victim in shock.  “He wants to know if you said that by accident.”  Then, more to herself.  “He’s probably halfway to actual physical combustion.”\n“Oh my  god.”  Todoroki swayed again, still a little hung up on the most mortifying blunder in his entire life.  This made the gym fire look like Sunday brunch.  “I just, I just told Midoriya that I’m in love with him.  Then hung up.”\n“The instant hang up was a little cruel.  Although I guess I have to respect just going for it like that.  Even if it wasn’t romantic at all.  Like, at  all.” \nTodoroki faced Ashido with panicked eyes.  “I didn’t mean to say it!  It, it was just on my mind and it slipped out on its own and…”\n Wait.  A predilection to say what he was thinking…\n“Fuck,”  he groaned, with real feeling.  \nMeanwhile, Uraraka’s own phone began buzzing up a storm, and she raised her eyebrows as she scanned the messages.  “You really should explain yourself, Todoroki.  Before cardiac arrest comes into play.”\nShit, she was right.  Numbly, he took back his phone and opened his text window with Midoriya.\n \n\n &gt;&gt;&gt;  hey did i hear u wrong or did u just say ‘love u’ hahahahahah \n\n\n &gt;&gt;&gt;  thats pretty funny dude, A+ joke, 10/10, top of the line there buddy \n\n\n &gt;&gt;&gt;  it was just like by habit right??  Right????? \n\n\n &gt;&gt;&gt;  once i called all might Dad ahahahancxknvkvnxd can u believe it??  hes not actually my dad !!1!  crazy! \n\nThen, curiously, a message of all blank spaces.\n\n &gt;&gt;&gt;  I’m sorry about those prior messages, Shouto!  I’d appreciate it greatly if you disregarded them :)  Thank you! \n\n \n“I need to change schools,”   Todoroki croaked, shriveling inside.  Why, oh why hadn’t he just stuck with the appendix pickup line?\n“Before you do that, though, could you please text Deku back?”  Uraraka glanced at her phone.  “Thank god I paid for unlimited messages...”\n“What should I say?!  ‘Oh hey Midoriya, it’s Todoroki.  I know I just accidentally admitted that I’m in love with you, but have you done the homework for Monday?’”\n“Is an unfortunate Freudian slip really the manner in which you want to reveal your feelings?”  Tokoyami raised an eyebrow.\n“Of course not!”  Todoroki scrambled to find the words.  “Midoriya - he deserves the world.  Or at least a goddamn bouquet.  Anything but this.”\n“Then brush this off as an accident - as it genuinely was - move on, and focus on crafting a confession you deem worthy of Midoriya.”\n“And my closet offer still stands, by the way,”  Ashido added, effectively squelching the composure Todoroki had gained from Tokoyami’s words.  \nDrawing a deep breath, he unlocked his phone.  There was no need in prolonging the inevitable.  \n \n&lt;&lt;&lt;   I’m sorry for not replying until now \n\n &lt;&lt;&lt;  I didn’t intend to say... what I said \n\n\n &lt;&lt;&lt;  like you guessed, it was an accident, and quite an embarrassing one \n\n\n &lt;&lt;&lt;  I apologize for any confusion.\n\n \n“Goddamn, Todoroki, you’re texting a friend, not drafting a business email.”\nTodoroki ignored Ashido and opened Midoriya’s near-instant reply.\n \n&gt;&gt;&gt;   oh haha thats what i thought! \n\n &gt;&gt;&gt;  dont worry about it dude, no big deal :D \n\n \nTodoroki shoved his phone back into his pocket, and began making his unsteady way back towards campus.  \nUraraka’s phone buzzed the entire way.  \n \n \nTwenty minutes later, Todoroki sped through his long-awaited shower, that disastrous “love you”  looping endlessly through his mind.  He shampooed with much more vigor than necessary.\nTwenty five minutes later, Todoroki received a text from Uraraka.\n \n&gt;&gt;&gt;   your ass is lucky that i also upgraded to unlimited minutes \n \n  \nThirty minutes later, Kouda was surprised to discover the men’s bathing facility practically dripping with steam, and a thick slush of ice coating the bottom of one of the showers.\n \n \n \n \nIt wasn’t easy to stop thinking about the phone call.\nSo not easy, in fact, that after his body more or less shutting down in what Todoroki retroactively dubbed a ‘panic-nap’, he spent the better part of an hour wallowing in a pool of self-reproach.  His dorm alternated between a freezer and sauna as he laid with his face buried in his pillow.\n“Oh my  god  ,”  he groaned for the eighteenth time.  His pillow offered no response but to slightly dampen from saliva.  A pillow not entirely already un-moist, by the way, largely thanks to the panic-nap.  I'm so disgusting.   \nTodoroki executed a perfect swan dive even deeper into self-reproach.\nBut as inviting as the water may be, and no matter how much Todoroki may have wanted to swan dive off a more lofty and non-metaphorical surface, he had to focus on the task at hand.\nJust what in the name of all things good and pure was happening to him?\nTodoroki glared at his ceiling harshly as he racked his brains for some explanation,  any  explanation for his extended Honesty Hour.  \nCould it really be the work of a quirk, or was it somehow physiological?  Was it possible he’d actually gotten a concussion when Midoriya hit him, and his psyche had brought on some weird self-afflicted psychosomatic condition?  That was  really  far fetched.    \nA quirk, then?  Much more probable, Todoroki thought.  Again, questions definitely seemed involved, but the damage extended beyond just queries.  Not quite like Shinsou’s quirk at all.  And how the hell had he ended up under the influence of such a quirk?  Todoroki balled fists into the hem of his tank top in frustration.  \n Come on, Shouto, think!   Todoroki screwed his eyes shut in concentration.  Maybe he should retrace his steps for the day?\nAlright.  So, he had left campus around 8:00 to head to the hospital.  Nothing abnormal there.\nNext, he had splurged on fried rice from a street vendor across from the hospital.  Todoroki frowned.  Could that be it, some weird contamination in the food, or the ill will of the vendor?  That didn’t seem very likely.  Ah, well, he’d keep going for now.  \nAfter that, the hospital.  He hadn’t noticed anything odd there, either, only coming into contact with his mother and the receptionist.  \nFinally, the train ride back.  Oh yeah, that couple had been arguing.  What had the woman said..?\nA knock shattered Todoroki’s concentration, and he groaned inwardly.  “Who is it?” he called, trying his best to keep the edge of irritation from his voice.  \n“It’s Midoriya!”  the muffled voice replied.  “I, um, wanted to check and see how you’re doing!”\nPanic struck a chord in Todoroki.\n “Love you.”   The phone slipping from his hand.  Dark Shadow wincing.  Uraraka’s unlimited messages - oh god, the images were looping again like a goddamn clip show.  \nPanic struck a whole goddamn concerto in Todoroki.  \nA second knock - much more timid - echoed from the door.  “Do you want- should I leave you alone?”\nAnd fucking hell, goddammit, screw Midoriya for that tinge of hurt coloring his question, the way his concern for Todoroki was so blatant.\nThe way that Todoroki found himself calling out, “No, you shouldn't,” and reaching for the door to swing it open.  \nIt was beyond a shadow of a doubt that at this point, any and all interaction with Midoriya was a definite recipe for disaster.  The clear best plan of action was to have a quick little chat with Midoriya to assure him everything was A-Ok, peachy keen!,  and to get him to stop worrying about Todoroki.  To stop looking up at Todoroki with those huge green eyes, to stop calling Todoroki by his first name to make him feel better, to stop hugging Todoroki, the boy’s warmth seeping into Todoroki’s skin.  \n...Dammit.  \nNonetheless, the plan remained intact.\nResolute, Todoroki flung open the door.  Get rid of Midoriya quickly - easy.\nTodoroki was not prepared for the sight that greeted him.  ‘Easy’ began passing the baton to ‘hard’, in more ways than one.  \nThere stood Midoriya, with that gorgeous smile of his firing on all cylinders, apparently fresh from a shower - honestly, why did the Universe choose  now  of all times to grant Todoroki this gift?  He needed to focus.  \nMidoriya smelled fucking  incredible, and his dark hair clung to the back of his neck.\n‘Focus’?  Ha, good joke, Todoroki. \n“Hey,” Todoroki’s voice cracked slightly - was this the 'Todoroki Charm' Ashido had mentioned?  He noted that the material of Midoriya’s t-shirt fell on the thin end of the spectrum, and that such criminal indecency should definitely be against dorm dress codes.  Much too distracting.   \n“So, uh,” Midoriya fiddled with the hem of his immoral shirt.  “Uraraka told me you got McDonald’s with her and Ashido and Tokoyami.  Sounds fun.”\nTodoroki opted for a mere nod, strategically avoiding speech.  The elephant in the room was stomping all over his composure as it was - no need to bring dubious vocal chords into the equation.  \nMidoriya seemed similarly accosted by the pachyderm, squirming where he stood.  “Is that, were they gonna make you try a McFlurry?”\n“Yep.”\n“Oh.  That's totally something they would do.”\n“Yeah.”\nSilence.  Awkwardness practically dripped from the ceiling.  \nMidoriya’s brows knit.  “I didn’t know you’d never had fast food before!  If I had, I totally would’ve taken you out.”\nThe door knob squealed as Todoroki tightened his grip, and Midoriya’s eyes popped.  “N-not like,  take you out  take you out, you know?  Just, like, us going out to eat together!  Crap, that still sounds-”\n“It’s alright, I know what you meant.”  Todoroki more than knew better.  He ushered Midoriya in - they may as well walk on the eggshells fully inside of the room.\n“Haha, yeah.”  Midoriya tugged at his shirt again, flashing a bit of collarbone.  Todoroki bit the inside of his cheek and looked away.  “Well, uh, did you enjoy it?  The fast food, I mean.”\n“Yes, actually.  In fact, I was enjoying myself much more than I expected until I.  I.”  \nShit.  With a parting victorious trumpet, the elephant vanished, clogging the atmosphere with awkwardness in its wake.  \n“...I said, the.  Thing.”  Todoroki finished - completely unnecessarily, he might add, because Midoriya was already trying his damndest to bore a hole into Todoroki’s floor with the strength of eyesight alone.\n“Ah,”  he said, for absolutely no good reason at all.  Was it just Todoroki, or was his breathing disgustingly loud?\n“D-don't worry about it, really!”  Midoriya exclaimed suddenly, too loud, tearing his eyes from the floor.  “I’m sure tons of people have done that at some point or another and, and I know it was a c-complete accident and you didn't really mean it hahah of course it was a huge accident - nothing else -, and it's really not a big deal and also you still might be a little dinged up from earlier today and oh!  That reminds me.”\nHow Midoriya managed to get that out all in one breath was truly beyond Todoroki, but he found himself rather unable to ponder logistics as Midoriya grabbed Todoroki’s forearm and led him to his bed, pushing down gently on Todoroki’s shoulders so that he sat.\nThe atmosphere clogged further.  \n“I wanna check you for concussion symptoms!  Nothing fancy, obviously, but Recovery Girl is out of town and you probably wouldn't see a nurse anyways - don't give me that look, I know what you're like - so the least I can do is make sure that I didn't screw up too bad and hurt you for real.”\nA self-deprecating smile wobbled across Midoriya’s face, and that was really quite unacceptable, so Todoroki forced his best attempt at an encouraging smile.\n“That's a great idea, Izuku.”\nThe air must have been thick for Midoriya, too, because he coughed suddenly before clearing his throat.  “I, hah, well, I guess that answers the first question.  You know who I am.”\n“How could I forgot,”  Todoroki murmured, because his brain apparently had checked out for shore leave this morning, and Midoriya coughed again.\n“S-so the next question is, is it before or after lunch right now?”\n“After.”\n“Correct.  What city are we in?”\n“Musutafu.”\n“Correct!  Who in our class single-handedly inspired a subconscious boycott of all grape products?”\n“Mineta.”\n“Correct!”  Midoriya laughed.  “Have you ever thought about going on Jeopardy?”\n“I don't know what that is.”\n“You don't know what - nevermind, we’ll tackle that later.  When is your birthday?”\n“January 11.”\n“Correct,”  Midoriya nodded, and Todoroki’s chest pattered dangerously at the knowledge that Midoriya knew his birthday.  \n“What year are you?”\n“Third.”\n“Uh huh.  How many times has Kaminari managed to fail at basic laundry and shrunk his uniform?”\n“If I remember correctly, seven,” Todoroki responded, willfully suppressing the urge to admit that he'd done the exact same thing four times.  \n“Wait, how did you even know that?”\n“Yaoyorozu complained to me because Kaminari kept asking her to create replacements.”\n“Ahh.”  Midoriya grinned.  “You know way more than I do.  Not that that's surprising.  Now, what day is it?”\n“The most embarrassing day of my life.”\nThe Todoroki Charm was really outdoing itself today, huh.\n“Oh.”  Midoriya’s voice came out too high.  “I more meant like the day of the week.”\n“...Saturday.”\n“C-correct!”\nMidoriya coughed yet again.  Todoroki's chest shriveled.     \n“Well, um, I guess that’s about it for the questions.”  Midoriya sat down next to Todoroki, the mattress dipping.  “Can I - is it alright if I touch you?”\n“Yes,” Todoroki breathed, more reflexively than anything, the greater part of his brain struggling to keep Midoriya’s question firmly within context.\nMidoriya scooted closer and brushed his fingertips against Todoroki’s temples, gently - too gently.  Todoroki sucked in a breath and kept it there, balled up safely in the back of his throat.\n“S-so, I’m gonna go over the areas that are typically sensitive, and if the contact is ever painful, tell me when.  Sound good?”  \nMidoriya’s breath ghosted over Todoroki’s face, threatening to leave a blush in its wake.  Todoroki slid his eyes shut - his only measure of defense.  “Sounds great.”\nSo Midoriya began his ministrations, his touch gliding over Todoroki’s skin in a manner dangerously close to Caress territory.  God, another  “love you”  was taking a battering ram to Todoroki’s carefully sealed lips.\nSunlight from the window painted the inside of Todoroi’s eyelids a muted red.  He breathed through his nose.\n“McDonald’s, huh.”  Midoriya spoke suddenly, still gently rubbing at Todoroki’s temples.\nTodoroki didn’t have a good response, so he didn’t give any.\n“You guys, uh.  It sounded like a fun group.  I mean, obviously Uraraka’s great, and Tokoyami always, er, offers an interesting perspective, to say the least.  Uraraka has a theory that he owns every MCR album.  She also thinks the moon landing was faked, so I don’t know how much I trust her conspiracies.”\nEven with his eyes closed, Todoroki could spot the fondness in Midoriya’s words.  He schooled his expression into one of complete indifference.  No traces of a certain emotion that shall not be named, no sir.\n“Ashido, too,”  Midoriya continued, voice quieter.  “She’s always fun.”\nThe Emotion pressed against Todoroki’s insides like a balloon fit to burst.\n“I feel like class wouldn't be half as fun without her.  We can thank her for the whole ‘Bakuu’ thing, you know.”  Gnarled hands stilled.  “And, um.  She’s really pretty too, huh?”\nJealousy, goddammit - it was jealousy that nearly drew a deep wrinkle between Todoroki’s brows, his eyes now more screwed shut than pleasantly lidded.\nBut no.  No.  So what, Midoriya found girls pretty?  So what, if his heart felt recently shanked?  Get over yourself, Shouto.  It's not like this was news, not by a long shot.  He had obviously read too far into Uraraka’s vague comment.  Stupid; typical.\n“She is,”  he answered.  While it was a subject he had never spared much thought toward, the girl really did have a nice smile, in an objective sort of way.  And Todoroki was a sucker for huge smiles.  “She’s always very cheerful, too.”\n“Yeah,”  Midoriya said, and speaking of ‘cheerful’, the boy sounded decidedly not so.  Midoriya began probing Todoroki’s skull again.  The air between them grew stale.\nTodoroki must have screwed up somehow.  Was Midoriya somehow able to sense his jealousy?  God, leave it to Todoroki to botch a social interaction so badly.\nMidoriya paused.  “Did that hurt?”\nHe must have sighed.  Or grimaced.  Or both.  “No.”\nIn response, Midoriya kept silently stroking.\nHis breath resumed its puffing across Todoroki’s cheeks, the bridge of his nose.  Todoroki’s eyelids relaxed.  \nMoving further back along Todoroki’s head, Midoriya gently carded bicolored bangs to the side, tugging softly at the strands of hair.   The Caress territorial borders crumbled further.\nAnd Todoroki, Todoroki’s heart jettisoned right into his throat.  “We should go to McDonald’s sometime!”\nAnd what the fuck, honestly, because Todoroki definitely hadn’t expected his mouth to say that, nor his heart to confirm that he meant it, nor - least of all - Midoriya to burst into a peal of laughter, his breath bursting merrily across Todoroki’s face.  \nIt was then that Todoroki made the fatal mistake of opening his eyes, of subjecting himself to an unobstructed, unprotected, unwarned viewing of the loveliest of smiles, Midoriya’s eyes crinkling at the corners.  And fuck, his fingers were still buried in Todoroki’s bangs, and his nose was lightly dusted in pink, his freckles standing out proudly, and Todoroki  really should've kept his eyes closed.\n“I'd like that,”  Midoriya said, lips moving hypnotically around the words, lips that were filling every inch of Todoroki’s attention, lips that were quite pink and rather soft-looking.  \n“Oh no, did I press too hard?”  Midoriya’s smile dropped in concern.\nChrist, Todoroki really had to work on containing his wistful sighs.  And containing himself, in general.  This situation was simply a friend looking out for another friend - probably more guilt-inspired than anything else - and nothing more.  Period.  “No.  Just fine.”\n“In that case, I think you check out!  At least according to Web MD’s test.  Of course, the most important information is from you.  How do  you feel - any better?”\n“Yeah, I do.  I slept for a bit, which seemed to help.  I was really freaked out during that workout, though.”\n“Me too!  It was really scary - I was so worried about you!  And I still feel horrible about decking you.  I’m really really sorry!”  Midoriya bit his lip, and Todoroki tried not to stare.  “But it’s good that you slept!  I, for one, love sleeping.”\nSome puzzle piece clicked into place in the back of Todoroki’s mind at Midoriya’s statement.  Something that he  should've been thinking about this whole time, instead of constantly one-upping how much of a fool he could make of himself.  Something about loving sleep... Wait, hadn’t that Mitsubishi lady said the same thing?  And then, after that...\n“Damn, I really am the worst,”  Midoriya lamented, eyeing Todoroki’s various bruises from their spar.  “Your jaw is gonna look like a grapefruit.  I don’t remember leaving this one, though.”  Midoriya pointed to light scratch marks decorating Todoroki’s bare shoulder.  \nThat couple’s argument... the pure dread on Subaru’s face... the jab of Mitsubishi’s nails into Todoroki’s shoulder... Mitsubishi’s dismay afterwards... and finally, Todoroki’s inability to dodge questions or make excuses.\n\n “Fuck, did it activate?” \n\nThe revelation sucker punched Todoroki right in the gut.  \nIt was the work of a quirk, after all!   Mitsubishi’s  quirk, to be specific…  A quirk that Todoroki had literally no information on.  The weight of Midoriya’s presence struck Todoroki once more, a bowling ball of trepidation.\n“Fuck,” Todoroki whispered, with real feeling.  \nMidoriya’s nose scrunched in confusion, but then he just laughed.  “‘Fuck’ is right.  You’ve been through a lot today.  I’m just glad you’re feeling better!”  \nTodoroki forced a weak nod, his mind racing.  How long does the quirk last?  Would Mr. Aizawa be able to erase it, or does it only work if he looks at the original quirk owner?  What kind of -\n“Hey, Shouto,”  Midoriya said, fidgeting with his shirt further, triggering klaxons in Todoroki’s turbulent thoughts.  Distracting! \nTodoroki straightened, then downright startled as Midoriya began tracing the scratches on Todoroki’s shoulder lightly, green eyes trained on the tatami mats.  “I just... You know that I consider you a good friend, right?”\n“Yes,” Todoroki croaked, the klaxons screeching at maximum capacity as every single neuron in his brain zeroed in on the sensation of Midoriya’s fingers on his skin once more.  \n“Well, as my good friend, I, um,”  Midoriya clasped his other hand to his chest, catching Todoroki’s gaze.  “I j-just really, really care about you, okay?  And seeing you in so much pain today, I- I- it was really horrible.  So if I can do anything to cheer you up, or if you ever need me for anything, please, just let me know!”  \nTodoroki nodded distantly, a little bit completely lost in the green of Midoriya’s eyes.  \n“I, um, that’s all I wanted to say!”  Midoriya removed his fingers from Todoroki’s shoulder, leaving the skin feeling barren.  “Sorry for being so melodramatic.”\n“Please don’t apologize.  It...means a lot.  Izuku.”  Todoroki smiled, then wore a hint of a smirk.  “Besides, we both know that Aoyama is the real drama queen of the class, not you.  So don’t even try challenging his throne.”\nMidoriya laughed, scratching the back of his head, his bicep flexing in a way that could only be described as  unfair.  A droplet from his damp hair wound down the boy’s neck, continuing on to his collarbone and finally disappearing under the collar of Midoriya’s shirt.  Had Todoroki mentioned how this was unfair?  \nGod, he wanted to kiss that boy so bad.  But he  couldn’t, couldn’t betray Midoriya like that.  Midoriya, who exemplified everything it meant to be a hero, who thought Ashido was pretty, who had just called Todoroki his ‘good friend’, for God’s sake.  Todoroki  couldn’t  make Midoriya uncomfortable with his own feelings, couldn’t saddle Midoriya with the awkwardness and guilt that would result from him inevitably turning Todoroki down.  Todoroki  had to resist.\nBut damn, that didn’t mean it was easy.  Especially when Midoriya’s tan skin was so easily within reach, and when that droplet was probably still making its merry way downward, from Midoriya’s chest to his stomach to his...    \nThat was the nail in the coffin.  Todoroki felt a flush rise to his face.  Please don’t let Midoriya notice.\nMidoriya noticed.  “Uh, Shouto, why are you glaring at me like that?”\n“I-”  Todoroki began to lie, until a now-identified tweak of nausea hit him.  “I--”  Todoroki grit his teeth, and glared daggers into the wall behind Midoriya.  Could he somehow resist it?  Mind over matter, right?  \nThe inside of Todoroki’s skull promptly impersonated a firecracker.  Shit.  He had to answer Midoriya and expose himself for the creep he was, all in one fell swoop.  Todoroki grimaced.  Goodbye, friendship.  It had been absolutely divine while it lasted.  “Because you’re very attractive.”\nThree seconds passed.  Then Midoriya’s face flushed the brightest red Todoroki had ever seen.  “I, I, I,” he stammered, and Todoroki legitimately contemplated throwing himself out the window.  He could definitely survive it.\nMidoriya bit his lip again ( unfair! ), stood, and took a shaky step back towards the door, hand scrambling blindly for the handle.  “T-thank you, Shouto.  That’s very kind of - thank you!  Yes.  I, uh, I think I’m going to leave now.”\nMidoriya swung around and grabbed the door handle.  Todoroki absently noted that Midoriya’s blush reached the back of his neck.\n\n I want to die.\n\nBefore he left, though, Midoriya paused, still facing the door.  “Just, uh.  You should know, Shouto, that uh.  You’re v-very.  Like, right now you have that huge bruise, b-but your face it’s, is still very nice also.  Even with a thousand bruises you, you’d still, um.  Really very nice.”  His neck flared even brighter.  “Oh my god I can’t believe I ju - goodbye.”\nThe door clicked shut.\nTodoroki shut down.  \nAnd simply sat there, quite unable to even begin deciphering Midoriya’s words.  If there was even anything to decipher in the first place - Midoriya tended to ramble senselessly when nervous.  \nOh god, he had made Midoriya  nervous.  Some ‘good friend’ he was, hitting so creepily on the guy who had just sacrificed his own free time to help Todoroki that Midoriya had resorted to his go-to anxious tick.  \nWas it possible to stay curled up in the fetal position on his bed forever?\n....\nFive minutes later, no less than six exasperated texts from Uraraka blinked cheerfully across Todoroki’s home screen.   \n \n \nBy this point, Todoroki had more or less perfected what he called the “shag approach” - that is, forcefully sweeping all traumatic and/or paradigm-shifting events under a mental rug until an appropriate time.\nWhy shag?  Because Todorki’s mental image of a rug happened to be just that.  It definitely wasn’t related to a more British flavor of shag, no sir.  No matter how attractive Todoroki may find Midoriya’s spoken English.\nAaand he was back to the fifth shag approach of the last couple minutes, forcing his eyes to focus on his notebook.  \nFour literal flow charts were scribbled on the paper.  After much deliberation, Todoroki had decided that his best course of option was to visit Aizawa.  It seemed unlikely that the man would be able to erase the quirk without the presence of Mitsubishi herself, but it was worth a shot.  \nMind made up, Todoroki stepped into the hallway cautiously, still wary of his stomach spontaneously cartwheeling at any moment.  He didn’t know the specifics of this truth quirk by any means.  \nAs he rounded the corner of the hallway, he saw Asui heading towards the stairs, also.  Damn.  He’d been hoping to avoid another McDonald’s situation at all costs.\nShe paused at the door, holding it open for Todoroki.  “Hello, Todoroki!  Goodness, what happened to your jaw?”\nHe reflexively reached up to trace it.  “Midoriya and I were training this morning and he accidentally socked it a little too hard.”\nAsui nodded sympathetically.  “I’m sorry to hear that.  Are you feeling alright?”\nTodoroki flinched.  “I’m...anxious.”  \n“Anxious?”  Asui closed the door softly, effectively trapping Todoroki in the hallway.  Wonderful!   “Is there some big test coming up that I’ve somehow forgotten about?”\nDespite his situation, Todoroki let out an amused huff.  “No.  Or at least if there is, then I’m in the same boat as you.”\n“A sinking boat,”  Asui joked, blinking owlishly.  “If it’s not school, then what has you anxious?  If you don’t mind me asking.”\nAt this point, it didn’t really matter whether Todoroki minded or not.  He sighed.  He really hadn’t wanted news of his dilemma to get out, especially so soon.  “I think that I’m under the influence of a, um, frustrating quirk.”\nAsui’s eyes widened.  Please don’t ask what type of quirk, Todoroki plead inwardly.\n“What type of quirk?”  Asui asked.\nTodoroki winced.  “A truth telling quirk.”  \nA shocked ribbit echoed in the hallway.  “A truth telling quirk, Todoroki?  That really is frustrating.  How in the world did you manage to end up with that?”\n“It’s a long story,”  Todoroki replied without thinking, and was surprised to discover that it apparently passed the quirk’s requirements.  \n“I see,”  Asui nodded.  “I can stop asking about it, if you’d like.”  \nBefore he immediately took Asui up on her offer, Todoroki forced himself to weigh his options.  At this point, if Asui had already found out the most sensitive information regarding his predicament, then it didn’t necessarily make sense to push her away now.  Maybe she could become an ally in time of crisis?  Teamwork was an important skill in becoming a successful hero, after all.  \nClosing his eyes briefly, Todoroki committed to his change of plans.  “No, it’s alright.  Just don’t tell anybody, please?”\nAsui smiled warmly, her pointer finger resting on her chin.  “Of course not, Todoroki.  One’s privacy is a very precious thing.  So, is there anything I can do to help?”\n“I was actually on my way to find Mr. Aizawa to see if he could somehow erase the effects.  Do you have any idea where he’d be?”\nAsui’s smile sharpened in amusement.  “My best bet is his house, unfortunately.  Did you forget that it’s the weekend, Todoroki?”\nThere went his best plan of action.  Christ, he had been so preoccupied that he somehow managed to miss such a simple fact.  All those flow charts, in vain.  “Yes,” Todoroki answered, necessarily.  “Shit.”  \nAsui rubbed her chin contemplatively.  “If I were you, I’d try to avoid people as much as possible.  We both saw how easily I was able to figure out your situation.  If you just want to hole up in your room until the quirk’s effects fade, I’d be happy to bring you dinner so you don’t have to go to the cafeteria.”\nThe taste of salted fries sprung to Todoroki’s lips, and he shuddered in retrospective embarrassment.  \n An ally.  Todoroki wanted to hug Asui, or maybe give her 5000 yen.  “That would be a  huge  help,” he enthused, with genuine gratitude.  “I’m really going to owe you after this, Asui.”\nAsui flapped her broad hand dismissively.  “Don’t worry about it, Todoroki.  I know that you would do the same for me.  I am curious, though, how exactly does this quirk of yours work?”\n“I’m only working on speculation at this point, but as far as I can figure, I’m only compelled to tell the truth if somebody asks me a direct question.  If I try lying or simply not answering, I get a nasty headache and stomachache.”\nAnother ribbit filled the hall.  “That’s some quirk!  I suppose it could be worse, though,” Asui mused.  “At least you’re not walking around blabbing out whatever thought pops into your head.”\nWow.  Even the thought made Todoroki queasy.  I’m glad it'll never come to that. \n“You’re right.  As things stand now, though, I agree that isolation is the best form of prevention.  Thanks for the help, Asui.”\n“It’s no problem, Todoroki.  I’ll bring dinner up around 6:30.”  Asui paused on her way out of the door, catching Todoroki’s eye over her shoulder.  “And please, call me Tsuyu.”  \n \n \nThree hours into his self-quarantine, Todoroki began to realize just how much he enjoyed meals with his classmates.  He could imagine it now: Iida tidying the napkins in the dispenser, Kaminari unironically laughing at the cow puns on the milk cartons, Mineta ‘accidentally’ spilling juice on some poor girl’s blouse and offering to help her clean it up.  \nThe faux memories (excluding the last one) triggered a muted clech in Todoroki’s chest.  In just a few months, he was going to graduate.  No more sticky cafeteria seats, coffee-filled smiles of camaraderie during last minute study sessions, or the same old blazer and tie every morning.  No more Midoriya...\nHow had it never occurred to Todoroki that he would soon step out this dorm room and no longer be able to call it his own?  The realization made him want to stay quarantined in this little tatami galaxy forever.  \nMidoriya had been the one to first invite Todoroki to eat lunch with his friends.  Unsurprisingly, Midoriya’s usual table eventually evolved into the focal point of Class 1-A during meals, students crowding the wobbly tables excitedly and chattering through mouthfuls of udon.  Midoriya had that effect, really - a magnetic pull that tugged at anyone who ventured near the boy.  \nTodoroki had given in easily to the attraction, following the electromagnetic thrum all the way back to a rickety cafeteria seat, right next to Midoriya.  Ever since that first shared lunch, with Midoriya going out of his way to include Todoroki in the conversation, the thrum had intensified and intensified until it became a piece of Todoroki’s very makeup, as steady as his heartbeat.  \nWho would act as that magnetic pole after graduation, drawing Todoroki deeper within its allure with each passing day?  Who would ask Todoroki his opinion on pro hero costumes, or persuade Todoroki into a Disney marathon to ‘save his childhood’?  Who would give Todoroki his rice pudding every lunch, just because he knew it was Todoroki’s favorite?\nWho would Todoroki think about late at night, as starlight twinkled on his tatami mats?\nWell, that answer would probably remain the same long after graduation.  \nTodoroki’s phone buzzed, blue light glaring harshly across his face.\n \n\n Midoriya Izuku: \n\n\n &gt;&gt; r u coming to dinner soon???  i saved ur seat :D ! \n\n \nMidoriya must have employed the shag approach, too.  That, or he was politely letting the the two of them pretend like nothing had ever happened for the sake of preserving their friendship.  Essentially, giving Todoroki a get out of jail free card.   How characteristically thoughtful of the boy.\nTodoroki turned off his phone and buried his face in his pillow.  \n \n \n \nThe clock read 6:47 when Asui returned with dinner.  And if she noticed a slight puffiness in Todoroki’s eyes, then she didn't mention it.\n“I hope you like cold soba.  Midoriya said that you do.”  Asui presented a covered tray.  “He also said that he hopes you feel better soon.  Bakugou then suggested you try an IcyHot Patch to ‘dull the pain and relax it away’.”\nTodoroki took the tray.  “Did he really say that?”\nAsui nodded, with a ribbit.  “It is Bakugou, after all.”\nTodoroki couldn’t help it - he snorted, then laughed outright, setting the tray on his desk to avoid spilling it.  Hell, the quip wasn't even that funny, but still he laughed, purging his mind of the clinging melancholy, and Asui quickly followed suit, croaking in amusement.  His stomach tweaked again, but this time, no quirks were involved.  \n“You know,”  Todoroki grinned - a rare thing - knowing full well how ridiculous he looked.  “I can’t believe I’m going to say this, but I’m going to miss having Bakugou around next year.”  \n“Me too,”  Asui’s expression softened.  “I’m going to miss all of the class.”\nTodoroki’s jovial mood deflated a bit.  “Yeah.  We’ve been through a lot together.”\nAsui nodded again, peering intently at Todoroki.  “This may not be my place to say, Todoroki, but I think that you should contemplate how little time we have left here, with all of our classmates.”  Her gaze pinned Todoroki.  “It’s easy to think that there will always be time, or another opportunity, until suddenly you find yourself face to face with a closed door.”\nTodoroki frowned, lost.  “You’ll have to be more specific.”\nAsui tapped her pointer fingers together.  “I’m saying, if there was someone special to me within my grasp, I would consider making sure that my feelings reach them while they still can.  Moments, when lost, can’t be found again.”\nTodoroki flushed.  Not this again.  Did everyone in the whole damn class know about his feelings?  “What in - what exactly are you talking about?”\nAsui’s gaze didn’t falter.  “I’m not going to ask you about him directly, because I really do believe in privacy, but I just felt the need to say something.  At dinner, his care for you was so clearly evident, and...”  Asui paused.  “I apologize, Todoroki, I’m overstepping my boundaries.”\nAh, damn.  An ally, huh? \n“What makes you think that Midoriya is ‘within my grasp’?”  Todoroki asked, putting himself out on a limb.  He hoped she’d read between the lines.\nShe did.  “I was able to accurately read your own feelings, wasn’t I?  And if you’re a bank vault, then Midoriya is like an open air fruit stand, emotionally.  He wears his heart so openly on his sleeve that I fear for its safety.  Midoriya so clearly wants the best for you, and would put himself in harm’s way to ensure that in a heartbeat.  His feelings for you run deep.”\nThe words chipped at the proverbial lock on Todoroki’s heart, but failed to breach it completely.  It had had two years to strengthen itself, after all.  “I’m not so sure, Asu-- Tsuyu.  Midoriya is like that with everybody.  He’s just amazing no matter the relationship.  Besides, none of those things are necessarily romantic.”\n“Love is more than just flowers and chocolates, Todoroki,”  Asui asserted, and Todoroki short-circuited a bit at the ‘L’ word.  “But I understand what you’re saying.  Unfortunately for your argument, though, I have proof for that, too.”\nDespite knowing better, Todoroki’s heart beat a little louder.  “Proof?”\n“Proof.  Let’s see, where to start?”  Asui tapped her chin.  “How about the fact that Midoriya gives you his rice pudding everyday at lunch?”   \nThe tips of Todoroki’s ears flushed, just a little.  “He simply knows that I like it.  He’s a very generous guy.”\n“Mmhhm. Speaking of things that you like, it was interesting how Midoriya knew all of your favorite foods today at dinner.”\n“That’s completely platonic!  I’m sure he knows Iida’s, also.  Or even Bakugou’s.”  Todoroki shuddered slightly.  \nA dangerous smirk spread across Asui’s face.  “Alright, then.  Remember the second year winter formal?  When I went to bring Ochako some punch, I overheard him whisper to her ‘It’s so unfair, Todoroki looks even hotter in a suit.  That shouldn’t be legal!’.  And that’s an exact quote.”  Asui let out an amused ribbit.  “I remember it so clearly because Ochako and I laughed about it for a good five minutes.  Supportively, of course.”\nTodoroki’s flush spread to cover the entirety of his ears.  “T-that’s still not--”\n“I’m not finished.”  Asui interrupted, clearly enjoying Todoroki’s distress.  “Once, during first year, he showed me a photo on his phone of a cute frog umbrella that he saw in a shop window.  I accidentally scrolled over to the last picture, and it was a screenshot of you from the sports festival, with your shirt half burnt off.  He turned bright red and starting blabbering about how it was to ‘study the effects of your fire’.”\n“I-”  Todoroki choked, some distant part of himself wishing that  he  had a photo of Midoriya shirtless.  “Maybe he  was  actually studying my quirk?”  \nA deadpan stare was the only answer Asui graced Todoroki with.  The lock around Todoroki’s heart rattled precariously, yet still held firm.  Reality, in all of its cruel reason, wasted no time in clipping the wings of Todoroki’s flights of fancy.  \n“There, there  has  to be some other explanation,”  Todoroki insisted.  The teen wasn’t ignorant of his own physical...appeals, especially with the existence of the internet.  “Maybe he just thinks I’m handsome, but that’s all.  You can easily find someone attractive but not necessarily like them!”\nEven it was just the pesky influence of teenage hormones (which Todoroki was all too familiar with), the notion of Midoriya thinking that way of Todoroki did funny things to the teen’s stomach.  \n“That’s a stretch, Todoroki.  In my opinion, the most likely explanation is the one that you will have the hardest time accepting - and heaven knows why you're so convinced otherwise.  Midoriya almost definitely has had, and still has, romantic feelings for you.”\nFirst Uraraka, now Asui.  Christ, this conversation was getting to be a little too much for Todoroki’s poor heart.  “There’s just, that  can’t  be it,”  Todoroki mumbled, mostly to himself.  “Midoriya is so,  so...well, he’s Midoriya!  There’s no way he’d ever think of me like that, especially when he’s so much closer to - to, like, Uraraka.  Uraraka is  gorgeous , and funny, and kind, and actually adds to a conversation, unlike me.”\nAsui laced her fingers together patiently, and Todoroki felt like a child throwing a tantrum.  “Are you really worried about Ochako as competition?  Because I wouldn’t, if I were you.”\nHe groaned in frustration.  “Not  Uraraka, necessarily.  I just meant that Midoriya could do so much better than me, so there’s no way he’d like me as more than a friend.  Every time I've accidentally let something slip he just seemed creeped out and unsure how to let me down.”\n“Todoroki, I'm sure that's not the case.  This is almost certainly a classic case of misinterpretation, on both ends.  You have many admirable qualities that I'm confident Midoriya has noticed.  And you should really go search your hashtag on Twitter sometime,” Asui ribbed, not unkindly, and Todoroki wondered if she and Ashido had had a little chat during dinner.  “Midoriya certainly does.  I can’t imagine how he handled that week when #ShoutosThroat trended.”\n“Don’t remind me of that evil hashtag,”  Todoroki groaned.  He really should’ve known better than to eat that popsicle in public.  If nothing else, ‘Fellate Gate’ had taught Todoroki lots of...creative new slang.\nWas...was it possible Midoriya had actually looked through that hashtag?  Todoroki knew it had mostly been a big joke, but still.  According to Ashido and Kaminari’s highly unnecessary commentary at the time, some of the pictures floating around had been genuinely suggestive, so the thought of Midoriya scrolling through them - perhaps late at night - and fixating on Todoroki’s lips, and wondering how those lips would taste, well.\nWith the advance of Todoroki’s blush to his neck, he decided that it was high time to end the conversation.  “Well, Tsuyu, thank you very much for the food.  I genuinely appreciate it.”\nAsui put her hands up in a placating gesture, with a ribbit.  “I get it, I’ll stop teasing you and leave.”  Her expression turned serious.  “I do mean what I said about seizing opportunities, Todoroki.  Even if Midoriya rejected your feelings - which he absolutely wouldn’t - at least you wouldn’t graduate and leave this place with that ‘what if’ clouding your future.  Confess to him, Todoroki, before it’s too late.  Please - at least think about it.  And enjoy your soba!”  \nAsui turned towards the door, bowtie hairstyle swishing with the movement.  Bits and pieces of their conversation flickered through Todoroki’s head like a film reel, and he felt his chest bubble. \nBefore he even registered his own thoughts, Todoroki called Asui’s name.  She shot him a look over her shoulder, tongue lolling.  \n“Did,”  For fuck’s sake, he was going to sound like a damn middle-schooler.  “Did Midoriya really say I looked hot in a suit?”\nAsui’s lips quirked.  “Not just ‘hot’, Todoroki.  ‘Even hotter’.  Let me know if I can help you more with that rogue quirk!”  With that, Asui was gone.\nTodoroki reached for his meal and began chewing on the food robotically as his mind raced at warp speed.\nAnd speaking of ‘even hotter’, it wasn’t long until Todoroki’s dorm room thermostat read 87 degrees farenheit.\n \n \n \n \n“Jesus christ, why the fuck is it so hot up on your hall?”  A voice demanded from somewhere down the hallway, outside of Todoroki’s door.  Kaminari?   Todoroki sat up on his bed.\n“Is it Todoroki’s quirk?”  another voice asked.  It sounded like Ojirou, this time.  \n“More than likely,”  a third voice - Sero’s - responded.  Typical - Todoroki had noticed the three hang out a lot.  “See Kaminari, Ojirou was able to figure it out on his own.  Why couldn’t you?”\n“Because I was too busy sweating my ass off!”  Kaminari griped.  “Is it always hotter than the ninth circle of hell up here?!”\n“The ninth circle is actually ice,”  Ojirou corrected.  \n“But we’re very proud of you for trying that reference, anyways,”  Sero added.\n“Fuck you guys.  Maybe if y’all didn’t read so much, you could actually get a date for once.”\n“When was the last time you went on a date, Kaminari?”\n“...Dating isn’t everything, you kno-”\n“Speaking of ice,”  Ojirou interrupted,  “shouldn’t Todoroki make it cold up here instead of warm?”\n“He does, sometimes.  I actually sleep really well when that happens.”  Sero hummed.  “I think different stimuli lead to different temperature reactions.”\n“Please never use ‘stimuli’ in a normal sentence again.”  Ojirou sounded genuinely disgusted.  Todoroki was inclined to agree.\n“Sounds kinky,”  Kaminari said, and Todoroki could practically hear the shit-eating grin, even through the walls.  “Nothing wrong with that.”\n“Maybe that’s not too far off…”\n“Oh god, you think he’s been jacking it?!”\nTodoroki nearly fell off his bed.  There was no reason that anything that came from Kaminari’s mouth should still be able to shock Todoroki, but goddamn, it did.  It must come with the quirk.\n“He is a 17 year old dude,”  Ojirou pointed out.\n“He always seems so much older, though.”  Sero mused.  “I wouldn’t be surprised if we found out that he plays golf on the weekends at his beachfront timeshare.  And calls stores to ask questions that could easily be looked up online.”\nTodoroki thought that they were being a little unfair.  He happened to suck at golf.\n“Goddammit, this lock is so shitty,”  Sero groused, fruitless jiggling sounds revealing the source of his annoyance.  Todoroki could relate; he’d frozen his own lock out of frustration more times than he’d like to admit.  \n“Nah man, Todoroki may seem all aloof at first, but that just means you’re not looking hard enough.”  Kaminari declared, woefully back on subject.  “Like remember that one day that Midoriya accidentally tore off his P.E. uniform during training and Todoroki set half the gym ablaze?”\nOh god, did Todoroki remember.  Instead of giving him a proper lecture, Aizawa had just sighed and shook his head somberly - bloodshot eyes puffy and watery from the smoke - which was somehow worse.   \nSero needed to hurry up with that goddamn key.\nOjirou scoffed.  “Well that’s because it was  Midoriya.  It doesn’t count when it involves the guy he’s head over heels for.”\nIt was truly a miracle that Todoroki remained safely on his bed.  They know too?!   Todoroki couldn’t suppress a quiet groan.  Does the whole fucking class know? \n“No, Midoriya  definitely  counts, when it comes to Todoroki,”  Kaminari was definitely grinning again.  “Especially because we were just debating whether or not he polishes his icicle.”\nTodoroki actively cringed as Sero and Ojirou loudly reacted in disgust.  \n“Oh my god, if you ever say something like that again, I’m going to tell Todoroki your disgusting words, and we’ll see how well your little sparks hold up against his ‘icicles’,”  Sero threatened.\n“Wait, how do we even know that he isn’t in his room right now?”  Ojirou sounded nervous.  “Hurry up with that damn lock.”\n“Alright, alright, sorry,”  Kaminari bulldozed on, completely ignoring Ojirou and his (highly valid) concern.  “But you guys know that I’m right.  I guarantee you that if we brought Midoriya up here in some kinky bunny get-up or something, we could fry an egg on the hallway carpet.”\nThe worst part - the worst part was that they weren’t wrong.\n“Kaminari, do you want to explain why you’re so fixated on the thought of Todoroki getting turned on?”  Ojirou laughed.\n“It’s scientific!  Call it an academic quirk analysis - I’m practically doing extra credit.”  Kaminari paused.  “And he’s a total dime.”\nOjirou and Sero snorted, and Todoroki wished that he could say that Kaminari’s comment had fully restored the pride damaged by the prior conversation.  (It hadn’t).\n“Believe it or not, Kaminari actually may have figured something out.”  Sero continued, over Kaminari’s protests.  “The few times Midoriya has visited Todoroki when I was also in my room, the floor did seem to get a bit steamier.  ...And no, not like that, Kaminari.”\n“Awww,”  Ojirou exhaled.  “That’s actually really really sweet, Sero.”\n“I know, right?  Who knew that the strongest guy in class was actually a huge softie?”\n“Midoriya does seem to have that effect on people.  Poor Todoroki never even had a chance.”\n“Got it!”  Sero crooned triumphantly, the lock clicking open.\n“Well  I  think it’s fucking gay as hell.”  Kaminari scoffed.\n“Um, Kaminari, aren’t you bi?”  The door to Sero’s room creaked open.\n“Yeah.  What’s your point?”\n“...Nevermind.”  The door slammed shut, sealing the voices away.\nTodoroki collapsed spread-eagle on his bed, not quite absorbing what had just happened.  This - on top of Kirishima, Asui, those godforsaken Golden Arches - was more than enough ‘stimulation’ (as Sero would say) for one day.\nUnbidden, Todoroki’s mind leapt to Kaminari’s words, to the mental image of Midoriya in ‘some kinky bunny get-up’.  \nWhen his blush spread all the way to his neck, he activated his ice side.  He didn’t need those three jokers next door getting any more (disturbingly accurate) ideas.  \n...The rabbit ears would look so cute, nestled in fluffy green curls....\nDamn.  ‘Fucking gay as hell’ wasn’t too far off.\n \n \n\n Fire alarms screeching, an exhausted sigh, charred remains of clothing as icicles drip steadily from the ceiling.  An egg sizzles on the hallway floor - sunny side up - and hysterical laughter carries through the smoke as the screeching intensifies and- \n\nA timid knock interrupted Todoroki’s nightmare, and relief came so blessedly that he could kiss his savior.  He didn’t even know he’d been sleeping - stress must have oh-so-graciously taken over his body again.  \nWhen Todoroki cautiously opened the door, a cup of rice pudding was shoved into his face, and his prior resolution reaffirmed itself tenfold.    \n“Y-You never got yours at lunch today, and you didn’t show up to dinner or reply to my texts, so I thought I’d bring it to you myself,”  Midoriya explained hurriedly, the cup wobbling slightly.\nSo they still weren’t going to talk about it, huh?  Todoroki supposed he couldn't complain, not really.  Not when every conversation was a minefield, or when every little thing he let slip from his lips ended up driving more awkwardness between the two of them.  And yet...\nTodoroki took the cup.  “Thank you.”\n“I, um, missed you at dinner.  Kaminari’s horrible new pickup line wasn’t as funny without your appalled reaction.  The outrage really boosts the humor.”\n“I see,”  Todoroki said distantly, inwardly scrutinizing Midoriya.  Yet… Asui’s ‘proof’ looped in his mind.  Was it possible that the boy really...liked him?  Could Midoriya conceivably get nervous around him, like Todoroki was now?  \nOr could Todoroki be completely reading too far into Midoriya’s nervous personality, wishing so desperately for signs that he conjured them out of thin air?  Signs, however, flashing with neon fervor, at least according to Asui and Uraraka.\n\n ‘Midoriya almost definitely has romantic feelings for you.’ \n\nAhem.\nDesperate to maintain his composure, Todoroki focused on cooling his room temperature dessert.\n“Did you just self-refrigerate the pudding?”  \n“Yeah.”  Todoroki’s mind was racing.   ‘Romantic feelings’, huh. \nMaybe, maybe it wouldn’t be so bad to test the waters, so to speak.  Definitely nothing Kaminari-esque, like those horrible pickup lines Midoriya had mentioned, but something subtle.  If there was ever a time where words flowed easily, it was now.  \nMidoriya glanced at his hands.  “Ah, your quirk really is amazing.  I wish mine had more practical applications.  I guess I could help with demolition or something.”\n“I think that’s more Bakugou’s specialty.  Maybe you could help people move really heavy furniture,”  Todoroki joked, then cringed inwardly at his own miserable attempt at flirting.  \nThis plan had clearly been a mistake.  Todoroki could never speak to Midoriya again, and the world was crumbling.\n“So that’s the future I’m writing 12 page essays on the dangers of vigilantism for, huh.  Good to know.”\nOh, god, was Midoriya flirting back?  There was no way Todoroki’s subpar banter had actually worked.  But, but, the boy was carefully avoiding eye contact, looking off to the side, and fuck, it just might have worked after all.  \nAnd just like that, the world was fixed.\n“You know what else is good to know?”  Todoroki asked, allowing his lips to curl around the words amorously, emboldened.\n“What’s that?”  Midoriya seemed to hold his breath.  \nAnd Todoroki’s mind came up... blank.  Nothing clever, nothing coy, so instead he settled for:  “The current state of the stock market.”\nLet it never be said that Todoroki Shouto didn’t have a way with words.\nIf Midoriya had been holding his breath before, he now breathed easier than a cotton undershirt.  “Yeah, I guess that’s true.”\nThe atmosphere between them was static, and Todoroki felt like banging his head into the door.  A blessing in disguise really, that failure - flirting while under a respective truth serum hardly ranked in Todoroki’s top ten best ideas.  Something about this quirk just made squelching his impulses ever more difficult than usual.  So instead, he settled for returning his attention to safety of the pudding, absently licking some of the desert from the back of the lid.  \n“D-do you like it?”  Midoriya squeaked, eyes trained on Todoroki’s mouth and looking curiously tense.  Shit, I must be grossing him out.  Todoroki quickly crushed the foil into a makeshift spoon.\nTodoroki almost sassed Midoriya with  ‘no, I just eat yours every day because I hate it’, but the truth quirk (another incognito blessing), limited him to a safely platonic “I do like it.”  \nMidoriya nodded in satisfaction, but made no move to exit.  The atmosphere had regained its typical energy (at least on Todoroki’s end), yet he found himself at a loss on how to proceed.\n“Er, is there anything else you need?”  Todoroki licked another stray dollop of pudding from the corner of his mouth.  \nIt took a couple moments for Midoriya to reply, snapping to attention with a slight flush.  “Oh!  Yes, actually.  I know you aren’t feeling so great, but some of us were planning to continue our FMA binge, and I thought it might be a good way to keep your mind off things and cheer you up!”\nTodoroki blanched.  A few weeks ago, after genuine distress at the knowledge that Todoroki had never heard of some anime called ‘Fullmetal Alchemist’, Midoriya had determined that Todoroki must watch all 64 episodes with him.  Somehow, the news spread, and multiple students had begun joining in on ‘FMA Saturday’.  \nNeedless to say, a room full of people was the last thing Todoroki needed.  “I’m not sure if that’s a good idea....Izuku,”  he appended, hoping the gesture of closeness would convince Midoriya to let him stay quarantined.  \n“Aw, come on, Shouto!”  Fighting fire with fire, I see.  “It’ll be good to relax after a stressful day!  Is there anything I could do to convince you?”\nIt was impressive, really, how quickly Todoroki’s mind plummeted into the gutter, how quickly the bunny costume made its mental encore.  The teen’s face flushed.\nDamn, even Mineta would swoon at some of the images flitting around Todoroki’s stupid, stupid head.  \n“Yes,”  Todoroki croaked, fighting a daydream of aggressively making out on one of the longue sofas.  Then winced as imaginary Midoriya beat the shit out of imaginary Todoroki with his quirk and dragged him into the lounge.  Held his sister hostage at gunpoint, threatened to kiss Bakugou right in front of Todoroki.  \nThe parameters presented by ‘anything’ were hardly exclusive.\n“Good!”  Midoriya beamed.  “Then lemme know, so we can go watch Hawkeye be badass.”\n“I, um.  Just ask nicely,”  Todoroki supplied lamely, inching his way into red alert.  This was not good.  Really  not good.  His stupid hormonal ass had just bought himself a one way ticket to the lion’s den.  There was no way Todoroki could make it out of FMA Saturday unscathed.  \n“Alrighty, then - Shouto, would you  please  grant me the honor of accompanying me to the lounge?”  Midoriya dropped into a facetious bow.\n“Yes,”  Todoroki muttered, defeated.  He was beginning to really hate that word.  \n“Then let’s go!”  Midoriya gave a thumbs up.  “This will definitely take your mind off of things, Shouto.  Yaoyorozu is making popcorn!”\n \n \nTodoroki kept his face carefully blank as Midoriya led him to the lounge, inward dread growing with each step.  Maybe nobody showed up tonight? \nEleven people had showed up that night.  Ashido, Uraraka, Asui, Yaoyorozu, Jirou, Kaminari, Hagakura, Aoyama, Iida, Kirishima, and Bakugou were all strewn about the sofas, chatting amicably (excluding the latter).  The show was already queued up, and Yaoyorozu had indeed followed up on her promise of popcorn.  At least Todoroki would have something to snack on as his life inevitably fell apart in front of his helpless eyes.\n“Hey, Todoroki!”  Uraraka waved cheerfully, prompting a chorus of greetings (excluding Bakugou, yet again).  At least he’s consistent. \n“Todoroki!”  Iida exclaimed, arm telescoping to point at the bruise adorning Todoroki’s jaw.  “What happened to your jaw?”\n“Yeah dude, yikes.”  Jirou winced.  “That sucker is as purple as Mineta’s balls.”\n“Mon dieu!”\n“Midoriya got in a solid punch during training this morning,”  Todoroki explained unwillingly, absolutely refusing to touch the Mineta comment and feeling like the king of assholes when he saw Midoriya cringe next to him.  The guy obviously already felt way too guilty about it.   Fuck this quirk. \nYaoyorozi hummed, munching on popcorn.  “Can’t you just ice it with your quirk?”\n“I...yes, actually,”  Todoroki admitted, a little abashed.  He really did have a lot on his mind if he had forgotten something so simple.  \nYaoyorozu smiled sympathetically.  “Have some popcorn.”\nIt was salty.\n“What are you doing out here?”  Asui whispered fervently, sidling up next to him when he found a seat on the sofa.  Midoriya sat down on his other side.\n“I couldn’t make up any excuses because of the quirk,”  Todoroki mumbled, into her ear.  Out of the corner of his eye, he saw Midoriya glance at them with an expression that he couldn't quite decipher.\n“I see,”  Asui nodded.  “Let’s hope for the best.  Apparently a really good episode is coming up, so maybe people won’t be very talkative.”\nWith the start of a J-Pop intro, the room quieted down.\n \n \nWhen Todoroki finished his handful of popcorn, he sucked the grease off of his fingers methodically.  He hated the feeling of grubby hands.  That was more Mineta’s thing.\nTo his right, Midoriya choked, and whipped his head around to stare at the TV when Todoroki turned to ask if he was alright.\n“Kernel went down the wrong pipe,”  the boy explained, still avoiding eye contact.\nThe fluffy green tips of the boy’s hair caught an ethereal glow in the blue light cast by the television.  Vaguely, Todoroki could catch the fruity scent of Midoriya’s shampoo.  Their thighs were pressed together snuggly.\nSomething threatened to burst in Todoroki’s chest, so he followed Midoriya’s lead and turned back to the show.\n \n \nRed light bathed the lounge as the Fire Alchemist unleashed his power onscreen.\n“Woah, Todoroki,” Jirou grinned.  “You never told me you were in Fullmetal Alchemist!”\nThe students all giggled, except for Bakugou, whose head snapped up angrily.\n“What the fuck do you mean, fucking ‘Todoroki’?!  I’m  the one with the explosion powers, not that pretty boy Candy Cane asshole!”\n“Aww, Todoroki, Bakugou thinks you’re pretty!”  Uraraka cooed.\n“I didn’t fucking mean it like that, he looks like Elmo fucked a Yeti and had a secret love chi-”\nAnother fiery explosion lit the screen.\nKaminari whistled.  “Damn, Todoroki, you’ve really got some power!”\n“Shut the fuck up, you Energizer Bunny piece of shit!!”\n \n \nThree episodes in, Todoroki’s eyes were glued to the screen, and Midoriya, in turn, glued himself to Todoroki’s side, eyes suspiciously damp.\nBecause there, on screen, stood Lieutenant Riza Hawkeye, gun locked and loaded as she stared down the enemy.\n“Hold me, Bakugou,”  Kirishima mumbled.  Bakugou didn’t even protest.\nGunshots echoed from the television.  Across the room, Aoyama blew his nose loudly into his seventh tissue.  Midoriya squeezed Todoroki’s arm tighter.  \n“Holy  fuck,”  Todoroki whispered.\n \n \nJirou crossed herself solemnly as Lust died.  “I can’t believe Mineta is fucking dead.”\nTwelve pairs of lips shushed her in unison.\n \n \n“That,”  Bakugou started, speaking over the ending theme, “was fucking incredible.”\nFor once, Todoroki agreed.\n“Well, do we want to watch another episode?”  Yaoyorozu inquired, reaching for the remote.\n“I vote yes,”  Uraraka asserted.  “We should watch one of the happy OVAs to recover from that last episode.”\nWhen nobody protested, Yaoyorozu busied herself setting up the DVD, and Todoroki’s attention slowly drifted back down to reality.  \nMidoriya nudged Todoroki’s ribs, looking smug.  “I told you it was a good show, didn’t I?”\n“You did,”  Todoroki turned to say, but the statement came out a tad breathy when he realized just how close Midoriya was.  The boy was still latched onto his arm, presumably forgetting to remove himself after the intensity of the episode, and Todoroki found that he could count every one of Midoriya’s freckles.  \nHe proceeded to do so.\n“Honestly, you kinda owe me for introducing it to you,”  Midoriya teased.  There it was again, the almost-flirting.  Could it somehow be flirting?!\nMidoriya popped a kernel into his mouth, licking the salt from his lips absently, effectively jamming all of Todoroki’s powers of cognition.  So before he could even think about what he was saying.\n“Seems fair to me,”  Todoroki’s heart pounded furiously.  He allowed his voice to deepen, tasting the words before he spoke.  “Is there anything in particular you’d like?”\nMidoriya flushed, the red in his cheeks contrasting against his freckles in a way that was really quite lovely.  “Y-you, are you--”\nA loud burst of music jolted the room, and Yaoyorozu grinned sheepishly as she grabbed the remote and lowered the volume.  “Sorry about that, guys!”\nChrist, alright, how had Todoroki somehow forgotten that he and Midoriya were in a room surrounded by eleven other people?  He quickly tore his eyes from Midoriya and focused pointedly on the screen, just barely suppressing a blush with all of his willpower.  \nThe couch shifted as Todoroki felt Midoriya put some distance between their bodies.  Todoroki already missed the warmth.  \nAsui nudged him.  “‘Completely platonic’, you said?”\n“Shut up,”  he hissed, finally losing the battle of wills as his face flooded with heat.  Then:  “And yes, I did say that.”   Goddamn stupid quirk. \n“I’m quite excited to see this OVA,”  Iida was declaring.  “Izumi Curtis is certainly an intriguing character, and I look forward to learning more about her.”  \n“She’s definitely one of my favorites,”  Uraraka agreed.  \n“I like the characters from Xing,”  Asui added, tongue hanging lazily.  \n“Oh my god, finally,”  Ashido blurted.  “We all need to take a moment to appreciate how hot Ling is.  He definitely needs more screen time.  I mean, the Elrics are cool and all, but at least give the side characters a chance!  And the foreign ones are always the coolest.  Also, Ling’s ponytail totally kicks Ed’s ponytail’s ass.”  \n“Don’t you dare talk that way about the Elrics,”  Ochako hissed, voice strangely menacing.  “They have the greatest television brotherhood of all time, and I absolutely will not tolerate any bad-mouthing.”\n“Besides, Ed’s hair is iconic,”  Kaminari added.  “It just goes to show that blonde hair is the sexiest.”\n“I couldn’t agree more!”  Aoyama tossed his own locks in an clearly-practised movement.  \nA headphone jack smacked Kaminari, courtesy of Jirou.  “I wouldn’t be so sure about that, Kaminari.  After all, our very own Bakugou is blonde.”\nSaid blonde erupted.  U.A. had really done right by investing in flame retardant furniture.  “Just what are you implying, Headphone Jackass?!”\n“-I like Scar!”  Kirishima interrupted strategically.  “His motivations are very manly.”\n“Is nobody going to bring up Winry?”  Yaoyorozu looked slightly offended.  “I find her mechanical skills very inspiring.”\n“A lovely maiden, with eyes that sparkle comme la saleté~”  Aoyama sighed wistfully.  \n“Yet another blonde…”  \n“Just give it up, Kaminari.”\n“What about you, Todoroki?”  \nTodoroki startled slightly.  He’d been mostly tuning out the conversation, but Midoriya’s voice cut right to the center of his attention.  Old habits died hard, and whatnot.  \n“What about what?”  Todoroki countered precariously, silently begging every god out there for a benign question.  \n“Who’s your favorite character?”  Midoriya repeated, and Todoroki sighed inwardly in relief.  This was workable -\n“Nah, not ‘favorite’.  That topic is already stale.”  Hagakure giggled.  “Who’s your pick for hottest character?”\nAh, not quite as tame, but still harmless.  Todoroki’s mind jumped to the Fire Alchemist.  He had always had a thing for guys with messy hair.  \n“Roy Mustang,” Todoroki answered, letting the truth slip easily from his lips, for once.  \nThose present began voicing either their consent or disagreement.  “Of course Todoroki would choose the fire dude.”  “Roy is so uptight though!”  “Don’t try and tell me that a man in uniform isn’t hot.”  “The uptight ones are always the best in bed though...”  “Mina!!”\nFrom his perch on the arm of the sofa, Bakugou scoffed, apparently still a little testy from Jirou’s jab.  “Really, Todoroki?  Colonel Mustang?  What are you, gay?”\n“Yes,” Todoroki replied automatically.\nAnd promptly froze, the entire room quickly following suit.  \n“Fullmetal Alchemist,” the TV declared triumphantly.  Kaminari coughed.  Nobody else moved a muscle.  This was hell.\n“Fullmetal Alchemist!” the TV repeated, the narrator laughing slightly.  How fitting.  Asui silently gave his leg a comforting pat.\n Fuck.  Honestly, Todoroki genuinely didn’t mind his class knowing his sexuality.  He had never avoided revealing it, per se - he more had always just assumed that they would figure it out on their own at some point or something.  But  this, with 12 pairs of eyes trained solely on him,  this  was distressing.  \nThe window was looking ridiculously enticing right about now.  If he escaped, he could surely get a job and change his name, then-\nIncredibly, it was Bakugou who broke the silence.  “So Icy Hot is gay - big deal.  Doesn’t make him any less of a fuckwad.”\nTodoroki had never been happier to be called a fuckwad.  Fitting for his quirk, Bakugou’s comment effectively broke the ice, and the room suddenly became much, much too loud.  \n“Of course it’s not a ‘big deal’!”  Iida exclaimed earnestly, hands swiveling to point at Todoroki.  \n“Wait, you mean you didn’t already know?”  Kaminari snorted.  “Please - Todoroki basically left rainbow trails wherever he walked, like some sort of gay snail.”\nWith that flattering comparison, Kaminari ruffled Todoroki’s hair in a ‘show of gay/bi solidarity’, his electricity rendering Todoroki’s hair reminiscent of a Furby.  Ashido declared yet another moment of silence for the fangirls.  She seemed to be fond of that joke.  \nWell, Todoroki supposed it could have gone worse.  Coming out, that is.  Not that he had ever really planned to, though.  Todoroki fancied himself a pretty private guy, so any kind of public sharing like this wasn’t really his style.  \n“Despite his less than poetic analogy, I agree with Kaminari,”  Yaoyorozu mused.  “To be honest, I just assumed that you were keeping it private on purpose.  If you don’t mind me asking, Todoroki, how come you never said anything?”\nTodoroki shrugged.  “It never came up.”  The room blinked simultaneously.\n“That doesn’t mean that you shouldn’t - ah, nevermind.”  Yaoyorozu sighed.  “I’m just happy that you felt comfortable telling us all!”\n“This is awesome,” Kirishima exclaimed.  “Now I can finally be your wingman!  Not to brag, but I’ve literally never failed in sparking the sweet, sweet flame of romance at a friend’s behest.”\nJirou smirked.  “I doubt Todoroki needs a wingman, especially  you, Nokia Boy.  Have you ever seen the things people tweet about him?  Have you somehow forgotten Fellate Gate?  You’d probably hurt his chances, if anything.”\nKirishima gasped indignantly.  “I’m about to hurt more than just Todoroki’s chances.”\nA pillow flew across the room and smacked Kirishima in the face.  “Oh, it’s  on,” Jirou challenged, brandishing another pillow in her left hand.\n“Now, now, let’s not resort to violence,”  Aoyama said nervously.  “Fighting between friends is unseemly, oui?”\nWith the whack of another pillow across Aoyama’s meticulously swept locks, all talk of peace swiftly became obsolete.  “I’ll make you pay for that, mon cheri.  This lovely coiffure does not style itself.”\nWith the room firmly settled back into comfortable chaos, Todoroki found the smallest of smiles gracing his lips as he leaned back into the couch to avoid the line of pillow fire.  Asui looked confused (“How were there people that didn’t already know?”), but then patted his leg one last time.  He was going to miss moments like these, when he graduated.  \nOut of the corner of his eye, he saw Bakugou peering at him.  Todoroki returned the look for a few seconds, and something seemed to pass between them, until Bakugou rolled his eyes and went to aid Kirishima in his battle against Jirou and Aoyama.\nTodoroki then noticed the weight missing to the right of him.  Midoriya was gone; he hadn’t said so much as a word about Todoroki’s unintentional confession.  Could it be that Midoriya had a problem...?\nNo way.  Todoroki shook his head, clearing the ridiculous thoughts.  This was Midoriya he was talking about.  That guy was as far from intolerant as they come.  And apparently...found Todoroki attractive.  Todoroki coughed.   Then where the hell did he go? \nOh.  Midoriya was currently huddled halfway down the hallway with Uraraka, their conversation inaudible from Todoroki’s position.  He appeared to be whispering frantically, his arms gesticulating as he spoke.  Uraraka laughed and put a hand on her hip, smirking through her reply.  \nTodoroki really wished he could’ve heard what she said, because Midoriya promptly began resembling a tomato, visibly stuttering as he shook Uraraka’s shoulders.  Uraraka smiled again as she spoke, patting Midoriya’s hand where it rested on one of her shoulders.  Midoriya returned the favor, albeit his smile a bit more wobbly, and he gave Uraraka a quick hug.\nWhy hadn’t lip reading been part of hero training??  Even though he knew it was childish, Todoroki felt jealousy simmering in the pit of his gut.  He envied that closeness with Midoriya,  craved it.     He  wanted to be the one whispering with Midoriya in the corner, heads bowed together as their breaths intermingled with laughter.  \nMidoriya looked up and caught Todoroki staring, quickly repeating his imitation of a tomato.  Out of the corner of his eye, Todoroki saw Uraraka smirk again and lightly shove Midoriya in his direction.  \n“Sooo, Todoroki,”  Jirou flopped into the Midoriya’s old space, bits of down feathers stuck in her hair.  “As a fellow rainbow-trailing snail, I’d like to welcome you to the club with some friendly, motherly advice.”  She paused dramatically.  “Never forget to use lube.”\nTodoroki choked on his own spit.\n \n \n \n \nFive more wildly inappropriate comments from Jirou and six more disturbingly apt snail comparisons from Kaminari, Todoroki decided it was high time to call it a night.\nHe really should've known better than to think he'd be able to retreat safely.\n“Shouto, wait!”\nMidoriya caught Todoroki in the stairwell, just past the landing between the fourth and fifth floor.  The stairwell really hadn’t been kind to Todoroki, today.\nHe bypassed Todoroki to stop one step beyond him, effectively blocking any exit.  “I, I need to talk to you,”  the boy blurted, shoulders tensed.  \nTodoroki crossed his arms and leaned against the wall. The handrail dug into his abdomen.  “Then let’s talk.”\n“W-well, I just.  I don’t know if you noticed, but I kind of bailed on you right after your uh, announcement, and I didn’t want you getting the wrong idea.”  Midoriya bounced on his toes, hair wobbling with the movement.  “For the record, I was really happy to hear it.”\nTodoroki’s heart leapt into his throat.  Happy? \n“Crap, that came out weird,”  Midoriya rushed, turning red.  “I just meant that I was happy for  you, yeah.”  He paused.  “I don’t know if you meant to come out quite like that, but I bet it’s nice to have it out in the open.”\n Oh.  The handrail dug even deeper into Todoroki’s side, and he shrugged.  “I wasn’t exactly  avoiding  telling people.  I suppose it just never came up directly.”\n“Gotcha.  Dang, I wish I ha-- I bet a lot of people will be very interested to hear the news.  Ashido was right about all your fangirls.”\nTodoroki let out a  pffft.  “I think it’s safe to assume that Ashido was being Ashido and exaggerating.”\nMidoriya looked genuinely stunned.  “I- Shouto, have you ever actually looked through Twitter?  Or, I don’t know, at a mirror?”\nIt was Todoroki’s turn to sputter.  “No, not really?  Twitter, I mean.  I look at mirrors often.  My bathroom has one.”  The Todoroki Charm was really firing on all cylinders, huh.   \nMidoriya gaped again, and whipped out his phone, jabbing at the blue bird icon.  It didn’t even take 15 seconds for his expression to morph from determined to very, very flustered.\n“S-see!”  Midoriya shoved the phone into Todoroki’s hands.  “Look at what they say about you!  And that was literally the second tweet under your hashtag.”\nTodoroki’s brow furrowed as he squinted at the screen.  The first tweet linked a photo of him collapsing a crumbling building with his ice in order to detain a criminal.\n \n&gt;  @im_a_little_tea_thot        #shoutotodoroki out here destroying walls and    all I wanna know is When will he destroy MY walls???? \n \n...Oh.  “At least they’re being forthright with their feelings.”\nMidoriya groaned in despair.  “Just keep scrolling.”\n \n&gt;  @whatgoesup_mustcumdown        real talk here, id fuck #shoutotodoroki    harder than the japanese school system fucks students’ mental health \n \n&gt;  @nipl        Discussion topic: does #shoutotodoroki have pubes like a    sideways flag of Indonesia?  #dothecurtainsmatchthedrapes ?? \n \n    ^^^ @[thx_4_the_memeories]     @nipl  if i ever got close enough to find out, my mind (and mouth) would be on a different type of pole than a flag pole. \n \nTodoroki coughed.  “ Very  forthright.”\nAnother photo link led to a picture of Todoroki in his hero outfit, his bangs slightly tousled as he stared somewhere off camera.\n \n&gt;  @fuck_a_duck        #shoutotodoroki       jfc have u ever seen a more beautiful    boy??1?  im,,,,, \n \nTodoroki paused in his scrolling.  “Wait, Izuku, why does this one have a red heart?”\n“What?!”  Midoriya yelped, snatching back the phone and stuffing it back into his pocket.  “You, I bet you hit ‘like’ by accident, yeah.  That happens all the time.  It’s really annoying,”  Midoriya laughed nervously.  “B-but you get my point, right??  And this doesn’t even  touch  some of the tweets during F-Fellate Gate!”  He blushed even brighter.\nHoly shit, Midoriya had looked at those tweets.  And holier shit, that knowledge was somehow...kind of hot?  “Yes, I understand your point.  But why exactly did you make it?”\n“To prove Ashido’s point!  And to show that a ton of guys are going to be absolutely thrilled when the internet inevitably finds out that you’re gay.”\n“Ah.”  A vague, kinda-sorta turned on feeling buzzed in Todoroki’s veins, clouding his judgement.  “I don’t care much about the internet, though.  I’m more interested in my classmates.”\nThe statement hung heavily, and the air seemed to buzz in tandem with Todoroki’s blood.\n“I-interested?”  Midoriya squeaked.\n“Very.”  If Todoroki’s judgement had been cloudy before, it was altogether overcast now.\nMidoriya swallowed visibly, and Todoroki stared shamelessly at the boy’s Adam’s apple.  “Hey, Shouto,”  Midoriya began, voice all breathy.  “Did you know that I also like guys?”   \nOh, wow.  They were, um.  Thanks to the stairs, Midoriya was perfectly at eye level, for once, and Todoroki was kinda glad that he normally wasn’t, because having the boy’s lips and freckles so near and accessible and goddamn alluring was bad for Todoroki’s sanity.\n“I had heard that,”  Todoroki whispered hoarsely.  ‘Confess to him, Todoroki,’  the ghost of Asui egged him on.  ‘Before it’s too late.’  “I had...hoped.”\nMidoriya’s eyes grew impossibly wide, and this close, Todoroki was struck by the profundity of their hue.  “D-does that mean tha--”\nThe fourth floor stairwell door flung open, the crash ringing harshly in Todoroki’s ears.  Two sets of footsteps echoed, their sources hidden by the bend in the staircase.\n“You bastard, what is your fucking deal with slamming doors?!  People are gonna hear that shit.”\nBakugou’s unmistakeable voice was the coldest of cold showers, mercilessly incinerating any butterflies in Todoroki’s stomach.  \n“Sorry, babe,”  Kirishima’s voice replied, his grin audible.  “I guess I’ve just got ‘slamming’ on my mind.  Did I mention how much I love that tank top on you?”\n“So are you saying that I should keep it on, you Chia Pet?”\n“Now, now, let’s not jump to conclusions,”  Kirishima purred, and good lord, speaking of showers, Todoroki felt a strong need for a cleansing one now.  \nGlancing over, Todoroki discovered that Midoriya seemed to feel similarly horrified, and the boy tugged on Todoroki’s sleeve in a clear plea to get the fuck out of here.   \n“I’ll just jump you instead,”  Kirishima continued, sounding satisfied by his own wordplay.  Midoriya dragged Todoroki towards the fifth floor desperately.\n“Then how about you fucking get on with it and stop fucking blithering on,”  Bakugou growled.\n“Damn, ‘blithering on’?  Have I ever told you how much a wide vocabulary turns me on, Katsuki?”\n“How fucking serendipitous for you, then.”\n“Babe!”\nScuffs echoed up the stairwell, followed by an unmistakably wet sound and - oh god - a lewd moan that sounded suspiciously Bakugou-esque.  Todoroki could practically hear his bank account sinking into future counseling.\n“Oh yeah, baby, don’t hold back~”  \nMidoriya finally finished fumbling with the door handle, and the pair dashed to safety as if running from a homicidal villain.  The rustle of fabric hitting the floor served as a parting goodbye.  \n \n \nMidoriya collapsed against the hallway wall, curling up into a cocoon of despair.  “Kacchan...”  Midoriya covered his eyes with his forearm.  “Kacchan is making out right now.”\n“Or having sex,”  Todoroki supplied unhelpfully, and Midoriya groaned from under his arm.  “...Sorry.”\nThe boy looked dead inside.  Todoroki found himself sympathizing - it must be weird, putting it lightly, to hear your childhood bully sucking face only a few meters away from you.\n“At least he’s with Kirishima,”  Todoroki offered, taking a stab at cheering the boy up.  “If you ask me, he’s a great influence on Bakugou.  His attitude, I mean - not in a kinky way.”\nMidoriya removed his forearm from his face to fix Todoroki with a lifeless glare.  Todoroki took that as his cue to shut up\n“I heard Kacchan moan.”  Midoriya sunk further into himself.  “Oh my god.  I heard Kacchan moan!”\n“More than once,”  Todoroki nodded, at a complete loss.  “I’m sorry.”  \nWhat the hell should he do?  One moment he had been this close to kissing Midoriya, and the next, the boy was curled up like a traumatized roly poly.  As the memory looped in his head, Todoroki bristled.  \nHe should be the one making out right now, not goddamn Bakugou.  And Midoriya should be the one moaning, and shedding clothing, and looking up at Todoroki with those big green eyes as Todoroki leaned forward and kissed the shit out of that boy...\nFuck.  He suddenly needed a shower again, and for decidedly different reasons.\nMidoriya sighed and stood up listlessly.  “Well, it’s not like I can go back to my room for a bit, unless I want to have my childhood crumble before my eyes again.”\n“Technically, we didn’t see anything,”  Todoroki said.  Midoriya glared again, and this time there was more bite to it.  Todoroki counted it as progress.\n“Geez, somebody sure is mouthing off tonight.”\nTodoroki grinned slightly, and before he could stop himself:  “Is it Bakugou?”\nThree seconds passed - four.  Silence.  Regret swamped Todoroki.  Had he taken the joke too far?  Midoriya had been pretty clearly upset by the incident and-\nMidoriya burst out laughing, his breaths coming out in gasps.  “What??  S-shouto, ahahah, that doesn’t even make, hahah, sense!  Mouthing, mouthing off on what, ahah?  Kirishima??”  Midoriya grabbed his stomach, throwing his head back against the wall as tears began beading in his eyes.  A snort escaped Midoriya.\nAnd heavens, did Todoroki want to kiss him.  \n“Yes, probably Kirishima.”  Todoroki forced his heart into a lower gear.  “I, um.  You can hang out in my room until the, er, storm passes, so to speak.  If you want to avoid anything potentially scarring.”\nMidoriya straightened, wiping his eyes.  “I’ll take you up on that.  I think my childhood has taken enough critical hits as is.”\n \n \n“Make yourself at home,”  Todoroki said, as Midoriya took him up on the offer and collapsed onto his bed.  The image did funny things to Todoroki’s stomach, and he swallowed thickly.  “I’m going to go wash my face.”  Midoriya nodded as Todoroki shut the bathroom door behind him.  \nSafely retreated, Todoroki forced himself to breathe evenly as he turned on the sink.  He dragged soapy hands down his face, rubbing his temples with more vigor than necessary.\nThis was not a good idea,  Todoroki consulted his reflection, a bead of water running along his busted jaw.  Hell, it hadn’t even been five minutes, but signs of the boy were already surrounding Todoroki, smothering him, from the his strawberry scent to his quiet humming to the Midoriya-sized crater forming on Todoroki’s bed.  \nThe door creaked open.  “Sorry, I think there’s something in my eye.”  Midoriya joined him at the sink, pulling at his bottom lid.\nTodoroki backed away, carefully, and toweled off his face.  Composure.  Remain composed.\nMidoriya let out a small sound of triumph, blinking rapidly.  “Thank god.”  He paused.  “Oh hey, this is that mirror of yours that I’ve heard so much about.”  Midoriya smiled.  “I trust it does its job well?”\n“If by ‘well’ you mean ‘revealing my terrible bed head every morning’, then yes.”\n“B-bed head?”  Midoriya faltered, eyes unfocusing.  “That’s, wow, um.  That’s funny.”\nTodoroki simply shrugged, and leaned back against the bathroom wall.  \nMidoriya blinked and straightened.  “Aha, just because your hair normally looks so well put-together!  Mine is hopeless.  No matter what I try, it always looks like a just woke up from one of my biweekly hospital naps.”\n“Don’t exaggerate - you were only hospitalized once last month,”  Todoroki deadpanned.  “And you shouldn’t worry about your hair.  At least it isn’t candy cane themed.”\n“But people like candy canes!  There are much worse things than candy canes.  For example, bird’s nests,”  Midoriya pulled on his bangs.\n“I happen to like bird’s nests.”\nMidoriya’s cheeks brightened, and he promptly broke their eye contact.  Todoroki followed his gaze.  His bathroom floor grout had never enjoyed such intense scrutiny.\nSuddenly, Midoriya groaned and whipped around to face Todoroki.  “I, when you say things like that, like that you ‘like bird’s nests’, or that you're i-interested in your classmates-- why,”  his cheeks burned brighter.  “Why do you say them?”\nThat was an odd question.  Todoroki shrugged again.  “Because they’re true.”\nMidoriya chewed on his lip.  “And that’s all?”\nTodoroki’s brow knit in mild confusion.  “Yes?”  Then, more softly.  “I am always genuine when I’m around you Izuku.”\n“Ah, I - I see,”  Midoriya’s voice, strangely, had gained a slight wobble.  His eyes darted back towards the grout.  “Well, uh, I think it may be best if I leave now.”\nTodoroki’s brow furrowed deeper.  Had he fucked something up?\nUpon another glance, the line between Midoriya’s brows was markedly unstable, so yes, Todoroki had fucked something up.  Typical.\nHe didn’t want Midoriya to leave like this, all sad and gloomy and decidedly non-Midoriya-esque.  \n“You should stay.”\n“Huh?”  Midoriya’s head whipped back up.  One of these days he’s gonna develop neck problems.  “Why?”\n“Besides the fact that we want to avoid the second erosion of your ‘childhood’, I,”  Todoroki took a deep breath  “want you to stay.”\n“Oh,”  Midoriya breathed.  “Then alright!”\nAh, that was more like it, with the thousand watt smile fully operational once more.  That smile that made Todoroki do stupid, stupid things, like say:\n“You might as well just sleep over, if you want.”\n1,000 watts quickly became 10,000, and Todoroki swore he could nearly taste Midoriya’s excitement in the air.  \n“I’ve always wanted to have a one-on-one sleepover,”  he was babbling.  “I had some with Kacchan when I was a kid, but now that Kirishima ruined that period of my life forever, I need to make some new memories.”\nOverwhelmed, Todoroki fell back to his customary nod.  He had made a terrible mistake, and he knew it.  A goddamn sleepover, while presumably still under the truth quirk.  Some A+ strategizing, really.  Oh well, the only course of action now is to avoid other mistakes at all costs.\n“Ah, crap,”  Midoriya looked down at himself.  “I don’t have any clothes to sleep in.”\n“You can use some of mine,”  Todoroki said, making another mistake.\n“Awesome, thanks!”  Midoriya gave what might have been the cutest thumbs up of all time, and Todoroki realized that it was high time for a Time Out.\n“I’m going to take a shower,” he declared, firmly guiding Midoriya out of the bathroom.\n“Wait, but haven’t you already taken one today?”\n“Yes.”  The bathroom door clicked shut.  “Feel free to wear anything you can find.”\n \n \n \n \nThe water pressure was harsh, pelting Todoroki’s skull.  Good.  Maybe the water could beat some sense into his head.\n Just like Izuku beat the shit out of my face.  Todoroki flinched as the stream hit his bruise.  Damn, that kid was strong. Todoroki sighed. So strong...\nHe didn’t even bother reaching for the shampoo or conditioner, or the bunny loofah he’d won during last year’s Secret Santa.  Getting clean wasn’t really the point, now was it?\nThe point was to...well, scheme to redact his sleepover promise, he supposed.  Or at least formulate a game plan to avoid making even more of an ass of himself while Midoriya was over.  \n“What’s the worst that could happen?”  Todoroki questioned out loud, his voice all soggy in the humidity.  It hardly helped boost his confidence as he’d hoped.\nBecause a whole hell of a lot could happen, and he knew it.  An adorable, sleepy Midoriya in the same room as a scarily forthright Todoroki?  Lord have mercy. He could already imagine it: his fluffy green hair even messier than usual from his pillow, his nose scrunching up as he yawned, sleepily scratching at his stomach and flashing a hint of abs that would most definitely wreak havoc on Todoroki’s circadium rhythm.\nHell, with Todoroki’s luck, he could imagine himself getting up to pee in the middle of the night and tripping over Midoriya, then landing on top of him like some cheap, contrived scene from an ecchi.  Assuming Midoriya would be sleeping on the floor next to his bed, that is. And if not...\nOh  god, if they shared his bed.  Todoroki swallowed, not even registering the water hitting his face anymore.  Those things were not wide, especially for two adolescent guys. They’d practically be breathing in each other’s faces.\nTodoroki squirmed underneath the water stream.  Or-or what if...Midoriya faced the other way, back towards Todoroki and arching slightly as he got comfortable.  His back arching in a way that made Midoriya’s body threaten to invade Todoroki’s personal space, leaving mere centimeters between Todoroki’s hips and Midoroya’s, Midoriya’s…\nWith a start, Todoroki opened his eyes, only to wince as they were hit by some spray.  \nAnd then winced again when he realized the path his right hand had drifted down.  \n(Hint: the same path as a healthy proportion of his blood.)\n“No, Shouto, not now,” he whispered aloud, but yet again the words proved hardly convincing.  Not when there were images of messy green hair filling Todoroki’s vision as the boy laid next to him.  Midoriya would be a very careful little spoon; if he happened to shift up against Todoroki, surely it was on accident.\n Oops, Midoriya would shoot a coy grin over his shoulder as he moved against Todoroki, ass pressing right up against Todoroki’s hard dick.  Mm, maybe not accidental after all.\nThere was no point in fighting it now, right?  Todoroki wrapped his hand around his cock.  Right.\nWith an offhand comment about his shorts being “annoying”, Midoriya would kick them off, leaving himself deliciously near-naked, his perky butt peeking out from underneath a too-large pajama shirt.\nAnd  oh,  what if that shirt was Todoroki’s own, what if it was his own shirt that Todoroki snuck a hand under, greedy fingers reaching for a hard nipple as Midoriya’s perfect, adorable ass grinded up on Todoroki, whose own cock was straining against his boxers and leaving a damp spot of pre-cum on the fabric.\nMidoriya, ever-vigilant, would pause in his grinding to shoot a sympathetic glance Todoroki’s way.  Surely that can’t be comfortable… he’d muse, pushing Todoroki onto his back, only to promptly straddle him.  \nKissing down Todoroki’s writhing abdomen, Midoriya would stop at the elastic waistband, fingers hooking slightly underneath it.  Definitely uncomfortable, Midoriya would decide, and without a second thought, tear the boxers down.  Todoroki’s hard cock would spring free, bobbing in front of Midoriya’s grinning mouth.  \nMidoriya would give an experimental lick, right on the head.  Todoroki moaned. “Please, more…” he whispered. \n“Shouto?”  Midoriya would say, lips teasing at the tip of his cock. “Are you alright? I’m pretty sure I smell smoke!”\nReality suplexed Todoroki harshly, his eyes popping open.  He lurched fully upright, head spinning, and oh god he was near smoking wasn’t he, so, addled brain free of the cruel mistress of Rationality, he lunged with his unoccupied hand and turned the shower dial all the way towards C.\nThen promptly yelped, because Jesus  fuck that was cold, especially for someone who didn’t normally need to endure extreme temperatures, and poor poor Todoroki Junior was not happy, losing blood more quickly than a shanking victim.  Since when did the dorm showers respond so quickly to instructions, anyways?!\nAnd fuck, now his head was starting to pound, Midoriya had asked a question—“I’m alright now!  I was just uh… lost in thought.”\nThoughts of deflowering the same boy who was standing just mere meters away, sure, but thoughts indeed, and Midoriya seemed satisfied by the reply.  It was high time to get out of this shower.\nToweling off and throwing his clothes on rather haphazardly, Todoroki threw open the bathroom door, only to spot his friend--yes,  friend-- situated adorably on his bed, criss cross style.  A real 10/10, A+ Midoriya.\nOut of the frying pan and into the fire, huh.  \n“Hey, Shouto.”  Midoriya smiled.  “I went ahead and changed into some of your pajamas, if that’s ok!”\nSo he had.  “Ah, yes,” Todoroki forced out, rather occupied noticing the way that the too-large t shirt dipped beneath Midoriya’s strong collarbone.  Todoroki Junior twitched; apparently he wasn’t gonna let that polar bear plunge keep him down for long.  If nothing else, let it never be said that Todoroki lacked resilience.\nCatching himself staring, Todoroki tore his eyes from his good, platonic friend and sat down opposite of him, painfully aware of every creak the bed squealed out.  Why was Todoroki cursed to ooze awkwardness with every action?  For a mere twin bed, that thing sure could generate an ungodly amount of sound.  Maybe he should’ve thought about that particular impracticality to stave off his little foray into fantasy while in the shower.  Yeah, the sarcastic part of his brain replied, it really would've calmed him down to think about how much his puny little bed would creak while he passionately rocked into Midoriya.\nHe definitely should’ve thought about it then, and not now.  Todoroki Junior helpfully introduced the concept of Midoriya producing sounds of his own, making Todoroki Sr. swallow, and Jesus Christ, speaking of noisy acts, Todoroki was pretty sure that singular swallow had breached a hundred decibels.  \nWhy did he have to be the most awkward human being on the planet?!\n“So,” Midoriya began, and Todoroki absolutely did not nearly jump out of his skin with the sudden word.  “What do you wanna do now?”\nTodoroki leaned back on his arms, looking up at the ceiling in contemplation.  Just be chill.   “To be completely honest, I really want to do you.”\nIt took all of 5 seconds for Midoriya to turn completely red, and for Todoroki’s soul to vacate his body.  “W-w-w-w-wha,” Midoriya sputtered, well on his way to a Guinness world record for longest consecutive stutter, until Todoroki graciously interrupted.\n“Yeah, when I said I was lost in thought earlier, I was actually jerking off thinking about us sleeping in the same bed,” he blurted, before he could even think, react, throw himself out the window.  “Not just sleeping, obviously, but I feel really bad for thinking about that stuff because you’re still my best friend even though you’re super hot and have an amazing ass and sometimes I catch myself staring and remember that one time I set the gym on fire?  That’s because you were—“\nTodoroki slapped a hand over his mouth as hard as he could manage, knocking his teeth painfully.  What the hell was going on?! This wasn’t part of the quirk, he hadn’t bargained for this, Midoriya looked like he’d been punched in the gut, Todoroki had never been more embarrassed - holy hell Midoriya’s expression - and an excruciating cramp seized Todoroki’s sides.  \nTodoroki gasped in pain, parting his mouth just enough for disaster to strike.  “But that doesn’t even touch one night when I had a dream - ” Todoroki’s heart stopped.  He knew this dream. “ - where you were wearing a uniform skirt - ”  No no no no, stop!  “ - and a blouse, but let me tell you, the blouse didn’t last long - ”\nA resounding thwack cut Todoroki off, and he felt dizzy from just how hard he’d slammed the pillow against his face.  His words, blessedly, were effectively muffled, at least for the time being.   \nHe needed to find a way around this, and fast, because no way in fuck was Todoroki going to finally reveal his feelings for Midoriya like, like this, this coerced word vomit.  \nNot like Midoriya hadn’t definitely put two and two together by now, but Todoroki wanted to profess an ‘official’ confession, with flowery words and flowery bouquets, with sweet, heartfelt sentiments.  Todoroki may not be a modern Casanova, but he could do better than this, and Midoriya definitely deserved the best Todoroki had to offer, more than the best.  Not -\n“ - I get turned on when you kick ass in fights - ”  Todoroki increased the pressure of the pillow, feeling lightheaded.  \n“S-shouto?”  Midoriya looked legitimately frightened.  “Something is definitely wrong, we, we need to get Recovery Girl or someth -crap, she’s travelling.  B-but don’t worry, I’m gonna fix this for you, Shouto.  Shouto?”\nMidoriya’s face blurred, and Todoroki swayed.  Oh yeah, breathing was a thing. Or wasn’t, now, with this pillow, and his stomach was convulsing and lungs aching and head swimming and Midoriya was reaching out to touch him, oh no.\nSo Todoroki fled, hit Eject without a parachute and booked it to the door, flinging it open with the last bits of oxygen floating in his blood.  \n“W-wait!”  Midoriya called from back in the room, but Todoroki kept running, skidding to a halt before the door to the stairwell.  No other choice; maybe it’ll stop Midoriya, also.\nWith his throbbing mind made up, Todoroki dashed inside, throwing the door shut behind him as he raced down the stairs.  \nHalfway down, he removed the pillow from his face, gasping violently as he finally rounded the final corner and set his sights on the next flight of stairs and then--\n\nThwump!\n\nTodoroki’s (slobbery) pillow flew into the great unknown as the teen found himself tumbling rather painfully onto the ground, his vision swimming.  Jesus, his jaw hurt, and what the hell had even happened in the first place, had Midoriya followed him?, and why was his pillow across the room when all he wanted to do was nap or perish or—\n“Shut the fuck up about your shitty pillow and get the hell off of me!”  A voice screamed in Todoroki’s ear--which was a great help for his headache, really--and Todoroki suddenly registered the  very warm body underneath him.\nAs well as the sparking of an explosion-in-the-works dangerously close to Todoroki’s face.\n“B-Bakugou?!  What in the hell, I thought you were with Kirishima, you know, making out, which to be honest I was kinda jealous of because I-”\nThe sparks grew hotter, and Todoroki’s oxygen-deprived brain finally registered the actual likelihood of death.\n“F-fuck, cool it with the explosions, one scar is more than enough.”\n“Then move your ass!”  Christ, they really were close--practically laying on top of each other.  Like that contrived ecchi scenario he’d thought of earlier, but with the worst possible plot twist.\n“I don’t wanna hear about your weird fucking ecchi fantasies, just get the fucking fuck away!”  Bakugou grabbed Todoroki by the shoulders and began pushing them apart, until Todoroki’s knee followed perhaps the most disastrous route since the passage of the  Titanic and feather-light, ever so lightly, brushed against…\n“Oh my god you have a boner.”\nA beat.  “Holy shit you’re huge!”\nIt took no less than three seconds for Bakugou’s face to fill with a truly brilliant red and for his face to perform a violent jig between pride and mortal embarrassment, expression morphing to and fro.  “H-hell yeah it’s big, and y-you, Kirishima just left to take a piss for a second, alright, this isn’t because of you, got it, you fucking, fucking stop sign bitch!”\n“Oh my god I’m laying on top of you while you have a boner and I’m gonna need so much therapy and I—“\nBakugou seized Todoroki’s collar, yanking them nose to nose.  “If you so much as blab a single fucking  syllable about this,”  he growled, “I will personally escort your innards to--”\n“Sh-shouto?  Kacchan?”\nTwo heads whipped around and beheld a very wobbly Midoriya, whose legs looked well on their way to mutiny.\n“Deku?!\"  Bakugou roared, just as Todoroki yelled a desperate “It’s not what it looks like, Izuku!  Even if Bakugou does have a boner. A  big one.”\n“Oh you are fucking  dead.”  Bakugou seethed, rolling over so that he was on top and cocking his fist threateningly.  Yet somehow the threat didn’t land very well, as Bakugou hunched over him awkwardly, making sure to hold his hips up as far as possible from Todoroki’s body.\n“A...boner?”  Midoriya whispered distantly, legs finally waving a white flag as he more collapsed than sat on the stairs behind him.\nSparks began crackling over Bakugou’s fist.  “Half and Half is about to become nothing and...nothing.”\n“Not your best work,”  Todoroki’s stupid, stupid mouth supplied, and Bakugou’s face glew impossibly brighter.\n“I must be dreaming,”  Midoriya muttered in the background.  “Please tell me this is a dream. I never would’ve, I didn’t ever expect...you can do so much better, Shouto.”\n“Oi!”  Bakugou turned to shoot a glare at Midoriya, buying Todoroki precious seconds before death.  \n“Izuku, please, it’s really not what it looks like, even though it looks like I was grinding on your childhood bully in the stairwell and okay I just noticed this but he also doesn’t have shirt on.  But mine is on. Super on. Unless you want me to take it off. Then it’ll be super off.”\n“This can’t be happening,”  Midoriya groaned, burying his face in his hands.\n“I know it looks bad, Izuku, but when you just consider how stupidly in love with you I am it doesn’t make sense for me to do anything with Bakugou, or anyone else for that matter.  You’re the only person I dream about, think about so much it feels like I hardly think about anything else, the only person I wanna kiss so bad it hurts. You’re the only one I want to wake up next to in twenty years, to see your beautiful smile light up our home every single day.”  Todoroki took a deep breath. “Also you fight good.”\nAnd just like that, he’d done it.  Said everything—with horrifying ineloquence, but said it nonetheless.  Said the words that had been so mercilessly restrained within his heart for years, the same heart that was rattling against his ribcage so vigorously that it seemed it might escape.\nAnd Midoriya, oh, he was simply stunning, his gorgeous green eyes widening as a scarred hand clasped at his chest, as the moment slowed and stretched into infinity.  \nA moment Todoroki could never forget.  Just him, Midoriya, and-\n“Fuck this, man.”\n-Bakugou, who rolled the pair over and all but blasted Todoroki off of him.  The world pixelated suddenly as Todoroki felt himself whoosh backwards until he felt strong arms steady him, belonging to none other than…\nMidoriya.  Todoroki’s entire world sighed in content.  He turned to face the smaller boy. “Izuku, you’re the most amazing person I’ve ever met, and I want to go get ice cream and watch movies and shitty anime with you, and you’re so strong, holy fuck, I love you, I want you to pick me up and—“\n“Fucking gays, need to get a goddamned room,” Bakugou scoffed as he stood, dusted himself off, then beat the hastiest retreat this side of France, not even bothering to collect his discarded tank top as he beelined for the exit.\nThe door slammed with a sharp clank.  The remaining pair, rooted in place, froze.  Todoroki's blood went cold for a split second, then returned to normal.  Huh?\nSilence again.\nUntil Midoriya coughed, wringing his hands.  “Hey Shouto, I…”\nHe cut himself off, and Todoroki took a step forward, shortening the distance between them to about a meter. Midoriya gulped, then visibly gathered himself, straightening.  “Shouto, I’m willing to forget all about this if you want to.”\nTodoroki’s brows furrowed, his confusion heightened by something else that was... off, that he couldn’t quite put his finger on.  \nBut Midoriya continued before he could voice his concerns.  “Obviously, you got hit by some sort of quirk, or illness, or hell, maybe I really did give you a concussion, but the important thing is that, is that,” Midoriya bit his lip, looking down, “y-you clearly aren’t acting like yourself and I-I, the last thing I want is for things to be awkward with us because some f-freak accident made you come up with all that random stuff.”  \nHe sucked in a ragged breath, the line between his eyebrows wobbling dangerously.  “Quirks make people do the c-craziest things, a-act completely irrationally, ya know.  Y-yeah.” Midoriya trailed off. “Even though it seems like it’s run its course anyways…”\nOf course, that was it!  The godforsaken quirk had finally run out.  The 12 hours must have passed! How else could this oppressive silence exist with Midoriya toeing at the ground and Todoroki desperately trying to fit right words together?\nBecause holy shit, he couldn’t let  this  happen, of all things.  A blatant rejection?  Fine.  It’d suck, but at least Todoroki’s intentions would be clear.  But this?  With Midoriya about five seconds from crying, all because Todoroki was too idiotic to mitigate his own situation and ride it out in solitude?  Or, at the very least, to fix the mess he’d put himself in?\nNo fucking way.\nSo he closed the gap, grabbed Midoriya by the shoulders and stared right into his watery eyes.  “I, uh, Midoriya. I-Izuku. I need you to know that, that…” Midoriya’s eyes widened. “That I don’t have a concussion.”\nMidoriya blinked once, twice.  A third time. Then closed his eyes briefly.  “Sure, Shouto.” He opened his eyes again. “You know what, let’s just talk about this later after you’ve had a full night of sleep, what do you say?”\nOh god, no.  In a Shyamalan-level plot twist, Todoroki found himself missing the quirk’s affliction.  At least then he could effectively articulate what was on his mind, word-vomit notwithstanding.\nMidoriya sighed, and moved to remove Todoroki’s hands from his shoulders.  For a brief second, scarred hands covered his own, and something in Todoroki snapped.\n“I’ve been in love with you since first year!”  He blurted. “And that’s not some lie, or hypnosis, or b-brain damage, or whatever the hell else.  I've been acting like a complete idiot all day because I got hit with a quirk that made me tell the truth.  B-but that's how you can know that it's really me.  Me, Todoroki Shouto, the same Todoroki Shouto that’s known you for three years now!”\nMidoriya’s mouth fell open, the puzzle pieces clearly falling together in his mind, and Todoroki may or may not have been shaking, but he forged onward, the words practically tumbling out of his mouth.  “The same Todoroki Shouto that’s so happy to call you my best friend. The same Todoroki Shouto that you broke so many fingers to save during first year.  The same Todoroki Shouto that burnt cookies with you that one time and set off the fire alarm. Then Bakugou yelled at us, even though he’s literally the last person qualified to complain about smoke.  Besides me.”\nTodoroki took a deep breath.  Midoriya’s mouth had nearly closed, his face tilting up to stare at Todoroki with such intensity that he felt himself begin to blush.  Well, no use in stopping now.\nTaking Midoriya’s hands in his own, Todoroki pulled him closer.  “I’m the same Todoroki Shouto that asks you for help with English every week.”  He smiled. “I’ve been fluent since middle school. I’m the same Shouto that was too wimpy to ask you to dance at last year's winter formal, that’s dreamt of kissing you too many times to count.\n“And you’re the same Midoriya Izuku that helped me experience true friendship for the first time in my life, the same Midoriya Izuku that inspires everyone I know to work harder, to become the most they can be.”  Todoroki squeezed Midoriya’s hands. “The same Midoriya Izuku that I once burnt a shirt off to try and impress. The same Izuku who I love so much that I can’t believe it took me a goddamn quirk to make me confess.”  \nOh Christ, he was shaking pretty badly, wasn’t he, and that was to say nothing of his voice cracking all over the place.  Not to mention his sweaty hands, which of course Midoriya could feel. Geez, he probably seemed so lame, especially with that pathetic excuse of a confession, now poor Midoriya was gonna have to walk on eggshells around him because he had completely ruined their dynamic and crossed all of the lines and—\n“Did you actually burn off a shirt to try and show off your abs?  I mean, I’m assuming it was your abs...”\nAand cue the record scratch.\n“Eh?”  Todoroki went even deeper scarlet.  “I, well. What happened was- well, I kinda got carried away during that whole monologue and, um, not everything I said is super important, aha, I—\"\n“Just answer the question, Shouto.”  Oh god, Midoriya was grinning, and it was so fucking adorable.\nHow could Todoroki say no to that smile?  “Yeah. Uraraka convinced me it was a good idea.”  \nTodoroki felt many things as Midoriya burst out laughing.  Firstly, he felt embarrassed, to go ahead and round out the motif of the day.  Secondly, he felt delightfully dazed; for a laughing Midoriya a lovely sight did make.  \nThirdly, he felt a sudden, wet pressure on his lips.  Then hands in his hair.  Then warm breath on his neck as Midoriya pulled back.  “You should thank her, then.”  Green hair tickled Todoroki’s neck as Midoriya nuzzled against his chest.  “Because it totally worked.  Also, you better fess up about that uniform skirt dream of yours, mister.”\n\"Yes, sir.\"  Todoroki grinned into Midoriya’s hair, tightening his arms around Midoriya’s back.  \n“Now what were we up to?”  Midoriya’s muffled voice mused.  \nTodoroki wasted no time in reminding him, grabbing Midoriya’s chin and planting a kiss on those perfect, perfect lips.\nThen another.  And another. And about 10 more for good measure.  Todoroki kissed the  shit out of that boy.\nTodoroki felt scarred hands ball up in his t-shirt, the reverberation of Midoriya’s satisfied hums curled up in the back of his throat, and his own heart pounding so loudly it’d put a 21 gun salute to shame.  \nTodoroki also felt the draft from the stairwell air conditioning tickle the back of his neck, and certainly did not feel the seconds turn into minutes as he continued to lay an all-out onslaught of kisses on Midoriya.\nBut most of all, Todoroki felt complete.  \n \n "
}