{
    "id": "12124134",
    "url": "https://archiveofourown.org/works/12124134?view_full_work=true",
    "author": [
        "proser"
    ],
    "title": "It's A Good Car, Dammit",
    "rating": "Not Rated",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Hannibal (TV)"
    ],
    "relationships": [
        "Will Graham/Hannibal Lecter"
    ],
    "characters": [
        "Will Graham",
        "Hannibal Lecter",
        "Franklyn Froideveaux",
        "Beverly Katz",
        "Jack Crawford",
        "Alana Bloom"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence",
        "Established Relationship",
        "Secret Relationship",
        "Season/Series 01",
        "Fluff",
        "Domestic Fluff",
        "lots of sugar metaphors",
        "if u know what i mean",
        "Bad Puns",
        "Hannibal Loves Will",
        "Cars",
        "Possessive Will Graham",
        "Murder Husbands",
        "franklyn has it coming"
    ],
    "language": "English",
    "series": "",
    "published": "2017-10-13",
    "completed": "2017-10-28",
    "words": "11,077",
    "chapters": "2/2",
    "comments": "176",
    "kudos": "6,843",
    "bookmarks": "1,294",
    "hits": "57,165",
    "summary": "<p>Will never shares with anyone. His thoughts, his possessions, and his life are all his and his alone. </p>\n<p>Hannibal doesn't take from anyone. He prepares his own food, cleans his own house, and uses his own supplies. </p>\n<p>So, when Hannibal starts driving Will's car everywhere, people are curious. Trust is so rare with these two, and it both makes perfect sense and is utter nonsense that it would reside between them.</p>\n<p>(Basically, Hannibal borrows Will's car and everyone is super nosy about it.)</p>",
    "notes": "<p>Prompt (and title) is from my wonderful friend/mentor/test-reader <a href=\"https://archiveofourown.org/users/diamerizein\" rel=\"nofollow\">diamerizein</a>, who wanted a one shot in which we all learn that Will's car is a very good car, among other things. </p>\n<p>To quote her rant:</p>\n<p>\"Will drives a <a href=\"https://en.wikipedia.org/wiki/File:Volvo_V70_--_01-07-2012_front.jpg\" rel=\"nofollow\">Volvo V70</a>. people of Hannibal's social class have that car (they're just not the only ones who have it like with the Bentley), and for real if Hannibal weren't expected by all of Baltimore to be his SUPER extra self it honestly wouldn't be that out of place at the opera, and the standard interior has heated and super comfy seats (like 5-day roadtrip comfy) and since it's a Swedish car it's def. built for large Scandinavian people (*cough* Mads). Also it has a manumatic transmission where like it's an automatic but you can switch into a mode where you can choose when to upshift and downshift instead of the car deciding for you, which is not a standard feature of anything but higher-end cars. And it was the safest car in the world when it was brand new (mine was a 2001).</p>\n<p>I loved that car so much, I got mine as a 14-year-old hand-me-down and it was in better shape than a lot of 5-year-old cars I've seen</p>\n<p>so basically: Hannibal approves but is horrified anyone would allow so much dog hair in something so nice\"</p>\n<p>It's not so much about the car, but here it is :)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Look at me, not updating my WIPs....</p>\n<p>To be fair, this has been in my drafts for like two months.... </p>\n<p>More updates to come soon, here's this in the meantime.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">more notes</a>.)\n</p>\n<p>Just putting it out there, it's a really weird thought that Hannibal has to fill his own gas tank. Because, like, that's a thing that every American (sans citizens of Oregon and New Jersey) has to do. Like, Hannibal goes to grimy gas stations (because which ones aren't?) and fills his Bentley (or in this case, the Volvo) with fucking GASOLINE. </p>\n<p>And because I have yet to take driver's ed courses, I did have to look up the terminology involved with gas pumping. One how-to guide called the fuel door the \"filler hole\" and suddenly gas refill took on a whole new meaning and I don't like it at all.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>and that's where i'm leaving it....</p>\n<p>i'm considering writing a longer prequel to this, where will figures out hannibal's plan to frame him for the copycat murders and essentially ends up seducing him to prevent that.</p>\n<p>would y'all be down for that?</p>\n<p>Kudos and comments validate my existence and show me your love for this story :)</p>",
    "text": "When Hannibal arrives home, he can smell Will in the house. It's not just the lingering scent left from his (increasingly frequent) time spent here, either. It's fresh, and it fills him with a pleasant heat.\nAnd this time, he notes happily, Will doesn't bring with him the reek of the morgue. Instead, Hannibal is met with the a sweet fragrance in the air, and a smile forms on his lips. \nHe hangs his coat and hurries into the kitchen, where Will is standing at the stove in front of a boiling pot.\n\"What have we here?\" Hannibal wonders, stepping in behind Will to place a hand on his hip. The pot is the source of the sweetness in the air; a pale brown liquid bubbles, the result of boiling raw sugar and water.\nWill leans into him, craning his neck to smile at him. \"I'm making coffee liqueur,\" he says. \"This is the syrup.\"\n\"Then you might want to let it cool now, my darling.\" Hannibal reaches around Will to turn the heat off, pressing a kiss to his cheek as he does so. \"The sugar is entirely dissolved.\"\nWill leans further into him, his head tilted back against Hannibal's shoulder. \"You said you wanted me to try cooking,\" he mutters. \"Let me be the one to determine whether my sugar is dissolved.\"\n\"Isn't it my sugar?\" Hannibal hums.\n\"The only sugar I'm taking from you, I think,\" huffs Will. He slides out of Hannibal's grip and goes to the refrigerator, where he removes a glass jar filled half-way with coffee. He twists open the lid, and Hannibal breathes in the scent of the brew.  \nHannibal takes the jar from Will and takes another whiff. He recognizes the blend as one of his own: the Ecuadorian espresso that Will has been so fond of lately.\n\"When did you make this?\" he asks. \"Cold brew is generally made overnight, and you weren't here earlier today.\"\nWill shrugs. \"I may have nabbed some of your fancy beans last week,\" he says, smiling coyly. \"Somehow, I can't stomach Folger's anymore. A shame, really.\"\n\"You made this at home, then,\" he remarks, pleased with how his own tastes now influence Will's. \"But you decided to do the rest here.\" He smiles and cups Will's cheek. \"Was this an excuse to see me, Will?\"\nRolling his eyes, Will snatches the jar from Hannibal and turns away to set it on the counter. \"I didn't have any rum at my house, and you have that fancy bottle that you never drink.\"\nHannibal wants to argue that he plans to use it for a holiday dessert, but he hasn't yet decided what.\n\"And why, my sweet, are you making coffee liqueur in the first place?\" he asks instead. \n\"It's Beverly's birthday next week. Now, would you mind telling me where you keep your vanilla beans? I know you have them.\"\n\"In the spice cabinet, third shelf,\" he answers. \n\"Dammit, of course it's in the spice cabinet,\" Will sighs. \"I was looking with your baking ingredients.\" He crosses over and stands on his toes to reach into the cabinet, immediately identifying the jar. He takes a bean and drops it into the coffee jar.\nHannibal smiles idly and moves to check and see if the syrup is cooled. \"Will Miss Katz question this gift? That is Madagascar vanilla, after all.\" He dips a finger in, sees that it's still warm, licks his finger clean, and washes his hands, ignoring his own uncleanly transgression.\nJust as he has changed Will's tastes, Will has changed his.\n\"Are you saying I couldn't afford to give a gift like this on my own?\" \nHannibal turns the tap off and goes to place a wet hand on Will's chest, admiring the handprint left on his shirt. \"You still insist on wearing your own bad aftershave,\" he says, hand moving to toy with the shirt collar. \"I'm simply wondering what's driven you to take advantages of my resources now.\" \n\"Resources?\" Will questions. His own hand reaches up to take Hannibal's, pulling them back down to their sides. \n\"Previously, when I have said what is mine is yours, you have refused that offer,\" he elaborates, staring down at their joined hands. \"What's changed?\"\nWill bites his lip, dragging Hannibal's eyes to focus there. \"I don't know,\" he admits. \nHannibal sighs and kisses him, pulling him close, tasting the sugar on his lips, making sure the kiss itself is just as sweet. When he pulls away, he says, \"I'm happy that you have, Will.\"\n\"Me too, I guess,\" Will mutters, leaning back in.\nHe initiates a second kiss, one with more tongue and more energy than what Hannibal offered. It sends heat flushing through him, and he grips at Will's shirt. He's overwhelmed, aroused and delighted, but the thought that Will can so easily make him forget about the rest of the world makes him pause. \nWill senses it, and he breaks off, frowning. He runs his hands over Hannibal's vest, looking into his eyes. When he clearly doesn't find anything there, he asks, \"How was work?\"\nIt's a question Hannibal intended to avoid, but he sees no point in aversion now.\n\"Terrible,\" he confesses. \"Though I might feel better if you kiss me like that again.\" His gaze falls back to Will's lips, and he would be much happier if they were just slightly swollen. \nWill raises his eyebrows in disapproval. \"Don't tell me it's more of the same, Hannibal,\" he growls, not to be distracted.\n\"I won't,\" he promises, intent on making sure that Will is distracted. Thoroughly.\nWork is more of the same, but he needn't say anything if his mouth is otherwise occupied. He leans in for more, but Will ducks away.\n\"Hannibal.\" His tone is sharp as he steps away, cutting off physical contact.\nSighing from the sudden withdrawal, Hannibal crosses his arms. \"What would you have me do, mylimasis?\" \n\"Refer him to another psychiatrist,\" Will says, his eyes narrowed and sharp. \"He's crossing boundaries, Hannibal. It's repulsive. If he keeps stalking you like this—\"\nHannibal's smile is blasé as he places a hand on Will's shoulder. \"I'll kill him,\" he supplies. \"Or you will. Either way, it won't do for me to refer him just before he dies.\"\nTilting his head, a lovely, vicious smirk forms on Will's lips. \"We could stage it as a suicide,\" he offers.\n\"There would be no point. It would be a waste of a life.\"\nWill lets out a slow exhale and looks away.\nHannibal knows their opinions on murder, while both morally dubious by societal standards, differ strongly. \nWill would kill purely because he deemed his victim unworthy of living. The power that he holds with that line of thought intoxicates Hannibal, but he cannot take a life without taking sustenance from it as well.\nIt wouldn't do to have Franklyn Froideveaux commit suicide and also have a few organs missing.\n\"He's a waste of space, Hannibal,\" Will reminds him. \"And he's infringing on yours.\"\nAnd Hannibal knows how much Will values his space.\n\"Are you jealous, my darling Will?\" he purrs, stepping closer, infringing the space that he knows only he is allowed to. \"Surely, you understand that Franklyn is nothing. Compared to you—\"\n\"I'm fully aware,\" Will says, stopping Hannibal before he can be touched again. \"I don't need reassurance of your loyalty. I know I have it. What I don't have is reassurance of your—of our privacy.\"\n\nOur privacy.\n\nThe phrase has something delightful swimming inside of Hannibal.\nWill has never referred to them as a unit, never suggested that they shared anything beyond their relationship. Now, between the coffee and this possessiveness, Hannibal can't help but think that something has changed.\nIt's stirring.\n\"And what would you have me do to protect it, Will?\" he asks, his voice gone low. \"How can we ensure our privacy?\"\nWill swallows, and Hannibal watches the movement with barely-contained lust. He wants to pounce, to devour him. At the same time, he wants Will to tell him to kill Franklyn now, to demand that he—that they rid him of his pathetic existence.\nHe is filled with equally strong desires to hear Will order him to kill and for him to beg for him to kill.\n\"If you can't refer him,\" Will says, and his tone is disappointingly flat, \"you can at least try to avoid him.\"\nBlinking, surprised, Hannibal falters. He had hoped the mood would be taking a different turn, but Will is using the same voice he uses when they debate the best location to put the dogs.\n\"What do you mean?\" \nWill rolls his eyes. \"You're hardly inconspicuous, Hannibal,\" he points out. \"I mean, the suits alone are enough to make you stand out. And your car is no better. You can easily be followed; it's not hard to spot a Bentley.\"\n\"You're suggesting that I buy a different car? To avoid a patient?\" Hannibal frowns at that, perplexed. Will is usually very insistent about minimalism, and has done a lot to limit Hannibal's more extravagant purchases as of late.\n\"No, no.\" Will shakes his head. \"Don't be ridiculous. I was just thinking that maybe you could... borrow mine.\"\nThat just about floors Hannibal.\nIt might not be a stretch for Will to use some of Hannibal's things, but the opposite has never occurred. They don't share things, let alone Will's things.\nThe offer, while surprising, suggests a new level of intimacy. Perhaps this entire conversation has been Will leading up to it.\nWill wants them to start sharing. \nIt reminds him of the hesitance with which Will first stayed the entire night with Hannibal, the tentative quiet of their first breakfast together. Will doesn't share his life with others, and he doesn't share his possessions.\nBut he trusts Hannibal enough to offer.\nAnd he smiles.\n\"I can do that,\" he says, stepping closer without being stopped. \"If it's what you want.\" He lifts a hand to stroke Will's cheek, to meet his eyes and let the adoration shine through.\nHe wants Will to know he understands, that he's grateful.\nAnd Will responds by kissing him again, finally giving him what he wants. He runs his hands through Hannibal's hair, bites at his lower lip, makes him want to either submit fully or take Will completely.\nHe does neither, however, content with what he is given.\nWhen they come apart, Will's lips are perfectly, beautifully swollen.\n\"I know he'll keep stalking you,\" he sighs, fingertips tapping against Hannibal's jaw. \"But this will give us some time to come up with a proper way to dispose of him.\"\nHannibal closes his eyes, already envisioning the feast they'll have.\n\"I imagine we might be having foie gras soon,\" he hums, \"with such an ugly little duck in our grasp.\"\nHe imagines that Will's snort is one of approval and not derision.\nWill's car is old, yes, but it's in very good shape. With attentive hands and a mechanical mind, the Volvo has continued to work wonderfully well.\nWill insists that it didn't ever need much maintenance, of course, but Hannibal will always jump on an opportunity to compliment him. \nHis only issue with the vehicle is the amount of dog hair inside of it. He can't imagine how Will could have possibly allowed for it to accumulate the way that it has. It seems to fill every crevice, and even though the scent is such a strong part of Will, Hannibal can't help but grimace when he thinks of how impossible it would be to purge the car of the stink.\n\"It's not that bad,\" Will grumbles. He's sat in the passenger seat, and Hannibal is the one driving.\nIt feels strange to be the one behind the wheel in Will's car, or to be in it at all, really. They're headed to Wolf Trap so Will can gather his things. \n(\"And the dogs!\" Will exclaimed. \"I'm not leaving them at home when you're in charge of my main means of getting to them.\" The comment alone was enough to make Hannibal wonder if this was all some ploy to get him to finally give in and allow the pack into his home.)\n\"I suppose that depends on your definition of bad,\" Hannibal replies. It's an easy segue into the deeper discussion of society's oppressive ideals, but he fears the conversation wouldn't go well in this particular case.\n\"If you can handle being covered in blood,\" Will grumbles, \"you can handle the dog hair.\"\nHannibal clenches the steering wheel, dually amused and frustrated. \"Blood is much easier to clean off,\" he argues. \"I come into bloody situations prepared, after all. And I don't think you want me wearing a vinyl suit whenever I encounter your dogs.\"\n\"It's better than you avoiding them altogether.\"\nStill, everything goes well. Their arguments are so solely centered around Will's canine companions that it's become more of a joke than actual conflict. They have dinner at Will's home, and Hannibal does spend some time throwing sticks for the dogs.\nThey spend the night in Will's bed, and even though Hannibal wakes up covered in dog hair, he doesn't mind.\nWill is worth the clean-up.\nThey return to Wolf Trap with the dogs and a small suitcase full of Will's possessions.\nHannibal, of course, still takes his Bentley to his office. That is where Franklyn is guaranteed to find him, and Will's car being there would be a dead giveaway.\nAnd Will still needs his Volvo to drive to Quantico for lectures, after all. There has to be some normality in their new situation.\nRegardless, it's strange to have a guarantee that he will find Will in his home every day. Hannibal adores it all the same; being able to come home to Will, knowing that they will have the whole of the night together, is a sweet and rewarding promise.\nHannibal uses Will's car to run errands, and Will uses Hannibal's study to busy himself with case files and tying lures. In the evenings, they both take Will's dogs out to a park across town where no one will recognize them.\nThe looks spared for them by strangers are always fleeting, and Hannibal finds himself enjoying it. To be seen with Will, even while walking over half a dozen dogs, is a novelty. When they link arms or sit together on a park bench, fingers laced, Hannibal finds himself craving more public intimacy. \nHowever, it remains (albeit unspoken) that their shared privacy must be protected from more than just Franklyn. None of their friends or colleagues know of their involvement, despite the fact that they have been together for nearly four months.\nThis new arrangement complicates things, but it's also thrilling.\nHannibal wants someone to find them out.\nMore importantly, however, he wants this to continue. After just three days of sharing his life fully with Will, he finds the thought of going without him quite unbearable. \nHe hopes that there's no need to vocalize that thought; he hopes that Will already knows. \nOn the fourth day, Hannibal does not have any patients. \nIt's Saturday, and naturally, Will doesn't have to go to work, either. No classes to teach, and no murderers (so far) to catch for Jack. \nHannibal prepares them a languid breakfast in bed. He appeals to Will's more nostalgic tastes with beignets and fresh fruit, keeping the meal light. There are activities to focus on when enjoying breakfast in bed, and one of them is not the consumption and digestion of an elaborate meal.\nBreakfasts in bed are simple, romantic. Hannibal keeps his feasts to his table.\nThe feasts to be shared here are of a different variety. \n\"You look delightfully edible,\" Hannibal sighs, using his thumb to wipe powdered sugar from Will's bottom lip.\nWill sets the tray on the bedside table. \"That's either a compliment or a very loaded statement, coming from you.\" He raises his eyebrows at Hannibal, but his eyes belie his fondness.\n\"I would never truly eat you, my Will,\" he promises, pulling him closer now that their meal is done. He buries his nose in the crook of his neck to admire how Will's scent has been so quickly transformed with their time together. \"Not when I crave the sound of your beating heart, when I relish in the movements of your muscles, when I can breathe in your living essence.\"\n\"So, what you're saying is,\" Will huffs, \"that as soon as you're bored with me, I'm toast.\"\n\"I believe you would be a roast, my darling,\" he chuckles, and nips gently at the flesh of his shoulder, a playful reprimand. \"Though I assure you that will never happen.\"\n\"Not until I perfect the cannibalism puns, at least.\"\n\"Not even then, Will.\"\nWill laughs breathily, allowing Hannibal to pepper his upper body with kisses. Hannibal appreciates the opportunity to show his affection, knowing fully well that it's a rare thing for Will to allow himself to be coddled like this.\nIt only lasts a few minutes, however, until Will is rolling out of bed and stretching in a way that makes it all too tempting for Hannibal to pull him back in.\n\"What are your plans today?\" he asks. He's moved to get dressed, out of reach.\nHannibal props himself up to watch. \"The farmer's market is open this afternoon,\" he answers. \"I thought I might pick up produce for our dinner tonight.\"\n\"Your car or mine?\" \nWill takes one of Hannibal's sweaters from a drawer, and it catches Hannibal's attention, despite the way that Will is clearly trying to make it casual.\n\"Yours,\" he answers, the answer almost catching in his throat. He has a feeling it's what Will wants, and the thought still manages to shock him.\n\"Good.\" Will pulls on the sweater, and his fingers clutch at the soft fabric. \"Maybe dress down, too,\" he suggests. \"You'll be less recognizable that way.\"\nHannibal swallows, sitting upright. \"You make it sound as though I'm hiding from the law.\" Or like Will is trying to mark him, but he tells his hopeful heart that it's terribly unlikely.\n\"Come on,\" Will laughs, and steps into a pair of his own blue jeans. \"I'm just trying to protect you from a neurotic patient, not Jack Crawford.\"\n\"Of course.\" Smiling, Hannibal rises to join Will and admire the way his sweater seems to hang off of Will's form. \"But who are you protecting yourself from, wearing my armor?\" he queries.\nWill shrugs, the tips of his ears flushing pink. \"No one,\" he retorts. \"I'm staying in to grade papers.\"\n\"I see.\" Hannibal bites the inside of his cheek, wishing Will would join him at the market instead of busying himself with the mundane words of his students. \"I do hope you recognize, however, that flaunting your car and clothes does publicly conjoin our images. Are you prepared for that?\"\nWill avoids his gaze and begins walking for the door.\n\"I never said you had to wear my clothes.\"\nWhen Hannibal leaves for the market, however, he wears Will's jacket over his own semi-casual attire.\nThe market is busy as always. Hannibal finds that it's much easier to slip into the crowd this way, and he isn't sure whether or not he likes it. How is his ego to be fed if not by the snared gazes of passing strangers?\nBut beyond the crowd, he finds that he's suddenly become much more interesting to the vendors he's become so familiar with.\nThe reactions are mostly quirked eyebrows and curious smiles, but there's always the exception.\nThat exception comes from Janet Vern, the elderly woman that has been selling him grapes for the better part of the past two decades.\n\"Who's your beau?\" she asks, her tone gruff.\nHannibal recognizes it as her own surly brand of affection, but he frowns regardless.\n\"Beau?\" he repeats.\n\"That isn't your jacket,\" Vern says, and places his cloth bag of grapes onto the scale. \n\"It isn't,\" he agrees.\nShe nods, unimpressed by his response. \"Twenty-two fifty for these,\" she says, and hands him the bag. \"Now. How long?\"\nHannibal hands her the cash and keeps his expression neutral. \"Since I've borrowed the jacket?\"\n\"Since you took a lover, Lecter.\"\nHe smiles unabashedly, then. Vern's churlish charms have always amused him, and he's never found it in him to be offended by her bluntness.\n\"Approaching three months,\" he tells her. Three of the bloodiest, most blissful months of his life.\n\"And I'm just now finding out?\"\n\"My lover is quite shy.\"\nShe snorts, and then waves him off with a hand. \"When he's gotten over himself, maybe let me meet him. I'd like to know the kind of man that draws in my best patron.\"\nHannibal raises his eyebrows at her assumption. \"Him?\" \n\"The jacket, you fool.\" Vern scowls at him and rolls her eyes. \"Now, get going. You're scaring off my younger customers.\"\nHe would argue that she does that perfectly well on her own, but moves along to another stand. \nHe shouldn't be smiling as much as he is, but he finds it unavoidable. \nOn the way home, Hannibal stops to refill the Volvo's fuel tank. \nGas stations never fail to make him uneasy. Something about the flat, overhead canopies, the lighting, and the ever present-grime makes him feel vulnerable.\nNot to mention that everything smells like petrol, which is beyond overwhelming.\nHe's learned to tolerate the station where he fills his Bentley, but he's chosen to go somewhere else with Will's car. For privacy's sake, he wouldn't want anyone he's familiar with watching him use someone else's vehicle.\nHe watches everything out of the corner of his eye as he presses the nozzle of the pump into the fuel door (a handkerchief between his hand and the handle). The ritual never fails to make him wish he lived in Oregon or New Jersey, but the gas station attendants are frankly the only benefit he can imagine would come from living in either of those places. \nAfter a few minutes, Hannibal catches a figure passing in his peripheral vision. He pays them no heed until they do a double take, and he turns to look at them.\n\"Agent Katz,\" he says, nodding cordially.\n\"Doctor Lecter,\" she returns. Her expression is a befuddled one, darting between Hannibal and the Volvo. \"That's Will's car.\"\nHe nods, and the pump clicks. The tank is full, and he removes the nozzle and sets it back on the machine. \"I am aware,\" he says.\n\"Is he okay?\" she asks.\n\"Will is fine,\" he assures her. \"I believe he's working on paperwork for one of Jack's cases.\"\n\"So, you're just doing him a favor?\"\n\"I do Will many favors.\"\nKatz smiles. \"So I've noticed,\" she says. \"And he gave you his coat as a thank-you, huh?\"\nHannibal fingers the sleeve of the jacket in response. \"I left mine at the office,\" he offers. \nThe look of suspicion on Katz' face makes Hannibal want to scowl. \n\"And you were meeting with Will... somewhere other than your office,\" she mutters, shaking her head. \"Doesn't sound like the usual doctor-patient relationship to me, Doctor.\"\nBefore he has the chance to protest, she walks into the building to pay for her gas, and Hannibal feels dazed as he inserts his debit card into the machine to pay for his.\nHannibal is in the shower when Will's phone rings.\nHe can hear it in the bedroom, where Will is splayed out and reading Dante's Inferno after months of Hannibal's insistence. \nHe sighs and stays under the water, trusting Will to be sensible enough to decline if Jack tries to pull him out for a case. It's delightfully hot, anyhow, and he wants to scrub off the scent of gasoline still clinging to him.\nOnce he's clean and no longer smells of petrol, he steps out and dries himself off. There's no sound coming from the bedroom, and, concerned that Will might have left, he opens the door to check, still wrapped in his towel.\nThe cold air hits him with a shiver, but he's pleased to see that Will is still comfortably spread out in his nightclothes on the bed. He's abandoned Inferno in favor of reading something on Hannibal's tablet, a frown twitching at the corner of his lips.\nHannibal smiles to himself, satisfied, and moves to slip back into the warm steam of the bathroom.\nWill looks up, though, and catches his eye.\n\"You're still wet,\" he chuckles, glancing over the whole of Hannibal's form. \"Need help drying off?\" \nHannibal tugs at the towel on his waist, bringing it higher up. \"I wouldn't want to disturb you.\" \nHe does look terribly comfortable, after all.\nWill just grins and goes back to looking at his tablet. Hannibal decides to not retreat into the bathroom and dries himself off there in the bedroom, pulling his bedclothes on quickly so that he can join Will in bed.\nHe slips himself into the space to Will's right, the one that he's made for himself, the one that he hopes is irrevocably his. Will is warm, too, and Hannibal takes no shame in huddling against him. He rests his head on Will's shoulder, catches a glimpse of the article Will is reading. Something about trees. He closes his eyes and takes a deep breath, savoring it. \nWill's fingers curl into Hannibal's hair.\n\"Still damp,\" he murmurs, and clicks the tablet off. He sets it on the bedside table and rolls over, holding Hannibal's head between his hands. \"You should have taken my offer.\"\nHannibal presses himself closer and slings a possessive arm around Will's waist, the two of them face-to-face on their sides. \"I was content with the scene you made.\"\nWill, in his bed, reading from his tablet. Will, his lover.\nIf only the whole world could know.\n\"I'm sure,\" Will snorts, but continues smiling all the same. He rubs his fingers against Hannibal's scalp in tiny circles, making his skin prickle. \"Did you have a good day?\"\nThey had yet to discuss Katz and the petrol station. During dinner, Hannibal had managed to avoid breaching the subject by letting Will rant about the woes of essay grading instead.\nHe still isn't sure how the conversation might go over. Will had, after all, been the one to insist that they work to keep their relationship private, and Hannibal might have just spoiled that for them.\nThroughout the day, he's entertained the thought of killing Katz before she can spill to her colleagues, but he knows that Will wouldn't be happy about that. He considers the woman a friend, after all. \nWill's little massage moves down to the base of Hannibal's neck, and he presses his fingers over the bumps of his spine, causing some minor pain. \"I heard you ran into Beverly at the gas pump.\"\nHannibal sighs, wishing that he could ask for more examples of bad citations and misused independent clauses, and knowing full well that it isn't an option.\n\"It was Miss Katz that called when I was in the shower, then.\"\nWill lets out a small hum of affirmation. He doesn't seem angry, at least. \n\"You can call her Beverly, you know,\" he says, now pressing his fingers into the flesh above Hannibal's collar bone. No longer a massage, apparently, but rather an exercise of intimacy.\nOr control. It's somewhat painful, and certainly uncomfortable, for Will to be digging into his neck like that. He doesn't mind, though. \n\"She's your friend, not mine,\" Hannibal murmurs. He leans into Will in an attempt to placate him, but Will continues to prod, keeping him at a short distance. \"That said,\" he adds, \"I suppose your friendship makes her a suitable candidate to find us out, yes?\"\nWill practically clutches at Hannibal's collar from beneath the bone. It's not painful, but it's enough. Hannibal lets out a groan and tries to shrug him off. \n\"Are you trying to punish me?\"\n\"That would be hackneyed,\" Will snorts. He releases the pressure of his fingers only to press his nose to the crook of Hannibal's neck, breathing against his skin. \"Just trying to make an impression.\"\nHannibal shifts so they're closer together, chest to chest. \"For me, or for someone else, my sweet?\" he asks, slipping his hand under Will's shirt to feel the warmth of his back.\nWill kisses at his collarbone. \"I told Beverly that we're together. She won't tell anyone.\"\n\"Then our secret is safe. Am I forgiven?\"\n\"We'll see,\" Will answers. \"It might depend on how well you can hide these marks.\"\nHannibal's heart (hopeful no longer, hopes fulfilled) swells in his chest. \nHe wants to cherish Will's mark, his impression, forever. \nHannibal goes to work the next day with a scarf, and had he any other patient, he's sure that it would have gone unnoticed.\nUnfortunately, Franklyn Froidveaux is nothing short of obsessed. \n\"What a lovely color,\" he says as he takes his usual seat. Without waiting for a reaction, he adds, \"The scarf, of course. I've never seen you wear one, but you do make it work, Doctor Lecter. What's the occasion?\"\nHannibal crosses one leg over the other and steels himself, taking a deep breath through his nose. \"The weather, I should think,\" he answers, his nose wrinkling before he can prevent the tell. \"October is upon is.\"\n\"Indeed,\" Franklyn agrees, mirroring Hannibal and crossing his own legs. \"Though, you usually shed your outer wear upon coming inside, Hannibal.\" \nHe flinches minutely at the use of his first name. \"It's part of the outfit,\" he says, hoping that the subject will be dropped. Franklyn is, after all, the primary person he's attempting to hide himself from. \"Now, Franklyn. How was your week? You mentioned your mother during our last session.\"\nFranklyn waves a hand through the air, blasé. \"Enough about her,\" he says. \"I've processed all that.\"\nHannibal doesn't want to press the issue, mainly because he doesn't want Franklyn sobbing on his floor again. With most other patients, he prefers to press those sore issues and test their emotional boundaries, but it's not an exercise he finds rewarding in this case.\nThe rest of their session is uneventful, and Hannibal meets with his remaining patients without incident. At one o'clock, he takes the Bentley to his semi-regular lunch meet with Alana. It used to be regular, of course, and was usually at dinner, but Will has been at his house most evenings. Even when he isn't, Hannibal refrains. The long years of veiled flirtation with his former mentee have passed, after all. \nOn the drive over, he idly wonders what would have happened if Alana had taken to Will's pursuits. Would he have been as secretive with her, or would he have proudly boasted their status?\nOf course, Hannibal doesn't think Will is ashamed of him. Their relationship is just complicated. Hannibal was Will's psychiatrist before, in one way or another, and they were both men. Both are things that people would not expect from Will.\nAnd there's the issue with high society, of course. Will would be endlessly pestered in Hannibal's company, prodded by curious socialites and academics alike. \nBy the time he arrives at Alana's office, his temples have begun to ache, and he wills the muscles in his jaw to relax. He's beginning to think Will won't ever let them come forward about their relationship.\nHe knocks on the door and works at his jaw for the few moments he waits for her to answer. When she does, she regards him with a characteristic soft smile, catching him in act of massaging his facial muscles. \n\"Tense?\" she asks him. She steps aside and holds the door open in invitation.\n\"It would seem so,\" he agrees, and crosses the threshold. He carries his thermal bag to the small table by her bookshelf and lays out their lunch. It's leftover from his dinner with Will the night before, but he knows she won't be able to tell.\n\"Lobster bisque,\" he explains, removing the lids from their bowls, \"and fresh biscuits.\"\nShe grins at the presentation. \"I feel spoiled.\"\n\"Well,\" he answers, taking a seat at the table, \"I only cook for those I deem worthy of spoiling.\"\nPer usual, her cheeks turn rosy with the compliment, and she sits down as well. The conversation doesn't continue until they've both had a few spoonfuls of the bisque, which has barely cooled since Hannibal reheated it in the morning.\n\"Speaking of spoiled,\" Alana says, \"did you happen to bring any of that special beer?\"\nHannibal raises his eyebrows and nearly drops his spoon. It's hardly rude of Alana to ask; he has always, without fail, shared it with her during their meals. It had slipped his mind entirely; Will has drunken a few bottles since staying with him, of course, but he isn't yet out.\n\"My apologies,\" he confesses. \"I seem to have forgotten.\"\nShe shrugs, and her nonchalance is sincere. \"You do seem stressed.\"\nHe would argue that he isn't stressed, that these past months with Will have been the most blissful in his life, but falters. There has, perhaps, been some stress building as he strives to keep his relationship with Will a secret. \nTheir living together—and it really is that, now, with Will having practically moved in—has only made that more difficult.\nBut he is happy. It's a necessary stress.\n\"I'll be sure to deliver a case to make it up to you.\"\nAlana smiles at that, and while it pleases him, it doesn't compare to Will's.\nWill, who was amused when he discovered that the beer was brewed in barrels Hannibal had used to store human offal. Alana would be nothing short of horrified to learn that they weren't wine barrels.\nHe nearly drifts off into thoughts of Will when he notes Alana's curious gaze.\n\"Why have we shifted to lunch meets, Hannibal?\" she wonders, idly fiddling with her spoon. \"I haven't been to your house in months.\"\nHe does his best to not appear startled by taking another mouthful of the soup. It scalds the roof of his mouth, but he doesn't react to that, either. Coolly, he answers, \"I hadn't thought about it.\"\nShe raises an eyebrow, clearly not convinced. \"I suppose not,\" she counters. \"You must be occupied, after all.\"\nHannibal swallows and blinks a few times, walking a thin line between feigning confusion and actually experiencing it. \"I beg your pardon?\"\n\"Don't play the fool,\" she says, her tone surprisingly mirthful. \"I've had it figured out for some time, you know.\"\n\"Please elaborate, then,\" Hannibal says, trying to decide what his options are, trying to determine what she's figured out. He doesn't want to kill Alana; she is such a dear friend, to him and Will both.\nShe chuckles to herself, a musical sound. \"You and Will,\" she supplies. \"You've been screwing like rabbits for at least two months now.\"\nFour, Hannibal corrects silently, just before he feels steel drop in his gut. The blatant nature of her remark is unexpected, and he gapes for a moment as she twirls her spoon between her fingers.\n\"Don't tell me I'm wrong,\" she adds with a smirk. \"I've got a whole line of evidence to back me up—on top of that scarf you're wearing.\"\nHe swallows down a groan and curses Will for his stubbornness, and then himself for his own. He had been so enthusiastic to be marked, and Will had been enthusiastic to do it.\nAnd yet, he still insists on maintaining their privacy. Hannibal isn't sure how he's going to tell him that they've been found out yet again.\nHe refrains from burying his face in his hands, staying composed. \"I wouldn't dream of denying it,\" he replies, the statement making his mouth feel dry. \"I'm quite proud to be with Will; he just happens to be a very private man.\"\n\"Of course he is,\" she agrees, a grin persisting on her face. She looks altogether too pleased with herself. \"And you, on the other hand, might as well be a peacock. You're stressing yourself to death, keeping your feathers hidden.\"\n\"It's worth it,\" he assures her, not leaving any room for doubt in his tone. \nHer smile falters for a moment, and then she nods.\n\"Of course it is. Both of you have seemed much happier lately.\" She pauses for a breath. \"But is it sustainable, Hannibal?\" \nBefore a cool wrath can spread to fill the whole of him, she amends her statement.\n\"Not your relationship,\" she adds. \"I won't question that. What I'm questioning is your concealing it.\"\nHannibal could argue that he's been concealing most of himself for his entire life, but that's a conversation to be had with Bedelia. And regardless, Will is different. \nHis love for Will is not something the world would shun.\n\"It won't be a secret forever,\" he admits. \"Beverly Katz found us out only yesterday; she caught me driving Will's car.\"\nAlana raises an eyebrow. \"Uncharacteristically careless, Hannibal. Are you sure that wasn't a deliberate slip?\"\n\"Will suggested it,\" he replies, and is almost shocked by how good it feels to talk about it. He won't, however, mention Franklyn or his casual stalking; that might lead to something he only wants to discuss with Will.\n\"Did he?\" she hums. \"Careless of him, too. Are you sure he wants to keep things a secret?\"\n\"Of course!\" he says, nearly scoffing at the absurdity. \"He's been quite clear about that.\"\n\"Maybe he's afraid,\" she suggests. \"He's not out of the closet, to say the least. Nor are you. He could be setting this up to make it easier; have you two be found out, rather than come out yourselves.\"\nHannibal places a self-conscious hand over the mark on his neck, still concealed by the scarf. \"It could be subconscious,\" he agrees. \"Will made it clear early on that he expects honesty between us. He wouldn't violate that with manipulations.\" He thinks about the ease with which Will slid into his clothes. It never looked like a conscious decision.\nAlana takes this with a slight frown. \n\"If you're taking advice,\" she says, \"I think it would be best to remain straightforward and talk it out with him. Assuming, of course, that you do want to come out about this.\"\nHe takes a breath before answering.\n\"With all my heart. I want the world to know the extent of my love for Will Graham.\"\nShe smiles fondly. \"Tell him that, then.\"\nHannibal meets her eye and smiles in return. He had wanted to gloat, initially, that he had won the prize she had so foolishly rejected. Now, though, he realizes that it would be pointless to do so. She never cared enough to harbor jealousy; or, at least, she has none now.\nShe's genuinely happy for them \n\"Thank you, Alana,\" he says. \"I'll be sure to let you know the outcome of our conversation.\"\nShe winks at him.\n\"I expect an invitation to the wedding.\"\nHannibal leans over Will's shoulder to set down a well-arranged plate of red beans and rice. Will eyes the included andouille sausage before tilting his head to meet Hannibal's gaze.\n\"Buttering me up?\" he queries, one eyebrow arched. \n\"Nothing of the sort,\" Hannibal counters, dipping to press a kiss to Will's forehead.\nWith a snort, Will returns to the food. \"You've got something up your sleeve,\" he mutters, and takes a stab at a piece of sausage. \"I bet this is the good pork, too.\"\nHannibal takes his seat at the head of the table, where they're close enough that their knees knock together. It's the warmest comfort of their nightly meals together, he thinks. \n\"The good pork, darling?\" he hums, lifting his own utensils. \n\"Yes,\" Will affirms. \"You do put so much effort into it.\" He takes the meat between his teeth, chewing thoughtfully. Once he's swallowed, he adds, \"Can't say I taste the love, though. It's a bit sour. Was it scared?\"\nHannibal smiles warmly, pleased with Will's developing palate. \"She was, indeed,\" he says. \"I thought the tang would suit the spices of the sausage well. Don't you think?\"\nWill shrugs and takes another bite, this time chewing with his mouth full. \"Tastes fine. At the very least, Jack wouldn't notice.\"\nAmused, Hannibal offers a coy smile. \"Likely not,\" he agrees, thinking of Jack's continued guilelessness, meal after meal. \"He isn't very observant, your dear uncle. Did you know that he mistook Franklyn Froidveaux for me when he first came to my office?\"\n\"I didn't,\" Will answers, grinning around his next bite. \"I'm surprised he survived the first encounter.\"\n\"You know how often I've considered killing him,\" he replies. \"It's a developing fantasy of mine.\"\n\"One you best not entertain, Hannibal,\" Will reminds him, his tone turned short. \nHannibal purses his lips at that, and picks up his glass of wine—a robust red, it swells against his senses with a deep inhale. \"You would defend him?\" he returns. \n\"He's too close, Hannibal,\" Will argues. \"As much trouble as he causes us, it would be a flashing neon sign if he went missing.\"\nA bitter taste fills his mouth, and it isn't the wine. Dourly, he mutters, \"He would turn against you with the tip of a hat, darling. One scrap of evidence, and he'd have you imprisoned.\"\nWill all but rolls his eyes. \"You used to be subtle with your attempts at alienation.\"\n\"Feeling wistful, are we? You said you preferred me when I'm blunt.\" \n\"I do,\" he says, and places his hand on the table. A peace offering. \"I'm happy where we are now. No more lies, no more games.\"\nHannibal takes his hand and locks their fingers together, the meal paused for now. \"I'm not often pleased when I'm outwitted, but I am grateful for this outcome.\"\n\"You've never been outwitted before,\" Will counters. \"Maybe you should try it more often.\"\nSmirking, Hannibal leans across the table to steal a kiss. \"Only with you, my love.\"\n\"Sap,\" Will grumbles in accusation. \"I can't believe you tried to frame me for murder.\"\nBefore Will can turn his cheek, Hannibal reaches out to cradle him with his hand. \"That was so long ago,\" he sighs against Will's lips. \"You wouldn't still hold that against me, would you?\"\nWill shoves him off with a grunt. \"It was barely six months ago.\"\nHe's not upset, though. He wouldn't be here if he was, Hannibal knows.\n\"What are you plotting, anyway?\" he mutters, letting go of Hannibal's hand to return his focus to the food. \"You only drop the fanfare when you want something.\"\nHannibal takes a deep breath to straighten himself. Will doesn't press him to answer, content to mull over the flavor of the meal while Hannibal fixates on his eyes, which glow more of a gray in the dim light of the dining room.\nHe knows how privileged he is to have the ability to look into those eyes when he pleases. He only wishes everyone else knew, too. \n\"I have a proposal,\" he says at last, his hand still on the table if Will should choose to take it. \"You needn't agree, of course. It's more of a request, though I truly hope you will agree to it.\"\nWill raises his eyebrows without looking up from his plate. \"Pleading,\" he remarks, the words muffled by a mouthful of rice. \"That's new.\"\n\"I wouldn't, for anyone else,\" he returns. He doesn't mention that he wouldn't tolerate anyone else's table manners, either.\n\"I know.\" Will glances at him and flashes something just shy of a grin. Sometimes, Will just simply bares his teeth. Hannibal has yet to discern whether or not it's intended to appear hostile, but this time, he doesn't think it is.\nThrumming his fingers over the table, past considering his food, Hannibal licks his lips. \"Of course you do,\" he sighs. Will knows everything about him, surely. He often feels as though Will can see his thoughts painted out on his skin, though Will always insists that Hannibal remains as elusive as ever.\n\"Not a mind reader, though,\" Will grumbles, and nudges Hannibal's calf from under the table with a bare foot. \"Tell me what it is you want, Hannibal.\"\nHannibal, somehow nervous, doesn't say what he intended to.\n\"Why do you only call me that?\" \nWill blinks at him, shocked. Clearly, this was not the conversation he was expecting. Hannibal swallows, wishing he could retract the question; this was not what he expected, either.\n\"Call you what?\" Will asks. \"Your name? Hannibal, do you want me to go back to calling you Doctor Lecter?\"\n\"No!\" Hannibal says, shaking his head in earnest. \"That was a battle of its own, darling. I—\"\nWill cuts him off by putting his hand back over Hannibal's, understanding on his face, his bottom lip caught between his teeth. \"You want me to use pet names.\"\nHannibal can feel regret coiling in his stomach. He's misstepped—this was not what he planned, and he's likely made Will uncomfortable. He knows that he's already asking too much of him; their brands of affection are entirely different, after all.\nBut he won't take back what he said. He never has, and he doubts he ever will.\n\"It appeals to me, yes,\" he admits. \"But I understand if you'd rather withhold from that practice. You show your love in other ways.\"\nWill offers a wry smile. \"You don't mean that,\" he says, running his thumb over the back of Hannibal's hand. \"You mean that I don't show it—or, not in ways that you'd like.\"\nHannibal wants to curl in on himself. He's humiliated.\n\"I want it to be obvious,\" he murmurs, unable to look up from Will's hand on his. He wants Will to do that when they're in public. He wants them to spend time together in public. \n\"Isn't it already?\" Will asks. He rises from his seat to stand behind him, moving his hands to rest on his shoulders.\nLeaning back, Hannibal looks up, meeting his eyes. \"Do you think?\"\nWill laughs. \"Obvious enough that I'm making you work to hide it,\" he replies. He brushes his fingers over the the bruising on Hannibal's neck, runs them along the edges of the gauze and tape. \nAlana might be right, Hannibal realizes. His jaw goes slack in shock from the realization.\n\"Will,\" he says, feeling ridiculous with his head tilted over the back of his chair, \"did you plan all this?\"\nThe low light makes the flush of Will's cheeks look dark and dusky. \"Partially.\"\nHannibal lets out a long exhale and sits straight again. Will stays behind him, hands perching tentatively where they rested before. \nThe mental cataloging only takes a few seconds, and then Hannibal shakes his head in disbelief.\n\"You devious man.\"\nHe pushes himself from his seat so he can stand to confront Will. He meets his eye, unsure if he's feeling enraged or awed, and plants a hand on his chest.\n\"You tricked me.\"\nWill bares his teeth, but it's certainly a smile. \"Outwitted is the word, I think.\"\n\"Darling,\" Hannibal growls, and shoves him back a step. A terrible delight fills him. \"You made sure you marked me before I could mark you. Dressed me in your clothes, sent me out in your car—never revealing yourself, but made it clear that I belonged to someone.\"\n\"Everyone knows you wouldn't be caught dead in a Volvo on your own. I have to admit, I spent Friday night snickering when you drove it to the opera house.\"\n\"On the contrary,\" Hannibal counters, \"I think your Volvo is an excellent car. It just needs a decent cleaning.\"\nSmirking, Will reaches out and pinches the collar of Hannibal's shirt. \"I covered you in dog hair, too.\" He holds out a short, white strand. Likely Buster's. The little beast had taken to sleeping in Hannibal's study.\nHannibal should be angry, would be if Will were anyone else, but he's still delighted.\n\"You wicked, brilliant—\"\nWill doesn't let him finish the praise. He plants a solid kiss on Hannibal's mouth before pulling back with a serious expression.\n\"If you had your way, everyone would look at me like I was your possession. I don't want that, Hannibal.\" He brings his hand to hold the back of his neck, pulling him closer.\nHannibal feels his breath going short. \"Would you own me, mylimasis?\"\nShaking his head minutely, Will kisses him again. \"I'm just putting us on equal footing.\"\n\"And this is how you show your love.\" Hannibal presses them together, chest to chest. \"I'm glad you've outwitted me again, my dear.\"\nWill chuckles, the sound vibrating between them.\n\"Jack confronted me today,\" he murmurs. \"Caught me at the end of my lecture. Apparently, he'd gone to my house this morning to talk about the latest case. Obviously, I wasn't home.\"\nUnsure whether he should be delighted or concerned, Hannibal rubs his hand over Will's back, urging him to go on. \"You were here, still,\" he confirms.\n\"Apparently, he was worried when he didn't find the dogs and broke into the house. He was upset that I hadn't told him where I'd run off to, and gave me a stern lecture about keeping him updated.\"\n\"And what did you tell him?\" \nWill steps back, putting space between them. Hannibal doesn't mind; he enjoys the pleased look on Will's face as he recites his response.\n\"I told him that my private life was none of his business.\" Will grins. He licks his lips before adding, \"I also said that he could find me here, but he'd best not try and break into this house.\"\n\"He knows, then?\" \n\"And he isn't happy about it, either.\" \nWill looks happy about that. Hannibal is, too. Were he any less composed, he might cackle. He almost wants to.  \nInstead, he offers a grateful smile and decides to share his own bit of news. \"Alana has given us her blessing,\" he says. \"Apparently, she pieced it together some time ago.\"\nThis doesn't seem to surprise Will. \"Let's hope she hasn't pieced together anything else,\" he mutters. \"I have plans that don't involve us ending up in prison, you know.\"\n\"Oh?\" \nWill glances at the table and their half eaten dinner. \"How do you feel about boar hunting tonight?\"\n\"How long were you scheming this?\" Hannibal wonders. He zips Will's vinyl suit for him. For all their talk of conspicuousness, preventing a trail of physical evidence is their top priority.\nWill had laughed when he first found Hannibal's suit, which he still affectionately refers to as the \"murder costume.\" Of course, he's since agreed that they're practical and often necessary, albeit with mutterings about Hannibal's vanity.\n(\"Really? Even when you're killing someone, they need to be able to see your three piece?\")\n\"Long enough,\" Will answers.\nNeedless to say, Will's suit is white, not clear. Hannibal isn't fond of it; it reminds him of the jumpsuits the prisoners wear in the BSHCI.\n(\"I'm quite glad I didn't frame you for murder, you know. This isn't a good look for you at all.\")\nThey've driven Will's car out to the edge of the city and stowed it in a grove of trees off the main road. Franklyn Froideveaux lives in the house just beyond the trees. It's spacious—and empty, Hannibal knows.\nPoor Franklyn, alone in his neuroses. Not for long, though.\n\"Cruel boy,\" Hannibal murmurs. \"I'll meet you inside. Don't let yourself be seen.\"\nWill smirks as he shrugs off Hannibal's gloved fingers. \"You know I won't, love,\" he says. He turns around and begins trekking quietly towards Franklyn's isolated suburban home. In the darkness, the white of his suit glows against the frosted earth, and it's beautiful in an ironic sort of way. \nHe'd wanted Will in a prison jumpsuit, some time ago. Now, he has something much better. \nHannibal swallows untimely lust as he watches Will recede into the trees. He straightens himself, brushing his hands over his coat. It's not a vinyl covering like he would prefer, but his ordinary wool-silk blend. Will wants him looking as harmless as possible, so he's wearing more subtle coloring: brown and beige and blue, much like when he first met Will.\nNo tie, though. Murder is a tie-optional event.\nHe brings a bottle of wine to Franklyn's door: a feigned peace offering. Will has used his wicked imagination to present Hannibal's worst patient an image worthy of his deluded fantasies before snatching it away.\nHannibal rings the doorbell with his handkerchief and stows his gloves in a coat pocket. He listens to some hastened stumbling before the door opens, and Franklyn is on the other end in green and white striped pajamas. He even has a matching nightcap.\nHow quaint, Hannibal thinks, not allowing the scowl to show on his face.\nFranklyn's mouth opens and shuts, apparently trying to form words. Hannibal waits patiently, wearing a plastered expression of neutrality. \n\"Doctor Lecter,\" Franklyn says. \"I didn't hear your car in the driveway.\"\n\"It broke down a ways up the road,\" Hannibal tells him. He tips his head towards the space over Franklyn's shoulder. \"May I come in?\"\n\"May you...\" Franklyn blinks, his processing slow. Realization dawns on his face, rippling across his round features. \"Of course! And you brought wine. Why did you bring wine?\"\nHannibal has to push past him, seeing as Franklyn is practically frozen in shock in the doorway. Hannibal can feel the man's eyes on him, greedy and confused, as he surveys his surroundings.\nThe house has the feel of a sophisticated country villa. Everything is made of wood, and there is a lot of everything. Hannibal remembers what Franklyn mentioned of his deceased mother, and he assumes the house was designed by her. The red and white checkered pillows, while tacky, aren't Franklyn's variety of tacky.\nA musty smell oversees the whole of the house. Being a tulophile, Franklyn likely makes cheese in the basement. \n\"I was planning a visit beforehand,\" Hannibal answers, turning to face the bewildered man before him. \nFranklyn inhales sharply. \"Were you worried about me? I don't need a therapy session, if that's what you thought.\"\n\"I'm not here as your psychiatrist, Franklyn,\" Hannibal says. A sneer almost overcomes him when Franklyn shivers with boyish delight. \nHe's not here as Franklyn's therapist, after all. He would never kill a patient. That's Will's job.\nUnsure if Will has entered the house yet, Hannibal makes a show of finding a place to set down the bottle of wine. He sets it on a low cedar table, likely meant for a child's tea party, and looks for evidence of his partner's presence.\n\"Then what for?\" Franklyn asks, following after him. He sets his hand tentatively on the back of a sofa, faltering. \"You're not here to tell me I'm being referred, are you? You're trying to soften the blow.\"\nHannibal looks over his shoulder to see the way Franklyn shrinks as he says that. He cringes with his full body, like a snail sucking back into its shell upon being bumped.\n\"Nothing of the sort,\" Hannibal promises. Raising his voice, he adds, \"I'm actually looking for company, tonight. Do you have any wine glasses?\"\n\"Oh!\" Franklyn exclaims. His voice speeds up in his glee. \"I'll go get them. They're in the kitchen—I'll be just a minute, don't worry—\"\nHannibal wrinkles his nose as he watches Franklyn stumble across the room, tripping over his own belongings and slipping on his socks. He follows after with his own sure steps.\nWhen he enters the kitchen, silent, he sees Will leaning against the counter with an empty, thick-stemmed glass in hand and one eyebrow raised. Franklyn is frozen across from him in shock, the loose fabric of his pajamas shifting from the breeze of the open door.\n\"You—you!\" he cries, raising a shaking finger. \"Wh—what are you doing here? Hannibal is here tonight! With me! Why are—why are you in my kitchen?\"\nWill offers a sly smile and a shrug. \"I told you before, Franklyn. You're a nuisance.\" He looks past Franklyn and meets Hannibal's eye.\nHannibal raises his eyebrows. He wasn't aware that Will and Franklyn had spoken before, but he's certain now that he'd like to know how that conversation went.\n\"Get out!\" Franklyn cries. \n\"No can do,\" Will answers, his voice slipping into the lazy drawl he always uses with their victims. \"I've plans for tonight. Don't I, Hannibal?\" \nSpluttering, Franklyn spins on a socked heel, losing his balance when he sees Hannibal standing there.\n\"Doctor—Hannibal—what is he talking about?\" \nHannibal tilts his head. \"What is who talking about, Franklyn?\" he inquires, glancing around the room, intentionally avoiding looking at Will. \"I heard you shouting.\"\nAs Franklyn gapes and tries to come up with a response, Hannibal watches bemusedly as Will slips into the next room. Apparently, the game isn't over yet. He has a feeling that Will is enjoying the opportunity to exploit the same tactics Hannibal once used on him. \n\"I—\" Franklyn looks over his shoulder and notices the empty space. He lets out a groan. \"He was here. Will Graham. He confronted me last month! He said I had to stop seeing you. He's crazy, Doctor Lecter. I think—I think he's obsessed with you.\"\n\"Oh?\" Hannibal blinks, cocks his head. \"I don't know anyone named Will Graham, Franklyn. Perhaps we should sit down; you seem to be having an episode. Why didn't you mention your hallucinations before?\"\n\"What?\" Franklyn looks over his shoulder again, as if he'll find Will returned. \"No, no! I don't hallucinate! Will Graham is real, and he's in my house! You have to do something, Hannibal.\"\nHannibal frowns and takes a step backwards. \"Perhaps I've made a mistake in coming here,\" he says, lowering his head. \"I seem to have caused you stress.\"\n\"No,\" Franklyn insists, and reaches for him with needy fingers, nearly grasping the front his coat. \"No, you just missed him. I'm fine! Will Graham must have followed you here to ruin our night. You just have to help me get rid of him, and then we can—\"\nHannibal purposefully winces. \"Franklyn,\" he says. \"I don't think you're all right. Should I call someone? We can get you to a hospital.\"\nWith a shaky breath, Franklyn ducks his head. \"No, don't,\" he pleads. \"Just... help me look for Graham. He's somewhere in the house, I'm sure of it.\"\n\"Well.\" Hannibal takes a deep, controlled breath. \"If it will make you feel better, Franklyn.\"\nFranklyn goes for the staircase immediately. \"I know you don't believe me,\" he says, \"but we'll find him, and you will. And then we can drink the wine and chat like friends.\"\nThere is genuine pain in his eyes, and Hannibal would pity him if he were capable. As it is, however, he cannot pity prey. \n\"All right, Franklyn,\" he says. It's the same voice he uses to soothe Will's dogs when they find something to bark at. Stern, soothing. \nFranklyn bounces up the steps, gripping the rail. Hannibal keeps his hands in his pockets, careful not to touch anything as he follows. Halfway up, he hears a dropping sound upstairs; Will is leading them to him.\n\"There!\" cries Franklyn, stopping at the top of the stairs. \"He's in my bedroom, Hannibal, we have to check there.\"\n\"Franklyn,\" Hannibal says, chiding. \"If this a convoluted attempt to—\"\n\"It's not,\" Franklyn insists. \"You must have heard that. I'm not crazy—I don't want you to think I am! Will Graham is crazy.\"\nHannibal sighs and joins him at the top. \"We'll check the bedroom,\" he concedes. \"But if nothing is there, Franklyn, I'll have to call help. I'm concerned for your mental state.\"\n\"Don't be. He's here, I swear.\"\nWill is there, splayed out on Franklyn's bed and his back propped against the headboard. His suit separates him from the sheets, which have been peeled back. Given Franklyn's attire, they likely caught him as he was preparing to go to sleep.\nSmiling cheerfully, Will says, \"You found me, Franklyn. Now what?\"\nFranklyn balls his fists at his sides. \"See, Doctor Lecter? He's right there.\"\nHannibal sees him, certainly. It's a delightful sight; Will can be such a tease. \n\"The room is empty save for you and I, Franklyn,\" he says. \"I'm going to call my associate at the psychiatric ward. We can get you help, Franklyn.\"\nFranklyn's bottom lip quivers, and he shakes his head fervently. \"You have to see him, Doctor Lecter. I don't hallucinate.\"\nWill raises an eyebrow. \"Feeling rattled, Franklyn?\" he asks. \"A terrible thing, to lose your footing. If only Hannibal believed you.\"\n\"Be quiet!\" Franklyn screams.\nHannibal is grateful for the house's isolation. He uses his foot to shut the door behind them so Franklyn can't escape.\n\"Wait here, Franklyn,\" he urges. \"I'm not equipped to handle this situation, I'm afraid.\"\nFranklyn stares at him with wide eyes. \"Who are you going to call?\" he asks. \nWill rises from the bed, the vinyl crinkling with the motion. Hannibal allows himself to watch, his gaze fixed on his partner.\n\"No one,\" he says.\nHe doesn't have to look at Franklyn to see him break.\n\"I've got it,\" Will says, casually, as if offering to foot the bill. Before Franklyn can process the situation, Will steps in behind him and wraps his hands around the little man's throat.\nHe squeezes before Franklyn can scream. Hannibal stands back and watches as his patient writhes, consumed with joy.\n\"Do you think you can break his neck?\" Hannibal asks. \"I know you've been practicing.\"\nIn the kills that he doesn't display, Will has consistently broken their necks (though, pre or post mortem varies). It doesn't matter when the body is only for meat, but Hannibal knows Will is taking the technique from him. It's a clean way to kill. \nHe wants to see it now. He's often fantasized of snapping Franklyn's neck himself.\n\"Do you want me to try?\" Will asks.\nFranklyn kicks and tries to get Will's hands off of him. His eyes are fixed on Hannibal, and he wonders if he's feeling betrayed. \nHannibal looks at Will. \"Please, darling.\"\nWill grins, and Franklyn's head twists with a distinctive snap. His body drops to the floor, his skin purpled against the dainty green and white stripes of his pajamas. \nThey both regard the body for a moment, appreciating a job well done. \n\"How did it feel?\" Hannibal asks, meeting Will's eyes.\n\"Killing him?\" Will returns. \"It wasn't any different from the others.\"\n\"I meant your little act. What was it like, being the hallucination?\"\nA moment of silence passes over the body between them, Will's smile, when it comes, is bitter.\n\"It was nice not to be on the receiving end,\" he admits. \"And seeing your lying face. Have to remember what to look out for.\"\n\"You don't truly think I would—\"\nWill rolls his eyes. \"I know I have your loyalty,\" he says. \"Now, let's get this corpse back to the car. You didn't touch anything, did you?\"\n\"Just the wine bottle.\"\n\"Let's grab that, then. We can drink it when we eat his liver.\"\nFranklyn Froideveaux is found displayed in a field outside of Baltimore, found by the dairy farmer that owns the property. Will tells Hannibal about it over foie gras shared with Jack and Bella Crawford.\n\"He was posed like a cow, can you believe it?\" Will mutters, swirling a glass of wine in his hand—the very same they took to Franklyn's home. \"All his organs were scooped out, though. The only one left on the scene was his brain, and it was left on the ground in front of him. Like he was meant to eat it.\"\n\"That's enough for the table, darling,\" Hannibal sighs, and meets Bella's eye. \"Does Jack ever bring work home for dinner?\"\nWill snorts and takes a pointed bite of Franklyn's liver. \n\"Thankfully, no,\" Bella answers, carefully picking at the vegetables on the edges of the plate. She already informed Hannibal that she found the main course decidedly unethical. \"Though, I'm sure he wants to.\"\nJack smiles around a bite of the foie gras. \"All the time,\" he chuckles. \"But the table is a sacred place.\"\n\"I'll drink to that,\" Hannibal answers, raising his glass. \nWill mutters something about the bed being more sacred, which earns him a scandalized look from Jack and an amused one from Bella. Hannibal takes a long sip of his drink, wondering how long the Crawfords will plan to stay after dinner. The event was Hannibal's attempt to apologize for keeping Jack in the dark for so long, so it would be rude to chase them out as soon as the plates are clear.\nThen again, Will is known for being rude. And Hannibal is sure Bella would understand; she keeps looking between the two of them like she's known about their relationship much longer than Jack has.\nHannibal wonders how many people have known and simply hadn't said anything. He supposes he'll find out when they officially announce their relationship at Hannibal's next dinner party. \nThey won't be using Franklyn's organs for that. The liver, Hannibal found, was the only desirable piece out of the collection. He has another Ripper spree planned for the occasion.\nHe's comforted by the fact that he won't be alone in his hunting, and he glances over at Will. They share a smile, and there's comfort, too, in knowing that some things belong strictly to them.\nJack Crawford won't find them out unless they want him to.\nUntil then, Hannibal plans to be as public as he pleases. There won't be any need to hide himself or Will, except for the things that belong only between the two of them.\nBeverly Katz sends a thank-you note the coffee liqueur. The envelope is addressed to Hannibal, but the message in the card is directed solely to Will.\nWill laughs about it for nearly an hour, draped on Hannibal's sofa. Hannibal glowers fondly at him as he picks dog hair off his suit in preparation for work.\nWill has him in his pocket, it would seem, and Hannibal finds that he doesn't mind at all."
}