{
    "id": "12313803",
    "url": "https://archiveofourown.org/works/12313803?view_full_work=true",
    "author": [
        "heyhosam"
    ],
    "title": "Just a little bit of your heart",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "방탄소년단 | Bangtan Boys | BTS"
    ],
    "relationships": [
        "Jeon Jungkook/Park Jimin"
    ],
    "characters": [
        "Jeon Jungkook",
        "Park Jimin (BTS)",
        "A bunch of OCs",
        "and brief appereance of GOT7's Jaebum"
    ],
    "additional_tags": [
        "Arranged Marriage",
        "Alternate Universe - Arranged Marriage",
        "Mpreg",
        "Alpha/Beta/Omega Dynamics",
        "Mating Cycles/In Heat",
        "Miscarriage",
        "Mentions of Violence",
        "Sword Fighting",
        "Porn with Feelings",
        "Angst with a Happy Ending",
        "Anal Sex",
        "Self-Lubrication",
        "Anal Fingering",
        "Alpha Jeon Jungkook",
        "Omega Park Jimin",
        "historical au kinda?",
        "Historical Inaccuracy",
        "Non-Con references",
        "its mentioned but there is non in the story",
        "jimins dad is an asshole so be warned"
    ],
    "language": "English",
    "series": "",
    "published": "2017-10-16",
    "completed": "2017-11-14",
    "words": "38,671",
    "chapters": "2/2",
    "comments": "376",
    "kudos": "9,888",
    "bookmarks": "3,070",
    "hits": "265,630",
    "summary": "<p>Only if he had known he would be forced to mate with an alpha he despised, he wouldn’t have lost his time daydreaming about it, romanticizing the moment and falling in love with a fantasy.</p>",
    "notes": "<p>Read the tags carefully. The non-con references tag is here because two or so comments are made throughout the story about it, but it's brief and there are zero scenes of non consensual activities because I don't like to write about that kind of issues, otherwise I would tag the fic properly. I just put the tag just to warn you all and not be taken by surprise by it.<br>The story is settled in some era I don’t really know?…. It doesn’t take part on any specific historical period, though some of the settlings/clothes, specially Jungkook’s, were imagined like vikings’ aesthetic, it’s just that; I would say It’s based on their culture/looks, just to give you more of a graphic description, but they are not vikings nor it happens during that period of time (I’m clarifying bc i don’t want any smartass pointing out any historical mistakes in the story)<br>DISCLAIMER: all names of territories/lands/cities are fake, product of my imagination except for those characters based on real people. Any similarities with other stories or real names are pure coincidence. </p>\n<p> </p>\n<p>---</p>\n<p>Liza, this is for you sweetheart. I love you, thank you for always being there for me (and thank you for patiently listen to me while whining about this mess of a story, you deserve all the good in the world)</p>\n<p> </p>\n<p>----</p>\n<p><a href=\"https://demilune23.wordpress.com/jkjm/\" rel=\"nofollow\"> JKJM </a> translated the <a href=\"https://demilune23.wordpress.com/2018/01/26/trans-fic-just-a-little-bit-of-your-heart/\" rel=\"nofollow\"> story </a> to Vietnamese!!! thank you so much for your hard work</p>\n<p> </p>\n<p>GunsforJeon translated the <a href=\"https://www.wattpad.com/story/183260360-just-a-little-bit-of-your-heart-kookmin.\" rel=\"nofollow\"> story </a> to Spanish!!! thank you so much for your work</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Because I’m sure you all hated my guts because of the miscarriage scene here is some fluffy mated jikook to compensate :).<br>Now I expect only lots of love (which I did receive already btw you beautiful babies omg thank you !!!!!!!!!!!)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Maybe, if I'm in the mood for it, I will write from time to time some little drabbles from this AU but, as for me, this story is finished and free for you all to imagine how their future will be like from here on.<br>Thanks for all the love and support this story have gotten, I'd never imagine it would be so well received and appreciated. Thank you so, so much, love you all.</p>\n<p> </p>\n<p>side note: the girls were named after my friend’s story. Iana, I miss you dearly botch, I love you and I hope you are doing fine.</p>\n<p>As always, find me on <a href=\"https://heyhosam.tumblr.com/\" rel=\"nofollow\">Tumblr</a> and come scream at me, I would really appreciate it ;)</p>",
    "text": "Jimin had dreamed about how his mate would be countless times. Ever since he was a little kid, with rosy cheeks full of innocence and curious eyes opened widely to the world the only thing Jimin thought about was how his future alpha would be like; he wasn’t that concerned about their looks, but more about what they would have in common, how would they spend their time together -maybe reading the books he loved so much, maybe horse riding through the vast lands of Erigon, stopping by to recollect pretty flowers on a random field. But what had little Jimin’s heart swelling with happiness was imagining the love on his alpha’s eyes whenever they would look at him; Jimin was a romantic, he had read too much novels for his father’s liking about love stories between alphas and omegas, how their love surpassed everything else and wished, with all his heart and soul, that his alpha would look at him with adoration and love him unconditionally.\nHe had his alpha idolized, and his fondness towards his unknown companion grew alongside him for the next years, and teenager Jimin was already in love with whoever they would be, writing poetry about shining eyes and warm lips kissing his neck during his writing lessons, eliciting firm reprimands from his teacher for his lack of concentration.\nHe had had his fair share of suitors, young soldiers part of his family’s army, strong and attractive, but none of them was really the one despite their attempts at flattering the young omega with flowers and empty promises of everlasting love; he expected fire springing to live within him, his heart stuttering in happiness, so much that his whole body would combust, overjoyed with love the moment their eyes would lock on each other’s for the first time.\nBut that little fantasy was killed cruelly some days after his twentieth birthday, and it started with his father calling for him after dinner to his study for a talk.\nJimin was shy around his father, discreet. The head of the Park family was a man to fear, and Jimin knew his father had been highly disappointed his first born child wasn’t a strong and sturdy alpha that would lead the family years later when he would have to step down; the man never hesitated to show his displeasure towards Jimin’s nature ever since he was a toddler and couldn’t really comprehend why his own father looked at him with disgust. Jimin had been shoved completely to the side when four years later a second child was born, and this time with the desired alpha status.\n“Sit down, son,” he gestured vaguely with his hand to the empty armchair in front of the one he was occupying, his other hand holding his nightly glass of dry alcohol. Jimin hated the smell of the strong liquor, cringed his face in plain disgust once when his father allowed him to taste it when he became of age, giving his father another reason to look at him with disdain.\n“Yes father.” Jimin obliged, sitting put with a stiff posture. He always felt like he had to prove himself in front of his father, it didn’t help that the head of the household never failed to judge whatever he did. Jimin liked to think he had stopped caring about getting his father’s approval since he was still a prepubescent, but he knew that deep inside him the hope for his father to shoot him a proud stare was still burning slightly within his chest.\n“A couple of days from now we are expecting guests,” his father started with, sentencing Jimin with a cold stare that left the young man squirming in his seat uncomfortably, “and your presence in the meeting will be mandatory.”\nJimin frowned, confused. It was rare for his presence to be required whenever someone visited the mansion unless the one visiting the Park family was a relative or a close friend. His father was one to hold meetings privately in his study for later give their guests a nice and fancy dinner, expecting his wife and two children to be amicable enough to make the other leave with nice impressions and the promise to reunite again. And that was it, an omega like him was never given any important role in such meetings; he was a piece of decor.\n“You aren’t expected to do anything but behave,” said his father upon Jimin’s silence. The young omega nodded, eyes downcast and mouth shut despite all the questions forming on his head. “make me feel proud of you for once.”\nAt that, Jimin clenched his jaw, furious because of how those words fueled the urge to cry. He thought, that after all those years, he would be used to his father’s abhorrence towards him, but the words still stung, and his pride still hurt.\n“Yes father.” and with that Jimin was dismissed, the meeting just leaving a bitter taste on his mouth and, surely, some hours without sleep.\nAnd true to his father’s words, two days after came their awaited visitors.\nHe had been woken up early that morning, dragged to his private bathroom for a thorough cleaning, his personal servants scrubbing his body and splashing cold water onto his naked skin with apologetic stares, as if they knew what was coming for him; then his best clothes sewn by the best tailor of the realm with the silkiest robes and adorned with intricate and pretty swirls were thrown at him, his blond hair styled to perfection until no strand was out of place; everyone mentioned how pretty he looked but no one stopped for a second to answer why. Not even his mother when he directly asked her, she just caressed his face with a sad smile and left.\nBut all his questions would be resolved later, anyways; just, if he were smarter and more acute he would have guessed why he had been dolled up to the point he was the fine representation of beauty itself, and the impact of the news wouldn’t have caught him off guard and make his insides churn.\nTheir guests were Jeon Asger and his clan, and Jimin wished he could be brave enough to leave everything behind and run.\nThe Jeon clan lived all the way to the north in the mountains, and was composed by a long lineage of strong alphas who had lead their country to victory for the last hundred of years during the war. They were strong, rich, powerful. If a Jeon was present in the room everyone knew to bow their heads in respect; even Jimin’s father, who was proud beyond words, did tilt his head down when the head of the family dismounted his black like night thoroughbred horse that flared its nostrils menacingly to anyone who dared to approach the beast. And when the two men held hands in a firm handshake and shared a knowing smile it dawned on Jimin what was going to unfold: some sort of alliance from the two most powerful families that lead the reign was going to be forged and, somehow, Jimin had been forced to be a piece of the puzzle.\nOut of the corner of his eye Jimin saw the army the Jeon clan had brought with them -maybe over a hundred men, all of them tall and well built, clear blue eyes that shone menacingly and smelling a lot like alpha with what seemed to be their respective acquittances or mates. They dismounted from their horses too, and Jimin would have payed attention to the two tall and broad men that stood behind the lead of the clan if not because the aforementioned was now in front of him, dark blue eyes glinting softly with curiosity and lips curled up in what almost felt a friendly smile.\n“You must be Jimin, if my senses are not wrong.” said the Jeon, pointing with a robust finger his big nose. Jimin bowed quickly, caught off guard by the sudden attention and the friendly aura the sturdy man showcased, “As your father promised you are true beauty, young man.”\n“Th- thank you.” he stuttered out pathetically, not daring to look at the other man in the eyes. Jimin always thought his father’s presence was intimidating, but it couldn’t be compared to the alpha that stood proudly in front of him. The man was half head taller than him, dark grey hair pulled back and braided atop his head, tips falling to his shoulders, and showing his thick face and sharp jaw. He was bulky and the furs and dense clothes he was wearing added robustness to his figure; the heavy sword that hung on his hip told Jimin he wasn’t a man to play with, though Jimin would never dare to question him not only because of his status, but also because he had heard enough stories about the power and strength the man in front of him possessed that the thought wouldn’t even cross his mind.\n“Should we head inside?” intervened Jimin’s father, throwing a side glance to his son -a silent reprimand for his little slip up- before gesturing with an open arm towards the inside of the Park mansion.\nJimin didn’t know how to act, what to say, not even sure if breathing was allowed. His father kept glancing at him despite his mouth being occupied by maintaining a conversation with Jeon, fueling Jimin’s anxiety and urges to run away. The fact that he hadn’t been informed about what the meeting would be about didn’t help to calm him down, either.\n“The weather is quite nice here in Erigon.” noted the Jeon, discarding his black furs for a servant to take care of once they were inside the study. “In Telain we have snow covering the mountains practically the four seasons.”\n“It’s pleasant here, isn’t it?” continued Jimin’s father, politely asking for the other to sit on the armchair in front of him, the fire that had been lit up previously to warm up the room making the wood creak as in greeting. “We are near the coast, so the humidity of the sea provides nice weather even during winter.”\nJimin tuned out of their pointless conversation that went quickly to commercial matters, preoccupying himself by serving two glasses of his father’s liquor, one for each of the man involved in conversation; he threw a furtive side glance to the far corner of the room, hesitating to add two more glasses for the young ones that had followed them and stood near the door but they hadn’t been acknowledged by any of the older men so far nor they seemed to want to either, their furry capes still on despite the warmth in the room as if they wanted to be out of there as much as Jimin. They hadn’t spoken a single word, silently followed behind them through the mansion, their icy blue eyes studying everything around them; Jimin assumed they weren’t of importance.\n“Jimin, come sit with us.” the mention of his name surprised him and he almost tripped on his way to the spare chair that had been dragged previously next to his father’s seat. He still didn’t know what was going on and now that the attention was focused on him, the knot on his throat tightened.\n“He hasn’t been informed yet about the reasons of our meeting.” spoke his father before taking a sip from his alcohol, words obviously directed at the Jeon who raised an eyebrow in surprise but didn’t question anything.\n“Then the poor boy must be terrified, with so many alphas around him I can’t even imagine what he must be thinking.” laughed the Jeon playfully, releasing a deep chuckle before emptying his cup almost in a single gulp. Jimin swallowed thickly, words to confirm his fear almost spilling from his mouth but instead he just smiled and shook his head to the older man, refusing to show weakness so easily in front of strangers.\n“Quite the contrary. I’m honored to be in your presence, sir,” he said, pleased that his voice hadn’t cracked, “I’ve heard a lot about you and your family, read books about how your force and assistance lead us to victory when the invaders tried to take our lands.”\n“You flatter me, boy.” guffawed the man loudly with a chest puffed out with pride, his eyes crinkling at the sides and exuding a warmth Jimin never thought a man his status could withhold. His own father had never smiled at him like that. “But I’m not here to talk about my family’s adventures, although it was a nice boost to this old man’s ego.”\nJimin found himself smiling rather genuinely at the other, amused by his friendliness. If there was an easy way to an alpha’s heart was with flattery, even for someone like Jeon Asger. The Jeons had a reputation of being serious, commanding and almost classified as barbarians by refined families like Jimin’s own because of their antics and looks; They seemed unapproachable and distant because of their brute force, but this man in front of him had been the only one who eased Jimin’s nerves, even if just for a little bit, and he couldn’t be more grateful for it.\n“You are smart, son,” spoke his father then, attracting the attention of all presents in the room to him, “so you must have guessed by now that Asger is here for an alliance to be forged between our families for our lands to prosper now that the war is officially over.”\n“And there isn’t any more firm compromise to seal such agreement between two families than marriage.” added the Jeon, his smile now gone to study Jimin’s reaction.\n\nMarriage.\n\nThe word fell on Jimin’s shoulders like a heavy rock thrown from the skies. His eyes fluttered in a rapid attempt to contain his tears but there was nothing he could do to tamer down his quick heartbeat. He dragged his suddenly sweaty palms through his silky black pants, not caring if he was ruining the clothes; that was the last of his worries given the moment.\n“Jungkook, son, come here.” Jimin lifted his head, his teary eyes catching the mentioned man’s icy blue ones but dragged them away quickly when he saw the other coming closer, afraid the tears would fall down if he stared at his soon-to-be alpha for too long.\n“Jungkook’s the youngest of my children,” said the Jeon, patting Jungkook’s arm firmly and proudly when he stood next to them, recalled Jimin with jealousy, “but has demonstrated countless times the force and value an alpha his age should have. He’s your same age, so I hope that will just make the meeting more friendly.”\n“It’s a pleasure to meet you finally,” said Jungkook then, words spoken with a deep voice but without any feeling, failing to give his statement any meaning. “I’ve heard a lot about you.”\nJimin wished the earth would crack open right there and then and swallow him whole. He had the stare of four alphas glued to him, following his every move awaiting for his reaction; but Jimin didn’t know how to react. Probably, his father would be expecting a smile and the acceptance of everything without any word of protest, to look up at the young alpha with fluttering eyelashes and a flirty smile; completely opposite of what he really wanted to do, which was dashing out the mansion, get a hold of his horse and ride away into the woods where no one would see him cry his heart out.\n“I- yeah, me too…” he mumbled his lie after a couple of silent seconds, not daring to look up at the man standing next to him. He heard his father tut his tongue disapprovingly beside him, probably ready to scold him for his lack of manners but the Jeon spoke first, thankfully.\n“I’m sure this must be some news to get used to, but you two have some days until the wedding to get to know each other.” he said, sentencing Jimin with a firm stare, his friendly nature suddenly gone. Jimin just nodded curtly and kept his head tilted down as his fingers fiddled with the wavy hem of his white blouse.\n“I hope you aren’t that much tired and can join us for dinner tonight, Asger.” said Jimin’s father, changing the topic and, for once, Jimin felt thankful to his father for his lack of sensitivity, as he probably didn’t care Jimin was holding back tears.\n“It will be a pleasure.”\n \nDinner was as awkward as Jimin expected it to be. The two lead alphas consumed themselves in conversation about whatever they doted important, Jimin’s mother throwing some statement here and there, even the Jeon’s wife and older son participated, but Jimin just played around with his food until it was plain cold and the servant took it away discretely. His appetite was long gone, alongside his will to keep track of reality.\nAfter the meeting, the rest of the day had been a blur for Jimin. He only recalled locking himself up inside his room once he had been allowed to leave and cry for the following hours. He didn’t even open the door to his little brother’s insistent knocking once he had been informed of what was going to happen in the coming days. And Jimin always had a moment for him, even when he felt useless and invisible for everyone, because Jihan wasn’t at fault of the hatred their father had for Jimin, and the young alpha had always been caring and understanding with his older brother although their close relationship wasn’t of their father’s liking.\nJihan had set his eyes on him during the whole dinner, worried and anxiously trying to make Jimin look back at him, but Jimin did his best to evade and ignore it, afraid it would make him break down crying in front of everyone. And he was done over with the pitiful stares from his mother and the berated ones from his father, because even if he had tried to look composed, his swollen eyes and red nose were clear indication of what he had been doing the whole afternoon inside his room.\nAnother pair of eyes had been perched on him for the evening, following sharply his every move until he excused himself to his chamber. They had felt intimidating, like a predator studying its prey before jumping to its neck and the only thing Jimin could think about when his eyelids closed to try to catch on some sleep later that night was icy blue eyes watching him.\n \n \n \n————————\n \n \n \nThe following days were slightly chaotic. Everyone was fussing over him; the tailor for his measurements for his robes, his teacher helping him memorize his vows, the realm’s florist braiding a pretty flower crown for him to wear, his brother hovering over him like a personal bodyguard to shoot draggers to whoever tried to approach the omega, as if he could do anything now that everything had been settled. But what had Jimin almost screaming his lungs out in desperation had been his mother adamantly and profusely ignoring him. That hurt, because his mother was nothing but caring and lovely; she had been the one to give him those books he loved so much, the one to put on pretty flowers on his blond hair and praise his beauty until his insecurities vanished, the one to answer all his questions about mates and true love. She had been nothing but a warm presence in Jimin’s cold world but now that Jimin needed her comfort more than ever she was refusing him of that. That had hurt more than anything else because Jimin could live with his father’s distaste, but not with his mother’s avoidance.\n“It’s hard to find you, you sure know how to hide yourself.”\nJimin jumped out surprised, the movement almost sending the book on his lap to the floor if not because he flattened his palm atop the pages to prevent it. He remained it open, though he would have to backtrack some paragraphs since he had been daydreaming and not paying any attention to the story.\n“And why would you, out of anyone, be looking for me?” asked Jimin, giving Jungkook the coldest stare he could muster up. He was proud of himself for his brave outcome, though he was ashamedly aware he had little to do against him. A glare wouldn’t be enough to make a brave alpha like Jungkook retreat with whimpers of fear, but Jimin had also pride to protect and refused to submit to the other so easily. Not while he still had some freedom to taste.\n“I thought, given the circumstances, I’m the one who would be looking for you the most.”\n“You thought?” snorted Jimin, finally closing his book and standing up. He would have to read the chapter from the beginning anyways since he had been caught on his thoughts previously, so it wasn’t a big deal he had lost the page he had been reading. “That must have been a hard challenge for you. If everything I’ve heard about the Jeons is any true, you use your sword more than your brains.”\n“Where is the admiration you professed to my father the other night?” laughed Jungkook while casually taking a step towards Jimin, who swallowed clearly intimidated by the other’s piercing blue eyes and tall stance. Jungkook was almost a head taller than him, bulkier, stronger, and obviously threatening for an omega of little complexion like Jimin.\n“You all love swinging your sword back and forth as if it were another limb attached to your bodies,” countered back Jimin, tilting his chin up petulantly to show he wasn’t intimidated by Jungkook’s clear height advantage. “My words of flattery were about your braveness on the field, not about your capability to rationalize, which obviously is none existent.”\n“If my ancestors hadn’t been able to rationalize or plan strategies we wouldn’t had stood any chance against our enemies—” said Jungkook calmly, though it was evident his ego had been damaged by Jimin’s words, “—and, as far as I know, we managed to win our battles.”\n“You give yourself so much importance despite not being even born when the war took place.” mumbled Jimin shaking his head slightly with disdain. Jungkook was really full of himself, apparently, like every other alpha Jimin had come across.\n“I’m allowed to,” laughed Jungkook. It seemed he had that permanent smirk on his lips, cocky and petulant, and Jimin hated it. “after all, it was my family who fought against hundred of invaders to save your giant castle and vast lands so you can now live peacefully, reading love story books and picking up pretty flowers to put on your hair.”\n“As if your family had been the only one involved in our victory, Jeon.” spat Jimin angrily, frowning and taking a firm step forward. It offended him Jungkook thought he was only capable of recollecting flowers and look pretty like a doll. “we had our partake in it also, don’t give yourself that much significance.”\n“You are cute.” mumbled Jungkook with lips curled up in amusement, suddenly disarming Jimin. The omega looked at the other with wide eyes, caught off guard by his words and not really sure how to react. Jimin was lost when it came to the alpha, because he expected Jungkook to impose his force on him, to blabber about his power and brag about his status as all alphas liked to do to try to win an omega’s heart, but Jungkook had been following him around the past week with flatteries hidden behind teasing words that weren’t that much hurtful nor offensive, and accompanied with easy smiles to try to trick in Jimin into a conversation he wasn’t happy to take part of; their little meetings always ended with Jimin turning his face away and dashing out to somewhere else without crossing more than two words with the other although he wished he could get away by kicking him on the shin for his impertinence.\nBeing honest, this was the first time they had interacted for so long, and Jimin took the chance to stop and study his soon-to-be husband and mate properly.\nHe had to admit, despite himself, the alpha was attractive and exuded the kind of confidence that was charming; Jungkook had long and slightly curly dark hair that cascaded messily down his forehead, stopping just above his clear blue eyes but that was cut really short at the back. His face was a bit round on the cheeks, giving him the little innocence a boy his age should have, specially paired with his big doe eyes, but his sharp jaw and the thin scar on his left cheek told he had been deprived of such since a young age.\n“Am I that attractive that you are left speechless, my pretty prince?” teased Jungkook, the term to refer Jimin rolling off his tongue with mischief. Jimin snapped out of his daydream and huffed loudly through his nose like a horse whom had just been whipped on the butt.\n“I’m not any prince.” he mumbled, and refusing to entertain Jungkook any longer he turned around to make his way inside the household, fuming with anger. He had been enjoying his peaceful time alone in the gardens with one of his favorite novels in hand, which had been difficult to accomplish lately with all the fusing around him. Despite the winter season being around the corner the weather was still nice enough to spend some time outside in the gardens watching the few flowers that still dared to blossom. That was why he had ran away from his teacher and hid in the gardens, but Jungkook had managed to find him and ruin his peace.\n“Don’t you have anything else to do?” questioned Jimin once they were inside the household and noticed Jungkook had followed after him, “it seems you are seeking for my attention, Jeon. Am I that attractive you can’t spend a second away from me?”\n“You are, actually,” admitted Jungkook, efficiently making Jimin halt his steps and turn around to look at him with surprise, angered those words had tinted his cheeks slightly pink. “but I came after you because we are supposed to practice our vows for the ceremony.”\nJimin’s blush deepened and instead of his room he lead the way to the common room where everyone would be waiting for them, ignoring Jungkook’s chuckle from behind him and the shame that fell on him because of that.\n \n \n \n————————\n \n \n \n \nThe day of the ceremony came too quickly for Jimin’s liking. He had been thinking a lot the previous days, realizing how poorly he had been enjoying his youth; The past few days had been revealing for him and his feelings went from sadness and pettiness to anger and self hatred. Only if he had known he would be forced to mate with an alpha he despised, he wouldn’t have lost his time daydreaming about it, romanticizing the moment and falling in love with a fantasy. Because that was all it had been, a fantasy. And he had been an idiot for thinking he wouldn’t be one of those unlucky omegas forced into mating for benefit of a third party. Jimin should have accepted those flowers and kisses during his younger days from any alpha that tried for his attention, use his beauty for his own benefit and enjoy his last remains of freedom like a teen should have.\nHe looked at his reflection on the body-sized mirror hung on the wall. The boy in front of him looked beautiful with his blond hair pushed down by the weight of the flower crown the florist had put so much effort in, and he had to admit his robes were fabulous; the tailor had done a fine job as usual sewing a garment with dark clothes, colors perfectly balanced between reds, blacks and silvery grays that contrasted with the white petals on his head that alluded to the purity of its wearer. He should be ecstatic, shaking with happiness on his boots because of the grand wedding that was approaching, but his reflection looked little like how he had imagined it. Sure he looked beautiful, but his eyes were empty of any emotion and his lips curled downwards instead of a gentle and happy smile.\n“You look gorgeous, dear.” Jimin moved his eyes to the person talking behind him, catching her stare in their reflection. Jimin opted for silence, caressing his silky jacket with shaky fingers to get rid of nonexistent wrinkles.\nHe heard his mother approach him after the soft click of a closed door echoed in the silent room and stiffened his posture. His mother had been ignoring him for two weeks now, so her sudden approach just gave him a sense of uneasiness he never felt around her. He was hurt because she had hidden herself from him when Jimin most needed her support.\n“I’m sure you are going to leave everyone stunned.” she said with a soft smile, lifting her arms to reposition the crown atop Jimin’s head. Unconsciously, he tilted his head down, making it easier for her to reach; she was small and petite, Jimin obviously inherited his height from her, as her blond hair and expressive brown eyes.\n“Any of the stories you told me held any truth?” asked Jimin suddenly, studying his mother’s expression now that he had her close. He saw hurt cross her eyes and his heart stuttered painfully on his chest at the sight. “You always told me about omegas and alphas falling in love and I believed every single word but they were only tales, weren’t they?”\n“Jimin…”\nJimin could see the anxiety on his mother’s eyes, the pain those words caused her and he wanted so badly to retreat them but at the same time, Jimin rationalized, he had the right to put into words his thoughts. He had been hurting all this long without anyone by his side to help ease the pain away.\n“You knew, right?” he stated more than asked, because his mother’s avoidance could only mean she felt guilty for Jimin’s situation.\n“I’m sorry.” she said with a shaky voice, cupping his face with her slim hand. A lonely tear slipped from his eyes when he closed them, feeling both the warmth of his mother’s heart and the sadness on her touch. “I wish I could have done something for you, my dear boy, trust me when I say I tried.”\nJimin hadn’t cried in days, had promised himself he wouldn’t anymore, but he broke down on his mother’s embrace with gasped sobs and a broken heart.\n \n \n \nJimin recited his bows with lack of emotion and a dull smile, empty of any feeling. He listened to Jungkook’s calm voice promise Jimin love and caring for the rest of their lives when it was his turn to speak, and allowed the young alpha to take his limp hand on his own and slide the white gold ring on his finger.\nThe ceremony was a mix of cultures;  for one part, the Park family was refined and delicate, loved to word flourishes in the form of promises of everlasting love, sealing everything with the exchange of rings and a soft kiss on the mouth, leaving the more carnal part of the union to the intimacy of the couple. The Jeons, for the other part, liked to go straight to the point with the alpha marking the omega on the neck with a firm bite.\nThat was something bound to happen anyway, Jimin knew, but it was embarrassing having to display his throat for Jungkook to bite and later lick to ease the pain in front of everyone; that was something he hoped would be intimate, between him and his mate in the solitude of their chamber, but the Jeon clan said it was tradition and a proud accomplishment for the alpha to show everyone present how they proclaimed their omega, and since now Jimin was part of the family he was forced to follow traditions. Needless to say, Jimin’s blush remained on his cheeks during the whole ordeal, embarrassed Jungkook’s big hands holding his head delicately and his teeth sinking on his neck had made Jimin’s heart flutter.\nJimin took a sip from his cup, a big gulp of sour red wine that had him cringing afterwards, as his eyes studied the room and its occupants. It was slightly amusing the clear difference between one and the other family; the ones invited by the Park family, dressed in golds, shiny jewels and blooming flowers, looked with disdain and repulsion at the ones that came with the Jeon clan, who were laughing loudly, practically finishing all the wine of the Park’s larder and dancing with no care whatsoever. Even Jungkook seemed to be enjoying himself, sitting some tables away talking and laughing with his men while holding a cup with his long fingers, the white gold ring Jimin had put on one of them shining brightly under the candlelight.\nJimin had to admit Jungkook looked handsome. He had dressed up slightly for the wedding on his own way, pulling back his hair in a thick braid atop his head, his sides shaved to show his silver earrings, his muscular neck and sharp jawline; his attire was really different from Jimin’s own, practically made of dark leather, a black-like-night furry coat hanging from one of his shoulders accompanied with a sword on his hip. The Jeons were basically soldiers, lived for the battle; Jimin had learned during their time together a sword was symbol of power and strength for any alpha willing to become someone important in their clan, hence Jungkook sported his with so much pride and care.\nThe omega sighed tiredly, wishing for the night to be finally over so he could go hide in his bedroom and sleep all tiredness away but everyone in the room seemed to be having fun, and he knew he still had some hours ahead of pretending and fake smiles.\nAbsentmindedly, he lifted his hand to his neck, the tip of his fingers caressing with a feather-like touch the mark Jungkook had left there. He hissed softly, it still stung and burned, would be a painful remainder of their bond for days until he would get used to it; he hated it, but at the same time his omega side begged him to approach Jungkook and sit on his lap, curl into his chest, breath in his musky scent and let the other sink his teeth once again on his skin.\nJimin gasped in surprise at his own thoughts, blushing when he felt wetness between his legs after imagining Jungkook’s rosy and slick lips against his neck, and gave the room a quick and furtive look to see if someone had noticed. But, luckily for him, everyone seemed too occupied socializing, eating or dancing, and not even the alphas that were too close to the corner where he had been sitting for the past hour seemed aware of his hormones; he guessed it had to do also with the mark and scent surrounding him now, serving as a warning for everyone to retreat.\nJimin’s eyes went up when a pair of heavy boots cut his line of vision, following long and muscular legs all the way up to be met with icy blue, piercing and intimidating.\n“What?” he asked defensively at Jungkook’s silent treatment, his fingers curling tighter around his cup when he felt another wave of desire hit his insides at the alpha’s intense gaze.\nJungkook’s pupils dilated slightly, if not because Jimin was looking straight at them he would have missed it; he would have missed how those eyes darkened with lust.\n“I think it’s time for us to go back to our chamber.” spoke Jungkook softly, his words composed. It almost felt he was trying to bribe a child into stop throwing a tantrum, and that irritated Jimin.\n“Our chamber?” questioned Jimin, eyebrows furrowing with confusion. “I have no desire to share my room with you.”\nJungkook snorted while crouching in front of him, which Jimin thanked him silently for, so now it wouldn’t feel the other was looking down on him. “We are married now Jimin.”\n“So?” he said petulantly as he stood from his chair, hoping Jungkook would lose his balance and fall on his butt in front of everyone, but the other remained stoic as if nothing, now staring up at Jimin amusedly with a quirked eyebrow. The omega realized their close proximity, how Jungkook’s nose was near his crotch and hoped he wouldn’t be able to smell the slick that had dripped from his ass previously. “I’m not sharing a bed with you, Jungkook.”\nJungkook stood then, dragging his feet forward to close the little space between them until their chests were practically touching, which made Jimin aware of how much power Jungkook had on his hands.\n“I would say, for what I can sense, you would be pleased to share a bed with me tonight.”\nJimin blushed deeply, he didn’t need to touch his face to know he was burning from embarrassment. Jimin had never felt so flustered before and the amused smirk Jungkook sent his way didn’t help recompose himself. Jungkook had smelled him, of course he would, his nose and senses were made for it, for being able to smell any little change on his mate’s behavior or body.\n“I don’t—“ Jimin stuttered with the rhythm of his heart. He tried to escape, but tripped on nothing when he took a step back from the alpha, but lucky enough to not drop the contents of his cup all over himself. The stunt played on his disadvantage, though, because now he had Jungkook’s arms circling his waist to secure him, his nose almost buried on the other’s chest when Jungkook pulled him closer.\n“You don’t?” asked Jungkook, lips dangerously close to Jimin’s ear, his fingers curling tighter on the omega’s waist, digging onto the fabric of his silky jacket. “You smell like you do.”\nJimin felt his whole body shudder because of the tone in which Jungkook spoke to him; His voice so husky, pleasant to the omega’s ears, so alluring. They were pressed so close Jimin was able to breath in Jungkook’s scent without really trying, ashamedly admitting to himself how good that smell made him feel.\n“You wish.” he managed to say through gritted teeth, but his voice was barely louder than a whisper so it didn’t come out with the force and anger Jimin wanted. His response seemed to amuse Jungkook, though, because the taller just pressed himself closer, lowly chuckling on the shell of Jimin’s ear for later caress it softly with his lips, dragging them down under his jawbone. Jimin closed his eyes, tilting his neck slightly to the side, giving silent permission for the other’s moist lips travel down his skin, near the mark they had kissed hours prior, anticipating more touches, maybe a kiss—\nAnd just like it came, it was gone.\nJimin’s body sagged forward slightly when Jungkook separated himself and even took a step back to put more space between them, practically as if the omega’s body wanted to follow after him on its own accord. Jimin gasped at the sudden emptiness surrounding him, cheeks flushed and heart erratically beating against his ribcage. He opened his eyes to the sight of Jungkook observing him with dark eyes -as if he himself was regretting the distance that separated them now.\nThey stared at each other for a minute too long, Jimin’s fingers itching to touch the alpha in front of him. He guessed, taking in consideration the way the wound on his neck burned, that the mark -their bond- was what kept pushing him towards the other in contrast with his rationality screaming at him to turn around and run.\nJimin was confused, to say the least. Two minutes ago Jungkook was practically lurking Jimin in into his chamber, into his -their- bed, and just when Jimin was almost to give in -albeit not really consensually, the alpha stepped back. Was that some kind of game for the other? See how far he could push Jimin’s buttons, take advantage of his naturally submissive nature. Did Jungkook find enjoyment in playing with him, as all alphas liked to do?\n“I’m not going to force you into sleeping with me,” mumbled Jungkook after studying Jimin for another minute, as if sensing his inner monologue. The omega breathed out through his parted mouth, still trying to recompose himself, and gave him a confused look. “Even if I would love to make you mine tonight, I don’t think it’s honorable forcing my mate into my bed. I’m not that kind of man and I shouldn't have tried in the first place.”\nJimin nodded dumbly, not really sure how to respond to that. It wasn’t like he knew for a fact Jungkook was a bad person. He was proud, petulant and full of himself as any other alpha with an enormous ego and a sword equally as big, hence Jimin expected for Jungkook to be the same in matters of their intimacy and force Jimin to have sex with him on their very first night together, but he sure wasn’t expecting the alpha to be this reasonable and respectful and much less show remorse for his actions. Jungkook had flirted with him, had teased him playfully like the couples on Jimin’s novels did, and that was new. Not even the alphas from Jimin’s family -the supposedly refined and educated ones- were always that considerate towards the ones of his kind.\n“I still would love to share my bed with you tonight, though only if it's fine to you.” added Jungkook as an afterthought, his cheeks dusted a soft pink, his aura almost shy. The scene had taken an unexpected turn and Jimin marveled at the sight. It was new for him to see the always composed and reliable alpha have a brief moment of vulnerability -see his well built walls crumble slightly. Jimin didn’t know alphas were capable of feeling decorum at all. “I won’t touch you unless you want me to, I can promise you that.”\nJimin mulled over the idea for a couple of seconds, which, in fact, was what surprised him the most of this situation, mostly because at the start of the day he despised Jungkook’s existence with all his core, wished the other was just product of an ugly nightmare and would be gone once he opened his eyes, but now he was considering the idea of sharing a bed with him. A few hours ago he would have laughed at him and spit a loud negative before storming out the room.\nThey would have to eventually though, their marriage wasn’t just a fake union that would give them freedom to do whatever they wanted after everyone would start to forget about them; they were supposed to provide future heirs that would help reinforce the alliance between the two clans. Sleeping on the same bed was nothing compared to what they would have to do in the future.\n“I’m fine with that, I guess.” mumbled Jimin shyly, not even surprised his cheeks were still burning from embarrassment. He decided to trust Jungkook’s words, because the other hadn’t given any reason to not to so far despite his cocky attitude, and the fact that he was being respectful towards Jimin made the omega think he wasn’t that bad after all. He also felt the weird urge to have Jungkook close for the night, but he attached that to their new forged bond. “But if you touch even just a single hair of my body I won’t hesitate to kick you out of my room.” he added sternly.\nJungkook gave him a curt nod, enough to tell Jimin he believed his words and offered his hand palm up to ask for the omega to take it. Jimin was brought to present time, then, remembering where they were and surrounded by who and flushed red, hoping no one had seen him seek for Jungkook’s touches like a horny teenager.\nJimin took the alpha’s hand, big and warm, and Jungkook didn’t spare a single second before interlocking their fingers and pull Jimin away from the dinning hall. All pair of eyes fell on them, specially after it was announced they were leaving the room, eliciting some loud whistles and suggestive comments from Jungkook’s men that had Jimin’s blush going another shade darker, tempting him to scream at them Jungkook wouldn’t be lucky that night, as they so proudly proclaimed. They still had to pretend to have a good relationship, at least until they were alone in their chamber.\nJimin had to refrain himself from blatantly stare at Jungkook’s muscular and very naked torso when the alpha started taking off his clothes for sleep. Apparently Jungkook was one to sleep naked, though Jimin forbid him of doing so with spluttered words and red cheeks, only accepting for the other to bare his upper half if he was really that uncomfortable with clothes. Jungkook just huffed a laugh, silently accepting Jimin’s order and getting into bed quickly with just a mumbled good night.\nJimin couldn’t even close his eyes for the whole night, contrary to Jungkook who fell asleep practically the moment his head hit the comfy and fluffy pillow.\n \n \n————————\n \n \nIt hadn’t dawned on Jimin the changes his life would suffer now that he was a mated omega.\nDongwoo, his father, hadn’t explained to him at all his situation nor what his future would bring to him after the wedding. He had believed, rather foolishly thinking about it now, he would be allowed to stay safely for the rest of his life in the household that had seen him grow, but a week after the grand wedding his servants started packing his clothes and personal belongings, and this time he didn’t need to ask to know what was going on.\nThe Jeons were leaving towards Telain and he had to follow behind.\nJimin was being forced to leave behind not only the security of his chamber and his house, but also his mother’s warm eyes and his brother’s reassuring arms. He wouldn’t be able to see again the flowers of their garden bloom, breath in the scent of the first days of spring nor feel the burn of the sun against his slightly tanned skin during summer, he wouldn’t be able to choose which one of his favorite books to read to the chirping birds that nested at the trees surrounding the mansion.\nJimin’s heart kept creaking into tiny pieces the more he thought about all the little things he loved that would disappear from his life.\n“Do you have everything you need?” asked his mother, securing closed his cape. Jimin nodded, eyes fixed on her trembling hands fumbling with the button at his collar, and forced himself to hold back his tears. “It’s going to be really cold there, son. Please, take care.”\n“I will mother.” he whispered, finally looking up into her eyes. The same beautiful brown eyes he wouldn’t be able to look at for a very long time -if he ever would again, that is.\nJimin lifted his hands, cupping her tinnier ones before giving them a soft squeeze, trying to be reassuring. It was evident she was holding back her tears also and that just fueled Jimin’s own urge to cry. But his mother was going through enough pain as it was, he didn’t want to make her suffer any more by seeing him cry.\n“Don’t worry mother,” he said, curling his lips upwards into what he intended to be a comforting smile. “I will be fine, you know I can take care of myself. You taught me how to.”\nShe nodded quickly while sniffing loudly, unable to restrain her tears any longer. Jimin brought their hands to his lips, kissing the delicate knuckles of his mother’s hands. He sure would miss the softness of her skin every time she caressed his cheek.\n“I love you, mom.” he mouthed with love on her fingers before dropping another gentle kiss, his eyes fixed on his mother’s. She was unable to speak due to her choked sobs, but her eyes said loud enough the sentiment was mutual.\nHis brother, on the other part, was more vocal about it, and pulled him in for a crushing hug and apologized for not being able to do anything for him.\n“You don’t have to apology for anything, Jihan.” said Jimin, patting his brother’s dark blond hair. He was taller than him despite their four years of difference but Jihan always preferred to be babied by Jimin, even if he had to awkwardly curl himself downwards in order to fit into the small frame of his older brother.\n“But—“\n“Shush,” interrupted Jimin, pulling back a bit so he could look at his brother’s watery eyes. “You have nothing to do with this nor could have been able to do anything to prevent it. From now one you will have to be strong,” he said, cupping Jihan’s cheek, feeling his strong cheekbones under his palm. Jihan was starting to lose the fat around his face because of his sword training, which reminded Jimin how fast his little brother was growing up and everything he was going to miss with his departure. “Please take care of mother for me—“\n“I will, I promise.” he accepted quickly with a firm nod, sniffling loudly. Jimin chuckled, struggling in keeping composed in front of his brother’s tears.\n“And please, never change,” he added, now whispering so only them could hear, though it wouldn’t make much difference since their father wasn’t even there. “don’t let him change you nor make you do something you don’t want to. You have the power in you to make whatever you want and be happy.”\nJihan nodded again, eyes burning with determination as some tears fell down. Jihan was capable of much, his status granted him enough power to do so; he just needed the correct guidance in order to accomplish it.\n“I will write.” promised his brother again, his fingers curling tightly on the fabric of Jimin’s thick cape, a childish attempt to keep his brother still close to him. It reminded him of those times their father scolded them for playing for too long and sent Jimin away claiming he was just distracting his little brother from doing more important duties. Jihan would always whine and cling onto him until Jimin had to forcibly pry his tiny hands away and promise to come back to play later. “And I will make sure to come visit you as much as I possibly can.”\n“You better.” smiled Jimin, trying to put some chirpiness into his voice. He was going to miss his brother a lot. Who he would not miss, not even a tiny bit, was his father. The old alpha wasn’t worth of such sentiment; they had said their farewell early in the morning during breakfast, the head of the family wishing him good luck on his journey and nothing else. Not that Jimin expected more from him, knew a hug wouldn’t be granted, but still he had hoped his father would show just little of remorse for sending one of his sons far away after marrying him to a complete stranger. And Jimin decided this was going to be the last time he would allow his father hurt him.\nPerhaps that was the only good thing about this whole issue, not having to see his father ever again. But it sure didn’t compensate for all the things he was losing along with it.\nJimin heard the horses huff loudly and the scrunch of snow behind him, guessing they were impatiently waiting for the journey to began, just like the Jeon clan. He was aware of the stares pointed at them, specially of a pair of blue ones that had been glued on him since he had woken up that morning. Jungkook had been keeping distance, though, sensing Jimin’s awful mood and teary eyes as he watched from the side his servants pack everything. And the omega couldn’t be more thankful for it, because he needed space and Jungkook trying to approach him would have ended in either Jimin screaming at him or crying and he would rather do none of those in front of him.\nJimin threw a glance behind him, seeing Jungkook holding Jimin’s white horse’s reins with one hand, the other tickling slightly its gray nose attempting to tamer the moving animal. The beast was a bit nervous, his firm and muscled legs moving around because of the unknown human holding him, and probably also sensing the changes that were unfolding. Asmund was a smart horse, Jimin liked to believe he could understand him when he vented on the animal his thoughts and worries. He was glad he could at least bring his friend along.\n“I have to go.” he mused looking back to his brother and mother, frowning immediately when he saw their teary eyes. “I will miss you.”\nHe hugged them both for the last time, exchanged more farewell words and promises to try to keep in touch as much as possible, and before he could break into tears and make everything harder for everyone, he fled to his horse, took the reins from Jungkook and mounted. Asmund huffed when he felt Jimin’s weight sit on him, but squared his stance and waited for Jimin’s order to start moving.\nJimin didn’t look back, not even when he heard his mother’s sobs get louder as he rode farther away from them, head tilted down and heart swelling with pain.\n \n \n————————\n \n \nThe sky was a cacophony of reds and blues, tinting of the same purplish colors the clouds still present. The moon was pretty high already for when the sun started to set, and it was then when the clan decided to stop and rest for the night.\nJimin dismounted his horse silently when Jungkook advised him to do so and stood awkwardly at the side as everyone else moved around to arrange everything for the night, constructing temporary tents to protect them from the cold night ahead while others started lighting fire pits to cook some food for the large amount of hungry mouths.\nThey had managed to get pretty far from the capital in just one day, to the point Jimin couldn’t even see the shadows of the church of the city nor the towers of his mansion when he finally mustered the courage to look back.\nHe took off Asmund’s saddle, giving the beast finally some very deserved rest and walked him to the side by his reins. The omega scratched the horse’s soft muzzle slightly, just how the animal liked it, and chuckled when he responded by nuzzling into his palm, his brown eyes tender, warm. Jimin was really thankful to still have some source of comfort and familiarity.\n“Some water for your steed, sir.” Jimin turned around to the voice. A man, not much older than him was offering the omega a small bucket with water, his body slightly bowed forward displaying politeness. “Went to search for it at the river, so it must be a bit cold.”\n“Oh, thank you,” replied jimin, taking the heavy object in his hands. The man bowed again and then left him alone, getting away from him quickly and with long strides almost as if he were trying to run away from him. There was that stance of wariness and respect towards him coming from the clan, probably due to whom he was mated to, but not as exaggerated as when he was still back at home, where everyone at the family’s service was forced to look down whenever on their presence. Jimin thought that even if he liked it better here, where everyone seemed to be less afraid of being around him, he missed his home anyways.\nJimin put the bucket in front of Asmund, who seemed pretty happy for the offer and dipped his head, the poor animal satiating his thirst with big gulps.\nJimin caressed his strong neck softly, observing all the movement around him. He felt awkward, out of place; none of the men surrounding him had tried to friendly approach him so far —not even the omegas he had managed to identify within the crowd—, but instead kept throwing curious glances at the new addition of the clan. Jimin felt uncomfortable with so many pair of eyes studying ever single one of his moves.\n“Will your horse be comfortable sleeping on the open?”\nJimin lifted his eyes from Asmund, who was still happily sipping water, and nodded to Jungkook’s question. He hadn’t even noticed when the other had approached him, too caught up on his own thoughts.\n“He’s a strong boy,” he said with a small proud smile, patting softly Asmund’s neck, “there will be no problem.”\n“Good.” answered Jungkook with a curt nod. They fell silent after that, just staring at each other with curiosity, almost expectantly. Jungkook seemed to be reluctant to approach him, had kept silent the whole day riding his black horse beside Jimin, observing the omega carefully from the corner of his eye. Jimin had felt his stare even if the other had tried to be subtle, but Jimin had decided to pay no attention to him, though, and focused on calming his crying heart for all the changes his life was suffering.\n“We will have to share a tent,” mumbled Jungkook, eyes dark and serious. “which is going to be smaller than your bed.”\nThere was a huge orange glow behind him from the fires already lit, and some noise from all the men talking or laughing loudly. It almost felt magical, surreal, the setting so different to what Jimin was used to. They seemed pretty eager to spend the night in the open in the midst of the coldness with just their furs to guard them and some alcohol to warm up their stomachs. The clan seemed to enjoy being outdoors more than on their own homes, whereas Jimin wished they had stopped to spend the night at some inn at the outskirts of town, anticipating a soft bed and warm blankets; he surely wasn’t looking forward to sleeping on the floor in the midst of nowhere.\n“I was aware of that.” replied Jimin, suddenly slightly nervous. They had been sharing a bed the past days, but the mattress in his bedroom had been spacious enough for the two of them to sleep comfortably without touching at all. Because Jungkook had stood to his word and didn’t dare touch Jimin, not even grazing his fingers on Jimin’s clothes.\n“Good, just wanted to make sure.” Jungkook replied with a stiff nod. Jimin eyed him carefully, it was unusual for the alpha to act so awkward with him. If there was something Jimin had learnt from the other by their time spent together was that Jungkook was really secure of himself, but the past two days the other had been nothing but careful with his words, almost shy, as if he didn’t know how to act around him anymore now that they were mated and on their way to make a new home by themselves. See him hesitate so much made Jimin slightly squirm uncomfortably as his omega whined at his alpha's lack of comfort and security. “Are you hungry? They are preparing some porridge.”\nJimin nodded, his stomach grumbling slightly at the mention of food. He hadn’t really eaten much that morning before leaving, with all the commotion of the day he hadn’t felt hungry at all and now his body was paying the consequences; he felt drained. Now that he was more relaxed he felt like he could provide some warm food to his empty stomach.\nHe didn’t say anything when Jungkook moved forward after his silent answer, took Asmund’s reins and directed the steed to were the other animals were resting, guarded by a couple of young alphas.\nWhen he sat around the fire the noise quietened down for a second, eyes falling on him before everyone focused back on their business as if nothing. Jimin gulped nervous, anxious. He didn’t know why everyone felt the urge to look at him; maybe it was because his blond hair stuck out too much in the sea of blacks and dark browns surrounding him, maybe was the sweetness of his scent that attracted some unwanted attention, or maybe they were just really curious how a prim and proper omega like him, used to the mannerisms of the city, would behave in the wildness of the woods with someone like them: soldiers that basically lived in the open. He guessed they were as curious about him as he was about them, but he felt exposed and too vulnerable, all hunger suddenly gone.\nHe cleared his throat, and focused his attention to the bowl of porridge on his hands, nose scrunching slightly at the sight of it. It wasn’t really appetizing, not used at seeing such food on his household, he was afraid it would taste as awful as it looked like.\n“I think, uh— I will just go to sleep.” he mumbled softly leaning towards Jungkook, who surprisingly had sat beside him.\nJungkook turned his head towards him, frowning slightly at his untouched food before directing his blue eyes to Jimin’s face. “You haven’t eaten anything.”\n“I’m really tired—“\n“We have a long journey ahead of us,” interrupted Jungkook still frowning, but with worry gracing his tone, “you should eat. You are pretty thin, the winter we are approaching will be too harsh on you.”\nJimin blushed, although not really sure why. What Jungkook said wasn’t exactly a compliment, but coziness spread inside him at the other’s words. Maybe it was because of the unexpected concern Jungkook showed.\n“I will take it to my tent, then.” he mumbled and without waiting for the other’s response he stood and left, ignoring the countless eyes that followed his steps.\nWhen Jungkook entered the tent later that night, Jimin feigned to sleep to avoid the questions the alpha would sure ask. He listened to Jungkook strip and lay under the layers of furs of their improvised bed, unconsciously leaning his back towards the warmth of the other’s body, finally stopping his unrelenting shivering. The night was cold and Jimin’s clothes were too thin.\n \n \n————————\n \n \nJimin was cranky, the deep frown between his eyebrows spoke loudly for itself. It had been a week since their journey back to Telain had started and with every day that passed by Jimin’s mood dropped drastically along with it.\nHe was cold since his clothes were too thin, hungry because the food wasn’t much of his taste, his legs and arms hurt because of the long hours spent sitting on his horse. It was a nightmare.\nThe worst of it all was that it seemed only him was suffering such torture.\nA quick glance to every man surrounding him told Jimin they were perfectly fine. There was evident fatigue in their eyes, but at the same time they all looked happy and willing to spend as many days riding through the woods as possible, relishing in the nature and the falling snow.\nJimin hated it.\nAsmund, though, persisted; the traitor seemed to fancy walk for hours, his nose flaring to take in all the new smells he wouldn’t be able to perceive were they still in Erigon. Watching his companion so joyful almost made him feel guilty for the hatred he was feeling.\n“I hate winter.” stuttered Jimin to himself through his clanking teeth. He buried his reddened nose inside his cloak and wrapped the blanket more tightly around him.\nHe was alone in their tent after another lonely dinner -if that could be called dinner at all; another bowl of porridge that had ended in the horses’ guts instead of his own. He decided, upon everyone’s weird stares, he preferred staying alone and in peace in their tent despite the coldness. The omega was thankful Jungkook hadn’t forced him to stay in the fire pit with them despite his frown said he wasn’t pleased by Jimin’s absence.\nSo far, Jungkook was being civil, gave Jimin his own space, maybe to let him accommodate -which was being more difficult than the omega thought initially- and barely forced Jimin to do things he didn’t want to. Jimin would even venture to say it almost felt like Jungkook behaved as he didn’t exist, which he was torn between feeling thankful and offended.\nHe heard the loud cackles fade slowly as the cold hours of the night started, people roaming around to guard themselves inside their tents while others stood in their positions to guard the perimeter of their nightly camp. It wouldn’t take much for Jungkook to appear either.\nWhen he did, the alpha furrowed his eyebrows at Jimin’s curled up form underneath all the layers of clothes.\n“Are you that cold?” he asked, voice low in the quietness of the tent. Jimin sniffed as response and buried himself deeper into the coziness of the blankets. “I will get thicker furs for you to wear tomorrow, then.”\n“It’s fine-“\n“It’s not.” interrupted Jungkook while taking off his own furry cape to leave it on the floor before starting to undo his boots, back facing Jimin. “I don’t think it would leave me in a good position to let my mate die so soon into our marriage.”\n“Oh,” said Jimin dryly, “so you only care for my wellbeing to affirm your image of perfect alpha. What would others say if they knew I mean nothing to you.”\nJungkook snorted, turning his head back to stare at Jimin with fiery eyes, his ego obviously damaged by Jimin’s words.\n“Who said you mean nothing to me.” spat Jungkook, eyes glinting dangerously. Jimin swallowed at the other’s sudden display of anger, never had he seen Jungkook show such emotion towards him. “If you stopped playing the victim for a second you would have noticed I do care about your wellbeing, genuinely.”\n“Playing the victim?” inquired Jimin, voice rising slightly as the other’s words sunk in and rage started to awaken, “Well, may I ask of your forgiveness, then, for taking my time to adapt to a whole new environment, with people I never interacted with after getting married and mated to a complete stranger.” he spat, cheeks dusting pink from anger.\n“You speak as if you were the only one involved in this.” growled Jungkook through gritted teeth, now full body facing Jimin, intimidating enough to make the omega squirm, “You think you are the only one who had to accommodate to a new life?” Jungkook asked but kept talking, not waiting for Jimin to answer, “I wasn’t happy with the idea either but accepted it with no complaints because my father asked me to. What kind of son would I be if I dismissed my father’s request.”\n“A free one.” mumbled Jimin despite knowing the alpha wasn’t seeking for an answer, darting his eyes away from Jungkook, feeling intimidated enough to let the conversation die as fast as it started; he was not used at being allowed to speak freely his thoughts nor even think about trying to stand his own against someone, much less an alpha. He was already expecting for the other to slap him into silence like his father had done a few times during Jimin’s childhood. It was the first time they talked so openly about their situation and Jimin, too occupied drowning in self pity, forgot that Jungkook could have been in a similar position as himself. It dawned on him, suddenly, Jimin knew nothing about the alpha whom was supposed to be his companion for long years to come. And he wasn't even trying either to.\n“I was honored to be able to fulfill my father’s request,” added Jungkook, eyebrows still furrowed but his eyes were showing a different emotion, more soft. “You should be proud your father choose you to be part of such important alliance too.”\nJimin frowned at the floor, feeling the sting of tears wanting to spill. He didn’t feel happy to be part of this, he would rather be disowned and left to fend for himself for the rest of his life than be mated to a complete stranger, but he knew better than to phrase such cruel words to Jungkook -an alpha who had Jimin’s life on his hands from now on. Jungkook made clear his stance on the matter: even if he wasn’t completely fine with it he accepted because he felt like he owed his father that much. Jimin couldn’t care less if he disappointed any more his father.\n“I’m a man of word,” added Jungkook after a minute of silence, voice lacking anger, but his shoulders were slightly shagged forward; Jungkook was also tired of this constant tension between them and the insecurity that surrounded their relationship. This situation was new for the both of them, Jimin forced to remind himself. “I promised to take care of you and I will do just that.”\nJimin decided to not say anything to that, gave Jungkook one last glance before curling into himself once again, ready for sleep. He closed his eyes after the alpha turned off the only source of light, thankful Jungkook decided to not add anything else either, and just laid down next to the omega under the blankets, helping Jimin’s body gain some heat.\nWhen Jimin woke up the next morning he found a thick and furry cape folded at his feet, long and dark and soft to the touch. He buried his nose in it, sighing in unexpected contentment when Jungkook’s scent greeted his nostrils.\n \n \n \n————————\n \n \n \nIt was some nights after that Jimin startled awake, gasping for air. The jolt was notorious enough to make Jungkook jump awake too, his warm hands seeking for Jimin under the blankets blindly because of the darkness that enveloped them.\n“What’s wrong?” he asked worriedly, voice raspy from sleep but sounding pretty coherent despite having been startled awake at who knows what hour in the middle of the night. Jungkook was always alert and ready for everything even at unexpected times like this, his protective instincts pulling out the best of him at any given moment; Jimin was aware the other always left his sword near when he undressed for the night.\n“Noh-nothing— just—“ Jimin tried to speak, but he tripped with his words. Suddenly, his tongue felt like sand inside his mouth, as if he had been roaming around the desert for months without any source of water.\n“You are burning.” stated Jungkook from behind, his hand resting on Jimin’s arm and squeezing slightly as his warm body pressed closer to Jimin’s back. The omega whined feebly at the touch, unconsciously leaning into it to seek for more.\nTo say Jimin was confused would be an understatement. He felt feverish, thirsty, and suddenly the two layers of furs that covered him felt too heavy and hot above him but Jungkook’s hand on his arm felt not enough. He rolled around, accidentally bumping onto Jungkook, who had sat up slightly as to have a better view of his mate, and buried his nose on his naked chest. The omega ignored the squeak of his name that Jungkook released, ignored the confusion in his voice because he himself didn’t know why he was acting like that.\nIt calmed him somehow, having the alpha so close, his scent invading his nose and making his mind all fuzzy. He remained quiet like that for what felt like hours, when only a minute passed, just there breathing in the comforting musky scent of Jungkook’s soft skin.\n“Jimin….” spoke Jungkook, gentle hand on his shoulder to press him closer -or maybe it was Jimin himself who had leant all the way into the other’s firm chest, he wasn’t really sure. What he was certain about was that his name sounded really good on Jungkook’s raspy voice and it made heat pool on his lower abdomen. “Are you feeling sick?”\nJimin groaned, considering it enough of a verbal answer before digging his fingers on Jungkook’s shoulder blades, burying his nose on his neck. He felt Jungkook’s breath on his ear stutter as his large hand travelled down from Jimin’s shoulder to his waist, caressing the skin of his arm with a feather-like touch that just fueled the fire that was spreading wildly within him quickly, his whole body shivering with it.\n“Shit,” mumbled Jungkook, eliciting a soft whine from Jimin’s throat at the desperate lilt covering Jungkook’s voice, “you smell— you smell so good Jimin…”\nIt dawned on him what was going on then, as if cold water had been splashed on his face, and pushed Jungkook away roughly to put as much distance between them as possible.\n“No,” Jimin whimpered, shaking his head furiously as his throat constricted with the urge to cry. “No, this is not happening.”\n“Jimin—“\n“No!” he exclaimed, crawling away from the other when Jungkook tried to touch him again, “Don’t touch me.”\n“I won’t.” reassured Jungkook quickly and remained still where he was seated, observing with doe eyes the omega curling on himself. Jimin could tell, even blinded by the sudden lust consuming him that Jungkook was worried, probably confused, but Jimin couldn’t find it in himself to try to calm down the other because Jimin was anxiously getting closer to scream with panic.\nHis mother had talked to him about it when he was younger, around that age he started to feel his hormones take a toll on him and started feeling attracted to tall and broad alphas. His mother told him it would happen once he reached maturity, it was normal and something he would have to learn to live with, and once he found a partner and the bond was set it would become stronger.\nLuckily for him, his first heats as a teen were bearable, locking himself a few days on his room would suffice, but this time it was different; his mother was right, it was intense and more primal. The urge to touch, kiss and feel Jungkook on him was powerful to the point that the minimal space he had managed to put between them now felt like an abyss he wanted desperately to jump across.\n“I will go get you water.” spoke Jungkook softly, breaking the silence that fell inside their tent. The night was cold and silent, as any other night spent on the woods on their way to Telain and with Jungkook leaving, the little space felt more empty and cold than ever before.\nJimin didn’t even bother to grace Jungkook with a reply and curled in on himself even more as the alpha dressed himself quickly and went out. Now that he was alone and with no attractive scent to numb his senses, Jimin tried to compose himself. Even if this time it felt more ardent, he had been through this before, he knew what he was supposed to do to take care of himself. Now he just needed to convince Jungkook to leave him alone for a couple of days.\nJungkook came back shortly after, Jimin briefly wondering if the other had run all the way down the river and back; thought that made his insides burn with warmness because of the concern Jungkook was showcasing. Jungkook was trying to not disturb him more than necessary; it was evident by the way he acted, his movements were gentle, precise and careful, Jimin could feel more than see him hovering around him with calculated steps and hesitant hands.\n“Here, let me help you clean yourself,” said Jungkook, wet washcloth already on hand and reaching to Jimin’s curled form. The omega didn’t budge, though, kept himself under the blanket that was giving him too much heat for his liking and refused to look at Jungkook, too ashamed of the scent the alpha was probably smelling from him. Jimin felt like a prey, a tiny sheep being cornered by a wild wolf with its fangs bared and ready to jump on his throat at any moment of weakness.\n“I can do it myself.” he whispered, throat too dry to speak any louder, but made no move to actually reach for the washcloth. He flushed at the desperation he could hear on his own voice, and at the wetness that had started to leak from his ass, “You can leave, I know how to take care of—“\n“Jimin,” interrupted Jungkook, voice stern but also soothing, frown on his eyebrows evident even if Jimin wasn’t able to fully see him. “I won’t leave you here alone.”\nJimin wanted to keep arguing, scream at Jungkook to just leave him alone, but his body was drained of energy, his breathing started coming out ragged as he panted loudly, his eyes closing on their own accord; he didn’t even fight when Jungkook pulled away the blanket and pressed the damp washcloth on his forehead. Besides, even if he didn’t want to admit it, Jungkook’s presence calmed him, and his refusal to leave made Jimin, unexpectedly, breath in relief.\nHis heated body was grateful for the coldness provided, the shudder that shook him was more out of pleasure than discomfort, even if winter was almost at full strike and they were in the mountains surrounded by snow. Jimin let Jungkook’s careful hands clean away the sweat on his face, swallowing harshly his needy whimpers every time a wave of want hit him when Jungkook’s scent was too much for him. He just closed his eyes and allowed himself to relax and trust Jungkook just this time.\nJimin didn’t even notice when he had fallen asleep, but when he woke up again much later the light of the sun was trying to make its way through the thick cloth of their tent, some birds chirping in the distance.The light was gentle, and there wasn’t any more sound except for the tree branches waving softly with the wind; Jimin guessed it was still too early for the clan to be up and ready to leave.\nHe opened his eyes to a firm chest and smooth pale skin. He froze when it dawned on him he was laying atop Jungkook, literally sprawled all over the young alpha, who had a secure grip around his shoulders leaving no room for Jimin to escape. He succumbed easily, and allowed himself enjoy the calmness, too tired to fight with his own urges and relished in the comfort of Jungkook’s scent. Jimin released a pleased sigh after taking in a deep breath, nose pressed tightly on the alpha’s collarbones.\nIt was so weird and confusing how much Jungkook’s presence and smell could change his emotions; since their bond was forged Jimin had found himself drawn to Jungkook’s presence, even if he had tried stubbornly to distance himself from the other as much as possible. His brain kept reminding him of Jungkook’s nature: alpha; an alpha he couldn’t, or refused to trust despite the amount of reasons such man had given him to just do so. Wether he liked it or not, his omega was tied to the other now, seeking for Jungkook’s comfort, begging Jimin to get closer and closer.\n“Do you feel better?” spoke softly Jungkook, breaking the quietness of the morning. Jimin jumped in surprise and sat up, Jungkook’s arm slipping from his shoulder with no fight. He felt his cheeks burn, not only because of the heat but also because of embarrassment; Jungkook had been awake and witnessed how Jimin buried his nose and sighed in contentment right after.\nJungkook had his blue eyes glued on him, big and careful, awaiting for Jimin to do something, so he simply tamed down his rebellious blond hair while looking away from him.\n“I guess…” he mumbled. Jungkook sat up silently and leant his head forward to try to see Jimin’s face, who only blushed more deeply because of the attention, failing at finding a place to hide.\nJimin wasn’t feeling better at all, his body was still feverish, maybe a bit more than the previous night, and the carnal urge to sit on Jungkook’s lap was stronger than before.\nThe omega released a meek sound when one of Jungkook’s hands rested on his covered thigh, just above his knee, and when he looked up Jungkook’s eyes were shining with something unrecognizable.\n“We will stay here until you feel better,” he said softly, face blank but eyes determined. Jimin’s breath got stuck on his throat, arousal pooling on his lower region because of the undivided attention the alpha was giving him.\n“It— it’s alright, I can—\n“No, Jimin,” interrupted Jungkook firmly, leaving no room for arguments. Jimin shivered at his authoritative tone and bit his lip, feeling his hole start dripping as his arousal kept leveling up. “I’m not letting you out of here smelling like this.” he added, voice going deeper and rougher. Jimin would even venture to say he sounded a bit out of breath.\nJungkook leaned forward, his fingers squishing a bit more harder Jimin’s thigh, obviously sensing -and smelling- the omega’s arousal.\nThey managed to get pretty close, Jimin could practically taste Jungkook on his mouth; if he tipped his chin up their lips would touch even if just a tinny bit. He mentally scolded himself, with the little remains of sanity he had left, for wanting to do just that but relished in the satisfaction of seeing Jungkook struggling to hold himself back from doing the same, his inner omega proud his smell was driving the alpha crazy.\nThis up close, Jimin was able to see the little mole under Jungkook’s bottom lip, the clear blue that made his eyes shine brightly even with the little light they had inside the tent, his pink and desirable lips. Jungkook’s handsomeness wasn’t helping him control his hormones any better.\n“Let me help you,” spoke Jungkook, warm breath hitting softly Jimin’s lips. The omega could tell Jungkook was holding back, his tensed muscles that made clear the veins of his arms were fine indication of it, and Jimin had to admit it was admirable the force he had. Jimin was bewildered by the fact that Jungkook wasn’t shoving his dick inside him by now with no consideration whatsoever but, instead, was asking for permission to touch him.\nJimin didn’t move, though, nor gave any indication for the alpha to know it was fine to do something, too caught up in his thoughts and lost in the warmth of those blue eyes. Jungkook’s hand still rested on his thigh, a little higher than before, fingers digging softly in the meat of Jimin’s thigh, as if he needed to hold Jimin tightly in order to keep himself in check.\n“I won’t touch you more than necessary,” promised Jungkook gently, eyes roaming around Jimin’s face until they stopped on his lips. Jimin, not sure if unconsciously or not, licked them slowly, flushing bodily as Jungkook’s eyes darkened even more. “I promise I will just do enough for you to feel better.”\nAs if to prove his point, Jungkook’s hand went further up his thigh, his nimble fingers curling around the fabric of the furs that covered Jimin’s legs before pulling it away gently until the hem of his undergarment was visible. Jimin’s breathing sped up synchronizing its rhythm with his heart, embarrassingly aware of the slick slipping down his hole with the mere grace of Jungkook’s fingertips on the hem of his clothing.\nJimin’s mother had told him that only the touch of his alpha would help him overcome the heat with more ease once he would be mated, and at that moment it sounded nice having to rely on someone like that, but now it only made Jimin panic. Both Jungkook and Jimin knew this, but it was scary to let someone that was still new to his life be so intimate with his body.\n“Jimin,” Jungkook mumbled -practically grumbled on his ear to get Jimin’s attention. The omega gasped at the sound, unconsciously bucking his hips up seeking for more.\n“Ye-yes?” he managed to croak out, lips trembling and fingers fisting into the sheets underneath them.\n“Would you allow me to touch you?”\nJimin paused, breathing hard against Jungkook’s mouth, the little remains of sanity he had left screaming to not succumb to it, that he could take care of himself as he always did, but Jungkook’s warm touches and pink lips were so tempting to resist.\nHe nodded, stiffly jerking his head once to give the alpha his approval, and was all Jungkook needed to dip his fingers under Jimin’s undergarments. The omega gasped, leaning his head forward to rest his forehead against Jungkook’s sweaty own for support, eyes closing on its own at the overwhelming sensation of having those piercing blue eyes intently staring back.\nJungkook’s fingers were gentle but stable as they made their way down Jimin’s length, curling around the tip to give it a soft squeeze that awoke breathy moans from the omega. Jimin whimpered on Jungkook’s mouth when he tugged softly on his length, breathes coming out ragged through his parted lips. The touch was really brief but electrifying; Jimin’s whole body felt on fire, as if he had been thrown in a wildly burning bonfire. Even though the alpha hadn’t done that much but caress up and down his length, Jimin was already on edge, feeling his muscles tense as his orgasm approached quickly. It was upsetting but comforting at the same time; he felt oddly relieved at the feel of Jungkook’s palm working him to his climax with every slow pump, with every drag of his thumb on the slit of his dripping cock, the hot breath against his lips ragged, as if Jungkook himself was enjoying the moment just as much as Jimin.\nJimin was too sensitive and his body was responding instantly at every little touch; and that vulnerability would have been scary if not because Jungkook’s scent was all over him, wrapping him in a thick blanket of comfort and stability that had Jimin clinging on Jungkook, his hand curling around the other’s bicep tightly, for sure leaving nail marks on the before unblemished skin.\nJimin came embarrassingly quick with just a couple more of tugs to his dick, spurting his release on the latter’s hand with a high pitched whine that sounded close to the word alpha, cheeks flushed and hips bucking up on Jungkook’s hand. But despite his release, he didn’t feel satisfied enough, his member was still hard on Jungkook’s fist and his hole clenched around nothing, which had him whining with disappointment, a bead of slick slipping past it with ease. Surely it hadn’t been enough to placate the fire burning his insides to ashes.\nBut before Jimin could complain or ask Jungkook for more, the alpha pushed him all the way down until he was laying on his back, his broad form hovering above Jimin with eyes burning with determination. It had Jimin gasping for air, his foggy brain begging him to get closer to the alpha, to touch wherever he could reach, so he lifted his arms and embraced Jungkook’s torso, digging his fingers on his ribs to press him down closer. Jungkook seemed hesitant, though, and even if Jimin had widened his legs to accommodate him better so they could get closer, he still maintained a little of space between their bodies. Jimin whined again, the omega within him sad with the thought Jungkook was rejecting him; it was disconcerting how much he craved for Jungkook’s proximity, desperately needed his touch, his kisses, his dick inside him fucking him good; the urge was so raw from within him that it surprised Jimin the same it aroused him.\nJungkook moved his hand underneath the omega’s undergarments, his hand covered with Jimin’s come making a mess on its way down until the tip of his fingers touched slick and prodded at Jimin’s entrance teasingly. Jimin threw his head back, mouth opening wide while gasping for air; the simple grace of Jungkook’s fingernail on his hole had all his muscles contracting with want for more, his legs spreading even wider than before. Jungkook grunted, head dipped low to focus on his hand under Jimin’s clothes. The omega whined softly at the sound, wishing Jungkook would repeat it on his ear or against the skin of his neck as to feel the alpha was laying claim on him.\nJungkook inserted delicately the first finger, slipping it with ease because of how wet was Jimin already; the alpha groaned in response to Jimin’s little mewl of pleasure, taking it as his cue to push his finger until it was all the way in. Jimin tried to remind himself to relax, he had done this before and knew that letting his muscles loose was what made it better, but the feeling of another person’s finger inside him was foreign albeit satisfying; however that was probably because it was Jungkook’s finger and accompanied with his scent.\nJimin could smell the arousal of his mate, scent radiating from him in waves that reached his sensitive nose and that elicited little whimpers of satisfaction. But Jungkook was too far away, his brain supplied, so the omega lifted his hand and with force he didn’t know he had pushed Jungkook down to make him lose balance and press their bodies together until he had his neck at the reach of his mouth. The alpha didn’t complain, quite the opposite; just allowed Jimin do as he pleased while he kept working his leaking hole open, by now with two fingers.\nAnd while Jungkook was busy scissoring his entrance, Jimin took his time to rub his cheek all over Jungkook’s jaw and neck, drowning in the delicious smell of his alpha.\n“Fuck” whispered Jungkook, sounding a bit desperate, and Jimin’s only response was to moan. He had him down in a firm grip, fingers digging on his nape as his hips rolled down seeking for more of Jungkook’s agile fingers that were thrusting into him with more force and speed. Jimin was proud to smell himself on Jungkook’s skin after having scented him, and even more of smelling Jungkook on himself; he relished in the comfort of their scents together and the implication of belonging that came with it. He suppressed the thought that he wasn’t supposed to let himself succumb so easily.\n“Please,” he moaned, not sure of what he was asking for nor caring he was being too loud, because Jungkook’s fingers felt really good on him to worry about being heard. Jungkook seemed to understand, and his fingers moved faster, thrusting in a out deeper with ease, his hips bucking forward on its own accord as well —maybe imagining it was his own dick penetrating Jimin instead of his fingers. Jimin clenched his eyes shut as his abdomen started to get tense, his brain clouded by lust, his nose filled with Jungkook’s scent to the point he could taste the salt of his sweaty skin; but what pushed Jimin to the end was the feel of Jungkook’s hard cock prodding at his inner thigh, heavy and warm and so big, and came with a loud moan imagining how that dick would feel inside him, knot stretching him open to keep his seed from skidding out.\nIt took Jimin a couple of seconds for his blurry vision the dissipate and notice Jungkook removing his hand carefully, for later look at his glossy fingers for a second too long before cleaning them on the blanket; it almost looked as if he hesitated to clean them up with his tongue instead.\n“Do you feel better?” broke the silence Jungkook a few heartbeats later, blue eyes glued to Jimin’s sweaty form again. The omega curtly nodded, this time sincere with his answer. He couldn’t move, his bones seemed to have melted inside him and his clothes were sticky with sweat and cum but despite all that, he felt good and satiated.\nJungkook seemed relieved by his answer and started to sit up, Jimin’s hand slipping from his neck and falling limp on his side.\n“Where are you going?” Jimin croaked out, slight panic gracing his tone. Jungkook stopped, hesitating to move further away sensing Jimin’s discomfort and needy voice. It wasn’t a secret omegas in heat were in need for their mate to be closer, their scent the only source of comfort and security in such vulnerable moment.\n“I need to talk with my father,” he explained, eventually separating himself from the omega, “I have to tell him you aren’t in conditions to travel for now.”\n“What about— uhm, you are…” Jimin mumbled, shyly glancing down at the bulge inside Jungkook’s undergarments. The alpha seemed not bothered though, and dressed himself quickly.\n“Don’t worry about it,” he said, his back to Jimin, giving to the omega the perfect sight of his muscles moving, “this wasn’t about me.”\n“Don’t you want me to—“\n“I said to not worry,” interrupted Jungkook glancing over his shoulder with what Jimin supposed to be reassurance, the corner of his lips curved slightly upwards, “I will be back quickly.”\n \n \n \n————————\n \n \nJeon Asger decided to leave with the rest of the clan, leaving behind the newly mated couple and some of Jungkook’s men just for extra protection. The woods weren’t significantly dangerous, but there were cases of travelers being robbed by outlaws. So, even if Jungkook was a very capable alpha and could take them down easily, being occupied by pleasuring his mate could distract him of doing so, hence the head of the clean decided to not leave them completely alone and unprotected.\nJimin hadn’t stepped out of the tent in three days; Jungkook had been the one in charge of feeding him and make sure he was taken care of, because the omega was too lost in his lust driven state most of the time to care about anything else. And still, even in that state, Jimin was conscious enough to know Jungkook was being a true gentleman.\nNot even once had he gone too far, nor forced himself into the omega seeking for his own release; not even when Jimin was out of his mind and begged desperately for his knot. Every time they touched it had been after Jimin had given him his consent and never more than necessary; but being honest, Jungkook’s fingers on him and his scent were more than enough to have Jimin moaning and coming all over himself.\nAnd after the fifth day passed, the burning heat started to simmer down enough for Jimin to feel like a rational person once again.\nHe was reading one of his books sat on what they called a bed, because still to this day Jimin refused to call a bunch of furry blankets pilled up one above the other on the floor a bed, when Jungkook entered the tent with two steaming bowls of food on his hands, a cold gush of wind sneaking inside through the crack that had Jimin shivering slightly.\n“Oh, I didn’t know you were awake already,” said Jungkook softly, leaving the two bowls of porridge on the floor near the bed. “I got you some food.”\nJimin folded the corner of the page before closing the book, his stomach growling at the smell of the porridge; after a lot of persuading from Jungkook’s part during the omega’s first days of heat, Jimin finally put a spoonful of the food on his mouth- finally succumbing to his hunger- to discover the meal wasn’t as horrible as he first thought, and found himself enjoying it and even anticipating the moment the alpha would appear with the bowls on his hands. Although he would never admit it out loud, specially not after seeing Jungkook’s smirk when Jimin almost devoured the food in one go.\n“Would you mind if I go down the river to clean myself?” asked Jimin after swallowing a big portion of meat. He didn’t feel like he needed Jungkook’s approval, but the alpha had been nothing but civil with him and Jimin rationalized that the least he could do was to stop being so stubborn and make things a bit easier between them, specially after the other had been taking care of him so well.\nJungkook stared at him, silently munching on his food, his cheeks round and full. Jimin almost cooed out loud at the sight; he looked so young and innocent Jimin forgot for a second he was a strong alpha capable of killing a man with his bare hands.\n“It’s not enough when I help you clean yourself?” he asked mischievously instead of answering Jimin.\n“Uhm, well, it was indeed helpful,” admitted Jimin, blushing at the memory of Jungkook’s hands roaming freely around his sweaty body, cleaning any trace of cum and slick with a damp cloth, “but, although if I appreciate your kindness, I would prefer a thorough cleaning.” he explained, looking away from Jungkook’s amused eyes and smirk. “Besides, the river is not that far away…”\n“I will tell my men to stay away the river so you can enjoy yourself in peace, then.” said Jungkook, going back to his food. Jimin’s omega internally relished in the possessive glint hidden behind the alpha’s mumbled words, “but I will accompany you. Even if it’s not far from here, you still have to walk around the woods and I don’t want to leave you alone out there unknowingly of who’s watching.”\nJimin nodded, conceding quickly to Jungkook’s request, fully aware it would be too risky to let an omega roam around the woods unprotected. So far, they had been lucky enough to evade thieves, probably due to the large amount of men they travelled with, but now that the numbers went down significantly chances were that they could get attacked, and Jimin preferred to keep living without having to face such unpleasant experience.\nThey ate quietly for the most part, even when Jungkook gave some meat portions to Jimin and pretended that his cheeks didn’t turn pink because of it. Jimin, though, guarded the memory in his brain, alongside other moments in which Jungkook had pleasantly surprised him.\nIt was when the sun was starting to set that Jungkook took Jimin to the river, the omega following Jungkook’s footprints in the snow and mentally cursing because his feet looked small compared with the other’s.\nThe river wasn’t that far away, since they usually followed its path closely in order to orientate themselves and as to have a source of water for them and the horses. Jimin hadn’t been able to see the water for himself up close yet, though, only catching a glimpse of it as they rode nearby the previous days, seeing pieces of frozen water floating following the course of the river, snow pooling at the sides.\nMaybe it hadn’t been a good idea, Jimin thought inwardly when his teeth started clattering slightly because of the cold, but his hair was sticking to his forehead, rough and greasy on his hands every time he brushed it off his face. He braved himself to do it, he could endure a bit of coldness just to have back that sense of cleanliness he missed so much. He pouted then, remembering his bathing tub back at home and the warm water his servants would heat up before dropping it slowly into the tub. They were supposed to help him clean, but he always preferred to be left alone, sometimes with a book, sometimes only himself and some candlelight, and let his skin prune up until the water would become too cold or a servant came in to call him for dinner; Jimin loved the feel of purity the water gave him, the smoothness of skin after drying himself with a woolly cloth.\n“Are you really going in?” asked Jungkook, snapping Jimin back to the reality; a really cold and crude reality.\nJimin nodded, opting to not stare at Jungkook as he got rid of his cloak, taking a step forward towards the edge of the river; the alpha probably was waiting for Jimin to cower and rush back to his tent knowing well how much the omega hated the cold. Jimin had been pretty vocal about it, and the alpha had tried, during their short walk to the river, to talk him out of it. But Jimin was of stubborn nature, and refused to let his hair and body get more greasy and smelly than it already was.\nJimin discarded the leather vest that covered his torso and started to pull off the strings of his thick tunic when he felt Jungkook’s burning gaze on him. He blushed as he pulled the fabric over his head, immediate coldness enveloping him since his thin under shirt wasn’t protection enough.\nThe alpha was keeping some distance, body turned towards the omega with eyes piercing and fierce. Jimin had felt them switch their little mischievous and playful sparkle to something more dark upon seeing Jimin starting to undress, awakening more shivering on the omega’s body, coldness suddenly forgotten. Heat spread from his cheeks to his neck and torso, breath quickening a bit once Jungkook’s thick and musky scent reached his nose, enveloping him completely. Jimin undid the laces of his boots after taking off his undershirt, leaving him almost naked and bare to the snow pooling at his feet. His toes went immediately red, a sudden shiver shook his body completely and before he could think of getting his pants off he heard the scrunch of snow at his side, quick and steady steps directed at him.\nHe tilted his head up, surprised by Jungkook’s sudden movement that stopped as soon as it began, because the alpha stopped just at his side, breathing hard and blue eyes staring down at the omega with intensity. Jimin was so occupied drowning on those clear eyes to notice Jungkook’s fingers tracing his forearm, softly in a feather-like touch that just left Jimin craving for more.\n“What—“\n“Are you sure you want to get in?” asked Jungkook with a rough voice, gravelly enough to elicit a soft whimper from Jimin’s throat, “You are shivering.”\n“It will be fine,” responded Jimin meekly, leaning forward into Jungkook’s warmth unconsciously.\nJungkook nodded, but seemed wary of letting him approach the half frozen river, fingers now curled on Jimin’s wrist.\n“Maybe you— would you want to— maybe you could join me…” trailed off Jimin, feeling his body heat up the more they stood there staring at each other; he was obviously still feeling the last remains of his heat if Jungkook’s stare managed to rile him up to that extent.\nJimin wasn’t sure why he asked the other to join him, suddenly feeling the need to keep closer to the alpha. Jimin saw Jungkook’s eyes flicker down to his neck, were the mark of their bond was practically healed, only a pink scar to signal their bond, before locking on his eyes again.\n“Would you like me to join?” asked Jungkook anyways despite the request had come from Jimin’s own lips seconds before. The alpha still respected his opinion, still needed vocal confirmation from Jimin for everything that involved any kind of physical contact. Those actions made it extremely hard for Jimin to hold on to his hatred towards him, to keep pushing him away; Jungkook’s kind gestures and respectful manners kept awakening something warm within Jimin. And that was both scary and thrilling.\n“I asked you to,” replied Jimin, licking his lips nervously, “besides, that way you will provide me warmth so I won’t get sick.”\nThat reasoning sounded lame even to his own ears, but it seemed to convince Jungkook who started to undress as well under Jimin’s scrutinizing stare. Jungkook was all muscle and soft skin, on the pale side if compared with Jimin’s more tanned one, moles of all sizes splattered all over his body. Jungkook was beautiful, even with a pink scar practically faded that crossed his left pectoral downwards to his ribs that would probably make an interesting story to tell their pups in the future. He stood there simply staring, his body heating up with just looking at the other despite himself; Jimin had never felt so driven to anyone before, but Jungkook’s scent kept calling for him with fervor, which caused an angry internal battle between his pride and his need.\nJungkook dragged him towards the water by his wrist once both of them were fully naked, both gasping softly as the snow at their feet tinted their toes an angry red, and before any of them could think about it twice Jungkook jumped in the water, Jimin following behind with a loud yelp that turned into a whine once the cold water made contact with his skin.\n“Oh, fuck,” cursed Jimin out loud, pressing himself on Jungkook, who simply enveloped his quivering form with strong arms. Jimin was not used to such proximity, or at least not while he was conscious of his surroundings with a clear mind, but he couldn’t find it himself to fight against it; Jungkook’s warmth was everything he needed at that moment.\nJimin turned his head to side, not brave enough to stare at Jungkook from this close, and circled his arms around Jungkook’s torso, not even trying to be subtle when his fingertips caressed the alpha’s rib muscles all the way to the back. He felt Jungkook shiver in his arms, his hot breath on Jimin’s ear and lips too close for his own sanity.\nThe water only reached up to their waists,  but the temperature was so low, Jimin felt his whole body get numb. He shivered once again, and rested his cheek on Jungkook’s shoulder, his brave advances fueled only by the urge to stay warm. Or so he told himself.\n“Too cold?” asked Jungkook, voice a bit restrained due to the almost frozen water, probably. His hands were on Jimin’s waist, pressing him close firmly but not in a way that made Jimin feel trapped. Jungkook was expert in that, Jimin noticed; expert in making Jimin feel safe in his arms.\n“I— It’s alright,” he stuttered out, finally mustering the courage to separate a bit from Jungkook’s warmth. He took a brief look at the alpha’s face, whose lips were rosy and trembling slightly, before kneeling until the water reached his neck. He gasped, his hands finding their home on Jungkook’s own to give them a squeeze and have something to hold on, eyes never leaving Jungkook’s even for a second. Jungkook chuckled, amused probably by Jimin’s reaction, but kept still holding the omega’s hands on his own and staring down at him with something akin to fondness.\nJimin was aware of their proximity, and where his face was close to now that he was curled under the water, but he couldn’t find it on himself to step away, not with Jungkook’s eyes staring back at him observing every single one of his moves with such tenderness. His cheeks flushed at the intensity to the other’s gaze and, for lack of any other place where to hide, he dipped his head underwater. His whole body convulsed and bubbles slipped out from his mouth when he gasped. He felt Jungkook squeeze his hands before there was movement in front of him, indication that the alpha had done the same and dipped under water completely.\nWhen he popped his head out the water Jungkook was already out too, wet hair stuck to his forehead and soft smile on his lips, wide enough to show a pair of white and large teeth. It was the first time Jimin had seen him smile so broadly and genuinely and, unconsciously, copied it with his own mouth, finding Jungkook’s unexpected happiness contagious.\n“It’s so cold,” stated Jimin, still smiling despite his trembling body. Jungkook mimicked him and chuckled too, while still supporting the omega with his hands.\n“This was your doing,” said Jungkook, playful smirk on his lips, sounding breathless, “I don’t want to hear you complain.”\nJimin felt droplets of water fall from his hair to his naked shoulders and freed one of his hands to brush his wet bangs off his face. He saw Jungkook follow the motion closely, mirth suddenly gone from his face.\nWithout any other word Jungkook put a bit of space between their bodies, ignoring Jimin’s questioning gaze before starting to rub his own black hair with his hands, refusing to stare back at the omega with what seemed a shy demeanor. There was no soap they could use, Jimin sadly found out when he had tried to find some, so the cold water would have to suffice. He scratched his scalp with his nails, and it was enough to feel more clean already.\nJimin found himself staring at Jungkook more often than not, observing his antics; like how he shook his head slightly to get rid of the droplets of water that kept falling on his face, or the way his curly and wet hair stuck up to all directions, the way he scratched under his nose slightly more of an habit than anything else. Jungkook was cute when he wasn’t trying to be all manly and domineering, which was his usual form. When Jimin and Jungkook were alone, the alpha was less tensed, his gaze softened; Jimin thought he enjoyed it more when Jungkook wasn’t building walls around himself.\nHis trail of thoughts diverted without him noticing, and suddenly he found himself admiring the flex of Jungkook’s arms, the way the pale skin hugged tightly the muscle underneath, flashing memories of those same arms flexing while Jungkook’s fingers thrust into him making Jimin’s breath get caught on his throat. He rubbed his arms more harshly, in a weak attempt to distract himself from the form his thought were taking, but it was too late; he was definitely still dealing with the last remains of his heat, his omega suddenly awake with desire, wanting more than anything else to touch his mate.\nHis mate.\nIt had been almost a month and Jimin was still not used to that term; he had found himself using it in his head an embarrassing amount of times while his heat stroke the hardest, his lust and want obviously winning against his rational side without much effort.\nJimin felt his body heat up, feeling even more feverish in contrast with the freezing water. He cursed under his breath, hating himself for allowing his brain to come up with images of Jungkook’s naked body pressed against his. It wasn’t the time to get riled up, but his body acted on its own accord, not giving Jimin even a chance to fight against it.\n“Are you alright?” asked Jungkook, voice low, almost like a grunt. Jimin froze, his fingers digging into his forearms while curling in on himself in a shy attempt to hide. Of course Jungkook would have felt the sudden change in him.\n“Uh— yes— just,” he stuttered out, eyes closed tight to refrain himself from staring at the alpha. He knew that if he allowed himself a simple glance he would be gone and begging for his cock, for his knot. That raw need still hurt his pride, even if he knew it was nature acting; his body asking to be mated, to be given pups to take care of for the prosperity of his kind.\n“Do you want me to…” trailed off Jungkook while moving closer. Jimin shuddered at the tiny waves hitting his heated up body, and even more when Jungkook’s body was close enough to feel his warmth.\nOf course Jungkook would ask first. It had been routine for the past week: Jimin feeling needy, fighting with himself at first before Jungkook would feel it, not needing much for the omega to give in after having asked for his permission.\nJimin finally opened his eyes, gasping as he hadn’t expected Jungkook to be that close. The alpha was staring down at him with a depredatory glint on his clear eyes, practically screaming at Jimin to give his consent already.\nJimin got lost in his eyes, on his pale skin, on the redness of his lips and the soothing warmth of his body; he licked his own lips, suddenly hit with the fact that they had only kissed once, way back then at the ceremony day.\n“I want…” he started with a dry mouth, his fingers seeking for Jungkook’s skin under the water, brain foggy and consumed with pure lust.“I want you to kiss me.” he hissed through gritted teeth, almost angry because of the need to have those lips against his own. And Jungkook didn’t give a second to Jimin to rethink what he had just said, simply circled his waist with a possessive hand and pressed their bodies flush, lips meeting each other instantly.\nThe omega whined, pleased to be granted of his wish without having to beg for too long. His alpha’s lips felt sweet and plush against his own; like the breeze of a spring afternoon against his face.\nJimin felt compelled with just that, with the soft touch, his body shivering with pleasure and relief. He threw himself over Jungkook, arms embracing his shoulders, legs tangling themselves around his waist, diving with no regrets into his needs.\nThe alpha seemed surprised for a short moment before embracing him tightly, both arms circling the omega’s waist possessively, protectively, lips opening to deepen the kiss with a deep grunt that melted Jimin’s bones.\nJimin’s dick got caught between their stomachs, hips bucking in a frenzy ache for more, whining with pleasure at the pressure on his dick and at the feel of Jungkook’s already hard cock poking at his ass. He wasn’t experienced in the field of kissing, and taking in consideration the mess of tangled tongues in between their mouths, Jungkook wasn’t either but still it felt… close to perfection. He mewled on the alpha’s mouth, gasping when the tip of Jungkook’s dick teased at his leaking entrance.\n“Please…” he begged against Jungkook’s mouth, lips red and swollen, moist with spit. He combed Jungkook’s dark and wet hair out of his face, admiring his robust brows that were now frowning up at him, hesitation on his eyes. “Jungkook, please.”\n“Please, what?” asked roughly Jungkook, adjusting Jimin’s weight on his lap, consequently making Jimin’s own hard cock rub against their bellies and a moan to slip form his mouth, “What do you want me to do.”\nJimin whined, pressing his forehead against Jungkook’s; what he wanted, Jimin wasn’t sure. Or more likely, he wasn’t ready to admit out loud what he wanted. His omega whined and wailed inside of him, begging for Jimin to succumb to his needs, to allow his alpha to please him and give the knot he so much desired, to be marked with his scent to finally experience that sense of belonging, or with his cum as to be filled with pups. But Jimin didn’t want to; he was still terrified of this, of their bond, the sudden change in his life. Having to be so intimate with a complete stranger, forge a new life, a new family; everything was so new and foreign. If his father had warned him with more time Jimin could have spent his days coming to terms with the idea of giving himself to someone else, but everything had been sudden, like a slap on the face after taking a two hours nap.\nJimin whined again, rather desperate if he were to say so himself, and rotated his hips down against Jungkook’s crotch, his cock sliding between their bellies deliciously. Jungkook released a deep growl that resonated throughout Jimin’s body, his large hands sliding down to cup both cheeks of Jimin’s ass.\nEverything felt so good, and Jimin was losing track of reality, lusting for Jungkook more and more. The alpha nibbled under his jaw, leaving sloppy and open mouthed kisses all the way down Jimin’s neck until he reached the mark of his own teeth, sucking harshly on it and awakening the memory of the intensity of that moment. And Jimin’s sanity was lost.\n“Fuck me.” he whimpered, catching Jungkook’s earlobe with his teeth to suppress a moan after a good hip thrust made the perfect pressure on his aching cock. Jungkook’s hands hardened on his ass, pressing the omega impossibly closer to his own body.\n“Jimin…” he growled against the omega’s ear, as if in warning. Of what Jimin wasn’t sure, but he knew for a fact that Jungkook’s rough voice had made his cock twitch and his ass drip more. “Maybe we should wait—“\n“Please,” whispered Jimin, breath caught on his throat as tears started to gather on his eyes. The sudden urge to cry was a mix of his own embarrassment and Jungkook’s hesitation; because even if subtle, it had made Jimin’s omega howl in pain at the implied rejection. “I want it, please. I need you— I need you to—“\nJungkook didn’t let him finish, shutting him up with his own lips, making Jimin swallow any words he was going to say. Jungkook kissed him hungrily, tugging on Jimin’s bottom lip before giving it a soft peck as if asking forgiveness for the roughness of his previous actions. Jimin practically went limp on the alpha’s arms, allowing Jungkook to do as he pleased. The alpha’s hands were squeezing his asscheeks tightly in order to part them, rotating his hips upwards so the tip of his cock teased Jimin’s slicked hole; his mouth swallowing every little whimper that crossed Jimin’s throat with hunger.\nJimin lost against his urges, but he couldn’t find in himself to complain, not when he was being kissed fiercely and passionate, when he was in the arms of an alpha that respectfully showed how much he desired him; which shook his body entirely with a wave of relief. The alpha kissed him desperately, as if he had been holding for long enough to drive himself crazy. And Jimin could only kiss back with the same fervor, because even if he  didn’t want to admit it, it felt good. Way more than good.\nJungkook didn’t need to be told to take things a bit further, and with practiced ease slipped a finger on Jimin’s entrance all the way in. The omega shuddered, but not because of the cold, the low temperatures had been long forgotten, but because of how nice it felt to be filled by none other than his alpha once again. Without wasting more time the second one was inserted with the same expertise, fucking into Jimin harshly and fast. They had done this before countless times, Jungkook knew by now how far to take things; he had probably memorized where to touch to make Jimin moan wantonly.\n“Alpha—“ moaned Jimin, eyes tightly shut, hopelessly clinging into Jungkook’s shoulders with a brute grip, fingers digging on muscle deeper the more Jungkook thrust into him. “Please, just— fuck me.”\nJungkook growled, mouth opening wide to suck on the skin under Jimin’s jaw, fingers leaving quickly the warmth of Jimin’s ass to hold his own dick. Jimin didn’t have the time to whine for the loss because the next second he felt the tip of Jungkook’s cock poking at his entrance.\n“Are you sure?” asked Jungkook, voice rough and distraught. Jimin took a look at him and moaned at the sight; the alpha looked as distressed as he sounded, with cheeks red and pupils blown wide with lust. Jimin could have just come with that but his ass clenched empty and he knew Jungkook’s knot would feel even better than his fingers.\n“Yes.” he whispered, trying to put into the word as emotion as possible to make Jungkook understand how much he desired it. Maybe it wasn’t his rational side speaking, but it was what felt right to do, what his body was screaming at him to do. And Jimin thought that for once it would be nice to just let go and stop thinking.\nJungkook didn’t waste more time, and using Jimin’s slicked hole at his advantage, pressed firmly against the ring of muscle of the omega’s entrance, easily going in. Jimin gasped, fingers digging into the alpha’s shoulders probably really painfully, but Jungkook wasn’t complaining; or at least Jimin didn’t hear anything coming from the other’s mouth except for a growl of satisfaction.\n“You feel so good— fuck,” growled Jungkook, hands squeezing Jimin’s ass with force. Jimin whimpered, clenching his ass around Jungkook’s big cock. It hurt, Jimin had to admit that; Jungkook was big and in the frenzy for more they hadn’t stopped to prepare Jimin completely, so adjusting was becoming a difficult and painful task. Even so, Jimin wouldn’t ask for the alpha to pull out, because he felt complete, that sense of belonging he was craving was finally being fulfilled, he basked in the scent of his alpha now surrounding him from head to toe.\n“Move.” ordered Jimin after a couple minutes of trying to adjust with harsh breathing and tense muscles, trying to bury his face on Jungkook’s shoulder overwhelmed by his feelings and needs, but he didn’t allow Jimin to do so, cupping his face with one hand as to make eye contact.\n“I want to see you,” said Jungkook softly.\nIntimate. That was the word Jimin would use to describe this moment, with Jungkook’s eyes locked on his own, their bodies pressed firmly. Jimin’s chest felt warm, and it wasn’t only because of the wave of heat.\nAnd then, Jungkook moved, rolling his hips with the grace of a dancer, holding Jimin by the waist with two hands once again to hold him in place. Jimin didn’t know if Jungkook had had other partners to pleasure his needs before, but he sure moved like he had years of expertise. Or maybe it was Jimin’s burning desire that made it feel so overwhelmingly great.\nIt didn’t take much time for both of them to reach their climax, though, not with Jungkook thrusting up harshly and desperately, hands holding Jimin down to meet his hips with more urgency, grunting and moaning into each other’s mouth. Everything was so intense and passionate that even if he wanted to, Jimin knew he wouldn’t be able to make it last for long.\nWhen Jimin came, it was with a body shiver and a loud moan of Jungkook’s name, clenching around the alpha’s cock that was growing in size, stretching Jimin open until Jungkook came as well with rough grunts of pleasure, making the omega groan at the feel of his come filling him up. It felt like the world had stopped moving around them, Jimin could only feel Jungkook, his warm breath against his mouth, his hands gripping his ass, his knot holding him in place.\n“How do you feel?” asked Jungkook softly after long minutes of silence in which both of them tried to calm down their breathing. Jimin grunted in response, suddenly too tired to make the effort to talk, to which ungkook chuckled lowly on his ear, hand caressing softly up and down Jimin’s back. “That good?”\n“Don’t flatter yourself that much.” said Jimin bumping his nose playfully against Jungkook’s cheek, voice cracking. Despite the bite on his words, he couldn’t help the smile that was spreading on his mouth. Because yes, it had felt that good, not even his pride could deny it.\nJungkook pecked his neck, just under his jaw, with smiling lips. It was a display of fondness that Jimin wasn’t expecting but that made his chest warm and giddy, full of something he had never experienced before but that he found welcoming in anyways. Without thinking, he returned the gesture, leaving a soft kiss at the corner of Jungkook’s mouth, still feeling needy enough to seek for his alpha’s affections.\n“We will have to wait a little bit before going back,” pointed out Jungkook, eyes fixed on Jimin’s. “Let’s get out, though, it’s too cold in here…” And with that he rose to his feet, making sure Jimin was held safely on his embrace before stepping out of the water. The omega yelped, surprised by Jungkook’s strength, though it shouldn’t faze him. Jungkook was a young alpha full of vitality, lifting up a petite omega like Jimin was probably nothing to him.\nJungkook brought them back to their discarded clothes and sat on the floor, one piece of clothing the only thing separating his naked body from the frosty grass and mud. With Jimin’s help they covered each other with their thick furs and maintained each other warm with their close proximity. The constant movement had made Jimin uncomfortable and hiss in pain, Jungkook’s big knot stretching his ass a bit achingly, but the alpha kept caressing his sides softly, leaving trails of soft pecks at the side of his neck to calm him down; all the pain was easily forgotten and Jimin didn’t give himself the chance to think how intimate and personal this was, how much this was changing everything.\nIt wasn’t until the sun had completely set and the moon was high in the sky that they returned to the camp, fire already lit and warm food waiting for them.\nJimin couldn’t get rid of the redness of his cheeks while Jungkook’s men kept throwing knowing glances at them, but Jungkook’s hand was clasped tightly on his, and Jimin couldn’t find it on himself to step away from that comfort.\n \n \n————————\n \n \nJungkook had said of wanting to catch up with the rest of the clan, even if they were seven days ahead of them. That would entail riding through the woods even during the night with only torches as source of light, and Jimin didn’t find that exciting at all.\n“I don’t think it’s a good idea, Jungkook” tried Jimin again. Jungkook kept silent, just sitting there with his sword resting on his knee and dragging the large filing stone delicately to sharpen its edge, the flames of the fire helping illuminate his work. “It will be too dark to see where we are going at night, not to mention we need rest—“\n“Are you afraid of darkness, perhaps?” asked Jungkook, amused lilt to his voice. Jimin snorted, rolling his eyes exaggeratedly to point out how unfunny that statement had been —childish, even— but Jungkook’s grin only grew larger.\n“It’s not that,” he said, playing with the pages of the book resting on his lap with his fingernails, “I just thought there is no real need to catch up with your father and the army.”\nJungkook stopped filing his sword, keeping silent for two heartbeats before speaking again, “It’s not like we need to, but I would prefer it that way. I know father travels more happy with his two sons by his side.”\nJimin bit his lip, pondering about that answer. Jungkook was a true loyal son, everything he did was for the sake of pleasuring his father and Jimin understood to some extent even if he didn’t share the sentiment, but he couldn’t help to feel like Jungkook put his father above everything else, including himself and now Jimin, his mate. That pulled a string inside his chest that made Jimin uncomfortable with himself.\n“I just— no, never mind.” Jimin trailed off, stopping himself before voicing his thoughts. It was stupid, Jungkook would not understand. He himself didn’t really understand why he was so against it.\n“What is it?” asked Jungkook, completely forgetting about his sword, leaving the weapon to rest on its sheath above the snow, focusing all his attention on him. Jimin shook his head, trying to go back to reading his book. “I want you to be sincere with me, Jimin.”\n“I am,” he defended himself, looking up to the alpha again, “or I’m trying to.” he added when Jungkook didn’t respond, just lifted an eyebrow. “It was nothing important.”\n“It obviously is if it’s disturbing your mind.” refuted Jungkook, sly smirk on his lips. Jimin fumed slightly, annoyed the little brat seemed to know him that much.\nTwo days had passed since their time together at the river. Every time the memories crossed his mind, Jimin’s cheeks would tint red. Jungkook had taken his virginity, which would obviously happen anyways, had trailed soft kisses on his neck while they had been stuck together for so long just sitting there, completely naked; for Jimin it had felt not only his body had been bared to the world —to Jungkook—, but also his heart. And even in that situation, so vulnerable and defenseless, he felt amazing. Jungkook’s presence, his hands on his body, his soft lips on his skin, his scent enveloping him; everything had felt like a piece of heaven. That moment, while being in the other’s arms, something had changed for the omega, and Jungkook stopped feeling like an enemy anymore. The abyss that had separated them, that Jimin tried desperately for Jungkook not to cross, felt close to non existent. And the reason was simply because of the way Jungkook had held him. Jimin could see a true companion on Jungkook now, someone to confide in. It hit Jimin that the alpha was really taking care of him, just like he had promised so many days ago. That realization not only tinted Jimin’s cheeks a shade darker of red, but also gave his heart the excuse to flutter inside his chest.\n“I just think it’s more peaceful like this,” he said with one-shoulder shrug, licking his lips nervously, fingernails playing again with the corners of his book. He was getting nervous just by voicing out his thoughts, afraid of the alpha’s reaction although he knew by now Jungkook wasn't against him freely talking and sharing his thoughts. “just us… you and me— and your men, I guess… I’m— this is stupid… I just feel more comfortable like this, with just us.”\n“Alright.” said Jungkook after a second that dragged too long for Jimin’s liking.\n“What?”\n“I said alright.” confirmed Jungkook, smiling softly at the omega’s bewildered face, “Why are you so surprised I agreed?”\n“You just said your father— I thought you would like to please your father.”\nJungkook hummed in thought while dragging his body closer to Jimin, sitting now pressed tightly against the omega’s side.\n“Yes, but I also want to please you.” he said with a tint of pink on his cheeks. Jimin sported a similar red on his own, and too embarrassed to look at the alpha he focused all his attention at the snow piled up around the fire pit in front of him. It was the midst of the afternoon and the fires were already lit, coldness and darkness quickly overcoming the day as winter approached.\n“Thank you.” mumbled Jimin, still too embarrassed to look at the other. “I appreciate that you have in consideration my opinion.”\n“We will have to spend a lot of time together,” said Jungkook softly, mirth hidden under his tone because of the implication of having to be inseparable all the time, Jimin’s cheeks flushing, “I want to have a civil relationship at least— I won’t ask for you to love me, I know given the circumstances is close to impossible, but I ask for your respect and consideration. So it’s only fair of me to reciprocate.”\nLove. Such strong word.\nJimin threw a side glance at Jungkook and nodded. He could learn to swallow his pride and give what Jungkook was asking for; respect and consideration was easy to extend to someone who shared the sentiment. Be friends, at least, would be easy.\nLoving Jungkook, though, didn’t sound as frightening for Jimin as it did a month ago, but still was something he was not sure it could ever happen.\n \n \n \n————————\n \n \n \n“Can I ask what is so interesting about what you are reading?”\nJimin glanced up from his book surprised by the sudden voice so close to him to see Jaebum in front of him. The other man was looking at him with nothing but curiosity, cheeks tinted pink because of the cold. Out of all of them, Jaebum seemed the less intimidating one from Jimin’s perspective. Maybe it was because of the friendly smile always permanent on his lips.\n“Uhm, it’s a novel.” said Jimin awkwardly, straightening his back to give the other his undivided attention. He tended to curl into himself while reading, almost as if trying to fall inside the book to experience first hand the stories told.\nJaebum nodded, eyes big and sparkly, obviously interested in more. “About what exactly? War?”\n“Oh, no. Not really…” he trailed off with a forced laugh, suddenly embarrassed because of the contents of the book in his hands. “It’s more a romantic novel.”\n“Oh,” exclaimed the other, “Can I have an insight of it?”\n“Sure.” said Jimin, moving a bit to the side to make room for Jaebum to sit next to him on the wooden trunk. It was the first time someone besides Jungkook had openly approached him. He felt his heartbeat pick up its pace, nervousness suddenly spreading within him at the fact that someone was willing to involve Jimin in a conversation.\n“It’s about an alpha having to leave behind the omega he loves in order to go to war,” he started to explain. This one in particular was one of his favorites; the way the characters were so well defined, describing them with subtle depth as to not make the reader grow bored, the fluidity of the story…the book had made Jimin cry more times than he would like to admit despite having read it over a hundred of times. “It explains how hard is for the omega to live on her own when the other leaves. Since she’s an omega she struggles with a lot of difficulties to survive, only the thought of her lover coming back is what pushes her to keep going. I like this one specially because the lead role, the omega, is a really strong woman and doesn’t allow anyone nor anything stop her.”\n“Fascinating…” mumbled Jaebum in awe, “Sounds really interesting, I would love to read it as well.”\n“You can have it if you want,” offered Jimin quickly. It was a bit bewildering to himself the fact that he was trusting an unknown alpha that easily considering it took a month and a half for Jimin to be civil with Jungkook . But maybe that was the issue, the wall that he kept constructing with the pretense of protecting himself. Jaebum seemed nice, it wouldn’t be that bad to try to start a friendship, right? “I’ve read this hundreds of times, I could recite word for word, if asked to. Besides, I have plenty of books I could easily pick out of to entertain myself.”\nThey both chuckled, Jimin flushing happily at the sight of the other reciprocating his friendliness.\n“I would love to…” mumbled Jeabum while rubbing the back of his neck, suddenly shy, “but… I’ve never learned to read.”\nJimin blinked surprised, unsure of what to say now. He didn’t want to give the impression that not knowing how to read was something to feel ashamed of. Jimin didn’t think of himself any better than the other because of his knowledge. He had learned how to simply because it was the only thing his father had allowed him to do after his mother had insisted for months.\n“It’s…it’s alright,” he tried to reassure, “you can still have it, I will teach you how to read it.”\n“Would you, really?” said Jaebum, eyes big like an owl’s and smile bright like the sun, the happiness on his face made Jimin crack a smile of his own. Jaebum was indeed not a scary alpha.\n“Yes, of course.” he conceded once again, smile widening  on its own. “I would be honored to help you learn.”\nThat’s how Jimin spent the following weeks of their journey, helping the young alpha identify the differences between vowels and how to tell them apart. It was cute, Jimin concluded, the way Jaebum would mouth openly while writing down certain letters, or smile broadly when Jimin praised him for a job well done. The alpha listened to him well, nodding to his explanations and asking questions politely. It was heartwarming, the admiration the other seemed to profess whenever Jimin would read a whole paragraph before going in depth to explain everything. During those short lessons they weren’t alpha and omega, not even from two different families nor two different worlds, they were simply two men enjoying some peaceful time with a book. Jimin found himself anticipating the moment Jaebum would appear, usually before dinner while the others played around or tried to shove food on their mouths unnoticed, book in hand and quill on the other awaiting for Jimin to signal to sit next to him.\nSurprisingly, Jungkook had said nothing on the day he found them sitting a bit apart from the camp, heads almost touching and eyes focused on the sheets of paper in front of them. Although Jaebum had looked close to panicking at the sight of alpha Jeon staring at him with a serious face, Jungkook just shrugged it off. But Jimin saw the possessive glint in his eyes — besides the fact that since then he would sit nearby to watch them closely feigning to be busy doing something else.\nJimin found it amusing. Jungkook seemed to want to approach, sit with them and participate. But maybe he was trying to give Jimin space, happy to finally see him fit in with his men, even if it was only one of them.\n“Alright, read this out loud now.” said Jimin, dragging his finger through the page to show Jaebum the part he wanted him to read. Jaebum nodded, gulping harshly, making Jimin chuckle, “Don’t be nervous, we’ve practiced the first two sentences already.”\n“Yes…alright. I can do it….”\nJimin kept quiet, allowing the man to concentrate and remember how specific letters sounded together. From the corner of his eye, Jimin saw Jungkook observing them while feigning to clean his sword.\n“…Sheilen couldn’t believe her ye—“\n“—eyes—“\n“—eyes… when the man in front of her toc—“\n“—Took—“\n“—took his mask off. It was him, her love was back home.” Jabeum breathed relieved when he finished reading the paragraph, smiling broadly when Jimin praised him.\n“You are doing really good.” said Jimin patting his back, “ Now, I want you to read these two pages—“ he said while showing him the amount he was referring to, “— and mark the words that were difficult for you so tomorrow we can go over them together.”\n“Yes, sure,” said Jaebum excitedly, grabbing the book before storming away, making sure to bow to his teacher and Jungkook as well on the way.\nJimin observed amusedly as Jaebum went to his partners and excitedly showed them the book on his hands, probably bragging about his learning process, the others patting his back encouragingly with big smiles.\n“It’s really nice what you are doing for him.” said Jungkook softly. Jimin tore his eyes away from the bunch of alphas laughing at the distance to watch as Jungkook sat next to him. “I don’t think I’ve ever seen him that excited before.”\n“He is a nice student,” laughed Jimin, sending Jaebum a brief fond smile, “his excitement makes it really enjoyable for me as well.”\n“He seems to be learning quickly,” pointed out Jungkook, eyebrows slightly furrowed while inspecting his nails. Jimin suppressed his laugh at the fact that Jungkook was trying to play nonchalance. Was he jealous, maybe?\n“He is really interested in learning,” said Jimin. Jungkook lips kept pursing forward, almost in a childish pout that amused Jimin. “I appreciate that he’s so willing to pay attention to what I say.”\n“He seems really interested in you as well.” mumbled jungkook, eyes widening in surprise the second after he realized what he had said out lout.\n“Is that bad?” questioned Jimin, although he knew perfectly why the alpha had said that. He allowed himself a brief moment of satisfaction, it wasn’t everyday Jungkook would display some kind of emotion.\n“No, of course not!” said Jungkook quickly, eyes big with panic. Jimin struggled to suppress his laugh at the sight. Teasing Jungkook was fun. “I just— I meant that he— he should focus on the book instead of your face—“\n“I will make sure he focuses on the lesson, then.” mumbled Jimin with a smile. He sent Jungkook a brief glance and his smile widened at the pink dusting the alpha’s cheeks.\n“Is it that entertaining?” asked Jungkook after a while. His eyes were fixed on the tiny group of alphas starting to cut the wild boar’s meat they had hunted hours before to start preparing for dinner.\n“What, reading?”\nJungkook hummed as response, finally making eye contact with Jimin, “You are always hunched over your books, sometimes for hours.”\nJimin pursed his lips in thought while caressing the cover of the novel he was currently reading. It was another love story, filled with drama and passion; another one of his favorites.\n“Books are my escape, I guess,” explained Jimin with a small shrug, “I learned how to read when I was around six years old because it was the only activity my father would allow me to do. He wasn’t— isn’t really fond of me, to put it simply.”\n“Oh,” mumbled Jungkook. He had his eyebrows slightly furrowed, eyes big and questioning staring right back at Jimin. Probably hundred of questions flooding his brain but wasn’t sure which one to start with.\n“My father was against my complete existence since the day I was born hence why he refused to let me do anything, he used to say omegas were only worth for breeding. He got really angry when I mentioned once I wanted to learn to use the sword.” he kept saying with a sad smile. He wasn’t fond of talking about his relationship with his father, but something in Jungkook’s eyes told him that it was fine to just open about it. Jimin reasoned that if he was trying with Jaebum, why not with Jungkook? He was his mate, after all. And Jungkook had asked for it, had told Jimin to be sincere and show respect to each other. “I would sit in a corner and watch the other kids at the mansion do a diversity of things. I guess my mother took pity on me and asked father to let me at least learn how to read. Somehow, she convinced him that reading would mold me into a more educated person so I wouldn’t put the family in shame in public appearances.”\nJimin paused to lick his lips nervously. There was a knot forming on his throat that angered him. Still, after so many years, the fact that his father loathed his existence that much pained him.\n“My mother sought the best teacher she could find and since then my days were spent at the library, book in one hand, quill on the other. If not reading, I would be writing.”\n“It was nice of her.” mumbled Jungkook with an angered expression. It seemed Jungkook didn’t know what to say to that and honestly, Jimin couldn’t blame him. It was the opposite to Jungkook’s relationship with his family; as far as Jimin had been able to witness of their interactions, the head of clan Jeon seemed to dote on his two sons equally and with fondness in every gesture. Although Jimin questioned if that was because both of them were alpha. \"I'm glad to hear you found something to entertain yourself with and that, obviously, you enjoy a lot.\"\nJimin hummed, eyes downcast fixed on the book in his lap. “My mother was the one who introduced me into the novel world. Reading was my only source of comfort and my only distraction.” he said with a nostalgic smile, remembering those days years ago spent sitting around in a different corner of the castle each day with the only company of words scribbled in the form of beautiful stories. “Although I would say reading that much romanticism made me into sappy idiot I am today.”\nJungkook chuckled slightly at his attempt at a joke. There was so much more he wanted to say, it was evident by the way he was staring at Jimin, but decided not to and simply smiled softly at him.\n“I’m not that fond of reading, honestly,” said Jungkook, changing a bit the direction of their conversation, “my father did not forbid me of doing so, but fighting and sword technic were more important for me as a child. As you said, we take big pride in our fighting—“ he said with a teasing smirk, making Jimin blush because of his harsh words so many weeks ago, “—literature was not even the last thing on my list. As a toddler I used to sit around the field watching the army train and anticipating the day I would be old enough to brandish my first sword. ”\nJungkook took a sword from his belt. It wasn’t the usual one he had hanging on his hip, this one was smaller, kept inside a black and silver sheath with some scratches here and there, evidencing its old age.\n“This was my first sword,” said Jungkook, taking it out of its scabbard in a swift motion. Jimin stared at it with awe; short but sturdy, it glistened prettily with the light that came from the fire pit. “Father gave it to me as a present when I turned six years old, right before he left to negotiate some alliances with other clans.”\n“It’s really pretty.” mumbled Jimin. He took his eyes off the weapon and saw the fondness in Jungkook’s eyes while inspecting the sword on his hand, the genuine and soft smile on his lips and felt his own mimic Jungkook’s.\n“My brother trained me while father was away, and also gave me my first scar.” smiled Jungkook, pointing with his finger the mark on his left cheek.\n“It makes you look intimidating,” said Jimin airily before he could think twice his words but the smile that Jungkook gave him in return told him he took it as a compliment.\n\"I cried like a baby,\" explained Jungkook with a wide grin, obviously remembering the day with fondness, \"I had blood all over my face and my brother panicked. My mother found us both crying later on, sitting on the field and hugging each other. Such a mess...\" he clucked his tongue playfully with a short jerk of his head, obviously embarrassed but also lovingly remembering the moment.\nThey stopped talking after that, smiles lingering on their lips. The silence wasn’t unpleasant, quite the contrary; Jimin found himself enjoying the company of the alpha. Jimin had started to treasure little moments like this in which they seemed to forget the differences that  separated them; after sharing some intimate memories it seemed the gap between them had closed even more, and Jimin valued the fact that Jungkook was opening to him, it gave the omega the chance to learn more about the other, change the image he had of him.\nSuddenly an urge to be closer and know more about the alpha pulled a string on his chest, a wave of longing overtaking all his senses.\n“Would you teach me?” asked Jimin suddenly, disturbing the peaceful quietness that fell upon them.\n“What are you referring to?” questioned Jungkook, eyebrow lifting with curiosity.\n“Sword fighting,” clarified Jimin before licking his lip nervously, “I’ve always wanted to and now that father is not around… maybe…” he trailed off, feeling stupid as the words came out his mouth. Sure Jungkook was nice and listened to Jimin, but that didn’t entail the alpha would be willing to waste time with a weak omega. “It’s alright if you don’t want to, I understand—“\n“Sure.” said Jungkook, only sincerity gracing his tone.\n“Really?” asked Jimin bewildered, smile already spreading on his face.\n“I don’t see a reason not to…” shrugged off Jungkook, a smile of his own on his lips as well, “A lot of our omegas know how to fight, and if you are willing to learn I don’t see why you can not. Besides, it’s not really my place to forbid you of doing so.”\n“Thank you…” Jimin felt his heart quickening its heartbeat, a strong wave of happiness hitting him.\n“But—“ added Jungkook, lifting his point finger to Jimin, “I want something in exchange.”\n“Uhm, sure,” agreed Jimin quickly. Maybe too quickly, considering the mischievous smirk that spread on Jungkook’s lips. Jimin gulped nervously, “What? What is it?”\n“You have to teach me literature.” said Jungkook with a hopeful air on his face, “It’s my only condition.”\nJimin smiled, offering his hand for Jungkook to take in a handshake, “Deal.”\n \n \n————————\n \n \n \nThey were approaching Telain. Jungkook told him it would take two to three weeks more before they would cross the invisible line that marked the outskirts of the country.\nJimin was torn between feeling thrilled and scared; For one part he was jumping into unknown territory, surrounded by strangers that would turn into their only company for the years to come. For the other part, Jimin was anticipating reaching Telain, see with his own two eyes how the people there lived, learn new things, see new landscapes. Somehow the mountains covered with snow and the cold air wasn’t that unpleasant to Jimin anymore. Sure he would miss a lot the warm breeze of spring from Erigon, but the cold had given him reasons to cuddle under thick blankets and press himself closer to Jungkook’s warm body and, honestly, that wasn’t so bad.\nOver the following week since they had made their deal they had grown accustomed to spend way more time together. They took any chance to learn from each other: the first hours in the morning while the others prepared to depart, every time the group stopped to rest within the day or before going to bed. Jungkook was a good student, listened to Jimin with the same attention and fervor that Jaebum did, but his eagerness was as passionate as his competitiveness. Only before dinner Jimin would sit between the two alphas together and sometimes Jimin regretted so.\nJimin wasn’t sure how it began, but at some point Jungkook had started to seek loudly for his attention, practically absorbing Jimin’s full time by asking questions while he was trying to resolve any doubts Jaebum had, glaring at the other when Jimin would ignore his calls. Other times he would try to outdo himself, try to learn ahead of what Jimin explained and smiling smugly at the other alpha whenever Jimin praised him for his good job; It was cute to see him so greedy for knowledge, but it seemed he only did it to prove how good he was. In moments like these, Jimin was reminded that Jungkook was a pure alpha, always proving himself and full of pride. At the silent hours of the middle of the night  with Jungkook snoring softly at his side, the thought that Jungkook did it because he was jealous or because he wanted Jimin’s attention filled his brain and, truthfully, Jimin let himself indulge in that. Maybe he was being delusional, but those thoughts would always make him blush pleasantly and snuggle into the alpha’s chest.\nFor the other part, Jungkook was a rigorous teacher, he gave Jimin no mercy.\nJimin had been as eager to start his lessons as Jungkook did, but after the first day he felt like he regretted mentioning it in the first place. The muscles of his legs throbbed every time he had to stay still at correct stand, his arms were sore because of all the movement and having to hold the weight of the sword. He had tried to cry his way out of it, whimpering with a pout in an attempt to make Jungkook take pity on him, but for every little whine that crossed his lips the alpha made him go through the same routine three more times. Jimin stopped trying on the first day.\nJimin was thankful, though, because after the nightmare that had been the first week he had started to notice changes within him and that only happened because Jungkook had not given up on him.\nThe second week of training wasn’t so bad and Jungkook seemed pleased with his progress if his satisfied smile was anything to go by. Jimin rejoiced in the pride his alpha reeked at seeing him train although he himself wasn’t that sure he was actually mastering the art of sword fighting.\n“Again.” said Jungkook, voice harsh and eyebrows furrowed. Jimin sighed, whipping away with the back of his hand the droplet of sweat falling from his forehead.\nJimin parted his legs to get to the correct stance, tightening both his hands around the silver grip and after counting down to three he put all his weight on the foot at the front, twirling as he brandished his arms forward, trying to mimic the movement Jungkook had shown him before.\nJungkook sighed, exasperated, and moved to stand behind Jimin, embracing the omega’s torso to get a hold of his hands.\n“Your posture is wrong,” said Jungkook right to Jimin’s ear, hot breath tickling the omega and used his foot to help Jimin reposition his feet. Jimin forced himself to focus on what Jungkook was teaching him and not at how firm his chest felt against his back or how big were his arms around him. “Part your legs less, the bottom of the hilt should be close to your hip before moving—“\nJungkook moved Jimin around to show the correct moves, and despite the firm hold on his hands the way he explained was tender and delicate.\n“Try again.” said Jungkook finally separating himself from Jimin, who breathed relieved.\nJimin stood in what he thought was the correct posture and nervously swirled his body and then paused, remaining in the attacking posture for a long second before going back to stance as to repeat the same movement three more times waiting for Jungkook’s judgement.\n“Better.” said the alpha and Jimin finally relaxed but the beads of sweat fell down his back anyways, remains of the warmth of Jungkook’s body against his own aggravating the heat on his cheeks. “I think we should stop here for today, you need rest.”\nJimin nodded, offering a tired and thankful smile while lifting his arm towards the other to give back his sword. It was about the same size of Jungkook’s old sword; smaller and thinner compared to other ones but that helped Jimin train with ease considering his lack of strength and petite frame.\n“You should keep it.” said Jungkook with a short shake of his head at the offered weapon, “You have proved yourself worthy of owning it.”\nJimin stared at him, mouth hanging open and eyes wide in disbelief. Albeit he had been trying his hardest to improve he hadn’t thought he was managing to progress significantly. Hearing such words of praise from a master like Jungkook made his chest swell with pride and happiness.\nJimin ate in silence and cuddled into his cloak as the others around him spoke and laughed loudly, still feeling giddy because of the events of that late afternoon. His blush had appeared once the words were assimilated and hadn’t disappeared since then; his brain repeating over a hundreds of times the scene in his head, paying attention to the little details such as Jungkook’s proud smile and eyes full of fondness.\nWhen the guys took out the bottle containing alcohol Jimin excused himself to the tent. He wasn’t one to enjoy drinking and sitting to watch them get tipsy wasn’t as fun as one would think. Besides, Jungkook had been pressed too close to him for the whole dinner and his scent and warm eyes put Jimin on edge.\nWith a fluttering heart and a blush on his cheeks Jimin took out his robes, only leaving his undershirt to cover his body; it was thin and only reached his upper thighs but he wouldn’t need any other layer to help him with the cold, Jungkook was warm enough.\nJimin sighed dreamily at the thought of Jungkook, his heart hadn’t stopped its fluttering, spreading warmth all over his body and making his ears flush red embarrassingly.\nOh, how the tables had turned, thought Jimin. He felt attracted to Jungkook, there was no way he could keep denying it even if he tried with all his core. It wasn’t just his omega side pulled by their bond seeking for his alpha, Jimin himself felt attracted to Jungkook. The past two weeks had helped Jimin realize that not only was Jungkook handsome but was soft at heart too, patient with him whenever he would slip or do a wrong move while training, those slightly pouty lips curving up in a sweet smile. Jimin was able to see everything good that Jungkook had to offer after he had dimmed down his guard, allowing Jungkook to finally break in through his walls. And honestly, it wasn't as bad as he had thought.\nHis eyes travelled to the floor to the small sword resting beside his discarded boots and the smile on his face widened without consent.\n“Are you alright?” came Jungkook’s voice from behind him, making Jimin jump in surprise at the unexpected appearance.\n“Yes,” he said quickly while turning around, maybe a bit too quickly to not sound guilty. He blushed again upon seeing Jungkook’s eyes roam without any discretion from his exposed legs all the way up to his face.\n“Why were you standing there, then?” questioned the alpha while getting rid of his own cape. Jimin’s body sprung to life once the alpha's scent finally flooded through the small tent, blood rushing everywhere because of the lustful stare Jungkook was sending his way, awakening sparks of desire within him.\n“Just…thinking.” he trailed off, observing attentively as Jungkook undressed for the night.\nThe alpha did not say anything else, just hummed as response and decided to go to sit on the bed but his eyes never looked away from Jimin.\n“Thank you for today,” mumbled Jimin with a hoarse voice that surprised even him. Jungkook’s intense gaze was riling him up, that much was evident, but his arousal was not one sided; Jimin could tell by the way Jungkook’s breathing was a bit ragged and the stare he was sending his way he was also feeling it.\n“I like teaching you,” replied Jungkook laying back to rest on his elbow as to be able to still watch Jimin, the muscles of his torso flexing and on full display for the other to admire. The omega squirmed, feeling himself get wet at the sight, Jungkook’s lap looked so alluring suddenly, his skin sweeter than any candy he could ever taste. “You are a good student.”\nJimin decided to stop thinking, stop beating himself over something that was obvious and could not fight against; he should forget about his prudence and hesitation when his body screamed without any ounce of regret what it wanted. Without pondering over it for another heatbeat he took two big strides and climbed on Jungkook’s lap, who immediately went stiff and sat up, hands hovering over Jimin’s hips, close to touching but not daring to.\n“What are you doing?” asked Jungkook no more louder than a whisper but with an instance of urgency on his voice, obviously not expecting the sudden closeness.\n“Thanking you for today's lesson.” answered Jimin before licking his lips, observing with amusement how Jungkook’s eyes followed the motion closely with hunger.\n“You already did.” said back Jungkook swiftly, eyes going up to fix on Jimin’s own. The omega shuddered, aroused because of the depredatory glint sparkling in Jungkook’s beautiful blue eyes.\nJimin circled his arms around Jungkook’s shoulders and spread his thighs wider to accommodate himself better, which made his asscheeks press directly with the bulge growing inside Jungkook’s undergarments.\n“Words are not enough to express my gratitude.” purred Jimin with a playful tilt of his head. He was surprised by his own advances, displaying his seductive side was something he was not used to. He had never been in such position, everything was new to him, but he sure enjoyed discovering this side of him in the presence of Jungkook, who seemed as delighted as the omega.\n“You don’t have to.” whispered Jungkook, slightly leaning forward until their noses bumped softly.\n“But I want to.” breathed out Jimin, nudging softly Jungkook’s nose. He kept his eyes glued to Jungkook’s, wishing his eagerness was evident enough on his eyes for Jungkook to finally succumb and kiss him.\nThey had not touched each other since that time at the river. It had been basically the last day of the omegas’s heat and Jimin missed the touch of Jungkook’s hands and the softness of his lips. And although they had been more comfortable with physical contact Jimin was too shy to ask for something more, or take the initiative in those days he felt aroused but he had no heat to blame for it. Until now.\n“You sure?” asked Jungkook and Jimin nudged at his nose again as response, lips almost touching with the motion, while tightening his thighs around Jungkook’s hips to press his hardening cock against the alpha’s belly. Jungkook groaned, squeezing Jimin’s hips to hold him in place as his mouth finally closed around Jimin’s.\nTheir kisses, the few they had shared so far, were always fiery and urgent probably due to the constant tension between them. Jimin concluded that the only way to resolve this would be to do this more often in order to tamer down a bit such fervent passion. The idea made Jimin laugh inwardly, amused he was seeking for excuses to touch or kiss Jungkook although they were mated and obviously wouldn't have the need to. Jimin just needed to stop refraining himself.\nJungkook’s hands rolled up Jimin’s undershirt before cupping his now bared ass, kneading with urgency and pressing their bodies impossibly closer. Jimin whimpered, opening his mouth to let the other deepen the kiss, arms circling tigthly Jungkook’s shoulders, fingers digging into muscle. The alpha thrust up experimentally, releasing a low groan when his clothed dick bumped into Jimin’s ass. And the omega pressed down, grinding softly against it and putting the perfect amount of pressure if the moan that slipped through Jungkook’s lips was any indication of it.\n“Your ass is perfect,” mumbled Jungkook against Jimin’s mouth in between kisses, now squeezing with more force to prove his point, “so meaty and soft— fuck. All juicy for me.”\nJimin moaned at the praise, pressing down even more to grind on Jungkook’s cock, fully hard and leaking by now; although the wet spot covering the alpha’s undergarments could be also from the excessive wetness slipping from Jimin’s hole. It took no time for Jungkook to slip his fingers inside Jimin, one hand parting one of his cheeks while the other fucked relentlessly into him, eliciting wanton moans to fall from Jimin’s mouth. He was fighting to keep his voice quiet, fully aware by the fact that they were obviously not alone, just some meters separating them from the fire and other alphas and a few omegas, but Jungkook had decided not to stop now that they had initiated this and easily got Jimin whimpering and greedy for more. Not that Jimin was really against it, though.\nAt some point they had turned around, and Jimin parted his legs wider for the alpha to accommodate better, torn between thrusting up as to gain more friction for his aching cock or down and fuck himself deeper on Jungkook’s fingers, but still moaning with pleasure unabashedly. All the while Jungkook’s other hand roamed around his body, sometimes to squeeze his thigh, other times to play with a nipple or simply caress up and down Jimin’s side, awakening  goosebumps to run all over his body. The alpha’s hands were huge and sturdy, felt strong against the softness of Jimin’s skin but never in an unpleasant way; They were the ignition of the fire spreading inside Jimin.\n“Jungkook— please—“ he moaned, mustering the courage to nudge Jungkook back and plead not only with his voice but also with his eyes. It seemed to work, Jimin was starting to notice Jungkook was easy to lure in with just a pout or a pair of pleading eyes.\n“Hold on,” whispered Jungkook, and without any other advice he moved away from the omega. Jimin blinked surprised because of the sudden separation and observed as Jungkook crawled to blow off the lantern illuminating the tent, darkness enveloping them quickly. Jimin blushed even more, now aware that not only were they probably being heard but also seen through the shadows projected on the walls of the tent because of the light.\nJungkook quickly came back, repositioning himself between Jimin’s legs, hands making their way fast to trace patterns on them with delicacy, all the way up from Jimin’s bended knees to his hips to roll his undershirt even higher to expose all his torso.\nJungkook leant all the way down and dropped a kiss just under Jimin’s bellybutton, sucking lightly before laving his tongues over the same spot. The omega gasped with satisfaction, parting his legs even more as his hole released another bead of slick, silently asking for more. Which Jungkook complied gladly, because he kept leaving wet kisses all over the expanse of Jimin’s navel as his hands parted his ass, rubbing the already stretched hole with his thumb, teasing, just to make Jimin whimper even more.\n“Jungkook—“ Jimin gasped, hands going to tangle on Jungkook’s dark hair and tug as the alpha sucked a bit more roughly right where his thigh started. The alpha groaned against his skin, scratching softly with his teeth the meat before leaving another open mouthed kiss for later sit back again, ready to give Jimin exactly what he wanted.\nThe slide in was easy, easier than the last time, maybe because Jimin wasn’t as nervous as he had been his first time and was actually anticipating it greedily, and Jungkook didn’t need for Jimin to ask for more, he went hard and fast since the moment Jimin had moaned pleased at the intrusion, releasing a low groan on its own that left the omega shaking on his bones.\nHips thrusting in hard, mouths kissing roughly, fingers digging into skin; it was passionate and all ways of perfection, and everything they needed to reach their climax, pure ecstasy running through their bodies.\nJimin was trembling from the strong orgasm, breathing hard and heart beating like mad but more than pleased. He closed his eyes enjoying the bliss, his fingers caressing all the way down from Jungkook’s shoulders to the small of his back, rejoicing in the scent of his mate enveloping him fully.\n“Don’t go,” he mumbled with a broken voice when Jungkook regained strength enough to start to stand away, pulling him in with more force against his body. He felt the most vulnerable and exposed after sex, maybe due to his own insecurities and the fear of being neglected by the alpha after sharing such intimate moment, but Jungkook’s scent and soft skin always managed to calm him down, vanish that fear. “please, let’s stay like this... just for a while.”\n“Alright.” whispered Jungkook, nuzzling Jimin’s neck while repositioning himself better as to not crush the omega with his weight.\nJimin closed his eyes again, his hand cradling softly Jungkook’s sweaty hair, breathing in the sweet smell of their scents together the lullaby that pulled him into dreamland.\n \n \n————————\n \n \n \nThere was something unsettling in the air, Jimin could feel it. The wind that afternoon was colder than it had been before but the chills running down Jimin’s back weren’t because of that.\nHe stopped reading when the churning in his stomach became too much to ignore and decided to distract himself by visiting Asmund.\nHe hooked his book under his cloak, buried his nose on the furry collar and watched his boots scrunch the snow underneath; the afternoon was tranquil, the snowstorm finally ceasing enough for Jungkook to venture to go hunting with some others. He glanced around him, observing their little camp, the few men Jungkook left behind when he went out hunting didn’t pay him much attention since they were distracted with their own things; those being polishing their swords, cleaning their armors, lighting the fires for the night or whatever the task that they doted important. Jaebum was also out with Jungkook, so Jimin really had no other distraction to ease away the odd feeling sneaking into his bones.\nJimin was starting to feel more at ease surrounded by them, as if he was already starting to find his place in the world. Maybe it was because Jaebum looked rather genuine about wanting to learn from him how to read and write, not even bothered by their differences; maybe it was because Jungkook had started to teach him to use a sword, giving Jimin the self confidence and independence that came with knowing how to defend himself. Maybe it was because Jimin had actually started trying to open up instead of closing into himself, surrounded by thick an impenetrable walls. Whatever was the reason, Jimin felt content.\nWhen he reached Asmund, the steed huffed loudly at his presence; at first glance it seemed the beast was happy to see him but then he noticed Asmund had his ears pointing up, tail flicking nervously from side to side, stepping on the snow with his hoof rather angrily. He looked anxious.\n“What’s upsetting you boy?” he asked, rubbing softly his muzzle trying to calm him down, but Asmund jerked away from his hand with a shriek and that made Jimin frown.\nHe had never seen him so agitated before, but before he could dwell on the matter any further someone screamed behind him.\nWhen he turned around his mouth opened in horror at the sight of one of the tents burning with passion, Jinwoo screaming like a mad man for someone to help him extinguish the fire while throwing snow to try to tamer down the quickly-spreading flames.\nAsmund shrieked again, standing on his two hinder legs and consequently scaring Jimin but he had no time to appease the beast because then, from the farthest trees that formed the woods, he saw them.\nJimin quickly tried to count the huge group of men shouting and running with swords on their hands and masks covering their faces, but it was a large group. Robbers, his brain supplied, and his heart picked up its peace quickly, sudden rush of adrenaline shaking up his whole body.\nHe drew out the small sword Jungkook had given him, trying to recall the tips and advice the alpha had tried to teach him when faced with an opponent, but one thing was imagining someone attacking him and another completely different one see a man twice his size with ravenous eyes making his way towards him, sword swung up in the air and ready to cut his head off.\nHe reacted out of instinct and blocked the first hit, a clinking sound resonating loudly when the metal collided, but his opponent didn’t give him a moment to think and surged forward for another try, this time going for his legs. Jimin, luckily, managed to dodge again, groaning with frustration because of the other’s insistence. Of course the other wouldn’t let him recover, he was trying to kill him, and considering how Jimin tripped with his own feet while trying to recoil from the brute force of the other's hits it wouldn’t get much more for the robber to manage to do it.\nIn their little dance of measuring each other they managed to get away from the horses; Jimin had seen Asmund anxiously watching them, torn between defending him or running away. In the end the animal did nothing, mostly because his reins were tied to a tree, and Jimin was glad for that, hoping at least he could save his life.\nHe could hear screams and metal clinking coming from somewhere near, but he couldn’t allow himself to get distracted, afraid it would take less than a second for the man’s sword to slice his throat open. Out of panic, Jimin swung his sword up when the other went for another lower attack and managed to slice his cheek through the mask covering half his face, blood sprouting out the wound quickly. The man screamed and covered his bleeding face with his free hand and Jimin used the little distraction to quick his hand with his boot, successfully sending away his opponent’s weapon.\n“I’m going to cut your neck and watch you choke on your own blood, pretty boy,” snarled the man with venom in his voice. Jimin shivered with fear; the way the man’s eyes glinted dangerously told Jimin he would do just that if he managed to get him. But Jimin was armed and that gave him a slight advantage were he quick enough to brandish his sword. Right?\nSo he did just that; he lunged forward with a yell of determination falling from his mouth, sword aimed at the other’s stomach but the robber had surely anticipated it, mostly due to his experience, and grabbed his wrist, forcefully twisting his arm and making Jimin scream with pain until he released the hold on his sword and fell to his knees.\n“You are not so brave anymore, huh?” the robber said smugly and to make himself feel more superior kicked Jimin on the stomach with his foot, successfully knocking the air out of the omega’s lungs. But the man didn’t stop there, even added a punch to his face that managed to split his bottom lip open and make him scream with pain.\nThe blow had been strong, he had never been hit before aside from a reprimanding slap on the cheek form his father when he managed to anger him too much. And although those slaps had hurt a lot back then, they couldn’t compare to the pain on his jaw and stomach right now. It left him a bit dizzy, eyes tickling with tears and tongue tasting blood.\nHe was going to die.\nIt was unfair, he decided then; after everything he had to face the past months it was not fair he was going to die like this now that everything was starting to fit in, abused and kicked to death by some sad soul that only wanted the money they were carrying along or simply for the thrill of killing.\nJimin spat the blood accumulated on his mouth when the irony taste made him feel nauseous, the red contrasting alarmingly against the white snow, and when his assaulter pushed him to the floor he just allowed it to happen, too numb by the hit he had received to try to defend himself. He fell face first, making him close his eyes when the frost of the snow hit his cheek, and laid there awaiting for the final blow that would put everything into darkness. He thought about his brother’s crestfallen expression, the tear-stained face of his mother when they would inform her that her son had died so cruelly in hands of a robber. He even thought of Jungkook; would he cry at the sight of his cold and bloodless body on the snow?\nThe man fisted his hair in a painful grab, pulling until Jimin’s neck was twisted up and his back arched up. He felt him straddle his hips, knees caging his small form and then the cold metal of a knife was placed on his neck.\n“Ah, it’s a shame, really,” he mumbled lowly on his ear, even chuckling darkly, “such beauty going to waste...maybe I should have some fun before killing you.”\nJimin released a sob, rather pathetically sounding to his own ears but he wasn’t going to beg for his life; he wasn’t going to grant such satisfaction to that bastard.\nBut then, both the man’s grip and the knife on his neck disappeared, a loud groan of pain the only trace left of his presence at Jimin’s back. He fell forward, face hitting the snow again, breathing relieved for a moment before turning his face to the side to watch in time Jungkook go through the man’s chest with his sword before pushing his limp body back, eyes full of rage but chin held up high in satisfaction as the robber’s own eyes faded away into death.\nThe next moment Jimin was being hauled up by Jungkook’s strong arms. The omega was a bit out of it, staring blankly at Jungkook’s worried expression and deaf to his voice, still processing he had been close to death barely a minute ago. And when it finally sunk in that Jungkook had prevented it from happening he threw himself into the alpha’s body, embracing him tightly and burying his nose on Jungkook’s neck, breathing in that strong scent he had grown accustomed to, feeling his body relax by having his alpha around, his strong arms, his protection.\nJimin didn’t even notice he had started crying, sobbing loudly against Jungkook’s neck, he just recalled Jungkook’s arms embracing his torso and pressing him tightly against him, rubbing his cheek on Jimin’s hair with urgency. Jungkook was scenting him, enveloping the omega with comfort, with love. Or at least is how Jimin felt it like.\n“You are safe, I’m here now.” mumbled Jungkook against his hair, “You did well Jimin.”\nJimin didn’t break apart from Jungkook, even when they decided to move and settle for the night in another place, leaving behind corpses that would be eaten by the wolves that hid in the mountains.\nAnd Jungkook didn’t let go of him either, his warm hands on Jimin the whole time. It was another consecutive night since they were together that they went to sleep with limbs tangled and noses buried in each other’s skin purposely.\n \n \nJimin was startled awake by a pain on his navel, unrelenting and violent. He groaned at the nausea creeping up its way through his throat, his heart beating madly inside his chest, not even Jungkook’s comforting scent was helping him relax.\nHe could only think about how much it hurt.\nWhat was hurting, he wasn’t that sure. His stomach was upset, that much he could tell, but the pain came from somewhere lower, past his belly button. He had never felt a pain like this before, so intense and with so much rage.\nHe mustered enough courage to separate himself from Jungkook, immediately regretting stepping away from his only source of warmth in such a cold night, but stood up regardless. He reasoned that maybe drinking some water could help; maybe it would make him throw up and once for all settle down his upset stomach.\nAfter putting on his boots and safely wrapping himself with his cloak he stepped outside the tent, teeth clattering because of the cold. Snow had fallen aggressively when they settled again for the night and Jimin’s mind reeled back to the events of that day, imagining the corpses left behind getting frozen by the low temperatures, nausea gushing up his throat again.\nHe had been so close to being one of those, if Jungkook had not managed to arrive in time.\nAnother wave of pain doubled him over, rooting him to place just some steps away from the few men sitting around the dimly light fire. His breathing was ragged, difficult because of how the pain was consuming his body. He put a hand above his belly and pressed lightly experimentally, which was a bad move because the second after he was releasing a broken whine of pain with some tears rolling down his cheeks.\nAnd he fell, legs becoming weak quickly, knees meeting first the soft snow with a loud groan of pain leaving his mouth.\n“Sir? Are you alright?” someone asked alarmed, a warm hand on his back. He hadn’t even noticed someone had approached.\n“Hurts.” he croaked out weakly through a sob, the pain making him curl on himself as his whole body shook.\n“We need medical help!” another voice said and Jimin whimpered when another wave of pain struck his body. It was too intense for him to handle, he couldn’t even breath properly, his whole body shaking with fear of the unknown, coldness and pain. So much pain.\nAnd before everything went into darkness he thought he felt Jungkook’s arms catching him.\n \n \nWhen Jungkook finally entered the tent Jimin’s immediate response was to lower his eyes. He felt embarrassed, still hurting, his heart swollen with sorrow.\nJungkook didn’t say anything, stood there at first simply observing him, as if hesitating to approach where Jimin had been laid down to rest for the whole day.\n“How do you feel?” he asked softly, finally breaking the tense silence. Jimin sniffed while burying himself deeper into the blankets, seeking comfort.\n“Weak.” he answered truthfully after pondering about it for a couple of seconds. His voice broke and his lips wobbled while mumbling the word; he was aware his face screamed exactly how he felt and that brought more shame to his being.\nHe heard Jungkook sigh before closing the little space between them and sit next to him, “Do you need anything?”\n“No.”\nJimin closed his eyes, the knot forming quickly on his throat. He couldn’t bare to look at Jungkook. He did feel weak, but not only because of what his body had been through the past hours; it was mental drain, pure guilt consuming his body.\n“Jim—“\n“I’m sorry,” he chocked out, afraid of what Jungkook had to say about the matter. “I didn’t know— I swear, If I had known I would have been more careful— I— I’m so sorry—“ He started blabbering through tears, body shaking with the force of his sobs. He was too tired to try to hold them back.\n“Jimin,” called Jungkook, moving away the blankets the omega’s was trying to cover his face with while dragging himself closer, trying desperately to have Jimin look at him. But the omega was repeating a plethora of I’m sorrys brokenly, refusing to comply.\nJungkook finally pried his hands away from his face, having to use a bit more of strength to pin Jimin down to bed, holding his wrist firmly but with delicacy at the same time; like Jungkook always tended to do.\n“Stop this.” he mumbled. Jimin, having his eyes closed, felt the alpha’s breath on his face, and tensed slightly at their proximity. Jimin was really scared of what would be the other’s reaction.\n“But—“\n“No.” cut Jungkook, voice tender, “Look at me, please.”\nJimin had to open his eyes. Jungkook had asked with such distress in his voice that Jimin couldn’t refuse him of that. He saw pain on Jungkook’s beautiful blue eyes, and he felt horrible for putting the alpha through this; Jungkook was saddened and probably mad at Jimin for not being careful with their pup.\nBecause even if he didn’t want to admit it, Jimin knew his only purpose was giving birth. His father had been reminding him of what his existence truly meant for his whole life and, even if his mother had denied it with fervor, Jimin couldn’t help but believe those words in the end. Irrefutable evidence of it had been this arranged marriage; his role on this union was to make sure his alpha was happy and willing to fuck him in order to bring to life pups that would enforce the alliance between their two families, for the prosperity of their country. And Jimin had managed to falter so early on it. He was a failure, and he couldn’t help but think that Jungkook had been let down. Heck, even Jeon Asger would look at Jimin with disdain once he would be informed about the incident. Just like Jimin’s own father.\nSurely another name to add on the list of people Jimin had managed to disappoint.\n“It’s not your fault,” Jungkook spoke softly once he got Jimin’s attention, “things like these happen all the time. You aren’t the first omega to suffer a miscarriage—” Jimin cringed at the word, “— your body is exhausted because of the traveling and the cold…”\n“I should have been more careful.” Jimin tried again, tears falling from his eyes, refusing to believe Jungkook wasn’t mad at him for not taking better care of their baby, even if Jimin himself hadn’t know such baby existed until then. “That bastard hit me on my stomach…If I had run instead of fighting back maybe now— maybe—“ he chocked out, not being able finish as he started to sob again.\nJimin always prided for managing to control his emotions rather well; life taught him to guard composure, because omegas were seen as weak enough already, tears only gained him more pitiful stares. But the embarrassment and pain was too much to try to hold inside of him. “I’ve— I have failed you too.”\n“Jimin, saving your life was priority,” said Jungkook with determination, leaning closer to him even more to the point their foreheads were touching. The alpha had leant down and laid besides him, pressed firmly to provide warmth to Jimin’s feeble body. It comforted him, obviously, Jungkook’s scent and lack of rejection after what had happened felt like a little sparkle of light, of hope. “We don’t know what could have happened in any case. But one thing I can say for sure is that I prefer you here alive with me now, than having to cry for losing both you and the baby.”\nJimin sniffled, face scrunching up in pain at the mention of their baby; Jungkook seemed genuine with his words, and Jimin allowed them to alleviate a bit the guilt consuming his body.\n“You have not failed me,” he continued after a bit of silence, voice tight as if it was being difficult for Jungkook to hold back his tears. “I’m proud of you for defending yourself and being so strong. You fought back and saved your life and it was all your doing.”\nJimin sniffed again as more tears fell from his eyes. That was a lie, Jungkook had been the one who saved him; Jimin had been hit and forced to the floor, nearing death if not because Jungkook intervened. He was weak regardless of what the alpha said. Guilt and shame were the only emotions consuming his feeble body.\n“Look, I know birthing pups is what you were told to do but it’s not the only reason you exist, your father lied to you.\" he spat furiously, \"It will happen eventually but it’s not our priority.” added Jungkook due to Jimin’s lack of response. His face was contorted with anxiety, and Jimin felt worse. He wasn’t sure why he was refusing to believe Jungkook’s words of comfort when they were said with such sincerity.  “I’m the one who has failed you for making you think that your only value to me is your fertility.”\nJimin released another sob, overwhelmed because of all the emotions he was feeling at the same time. He was aware of how close they had grown to each other, the friendly aura, the teasing, the lingering stares, but he would never have thought that the alpha thought the same as him; that this union between them had stopped being just formalities between them.\nJimin released a shuddering breath and finally relaxed his body, allowing Jungkook to hug him, drag him close to his chest where he could hear and feel his heartbeat.\n“We will have more time to bring pups to this world,” mumbled Jungkook against the crown of Jimin’s blonde hair, “But for now I’m happy with you being here with me, safe and healthy. I don’t need anything else.”\nJimin closed his eyes, succumbing to the exhaustion and melting against the alpha’s body, deciding to believe those words with no complain for now, feeling more than safe in Jungkook’s embrace.\nBefore he drifted off to sleep his lips curled slightly upwards on their own accord when he felt Jungkook press a soft kiss on his hair, not caring at all if it had just been his imagination.\n \n \n \n————————\n \n \n \nIt took four days for Jimin to feel strong enough to move. He spent the first two crying and curling on himself, barely eating if not because Jungook had forced food into his mouth, scolding him with no much bite on his tone; it was worry if nothing else.\nThe alpha kept repeating the same words over and over again every time Jimin hinted, even if just lightly, to feel guilty about what had happened until Jimin started to believe them and stopped apologizing. Jimin knew it was impossible for him to know about what was going inside his body, and Jungkook had made sure to be the one to make him understand that protecting his own life had been the best he could have done with soft words and tender touches, the spark on his eyes showing his sincerity; Jungkook did not hate him for losing their baby nor being weak. Jungkook recollected the little pieces in which Jimin broke and put them all together again with caring hands. Jimin was really grateful for that, the alpha always alleviated his pain, his fear, stopped the bleeding of all the wounds Jimin had had open for a long time. \nOn the third day of his recovery Jimin started to say thank you instead of sorry and the burden was off his shoulder, finally managing to put a genuine smile on his face when out of the blue Jungkook had tenderly kissed him after he had taken his first bite of food on his own.\nThey took off after their healear had officially confirmed Jimin was recovering and even though Jungkook had been wary about it they packed everything ready to leave.\n“I don’t want to keep dragging out our journey for longer,”  had argued Jimin when Jungkook protested, taking hold of Asmund reins to prevent Jimin from mounting. “All our stops have been my fault, if not for me we would have reached Telain two weeks ago.”\n“I don’t mind,” had tried Jungkook, stubbornly pulling the reins out of his reach when Jimin tried to take them, “we can take all the time you need to recover—“\n“I want to go home, Jungkook,” had interrupted Jimin softly, looking down to his boots, “I’m tired… All I want is to finally reach home.”\nJungkook had said nothing else and gave Asmund’s reins back.\n \n \n \n————————\n \n \nThey weren’t that far from Telain, just like Jungkook had said; it took five more days to reach the border and another six to finally be in the capital. It had been, in total, three long months of journey that had changed Jimin’s life completely for the best, luckily.\nThey were received by Jungkook’s mother, tender smile and arms wide open to envelope her little son in a tight embrace. She was small, as most omegas tended to be, Jungkook’s frame basically ate her completely when he circled his arms around her. Jimin smiled with fondness at the lovely image in front of him.\n“I’m so glad you have make it back home safely.” she said chirpily, hand caressing Jungkook’s cheek tenderly, “It took you more than expected, though.”\n“We encountered some difficulties in our path but nothing to worry about.” replied Jungkook with a wide smile, eyes crinkled cutely at the corners. It was one of the rare moments in which Jungkook smiled with nothing but genuine happiness, and that always managed to infect Jimin’s own lips.\nBrenda finally moved her blue eyes away from her son and focused on Jimin, smiling even more when the omega stiffened at the sudden attention.\n“Why don’t you go see your father,” she said, looking back at Jungkook, “he’s reunited with your brother and I’m sure both of them will be thrilled to know you are back.”\n“Uhm, I was going to show Jimin—“\n“I will take care of him,” she said with a playful smile on her lips while shooing Jungkook away with her hand, “You two just spent months stuck to each other, give him some space, will you?”\nJungkook looked back at Jimin, frown of reluctance sitting heavy on his eyebrows. Jimin knew him enough by now to see he wanted to argue and refuse to leave him, obviously still worried about the omega’s health, but Jimin offered him a soft smile and a nod to encourage him to simply go.\n“Alright,” he gave in, turning back to his mother, “I will trust him with you.”\nThey bickered a bit more, with her teasing him for his obvious reluctance to leave Jimin’s side, making sure to point out how their scents were mixed together more strongly than before, managing to tint both Jungkook and Jimin’s cheeks pink.\n“I will see you in a bit,” whispered Jungkook on Jimin’s ear after he had approached him, arm softly circling the omega’s waist to press their bodies close. Jimin blushed, pleased Jungkook didn’t want to leave before making sure to reassure Jimin first. “If you need me just call for me and I will be there.”\n“I will…” he said softly, cheeks going another shade deeper at the amused smirk Jungkook’s mother was sending their way.\nJimin didn’t bring with him too many things, first of all because they would be too heavy to carry in such long journey, and also because his most precious things could be counted with the fingers of just one hand; he could aways get new clothes and utensils in his new home. That’s why it didn’t take much effort for both Jimin and Brenda to move his things to what would be Jungkook and Jimin’s room from now on.\n“Are you alright dear?” she asked softly. Jimin turned around from the window that displayed the big land of the Jeon territory, covered in a white cold blanket. He had gotten distracted by the sight, suddenly hit with the reality of where he was, a blur of messy thoughts running wild on his mind.\n“Yes,” he said with a hoarse voice, trying to swallow over the knot forming on his throat.\nShe smiled kindly, looking at him with something akin to fondness. It reminded Jimin of his own mother, always gentle with a smile for everyone, and the knot on his throat tightened.\n“I want you to know that you are part of our family now,” she said, taking small steps towards him, still smiling, “and that I’m thrilled to have such a beautiful and sweet omega to take care of my silly Jungkookie.”\nJimin offered a watery smile, eyes now filled with unshed tears, and choked out a soft “Thank you.”\n“Feel free to come at me whenever you feel burdened, yes? Or if you have any problems adapting to your new place. Whatever you need, you can ask me,” she continued, now close enough to rest her hand on Jimin’s cheek softly. The young omega sighed, unconsciously closing his eyes at the touch; it wasn’t like his mother’s but it was sure tender and full enough with affection for Jimin to breath with relief, shoulders sagging froward once the tension started to even out, “I want you to feel comfortable with us, you are a Jeon now.”\nJimin nodded, finally releasing his tears along with the pent up tension, frustration and fear he had been building up inside his petite body for the past months; she embraced him, cooing at him with tenderness and patting his back lovingly as he allowed everything to finally explode. He felt like a child crying to his mommy’s skirt, but he couldn’t care less.\nShe comforted him for what felt like hours, helping him get rid of the little insecurities and fear still remaining on his body and she only provided kindness and encouraging words that managed to ease a bit his crying.\n“It’s not easy what you did Jimin,” she said, drying his tears with her thumb, “and that’s proof enough of how strong you are. I’m proud of you, and trust me when I say I’m happy to have you as part of our family.”\n“I will do my best to be worth of such words, Brenda.” he said with sincerity, “Thank you for trusting me.”\nShe smiled tenderly as she cupped Jimin’s cheek, caressing it softly with her thumb in a loving gesture that made Jimin think of his mother again. But this time he felt at peace, relieved to have found another source of warmth in his new home.\n“Alright dear, let’s get you all settled up.”\n \n \n————————\n \n \n \nJungkook found him on the bath basin filled to the brim with soaped and warmed up water.\nBrenda had left after making sure Jimin was smiling again and gave him a tight hug with the promise to see each other again during dinner.\n“Prepare your guts for the most delicious food you have ever tasted!” she had exclaimed with a smile that got Jimin giggling, to which she responded with a wide grin.\nJimin couldn’t be more thankful, albeit surprised, by her warm welcoming. He had not the chance to interact directly with Jungkook’s family, or at least not more than polite words while they were still on the Park mansion on the previous days of their ceremony. He had not even tried to pay attention to them, too busy drowning on his own sorrow to care; he realized how selfish he had been, crying and whining around, building up walls around him and making everything so difficult to everyone surrounding him when, apparently, he had been lucky enough to get involved with a nice family. Jimin was definitely willing to try, specially with Jungkook.\n“How was the meeting with your father,” asked Jimin soflty, crossing his arms on the rim of the bathtub before resting his chin there, content smile and muscles relaxed now.\n“It was nice, he was really happy to see me after so long.” smiled Jungkook, resting all his weight on the door frame, head tilted to the side and eyes fixed on Jimin. “He wanted to see you too, but understood you would be tired form our journey.”\n“I will give him my greetings before dinner,” said Jimin before bitting his lip, ashamed for his lack of manners. How inconsiderate of him to simply ignore the head of the house and take a bath when he was accepting Jimin into his family with such joy. Jungkook, though, just shrugged it off with a smile, arms crossed over his firm chest. Jimin didn’t even try to hide the fact that he was admiring his broad frame now that the alpha had gotten rid of his cloak.\n“What?” asked Jungkook teasingly, obviously noting the undertone of Jimin’s blatant stare.\n“Would you like to join me?” asked Jimin, smile widening as the words brought back memories of the first time he had awkwardly stuttered the same question out , so many days ago with just them and so much snow. Completely different from their current setting.\nJungkook chuckled, finally separating from the doorframe as he started to undo the buckles of his leather armor and with a playful smirk he said, “Thought you would never ask.”\n \n \n \n————————\n \n \n \nAsger had been loud and happily smiling the whole dinner, lifting his cup high in the air to celebrate the mated couple was finally back home. Jimin enjoyed himself, smiling, talking and even daring to drink from his cup filled with wine while his other hand was busy playing with Jungkook’s fingers. The alpha had taken his hand to his lap at some point through the night and Jimin could only interlock their fingers in a silent response to the tenderness the other was showcasing. He kept throwing secret glances at the other, heart swelling with something that Jimin had ever felt before but that sure was welcoming in. He felt happy, sated, maybe even glowing because Jungkook seemed to not be able to tear his eyes away from him either.\nWhen they managed to escape from Jungkook’s father attempts at getting them drunk they stumbled in their bedroom, mouths already pressed together and fingers eagerly getting rid of clothes to end up in bed moaning each other's name.\n“I never thought I would be in such situation,” mumbled Jimin playing distractedly with Jungkook’s long dark locks. The alpha hummed, dropping a kiss on Jimin’s bare navel before resting his chin there to look up at him. “Much less to end up married to a Jeon.”\nJungkook smirked along with him and with his hair all mussed up and cheeks flushed because of their previous activities he looked lovely, pulling all the right strings inside Jimin’s chest to have him grinning happily.\n“Was it as bad as you initially thought?” asked the alpha, closing his eyes with pleasure when Jimin brushed his hair back from his forehead and scratched softly his scalp.\n“It was,” he started with, “but not anymore.” he added with a chuckle after Jungkook frowned slightly. “But I think I felt it was horrible because I was making it difficult. And I owe you an apology for that.”\nJungkook stared at him with seriousness before sighing, finally pulling himself up to  crawl all the way up Jimin’s body. He pressed a chaste kiss on Jimin’s lips, making the omega sigh with satisfaction. “You are for sure forgiven already.”\nJimin whined when Jungkook pulled back, cupping his face with both his hands to pull him down again for another kiss that had the alpha resting on his elbows on each side of Jimin’s head as to not fall down completely on him.\n“You like kissing me that much?” asked Jungkook chuckling, eyes tender and screaming loudly he also liked how needy Jimin was.\n“I like you.” confessed Jimin in a whisper, blushing madly as the words came out and looked away as Jungkook slightly jerked his head away in surprise.\nThe silence dragged for too long for Jimin’s comfort, embarrassed by his own words he stopped touching Jungkook, curling his arms to his chest as he kept looking away, awaiting for the rejection with tense muscles.\n“You do?” asked Jungkook, lowering himself more close to Jimin, pecs pressing down against Jimin’s fists.\n“I just told you,” said Jimin defensively, finally turning to look at Jungkook with a frown. Was Jungkook going to make fun out of him because of this? Because he had managed to make the bratty omega fall for his charms? Had Jimin interpreted those smiles and those tender eyes wrongly?\n“I want to hear you say it again.” replied Jungkook with a smile that had Jimin relaxing instantly. Jungkook looked happy, if not thrilled because of those words and if it was all it took to have him smiling so prettily Jimin wouldn’t mind repeating himself over a hundred times.\n“I like you Jungkook.” he said again, lifting his hands to cup the other’s face again, pressing his thumb on Jungkook’s smiling lips, so rosy and so appealing. “And I’m happy to be here with you. I know I’ve made things difficult for the both of us and I’m sorry for that, but I’m definitely not regretting our marriage.”\nJungkook dived in for another kiss, just a press of lips and nothing to do with the passionate ones they had been sharing until now; this one was gentle and filled with something else completely different from lust or want.\n“I’m really happy to hear that, you have no idea,” murmured Jungkook against his lips before dropping another kiss, “I like you so, so much. I didn't know how to approach you properly, afraid you would hate me forever. I know we still have a lot to learn and discover from each other but— I don’t know— I just want to make you happy and—“\n“Thank you.” whispered Jimin, lips curled upwards. There was this smile on his lips that he couldn’t get rid off even if he forced himself to, “Thank you for trying even when I was pushing you away, for not giving up on me and taking care of me. I promise, this time with sincerity, that I will do the same for you.”\nJungkook snuggled down on him, burying his nose on Jimin’s neck and tightening his hold around his torso. They spent their first night together in Telain just like that, naked and tangled on the bedsheets of their bed, mischievous fingers exploring skin and lips moist with all their kissing, scents mixed as one. It felt like a piece of heaven, having Jungkook in his arms, tenderly kissing him and looking at him with something close to what Jimin hoped was love.\nBecause now, loving Jungkook was not frightening at all.\nJungkook was exhausted, to put it simply. Despite being used to traveling, ride alongside his men for weeks, months even, ignoring the pull of his tired muscles and fatigued body, this time was different. This time, there was someone waiting for him at home that he was anticipating to see; someone whose smile could brighten up the darkest of days, whose eyes would sparkle mischievously every single time he was about to kiss Jungkook by surprise, whose scent and presence he missed dearly.\nA quick glance of his surroundings told Jungkook they were nearing the mansion and unconsciously signaled for his horse to walk faster, not caring at all if he looked desperate to his men, because most of them had their mates accompanying them, or weren’t mated and would probably not comprehend the burning urge to see someone they shared their soul with after being separated for so long.\nIn the two years that they have been mated, Jimin always came along whenever Jungkook was sent away by his father in order to pursue alliances or take care of conflicts that would ensue within their territory, giving them the excuse to spend more time together learning about each other. But this time Jimin was requested to stay in Telain by their healer after finding out he was pregnant, and no more words were needed. It was the first time, since that sad day in the woods so, so many months ago, that Jimin had managed to get pregnant again. Apparently, the miscarriage had taken a toll on his body and it had been a long process for the omega to recover completely, although the healer assured them that Jimin was healthy and still fertile; he just needed some time, it would happen eventually.\nHence, despite Jungkook had wanted to have Jimin by his side once again, they decided it was better for the omega to stay and rest as to not make Jimin go through another hard time struggling to stay alive, because that one time they had been lucky Jimin was strong enough to endure everything and, successfully, not lose his life; Jungkook was not risking Jimin’s health again because of his selfish desire to have him by his side.\nSo Jungkook had left with the bitter taste of loneliness and the constant urge to turn back and run to his mate’s warm embrace and sweet scent, bury his face on the omega’s neck or kiss him senseless, because he knew he had duties to take care of; he didn’t even think of asking from his father to let him stay, not when he knew the head of the clan trusted him to attend such important meeting with another family.\n“He will understand,” his mother had said with a worried expression, obviously sensing Jungkook’s inner turmoil, but the young alpha had shaken his head no in response. He couldn’t fail his father, and he knew with certainty that Jimin would be taken care of well in his absence.\nAnd finally, after six long months of journey he was back home, the walls of the mansion at plain sight, the mix of oranges and dark greens that coated the tree branches during this time of the year appeasing the longing of not seeing his land for months, and his heart swelled with happiness inside his chest.\nLike usual, it was his mother who received him at the entrance with a wide smile and open arms that pulled him into a tight embrace when he was at reach, making Jungkook sigh in contentment at the familiar and cozy scent of his mother; It was always comforting to have her in his arms, her scent enveloping him and soothing all the tension accumulated during his traveling. It was one of those rare moments in which the alpha allowed himself to relax completely, discarding without remorse the walls built up around him in order to show he was a strong and powerful alpha; Jimin was the other one aside from her that managed to make Jungkook fall into a sense of calmness with just his scent.\n“I missed you so much, son,” she said smiling broadly, her icy blue eyes sparkling with some unshed tears. Jungkook returned the smile, tightening his hold around her waist in a consoling way, amused, but happy, that despite all the times they had been through this exact moment, she always reacted the same.\n“Me too mother,” he said sincerely, “I’m really happy to be home again.”\nJungkook allowed her to drag him inside the mansion, her arm circled around his waist as she talked non stop about everything he had missed during his absence, Jungkook nodding to signal he was giving her his full attention.\n“Your father is out hunting right now,” she said with a smirk that told Jungkook she was going to tease him again, “but I’m sure you would rather go see someone else first even if your father was here, right?”\nJungkook couldn’t help but smile, pink tinting his cheeks, “How has he been?”\n“He missed you so much,” she said with a fond smile, Jungkook noticing only then that she was leading the way towards the gardens in which Jimin liked to go sit to read, “He pouted a lot the first two months, the other four he managed to hide it slightly bit better.”\nJungkook laughed, relieved to hear Jimin seemed to be doing fine, but the worry filled his chest anyway at the lack of information about his state. “What about—“\n“Go see for yourself,” she interrupted with a slight push on his back towards the door that lead to the gardens. Jungkook frowned, not liking the mystery behind her words nor the serious expression on her face.\nThe alpha stopped for a moment to breath slowly in order to tamer down his nervous heart, suddenly afraid of what would greet him. It wasn’t like he needed to have pups right now, but it sure was something he was looking forward to, specially with Jimin; he was anticipating the day a little pup would run up to him with a cheerful yell of dad rolling off their tongue, with cheeks he hoped would be as full as Jimin’s own or eyes as wide and innocent as any other child. Jungkook knew the chance of losing their baby again existed considering how long it had taken for Jimin to get pregnant again, and although he would be sad to hear about it, what worried him the most was Jimin’s reaction in case of another loss. Jungkook had seen with a pain piercing through his chest how much it had the destroyed the omega that other time; the shame and sorrow on his eyes, his frame looking more small than usual shaking with the force of his sobs. The alpha hated to see his mate go through that, see Jimin suffer so much, and feel helplessly the guilt of not being able to do anything to ease his omega’s hurting heart. They had worked together to overcome such sadness, Jungkook giving his all for Jimin to understand that it had not been his fault nor that he had anything to feel remorseful about. Jungkook promised himself that day that Jimin’s safety and health was going to be his priority.\nWhen Jungkook finally found the courage to go seek for his mate it didn’t take much to find him. Jimin was sitting facing the trees, his back to Jungkook and, as usual, hunched forward reading a book. It was cold for him to be outside, but he had a thick furry cloak enveloping him fully that apparently provided enough warmth for him to submerge in another one of his stories without having to worry about the weather.\n“Jimin,” he called, voice soft as to not scare him —or maybe with the hope of not being noticed; He hated how afraid he sounded and how his heart was still hammering inside his chest.\nThe omega’s response was immediate, though, turning his head towards the source of the voice with a smile that made his eyes crinkle beautifully at the sides to the point they were risking to disappear. And Jungkook’s heart eased a bit, because Jimin’s smile never failed to bring joy with its appearance.\nJungkook was about to say something but Jimin rose from his seat and the sight of his round profile made the words die on his tongue immediately; Jimin’s belly was big, maybe too big considering he was only six months into pregnancy, but nonetheless beautiful, even with his fuller cheeks and wide waist.\nThe alpha cut the space separating them with long and fast strides, not hesitating to envelope his mate with his arms, both of them sighing with relief at the same time at finally being able to touch, see and smell each other after so long. Now that he was closer, with his nose buried in Jimin’s blonde hair, he noted the citrousy touch on the omega’s scent, the distinct sign that told there was another human being inside his belly, even if the size of such was indication enough. It was sweet and made Jungkook’s inside churn with happiness, overwhelming enough to form tears in his eyes.\n“I missed you so much,” mumbled Jimin against the little hairs of the alpha’s furry cloak, not even trying to be subtle while rubbing his cheek on it. Jimin always rubbed his cheek or nosed at his neck whenever he was needy, an adorable way he had of scenting his mate.\n“Me too,” He chocked out, voice tight because of the knot on his throat. Jungkook wasn’t one to cry easily, but the situation was overwhelming; having his mate again in his arms after what felt an eternity, the fact that Jimin was safe and sound and expecting their first child, looking healthy and beautiful.\n“Are you crying? You are so cute…” laughed Jimin airily while cupping his cheek, mirth gracing his tone. “Come here.” he mumbled while leading Jungkook’s head down to seal their lips in a soft kiss. Jungkook sighed pleased, allowing a lone tear to fall from his eyes and rejoicing in the comforting smell of his mate.\n“You look so beautiful,” Jungkook mumbled when they separated from the kiss, although they stayed pressed as close as Jimin’s big round belly allowed them to. Jimin smiled, nudging Jungkook’s nose with his own before dropping another kiss to his lips.\n“You are so cute.”\n“Shut up,” barked Jungkook with a chuckle and no real bite, but mostly embarrassed because of the other’s teasing. Jimin giggled before pressing another soft kiss at the corner of Jungkook’s mouth. “I can’t believe I’ve missed this…” he said softly while resting his hand at the side Jimin’s belly, failing to fit his hand completely around it because of how big it was, “I’m really happy you are doing fine. Is everything going well?”\n“Yes, the healer said everything is going smoothly so far,” assured Jimin, lips still curved in that pretty smile that made Jungkook’s heart melt every time he looked at it. Who would have guessed he would turn to be so soft at heart for his omega considering he had never given much importance to mating nor finding a lover, but now, with Jimin in his arms, looking up at him with love in his eyes he couldn’t find it in himself to feel ashamed about it.\n“I’m glad to hear that, I kept worrying about it the whole time.” he said with a slight frown, “I wanted to stay here with you— I’m really sorry Jimin, I should have stayed back, to keep an eye on you—“\n“Hey,” interrupted Jimin, cupping the alpha’s cheek tenderly with his small hand. Jungkook lifted his hand and rested it above Jimin’s one, curling his long fingers around the omega’s short ones, “I know you wanted to stay, but we both know you couldn’t and that’s fine. Don’t feel bad about it, your mother helped me a lot all this time.” reassured Jimin through a soft smile, eyes curved up with fondness. “We are fine—“ he added, one hand caressing softly his protruding belly, “—the three of us.”\n“Three?” asked Jungkook surprised, watching as Jimin’s smile widened until he couldn’t hold back his giggles at Jungkook’s bewildered expression.\n“Yes…” confirmed the omega, successfully awakening the butterflies inside Jungkook’s belly as the information was sinking in. “Healer Jung said that considering how big is my belly the chance of having two babies on the way is highly possible.”\nJungkook stared blankly at the omega with eyes big like an owl’s as he tried to process the news delivered, to which Jimin responded by bitting his bottom lip nervously.\n“If it turns out to be like this it will be quite the hard work, right?” he chuckled humorlessly, tilting his head down to stare at his curved belly. He looked troubled, probably anxious pondering about the outcome. Jungkook couldn’t blame him, though; one pup, considering their young age, would be already a lot of changes in their lives, but two would make them have to double the efforts.\n“It’s fine,” he said once he was sure his voice wouldn’t crack, smiling softly. He dropped a kiss on Jimin’s temple for later nudge with his nose at his cheek to make him look up. “We are going to be fine because they will be our babies and I’m with you to take care of them.”\n“Even if—“ he cut himself, briefly looking into Jungkook’s eyes nervously before dropping them to his navel, “even if the both of them are omegas?” mumbled Jimin with a thin voice.\n“I will love them Jimin,” Jungkook stated firmly, lifting the other’s head again with a finger under his chin. He hated to see his mate sad and drowning in insecurities, because Jimin was a strong man, a beautiful omega capable of doing everything he desired and Jungkook always made everything in his hands to take those worries away. “I will love them no matter what because they will be our babies. Being an omega won’t make them any less, you know that already.”\nJungkood smiled after seeing Jimin’s eyes light up, lips curling up in a pleased smile; the one that always appeared shyly on the omega’s mouth whenever Jungkook would compliment him.\n“If any of them turn out to be an omega, they will have the best role model as their father to show them how strong and powerful they can be—“\n“If they turn out to be alphas—“ Jimin interrupted him with a grin spreading on his face, “—they will be taught to respect everyone regardless of their status, like their alpha father does.” added Jimin, playfully nudging Jungkook’s nose with his own.  Jungkook chuckled embarrassed, pink tinting his cheeks because of Jimin’s words.\n“Yes,” Jungkook nodded, “their status won’t determine their future. We will make sure they grow up being who they want to be, happy and loved plenty.”\n“I trust you,” whispered Jimin, getting closer, impossibly so, until his face was blurry for Jungkook to see and there was no space left between them. “because I love you so, so much, I know it will be fine.”\nJungkook’s heart went crazy inside his chest; he had worked hard to showcase his power and strength since a really young age to gain other’s reliance and trust and hearing those words from Jimin, his mate who he loved dearly, made it feel like all his efforts had been worth it, as if he had accomplished everything he had ever dreamed of.\n“I love you too,” he mumbled against Jimin’s lips before kissing them. A soft kiss, nothing but love used in that gentle press of lips hoping Jimin would understand. But, honestly, that never worried Jungkook that much, because Jimin always seemed to understand and gave back as much as Jungkook wished without complaints.\n \n \n \n-----------------\n \n \n \n“Jungkook!— Jungkook, wake up!”\nJungkook gasped awake surprised, quickly blinking the sleepiness away as Jimin’s distraught voice called for him from where he laid beside the alpha on bed.\n“Wha— what’s wrong— are you alright?” he asked, voice rough from sleep but body already on alert and ready to fight whatever it was.\n“I— it hurts.” groaned Jimin, hand clawing on Jungkook’s forearm. “I think— I think it’s time…”\nJungkook frowned confused, staring at Jimin’s face contorted in pain trying to comprehend the situation.  “Time for what?” he asked dumbfounded and groaned in pain as Jimin’s hold on his arm tightened more, face turning towards him in a mix of anger, bewilderment and pain; even if the room was half surrounded with darkness Jungkook was able to identify that much.\n“The pups, you idiot.” said Jimin through gritted teeth before a groan cut out any other blasphemies that were about to fall from his mouth, his other hand clutching the undershirt covering his big belly.\n“Oh fuck.” cursed alarmed Jungkook, finally conscious of what was happening. The babies were on their way, and they obviously weren’t going to wait for him to awaken fully to aid help if Jimin’s groans of pain were any indication of it. “Hold on, I’m going to go search for the healer— I will be back soon, alright? Don’t move—“ he blabbered out as he managed to get rid of Jimin’s firm hold and stumbled his way out of bed to get dressed.\n“Where I’m supposed to go?” asked Jimin with a forced chuckle, obviously amused by Jungkook’s words despite the pain he was going through. The alpha ignored it, dressing himself with whatever he found first and made his way out of the room with wobbly legs. He was nervous, heart beating like mad inside his chest as sweat started to roll down his forehead; he had never been so anxious before, not even the first time he had been thrown in a battlefield against real enemies despite being young and inexperienced.\nHe barged into his parents’ room forgetting all formalities, explaining the best he could through mumbled words that Jimin seemed to be ready to give birth and worked on autopilot as his mother told him were to go seek for the healer, half processing she was going to attend as best as she could all Jimin’s needs meanwhile.\nThe healer had started to sleep in the household as Jimin’s date of giving birth approached, constantly following the omega around to the point Jimin had complained to Jungkook for the lack of intimacy. Jungkook had told the healer to step back, although that did not imply Jimin was going to be left alone. Everyone in the household kept their eyes on him; it was just because Jimin’s belly had grown really big on the following months, confirming their suspicions of how many pups were in the way and everyone’s protective instinct had surged in, specially Jungkook’s. Another reason for the extreme fussing was that the omega looked adorable with his big round belly, waddling around the house with a scrunched up nose due to discomfort, one hand in his back to support the weight, the other on his belly as if reassuring the pups that he wasn’t mad it was their fault he was so uncomfortable.\nThe following hours passed by like a blur to Jungkook; he only recalled Jimin sweating profusely, face scrunched up in pain as he squeezed Jungkook’s fingers with his hand, eyes seeking his from time to time as to find some source of comfort.\nJungkook finally snapped out of his trance when a little cry broke through the other noises in the room. And when his eyes left Jimin’s exhausted face to see his mother holding a tiny bump on her arms it finally dawned on Jungkook that their children were finally in the world, breathing, so full of life, and crying as greeting to everyone in the room.\n“It’s a girl.” she mumbled dreamily, fond smile on her lips as she stared down to the little girl bawling her lungs out on her arms.\n“This little buddy here is also a girl,” said the healer, caressing the little girl’s head on his arms with a towel to clean her up.\nJungkook stood up from bed and as careful as he could embraced his baby between his arms. The response was immediate, and the little girl stopped her bawling as the expression on her face relaxed until all movement ceased to end up curled against Jungkook’s chest.\n“She knows you are her father, that she’s safe with you.” said Brenda with a watery voice, but Jungkook couldn’t focus on his mother’s tears now, not when he had such a precious little creature in his arms snuggling into his chest as if it were the only place where she wanted to be. He rocked her back and forth sightly as his eyes started to sting with tears of happiness; never, even in those rare times in which he allowed himself to dream about his future pups, would have ever imagined it would be so heartwarming to have his children in his arms for the first time.\n“Can I see them?” came Jimin’s rough voice from bed. Jungkook turned around to him with the widest smile his face could muster up, and approached his mate with careful steps as to not disturb the girl sleeping on his arms.\n“She’s so pretty, Jimin.” mumbled Jungkook while laying gently the pup on Jimin’s chest. “the both of them are beautiful.”\nJimin stared down at her, simply tracing her nose with the tip of his finger with a feather-like touch, admiring the way her facial expressions changed with eyes full of happy tears. Healer Jung passed the other girl to Jungkook, this one more calm having barely cried at all, who fisted Jungkook’s shirt on her tinny hand as her nose pressed against his chest, probably seeking the comfort that came from her father’s scent.\n“Do they have names yet?” asked Brenda softly, staring down at the girl in her son’s embrace as her hand caressed soothingly his back; a silent way to tell him she was happy and proud of him, of them all.\n“This one Yesun,” mumbled Jimin, still admiring the girl on his chest sleeping peacefully, “the other Yerin.”\n“Will have to come up with a way to differentiate them,” chuckled Jungkook, stopping abruptly when Yerin squeaked with discomfort. He adjusted her and closed a bit more the blanket around her to protect her from the cold. It wasn’t full winter season yet, but the days were always cold in Telain even if the fireplace was lit and there were layers of blankets covering them.\nAsger and Jihyung came in a couple of hours later to meet the pups, and Jungkook had been witness of his father cooing at the little girls with some tears accumulated at the corner of his eyes. It was a rare sight, an alpha as strong and proud like Asger crying at the sight of his grandchildren, but it gave Jungkook a new perspective. He always thought that he had the obligation to prove how worth of respect and admiration he was, always looking up at his father sturdy stance and menacing stare, hence he grow up thinking that showing any kind of emotion wasn’t what reliable alphas did. His mother had a different kind of strength, more composed and less aggressive but no less admirable in the eyes of her two sons, although she used her power to soothe their worries away instead. That's why Jungkook allowed his soft side to come alive with her. Jimin had changed that from a bit since they mated too, and Jungkook allowed himself to be natural in front of the omega during their intimate moments when only the two of them were together, but seeing his father get rid of his image in front of everyone with no worries made Jungkook realize he didn’t need to pretend to be strong in every situation; he was allowed to feel, and that did not imply he was any less of an alpha capable of protecting his family.\nJihyung, as a gift, had crafted a beautiful cradle big enough to carry both pups, and after making sure the girls were secure and warm under their blanket everyone left the room to give Jimin his more than deserved rest.\n“It’s baffling how life can change so quickly,” whispered Jungkook against Jimin’s blond strands of hair before leaving a soft peck there. Jimin hummed in response, nosing at Jungkook’s neck before sighing contentedly. The moment Jungkook had laid back on bed Jimin had wasted no time to throw his body on the alpha, seeking his scent and comfort, body easily adjusting to his. He was obviously in pain, his muscles were sore and the bags under his eyes yelled how tired he was, so Jungkook was ready to take the lead, to take care of everything until the omega would be up and ready so both of them could start to enjoy their little girls; It would take some days for Jimin to be able to get out of bed, exhaustion forbidding him of doing much more than sleeping, but Jungkook would make sure he would be filled with love.\n“I love you.” said Jimin in one of his exhales, sounding as if he was two heartbeats away from falling asleep, breath tickling gently Jungkook’s skin but pulling with force the right strings on Jungkook's heart for it to go crazy. They had exchanged such words of endearment before, but every time felt like the first and Jungkook couldn’t help the happiness from spreading within him. “I love you so much, and my life here with you and now with our little girls too.”\nJungkook briefly looked up to the cradle before focusing on the beautiful omega at his side, tightening his arms around him and burying his nose on his hair to breath in that sweet smell that meant home and happiness, and that filled his chest completely with something warm and wonderful.\n“I love you too.”"
}