{
    "id": "1248274",
    "url": "https://archiveofourown.org/works/1248274?view_full_work=true",
    "author": [
        "uraneia"
    ],
    "title": "That Which You Cannot Undo",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [
        "Stiles Stilinski",
        "Derek Hale",
        "Lydia Martin",
        "Scott McCall",
        "Kira Yukimura",
        "Alan Deaton",
        "Marin Morrell",
        "Isaac Lahey",
        "Peter Hale",
        "Allison Argent",
        "Jackson Whittemore"
    ],
    "additional_tags": [
        "Alternate Universe - Fusion",
        "Practical Magic AU",
        "Magic!Stiles",
        "Single Parent Stiles",
        "Exorcisms",
        "Knotting"
    ],
    "language": "English",
    "series": "",
    "published": "2014-02-28",
    "completed": null,
    "words": "28,181",
    "chapters": "1/1",
    "comments": "559",
    "kudos": "18,907",
    "bookmarks": "6,423",
    "hits": "253,460",
    "summary": "<p>By twenty-eight, Stiles has resigned himself to a quiet life of working in his magic shop, selling Jackson Whittemore fart-inducing tea, and looking after his goddaughter. It's a good life. But the quiet goes to hell when his sister, Lydia, shows up with a crispy werewolf in her trunk and a bite mark on her shoulder, because hard on her heels comes the hottest person Stiles has ever seen, and he happens to be looking for his uncle.</p>\n<p>You know, the dead guy Stiles helped Lydia bury last night.</p>\n<p>(Or: the <i>Pracitical Magic</i> AU nobody asked for.)</p>",
    "notes": "<p>Title from Shakespeare's <i>Titus Andronicus</i>.</p>\n<p>As always, many thanks to <a href=\"https://archiveofourown.org/users/lupinus\" rel=\"nofollow\">lupinus</a> for the test-reading.</p>\n<p> </p>\n<p> <b>See end notes for warnings.</b></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p><b>Warning:</b> This fic contains references to a sexual relationship between Peter and Lydia. The actual relationship takes place before the story begins, but it is referenced, and later, Peter's spirit takes control of Lydia's body. Eventually Stiles performs an exorcism and Peter is destroyed permanently.</p>\n<p>Come say hi on <a href=\"https://hatfulofcrazy.tumblr.com\" rel=\"nofollow\">Tumblr</a>!</p>",
    "text": "Stiles is eight years old when his mother dies, nine and a half when the grief finally takes his father. He sits with Lydia in his aunts’ parlor during the wake, silent until he can take it no longer.\n“It was the curse,” he bites out. When he concentrates, he can feel its effect on him too, like a dark band around his heart.\nLydia’s always been the more levelheaded of the two of them. “Stiles—”\nBut Stiles doesn’t want to listen to her platitudes. He knows the truth. He knows the reason his mother died, the reason his father withered away for sixteen months before the last light went out of his eyes. “I hope I never fall in love,” he says viciously.\nLydia holds his hand and doesn’t say anything.\n*\nStiles goes to live with the aunts after that. It’s… nice. They’ll never be his father, but sometimes Aunt Hestia’s laugh and the way she smiles—it’s nice, not to forget. To have a living reminder.\nAnd, of course, the aunts have magic.\nStiles’s dad never mastered the gift. He used to shake his head and say he didn’t have the knack, didn’t have the concentration for it. He was better at solving problems the natural way. He used to say that’s why he became the sheriff.\nStiles, though—Stiles has the gift. The breeze comes when he calls it, and injured animals seek him out to heal them, and Hestia and Kath exchange looks Stiles can’t interpret and include him in Lydia’s lessons.\nLydia’s talents, they soon discover, are mostly charm and persuasion—and, of course, that other ability she gets from Aunt Kath. One night she wakes up screaming and she won’t calm down; she keeps saying He loved her and she burned them all, over and over, hiccupping and crying. Stiles and Aunt Kath stay up with her all night until she exhausts herself and falls asleep.\nStiles helps Lydia with her spellwork and she helps him with his geography, and things are okay. Stiles misses his dad and his mom, but he has Lydia. He has the aunts. He has magic.\nHe starts to heal.\n*\nUntil one night Stiles wakes up from a nightmare: he is grown, and his love is dead, and Lydia is married with a life of her own, and the aunts are gone. He knows, then, what he has to do.\nWith Lydia by his side, he sneaks into the greenhouse and takes down a bowl.\n“What are you doing?” Lydia says. She’s seated on the counter, swinging her feet quietly against the cupboards.\n“I’m making sure,” Stiles says, and starts the gathering.\nHe never wants to fall in love. He picks rosemary first, to remind himself why. “When I fall in love, it’ll be with someone strong. So strong they can lift a car.” After a moment’s consideration, he adds an acorn.\nLydia makes a noise of disbelief but doesn’t stop him.\n“They’ll be so beautiful everyone will want them,” Stiles goes on, coaxing an opened silk cocoon from a branch, “but so hurt underneath they’ll never believe it.”\nNow Lydia definitely disapproves. “Stiles, are you sure you want to—”\n“They’ll have green eyes,” Stiles interrupts as he adds a touch of moss. Then: “No, brown.” A hazelnut. “Yellow.” A daisy. “Blue.” A shell. “Red.” A single rose petal.\n“No one could possibly fit that description,” Lydia points out.\nExactly, Stiles thinks. Exactly. “They’ll play an instrument. Violin.” He plucks a maple key from a sapling and adds it to the bowl. “And their favorite TV show will be Captain Planet.” He crouches and scoops a handful of the earth from under his feet.\n“You’re going to be alone for a long time,” Lydia says with a deep sigh.\n“That’s the idea,” Stiles agrees, tossing the bowl to mix the ingredients together. “Come on. I need one more ingredient.”\nThey steal outside under cover of night and rush to the edge of the cliff, where the wind buffets them from all directions. Stiles waits until the clouds part in front of the moon before holding the bowl over his head and letting the spark inside him ignite. I wish, he thinks as hard as he can as the pieces of his spell float into the night. I wish.\nThe dark circle around his heart seems to throb in acknowledgment.\n*\n\nEighteen years later\n\n \n“Uncle Stiles we’re gonna be late!”\nStiles hurphs as a solid five-year-old lands on his back, and wonders how it can be morning already. Life is so unfair. He groans and rubs a hand over his eyes. “Okay, okay. I’m up. Is there coffee?”\n“Aunt Hestia says coffee rots your soul,” Rina tells him matter-of-factly as she rolls onto the empty bed beside him. Hestia does say that, every morning.\n“Aunt Hestia is a witch and a morning person,” Stiles says, throwing off the blankets and pretending not to notice the way they cover Rina completely, “which is frankly unnatural. What did Aunt Kath say?”\nGiggling, Rina fights the comforter back. Her curly blond hair is already frizzing out of its braids. “She said she doesn’t want to talk to you until you’ve had your second cup.”\n“Oh, there you are,” Stiles says. “Are you all dressed? Good girl. What do you think, McDonald’s breakfast? Since we’re going to be late and everything.” Rina wakes him up late every Friday on purpose, he’s sure of it. She’s always up at dawn with the aunts herself. She has her mother’s energy.\nHer sunny outlook on life too, thank the goddess. Stiles doesn’t know how he’d cope otherwise.\n“Can I get two hash browns?”\n“Only if you eat your Egg McMuffin first.” Stiles tries to be a good surrogate parent and not give her a complex about her weight, but he’s pretty sure there’s more nutritional value in the egg than in deep-fried maybe-potato. “Now say good-bye to the aunts and get your lunch out of the fridge while I shower, okay?”\nThe next ten minutes are a blur, as they always are on Friday mornings. Stiles showers hurriedly, forgoes a shave, brushes his teeth, dresses in clothes that are probably mostly clean, and sweeps downstairs to snag a travel mug of delicious hot soul-polluting caffeine from Aunt Kath’s rheumatic hands. He presses a kiss to her pale cheek. “You’re the best.”\nAunt Hestia harrumphs, but she’s smiling.\nStiles grabs the rub he was up last night perfecting off the counter beside her before smacking a kiss on her cheek too. “Co-best,” he assures her, pocketing his keys. One last check and he’s ready to go. “See you tonight.”\nThe Martin house sits far enough on the outskirts of town that most people would drive, but Stiles likes the exercise, likes the way the wind speaks to him as they walk, and he’s trying to instill healthy habits, McDonald’s breakfast aside.\nRina’s still young enough that she doesn’t complain about holding his hand. Stiles still remembers Erica’s breakdown when Rina started to insist she be allowed to walk everywhere rather than ride in the stroller. He didn’t understand then, but now. Well. He understands a little too well.\n“Tell me the story of how Mommy and Daddy met,” Rina demands, as she does every Friday morning.\n(He and Erica are sixteen, sitting in the school cafeteria, Erica contemplating a bright-red apple as Stiles powers through a plate of french fries one by one. Finally Erica puts the apple down and raises an eyebrow at him and leans over the table in an impressive display of cleavage. “So,” she says, frank, no judgment, “are you ace?”\nStiles blinks at her, uncomprehending. “What?”\n“Asexual,” Erica repeats. “Are you? Because you never seem to, you know.” She makes several easily interpreted lewd gestures.\nFor a beat Stiles debates what to tell her. Lying would be easier. But he doesn’t like lying, least of all to his best friend. “You know about the curse.” He’s less conscious of it now than when he was a child, but he can still feel it when he concentrates, whenever he’s missing his parents.\nErica waves a hand. “Everyone knows about the curse. Didn’t stop your dad, or his dad, or whatever.”\nAnd that’s the thing, isn’t it; it’s not fair, but it’s only the men in the family who carry the curse. Aunt Kath’s healthy. Of course, she’s a banshee; maybe the rules don’t apply to banshees. “Yeah, well. I don’t want to fall in love.” Stiles shrugs. “When I was ten I cast a spell so I never would.”\n“Okay,” Erica says gamely, “but you don’t have to fall in love to have sex, you know.”\nAnd that’s… a fair point. Stiles doesn’t have to spare himself the pleasure to spare himself the pain.\n“And just FYI, you have the kind of shoulders girls wanna throw their legs over.” Erica punctuates this pronunciation with a red-lipsticked bite of apple.\nStiles chokes on a french fry. “Jesus, Erica. Are you volunteering?”\nShe smirks and wipes at a drop of juice with her thumb. “Nah, that was last year. You missed your chance. Besides, some of us want a love connection.” She gestures with her head toward a spot a few seats down, where a tall, broad young man is quietly eating his lunch. “He’s in my chem class. Really smart, which is always hot. What do you think?”\n“Well,” Stiles says after a moment’s consideration, “I’d throw my legs over his shoulders,” and Erica laughs.\nFive years later he’s the man of honor at their wedding.\nTwo years after that, he’s there to see Rina into the world.)\nSomeday, when Rina’s old enough to appreciate how much of a boss her mother really was, Stiles will tell her the real story. Until then, he just smiles and says, “Your mom and dad met at school, and your mom fell in love with his big brain.”\nHe drops Rina off at her kindergarten class with a kiss on the forehead, then meanders the two blocks over to his little herbalist shop and opens up.\nThe whole town knows about the Martins. Hestia and Kath have been meddling in matchmaking since before Stiles was in diapers, and by all accounts Stiles’s grandfather was the most gifted seer the continental US had seen in a century. But healing has always been Stiles’s specialty. He loves his little shop with its scents of sage and lemongrass, and he likes to help.\nHe’s only been in for twenty minutes when the door above the shop jangles and a man about his age comes in, brushing rainwater from his hair. (It never rains on Stiles unless he wants it to.)\nStiles smiles. “Scott.”\nScott sneezes, and Stiles remembers belatedly—“Oh, crap, I forgot. I needed some mistletoe for Mr. Shum’s thrombosis. You’re allergic now. I’ll put it in the back.”\nScott sneezes again. “Thanks.”\nStiles relocates the offending herb and chants a quick spell to purify the air. By the time he returns to the front, Scott’s fidgeting with the homemade lip balm display.\n“Sorry, man, I completely forgot I had that in here.” Stiles digs in his shoulder bag for the rub he put together last night. “How’s Joey doing? I heard from Mrs. Chifor that the science test was a doozy.”\n“He got an A minus,” Scott says proudly. “Thanks again for the study tips.”\n“Anything for another member of the ADHD tribe.” Stiles sets the canister on the counter and hops up onto his stool. “Kira still working that arson case?”\nScott grimaces. “Yeah. The hours suck, but she’s hoping if she can break it, she’ll get that promotion she’s been gunning for.”\n“Hmm,” Stiles agrees, collecting a few different tea samples from the back wall. Things haven’t been easy for Scott and Kira lately, what with Scott losing his job due to newbie-werewolf issues. And wasn’t that a surprise, when one of Stiles’s best customers walked into his shop with such a change in his aura. Until Scott was bitten, Stiles didn’t even know werewolves existed.\nHe’d had words with Aunt Hestia that day. Then he buried himself in research until he and Scott were both confident Scott could control his new powers.\n“Stiles?”\n“Sorry,” Stiles says automatically, coming back to himself as he rolls everything into the paper bag. “Here. Try that salve on Joey’s chest and back when the asthma gets bad. It might take me a couple tries to get the mixture just right, but I should be able to help.”\n“Stiles,” Scott protests. “You didn’t have to—”\nStiles has seen Joey McCall in the throes of an asthma attack, and yes, he did. “Come on, you didn’t think I was all massage oils and organic lubricants, did you?” Even if that is what first brought Scott to the store. “I wanted to. And there’s some stimulant teas, good for the concentration, for Kira. Maybe it’ll help. Goddess knows we don’t need an arsonist running around. Tell her not to drink them before bed, though.”\n“I’m paying you for these,” Scott says firmly, but he’s smiling as he takes the bag.\n“’Course you are, fine upstanding patron like you. Fifteen bucks.”\n“Stiles—”\n“Scott,” Stiles interrupts in the same tone. Then he shrugs. “The magic doesn’t work without karma.” Sometimes that means not charging more than people can afford. Scott’s usually pretty gracious about accepting Stiles’s help, but he insists on paying when it comes to items from the shop.\nStiles makes up for it by charging douche bags like Jackson Whittemore twenty bucks a box for a tea to improve their stamina, and never mentions that flatulence is the most common side-effect.\n“Thanks,” Scott says eventually, smiling. “I’d better go, I have an interview at the vet’s office.”\nStiles smiles back. “Say hi to Deaton for me.”\nThe rest of the day passes agreeably enough. Stiles closes shop for half an hour when school lets out to pick up Rina, since the aunts are heading off on some romantic getaway for a few weeks. She sits at his stool and colors in her Princess and the Frog coloring book. She likes to recreate Tiana with frizzy blonde curls so they look more alike.\nAt five to five, just as Stiles is getting ready to call it a day, his cell phone rings. He looks at the call ID, then at Rina, then at the door. He locks it, kisses Rina’s forehead, and takes the call in the back room.\n“Hey, Lydia.”\n“Stiles,” she says. Her voice is controlled, but it sends chills all the way through him. “I need your help.”\n*\nThe trouble with Lydia—well, Stiles doesn’t always know what the trouble with Lydia is.\nBy all rights she should be the most together person Stiles knows. She’s brilliant, driven, and has fantastic fashion sense. She has Aunt Kath’s Irish eyes and hair and skin and Stiles’s dad’s sharp deductive abilities. She’s got a PhD from MIT in predictive mathematics and a job teaching it at Stanford.\nSure, sometimes the banshee blood kicks in and she screams bloody murder, and sometimes she has nightmares for a week and tells people to avoid flying or long walks in the woods, but for the most part, she has her life under very strictly regimented control. She never asks for help. So when she does? Stiles goes into straight-up panic mode.\nThis time Lydia opens with, “So remember how I told you about that guy I met?”\nAnd that… is usually the trouble with Lydia.\nIn high school she had bad taste in boyfriends. Sophomore year Jackson Whittemore broke her heart and Stiles has never forgiven him (hence the performance-enhancing flatulence tea). Unfortunately for Stiles, Lydia, and Jackson’s wife, Lydia did, resulting in an extramarital affair that ended a year ago, just before Lydia took the job at Stanford.\nStiles wanted to ask her why, then, as much as he’d wanted to ask in high school. But he thinks he knows the answer. Nobody understands Lydia’s drive like Jackson. And nobody sees the person under Jackson’s douche bag behavior like Lydia. The two of them don’t make a lick of sense together, but they make even less sense apart, and they’re miserable on top of it.\nNow, Stiles tries to remember what she’d said. “The older guy, right? Paul or something?” It was an old-fashioned name. He was handsome and well-spoken, Lydia said, and then she went on a tangent about what he was like in bed and Stiles tuned her out in self-preservation.\n“Yeah, him,” Lydia says. She doesn’t spit things, she’s far too reserved for that, but Stiles detects the vitriol nonetheless. “Turns out he’s a psychopath.”\nWell. Some things never change. “Okay,” Stiles says. “Please elaborate before I jump to the worst possible conclusion.”\n“He’s a werewolf,” Lydia says promptly. “And probably a serial killer. And he bit me.”\n“Oh good, that’s so much worse than I imagined,” Stiles says weakly, peering around the door to make sure Rina’s still coloring away. She is, humming happily, utterly oblivious. Sometimes Stiles envies those without the inclination toward magic. “How can I help?”\nGoddess bless her, Lydia gets right to the point. “I need you to help me bury the body.”\n*\nAt times like these, Stiles thanks the goddess for Scott McCall. “I really appreciate you taking her last minute like this,” Stiles says, handing him Rina’s overnight bag. “Lydia’s having, um, an emergency. My kind of emergency.”\nRina’s not paying attention, already camped out on the couch with Joey, watching cartoons.\n“It’s the least I can do,” Scott assures him with a smile. “I’ll drop her off Sunday night?”\nStiles hugs him. Scott is the best. Fuck.\nAnd then Stiles walks home.\nHe knows more about werewolves now than he did six months ago, but he still takes the time to dig in Aunt Kath’s library for anything about killing them, which he never needed with Scott. Not that he doesn’t trust Lydia, because when she says she’s done something, you can bet your ass the thing is done. Just in case there’s something he needs to know.\nWolfsbane, he finds, and fire, and bisection (ew) are all handy ways to rid yourself of a werewolf problem. He wonders which method Lydia employed. Probably a combination of the three; she’s always been thorough.\nWhen he hears her sensible Toyota pull into the driveway, he marks his page with a feather and goes to greet her at the door.\nLydia doesn’t so much hug him as jump him; it’s a full-on arms-and-legs experience, which tells Stiles everything he needs to know about her state of mind. He hugs her back just as tightly, breathes in the scent of her: cinnamon and mint and the tang of copper, an undercurrent of ash. She has a white bandage set just over her collarbone, just darkening to pink in the middle.\nThen he sets her down. They both look up at the same time; the sun’s almost down. There’s a half-moon tonight. “We should wait until it’s dark,” Stiles says with a glance toward the trunk of her car. “Come on. I’ll pour you a drink.”\nHe has the feeling they’re both going to need it.\n“We met at a faculty event,” Lydia tells him over a glass of pinot noir. She has her legs tucked under her on the sofa. Anyone would think she were completely at ease. Only Stiles knows better. “He said he was a visiting professor of world literatures. Paul Hayward. We talked about Beowulf, the epic of Gilgamesh. The Iliad.”\nNever let it be said that Lydia Martin is easily fooled. “He kept up,” Stiles presumes aloud.\n“He was brilliant,” she says flatly. “Creative. Insightful. We’d get in an argument over something and I’d find myself questioning every assertion I made.”\nStiles understands that when Lydia says this, she means the sex was phenomenal. “Okay.”\nShe thins her lips. “Then, a few days later, one of the chemistry associates turned up dead.”\nOh, so they’re at the serial killer part already. Goody.\nLydia swirls her wine, another nervous tell. “I didn’t think anything of it at first. Why would it be related? It was just an animal attack. Except then it happened again, to an arson investigator a few towns over. A few days later, in the same town, a house burned down with its owner inside. So I checked. Harris, the chemistry associate? He was originally from the same town. And then….”\nStiles sets his glass down and waits.\n“And then I got that itch.” Lydia hates that feeling. Stiles understands that it doesn’t come to her the way it comes to him, the prompting to turn right, turn left, get watermelon instead of strawberries. Instead it’s an invasive nag at the back of her mind, a compulsion. “So I looked up Paul Hayward online. Guess whose picture didn’t match his Facebook profile.”\n“I knew I should’ve made you keep your Facebook account,” Stiles says grimly. “How’d you find out he was a werewolf?”\n“Looking into the arson. The woman who died, Kate Argent—you know, the hunting family—I followed her back a couple years. A while ago there was another fire in the same town, killing eleven people. It wasn’t hard to put two and two together and come up with lycanthropic revenge killing.”\nEspecially after Stiles already worked out lycanthropy was an actual possibility. He looks up and out the window; it’s probably dark enough to haul a body out of the trunk now. “Are you sure he’s properly dead?”\n“I’m not sure a live person could smell like that,” Lydia says with a delicate wrinkle of her nose.\nStiles sighs. “Awesome. I’ll get the shovels.”\n*\nIt’s not like this is the first time Stiles and Lydia have helped each other hide the bodies. It’s just that this is the first time that meant hiding an actual body.\nThere was the time in second grade when Lydia broke Aunt Kath’s crystal vase, the time Stiles accidentally cursed Jimmy in the grade above them to ribbit like a frog for a week, the time they released goats in the school as their senior prank. The time Lydia got roofied at a party and Stiles cursed the guy who’d drugged her with genital herpes (not that the aunts would have minded had they found out about that one, but Lydia didn’t want anyone to know how close it had been). The time seventeen-year-old Stiles flirted his way out of a speeding ticket.\nCovering that up took a lot less backbreaking physical labor.\n“Are you sure we shouldn’t burn the body?” Stiles whines. He’s getting a blister on his thumb despite the gardening gloves, and he’s already thinking longingly of trading in his herbal remedies for a vat of Tiger Balm. He wants to bathe in it.\n“That will attract attention,” Lydia points out sensibly, wiping a hand over her forehead. “Besides, how do you think I killed him? Come on, put your back into it.”\nAt this point Stiles is just hoping that he’ll be able to get his back out of it once they’re done.\nThe sky has been threatening rain again all day, but it holds off until they’ve finished covering the tarpaulin-wrapped body.\nStiles strips his gloves off in disgust, exhausted. “I need a fucking drink.”\nLydia huffs and agrees. “Make mine a double.”\nAs penance for destroying Stiles’s body, Lydia is in charge of the drinks. Stiles flops down at the kitchen table and breathes deeply, toying with the idea of brewing an herbal tea, but he can’t make himself get up. Lydia returns quickly anyway, with a bottle and two glasses and a bowl of ice.\n“Since when do you drink whiskey? Not that I’m complaining.”\n“Since I just broke three nails burying a deadbeat werewolf who tried to turn me in my moms’ backyard.” Lydia scoops the glasses through the ice and pours them each a generous measure. “If this is an acquired taste, I’m acquiring it.”\n“Well.” Stiles lifts his glass. “Cheers to that.”\n*\nStiles doesn’t so much wake up the next morning as suddenly cease to be unconscious and immediately regret it.\nWhat in the name of the goddess was he thinking? He hurts everywhere. Including his head, because wow, hello, hangover. Stiles has just the thing for that, provided he can get down the stairs without puking.\nAt least he thought to shower last night so he doesn’t have to smell himself on top of everything else. That would be too much.\nBy the time he stumbles downstairs, Lydia’s already awake and making coffee.\n“Goddess bless you,” Stiles says, flopping into a seat at the kitchen table.\nLydia starts a little, then turns around. “You look chipper.”\n“Fuck you, sis. How are you not hungover?”\n“Some of us can hold our liquor,” she says loftily, but she hands over a mug, so Stiles doesn’t curse her on the spot. “Unlike lesser mortals.”\n“This lesser mortal literally helped you bury a body last night,” Stiles points out, inhaling the aroma of delicious caffeine. Ah, Lydia’s coffee: the only thing she brews better than he does. He takes a sip. It packs a stronger punch than normal, but maybe she’s been dialing up the coffee at Stanford. It wouldn’t surprise him. “Can I take a look?” he asks, gesturing to her collar bone and the bandage peeking out from the neck of her T-shirt. “I thought werewolf bites either turned you or killed you.”\n“Only if you’re bitten by an alpha,” Lydia says, sliding onto the bench seat beside him. “And only if you’re human.”\n“I guess you’re safe either way.” Stiles shifts the shirt collar to one side and peels back the medical adhesive to check out the wound. He’s really glad he’s sitting down for it. “Uh.” Stiles closes his eyes and takes a deep breath, then makes himself look again.\nIt’s still there, livid red, a clear U shape, shallower along the sides and deep at the corners. The skin feels hot to the touch, and it’s a little swollen—infection. Not good.\nStiles takes another deep breath, then pushes at Lydia’s shoulder to turn her around, because—yep. A matching, shallower wound on the back of her shoulder. “Holy… how big was this guy when he shifted? Lydia, how the hell did you get away, never mind overpower him?”\n“I didn’t confront him unprepared,” she says, like such a thing is outside the realm of possibility. “I had a Molotov cocktail handy. He burned to death just like his family.”\nStiles makes a face. “Poetic.” He’s really glad he never looked at the body inside the tarp. “Come on, I’ll make you something for the bite.”\nBut Lydia shakes her head. “Food first. After last night, it’s the least I can do.”\nStiles isn’t going to argue with that. He slumps at the table nursing his coffee while Lydia cooks: eggs, bacon, hash browns. Stiles’s stomach grumbles. It’s too soon to tell if it’s in warning or hope.\nThen something else grumbles, and Stiles sits straight up so fast he almost spills his coffee. Someone just pulled into the driveway. Someone with a hell of an engine, from the sound of things. Lydia must not hear it over the sound of the snapping bacon, because she startles when the doorbell rings.\n“I’ll get it,” Stiles assures her. It’s not like half the town hasn’t seen him in his pj’s by this point anyway. He’s never cared much for appearances.\nOf course, he regrets every life decision that’s led to him opening the door with bedhead in last night’s pajamas as soon as he sees the guy on the other side.\nBecause the man standing on Stiles’s front porch is easily the most attractive person Stiles has ever laid eyes on. Cheekbones like cut glass. Stubble so even you could sand a canoe. Dark hair, straight nose, eyes like a watercolor painting. He looks kinda pissed. Stiles thinks, Damn, I wish I’d put on real pants.\nThen he gets a hit of the guy’s aura and makes time for even more regrets.\nBefore he even knows it’s a tell he’s stepping back, already calling on his spark, letting power gather at his fingertips, though Goddess knows he can’t pull enough to put down a werewolf. Not one this powerful. The taste of all that strength is fresh, simmering just beneath the surface.\nStiles can see the second the guy figures out he’s a witch. His nostrils twitch and his eyes flash red.\n\nBut he doesn’t look angry anymore. In fact, he just seems… surprised. “Uh,” he says as his eyes fade back to green-brown. “Hi.”\nStiles lets the magic dissipate. It takes the last of his headache with it, and he curses himself for not thinking of that earlier. A little adrenaline rush goes a long way. “Hi,” he parrots. “Um. So you’re a werewolf.”\nThe man nods. “And you’re a mage.”\nWith a snort, Stiles corrects the word. “A witch. I’m far too young to be a mage.”\nThat earns him a curious look, but the guy doesn’t ask for elaboration. “My name is Derek Hale. I’m looking for Dr. Martin.”\nOf course. A ridiculously hot werewolf shows up on Stiles’s doorstep. Who else would he be there for? “Well, you’d better come in, then,” he says. He’s wary, but he doesn’t actually sense any malicious intent. “Have you eaten breakfast?”\n*\nAs it turns out, Goddess isn’t so cruel as Stiles originally believed: Derek’s here on a fact-finding mission, not to be next in line to warm Lydia’s bed.\nLydia gives them a startled look when they enter the kitchen, but she doesn’t fuss at Stiles for bringing someone in when she’s less than perfectly turned out, so Stiles takes it as a win. “Derek Hale, meet my sister, Dr. Lydia Martin. Lydia, this is Derek Hale, werewolf.”\nA beat passes. “Pleasure,” Lydia says finally, polite but cool. Then: “Stiles, plates?”\nRight. If she’s cooking and they have guests, he’d better set the table. “So, Derek, what brings you to Half Moon Bay?” he asks. “Well, Lydia, obviously, but—”\n“I’m looking for someone,” Derek says. He pulls a smartphone out of his pocket and flicks the screen a couple times. “This man.”\nStiles rattles the cutlery down onto the table and peers at it: Stanford’s faculty web site, a picture of a party of some kind. There are five people in the picture with Lydia, but it’s the man with his hand on her waist that catches Stiles’s attention: tall, fit, handsome, obvious charisma.\nScott’s mentioned before that he can hear heartbeats, and Stiles does his best to keep his steady. Holy shit. This guy is looking for the werewolf Lydia killed. This could go badly. “Well, I haven’t seen him.” At least that’s not a lie.\nDerek makes a noise of frustration. “I know he’s dead. And I’m not… upset about that. Exactly.”\nApparently he already suspects Lydia might be complicit in that. Interesting. Stiles wonders if he can smell guilt.\nThen he wonders if he can smell other things, and decides to hope he mostly smells bacon.\nStiles takes the phone and brings it to Lydia, who glances at it. Even to him, her expression and posture betray very little. “Oh, the sociopath. We dated.”\nMincing words has never been her forte.\nStiles hands Derek his phone back, and Derek takes it with a nod of thanks. “So you know, then. That he was… damaged.”\n“If by that you mean he went on a killing spree, then yes. I’m aware.”\nHoo boy. Shots fired. Stiles clears his throat. “Derek. Coffee?”\n“I… yes,” he says, drawing his eyebrows together in obvious consternation. “Thank you.”\nStiles turns back to the cupboards and pulls down his favorite mug, the one that used to be his father’s, with the sheriff’s badge on the side. He fills it automatically, adds cream and sugar, just so it turns caramel, and then offers it to Derek.\nWho accepts it with a look of even greater consternation. Well, there’s no pleasing some people. Still, he drinks it, so. “My uncle… he was severely burned in a fire almost twenty years ago. Werewolves heal, but sometimes not for a long time, and not from things like this. The fire… it killed our whole family except for three of us. My uncle Peter, my sister Laura, and me.”\nWell there’s a boner killer. “Jesus,” Stiles mutters. That must be the fire Lydia mentioned last night, the one where eleven people died. “I’m sorry.”\nDerek continues without acknowledging him, cupping his hands around his mug. “My sister became the alpha after that. It felt wrong to stay when we knew we would be hunted, so we put Peter in a long-term care facility and moved to New York.\n“And then, a few months ago, Peter disappeared.”\nStiles finds himself listening with rapt attention. “He healed?”\n“We didn’t know,” Derek says. “Laura came to find out, and then she disappeared too.”\nA chill shakes down Stiles’s spine. He knows from Derek’s tone of voice what he suspects that means. “And then the killings started,” he guesses.\nLooking haunted, Derek nods. “I know he killed the hunter who set the fire. Her accomplices too.”\nAt Lydia’s gesture, Stiles stands again and starts plating up the food. “How do you know he’s dead?”\nFor a moment the only sounds are the hiss and spit of the eggs finishing frying in bacon fat and the scrape of the spatula in the hash browns. Then Derek says, “When my sister died, I should’ve become the alpha. The only reason I wouldn’t have is if another werewolf killed her. And Peter’s face in those pictures—he’d have needed the alpha powers to heal that completely. He didn’t have any children, so when he died….”\nStiles looks over his shoulder in time to see him shrug. “I’m the alpha now,” he finishes, his eyes flashing red.\nSo that’s what that means.\n“I’m not looking for trouble,” Derek continues after another sip of coffee. He looks at it again like he can’t quite believe it exists, but seriously, it’s just coffee. It’s not even Lydia’s best work. “I just want to know what happened.”\nStiles finishes plating Derek’s eggs and glances at Lydia. Her kill, her call.\n“We’ll help you figure it out,” Lydia offers after meeting Stiles’s eyes. Apparently they’re not telling the whole truth, but Stiles is happy enough they’re not sending him away. He seems lonely.\n“In the meantime, I am nursing a serious hangover and I need my grease fix,” Stiles says brightly, crossing the kitchen with a plate in each hand. He slides Derek his first. “Bon appetit.”\nFor a second Derek stares at his plate like Stiles conjured it out of nothing. Then he gingerly picks up a fork. “Thanks,” he says gruffly.\nStiles decides not to ask and picks up a different conversation thread instead. “So you can be born like this? A werewolf, I mean.”\nDerek finishes a bite of hash browns before nodding. “It can be inherited. It isn’t always. My little brother was human.”\nUgh, Stiles is the worst at casual conversation. Well, given that what little he knows of Derek surpasses Shakespearean tragedy in nature, maybe it’s not completely his fault that every avenue of conversation leads to grief. He saws determinedly at his bacon. “See, because I have this friend who got bitten a couple months ago, and, well, everything he’s learned about being a werewolf, he’s learned from me.” He shrugs and shoves the bacon in his mouth. “And I don’t know dick about being a werewolf.”\nDerek sets down his fork. “Why doesn’t he ask his alpha?”\n“Dude, there is no alpha. Scott is Little Orphan Werewolf. A bite-and-run.”\nFrowning, Derek pauses with his hand halfway to his coffee mug. “And he hasn’t hurt anyone?”\n“What? No. Why would he hurt anyone? Scott’s, like, an actual puppy. He has a wife and kid. Hell, he’s babysitting my kid.”\n“Stiles,” Lydia says.\nRight. He probably shouldn’t give too much away lest Derek ask why Stiles’s kid needed a babysitter.\nThen Lydia rolls her eyes. “Don’t talk with your mouth full.”\nOh. “Sorry.” He shoots Derek an apologetic wince. “I was raised right, I promise, I just tend to let my manners lapse since the only people I eat with are my aunts, my best friend, and my former best friend’s five-year-old. And I think Aunt Hestia’s eyesight is going.”\n“It’s a long story,” Lydia says smoothly when Derek just stares.\n“The point of it being, we’ll help you figuring what went down with your uncle, but if you could give Scott some pointers in the mean time, that would be awesome. There’s even a nice inn in town, by the water. Good rates if you’re staying longer than a week.”\nPlease let him want to stay longer than a week. Stiles’s seduction game is hella rusty.\nAfter a beat, Derek shrugs. “I don’t have anywhere to be.”\nAnd that’s just sad. Stiles shovels in a forkful of egg before it can get any colder and then grabs Derek’s empty coffee mug. Something tells him the guy drove all night.\n“Awesome!” Stiles enthuses, reaching for the sugar. “We can head over after breakfast.”\nHe gets no argument from Derek.\n*\nScott, though. Scott is a different story.\nHe opens the door with Rina on his shoulders, a broad smile on his face, and Joey behind him holding a soccer ball. “Stiles! Hey. We were just about to hit the park.” Then he glances at Derek as if he’s about to ask who’s your friend, but the words don’t get out because his eyes flash yellow and his fangs come out and it’s altogether a good thing neither Rina nor Joey can see his face.\n“Scott! Buddy. This is Derek. He was in the neighborhood and I thought you might have some questions for him.” Stiles keeps his gaze fixed on Scott’s even though he’s dying to make eye contact with Rina. He cannot have two werewolves duking it out on Scott’s front lawn when his kid could get caught in the crossfire.\nFortunately, Scott gets control of himself quickly and reaches up to hand Rina over. Stiles takes her gratefully with a smacking kiss on the cheek, and doesn’t put her down even though she’s really too big to be held.\nScott and Derek stare intensely at each other for a minute. “How do you know he’s not the one who did this to me?”\n“’Cause he’s been an alpha for all of five minutes.” It’s pretty obvious. The guy is still walking funny, like he doesn’t know what to do with the twenty pounds of muscle he probably put on in the past few days. “Come on, I’ll play soccer with the kids and you and Derek can chat. Can’t hurt, right?”\nWhen no answer is forthcoming, he asks Rina. “You’ll play soccer with me, won’t you?”\n“Me’n Joey are gonna kick your butt, Uncle Stiles,” she informs him with a bright smile.\n“Joey and I,” Stiles corrects, winking at Derek over her shoulder.\nDerek stares at him. Stiles is starting to believe it’s just a thing he does, like he’s forgotten how to be around people.\n“Joey and I are gonna kick your butt,” Rina repeats dutifully.\n“We’ll see about that.” Stiles sets her down and takes her hand. “You guys coming or what?”\nIn the end, Joey and Rina keep Stiles running for almost an hour while Scott and Derek chat quietly on a bench nearby. The ground is still wet from the rain yesterday, and all three of them fall more than once and get up again with mud and grass smeared all over. They look more like guerilla fighters than soccer players by the time Joey’s breathing gets labored and he has to stop.\nBoth Derek and Scott get up from the bench, but Stiles gets there first, sliding to his knees in the muck and coaxing him to get out his inhaler. “Just like the doctor taught you, Joey, come on,” he says encouragingly, calling a spark to his fingertips and splaying his right hand on Joey’s collarbone.\nThis is the problem with magic, Stiles thinks as Scott and Derek come to a halt on either side of him. Rina steps up next to Joey and takes his free hand as he breathes from his inhaler. Stiles can help, he can make balms and teas and ointments and poultices and potions. He can channel relaxation through his fingertips as he’s doing now, smoothing out the muscles of Joey’s airways.\nBut it’s all temporary. He can’t cure a chronic condition. He learned that the hard way with Erica’s epilepsy. Make it more manageable, yes. Speed up her recovery, yes. But a cure? No. He could cure himself, maybe, or teach another spark carrier to cure herself. But he’s helpless when it comes to humans. There’s a limit to what he can do.\nAfter a few tense moments, Joey relaxes and takes his inhaler away from his mouth.\n“You okay, buddy?” Scott asks. He has a way of saying it that Stiles envies, somehow conveying that it’s okay not to be okay without implying that he isn’t.\n“Maybe that’s enough excitement for one day,” Stiles says wryly, getting to his feet. He stumbles a little in the slick mud and Derek steadies his elbow before he even realizes he’s falling. “You want me to take Rina home?”\nScott looks at Joey. “Up to you, little man.”\nIn turn, Joey looks at Rina. “Is it okay if we just do a puzzle?”\nRina says, “I like puzzles.”\nBless the three of them.\n“But can we have lunch first?” she adds.\nScott grins and sweeps her up onto his shoulders again. “Yeah, we can eat first. French toast? Pancakes? Mac and cheese?”\n“Beans and wieners?” Rina says hopefully.\n“Beans and wieners it is. That okay with you, Joey?”\nJoey picks up the ball. “Sure.”\nAnd just like that, everything’s settled again. “Thanks,” Stiles tells Scott back at his house, as the kids get inside to wash up. Derek waits by his car—he insisted on driving, and it’s every bit as ridiculous as Stiles imagined. He hopes Derek’s not compensating for something. “I owe you for this.” He doesn’t just mean babysitting money.\n“You can watch Joey for a weekend when Kira finally breaks this case,” Scott says with a knowing smirk.\nOh God. Scott thinks—“I didn’t ask you to watch her so I could have an illicit sex weekend,” Stiles hisses, mortified. There’s a muffled noise from the driveway and he remembers belatedly that Derek can hear him. Fuck. “I didn’t even know he was coming until he got here this morning. Lydia’s helping him look into some stuff with his uncle. Guy was bugfuck.”\n“Hey, when opportunity knocks and it looks like that,” Scott says. His eyebrows fill in the rest. “Just make sure he knows the score, okay?”\n“Thanks for that.” Stiles sighs. He always makes sure his partners know he can’t and won’t get attached. It was fun for a while in high school, the novelty of it, but now he just wishes he could have something normal. “I’ll pick Rina up tomorrow morning. Sound good?”\n“No hurry,” Scott tells him.\n“Call me if Joey has another attack.”\nAnd then he’s back down the front steps, standing around awkwardly as he and Derek decide whether they’re going to pretend Derek didn’t just overhear Scott suggesting they hook up for the weekend. Awkward. Stiles knew he was rusty, but this is ridiculous.\nFinally Derek says, “Mind showing me where that inn is?” and Stiles doesn’t know if that’s a line or not, but it breaks the tension.\n“Sure.” He sidles around to the passenger side and slips in. “We need to head back the way we came.”\nDerek puts the car in gear, and a few moments pass in silence before Stiles gathers the nerve to say, “Sorry about Scott’s awkward assumptions.”\n“It’s fine. Do you often spend the weekend with total strangers?”\n“Not as often as I’d like,” Stiles admits, injecting just enough sarcasm into his voice to be cute rather than creepy.\nDerek snorts.\n“It’s kind of a long story,” Stiles says when Derek doesn’t say anything else. “I don’t really date, so.”\n“I get it,” is the gruff answer. “Me neither.”\nNow that’s interesting. Stiles can’t help looking at him at that, studying the set of his jaw, the way his fingers caress the steering wheel. Something tells him it’s a deliberate display of nonchalance—that he’s white-knuckling it underneath. And Stiles is never wrong about these things. “Supernatural reasons or crippling emotional trauma?”\nThat earns him something closer to a laugh. “The latter. You?”\n“Family curse,” Stiles says ruefully, rubbing at his chest, over his heart. “So, a little of both. Turn here, the inn’s down by the water.”\nDerek pulls the car into the lot a minute later. “You want to wait here, or…?”\nIf Stiles goes in…. He probably shouldn’t go in. “I’ll stay.” Marin, the proprietor, has never liked Stiles much, probably since Stiles’s dad figured out her girlfriend was living under an assumed identity and was wanted for murder in three states.\nHalf Moon Bay isn’t much of a sleepy little town sometimes, between the creatures of the night and Stiles’s witchiness.\nBefore long, Derek emerges from the front office, expression cloudy. That doesn’t look good. “They’re booked up.”\nOf course they are. Oh well. Maybe it’s a sign. “Never mind. We have like eight bedrooms anyway; you can stay with us.” If he’s going to be helping Scott and they’re going to be helping him, that only makes sense. As long as he doesn’t ask about the seven-foot-long recently dug-up plot of earth in the backyard, they’re totally safe.\nDerek shifts guiltily. “Are you sure? I could find another place—”\n“Not in Half Moon Bay,” Stiles tells him with a shake of his head. Seriously, it’s a town of twelve thousand people; it’s a miracle they have one inn. “Come on, I’ll direct you back home and we’ll get you settled in.” He glances meaningfully into the backseat, where they threw a lot of detritus before Stiles was able to sit down. There’s a couple shirts and a pair of jeans back there too, some boots. “The guest room has an en suite bath.”\nAt that, Derek gives him a small smile. It’s a nice, comfortable smile. Stiles could do with seeing more of it. “Sold.”\n*\nStiles has become accustomed to his magic and his libido not getting along. His whole life, he’s gotten mysterious urges and prompts to do this thing or that, with the result that the shoes he wanted were half off when he went to the mall, or the ladies at the church the next town over were having their bimonthly pieroghi sale when he went over to pick up herb supplies, or he just so happened to tune in to the radio in time to win a pair of concert tickets.\nNever once in his life has his magic helped him get laid. In fact, it’s usually strangely silent for a day or two after his latest encounter. Stiles figures it’s his magic reacting with Stiles sleeping with someone other than the impossible person he’s cursed himself to fall in love with, and he’s fine with it. Goddess gave him two hands and a vivid imagination.\nBut when he’s finished showing Derek around the house, including a detour to the laundry room because apparently the entire trunk of Derek’s car was filled with worn clothing, Stiles gets that nudge.\nAnd, well. It’s not the worst idea he’s ever had. Lydia’s out—probably shopping, so she won’t be back for hours. He and Derek have the whole house to themselves. If ever there were a time to take advantage….\n“It’s just the three of you?” Derek asks when they’re back in the kitchen. It’s long past lunchtime, and big breakfasts always make Stiles get hungry sooner. “In this house?”\n“Well, four,” Stiles corrects, grabbing more or less the entire deli drawer and depositing it on the counter for sandwich-making. “Lydia has an apartment in the city, but the aunts live here; they’re on a romantic retreat. I didn’t ask.”\nDerek finishes washing his hands and sticks a couple slices of bread in the toaster. “Why this house, then? It’s kind of….”\n“A lot for four people?” Stiles says. “Yeah. Well, it’s a family heirloom, I guess. And it has the greenhouse, which I need for work. Lydia grew up here; it’s been my home ever since my dad died. It’ll be Rina’s someday, probably. Lydia doesn’t want kids.”\nThere’s a pause as they wait for the bread to toast. Finally Derek says, “What happened to her parents? Rina’s, I mean.”\nStiles runs a hand through his hair. “Life. Boyd—his first name was Vernon, but we all called him by his last name—he was in a car accident. Somebody else’s DWI.” That was hard enough. For days Stiles was so sure Erica was going to ask him to bring Boyd back, and he’d have to say no, and their friendship would be ruined. But she never asked.\nStiles wouldn’t have done it for Boyd. But he thought about it when Erica passed, and the guilt compounded with the grief almost ate him alive. “Erica was an epileptic. I could help her manage the symptoms well enough, but I couldn’t cure her. She went out of town for work and developed status epilepticus. She seized for twenty minutes. The neurological damage….”\nThe toast pops. Neither of them makes a move to touch it for a minute, and then Stiles shakes himself and reaches for the plates.\n“Sorry,” Derek says belatedly. “You’re good with Rina, though.”\nStiles smiles and reaches for the Dijon mustard. “Aunt Hestia says it’s because I never grew up.”\nDerek shoots him a shy smile. “I don’t know. You look pretty grown-up to me.” He gives Stiles an almost subtle once-over, but he’s not as smooth as he thinks; the tips of his ears go bright red.\nStiles licks suddenly dry lips. “What would you say to postponing lunch for an hour?”\nThey don’t even make it up the stairs before they’re kissing, tugging at each other’s shirts, biting at each other’s mouths. Derek pins Stiles up against the wall on the first landing, his hands hot on Stiles’s back, and Stiles lets him, tilts his head back, fists his fingers in Derek’s hair. Between them, magic sparks, crawling up Stiles’s spine, crackling on his fingertips, pooling in his groin.\nWhen Derek bites at his neck with human teeth, Stiles shoves him away. “Bedroom,” he says definitively. “Now.”\nDerek doesn’t need to be told twice. He practically drags Stiles up the last few steps, then shoves Stiles ahead of him into Stiles’s bedroom. It wasn’t on the tour, so he must be going on smell, which should be weird but isn’t. Stiles allows himself to be shoved, waits for Derek to close the door behind him. Then he pounces, gets his arms around Derek’s shoulders and his legs around Derek’s waist. On a human it might be risky, but Stiles has seen Scott lift the front end of a Toyota parked on his street to get at the tennis ball that rolled underneath it. Derek can take it.\nAnd he does—Derek catches him with one hand on his back and the other on his ass, and his mouth is back on Stiles’s before Stiles has time to catch his breath.\nStiles has enough time to think, Holy shit, werewolves, before he’s tearing Derek’s shirt over his head as Derek deposits him on the bed on his back. He hardly gets a second to admire the view before Derek returns the favor. Stiles hears the distinctive sound of seams ripping as his T-shirt goes the way of the dodo. Then suddenly he has Derek’s hips between his legs, Derek’s mouth on his neck, Derek’s thumbs skating down from his nipples to rest in the grooves of his hips.\nStiles approves. Stiles’s magic approves. Stiles’s dick definitely approves, if he can judge by the way it’s trying to escape his muddy jeans. “Stop with the hickeys and get your clothes off already,” Stiles gasps, shoving Derek away from him with his knees. He needs Derek to be Naked. Capital N.\nDerek bites at Stiles’s collarbone and unbuttons Stiles’s pants one-handed. As far as compromises go, it’s pretty weak, but Stiles will take it because it means—\nDerek wraps his hand around Stiles’s dick. Bucking into the touch, Stiles scrabbles at the sheets, at Derek’s shoulders, at the front of Derek’s jeans. Everything is in the way.\nFinally the tension between them gets to be too much and Stiles pushes up with the power of his magic backing him up. Derek lands flat on his back beside him on the bed, and Stiles shoves his own pants and boxers off while Derek’s still working out what the hell just happened. Before he can regain his bearings, Stiles straddles his waist. It’s the only way to avoid being distracted by the urge to count his abdominal muscles. “Seriously. Can I take your pants off?” He punctuates the question with a thrust of his ass against Derek’s cock. “Because we can do this with them on, but it’s nowhere near as satisfying. Just my personal opinion.”\nFor a second Derek just stares at him. Maybe he’s been struck blind and dumb by the sight of Stiles’s pasty body and surprisingly hairy belly. Then he shakes it off and flips them again, and then they’re both naked, and the sticky velvet rush of their dicks not-quite-sliding together makes Stiles’s eyes roll back in his head.\nStiles chokes on a moan and reaches down to get a hand on Derek’s cock, because if he can’t see it he’s damn well gonna touch it. It’s uncut, moisture pooling at the tip, and substantially more than a handful. Stiles wants it in him five minutes ago.\nAs Derek licks across his collarbone, thrusting his thigh between Stiles’s legs so he has something to rut against, Stiles gathers enough brain cells to ask, “How do you feel about fucking me?”\nDerek’s suddenly got very sharp teeth extremely close to Stiles’s jugular. Apparently Stiles’s danger reactions are all screwed to hell, because that just makes his dick pulse out a little puddle of precome against Derek’s leg.\n“Gonna take that as a ‘yes please,’” he says over the frantic beating of his own heart. “Lube and condoms in the drawer.”\nWhen Derek sits up to grab them, Stiles finally gets to take advantage of the view. And what a view.\nAs Erica would have said, Derek has shoulders for throwing his legs over. It’s a wonder Stiles couldn’t actually hear his shirt crying from the strain his biceps were putting on it earlier. His forearms are thick and corded. Stiles has never seen a chest like that, or that many abs, wow. He’s not as hairy as Stiles would have expected for a werewolf. Is that a racist expectation?\nStiles doesn’t have time to decide because he’s too busy looking at the dick in his hand. It’s exactly as big as it feels. Fuck, he’s gonna be sore tomorrow. He can’t wait.\nHe smears his thumb through the fluid at the tip as Derek slams the drawer closed and drops a condom next to his head.\nDerek swears. “How do you—?”\nHonestly, Stiles is tempted to ask Derek to pick him up and fuck him against the wall, but he feels like that’s the kind of thing he should stretch his hamstrings for first. Instead he disentangles his legs from Derek’s and gets on his hands and knees. “This work for you?”\n“I think I’ll manage,” Derek says, but the hoarseness of his voice undermines his sass. He slides a palm down Stiles’s right cheek before brushing his thumb over his hole. “You use the rest of the stuff in there often?”\nWhoops. Stiles doesn’t usually take his one-night stands home with him. Oh well. From the erection poking him in the thigh, Derek’s not offended by his sex toy collection. “Often enough,” Stiles says, meaning whenever I have a free half hour and don’t need to spend it sleeping. He’s about to open his mouth again to find out why Derek asked, but then Derek presses two slick fingers against his hole and slides them right in and he answers his own question.\n“Hnng,” Stiles says, dropping down to his elbows. Goddess, it’s been a while. Before he can offer a word of advice on locating his prostate, Derek beats him to it. Stiles feels the pleasure in his knees, for fuck’s sake. “You don’t fuck around.”\n“Don’t I?” Derek says, sliding in another finger. Stiles clenches and releases and wonders who put stars in his bedroom.\n“Oh my God, put the condom on and fuck me, please. I am not above begging if that’s what you’re into.”\nDerek removes his fingers from Stiles’s ass and there’s the unmistakable crinkle of condom foil. “Maybe next time,” he says, sounding a little strangled, and then—\n“Fuuuuuuck,” Stiles groans as his spine liquefies and his face tries to melt into his pillow. He doesn’t even have time to correct Derek that this is a one-time thing, because he’s too busy curling his hands in the sheets to try to ground himself. His whole body wants to float away.\nDerek puts his hands on Stiles’s hips—just to hold him still as he pulls out again, apparently, and that shouldn’t be so good, but Stiles couldn’t move if his life depended on it and holy fuck it’s hot like burning. If he could just—“A little shallower,” Stiles commands breathlessly, and Derek pauses midthrust and tilts Stiles’s hips just so.\nOh fuck, yep, that’s—even Stiles’s elbows aren’t gonna be able to hold him up in a minute. Magic writhes across his skin like St. Elmo’s fire, burning over his nipples, curling around his balls. Derek doesn’t give him time to adjust, not that Stiles needs it. He just keeps up the steady thrusts, tipping Stiles’s hips up into each one so he’s basically hammering Stiles’s prostate.\nStiles figured out he didn’t actually need to touch his dick to come during anal his first year of college, when he stopped settling for bad sex. Now? Now he’s just hoping he doesn’t come within the next twelve seconds and embarrass himself completely. Actually, scratch that—he’ll be lucky if his brain doesn’t melt and leak out his ears, what with the magic overload.\nFuck. Stiles’s elbows finally give up and he slides down flat against the mattress. Derek doesn’t even pause. He shuffles farther onto the bed and lifts Stiles’s hips back to the correct angle and keeps going, relentless.\nStiles makes a mental note to send Kira a congratulatory card if this is what werewolves are like in the sack. He doesn’t even have a blasphemy strong enough for this situation.\nHe should probably warn Derek that he’s gonna come and then pass out.\nSparks crackle at his fingertips and his dick leaks steadily against the sheet as Derek fucks him. “Derek,” he manages in a whisper. “Derek I’m gonna fuckin’ come and I might black out a little after so don’t freak.”\n“What?” Derek says. The shock must rob him of some of his control, because he thrusts extra hard, and that’s all Stiles needs. Magic arcs from his navel to the hollow of his throat and he arches his neck as he comes, every muscle and nerve in his body alive with pleasure.\nTo his surprise, Stiles doesn’t lose consciousness, just control of his motor functions. He’s still shuddering with aftershocks when Derek makes a punched-out noise behind him and digs his fingernails into the flesh of Stiles’s hips and Stiles is going to have bruises later but—\nDerek trembles to a stop with his forehead pressed between Stiles’s shoulder blades.\n“Am I dead?” Stiles croaks when his brain finishes rebooting.\n“Heart’s still beating,” Derek mumbles into his skin. “Really fuckin’ fast.”\n“Thanks for the affirmation,” Stiles pants. “Now get off me, please. You’re really warm and I’m basically a nuclear reactor of magic right now. I don’t wanna fry you.”\nDerek huffs but pulls out of him, and Stiles rolls to the side, throws open the window, and fires a lightning bolt into Rina’s sandbox.\nSilence behind him. Then Derek says, “Tell me that doesn’t happen every time you have sex.”\nStiles stares. The sandbox is steaming. When it clears, he can see the fulgurite that’s formed across the surface. “Nope,” he admits. “That’s new.”\nA beat. “Okay,” Derek says. “You still hungry?”\nStiles’s stomach rumbles. “Goddess yes.”\nThey eat standing up in the kitchen, holding their sandwiches over the counter, because they’re both too hungry to sit down. Stiles considers it the mark of a job well done.\nHe doesn’t last any longer than that before he needs a shower, though, and then he throws in a load of laundry for obvious reasons. Then, at something of a loss for things to do, he puts on a pair of ratty jeans and an old T-shirt to do some gardening.\nFirst, though, he digs the fulgurite out of the sandbox, because he is not explaining that one. It takes longer than he anticipated; the thing is three feet long and almost a foot in diameter in places. He probably needs to buy more sand.\n“Gonna keep it as a souvenir?” Derek asks from behind him.\nStartled, Stiles almost drops it. He looks over his shoulder, smiling wryly. “It’s a pretty good sex trophy, I have to admit. Maybe I should have it bronzed.”\n“It’d definitely make an interesting conversation piece.”\nStiles can only imagine. “Did you need something?” he asks. “I’m kind of a crappy host, so don’t be afraid to spell things out.”\n“What?” Derek says, obviously distracted. “No, I just….” He trails off, staring at a spot behind Stiles’s right shoulder, and oh fuck. He’s definitely looking at the recently turned-over ground where Stiles and Lydia buried his creepy uncle.\nStiles turns to follow his gaze, swallowing hard against panic, because he’s used to the one-night stand thing, sure, but he doesn’t usually lie to his one-night stands about being complicit in their family members’ disappearances. This is definitely the first time he himself has actually physically buried one of his partners’ familial relations. He feels like scum. Derek has every right to call him on it and be really pissed off and never speak to him again, which Stiles should be fine with since it was only a casual thing anyway—\nExcept instead of an obvious seven-foot plot of freshly turned-over dirt, the grave is a flowerbed of furiously blooming aconitum lycoctonum.\nLydia must have planted it, Stiles realizes. Probably not a bad idea—a grave-size grass-free area is always suspicious, and it has plenty of magical uses.\n“Yeah, that’s wolfsbane,” Stiles says with a grimace. “Sorry, I forgot about it.” Not really a lie since he didn’t know it was there in the first place. “I can pull it up if it’ll be a problem?”\nDerek shakes his head. “Just don’t put any in my food.”\n“Why would I do that? I like you. Besides, you agreed to answer Scott’s newbie werewolf questions. I owe you one.”\nDerek stares at him.\nStiles tries not to squirm. “Anyway, you came out here for a reason, right?”\n“Television,” Derek blurts.\nOkay, Stiles doesn’t know what that’s about. He blinks. “We have one?” he offers. “But it’s definitely inside. What about it?”\nBlushing, Derek scuffs his (bare) toe in the dirt. “I can’t get it to….”\nAh. “New to Netflix, huh?” Stiles says. He stands and brushes off his knees. Gardening can wait anyway. He hefts the fulgurite over his shoulder and gestures toward the house. “I’m gonna rock your world. Again! Seriously, Netflix is the best. Just don’t expect to do anything productive for the rest of the day.”\n“Darn, and I had so many plans,” Derek deadpans.\nStiles smirks at him and curses his policy on only sleeping with people once.\n*\nIn retrospect, Stiles could’ve been a little clearer about boundaries, because judging by Derek’s behavior, he didn’t really get the memo.\nIt’s not that he’s clingy.\nOkay, it is. He’s clingy. He clings like a fucking octopus, and he’s affectionate to boot, and he seems determined to be touching Stiles if at all possible. Stiles is going to tell him the score any minute now, except….\nGoddess. Except it’s really nice, okay? It’s nice to have Derek wrap his arms around him from behind while he’s chopping veggies for dinner. It’s nice to get a foot massage while introducing Derek to the glory that is Firefly. And Derek probably can’t even help the urge to rub his face against Stiles’s neck and shoulder every hour or two. After all, they’re sharing space and they’ve slept together recently; it’s probably just a wolfy instinct thing.\nAnd he seems so happy. It’s a complete one-eighty from this morning, when Derek brooded at his eggs and told what was basically the world’s saddest fucking life story. Taking that away from him now would be cruel.\nBesides, there’s no real reason Stiles can’t sleep with him again, right? He’s already cursed himself not to fall in love, so he’s safe on that front. By his own admission, Derek doesn’t do relationships either. If they fall into an arrangement where they happen to have really hot sex, who is it harming, really? No one, that’s who.\nWhen Lydia comes home, she takes in the two of them on the couch, the impressive array of hickeys on Stiles’s neck, the way the whole house is still charged with leftover sexual energy, and raises a Very Judgmental Eyebrow.\n“Like you have room to talk,” Stiles says before she can say anything. The words come out kind of slurred; it’s possible he’s a little stoned from foot massage endorphins. He didn’t know that was a thing. “At least Derek’s not a psychopath.”\n“Nice, Stiles.” She rolls her eyes. “Derek, you want to talk about your uncle?”\nDerek stops rubbing Stiles’s feet—dammit—and sits up straight. Oh well. It was nice while it lasted. He flicks Firefly off and puts on something else so Derek can finish watching later.\nHe’s mostly asleep by the time Derek returns from the kitchen and runs a hand through his hair. “Mmm,” Stiles says.\nDerek snorts. “You should go to bed.”\nAs comfortable as Stiles is right now, Derek is probably right. By morning, he will regret sleeping on the couch. But he’s sleepy and cozy and Derek is playing with his hair, so his incentive to move is pretty low. “Yeah,” he agrees without moving. “Just keep doing that.”\n*\nStiles wakes up the next morning in his own bed with no memory of how he got there. Come to think of it, he doesn’t remember putting the sheets back on it either. When he turns his head to the side, there’s a definite impression on the pillow beside his.\nSo he and Derek should definitely have a chat. But later.\nStiles rolls out of bed and into the shower, takes the time to shave off his scruff, and stumbles downstairs to the sounds of cartoons. It must be later than he thought, because Rina’s already dressed and camped out in front of the TV with a big bowl of bananas, oranges, and honeydew melon. She’s got yogurt at the corners of her mouth and a smile on her face. “Hi, Uncle Stiles.”\n“Hi, baby.” Stiles drops beside her on the couch and presses a kiss to her hair. “Uncle Scott drop you off?”\nShe nods. “He said Mr. Derek must have made you tired. Is that why you slept in?”\nDammit, Scott. Stiles should not have to field this kind of question from a five-year-old before he’s had his morning coffee. “Something like that,” he says wryly, thinking that he’s definitely going to have to talk to Derek about what’s okay in front of Rina. So far she hasn’t asked him any awkward questions like why doesn’t he have someone like her mom had her dad or Aunt Hestia and Aunt Kath have each other, and he’s not honestly sure what he’d say. Once upon a time, Uncle Stiles’s great-great-grand-douchedaddy hit his wife one too many times and she left him, so he cursed all his sons never to fall in love, and if they did, their lovers would die to punish them for their disobedience. Seriously, what an asshole. He was such a misogynist he forgot to curse his daughters too, though ultimately that worked in the women’s favor. “What are you watching?”\n“Mr. Derek put it on. Did you know he liked cartoons?”\n“Everyone likes cartoons,” Derek puts in as he comes in from the kitchen with, bless him, two steaming mugs. He passes one to Stiles, who mouths his thanks. “This one used to be my favorite.”\nCurious, Stiles turns back to the TV. A pale-blue man with green hair is in the process of saving the day.\nA werewolf would love Captain Planet. “Nature boy, huh?” he says with a smirk.\nDerek smiles back. “You’re the one with the green thumb.”\nSnatching a cube of honeydew from Rina’s bowl, Stiles asks, “So where’s Lydia?”\nDerek shrugs. “Wasn’t here when I woke up. She said something last night about someone named Jackson?”\n“Oh good grief,” Stiles groans. One of these days Lydia’s going to get run out of town for being a home-wrecker. Why Goddess won’t Jackson just divorce his fucking wife so everyone can be happy?\nWait a second—“Did you, uh.” He looks down at the bowl of fruit. “You got Rina breakfast?”\nFor a moment, Derek looks shy, hesitant. “I—Scott said he hadn’t had time to feed her. His mom got Joey some kind of last-minute Sunday appointment with a respiratory specialist and he had to leave in a hurry. Is that okay?”\nFuck. “Fine,” he says, hoping his voice doesn’t sound as choked as it feels. He cannot get used to this. Derek cannot get used to this. “Thanks,” he adds after a second. “You could’ve woken me up.”\n“Uncle Stiles, I can’t hear the TV,” Rina says pointedly.\nIf Stiles takes that as an excuse to put off the Very Serious Conversation until later, no one has to know.\n*\nExcept he never manages it. Lydia reappears Sunday afternoon, and it doesn’t seem right to try to sneak a conversation like that in with another adult in the house. By the time Lydia packs her stuff up for the drive back to Stanford, Derek’s back at Scott’s for more werewolf talk.\nWhen Derek returns with bloody, torn clothing, Stiles almost has a heart attack. “Derek, what—”\n“Training,” Derek says, cracking his neck. He takes off his shoes and strips off his shirt right there by the front door. Underneath, his perfect chest is unmarked. “Trying to get Scott to fight without shifting all the way.” He shrugs. “He got the job at the veterinarian’s and wanted to work off some excitement.”\nStiles smiles in relief. “Good for him. Though maybe you could look into making sure he interacts with animals okay next. Deaton probably won’t flip out on him—he’s a druid—but it’d make Scott’s life easier.”\nDerek pauses in the middle of unbuckling his belt. “Is everyone in this town some kind of supernatural creature?”\n“Seems that way sometimes,” Stiles says ruefully. The town can pretty much be divided into categories of “in the know,” “living in denial,” and “probably shows up in a myth somewhere.” “I can’t believe I didn’t know about werewolves. We’ve got banshees—Aunt Kath, and Lydia’s half, of course. Deaton and his sister, the one who runs the inn, are druids. We had a darach about twenty years ago but Aunt Hestia bound her powers and my dad found some outstanding warrants for her arrest, so she’s in jail in Oregon now. Oh! And Scott’s wife’s a kitsune.”\nDerek finishes stripping his jeans and Stiles follows him to the laundry room, where he deposits his clothes. Stiles doesn’t know who he’s kidding; that stuff isn’t fit to burn. “Joey?”\n“They don’t know yet.” Stiles shrugs. “He won’t present until puberty. If he doesn’t, they’ll probably think about finding an alpha werewolf to ask for the bite. Scott used to have asthma too, before he got bitten. But if he is a kitsune, we don’t know how he’ll react.”\nHe does his best to keep his eyes on Derek’s face, but it’s hard. Literally and figuratively. Still, this is important. He can’t let himself get distracted. “Listen, I just… thank you for getting Rina breakfast this morning. But um. We probably shouldn’t… while she’s around….”\n“Stiles.” Derek looks pained and a little hurt, and Stiles’s stomach sinks at the sight. Derek’s aura pretty much reads like “kicked puppy” 87 percent of the time, and he doesn’t want to contribute to that. “I’m not going to do anything inappropriate with your daughter around.”\n“That’s not what I meant!” he says, even though it kind of was. “Just… Rina knows about magic but not werewolves or kitsune or the rest. I’m—I don’t want to give her too many questions, you know? Or nightmares. Not that I think you’d scare her or anything, but the idea of strange werewolves might.”\n“Oh.” Some of the hurt washes away, and Stiles doesn’t know whether to be relieved or panic because he just took back some of what he meant to say. This conversation is not going at all according to plan. “It’s okay. I get it.”\nFuck. Stiles swallows a lump in his throat, knowing he needs to go at least one step further. “Thanks. And um. While you’re here, while she’s here, I think you should. You should sleep in the guest room. Not because I’m ashamed of you or anything, but she… she’ll assume you’re staying.” Permanently. Because the only people Rina knows who shares beds are her dead parents and Aunt Hestia and Aunt Kath.\n“I understand,” Derek tells him. But the read Stiles gets on his aura—it’s like something is choking him. At his sides, his hands clench into fists and release.\nSwallowing, Stiles reaches up above the laundry tub and pulls down a basket of bath oils. They got moved here while the guest bathroom was being renovated and then nobody thought to put them back where they belong. Bergamot—no. Sandalwood—no. There. Lavender.\n“I’d rather have you in my bed with me,” Stiles says boldly, and then immediately flushes. He can’t say what prompted him to make that admission, which means it was probably his magic at work. Since the damage is done, he might as well go on. “I’ve never shared a bed with someone. I liked it. But I can’t.” He holds up the vial of oil. “Let me make it up to you.”\nIt’s pretty obvious Derek has no idea what Stiles has in mind, but apparently that doesn’t bother him. He acquiesces with a slight nod, and Stiles leads him upstairs to the bedroom of the guest bath. Hestia and Kath renovated it just a few years ago with a truly ridiculous Jacuzzi tub. Stiles fills it with hot water and a generous helping of the oil and says, “Get in.”\nDerek skins out of his boxers and obeys.\n“Lavender is for protection,” Stiles says. There’s a basket of unused bath goodies at the side of the tub, and he selects a purple loofah and soaks it in the water before taking Derek’s hand in his and scrubbing the dried blood from the back. “Sleep. Peace.” Things he suspects Derek needs and hasn’t had in a long time.\nDerek doesn’t say anything. He watches, seemingly rapt, as Stiles works the loofah up his arm, washing away all traces of blood.\n“Wishes,” Stiles continues, washing Derek’s shoulder now. “Long life.” His nape. “Purification.”\nDerek almost flinches at that one, and Stiles wonders what he did that he thinks he can’t be forgiven for.\nDerek relaxes when Stiles stops talking and concentrates on cleaning him, literally and metaphysically. Cleansing an aura isn’t always easy, isn’t even always possible. Derek carries a lot of guilt, a lot of repressed violence, and even more sadness. Stiles can’t wash that away without washing away a part of Derek, and he won’t do that. But he can soothe it, and with the lavender easing the process, he can root the hope that Derek might one day forgive himself.\nBy the time Stiles finishes washing Derek’s feet, the water is only lukewarm and Derek’s head is lolling against the edge of the tub. Stiles grabs the fluffiest towel from the linen closet and coaxes Derek to stand, then rubs him dry as the tub drains.\nTwo minutes later, he pulls the covers over Derek’s body. He’s so cooperative and pliant Stiles should be shocked, but he isn’t. Magic has that effect sometimes, particularly on supernatural beings.\nStiles has the strangest urge to leave Derek’s bedroom door open when he leaves, but he forces himself to close it. He falls asleep in his own bed, alone, and dreams of a creature with six glowing red eyes.\n*\nSomehow, playing house with Rina and a lone werewolf isn’t weird.\nDuring the week, they get up more or less at the same time. Derek makes breakfast while Stiles gets Rina ready for school, and then it’s business as usual. While Stiles is at work, Derek hangs out at the house or, when Scott’s off work, with him, presumably teaching him things about werewolfing you can only learn from experience. Then he picks Rina up from school and drops her at the shop. Sometimes the three of them hang out together, and sometimes Derek disappears again to do who knows what. For all Stiles knows, he’s looking for an apartment.\nOnce Stiles is done work, the three of them eat dinner together, then take a walk or play a game or watch TV. (Derek is the least repentant Sorry! player Stiles has ever met, which is saying something, because he grew up playing against Lydia.)\nAs long as Rina’s awake, Derek keeps his distance, limiting his contact with Stiles to casual brushes of their hands and sometimes shoulders. But as soon as she’s upstairs in bed, he’s Mr. Touchy Feely, stealing kisses while Stiles makes coffee, rubbing his face over Stiles’s hair and pulling his body closer when they’re sacked out on the couch. They don’t sleep in the same bed, but they still go to bed together. Tuesday night Derek rims Stiles until he cries. Thursday Stiles sucks Derek’s cock until his brain is starving for oxygen; then he lets Derek come on his face and jerk Stiles off with his jizz. Stiles sleeps like a baby every night and forgets about Sunday’s weird dream.\nHe tells himself it doesn’t matter that he’s breaking all his rules for Derek. He’s cursed himself not to fall in love anyway. He might as well enjoy some adult company while he can. Besides, Derek seems lonely.\nLydia calls him after her class on Friday, and susses out everything that’s happened in a week from Stiles’s tone when he answers the phone.\n“Good for you, sweetie.”\nIt’s hard having secrets when your sister’s a half-witch half-banshee genius. Stiles groans.\n“I’m serious. It’s about time you stopped trying to convince yourself you’re not the romantic type.”\n“No one is romancing anyone else,” Stiles says firmly. “This is a casual arrangement where two lonely people get off together.” He sighs as the guilt comes creeping back in. It’s been more persistent over the past few days, especially at night. “Besides, once he finds out I helped bury his last surviving family member and didn’t say anything about it, he’s not going to want anything to do with me.”\n“Just don’t let him leave before next weekend. I can’t make it back before then, and I dug up some more info on what Peter was up to.”\nSomewhere in the back of Stiles’s brain, a warning bell goes off. He suspects it’s because the idea of keeping Derek around for another week strongly appeals to him. “Okay. I don’t really think he’s in a hurry to go anywhere anyway.”\n“Good. I have to go, there’s a hot new cocktail bar opening tonight and I need a manicure.”\nStiles snorts. “Bye, Lydia.”\nThe store gets quiet now that Scott’s working again, but Stiles doesn’t mind. He putters around, making note of what needs replenishing, what’s selling well, what isn’t. He orders supplies. He mixes up some herbal remedies.\nAt four, the door opens to admit Derek and Rina. After a brief pause, Derek says, “What are you doing?”\nStiles comes back to himself to find that he’s staring down at a smoldering pile of rowan branches. Or rather, they were rowan branches when he picked them up on his way to work in the morning. Now they’re ashes. Stiles blinks at them. “Making the ingredients for a protection spell, apparently.” He takes a ziplock bag from under the counter and uses a spark of magic to sweep the mess carefully into it.\nDerek frowns. “Should I be worried?”\n“Nah,” Stiles says, but only because Rina’s here. He is definitely concerned. “Just a precaution.”\nHe thinks Derek catches what he doesn’t say, though, because when he goes to bed that night, he leaves the door open, like he might need to run out at any moment.\nThis time the dream is less forgettable. Stiles is a woman, small but powerful. His borrowed veins thrum with anticipation. Someone is watching him. Someone is stalking him.\nNot far away, a train whistles. In the opposite direction, a stream burbles through the forest.\nThen the trees rustle and he catches a familiar scent. But by the time he turns—\n“Hello, Laura.” One half of the man’s face is handsome. The other half is scarred and blistered. His eyes burn electric blue in the low light. Stiles inhales a sharp breath, but before he can assume a defensive stance, the man produces a Taser.\nElectricity flows through his body, and he can’t move. He can only look up into a face that seems familiar as claws slash across his throat and blue eyes bleed to red.\nStiles has only been in the kitchen for two minutes when Derek joins him, clad only in a pair of Stiles’s borrowed pajama bottoms. “Couldn’t sleep?”\n“Nightmare,” Stiles says succinctly. Then amends, “Well. Maybe vision.” He flips around his laptop so Derek can see; he has Google Maps pulled up, displaying California. “Where did you say you used to live?”\nDerek pulls out the chair beside him and sits down. “Beacon Hills.”\nStiles nods and types that in, then zooms until he finds the railroad tracks. Another minute of searching scores him the location of the river. He bites at his bottom lip for a minute, debating what to tell Derek.\n“Stiles?”\nHe sighs. “I think this is where Peter killed your sister, if… if you wanted to look for her body.”\nFor a moment Derek doesn’t speak or react. Then he licks his lips and tears his gaze away from the screen to meet Stiles’s eyes. “Prophetic dream? Do you get those often?”\n“I get them never,” Stiles corrects. That’s the reason he’s awake right now. “They’re usually Lydia’s division. Related to the banshee thing, I guess. Though they’re not necessarily prophetic. Just true.”\nAnother pause. “So you’re freaking out.”\n“Little bit,” Stiles says off a slightly hysterical laugh. He switches tabs to open a new Google search. Beacon Hills +.\nPlus what? Running a hand through his hair, Stiles turns back to Derek. “Look, you don’t… have to answer. I get that you probably really don’t want to talk about it. But your family. When exactly…?”\nDerek tells him the date, and Stiles types it in along with the rest of what he knows. Maybe if he can duplicate Lydia’s research, he can figure out why he had the dream.\nEleven dead in tragic house fire.\nStiles clicks.\nBeside him, Derek doesn’t say anything. He doesn’t look at the article. He probably knows every word by heart. But this is easier, Stiles thinks, than Derek telling him himself. Than Derek reliving—\nAn investigator for the Beacon Hills Fire Department ruled the fire accidental.\nNow there’s a load of horseshit if Stiles ever read one. He does another search, this one for more recent house fire fatalities in the area, and comes up with a picture of a pretty blonde woman named Kate Argent.\n“He loved her,” ten-year-old Lydia sobs in his memory. “He loved her and she burned them all.”\n“Oh fuck,” Stiles says, slamming his laptop closed. Panic tightens in his chest.\nDerek catches his wrist before he can start pulling out his hair. “Stiles. What’s wrong?”\nStiles shudders out a breath. “How much do you know about banshees?”\nDerek frowns. “Not much. They can see death and danger, and it makes them scream, right? As a warning?”\n“More or less.” It’s more complicated than that, but even Stiles doesn’t understand all the nuances. “Usually banshee children don’t experience the deaths until they hit puberty. Kind of a defense mechanism. Then, when they’re old enough, the banshee powers kick in and the screaming starts. But if something especially violent or traumatic happens nearby, especially something linked to the supernatural world, they can wake up early.” Stiles runs a hand over his face.\n“Are you saying…?”\n“The fire. The one that killed your family and maimed your uncle?” He forces himself to meet Derek’s gaze. “Lydia was ten. That’s what woke her powers. There’s no fucking way that’s a coincidence, Derek. I don’t know what your uncle wanted with her, but it wasn’t good.”\nSilence falls in the kitchen again as Stiles edges closer to panic. He should have made Lydia tell him everything. It’s not in his nature to let others do the heavy lifting. He doesn’t know what came over him.\n“Hey.”\nStiles looks down in surprise; Derek’s hand is covering his on the table. “Call her in the morning,” Derek suggests.\nHe nods. “Yeah.”\nDerek herds him gently back to bed. Stiles doesn’t fuss when he crawls in after him and tugs Stiles into his body. “I’ll hear Rina when she wakes up,” he promises. “Just try to sleep.”\nStiles thinks he’ll be up all night worrying himself into old age, but something about Derek must soothe him—his warmth, maybe, or the rhythmic rise and fall of his chest. Stiles closes his eyes to the tattoo of Derek’s breath on the back of his neck and doesn’t wake up until morning.\n*\nAfter coffee, and after Stiles has convinced Rina to take a bath, because he’s seen Derek wrinkling his nose and even Stiles’s pitiful human senses are offended, he meets Derek in the kitchen.\n“Hey,” Derek says, handing Stiles a refilled mug. Derek learns fast.\n“Hey,” Stiles answers, taking the mug and a fortifying breath. “So listen. I called Scott’s mom, and she’s willing to look after Rina so we can catch up on your unfinished business. If your sister was anything like you, I should be able to find the place she died. And we can pick up the rest of your stuff, if you have any?”\nDerek clenches his jaw and nods slowly. “Okay.”\nWincing, Stiles offers, “We don’t have to if you’re not ready. I mean. I lost both my parents before I was ten. It’s not the same scale as what happened to you, but I get it, if you’re not ready to bury her. I’m not judging you.”\nDerek shakes his head. “No, you’re right. I need to do this.” He sets his half-empty mug in the sink. “I’ll go get ready to leave.”\nThey drive the first half hour out of Half Moon Bay in silence. Stiles wonders if it’s because they have nothing to talk about, or too much.\nFinally he can’t take it anymore. “That night Lydia woke up,” he says, careful to pick a time when there are no other cars on the highway. “She kept on saying ‘he loved her and she burned them anyway.’”\nDerek’s fingers go white-knuckled on the steering wheel, and Stiles watches him swallow.\n“You don’t have to tell me. I just….” He feels like he needs to know, somehow. Because he’s sleeping with Derek now? Because they’re sort of friends? Because Derek’s essentially living with him and his kid and he doesn’t have the aunts there for backup?\n“When I was fifteen, I met this girl,” Derek says. “Paige. She—thought I was a huge asshole, actually.”\nStiles chokes, not expecting any kind of levity. “You don’t say.”\nDerek looks sideways at him and shoots him the tiniest of smiles. It’s bittersweet, but Stiles will take it. “Shut up. She was right, but she liked me anyway, I guess. So we started dating.”\nStiles is sensitive enough to Derek’s aura by now that he knows this is where things go to shit. “Then what happened?” he asks gently.\nWith a shake of his head, Derek admits, “I don’t know. There were a bunch of other packs in town for a meet of some kind. Peter tried to convince me the only way Paige and I could be together is if she got the bite. But I wasn’t ready to tell my mom yet, and Paige didn’t even know about werewolves. You can’t just bite someone without their consent, that’s not—that’s not how my mother did things. But somehow Paige got bitten.”\nAh. Since Scott was turned, Stiles has read everything he can on werewolf lore. He can guess where this is going. “Her body rejected the bite.”\n“She suffered,” Derek says quietly. “It hurt her and she was just—dying, slowly. So I….”\nStiles nods. His throat is thick and he doesn’t have the words to make this better, so he just puts his hand over Derek’s on the gearshift and waits him out.\n“And then, a year later, I met Kate.”\nFuck. Stiles thinks back to the obituary he read. How old had it said she was? Fortysomething. And if the fire was eighteen years ago and Derek was sixteen—\nHis stomach sours. “I can guess the rest,” Stiles tells him.\nDerek doesn’t offer any more details. Stiles doesn’t really want to know anyway. But he feels like he has to offer something in exchange, something genuine. He can’t let Derek be the only one to show his throat.\nHe says, “My great-great-whatever grandfather cursed his whole family. Well, no. Just the men. He was a bitter old bastard who hit his wife too many times, and when she left him, he cursed the rest of us. That if we ever fell in love”—fuck, his voice is breaking, why is his voice breaking—“that person would die young. So we would know his pain.” He spits the last part, as he always does.\n“That’s what you meant by family curse,” Derek says after a long pause. His voice is quiet, maybe too understanding. And sad, Stiles thinks. Derek is sad.\nHe nods, staring out the window. “The curse killed my mom when I was eight. Then grief killed my dad when I was nine, and I sort of—always said that wouldn’t happen to me. When I was ten I did something about it. I cast this stupid spell—that I would only fall in love with someone who was this thing, and that thing. Basically that I would never fall in love at all.” They pass a mile marker. “Sometimes I regret it, though.”\n“You have a good life.”\nStiles smiles, bittersweet. “Yeah.” It could be better, but yeah. He’s happy. He has what he needs. Then: “You’re going to want to take the next exit.”\nThey park in one of the lots for the Beacon Hills Nature Preserve, and Stiles takes out his phone to check the GPS. It’ll be a bit of a hike, but hell, he’s been in the car for three hours. He could use the exercise. After a minute spent with his eyes closed, listening to the call of his magic, he finds the thread he’s looking for. “Come on. This way.”\nThey walk for an hour in almost total silence before Derek stiffens beside him. Stiles lets him lead from there.\nTwenty minutes later they’re standing over Laura’s body.\nIt’s—awful. Peter didn’t bury her, so her corpse has been scavenged by animals, devoured by insects, and ravaged by the weather. Even Stiles, who has practiced witchcraft his entire life and has thus seen some shit, wants to gag at the sight. But Derek kneels next to her and touches what remains of her hair, then the silver triskele shining around what was once her throat. Carefully, the maneuvers the chain so he can unclasp it, then tucks the necklace into his pocket.\nStiles touches his shoulder in silent support and wishes for the hundredth time that he could tell Derek what happened to Peter. Instead, he says, “What do you want to do?”\nThey brought a shovel from the car, just in case. Stiles could also call in an anonymous tip to the local PD. Or he could use the spark at his fingertips to cremate her bones. But none of those seem right.\n“She should have a headstone,” Derek mumbles. “I’ll order one for the family plot. But maybe something here too.”\nThat, at least, Stiles can help with. He closes his eyes and stretches out with his magic, letting the energy of the forest seep into his bones until he can feel every leaf, every animal and insect, every rock and tree root.\nThere. At a gentle nudge from Stiles, the tree roots shift, and the ground around them trembles until a black granite boulder breaches the surface.\nDerek stares at him.\n“I can’t do anything fancy for an inscription,” Stiles says apologetically. Not without a serious power boost and a lot of concentration. “I could manage initials. Unless you want to…?” He holds up his hands and curls his fingers like claws.\nDerek looks down at her body. “You should do it,” he says. “It’ll be nicer if you do it.”\nNodding, Stiles returns his attention to the stone and channels his power through his index finger. The rock chisels away at his touch, disintegrating into a little stream of black sand. It takes more out of him than he thought it would, and he stumbles when he steps back.\nDerek catches him just below the shoulder before he can fall, and they take a few steps away from the skeleton and its marker.\n“What do you want to do?” Stiles asks quietly, once the lightheadedness has passed.\nDerek picks up the shovel Stiles had propped against a tree trunk and gets to work.\nTwo hours later finds them in a fifties-style diner on the outskirts of Beacon Hills. Stiles orders his burger with curly fries and a milkshake. Derek gets his with extra bacon and a side of sweet potato fries. It’s probably a good thing he has a werewolf metabolism.\n“I have a few things to take care of while we’re here,” Derek says, watching with flushed cheeks and a pained expression as Stiles sucks down half of his milkshake. “Do you mind?”\n“That was kind of the whole point,” Stiles tells him. Then: “Ow, brainfreeze.”\nHe doesn’t argue when Derek pays for their meal.\nIt turns out Derek had rented an apartment in Beacon Hills while he investigated what happened to Laura. It’s a huge, unfriendly industrial loft, and while it has a certain bad-boy coolness factor, Stiles has a hard time reconciling the Derek he knows—the Derek he’s seen fully submerged in a Jacuzzi tub smelling of lavender, the Derek who picks Stiles’s kid up from school, the Derek who practically melts into Stiles’s overstuffed couch at the end of the day—with someone who would want to live here.\nIt does match his car and the leather jacket, though.\n“Dude, who are you,” Stiles says rhetorically as Derek slides the door closed behind them.\nDerek shoots him a sly smile, but it’s undercut by the exhaustion and sadness that have plagued them both all day. “I have layers.”\n“A mystery wrapped in an enigma wrapped in a leather jacket,” Stiles agrees in an attempt at levity. The loft doesn’t have much in the way of furniture, just an ugly couch and a coffee table, a drafting table and some chairs, and a bed with slightly ridiculous purple sheets Stiles isn’t going to comment on right now. What it does have is books—on the tables, in a bookshelf along one wall, on the unmade bed, on the windowsill. “Can I use your bathroom?”\nBy the time he returns to the main room, Derek has set a cardboard box on his bed and filled it to the brim with books. He doesn’t seem to have any concern for anything else.\n“I take it you’re not sticking around here,” Stiles says casually.\nDerek shakes his head and looks up. “I grew up here, but there’s nothing for me here anymore.”\nEveryone he knew in this town is dead. Stiles swallows and asks the question that’s been haunting him all day. “Where will you go?”\nLooking back at the box again, Derek shrugs. “I figured I’d stick around Half Moon Bay for a while until Scott’s feeling more confident. It’s a nice place. And then… maybe I’ll go back to New York.”\nYou should stay, Stiles wants to tell him. But he can’t. Not when he already suspects Derek might have feelings Stiles can’t return. He isn’t that cruel.\nInstead he nods. “You going to give your landlord back the keys?”\n“Yeah,” Derek says, nodding absently. Then his nostrils twitch and he amends, “But I’m going to shower first.”\nStiles has to sit next to Derek in the car on the way home, so he doesn’t disagree. “Sure. I’ll just entertain myself.”\nWhat he means by that is I’m gonna go through the stuff you deem worthy of keeping. As soon as the bathroom door closes behind Derek, Stiles kicks off his shoes and paws through the books. It’s an eclectic mix—history textbooks in with Vonnegut, photo albums sandwiched between cookbooks and Victorian poetry. Stiles is going to make fun of Derek for that later, he decides.\nBut until then, he’s in Derek’s bed, and it’s… comfy. It smells like Derek. It only takes Stiles a few wriggles before he’s cozy enough to fall asleep.\nAnd wakes again suddenly when the mattress moves. When he opens his eyes, Derek’s face is inches above his, eyes shining red in the late afternoon light. He’s already naked—maybe still naked, and damp from his shower—and as soon as he sees Stiles is awake, he shoves his face under Stiles’s chin and inhales.\nBeing sniffed is a turn-on now, apparently. Stiles tilts his head back and lets his legs part a little farther. “Wow, I had this whole elaborate seduction planned,” he lies, “but—”\nDerek licks him from his collarbone to that hot place behind his ear, and Stiles abandons that train of thought for something more direct. “Fuck, tell me you’ve got lube.”\nIt seems like it might be a vain hope—Derek doesn’t even have a bedside table—but he drops his weight down on one elbow and fishes beside the bed and oh thank goddess. Stiles considers wishing for a condom too, but fuck it, Derek’s a werewolf and can’t give him anything anyway, and when is Stiles going to get another chance to bareback risk-free? Never, that’s when. He’s all aboard this bad idea train.\nActually, all aboard sounds like a great idea. Stiles hooks his ankle behind Derek’s bare leg and rolls them over, sending the box of books crashing to the floor.\n“Oops.”\nDerek laughs as Stiles scrambles off of him, stripping clumsily all the while, but he’s hard already, even though Stiles hasn’t touched him, so Stiles decides not to take it as an insult. “So graceful.”\n“Please,” Stiles says with a grin, ridding himself of his left and final sock. “You want to get up on this.” Then he straddles Derek’s waist again and brackets Derek’s head with his arms. “Too bad. Tonight this is getting all up on you instead.”\nDerek’s eyes go dark. Half a second later, he circles Stiles’s hole with two slick fingers. “You gonna ride me?”\nFucking Goddess yes. “Hnng,” Stiles agrees as Derek slides them inside. He works his hips, already desperate for more. Power and lust surge through him, making his nerve endings sing. “Unless you have any objections?”\nDerek whisks his hand away only to return it with more lube and—fuck—more fingers, first three and then four, and Stiles opens for them so easy he suspects his magic of interfering.\nFuck it, this is the greatest abuse of power ever. No wonder so many witches go dark side. Stiles shudders as Derek massages his prostate, lets his eyes fall half-closed, sucks in a breath.\nAnd then suddenly he needs Derek’s cock in him now, can’t wait another second. Blindly, he reaches for the lube. He almost drops it twice because Derek’s screwing his fingers into him mercilessly, but he finally gets it open and gets his slick hand on Derek’s dick, and then it’s only a matter of seconds before he drags Derek’s fingers away from his ass and sinks down on his erection instead.\n“Fuck,” Derek says, settling his hands on Stiles’s hips and thrusting up.\n“Yes,” Stiles agrees, rolling with Derek’s motion. He loves being on top, loves the thrill of seeing his partner lose control beneath him. It’s also easier to control the intimacy and keep things casual. Plus—\n“There, there, fuck, that’s good.”\n—it’s good for mathematical reasons. Stiles curls his body backwards, braces himself on his arms, closes his eyes, and chases his own pleasure. He’s not looking for more than the exquisite wet slide of Derek inside him and the jolt of pleasure from his prostate, so when Derek thumbs the head of his erection, Stiles chokes on a groan, his hips jerking automatically. He looks up to find Derek watching him, eyes dark. Stiles always forgets that as much as he likes this position because it lets him soak in his partner's pleasure without unwanted intimacy, the reverse is also true.\nDerek strokes him once, firmly, root to tip, and licks his lips like he's tasting the air. The sight is visceral somehow, and magic crackles sympathetically low in Stiles’s stomach. He shoves his body down on Derek's cock and arches so hard he's almost parallel with Derek's legs as he comes, gasping, his whole being singing with it.\nBefore he can recover, Derek flips them, smearing Stiles's come between their bellies, continuing to nudge his erection up against Stiles's prostate. The overstimulation should be uncomfortable, but it isn't; Stiles whimpers and spreads his knees and wordlessly invites Derek to destroy him.\nDerek kisses him instead.\nAnd this is why Stiles avoids being fucked on his back. It's unavoidably intimate, close, and he never wanted to know how much he liked it. Because he does like it, loves it even, the scrape of Derek's stubble on his chin, on his neck, the sweaty press of his body, the taste of his mouth. \nStiles doesn't so much get hard again as never soften in the first place.\n\"Stiles,\" Derek rasps, a rumble Stiles feels through his whole body. His thrusts are getting ragged, and Stiles knows he must be desperate. \nHe runs his nails down Derek's back and meets his movements as best he can. \"Do it,\" he whispers hoarsely. \"Come on.\"\nDerek’s breath catches on a shocked, wet-sounding gasp, and he freezes and then trembles, licking at Stiles’s mouth.\nAnd then—\n“Oh God,” Derek whispers, and follows it with an impossible noise as he presses his forehead to Stiles’s shoulder.\nStiles says, “What…?” because he’s new to barebacking, okay, but guys have come inside him before using condoms and it’s never felt remotely like that. Like Derek’s dick is actually getting bigger, stretching Stiles from the inside, and it’s—\nIt’s really fucking good.\n“Fuck,” Derek says quietly. He’s still shaking in minute little shivers. “Sorry. I didn’t mean to.”\n“What?” Stiles says again, squirming a little and letting his eyes fall closed. He feels pleasantly warm and tingly almost everywhere. When he shifts, though, the tingles ignite into a smolder. Whatever is going on with Derek’s dick, Stiles’s prostate likes it. A lot. “Fuck, okay, you should—you should explain this to me. In small words.” Which are all he’s capable of understanding right now.\nDerek pauses and lifts his face so he can look Stiles in the eyes. “You’re not hurt?”\nIncredulous, Stiles raises his eyebrows and glances down his body, where his erection is pressed flat against his stomach, drooling precome. “Seriously?”\nDerek follows his gaze and makes a punched-out noise. “It’s a werewolf thing. Sometimes, when we… with the right person, in the right circumstances….”\nFucking goddamn it, Stiles knew this was going to happen. Derek has feelings for him and Stiles is going to end up breaking his heart and everything is terrible. Except the way his body feels right now.\n“I’m sorry, I—usually I can control it, but you were in my bed this time, I….”\nIn fairness, Stiles is the one who crawled into a werewolf’s bed while he was in the shower, and he didn’t exactly protest when Derek initiated the sexytimes. Also—“Derek, the first time we fucked, I fried a sandbox. Criticizing you for losing control would be a little hypocritical.” He pauses. “Plus….”\nPlus he’s really feeling no pain at the moment. He closes his eyes and thrusts his ass against Derek’s hips a little more firmly.\nDerek makes that sound again, the one Stiles doesn’t have words for, and presses his open mouth to Stiles’s collarbone.\nStiles’s throat goes dry. “Are you… are you still…?”\nDerek nods.\nHoly fuck, that’s so hot. Stiles’s dick twitches against his stomach. “Okay,” he says faintly. “So you’re not gonna mind if I….” And he rolls his hips up again, rubbing his cock against Derek’s stomach.\nDerek says, “Fuck.”\nStiles doesn’t need more encouragement than that. “You, uh.” He licks his lips and squirms. “Have you tried this?”\nDerek shudders and shakes his head against the side of Stiles’s neck.\n“You’re missing out.” He can’t move far, not with Derek’s—damn it, Stiles has seen enough of the Internet to call it what it is—knot tight against the rim of his asshole, but he doesn’t have to. “I’m gonna—I’m not a werewolf, but I’m a pretty good witch. I bet I could fake it.” He wants, suddenly, to make Derek feel as good as he does, to splay him out on his belly and stretch his ass until it seems like his whole body might overload with lust. “Make it feel like I was”—say it—“knotting you.”\nDerek covers Stiles’s mouth with his own, fierce, teeth stinging at Stiles’s swollen lips. Just a few frantic, grinding movements, and then Stiles gets his hand on his dick, and—\nHe does pass out this time, but not for very long. When he comes to again Derek’s cradling his face in one hand, looking pretty concerned for someone who’s having a minutes-long orgasm. “You okay?”\n“Shhh, don’t talk,” Stiles says. He feels drunk with pleasure, like he couldn’t get out of bed right now if his life depended on it. And actually he probably couldn’t, because walking with Derek’s dick stuck in his ass sounds like a terrible idea. “You’re harshing my afterglow.”\nDerek snorts. “I’m going to move us, okay?”\nLike Stiles could stop him, even if he could muster the brainpower to have an opinion on it one way or the other. He goes pliant and lets Derek maneuver them until they’re spooned up together, Derek’s chest to Stiles’s back. Stiles breathes a little sigh of relief that Derek can’t see his face anymore, that he doesn’t have to watch Derek’s expression. He can deal with Derek nuzzling his stubble against Stiles’s shoulder instead. He’s more used to that, has even come to like it. Before he knows it, he’s closing his eyes again, his breath deepening as sleep takes him.\n*\n“God, that’s probably rude, huh?” is the first thing Stiles says when he wakes up, feeling somehow lighter than he has in years. Derek’s not behind him anymore, and there’s no ooey gooey squishiness when he moves, so apparently Derek did all the cleanup work while Stiles was unconscious. “Sorry.”\nAt the foot of the bed, Derek looks up and raises one shoulder in a half shrug. “I’m the one who knotted you without your permission.”\nStiles decides the only way to go forward is to ignore Derek’s massive guilt complex, thus giving the impression that said guilt is misplaced. He sits up, then has to bite back on a wince, because yeah, if he remembered about the hours-long drive ahead of them, he maybe would have put the kinky sex off until later. Oops. “Finished packing?”\n“Yeah.” He’s dressed too, in different clothes than he wore earlier. He must not have shoved his entire wardrobe into the back of his car when he took off looking for Peter. He picks up a case from the floor and lays it on the bed. “It’s just this and the books, really. I don’t care about anything else.”\nBut Stiles is still staring at the case. It’s about three feet long, black. “Please tell me there’s a tommy gun in there.”\nDerek gives him a puzzled look. “It’s a violin.”\nOh.\nStiles continues to stare at it. “You play?”\n“Not that well.” Derek shrugs again. It makes Stiles forget how huge he is. “Paige played cello. My therapist suggested it after she died. It helps.”\nOh shit.\n“That’s good,” Stiles says, half strangled. “That it helps, I mean.” Inside, he’s in turmoil. Stiles is not prepared for this. Not on any level. He cast a spell and made himself sure, made falling in love an impossibility.\nOr so he thought.\n“Stiles? Are you okay? Your heartbeat’s going crazy.”\n“I’m fine,” Stiles manages, knowing Derek will hear the lie but trusting him not to push just yet. He draws on his magic to calm the rising anxiety, but even still, he’s on the edge of a panic attack. He needs to be home, needs to tuck Rina into bed, maybe spend some time in the greenhouse.\nHe needs to reread his old spellbooks.\n“I’m fine,” he says again, even though he might’ve just signed Derek’s death warrant. And then he takes a deep breath and screws his courage to the sticking place. If that’s—if he did that, then he has to draw the line. He can’t lie to Derek anymore, not knowing how badly he’s already been hurt. Not when he suspects what could be ahead. “There are some things I need to tell you. Things I haven’t been totally honest about because they weren’t my place.”\nGod damn it, Lydia.\n“Okay,” Derek says. He doesn’t look surprised or disappointed or accusatory. That would make it easier.\n“Next weekend, after Lydia tells you everything,” Stiles promises. “You can ask me whatever you want and I’ll answer.”\n“Okay,” Derek says again. Then he jerks his head toward the neatly folded pile of Stiles’s clothes at the foot of the bed. “You should get dressed if we’re going to pick up Rina before bedtime. Everything else can wait a week.”\nStiles nods, because what else can he do? “One week,” he agrees.\n\nIf you don’t hate me by then.\n\n*\nSunday morning Stiles gets up before Derek and Rina and creeps down to the cupboard in the greenhouse to find his old spellbooks, thankful all the while that the aunts are intense about record-keeping. Intention, incantation, ingredients—they’re all equally important to the outcome, and sometimes the only way to reverse a spell is to break down exactly what went into it in the first place.\nStiles knows better than to think this one can be reversed, but he takes out the book anyway, sits on the ground, and leans up against the wall to the house. The pages stick when he opens it, but it’s easy to find the right entry.\n\nWhen I fall in love, it’ll be with someone strong. So strong they can lift a car. They’ll be so beautiful everyone will want them, but so hurt underneath they’ll never believe it.\n\n\nThey’ll have green eyes. No, brown. Yellow. Blue. Red. \n\n\nThey’ll play an instrument. Violin.\n\nAnd their favorite TV show will be Captain Planet.\nStiles smiles wistfully as he traces over his chicken-scratch printing. But the smile fades as he reads over the ingredient list. Acorn, silk cocoon, moss—all those things he remembers adding. But at the bottom, in Lydia’s much neater hand, is an addition he never considered.\nMoonlight.\nHe swallows and leans his head back against the siding. Of course.\nHe closes the book and runs his fingers over the cover before returning it to the shelf. He’ll probably have to show Derek eventually, but not now. He has a few days to build up to it.\nHe spends them quietly freaking out. During the day he feels like he’s walking on eggshells. At night he’s plagued by visions of blue eyes burning into red, of maggots feasting on rotting flesh. Once he watches as a bloom of wolfsbane comes to life and wraps too tight around Derek’s throat.\nFrustratingly, Derek continues to be perfect. Oh, he’s quiet and a little sullen on occasion, and he has deplorable taste in sports teams. He’s overly affectionate, which Stiles would probably love if he didn’t feel so fucking guilty he has to pull away. Tuesday night, after Rina’s in bed, Derek tries to put his arm around Stiles on the couch and Stiles actually has to stand up because he wants to lean into the touch so bad but his conscience won’t let him.\nDerek’s not in the living room when Stiles gets the courage to face him again, and he spends most of Wednesday with Scott.\n“What the hell did you do to him?” Scott hisses to Stiles on Thursday, when he’s on his lunch break. “He wasn’t exactly Mr. Talkative before, but at least he wasn’t an asshole.”\nStiles groans and barely resists the urge to put his head in his hands. “I don’t know. I fucked up, Scotty.”\nFor a second Scott doesn’t say anything. Then he offers, hesitantly, “That sounds like a relationship thing.”\n“But you don’t have relationship things,” Scott continues, managing to sound only vaguely accusatory, for which Stiles gives him mad props. “Because—and I may be paraphrasing—‘it’s easier if people know up front not to expect something I can’t give them.’”\nStiles presses a hand to his eyes. “Well, that was my philosophy,” he admits. “But I might have been operating under a false assumption.”\n“No kidding,” Scott deadpans.\nEven when Scott’s the worst, he’s still the best. “That spell I cast when I was ten, Scott. It was supposed to keep me from… that. Relationship thing.”\n“It was supposed to make it impossible for you to fall in love,” Scott corrects, because he’s a grown-ass man and he’s not afraid of the L-word. Damn him.\n“Yes, that,” Stiles agrees with a grimace. “And the way I decided to do this was to enchant myself only to—that—with an impossible person. Someone with green brown yellow blue red eyes who could lift a car and play violin and loved Captain Planet.”\nScott digests that for a minute. “So you’re saying Derek is your Impossible Girl.”\nStiles takes back all the things he thought about Scott being a grown-up. And also regrets lending him his Doctor Who boxed sets. Still, his analogy is… not inaccurate. “I don’t know. Scott, I have literally never, you know. And if it is—I cast that curse for a reason. You know what would happen.”\n“No, I don’t. And neither do you, really. Even you can’t tell the future, Stiles.”\n“No, but I can learn from the past.” Stiles sighs. “Anyway, that’s only half of the problem. I can’t tell you the rest yet. I don’t know. I need to tell Derek, but I can’t do it until Lydia’s home, and it’s going to ruin everything.”\n“I guess you’ll find out when Lydia gets home tomorrow night.” There’s a pause, then a crunch—probably Scott shoving the last of his baby carrots in his mouth. “I gotta go, my lunch is over. But call me if you need me later, okay?”\nStiles must have been a good person in a previous life to have earned a friend like Scott. “Sure, buddy. I’ll do that.”\nA few minutes after school lets out, Derek arrives with Rina, his head bowed. Stiles and Rina exchange hugs and kisses, and then she and Derek retreat to the small back room to play a board game.\nOr so Stiles assumes, until Derek reemerges, still downcast. “Hey.”\nStiles swallows the lump in his throat. “Hey back.”\n“Rina says we should talk about why we’re sad.”\nStiles’s lips curve up in a wry smile without his brain’s explicit permission. “Welcome to the world of being parented by a five-year-old.” But the smile falls away when Derek just nods, the muscles at his jaw bunching. “Look, I—”\n“Stiles—” Derek starts at the same time.\nThey both break off and stare at each other in a display of mutual discomfort. Yay, communication, Stiles thinks. “You go first.”\nDerek looks like the idea of talking about this actually physically pains him. Not that Stiles can throw stones on that front. “I’m sorry I pulled away from you when you got up the other night. You were upfront about what I could expect from you. I don’t have any right to be hurt.”\nOh God, what a clusterfuck. “Derek. I don’t have any business telling you how you can or can’t feel. That’s horseshit.” Stiles takes a deep breath and tries to will away the guilt eating at his stomach. “And I wish I could have this adult conversation with you right now, but until Lydia tells you the rest of the story with Peter, I really can’t. I’m not even sure you’ll want to talk to me afterwards.”\nDerek nods and looks down at his hands. “So what now?”\nFuck everything. “Now we might as well enjoy this while we can,” Stiles decides. One more night won’t make any difference at this point.\n“Enjoying this while they can” translates to taking Joey and Rina out for pizza and the early show at the movies, since Stiles owes Scott babysitting duties for approximately the next five years. No one is ever too old for Pixar, Stiles explains seriously to Derek as he grabs approximately seven hundred napkins. Kid fingers plus theater butter crap—it’s a disaster waiting to happen.\nDerek’s not exactly a natural with kids, but they get along well enough, especially when Rina demands, and is given, a ride on Derek’s shoulders. He doesn’t even complain when she gets butter in his hair.\nThey drop Joey off with his collectable toy just before nine; Kira answers the door in threadbare pj’s with a glow you could probably see from space. Stiles doesn’t mean the kitsune thing either. Maybe Derek and Scott have more than just the werewolf thing in common.\n“Hey, guys.” She hugs Joey and sends him up to bed—it’s a school night, after all—then turns back to the adults and smiles. “You must be Derek. I can’t thank you enough for helping Scott out. The learning curve was pretty steep at the beginning there.”\nJudging by the surprise on Derek’s face, people don’t thank him very often. “It was no problem,” he says, a kind of awkward earnestness to his expression that seems out of sync with his status as an alpha. “Werewolves need a pack. Scott’s is a little untraditional, but it’s a good one. He’s lucky to have you.”\nOh, Stiles thinks. He feels like he’s just taken an arrow to the chest.\n“Oh, you know, we’re pretty lucky too,” Kira says, not a bit smugly, glancing back over her shoulder, where Scott has Joey slung over his back and is carrying him up the stairs to bed. “Thanks for taking Joey out tonight.”\n“It was the least we could do,” Stiles assures her. “But we’d better get going. Rina’s already asleep in the car. Have a good night.”\nWhen they get home, Derek carries her up the stairs, bridal style. Stiles pulls back the covers and gets her out of her shoes and pants while Derek digs in the dresser for her pajamas. It’s all very domestic, doing this with someone else, someone who’s not the aunts. Stiles is afraid of how much he likes it.\nHe pulls the covers up again and kisses Rina’s forehead. Then he grabs Derek’s hand, leads him into his bedroom, and takes him apart.\nFor the first time in two weeks, Derek falls asleep first, in the middle of a postorgasmic conversation on the merits of Batman versus Superman. Stiles would be offended except he’s sort of pleased with himself for wearing Derek out so thoroughly. He never even considers kicking him back to his own room, just turns over until he’s comfortable and closes his eyes.\nHe dreams of alpha red fading to lifeless green-brown and wakes up sweating, panting for breath, with Derek’s arm a firm, steadying weight around his waist.\nJust a dream, Stiles tells himself firmly. Derek snuffles his face into his shoulder and Stiles makes himself go back to sleep.\nSo of course Rina wakes them up in the morning. So much for Derek’s alpha werewolf hearing saving them from awkward moments. “Uncle Stiles!”\nStiles inhales deeply, rubs the sleep from his eyes, and turns to look over the side of the bed. “Hi, princess.”\nObviously unwilling to break with her usual Friday morning routine, Rina climbs into bed—where Stiles is actually naked, with another man, who is also naked—and flops down in the middle.\nDerek doesn’t move. Wow, Stiles’s ego is going to be out of control after this. If he doesn’t die of mortification first, anyway.\nRina looks doubtfully at Derek’s naked back, seeming to take particular interest in the triskelion tattoo. Stiles sighs, knowing he won’t be able to veto her future love interests based on their ink. Then she turns back to Stiles and asks very seriously, “Is Derek your boyfriend?”\n“Let’s talk about that later,” Stiles says diplomatically. “Can you run down to the kitchen and turn on the coffeemaker for me?”\nRina narrows her eyes. “Can we still get McDonald’s?”\nDammit, he’s raising a mercenary. Oh well. At least she wants fast food and not a pony. “Of course.”\nShe manages to dig her elbow into his gut and her knee into his thigh as she climbs back over him on her way out the door. Stiles suffers in relative silence as penance for being caught naked in bed with Derek by a five-year-old.\nWhen Rina thunders down the last step, Stiles nudges Derek’s shoulder. “Hey, Captain Comatose. You awake?”\nDerek grunts.\nStiles pokes him again. “Seriously?” He swings his legs over the side of the bed and starts rooting around for some pants. “Where was your superhearing on that one, huh?”\nDerek rolls over and rubs at his eyes. “Sorry. Full moon tonight. Makes me sleep heavier.”\nSo much for Stiles’s ego boost. “Well, you slept through Rina’s inquisition. Luckily she cares more about breakfast than the naked guy in her uncle’s bed.”\nWincing, Derek sits up and immediately hunches over, reminding Stiles of a scolded dog. “I’m sorry.”\nNow Stiles just feels like an asshole. “Don’t worry about it. I don’t want to be the kind of parent who lies to their kid anyway.” Which means he should probably revisit the whole werewolves exist conversation at some point. Not until he coordinates with Scott, though.\nHe shakes it off. “Come on, Friday means McDonald’s breakfast. My treat.”\nAfter all, he probably only has a few hours left to enjoy this, and he’s going to be spending most of them at work.\nIn case of yelling, screaming, or the digging up of dead bodies, Stiles arranges for Scott to pick Rina up from school. And then there’s nothing to do but go to work and wait.\nLydia texts him just after noon. Leaving now.\nStiles’s stomach tightens with dread.\nThe rest of the afternoon, he can’t shake the feeling. Goose bumps rise on the back of his neck. The skin under his fingernails itches, and his mouth tastes sour, like he might throw up. By one o’clock the urge to go home is unbearable. Stiles locks the front door, picks up his backpack from the back, and snags one of the heavy walking sticks he keeps around for tourist season. The magic calls to him, whispering to hurry.\nThe last time Stiles felt like this, his mother was dying.\nDespite his sense of impending dread, the sun is shining. The sky is clear. When he reaches the house, Lydia’s car is parked behind Derek’s.\nAs he walks up the driveway, his gaze is drawn to the plot of land behind the house where they buried Peter. Stiles stares at it for a moment, knowing it doesn’t look right.\nThen he realizes the flowers are gone.\n“Oh shit.”\nBefore he even puts it all together, Stiles breaks into a run, following the urgent tug in his chest. He rounds the back of the house just in time to see Lydia blow a handful of purple petals into Derek’s face.\nDerek drops like a stone.\nLydia turns toward Stiles and he almost stops in his tracks. Her eyes are limned in red and her face shows no hint of recognition. The neckline of the shirt she’s wearing doesn’t cover her bite, and the unbandaged wound is red, festering.\nStiles sweeps out with his walking stick and knocks her unconscious before she can dope him too.\nWell, Stiles thinks, looking down at two limp bodies on the grass. Now what?\n*\nWith only a moderate amount of difficulty, Stiles carries Lydia inside. Right now she’s the threat, or whatever’s inside her is, anyway, and he needs to get her secured. He’s sweating by the time he lays her body on the floor in the attic, but he doesn’t have time to take a breather. He shuffles off his pack and pulls out the bag of mountain ash he burned earlier. At least now he knows what it’s for.\nFrom the shelf by the door, he takes a silver knife and a small crucible, which he fills halfway with ash. Then, gritting his teeth, he slices into his palm and holds it over the bowl. The mountain ash would probably work on its own, for a while at least. But with his blood as a binding agent, it’ll be stronger, last longer. May be gentler on Lydia too.\nWhen the mixture is thin enough to paint with, Stiles licks across his cut and murmurs a word of healing to stop the blood flow. Then he dips two fingers in the bowl and traces a six-foot-diameter pentagram on the wood floor, leaving the lines open at one end. After depositing Lydia in the middle, he closes the circle, feeling the barrier snap into place.\nThat’s one body down.\nStiles sets the crucible back on the shelf and washes his hands carefully before trudging back down two flights of stairs and into the greenhouse for supplies. He sincerely hopes he can wake Derek up, because carrying him will be a lot more difficult.\nThere’s still a handful of petals and pollen on the ground near Derek’s face, so Stiles gathers it up to take a look. They’re poisonous, of course, but not deadly. Derek will probably wake up on his own in a few minutes. But Stiles is anxious and doesn’t want to wait, so he reaches for his spark and ignites the petals before holding them in front of Derek’s nose.\nSlowly, Derek opens his eyes. “Stiles?” He pushes up on his elbows, then seems to think better of it, falling limply back to the grass. “What’s going on?”\nThe sixty-four-thousand-dollar question. Stiles opens his mouth to say I don’t know, but the truth comes out instead. “I think your dead uncle’s possessing my sister.”\nDerek stares at him for a long moment. “Maybe we should have that talk now.”\nThey probably should. Unfortunately—“We’ll have to multitask,” Stiles says, getting to his feet and then extending a hand to help Derek up. “I have a feeling it’s going to be a long day.”\nWhy does the shit have to hit the fan when the aunts are on vacation?\nInside, Stiles helps Derek to the couch and reaches for the phone. Not surprisingly, he gets Aunt Hestia’s voice mail. She’s always forgetting to charge her cell.\n“Hello, you’ve reached Hestia Martin. I’m currently out of the office. If this is regarding business, please leave a message and I’ll return your call as soon as possible. If this is Stiles, the answers you’re looking for are in the book on the table next to the bed.”\nStiles hangs up and looks at the phone. Derek does too. Finally he asks, “Was that weird?”\nStiles is forced to shake his head. “No, uh, Aunt Hestia’s got the Sight, so. This happens every once in a while.” He sighs. If he were a better nephew, he’d have called and gotten that message earlier, and then all of this could’ve been prevented. “I’ll be right back.”\nHe finds the book exactly where Hestia said it would be, on the table beside her bed. Days of the Wolf, the cover reads. There’s a bookmark sticking out of it. Underneath is a copy of a book Stiles has read before, Practical Exorcisms. Oh good. Now he’s prepared.\nWhen he gets back to the living room, Derek’s color has returned, and he’s sitting up straight on the couch, mouth a thin line. Stiles guesses it’s about time for that conversation.\nHe slides the books onto the coffee table and lowers himself carefully to the couch, keeping a full cushion’s worth of space between himself and Derek.\nDerek says, “Just tell me.” His face is scrunched up and his posture is defensive, like he’s bracing himself for a physical blow.\nStiles takes a deep breath and says, “Lydia killed Peter.”\nDerek doesn’t react, at least not outwardly, so Stiles swallows and fills the silence. “When they first met, she thought he was someone else, and they started an affair. Then she figured out who he really was and what he was doing. He bit her, and she lit him on fire.”\nDerek winces, but that’s the extent of his reaction. Stiles might as well finish the story.\n“And then she called me, and we buried him in the backyard. You showed up the next day.”\nLeaning forward, Derek puts his head in his hands. His voice is very quiet when he says, “He burned to death.”\nFuck. “Yeah,” Stiles whispers.\nFor a long time, Derek doesn’t move or say anything. He’s frozen in his own world. Then he says, “You should have told me.”\n“I wanted to,” Stiles says hoarsely. “Ever since the first day, I wanted to. But it wasn’t my place to tell you, not when Lydia was the one who…. And of course it probably wasn’t even her.” He picks up the book from the table and flips it open to the page Hestia bookmarked. “What do you know about the Worm Moon?”\nDerek looks over and shakes his head. Not much, apparently.\nStiles puts the book between them. “This is the page Hestia bookmarked.” It’s an old book, and it looks like the information has been copied from something even older; there’s a woodcut illustration depicting a skeletal man with sharp teeth who’s digging claws into the arm of a robust young woman.\nHe clears his throat. “Apparently there’s a ritual that allows a dead werewolf to steal power from an alpha and return to life, assuming they have a living accomplice.”\nDerek raises his eyes to the ceiling. “The bite. She’s immune to turning, but being an alpha comes with other powers….”\n“Yeah.” Stiles nods. “Which brings me to part two.” He closes Days of the Wolf and holds up Practical Exorcisms. “The longer we wait, the stronger his hold. I know I’m probably not your favorite person right now, but I’d appreciate your help if you’re willing.”\nUpstairs, something thumps loudly. With a sigh, Derek finally meets Stiles’s gaze. “Tell me what you need me to do.”\n*\nAll expectations to the contrary, Stiles has never performed an exorcism before. He’s never even heard of the aunts performing one. In light of that, he decides he’d better call in the experts.\nHe calls Deaton first. “So Lydia’s been possessed by a dead alpha werewolf and I could use your backup,” Stiles says when Deaton answers the phone at the clinic.\nThere’s a pause. Then Stiles remembers: “This is Stiles Stilinski, by the way.” His father took his mother’s name when they married, as part of the traditional fuck-you to their ancestors.\n“I have two surgeries left this afternoon,” Deaton says smoothly. “Seven o’clock okay?”\nGoogle informed Stiles that moonrise is at eight thirty. Peter’s power will start strengthening then and reach its height as the moon reaches its apogee. “That should work.”\n“Very well. Will you be needing to speak to Mr. McCall?”\nOh, good idea. Two birds, one stone. “If he’s available? I can call back or text him if this is a bad time.”\nHe can practically hear the eye roll. “Just hold a minute.”\nScott picks up less than two seconds later, obviously having overheard the entire conversation—werewolf hearing. “Did you say possessed?”\n“Yeah.” Stiles licks his lips and leans back against the couch. “Listen, Scotty, take the kids to your mom’s tonight, just in case. I don’t think he’s got a beef with you or them, but just—just in case. You’re strong enough to protect them.”\n“What about you? What about Kira?”\n“I’m going to need Kira here. She can take care of herself. And we’ve got Derek too. We should be okay.”\n“If you’re sure,” Scott says doubtfully.\nStiles is not at all sure, but he makes himself sound confident anyway. “Thanks, Scotty. See you on the other side.”\nGoddess help him, he can’t think about the possibility that this might cost Rina another parental figure. It’s not an option he can consider right now.\nHe gets through the rest of the roster as quickly as possible. Marin hates him, but not as much as she hates the idea of a psychotic alpha werewolf running amok in Half Moon Bay, so she’ll show up. Stiles has a pretty good relationship with the local priest, who agrees to attend as well. Some people would consider it crossing the metaphysical streams, but Stiles prefers to think of it as covering the bases. Between his witchiness, Marin and Deaton’s druid abilities, and the father’s abilities, they should be safe.\nThat’s the first part covered. Before he starts the next step, he checks on Lydia.\nOr whoever’s inhabiting her body.\nWhen he closes the door behind him, she sits up, her hair in disarray. When her gaze lands on him, her mouth curls up in a slow smile and she drawls, “Stiles.”\nSo not Lydia, then.\n“Peter.”\n“I’ve heard so much about you.” The tone alone send chills down Stiles’s spine; coupled with the way Peter moves Lydia’s body, it’s enough to make Stiles’s gorge rise. “A powerful witch by all accounts. You’d make a valuable asset to my pack. Just say the word.” He licks his lips, sliding closer to the edge of the pentagram.\nStiles steps back in disgust. “Are you trying to seduce me while wearing my sister? I knew you were a sociopath, but have a little common decency.”\n“Silly me,” Peter says smoothly. “I forgot. Still, one must work with what one’s been given.”\n“Lydia didn’t give you anything.”\nWaving a hand idly, Peter dismisses, “A figure of speech, of course. But really, Stiles, I have to thank you. Without you, my nephew never would have stuck around long enough for me to implement my backup plan.”\nStiles’s stomach feels hollow.\n“Really, he’s going to die anyway, isn’t he? Tell you what. Let me have him and I’ll give you your sister back. No harm, no foul.”\n“Are you going to monologue like a cartoon villain this whole time?” Stiles snaps, thinking of a body in the woods, unburied and unremembered. “Because if you are—”\nHe snaps his fingers. A spark leaps from his fist to the edge of the pentagram, then up Lydia’s hand to her throat. Peter goes limp.\nHuh, Stiles thinks. The benefits to using your own blood in a spell: only Stiles’s magic can cross the pentagram. Interesting.\nA second later Lydia sits up again, herself this time. “Get him out of me, Stiles,” she says through gritted teeth. “It’s like having Iago doing a running commentary in my head at all times. And that’s when he lets me drive.”\nStiles blinks. “From Aladdin?”\nLydia rolls her eyes. “From Othello, genius.” She sighs. “What did you do to him, anyway?”\n“Magic gag order. It’ll probably only last a few minutes; he gets stronger the closer we get to the full moon. Do you need anything?”\n“Just the exorcism, please. I can’t believe it took you this long to catch on.”\nStiles flushes. “It’s not like you were around!”\n“Mm-hmm,” Lydia says, one corner of her mouth drawing up in a knowing smirk. “And I’m sure you weren’t at all distracted by the presence of Tall, Dark, and Artfully Stubbled.”\nShe means it as a joke—he knows that. But it’s true. It’s probably already too late for Derek, and Stiles almost lost Lydia too. He can feel his face crumpling in on itself as emotion wells in his throat, and Goddess, he can’t lose it now, he doesn’t have time—\nThe door opens behind him, startling him into regaining control. Derek looks down with a concerned expression. “Everything okay in here?”\nStiles takes a shuddery breath just as Lydia rolls her neck and looks up, Peter in control once more. “No,” Stiles says honestly. “You stay with Peter. I have calls to make.”\nThe thing about exorcisms is that while they’re essentially designed to get things that shouldn’t be there out, it’s equally if not more important to keep the things that should be there in. There are five points on the pentagram, corresponding to four anchors and a lure. Derek’s the lure—obvious—but Stiles needs three more anchors who won’t freak out. And of course, in order to be successful anchors, they have to be people with connections to Lydia. Not so easy with the aunts out of town.\nStiles calls Kira first. She’s probably the weakest connection, but she and Lydia have known each other for a few years, and they’re both supernatural creatures, so there’s that. She’s representing Community anyway, so the link doesn’t have to be that strong.\nThe other three anchors, though. They have to be perfect.\nStiles is strong enough to stand for Family and perform the exorcism at the same time. But that still leaves Heart and Friendship to be filled, and that’s going to be awkward.\nWell, there’s nothing for it. Stiles thumbs through his contacts and dials Jackson Whittemore.\n“What do you want, Stilinski?”\nCharming as always. Fuck him. Stiles was going to ease into this conversation, but Jackson doesn’t deserve the consideration. “Your help saving Lydia’s life. She’s being possessed.”\nA pause. “What?”\nStiles sighs. “Look, you know the rumors about the aunts? True. I’m a witch. Lydia’s a banshee. The guy possessing her is a werewolf. If we don’t get him out tonight, he might be able to take over completely, so I need you to come over tonight. Seven o’clock. Ask your wife if you don’t believe me.”\nAnother pause. “You better not be fucking with me.”\n“Look, I wouldn’t call you if—” Stiles grits his teeth and swallows his pride. “I’ve never liked you. You’ve never liked me. But for some reason Lydia’s fond of you, and that—that might save her life, if you come tonight, so please. I am begging you. Seven o’clock.”\n“Okay,” Jackson says finally. “Fine. But if I find out this was a hoax—”\n“I swear to Goddess I’m telling the truth.” Fuck it, he’s going to owe Jackson Whittemore.\nNow for the worst part. “Listen. What’s your wife’s number?”\n“My—what are you going to do, Stilinski? Tattle? I thought you said you wanted my help.”\n“I do!” Stiles snarls. “You just better hope she can forgive Lydia for sleeping with you, because I need hers too.”\nJackson gives him the number.\nStiles allows himself a moment of embittered silence before punching in the numbers.\nShe picks up on the third ring. “Hello?”\nAnd Stiles is suddenly, unequivocally exhausted. “Hi, Allison.”\n*\nIn high school, Erica Reyes was Stiles’s best friend. Allison Argent was Lydia’s.\nThe aunts had mentioned the Argents—that they knew things, that they could be allies or enemies depending on their interpretation of your actions. Stiles took those veiled warnings to heart and kept his distance. Lydia, though—Lydia had never met a boundary she didn’t test.\nIt probably helped that Allison was sugar-sweet with a killer fashion sense and seemed content to play second fiddle to Lydia, who would never tolerate a usurper. Lydia dated Jackson more or less exclusively. Allison dated Scott and then, later, whoever she liked.\nThen they graduated and Lydia went to MIT. Allison and Jackson stayed local and, apparently, bonded out of mutual loneliness.\nOr, if you’re bitter, protective, and inclined to see the worst in people when it suits you, Allison got tired of being second chair.\nStiles has always taken things more personally than Lydia.\n“Stiles,” she says now, sounding surprised to hear from him. Surprised, and naturally suspicious. Well, she would be; Stiles has never gotten the hang of masking his feelings. “What’s going on?”\nStiles sees no point in sugarcoating it. “The werewolf who murdered your aunt Kate is possessing Lydia and I need you to help me get him out.”\nTo her credit, Allison doesn’t even sound surprised. “That was a werewolf?” She sounds like she’s about ready to start hunting for her crossbow. Stiles doesn’t have time for that.\n“A werewolf whose family your aunt murdered in cold blood by seducing a minor.” Allison’s not close with her family for reasons Stiles completely agrees with, but he’s not above reinforcing the whys of that when it suits him. “And then burning them alive. Not that this is in any way about your aunt,” he adds when he remembers he needs a favor. “I know you and Lydia don’t speak much anymore, but I don’t have anyone else to ask, Allison. Please.”\nShe only deliberates for half a second. “What time do you need me?”\n*\nWhich means, of course, that Stiles has to explain her presence to Derek. “Can I talk to you for a second?” he asks at normal volume, perfectly aware Derek can hear him through two floors.\nHe comes down the stairs a minute later with a face like a storm cloud. Stiles doesn’t blame him; he only spent a few minutes in Peter’s company and it ruined his day. “What’s going on?”\nLike ripping off a Band-Aid, Stiles tells himself. “One of the anchors I need for the exorcism is Kate Argent’s niece.”\nDerek sags onto the couch. “Oh good. I was just thinking what today needed was a grim reminder of my past.”\nStiles huffs in agreement and thinks about the bottle of Jack in the kitchen cupboard. “Tell me about it. Hey, can werewolves get drunk?”\n“If we try really hard,” Derek says, sounding like he’s thinking about it. “And with the right kind of wolfsbane.”\n“I’ll make a note,” Stiles says. For Scott’s sake, of course, since after this clusterfuck Derek will probably never speak to him again. He gives himself five minutes to sit and brood, and then he gets up. He has preparations to make.\nKira shows up at quarter to seven. “Got tired of watching the clock,” she explains with a small smile. Stiles steps aside to let her in.\nDeaton and Marin arrive together a few minutes after that. Stiles offers tea or coffee and receives, respectively, a polite “no, thank you” and dagger glares in response, so he counts that as a win.\n“Kira and Lydia are in the attic with Derek. The lure,” he elaborates for Marin. “You can go on up. Everyone else should be arriving shortly.”\nBefore the words are even out of his mouth, a Porsche pulls up behind Derek’s Camaro. Jackson and Allison both step out, which Stiles finds supremely weird.\n“Tea and coffee in the kitchen,” he says as Jackson brushes past him. “Lydia’s in the attic.”\nJackson barely grunts in acknowledgment as he follows Deaton and Marin, but Allison hangs back.\nStiles finds himself fighting back a sudden crushing wave of gratitude. “Thanks,” he says thickly, grasping her wrist. “For coming, I know it was probably… I know there’s probably a hundred things you’d rather be doing.”\nAllison’s sweet brown eyes go liquid soft. “Stiles….” She shakes her head. “I know you think what everyone thinks. And that’s my fault. I didn’t want anyone to know, I….” She bites her lip and looks off to one side.\nIntrigued, Stiles waits.\n“Lydia and I reconciled over a year ago,” she finally says. “And even if we hadn’t, I’m not sure I like the insinuation that I would’ve let her die because she occasionally fucks my husband.”\nStiles actually takes a half a step back in shock. “Uh,” he says, wondering how he managed to get his foot so far in his mouth this time. “That’s not what I—I’m sorry. That’s not what I meant to imply at all. I knew you’d come if I asked. It was just really uncomfortable asking? This is coming out all wrong.” He scrubs a hand through his hair and wishes he’d had time for a nap this afternoon. He’s already exhausted. “How do you get over your best friend sleeping with your husband, anyway?”\nAllison winces. “Well, it’s a lot easier when your husband isn’t the only one having an affair.”\nOh boy. So that’s why they’re keeping up the pretense of not being friends—to draw attention away from what must be an even more illicit and gossipworthy pairing. “Oookay then,” he says. “Well. You know where the attic is. We’re just waiting for one more and then we can start.”\nAllison nods tightly and makes a beeline for the stairs.\nBefore Stiles even has the door closed, Father Isaac melts out of the shadows and onto the porch. It’s creepy every time he does it, not that Stiles has him over often. Their ideologies conflict on a number of levels, though they’re complementary on many others. Still, he’s a nice enough guy once you get to know him.\n“Father,” Stiles acknowledges with a lift of his head. “Thank you for coming.”\n“Gotta protect my flock,” Father Isaac says with a half shake of his head. “Especially the ones who stray.”\nGood enough for Stiles. He closes the door behind both of them and leads the way upstairs.\nThe atmosphere in the attic is understandably tense, considering it contains a group of people who don’t know each other very well, plus a pair with a longstanding family history of antagonism and murder, plus a creepy werewolf possessing Stiles’s sister.\nEveryone stops what they’re doing when Stiles and Father Isaac walk in, and Peter folds Lydia’s body into a seductive pose and purrs, “Stiles. Have you reconsidered my offer?”\nAnd just, nope. Stiles snaps his fingers with a little too much intent behind it, because the spark that jumps from his fingers to the pentagram and into Lydia leaves her completely limp. Oops.\n“Well,” he says sheepishly, resisting the urge to rub the back of his neck. “Let’s get to work.”\nQuickly, he and Derek secure Lydia’s wrists and ankles to the heavy-duty D-rings Derek screwed into the floor outside the pentagram earlier. Stiles adjusts the length of the chain to keep her hands and feet inside the circle, just at the points of the star, and tries to make sure the leather is tight enough to hold and soft enough not to leave marks. He really hopes Miranda at the sex shop never finds out he’s using today’s purchase on his sister.\nNo sooner has Stiles tightened the last restraint than Lydia opens her eyes. “Stiles?”\nIt’s definitely her this time, and Stiles gives her a tight smile he knows doesn’t reach his eyes. “Hey, sis. I called your moms. They left me some advice.”\nLydia lifts her head a bit to look down at her body, then turns back to Stiles and raises an eyebrow.\n“Wow, stop with the judgey face. Those restraints are new.”\n“Ugh,” Jackson says, making a face, and oh yeah, Stiles might as well point out that—“You’ve got visitors.”\nHe absolutely doesn’t get choked up when he sees the tears in Jackson’s eyes as he takes Lydia’s hand, or the brave smile Allison gives her.\n“Okay,” he says. “Let’s get this exorcism on the road. Jackson, left hand.”\nJackson presses a sappy kiss to Lydia’s fingers before walking around the pentagram—apparently he does have some sense—to the other side, closest to Lydia’s heart.\n“Allison, right hand, please. Kira, left ankle.” Stiles settles his crucible beside him on the floor and reopens the wound in his hand. He’ll need fresh blood for this. “Derek, you know what to do.”\nDerek nods and opens the window behind him. Three stories down, there’s a big hole in the ground with a body in it. Stiles has saturated it with salt and gasoline and warded it against anyone coming across it by accident. He’s nothing if not thorough.\nDerek kneels by Lydia’s head, then leans over so he’s looking upside-down into her face. Stiles can feel it when he flashes red eyes at her, and the floor vibrates when he rumbles, “Peter.”\nLydia goes still and Stiles sees it the moment she changes, the moment Lydia fades to the background and Peter comes to the front. Her mouth opens and Derek pushes part of a scuba mouthpiece into it to hold it that way and prevent Peter from speaking.\nStiles takes a deep breath and tries to center himself. He needs to be calm, to focus on his sister and everything she is. “I need everyone to concentrate on Lydia right now. Focus on what she means to you, on your memories of her, anything that’s particularly strong. Preferably a good memory,” he adds. “Derek, I need you to do the same with Peter. Pleasant memories will work best, if you have any.”\nThen he swallows and looks back over his shoulder. “You guys are ready with your backups?”\nMarin and Deaton nod. Isaac shifts his stance, and Stiles swears he hears the rustle of feathers.\n“Okay.” But he’s trying his way first.\n“Danu, Brighid, Áine, Clíodhna, Ériu.” As he invokes the goddesses, the wind outside picks up, and a breeze blows through the room, ruffling the hair on the back of Stiles’s neck. “I call on you to protect our sister and banish Peter Hale.”\nPeter strains against the bonds, but they hold fast. Lydia’s body doesn’t have a werewolf’s strength.\n“Clíodhna, patron of our family, lend her the strength of her ancestors.” Stiles dips his free hand in the crucible and then wraps it around Lydia’s ankle. The skin feels hot beneath his palm, and her body jerks, but he can feel her aura; it’s not doing her physical damage. He passes the bowl to Kira.\n“Ériu, matron of this community, anchor her here that we may keep her with us.”\nKira repeats Stiles’s handprint on the other ankle. Peter’s thrashing intensifies. The air in the room grows cold as the wind whips through it, charged with an energy that dances over Stiles’s skin.\nKira sets the crucible down on her other side, next to Allison.\n“Brighid, friend of knowledge, fill her with your light and cast away the shadow.”\nAllison adds a bloody handprint to Lydia’s right wrist, then passes the crucible to Derek, who sets it beside Jackson.\n“Áine, keeper of hearts, protect what is ours and unbind the intruder.”\nJackson’s hand shakes as he presses a blood-and-ash palm print around Lydia’s left wrist. Peter screams, even through the makeshift gag.\nStiles meets Derek’s eyes over Lydia’s body and nods before beginning the final chant. “Danu, mother of all, excise this infection and free our sister.”\nAs Derek reaches a bloody hand for Lydia’s throat, Peter goes wild, thrashing so hard against the bonds that Stiles is afraid the D-rings might come unscrewed. Then Derek gets his hand around her neck and snarls, “Peter. Get. Out.”\nThe body on the floor chokes, arches, and exhales a fine red mist. It hovers over Lydia’s body for a moment, but it can’t get back in—not with five protective blood-and-ash barriers. There’s only one place it can go.\nStiles breaks the pentagram and the red mist, all that remains of Peter Hale’s spirit, flies out the window and down into his corpse.\nStiles hands Derek a lighter. “You know what to do.”\nHe doesn’t stay to watch, though. He has more important things to do, unbuckling a coughing Lydia from her restraints. Jackson, Allison, and Kira pitch in. As soon as she’s free, she’s more or less in Stiles’s lap, hugging him until he can’t breathe. “Knew you could do it,” she whispers as he hugs her back just as fiercely.\nThen, of course, she draws back and slaps him across the face. “That’s for not figuring it out sooner. I thought I was going to have to exorcise myself!”\nGoddess, it’s good to have her back. “Love you too,” he says thickly, blinking back tears.\nLydia makes an exasperated noise and hugs him again.\nAfter that, well. Stiles doesn’t know what it is, but something compels him to go outside and watch until the last of Peter Hale crumbles into ash. Lydia stands beside him, stoic, her fingers still laced with Jackson’s.\nDerek hunches upwind, collar turned up against the chill in the air.\n“Thanks for coming,” Stiles says as the moon finally crests above the horizon.\nThe breeze caresses his face and then gently dies away.\n“Well. That was anticlimactic. Just how I like my exorcisms.” Deaton steps up next to Stiles and shakes his hand. “Thank you for asking me to be a witness. You’ll be in touch if there are any complications.”\nIt’s not a question, but Stiles answers anyway. “You can bet on it.” He nods to Marin, and she meets his eyes, more assessing than disapproving for once, and then turns silently toward the driveway.\nWell, that was terrifying.\nKira claps Stiles on the shoulder and says, “You did good.”\nA bemused smile tugs at his lips. “Uh, thanks.”\n“I’m gonna go see if I can convince Scott to leave the kids at his mom’s for the night.” She winks. “See you tomorrow.”\nHe waves.\nAnd that leaves Stiles with Derek, his sister, his sister’s on-again off-again lover, his sister’s lover’s wife, and the local priest. If only they were walking into a bar, this would be the beginning to a terrible joke.\nAfter an interminable moment, Jackson exchanges a glance with Allison, then turns to Lydia and says, “Do you want to go somewhere to talk?”\nShe straightens, purses her lips, and looks down at her outfit, then the bloody handprints on her wrists. “Give me ten minutes to clean up. I’ll drive.”\nJackson follows her into the house.\nAnd then there were four.\nAllison levels a soft, sweet smile at Father Isaac. “Looks like it’s you and me. Do you need a ride?”\nStiles wants to laugh. Father Isaac doesn’t need a ride anywhere, from anyone. His transportation is built-in, even if it is usually covered by the cassock.\nBut Father Isaac smiles back. “Just let me get my Bible. I left it upstairs.”\nStiles watches him go—it’s an old book, from the 1700s, when Isaac did his training in Rome, so he understands why Isaac would want to make sure he has it—then squints at Allison.\nWho’s blushing.\nHoly shit. “Oh for the love of God,” Stiles says. It’s really the only blasphemy appropriate to this situation. “I hope you know what you’re doing.”\n“Well, the wings can be tricky,” she allows with the hint of a grin. “I break more bedside lamps that way.”\n“Jesus Christ.” Apparently Stiles has another Christian blasphemy prepared for just this situation. “Just don’t get pregnant.” That’s all they need, to incur the literal wrath of a god—any god. “Maybe don’t tell your dad either.”\n“Yeah, well, there’s a reason he’s not allowed inside the city limits unless he calls me a week ahead of time.” She shrugs, then takes a step back toward the Porsche. “Keep your pups in line,” she offers as a parting shot just as Isaac descends the stairs.\nRude. Well, at least she didn’t pull out her bow.\nWith a sigh, Stiles turns back to the smoldering pit and reaches for the shovel. This better be the last time he has to bury this asshole.\nNow that Derek knows the truth, Stiles expects him to leave. After all, Stiles betrayed him, and he’s had enough of that in his life. To his surprise, though, Derek doesn’t leave. Instead, he picks up the other shovel and helps Stiles fill in the hole.\nHe doesn’t say anything. Stiles guesses that in Derek’s shoes, he wouldn’t feel much like chatting either.\nWhen the hole has been filled in and Stiles is standing in the kitchen, watching the electric kettle and wishing he had the energy left to boil water instantly, he figures, what the hell. It won’t hurt to ask, right? Or at least not as much as it’s going to hurt later.\n“Do you, um. Do you still want to talk?” Stiles licks his lips nervously.\nDerek’s face is a study in expressionlessness. He sits at the kitchen table, his hands folded in front of him, his eyes downcast—until he meets Stiles’s gaze . “I’m willing to listen.”\nStiles takes that to mean he has some serious explaining to do, and nods as he reaches for two mugs. “I’ll just… let me get something.”\nWhen he returns with his old spellbook, Derek has moved the steaming mugs to the table, along with a saucer and the jar of honey. Stiles settles down next to him on the bench and slides the book onto the table.\nHis hands shake. Never before has he faced the prospect of telling someone he loves them and therefore they’re probably going to die.\n“In my family, we write down all our more complex spells.” Stiles runs his fingers down the cover before flipping it open. “This is my first spellbook, from when I was nine or ten.” He turns to the appropriate page. “And this is the spell that was supposed to keep me from falling in love.”\nHis heart is racing in his ears. Derek must hear it, because he tilts his head to look at him before tugging the book in front of himself, like he can’t help it. Like he might be interested in what Stiles has to say, in spite of everything.\nStiles doesn’t even know whether to hope for that. It’s stupidly selfish, because if Derek stays, he’ll die, and it’s going to hurt. The thought hurts already, after two weeks. But Derek’s alone, so alone, with no family and no pack and nothing to anchor him. Not like they anchored Lydia last night. Maybe he’ll think a few happy years would be worth it.\nMaybe Stiles should just open his mouth and explain already. “My whole life, I’ve avoided relationships because of the curse. Before you, I’d never even slept with the same person twice. I didn’t want to lead anyone on. But with you I couldn’t help myself. I didn’t want to stop. I liked having you around and the way you get along with my kid and you put your arm around me on the couch and it was good, and the whole time I felt like shit because I wasn’t being honest with you.”\nDerek still has his face turned down toward the book, and Stiles can’t get a read on him. He thinks he sees his Adam’s apple bob as he swallows. “This is the spell you cast to make sure you never fell in love.”\n“Yeah,” Stiles says quietly past the lump in his throat. “But all it did was ensure I’d fall in love with you instead.”\nInhaling sharply, Derek finally turns to meet Stiles’s gaze. “Stiles—”\n“I didn’t do it on purpose!” Stiles blurts. His eyes are burning but he can’t break eye contact. “If you leave now maybe the curse won’t kill you and—”\nDerek stops him with the press of a finger against his lips. His face is serious, his voice steady but low. “I’ve been cursed my whole life and I never gave up.”\n“But—”\n“Tell me,” Derek says, pulling his hand away.\nStiles shudders in capitulation. “I love you,” he says wretchedly, closing his eyes against bitter tears.\nDerek laces their fingers together and squeezes until Stiles looks at him again. “You never asked how I take my coffee.”\nAt first Stiles doesn’t know what to make of that. Magic hits him like that sometimes, with little practical hints about the people around him. Then he remembers that everyone who knows how Derek takes his coffee is dead, and thinks maybe he understands. He swallows and squeezes back.\n“You asked me in, you fed me, you made me feel—” He huffs and shakes his head, his cheeks stained with red as he clenches his jaw. “You made me feel.” He shifts closer on the bench. “I’m not going anywhere.”\nStiles’s words have deserted him, so he leans his head on Derek’s shoulder and just breathes him in until the panic fades.\nFinally Derek draws back, tugging him to his feet. “Come on,” he says. “It’s been a long night.”\nStiles strips mechanically, leaving his clothes in a pile on the floor. When he turns around after digging a pair of pajama bottoms out of the bottom of his dresser, there’s a huge black wolf in his bedroom. Stiles takes an instinctive step back before he can rein in the impulse. “If this is your way of telling me you don’t want to talk about it, I have to give you props for subtlety.”\nDerek whuffs and jumps up on the bed, looking at Stiles expectantly.\nHe climbs in, and Derek burrows under the sheets next to him, wriggling closer until he’s essentially using Stiles as a second mattress, or maybe functioning as a second blanket. It’s hard to tell the difference. He settles his massive head just below Stiles’s shoulder, then turns and licks his chest, over his heart.\nStiles threads the fingers of his left hand through his fur. “Okay, I get it,” he says. “I’m glad.”\nHis last thought before he falls asleep is that losing this is going to destroy him.\n*\nIn the morning, Stiles is more than a little surprised to see Lydia in the kitchen, doing the crossword over a bowl of cereal and a banana. “Hey. Didn’t expect to see you this morning.” He makes a detour to the table to smack a kiss on her hair before resuming his quest for coffee, which just goes to show how much he loves her.\n“You thought I was going to start sleeping with Jackson again right after being possessed by my creepy psychotic former lover for two weeks?” she asks, all judgment.\nAnd before coffee, too. Stiles looks into his mug, then at Lydia, and sighs. “I feel like this is a trap.”\nShe smiles as if she’s pleased with him. “We just talked. We have a lot of talking to do before we’re ready for more than that.”\nStiles sighs. Dammit, they’re determined to live happily ever after. “You’re going to make me stop selling him the fart tea, aren’t you.”\n“Yes, Stiles, I’m going to make you stop selling him the fart tea. But I promise to let you give him warts when he screws up.”\nStiles figures that’s about as fair as he can hope for.\n“I can’t help noticing that Derek’s car is still here,” Lydia continues, apparently in a quest to make up for all the sistering she missed out on over the past two weeks. “I take it he’s sticking around?”\nStiles nods, sitting opposite her at the table.\n“So why do you look like someone kicked your puppy?”\nSeriously? Stiles stares at her. “You want me to say it?”\nLydia pauses midchew, a baffling expression on her face, then swallows and pushes away her bowl. “Say what?”\nFuck. Fine. “I’m basically killing him, Lydia,” he snarls. “Sure, most of the time I can live in the moment, but sometimes? I’m going to be sad.”\nThen—weirdly—Lydia smiles. It’s gentle and a little smug, and it stings that she can smile right now, but—“Stiles. Do you really not know you broke the curse?”\nWait, what?\nShe rolls her eyes. “Honestly, you never did pay attention to Mom’s lessons, did you?” She taps the spellbook, which is still on the table from the night before. “Two spells, both with the same intention. One a curse designed to punish any man of our line who dared to fall in love. The other, a child’s wish to avoid heartbreak.”\nStiles licks his lips.\n“What happens when you multiply two negatives, Stiles?”\nStiles is still staring at her, agape, when Derek stumbles into the kitchen in dirty jeans and one of Stiles’s T-shirts. “What’s going on?” he asks, looking back and forth between Stiles and Lydia. “Your heartbeat just started going crazy.”\n“When the second spell is completed,” Stiles says aloud. He takes a deep breath and reaches for that darkness around his heart and it isn’t there. Holy shit. “When the second spell is completed, the two cancel each other out. The curse breaks.” He barks out a laugh.\nThen he pushes back from the table and throws himself at Derek, who catches him around the thighs, the beginnings of a reckless smile pulling at the corners of his mouth. “We’re gonna live happily ever after,” Stiles tells him fiercely, and seals the promise with a morning breath kiss.\n(Sunday morning, Stiles wakes when Derek jerks beneath him in apparent surprise. “’S’a matter?” he asks, sleepily rubbing his cheek over Derek’s chest. “Rina up?”\nDerek shakes his head. “Your aunts are home.” He sounds mortified, which doesn’t make any sense. “They want to know when they get to meet their new son-in-law.”\nNever mind. It makes total sense. Stiles buries a laugh against Derek’s skin and then sits up. “Come on. Time to face the music.”\nSix weeks later, at the prompting of the universe, he drops an engagement announcement in the mail, wondering who the hell he knows in Argentina.)\n "
}