{
    "id": "12634773",
    "url": "https://archiveofourown.org/works/12634773?view_full_work=true",
    "author": [
        "notsoobviousfangirl"
    ],
    "title": "I Think Clint Was Right",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "The Avengers (Marvel Movies)",
        "The Avengers (Marvel) - All Media Types",
        "Spider-Man: Homecoming (2017)",
        "Spider-Man - All Media Types",
        "Marvel Cinematic Universe"
    ],
    "relationships": [
        "Peter Parker & Tony Stark",
        "Peter Parker & Avengers Team"
    ],
    "characters": [
        "Tony Stark",
        "Peter Parker",
        "Clint Barton",
        "Natasha Romanoff",
        "Steve Rogers",
        "Thor (Marvel)",
        "Bruce Banner",
        "Karen (Spider-Man: Homecoming)"
    ],
    "additional_tags": [
        "5+1 Things",
        "kind of",
        "close enough",
        "Father Figures",
        "Tony is a father figure",
        "Hurt Peter Parker",
        "Science Fairs",
        "Avengers Family",
        "Alternate Universe - Canon Divergence",
        "Sort Of",
        "Misunderstandings",
        "It's all clint's fault",
        "Karen is super sassy",
        "So is FRIDAY",
        "Oblivious Peter",
        "Oblivious Tony",
        "One of My Favorites",
        "Confusion",
        "So much confusion",
        "Awkward Peter Parker"
    ],
    "language": "English",
    "series": "",
    "published": "2017-11-05",
    "completed": null,
    "words": "7,023",
    "chapters": "1/1",
    "comments": "295",
    "kudos": "16,724",
    "bookmarks": "2,151",
    "hits": "158,938",
    "summary": "<p>Or that time Clint eavesdropped on a few conversations, came up with a conspiracy theory, and convinced the other Avengers to go along with it; and Tony and Peter are left wondering how this kind of misunderstanding could have even happened.</p>",
    "notes": "<p>Hey, all! It's been a while!<br>I wrote this little ditty up with a friend of mine (she's super awesome! We co-wrote \"Worm Its Way In\", go check out that fic for her username on Fanfiction.net and more work by us). We had a lot of fun with it!<br>Also a general note about this fic: It's under the assumption that Civil War never happened. In this universe, Tony recruited Peter to help the Avengers out in Sokovia and May found out at some point after that. The rest of the events after that are canon.</p>\n<p>Enjoy!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Like it? Want more?<br>Let me know by leaving a kudos and/or a comment telling me so!</p>\n<p>Want to request something of your own?<br>You can leave a request here or on my Tumblr page (@notsoobviousfangirl). I also do reader-inserts.</p>\n<p>Thanks for reading! :)</p>",
    "text": "\n   Clint had gotten off on the wrong floor on his way to the kitchen and spent the past hour wandering around the lab floor when he walked by an occupied lab. Tony’s occupied lab. “You know, when I said you could help out more, this isn’t what I meant.” This sentence from Tony caught Clint’s attention. With the door half-open, he could see that Tony was on the phone with someone and he did not look happy with whoever it was.\n\n\n   “Who’s Tony talking to?” Natasha asked, startling Clint as she snuck up behind him.\n\n\n   “No clue.” He shrugged.\n\n\n   There was a small pause before Tony’s eyebrows shot up. “What I said- I didn’t say you could skip school! I do not need another call from May complaining about you getting detentions because you leave whenever you feel like it!”\n\n\n   “Who’s May?” Clint asked.\n\n\n   It was Natasha’s turn to shrug. “No idea.”\n\n\n   Bruce came upon the scene and looked at the spies in confusion. “What are you two doing standing outside Tony’s lab?” \n\n\n   “Of course I know about the detentions! I’m Tony Stark. You think I wouldn’t notice you were skipping school?” Tony snapped. \n\n\n   “Skipping school?” Clint looked to the other two. “Why is Tony talking to a child?”\n\n\n   “Good question,” Steve voiced, causing the rest of the Avengers to turn to look at the new arrival. “What’s everyone doing out here? We’re supposed to be having a team meeting.”\n\n\n   Clint shushed him. “Tony’s on the phone.”\n\n\n   “More important than your life?” he asked rhetorically. “You’re my responsibility. How are you supposed to go to a good college when you keep skipping school? When I was your age, I was already going to MIT.” There was a pause. “Yes, the MIT thing again! This is your future! You deserve to have a good future.” he snapped. A deep breath followed by a sigh and then, “Look, kid, I gotta go. Just stay in school and don't do anything I would do, okay?”\n\n\n   Steve, Clint, and Natasha all looked at each other. “You don’t think-”\n\n\n   “I do think.”\n\n\n   “What are we thinking?”\n\n\n   “Greetings, friends! Why are you all standing in the hallway?” bellowed Thor, walking up behind them.\n\n\n   The others let out exclamations of fright, having been startled by the god. Except for Natasha, who never got startled by anything anymore. “Thor!” Clint hissed. “What are you doing?”\n\n\n   “I just asked you a similar question, did I not?” Thor questioned.\n\n\n   “We’re trying to be discreet. You can’t yell when you’re being discreet!”\n\n\n   “What’s this about discretion?” Tony asked, once again startling the group. “Geez, what’s with you guys? You’re… jumpy, this evening.”\n\n\n   “Nothing, nothing,” Clint explained hurriedly, “We were doing absolutely nothing- ow!” He yelped as Natasha elbowed him in the ribs.\n\n\n   Steve jumped in to save them from this quickly derailing conversation. “I came to get everyone for a team meeting.”\n\n\n   “Another one?” Tony let out a drawn out sigh. “Let’s get this over with. I have things to do.” He then walked ahead of them toward the elevators.\n\n\n   Once he was out of earshot, Natasha turned to Clint with an expression of annoyance. “And you call yourself a spy.”\n\n\n   “Well sorry,” Clint muttered back, “I didn’t see you coming up with a better excuse.”\n\n\n********\n\n\n    \n“Show me your blueprints, kid. Tell me what you’re thinking,” Tony said to Peter as he cleared off a workbench by using his arm to sweep all of the items off of the surface and onto the floor.\n\n\n    \n“Um… I don’t really know, Mr. Stark. I didn’t really have a plan yet.”\n\n\n    \n“Well, I have plenty of options for you in my old files you can look at. See if any speak to you.” He flicked an electronic file off of his tablet and onto the holographic screen in front of them. “Pick one and I’ll talk you through it.” It would seem Tony was more excited about this venture than Peter was. \n\n\n    \n“Uh,” Peter mumbled awkwardly, “This is great and all, Mr. Stark, but I think I should probably come up with my own idea instead of just making one of yours.”\n\n\n    \n“No problem, kid, but you better come up with something fast. It’s due in a week and you haven’t even started.” Tony began pulling out all of his tools, or rather picking them up from where he threw them on the floor moments earlier.\n\n\n    \n“How do you know when my science fair is? I never even told you.”\n\n\n    \nTony smiled mischievously. “The same way I know about the detentions.” He leaned in close to Peter’s face. “I know everything.”\n\n\n    \n“Actually, Boss only knows because your Aunt May called him asking if he would help you with your science project, Peter.” FRIDAY stated helpfully.\n\n\n    \nTony glared at the ceiling. “Keep this up, FRIDAY, and you’ll be getting reprogrammed later.”\n\n\n    \n“I’m sorry, Boss. I thought you programmed me specifically to backtalk.”\n\n\n    \n“Moving on.” Tony turned to Peter. “Now back to your project.”\n\n\n    \nOnce again, Clint had found himself roaming the halls of the Tower and he stumbled upon this scene. He watched as the two interacted- science terms being used seamlessly as if they were actual English- and was slapped in the face by a realization, or rather a theory. “No way!” he gasped. \n\n\n    \nClint watched them for several more minutes as they started to make plans for some kind of robot. Or, at least it looked like a robot. Clint was not an expert in these sorts of things.\n\n\n~~~~\n\n\n   One week later, all of the Avengers, minus Tony as he was out on “business”, sat in the main living area flipping through random channels. Or more accurately Clint, Natasha, and Steve were fighting over what to watch. In the case of Clint and Natasha, literally fighting. In the case of Steve, disapproving stares and pleas for them to just decide already. Bruce didn’t care what they would watch as he was busy reading anyway, while Thor was more entertained by the fight happening on the living room floor than anything on TV. All in all, a normal day in the Tower. \n\n\n   “Give the remote, bird brain!” Natasha growled as she attempted to dislocate his elbow to retrieve the device from him.\n\n\n   “Never!” Clint yelled back dramatically, clutching the remote to his chest and rolling away from her.\n\n\n   The squabbling continued for a few more moments before Steve interjected. “Stop! Is that… Is that Tony?”\n\n\n   Bruce looked up from the book in time to see a glimpse of Tony’s face before the channel flipped to a nature documentary. “Wait, that was him. Turn it back for a second.”\n\n\n   Clint and Natasha both immediately froze. Clint was on the floor as Natasha stood over him, twisting his arm uncomfortably behind his back to try and make him drop the remote. Clint, in turn, was reaching over his head with his free arm, trying his best to poke her eyes out. At Steve and Bruce’s requests, they stopped and stayed like that for a minute. Clint clicked the button on the remote, changing it back to the previous channel.\n\n\n   “-Stark was spotted today at Midtown School of Science and Technology attending their science fair,” the reporter informed. It flashed to a clip of Tony walking through the school’s gymnasium past the various projects as he examined them. “No one knows exactly why Stark was in attendance, but some speculate he was looking for potential recruits for Stark Industries due to the falling number of employees.”\n\n\n   “I know why he was there!” Clint blurted, relaxing but making no move to try and get out of Natasha’s grip.\n\n\n   Clint said nothing after that, prompting Natasha to ask, “Are you going to tell us why he was there or make us wait in suspense some more?”\n\n\n   Clint was still staring intently at the TV as the camera panned over the many projects. “There!” he said, pausing the TV. “That kid! I saw him in Tony’s lab last week. Tony was helping him make his project.”\n\n\n   “Why would Tony help some random kid with his science project?” Steve asked.\n\n\n   “That’s weird even for Tony,” Natasha agreed.\n\n\n   “Remember that phone conversation we heard a few weeks ago? Where Tony was talking to a kid about skipping school? I think this is that kid. In the lab he mentioned the same detentions again. It’s gotta be him!”\n\n\n   “So… Tony’s been working with some random kid why exactly?” Bruce asked.\n\n\n   “Why would he not?” Thor asked, genuinely confused. “He is spreading his knowledge to this Midgardian child. That is a very noble cause!”\n\n\n   “Thor, an adult man spending too much time with a random child is considered stalking, so it’s not exactly noble so much as it is creepy and concerning,” Steve explained.\n\n\n   “But what if it’s not a random child?” Clint declared, waving his free arm to emphasize his point.\n\n\n   Natasha looked down at him, puzzled. “Explain.”\n\n\n   “Seemingly random kid comes out of nowhere that Tony is suddenly investing a lot of time and effort into? Does that not ring any bells for any of you?”\n\n\n   They all look at him blankly. “No.”\n\n\n   “Seriously? Random kid who would have born when Tony was in his twenties or thirties, back when he was still a playboy… Tony suddenly not only spends time with this kid but lectures him about school and college? Getting any hints now?”\n\n\n   Their brows furrowed. Steve looked at Clint as he crossed his arms in his somewhat signature thinking pose. “You’re not saying he’s-”\n\n\n   “No,” Natasha stated. “I had to do deep research when I went undercover as his assistant. I would know if he had a secret kid.”\n\n\n   “Not if Tony didn’t know either.”\n\n\n    \nNatasha looked at him and deadpanned, “Yes, I would.”\n\n\n    \n“Well, you may not believe me now, but just wait until I gather more evidence. Then you’ll have to believe me.” Clint attempted to cross his arms, which didn’t work very well as his right arm was still pinned to his back.\n\n\n    \n“Alright, you go do that.” Natasha then dropped her hold on him, causing him to all but flop face-first onto the floor. \n\n\n    \n“Thank you,” he said, voice muffled by the carpet, “My hand was starting to fall asleep.”\n\n\n*******\n\n\n    \nPeter was late, and currently freaking out about being late. Tony had asked him to come to the Tower after school for a suit upgrade, but Peter had been held up because some guy had thought it was a good idea to steal an old lady’s purse. Peter had, of course, helped, but now he was late for the meeting at Avenger’s Tower. Hence his current running through the halls barely looking where he was going. As it turned out, this was a mistake as he ran face-first into another person.\n\n\n    \n“Oh my god, are you okay?” the brick wall of a person asked Peter. When Peter looked up to see who it was, he was stunned to see it was none other than Steve “Captain America” Rogers himself.\n\n\n    \n“I’m so sorry,” Peter began to ramble as he often did when faced with strangers, nervousness, or embarrassment. Or in this case all three. “I didn’t mean to run into you. Did I hurt you? Of course I didn’t hurt you. What am I talking about, you’re Captain America.”\n\n\n    \nSteve decided now would be a good time to intervene, worried the kid would talk his ear off for the next two hours or pass out from forgetting to breathe. “Deep breaths, kid. It’s alright. I’m fine. Are you?”\n\n\n    \n“What?” Peter looked vaguely surprised that Captain America was actually still talking to him. “Yeah, I’m fine. I’m stronger than I look.”\n\n\n    \nHe chuckled. It was then he noticed who the kid actually was. Deciding to play it cool, he asked, “So what are you doing up here?”\n\n\n    \n“Oh, uh… I’m part of the Stark Internship. Mr. Stark told me to meet him in his lab to work on something.”\n\n\n    \n“Stark Internship, huh?” What kind of a child calls their father by their last name? Mr. Stark? Obviously this kid doesn’t know who Tony is to him. Or he’s lying. It was probably the latter, considering how nervous the kid looked. “Well you’re on the wrong floor for that. His lab is a few floors down. Ask FRIDAY and she’ll help you get there.”\n\n\n    \n“It is? Oh. Thanks,” Peter said, running back towards the elevator. At the end of the hallway, he suddenly turned and ran back. “By the way, could I have an autograph?”\n\n\n    \nSteve gave a short laugh. “Sure, kid. Got a pen and something for me to sign?”\n\n\n    \nPeter shrugged off his backpack and began digging through it, careful to not let Steve see the Spider-Man suit. After a minute he pulled out a notebook and a pen.\n\n\n    \nSteve flipped to a blank page. “I didn’t catch your name.”\n\n\n    \n“Peter. Peter Parker.”\n\n\n    \nHe then proceeded to write a short but sweet message before signing his name and drawing a quick shield next to it. Closing the notebook, he handed it to the boy. “Here you go, kid.”\n\n\n    \n“Thank you so much, Mr. Rogers,” Peter grabbed the notebook back and sprinted back towards the elevator, even more late than before. Several pencils and loose papers flew out of the still open backpack behind him. \n\n\n    \n“You’re welcome,” Steve trailed off as the kid was no longer close enough to hear him.\n\n\n~~~~\n\n    Natasha was waiting for the elevator to get to her floor when it stopped on another floor to pick up more people. The doors opened to reveal the doe-eyed teenager that Tony seemed to be taking under his wing. His shock and awe at seeing her standing in the elevator was quite obvious. Peter was so shocked to be meeting not one but two Avengers that he almost forgot to step into the elevator. It was only when the doors started to close and Natasha stuck out an arm to hold them open that he remembered what he was supposed to be doing.\n\n    \n“What floor are you going to?” Natasha asked, trying to be polite as well as ascertain whether or not this bumbling child was a threat.\n\n\n    \n“Uh, I don’t know.” That was an unexpected answer, even for Natasha. “Whatever floor Mr. Stark’s lab is on.”\n\n\n    \n“That would be floor 31,” FRIDAY said, automatically lighting the proper button.\n\n\n    \nThe two lapsed into silence after that; Natasha because she was trying to read him and Peter because ‘OH MY GOD IT’S BLACK WIDOW I’M STANDING NEXT TO BLACK WIDOW!’\n\n\n    \nPeter desperately wished he was meeting her as Spider-Man instead of himself. That way he could have a conversation about superhero things, maybe even challenge her to an agility competition or something. He had heard that she was amazing at acrobatics but he was curious to see how that measured up to his powers. As it was, he was just some dorky kid standing in an elevator with the Black Widow, staring at her like some sort of creeper. He needed to say something. Anything. “So… I like your… outfit?”\n\n\n    \nNatasha glanced down at her worn out, faded, arguably gross work-out sweats before looking back up at Peter. “Thanks,” she stated. They fell back into silence for a few moments before Natasha asked, “You said you were going to Tony’s lab, right?”\n\n\n    \n“Yeah…” Peter trailed off, then realized he should probably elaborate. “I’m a part of the Stark Internship. I’m here so he can teach me about...stuff.”\n\n\n    \nNatasha just stared at him. “I see.” There were definitely physical similarities between Tony and this kid. The brown eyes and brown hair were a start, even if Tony’s was darker than his. They also both used similar hand gestures- flippant and jerky in their crazed genius. The kid was a lot more awkward than Tony had ever been. Then again, growing up in the spotlight made people more confident and outgoing. When everyone was watching every single move you made, you had to make it look like you meant to do that or they’d eat you alive.\n\n\n    \nMaybe Clint was onto something. Maybe this kid was Tony’s. “What’s your name?” Natasha asked as they reached the 31st floor. She’d have to look into this kid later, see what she could find on him.\n\n\n    \n“It’s Peter,” he said, “Sorry, gotta go. Bye.” He ran out of the elevator and disappeared down the hallway.\n\n\n~~~~\n\n\n    \nBruce had been enjoying the quiet of his lab, working on his latest project when he heard a crash in the room next door. Looking up, he was just in time to see a kid barreling into Tony’s lab. Said kid began looking around the vacant room in confusion. Bruce stepped away from the lab table and approached the glass wall. He tapped on the wall to get the boy’s attention. “Can I help you?” he asked in confused politeness.\n\n\n    \nThe kid almost gave himself whiplash with how fast he spun around. “You… You’re Dr. Bruce Banner! There’s a picture of you in my physics class!”\n\n\n    \nBruce was even more confused now. “What?”\n\n\n    \n“You did a lot of work on anti-electron collisions! It’s so cool! I’ve read all about you, but I can’t believe I’m actually meeting you!”\n\n\n    \n“Thanks?” Bruce didn’t think he could get much more confused. He was soon to be proven wrong. “What are you doing in Tony’s lab?”\n\n\n    \n“I’m part of the Stark Internship. Mr. Stark asked me to meet him at his lab.” By this point Peter was getting a bit tired of repeating his story. And he wondered if he was even in the right lab. After all, how was Mr. Stark hoping to work on the suit and keep his identity secret when his lab had glass walls into another lab where someone else was working?\n\n\n    \n“Tony’s not here,” Bruce told him. “He went out a while ago and I have no idea when he’ll be back.”\n\n\n    \n“Oh.” Peter didn’t know what else to say. Instead he just stood there awkwardly for a minute, trying not to stare at another one of his idols.\n\n\n    \nBruce also didn’t know what to do. On one hand, he had no clue when Tony would be back and he didn’t want the poor kid sitting there for hours waiting for him. On the other hand, he didn’t know what else to suggest the kid should do.\n\n\n    \nLuckily both of them were saved by Tony’s voice out of nowhere declaring “I am Ironman.” Bruce looked around, confused. It wasn’t the first time Tony had used the intercom system to prank someone, but that was the most random thing to say. Tony’s voice continued to repeat the phrase. “I am Ironman. I am Ironman.” Somewhat embarrassed, Peter pulled his phone out and Bruce realized that it was a ringtone. \n\n\n    \n“Mr. Stark?” Peter answered.\n\n\n    \n“Where are you, kid? You were supposed to be here an hour ago.” Tony asked. \n\n\n    \n“Where am I? I’m in your lab. You’re the one that isn’t here.”\n\n\n    \n“Um… I’m pretty sure I would know if I wasn’t in my own lab.” It was then it dawned on him. “You’re in the one downstairs, aren’t you?”\n\n\n    \n“You have more than one lab?” Peter sounded shocked. \n\n\n    \n“Yes?” Tony wasn’t exactly sure why he was surprised at this point. “Have you met me?”\n\n\n    \n“Well then where are you?” Peter asked, starting to sound dangerously like a kid complaining to a parent.\n\n\n    \n“You’re in my tinkering lab. I’m on the 39th floor in my work lab. Take the elevator up and you can’t miss it.”\n\n\n    \n“Okay, Mr. Stark. I’ll be right up.” With that Peter ran out of the lab, barely sparing the time to wave at Bruce. “Nice to meet you. Bye.”\n\n\n    \nBruce blinked as he watched the kid dash out of the area. He had to admit the kid had a lot of energy. Too much energy. A Tony Stark amount of energy. “Hmm,” he mused as he turned and went back to work.\n\n\n~~~~~\n\n\n    \nThis time when Peter got into the elevator, it was empty. After only two floors though, it stopped and in walked the God of Thunder himself. \n\n\n    \n“Greetings, young one,” Thor spoke.\n\n\n    \n“Uh, hi.” It was hard not to be intimidated by Thor. He was giant and loud and one of the coolest Avengers. So Peter was awed, yes, but also intimidated. \n\n\n    \n“Where are you headed this fine afternoon?” asked Thor pleasantly.\n\n\n    \n“The 39th floor. To Mr. Stark’s lab.” Peter answered. “And you?”\n\n\n    \n“I do not have a specific destination. I merely enjoy riding in this wondrous contraption. It is amazing, is it not?”\n\n\n    \n“Yeah, elevators are pretty cool.” Peter was as awkward as ever, but something about the Asgardian was likeable and made him feel slightly less out of place.The elevator dinged and it was his floor. Peter waved awkwardly and left. \n\n\n    \n“Have a marvelous day, young one! It was an honor to meet you!” Thor yelled after him as the doors closed.\n\n\n~~~~~\n\n\n    \nNatasha had called everyone into a secret meeting in the communal kitchen. Steve, Thor, and Bruce were all there. No one knew exactly where Clint was, but they didn’t have time to wait for him. “Why are we here?” Steve asked.\n\n\n    \n“Because I saw the kid today,” Natasha began. “I met him, figured out his name, and looked into him.”\n\n\n    \n“Wait, you met him too?” Bruce asked. \n\n\n    \n“You too, Bruce?” Steve said.\n\n\n    \n“I, too, met the young one today. He was quite nice,” Thor told them.\n\n\n    \nNatasha gave him a look. “Not the point, Thor. Anyway, I looked into his background to see who his parents were.”\n\n\n    \n“And?” Steve prompted.\n\n\n    \n“Nothing. I couldn’t get to any of it and the stuff that I could was redacted beyond repair. I think someone’s trying to cover up the identity of his parents.”\n\n\n    \nBruce’s brow furrowed. “Are you saying what I think you’re saying?”\n\n\n    \nNatasha nodded. “I think Clint was right.”\n\n\n    \nA sudden crash from the vents above was their only warning before Clint could be heard yelling, “I was right?!” He landed in a painful heap on top of the counter before he groaned. “I knew it!”\n\n\n*******\n\n\n    \nSeveral months passed. School got out, and over the summer Peter had more time to visit Avengers Tower. Sometimes it was to work on the suit, but more and more often it was just to work on something random with Tony. The other Avengers also saw him more and more often, and they did their best to try and get to know him. None of them mentioned his possible father-son relationship with Tony, however. Mainly because they feared that if Peter didn’t actually know about it, they didn’t want to be the ones to accidentally reveal it to him. At least, no one mentioned it until now.\n\n\n    \nSteve glanced at the calendar- Tony said that having a wall calendar when you had smartphones and FRIDAY was pointless but Steve liked having a physical thing to write events on- to see that it was nearing Father’s Day. He wondered if Peter was going to get Tony anything. If he did, it would prove that Peter knew and they could stop tip-toeing around the issue. \n\n\n   Steve decided to confide with the others. “Do you think Peter is going to get Tony a gift for Father’s Day?” he asked.\n\n\n   “He hasn’t said anything about it,” Clint answered.\n\n\n   “Maybe we should ask?” Steve pondered.\n\n\n   “Like that won’t sound like it came out of nowhere.”\n\n\n   “What do you mean?”\n\n\n   “We’ve been making awkward small talk with the kid for the better part of six months and one of us just suddenly asks him a really personal question like that? Yeah, totally normal.”\n\n\n   “It has not been awkward.”\n\n\n   “We ask him about the weather, Steve,” Clint pointed out. “The \n\nweather\n\n. It’s pretty awkward.”\n\n\n    \n“Well how do you propose we ask him?” Bruce asked, trying to steer the conversation back on track.\n\n\n    \n“We could just gently start dropping hints,” Steve suggested.\n\n\n    \n“Hints? Have you met the kid? He’s thicker than a 2 by 4. He’d never notice,” Natasha quipped, “If we’re going to ask him we have to do it outright.”\n\n\n    \n“But who’s going to do it?” \n\n\n    \n“I vote Steve should do it. The kid looks up to him. Anyway, he was the one who wanted to know,” Clint said.\n\n\n    \n“I’m not the only one he looks up to. I think he likes Bruce more than me. Bruce should do it.”\n\n\n    \n“Do you realize how bad I am with people? The kid has a crush on Natasha.”\n\n\n    \n“Every time the kid gets within ten feet of me, he loses the ability to speak. He feels most comfortable around Clint. So he’s the one who’s going to do it.”\n\n\n    \nEveryone turned to Clint. “Uh,” he said, “Thor could do it?”\n\n\n    \n“Clint’s doing it,” Natasha repeated. And that was the end of that.\n\n\n~~~~~\n\n\n    \nClint walked around the corner into the living room, trying to look casual while rehearsing his lines in his head. Peter was sitting on the couch, studying. \n\n\n    \n“So,” Clint started, walking over to lean on the back of the couch. “How are things going with Tony?”\n\n\n    \n“Um…” Peter looked equal parts confused and awkward.\n\n\n    \n“You know the 18th is coming up in a few days…” Clint trailed off to wait for a reaction.\n\n\n    \n“What?” Now Peter was really confused. He wracked his brain for why that date would be important but found nothing. “Uh, yeah. The 18th,” he finally said, hoping Clint would clarify.\n\n\n    \n“Are you planning on getting Tony anything?”\n\n\n    \n“I’m supposed to get Tony something?”\n\n\n    \n“Well, I guess you don’t \n\nhave\n\n to. But I’m sure he’d appreciate the gesture.”\n\n\n    \nPeter immediately felt bad. What had he forgotten? Had he forgotten his birthday? That had to be it! What else could it be? He had to figure out what to get him. He couldn’t just \n\nnot\n\n get him something. “What would- uh- What do you think Mr. Stark would like? Any suggestions?”\n\n\n    \nClint looked startled by the question. “Pfft! Uh, I don’t know. You know him better than I do.”\n\n\n    \n“I do?” Peter looked like a deer in the headlights. Was he supposed to know Tony better than he did? Oh god, what had he done wrong?\n\n\n    \nClint noticed the look and immediately tried to make the situation better. “I’m sure anything you get him will be fine. With something like this, it only matters that you got him something.” He knows his own kids weren’t exactly creative in the gift department. The last few Father’s Days he’d gotten a mug that said ‘World’s Greatest Dad’ (homemade no less), a new drill set, and some arrows from the local sporting goods store along with a few handwritten cards with hand-drawn pictures of him fighting various creative foes- including tentacled aliens. “Maybe get him something cheap with a homemade card? I’m sure he’d appreciate that.”\n\n\n    \nPeter looked even more befuddled than before. “Wait, how old do you think I am?”\n\n\n    \nThe archer had had quite enough of this conversation. His people skills had been used up for the day. It was time to excuse himself before he said something stupid(er). “Well, I should go. I have… errands to run. I’ll see you around, kid.” With that, he got up from the couch and nearly bolted from the room. Once he was out of earshot, he let out a sigh of relief. “Nailed it.”\n\n\n~~~~~\n\n\n    \nTony hummed along with the music as he worked on improving the efficiency of the repulsors in his suit. He glanced up as FRIDAY suddenly turned down the music to see Peter standing awkwardly in the entrance to his lab, holding a small package.\n\n\n    \n“Hey kid,” he greeted, “Whatcha got there?”\n\n\n    \n“Oh, um. This is for you.” He thrust the package at Tony as if he were embarrassed.\n\n\n   “I don’t like being handed things,” Tony started automatically, but then saw the heartbroken look on the kid’s face and took it anyway. “But I guess I can make an exception.”\n\n\n   He glanced down at the package in his hand. It was wrapped in plain red wrapping paper and Tony realized it was a present. Not that he wasn’t grateful, but why in the world was the kid giving him a present? Seeing the expectant look on Pete’s face he began to unwrap it. It was a bag of cheap but good coffee and a card. He set the coffee down on his work table to take a better look at the card. The front proudly proclaimed “Happy Birthday” in bubble letters. The inside was a surprisingly good picture of Iron Man flying away from the Earth and the message “You’re out of this world! Happy Birthday, Mr. Stark!”\n\n\n   “Wow. This is… really something,” Tony said. He wondered if he had forgotten the day again. It couldn’t really be May 29th already? Last time he checked it was June. He had no clue where Peter had gotten the idea that it was his birthday. One look at Peter’s face though and he suddenly really didn’t want to let the kid down. “This is great, kid. I can always use more coffee. I practically live off of the stuff. Did you draw this yourself?”\n\n\n   “Uh, no. Actually I had a friend draw it. I’m not very good at drawing.”\n\n\n~~~~~\n\n\n\n   “MJ! MJ! MJ!” Peter exclaimed as he ran up to the girl at lunch. She raised an eyebrow. “I need you to do me a favor and not ask any questions!”\n\n\n\n\n   “Okay…” she replied.\n\n\n\n\n   He slammed a piece of construction paper onto the table. “I need you to draw a picture of Iron Man flying away from the Earth.”\n\n\n\n\n   She blinked. Then blinked again. She shrugged and then responded, “Okay.”\n\n\n\n\n   A few minutes later she was done and she handed the paper back to Peter. “Thank you \n\nso\n\n much!” He gushed, getting up and running off again. “I owe you one!” he called back.\n\n\n\n\n   “Okay.”\n\n\n\n~~~~~\n\n\n   “Tell them thanks for me.” Tony was desperate to get out of this situation and figure out what was going on. “All of this coffee talk is making me thirsty. I think I’ll go make myself some right now. Uh, I’ll see you later, kid. Thanks for the present.” Grabbing the coffee, he got up and left his workshop. On his way out, he whispered to FRIDAY, “What day is it?”\n\n\n   “It’s Sunday June 18th, boss,” FRIDAY replied.\n\n\n   Tony was now completely baffled as he stared at the container of instant coffee in his hands. “Why in the world would the kid think it’s my birthday?” Shaking his head, he went on his way.\n\n\n~~~~~\n\n\n    \nThe others were sitting in the kitchen, enjoying brunch, trying not to seem too eager to hear what had happened between Peter and Tony.\n\n\n    \n“Do you think he got him a present?” Steve asked. \n\n\n    \nAny answer was cut off as Tony stormed into the room, looking both confused and annoyed. He was carrying a bag of instant coffee and what looked like a card. Clint let out a silent cheer as he saw the kid had taken his idea. “Sweet, coffee,” he said, grabbing the bag out of Tony’s hands and starting to make himself some. \n\n\n    \n“You okay there, Tony?” Steve asked, noticing the look on his face.\n\n\n    \nTony just shook his head. “Why does the kid think it’s my birthday? Who gave him that dumb idea?” All eyes go to Clint, who continued to make the coffee as he whistled a showtune, pretending not to have heard what he said. “I’m just gonna take a walk. I need to figure this out.”\n\n\n    \nAs soon as Tony had left the room, Natasha got up from her chair and walked over to Clint. Upon reaching him, she smacked him across the back of his head, saying, “You had one job, Clint. What did you do?”\n\n\n    \nHis hand went to the injured spot on his head as he whined, “I did what you told me to! I suggested he get him a present, but also said he didn’t have to. I said nothing about it being his birthday!”\n\n\n    \n“Well then how did he jump to that conclusion?” Steve asked.\n\n\n    \nThis question would go unanswered for a few more weeks.\n\n\n*****\n\n\n    \n“Why do these mortals decide to keep the small animal if it causes so many problems?” Thor asked, staring in confusion at the movie.\n\n\n    \n“Well you keep Loki, don’t you?” Tony asked rhetorically.\n\n\n    \nThor nodded his head thoughtfully. “True. But I love Loki because he is my brother. This creature called a puppy seems to serve no valid purpose.”\n\n\n    \nIt was then Tony’s phone rang, the ringtone being the rather obnoxious song “Barbie Girl”. The others turned and looked at him in a mixture of confusion and annoyance. Tony didn’t have enough shame to really care or feel any sort of embarrassment towards the current situation. \n\n\n    \n“Tony,” Steve began, “why is your phone on? It’s movie night. You know the rule: No cell phones.”\n\n\n    \n“I had it turned off for all calls except emergency ones,” Tony stated somewhat defensively.\n\n\n    \n“\n\nThat\n\n is the ringtone you assigned to emergency calls?” Natasha asked.\n\n\n    \n“Yes, now if you’ll excuse me,” Tony said as he stood, the song starting to repeat again as the phone continued to ring. He walked over and entered the kitchen for an attempt at privacy as he answered the phone. “Yello?”\n\n\n    \n“Hello, Mr. Stark,” an oddly familiar, slightly computerized voice greeted.\n\n\n    \n“J.E.N.N.Y?”\n\n\n    \n“It’s Karen now.”\n\n\n   “Karen? Out of all of the names the kid could’ve picked, he chose Karen?” Tony said mostly to himself. He shook his head. “Okay, not the point right now. Why did you call me?”\n\n\n   “Peter is currently unable to do so himself.”\n\n\n   Tony was immediately concerned. “Why?”\n\n\n   “I recommended that Peter call 911, but he refused. I suggested calling you as a suitable alternative, however he is unable to do so. Therefore I am calling you instead.”\n\n\n   “Lots of questions right now, but I’ll stick with asking one. Why would Peter need to call 911 exactly?”\n    \n\n\n   “Because he is currently unconscious and bleeding from several stab wounds.”\n\n\n   Tony was immediately running out of the kitchen, intent on going to his workshop to retrieve his suit. “How bad is it? Send me his location. I’m on my way.”\n\n\n   “I can send you his current vital signs. He is alive, but in need of immediate medical attention.”\n\n\n   “Whoa, Tony,” Clint said as he raced out of the room. Without a word, all of the others chased after him. “What’s wrong?”\n\n\n   “Yes, send them to me,” Tony replied to Karen. He turned to Clint and simply said, “I have to go.”\n\n\n   “Oh no, you don’t. If this is about Peter, we’re coming too.”\n\n\n   “I agree, Man of Iron. You are like a brother to me. Anything that concerns my dear nephew concerns me.”\n\n\n   Tony dropped the phone from his ear and stared at Thor in utter confusion. “Nephew? What are you talking about? What nephew?!”\n\n\n   “Peter. Your son. On Asgard we often consider the children of our closest friends to be like nieces and nephews. Is this not the case on Midgard?”\n\n\n   Tony had graduated MIT with honors at the young age of fourteen. Yet the level of confusion he felt in some of his more challenging scientific courses couldn’t compare to what he felt now as he listened to Thor talk. “My s- What?! Peter isn’t my son!” He then realized this was a complete waste of his time, as Peter was currently bleeding to death behind some dumpster in Queens. “Look, I can’t do this right now. I have to go.”\n\n\n   “What? He’s not your son?” Clint asked.\n\n\n   “Then why is he always at the tower?” Natasha added.\n\n\n   “Yeah, man. That’s actually really creepy if he’s not your kid.” Clint stated.\n\n\n   Tony was totally fed up with this conversation. “Okay, this is a conversation we can have when I get back. Right now, I kind of have bigger things to worry about.”\n\n\n   “Like what?” Clint asked.\n\n\n   “Like the fact that Peter is unconscious and currently bleeding to death. Pretty sure that trumps any sort of conversation you want to have right now!” Tony told the others as he suited up.\n\n\n   “He’s right,” Steve said, having been silently watching the exchange. “We can figure this all out later. Everyone, suit up.”\n\n\n   “Wait, what? No,” Tony immediately replied. “No. I don’t need nor do I want you to go with. I got this.”\n\n\n   “Are you kidding? Even if he’s not your kid- which I still don’t totally believe, by the way- we’ve all grown to like the little twerp. We’re helping.” Clint said, grabbing his bow.\n\n\n   “No-”\n\n\n   “It’s decided. We’re going,” Steve stated with finality.\n\n\n   “Mr. Stark,” Karen’s voice was heard over the arguing. “I thought it would be wise to inform you that Peter’s blood pressure and heart rate have dropped to dangerously low levels over the course of this conversation. I would suggest you hurry.”\n\n\n   “Let us make haste to save our nephew who has fallen in combat!” Thor declared.\n\n\n   “I doubt it was much of a fight,” Natasha said, still sounding calm even as she hurried faster. “He probably just got mugged or something.”\n\n\n   “Can I just say how much I hate all of you in this current moment?” Tony said rhetorically.\n\n\n~~~~~\n\n\n   Peter groaned. His head felt fuzzy and everything hurt. It was worse than when he had a building fall on his head, then fell out of that plane, and gotten beat up by a guy in a flying suit. What had happened?\n\n   “You’re awake.” Peter opened his eyes at the familiar voice. At first everything was white. When his eyes adjusted to the light he saw Tony sitting next to the bed, looking far more relieved than his voice revealed. “You okay, kid?”\n\n   Peter attempted to say “Yeah, I’m fine,” but what came out was closer to “Y’h ‘m f’n.”\n\n\n   “I’m going to take that as a no.” Tony said. “You know you almost died, right? Had everyone really worried for a while there.”\n\n\n   “‘v’ryone?”\n\n\n   In answer, Tony turned towards the door. Peter looked and saw the rest of the Avengers huddled in the doorway. They looked like they wanted to come in, but were unsure if they could. In their arms were multiple bags of food and drink trays, which made their huddle even more squished. \n\n\n   “Can we come in?” Steve asked politely.\n\n\n   Peter nodded. Or at least as much as he could nod when his whole body felt like jelly.\n\n\n   The bulky characters entered the small doorway into the marginally bigger room (it was the biggest room the SHIELD facility had). The others sat down in various chairs, or on the small end table if you were Clint, and began to settle in. “Good to see you awake, Spidey,” Clint said as he took a long sip of his milkshake. \n\n\n   Peter looked alarmed as he turned to Tony. Tony, picking up on what he was thinking, responded with, “They saw the medics strip you out of the suit, kid. I think they’re smart enough to put the pieces together.”\n\n\n   Peter still looked upset that they knew. “Fear not, nephew, your secret is safe with us.” Thor reassured him. \n\n\n   “You do remember we established that he isn’t actually related to Tony, right?” Natasha asked.\n\n\n   “Probably,” Clint added, taking another sip of the milkshake.\n\n\n   “N’phew?” Peter asked quietly, only to be ignored.\n\n\n    “Yes,” Thor looks genuinely confused at Natasha’s question. “Though I do not see what that has to do with me calling Peter my nephew. He is as much my nephew as Loki is my brother, though we may not be related by blood.”\n\n\n   Tony rolled his eyes and turned to Peter. “Most of them are under the impression you’re my son,” he explained. “Even though I’ve told them \n\nrepeatedly\n\n that you’re not.”\n\n\n   “You can deny it all you want. Doesn’t make it any less true,” Clint stated as he popped a few french fries into his mouth.\n\n\n   “Don’t talk with food in your mouth,” Steve scolded, ever the one for manners.\n\n\n   “And stop eating my fries!” Natasha snatched them from him.\n\n\n   “You know I eat when I’m stressed!” Clint defended himself.\n\n\n   As the verbal squabble between the spies quickly turned into a physical fight, Peter turned back towards Tony. “Wh’re’s May?”\n\n\n   “At home, completely unaware of what’s happened to you,” Tony informed. “As far as she knows, you’re on an out of state field trip for the next two days. That gives us a day before the school contacts her about you being absent and a few more hours before she calls me to get some real answers.” He raised a brow at Peter. “Unless you’d like me to call her now, tell her the truth, and have a car bring her here to yell at you. Because we both know that’s what would happen if I called her right now.”\n\n\n   Peter hurriedly shook his head. “No th’nks.”\n\n\n   Bruce stared at Tony. “Seriously? That’s the best excuse you could come up with?”\n\n\n   “It was three in the morning before I even remembered to cover for the kid with his aunt. It was the best I could scrap together in an hour at that time of night without breaking several federal and state laws.”\n\n\n    Tony’s words began to fade for Peter as he started to drift off again. \n\n\n    “Get some rest kid,” Tony said, uncharacteristically gentle.\n\n\n   “Th’nks dad,” Peter mumbled, already too far gone to realize what he’d said.\n\n\n   Every head in the room swiveled to stare at Peter. “Ha!” cried Clint, only to be immediately shushed by everyone else. “I was right!” he continued quieter. In victory, he stole another fry from Natasha while she was distracted.\n\n\n   “I don’t know what you’re talking about,” Tony said, trying to appear nonchalant. “He said ‘dud’. Not ‘dad’. That proves nothing. If anything, it proves the doctors have put him on a drug dosage that’s too high for him.”\n\n\n   “You keep telling yourself that, Tony.” \n\n\n   Tony turned back to the unconscious Peter, only looking slightly annoyed as he muttered, “See what you’ve started?”\n"
}