{
    "id": "12756732",
    "url": "https://archiveofourown.org/works/12756732?view_full_work=true",
    "author": [
        "madeliefie"
    ],
    "title": "Gold and Silver",
    "rating": "Explicit",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "방탄소년단 | Bangtan Boys | BTS"
    ],
    "relationships": [
        "Jeon Jungkook/Kim Taehyung | V"
    ],
    "characters": [
        "Jeon Jungkook",
        "Kim Taehyung | V",
        "Park Jimin (BTS)",
        "Original Characters"
    ],
    "additional_tags": [
        "Alternate Universe - Office",
        "Alpha Jeon Jungkook",
        "Omega Kim Taehyung | V",
        "Falling In Love",
        "Top Jeon Jungkook",
        "Bottom Kim Taehyung | V",
        "Alpha/Beta/Omega Dynamics"
    ],
    "language": "English",
    "series": "",
    "published": "2017-11-19",
    "completed": "2017-12-13",
    "words": "22,864",
    "chapters": "3/3",
    "comments": "184",
    "kudos": "12,824",
    "bookmarks": "2,086",
    "hits": "191,438",
    "summary": "<p>It's an alpha dominated world and \"beta\" Kim Taehyung just wants to live his life to the fullest. </p>\n<p>Now, if only he could remember where he put his surppressants.</p>",
    "notes": "<p>Big thanks to my babies Daphie and Chanel for listening to me rant about this au, I love you so both so much. </p>\n<p>I hope you all enjoy this!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Thank you all so much for showing this fic so much love and support, I appreciate it so much. I really hope everybody enjoys this second part and thank you all so much for reading.</p>\n<p>Just a small bonus chapter, please enjoy!!</p>\n<p>Thank you for reading!!<br><a href=\"https://mobile.twitter.com/tigerstae\" rel=\"nofollow\">twitter</a></p>",
    "text": " Coffee brewing is the first thing Taehyung smells as soon as he steps inside the office.\nNow usually this wouldn't be a problem. Normally he'd actually be very thankful for this, because heaven forbid he gets through a day without his daily cup of coffee(more like four to five cups, but who's counting anyway?) but today the only feeling settling inside him is dread instead of happiness. He glances over at where his co-workers are standing, cups of coffee in their hands as they're busy laughing way too loudly. It's very hard to convince himself that they're not actually mocking him and this is how they normally act.\nHis throat is itching and he really feels like marching over to where the coffee machine is located in their tiny office kitchen to pour the liquid all over himself. The urge is strong. He had went to bed late last night and overslept this morning and missed breakfast and right now pouring coffee all over himself to wake him up looks like his best option at the moment.\nBut he won't do that.\nOne, he knows that it'll probably, most definitely, hurt like a bitch if the scalding hot liquid were to touch his skin and he'd probably get some serious second degree burns(plus, he's wearing his good tie today and if he were to end up ruining it he'd end up crying like a little baby in front of his colleagues).\nTwo, he knows that he'll probably, most definitely, get fired. Okay, maybe he's exaggerating on that one a bit. He knows that he'll only get a warning because his boss has this soft spot for him and Taehyung knows exactly what to say and what to do to get on his good side. Still, rather be save than sorry and not try and push his limit.\nAnd last of all, three, Taehyung is already incredibly-\n\"You're late,\" comes Jeongguk's voice as soon as Taehyung tries to sneak into his cubicle without being noticed. He curses Jeongguk for insisting that Taehyung take the cubicle right in front of his office. He knows now, after working for Jeongguk so long, why he did it. It's so that Jeongguk can watch him like a hawk and when Taehyung slips up, he will pounce and give Taehyung the paperwork he's too lazy to go through himself.\nAlready having accepted his defeat, Taehyung sighs and plasters a big smile on his face before turning around to face the alpha who's watching him with unimpressed eyes. \"Ah, boss, am I really late?\" He asks, giving his boss the most charming smile he can muster up. Jeongguk doesn't even move. \"What is time anyway? It's just a social construct that we're all trapped in, working until we-\"\n\"Taehyung,\" Jeongguk interrupts, folding his arms over his chest and Taehyung has to refrain himself from looking at the way Jeongguk's muscles move underneath the long-sleeved white button up. He wonders if Jeongguk sometimes does that intentionally or not, show off his arms to try and make the betas and some alphas jealous. Jeongguk sighs and Taehyung looks up from his shoulders to his eyes. \"Just. Follow me.\"\nInstead of waiting for Taehyung to answer, Jeongguk turns around and walks back into his office, knowing that Taehyung will have to follow him. Taehyung can't help but sigh as he places his jacket next to his computer on his desk. The device is already switched on, and for a brief moment he wonders who did that for him, but he pushes the thought to the back of his head as he glances at Jeongguk through the glass.\nHe looks stressed, and when Jeongguk looks stressed, or is stressed for that matter, usually everybody in the office will suffer from it. There's always this atmosphere whenever Jeongguk is in a bad mood and usually, most of the time anyway, Taehyung is the only one who can actually lighten Jeongguk's hellish mood. It has become such a well known fact throughout the company that everybody just looks at Taehyung whenever Jeongguk was in a bad mood. Taehyung thinks that when he accepted the job, he didn't only say yes to being Jeongguk's secretary but also the office's peacemaker.\nHis eyes quickly scan over the floor only to find that most of the people are already, not so subtly, looking his way. Some of them doesn't even have any decency and stares at him full-on. In the corner he sees Chaeyoung leaning into Jiyong's side, eyes set on Taehyung like she wants to burn him. She whispers in the alpha's ear while a smirk takes over her face, knowing that Taehyung is watching her. Taehyung has to stop himself from rolling his eyes.\nWith a little pep talk to himself, he turns around to walk into Jeongguk's office and feels a chill running down his spine when the alpha looks up from behind his desk, papers scattered all around him. If Jeongguk weren't his boss and also an alpha, Taehyung would've literally yelled at him. Before he went home yesterday he made sure that the desk was clean, paper free, not one thing out of place and already it looks like a tornado has hit it. The day had barely even started and already it looks like that.\n\"Close the door,\" Jeongguk speaks, snapping Taehyung out of his train of murderous thoughts as the alpha goes to sorting through the papers. Taehyung does as he's told and closes the door behind him. When he's done, he walks over to Jeongguk's desk and takes the adjacent seat. It's made of leather and Taehyung has never been more thankful for Jeongguk's expensive taste than he is at that moment as he settles back into the comfy chair.\nIt becomes perfectly clear that Jeongguk isn't the one who's going to initiate the conversation as he doesn't even look up from his papers. Taehyung bites his lips as another minute pass in silence between them. \"What's got you all worked up, boss?\" He asks finally when the silence between them has become too much. He hates it when Jeongguk is like this, makes him think that he's done something wrong. (Okay, so technically he was a bit late but Jeongguk was angry before that, so it's really not Taehyung's fault at all.)\nThe alpha doesn't look up as he continues sorting through the papers. \"Those paper that you gave me yesterday are gone and I think I might be freaking out,\" Jeongguk speaks calmly but Taehyung's known the alpha for long enough to know that there's truth behind his words. The way his eyebrows are furrowed, concentrated, lips pressed tightly together and shoulders way too tense. All telltale-signs of a Jeongguk that might be freaking out.\n\"The ones for Mr. Shin?\" Taehyung asks, a small smile taking over his face. He knows exactly where those papers are and if Jeongguk would have just listened to him and just work according to Taehyung's desk arrangement, he would have known, too. It's so silly, Taehyung thinks, here sits this editor in chief who's known for being one of the best in town and he freaks out over stupid little things. Adorable, really.\nJeongguk's head snap up to him, eyes narrowed and Taehyung knows that his head must be working overtime at the moment. \"Yes,\" He says, looking like a deer caught in headlights. He licks his bottom lip and Taehyung's eyes immediately catch onto the movement. \"Yes. Those papers. And I can't find them and I need your help because Mr. Shin is coming in two hours and I-\"\nThe alpha quiets down as soon as Taehyung stands up, a grin playing on the corners on his lips. He makes his way around the desk, beside where Jeongguk is sitting, and opens a drawer, where a stack of papers are neatly placed atop of each other. He can feel Jeongguk's eyes trailing his every move as he takes out the papers and starts sorting through them. It's not even thirty seconds later that Taehyung find the papers, smiling down at Jeongguk as he hands him the papers. \"These papers?\"\nJeongguk takes the papers with almost a practiced ease, eyes big and somewhat innocent and it makes Taehyung want to coo. \"Yes,\" he breathes out and Taehyung can see the relief washing over him, like a little toddler who's finally getting his way. It's strange to think that this is a man that so many people fear when Taehyung sees this...almost vulnerable side to him so many times. \"How did you know where this was? I've looked everywhere.\"\n\"Clearly not everywhere, boss,\" Taehyung smiles down at him and the smiles he gets in return makes him bite his lip. He moves in behind Jeongguk's chair, lets his hands wander to the tense shoulders and presses his thumbs down only a little bit onto the hard muscles, enough for Jeongguk to relax back into his chair. \"Why don't you just sit back, relax and take a breather. I'll get us some coffee and then we can officially start of the day on the right foot, okay?\"\nWith a sigh, Jeongguk looks up at him and nods. Taehyung sends him a cheeky smile before he makes his way to the door. \"Oh and Tae?\" Jeongguk's voice suddenly ringing out makes Taehyung stop dead in his tracks. He turns around to face Jeongguk and he's a little taken back when he's met with a smirking alpha. \"Since time is only a social construct you wouldn't mind if you get payed a week later, right?\"\nTaehyung stares at him with his mouth hanging open.\n-\nBeing born an omega in a world where alphas make the rules didn't sit quite right with Taehyung.\nFrom a very early age in life he wondered why he was restricted to do certain things only. It baffled him when he was younger and tried to stay out late only for him to get scolded by his mother. It surprised him when a group of alphas pushed him out of the way and told him that it wasn't a 'game for little omegas' when they played soccer. And it angered him when he was in the top five percent of his school only to be called into the classroom by his teacher that had told him he was 'too smart' for an omega.\n\"Don't take it personally, Taehyung,\" She had smiled softly, gently, as she let him down. She was a beta, pretty and young and Taehyung had wanted nothing more for her than to shut up at that moment. \"But omegas really don't need the kind of grades that you're getting.\"\n\"Why not?\" Taehyung had retaliated, fist clenched at his sides. By then he was already sixteen and had experience how unfair the world were to omegas. He had already known by that age that he didn't want to submit and play house, he wanted everything that he was capable of achieving. He wanted to build a life for himself, he didn't want an alpha building one for him.\nHer face had twisted in shock for only a second before she smiled again, a bit stiff. Taehyung saw right through her and her smile. \"Because, not to sound rude or anything, but omegas don't usually...work.\"\nTaehyung could feel his anger flare up. \"Why not?\" He asked again, this time through a glare and clenched teeth. He knew the answer to that, everybody in the world knew the answer to that, but he was angry and he wanted her to flatter in front of him.\n\"Because usually they don't have to,\" She had fired back and he saw the fire burning in her eyes. He saw the way she looked down on him at that moment, like a beta looked down on an omega, not like a teacher would usually look down at a student and it was getting personal, he could feel the atmosphere swift in one motion. She wasn't better than him and she never would have been, Taehyung knew, because unlike alphas and betas he actually worked his ass off to get his marks. It wasn't handed to him on the silver platter that alphas and betas loved sponging off of.\nHe had held up his head, a smirk had graced the corners of his lips. \"And what makes you think I don't want to work, miss?\"\nHe hadn't even waited for a response as he picked up his bag and walked out of the class. Her shocked expression was enough to motivate him. He was going to show them all that he was more than the narrative he was suppose to live up to.\n(Needless to say, her attitude towards him for the rest of the year had been bitter.)\nUniversity was a bit more open than he had expected. He had always thought that the alphas here would try to show their superiority over him and the amount of omegas would be limited, but he was happily proved wrong in both aspects. Instead, here the alphas were sweet, charming and dangerous. Dangerous not in a way that Taehyung feared for his safety but dangerous more in a way that made Taehyung fear for his future.\nIt didn't take him long to realize why so many omegas had university degrees but were sat at home, taking care of everything. It was because university was basically a mating ground for young unmated alphas, betas and omegas. It was in uni that people fell in love and decided that love was more important than their future(that one was one the omegas part). Taehyung thanks the heavens above that he dodged at bullet there. He didn't want to study his ass off only to graduate and immediately start a family afterwards. Sure, love sounded great and he wanted it (who didn't?) but above anything else Taehyung wanted a life for himself, too.\nIt was also at uni where Taehyung had met Jimin, an alpha with a smile so charming and and a personally so bright that he immediately befriended him. It was a little awkward at first, because an omega and an alpha usually couldn't just \"be friends\", and of course people gave them \"knowing looks\" that made Taehyung nearly rip out his hair right out of his skull(luckily Jimin was always by his side and made it bearable for him).\nBut he ignored the alphas(and some betas here and there) that wanted to court him. He instead focused on books, on his classes, on everything that would help him in the future to become an editor. From early in life Taehyung had known that this is what he wanted to do, he wanted to read and to help and to make dreams come true. He wanted to get lost in the stories and fall in love with characters that he knew didn't exist but still felt a deep connection with. He wanted everything and he was not going to give it up easily.\nAfter graduation things got a bit more...complicated, to say the least. Taehyung had graduated as one of the top students in his class but employers where he gave his resume in didn't look at that. No, instead they had looked at the word \"omega\" that was written on his application form where it stood next to \"secondary gender\". They had looked passed his grades, pass his accomplishments and they looked at somebody that they thought couldn't do the job that he was so clearly qualified for.\nFor three years it went on like that.\nHe was lucky when he got a job as a barista at the coffee shop neas his and Jimin's shared apartment.\nTaehyung was getting tired. He was getting tired of relying on his parents for money because the amount he was getting was too little to cover his expenses, he was getting tired of Jimin's \"it's okay, Tae, I really don't mind\" whenever he couldn't pay the full amount of rent. He was getting tired of doing a job that was draining his soul right from his very being. It was time for Taehyung to take action.\n\"You can't do this, Tae!\" Jimin had said once he found out about Taehyung's plan. It didn't matter what Jimin thought Taehyung should and shouldn't do because his mind was already made up by then and he was filled with a new kind of determination. It was a determination that was built on anger and bitterness and all the inequality that he had experienced. It was a determination that was fueled by a fire in him that was burning to take over and show everybody that he could do the things he had set his mind to.\n\"Why not, Jimin?\" Taehyung had asked back, ready to take on the world. It was finally time for him to get what he worked for all his life and he wasn't going to let anything or anyone deter him in any way. \"It's not illegal to lie about your second gender.\"\nJimin had fixed him with a look. \"It's not illegal but it is dangerous,\" He had said as if Taehyung hadn't known that already. A young unmated omega working in a place filled with alphas and betas was basically asking for trouble. \"And you can't just change your status to beta on paper. What about your smell, huh? And your heats? Or more importantly, and you have to forgive me for saying this, Tae, but what about your instincts?\"\nIt didn't feel like a slap to his face because it wasn't. Taehyung knew that his natural instincts were those of an omega, knew that when his mind told him to submit that his body wanted nothing more than to submit. But Taehyung could control them, he could and he had to. He just had to. And for his smell and heat...\n\"I have suppressants that I'm going to start taking,\" He answered but he didn't meet Jimin's eyes. He didn't tell Jimin that he's already ordered the suppressants in dozens and he certainly didn't tell Jimin that it was already in his room, beside his bed in his little drawer.\n\"Tae,\" Jimin had looked at him with something that looked like sympathy, eyes soft and lips pressed into a pout and Taehyung had known Jimin long enough to know that he still wasn't convinced in the slightest.\n\"Jimin,\" Taehyung had sighed as he rubbed his forehead. \"You're an alpha. You get to easily live out your dream. Please understand just because I'm an omega doesn't mean that I don't want to live out mine, too. I'm...I just want to be happy, too.\"\nJimin had sighed and Taehyung knew he won.\nThe moment that he he got a callback from Jeon Publishing House Taehyung had felt like he could jump with joy. The job was only a secretary position for the new editor in chief but Taehyung knew that he had to start somewhere in the business and why not start there? He could easily learn from an editor and maybe that could further his knowledge also. The only problem with the company was that they didn't hire omegas at all and Taehyung knew that if they were to find out about his true status that he would be truly fucked. It didn't bother too much at that moment because he was Kim Taehyung, a beta.\nIt wasn't until he was sat in the office waiting to be interviewed, three other alphas besides him that were reeking of pheromones, that the nerves were starting to eat at him. By then he had already been taking his suppressants a month and his smell was completely gone but he still couldn't help but be paranoid as the other three applicants kept throwing him dirty looks.\nSlowly, one by one, the three of them were called into the office and Taehyung's nerves skyrocketed every time one of them came out with a defeated look on their face. He had hoped and prayed that whoever was on the opposite side of the door would go easy on him. And after what had felt like an eternity he was finally called into the office.\nTo say that he was shocked was an understatement because behind the desk had sat...a kid. The guy couldn't have been older than Taehyung and there he sat, a cocky smile on his face and a smell so strong that it made Taehyung a bit dizzy. He smelled of sandalwood, different than what Taehyung had previously encountered but still so pleasant. He was gorgeous, too, dark brown hair separated in the front and it had shown his forehead. His face was handsome but still young and fresh and his eyes were somewhat...innocent. An alpha, clearly, and he had to stop himself from sniffing out loud. He was there to get a job, not to fall into a pit that was made up of this one alpha's smell.\nTaehyung couldn't help himself. \"You're young.\"\nThe alpha had cocked his head to the side, a little smile had played on his lips as he observed Taehyung. It was silent for a minute, them just staring at each other and Taehyung had felt tiny under the alpha's gaze. Finally the man had licked his lips and rested his chin in his hand as he gestured for Taehyung to take the seat across from him. \"And the sky is blue.\"\nAnd just like that the tension in the room had been lifted.\nThe interview went well, the alpha had introduced himself as Jeon Jeongguk and had explained to Taehyung that this was his uncle's business and he was taking over as editor in chief as per his uncle's request. He also explained that since this was his first time doing the job that this was also his first time looking for a secretary. The conversation had flown easily and when Jeongguk asked why Taehyung hadn't worked in the industry before he had made up a silly little lie about touring and discovering the world a bit first before entering the working world. He couldn't up and tell Jeongguk that nobody wanted to hire him because of his omega status. And he certainly couldn't tell Jeongguk of his true status seeing that it was against company policy to hire omegas. It was unfair, but it was life and Taehyung had already come so far.\nAfter Jeongguk was done he had a smile on his face as he examined Taehyung. \"So, Mr. Kim,\" he had said and Taehyung could feel his heart skip a beat or two. \"When can you start?\"\n-\nThe thing about being an omega that's working as a beta is that Taehyung has to be careful.\nCareful and cautious.\nOn a daily basis he's surrounded by alphas, who's always trying to one up each other, who's always reeking of pheromones and who's always trying to show their dominance. At first it was hard for him with all the mixed smells and it was hard for him to not submit to each and every one of them but...Taehyung has found a way to ignore all the mixed feelings he has whenever he walks into the office.\nIt's not the most perfect method of dealing with everything around him but he's somehow become so accustomed to Jeongguk's smell that his body doesn't even register the other alphas around him anymore. By now, his mind is focused on Jeongguk and Jeongguk only. And Taehyung....he finds that he doesn't mind this at all. Jeongguk's smell is different and pleasant and unlike any other and maybe there was one too many times where Taehyung had tried sniffing him subtly and maybe it worked. Maybe Jeongguk's smell is the only thing that's keeping him sane and Taehyung doesn't want it any other way.\nTaehyung's not stupid, not at all. He knows what this means. He knows what it means when his heart skips two beats whenever Jeongguk smiles at him. He knows what it means when he gets a little weak in the knees whenever Jeongguk touches him. He knows what it means when it's Jeongguk's image in his head when his bed is a little too lonely at night. He knows what it means when his mind only registers Jeongguk's smell and nobody is else's, even when he's in the presence of Jimin.\nHe's not sure if it's love or not, but he knows that Jeongguk is the only one who affects him like this and he's the only one who's ever affected him like this.\nThe thing is; Beta Kim Taehyung doesn't stand a chance with Alpha Jeon Jeongguk.\nThat's simply the way it is. Alphas stick with omegas and vice versa and betas stick with betas. It's the way their bodies are made. Alphas and omegas can't be attracted to betas, it's not in their biology. Their bodies are made up of all these things that attract each other, that makes them want to mate and to love each other. There is no place for a beta in the equation.\nBut Taehyung isn't blind either, he sees the way that Jeongguk's gaze would linger on him for a bit too long. He sees the way that Jeongguk would smile at him, like his father smiled at his mother, he feels it in the way that Jeongguk touches him, soft and gentle, like he's trying to protect him, like an alpha protecting their omega. Maybe it's his mind playing tricks on him, maybe it's just him imagining things he wants to happen, but Taehyung is almost positive that Jeongguk must feel...something for him.\nHe hates this, because now it's an entire mess. Taehyung is a \"beta\" and betas don't end up with alphas. He doesn't even want to imagine the war going on inside Jeongguk's head if he happens to feel something for Taehyung. He himself wishes that they weren't in this situation, he himself wishes that the world wasn't so unfair towards omegas. He wishes that he could have met Jeongguk in another life, one where they could meet and everything could easily fall in place.\nHe sometimes wonder what would happen if he were to reveal his true status to Jeongguk. Would he be happy? Angry? Disappointed? It doesn't matter, now, anyway because Taehyung's already come to the conclusion that he's fucked either way.\nLife is a war, and no matter how many times Taehyung stands up, he will always get knocked back down. You can't fight a war that you were destined to lose in the first place, anyway.\n-\n\"Why was Jeongguk in such a pissy mood this morning?\"\nTaehyung looks up from where he's busy typing to the voice that had suddenly interrupted him only to be met with Chaeyoung's smirking face. He feels something twist in his gut.\nThe thing about Chaeyoung is he doesn't trust her at all. From the first moment he stepped into this office the alpha had always made the hair at the back of his neck raise and it became very clear that she didn't quite like him, either. Taehyung doesn't have enough finger on his hands to count the amount of times she tried to sabotage his work or the amount of times she 'accidentally' spilled something on him or the amount of times that she just simply stated she didn't like him at all. It was when those things happened that Taehyung really needed Jeongguk's scent to calm him.\nThere's just something about her that screams 'bad news' to Taehyung whenever she's near.\nHe turns his head to the side, away from her as he continues working. \"I don't think that's any of your concern.\"\n\"Fiesty, fiesty, Tae,\" She laughs as she takes a seat on his desk. He almost wants to ask if she doesn't have any work but he doesn't bother, knows that it'll be useless to try and argue with her if she's already so set on bothering him. \"I just want to know why boss man was so angry. Can't I be concerned?\"\nTaehyung doesn't even look up from the computer screen as he keeps on typing. \"Not when your only concern is you.\"\nThere's no point in even looking at her because Taehyung can feel the glare thrown his way. It's only silent for a few heavenly seconds before she speaks again. \"Whatever. I don't even want to know anyway.\"\nTaehyung doesn't even try to hide his eye-roll at the childish response as he watches her leave. There is something seriously wrong that woman, he knows.\nBut still, he can't help and think that she might be on to him. Too many times has he found her snooping around his desk and her excuse was always that she was sent to get some papers whenever he caught her. Too many times he could feel her eyes on him whenever he was with Jeongguk, and it was obvious that she was observing the way he acted around the alpha. There was just too many times that he had felt that she knew more than she let onto and it made him act extra careful around her. The suppressants he keeps with him at work, just in case, has been locked in his desk and only he has the key but he still somehow can't shake the feeling that she....suspects something.\nHe has to be careful. Careful and cautious.\n-\nSometimes, when the hours of the day are too short and the work too much, Jeongguk stays afterwork.\nTaehyung recalls all the times he accidentally forget something at work only to come and get it and find Jeongguk still behind his desk, where Taehyung had left him hours earlier. It was a sight, Jeongguk alone in the office, determination on his face as he typed on his laptop or wrote on some papers. After the sixth time that it happened Taehyung decided that he was going to stay if he knew Jeongguk was going to stay later, too. The least he could do is offer Jeongguk some company in this big and lonely space.\nTonight is one of those nights.\nThe moon is already out, its light blending in with that of the office and it's starting to get windy outside, a light-light tap on the window occasionally but inside the office it's warm, and they're protected from what the outside world has to offer.\nSometimes Taehyung gets so lost in Jeongguk's presence that he forgets that he has a home, and that he's probably making Jimin worried with being out so late and he forgets about all the shows he could be catching up on because on nights like these Jeongguk is different; open.\nIt was on a night like this a year ago when Taehyung had fallen. It's on nights like these when Taehyung continues to fall.\nNot a word is exchanged between them as they both sit in Jeongguk's office, stacks of paper in front of them as the comfortable silence engulfs them completely. It feels right like this, somehow, like this is the universe's plan for them. Not the work part, but the part where they're together. Taehyung feels it in his bones, somehow, that this is what it's suppose to be like.\nHe remembers the first few times that this happened. At first it was awkward, because back then they didn't really know each other all that well and back then Taehyung had still thought it was a silly crush and back then he hadn't known what these nights could actually mean to him. It was only after a few times that things had started falling into place a bit more.\nJeongguk had looked up at him one night from his papers, only a few words had been exchanged between them that night, and he had cleared his throat, gained Taehyung's attention.\nHe had looked up from the papers he was busy reading over for Jeongguk into big, brown eyes. \"Yes?\"\n\"Why do you do that?\" Jeongguk had asked, head tilted to the side as he watched Taehyung work. Taehyung had been confused as he stared back at the alpha and he raised an eyebrow, a feeling close to amusement had starting building up in him and he couldn't help but smile at Jeongguk's random question.\n\"Do what?\"\n\"That,\" Jeongguk had gestured to his face. \"You stick your tongue out when you concentrate really hard.\"\nTaehyung had blushed at his old habit. \"It's something I've been doing since I was a kid.\"\nJeongguk had looked at him with a secretive smile and a shake of his head. \"You fascinate me.\"\nThat was the first time that Taehyung had felt his heart beating too fast in the presence of Jeongguk.\nBut now it's easier for them. Over time the stiff atmosphere had relaxed into this silence where they could both be comfortable in and still know exactly what's going on in the other's mind. Now, they share smiles that they wouldn't dare share during daytime and now there's a sort vulnerability that hangs in the air, ready for them to share all their secrets.\n\"I ordered some pizza,\" Jeongguk says as he looks up from his papers, a small smile on his lips. Taehyung catches his eye over his own stack of papers and he feels his heart swell. It's not really fair how Jeongguk can say the most simplest things and make Taehyung feel like his six feet under what he guesses must be somewhere between like and love. But. Here he is, gone for Jeongguk and everything the alpha does.\nHe retaliates the smile, makes it one of his most charming. \"Thanks, I didn't really get much of a lunch break today with the way you ordered me around.\"\n\"Hyung,\" Jeongguk fixes him with a look and it's in moments like these that Taehyung remembers that Jeongguk is still so young, still has so many things out there waiting for him in the future and thinking about it makes his heart clench, he can't help but wonder if he's also in in Jeongguk's future. \"I did not order you around today.\"\n\"You can't recall the way my feet were bleeding by the time we were almost finished for today?\" A dramatic sigh escapes Taehyung as he places a hand over his chest, where his heart is located. \"Makes me wonder how much you really care for me, Jeongukkie.\"\nThe playful eye-roll doesn't go unnoticed on Taehyung's part but before he can say anything a ringing sounds fills the room and Jeongguk quickly grabs his phone and hold it up to his ear. \"Okay, I'll be right down,\" He speaks into the receiver before putting the phone down and grabbing his wallet. \"The pizza is here. I'm just quickly going to go get it.\"\n\"Okay,\" Taehyung can't help but smile. There's something in the way that Jeongguk always buys them food whenever they're working late that is just so...domestic. Like he's trying to make sure that Taehyung really is eating and that he's the one providing the food for Taehyung.\nHe can't really recall the moment he started having these ideas. The ideas of him and Jeongguk in their own little nest with nobody to bother them but lately the thought has been a recurring one and Taehyung knows he's in trouble. Knows that no matter what he'll somehow break in the end and that he has nobody to blame but himself. This was his idea and now he's not the only party involved anymore. Now he's dragged Jeongguk into this mess, too, and somehow that makes it even worse.\nBecause now, it'll be two people heartbroken once Taehyung eventually has to leave.\nAfter five minutes has passed Jeongguk returns with two pizza boxes in his hands and Taehyung quickly stands up to grab one of the boxes. They make it back to the desk and push the papers to the side. \"I don't know why you always order so many food,\" Taehyung comments, but opens one of the boxes anyway. He had been serious when he had said that he didn't really eat much today and he can feel the effect that it's having on him now. The pizza is pepperoni, Taehyung's favourite, and he already feels his mouth water. \"It's not like you're trying to feed an army.\"\nJeongguk sits, amused, as he watches Taehyung eye the pizza with hunger. \"No,\" He say. \"But you eat enough for an army so I have to order a lot.\"\nIt's a little childish, but Taehyung sticks his tongue out at Jeongguk before he finally takes a bit of the food. Jeongguk's laughters rings in the background as Taehyung eats.\nThey continue to eat in silence, Jeongguk his pizza and Taehyung his until both of them are full. Almost together they push the boxes to the side and upon seeing each other's faces, they can't help but burst out laughing at the entire situation. Taehyung is rubbing his belly as he sits back in the seat and right now he feels so content. This is the nights that he lives for.\nJeongguk stands up and take both boxes. He closes them before stacking them on each other and placing it next to his desk before he returns back to his seat, where he also lays back against the leather, eyes closed. Minutes, or hours, Taehyung's not too certain, pass in nothing but quietness and Taehyung almost feels like falling asleep but he's quickly reminded where he's currently at when his phone goes off.\nHe can feel Jeongguk's eyes on him as he takes out his phone.\n\nFrom: Chim\n\nWhere are you??\n\nTo: Chim\n\n\n@ the office, be home later!!\n\nHe sends the reply and doesn't bother to check if Jimin is going to reply before he pockets his phone again, putting it on silent so that he's certain that no sound can disrupt him and Jeongguk again.\nThe alpha eyes him with caution. \"Who was that?\"\nThere's smile that automatically makes its way to his lips. \"My friend asked me where I am,\" He replies and it become clear that Jeongguk doesn't believe him when his eyes narrow, lips pulled into a pout and if Taehyung didn't know any better he'd say that Jeongguk is...jealous. It's adorable seeing the alpha so worked up over nothing and Taehyung wants nothing more than to take Jeongguk in his arms and reassure him. But he can't. He can't do that. So he settles on the next best thing, the smile he always uses when he wants to get his way. \"My best friend.\"\nJeongguk seems to relax and throws him a charming smile. \"Do you want to take a break? Go outside?\"\nSome fresh air really does sound good right now and Taehyung nods happily as he stands up and follows Jeongguk to the door in his office that leads to a little balcony that overlooks the city perfectly. Outside it's chilly and a shiver runs downs Taehyung's spine as soon as he steps out. The lights from the city look close to perfect from where Taehyung is standing and he steps closer to the rail, lets his elbows rest there as he overlooks the lights.\nSoon, a presence comes to a standstill beside him snd Taehyung doesn't know how to explain that he feels grounded with Jeongguk besides him. It's enough, this, them standing so close together but not saying anything. In moments like these they don't need words. All they need is the silence that speaks for them.\nSomething about the night feels different, the moon looks like it knows something that they don't when Taehyung looks up at the sky and if he closes his eyes he can almost hear the gossip going on between the stars as they look down on them.\n\"Did you hear about the new law that forbid omegas to work in the police force?\" Jeongguk's voice is soft, but Taehyung can hear the anger behind it. Jeongguk has always been one to stand up for the injustice against omegas and Taehyung knows that there's not really any alpha like Jeongguk out there. He can feel his heart beat speeding up and he doesn't know if it's only him that feels it but the atmosphere between them is different...soft.\n\"I did,\" Taehyung replies, not once looking at the alpha. Instead his eyes are focused on the sky and what it holds. He knows that if they were to discuss that newly announced shit law that he would only feel saddened.\n\"It's so fucking unfair, hyung,\" Jeongguk says and Taehyung can hear the frustration in his voice. \"Why can't the world just stop being so shitty towards omegas?\"\nTaehyung wishes he knew the answer to that. He doesn't say anything, doesn't really need to because there's not much to say. Instead, he sends Jeongguk a small sad smile before looking back up at the stars and the moon again. He wonders what they're hiding to shine so exceptionally bright tonight.\nHe can feel Jeongguk's eyes on the side of his face and he doesn't know what to make of it. This moment...it really feels like Taehyung's in a daze. He doesn't know what to make of this feeling bubbling so deeply inside chest that it almost feels like he can explode, so he doesn't do anything.\n\"You're gorgeous.\"\nThe words rings in Taehyung's ears before it's even properly out of Jeongguk's mouth. He looks to his side only to be met with a wide-eyed Jeongguk. The alpha clearly didn't mean for those words to slip if his open mouth and big eyes are anything to go by and it draws on Taehyung that this is the secret the moon and stars were discussing amongst themselves. This is it, he know, the night that will change it all.\n\"Oh,\" He whispers and he's pretty certain that he feels exactly like Jeongguk looks in this moment. The alpha has always been subtle in his feelings towards Taehyung, always these shy little looks or soft little touches or gentle words but never has he blatantly expressed anything so...openly. Taehyung's heart is dancing inside of his chest, doing the waltz and tango and whatever other dance that can leave him breathless as he looks at Jeongguk. He hasn't even realized that they've stepped closer to one another and he doesn't really care either.\nThey're so close that Taehyung can practically feel the heat radiating off Jeongguk's body and over the span of the two years that he's worked for the alpha is this the first time that they're this up close. Maybe it's the night that had taken them over, because fuck, this would usually be avoided at all cost. This...thing between them. It's like the air. They know it's there, they can feel it around them and they can let it indulge them from time to time, but they absolutely cannot let it take them over. It's a dangerous, dangerous game that they know they'll lose if they were to play.\nThere's soft fingers caressing his face and Taehyung thinks this is something between a dream and reality. \"Can I,\" Jeongguk's voice is so gentle and Taehyung's knees are weak. \"Can I kiss you?\"\nTaehyung doesn't think twice about nodding as he waits for Jeongguk to lean in. He watches it in almost a slow motion, watches as Jeongguk steps closer, feels as he pulls Taehyung's face towards his. Taehyung holds his breath.\nAnd when Jeongguk's lips finally meets his, Taehyung knows that this is what dreams are made. Everything feels right, everything around him suddenly just makes much more sense and Taehyung, in that moment, falls into the pit so deeply that he knows he won't ever get out again. Jeongguk's lips were made for him, Taehyung thinks as he presses closer to the alpha.\nIt feels like everything and nothing in one as Taehyung locks his arms around Joengguk's neck as the alpha pulls him closer by his waist. Jeongguk's hands fit perfectly in the space between Taehyung's ribs and waist and he thinks that the universe has made them for each other. Taehyung opens his mouth to take a breath and Jeongguk uses that as an opportunity to slip his tongue inside his mouth. A moan accidentally leaves Taehyung's mouth as Jeongguk explodes the inside of his mouth with his tongue and he's vaguely aware of Jeongguk's hands on the back of his thighs before he's being lifted. Immediately he wraps his legs around Jeongguk's waist and tightens his legs.\nThe concrete wall feels hard against his back as Jeongguk presses him against it but he doesn't pay it much mind. Not when he finally has Jeongguk like this.\nThe harsh reality of the situation comes crashing back down on him when Jeongguk pulls away from him body, making Taehyung almost fall to the ground but luckily he steadies himself and lands on his feet. Jeongguk's eyes wide and scared and he looks so lost that Taehyung's heart clenches for him.\n\"I,\" The alpha is at loss for words. \"I...need to go.\"\nTaehyung wants to scream and cry at the same but his throat feels dry, too dry, and he can't seems to say anything as he watches Jeongguk rush inside, not even looking back at Taehyung once.\nBitterly, Taehyung realizes that this is what the stars must have been gossiping about as he feels his heart fade away in his chest.\n \nTaehyung's whole body feels heavy as he drags himself up the stairs that leads to his apartment. It feels like there are bricks tied around his feet, making it difficult for him to walk. Everything around him feels wrong, everything in him screams that it's wrong and Taehyung feels like curling up in a little ball to cry because his whole body aches, including his mind. Everything hurts and he knows that the inevitable tears will start falling soon.\nThe moment he steps into his shared apartment, he snaps and he feels like his body knew that this is where he'd feel most comfortable in breaking down. Right now all he wants is comfort and Jimin, because even after all this time Jimin can still calm him down. Not in the way an alpha can calm down an omega but in the way a best friend can calm down another. He needs nothing more than reassuring hands and words and he knows that Jimin will happily provide.\nThe tv is off when he steps into the living room, but on the couch sits the blonde alpha that Taehyung is lucky enough to call his best friend. He guesses that Jimin must've sensed that something is wrong because they moment the he looks up from where he's busy on his phone, his eyes hold nothing but sympathy. It's kind of pathetic how fast Taehyung makes his way over to Jimin.\n\"Oh Tae,\" Jimin breathes as he puts his phone down next to him on the little table they have there. Things like this, things like Taehyung breaking down, doesn't happen often but when they do Jimin knows exactly what to do. He pulls Taehyung down, so that his head is resting in his lap and runs a hand through the omega's hair. Everything in this moment feels like it's a mixture of being in a daze and being torn down and Taehyung doesn't know how to control it. Jimin's scent is helping, the pheromones he's letting wave off him that makes Taehyung relax a bit, calms his shaking body. \"Oh, Tae-baby. Tell me what happened.\"\nThe hand in his hair doesn't stop and for that Taehyung is grateful. He knows that he doesn't immediately have to tell Jimin, knows that the alpha will sit patiently and wait for Taehyung until he's ready to let out, until his heart feels like it's not suffocating him and he can breathe normally again. He continues to cry, lets his hands play with the material of Jimin's pants, lets the hand in his hair do its job and he lets his heart calm down, collects all the pieces inside of his chest until he has enough courage to fully face what's happened. He knows that if he finally admits what happened out loud that it will feel less like a horrid dream and more like the reality he's so scared of facing.\nAfter some time, maybe it's a few minutes or maybe it's a few hours, Taehyung's really not too certain, his tears finally dry and he takes a deep breath. He can feel Jimin's eyes on him, can feel the concern tracing over his body, can smell it. He remembers Jeongguk's word so clearly. Will always remember it so clearly. It's been engraved into his heart, his soul, his mind, his veins ever since the word's left Jeongguk's lips and he knows that it will always stay with him, even if Jeongguk doesn't always stay with him. He'll carry the words with him, treasure it like a trophy and bathe in the words when he needs them most.\n\"He said I was...am gorgeous,\" Taehyung doesn't really need to specify who said that because he knows Jimin knows. Of course Jimin will know who he's referring to. It's not like Taehyung been completely smitten with this certain guy for the last year and a half and it's not like Jimin been the one he's been ranting to...except, Taehyung has been smitten for the last year and a half and Jimin has, in fact, been listening to him rant about him. \"And asked me if he could kiss me.\"\nThe hand in his hair stills momentarily and Taehyung can practically feels Jimin's confusion burning in his bones. It's okay. Everything's okay. If he keeps repeating it to himself maybe it'll be true at the end of the day. After the initial shock, that last about a full thirty seconds, wears off, Jimin continues with his soft strokes, making Taehyung a bit more relaxed. \"Did you let him kiss you?\"\nTaehyung takes a deep breath. In and out. \"I did.\"\n\"And?\"\n\"And he kissed me,\" Taehyung says, as if Jimin doesn't already know this. It's just...the words taste so good on Taehyung lips, it lets the bittersweetness of the entire situation melt away and he just relishes in that small little detail. Relishes in what he always thought would stay a fantasy. Too fucking bad that the fantasy turned into a horrid nightmare as soon as it happened.\nThere's a sigh from Jimin. \"Tae...\"\nThe tears that start falling again doesn't come as a surprise to Taehyung. His eyes feels raw from the amount of tears it's let out in the short amount of time he's been crying. Everything feels so hazy and weird and to think of it now, Taehyung only really wants to Jeongguk. \"I know, okay?\" Taehyung doesn't snap, doesn't do anything except let his voice take over because his mind's too numb from running a mile a minute. \"I know I fucked up. But Jimin...he kissed me...and...and it was like seeing the stars for the first time.\"\n\"Must you be so dramatic?\" There's no malice behind Jimin's voice and Taehyung can practically hear the smile. He doesn't want to laugh, because damnit, he's sad, but still he doesn't try to hide the little smile that made its way onto the corners of his lips. Jimin's hand in his hair reassures him that night for the millionth time as it brushes some hair from his forehead. \"Tae. If it's truly, honestly meant to be, then it will be. No matter what.\"\nThat night Taehyung falls asleep on Jimin's lap, breathing slowly fading away and the last words he hears are Jimin's as it rings in his ears, a picture of Jeongguk appearing in his mind. Right before he completely blacks out he can hear his mind whisper to his heart; it's meant to be.\n-\nWalking into the office the next day is normal. His co-workers are still standing next to the coffee machine like a bunch of zombies, Chaeyoung still sends him a glare when he passes her cubicle, he can still hear that annoying clock on the wall ticking by the seconds one by one and nobody looks at him like they know what happened last night. All in all, everything is normal. It's normal and it's okay. \nExcept.\n\"Where's Jeongguk?\" He asks Jiwoo, a nice beta girl working in the cube next to his. She glances up from where she's busy with her computer and looks to Jeongguk's empty office. Usually, by now, Jeongguk would've been here already. Most of the time he's here before the required 8 a.m to set up for the day and it's already five minutes pass eight and Jeongguk's office looks like a ghost town, deadly silent with nobody that occupies it. Taehyung can feel his stomach start to turn and he doesn't get a good feeling at all.\nJiwoo smiles at him before she looks down at her keyboard again to start and type. \"Didn't you hear?\"\nTaehyung can feel the confusion building up in the pit in his stomach. He has to stop himself from telling Jiwoo that, no, he didn't hear because he literally just arrived at work, but he figures that sarcasm will get him nowhere. \"No?\"\n\"Jeongguk called in sick,\" Jiwoo says, not looking back up from her computer. It's a good thing that she doesn't look up because if she were to she'd see the shock taking over Taehyung's face.\nThat's a lie. A complete and total lie. Jeongguk doesn't get sick. Wasn't it Jeongguk who had proudly stated that fact to Taehyung one night when they were alone? Wasn't it Jeongguk who never once called in sick ever since he's taken over his uncle's spot? Wasn't it Jeongguk who said that a little medication can cure anything? Yes, yes and yes.\nIt's obvious what's happening. He's being ignored. Jeongguk is pulling that card, the one where he can avoid Taehyung for as long as possible and get away with it until he can't anymore. He's making this harder for the both of them because instead of facing his fears like a man he's running away like a little boy and leaving Taehyung alone to fight this unpredictable war that they've placed themselves in on his own. Taehyung wants to strangle him on first thought but as he thinks more about it he kind of get where Jeongguk is coming from. This is all new for him, having feelings for a \"beta\" and he probably needs some time getting used to it, needs some time to figure out what's going on in his own mind. The least Taehyung can give him is some time. After all, he's the one that put Jeongguk in that mess.\nThe day drags on, Taehyung doing his job, answering the phone and explaining that Jeongguk is away, he'll be back shortly, hopefully. He does some paperwork, gets some coffee, talks some shit with some of his colleagues. It's a normal day. It's normal. But more than once he finds himself glancing towards Jeongguk's office and wishing he'd see the alpha smiling back at him instead of the lonely, empty space he meets instead.\nThe next day is the same story. Taehyung being met with an empty office and he tries not to let his disappointment show too much. It's okay, he tells himself as he types up a report, it's okay. Jeongguk just needs some time. Taegyung just has to give him some time to adjust. Another day passes like that, Taehyung being met with and empty office and by now he's kind of frustrated. He knows that their meeting is inevitable, Jeongguk can't just ignore his work forever. At one point he'll have to come back and face the reality that fills Taehyung's dreams.\nIt's on the forth day after their little incident, the Friday, that Taehyung walks into the office to be met with people rushing around. The last few days have been vacation for them, with Jeongguk gone, and they've all taken it as a mini vacation, lazing around and taking more coffee breaks than necessary, but Taehyung can't help the feeling of excitement building up in the pit of his stomach as he sees his colleagues rushing around. And when he gets to his cubicle a big smile breaks out on his face. Because there stands Jeongguk behind the glass door, looking like the embodiment of alpha. There's a stern look on his face as reads through some papers, shirt clinging to his shoulders like it'll rip any second. He looks angry for some reason but Taehyung won't let that deter him.\n\"He's in a mood,\" Jiwoo says as Taehyung puts his jacket on his chair. \"Just...sort him out, please.\"\nTaehyung doesn't reply, barely nods before he makes his way into Jeongguk's office. He's nervous and excited and he can't quite describe what it feels like but he can admit that he's happy seeing Jeongguk after so many days. The alpha doesn't even look up from his paper as Taehyung enters his office, doesn't flinch, doesn't move, nothing and slowly the smile fades off of Taehyung's face. Even Jeongguk's smell is different to Taehyung, bitter almost. The feeling in his stomach soon turns into a bad one and this one Taehyung knows perfectly how to describe; dread.\n\"Jeongguk?\" Taehyung asks with caution. Everything about this moment feels tense, stiff, and Taehyung wants to strip himself bare, emotionally, in front of Jeongguk in this very moment. He wants to let Jeongguk know that it's okay. It's okay and they're also okay. He wants to tell Jeongguk that nothing's changed and that they're still them. They're still Jeongguk and Taehyung. They aren't suddenly JeonggukandTaehyung.\nExcept...except, what he doesn't expect is for Jeongguk's eyes to snap up towards him, a cold glare thrown his way and he can feel it running up his spine. Jeongguk's never looked at him like that and he didn't even imagine that he ever would but here they are. So. \"It's Mr. Jeon to you, Mr. Kim,\" Jeongguk speaks and it makes Taehyung still in his tracks, taken back. Never has this happened.\nTaehyung lets the initial shock wash over him fast, lets his mind make the conclusion that this is just Jeongguk being angry at something that happened earlier so he just nods, leaves it there, hanging in the open. It's okay.\nHe continues the day like he had the previous three, doing what needs to be done, occasionally glancing at Jeongguk's office to where the alpha sits like a statue, not moving. The atmosphere in the office is stiff the entire day and nobody tries to even go near Jeongguk, afraid they might have their heads bitten off. Unlike the previous three days, today seems to not drag on that long and for that Taehyung is thankful. Soon it's only him and Jeongguk in the office and he doesn't even know if Jeongguk is aware of his presence, but he figures that this is the only way to go.\n\"Jeongguk.\"\nThe alpha doesn't move from his spot in his chair, sits there like he's glued to it. The most disappointing part is him not looking up and Taehyung can feel his heart falling in his chest. \"I told you to call me Mr. Jeon, Mr. Kim.\"\nIt's so fucking stupid and silly and maybe this time Taehyung's really going to strangle Jeongguk. Instead of doing that, he takes a few deep breathes. In, out. In, out. Relaxes. \"I just want to talk, Jeo- Mr. Jeon.\"\n\"There's nothing to talk about.\"\nIt feels like the wind has been knocked straight out of Taehyung. It's really not fair what Jeongguk is doing right now and he just wants the alpha to look at him. \"Please, can we talk?\"\nJeongguk doesn't look up from his papers. \"If you don't want to talk about work, Mr. Kim, then I'm really not interested in listening what you have to say to me at all.\"\n\"Jeongguk,\" Taehyung breathes, not even caring about the little slip up. Right now his heart is his first priority and Jeongguk is breaking it with every passing second. \"I just want to talk.\"\nWhat Taehyung really doesn't expect is for Jeongguk to suddenly jump up from his seat, eyes almost black and a cold glare on his face. He looks almost crazy and Taehyung's inner omega whimpers, displeased by what's happening. \"There's nothing to talk about!\" Jeongguk yells, glaring at Taehyung and he can smell the anger from where he's standing, grounded. Shocked.\nHis inner omega is whimpering, scared. Of course. His body is telling him to flee, find some place where there isn't an angry alpha and his mind is telling him to submit, give in and do what the alpha wants him to do. In the end it's his body that wins and he quickly scrambles out of Jeongguk's office, aware of the alpha's eyes following his every single move.\nFor the next few weeks it continues like this; them staying out of each others way as much as possible. Of course, they still do a very good job as an editor-in-chief and his assistant but for the other aspect of their so called \"relationship\"? Taehyung can feel that slipping through his fingers, can see it as it's slowly being ripped away from him. No longer is Jeongguk's eyes on him but instead the alpha focuses slowly on work and nothing else. Taehyung misses the feeling that Jeongguk's eyes would leave behind on his body. He misses the way they'd talk, the subtle touches. Everything. He misses Jeongguk, terribly and with every passing day it feels like his heart is breaking a little more.\nPlus, not to mention he's somehow lost the suppressants he keeps at work with him, just for in case. And that is another hassle he has do deal with. Because now he has to get a description from the doctor and then he has to go out and buy it and then he has to sneak it into the office without anybody knowing and it's just a big mess.\nAll in all, Taehyung's life is going extremely downhill.\n-\nOne day when Taehyung walks into the office, a bit late, everything changes.\nThe moment he steps outside of the elevator, everybody's eyes are immediately on him. He suddenly feels like a little kid who's been caught with his hand down the cookie jar and he doesn't know how to react. He knows he's not imagining it when he hears faint whispers going on around him and he wants to scream, cry, maybe rip his own hair out. He has enough going on and he doesn't need childish colleagues, too.\n\"What's going on?\" Taehyung asks the nearest person, who happens to be Jiyong, and the alpha sends him an almost sympathetic smile. Like he's sorry for what Taehyung's about to go through.\n\"Jeon Minyhuk wants to see you in his office.\"\nTaehyung feels his blood run cold. Jeon Minyhuk, the owner of Jeon Publishing House and also Jeongguk's uncle, never wants to see an employee unless they've done wrong. He's an extremely nice man, kind and caring for all his employees but one thing he does not tolerate if it's one of his employees has done him wrong. Taehyung wracks his brain for the possible scenarios that could happen when he meet with Mr. Jeon as he gets back on the elevator and presses the top floor. Did Jeongguk tell him about their kiss? He can't lose his job over a kiss, can he? Are they letting him go because his work isn't satisfying them? That can't be it. Taehyung is a great secretary, even if he has to say so himself.\nHe's so busy searching his brain for the possible outcomes that might happen that he almost doesn't even notice when the elevator dings, announcing that he's on the top floor. Slowly he makes his way out, nerves eating away at his stomach as he makes his way closer to the wooden office door. When he knocks, his entire hand feels heavy. Everything inside him feels heavy and he doesn't have a good feeling about this at all. There's a call on the other side of the door, announcing that he can come in and Taehyung takes a deep breath before actually turning the knob to let himself in.\nWhat greets him is something that he never thought he would have witnessed. In his big, fancy, brown leather chair sits Jeon Minyhuk, looking the embodiment of relaxed and cool. He has a big smile on his face as Taehyung steps into the room. In front of his desk sits Chaeyoung, a smirk in her face as she looks over her shoulder as he enters. What throws him most off guard is Jeongguk who's also in the room, back facing the three of them as he looks out the large window, head tilted downwards.\n\"Taehyung,\" Minyhuk calls, a bit too friendly for Taehyung's liking. \"Come sit.\"\nHe's really not to be blamed for the way he walks slowly towards the open seat, adjacent to the one that Chaeyoung is occupying. Even though there are only three other people in the room and only two pairs of eyes on him, Taehyung feels like they have an audience of a thousand people. He doesn't feel very good, doesn't know what to expect but know that he shouldn't be hoping for the best.\nOnce Taehyung is seated, back stiff against the chair, Minyhuk smiles at him. \"Do you know why I called you here, Taehyung?\" When Taehyung shakes his head no, Minyhuk's smile drops a little and if he didn't know any better he'd almost say that a sympathetic smile is thrown his way. \"Well then. I'll just have to show you.\"\nThere's a drawer being pulled open and something being pulled out and in the next moment Taehyung literally sees his entire world crashing before his eyes. He feels his heart drop, gone is the ache that Jeongguk had once caused and instead it's replaced by panic. There, in Minyhuk's hand, is Taehyung's suppressants along with his prescription and Taehyung feels dizzy with panic, stressed. He's glad he's still on suppressants because if he weren't he's sure he'd stink of panic at the moment. The room feels hot, suddenly, and Taehyung feels like the devil is watching him with a smirk on his face.\n\"I'm not going to ask you what this is, nor why it's in your name, because I think we all know, I just want to ask why,\" Minyhuk speaks after a minute of silence, once it becomes clear that Taehyung's not the one that's going to break the ice.\nTaehyung wants to lie, wants to tell him that it's not his. He's been framed but he knows that it would be obvious that he's lying. Knows that a lifetimes work is being thrown down the drain this very instant and he guesses it's time to face the music. This, him being caught, it was bound to happen sooner or later and he's...not really relieved that it's happened after two years, but he figures that he was even lucky even to hold the front for that long. He sighs, hangs his head. \"Mr. Jeon, I just wanted a job,\" He begins. \"I just wanted somebody to look past my status and see that I was...am qualified for doing what I'm doing. Or, well, want to be doing.\"\n\"And what do you want to do?\" Minyhuk asks with a raised eyebrow, suppressants still in his hand.\nTaehyung swallows. \"I want to be an editor, sir.\"\nThere's a smile thrown his way. Sympathetic but not empathic and Taehyung wants to curl up into a little ball and cry. He knows what will happen now. He'll probably get sued, considering that it's against company policy to hire omegas and he'll lose everything. His job, his degree, his dignity. Jeongguk. He doesn't know which one is worse but all of them sound terrifying.\n\"Taehyung,\" Minyhuk starts, a sigh escaping his lips as finally putting the suppressants down. \"I'm incredibly angry with you. For years you've deceived us. The company. Me. Jeongguk. Your co-workers. And you would've done it for years to come if Chaeyoung hadn't found the suppressants.\"\nThe last sentence makes Taehyung head snap up as he turns to face the mentioned girl. She has this smug smile on her face, like she knew she had been right all along and Taehyung feels his blood boil. He knows for a fact that he had those locked away in his desk, knows that he's the only one who has a key to that desk and that means that she had completely violated his privacy. He doubts that Minhyuk will take that into consideration, though. \"You had no right to go through my private things like that,\" He speaks, trying to hold back his anger. He knows he was wrong but for Chaeyoung to do that was also wrong and he won't have that.\nShe rolls her eyes, unfazed by Taehyung's little outburst. \"Shut up and listen to what Mr. Jeon has to say, omega.\"\nMinyhuk watches the exchange between them, eyes glancing from one to the other and Taehyung knows the ball isn't in his court. Hasn't been in his court since the first moment he actually stepped into the room. It's not fair, he wants to shout, but he knows that will fuel them. \"Chaeyoung,\" Minyhuk speaks after a minute of silence. \"Since you're the one who helped us discover this, what do you suggest we do?\"\n\"Sue him for everything he's-\"\n\"Just let him go.\"\nThe words are spoken loudly and everybody falls silent. It's the first time Jeongguk has spoken since Taehyung's entered the room and he doesn't know what to make of it. Here Jeongguk is, ignoring him for weeks on end and now he's coming to his rescue(?). Taehyung's mind feels a bit fuzzy at the words. Jeongguk still hasn't turned around to face them, still hasn't shown the emotion on his face and at the moment Taehyung wants nothing more. Wants nothing more than to see Jeongguk's face, wants to see what he feels.\n\"Excuse me, Jeongguk?\" Minyhuk speaks, mouth hanging open.\nJeongguk doesn't move from his spot. \"Just let him go, uncle. Taehyung's been a great secretary to me and an even better employee to you. He just...wanted something he worked for long and hard,\" there's a mini pause. \"I'm sure you understand, uncle?\"\nMinyhuk glances between the three of them, before sighing and turning to Taehyung. \"Kim Taehyung. I will let you go. No last month pay. No recommendation letter to any company. And I want you out as soon as possible. You got that?\"\nTaehyung nods as Chaeyoung's mouth falls open, probably in shock. Taehyung doesn't really care anymore what she does and doesn't do. This is this best that he's going to get, he knows. He stands up from his seat, head hanging low. It's over. Everything's over. It's only when he has the courage to look over his shoulder that he makes eye contact with Jeongguk.\nAnd Jeongguk's eyes hold one thing; disappointment.\n(It's there that Taehyung decides that it's not quite over just yet.)\n-\nA week later Taehyung finds himself standing in front of Jeongguk's apartment with nerves that has been building up for more than a week. Fuck, he wishes he would've come sooner.\n(\"You need to give him some time, Tae,\" Jimin had said and Taehyung knew he was right. When wasn't Jimin right?\n\"Fine,\" He had sighed. \"But I'm not giving up that easily.\"\n\"Of course not, you're Kim Taehyung. You never give up.\")\nNow he stands in front of Jeonnguk's door, on a Friday night (because if this goes badly then Jeongguk can be mad over the weekend when he doesn't have work and make everyone suffer through it. Believe it or not, Taehyung actually cared about most of his colleagues). There's rain falling outside and Taehyung can distantly make it out from where he's standing, glued to the front of Jeongguk's door. It feels weird to be back at the place he's only been at to deliver something off because now he stands here as somebody who wants to explain, wants to apologize.\nThe past week has been hell on Taehyung. He lost his job and he lost the only person he ever cared about in a romantic sense of way. He's been running through scenarios in his head on what to do and has come to the conclusion that this is, in fact, the best one. To just try and talk it out and make Jeongguk understand why he did what he did. He just wants to explain that it was never the plan to fall for someone, but he got (un)lucky on the road that lead to his success.\nHe takes a deep breath, lets the air wash over his lungs and heart, before lifting his hand to knock. The sound echos through the hallway, hallow and Taehyung thinks that Jeongguk isn't home when he's knocked a second time and there's still no answer. He feels almost disappointed but then the door swings open and....\nAnd.\nAnd Taehyung's met with chest. A golden smooth chest that he wouldn't mind his fingers running over, wouldn't mind exploring with his own hands and mouth...and those arms. Those are arms that Taehyung has had dreams about, has fantasized about and from what he can say now is that his dreams don't and fantasies don't really live up to reality at all. His lower body is covered in the black dress pants he usually wears to work and it hugs his hips so snugly that Taehyung almost melts. Jeongguk's body is a work of art, everything that Taehyung's dreamed about. Unfortunately he has to tear his eyes away when a almost shy cough reaches his ears and his eyes travel up to Jeongguk's face.\nHe's gorgeous, as he is always, but much like Taehyung he has these ugly black bags under his eyes and he looks tired, overworked. Taehyung suddenly feels the need to reach out, comfort. He feels something twist in his something when he realizes that it's probably because of him that Jeongguk looks like this. He coughs into his fist. \"Jeongguk.\"\nThe alpha doesn't bat an eyelash, face completely stoic snd Taehyung starts to wonder if maybe this was a bad idea. Maybe he should've given Jeongguk more time to sort through things. \"What do you want?\" Jeongguk asks then and it makes Taehyung still on the spot he's standing. All he wants is to explain. To explain and to make Jeongguk understand that he never, ever wanted to hurt him at all.\n\"Can I come in?\" He replies instead, because he knows that it's going to be a long conversation and he rather not have it in the middle of a hallway, where it's so open and anybody can see. Jeongguk's eyes scan over him, takes in his large hoodie and pants. Skims over every little detail of his face before he does that thing that make Taehyung go weak in the knees. He bites the inside of his mouth between his teeth, making a sort of hole appear where his cheek is and Taehyung has to look away. Finally, after what feels like hours, the alpha nods and moves to the side, allowing Taheyung to step in.\nMost of the lights in the apartment are switched on, Taehyung notices as he makes his way to the living room. He wants to talk, and he knows that they're going to have to sit down for this. The night outside feels like it's already lost, dark and dreary and miserable. But Taehyung's not going to give up that easily, he's a believer of the moon and he knows for as long as it shines, no matter how dim, there will always be a little hope. He takes a seat on the three-seater couch and waits for Jeongguk to take a seat too, only to find that the alpha his standing in the doorway, arms crossed over his chest and leaning in the doorway. It's a clear indication that he won't take another step and Taehyung sighs to himself.\nThe room is silent for one, two, three minutes as they stare at each other, neither saying anything. All Taehyung can do is sit there, trapped under Jeongguk's gaze like it's a sort of spell and his mind almost forgets everything that he was planning on saying. He takes a breath, figures that he might as well. \"I know you're angry at me-\"\nThe snort that leaves interrupts him comes as a surprise and when he looks up, Jeongguk rolls his eyes. \"Yeah. Angry. Angry that you lied to me for years. Angry that you were never planning on telling me anything. Angry that you mislead me. Angry-\" The alpha takes a deep breath. \"Angry that you made me think I was crazy for wanting a beta the way I wanted you.\"\nThe words hang open in the air, just like that. It hits Taehyung that this is the first time that Jeongguk's openly admitted that he feels...felt something for Taehyung. It gives his heart a little hope, makes his skin tingle with joy. Maybe not all is lost, after all.\n\"Can you listen to me, please?\" Taehyung asks. When Jeongguk reluctantly nods, he leans back into the couch. \"Jeongguk, I know you know how difficult it is for omegas to actually get jobs that people look up to. If you're an omega, people look at you and they think housekeeper  or kindergarten teacher or whatever has to do with that. For you...It's simple. You work for what you want and you get it. I'm not that lucky.\"\nJeongguk doesn't say anything, position still as he leans against the wall. \"Pretending to be a beta was the only option I had to do what I wanted to do,\" Taehyung continues. \"I got so excited when I got the job at JPH. Because it was finally something going right for me. I didn't, in that moment, think of anything other than myself. I didn't exactly expect to...fall for you the way I did. And I'm so sorry that you had to go through that, too. I can't imagine the war that must have gone down in your head. It really wasn't my intention at all, but the heart wants what it wants, I guess.\"\nSuddenly all Taehyung was planning to say is gone from his mind and instead he's laid his heart out on the table for Jeongguk. Whether the alpha decides to forgive him or not is up to him but Taehyung hopes for the best. He stands up, pushes himself of the couch. \"I have a lot of regrets in life, Jeongguk, but if I were to walk out of here without telling you how I feel about you, I know that will be my biggest one,\" This is it, the moment Taehyung gives Jeongguk to make or break. \"You. You're the only person that's ever made my heart felt numb with beating too fast. Night in and night out. You do this thing to me that I didn't think was possible...not until I met you. I don't know what you call it, maybe love, who knows. But I know that every part of me, my omega, wants every part of you.\"\nTaehyung finishes, leaves the words open for Jeongguk to interpret the way he wants to. After a minute passes with the alpha saying nothing, Taehyung gets the memo. Jeongguk just stands there, doesn't even move. Doesn't do anything about Taehyung practically handing his heart over so carelessly. So Taehyung does the only thing he knows will somehow help save his dignity. He picks up his heart inside of his chest and hold his head high. He's not willing to break in front of Jeongguk like the way he wants to. He makes his way over to the door and-\nThere's a death grip around his wrist, Jeongguk holding him like he's afraid Taehyung might just slip through his fingers if his grip were any looser. When Taehyung turns around, Jeongguk is already facing him, eyes filled with so much emotion that Taehyung feels every single one of them burning his skin. \"You're not leaving me,\" Jeongguk says as he pulls Taehyung to his chest, only a few inches separating them and this time it feels so natural that Taehyung can't help but fall. \"Not when I've spent so long dreaming about you. You're not leaving me.\"\nThe next moment happens slow, Jeongguk's arms wrapping around his waist and pulling them together. They're practically one with the way they're standing so closely intertwined and Taehyung's positive that Jeongguk can feel his heart beating against his chest. Everything feels crazy, wild, like some dream and Taehyung finds himself hoping and praying that this isn't his mind playing cruel tricks on him. Jeongguk's forehead rest against his, and this moment really does feel almost too good to be true. For so long Taehyung's wanted this and now he finally has it, here, so willingly to be grabbed by both hands and never let go of. Soft fingers caress his cheeks and slowly trails down his jaw, lifts his chin until their lips are almost touching...\nHe's missed Jeongguk's lips. Missed it like he misses flowers in the Winter. Missed it with a longing that cuts deep into one's bones and ruins them from the inside out. Missed it like he was afraid he'd never feel them against his again. Jeongguk's lips are softer this time, more gentle than the previous time (how is that even possible?). And Taehyung loses himself to the scent of sandalwood that fills the air. He locks his arms around Jeongguk's neck, pushes himself closer. Taehyung feels alive in Jeongguk's arms like this, feels like he can conquer the world.\nA hand slips underneath his hoodie, touches his burning skin and he lets out a moan, pulls away from the kiss to breathe. Jeongguk doesn't stop, instead he kisses down Taehyung's jaw to his neck, makes him breathe out heavy as he pushes his hands into Jeongguk's hair. It suddenly feels too hot and he's reminded once again of Jeongguk's lack of clothes. \"You smell so different,\" Jeongguk breathes into his neck, licks over where a mating mark usually sits and Taehyung feels pleasure run up his spine. \"Like honey and vanilla. So intoxicating.\"\n\"I'm off the suppressants,\" Taehyung replies, not entirely sure what to say. But he knows what he wants and what he wants right now is Jeongguk. \"Alpha,\" He breathes out as Jeongguk continues to assault his neck with licks and little bites. \"Jeongguk, I want you.\"\nA growl escapes past Jeongguk's lips at the words and his hands slips from underneath the shirt and only to grip at the edges and pull it over Taehyung's head. He stares for a few seconds at Taehyung like that, open and exposed, before he pulls him closer once again. \"You're so gorgeous, Tae, so fucking breathtaking,\" He says as Taehyung locks his arms around his neck once again. He doesn't know what happens next, but somehow their lips are attached once again, this time more desperate and needy and Taehyung wants Jeongguk now. He feels hands trail down his butt to the back of his thighs and the next thing he's being lifted into the air and he wraps his legs around Jeongguk's waist as tightly as possible as the alpha starts walking towards his bedroom.\nToo suddenly everything feels heated, too many clothes separating them and Taehyung wants to take it off. For too long he's waited for Jeongguk and he wants everything the alpha has to offer him in this very instant. The mattress is soft against his back as Jeongguk lays his down, settling on-top of him as he kisses Taehyung. In his life Taehyung has received quite a number of kisses, but none of them have been like Jeongguk's. Jeongguk kisses with such passion that it leaves Taehyung breathless, wanting more and more and more every time.\n\"What do you want, baby?\" Jeongguk asks as he pulls away, hands trailing down Taehyung's side so softly. It's enough to drive Taehyung crazy.\n\"You. I want you. Every part of you.\"\nJeongguk smiles as he pulls away to sit on his knees between Taehyung's legs. He runs both of his hands up and down Taehyung's thighs and he feels himself shiver with excitement...until he remembers. \"Jeongguk,\" He speaks, voice soft and full of shame. The alpha looks up from what he's doing until their eyes lock. \"My body....it still thinks I'm a beta....So I can't take a knot or produce slick yet.\"\nJeongguk sits back a second, stares at him and then lets a smile take over his face. \"It's okay baby,\" He says as he climbs off the bed. \"Just lay back and relax.\"\nTaehyung follows Jeongguk's every move as the alpha moves to get a bottle of lube and a condom from a little drawer. The alpha walks back to the bed and throws the items next to Taehyung before he removes his own pants. He's wearing black briefs and through hooded eyes Taehyung can almost make out that his cock is semi-hard. Taehyung himself can feel his own semi straining against his pants and he thinks it's ridiculous how he's already so riled up just from kissing and a few light touches here and there.\nJeongguk settles back on the bed in between Taehyung's legs again, this time spreading them further apart with his own knees as he leans down to kiss Taehyung. This kiss is somehow....different. Personal. \"Are you sure you want this?\" Jeongguk asks as he pulls back, hands clutching Taehyung's sides so tightly that he's certain there'll be bruises for the days to come.\nTaehyung doesn't even need to think twice about this. He's wanted Jeongguk for so long and now that he finally has him like this he won't let it go that easily. \"Yes.\"\nFor just a millisecond everything around them stops and they stare at each other. There's something in Jeongguk's eyes that Taehyug can't put his hands on but he doesn't let it dwell, instead he focuses on the way the Jeongguk nods, like he's convincing himself, before he's back in his knees again, pulling at the waistband of the pants that Taehyung's wearing. He lifts his hips to help help progress but never once do they break eye-contact. As Jeongguk pulls the pants, he removes Taehyung's boxers, too, and the next thing Taehyung knows is that his legs are bare and that his feet are resting in Jeongguk's shoulders, strong hands gripping his ankles tightly.\nLittle pecks are delivered to Taehyung's ankles, up his left calf until Jeongguk's mouth reach the beginning of his inner thigh, his knees over Jeongguk's shoulders. He feels vulnerable in a good way, completely ready for everything that's about to come. With every touch that Jeongguk leaves on his body, it feels like a new beginning for Taehyung. A new beginning for him and Jeongguk, maybe. This has been slowly building up over the course of 18 months and now here they are, finally, each other's for the taking.\nJeongguk reaches out to grab the lube and condom next to him and Taehyung registers a bottle being opened and a few seconds pass before a warm digit is being pushed against his rim. \"You sure about this, baby?\"\nTaehyung nods. He doesn't think he's ever been so sure about anything in his entire life. He can feel the sweat starting to form on his forehead and he tries to control his breathing. Suddenly, there's a thick finger pushed inside of him and he can't help but let out a moan as the digit pushes deeper into him. His cock is already half-hard and a bit red and he already feels lost the Jeongguk's hands. Everything between them just feels so...intense. So welcome and somehow familiar, like they've been doing this for years instead of just this one time. Jeongguk's finger in him is so, so good but it's already not enough. Like Taehyung said, he wants all of Jeongguk and not just a piece of him. He wants all of him to know just how real this is.\nThe finger in him pushes until it's knuckle deep and Jeongguk begins to thrust his finger in and out slowly, making Taehyung lost in the pleasure that it's providing. He can feel his thighs start shaking where it's still up in the air, knees on Jeongguk's shoulder. Taehyung's not even aware of the tiny little whines he let out every time Jeongguk pushes his finger in and out but he is aware that it's not enough. One finger is not enough and Taehyung needs more.\n\"More,\" He moans, pleads, as Jeongguk continues to work his finger in him. Every drag feels a little bit closer to where Taehyung wants it most and he can't help but start moving his hips in these tiny little downwards thrust to meet Jeongguk's finger. It feels good, but it's not enough. \"More, alpha. Jeongguk. Please.\"\nTaehyung faintly hears a growl like sound escape past Jeongguk's lips at the way Taehyung addressed him. He guesses that he'll still have to figure what Jeongguk likes and what he doesn't like in the bedroom but now...now all that matters is this; them finally being together like this.\nTaehyung throws his head back in bliss, closes his eyes as Jeongguk removes his finger only to push two back in, this time thicker and more secure in pleasing him in the way he wants it most. By now his cock is lying on his belly, pre-cum starting to drip out of the head and he can't help it when one hand flies to his nipples and the other to the sheet underneath him. The grips at the sheet as Jeongguk kisses his inner thigh while working two fingers in him and he almost explodes when the alpha crooks his fingers a little bit, enough for him to find that one spit that drives Taehyung up the wall and off the edge at the same time. He doesn't see Jeongguk's reaction, but he can feel it in the way the alpha continues to hit that spot with his fingers repeatedly.\nAnd if that's not enough, if the pressure on his prostate from Jeongguk's fingers aren't enough and the pressure from his own hand playing with his nipple isn't enough, then Jeongguk makes sure that Taehyung really does get enough as he leans down to take the omega's cock into his mouth. Taehyung lets out s loud moan at that and the hand that were gripping the sheet flies to Jeongguk's hair, pulls and pushes and Jeongguk wishes Taehyung could see himself like this, the prettiest boy with the prettiest moans looking like an absolute mess all because of Jeongguk. He counts himself lucky to see Taehyung like this. The omega's moans are filling the room like a sweet melody and Jeongguk eat it up.\nTaehyung on the other hand feels like he's already burning on the edges. Everything seems so close yet so far away and his mind is hazy. He wants Jeongguk and he wants him now. Luckily the alpha senses what Taehyung needs and inserts another finger, this time moving them faster and faster with each thrust to his prostate. Jeongguk is still sucking his cock, these tiny little sucks that drive Taehyung mad. Not mad enough for him to reach his end but mad enough that he holds Jeongguk's hair so tightly in his hand that he's almost certain the alpha is going to be with less hair then when they entered the room.\nThe smell in the room. Fuck. Sandalwood, mixing with his own. It's faint but it reaches his nose and he would've never have guessed that vanilla-honey mixes so well with sandalwood. It's a match made in heaven, truly and Taehyung feels like he's already won in this moment. He doesn't know if he should push his hips into Jeongguk's mouth or down to meet his fingers and he's a little bit confused when the mouth pulls off him and there's not three finger's in him anymore. His legs are suddenly on the bed, too. He had felt so good, so close, and now it's being stopped.\nHe opens his eyes to find Jeongguk removing his briefs and tearing the condom wrapper open with his teeth. His eyes travels down Jeongguk's body and he can't help but lick his lips. In silence he watches as Jeongguk rolls the condom over his hard length and he sits back down, cock standing hard against his stomach. \"Come here baby,\" He says as he notices Taehyung's eyes on him and Taehyung immediacy gets on his knees and crawls to where Jeongguk is. There's hands on his waist as he's suddenly being guided into Jeongguk's lap and oh. Okay.\nHe meets Jeongguk's eyes when his knees are on both sides of his hips and it's clear that Jeongguk wants him to sink down into his cock. He puts his hand on broad shoulders as Jeongguk's cock catches his rim and without much thought Taehyung slowly starts sinking down onto the cock, inch by inch. Once he's fully seated op Jeongguk's lap, he wraps his legs around his waist and throws one arm around his neck. The other hand he puts on Jeongguk's face, caresses his cheek as he smiles ss the alpha. They haven't broken eye contact yet.\nFor a moment it says like that, with Taehyung seated on Jeongguk's cock and them staring at each other like they don't have a single care in the world. The moon is their only friend as he glances through the curtains of Jeongguk's room. Even the stars have disappeared for the night. They breathe together as one, foreheads against each other's and bodies locked so tight. Jeongguk's arms are around Taehyung's waist, and if Taehyung could stay like this forever, he would. But he desperately wants Jeongguk to start moving, so he bites back a moan. \"Move,\" He whispers against Jeongguk's lips.\nThe alpha starts doing exactly that, moving his hips in these little upwards thrust. It's not enough for Taehyung who also starts moving his hips downwards, meeting the alpha's thrust halfway. Eventually they build up his little rhythm and Taehyung throws his head backwards as he moans out loud, Jeongguk immediately taking the opportunity to attach his mouth to his neck. Taehyung feels overwhelmed with pleasure and in only increases once Jeongguk angles his cock differently, hitting Taehyung's prostate dead-on with every upwards thrust.\nEventually this isn't enough for the both of them and Taehyung can't help but moan out as they're suddenly being flipped, him on his back with his legs being held in the air. Jeongguk stands on his knees as he grips Taehyung's ankles tightly and adjusts again, this time starting his thrust faster than he previously had. He hit Taehyung's prostate every time and Taehyung swears he sees white stars in the dark room.\nHis body is bouncing with every trust the alpha delivers and he wants to reach out and hold Jeongguk, hold him in his arms and never let go but the alpha is so far away. Instead he reaches for the sheets underneath him and clings onto those so tightly, almost like he's afraid of letting them go. Truth be hold, he is afraid of letting them go because the sheets are his only lifeline at the moment and if it were to slip he wouldn't know what do with himself.\nJeongguk doesn't ease up on his thrust, every time he comes bsck harder and rougher than the previous one and Taehyung feels so good, moans Jeongguk's name so loud. The alpha eats it up, every whimper, every moan, every little fucking whine. He lets it boost his ego as he continues to thrust. Never in his life would he have guessed that he'd have Taehyung like this, under him, so pliant and needy and moaning nobody else's name but his. He lives for it. Lives for the way that Taehyung is his in a way that he's only ever dreamed about.\nWith every whimper and moan and with every time that he speaks Jeongguk's name Taehyung feels more on edge than before. Jeongguk is using his body as he pleases as Taehyung has no objections whatsoever because he's pretty sure he's never really felt this good with anyone. It's almost as if Jeongguk's bodies and his were made for each other. Or, more like they were made for each other because Taehyung can't ignore all the other stuff they do that are so compatible.\nThere's a heat building up in Taehyung's stomach, one that he's familiar with, and he reaches out his hand to grab his cock. Everything feels so good, too good, the sounds he makes and the sounds that Jeongguk makes are the only thing reaching his ears. With Jeongguk hitting his prostate every time and the hand in his cock, Taehyung can feel himself teetering closer to the edge. Jeongguk's cock is beginning to swell and Taehyung knows he must be close, too. What finally sends him over the edge is when he meets Jeongguk's eyes through his hazy state. The alpha doesn't loom much better, sweat running down his forehead as he moves his hips fast, chasing his own release. Jeongguk groans. \"Tae, baby,\" His voice sounds wrecked and Taehyung doubts that if he were to speak he'd sound any better. \"Cum for me.\"\nAnd so he does. He sees white as his cock starts squirting out cum, onto his tummy and belly and he arches off the bed, moaning Jeongguk's name so loudly that he's certain all of Jeongguk's neighbors can hear. The alpha pulls out then, cock swollen and red and starts pumping himself. It only takes a few minutes until he's also releasing into the condom, out of breath as he falls next to Taehyung.\nThe moment of silence doesn't last long though, as Jeongguk stands up and removes the condom. His cock is still swollen, but Taehyung guesses that's what the knot does and he watches as Jeongguk disappears only to come back a few seconds later with s wet rag. He cleans Taehyung with care, moves the rag across his chest and tummy softly. He wants to asks, wants to talk but he doesn't get the chance as Jeongguk climbs in bed with him after getting rid of the rag. There's and arm thrown around his waist and he feels sleepy, but he still wants to talk. \"I,\" He starts, but is immediately cut off.\n\"Go to sleep Tae,\" Jeongguk whispers and Taehyung doesn't have the energy to go against him. He turns around, snuggles his back into Jeongguk's chest.\nThe last thing he hears before sleep takes over fully is Jeongguk whispering so softly that he almost doesn't catch it; \"I would've waited forever for you.\"\n-The next morning Taehyung wakes up with the memories of last night playing in his head. He remembers everything little detail, every kiss, every touch, every whisper that went along with it and he finds that a smile takes over his face. He reaches out his hand to the space besides him and ends up not being too surprised when he finds it empty. It's warm, though, the space, and Taehyung himself feels warm, too.\nHe knows that Jeongguk must have only recently gotten out of bed, because he can still see the slight dip in the mattress where Jeongguk had laid behind him. For a minute he marvels to what it feels like waking up in Jeongguk's bed. A month ago he would've never even thought that this was possible, but now here he is. Sore back to prove that the night they spent together weren't just a dream or fantasy. Momentarily, he forgets about it all. Forgets that he doesn't have a job, forgets that he has no money (except the little bit he has saved), forgets everything that went down last week. What he doesn't forget is Jeongguk. Because he has him. He has him, for now at least, and that's more than Taehyung could have asked for.\nWith some effort, because Taehyung's back is sore the moment he stands up, he grabs himself one of Jeongguk's many work shirts and pulls it over his head. He's always imagined what Jeongguk's shirt would look like on him, how he'd wear it and now he finally has the chance to execute that fantasy. The shirt is loose on him, hanging off his shoulders a bit. It reaches his mid thigh and he probably looks silly but that's okay because it's Jeongguk's shirt and it smells like him and that is the thing that's most important. He searches for his underwear and quickly pulls in over his legs before he makes his way out of the room.\nThe sun is shining, a total contrast from the rain that had fallen last night, when he steps into the living room and he relishes in that for a minute or two. It feels good, everything around him feels good and new and he doesn't even know what's going to happen if he finds Jeongguk but he knows this feeling in his stomach isn't a bad one. Eventually, he walks into the kitchen and finds Jeongguk there, a mini stack of paper lying in front of him. Taehyung ignores those and steps into the kitchen. \"Morning,\" He says as he takes a seat opposite Jeongguk. The alpha has a cup of coffee in his hands that he's nurturing and he's wearing nothing but boxer briefs. Taehyung has to stop himself from ogling as he remembers last night.\nJeongguk raises an eyebrow as he watches Taehyung over the rim of his cup. \"Are you wearing my shirt?\" The omega shrugs and Jeongguk shakes his head, clearly not annoyed. He puts the cup down and pushes the stack of papers towards Taehyung. \"Read that.\"\n\"What's this?\" Taehyung asks but takes the papers anyway, a bit curious.\n\"Just read it.\"\nTaehyung rolls his eyes and picks up the papers, reading to read it. As the takes in the words on the paper, he feels tears rushing to his eyes. This is...this- \"What is this?\" He asks, demands, to know when he's skimmed through the papers. If this is a joke...\n\"It's exactly what it says it is,\" Jeongguk speaks, looking calm and collected. \"An new all-omega book publishing house that needs some work positions to be filled.\"\nTaehyung feels his heart swell, feels his heart beating so fast that he can hear every little beat. This is...This is unbelievable. This is everything that Taehyung's ever wanted and more. Everything he's always dreamed of. He knows that Jeongguk must have pulled some strings for this to happen and he just...\nHe can't help but run over to Jeongguk and practically throw himself in his lap, arms going around the alpha's neck as he clings onto him tightly, face buried into his shoulder. Thank you's fall from his mouth and he only realizes that tear are falling from his eyes when Jeongguk pulls his face back to wipe away the tears. \"Hey, baby, don't cry, don't cry.\"\n\"These are happy tears,\" Taehyung continues to cry, not even caring if he looks ugly at the minute. Yesterday he barely had anything and today he wakes up with Jeongguk and a new possible job all thanks to the alpha. \"I'm just happy.\"\n\"Me too, Tae,\" Jeongguk smiles at him and he looks awfully...\n\"What are we?\" Taehyung has to ask. Has to know where they stand with each other. He has to know that Jeongguk wants everything that he wants, wants everything with Taehyung. He wants that reassurance, wants to know that this wasn't just a one time thing and that Jeongguk doesn't just feel sorry for him. He wants what he's always dreamed of and he's so close to finally getting that. It's so close that he can almost taste it.\nJeongguk sighs, but not in a way that's angry or disappointed, more in a way that is content. He takes Taehyung's arms from around his neck and interlocks their fingers. It's a perfect fit, their hands. \"I don't know what we are. I mean, we still have to have a very serious discussion about what you did,\" He begins. \"But I know what I'd like us to be. I'd like to court you...and eventually mate.\"\nTaehyung's heart flutters, beats fast. \"Are you serious?\"\n\"Taehyung...There's a lot of things in life I'm uncertain about. If I like this apartment, if I want to continue working for my uncle, hell even if I still like my usual cereal,\" Jeongguk says, as he bring Taehyung's left hand up to his mouth to kiss his knuckles. Jeongguk's eyes hold something that Taehyung's seen in himself, too. \"But if there one thing I'm certain I'm certain about, it is that there's nobody out there for me like you, Kim Taehyung.\"\n(If it's meant to be, it will be.)\n \nThe 'proposal' happens like this; \nIt's a Sunday morning, the sun kissing Taehyung's skin as he shimmies to a silly English pop song playing from his phone while he's busy making breakfast for him and Jeongguk in their apartment. It's still early, a little past nine, but the sun shines bright already, indicating that the day has a lot in store for them. The shirt he's wearing is one of Jeongguk's work shirts and it falls past his mid-thigh, covering the hickeys that Jeongguk had left the night before. \nThere's butterflies dancing in the pit of his tummy, like there always is on mornings like this, and he can't help but feel a little excitement also. It feels different today, there's just something lingering in the atmosphere...something like hope snd happiness and love all mixed in one and Taehyung can't help but let that feeling get to him. His skin tingles with joy, or maybe it's the sun's light shining on him, he's not too sure, but he can't help but relish in this feeling as it overtakes him from the inside out. \nThe song changes in the background to a Korean song the moment Taehyung mixes the milk with the eggs(because scrambled eggs are Jeongguk's favourite), and he's almost done with the mixture when Jeongguk's voice rings out behind him. \"Look at those hips move.\" \nStartled at the sudden words, Taehyung almost drops the plastic bowl that he's holding and he catches it along with his racing heart just in time before it falls. His heart still falls when he looks over his shoulder at Jeongguk who's leaning against kitchen opening with his arms crossed over his chest and his legs over each other in nothing but a pair of black briefs. There's this smile on his face, a smile that Taehyung has learned that was only reserved him and nobody else, and this incredibly fond look in his eyes. Upon seeing him, Taehyung can't help but let a smile take over his face. \"Shut up,\" He says, a blush creeping on his cheeks even though this isn't the first time that Jeongguk has caught him in this situation. \nHe turns his attention back to the eggs, maybe because he doesn't want Jeongguk to see how rosy his cheeks actually are, and throws the mixture in the pan. Not even ten seconds later there's a warm hand sliding under his(Jeongguk's) shirt and a palm spreading over his belly. Jeongguk pulls at Taehyung's hip with his other hand so that they're chest to back and Taehyung feels the warmth spreading through him. The alpha nuzzles his nose into Taehyung's neck and Taehyung can't help but sigh softly as Jeongguk starts delivering kisses to his neck, over the hickeys that he had left not too long ago. \"Don't be shy baby, you know I love it when you move your hips like that.\" \nTaehyung can't help but roll his eyes at the hidden innuendo in Jeongguk's words, but still he feels his heart flutter. Sometimes he wishes that Jeongguk didn't have this effect on him, didn't turn Taehyung into the fool in love that he so clearly is, but he finds that on those times that he doesn't mind it either. He doesn't mind showing Jeongguk every piece of his heart. \"You're vile,\" He chooses on saying, busy scraping the eggs as it's busy being formed. \nThere's no response, only Jeongguk pressing his nose further into Taehyung's neck, smelling himself all over the omega. \"Why didn't you wake me up to help you?\" \n\"I wanted to surprise you with breakfast in bed,\" Taehyung answers, eyes never once leaving the eggs and heart's speed never once slowing down. The butterflies in his belly has intensified by now, and he can't help and bask in the glory that is Jeongguk's arms holding him like he doesn't ever want to let go of Taehyung. \"Too late now,\" He laughs. \n\"Let me help,\" Jeongguk whispers into his skin, hot breath on his neck making a shiver run down his spine. Taehyung's pretty sure that Jeongguk can feel it, but he doesn't comment on it. Instead he moves his body with Taehyung's as he takes the eggs off the stove and places it into an empty plate standing next to the food that he's already made(just the bacon, and fruit salad). \nAfter putting the pan down, Taehyung turns around in Jeongguk's arms so that they're chest to chest and he locks his arms around the alpha's neck. They're pressed close together, not minding the heat inside the kitchen, and they breathe the same air. Taehyung can't help but feel genuinely in love as he and Jeongguk hold eye contact and somehow the feeling of excitement that had been building in the air increases. He bites his lip, smiles. \"No,\" He whispers, because he thinks that if he were to talk too loudly he'd ruined the unspoken moment building between them at the moment and only a soft love-filled whisper can truly convey what he's feeling right now. \"Go wait for me in the living room.\" \nJeongguk doesn't reply, instead he leans up and kisses Taehyung's forehead for thirty seconds, lips warm and familiar and feeling like home and Taehyung is so in love that he can feel it burnin in his littlest bone. The alpha finally pulls away and squeezes Taehyung's mid-section one last time before letting go and making his way towards their living. \"Hey,\" Taehyung says, watching as Jeongguk stops in his tracks to look at him. \"Love you.\" \nThe alpha smiles, tilts his head to the side slightly. \"Love you to the moon.\" \nThe words still leaves Taehyung burning with love as Jeongguk exists the kitchen, and he can't help but think back to the time when he had gotten the explanation of Jeongguk's cute way of telling Taehyung that he loves him. \nIt was on their six month anniversary and Jeongguk had taken Taehyung out for the night for a picnic under the stars. It had been a night filled with them falling even deeper in love with each other than they had previously been and Taehyung remembers the almost shy, nervous expression Jeongguk had gotten on his face as the night had almost come to an ending. He had been laying back against Jeongguk's chest with his back as he looked up at the stars, wondering which ones were destined for them and the alpha had fidgeted behind him. \"Why are you so jittery?\" Taehyung had asked without looking back at his boyfriend. \nJeongguk had only let the night speak for him for a few seconds before he ended up saying, in a rushed whisper; \"I have something for you.\"\nThis had caught Taehyung's attention fully and he pushed himself off of the hard chest behind him. He had turned his body so that he was facing the alpha and his heart did a little jump when he saw how nervous the alpha had looked. He had smiled softly and taken Jeongguk's hand in his own(their hands fit so perfectly together), had laced their fingers and squeezed. The mood around them was soft, with only the stars and the moon and their love that had been with them and Taehyung was a goner. \"What do you have for me, Guk?\" \nJeongguk's eyes had glanced around, his back stiff, before he let out a sigh that had sound almost defeated and reached into his back pocket. Taehyung's heart had started racing when Jeongguk had a velvety blue box in his hand and his breath had caught in his throat. The alpha had held out the box for him to take. \"Here,\" He had rushed out, his hand was slightly shaking and Taehyung didn’t care enough about that as he took the box from him. It had felt soft between his fingers, smooth and unfamiliar, and he had glanced up at Jeongguk who had watched him with nervous eyes before he finally had the courage to open it. \nInside the box, right in the in the middle, had laid a silver heart locket and Taehyung's hands had shaken as he took it from the box. It was perfect, the metal cold against his warm skin, and the moon had shone bright enough so that when Taehyung had opened the heart, he was met with Jeongguk's initials. He had looked up at the alpha, maybe he looked confused or something, because Jeongguk, who had been silent the entire time, had bitten his lip and gestured towards the inside of the initials. \"It's so that my heart is always close to yours.\" \nIt was cheesy, but Taehyung remembers thinking; you're already close to my heart. Remembers thinking; you're everything I've always wanted. Remembers thinking; you're the person I've waited for my entire life. He had smiled and held out the locket towards Jeongguk. He remembers saying; \"Put it on for me?\" \nThe alpha didn't hesitate as he took the locket from Taehyung, all signs of nervousness that had previously consumed him gone. Taehyung had turned so that his back towards Jeongguk again and the alpha had been warm behind him as he scooted closer. The locket had felt like it belong against his skin as Jeongguk had put it around his neck. After he was done, Taehyung had turned his head so that he was facing the alpha, and they were so close that they were practically beating the same air. \"I love you,\" He whispered, and it wasn't the first time he said it, but it had felt so personal. \nJeongguk had smiled at him, leaned in. \"I love you to the moon.\" \nA slight frown had made its way on Taehyung's lips and he was confused why the alpha always said that when he told Taehyung that he loved him. \"The saying goes to the moon and back.\" \nJeongguk had smiled relieved, like he had waited for Taehyung to say those words all his life. \"If I say that I love you to the moon and back, that means that there is a limit on my love. However, if I say that I love you to the moon then that means my love for you will stay there and it will grow and grow and grow and eventually, when we die and we become apart of the stars and the universe, only then will you truly realize how much I really love you.\" \nAnd even now, six months after that night, Taehyung's heart still flutters whenever Jeongguk says that to him the same way it did that night. He can't help the smile that creeps onto his face as his hand slides to his chest, fingertips grasping the locket only lightly. \nHe quickly makes work of finishing the breakfast, toast and sausages alongside the eggs and bacon and salad. He splits the food into two plates, one for each of them, and places it on the counter where they usually eat. It's only when he's satisfied that he finally leaves the food to collect Jeongguk. He finds the alpha in the living room, staring off into the distance like he's thinking of something important and Taehyung laughs a little when he plops himself down in the alpha's lap, thighs on either side of the alpha's hips. Jeongguk only snaps out of his haze when Taehyung bumps their noses lightly. \nHe looks at Taehyung with something shining so brightly in his eyes and the blonde can't help but feel like this is it, this look that Jeongguk has in his eyes is the same feeling that he's been getting all morning, except on Jeongguk it looks so much more intensified and although it's sunny outside, Taehyung shivers. This moment feels to vulnerable to break, maybe, and Taehyung sighs softly when he feels Jeongguk's hands travel up his bare thighs, grounding him. \nIt's so fascinating, Taehyung thinks, how easily the both of them can ground each other. How easily the both of them can get lost in one another. Taehyung guesses that's how easy love is, guesses that when two people's destiny were written in the stars like theirs where, when two people are supposed always suppose to end up together like they are, when two people are really, truly meant to be, then love really is this easy. \n\"What are you thinking about?\" Taehyung asks finally, nervous for an unexplained reason. The butterflies in his tummy are dancing wildly now, and he doesn't know what to expect. \nAt first, Jeongguk doesn't say anything, only lets his hand caress Taehyung's thighs, lets the other one slip up underneath the shirt to the small of Taehyung's back. He pulls him closer that they're chest to chest and only then does he allow himself to speak. \"I want you to be mine.\" \nTaehyung's heart stops, drops in his chest(in a good way). \"I am yours.\" \nJeongguk only half smiles, grips at Taehyung's thigh tighter. \"I want to mate.\" \nTaehyung can literally feel his heart explode at the words. Can feel himself falling so fast and so deep and so quick and he can't help and question if this is a joke because he's been waiting for over a year for this and now it's here, on a golden platter presenting itself to him so easy and open and he doesn't know if this is a dream or not but if it is then he doesn't ever want to wake up. \n\"Are you serious?\" Taehyung asks, breath coming out faster than he'd like for it to but at the moment he doesn't really care at all, doesn't care if he looks a mess and smells lime breakfast and has hickeys all over his body because right now only Jeongguk truly matters. Jeongguk's words, more precisely. \n\"Yeah,\" The alpha replies, also a bit nervous and Taehyung can't be blamed when he suddenly starts kissing Jeongguk with everything in him. He's wanted this for so long and now he finally has it and he doesn't really plan on letting it go, not now, not ever. \n(And later, when their breakfast has been long forgotten and new hickeys are covering Taehyung's skin like a scarf, he calls Jimin to tell him the good news. The alpha replies 'finally, you idiots', and hangs up the phone. Taehyung knows he means well.) \n-\nThe good thing about working for an omega-only company is that it takes omega needs into consideration. Meaning; heats. They company that he works for, House of O Pulishing, really does provide all the means necessary for when one of the employees are going to be in heat. The boss, an omega herself, gives every employee two weeks off when they inform her of the situation, even if heats only lasts about a week at most. \nTaehyung, on the other hand, who had been using suppressants for two years, heats only last about three days. It's a negative side effect of the pills but Taehyung doesn't mind all that much. That still doesn't stop his boss from giving him two weeks off when he tells her about the situation. \n(\"Take your time,\" She said, smile on her face. \"I want my best assistant-editor-in-chief to be top not h when he gets back to work.\")\nSo that's how he finds himself at home in bed, three days after his 'break' has started. The moment he wakes up he can feel the heat burning underneath his skin and he wants nothing more than to rip his skin off, wants to rip away the heat that's burning him from the inside out. He throws the duvet off him, rips his shirt sway from his skin and he can feel the wetness between his legs, his smell overtaking the room. \nIt's clear that his heat has hit. The only problem with this? It wasn't suppose to hit for another two days and Jeongguk is currently at work, unaware of the situation that Taehyung has found himself in. \nEverything feels wrong, from the way his skin burns to the heat between his legs to the empty bed he's found himself in. Everything just feels so wrong. Taehyung can't help but whimper as his hand unintentionally slips past his nipples to his belly and then in his pants, cock already hard and leaking pre-cum. A lewd moan leaves his mouth as he touches himself, and he can't help but want to cry, wishes Jeongguk was here to help him. Wishes his alpha was at his side to help him. To mate him. \nHe keeps a hand on his cock, desperately moving his hand up and down in fast movements as his other hand reaches out for his phone. Through hooded eyes he can make out that it's a little past nine, and he immediately calls Jeongguk, who's on speed-dial anyway. The phone rings a few times, maybe once, maybe twice, Taehyung can't tell with his mind so unfocused. He only listens when the other end of the line is picked up, Jeongguk's happy voice ringing in his ear. \"Morning baby.\" \nAnother moan escapes him as he digs his thumb into the head of his cock, using the pre-cum that had started running down his cock as lube. \"Alpha,\" He whines desperately, smell increasing tenfolds as he hears his alpha's voice over the phone. He still feels too hot, too bothered by everything. \"Alpha. Heat. I-I'm in...in heat, alpha.\" \nHe can faintly hear Jeongguk's breath hitch on the other end of the line. \"Pup,\" Jeongguk breathes. \"Pup, I'll be home as soon as a can, okay? Just hang on a few minutes. I'll be home soon, my pup.\" \nTaehyung can't help but whine at the words. He wants Jeongguk and he wants Jeongguk now. His hand already isn't enough and only his alpha can truly satisfy him in the way he needs so desperately to be satisfied. He nods then realizes that Jeongguk can't actually see him and whispers a shaky 'okay' into the line before hanging up and throwing his phone to the side. \nWith a few more strokes from his hand, cum shoots out of his cock, making his pants sticky with it and he makes quick works of removing it after he's done cumming. The room smells so much like Jeongguk and it's driving him insane, mad with want and need that's burning so deep in his stomach that he can almost feel it in his bones. It's an endless sea of desire that's slowly but surely destroying him. \nAlthough he's completely naked, completely bare and vulnerable, he still feels too hot. Jeongguk's lingering sent in the room is driving him crazy, the sandalwood he's so familiar with, mixing with his own and the next thing he knows is that he's grabbing Jeongguk's pillow and throwing his legs over it so that he's straddling it. By now the entire bed is almost wet with the slick running out of him but in his dizzy mind he can't find it in himself to care. He presses down on the pillow, so that his cock and balls can come in contact with it and he slowly starts moving his hips. Pretends that the pillow is Jeongguk's cock as he rides it, hips picking up speed with every move. \nThe moans and whines doesn't even reach his ears, he doesn't care how loud he's being, all he cares about now is trying to subside the heat that's taken over him. Beneath him the pillow is almost soaking wet as he continues to ride it, wanting to chase his orgasm 'till he can't anymore and he feels so lost and empty. The pillow is good, providing enough friction for his balls and cock, but he still feels so empty. Without much thought he bends over the pillow, hips not once slowing down as he keeps moving. With his ass up in the air like this, he reaches behind him and feels the slick running down his thighs. His hips don't stop moving as he presses a finger inside of himself and he moans when the single digit invades his walls. \nIt already feels a little better, but he's still bitter that it's not Jeongguk doing this to him. Sure, his fingers are long and can reach all the right places, but Jeongguk's fingers are long and thick and he knows exactly in which angle to press them to have Taehyung seeing nothing but white stars. He works the finger inside of himself as he rides the pillow, and soon he's pressing another finger into himself, ready to take and release the fire in him. \nIt continues like that for a few seconds, minutes, hours, Taehyung doesn't count and he doesn't care either. All that matters now is trying to find the blinding pleasure that's building up in his stomach like there's no tomorrow. Pretty soon he's cumming again, this time a long whine being drawn out of him and the pillow underneath him has long since passed the point of being sticky and wet but that doesn't deter him from stopping because that burn is still there and he just wants it gone. He pushes a third finger into himself as his movements picks up again and he's so lost in pleasuring himself that he almost doesn't register his alpha's smell. Almost. \nThe moment that Jeongguk's smell enters the room, Taehyung stops what he's doing and pushes himself up on his hands and knees, looks over his shoulder at Jeongguk through teary eyes. The alpha is standing there in nothing but briefs and Taehyung thinks that he must've quickly gotten rid of his clothes the moment he stepped into their apartment. He can't help but whine as more slick runs out of his hole when he smells the alpha and he pushes his ass back into empty air, the pillow underneath him long forgotten. \"Alp-Alpha,\" He whines, looks Jeongguk into the eye. \"Want your cock. Fingers. Tongue. Knot. Anything, plea-please.\" \nJeongguk doesn't waste time as he makes his way over to Taehyung. His face is stoic, in control, and Taehyung doesn't really know how he manages to do that when he's around an omega in heat. But. Here Jeongguk is. The alpha removes his underwear and his cock springs free, rock hard and red and already leaking pre-cum. Taehyung, who's still pushing back into thin air, can't help but let his eyes travels up towards the alpha. A growl escapes the former mention when they make eye contact and Taehyung whines. \n\"Easy, pup,\" Jeongguk says, voice so, so deep and that alone is enough to make Taehyung hard again. He feels slick dripping out of him as Jeongguk grabs his hips and stills them. \"Easy my little pup. Alpha's going to take good care of you baby.\" \nTaehyung nods, bites his lip as he watches Jeongguk push himself down on his knees so that he's level with Taehyung's ass. The alpha's hands travel to his cheeks and spreads them widely apart, exposing Taehyung like he doesn't even have a care in the world. A few silent seconds pass before the alpha lowers his mouth to Taehyung's dripping hole, finally, and Taehyung throws his head back and moans. At first, Jeongguk only flattens his tongue against Taehyung, licking up some of the slick that's there. \nThen he gets more serious; he continues with his licks, tongue big against Taehyung's hole. Then he gets more serious when he pushes the wet muscle into Taehyung, licking at his insides like he can't get enough of him. Jeongguk starts thrusting his tongue in and out of Taehyung, making him whine and push back onto the muscle. The alpha fucks him fast with nothing but his tongue and it's so good that Taehyung almost sees stars. He doesn't know how long this continues, doesn't know how long Jeongguk drives him to the edge like this but after some time he pulls out, Taehyung almost whining when he presses back in, this time fucking him even faster than before. \nTaehyung is almost crying from how good he feels, is almost crying from how hard is cock is, is almost crying just because and then Jeongguk pushes a finger in alongside his tongue and it feels so good, because now there's this wet heat in him and a digit that's searching for his prostate. It doesn't take long for Jeongguk to find it and when he does he doesn't go easy on Taehyung, he tongue-fucks and finger-fucks him at the same time, making him push his hips back into the alpha's face and he's pretty sure that Jeongguk's face must be covered of slick, messy. \n(That's how Jeongguk likes it anyway.) \nIt doesn't take him long to chase his orgasm, and when he does cum again, there's tears streaming down his face as he calls out; \"Alpha!\" \nThe next few days goes on like this, with them going at each other like rabbits. Jeongguk fucking Taehyung on almost every piece of furniture they have. He fucks Taehyung against the wall when they don't make it to the bedroom fast enough, he fucks him on the kitchen counter when they're taking a break and Taehyung's next heat comes unexpectedly. He fucks him against the window because he fucking can and he wants to, and he loves when Taehyung begs like he does for him whenever he fucks him there. \nIt's on the third day, a little past nine in the evening, when Jeongguk has Taehyung on his back, legs wrapped around his waist as he pushes himself into the omega deliberately slow. He has Taehyung begging for him like there isn't a tomorrow, has him moaning like a prostitute as he scratches down Jeongguk's back, leaving red marks that won't fade very easy. \nIt's the last sex they'll have before Taehyung's heat ends, meaning that this is when Jeongguk is suppose to mate him, and Taehyung can feel with every drag in Jeongguk's cock in him that the alpha is trying to make this last for as long as possible. He takes his time as he thrusts slowly, kisses Taehyung on the forehead, on his closed eyelids, on his nose, mouth. The only place that he really avoids is his neck, because that's for later, and right he just wants Taehyung to enjoy every moment that they're sharing. \nEvery little moan that Taehyung lets out, every whine, and sigh and groan, Jeongguk swallows. He doesn't even leave time for Taehyung to think, only lets his body and mind work together as he's being fucked....as he's being made love to. Because with every slow drag, with every swallowed whisper of his name, with every gesture, Jeongguk is telling him how much he truly does love him. \nTaehyung's legs are shaking as it's locked around the alpha, shaking as the familiar heat is starting to build. He reaches out beside him for something to hold onto, and lets his fingers grasp the sheets underneath him. He throws his head hack in ecstasy as he moans and arches his back off the mattress, pressing his body closer to Jeongguk's. When he looks back, the alpha's eyes are already on him, focused. There's sweat running down his forehead and his hair is wet at the ends, and still, he's the most gorgeous man that Taehyung has ever seen. \nTaehyung can feel Jeongguk's knot beginning to form with every drag, and he reaches for the alpha's hands, wants to hold onto him when it finally happens, and moans when both of their hand interlocks. Feeling Jeongguk against him like this isn't new at all, but somehow it still feels like it is, and Taehyung relishes in that. \"Alpha,\" He whispers. \"I'm so close.\" \nJeongguk doesn't stop his cock from pressing into Taehyung's prostate with each thrust, just looks down at him with love-filled eyes. \"I know pup,\" He groans. \"Me too.\" \nJeongguk lowers his head to Taehyung's neck, licks over the spot where they discussed that he will bite, and Taehyung knows that he must be close if he's doing that. His cock is already swollen inside him, and it only takes a few more thrust for Taehyung to choke out that he's going to cum. The next thing he knows is that there's an overwhelming sense of both pain and pleasure shooting through him as Jeongguk is biting down on his neck while he's cumming and he feels the tears start to fall from his eyes. Pretty soon it's only pleasure taking over his body as he cums on himself. \nJeongguk licks the mating-mark clean before he pulls away to admire his work. His eyes are shining and he's squeezing Taehyung's hand like no tomorrow as he thrust once, twice, three times before releasing his knot inside him. Taehyung feels as if he's being pumped full but he doesn't mind. After he's done, Jeongguk falls on him, head on his chest and breathing heavy. Taehyung retrieves his hand from Jeongguk's hold and wipes it through the alpha's sweaty hair. \nWhen they make eye contact, they both smile. Because now they truly are one. Now their feelings are connected, their souls connected, their minds connected and that's all they could've ever wanted.\nIt'll take a while for the knot to go down, but Taehyung doesn't think he minds being connected with Jeongguk like this. \n\"I love you to the moon,\" Jeongguk whispers, still out of breath. \nTaehyung's heart is racing as he smiles at his mate. \"And I love you to the stars.\" \n-\nThe next day has Taehyung dreading it already. \nHe feels wonderful, ecstatic, don't get him wrong, but because of the fact that mated pairs have to stick to each other like glue for the first few days of the bond, he has to join the alpha at work for a few days because the alpha really couldn't get off. He doesn't really mind the fact that he has to help with work, he was the one who suggested it, he just minds the fact that he has to deal with his old colleagues. \nOr more, colleague. \nHe hasn't really thought a lot about Chaeyoung ever since he's moved on with his life, but now that he's going to face her again he can't help but wonder what will come from it. Will she still be as mean to him? Will she respect him? Will she just ignore him? \nIn a way, Taehyung really has her to thank for the life that he's living now. If he weren't for the fact that she had messed around in his private stuff, he wouldn't be mated right now. Hell, he'd still probably be working next to Jeongguk as a beta and pining after him like a hopeless little fool. If it weren't for her he wouldn't be working his dream job at his dream company. Taehyung doesn't think he can resent her for what she did, not really. He's long since moved on with his and gotten everything he'd dreamed about having. \nIf she hates him, then that's okay. \nBecause Taehyung has his mate by his side, and with that he feels like he can take on the entire world."
}