{
    "id": "1295044",
    "url": "https://archiveofourown.org/works/1295044?view_full_work=true",
    "author": [
        "emungere"
    ],
    "title": "Consenting to Dream",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Hannibal (TV)"
    ],
    "relationships": [
        "Will Graham/Hannibal Lecter"
    ],
    "characters": [],
    "additional_tags": [
        "Shopping",
        "First Time",
        "Sugar Daddy",
        "Courtship",
        "Slow Build",
        "Slow Burn",
        "Praise Kink"
    ],
    "language": "English",
    "series": "Part 1 of What Dreams",
    "published": "2014-03-10",
    "completed": "2014-06-05",
    "words": "32,188",
    "chapters": "15/15",
    "comments": "2,334",
    "kudos": "33,537",
    "bookmarks": "7,523",
    "hits": "656,261",
    "summary": "<p>A seduction through physical objects. It starts with a scarf loaned to Will on a cold day, but Hannibal, as usual, isn't satisfied with anything small.</p>",
    "notes": "<p>Thanks very much to louiselux for betaing and general endless patience.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>happy birthday, izzy :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_15_endnotes\">notes</a>.)\n</p>\n<p>You can check out my <a href=\"http://www.eleanorkos.com/\" rel=\"nofollow\">original writing here</a> if you're interested.</p>\n<p> </p>\n<p>That's it. Thanks for reading and for all the support. Peace out, girl scouts. </p>\n<p><a href=\"https://emungere.tumblr.com/tagged/consenting+to+dream\" rel=\"nofollow\">posts for this fic</a> | <a href=\"https://emungere.tumblr.com\" rel=\"nofollow\">emungere.tumblr.com</a></p>",
    "text": "\nAn artist is a dreamer consenting to dream of the actual world.George Santayana\n\n*\n\"Please, come in,\" Hannibal said. He stepped aside to gesture Will into his office.\nWill took two steps and stopped. The corners of Hannibal's mouth had drawn tight, barely a flicker of movement, but Will caught it. He'd spent the last three hours in the morgue. The smell tended to linger. \n\"You might not want to be in an enclosed space with me right now. We can reschedule?\"\n\"Perhaps we might walk?\" Hannibal said. \"I would welcome the opportunity to clear my head.\" \n\"Sure.\" \nHannibal took his coat and bag from a small closet near the exit. He switched off the lights one by one. \n\"Am I always your last appointment?\" Will asked.\n\"Yes. I don't usually see patients after seven.\" \nWill frowned. \"You never said. I could've done it earlier.\" \n\"I prefer to see you last.\"\nWill didn't know what to say to that, or how to feel about the smile that accompanied the words. Even when they hit the chilled air of the street, he felt warmed. \nWind slashed at the bare trees. The sun had sunk from sight an hour ago. The few people on the sidewalk hurried toward home, heads bent, hands jammed deep into their pockets.\n\"Hard to imagine you needing to clear your head,\" Will said.\n\"I also spend my days entangled in the minds of others.\" \n\"I don't think you find it that hard to extricate yourself.\"\n\"It depends on the patient.\"\n\"What kind of patient did you have for your last appointment?\" \n\"Fairly average, neurotic, a tendency to sweat.\" \nWill shook his head and suppressed a smile. \"Unkind, Dr. Lecter. Not very professional.\" \n\"I apologize,\" he said, eyes bright with amusement. \"The day has seemed longer than usual, and I have an unfortunately acute sense of smell. Sometimes useful, but more often a burden.\" \n\"How acute?\" \n\"Your visit to the morgue was immediately apparent. I could tell you what you had for lunch as well. In closer proximity, I could name your shampoo.\" \nWill raised his eyebrows. \"So what did I have for lunch?\" \n\"A tuna salad sandwich. Too much mustard in the salad mix. On commercial white bread, which I will call bread only because there is no other recognized term for it.\" \nWill resolved to stock up on gum or mints before his next appointment, but the larger part of his attention was devoted to fitting this into the ever-evolving construct of Hannibal that he held in his mind. He found himself strangely delighted by this new piece, odder than the rest, and by Hannibal's willingness to share it with him. \n\"You can't smell bread,\" Will told him. \"It doesn't smell like anything.\" \n\"Real bread does, but I admit that part was a guess based on what I know of you and your background.\" \n\"I have a Wonder Bread background? I'm pretty sure I should be insulted.\" \n\"But you're not. For the most part, your past doesn't trouble you. Your insecurities lie elsewhere.\"\nWill looked away, down the row of streetlights and dark houses. \"And where do your insecurities lie?\"\n\"Not in my past, certainly. We have progressed beyond our origins.\" \n\"Tell me about your origins,\" Will said. \nHannibal was quiet for the space of half a block. They stopped at an intersection, far enough back to avoid the spray of slush as cars blurred past. \n\"The scent of pine and snow,\" Hannibal said. \"Dark rye bread and water drawn from underground, so cold that it carries the memory of long ago glaciers.\" \nWill looked over at him. Hannibal watched the traffic and let him look. \"Do you miss it?\" Will said. \n\"At times.\" \n\"Would you ever go back?\" \n\"Would you?\"\nThey crossed the street when the light changed and kept walking. Will turned his collar up, but the wind still burned his skin. He hunched his shoulders forward and ducked his head. \n\"Sometimes I think I should,\" he said. \"Diesel and salt. Surf fishing. I know it'd be better for me. I know I'd last longer.\" \n\"And yet you continue.\" \n\"I'm helping people.\" \n\"Saving lives,\" Hannibal said. \n\"Yes.\" \n\"Why?\" \n\"What do you mean why?\" \n\"It's a motivation no one questions. Given the damage it does to you, perhaps the question should be asked.\"\nWill couldn't find an answer. They walked in silence until they came to the next intersection. Will saw the bus and the slush puddle just before they collided. He stepped in front of Hannibal without thinking and took the icy spray up his back. It put him closer to Hannibal than he'd meant to get. \nHannibal was smiling at him in that minimalist way he had, creases around his eyes and an impression of warmth and little else. \"Very chivalrous,\" he said. \nWill shrugged awkwardly. \"Everything I'm wearing can go in the washing machine.\" \nHannibal unknotted the scarf around his own neck and looped it around Will's before tucking it down into his jacket. \"Not anymore. Cashmere and silk. Please look after it properly.\" \n\"No, come on--\"\nWill pulled at it, but Hannibal stopped him with a light touch at the center of his chest.\n\"Take it,\" he said. \"You're underdressed, and the walk was my idea. I don't want you to be uncomfortable.\" \nThe light fabric held the heat of Hannibal's skin close against Will's neck. He didn't want to give it up. \n\"And it was customary for a knight to carry his lady's favor into battle,\" Hannibal said, face perfectly serious, except for the teasing glint in his eyes. \nWill had to smile. He looked down and shook his head. \"Now you're just making fun of me.\" \n\"Perhaps. Come, let's continue.\" \nHannibal's light touch got him moving. For the space of a second or two, they walked arm in arm. Will liked the pressure of Hannibal's hand curled into the crook of his elbow as much as he liked the scarf around his neck. Maybe more.\nWhen he drove to Hannibal's house the next day to return the scarf, he wore his own as a sort of demonstration. Not silk and cashmere, maybe a little faded, but perfectly adequate. \nFolded on his passenger's seat, the soft gray plaid shot through with blood red looked as out of place as it no doubt looked on him. He picked it up and went to knock on the door. \nHannibal was drying his hands when he answered, white apron tied over dark pants. He smiled when he saw Will and stood back to let him in. \"You have excellent timing,\" he said. \"Lunch is almost ready.\" \n\"Oh, no, I just--\" He held out the scarf. \"I came to return this.\" \nBut somehow, he was inside, and Hannibal had shut the door behind him. \n\"Not at all. It's a gift. In fact, I'd meant to bring you these as well.\" He picked up a pair of gloves from the little table under the mirror and tossed them to Will. \"Please, excuse me for not taking your coat. The beef is at a critical stage.\" \nWill stood with the scarf and gloves clutched to his chest for a moment while Hannibal disappeared into the kitchen. He sorted himself out, took his jacket off, and hung it up. The gloves were brown leather, lined with something light and warm. He hesitated, but it couldn't hurt just to try them on.\nThey fit perfectly. The leather was so soft that, after a guilty glance toward the kitchen, he let himself press a hand to his neck and feel it there, on more sensitive skin. He took them off again quickly and set them on the table, along with the scarf and just a bit of regret. \nHannibal stood over a cast iron wok in the kitchen. The room was filled with the scent of fresh ginger and garlic and the sizzle of high-heat cooking. Will had meant to say he really couldn't stay. Instead, he asked if there was anything he could do. \n\"You may pour yourself a glass of wine and tell me how your class went.\" Hannibal nodded to the open bottle on the counter. \n\"The gloves,\" Will said, as he poured. \"I can't.\" \n\"You don't like them?\" \nWill resisted the urge to roll his eyes. \"You know it's not that.\" \n\"Yes, I do.\" Hannibal spooned the stir fry onto plates already dotted with three colors of rice molded into squares. \"It is, however, the only excuse I will accept, since otherwise you are depriving yourself solely in an attempt to conform to social standards. I wouldn't have expected it of you.\" \n\"Maybe my Wonder Bread background is showing, but all I can think when I look at those gloves is that they must've cost about a hundred bucks.\" \n\"More, in fact. Is that a problem?\" \n\"Yeah, it's a problem.\" \n\"Why?\" \nWill fiddled with his wine glass and scuffed his foot lightly over a depression in the slate floor. \"Why do you want to give them to me?\" he said. \n\"Is there an answer that would satisfy you?\" \n\"The truth would be a good start.\"\n\"The truth is that it would please me to give them to you.\"\n\"And now we're back to why.\"\nHannibal picked up the plates and led him into the dining room. \"Do you suspect me of some nefarious motive?\"\n\"I don't suspect you of anything. I just don't get it.\"\nHannibal didn't speak for the space of two or three bites. \"Aesthetic pleasure,\" he said, at last.\nWill glanced up from his plate. \"Yours or mine?\"\nHannibal smiled very slightly. \"Why not both?\"\nWill let it go after that. It seemed dangerous to keep pressing. \nHe drove home with both scarf and gloves on the seat beside him. When he took the dogs out that afternoon, he put them on and flushed just a little, alone in the cold, at the thought of the aesthetic pleasure Hannibal might get if he were there. He must've meant something else, but no matter how Will twisted it in his head, he couldn't see what.\nHe threw sticks for the dogs and tried not to worry about scratches in the leather.\nWill wore the gloves and the scarf all week, to class, to one of Jack's crime scenes, to walk the dogs. It wasn't until his next appointment with Hannibal that he hesitated and opened his closet to peer at himself in the only full-length mirror in the house. \nAs expected, he found nothing particularly pleasing, aesthetically or otherwise. If anything, the combination of scarf and gloves with his old green jacket gave him a disjointed look, like a scarecrow cobbled together from discarded garments. \nHe pulled his good coat from the back of the closet and put it on without letting himself think too much about his motives. It was nearing ten years old, and the last time he'd worn it was to Miriam Lass's funeral. He spotted a couple of moth holes in the collar, but it was the best he could do. \nWhen Hannibal opened the office door for him a little over an hour later, Will wished he'd stuck to his jacket. Hannibal's gaze lingered on his body and tracked his movements as he entered. He peeled out of all three incriminating items as quickly as possible. \n\"Before we begin,\" Hannibal said, and handed him a small, flat object, wrapped in matte black paper and embellished with a black ribbon. \n\"Is it a gift wrapped funeral?\" Will said, manners frayed by discomfort. \"Sorry. What is it?\" \n\"I took a trip to New York this week. There's a bookshop there that I'm fond of, and when I saw this, it seemed like fate. If you believe in such things.\"\n\"I don't read that much outside of forensics texts,\" Will said, and then he ripped off the paper and stopped. \nThe book inside was black as well, cloth-bound with an embossed cover. The title, printed in gold read: The Fly-fisher's Entomology. Very slight wear at the corners, an overall feeling of age and quality. He turned to the title page. The date was 1839. \nHe sank down slowly into the chair, still turning pages. The paper inside was thick and heavy, edges uncut. The illustrations seemed more real than photographs, colors still vibrant after more than a hundred years. He closed it abruptly and pressed his hand over the cover. \n\"I can't keep this,\" he said, and it hurt. \n\"It's not a first edition.\" \n\"I know it's not. That was 1836. It still must've cost--\" He stopped and shook his head, felt unbelievably crass bringing it up. \n\"The money is unimportant.\" \n\"Says the man who's always had money.\" \n\"Not always,\" Hannibal said. \"For most of my life, yes. But I have known the opposite extreme as well. There were years, as a child, when I considered one meal a day fortunate, two nearly unheard of.\"\nWill looked up to study the muscles in his neck and jaw, but there was no tension there, either to suggest a lie or any discomfort with the admission. \"After your parents died?\" Will asked. \n\"Yes. I was on my own for a time, and then there were several poorly funded orphanages before my uncle found me.\" \n\"What took him so long?\" \n\"He and my father were not fond of each other, and he was still less fond of the title that went with the estate. It took the executors some time to locate him.\"\n\"Title?\" \nHannibal leaned against his desk and gave him a dry smile. \"Count Lecter, I'm afraid. In all likelihood, I will be the last.\" \nWill was hit with the memory of his shoes in second grade, going at the toes and patched with duct tape. His math teacher had caught his father after school and offered him the money to replace them. At the time, Will hadn't understood why his father thought that was a bad thing. And his shrink was European nobility. He wanted to laugh, but Hannibal would make him explain it. \n\"Does anyone know?\" Will asked. It seemed like the sort of news that would get around. \n\"Not in this country. There was never any reason to speak of it.\" \nWill stood and paced to the window. He held the book against his chest, unwilling to set it down. \"You found a reason just now.\" \n\"You asked. I could have avoided telling you, but what would be the point?\"\n\"What was your point to start with?\" \n\"That the experience of want should lead to a more thorough appreciation of beauty. As I believe you will appreciate that book.\"\nWill looked down at it, cradled against his chest. \"It is...beautiful.\"\n\"All the more reason you should have it.\" \nThe need to hide from that statement turned him abruptly toward the window. He looked at the lights in the house across the street, at the dimming sidewalk below. \n\"You don't get something for nothing,\" he said. \n\"To be sure, gifts can carry a freight of gratitude and obligation. Is that your experience?\" \n\"I don't have a lot of experience with gifts.\" \n\"Tell me about the most memorable.\" \n\"One of my dad's friends gave me a bike when I was six. Turned out he stole it.\" \n\"I assure you, I paid for the book legitimately.\"\n\"I know you did.\" \n\"And yet something about this situation reminds you of that one, or it would not have come to mind so quickly.\" \nIt was a fair point, and Will managed not to snap at him for it. He circled the room, under the loft, close against the walls. \n\"It makes me feel like someone's going to yank the rug out from under me,\" he said. \n\"The feeling that you have been given something meant for someone else. Something you don't deserve.\" \n\"People get things they don't deserve all the time.\" \n\"What do you get that you don't deserve?\" \n\"I don't know. Nothing.\" \n\"It seems to me you've had more than your share of undeserved suffering.\" \n\"That's not--\" Will shook his head and swallowed. \"Not what I was talking about.\" \n\"I did nothing to deserve the wealth I inherited. It has made my life much easier than it might otherwise have been.\" \n\"And now you've got a sudden desire to share?\" \n\"I got you the book because I thought you would like it, and it pleases me to see you happy,\" he said simply. \nWill stopped by the ladder and looked at Hannibal between the rungs. \"I do like it. It's just--\" \n\"The money.\" Hannibal pushed off the desk and came to stand on the other side of the ladder. \"More specifically, the amount.\"\n\"Yeah.\" \n\"You know I can afford it, so it's not that you fear for my finances.\" \n\"Tell me I'm being ruled by social convention if you want. I just can't-- It's too much.\" \n\"And yet you're still holding onto it. Rather tightly.\" \nWill sighed and rested his forehead against the ladder. He offered Hannibal the book back between the rungs. \nHannibal made no move to take it. \"Suppose I offered you a way to earn it?\" \nFor a second, Will was blinded by the vision of himself on his knees with Hannibal's cock in his mouth. Pure fantasy, so absurd he had to smother laughter again. He knew perfectly well what Hannibal was likely to want from him, and it had nothing to do with sex.\n\"Well?\" he said. \n\"Let me buy you a new coat.\" \nThis time, Will did laugh, one sharp exhalation through a disbelieving smile. \"What?\"\nHannibal leaned against the ladder, deliberately casual and unthreatening. \"Something you want for something I want. A simple exchange.\" \n\"Are we back to aesthetic pleasure?\" \n\"We never left.\" \n\"That's not what I thought you were going to ask for.\" \n\"What did you think I wanted from you?\" \nWill shook his head. He looked down at his own hand on the book, still grasping. Covetous. Unusual for him. He thought it might have as much to do with the giver as the gift. \n\"An all access pass, perhaps?\" Hannibal said. He tapped the center of Will's forehead and left his finger pressed there. \"That's what people normally want from you, isn't it?\" \n\"Yeah.\" \n\"They wish to take what they don't deserve and give nothing in return.\" \nWill flinched from that truth more than the touch. \n\"I prefer our quid pro quo,\" Hannibal said. \"I don't want to steal from you, Will. That has never been my intention.\" \n\"You just want to dress me up like a doll.\"\n\"Not like a doll. I would never expect or desire passivity from you.\"\n\"But you do want to dress me up.\" \n\"Yes.\" \n\"You don't think that's a little inappropriate, Dr. Lecter?\" \n\"Do you? It's certainly unusual, but I'm sure you realize that our relationship is already unusual. I've never pretended to professional detachment with you. You wouldn't allow it.\" \nIt was true that Hannibal had told him nearly as much about himself as Will had offered in return. Viewed in that light, Will wondered if this were one more thing Hannibal was giving him, another collectible oddity like his acute sense of smell or his disused title. Will wanted that more than he wanted the book. \nHe hesitated, still, pointlessly. He already knew what his answer would be. \n\"Okay,\" he said. \"The coat, fine. I'm not promising to wear it.\"\n\"What use you make of it is up to you.\"\nThat Saturday morning, Hannibal's Bentley rolled to a stop at the end of Will's driveway. Will let the screen door bang behind him and slid into the passenger’s seat before Hannibal could get out.\n“Good morning,” Hannibal said, as he pulled back onto the road. “How are you today?”\n“Fine,” Will said, too quickly. He looked out the window. “Not fine. Do you take all your patients shopping?\"\n\"No, nor most of my friends.\"\n\"But some of them?\"\n\"Once or twice in the past when a woman of my acquaintance has needed something for an event.\"\n“So, not your friends. Your dates.\"\n\"I try not to become romantically involved with anyone I would not have as a friend.\"\n\"An event. So they-- She complained she had nothing to wear, and you fixed it. I don't remember complaining.\"\n\"I don't remember suggesting that this was about what you want.\"\nWill chewed the inside of his lip and rubbed one palm against his thigh.\n\"Have I made you uncomfortable, Will?\"\n\"No. I don't know. Not uncomfortable.\"\n\"What then?\"\n\"You use honesty like a weapon.\"\n\"You do it, too.\"\n\"I know I do it. I'm used to it from me.\"\nHannibal laughed quietly. \"Perhaps your truths are less shocking than mine.\"\n\"I sincerely doubt it.\" \n“Have you been enjoying the book?”\nWill glanced over at him. “Yeah. A lot. Thank you.”\n“No need for thanks. Today will be a more than adequate repayment.”\n“Doesn’t seem like an even trade.”\n“It does to me.” Hannibal paused. “If you objected that deeply, you could have returned it to me and bought your own copy. It was an expense, I admit, but not an insurmountable one.”\nWill shook his head. “I couldn’t.”\n“Forgive me for stating the obvious, but you’re not poor now. With the work you’ve published and your position at the Academy, I assume you must be reasonably comfortable.”\n“It’d be a waste.”\n“It’s never a waste to acquire beauty,” Hannibal said. “Perhaps especially in your case. An antidote for the well of human ugliness into which you dip your mind.”\nWill thought of the aftermath of his latest early morning nightmare, flipping through the illustrations with shaky hands as his pulse slowed. Hannibal might have a point, but he still couldn’t imagine spending that kind of money on himself.\n*\nThe store had valet parking. Will wasn't even surprised.\nWood paneling and brass fittings made it look more like a manor house library than a clothing store. Music played softly in the background, something classical rather than the current pop or tortured covers of 90s hits that grated against Will's brain when he ventured into Macy's to replace worn out socks.\nA salesman in a suit sharper than anything Will had ever owned looked the two of them over. He turned his bright smile on Hannibal.\n\"Is there anything I can help you find today, sir?\"\nHannibal allowed him to guide them to the coats and then dismissed him with an absent nod.\n\"Did you have servants when you lived with your uncle, the count?\" Will asked.\nHannibal walked between the racks, perfectly poised, and took off his gloves to judge the fabric with his fingers. \"He had a butler and a housekeeper, who also cooked for us. The cleaning staff came in twice a week.\"\n\"What about now?\"\n\"I do my own cleaning.\" He gave Will a brief smile. \"And my own cooking. Try this.\"\nWill hung his own coat off the end of a nearby rack and took the one Hannibal offered him. It was a black wool overcoat, double-breasted, gold outlines around the buttons. He shrugged into it. \"Well?\"\nHannibal shook his head and held his hand out to take it. \"Much too harsh. And not ideal with the gloves.\"\n\"Black doesn't stain when you get engine grease on it.\"\n\"If you insist on being practical, most of your dogs are brown.\"\nWill smiled a little. \"Point.\"\nHannibal held up another overcoat against him, this one dark gray. He shook his head and put it back. \"Lighter, I think. Your complexion is too delicate for something so stark.\"\nWill trailed after him, jacket bundled under his arm, hands shoved deep into his pockets. \"I don't think delicate is the word you want,\" he muttered.\n\"Certainly it is. Fair skin and pale blue eyes. A classic beauty, but easily overwhelmed.\" He flipped through a few coats and then moved on. “You hide it well, but it shines through despite your best efforts.\"\nWill frowned at the back of Hannibal's head and hunched his shoulders. \"I don't know if you're complimenting me or insulting my wardrobe.\"\n\"There's nothing wrong with your wardrobe, as such. At least with the things you wear by choice. It has a certain style, and I can't say it doesn't suit you.\"\nWhich left choice A. Will felt himself flush, knew it would show. His delicate complexion. It should sound like flirtation, but Hannibal was more focused on the coats than him, and his tone suggested simple statement of fact rather than flattery.\nHad he been like this with the women he'd bought clothes for? No. Will could see that immediately. Hannibal would've been polite and attentive and warm, would've made them feel they were the center of the world and all the while he'd be off somewhere in his own head. Hitting all the social grace notes on autopilot.\nNo autopilot now. Will watched him examine seams and turn up collars and check linings.\nHannibal handed him a tan trench coat. \"Try that.\"\nWill pulled it on, and Hannibal tugged him a step closer by the lapels. Close enough that Will could smell the coffee on his breath as he arranged the coat, right over left, and tied the belt. Will wondered what Hannibal could smell on him, if there were a particular scent that accompanied the feeling of being completely at sea.\n\"Better,\" Hannibal said. \"But it's nearly winter, and the lining is thin.\"\nHis knuckles brushed Will's stomach when he untied the belt, and Will let himself be turned by the shoulders and helped out of it. Hannibal's hands skimmed down the length of his arms.\n\"Is this where you got yours?\" Will asked, almost desperate for distraction.\n\"I purchased mine in Italy some years ago. In Florence. A beautiful city.\" He gave Will a quick smile. \"I would have suggested it if I'd thought there were any chance you'd agree.\"\n“Funny. I’ve seen pictures. It looks nice.\" Awkward, but probably less of a conversation killer than admitting he'd been out of the country only twice, both times barely across the border into Mexico on attachment to the DEA.\n\"I think you'd like it. Or perhaps Venice. Not in the summer when it's overrun by tourists. Venice in the rainy season. Floods and flocks of dripping pigeons in the Plaza San Marco, high water in the canals, a thousand ancient stone bridges crumbling under your feet.\"\n\"I've heard people compare it to New Orleans.\"\n\"Two singular cultures in constant danger of being subsumed. It's apt enough. What about this one?\"\nHe held up a camel colored overcoat with large, dark buttons.\n\"I get a say in this now?\" Will asked.\n\"To an extent. Buying you something you hate would be counterproductive.\"\n\"Not that one then.\"\nHannibal nodded once and put it back on the rack. They moved on.\n\"When does it rain there?\" Will asked.\n\"In Venice? In the winter. The water rises, and the tides pull it up into the streets, and the city drowns a little more. The acqua alta, they say, where other cities would call it flooding. The high water. A mere feature of life rather than a state of emergency. One must admire the Venetians. They walk hand in hand with entropy.\"\nWill drifted after him and imagined following him instead down the flooded streets of a city half a world away, cold rain falling on their shoulders.\n\"This looks promising,\" Hannibal said. \"What do you think?\"\nThe coat he held up was dark brown shearling with leather trim around the collar. Warm enough to walk the dogs in, even in the middle of winter. It lacked the hard, tailored look that most of the others had.\n\"It's not bad,\" he said.\nHannibal took it off the hanger and held it for him, but not for him to take. He held it by the lapels, spread open.\nWill turned his back to him and threaded his arms into the sleeves. Hannibal drew it up over his shoulders and smoothed it there, folded down the collar, kept his hands on Will as he turned him, on his chest and hips and finally falling away as he stepped back to look him over. His mouth curved in a small, pleased smile.\nHe guided Will over to a full length mirror and stood behind him.\nWill stared at himself. The scarf still hung around his neck. With the coat fastened and his cheap plaid shirt hidden, he almost didn't recognize himself.\n\"What do you think?\" Hannibal asked.\n\"I look…good,\" he said, and heard the surprise in his own voice.\n\"You certainly do. Very nice indeed. How does it feel?\"\n\"Weird.\"\nHannibal smiled more widely. \"The coat, Will.\"\n\"Oh. It's-- It's great, actually. Comfortable.\"\n\"Excellent. You'd be happy with this one then?\"\n\"Yeah, I think so.\"\n\"And so would I. It suits you quite well.\" \n\"So that's it? We can go now?\"\nHannibal looked amused. \"Have you found this so very tiresome that you can't wait to escape?\"\n\"Could've been worse, I guess. I just don't see the appeal.\"\n\"Perhaps a different location next time. The wider selection here was good to start with, but now that we have something to build on, we can move to something a little less mass market.\"\n\"I don't remember agreeing to do this again.\"\n\"And I would certainly never force you into anything you didn't want. Here, let me take this.\" He eased the coat off of Will's shoulders and draped it over his arm.\n\"I've got the complete set,\" Will said. \"Scarf, gloves, coat. What do you-- I don't need anything else. I didn't need this.\"\n\"Must I remind you that this is only tangentially about what you want? Come.\" He guided Will toward the register with an absent touch on his back.\nHe took Will's jacket from him and laid it over the counter as well. \"Put this in a bag, please, and take the tags off the other. He'll wear it home.\"\nThe salesman gave Will a quick once over. Will saw himself dismissed as some disadvantaged relative or charity case. He took the coat when the man passed it to him and pulled it on. It felt just as good the second time. He turned to Hannibal, meaning to say thank you, but the words evaporated out of his mouth when he saw him.\nHannibal ignored the salesman entirely as he laid a matte black credit card on the counter. He only had eyes for Will, wrapped up in his new coat and fidgeting with his gloves, unable to keep still. Hannibal watched him with approval and possession and no attempt to disguise either one.\nIt made the back of Will's neck prickle. A strange heat settled in his stomach, not uncomfortable, but certainly unusual.\n\"Shall we?\" Hannibal said, and for a second Will thought he was going to offer him his arm.\nWill wrapped the scarf closer around his neck and pulled on the gloves. They walked out together.\nWill woke around three in the morning, not from a nightmare, but from Lizzie whining to be let out. He sighed and pulled himself out of bed. It was better than cleaning it up in the morning. He shoved his feet into ragged slippers and grabbed a coat from the closet. The new coat, of course. It hung near the front, ready to hand.\nIt wrapped around him like a blanket, and he barely felt the chill, even standing out in the frosted grass while Lizzie did her business. She yipped and dashed past him when he opened the door again. Five seconds later she’d flopped down next to Scrub and passed out. Will rubbed his eyes and wished sleep would return as easily to him.\nHe kept the coat on as he made tea, chamomile, picked in the field behind his house the previous summer. The fleece moved softly over his bare skin. He stood in his darkened kitchen and found himself wondering how it would feel without the shirt.\nNo reason not to find out. He laid the coat across his counter, pulled off his white undershirt, and put the coat back on. One button fastened, just enough to hold it closed so he felt it all across his chest.\nWhile the tea steeped, he went back to the closet and stopped with one hand outstretched for a hanger, caught by his own reflection in the mirror inside the door. He looked like he was wearing nothing but the coat. When he kicked off his slippers, the impression grew stronger.\nPerhaps inevitably, he wondered what that would feel like. His bare dick and thighs against the fleece.\nHe hesitated. The only light came from his bedside lamp, and he saw only a shadow of himself in the mirror. That made it easier to reach under the hem of the coat and pull his boxers down. He kicked them aside and stood there. Naked except for what Hannibal had bought him.\nHannibal had taken him out to lunch afterward. Will had offered to pay, almost insisted on it. Tried to insist on it.\n\n\"It's the least I can do after, you know.\"\n\n\n\"That's not how I see it. You've been very patient, and you deserve a reward.\"\n\nHannibal rewarding him for his patience. For his good behavior. The kick of heat he got from that hit him hard, made him flush right down to his chest. Made his cock heavier between his legs. Christ.\nExhaustion hung too heavily on him, and he couldn’t unravel the whys and hows tonight. It was easier, surprisingly easy, to watch his shadow image in the mirror and stroke himself.\nOnly him, alone in his house in the middle of nowhere. Safe as he ever was. He took one glove out of his pocket and slid it on, let himself think of nothing as he closed the soft leather around his cock. He sighed and leaned against the wall and let his eyes close.\nJust a few pulls, a little teasing around the head, and he was hard enough that he worried about getting fluid on the glove, staining it. His mind drifted to his next appointment, and he wondered if Hannibal would notice. If the scent of Will's arousal would cling to the leather for that long.\n\"Fuck,\" he said, startlingly loud in the silent room, and bit his lip. One of the dogs scrabbled against the wooden floor and then lay still.\nBut fantasies never hurt anyone. He'd learned to let himself have what he wanted in his head, since he so seldom got it anywhere else.\nHe spat on his right hand and moved the gloved left upward to pinch at his nipples, but that wasn't how it went in his head. Hannibal caught his wrist as he came in the door, brought Will's hand up to his nose and inhaled sharply. He knew. Will could tell he knew, though he said nothing, and oh god, the sharp, almost cutting thrill of it, of waiting for judgement, knowing he'd done something so fucking filthy with Hannibal's gift--\nHe came on the mirror and on the floor in front of it, breathing so hard that he had to lean against the doorframe. Dizzy, waiting for his blood to settle. Feet abruptly cold against the floorboards.\nThe inevitably squalid aftermath followed. Paper towels from the kitchen to clean up his mess. He took his tea back to bed with him and left the coat on while he drank it. The gloves got tucked neatly away in the pocket again, unstained.\n*\nMorning arrived with the usual cacophony of birds outside and dogs inside. For once, Will lingered in bed, more or less well rested. He smiled at the ceiling and stretched.\nLizzie was at the door again, making urgent noises. He let the whole pack of them out and stood on the porch, still naked except for his coat. He tingled a little at the thought. Could probably go again in the shower, but maybe better not to. He didn't need this getting out of hand.\nEven so, he wore it while he made coffee and Cheerios with bananas, wore it while he ate in bed with a pile of dogs around him. Stupid, maybe, but it made him smile, made him feel oddly decadent, even with Homer trying to get his nose in Will's bowl every five seconds.\nHe grabbed his laptop and bypassed his usual round of morning emails to check the website of the store they'd visited yesterday. Hannibal hadn't let him see the price tag, and he needed some kind of reassurance that it hadn't been too horrific. It was a nice coat. Really nice. Maybe half a grand. Maybe as much as $800, though he hoped not.\nWhen he found it, he had to set his bowl down and press both hands over his mouth. He stared at the price, but it didn't change. Two and a half thousand dollars. For a fucking coat.\nHe reached for the remains of his breakfast with a hand that felt slightly numb with shock and found Homer had polished off the rest of the Cheerios, bananas and all. Will couldn't even pull himself together enough to scold him for it and scratched his ears instead.\nIf he went to the store right now, they probably wouldn't take it back. Too much dog hair. His for keeps. He wrapped his arms around himself and stared at the screen.\nHe didn't want to take it back. Somewhere, under the shock, lurked a little bit of idiotic, bubbling joy at the idea that Hannibal thought he was worth that much. It didn't say much for his self-esteem or mental health, but there it was.\n\"God, you're stupid sometimes, Graham,\" he said. Winston woofed at him. \"No, not you, don't worry. Okay, everyone off the bed.\"\nHe shooed them off and went to shower. Even on a Sunday, there was only so much time a rational human being could spend lounging around naked in a leather coat.\nLater, when he took the dogs out into the fields, he slipped it back on and had a moment's guilty pleasure at the memory of how it had felt against his bare skin.\nWill and Beverly watched the paramedics load the one survivor, unconscious, into an ambulance.\n“My sister locked me in the closet for a few hours once when I was a kid and I had nightmares for months,” Beverly said. “How do you get over something like this?”\n“You don’t,” Will said. “You become someone else. Someone who can deal with it. Or you don’t.”\nThey looked at the row of plywood coffins and the bodies inside them, beginning to bloat. The insides of the lids were covered in scratches, blood, even shreds of torn skin. They’d tried so hard to get out. \nWill shivered and pulled his coat closer around him. It kept out the chill of the desert air, but not the chill gathering inside him. “I have to make a phone call,” he said, and walked away.\nHe dialed Hannibal’s number. \"I'm not going to make it tonight,” he said, when Hannibal picked up.\n\"You're aware of my cancellation policy.\"\n\"I'm in New Mexico with Jack.\"\n\"I see. How is it?\"\n\"New Mexico?\" He looked around at the expanse of low scrub and red-brown dirt that surrounded the open graves and reached to the low hills that lined the horizon, miles away. \"Bigger than I was expecting.\"\n\"And the crime scene?\"\n\"They were buried alive,\" he said.\n\"I have some time now, if you would like to talk.\"\nWill retreated to the shelter of a police van and sat down to lean against the tire, out of the wind. \"One of them beat her head against the inside of the coffin until she passed out. Her face is a mess.\"\n\"Is? She survived?\"\n\"Yeah. Zeller says she'll probably have brain damage. Between the head trauma and the lack of oxygen. It's bad here. It's a small town. The local cops are freaked out. Even some of our guys from the Santa Fe field office aren't doing great.\"\n\"It is a primal fear. Trapped in the dark with no escape. Abandoned to the horrors inside our own minds.\"\n\"Yeah.\"\n\"You are picking up on their distress.\"\n“Trying not to,” he said. He could hear the strain in his own voice.\n\"Would you prefer to speak of something else?\"\n\"Almost anything.\"\n\"Shall I look after your dogs?\"\n\"I can ask Alana if you don't want to. I know it's a long drive.\"\n\"I don't mind.\"\nHe heard someone on the other side of the van breathing hard, a wet sound, muffled by skin or cloth. Suppressed fear and nausea. Will was unfortunately familiar with both.\nHe tried to focus on the faraway sound of traffic outside Hannibal's office window. He looked down at his gloved hand and ran a finger over the stitching on the back.\n\"You said next time. When we were at the store.\"\n\"Yes,\" Hannibal agreed.\n\"What are you going to-- What would be next?\"\n\"Is there something you would like?\"\nWill couldn't think of anything he wanted more than to be somewhere else. Dark and quiet, like the place Hannibal had taken him for lunch. Soft music and the sound of water.\n“I don’t know. Lunch was nice.”\n“Is that a request?” Hannibal asked. He sounded amused.\nWill rubbed at the back of his neck, and his heart beat a little faster. “Yeah,” he said. “Take me out to dinner.”\n\"Very well,\" Hannibal said. \"I'll want something in return. Or rather, I'll want something first.\"\n\"What?\"\n\"Let me buy you a suit.\"\nWill closed his eyes. He could almost feel Hannibal's hands on him, light and very nearly impersonal. He already knew he wasn’t going to say no.\n\"You want me to wear it when we-- For dinner?\"\n\"Yes.\"\nHe paused and tried to come up with at least a token protest. It just wasn’t in him. Not today. “Okay,” he said. “I’ll probably be home tomorrow.”\n\"Very well. I'll make reservations. And an appointment with my tailor.”\nHannibal didn't ask when Will was free. He probably knew Will was always free, excepting evening crime scene visits.\n*\n\"You didn't have to pick me up,\" Will said, as he slid into the passenger seat of the Bentley. \"I could've met you there.\"\n\"It can be difficult to find if you're not familiar with the area.\"\nWill let it go. He was here, after all. Already in the car, leaning back into a seat more comfortable than any of his furniture. \"So where are we going tonight?\"\n\"Not tonight,\" Hannibal said. \"It will be some time before the suit is ready. I'll inquire when we get there, but I believe Friday is likely.\"\n\"So just the suit today?\"\n\"And lunch if you like.\"\n\"Yeah, okay. I mean… I mean thank you,\" he said quietly.\n\"There's no need for thanks.\"\n\"Seems like there is.\"\n\"You feel indebted?\" Hannibal asked.\n\"I feel like I should feel indebted. I don't know what you're getting out of this.\"\n\"You fail to understand my motivations. I imagine that's a relatively rare experience for you.\"\n\"Unique.\"\nHannibal looked pleased. Of course he'd take it as a compliment. \n\"You must have theories,\" Hannibal said.\n\"Not really. Nothing viable.\"\n\"I'd like to hear them all the same, if you don't mind.\"\nWill looked out the window and tapped his fingers against the side of the seat. \"Like a case,\" he said.\n\"That seems to be how you're treating it.\"\n\"That's usually how I treat people.\"\n\"That's how you treat strangers. It's a self-defense mechanism, one I don't believe anyone could blame you for. You're far more yielding with your friends.\"\nWill glanced over at him. Hannibal kept his eyes on the road.\n\"Are we friends?\" Will asked.\n\"I am yours, certainly. Whether you are mine is up to you.\"\n\"That's some pretty possessive phrasing, Dr. Lecter.\"\n\"Most human relationships are defined by possession. My friend, his patient, your lover. It's how we demarcate our sphere of influence.\"\n\"If you put it that way, how's your patient different from your table?\"\n\"My table has no influence of its own. It is the shifting gravity between people that shapes them and their world.\"\nWill leaned back in his seat. \"Okay. Here's what I think. It's not a power thing. You don't need to swing your dick around like that and if you did, you'd know better than to start with me. You've gone out of your way to put us on equal footing.\"\n\"I have done my best.\"\nWhich might mean he thought he'd failed. One way or the other. Interesting.\n\"It's not bribery. You've already got as much of my brain as anyone could possibly want.\"\n\"It's not bribery, no.\"\n\"If all you wanted was someone to dress up and look pretty, frankly you could've picked better material. So I don't know where that leaves us.\"\n\"How did you feel last time, when you looked in the mirror?\"\nWill remembered staring at his reflection, the lines of the coat and the rich color against his skin, and feeling like someone else. Surprised into admitting that it looked good on him. That he looked good.\nHe turned away to stare out the window at the blurred landscape. \"I think I said 'weird' at the time. I'll stick with that.\"\n\"Did you like it?\"\nWill rubbed a hand over his mouth. He swallowed twice, and his throat still felt dry when he spoke. \"Yeah. Yes. I liked it.\"\n\"Good,\" Hannibal said.\nHe fell silent to negotiate the highway exit, and Will was left with his stomach twisted up inside him, wanting to bite at his own knuckles as he could remember doing when he was very young and overwhelmed by the world.\nHannibal's tailor turned out to be a large, blonde woman in her mid-fifties. She had most of the top floor of a converted warehouse, a permanent frown of concentration, and an accent Will couldn't place. She and Hannibal spoke exclusively in French.\n\"Her assistant will take your measurements,\" Hannibal said, after a few minutes. \"If you'll step onto the platform?\"\nWill stood on the low, carpeted riser next to a gilt-framed mirror suspended from the ceiling. A young man in paint-spattered jeans took his inseam, waist, shoulders, and in fact more measurements than Will thought anyone could possibly find a use for unless the suit in question was meant to fit like a second skin.\n\"Is this really necessary?\" he asked.\n\"Suzanne will keep your information on file, should you need anything in future. Best to be thorough now.\"\nThe assistant measured his ankles. And his feet. Will looked down at the top of his head, blond hair gelled into spikes. \"It just seems a little excessive.\"\nHannibal looked amused. \"You need only endure it once.\" \n\"What were you saying before?\"\n\"How much did you understand?\"\n\"What makes you think I understood any of it?\"\n\"Your memory and your time in New Orleans. You must know some French.”\nWill shrugged. \"Something about shirts and ties, which didn't really surprise me. I didn't think you'd let me get out of here with just the suit. And a haircut? She's not a barber, is she?\"\nHannibal's eyes creased at the corners, and his mouth twitched minutely. \"She said you need a haircut. And also that you looked ready to escape through the nearest open window.\"\nWill sighed and pushed his hair back out of his face. \"She's not wrong. On either count.\"\nHannibal gave him a critical look. \"I like it longer. But perhaps we can do something about the style.\"\n\"I didn't mean-- That wasn't a suggestion.\"\n\"Not now. Next time. Jackson, if you're done there?\"\nThe paint-spattered assistant shot to his feet and nearly saluted. \"Yes, Dr. Lecter?\"\n\"Pull a selection of blue on white patterns for comparison. I think I'll handle the color choices this time.\"\n\"Nothing pink,\" Will said.\n\"You could really rock it,\" Jackson said. \"You've got great skin for it.\"\n\"Nothing pink. Or lavender. Nothing you'd find in an Easter basket.”\n\"As I said, I'll handle the color choices.\" Hannibal shooed Jackson away and led Will over to a low, velvet sofa with a hand on his elbow. \"He's right, in a way, that it would suit you, but these choices shouldn't be made based on aesthetics alone. Personality must be taken into account.\"\n\"I don't have a pastel personality.\"\n\"No, you certainly do not. Something a bit darker, I think.\"\n\"You take this stuff pretty seriously.\"\n\"To an extent. I enjoy it. We all play roles. The conscious adoption of costume and pageantry makes us more aware of those roles and thus of their superficiality.\"\n\"The veneer of civilization.\"\n\"Most of us live our lives one misstep away from savagery.\"\n\"All of us,\" Will said. \nHannibal conceded the point with a nod, and Jackson reappeared with a selection of shirts. He laid them out on the coffee table.\nThe shirts overlapped each other in a fan pattern, a quilt of dark blue prints on white. Tiny paisley swirls, stripes, thicker stripes, polka dots, little blue flowers. Will frowned at them and failed to picture himself wearing any of them.\n\"Can I get you gentlemen anything?\" Jackson asked. \"Bottled water? Mimosas?\"\n\"I'm fine,\" Will said.\n\"The Haka Estate silver needle for me, please,\" Hannibal said. \"And I think scotch for my friend.\"\nWill didn't argue. He was beginning to feel in dire need of a stiff drink. He leaned back into the sofa, away from the shirts, and turned to Hannibal. \"Can't you pick?\"\n\"You may not like my choices.\"\n\"No paisley.\"\n\"What about the floral print?\"\n\"It's not horrible? I've probably worn worse things.\"\n\"Not a wholehearted endorsement. Well, let's see.\" He leaned over the table to survey the patterns and then stood. Another rack of shirts stood against the wall, and he picked through them, one by one.\nWill thought about checking his email. He watched Hannibal's hands instead. He knew them well, watched them often when Hannibal was talking. They held the same calm, steady quality as the rest of his body. Surgeon's hands. Sometimes Will imagined them slicked with blood, leaving smears on everything he touched. Bloody fingerprints on ivory keys.\n\"Do you play that harpsichord in your office?\" he asked.\nHannibal looked at him over his shoulder. Surprised, going by the lack of expression on his face. \"At times. It needs to be restrung.\"\n\"But you can.\"\n\"I can, yes.\" \n\"Would you play for me some time?\"\nHannibal gave him a small smile. \"Of course, Will. Any time you wish.\" \nJackson appeared with a tray containing Will's scotch, a small, iron teapot, and a thin white cup. \"See anything you like?\" he said.\nWill reminded himself that none of this was Jackson's fault and managed not to say 'the door'. He drank his scotch instead, which turned out to be an excellent choice. He even mustered a smile after the first sip. \"I like this,\" he said. \"What is it?\"\n\"Ten year old Talisker single malt. Suzanne let me try it once. It was fucking awesome.\"\n\"Please, Jackson,\" Hannibal said without looking away from the shirts. \"I've spoken to you before about that sort of language.\"\n\"Sorry, Dr. Lecter. Want me to take anything back to the changing rooms?\"\n\"Yes, if you would.\" He handed over easily half a dozen shirts. No paisley and no pastels as far as Will could see. \"And do you still have those silk twill ties?\"\n\"Yes, sir. I'll bring them out.\"\nHannibal sank back into the plush velvet of the sofa and poured his tea, pale green-gold in the porcelain cup. \"You look as if you have questions,\" he said.\n\"I'm torn between wanting to know if this is how you always shop and wondering if you'll tell me off too if I call the scotch fucking awesome.\"\n\"Not always, but when I can, yes. And of course I wouldn't presume to correct your speech.\"\nWill nearly choked on his next sip, trying not to laugh. \"I think you'd presume to just about anything,\" he said.\nHannibal gave him a small smile over the rim of his teacup. \"Would I?\"\n\"On a scale of transgressive behavior, asking me not to swear is somewhere down here--\" He gestured around waist level. \"And buying me clothes is…probably higher than I can reach. Like ceiling level. And this is a high ceiling. Or are we pretending this is normal?\"\n\"Neither of us is very good at pretending to be normal.\"\n\"You're better at it than I am. Usually.\"\n\"When I must be, yes.\"\n\"You take your eccentricities and-- What did you say? Adopt their costume and pageantry. Dr. Lecter with his foreign accent and his plaid suits. You make yourself into something quaint. Something harmless.\"\n\"I am as harmless as you are.\"\n\"I think that was my point.\" Will looked down at his glass and found it empty.\nHannibal took it from him. \"I'll get you another. After you try some things on.\"\nWill let Hannibal escort him back behind a canvas curtain to a series of changing rooms, each with an armchair, a black and white photo of a semi-naked man, and a railing to hang the clothes from. Will's railing held a selection of shirts and a navy blue suit.\n\"Just to see how it looks with the shirts,\" Hannibal said. \"Yours will be ready for a fitting on Wednesday if you can come back then?\"\n\"As long as it's after work.\"\n\"Any time before seven. Now, pick something and show me the result.\" He turned and left Will among the forest of cotton and wool.\nThe scotch had done its work, and Will felt more relaxed than he would've thought possible, loose-limbed and warm and curiously free of the shadows that normally clung to him. He sorted through the shirts, discarded one on the grounds that it looked like graph paper, another for having a koi embroidered on the cuff, and pulled one to try on.\nIt was a slightly lighter shade than the suit, the steel blue of a becalmed ocean, with a sort of plaid pattern woven into the fabric, the same color as the shirt, barely visible. He buttoned all but the top button and then climbed into the suit as well.\nA knock on the door, Jackson's voice. \"You want your refill in there with you, Mr. Graham?\"\nWill opened the door. \"Yeah, I'll take it. Thanks.\"\nJackson handed him the scotch and looked him up and down. \"Wow. We don't usually get-- I mean, Dr. Lecter looks pretty good for a guy his age, but-- I should go see if Suzanne needs anything, sorry, bye.\"\nWill was still frowning after him when he heard another apology from Jackson and Hannibal came around the corner with three ties draped over his arm like a waiter with a towel.\n\"You seem to have made an impression,\" Hannibal said.\nThe drag of his gaze up and down Will's body was much, much slower. It turned Will's stomach inside out, and it was only respect for the scotch that kept him from knocking it back in one go.\n\"It's just a suit,\" he muttered.\nHannibal took his elbow to guide him over to an angled set of mirrors. Will tried to remember how many times Hannibal had touched him today, but the uncertainty and newness of the situation, his attendant nerves, and Hannibal's presence just behind him, impinging on every sense, were all against him. The suit jacket was a tighter fit than any of his, and he felt constrained in his movements, even in his thoughts.\nHannibal laid the three ties over his shoulder. \"Preferences?\"\nWill just shook his head. \"Whatever you want.\"\n\"You're surprisingly malleable today. Is it the scotch?\"\nWill shook his head, though it might be, at least a little. \"Just…out of my depth.\"\n\"You needn't worry. I'll keep you afloat.\"\nHannibal turned up his shirt collar and draped a dark gray tie around his neck. It had a nearly invisible geometric pattern of lighter gray squares and dark blue lines when viewed from six inches away, but it faded to a solid sheen when he looked at it in the mirror. Hannibal turned him and reached for either end of it.\n\"I can tie my own tie,\" Will said.\nHe reached up with one hand, the other still holding his glass and nowhere to put it down. Hannibal folded his own hand briefly over Will's, and Will froze.\n\"Can you tie a double windsor?\"\n\"Uh. Probably not.\"\n\"Then allow me. Please.\"\nWill let him. He watched the movement of Hannibal's hands on silk and nearly forgot what the aim was until the knot was pulled tight against his throat. He swallowed as Hannibal turned his collar down.\n\"Well?\" Will said.\n\"Look for yourself.\"\n\"I'd rather hear what you think,\" Will said, and oh fuck, that was the scotch. He glanced down and found his second glass half gone. He needed to go home. As soon as possible. In a taxi if necessary.\nHannibal smoothed his jacket down with a faint smile. \"You look elegant,\" he said. \"Perhaps a little dangerous. It suits you.\"\nWill let himself be turned toward the mirror, then, though it was a few seconds before he could raise his eyes from the floor. When he looked up, he could hear Hannibal's description in his head, and he had enough objectivity about his own appearance to see that it was true.\nHe took a deep breath. \"So, does this mean I don't have to try on the other ones?\"\nHannibal chuckled. \"Not if you don't want to. You like this one?\"\n\"I think… Yeah. I think I do.\" He risked another glance in the mirror. He looked like someone else, which wasn't a bad thing.\nThey stood outside on the sidewalk. Will had the rest of the scotch inside him and a bag in his hand that definitely contained more than one shirt.\n\"I should go home,\" he said.\n\"You don't want lunch?\"\n\"I think it would be a bad idea. Shouldn't have had the second drink. I probably shouldn't have had the first.\" He studied the sidewalk next to Hannibal's feet.\n\"Are you afraid I'll take advantage of you?\"\n\"Of course not.\"\n\"Do you want me to take advantage of you?\" There was no teasing in Hannibal's tone. It was a serious question.\nWill looked up at him, startled. Caught by the rising desire to say yes, which was exactly why he should leave. His defenses sagged low enough around Hannibal without the help of alcohol. \n\"Maybe,\" he said.\n\"In what way?\"\n\"I have no idea.\"\nHannibal studied him, rock solid and unperturbed. Nothing Will said ever shocked him. No matter how honest.\n\"Perhaps I can oblige. Come with me,\" he said.\nThey walked down the street together, breath steaming in the chill. Their shoulders brushed now and then. Will stuck his hands in his coat pockets so he wouldn't do anything stupid with them.\nA block away, Hannibal opened the door to a small antique store and gestured him inside. It could've fit into a large walk-in closet. Most of the space was taken up by a display counter. Velvet lined the shelves inside it, and nearly everything on them glittered under the halogen spotlights.\nThe old man behind the counter stood to shake Hannibal's hand. \"Dr. Lecter! Marvelous to see you. How's the ivory eye getting on?\"\n\"Very well, thank you, Philip.\" To Will, he added, \"You've seen it, I think. On the bookshelf in the study, an eighteenth century anatomical model.\"\nWill nodded. A cross-section in bronze, glass, and ivory, forever studying the room and its occupants. Hannibal and Philip chatted, an ear carved from bone was brought out for inspection, and finally Hannibal got to the apparent point of their visit.\n\"I recall a pair of cufflinks in ebony and diamond. Do you still have them?\"  \n\"Oh, yes. One needs a modicum of taste to appreciate that sort of subtlety, and it seems taste is in short supply these days. I took them off display for a while, one moment. I'll fetch them.\"\nHe disappeared into the back, which gave Will an opening. \"Those aren't for me, right?\"\n\"Of course they are.\"\n\"Diamonds? Actually, forget that. I don't own a shirt with French cuffs.\"\nHannibal nodded to his bag. \"You do now.\"\nWill glanced into the bag and saw nothing but a froth of black tissue paper. He rubbed at his forehead. \"Okay, but. Diamonds?\"\n\"You asked me to take advantage of you,\" Hannibal murmured. \"That's exactly what I'm doing. And you're going to let me, aren't you?\"\nWill couldn't tell if the heat in his face was the scotch, or the close air of the small shop, or the absurd blush he suspected. He looked down and swallowed hard, eyes fixed on the toe of Hannibal's shoe.\nThe silence stretched. Two clocks ticked, just out of sync, on a high, dusty shelf.\n\"Yeah,\" he said, a little hoarse. \"I'll let you.\"\n\"Good,\" Hannibal said.\nPhilip returned with a worn, velvet box. He opened it and set it on the counter. \"There we are. Ebony set in white gold with square cut diamonds. Signed by Mario Buccellati himself.\"\n\"The date?\"\n\"Nineteen twenties. I'm afraid I can't be more precise.\"\nHannibal looked the cufflinks over briefly before he handed the box to Will. \"Do you like them?\"\nWill stared down at the polished wood. It was better than facing Hannibal. Or the store owner. God knew what he was thinking right now. Will made himself breathe and consciously relaxed his shoulders. Philip was probably thinking he might make a sale and almost certainly didn't care about anything else.\nThe diamonds, tiny and square, sat just off center. Black wood grain shot through the dark brown ebony like tiger stripes. Will rubbed his thumb over the wood and found it warm.\n\"Yeah,\" he said softly, without looking up. \"I like them.\"\n\"Good,\" Hannibal said, and their fingers brushed when he took the box back. \"If you'll wrap these up, please?\" he added, to Philip. \"Put it on my account.\"\n\"Of course, Dr. Lecter.\"\nThe velvet box went into another box with the name of the store embossed on the top. Philip pulled out cream colored wrapping paper and dark brown ribbon.\n\"You don't have to do that,\" Will said. \"There's no point.\"\nHannibal rested a hand on his shoulder. \"Nonsense. A gift should be properly presented.\"\nWill fell silent, reminded of their peculiar bargain. The book and the coat. Dinner in exchange for letting Hannibal buy him the suit and whatever else lurked in his bag. This was outside the protection of even that flimsy pretext. Just because Hannibal wanted to, and because Will was currently making poor decisions.\nPhilip handed the bag to Hannibal when he was done, and Hannibal kept it, even when they were back out in the cold.\n\"Do you want me to--\" WIll reached for it half-heartedly. It seemed rude to make Hannibal carry it as well as pay for it.\n\"You may open it over lunch.\"\nWill curled his hands into fists inside his pockets. He could see it too clearly. White tablecloths and the clink of china mixing with quiet conversation. Hannibal sliding the box across the table for him to unwrap. He knew exactly how it would look. His cock stirred a little at the thought, and he dug his nails into his palms.\n\"Do you like that idea?” Hannibal asked quietly. “Do you feel I have taken sufficient advantage of your condition?\"\nWill couldn't look at him, could only nod. Yes. God, yes.\n*\nHannibal dropped him off in Wolf Trap late that afternoon. Will hung up his coat and unpacked the shopping bag. Three shirts lay folded neatly inside: the one he'd tried on, the one Hannibal had told him about, white with French cuffs, and one with widely spaced pale gray stripes and white collar and cuffs. Will didn't open the tie box. He didn't feel mentally prepared.\nWanda stuck her head up to sniff at one sleeve, but all the dogs knew better than to get up on the bed without his permission. He left them there and went to make coffee. When it was ready, he pulled the coat back on and drank it standing on the back porch while the dogs chased each other and their shadows through the long grass. He envied them, but that wasn't unusual.\nCoffee going cold on the porch railing, he threw sticks and balls and played tug-of-war with bits of old rope until Lizzie flopped down in the grass at his feet and panted at him. Even the younger ones came to lean against his legs and lick his hands instead of bounding after the next stick.\nThey had their dinner. Will sat down to look at his flies, but he refocused on the bed again and again. On the little box, now unwrapped, sitting atop the white shirt.\nHannibal had taken it from its bag just before dessert and nudged it across the table toward him. Will, considerably more sober by that point, had tried to protest. His tongue had felt thick in his mouth, almost frantic with the need to put things right.\n\n\"You don't-- You can take them back, you haven't even paid him yet. It's crazy, and you already-- The suit. And everything.\"\n\n\n\"Do you want them?\"\n\n\n\"What would I do with-- With something like that?\"\n\n\n\"Perhaps that was the was wrong question. Do you want me to give them to you?\" \n\nThat had been the right question. After a long moment of staring at the light glinting off his fork and trying to pretend he wasn’t going to give in, he’d peeled off the wrapping paper with embarrassment so deep it somehow spilled over into pleasure. The thrill of doing something he knew to be wrong.\nIt was the same excitement, low in his belly, that moved him now. He yanked off his shirt and undershirt and tossed them both on the top of the dresser. The fine white cotton slid like a cool breath over his skin as he pulled it on. He let the cuffs dangle for a few seconds, engulfing his hands, and then folded them back.\nThe cufflinks took some effort. He'd never worn them before, and he felt clumsy working them through the four holes on each sleeve. Inadequate. Maybe unworthy, except that Hannibal clearly hadn't thought so.\nWill bit his lip and laughed at himself. \"So stupid,\" he whispered. But harmless. He'd probably be better off with more stupid, harmless things in his life.  \nWill left the shirt unbuttoned. He cooked dinner in jeans and bare feet, tempting fate by making a quick tomato sauce for his pasta. The shirt survived unscathed, though Wanda got a blob of tomato on her ear. Homer licked it off for her.\nAfterward, with everything cleaned up and the leftovers in the fridge and the house sliding from evening into the stillness of night, he put the other two shirts away in his closet and looked at the ties. The box contained the one he'd tried on, another in a roughly textured gray silk, and one thin and black with a single vertical dark blue line down the center. It also contained printed instructions on how to tie a double windsor knot.\nWill rolled his eyes and grabbed his phone to text Hannibal. i was standing right there when you tied it, have a little faith\n\nMost people wouldn't be able to remember after seeing it once. Especially given the circumstances.\n\n\nmeaning the scotch or your hands all over me?\n\nHe looked at the words for a few seconds and then hit send. If Hannibal were going to trample all over the boundaries between them, he could put up with knowing what it did to Will.\n\nEither one might be enough to expunge certain things from the mind.\n\n\nnot from mine. you know what my memory’s like \n\n\nAnd what is your strongest memory of today?\n\n\nthe restaurant. opening the box there.\n\n\nIn public.\n\n\nyes\n\n\nMaking a display of yourself.\n\nWill shuddered. He closed his eyes briefly and palmed his cock through his jeans.\n\nit wasn't me making the display\n\n\nBeing displayed, then.\n\n\nyes\n\nNo, he was not going to jack off while texting his psychiatrist. Even if they now had the least professional relationship of all time. Even if some part of Will's brain found that stupidly hot.\nHe typed to keep his hands busy.\n\ntransgressive behavior\n\n\nWe are often drawn to that which we have been taught to revile. There is a great deal of power in stepping over those boundaries.\n\n\nwhere are your boundaries?\n\n\nMost were crossed long ago.\n\nWill stood and paced to the window and back, hand tight around his phone. Palm damp. He pressed his other hand to the front of his jeans, but there wasn't much he could do to relieve the ache without unzipping, and if he did that, it'd be a lost cause. He sat on the edge of the bed again.\n\ntell me\n\n\nAsk me during our appointment on Thursday, and perhaps I will. I don't think this is the ideal medium for such confessions. Good night, Will. \n\n\ngood night, dr lecter\n\nHe stripped off his jeans and boxers and lay back on the bed. The diamonds caught the light as he stroked himself. Lube this time instead of spit. He was careful not to get it on the shirt.\nOne foot on the floor, one drawn up on the edge of the bed. Legs spread wide, thumb teasing the head of his cock. His breath came faster. Heart rate and blood pressure up. Either the wind or his own blood buzzing in his ears as his hand moved faster.\nHe wondered if Hannibal knew. If this was about sex at all for him. He'd given no sign of it, not that Will could see. He imagined sitting across from Hannibal tomorrow in his office and describing this moment: spread out on his bed, every pretense of modesty abandoned, naked except for what Hannibal had given him.\nHannibal had said next time. Will let himself imagine more clothes, being dressed head to toe in things he hadn't bought for himself and never would. The shirt, the suit. Italian shoes. Even underwear.\nHannibal shoving him up against the wall of his office and peeling him out of it, because he could, because he owned every stitch on Will's body. Maybe he wouldn't even touch him. Just leave him standing there, hard and wanting. Tell him that if he wanted the clothes back, he'd have to earn them.\nIt was a short step from there to his mouth on Hannibal's cock. He shoved three fingers between his lips and sucked, felt the cufflink bouncing against his other wrist as he stroked himself, and he cursed out loud as he came.  \nWill returned for his fitting near dusk. Cool shadows striped the pavement on his walk from the car to the converted warehouse. He'd meant to come earlier, but he'd had a stack of student papers to get through and three classes to teach, plus a guest lecture on a case he'd worked back in New Orleans. The memory of it clung to him like wet cobwebs.\nThe warmth and light of Suzanne's studio eased him closer to the present. Jackson was waiting with a smile and a cup of coffee like a peculiarly leggy and angular housewife in a 1950s sitcom.\n\"Hi, Mr. Graham! Suzanne will be out in just a sec.\"\n\"Thanks,\" he said, raising the coffee mug as if in a toast. He wandered over to the couch and sank down with the mug cradled in both hands. \nJackson hovered nearby, hands stuck in his pockets. He watched Will through fine, blond lashes. \"Is there anything else I can get you?\" he asked.\n\"No,\" he said slowly. \"I'm fine.\"\n\"Are you sure? I mean, like, anything at all. I'd be happy to help you out.\"\nWill stared at him for a few seconds, and then Suzanne sailed out of the back room. She handed over the suit, and, when he came out of the changing room, she started marking it up immediately, muttering to herself, pincushion strapped to her wrist.\nClose up, she smelled distantly of cigarettes, and it relaxed him, despite the sharp pins and the equally sharp questions about fit and range of motion. His father and every one of his father's friends had smoked. He found the scent itself unpleasant, but it still lent him a sense of remembered security.\nShe smacked the side of his knee to get his attention. \"Dr. Lecter said anything you want is to go on his account, so you must only say if you wish anything else.\"\nHe nodded and didn't look at Jackson.\n\"There.\" She took the jacket off of him and waved a hand toward the changing room. \"It will be ready on Friday. I'll have it delivered. And you will please tell Dr. Lecter that it could've been better with a month's notice. Even two weeks. I'm a tailor, not a magician.\"\n\"She hates rush jobs,\" Jackson said, when she'd stomped off. \"You should've heard her lay into this guy last week, and he wanted the same time frame. She only did yours because it was Dr. Lecter asking.\"\n\"He does tend to get what he wants.\"\n\"Yeah, I noticed.” He paused. “So, uh. She'll probably send me with the suit on Friday. What time do you get home?\"\nWill could read intention in every line of his body, the cant of his hips, the minimal distance between them. The shiny, pink slick of his lower lip where he'd been biting it. The worst part was that he was tempted.\nIt had been years, and Jackson looked good. The sex would probably be decent, and he couldn't imagine Jackson wanting anything to do with him afterward. Whatever charm he saw would evaporate in the reality of Will's meager life and dog-hair-coated furniture. No complications. \nOn the other hand, Jackson was even younger than his students and seemed like a nice kid. And anyone Will could think of as a nice kid wasn't someone he should be fucking.\n\"You'd better leave it on the porch,\" he said. Jackson's face fell. He looked absurdly young, and Will was grateful he'd resisted. \"You can bring it by anytime during the day.\"\n\"But Dr. Lecter said-- Well, he didn't say, but--\"\nWill raised his eyebrows. \"What exactly did Dr. Lecter say?\"\n\"Fuck. I just might've asked if you two were, like, together, and he just said no, but it was the way he said it.\"\nWill wanted to ask how he’d said it, but he could imagine. \n*\n\"Please, come in.\"\nWill peeled off his coat and fell into a chair. “You can’t give me people,” he said. \n“I presume you mean Jackson.” \n“I do.” \nHannibal smoothed down his pants as he sat down. “I didn’t tie him to your bed, Will. I merely answered a question.” \n“You knew why he wanted to know.” \n“It was painfully obvious, yes.” \n“And you phrased your answer to encourage him.” \n“I didn’t phrase it to discourage him.” \n“Why the hell not?” \n“It was not my place. Be honest. Wouldn’t you be just as displeased if I’d warned him off?”\nNo. Because apparently, at some level, he felt it was Hannibal’s place to stop pretty undergrads from hitting on him. He leaned forward and rubbed his hands over his face. \nThey sat in silence for a minute. \n\"You were going to tell me about boundaries,\" Will said.\n\"You were going to ask me.\"\n\"I'm asking. What boundaries have you crossed?\"\n\"One crosses many in medical school, some the same that are crossed in law enforcement. The handling and observation of dead bodies, for example, and a more intimate knowledge and experience of bodily fluids than is typical for the average person.\"\n\"Most people don’t find any particular power in bodily fluids. Especially not when they hit you in the face.”\n\"Tell me, when was the first time you masturbated?\"\nWill blinked at him once. \"Ten or eleven. If you've got a point, you'd better get there fast.”\n\"It's the first secret many children, boys in particular, have from their parents. The first they feel must never be spoken of. A shift in perception and a step toward independence. In a way, I would say that the knowledge acquired in medical school is similar. It's not easily spoken of, and so it sets one apart, even as it forces a certain amount of self-examination and often unwanted maturity.\"\nWill nodded slowly. \"It's the same, joining the police.You find out all kinds of stuff you can't exactly talk about over dinner. People don't want to know.\"\n\"Precisely. So, there are boundaries of knowledge, lines which, once crossed, lead one unexpectedly into foreign lands. And then there are the lines which we step across deliberately. Boundaries of action.” \n\"Like buying your patient obscenely expensive clothes?\"\n\"I find it interesting that you are only my patient when you wish to chastise me.\"\n\"Fine. Like buying your friend obscenely expensive clothes.\"\n\"Yes. Like the deliberate choice to indulge a harmless, if peculiar, whim.\"\n\"And what other whims have you indulged?\"\nHannibal laced his fingers together and rested them on his knee. \"I could offer you a laundry list of sexual experimentation, but that would be a bit tedious, wouldn't it?\"\nWill gave Hannibal his own bland, unshockable expression and leaned forward in imitation of his I'm listening posture. \"It's your time, Hannibal. We'll talk about whatever you want to talk about.\"\n\"Very good. I wish to talk about butchery. Did you hunt when you were younger?\"\n\"Small stuff, when I was a kid. Whatever I could find for dinner.\"\n\"Why did you stop?\"\n\"I was better at fishing.\"\nHannibal nodded, a single dip of his chin that slid the light of his desk lamp up his face to catch his eyes. \"The fisherman understands desire. He arranges the world so that his prey comes to him of its own accord. The hunter understands actions. Which way the prey will run, where it seeks shelter, where it finds sustenance. Jack's understanding is that of a hunter. This why he values you so.\"\n\"Did you hunt, Hannibal?\"\n\"Before I came to this country, yes. My father taught me to shoot when I was very young, and his recurve bow was one of the few things I salvaged from the fire.\"\nWill sat and waited. He didn’t ask about the fire. Later.\nHannibal rewarded him with a slight smile. “Like you, I hunted for food, but I set my aim somewhat higher than birds and squirrels. My father's bow had a thirty-five pound draw weight. Not a great deal of power with which to take down deer, and yet still at the very edge of what I could manage at that age.\"\n\"You practiced.\"\n\"Constantly. And yet, in the end, it was little more than luck that allowed me to take the shot. I waited by a stream, in a tree, but I did not have sufficient stillness of mind to remain as quiet as I needed to be. The stag would never have approached had I not fallen asleep.\"\nWill could see the child Hannibal must have been, dirty and determined and already used to being alone. He would have slept with his fingers on the bowstring.\n\"And when you woke?\"\n\"I merely had to pull back and release. He was close, not more than ten yards. Killing takes little skill. The mastery is in what comes before. And after.\"\n\"Butchering the carcass.\"\n\"Yes. It was possible, though not easy, to tie a rope to the hind legs and suspend it from a tree branch, to slit the abdomen and let the viscera fall. Beyond that, I had little knowledge of anatomy, no skill, and a dull knife. You can imagine the result.\"\nHe could. Blood and frustration, hunger, heartache at the waste. The flies settling in to feed.\n\"Did you cry?\" he asked.\nHannibal's left hand twitched briefly closed and then relaxed again. Nothing showed on his face.\n“You would make a dreadful therapist, Will. You see too much and you are far too direct about it. I did, yes. And then I screamed. It was the first voluntary noise I had made since my family was killed. And then, I'm afraid, I painted myself with the creature's blood.\" He shrugged. \"I was thirteen. My sense of drama had yet to be refined.\"\nThe scene had an odd beauty in Will's mind. The tangled forest, dark from the thick canopy above. The moving water of the stream. The ruined life of the deer and the ruined life of the boy. Blood and tears and rage. The reduction of life to its essentials.\n\"And afterward?\"\n\"Practicalities. I washed and made a fire and cooked enough to eat myself sick. I slept by it all night, despite the flies. Now, tell me. Which is the more transgressive behavior: my younger self's fury and resultant naked bloodlust, or my desire to tell you about it?\"\nWill didn't know, but he thought he might be falling in love, just a little.\n\"If I could draw, I'd draw you that day,\" he said. \"That night. With blood under your nails while you slept next to the maggots.\"  \nHannibal looked at him for a moment, head tipped slightly to the left, and then he rose. \"Come,\" he said.\nWill followed him to his desk, where he produced a pad of drawing paper and a tin box. From the box, he took a black charcoal pencil. He sat and pulled the paper to him. \"Tell me what you see,\" he said.\nWill traced figures on the paper with his forefinger. \"The tree here, arching over the water. You curled here, the remains of your campfire. The deer strung up overhead.\"\nHe watched as Hannibal moved charcoal over paper. His vision took on weight and form with each rough, jagged line. Hannibal made the blood drip and the water move and the maggots crawl. Will watched, transfixed, as he gilded the scene with moonlight, rubbing highlights into his own sleeping face, the wet rocks, the dead deer's eyes.\nHannibal worked as fast as Will could talk, and it was done in minutes. Will brushed his fingers over the surface, and they came away dark. \"One misstep away from savagery,\" he said.\n\"Always.\"\n\"I want this.\"\n\"You may have it.\" Hannibal took out his pocket square and wiped the pads of Will's fingers clean. He didn't release Will's wrist when he was done. \"It will need a coat of fixative. I'll bring it with me tomorrow.\"\nWill's suit was waiting for him on the porch when he got home from work on Friday. He brought it inside and hung it up on the back of the bathroom door while he showered.\nThe pants fit almost too well. They skimmed close over his skin, and he couldn't forget them for a moment. His hair, still damp, dripped down the back of his neck as he looked at the shirts. At the diamonds glinting in the cuffs of the white shirt. He'd never taken them out.\nThe thought of wearing them tonight made him hunch his shoulders and curl his toes against the floorboards. It would feel like an admission. Worse, it might be an admission he wanted to make. He pulled the shirt on and did up the buttons with nerveless fingers.\nWhen he put on the jacket, the shirt sleeves extended just far enough for the diamonds to catch the blood light of the setting sun. He stood in front of the full-length mirror. Faithful as ever, it showed him what had to be his reflection, though he barely recognized it.\nElegant and dangerous, Hannibal had said. Maybe less dangerous with the white shirt than the dark, but no less elegant. He looped the gray silk tie around his neck and secured it. Even watching his own hands move, he had difficulty believing he was looking at himself.\nA soft knock sounded on the door, and Will almost jumped. He went to answer it.\n\"I beg your pardon,\" Hannibal said. \"I'm a bit early.\"\n\"No, it's fine, come in. I was just-- Not doing anything useful.\" He ran his hands through his hair. Still damp, but not actually dripping. \"Do you want coffee? Or do you just want to go?\"\n\"In a moment. I brought you this.\"\nThis was the drawing he'd done yesterday, now matted, in a thick black frame. Will took it and ran his fingers over the glass as he had over the charcoal. He could see the shadow of a smudge on the paper where he'd touched it.\n\"Thank you,\" he said. He looked up and met Hannibal's eyes for a second. \"This is--\" He shook his head, helpless to express what it meant to him, the blending of shared memory and vision. \"Just. Thanks.\"\nHannibal nodded in return, strangely silent.\nWill set it on the mantelpiece and took a breath. \"I still don't know where we're going. Am I overdressed?\"\nIt came out sounding like an invitation for Hannibal to look him over, and he did exactly that. He walked around Will in a slow circle. The weight of his regard was even more tangible than usual. Will fought not to close his eyes. Hannibal stopped behind him and leaned in to speak in his ear, one hand curled around his upper arm.\n\"You look exquisite,\" he said simply. \"And you have my gratitude for giving up on that unfortunate aftershave.\"\n\"Well, I thought if you could smell my lunch…\" Will shrugged. He'd never liked it that much, and he'd dumped it in the trash after that conversation.\n\"Much better without.\" Will could feel the long inhale, inches from the curve of his neck. \"Perhaps I can find something more suitable for you.\"\n\"Did you get me anything tonight?\" Apparently Hannibal's breath on his skin was worse than alcohol for his self-control.\n\"Apart from the labor of my own hands?\" Hannibal said, amused. \"You're getting greedy, Will.\"\n\"You like it.\"\n\"Very much. But you'll have to wait and see. I wouldn't want to spoil the surprise.\"\nWill twisted around to face him. \"Did you really? I didn't mean, I wasn't expecting--\"\n“Come now. You were doing so well,\" Hannibal said. \"Ask me again.\"\nHannibal still had one hand on Will's arm. Will's shoulder pressed into his chest. Will focused on his mouth and then on the bridge of his nose, which should have been safer, but wasn’t.\n\"Did-- did you bring me anything?\" he said.\n\"Would I come empty handed?\" Hannibal said softly. \"Wait until after dinner.\"\nWill swallowed, too warm and too aware of strong fingers pressing into his skin. He hadn't been sure what he'd do if Hannibal actually wanted sex out of this. Fantasies only worked when they stayed fantasies, but right now, he was pretty sure he'd give Hannibal anything he wanted.\n*\nWhen they arrived, Hannibal held the door to the restaurant for him. Will knew he should say something, even opened his mouth to protest, but he couldn't find the words. He remained silent and let Hannibal escort him to their table near the window with a hand at the small of his back.\nWhite light glowed through the water of the small fountain outside, and lit the bone-pale branches of sycamore trees that reached toward the black sky. The dim interior of the restaurant merged with muffled voices and quiet music to create the illusion of separation between their small table and the rest of the world.\nHannibal ordered for both of them. Will had no idea what he’d said. He'd been occupied trying to adjust his cufflinks so that they didn't smack against the table every time he reached for his water glass.\n\"How do you wear stuff like this every day?\" \n\"You wear a variation on the same theme when you teach.\"\n\"It's not the same. It's--\" He stopped and shook his head. It wasn’t that different. He knew that. But every movement conspired to remind him of what he was wearing. \n\"What is it?\"\n\"It's crazy. I can't stop thinking about--\" He stopped himself again and took a deliberate sip of water. He rested the ice cold glass against his forehead for a second.\n\"The money. Do you want to know how much it cost?\"\n\"No. Yes. I don't know how guilty I need to feel about this without seeing a price tag. It's probably better if you don't tell me.\"\nHannibal watched him, hands folded on the table, eyes half closed. \"Is guilt truly the sensation aroused by my gifts?\"\nIt was possible that Will made some small involuntary movement at the word aroused. \"Something like that,\" he muttered.\n\"I'm afraid the exact figure would shock you. But, including the cufflinks, something over ten thousand.\"\nWill stared at him. It took a few seconds to remember to breathe. “You didn't think the ballpark would be shocking?\"\nThe waiter arrived with wine and a whole roasted artichoke. Will had to wait for Hannibal to pull a leaf out and dip it in melted butter before he understood how to attack it. He shifted in his seat and pulled at his collar.\n\"You look a bit pale,\" Hannibal said.\n\"It's too much,\" he managed, finally. It felt dishonest to say it when he had no intention of making Hannibal stop, but he didn't know what else to say.\n\"Past a certain point, a surplus of anything becomes almost meaningless. It costs me far less to do these things for you than it costs you to lend your surplus of imagination to Jack Crawford.\"\n\"That's different. It's important.\"\n\"Perhaps this is important to me.\"\n\"Is it?\"\n\"What do you think?\"\n\"I think it's entertaining for you. I think you find the world too easy, and I'm not easy. I think you were bored.\"\n\"I'm not bored now.\"\nWill dipped another artichoke leaf in butter and scraped the minute amount of soft flesh away with his teeth. Hannibal did the same. The leaves piled up in a copper bowl provided for their discards.\n\"It's not my only motivation,\" Hannibal said.\n\"I'm not offended. I'm…glad I don't bore you, I guess. But where does this end?\"\n\"Why should it end?\"\n\"Everything ends.\"\n\"Where does your involvement with the BAU end?\"\nWill looked down at the steadily growing pile of ravaged artichoke leaves. \"Probably with me dead,\" he said. \"It's not like I don't know that. Dead might be the best-case scenario, actually.\"\n\"What if I said I'd stop when you stop?\"\n\"Then I'd have to admit that's not the best incentive I've ever heard.\"\nThe main course arrived. Osso buco and saffron risotto for Will, and duck with black truffles for Hannibal. Will had learned the art of silent appreciation at Hannibal's table, but his silence now had nothing to do with the food. It was more shock at himself, at the admission that he really didn't want Hannibal to stop.\n\"Have you thought about why it's important to you?\" Hannibal asked. \"Saving lives.\"\n\"It's a reason to keep going. Isn't that what everyone looks for?\"\n\"Meaning and order in a world shaped from chaos and entropy.\"\n\"You have to find something to hold on to,\" Will said.\n\"Only if your vision is clear enough to see the flood. Most people live the entirety of their lives free of such considerations.\"\nWill pushed risotto around his plate. He looked up at Hannibal. “What are we doing here?” he asked. “Are you still just indulging your whims, or is this something more?” \n\"You're asking me to delineate the boundaries of our relationship. It's what you've wanted from the beginning. I can't,\" Hannibal said. \"I don't know what we are or what we might become. I can only say that I have never met anyone like you, and that I hope to know you, in whatever capacity you deem acceptable, for the rest of my life. Will that do?\"\nWill nodded slowly, more overwhelmed by that than by the money or the clothes or, maybe, any single previous event in the whole of his life. \"That's-- Yeah,\" he said, voice rough. He took a quick drink of wine. \"I couldn't really ask for anything else.\"\nHannibal smiled. \"And yet I hope you will.\"\n\"You make it sound like I should be looking at engagement rings,\" Will said.  \nHannibal looked down to assemble his next bite. \"You shouldn't joke about such things. You might be surprised at how quickly I would take the opportunity to gain some legal claim on you.\"\n\"I wouldn't,\" Will said. \"I wouldn't be surprised at all.\"  \nThe thought of tying Hannibal to him in some more permanent fashion than the transient bonds of friendship made his heart pound. He set his fork down and clutched his water glass instead, almost dizzy with the idea.\n\"Eat,\" Hannibal said quietly. \"You forget too often.\"\n\"I'm fine,\" Will said automatically, but he did take another bite. \"It's good. Thank you for this. I wasn't thinking when I asked you to take me out. Not exactly polite.” \n\"I'm happy to do it. I assume you won't try to argue with me about the bill?\"\nWill smiled a little and shook his head. \"No. Promise. I'll let you take care of it.\"\nWhen the waiter had cleared their plates away, Hannibal produced a small box from somewhere and slid it across the table.\n\"I wasn't sure you were serious before,\" Will said. He touched the smooth, black ribbon.\n\"Very serious.\"\nThe waiter came by to refill their water glasses and gave them both a benevolent smile that made Will want to hide under the table. When he took off the lid, though, he forgot about everyone else in the restaurant.\nThe interior was divided, as it might be for a box of chocolates, but each section held something different, and none of it was edible. Chips of bone, bits of fur, something small and shiny. A few strands of long, dark hair coiled tight, maybe from a horse’s mane. Will had found similar tufts caught on the fences near his house. \n\"For your flies,\" Hannibal said. \"Materials.\"\nWill looked up at his tone. Uncertain. Maybe for the first time since Will had met him.\n\"Did you find these yourself?\" he asked.\n\"Yes. Some near your house, when I was looking after your dogs. Others elsewhere.\"\nWill pictured him in his suit, picking his way through the fields, surrounded by dogs and on the look out for these bits and pieces. The same things Will looked for when he walked. He reached for Hannibal's hand and gripped it tight, without thought. The connection, for once, felt natural.  \nHannibal's thumb skimmed across the back of his hand. \"Shall we go?\" he asked. \"Or did you want dessert?\"\n\"I can live without dessert. Let's get out of here.\"\nThe bill was paid. Will let Hannibal help him on with his coat, which should've felt ridiculous and instead felt only strangely intimate. He liked the way Hannibal's touch lingered on his shoulders.\n\"This isn't really meant to go over a suit, you know,\" Hannibal said.\nWill shrugged. \"It was this or the moth holes.\"\n\"I'll get you something more appropriate for formal occasions.\"\nWith anyone else, Will would've made certain assumptions about skipping dessert and heading home. With Hannibal, it didn't seem safe to assume anything.\n\"Do you want to come in?\" he asked, when they pulled up at his house. \"I could make coffee.\"\n\"Thank you. I'd like that.\"\nWill greeted the dogs and let them outside. He and Hannibal stood together in the kitchen under the fluorescent lights while Will dumped grounds into the coffeemaker. Hannibal leaned against the counter and watched him, as he always did. Will hadn't noticed consciously before just how much time Hannibal spent watching him.\nThe coffee dripped. Will crossed to where Hannibal stood and put his hands on the counter on either side of him. Hannibal's fingers curled over his forearms.\n\"Is it okay if I kiss you?\" Will asked.\nHannibal looked at him for a long moment, expressionless. Eventually, he nodded. \nIt started slow and stayed that way. The first few seconds were just the press of their lips together, and it didn't feel that much different from any other touch. From Hannibal's hands on him. Except that this involved a lot more of his hands on Hannibal, and he liked that even better.\nOne at his waist, the other to cup the side of his face and angle his head so they fit together perfectly. And it did feel perfect, as if Hannibal's mouth had been specifically designed for his. His lips were smooth and tasted faintly of mint.\nWill licked across the bottom one and took it between his to suck, light and teasing. Hannibal's grip on his arms tightened, and Will leaned closer, hemming him in against the counter. He slid one hand around to his back, and Hannibal's mouth opened against his.\nThe heat and the slide of Hannibal's tongue made his knees feel unsteady. Hannibal's fingers fisted the fabric of his suit, twisting, pulling him closer. Will slid a hand up and tugged at Hannibal's hair just because he could.\nIt felt like hours before they parted even enough to take a separate breath. Will looked at Hannibal's mouth and wanted to do it all over again. Hannibal was blinking slowly at him, lips wet and parted like an invitation. \n\"Coffee's ready,\" Will said, mostly into Hannibal's mouth.\n\"There are few worse ways to make coffee than with one of those machines,\" Hannibal murmured. He didn't sound like he was even listening to what he was saying. \"You should get a French press at least.\"\n\"Buy me one,\" Will said, and tugged at him until he came away from the counter and followed him step by step to the couch. Will pressed down on his shoulders, and Hannibal sank into the worn cushions. He reached up, and Will bent to kiss him once more. \"I have to let the dogs in. One minute, okay?\"\nHannibal's nails dug briefly into the back of his neck. \"If you must.\"\n\"Less than one minute.\"\nWill opened the door and was briefly overwhelmed by a tide of furry affection. He glanced back at the couch to find Hannibal watching him once again. It was funny, he thought, that he'd assumed Jackson wouldn't be able to handle his pared down life, but it had never occurred to him to think the same of Hannibal.\nWhen the dogs had settled in their beds or on the floor or, with their usual optimism, in the kitchen, Will returned to stand by the couch. His leg pressed against Hannibal's knee, and he looked down at Hannibal's hands folded in his lap.\n\"Are we picking up where we left off, or did the dogs kill the mood?\"\nHannibal touched the outside of his thigh and then curled a hand around his elbow and tugged gently. Will let himself down onto one knee on the couch, hands braced on the back, balanced over Hannibal as he bent low enough to kiss him.\nHannibal's hands settled at his waist, under the suit jacket. Will felt their precise outlines, hot and steady pressure through the thick cotton of his shirt. He kissed Hannibal harder, deeper, tugged at his hair a little to get him to tip his head back, and was rewarded by the slight clench of fingers against his sides.\nWill shifted until he could get his other knee on the couch and straddle Hannibal's thighs. He sucked in a breath at the feeling of all that hard muscle.\n“God, you must be gorgeous naked,\" he said. Hannibal stayed silent beneath him, and Will kissed the corner of his mouth. \"I'm not suggesting anything for tonight. This is fine. This is great.\"\n\"It's perfectly all right. There's really no reason to be this…careful.\"\nWill leaned back and took in the tiny frown Hannibal wore, the way his hand hovered over Will’s hip for half a second before he touched.\n\"You kind of look like I should be careful with you. Sorry.\"\nHannibal cupped his hand around the side of Will's neck and slid his thumb over his lower lip. \"You unsettle me from time to time,\" he said.\n\"You're definitely not alone in that.”\n“Do they worry that you will see them too clearly?” \n“Is that what you’re worried about?” \n“Perhaps I worry you won’t see me clearly enough.”\n“I’ll keep trying till I get it right.” \nHannibal leaned up to meet him this time, eyes already closed. Will had a second to burn that into his mind, the curve of lashes across his skin, movement of his throat as he swallowed, his seeking mouth. Will bit gently at his lower lip and sucked, took his face in both hands and dipped his head slightly to kiss his cheek and feel the scrape of stubble across his lips. He wanted to ask how often he had to shave, wanted to ask a million things.  \nInstead, he pressed his lips under Hannibal's jaw and licked there and sucked until Hannibal grabbed at the back of his shirt and said his name.\n\"I won't leave a mark,\" Will said. \"Promise. I'm being careful, remember?\"\nHannibal only clutched him tighter. Will kissed back up to his mouth, to his lower lip, a little swollen now. He scraped his teeth across it, and one of Hannibal's hands dropped to the base of his spine and then lower, just above the curve of his ass. Will grinned.\nHe tugged at Hannibal's suit jacket. \"You want to take this off?\"\n\"You as well, then.\"\n\"Sure.\"\nWill stood to take his off and to leave Hannibal enough room to get out of his own. He liked the way Hannibal's hands lingered at his waist until he stepped away.\nSeeing Hannibal in just his waistcoat made him remember the few times he'd gotten to watch him cook, made him smile with an odd fondness for this odd man who watched him like Will might disappear if he blinked.\nWill sat next to him this time and let Hannibal reach for him before he did anything himself. Hands on his back and side, Hannibal pulling him in and licking over the hollow of his throat. Will slid an arm around Hannibal's back to keep them close while he pressed him down against the arm of the couch.\n\"You're going to have dog hair all over you,\" he said, to see Hannibal's faintly pained expression.\n\"It wouldn't be an issue if you didn't let them on the furniture,\" Hannibal said, but the words came out slowly between the progress of his mouth up Will's neck. He folded one leg up onto the couch and let Will settle into the angle of his thighs.\nWill ran his hand over the muscle there and up to his hip and was hit again with the knowledge of how much better this would be with fewer clothes. Later. Maybe. Hopefully, but he still didn't want to count on anything.\nFor now, he snuck one hand up under Hannibal's waistcoat, felt the shift of muscle along his spine and the heat trapped between two layers of cloth. He stretched out over Hannibal and felt his other leg come up so that Will was caught and pressed close between them. It made it hard not to rock his hips down, and his dick was starting to ache. He concentrated on the slide of Hannibal's lips on his skin. If anything, that made it worse.\n\"Hannibal,\" he said, and meant to follow it up with we should stop or something…well, something more realistic, since he couldn't imagine stopping altogether. As it was, Hannibal kissed him and slid his tongue against Will's teeth, and finishing the sentence was impossible.\nHe shifted closer instead, let Hannibal take more of his weight, and was rewarded with both hands on his ass, keeping him right there. He smiled against Hannibal's mouth and then had to pull away to laugh a little at the annoyed sound he made.\n\"Sorry,\" he said.\nHannibal slid his thumb over Will's lips again and kissed him around it. \"You're not remotely sorry.\"\n\"What did Aquinas say? Put yourself in the attitude of contrition?\"\n\"He was talking about prayer, as I think you know very well, and I have seldom seen anyone look less contrite than you do right now.\"\n\"Yeah? How do I look?\"\n\"Unbearably pleased with yourself.\"\nWill bent down to hide his smile against Hannibal's neck. \"I feel pretty pleased with myself. I like messing you up.\"\nHannibal wove his fingers through Will's hair and ran them upward until Will knew it would be sticking up at odd angles. Will bit gently at his ear. Hannibal stretched one curl away from his head.\n\"You do need a haircut,\" he said.\nWill dropped his head to Hannibal's shoulder and laughed. \"Not what I was hoping you were focused on right now, but okay.\"\nHannibal shifted until Will could feel the hard line of his cock pressed against his stomach. \"It's not the only thing I'm focused on.\"\n\"Fuck. Yeah.\" It was so hard not to touch him, not to start peeling off layers of clothes until he got to skin. He held onto Hannibal's shoulders to keep his hands out of trouble and kissed the side of his neck. \"Are you gonna go?\" he said. \"That's not-- I don't want you to. But.\"\n\"If I don't?\"\n\"You can have the bed. The dogs won't bother you.\"\n\"You're ruling out the possibility of sex entirely?\"\n\"For tonight. Yeah.\"\nHannibal was quiet for a few minutes. His fingers slid through Will's hair over and over. Will kissed his neck and the underside of his jaw.\n\"I'll go,\" Hannibal said finally. The words slid out on a sigh as Will tried not to suck too hard behind his ear. \"I have a patient tomorrow morning, but nothing after that. May I see you?\"\nWill smiled at him. \"I don't know, are you going to buy me a decent coffee maker?\"\n\"I'll buy you anything you like, Will. Anything at all.\"  \nThere was a fervor in the way he said it, and Will believed him. Anything.\n\"If I ever ask for a car, I'm not serious, okay? Don't buy me a car.\"\n\"I know you've had trouble with your transmission.\"\n\"It's fine, it's barely ten years old. I fixed that.\"\n\"Ten years is fairly old for that sort of vehicle.\"\n\"Now you're insulting my car? I know your Bentley's older.\"\n\"It was made to last. Few things are these days.\"\n\"And now you sound like my dad. I'm not kissing you if you sound like my dad.\"\n\"My apologies. I'll never do it again.\"\n“Better not.”\nHannibal smiled up at him, head tipped back on the arm of the couch. Will could see the fine lines around his eyes and mouth and accumulated strands of silver in his hair.\n\"You're beautiful,\" Will said. He'd never said it to a man, but no other word seemed appropriate.\n\"As are you.\"\nHannibal leaned up to kiss him again, and Will thought he'd be fine with just this, all night.\nWill read student papers in the waiting room of Hannibal's office. He could hear the low rumble of voices inside, Hannibal and his sole Saturday morning appointment. A door opened and closed, and then silence.\nWhen Will looked up, Hannibal was leaning in the open doorway, watching him.\n\"Good morning, Will. Please, come in.\"\n\"You sound like I'm here for an appointment.\"\n\"Are these your students' work?\"\n\"Yeah, don't read them. Some of the grammar will haunt you for the rest of your life.\"\nHannibal picked one up anyway as Will gathered the rest together to slide back into his bag. He frowned at it.\n\"I told you,\" Will said.\n\"I wrote with more clarity than this when I was sixteen. And English was my third language.\"\n\"To be fair, not everyone is you.\"\n\"Or you.\"\n“They just don’t care,” Will said, as he followed Hannibal into his office. “It’s not what they’re there to learn.”\n“And what are they there to learn? The workings of an evil mind?” \nWill rolled his eyes. “Jack should never have called it that.” \n\"You don't believe in evil?\" \n\"As a philosophical concept, maybe,\" Will said.\n\"Not when practically applied?\"\n“Practically, it doesn’t mean anything. It doesn’t tell you anything about the person you’re applying it to. It tells you more about yourself.” \n\"You believe everyone has the capacity for such deeds?\"\nWill paced under the shelter of the loft, from the ladder to the statue of the stag and back. “Don't you?\" he said. \n\"Of course. If we were held to account for our thoughts rather than our deeds, none of us would be safe. Perhaps it’s just as well that so few people get what they deserve.” \n“What do you deserve?\" Will asked. \n\"I deserve you.\"\nWill turned to look at him, not all the way, but enough to catch the lean of his body against his desk, his hands spread out on the wood, head and torso limned by the early light from the window. \n\"You sure about that?\"\n\"Yes. I am sure.\"\n\"What did you do? It must've been pretty bad.\"\n\"The same thing you did to deserve me.\"\nWill blinked, and the drawing on his mantelpiece flared behind his eyes. The deer Hannibal had butchered when he was a child was not a deer. \nThe corpse suspended from the tree still wore a crown of antlers, but the body was human. Will saw Hannibal’s family killed, the house in flames, the flight into the heart of the forest. The wait that must have followed and the patient pursuit.\nHannibal in that tree by the stream as the killer came to drink.\n\"Would you call him evil?\" Will asked. \"The man who killed your family?\"\n\"It felt good to kill him. It felt just.\"\nWill stepped toward him. \"That's not an answer. Why did he do it? You must have thought about it.\"\n\"He was not in his right mind, as they say. Nor was I when I shot him. Madness is a communicable disease.\"\nWill thought of Garret Jacob Hobbs and the warm spray all over his face and hands. \"A blood-borne pathogen.\"\n\"Yes.\"\nHannibal stood with his head bowed, for once not seeking Will's eyes. Maybe that made it easier to get close, or maybe it was just the knowledge of what they shared. Will put his hands on Hannibal's hips, under his suit jacket, and felt the shift of bone and muscle there with a sense of possession.\n\"Did you ever tell anyone?\" he asked. \n\"I told you.\"\nHannibal still wasn't looking at him, and that was so unusual that it made Will uneasy. He leaned closer until their foreheads touched and neither one of them could look the other in the eyes. Everything he could see of Hannibal from this distance was a soft blur of flesh and fabric. \nThis close, he still smelled of Will’s house. His dogs, the faint sooty draft from the fireplace. \"Did you not shower this morning?\" he said.\n\"No. It was easier to recall last night to mind if I didn't.\"\nWill pulled him close and kissed his neck. \"You don't have to recall it. No reason we can't do it again.\"\n\"Even after what I've told you? It was not self defense, Will. I wouldn't want you to think that. I was hunting him. Poorly, but with all my heart.\"\n\"What do you want? My verdict?\"\n\"Yes. A jury of my peers. Or at least, the only one I've ever met.\"\n\"Thanks,\" Will said dryly. \"You know you're guilty though. You don't need me to tell you that.\"\n\"I cannot say I regret it.\"\n\"I'm not sorry I killed Hobbs. I don't expect to be.\"\nHannibal touched him finally, took his face between his hands and kissed him so hard it felt like an assault. Bruising, harsh press of lips and Hannibal's teeth on his tongue, his lip, the side of his jaw. One hand slid down from his neck, over his chest, and pressed between his legs.\nHe rocked forward against it with a low groan into Hannibal's mouth. \"Fuck,\" he said. \"Are we doing this here?\"\n\"Doesn't it seem appropriate to you?\"\n\"Seems like it's going to pretty awkward the next time I'm actually here for therapy.\"\n\"Do you care?\"\nHannibal rubbed his palm slowly against the hardening length of his cock, and Will shook his head violently.\n\"No. Don't care. What-- How do you want to do this?\"\n\"Let me,\" Hannibal said, and pulled Will's shirt up, one hand on the bare skin of his stomach and the other unfastening his belt and jeans, tugging at the zipper until he could reach inside. Hannibal pushed his face into the curve of Will's neck and shoulder and breathed in, licked there and sucked as he stroked Will's cock.\nFor a few seconds, the intimacy of the contact shocked Will into stillness. His mind skittered off into past encounters and endings and failures, and all he could do was bunch his hands into the wool of Hannibal's suit jacket and hold on.\n\"I need to know this is real,\" he said, and he couldn’t tell if he meant it literally or not. The moment seemed at least as unlikely as his visions of Garret Jacob Hobbs. \n\"It's as real as anything can be,\" Hannibal murmured. \"You and I, we are more solid than the shadows you see in your nightmares or the pallid reflections of shattered lives that you breathe in when you inhabit the minds of others. We are each more real together than we are separately.\"\nWill leaned against him heavily and shut his eyes. He folded an arm across Hannibal's broad back, reaching up to grasp his shoulder. Hannibal's hand worked him steadily, the rhythm of it like the beat of a heart that belonged to both of them. \nHis touch was dry and a little too rough, probably how he liked it himself, and Will took note of that. He'd rather have the knowledge than the sterile ease of his own hand.\n\"Kiss me,\" he said and pulled at Hannibal's hair. He came up with a gasp, eyes wide. Will raised his eyebrows. \"Yeah?\"\n\"Harder,\" Hannibal said.\nWill pulled harder, pulled his head back and kissed him, and Hannibal's grip on his cock never faltered. The strokes came faster and tighter, twisting, thumb pressing over the slit until Will was almost growling with overwhelming sensation. He panted into Hannibal's mouth and bit his lower lip and sucked hard.\nHannibal made a soft noise and shifted so Will's thigh was between his legs. His breath shook when Will yanked at his hair, and the sound set Will's cock throbbing.\n\"Do it,\" he said. \"Come on, get yourself off. Do it with me. I'm close, are you?\"\nHannibal nodded and shoved his hips against Will's thigh, frantic, jerky motions in counterpoint to his hand. They spoke over and around each other, lips barely parting enough to form words, always wet, always breathless.\n“Knew this would be good, you’re so good—“\n“You cannot understand how much—“\n“Fuck, Hannibal—“\n“How much I’ve wanted you.”\n“I understand.” \n“I have thought of you—“\n“I know. Sometimes I feel like I can’t think about anything else.” \nWill shoved a hand down the back of Hannibal's pants and cupped his ass, urging him closer, faster, harder. He pulled at his hair and bit at his throat, and he felt Hannibal stiffen as he came.\n\"God, Will.\" His voice was thick and slow, but he jerked Will harder until his teeth ground together and it felt like too much, too rough, almost burning, and then Will was coming too. He clutched Hannibal tight against him.\nHannibal's arms came around him, crushing. They clung to each other with the scent of sex around them, come congealing on their clothes, the quiet tick of a clock in the background.  \n\"You okay?\" Will said. Hannibal's grip on him wasn't letting up.\n\"Yes, of course,\" Hannibal said. He released him, but not immediately. By stages, fingers lingering in a caress at the back of Will's neck. He pressed close again at the last second for one more kiss before he leaned back and waited for Will to step away.\nThey walked in silence to the small bathroom attached to Hannibal's waiting room. Shut into the space together, Will wondered if he should've let Hannibal go first. \nThe front of Hannibal’s pants were stained. He surveyed himself in the mirror with distaste.\n\"Anything I can do to help?\" Will said. He wasn't so badly off himself. Most of the mess had ended up on Hannibal's hand. And a bit on the back of Will's shirt from their clinging embrace afterward, but not enough to be noticeable once wiped off.\n\"I have a change of clothes in a bag in my car,\" Hannibal said. \"The keys are in my desk. If you would?\"\n\"Yeah, sure.\"\nWill went, expecting a gym bag or maybe something newly retrieved  from the dry cleaners. Instead he found a fully packed case in the trunk, toiletries and underwear included, sweater, shirt, casual (for Hannibal) pants.\n\"Were you planning an escape?\" he said when he brought it up.\n\"I was thinking of staying with you last night,\" Hannibal said. He'd stripped out of pants and underwear, and Will tried hard not to stare too obviously at his cock.\n\"Oh,\" Will said. It came out more softly than he'd meant it to. Something about Hannibal thinking that carefully about their-- date. It must have been a date. It had ended with making out on the couch. That almost definitely made it a date.\nHannibal turned to face him and held his hand out. Will offered him the bag, but Hannibal just reached for him and pulled him in, close against his chest. Will could feel his breath and his heart. \n\"Were you angry when you killed him?\" Will asked.\n\"I was angry afterward. At my lack of skill. My inability to reduce him as I believed he should be reduced. To pieces.” \n\"Are you angry now? Ever?\"\nHannibal paused. \"When I allow myself to be.\"\n\"Happy, sad, annoyed? Turned on?\"\n\"Again, when I allow myself to be.\"\n\"What about right now?\"\n\"Sometimes things slip through. Rarely. With unpredictable results.\"\n\"Is that what I am? An unpredictable result?\"\n\"Would you be offended if I said yes?\"\n\"No, not offended.\" Honored, maybe. The thought that anything, let alone him, could slide past Hannibal's defenses like that was astonishing.\nHannibal kissed his forehead and stepped back to dress. When he was done, he smoothed back his hair and patted his face with a damp towel. \n\"Well. Shall we go?\" he said. \n\"Where are we going?\"\n\"To get you a French press and an overcoat.\"\n\"I really don't need an overcoat.\"\nHannibal gave him an amused look. \"You're not going to argue about the French press?\"\n\"I respect your coffee opinions.\"\n\"But not those on overcoats?\"\n\"Those too. I just don't care about overcoats like I care about coffee.\"\n\"The one is a condition of the other,\" Hannibal said, and urged him toward the door with a touch on his elbow, light as if they hadn't just had messy, slightly desperate sex up against his desk. \"Come. You can leave your car here. I'll drive.\"\nThey emerged onto the sidewalk, and Hannibal turned to lock the door. \n\"You know you don't have to get me anything, right?\" Will said. Hannibal gave him a level look. If he were anyone else, Will suspected he'd be rolling his eyes. \"I just need to know,\" Will said. \"Reassure me, and I'll shut up about it.\"\n\"I have never believed that our friendship was in any way contingent on the gifts I've given you.\" He paused. \"But I think you would find it hard to deny that they've had an impact. That the resultant emotional fallout has bound us more closely together.\"\n\"Is that why you did it?\"\n\"You give me too much credit. Though I may be distantly related to him, I am not Machiavelli. I've already told you my sole motivation.\"\n\"You're related to--\" Will shook his head. \"You know what, that doesn't even surprise me. Your sole motivation. Aesthetic pleasure.\"\n\"The scarf was an impulse. I liked the way it looked on you, and more than that, I enjoyed your pleasure in it. You are lovely, Will. The more so when you shrug off the weight of the world for a moment or two.\"\n\"Goddammit,\" Will muttered, and ducked his head. \"You can't say things like that.\"\n\"I think I can, now. It's nearly a requirement, isn't it?\"\n“You’re making assumptions.” \nHannibal’s answer was a split second late. “I apologize,” he said. \nWill glanced at him. Hannibal gestured him forward, down onto the sidewalk and toward the car. He didn’t touch, not even a brush of fingers against Will’s back. At some point, that had become unusual. \nWhen they stopped at the car, Will caught Hannibal’s arm before he could go around to the driver’s side. \"I shouldn't have said that.\"\n“It was no more than the truth. I was making assumptions.” \n“Make them. I want you make them. It was a stupid thing to say. I’m sorry.” \n“You worry too much about me, Will.”\n\"I think I don't worry enough. I'd guess most people don't worry enough about you.\"\nHannibal gave him an unreadable look. “Perhaps that’s true, though not necessarily in the way you mean it. In any case, I’m not upset.” \n“It’s usually better to remind people not to get too close. Not really applicable in your case.”\n“Isn’t it?” \nWill shrugged and let him go. “It’s a little late for that.” \n“Yes. I suppose it is. For both of us.” \nHannibal unlocked Will’s door first and held it open for him, hand on his elbow as he helped him inside.\nThe shop was up a half flight of steps. Frosted glass screened the interior until they stepped inside. Racks of coats stood against the left wall, and the right held a selection of shoes and a few bags. The left half of the room was painted white, the left half a dark cherry red, floor included.\n\"They share the shop,\" Hannibal said.\nTwo older gentleman came out of the back to greet them, both dressed in suits as plaid as anything Will had seen Hannibal wear. One wore a white carnation in his buttonhole, the other a cherry red rose.\n\"Something formal,\" Hannibal was saying. \"Something that could be worn with a tuxedo, but not black. Nothing too harsh.\"\n\"And shoes?\" asked the man from the red half of the room.\n\"Yes, of course. We’ll discuss it.” \n\"You didn't say anything about shoes,\" Will said.\n\"Are you going to object?”\nWill looked away, through the frosted glass window to the blurred shapes on the street beyond. \"I think you know I'm not.\"\nHannibal laid a hand on his waist, and Will almost jumped. \"I wouldn't wish to assume,\" Hannibal said.\n“Why do I need something I can wear with a tux?\" \n\"Because I asked Suzanne to make one for you.\"\n\"You wouldn't wish to assume, huh?\"\n“I’m not assuming you’ll wear it for me. I am merely hopeful.\"\n\"I don’t have anywhere to wear a tuxedo.”\n\"I was hoping you would accompany me to the opera.\"\nWill glanced at him. “I’ve seen pictures of you at the opera. In the papers.\"\nHannibal raised his eyebrows.\"You read the society section?\"\n\"Price reads the society section. He and Zeller play some kind of bingo with the watches. You won him five bucks once.\"\n\"I see.\" Hannibal looked amused. \"And what is it about these pictures that makes you leery of going with me?\"\n\"You've got friends there. You're always talking to someone.\"\n\"Acquaintances.\"\n\"Whatever. I doubt we'd get along.\"\nHannibal rested his hand on the back of Will's neck. \"Is this your usual disinclination toward the society of others, or something else entirely? Do you want to be my dirty little secret, Will? Something to be kept from others and cherished in private?\"\n“Jesus, don't.\" Will closed his eyes and leaned into the touch. He couldn’t help himself. \n\"I'm surprised. Up until now, you have seemed more than willing to be displayed to the world.\"\nWill fought not to press his face into Hannibal's coat and hide. It would've been bad enough if they were alone, but it was a small shop. Mr. Red and Mr. White could hardly help overhearing. \n\"It's not like that,\" he said, even though he knew it was almost exactly like that. “You know how I get. I don't want to make you look bad.\"\n\"Will,\" Hannibal said softly. \"You never could. It would be my honor to have you with me. It always is.\"\n\"As what? Your arm candy?\" He winced. \"See? That's what it would be like. I'll say the wrong thing. I always do.\"\n\"Any opinion they might form of you would weigh on my mind still more lightly than their opinion of me. Whatever you say, whatever you do, I would be proud to be seen with you. And you needn't speak to them at all if you don't want to.\" \n\"You have to stop sounding so sincere,\" Will muttered.\n\"I am afraid that can't be helped. Will you come?\"\n\"I don't even like opera.\"\nHannibal smiled. “You've been to so many, I suppose.\"\nOne. And a half, if he wanted to count the one where he'd walked out at intermission. Will sighed. \"Yeah, okay. I'll go. I'll try to be polite to your friends. Acquaintances.\"\n\"I'm sure you will. Now, let us see about the coat.\"\n*\nLater, at home, Will finished his grading and took the dogs out in a light drizzle that clung in wet beads to his hair and theirs. \nHe walked until enough had collected on him to dampen his jacket and stick his hair to his forehead. The dogs shook it off as if they'd been swimming. He picked up one small sliver of a broken rabbit skull and a tiny bright stone. It was too easy to imagine Hannibal walking beside him. \nBack at the house, the dogs piled themselves in front of the fireplace and waited for him to turn on the space heater. He watched them settle down in the orange glow, curled nose to tail, Wanda’s head on Lizzie’s back. \nHe grabbed a towel for himself and rubbed it over his hair. He stripped off his wet clothes and left his boots and socks by the radiator to dry. The house felt bigger than usual.\nHe took the trash out for collection in the morning. The floor needed to be swept, and he did that, herding loose piles of dog hair into a dust pan and then into the garbage. \n“I’m not used to missing people,” he said out loud, ostensibly to the dogs, though he knew they weren’t listening. Winston cocked one ear back at him, lifted his head, and then flopped down again. Will smiled. “Thanks for trying,” he said\nHe pulled on sweatpants and Hannibal’s coat, the first one. The soft fleece still felt good against his skin.\nThe bed creaked as he lowered himself onto it. The Fly-fisher’s Entomology lay on his bedside table, and he opened it at random. The illustrations stood out vividly on the cream colored paper, nearly luminescent. He almost felt like he should be wearing gloves. \nHannibal’s other gifts hadn’t inspired the same reverence. Will let the book rest face down on his stomach and remembered lying here, spread out on the bed, hand on his dick. Fantasy and reality. Maybe, sometimes, reality was better. \nHe reached for his phone and dialed Hannibal’s number.\n“Will. What can I do for you?”\n“Are you busy?”\n“I’m doing research for an article. It’s nothing that can’t be interrupted.”\n“Do you want to be interrupted?”\nHannibal paused. Will heard the sound of paper sliding against paper, maybe a place being saved for later. “I’m willing to be distracted,” Hannibal said.\n“I’m on my bed, thinking about you,” Will said. “Just so you know what kind of distraction I’m offering.”\n“You sound as if you think that might be the problem for me.”\n“I don’t think you ever intended this to be sexual,” Will said. “You want to tell me I'm wrong?\"\n“Not wrong, no,” Hannibal said slowly. “But it would be equally untrue to say I had any intentions in the opposite direction. As I said before, I wasn’t following a plan.” \n“Are you sorry this is where we’ve ended up? It doesn’t have to be like this.”\n“I’m not sorry, no. Surprised, perhaps. To be honest, my experience of sex up to this point has been somewhat less than enthralling.”\n“What happened to your laundry list of experimentation? No, let me guess. You tried everything you could think of, but the mechanics didn’t make up for the lack of mental involvement.”\n“Is this simply an astute diagnosis, Dr. Graham, or am I to infer that your experience has been similar?”\n“It can be hard to get into it when your brain is going in ten different directions at once.”\n“I feel far more present with you.”\n“I guess they’re not lying when they say that who you’re doing it with is more important than what you’re doing.” \n“And what are we doing, Will?”\n“Where are you?”\n“In my study. Should I be elsewhere?”\n“Only if you want to.” Will rubbed a hand over his eyes and smiled. “I’ve never done this before. Have you?”\n“In a manner of speaking, yes. Once or twice.”\n“How do you have phone sex in a manner of speaking?”\n“It didn’t hold my attention. I provided the necessary responses for my partner and got on with what I was doing.”\nWill laughed, louder than he’d meant to. “That is such an asshole move. Don’t try it with me. I’ll know.”\n“I think you might, yes.” Hannibal pause. “I am, for the moment, quite interested.”\n“Yeah? How interested?” Will slid a hand down between his legs to cup his cock. \n“Enough that I might move upstairs. I think one pair of pants ruined per day is enough.” \n“God, you looked so hot,” Will said. “I’m sorry, I know you hated the mess, but Jesus fucking Christ, Hannibal. I want to see that again.” \nA pause from the other end of the line and a barely audible intake of breath. “That could be arranged.” \n“Now?” \n“Do you really want to wait long enough to drive over here?” \n“No, I want you to send me a picture.” \nThe pause was longer this time. “Of what, specifically?” \nWill swallowed. Couldn’t believe he was actually going to say it. “Of you sitting at your desk with your hand around your dick.” \n“Will,” Hannibal said calmly. “That is one of the most appalling things that anyone has ever said to me.”\n“I know. You’re going to do it anyway,” he said, with a confidence he didn’t feel.\n“Do you think so?”\n“Yeah. Because I want you to. And you want to give me what I want.”\nHe was right. He knew he was right, but the pause before Hannibal spoke again made his pulse beat too loud in his ears.\n“Give me a moment.”\nWill held his breath. He imagined the scene in Hannibal’s study, heard the rustle of moving cloth. He was dying to ask if Hannibal was really going to do it. Do this thing he considered beneath him, just because Will wanted him to. \nHis phone beeped with a text message. He opened it and stared. It was exactly what he had asked for: the erect length of Hannibal’s cock, his hand closed around it, framed by the unzipped fly of his dark blue pants. Will swallowed and swallowed again. He brought the phone back to his ear slowly. \n“You really did it,” he said, a little breathless, more than a little hard.\nHannibal breathed out slowly, not quite a sigh in Will’s ear. “What else do you want me to do?” he asked, voice low.\nIt hit Will right in the stomach. He shoved his hand down his pants and stroked himself twice quickly before he managed to slow down. \n“Push them down around your hips,” he said. “Pants and underwear. Your bare ass on the desk chair.”\nThe click of the phone being momentarily set down. Movement, the creak of the chair in Hannibal’s study, the sound of cloth sliding against skin. \n“Not very elegant,” Hannibal said.\n“It doesn’t have to be elegant to get you off,” Will said. He had his eyes closed, all his attention fixed an hour and more than fifty miles away. \n“Normally it helps.” \n“Normally. Take your tie off and unbutton your shirt.”\n“All right.” Hannibal paused. “What about you?” \n“You can tell me what to do if you want. Right now I’m just watching.” \n“Can you see me so clearly?” \n“Yeah. You want me to tell you what I see?” \n“Yes,” Hannibal said.\nWill could hear the whisper of silk as the tie came off, the scrape of Hannibal’s cheek against the phone’s mic as he used both hands to undo his buttons. \n“You look opened up,” Will said softly. “Raw. Almost skinned. You don’t let anyone see you this way, do you? When you do it, it’s always perfect, because what’s the point otherwise. Clothes off, both of you naked and laid out on the bed. You’re too aware of the image you create to want it anywhere else. Do you choose your sheets to contrast with their skin and hair?” \nHannibal laughed, a touch breathless. “You know me too well. I have thought of it in terms of painting a picture.” \n“An oil painting. The contrast. The way the light falls. Do you have a favorite time of day?” \n“Late afternoon. The angle of the sun through the bedroom window is ideal. It’s one of the reasons I bought the house. I have thought of asking you to come upstairs on some pretext before dinner. You would look like a Vermeer.” \n“You can have me there whenever you want now.” \n“Can I?” Hannibal murmured. “To arrange however I like?” \n“Yes.” \n“Perhaps not entirely naked.” Hannibal’s tone was considering, almost dreamy. “I think I could find a few appropriate decorations for you.” \n“Like what?” \n“It depends on the desired impression, of course. That white shirt, unbuttoned, with the cufflinks perhaps.” \nWill cleared his throat. “Yeah, that may have already happened. The lighting here probably isn’t as good though.” \n“Is that so,” Hannibal said slowly. “And what other use have you been making of my gifts?” \n“Uh. The coat, the brown one. The first night I had it, I— You know.” \n“Elaborate.” \n“Wore it around naked for a while.” He swallowed. “Jerked off in front of the mirror wearing it.” \n“What did you think about while you did it?” Hannibal asked, sharp and focused now. Will heard the creak of his chair and the added echo as he switched to speakerphone. The faint, rhythmic slide of skin on skin. \n“You, both times,” he said, in a rush. “I— God, do you really want to hear this? It’s pretty cliche. My fantasies aren’t that original.” \n“I want to hear every word, Will. Don’t leave anything out.” \n“I used one of the gloves. I wondered if— If you’d be able to smell it on the leather. When I came for my next appointment.” He bit his lip hard, eyes squeezed so tight that colors swam in the darkness behind his lids. “Would you?” \n“It’s possible. Not now. Too much time has passed. But soon afterwards, it’s likely. What did you imagine I would do?”\nWill laughed, a little shaky. “Didn’t get that far. That was really all it took.” \n“Are you touching yourself, Will?”\n“Yeah, are you?” \n“Yes. Keep talking. Tell me about the next time.” \n“The shirt. I’d been wearing it around. To cook dinner in. And after, when I was texting you. You said I’d been making a display of myself.” \n“And you pointed out that I was the one displaying you.” \nWill gritted his teeth, but some needy little sound escaped him anyway. \n“You like that thought,” Hannibal said. “It’s no wonder you’re so eager to let me lay you out in my bed like a living sculpture. I promise you’ll enjoy the opera as well. If not the music, then the intermission. You need only hang on my arm and smile. You’ll charm everyone without saying a word.” \n“Hannibal, fuck…” He took a hard breath, face burning as he shoved his pants down and started to stroke his cock in earnest. \n“You blush so prettily when I manage to fluster you. I’m quite sure Baltimore society will find it just as engaging as I do.” \n“Don’t,” Will said, but he wasn’t sure he meant it. \n“And afterward, when I take you home, then what?” \n“I was imagining it in your office. You’d take everything off me, take it away, because you could. It’s not mine, it’s yours, everything I had on would belong to you.” \n“And you’d have to work to get it back.” \n“Yes,” Will gasped. “That was— That was the thought. Yeah.”\n“What did I ask you to do?” \n“Suck you off.” Will squeezed his cock, slid his thumb over the head, wet with fluid. “That wasn’t the first time I thought about it.” \n“When I offered you a chance to earn the book, rather than taking it as a gift.” \n“Yeah. First thing that came to mind. I never thought you’d really want anything like that. From me.”\n“Would you have done it?”\n“I don’t know. Maybe. I might have. I wouldn’t have been shocked if you asked.”\n“It never occurred to me to ask,” Hannibal said. “I hadn’t thought of you in that way yet.”\n“When did you start?”\n“The coat. When you let me touch you. It’s not like you to let anyone be so free with your body.”\n“I felt like I was going to crawl out of my skin. I didn’t know what to do. I wasn’t even thinking about sex, but you were just— Touching me. Everywhere. Your hands were everywhere. I couldn’t think.”\n“Only to check the fit.” \n“Liar,” Will said. \n“You have no idea how you looked. It would’ve taken someone with far more self restraint to resist you. So unguarded.” \n“Vulnerable,” Will suggested, and heard Hannibal’s breath hiss out. “And so goddamn confused. I would’ve let you get away with nearly anything that day.” \n“Will,” Hannibal said, almost a moan.\n“Innocent,” Will said, seeing himself through Hannibal’s eyes. “Just waiting to be spoiled.”\nHe heard a few sharp breaths from the other end of the line, but no more words. He sped up his strokes and tipped his head back against the pillow, phone clutched hard in one hand. He let Hannibal hear him as he came. \n“Well,” Hannibal said, after a minute or two of nothing but the intimacy of soft breath and slowly cooling skin. “You’re more forthright than is common in my experience of relationships. Even in sex.” \n“Honesty is easier. I’d rather be alone than figure out what hoops I’m supposed to jump through to get someone to stay.”\n“And has your solitude been satisfactory?”\n“It’s been what I could have.” He paused for a second and stared at his cracked ceiling. “This is better.” \n\"Yes,” Hannibal said quietly. “I think so, too.”\nThe next day, the Santa Fe field office found another set of bodies in New Mexico. Will got a call from Jack after his second class. When he’d hung up, he called Hannibal.\n“I’m going out of town. New Mexico again,” he said. \n“The same killer?”\n“That’s what they want to know. Buried alive again, but this time two bodies per coffin.” \n“Were they any more successful in freeing themselves?”\n“Doesn’t look like they tried as hard. Jack says they all died holding onto each other.” \nHannibal paused. “I suppose one would cling to anything in those circumstances. Even the stranger in one’s grave.” \n“They weren’t strangers by the end.”\n“The desire to be known is universal.” \n“Yeah.” Will took a deep breath and leaned back against his desk in the empty classroom. “Anyway. I guess I’ll see you when I get back.”\n“May I drive you to the airport?”\nWill didn’t even hesitate. “Yes. I’m at Quantico. I’ll put you on the list for the gate.” \n“I’ll see you shortly.” \nHe grabbed his bag from his car and settled in to look at the New Mexico file. Hannibal had to say his name twice—at least—before he looked up. \n“Hi,” he said. The smile he could feel stretching his mouth was irrepressible. \nHannibal leaned against the edge of his desk and looked down at him. “Did your students appreciate your sartorial efforts today?” \n“Oh. Uh.” He’d tried the steel blue shirt with one of his own jackets, more out of a juvenile desire to wear something of Hannibal close to his skin than any attempt at fashion. “It’s not terrible, is it?” \n“Not at all. But I think we can do better when you get back.” He paused. “When is your flight?” \n“We could probably spare ten minutes or so.” \n“For what, precisely?” \nWill stood and kissed him once, hands at his waist. \n“The door is open,” Hannibal said, though he didn’t sound particularly concerned about it. \n“No one comes in here unless they have to. Rumor has it, I eat trainees who talk to me outside of office hours.” \n“And do you?” \n“Only the ones who don’t know the difference between to and too.” \nWill closed the small space between them and kissed him again. He rested his forearms on Hannibal’s shoulders, didn’t grab, didn’t pull him closer. Tried his best to keep it light. \n“Will you be back in time for the opera?” Hannibal said, and then didn’t wait for an answer. He pulled Will in tight with a hand on his ass and one gripping the back of his suit jacket. \n“You never— Fuck.” The next minute or two was all Hannibal’s lips and tongue sliding against his, wet and hot, and Hannibal’s hand up the back of his shirt. He managed to pull back an inch, just enough to speak, though not nearly enough to think. “You never said when it was.” \n“Next weekend.” \n“Doubt it’ll be more than—“ Hannibal’s teeth scraped over the curve of his jaw, and Will swallowed hard. “A— A day or two. I should even make my appointment on Thursday.” \n“During which we will speak of the case and of your inner landscape and not do anything untoward to my office furniture.” \n“Is this revenge for abusing your desk?” \n“No.” Hannibal cupped his hands around Will’s face. He stroked his thumb over Will’s jaw and down the line of his neck. “This is… This is absurd.”\n“I hear this is what high school was supposed to be like,” Will offered.\n“The shocking discovery that someone else shares your particular brand of darkness.”\n“And the constant desire to make out because of it. We don’t even have the excuse of rampaging hormones.”\n“And you have a plane to catch.” \nWill stepped back. He wanted one more kiss, but it wouldn’t be just one more. Absurd was absolutely the right word. \n“Your tie,” Hannibal said. He reached out to straighten the knot and tighten it. \n“I’m just going to take it off anyway.” \n“Why would you take it off?” \n“Because class is over, and I don’t have to look like a teacher anymore?”\n“You’re still a professional. There’s no reason not to look like one.” \n“If not looking like one would stop Jack dragging me all over the country to shake hands with the recently deceased, I’d wear a trash bag and nothing else. As it is, I’ll wear what I want, and I don’t like ties.” \n“I like them on you.” \nWill closed his eyes briefly. “I’ll wear it till you drop me off. I can’t even believe I just said that.” \nHannibal smiled and kept his hand on the knot, one finger against Will’s throat. “I appreciate the compromise. I’m aware it doesn’t come naturally to you.” \n“And it does to you?”\n“I am an eminently reasonable man in all respects.” \nWill snorted. “Sure.“ \n“Will?” Beverly’s voice came from the doorway. “Just came to see if you want to carpool to the airport.”\nShe looked between the two of them. Hannibal didn’t back off even an inch. \n“No, I— I’m fine. Thanks,” Will said. \n“Uh huh. Okay, see you there.” She gave him a cheery wave and left. \n“No one ever comes here?” \nWill sighed. “At least it wasn’t Jack.” \n“Indeed. In any case, we should go, should we not?”\n“Yeah. Better get it over with.”\n*\nWill stood over the first open grave. Two bodies lay inside, entwined to the point where separating them visually below the neck became difficult. Legs tangled, arms around backs, hands clasped or clinging to clothes or hair. Foreheads pressed together. He stepped three paces down to the next coffin. The couple inside had died in a kiss.\nMaybe he stared for longer than usual. A hand on his shoulder jarred him out of it.\n“You okay?” Beverly asked.\n“I’m fine.”\n“What do you think?”\n“I think he’s here,” Will said.\n“Watching? Local law enforcement?”\n“No. I think he’s one of the bodies. He got tired of being alone.”\nA beat of silence. “Hell of a way to get a date,” she said.\n“Hannibal called it a primal fear. Being alone in the dark with no hope of escape. I think that was this man’s whole life.”\nShe shifted beside him and clasped her hands behind her back. “So. Hannibal.”\nHe sighed. “Thanks for not mentioning it on the plane with Jack sitting between us.”\n“I am a bro,” she agreed. “Isn’t he your shrink?”\n“Not in any official capacity. We talk, that’s all. Usually, we talk about cases.”\n“Not in bed, I hope.”\n“Ha, ha.” \n“You like him.”\n“Yeah.” \n“Did he give you that shirt? It doesn’t seem like you.” \n“Oh.” He hadn’t thought he’d even see anyone but his students today. “That’s— Yeah. He has ideas about that kind of thing.” \n“I can tell. The plaid and paisley combo gives it away.” \nWill ran a mental check on what Hannibal had been wearing in the classroom earlier. “That was pretty subdued for him.” \n“Wow. Will Graham, smiling at a crime scene. You really like him.” \n“Can we stop talking about this now?” \nShe patted his shoulder. “I hope it works out,” she said, and left him standing alone over the grave, watching the two strangely peaceful faces, eyes closed as if in sleep. \n*\nWhen will got home from New Mexico, he found a tuxedo hanging in his closet. Naturally. He hadn’t expected the box on his bed.\nGlossy and dark gray, the top was emblazoned with a crest in gold. No store name. He lifted off the lid and set it aside. Cream colored tissue paper and a gold ribbon secured the contents. He untied and unfolded and delved deeper.\nThe first layer was socks. Various colors, mainly dark, and, to Will’s eye, unremarkable. Probably hard to buy luxury socks. \nHe stacked them to one side and uncovered the underwear. Boxers in some sort of preternaturally soft cotton with mother of pearl buttons. Clingy boxer briefs in gray and white with gold buttons that he immediately suspected of being actual gold. \nThe rest, bar one, were variations on the same theme. The last were black briefs — extremely brief briefs, in his opinion — with a gold waistband. He stared at them for a few seconds and then reached for his phone. \n\nthe black ones seem kind of trashy for you\n\n\nThey’re not for me.\n\n\nouch\n\n\nI was simply trying to offer a range of choices.\n\n\nthat’s a range all right \n\nHe set the phone aside. Tux, underwear, socks, shoes. Everything he wore that night would belong to Hannibal. Just the thought was enough to get him a little hard. \nHis phone rang.\n“Hello?” \n“Have you tried them on?” Hannibal said.\n“No. Just looking. Might wear them to our appointment. Unless you think it’ll be too distracting.” \n“I think there’s a fair chance I’ll be distracted anyway. Did you find the killer in New Mexico?” \n“Yeah. In one of his own coffins. He buried himself with someone.”\nA brief silence, and then: “How?”\nWill smiled briefly. He’d wondered about the logistics, too. “He had a board set up with stones and dirt on top and a rope to pull out the support from inside the coffin.” \n“Ingenious, I suppose. And the other man? Someone he knew?”\n“Not as far as we can tell. The killer was local. The other guy was a tourist from Michigan. Never been to the southwest until two days before he died.” \n“I hope they found comfort in each other.” \n“How much comfort can you find in lying down with death?”\n“All of us come to the grave eventually. To do so consciously is, perhaps, a blessing.”\n“I’m not sure Mr. Kimball saw it that way.”\n“We can never know how the world appears to the dying. Not until we join them.”\nA few hours before the opera, Will stared at his face in the small, fogged bathroom mirror. He opened the door to let the excess steam out into the hallway and to let a few curious dogs inside. They milled around his feet. He looked at his razor. \nTempting. Stupidly tempting to dress up and be someone different for one night. As Hannibal had put it, hang on his arm and smile at his friends. In clothes Hannibal had bought for him, right down to the skin. Subsumed, like Venice, into Hannibal’s world. \nHe picked up his razor and made the first pass across his stubble, thinking of Hannibal’s reaction. It wouldn’t take much time to grow back. \nWhen he was done, he ran his hands over his face and felt smooth skin for the first time in years. His reflection in the mirror looked skeptical. Younger.\nIt was a little too easy to see himself as Hannibal might see him. The sort of innocence that came from willful isolation, a certain lack of battered edges and mended cracks. Other people had never meant that much to him. His wounds were mainly self inflicted. \nHe pushed his hair back out of his eyes and went to dress. Hannibal knocked just as he finished putting in the cufflinks. He answered the door in stocking feet and saw Hannibal’s expression of cordial greeting freeze on his face.\n“I haven’t got my shoes on yet,” Will said. He moved aside and held the door open.\nHannibal walked in and kept coming until he had Will pressed up against the wall. He cupped Will’s cheek with one hand. “Did you do this for me?” he asked.\n“No. Yeah. Sort of.” Will looked down. “Makes it easier to play the part.”\n“I never asked you to be other than what you are.” But Hannibal leaned in as he spoke and dragged his cheek against Will’s, his lips over his jaw.\nWill shivered and grasped his forearms. “I know. Maybe I want to.”\n“Maybe you think you will be less likely to offend if you discard your sense of self for the night. If you step into someone else’s shoes.”\n“Maybe I just think being your arm candy will be more fun than being a serial killer. Anyway, don’t tell me you don’t like it.” \n“I do like it,” Hannibal said quietly. “Not for purely aesthetic reasons, I’m afraid.” \n“I know. You like that I’d change myself for you. Even if it’s only for one night.”\n“Most people wouldn’t appreciate that particular motivation.”\n“We’re not most people.”\n“No. We’re not.”\n“It’s no different from what I do for Jack. It just hurts less.”\nHannibal took his face between his hands and kissed him slowly. He slid his fingers up into Will’s hair and around to the back of his neck. Will could feel the slight sting of his nails and, where their bodies met, the line of his cock. \n“We’ll be late,” Hannibal said.\n“You’re the only one of us who cares about that.”\nHannibal released him with one last press of lips to his cheek and a hand skimming over his side and hip. “We have dinner reservations,” he said. \n*\nWill hadn’t expected to be nervous. He didn’t like crowds or the attendant echoing cloud of sound and heat, but he could deal with them. He could deal with meeting strangers and shaking hands and the unwanted touches that came from too many people in too little space. Not happily, but he could do it. \nIt was just easier to stay close to Hannibal’s side. To let himself be guided by a hand on his back or elbow, to stay safely within the curve of Hannibal’s arm as they climbed the stairs to their box. \n“Are you well?” Hannibal asked as they found their seats. \nWill looked down at the crashing ocean of people beneath them. Bright dresses and black tuxedos and a few dark suits. The flash of jewelry and expensive watches and sharp eyes. “Fine,” he said. “Why?”\nHannibal nodded to Will’s hand clasped tight to his forearm, fingers digging into the fabric. Will started to make himself let go, but Hannibal laid a hand over his and stilled him.\n“I certainly don’t mind,” he said. “As long as you’re all right.”\n“What about your friends? Will they mind?”\n“This won’t be the first time they’ve seen me with a man, if that’s what you mean. Some will disapprove, but most will be delighted at the opportunity for gossip, whether they approve or not.” \nWill left his hand where it was. He didn’t know how to explain, even to himself, the need for contact. Closeness. It wasn’t like him at all. He was used to standing alone against the encroaching waves.\n“I’m okay,” he said. \n“You don’t need to be,” Hannibal said. He watched Will with a steady, uninflected gaze. “Isn’t part of this about relaxing your guard?”\n“Turns out that’s a lot easier when we’re alone.”\nThe house lights dimmed. The rustle of moving fabric died to a dull murmur. The voices around and above and below them sank from a roar to the almost silent skim of water and foam on sand.\nWill watched the performers move forward and back on the stage with a sense of unreality. Something inside him came unmoored. Sitting there with Hannibal in the dark, he felt he might have another life entirely, one made of nights like this, dinners at Hannibal’s table, travel, a peculiar sort of glamour to which he had never aspired and for which he felt ill suited.\nHe ran his hand along Hannibal’s arm, slowly, more than a minute between upstroke and down. The music was pleasant enough, the story intelligible without any foreknowledge on his part. The costumes and sweeping sets, silk curtain backdrops, singers and dancers with painted faces and a sure sense of their own purpose pushed the story forward.\nWill gathered it all around the periphery of his mind. With the most central and integral part of him, he watched Hannibal. Still face and shining eyes, lips occasionally moist from being pressed together at some sustained note or moment of high emotion.\nHannibal didn’t react to his touch for perhaps the first time in their acquaintance. His whole attention remained fixed on the stage, rising and falling with the music. Will traced the bones in the back of his hand. When he laced their fingers together, Hannibal moved to accommodate the gesture, but that was all. \nIt wasn’t until the crashing denouement of a particularly operatic piece of opera that Hannibal’s hand stirred in his and squeezed. Will wouldn’t have blamed him for closing himself off entirely and living inside the music for an hour or two. The grip on his hand pulled Will in with him, and it seemed miraculous that Hannibal would want him there.\nWill tried to listen after that, tried with the backs of his thighs and his neck and his arms, as if passive listening would be an insult. He felt nearly breathless with effort by the intermission.\nHannibal turned to him as the lights came up with a unusually vague expression on his face. He looked down at their joined hands with a faint frown, but he didn’t pull away.\n“Well,” he said. “Did you enjoy it?”\n“I didn’t hate it,” Will said honestly. “It seemed like a lot of work.”\n“I suppose this sort of music does require more from those who listen to it. One must grasp the structure. A more difficult task than following a tune.”\n“Do you look for structure in everything?”\n“Don’t you? Structure and underlying form. Desire and consequence. All the emotion of which humanity is capable refined and distilled and released via the most natural and flexible of instruments.”\n“The human voice.” \n“Indeed. Or, one might say, the mind. Vocal talent is nothing without the weight of understanding behind it.” \nWill tucked that away for later dissection, along with the memory of Hannibal’s unguarded expression, rapt and avid as he listened. \nThey made their way to a private lounge where, of course, Hannibal held a membership. The bartender greeted him by name and had his drink ready. He ordered for Will, scotch, no ice. Drinks in hand, Hannibal guided him over to a relatively unoccupied corner. They stood with their backs to an unmanned grand piano, lid propped up, music set out, but silent.\n“Does anyone ever play it?” Will asked. \n“Occasionally. An overabundance of ego and alcohol is the usual motivating factor.”\n“What about you?”\n“Are you suggesting something about my ego, Will?”\n“I could state it outright if you’d like that better.”\nOne corner of Hannibal’s mouth turned up. “I won’t deny the accusation, but this is not the audience I would prefer.”\n“If you’re trying to talk him into playing,” a new voice said. “Don’t bother. We’ve all tried and failed.” The man held out his hand to Will. “Mark Carson. I work for Senator Deering.”\n“Will Graham.” Will shook his hand and did his best to smile. \nCarson looked him over, and Will genuinely couldn’t tell if the spark of hunger there was directed at him or his tuxedo. He saw Carson’s gaze glance off his bare wrist. Apparently Price wasn’t the only one who played watch bingo. He’d left his own watch in his bag. He’d wanted to wear nothing Hannibal hadn’t given him.\n“And what do you do, Will Graham?”\nFor a second, Will thought about telling him. His job could shut down conversations in seconds if he explained it with the correct edge of blank menace, and he did not want to talk to this man. \nOn the other hand, he hadn’t planned to be himself tonight. \nHe smiled and looked down at the drink his in his hand. “Not much,” he said. “Nothing like that.” \n“Nonsense,” Hannibal said. He laid a hand on Will’s back and drew him a half step nearer. “Will’s a teacher.” \n“Ah, educating the future of America.”\n“Something like that,” Will murmured. He tucked his hand into the bend of Hannibal’s arm and leaned into him, just enough to get light contact from shoulder to hip. \nHe could feel Hannibal’s surprise as a ripple of tightened muscles, there and quickly gone again. Hannibal laid a hand over his and gave him a smile that was both familiar and absent, as if this were commonplace between them, nothing remarkable.\n“He downplays his talents,” Hannibal said.\n“I’m sure he’s a big hit in homeroom,” Carson said. “And what about you, Hannibal? What have you been up to?”\nAnd that was it. Will was dismissed from the conversation. Old money and politicians and socialites. He looked around and truly realized for the first time that no one here knew him. \nFor the last decade or more, Will’s reputation had preceded him in a vast cloud of speculation and rumor. Not just the peculiar quirk of his imagination, but his forensics publications, the consulting work, the monograph on determining time of death by insect activity, still considered standard though Mant and Nuorteva had done it better, in his opinion. The people he met were afraid of him, or they were jealous of him, or they wanted to use him. No one dismissed him. \nHe liked it. It was incredibly easy to sip his scotch and speak when spoken to, lean into Hannibal’s touch and smile at him as if no one else in the room mattered. As far as Will was concerned, no one else did. He memorized names and faces and filed them away, but none of them seemed quite real.\n“Enjoying yourself?” Hannibal asked in a lull between lawyers and incoming socialites.\n“It’s not bad,” Will said.\n“I had no idea you were such an actor.”\n“It’s not really acting. It’s just…a shift. A different angle.”\n“One you’re enjoying, I think.”\n“Almost as much as you are,” Will said. He gave Hannibal’s arm a little squeeze and looked up at him through his lashes, the curve of his mouth too intimate for such a public setting. Absurd, but worth it to see Hannibal’s throat work briefly. \n“And now I think you’re overacting,” Hannibal said.\nWill couldn’t help his grin. “Maybe. They’ll still buy it. Everyone in this room thinks you hung the moon in the sky.”\n“Apparently not everyone,” Hannibal murmured, and Will smothered a laugh behind his hand. \n“Your ego doesn’t need my help,” he said, and then another of Hannibal’s acquaintances was bearing down on them.\nThey were joined by an older woman in a beaded dress and a feathered headband. Introductions complete and hands shaken, she crossed her arms and looked Will over.\n“I hear you’re a teacher,” she said.\n“Yes, ma’am.”\n“What sort?”\n“Science.” \n“Do you enjoy it?”\nWill blinked. She was the only one so far who had bothered to inquire past the basics. “Yeah, I do. It makes me feel like I’m doing something useful.”\n“Then you’re doing better than ninety five percent of the people in this room.” She smiled. “And how did you meet Hannibal?” \nFor a second, Will contemplated lying. He could make up anything from an encounter at a coffee shop to some unlikely fiction about Hannibal rescuing dogs from a burning building. He saw in that moment a true longing in himself for another life, not necessarily the one he was trying on tonight, but something more than the limited track to which he had reduced himself.\nHe forced a smile. “Mandatory psych eval. There was an incident.”\n“Nothing too serious, I hope?”\n“A man was killed,” Hannibal said. “An unfortunate occurrence.”\n“Oh, dear. Of course the school wanted to make sure everyone was all right. Nice that they thought of the teachers, too,” she said. “I’m so sorry. I’m glad it brought the two of you together though. It’s lovely having you here, Will. And not just because you won a bet for me.”\n“A bet?” Hannibal said.\n“Alicia was convinced it was only work keeping you away. I thought it must be something more than that, or rather someone. I’ve never known you to let work get in the way of art.”\n“You have found me out,” Hannibal said graciously. “I only just convinced him to come tonight.”\nWill glanced at him and wondered if it were true. They had spent more time together recently, but surely Hannibal wouldn’t skip this for him. “You didn’t have to— You would’ve gone on your own, right?” he said, frowning.\nHannibal looked at him with such warmth that Will could feel it like a touch. “Eventually,” he said.\n“You don’t enjoy the opera, Will?” she asked. \n“I’ve only been a couple of times before this. It’s better with Hannibal to explain things to me.” \n“Well, you couldn’t have a better teacher. He’s quite the musician himself, though I suppose you know that. Senator Deering’s lackey said you were trying to get him to play earlier.” She turned to Hannibal. “I suppose you turned your lovely young man down just as you’ve turned down the rest of us.” \n“Mr. Carson misunderstood the situation.” \n“Goodness, what a shock. That man has all the social grace of a water buffalo.” She eyed Will. “You didn’t ask, then?” \nWill looked down and shook his head quickly. “No, I didn’t know if— I wouldn’t want to ask Hannibal to do anything he’d be uncomfortable with.” \n“My god, aren’t you precious? Hannibal, how do you ever say no to him?” \n“I don’t.” Hannibal squeezed Will’s hand lightly until he looked up. “Shall I play for you, Will?” \n“You really wouldn’t mind?” \n“Not at all.” \n“Please,” Will said, and, embarrassingly, he didn’t have to fake the slightly breathless way it came out. Hannibal was very close and very warm, and his smile made Will’s heart pound. \n“Come and sit with me,” Hannibal said, and led him over to the piano bench. “Something short, I think. The intermission will be over soon.” \nWill was remotely aware of a small crowd gathering around them, but most of his mind was taken up with memorizing the image of Hannibal’s fingers spread out across the piano keys, of the serious set of his face and the concentration in his eyes. Will wondered if he looked like this when he cut someone open on the operating table. \nThe room quieted after the first few notes, only a low background hum of chatter in the corners. Will barely heard it. The form and structure of the music ran clean through him, like a thin, sharp blade. It pinned him down and held him perfectly still until Hannibal finished. Light applause flared around them, barely audible over the ghosts of the last few notes. \n“What was that?” he asked. \n“My own composition.” \n“It sounded familiar.” \nHannibal smiled very slightly. “It should. I based it on what I have come to understand of the way your mind works.” \nMost people Will knew tried, eventually, to figure out how he did what did. More than a dozen psychiatrists over the years, but bosses, friends, and lovers as well. They picked at him until he felt he must have lost parts of himself, stuck under their nails and between their teeth. \nAnd Hannibal did this. \nHe couldn’t force out a single word, and he had no idea what his face looked like, but it made Hannibal’s smile grow a little wider. He touched Will’s cheek briefly and offered him his hand as he stood up. \n“Come,” he said. “I think it’s time we returned to our seats.” \nWill walked in the shelter of Hannibal’s arm and still in the spell of the music. \n“It was meant for the harpsichord,” Hannibal said. “I’ll play it for you properly at home.” He paused. “Although perhaps tomorrow.” \n“Definitely tomorrow,” Will said, though he didn’t feel definite enough to insist on anything. “Hannibal…thank you.” \n“There is no call for thanks. I wrote it for myself. I had never planned to play it in company.”\nWill stopped him outside the door to the box and kissed him. The hall was nearly empty, but he kept it chaste and quick all the same. It was Hannibal who pressed him hard against the wall and took his mouth and left Will clutching at his shoulders.\n“If one is going to be talked about, it seems only polite to offer the possibility of scandal,” Hannibal murmured in his ear.\n“I’m not complaining.”\nHannibal kissed him once more before he led the way into their box. Will had no idea if they’d been seen or not. His focus had narrowed, and he was aware of nothing but Hannibal’s touch on his skin and the taste of him lingering in his mouth.\n“I don’t know whether to be concerned or impressed by your performance tonight,” Hannibal said, as they pulled away from the curb. \nWill glanced at him. “You’re impressed.”\n“You’ve certainly given them something to talk about.”\n“Me? You’re the one letting them think I’ve got you wrapped around my little finger.”\n“My part was no more of a stretch than yours.” \n“That thing you played for me—“\n“Piece,” Hannibal said firmly. “Not thing, please.” \n“Piece, sorry. When did you write that?” \n“I’ve been working on it since a few weeks after we met. It’s not finished.” \n“Will it ever be?” \n“Perhaps not. Perhaps it will evolve with you.”\n“Is that what I’m doing? Feels like devolving or revolving a lot of the time.” \n“You’ve seemed happier recently. You looked happy tonight,” Hannibal said.\n“Thanks to you.” \n“I don’t think so. Perhaps thanks to your decision to indulge in something that you would normally deny yourself.”\n“I wasn’t myself tonight,” Will said quietly. \n“You were a possible aspect of yourself.” \n“Would you rather have me like that?”\n“I like you as you are, Will.”\n“That’s not really an answer.”\n“Then I will admit I wouldn’t mind seeing you from that angle again at some point. It has a certain appeal. But not now. I think the rest of the evening will require a more forthright attitude than the man I spent the evening with could muster.” \n“You want to go back to your place?”\nHannibal smiled. “Yes. Do you?” \n“God, yes.” \nThey reached Hannibal’s house, and Will managed to let him get his coat off before he pressed him up against the closed door and kissed him.\n“Coffee,” Hannibal mumbled into Will’s mouth.\n“In the morning,” Will said. “Show me your bedroom.”\nHis sheets were a deep, almost violet red. \nWill pulled his bow tie loose. “Should I be worried about the color you picked for me? I’m going to look like I’m lying in a pool of blood.”\n“It was that or dark blue. In the end, I decided that the night sky could not stand up to such a star.”\n“Even from you that sounds a little cheesy.”\n“But you’re smiling.” Hannibal stepped close and brushed his thumb along Will’s bottom lip. “And so my purpose has been accomplished.”\nWill bit lightly at his thumb to keep his smile from growing any wider. “Still cheesy. Did you get me anything tonight?” \n“Of course. But you’ll have to wait. This isn’t the time.” He kissed Will around his thumb and then stepped back. “Take off your shoes and socks, if you would, and nothing else. I’ll be back in a moment.” \n“Got a plan?” \n“Yes.” \nShoes and socks gone, Will laid himself out on Hannibal’s sheets, the color of venous blood. \nHannibal stopped in the doorway. “Don’t move,” he said. \nWill stretched, arms up over his head, back arched, blatantly showing off. He settled on his side. “Wasn’t planning on it,” he said. \nHannibal started to undress with neat, precise movements. Bow tie folded and set on his dresser, jacket hung up in the closet. He faced Will as he unbuttoned his shirt and toed out of his shoes. \n“I don’t get to help?” Will said. \n“No. Stay just as you are.” \n“You got bossy in a hurry. Sure you don’t want to wait for the afternoon light tomorrow?”\n“What makes you think I’ll let you out of bed before then?” \n“I’ll have to go home and let the dogs out in the morning so they don’t piss on the floor.” Hannibal sent him an amused look, and Will shrugged. “Sorry. You knew what you were getting.” \n“Yes, I did.” \nHannibal stripped for him, piece by piece, steady and unhurried, until he stood naked beside the bed. Will stared. The more he stared, the more Hannibal’s silent amusement grew. \n“I can see you smirking,” Will said. \n“You’re not looking at my face.” \n“I don’t need to.” \nHannibal stepped closer. “A leap of intuition?” \nWill slid a hand up the outside of his thigh, over his hip, across his stomach. “Can I suck your cock?” \n“Not at the moment. I had a plan, you remember.” \nHannibal climbed onto the bed and knelt near Will’s feet, hands braced on the mattress, watching him. The muscles in his shoulders bunched and shifted, and his thighs flexed, and Will closed his eyes for a second. \n“When do we get to the part of this where I get to touch you?” he said. \n“Soon, I promise.” Hannibal reached for something off the side of the bed and held it up. “Do you know what these are?”\nThe scissors Hannibal held were bent at an angle, and the tips were rounded. Will opened his mouth and then closed it again. “Trauma shears,” he said, and swallowed. \n“Yes. Used to cut clothing off of patients in the ER. They’ll cut through nearly anything.” \n“You— But you’re not going to— You can’t.” \n“I think I can,” Hannibal said, voice low. He ran a hand up Will’s calf to his knee. “It’s all mine, isn’t it? Everything you’re wearing tonight, bought and paid for.” \nWill swallowed again and felt his cock stir. He never should’ve told Hannibal about that fantasy. Should’ve kept it in his head where it belonged. \n“Will?”\n“Still here,” he said faintly, eyes fixed on the shears. \n“You didn’t even wear your watch,” Hannibal said. \n“It didn’t really stand up to the tux.” \n“I’ll get you one that does.”\nWill let his head fall back on the pillows and let out a shaky breath. “Yeah?” \n“Of course.” Hannibal closed a hand around his ankle and rubbed his thumb over the knob of bone there, a strangely intimate touch. “You didn’t bring your wallet either. Were you expecting me to provide for you?” \n“It’s in my bag.” He turned away, face heating. That was exactly what he’d expected. “I didn’t think you’d let me pay for anything.” \n“And you were quite right. It’s my privilege and my pleasure to give you what you need.”\n“And to take it away again?”\nHannibal smiled at him, eyes bright, a hint of teeth. “Don’t worry. I’ll replace anything I ruin.”\n“Are you really going to—” Will could hear the longing in his own voice, and he cut himself him off fast. Not fast enough.\nHannibal crawled up his body and dipped his head to speak into his ear. “I am really going to cut this very expensive custom tailored tuxedo off of your body and leave it lying in pieces while I fuck you in its mortal remains, yes.”\nWill moaned through his teeth and grabbed at his shoulders. “Hannibal. God.” \n“You’re hard already just at the thought of it, aren’t you?” Hannibal murmured. “You know every person you met tonight saw you as mine, don’t you? A possession, just like the things I’ve bought for you. And I’m quite sure none of them believed you bought what you’re wearing on a teacher’s salary.” \nWill’s cock ached, and he moved restlessly against the sheets, unable to keep still. “Do it if you’re going to,” he got out. \nHannibal tugged his head back by the hair and kissed the center of his throat. “The tips are blunt and unlikely to cut skin. You needn’t worry about keeping still. Since I can see that’s a problem for you.” \nWill swore under his breath as Hannibal moved back down his body. He lifted his head to watch. \nHannibal ran the shears up the center of the right leg. The fabric gaped in their wake, jagged, his skin pale underneath. Up over the knee, the thigh, straight up and through the the waistband of both pants and underwear. \nCooler air against his heated skin made him shiver. Hannibal used the tip of the shears to flip aside the panel of ruined cloth and expose him. Will grabbed hold of the sheets, breath coming short and quick. His cock lay in a thick, hard curve against his lower stomach, already wet and sticky at the tip.\nHannibal bent down, on all fours over him, like something wild. Something hunting him through the woods. Or waiting for its chance, asleep in a tree. He bent so low his nose almost touched Will’s cock and breathed in, scenting him. \nWill’s cock jerked, and he swallowed, choked on air thickened with heat and desire. “Hannibal,” he said. \nHannibal looked up at him. His eyes were half-closed and so dark, barely recognizable. “Is there something you want?” he asked. \nThe words formed in his mind, and he let them out, knew they were right without knowing why. “Do I smell good?”\n“Delicious,” Hannibal said. He took a slow breath and seemed to shake himself a little. He gripped the shears and continued his cut, now down the other side, all the way to the bottom, until the pants and underwear lay in rags, entirely free of Will’s body. \nHannibal knelt back and looked him over. \n“Is this what you were going for?” Will said, voice unsteady. He still hadn’t moved, didn’t quite dare. “Am I aesthetically pleasing enough for you now?” \n“You always were,” Hannibal said. “Now you are art.” \nWill wanted to push him, make him do something, and he wanted to lie still and have Hannibal look at him like that forever. \nA few thick seconds passed, and then Hannibal moved up his body again. He cut a jagged, diagonal slice across the front of the shirt and through the shoulder of the jacket, enough to bare Will’s chest, enough to ruin both of them and still leave him trapped inside them, cufflinks and all. \n“You are perfect,” Hannibal told him, low and fierce. “You should not be possible.” \nHannibal looked at him and through him, and his hands lay on Will’s skin like they had become a part of him. Will took a slow breath, afraid to break the moment and more afraid not to. \n“You’re not the first person to tell me I’m impossible,” he said. \nHannibal didn’t seem to register the words for a second, and then he dipped his head slightly, a faint smile growing on his mouth. His expression eased into something more human. For the moment, Will was glad of it. \n“I can certainly see why,” Hannibal said. He reached over Will to his bedside table and came back with a condom and a glass jar. “You have done this before?” \n“Not recently, but yeah.”\n“I’ll be careful.” \n“Don’t be too careful.” \nHannibal raised his eyebrows, but took him at his word. He started with two fingers, slicked up so generously that it dripped down between Will’s cheeks. Down onto the remains of the tux to ruin it more thoroughly. \nWill imagined the stain and the creases pressed into by their bodies. He pushed himself down onto Hannibal’s fingers and sucked in a tight breath at the burn and stretch of it. \n“Perhaps next time I’ll have you keep it all on,” Hannibal said. “Pull your pants down and have you like that.” \nHe slid his fingers deep and twisted them, rubbed the pad of his middle finger against Will’s prostate, a light tease that made Will squirm helplessly for more. \n“Not very elegant,” Will said, between his teeth. It was all he could do not to whine like a dog. It’d been so long. \n“You are forcing me to cultivate an appreciation for the less than elegant. What did you think of the men’s room at the opera? The stalls are fairly large.” \n“I think you’re bluffing. There’s less than elegant and then there’s sordid, oh…” He reached up and grabbed at the headboard as Hannibal thrust his fingers in hard. “Please, that’s enough. Fuck me.” \n“I don’t know,” Hannibal said, tone musing and far too calm. He wiped his fingers on Will’s jacket and tore open the condom. “It would be empty during the performance, and one can still hear reasonably well. It’s not ideal, of course, but the idea of being inside you while I listen has some appeal. Do you think you’d enjoy talking to your new friends after that? Freshly fucked, with come drying on your skin. I would most certainly be able to smell that.” \nWill bit at his knuckles and pressed a hand over his eyes. “I’d let you. God. You know I would. Please.” \nHannibal smiled down at him, broad and pleased and predatory. He pushed Will’s legs up and back, tilted his hips, and started to press inside. \nThe room dimmed momentarily as Will found himself unable to focus on anything but the perfect, slick invasion. He grabbed at the headboard again, at the sheets, at anything that might afford him some purchase while his mind slid off into static.\nThe stretch was almost too much. Hannibal’s cock was thicker than he’d had even when he did this on a semi-regular basis. More than ten years ago. It left him struggling to relax around it, clenching every few seconds, forcing himself to let up again as Hannibal pushed in another inch. \n“Breathe,” Hannibal told him. \nWill tried, but the further Hannibal got inside him, the less room there seemed to be for anything else, including air. “Just don’t stop,” he said. “I’m fine, I promise. Just don’t stop.” \nHannibal watched him for a moment. “Tell me if you change your mind.” \nThe final few inches were a steady, hot press, and he felt his body open up inexorably, knees sliding against Hannibal’s sides, stretched and caught and held. Hannibal drew back almost immediately and started in again, a little faster. Will could feel him inside, everywhere.\n“You can do it harder,” he said. \nHannibal didn’t listen, just curled over him and kept his thrusts slow and steady. Will’s body relaxed by degrees. Some of the ache faded. Not all. He’d feel it tomorrow, and the thought of that made him smile. \n“Better?” Hannibal asked. \n“Good. Perfect. You fuck like a dream. God, sorry. It’s hard to— I should shut up.” \nHannibal bent to kiss him, eyes amused and fond. “Sexual intimacy is meant to encourage the dismantling of barriers.” \n“Not the ones between—Fuck—thought and speech, do that again, harder.” \nHannibal pushed in hard, hit the angle perfectly, and Will let himself moan out loud. His head fell back against the pillow, and he stared up at the ceiling, mouth open, just feeling the way Hannibal moved inside him, over him, the way their skin met, Hannibal’s tight grip on his hip and the back of one thigh. \nThe thrusts came faster, with enough force to push him up the bed and push sounds from his throat that he hadn’t meant to make. Hannibal’s fingers dug into him with each one, and he let himself keep making them, let himself feel without dignity or reservation or fear. \nHannibal took his wrist and pulled his hand down from the headboard. “Touch yourself,” he said. His face was drawn, sheened with sweat, tendons in his neck standing out under his skin. \n“Finish first,” Will said. He shook off Hannibal’s hand and reached up to touch his face instead. “Stop holding back.” \nHannibal laughed, a sharp, strained sound. His next thrust was harder, the next harder still. He shoved Will’s leg up and back, opened him up, pinned him down hard with a hand on his chest, just below his throat. \n“All yours,” Will told him, though with enough of his breath knocked from his lungs that he barely heard the words himself. \nHannibal rode him with bared teeth and savagery, utterly silent when he came. His nails sank into Will’s thigh with a spasm of clenched muscles and a flare of pain. Will drew him close, legs around him, hand on the back of his head. He could feel Hannibal’s labored breath as if it were his own. \nHannibal moved enough to pull out and tie off the condom. When Will shifted to bring him closer again, Hannibal’s stomach slid along his cock, and Will pushed up into the contact with a low sound.\n“Let me,” Hannibal said, and started to move down. \nWill caught him by the back of the neck. “Not yet. This is good. You feel good. Just kiss me.” \nThey lay together, Hannibal’s mouth on his, on his throat and under his jaw. Slow kisses and the friction of Hannibal’s lean stomach against his cock, winding him tighter. For a while, that was all he wanted. It felt too good to push for an ending, and he worked his hips in lazy thrusts, bit and sucked at Hannibal’s lower lip until he felt it go tender and hot against his tongue. \nWill rolled them over and pushed himself up, legs splayed over Hannibal’s hips, shirt and jacket still hanging off of him. He looked down at Hannibal and stroked himself once. \n“Talk to me,” he said. \nHannibal looked up him with something like reverence and touched his thigh, his hip, his wrist. “I truly don’t know what to say.” \n“That’s not a bad start.” \n“May I touch you?” \nWill nodded, and Hannibal rand both hands up his thighs and wrapped one hand around his cock, below Will’s. A little darker than his own hand, nails tinged with red. \nHannibal followed his gaze. “It’s yours, I’m afraid,” he said softly. “The back of your thigh. You must have felt it.” \n“I can feel it right now. It’s good. You’re good.” \n“You sound very sure about that.” \nHannibal started to stroke him, and Will let his own hand fall away. He leaned back and closed his eyes. \n“Good is relative. I’m sure you have secrets you haven’t told me yet.” Images slid behind his eyes and fit together with a sound like fat crackling in a fire. “I’m sure you ate that man. Half revenge and half the hope of reclaiming some part of your family.”\nHannibal didn’t say a word, but his fingers dug into Will’s thigh until he was in danger of breaking the skin again, and he stroked Will faster. Will could feel his eyes on him.\n“That’s why you identified so strongly with Abigail. Have you ever met anyone else who’d eaten human flesh? Even if she didn’t mean to, it must’ve been extraordinary for you.” \n“Will…” Hannibal sounded choked, as if he were the one seconds away from coming. His hand moved in a blur on Will’s cock.\nWill breathed hard through his nose. He braced his hands behind him on Hannibal’s thighs and thrust up, straining. “Little tighter…”\nHannibal tightened his grip and twisted. His thumb slid over the head of Will’s cock, and Will came, arched like a bow in his hands. He stared down at the streaks of white across Hannibal’s chest and stomach. Hannibal pulled him down and held him close. He buried his face in the curve of Will’s neck and breathed him in. \nThe air was still and thick around them. Will felt his mind contracting back into his body, as an engine contracted when it cooled. “Tissues,” he mumbled.\n“One moment.” Hannibal slid out from under him and returned with a damp cloth. He wiped at Will’s skin and then, even more cursorily, at his own.\n“I thought you’d make us shower for sure.” Will stretched out and looked up at him. \n“Some things one doesn’t wish to clean away immediately.” \nHannibal climbed back in with him and pulled off the remnants of Will’s shirt and jacket. They fitted themselves together, Will on his back and Hannibal against his side, his head on Will’s shoulder, arm curled over his stomach. \nWill yawned and splayed his hand out across Hannibal’s back. He traced the ridges of Hannibal’s spine. A thought drifted into his mind. He let it out into the world without examination. \n“Would you take me to Venice if I asked you to?”\n“You need only tell me when,” Hannibal said. “A week or two of warning so that I may clear my schedule would be ideal.”\n“Just like that?” Will slid a hand through Hannibal’s hair and tugged lightly until he looked up. “Really?”\nHe took Will’s hand and kissed the inside of his wrist. “The rain will start in earnest in a month or so. How long would you want to stay?”\nForever, Will thought, and sighed. “I’ll get back to you on that.”\n“After you weigh your conscience against your heart? Perhaps it would help you to know that I won’t consider anything less than two weeks. A month would be preferable.”\n“I have at least that much vacation time built up. But Jack.”\n“Jack will never need you any less. If you wait until the flood subsides, you will be treading water forever. Or you will be subsumed entirely.”\nWill let himself imagine the two of them in bed somewhere with tall windows and rain on the glass, water lapping against the side of their building. No responsibilities, no chance of a call from work. Wine and Hannibal’s cooking and the opportunity to be someone he wasn’t. \n“Mid-November,” he said. “Is that okay?”\n“Perfect. Shall we stay through Christmas?”\nA month and a half. Fuck it. He’d use up sick days if he had to. “Yeah. We can do that.”\n“And New Year’s?”\n“It’s only a few more days.”\nHannibal kissed his chest. His mouth curved against Will skin. “If we are to stay so long, it seems a pity to miss Carnival.”\n“Now you’re pushing it.”\nHannibal laughed quietly. “Perhaps next year,” he said.\n“Maybe.”\nWill slid his fingers through Hannibal’s fine, straight hair and watched the shadows move on the ceiling, like the reflection of water two stories below. His eyes closed on their own, and he slept. \n*\nWill woke to the smell of coffee. Pale light came through the curtains. He could hear Hannibal moving down in the kitchen. A mug sat on the bedside table. He swung his legs off the bed and picked it up. For a moment, he just breathed it in, steam and warmth and the aroma, almost as good as he knew the taste would be.\nHis eyes caught on a small box that had sat, hidden, behind the mug. Gray velvet, curved on the top. The sort of box that a ring might come in. It hadn’t been there the night before. He took a deliberate sip of coffee and then another before he set the mug down. \nHannibal had said he’d gotten him something. That he’d have to wait for it. He reached for the box and opened it.\nThe ring was silver in color. Knowing Hannibal, it was more likely platinum or white gold than sterling. Three strips of white cut across the top, perpendicular to the band. He touched one and found it warm. Not stone. Bone or ivory. He twisted it so the inside caught the light and saw the inscription.\n\nmi ritrovai per una selva oscura\n\nHe didn’t need to know Italian to recognize the beginning of Dante’s Divine Comedy. \n\nMidway upon the journey of our life, I found myself in a dark wood, for the straight path had been lost.\n\nIt nearly made Will laugh. He felt the dark wood all around him, the brush of leaves and blind eyes watching him from the shadows, had felt it almost from the moment they’d met. He had no desire to find his way out. To know that Hannibal felt the same was more than he would ever have thought to ask for. \nA matching chain lay coiled in a depression at the back of the box. He’d need it. From nitrile gloves to fish guts to dog baths, his life was not well suited to the constant presence of a ring on his finger. \nFor now, it fit perfectly, incongruously plain for one of Hannibal’s gifts. Almost, but not quite, something he might have chosen for himself."
}