{
    "id": "13220799",
    "url": "https://archiveofourown.org/works/13220799?view_full_work=true",
    "author": [
        "DJ_unicornsrgr8"
    ],
    "title": "The Five Times Peter Got Help With Schoolwork and The One Time It Was Done For Him",
    "rating": "General Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [],
    "fandoms": [
        "The Avengers (Marvel Movies)",
        "The Avengers (Marvel) - All Media Types",
        "Spider-Man - All Media Types",
        "Spider-Man: Homecoming (2017)",
        "Captain America (Movies)",
        "Iron Man (Movies)",
        "Marvel Cinematic Universe"
    ],
    "relationships": [
        "Peter Parker & Avengers Team",
        "James \"Bucky\" Barnes/Steve Rogers",
        "Peter Parker & Tony Stark",
        "Peter Parker & Steve Rogers",
        "Peter Parker & James \"Bucky\" Barnes",
        "Peter Parker & Natasha Romanov"
    ],
    "characters": [
        "Peter Parker",
        "Tony Stark",
        "Steve Rogers",
        "James \"Bucky\" Barnes",
        "Natasha Romanov (Marvel)",
        "Clint Barton",
        "Jarvis (Iron Man movies)",
        "Maria Hill",
        "Bruce Banner",
        "Pepper Potts"
    ],
    "additional_tags": [
        "Fluff",
        "a bit of angst",
        "Exhaustion",
        "Superfamily",
        "Homework",
        "Parent-Teacher Conferences",
        "Could potentially be helpful to people who take Spanish?",
        "Yay verbs",
        "Anxiety",
        "mild panic attack",
        "Group Projects Suck",
        "Essays and Projects oh my!",
        "JARVIS is a pal",
        "5+1 Things"
    ],
    "language": "English",
    "series": "Part 1 of Peter & Bucky Are Pals",
    "published": "2017-12-31",
    "completed": "2018-01-05",
    "words": "19,414",
    "chapters": "6/6",
    "comments": "935",
    "kudos": "12,403",
    "bookmarks": "1,427",
    "hits": "189,733",
    "summary": "<p>Peter needs more sleep. And time. But he definitely doesn't need help, or at least that's what he tells himself.</p>\n<p>Aka Peter isn't a good self-advocate.</p>\n<p>Aka the title is pretty self-explanatory.</p>\n<p>Peter didn't mean to procrastinate... but he did. Now he has to face the consequences. Also, Bucky's cookies.</p>\n<p>This is the exception to the title of the story, but it's still school related; time for parent-teacher conferences! Some humor, some fluff, and a bit of angst. Also, Hair Club! (From Owlet's Infinite Coffee and Protection Detail verse.)</p>\n<p>Ye olde physical education. Here we go. Also, more Hair Club!</p>\n<p>Peter has a Spanish cumulative test. He does what everyone does when they have a cumulative test. Panic.</p>\n<p>Featuring Bucky's cookies, frisbees, and sugary cereal.</p>\n<p>This is the chapter that could be potentially helpful if you're struggling with Spanish verb usage. Is it too thorough? Honestly, I don't know. But hey, good times!</p>\n<p>... And the one time it was done for him. Group projects suck, especially when nobody does their share of the work. Poor Peter tries, but doesn't succeed. Who will finish the presentation?</p>",
    "notes": "<p>Bucky's characterization is based off that in Owlet's series called Infinite Coffee and Protection Detail, which I'd highly recommend reading if you haven't already. You don't have to read it to understand this, but it helps!</p>\n<p>Also, there's a <a href=\"https://archiveofourown.org/works/15847353/chapters/36908487\" rel=\"nofollow\">prequel</a> to this fic written by the lovely <a href=\"https://archiveofourown.org/users/Aprilmallick/pseuds/Aprilmallick\" rel=\"nofollow\">Aprilmallick</a>! Check it out!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>A quick note: originally, I wrote that Peter said that the US bombed Japan until they surrendered. However, one reader informed me that Japan actually made moves to surrender before the US bombed them, but that the US bombed them anyway, potentially just to test out their bombs and show their power. That being said, another reader informed me that unconditional surrender seemed unlikely on Japan's part, especially since Japan didn't make an offer to surrender after the first bomb. The various sources I've looked at tend to contradict each other, but just keep in mind that history is far more complicated than it's portrayed in the history books—the bombing of Japan is clearly far less black and white than we think it is. It's realistic for Peter not to know any of this, given what we get in history classes here in the US, but I reworded that line so as not to spread misinformation either way.</p>\n<p>Bucky's character is heavily influenced by that in Owlet's series Infinite Coffee and Protection Detail. You don't have to read it to understand this, but it helps!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Happy New Year, if you follow the Gregorian Calendar!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>Sorry this one was posted a bit later, I was having trouble with HTML but I figured it out!</p>\n<p>Also: there's a chance that I'll lose power tomorrow, so if that happens, I might not be able to post. Fingers crossed that the power stays on!</p>\n<p>I'm posting this one early in case the power goes out later. Better safe than sorry!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>This is it, everyone, last chapter! Thank you all so much for your support, it really means the world to me! As you may have noticed, I've turned this work into a series. I'll mostly be writing oneshots focused on Peter and/or Bucky, and I'm open to suggestions! Feel free to drop me a line in the comments if there's anything you really want to see :) Thank you all again for reading!</p>\n<p>Thank you for reading! Let me know if you enjoyed it; I have the other chapters written, so I can post those whenever you folks want. I'd really appreciate any comments you have to offer! Thanks again!</p>",
    "text": "Peter flopped from his desk chair onto the floor, burying his face in a dirty shirt before realizing how disgusting it smelled and rolling away from it.\n“You appear to be in mild distress, Mr. Parker. Should I call Mr. Stark?”\nPeter flailed. “No! No, I’m fine. Thanks though, JARVIS.”\n“Is it accurate to presume that the primary stressor is your history test tomorrow?”\nPeter lifted his head and looked suspiciously at the ceiling. “How did you know?”\n“Contrived from your emotional state, I have calculated that the chance of your test being tomorrow is high, and that it is exceptionally likely your test is for your history class, based on the available content.”\n“... Available content?”\n“The papers on your desk cover material on the second World War, Mr. Parker.”\nPeter sighed. “I’m screwed. I can’t remember any of the dates or the names of the battles or the leaders and there’s too many countries… I should’ve paid attention in class, but I was tired… I didn’t get enough sleep. What even is sleep? I should be fine. I just have to remember stuff. Why are there so many countries in the war?”\n“It is a World War, sir.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeter buried his face in his arms. “Urgh.”\n“Peter?”\nPeter sat bolt upright to find Steve in his doorway. “H- Wh- What’re you doing here?”\n“JARVIS said you needed help,” Steve said, looking a mix of worried and bemused. “Are you okay? Why are you on the floor?”\n“Are you kidding me? Not cool, JARVIS! I’m fine!” Peter crossed his arms indignantly.\n“There is a high probability that my actions will lead to an improved outcome, based on Mr. Rogers’s knowledge of World War II and your unwillingness to ask for help,” JARVIS told him. Peter watched as Steve ambled over to his desk, scanning through the papers. Peter’s eye twitched a little, and he glared at the ceiling.\n“I can help with this stuff. What are you having trouble with?” Steve asked, stepping forward and offering Peter a hand. Peter chewed on his lip before ceding with an exhale and letting Steve help him up.\n“I get the basics, I just can’t keep track of the dates. And who started what, where, and why.”\n“Alright,” Steve said. “Is memorizing things usually difficult for you?”\n“No!” said Peter, slightly frustrated. “It just won’t stick. I don’t know why.”\nSteve put a hand to Peter’s forehead, and Peter jumped.\n“What’re you doing?”\n“Making sure you’re not sick,” Steve said lightly. “That can make memorization difficult.”\n“I’m not sick.” Peter sounded a bit defensive. He stepped forward and started shuffling through his papers.\n“Have you slept enough?”\n“I’m fine, Steve. I just need to pass the damn test.” Peter rubbed his forehead. “Sorry, I’m sorry. That was rude.”\n“Don’t worry about it.” Steve reached out and gripped his shoulder, steering him towards his bed. Peter didn’t register the fact that he’d moved until he found himself lying down; Steve was pulling blankets over him. \n“What- Steve, I have to study!” Peter tried to get up, only to be pushed back down by Steve. \n“To study, you need to be well-rested. Take a nap, eat dinner, then I’ll help you study.”\n“But-”\n“I’ll sit on you,” Steve threatened, looking half-serious. “Sleep, Peter.”\nPeter yawned in spite of himself, then frowned. “That wouldn’t stop me, y’know.”\nSteve raised his eyebrows. “I’m pretty heavy.”\n“I lifted part of a building.”\nSteve’s face went hard and soft at the same time. He didn’t reply, just tucked the blankets under Peter’s chin and straightened up, an unreadable expression on his face through Peter’s droopy eyes. He headed for the door, and Peter’s eyes fell shut. He was asleep before Steve had left the room.\n----\n“Peter. Wake up, kid.” Tony’s voice was uncharacteristically gentle as Peter blinked himself into a state of relative consciousness. \n“Huh?” He sat up, scrubbing at his eyes. “Wha’ time is it?”\n“Six thirty. Time for dinner. You feeling alright?”\n“Feeling- yeah! I feel fine.” Peter scrambled to his feet, nearly tripping over his blankets. He straightened his rumpled clothes and ran his fingers through his hair. “What’s for dinner?”\n“Grilled cheese. The fancy kind that Barnes makes.”\n“Mm. I’m starving.” Peter made for the door, but Tony grabbed the back of his shirt.\n“You’re sure you’re okay?”\n“I’m fine,” Peter said, slightly confused. “I’m not sick or anything, I was just a little tired.”\nTony released him. “Alright, kid. Let’s get you fed.”\nThey headed out to the elevator; almost everyone was already in the dining room when they arrived. \n“There’s the baby,” Clint said, messing with Peter’s hair as he sat down.\n“I’m not a baby,” Peter grumbled, but it held no heat. He piled grilled cheese sandwiches onto his plate and dug in, his mouth bulging with huge bites. “God, theth are delithiouth.”\n“Confirm,” said Natasha, and her eyes twinkled as Bucky glared at her.\n“You’re the worst,” he muttered.\n“Confirm,” Clint said. Bucky huffed and took a bite of his sandwich. \n“Thankth for the grilled cheethe,” said Peter, his mouth stuffed. A hint of amusement flashed across Bucky’s face.\n“Don’t talk with your mouth full,” Pepper reprimanded. Peter ducked his head.\n“Thorry.”\n“You let me talk with my mouth full,” Clint said. “I’m offended on Peter’s behalf.”\n“Thanks, Clint.” Peter grinned. Pepper rolled her eyes.\n“Clint, I’d have send you to etiquette class years ago if I had any control over you.”\n“You could blackmail him,” Tony said. “That might work.”\nPepper brightened. “Anybody know his deepest, darkest secrets? Natasha?”\n“I know a few,” Natasha said. “The first being that he still has his-”\n“Nat!” Clint squeaked. “You promised not to tell!”\n“Will you go to etiquette class?”\n“No!”\n“He still had his te-”\n“Fine!” Clint said, throwing his hands up. “Fine. I’ll go to etiquette class. But that was cruel.”\n“Confirm,” Natasha said, throwing a glance at Bucky, who planted his face on the table with a thud.\n“Stop teasing him,” Steve scolded. “If you tease him, he’ll never make any of you grilled cheese or cookies again.”\n“Now that’s a threat. Wow,” Tony said. “All of you shut up.”\n\n\n\n\n\n\n\n\n\n\nBucky lifted his head and smirked faintly before taking another bite of sandwich. Peter finished his food in record time and reached for seconds, but none were left. Nobody seemed to have noticed his aborted movement, yet he found half a sandwich on his plate when he looked down after listening to Clint and Steve argue over country music. He scrunched his eyebrows, and he found Bucky watching him when he glanced back up. Bucky gestured for him to eat. Peter opened his mouth to argue, but Bucky fixed him with a terrifying glare and he quickly dropped his eyes, taking a bite of the half-sandwich. When he looked up a second time, Bucky was gone. Peter sat in confusion for a few moments before tuning in to the conversation, which consisted of Tony aggressively insisting that Clint’s taste in music was trash and should never be trusted. This lasted five minutes before Clint argued that at least his taste in clothing was better than Tony’s; Tony firmly disagreed. After five minutes of that, they moved on to teasing Steve about his old suit and how he looked like a floppy baby penguin, at which point Peter heard something drop onto his plate. He jumped, surprised to find two more grilled cheeses in front of him.\n\n\n“Didn’t mean to scare you,” Bucky said almost inaudibly. “Careful. Those are hot.”\n\n\n\n\n“Thanks,” Peter said. “Did you just make these? You really didn’t have to do that.”\n\n\n\n\nBucky shrugged. “Forgot you eat as much as Steve.”\n\n\n\n\n“I mean, I don’t have to. I was mostly full. I’m sorry you had to do extra-”\n\n\n\n\n“I like to cook,” Bucky grunted. “No hardship.”\n\n\n\n\n“Thanks. Thank you.”\n\n\n\n\nBucky nodded. Peter wolfed down his new sandwiches, then took his plate to the kitchen. Steve followed.\n\n\n\n\n“Feeling better?”\n\n\n\n\n“Yeah,” Peter admitted. “Thanks.”\n\n\n\n\n“You’ve got to take care of yourself, kid. Get enough sleep and all that.”\n\n\n\n\n“I know.” Peter looked at the ground, shuffling his feet. Steve clapped a hand on his back.\n\n\n\n\n“Ready to study?”\n\n\n\n\n“Ready.”\n\n\n\n\n----\n\n\n\n\n“Can we start with dates?” Peter asked.\n\n\n\n\n“Alright,” Steve said. “When did World War II begin?”\n\n\n\n\n“1939. Um… September 1st?”\n\n\n\n\n“Correct.”\n\n\n\n\n“What was it like?” Peter asked, slightly hesitant.\n\n\n\n\n“There was a whole lot of not knowing what would happen next. I don’t think anyone really expected it. I mean, there was the threat of war, but nobody thought ‘oh, this is the start of a world war.’ It was just gradual, until it wasn’t. People getting called to fight. War being the sole focus. Rations, fear, Pearl Harbor…” Steve shrugged. “Speaking of which, when was Pearl Harbor?”\n\n\n\n\n“1941. December…” Peter chewed his lip. “December… Early December.”\n\n\n\n\n“The seventh.”\n\n\n\n\n“December seventh.”\n\n\n\n\nSteve gave him a soft smile. “How about the Battle of Midway?”\n\n\n\n\n“It was in 1942. In June, I think.”\n\n\n\n\n“Right. Why was it important?”\n\n\n\n\n“Most of the Japanese aircraft carriers got destroyed.”\n\n\n\n\nSteve nodded. “And what do you know about the battle of Kursk?”\n\n\n\n\n“It happened in 1943. It was an air strike? With the Russians against the Germans?”\n\n\n\n\n“Almost. It was a tank battle, but there were forces in the air as well. It’s considered one of the greatest tank battles of the war.”\n\n\n\n\n“Oh.”\n\n\n\n\n“You were close,” Steve said. “Don’t be so hard on yourself. You’re doing well. What happened on June 6, 1944?”\n\n\n\n\nPeter looked up. “D-day, right?”\n\n\n\n\n“Right.”\n\n\n\n\n“The Allies invaded France. They took back Paris a couple months later.”\n\n\n\n\n“And what happened at the Battle of the Bulge?”\n\n\n\n\n“The Germans staged an attack and lost.”\n\n\n\n\n“Good. What army crossed the Rhine in 1945?”\n\n\n\n\n“The US Third Army. Under General Patton.”\n\n\n\n\n“And what happened next?”\n\n\n\n\n“Hitler committed suicide. The Germans surrendered. The US bombed Japan. The war ended.”\n\n\n\n\n“You got it.”\n\n\n\n\nPeter nodded. “Can we review it one more time?”\n\n\n\n\n“Sure. When did the war start?”\n\n\nPeter didn’t mean to procrastinate, he really didn’t. They’d been given two weeks to read Fahrenheit 451, and he’d intended to get it done in the first week, but he kept pushing it back and pushing it back until it was the last night and they had an in-class essay to write on it the next morning. A plethora of choice words streamed through his head, and he chose three of the best to mutter under his breath. He was going to need coffee for this. He grabbed the book and hurried up to the kitchen, crossing his fingers that nobody was there at midnight. He was in luck. \nHe tried to make coffee as quietly as possible, wishing he could web the coffee maker and dangle it out the window as it gurgled and poured. He mixed in an appropriate amount of sugar and cream, then sat down on a bar stool and began to read under the dim lights, coffee clutched tightly in hand. It lasted him through the first thirty pages, and he got up to make another. His eyes burned from exhaustion. He hadn’t gotten much sleep the night before, and had been planning on making it up. Plan foiled. \nHe took a sip of the coffee and sat back down, gluing his eyes to the page and reading until he ran out of coffee again. He set his book down and just about jumped out of his skin when he saw Bucky watching him from the doorway. He clutched his chest, breathing hard. Bucky tilted his head.\n“You didn’t notice me.”\n“Obviously,” Peter squeaked.\n“You’re usually more aware of your surroundings.”\n“I was focused.”\n“You’re exhausted. You should be in bed.”\n“So should you,” Peter shot back, plopping his mug under the coffee maker.\nBucky shrugged. “I don’t have school tomorrow.”\n“That’s the point,” Peter sighed. “I have to read this book for tomorrow. If I don’t read it, I’ll get a zero on the in-class essay.”\n“You should’ve done it earlier,” Bucky said.\n“I know,” Peter hissed. Then, more resigned, “I know.”\nBucky watched as Peter picked up his fresh coffee and took a long gulp, wincing at the sharp taste. He returned to his seat, resting his head on his arm for a moment before sitting up straight and picking up the book. Bucky made his way into the kitchen and began shuffling through the cupboards, pulling out ingredients and setting them on the counter. Peter turned around when he started cracking eggs.\n“What’re you doing?”\n“Making cookies.”\nPeter raised his eyebrows. “Why?”\n“So you can eat them.”\n“Really?”\n“No, I’m making cookies to throw out the window.”\nPeter stared at him for a moment before huffing out a laugh. “I thought you were serious.”\n“Get back to work. Maybe I am serious.”\nPeter snapped back around in his seat and continued to read. God, he wanted cookies. His stomach rumbled. A small bowl of chocolate chips was placed in front of him, and he poured them into his mouth like he hadn’t eaten in a week. \n“Thanks,” he sighed.\n“Focus,” Bucky replied. Peter took a sip of coffee and stared determinedly at page 63. He reread the first paragraph five times without absorbing any of it before dropping the book and rubbing aggressively at his eyes.\n“My brain hurts.”\n“Book boring?”\n“I dunno. I’m too tired. Have you read it?”\nBucky shook his head. “It was past my time. Haven’t gotten around to it yet these days.”\n“What’s your favorite book?” Peter asked.\n“Haven’t decided. Read All My Sons by Arthur Miller earlier. Thought it was interesting.” Bucky squinted at him. “Get back to work. You procrastinate, you face the consequences.”\nPeter exhaled. “I know.”\n“You can do it,” Bucky said, suddenly softer. “Go on.”\nPeter picked up the book and forced himself to read, guzzling his coffee like it was his lifeblood. When he ran out, Bucky snatched the mug away and placed it in the sink.\n“That’s enough.”\n“But-”\n“Cookies in five minutes. You’ll live.”\nPeter massaged his temples and looked back to the swimming words. He pushed through to page 85 before he heard to oven open and abandoned the book again.\n“Keep reading,” Bucky said, and he groaned, reaching for the cookies. “They’re too hot.”\n“I don’t care.”\n“Wrong answer. Keep reading.”\nPeter definitely didn’t whimper. He felt a hand ghost across his back and slouched forward, exhausted.\n“Keep pushing,” Bucky said quietly. “Cookies in a minute.”\nPeter propped himself up with his elbow and turned the page. “I should’ve just read the SparkNotes summary.”\n“Building. Define spark-notes,” said Bucky.\n“SparkNotes is a resource intended to assist readers with concise summaries of books. It is not a replacement for the text itself,” JARVIS said.\n“That’s why I’m doing this,” Peter muttered. He let the book fall out of his hands when Bucky placed a plate of cookies in front of him. “Thank you.”\n\n\nBucky watched as Peter gobbled down cookie after cookie, only looking up after he’d eaten almost all of them.\n\n\n\n\n“Crap. Did you want some?”\n\n\n\n\n“Just one.”\n\n\n\n\nPeter pushed the plate over, and Bucky took a cookie. Peter inhaled the last few and brought the plate to the sink, teetering a bit as he walked.\n\n\n\n\n“Go lay down and read,” Bucky told him.\n\n\n\n\n“I might fall asleep.”\n\n\n\n\n“You won’t.”\n\n\n\n\n----\n\n\n\n\nPeter didn’t. Bucky was very talented at pinching toes. Every time Peter’s eyes fluttered, a decent amount of pressure was applied to his big toe, and he squeaked appropriately. Bucky seemed to be a toe-pinching veteran; Peter didn’t have the nerve to ask why. He was pretty sure that the vast majority of Bucky’s past was miserable. Regardless, he kept his focus well enough and only had twenty pages to go by two in the morning. His vision was blurry, and he had to squint to process the words in front of him. His eyelids drooped, and Bucky gave his toe a firm pinch from his seat at the end of the couch.\n\n\n\n\n“Ow!”\n\n\n\n\n“You’re almost done.”\n\n\n\n\nPeter rubbed his eyes and forced them to focus. The last half of an hour felt like torture, and he threw the book on the floor when he finally finished. Bucky gave his toe a rewarding pat. Peter tried to get up, but his head spun and he sat back down with a thump. The couch was so comfy… he could sleep on it, right? He was ninety-nine percent sure that he was dreaming when he felt a metal arm under his knees and a flesh one under his back scooping him up, his head lolling to rest on a well-muscled shoulder as he was carried to the elevator.\n\n\n\n\n----\n\n\n\n\nPeter awoke blearily to his alarm less than four hours later. He squinted around, expecting to see the living room; he was surprised to find himself in his own bed, the covers wrapped warmly around him. He closed his eyes for just a moment before forcing himself out of bed, pulling on clean clothes and heading to the bathroom. He brushed his teeth, used the toilet, and splashed water on his face, wiping it off with a towel. He fixed his hair, cringing at the bags under his eyes upon studying himself in the mirror. Satisfied enough, he hurried up to grab breakfast before he had to leave for school. To his surprise, Bucky was standing in front of the stove, flipping pancakes. Nobody was usually up so early, except for Pepper, but she was always busy. \n\n\n\n\n“Mornin’,” Bucky grunted without turning around. “Your plate’s on the table.”\n\n\n\n\n“Thanks,” Peter said, surprised. “You didn’t have to-”\n\n\n\n\n“I told you last night, kid, I like to cook. Eat the damn food.”\n\n\n\n\nPeter plopped down in his seat, shoveling the pancakes into his mouth, barely pausing to pour syrup on them. “Mmm.” \n\n\n\n\nBucky set another plate down next to him as he gulped down his last bite.\n\n\n\n\n“Are these for me?”\n\n\n\n\n“No, they’re for building.”\n\n\n\n\n“Sergeant Barnes is only joking, Mr. Parker,” JARVIS said. “Though I would delight in a stack of pancakes if I could eat them.”\n\n\n\n\n“So they’re for me?”\n\n\n\n\n“They’re for you.” Bucky rolled his eyes and simultaneously looked fond. It was an odd expression to see, especially on Bucky. Peter didn’t think too much on it though, instead deciding to inhale the second plate of pancakes. \n\n\n\n\n“Thank you,” he said when he finished. “I usually just have cereal.”\n\n\n\n\n“You worked hard last night,” Bucky told him. “Hard work means reward. Keep that in mind today.”\n\n\n\n\nPeter nodded, stacking his empty plates and placing them in the sink. He scooped up his bag and headed for the elevator.\n\n\n\n\n“Thanks, Bucky. Seeya later.”\n\n\n\n\n“Later,” Bucky said, inclining his head.\n\n\n\n\n----\n\n\n\n\nBy lunchtime, Peter was definitely suffering. He was relieved to have gotten the essay out of the way; he did better than he thought he would, but he felt like he was going to fall asleep at any moment. His eyes were burning and his head felt heavy on his shoulders. He didn’t want to go to gym at all next block. Or see Flash. He ran his fingers through his hair, then forced himself to sit upright so he didn’t faceplant in his half-eaten nachos. \n\n\n\n\n“Peter?” \n\n\n\n\n“Huh?” Peter jerked his head up to find the principal’s secretary standing behind him.\n\n\n\n\n“Peter didn’t do it,” Ned said. \n\n\n\n\n“Do what?” the secretary squinted at him, somewhat suspicious now.\n\n\n\n\n“Whatever you’re about to give him detention for?” Ned sounded unsure.\n\n\n\n\n“I’m not giving him detention,” the secretary huffed. “Though maybe I should give you one. Peter, someone’s here to take you to a doctor’s appointment. He said you forgot about it. He’s very menacing and I’d suggest that you get moving.”\n\n\n\n\n“A doctor’s appointment?” Peter said dumbly.\n\n\n\n\n“Yes,” the secretary replied, impatient. She flapped her hands, and Peter stood up, swaying a bit before he steadied himself and picked up his backpack. He tossed the remains of his lunch in the trash on his way out of the cafeteria, giving Ned and MJ a small wave. When he got the the main office, the last person he expected to see was standing by the door.\n\n\n\n\n“Bucky? What-”\n\n\n\n\n“We’re late,” Bucky said briskly. “C’mon.”\n\n\n\n\nHe steered Peter through the front doors and down the steps onto the sidewalk, slowing his pace as they retreated from the school.\n\n\n\n\n“How come-”\n\n\n\n\n“Hard work means reward. You read the book, you wrote the essay. Now you get to go home.”\n\n\n\n\n“You- How- What? I don’t have a doctor’s appointment?”\n\n\n\n\n“Why would you have a doctor’s appointment.”\n\n\n\n\n“Oh,” Peter said weakly. “Yeah. Thanks.”\n\n\n\n\nBucky shrugged. “You just had gym and a study hall left. We have motivational Steve at home. No need for gym class version.”\n\n\n\n\nPeter snorted. “Those videos are ridiculous.”\n\n\n\n\n“They really play them in your school.”\n\n\n\n\n“All the time,” Peter groaned. Bucky’s lips twitched. He watched as Peter yawned, almost tripping over a crack in the sidewalk. \n\n\n\n\n“You look terrible.”\n\n\n\n\n“Thanks,” Peter said. “You kinda do too. How much sleep did you even get?”\n\n\n\n\n“Two point three hours.”\n\n\n\n\n“How? How are you functioning? I feel like death.”\n\n\n\n\n“I’m used to functioning on little to no sleep.”\n\n\n\n\nPeter tilted his head, studying Bucky, who shoved his hands deeper in his pockets.\n\n\n\n\n“But you don’t seem dizzy or tired at all.”\n\n\n\n\n\n\n“Used to it.”\n\n\n\n\n\n\n\n\n“When was the last time you slept enough?” Peter asked, curious now.\n\n\n\n\n\n\n\n\n“With or without sedatives.”\n\n\n\n\n\n\n\n\n“Both?”\n\n\n\n\n\n\n\n\n“Almost got cut in half last year. Required heavy sedatives to undergo medical treatment and recover. Without sedatives… a long time.” Bucky’s voice cracked slightly. Peter stared at him.\n\n\n\n\n\n\n\n\n“That… That sucks, man. I’m sorry.”\n\n\n\n\n\n\n\n\n“That’s life.”\n\n\n\n\n\n\n\n\nPeter yawned again, scrunching up his face. He stumbled, and Bucky caught him by the handle on his backpack and pulled him back upright.\n\n\n\n\n\n\n\n\n“Almost there,” Bucky said. Sure enough, the entrance to the tower was just a block away, and Peter wanted to collapse when they finally entered the lobby. He dragged himself into the elevator and leaned against the wall, closing his eyes as they shot upwards. When he opened them, Bucky was shepherding him out of the elevator and into his room. He dropped his backpack and flopped onto his bed; Bucky tucked the covers neatly beneath his chin and stepped back. \n\n\n\n\n\n\n\n\n“I’ll make you cookies when you wake up.”\n\n\n\n\n“Peter,” Tony said, waiting until Peter had a mouthful of potatoes. “I got a call from your school today.”\nPeter almost choked. Clint thumped his back sympathetically as he coughed. \n“What?” he wheezed, his eyes watering. “I haven’t gotten detention this month.”\n“Good for you,” Steve said, smiling. Pepper frowned.\n“No. Well, yes, but he shouldn’t ever be getting detention.”\n“Your standards are too high,” said Clint. Pepper flicked his ear, and he yelped.\n“Anyway,” Tony said. “They were wondering why we haven’t signed up for any parent-teacher conferences.”\n“Conferences?” Natasha suddenly looked interested. “I’ll go.”\n“I want to go!” Clint said.\n“I’d like to go,” said Steve. \n“I’m going.” Tony crossed his arms. Peter hid behind his hands.\n“Peter?” Steve prompted.\n“I knew this would happen,” Peter mumbled.\n“So you conveniently forgot to tell us?”\n“No… Maybe.”\n“Why?” Tony asked.\n“I dunno.” Peter fixed his gaze firmly on his potatoes.\n“You don’t want them to embarrass you,” Bucky said. Peter’s silence was his downfall.\n“We’re not embarrassing!” Clint exclaimed. “We’re super cool!”\n“I’d be embarrassed by Clint too,” Natasha said. “But he’s not going, so you don’t have to worry about that.”\n“Hey! I’m totally-”\n“You’re not going,” said Pepper. “Tony and Steve are going, because even though Natasha and Bucky would do a better job, Tony and Steve are insufferable idiots who can’t stand the thought of missing out on something fairly trivial in the scheme of things.”\n“Conferences aren’t trivial!” Tony argued. “They’re very important. Peter agrees.”\n“Don’t form Peter’s opinions for him,” Pepper scolded. “He’s at an impressionable age.”\n“I’m not impressionable,” Peter said.\n“Yes you are,” everyone chorused.\n“Fine,” Peter sighed. “Just… don’t go all… y’know.”\n“We’ll behave,” Steve promised. Tony held up his hands.\n“Don’t put words in my mouth, Steve.”\n“Yeah, he’s at an impressionable age,” Clint said. Tony sulked as everyone laughed at him.\n“Whatever. I scheduled conferences with your chemistry teacher and your history teacher for tomorrow afternoon. You’d better patch up your selective memory, kid.”\n“Sorry, Tony.”\nTony waved the apology away. “Tell us next time.”\n“Alright.”\n----\nThe next day, after chemistry class, Peter’s teacher pulled him aside. \n“I don’t appreciate you wasting my time with practical jokes, Mr. Parker.”\nPeter stared at him, confused.\n“I’m not going to sit in an empty classroom after school today and wait for Tony Stark and Steve Rogers to show up for a conference. I don’t fall for things like that.”\n“It’s not a joke,” Peter said.\n“Nice try, Mr. Parker. Don’t think I won’t be sending an email to your parents about this.”\nPeter opened his mouth to argue, then closed it. There was no point. He shrugged, making for the door.\n“There are better ways to get attention,” the teacher told him as he left. He gritted his teeth, shoving his hands in his pockets as he headed for his English class.\n----\nWhen he got back to the tower, he was surprised to find Natasha, Bucky, Pepper, and Clint waiting outside when he stepped out of the elevator into the hall. His eyebrows pinched together, and he blinked.\n“Welcome home,” Clint said cheerfully, fluffing his hair.\n“What are you guys doing here?” he asked.\n“We’re having a party in your room.”\nPeter was arrantly confused. “Why?”\n“You’ll see,” Pepper said, her smile slightly impish. Peter rarely saw the look on her; she was usually the responsible one. It made him increasingly curious.\n“C’mon,” said Natasha, waving everyone toward Peter’s room. Peter opened the door, letting everyone in. Clint flopped onto the bed, Pepper took the desk chair, and Natasha sat cross-legged on the carpet. Bucky scanned the room, then lowered himself into a bean bag in the corner. Peter plopped down on the fluffy carpet, tossing his backpack aside. \n“What are we doing?”\n“Having a party!” Clint repeated.\n“What kind of party?” asked Peter.\n“A listening party,” Natasha said airily.\n“So… music?”\n“Nope!” Clint grinned. “Is it almost time?”\n“Ten minutes,” Pepper said. \n“We could turn it on early,” said Natasha, glancing at Bucky, who nodded. He pulled out his phone, tapping at it until Steve’s voice filtered clearly into the room.\n“... is ridiculous, we’ve passed these lockers already!”\n“All the lockers look the same,” came Tony’s voice. “They’re probably different ones.”\n“No, they’re the same! We must not have seen it. Let’s go back.”\n“Let’s not.”\n“We can ask the secretary for help,” Steve said.\n“We’re not asking for help. It can’t be that hard to find a fucking classroom.”\n“It is that hard! See, that’s the gym! There’s the entrance! We’ve made a big loop!”\n\n\n“Maybe it’s a different gym,” Tony huffed. Peter covered a snort. Everyone looked extremely amused.\n\n\n\n\n“We’re going to be late if we don’t ask! We can’t be late to the conference!” Steve was probably wringing his hands. Tony made a sound of annoyance.\n\n\n\n\n“Calm down, Steve. We’ll find the damn room.”\n\n\n\n\nSteve muttered something unhappily, and the two men fell into silence.\n\n\n\n\n“How is it doing this?” Peter asked, gesturing to Bucky’s phone.\n\n\n\n\n“Bugged,” Bucky answered.\n\n\n\n\n“You bugged Steve? How?”\n\n\n\n\n“It’s not hard. Just stuck it on his clothing.”\n\n\n\n\n“Don’t give Peter any ideas,” Pepper said. \n\n\n\n\n“I wouldn’t bug any of you,” said Peter. “Probably. I mean, unless I had a good reason for it.”\n\n\n\n\nClint laughed, but cut himself off when Tony’s voice came through the phone’s speakers.\n\n\n\n\n“Found it! Room 162. Suck it, Rogers!”\n\n\n\n\n“We’re in a school!” Steve hissed. “Don’t say that!”\n\n\n\n\nThere was a faint squeaking noise that sounded like a door; the two of them presumably filed inside.\n\n\n\n\n“I’m assuming we’re in the right place and you’re Peter’s chemistry teacher?” said Tony. The teacher didn’t reply, and Clint grinned.\n\n\n\n\n“I bet he’s speechless,” he mouthed. Natasha looked pleased.\n\n\n\n\n“H- Y-yes, I’m… You’re Tony Stark! And Captain America!”\n\n\n\n\n“Nice to meet you,” Steve said pleasantly. “What did you say your name was?”\n\n\n\n\n“Michael Hayes… It’s- What a surprise… I-” Mr. Hayes faltered, stumbling over his words before evidently composing himself. “It’s a pleasure to meet you. Please, sit down.”\n\n\n\n\nPeter snickered a bit, and Pepper clasped her hands together in amusement. \n\n\n\n\n“If only we had cameras,” Clint whispered.\n\n\n\n\n“If you’d given me more time…” muttered Bucky. “A few more hours…”\n\n\n\n\n“Next time,” Natasha said. Peter’s face lit up.\n\n\n\n\n“Next time? There’s gonna be a next time?”\n\n\n\n\n“More likely than not,” Clint told him.\n\n\n\n\n“...can talk about Peter’s academic performance,” Mr. Hayes was saying. “Overall, as you can see, he scores well on his tests but, his grade isn’t as high as it could be. He misses homework assignments as often as once a week, and his focus in class had been lacking. His participation-”\n\n\n\n\n“He’s bored,” Tony interrupted.\n\n\n\n\n“Tony!” hissed Steve.\n\n\n\n\n“What? He is! The kid’s brilliant, I don’t blame him for not paying attention. Lemme see those tests… Look at this, Steve! Redox reactions? He could do this in his sleep!”\n\n\n\n\n“Tony!”\n\n\n\n\n“I’m just telling the truth, Steve! If you want Peter to pay attention, you have to challenge him. Why isn’t he in AP Chemistry?”\n\n\n\n\nClint clapped his hands together, trying not to laugh. Peter’s cheeks were pink.\n\n\n\n\n“This is AP Chemistry, Mr. Stark. I think that as a… guardian, you see Peter in a different light than some of his teachers do. In my opinion, he hasn’t displayed much-”\n\n\n\n\n“He passes his tests, doesn’t he?” said Tony, sounding furious.\n\n\n\n\n“He does. His scores are exceptionally high,” Mr. Hayes admitted. “But that could be because-”\n\n\n\n\n“Peter does well on tests because he’s an extremely intelligent young man,” Steve said, his voice low. “Sorry, but for a moment there it sounded like you were implying that he’s been cheating.”\n\n\n\n\n“I-”\n\n\n\n\n“You aren’t thinking that, are you?” Tony asked, aggravation bleeding though his polite facade. “You seemed very reasonable when we sat down.”\n\n\n\n\n“No, I didn’t mean… I’m sure that there’s no cheating going on.”\n\n\n\n\n“Good. I’m glad we’re on the same page. Anything else you need to tell us about?”\n\n\n\n\n“N-no. Not that I can think of.”\n\n\n\n\n“I really appreciate you taking the time to meet with us,” Steve said, his voice slightly gritted but even. “I’m glad we cleared things up.”\n\n\n\n\n“Yes, yes, it was good to-”\n\n\n\n\nThere was a loud screeching sound, and everyone winced. It sounded like a chair being pushed back. Steve sighed.\n\n\n\n\n“Have a nice evening,” he told Mr. Hayes. The door creaked, and as soon as it clicked, Steve started on Tony. “You’re impossible! At least pretend to be nice! You can’t just interrupt the man-”\n\n\n\n\n“You did it too,” Tony shot back. “He was a dickwad, I’m not going to act like that’s okay. Can you believe his nerve? He said-”\n\n\n\n\n“I heard him. But Tony, you have to-”\n\n\n\n\n“I don’t have to do shit! I didn’t like his implications, that man deserved-”\n\n\n\n\n“See? You can’t say things like that! We’re in a school!”\n\n\n\n\n“I don’t give a fuck, Steve! I won’t have him talking about Peter like that!”\n\n\n\n\nSteve took a sharp breath, but didn’t speak. His exhale ruffled the microphone, and the sound of his heavy footsteps echoing in the hall died off.\n\n\n\n\n“We’ve got another meeting, c’mon,” Tony said, his voice quieter from the distance that had increased between him and Steve. Peter held his breath.\n\n\n\n\n“I know,” Steve muttered. “I just… I was as pissed as you were.”\n\n\n\n\n“I can’t believe Peter puts up with him every day,” Tony replied after a moment.\n\n\n\n\n“Yeah.” Steve huffed out an empty laugh. “Jesus. Sorry. Cheating.”\n\n\n\n\n\n\n“School is bullshit,” Tony said. “C’mon. We’ve got places to be.”\n\n\n\n\n\n\n\n\nThe footsteps picked back up, and Peter breathed again. \n\n\n\n\n\n\n\n\n“We would’ve been so much better, Barnes,” Natasha sighed. “We should go to the next one. Tie up the losers so they can’t.”\n\n\n\n\n\n\n\n\nBucky shook his head. “Goes against mission protocols.”\n\n\n\n\n\n\n\n\n“Does it?”\n\n\n\n\n\n\n\n\nBucky looked at Natasha like she was stupid. “Mission, protect. Tying up Steve would likely harm more than protect.” He paused. “Though I’ve wanted to. He’s impossible.”\n\n\n\n\n\n\n\n\n“I’ll agree with you on that,” Natasha said. “Clint, would you tie up Tony and Steve with me?”\n\n\n\n\n\n\n\n\n“Would I get to go to the conference?” asked Clint, his eyes twinkling.\n\n\n\n\n\n\n\n\n“No.”\n\n\n\n\n\n\n\n\n“Then no. Sorry.”\n\n\n\n\n\n\n\n\nNatasha frowned, then looked up. “Pepper?”\n\n\n\n\n\n\n\n\n“I’ll think about it.”\n\n\n\n\n\n\n\n\n“That’s not a no,” said Natasha. She seemed pleased. Pepper shifted her eyes over to Peter.\n\n\n\n\n\n\n\n\n“Enjoying yourself?”\n\n\n\n\n\n\n\n\nPeter nodded, his eyes slightly wide. “Do you guys do this often?”\n\n\n\n\n\n\n\n\n“No. Well, not anymore, in Bucky’s case. He used to have most of Steve’s clothes bugged.”\n\n\n\n\n\n\n\n\n“Really?”\n\n\n\n\n\n\n\n\nBucky shrugged. “Mission is protect. Pre-contact, I used bugs.”\n\n\n\n\n\n\n\n\n“Pre-contact?” Peter repeated.\n\n\n\n\n\n\n\n\n“Bucky was a creepy stalker,” said Clint, smirking.\n\n\n\n\n\n\n\n\n“Unlike most stalkers, he had good intentions,” Natasha replied.\n\n\n\n\n\n\n\n\n“Fair enough.”\n\n\n\n\n\n\n\n\nPepper hushed them; Steve had started talking.\n\n\n\n\n\n\n\n\n“... Rogers, nice to meet you.”\n\n\n\n\n\n\n\n\n“It… it is an honor, Captain Rogers… Really, I… And Mr. Stark, I can’t believe… It’s really such a pleasure.”\n\n\n\n\n\n\n\n\n\n\nChairs scraped the floor; Peter guessed that they were sitting down. There was a faint rustling noise that sounded like paper.\n\n\n\n\n\n\n\n\n\n\n\n\n“These are Peter’s unit tests and major writing assignments from the year so far. He’s in the A to B range, which is perfectly acceptable. He generally meets expectations and has exceeded some. He does seem to have trouble paying attention sometimes, but his grade doesn’t generally suffer for it. I’ve noticed that he has an impressive memory, especially for a child his age. When he puts in adequate thought, his analyzation skills are really spot-on. He’s never disruptful, which I appreciate. Overall, I’d say he’s a strong student and a pleasure to have in class.”\n\n\n\n\n\n\n\n\n\n\n\n\n“That’s good to hear,” Tony said. “He’s a smart kid. We’re proud of him.”\n\n\n\n\n\n\n\n\n\n\n\n\n“As you should be. He did especially well on his last test for our unit on World War II. I imagine he had some excellent primary sources to help with that?”\n\n\n\n\n\n\n\n\n\n\n\n\n“I’d say he has an advantage in that particular field with me around,” said Steve. “I’m guessing he didn’t mention it, though.”\n\n\n\n\n\n\n\n\n\n\n\n\n“He didn’t.”\n\n\n\n\n\n\n\n\n\n\n\n\n“He doesn’t like drawing attention to himself,” Tony said. “I think that’s understandable.”\n\n\n\n\n\n\n\n\n\n\n\n\n“Certainly. I’ve noticed that he’s generally pretty quiet.”\n\n\n\n\n\n\n\n\n\n\n\n\n“Have you noticed other kids bothering him?” Steve asked.\n\n\n\n\n\n\n\n\n\n\n\n\n“Bothering him, not much. Not in this class, anyway. He doesn’t talk to many of his peers, but he seems to avoid some more than others. The rowdier ones.”\n\n\n\n\n\n\n\n\n\n\n\n\n“Can you let us know if that changes? If anything happens?” Tony cleared his throat. “Sometimes it feels like he doesn’t tell us everything.”\n\n\n\n\n\n\n\n\n\n\n\n\n“Few teenagers do. I’ll send you an email if I see anything specific.”\n\n\n\n\n\n\n\n\n\n\n\n\n“Thank you. We really appreciate you taking the time to meet with us,” said Steve, sounding sincere. \n\n\n\n\n\n\n\n\n\n\n\n\n“Of course. It was quite a pleasure to meet the two of you.”\n\n\n\n\n\n\n\n\n\n\n\n\nBucky disconnected his phone and set it down after they heard the classroom door click. Peter was sitting with his mouth slightly agape, cheeks flushed. \n\n\n\n\n\n\n\n\n\n\n\n\n“Got any bullies you want to tell us about, kid?” Clint asked. Peter shook himself.\n\n\n\n\n\n\n\n\n\n\n\n\n“No, nope! Everything’s fine at school.”\n\n\n\n\n\n\n\n\n\n\n\n\n“Peter,” said Pepper, looking stern. “If people are bothering you, I’d like to know.”\n\n\n\n\n\n\n\n\n\n\n\n\nPeter looked down. “Everything’s fine.”\n\n\n\n\n\n\n\n\n\n\n\n\n“Peter.” Natasha glared ferociously at him. “This isn’t optional. Either you tell us, or we’ll find out.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“It’s really nothing,” Peter insisted. “Just some kids being kids. Everyone gets pushed around in high school.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“You deal with enough,” said Bucky quietly. “You should feel safe at school.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I…” Peter pressed his lips together.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“So you don’t feel safe at school.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“No! I… Flash wouldn’t hurt me, I don’t think.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Flash.” Clint raised his eyebrows. “The kid’s name is Flash.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“No- well, yeah.” Peter looked frustrated. “I mean… I don’t feel unsafe, really.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“What does he do?” Natasha asked. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“He just… bothers me. Insults me, I guess. I think it bothers him that he’s not as smart as he wants to be.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“He’s not as smart as you, so he takes it out on you,” Pepper said.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Well… Sort of, I guess.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Why don’t you do something about it?” Natasha’s voice wasn’t as hard this time.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“It would make it worse. I can’t let him know he bothers me.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“So he does bother you,” Clint said, raising his eyebrows.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I- Yes, he bothers me!” Peter’s voice was high. “But it’s fine! It’s not that big of a deal.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“We won’t make you do anything about it-” Bucky was cut off by Pepper.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“We most certainly will!” \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“We won’t,” Bucky said, giving Pepper a sharp look. “Unless you display signs of emotional distress. Which, by the way, you can not hide from us. Don’t try.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I’m afraid that I am obligated to share this conversation with Mr. Stark,” said JARVIS. “It falls under the harm prevention protocol.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“The what?” \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClint reached over and ruffled Peter’s hair sympathetically. “Sorry, kid. We just care about you is all.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeter made an unintelligible noise and flopped back onto the bed.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Are you freaking out?” Clint sat up and studied him. “Good, not really freaking out. It’ll be fine.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“What if he’s mad?” Peter asked faintly.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“He won’t be,” Pepper told him, sounding sharp. “And if he is, I’ll fix it.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“You’re scary sometimes,” Clint said.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Your girlfriend is a menace too,” Bucky muttered. Natasha looked pleased. She got up from her place on the fluffy carpet and took over the mussing of Peter’s hair. Clint protested, making grabby-hands.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Mine!”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Peter’s hair doesn’t belong to anyone,” Pepper chided. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“But it’s so soft,” said Clint, sounding plaintive. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“You already had your turn,” Natasha told him. “Sharing is caring, or whatever people say.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Did you ask Peter if you could play with his hair?” said Pepper.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Peter, can I play with your hair?” Natasha asked, and Peter laughed in spite of everything. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Is this even real life?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBucky stood up, walked over, and pinched his toe. He yelped loudly.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Real life,” Bucky said. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I mean, yeah… It’s just that the Black Widow just asked if she could play with my hair. And Hawkeye is fighting her for it. And Bucky Barnes just pinched my toe.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Can I?” said Natasha.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Yeah.” Peter sounded vaguely helpless. Natasha offered a vaguely shark-like grin and started running her fingers through his hair. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“How do you get it so soft?” she asked. “Barnes, feel this. We should invite him to join Hair Club.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Can I touch your hair,” Bucky said. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Sure,” Peter squeaked. Bucky reached out with his human hand and brushed his fingers over Peter’s hair. His face turned into something that Peter couldn’t read.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“It is. Soft.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Nice isn’t it?” said Natasha. “Peter, tell us your secrets. Clint, leave. You’re not part of Hair Club. JARVIS, get Hill in here.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Certainly,” JARVIS said. Clint was sputtering unhappily.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Leave? You can’t just kick me out! Injustice! Betrayal!” \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNatasha fixed him with one of her glares™ and he scrambled to his feet, scurrying out of the room.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Bye Peter! Nice spying with ya! Screw the rest of you and your exclusive hair club!”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“You’re scary,” Peter told Natasha. “Also, hair club?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe door opened a moment later, and there Maria Hill stood. “Why are we having an emergency Hair Club meeting in here?” she asked. “Isn’t this the kid’s room?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Hi.” Peter waved from the bed, where Bucky was twisting bits of his hair into curls and Natasha was floofing the rest of it. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“What are you two doing?” Hill asked, bemused.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Soft,” Bucky said. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“What kind of conditioner do you use? I need some,” said Natasha. Peter shrugged.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Just… whatever’s in the shower.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Pepper. Investigate immediately,” Bucky ordered.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Peter, can I go in your bathroom?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Sure.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPepper got up and disappeared into the bathroom. She came back holding a white bottle.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“It’s full volume beauty conditioner,” she announced. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Is it?” said Peter. “I never really looked.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Building, order five bottles. Pay from one of my accounts,” Bucky said.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Done, Sergeant Barnes,” JARVIS replied.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Thanks, building.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Can I feel your hair?” Hill asked Peter.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“You might have to fight Natasha and Bucky.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Guys, can I have a turn?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“No,” Bucky said.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Not a chance,” Natasha added. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Please?” said Hill. Natasha let out an aggrieved sigh, but gave up a third of her portion of Peter’s hair. Hill’s eyes widened when she felt how fluffy it was.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Wow. Peter, would you like to join Hair Club?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“What exactly is Hair Club?” he asked.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“It’s… it depends. It’s an emotional support group, a hair salon, and a place to gossip, sometimes all at once,” Pepper told him. “To join Hair Club, you have to have nice hair and be sensitive to other people’s emotions. You qualify.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I… I do?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Yes,” Natasha said. “See, Steve’s hair is alright, but he’s terrible with emotions. Same with Tony. And Clint. Bruce is alright with emotions, but his hair isn’t on par. You have both.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I’m not that great with emotions,” Bucky mumbled.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“You stunning hair makes up for it,” Hill said, smiling. “I brought supplies. I call trying to braid the kid’s hair.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBoth Bucky and Natasha protested, but finally ceded to Hill’s crossed arms and severe looks. They were almost as scary as Natasha’s, possibly even more, depending on the lighting. Hill sat down and separated tiny strands of Peter’s hair, carefully plaiting them together and tying them off with little rubber elastics. It was surprisingly relaxing, Peter decided, his eyes drooping a little as he watched Pepper teaching Bucky an elaborate braid on Natasha. The door swung open and Peter jumped, his hair sliding from Hill’s fingers.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“What are you all doing?” Tony asked, squinting at them. “Peter, what the hell did they do to your hair?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I’m braiding it,” Hill said. “What are you doing here?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I’m here to talk to Peter? Why are you all in here?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Hair Club,” said Natasha. “Peter’s the newest member.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“That’s nice. Can you all leave? I need to talk to Peter.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Can they stay?” Peter asked. Surprise flashed across Tony’s face before he schooled it back to a frowny side of neutral. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Are you sure?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeter nodded.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Alright,” Tony said, shrugging. “Suit yourself.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHe took a seat in the desk chair that Pepper had vacated and spun it to face Peter.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“JARVIS played you the clip?” Peter asked. Tony looked surprised again.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“How do you know about that?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“JARVIS told me. Also, harm prevention protocol?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“JARVIS!” Tony sounded irritated. “Why did you tell the kid?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I determined that Mr. Parker would be calmer and therefore more willing to talk if he knew, sir.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Fair enough. Whatever.” Tony laced his fingers together. “So Flash, huh? How often does he bother you?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeter shrugged.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“How often doesn’t he bother you?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeter played with the hem of his shirt.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Give me something, kid.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“It’s fine, Tony. He just says stuff. I’ll tell you if it gets worse.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Will you?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeter bit his lip.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Listen to me. I know I’m not the best example, but it’s not good to bottle things up. You have to talk to people, kid. For your wellbeing. Your happiness.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeter was silent.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“He thinks he deserves it,” Bucky said quietly.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“What do you mean, Barnes?” Tony’s voice was dangerous.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“He thinks he deserves to be bothered.” \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“That’s bullshit. Peter, you don’t fucking deserve-”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Language,” Pepper interjected. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I don’t give a shit, Pepper. Kid, you don’t fucking deserve to be bullied or bothered or insulted, and if you think that you do, we have a fucking problem here. Do you understand?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeter nodded, his mouth dry. He suddenly realized that he was pressed against Hill and scrambled forward, apologizing profusely. She caught him by the shoulder before he could get away and sat him back down in front of her, continuing to braid. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I’m sorry,” he said again, this time directed at Tony, who exhaled.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“You don’t have to apologize. You just… You can’t think that you deserve that. Why do you think you deserve it?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeter twisted his blanket beneath his fingers. “I mess everything up.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Your guilt complex is worse than I thought,” said Natasha.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“You don’t mess everything up,” Pepper added. “You try your best to do the right thing, and that’s what matters. It’s not your fault if things go wrong.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“It is,” Peter murmured. “If I’d just do things better, less people would get hurt. Less people would die.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Nobody’s ever died because of you, Peter,” Tony said, his voice low. “You always do the best that you can. If people die, it’s terrible, but you can’t beat yourself up for something you can’t change.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“But if I was better…”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Are you thinking that you’re not good enough? You’re definitely good enough, Peter,” said Hill. “You’re more than good enough. Think about how many people you’ve saved.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“But there’s people that I couldn’t.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Peter.” Bucky’s voice was quiet, and everyone turned to look at him. “Do you know how many people I’ve killed?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPeter shook his head.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Me neither,” Bucky whispered. “I can’t even remember some of them. I was wiped. They broke me. And they used me. And I killed. Do you think I should suffer? For what I did.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Of course not,” Peter said. “It wasn’t you.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Should Steve suffer because he couldn’t save me? When I fell?”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“No!”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Then why should you.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“It’s different,” Peter choked. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“How?” Bucky prompted, and tears began to well in Peter’s eyes.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“It just is!”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBucky stood up and Tony tried to stop him, but Natasha grabbed Tony’s ankle and glared. Tony sat back down and watched Bucky step forward, offering his arms out somewhat clumsily. Peter leaned into them, and let out an involuntary sob as he buried his head in Bucky’s shirt.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“We all have our twisted justifications for why we should suffer. We work on them. Try therapy. Hair Club helps. Find what makes you feel safe. Flying Sam helped me with that. We will help you.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhen Peter got back to the Tower after school, he headed straight for the communal kitchen and raided the chips drawer, grabbing a couple bags and sprawling out of the couch. Clint ambled in with Natasha at his heels about ten minutes later; Clint perched himself on the back of the couch while Natasha squished in by Peter’s feet.\n“What’s up, buddy?” Clint asked.\n“Who said anything’s up?” Peter mumbled.\n“You’re eating chips,” said Natasha. “They’re one of your comfort foods.”\nPeter sighed. “We have an actual project for gym class. We have gym homework. Who does that?”\n“That sucks,” Clint said. “What’s it about?”\n“We have to make our own workout video. It has to be five to ten minutes long.” Peter wiped chip crumbs from his hand and ran his fingers through his hair. “I don’t know what I’m gonna do.”\n“What do you need help with?” Natasha asked.\n“I don’t know… I just don’t know how to go about it. Whatever I do, it’ll get made fun of. I don’t see the point.”\nClint stood up, took Peter’s bags of chips, and tugged the boy to his feet. “C’mon. We’re doing gym homework. JARVIS, tell Steve and Hill to meet us in the gym. Barnes can come too if he wants.”\nPeter protested, reaching for his chips, but Clint tossed them onto the kitchen counter and kept pulling him towards the elevator. Natasha followed them, a faint smile on her face. \n“Why… What are you guys doing?” Peter asked, frowning. The elevator doors closed, and Clint let go of his arm. \n“We’re doing your gym homework. It’s gonna be great,” Clint said. Peter looked somewhat alarmed.\n“You guys… want to help me with the video?”\n“Sure we do,” said Natasha. “Steve’s going to be thrilled.”\nThe elevator doors opened a minute later. Steve, Hill, and Bucky were already there; Bucky was perched on top of the climbing wall while Steve and Hill stood in front of a tripod, poking at a camera. Steve looked up, seemingly puzzled.\n“Do any of you know how to work these things?”\n“How did you get here so fast?” Clint asked. “And no, unfortunately not.”\n“We were already down here,” Hill replied. “Peter, can you work a camera?”\n“Yeah,” said Peter, making his way over and fiddling with different buttons. He hadn’t touched a camera in months, but it felt achingly familiar in his hands. “Someone go stand there, I have to focus it.”\nHill stood in the middle of the room and waved at the camera, and Peter adjusted the lense. \n“Does everyone your age just know how do do things like this?” Steve asked, waving a hand at the camera. Peter shook his head.\n“So we’re making a workout video?” Hill called. “Why?”\n“For my gym class,” Peter replied. “You guys really don’t have to help me…”\n“What kind of workout?” asked Steve.\n“Anything. I don’t know what I’m going to do yet.”\n“Brainstorm time,” Clint said cheerfully. “You could do a bodyweight workout, one with free weights, or one with machines. Do you want to do cardio, strength, or a bit of both?”\n“I don’t know… A bit of everything?”\n“How about push-ups, two sets of ten reps? Then sit-ups, three sets of ten reps. Then bench presses, then maybe bicep curls? And finish with the treadmill, increasing speed and incline every minute.”\n“Sounds like a plan,” Natasha said. “Peter?”\n“Uh… Sure!”\n“Alright, go stand in front of the camera,” Clint instructed. Peter made his way to stand next to Hill, who was still in the middle of the room, her eyes on Bucky. She waved, and Bucky inclined his head in return from the ledge he was crouched on. Peter noticed that his shoulders looked tighter than usual, and spared a moment of concern before turning to face the camera. Steve and Natasha were poking at it, confused.\n“Is it on?”\n“I think so, I can see the picture. Is it recording?”\n“Why is this so complicated?”\n“It’s probably fancy,” Clint said. “Here, press the big one on top.”\nNatasha clicked it, and Steve peered into the lense.\n“Can you see me?”\n“I’d be able to see you whether it’s recording or not,” Natasha said. “But I think so. This little light thing is blinking.”\n“Peter, it’s recording!” Steve said. “Do push-ups!”\n“He has to introduce the push-ups first!” said Hill. \n“Really? Yeah, I guess that’s how this works.”\nPeter smiled, amused. He stepped a bit closer.\n“To start, do two sets of ten push-ups.”\n“Don’t forget to drink water!” added Steve, and Hill facepalmed from where she was standing behind Peter.\n“You can’t interrupt him!” Hill called. “Now he has to do it again!”\n“No, keep it!” Clint said. “It was funny!”\n“Also, you’re not much better!” Steve told Hill. “You’re standing in the shot!”\nHill looked from the lense to the ground beneath her feet. “Oops.”\nClint snickered. Hill made her way out of the camera’s view.\n“Now do some push-ups!” Steve said. Peter dropped down and did twenty push-ups, pretending to struggle at the end. Steve threw a water bottle at him, which he caught easily and took a few gulps from. He stepped forward towards the camera again.\n“Next, do three sets of ten sit-ups!”\n“Don’t forget to drink water!” Clint shouted, mocking Steve, who grumbled. Peter swallowed his laughter and dutifully did his sit-ups. Hill leaned in front of the camera and gave a thumbs-up. \n“Time for the bench press,” Steve said. Natasha picked up the tripod and carried it over to the machine equipment, setting it down and stepping aside so Peter could focus it.\n“How much weight should I press?” he asked once he was satisfied with the camera.\n“I don’t know, how much do kids your age usually lift?”\n“We don’t usually use machines in gym class,” said Peter. “I’m not really sure.”\n“How much weight should someone Peter’s age and size lift?” Hill asked. \n“How much can you lift, Peter?” asked Natasha, sounding curious. Peter shrugged, scratching the back of his head.\n“A few tons? I got out of that building.”\n“Building?”\n“Nothing,” Peter said quickly. “I’ll just press… a hundred pounds?” \n“Sure,” said Natasha. “Alright, do the intro part.”\n“Now move on to strength training,” Peter said to the camera. “Use the bench press first, doing three sets of seven reps.”\nNatasha helped Peter load weights onto each end of the bar; Peter reclined on the bench and began his reps. He got through a set and a half before he caught Hill waving her arms out of the corner of his eye.\n“Look more like you’re struggling!” Hill mouthed. Peter nodded slightly and forced his arms to shake a little, breathing harder, like he was lifting a bus instead of a puny bar. 100 pounds was nothing to him. When he finished, he took another drink of water per Steve’s prompting, and they moved on to free weights. It went easily, and afterwards, Clint tried to teach him to juggle with kettlebells. That came to a quick halt when one of the kettlebells went flying at Steve’s head; Steve caught it with a disapproving look.\n“Sorry!” Peter squeaked. \n “Stop goofing around,” Steve scolded. “You’re not done yet. Time for the treadmill.”\nPeter carried the tripod over to the treadmill, looking slightly guilty. Clint held a sheepish grin on his face as he put the kettlebells back. Bucky was glaring daggers at him from his perch. \n“It didn’t hit me, Buck!” Steve shouted. Bucky didn’t seem appeased.\n“To finish, hop on the treadmill. Start at an easy run, and increase the speed and incline until you’re sprinting. Then go back down,” Peter said to the camera. He got on the treadmill and did just that, remembering to pretend he was having a hard time. Hill gave him a thumbs-up. He glanced up at Bucky as he ran; Bucky was still looking at Clint with displeasure. Clint seemed to notice this, drooping a little. \n“He’s still giving me murder eyes from up there,” Clint said.\n“He’ll get over it,” Natasha said. “Just juggle kettlebells somewhere safer next time.”\n“Now I’ll never join Hair Club,” Clint groaned.\n“You never had a chance,” said Hill. “You don’t qualify.”\n“Peter qualifies!”\n“Peter has great hair. Yours is average at best.”\n“Average at best? I take offense to that! I have beautiful hair!” Clint exclaimed. Peter disguised his laugh as a cough and kept running, increasing his pace.\n“Don’t distract Peter,” Steve reprimanded.\n“You think I have nice hair, don’t you?” Clint asked. Steve sighed.\n“I’m not really the best person to ask about style or fashion.”\nPeter watched as Clint trotted over to the wall. \n“Do you think I have nice hair?” he shouted to Bucky, who glared back as lethally as ever. Clint retreated, calling an apology over his shoulder.\n“He’ll forgive you,” Hill said with a smile, patting Clint’s shoulder upon his return. Peter finished his treadmill workout and hopped down before the belt had come to a stop. \n“Let’s go edit the footage,” Natasha said. “Hair Club?”\n“Hair Club,” Peter agreed. Natasha turned and beckoned to Bucky.\n“Hair Club!” she called. Bucky began his his descent and made his way over to where everyone was standing.\n“Sorry Steve almost got hit,” Clint said earnestly. “It won’t happen again.”\nBucky waved him off, edging closer to Steve. It looked like dismissal, but Clint relaxed. They all headed for the elevator; the Hair Club ended up in Peter’s room. Natasha and Hill were looking over Peter’s shoulders at the computer when Pepper showed up with a basket of snacks and assorted items.\n“Why are we meeting today?” she asked, depositing a bag of chips in front of Peter. “I brought everything to cover the bases.”\n“Peter has to do homework and Steve almost got hit in the head with a kettlebell,” Natasha said, stealing some chips from Peter. Pepper nodded and sat next to Bucky. \n“Braids?”\nBucky sank to the floor and let Pepper section off his hair. His shoulders visibly loosened as she wove the strands together. Peter refocused on the computer, nibbling at his lip.\n“What should I cut and what should I keep?”\n“Theoretically, you could keep all of it,” Hill said. “Though I don’t know if you want kids at your school to know about Hair Club.”\n“I don’t,” said Peter. “I’ll just cut that… or maybe mute the audio? That way the video is still long enough.”\n“That’ll work.” Natasha nodded. “Not too hard a project, right?”\n“Yeah. I guess it was the idea of it that was bothering me. I mean, Flash is still going to find something, but it could be a lot worse.”\n“I want to slap that kid sometimes,” Natasha said, “and I don’t even know him.”\n“I want to slap him too,” Peter sighed as he selected the chunk of footage to mute. “Do you think I should add something in the background so it’s not silent?”\n“That’s a good idea,” said Hill. “You could add music, or you could just add treadmill noise.”\n“How would I do that?”\n“Find treadmill noise on YouTube and upload it, maybe?”\nPeter nodded. He found a good clip on YouTube and definitely didn’t illegally download it, patching the audio over the silent chunk.\n“Good enough,” he said. Natasha gave him a congratulatory pat on the back. Pepper plucked a bottle from the basket she brought and waved with her free hand.\n“I brought coconut oil,” she told them. “I’m wondering if Peter’s hair will get any softer.”\n“Not possible,” Bucky mumbled.\n“We’re about to prove you wrong,” Natasha said. She tugged Peter over and sat him next to Bucky, in front of the bed. She and Hill plopped down behind him, opening the coconut oil and beginning to slather it onto his head. He startled at the texture, but relaxed into the feeling of fingers roving through his hair. \nHe yawned, suddenly sleepy. He couldn’t remember the last time he’d felt such… nothing. He wasn’t afraid, he wasn’t upset, he wasn’t elated. It was peaceful. The last thought he remembered having before falling asleep was that he didn’t want the moment to end.\n----\nHe was still sitting on the floor when he woke. He was slumped over, pressed against something warm. The thing shifted slightly, and Peter sat bolt upright. That was a someone he was sleeping on, not a something. His wide eyes fell upon Bucky, who was looking at him with a neutral expression on his face. \n“I- I’m sorry, I didn’t mean-”\n“If Barnes didn’t want you sleeping on him, you would’ve been rudely awakened a long time ago,” Natasha interrupted, brushing a hand over Peter’s shoulder. \n“How long has it been?” Peter asked, rubbing his chest in attempt to steady his heart. \n“Just half an hour,” Pepper told him.\n“Sorry,” he said again. “I didn’t mean to fall asleep.”\n“It’s not a problem,” Hill replied. \n“It’s necessary. To feel vulnerable sometimes,” Bucky added quietly. \n“Let’s rinse your hair,” Natasha said, standing up and offering Peter a hand. Peter took it and let her pull him up, following her into the bathroom. She turned on the sink and fiddled with the tap until she was satisfied with the temperature, then gestured for him to put his head under the faucet. He complied, finding the water pleasantly warm as she washed the coconut oil from his hair. When she finished, she wrapped his head in a towel-turban thingy, which Peter found both fascinating and amusing. They returned to the bedroom, where Bucky looked imploringly at Peter.\n“His hair’s still wet,” Natasha said. “You can’t touch it yet.”\nBucky nodded, his gaze resting on the towel on Peter’s head.\n“This is what excitement looks like on him,” Pepper told Peter. “He really wants to touch your hair.”\nBucky glared at her, but he didn’t look annoyed. “His hair is the softest. Coconut oil makes things softer. I predict mind-melting levels of soft.”\n“Fair enough,” Natasha said. \n“I won’t do a chocolate pudding,” said Bucky. Peter’s forehead wrinkled in confusion. “First time I had it, it was so good I threw it.”\n“So you’re not going to throw me?” Peter said, his face curving into a smile.\n“I won’t,” Bucky confirmed. He tilted his head at Peter. “Do you know how to braid.”\n“No.”\n“Pepper, can we use your hair.”\n“Sure,” Pepper said, moving to sit on the floor in front of them.\n“I don’t think I can do the fancy ones,” said Peter. “They look complicated.”\n“It’s practice,” Bucky told him, combing his fingers through Pepper’s hair before dividing it and showing Peter how to cross them into a braid. “Start simple, like this.”\nHe took out the braid, and Peter tentatively took a turn. He was exceedingly gentle, and Pepper laughed.\n“You’re not going to rip my head off by pulling a little, Peter.”\n“Beauty is pain,” Natasha added cheerfully. Peter tried again, this time pulling the strands more firmly into place. \n“Better,” Bucky said. “Natasha. Do you think his hair is dry.”\n“Give it five more minutes.”\nBucky let out a small sigh that sounded almost petulant, and Natasha laughed. Peter practiced braiding, and Bucky gave him pointers while watching the clock out of the corner of his eye. When five minutes had gone by, Bucky turned to Peter, eyeing the towel on his head again. \n“Go on,” Hill said, waving her hand. Peter tugged the towel off, and Natasha handed him a comb. He ran it through his hair, which glistened under the light. Bucky’s flesh hand twitched.\n“Not yet,” said Pepper. “It’s still a bit damp.”\nBucky let his head drop back against the bedframe, looking somewhat put out. \n“This is like giving a kid a puppy and not letting them pet it,” Hill commented.\n“Does that mean my hair is a puppy?” Peter asked at the same time that Bucky said,\n“Are you calling me a kid.”\n“I like that metaphor,” Natasha said.\n“I am not a kid.” Bucky glared at her. She smiled.\n“Peter, how’s the braiding going?”\n“It could be worse,” Peter said. “The last few actually looked like braids.”\n“He’s doing better than I did,” said Bucky grudgingly.\n“Don’t be so hard on yourself,” Pepper told him. “He has an advantage.”\nPeter opened his mouth to ask, confused, but Natasha nudged his arm lightly. He looked up at her, and she tapped his arm again, looking significantly from Bucky to him. He followed her gaze from Bucky’s metal arm to his own flesh one, and- oh. Braiding with a metal hand was probably pretty difficult. Peter doubted that Bucky could even feel hair with those fingers.\n“We should watch cartoons,” Hill said. “My vote’s on Bob’s Burgers.”\n“I second that,” said Natasha. \n“I’m indifferent,” Pepper announced. Bucky nodded in what seemed like agreement. \n“Peter?” Hill said.\n“Whatever you guys want.”\nHill grinned. “Bob’s Burgers, then. Here, pass your laptop.”\nPeter got up and grabbed his laptop from his desk, opening it and handing it to Pepper, who gave it to Hill.\n“Let’s hope there’s nothing embarrassing in your browser history,” Natasha said cheerfully. Peter’s cheeks turned pink, and he shook his head.\n“There isn’t.”\n“You’re a teenage boy,” said Pepper. “Of course there is.”\n“There isn’t,” Peter insisted. “I wouldn’t put poor JARVIS through that.”\n“How very considerate, Mr. Parker,” JARVIS said, sounding as warm as an AI could.\n“You’re such a good kid,” said Natasha, tousling his hair. Her eyes widened. “Wow. Soft.”\nBucky almost shoved her out of the way, his hand hovering above Peter’s head.\n“You can touch it,” Peter told him. He carded his fingers through Peter’s hair, his face melting into an expression that Peter hadn’t seen on him before.\n“Adding this to the good list.”\n“That’s good, Barnes,” Pepper said fondly. Bucky nodded.\n“Peter’s hair is a mission-assist?” Natasha asked, and Bucky gave her an unimpressed look. \n“Peter’s hair is not sentient.”\n“But it’s alive,” Hill pointed out.\n“But not sentient. It is not a mission-assist. Peter is a mission-assist.”\nPepper nudged Peter. “You’re a mission-assist!”\n“A friend,” Natasha clarified, and Peter’s face stretched into a smile.\n“You’re my friend, too,” he said to Bucky.\n“This is so wholesome,” said Hill. “Which episode do you guys want to watch?”\n“The one with the boy band,” Pepper said.\n“Objections?” Hill looked around. Upon hearing none, she pressed play and set the laptop in front of them. Bucky hadn’t taken his hand out of Peter’s hair; Peter didn’t mind. His eyes grew heavy for a second time, and his head lolled to the side before he snapped it upright.\n“Did you sleep enough last night?” Pepper asked softly.\n“Sort of,” Peter mumbled. “Couldn’t really turn my brain off.”\n“Rest,” Hill said. “We’ll wake you up for dinner.”\n“I don’t need to-” he started to protest, but someone tugged a blanket over him and pulled him sideways so his head was resting on something soft and Bucky’s hand in his hair felt so relaxing that sleep was pulling him under before he could really think about it. Home, his brain supplied before he was out like a light.\n----\n \nThe next day, Peter walked into gym class, fiddling with the fabric of his shorts. The teacher had a projector pointed at the wall of the gym, displaying a folder of videos from his laptop. \n“I hope everyone sent me their videos!” the teacher barked. “I know my hope is misplaced, because I’m missing five, but this serves as a warning! You’ll be getting half credit if I don’t have it by the time the bell rings!”\nThe bell rang. \n“Five of you get half credit! Everyone, sit down. We’re going to watch the videos, then each of you pick three that you want to try next class. I expect your full attention!”\nPeter sat next to Ned, as far from Flash as he could. The first video was a girl called Casey’s, which consisted entirely of core exercises. She did a pretty good job, Peter thought. Next was a kid named Josh, who showed five martial arts exercises. When the teacher pulled Peter’s video up, his heart skittered nervously. He hadn’t really double-checked his editing, hopefully he hadn’t missed anything. He facepalmed as Steve’s voice streamed from the speakers.\n\n“Can you see me?”\n\n\n“I’d be able to see you whether it’s recording or not,” Natasha said. “But I think so. This little light thing is blinking.”\n\n\n“Peter, it’s recording!” Steve said. “Do push-ups!”\n\n\n“He has to introduce the push-ups first!” said Hill. \n\n\n“Really? Yeah, I guess that’s how this works.”\n\n\nPeter smiled, amused. He stepped a bit closer to the camera.\n\n\n“To start, do two sets of ten push-ups.”\n\n\n“Don’t forget to drink water!” added Steve.\n\n\n“You can’t interrupt him!” Hill called. “Now he has to do it again!”\n\n\n“No, keep it!” Clint said. “It was funny!”\n\n\n“Also, you’re not much better!” Steve told Hill. “You’re standing in the shot!”\n\n\nHill looked from the lense to the ground beneath her feet. “Oops.”\n\n\nClint snickered from behind the camera. Hill made her way out of the camera’s view.\n\n\n“Now do some push-ups!” Steve said. Peter dropped down and did twenty push-ups, pretending to struggle at the end. Steve threw a water bottle at him, which he caught easily and took a few gulps from. He stepped forward towards the camera again.\n\n\n“Next, do three sets of ten sit-ups!”\n\n\n“Don’t forget to drink water!” Clint shouted, mocking Steve, who grumbled. Peter swallowed his laughter and dutifully did his sit-ups. Hill leaned in front of the camera and gave a thumbs-up.\n\nPeter rubbed his forehead, wishing he could maybe disappear. At least Steve had been too close to the camera to be recognized, and nobody would likely know Hill. Everyone was snickering as the footage cut to Peter introducing the bench press, but they quieted after there was no further commentary from the peanut gallery behind the camera. That didn’t last long, however, because apparently Peter had forgotten to turn off the camera during the kettlebell juggling. The class tittered as Clint juggled, half out of view, and Peter tried to copy him. They didn’t see Steve catch the stray kettlebell, but they laughed at Peter’s horrified apology. \nThe camera wobbled as it was carried to the treadmill, and thankfully Peter had been successful in muting the Hair Club discussion. The patched-in treadmill sound was believable enough, and the video came to an end a few minutes later. Could be worse, Peter decided. Flash raised his hand, and Peter braced himself.\n“Do you have a comment?” said the teacher.\n“Yeah, I don’t think it’s fair that Peter had help.”\n“That’s a valid concern, but I don’t think that Peter’s friends succeeded in helping him much,” the teacher said. Flash crossed his arms.\n“Whatever. Where did you film that, anyway, Parker?”\n“Why?” Peter said, his heart rate jumping.\n“That gym was huge. You don’t have the money for that.”\nPeter flushed. “One of my friends owns it.”\n“Right. Sure, Parker. I-”\n“Are there any other comments for Peter?” the teacher cut in. One of the guys sitting near Flash raised his hand.\n“Who was the creepy dude in the background? He was just -like- sitting on top of that big wall, staring at you.”\n“That’s B- … Jim,” Peter said. “He does that.”\n“Why?”\nPeter shrugged. \n“Alright, this is irrelevant,” the teacher said. “We’re moving on.”\nThe next video started to play, and Peter relaxed. He was off the hook, at least for now.\n----\nFlasha caught up to him after school as he was heading out the front doors. \n“Hey Penis!”\nPeter sighed.\n“What’s the real story behind the gym? How many dicks did you have to suck to-”\n“I’m sorry?” someone said, stepping in front of Flash, who skidded to a stop. Peter looked over to find Hill successfully towering over Flash, despite not being much taller than him. Flash had the decency to look slightly nervous.\n“You’re… you were in Peter’s video,” Flash said, squinting up at Hill.\n“You saw that, did you?” said Hill, smiling and tilting her head. “Wasn’t it good? I thought it was very nice.”\n“I-” Flash cut himself off as Hill leaned closer to him, her eyes cold, the curve to her mouth falling away. “Yeah, yeah, it was great!”\n“I’m glad we agree,” Hill said sweetly, stepping back. “Come along, Peter. Emergency meeting. Pepper’s had a bad day.”\nPeter didn’t look back as he followed Hill away from the school.\nPeter never usually panicked about tests or papers, but this time, he was the closest he’d ever been. He had a Spanish cumulative test, and yeah, he’d been paying attention, but maybe not enough attention do well. He sat on his desk chair, hunched over, his chest constricting. He went to stand up, suddenly realizing that he hadn’t been getting quite enough oxygen when his vision darkened. He collapsed back in his chair, his anxiety spiking. \n“You seem to be experiencing a panic response,” JARVIS said. “Mr. Stark is in a meeting. Can I call Mrs. Potts for you?”\n“No,” Peter said, his breath hitching. “I’m fine.”\n“My apologies, Mr. Parker. That is not an option. I’ve notified Mrs. Potts.”\nPeter swore under his breath, gripping the edge of his desk. He was fine. He was being stupid. He didn’t want to bother Pepper. Maybe if she couldn’t find him, she’d leave? Peter got to his feet shakily and stumbled over to his bed. Breathe, dammit. He lifted his bedspread, shuddering at the dusty, dark space beneath the frame. He had no choice, he told himself. He dropped down and wiggled underneath, his breath coming sharply as he let go of the fabric, leaving himself in the near-complete dark. He didn’t like it. Too small, too tight. The slats of his bed pressed against his shoulder, and his lungs burned with panic when he realized that he couldn’t lift his head. Maybe this was a mistake- No. He couldn’t bother Pepper. He was fine. Fine. Fine. \nHe heard the door to his room open and Pepper call his name. Her footsteps crossed his room, soft on the carpet and clacking against the bathroom tile. She said his name again, more worriedly. \n“I can’t find him, JARVIS.”\n“Mr. Parker is under the bed, Mrs. Potts.”\n“Under the…” Her footsteps drew closer, and light flooded Peter’s eyes as she lifted the bedspread. Her face was scrunched with concern. “Peter, sweetheart. What are you doing under there?”\n“I’m fine,” Peter said hoarsely. Pepper shook her head.\n“That’s not doing you any good. Come on out.”\nPeter wanted to argue, but Pepper crouched down and held out her hand; he couldn’t stop himself from taking it and gripping on like a child. Pepper helped him out from under the bed, and he let out a shaking breath. She dusted him off, sitting him down and studying his face.\n“What were you doing down there, Pete?”\n“Nothing,” Peter said, swallowing the lump in his throat.\n“Peter.”\n“I didn’t want to bother you,” Peter whispered, twisting his shirt between his fingers. “I’m sorry.”\n“Peter, you could never bother me. You’re like the son that Tony and I never had. I don’t want to see you upset, but I’d much rather see you upset than see you trying to hide it, do you understand?”\nPeter nodded.\n“Now what’s wrong?”\n“It’s stupid,” Peter mumbled. “It’s really stupid.”\n“I’m sure it isn’t,” said Pepper.\n“It’s just… I have a Spanish test, a cumulative one… and I don’t know if I’m going to pass. I just really want to do well and I know it’s my fault for not studying more but… I dunno. It’s worth a lot of points and my grade is already lower than it should be… I’m just really stressed out.”\n“Take things one step at a time, okay? Do you have a review sheet?”\nPeter nodded.\n“Let’s see it.”\nPeter made his way over to his desk and pulled the paper from his bag. He smoothed it out so Pepper could read it.\n“Okay. Why don’t we go down the list and check off what you feel confident about?”\n“Alright,” Peter said quietly. Pepper pulled out a pencil and handed it to him. He checked off a the present, future and conditional tenses, skipping the preterite and imperfect. He checked demands, pronouns, and adjectives, which left a long list of irregular verbs and ways to conjugate them. Peter felt dizzy looking at them. Pepper squeezed his shoulder.\n“Let’s make online flashcards,” she said, reached forward and opening his laptop. “JARVIS, can you input the terms we give you?”\n“I can,” JARVIS replied. “I can randomize the form and tense of conjugation with any given set of verbs. Would you like me to do that?”\n“Yes, please. I have the list here. Can you read it?”\n“If you would just lean back… Thank you. I’ve uploaded the list and randomized the terms. They should be available on Mr. Parker’s laptop momentarily.”\nSure enough, a new window popped up with terms and answers. Pepper clicked a button, and the first term was displayed at the top of the screen. An answer box sat below it.\n“Once you get the answer, the next one pops up. You can skip them and come back if you need to,” Pepper said. “Why don’t you work on this for a little while? I have some phone calls to make, but I’ll be back soon.”\n“Thank you. I’m really sorry I bothered you. You probably have so much to do-” Peter cut himself off after Pepper gave him a severe look.\n“It was a welcome break,” Pepper told him. “Peter, I’d much rather spend time with you than talk to dickwads on the phone. I’d drop everything in a heartbeat if you’re having a hard time. Don’t isolate yourself because you think that people have better things to do, alright?”\n“Alright,” Peter said weakly. He rested his hands on the keyboard of his laptop, his fingers trembling a little bit. \n“I’ll be back in an hour or so. Hang in there. If you need anything, you tell JARVIS to let me know. I mean it.”\nPeter nodded.\n“You can do it. I’ll see you soon.” Pepper pressed a kiss to the top of his head and headed out the door. Peter lifted a hand and touched his hair, his heart pounding, but not from anxiety. Nobody had kissed the crown of his head in years, not since he was short enough for May to reach. Pepper had said that he was like her son. His eyes watered, and he sniffled a bit. \n“Would you like me to call Mrs. Potts?” JARVIS asked.\n“I’m fine. It’s just… it’s good. Things are good here,” Peter said.\n“I’m glad to hear it,” said JARVIS. Peter focused his eyes on the screen in front of him and began to type.\n----\nPepper returned forty minutes later, Bucky in tow. Peter had gone through the set of verbs three times, just starting the fourth. He wrung out his hands and spun his chair to face them.\n“Doing alright?” Pepper asked. Peter nodded. Bucky studied him, then stepped forward and offered him a plate of cookies.\n“Thank you,” Peter said, sounding reverent. He shoved a cookie in his mouth, sighing happily. “Tho good.”\nBucky’s lips twitched. Peter noticed that Pepper didn’t scold him for talking with his mouth full. He ate another cookie.\n“You know how it works,” Bucky said. “Hard work, reward.”\n“I’ve got one more phone call,” said Pepper. “Then you can have a real break. I just thought you’d appreciate Bucky and his cookies right about now. Eat one more, then back to work, alright?”\nPeter took his last cookie, savoring it this time. Bucky set the plate out of sight on the bedside table and jerked his head, motioning for Peter to keep typing. Peter set his hands back over the keys; Pepper hugged him around the shoulders before making her way to the door.\n“Thank you,” he replied. “I’m s-”\n“Don’t you apologize,” Pepper chided. “No more of that.”\n“Sor-” Peter clapped a hand over his mouth, and Pepper laughed kindly.\n“I’ll be back.”\nShe stepped outside, closing the door behind her. Bucky remained, glancing around the room, his eyes catching on the bean bag in the corner. He edged over and settled into it tentatively before getting comfortable. When he noticed Peter gazing at him, he waved his hand.\n“Work,” he prompted. Peter complied, turning his attention back to the verbs on the screen. He made his way through the set one more time before slumping back in his chair, rubbing the sides of his head. \n“What else do you need to study?” Bucky said.\n“Preterite vs imperfect, ser vs estar, saber vs conocer.”\n“Mrs. Potts is almost done with her phone call,” JARVIS announced. “Might I recommend beginning your break? She will be with you shortly.”\n“Thanks, JARVIS,” Peter said. Bucky got up and grabbed the plate of cookies, setting it on the desk beside Peter, who took one eagerly.\n“Thank you.”\nBucky dipped his head. “The test’s tomorrow?”\n“Yeah. After lunch.” \n“No staying up late studying tonight. You have enough time. Finish early and get enough sleep.”\n“I’ll try,” Peter said. Bucky nodded and took a cookie for himself. The lines around his eyes softened a bit as he ate it. The door opened, and Pepper stepped inside.\n“Ready for a break?” she asked. “What would you like to do?”\n“Something simple,” Peter answered.\n“We could take a walk somewhere, we could watch TV, we could go bother Steve or Tony or Clint…”\nPeter bit his lip. “Maybe go for a walk?”\n“Sure!” Pepper said. “What do you think about Bryant Park?”\n“That sounds good, but don’t you both probably have better things to be doing?”\n“Peter, what did I tell you earlier?”\n“You said… you’d rather spend time with me than with dickwads on the phone, but now you’re done with your phone calls, so-”\n“I’d rather spend time with you and the others than do anything business-related,” Pepper said. “And today, my schedule isn’t full, so let’s go to the park. Barnes, can you come?”\n“Yes. Location is within walking distance.”\n“Can we bring a frisbee?” Peter asked.\n“Of course,” Pepper replied. “I’m not much good, but Barnes might play with you. Barnes, do you play frisbee?”\n“I don’t know.” Bucky paused, his eyes growing momentarily distant. “Maybe. I caught Steve’s shield and threw it back.”\n“If you can do that, I’m sure you could play frisbee. Would you like to try?”\n“Yes. Bring multiple frisbees. Amount of force needed to throw a frisbee unknown. I might break them.”\nPepper smiled good-naturedly. “JARVIS, do we have frisbees?”\n“We have two. One is in the third storage closet by the gym, and the other is on a shelf in Mr. Stark’s tinkering lab. May I suggest purchasing new frisbees? There is a sporting goods store by the southernmost corner of the park that should meet your needs. Directions are on your phone.”\n“Thanks, JARVIS. Alright boys, let’s go.”\n----\nThe walk to Bryant Park was quick; Peter noticed some of the tension drain from Bucky’s shoulders as they stepped onto the grass. The sidewalks hadn’t been terribly crowded, but it was still enough to make Bucky hunch over, his jaw tight. Pepper led them down to the corner of the park, then stopped.\n“You two stay here. I’ll be back in a couple minutes,” she said, gesturing to the sports store. Peter nodded, and he and Bucky watched her cross the road and disappear into the building. As promised, she returned a few minutes later with four frisbees tucked under her arm. She handed one to Peter and one to Bucky.\n“What do I do,” Bucky said, looking down at the disc.\n“To throw forehand, you just kind of flick your wrist and keep the frisbee parallel to the ground,” Peter told him. “Here, watch.”\nPeter stepped forward and snapped his wrist, releasing the frisbee. It sailed for a little while at shoulder-height before losing altitude and skidding across the grass. Bucky copied him; the frisbee blurred through the air before smacking into a tree and cracking into pieces, denting the tree’s bark. Bucky dropped his gaze, looking dejected.\n“I ruined it.”\n“That’s why I got four,” Pepper said, smiling and giving him another. He held it like it was made of glass, and Peter noticed that his flesh hand was trembling a little.\n“You did really good,” he told Bucky. “You just threw it a bit too hard. It’s okay.”\nBucky frowned. He stepped forward and released the new frisbee, which wobbled and fell to the ground after ten feet. Peter bounded forward and retrieved it, handing it back to Bucky.\n“Throw a little bit harder, but not much.”\nBucky nodded, and this time, the frisbee arced nicely through the air, only banking right a little bit before sliding across the grass.\n“That was great!” Pepper exclaimed. “Good job, Barnes.”\nShe passed him the fourth frisbee, which sailed higher than the previous, descending and stopping near a family who were having a picnic. A young girl hopped to her feet and picked up the frisbee, throwing it back it their direction. Peter grinned and waved.\n“Thank you!” he called. He handed the frisbee to Bucky. “I’m going to stand over there, and you throw it to me. We’ll see how many times we can pass it back and forth. Pepper, do you want to play?”\n“I’ll watch,” Pepper replied, looking content. “I’ll be Barnes’s moral support. Don’t ask me for advice, though.”\nBucky nodded, the corner of his mouth twitching slightly, and Peter jogged to where the other two frisbees were resting in the grass. He held up his arms and Bucky tossed the frisbee, which listed left. Peter jumped to the side and snatched it, sending it back to Bucky, who caught it in his metal hand and crushed it. Bucky frowned, looking terribly forlorn. Peter’s sharp ears picked up muttered apologies and Pepper’s reassurances.\n“It’s okay!” he called. “We have more, don’t worry about it!”\nHe picked up one of the frisbees on the ground and threw it gently to Bucky, who grabbed it with his flesh hand this time. It didn’t break, and he slung it back to Peter looking marginally less upset. They passed back and forth a couple times with no incident before Pepper stepped forward.\n“I’ll play,” she said, and Peter grinned. Bucky handed her the frisbee and she threw it, somehow managing to send it behind her. She laughed, heading over to pick it up and try again. This time, the frisbee sailed up and returned like a boomerang; Bucky snatched it just before it hit him in the face. \n“Sorry!” she said quickly, looking horrified. “Sorry, Barnes. I don’t know how that happened.”\nPeter swallowed a laugh. “Don’t forget to keep it parallel to the ground!”\nPepper gave a thumbs up before grabbing the frisbee and throwing it again. It flew off to her left, almost hitting a young couple who were walking by.\n“Sorry!” she shouted, clapping a hand over her mouth. “Really sorry!”\nPeter ran over and retrieved the errant frisbee, passing it back to Pepper, who caught it between her hands like a pancake. She looked surprised, and promptly dropped it. Bucky snickered a little. She pretended to be offended, but Peter could see the wrinkles around her eyes. She picked up the frisbee and tried to throw; it flew upward again, but instead of coming back, it got wedged firmly in a tree. Bucky snorted, looking rather mirthful. Peter tried desperately not to laugh and failed.\n“Really feeling the love here,” Pepper said, somewhat indignant.\n“I’ll go get it,” Peter replied, but Pepper waved a hand at him. \n“We still have one more.”\nShe picked up the last frisbee and threw it, falling short, but Peter dashed forward and grabbed it before it hit the ground. She punched the air happily.\n“Success!”\nBucky smiled at her, and Peter gave an enthusiastic thumbs-up. He tossed the frisbee to Bucky, who caught it easily with his flesh hand. Bucky sent it flying to Pepper, who made a lunge at it but couldn’t grab it. She trotted after it and scooped it up, tossing it at Peter. He jumped up and caught it, and Pepper grinned. Peter threw the frisbee back to Bucky, who pitched it at Pepper, who managed to catch it using her alligator-hands technique. She tried to throw it to Peter, but it sailed off to the side and came down on the nearest path. A young boy darted forward and picked it up, looking around and meeting Pepper’s eyes. The boy hesitated, but made his way towards her and held it out. Pepper took it, thanking him. She threw it to Peter, who caught it and jogged after the boy.\n“Here, you can have it.”\nThe boy looked up at him. “Really?”\n“Yeah, you can keep it. Me and my friends have to go home soon anyway.”\nThe boy grinned, displaying a wide gap in his teeth. “Thank you!”\n“Sure,” Peter said, watching the kid trot happily back to his parents. He smiled.\n“That was really nice of you,” Pepper told him, looping an arm around his shoulders. Peter shrugged.\n“We have to go back anyway.”\n“You’re a great kid, Peter.”\nPeter ducked his head as they headed back over to Bucky, who was studying him.\n“You’re selfless,” Bucky told him. “Like Steve.”\nPeter looked up, smiling. “You think I’m like Steve?”\n“I didn’t say that was a compliment,” Bucky returned, but his voice was warm and Peter laughed. \n“I’ll take it as a compliment.”\n“It’s both,” Bucky said once they sobered. “Means that you’re good, but you have to be careful.”\nPeter tilted his head.\n“Being selfless means caring about others before yourself. Don’t forget that what others care about might be you.”\n----\nPepper had returned to her work when they got back to the tower; Bucky followed Peter back to his room.\n“Preterite vs imperfect, ser vs estar, saber vs conocer,” Bucky stated. “That’s what you said earlier.”\nPeter nodded. “I can never remember when to use one versus the other.”\nBucky nudged Peter to the side and typed something into the search bar.\n“Preterite vs imperfect,” he read. “Imperfect implies that the past action did not have a definite beginning or a definite end. The preterite tells us specifically when an action took place.”\n“Okay,” Peter said. “Do they have examples?”\n“Jamie spoke from one until two o’clock. Preterite or imperfect.”\n“Uh… Preterite.”\nBucky nodded. “Juan spoke with the student.”\n“Imperfect?” said Peter.\nBucky shook his head. “The beginning and end are implied.”\nPeter rubbed his forehead. “See? It’s really confusing.”\nBucky picked up a pencil and pressed it into Peter’s hand. “Write things down. The beginning and end can be implied in the preterite.”\nPeter scribbled down Bucky’s words and looked up. “Okay.”\n“The girls used to speak in English. Preterite or imperfect.”\n“Imperfect?”\n“Good,” Bucky said. “No definite beginning or end. They arrived at eight o’clock, preterite or imperfect?”\n“Preterite.”\n“Good. Preterite is used for single events.” Bucky nudged Peter’s hand. “Write.”\nPeter complied quickly.\n“We lived there for four years. Preterite or imperfect?”\n“Preterite,” Peter said.\n“Good. Preterite is for specific time periods.”\nPeter scribbled that down.\n“She got up, dressed, and left the house. Preterite or imperfect,” said Bucky. Peter bit his lip.\n“I don’t know.”\n“Is it definite?”\n“Yeah. So preterite?”\n“Preterite.” Bucky nodded. “Used for chains of events.”\n“Chains of events,” Peter muttered as he wrote.\n“We would eat lunch together every day. Preterite or imperfect.”\n“Preterite?”\n“Imperfect,” Bucky corrected. “Used for habitual actions.”\nPeter started a new column of notes.\n“I was reading when my friend entered,” Bucky stated.\n“There are two verbs,” said Peter, knitting his eyebrows together.\n“Hint. One’s preterite, one’s imperfect.”\n“Imperfect, then preterite?”\n“Good,” said Bucky. “Imperfect sets the stage for the preterite. The girl was five years old, preterite or imperfect?”\n“Preterite?”\n“Imperfect. Age and time are always imperfect.”\n“Age and time are always imperfect,” Peter mumbled as he scribbled the words.\n“I spoke with my mother from two o’clock until three o’clock. Preterite or imperfect.”\n“Preterite.”\n“When he was three years old, he was very small.”\n“Imperfect.”\n“When I was a child, I used to play with dolls.”\n“Imperfect.”\n“He called you three times.”\n“Preterite.”\n“Good. Let’s move on. Ser vs. Estar. Ser is for characteristics of the person or thing you are describing. Qualities. Estar is for mood or appearance. Condition.”\nPeter nodded, writing as quickly as he could. \n“What something is, use Ser. How something is, use Estar.”\nBucky waited until Peter had caught up before speaking again. \n“Ser. Day, hour, date, place of origin, occupation, possession. Estar. Location, temporary states, things continuing in the present.”\nPeter mumbled as he wrote, his hand flying across the page. He raised his head. “Alright.”\n“Practice. I am Bob. Ser or Estar.”\n“Ser?”\n“Good,” Bucky said. “They are students.”\n“Ser.”\n“My grandmother is standing.”\n“Ser.”\n“Estar,” Bucky corrected. “She’s not permanently standing.”\n“Right,” Peter said.\n“It is six-thirty.”\n“Ser.”\n“The bathroom is on the right.”\n“Estar.”\n“I am baking cookies.”\n“Estar.”\n“It's not necessary.”\n“Ser.”\n“He is sad.”\n“Estar.”\n“You did fine,” Bucky said. “You don’t need as much practice as you thought.”\n“I think… the idea is sort of overwhelming.” Peter scuffed his feet against the carpet.\nBucky nodded. “Saber vs Conocer. What do you know.”\n“Um… Saber is for facts, I think. Conocer is more… familiarity.”\n“Good. We’ll practice. I know how to bake. Saber or Conocer.”\n“Saber.”\n“I know Tony.”\n“Conocer.”\n“Fred knows Manhattan.”\n“Conocer.”\n“Sarah doesn’t know how to swim.”\n“Saber.”\n“Carrie knows an interesting movie.”\n“Conocer.”\n“Good,” Bucky said. “Do you want to practice more, or do you feel okay about these?”\n“I think… I think I feel okay. It’s just a lot to remember. Thank you for helping me, I really appreciate it.”\n“It’s no problem. Review your notes in the morning. You’ll do fine.”\nPeter let his head fall forward onto his desk. \n“My brain feels like mush.”\nBucky dropped a hand on his shoulder carefully. “You did good.”\n“Thanks.” Peter’s voice was muffled. There was a long pause. “I feel like such an idiot. For freaking out earlier.”\n“It happens.”\n“Captain Rogers would like me to inform the two of you that dinner is ready,” JARVIS said. “He recommends hurrying. The pizza is going fast.”\nPeter perked up at the mention of pizza. He stood so quickly that he wobbled a bit, and Bucky steadied him by the arm.\n“Thanks,” Peter said sheepishly. \n“Let’s go,” said Bucky, amusement faint on his face. The elevator was already waiting, and in less than a minute, Peter was skidding into the kitchen, grabbing a plate and snatching up half a pepperoni pizza before anyone could take it. \n“You’re lucky Natasha is busy,” Clint said, grinning. “I’m sure she’d fight you for that.”\nPeter made a noise of agreement, his mouth full. Pepper gave him a warning look, and he stopped himself before he started talking and swallowed first. \n“Early bird gets the pizza.”\nClint laughed. \n“I heard you have a big test tomorrow?” Steve said, ambling over with a plate of pizza to rival Peter’s.\n“Yeah, Spanish cumulative. I just finished studying. Bucky was really helpful,” Peter replied, shoving a slice of pizza in his mouth. Steve smiled.\n“Good. I’m glad. I’m sure you’ll do well.”\n“I hope so,” Peter said. \n“Barnes knows Spanish?” said Clint, raising his eyebrows. \n“I guess so,” Steve said, thoughtful. “I never… Hey, Buck!’\nBucky turned, his mouth full of pizza. “Hm?”\n“How do you know Spanish?”\n“I just know a little.” Bucky shrugged. “Don’t know why. Briefing isn’t giving me anything.”\nSteve nodded. “That’s probably good.”\n“Probably.”\n“Well, tell me how it goes,” Steve said earnestly, turning back to Peter. “You’ll do great.”\n----\nPeter sat down at his desk, fiddling nervously with his pencil. He watched as the teacher scooped up the stack of tests and began passing them out, face-down. He gulped as one of the packets landed on his desk. A kid beside him tried to peek and got a stack of papers to the head from the teacher for his effort. Once everyone had a copy of the cumulative, the teacher returned to the front of the room.\n“You have until the end of the block. Raise your hand if you have a question. Anyone with their phone out will receive a zero. You may begin.”\nPeter flipped the packet over, scribbling his name at the top. He scanned the questions and let out a little breath. He and Bucky had practiced this. He could do it. He inhaled, exhaled, and began.\n----\nPeter was shocked. Utterly floored. His hands shook as he stared at the little B+ circled in red pen at the top of the page. He made a sound like a creaky door and flipped through the test, just to make sure it was the right one. He double-checked that it was, in fact, his name at the top of the paper, and made another sound of surprise. He got a B+. He got a B+. On the cumulative. He didn’t think he’d scrape up a C+, and that was if he was lucky. He made another funny sound and flailed a little, then slouched in his seat so nobody would stare at him. He shoved the test in his backpack, his leg bouncing excitedly. He didn’t hear a word the teacher said for the rest of class, but he didn’t care. He got a B+. Life was good. When the bell rang, he shot up out of his seat and booked it for the door, weaving around his peers in the hall and skidding out onto the sidewalk. He sprinted back to the tower, dodging other pedestrians with little incident. He slowed to a brisk walk as he entered the lobby and headed into the elevator.\n“You seem to be in a particularly fine mood today, Mr. Parker,” JARVIS said as Peter shot upwards.\n“I got a B+ on the cumulative!” Peter exclaimed. “A B+! I can’t believe it! Don’t tell anyone, okay?”\n“I won’t, Mr. Parker. Congratulations,” said JARVIS warmly.\n“Thanks!” \nThe elevator dinged, and Peter scrambled into the shared space, where Steve and Clint were watching TV.\n“Guess what guess what guess what!” Peter fumbled through his bag, looking for the test.\n“What?” Steve said, bemused.\n“What are you looking for? Is it alive?” Clint sounded slightly nervous. Peter pulled out the test and shoved it in Steve’s hands, bouncing a little.\n“I got a B+!”\nSteve’s smile stretched into a grin, and he reached up and cuffed Peter’s shoulder. “Congratulations! I knew you’d do well!”\nClint bumped Peter’s fist. “Good job, kid!”\n“Thanks!!” Peter squeaked. “I have to tell Bucky! Do you know where he is?”\n“Sergeant Barnes is reading a book on the couch in his and Captain Rogers’s apartment,” JARVIS said. “May I warn him that you are coming?”\n“Sure!” Peter said, heading back for the elevator. “Bye, guys! Seeya!”\n“Bye, Peter!” Clint called as the doors slid shut.\nA few floors down, he scurried up to Bucky and Steve’s place and knocked softly. The door was pulled open, and Bucky stepped back to let Peter in.\n“I got a B+! On the Spanish cumulative! I did it!!”\nBucky’s face softened into a warm, fond smile. “Good for you. I’m proud of you.”\n“You’re the one who helped me study! I really really appreciate it, thank you so much!”\n“No problem.”\nPeter’s arms twitched; he fought to keep them by his sides as he vibrated excitedly. He didn’t want to invade Bucky’s personal space. Bucky studied him with soft eyes, then set down the test and pulled him into a careful hug. Peter inhaled, surprised, but melted into the embrace.\n“Thank you,” he said again.\n“Any time.”\nPeter threw his phone across his bed, burying his face in his pillow. He had a group presentation due the next day, and nobody was replying to him. He’d done his part; his five slides were thorough with supporting evidence from Fahrenheit 451. Unfortunately, nobody else was as timely. Two people hadn’t even started, and the other one had a single, messy slide. It was already past ten, and they showed no signs of getting any work done. \nPeter sighed. He picked himself up and sat down at his desk, rubbing his eyes. He opened the SparkNotes page on 1984 and began gathering examples of destruction caused by lack of freedom. It took him nearly an hour to organize it all into slides, and he let out a very manly whimper when he realized that he still had two books to pick through. He managed to get a couple slides of information out of the summary for The Handmaid’s Tale before exhaustion got the best of him and he hauled himself up to the shared floor to make himself a strong cup of coffee.\n“Might I recommend getting some rest, Mr. Parker?” said JARVIS in the elevator back to Peter’s room. “You slept less than four hours last night, as well as the previous one, and you are displaying signs of sleep deprivation.”\n“Can’t,” Peter said. “I’ve gotta finish the project.”\n“Perhaps you could ask for help, then?”\n“It’s late. I don’t want to bother anyone.”\n“Sergeant Barnes, Mr. Stark, and Ms. Romanova are all currently awake,” JARVIS replied.\n“They’re probably busy,” Peter said, stumbling a bit as he stepped out of the elevator and made his way into his room. His coffee sloshed onto his shirt a bit, and he swore. He sat down, scrubbing his blurred eyes as he stared at his computer. His brain was starting to feel like sludge, and he downed the cup of coffee before pulling up a PDF of The Handmaid’s Tale and skimming through it as best he could. He found a few good quotes, but he seemed to have to read things twice before he could process them. His eyes got stuck a few times, and he had to force them onwards. The edges of his vision were dark, and he wasn’t entirely surprised when his head fell to his desk with a thud and everything went black.\n----\nTony was working on refining his parachute release design when his music softened, and he looked up, slightly irate.\n“What?”\n“Mr. Parker seems to have fallen unconscious from exhaustion. He is uninjured and his vitals are stable, but it would do him good to be put in his bed.”\nTony dropped the screwdriver he was holding and hurried to the elevator, rubbing the bridge of his nose as he stepped in. He fidgeted as the elevator descended and was out the doors as soon as they slid open, slipping into Peter’s room and frowning deeply at the sight of him passed out at his desk. He picked up an empty coffee mug that seemed to have fallen on the ground and set it quietly back on the desk.\n“JARVIS, any abnormalities in his vitals now?”\n“Nothing terribly out of the ordinary. His blood pressure is slightly high and his coordination was poor when he was awake.”\nTony wrapped his arms around Peter’s midsection and hefted him up, the boy’s head lolling against Tony’s shoulder. Tony carried him across the room to his bed, laying him down and pulling the blankets over him. He remained limp, and Tony tried not to worry.\n“Monitor him,” he told JARVIS.\n“Yes, Sir.”\nTony turned out the lights and made to leave before turning back to Peter’s still-bright computer screen.\n“What was he working on?”\n“He was trying to complete a group project. His groupmates failed to complete their share of the work,” said JARVIS.\n“And it’s due tomorrow?”\n“I would presume so.”\nTony hesitated before crossing the room one more time, scooping up Peter’s laptop before heading out and pulling the door shut behind him.\n“Who else is up?” he asked, stepping into the elevator.\n“Sergeant Barnes and Ms. Romanova, Sir.”\n“Tell them to meet me in the common room with their laptops.”\n“Will do, Sir.”\nThe elevator stopped once as he ascended, and Bucky stepped in. He gave Tony an assessing look as the doors closed, then nodded. Tony returned the gesture.\n“Peter’s alright?” Bucky asked after a few moments.\n“Just exhausted.”\nBucky relaxed a little, though he was still frowning. They didn’t speak again until they entered the shared living room, where Natasha was already waiting.\n“JARVIS said something about a project,” she said.\n“Peter passed out working on some group presentation that the other kids weren’t helping him with.”\n“Alright,” said Natasha. “Let’s do a project. Show me.”\nTony handed her Peter’s laptop, which she set on the coffee table next to hers. Bucky sat to her left and Tony on her right.\n“It looks like the theme is how lack of freedom can be destructive to people and societies as a whole. He’s got some good stuff, it looks like he just had ten slides left or so. I’ll share it with myself and you, Barnes, so we can all work at once.”\nBucky opened his laptop, clicking on the presentation and scrolling through it.\n“Have you read any of these, Elsa?” Tony asked. Bucky scowled a bit.\n“Fahrenheit 451,” he said. “JARVIS recommended that I didn’t read the others.”\n“Fair enough,” Tony replied. “You can do formatting, then. Make things look pretty. Prettier than you make your hair.”\nBucky glared again, but began scrolling through themes.\n“Nat, can you finish the stuff on The Handmaid’s Tale? JARVIS, pull up a summary and a PDF of Do Androids Dream of Electric Sheep by Philip K. Dick. Heh, Dick. Hey, isn’t that what Blade Runner is based off of?”\n“It is, Sir.”\n“Knew it. Alright, let’s get started.”\n----\nIt was nearing one in the morning when the three of them were finally satisfied. A solid twenty two slides were complete and well put-together, the font was consistent, and the layout was appealing. The Works Cited slide at the end was neat and properly formatted, thanks to Bucky’s discovery of EasyBib and Purdue Owl.\n“Mrs. Potts woke up and would like to know when you’re coming to bed, Sir,” JARVIS said.\n“I’ll be there soon,” said Tony.\n“Mrs. Potts would like me to inform you that ‘soon’ is not an adequate response.”\nTony made a sound between a laugh and a sigh. “Ten minutes.”\nHe stood up, Peter’s laptop under his arm. Natasha and Bucky followed him to the elevator.\n“Stop at Peter’s room,” he told JARVIS.\n“Yes, Sir.”\nWhen the elevator stopped, Bucky and Natasha filed out after him. He opened Peter’s door slowly, and they followed him inside. \n“How is he,” Bucky said, looking to the ceiling.\n“Stable. Sleeping deeply,” JARVIS replied. Bucky nodded. Tony set Peter’s laptop on his desk, and Natasha stepped forward and brushed a hand over his cheek. He didn’t stir. She moved back, making room for Bucky, who had been fidgeting minutely. He pulled Peter’s blankets snugly to his chin, then smoothed down his hair. It was slightly greasy, like the boy had forgotten to shower. Bucky frowned, but made his way out of the room after Natasha and Tony.\n----\nWhen Peter awoke, he stretched peacefully and lay for about ten seconds before panic hit him. He hadn’t finished the presentation. He was screwed. He would fail and there was nothing he could do and everyone would be disappointed-\n“Mr. Parker,” JARVIS said, interrupting his quickly-derailing train of thought. “Your presentation has been finished. There is no need to panic.”\nPeter’s brian ground to a halt. “Finished?”\n“Finished,” JARVIS confirmed.\n“By who?” Peter finally managed.\n“Mr. Stark, Sergeant Barnes, and Ms. Romanova.”\n“What?”\n“You passed out due to exhaustion. They moved you to bed and finished the project.”\n“Is this a joke? Am I dreaming?”\n“I could summon Sergeant Barnes to pinch your toe,” JARVIS offered.\nPeter snorted, half in amusement and half in disbelief. He dragged himself out of bed and flopped into his desk chair, opening his laptop. Sure enough, the presentation was complete. Peter grinned. He almost wanted to cry. He brushed his teeth and pulled on fresh clothes, then packed his bag and hurried to the elevator for breakfast. Steve was the only one in the kitchen, a bowl of cereal on the counter in front of him. He turned at the sound of Peter’s footsteps.\n“Hey there,” he said, smiling. “Good morning.”\n“Morning,” Peter said cheerfully.\n“You’re awfully chipper,” said Steve. “Had a good night’s sleep?”\n“Yeah,” Peter replied, pulling out a bowl and pouring himself some cereal of his own. Steve passed him the milk and he nodded in thanks, sitting down to eat. \n“I don’t know how you eat such sugary cereal,” Steve said, studying Peter’s Froot Loops.\n“I guess I’m used to it,” Peter replied, his mouth curving. “I don’t know how you eat that stuff. It looks sort of like shredded cardboard.”\nSteve laughed. “I guess it does. What do those taste like, anyway? They’re so colorful.”\n“Swap,” Peter said, pushing his bowl toward Steve, who obediently handed over his own. Steve took a bite of Froot Loops and his eyes widened.\n“That is… sweet. Very sweet.”\nPeter suppressed a laugh and took a spoonful of cardboard. He made a face as he chewed and swallowed.\n“It tastes like cardboard got bored of being cardboard and got even more boring.”\nSteve chortled and gave Peter his Froot Loops back, returning to his cardboard.\n“I would suggest leaving for school within the next three minutes, Mr. Parker,” JARVIS said. Peter checked the time and squeaked, shoveling cereal into his mouth like there was no tomorrow. When he finished, he plopped his bowl in the sink and scooped up his bag.\n“Have a good day at school!” Steve said.\n“Thanks!” Peter chirped, darting for the elevator. “See you later!”\n----\nThe presentation went well. Peter’s groupmates read from the slides despite having done none of the work, and Peter seethed a bit, but what could he do? It was finished, anyway, by cause of Tony, Bucky, and Natasha. He’d have to thank them somehow. His group got scattered applause and they sat down, watching others until the bell rang. Peter grabbed his bag and headed for the door.\n“Can I speak with you, Mr. Parker?”\nPeter turned to find his English teacher behind him.\n“Sure?”\nThe teacher waited until everyone had filed out before speaking.\n“I got an email from your guardian saying that you stayed up quite late and did the vast majority of the work on your project. I know that I said on the rubric that you’d be getting group grades, but I’m going to make an exception this once, and only because I looked at the editing history of the presentation. You did most of the work, and you’ll get credit where credit is due.”\n“Thank you,” Peter said, surprised. “I… I really appreciate that.”\nThe teacher nodded, shooing him to the door.\n“Oh, and Peter?”\n“Yeah?”\n“Get enough sleep, alright? It’s important at your age.”\n“Alright,” Peter said. “Thank you.”\n----\nAfter school, Peter kept going past the tower to Target. He grabbed a cart and made his way to the aisle filled with cards. He selected a thank you card with different shapes on the front for Tony, one with cartoon animals for Bucky, and one with red swirls for Natasha. He picked out different items as he went down aisles and between racks of clothes, including a plaid handkerchief for Bucky, coconut conditioner for Natasha, and a little Iron Man Lego set that Tony would definitely play with for fun at some point (or maybe he’d throw the pieces at people), a bag of mixed chocolates for each, and three little wicker baskets. He paid and gathered up the plastic bags, hurrying back to the tower as it started to rain. \nHe assembled the baskets carefully, writing thoughtful notes in the cards before adding them in. He went to Tony’s workshop first, tiptoeing in and watching Tony sing along with his loud music for a little while. Tony finally looked up and jumped a mile when he saw Peter.\n“Jeez, kid. Warn a guy, would you?” he said, but his voice was warm and he messed with Peter’s hair playfully. “Whatcha got there?”\nPeter handed him the basket. “As a thank you.”\n“A thank you? For what, the presentation? That was nothing. You didn’t have to…” Tony rooted through the basket, laughing at the legos and popping a chocolate into his mouth before opening the card. \n\nTony. Thank you so much for working on my project. I really appreciate everything you’ve done for me. I didn’t think I’d look up to anyone like a dad after Uncle Ben, but I was wrong about that. You mean a lot to me. Thanks again, love, Peter.\n\nPeter wasn’t sure if it was a trick of the light, but Tony’s eyes looked a little damp before he wrapped an arm around Peter and squeezed him tight.\n“You’re welcome, kid.”\nTony released him, stepping back. Peter grinned and headed back to the elevator. \n“JARVIS, can you warn Bucky I’m coming?” he said.\n“Right on it, Mr. Parker.”\nWhen he knocked, Steve’s voice called “Come in!”\nPeter pushed the door open, basket in hand, to find Bucky reading a book and Steve sprawled out next to him, watching the news.\n“This is for you,” Peter said, extending the basket to Bucky. “As a thank you.”\nBucky lifted the corner of his mouth in a small smile as he pulled out the handkerchief buried under chocolates.\n“Look what I got, Steve.”\n“Ooh!” Steve grabbed a handful of chocolates and tried for the handkerchief, too, but Bucky held it out of his reach.\n“Nope. It’s mine. You have to do something nice for Peter to get one.”\nSteve pouted. “But I lost mine.”\n“Too bad.”\n“Cruel,” Steve sighed, unwrapping a few chocolates and munching on them. Bucky pulled a flower crown out of the basket that Peter had mostly picked out as a joke and studied it before putting it on.\n“Steve. How do I look.”\nSteve grinned. “Adorable.”\nBucky looked satisfied and opened his card.\n\nBucky. Thank you for finishing my project. I don’t know what I would’ve done if you guys hadn’t. JARVIS said that you did the formatting, and it looked great. The teacher seemed impressed. You’re honestly one of the nicest people I know, even if you don’t think that. You’re also one of my favorite people. Your cookies are delicious and you let me fall asleep on you that one time and you didn’t get mad. I mean, I probably would’ve been annoyed. I don’t know why you put up with me sometimes. Thank you so much for everything. Love, Peter.\n\nWhen Bucky finished reading, he read it again, then used his new handkerchief.\n“You’re one of my favorite people too,” he said quietly. “Thank you. This is… really kind.”\nHe got up and set the card on a shelf by a tall potted plant, next to a wrinkled letter. Then, he wrapped an arm around Peter and gave him a little squeeze. Peter smiled broadly; Bucky looked warm and tranquil, especially in his flower crown. Bucky released him, moving to sit by Steve again.\n“See you later,” Peter said, heading for the door and giving a little wave. Bucky and Steve returned the gesture and Peter pulled the door shut, making his way into the elevator.\n“JARVIS, where’s Natasha?”\n“She is currently training in the gym with Mr. Barton. Would you like to go there?”\n“Yes, please,” Peter said, and the elevator began to sink. He stepped out into the vast gym; Natasha and Clint were sparring. Natasha was quick, soon delivering a succession of hits that unbalanced Clint. She took him down, and he used his weight to pin her, but not for long. He let out a pained yelp and she wriggled from beneath him, looking pleased with herself. She caught sight of Peter and beckoned him over with a wave. Clint looked up from the ground.\n“Oh, hey kid!”\n“Hi,” Peter said, looking at Clint in amusement.\n“Don’t laugh at me,” Clint warned. “She played dirty.”\n“Still won,” Natasha said cheerfully. “Anyway, what’s up, Peter?”\n“This is for you,” he said. “As a thank you.”\nShe took the basket, smiling at the chocolate and her eyes lighting up at the conditioner and assorted hair elastics. She took out the card, scanning it.\n\nNatasha. Thank you for helping with my project. It was really nice of you and it saved me a ton of panic. I really look up to you because you’re kind and strong and calm and the type of person that I wish I was more like in a crisis. You’re one of the coolest people I know. Also, thank you for inviting me to join Hair Club. It’s like having the family that I never got. Love, Peter.\n\nNatasha’s face slid into her trying-not-to-show-emotion expression. \n“You’re very welcome, Peter,” she said calmly. “I’ve always got your back, alright?”\n“Alright,” said Peter. She pulled him into a quick hug and kissed the top of his head. Peter didn’t trust his voice not to waver, but he grinned when he stepped back and headed for the elevator. \n“We’re damn lucky to have that kid, Clint,” Peter overheard her say as the doors closed. Peter rubbed the moisture from his eyes and beamed up at the ceiling. They liked him. They honestly liked him.\n“Are you alright, Mr. Parker?” JARVIS asked.\n“I’m fine,” Peter replied, his voice thick. “I’m really, actually fine.”\n“I’m glad to hear it,” said JARVIS. “You are a fine young man.”"
}