{
    "id": "13273611",
    "url": "https://archiveofourown.org/works/13273611?view_full_work=true",
    "author": [
        "Drag0nst0rm"
    ],
    "title": "More Precious Than Gold",
    "rating": "General Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "F/M",
        "Gen"
    ],
    "fandoms": [
        "Batman - All Media Types"
    ],
    "relationships": [
        "Stephanie Brown/Tim Drake",
        "Dick Grayson & Bruce Wayne",
        "Jason Todd & Bruce Wayne",
        "Tim Drake & Bruce Wayne",
        "Alfred Pennyworth & Bruce Wayne",
        "Cassandra Cain & Bruce Wayne"
    ],
    "characters": [
        "Alfred Pennyworth",
        "Bruce Wayne",
        "Dick Grayson",
        "Jason Todd",
        "Tim Drake",
        "Stephanie Brown",
        "Damian Wayne",
        "Cassandra Cain",
        "Duke Thomas",
        "Terry McGinnis",
        "Barbara Gordon"
    ],
    "additional_tags": [
        "Alternate Universe - Dragons",
        "Alternate Universe - Fantasy",
        "Legally Dubious Adoptions",
        "Bat Family",
        "Alfred is Exasperated"
    ],
    "language": "English",
    "series": "",
    "published": "2018-01-05",
    "completed": "2018-01-22",
    "words": "12,949",
    "chapters": "2/2",
    "comments": "590",
    "kudos": "13,201",
    "bookmarks": "4,346",
    "hits": "123,629",
    "summary": "<p>Most dragons sleep on their hoards.</p>\n<p>Bruce's hoard sleeps on him.</p>\n<p>Or: Bruce is a dragon. Predictably, he hoards orphans.</p>\n<p>Every hoard needs treasures.</p>",
    "notes": "<p>I don't own Batman.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>I'm sorry this took so long. I ran into that weird form of writer's block where you know EXACTLY what happens . . . and because of that, you have no motivation to write.</p>\n<p>But it's done now!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>And thus ends the dragon AU, at least for now.</p>\n<p>I'm going to be taking a semi-break from fan fiction. I've been neglecting my original work for about . . . six months now . . . which is obviously a bit Not Good. That's going to be my next writing priority, but that's not to say I'm going to drop away from fan fiction entirely! I've got a prompt for another Merlin fic, my Not All Stories AU needs a conclusion, and my Untainted AU has at least one more potential installment waiting for it. </p>\n<p>Those could come at any time, although that least won't be at least until February. Other stories could well pop up in the meantime - if one starts hopping up and down and begging for attention I'm certainly not going to ignore it - but I'm not going to be chasing down ideas and pinning them down for my beta to help me chew up either.</p>\n<p>Untainted AU aside, I'm particularly unsure when I'll be returning from the batman fandom. I've loved writing for it, and the response has been amazing, but it's difficult to write for a fandom when your beta/brainstorm buddy has no experience with it. She has been amazingly supportive despite this, but the difficulty remains.</p>\n<p>That said, I DO have more ideas, and I do WANT to return to it, so I'll try to make that happen. Until then, happy reading!</p>\n<p>Damian's name's meaning comes from the meaning-of-names website. His name can actually mean a number of things. I went with the Indian meaning in MHR and mentioned the Greek because it fit there; here I chose the Spanish meaning because it was funnier.</p>\n<p>The idea for this can probably be traced back at least partially to Jessica Day George's Dragon Slippers. In it, dragons all want hoards but WHAT they hoard is widely individual. It might be shoes, or stained glass, or, if you're rather eccentric, dogs. But there's a moment when one dragon sees that another has a human in his cave and is horrified to think that the other dragon might have started to hoard humans.</p>\n<p>Then, years after I read the books, I'm writing MHR, and Bruce gets a bit possessive just as Tim is suggesting picking a draconic hero name based on his last name . . . And, well, this resulted.</p>\n<p>I'm marking this as two chapters because haven written this, there are a couple of missing scenes (mainly, exactly what went down when Bruce met his first three boys and possibly Stephanie) that I want to write.</p>\n<p>One last thing: I literally wrote just yesterday that I would probably never write Terry McGinnis because I am not qualified to do so and have no interest in becoming so. Then, today, I got the idea for his section, which goes to show that I should never say that I will never write something. I did my best to do some research to make this as in character as possible. If I failed horribly, just assume that living in a world with dragons profoundly affected him. Or pretend that he's a totally different character who just happens to share the name.</p>\n<p> </p>\n<p>There is now amazing fan art! https://jackgoodfellow.tumblr.com/post/678861455013117952/behold-bruce-wayne-the-dragon-and-his-majestic</p>",
    "text": "Alfred had hoped that the young master would hoard gold.\nBoth of his parents had hoarded it, after all; there was a large hoard of it already in the caves that made up their home, and the surrounding city-states still sent a tribute of it each year for lack of anyone telling them to stop. Providing him with sufficient amounts to keep him happy and healthy would have been relatively easy, and gold was gratifying simple to maintain.\nIt did have an unfortunate tendency to attract thieves, but now that the young master was nearing the end of adolescence, any who came would find themselves faced with a dragon more than prepared to defend the hoard. Even before that point, Alfred had prided himself on being a fairly efficient guard.\nGold would have been so simple.\nThese days, he was just hoping the young master would hoard anything at all. He was nearly out of adolescence; if he didn’t form and fulfill the hoarding urge soon, he never would, and dragons who didn’t maintain a healthy hoard had a distressing tendency to go mad in their latter years from lack of direction. Alfred had no desire to fail his charge that way.\nIt was just . . . Well, he wasn’t qualified for this. He had been hired all those many, many years ago to be a liaison between the dragon lords of the Gotham Mountains and the human inhabitants and to help maintain the caves they lived in. That he was well qualified for and had done.\nHe had just never thought that both the master and mistress would fly off to do battle for their territory and never return. He had never thought he alone would be left to raise their hatchling. \nAnd as hard as he tried, Alfred very much feared that he was not at all qualified for that.\n \nAlfred always fretted when the young master went out to patrol his territory. A forgivable failing all things considered.\nFor once, however, his alarm was not eased by the young master’s return. The young master was holding something gently in his claws, something he was peering down anxiously at -\n“Is that a child?” Alfred demanded.\nThe young master looked up in relief. “Oh, Alfred, good. I need your help. I don’t know what’s wrong with him. I breathed on him all the way here, but he’s still so quiet - “\nIt was a child. A small boy, to be exact. The young master had let go of him now, but he was still curled up in a small ball. There weren’t any visible injuries on him, but his clothes were wet with half dried blood.\nAlfred sighed and knelt next to him. “Hello,” he said gently. “I’ll just look you over, young sir, alright?”\nThe boy might have given a small nod, but he was shaking so hard that Alfred couldn’t be sure.\nHe checked him over quickly before standing back up and glaring at the young master. “Physically, he is fine, but as much good as dragon breath may do for ordinary injuries, I am afraid it does little for shock.”\n“But he’ll be alright?” the young master asked anxiously.\n“Eventually, yes.” Alfred’s glare intensified. “Now please tell me you didn’t kidnap the poor boy.”\nThe young master reared back in shock. “I found him! The bridge, the one over the chasm a few miles from here, got destroyed. It must have happened when his caravan was halfway across.” He nudged the boy gently with his nose. The boy leaned into the warmth. “He was the only one I could find that was still - “ He cut off, looking down guiltily at the boy.\nStill alive, Alfred finished for him. He was ashamed of his assumption. “Ah. Well done then, young master. Have you discovered what was responsible?”\nThe young master’s eyes darkened. A few sparks darted out of his nose. “A zucco. It was coming back just as I got there.” A low growl was building in his chest. “I took care of it.” He nosed the boy again. “It won’t bother you again.”\nWith the boy in shock, the warmth of a dragon would do him a world of good, but perhaps a blanket would be comforting as well. Alfred would be glad to give up one of his own for the time being. And some supper, of course. The young master might be able to only eat once a week or so, but the boy would need something.\nHe hurried to retrieve the blanket. “I’m Alfred,” he told the boy as he wrapped it gently around him.\nThe boy’s shudders had eased. “Dick,” he said quietly. He looked up at the dark dragon still hovering anxiously above him. “Who are you?”\nThe young master told him. Alfred gave the boy full credit for trying to repeat the long string of syllables, but Alfred had been trying for years. Some dragon names were simply beyond human tongues.\nDick latched onto the first syllable and the hiss in the middle. “Bruce,” he decided. “I’m going to call you Bruce.”\nThe young master didn’t seem to have an objection, so that, Alfred supposed, was that.\nHe might even grow rather fond of it himself.\n \n“You’re going into town today, aren’t you?” \nAlfred looked up from the breakfast he was preparing. “I had intended to,” he agreed. He nodded to their still sleeping guest. “Do you need me to change my plans?” He wasn’t entirely sure just how long Dick would be with them, or what the young master’s plans were. Presumably, he would take him to one of the city-states so he could be cared for - Sir Gordon’s perhaps, the man could be trusted to handle the situation, and he was the closest - but the young master might think the boy could use a few days in relative solitude first.\nThe young master shook his head. “I just thought I’d fetch the gold for you.”\n“That would be very kind, thank you.” Dare he hope that the young master was starting to take a more possessive view of the gold?\nBut when the young master returned, it was with more than Alfred would need. \n“I won’t need quite that much, I don’t believe.”\nThe young master looked at him with those wide blue eyes. “But you’ll need more than usual to get things for Dick.”\nAlfred was starting to feel a bit of concern. “Food for the next few days, you mean?” he asked cautiously.\nThe young master nodded and then continued on. “And some more clothes and bedding, of course, and anything else he needs. Some toys, maybe? He’s still small enough for those, isn’t he?”\nThe feeling of dread was growing. “Just how long do you intend for him to stay?”\nThe young master appeared confused by the question. “He’s staying.”\n“Yes,” Alfred agreed. “But for how long?”\nHis tail lashed in agitation. “He’s staying,” he repeated. “His parents are gone. He’s going to stay.\"\n“ . . . Permanently?” Alfred asked, dread heavy in his stomach now.\nThe word seemed to settle the young master somewhat. “Yes,” he said, relieved that Alfred understood. \nAlfred prayed this wasn’t what he thought it was. “Children need to be around others of their kind,” he said carefully.\nThe young master appeared confused by this. “I wasn’t,” he pointed out.\nAnd look how that’s turned out, Alfred thought despairingly.\n“Besides, you’re here.”\nAlfred was hardly a substitute for the entirety of human society, particularly considering his own history. “He cannot stay,” Alfred said firmly.\nThe young master’s wings rose in a subconscious effort to make himself look bigger. His tail was lashing in earnest now. “He will.”\n“I’m staying?” a small voice asked. Dick had woken up at some point in their conversation and had wandered over. “Really?”\n“Only if you want to,” Alfred said in one last attempt to salvage the situation.\nBut the boy had thrown his arms around the young master’s leg and was clinging to it. “Thank you, Bruce.”\nThe young master - Master Bruce, Alfred supposed with a sigh - wrapped his wings around his protectively. \nOn the bright side, Alfred supposed, at least Master Bruce had found something to hoard.\nOn the downside, this was not what he’d had in mind.\n \nThe situation was concerning for a number of reasons. A dragon’s cave was hardly a prime location to raise a young boy, for one thing, and for another, an inclination to hoard living things rarely ended well for the dragon in question. Or for the humans involved, for that matter.\nBut four years passed without Master Bruce bringing home anyone else, and Master Dick seemed happy enough. Alfred did his best to educate him, and Master Bruce had been happy to outfit the cave with the equipment to help Master Dick keep up his acrobatic skills and to provide anything else he wanted or needed. He even bit back his protests at Master Dick joining Alfred on his trips to the village, although he was always anxious the whole time they were gone.\nAlfred had hoped that hiring young Mistress Gordon, a warrior well on her way to equalling her famous father, to teach Master Dick to fight would help ease Master Bruce’s concerns.\nInstead, he was beginning to see hints that Master Bruce was starting to consider her his as well which was rather alarming all around.\nAs such, his first reaction to seeing Master Bruce return from patrol with a wildly struggling figure held gently in his claws was relief that it wasn’t Mistress Gordon. Her kidnapping would put a strain on their relation with Sir Gordon’s city, to say the least.\nHis second reaction was shame at his first and growing concern at the situation. He ran over.\n\n”Master Bruce!”\n\nMaster Bruce released the boy from his claws rather guiltily. The boy immediately scrambled out of immediate claw reach. \n“I’m sorry, alright! I won’t do it again!”\n“I’m not mad,” Master Bruce said.\n“Yeah, that’s what you said,  right before you took me back to your cave to eat me.”\nAlfred had a headache forming. “What is going on?”\n“I found him in the Narrows,” Master Bruce said.\nThe Narrows. The crime ridden waste of a city-state that the master’s parents had died defending. Alfred’s headache intensified. “There are many young boys in the Narrows. May I ask what this one did to draw your attention?”\n“I gave it back,” the boy said instantly. His gaze kept darting to the cave entrance. Alfred was fairly certain that only Master Bruce’s bulk blocking most of it kept him from making a run for it.\n“The city’s installed a new perch for me,” Master Bruce explained. “One with some copper ornaments attached. Jason took one.”\nAlfred looked over at the boy. His grimy clothes hung loose around a rather thin frame.\n“I was hungry,” Jason said defensively. “That thing would have kept me fed for a month. You hadn’t even seen it yet. I thought you wouldn’t miss it.”\nNonetheless, stealing from a dragon took a certain amount of backbone. “Dare I hope that your indignation arose over a sudden desire to hoard copper?”\nHe held out very, very little hope for this, but he still felt he had to try.\n“I don’t care about the copper,” Master Bruce said impatiently. “He can keep it. But he was freezing out there, Alfred, and he’s obviously starving. I couldn’t just leave him.”\nThe cave, like most dragon inhabited structures, was unnaturally warm. The weather outside it was, admittedly, not.\nMaster Dick had emerged from one of the side tunnels at some point in the discussion and had bounded over to Jason. “Are you staying here now? Cool!”\nJason’s eyes darted warily between the three of them. “ . . . Staying here? So you’re not gonna eat me?”\n“Of course not,” Master Bruce said.\n“Bruce doesn’t eat people,” Master Dick said, clearly horrified. \n“So why am I here?”\n“It’s awesome here!” Master Dick said, which did not actually answer the question, Alfred thought sourly. “Alfred makes the best food, and Babs is teaching me how to fight, and I’ve got this really cool set up back here, let me show you - “ The young master dragged the other boy off.\n“His parents are dead,” Master Bruce said a moment after they had disappeared. “He needs a home. And you keep saying Dick needs company.” He peered after them. “He seemed happy, don’t you think?”\nAlfred stared at him for a long moment before stalking off to prepare supper. Perhaps if it was substandard, the boy would be less inclined to stay, and Alfred could nail into Master Bruce’s head exactly what he was doing wrong.\n \nDick’s set up was pretty cool, Jason had to admit. Even with all his experience breaking into places in the Narrows, and even though he had to be at least a couple of years older than the kid, he couldn’t do half the things Dick could on it.\nHe wasn’t sure how seriously to take Dick’s offer to teach him.\nAnother set of items drew his attention, though.\nBooks.\nThere was a small stack of them in a corner of the room, next to a chest that might contain clothes and a pile of blankets that looked like they’d be perfect for nesting in. Jason couldn’t help gravitating toward them.\nMom hadn’t been able to teach him much, but her family had been better off when she was young, and she’d at least been able to teach Jason to read out of the lone, ragged book they had left.\nThese were nothing like that.\n“Alfred’s been using them to teach me history and stuff,” Dick said cheerfully from behind him. “You like to read?”\nJason’s shoulders hunched defensively, but the older boy didn’t seem to be mocking him. “When I can,” he finally said.\nDick’s grin was blinding. “Great! Alfred’ll finally have a good pupil then. I can never sit still for as long as he wants.” \nHaving seen the insane flips Dick was doing just a minute ago, Jason could believe it.\n“And once you’ve read through all the ones here, I’m sure Bruce’ll buy you some more.”\nJason eyed the other kid warily. “What exactly does he want us for, anyway?”\nDick shrugged. “Alfred thinks he’s hoarding us, but I don’t think two people really count as a hoard, do you?”\n“I don’t know why you think I know anything about the hoarding practices of dragons.”\n“Fair enough.” Dick flipped back and caught himself with his hands so that he was standing on his head. “I think he’s lonely.”\n“ . . . Huh.” Jason looked around the cave again. It looked comfortable. Fun, even.\nAnd it was warm which was already more than he could say for his squat in the Narrows.\nAnd there were those books, waiting tantalizingly in reach.\n“Supper!”\nDick flipped back to his feet and flashed another grin at Jason before running for the door. Jason followed after only a momentary hesitation.\nSupper was delicious. “I’m pretty sure this is the best thing I’ve ever eaten.”\nJason wasn’t sure why the old guy looked pained at that. His mouth hadn’t been full or anything.\n“I told you it was great,” Dick said. “So you’ll stay, won’t you?”\nThe dragon . . . Bruce . . . looked up at that.\nAnd, well, he wouldn’t want to disappoint a dragon. And besides, this was honestly a better situation than anything he could have gotten in the Narrows.\n“Yeah. I’ll stay.”\nThe old guy sighed.\n \nThe third time it happened, Alfred was forced to admit that this was a pattern. This one, at least, wasn’t struggling. Instead, he was sitting very still in the protective cage of Master Bruce’s claws.\nWhen he was gently set down, it only took one look to confirm that this was no starving street child.\n“I suppose it’s better than bringing home a princess, sir. We wouldn’t want to grow cliche.” \nThe boy wilted a bit under Alfred’s stare as he staggered to his feet. Flight sickness or something else?\n“It’s nice to meet you, Master Pennyworth.” The poor boy was desperately pale, save for a feverish flush across his cheeks.\nThen the rest caught up with him. “I see Master Bruce has already told you about me. And you are quite welcome to call me Alfred, young sir.”\n“Oh, no. I heard about you from some of the traders who came from Gotham - ” The boy cut himself off, flushing deeper. “But. Um. You don’t want to know about that. I’m Tim, by the way.” This speech was apparently too much, and the boy broke into a coughing fit. Alfred winced at the deep, hacking coughs.\nMaster Bruce hovered anxiously, huffing warm, healing breaths over him. “He’s sick,” he told Alfred. “The breath isn’t helping enough. You know how it is with illnesses.”\nAlfred did. The boys had been mother henned by both of them through several illnesses because of it.\nAlfred conceded defeat and smiled at Tim. “Well, I’m sure you’ll feel better once you lie down somewhere warm, and we get some soup in you.”\nTim hurried to scoop up a leather satchel Alfred hadn’t noticed before and walked towards him. “Thank you, M - Alfred.”\nAs he got closer, Alfred could better see the device pinned to Master Timothy’s clearly insufficient cloak. \nThe Drake family crest. Well, there was some irony, Alfred thought wryly, made even more perfect by the boy’s hinted at previous interest in dragons - \n“Timothy Drake?” he asked incredulously.\nThe boy froze. “Yes, sir.” \nMaster Bruce growled warningly, but Alfred ignored him. “I was under the impression you were your family’s sole heir.”\n“I was,” Tim admitted, “but Father’s remarried recently, and my stepmother’s young enough that getting another one shouldn’t be a problem. I was never . . . quite what my father wanted in any case, so things are probably better this way.”\n“Do you mean to tell me,” Alfred asked, tone very dangerous now as he slowly turned to Master Bruce, “that your family is still alive?”\n“Yes?” Tim was looking between the two of them, plainly anxious now. “I understand why you’re angry, but we really couldn’t scrape the tribute together this year, we didn’t mean any disrespect - ”\nAlfred remembered, vaguely, that one city’s payment hadn’t come in this year. Master Bruce had gone to check on the city out of a concern that it might be under attack, not to extract the gold; with the amount Master Bruce’s parents had hoarded, they were set for several human lifetimes even if they never received another coin.\nAlfred could see it all too plainly. Master Bruce had never been the most tactful of creatures. He would have come flying straight in, someone would have read too much into his questions, and in an attempt to appease an angry dragon, they had offered Tim up.\nAnd Master Bruce had accepted him.\n“What have you done?” His voice had gone deathly quiet now.\nBut Master Bruce did not appear ashamed. Instead, he was swelling up in anger. “They left him out there,” he hissed. “They left him out there on the wall, chained up like a dog for three days. If I hadn’t come when I did, who knows how long they would have let it go on?”\nThat . . . did rather put a different spin on things.\n“What, exactly, happened?” he asked wearily.\nTim jumped into the tale. “We started getting reports of a basilisk roaming around near the city. When it became obvious that it wasn’t going to pass us by, we started getting desperate. We sent out knights to try to kill it, but . . ” He shrugged helplessly.\n“And they didn’t think I would come,” Master Bruce said grimly.\nTim nodded. “We broke the contract. If we’d had the money, we would have sent it then, but,” he took a shuddering breath, “it had been a bad year all around. But, well,” He bit his lip. “I’ve always been . . . interested . . . in dragons.” He hugged his satchel a little tighter. “So I collected all the stories on you that I could, because you were the closest and because the way you dealt with that trickster was really cool, and - ” The tips of his ears turned red and he hurried on. “Anyway. People have known for a while about Dick, and I’d heard more recently about Jason, and there are a couple of rumors about how you act around them that made it . . . kind of obvious that you were hoarding them. And I fit the profile, and it was my idea, so I volunteered.”\n“And his father let him,” Master Bruce snarled. “And let them chain him up outside with winter coming on.”\nTim flinched a little at the reminder. “They were afraid I’d change my mind when you got close,” he said quietly. “That’s all.” He rubbed at his wrists absently, and Alfred was horrified to see that they were rubbed raw.\nTim noticed the direction of his gaze and got defensive. “I didn’t get scared,” he said firmly. “I wasn’t trying to get free, it’s just - The metal got really cold at night. It was hard to get comfortable.”\n“Quite.” Alfred had a headache coming on.\nTim moved on quickly. “Anyway, Bruce took out the basilisk, so now the city’s safe, my father’s free to get a new heir, and Bruce gets something new for his hoard. Everyone wins.” He paused for a second. “Except for the basilisk, I guess.”\n\nYes, but what about you?\n\nMaster Bruce’s attention had caught on another part of that horrifying statement. “Someone. Someone new to take care of, not something.” His giant head nudged Tim gently. “Why don’t you got meet the others? I know they’ll be happy to meet someone new.”\nTim looked a bit confused, but he did as he was told.\nThe moment he was out of sight, all of Master Bruce’s rage bubbled to the surface. “They didn’t deserve him,” he growled.\n“No,” Alfred agreed with a sigh. “I suppose we shall have to strive to provide a better home for the boy.”\n“Mm.” The young master brooded darkly for a long moment. Alfred went to start supper, knowing from experience that this could take a while.\nMaster Bruce interrupted him, though. “Alfred?”\n“Yes, sir?”\n“Why do you always assume I kidnapped them?” There was a slightly hurt tone in his voice.\nTechnically, of course, he rather had, but - “If you knew the stories of what your father got up to his youth when his hoarding instinct first struck, you wouldn’t be asking me that question,” Alfred said wryly.\nMaster Bruce perked up. “Really?”\n“That is not justification for anything you might be cooking up.”\n \n“What’s this?”\nThe other boys had accepted his presence far more easily than Tim had feared. Frankly, he was relieved just to see them up close, whole and seemingly happy, even if they were a bit younger than he had expected. He had hoped so, based on the rumors, but he hadn’t been sure. Tales of dragons hoarding humans didn’t always . . . end well.\nIn comparison to what he had feared, a little curiosity about what was in his satchel was fine, but he still blushed a little when he saw Jason start to flip through it. “It’s, um, my sketchbook. I think Stephanie managed to put the rest in here too . . ” He rummaged through the bag and emerged triumphant with the little bag of drawing supplies.\n“Stephanie, huh?” Dick asked with a knowing grin on his face.\nTim’s face grew hotter. “We’re friends,” he said firmly. “She snuck this out to me once everything was . . . decided. She wanted to try and get me loose, but she didn’t exactly have enough to bribe the guards to ignore that.”\n“Good friends, then,” Dick said. He peered over Jason’s shoulder. “Hey, is that her? She looks cute.”\nWhile Tim had considered the possibility that he might die in the next few days, he hadn’t thought it would be of embarrassment. \nJason kept flipping through the book and got to one of the parts where Tim had tried to draw more interesting subjects than the things and people he saw every day.\nA firebird - he’d actually seen one of those once, and had sketched it from memory - winged horses, like they had in the stables, a basilisk from the scattered reports they’d received.\nAnd dragons. Always dragons.\n“Whoa.” Jason actually looked impressed.\nTim couldn’t repress a small swell of pride. “I had to base those off of what I saw in books,” he admitted. “Now that I’ve gotten a closer look, I can see some of the mistakes I made. Do you think - Do you think Bruce would let me draw him?”\n“I think Bruce would absolutely let you draw him,” Dick assured him, throwing an arm around his shoulders. “These are incredible. Hey, if I teach you how to do a triple flip, will you sketch me too?”\n“He’ll teach you that anyway,” Jason informed him. “He literally can’t help himself.”\nDick made a face at him.\n“I don’t mind,” Tim said quickly. “I’ll need to try and get it right the first time, though. I don’t have much space left.” His paper would probably run out before the graphite did.\n“Oh, don’t worry about that,” Jason assured him. “Bruce’ll get you some more.”\n“I don’t want to be any trouble . . . “\nJason snorted. \nDick was the one to actually explain. “Bruce knows, like, intellectually that humans don’t hoard, but on an emotional, instinctive level I’m pretty sure he feels like he’s depriving us if he doesn’t help us build one. Which is why Jason has a small library, and I have an ever-growing obstacle course of acrobatic equipment. Drawing supplies won’t be a problem.” \nTim . . . did not know how to respond to that.\nDick had apparently grown tired of letting Jason be the one to set the pace on the drawing examination, because he’d tugged it out of his hands and was flipping through the pages himself. He paused on one of the last ones - a picture of him with his parents that was more based on fantasy than reality. He’d drawn it just before volunteering his plan.\nDick paused on it. “What happened?” he asked quietly.\nTim hadn’t told them the full story, and after how badly it had upset Alfred, he didn’t really want to. Not tonight at least. “There’s nobody that’ll miss me,” he evaded.\nWell - Stephanie might. But she’d move on soon enough.\n \nThe fourth time Master Bruce arrived with someone grimly gripping his claws, Alfred decided he had earned the benefit of the doubt. Thus it was not with judgement but with wry resignation that he stepped forward.\n“And who is this young lady?”\nShe slipped free of the master’s grip almost immediately. Her hands were clenched into fists, which was . . . concerning . . . but Alfred was relieved to see that she was in plain, functional clothes. Still not kidnapping princesses, then. Her pack suggested that she’d had time to prepare, even - \n“Where’s Tim?” she demanded. \n- or perhaps that she had been already traveling when she was caught. \nFortunately, that question was quickly answered. The boys, it appeared, had been close enough to hear Master Bruce’s return, unlike the last two times a new arrival had come. Masters Dick and Jason came running in with Master Tim a slightly shy half-step behind them.\n“Bruce! You’re back!” Master Dick crashed into Master Bruce’s leg and held onto it tightly. Master Jason was already climbing up onto his favorite perch on Master Bruce’s shoulder. Master Bruce practically radiated relieved contentment. His tail, much longer now than when this whole endeavor had started, stretched out to curl around Master Tim.\nFor once, though, Master Bruce did not have Master Tim’s full and undivided attention. Instead, he was staring, gape-mouthed, at the girl.\n\n”Stephanie?”\n\n“You’re not dead!” she cheered and ran forward to throw her arms around him.\nMaster Tim’s arms came up a half second late, but he held on just as strongly. “What happened? What are you doing here? Something else didn’t attack, did it?”\nStephanie finally let go and stepped back a bit, looking a touch sheepish. “No. The city’s fine. It’s just that I hadn’t heard anything about you, and I was worried, and no one else was going to do anything - they actually held a funeral for you, if you can believe that - so I decided I had to try and find the dragon’s cave.”\n“ . . . And then what?” Master Tim asked somewhat dubiously, his eyes flicking to the tiny knife Alfred had not previously noticed that was shoved into her belt.\nStephanie’s face went red. “You try buying weaponry on a maid’s salary.”\n“So you were going to fight a dragon with a dinner knife?” Alfred asked incredulously.\nStephanie bit her lip. “I was planning to sneak past him actually. Until he - ” Here she gestured violently at Master Bruce - “spotted me on the road and wanted to make sure I was alright.”\n“To be more accurate, I spotted a man trying to rob her,” Master Bruce said dryly. “By the time I had dived down to intervene, she had taken him down by hitting him repeatedly with a rock.”\n“I . . . might have forgotten I had a knife.”\nThey’d have to train that out of her, Alfred thought before he caught himself. “And what do your parents think of your little adventure?”\nStephanie’s mouth twisted sourly. “My dad’s in jail pretty much indefinitely, and I don’t really care what he thinks. And Mom - “ She took a deep breath and started again. “The plague finally caught up to her two years ago.”\n“She was a healer in the lower town,” Master Tim explained quietly. “Stephanie was supposed to follow in her footsteps, but she never got the chance to finish her apprenticeship.”\nThus becoming a maid, Alfred assumed. With the Drakes, presumably, and from there an unlikely friendship must have bloomed.\nAn incredibly strong friendship, if it had led her out here, which brought them to the next point. “And what are your plans now that you see that Master Tim needs neither rescuing nor avenging?”\nFor the first time Stephanie looked truly uncertain. “I . . . might not have thought that far ahead. At this point, I don’t think I can get my job back. I might have . . . said some things.”\n“She should stay here!” Dick said brightly.\nMaster Bruce failed to look at all surprised by this suggestion, and, instead, looked rather satisfied. One might even go so far as to say that he looked pleased with himself.\nJust for that, Alfred shot him a look.\n \nStephanie wasn’t at all sure about this, really, but she was still a little worried about Tim, and she didn’t have any better ideas, so she figured she should at least stay for a couple of days.\nNightfall did present a question, though. \n“Where do we sleep?” She supposed it probably wouldn’t really be a problem to sleep in the same room as the boys since she trusted Tim and both of the other boys looked younger than him, but she wanted to know.\n“When Bruce is gone, we all sleep back here,” Tim said, leading her to a corner of one of the smaller caves that basically looked like a giant nest of fluffy blankets. “But when he’s here, we’ve got something better.” He grinned at her and grabbed several blankets to dump in her arms before grabbing more for himself. “Come on.”\nHe led her back into the main cave where the dragon - Bruce, she reminded herself - was curled up to sleep. The little kid, Dick, had already claimed a spot on his back, and Jason was tucked into a little ball on his shoulder.\nTim was laying his blankets on the curled up tail. “It’s more comfortable than it looks,” he assured her. “And he’s really warm.”\nWhich up in the mountains would be good in all seasons, she conceded. She’d suffered through some viciously cold nights on her way here.\nHesitantly, she laid her blankets down next to Tim’s. Curling up in them was more comfortable than she expected, but it was kind of strange too, so she reached out and grabbed Tim’s hand. Just to make sure she didn’t fall off in the night or something.\nTim went absolutely still for a moment before squeezing her hand. “I’m really glad you came,” he whispered.\n“I’m really glad you’re not dragon chow,” she whispered back.\nTim huffed a laugh. “That makes two of us.”\n \nTheir next addition, like Mistress Stephanie, was not entirely Master Bruce’s fault.\nIt was, of course, still mostly Master Bruce’s fault, but not entirely. It started, after all, while he was on patrol.\nWhen Alfred first noticed there were small bits of food missing, he thought little of it. He assumed that one of the children had simply gotten hungry.\nIt was only when Master Bruce returned and immediately tensed at the smell of an intruder in the cave that Alfred realized they had a problem on their hands.\nA problem that would be easier to deal with if Master Bruce was not wrapped around the children and growling.\nOr, at the very least, if Alfred was not trapped in the middle of it too.\n“Master Bruce,” he said in exasperation. “I agree that this is most unsettling, but considering that they took the food and left both the gold and the children alone, it seems that we have a most unusual intruder on our hands. If they meant any harm, surely they would have done it already.”\nIt took an unfortunate amount of time, but at last Alfred was able to convince him of this, and Master Bruce slowly unwound.\nAnd it seemed that in the interval he’d had time to think.\n“Just the food,” he confirmed.\n“Indeed.”\nMaster Bruce’s eyes gleamed. “Then perhaps it’s time to set a trap.”\n \nHe had anticipated many possibilities when he set the trap. Some supernatural being intent on mischief that was able to slip invisible into his cave. One of the al Ghul’s Dragon Guard come to punish him for some offense by plotting to hurt those that were his, his to protect, his to cherish, his to care for -\nThe seething ball of rage in his chest had burned all the hotter at the possibility.\nHe had not anticipated a girl.\nShe was young. Small. If the little one had come to do harm, then surely it was not of her own volition.\nShe used the netting she was caught in to raise herself up slowly. Dark eyes, wide with confusion, blinked up at him from behind a mess of tangled black hair. From what he could see through the furs she’d wrapped around herself, she was thinner than even Jason had been when he had first been found.\nJust the food.\nHe was gentler than he had intended to be. “Who are you?”\nThe girl just let out a soft keening sound and reached for the food that had been used to bait the trap.\n“In a few minutes,” he promised her.\nShe made the sound again, except - \nExcept it wasn’t just a noise, Bruce realized suddenly. He’d heard that sound before from warg pups who were begging their parents for food.\nHe did his best to mimic the call he’d heard repeatedly during the years the rain was scarce.\n\nLater. Later.\n\nThe girl sagged sadly, but she didn’t make the keening noise again.\nShe’d understood.\nWhat had happened to this girl? Where was her family? Why hadn’t they protected her?\nHe tried to replicate the long call that wargs used when an unfamiliar warg approached. When it failed to elicit anything more than confusion, he tried again.\n\nWho are you? Whose pack are you from? Are you foe or friend?\n\nThe girl bared her neck and made a small, puppy like sound before making a sharp “kuh” sound followed by a hiss.\n\nFriend! Friend! Small! Harmless!\n\nThat, aside from the battle-sounds, the fear-sounds, and the dying-sounds, was about all he knew. He didn’t know what that last bit might mean.\nUnless.\nHe brought up his tail and tapped himself on the chest. “Bruce.” Then he tapped hers, ever so gently and repeated the sound she had made.\nShe repeated it, and then patted his tail. “Bruce,” she said awkwardly.\nSo that sound was her name. Kuh-hiss. Kuhss. \nOr, to make her name more manageable as the children had made his, “Cass,” he tried, tapping her chest again.\n“Cass,” she agreed. “Cass, Bruce.” Then she made the hopeful keening sound again.\nDespite what she said, she wasn’t completely harmless, and he knew it. If she’d been raised by wargs, then she must be able to fight and fight viciously. He’d have to watch her carefully when she was with the others.\nBut he couldn’t just let her go back into the wild. She was obviously starving, she was covered in scratches, and she was just so small.\nHe used his claws to cut the netting and then carefully lowered her down. She scampered over to the food immediately and began shoving it in her mouth.\nHe curled up in front of the cave entrance so that he could be sure she wouldn’t run off once she finished. He kept his eyes fixed on her.\nSo small. So precious.\nHe exhaled long, warm breaths over her and felt instant relief when the cuts, even the angry red one that might be infected, immediately began to heal.\nCass looked up immediately and made a noise he didn’t know how to interpret. She tried it again when he didn’t respond before hesitantly reaching out to touch his scales.\nHe leaned into the touch.\nCass made a happy noise, and this one, he realized, he knew.\n\nPack.\n\n“Yes,” he rumbled. Pack.\nShe was part of his now, and he’d take far better care of her than her last one.\n \nAs resigned as Alfred had become to the fact that they would periodically be adding new people to the cave, he hadn’t expected to ever reach a point where he would miss the moment human children were brought in.\nThat was before the point a dragon child showed up.\nAn adolescent, Master Bruce could have simply chased away, but this was truly a child. There was no possibility that he could have flown this far; if someone had not carried him, then he must have made it to the cave in a series of short, gliding flights and jumps.\nAnd he knew the distance had been far because while the little dragonet might have had his father’s rare black scales, he had his mother’s viciously green eyes.\nAnd at least something of her temperament, more’s the pity.\nAll of which he registered later. What happened first occurred as the children’s lessons under Mistress Barbara devolved into a mass play-fight, as if they were warg pups instead of civilized children.\nWell. Mostly civilized children.\nWhat happened first was that Master Timothy ducked out of the fight, still laughing, hands up in temporary surrender so that he could run and get some water from the jug Alfred kept on the other side of the clearing so that was safely out of the way of the children’s exertions.\nWhat happened was that as he did so, a little black dragonet pounced from an unseen perch in a tree and snapped down on his shoulder in an impatient bite.\nMaster Tim’s scream was not a sound Alfred was ever likely to forget.\nGiven more warning, Master Tim might could have won the fight, but he had no room to move now, and blood was pouring out of him at an awful rate. Alfred raced forward, the sword he was never without when they left the safety of the cave already drawn.\nThe children turned, only a little slower, and then let out screeching war cry and ran forward. \nIf any more of them got hurt, Master Bruce was going to be furious.\nAlfred leaped forward and used his momentum to ram the beast’s shoulder. If he could just get him off Master Tim, could just keep him from taking another, potentially fatal, bite - \nThe dragonet was light enough to be moved by the force, but Master Tim let out another cry of pain as the claws raked over him. The other children were there in another instant, leaping on the dragonet and pinning his wings, bashing at him with their practice weapons. Mistress Cass was tearing at the vulnerable membrane with her teeth, Mistress Barbara was lunging forward to try and get the eye - \nA terrible roar shook the trees. Master Bruce landed with a thump that rattled the ground. \nEveryone froze.\nMore snarls ripped their way out of his throat. The children rolled off the intruder and hurriedly backed away.\n“What. Have. You. Done?”\nThe dragonet shrank against the ground. “I was hungry.”\n“So you tried to eat a person? So you tried to take one that is mine?” Master Bruce pinned him to the ground with one clawed foot and held him there with contemptuous ease. His voice was considerably gentler when he turned to Master Tim. “Tim?”\nMaster Tim’s breath was coming in little shuddering sobs. A whole chunk of his shoulder was just gone.\n“Shh. It’s alright. You’ll be alright.” Master Bruce kept a steady stream of soft words over the boy, each puff of warm breath slowing the blood loss and mending the jagged hole. “I got here as soon as I could, Tim. I should have come with you out here, but it’s alright now. It won’t happen again. You’re alright.”\nThe hole was gone, but not even dragon breath could fix everything. Master Tim was still pale with blood loss and the memory of pain. His breathing was beginning to be a bit steadier.\n“There you go. That’s better.” Master Bruce reached out a clawed hand and cradled the boy close. “You’ll be alright now.”\n“It’s fixed?” Stephanie checked.\n“As much as can be,” Alfred assured her. “Mistress Barbara, perhaps you should escort the others back to the cave.\nThe young woman - and goodness, it was hard to remember that she was a woman now, despite the fact that she looked a few years younger than her real age - nodded and began to herd the reluctant mass of children back to the safety of the cave.\nMistress Cass refused to leave. Instead, she sat crouched as she hadn’t for months now, growling a threat at the small dragon still trapped under Master Bruce’s claws.\nAlfred sighed. Well, perhaps it wouldn’t hurt to let her stay since Master Bruce was here to handle the situation.\nWhen the children had disappeared from view, Master Bruce let the dragonet up just enough that he could look at him. “Explain,” he growled.\nGiven the fact that Master Bruce had yet to take him by the neck and shake some sense into him, and considering Master Bruce’s intelligence, Alfred later suspected that Master Bruce had already guessed.\nThe little dragonet shook the grass off and tried to raise himself into a proud posture. “ I am - ” He let loose the usual rockfall sound of a dragon name. “Son of - ” The next name was no more repeatable, but it was familiar.\nThe favored daughter of the al Ghul clan. Alfred suspected that the children would simplify her name to something starting with a ’t.’ Talia, perhaps.\nThe next bit, however, was more concerning. “My grandsire grows old. He wishes to prepare me for the high magics that I may be his next vessel.” He drooped a little. “My mother, however, believes me unworthy of this honor. She sent me here.”\nAlfred rather doubted that worthiness had been what plagued Talia’s mind. Remnants of conscience, perhaps, or a mother’s love.\n“The egg.” Master Bruce’s eyes had narrowed to slits. “She told me the egg was broken.”\n“She did not wish to,” the dragonet said defensively. “Grandsire did not want you to know of me. He feared you would interfere with his purpose.”\n“So instead she raised you in that place of death,” Master Bruce spat. “And taught you to kill when you did not have to.”\nThe dragonet shrank back even as he tried to pretend he didn’t.\nMaster Bruce took a deep breath. “You are staying here.” It was half statement, half order. “You will not harm any of the others again. You will apologize, sincerely, to Tim. And if your grandsire comes anywhere near here, I will rip him to shreds.”\n \nHe had no wish to offend his sire further - his earlier mistake was still heavy on him - so he had not intended to provoke further hostilities when he curled up at the base of his sire’s neck when it was time to sleep.\n“That’s Dick’s place,” one of the little humans said. Jason, possibly. His jaw was set like he was ready to fight. “You can’t sleep there.”\nThe littlest one, Dick, presumably, just tilted his head in consideration. “It’s fine,” he said cheerfully. “I’ll just sleep on Bitey instead.”\nAnd then the boy promptly climbed on top of him!\nOutrage seemed too weak a word. He was tempted to shake the insolent boy off, but his sire was already tensing, and he had no desire to provoke him further.\nDick leaned down and patted his sire’s scales. “Don’t worry, we’ll figure something else out tomorrow. Won’t we, Bitey?”\n“Do not call me that.”\n“Well, we have to call you something,” the boy said. “We can’t pronounce your real name any better than we can pronounce Bruce’s.”\nA sleepy voice called up from his father’s tail. “As the one he took a bite of, I think I should get to name him.”\n“Fair point,” Dick conceded. “Any objections?”\n\n”Yes.”\n\nUnfortunately, it seemed none of the other imbecilic children did, so he was outnumbered. \n“So what’s the verdict, Timbird?” Jason called.\nTim was silent for a long moment before announcing, “Damian.”\n“Damian?” the girl beside him demanded. “You’ve got the perfect opportunity for revenge, and you choose Damian?”\nBut even in the dark, the newly dubbed Damian could see that Jason was grinning. “Oh, I think the name Damian is a great revenge. ‘Cause I’m betting Tim knows what it means.”\nDamian did not know what it meant. He refused to admit it.\nFortunately, the other girl made a questioning noise, and he did not have to.\n“Tame,” Tim announced smugly. “It means tame.”\nHe could have born the other’s laughter better if he had not felt his sire’s rumbling beneath him.\n \nAfter that, well, the others failed to faze him much. Duke, Helena, Carrie - all were easy enough after that.\nEven when, as Master Duke did, they had questions.\n \n“So you know how when Jason got kidnapped Bruce went kind of crazy until he got him back?”\nAlfred paused in the act of washing the plates. “That incident would be rather hard to forget.” They had gotten him back quickly enough, and there had been no damage that Master Bruce’s breath couldn’t fix, but they had been a traumatizing few days all the same.\n“How’s he going to handle it when we die?”\n“Ah.” That was a relief. Alfred had been half afraid that Master Duke’s previous statement had been some strange attempt into easing him into the news that there had been another abduction. He continued washing the plate. “You’ve been here for two years now. Haven’t you ever wondered at Master Dick’s age?”\nMaster Duke frowned. “I mean, he’s not really growing a lot if that’s what you mean.”\n“Imperceptibly,” Alfred agreed. “And have you noticed how in some ways he is treated as the oldest despite to all appearances being the youngest?”\n“I have a weird feeling about where you’re going with this.”\nAlfred smiled wryly. “Dragon breath cures many things, Master Duke. Not quite including mortality, but it does slow it down quite a bit.”\n“How much are we talking here?” he asked cautiously.\n“How old would you guess that I am?”\n“Well, before I would have guessed sixty or seventy-something. Now . . . over a hundred?”\nAlfred laughed. “My boy,” he said with amusement, “I barely remember being a hundred.”\n \nThe upside to not advertising where a dragon’s cave was located was that it significantly cut down on the number of thieves who came looking for gold.\nThe downside to not advertising where Master Bruce’s cave was located was that bandits there on other business didn’t know to stay away.\nThat was a downside to both parties, really. It was an inconvenience to Master Bruce and the children, and it was a considerably greater one to the criminals involved.\nParticularly when those criminals had the nerve to style themselves after a certain trickster spirit that Master Bruce had thrown out of his territory after considerable bloodshed.\n \nIt figured that his first trip out of Gotham that wasn’t even vaguely shady was also going to be his last.\nTerry bolted up the winding mountain path, but his legs weren’t going to hold out much longer. He might have the advantage of youth, but the men behind him were running on some kind of crazed power.\nWhich, knowing his luck, needed to be fueled by the blood of stupid teenagers who actually thought they could turn their lives around. Magic could be weird like that, couldn’t it?\nIf he could just find a place to fight them before his legs gave out - Well, he would still die horribly, but he could at least die with a little self-respect. And possibly with enough breath to have actual last words instead of just last gasps.\nHe could just make out an opening in the rock up ahead. It was big, too big to hold them at, but at least it was something to aim for. Maybe it would narrow as it got deeper.\nIf he could make it that far.\nA figure dropped from the rocks above him and landed in a crouch right next to him, a long staff balanced in both hands.\nTerry skittered back, fists coming up to fight, but this wasn’t one of the bandits. At least, he wasn’t dressed like them.\n“Stop!” the figure shouted. His voice was powerful enough that the bandits actually came to an abrupt halt for a moment.\nThen they came to the same realization Terry had: this kid was a couple of years younger than even he was.\nThey started to stalk forward. Slowly now, with that low, steady cackle building amongst them.\nThat was when the kid’s face abruptly got kind of . . . dangerous. “Last chance to leave the mountain,” the boy warned, spinning the staff in his hands.\n“They’re not gonna stop,” Terry warned. Not that the kid seemed inclined to back off, so Terry sucked in as many deep breaths as he could so he’d be ready to fight.\nThe leader’s smile was stretched unnaturally wide. “You really think you can kick us off your mountain, kid?” He sneered on the word ‘your.’\n“I’m not the one whose laid claim to these mountains,” the kid said calmly. “I’d have thought you would have known that.” He let loose an ear piercing whistle.\nSuddenly, more kids were dropping from the rocks above them. All landed perfectly and with weapons in hand.\nMore importantly, two adolescent dragons dove from the sky with shrieks that split the air.\nAnd behind them, something was walking forward. Something that made the rocks on the path jump and the whole earth shudder a little beneath his feet. Something that cast a long shadow over them.\nTerry dared to take a quick glance back and promptly gulped.\nSuddenly the smaller dragons overhead seemed positively manageable.\nThe bandits, sensibly, ran. \n“Helena,” the nightmarishly large dragon ordered. One of the smaller dragons zipped after them, spitting flames to keep them running.\n“Barbara may get to spring her trap today after all,” the kid beside him said with satisfaction. \nThe other smaller dragon - although that was a really relative term - crashed down beside them. “Speaking of plans gone awry,” it - he? - said sourly.\n“The rest of you weren’t in place yet. I improvised.”\n“You idiotically put yourself in pointless danger. The victim could have made it a bit further.”\nTerry kind of resented that labeling. He just wasn’t sure if he was up to arguing with a dragon about it.\nMaybe when he got the rest of his breath back.\n“Is that caring I detect, Damian?” The other kid was actually grinning at the dragon, and you know what? Maybe he should slip away while they were still distracted.\nNaturally, as soon as he took a step, the nightmare dragon looked down at him and said, “So you’re the one who distracted the Jokerz from their usual habits.”\n“Not intentionally, believe me. Why don’t I just get out of your way, and - ”\n“Not while you’re hurt, young man,” an elderly voice said firmly. An old man appeared out from under the shadow of the dragon. “There’s blood leaking out from under your sleeve there.”\nHe’d forgotten about that.\n“And some water probably wouldn’t go amiss either.”\n“I’ll take the water,” he conceded, “but after that, I’ve really got to go. I was trying to lead those guys away from my girlfriend, and I need to go make sure she’s alright.” She’d been injured, so he’d been forced to hide her, run, and hope to lead them away from her. If it hadn’t worked . . . \n“If you’ll tell us where you left her, Damian can go check now,” the big dragon offered. “He could get there far faster and bring her back here. If she is injured, we can help.” Then he leaned forward and breathed on Terry, which was weird.\nRight up until he noticed that his arm didn’t hurt anymore. \nOkay, maybe these guys could help. Now that he’d calmed down some, and was thinking it through, Gotham had some kind of deal with the dragon in the mountains, right? He helped defend them and didn’t eat people, and they sent up big wagons of stuff to his cave every year. Terry had never paid much attention to the details.\n“Okay,” he agreed. “That would help a lot. Maybe I can still get back to Matt before the city gates close tonight.”\nSomething about this caught the dragon’s interest. “Matt?”\n“My little brother.” There couldn’t be any harm in sharing that, could there? And he was kind of worried. Their neighbor had agreed to watch Matt for a couple of days while Terry was gone, but Terry wasn’t sure what she’d do when the time was up.\n“Won’t your parents watch him?” The dragon’s interest was definitely caught now.\nTerry winced. “That’s not really a possibility anymore.” \nOne of the taller kids, the one with a red hooded cloak, walked up behind and put an arm around him. “Now you’ve done it,” he said cheerfully. “Welcome to the family, kid. I don’t suppose the girlfriend’s orphaned too? And what’s this about a brother?”\nIt had been hours since the zucco had been chased away by the big black dragon. Dick slowly uncurled from his hiding spot in the ruins of their wagon. His mother had thrown him clear of it, and he’d caught hold of the slats of the bridge and held on until the whole thing stopped falling -\nDick froze in place until the horrible swooping sensation of the fall had faded enough for him to move again. The wagon had provided cover from the zucco, but he couldn’t stay there forever. He had to get out and find the others. They had to be hurt or they would have found him by now.\nBright splotches of color dotted the floor of the ravine. The long half of the ruined bridge lay draped across the dirt. The short half swung in the breeze. \nThe little flutters caused by the wind were the only movement.\nDick moved slowly through the wreckage. He stopped when he got to his parents. They had been flung away from the wagon by the fall.\nNo one else was moving.\nDick curled up in a little ball by his dad. A small, choked sound worked its way out of his mouth. He clapped a hand over it instantly. The zucco could still come back.\nAnd if it did . . . Dick had seen a lot of dead things as their caravan travelled from place to place. He knew what animals did to bodies.\nThe soil of the ravine floor was loose. Sandy. He didn’t have any good tools, but he could at least try.\nHe scooped up two handfuls of dirts in his small hands and determinedly poured them . . . down. He couldn’t think any more specifically than that. He just had to keep moving, keep working, and not think.\nThe little choked noises kept trying to come, and his breathing felt kind of funny, but Dick just reached for more dirt.\n \nThe zucco safely taken care of, Bruce flew back to the ravine. He’d need to get a good look at the bridge so he could give the nearest prince a better idea of how to fix it.\nSeeing the remnants of the caravan below made him growl. They had been on his territory and thus under his protection. He should have stopped this.\nThe brooding thoughts were interrupted by a scrap of movement. He peered down.\nA little boy was moving slowly around two larger bodies. One of them was slowly being covered by a thin stream of dark earth. \n\nOh.\n\nThere were two stone cairns, slowly built with his own juvenile claws, covering the bodies of his parents. Alfred had been with him the whole time, but he had still felt alone.\nHe couldn’t just leave the boy there. He couldn’t. He could - he could help him with the burial. His claws could dig up masses of dirt far quicker, or he could carry down some of the readily available stones and build a cairn for the caravan. Yes. He should do that.\nThere was just enough room for his to fly down, so he dove down beside the boy.\nThere was nothing to say. He knew that. Nothing could possibly help. \nThe boy had jumped away at the sound of his landing, but he hadn’t screamed. A second later, he had moved back, arms stretched back protectively around his parents’ bodies. His eyes were wide, and his whole body was shaking, but he didn’t move.\n“I won’t bother them,” he said gently. “I’ll help if you want.”\nThe boy had jumped again when he spoke, but then he nodded slowly. \n“I can get stones if you like,” he offered, and the boy nodded again.\nHe worked more slowly than he needed to. The boy needed time to say goodbye, and he needed - something. He wasn’t sure what. He couldn’t leave the boy in the ravine, that much was obvious, but he didn’t want to leave him somewhere else either. His instincts were telling him it was important to keep the boy with him, but he wasn’t yet sure why.\nThe boy’s parents got a grave together. The rest, he gathered gently in his claws and laid out for a larger one. \nAs the hours wore on, the boy’s eyes jumped warily to the top of the ravine. Eventually, he realized what was going on.\n“The Zucco’s gone,” he assured the boy. “I took care of it.”\nThe boy’s shoulders relaxed a bit as he got back to work. \nThere was blood on the boy’s hands from scrapes, and he was concerned at the way the boy still hadn’t spoken. He kept surreptitiously breathing on him, but although it fixed the scrapes, he still didn’t talk.\nWhen the work was done, the boy looked around in bewilderment. \nObviously, he hadn’t worked out what to do next. That was fine. He had a plan now. “Why don’t you come back with me?” he suggested. “We can come back tomorrow for anything you need.”\nThe boy only hesitated briefly before nodding.\nThe anxiety in his chest calmed. Good. He couldn’t fix this, but he could help. \nAnything that wanted to hurt the boy now was going to have to get through him.\n \nFor the record, Jason had known stealing from a dragon was a bad idea, but he’d been out of good options. He hadn’t been able to turn anything else up for days, and if he stayed out in this cold much longer, he wasn’t going to live to feel the spring’s thaw. \nHe’d been smart about it too. He’d done it at night with the tools he needed to break one of the little ornaments off all ready. No one had been expecting the dragon for another week.\nSo it hadn’t been as stupid as it could have been, and it was just his rotten luck that this had been the one year the dragon had decided to come early.\nHe hadn’t even realized the dragon was coming until a sudden gust of wind had come straight down, and he had looked up to see leathery wings settling into place after one last flap.\nHe gulped as he backed away. Maybe the dragon wouldn’t see him -\nThe dragon’s head turned towards him. The enormous eyes glowed gold in the dark. “Hello, there.”\nThe sound that came out of Jason’s mouth was absolutely not a squeak. “Hi. I was just, just taking a look at your new perch there, it’s very nice, so I’ll just leave you to it - “ He’d been backing away as he spoke, but he’d misjudged in the dark. His back hit a stone wall, and the copper figurine tumbled out of his cold numbed fingers. It bounced across the cobblestones before coming to a stop right in front of the dragon. The moonlight glinted off it.\nHe was dead.\nJason bolted. Maybe, maybe the dragon wouldn’t realize what it was? He’d never seen the ornaments before, it would at least take him a second, surely - \nA large scaly tail whipped around and curled around him, cutting off his retreat. \nSo this was it. Jason Todd, killed by dragon.\n. . . Which was admittedly more impressive than dying in a miserable, frozen little huddle, but it also sounded at least potentially more painful.\nNot like he was going to get a choice in the matter. \n“I’m sorry!” he blurted out. Maybe the dragon would at least kill him quickly? “I only took the one, the others are still there, I swear!”\nThe dragon blinked at him and then looked down at the little figurine. “What do you - Oh. That?” He glanced down at the perch. “Those are new.”\nHe hadn’t even noticed. He had stopped Jason for some other reason, maybe just because he’d been stupid enough to run, and now he was going to die because he hadn’t been able to keep his mouth shut.\nFantastic.\n \nStopping the boy had been impulsive, Bruce admitted, but he’d just looked so cold. His teeth had been chattering even as he sped through his nervous explanation, and there was a faint blue tinge to his skin that even the warmth of his tail hadn’t entirely gotten rid of. And he was so thin.\nThere was so much food back at the cave. He had a hard time judging warmth himself, but Dick certainly never shivered like that.\nSomeone obviously wasn’t taking care of him properly. \nBut - Well, he had to check. “And what do your parents think about you going out at night to steal from dragons?” Personally, Bruce was rather impressed at the audacity.\nThe boy tensed, but he shrugged and answered the question. “Dad got hung for thievin’. Mom . . . Mom got real sick.”\nThere was more to that story, but Bruce understood. Far too well. \nAlfred had given several long lectures about how Bruce couldn’t start stealing people just because he’d found Dick. Bruce understood that, but taking the boy with him wouldn’t be stealing. There was no one left to claim him for their family-hoard. And if he left him out here, he would die.\nBesides. Dick would love a brother, and Alfred had been talking about how important it was for children to socialize with their own kind. Maybe this would cut down on some of Dick’s nerve wracking trips out of the cave. Everyone won.\nHe did have business in the city, but he was early for it. He could just come back.\nHe curled his tail tighter around the boy, so he could gently lift him closer to his claws. “What’s your name?”\n“Jason,” the boy said warily. “And you can’t eat someone once you know their name, that’s just not right.”\n“I’m not going to eat you.” Breathe on him, yes. He needed to make sure Jason was safe and healthy. “I’m going to take you home.”\n \nTim’s wrists ached. He knew he should stop moving them, but with the cold metal pressing into them, it was hard to stop himself, especially when he coughed and they automatically jerked.\nThe grey, watery dawn had finally come around again. That was something. It should warm up a little soon, possibly even enough that his shivering underneath the cloak wouldn’t be visible.\nNothing, however, was going to make the fact he could hardly breathe through the congestion any easier to conceal.\nTim slowly forced himself to his feet. The chains had just enough slack to allow him to sit against the wall and try to sleep at night, but the effort was useless. He hadn’t slept more than a handful of hours since he’d come up with this plan.\nThe effort of standing pulled loose a few more bone rattling coughs. Tim was losing hope that the illness would pass before the dragon arrived.\nMaybe, he thought desperately, just maybe, it could work in their favor. Jason had been a street kid when he’d been claimed, so surely he hadn’t been in the best of health, and Dick had just survived a zucco attack. Maybe the dragon liked claiming those who were a bit worse for wear, like a collector who took pride in restoring old pieces to their former glory.\nEqually possibly, he would see Tim’s state and grow offended that they were trying to give him damaged goods. Tim wasn’t sure what they’d do then.\nThe leather of the satchel Stephanie had brought him pressed against his knees. He could just feel the four corners of the book she’d slipped into it.\nMaybe his illness was irrelevant. There had been a dragon to the south several hundred years ago that had collected beautiful people and had them killed and preserved to look at the height of their beauty forever. Another dragon had collected bones, and so had ripped the flesh off his still living victims so that -\nTim tore his mind away from the book and steadied his breathing. Jason and Dick were still alive. \nWhich didn’t mean they were happy or that the dragon might not arrive, decide him unsuitable, and then make a snack out of him just so as not to have wasted the trip.\nFor the city, he reminded himself. For the people. This was his duty. He wouldn’t shirk it now.\nNot that he could if he wanted to. The chains made sure of that.\n\nPlease let the dragon not think he was damaged goods.\n\nIf his mother had still been alive, she’d have been sensible enough not to keep him out here until the dragon arrived. Although if his mother had still been alive, they might not have been in this situation in the first place. She could have found a way to squeeze gold out of ash.\nBut his mother was dead, and it was too late for anything else now. This would work. This would be fine. \nThat was about the time it started to rain.\n \nTim wasn’t sure how long it had been raining when he gave up and just curled up in a miserable little ball. There was nothing to shelter him from the rain, so all he could do was duck his head and hunch his shoulders as the icy water slid down his back.\nShockingly, this did his cough no favors. And judging by the way everything was getting a little foggy, Tim was coming to the slow conclusion that he might have developed a fever.\nYou’d think a fever would at least do him the favor of keeping him warm.\nHe noticed it vaguely when the guards started shouting, but he couldn’t muster up the energy to try and figure out what was going on. The wind picked up suddenly, but it died down just as quickly, so he didn’t much care. He couldn’t muster up the energy for much of anything until the rain abruptly stopped falling on him. He could still hear it, but none of it was hitting him.\nHe stared forward blankly for a second before daring to look upward.\nA large black wing was being held protectively overhead.\n\nOh.\n\nA warm breath blew over him, and he soaked in the heat gratefully. The warmth lingered as it settled into him. It might be his imagination, but it seemed like he could breathe a tiny bit better, and his thoughts were definitely clearer.\nDragon’s breath.\nHe turned to look at the dragon properly, but the dragon’s head had already risen to address the guards.\n“What is going on here?”\nHe didn’t sound happy.\nThe guards agreed with his assessment. “The - the - the boy,” one of them stammered out.\n“I can see there’s a boy,” the dragon snapped. “I don’t see any possible justification for punishing him like this.” The wing lowered protectively.\n“It’s not a punishment,” one of the older guards hurried to explain. “We’ve sent a runner to Prince Drake, if you’ll just wait for him he can explain everything - “\n“I’m not inclined to wait.”\nThe dragon was just growing angrier. Tim couldn’t risk him deciding to take it out on someone else.\n“Basilisk,” he said. Then, drawing in a breath so he could speak louder and praying it wouldn’t set off a coughing fit, he said, “There’s a basilisk.”\nThe dragon turned back to him immediately. His voice was noticeably gentler when he spoke. “So this is some plan to deal with it that’s gone horribly wrong?”\nSort of. “We can’t kill it,” he explained. “Need you to. But we couldn’t afford the tribute. Tried - “ It was important that the dragon understand that, but jagged coughs ripped out of him before he could explain further.\n“It’s alright,” the dragon said. More warm breaths washed over Tim until the coughs eased. “It’s alright. I’ll take care of it.”\nTim relaxed into the stone wall. “Good. Thank you.”\n“But how did that lead to you out here?”\n“Couldn’t pay with gold,” Tim reminded him. “But there were - rumors.” He coughed again, but the fit was much briefer this time. “Rumors you hoarded kids.” A specific type of child, although two weren’t really enough to be a definite pattern. Tim was just glad he fit the profile so they didn’t have to find out.\nBut he’d said something wrong. The dragon was growing angry again. “So they ripped you away from your family as a sacrifice.” His head swung around to glare at the guards.\n“It was his idea!” one of them yelped. “We swear! Prince Drake will tell you!”\n“I volunteered,” Tim confirmed. “My father . . . agreed.” That shouldn’t hurt. It was ridiculous to propose a plan and then be hurt when his father didn’t oppose it for once. It was a sign of respect, not an eagerness to get rid of Tim. He knew that.\n“He agreed.” There was something truly terrible in the dragon’s voice now, and it took all of Tim’s courage not to cringe into the stone. This could go so badly, and it would be all his fault if it did. This was his plan. He had to make it work. “The chains don’t exactly support the ‘volunteer’ story.”\nTim’s head ducked a bit in shame. If he’d just proven to his father that he was brave enough for this . . . “I did,” he insisted. “They were just afraid I’d change my mind.”\nThe dragon growled.\n“Prince - Prince Drake is almost here,” one of the guards reported. He pointed a shaky finger down the stairs to where a hastily put together entourage is quickly approaching.\n“Good,” the dragon growled. “Get the boy loose from those chains. The prince and I are going to have a talk.”\n \nDespite what Alfred kept insinuating, Bruce fully understood that he couldn’t just steal people from their family-hoard. \nHe remembered all too well the feeling that had come when Talia had told him what had happened to their egg. He wouldn’t inflict that on anyone else.\nIt was tempting sometimes, he admitted, but he was not without self-control. Getting explicitly offered a child was pushing said self-control, but he could have held on. He could have.\nIf not for the prince himself.\nHe finally arrived with his entourage in tow and a speech all prepared. A lot of flowery apologies. A repeated explanation of the situation. \nAbout the only thing of value he got out of it was the boy’s name. Timothy. Or, more likely, Tim.\nWhat he did not get was a satisfactory explanation as to how the prince could have even considered going along with Tim’s plan - or, worse, how he could have driven to such a further extreme. \nProtecting territory was necessary. Giving up gold-hoard for it was admirable. Giving up book-hoard, food-hoard, animal-hoard, even - But family-hoard?\nIf you were willing to give up family-hoard, you didn’t deserve it. \nIf the prince’s eyes had stayed locked on his son as he spoke, Bruce might have had it in him to fly away. If he had been unable to look, even. But instead he shot him periodic apologetic looks during his speech, and with each weak expression of emotion, Bruce’s rage grew.\nHe knew what it was to properly value a family-hoard. He knew how to treasure young.\nTim was his.\n \nStephanie admitted two weeks into her journey that maybe she hadn’t fully thought through her plan. It had all seemed so simple when she was storming out of the city, but now . . . \nWell, there hadn’t been a warrior in the city that could take out the basilisk, but the dragon had done it with ease. She didn’t like what that said about her odds against the dragon if it caught her.\nBut she couldn’t just abandon Tim. Even if it was . . . too late . . . she could at least do the proper funeral rites. \nOf course, she’d have to get his body a fair distance away from the dragon to do that, so that would mean carrying - \nStephanie pulled her mind firmly away from such thoughts. Tim would be fine. She would be fine. Everything would be just fine.\nShe kicked a rock for emphasis. It bounced across the packed dirt road before coming to a rest at the bottom of the hill she had just crested.\nSpecifically, it came to a rest against a man’s boot.\nA rather unsavory looking man.\nStephanie leaned down and grabbed another rock.\n \nBruce landed beside the unconscious man with a thump. He touched one claw gently to the man’s bleeding face. “Impressive.”\nThe girl yelped something that could have been an agreement. Then something bounced against his snout.\nBruce looked down at the ground. A rock had just fallen next to his foot. He looked back at the girl. “Did you just throw a rock at me?”\nThe girl lowered her arm. “ . . . Reflex?”\nBruce snorted a laugh and peered at her more closely. “Are you hurt?”\n“Nope. I’m good.” Her voice was still a bit concerningly high. Bruce breathed on her a bit just in case. \n“What are you doing traveling out here alone?”\nThe girl crossed her arms. “I can travel alone if I want to.”\n“You can,” Bruce agreed. It was brave to the point of recklessness, but she could. “But seeing as even most seasoned warriors don’t, I assumed you must be doing so to some purpose.”\nShe bit her lip. “I’m looking for someone.”\nBrave and loyal then. Dick would like her - \nBruce stopped that thought before it could get out of control. Remember what Alfred would say, he told himself firmly. “Who are you looking for?”\n“I’m sure you’ve got better things to do than to help me,” she hedged.\n“Finding people is important,” he said firmly. His eyes caught on the symbol embroidered on her dress. A maid’s uniform, likely, but that wasn’t the important part. “You’re from Tim’s city!” Which was not the actual name, and he would have to explain -\nBut no. Red had rushed to her face, and she had taken a wary step back.\n“You’re looking for Tim.”\nThe girl jutted her chin out. “And if I am?” Her voice shook a little despite her best efforts.\nThis was perfect. He’d heard Tim talking about a girl named Stephanie. It must be this one. He could bring her back to the cave, and the others could talk her into staying. Even Alfred couldn’t object to this one.\n“Then I am happy to say that I know exactly where he is. May I offer you a ride?”\nThis, Bruce thought smugly when Stephanie gave a hesitant nod, was an excellent plan."
}