{
    "id": "13578483",
    "url": "https://archiveofourown.org/works/13578483?view_full_work=true",
    "author": [
        "IncompleteSentanc (Erava)"
    ],
    "title": "Shiryō",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Naruto"
    ],
    "relationships": [],
    "characters": [
        "Haruno Sakura",
        "Ootsutsuki Hagoromo",
        "Uzumaki Naruto",
        "Uchiha Sasuke",
        "Senju Hashirama",
        "Uchiha Madara",
        "Senju Tobirama",
        "Uchiha Izuna",
        "Sarutobi Hiruzen",
        "Namikaze Minato",
        "Uzumaki Kushina",
        "Kyuubi | Nine-tails | Kurama"
    ],
    "additional_tags": [
        "Another Time-Travel Fix-It",
        "Sakura Does The Time Warp Again",
        "Hagoromo Comes Along For The Ride",
        "Semi-Sad Fic",
        "Hints of crack",
        "Sakura Channels Kakashi At Random",
        "Deus Ex Sakura",
        "Sakura Didn't Ask For This Shit But She Does It Anyway",
        "Sakura And Kurama Bro It Up",
        "Technically Sakura Is A Zombie",
        "Lighthearted Ending"
    ],
    "language": "English",
    "series": "",
    "published": "2018-02-05",
    "completed": null,
    "words": "8,753",
    "chapters": "1/1",
    "comments": "179",
    "kudos": "6,831",
    "bookmarks": "1,879",
    "hits": "43,908",
    "summary": "<p>Shiryō - a vengeful, dead spirit, left to haunt the land they died upon.</p>\n<p>Sakura wasn’t sure what Naruto was thinking when he used that jutsu of his, but she was trapped dealing with the consequences.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>Hope you enjoyed ♥ Tried to end it on a cheerful note!</p>",
    "text": "\nSakura couldn’t say what possessed Naruto to do what he did, in the end.\n\n\n“I’m trusting you.” Is all Naruto said, white-faced and agonized, when Sakura had asked \n\nwhat the hell is that seal?\n\n\n\nHe slammed his palms to the seal, Sakura saw the white hair of Kaguya appearing overhead, and the blue glow of the seal overtook all her senses.\n\n\nThe next thing she knew, she was waking up in the bloody \n\nWarring States Period.\n\n\n\nThere’s a long, awkward moment while the Senju and Uchiha stare at her, pausing in their battle at her rather dramatic entrance. There’s a crater under her feet, smoking and boiling, and her chakra is \n\nstifling\n\n in it’s intensity - because she’d had the Strength of a Hundred active when Naruto pulled his shitty stunt, and for some reason, she can’t put the damn thing away.\n\n\n“Hello.” Sakura says pleasantly, still trying to figure out \n\nwhat the fuck.\n\n\n\nTime travel was the obvious, if bizarre, answer. \n\n\nNaruto had sent her back in time. \n\n\nFor some fucking reason.\n\n\nEven though he was the \n\nobvious choice\n\n for such a mission.\n\n\n“Who the hell are you?” Madara \n\nFucking\n\n Uchiha demands, gunbai in one hand and scythe in the other, and Sakura opens her mouth to answer, pauses, and then offers a shrug.\n\n\n“Just an innocent traveller who got a little bit lost. Where am I again?” She asks curiously.\n\n\nMadara twitches. Hashirama stares at her with a small, puzzled frown.\n\n\n“The Land of Fire. The Senju and Uchiha border.” Tobirama says very, very flatly, clearly unamused.\n\n\nThere’s an Uchiha who looks frighteningly similar to Sasuke just a few feet away from him, sword \n\nstill\n\n raised, though he looks uncertain. \n\n\n“Senju and Uchiha?” Sakura echoes, reaching up to scratch at a small bit of dried blood on her face. \n\n\n\nSasuke’s blood,\n\n she reflects, remembering the way he’d fallen just hours before.\n\n\nOr, well.\n\n\nYears in the future.\n\n\nApparently.\n\n\nHm.\n\n\n“Well that’s strange. I was in the Land of Lightning a few seconds ago.” Sakura muses.\n\n\nThe last stronghold against Kaguya and her Zetsu forces, which only churned out more and more numbers by the day, while theirs dwindled drastically.\n\n\nA war they were destined to lose.\n\n\nTeam Seven was one of the last standing group of any real strength left. Even the infinitely regenerating Hokage had fallen to Kaguya’s disintegrating bones.\n\n\nKakashi had died two weeks ago.\n\n\nSasuke had died maybe two hours ago.\n\n\nNaruto was probably already dead.\n\n\nShe’s… the only one left.\n\n\nSomehow.\n\n\n“How’d you end up here?” Hashirama asks in a purely curious tone, and Sakura blinks, returning her attention to the present.\n\n\n“Eh?” She questions, frowning. Madara shifts, teeth gritted.\n\n\n“You said you were in the Land of Lightning.” Hashirama explains patiently. She’d almost think his guard was down, were he not still touching the seal rolled up on his back. It was huge and bulky, not unlike the one Naruto sometimes chose to fight with.\n\n\nHer gaze lingers on it for a second before she hums thoughtfully. \n\n\n“Well, honestly, I haven’t the slightest clue.” She admits with a smile.\n\n\n“Alright, that’s enough.” Madara lashes out, Hashirama shouting something, and Sakura watches impassively as he approaches.\n\n\n\nGood, kill me. I’m the only one left anyways,\n\n she thinks.\n\n\nUntil a beam of light slams down around her, so suddenly that even Madara slides to a stop, lowering into a defensive crouch with his gunbai at the ready.\n\n\n“That’s enough, I think.” The Sage of Six Paths’ voice echoes through the clearing, and the man appears at her side. Sakura blinks, looking at him incredulously. \n\n\n“That’s-” Hashirama, sliding to a stop behind Madara, gapes. “You’re-”\n\n\n“Yes.” The Sage confirms, his ghostly hand settling without touch on her shoulder. “And it’s time for my daughter and I to take our leave.”\n\n\n\nYour what.\n\n\n\n“Daughter?” Hashirama echoes, blinking rapidly.\n\n\nIt’s laughable at best. The Sage is very obviously alien. And Sakura has pink hair.\n\n\n“You have a limited supply now, daughter. We mustn’t waste our time here.” The Sage says quietly, his hand squeezing but still not \n\ntouching,\n\n and Sakura frowns at him.\n\n\n“Limited supply?” She wonders, and then blinks.\n\n\nHer chakra.\n\n\nIt’s…\n\n\n...Frozen.\n\n\nIt isn’t even flowing through her, even though it should be, since she still has the Strength of a Hundred apparently on the permanent setting, which she hadn’t known was possible.\n\n\n“Ah.”\n\n\n“Yes. Let’s go, now. We have work to do.” The Sage says, and with a sweeping look across the battlefield, he frowns down to Madara and Hashirama. “I am sorely disappointed in you. If you would only work together, you could achieve the most incredible things. You could make your dreams - and my own - a reality.”\n\n\nHashirama gapes. Madara narrows his eyes.\n\n\nSakura tilts her head and looks at the Uchiha. “Also, your brother was about to die when I got here.” She says idly, and Madara’s head whips around to look at the Sasuke-Impersonator. “You’re welcome. Perhaps you should rethink this strategy of protecting your family, though.”\n\n\n“Yes, war has a way of leading to casualties, incidentally.” The Sage agrees mildly.\n\n\n“Surprisingly enough.” Sakura concurs.\n\n\n“Let us depart.” The Sage says firmly, and in the blink of an eye and the brush of foreign chakra, Sakura’s suddenly in…\n\n\n“Is this Kamui?” Sakura blinks at the disorienting black space.\n\n\n“I thought we could use some privacy to speak alone.” The Sage explains. “I saw Naruto Uzumaki’s last act. I latched onto your chakra at the last moment so that I might accompany you and guide your hand. A good idea it seems, as you’ve been dropped in entirely foreign times.”\n\n\n“I was bullshitting Madara. That \n\nwas\n\n his brother fighting Tobirama, yes?”\n\n\n“Yes, Izuna. One of many victims to the Curse of Hatred. But together, you and I might be able to stop things at the source now.”\n\n\n\nAll I want to do is die,\n\n Sakura thinks.\n\n\nBut Naruto had said he trusted her.\n\n\nSo she looks at the Sage curiously, pushing away her grief and leaving numbness in its wake.\n\n\n“What do we have to do?”\n\n \n \n \n\nWhen Sakura comes out of Kamui, years have passed.\n\n\nNot for her - but for them.\n\n\nIt’s obvious because she’s standing on a table in the middle of a room, with Hashirama, Madara, Izuna, Tobirama, and who she is pretty sure is Mito Uzumaki, all sitting at it and staring at her.\n\n\n“Hm.” Sakura notes, blinking. “Awkward.”\n\n\n“You!” Hashirama proclaims, leaping to his feet so fast his chair tumbles, and he jabs a finger at her.\n\n\n“Me.” Sakura confirms with a nod.\n\n\n“How did y\nou get here?!” Madara snarls and Sakura shrugs.\n\n\n“Honestly? I have no idea.”\n\n\n“You’re the woman from the battle.” Izuna cuts in, brows furrowed, and he’s still alive, which is a good sign.\n\n\n“Quite \npossibly.”\n\n\n“The Sage’s daughter.” Tobirama says flatly, like he doesn’t believe it.\n\n\nWho would, though, honestly?\n\n\nShe shrugs, neither confirming nor denying.\n\n\n“Unlikely, as he’s been dead for centuries.” Mito notes, eyes narrowing.\n\n\n“Well technically I haven’t been alive for a good number of years either.” Sakura can’t help but muse. Even if they’re on opposite ends of the spectrum in this case.\n\n\n“So you’re undead?” Hashirama asks.\n\n\n“Possibly?”\n\n\n“That would explain why I can’t sense you. Mito?” Tobirama questions, and the woman inclines her head.\n\n\n“The same.” She murmurs.\n\n\n“Ah. Well, I’m definitely not alive.” Sakura offers with a frown. After a moment of uncomfortable silence, she awkwardly climbs down from the table, dropping between Hashirama and Mito. “So. How many years has it been?”\n\n\n“You don’t know?” Madara snaps and Sakura shoots him a flat look.\n\n\nLike she’d ask if she did.\n\n\n“Four. We’ve built a village together and named it Konohagakure.” Hashirama says, a little bubbly, and Sakura smiles warmly.\n\n\n“Good. The Sage would be proud.” Assuming Madara doesn’t go and try to destroy it all again. “Nice job.” She walks over to the window and looks out at the tiny budding village. She can see the Nara district by the forests, which means the Yamanaka, Akimichi, and Sarutobi clans have already joined… “You should put a face on that mountain.”\n\n\n“...What?” Hashirama asks, stepping up beside her and looking out. \n\n\n“You know, for the Hokage. So the village knows they’re always being looked over.”\n\n\n“Exactly what we need. Hashirama looming over us all for the end of time.” Madara says flatly.\n\n\n“Mmm. Well, I probably came here for a reason. Any \n\nsage\n\n advice you need?” Sakura asks, turning around and leaning against the window sill. \n\n\nMadara stares at her icily.\n\n\n“Well. We were debating if we could possibly use the legendary bijū to broker a peace treaty between the five Great Shinobi Nation-”\n\n\n“No.” Sakura says very, very firmly.\n\n\nHashirama wilts visibly. “No?” He asks, wounded.\n\n\n“The bijū are my friends. Touch them and I will hurt you. They have minds and wills just like we do. They are made of chakra, but they are every bit as intelligent and \n\nfree\n\n as we are. Leave them alone.” Sakura instructs.\n\n\n“The Kyūbi destroyed two villages in the past month.” Mito states coolly.\n\n\nSakura considers that for a moment.\n\n\n“...I’ll talk to them.”\n\n \n \n \n\n“Bad fox.” Sakura scolds.\n\n\nKurama stares at her from where his head is resting on his paws. He blinks slowly, head tilting a bit. “I can smell the Sage on you.” He says slowly.\n\n\n“And I can smell blood on you. \n\nBad.”\n\n\n\n“They deserved it for sending hunting parties against me.” Kurama snarls.\n\n\n“...I’ll talk to them.”\n\n \n \n \n\n“People are very complicated.” Sakura tells the Sage inside Kamui, after she’s done threatening every village in a fifty mile radius of each bijū. Aside from Isobu, who is in the middle of a freakin’ ocean right now.\n\n\n“They dislike what they do not understand. And worse yet, they try to enslave what goes against their basic natures.” \n\n\n“I don’t understand how I’m supposed to stop them.”\n\n\n“Perhaps you aren’t. All we can do is the best that we can.” \n\n\n“And if it’s not enough?”\n\n\n“Then it is of no fault of your own, but of the people refusing to listen.”\n\n\n“You make it sound easy.” Sakura sighs, rubbing her eyes. \n\n\n“This was never going to be easy, Haruno Sakura. All I can do is make it easier.”\n\n\n“By teleporting me from one time to another without explanation?” She can’t help but ask sarcastically.\n\n\n“I said help, not do your job for you.” The Sage counters dryly. “You were sent here for a reason. All I can do is assist you.”\n\n\nSakura gives a frustrated sound.\n\n\n“Fine. Where to next, \n\nassistant?”\n\n\n\nThe Sage’s eyes glimmer with amusement.\n\n\nSakura appears on a battlefield just in time to get impaled in the stomach. A sharp noise escapes her, a harsh gasp sounding \n\njust\n\n behind her, and she promptly punches her attacker so hard he flies a hundred yards and takes down twenty others with him. She yanks the sword free and her chakra actually moves for a second, sealing the wound behind it. “That,” Sakura gestures with the bloodied sword, “was \n\nrude.”\n\n\n\n“You again?” Izuna asks from behind her, breathless with ill concealed fear. Sakura glances at him briefly, then brushes a palm again him. Chakra moves, and in seconds, his wounds are sealed. He stares at her, eyes wide. “You saved my life. Again. Why?”\n\n\n“Let’s just say your brother’s mental health hinges unfairly on your continued survival. Try not to die.” Sakura instructs, then turns towards him. “I’ve never used a sword before. Am I holding it right?”\n\n\n“No.”\n\n\n“Fuck it.” She drops the sword. “KONOHA RETREAT!” She bellows as loud as she can, and then slams her fist into the earth.\n\n\nThe battleground explodes.\n\n \n \n\n“How can a ghost be covered in blood?” Izuna asks as he walks with her through the camp, watching her silently heal dozens of people with just a brush of her hand. They’re all watching her with wide eyes, having seen the utter devastation she’d wrought, only to turn around and heal with breathtaking ease. \n\n\n“It happened before I became a ghost. My best friend, an Uchiha, actually, died protecting me.” Sakura says absently, deliberately not thinking about it. For her, it had only been maybe a day ago still.\n\n\n“I see.” He says, then pauses. “No, actually, I don’t see. How could anyone die with you anywhere nearby them?”\n\n\n“I was out of chakra.”\n\n\n“How does a person with no chakra become a ghost with chakra?”\n\n\n“Magic.” Sakura says blandly. “No idea. Still trying to figure out how this happened to me, actually. Pretty sure it was my other best friend’s fault. Asshole.”\n\n\n“The Sage had two sons, not a daughter.”\n\n\n“You’re terrible at sticking to one subject. I’m adopted.” Sakura lies, healing a six year old with no business on a battlefield. The little girl smiles at her through a mouthful of bloody teeth. The smile of a shinobi. Sakura smiles warmly back. “Besides,” She adds, straightening up. “Turns out there’s not a lot of room for a bathtub in the afterlife.”\n\n\n“What?” Izuna asks in confusion and Sakura shrugs, pointing at her blood streaked face.\n\n\n“You asked about the blood first. I’m just trying to make sure we actually cover all your subjects of interest.”\n\n\n“How the hell did you do what you did to that battlefield?”\n\n\n“Very, very, \n\nvery\n\n good chakra control.” Sakura explains with a nod.\n\n\n“Huh.” Izuna frowns softly, and without warning, his eyes flicker red. The Eternal Mangekyo Sharingan stares at her, eyeing her from head to toe, and he looks mildly frustrated before tucking the Sharingan away again. \n\n\n“Don’t like what you see?” Sakura asks in some amusement.\n\n\n“I still can’t see any chakra flow in you.”\n\n\n“Well, I \n\nam\n\n a ghost.”\n\n\nShe’s not a ghost, but she’s not sure what she actually \n\nis,\n\n so she’s just going with it.\n\n\n“Uhg.” Izuna offers in annoyance. “Well, thank you for-” He turns, and she’s already gone.\n\n\n“Rude.” Sakura accuses the Sage of Six Paths from within Kamui.\n\n\n“Good work. On to the next task.”\n\n\n“Rude \n\nand \n\na slave driver.” Sakura huffs, but folds her arms across her chest and waits.\n\n \n \n\n“Yo.” Sakura says as she appears in the real world again.\n\n\nShe’s disappointed to not see Hashirama or Madara, but instead Tobirama as Hokage and Izuna, surprisingly, at his side.\n\n\nTobirama’s eyes narrow, and the red orbs glare fiercely at her. Izuna’s eyes flicker red too, the Eternal Mangekyo Sharingan activating. “Get off my desk.”\n\n\nSakura considers for a second.\n\n\n“No.” She decides, folding her legs under her and ignoring the rustling of the paperwork under her. She already knocked off a stack, apparently, because it’s splayed across the floor. “What happened to Hashirama and Madara?”\n\n\n“They died.” Izuna says coldly. Sakura tilts her head a bit, looking at him inquisitively. “For a ghost, you’re surprisingly uninformed.”\n\n\n“I actually don’t spend much time in this world, you know. You’re not \n\nthat\n\n important.” Sakura says chidingly. “They didn’t kill each other in a horribly cataclysmic battle involving the Kyūbi, did they? Because I meant what I said about the Kyūbi being a friend, and I’d be very offended on his behalf if that happened.”\n\n\nThere’s a moment where they stare at her.\n\n\nThe pen in Tobirama’s hand breaks. Ink ruins even more of the paperwork than she had.\n\n\n“They fell in battle. Not with each other. Alongside each other.” He says very, very frigidly.\n\n\n“Ah. Well.” Sakura considers that for a moment, frowning thoughtfully.\n\n\nThat was… unexpected. Then again, Izuna \n\nhad\n\n been the trigger that sent Madara spiraling into madness to begin with.\n\n\nStill, that meant…\n\n\n“They didn’t have any freaky DNA babies did they?”\n\n\n“What?”\n\n\nShe takes that as a no.\n\n\n“Huh.” No Rinnegan then. Fascinating. \n\n\n“You still have blood all over you.”\n\n\n“Yeah, like I said, no bathtubs, unfortunately. Hey, what year is it?” Sakura asks curiously, ignoring the angry twitching in Tobirama’s temple. Izuna, on the flipside, actually seems to have calmed down.\n\n\nHe spouts off the year and Sakura frowns, propping an elbow on her knee and her chin in her hand, thinking.\n\n\nThis is the year Tobirama is supposed to die.\n\n\n“Hm. Well. This’ll be the last time we speak, Tobirama-sama, so listen well, will you?” She asks, making her voice gentler but still severe. She feels oddly saddened by this fact. He frowns, looking at her with narrowed eyes still. “Whatever you do, do \n\nnot\n\n restrict the Military Force to only Uchiha Clan members.” She says, and Tobirama blinks at her, surprise clear in his red eyes. “I know how you feel about the Clan. I understand you’re merely trying to channel their skills and mindsets. However, by limiting the members to only the Uchiha Clan, you’ll only end up ostracising them, inciting their Curse of Hatred against Konoha.”\n\n\nThere’s a moment of tense silence in the room.\n\n\n“The Curse of- no. What are you suggesting?” Izuna demands sharply, fists clenching at his side. “My people would never go against Konoha. Not after everything.”\n\n\n“Perhaps. Perhaps not.” Sakura says mildly, frowning and tapping her fingers rhythmically against her chin. “However, the risk is there. Wouldn’t you rather simply avoid the risk all together, and spare the Uchiha Clan the hatred and distrust of Konoha’s shinobi as a whole?” She points out.\n\n\nTobirama’s eyes narrow again. “I do not believe the Uchiha Clan would turn against Konoha either.” He says firmly, and gets a surprised glance from Izuna for that. \n\n\n“You don’t?”\n\n\n“No.” Tobirama shoots him an irritated look. “I took Kagami under my wing, didn’t I? I made you my advisor, did I not? I have no prejudice against the Uchiha Clan. I simply understand the risks of their emotions, and this is my attempt at funneling that into a good cause. The Uchiha are uniquely capable of maintaining order over the shinobi forces due to their Sharingan.”\n\n\n“Yes.” Sakura acknowledges. “However, just as the Uchiha are uniquely capable of \n\ndetaining\n\n straying shinobi, the Inuzuka, for instance, are uniquely capable of \n\nfinding\n\n straying shinobi. And the Hyūga are uniquely capable of identifying said shinobi when their in a large mass of innocent people, should they attempt to lose their trackers in a crowd. The Yamanaka are uniquely capable of \n\ninterrogating\n\n these shinobi straying from the path. The Hatake-”\n\n\n“I understand your point.” Tobirama cuts her off coolly. “I will consider your proposal.”\n\n\n“That’s all I can ask.” She smiles warmly at him. It feels bitter on her face. \n\n\nIf she can’t stop the Massacre at the source, she’ll simply have to find another way.\n\n\n“I hope you’ll listen to me, Tobirama-sama. This is the last piece of advice I can offer you, I suspect.”\n\n\n“And why is that?” Tobirama asks smoothly, setting down the ruined remains of his broken pen.\n\n\nShe considers for a moment, and then sighs. “Because you won’t live to see the end of this war, Tobirama-sama.” She stands up, dropping from the desk, and doesn’t turn to see their expressions. Her heart aches strangely in her chest. \n\n\nTime is flying past her now, and a decade has passed in a mere day and a half for her. \n\n\n“Oh, and Tobirama?” She adds with a frown, before the Sage can pull her away now that her task is complete. She looks at him over her shoulder, frowning severely, and ignores the stricken expression Izuna wears. There’s a vast difference between them now and the pair who had fought to the death in her life. “Work with Danzō with what time you have. Otherwise he’ll fall into a darkness so deep he’ll lose all sight of your teachings, and the meaning of the Will of Fire.”\n\n\nTobirama stares at her intently before he gives a very, very shallow incline of his head. “Farewell, shiryō.” He says, and that brings a small grin to her face.\n\n\n\nDead, vengeful spirit.\n\n\n\n\nWell, you aren’t wrong.\n\n\n\n“Farewell, Tobirama-sama.”\n\n\nKamui drags her away moments later.\n\n \n \n\n“You’re doing excellently.” The Sage tells her as he gives her a few minutes to recover mentally.\n\n\n“I feel like you’re dragging me behind an out of control horse carriage.” Sakura says flatly, lying on her back and staring up into the black abyss of Kamui’s sky.\n\n\n“We have much ground to cover, and a limited amount of chakra to do so.”\n\n\n“Do we?” She questions idly. “Exactly what ground do I have to cover?”\n\n\n“We’re here to save the world, aren’t we?” The Sage points out and Sakura frowns.\n\n\n“We’re here for \n\nnothing\n\n but the crazed whims of Naruto’s desperation.”\n\n\nThe Sage falls silent at that.\n\n\n“...Then we must endure, as shinobi are wont to do, and use this to our advantage.”\n\n\nSakura closes her eyes, exhaling through her nose. She’s tired, but not physically. It’s like her body has been frozen in time, but her mind still works at light speed. \n\n\n“Of course.” She says, opening her eyes again. “Let’s save the world, shall we?”\n\n\n\n\n\n \n \n\nThis time, the jump is bigger than ever.\n\n\nShe opens her eyes to find Kamui dropping her onto a beach. \n\n\nA very nice, sunny beach.\n\n\nWhich is under siege.\n\n\n“Ah.” Sakura says, blinking. \n\n\nThere’s red hair all around her. \n\n\nUzushio?\n\n\n“Hm.”\n\n\nNow that she thinks about it, is Kushina even in Konoha? She’d have no reason to be, without the need for a new host for Kurama…\n\n\nSakura looks at the smoke-seared sky, frowns deeper, and sighs.\n\n\n“Fuck.”\n\n\nShe turns towards the village being systematically destroyed by Kumo and Kiri shinobi, and begins her search.\n\n \n \n \n \n\nShe’d had Sasuke’s splattered blood all over her when she first came to the past.\n\n\nNow, she’s positively soaked in it.\n\n\nShe attacks relentlessly and without hesitation, carving and obliterating a bloody swathe through the masses swarming Uzushio. The village is cut off, surrounded on all sides, and she can sense Konoha shinobi in the distance, attempting to break through Kumo’s forces to aid their ally village. \n\n\nTo her surprise, she finds Kushina relatively quickly. The girl is six, maybe seven, and shouting like mad as she uses chakra chains to destroy anyone who earns her ire. \n\n\nWhich is, really, everyone.\n\n\n“Yo!” Sakura greets with a smile, channeling her inner Kakashi.\n\n\nKushina’s chains falter, then whip out and pass straight through her. “Get back!” The girl shrieks.\n\n\n“Nope. Come with me. We need to secure an evacuation route.” \n\n\n“Evacuate where?!” Kushina snarls, but her chains pull back a bit. Between the two girls, there’s no one left to disturb their brief chat.\n\n\n“To Konoha. They’re trapped at the border, behind a mass of Kumo shinobi. How do you like the idea of slaughtering them all and paving a way for Konoha’s assistance?” Sakura asks cheerfully.\n\n\nKushina’s eyes glitter with rage.\n\n\n“Let’s go.”\n\n \n\n \n\n \n\n“Shiryō.” A young(ish) Sandaime greets her as she and Kushina break through the Kumo swarm.\n\n\n“Hiruzen!” Sakura cries out joyously, even if it feels weird and \n\nwrong\n\n to use his name like that. “Lovely to meet you. Tobirama-sama told me about you.” She lies baldly. “This is Kushina-chan. She’s awesome. Lots of murder in her. Very good potential for a Konoha shinobi. Kushina, say hi. Be nice. Stop glaring at me.” Sakura instructs.\n\n\nThe red-haired girl glares at her.\n\n\n“Maa, children these days. So rude.” Sakura bemoans. Hiruzen tenses, staff rising. She turns and kicks out, slamming her foot into the chest of a charging Kumo nin.\n\n\nHe flies.\n\n\nHe doesn’t scream, his chest collapsed and all his ribs and sternum shattered. It’ll be a quick death, but a painful one. \n\n\nHe probably deserves that.\n\n\n“Come with us. We need to secure the island.” Sakura offers a hand, not to take, but in an inviting gesture.\n\n\nAfter a long minute, Hiruzen glances at his teammates - who look like the Hokage’s councillors, Sakura realizes belatedly - and nods curtly. “Let’s go!” Hiruzen bellows, and the Konoha shinobi fall in. \n\n\nSakura and Kushina turn, leading them rapidly back to the island.\n\n \n \n \n\nWhen it’s all over and the population of Uzushio has been collapsed to a mere five hundred or so, Sakura sits at a campfire across from Hiruzen and his teammates, with Kushina collapsed against her side and snoring. \n\n\nShe’s honestly impressed. The girl can’t be much higher than Genin in rank, yet she held out for almost the entire battle, using her chains relentlessly. \n\n\n“Tobirama-sensei told us about you, Shiryō.” Hiruzen says, smoking from his familiar, ever present pipe. \n\n\n“He claimed he could never sense you.” Koharu adds with a frown. “He was the best sensor to ever come out of the Land of Fire.”\n\n\n“Yes, he was, and will continue to be for some time.” Sakura confirms, frowning thoughtfully. She lifts a knee to drape her arm over it, humming. “I’m apparently undead.”\n\n\n“Apparently?” Homura echoes, eyes narrowing.\n\n\nShe shrugs. “It was a jutsu. It went wrong. We were desperate.” She explains, waving a hand dismissively. “The Sage saved me. Took me under his hand. Now, we work together to pave the way for a better future.” Sakura says, glancing consideringly at the snoozing Kushina.\n\n\nHiruzen takes that moment to prod her with his staff. Or, well, attempt to. It passes through her skull.\n\n\nShe frowns at him. “Rude.”\n\n\n“I was curious.” Hiruzen says unapologetically. “Tobirama-sensei called you Shiryō. A vengeful, dead ghost.”\n\n\n“Yes. He’s probably onto something. Or, sorry, \n\nwas \n\nprobably onto something.” Sakura amends awkwardly, frowning deeper in discomfort. \n\n\nTime is flying past her, and all she can do is be dragged along after it.\n\n\nSpeaking of…\n\n\n“I think my time here is about up.” Sakura muses, glancing behind her and at the ruins of Uzushio. “What will you do with them?” She asks curiously.\n\n\n“Take them in, of course. Uzushio has been our ally since before our founding.” Hiruzen says firmly, exhaling a puff of smoke. “Shiryō.” He draws her attention back to him and she looks at him questioningly. “Why are you vengeful?”\n\n\nShe blinks at the unexpected question. After a moment, she offers a small grin, bitter and angry. “Well, Hiruzen-san, when you see the end of the world, feel the lives of everyone you’ve ever known slip through your fingers like a hot knife through butter… you find a lot of reasons to seek vengeance.”\n\n\nHis brow furrows and his teammates exchange a glance. “The end of the world?” He echoes and she hums lightly, nodding her head. \n\n\n“Tell me, Hiruzen, have you ever heard the tale of the Jūbi?”\n\n\nSilence reigns for a moment before he shakes his head, eyes narrowing in thought. “I can’t say I have.”\n\n\n“Research it.” Sakura suggests, rising to her feet and brushing drying blood flakes off her pants. It’s a lost cause, really, but she can’t help but try. “The Uchiha have better records than anyone gives them credit for. And so do the Senju, of course.” She adds thoughtfully. “Inquire into it, Hiruzen-san. Then you’ll understand what I’m trying to prevent from happening again - and why, I should reiterate,” She adds dangerously, eyes narrowing, “I \n\nwill\n\n protect the bijū from any and all attempts to capture them. No matter who tries.”\n\n\nThe threat sends the tension skyrocketing, but Sakura doesn’t even really notice, flicking a small glob of blood off her shoulder. She feels a familiar prickling along her skin and nods her head politely at Hiruzen and his teammates. “It’s time for me to go. Give Kushina my appreciation, will you? She’s a very skilled girl, this one. Take care of her.”\n\n\nHiruzen studies her for a long minute, and just before Kamui swallows her whole, he nods. “We will.” He promises.\n\n\nShe’s gone an instant later.\n\n \n \n\nShe reappears just in time to feel Kakashi’s chakra vanish alongside two mystery chakras. \n\n\nObito’s chakra tickles her senses a short distance away, and with a sinking feeling, she turns to see a pile of rubble where a cave once stood.\n\n\n“Ah.” Sakura realizes, the bodies of Iwa shinobi sprinkling the ground around the cave in. \n\n\n\nWell, this is awkward,\n\n she muses, but after a moment, she steps towards the cave in. \n\n\nIt takes a simple touch of chakra, and the boulders are exploding, carefully directed upwards and \n\naway\n\n from the cave itself. Sakura hums lightly to herself as she sends boulder after boulder flying away, until finally, she finds her foot sinking into a pool of blood.\n\n\nTwo boulders later, and she’s prying free the crushed body of one Obito Uchiha.\n\n\n“Ah.” Sakura repeats, looking down at the unconscious body of her once-foe.\n\n\n\nDefinitely awkward,\n\n she decides, before crouching down and pressing a hand to his chest.\n\n\nShe lets the Strength of a Hundred course through him, doing her work the easy way.\n\n\nThen she hefts the boy up, ignoring the way his arm remains limp and slightly smooshed, and hauls him off towards Konoha.\n\n \n \n\n\n\n“Yo!” She greets Hiruzen, smiling with her mouth and her eyes.\n\n\nHiruzen frowns at her, not at his desk but instead meeting her out on the balcony. “I could sense you approaching. Of course, I didn’t know it was \n\nyou.\n\n But I gathered from your strength.” His gaze drifts over Obito, still unconscious and limp on her back.\n\n\n“I’m actually using chakra right now. I think I’ve figured out this undead thing. So long as I’m \n\nusing\n\n chakra, I’m solid and can be sensed. But once I stop actively using it, I become unsensible and untouchable again.”\n\n\nTo prove it, she stops channeling chakra.\n\n\nObito promptly falls straight through her. \n\n\nShe catches him with chakra infused arms and hauls him back up, just before he would’ve hit the ground. \n\n\n“Fascinating.” Hiruzen admits almost reluctantly, peering at her intently before his gaze flickers to Obito. “That’s… Obito Uchiha.”\n\n\n“Ah, yes.”\n\n\n“What happened to him?”\n\n\nSakura blinks in surprise.\n\n\n“...Did you just imply I beat the \n\nYellow Flash\n\n back to Konoha?” She questions.\n\n\nHiruzen arches a brow.\n\n\nSakura does as well.\n\n\n“...Huh. Okay, well anyways, I found this one trapped under a cave in, smashed by some boulders, missing a Sharingan, and his arm is probably beyond saving but they might be able to replace the bones with metal. I have no idea, I don’t actually know how advanced medical science is nowadays. Good luck. Bye!” Sakura sets Obito down and flickers away.\n\n\nShe has \n\none other thing\n\n to do before she goes back into Kamui.\n\n\nTwo weeks later, Jiraiya reports to Hiruzen about a mysterious woman matching Shiryō’s description threatening over a hundred villages if they dare to touch her precious bijū.\n\n\n(Just in case they’ve forgotten after all these years.)\n\n\nShe also innocently suggests Isobu leaves Kirigakure’s area and heads back to the ocean for a decade or so.\n\n\n\nJust in case.\n\n\n \n \n \n\nThe next time she appears in the real world, it’s almost unrecognizable.\n\n\nShe’s changed \n\nso much,\n\n and now she can really, truly see it for herself. \n\n\n“...Shiryō?” Minato Namikaze questions, staring at her blankly.\n\n\n“Hey, good guess.” Sakura applauds, smiling at him warmly. There’s a bundle in his arms, and Kushina’s passed out on the sofa a few feet away. “Is this your home?” She asks curiously, and Minato numbly nods. “Huh. That’s a first for me. Usually I appear in the Hokage’s office.” She muses thoughtfully, stepping closer to him. Minato tenses, watching her warily, but doesn’t move away as she leans in.\n\n\nNaruto Uzumaki’s adorable, whisker-free face stares up at her.\n\n\n“Oh.” Sakura says softly, her insides twisting painfully. “Oh, look at that.” She whispers, reaching up. Minato leans away slightly and Sakura lowers her hand, but doesn’t take her eyes off the tiny form, his familiar blue eyes staring back up at her curiously. “Naruto.”\n\n\n“How’d you know?” Minato asks sharply, frowning at her. She shrugs idly.\n\n\n“It’s complicated. Also, pleasure to meet you, Minato-sama.” Still, her gaze lingers on Naruto.\n\n\nHe can’t be more than six months old.\n\n\n“It’s… a pleasure to meet you, as well. Kushina told me about you. And the Sandaime.”\n\n\n“I get the feeling I’m becoming something of a legend.” Sakura notes distractedly. She wants so badly to touch the spot where his little whiskers used to be, but no longer are. \n\n\n\nKurama,\n\n she thinks, considering the tiny form thoughtfully.\n\n\n“You are.” Minato confirms, his voice somewhat strained. “Why the interest in my son?”\n\n\n“Hm? Oh, it’s complicated.” Sakura hums lightly. “Do you believe in reincarnation, Minato-sama?”\n\n\n“In rein- I… I suppose, yes.” Minato says slowly, confused.\n\n\n“The Sage of Six Paths had two sons. Indra and Asura. For hundreds of years, they’ve been reincarnated over and over again. The last time into the forms of Madara and Hashirama.”\n\n\n“...The Sandaime says you’re supposedly the Sage’s daughter.”\n\n\n“Adopted. It’s complicated.” Sa\nkura offers distractedly, frowning as Naruto’s eyes become heavy-lidded and he wiggles slightly in Minato’s arms. “Minato-sama. Please… let me hold him? For just a moment?”\n\n\nSilence fills the room before, very slowly, Minato shifts. Sakura moves to gently take the boy from him, channeling chakra through her arms. Naruto mewls softly in protest at the movement, but then looks up at her with wide eyes, seeming suddenly amazed.\n\n\n“I can sense you now. I couldn’t before.” Minato murmurs in confusion. “Those lines down your skin… it’s a seal, isn’t it?”\n\n\n“Seal?!” Kushina cries suddenly, sitting bolt upright, and she blinks sleep from her eyes. “Why do I sense-” She starts, then her gaze lands on Sakura.\n\n\nShe blinks.\n\n\nSakura offers a faint smile, gaze still locked on Naruto’s. She can’t drag it away even if she tries.\n\n\n“Shiryō?” Kushina asks breathlessly.\n\n\n“Kushina-chan.” Sakura returns, smile widening, and she adjusts her grip on Naruto, shifting him onto one arm. She lifts the other hand, offering him a finger, which he gladly reaches up and snags in his tiny hands. “Ah, he takes after his mother. I can already tell he’ll be excellent at taijutsu one day.” Sakura says fondly.\n\n\n“Why are you here?” Kushina asks in confusion. “Is Konoha in danger?”\n\n\n“No, no. Nothing like that.” Sakura denies, shaking her head. “I’m here because… well, actually I have no idea. I just showed up. I’m sure I’ll figure it out soon enough.” She muses, trying to recall any incidents around this time… “Hm.” She wiggles her finger in Naruto’s grip, shifting it just enough to poke him in the nose, and the tiny baby goes cross-eyed before giggling adorably.\n\n\n\nGod,\n\n Sakura thinks, her chest aching viciously. \n\nHe’s so young. So alive.\n\n\n\n“Why are you \n\nhere?”\n\n Minato echoes Kushina’s earlier question, soft and uncertain, but with an undertone of \n\nHokage\n\n to his voice.\n\n\n“I think…” Sakura hesitates, biting her lip. “I think it’s because my time is almost up. The Sage is offering me closure.”\n\n\nAfter all, there’s only one task left she can think of.\n\n\nAnd she has no idea what’s meant to happen to her after she’s done.\n\n\n“Closure? And… Naruto is giving you that?” Minato asks slowly.\n\n\n“It’s complicated.” She repeats for the umpteenth time, quiet and distracted as she uses her finger to play with Naruto. “How is Obito-kun?”\n\n\n“...Alive. His arm had to be removed, unfortunately, but he’s still a shinobi - and a damn good one. One of our best. He’ll probably be my successor, actually.” Minato says with a frown.\n\n\n“Obito-kun the Hokage.” Sakura muses, considering that.\n\n\n\nAnd to think, I almost didn’t save his life.\n\n\n\n“Minato-sama?” She questions, and he grunts softly in response. “Could you summon the Sandaime? I need to speak to you three about something.”\n\n\n“...Kushina?”\n\n\n“I’m fine.” \n\n\n“I’ll be right back.” Minato says before vanishing in a small flicker of yellow.\n\n\n“Why the fascination in my son?”\n\n\n“Mmm. Complicated. You’ll see soon enough.”\n\n\n“Shiryō.” Kushina half-growls.\n\n\n“I can’t answer your questions, Kushina-chan. Not yet. But soon enough.”\n\n\nShe falls silent, reluctant and irritated, but silent nonetheless. \n\n\nMinato returns a few short minutes later, the Sandaime at his side.\n\n\n“Shiryō.” Hiruzen greets in some surprise. She finally, and \n\nvery\n\n reluctantly, drags her gaze from Naruto, smiling at the two Hokage. \n\n\n“Hello again, Hiruzen-sama. Did you investigate the matter I told you to?”\n\n\nHe blinks, eyes narrowing. “About the Jūbi?”\n\n\n“Jūbi?” Kushina echoes in confusion.\n\n\nMinato silently shifts, and Sakura reluctantly pulls her finger from Naruto’s grip, offering the infant back to his father. Kushina relaxes slightly as he settles back into Minato’s arms. \n\n\n“I don’t follow. Aren’t there only nine bijū?” Minato questions, looking at Hiruzen with a frown.\n\n\n“Are there?” Sakura arches a brow.\n\n\n“...I investigated.” Hiruzen says at last. “And I believe you.”\n\n\nSakura smiles and bows her head. “And that’s all I can ask of you, Hiruzen-sama.”\n\n\n“Believe \n\nwhat?”\n\n Kushina asks sharply, irritation coming back full force.\n\n\nHiruzen pauses for a moment, shifting his weight to one leg before grunting. “Several hundred years ago, when the Sage of Six Paths walked the land, there was an evil monstrosity known as the Jūbi. It wreaked havoc on the land, until the Sage found a solution. He used his Rinnegan powers to split the Jūbi into nine separate entities instead of one massive one.”\n\n\n“The bijū.” Minato realizes aloud and Hiruzen nods.\n\n\n“And it was heavily implied to me that Shiryō here died fighting the Jūbi alongside the Sage.”\n\n\n“And two others.” Sakura corrects, even if that’s not \n\nreally\n\n accurate.\n\n\n“The Sage’s sons?” Minato questions, and Sakura’s lips quirk slightly.\n\n\n“You aren’t wrong.” \n\nYou’re not quite right, either. \n\n\n\n“There’s not much about you left in recorded history, Shiryō, but Tobirama-sensei kept as thorough notes as possible. His records indicate that you died following the death of a teammate and an ill-advised jutsu from the other.”\n\n\n“Yes.” Sakura confirms, folding her arms across her chest and leaning back on one leg. “Indra fell in battle, no matter how much I tried to save him - and Asura used an experimental jutsu to attempt to save my life. In the end, we both failed, and the Sage saved my spirit - but not my life.”\n\n\n“You’ve implied repeatedly that you’re on limited time.” Hiruzen notes and Sakura confirms with a nod.\n\n\n“How limited, I’m not sure.” Sakura pauses, pressing her lips together tightly. “But I highly suspect my time is almost up - for good this time.” \n\n\n“...What will happen to you?” Hiruzen asks slowly and Sakura shrugs.\n\n\n“No idea!” She says brightly, smiling. “But I hope I can finally move on. It’s been fun, but rather tiring.” She hasn’t slept in five days of teleporting through time and space at the whims of the Sage. “Besides, I’ve lost everything and everyone to the Jūbi. I have one last task to keep that creature from ever cursing this land again, and then… well, I hope I can join my friends and family in the afterlife.”\n\n\n“That’s a little grim.” Ku\nshina blanches, frowning at her. “Isn’t there something worth keeping you around?”\n\n\n“Oh, no.” Sakura admits freely, shaking her head. “Not even remotely. Sorry. I’ve done my part. I have one last thing to do, and then I’ll be able to say for certain that the Jūbi will never return and do to this world again what it did the first time. I’ve already stopped everything else.”\n\n\nStopping Madara from going crazycakes and gaining the Rinnegan had been key to preventing the summoning of the Jūbi’s corpse - but there was still \n\none thing\n\n left to deal with.\n\n\n“Now.” Sakura claps her hands together. “I’ve said my piece. I’ve done my part. Hiruzen, it’s unlikely we’ll meet again, unfortunately, but it was lovely knowing you. You’re an excellent person, and a fantastic Hokage.” Aside from the Uchiha thing.\n\n\nHiruzen blinks at her, startled.\n\n\n“Minato,” She turns to him next, smiling warmly. “Pleasure to meet you. I imagine I’ll see you one last time before the end. Kushina-chan, brilliant as always, keep up the good work. Oh, and remind the countries that if someone steals a bijū, I’ll come and kill them all. Bye bye!” Sakura waves cheerfully before Kamui drags her away.\n\n\nThe three of them stare at the space she’d just been occupying, blinking.\n\n\nMinato slowly replays the conversation in his head.\n\n\n“...Wait.” He says, suddenly jerking Naruto. He thrusts the boy out and into the air, staring at the startled infant intently, and the boy looks back at him in utter confusion. \n\n“REINCARNATION?!”\n\n\n \n\n \n\n \n\n“There’s more I want to do.” Sakura says antsily, pacing in the dimension that is probably risky for them to linger in, now. Obito most likely has the Mangekyo if he’s ‘one of the best’ shinobi in Konoha, and this is the same dimension that he uses.\n\n\n“Yes. But we are limited. I have enough chakra left to carry you one last time, Sakura, and then the rest is up to you.”\n\n\nSakura chews her lip, thinking about Danzō, who might still be evil, and Orochimaru, who definitely is still evil. \n\n\nShe thinks of the Chūnin Exams and Sasuke and the Curse Seal. She thinks of Naruto fighting Sasuke without the Kyūbi to heal him and keep him alive.\n\n\n“I don’t like this. Too much is being left to chance and hopes.”\n\n\n“My sons will persevere. And so must you, my daughter.” The Sage reassures her calmly.\n\n\n“That’s easy to say. And I’m not your daughter.”\n\n\n“You may as well be.” He says and she snorts softly.\n\n\nBut she forces herself to stop pacing and take a deep breath, reminding herself.\n\n\n\nOne last thing, and then I can be free.\n\n\n\nFree to see Kakashi, Sasuke, and Naruto again. Tsunade and Shizune and Neji and Ino. Shikamaru and Hinata and the rest.\n\n\n\n...But… \n\n\n\nShe looks sharply at the Sage. “When I finally die, what will happen to me? Will I go to the Pure World with the others? Or will I be trapped here? Or will they not be the same people in the Pure World as mine?”\n\n\n“You will ascend.” The Sage reassures. “As for who they will be, it’s complicated. We have rewritten time - but the Pure World transcends time and space. Their spirits will be there, and one day, when the new timeline’s people pass into the light, the spirits were merge into one being. They will remember both lives.”\n\n\nSakura chews her lip, digesting that, before nodding at the Sage.\n\n\nShe takes a deep breath.\n\n\n“Alright. Let’s go.”\n\n\nHe smiles faintly at her. “Yes. Let us.” He extends a hand, and Kamui drags her away.\n\n \n \n\nIf she’d thought the world was unrecognizable before, this was like coming to a different world entirely.\n\n\nShe reappears on top of the Hokage tower, and the first thing she notices is the Monument.\n\n\nThe Hokage Monument, which bares the face of Obito Uchiha beside Minato’s.\n\n\n“Wow. It really happened.” She murmurs, and isn’t \n\nthat\n\n surreal?\n\n\nArchvillain turned Hokage.\n\n\n“Bizarre.” \n\n\nAfter a few minutes of consideration, she determines that the Sage had dropped her here for no reason other than to show her the changes they’ve accomplished. \n\n\nHer real goal lies in the distant corners of the Land of Fire, down by the peninsula. \n\n\nWith a soft exhale, Sakura turns on her heel and flickers away, heading out and away from Konoha.\n\n \n \n \n\nKurama is, surprisingly, right where she left him last time.\n\n\nGive or take a few dozen miles.\n\n\n“What do you want now?” Kurama asks, opening one eye to peer at her. \n\n\n“The Sage and I have a task to complete, and I need your help, Kurama.” Sakura explains quietly. “Will you help me stop Kaguya from ever returning?”\n\n\nHe blinks open both eyes, staring at her.\n\n\nAfter a moment, he sniffs her.\n\n\n“...The Sage, you say?” He asks slowly, and she nods. His eyes narrow and he exhales a warm gust against her. “I can still smell him on you. Very well. Tell me. What does he want from me?”\n\n\n“I need your senses, Kurama. There’s someone very important we need to hunt down.” She says severely.\n\n\nHe eyes her before slowly grunting. “Climb onto my back and tell me which way to search.”\n\n \n \n\nIn the end, she doesn’t actually know where to start their search, which leads to something that admittedly probably looks both entertaining and terrifying from an outside perspective.\n\n\nShe galivants across the world atop Kurama’s head.\n\n\nThe Land of Fire comes first, of course, and then the Land of Wind - then Rock, and it’s on the way to Lightning that he senses it.\n\n\nA low growl escapes Kurama and he pounces, Sakura propelling off his head and landing right in front of a startled Black Zetsu.\n\n\nThey battle for days.\n\n\nKurama’s power is incredible and \n\nridiculously\n\n destructive, but they’re in an isolated part of the Land of Frost, and the damage is only to Black Zetsu and the earth itself. Sakura, as well, is hellbent on destroying as much as she can in an attempt to mow down the damned Kaguya remnant.\n\n\nIt’s only thanks to a few barrier seals she’d pilfered from Minato and Kushina when they weren’t looking that they’re able to keep Black Zetsu from escaping them all together.\n\n\nIn the end, after four days, they aren’t even the ones to seal the deal.\n\n\nThe barrier vanishes without warning, but before Black Zetsu can move, gold chains whip out and slam into the ground surrounding them. A blue barrier fills the sky, and Kushina comes flying out with all the fury of a true Uzumaki. \n\n\nAt her heels is Minato, Kakashi, Naruto, Sasuke, and… herself. \n\n\n\nHuh.\n\n\n\nKakashi and Minato join Kushina in her battle charge, but Team Seven slides to a stop not far from Sakura. “Yo.” Sakura greets her younger twin idly. “Welcome to the fight. You’re four days late.”\n\n\n“Blame the Sage.” Naruto complains. \n\n\n“NARUTO! GET OVER HERE!” Kushina bellows, and Naruto winces before lunging forward, Sasuke a step behind.\n\n\nMini Sakura hesitates, staring at her with wide eyes. “That’s… the Strength of a Hundred.” \n\n\n“Oh.” Sakura blinks in genuine surprise. “You’re a medic nin?” She asks, because she hadn’t honestly thought Tsunade would return to Konoha without the Hokage position needing to be filled.\n\n\n“Tsunade-shishou trained me.” Mini Sakura confirms and Sakura smiles warmly at her.\n\n\n“Then crack open that seal and let’s get to work.”\n\n \n \n \n\nHer chakra is almost depleted when the battle ends.\n\n\nThe tide turns drastically with the additional forces, and between Minato and Kushina’s seals draining Black Zetsu’s strength, it’s a matter of \n\ncatching\n\n him and having Naruto and Sasuke plant their palms on him.\n\n\nIt takes nearly eight hours - but they do it.\n\n\nSakura slumps to the ground as the earth itself uproots, surrounding a wailing Black Zetsu and sending him floating up into the sky.\n\n\n“Go team.” Sakura proclaims, fist-bumping Kurama.\n\n\n“You,” Minato proclaims, glaring at her and pointing accusingly at the floating orb of earth, “need to explain that.”\n\n\n“Oh, that was…” She pauses, “It’s complicated.” Sakura settles for.\n\n\n“You keep saying that, yet it explains nothing.” Kushina bites out, stepping up alongside her husband. Naruto looks between the three of them, a little conflicted.\n\n\n“Um. Didn’t she just sort of save our lives?” Naruto questions.\n\n\n“How do you know that?” Sakura asks incredulously. Naruto silently presents his palm, the Sage’s power seal on it. She gives it an irritated look. “So he spilled the beans?”\n\n\n“He told us about the Jūbi and some crazy chick named Kaguya.”\n\n\n“Yeah, that thing was a piece of Kaguya and the Jūbi. One and the same. The Jūbi is Kaguya, Kaguya is the Jūbi, etc.” Sakura explains, flapping a hand dismissively. “By killing off that piece of her, we made it so she can’t reform.” \n\n\nOr, at least, not with any help. A \n\nlot \n\nof help.\n\n\n“You’re welcome.” Kurama says dryly from where he’s currently laying down, apparently content to go back to napping right then and there.\n\n\n“That’s Kurama, by the way.” Sakura adds, jabbing a thumb over her shoulder at the bijū. “He helped me hunt Black Zetsu down.”\n\n\n“Black Zetsu? That’s what that thing was?” Kushina asks, nose wrinkling. \n\n\n“Oh, you don’t know the half of it.” Sakura grins wickedly. “And now, you never will.” She looks sideways at Team Seven, who appear to be seventeen or eighteen, and offers them a nod of appreciation.\n\n\nSasuke, to her surprise, is the one who returns it with a determined set of his jaw.\n\n\nNaruto looks mildly confused. \n\n\nMini Sakura just frowns at her.\n\n\n“You fight just like me. You use all the same powers as me.” Mini Sakura accuses.\n\n\n“Do I? What a coincidence.” Sakura deflects with a smile. \n\n\nBut Minato, the genius that he is, goes stiff.\n\n\nHis eyes widen, and he glances between the two Sakura’s before looking at his sons, lips parting in shock. “Indra and Asura.” He breathes out, and Sakura’s smile widens. “You misled us.” Minato realizes and Sakura gives a shrug. She’s just lucky her hair is red with blood or it’d be \n\nreally\n\n obvious.\n\n\n“Yes, well, who needs to know the truth? It’ll just give them dangerous ideas. And look how badly it backfired to begin with.” Sakura points out, and understanding further dawns on his expression, while the others just look confused. Or searching, in Sasuke and Kakashi’s case.\n\n\nShe sees when the realization hits Kakashi next, but she’s fairly confident her point has been made, for neither he nor Minato so much as breathe a word about \n\ntime travel.\n\n\n\n“Don’t look so worried, Minato-sama.” Sakura says mildly, her smile warming. “I’ve taken care of everything. Just like I was meant to.” She almost, \n\nalmost\n\n glances at Naruto - but he’s not her Naruto, no matter how similar they look.\n\n\nHe isn’t worn down \nby war, desperate from loss after loss. \n\n\nHe’s young, innocent, and full of life.\n\n\nAnd that’s exactly the way it should be.\n\n\nSakura’s skin tingles and she shifts slightly, making everyone tense, which she almost rolls her eyes at. “My time here is up, ladies and gentlemen. Do me a favor and take care of the world I’m leaving you with.”\n\n\nTo her surprise, it isn’t Kamui that touches her skin, drawing her away.\n\n\nIt’s a beam of light, warm and tingling, that makes her muscles relax involuntarily. She looks up at the sky, blinking at the bright light hitting her.\n\n\n\n“You’ve done well, my children.”\n\n The Sage’s voice echoes around them, and Kurama’s ears perk in response. \n\n“All of you.”\n\n\n\n“Hagoromo.” Kurama murmurs reverently.\n\n\n“Goodbye, Kushina-chan, Minato-sama. And good luck.” Sakura says, smiling warmly at them.\n\n\nHer skin tingles, and after a moment, she realizes that it’s flaking away - not like from Kaguya’s bone strikes, but like she’s an Edo Tensei being returned to the Pure World.\n\n\nShe looks at her hands, watching it happen for a moment, before looking back up at the Namikaze and Uzumaki woman. “Oh, and keep people’s grubby fingers away from my bijū.” She says sternly.\n\n\nKushina cracks a small grin.\n\n\n“Believe it!” Naruto cries out, and Sakura \n\nlaughs.\n\n\n\nThe sound echoes in the valley their battle had created.\n\n\nShe’s gone moments later.\n\n \n \n\nSakura opens her eyes to find Naruto leaning over her, tears in his eyes. “You did it.” He breathes out, seizing her and hugging her tight. “Thank you, Sakura. Thank you.” He whispers, clinging tightly.\n\n\nShe hugs him tightly back, half desperate for the reassurance that she \n\nfinally made it,\n\n and half wanting to punch him for stranding her through time like he had.\n\n\n“Good job, Sakura.” Sasuke’s voice says mildly, and she lifts her head to see him standing a few feet away.\n\n\nThey’re on a grassy hill, the sun shining high and warm above their heads, and Kakashi is lounging against a tree a few feet away, watching them warmly.\n\n\nSakura’s eyes burn.\n\n\n“I missed you so much.” She chokes out.\n\n\nNot many people can claim they squeezed a hundred years into \n\ntwo weeks.\n\n\n\nIt’s been the longest two weeks of her life.\n\n\n“Well you’re home now, Sakura-chan.” Naruto smiles widely at her. “And no one’s taking any of us away. Now come on - I want you to meet my parents. They have some things to say to you.”\n\n\nSakura lets him haul her to her feet, smiling all the way, and as Naruto half-drags and half-guides her away, Kakashi and Sasuke silently fall into step behind them.\n\n\nIt’s been the longest two weeks of her life.\n\n\nBut it was worth every second.\n\n \n \n \n\nMeanwhile, in the real world, Naruto stares up at the sky with a constipated expression.\n\n\n“Hey, Dad?” He asks tightly.\n\n\n“Huh? What?” Minato questions, still looking at the spot where the ghost woman had just been.\n\n\n“Uh.” Naruto points upwards, and slowly, they all look straight up at the sky. \n\n\n\n“How are we going to explain \n\ntwo moons?”\n\n"
}