{
    "id": "13668393",
    "url": "https://archiveofourown.org/works/13668393?view_full_work=true",
    "author": [
        "MikeWritesThings"
    ],
    "title": "Surprises",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen",
        "M/M"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Aizawa Shouta | Eraserhead & Class 1-A",
        "Aizawa Shouta | Eraserhead & Todoroki Shouto",
        "Aizawa Shouta | Eraserhead & Shinsou Hitoshi",
        "Aizawa Shouta | Eraserhead/Yamada Hizashi | Present Mic",
        "Bakugou Katsuki/Kirishima Eijirou",
        "Iida Tenya & Midoriya Izuku & Uraraka Ochako",
        "Aizawa Shouta | Eraserhead & Bakugou Katsuki",
        "Bakugou Katsuki & Utsushimi Camie",
        "Ashido Mina & Bakugou Katsuki & Kaminari Denki & Kirishima Eijirou & Sero Hanta",
        "Iida Tenya & Midoriya Izuku & Todoroki Shouto & Uraraka Ochako"
    ],
    "characters": [
        "Aizawa Shouta | Eraserhead",
        "Todoroki Shouto",
        "Yamada Hizashi | Present Mic",
        "Iida Tenya",
        "Uraraka Ochako",
        "Shinsou Hitoshi",
        "Midoriya Izuku",
        "Bakugou Katsuki",
        "Kirishima Eijirou",
        "Yaoyorozu Momo",
        "Jirou Kyouka",
        "Hagakure Tooru",
        "Ashido Mina",
        "Asui Tsuyu",
        "Kaminari Denki",
        "Sero Hanta",
        "Utsushimi Camie",
        "Bakugou Mitsuki",
        "Shouji Mezou",
        "Aoyama Yuuga",
        "Class 1-A (My Hero Academia)"
    ],
    "additional_tags": [
        "Parental Aizawa Shouta | Eraserhead",
        "Class 1-A as Family (My Hero Academia)",
        "Cats",
        "Established Relationship",
        "Fluff",
        "Bonding",
        "5+1 Things",
        "Hair Braiding",
        "Friendship",
        "Deaf Bakugou Katsuki",
        "Deaf Yamada Hizashi | Present Mic",
        "Sign Language",
        "Bakugou Katsuki Swears A Lot",
        "Movie Night",
        "Sleepovers",
        "Sleep Piles",
        "Surprises"
    ],
    "language": "English",
    "series": "",
    "published": "2018-02-13",
    "completed": "2018-02-27",
    "words": "21,184",
    "chapters": "6/6",
    "comments": "624",
    "kudos": "23,473",
    "bookmarks": "4,577",
    "hits": "220,693",
    "summary": "<p>Moving into the dorms, the students get to witness a side of their teacher they didn’t even know had existed--a side much softer, and, dare they say, human, than any of them had ever expected to see.</p>\n<p>(Or, 5 things class 1-A never expected from Aizawa, and 1 thing he never expected from them.)</p>",
    "notes": "<p>happy birthday deandre you dumb gay bitch</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>happy valentine's day!!! i kind of screwed up originally posting this so i had to post it again lol</p>\n<p>anyways i hope u guys liked it!!!!! please drop a comment if u did!!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>oof this chapter feels pretty weak 'cause i wrote it all on my phone so sorry for any mistakes aksiwjsiwk</p>\n<p>also sorry i didn't post yesterday!!! i went out to see black panther last night and i am a changed man, I Only Stan King T'Challa Now</p>\n<p>please drop a review and let me know what u think my dudes, my bros, my main hoes</p>\n<p>sorry for another late chap!!! i typed this all on my phone sksiisjwsis</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>idk how to write bakugou</p>\n<p>this isn't as UwU soft and aizawa-centric as other chapters, but this was something deandre REALLY wanted, so i complied.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>sorry this chap took so long!!! i ended up finishing it in biology ahhhhhh</p>\n<p>hopefully i'll be able to start it tomorrow during lunch and i can finish it on monday? i don't have internet at home so no computer and typing things on my phone is painful :(</p>\n<p>i hope u all enjoyed!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>Well, that's that, folks!!!! I hope you all enjoyed this, don't be afraid to leave behind a wonderful comment if u did!!!!!! I love u all!!!!!!!</p>\n<p>helloooo my dear friend deandre is turning 17 on the 18th so im posting this in advance UwU</p>\n<p><a href=\"https://seerofmike.tumblr.com\" rel=\"nofollow\">i'm just a poor boy nobody loves me</a> <a href=\"https://twitter.com/tsodmike\" rel=\"nofollow\">HE'S JUST A POOR BOY FROM A POOR FAMILY</a> <a href=\"https://boku-no-meme-academia.tumblr.com\" rel=\"nofollow\">SPARE HIM HIS LIFE FROM THIS MONSTROSITY</a></p>",
    "text": "There was a cat in the dorms. It was a gray tabby, maybe about six months old, and it had a black collar around its neck, but no tag.\nNobody could figure out who it belonged to. It certainly didn’t belong to Kouda, who said he already had a bunny. Since Kouda rarely spoke, the class accepted his words as the truth, because most doubted he’d speak aloud to tell a lie. Kouda’s bunny, at least, liked tumbling around with the kitten and chasing after it.\nTheir second guess was that it belonged to Todoroki, who’s eyes softened whenever it came in view, and he always reached a hand out to pet it.\n“Is it yours?” Midoriya asked, watching the cat nuzzle against Todoroki’s palm with a purr.\n“No,” Todoroki answered. “I’ve never been allowed a pet.”\n“Aw, that sucks,” Uraraka said, frowning. Todoroki gave half a shrug in response. He didn’t particularly feel sad about it.\nThe cat jumped into his lap, and he started stroking down its back. Midoriya, Iida, and Uraraka all watched in awe as Todoroki gave the cat a genuine smile. It was perhaps the first time any of them had seen him  really  smile.\n“Todoroki,” Iida said, breaking the silence. “I will get you a cat one of these days!”\n“What?” Todoroki blinked, pausing in his petting of the kitty. “No, it’s fine. I don’t think I could look after one yet. I just like petting them.”\n“Understandable! Then pet the cat all you like!”\n“Ah.” Todoroki blinked, before looking back down at the kitten, which was kneading against his thighs with its paws comfortably. After a moment’s hesitation, he began petting the cat with a little more enthusiasm.\nWith Kouda and Todoroki scratched off of the list, Uraraka decided to make it her job to pursue all of their classmates who liked cute things.\n“Hagakure!” She cried out, cornering the invisible girl in the hallway and holding the cat out in front of her. The cat let out a  mrrph of displeasure. “Is this yours?!”\n“No, but it’s so cute!” Hagakure cooed, and some of the fur on the cat’s head shifted, so Uraraka guessed she was petting it. “What’s its name? It has a collar, right?”\n“Yeah, but no nametag or address!” Uraraka pouted, hugging the cat close to her chest. “We’re just trying to figure out who’s cat this is.”\n“Where’d you find it?”\n“It was in the common room!”\n“Oh, so it could belong to anybody!”\n“Well, I’m just looking for all our classmates who like cute things.”\n“Ojirou likes cute things,” Hagakure supplied helpfully. “But he doesn’t have any pets.”\n“Okay.” Uraraka nodded. “Thanks for your help!”\nNext was Kirishima, who was in the weight room with Bakugou. Uraraka hovered over the other boy, watching him do sit-ups with an impressed look on her face.\n“Is this cat yours?” She asked, and Kirishima paused mid sit-up to pet the cat before dropping back down.\n“Nope!” he said cheerfully. “But it’s cute!”\nThe cat wriggled in Uraraka’s arms, so she set it down and allowed it to roam around the gym room. Bakugou, who was at one of the weight machines, watched it with his brows furrowed. The cat approached Bakugou, before looking him in the eye and hissing.\n“I don’t think it likes you,” Uraraka whispered. Bakugou didn’t acknowledge her, still staring directly at the cat. After a couple moments of a silent death match, the cat rubbed up against Bakugou’s legs and started purring. Shooting Uraraka and Kirishima a somewhat smug look, Bakugou bent over to pet it.\n“Aw,” Kirishima crooned, but Uraraka gasped.\n“Oh my gosh, Bakugou, is the cat yours?! I didn’t know you liked cute things!”\n“Shut up!” Bakugou snapped. “I only like it because its got guts.”\n“Is that why you like me?” Kirishima asked, batting his eyelashes.\n“You are pretty cute,” Uraraka teased. Noticing Bakugou’s fists clenching, she scooped the cat away from him in the nick of time, barely avoiding his explosion.\nNext, Uraraka asked Shouji, then Jirou, then Kendou and Tetsutetsu from class 1-B. Nobody, however, owned the cat nor knew who it belonged to.\n“I’d almost say it was Monoma’s, but I think his is bigger.” Kendou squinted at the cat, before reaching up to pet its head. The cat batted its paw against her hand and she drew away, giving a sheepish smile.\n“Animals have never really liked me,” she admitted, and Tetsutetsu gave her a reassuring pat on the shoulder. Uraraka stuck around them for a few more minutes, watching the kitty interact with them, before leaving with the tabby in tow.\n“I just can’t figure out who’s cat it is,” Uraraka sighed later on, pacing back and forth in the common room as Midoriya, Iida, Todoroki, Tsuyu and Yaoyorozu watched the cat float up into the air. It had happened on accident, but the cat apparently enjoyed the zero gravity, so Uraraka hadn’t released it just yet.\n“Maybe it’s a stray who came on school grounds?” Tsuyu suggested with a croak.\n“It has a collar though!” Uraraka pointed out.\n“Or maybe it’s from a different dorm. You know, from support, or our upperclassmen.” Yaoyorozu gave a sigh. “If we don’t find out who’s it is, I can always make posters and we can put them around the school.”\n“That sounds like the most logical course of action!” Iida agreed enthusiastically, pushing his glasses up his face.\n“I feel kind of bad for the owner,” Midoriya commented, watching the cat roll mid-air. “They must be looking for their kitty.”\n“But we can pet it,” Todoroki hummed, reaching a hand out to brush against the cat’s fur as it floated by. Uraraka pressed her fingertips together and whispered “release!” The cat landed right in Todoroki’s lap, who let out a little noise that Uraraka interpreted to be a happy one.\n“We should probably keep it somewhere for now. Momo, can you make a litterbox?” Tsuyu asked her friend curiously, and Yaoyorozu tapped her chin thoughtfully.\n“I’d have to look up both it and kitty litter’s materials and stuff, but yes, probably.”\n“I think Todoroki should keep the cat!” Iida suggested, waving his hand aggressively in the other’s direction. Todoroki glanced up, a bit surprised, before his eyebrows drew together in what was almost a frown.\n“If that’s not a problem...” he trailed off quietly, and everyone gave him reassuring smiles or a thumbs-up.\nSo the cat settled down with Todoroki for the night, curling up in his room and sleeping beside him on his futon. Before he fell asleep he googled about cat care and spent a good hour reading all sorts of information before eventually passing out. In the morning he let the cat out of his room, allowing it to roam the dorms, and it somehow ended up in Kaminari’s hands.\n“Dude, this is so cute!” He laughed, rubbing its ears between his fingers. “I didn’t know you liked cats!”\nTodoroki didn’t say anything, just kept close by in case Kaminari tried to do something dumb.\nThe day passed pretty normally--Aizawa-sensei assigned them a worksheet the moment he entered the classroom and curled up in his sleeping bag, apparently too worn out to deal with them. Mic-sensei seemed to be a bit on the worried side, talking a little too fast and a little too loud for some of the students’ comfort, leaving several of them mixing up their tenses when asked to read a sentence out loud.\n“You think the cat’s his?” Mina whispered.\n“He told me once he liked birds way better,” Jirou whispered back.\nDuring lunch Todoroki slipped away to check on the cat and feed it some of the food he’d bought the night before. The moment he poured the kibble into the bowl the cat trotted over, giving an almost delighted meow.\n“Are you hungry?” Todoroki asked it quietly, and after a moment, the kitten ducked its head into the bowl and began snacking. “I guess you are.”\nOn his way back to the cafeteria, he noticed something rather peculiar, and paused to stare.\n“What?” Aizawa asked flatly from where he was on the floor, on his hands and knees and peering under the couch. When Todoroki didn’t answer he raised his head, shooting him a questioning look, and Todoroki quickly uttered “Nothing” and continued on back to Midoriya’s table.\nHe forgot about his encounter with Aizawa-sensei until the end of the day, when he, Yaoyorozu, Ojirou, and Iida were all studying together in front of the TV. It wasn’t rare to see their teacher outside of his own room, but a bit uncommon, since he preferred both privacy and silence. Today, however, he passed by them on the couch and headed straight to the kitchen, where the sound of all the cabinets being opened infiltrated their light studying chatter.\n“Ah, he’s doing that again,” Ojirou frowned, nodding towards the kitchen. Todoroki blinked.\n“‘Again?’”\n“Hagakure said she saw him doing that earlier when she came back to get her literature homework...”\n“Is he looking for something?” Yaoyorozu asked, looking up from her book.\n“We should help immediately!” Iida said, waving his hands around, pen still in hand. Todoroki adjusted his own book in his lap and murmured quietly,\n“I saw him looking under the couch during lunch. When I went to feed the cat.”\nThey were all silent for a moment.\n“You don’t think..?”\n“No way,” Ojirou said, shaking his head. “I can’t imagine sensei with a cat. It’s too much...work? He doesn’t seem like the type to be fond of cute things, either.”\n“You shouldn’t make assumptions of people!” Iida chided, crossing his arms. “I don’t look like the type of person who’d own a dog, yet I do!”\n“Actually,” the other three all said at once. “You do look like that type of person.”\nIida threw his hands up in defeat, but before their conversation could carry on any further, Aizawa stalked out of the kitchen, a little more slumped over than usual. However, instead of passing by them, he stood right before them, staring them down.\nTodoroki felt the back of his neck prickle as their teacher continued staring daggers into them, but stared back. He was almost ready for a reprimand of some sort-- you’re being too loud,  or,  don’t study on the floor and block people’s way. \nInstead, he was met with a blunt, “Have you seen a cat.”\nInstantly, everybody else turned to look at Todoroki. Looking at them, Todoroki was faced with three faces filled with poorly-disguised surprise.\n“Yes,” Todoroki said back. “It’s in my room.”\n“Is it yours..?” Yaoyorozu asked, glancing back at Aizawa, who nodded silently, before giving Todoroki a pointed look.\nTodoroki got to his feet, setting his book aside, before making his way to his room, Aizawa following with silent movements. The moment Todoroki opened his door, the cat ran out, brushing up against his legs and purring, before trotting over to Aizawa and doing the same.\n“I didn’t know you liked cats.” Todoroki commented as Aizawa crouched down to scratch beneath its chin. He felt a pang in his heart as he watched the cat circle around his teacher, though he couldn’t really explain why he felt it.\n“I could say the same to you,” Aizawa said back, continuing to stroke the cat, who look every bit intent on rubbing its body against its owner until the world ended. With a soft meow, the cat placed its paw on Aizawa’s arm, and Todoroki blinked slowly.\n“How’d you know I like cats?”\n“Why else would you keep it?” Aizawa mumbled, not lifting his eyes from his pet.\n“Oh. Fair.” Todoroki scratched at the base of his neck as he watched his teacher scoop the cat up gently. Somehow, he wasn’t  all that surprised. Despite what Ojirou said, he thought Aizawa did seem like the type of person to be fond of cute things. Secretly, of course. “I’ve never been allowed to keep a cat, so I wasn’t all that sure how to take care of it. Sorry.”\n“It’s fine. Thank you for trying.”\n“I fed it, too, so you don’t need to worry about it being hungry...”\nAizawa bowed just a bit in thanks, and the cat gave a mew of protest.\n“Does it have a name?” Todoroki surprised himself by asking, and almost regretted it.\nHowever, all Aizawa did was blink slowly down at the cat, before nodding. The silence stretched on, and Todoroki assumed he wasn’t going to reveal its name and that their conversation was done, so he awkwardly shut the door behind him and prepared to return to his study group. Before he could get far, however, his teacher spoke again.\n“His name is Jellybean.”\n“...Jellybean?”\n“Mention it to anybody, and I’ll expel you,” Aizawa said, leveling him with a stare, though the effect he was going for was a little ruined by the fact that there was the faintest tinge of red in his cheeks. Neither said anything, so Aizawa brushed past him, undoubtedly to return to his own room. Todoroki watched the other leave with Jellybean in his arms, a weird aching feeling in his heart, despite having only kept the cat for less than a day. But despite the short time, he’d always wanted a cat, and to lose it so soon felt like a blow.\nHowever, before his teacher was completely out of sight, he stopped, and said,\n“If you want to pet him sometimes, I’ll let you. Just ask.”\n“Oh,” Todoroki let it slip out without meaning to, surprised. “I...thank you.”\n“Get back to studying.”\n“Yes sir.”\nHe watched his teacher disappear around the corner before heading back to his study group, who were all waiting for him with an almost fearful silence.\n“Did you get in trouble?” Ojirou whispered, and Todoroki shook his head.\n“Well that’s good!” Yaoyorozu smiled, before opening her book back up. “Now, where we...?”\n“He said I could pet his cat.” The words fell out of his mouth before he could think about it, and the others stared at him once again. “Which I’m thankful for. I...really liked the cat.”\nIida sniffed a bit. “Sensei is so kind.”\n“All he said was that he could pet the cat...”\nBut Todoroki agreed with Iida. He hadn’t been expecting it, but he appreciated it.\nA lot.\nClass 1-A knew their teacher didn’t really care for appearances that much. In fact, he hardly cared at all, and they were pretty sure he only wore pants because he could go to jail for public indecency if he didn’t.\nThey could count the number of times they’d seen him in halfway-decent clothing on one hand, and both of those times he’d been dressing up for other people at the advice of Nedzu for Yuuei’s sake. During the press conference his hair had been slicked back, and during the house visits it had been done up in a bun. Midoriya once claimed to have seen him in a ponytail, but didn’t give much detail beyond that.\nYes, 1-A knew their teacher didn’t care for appearances and dressing up, but it wasn’t until moving into the dorms that they realized the disregard for such things didn’t quite extend to his hair.\nMaybe they shouldn’t have been surprised--I mean, why else would he keep it so long? He was all about being practical, and long hair just simply wasn’t. It was a tell for his Quirk, it required more effort to take care of, it got stuck in things, and it flopped into his face. So why didn’t he just cut it? The simple answer: he may, in fact, actually quite like his hair. A lot.\n“Did you see sensei..?”\n“No, what’s the matter?”\n“He’s got a...”\n“It’s so cute!...”\n“Whooaaa...wonder where he got  that...”\nThe thing they were all looking at was the rather large cat hair clip twisted at the back of his head, pulling a good majority of his hair away from his face. It wasn’t the cat they were surprised by (word of the stray being his had spread) but the fact that he had even bothered with such a hair decoration despite it always being apparent that he didn’t care about looking nice.\n“It’s super cute! Not just the clip, but the hairstyle...”\n“Oh, you can see his whole scar like this...”\nAizawa either didn’t hear their whispers or refused to acknowledge them as he did the standard dorm check. Once a month they were required to clean up the dorms--common room, bathrooms, and their own rooms--and gather in the dining area until a teacher finished checking them.\nHowever, a few stragglers that hadn’t quite made it to the dining area in time (Uraraka, Kaminari, Hagakure, Sero, Kirishima, Satou) had all paused just before they reached the kitchen to stare at their teacher. He’d emerged from his own room, which was at the opposite end of the common room, and captured Hagakure’s attention, who was the first to point out his hair.\n“Seeing his whole face is weird,” Kaminari commented, and Sero nodded in agreement.\n“I’ve never noticed how long his scar is!” Uraraka whispered, and Kirishima squinted at their teacher to get a better look at it.\n“Look at the cat!” Hagakure raised her voice, the loudest of them all, hands waving enthusiastically in the air. “Sensei! Your hair is so pretty today!”\nThey all stiffened up as he shifted his gaze towards them, but all he said was, “Get going.”\n“Yes sir!” They all crowed, and rushed into the dining area, Satou and Kirishima nearly getting stuck in the doorway together as they did so.\nThey all thought it had been a one-time deal. It was a Saturday, and maybe their teacher had just woken up and put his hair in a clip because he didn’t want to bother with it. That had to be it, right?\nOnly less than a week later, he wore a different hairstyle again.\n“What the hell,” Bakugou said, the first one to notice it.\n“What, did I do it wrong again?” Mina asked, glancing up from her homework, only to find her temporary (and begrudging) tutor staring at something else. “What are you--Oh my god!”\nHer shriek garnered the attention of the others in the room, including the self-proclaimed ‘Bakusquad’ (the name was pending) and Tokoyami, who had joined them for reasons unknown.\nAizawa paused as well, taking a moment to glare at Mina, before asking, “Is there a reason you’re yelling so late in the day?”\n“They drown out the screams of the night,” Tokoyami said cryptically. He went ignored.\n“Your hair!” Mina, Kaminari, and Kirishima all said at the same time. “It’s so--”\n“Pretty!\n“Weird!”\n“Manly!”\nAizawa stared down at them all, before turning his back on them silently and sitting on the couch. His hair was in a long braid that was a little more well-done and intricate than they ever would have expected from Aizawa-sensei. When nobody spoke for a while, Sero took his chance to.\n“What’re you doing out here, sensei?”\n“Making sure you don’t blow up the common room again,” was all he said, eyeing the ‘Bakusquad’, quite notorious for being the root of 80% of dormroom explosions. And most of the time they weren’t even Bakugou’s  fault.\nThey returned to studying after Bakugou threatened to leave if they didn’t start paying attention, and like that the night slowly ebbed away. Aizawa took out a stack of papers and graded them on the couch. Tokoyami didn’t mean to pry, but he became quite interested in his grading when he saw his own paper on top, which faded away when he then noticed the amount of red markings on his paper. He wasn’t prepared to deal with  that darkness.\nAnd just like that, Aizawa-sensei started wearing his hair differently more often. Nobody could quite figure out why, but they thought it was cool anyways. He never did it during class, except whenever it was hot outside and he pulled his hair into a lazy ponytail so it wouldn’t stick to his face. He only did it after school, and more often on the weekends.\n“I like your plait, sensei!”\n“Whoa, sensei, didn’t you know man-buns are in fashion right now?!”\n“A ponytail! Simple but elegant! Charmante!”\nOn one occasion he’d even worn his hair in pigtails, which he’d grumbled about not being his doing, but wore them anyways. Everybody had placed their bets on the perpetrator being Midnight or Present Mic.\nIt eventually lead to a group of students sitting in a circle together, a quite random assortment, but an assortment nonetheless--Jirou, Uraraka, Yaoyorozu, Kouda, Shouji, Mina, Kirishima, Tsuyu, and Todoroki.\n“I’m just saying it’s a possibility!” Mina was saying. “Look how much he does his hair! I think he really likes it!”\n“He just likes styling it,” Yaoyorozu corrected. “Or it may just be practical for getting his hair out of his face.”\n“I think Ashido has a point,” Shouji spoke up, drawing everyone’s attention. “He always hides behind his hair, runs his hands through it...the pigtails were a bit different, though.”\n“Maybe he just likes styling his hair because it’s relaxing,” Todoroki said. When everyone looked at him instead, he further elaborated: “When I was younger, my sister taught me how to braid her hair. It’s nice.”\n“Quick question,” Jirou said, raising a hand. “Why are we talking about this again?”\nKouda gave a shrug, which was the only response she got, and she sighed. She supposed the answer was that they didn’t really have anything better to do. Well,  she  didn’t have anything better to do. She actually was pretty sure Mina and Kirishima were skipping out on homework to be included in this conversation.\n“But it’s so pretty, you know? I didn’t think sensei would be the type to put pretty things in his hair, and now I’m just wondering...” Mina paused, tapping a finger to her chin, and Kirishima raised an eyebrow.\n“Don’t tell me--you’re going to ask if you can do his hair, aren’t you?”\nMina grinned. “Yup!”\n“I don’t think Aizawa-sensei would agree to that,” Tsuyu said wisely. “There’s a difference between him doing his hair and somebody else doing his hair. Ribbit.”\nUraraka, who had been silent this entire time, suddenly spoke up:\n“Where’s Aizawa?”\n“In the dining area,” Yaoyorozu said. “I think he said something about needing lots of coffee.”\n“Right!” Uraraka huffed, sounding determined, and she pushed herself to her feet and made her way over to where their teacher was. She moved quickly and with drive, as if she were on a mission, and everyone stared after her, eyebrows raised.\n“I’m going to follow her,” Tsuyu croaked, getting to her feet and chasing after her friend, followed closely by Todoroki, Mina, and Kirishima. They paused just outside of the dining area, peering in to see Uraraka planting her feet in front of their teacher, who had a bemused expression on his face. Today his hair was loose around his shoulders, and after seeing it in so many buns and ponytails, it just felt kind of off now.\n“Aizawa-sensei!” Uraraka announced, and he raised an eyebrow. She faltered just a bit, but continued on. “Please braid my hair!”\nKirishima choked on air and Mina gave a giggle that sounded halfway nervous. They all watched with bated breath as Aizawa took a long sip from his coffee, eyeing his student, before delivering his answer:\n“No.”\n“Oh,” Uraraka deflated.\n“It’s too short.”\n“...What?”\n“It’s too short to braid. And the way your hair is cut would make it hard anyways.”\n“Oh,” Uraraka repeated, though now she sounded a bit confused. “So...you would have..?”\nWhen Aizawa raised another eyebrow at her, Uraraka began sputtering, waving her hands around as she tried to coordinate her words properly. To spare her friend from embarrassment, Tsuyu stepped forward into their teacher’s line of view, and asked,\n“Sensei, could you braid my hair then?”\nFor a moment everything was still. It then crossed Tsuyu’s mind that perhaps the short hair had been an excuse and Aizawa really wouldn’t braid anybody’s hair, but the thought went away as she watched him set his coffee down and beckon her forward.\nThere were an assortment of chairs in the dining hall, regular straight-backed chairs and chairs with cushions in them and stools. Tsuyu dragged one of the stools closer to her teacher and perched on top, and a second later she felt a hand brushing through her hair steadily.\n“...Am I hallucinating?” Kirishima whispered to the others. “Like, is this really happening?”\n“It sure is!” A voice beside them chirped, and everyone else jumped as they realized Hagakure had managed to sneak in without anybody noticing. “Me next!”\n“But...nobody can even see your hair.”\n“Me. Next.”\n“Alright...”\nEverybody watched with awe as Aizawa braided Tsuyu’s hair, which hadn’t been done in a bow today like usual. Uraraka had seated herself before Tsuyu to watch as well, and when it neared its end she gave the other girl a thumbs up and chirped,\n“It’s looking so pretty already!”\n“Thank you, ribbit,” Tsuyu said, and she felt Aizawa let go of her hair. “Is it done?”\n“Yes.”\n“Thank you, Aizawa-sensei.” Tsuyu slid off the stool, taking a moment to examine the braid. She said in an honest voice, “It’s really good.”\n“Me next!” Hagakure shrieked, sliding onto the stool. Aizawa blinked down at her, eyebrows furrowing, and he muttered,\n“I can’t see your hair.”\n“Are you saying you can’t do it?” Hagakure asked in a challenging voice, and after a moment of silence he reached out to grab at her hair.\n“I cannot,” Jirou said slowly, eyes filled with shock, “Believe that that actually worked.”\n“It seems he’s full of surprises,” Shouji commented.\nIt looked kind of weird, since it seemed like Aizawa was waving his hands through thin air, but everybody knew he was braiding Hagakure’s hair. Nobody could quite figure out how long it was until it was done, when his hands stopped a couple of inches beneath her shoulders and he said, “There.”\n“Oh my!” Hagakure giggled, leaping off the chair and landing gracefully on her feet. She paused to examine her reflection in one of the mirror-like walls, and said, “It looks pretty bad!”\n“It’s not like he can see your hair!” Uraraka replied, jabbing her in the ribs with her elbow.\n“That’s true. Thank you for trying, Aizawa-sensei!”\n“Anybody else?” Aizawa asked, half sarcastically. He was suddenly faced with Kirishima, who was mussing his hair up in a desperate attempt to unstyle it.\n“Sensei, is my hair long enough to braid?!”\n“No.”\n“Darn it!” Kirishima cried, falling to his knees in defeat.\n“Yaomomo, why don’t you get your hair done?” Mina encouraged the other, and Yaoyorozu shook her head, a blush rising to her cheeks.\n“No, I don’t think I should...”\n“But you’d look so cute!” Mina said, before rounding on Jirou. “Right?!”\n“Well...” Jirou blinked, picturing Yaoyorozu with a braid, and her face reddened. “Yeah, dude, you should get your hair done. I mean, I’d get mine done, but it’s too short...”\nEventually Yaoyorozu seated herself in front of Aizawa-sensei, sliding her hair out of its ponytail, and their teacher sighed. He did her hair anyways, focusing on the movements of his hands so he wouldn’t mess up, and he stiffened when he felt somebody grab at his own hair.\n“I’m gonna braid yours since you can’t braid mine!” He heard Mina say, and he bit back a sigh.\nHis braid ended up looking quite disastrous, which Hagakure said looked even worse than hers. The next day the girls wore their braids to class, always pointing at him when asked who had done their hair. By the end of the day he’d ended up with ten requests to braid hair, though he had to turn away seven of them due to their hair being too short. He wasn’t sure why he’d done Kendou, Shiozaki, and Pony’s hair, but he told himself it was to spite Blood King.\n(And he also told Mina that he hadn’t bothered taking his hair out of its disaster braid because it was too much effort.)\nPresent Mic had an odd habit of sneaking into the 1-A dorms. He didn’t come into the dorms casually, which would have been fine, because he was a teacher and nobody would have batted an eye if he did.\nNo, he  snuck  into the dorms. Repeatedly. Like, crouched low, crept around corners, and jumped whenever he got caught.\nThe first time it happened, he had been discovered in the kitchen, so Kouda merely assumed he was stealing food and never said anything about it. The second time it happened, Mina had caught a glimpse of blond hair whipping around the corner near the bathrooms and shrieked something along the lines of  “Whatever pervert was planning to sneak into the girls’ restroom, I’ll disintegrate you!” \nAnd the third time it happened, he had been discovered by pretty much half the class.\nMidoriya and his group of friends, plus Kaminari,  Aoyama, and Jirou, were all sitting down and watching a movie about a dog, which was leaving Iida in tears, clinging to Uraraka and Midoriya as he sobbed. Poor Todoroki, who had been sitting on the floor in front of him, had reached up to awkwardly pat his friend’s leg only to find it trapped by Uraraka’s when he tried to move it away.\nTsuyu and Aoyama remained mostly unaffected by the movie, though Aoyama occasionally took out a glittery handkerchief to blow his nose with. Jirou was bored, and had spaced out staring at the wall for the better part of ten minutes. That’s when she noticed something peculiar.\nA crouching figure was doing its best to conceal itself in the shadows, and it would have worked had she not been staring at the spot for so long. The figure seemed tall, with long, light-colored hair falling down its back and the faintest glint of glasses frames. It almost seemed to be sneaking out of the dorms, rather than in.\nShe recognized the figure almost immediately.\n“Present Mic?” She called out, and the figure froze, before straightening up and laughing loudly.\n“Wow, you caught me! Haha, good job, listener!”\n“What are you doing here?” Todoroki asked, still trying to unwedge his hand from where it was trapped.\n“What am I doing here? That is a good question!” Mic froze, eyes wide, before he started stammering. “I was, uh, obviously, I was here to, uh, to do things, and it was definitely n-not...uh....important!”\n“What are you hiding, sensei?” Tsuyu asked bluntly.\n“Nothing, honest!” Mic waved his hands around, shaking his head rapidly. “I was just--uh,  visiting. Yeah, that's it!”\nEverybody gazed at him suspiciously, except for Iida, who was still crying. When Mic didn’t say anything else, they shrugged and went back to watching their movie, but not before Kaminari commented, “That was strange.”\nIt was odd. But having lived in the dorms for nearly four months, they’d come to accept that their teachers were just  weird and they should probably just accept that as fact.\n Their homeroom teacher was a lonely, single, presumably heterosexual hobo who found the finer things in life to be the following: cats, braiding hair, sleeping, and sucking jelly pouches dry. At least, that was the assumption that everybody had made without really  knowing  they were making that assumption, which was precisely why everybody was shocked to find out one teeny, tiny fact:\nAizawa Shouta was married. In a committed relationship. Like, to an actual person, not his sleeping bag.\nAnd he also wore a ring around his neck.\nThe person who claimed such a thing was Sero, who yelled about it to Kaminari, who in turn told Jirou and Yaoyorozu, and just like that, the word spread. Everybody hounded Sero for more details, who had placed himself atop his desk almost as if he were a king, enjoying the brief attention he had.\n“I saw it last night,” Sero was saying. “I dunno if anybody else saw it, but you know how Bakugou and Satou were getting into a really heated baking competition, and then sensei had to come out and restrain Bakugou from shoving Mineta into the oven? Well, when his scarf lifted, I thought I saw  something, and lo and behold--he wears a necklace! And on that necklace is a ring!”\n“That doesn’t mean he’s married, though,” Midoriya tried saying, but it was a weak argument and everybody knew it, because hair decoration aside, Aizawa-sensei wouldn’t wear something like that just for fun or to look nice.\n“Did you ask him for details?” Uraraka demanded, and Sero shook his head.\n“Nah, didn’t have time to, I was too busy scraping batter off of Ojirou.”\n“Thanks for that, by the way,” Ojirou said.\n“No problem, my dude.”\nAizawa’s rumored ring suddenly became the only thing anybody wanted to talk about, because they were twenty teenagers trapped inside school every hour of every day, and they needed  something  to talk about. So their teacher’s alleged love life became the subject of their interest.\n“We need to find out if he really wears a ring first, though,” Kirishima said. “Sero could’ve been seeing things, or maybe he mistook it for something else.”\n“This is stupid,” Bakugou growled out.\n“Is not! Don’t you want to know if he’s married?! Don’t you want to know if pros can get married?!”\n“Why the hell would I want to know that?” Bakugou spat, and Kirishima blinked, before getting down on one knee dramatically, placing a hand to his chest.\n“Bakugou Katsuki, my angry and beloved boyfriend, would you make me the happiest--”\nMina, Kaminari, and Sero were all laughing so hard that Yaoyorozu feared they were actually dying due to the loud wheezing sounds they were making. The wheezing soon became the least of their worries when Bakugou exploded, but it was still funny all the same.\nHagakure volunteered to sneak around their teacher to catch a glimpse of the rumored ring, and after two days of doing so she reported back to the class that there was indeed a titanium ring hanging from his neck that was usually either hidden in his scarf or slipped beneath his shirt.\nThat was how the betting pool started.\n“I’m putting one thousand yen on Midnight!” Mina declared triumphantly, slapping down her money on the table and ignoring Iida’s shouts of  “We’re underage, we can’t bet!” \n“One thousand yen on Midnight as well.” Aoyama slid the money over to add to the pile, and he and Mina high-fived. The class was gathered  in the common room, ignoring the fact that Iida was telling them it was immoral, and also that they could be discovered by Aizawa-sensei himself at any time.\n“Five hundred yen on Ms. Joke,” Tokoyami said coolly, and Iida shouted, “Tokoyami, you too?!”\n“Ooh, Ms. Joke! That’s a good candidate!”\n“Oh yeah, her! I’m putting one thousand for Ms. Joke!”\n“I’m putting eight hundred on Mandalay, from the Pussycats,” Shouji said, and a few contemplative hums went around. Suddenly, everyone went silent as Todoroki stepped forward, several crumpled yen bills in his hand. Slapping it onto the table, he said,\n“Five thousand on Present Mic.”\nEverybody stared at him, jaws dropped. Tsuyu, the responsible classmate who was holding all the bets despite a bit of a protesting, raised her eyebrows at her classmate.\n“Ribbit, are you sure, Todoroki? That’s five thousand on...Present Mic, and I don’t think sensei likes him very much.”\n“I’m sure,” Todoroki said in a serious voice.\n“One thousand on Present Mic too,” Jirou spoke up from behind Todoroki, further shocking everybody else.\n“You as well, Jirou?!”\n“Well, she  is  Present Mic’s protégé...she’d know something, wouldn’t she? Hey, Jirou, what do you know?!”\n“Nothing concrete,” she admitted. “I just kinda...got a feeling.”\n“I’m not betting, but I think it’s Present Mic too!” Kirishima butted in, and everybody stared at the trio who believed it was Present Mic. Like,  Present Mic, Mr. Loud and Flashy, who made really terrible puns in Japanese  and  English. Present Mic, who was a DJ and a radio star, and who’s entire persona revolved around being as loud as possible.\n“Quick question,” Uraraka began, raising her hand. “Why do you think it’s him..?”\n“Yeah, are you saying sensei is gay?”\nTo that, Kirishima and Jirou said at the same time, “Duh.”\n“I just said the person I thought he was closest with,” Todoroki said bluntly.\n“This is still very inappropriate to be talking about!” Iida half-yelled, still deeply protesting it all. “We need to stop at once!”\n“For once, I agree with Glasses,” came a new voice from the couch. Everybody looked over to see Bakugou lounging on it. “Don’t you have anything else to do that isn’t fucking  redundant?\"\nThere was a long stretch of silence. Then, as if realizing their errors, the class slowly began to disperse, though they still left their bets with Tsuyu.\nBut even after that, class 1-A kept a close eye on their homeroom and English teachers.\n“I can’t believe they think it’s that  guy,” Sero commented as they watched Mic physically drag Aizawa out of his sleeping bag, presumably to the staffroom.\n“There is literally no way they’re married!” Mina cried out when Mic dumped an armful of jelly pouches onto Aizawa’s desk the next morning.\n“I don’t think Aizawa likes him at all,” came Kaminari’s voice when Mic visited the dorms during dinner and reached a hand out to touch Aizawa’s braid, only for his hand to be promptly smacked away.\n“But they’re always hanging around each other,” Uraraka countered them all.\n“And we’ve seen how Aizawa-sensei interacts with Ms. Joke! If it was kind of like that, I think he wouldn’t even bother with Mic-sensei!” Kirishima added.\n“They just seem to get along really well,” was all Todoroki had to say.\nThey kind of forgot about the bets by the time the weekend came, a rather strenuous Quirk exercise exhausting them all, even Bakugou.\nWell, they didn’t forget about the bets entirely--it was just pushed to the back of their minds as they went on doing their schoolwork and training.\nThen Sunday happened.\nTheir teacher was a pro hero, and becoming their dorm supervisor hadn’t changed that. Sometimes, those who were out late at night for whatever reason, whether it be watching TV or getting a drink of water, caught a glimpse of their teacher coming back from his hero work. He usually looked dead tired, but it wasn’t anything new, so nobody ever commented on it.  The only time they had was when Yaoyorozu and Iida were up late planning a tutoring schedule and saw him stumble into the dorms with a huge gash across his lower back.\nSunday night he was out for patrol, which meant they had another teacher checking in on them occasionally. It seemed to rotate every couple of times to a different teacher, because the last three time’s it had been Midnight-sensei, but this time it was Mic-sensei. He’d watched half a movie with them, ruffled Jirou’s hair, and poked some good-natured fun at them while they did their homework or talked to one another.\nIt had all been good and well until he had barged into the dining area during dinner, and shouted at them about cleaning up the mess they’d made in the kitchen (which was totally Aoyama’s fault,  by the way).\nThey were all currently still recovering from that experience, every noise causing a few to jump due to their suddenly sensitive ears. Eventually they’d all moved away from the common room, unable to stand the noise everybody was making. Mic-sensei apologized profusely and assured them that the ringing would clear away by morning.\nUraraka, Midoriya, and Iida were all studying in Iida’s room together, though he was constantly being shushed by the other two due to talking extremely loudly.\n“My head hurts!” Uraraka complained, clapping her hands over her ears when Iida’s voice raised again.\n“I apologize sincerely!” Iida cried out, causing Midoriya to wince.\n“Why don’t we get some earplugs?” Midoriya suggested. “We can ask Yaoyorozu to make some for us, and then all the noises will be muffled and it won’t hurt as much...”\n“Wow!” Uraraka beamed. “That’s a great idea, Deku!”\n“I’d expect nothing less from you!” Iida said earnestly, causing his friends to jump a little at his volume. “Sorry!”\nThe three stepped out into the hallway, only noticing how late it truly was when Midoriya glimpsed sight of Iida’s clock just before his door shut behind him.\n“It’s almost one in the morning..!”\n“Then we best get to bed, nevermind the earplugs tonight,” Iida instructed quietly. They all nodded, until a low groan sounded and caused Uraraka to squeak loudly. Frozen, they all stood still, listening for more terrifying noises, thoughts of an intruder infiltrating their minds. A lower groan sounded again, and Midoriya squinted into the darkness.\nThe dorm lights were shut off after a certain time to conserve electricity, so the common room was shrouded completely in black, making it all the more harder to see who--or what--had made the sound. Uraraka pressed her back against Midoriya's chest as she took a few steps back, forcing him into Iida’s chest as well.\nThe groan sounded again. Midoriya squeaked this time, arms jumping forward to cling onto Uraraka, and Iida clung onto him. They stood like that for so long that their legs started going numb, completely frozen and clinging to each other as they tried to stay silent. There weren’t any windows in the common room, and the only lights available were the slivers that shone from beneath their classmates’ doors. They were pretty sure an animal was dying.\nSuddenly, a light flickered on, and Midoriya clapped a hand to his mouth to keep himself from screaming.\nIt was a small and tiny light, but blinding nonetheless. They all recognized it as a phone flashlight, bobbing its way into the common room, before shining down on the couch. Iida let out a sigh of relief, though he didn’t move his hands from Midoriya’s shoulders.\nAizawa-sensei was draped across the couch, scarf covering the majority of his face. The groaning had, apparently, been coming from him, though he didn’t seem to be bleeding anywhere, and none of his limbs looked broken. Despite all this, there was a tear in his left sleeve that went all the way up to his shoulder, though there was no wound visible on his skin. He simply must have been exhausted.\nThe three were about to untangle themselves from each other’s grips when a voice spoke and caused them all to freeze again.\n“Shouta, c’mon, wake up.”\n\n Shouta? \n\nSure, they were all aware of their teacher’s first name, but to actually hear it sounded weird, like it was something they weren’t  supposed  to hear.\nAnother groan. This one was a bit louder and more awake-sounding than the ones before.\n“What’s the matter?” The other person asked softly, crouching down beside the couch. The phone flashlight was placed on the floor, half-illuminating the person’s torso. They weren’t all that surprised to see that it was Mic-sensei, though they were surprised when he placed one hand on their teacher’s cheek.\n“‘m head,” was all Aizawa-sensei managed to grunt, and Mic ran his fingers into their teacher’s hair cautiously, tugging them through his tangles.\n“Did you hit it? Do you have a concussion?” The concern in his voice was undeniable, though he was clearly trying to mask it by sounding just as energetic as ever.\n“No. Just hurts,” Aizawa-sensei mumbled. “Just let me sleep.”\n“No way,” Mic laughed, bending down to pick up his phone. The light disappeared and a bit of grunting sounded, before the light reappeared again. Mic-sensei was holding Aizawa in his arms, phone in hand to shine light down the hall. “Let’s get going, Eraser.”\n“Mhhm. Are you three just going to stand there all night, or do you plan on going to bed any time soon?” Came Aizawa’s gruff voice, causing the trio to let out yelps of varying loudness and surprise.\n“Sorry!” They all cried out, stumbling over one another as they watched Mic-sensei carry Aizawa to his room. “We’re going to sleep now, sir!”\n Word about the little event spread somehow, though each of the trio swore they didn’t tell  anybody  about it.\n“Hate to say it, but I may have been wrong,” Shouji sighed, crossing his arms. “It looks like it’s Present Mic after all.”\n“So do I get my five thousand yen back?” Todoroki blinked.\n“That’s not really how betting works, but yeah.”\n“Hold on!” Mina cried out, waving her arms around. “We can’t be jumping to conclusions  yet!  We don’t know for sure!”\n“Well, how do we find out for sure?” Tokoyami asked. “It’s not something we can simply discuss.”\n“I still think we shouldn’t really be talking about this,” Ojirou muttered quietly, but he went unheard.\n“Well, we could always search in their profiles, it’d be listed there, right...?”\n“Can’t you google it?”\n“What if we asked the other teachers?”\n“Oh, for fuck’s sake,” Bakugou growled out irritably, and leaped from his desk, kicking his chair behind him. The class watched with bated breath as he stomped out of the classroom, and they all peered out into the hallway. He was making his way to where Aizawa-sensei was standing, flipping through a stack of papers and making his way slowly towards the class.\n“Are you married or not?” Bakugou asked, stopping in front of his teacher.\nAizawa blinked slowly at his student from over his papers, eyebrows arched, before nodding.\n“Yeah, of fucking course you are. And who are you married  to?”\nThe slightest hint of a smirk crossed their teacher’s face. “You have one guess. I’ll either confirm or deny.”\nBakugou’s shoulders hunched, but he spat the name out anyways: “Present Mic?”\nA beat. When their teacher nodded, the class went wild.\nAfter learning of the fact that their teacher was married to Present Mic (and Jirou and Todoroki won their bets), said English teacher was over a lot more often, usually to do dumb things like ruffle Aizawa’s hair and tell stories about their high school years to the class. Hagakure particularly enjoyed questioning about their love lives in high school, wondering if they’d  always been together.\n“Pretty much!” Mic-sensei confirmed, and Hagakure let out an  ‘Awww.’ \nNobody could deny that they were all pretty shocked that it was  Present Mic  Aizawa-sensei was married to. They just couldn't see why, and those who had bet on it couldn't provide solid enough answers. Kirishima claimed that he, ‘as a fellow gay’ could just  tell, but they all searched for more reasons as to  why they’d be married.\nThey knew each other in high school, that was apparent. Present Mic gave Aizawa the name ‘Eraserhead’, which they already knew, but also gave him other nicknames like  ‘The Sleeping Prince of Relaxation’  and  ‘Energy-Saving Shou-chan.’ Names which, it appeared, Aizawa-sensei put up with, despite not putting up with other sorts of nonsense.\nThey spent an awful amount of time together, despite Aizawa being the type of person who wanted to be alone frequently. They also learned that Mic-sensei had worried about the disappearance of Aizawa’s cat, which explained his anxiousness that day, and they also learned that Aizawa-sensei would skip lunch every other day if Mic-sensei didn’t constantly shower him in jelly pouches.\n\"Their desks are right next to one another's.\"\n\"During USJ, as I was carrying Aizawa-sensei, I noticed Mic get angry when he saw the state he was in, and he used his Quirk.\"\n\"Didn't they commentate on the sports festival together?\"\n\"Didn't Mic-sensei ask Aizawa-sensei out to lunch over the speakers?\"\nThey had all been surprised, but maybe, upon further reflection, they shouldn’t have been. Maybe they should be more observant in the future.\nMic-sensei himself seemed to find the fact they hadn't figured it out sooner funny, and became more eager to express his affection every couple of minutes now.\n“No point in hiding it anymore!” He laughed, wrapping his arms around their homeroom teacher, much to the other’s chagrin. “Now we can cuddle and we can be all lovey-dovey--”\n“Absolutely  not,”  Aizawa said, voice sharp, but his husband laughed as if he hadn’t heard him speak.\n“C’mon, yeah we can!” Mic grinned, before burying his face in their teacher’s neck. To the class’s collective awe, his face turned  red  as Mic pressed a kiss to it. The awe only amplified when Aizawa flipped Mic over his shoulder and shouted at them to get back to cooking dinner before it burned  again. \nBakugou Katsuki had a hearing problem.\nThat was fucking it. He had trouble hearing sometimes, because his explosions were damaging his eardrums and all that kind of shit. End of the fucking world, or whatever. At least, that’s what his mother said, but the sarcasm was there, so he didn’t make a fucking stink about it.\nIt wasn’t like it was anything new. He’d always screamed to be heard, had always had a lingering ringing in his ears even after the bombs had subsided. Recently though, it was becoming harder to hear instruction in class, especially from quieter teachers like Cementoss and Aizawa, and it was causing him to fall behind in his notes as he tried to piece together what he  could  hear.\nWhen his mother dragged him to the doctor, they slapped the Official Label on it, and then recommended that he take like, sign language classes and shit, because with all the recent hero training and continuous use of his explosions, his hearing was deteriorating faster than anybody had thought it could.\n“You’re kidding,” his mother had said as she glanced over all the shit that was recommended. Hearing aids, sign language classes, a Quirk-based class that was supposed to teach you how to minimize whatever sound your Quirk made. “All this, just ‘cause of a bunch of explosions?”\n“Well, mankind has obviously evolved so that our bodies are more resilient, especially in areas where our Quirks are concerned,” his doctor said, adjusting his glasses in a patronizing way that really pissed Bakugou off. “Unless you overuse your Quirk, it doesn’t damage that particular part of your body all that much. That’s why Katsuki rarely ever suffers from burns scars on his hands. However, his Quirk didn’t come with a built-in sound-resistance factor, so his ears take damage as anybody else’s would.”\n“Yeah, we  know  that.” Mitsuki crossed her arms. “So how long ‘till he’s completely deaf?”\n“I’m not gonna be deaf,” Bakugou spat out, but the doctor spoke over him and answered,\n“Before he graduates, if he’s not careful.”\nMother and son had exploded, both literally and figuratively, and when they were finally kicked out his mother hummed something about getting him hearing aids for sure, which he extremely fucking protested.\nKirishima had taken the news surprisingly well, not that it mattered if he did or not, he told himself, even though for a moment his stomach had dropped as he thought, What if he thinks that makes me weak.\nInstead, Kirishima said,\n“Oh, okay.”\n“What do you mean, ‘okay’?!”\n“I mean, I guess that explains a lot, doesn’t it?”\n“Whaddya mean?!”\n“I mean, you’re always screaming, always telling people to speak louder. Lots of things make sense now!”\nBakugou allowed himself to falter in his footsteps. They were pretty much alone, after all. “Seriously?”\nKirishima blinked. “Uh...you okay, dude?\"\n\"Of fucking course I am.\"\n\"Oh. Are you gonna learn sign language?”\nAt the mention of it, his lip curled, and he growled, “No fucking way.”\nHe didn’t tell anybody else about it, but suddenly a few people--not everybody, but mainly his circle plus Deku--started speaking a little louder. Just a bit. It pissed him off.\nParents were allowed to take their kids out of school for a short period of time for personal doctor visits, so long as they returned a report of the student’s health to the school so everybody could keep up-to-date on things. So he shouldn’t have been surprised when after class, in the dorms, Aizawa called Bakugou out into one of the hallways.\nHe’d been sitting with Kirishima, Mina, Frogface, and Ponytail Girl, though he wasn’t interacting with the girls and was promptly ignoring them. However, when Aizawa called his name, they all glanced up at him, and he sent a glare their way.\n“So,” Aizawa sighed out the moment Bakugou stalked to where their teacher was standing. “Your hearing.”\n“What about it?” Bakugou gritted out, expecting him to go into a lecture--about how much he needed to control his Quirk’s noise output, and all that other bull-fucking-shit the stupid fucking doctor told him about.\n“Can you understand sign language?”\nNot what he had been expecting, but not entirely a surprise.\n“Of fucking course I can’t,” Bakugou seethed silently, the mere thought of having to take an  extra class causing his blood to boil. “Why would I have had any need to learn before now?”\n“Nobody really expects that their hearing is going to go bad, but considering your Quirk, you should have had some foresight,” Aizawa said, crossing his arms. Bakugou could only barely stand the asshole because his voice was flat enough that it didn’t sound like he was constantly patronizing him, unlike a certain few others. “We have language classes here.”\n“Like I fucking care.”\n“Which I strongly advise you to take.”\nThe thought of going to an extra lesson after class or during lunch made his ears burn. Bakugou didn’t want to admit that the newly-labeled handicap could prevent him from becoming a hero if he wasn’t careful--villains could be sneaky and silent if they wanted--but the thought of having to look for help made a sort of shame erupt in his stomach, full of flames.\nHe didn’t  need  extra lessons. He was going to be the  best. \n“I don’t want to,” he found himself saying, and stormed off to where Kirishima was still waiting for him.\nHe had somehow found himself with Camie’s phone number after meeting her at the remedial course, which he suspected was entirely her doing. If he was being honest, she was kind of fucking hilarious, if a bit annoying, but the annoying part was toned down when he only had to read her painful speech instead of hear it.\nAnd speaking of hearing, he made the mistake of mentioning the sign language shit to her, which lead to the following exchange:\nms.illusion: oshit thats lit fam\nms.illusion: not lit but ya know what i mean\nms.illusion: (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧\nexplodo kills: literally what the fuck it’s not fucking lit at all\nexplodo kills: i’m going deaf, asshole\nms.illusion: i mean the sign language part my dude\nms.illusion: im like, totes legit fluent\nexplodo kills: i will tolerate anything you say except ‘totes’ don’t ever say that again\nms.illusion: totes mcgoats\nms.illusion: (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧\nexplodo kills: i’m deleting your fucking number dumbass\nms.illusion: u say that every time tho and u never do\nms.illusion: oh well...if i must...i can always hit up todoroki instead\nms.illusion: winkety wonk wonk\nexplodo kills: WHY THE FUCK\nexplodo kills: WOULD YOU DO THAT\nms.illusion: （　´∀｀）☆\nexplodo kills: FINE\nms.illusion: so like lmao are u gon learn sign language\nms.illusion: if u need one i’ll be ur guide~~ we can finally meet up again broski\nexplodo kills: i'd rather die\nms.illusion: what if i made todoroki dance with his underwear on his head for u\nexplodo kills: i’ll CONSIDER but you’re on THIN FUCKING ICE\nms.illusion: lit\nHe was absolutely NOT considering it.\nNot even when after a Quirk exercise, his ears rung, and he missed half of Aizawa’s lesson. Not even when he felt the slightest surge of panic when he was left clueless on the assignment. Not even after a creeping feeling of humiliation crawled up his spine when Kirishima slid his own notes over, and he begrudgingly accepted them.\nNot even then, he’d never fucking consider it. Even if everybody bugged him about it until the world burned to the ground.\nOnly this time, Mic fucking attacked him. Out of nowhere.\nHe guessed the dumbfuck was going to visit Aizawa or what-fucking-ever, but instead had trapped him in the kitchen as he got a drink of water. Draining the entire bottle and watching the asshole out of the corner of his eye, he raised his eyebrows until he was sure they’d disappeared under his mess of bed hair, and Mic started speaking.\n“Hey, Bakugou! I know we don’t talk much, but Shouta--that is, Eraser--brought up that you’re having hearing problems!”\nHe clenched his fist, crumpling the water bottle in his hand, and hissed out, “Is that so.”\n“Yep!” Mic exclaimed, unaffected by his anger. “Thought you could use a helping hand myself.”\nHis eyes danced at his own pun, and Bakugou resisted the urge to throw the water bottle at his face with the force of his Quirk behind it.\n“So! Sign language, taught by yours truly.”\n“No fucking thanks.”\n“No, hey, sir! We’ve thought this through! You don’t need to go to classes, if you don’t want to. Just come find me! I’ll be in Eraser’s room a lot, so if you ever want to, just ask. And Eraser’s pretty fluent himself.”\nBakugou shoved past. “No fucking thanks.”\nPair-up exercise.\nBakugou was with Glasses, against Kaminari and Invisible Girl. Random match-ups, at the USJ despite the previous disaster.\nGlasses was incredibly loud, which was helpful. Not just his voice, but his Quirk. He forced himself to coordinate with his partner’s actions so he wouldn’t get a borderline failing grade like the last time he’d paired up with the tightass, and listened for the familiar whirring of gears that echoed around the area.\nThey almost had it in the bag. Along with their assigned opponents, the faux villains were stomping around and creating havoc. Of fucking course All Might had designed this exercise. It was a pain in the ass.\nOne of the faux villains tossed Glasses towards a different one, and Bakugou grit his teeth, readying an explosion once Invisible Girl got nearer. She was wearing her gloves and shoes as per the request of everybody else so they could better tell if she got hit or not, and he could see her sneakers dancing out of the corner of his eye.\nThe faux villains had all decided to advance on him, which, fucking great, meant extra explosions and extra punching and watching Kaminari gaze at him with fear and awe.\nOnly it kind of went sour.\nHe’d destroyed about five, when a sixth one grabbed at his leg and slammed him against the ground. He felt his left shoulder pull out of its socket, and bit back a shout. Raising his hands to explode the robotic grip away, his Quirk activated a bit too close to his head, and the searing ringing noise had returned.\nStaggering to his feet, he noted that Invisible Girl had been knocked aside somewhere, and he only needed to blast Kaminari away. But he noticed Glasses far off in the distance, mouth wide, as if he were yelling. His hands were moving erratically, and Bakugou could hear a faint noise that was most definitely the other’s voice.\nBut he couldn’t hear him. He wasn’t fucking shouting loud enough. Besides, with all the metal crashing from the faux villains falling to the ground due to his attack, he couldn’t...\nWait.\nThe metal crashing...and Glasses was clearly pointing behind him now.\nWhirling in his spot, the last thing Bakugou saw before blacking out was a large metal claw coming for his face.\n“You’re taking sign with Mic, whether you like it or not,” was what he was subjected to mere moments after he started speaking again.\n“Fuck off,” he said, voice coming out raspy.\n“I’m glad to see the concussion wasn’t severe.” Annoyance overcame Aizawa’s tone, but it wasn’t directed towards him, so he didn’t feel that much anger at the other. “Once again, All Might doesn’t know when to call a match off.”\nScratch that, he was actually angry.\n“Fuck off,” Bakugou repeated again. “I could have handled that much just fucking fine.”\n“Except you didn’t,” Aizawa said, and he was close enough that his voice, steady, could be clearly heard. “And you got badly hurt because you couldn’t understand your teammate, even though he was shrieking at the top of his lungs.”\nBakugou felt a burning sensation at the back of his neck, but tried arguing back anyways. “It was because of all the fucking  metal.”\n“Hagakure heard Iida just fine,” Aizawa countered calmly. “And she was much closer to the faux villains than you were.”\nThe burning arose to his cheeks, now. Curling his fists into his blanket, Bakugou squeezed his eyes shut, teeth gritting. He could usually admit his shortcomings, even if it physically pained him to do so, especially out loud. He’d done it once before, to Deku--when he realized that Ponytail Girl had been right, and that he couldn’t beat Todoroki in a fight. He’d admitted those things out loud, because they were true.\n“You need to learn sign. It’s going to help you in situations like these. Iida is fluent in sign language, and he could have warned you in better that the faux villain was behind you. It makes communication easier.”\nAnd that was probably fucking true, too.\n“Everybody knows fucking sign language, don’t they?” Bakugou mumbled out, sarcastically. Camie. Glasses. Aizawa. Mic. Because of fucking course they all did.\n“It’s actually highly common,” Aizawa sighed, sounding tired, and he leaned his arms against the side rail of Bakugou’s hospital bed.\nWhen Bakugou didn’t reply, he continued on.\n“Mic’s deaf. That’s why.”\nFor a moment, his eyes flickered over to catch sight of his teacher, just for a moment, and took in his appearance. His hair was drawn back in a ponytail, and he was in casual clothing. His expression was as flat as ever, but there was something in his eyes that sort of pissed him off, so he looked away.\nMic’s deaf.\nHe guessed that made sense.\n“Plenty of heroes have hearing problems. It’s an occupational hazard, what with screaming villains, heroes, and citizens alike. Crashing buildings. Bombs. Sirens.”\nIt was common then.\nNormally, he hated being lumped in with ‘common.’\nSomehow, this time though, it made him feel a bit better.\n“If you want to be number one, you have to overcome this, first.” Aizawa straightened up, before dropping a laminated folder into his lap. Bakugou picked it up, flipping through the pages, and to the curling of his lip he saw that it was page upon page of signs, mostly the alphabet, but a few simple words as well. “Mic’s outside. He’s going to be teaching you a set of words over the next two days. Memorize them.”\n“Fuck you,” Bakugou spat, not because he was really angry, but because he didn’t quite know how to respond at the moment. Aizawa smirked, and left him behind. Not even a second later, Mic was sliding inside, and Bakugou looked up to see him. He caught sight of the other’s hearing aids (how had he never noticed before?) and when he sat at the side of Bakugou’s bed, he gave a deep laugh.\n“I’ve only got an hour or so before Recovery Girl kicks me out, but you’re a quick learner.” Mic fixed him with a look. “Eraser gave you that? Great. That’s the alphabet. It’s a bit harder to sign just using the alphabet, but I’m going to be teaching you an assortment of words. It’ll come in handy, I promise.”\n“If you make another pun,” Bakugou found himself saying, tossing the folder aside. “I’ll blow the both of us to hell.”\nMic’s grin widened. “Is that a promise?”\nHis mother saw him the next day, just to make sure he hadn’t died yet. His father tagged along too.\n“Fuck off, you old hag.”\n“Don’t speak to your mother that way, brat!” She half-shouted. “We got told the whole situation! You got hurt because you couldn’t fucking hear your own teammate shouting at you!”\n“Fuck you! There were literal fucking robots crashing around everywhere!”\n“Since when has that been a problem, Katsuki?!”\n“Let’s all calm down,” his father said, and he hated that his father’s voice was louder than usual. Still calm, still somewhat soft, but louder. And he knew it was for him. “Is the school doing anything for you, Katsuki? Can’t Recovery Girl heal your eardrums?”\n\"She can't, for some fucking reason,\" Bakugou growled. He watched his mother turn to his father, bringing up some argument they must have had about the subject along the way.\nHe wondered if he should tell them about the sign language classes he was being forced to take. He wondered if he should tell them that occasionally his hearing went out of wack, and he was suddenly hearing everything warbled, as if he were underwater. He wondered.\nHe suddenly remembered Mic, and then what Aizawa had said. And he found the words forcing themselves out of his throat, entirely unplanned, but his parents listened, his mother surprisingly silent, and at the end of it, they said they’d save up the money for it.\n He heard Mic’s class just fine, because Mic screamed everything. Cementoss’s class was hell, because the man spoke quietly, even when he actively tried to speak louder. Deku tapped his shoulder and offered his notes, which he ignored because it was fucking Deku, but after class Kirishima silently passed him his notebook, which he appreciated, even if all he said was “Fuck you.”\nDuring Aizawa’s lesson, he had a little more hope for being able to hear what he was saying. He could be loud if he wanted, at least.\nIt took Bakugou five seconds to realize what the fuck was happening.\nAizawa was speaking, and his voice was fairly clear, but still a bit hard for Bakugou to hear. His hands, however, were moving fluidly as he talked, using signs he  unfortunately  recognized as the ones Mic had been drilling into his head for the past two days. He really fucking hated that he learned easily, and was able to understand almost everything being signed in his direction. Out of the corner of his eye he saw Kaminari whispering to Kirishima, but he ignored them, focusing his attention on Aizawa’s movements.\nHe managed to get down most of the lesson, except for a brief moment where Aizawa’s signing had suddenly gotten a little faster, a little sloppy, as someone sneezed, and his attention was distracted. Just in case the information was important, he stalked up to his teacher’s desk and grumbled a question, asking what he had been saying during that moment. Aizawa told him, close enough that he didn’t need to sign, and Bakugou walked out to join Kirishima, Mina, Kaminari, and Sero, who were all waiting for him.\nHe didn’t feel as shitty as he thought he would.\n ms.illusion: so hows the sign language classes going fam\nexplodo kills: why would i tell you\nms.illusion: ill teach u how to swear in sign language\nexplodo kills: are you currently available\nms.illusion: is this a date\nexplodo kills: no but if you can teach me how to tell mic to shut the fuck up i’ll consider calling you a dumbass less than i normally do\nms.illusion: a fair trade\nQuirk exercise again, this time during Midnight’s class, for whatever fucking reason she’d cooked up. The art of iconic poses, or whatever. It’d been dumb. He’d purposely tuned her out.\nHe was paired up with Sero this time, and they were placed at a great distance from one another. He watched Midnight’s whip slice through the air, and knew the match had begun. They were against Tentacle Arms and Uraraka, and a brief battle ensued. He bested Tentacle Arms easily, but Uraraka managed to float out of his way in the nick of time. Fucking damn it.\nAcross the field, he eyed Sero, who had been pretty useless. They could use his tape to pull Uraraka down, though.\nSuddenly, though, Sero’s hands did something weird. It took a while for him to get his point across, but when he did, Bakugou hated that he realized it as an actually half-decent plan and followed through with it. When they won the match, he stomped over to where Sero was unsticking his tape from Uraraka’s gear.\n“What,” Bakugou spat out, eyes narrowing, “The fuck was that.”\nBecause Sero had literally said a week ago he didn’t know a lick of sign language.\nSero shrugged in response. “I mean, the plan worked, didn’t it?”\n“No, not that.” Bakugou waved his hand around aggressively, and Sero nodded in understanding.\n“Oh, that? Yeah, Aizawa-sensei’s been teaching us sign language.”\nBakugou felt his heart shudder for a moment, anger roaring in his ears as he thought of the whole class having to learn a language at his expense, because the fucking thought that everybody was required to learn a whole new language just so he wasn’t a fucking useless partner made him want to flip some shit.\n“Well,” Bakugou spat out, “You tell that fucking asshole he doesn’t need to give everyone lessons so they can annoy me in a different language.”\n“‘Everyone?’ Nah, dude,” Sero said, unfortunately very perceptive of what made Bakugou angry. “Just the gang.”\nThe fury went away. Just a little. “You mean..?”\n“Kirishima, Kaminari, Mina, me. Oh, and Todoroki, because he asked, but that’s about it.”\nLater on, Bakugou flipped Aizawa off. Aizawa signed something back at him, one that he only knew because Camie had taught him, and Bakugou ground his teeth together as he used a more colorful sign back at him. He then stomped off to his room, because what fucking ever. He wasn’t going to waste his time with that fucking garbage can.\n Maybe though, when their eyes met the next day, after Mic had finished drilling another set of signs into his head, he signed towards his homeroom teacher. And maybe it was a sign that wasn’t filled with as much silent venom as he could manage.\n“Dude.”\n“Shut up.”\n“Okay, normally, I would, but dude.”\nHe smacked Kirishima’s hand out of the way. “It’s not a big deal. Make it a big deal and I’ll blow them up and have you pay for them.”\nKirishima smiled and laughed, which he fucking hated (not) and then Kirishima signed an inside joke towards him that he did not get because it was fucking stupid (he very much did get it).\nEvery time someone tried mentioning them, he sent the person a glare, and thankfully, they shut up. The day went by normally. Thanks to his hearing aids, he heard some things a bit better than before--he at least got half of Cementoss’s lesson. And what he didn’t hear in Aizawa’s, he understood through his signs.\nWhen he went to bed, he passed by Aizawa, who eyed his hearing aids, and grinned. Bakugou flipped him off again. To his shock, Aizawa returned the gesture, but it quickly disappeared, and his teacher's eyes widened, as if realizing he’d accidentally done something he hadn’t meant to do. But when Bakugou recovered from his own initial shock, he burst into fucking laughter, which continued all the way to his dormroom, earning him wary stares from Birdbrain and Frogface.\nMaybe he didn’t fucking hate Aizawa all that much.\n“Get up.”\n“Hold on,” Shinsou grunted, picking his head up from the dirt a few inches before dropping it back down. “I’m pretty sure you just actually killed me.”\n“I didn’t hit that hard,” Aizawa scoffed, but he knelt down beside the other anyways and checked his head. When no visible bumps or bruises could be seen, he went to lower his student’s head back down--only to find a hand on his wrist, and another flying up to grasp somewhere around his back. The next thing he knew, he was being flipped over, and Shinsou was scrambling out from beneath him, successfully pinning him to the ground by forcing his knee onto Aizawa’s chest.\n“Ow,” Aizawa said flatly. “That was dirty.”\n“What’s it that you always say? There are no fair fights?” Shinsou cocked his head to the side, the slightest trace of a smirk crossing his face. “Don’t tell me you need to be reminded?”\n“Cheeky brat.”\n“Old man.”\n“I’m  thirty.” Aizawa-sensei sat up abruptly, causing Shinsou to stumble backwards and land on his side. “You should focus more of your weight on your opponent, so  that doesn’t happen.”\n“Okay,” Shinsou sighed, pushing himself onto his feet. “I’ve got it.”\nThey stood in silence for a while, catching their breaths. Shinsou was covered in dirt, dust, and whatever else mother nature had decided to throw upon him. His hair was almost lying flat on his head due to how much he was sweating, and he was pretty sure there was dirt in places that there shouldn’t be dirt.\nTraining with Aizawa was a daily occurence, now. He was pushed to his limits every day, and though his training was a bit harsh in some places, Aizawa-sensei was very good at offering advice, and he sort of needed some right now.\nThere was a question nagging at the back of his mind, one he hadn’t really thought about that much. He’d been so overjoyed to find out he’d be training with Aizawa, so overjoyed to find out he’d be moving out of his house and into the dorms, that he’d never really stopped to  think. \nAnd, well, there was no point in keeping silent, because Aizawa always seemed to know if there was something bothering him, so he asked the question--\n“Do you really think I’ve got a chance at being a hero?”\nAizawa’s gaze flitted towards him, but he pressed onward:\n“I mean, do you really think I’ll make it? What if in the end, I’m still weak? What if in the end, nobody accepts me as a hero because of my Quirk?”\nYes, he’d been training. He’d been learning to kick and punch properly, all the while getting his ass handed to him. He’d practiced his Quirk under Aizawa’s supervision, and he’d even tried thinking up of his own weapon to use, much like Aizawa had his. But what if it wasn’t good enough for the hero course? What if he needed that extra boost that he didn’t have the Quirk to provide him with?\nShinsou ran his hand through his hair, trying to shake out the sweat and the dust, keeping his gaze on the ground as he waited for Aizawa to say something. Anything, really.\nThe anxiety in his stomach that had been brewing over the school year was starting to manifest itself again as he waited for his teacher to speak.\n“I  made it.”\nThere it was.\n“My Quirk doesn’t enhance my physical abilities. It doesn’t prevent me from getting hurt, it doesn’t make me stronger, it doesn’t make me predict my enemy’s movements, it doesn’t make my enemy do what I want.” Aizawa’s voice was steady as he spoke, and Shinsou felt calm enough to glance up at his face and make eye contact. “Against about half the world, I’m essentially Quirkless. And against people who are just as strong or stronger than me, erasing their Quirk only really delays my own death.”\n“Wow,” Shinsou said, fighting to keep both his voice and expression deadpan. “We’re getting serious, aren’t we.”\n“Shut up. Like I was saying, despite all that, I’ve made it, because I tried. I did my best, because all I’ve ever wanted to be was a hero.” Aizawa hesitated, before placing his hand on Shinsou’s back in a gesture of comfort. “You have a great resolve, whether it be out of spite or a genuine desire to do good or a mixture of both. You have a resolve to become the best hero, and that’s going to drive you forward into becoming one.”\nThere was a long silence as Shinsou thought his words over. Sure, Aizawa had told him before that he had a strong will, and that his desire to become a hero was good, but never quite like this. And hearing Aizawa, the hero he’d idolized for so long, tell him of his own experiences, of how his Quirk only helped so much, made him feel better.\nA lot better, knowing that despite all this, Aizawa was still a great hero.\n“Well,” Shinsou said, voice flat. “Thanks for the speech. It was really what I was looking for.”\nAizawa glared at him tiredly. “Why can’t you be like Midoriya, and not be a smartass.”\nShinsou grinned. “Well, All Might is practically unreachable. You’re  here.”\n“I suppose that’s a good thing, then?”\nHe thought about how much he wanted to be a hero. He thought about how much he idolized this underground hero from the moment he discovered who he was. And he thought about how grateful he was to the fact that he was able to meet, talk, and train with Aizawa every day.\n“I guess,” is what he said out loud, before readying himself into a fighting stance. “Come on, let’s go again.”\n“No,” Aizawa said, turning his back to him. “Go to bed. You’ve got classes tomorrow. No use falling asleep in them--it’d lower your grades.”\n\n And my chances of getting into the Hero Course. \n\nSo Shinsou sighed, and turned to walk towards 1-C’s dorm, but before he could leave, Aizawa said,\n“Good job, by the way. You’ve improved.”\nShinsou wished he had a scarf to duck his face into, like Aizawa did. Maybe he should consider investing in one.\nTodoroki was almost completely sure that the kid from General Studies was Aizawa’s secret lovechild, just like he was sure Midoriya was All Might’s.  Almost being the key word. He had taken into account his teacher’s age (30) and Shinsou’s (16), and had decided that it probably wasn’t possible that they were father and son, which had cropped up various other theories that he spent a rather embarrassing amount of time on. He hesitated to call them brothers, a little too unsure due to the large age gap, until he found out Iida’s older brother was the same age as Aizawa.\nSo now Todoroki was completely sure they were brothers. Proof? They looked alike, had psychological Quirks, and liked cats.\nUnfortunately, everybody else found his theory hilarious, and didn’t take it seriously.\n“I mean, I get where you’re coming from?” Midoriya said sheepishly, scratching at the back of his neck. “..Sorta?”\n“They look kind of similar and they’re always tired, but that’s just coincidence, probably,” Yaoyorozu said, patting his shoulder as if attempting to reassure him.\n“That is the dumbest shit I’ve ever heard,” Bakugou said from where he was playing his DS. “And I listen to Kaminari talk every single day.”\n“I don’t want to hear that from a guy who’s playing Animal Crossing,” Todoroki said. Bakugou launched his DS across the room, directly at Todoroki’s face. Thankfully for them both, Todoroki caught it.\n“I’m totally behind this theory,” Uraraka told him later, being the only person who thought it plausible. She gave him a big thumbs-up, which he appreciated.\n“Thanks,” he said back.\nIt wasn’t just the appearances part--it was also the fact that Aizawa was not-so-secretly training Shinsou. Occasionally a few of the class reported seeing them sparring outside late at night or early in the morning, and everyone began betting on how long it’d take Aizawa to expel Mineta once and for all so he could replace him with Shinsou.\nTodoroki couldn’t really see a reason why Aizawa would just train Shinsou for no random reason. Why had Shinsou stuck out, out of all the gen-ed kids? Sure, he’d made it decently far in the tournament, but there were almost a hundred other gen-ed students he could have trained instead--and if it was about who made it far into the tournament and had a chance, why wasn’t he training the Hatsume girl, too?\n(Iida debunked that, and said that Hatsume wasn’t interested in becoming an actual hero. So now it was truly ambiguous whether Aizawa was just training Shinsou due to personal connection or how far he got into the tournament.)\nSo, tired of just coming up with theory after theory, he decided to ask his teacher.\nAizawa-sensei’s room wasn’t as bare as he had thought it would be, but in hindsight, that was probably Mic’s doing. There were pictures decorating the walls and a few more scattered here and there throughout it. Some silly cat-related things were present too, though Todoroki actually couldn’t tell if they were Aizawa’s fault or Mic’s. He was leaning towards Mic, though, because there was an inspirational cat poster tacked to the wall.\nThe teachers’ rooms were a bit bigger than the student’s, almost like a little apartment rather than just a simple room, and he was currently sitting on Aizawa’s squashy couch petting Jellybean, trying not to look at what Aizawa was grading.\nThe first time he’d come around to pet the cat, he’d left almost instantly, feeling awkward, but the second time was much better. Aizawa hardly ever initiated a conversation, content on doing paperwork or reading a book or playing with the cat alongside him. It was pretty relaxing, actually.\nSo relaxing, in fact, that he felt no fear asking,\n“Are you and Shinsou brothers?”\nAizawa’s gaze snapped towards him, intense enough to make Todoroki startle in his seat a bit. Nevermind. One fear.\n“No,” Aizawa answered, voice still flat despite the look he was giving him. “We’re not related in any way, if that’s what you’re asking.”\n“Of course. Sorry,” Todoroki apologized, and returned to petting Jellybean silently, who had rolled onto his back, purring.\nOnly that was exactly the kind of thing Aizawa would say if they  were related, and he just didn’t want people to know, right?\n“Todoroki,” Midoriya said when Todoroki told him this. “I think you’re thinking about it too hard.”\nTodoroki gave up. Outwardly, at least. The only thing preventing him from creating a bulletin board mapping all the evidence was the fact that one, Iida would probably confiscate it immediately, and two, he wasn’t sure how his teacher would react if he discovered it.\nSeveral students in class 1-A had terrible, terrible habits:\nMina showered with the curtain open and got the floor wet.\nOjirou took off his shoes before entering his room, which had lead to several people accidentally tripping over them.\nJirou never did dishes, and left hers behind for other people to do.\nTodoroki left all the lights on, including the TV, even if it was late at night and nobody was watching.\nHagakure and Bakugou both drank milk straight from the carton.\nAnd  somebody,  they didn’t know who, kept leaving the door that lead to the other department’s dorms unlocked, which was precisely how Shinsou kept getting in.\nAt some point, they gave up on trying to kick him out. They weren’t sure when that point was, though. Perhaps it had been when Shinsou fell asleep on the couch, nestled comfortably with a Pusheen cat blanket. Or perhaps it had been when Shinsou sat down to play Monopoly with Mina, Sero, Tsuyu, and Iida, and said,\n“I want to be the bicycle.”\nOr maybe it was when Bakugou was trying to shove Shinsou out the door, and Aizawa had entered the common room, growing irritated with the noise, and instead of kicking Shinsou out or helping Bakugou lock him outside, he looked them both in the eyes and asked if they wanted tea.\n(That lead to the worst ten minutes of Bakugou’s life, where he was forced to drink scalding tea with that purple-haired asshole, and knew if he left, Mic would force him to learn an extra twenty signs, and they’d be completely useless, but he’d memorize them all anyways.)\nSo 1-A officially left Shinsou alone, and started treating him like another dorm mate, which also meant reprimanding him for his terrible habits, which included, but were not limited to:\nUnplugging other people’s phones to charge his own, laying on the couch with his shoes on, leaving half-unfinished drinks on the counter or in the dining area, and eating cereal straight out of the box. He never poured it into a bowl. He just took out handfuls and ate it. It drove Iida crazy.\nBut they could live with it. They lived with Bakugou, after all.\nShinsou was kind of prickly, but participated in games and stuff with them if he felt like it. Which was how, on movie night, they managed to drag Aizawa-sensei out into the common room with them after briefly mentioning that Shinsou was there too.\n“Let’s watch Big Hero 6!”  Sero suggested, holding up said movie.\n“I’m in more of a  Titanic  mood,” Shouji said.\n“Dude. No.”\n“What about  The Avengers?” Somebody called out.\n“Battle Royale?”\n“Princess Mononoke!”\n“Let’s watch a horror movie,” was what Tokoyami said, and everybody stared at him. He cracked one eye open, bristling, before tacking on, “We haven’t watched a horror movie together before. And if I have to watch  Princess Mononoke  one more time, I will scream. Endlessly.”\nSo, after that, it became a question of which horror movie to watch. They tried asking Aizawa-sensei for his input, hoping he would put an end to the arguments by just deciding for them, but he didn’t care, so the arguments just kept going on for another ten minutes.\nIn the end, it became a vote of who had seen which movie. They all chose the movie that the least amount of people had seen, a relatively recent film boasting great horrors, and slid the DVD into the movie player.\n“We’ve got popcorn, right?” Satou whispered.\n“Of course, mon ami!” Aoyama cried out.\n “Yours has glitter in it, Aoyama!”\n“It’s edible glitter!”\n“What about drinks?”\n“I’ve got ‘em!” Hagakure shouted gleefully, a floating stack of water bottles coming into sight.\n“Oh, sweet, thanks!”\n“Can we skip the credits?”\n“Can we turn on the subtitles for Bakugou?”\n“Hell no.”\nThe talking died down when the title screen came on. After telling them countless times he didn’t need the subtitles, they just turned the volume up extremely loud so Bakugou could hear properly--loud enough that Jirou had to scoot back a bit so she wasn’t sitting so close to the speakers.\n“Do you like horror movies?” Shinsou asked his teacher as the opening credits started. Aizawa, who had been squished onto the edge of the couch, shrugged.\n“I don’t care for movies in general,” he murmured. Shinsou nodded, before turning back to face the TV screen.\nSure, he’d been training with his childhood hero for months, but this was the first time he’d sort of just hung out with him, doing something normal. In general, this was the first time in a long while he  had  done something normal like watch a movie--it wasn’t like his family was exactly the spending-time-together type, so this felt kind of nice.\nAbout twenty minutes into the movie, nothing exciting had really happened. Every time someone tried speaking, both Bakugou and Mina shushed them violently. Shinsou was actually pretty bored, and kept glancing towards the others to see how they were doing.\nThirty minutes into the movie, the first jumpscare happened, and Shinsou felt the couch jolt as it did. He glanced to the side to see that Todoroki had half-scootched into Kouda’s lap, eyes wide and staring hard at the TV. Beneath his feet, Uraraka had jolted too, but only slightly. Enough for him to notice though.\nThe continuous jumpscares meant more of the couch shaking every time someone got scared, and he had to stifle his laughter every time it happened.\nOnscreen, the protagonist got locked inside the gigantic murder house, which, surprise surprise, was full of murderers. Wonderful. Excellent. Brilliant script-writing right there. Bored, Shinsou leaned a bit to the side, feeling tired, and kept an eye on everybody else to see who would jump next.\nThe door on the TV screen flew open, sending the oddly-shaped doorknob into one of the protagonists’ stomach, successfully impaling him. The couch jolted a little, but he hadn’t seen anybody visibly jump. Frowning, Shinsou glanced down at the foot of the couch to see if anyone leaning against it had moved. Nobody had.\nIncredulously, he looked to his right. Aizawa was pressed against the arm of the couch, staring at the TV screen with eyes widened by a fraction, arms crossed, though Shinsou could see that his fingers were white and digging into his biceps.\n\n Holy shit. \n\nShinsou turned his head towards the TV, but kept his eyes trained on Aizawa, wondering if his suspicions were true. Out of the corner of his eye, Yaoyorozu and Midoriya both clung onto Iida, scared out of their wits. A loud  bang!  sounded from the movie, and he saw it--Aizawa-sensei jumped, eyes getting wider, before his expression smoothed over, trying to act as if he  wasn’t  scared.\nShinsou just couldn’t keep it to himself.\n“Are you really getting scared?”\nHis whisper garnered the attention of those sitting around him, despite Bakugou growling, “Shut up and watch the movie.\"\n“Bakugou,” came Kirishima’s voice, “Can you let go of my ha--”\n“No!”\n“Sensei?” Midoriya blinked, eyes flickering between Shinsou and Aizawa, confused. “Are you saying sensei is scared?”\nAizawa didn’t say anything, eyes locked onto the TV in an attempt to ignore them, which ended up being a mistake on his part, because when the next jumpscare happened he startled silently, shoulders hunching, which got a laugh from both Shinsou and Uraraka.\n“Don’t be scared, sensei!” Hagakure whisper-shouted from where she was clinging onto Ojirou. “You just need someone to hold onto! That makes scary movies much less...well, scary!”\nShinsou was still laughing, even though it had been a while since the jumpscare happened.\nHis childhood idol, the underground hero Eraserhead, who dealt with nasty things like crime rings and drug dealing, who went against the League of Villains at least three times, was scared of a horror movie.  A horror movie. \nIt felt nice, somehow. Proof that Aizawa Shouta, his teacher, was a human being.\n“I’m leaving,” Aizawa-sensei grunted, sounding annoyed, and instantly everyone protested, begging him to stay, because the presence of an adult during a horror movie was somehow extremely comforting.\n“Sensei! Please stay!”\n“It’s less scary if you’re in here!”\n“We’re sorry, we won’t make fun of you!  Everybody’s  scared!”\nAizawa glared at them all, half-risen from the couch. He hated this year’s class. He wasn’t going to admit he got scared by movies easily (a fact Hizashi had been delighted to learn) and he didn’t want to stay and watch the rest of it. But the rest of the class looked positively terrified, whether it actually be genuine or not, and he felt his resolve crumbling as they begged him to stay due to their fear.\n\n No, I won’t stay. I absolutely will not. \n\n“Sensei, please, it’s not as scary if an adult’s here...”\n“I can’t watch horror movies without my parents in the room, please, sensei!”\n\n I will not. Absolutely not. They can handle it themselves. \n\n“Aizawa-sensei,  it’s so scary! I know you wouldn’t leave us alone when we’re so afraid like this!”\n“Fine,” he growled out, and plopped back down on the couch, sinking low in his seat and crossing his arms. These damn emotionally manipulative-- \nAnother jumpscare, and his fingernails dug further into his arm. Great.\nShinsou counted how many times Aizawa-sensei jumped or otherwise got scared during the rest of the movie. It amounted to seven, which wasn’t that bad, considering there was a remaining total of twelve jumpscares. He himself were scared by the first few, but afterwards they just got kind of repetitive. Everybody else seemed to find them terrifying, though.\n“Bakubro,” he heard Kaminari whisper. “Let me hug you. Please.”\n“Toughen up, Pikachu.”\n“Hypocrite! You’re still holding Kirishima’s hand!”\nTo get him to shut up, Bakugou wrapped his arm around Kaminari’s neck and pulled him close into what could almost count as a chokehold, only Kaminari wasn’t struggling, so it was probably just a very Bakugou-esque hug.\nTsuyu seemed to be the only one not outwardly terrified, but she occasionally let out small and nervous-sounding ‘ribbits.’\nTokoyami had fallen asleep.\nBy the time the movie was over, there was a mad scramble to turn the lights on, and everyone got to their feet, yawning and stretching. But there was a lingering feeling of paranoia, and Midoriya uttered something about going to check to make sure if all the doors were locked and hurried away, Uraraka and Todoroki in tow as his ‘backup.’\n“You jumped at least ten times,” Shinsou told Aizawa as the man stretched. His teacher glared, but said nothing to him, his attention being caught by Aoyama, who was tugging at his sleeve and whispering nervously.\nAside from Midoriya and his friends going to make sure all the doors and windows were locked, nobody had wandered from the common room yet, everyone chattering rather nervously and never straying all that far.\n“Shinsou, are you going back to your dorm?”\n“Yeah,” Shinsou answered, cracking his knuckles and relishing in the satisfying feeling it gave him. “I’ve got to.”\n“But...” He could almost see Hagakure’s invisible nervous expression. “What if...someone’s out there?”\nShinsou blinked. “Nobody’s out there.”\n“Anybody could be out there!”\n“Don’t go, Shinsou!” Kaminari joined in, still locked tight under Bakugou’s arm. “You could die!”\nThe corners of his lips twitched upwards. “I’ll be fine.”\nShinsou left, passing by Midoriya and his group as he did so, waving them a goodbye. They locked the door behind him, and he went back to his dorm.\nTodoroki squinted at the back of Shinsou’s head through the window, watching him go away. Turning to Uraraka, he nodded and said,\n“They’re definitely related. They walk the same.”\nShe snapped her fingers. “Aha!”\nMidoriya buried his face in his hands, but he’d long since given up telling them to quit coming up with conspiracy theories.\nReturning to the common room, they saw nobody had left yet, including Iida, which was a relief, because Iida was the designated Tall Friend Who They Could Hide Behind When The Monsters Came. Sero was currently pressing up against Iida’s back, whispering feverently,\n“Look, class prez, you gotta take one for the team. You gotta be our shield. It’s a responsibility.”\n“While I am glad to take on any responsibility, I think this is a bit much, is it not?!” Iida cried out.\n“What’s going on?” Midoriya asked curiously, and a few people turned to face him.\n“Everybody wants to sleep out here,” Shouji said quietly, and when Midoriya cocked an eyebrow, he added, “Because they’re all scared.”\n“Don’t make it sound like you aren’t terrified either, Shouji!” Satou accused, pointing a finger at the other aggressively.\n“You can all sleep out here if you want,” Aizawa grumbled, low voice commanding silence from everyone else. “I’m going to bed. Clean u--”\n“You can’t go to bed!”\n“No, sensei, you have to stay out here with us!”\n“Who’s going to save us from the bad guys?”\n“Aizawa, pleeeeeeeaaaassse!”\nAizawa, arms crossed, stared at the rest of them, eyebrows raised. When their shouts and protests died down, he tiredly dragged a hand down his face, and mumbled,\n“You’re high schoolers. You can’t get scared by a horror movie like this.”\n“Uh, sensei,” Kirishima spoke up. “Didn’t you get scared?”\n“Not scared enough to want to sleep ou--” Aizawa began, but a deafening roar caused him and everybody else to jump violently.\n“Sorry,” Tokoyami said, voice groggy. “That was Dark Shadow. He snores.”\n“I dunno, sensei, looked like you were pretty scared to me,” Jirou said, and when his glare turned on her she glanced away, whistling innocently. The entire class engaged in a staring match with their teacher. Half of them thought he was kind enough to stay out with them due to their terror, and the other half thought he was too cold and gruff to do such a thing.\nWhen their stares didn’t relent, his shoulders sagged, and his entire person just seemed to grow more tired.\n“Fine,” he sighed. “Only because I’m not going to be able to get any sleep if you stay up all night.”\nThey cheered in relief.\nEverybody scattered into their own rooms to gather pillows and blankets, traveling in groups so nobody was ever alone. Even Bakugou wouldn’t go anywhere without letting go of Kirishima and Kaminari, Sero and Mina flanking his sides as well. Todoroki, Midoriya, Uraraka, and Tsuyu all pressed up close to Iida’s back in a terrified conga line. A few students were content with just laying on the floor or couches without any pillows or blankets--namely Kouda, Ojirou, and Hagakure.\nAizawa laid across the couch, and when Aoyama returned with a stack of pillows and looked like he was about to ask him to get off, Aizawa gave him a glare and said,\n“You guys asked me to stay out here, I get to be on the couch.”\n“A fair trade,” Aoyama said dejectedly.\nOnce everybody got situated in a huge pile of blankets, comforters, pillows, and stuffed animals, the lights went out, and everybody stayed deathly silent. Aizawa was silent too, for about ten minutes, until he got up and stepped around them, nudging a few students with his foot and giving quiet orders.\n“Satou, turn over, or you’re going to crush Asui in your sleep. Bakugou, take out your hearing aids. Ashido, don’t hog all the blankets, give some to Midoriya.”\nIt took about four hours for everybody to fall asleep. A few whispered to Aizawa throughout the night, asking if he was still awake, if he wanted to join them in their protective cuddle pile, if there was a chance villains would invade. To some of the sillier questions he responded in his usual manner, but to the questions like the one regarding the villain invasion his voice almost got soft, like he was trying to comfort them.\nThe night stretched on. Everybody tried to fall asleep so they could wake up to the bright morning sun, but some had more difficulty than others. The very last to close her eyes was Yaoyorozu, and she was half-sure she saw a blond-haired figure approach the couch Aizawa was sleeping on and throw a blanket over him. Probably Mic-sensei.\nIn the morning, the first to wake was Ojirou, who always got up rather early to meditate, He slid his tail out from beneath Hagakure and staggered to his feet, gazing at everybody else. Bakugou was half on top of Iida, foot very close to Midoriya’s face. Tsuyu had created a cocoon of blankets. Uraraka was floating. Tokoyami was upside down. And Aizawa-sensei had fallen asleep sitting up, probably to watch over them.\nThey all felt safe.\nIt started off as an accident.\nMidoriya and Todoroki had been asking him for something, but what, he didn’t remember now--probably school-related. They had approached him, about to ask him something, when the following words fell out of Midoriya’s mouth:\n“Hey, dad?”\nHe froze. Midoriya froze. Everybody froze. He wasn’t entirely sure Todoroki wasn’t using his right side to create that effect, but it was what was happening. The previously busy and bustling room had come to a halt as everybody stared, wide-eyed, at the freckled kid with varying degrees of shock and amusement on their faces.\nAizawa had been called lots of things before, whether accidental or not, but he’d never been called ‘dad.’\nMidoriya’s face was red, and Aizawa knew that if he thought about it even more, his face would turn red as well. It was just so weird, so unexpected, but also, strangely warm. It kind of felt nice, because it implied that the problem child trusted and maybe even looked up to him. That felt nicer than he thought it would.\nHis face was not red, not yet. Not until Todoroki, in an attempt to lessen Midoriya’s crippling embarrassment, stared him right in the eyes and said in a total deadpan,\n“Father.”\nAizawa left right then and there, burying his face in his scarf.\nFrom then on, it continued, almost like a joke, but some seemed genuine with it. Ashido and Kaminari called him ‘dad’ every other sentence, Iida called him ‘Mr. Father’ once and then cried. Even Bakugou had accidentally called him dad, though not in front of him. At least, if he trusted what Mic said, Bakugou had apparently accidentally referred to him as ‘dad’ when being taught new signs for the next lesson, and had proceeded to explode and leave the room in a fit of rage.\nIt soon got out of hand, however, as they began calling him different variations of ‘dad’ during school, and he threatened to expel them all if they continued doing so. From then on, intentional uses of the word lessened, though there were still a few slip-ups.\nSighing as he thought about it all,  Aizawa leaned against the wall, waiting for his trainee to show up. He only cracked open his eyes when he heard him approaching, and was met with the blank expression of Shinsou Hitoshi.\nSilence.\nThen,\n“Hey dad.”\n“I’m going to expel you.”\nAizawa Shouta was, unfortunately, a pro hero. The ‘unfortunately’ part was there because Aizawa Shouta was also a man who loved sleep, and sometimes it was hard to sleep when your shoulder was dislocated and your head felt like it was going to burst.\nToo many times he’d sat down on the common room couch when he got back from patrol, only to fall asleep. Thankfully, he usually woke up on his own before everybody else, or when Ojirou, who was an early riser, tapped him on the shoulder. They’d come to a silent agreement to never mention it, even though Aizawa was pretty sure all the students were aware of it anyways.\nUnfortunately, this time, he slept a bit longer than usual, and Ojirou (who, if he was being honest with himself, he was kind of relying on to wake him) hadn’t gone out into the common room, or whatever, so he had kept sleeping. Waking up honestly felt kind of painful, a striking electric current starting in his brain that left his head aching, eyes screwing up even though they were shut. There weren’t any windows in the common room, but he could tell it was must be early afternoon.\nAt least it was Sunday.\nHis back hurt. A lot. Not his back itself--no, he wasn’t quite that old yet--but several long and shallow cuts ran down its length, which burned. He hadn’t gotten them last night--rather, a few nights ago, and he’d had to throw that suit away. What he did get last night, though, was a bruise blooming across the bridge of his nose and a split lip. Embarrassingly, he’d underestimated a street punk with a seemingly non-threatening Quirk of  Calligraphy, which was why the words ‘FUCK OFF' were currently engraved into his forearm.\nHe just wanted to keep sleeping forever, but knew he’d have to go see Recovery Girl. At least he wasn’t bone-tired, and could at least get enough healing to seal up the words on his arm.\nWhen Aizawa pulled himself out of his thoughts, however, he became hyperaware of several unusual things--\nFirst, there was a blanket thrown over him, which couldn’t have been Mic’s doing, because Mic had gone to host his radio show and had told him that he’d be sleeping at their apartment because he didn’t want to walk all the way back to Yuuei.\nSecond, there was also a pillow tucked beneath his head, which he did not remember doing. In fact, he was pretty sure he’d laid down on the couch and instantly passed out, leaving no timeframe for him to have gone to his own room and grabbed his pillow, and what would even be the point of that? If he’d gone to his room to grab his pillow, why didn’t he just sleep on his bed, or on his own couch?\nThird, there were definitely voices whispering around him.\nAizawa knew his students. He knew that yes, there were quiet and polite ones amongst their numbers, and also knew that at least half the class wouldn’t wake him up if he was sleeping.\nHe also knew that the loud, rambunctious students outnumbered the quiet ones, and the other half of the class that would have woken him up should have done so by now.\nThis, coupled with the unusual presence of a pillow and blanket, made him wonder if he was really in the common room. Maybe he’d fallen asleep somewhere else. Or maybe he’d been kidnapped again. How troublesome.\nBut he didn’t feel an immediate sense of danger. In fact, he felt mostly relaxed, like he could drift off peacefully again. There was almost a comforting air surrounding him, and he didn’t want to ruin it, but he had to see what was going on.\nSo, shifting slightly so his legs were in a more comfortable position, arching his back so it wasn’t cramping as much, Aizawa’s eyes peeled open, where he caught a glimpse of Todoroki sitting on the ground in front of him before they fluttered shut again. He brought up a fist to rub at them, before blinking them open again, a groan escaping his lips.\nAs his vision cleared up, he took note of several things--\nTodoroki was in front of him, on the ground, though he was petting Jellybean and not paying his teacher the slightest bit of attention.\nAsui, Ashido, Yaoyorozu, Iida, Kouda, and Tokoyami were all playing a silent game of Uno. Asui’s hair was in a braid, which he had vague recollection of doing for her when she asked yesterday. Midoriya was sitting behind Todoroki, leaning against his friend’s back as he flipped through his notebook.\nIf he listened closely, he could hear voices from the kitchen and dining area--muffled though they were, he was pretty sure Bakugou and Kirishima were arm-wrestling again, if the grunts and quiet whoops of victory were anything to go by. Someone must be cooking breakfast, too, because something good was smelling, and when his stomach gave a pitiful growl he winced.\n“Oh,” somebody said, and he glanced back towards the group playing Uno. It was Yaoyorozu who had spoken. “So you’re awake now, sensei!”\n“Why didn’t anybody get me up?” He asked tiredly, sitting up slowly and shaking his hair out of his face. He looked down at his arms and realized he had rolled up his sleeves last night to look at the damage, which meant the carved words on his skin were visible to everyone. Midoriya, who had been glancing over, gave a little gasp.\n“What happened there?”\n“Calligraphy Quirk,” Aizawa said, prodding the lines with a finger and noting how much it stung. The scars were tinged a strange black color, almost like an actual pen had carved itself into his flesh, and he winced. He probably should have gotten it healed the moment he came back, but he’d just been too tired. “I’m going to Recovery Girl’s.”\nGetting to his feet, he stretched, feeling several of his joints pop and crack as he did so. He eyed his students suspiciously as he left, wondering why nobody had woken him. It was extremely unusual. Maybe they’d finally decided he needed a break.\nHa, as if.\nRecovery Girl healed most of his injuries, the carved characters fading into white lines, and the burning in his back subsided. There was still a little bruising on his face, but she said it would disappear in a couple of hours.\n“Don’t work yourself so hard,” she sighed, shooing him away. “It’s best to heal your injuries as soon as you get back, but that’s often impossible due to how much you exhaust yourself.”\n“Yes ma’am,” he acknowledged with a sigh, and walked back to the common room.\nMost of the students had gone into the dining area, where breakfast awaited them all. Lunch Rush only prepared breakfast on school days, which meant they had taken it upon themselves to cook a Western-style breakfast of pancakes and bacon, though someone had also made omurice.\nHe was going to pass by and go to his room, but somebody called out for him--\n“Sensei, aren’t you going to eat with us?”\nSquinting at them, he paused in his steps, head cocked to the side a bit. Well, that was new. Sure, they’d asked him to come to dinner before, but that was different. They all ate dinner together. Breakfast was a different story, because everybody woke up at different times and wanted to eat different things. They never ate like this in the morning.\nHe saw that a plate had been set aside for him in his usual spot, and he gave a sigh, knowing he’d have to eat it, one way or another. So with reluctance, he seated himself at the table, and quietly glared at all who were staring at him until they looked away.\nThe omurice was good, at least.\nAnd he couldn’t help but notice that everybody kept glancing at him.\nWhen noon came, Shinsou entered the dorm, though nobody asked him what he was doing there or tried to send him away. They just welcomed him with a nod.\n“You look dead,” Shinsou said by way of greeting, approaching where Aizawa sat. He’d wanted to go back in his room again, but someone had asked for help on their homework, which lead to a good five or six of his students crowding around him, asking for some tutoring.\nCurrently, they all sat in a circle--Ashido, Kaminari, Ojirou, Sero, Kirishima, and Uraraka, all with their notebooks out while he tried to help them on three different subjects. No, Ashido, you can not square root a negative number. No, Sero, Sherlock Holmes was not the name of the author.  No, Ojirou, why are you even here, you understand the chemical table perfectly?! \nShinsou sat beside him, and he glared at the other, waiting for him to ask for tutoring as well. Instead, Shinsou pointed at the formula he’d been writing down to explain to Ashido, and said,\n“You got that wrong.”\nHe wanted to go to sleep.\nThankfully, Mic came in around two o’clock, dumping a bag of fast food into Aizawa’s lap while he silently agonized over the fact that no matter how much he tried explaining it to Uraraka, she did not understand how to solve inequalities. He did not understand how to solve inequalities either. Did anybody know? Probably, yes. But not him.\n“Can you share your french fries?” Kirishima asked as Aizawa peeled open the bag with a bit of disdain. He carefully took out the burger and tossed the rest into the middle of the circle, with a mumbled ‘go wild.’\n“I bought that for you!” Mic complained as Aizawa got to his feet, unpeeling the waxy paper from the sandwich. Behind him, he heard Kaminari and Sero arguing over who got the ketchup.\n“I’m not all that hungry. The kids made a big breakfast.”\n“Ah, yeah, forgot about that,” Mic said, nodding in understanding, and Aizawa raised an eyebrow.\n“What do you mean? You weren’t even here this morning.”\n“I mean, uh, ah,” Mic laughed nervously, wringing his hands together. “Jirou told me about it, of course!”\nSuspicious, but he didn’t feel like trying to get to the bottom of this little mystery. Instead, he sighed, and with a glance at the rest of the students to make sure they were invested in whatever they were doing, rested his head against his husband’s shoulder.\n“You tired?”\n“Hmmm.”\n“Recovery Girl told me about your arm.”\n“Hmmmmmm.”\n“Wanna take a nap?”\nAizawa turned his head a bit, so his voice could be heard. “Yeah.”\nHe finished the burger and followed Mic into their room, where he all but collapsed onto the bed. He was out like a light after only a minute, due to the combination of exhaustion, a full stomach, and how warm it felt when Mic wrapped his arms around his waist.\nWhen Aizawa woke up, it was nearing six o’clock, and Mic was nowhere to be seen. With a grunt he sat up, running his fingers through his unruly hair and rubbing at his eyes. Groggily, he got to his feet, and pulled his hair back in a lazy ponytail.\nToday just felt awful, but in a different way than usual. With how tired he was and his students suddenly demanding he eat breakfast with them and then tutor them--what was up with them today?\nMic wasn’t anywhere to be found in his little apartment, so, with a sigh, Aizawa stepped out into the common room, squinting in suspicion when he heard several voices coming from the kitchen.\nThat was a lot more voices than was necessary for cooking. Ten, at least. Satou, Uraraka, Yaoyorozu, Iida, Todoroki, Kirishima, Aoyama, Asui, maybe Shouji and Tokoyami as well..?\nApproaching the kitchen, Aizawa almost glimpsed what was inside when he felt a hand yank on his wrist and he stumbled backwards in surprise. Looking back, he saw his angriest student standing behind him.\n“Get out of there,” Bakugou said, practically dragging him back in the direction of his room. “I need you to teach me some signs.”\n“Where’s Mi--”\n“He’s out, okay?!”\nAizawa was unceremoniously let go of, and due to being unbalanced, nearly fell over. Thankfully he righted himself quickly enough, but not before sending a glare Bakugou’s way. He’d kind of been avoiding using signs outside of class around the kid, considering he’d  accidentally flipped off his own student,  but it didn’t seem like Bakugou cared. He’d already pulled out an extensive list of signs he wanted to learn.\nThis was about a thousand times more suspicious than whatever was going on in the kitchen.\nBut he sat down beside his student anyways, and reluctantly taught him the signs. Four of them were extremely specific swears, by the way, but at least Bakugou caught on quickly.\n“Oh, sweet, more sign classes?” Came a new voice about fifteen minutes into it, and he glanced up to see Ashido, Kaminari, and Sero approaching.\n“No,” Aizawa deadpanned, even though he was clearly in the middle of teaching Bakugou how to sign ‘hideout’.\nThey sat around him anyways, and mimicked his movements. What was up with all of them? Why were his students acting so strange today?\nHe could literally not think of a single reason why. It was the weekend, but they’d never done this before on any previous weekends. He’d been hurt last night, but it wasn’t like he wasn’t hurt every other patrol. He’d fallen asleep in the common room, but that was a regular occurence.\nHad Mic put them up to it? That would explain why he was a bit off earlier, clearly hiding something from him.\nHis number of questions only grew when he saw Thirteen, Midnight, and Snipe all arrive at the same time, all dressed down, save Thirteen, who still chose to wear the space helmet. Satou stepped out of the kitchen, greeting them with a nod, and lead them inside, right before his very eyes.\nOkay. That was it.\nGetting to his feet and ignoring the kids’ protests, he made his way over to the kitchen, wondering why his coworkers had gone inside, wondering why they would have any  reason to go inside. Shoving the door open with his shoulder, he stood and glared from the doorway, prepared to tell them off for whatever was going on.\nNot only was he faced with a horrific mess of flour, icing, and an assortment of candy, he was also faced with half his class yelling at him to get out, and then Midnight shoving him on his ass and slamming the door in his face.\nWhat the fuck.\nStaring at the door blankly, he tried processing a lot of different emotions at once, before deciding he was just going to lay down on the floor right there, and give up.\nUnfortunately, Shinsou had other plans.\nHe hated the kid. He really did. Literally only he could convince him to play a game of freaking  Clue, and he seethed silently at the fact he let the other talk him into so much. Maybe it was because he was subjected to his Quirk so often. They should probably look into it.\n“Alright, sensei, you know how to play, right?\" Shinsou asked as he set up the board. Aizawa wanted to say no, but years of being forced to endure drunken game nights with Midnight, Mic, and Tensei made the opposite true. So he just nodded silently.\nWhen his husband appeared, he sent a glare his way and raised an eyebrow, a silent question in his eyes. Mic gave a sheepish grin and just walked right past them, flipping his hair over his shoulder.\nAt this point, Aizawa had accepted defeat. He was way too tired for this. Maybe they were all just acting weird as a way to let all the stress out. Maybe it was some sort of holiday, or a school event Nedzu had conveniently forgotten to tell him about, just like he’d conveniently forgotten to tell him about Hero Day. It would have been fine if about five of his kids didn’t show up dressed up like him, all the way down to the utility belt.\nIt was whatever. He could care less, really, so long as nobody blew anything up, and since 4/5th’s of Bakugou’s friend group were currently right in front of him, it probably wouldn’t happen. Probably.\nHe ended up winning the first game, and the next one Ashido guessed it right first. They were in the middle of a third game when the kitchen door flew open, Midnight and Mic marching out and approaching him. Out of the corner of his eye, Bakugou and the rest had gotten to their feet, and he sighed. Well, he sort of knew what was coming next, even if he hadn’t the slightest clue of the occasion.\n“What’s going on?” He sighed, staring up at them.\n“Don’t tell me you really forgot!” Midnight said incredulously when he raised an eyebrow in both of their directions.\n“You’ve known him fifteen years, Nemuri, and you’re still surprised?” Mic asked of her, grinning a little. Embarrassingly, yes, Aizawa had ended up oblivious to most occasions unless they were spelled out for him, or advertised everywhere, like Christmas. Smaller things, he forgot until someone told him. This was probably one of those times.\n“Just shut up and tell me,” Aizawa sighed out. Midnight merely bent down, gripping his upper arm and yanking him to his feet. He was pretty used to her doing that, though the first time she’d ever done so hadn’t gone as well. He’d been fifteen and sitting beneath a tree near the cafeteria, studying, when she’d gripped him from behind, grabbing under his armpits and lifting him from the ground. He’d kicked her then, a fight-or-flight response activating within him. She’d never let him forget about it, either.\nHe was dragged away, not even resisting her powerful grip, and he noted everyone else following. Inside the dining area, it took Aizawa about five seconds to realize what was happening.\nA majority of his coworkers were present, as were all his students sans Bakugou’s friend group and Shinsou, who were trailing behind him. There was food-laden plates set on the tables, a few dishes that he recognized as simple things like karaage and ramen and store-bought sashimi. All of them were his favorite foods, and all were stacked around an extremely large cake.\n“Mic,” he sighed, knowing exactly who was behind all this. “Why.”\n“Happy birthday, sensei!” Everyone cried out, throwing their hands in the air. Hagakure threw confetti in his face, giggling. Blood King called him ‘old man’, despite being an exact four days younger than him. Everybody was loud and crowding around him, wishing him birthday congratulations and waving around handmade birthday cards.\nOkay, yes, maybe he was embarrassed that he had forgotten his own birthday. He usually forgot about it because it was such a chore, but the moment he became friends with those meddling types like Mic, Midnight, and Ms. Joke (the three deadly M’s) he’d never known peace on any of his birthdays. This one would have been no exception.\nBut he’d lost track of time. He still thought it was October, despite them now being more than a full week into November, which meant he had been totally unprepared for this.\n“This was unnecessary,” Aizawa said as his kids kept wishing him a happy birthday, kept getting closer to him, but to do what, he didn’t know. A few of them didn’t seem bothered by his comment, but Yaoyorozu frowned a little.\n“Do you not like it? We worked so hard to cook these meals...and the cake...”\nA few more began looking rather put-out, eyebrows drawing together in frowns, and their noise became a little more muted and wary.\n\n Damn it. \n\n“No, it’s fine,” he sighed, not wanting to feel like an asshole who disregarded the effort his kids put into doing this for him. “I like it. I’m just...not the partying type.”\nThat seemed to alleviate all their worries, because then they were back to shouting and smiling at him. They were closing in on him, like a pack of wolves, and he was starting to feel claustrophobic, but before he could escape, they all surged forward as one and hugged him. \nFirst instinct: shove them all away.\nFirst realization: he cannot shove away 20 students, Mic, Midnight, and Thirteen.\nSecond instinct: collapse on the ground. Roll away. Escape.\nSecond realization: that was literally impossible.\nFinal instinct: give in, and hug back.\nFinal realization: it was hard to hug 20+ people at once.\nSo he settled on patting some of their backs, eyebrows raising as he tried to not think about the fact that his eyes were maybe growing a little wet. Okay. His kids were dumb, and threw a party, and were now hugging him. This was fine. He was not going to cry.\n“We’re sorry about all this, sir!” Iida said, gesturing to the decorated area with enthusiastic hand movements. “We just appreciate all that you do for us, both as a class and as individuals, and we wanted to show our gratitude today! We recognize how tough it is being a pro hero, so we let you sleep in, we made you breakfast, and now we’ve made you dinner!”\n“You didn’t have to go that far,” Aizawa said, but there wasn’t any bite in his words. Just a resigned, sort of fond tone.\n“You have helped us out in many small ways, sir!” Yaoyorozu spoke up, placing her hand on her chest. “Me with my self-confidence, Bakugou with his hearing issues, training Shinsou so he can have a chance in the hero course...”\n“Letting me pet your cat,” Todoroki piped up, and all eyes turned on him. “I appreciate that a lot more than you think.”\nWith those words he lifted his arms, showing that he had been carrying Jellybean the whole time.\n“That too! Sensei, you’re probably the best homeroom teacher any of us have ever had. We just wanted to show you how grateful we are, and how much we appreciate you.”\nAh. There they were--the hated and unwanted  emotions. \nAizawa turned away from them all, brushing his hair away from his face as he tried to keep his composure. They couldn’t see his expression, so Mic leaned over to them and whispered,\n“He’s probably crying.”\n“I am not,  Hizashi!”\n“He is,” Midnight noted dully. “Small tears, but tears nonetheless.”\nThe students dispersed, grabbing plates of food and piling a special one high before trying to give it to Aizawa-sensei, who shook his head and said he didn’t want to eat all that much, thanks though. Pouting a bit, they all returned to eating, chatting as they stood around, enjoying the moment.\nBakugou and Kirishima kept picking food off of one another’s plates, much to the other’s chagrin. Uraraka was making Jellybean float as Todoroki watched in awe. Satou kept batting away the hands of everyone who tried touching the cake, claiming it wasn’t time yet. Even Shinsou was having a good time, following Iida’s erratic hand movements with his eyes.\nA few of his coworkers continued offering him more congratulations, Ectoplasm telling him “Congrats on another year of not dying.” When he was left alone, he sought out the person he usually stuck to like glue during such events.\n“You told them, didn’t you?” Aizawa asked as he stood beside Mic, watching the other eat a good deal of karaage off his plate.\n“Well, they asked me, actually. Three weeks ago.” Mic smiled, giving him a knowing look over his glasses. “I helped them plan all this, though. And told them some of your favorite things.”\nSighing, Aizawa leaned against the wall, that familiar bone-tired feeling sinking into him, but he could ignore it in favor of the growing fondness in his chest.\n“How irritating.”\n“Don’t kid yourself!” Mic laughed quietly, elbowing him. “You know you love it. And you also know you’re taking some of this food and cake for lunch tomorrow, right?”\n“...Perhaps.”\nWatching his kids eat and joke around, he felt a little more content than he had this morning. They were all safe, and they were joking with one another like kids should be able to do, despite the heroic paths they’ve chosen. And as a part of their fun, they’d decided to throw him a party, and tell him how much they appreciated him.\nSo maybe he loved his class.\nBut he wasn’t ever going to admit it out loud.\nEspecially when Kaminari, Ashido, and Sero approached with devious smiles on their faces, before presenting him with the cake Satou had baked, which read:  HAPPY BIRTHDAY DAD! \nRight, he loved them. He’d still expel them one day, though."
}