{
    "id": "13808895",
    "url": "https://archiveofourown.org/works/13808895?view_full_work=true",
    "author": [
        "GremlinSR"
    ],
    "title": "The Guardians",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen",
        "M/M"
    ],
    "fandoms": [
        "The Avengers (Marvel) - All Media Types",
        "Marvel Cinematic Universe",
        "The Defenders (Marvel TV)",
        "Guardians of the Galaxy (Movies)"
    ],
    "relationships": [
        "Peter Quill/Tony Stark",
        "Tony Stark & Guardians of the Galaxy Team",
        "Pepper Potts & James \"Rhodey\" Rhodes & Tony Stark"
    ],
    "characters": [
        "Tony Stark",
        "Guardians of the Galaxy Team",
        "Peter Parker",
        "James \"Rhodey\" Rhodes",
        "T'Challa",
        "Captain Marvel",
        "Kamala Khan",
        "Hope Van Dyne"
    ],
    "additional_tags": [
        "Tony Stark Pulls Himself Together",
        "BAMF Tony Stark",
        "Not Steve Rogers Friendly",
        "Civil War Team Iron Man",
        "Sokovia Accords",
        "Wanda Maximoff is not a good person",
        "The Guardians are good bros",
        "Author is salty",
        "Team Cap is full of shit",
        "AU - Canon Divergence",
        "I also play with timelines",
        "self indulgent",
        "dad tony stark",
        "Discussions about forced prostitution"
    ],
    "language": "English",
    "series": "Part 1 of Irondad",
    "published": "2018-02-26",
    "completed": "2018-04-22",
    "words": "35,472",
    "chapters": "8/8",
    "comments": "1,375",
    "kudos": "16,481",
    "bookmarks": "4,930",
    "hits": "312,563",
    "summary": "<p>Tony is pulled out of his funk after the Civil War by actual space aliens when they come to warn him of an impending attack. Now he's building a new team, going on adventures with his new space friends, and generally just moving on.</p>\n<p>When Team Cap comes back, they'll find things are different than how they left them. </p>\n<p>A salty 'Tony doesn't need the team back' post Civil War fic.</p>\n<p>Tony has a chat with T'Challa, and the Guardians are interesting houseguests.</p>\n<p>Tony goes back into the public eye, and goes on a little adventure off-planet.</p>\n<p>Tony and his team make some changes to the Initiative, and we get a peek into the lives of the rogue Avengers.</p>\n<p>Tony and Quill go for it, and the Assembly makes a decision.</p>\n<p>Steve's return isn't quite as triumphant as he'd like, and Tony and Peter tie the knot.</p>\n<p>Steve learns some hard truths, and Tony learns some happy ones.</p>\n<p>It's been two years since Infinity War, and Tony faces his biggest challenge yet: Jontan asks to attend school.</p>",
    "notes": "<p>If you couldn't tell by the tags, I'm one of the many who just was not a fan of how things panned out in Civil War. So I guess this is me working through my rage.</p>\n<p>Enjoy!</p>\n<p>A little warning: there's some talk of prostitution this chapter (but no actual prostitution going on) and I guess racism...like alien racism?</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>Oh, Steve.</p>\n<p>I made an edit thanks to a very helpful comment from ChristopherIAmToBe. I changed 'restraining order' to 'order of protection' in the last chapter, since that's the proper legal term. Thanks for the advice there! :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>The next chapter will be an epilogue :)</p>\n<p>Hope you enjoyed Steve's angst and Tony's happiness. :D</p>\n<p>Well, this has been fun, guys, and therapeutic! As I said in the chapter summary, this epilogue is set a little over two years after the war. </p>\n<p>Thanks to everybody who commented, kudo'd, and subscribed, your support throughout this fic has been awesome. :)</p>",
    "text": "Tony hadn't left his workshop in a week. His chest ached, his arm itched beneath the cast he was wearing, and his stomach was constantly rebelling. Possibly due to the copious amounts of alcohol, coffee, and lack of food. Eh, eating was for the weak.\nTony Stark just wasn't ready to face the world - not since the video showing the murder of his parents was released by Zemo, somehow, despite his incarceration. The man really had thought of everything.\nIt was followed shortly by the video of Tony watching his parents' murders while standing next to their killer and the man who had aided and abetted him. The fight and subsequent abandonment of Tony to die alone in a Hydra bunker was the topping on the proverbial cake.\nTony tilted his chin to his chest and took three deep, steadying breaths. Better not to dwell on that. He hadn't even glanced at a news article or turned on the TV since it hit the airwaves. He just didn't want to know what the world thought of Steve's betrayal, mostly because he assumed they'd all side with the infallible Captain America. He focused back on the braces he had been working on for Rhodey for the past week. They were almost done, and hopefully...well, hopefully they would end in his best friend walking again.\n\"Boss, you have visitors,\" Friday said a long while later and Tony frowned.\n\"I told you I wasn't interested in seeing anybody,\" he said and scratched at the stubble on his cheek. \"Tell Pep that I'll call her later.\"\n\"Boss, it's not Ms. Potts. They are currently on the roof asking for you. They appear to be...extraterrestrials.\" Tony turned to where he knew a camera was placed in the wall and raised an eyebrow.\n\"Wanna run that by me again, Fri?\"\n\"They arrived in some sort of pod and knocked on the roof access door. They called out their wish to speak with Iron Man.\"\n\"Show me,\" he said, wondering if he was hallucinating. Maybe he should have slept sometime in the past forty eight hours? A hologram popped up in front of him and the hallucination scenario was looking more and more likely.\n\"Uh, Friday, is that a raccoon? And...a hot green lady?\" He didn't even mention the shirtless giant of a man with what looked like blue skin and multiple pink...tattoos?\n\"Friday, baby girl, be real with me. Have I lost my mind?\" He watched in fascination as the only human in the group had a whispered conversation with the green woman.\n\"I do not believe so, Boss. If you are, then I am also part of your hallucination.\" She paused for a moment before continuing. \"They are currently discussing whether or not they should shoot down your door. The green woman, the raccoon, and the shirtless man all seem in favor of this.\"\nTony sighed. Why did everybody think is was okay to destroy his property? \"Ask them what they want, Friday. Bring up audio.\"\n\"Why do you wish to speak with Mr. Stark?\" Friday's lilting voice cut into their whispered conversation.\nThe only completely human-looking person among them, a handsome man who was probably in his early to late thirties, looked around, the woman pulled out two wicked-looking blades, and the raccoon tugged a huge gun from his back. \"Who said that?\" the little creature asked, tail bristling.\n\"I am Mr. Stark's AI, Friday. Who are you?\"\n\"We,\" the man said with a roguish smile, \"are the Guardians of the Galaxy, and we're here to talk to Iron Man about saving the Universe.\"\n000\n\"So,\" Tony said, eyeing the group sitting across from him on his couch. \"You're aliens.\"\nThe woman, Gamora, raised an unimpressed eyebrow. \"To me, you are the alien, Iron Man.\"\nHe grinned. \"Fair enough. And call me Tony, please, it's a little weird being called Iron Man in casual conversation when I'm not in the suit. So what brings you to my humble abode on my humble planet?\"\nThey exchanged glances and then Peter Quill, also apparently known as Star Lord, leaned forward with that same smile he'd given on the roof. The pink tattooed man, introduced as Drax the Destroyer, stood and wandered over to the kitchen, where he picked up the toaster and eyed it warily before tipping it upside down above his head to look in the slots. He shouted in alarm when crumbs fell into his eyes before throwing it on the ground and stomping on it.\nTony gaped at him, the raccoon - Rocket - groaned, and Gamora stood and made her way over to the large man. Peter kept talking like nothing had happened.\n\"Well, like we said. We want to talk to you about saving the Universe.\"\n\"From what? And why me?\" In the background Gamora and Drax were having a furious, whispered conversation about not touching something if they didn't know what it was while the woman had him bend down so she could help him remove the crumbs from his eyes.\nPeter frowned. \"Well, from Thanos of course. Who else?\"\nTony gave him a blank stare. \"Who?\"\nPeter gaped at him. \"Um. The being who sent the army that you single-handedly blew up?\"\nTony stared at him. \"You mean - the Chitauri?\"\nPeter nodded and just like that Tony was back in space, staring down a huge invading force, his team dead or dying around him, knowing he could have prevented it -\n\"Boss, it's January 23rd, ten pm, and you are at Stark Tower. The temperature is forty-five degrees with a wind chill of twenty five...\" there was a hand on the back of his neck pushing his head between his legs and Friday's voice pulled him back from the scene playing in front of him.\n\"There ya go, buddy, you're alright,\" Peter Quill's voice was saying. \"Just breath through it, that's it.\"\nFinally, he sat back, blinking stars from his eyes, and flinched at the four sets of eyes focused on him. \"Sorry,\" Peter said as Gamora handed Tony a glass of water, which he gulped down greedily. \"Didn't mean to drop that on you.\"\nTony ignored the shame and embarrassment moving through him at showing his weakness to these people, as it wasn't what was important at the moment. \"It's fine,\" he said. \"Not your fault, just...bad memories.\"\n\"Not to be a jerk but, you look like shit,\" Peter said. \"Why don't you go, I don't know, take a nap, maybe shower, because, man, you stink. Uh, no offense,\" he said at Gamora's glare. \"Then we can talk about Universe saving,'\" he finished.\nTony snorted. \"Listen, I appreciate you stopping by, but I think you've got some misinformation issues. I - I'm no hero. Just a fuck up who helped save the world a few times.\"\nHe swallowed. He was just...tired. Too tired to care about aliens knocking on his door, too tired to deal with the fact that apparently he'd been right about the whole 'huge threat on its way to kill us all,' and too tired to face it. Tony Stark was just done.\n\"You're welcome to stay here for a few days. Friday will show you to the guest floor. She can also help you figure out who you should talk to about...saving the Universe. There are a lot of heroes to choose from.\" I'm just not one of them.\nIgnoring their disbelief, Tony stood on shaky legs and stumbled to the elevator. He was so exhausted that when he fell asleep ten seconds after flopping down on his bed, he didn't even dream.\n000\n\"I do not understand,\" Gamora said. \"Is this a usual reaction to the news we brought for a Terran?\"\n\"I do not believe so, Ms. Gamora,\" Friday said. \"Boss has had...a rough couple of weeks. Years, actually.\"\n\"Guy looks like crap,\" Rocket said. \"And he smells like booze.\"\n\"If you knew what Boss had been through, you would not be so cavalier,\" Friday said primly.\n\"Uh, well. Can you tell us?\" Peter asked. Friday was silent for a moment.\n\"I can...show you news coverage, if you'd like? Of the past few years, so that you may understand the history. That is within my protocols.\"\nPeter shrugged and flopped down on the couch. \"Why not? We need to figure out the best way to warn Terra about Thanos. And apparently we need to figure out how to convince Iron Man to help us out. Okay...Friday, was it? Let's see it.\"\n000\nWhen Tony woke up, sunlight was on his face and he was vaguely aware of a strange dream that involved green aliens and somebody who called himself Star Lord. He really needed to stop drinking. And start sleeping. Or something.\n\"Good afternoon, Boss. It is currently one pm. You have been sleeping for approximately thirteen hours.\"\n\"Jesus,\" he said, groaning as his muscles protested thirteen hours of inactivity after two days of hunching over various projects and schematics in his lab. He stretched and wrinkled his nose as the stench from his armpits reached him. \"Christ, I smell like I've been sleeping in an alley,\" he grumbled, stumbling his way to his shower.\nHe washed quickly before pulling on jeans and a long sleeved shirt, uncaring of his appearance. \"Boss, Colonel Rhodes is asking for your presence on the guest floor.\"\n\"What's he doing there? And tell him I'll...I'll talk to him later,\" he said, guilt making his throat close up. Tony knew he shouldn't keep blowing his friend off, but until he had the prototype for Rhodey's braces in hand, he didn't think he could face him.\n\"Colonel Rhodes is currently having breakfast with the Guardians of the Galaxy.\" Tony tripped over his own feet.\n\"Run that by me again?\" he said when he regained his balance. Friday repeated her sentence, somehow managing to convey exasperation despite her tone remaining level.\n\"Friday, get me the suit!\" he yelled, panic beating in his chest as he ran for the elevator, pieces of armor flying to mold themselves to him.\nGod, how could he have been so stupid? He had been so tired and hungover and probably suffering from low blood sugar that he'd just assumed he was hallucinating. He had invited unknown aliens to stay in his house with his best friend. His paralyzed best friend. If Rhodey died, it would be all his fault -\nHe burst into the guest kitchen seconds after the elevator opened, gauntlets raised. \"Step away from Rhodey!\" he said, thankful for the voice modulator that hid his shaking voice.\n\"Uh, hey man,\" Peter Quill said, standing and holding his hands up in the air. \"What's this about? You said we could stay for a few days last night.\"\nGamora had drawn two honest to god swords and was holding them in front of her while giving Tony a narrow-eyed look. Drax and Rocket didn't even look concerned, instead focusing on eating the large amount of food that had apparently been ordered from Tony's favorite diner if the boxes were any indication.\nRhodey was looking between the two groups from his spot at the head of the table in confusion. \"Hey, Friday, I thought you said Tones gave them permission to be here?\"\n\"He did,\" Friday said and Tony was faintly proud at the wryness she managed to convey with just her voice. \"I believe he was so sleep deprived and hungover at the time that he believed he was hallucinating.\"\nThere was a short, disturbed silence for a moment and then the Raccoon let out an obnoxious laugh. \"Oh man, this is the guy that's famous across all the galaxies for taking down a quarter of Thanos' forces? We are so screwed,\" he said with more delight than Tony thought the situation warranted.\n\"Hey, judge not lest ye be judged, Ranger Rick,\" Tony snapped.\n\"His name is Rocket, not Rick, and he is not a Ranger,\" Drax said.\n\"Tony,\" Rhodey said, voice concerned. \"I don't think they're here to cause trouble. Can you just...take off the suit and maybe get over here and give me a hug?\"\nTony winced and looked around the room, taking in the domestic scene before sighing and dropping his repulsors. \"Fine,\" he grumbled, stepping out of the suit. What was breakfast with aliens after the shit he'd been through?\nHe shifted uncomfortably and looked to the side as Rhodey took in his appearance. His friend's jaw ticked, a sure sign that he was upset, and Tony winced a little.\n\"Can you guys give us a moment, please?\" Rhodey said in a calm voice he only used before he laid into one of his subordinates. Apparently the Guardians came with a healthy dose of self preservation, because they all left the room without complaint, though Rocket and Drax grabbed their plates as they did so.\nFor a moment Tony just stood in the dining room, anxiety building, before Rhodey spoke. \"God, Tones, could I at least get a hug?\" his voice cracked on the last word, and that more than anything else had Tony crossing the room before he could think about it.\nInstead of leaning over awkwardly, he just dropped to his knees on one side of the wheelchair and wrapped his arms around Rhodey, who had twisted to return the favor. \"Do you have any idea how worried I've been?\"\n\"I know, I'm sorry,\" Tony said. \"I just -\"\n\"You were just feeling misplaced guilt and were terrified of having to face your feelings once those videos leaked. God dammit, Tony, don't you know, after all this time, that I'm your friend?\"\nSo was I. The words echoed in his mind and made him flinch. He immediately tried to cover it up with a joke. \"Aw, Honey Bear, you do care!\"\n\"Of course I do,\" Rhodey said, finally pulling back to give Tony an uncomfortably serious stare.\nTony stood, avoiding that gaze - Rhodey could read him better than probably anybody, after all - and took a seat at the table. \"Eat,\" Rhodey said.\n\"Rhodey, muffin, you know I'm trying to watch my figure -\"\n\"Tony,\" he snapped and Tony sighed before reaching out to grab one of the containers at random - a ham and cheese scramble, yum. He took a bite, waiting for the inevitable questions.\n\"What happened to me isn't your fault,\" is what came out of Rhodey's mouth, and Tony inhaled a piece of egg and had to spend the next few minutes coughing - a painful endeavor for his still-healing chest. The cradle could only do so much. Finally, once he'd guzzled some water and could talk again, he turned to his friend, who was making his stubborn 'don't fight me on this,' face. Still...\n\"You wouldn't have been there if I hadn't -\"\n\"Bullshit,\" Rhodey said. \"I believed in the Accords just as much as you did. I wanted to keep Ross' hands off of the Avengers, too. If anybody's to blame, It's Rogers and his merry band of terrorists.\"\nTony pursued his lips and looked down. \"I should have tried harder to make them listen.\"\nRhodey sighed and tapped his fingers on the table, a sure sign that he was working through something. Finally, he spoke. \"Okay, if you want to take some responsibility for what happened, that's fine.\" For some reason, even though Rhodey was agreeing with him, that still made Tony's stomach clench.\n\"Great, good, I'm glad we agree,\" Tony said and went to stand, suddenly desperate to get out of the room. \"Well, I've got things to build, lives to destroy -\"\n\"Sit down, Tony.\" Tony clamped his mouth shut and sat down, knowing better than to try and run after Rhodey used that tone. He'd probably shoot him in the leg to keep him there.\nRhodes' face softened. \"Let me finish before you run off. If you want to take responsibility for everything going to hell, I want you to at least comprehend what you actually contributed to that cluster fuck.\" He took a deep breath, as though trying to steel himself, before continuing. \"I think we can both agree that a big problem with the Avengers, the whole reason that the Accords even became a necessity, was that the group as a whole wasn't willing to take responsibility for their actions. That's also what I believe Rogers' main problem with the Accords was, and why he wouldn't sign. He didn't like the idea of accountability for his own actions.\"\nTony gave a small, hesitant nod, wondering where this was going. \"Tony, the reason Rogers' group believed they didn't have to be held accountable was because they never were before. When Rogers and Romanoff broke the cover of hundreds of innocent SHIELD agents because they didn't feel like communicating with the team, SI and the government covered for them, and they didn't even get a slap on the wrist. When shit went wrong and somebody blew up a city block because of a miscalculation on one of the Avengers' parts, you always stepped in and personally paid for the damages.\nYou handled their PR, cleaned up their messes, paid for their equipment, and funded their unsanctioned missions. Hell, they didn't even have to find their food and lodging, because guess what?\" Tony cringed a little at Rhodey's harsh tone, \"you did it for them. And when something went wrong, you always let them blame you. You let them think it was okay that somebody who had mind raped you could just move in to your compound like it was nothing.\"\nAnother deep breath. \"Don't get me wrong, Tony. They're adults, each and every one of them, so their bad behavior isn't really on you. But, if you'd maybe let them take some of the burden of responsibility in small doses sooner - maybe they wouldn't have reacted as strongly. So, if we want to put some blame on your shoulders, you can take, like, ten percent of the responsibility for them being immature, self-righteous, spoiled assholes.\"\nRhodey leaned forward, face intent and serious. \"But Tony, you do not get to take on the burden of their frankly appalling decisions and callous disregard for human life. That is not on you. That is on them. Germany, Siberia, Lagos, my legs,\" he ignored Tony's wince, \"the way they treated you like a human doormat, that is on them. Do you hear me?\"\nTony cleared his throat and blinked back tears. \"Yeah, yeah I hear you,\" he finally said. His mind was quickly taking in what Rhodey had said, mulling it over and poking holes in it and comparing it to the reality he'd been living in since he came back from Siberia.\nWhat Rhodey said made logical sense, even if emotionally he still felt like all of this wouldn't have happened if he'd just found the right words, or the right actions, to make them see. One thing snagged at his hopeful acceptance of what Rhodey was saying.\n\"If you felt this way, like I was letting them treat me like a sugar-daddy without the sugar slash janitor for their messes, why didn't you say anything?\"\nRhodey sighed and ran a hand down his face. \"Honestly? I was afraid all it would accomplish was to drive a wedge between us. You'd decided that they were your people Tony, your family. Once you let somebody in, you have a hard time accepting any negative commentary on them. I figured you wouldn't believe what I was saying, would maybe even push me away. And I - I needed to make sure I was around for the fallout. Now I wonder if I should have done it differently. If I could have -\" Rhodey shook his head once, then shrugged and gave Tony a heartbreaking smile. \"I'm sorry, Tones. I'm so sorry.\"\nTony ran a hand down his face, unable to be angry with Rhodey because, well, he wasn't wrong. Tony could be damn protective of his people, even if they didn't deserve it. He had never looked at his relationship with the Avengers in the way that Rhodey had painted it, and it was...disturbing. And easier to believe than it would have been a year ago.\n\"You don't have anything to be sorry for. You're here, aren't you?\" Whoops, wrong thing to say, if the stern expression on Rhodey's face was any indication.\n\"About that,\" he said. \"Why have you been avoiding me? Avoiding everybody?\"\nTony looked down. \"I just...I didn't think I could face you. Not until I had a solution for you - a way for you to walk again.\" He hurried to explain when Rhodey's face went blank. \"No matter what you say, I owe you that for dragging you into that cluster. I'm working on some braces. They aren't quite done, but I'm -\"\n\"Tony,\" Rhodey said, and he saw that there were tears in his eyes. \"Man, you have to know, that you don't owe me anything. I'm your friend. Always have been, always will be. That said,\" Rhodey hesitated, and Tony leaned forward.\n\"Anything you want, Rhodey-bear, anything I can do to make this better. Just tell me.\"\nRhodey took a deep breath, and looked Tony in the eye. \"If you really feel you owe me something, and are trying to, to balance some cosmic scale, then fine. What I wanted aren't the braces, though. Not for that.\"\nTony gave him a wary look. \"Okay...\"\n\"I want you to be healthy, man,\" his friend said, looking choked up. \"If anything good comes out of this cluster, that's what I want. I want you to see somebody about the PTSD and to help you deal with getting out of what was basically multiple abusive relationships. I want you to stop drinking, I want you to sleep regularly. Please, Tony. When I - when I saw those videos, when I saw how close you were to just not coming home, it really messed me up. I know that if it weren't for Dr. Cho and her cradle, you'd be dead. And then knowing that you were down in that workshop, probably drinking and working yourself into the grave - it killed me.\"\nTony stared at Rhodey, wide eyed, as his best friend for the past thirty years blinked back tears. \"I don't want you to think this is an ultimatum. It's not. Not matter what you do, I'm here Tony. You'll always have me. Just please, think about it.\"\nTony looked down at his fork. \"Alright,\" he said. \"I - I'll try.\"\nRhodey gave him a small smile. \"That's all I can ask for. And, uh, I won't say no to those braces, either.\" Tony barked out a surprised laugh, a weight lifting off his chest.\n\"Platypus! I thought you'd never ask. Come on down to the lab, I'll show you what I got!\"\n\"Boss, if I may remind you of your guests,\" Friday said, and Tony deflated. Right, you know you've got a dramatic life when aliens in your living room are easily forgettable.\n\"Alright, Fri, send 'em in. Let's see if we can figure this out.\"\nWhen the four aliens - or was it one human and three aliens? - shuffled in, he took one look at their furtive faces and groaned. \"You heard all of that, didn't you?\" he said.\n\"No!\" Quill and Gamora said just as Drax said, \"No, Rocket heard it all with his superior ears and then told us what was said. What?\" He asked when three incredulous stares met his proclamation.\n\"Yeah, well, sounds like you got screwed over by a bunch of douchebags. We watched some of footage from the past four years. Tough break, man,\" Quill said, scratching the back of his neck. \"But at least everybody's on your side.\"\nTony snorted. \"Since when is anybody on Tony Stark's side over perfect Steven Grant Rogers?\"\nFor a moment everybody was silent, and then Rhodey spoke. \"Uh, Tones, have you not been watching any news since...\"\n\"Since the video of me losing my shit and getting my ass kicked by Captain Asshat went live? No. I didn't want to see a bunch of people making excuses for him. Not after what he did.\"\n\"Yeah, I think you should look outside, buddy,\" Rocket said, and the weirdness of a talking raccoon suddenly hit him.\n\"Hey, so, is there a planet out there where evolution ended with a bunch of woodland creatures with complex cognitive -\" He cut himself off when the raccoon started bristling.\n\"None of your business, bub,\" he said. Tony opened his mouth to say something snarky because, bub, really? - but was cut off by Rhodey.\n\"Friday, pull up NBC's ten o'clock news report from last night, please.\"\nTony's chest tightened in panic, and he opened his mouth to stop her, because he couldn't handle it - then the TV in the living room turned on. \" - we still haven't heard word on Tony Stark, and some are starting to worry that his wounds in Siberia were too severe, and that the billionaire-turned-superhero and humanitarian may have succumbed to death, despite Stark Industries' CEO Virginia Potts releasing a statement that says otherwise.\nPeople are still gathering around Stark Tower to show their support of the fallen superhero, leaving flowers, small gifts, and holding signs that say things like We Love You Tony Stark, and, my personal favorite Iron Man for President. The Maria Stark Foundation has received record amounts of donations to honor her death, and the graves of both Howard and Maria Stark have been covered in flowers...\"\nTony watched, eyes wide, as people on the screen marched on Washington, demanding that Captain America be caught and put on trial for his crimes.\n\"...The UN has assured us that they are doing everything in their power to locate the criminals formerly known as the Avengers, though critics doubt that they'd have the manpower to bring them in without the help of Iron Man...\"\n\"...but, Tom, you saw what happened in Siberia. I think we can all agree that James Barnes could not be held accountable for the deaths of Maria and Howard Stark, due to decades of torture and brainwashing by HYDRA.\"\n\"Yes, Jill, but at the same time, we cannot blame Tony Stark for his reaction to that video. Any sane person would lose it if they'd just watch their family killed on video, and the perpetrator was standing right there...\"\n\"...I served as a Marine for thirty years, and if there's one thing every branch of the military can agree on, it's No Man Left Behind - er, or woman, sorry ma'am - but Rogers completely disregarded that when he abandoned Mr. Stark -\"\nTony's first gut reaction to the stories Friday was filtering through was that he needed to go out and fix this. The press was eviscerating his former teammates, and without his help they would never recover. His second thought was, Why should I? They had betrayed him, and then left him, literally beaten, and hadn't looked back. They had never treated him like a true member of the team, no matter how much he gave and gave and gave.\nJust like that, he felt like he could see clearly for the first time in years. The picture was not pretty. It was actually pretty fucking cringe-worthy, if he was honest. Tony had let them belittle him, use him, and then throw him away.\n\"Fuck that,\" he suddenly said, making everybody in the room, who had been silently watching the TV, jump. \"Just. Fuck them. Friday, turn that shit off. I don't...I don't care about them anymore,\" he lied.\nThe TV turned off, and Tony took a deep breath, probably the clearest one he had since he returned from Siberia.\n\"The world's on your side, Tony. Well, most of it,\" Rhodey amended. \"So I guess you need to decide now: are you going to let them break you, or are you going to show them what Tony Fucking Stark can do?\"\nTony stared at Rhodey, who just raised an eyebrow at him. \"Um. The second, I think. Definitely the second.\"\nFor a moment the two beamed stupidly at each other, decades of friendship letting them communicate without have to speak. Tony was, without a doubt, terrified, but he was tired of being driven by his fear of being a screw up. He worked his best after being backed into a corner, after all.\n\"So...does this touching scene mean that you're going to help us?\" Quill asked, raising his hand, and yelped when Gamora smacked him on the back of the head.\n\"Hey, we're having a broment here!\" Tony said.\n\"Yeah, well, genocidal maniac heading for Earth with the lovely goal of the destruction of the universe. So maybe we could move it along?\"\nTony sighed and rubbed a hand down his face. \"Right, I'm going to need coffee for this.\"\nOnce they were all sitting on the couch with coffee - after Rhodey had forced Tony to eat half a plate of eggs - Tony cleared his throat. \"All right. So, lay it on me, Star Man.\"\nQuill wriggled his eyebrows, and Tony couldn't help but smirk back. \"Alright. So, short version is this. There's a dude named Thanos who has a hard on for Lady Death. As some fucked up courtship ritual he's been going from planet to planet, where his army, which he created, kills every living thing before sucking up all the resources and moving on.\"\n\"Well, that's not terrifying. And you said he has his sights set on Earth?\" Rhodey asked, leaning forward with a furrowed brow.\n\"It's more like what Earth holds. The Infinity Stones. He already has three, and if he gets the other three, he can use them as a complete set that he pops into something called the Infinity Gauntlet, gain incomprehensible power, and basically destroy the Universe.\"\n\"Vision,\" Tony and Rhodey said at the same time.\n\"Yeah, I suppose you could say he's got vision, the destruction of the universe is a lofty goal -\"\n\"No, no, we mean our friend Vision is actually holding the stone. It's...a part of him,\" Tony said with a sigh.\n\"That's...huh. Unfortunate for him, I guess. But at least we know where one of them is.\"\n\"Wait, you don't know where the others are?\" Tony asked.\nQuill shrugged. \"We've heard rumors that there are two on Earth. I don't know where the third is. Either way, Thanos believes it, and if he makes it through Terra, well, the rest of the Universe can kiss its collective ass goodbye.\"\nTony leaned back. \"That's...well, that's pretty fucked up.\"\nFor a moment they let that sink in before Gamora spoke. \"Earth would not be without allies. It is true that everyone is scared and would rather run and hide,\" she said this with a sneer that let Tony know exactly what she thought of that, \"but tales of how one man defeated Thanos' army, drove him back, has spread throughout the Universe. No other planet has ever been able to repel his forces. We believe that with The Iron Man leading the charge, others from across the Galaxies will heed your call and come to help us make a last stand here.\"\nTony gaped at her. \"I - wait. Are you telling me,\" he said, \"that I'm an Intergalactic hero?\"\nGamora frowned. \"Yes, that would one way to put it.\"\nTony whooped and jumped up, holding both hands in the air. \"That settles it, I am the coolest superhero. Eat your heart out, Captain America!\"\n\"It would be difficult for someone to eat their own heart. I doubt they would have time once it was removed before they died,\" Drax said helpfully.\nRhodey sighed and covered his eyes with one hand as Tony celebrated, but there was a slight smile on his face. \"Tony. Can you please rub your widespread fame in Steve Rogers' face later? We apparently have an alien invasion to deal with.\"\n\"Aw, pumpkin, you're no fun,\" Tony said with a pout, but sat back down, and wondered how he was feeling better than he had in weeks despite being told that somebody was on his way to destroy Earth and then the Universe. Eh, he'd always done best under pressure.\n\"So, what kind of a timeline are we talking here? And what exactly do you need me to do? You want a soundbite? Intergalactic press conference?\"\nThe Guardians exchanged looks. \"Well, we actually were kind of hoping that you could convince your people to come up with...treaties. That other interested organizations could sign. Earth is...well...\"\n\"It's considered a dirty, backwater planet full of technologically limited apes,\" Rocket said. \"Nobody is gonna be interested in saving your planet unless you show them that you've got deterrents. There's already people making noise about coming in and taking the stones to a more defensible location, and letting Earth serve as distraction for Thanos while they figure out a different game plan.\"\nTony stood, suddenly furious. \"Over my dead body -\"\n\"Hey, hey, don't shoot the messenger. That's why we're here. If it weren't for you, Iron Man, they'd have already done it. We've just gotta convince them to work with us instead of against us,\" Quill said.\nTony studied them with narrowed eyes. He didn't see any indication that they were lying, but... \"Us?\" he finally said.\nQuill grinned. \"Well, yeah, my mother was human, and I lived here until I was about eight. Guess I still got a soft spot for my home planet.\"\n\"Uh, does that mean that your father wasn't human?\" Tony asked, intrigued, but Quill just flapped his hand dismissively. Ah, daddy issues. Tony could relate.\n\"Anyway, my team is my family, so they're with me on this.\" Tony ignored the pang that statement sent through him, and sat back down, thinking. So Earth needed to put on a good show, prove that they had some aces up their sleeves. Enough to make the rest of the Universe think that they would be strong allies in the fight against Thanos.\n\"Well, of course this is happening right when the group that's supposed to be Earth's protectors implodes. Rhodes?\" He did a double take at his friend when he glanced over and saw that he was smiling.\n\"Uh, Rhodey, honey bunny, light of my life, have you finally lost it? This is no smiling matter.\"\n\"Actually, I'm praising myself for doing more than just sitting around and moping the past few weeks. Friday, pull up Project: New Avengers.\"\n\"Yes, Mr. Rhodes,\" Friday chirped.\n\"Project what?\" Tony said, but then his attention was taken up when a hologram popped up in front of them. On one side was a bulleted list named \"Needed Amendments to the Accords.\" The other side of the rimage was a bunch of files under the title \"Possible Recruits.\"\n\"Tony, I know that if feels like the Avengers are broken, but maybe...maybe something better can rise out of the ashes, man. There are a lot of enhanced humans out there. I know the UN is already putting together a list of names, and Fri and I have been researching possible new members. I think, if we can get the listed amendments through, and educate the public on what theymean... people will be willing to join. We can start from scratch, build a group of protectors that don't mind being beholden to the people, that don't believe they're infallible.\"\nTony stared at the information flowing in front of him. He saw plans to transfer ownership of the compound over to the UN, to remove Tony almost entirely from privately funding the Avengers.\n\"Rhodes, man, this is...this is amazing,\" he said as Drax leaned forward and poked at a file, then jumped when it expanded into three more.\n\"Yeah, but it won't be easy. We need Tony Fucking Stark on this - and not the Tony that's been ghosting around for the last two years. We need the real Tony Stark.\"\n\"How long do we have?\" Tony asked abruptly, not wanting to touch that comment with a ten foot pole. \"Until Thanos comes?\"\n\"Eighteen months,\" Peter said. \"It'll take at least that long for him to finish amassing his army and getting it here. Maybe closer to two years.\"\n\"Two years...\" Tony mumbled. \"Alright. We can work with that. We're going to need help. Lots of help.\" His mind raced. \"Friday! Get Jane Foster on the line. Tell her we need her here yesterday - whatever she's doing, this is more important. Tell her it's end of the world shit. Also...\" he hesitated. \"Get me an appointment with Hope Pym and King T'Challa. I want to know if they're still in support of the Accords or if I shouldn't bother to include them.\"\n\"But, Boss, isn't King T'Challa housing the rogues?\"\n\"What?\" Rhodey yelled. \"That motherfucker is what?\"\n\"Not cool, Fri,\" Tony grumbled.\n\"Oh, was I supposed to keep that a secret?\" Friday said sweetly. \"You never said.\"\nTony sighed and looked at the ceiling. \"Right. Okay. So we're going to need to tell the council about Thanos, but not until I have my ducks in a row.\"\nHe narrowed his eyes at the Guardians. \"Can you guys come back in three months? Pretend that you've never met me before, and then we'll go to the UN with a warning. I don't want them to lose their shit before we have something to offer them.\"\nQuill blinked, apparently a little overwhelmed by how fast the conversation had moved. \"Well...yes. Well, actually, no,\" he said a little sheepishly. \"I mean, the rest of our team took our ship to go and gather some supplies and won't be back for a week. Uh. Can we...crash?\"\nTony raised an eyebrow. \"Yeah, whatever, mi casa es su casa. Just stay out of sight of anybody but me, alright?\"\n\"We will not cause you any trouble,\" Gamora promised. Somehow, Tony didn't quite believe that, if his poor toaster was any indication.\n\"Hello Kitty!\" Tony said as T'Challa's face came up on screen. \"Oh, or maybe I should call you Grumpy Cat,\" he said at the man's expression at the greeting. \"New tenants giving you trouble? I feel you, man, I have to say, from the ex to the new sugar daddy, I do not envy you.\"\nT'Challa, whose face was displayed on a screen in front of Tony where he was fiddling with Rhodey's braces, had gone from tired to annoyed to panicked as Tony spoke before he finally got a word in edgewise.\n\"I'm afraid I don't know what you're talking about.\"\n\"Aw, don't get your tail in a twist, your kingliness, I don't plan on telling anybody your dirty secret unless Steve's little boy band decides to go on another killing spree. And, hey, no hard feelings about leaving me to die in Siberia, I'm sure you had your reasons.\" Tony knew his sharp grin communicated that there were still all the hard feelings.\nT'Challa was back to looking tired, and much older than his years. He was probably finding that kinghood was not all it was cracked up to be. \"Please accept my deepest apologies for that, Dr. Stark. Mr. Rogers told me that you were fine, just 'cooling off,' as you will. I never should have taken the man at his word on something so important. My only excuse is that I was not thinking clearly after the death of my father, but I understand that it does not actually excuse my actions. Please know it was not maliciously done.\"\nTony studied him, but didn't see any lie on his face. He seemed genuinly regretful. \"Hey, don't beat yourself up too much about it. We've all been fooled by those big blues once or twice.\"\nT'Challa inclined his head. \"You are much too gracious,\" he murmured, and Tony snorted. Gracious wasn't a word that he had ever heard applied to him before.\n\"Did you call to discuss the rogues?\" T'Challa asked after they'd both had a moment of contemplation, and Tony shook his head.\n\"Nah, they're old news. I actually called to ask you a question.\"\n\"Whatever you ask, I will answer to the best of my ability and with full truth and disclosure where I am able.\"\n\"Do you still believe in the Accords? That they're the right thing to do?\"\nT'Challa looked taken aback for a moment, probably not expecting that to be his question, but then his face went serious. \"Dr. Stark, both my father and myself were proponents of the accords. We believed that superheroes need accountability, and checks and balances. I know my actions after my father's death were...not in line with that. I can only say that I'm deeply ashamed, and I am paying the consequences without complaint.\"\nTony hummed. He had caught up on what the UN had decided regarding T'Challa's actions during the 'Civil War.' He was paying hefty fines, and Wakanda had offered up some of its medical technology and experts to assist with those who were injured in Bucharest. A heavy blow, to give away those secrets for nothing. T'Challa's actions had cost his country a lot of political capital.\n\"And the leeches you acquired?\" Tony challenged. He didn't exactly want to discuss Rogers and Co., but he needed to know if T'Challa believed that they were above reproach, above the law, and hell, basic human decency. So was I.\n\"That was due to a misunderstanding. I offered Barnes sanctuary to make up for my persecution of him despite his innocence in my father's death.\"\nThe subject of Barnes and dead fathers made Tony's limbs go numb and tingly, and even with years of practice keeping his public facade on in the face of crushing emotion, T'Challa still must have picked up on his distress, because he sent him an apologetic grimace.\n\"He accepted, and Rogers...\"\n\"Oh, yes, Rogers must have decided that your hospitality was something he was just owed. Typical.\"\nT'Challa inclined his head, though he was visibly frustrated. \"They are not...the most gracious of guests,\" he admitted. \"At this point I am just doing my best to keep an eye on them. Other than breaking their friends out of the Raft, they've agreed to stay put or lose their sanctuary here.\"\n\"And you actually believe him? Cause let me tell you, kitty cat, he's not exactly Mr. Trustworthy once he decides to be self righteous.\"\nT'Challa's lip quirked up on one side. \"I'll keep that in mind. But, yes, considering Mr. Barnes would lose his sanctuary as well should they break their word, I believe he will behave.\"\nTony's lip twisted into a moue of distaste before he could stop himself. Well, it's not like he wasn't aware that Ste - Rogers put Bucky above everything else, the reminder just sucked.\n\"Right, so what you're saying is that you won't secretly be trying to undermine my work on the Accords while cackling maniacally with Rogers in secret if we start collaborating.\"\n\"Ah. No, that is not something you need worry about,\" T'Challa said, lip quirking. \"I would, in fact, be delighted to work with you. The Accords were always a work in progress, and I'm afraid that the past few months have only made the public more afraid. If we do not act swiftly, they may become a tool for persecution instead of accountability.\"\n\"Couldn't have said it better myself, Princess Meow.\" T'Challa raised an eyebrow at the nickname but didn't say anything. Apparently being left for dead by the king of Wakanda gave you some leeway with said king.\n\"Alright, I'm sending you what Colonel Rhodey, Hope Pym and I have been working on,\" Tony said. \"Look it over, let me know what you think, and send me anything you've been working on. Then my lawyers, Hope's lawyers, and your lawyers can meet and have a big, sharky party.\"\n\"Alright, Dr. Stark. I look forward to it.\" T'Challa hesitated before continuing. \"I am glad to see you looking well. I was...concerned when you did not surface after Siberia, especially after viewing the videos. Again, I'd like to offer my deepest apologies. If there is anything that I can do for you, please don't hesitate to ask.\"\nTony narrowed his eyes at him, but as far as he could tell, T'Challa was sincere. \"Well,\" he said, \"there is a project that I'm collaborating on with some of the smartest people of our time. I'm sure that input from some of your own renowned scientists would be very helpful.\"\nT'Challa sat back in his chair and studied him, face shrewd. \"Hmm. A collaboration between Stark Industries and Wakanda. Send me the information - I'll sign whatever NDAs you deem necessary. I'll let you know if it is something I think we could help with.\"\nTony inclined his head, hoping like hell he wouldn't be betrayed again. Thanos was coming, though, and Tony couldn't waste time with his trust issues. They would need the whole world to come together to fight the threat, and the sooner they started, the better.\n\"You got it. Till next time, Daniel Tiger.\" He cut off the connection, and spent some time just breathing. If he was really going to head up a multinational scientific collaboration, he was going to need Pepper's help.\n\"Friday, call Pepper,\" he said, then prepared himself for yet another emotionally charged conversation and some judicious sucking up.\n000\nTony couldn't help but be grateful for the distraction The Guardians of the Galaxy provided as he clawed his way out of the dark hole he'd been in. At least he knew he had hit rock bottom - it was only up from there.\nPepper flew out after their initial phone call, and after giving him a piece of her mind, pulled him into a hug that lasted almost five minutes. Then she and Rhodey had helped him pour out every drop of alcohol in the tower. Pepper had put together a list of possible therapists that were willing to come to the tower and keep all files regarding Tony Stark behind firewalls that he personally built to reduce the chance of somebody hacking in and stealing them.\nIn the end, he chose an elderly black woman who specialized in PTSD and cognitive behavioral therapy named Dr. Sandra Malone. She was intelligent enough not to be distracted by his bullshit, and kind enough not to call him on it. He'd already met with her once, and it had been...not as terrible as he thought it would be.\nThe Guardians weren't exactly what Tony expected when he thought about what the next aliens to make contact with Earth might be like. Rocket had followed him down to his workshop one day, and spent a good amount of time belittling his tech. He'd then let Tony tinker with his guns and pod so that he could see what 'real technology' looks like. Tony was fascinated - what Rocket was showing him was beyond anything he'd ever seen.\nRocket's smugness faded, however, when Tony immediately came up with three upgrades to improve his weaponry once he understood the basic mechanics. It only took him about twenty hours of poking and prodding and running tests with Friday to get there.\n\"So this element powers the blast,\" he said to himself, \"and it's a self-sustaining source. Hey, do you think that you could get me some of this and bring it back when you return to Earth? I could probably make some weapons to counter the Chitauri...\"\nHe drifted off as he read through the data he had collected from the tests he'd done on the materials. \"I can give you...huh, I guess money won't work. Gems? Is there anything on Earth that would work as currency?\"\n\"Uh, gold is pretty universal,\" Rocket finally said. \"Gems, yeah, that too.\"\n\"Great! Fri, get us some gold and gems to hand off to the Guardians. Holy shit, I can't believe I'm about to get a bunch of alien tech,this is fantastic,\" he said. \"Seriously, you're way better than E.T.\"\n\"Uh, thanks?\" Rocket said, scratching the back of his head.\n\"Oh, I know what we're watching tonight. Hmm, come explain this to me, Eddie,\" Tony said, ignoring Rocket's grumbling about how he couldn't ever just use his actual name.\nQuill had pulled Tony aside after his quip about where Rocket came from, and explained the creature's past. After that, he'd steered away from jokes about his raccoon-hood, outside of his usual nicknames. Even he knew better than to make fun of somebody's past as a subject of experimentation. Mostly.\nThe first time he and Rocket had tested out one of Tony's adjustments to his gun, they'd blown through a wall and ended up buried under a pile of drywall. When the Guardians and Rhodey rushed into the large shooting range, Rocket and Tony were both covered in a layer of white dust and laughing uproariously.\n\"You're alright, Iron Guy,\" Rocket said, bearing his sharp little teeth in a grin.\n\"Right back at you, Rocket Man,\" Tony said, chest warming without his permission at the show of acceptance. \"Now, let's see if we can make the gun's blast keep the power upgrade but with a little less, uh, explosiveness.\" He met Rocket's eyes and they both broke down into Manly Giggles.\n\"Oh god, there's two of them,\" Quill said, but he was grinning as he said it. Rhodey just sighed.\n\"Don't kill yourselves,\" he said, but ended up sticking around and getting sucked into the wonders of alien tech for the next four hours.\nTony, his houseguests, and Rhodey spent long nights discussing Thanos' army - their weaknesses, the size, and patterns of attack. Just because Tony wasn't ready to let others in on the upcoming threat didn't mean he was going to sit on his hands.\nTony had to fight the urge to go out and get a drink when he realized on the third day of their stay in his tower that he was jealous.Jealous of their dynamic, of the obvious affection they held for each other despite their constant sniping. They were what Tony had thought the Avengers were to each other, to him.\nWhere his ex-teammates' insults towards him had always carried an edge, that disregard and borderline disgust wasn't present with the Guardians. It was yet another wakeup call in a long series of them on just how blind he'd been.\nQuill spent a day letting him play with his mask and the thrusters on his boots. They'd somehow ended up having a 'hover-off' that lasted twenty minutes, Tony in the suit's boots and gauntlets and Peter in his usual setup. It had ended in a tie when DUM-E sprayed them both with a fire extinguisher.\nGamora was more difficult to get a read on, but Tony had a soft spot for her due to the connection she seemed to have formed with Friday. His AI hadn't had a lot of experience with women, as Natasha tended to ignore her unless she needed something and Pepper wasn't around a lot since her 'birth,' since that had been around the time they'd called their romantic relationship quits.\nHe'd walked in on Friday and Gamora having discussions ranging from Earth armor and weapons to the mystery that was 'pop culture.' His favorite was probably listening to Friday trying to explain YouTube.\n\"So people record themselves talking, and others simply...watch them talk?\" Gamora said, narrowing her eyes at the H3h3 video that was playing in front of her. \"Do they teach useful skills?\"\n\"Sometimes,\" Friday replied. \"Other videos are more for entertainment, though I admit that I don't understand why some of the YouTubers are so popular.\"\nGamora frowned as Hila sprayed Ethan with gold paint. \"I do not understand. Is this sexual in nature?\"\n\"...I don't believe so, Ms. Gamora, though they are married.\"\nTony had backed out of the room, deciding to leave Friday and Gamora to their exploration of a culture that revolved around the concept of open content.\nDrax ended up shooting one of Tony's refurbished roombas three days after the death of his toaster. Rocket had dropped cookie crumbs on the living room floor while they were watching The Princess Bride, and Tony's little bot had beeped happily before zipping over.\nDrax had startled, then whipped out a pistol and shot it four times, leaving large holes in the hardwood floor and Tony's poor roomba as nothing more than a mass of shrapnel and wires.\n\"Yeah, big guy, that wasn't actually for shooting,\" Tony said once his heart stopped trying to pound out of his chest and the armor that he had engaged at the sight of somebody drawing a gun and shooting it in his living room was back in its case. \"You killed my roomba.\"\n\"This Roomba was a living thing?\" Drax asked, horrified. \"Have I killed one of your children?\" Drax had taken to calling Friday Tony's daughter after he explained she was aware, and that Tony had created her, and when neither Friday or Tony denied it, the others had followed suit.\n\"No, no, calm down, it's not like Friday,\" Tony said. \"It was just a cleaning bot.\"\nDrax had solemnly offered one of his guns to Tony in reparation, and hadn't taken no for an answer. Tony had been a little surprised - people always seemed to take for granted that he could afford to replace any of his things that they broke. Which, to be fair, was true.\nBy the time they left, Tony reluctantly admitted to himself that they were making a place for themselves in his affections. Rocket was, despite his crankiness, incredibly intelligent and enthusiastic about Tony's creations, especially the suit and arc reactor. Quill was a goofball with a heart of gold (that all came in a very nice package), and Gamora was just as terrifying as Tony had always assumed, especially when he learned of her past as an assassin. Unlike the other female assassin in his acquaintance, however, Gamora didn't have the manipulative core that the Black Widow carried from her training in the Red Room.\nDrax was loyal, and despite his inability to understand metaphors, he wasn't an idiot, either. He was also achingly honest in a way most people couldn't be if they tried. Tony had a feeling that if he was ever in mortal peril, Drax would come to his aide guns blazing without a second thought or, more importantly, any expectations or ulterior motives.\nDespite telling himself not to get attached to them too quickly, he couldn't help the fondness he felt for the four aliens. He had learned his lesson, though, and wouldn't allow them to take advantage of him. Probably. Hopefully. Rhodey and Pepper had promised to let him know if he was falling into bad habits again, and he had promised to listen. So far they hadn't said anything against the Guardians, so he would trust that it wasn't another situation like with the last group he'd housed.\nHe knew that they had three more teammates - Gamora's sister, Nebula, a woman named Mantis, and...a teenaged tree person named Groot, who were off resupplying. From the way they talked about them, with fond exasperation, he assumed they were just as close to the group as the four that were staying with Tony.\nWhen the day came for them to climb back into their pod, which had a handy dandy cloaking device, Tony felt both relieved to get some time on his own, and sad to see them go.\n\"Well, Iron Man, we'll see you in three months. Don't fall off the wagon,\" Quill said, clapping him on the shoulder. Quill and Gamora had immediately picked up on his goal to be sober, and had been not-so-subtly steering him away from any situation that could end in him taking a drink. Tony hadn't minded much, since there was none of the judgement in their gazes that he'd become used to seeing on the faces of others.\n\"I see no wagon,\" Drax said.\nTony chuckled, and waved them into their little carrier ship. He tried not to feel too empty after their pod took off. He didn't have time for melancholy. He had the very important task of bringing Tony Fucking Stark back to life.\nThe next eleven weeks were spent in a flurry of activity. His first act was to hold a press conference, where he assured the public that he was alive, and revealed his plans to continue his work on the accords with the help of King T'Challa and Hope Pym. Her father had been less than pleased, but Tony had quickly discovered that Hope wasn't the type to let him tell her what to do.\nVision returned from wherever he'd gone on his sojourn after the whole Civil War disaster, and had requested to also be involved. Tony, Hope, Rhodey and T'Challa presented their suggested amendments, along with their plans to build a new team of earth's defenders from the ground up.\nThe Assembly, for the most part, took it well, probably relieved to still have superheroes that weren't running around committing acts of terrorism. After three weeks of debating and editing, they ratified most of the New Avengers' suggested amendments, and gave them the go ahead to begin recruiting.\nInstead of trying to fight all of the battles alone while the rest of his team stuck their heads in the sand, Tony could split his attention. Gone were the days where he was expected to handle the press, the tech, the funding, and somehow be the CTO for a multinational corporation and a superhero. It was exhausting just thinking about all the hats he used to wear for the Avengers.\nWakanda and SI had announced plans to partner in technology focused on the defense of Earth from outside forces such as the Chitauri. They brought in outside scientists including Jane Foster and a few other renowned astrophysicists, and the reception was much more positive than Tony had been anticipating, considering his last such project had resulted in Ultron.\nPart of that could be because Tony had quietly released proof that Wanda had been partly responsible for that disaster at the urging of Pepper and Rhodey. If he was going to defend Earth, he needed the world to trust him - which meant no more taking the fall for his ex-team.\nSo while Tony was partly absolved of that mess due to mind manipulation, the public had started screaming for Wanda's blood. The New Avengers were now required to pass psych evaluations every six months to stay on active duty, to make sure that you needed more than just some superpowers to make it onto the team.\nTony and Hope held another press conference, this time revealing their plans to rebuild the Avengers Initiative with new faces under the purview of the Accords. A sound bite of Tony supporting a UN sanctioned team of superheroes was played for weeks across various news channels.\n\n\"We know that Earth needs somebody to stand between it and forces such as the Chitauri or HYDRA. In the past we've done this through independent groups of super powered or metahuman forces. That ended in disaster. This time, we want to try it with the cooperation of the people we're supposed to be protecting.\"\n\nHope went on to a talk show to go over what it meant for metahumans to sign the Accords. It mostly consisted of: No, they weren't expected to blindly follow orders, not with the new amendments that had been pushed through by T'Challa, Tony, and herself.\nIf they weren't comfortable with a mission, they could refuse. No, they could not be illegally locked up as had happened with the Avengers under Secretary Ross - who was facing charges for his actions thanks to new evidence that had come to light courtesy of an anonymous source. They would be afforded the same human rights as the average human.\nBy the time the Guardians came back exactly three months after they had left, a few new members had been added to the Avengers Initiative, which the press was calling the New Avengers. Tony hated it, hated that it was still tied with his old group in any way, but hadn't had the time or energy to do anything about it.\nCarol Danvers and Kamala Khan had just been approved as full time members. Black Panther was a part-time member, as he was busy with running his country. Tony had asked for a special amendment for superheros who needed to keep their identity hidden so they could keep their family safe. Under it, Spiderman was also considered a part-time member, though he could not be approved for field duty until he was eighteen. Until then he would practice with the team and only be used in extreme emergencies.\nCaptain Carol Danvers, also known as Warbird, was unanimously voted in as the new leader due to her experience in the Air Force. Tony and Rhodey would split the role of second in command - Rhodey in the field and Tony off of it. It was a little weird, but so far it worked for them.\nThey'd already slapped down a doombot invasion and wanna-be sorcerer that released a bunch of overgrown slug-like creatures in Brooklyn, without the usual collateral damage that had come to be associated with the Avengers. For the first time in a long time, Tony felt hope.\nWhen he stumbled up to the roof at three am after Friday informed him that the Guardians had returned, he did not expect Quill's first words to be, \"Grab your suit, we need your help saving a planet.\"\n000\nThree weeks later, Tony stood in front of the Assembly. There was silence after Tony explained where he'd disappeared to for almost a full month.\n\"Are you saying,\" the delegate from Japan asked in only slightly accented English, \"That you disappeared without a trace because you were abducted by aliens so that you could help them prevent the destruction of a planet in a different galaxy?\"\nTony rubbed the back of his head sheepishly. \"I mean, abduction is such an ugly word. It's more like they borrowed me.\"\n\"And why, Dr. Stark,\" the current chair woman of the Accords council Bahula Reddy, the delegate from India, asked, \"did they chooseyou?\"\n\"Oh, well, apparently, as a result of the Battle of New York, I have a bit of a reputation as an intergalactic hero,\" he said breezily, then gave a what can you do? shrug.\nMore silence, then Chairwoman Reddy spoke again. \"I think, Dr. Stark, that you should start from the beginning.\"\nTony loved the Milano from the first moment that he saw it. Well, of course he did, it was a spaceship. He and Rocket spent the first full day talking in rapid fire about the technology that allowed it to work, with the rest of the crew looking on in amusement.\n\"For a Terran, you aren't too stupid,\" Rocket admitted as Tony helped him with repairs.\nHe had met Mantis, Nebula, and Groot. Nebula was a bit of a Cranky Cathy, but she didn't seem likely to kill Tony, so he mostly ignored that. Mantis was a little weird with her antennae and wide eyes, but sweet enough. Groot was hilarious, and Tony was pretty sure he had never met a tree he liked more.\nThe planet they were off to save was in actuality a moon, and had apparently been taken over by honest to god space pirates. The governing assembly was being held hostage, and the generally peaceful farming planet didn't have their own militia to counter them.\nThe pirates were threatening to blow the moon if they didn't get a list of demands delivered to them. The resources that came from the moon fed most of the system it was a part of, and would result in a serious shortage of food if it was destroyed. The Guardians had been hired by a few other planets in the system to remove the threat.\n\"This will be a great way to reintroduce you to the Galaxy,\" Quill said. \"Prove that you aren't just a one trick pony. Especially with that team you got back on Earth. So just, don't fuck this up, huh?\"\n\"Sure, no pressure,\" Tony grumbled.\nThe plan was for Gamora and Mantis to sneak into the government building where the hostages were being held while Tony and Quill worked together to form a distraction outside. Then, Mantis would use her freaky emotion powers to calm down the hostages and pirates alike so they could hopefully evacuate the civilians.\nRocket and Nebula were going to disable their ships, and Drax and Groot were going to help keep the civilians safe once they were evacuated. It was a good plan. Of course, it all fell apart.\nA few of the space pirates were apparently some race that was immune to mental and emotional manipulation (and that was how Tony found himself envying space pirates). Tony ended up blasting into the building to help cover the civilians' escape, drawing fire as he went. He grimaced when he saw a pile of bodies, obviously having been dead for a few days, as he blasted two aliens with three arms and what looked like clawed feet before they could shoot down the fleeing people.\nHe whistled appreciatively as Gamora took down five of them with her swords - he was pretty sure she was faster than even the Widow. On his other side, Quill blasted in, coat flaring around him, and started shooting down more pirates as they filtered in. Just how many of the things were there?\nDrax, Groot, and Gamora eventually got the civilians clear, and Rocket and Tony were bent over the bombs, talking in fast shorthand as they diffused them. When it was done, of course with only seconds to spare, Tony sat back on his heels with a sigh of relief.\nThat's when he caught movement from the corner of his eye. He had stepped out of the suit so that he could use his hands and work as quickly as possible on defusing his bomb, so he was vulnerable. His head whipped over to see what had caught his attention, and he relaxed when he saw it was a little girl, hiding behind the pile of bodies. He gritted his teeth, supremely glad that all of the pirates were dead.\nShe was obviously alien, though humanoid in shape. Her limbs, body, and neck were longer than that of a human's, and thin and graceful. Her skin was a deep blue, and was covered in tiny, pearlescent scales. Her eyes were big in her thin face, though Tony couldn't make out their exact color since she was fairly far away. Her hair was long and shimmery, and the color of freshly spun silk.\nHis gaze moved down to her hand, which was clutching something. His heart clenched when he realized it was another hand, the skin same color and texture as hers, though muted in death.\nProbably one of her parents, he thought to himself.\n\"Hey there,\" he said softly when he saw she was staring at him with wide eyes. \"My name is Tony.\"\n\"Who the hell are ya - oh,\" Rocket said from where he was checking that all of the space pirates were, in fact, dead. \"Shit. Uh, Quill?\" he said into their shared comms. \"We got another civilian. A little girl. Looks like she's Bilan.\"\nTony filed the word Bilan away for further study later. \"Okay, why don't you come over here?\" He held out his hand, not moving forward after taking in her wary body language. One cheek was swollen, and he kinda wished all of the pirates weren't already dead, so that he could kill them.\nIt took a few minutes, but eventually she let go of the dead person's hand and slowly made her way over to him and slid her palm into his. Her skin was softer than he had thought it would be, but then he wasn't an expert on what scales were supposed to feel like.\n\"That's good,\" he said. \"Do you have a name?\"\nShe continued to stare incomprehensibly at him. Finally, she spoke in broken English. \"I am Jontan,\" she said. The 'J' was pronounced with almost a french inflection of 'jha.'\n\"That's a pretty name. I'm Tony Stark.\"\n\"Tony...Stark,\" she said haltingly, and he nodded. Actually, he was suddenly curious about everyone's apparent understand of the English language. Why hadn't he thought to ask about that before?\n\"That's right. Listen, I'm going to take you out of here, alright?\" She nodded, and he picked her up, waiting until she had wrapped her long limbs around him to stand.\n\"Okay, why don't you put your face in my shoulder and close your eyes?\" he said gently. For a moment he thought she'd refuse, but then she did as he was told.\n\"Come on\" he said to the armor.\nThere was no Friday in space - something he'd have to fix before he went on another jaunt away from the Earth, but there was enough rudimentary programming in the suit even without her that it followed him out. He ignored Rocket's grumbling about how creepy it was, instead focusing on comforting the shaking girl in his arms as he made his way through the carnage, making sure she kept her eyes shut the whole time.\nIt took awhile, but eventually they got all of the civilians calm enough to have a conversation with them. Quill had gone to talk with the surviving governing body, and from the way he was gesticulating wildly and yelling while they shook their heads at him, it wasn't going well. Finally, Quill stomped over to them, his face a mask of anger - the first time Tony had ever seen that particular look on his face, actually.\n\"What's up, buttercup?\" Tony asked from where he was sitting on a bench that had escaped damage, the girl asleep against his chest.\n\"The only family that Jontan had was her mother, and she died before we got here. Dammit,\" Quill said as the rest of their party joined them to stand in a loose circle around Tony.\n\"Uh, well, I'm assuming you have some sort of foster care system set up for orphans?\" They all exchanged annoyingly meaningful looks before Gamora answered.\n\"They do, but...\"\n\"Okay, what don't I know?\" Tony asked.\n\"The girl is a race called Bilan. They're generally looked down upon by other races due to their history of being used as prostitutes,\" Nebula said frankly. \"Nobody will take her in, and if they do, it won't be out of the goodness of their hearts. They'll mostly likely coerce her into prostitution once she reaches maturity.\"\nTony gaped at the woman, then looked over at the others, who weren't arguing. \"And that's considered okay?\" He finally asked, arm tightening around the girl.\n\"Of course not!\" Gamora snapped. \"Out here, on the edges, it's difficult to uphold civil law. And the Bilan have been subjugated for centuries due to their ability to...enhance sexual pleasure via the transference of certain chemicals during coitus,\" she finished blandly.\n\"I...what?\"\n\"Her mother was selling her services here as an independent contractor,\" Quill hurried to say. \"Totally legal and above board. But now that she's dead, they'll probably send her to one of the main planets. I doubt she'll be treated well.\"\n\"Huh. I guess racism and asshole behavior can be found everywhere. Well, we obviously can't just leave her here,\" he said, anger boiling under his skin at the thought of somebody mistreating a child simply because of her biology.\nThere was silence for a moment, and Rocket looked from one face to another. \"You cannot seriously be suggesting we take the kid with us,\" he said.\n\"Well, Groot could use a friend closer to his age,\" Quill said.\n\"I am Groot!\"\n\"I don't want to leave her here,\" Mantis said in a small voice. For some reason, that got everybody's attention. Rocket's shoulders slumped.\n\"Fine, great, let's adopt a kid, good idea.\"\n\"We aren't adopting her. We're just gonna take her with us until we find her a good home.\"\n\"Uh huh,\" Rocket said, obviously not believing a word of it. And that was how Tony ended up designing a bedroom on the floor he'd set aside for the Guardians for a preteen alien girl to sleep in.\n\"So, just to sum this up, Dr. Stark,\" Bahula Reddy said, the strain around her eyes obvious, \"These...Guardians of the Galaxy showed up, asked for your assistance in saving a moon, and then told you they've come to Earth to help us prepare for another invasion from the Chitauri. One led by an insane godlike being who wants to kill all living things in the Universe so that...Lady Death will fall in love with him. Did I miss anything?\"\n\"Oh,\" Princess Shuri said, \"don't forget the part where Iron Man plays a pivotal role in convincing the different governing factions throughout the settled universe to aid Earth instead of stealing the weapons this...Thanos character is after and letting him destroy us in order to buy themselves time.\"\nTony offered a charming smile. \"Actually, about that,\" he started, cutting off the grumbles before they could really get started. \"I thought we could shift that focus a little. Instead of using just Iron Man, we could maybe try and get them behind the New Avengers in general.\" he wrinkled his nose. He still hated that name. \"We've been working on building them as Earth's defense against just this thing.\"\n\"Perhaps,\" Reddy said, \"if we have you as the leader of said team...\"\nTony raised an eyebrow. \"That's not really something this council can decide,\" he said firmly. \"It was put to a vote, and Carol Danvers was made the leader. I give the Initiative my full support, but I have no interest in leading them in the field. Captain Danvers has a lot more experience there than I do, and she doesn't have the type of history that could turn public perception against us.\"\n\"Agreed,\" Shuri said before anybody could say something stupid. Tony liked her. \"Well, I for one would like to speak with these 'Guardians.'\"\nTony grinned, more teeth than mirth. \"I thought you'd never ask.\"\nTony leaned back against the couch and rubbed a hand over his face, ignoring the concerned looks the rest of the room's occupants were sending him. He had been stretched thin the last month. Between running interference for the Guardians, working with the Assembly on treaties to offer races from other worlds, getting the administrative side of the New Avengers set up, ane being the CTO of an international corporation, he was running on fumes. This time, however, his team didn't leave it all in his hands. This time he had help.\nCurrently they were going through lists of possible recruits. They had four files pulled up in front of them - Jessica Jones, Luke Cage, Matthew Murdock, and Danny Rand. Tony had been keeping on eye on them for the past few years, though he'd never approached them.\n\"From what I can tell, Boss, they aren't big fans of the Avengers Initiative,\" Friday said. \"Though the threat of the extermination of every living thing on Earth might be a good motivator,\" she finished wryly.\n\"Right. We can probably get them to join the...New Avengers on a temporary basis, at least. Rhodey and Shuri are working on something for a situation like that right now. Murdock will want to keep his identity a secret, at least, but we have precedence with Spiderman.\"\n\"You really hate that name, huh?\" Peter (he'd been Peter, not Quill, for a few weeks now) said suddenly from where he was sprawled on the couch next to Tony. He blinked at him, getting a little distracted by the man's broad chest and sturdy thighs, which were spread just a bit.\n\"What?\" He asked a little stupidly, and Quill gave him a slow smile, obviously having caught on that Tony was checking him out. He just raised an eyebrow, unashamed. Hey, the guy was hot.\n\"The New Avengers. You make a face - yes, that exact one - whenever somebody says it.\"\nTony just shrugged and looked down at his tablet, uncomfortable with the direction the conversation was going. \"Yeah, well. It's just a name.\"\n\"No it's not,\" Hope broke in. Tony looked over at her. She'd removed her shoes, and was sitting with her feet tucked under her and to the side, blouse sleeves rolled up and hair slightly messy from running her hands through it. \"I doubt you're the only one who has such a visceral reaction to the name. Actually, I've been wondering for a while if it might be better to...change it,\" she said with some hesitation, and Carol hummed from where she was sitting cross legged on the ground.\n\"It's not a terrible idea,\" Rhodey said with a yawn from Tony's other side.\n\"What would we even call it if not the Avengers?\" Tony grumped, tired and wanting to finish the meeting so he could go to sleep.\n\"Well,\" Carol said, then stopped. Tony made a 'go on' motion, and she straightened her shoulders. \"If it weren't for the Guardians of the Galaxy, Earth would have been screwed. One set of aliens would have invaded us to steal the stone that is part of our defense system to make way for another alien race to finish the job.\"\nRhodey perked up from Tony's side. \"Are you saying what I think you're saying?\"\nCarol shrugged. \"What better way is there to honor the group of people who put their faith in us instead of writing us off like the rest of the Universe than by using their name?\"\n\"You want to rename the New Avengers to Guardians of the Galaxy? Won't that get confusing?\"\n\"What about just The Guardians?\" Peter said, sitting up, face brightening.\nTony looked over at him. \"You're okay with this?\"\nPeter shrugged. \"You're our team now too. I think it'd be pretty cool to share a name.\"\nTony stared at him. \"Oh,\" he said, voice coming out a little smaller than he meant it to. \"That's...yeah, okay. I like that.\" And if he and Quill spent the next ten seconds staring stupidly into each other's eyes, well. Nobody commented on it.\nTheir moment was broken by Friday's voice. \"Boss, Jontan woke up from a nightmare and is looking for you.\"\nTony frowned and exchanged a quick glance with Quill. It wasn't unexpected that she'd be traumatized by her experience, and in the first few weeks she'd slept in Gamora's bed every night.\nSandra, his therapist, had been a little taken off guard when he'd asked her to add Jontan onto her schedule when she visited the tower, but she'd done so willingly enough. He had a feeling being the first ever therapist to an alien would be a feather in her cap.\nThings had been improving, though. It had been three full nights since her last nightmare. \"Send her up, Fri. Where's Gamora?\"\n\"Ms. Gamora is currently finishing up a workout. She will come to the floor after she finishes washing up, and is fine with Jontan sleeping in her room.\"\n\"Thanks,\" he said, leaning back.\nCarol muttered something across the room that sounded suspiciously like a fantasy about gutting space pirates, but then the elevator was dinging open and a blur of blue skin and white silky hair was darting across the room. She dove onto Tony, wrapping her arms around his neck and burying her face into it.\nShe had angled her body so that it was nestled half on him, half on Peter - and when had they gotten so close? He was positive they'd started out with a few inches of space between them - and her body was shaking.\nTony had been more than a little surprised when Jontan had decided that he was her preferred adult. She followed him around whenever possible, and always headed to him for comfort first. Peter had immediately become a close second, with Gamora right on his heels.\nHaving a preteen girl sitting quietly on the couch in his workshop, watching him as he tinkered with undisguised interest, had been a little disconcerting at first. Then he'd remembered that education was a thing that she needed, and had Friday come up with a learning program for her. Now when Tony was working, so was Jontan, though her work involved math problems and reading literature and identifying microorganisms through a microscope.\nIt was pretty damn adorable. Then Peter started joining her on the couch, though he wasn't as quiet as her by any stretch of the imagination. Instead he'd flit between them, poking at Tony's projects and gently teasing him, then wandering over when Jontan had a question to gently talk her through it, or, more often than not, have Tony, Rhodey or Friday talk her through it.\nPeter was intelligent, but he hadn't learned half the useless shit that Americans taught their students. Tony didn't let himself consider why he decided Jontan would have an Earth education. It was almost like he was assuming she'd stay, and he had no doubt that she'd be leaving with Guardians once they'd defeated Thanos. What did Earth have to offer a girl when she could travel the galaxy?\nTony rubbed his hand up and down her back and made soothing noises until her shaking stopped. Peter was running his hand through her hair, brow furrowed. Their team was silent as they went on with their work, apparently trusting Tony with a traumatized kid. It was heady, that level of trust. His old team wouldn't have let her within ten feet of him.\nAfter about fifteen minutes, Jontan leaned back, dark blue eyes still a little wet.\n\"Here,\" Hope said from next to them, a small smile on her face. In one hand she held a tissue, in the other a glass of water. Peter smiled and grabbed the tissue and got to work on Jontan's face, and Tony took the water, handing it over for her to drink once her face was free of snot.\n\"Thanks, Hope,\" he said.\n\"Yes, thank you,\" Jontan said, still a little shy around adults who weren't Tony, Rhodey, or a Guardian.\n\"You're welcome,\" Hope said, and smiled before heading back to her spot.\n\"Alright, so, was it a dream about Peter dressed in pink trying to convince you to eat brussel sprouts? Because let me tell you, I had that one yesterday, terrifying -\" Jontan had been introduced to brussel sprouts a week ago. She had been Not Impressed.\nShe giggled and shook her head. \"No! Peter would look good in pink, and he would never force me to eat the brussel sprouts,\" she said loyally. Peter had also not been a fan of that particular dish.\n\"What? Well, I guess you're right. So, hmmm. Was it Fri and Gamora watching YouTube again? Or maybe -\"\nJontan was shaking her head, still giggling. \"I don't know,\" Peter interjected, \"Maybe it was a memory of that time you wandered up from your shop after DUM-E sprayed you with oil, so tired that you just groaned the word 'coffee' over and over again while you shuffled around in circles.\"\nJontan looked delighted when Tony put a hand to his heart and gave an exaggerated gasp. \"I'll have you know I look good no matterwhat I'm wearing -\"\nJontan rolled her eyes, and wow, Tony was pretty sure he should stop letting her hang out with Kam, she was obviously a terrible influence. By the time Gamora came upstairs to collect her, she seemed to have mostly gotten over her nightmare, instead laughing at Tony and Peter's increasingly ridiculous guesses on what she had dreamed about.\n\"Alright, little one, it's time for us to go to sleep. Say goodnight,\" Gamora said, not unkindly.\nJontan stuck out her lower lip, but didn't fight the woman. Smart girl. She leaned over and gave Peter a kiss on the cheek and a hug. He grinned at her and ruffled her hair. Then she turned to Tony and hugged him, before also giving him a kiss on the cheek that made his heart squeeze in his chest.\n\"Goodnight, Tony,\" she said\n\"Night, squirt,\" he said, hugging her close before releasing her. She shuffled off the couch and moved over to Rhodey and gave him a small hug as well. She then grabbed Gamora's hand and waved goodbye to the rest of the room.\n\"Well, she's adorable,\" Hope said once they were gone, and Rhodey nodded.\n\"Yep, that she is. Takes after her Uncle Rhodey,\" he said with a shit-eating grin, and Tony rolled his eyes. Rhodey had been teasing him about he and Peter co-parenting a kid together for weeks, and had started insisting she call him 'Uncle Rhodey,' mostly to be an asshole.\n\"Yeah, yeah,\" he grumbled. \"Come on, let's finish this. The press conference is in two days, and we need everybody to be Facebook official by then.\"\nTony could only hope the world wouldn't panic about the upcoming alien invasion when they saw that they had their very own aliens on their side. They couldn't exactly keep this a secret - soon potential allies from other planets would start arriving to try and set up some sort of treaty with Earth, not to mention the emergency evacuation procedures that everybody would need to be aware of once the invasion began.\nThe whole thing had to be handled delicately, or they'd have riots in the streets. Pepper had offered to work on the PR aspect with Hope and the UN's team of public relations experts, but the New Avengers - the Guardians - still needed to have their ducks in a row.\n\"So we're going to need to adopt Jontan, or when the officials from international peacekeeping come and see her they'll think we're illegally holding her as a future sex slave,\" Peter said casually just as Tony took a drink of water.\nBy the time he could breathe again, he had decided that Peter was an awful, horrible human being.\n000\nThings were tense in the suite of rooms T'Challa had given the rogue Avengers. They had been tense for a long time, though Steve wasn't sure what to do about it.\nAt first, after he'd broken everybody off the Raft, they had been flush with victory, and high on their righteous anger. They had all been convinced that the world would realize they were in the right, that Tony was the one who had chosen the wrong side.\nThen the videos came out. Steve hadn't told his team everything that had happened - he hadn't thought it was important. After all, the fight had been about keeping their freedom to save the world without interference from governments with suspicious agendas. The personal stuff didn't play into it.\nClint had watched the videos, body getting more and more tense as they went on, eyes taking on a strain that had been present but not pronounced until that moment. Sam had stood and left the room, avoiding Steve's gaze.\nAnd Wanda - Wanda had looked happy. Steve didn't ask her if Tony's pain really delighted her so much. He wasn't sure he wanted to hear the answer. Three days later the Black Widow had shown up. It had taken Steve's black eye longer to heal than it usually would - that gal sure packed a punch.\nPeople were, of course, sympathetic to Tony, who hadn't yet made an appearance. Clint had spat out something about how he probably just wanted more sympathy, and if he showed his face, happy and perfectly fucking fine, that would all go away.\nScott had looked at Clint like he was crazy, but hadn't commented. Steve couldn't help but secretly agree with Clint, though he knew better than to say it out loud. The videos looked brutal, but he had made sure to keep his strength in check.\n\"He could be dead,\" Sam finally said, face still stony. He hadn't spoken to Steve for two weeks.\n\"We can only hope,\" Wanda spat, and Steve winced as Natasha's back stiffened.\n\"He's not dead,\" Steve said confidently. \"I didn't hurt him that badly.\"\nThe look Natasha gave him, full of pity and a sort of knowing, made his hands break out in a cold sweat. He wasn't sure whether or not he was thankful when she didn't comment.\nHe wished Bucky were there, instead of stuck in that cold tube in the labs. He stood, deciding he'd spend some time sitting next to him instead of listening to a veteran on the news call him a monster for leaving Tony behind.\nThe next blow was proof that Wanda had a bigger part than they'd thought in the creation of Ultron. She had only admitted to manipulating the Hulk, not Tony as well. At first, Steve had been angry, crossing his arms over his chest and asking her in a stern voice why she'd lied. After all, they were a team, they shouldn't lie to each other.\nScott had made a small choking noise at that, but still didn't say anything. It was odd. When they first met, the man wouldn't shut up. Now he seemed almost afraid to speak.\nWanda's eyes had filled with tears, and she'd begged him to forgive her. \"I didn't know what I was doing! I swear!\"\nSteve had softened, though he didn't let her out of the lecture. She seemed to properly understand what she'd done wrong in the end, so he wasn't too hard on her.\n\"Everyone hates me,\" she'd whispered the next day, watching as people marched with signs in the wreckage of Sokovia with signs that said Burn the Witch.\n\"Don't worry,\" Steve said confidently, \"We'll work it out when they ask us to come back.\"\nAt that point, Sam and Natasha had stopped coming into the common room, so it was only Clint there with them, who was staring at the screen with a blank expression. Steve knew that he was having trouble coping with being away from his family. He only hoped Tony would realize that he was wrong, soon, and start working on getting them home. He reached into his pocket and ran a finger lightly up the side of the phone there. He'd call. Steve knew he would.\nWhen Tony reappeared, looking perfectly healthy as he stood on a podium next to Hope Pym, Steve had actually gone weak with relief. Frustration followed shortly after. If Tony was fine, why had he disappeared for so many weeks? Did he think it was funny to worry his team?\n\"...Hope, T'Challa, Colonel Rhodes and I are rebuilding the Avenger's Initiative, with the help of the UN Assembly. We know that Earth needs somebody to stand between it and forces such as the Chitauri or HYDRA. In the past we've done this through independent groups of super powered or metahuman forces. That ended in disaster. This time, we want to try it with the cooperation of the people we're supposed to be protecting.\"\nClint threw a vase across the room and it shattered against the large screen of the television, cracking it and causing sparks to fly. T'Challa's sister, Shuri, had simply raised an eyebrow at Steve when he'd politely asked her for a replacement.\n\"I think, Mr. Rogers, that you can take this as a lesson. Once you break something, it cannot always be fixed or replaced.\"\nSteve had gritted his teeth, and sent her his most disapproving look. \"I know you don't like me much, Princess Shuri,\" he began, and she actually looked a little amused at that, \"but I'd hope that we could still act like adults. Also, I prefer Captain Rogers.\"\nHer eyes had narrowed at him. \"Adults don't break their host's televisions and then demand they be replaced. An adult would try to make reparations for his mistakes, not hide behind his titles.\"\nSteve had the feeling that they weren't just talking about a TV anymore. \"Also, I suppose you wouldn't know this, since your television is broken, but the United States military has revoked your status as Captain. From what I understand, it was only ever an honorary title - you didn't even make it through basic training, let alone officer training. So. Mr. Rogers, if you'll excuse me, I have work to do.\"\nThe two Dora Milaje that had escorted him to speak with Shuri when he'd asked stepped forward to flank him. He gritted his teeth, but followed them out, not wanting to cause a fuss in his host's home.\nSteve wondered if what she had said was true, but then dismissed it. Even if the military had fallen for the propaganda that the UN and Tony were spreading about him, they couldn't take away his identity. He was Steve Rogers, Captain America, and nobody could take that from him.\nThey ended up moving the smaller screen from Clint's room into the living room, and in the end had needed Natasha's help setting it up. Steve didn't know why everything had to be so complicated - what happened to the days where you just plugged it into the wall and turned the damn thing on?\nWhen they watched Hope go on to a talk show and explain the amendments to the Accords, Clint had scoffed. \"Right, like I'm going to believe that. Where were they when Ross had us on the Raft? Pretty telling that they only caught the guy after we escaped. Made him their fall guy, more like.\" Wanda was nodding along, but Sam and Natasha looked thoughtful. Scott was watching his girlfriend with pained eyes, and Steve had to look away. They'd all lost something, after all. Being a hero required sacrifice.\nT'Challa stopped by two days later, with stacks of papers in his hands. \"I thought you might be interested in reading through the updated Accords,\" he said, and put the thick stacks of paper on the table. \"I know you hope for pardons. If they come, you will no doubt be required to either sign or retire, so I suggest you become familiar with them. I will provide a lawyer to help you if you'd like.\"\nSteve had shot T'Challa a look of disapproval. \"You know that we aren't going to do that,\" he said gently. \"I had thought that you were on our side on this.\"\nT'Challa raised an eyebrow at him. \"I am on the side of the people and International Law. I made a mistake going after Barnes, and it is not one I intend to repeat. Read this, Mr. Rogers - you cannot stay here indefinitely, after all.\"\nAnd with that declaration, he spun on his heel and left, ignoring Steve's pleas to wait. What did he mean, they couldn't stay there forever? His teeth ground together. He had assumed T'Challa was an honorable man. He should have known that once he started working with Tony that would change.\nThings only got worse in the following months. Steve had politely asked T'Challa if he would be willing to provide them with weapons and a space to practice - possibly a new shield to replace his old one. T'Challa had refused, looking disturbed and surprised that Steve had even asked.\nHe wanted to leave, but wasn't sure where they'd go. He had watched on the news as horrible things happened across the globe, and countries refused to let the Avengers enter their borders. What was Tony doing? Didn't he see what was happening around the world?\n\"You were never interested in other countries' wars before,\" Natasha pointed out one day. She was perched on the back of the couch, cleaning her nails with a knife. \"Why are you now?\"\n\"Because I didn't know,\" Steve said, frustrated that Tony and Natasha had been aware of these things before and never said anything. He hadn't had time to watch the news and keep up with politics - that had been Tony's job, and to a lesser extent Natasha's. Nowadays, he had nothing better to do than watch the news, and the state of the world was disturbing, to say the least.\nNatasha had shot him an unreadable look before standing and leaving the room. Scott was staring at him like he'd seen a ghost. Clint was throwing knives at the wall. It made Steve cringe, but he knew that his anger would only result in more widespread destruction if he didn't have an outlet. He didn't want him to break their TV again, after all.\nSix months into their stay at Wakanda, they turned on the TV to watch a press conference on the Avengers Initiative that the UN had been publicizing for weeks.\n\"God, I wonder what stupid shit they're gonna spout today,\" Clint spat.\n\"More propaganda, probably,\" Wanda said. Scott sunk down into his seat, which was in a chair as far from Wanda as he could get. Steve had noticed with some disappointment that Scott had some sort of prejudice against Wanda after all those horrible stories about her came out.\nHe'd hoped that the man would keep an open mind, but, well. He was wrong, apparently. They watched as two newscasters discussed what the press conference would be about.\n\"Maybe they captured the Exvengers,\" the man said, and the woman smiled.\n\"I'm sure that we would have known before now - it's pretty tough to hide the destruction they leave behind when they fight.\"\nSteve glared at the screen, and put a hand on Clint's shoulder when he looked like he might throw something at the television again. Finally, the cameras panned in on the Tower, which Steve noticed with a jolt no longer had Avengers at the top. Instead, it was back to having the big, ostentatious STARK on the side.\n\"His ego is disgusting,\" Wanda said, and Steve just shook his head, unwilling to join in with the usual Tony bashing. He had made mistakes, but Steve still believed that there was a good man beneath his arrogant facade. He just needed help finding it.\nWhen they finally got a view of what Steve recognized as the room created specifically for press events at the tower, his breath caught in his throat. Tony was leaning over listen to something Carol Danvers was saying, face split wide in a grin.\nSteve took a deep calming breath. Of course, Tony would already be sleeping with the person that had subverted Steve's position on the team. He probably did it as a way to punish Steve. Tony was wearing one of his ridiculously expensive suits, and he seemed to have gained back the weight and brightness that he had lost over the past few years.\nGuess he's over his guilt for Ultron, now that he can blame it on somebody else, Steve thought to himself, shaking his head. He couldn't help the way his heart fluttered when Tony threw back his head and laughed, while Ms. Danvers rolled her eyes and gave him a light push to his shoulder.\nSteve had thought, at one point, that he and Tony might become something more than friends. He'd become distracted in his search for Bucky, but had always assumed that Tony would be there when he was done. That they could finally take the next step.\nNow he couldn't help but wonder if they'd ever have the chance. Why hadn't Tony just listened. If he had, Steve could grudgingly admit that the man would have come up with a way to get them home months ago. Tony always was good at cleaning up messes.\nSam's breath caught in his throat when Rhodey walked up on the stage, his braces that allowed him to walk obvious. Steve wished he'd let the guilt for that go - it had been an accident, after all, and he hadn't even been the one to fire the shot.\nRhodey took a seat in one of the chairs towards the middle of the table set up on the stage, which was covered by a white tablecloth and microphones. Behind him filed the now-familiar new faces of the New Avengers. Spiderman, still masked - Steve couldn't help but disapprove of that. What kind of hero was too cowardly to reveal his own face?\nKamala Khan, T'Challa, and Hope Van Dyne were next. Tony and Carol, still deep in whispered conversation, walked over to take their seats as well. Steve frowned when he saw seven empty chairs were still left at the table once Carol took her spot in the middle, Tony on one side and Rhodey in the other.\n\"There are empty chairs,\" Natasha said slowly. \"Why would they leave them empty?\"\nSteve sat up, hope beating wildly in his chest. \"Maybe - Maybe they're for us,\" he whispered. Maybe this was it, the moment they asked their prodigal teammates to return.\n\"But there's only six of us,\" Scott said a little doubtfully.\n\"Maybe the last chair is for Tony's ego,\" Clint joked, and Steve couldn't help the small chuckle he let out at that, mood suddenly lifted. They were going home.\n\"Alright,\" Carol said, voice as no-nonsense as the suit she was wearing. \"I'd like to get started. I ask that you please hold your questions for the end of the conference.\"\n\"First of all, we'd like to let you know that we've decided, as a team, that we should change the name of our initiative to better reflect the values and goals of those who are a part of it. We do not see ourselves as avengers, here only to punish those who take a shot at the people of this planet.\nInstead, we want to be protectors, a shield that strives to keep innocent people from harm. From here on out, we will refer to ourselves, and ask that you refer to us, as The Guardians.\"\nCarol Danvers had a strong, confident way of speaking, and Steve couldn't help but feel pulled in. The moment she announced that they would change the name of his team, though, his impression of her soured. How dare they?\nThere was a murmur from the crowd of reporters, but all it took was one firm look from the blonde woman and they subsided. \"Now, that isn't why we called you here today. We have a much bigger announcement to make.\"\nHere, Carol took a deep breath, looking nervous for the first time that day.\n\"You all remember the Chitauri invasion five years ago,\" she said. \"One that Iron Man was able to stop in its tracks by sending a nuke through the portal their army was using to enter Earth. Two months ago, a group of aliens, heros known across the Universe as Guardians of the Galaxy, made contact with Tony Stark.\nThey offered their assistance, and a warning. The Chitauri are going to return. And this time, with the help of our newest members, we're going to be ready for them.\"\nPandemonium broke out at that. Reporters were yelling over the top of each other, questions urgent and almost frantic, the fear palpable even from where Steve was sitting.\n\"Holy shit,\" Scott whispered. Then, \"Holy shit!\" He shot to his feet, panic on his face. \"I need to get home to my daughter. Fuck. Fuck!\"\nClint was on his feet as well, face white and lips pressed together. Steve took a deep breath and stood. \"Don't panic,\" he said in his best Captain America voice. \"If it's true, they won't try and keep us out of the fight. They'll need us. We'll go back and keep your family safe. I promise.\"\nScott scoffed, grabbing at his hair with one hand and pulling. \"Like a promise means anything from you,\" he said.\n\"Do not speak to him that way,\" Wanda said, also standing, hands turning red.\n\"Or what? You gonna mind rape me too, you crazy bi-\"\n\"Enough!\" Steve yelled. \"Wanda, stand down,\" he said. For a moment, he thought she wasn't going to listen. But then her hands stopped glowing and she sat.\n\"Tony's speaking,\" Natasha said, voice carefully bored, and they all turned back to the television, where the press had calmed and were now listening to Tony, who had stood and was holding out one hand as though soothing a beast.\n\"I know it's scary. Hell, for anybody who was there the first time, it's downright terrifying. But humanity needs to stick together for this one. Keep our heads - don't panic, and continue to treat each other kindly.\nWe're going to be okay, because we're not alone here. We're already making allies with other alien races, ones who want to see the Chitauri defeated just as much as we do. And we have intergalactic heroes on our side, too, ones with a history of saving the universe when things go wrong.\nSo, with that said...may I introduce you to the Guardians of the Galaxy?\" he said with a flourish, and Steve's heart sank as he realized those chairs weren't for his team, after all.\nHe sat down, hard, when they filtered onto the stage, the human man in a trenchcoat giving a jaunty wave. Behind him were men and women who were so obviously not from Earth that his mind had trouble wrapping around it. What was Tony thinking, entrusting the welfare of the world to aliens? Sure, they had Thor, but he was just one person on the team, a part time member at that.\n\"Say hello to Starlord, also known as Peter Quill, his second in command, Gamora, her sister Nebula. The gorgeous Mantis is next. After her is Rocket,\" Clint twitched when the racoon waved and grinned, \"Drax,\"\n\"Jesus,\" Sam whispered as the huge man lumbered over to his seat.\n\"And last but certainly not least...\"\n\"I am Groot!\" the walking tree said cheerfully.\nIt took five minutes to calm down the reporters in the room after that. The Guardians sat, Peter taking the seat next to Tony. Steve had to breath through an unexpected spike of rage when Tony smiled at him. Not his press smile, but a true, open one that Steve used to treasure every time it was sent his way.\nCarol had started to outline the UN Assembly's plans for building shelters for people, setting up evacuations for highly populated areas, and readying the worldwide militaries, who would be working together peacefully to face this new, alien threat.\nHe decided, then and there, that there was something untrustworthy about the Guardians of The Galaxy, and he was going to get to the bottom of it. Once he did, Tony would be begging them to come back. He just knew it.\nTony stared at the man lying next to him in his bed. Holy shit, he'd slept with Peter Quill. And not just everyday, scratching an itch sex. Oh no. They'd had emotional, stare into each other's eyes, slow and perfect making love sex.\nTony was fucked. He was so fucking fucked. When Peter decided to head off into space again, Tony would still be here on earth, in love with the man and alone.\n\"You're thinking too hard,\" Peter grumbled from next to him, and Tony glanced over, taking in the stubble around his usually perfectly-groomed facial hair and the way his hair was sticking up in all directions. He had a hickey on the elegant curve where his shoulder met neck, and Tony just wanted him all over again.\nIf the slow smile growing on Peter's face was any indication, the man knew it. He turned from his stomach onto his side so that he was facing Tony, propping his head on his hand. The sheet slid down his body to reveal his chest and abdomen, and Tony swallowed thickly.\nPeter reached out and traced his cheekbone with a finger.\n\"You regret it?\" he asked, voice light but eyes serious.\n\"No,\" Tony said firmly. \"No, I just...was thinking about what happens next.\"\n\"You mean, do we pretend it never happened, or go the opposite direction and elope? Because let me tell you, I'm in favor of the second.\"\nTony choked on his spit and spent the next couple of minutes coughing and wheezing. When he could finally breathe Peter had sat up and was leaning onto one hand, studying him with concern.\n\"Was that too much? Gamora told me not to push you. I'm sorry, we can pretend I didn't say anything. But, uh, if we could not do the thing where we pretend this never happened, I would prefer that, since I'm stupidly in love with you and - okay, I'm just going to stop talking. Actually, I think I'll just run away in shame, now,\" Peter said, cutting off his rambling in favor of turning to get out of bed.\nTony was just staring at him, gaping as he scrambled to pick up his clothes. He was hopping up and down on one foot as he pulled on his boxers, and Tony finally snapped out of his daze.\n\"Wait!\" he said, his voice scratchy from his coughing fit. Peter paused and glanced over his shoulder. Tony scrambled out of his ridiculously large bed and walked over to him.\n\"I'm not...I'm not fun to live with,\" he finally said, rubbing the back of his neck. \"I keep weird hours and I'm not always around and I - I make stupid decisions -\"\nPeter's face was lighting up with every word. \"That's not a no. I'm not hearing a no. And, uh, I've lived in your tower for like four months. I think your weird hours and stupid decisions and rambling are adorable. You just - you're amazing. You care about everybody and you try so hard and you're sexy as hell, and, yeah. The eloping thing, still on the table.\"\nTony stared at him. \"What about - what about when you leave?\"\n\"I won't,\" he said. \"I mean, I'll go do jobs and stuff, but I'll come back. If you want me too. I'll help you fight off baddies when I'm home, and we'll raise Jontan together, and...yeah.\"\n\"So just to be clear,\" Tony said slowly, disbelief and hope fighting a messy battle in his chest, \"you're asking me to marry you. Right now. And adopt a kid together.\"\nPeter beamed. \"Aw, sweetheart, you really are a genius.\"\nTony raised an eyebrow. \"I mean, I know I'm good in bed, but damn.\"\nPeter's face sobered, and he crossed the room picked up his coat, which had ended up thrown over the top of the dresser. And wow, he looked good in his boxer shorts. Peter reached into a pocket and pulled out a small velvet bag.\n\"So, embarrassing fact. I actually grabbed this from a shop on that moon we saved. I, uh, guess even back then I knew that you were probably it for me,\" Peter said with a self depreciating shrug. \"So while, yes, you are very good in bed, that's not why I'm giving this to you.\"\nTony caught the bag when Peter tossed it to him, suddenly very aware that he was standing in the middle of his room naked while the man he had been pining over for months stood in front of him, asking him to marry him.\nWell, then. Tony Fucking Stark apparently did love confessions while naked. He fumbled with the strings on the bag before untying them. Then he turned the bag over, putting his open hand beneath it.\nA simple black band with glinting grey stones landed in his palm, cool against his skin. The black metal gleamed in the low light of his room, the grey stones sparkling from where they were set into the band at equal intervals.\n\"It won't bend or shatter under pressure,\" Peter said. \"I thought...if you wanted it...it would work well for when you're in the workshop.\"\nTony looked up at him. He was fidgeting, eyes wide, face open and honest, and he looked terrified. Tony started when he realized that Peter was afraid he might actually say no. As if Tony could - he never did have great self control.\nHe slipped the ring onto his finger, raising an eyebrow when it was a perfect fit. Peter's shoulders relaxed and he beamed at him, smile wide and boyish and full of joy.\n\"If you're imagining me doing something creepy like wrapping string around your finger while you slept, well, you're kind of spot on?\" Peter said, and scratched the back of his neck.\nTony's chest constricted and he realized suddenly that what he was feeling was joy. It was such a rare emotion for him that it took him off guard. He strode across the room and wrapped his arms around Peter's neck.\n\"With a disturbing proposal like that, how could I resist?\" he asked, and Peter's breath hitched before he tugged him in for sloppy, enthusiastic kiss.\nThey didn't leave the room for another couple of hours.\n000\nThey were having an impromptu celebration with the team members who were at the compound later that day when Carol came sweeping in, lips white around the edges from how hard she was pressing them together. Tony knew from personal experience that the expression she was currently wearing meant she was furious.\nPeter, who didn't bother wearing his suit at the compound when it was just the team, was bickering with Kamala over the last of the sparkling cider. He finally just webbed the bottle and took off, ignoring her protests and barely dodging the enlarged fist she sent his way.\nJontan giggled from where she was sitting next to Rhodey, both of them on what Tony thought might be their third slice of cake. Peter heard her and twisted his body into a dramatic triple flip, landing on the ceiling and making the girl squeal with delight. He grinned and gave her a jaunty wave.\nKamala let out a cry of rage when the motion caused the rest of the cider to splash out of the bottle directly into her face.\n\"Uh, oops?\" Peter said, dropping to the ground, then let out a high pitched scream as Kamala tackled him.\nTony's Peter (and why did they both have to be named Peter?) laughed and slung an arm around Tony's shoulders. Gamora reached out with one hand and grabbed the back of Kamala's shirt as she darted past her after Peter, who had escaped her hold and was now scrambling away. She flailed a little as her body jerked to a stop, but took one look at who was holding her and immediately stopped her struggles. Smart girl.\nRocket stuck out a foot in front of Peter as he darted past, causing the boy to trip and roll across the ground, arms and legs flailing. Rocket snickered at Peter's groans and protests before shoving another bite of pizza into his mouth.\n\"I think Carol has something to tell us,\" Hope said from her spot beside a surly Jessica Jones. The two of them had hit it off, and generally Jessica could be seen lurking about the compound when she knew Hope was there.\nCarol hesitated. \"This might be something I should speak to Tony about alone first,\" she said a little apologetically, and Tony's body went cold at the implications.\n\"You have got to be kidding me,\" Rhodey said, having caught on to what news the woman probably had. The Assembly had been playing around with the idea of offering the Rogue Avengers a deal. One that basically amounted to: you can return from hiding if you agree to a sentence of community service.\n'Community service' being signing the Accords, following its laws, and helping fight in the war against Thanos. Public opinion hadn't exactly warmed to the Rogue Avengers since the Guardians announced that Thanos' army was coming, but people were scared. They wanted as many soldiers as possible out on the front lines, fighting against the invading force.\nCarol sighed and rubbed her forehead. \"They've decided to offer them a deal. Next week they'll be sending a representative to talk to us about the possibility of them joining the Guardians. Apparently they think we can keep them under control.\" Her face twisted with distaste as she said the last sentence.\nAround them, all activity had stopped. Unsurprisingly it was Kamala who spoke first.\n\"No. I won't work with them. Not - not after what they did to Tony,\" she declared hotly.\n\"Me either,\" Peter said in his best 'I am Spiderman' voice. \"We can't trust them to have our backs.\"\n\"If they join, I'm out,\" Jessica chimed in. \"I doubt Matt or Luke will stick around, either.\"\nCarol sighed. \"I just...I just don't know if we'll have a choice,\" she finally admitted. \"I suppose if we all threaten to leave the Guardians...\"\n\"Why can't they just be on their own team?\" Hope asked. \"I mean, Rogers doesn't exactly play well with others.\"\nCarol shrugged. \"I just - I don't know.\"\n\"No way,\" Rhodey said, \"No way am I letting them within two hundred feet of Tony.\"\nQuill pulled Tony closer and he relaxed when everyone around him gave determined nods. Gamora was cleaning her swords, looking murderous, and Rocket was growling. It was fine, Tony wasn't alone this time. Even if he saw his old team, they couldn't touch him.\n\"Hey, there's an idea,\" Matt said from the doorway, and Tony jumped. The guy was seriously too quiet. Luke was standing by his side.\n\"Heard there was a celebration,\" Luke said and stepped into the room, Danny following, his usual friendly smile in place. \"Congrats on the engagement, Tony and Peter.\"\nCarol blinked and seemed to finally take in the cake, empty bottles of sparkling cider, and pizza. Her eyes then darted to where Peter was looking smug and ecstatic, and focused on Tony's left hand.\n\"Oh!\" she said. \"Oh, Tony, Peter, forgive me. Congratulations! This is amazing.\" Tony accepted her hug and couldn't stop the smile that spread over his face.\nLuke slapped Peter's back and flashed him a smile. \"Man, I told you he'd say yes, didn't I?\"\n\"The way they stared at each other was borderline disgusting, I think everybody knew he'd say yes,\" Jessica grumbled, and Danny huffed out a laugh.\n\"Yes, congratulations,\" Matt said, coming forward and offering Tony and then Peter a handshake.\nTony had hired Matt under retainer as an official lawyer for the Guardians, so he felt comfortable coming and going as Matt Murdock if it was only the team around. It was actually a great cover, since not many people saw a blind lawyer and thought 'oh yeah, secret superhero who is also their attorney.'\n\"What's a good thought?\" Rhodey asked from where he was still seething next to Jontan, whose wide eyes were darting between the adults in the room.\n\"Oh,\" Matt said, \"not letting Steve Rogers within two hundred feet of Tony. I think that we certainly have everything we need to file for an order of protection. I'd like to to see the Assembly try and work around that. After all, it's Tony Stark that all of our new allies seem to be focused on. In a choice between him and Steve Rogers, I think the outcome is obvious.\"\nTony shifted uncomfortably. \"I don't know -\"\n\"Tony,\" Jessica said. \"None of us want him around. You aren't making things tough on anybody but that abusive asshole if you do this. It's not wrong to want to keep the terrorist dickhole who lied to you and then attacked and almost killed you from gaining access to your workplace. That's just fucked up,\" she said, then cracked her knuckles.\nTony blinked as the people around him nodded. Peter met his gaze and smiled. \"It's up to you, babe, but if the Assembly tries to put him on our team, I'm bundling you up on the Milano and we're fucking off to space.\"\nTony huffed out a laugh. \"Geeze, well, when you put it that way...\"\nMatt gave a terrifying, sharp smile. Why did Tony surround himself with all of these frightening individuals?\n\"Perfect. I'll put in the paperwork right after I've had some cake.\"\nHe wandered over to the table, and Jessica stood to join him. They began an intense, whispered conversation that Tony decided he didn't want to hear.\n\"So, when's the wedding?\" Luke asked, and Peter was back to his smug smile.\n\"Eh, we're thinking something small and quick. We need to get the paperwork sorted for Jontan - right now Earth has accepted that she's my ward, but I want Tony listed, too.\"\nThat had been a whole slew of paperwork and legalese that had been...interesting and involved Rocket running off to have papers falsified on another planet to present to Earth courts as proof that Jontan was Peter's ward. Which was why they were a little worried about what would happen if somebody from offworld looked into it. Not likely, but, well, it was better to be prepared.\nIf Tony was also listed as an official guardian, that would make anybody think twice before disputing it, as he had been a citizen of Earth his whole life and was considered an important part of the fight against Thanos. So they needed to get married fairly quickly to deal with that situation. Plus, the whole 'the world might be coming to an end soon' thing had kind of lit a fire under them.\n\"You must be very excited, Jontan,\" Carol said, and the girl smiled brightly.\n\"Yes! I will always miss my mother, but I am glad to have found a family in Tony and Peter,\" she said.\n\"Hey, don't forget about your big brother and sister!\" Kamala called from where she had Peter (Parker) in a headlock. \"Me n' spidey are going to teach you all the best ways to annoy your parents.\"\n\"Aw, come on,\" Quill said. \"That's not fair.\" Rocket cackled.\n\"I am Groot!\" Groot said, and Tony realized he was somehow sitting up in the rafters. He didn't even want to know how he'd gotten up there.\n\"Yeah, buddy, you're her big brother too,\" Peter said cheerfully from where he was still struggling against Kamala's hold.\nThe rest of the tension left Tony as he watched his new team - his family - devolve into bickering. Jessica caught his eye and gave him a knowing look. He supposed almost everybody standing in that room knew what it was like to be alone. Now, with a bit of luck, none of them would have to be again.\n000\n\"So, we just need to sign the new Accords and we can go home?\" Sam asked, staring at T'Challa with naked hope.\n\"You will also be expected to agree to the plea agreement. If you do, you will be on a probation of sorts, and you'll be expected to serve the UN for the time specified in each of your agreements.\nYou can still turn down missions if you are uncomfortable with them, but your probation is contingent on hours served. So, if you turn down a mission, you won't be punished, but it won't count towards your hours.\"\nSteve sighed and shook his head. \"We were just standing up for what we believed,\" he said. \"They want our help, but only if we do ittheir way.\"\nT'Challa studied the man. \"Perhaps. Please remember, however, that many still consider you terrorists. This is not a popular decision, but it was decided that we need every available resource to defeat Thanos.\"\n\"And if we don't sign?\" Steve asked, and only long practice in politics kept T'Challa from showing his amusement when Sam and Scott sent him incredulous looks. They, at least, understood the position they were in and how lucky they were to be receiving this deal.\nThe Widow's face was blank, but if T'Challa had to guess he'd say her thoughts were similar to theirs. Clint's face was twisted in distaste, but even he seemed relieved. Wanda...she just nodded along with whatever Rogers said.\n\"I just don't know if I'm comfortable -\" Steve started, and Scott stood abruptly.\n\"Does this mean I can see my daughter again?\" he asked, ignoring the look Steve sent him for cutting him off.\n\"Yes, as long as your custody agreement allows,\" T'Challa said. Scott reached forward and grabbed a pen from the table, then started flipping through the pages, scribbling his signature wherever prompted.\n\"You aren't even going to read it?\" Steve asked.\n\"Already read the Accords,\" Scott said shortly. \"Not like I had anything better to do. And the deal is more than any of us deserves,\" he added.\n\"That is not true,\" Wanda said, and Scott twitched.\nNatasha had started putting her own signature on the pages in flowing, perfect cursive. Sam glanced at Steve, hesitated, and then reached for his own pen. Steve stared at the three of them, bewildered. When Clint joined them in signing his expression changed to one of betrayal.\n\"If we wait them out, they won't make us plead guilty to something we didn't do,\" he said in his best Captain America voice.\n\"Mr. Rogers,\" T'Challa said, keeping his tone level even has he imagined all the things he'd like to say to the man, \"I think you don't understand just how good of a deal this is. You'll still be saving the world - what does it matter whose orders you do it under?\"\nSteve stared at him, jaw clenched, the only sound in the room that of his comrades writing out their names and flipping through the pages.\n\"Fine,\" he said, face tired and voice heavy. \"If - if I do this, what will happen to Bucky?\"\n\"I gave Mr. Barnes sanctuary. I will not take that from him. I have many doctors and scientists working on finding a way to reverse his conditioning. Do not fret over your friend, Mr. Rogers. He will be in good hands.\"\nWith one last desperate look around him, Steven Rogers reached over and picked up a pen.\nTony shifted, looking down at his watch before bringing his gaze back to the door. He had exactly two minutes before he was officially late to his own wedding.\nHe was getting married. In two minutes. He should be nervous. Why wasn't he nervous? Instead he was...happy. Excited. It was weird. The door cracked open and a little face peeked around it.\n\"Tony, Peter wants to know if you left him at the alter,\" she said matter of factly, and Tony laughed.\nHe then stepped forward and pushed open the door the rest of the way, swooping Jontan up in his arms as he passed her.\nShe wrapped her arms around his neck and smiled at him. \"I told him you wouldn't,\" she whispered as he took in the people in the room.\nAll of the Guardians were there, along with Happy and Pepper.\nShuri waved from where she was standing next to T'Challa, and Tony waved back.\nPeter was standing in front of the judge that Tony had paid to come out to the compound and do the ceremony. He was wearing a perfectly tailored suit that Tony had forced him to accept - he wasn't getting married to somebody while they wore a trench coat - and he looked so good that Tony was tempted to just drag him out of the large room and to their bed.\nInstead he set Jontan down, and she scurried over to stand next to Gamora, who smiled down at her and took her hand. Tony took a deep breath, and then went to go get married.\nThe party afterwards was rowdy despite being alcohol free. Peter had created a swing with his webs that hung from the ceiling, and he and Kamala were pushing Jontan and Groot in it as the little girl screamed out her joy and Groot yelled \"I am Groot!\" at the top of his lungs. Drax hovered nearby, probably so he could catch any children that tumbled out of the swing.\n\"I'm proud of you,\" Rhodey said as he pulled Tony into a hug.\n\"Aw, Honeybear, you're making me blush,\" Tony said, clearing his throat and not quite keeping the wide grin off his face.\n\"Yeah, yeah, save it for Quill,\" Rhodey said, returning his smile when he pulled back.\n\"Oh, Tony,\" Pepper said, coming in for a hug next. \"I'm so happy for you.\"\n\"Thanks, Pep,\" he said.\nHis eyes found Peter's, who was across the room talking to a laughing Jessica and Hope. He smiled at him and Tony's heart leapt in his chest. He couldn't help but hope that he'd really be able to keep this.\n000\nSteve stepped off the jet, closing his eyes and breathing in the smoggy ocean air. They were at a compound in New Jersey that the UN Assembly had set up as one of their bases of joint operations. There were multiple such hubs across the world as part of Earth's coordination efforts.\n\"Mr. Rogers?\" a familiar voice said, and he looked over to see Carol Danvers standing to the right, arms crossed over her chest and expression unreadable.\nBehind her was a tall well groomed man wearing a red cloak. Steve didn't think much of it - after all, he'd seen weirder dressed people.\n\"It's Captain,\" he said without thinking.\n\"Not anymore,\" she replied briskly. \"I'm Major Carol Danvers of the United States Air Force and this is my colleague Dr. Strange. You can call me Major or Major Danvers.\"\nClint snorted behind him, and Wanda took a threatening step towards her. Carol glanced at her for only a moment before her eyes flicked away dismissively. Steve didn't miss the way Dr. Strange focused in on Wanda, and he put a calming hand on her shoulder. After a moment she stepped back.\nSam stepped forward and saluted. \"Major,\" he greeted.\n\"Mr. Wilson,\" she replied.\nSteve winced at the reminder that Sam had been dishonorably discharged. Hopefully that was something they could change along with the loss of Steve's Captain title.\nNatasha sauntered past him, Scott on her heels. The man had taken to sticking close to her, though Steve wasn't sure what prompted the sudden closeness.\n\"Major,\" Natasha greeted. \"It's good to see you again.\"\nCarols' demeanor softened for just a moment. \"Nat. You've certainly put your foot in it this time,\" she said.\nNatasha shrugged and gave a self deprecating smile. \"I guess I bought into the propaganda, too,\" she replied.\nSteve stiffened and clenched his jaw. Apparently Natasha had no qualms throwing him under the bus to get on the so called \"Guardians'\" good side.\n\"Miss Danvers,\" Steve said, and fought the urge to cringe when Carol sent him a glare. \"Major Danvers,\" he corrected, \"we're pretty tired from our flight. Is there a reason we didn't go to the compound to unpack and rest before checking in?\"\nFor a moment Carol looked amused, but then her expression was wiped clean of emotion again. Dr. Strange didn't bother to hide that he thought Steve had said something funny.\n\"Everything will be explained to you in a moment. Follow me, please.\"\nSteve exchanged a wary look with Clint, then put a gentle hand on Wanda's arm, since she was still looking agitated. They followed Carol and Dr. Strange into the building. Steve frowned as the edge of Dr. Strange's cloak lifted and moved back and forth in the air. Was it...waving at him?\nThe inside of the building was familiar in the way most government buildings were. Cold, with low ceilings, ugly carpeting, and white walls made even more glaring by fluorescent lighting.\nIt was incredibly jarring after living in the open, airy suites they'd been provided in Wakanda. Steve sure was looking forward to getting back to the compound. If there was one thing Tony was good at, it was interior decorating.\nThey followed their escorts through a maze of hallways, and Steve didn't miss the wary looks they were getting from the people around them. He breathed through his frustration. It wasn't their fault that the media had gone on a witch hunt against him. He'd just have to prove that their fears were unfounded.\nThey entered a medium sized conference room a few minutes later. There were already two people seated there.\nOne was an elderly black man with white hair, kind brown eyes, and deep lines around his mouth and eyes. Next to him sat a plain woman with blonde hair pulled back into a no-nonsense bun wearing what Tony would call a 'take no shit' suit.\nThey were discussing something in low tones, but stood when they entered the room.\nThe man smiled at them. \"Ah, Mr. Rogers and crew. Hello.\"\n\"Sir,\" Steve said politely, reaching out to shake his hand.\n\"This is James Docken, the lawyer that the Assembly appointed to your team, and his assistant Janice Meyers.\"\n\"Why do we need a lawyer?\" Steve asked, sending Carol a stern look. \"I thought we had everything worked out.\"\nCarol raised an eyebrow at him, and Dr. Strange actually rolled his eyes. \"You're here under probation, Mr. Rogers. There are a lot of rules and regulations you need to be make sure to follow, along with certain steps that your team needs to take before you can go on active duty.\"\nHe crossed his arms over his chest. \"What kind of steps? I was under the impression that the whole reason we signed the Accords was so that we could join the fight against Thanos.\"\nThere was silence for a moment, and then Dr. Strange finally spoke in a cultured voice. \"My god, you didn't read the paperwork at all before you signed, did you?\"\n\"Stephen,\" Carol said in a warning tone, and he sighed, but didn't say anything else.\n\"Well, Mr. Rogers, why don't we sit down and go over what needs to happen before your team can go active, hm? That's why we're here, after all,\" James said in a low, soothing tone.\nSteve sighed, but didn't want to be rude to the man when he was obviously just trying to help. He'd sit through this circus to make the bullies on the council happy. He turned to take a seat, and was a little disconcerted to see that Natasha, Sam, and Scott had already sat down without waiting for him.\nHe shot them a disapproving look, which they ignored. It was going to be difficult to work as a team if they kept holding this grudge. He took the chair that was across from James, and Wanda and Clint followed.\nCarol and Dr. Strange took seats on the other side of the table on either side of their lawyers.\n\"Alright, I'm sure you're all very tired and would like to get settled in, so let's get through this as quickly as possible, hm? Since we were just discussing it, let's begin with the evaluations you'll need to complete before being cleared for active duty under the Accords,\" James said.\n\"What kind of evaluations?\" Clint asked from where he was sitting next to Steve, back stiff.\nJames smiled at Clint and Steve relaxed. \"There are three stages, very similar to what I imagine was required of you while you were an active agent of SHIELD, Mr. Barton.\"\nJanice slid packets of papers across the table to each of them, and Steve accepted his with a smile. She just stared back at him, expression blank, and he faltered before taking his packet.\n\"The first is a standard physical examination, which will be performed by one of our doctors on staff here.\"\nSteve nodded. That was easy enough - his team was probably a little out of shape from their time in Wakanda, but they could fix that with a good exercise regime.\n\"The second stage is a test of any supernatural or enhanced abilities or specialized skills. Each of you have been paired with somebody that can properly perform this test.\"\n\"What do you mean, 'test' us,\" Steve asked, visions of his team being locked in labs flashing through his mind. Next to him, Wanda's eyes had gone wide.\n\"Nothing nefarious, I promise you. This is just a way to determine strengths and weaknesses, along with making sure that you have control over your abilities. If it is decided that you need specialized training before you can go out into the field, it will be provided to you.\"\n\"It says here that Dr. Jean Grey and Dr. Strange will be the proctors for my test. What's so special about them?\" Wanda snapped.\n\"Ah. Well, I'm not exactly clear on that, but apparently they have abilities that are at least similar to your own, and so will be able to offer invaluable insight and possibly advice on your own abilities,\" James said, and gave Wanda a kind, grandfatherly smile.\nWanda's eyes had focused on Dr. Strange, who raised a perfectly manicured eyebrow at her.\n\"Don't worry,\" Steve said to her in a low voice that he knew made people pay attention. \"I'm sure Dr. Strange will remain completely professional.\"\n\"Oh, yes, no need to worry about that,\" he said snootily. \"As the Sorcerer Supreme, I consider it my duty to remain objective in the face of magical creatures and people.\"\n\"The what?\" Steve asked, but James was moving on.\n\"Alright. The last stage is a psychological examination,\" James said, and Steve's brow furrowed.\n\"Is that necessary?\" he asked, memories of the SHIELD psychologists talking at him for hours after he first woke up from the ice surfacing.\n\"I'm afraid so,\" James said apologetically. \"Every person who signed the Accords has undergone a psych eval before being approved for active duty. Don't worry, we've been assured that all of the psychologists and psychiatrists on staff have been thoroughly vetted and are above reproach.\"\n\"That's what they said about the last 'specialist' they sent in, and the man ended up being Hydra,\" Steve said, unimpressed.\n\"If I recall,\" James said mildly, adjusting his glasses, \"the man they sent was a good match. Unfortunately he was killed and impersonated by Zemo. Very sad, as he was well respected in his field.\"\n\"The security holes that Zemo took advantage of to trigger the Winter Soldier have been filled,\" Carol said flatly from next to James, who nodded and smiled at her. \"It shouldn't be a problem again.\"\n\"We'll see,\" Steve said, but didn't argue any further.\n\"So what happens if we fail any of these?\" Sam asked. \"Do we go to jail?\"\n\"Ah, excellent question young man. If you fail any of the examinations, you'll be put into either specialized treatment or a training program, courtesy of the UN. After three months you'll be reevaluated. As long as you work hard and try your very best, I'm sure you'll do fine.\n\"However, if it is decided that you just aren't suited for field duty, you'll be given a different role that will still meet the requirements of your parole. As long as you do your jobs and don't break any of the rules, you don't have to worry.\"\nWanda scoffed. \"So you're saying that we have no choice. It's up to others whether we fail or succeed.\"\nJames' eyes sharpened, and for the first time he looked like a lawyer instead of a favored grandfather. \"There is always a choice, young woman. Even if the options aren't what we'd prefer.\"\nHe relaxed back into a smile, leaving Steve struggling to figure out what kind of man their lawyer was, exactly.\n\"Okay. You'll find specifics on your evaluations in your packets. Please be sure you're on time for them, and treat them with the utmost seriousness. Any more questions? No? Alright. Let's move on to your living situations.\"\n\"We'll be living in the Avengers' Compound,\" Steve said confidently, and James grimaced.\n\"Ah. No, I'm afraid that isn't an option. Most of you will be staying here in the base, though I believe Mr. Lang has elected to serve in the Sacramento base, as it is close to his daughter.\"\nSteve leaned back, reeling in shock. \"That's unacceptable,\" he bit out. \"The compound is our home.\"\n\"Not anymore,\" Dr. Strange said, and Carol glared at him. He sighed theatrically but leaned back, crossing his arms over his chest and sending Steve an infuriatingly smug expression.\n\"The Guardians put it to a vote, and we unanimously decided that you and your team are not welcome there, Mr. Rogers,\" Carol said calmly.\n\"Miss-\"\n\"It's Major, Mr. Rogers,\" she snapped. \"I've been told the serum gave you a good memory along with your strength. Don't call me Miss again.\"\nSteve breathed deeply to keep his temper in check. \"Major. I was under the impression that the Assembly could overturn decisions that teams make on membership,\" he said.\nIt was one of the few things he'd actually read in the Accords, and he'd been disgusted that they were able to impose their will on teams. \"I can't believe that they wouldn't want me to return to my team.\"\nTo his surprise, Carol let out a bark of laughter. \"Mr. Rogers, the Guardians are not, and never have been, your team. As for the Assembly, they could not overturn our decision even if they wanted to.\"\n\"What do you mean?\" Steve asked, putting a hand on Wanda's arm when she leaned forward, hands glowing slightly. Dr. Strange had straightened and was watching her with narrowed eyes, and it made Steve nervous.\n\"There are a multitude of reasons, Mr. Rogers,\" James broke in, holding up his hand and speaking in a low, soothing tone. \"Most of the Guardians are uncomfortable working with you after all of the...negative press, and there were concerns that many of our defenders would retire if the issue was pressed. There is also another reason that you, Ms. Maximoff, and I can discuss privately later,\" he said.\n\"What? Why me?\" Wanda asked, and Steve tightened his hand on her arm.\n\"As I said, we can discuss this later, when we're alone -\"\n\"Anything you need to tell me, you can say in front of my team,\" Steve said, straightening his back and looking James in the eye. If they thought they could shame him, they were wrong. Steven Rogers did not bow to bullies.\n\"Me too,\" Wanda said, chin high, and Steve flashed a smile at her.\n\"Mr. Rogers, I really don't think -\"\n\"Let's just get it all out in the open, James,\" Steve said, ignoring the glare Janice sent him at the use of her boss' first name.\nJames sat back and removed his glasses, pressing his fingers against his eyelids. \"If you insist,\" he finally said, opening his eyes and putting his glasses back on.\n\"Oh, I've been looking forward to this,\" Dr. Strange said, and reached into his cloak. He pulled out two large, official looking envelopes.\n\"Mr. Steven Rogers?\" he asked, and Steve stared at him, confused.\n\"Yes?\"\n\"Oh,\" Natasha breathed, and Steve glanced at her, but she didn't elaborate.\n\"Ms. Wanda Maximoff?\" Dr. Strange asked, and she blinked but nodded.\n\"You're so dramatic,\" Carol grumbled at Dr. Strange, who ignored her and handed them each an envelope across the table. It was heavy in Steve's hand.\n\"You've been served,\" Dr. Strange finished with a flourish, then leaned back in his seat.\nClint swore, and Sam was looking down at the table. Wanda frowned and opened her envelope, and Steve fumbled to do the same. His eyes ran over it and his brow furrowed.\n\"An...order of protection? From Tony?\" he asked\n\"Yes,\" James said, voice somber. \"I'm afraid it's outside of my perview as a UN assigned lawyer to help you with this, but I can recommend plenty of good attorneys to help you figure out all of the ins and outs of this particular legal action.\n\"The part that I can discuss with you is how it will affect your living situation and team placements. The United Nations will not force an abuser upon their victim. You won't find any support if you try and get the decision to assign you to a different team revoked.\"\nSteve stared down at it. Next to him, Wanda was vibrating in rage. They thought he was an abuser?\n\"His - his ego is disgusting,\" she spat. \"He dares to call me a criminal, when he is responsible for the death of my parents. He dares to take my home from me, again!\"\nThe table began to shake, and James stood calmly and headed for the door, his assistant on his heels. Dr. Strange stood and focused his gaze on Wanda.\n\"Ms. Maximoff, you will get control of yourself, or I will be forced to restrain you.\"\nWanda let out a disbelieving laugh and stood. \"I'd like to see you try,\" she growled, and the glow around her hands brightened.\n\"Wanda, stand down,\" Steve barked. For a tense moment, he thought she wouldn't listen. Then, the glow around her hands faded, and she slumped back down into her seat.\n\"How could they let him do this?\" she sobbed, and Steve put a hand on her shoulder, impotent rage moving through him. Tony was taking this too far. How could he accuse Steve of being the sort of monster that needed an order of protection? Especially with the way they felt about each other?\nA few moments later James, sans his assistant, returned. \"Well then. We're almost done here,\" he said, no sign that he'd been forced to flee the room out of fear on his face.\nSteve decided he liked him - it was obvious the man knew who the real victims were in this. It was nice to have somebody on his side.\n\"If I could just speak to Tony, I'm sure we can work this out,\" Steve implored the man. \"He's just trying to punish me. He'll calm down if we can just talk.\"\nJames stared at him, face unreadable, before he answered. \"As I said, I cannot act as your legal council in this. However, I feel I must inform you, that if you break the order of protection you will be facing felony charges. I assume that this would force the Assembly to revoke your parole.\"\nSteve's jaw clenched and he forced himself not to yell at the man. He was just the messenger, after all.\n\"Thank you for the warning, James, I appreciate that.\"\nSteve noticed for the first time that Scott, Sam, Natasha, and Clint had stood and were now against the far wall. Scott had sweat on his forehead, and Sam's expression was pinched. Both Natasha and Clint wore blank expressions that Steve knew meant they were upset.\nHe felt deep disappointment in his team for their reaction to Wanda, especially Clint. Didn't they see she was just a kid, and that she needed their support? He'd have to talk to them about it in private.\n\"Well, then. I think that's enough for today. Please read through your packets. They provide a nice summary of the dos and don'ts of the Accords. My card is stapled to the back - reach out to me any time with questions.\"\nSteve stood and shook the man's hand. \"Thank you again, James. You've been very helpful.\"\n\"You're welcome, Mr. Rogers. Good luck to you,\" he said.\nCarol and Dr. Strange led them to their rooms shortly after. It was a suite, with a living area and a hallway that led to what Steve assumed were their individual rooms.\nAfter a whispered conversation between Scott and Carol, she said goodbye and left, a relieved Scott grabbing his duffle bag from where somebody had set it by the door and following her out. He didn't say goodbye.\nSteve turned to face the rest of the team, but they were already heading towards their rooms. He sighed and sat on the hard couch, telling himself that things would get better soon. Just as soon as he had a chance to speak with Tony.\n000\nWanda entered the large training room warily, eyes darting around for any sign of crazed scientists or greedy government politicians. She relaxed when she saw that there were only two other people there.\nOne was Dr. Strange, and her lip curled up in distaste at the sight of the rude man, who was leaning back against a wall, cloak in place and face bored. Next to him was a beautiful red headed woman, who stepped forward with a smile on her face.\n\"Wanda? Hello, I'm Dr. Jean Grey. Please, call me Jean.\"\nShe looked at her warily but took her hand. As she did so she poked at the woman's mind, trying to see what she could glean from her. She started as what felt like huge metal doors slammed down, blocking her probe. Her wide eyes met Jean's thoughtful ones.\n\"Did you do that on purpose?\" the woman asked, voice mild and unjudging.\n\"Oh, did she try and get a peek into your mind, too?\" Dr. Strange asked, looking down at his nails.\nWanda hated him, especially since trying to read him had been like attempting to listen through a hive of bees flying around in her mind. She'd had a headache for hours after meeting him.\n\"It - it's automatic,\" she said, widening her eyes. \"I can't help it.\"\nJean gave her a bland but reassuring smile. \"Well, that's why we're here, isn't it? Don't worry, I've worked with many people to help them build their control.\"\nWanda nodded along, even as she felt satisfaction uncurl inside of her. This woman was just like everybody else - easy to fool and work around. She'd pass this evaluation with flying colors.\n000\nSteve was just leaving another frustrating session with his therapist when he was intercepted by James. He hadn't seen the lawyer since the first time they spoke.\n\"Mr. Rogers. Would you follow me to the conference room, please? I have something I'd like to discuss with you.\"\nSteve frowned. \"Sure. Is everything alright?\"\n\"Yes, yes, of course. Just a small thing we need to discuss,\" James said.\nSteve followed him to the conference room they'd originally met in, and clenched his jaw when he saw that Carol Danvers was also there, but didn't comment other than to give her a nod, which she returned.\nHe sat down and smiled at James. \"I sure hope everything's okay. You've got me a bit nervous, now,\" he joked.\nJames smiled. \"As I said, everything is under control. I just wanted to inform you that Wanda Maximoff has failed her psychological evaluation. She also did not prove to have sufficient control over her powers to be considered a candidate for active duty.\"\nSteve's stomach dropped. \"What? That - that's ridiculous! Wanda has been working with us for years. Her control is fine,\" he said. He knew he couldn't trust them to treat his team fairly.\n\"I cannot give out the details, but I'm afraid that she's been moved to a different location for training, and also for the protection of everyone in this base,\" James said.\nSteve stood. \"What?\" he turned on Carol and leaned over the table, looming over her. \"Where is she,\" he said through gritted teeth.\nCarol raised an eyebrow, looking almost bored at his display. \"I'm not at liberty to disclose her location. She's allowed a phone call a day, so I'm sure you'll be hearing from her. You can talk to her then.\"\n\"She's part of my team,\" Steve said, standing and crossing his arms over his chest, \"that means she's my business. Tell me where she is.\"\n\"Mr. Rogers,\" Carol said, \"you aren't listening. As of two hours ago, Wanda Maximoff is not a part of your team. As discussed, she'll be reevaluated in three months.\"\n\"You can't just lock her up like a criminal!\" he yelled, losing his temper as fear for Wanda hit him.\n\"She is a criminal. You all are. She just proved it - again - today when she attacked her proctors and tried to escape the base.\"\nSteve sat down in his chair at that, not quite able to convince himself that Wanda wouldn't do that. She still had a hard time controlling her temper, after all. He looked over at James, who nodded once in confirmation.\n\"She was given a choice between going to prison to serve out her time, or accepting guidance under an Assembly-provided teacher, along with intensive therapy.\n\"If you try and retrieve her, you'll only make things worse for her. There will not be another chance if you go vigilante again, Mr. Rogers,\" Carol warned.\nSteve could suddenly see why she had been made the leader of the Guardians in his absence. She looked and sounded like somebody who was in charge.\nDumbly, he nodded. He'd wait to speak to Wanda when she called before he made a decision.\n000\nThe rest of them had passed their evaluations, though Clint and Steve were required to attend therapy every other day for two hours as a stipulation to being allowed on active duty.\nWanda was angry but fine, though Steve still hoped to convince them to let her return before the three months were up. To distract himself he focused on training.\nIt was a disaster. Clint's bow and arrows and Natasha's widow bites were subpar, their uniforms were ill fitting, and when Steve had asked the quartermaster when he'd be getting his shield back the woman had simply laughed at him.\nSam's falcon wings didn't have anybody to do maintenance on them, and so he'd ended up with a less efficient set made by Hammer Industries, which had graciously donated the time of some of their engineers to the Allied Forces, as the group of people and aliens preparing to fight Thanos were being called.\nTheir rooms were bland and boring, their food was bland and boring, and they weren't allowed off the grounds of the base. Nobody seemed to care about whether or not they were happy, and they were still being regarded with wariness.\nSteve kept his burner phone on him at all times, but Tony never called.\n000\n\"Can I call you dad and papa?\" Jontan asked three days after they returned from their mini family vacation slash late honeymoon.\nThey'd waited to leave until the paperwork making Tony Jontan's official guardian along with Peter went through. They'd spent three glorious days on a private beach.\nTony had taught Peter and Jontan how to surf, and they'd gone on hikes through the jungle, where Jontan had squealed happily at the wildlife. Every night Peter had kept Tony up late because \"we're consummating our marriage, we have to make sure we've done it right, babe.\"\nTony fumbled the remote that he'd just picked up so he could put on a disney movie, and Peter's eyes widened. He turned towards Jontan, who was staring up at him guilelessly.\nHis chest clenched at how adorable she was, and a surge of protectiveness moved through him. Thanos would destroy the Universe she resided in over his dead body.\n\"If - if that's what you want, sweetheart, sure,\" Tony said after exchanging a look with Peter.\nShe smiled at him. \"I think mom would be happy to know I found you,\" she said decisively. \"Now put on Mulan and tell Uncle Rocket that I want him to come cuddle.\"\n\"Sure thing, princess,\" Tony said wryly, but he knew his smile matched the beaming one on Peter's face.\nSteve sat in the cafeteria of the UN base, Sam and Nat on either side of him. All of them were barely picking at their food. Practice had been another disaster. Clint had broken his bow in half in a fit of rage over its quality (or lack of it) before storming out.\nSteve wondered how much longer they would be stuck here. It was obvious they were being punished by being treated like grunts instead of Avengers. Steve just had to ride it out until everybody felt like they'd been properly chastised, that was all.\nA murmur started up in the crowd, and Steve glanced over as a young Chinese man in the Allied Forces grey fatigues stood and turned on the TV, looking down at his phone for reference before clicking it to the proper channel.\nNat straightened beside him as a reporter popped onto screen. \"...Sorry to interrupt your programming, but we've just gotten confirmation that Tony Stark was abducted by an alien race outside of Stark Tower today.\"\nSteve stood, his chair clattering to the floor behind him, as an image of Tony stepping out of the tower dressed in an impeccable suit, cocky smile in place, appeared.\nIn the background the reporter was still talking. \"At approximately ten am this morning a group of unidentified aliens that have not signed any treaties with the United Nations appeared seemingly from thin air. They subdued and captured Tony Stark.\"\nA chill ran down Steve's spine as six humanoid figures appeared in a ring around Tony. They were wearing tight black armor that covered them from head to toe, hiding any distinguishing features.\nThe crowd started to scream and point over Tony's shoulder, who was already ducking and spinning around, gauntlet forming over his hand to shoot beams at one of them. The alien went down and didn't get back up.\nSteve realized somebody must have been training with Tony, because he moved with a grace that was usually only present when fighting with his suit on. He took down two more before one of them wised up and nabbed a hostage - an older woman who hadn't been able to run fast enough to get clear.\n\"Iron Man,\" a garbled voice said from the long pointed helmet covering its face. \"You will surrender, or we will kill this citizen.\"\nTony stopped and immediately held up his hands. \"Friday, drop the gauntlet, code 362,\" Tony said calmly, and Sam swore next to Steve as the metal glove folded back on itself and then fell off of Tony's wrist to the sidewalk with a clunk .\nOne of the other aliens grabbed him and tugged his hands behind him. Tony didn't wince or show any other signs of discomfort, though it looked painful. His eyes were on the old woman, who seemed more annoyed than afraid.\n\"Alright, you've got me. Now let her go,\" Tony said.\nThe alien pushed the woman away from him and she sprawled across the ground. Another bystander raced forward to help her to her feet and pull her away. Two of the aliens picked up their fallen comrades, then they all clustered around Tony. A moment later they were gone, probably using some strange alien technology.\n\"We have - we have to save him,\" Steve rasped out, heart beat picking up, panic moving through him.\nFor the first time in months Natasha seemed to agree with something he said. She gave one firm nod, and Sam took a deep breath.\n\"Okay, let's go talk to -\"\nHe was cut off by gasps of disbelief. Steve's head snapped back to the TV, where there was an image of Tony tied to a chair, gagged but otherwise looking unharmed.\nStanding behind him were a group of about twenty of the black armored aliens, looking creepily uniform in their identical gear. Each was holding a large, sleek weapon that was lit up with blue lights that were blinking up and down the length of the barrel. One of them stepped forward.\n\"We have overridden your pathetic technology to send you a message. Terra is weak. Too weak to properly protect the Infinity Stones from Thanos.\"\nThere was a confused murmur around the rapidly-filling cafeteria, and Steve frowned. What were the Infinity Stones?\n\"You will give them to us, the Famot, to protect from the Titan. We are a warrior race - we will keep them safer than you pathetic Terrans could manage. You have one hour to deliver them to us, or your hero dies.\"\nIn the background Tony actually rolled his eyes, and Steve gritted his teeth. Couldn't the man be serious about anything? His life was on the line!\n\"Natasha, Sam, get geared up. We're going to -\" Steve was once again cut off by the exclamations of the people around him.\nOn the screen, there was some sort of...portal opening behind the aliens lined up at Tony's back. Steve's fists clenched at his sides when he recognized the common room at the compound on the other side. He could barely make out Dr. Strange, who had his hand held up in front of him, brow furrowed in concentration.\nThen Peter Quill stepped through the portal. He looked much different than the affable man who had jauntily taken the stage at the press conference all those months ago. His eyes were narrowed, his jaw tense, and he held a gun in each hand. His trench coat flared around him as he twisted out of the way of the portal, crouching and opening fire at the aliens.\nThree fell before they even had a chance to turn. Behind him Carol Danvers stepped through, though it was obvious that at the moment she was War Bird. She was wearing her blue suit, though her shoulders were red, with a gold star gleaming on her chest. She took to the air, and Gamora rolled out of the portal as she did, a curved blade in each hand.\nJessica Jones and Daredevil were next. Jessica was wearing black pants and a black leather jacket, but Steve could recognize Tony's workmanship in the expensive materials and sleek lines. He didn't doubt that they were bullet and fireproof.\nSteve's jaw dropped when the small woman stomped up to an alien that was trying to shoot War Bird down, pulled back her fist, and punched it in the chest.\nIt soared backwards, taking down two of its compatriots before it slammed into a wall, cracking the brick before crumpling to the ground, either dead or unconscious.\nIn the background Daredevil and Gamora were fighting four of them together, movements graceful and deadly and perfectly in sync. Spiderman swung in and out of the frame, webbing flying as he stuck an alien to the wall. Blue blasts of energy were sailing around the room, and Tony had thrown himself to the concrete, chair and all.\nPeter Quill was standing over him, sending shots at any aliens that got too close. He didn't miss any of his targets. The people around Steve were cheering as The Guardians methodically took down their enemies, movements perfectly coordinated. If Steve didn't know any better, he'd think they'd been fighting together much longer than a year and a half.\nDr. Strange was the last through the portal, and he looked almost bored as he closed it. Steve twitched when he drew a little symbol in the air and an alien's gun flew out of its hands before its body was yanked into the air. It dangled uselessly until Spiderman swung by and webbed its arms to its side. The alien then dropped to the concrete with a crack.\nPeter was clipped in the shoulder by one of the blue shots, and he flew backwards, skidding across the concrete. One of the aliens must have seen his chance, because he darted forward and grabbed Tony, yanking him up roughly and shoving his gun into the soft area below his chin.\n\"Stop!\" it yelled. Peter had struggled to his knees, and his eyes were wide and frantic. Everybody else paused, studying the alien with a terrifying intensity.\n\"Alright, now. Let's all just calm down,\" Peter said. \"We can talk about this.\"\nThe alien's helmeted head tipped to the side, and Peter winced as he took in the dead, dying, and incapacitated crew of the Famot.\n\"I mean, you started it,\" Peter grumbled. Tony choked on a laugh behind his gag, and Peter grinned, though it was strained. Steve's hand clenched. Why were none of them taking this seriously?\nIf Tony died, Steve would be - he'd be -\n\"You want an Infinity Stone?\" Dr. Strange asked, stepping forward, his cloak fluttering around him.\nHe reached for a pendant around his neck and pulled it over his head. He then held it up, and the Famot stiffened, attention riveted on the object. Steve frowned - it just looked like an overly fancy piece of jewelry to him.\n\"Alright then,\" Dr. Strange said, and tossed it.\nThe Famot made a small noise and pushed Tony away from him, diving for the amulet. Steve's breath caught and he found himself leaning forward with the rest of the room as the pendant seemed to sail through the air in slow motion, chain fluttering behind it. He knew, without a doubt, that letting the Famot get ahold of it would be bad.\nThe alien jumped, hand - which Steve just noticed seemed to have two thumbs and five fingers - reaching. The Famot was going to catch the amulet. Its path was heading straight for its palm.\nIt brushed against the black glove, and the alien's fingers had just started to close around it when a string of web appeared and pulled it away.\n\"I'll take that!\" Spiderman said cheerfully, and appeared in the view of the camera, snatching the pendant out of the air before doing an unnecessary flip. He landed next to Dr. Strange and held the jewelry in front of him by its chain. More cheers went up around Steve.\n\"Lose something, Doctor?\"\nDr. Strange smiled. \"Thanks, kid,\" he said, and casually took it from him.\nIn the background Peter Quill had subdued the Famot leader with what Steve thought was a bit of excessive force. Jessica was standing over an unmoving alien, arms crossed over her chest and one foot resting casually on its back.\nSpiderman was flitting around webbing the still-alive aliens so they couldn't cause trouble, and Gamora and Daredevil made fast work of the few that were still trying to put up a fight.\nPeter turned and dashed over to Tony, taking a knife from his boot and cutting away his bonds. He removed the gag and Tony moved his jaw from side to side, groaning as Peter started to rub feeling back into his arms.\nThey were sitting close to each other - too close, really, and Peter seemed to be frantically checking Tony for wounds as he helped him get mobile. In the background The Guardians were bantering about what to order for dinner. It was painfully familiar.\n\"Ugh, why do they always gag me,\" Tony mumbled, words completely audible to the camera. Peter grinned at him.\n\"Aw, babe, don't ask questions that you already know the answer to,\" he teased.\nAround him there were chuckles, but Steve had stiffened at the pet name. Babe? They couldn't be together...could they?\nPeter answered his silent question when he cupped Tony's face in his hands and leaned forward to kiss him softly. Tony closed his eyes and tipped his head for a better angle. The people in the cafeteria erupted into relieved cheers and wolf whistles.\nSteve's whole body seemed to lose feeling as he watched them kiss. It's a fling, he told himself, just another way of punishing you. It won't last.\nTony pulled back and smiled, brown eyes warm. People started shushing each other in the cafeteria so they could hear what the two men said next. Steve was pretty sure the large room now held every member of the UN's base.\n\"What, you miss me that much? I just saw you this morning.\"\nPeter let out a chuckle and pressed his forehead to Tony's. \"Babe, you can't do that to me. I don't want to become a widow after only two months of marriage.\"\nSteve stumbled backwards, eyes wide. Natasha sent him a look that was full of pity, and Sam grimaced. Marriage? Tony was married?\nTony rolled his eyes. \"Please. Like I'm that easy to kill. Though it took you guys long enough to find me. What good is Stephen's magical mumbo jumbo trackers he put in us if he doesn't use them, hmm?\"\n\"Oh yes, because apparently a man isn't allowed even one hour of peace to meditate and shower,\" Stephen grumbled in the background as Spiderman bounced around him, talking rapidly.\nSteve noticed that his hair was suspiciously damp, as though he really had jumped out of the shower to come to the rescue, though the thought was a distant one as Tony ran a hand through Quill's hair.\n\"I'm fine, you big baby. I knew my team would bust in and save me. Why do you think I was content to just sit around? I could have put in the effort to get away myself, but I do so love watching you work,\" he purred, and Quill raised an eyebrow.\n\"That so?\" he asked, voice flirty.\nTony grinned. \"Yep, sure is.\"\nHe glanced to the side, and froze. \"Uh, guys?\"\nThey all looked over to him, then followed his gaze until every member of the team was looking straight into the camera. \"Is that...still recording? And broadcasting?\"\n\"That's what the little red light means, right?\" Stephen said, voice wry.\n\"Uh. Yeah, generally,\" Tony replied, and dropped his head back and stared at the ceiling.\n\"Guess the cat's outta the bag,\" Peter said, and sent a charming smile and jaunty wave at the camera. \"That's right. I put a ring on it,\" he boasted.\n\"I knew I shouldn't have let Friday introduce you to Beyoncé,\" Tony grumbled, and Steve wanted to punch the people around him who were laughing at their conversation.\nThe last thing they saw was Jessica Jones sauntering up to the camera and sending a fist flying towards the lense. The screen went black.\nA moment later two shell-shocked reporters were back on screen. It took a full three seconds for the blonde woman to speak.\n\"Well, there you have it,\" she said, blinking rapidly and looking off balance. \"You heard it here first. Tony Stark is married. To an intergalactic hero.\"\nSteve destroyed four punching bags that night.\n000\n\"Why is getting old so terrible. Getting kidnapped didn't used to be so painful,\" Tony whined as Peter held an ice pack to his side where a large bruise had bloomed.\n\"Well, I guess that means you should stop doing it, then,\" Peter said, voice distracted.\n\"Oh no, but what will I do for fun?\" Tony said dramatically, and Peter snorted.\n\"I can think of a few things,\" he said, eyebrows waggling, but the flirting was half hearted.\n\"Hey,\" Tony said, and tugged him down into a soft kiss. \"I'm okay.\"\nPeter ran a hand through his hair and looked to the side. \"I know that. I do. It's just...I don't' know how I'd get past it, if you died.\"\nTony wasn't sure what to say. He couldn't exactly promise to live forever. He was a superhero, danger was kinda part of the package.\nPeter's lips twisted into a self-deprecating smile. \"Sorry. You're the one who was kidnapped and I'm being all...\"\n\"Shut up,\" Tony said. \"You've got nothing to be sorry for.\"\n\"You're a target,\" Peter said. \"And I don't...I can't protect you all the time. Not with all the meetings you and I are splitting between us for these damn treaties.\"\n\"I can actually take care of myself,\" Tony said, and Peter took a deep breath.\n\"Yeah, I know. I know that. But Tony Stark...he's not in the armor, you know? God, sorry, I sound like an asshole. I know this is just part of you being a sexy as hell superhero. Just ignore me.\"\nTony narrowed his eyes as Peter gave him a painful smile and busied himself with getting a dry towel to wrap around the ice pack. Jontan had expressed similar worries, though hers were from the lense of a child afraid of losing her second family. She'd been a frantic, teary barnacle at his side, and had kept asking if somebody was going to kill him like they'd killed her mother.\n\"I used to have a bodyguard,\" he said. \"It kind of became moot when I joined a superhero team. You're right, though, I've been having to do things solo and I've got a huge intergalactic target on my back now. Would it make you feel better if I found somebody whose job it was to watch my back while I'm being Tony Stark?\"\nPeter looked up at him, eyes wide. \"You'd do that?\"\nTony shrugged, uncomfortable. \"If it makes you feel better, then yeah. I don't think of myself as invincible like I used to, and I have a lot to live for these days.\"\nPeter gave him a bright, blinding smile. \"Whatever you feel is right, babe. I mean that - I want you to be safe, but I want you to be comfortable and happy too.\"\nTony relaxed against the pillows and couldn't stop the soft smile he sent his husband. He already knew he'd start making calls tomorrow. If it made Peter and Jontan feel even a little bit happy and secure, he'd do just about anything. Especially since they didn't ask him, or even hint at asking him, to quit being Iron Man.\nThey understood it was part of who he was, and he honestly didn't think it crossed their minds that he should put away the armor. He could ease their anxiety by doing this one thing for them.\n000\n\"Good morning, Mr. Stark!\" a cheerful voice said, and Tony jumped, barely keeping himself from dumping coffee down the front of himself.\nHe glared blearily up at the man who was hanging upside down from the light fixture in the lobby.\n\"You're supposed to keep me alive, not try to kill me via heart attack every morning,\" he grumbled.\nThe man flipped off the mini-chandelier and landed next to him, falling into step with Tony as he headed for the elevator that would take them to his private parking garage.\nTony had decided to hire Wade Wilson as a bodyguard despite his various character flaws for a few different reasons. The first was that he was undoubtedly good at what he did. Spiderman had also vouched for him, and stated that outside of his swearing, inappropriate sense of humor, and penchant for indiscriminately killing bad guys, he was trustworthy.\nThe best thing about him, in Tony's opinion, was that he couldn't die. He didn't want to hire cannon fodder to take shots meant for him. Trading in one person's life for his own was not something Tony could stomach to even consider.\nSo every day he had a hyperactive, socially incompetent, slightly insane mercenary following in his wake. Tony had insisted that the man wear suits while accompanying him on his day to day business.\nWade had nodded along with him, allowed Friday to order him a few different options, and then proceeded to put them on over his red spandex. The face mask certainly clashed with the Tom Ford, but Tony couldn't find it in himself to complain.\nWhile Wade was overly talkative and tended to skip instead of walk when it was just the two of them, he was surprisingly silent and attentive when Tony was in business meetings. He also had the added benefit of being extremely intimidating when he wasn't being ridiculous, and Tony ended up getting better terms than he usually would in his business contracts.\nPlus, after the Guardians had put Wade through a 'little test' before they approved Tony's choice, they'd been so impressed that none of them worried so much about Tony's safety.\nHe had been getting tired of his teammates 'casually' following him about during the day. Jessica, Gamora and Carol tended to scare the shit out anybody that annoyed them, Matt had started threatening legal action with that unassuming expression he always wore whenever somebody looked at Tony sideways, and Peter kept randomly throwing his body between Tony's and perceived threats. The less said about the day Drax followed Tony around, the better.\nThough it had been annoying, it had also warmed something in Tony. Their actions were irrefutable proof that they cared. They weren't belittling him or trying to convince him he couldn't take care of himself. They had simply decided that he didn't have to face his demons alone.\nWade for his part seemed to have a bit of hero worship going on for the members of The Guardians, and tried to be on his best behavior around them. Which still wasn't great, but Tony knew there was only so much they could expect from the man when it came to mental clarity.\nLater that day Tony was attacked by regular everyday humans that were part of an anti-alien coalition that had recently been classified as a hate group. None of them made it within twenty feet of Tony, who watched, impressed and unconcerned, as Wade took them all down with extreme prejudice but no casualties.\n\"Spidey asked me not to kill anyone while I'm with you where it might get caught on national television,\" he'd related cheerfully when they were back in Tony's Audi and speeding towards the compound.\n\"Huh,\" Tony said. Then, \"Do you want to stay for dinner? We can order tacos.\" He'd never asked Wade to join in the social activities of The Guardians before.\nWade's squeal of delight startled him so badly that he almost drove off the road.\n000\nCarol fumbled for the phone on the bedside table, blinking sleep out of her eyes. The clock next to her said it was three in the morning. She'd only been asleep for two hours.\n\"Danvers,\" she snapped into the phone, sitting up. Most likely this was an emergency, and she cursed the fact that she was stuck in D.C.\n\"Major Danvers, it's Natasha. Please tell me you're at the compound.\"\nCarol paused for just a moment while her mind caught up to the situation. \"Natasha. How did you get this number?\"\n\"Not important. Listen, Carol, I think Steve's on his way to the compound.\"\n\"What?\" Carol said, already getting out of bed and heading for a light switch.\n\"He hasn't been handling the news of Tony's marriage well. When he saw the footage today of Wade Wilson taking out some of Tony's would-be attackers, he lost it. I believe he's become convinced that Tony's unsafe with his current team.\"\nCarol had been hopping up and down on one foot, phone between her shoulder and ear, but she paused at that, honestly baffled.\n\"What? Why would he think that? And why would he care about Peter and Tony getting married?\"\nA short pause. \"He's infatuated with Tony.\"\nCarol resisted the urge to groan. \"Of course he is. Because nothing says 'I love you' like leaving somebody to die in a bunker in Siberia. Alright, I'll call some of the team members that are there.\"\n\"I've already tried,\" Natasha replied, voice strained. \"I'm not getting through. Steve has been spending his time with some soldiers and agents that seem sympathetic to his side. I know at least one of them is very, very good at hacking. I can't find them, and I can't find Steve.\"\nCarol kept breathing through the stone settling in her gut. She didn't mention that Natasha wasn't supposed to have any of the Guardians' numbers. The woman was still a superspy, after all.\n\"Okay. That's fine. I'll call Stephen, he can take a few of his sorcerers and go check it out. And Natasha - thanks.\"\nCarol hung up without another word and prepared herself for a shit storm as she called Stephen, not bothering to try anybody at the compound. She had a feeling Natasha wasn't lying.\n000\nTony woke with a start. He wasn't sure what had pulled him from his sleep, but he was tense, ready for a fight. Something was wrong. He opened his eyes and immediately knew what it was.\nThe room was completely dark. No lights from his various electronics, no bedside clock. His phone wasn't connected to any networks.\n\"Fri?\" he asked, and wasn't surprised when she didn't answer.\nSomebody had hacked into the compound's security. He fumbled for his bedside table and opened it, quickly putting the pieces of the gun he kept in there together without needing light, motions sure and practiced.\nHe had to get to Jontan. Everything else was secondary. He slipped out into the hall and cursed the timing of Peter's trip. He and his team had gone on a diplomatic mission to try and convince one of their new allies to send more troops and weapons.\nThey were due back tomorrow. Tony had to make sure there was still something for them to come back to. He crept down the hallway, gun held in front of him, until he was in front of Jontan's door.\nIt was cracked open and he relaxed a fraction when he heard her soft breathing inside. He slipped into the room and ghosted over to her bed. Pointing the gun down and hiding it behind his leg, he reached forward and gently shook her shoulder.\n\"Jontan, baby girl. Wake up,\" he whispered. She stirred, and turned to face him, her little face illuminated by the moonlight coming in through her window.\n\"Papa?\" She whispered.\n\"Hi, sweetheart. I need you to get out of bed now, okay? We're going to go downstairs.\"\nHer eyes widened. \"You mean to the safe room? Why is it so dark? Where's Friday?\"\nHe hushed her gently. \"Friday's asleep. I just need you to come with me, okay?\"\nJontan hesitated, then grabbed the stuffed bunny Peter had given her before he left and got out of bed.\n\"Good girl. You're being very brave. Come on now, as quiet as you can. Stay right next to me, alright?\"\nJontan nodded, one little hand coming up to grab his shirt as she pressed herself against him. She was shaking. Tony was going to kill whoever was stupid enough to attack his home and scare his child.\nThey slipped back out into the hall and Tony lifted the gun slightly, holding it with both hands. They were almost to the stairs when movement caught his attention. He brought the gun up the rest of the way, but a familiar voice had him relaxing.\n\"It's me,\" Jessica said.\nShe'd stayed over as extra security along with Luke, who was a hulking presence behind her.\n\"Any idea what's going on?\" he asked, stooping down and holding out his arms so Jontan could scurry over into them.\nTony relaxed, knowing that literally nothing could go through Luke to get to her. The man nodded at him once as he stood, Jontan held firmly against his chest, obviously having the same thoughts.\n\"No. I woke up and Friday was offline,\" he said. \"My phone isn't sending anything in or out - we're in a dead zone. Whoever this is knows what they're doing.\"\nJessica fell into place behind Luke while Tony took point, cracking open the door to check the stairwell.\n\"Clear,\" he muttered, and they all entered and moved downwards.\nNot even the red emergency lights were on, so they had to feel their way along. When they finally exited the stairwell into the lower level, all of them had stubbed toes were ready to take out whoever had been stupid enough to attack The Guardians' main base.\nThey'd just started to cross through the rec room towards the panic room when the lights turned back on. Tony blinked rapidly and Jontan let out a little scream.\nWhen his vision cleared, he wasn't sure why he was surprised to see Steven Rogers standing in front of the couch, an awkward smile on his face. Three men and a woman wearing the grey fatigues given to each member of the Allied forces were standing with him, and none of them looked very nice.\n\"Hey, Tony -\" He yelped when Tony lifted his gun and aimed it between his eyes.\nLuke had turned his body so that most of Jontan was covered, and Jessica was cracking her knuckles.\n\"Tony! What the hell!\" he said, motioning for his friends to lower their own weapons. They seemed reluctant, but did so.\n\"Rogers, I should have known it was you,\" Tony said, voice calm even as rage moved through him. \"Not many other people know the security set up well enough to pull this off, even if they had a good tech guy.\"\n\"Or girl,\" the woman said, chin lifted.\n\"Or girl,\" Tony agreed.\n\"Tony, I just want to talk,\" Steve said, raising his hands.\n\"You broke into my home, disabled the security system that keeps my family safe from the multiple threats, and scared the shit out of my daughter because you're mad that I wouldn't talk to you?\"\n\"Daughter?\" Steve asked, brow scrunched in confusion. \"You don't -\"\n\"Papa?\" Jontan said in a wobbly voice, right on cue, and Steve's jaw dropped. Tony glanced back for just a moment as she peeked around Luke, who looked just as furious as Jessica did. \"Are they - are they like the pirates that killed momma?\"\nTony resisted the urge to close his eyes at how small her voice sounded.\n\"No, sweetheart. This is just an old buddy of mine. Jessica and Luke are going to take you into the other room while I talk to him, okay?\"\n\"I don't like him,\" Jontan declared, and Tony knew that she'd stuck out her lower lip without having to turn around.\n\"Tony, if you think I'm leaving you alone with this pile of crazy, you're wrong,\" Jessica gritted out.\n\"Jessica. I need you and Luke to protect Jontan, okay? Steve's not going to hurt me.\"\nJessica's lips pressed together, and Tony knew she was holding back all the things she could say to that, such as the scars on your chest tell a different story, or, not all hurts are physical.\n\"You touch him, you're dead,\" she said, voice low and threatening. \"I hope you like prison, Rogers, 'cause that's where you're heading.\"\nLuke and Jessica edged around the room, Steve's merry band eyeing them warily but not moving to stop them. Apparently attacking children was something even they drew the line at. Good to know Steve had his limits.\nTony's arms were starting to tire, so he took a step back and lowered the gun a few inches after he heard the panic room door shut.\n\"Tony...I'm sorry, I didn't realize there were children at the compound,\" Steve said, eyes wide and earnest. \"Though it seems irresponsible to have one here,\" he continued, and crossed his arms over his chest. \"Superheros can be unstable -\"\n\"Case in point,\" Tony said, tipping his chin towards Steve.\n\"Hey, you don't get to talk to him that way, not after everything you've done to him,\" one of the men, who was almost as large as Steve, blustered.\nTony rolled his eyes at his attempt at intimidation. \"Where'd you find this crew, anyway?\"\n\"Tony,\" Steve said with a sad sigh. \"I don't want to fight.\"\n\"Steve, you realize you're breaking an order of protection, and that it's a felony, right?\"\nSteve gave him a soft smile. \"We both know that you aren't going to send me to jail, Tony. We've been through too much together.\"\nTony gaped at him. \"Uh. By 'we've been through too much,' are you referring to when you took my money and resources without a thank you? Or maybe when you laughed off my PTSD and worries about the Chitauri invading? Or! I know - maybe it was when you let the woman who traumatized me onto the team?\n\"Or! This one is truly my favorite shared memory - when you hid the fact from me that your all time bestie had killed my parents, and then almost killed me when I didn't react well.\"\nSteve's face had lost its softness and become stonier and stonier as he talked.\n\"Tony, I'm sorry, alright? Is that what you want to hear? People make mistakes. It's not healthy to keep punishing me.\"\n\"How am I punishing you? I literally haven't spoken to you for almost two years.\"\n\"Exactly. You ignored me, got that ridiculous order of protection, turned the world against Wanda, and refuse to let me come home. You even got married and pretended to adopt an alien. All you've done is punish me!\" Steve yelled.\nTony stared at him, completely dumbfounded. \"Steve. I mean this as sincerely as possible. You need help. All of that...is just me living my life. I got the order of protection because I am legitimately worried that you'll hurt me or my family if we get in the way of what you deem 'right.' And why would I get married just to punish you? That doesn't even make sense.\"\nSteve was shaking his head. \"Tony, let's not pretend -\"\nA shape dropped down from the ceiling in a shower of drywall, and Deadpool landed behind Steve in all his spandexed glory. He had his swords drawn, and one arm came up and wrapped around Steve's shoulder, pushing a blade snugly against his jugular. Steve's cronies had drawn their guns and had them trained on Wade, though nobody made any move to shoot him.\n\"Ah, ah, ah, your crazy is showing,\" Wade said cheerfully. \"And if I think you're crazy, than you're missing more than a few crayons from the wagon, you know what I mean?\"\nSteve's brow scrunched in confusion as he tried to parse through that statement.\n\"Wade. You aren't due on shift for another couple of hours,\" Tony said, fingertips tingling with the force of his relief.\nJessica had, unsurprisingly, snuck back into the room, and seemed ready to start bashing heads in.\n\"I was in the neighborhood, and realized something weird was going on when the security lights went out. Thought I'd take a look-see.\" 'The neighborhood' consisted of fields and forested lands for several miles on either side.\n\"...You were sleeping in a tree, weren't you?\" Tony asked, and made a mental note to give the man a room of his own, especially after this save.\nWade chose to start crooning Folsom Prison Blues at an annoyed Steve instead of answering. Tony knew him well enough from years on the same team to read his expression. He was thinking about attacking Wade.\n\"Steve, don't. Wade will kill you, and all of your friends. And Jessica and I will help,\" Tony said steadily, meaning every word.\nSteve had crossed a line tonight that Tony couldn't overlook. He'd endangered his daughter. The fact that he didn't know she existed didn't make Tony feel any better about it. If he let Steve walk away from this, there was no guarantee he wouldn't keep threatening Tony's family in his ignorance.\nSteve paused and studied him, and after a moment his face crumpled. \"Tony...\" he said.\nStephen and four of his sorcerers burst into the room, cutting off anything the man might have said. The ensuing fight was short lived as the sorcerers simply froze Steve and his idiot followers in place. Wade grumbled a bit about not being able to kill Steve, but sheathed his swords without another word when Jontan appeared.\nShe dashed for Tony, Luke on her heels, and he swept her up in a hug after clicking the safety on the gun and handing it to Jessica. She was sniffling into his neck, and Steve watched with an unreadable expression from where he was dangling upside down in the air.\n\"I'm sorry I scared you,\" Tony said. \"It's alright now. Come on, we'll let Uncle Luke and Uncle Stephen deal with the police. Let's go see if we can get your sister back up and running, okay?\"\nTony had already gotten the terrified woman that had acted as Steve's hacker to tell him what she'd done to the AI, and it wouldn't be too difficult to reverse. Then he'd have to spend a day shoring up their defenses against his old team.\n\"Friday's really okay?\" she asked, pulling back to stare at him. His heart clenched at how cute she was, and Tony leaned forward to kiss her upturned nose.\n\"Yep. We just need to turn her back on. How grumpy do you think she'll be that she missed all the action?\"\nJontan paused to think about that. \"Not as mad as Aunt Gamora.\"\nTony snorted and turned to leave. \"You're right about that.\"\n\"Tony!\" Steve called, and he glanced over despite himself. \"I'm sorry,\" he said, and for the first time, Tony thought he might actually mean it.\nIt was too little, too late.\n000\nSteve stared at the wall of his cell, feeling almost numb. Tony had a daughter and a husband. Tony had a new team that protected him and loved him. Tony didn't need Steve anymore. None of them did.\n\"Rogers,\" a familiar voice barked, and he shot to his feet, staring at the man in front of him in disbelief.\n\"Fury?\" Standing outside the bars to his cell with his hands laced behind his back and his feet apart was Nick Fury.\n\"You've really gotten yourself into some shit this time,\" the man said.\nSteve looked away. \"Yeah. Are you - are you here to get me out?\"\nFury stared him down, and Steve shifted uncomfortably. \"There's no getting out of this, Rogers,\" he finally said, not unkindly. \"You're going to do time. How much time, and where you go after, depends on what you do next.\"\n\"Sir?\"\n\"Thanos' army was picked up on our outer sensors. He's coming, son. You can help, be the hero I know you want to be. Afterwards you're still going to have a trial, and you won't get off scot-free. But you could get a reduced sentence if you do something heroic enough.\"\n\"And after?\" Steve asked, though they both knew there was no way he'd choose to sit in the cell instead of helping.\n\"You prove yourself, you can join one of the teams in SHIELD. You won't be in charge, but maybe you can prove that there's still something to Captain America.\"\nSteve stared at him, looking for any indication that the man was lying. He didn't find one.\n\"Alright, sir. You've got a deal.\"\nSteve was ready to be a hero again.\n\"This is a bad idea,\" Tony said, and forced himself not to fidget because Tony Fucking Stark did not wring his hands. Even when he was sending his daughter off to her first day of school.\nPeter's lips twitched at the corners the way they always did when he was trying not to laugh at Tony. \"Babe. She can't stay in the tower forever.\"\n\"Why not? There's plenty of space to run, she's got the team and Fri -\"\n\"She's not a pet, boss,\" Friday said, lilting voice holding a note of censure.\n\"I know that, okay, it's just, she's a Stark, which means she's basically kidnapper-nip, and -\"\n\"And Xavier's school is full of people who can deal with the types of threats she faces. She'll have the emergency suit and be connected to Friday at all times. Not to mention that Gamora will be there, and they'll come home every weekend. It's a quick flight over to visit if we take the suits.\n\"Tony,\" Peter grabbed his shoulders and turned Tony towards him, face unusually serious. \"She needs to make friends her own age. She needs to make a life here outside of us. Xavier's school is the right place. You know it is.\"\nTony took a deep breath. Right. Jontan would be fine, especially since Gamora agreed to take (more like bullied her way into) a teaching position there. Alien Races was an actual class that was being taught at Xavier's School for Gifted Youngsters now, and who better to teach it then, well, a famous alien.\nJontan wasn't a mutant, obviously, but when she'd expressed an interest in going to school, staring up at Tony with wide pleading eyes and saying, \"Papa, I want friends,\" he'd been at a loss.\nWhere could he send Jontan where she'd be well protected? He also wanted to shield her from the type of bullying he was worried she would attract in the fancy private schools like the ones he'd attended. Different was not a fun thing to be in high school - he knew this from experience.\nWhen he brought it up to Hope and she'd suggested he call Jean Grey, he'd felt a little silly that he hadn't immediately thought of the X-men. Professor X had been more than open to her attending, even flying out to the tower to meet her.\nShe didn't have any special abilities, as such, but the Professor waved that concern off. She'd been trained in combat by the Guardians for the past three years, and used her race's frankly astounding flexibility to her advantage in a fight in impressive ways.\nThis all meant she'd be able to keep up with the mutant children in their physical classes, and she'd be eligible for extra training with the X-men, as well. She was also far ahead of her peers in the math and sciences, thanks to Friday and Tony being her main teachers. The school would suit her needs well.\nSo he was sending his fifteen year old daughter off to boarding school, and he hated it, even though it was what she wanted. He had already scheduled in time every Wednesday to fly out and eat dinner with her, and she'd be coming home most weekends, but still...it made his skin itch.\n\"You aren't abandoning her,\" Peter said in a low voice, and brought his hands up to cup Tony's cheeks. \"You aren't your father.\"\nTony signed and looked up at him, attempting and subsequently failing to smile. \"It feels like I am,\" he admitted.\nPeter leaned forward to kiss him, soft and sweet and reassuring. \"The fact that you feel that way proves that you're a good dad. She's growing up, is all.\"\n\"Yeah, well, it sucks,\" Tony grumbled.\nPeter grinned. \"Aw, empty nester syndrome, huh?\"\nTony shrugged and looked away. With Parker off to college and Kamala starting her first professional job, yeah, his nest was feeling a little bare. When he brought his gaze back to Peter, he looked thoughtful.\n\"You know...there's nothing stopping us from adopting. I mean, if that's something you want,\" he rushed to add. \"I know it's a lot of pressure on you, when the team and I have to go out and take jobs, but. I'd be down. If you are.\" He brought one hand up to rub the back of his neck, and Tony blinked rapidly while his brain tried to catch up with the information it'd just been given.\n\"I...you think that I'd be...\" Tony trailed off.\n\"Yeah,\" Peter said, low and fond. \"Look at how great Jontan turned out, and she loves you like crazy. I don't know, something to think about.\"\n\"Yeah,\" Tony said, voice rough. \"Yeah, I guess it is.\"\n000\nJontan loved school, and made friends just as easily as Tony had assumed she would. She was a bright, happy, brilliant child, though he could be a little biased. Possibly.\nShe called them every other night, and he and Peter went to have dinner with her at least once a week. It was hard, not having her in the tower, but she was so happy that he couldn't begrudge her the experience.\nHe was fairly busy as one of Earth's acting ambassadors, the CTO of Stark Industries, and a part-time superhero, anyway. Or at least that's what he told himself when he got maudlin.\nThe ambassadorship was a mantle he'd taken up begrudgingly after the defeat of Thanos. Earth was now, like it or not, on the intergalactic radar. Princess Shuri was technically in charge of the diplomatic relations, but he was the 'face' of Earth, disconcertingly enough.\nMarrying the leader of the Guardians of the Galaxy and adopting a refugee from another planet had just made him even more of a darling to the citizens of many other planets, apparently. Not to mention that Stark Industries was now the proud employer of multiple intergalactic scientists, with Hammer and other tech companies clamoring to catch up in the brave new world.\nSo Tony left most of the actual superheroing to the younger generations these days in favor of attending more meetings and heading multiple R&amp;D departments. He was busy, but content in a way that he hadn't ever imagined for himself before.\nHe looked up as Friday lowered the volume of the music in the room, and grinned when Jontan and Peter entered his workshop. He set aside the soldering iron he'd been using and braced himself for impact.\n\"Papa!\" Jontan said, and the next moment he had a face full of white hair while he hugged her tightly against him.\n\"Hey, pumpkin. Good week at school?\" He pulled back and raised an eyebrow when her cheeks turned a deeper blue.\nHe looked up at Peter and was immediately wary when the man grinned. \"Somebody has a date Sunday evening with a girl named Hannah.\"\nTony choked on nothing while Jontan vehemently denied that it was a date. Was fifteen too young date? It was, right? Oh god, he sounded old even in his head.\n\"We're just hanging out!\" she protested, but her blush told a different story.\nThat evening, as Kamala had a whispered conversation with Jontan about what she should wear to her not-date so that she looked nice without 'trying too hard,' Peter grabbed Tony's hand under the table and squeezed.\nHe glanced over and met his warm gaze, then ran his thumb over the band on Peter's ring finger.\n\"This is nice,\" Peter said.\nTony smiled, ignoring Rocket and Drax fighting over the last samosa while Gamora threatened to toss them both out of the window and Parker swiped it out from under both their noses.\n\"Yeah,\" he said. \"It really is.\"\n000\nThirty months. That's how long Steve had been in this maximum security prison. Other than his therapist and letters from Bucky - who was awake and undergoing treatment in Wakanda with new technology adapted from one of Earth's many new allies - he hadn't heard from another soul that whole time.\nWhich was why it was so odd that he was getting two visitors in one day. The first had been Phil Coulson, there to go over the paperwork that signed Steve's life over to a SHIELD team for a period of four years. It was either that, or two more years in prison, and Steve was going nuts locked up on his own.\nSteve would be just another grunt on a team of enhanced individuals. Wanda was going to be the only familiar face on the team. He'd already been warned that if he tried to subvert her in any way he'd find himself back in a cell before the end of the day.\nTheir job was to go into FUBAR situations, clean them up, and then get out without anybody knowing they had been there. It would, Agent Coulson had explained, be very different from other roles that he had played.\nSteve was starting to think that was a good thing. Prison left a lot of time for self reflection, especially when he spent two hours every other day with his therapist, Dr. Oto, who encouraged that sort of thing. Steve thought that the spotlight might have done some unpleasant things to his ego, which was ironic, considering how much he used to get on Tony for the same thing.\nHis attention was brought back to the present by the sound of the thick metal door opening. The man who entered the square, grey room and sat across from Steve as though he didn't have a care in the world was the last person he expected to pay him a visit.\n\"Mr. Quill,\" he blurted, shocked.\nHe was a handsome man, Steve could admit, especially when he was sitting four feet from you. There was a charisma that reminded him of Tony, a bit, and the sort of confidence that made you immediately trust that this was a person who knew what he was doing.\n\"Mr. Stark now, actually, but I guess you already knew that,\" Peter Quill said with a sharp smile that didn't reach his eyes.\nSteve flinched. He hadn't forgotten, exactly, but he also hadn't purposely used Peter's original name as an insult, either.\n\"Sorry,\" he said, the word sounding stilted and disingenuous even to his own ears.\n\"I'm not,\" Peter said with a wink, and Steve clenched a fist under the table.\n\"Why are you here, Mr. Stark?\" he asked, the use of his married name leaving a sour taste in his mouth.\n\"Well, the Guardians received a head's up that you were being released into SHIELD's custody a few years early. I came to give you a friendly warning, since Tony is annoyingly soft hearted.\"\nAll of Peter's casual arrogance melted away as he leaned forward, leaving only a hard-eyed man that looked more than willing to snap Steve's neck at the slightest provocation.\n\"You come anywhere near my family again, Rogers, and I will end you. If I'm not there when you make your move, I will hunt you down, though it's doubtful there'd be anything left for me to tear apart by the time the other Guardians were done with you.\"\n\"You're threatening me?\" Steve asked, his own eyes narrowing as he leaned forward, blood beginning to pump at a faster rate through his veins as adrenaline hit.\n\"Damn right I am,\" Peter said, and when he leaned back he was once again the affable, slightly goofy, sexy leader of the Guardians of the Galaxy that the media loved to snap pictures of.\n\"I know you pulled some hail mary shit in the Infinity War that ended up saving my team's ass, so I figured I owed you at least a warning. So here it is: we've all agreed. You get within two hundred feet of Tony, and we're reacting with deadly force.\"\n\"We?\" Steve said.\n\"Yep. We as in, his team. His real team.\"\nSteve looked down at the table. \"I'm not - I don't plan on making any more trouble for Tony,\" he said. \"I wish that we could get past this, but if it makes him uncomfortable when I'm around, I won't push it.\"\nSteve still thought that he and Tony could be happy again, as friends at the very least, but Dr. Oto had spent a lot of time explaining the modern-day version of consent to him.\nAgent Coulson had also been very, very clear on what would happen to Steve if he broke the order of protection again. Ten years in prison, minimum, with no more chances. Steve never wanted to come back to this place.\nHe looked up and met Peter's surprised gaze. \"Tell him I said that, will you? I won't show up like that again. I promise.\"\nPeter tapped his fingers on the table and narrowed his eyes. \"Alright. I hope for your sake that you're not lying. Killing Captain America wouldn't be good for our image.\"\nWith that parting shot, Peter stood and shoved his hands into his well-fitted jeans. Steve imagined being in his place, just for a moment. He was probably going to leave this hellhole and go home to Tony and their adoptive daughter. He'd probably smile and kiss him hello and listen to Tony ramble on about whatever project he was working on.\nSteve hadn't ever hated somebody that wasn't a supervillain or HYDRA before. But he couldn't help but hate Peter Stark, just a bit, as he sauntered out of the room, leaving Steve alone with his thoughts.\n000\nTony stood outside the hospital room, tapping his fingers on his thigh and listening to the low murmur of voices coming from inside. He motioned for Wade to wait in the hallway for him.\nHe wasn't sure at what point he'd started to be able read his expressions through his mask, but he could tell the man was pouting at being left behind. He rolled his eyes and turned away from him, deciding not to engage in a snipe-fest with his bodyguard.\nThen he took a deep breath and plastered a smile on his face before breezing through the door.\n\"The hero of the hour,\" he said, and tried not to falter at the sight of Natasha lying in the hospital bed, bandages wrapped around her shoulder, skin pale against her red hair.\nHer eyes had widened minutely at his entrance before her expression went blank in a way that he knew meant she was having Feelings. Sam, who had been sitting by her bedside, stood, though he didn't bother to wipe the surprise off his face.\n\"Tony,\" he said. \"I - hello.\"\nTony tossed him the stuffed bear that he'd brought, and Sam fumbled to catch it. Natasha's lip quirked up on one side when she saw it.\n\"Get well gift?\" she asked, voice light, as though this wasn't the first time they'd spoken in almost five years. Her eyes, though, held a wariness that gave away her discomfort.\n\"Well, you did take a shot meant for the spiderling, I figured a stuffed bear was the least I could do.\"\nTony had watched the footage afterwards. The shot of blue energy from a gun of the alien-of-the-week probably would have taken Peter's head off. He'd been turned away, covering War Bird's flank, and wouldn't have dodged in time.\nThen Black Widow, who had been called in for backup along with Falcon, had pushed him out of the way, taking a glancing blow in the process that had removed a large chunk of flesh just below her collarbone.\nNatasha shrugged. \"I was backup, just doing my job.\"\nTony put his hands in his pockets. \"The team noticed that you tend to do that a lot. Your job, I mean. Both of you.\"\nSam and Natasha exchanged looks, but didn't say anything.\n\"Anyway. I'm here to offer you both a spot on the Guardians, if you want it.\"\nNatasha's shoulders stiffened, and Sam's mouth dropped open in surprise. They really needed to work on his poker face. Unsurprisingly, it was Natasha who spoke first, and she went straight to the point.\n\"The team...does that mean you, too, Tony?\"\nHe sighed, then reached up and took his sunglasses off, letting his facade fall.\n\"Yeah,\" he said. \"It does. Listen, Natasha, I don't know if I'll ever be able to count you as a friend again, but you've proven multiple times that you can have our backs in the field. According to your current SO, you and Sam both follow orders just fine.\"\nSam was blinking rapidly at him, and Tony took a step back when he realized the man was trying not to cry,\n\"That - thank you, man. I know I don't deserve another chance, so just - thank you. I promise, I won't let the Guardians down.\"\nTony shifted, uncomfortable. \"Well, I guess that's a yes from you, then.\"\nSam nodded. \"Yeah. Yes. That's a yes.\"\nNatasha met Tony's gaze squarely when he looked at her. She studied him intently for a good thirty seconds before slowly nodding. \"If you're really okay with it, Tony, then yes.\"\n\"Great!\" Tony put his sunglasses back on and then clapped his hands together. \"Carol will be reaching out soon to get everything set up, then. Thanks again for keeping the kid alive.\"\nHe was almost at the door when Natasha spoke. \"Thank you, Tony. Really. And, for what it's worth...I really am sorry.\"\nHe paused at the door. \"I know,\" he said.\nAnd he did.\n000\n\"Boss, you've got a call from the adoption attorney. Should I patch him through to Mr. Stark, as well?\"\nTony paused, finger hovering over the hologram of the Spiderman suit's most current upgrade. It had been seven months since they started actively looking into adoption. He had been vacillating between excitement, hope, and fear ever since the first meeting with the adoption agency.\nHe took a deep breath before glancing over to one of the cameras in the corner.\n\"Yeah, Fri. Let's do it.\""
}