{
    "id": "14221968",
    "url": "https://archiveofourown.org/works/14221968?view_full_work=true",
    "author": [
        "a_dale"
    ],
    "title": "Recruitment",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Multi"
    ],
    "fandoms": [
        "Teen Wolf (TV)",
        "The Avengers (Marvel Movies)"
    ],
    "relationships": [
        "Clint Barton/Stiles Stilinski"
    ],
    "characters": [
        "Stiles Stilinski",
        "Clint Barton",
        "Natasha Romanov (Marvel)",
        "Tony Stark",
        "Phil Coulson",
        "Steve Rogers",
        "Derek Hale",
        "Scott McCall (Teen Wolf)",
        "Isaac Lahey"
    ],
    "additional_tags": [
        "Stiles is recruited by S.H.I.E.L.D.",
        "Spark Stiles Stilinski",
        "Clint Barton Needs a Hug",
        "Post-Nogitsune Stiles Stilinski",
        "Alpha Derek Hale",
        "Emissary in Training Stiles Stilinski",
        "SHIELD Agent Stiles Stilinski",
        "idek what to tag this as",
        "SHIELD doesn't know about the supernatural",
        "I dont even know what I'm doing anymore",
        "everything is trash",
        "including me",
        "Don't copy to another site"
    ],
    "language": "English",
    "series": "",
    "published": "2018-04-05",
    "completed": "2018-05-11",
    "words": "35,540",
    "chapters": "10/10",
    "comments": "307",
    "kudos": "6,112",
    "bookmarks": "1,702",
    "hits": "80,078",
    "summary": "<p>Stiles Stilinski is hired by SHIELD while studying in New York, and ends up recruited to work under none other than Phil Coulson. This is how he meets the Avengers.</p>",
    "notes": "<p>Honestly this fic has gotten away from me a little and the original direction i wanted to take just isn't going to work anymore at ALL but hopefully this isn't getting too out of hand and it's still enjoyable to everyone </p>\n<p> </p>\n<p>AKA the author has no idea what she's doing anymore SORRY</p>\n<p>WOW OMG IM SO SORRY I DIDN'T MEAN TO LEAVE Y'ALL HANGING SO LONG!!!! I've been out of the country and totally forgot that I wouldn't have access to wifi BUT now I am back, and here's the next chapter &lt;3</p>\n<p>as a further apology, here's the end. Thank you so much to everyone who's been reading, and/or commenting, and/or leaving kudos &lt;3</p>",
    "text": "Stiles was sitting in his advanced mythology class when the suits walked in. There were three of them, obviously government type, and Stiles spotted at least two concealed weapons on each of them. He couldn't help but wonder what they were doing in his class. He was careful not to react beyond mild interest at what would obviously be an interruption. He watched as they pulled the professor aside, watched as his prof nodded before stepping back. \n“Thank you for allowing us to interrupt.” one man said, going for kindly, but his eyes were too sharp for Stiles to find it believable. “We are here from S.H.I.E.L.D. and are here to present what could be an opportunity for every one of you.” and that had Stiles' attention. A recruitment speech? That was certainly unexpected. While the first one spoke, presenting the benefits of S.H.I.E.L.D., the other two handed out forms to the 40 students in the room, and Stiles couldn't help but raise his eyebrows as he looked at the questionnaire. What was his favourite colour? Write an essay on why movie interpretations were better than the book? Well that question was obviously to see how well you could lie because everyone knows that the books are always better. The rest of the questions though reminded Stiles of a psych eval, and that grated at him. He hated psych evals, but the short essay questions were amusing; if you could have any super power, what would it be and why? Explain why the moon is better than the sun. \nLetting his amusement guide him, Stiles filled out the form as if it were serious, because hey, why not right? He was definitely going to be limited in what a degree in Mythology with minors in Latin and Biology. Not that he'd been worried since the information was more for the pack than anything else. Going to MIT allowed him to apprentice under one of the most well renowned witches to help him train his Spark. When he handed back the questionnaire along with every other student, Stiles never expected to hear back from them. \n \n&gt;&gt;&gt;\n \n“You'll never guess who came to my class for a recruitment speech.” Stiles opened with the moment Derek picked up the phone, and he didn't miss the huff the alpha gave him. \n“Who?”\n“S.H.I.E.L.D.” there was a pause, and then-\n“The ones who broke New York?” Stiles couldn't help but laugh. \n“That would have been the Avengers, but yeah, they're technically the ones who got them all together. To be fair they also handled clean up.” Derek just gave a grunt. \n“Why?” \n“Dunno. They gave out a super weird questionnaire. Kind of a mix between a psych eval and a creative writing assignment. If it wasn't for the fact that nobody would dare impersonate S.H.I.E.L.D. in New York of all places I would have thought it was fake.”\n“You had your myth discussion class today, right?” Derek asked then, and Stiles couldn't help his smile.\n“Yeah.”\n“I don't trust it. As important as your studies are, they don't exactly promote an interest in a government agency.”\n“I had the same thought.” he flopped back on the bed in his small room in residence, kicking his shoes off onto the floor. “But I filled it out anyways. Why not, right?” there was a pause and Stiles rolled his eyes. “If they try and contact me I'll call you, sourwolf. Chill.” Derek gave a low growl but Stiles just snorted out a laugh. “Anyways, tell me about the house – you guys almost finished painting?”\n \n&gt;&gt;&gt;\n \nStiles had almost forgotten about the recruitment form he'd filled out until the knock came on his door nearly a month later in the form of another suit standing outside his room in residence. He had his phone to his ear, Isaac on the other end, and stopped short when he came face to face with the unamused looking man. \n“Isaac, my man, I gotta go. Tell Derek I'll call him in an hour.” he said lightly, but he knew Isaac knew what it meant. If he didn't call in an hour, he was in trouble. He hung up, sliding his phone into his pocket, looking at the man with a raised eyebrow. “Can I help you?”\n“Mr. Stilinski, you've been selected for an interview.” he was handed an envelope and couldn't help his surprise as he opened the letter to see what he assumed was the official S.H.I.E.L.D. letterhead. \n“This says my interview is tonight.”\n“Yes. The university was consulted for your schedule.” and that was all he was getting apparently. \n“Great.” but the man didn't move. “Is there something else?”\n“Will you need assistance arriving at the interview?” that had Stiles lifting a sarcastic brow. \n“Why, you going to wait around to escort me?” he snorted out a laugh, ignoring the slight narrowing of the man's eyes. “Thanks but no thanks, man. I can get there myself. But I'll make sure to let them know when I get there that you offered.” he gave a lazy salute and closed the door without waiting for a response, throwing the lock and reinforcing it with his Spark just in case the guy got any ideas. But after only a moment he heard the man's footsteps leaving and turned his attention back to the letter in his hand, pulling out his phone and dialling Derek's number.\n“What happened?” was the immediately growled response, and Stiles grinned.\n“I have an interview with S.H.I.E.L.D.”\n \n&gt;&gt;&gt;\n \nStiles wasn't really surprised this time when the S.H.I.E.L.D. agent showed up at his dorm. The interview had gone very similarly to the questionnaire, if not more informal, and at this point, Stiles figured if he could pass the questionnaire, the interview would be no different. The agent who showed up didn't stay this time, just gave him a package that informed him that he had to show up at 06:00 the next day for orientation and Stiles had just been annoyed that of course he would have to be up early on a Saturday. Only problem being that he'd promised Derek that he'd visit home to add another ward to the now finished Hale house. He could theoretically change his flight from tonight to an afternoon one tomorrow - but Derek was not going to be pleased. On the other hand though, he actually wanted to go to this interview and he also knew Derek would understand that. He looked at his phone and for a moment he couldn't help but glare at it viciously. He wished he could be telling the pack about all this in person - missed them desperately and realized that with this job he might not be going home at the end of the semester when he graduated. The realization was a weight in his stomach. He didn't realize he'd dialled his phone until Derek was saying his name, and he swallowed past the lump in his threat.\n\"They hired me.\"\n \n&gt;&gt;&gt;\n \nHe should have known that orientation also meant fitness test/competency with combat and he was extremely grateful now that he'd decided back in high school to train with Alison and Chris and later Braeden. Glad that when Peter and Derek had offered him lessons of their own, he'd accepted. Though he'd never be as fast as a wolf, he'd learned how to be just as dangerous. At the beginning he made sure to keep himself in check though - just because he was capable didn't necessarily mean he wanted these people to know. When it was his turn on the mat however and he was faced with a guy who looked every bit the douchebag he proved himself to be when he gave Stiles a once over and a sneer, Stiles made a new deal with himself. He'd hold himself back but there was no way he wouldn't kick this guys ass.\n \n\"Agent Stilinski.\" And he couldn't deny the little thrill it gave him to hear those words even as he looked up from where he'd knocked the douche on his ass. Something about the way this  guy carried himself told Stiles that he wasn't a new recruit and he was wary now as he followed when the man waved him over to a new mat, tossing his sweater down. Stiles pushed a hand through his hair, not moving onto the mat but not stepping away. There was a glimmer in this guys eyes that said he was looking forward to beating Stiles and it made it clear that Stiles hadn't been as subtle as he'd hoped. That was his prides fault and he knew it but he was no longer the skinny kid who got his ass handed to him to hurt his friends - he was the one who fought tooth and nail to keep his friends from getting hurt and somewhere along the line he'd learned that doing that meant protecting himself from harm too. But this guy looked too much like Jackson had been at the beginning - he knew he was good and he wanted to knock Stiles down a peg for thinking he was good enough. If Stiles had hackles he knew they'd rise.\n\"Who are you?\"\n\"Agent Ward. I was asked to do a demonstration.\" And Stiles couldn't help his reply.\n“Ordered more like.\" And watched the agent give a grin that promised pain.\n“Step onto the mat agent Stilinski.\" Stiles knew this was a test - knew he was expected to be beat up but take it because he was new and sometimes the enemy beat you and you should never show too much pride. But even as he knew that he also knew Ward would have to knock him out to stop him from fighting back because he was nobodies punching bag and they'd chosen him to be here just like they'd chosen Ward. Without hesitation he stepped onto the mat.\n \nStiles felt grim satisfaction as he pressed the ice pack to his black eye. He'd taken a couple hits and his ribs were a bit sore but he'd given as good as he'd gotten and though Stiles hadn't won the fight it had been a definite draw. It gave him a vindictive sort of pleasure that he couldn't even be bothered to not feel.\n\"That was quite an impressive display, Agent Stilinski.\" A voice said, interrupting his thoughts. \"We've been hard pressed to find anyone able to take on Ward in quite a while.\" Stiles looked up to see a man who was probably in his mid 40s giving him a wry smile. He was wearing a much nicer suit than the suits from before and Stiles figured this was probably Ward's superior. When he didn't say anything, the man sat next to him in the chairs outside of medical. \"I'm impressed.\" The man said then earning a wary glance from Stiles. \"We've been trying to find someone to knock him down a peg or two and you did the job quite well.\" That had Stiles narrowing his eyes.\n\"So you used me.\"\n\"On the contrary; Ward's attempt to use you backfired and put you on my radar.\" He lowered the ice pack.\n\"And just who are you?\"\n\"Phil Coulson.\"\n\"Right.\" Stiles said, drawing the word out. \"Are you supposed to kill me or something?\" For a moment the smile flickered to something more genuine before settling back to blandly polite.\n\"No, I'm here to offer you an opportunity. I watched your fight with Ward - the only reason you allowed yourself to show your full skill set was because you refused to let him make an example of you for his own ego. I admire that quality and I would like you to work under my command.\" Stiles knew the man was being sincere but that didn't mean he wasn't still a little suspicious.\n\"Last I checked you were the handler for the Avengers. I'm not really looking to be front line fodder against their enemies.\" And there was that flash of genuine amusement again. Stiles was beginning to realize it was approval.\n\"Good.\" He handed Stiles a card. \"I recognize you have to finish your studies. The moment their finished is when you begin. I'll debrief you in my office.\" With that he stood, doing up the single button of his jacket before leaving. Stiles just pushed the ice against his eye again, holding the card in his other hand. He let his head fall back against the wall, wincing at the impact. What was his life turning into?\n \n&gt;&gt;&gt;\n \n3 weeks 2 days and 4 hours later, Stiles was knocking on the door of the office designated as Agent Coulson's. He'd finished his final exam and hadn't even thought twice before making his way here and even as he knocked he felt a bit ridiculous. Agent Coulson probably hadn't meant immediately after he was finished - but he hadn't been able to help himself. The door opened and that flash of a smile appeared.\n\"Right on time.\" Even as he stepped in the room he saw another man was already in the room and he instantly recognized who it was.\n\"Hawkeye.\" He blurted out, and then couldn't help his flush. The archer just blinked in surprise before offering a smirk. He obviously hadn't expected to be recognized - at least not instantly.\n\"You must be Agent Stilinski. Ward's still pissed you beat him at your orientation.\"\n\"I didn't beat him.\" Was his instant reply, but Clint shrugged.\n\"You kept it even which is as good as against Ward.\" Stiles just looked back at Coulson and found a uniform being handed to him.\n\"This is yours. It's your uniform.\"\n\"Great, okay - uniform for what exactly?\" He was handed a folder next and flipped it open.\n\"Analyst. Alright. What exactly am I analyzing?\"\n\"It's all in the file. If you'll follow me -\" Coulson lead the way out of his office and Stiles noticed that Hawkeye followed them.\n\"Don't you have super secret spy stuff to be doing?\" Stiles couldn't help but ask and Clint just smirked.\n\"Yes.\" He didn't stop following them though and Stiles narrowed his eyes which only make Clint's smirk widen. Stiles scowled and turned back to Coulson who lead him into a room with about 10 other agents in it.\n\"This is where you'll be working.\" Stiles noticed that everyone here was wearing the exact same outfit Stiles was holding in his hands and hid a snicker behind a cough.\n\"So when do you want me to start?\"\n\"Tomorrow. For now, review the packet and then report tomorrow at 0:700.” Stiles could only nod, gripping the file tightly in his hands. When he glanced over his shoulder to see if they were still being followed, Hawkeye was nowhere to be found and Stiles just shook his head. Damn supers. \n \nBeing an analyst, even under Agent Coulson, who he learned was a lot more renowned than he'd thought – was still kind of boring. He was doing exactly what he'd always done – piles and piles of research – the difference being that here the subject wasn't always of his choice. It was on intel being gathered for missions across the board – and while he felt pretty damn special being trusted enough right off the bat to go through all the information for some of the highest level of missions going on, he couldn't help but feel like this wasn't his place. After all, what was a guy like him with only minimal (reported) skill for this sort of thing doing research that could actually hurt someone if done wrong. Sure, research had been a big part of his schooling but that meant nothing in this scenario. A lot of the data that passed through his hands was more technical – less up for interpretation. Not to mention that all of it directly related to what could potentially become Avengers related missions. Which was a lot of stress. Not to mention the fact that people were constantly trying to get on this team – begging and bribing and even sometimes threatening – and all because he'd taken on Ward in a physical fight? It didn't sit well with him. \n“Did you ever consider,” Lydia had told him softly one night when they were Skyping, “that it isn't about the fact that you beat him, but that you wouldn't back down to a bully?” and he hadn't really considered that but he knew she was right. So he'd continued on – continued his work for Coulson and ignored the fact that more and more of the information he dealt with became more and more to do with the Avengers. It wasn't until the moment that he realized that he hadn't even seen any information relating to any other missions in a week that he confronted Coulson. \n“I'm not qualified for this.” Stiles said even as he walked in the door, and Coulson looked up at him with raised brows. He knew that nobody else dared to just barge into Coulson's office, but he couldn't be bothered to care. “I've only been here for a few months and I haven't had any real training but I'm handling information for Avenger missions. There are tons of agents with way more experience clamouring for this kind of work – tons of agents who are trained for this kind of thing. None of which are me. The only thing I had going for me was that stupid fight with Agent Ward, so what am I doing here?” Coulson had remained quiet during the whole rant, and stayed quiet after, watching Stiles impassively, but Stiles didn't budge – didn't fidget – wouldn't be ashamed or back down. He was right, damn it, and he knew it. After a minute of tense silence, that flash of a smile passed over Agent Coulson's face again and he set his pen down, sitting back in his chair.\n“And that is exactly why you're qualified. You never expected or even wanted to work with this information; you handle it the exact same way you handled all other information that crossed your desk and your fight with Agent Ward was proof enough that you're willing to fight for what you believe in.”\n“And what exactly do you think that is?” because he couldn't deny Coulson's first claim – he'd never really wanted to work on Avenger stuff – not because it wasn't cool but because he'd had his taste of danger already and knew it wasn't as exciting as it seemed; and he did treat the information the same because he knew how bad having bad information could be – had the scars to prove it. \n“You believe that you don't deserve to be treated as anybodies lesser just because you're young or new or smaller – and that belief extends to other people. You have a rare view on equality, Agent Stilinski, as much as you'd think that wasn't the case in todays society. Unless someone has proven themselves unworthy, you believe they are at least your equal. That's admirable.” and he'd never realized he was so transparent before. Before he could respond, the hairs on the back of his neck stood up and he knew someone was behind him, and too close for comfort. He took two quick steps forward before turning to see Hawkeye lounging against the doorframe and just let out a breath. \n“I'll be at my desk, sir.” he said to Agent Coulson and was quick to pass by the archer, avoiding his gaze. \nAs soon as Stiles was gone, Clint turned back to Phil and pulled the thumb drive out of his pocket, tossing across the room. Phil caught it easily, tucking it into his pocket. \n“Stark's having a thing tonight. Nat wants to know if you're coming cause she wants pizza.” Phil smiled at that. He was the only other person with her love of the hottest peppers mixed with pineapple on a pizza. \n“Tell her I'll be late, I have to finish writing the brief for Fury.” Clint just nodded, but before he could leave he turned back to Phil. \n“Why do you think he doesn't think he's qualified?” he asked, honestly curious, because he'd worked off the intel agent Stilinski had compiled and it was thorough. Phil didn't answer right away, but when he did he made sure to meet Clint's gaze. \n“I have a feeling that agent Stilinski has experienced a lot of things in his life, despite his age.” was what Phil opened with and it had Clint frowning. “And I think that those experiences have made him wary of danger. While everyone else finds being able to work on missions for the avengers is exciting and exhilarating, Stiles treats the team like you're just normal people – like anything could kill you – and he's not wrong. But that's what makes him good. He doesn't let anything slide because you're the Avengers. He acts like he knows the consequences of that. But on that note, he's never worked for a serious agency before. If his father wasn't the sheriff of his home town he'd probably have a record because of his insatiable curiosity, and he's afraid someone will get hurt because he missed something because he's new to all of this.” Clint opened his mouth to answer and then thought better of it. He needed to think about this. So he shook his head and changed the subject.\n“Rumour is, Ward's looking for a rematch. He isn't likely to play by the rules.”\n“If Ward thinks that agent Stilinski is easier to fight caught by surprised, he may learn another valuable lesson.”\n“What lesson is that?”\n“That his pride will always cost him.”\n \n&gt;&gt;&gt;\n \nIt was only years of instinct that had Stiles ducking out of the way when the baton was swinging towards his head from around the corner. He spun around, catching the baton this time and twisting as he pulled, freeing the weapon from the hands of his attacker before he tossed it down the hall, turning back just in time to see Ward coming at him, throwing up his arms to block a swing towards his head. It was the end of the day - everyone else had gone home in this wing, and it looked like Ward knew that - knew he usually stayed late, knew he was usually the last in this area, because he’d come prepared. He forced Stiles back before he could catch his balance and Stiles’ lips pulled back in a snarl. \n“What the hell is your problem?” and Ward just scoffed, grabbing another baton from his belt. This one, however, was one he recognized, and his eyes narrowed when the electricity crackled along it’s length. Ward swung it forward but Stiles shoved himself back out of reach. From the sound of the buzz, the wattage on that thing was higher than it should have been, and if it hit him he’d be down for the count. He needed to stop Ward, and fast. Problem was, Ward had thought this through. He’d cornered him in a hall where the only way out was past him or pack through a door with a passcode. While Stiles knew the code, it would take him time to input it, and that was valuable time he didn’t have. He vaulted back, grabbing the baton he’d disarmed Ward of before, and would’ve rolled his eyes at how typical it was that this one was just a regular old baton. He ducked and did a sweep with his leg the next time the baton came towards him, and when Ward jumped he moved in close, shoving the baton up in close, snapping it against Ward’s elbow that held the electrified wand. Ward grunted out in pain but didn’t release the wand and Stiles only just managed to get out of the way before it caught him in the side. They squared off and Ward bared his teeth in a mockery of a smile. Stiles’ just swung the baton around, getting ready. If he could just get Ward to drop the baton he’d be able to at least get past him, but it was getting in close enough to disarm him that was the dangerous part. Ward came at him again and Stiles was forced to stay on the defensive. He was exhausted from the strain of the day, stressed from the fact that he hadn’t been home to visit the pack in way too long, and confused about why a certain archer was being found more and more often around and always where he had to be - he didn’t have time for this shit. That’s when it hit him. He didn’t have time for this shit. He didn’t have to have time. He was on the defensive trying not to cause any damage, but Ward was trying to take him out, and take him out hard. \n“Screw this.” he snarled, and he dropped down, throwing the baton in his hand at Ward’s hip, tossing him off balance when he tried to catch himself after avoiding the blow, and in the same motion Stiles grabbed the knife he kept in his boot, coming up fast. Without any hesitation, he snaked forward, slicing the knife down across Ward’s forearm, and when his arm jolted in reaction, opening his hand, Stiles grabbed the electrified baton as it fell, slamming it into Ward’s stomach. “Weren’t expecting that, were you, asshole.” Stiles snapped. He huffed out a breath, falling back against the wall as he looked at the baton in his hand, turning off the electricity. He looked over at the sound of quick footsteps approaching and grimaced when none other than the archer he’d been thinking of showed up. \n“I think maybe he shouldn’t be allowed access to the big boy toys.” Stiles muttered, tossing the now safe baton at Clint, who caught it easily, looking from the weapon to Ward, expression darkening. \n“Word got round that Ward looked ready to do some damage. Figured he’d come after you.” was the archer’s reply, and Stiles just stared at him a moment.\n“You coming to my rescue?” and Clint shrugged.\n“Ward was pissed. I’m not surprised he tried to fight dirty.” and Stiles didn’t miss the disapproval to his tone. \n“Yeah well, so did I.” Stiles admitted, showing the knife. Clint blinked at him but then chuckled. \n“Good for you.” and that was approval. Then he pulled the heavy duty cuffs out of his back pocket, shoving Ward over with his foot to snap them around his wrists behind his back. “Want to help me drag his ass to holding?” and Stiles gave a vindictive grin. \n“Damn straight I do.” \nAs they hauled Ward up between them, Stiles glanced across his unconscious form to where Clint held the man up on the other side. This was the fourth time this week the archer had just so happened to come across him, and this time he knew it was on purpose. For a moment, he wondered if maybe all the times were on purpose, but then shook it off. That was ridiculous. Clint Barton codename Hawkeye was one of the top marksman in the world, he was part of a superhero team, and he in no way would be following Stiles of all people. It struck him then that he should be more focused on the fact that he wouldn’t have found it weird if the archer was actually following him, but shrugged the thought off. With the werewolves he’d grown up with, it was no surprise he’d been desensitized to stalking. He glanced back at the archer one more time. It didn’t hurt to admit that he wouldn’t have minded, but there was no point on dwelling on it. Without further evidence, it was probably just coincidence. Stiles nearly snorted at that. Nothing in his life was ever coincidence. \n \n&gt;&gt;&gt;\n \nStiles knocked on Coulson's door, frown in place, staring at the file in his hands. When Coulson's voice beckoned him in, he opened the door, looking up from his file to see Coulson behind his desk, writing in a report. He stopped and looked up when Stiles approached the desk, brow rising with the unasked question. \n“I think someone's been tampering with some of the files.” he said without further prompt, and that had both of Coulson's eyebrows shooting up. \n“Do you have any evidence of this?” and Stiles shook his head, frustrated. \n“See, that's the thing. I think they're not only changing the electronic files, but switching out the paper ones.” he offered the file in his hand and Coulson took it. \n“I read that file yesterday, it's about the toxin levels taken from the water near a suspected AIM base. But here's the thing – I could have sworn there were low levels of radiation in that file yesterday because I sent a request to have the elementary school down the road tested to make sure those kids are safe.” that had Coulson looking up. \n“There's nothing here about any levels of radiation.”\n“Exactly. But I know it was there. Otherwise I wouldn't have put in the request because it would be a waste of resources. That's the other thing. The request disappeared too. I checked for the record of it, and there is none. And this isn't the only file. The last couple incidents relating to AIM, everything still under open investigation that is, things seem to be changing. And I didn't notice at first – well I did but I assumed it was people correcting their work you know – but with this? Someone had to manually remove my request, and there's no reason anyone should have done that. If the reports were wrong and the test wasn't necessary it would have just been denied not erased.” and Coulson was inclined to agree. \n“Do you remember what the levels of radiation were?” and Stiles shook his head, obviously frustrated. \n“No. I know they were low, but just high enough that regular exposure could cause a problem.” then he paused, taking a deep breath before meeting Coulson's gaze head on. “I know you hand picked this team, but somebody in that room is tampering with files. These were locked in my desk which means somebody had to pick that before they could access it to switch it out. But I reviewed the camera feed and didn't see anything. Maybe they're a really good hacker – maybe we need better security. But I want that radiation test for that school. And I want whoever is messing with my files out of there.” Coulson didn't respond right away, instead his gaze flickered past Stiles just as the hairs on the back of his neck stood. \n“I'll have Stark take a look at the video. If someone's messed with it, he'll know, no matter how good they are.” and it was Clint's voice who cut in. Stiles glanced back, almost wary. Ever since the incident with Ward in the hall he’d been seeing a lot of the archer, but that didn't make the favour a bit out of character. Then again, this was a raid he'd be on if it turned out to actually be AIM, so maybe it wasn't so strange after all. \n“Great. In the mean time, I need more samples. And I'd like the results sent directly to you, sir. If it goes through that room, I don't currently trust it not to be altered. Plus, that can tell us if it's someone from the lab or not.” Coulson just nodded.\n“I'll put the request through personally. I appreciate you bringing this to my attention.” Stiles gave another nod before rushing off. He had his own ways to find out who was behind this.\n \nThe two men watched the younger agent stalk off before Clint turned back to face Phil's desk. Phil just shook his head.\n“If you keep appearing whenever he's here he's going to notice.” his handler said, and Clint made a face at him. \n“That would mean he'd have to know that I wasn't here the rest of the time.” Phil gave him a look to tell him just what he thought of that argument, but Clint just flopped onto the couch along the wall of his office.\n“I would rather you didn't stalk my agents.”\n“I'm not stalking him – just keeping an eye on him.”\n“You saw for yourself that he's perfectly capable of taking care of himself.” Clint grinned. \n“Twice. I showed Nat the clips. Even she was impressed.” Coulson just shook his head. \n“Was she equally as impressed with your stalking habits?” Clint just vaulted off the couch. \n“I'm not stalking anyone.” he tossed back, even while remembering Nat's gentle reminder; don't just follow him – speak to him. She, if anyone, understood why that was difficult for him; it was easier to just watch from a distance. That way, the thing he cared about wouldn't be damaged. Clint shook the thoughts from his head, ducking into an empty corridor before pulling himself into the vents. It wasn’t that he hadn’t spoken to Stiles, in fact, he’d gone out of his way to do just that, but he’d kept it casual - more than casual. He scowled. He’d been telling the truth, he was just keeping an eye on the other man; after all he'd heard some of the offers and threats made by other agents who wanted his job. Plus, Agent Stiles Stilinski really was good at his job, and his work had a certain flare to it. Sooner rather than later, the others were going to want to meet the man behind organizing their intel so it was best to watch anonymously now while he could. He couldn't help but scowl again when the thought crossed his mind; it did sound a bit stalker-ish. \n \nIt was supposed to be Stiles' day off but he was starting to realize that he wouldn't really get days off. He was running through the halls in his street clothes, scrambling around corners to get to the analyst room he worked in. He slid around another corner and only just managed to dodge around Clint who blinked at him in surprise. \n\"Isn't today your day off?\" Clint asked, automatically turning to catch up. \n\"I was reading a thing yesterday and something caught my attention but I couldn't figure out what.\" He'd reached the room then, running to his desk. \"And then I realized.\" He was flipping through the files earning more than a few curious glances. \"Aha!\" He pulled out a slim little file from halfway in the pile and when he opened it Clint saw it was only a single page. \n\"What's that?\" He couldn't help but ask, stepping in closer to read it over his shoulder. It was a summary of a medical report - an autopsy to be exact, and Clint still didn't understand the fuss. \n\"This report makes no sense.\" Stiles was saying, handing it to Clint so he could boot up his computer. \"Because if this were actually done the way it's supposed to be done, why weren't any of the organs catalogued? Where have they gone?\" And now that Clint knew what he was looking for he read over the summary again. \n\"Do you think they weren't removed?\" And Stiles spun from where he'd been jotting info down on a pad of paper, ripping off the top sheet.\n\"I think he's still alive.\" And that had Clint taking off after Stiles when the younger man bolted. \n\"What are you going to do? Tell Coulson?\" And Stiles snorted. \n\"Going to find him. You coming?\" And Clint only had time to decide to go or not and so he kept on Stiles' heels. \n \n&gt;&gt;&gt;\n \nClint found himself on the morgue level of a hospital, gun in hand as he followed Stiles through the halls. They were too quiet - and Clint had noticed more than one creepy bloodstain on walls and doors. If Clint didn't know better he'd think they were hunting zombies. Come to think of it - maybe he didn't know better. \nThey reached the entrance to the morgue and Stiles pushed in without even a glance inside to see if it was dangerous. Clint cursed before ducking in after him. For a moment, he couldn't see Stiles and the panic shot through him. Where'd he gone? Then he heard the soft murmuring of his voice and he followed the sound, gun still up as he looked around the morgue and his stomach rolled. It looked like every zombie movie he'd ever seen - blood and pieces of what had been people strewn about. He looked at a leg sticking out from behind a table and saw what were definitely teeth marks on the ragged edges of what had been the guys calf. That's when Stiles came into sight. He was crouched low, hands out in front of him in surrender, but his expression was calm as he spoke. \n\"We aren't here to hurt you. I'm here to help you.\" Clint edged forward, wanting to see just who Stiles was talking to and when he caught sight of them his stomach rolled again. It was a kid of probably 15 crouched in a corner, and it was clear he was what had been eating everyone else in the place, but what freaked out Clint the most was the fact that the kids eyes were flat white, no variations for pupils, and his teeth were serrated like a sharks. He was covering from Stiles though, low whimpers coming from his throat. \"I'm here to help you.\" Stiles said again, and though Clint had been silent, Stiles' gaze flickered to him in warning. It was a demand he didn't shoot. Clint kept his gun out but not aimed and Stiles' gaze turned back to the kid. \"We need to get you out of here. Will you come with me? I'll make sure you have food, I promise. I'll take care of you.\" He offered his hand and though the kid was still whimpering, a shaking hand reached out towards Stiles. It was in that moment that Clint realized the kid was scared, and it had him pointing the gun at the floor. Movement flashed in the corner of his eye and he barely had time to duck the metal pipe swinging at his head even as the shouted \"No!\" Met his ears. He twisted without hesitation, gun coming up, but the person who'd swung had moved too, pipe coming down on Clint's shoulder. His hand released it’s hold involuntarily but he threw himself forward in a roll, coming up with the gun in his other hand, firing off a warning shot that forced the other to take cover. \n\"You can't take him!\" Came the near hysterical shout from his attacker, and Clint frowned. \"I made him - he's mine - you can't have him!\" Clint spared a glance back at Stiles but the younger man was no longer in sight and neither was the kid. He squashed down the feeling of panic and focused on the man hiding from him. \n\"You made him like this?\" He asked, and even he could hear the rage in his voice. \n\"I helped him evolve. I can help you do the same.\" The syringe plunged into his neck and he spun, gun up and pointed, and fired two shots into the mans chest. The man stumbled back before collapsing, blood spreading across his shirt. As always, it had been the perfect shot. He snatched up the syringe the man had dropped and found it empty. \n\"Fuck.\"\n\"Clint! Are you okay?\" And that was Stiles again, walking up to him, expression pinched with worry with the boy trailing behind him, hand linked with Stiles'. Clint turned to answer and that's when the world started to spin. Stiles caught him before he'd even realized he was falling and his limbs were starting to go numb. \"What happened?\" Clint rolled his head, baring his neck where he'd been injected. Stiles' skin felt cool against his skin and he heard Stiles curse before his fingers curled around Clint's neck and for the first time in his life the gesture felt safe rather than threatening. The touch of Stiles' skin was so cool it tingled, and his vision was blacking out as the tingle spread through his whole body. \n \n&gt;&gt;&gt;\n \nClint woke up in the hospital. He couldn't hear anything - and he realized his hearing aids weren't in. He looked around, disoriented, and found Natasha sitting next to his bed, watching him with an impassive expression. \n  \"Where's Stiles?\" Were the first words out of his mouth, and Natasha said nothing at first, expression not changing, and it had something painful tightening in Clint's chest. She moved then, and he recognized his hearing aids in her hands, letting her slip them over his ears before he clicked them on. \n  \"Stiles is fine.\" She said finally, and Clint relaxed not having realized he'd tensed. \"He's sleeping off his injuries a few rooms over.\" And that had Clint surging up. \n  \"What injuries?\" And it was Natasha shooting to her feet, standing right in front of him so he couldn't rise without pushing her that stopped him from rushing down the hall to the other mans room. Her expression was neutral again when he looked up, but he knew she wasn't pleased. \n  \"When he dragged you in he was bleeding from multiple lacerations to his chest and upper arms. Defensive wounds. From covering you.\" That had Clint's eyes narrowing - how could she possibly know that? She read him perfectly. \"I know because he's also got bruising alone his side that matches your tactical vest.\" That had Clint scowling. \n\"I want to see him.\" But Natasha didn't move. We also found two bodies. One shot with your weapon. The other -\" her expression faltered then, but only to those who knew her. It was a slight tightening around her mouth but it was telling. \n\"The kid?\" Natasha nodded. \n\"Stiles had lost too much blood hauling you in to be lucid when questioned.\" And that had Clint grimacing. He stood despite the fact that it pushed him into her, and she lifted a brow in surprise despite the fact that she stepped back. \n\"I want to see him.\" He said firmly and this time Natasha didn't answer, instead leading the way to the door. She lead him down the hall and into a room 4 doors down from his own. He ignored her stare as he pushed into the room and he was next to the bed before he realized he'd moved forward. Stiles was asleep, eyelashes black against nearly translucent skin. Clint could see the bandaging around his arms and winced. \n\"I don't know what the kid was. All I know is Stiles came running in this morning?\" He looked to Natasha to confirm that was all the time that had passed and she nodded. \"Because one of the reports had been off. He was right, it was way off. The autopsy report was missing anything about the organs. Stiles thought the guy was still alive and he was heading out before even thinking of calling backup. I followed.\" \n\"To the morgue.\" Clint nodded. \n\"The place was a mess. Right out of a horror movie, Nat.\" And she nodded again, both confirming and a prompt to continue. \"I followed him all the way in and found him crouching in front of this kid - and the kid? He was terrified Nat. He was obviously what had done that shit to those people, but he was fucking cowering from Stiles who just crouched there hands out telling the kid we were just there to help.\" He looked back to Stiles then, couldn't help himself from brushing the tips of his fingers over the back of Stiles' hand. \"Thats when the other guy showed up. Must have been the M.E.. He came at me with a pipe - admitted that he did that to the kid - turned him into that. Said he helped him evolve.\" Clint could feel the sneer on his face. \"He came up behind me, got me with a syringe of something - said it would help me evolve too - and then I shot him. Two hits to the chest.\" He tapped over his own heart. \"He went down. Last I saw, Stiles had the kid by the hand, was leading him over when I went down. Whatever was in that syringe knocked me out.\"\n\"We can't find any trace of what you were injected with.\" Natasha told him bluntly, and now he could see the impassive mask was to cover her worry. \"You were unconscious but there was no way for us to find out why or how.\" For a second, all Clint could remember was how when everything had started to blur, Stiles' touch had tingled - but there was no way he'd somehow expelled whatever Clint had been injected with. \n“I don’t know what it was, Nat. Best I can say is whatever that kid was, when I went down it turned on Stiles.” beside him, Natasha nodded, her impassive mask cracking as she too stared at the man in the bed. \n“He fought hard to protect you. From what we found in that morgue, he almost died for it.” and Clint stared at her in disbelief. Understanding where it stemmed from, she continued. “You didn’t have any further injuries, and there’s almost a ring of blood around where you went down. He let himself get hurt to cover you instead of fighting full strength and moving out from between you and it. He limited himself so that you wouldn’t be vulnerable.” There was a fierceness to her gaze now as she turned to him, an anger, at both him and at Stiles. “I can count on one hand the people who would do that for me, and you’re one of them. Don’t let this be for nothing.” she looked at Stiles once more. “Be cautious. When his injuries were wrapped, he panicked to the point of unconsciousness. He’ll be disoriented.” and with that she stepped in, pressing a kiss to his cheek. “I’m glad you’re alright.” and swept out the door, leaving him alone. Looking over at where Stiles lay on the bed, Clint settled into the chair next to him, ready to wait. \n \n&gt;&gt;&gt;\n \nThe ball hit the wall and bounced back to his hand for the 312th time when Clint caught movement out of the corner of his eye, and he dropped the ball to the floor as he leaned forward, watching Stiles carefully. His eyelids flickered again and he sucked in a breath of relief. He was waking up. Even as he had the thought, Stiles’ eyes fluttered open, and confused whiskey eyes stared at the ceiling.\n“Hey, you’re okay. You’re in SHIELD medical. Apparently you took quite the beating covering my ass.” and Stiles snorted out a laugh even as his gaze slipped to Clint, and now the archer could see the drug haze in Stiles’ eyes. They’d put him on the good stuff, it meant his injuries really were bad. \n“It’s a nice ass.” was the flippant reply, and Clint blinked in surprise before giving a bark of laughter. It hadn’t been the response he’d expected, but he’d take it. \n“Yeah well, thanks for keeping it, and me, in one piece.” Stiles lifted a hand to wave him off, the motion sloppy, but then he froze, eyes caught on the bandages on his arm. Clint immediately moved forward, made sure Stiles looked at him.\n“Stiles, I need you to focus on me. They had to wrap your injuries, okay? But we can take them off, replace them with a compress.” and he watched Stiles swallow back his panic.\n“Compress. Yes. Good. Do that.” and Clint hurried over to the side of the room, listening as the heart monitor slowly began to pick up as Stiles’ panic grew. Rather than grab the scissors, he pulled his pocket knife from his pocket, slicing open the bandages on Stiles’ chest and revealing the nasty gashes below that were already starting to heal themselves back together. It made Clint feel better that at least these ones weren’t too deep. The moment the bandages were no longer wrapping his torso, Stiles let out a breath of relief, calm as could be as Clint pressed the compress over the wounds, taping it down.\n“Done.” he gathered the old bandage, tossing it out and washing his hands. “Let’s agree to never do that again, okay?” and now Stiles huffed out a laugh.\n“Done.”\n \n&gt;&gt;&gt;\n \nHe'd gone home for a week. One week, that was it, and in that time, everything seemed to go to shit. Stiles flinched as he finished wrapping his ribs before pulling on his uniform. He took a moment to breathe through the discomfort. By wrapping his own ribs, he knew where the bandage came from, knew it wasn’t from a thousand year old fox demon trying to steal his body, but sometimes it still made him want to throw up from anxiety. First, he'd had to delay his flight out because some intel had been rubbing him the wrong way despite the fact that everyone else cleared it but he hadn't backed down even when Coulson had gained that slight narrowing of impatience around his eyes. But Stiles had found the problem; and it had been invaluable because it had shown them a toxicity level that should have been read in the air all along but had somehow been cloaked and it had allowed the team going in (and by now he should just get used to saying the Avengers) to don the proper masks so that none of them were gravelly injured. As soon as the issue was cleared up, he'd hightailed it out of there and onto the plane that Coulson had switched him onto (bless his favouritism), and made it back to California only a few hours late. The visit itself had started out great. The whole pack had met him at the airport and it had been amazing. They stayed the first night in the airport hotel, all curling together in a room, basking in each others presence, the wolves scent marking Stiles as one of their own once more. Then, the next day they'd travelled back to Beacon Hills where his Dad was waiting with more hugs. It was the best welcome ever. Of course, nothing good could ever last in his life because barely 2 days later an omega had blown through town and so of course Stiles had ended up thrown into a tree and nearly eaten when the thing ambushed him. He'd managed to fight back – even stabbed it through the torso with a fallen tree branch, subduing it enough for the pack to get there and finish it off, but it left him with 4 bruised ribs and a scrape along his side, not to mention his tender shoulder. He'd barely even started to heal when he'd flown back and now he was cursing his luck because he worked with super spies, how was he supposed to keep his injuries hidden?\n“What happened to you?” the question came in the form of a familiar archer that he’d come to realize really was just following him around, and had Stiles wondering if he actually had a job or just liked spooking younger agents. Said archer fell into step with him as he headed for the room he worked in, and Stiles had to resist shrugging since he knew the motion would make him wince. \n“Nothing – was practicing a flip and ended up landing wrong.” he lied easily, and the archer only paused a second before speaking again. \n“How was the trip home?” and the question sounded almost stilted, and Stiles couldn't help but snicker internally at the thought that it was because the other agents were way to terrified of the archer to try for small talk. \n“Good. My dad had almost managed to bribe the town to serve him burgers again but I visited just in time. Back to turkey bacon for him. And my friends are doing pretty well too. It was good to see them.” he answered honestly, because why not? \n“Turkey bacon?” and the question was accompanied by a grimace. \n“Hey, it tastes just fine. Plus dad's got heart problems. Whatever I can do to keep him healthy longer, I'll do.” and Clint could understand the sentiment even if he hadn't felt it for his own father. He felt the difference before he saw her and could only relax at the feeling of Natasha's presence. \n“You're Coulson's new favourite.” her voice was soft but Clint could hear the challenge in it. Apparently, so could Stiles. \n“I didn't realize his favouring junior agents threatened you at all; thought you supers were more secure in your relationships than that.” the words earned the younger agent a smirk and when Natasha met Clint's gaze, he could read her easily. I can see why you like him. \n“We are.” she all but purred, and Stiles actually rolled his eyes like he was used to that kind of thing. \n“Great. As nice as this is though, I really do have to get to work, so-” with that he hurried off, and Clint didn't miss Natasha's critical expression.\n“That injury isn't from a flip.”\n“I know.” that earned him a raised eyebrow and he shrugged. “The chances of a flip injuring him like that are basically impossible. Not with the way he moves. That's like full round bruising.” Natasha nodded. \n“If I didn't know better, I'd say someone hurt him.” and Clint couldn't deny it cause he knew the same thing. But they'd both seen him fight Ward, twice - he was good - really good. For someone to actually deal that kind of damage meant they have to be better, and that put them closer to Clint and Natasha's level than Clint was comfortable with. \n“What do you say we look into his trip back home?” Clint said then, and Natasha was already walking towards Coulson's office. Clint was quick to follow. \n \n&gt;&gt;&gt;\n \n“If you both start stalking him, I'm going to have to write you up.” Phil said the moment they entered his office, and while Clint pouted, Natasha simply lifted a brow.\n“Have you seen him since he's returned?” Natasha asked instead, and Phil frowned.\n“No, should I have?”\n“He's injured. Fairly severely. And he lied about the cause.” Natasha informed him, and it had Phil's frown deepening. \n“What did he say happened?”\n“That he landed wrong on a flip.” Clint cut in, and that had the expected reaction. “Yeah, you'd think he'd know better than to lie to an acrobat about that, but apparently not.” \n“What do you think caused it?”\n“The question is, who.” Natasha responded, and Phil finally stood. \n“What do you need?”\n“Access to his file. Whatever happened, it was when he went home. I want his medical records.” Natasha stated, but Phil looked at Clint. Clint looked right back.\n“I agree with Nat. Stiles can take on Ward. For someone to do that kind of damage -”\n“They're probably on your playing field.” Phil agreed. “I'll get you his file, but there's surprisingly little in it.” and that had both assassins exchanging a glance.\n“You didn't find that odd?” and Phil shot her a look for that.\n“Of course I did. But there's actually surprisingly good firewalls around most of the info regarding any residence while they were minors in that town. Without pulling Tony in, we don't have access to most of the information.”\n“Do you think they had something to hide?” and Phil shrugged. \n“There's been a rise in this sort of thing – especially involving the information of minors. I wouldn't be surprised if Beacon Hills was just a bit ahead of the game. But if the two of you find anything, I want to hear it.”\n“Yes sir.” Clint agreed with a lazy salute, already heading out the door. The moment he was out of sight, Phil looked to Natasha who shrugged. \n“He's had to wrap his ribs, I could see the edge of the bandage. I understand his worry. I'll tell you if anything happens.” when Phil nodded, she followed her partner out, and Phil gave a sigh before heading to the door as well. It looked like he had an agent to check up on. \n \nIt was his first day not having his ribs wrapped since the Omega incident and Stiles had almost forgotten what it was like to not have to use effort to breathe. He took deep breaths now, enjoying the fresh air on his walk to work. That is, until the town car pulled up beside him. The door swung open and Stiles was already tense for a fight; what he wasn't prepared for was Tony Stark to fold out of the car, staring at him from behind dark sunglasses that could only hide so much of the piercing gaze. \n“So you're the new protege; you've been the talk of the town.” Stiles could only shrug, only partially put out. \n“That's apparently a theme lately.” was his response, and it earned him a smirk.\n“Come on. I'm giving you a ride. I have to see Coulson anyways.” for a minute, Stiles considered arguing, but he'd heard enough about Stark to know arguing was futile, especially over something like this. \n“You know, the tower is in the complete opposite direction of my apartment. Not only that, but this is not a main road. Is my phone bugged?”\n“Should it be?” Tony asked first, before waving a hand in gesture. “No, that would be too easy. I had Jarvis triangulate your signal. Though I hear your uniforms are all tagged.” the thought made Stiles grimace though it didn't surprise him. Stiles only let a beat of silence pass before breaking it. \n“so, why are you here?”\n“Cap was impressed with the detail of your reports. Not that he new it was you – but I read through the files and they all had the same style and so I looked into it. I found you.” Stiles only had time to hum in reply before Stark was speaking again. “And I didn't expect you. You've got an eye for detail that I didn't see coming. And Coulson usually hates new recruits but with you – when I asked he actually acknowledged you. That never happens. You're smarter than most of the other agents too.” \n“Thanks.”  Was Stiles' dry response, and it earned him a smirk. \n“And I hear you're nearly as badass as our assassins.” Stiles only just managed not to role his eyes. “I also hear that the guy you fought against is one of the better agents and you still knocked him on his ass on multiple occasions.” Stiles knew better than to argue at this point. “So I decided I had to meet you before anyone else did.” that had Stiles working to cover his shock. Clearly Stark didn't know that he'd already met his two assassins. It appeared though that Stark was finally looking for a response. \n“Right. Well. Thanks, I guess?” it earned him a shrug.\n“I couldn't just let you walk. Not with freshly healing ribs.” Stiles immediately tensed, wary in a way he hadn't been before. \n“That's not creepy at all.” he deadpanned, but Stark just lifted a brow. \n“Was that supposed to be a secret?”\n“No, but doesn't exactly tell me how you know.”\n“Jarvis scanned you when you got in the car.” \n“Right.” Stiles reached for the handle but Stark just rolled his eyes, the car stopping as he got out the other side. \n“We're here.”\n“Great. Thanks for the ride.”\n“You spend too much time with Coulson.” Stark said decidedly. “That's why you're so uninspired by my presence. That will have to change. After work you're coming to the tower. Happy will be here to pick you up.” Stiles was about to argue when Stark steamrolled over him. “The whole team will be there.” And Stiles was nodding before he even realized it because Clint was going to be there. Shit. He'd been developing a crush and didn't even realize it. Shit. Before he could even change his mind, Stark and his car were gone. \n“Shit.”\n \n&gt;&gt;&gt;\n \nThe moment Tony walked into the common room with a smirk on his face, Clint knew something was up. He wasn't the only one, because before Tony could even speak, Steve had stood up.\n“What did you do?” and his tone was exasperated. Tony had the gall to look offended. \n“I didn't do anything wrong.” he shot back. “I just invited the new agent to visit after he was finished with Coulson for the day. So you could all meet the face behind all the reports.” And that had Clint's full attention. Stiles would be coming to the tower? “I told him he'd be meeting the whole team so your presence is required.” Tony announced, and though Clint shrugged under his gaze, he had every intention of being there. He rolled to his feet, heading for the door despite Tony's protests. \n“I'll be back in time.” he muttered, waving Tony off, and he left to the sound of Steve reprimanding the genius for bullying the new agent into seeing them. \n \nClint found Stiles at his desk and ignored the looks of the other 6 agents currently in the room as he made his way over. When he settled on the edge of the agents desk, arms crossed in front of his chest, he then turned his gaze on the other agents until they all looked away. Once that was done, he returned his attention to the agent at hand. \n“Tony ambushed you into coming to the tower I hear.” he said softly now that he knew the other agents were minding their own business, and Stiles shook his head, wry smile on his face. \n“I was sort of agreeing before I knew what I was agreeing to. He was starting to draw attention.”\n“Tony does that.”\n“So I've noticed.” and Stiles pushed back from his desk a bit then, tossing a shrewd look in Clint's direction. “Is that why you're here?” Clint shrugged, though it was exactly why he was there. \n“Are you going to come?”\n“He was pretty insistent I meet the whole team.” Stiles responded, resting his chin on his chest as he slouched behind the desk, though he looked up at Clint through the spikey ends of his hair falling in his face from being run through to many times. He needed a haircut. “Are you going to be there?” Stiles found himself asking, “Or is this your way of telling me you won't be present for my apparent kidnapping.” \n“I live at the tower.” Clint said, as if that cleared it all up, and Stiles just rolled his eyes.\n“I'll take that as your attendance confirmed then.” he mocked before shifting his weight so he could all but throw himself forward, arms resting on his desk, face hidden against them.\n“Stark's going to make my life very difficult if I don't show up and turn down his invitation. He doesn’t seem the type to handle rejection well. But I've got a ton of work.”\n“It's no big. Tonight's pizza and movie night anyways.” and the words seemed to perk Stiles up just like Clint had hoped they would. \n“Free pizza on Tony Stark's credit card? How could I turn that down?” the words earned him a smirk. But his excitement faltered slightly as he thought more about it. “Is there a dress code? Are there rules about this sort of thing?” he felt his pulse quicken and wanted to curse himself. Why on earth would Tony Stark invite him around to anything except maybe to embarrass him? Even if he was good at his job, the billionaire wasn't exactly known for his kind personality, public humiliation was kind of his game. And yet if Coulson really had vouched for him that might mean the invitation was genuine and what the hell was he supposed to talk to superheroes about? His pulse was racing now, his breathing getting erratic and Stiles didn't realize he'd all but induced a panic attack until it was too late. Why now? Why in front of Clint of all people? And about this of all things? Before he'd even realized that the agent had moved, Clint had him up and away from his desk and in an empty office, the door barred from anyone else entering as Stiles gasped for breath. \n“Hey, just breathe with me, okay? In and out.” Clint said, voice smooth as if speaking to a spooked animal, and for a moment Stiles felt like that was exactly what he was as he gasped for breath. When he finally collapsed, not having panicked but the anxiety of the attack stressing him out anyways, he found himself sitting on the floor with Clint. \n“Shit.” and Clint huffed out a laugh at that. Little did he know that it was becoming the limit of Stiles' verbal abilities for the day. \n“You good?”\n“Yeah. Hasn't happened in a while. Social interaction isn't exactly my strong suit.” and that earned him a shrug.\n“You're not so bad. You talk to me after all.” and Stiles couldn't help but wheeze out a laugh at that. \n“You followed me around. Talking was inevitable.” he met Clint's gaze, unsure of the reaction he'd get for calling the archer out on his near stalking, but Clint just shrugged again. \n“Obviously it's a good thing I did or you'd be dealing with Stark on your own.” and that had Stiles shuddering. \n“I'm definitely not complaining.” and he realized that may have come off a little bit more suggestive than he'd thought. He could all but feel his ears burning. “How much would Coulson hurt me if I went home?” Because Stiles was beginning to feel woozy. He needed to be home, and maybe to call Scott. Or Isaac. Someone he could call and who would be fine with talking but also fine with just sitting on the phone in silence. Definitely Isaac. God, he missed his pack. Rather than answer, Clint was on his feet, offering a hand to pull Stiles up and steadying him when he was wobbly on his feet. \n“Stark was planning on kidnapping you anyways. Blame him.” Stiles gave a smile, letting Clint lead him out of the building and shove him in a taxi. He was surprised when Clint climbed in the taxi as well, giving his address as if he'd done it a hundred times before. \n“Um-” Stiles began, but the look Clint gave him shut him up until they were out of the cab and in Stiles apartment. Stiles just fidgeted around nervously before just shaking his head and hurrying into the bedroom to change. Once he was more comfortable in jeans, a tshirt, and a plaid button up, he went back out to find Clint on his couch, flipping through one of his myth text books. \n“It was a lot more interesting than it looks.” Stiles promised, flopping down onto his couch as well, glancing over at the book. “That was a discussion class. We spent most of it arguing. It was great.” he relaxed them, letting himself drift as Clint continued to slowly flip through the book. An hour had passed before he realized they were still just sitting there and he shifted, blinking out of his daze, stretching out. “Are we supposed to be there at any specific time?”\n“Pizzas usually ordered around 7.”\n“Right. Okay. Um -” and Clint just tossed him a look to shut up.\n“Why don't you go lay down until we have to go? I'll just take advantage of your cable services.” and the look Clint was giving him brooked no argument so Stiles just got up and headed to the bedroom, flopping down on his bed. He realized he didn't feel the need to call home anymore – feeling perfectly secure now, especially considering who his company in the other room was. He still picked up his phone though, and still dialled Isaac, but it was nice to know it wasn't necessary. \n \nClint hadn't been able to resist going into Stiles' bedroom to wake the other man up. Part of him had just wanted to see the other when his sharp gaze wasn't going to turn on him at any moment, and the other part enjoyed the trust Stiles had displayed, falling asleep only a room away from someone with skills like his. As he moved closer to where Stiles had curled into a ball under the covers, he realized his phone was in his hand, a call in progress. Frowning, he moved closer, and it only took a glance to see the caller ID read Isaac. He wondered who Isaac was – if it was a regular thing for Stiles to fall asleep on the phone with the other, and couldn't help the jealousy that reared it's ugly head. Even as he glanced back at the phone, he realized the call had ended, but rather than focus on that fact he moved forward, placing a gentle hand on Stiles shoulder to wake him. Stiles reacted immediately, jerking away from the touch and all but launching himself away from where Clint stood, breathing heavy as he shook his head to clear it before focusing on Clint with a frown. As soon as the recognition clicked behind his eyes, the embarrassment flooded forward. \n“Shit. Sorry. If I fall asleep alone in a room I react a bit violently to a foreign presence waking me up.” and that was something Clint could understand. \n“No worries. Just thought you'd want to know it was time to go.” Stiles just blinked at him a moment, and Clint took that second to appreciate how he looked, sleep mussed and confused, but also once more completely at ease with Clint there in his space. \n“Right. Okay. I should – change?” Clint shrugged at that, eyes tracking the movement of Stiles' hands as one tugged on his shirt, covering the sliver of skin that had become visible between his shirt and his jeans, and the other that was running through his hair. \n“Nobody will notice either way.” he waited though, waited to see what Stiles would do, and watched the indecision war over his features before settling to a decision.\n“Nobody will notice.” he agreed, since after all, he really had only just put the shirt on a few hours ago. He moved back around the bed, grabbing his phone off the bed and pocketing it as if nothing was the matter, and Clint couldn't help the thought it gave him; it meant the calls were a regular thing. \n“Your phone was on.” he found himself saying, and watched Stiles' expression carefully. There was a flicker of surprise before it settled on recognition.\n“Yeah, I was talking to Isaac. He's a friend from back home. We grew up together.” he paused a moment, obviously choosing his words carefully. “We both had it a bit rough. In one way or another. So we've always tried to be there for each other – in the rough moments. Once you find someone who understands – well.”\n“I get it.” Clint cut in, because he did, and he could tell it was hard for Stiles to talk about. He couldn't help but wonder if one day the other man would volunteer the information without looking quite so pained. He wondered if it was possible for himself to go long enough without ruining something for Stiles to reach that level of comfort with him. “That's me and Nat.” and Stiles nodded, offering a smile of understanding. As Clint hailed a cab, he couldn't help but plead with the universe to not let this fuck up for once in his damn life. \n \nThe tower was almost exactly as Stiles had expected it and he was almost a little disappointed. Not that he could have expected what he was seeing, per se, but the level of opulence, the sleek modern designs, none of them were surprising given what he knew of Stark, and that was almost disappointing. \n“Nothing impresses you.” was Tony's greeting, even as it was a complaint, and Stiles could only give a sheepish grin, feeling self conscious now that he was there. \n“Given your reputation, it's not exactly a surprise.” he offered weakly, and the response earned him a laugh from none other than Steve Rogers who came forward to offer his hand, giving a firm handshake in welcome. \n“Don't mind him. He's always trying to show off and he gets all bent out of shape when it doesn't work out exactly how he wants it. Come on in. What do you like on your pizza?”\n“Uh bacon. And pineapple. And whatever else as long as there's no anchovies.”\n“You're in luck. Tony banned any fish product on pizza last month.” offered a voice he recognized, and Stiles turned to see Natasha stroll over to the couches, settling down comfortably. “There was a bit of an incident.” she concluded with a smirk, and Stiles just nodded dumbly, unsure of where this easy level of comfort from all of them had come from. He couldn't help but glance over at Clint and as if sensing his discomfort, the archer was there, hand on his back leading him to the couch. He half pushed him onto the couch next to Natasha, dropping onto his other side, and smirked at the squeak of surprise it elicited. \n“I like pineapple.” he added, stretching an arm across the back of the couch where Stiles was sitting, and ignoring the knowing look it earned him from Natasha. \n“Jarvis?”\n“Right away, Captain Rogers. The usual pizza order has been placed with the addition of a large pizza with bacon and pineapple.” \n“Great. Jarvis – where's Bruce? He needs to meet our new agent.” Tony announced, before looking towards Steve. “Is Sam coming?” \n“He should be here soon.”\n“Great. That's everyone but Thor. How about that?” Stiles was feeling a bit of whiplash, but managed to nod along in a daze. Even as the elevator doors dinged open he found himself floundering. Before he'd had a chance to protest, Tony had pulled him to his feet, dragging him towards the doctor. \n“Bruce look! It's our new agent!” and the smile Bruce offered was as understanding as it was amused. \n“Stiles. I go by Stiles.” he cut in, offering his hand, and the doctor shook it easily. \n“Does Coulson know that you've been appropriated?” he asked mildly, and Stiles couldn't help his laugh. \n“I have a feeling that Coulson probably knew before I did.” \n“That's the spirit!” Tony agreed, clapping Stiles on the shoulder. Then he was dragging Stiles back to the couch and all but shoving him back down. It left him falling into Clint's lap, who caught him easily, shifting him back into the space beside him though Stiles didn't miss that the archer still left them in each others personal space.\n \n \n&gt;&gt;&gt;\n \nStiles woke up curled up against something solid and warm and knew it was a person before he'd even registered where he was or how he might have ended up there. He blamed the fact that his brain hadn't fully turned back on yet for snuggling into the warmth, cheek pressed against soft cotton, an arm wrapped tightly across his back, a hand resting just above his hip. It was in the moment it took to connect person to movie night that everything became crystal clear and Stiles' stiffened. He'd been invited to movie night. He'd gone with Clint. He'd ended up on the couch between him and Natasha and at some point Natasha's feet had tucked themselves under his thigh and Clint's arm had settled across his shoulders. One movie had turned into two, which had turned into three, and Stiles had had a stressful day, okay? He couldn't be blamed for dozing off against the comfortable warmth that was Clint Barton. But snuggling into it? That was a whole 'nother story. He shifted, intending on getting up, only to find the arm wound around him tightening, and he stilled as Clint shifted next to him, his other hand lifting from where it had been resting on Stiles' shoulder to scrub at his face. \n“Go back to sleep.” he grumbled, and Stiles couldn't help but jerk at the words. \n“I really should – um – be – you know – going home.” and then he realized what day it was and he was out of Clint's grip and across the room, heading for the elevator. “Work. I'm late for work. Coulson's going to kill me.” and even as Clint sat up, groggy from barely having woken up, blinking towards where Stiles had disappeared to, the other man was disappearing behind elevator doors and Clint could only scowl at them. \n“You should tell him.” the advice came in the form of Natasha, who passed him a cup of coffee, and he wasn't in the least bit surprised that it was exactly as he liked it. When Clint didn't answer, she pressed on. “He wouldn't have run away so quickly if you told him.” she stated, and Clint scowled but didn't argue because she was right. He needed to tell Stiles because if he didn't that wouldn't be fair to either of them and he didn't want any confusion to pop up in the form of what he wanted from Stiles, because he wanted it all. \n \n&gt;&gt;&gt;\n \nA week after the movie night incident and Coulson still hadn't said anything to him for being late. He couldn't help but wonder if maybe one of the Avengers had gotten to him first, explained the situation – but then again, what situation was that? He hadn't seen Clint since that morning – not that that was surprising given the fact that almost the instant Stiles had made it into work he'd been given a file to proof before the Avengers were sent on a mission. And before he'd even been able to really have a chance to think about that morning, the Avengers were deployed and Stiles was left waiting in limbo. It was now day 6 of the mission and the team was supposed to be coming home today, but Stiles had yet to hear anything and it was starting to make him nervous. Of course, he should have known better than to think no news meant bad news. He'd only just sat down with his meal in the cafeteria when two trays slid onto the table across from him and his gaze jerked up to see Natasha and Clint, both looking no worse for wear than when they'd left, though both were dressed in extra S.H.I.E.L.D. sweats. \n“Lose the uniforms again?” he found himself asking, as if this was completely normal, and Natasha shrugged. \n“Laundry. That goo was more invasive than we thought it would be.” Stiles just winced in sympathy. He knew those days. \n“Good thing they have readily logo-ed clothing here. Otherwise how else would you be a walking poster board for the supposedly covert operation of S.H.I.E.L.D.?” the quip earned him a smirk from Natasha and a chuckle from Clint. \n“Don't let Coulson hear you say that. He's fond of the merch.”\n“He is literally a walking breathing suit. Does he even know what sweats feel like?”\n“In theory.” Natasha deadpanned, playing along, and Stiles found himself more relaxed that he had been since before they'd all left.\n“Shouldn't you guys be getting some sleep?” he asked then, finally noticing the dark circles under Clint's eyes, and the way Natasha held herself just a little too tense. “You've been running on reserves for the last two days or so. You need rest.”\n“We wanted to check in our on favourite agent first.” was Natasha's reply, and if he hadn't known better, she'd say the tone was almost flirtatious – but seeing as he did know better, Stiles could see if for the challenge that it was and knew it wasn't aimed at him. \n“Sorry to tell you but Coulson doesn't eat in the cafeteria.” Stiles replied innocently, feigning ignorance. “I thought you guys knew each other better than this.” he shook his head as if disparaging. Natasha's smirk grew wider.\n“Sleeping on base sucks.” was Clint's response, ignoring them both, and Stiles nodded cause hey that made sense. Plus, his favourite agent deserved a bit of slack after the shit mission.\n“You guys could use my apartment. It's closer than the tower.” he found himself saying, and it had both assassins looking at him with none of the amusement from earlier. Instead, there was a focus he wasn't used to having aimed on him. \n“That's very sweet of you, Stiles.” and he realized it was the first time Natasha had ever actually said his name, even as he saw how her gaze had gone soft, and there was no smile necessary to see that she did appreciate the offer. “Stark sent a car though. It should be here soon.” \n“Okay, no worries.” though Stiles did feel a bit embarrassed for offering now because of course Tony Stark had sent a car for them. \n“The tower is so far.” Clint muttered mutinously into his tray and Stiles couldn't help the smile that snuck onto his expression. \n“Mi casa es su casa and all that, but I gotta get back. Coulson still hasn't actually gotten mad at me about last week and I'd like to keep it that way. I know you can pick the lock but just lock up with the spare key in the kitchen when you leave if thats the route you choose.” then he was off and as soon as he was gone Natasha gave Clint a violent smack to the back of the head.\n“Ow!” he complained, scowling, but Natasha just scowled back. \n“You're going to get hurt if you continue like this.” she told him angrily, and when Clint shrugged, she smacked him over the head again. “You'll hurt him too. Talk to him.” she ordered. And then she left too and Clint was left scowling into the tasteless food. \n“Fuck.” \n \n&gt;&gt;&gt;\n \nStiles dragged himself into the apartment barely able to keep his eyes open. He'd ended up on a research binge which funny enough was actually encouraged at his place of work, but it left him drained and burnt out. He blamed that feeling on why he didn't notice right away that there was an extra pair of shoes in his front hall, or how the bedroom door that he left open when he was out was partially closed. He just stripped off his shirt, tossing it over the back of the couch, kicked off jeans by the bedroom door and grabbed the pyjama pants that were also by the door. Then he moved towards the bed which is when he finally stopped short.\n“Clint?” the archer mumbled, rolling over which only accentuated the fact that he wasn't wearing a shirt. Was in Stiles bed, sleeping, and wasn't wearing a shirt. He realized that Clint must have actually taken him up on his offer instead of going back to the tower but now Stiles didn't know what to do. \n“Stiles?” was the groggy reply before he could over think things any further.\n“That's me. It's like 11pm dude.”\n“Fuck.” was the reply, rough with sleep, and there was something endearing about Clint like this. All sleep tousled and slightly confused. \n“It's fine. I just didn't expect you to be here.”\n“You invited me.” was the confused response, and Stiles could only huff out a laugh.\n“I know but I figured Natasha would've dragged you back with her.”\n“Nah, she wants us to talk.” and the implication had butterflies taking flight in his stomach. \n“Can talking wait till morning?” Stiles asked, too tired to deal with that just yet, and Clint actually looked relieved.\n“Definitely morning.” and he settled back against the pillows, eyes drifting shut again. “Coming?” Stiles couldn't be bothered to deal with this either apparently because he crawled into the other side of the bed and settled down as well, happy to see that despite having stolen his side of the bed, he'd switched the pillows before he'd gone to sleep, leaving Stiles with his favourite pillow still under his head. Smiling, Stiles closed his eyes and let himself drift. \n \n&gt;&gt;&gt;\n \nStiles was woken up by his phone ringing. Loudly. He couldn't but groan, not wanting to move, but also couldn't help the curiosity that asked who could possibly be calling him at – yup it was 4am. \n“ 'nore it.” came the sleepy grumble behind him, the words rumbling through his back from Clint's chest. He realized then that the other man was wrapped around him like a koala. The phone stopped ringing and they both let out a breath of relief. Then Stiles' phone started ringing again, as did Clint's. \n“Shit.” Stiles cursed, scrambling for his phone even as Clint mimicked him, both answering their phones at nearly the same moment. \n“Agent Stilinski.” and that was agent Coulson. He winced. He'd made his senior officer call twice. “I need you suited up. You're going out in the field.” And Stiles felt his jaw drop.\n“But sir – you always –”\n“Not this time. You'll be part of a team doing the sweep once the Avengers have cleared the area.” Stiles forced himself to swallow any doubts.\n“Yes sir.”\n“Good. You have 15 minutes.”\n“Yes sir.” he repeated before hanging up, feeling shell shocked.\n“I've got a mission.” Clint said without preamble as he dressed.\n“I know.” Something in his voice must have tipped the archer off because he looked over sharply. “I'm coming too.”\n \nStiles sat in the back of a truck, staring at screens showing him all the info of the area including all live feeds watching the boarders. He had a comm in his ear, the chatter of the Avengers quiet but discernible. Something was bothering him – and he knew without a doubt that something wasn't quite right. Why have feeds that created a perfect perimeter of the area? Literally perfect – not a single inch of the several mile radius was not covered by a camera. But why? He knew there was supposed to be intel here, but what kind? And wouldn't the people who were hiding it know better than to think they wouldn't be able to hack their cameras? Not only that, but, why had they sent him into the field rather than Coulson? He was so senior to Stiles it was almost embarrassing, and he was always, always, the man in the field with the Avengers. So why change that now? The high pitched wailing of something mechanical charging had the other three agents in the van clapping their hands over their ears but despite the pain Stiles turned on his com so it was two ways now, and the Avengers would hear him. Even as he started to speak, the van rocked with an explosion, doors flying open, smoke pouring into the space. \n\"It's an ambush.\" He shouted, coughing on the smoke, trying to grasp his spark to push the smoke out, but the coughing had only forced him to inhale more smoke, and it was working quickly.\n\"Stiles? What's going on?\" That was Clint's voice, and he could hear the anger.\n\"They knew we were coming.\" He managed to gasp out, still coughing, and he fell to his knees. \"They hit the van.\" He managed, even as he watched men swarm into the confined space. \n\"We're on our way.\" Was the Captain's quick response. \"Iron man, what's your ETA?\"\n\"I'm heading back to base - but it's going to take me a good 5 minutes.\"\n\"Don't have 5 minutes-\" Stiles managed, and thats when a shape reached towards him. He heard his own strangled cry as he was hit with a taser as if from a distance, heard Clint's voice shout in his ear, and then everything went dark. \n \n&gt;&gt;&gt;\n \nWhen they reached the van, Clint was ready to draw blood. The last thing they'd heard through the coms from the van was Stiles' sound of pain, and the fact that they were drawn out - drawn far enough so that their base could be hit - made him angry. It means whoever was behind this knew them well enough to plan around their habits - knew S.H.I.E.L.D. well enough to know how they'd set up - what their protocols were. He swung into the van, bow leading, but he knew there was nobody there anymore.\n\"They're gone.\" The words were terse, because if he raised his voice, he might actually yell at his friends, and that wouldn't get them anywhere. \n\"I've already started tracking the signals in their coms and also their suits. So far they match up - but I imagine the coms will be ditched soon.\" \n\"So where are we going?\" Clint asked, knuckles white on the shaft of his bow, and Steve frowned in his direction. \n\"We need to figure out why they were taken rather than just killed.\" He said slowly, but to Clint it sounded like an argument. \n\"We have to go after them. They have Stiles.\" And Natasha's hand closed over his arm, a comfort and a restraint. \n\"We're going to get them back. Get him back. But Steve's right. We can't go in blind. It could be what they want. Why they took them.\"\n\"Doesn't it worry you that they know we'd go in blind?\" Tony asked, and Clint's expression darkened. \n\"Not if it's the mole.\" And that had everyone's gaze turning to Clint.\n\"What mole?\" Steve asked sharply, and Clint scowled. \n\"I thought you knew. There's been a mole for a while now. That's why things have been routing through different people. Why Stiles has worked so closely with Coulson. I thought you knew.\" But by the way Steve's jaw was tensed, he realized that wasn't the case. \"Stiles has been flagging files that have been tampered with. Flagging information. He and Coulson have it narrowed down to an AIM operative because that's where the majority of the alterations were made. But it's somebody from inside that room.\" He huffed out another breath. \"I thought you knew.\" He found himself repeating, felt Natasha's hand squeeze in comfort. Steve just took a breath, and Clint could all but see the wheels turning. \n\"Alright team. This is the plan. Stark. Continue tracking their location. Let us know when they discover the coms. They're likely to, so if they don't discard them, then we know they're expecting us. We're going to go in hot. Romanov, Barton. You'll find a back entrance, detain if possible.\" The unspoken, kill if necessary, was left unsaid. \"Stark and I will take the front. Stark, contact Coulson. Let him know we've been compromised and may need backup. Get ahold of Wilson. See if he'd be able to fly here in time.\" \n\"Got it Cap.\" And Steve took a deep breath, reaching out briefly to clasp Clint's shoulder. \n\"We'll get him back.\" And there'd be hell to pay. \n \n&gt;&gt;&gt;\n \nStiles came to when a palm cracked across his cheek, snapping his head around and snapping him back into consciousness. He blinked hard against the dizziness and then pain - tried to focus past the pounding in his head and the strain in his shoulders from the pull of restraints at his wrists. There was a stitch in his side and he knew it was where the taser had made contact with his skin. His lungs were tight with the remnants of the gas they'd used to knock them out, and he coughed as he tried to catch his breath. Despite how blurry his eyes wanted to be, he forced them to focus, forced himself to look at the one who'd hit him - the people who'd taken their team. But when he was able to focus he saw only men in masks, though he could see the gleam of cruelty in the dark eyes facing him - a sort of glee of having people under this mans control. He wanted to roll his eyes. This was just his luck. Why was he always the one who got the kidnapper with the violent streak? Him, who couldn't keep his mouth shut to save his life. He wondered, as he had many times, if this was because he'd done something terrible in a past life. Then he couldn't help but wonder if this was punishment for what he'd done in this life. He pushed the thought aside, even as he tried to reach for his spark, calling it forward from the darkness of unconsciousness even as he looked around, trying to see the others. When he couldn't, he looked back at his kidnapper, eyes skimming over the others in the room despite the fact that they were currently paying them no attention. \n\"Where are the others?\" He asked, forcing himself not to wince at the roughness of his own voice, and the man watching him gained that gleam again, saying nothing even as he pulled back to hit him again. Even as Stiles' braced himself, another one of the men came forward, grabbing the first man's wrist to stop him. \n\"Arovich. Enough.\" The first man, Arovich, looked at the second with a coldness to his gaze that told Stiles whoever this was that had stopped him, was not the usual in charge. When he backed off though, the second one came forward, and to Stiles' silent worry, removed his mask. The man in front of him was probably in his 40s, with hair going gray at the temples, eyes an ice blue that reminded him of Chris Argent, the coldness there similar to how the hunters had been when they'd first met. \n\"The rest of your team is here. They will be brought in when they regain consciousness.\" He watched Stiles impassively as he spoke, watching for reaction, and so Stiles kept his face neutral. \n\"Don't suppose you're willing to tell me why we're here.\" He asked good naturedly, and the man tilted his head in curiosity. \n\"You must be well trained, at S.H.I.E.L.D., to be able to hide your fear so easily.\" And Stiles scoffed. Not because it wasn't S.H.I.E.L.D. that had taught him, but because this man thought words like that would scare him. \n\"Maybe you just haven't given me a good enough reason to be scared.\" The man's eyebrows raised at that, and Stiles noted, he had the attentions of the others in the room now too. He counted 6 of them. \"Who’s to say this isn't a training exercise? After all, who would be stupid enough to kidnap the info team on scene with the Avengers?\" And he made sure it was clear in his gaze that he knew very well this wasn't a training exercise. The man's expression widened to a smirk, the coldness replaced by amusement. \n\"Arovich. I think our friend here would like a taste of our hospitality.\" The smirk Stiles gave was a challenge, and he clenched his hands into fists, preparing as best he could. \n\"You can hit me as much as you want, but that's not why we're here. Until you tell me why that is, we won't get anywhere.” Instead of answering, the man let Arovich hit him, but Stiles didn't stop talking. \"At this rate, we'll be at this all day.\" And he was hit again. He sucked in a breath, coughing again when he caught his breath after the blow to his chest. It stung but he just shook his head. The dizziness was about gone - the tightness in his lungs only from the pain, not the gas. His spark was nearly his again. He wrapped the power around his chains. He was going to break them, and then he was going to use them to break this asshole. The next blow was to his face, closed fist, and he felt the inside of his cheek cut against his teeth, his mouth filling with blood. He spit it to the side before offering a grin, knowing the image he presented would be gruesome. The man in control held up a hand for Arovich to stop and stepped forward again, curiosity cutting through the icy gaze. \n\"Maybe you're not scared because you think the Avengers are coming to save you.\"\n\"I don't need to be saved.\" Stiles scoffed, but the man shook his head. \n\"I don't think that's true. I think this bravado is because you expect them to swoop in and save you. You think we're keeping you for information. Did you ever consider that we don't want to keep you? Did you consider that perhaps you're only here for us to kill?\" Stiles just rolled his eyes. Death was a threat he'd been facing long before the Avengers came into his life. \n\"So that's the plan? To beat us all to death and leave us for them to find? Why - so they know you could get to a handful of their agents?\"\n\"No, because we know it will be equal to ripping out their heart when we they see what we did to their favourite agent.\" So Stiles was the target then, well that was nothing new. His only worry was that if it was him they were after, what were they going to do for the others? Something obviously showed in his expression because the man looked smug. \"Afraid now, are we?\" Stiles shrugged again. \n\"Well if it's me you're after, why did you need the others? Why take everyone and not just me?\" That earned more surprise. \n\"Shouldn't your concern be for yourself?\" And he let out a huff. \n\"You've already told me you want to kill me. What else is there?\" There was annoyance now - the mask cracking. He wasn't reacting how they wanted and so they were going to do something to force his hand. They wanted his fear - anger. It made him wary.\n\"They're awake.\" The voice came from the doorway and Stiles' gaze snapped to the doorway where another masked man was standing, gun in hand. \n\"Bring one in.\" The man disappeared only to drag in one of his team members, Stiles was pretty sure his name was Hanson, whose hands were also attached behind his back, and the red of his cheek told Stiles they'd been woken up the same way he was. Hanson's eyes were wild as they darted around the room before landing on Stiles. It made it glaringly obvious he wasn't accustomed to being in the field. \n“Maybe you can tell your colleague just what you’ve been telling us. How you don’t need the Avengers to save you, and you don't care that we plan to kill you all.” The fear was clear and nearly visceral enough to taste in the air. The man took out a gun and without any hesitation aimed it at Hanson and fired. Hanson screamed as the shot caught him in the hip and he crumpled, blood flowing quickly from the wound. Stiles’ anger grew tenfold. \n“So that’s what you’re going to do? Torture the others to get to me?” He scoffed, but he knew he wasn’t capable of hiding his rage. The man smirked, obviously pleased to have finally gotten a rise out of Stiles. \n“Let’s call it a preview. We don’t need them, and you care about what happens to them.” Hanson was quietly sobbing on the floor, his own blood pooling around him, his breathing harsh with pain. The man just took aim and fired again, hitting him in the opposite shoulder, earning a near animal sound from Hanson’s throat, and Stiles ground his teeth. He was going to tear this man limb from limb. \n \n&gt;&gt;&gt;\n \nThey knew immediately what building their agents were being held in, because the moment they got close, all they could hear was shouting and gunfire. Something had obviously gone wrong before they could even arrive, and that pushed them to move faster, worried now that they would be too late if their own agents were overwhelmed by what looked like a large number of others swarming the building. \n“Disable if possible. I have some questions I want answered.” Steve said, before leading the attack on the building, and now with their attention split, the enemy fell under their combined assault. \n“Natasha and I are pushing forward.” Clint ground into his com, not even bothering to wait for a response, but none came. Good. It looked like Steve knew better than to try and stop him. He shot someone in the knee, letting Natasha knock him out, not willing to slow down. He could hear fighting further in, just knew it had to be Stiles. When they reached the door, he spared only a glance for Natasha, only waiting for her to nod that she was ready before he shoved the door open, leading with his gun. The first thing he saw was Stiles grappling with the only other man standing, wrapping his arms around his neck. The man shifted and Stiles cried out, obviously hurt, but then his jaw clenched and with a firm tug he wrenched the man’s neck, snapping it. The man dropped, Stiles only just managing to stay on his feet with a stagger. Clint lowered his gun, gaze darting from Stiles to the other bodies on the floor, and then back to Stiles again. Stiles didn’t look at them, he was looking down at his side, and then pulling the small knife from his hip with a sharp hiss, dropping it to the ground. \n“Stiles,” Natasha called out softly, and Clint hadn’t even noticed that she’d moved past him into the room until she was standing nearly in front of the other man. Stiles just blinked at her, and for one terrifying moment there wasn’t even a sliver of recognition. She moved closer, catching him as he swayed and lowering him to the floor, crouching in front of him, and he blinked, finally recognizing her.\n“Natasha.” She reached out, pushing the hair back from his face. \n“That’s right. Can you tell me what happened?”\n“They wanted to kill me for knowing you.” Then rage flooded his gaze. “They were going to kill them to scare me.” His gaze flickered to the side then, and Natasha’s gaze followed his.\n“Miles is still alive.” His gaze darkened. “Hanson isn’t.” Natasha nodded, looking back at Clint, and that’s all the archer needed to move forward, crouching in front of Stiles. The moment he was there, Natasha moved away, and he heard her voice through the com telling the others that they’d found Stiles and his attackers were down but they were in need of immediate medical attention for one other agent. Clint was looking at Stiles though, who blinked after Natasha before turning back towards him. He stared again for a moment and then relief spilled into his expression.\n“Clint.” And he sagged forward, right into Clint. The archer pulled him in easily, curling around him.\n“We need to get you to medical.” And Stiles’ shoulders started to shake. \n“I want to go home.” And Clint knew he didn’t mean New York. \n“I’ll get you there.” He promised, and he meant it.\n“Don’t leave.” Stiles murmured then, hands curling around the straps of Clint’s tactical gear, and he squeezed Stiles back in return.\n“I’m not going anywhere.” \n \nThey were met back at base by Coulson and a team of medics, who were quick to take control of agent Miles. They looked towards Stiles as well, but the agent in question waved them off.\n“I’ll come to medical after my debrief.” And after a glance at Coulson, who nodded in agreement, the medical team disappeared. Coulson just stepped in, expression pinched with apology, but anger in his eyes.\n“Agent Stilinski, I regret the situation you were placed in.” And Stiles offered a wry grin, but it was fragile around the edges. \n“I think it’s safe to say that it’s not your fault.” And then the ice cracked further but a rage leaked in. “Whoever’s it is though, they’re going to regret it.” Clint thought back to the moment they’d found Stiles - covered in blood mostly not his own and snapping a man’s neck without any hesitation. Stiles was right - whoever was responsible was going to regret betraying their trust like this - but whoever it was better hope it wasn’t Stiles who found them first. \n \nStiles opened the door to his apartment and breathed a sigh of relief. As much as he enjoyed being home, he wasn’t the biggest fan of having everyone hover over him. It hadn’t helped that Derek didn’t want him doing this job anymore - not because he wasn’t good at it, but because it was putting him at too much risk. They’d gotten into a huge fight about it and Stiles had left the Hale house, ignoring Derek’s calls until he’d left back to New York. His phone rang again even as he locked the door behind him and he sighed, checking to make sure it was Derek before tossing the phone onto the couch. He still wasn’t ready to talk to the alpha. He dropped his bag against the wall, wincing as the action pulled at his almost healed bruises. The knock on the door surprised him and he fell into the wall as he spun around, groaning at the impact. \n“Who is it?” and maybe it wasn’t his smartest move announcing he was home to a potential threat but at this point he was beyond caring. \n“It’s me, heard you were back in town.” at Clint’s voice he stumbled over to the door, yanking it open. He couldn’t help the goofy grin on his face at seeing the archer standing in the doorway wearing worn old jeans and a ratty t-shirt with a purple bullseye on it and a sheepish smile.\n“How’d you know I was back?” Stiles asked, waving him in, “I just got here.”\n“Stark was keeping an eye.” Clint said with an awkward shrug, and Stiles could only shake his head. It made perfect sense. \n“Want a drink?” Stiles offered, because now he was realizing that this was the first time he’d seen Clint since they’d dragged him out of the warehouse covered in blood and it was making him nervous.\n“Sure. Thanks.” Clint watched Stiles shuffle into the kitchen, uncomfortable. He’d had Tony keep an eye on Stiles while the other man was back home, making sure he was safe since it was their fault he’d been hurt in the first place, and when Stiles had left Beacon Hills and arrived back in New York, Tony had let him know. Despite the fact that Clint had made sure to keep up a steady stream of texting while Stiles had been home, they’d never mentioned what had happened - instead Stiles had complained about everyones hovering, and Derek’s irritation at his being hurt. Clint had returned the favour with the teams latest antics, but it was all kept purposefully lighthearted. Now that Stiles was back in New York, and soon to be back to work, he felt off balance, and he couldn’t forget what Natasha had said - how they’d both be hurt if he didn’t say anything. Now Stiles had been hurt. He blinked in surprise when Stiles offered him a beer. \n“I heard you’re supposed to be back at work Monday.” he lead with, and Stiles nodded, taking a gulp of his drink. \n“Need to get a full medical done before agent Coulson will let me back in, but I suppose that’s fair.” and that wasn’t what Clint had expected to hear. When he’d made sure Stiles was headed safely to Beacon Hills the other man hadn’t seemed injured. \n“Why’s that?” and Stiles actually ducked his head.\n“I might have been in worse shape than everyone thought.” Stiles admitted, and Clint cast him a wary look. \n“How much worse?” Stiles shrugged a shoulder, met Clint’s gaze before his own skittered away. “Yeah, Coulson’s always been able to see through that.”\n“Sounds like you know that from experience.”\n“That’s one way to put it.” They lapsed into silence and Clint almost regretted coming - regretting the awkwardness that was settling over them like a heavy blanket. \n“Fuck it.” Clint blinked in surprise at Stiles’ cursing but before he could react further Stiles crowded into his space, pressing their lips together in a chaste kiss. Clint hadn’t registered moving but when he got back on track he had his arms wrapped tightly around Stiles’ waist, his free hand splayed on Stiles’ back, thumb brushing against bare skin. The kiss was now anything but chaste and Stiles’ arms wound around him in return, fully on board with the direction Clint had taken things. Grasping for Clint’s shoulder, he forgot about the bottle in his hand, tipping the contents between them, and they both jolted at the cold splash as Stiles righted the bottle with a gasp. For a moment they just stared at each other, soaked through with beer, and then Clint grinned, which prompted Stiles into laughter. \n“Think this counts for having that talk Natasha wanted us to have?” and Clint didn’t fight the bubble of laughter that broke free, loosening his grip on the younger man and taking his beer bottle from him, setting both down on the kitchen counter. \n“It’s a good start.” and he drew Stiles back in for another kiss. Stiles went with the motion for a moment before pulling back with a grimace. \n“Come on, you can use my shower.” \n“You going to use it with me?” Clint asked before he could stop himself, and watched Stiles freeze in surprise. He almost kicked himself but then Stiles turned back, and his grin was wicked. \n“Wouldn’t want you getting lost.” \n \n&gt;&gt;&gt;\n \nLeaning back against the headboard, Clint traced the faded yellow bruises on Stiles’ naked back, fingertips gentle, eyes tracking the healing edges his fingers had already traced. Stiles’ hummed at the feeling, opening his eyes from where he’d smushed his face into the pillow, sheets rumpled around his waist. There was a smile on his face but his eyes were guarded. Clint could understand why - after all, they’d gone from ignoring that there might be something between them to sleeping together, but Clint wasn’t about to give that up. \n“Are you staying?” Stiles asked softly, and Clint settled his hand more securely on Stiles’ back. \n“Was hoping to.” and Clint was glad to see the guarded look fade behind relief. Stiles reached out an arm then, sliding it around Clint’s waist, thumb sweeping gently against his hip bone. Clint was quick to use that leverage to flip them over so Stiles was on his back and rolled over to kiss him again, revelling in the fact that he could. Stiles grinned into the kiss, hands sliding under the sheet to find more bare skin. \n“I could get used to this.” and Clint shifted to kiss his way down Stiles’ chest. \n“Good.” \n \n&gt;&gt;&gt;\n \nStiles was more than glad to be back at work. Not that he’d missed the stress of it, but he definitely had missed having things to do. He couldn’t help the silly grin that spread across his face, heat rushing to his cheeks. Not that Clint had given him much time to be bored - but still. It was nice to have a purpose again. His phone buzzed in his pocket and he fished it out, wondering if it was Clint bugging him about the fact that they’d eaten all the leftovers, but when he saw the name on the screen his mood plummeted. Not one to ignore his problems, especially when it came to pack, he slid his thumb across the screen, pulling up the text from Derek. \n\nDerek Hale:\n\n\n I’m sorry.\n\nThe guilt was immediate. Look at Derek being the bigger person once again, reaching out when really it was both of them who’d been in the wrong. Well, Stiles mused, he hadn’t been completely wrong, but he hadn’t needed to get as angry as he had when Derek was just trying to make sure he was safe. Stiles pushed away from his desk, glancing around the room to his colleagues before heading out of the room, slipping into an empty hallway to dial Derek’s number. \n“Stiles?”\n“Derek, hi.” and now that he had him on the phone he didn’t know what to say. Luckily, Derek didn’t have the same problem. \n“Look, I’m sorry I tried to force the issue on quitting your job. I get that it’s important to you, and I respect that. That’s part of what makes you who you are, that you see things through no matter what life throws at you. You have to understand that it’s dangerous for you though, and being friends with these people puts you in danger.” Stiles felt himself bristle but before he could snap out a retort, Derek was pushing on. “But who are we to judge? My family’s been putting you in danger for years.” and that had Stiles softening all over again. \n“I’m sorry too.” he blurted out, before he could think twice. “It was pretty unreasonable to ask me to quit but I get why you’re worried. I would be worried too if it was you who’d gotten hurt.” he hesitated, wondering if he should tell him about Clint, but he wasn’t ready to share that yet, and he just knew Derek wasn’t going to be pleased that he’d formed one more connection outside of the pack. “I really care about these people though.” he admitted instead, and Derek sighed through the phone. It sounded resigned and it had Stiles’ guilt worsening. \n“I know.” Stiles didn’t quite know what to do with that tone of voice. \n“Look, how about I make sure to come home more often. I know it’s sort of fallen aside cause I’ve been so busy with work but that isn’t fair to you guys. Let’s say at least one weekend a month, minimum.”\n“That would be great, Stiles. And maybe we can come visit you in New York?” Even as Derek proposed the idea, Stiles’ looked up to see Clint walking down the hall towards him in full Avengers gear, and his thoughts were derailed. \n“Yeah, let’s do it. But Derek? I gotta go, I’ll call you later.” and he hung up before the alpha could answer, turning fully to face Clint as he came to stand in front of him. \n“Did I interrupt something?” and Stiles shook his head. \n“What’s with all this?” he asked, giving a wave to the uniform. \n“Nat and I have a mission. I’m going to be gone for a couple of days.” and Stiles felt his heart sink before immediately shaking it off. This was normal. Clint went on missions all the time that weren’t Avengers related - this was just the first time since they’d started - whatever they’d started. Clint’s eyes were sharp on his face though and he reached out carefully, touching his arm just above the elbow. \n“We still okay?” and it made Stiles realize Clint was just as nervous as he was. He didn’t bother hiding his wry grin. \n“Guess this is the life of dating an international spy, huh.” he said instead, and Clint’s smile was slow but beautiful. \n“Guess so.” he leaned in then, catching Stiles in a brief but hungry kiss. “I’ll see you when I get back.” and Stiles nodded, feeling a little dazed but mostly pleased. \n“Yeah, I’ll be here.” and with one last kiss, Clint was off. A throat cleared to his left and Stiles spun to see agent Coulson watching him with what could only be considered amusement. \n“I don’t think I need to cite you on appropriate workplace behaviour, do I?” And Stiles flushed bright red.\n“No, sir. I’ll just,” and he made an abortive move behind him before turning and hurrying back to his desk. He had a lot of work to catch up on. The reality of that thought sank in. He also had a mole to catch. With that in mind, he settled in to work. \n \n&gt;&gt;&gt;\n \n“Agent Stilinski.” Stiles looked up in a daze, feeling completely out of sorts. He rubbed at his eyes, blinking to try and clear his vision before he looked up to see Agent Coulson standing next to his desk.\n“Sir?” he questioned, confused, and his senior officer frowned. \n“Do you have any idea what time it is, agent Stilinski?” and Stiles looked around then, noticing now that all the other desks were empty. He vaguely recalled one or two people leaving, but he’d been so focused on his work that he hadn’t really been paying attention. He glanced at the clock now in the corner of his screen and realize it was nearing midnight and for a moment he could only stare at the clock in disbelief. \n“What are you still doing here, sir?” he found himself blurting out instead, and Coulson honest to God rolled his eyes at him. \n“It’s your first week back at work after a difficult experience, agent Stilinski.” was the reply, and Stiles just blinked again, running a hand through his hair as he looked over the notes scattered across his desk. \n“I was narrowing in on the mole.” Stiles admitted then, squinting at where his handwriting had become nearly illegible. “Lost track of time.” Then he was looking back up at Coulson, frown forming on his face. “Did Clint ask you to keep an eye on me while he was out of town?” he asked before he could think better of it, and this time Coulson offered that tiny little smile that was barely an uptick of his lips, but clearly showed his amusement. Instead of responding, Coulson pulled up a chair. \n“It looks like you’re getting close.” and when Stiles nodded, he settled in. “Walk me through it.”\n \n&gt;&gt;&gt;\n \nThey’d found the mole. It hadn’t been anybody with a particular grudge or even all that much care for the people involved. He’d just been doing what he was told - just another face in the faceless crowd that was all the organizations SHIELD fought against. That it was AIM this time meant nothing; all that mattered was that someone responsible for hurting him and his teammates was caught - right? Stiles stared blankly at the wall in front of him, wondering if the calm he was feeling was because he was disassociating since he was pretty sure he should be feeling anything but calm. Seeing as the reason he was in this room was because he’d physically gone after his coworker probably meant he wasn’t actually calm, but he couldn’t seem to focus enough to be angry. He wondered if maybe the sedative they’d jabbed him with was still in his system. After all, he’d woken up in this room after he’d gone after the person behind his team mates being killed in front of him. He shifted but his body still felt weird, and he took that as confirmation that the sedative was still doing it’s work. He wondered how much force it would take to break the wall he was staring at. He wondered if they’d been able to sew that asshole back together after Stiles had gutted him with the knife from his boot. He wondered if they’d searched him and found the knife he kept in his other boot. He found he didn’t care enough to check. And yeah, that was definitely the drugs. A door opened to his left but he didn’t turn to look, he was too busy counting the ridges in the concrete. \n“Wow, they really gave you the good stuff, didn’t they?” and that did have Stiles turning his head because that was Tony’s voice, and there was no way Tony was allowed to be in here, was there?\n“Whadreyoudoinhere” Stiles slurred out, body tilting from the motion of turning his head, and Tony looked surprisingly unamused. \n“Jailbreak. If birdbrain finds out you got locked up in here he’ll just get himself locked up, and chances are it’ll be harder to get him out of wherever they put him.” Stiles frowned. Didn’t Tony know why he was in here? The billionaire rolled his eyes. “I know exactly why you’re in here.” and oops, was he thinking outloud? “I knew the moment you found the mole.” Stiles blinked in surprise. Tony wasn’t afraid of him after he’d literally torn someone open with a knife? Did he not see the footage? Tony stepped forward, hefting him to his feet, and when Stiles swayed he pulled his arm across his shoulders. \n“We can talk about that later. Realistically though, he’s one unlucky bastard that they managed to save his life because Clint and Natasha are already on their way back into town.” Stiles just slumped into Tony, grateful. “Now try and walk with me. I couldn’t exactly bring my suit in here. We have to move quickly.” Stiles only just managed a hum in response. Tony actually cracked a grin but it was tense around the eyes. “You know, now that they’ve got you drugged, I should ask you about why you put off such a high energy reading. It caught my attention because you register almost as high as one of my reactors. That’s a lot of energy. A lot more than exists in any normal person. So, care to share?” Stiles just hummed again. He’d had no idea he put off as much energy as a reactor. Did that make him a walking battery? The thought had him giggling. Tony rolled his eyes. \n“I’ll take that as a no.” They made it to the front door and Stiles found himself looking up at Steve who offered a tight smile before helping Stiles into the car when Tony moved quickly to the drivers seat. Stiles flopped into Steve, offering a dopey grin, and Steve’s smile only tightened further.\n“What did they give him?”\n“Jarvis is pulling up the record as we speak.” \nStiles wished he could tell them that they’d had to give him three sedatives because that was the only thing that could make him stop going after the mole. The mole who’d gotten Hanson killed. The mole who’d nearly killed Miles. Who’d wanted him dead just to hurt the people he cared about. They were lucky he hadn’t used his Spark. Then three wouldn’t have been enough. Tony let out a strangled sound from the front seat and Stiles gave him a funny look, glancing up at Steve who was watching him with a look he didn’t quite understand. Stiles decided that he was going to close his eyes and rest until they got to where they were going. He deserved rest, right? Yeah, he was pretty sure he did. Right before he closed his eyes he tilted his head up to look at Steve nearly falling into the blonde’s lap.\n“Is Clint back yet?” and that earned him a real smile.\n“Soon.” \n“Mkay.” and he closed his eyes, not bothering to push away from Steve’s solid warmth. \n \nClint wondered what it was about Stiles that managed to put him right in harms way all the time. He strode onto base, Natasha at his side, and headed straight for Coulson’s office. He barged in, not even bothering to knock, and was met by Coulson’s grim expression. \n“Care to explain what happened, sir?” and he knew his tone was confrontational, but he couldn’t believe that Stiles had been  heavily sedated and put in isolation. Coulson put up a hand for patience, coming up and around from his desk. \n“We needed the man alive for questioning and agent Stilinski was going to kill him. He’s not in trouble for being taken offsite to the tower.” Coulson rubbed a tired hand over his face. “I was in the room when he figured it out. There was no way we would’ve been able to stop him otherwise.” and Clint couldn’t really argue with that - not really. Not when sedation meant no bodily harm. He’d seen the look on Stiles’ face when they’d found him in that warehouse - teammates down. To Clint and the others, while it was hard to lose an agent, it was nothing like it had been for Stiles, who’d worked with these people regularly, created relationships with them; and then watched one get killed, the other tortured to near death. He wasn’t surprised that Stiles had then wanted blood - hell, they all did. \n“Where’s the operative now?” Natasha asked, and Coulson met her gaze evenly. \n“Interrogation. We had to stitch him up on sight and decided it would be best to keep him here.” and the expression was grim. Natasha nodded. \n“Permission to speak to the prisoner, sir?” and if they didn’t know him so well, both Clint and Natasha would’ve missed the slight tilt of his lips.\n“Permission granted.” then he reached back to his desk, picking a phone up off the surface and offering it to Clint. “This belongs to Stiles. It shut off as soon as it was taken off him and nothing we’ve done has been able to turn it back on.” and that was clearly suspicious but Clint accepted the phone, pocketing it. He didn’t miss how it vibrated the moment it was safely tucked away. Clint just kept his face blank. He’d check it when he was out of there. Then Coulson just heaved a sigh. “Tell him he did a good job.” and that had Clint finally relaxing. \n“Will do, boss.” and the mocking salute was as much an apology as it was forgiveness for the slight against Stiles’ person. \n“Oh, and Barton?” Clint turned to look back even as he stepped out the door. “Let him know that catching the mole doesn’t excuse him from the other six case files he’s been ignoring.” and Clint grinned, hurrying out the door. Now that he’d cleared things up with Coulson, he wanted to get back to the tower - check up on Stiles as soon as possible. As if sensing the directions his thoughts had taken, the phone in his pocket buzzed again. Curious, because he had no doubt that Coulson had been telling him the truth, he pulled the phone out only to see it working perfectly fine. What was more concerning was the list of notifications - missed calls and messages, and a few texts visible even on the lock screen. It was the most recent text that caught Clint’s attention though. \n\nDerek Hale:\n\n\nWe’re on our way to New York.\n\nAnd that was time stamped almost a full 8 hours ago. He quickened his pace, tucking the phone back away. He couldn’t help but wonder now why Stiles’ phone worked just fine for him when it turned off when anyone else touched it, and then couldn’t help but wonder how on earth Derek Hale had known that something was wrong - and not just him. There were texts and calls from Isaac, Scott, and Lydia too. How had they known Stiles was in trouble? Enough that they were willing to travel to New York from California just to check up on him? He checked the time stamp and cursed. If they were anything like Stiles, they would’ve been on the first flight out of there, and if he didn’t hurry, they’d be in New York before he could even tell Stiles they were coming. \n \n&gt;&gt;&gt;\n \nStiles woke up with a jolt, whole body thrumming with energy, and none of it particularly positive. Anxiety was settling over him like buzzing electricity, lighting up his nerves and catching the breath in his chest. He looked around wildly, for any sign of what could explain just what was so wrong - and found himself surrounded by vaguely familiar walls. He forced himself to focus, pushing to a sitting position from where he’d been laying, and that’s when he realized what was going on. He was at the Avengers Tower. The events from SHIELD headquarters came rushing back and his jaw clenched so tightly it hurt. He’d nearly managed to kill the traitor, but he’d been stopped. Tony and Steve had rescued him. He frowned, trying to remember just what was said, cause something seemed important, but for the life of him he couldn’t recall. \n“Glad to see you’re finally awake.” Tony greeted cheerfully, strolling into the room with a tablet in hand. Stiles could only stare at him. \n“How long was I out?” and he looked around, wincing at the pounding headache. The action had Tony pulling a bottle out of his pocket and tossing it at Stiles who caught it easily, quickly shaking out two pain killers into his palm and swallowing them. \n“Couple of hours. They really got you good. Though I’ve gotta admit, I’ve been wondering just what you meant when you said the three heavy power tranqs they hit you with wouldn’t have worked if you’d been using your ‘Spark’.” and he used air quotations. “What is a Spark, exactly, and why don’t we know about it?” He could only stare at Tony, because, what? How did he even know what the hell Stiles was? How did he know he could’ve pushed off the effects of the sedative? He knew he’d been thinking about it - Stiles slapped a hand over his face and groaned. \n“What did I say exactly?”\n“Nothing too incriminating. Just that you’ve got a Spark, whatever that is, and you asked why we were helping you a lot, which frankly, rude. But I think it was more because you kept asking if we’d seen the footage, and the answer is, yes. We watched you take a knife to that bastard and slice him open.”\n“And that didn’t freak you out?”\n“I was more impressed, if we’re being honest with each other, and really I’m hoping you will be ‘cause I would hate to have to go searching and let others in on the secret.” Stiles grimaced. \n“It’s not like that.” he tried to argue, frowning, unsure how to explain, because telling anyone outside the pack had never really been an option, but he’d also never imagined having friends outside of the pack either. “It’s not that I don’t trust you guys - it’s more of a - a safety thing. For me. It’s not - I’m not safe if people know.” and that was his heart trying to beat it’s way out of his chest at the fact that he was somehow actually talking about this. He sucked in a breath and then Tony was right there, hands hovering but not quite touching, tablet out of sight. \n“Take a breath with me, okay? Eyes on me.” and he tapped two fingers to the arc reactor, but his gaze never left Stiles’. That point of focus was all Stiles needed to get himself back under control. \n“I’m okay.” he muttered, rubbing his hands over his face, fingers tugging gently at his hair, and Tony made an inelegant sound. \n“Yeah. Me too. I’m right as rain. Nothing bad ever happens.” Stiles rolled his eyes, but didn’t argue.\n“Should probably tell you that you admitted it in front of Steve too. So really, I’m not the only one who knows.” and Tony actually looks almost apologetic, if only because of Stiles’ recent near panicked state. Stiles huffed out a few choice curses. He reached for his phone, intending on texting Derek, asking for advice on the mess he’d managed to get himself into, and froze when he realized he didn’t have his phone. \n“Where’s my phone?” he near demanded, and Tony narrowed his eyes at him. \n“Clint has it. He’s bringing it back with him. Why?” then his eyes narrowed further. “What do you know about the fact that it wouldn’t open for anyone but Clint? Not that I’m supposed to know that yet, but what can I say, I got bored and tried to hack your phone.”\n“Tried?” because while Stiles’ had definitely infused his phone with a little bit of his Spark to hide things from SHIELD incase they ever tried to pry too far, he hadn’t realized that he’d actually managed to block the phones content from everyone. He wondered if it was an intent thing, because the pack used his phone all the time when he was home and he’d been doing this particular piece of mojo since just out of high school. Maybe it shut down at the purposefully hostile touch of an outside system? But that begged the question - why did it work for Clint and not the rest? Not Coulson? The thought that it was because while he trusted them all he viewed Clint as family was probably what made the difference and he nearly flushed at the realization. Tony huffed out a breath. \n“You should probably know that your pals from back home have been trying to get ahold of you. Apparently they’re headed to New York since you didn’t pick up your phone.” Stiles cursed, pushing to his feet despite how he swayed. \n“Jarvis?”\n“Yes, Mr. Stilinski?” \n“Call Derek Hale please.” and listed off the number. There was a brief ringing and then Derek was answering, growl in his voice.\n“Who is this?”\n“It’s me. Forgot my phone at work.” Stiles said easily, closing his eyes in relief at having caught Derek and not his voicemail. \n“What aren’t you telling me Stiles?” and rather than the relief he’d expected, Derek was still angry - no, furious. \n“You’re on speaker, Derek. I’m at Stark’s tower.” the stony silence that followed all but crackled with Derek’s rage. \n“We’re at your apartment, Stiles.” and without even meaning to Stiles winced. He was supposed to want to see his pack, wasn’t he? But it felt like there were so many secrets between them now, and not even on purpose but because of his work and the secrecy behind the supernatural. It was one secret on top of the other on both sides and it had built to the point where he realized he hid almost everything from everyone. He wasn’t looking forward to having to deal with that - especially since he didn’t really thing he was wrong to keep all these secrets. After all, outing the supernatural to SHIELD was a bad idea on a good day, and on the flip side most of SHIELD’s secrets would actively put the pack in danger if they had the information. \nStiles wondered what it was that the pack had felt when he’d gone under - or if they’d felt the change before that - if they’d felt his absolute fury race down the pack bonds, felt his vicious glee when the blood has spurt forwards - felt his indignation at being sedated - then his surrender since anything else would out him as something a bit more than human. He wondered if the surrender to unconsciousness had felt to them like death. \n“You know, that could be considered breaking and entering.” Tony chimed in, and Stiles blinked his eyes open to look at the billionaire who was watching him in return with an inscrutable expression. Though Stiles appreciated the fact that the genius was trying to protect him, he answered before Derek could, knowing it was for the best for everyone. \n“He has a key. It’s fine. I’m going back to the apartment. Tell-” and he broke off with another wince. Now wasn’t the time to bring up Clint. “I’ll pick up my phone later.” and Derek hung up. Tony just watched him and Stiles took that as permission, heading for the door and stabbing at the elevator button, no longer able to meet Tony’s gaze. Tony waited until Stiles was out of sight to turn his attention back to Jarvis. \n“J, give me everything we have on Derek Hale and company.” and there was no missing the dark tone. He knew what that sort of temper usually meant - knew the violence that tended to go along with it. From everything he’d learned about Stiles since they’d met all those weeks ago he was fairly certain the younger man wouldn’t ever allow someone to hurt him like that - but that did nothing to soothe Tony’s worry. He also knew that Stiles had known Derek since he was a teen and he knew the kind of power that sort of longterm relationship could have on someone. Then he winced. He wondered if Clint realized just how it was Derek spoke to Stiles. Then he wondered if he’d end up bailing the famous Hawkeye out of jail. \n \n&gt;&gt;&gt;\n \nStiles stood outside of his apartment building and let out a breath. He knew Derek was here and probably at least one other person - but knowing there’d be someone else there did nothing to soothe his nerves. He hadn’t intended to get hurt - hadn’t intended to worry anyone - but here he’d ended up again. He knew Derek was going to bring up the whole ‘working at SHIELD is too much of a hazard’ thing, and how was he supposed to tell the alpha that he’d actually started dating someone and just hadn’t known how to mention it and now it was too late and would seem like he was hiding it. He felt him before he saw him and couldn’t help the grin that spread across his face as Isaac launched out of nowhere to grab him in a hug, nuzzling into him, lips all but pressed to his ear. \n“I missed you.” Stiles hugged him back just as tightly. \n“Yeah,” Stiles sighed out, “Me too.” and realized it was true, he’d missed him so much it hurt and he hadn’t even realized he’d been in pain because he was so used to feeling it. When he finally pulled back it was with a soft smile. “So you and Derek came?” and Isaac gave him a funny look. \n“Stiles - we’re all here.” and that had Stiles blinking. Everyone? \n“But - why?” and Isaac frowned, taking his hand to pull him inside. \n“We were worried about you.” and his frown deepened. “We felt how angry you were - and then felt you give up.” \n“That’s not quite how that happened.” Stiles argued, but it was weak. Then they were at his front door and he was being guided inside. He wasn’t at all surprised to see the whole pack sitting there, but he was surprised to see just how deep their worry went. Lydia was the first to meet them inside the door, cupping a hand to his cheek even as she checked him over. \n“You slipped away.” and Stiles sighed this time. \n“Triple sedative. It wasn’t on purpose. I was fine, just - knocked out. With no intent from anyone for that to go any further.” he shook his head. “I’m still fine. You didn’t all need to come out here.” That’s when Derek stepped in.\n“Why, so you could continue hiding things from us?” Stiles stiffened, and even Lydia pursed her lips from where she stood still facing him, her back to Derek. Her hand slipped from his face just to take his hand, turning to face Derek with him. \n“What do you think I’m hiding from you?” \n“How about who’s been all but living with you.” Derek snarled, and Stiles blinked in surprise. His apartment was a fairly scent free zone - his Spark aired it out more or less on the regular so that if any of the wolves did ever come and visit they wouldn’t be overwhelmed by the scents here.\n“Excuse me?”\n“Don’t try to lie to me.” and Stiles scowled, because he wasn’t, he just wasn’t really sure why this was the subject Derek was deciding to be angry about. \n“I’d have to actually know what the hell you’re talking about to lie, Derek.” Stiles snapped, and a low growl sounded in Derek’s chest in response. Stiles could see the others behind Derek now, Scott’s face scrunched in confusion and the concern on Erica and Boyd - and not for Derek. Allison’s hand was hovering over her holster because she always carried these days and even she was watching Derek with a frown. \n“The man. Who’s been living here with you. His clothes are all over the place - his scent is everywhere.” and Stiles knew that couldn’t be true - could it? It wasn’t that he got rid of all smells, but really only he was here all the time, and - his thought ground to a halt. Clint had been spending a lot of time here. He had been spending more nights here than at the tower. Until his mission that had only started a few days before, they really had been all but living together. Stiles’ shoulders slumped.\n“Shit. As much as you don’t deserve to hear this - you’re actually right. There has been someone. I didn’t really think about it cause, well, it’s pretty new, and he’s been away anyways - and it’s not really official. But - there has been someone.” He wasn’t ashamed of that. \n“You almost never come home anymore, we only saw you last time because you were hurt.” and Derek wasn’t wrong, but Stiles couldn’t really argue that because it was true, but hadn’t they already talked about this? “You don’t even really talk to any of us anymore - when I called you to apologize you barely talked to me for a minute before you hung up.”\n“I was at work,” Stiles tried to argue, but Derek cut him off by raising his stupidly expressive eyebrows. \n“That was almost a week and a half ago.” Stiles opened his mouth and then snapped it closed. Was it actually that long ago? He huffed out a breath. Probably. That’s about how long Clint’s mission was supposed to take and he’d all but drowned himself in work in the meantime. He took a deep breath and when he let it out tried to let out his mounting frustration. \n“Okay. Fair enough. That’s on me.” Rather than accept that though, Derek pushed on. \n“You have someone sharing your bed that you didn’t even think to tell us about.” and Stiles heard what was’t being said - that he hadn’t thought to tell Derek about. His temper flared. \n“So? I don’t know what the hell your problem is right now - I’ve pretty much agreed with everything you’ve said so far and I get that those things are mostly my fault - but I’m also positive that my sex life is none of your business.” The whole room tensed at the words but Stiles refused to back down. He could admit that he’d made some mistakes, but Clint sure as hell wasn’t one of them. \n“Did you ever consider that it was because of whoever this is that you caught someone’s attention? That you got hurt?” Stiles wanted to grind his teeth. \n“I’m pretty sure you can’t exactly talk if we want to compare who puts who in more danger.” Stiles shot back. “I may get in trouble sometimes but I’ve always gotten myself out of it, with or without anyones help.” he glanced around at the others, but it was clear by their hesitant expressions that this wasn’t what they had expected either. “But Clint’s always helped me. Even if it was just a hunch he always believed me and he always helped me - even when it meant him getting hurt.” and he didn’t miss Derek’s surprise or the scowl he used to try and hide it. “Yeah, that’s right. That Wendigo? He helped me with that. Didn’t ask questions, just followed my lead because he trusted me. When I got grabbed, he came after me. He’s the reason I got home as quick as I did because I said that’s what I needed and he made it happen, fuck protocol.” He didn’t even know how to express how infuriating he found this whole situation. “The moment I was back in town he came and checked on me. The moment. So yeah, he has been staying here, and no, I hadn’t told you about him, but you know what? Fuck that, and fuck you. I’m allowed to have people outside of the pack.” \n“You want to choose him over us? Over your pack?” Stiles could only stare, not even sure he’d heard right, but the way everyone else had gone completely tense confirmed it. Scott stepped forward then, trying to step between Derek and Stiles’ but Derek remained immovable which kept Scott trapped behind him. \n“Derek,” but Derek’s eyes flared red and he shot Scott a glare to silence him over his shoulder. It only had Stiles’ temper flaring again. What were they, back in high school? \n“Why is this suddenly a competition? I thought you were all here because you were worried about me. Because you cared about me and thought I was hurt.” Stiles demanded, and Lydia spoke up then. \n“That’s exactly why we’re here.” and her tone was sharp, and all directed at Derek. Derek, in turn, shot Lydia a glare and now it was Derek who stepped closer. \n“Make your choice, Stiles.” and that was a threat. Out of the corner of his eye he saw Allison now had a gun in hand and Lydia had actually shifted forward, and he could all but feel her voice vibrating in her throat. \n“So I'm not allowed to associate with anyone outside the pack, is that what you're trying to tell me? I'm not your property. I'm not even one of your betas. I am a Spark, and I am your equal. You can't make that decision for me so back the hell off.” he punctuated the word with a shove to Derek's chest and for the first time in years Derek grabbed Stiles by the front of his shirt and slammed him into the wall hard enough to bruise. Stiles felt the corner of a picture frame draw blood along his shoulder blade, skin having split with the impact. Derek was being yanked away the moment the scent of blood hit the air, Lydia putting herself between them as Scott, Erica, and Boyd held Derek back, the others hovering, waiting. Allison had her gun pointed down, but at the ready. Stiles pushed off from where he'd slumped against the wall, shoulder and back burning, and let his eyes go cold as he glared at Derek, then he turned his gaze to Lydia. \n“I don’t know what the hell is wrong with him, but I’m not dealing with it. You're welcome to stay here but I'm not staying anywhere near him. When he gets his head out of his ass, give me a call.” \n“Let me come with you.” Isaac all but pleaded softly, and Stiles reached out to clasp a hand to his neck gently. \n“I can’t. You need to stay together. I’ll be okay.” and he released his hold, ignoring how Isaac all but whimpered. \n“Stiles-”\n“You’ve done enough.” Lydia’s voice cut in sharply. Then she made sure to catch Stiles’ eye, sympathy clear in her gaze. “Be safe. I’ll call you.” and Stiles only just managed a civil nod before he left, seething. He couldn’t even feel the pain in his shoulder and he wondered if that meant it wasn’t as bad as he’d originally thought. Tears burned in his eyes but he fought viciously against them - he wouldn’t give Derek the satisfaction even if he wasn’t here to see it. Only able to hear the frantic beat of his own heartbeat, Stiles let his feet carry him aimless into the city streets. \nIt could have been hours or minutes - Stiles wasn’t sure, and he blinked hazily up at the building in front of him. He didn’t realize he’d been headed anywhere specific until he stared up at the private entrance to the Tower and felt the sting of tears in his eyes again. Of course it was Clint he went to - despite the fact that this was exactly why Derek was being such an asshole. \n“Stiles?” he turned at the sound of Clint’s voice, silently cursing his lack of willpower when a few tears slipped free. Clint was by his side then, brows knit in concern, reaching out a hand and only hesitating a moment before brushing the tears from Stiles’ cheek. \n“You okay?” and Stiles watched him wince at the question, at how obvious the answer was, and it made him smile. \n“I can’t stay at my apartment.” Stiles admitted, and his voice was hoarse. Shit. He didn’t realize he’d been fighting the tears to quite this point. Clint moved even closer then, hand closing gently around Stiles’ elbow. \n“Why?” but even with the question he was guiding Stiles inside. \n“Derek’s just - he’s such an asshole sometimes. But everyone was there and it was easier for me to go.” Clint’s frown deepened even as he maneuvered Stiles into the elevator, pushing the button for his floor. Stiles leaned back against the elevator wall only to hiss out a breath of pain, jerking away. “Shit.” Clint was behind him then and he swore too.\n“There’s blood - a lot of it. You’ve bled through your shirt. What the hell happened?” the elevator came to a smooth stop and the doors slid open but Clint’s touch was much firmer now as he pulled Stiles in, all but dragging him through the apartment to the bathroom. Stiles craned his neck around to have a look, because while he’d been to the towers a bunch of times at this point it was always the communal areas with Clint staying with him at his own apartment rather than them staying at the tower. Then, touch gentle but unyielding, he pulled Stiles’ shirt over his head. Stiles grimaced at the feeling of the cold air on his stinging skin; the pain was starting to hit him. Stiles found himself manoeuvred into sitting on the edge of the bathtub and Clint pulled out a first aid kit, setting it on the counter. Stiles looked away then, putting his head in his hands, palms pressing against his eyes. He felt Clint come closer, felt the burn as the archer cleaned away the blood, disinfected the cut before taping a big square of gauze over it. As soon as that was done he was back in front of Stiles, pulling his hands from his face, his own hands gently circled around Stiles’ wrists. \n“The skin of your shoulder is split in the shape of a corner. You’re already starting to bruise. The chances of you being able to do that to yourself are pretty slim. What happened?” he didn’t have to add that the reason Stiles had shown up at all was because of Derek, and it didn’t paint the prettiest picture. Stiles met Clint’s gaze, the clear blue staring back at him, and he felt his resolve starting to crumble. He closed his eyes, shoulders slumping, before he lifted his gaze once more to Clint’s. \n“Derek slammed me against the wall. There was a picture frame there. It caught my shoulder.” Clint’s expression darkened, something akin to anger flickering across his features. \n“Derek did this to you?” and now Stiles was exhausted. It had been a long day and he’d hit the end of his rope. \n“Can I stay here?” he found himself asking, because as welcome as Clint had become in his space, he wasn’t necessarily sure if that was because the archer wanted to share space with him, or because he wanted to keep his own private space, well, private. Clint’s hands tightened minutely on his wrists.\n“As long as you want.” and Stiles managed a small smile. Then he glanced down at himself, half undressed and feeling grimy in his clothes. There were blood specs on the bottom of his pants. \n“Can I borrow something to sleep in?” that earned him a smirk and Clint got to his feet, pulling Stiles up with him.\n“I’m sure we can come to an agreement.” and Stiles let the laugh flow out of him, following Clint to the bedroom. \n \nClint sat on the edge of the bed, knees curled to his chest, chin resting on his knees as he stared at Stiles fast asleep on the other side of the bed. \n“Is he okay?” he didn’t turn at Natasha’s question, but he did lean into her touch when she stood right next to him. \n“His shoulder is gonna hurt like hell. He probably needs stitches but he was too upset to do it tonight. I’ll check when he wakes up.” the fury welled up again and he clenched his hands into fists in an effort to contain himself. \n“You want to go after Hale.” and it wasn’t a question so Clint didn’t bother answering. “Did he tell you what happened?” Clint shook his head. \n“No, but I can guess.”\n“You think he’s still trying to get Stiles to go back to California?” and there was doubt in her voice. He understood that, after all, there was no way that Stiles, who’d kicked Ward’s ass for trying to intimidate him, all but slaughtered the group that had kidnapped and tortured him, and gutted the  mole responsible, would bow to a show of violence like this. Right? But he also knew what Tony had said when him and Nat had gotten back to the tower; how Stiles had called Derek and the other man had sounded aggressive enough to have Tony concerned. \n“I dunno, Nat.” he finally admitted. “I hope not, but what the hell can I do? Hale’s threatening him to get him to leave, and I want to threaten Hale so he won’t.” Natasha rolled her eyes, pinching his shoulder and he tossed a tired grin towards her. She was right, he wanted to do a lot more than threaten. \n“He came to you.” she finally said softly, and she brushed the tips of her fingertips across his cheek. “After everything, he came to you.” she offered a wry smile, but it was sad around the edges. “I know what you’ve been doing, and I know you think that counts as talking, but it doesn’t. You need to tell him how you feel. He could have gone anywhere, but he came here. He needs you to tell him.” he glanced up at her face and saw a fierceness he hadn’t expected, and knew it was for Stiles who’d proven himself ten times over. Clint just leaned into her, closing her eyes and trusting her to keep watch for the moment of rest. Then he let out a breath. \n“You’re right. I’m going to tell him.” and rather than leave, Natasha settled down to keep vigil with him. \n \nStiles woke up to his shoulder burning and groaned at the feeling. He realized then that there was an arm wrapped around his waist and that it tightened at the sound of his pain. He was laying on his stomach facing a wall with a darkened window and he turned his head to see Clint awake and watching him. \n“Did I wake you?” Stiles found himself asking, voice hushed, not wanting to break the quiet. Clint shook his head against the pillow, and Stiles wondered almost suspiciously for a moment if Clint had slept at all.\n“How’s the shoulder?” Stiles figured his grimace was answer enough. Clint didn’t answer, shifting up to his elbow instead, the arm that had been wrapped around his waist sweeping up his back to hover over his injury. \n“Are you going to tell me why this happened now?” he settled his hand onto Stiles’ back, thumb brushing over the bare skin. It sent sparks dancing along Stiles’ spine, but he could tell from Clint’s expression that doing anything about that and ignoring the subject at hand would not be taken very well. \n“Derek’s angry.” and it sounded lame even to Stiles’ ears. He hastened to correct himself. “Well, he was worried first. All my friends were. But then he was angry. I hadn’t told him that I’d gotten close with people outside of - well that wasn’t them.” he’d almost slipped up and said pack and then vindictively he almost wanted to say it - to admit the truth about the supernatural - but he bit back the urge. No matter how big of an ass Derek was being, none of them deserved that. “He thinks that it’s being associated with you that’s put me in trouble, but I’ve always gotten into trouble, you know? I’m a trouble magnet. If something bad can happen, guaranteed I will be in the wrong place at the wrong time. And that’s okay? Cause at least I know how to handle myself, you know? Better me than someone who might get hurt.” and at Clint’s look he rolled his eyes. “Fine. Hurt worse. But that’s not really the point. Point is, he’s trying to blame you for me getting into trouble which is literally the stupidest thing and I just don’t understand why he’s being such an overbearing asshole about it.” he didn’t mention the fact that Derek had all but tried to kick him out of the pack - didn’t even know how he could express the soul deep hurt that had caused to someone who wasn’t a werewolf or even werewolf aware. \n“He sounds jealous.” Stiles twisted around so he could sit up, gaping.\n“Why would he be jealous?” Clint stared at Stiles who looked so honestly confused, so hurt and angry, and he reached out, sliding his hand to the back of Stiles’ neck and pulling him in for a kiss. When they pulled back, he watched the gears click into place in Stiles’ brain, but rather than understanding, Stiles only looked more confused. \n“I told him we were having sex. Told them all actually. It didn’t change anything. He didn’t react any differently knowing that then he had when he didn’t know. Plus, Derek isn’t interested in me - we tried to date once, it didn’t go well.” that was news to Clint.\n“Why?”\n“We know each other too well.” and even Clint could hear how carefully he was picking his words. “All our bad shit, we both knew all of it, but the problem was, we’d been the victims of each others shit. He’s one of my best friends, but romantically, we cut each other too deep.” that was something Clint could understand, but it made Hale’s behaviour even stranger. \n“Come on. We need to check your shoulder.” he didn’t mention that the gauze was dark with the blood that had bled through. Instead, he rolled out of bed and turned back to see Stiles curled up on the bed, knees to his chest, looking small and lost as he gazed towards the window - towards the world beyond it. Clint moved back in, tracing his fingers from Stiles’ temple to his jaw. Then he screwed up his courage. \n“This isn’t just casual for me. I want more than that.” he only just bit back the I want everything that almost spilled out, but it seemed Stiles had heard it anyways, because his face lit up with the softest of smiles.\n“Me too.” Clint knew he was giving the dopiest grin back, but he didn’t even care. He just let his relief that this was his and it was real settle for a moment before finally tugging Stiles to his feet. \n“Come on. Your shoulder.” and Stiles followed easily, tangling their fingers together as they walked the short distance. “You definitely need a couple stitches.” Clint admitted when he’d pulled the gauze free so he could see the injury again. He reached forward, touching the skin about an inch from the split, and winced in sympathy when Stiles hissed out a breath. “And some antibiotic cream. Even with me cleaning it last night it’s looking a bit rough.”\n“Do you have all that here?” \n“Ran out last week. It’s on order, but there’s more on the common floor so it wasn’t exactly rush shipping. We’ve got pretty much everything you could possibly think could be in a kit down there, and some things you wouldn’t.” Stiles shifted, nervous, and Clint understood his discomfort - he also wasn’t one to air his private problems in a group forum, but this injury was more important than any embarrassment and whether Stiles knew it or not they all cared enough about him to not purposefully try and embarrass him. “Everyone already knows your here.” was what Clint decided to tell him, and watched as embarrassment flickered across Stiles’ expression much as he’d predicted. “Jarvis keeps everyone informed of guests.”\n“Makes sense I guess.”\n“Plus, Bruce stitches steadier lines than me.” Stiles glanced over at him, rueful smile in place, though it was tight around the edges with nerves. \n“Something tells me you may have planned this.” \n“Nah, but it crossed my mind.” he pushed off the wall, offering his hand, and when Stiles accepted it he gave a squeeze of comfort. “Hey, J? Bruce on the main floor?”\n“Yes, agent Barton, and he has been notified of the situation. Proper equipment has been acquired.” Stiles couldn’t help his grimace. \n“Thanks Jarvis.” he responded drily, following Clint into the elevator and then catching sight of his reflection when the doors slid closed. It was in that moment that he realized he was still shirtless, something he hadn’t noticed around Clint since they’d both spent a lot of time in each others company in various states of  undress. It was too late to go back for a shirt though and then there was the fact that he’d just have to take it off again for stitches anyways, but he still felt exposed. It didn’t help that the moment they stepped onto the common floor, Stiles saw they had an audience. The whole team was there, and it was Tony that looked over first, leering. \n“Didn’t realize today was a shirtless day.” Stiles twisted to show his shoulder even as everyone else looked up and Tony whistled. “That looks like it hurts.” and there was no longer any of that playfulness in his eyes. Bruce stood then, showing the tray he’d been preparing on the table.  \n“I've got everything ready. If you wouldn't mind,” he motioned to a stool settled in front of where he'd been sitting. \n“What happened?” Steve asked as soon as he was sitting, Clint balanced on the edge of the table in front of him. Stiles met Clint's gaze and the expression was clear, either he could tell the truth, or Clint would. Stiles frowned, but there was no way to argue.\n“Derek slammed me into a wall.” Bruce's hand paused where it had been cleaning, and though only for a second, it was enough to know that the news shocked him. “There was a frame there.” there was a moment of silence where Stiles studiously looked at no one, and Bruce just started stitching as soon as he was ready.\n“Stiles,” and Steve's voice was gentle as he moved to crouch so he could catch Stiles' eye. Stiles met his gaze warily. “Has this happened before?” Stiles frowned, not sure why he was asking. \n“You mean does Derek throw me into walls often? Not anymore really, but it's always been his unfortunate way of trying to get his point across.” then his frown twisted to shock as he realized why Steve was asking. He hurried to amend his words. “He didn't try to hurt me on purpose though, I mean it's not a big deal really. It was just an accident.” he finished lamely, because how did he explain werewolf strength? He winced as Bruce tied the knot on the last stitch before carefully spreading the antibiotic cream followed by fresh gauze. Stiles looked at Clint for help but the anger in the archer's eyes told him he'd get none there. “You make it sound like we were in some sort of abusive relationship.” he said, starting to feel a bit panicked. He stood abruptly so he could pace away from them all, spinning back with his hands gripping his hair tightly. \n“We dated for like a minute. I am not and have never been in an abusive relationship, okay?” unless you counted the Nogitsune, but did that count as a relationship? He nearly shuddered at the thought. Clint had come closer then, palms open in an easy surrender. “The only person I’m seeing is you.”\n“I know that.” he soothed. “We aren't accusing you of anything, Stiles.” and Stiles' gaze darted between him and the others, letting him closer but not relaxing. \n“You're accusing Derek of something though.”\n“He threw you with enough force that you needed stitches,” Clint replied, “And you bled through your shirt last night.”\n“I know that,” Stiles admitted weakly, “But he's never injured me like this before – it was usually just a show of strength. Honestly, it isn't a big deal. It’s a thing. Plus it’s been ages - I was pretty sure he’d grown out of the whole shoving people into wall thing when he became a real adult.”\n“You can see how that's a little bit problematic, right?” Tony cut in, frown in place. “You're basically saying it's okay that he hurt you cause hey, it's been a while.”\n“No, that's not true. It's not okay. I just don't want you guys thinking that he's a bad guy, cause he's really not. We've been through a lot together. I mean, I got him arrested for murder. I think he was entitled to retaliation after that.” he was looking at Clint then, who was almost within reach, pleading with his gaze. He didn't want them to think about Derek this way – no matter how much of an asshole Derek might be sometimes that didn't change who they were – how close they were. Clint seemed to see that because he nodded, and if the anger wasn't gone at least it was pushed back.\n“Okay, you're right. We don't know him.” he murmured, and he reached out them, hands settling on Stiles' arms, sliding forward so they could wrap around the younger man's waist and pull him in. “Nobody's gonna push this any farther.” he promised, and Stiles was too busy sagging against him in relief to hear the warning for everyone else. Tony made a sound of discovery behind him and they both turned to look at him, Clint in warning and Stiles wary. Tony just smirked, the expression smug, and flicked the image off his tablet and onto the big TV. \n“Maybe explaining this will help.” and on the screen was a freeze still from the where it all began - Peter’s hulking alpha form leaving the video store. Stiles just stared as everyone else looked from the image to him, his face having drained of colour. “Just a second,” Tony murmured then, fingers tapping quickly. “Aha! They may have tried to hide it so nobody could find it, but there were actually security cameras across the street.” and the grainy camera video appeared on screen, where the giant hulking shape shrunk into a man. A very naked man. The video quality was poor enough that you couldn’t really tell much other than ‘man’, but at least they were the wrong height and build to be Stiles, so that alleviated some of the suspicion off him. It was almost comical, how everyone’s gaze swung from the video that was looping to Stiles, and Stiles almost wished that he’d never joined SHIELD, but then he looked at Clint, and he didn’t think he could ever give this up, even knowing where this was going. \n“Does this have anything to do with what you said yesterday?” Steve asked then, frowning. “About how you had - well, something?”\n“He called it a Spark.” Tony cut in then, “And even I haven’t been able to find what that means.” but Tony almost looked apologetic that Steve had outed him like this. “But I gotta say, this looks way more classic than that. I mean, look at those bright red eyes! I’m going to go with werewolf.” and Stiles felt like the floor had dropped out from under him. He tried to take a step but swayed and Clint caught him, lowering him to a chair but not retreating. Stiles scrubbed a hand through his hair, eyes going back to the video, of the hulking beast turning into Peter and walking away before skipping back again and starting all over again, showing the transformation over and over; fur melting into skin. \n“Is that true, Stiles? Werewolves?” Stiles had two options at this point, and he knew it. He could either tell them the truth or he could fight tooth and nail and deny every word. He looked around at each of these people, who’d chosen him in their own way to be part of what they’d built here, who’d come for him when he’d been in trouble. Then he heaved a sigh. \n“I need to make a phone call.” \n \n“Stiles, are you alright?” Lydia asked softly, and Stiles wished for one almost violent second that he could hug her. \n“Not really.” he admitted and could all but see her expression, how it would be pinched, how her eyes would be filled with a righteous anger. “They found the video of Peter.” and after all these years he didn’t have to be more specific than that for her to understand. For a moment there was silence but then she sighed. \n“Did you confirm anything?” \n“No, I called you.” and now he knew she’d have that small curve of her lips that belied her pleasure despite her worry. \n“Do you want to tell them?”\n“Yes.” and he didn’t realize how much he meant that until the relief swept through him at admitting it. \n“Okay. I’m going to send Isaac to you. He and Scott won’t even talk to Derek since you left.” her voice softened further. “You’re their alpha too. They wont speak to him until you do.” Stiles shoulders sagged. \n“I know, but this ins’t a choice. I’m not just going to up and leave.” there was another pause and Stiles took the moment to just listen to her breathe, pacing his heartbeat to the sound. \n“I’m going to send Isaac.” she repeated then. “And Allison. I would come myself, but-” and it was how she broke off that drew Stiles’ attention.\n“What’s going on, Lyds?” \n“Something’s wrong with Derek.” she admitted after a moment, and her voice was tight. “It’s been this way for a couple weeks, but none of us know why. It’s almost like in the beginning - but there’s nothing that’s happened that we haven’t handled.” and that had Stiles’ shoulders straightening. \n“What do you mean, handled? What’s happened?”\n“Nothing out of the ordinary.” she soothed, knowing his tone as much as he knew hers. “There was a small issue with some redcaps and a witch, but we dealt with them.” and Stiles wasn’t sure what it was the tipped him off but he was gripping the phone tighter. \n“What happened with the witch?” Lydia huffed. \n“Nothing, really. She just tried to play mind games. She’s not going to be a problem anymore, though. Allison and I took care of it.” but Stiles couldn’t let it go, something felt wrong. \n“What do you mean, mind games, Lydia? You know I know you and Allison are more than capable, but mind magic is tricky.” it seemed Lydia had reached the same conclusion he had because she let out a small gasp. \n“She could play with the pack bonds - with the wolves. We weren’t affected, but she could make them feel like they were gone.” and Stiles sucked in a breath. \n“What are the chances the spell isn’t broken?” \n“If that were true, if it was still twisting through Derek, it would explain his behaviour, why he seems almost feral.” \n“When did this even happen? Why didn’t anyone tell me?”\n“It was right before you got hurt, Stiles.” she murmured, and he winced. “We didn’t want to worry you with something we thought we’d dealt with when you were home. You were already in a difficult space.” and he couldn’t exactly argue with that, could he? But it explained why Derek had tried to push him quitting his job, why he’d tried to have him come home. He’d been feeling the echoes of their pack bond breaking, and with every time Stiles had fought back it had strained that worry - enhanced that spell with Derek’s own doubts. He took a fortifying breath and let himself start figuring out how to fix this.\n“Alright, first, get him back to Beacon Hills. How did you deal with the witch?”\n“Allison hit her with an arrow through the heart. I felt her die, but before we could get to the body it was pulled into the earth.” If that wasn’t suspicious, Stiles didn’t know what was. \n“Let’s go with the assumption she’s not fully dead then, so once you're back in Beacon Hills, get to the Hale house and on the left hand side of the front door there’s a rune.” he described it to her in great detail. “You’ll need a bit of blood, but just swipe it over the rune, preferably yours. Sorry Lydia.” \n“It’s fine. So bloody the rune. Then what?”\n“That should at least expel any magic that doesn’t belong to one of us out of the house. It should help Derek get some of himself back under control.”\n“Okay,” she agreed slowly, “But then what?” and he knew he’d avoided her question. \n“Then I come back to Beacon Hills and deal with the witch.”\n \nWhen he made his way back to the common room, having hung up with Lydia, he found everyone waiting for him. Self-conscious now, he didn’t realize he’d started hunching his shoulders defensively until he forced himself to stand tall. \n“So. Werewolves.” he started, and didn’t miss the interest on anyone’s face. “They’re real.” he expected to be bombarded with about a million questions and couldn’t help but relax with the relief that they were just watching him expectantly, not interrupting. “They live in packs, kind of like real wolves. You don’t have to be a wolf to be part of a pack.” and with that he gestured to himself. “But I am part of one. Two of my pack members, Isaac and Allison, they’re coming to meet me here. You can get a full demonstration.”\n“They’re both werewolves?” it was Tony who could’t help but cut in then, and Stiles shook his head, offering a wan smile. “No, just Isaac. Allison’s a hunter. She’s just coming for moral support and because Lydia doesn’t trust me to be honest about my injuries. Or Isaac really, because Isaac would hide it from her if I asked. Allison wouldn’t dream of lying to Lydia.” then he met Clint’s gaze and his smile was full of nerves. “You’ll like Allison, her favourite weapon is a bow.” and Clint smiled back. Though it wasn’t exactly comforting that Stiles had kept such a big secret from them, he knew just as well that Stiles hadn’t told his, well, pack, anything personal about them either, and if what he was saying was true that would have been even more difficult than hiding their supernatural identities. It wasn’t like they didn’t all know how important Stiles’ friends back home were. So he reached out a hand from where he was lounging on one of the smaller couches and watched Stiles’ whole frame relax as he hurried over, sinking down next to him. Clint threw an arm around him, drawing him in, and Stiles went easily. \n“Well I’ve got about a million questions.” Tony cut in then, and Stiles actually grinned now. Clint wondered if all the nerves had been because he thought they’d reject him. He met Natasha’s gaze from where she was sitting next to Bruce and she nodded, understanding his thoughts perfectly. Clint just tightened his grip on Stiles. \n“Ask away.” \n \nWhen Isaac and Allison arrived at the tower, there was a tension in the air that had nothing to do with just what Isaac was and everything to do with the fact that they were about to meet some of the people who’d formed Stiles into who he was now. Stiles stood the moment the elevator slid open and he was halfway across the room before they’d even realized he’d moved. A tall, curly haired blonde met him in the middle of the room, wrapping around him, and it had most people looking to Clint who’s eyes stayed firmly on Stiles, though his jaw was tight.\n“I’m fine, I’m okay, it’s okay.” They heard Stiles say, even as Allison moved forward, her gaze sweeping over everyone else even as she stepped in to check Stiles over for himself, easing Isaac back. They all watched the woman’s dark eyes go stormy as she caught sight of the gauze. \n“How bad is it.” and her tone was clipped. They stared at each other until Isaac bodily maneuvered Stiles around so he could see the injury, and they were all surprised when the man let out an actual growl, blue eyes flaring a bright gold. \n“Isaac.” and Stiles’ tone was sharp and immediately had gold fading back to blue. “I’m fine.” Then he turned to Allison. “Couple stitches. Nothing major.” Allison just hummed in response but didn’t argue, instead lifting a brow.\n“Are you going to introduce us?” and then out of the messenger bag slung across her torso she pulled out one of his shirts, handing it to him with a near flourish. He shrugged the plaid on with a grateful sigh, smiling warmly at her. \n“Alright everyone,” and he turned back to face the room. “This is Allison and Isaac.” then he looked back at the pair. “Guys, that’s Tony, Steve, Natasha, Bruce, and Clint.” \n“We’ve heard a lot about you.” and the tone was nearly bored but nobody could miss the almost accusing nature in Natasha’s tone despite how she hid it behind an easy smile. Allison responded in kind with a sweet smile that Stiles knew was all venom. \n“Then I suppose it’s a good thing our pasts alone don’t define us.” and there was the barb Stiles had expected. He rolled his eyes.\n“Ali, come on.” and he was unimpressed. Allison shrugged, unrepentant. \n“She started it.”\n“What are we, 12? Just because someone starts it doesn’t mean you have to continue it.” \n“Unless you can finish it.” Isaac piped in helpfully, “Right, Stiles?” and he wanted to slap a hand over his face, because yes, he had said that, but now isn’t exactly when he wanted that brought up. \n“Yes, Isaac. That’s right. Try not to get into fights unless you know you can finish it.” and now Tony snickered. \n“You’re like their mother.” and Stiles huffed out a breath. Allison just let out a bright laugh, no longer even remotely hostile. \n“I can see why you like them.” Then her gaze swept over them again, settling on Clint. “You must be his archer.” and Stiles narrowed his eyes at her. \n“I never told you that.” and Allison rolled her eyes at him.\n“Well they certainly weren’t my arrows in your apartment.” and it surprised a laugh out of him even as he gave her shoulder a shove. \n“You’re a shit starter, you know that?” but she ignored him, turning her gaze back to Clint expectantly. The archer in question just nodded, hands shoved in his pocket where he was leaning against the couch, having stood as soon as Stiles had.\n“That would be me.” he glanced at Stiles and the smirk on his face told the younger man they were okay. “I told you leaving the arrows in the bed frame would give them the wrong idea.” and Stiles watched Tony sputter even as Steve went pink. Bruce looked awkward but Natasha looked comfortable once again, taking her cue from Clint. Isaac just groaned. \n“Stiles, this is more than I wanted to know.”\n“Yeah well, this is what you get when you pretend to check up on me just to meet who I’m dating.” Isaac pouted. \n“I did want to check up on you. You got hurt.” and suddenly the atmosphere grew tense again. Stiles rubbed a hand over the back of his head, turning back to the others.\n“I guess now would be a good time to mention that we’re pretty sure Derek’s been cursed by a witch and that’s why he’s so aggressive?” \n \nWerewolves, witches, hunters - this was way more than Clint had expected. Not that he didn’t believe it, after all he’d seen all sorts of enhanced, not to mention aliens, and Isaac had done a helpful demonstration, but it was still a bit disorienting. Maybe it was easier to believe the whole alien thing because while it existed it was still separate - not on the earth he’d grown up on - but now he was learning that there were all sorts of things that went bump in the night that had been hiding in plain sight and that was a little disconcerting. But again, it made sense. He remembered the kid he and Stiles had found, with the white eyes and the needle-like teeth and how Stiles had just known something was going on. Turns out the kid had been a Wendigo and Stiles had known because he’d been dealing with all this supernatural stuff since he’d been a teenager and nobody else had known. He wasn’t really sure how to deal with that. Not that Stiles had been involved, but that nobody had protected him the way he seemed to protect everyone else. He knew Stiles’ dad had been the Sheriff - was still the Sheriff - but from what he’d gathered, the man hadn’t been brought into things until years later. \n“You okay?” Clint turned at the sound of Stiles’ voice, at the worry he saw there, how his hands couldn’t seem to decide what to do with themselves. Both Allison and Isaac were speaking with Natasha in low voices across the room and he knew they were discussing the plans to go back to Beacon Hills. \n“Not quite what I expected.” He responded wryly and Stiles managed a smile. \n“Can’t say it ever is.” Clint couldn’t argue that, but he could definitely help with the anxiety he was watching tighten Stiles’ shoulders. He reached out, wheeling Stiles in and sliding into a kiss. \n“Does that help?” he murmured against Stiles’ lips, and the other man smiled, nodding before kissing him again. \n“I need to go back with them.” and Clint actually laughed at him.\n“What made you think I was going to let you go alone?” Stiles slumped into him, pressing his face against Clint’s neck but the archer felt his grin. \n“I didn’t want you to feel obligated.” Clint made a rude noise, pinching Stiles’ side who gave a yelp in response but didn’t pull away. “It’s going to be difficult.” Stiles continued. “I can feel it now - now that I know what I’m feeling for. Derek’s hurting. The witch’s magic, it’s hooked in deep.” \n“I don’t know much about magic, but I can tell you he has another thing coming if he thinks he can hurt you like that again.” and when Stiles pulled back just far enough to see his face, he made sure his expression was serious. “I heard you say it wasn’t his fault, that it isn’t who he really is, but I’m going to be honest with you and say I don’t really care because you’re injured.” Stiles huffed, but nodded.\n“I don’t like it, but I understand. But hey, it’ll be easier once we deal with the witch, okay? Then you can meet him, and everyone else.” Stiles’ expression grew pinched with worry. “You do want to meet them, right?”\n“They get to meet Natasha, so it’s pretty fair.” and there was Stiles’ bright grin again. “Now come on. I want to see Tony’s face when Steve tells him only Nat and I can go with you.” Stiles snickered. \n“I mean, we can’t just have all of the Avengers running around Beacon Hills. It would cause a riot.” then the grin went wicked. “How much do you want to bet Tony will show up anyways?”\n \n&gt;&gt;&gt;\n \nStiles climbed behind the wheel of his jeep with a sigh of relief. He’d missed his jeep. It had been parked in longterm parking at the airport and now that he was back, even if it was only for a visit, it felt like coming home. Clint slid into the passenger seat, glancing around in approval even as Isaac climbed into the back. \n“What happened to Natasha?” Stiles couldn’t help but ask even as he adjusted the mirror. Isaac shrugged.\n“She said she was driving back with Ali. That’s okay, right?” Stiles and Clint exchanged a look, and while Clint rolled his eyes, Stiles smirked. \n“Yeah, that’s cool. Did she say where they were headed?”\n“No, but we’re going to your house, aren’t we?”\n“Figured we should check on Dad, update him on everything first.” and Clint watched, more than a little fascinated with how Isaac seemed to relax as Stiles laid out his plans. He glanced over as Stiles pulled out of the parking lot and made his way from the airport and onto the highway. “Great. Call Lydia. Let her know we’re here and that we’re going to see Dad. Tell her Allison’s with Natasha. Oh and if she wants to meet us, that’s fine too. Also, I’m going to need them to take me to where they last saw the witch. Once I can get a beat on her, we’re going to pay Derek a visit.” Clint saw Isaac’s eyes flash yellow and watched Stiles’ eyes narrow at him in the mirror. Isaac responded by tilting his head to show his neck, and while Stiles sighed, his eyes were fond. “Call Lydia, Isaac.” then Stiles glanced at Clint, cheeks flushing. “You’re staring.” \n“You gonna tell me not to?” and there was no denying the smirk on his face. Stiles rolled his eyes but the blush grew darker. \n“That’s not how it works.”\n“Uh-huh.” Clint agreed, but the laughter in his voice was unmistakeable. \n“You realize you’re about to meet my Dad, right?” and Clint rolled his eyes. \n“You’ve already met everyone important in my life.” and he was realizing that this whole relationship thing was a lot easier than he’d always expected. Stiles reached out across the console, lacing their fingers together and giving a tight squeeze. This time when he spoke, he didn’t look over, pointedly keeping his gaze fixed on the road.\n“You’re going to meet Derek, too.” Clint only just resisted the urge to look back at Isaac, because this wasn’t really a conversation he wanted to have with an audience, but it was also better to get this over with sooner rather than later.\n“I know it seemed like I hated the guy earlier, and I kind of did. I mean, he hurt you, how did you expect me to react? You were bleeding and I wanted to take him out.” he didn’t feel the need to add that Natasha would’ve helped him. “But you’ve always talked about Derek - about how close you are. And I get it. Nat and I are the same way, and honestly she’s hurt me a hell of a lot worse than that.” that earned a snort from Stiles, but he was relaxed once more and that was satisfying enough. “But, on that note.” and Stiles glanced over sharply at the tone. “He hurts you like that again, and I won’t be held responsible for my actions.” and he met Stiles’ gaze evenly when he glanced away from the road again, hesitant and wary. For a moment Clint was afraid Stiles would disagree, but then he nodded. \n“Seems fair. But you’ll have to get in line.” and Clint blinked in surprise. \n“Who’s first?” he blurted out, and Stiles cackled. Thankfully, Isaac came to his rescue from the backseat. \n“Lydia. She’ll skin him alive.” and Isaac said it so smugly and matter-of-fact that Clint couldn’t do anything but believe him. \n“Well that’s terrifying.” he finally said instead, and Stiles beamed a grin at him.\n“I know. It’s amazing. She’s a goddess.” and when Clint narrowed his eyes, Stiles squeezed his hand before pulling away so he could pull off the highway, guiding the jeep through he streets. “You’ll understand when you meet her.” he added, and Clint looked back at Isaac for confirmation. The blonde wolf shrugged but agreed.\n“It’s always been like this.” he added sagely, and Clint just grimaced, unimpressed. Then Stiles was pulling into a driveway next to a sheriff’s car and Clint’s attention was stolen from the subject at hand. \n“We’re here.” but Stiles just sat for a moment, staring up at the house, expression blank before he climbed out of the jeep, keys jingling in his hands as he walked up the steps. He unlocked the door and stepped inside slowly, and it was with a caution Clint hadn’t expected. \n“Dad? I’m home.” Clint could hear the TV playing in the other room, though he didn’t hear whoever was watching it get up, just saw the man step into the hallway in front of them, grin on his face.\n“Stiles!” and he opened his arms for his son who pretty much launched himself forwards with none of the hesitation he’d shown stepping into the house. John Stilinski laughed when he caught his sons weight and the two of them gripped each other in a tight hug. When the finally pulled away, the older man slung his arm around his son’s shoulders before turning his gaze on the other two standing in the hall. “Isaac.” he greeted easily, same easy grin on his face, then his gaze fell on Clint and the archer could tell why this man had been Sheriff for so long because there was a sharpness to his gaze that said he already knew way more than they’d shared. The man stared at him for nearly a full minute before turning his gaze on Stiles, eyebrows raised and unimpressed. Stiles just pouted back. \n“Aw, Dad, c’mon. I was going to tell you about him. Things have just been crazy, okay? I swear I wasn’t keeping it a secret on purpose. See look! I even brought him with so you could meet him!” he said, flapping a hand in Clint’s direction, and his Dad actually rolled his eyes. \n“You think I don’t know he’s here to make sure you and Derek don’t go at each other?” and Stiles’ mouth fell open in disbelief.\n“That’s so unfair. I have no idea where you heard that from.” the man just shook his head, stepping away from his son so he could offer Clint his hand.\n“John Stilinski, it’s nice to meet you.” \n“Clint Barton, same goes.” John’s expression showed clear surprise at his name and he turned to look back at his son.\n“You mean you’re seeing the guy you were telling me was following you around when you first started with SHIELD?” John said, and Clint felt the tips of his ears go hot. Stiles just grinned at his dad.\n“See, I knew I’d told you something about him.” and Clint just shot a look at Isaac who was snickering from where he lounged against the wall. John just gave a long suffering sigh before turning back to look at Clint.\n“I would like to point out now that you chose this.” and Clint looked from him to Stiles who was beaming at him. He couldn’t help but offer what he knew was probably a ridiculous grin back. \n“Yeah, I did.” and this time when he looked back at John there was a soft smile on his face. \n“Good. Now come on, I know you’re not actually here to introduce me to your boyfriend. You want to know about the witch.”\n \n&gt;&gt;&gt;\n \n“It’s always the freakin’ Nemeton.” Stiles scowled at the muddy ground they were being forced to wade through, muttering to himself. “It could never just be a good old murder house or something. No, of course it’s the old, crazy, magical tree of doom that is literally to blame for every bad thing ever.” Clint couldn’t help but smirk as he followed Stiles’ through the woods, amused by the muttering. At first, he’d been a bit put out that they were going to be dealing with the witch before he got to see Derek, but then Allison and Natasha had shown up at the Sheriff’s house with Lydia who had proceeded to tell everyone that they would be dealing with Derek while Stiles, Clint, and the rest of the wolves dealt with the witch. It had only taken Clint one look into Natasha’s smug gaze to know that they’d given her explicit permission to intimidate the alpha werewolf. After that, Clint couldn’t find it in himself to be upset about it, because hands down Natasha was way scarier than he was. His smirk widened at the thought. Then he thought about Lydia, who’d swept in and had such a presence that he could see why Stiles felt the way he did about her - and there was a fierceness to her when she’d mentioned his injury that said it was mutual. Clint felt the change in the ground first and the smirk dropped from his face as he went tense, bow at the ready. It took him a moment to pin point the exact difference but when he did he realized the ground was vibrating ever so slightly beneath their feet. He glanced at the wolves first, wondering if they’d felt it too, and by the tense expression he guessed they had, but when he followed their gazes to see where they were looking he found them all watching Stiles. \n“She’s been feeding it. The Nemeton. She’s been feeding it with energy she’s stealing from the pack. The energy from the pack bonds. It didn’t just feel like they were gone - she was stealing them.” And while his voice was flat, his eyes burned with his outrage. He turned to look at Clint then, and there was something almost like apology in his gaze. “I should have told you before.” He admitted, and Clint felt the beginning of worry. \n“Stiles-” and it was the dark haired wolf, Scott, who tried to cut in, but Stiles waved him off.\n“Scott, it’s only fair.” And Scott looked hesitant, but more than that, he looked just about ready to take out anyone who might even look at Stiles the wrong way. \n“Tell me what?” Clint prompted, because it was obvious that whatever Stiles wanted to say was important. \n“Tony and Steve mentioned at the tower that I’d said I had a Spark.” He met Clint’s gaze straight on and Clint realized it wasn’t just emotion that brightened Stiles’ eyes, instead they looked like warm honey lit with sunlight from behind, and Clint realized it was some sort of power doing this. “It means I can manipulate natural energy. Beacon Hills sits on a current.” It was like electricity crackled along his skin and for someone who worked with super soldiers and the similarly enhanced on a regular basis Clint was more surprised he hadn’t noticed anything this far out of the ordinary before. Now the earth seemed to ripple outwards but this time it was from where Stiles was standing, pushing back against whatever had disturbed the ground in the first place. Clint could almost feel where the ripples were pushed back towards them and grinned. \n“It’s like echo location.” And it was Isaac who grinned back at him. \n“Exactly. Sometimes he can actually make it so we can hear it as well as feel it, but it takes a lot of power.” \n“Does he have that kind of power?” And for a moment it looked like Isaac’s grin would slip, but then he looked at Stiles who was concentrating on finding the location of whatever the Nemeton was, and rather than slip it softened. \n“Yeah, but it’s hard on him. He only does it if we need it.” And that fit exactly who Clint knew Stiles to be. \n“So what exactly is a Nemeton?” Clint asked, then, eyes tracking the direction of the ripples. \n“It’s a tree. Well. A tree stump. Basically it holds power but it feeds on power too and depending on what kind of power it’s being fed means it either will draw in negative things or if it’s positive energy then it’s sort of kept even, I think? Stiles explained it to me once. He said it’s not neutral exactly but at ease. I guess.” \n“Basically what Isaac is saying is that if the Nemeton is happy, it means we’re no longer sitting on a Hellmouth.” The blonde female wolf, Erica, put in. The big broad man on her heels nodded in agreement. Stiles glanced back with a smirk. \n“We’re almost there. Erica, Boyd, I want you two to fan out to the left and then start circling back in about 30 feet. Isaac, Scott, you two will start to the right. We’re going to keep circling forward until we find it. If anyone finds it first, howl.” And everyone nodded before loping off. Clint just moved up to pace beside Stiles as they continued forwards. \n“Does that make you Buffy?” Clint asked as soon as the wolves were out of sight, and Stiles snickered. Then his expression sobered. \n“The witch might be there. Lydia and Allison were pretty sure she was dead, that she was dragged under by the Nemeton, but I think she may still be alive, but barely. The Nemeton could have been feeding on the magic that would’ve leaked out of her but it wouldn’t necessarily be as strong and it shouldn’t be able to hold her spell.”\n“Which is why you think she’s still alive.”\n“Yeah. If she’s nearly dead, she could be using the Nemeton to stay alive long enough to finish her curse.”\n“You mean she’s letting it eat her.” Stiles glanced at him and grimaced.\n“That’s exactly what I mean.”\n“How long can she live like that?”\n“Hard to say. But what I can tell you is that she can’t ever come back from this sort of thing. Once she merged enough with the Nemeton for this to be possible, she signed her own death warrant, and she knows it. Her body probably barely exists anymore.”\n“Then how do we stop her?”\n“We find her heart, and we crush it.” \nBefore Clint could ask anything further, like maybe, where the hell did they look for a heart whose body had already decomposed, the ground buckled and then rolled under their feet in an attempt to send them to their knees.\n“It knows we’re coming.” Stiles gritted out through his teeth, fighting to stay upright. “We have to be close.” Clint nodded, and he pushed forward. He trusted Stiles to be able to hold his own and he could feel where the ripples in the earth were coming from now. Even as he moved ahead though he heard Stiles cry out for him to stop, but as he turned back the trees closed around him, cutting Stiles off from his site. A wind was picking up and Clint was pretty sure this was the very definition of eerie so he turned, weapon up and at the ready. He was faced with what looked more tree than woman; what he assumed had been the witch was sitting against the base of the stump, but she was completely covered in roots. The woman shifted and Clint realized with some horror that she actually was made of the roots now. \n“So you’re the Archer. The one our dear Spark has left us for.” And her voice was like metal scraping against glass. Clint’s answer was to bring his bow up and shoot, but the woman batted the arrow away, starting to step closer. She paused after only moving a foot - the roots that attached her to the tree tightening. She gave a hiss before turning her face back towards Clint. “There’s nothing you could do that could stop me.” With a wave of her hand, the wind that had been swirling around them ripped the bow from his hand and it was full force hurricane now. The woman threw her arms out to either side now, looking up at the sky, the wood that made up her face twisting into a sinister smile. \n“What will you do now, Archer? You’re alone and powerless. I have bound to the Nemeton. Together we are strong enough to rip this pack apart, starting with the Alpha.” Then her gaze pinned him in place where he fought to stay upright. “You could help us. You have the strength of heart to do so.” The words had Clint recoiling and the witch reached out for him. Roots bubbled out of the ground to latch onto him and he drew his knife, hacking away at them, but it was little to no use. He felt the panic start to stir as he was dragged towards the tree stump, cursing as he fell onto his back, air whooshing out of his lungs. \n“I’m not going to let you turn me into a twig.” He snapped, sawing at another root, and even as he said it, the forest seemed to boom inwards into the clearing. For a moment, Clint lay dazed and disoriented, unsure if the absolute silence was from a lack of hearing or not. That’s when he heard Stiles’ voice.\n“I’ve had just about enough of you trying to take things from me.” There was a rush of power through the clearing and the witch cried out, falling back into the Nemeton, roots that made her up cracking. The ones around Clint’s ankles crumbled and he scrambled to his feet, catching his bow even as Isaac tossed it to him. Then the wolves were surging forward, using their claws to break the witch apart even as the power Stiles threw forward kept her immobile. Clint saw the heart before he even realized what he was seeing, because in no way would he automatically connect the mass of black sludge and bark to be a heart, but then he saw the beat, the ba-bum ba-bum ba-bum thrumming, and he knew what it was. Taking a breath, he lifted his bow and let everything else fall aside as he drew his arrow. Then he let go.\n \n“You stopped the witch.” It was years of having Natasha around that had alerted Clint that someone else was there, and years of training that didn’t have him spinning, weapon in hand at the sound of Derek Hale’s voice. \n“It was a team effort.” Clint said easily, turning slowly, almost lazily. He wanted Hale to know he didn’t think he was a threat. He leaned back against the Sheriff's dining table where he’d been cleaning his bow, crossing his arms across his chest. “What can I do for you?” He’d felt the once over Hale had given him the moment he saw him, knew he had nothing to prove, but he couldn’t help but feel a little resentment for someone who’d tried to pit Stiles against him and the team. \n“I know it’s you.” And Clint lifted a brow, unimpressed. \n“Is that so.” He responded drily, and Hale scowled. \n“You’re the one Stiles is seeing. The one who’s been living at his apartment. The one he hid from us.” \n“You mean hid from you.” Clint shot back, eyes hard. “And from what I saw, he was right to.” The wolf stepped forward, lips twisted in a snarl. “Think you’re going to scare me with the growling routine? That’s old school, and not all that effective. You know what is?” He shot forward without any warning, gun up and pointed at Hale’s forehead and just far enough out of reach that the wolf couldn’t stop him even if he wanted to. “If you ever hurt Stiles again, I promise you, my face will be the last thing you ever see.” For a moment, the wolf just stared at him, but then he heaved a sigh, offering a nod. \n“Fair enough.” And Clint blinked in surprise, lowering the gun but not sliding it away. At the obvious surprise on his face, Hale huffed out what could almost be considered a laugh. “Stiles brings that out in people. The need to be better and the protective instinct. He’s not very good at doing it himself.” And it sounded almost like the wolf was giving him permission to date Stiles. Clint scowled. \n“You want me to believe that that’s it? You almost kicked him out of your pack for seeing me.” And the alpha winced. Stiles had told him it had been the spell, but Clint wanted to see for himself. \n“I could never kick Stiles out, it’s his pack as much as it’s mine. The witch - she was trying to break the pack apart. Losing Stiles, and the power of his Spark that strengthens the pack bonds - it would cripple us.” Then he huffed out another breath. “And we’re a family.” He met Clint’s gaze head on. “What happened last time - it won’t ever happen again.” Clint huffed out a breath He knew he could turn down the semi apology, but at the same time, he also knew that would make him the asshole. He slid away his gun and offered his hand.\n“Clint.” The relief was instantaneous and his hand was accepted.\n“Derek.”\n“Good to finally meet you.” And the smile he got was almost disgustingly pure.\n \n&gt;&gt;&gt;\n \n“I like him.” Stiles rolled his eyes, letting his head fall back against the couch so he could see Derek hovering behind him. Derek just vaulted over so they were sitting next to each other. “Clint. I like him.” He reiterated, and this time Stiles actually glared.\n“Did you think you wouldn’t?”\n“I have no idea.” Derek said honestly, and that had Stiles heaving a sigh, shifting around so he could shove a foot at Derek’s thigh before throwing his feet in the other’s lap. \n“I really was going to introduce you. It was just never a good time and things had gotten so crazy. We weren’t official at first and what did you want me to do, tell you about every person I had sex with?” Derek grimaced. “Exactly. And then when we were official it was sort of all at once. I mean we sort of established it before but it wasn’t like, explicitly clear until after your meltdown at my apartment.” Derek rested a hand over Stiles’ ankle. \n“You deserve someone as loyal as him.” He admitted, and that caught Stiles by surprise. Not because he didn’t know how loyal Clint was, but because he wasn’t sure how Derek knew. Then he narrowed his eyes. \n“What did he do?” Derek smirked.\n“Threatened me.” And Stiles knew the only reason Derek was telling him was because he was impressed.\n“You guys are so fucking weird.” He grumbled, but it was affectionate. Then the feeling slid aside and Stiles sighed again. “I’m not leaving SHIELD. I’m going back with him.” And Derek nodded.\n“I know. But maybe next time you come home, you should bring him.” That had Stiles blinking in surprise.\n“Really?” And Derek’s smirk softened.\n“It would be good to meet him when someone’s life isn’t in danger.” Derek said drily, and Stiles shifted so he could launch himself across the couch, wrapping Derek in a hug. When he finally shifted back, he settled right in against Derek’s side. \n“When do you think we should tell him that he’s pretty much agreed to step-parent an unruly pack of werewolves?” Derek wasted no time shoving him off the couch.\n \n&gt;&gt;&gt;\n \nStiles heard the knock on his Dad's front door from his old bedroom but decided to ignore it. His Dad was downstairs and nobody he knew actually knocked the door. They usually just came right in, and if they knocked on anything it was the windowsill. Satisfied, he curled further into Clint’s side, earning a sleepy mumble from the archer. Clint turned, nuzzling into Stiles’ neck even as he tightened his arms around the younger man. \n“Mornin’.” Clint murmured, and Stiles groaned.\n“Still sleeping.” Was the reply, and he felt Clint smile against his neck before nipping gently. This time Stiles gave a hum, throwing an arm around Clint’s back. “Maybe I could get on board with that.” Before they could take that thought any further, John was shouting up the stairs.\n“Stiles, Clint. You’ve got a visitor. Come deal with this before it draws attention.” And that was definitely exasperation in his Dad’s voice. They both froze, Clint pulling away so they could meet each other’s gaze. Then Stiles’ mouth widened into a grin. \n“It’s Tony. I win the bet.” And he was on his feet and out of the bedroom with a cackle. Clint rolled his eyes, giving chase. He came to a stop right behind where Stiles skidded to a halt in the front hall, and Clint couldn’t help himself, he burst out laughing. Tony was indeed standing on the front porch, shades low on his face so he could meet their gaze while he judged them. What had Clint laughing was the sedan at the curb where he could see at least Steve in the car. \n“I can’t believe you didn’t invite us to the meet and greet with actual werewolves. Is this what happens when we don’t sleep with you?” Tony wondered out loud, and Stiles sputtered, John clearing his throat behind them all. Tony just looked smug but Clint rolled his eyes, moving forward to sling an arm around Stiles. \n“Can it, Stark. You’re just jealous I found him first.” And that had Tony giving a vague hum, pushing his glasses back up. \n“Come on, grandpa’s waiting in the car. Aren’t dog parents obligated to introduce their pets to everyone?” Tony quipped, and John actually gave a loud sigh behind them.\n“If he gets himself mauled, cover it up.” John warned his son. “I will not be held responsible for whatever happens at the Hale house.” Stiles cackled.\n“You got it, pops.” Stiles responded cheekily, then he turned to Tony. “We’ll be right out. Try not to draw too much attention.” And his tone was dry as the desert. \n“Me? Draw attention?” He turned away and Stiles could only shake his head. What had his life even become? \n \n&gt;&gt;&gt;\n \nThe large stack of paperwork had Stiles jerking in surprise when it dropped onto his desk, and he blinked up at Coulson who was watching him with a very obvious lack of sympathy. Stiles just knew all of his random absences and late days were about to bite him in the ass.\n“This is the paperwork that needs to be filled out for all unaccounted work hours as well as the reports that are supposed to be completed on the occurrence of any incidents involving SHIELD agents, as well as reports to be completed on any incidents involving active Avengers.” Stiles just looked from the paperwork to Coulson again before nodding.\n“Fair enough. When does it all have to be done by?” Coulson gave that funny little half smile that absolutely meant approval. He walked away without a word and Stiles just stared after him in confusion. Then he was back with another stack of paperwork. He dropped it on Stiles’ desk and when the agent just stared blankly at that pile, actually cracked a real smile. \n“This is the paperwork involving a new species of inhuman.” Then he pulled up a chair, pushing that pile towards Stiles and pulling the incident stack towards himself. “If we start now, we should be done before agent Barton comes to collect you for the evening.” Stiles felt the flush crawl up his face all the way to the tips of his ears and watched the smile flicker briefly back onto Coulson’s features before his senior officer settled in to work. Stiles immediately followed suit, digging into his own stack of paperwork. He glanced at Coulson out of the corner of his eye and couldn’t help his own smile. He’d never really imagined that he’d be in this position - that he’d find people outside of the pack that he could even begin to care about just as much. He looked back to his own work, ducking down to hide his smile. He hadn’t imagined he’d be able to find it, but he was pretty damn glad he had. \n \n "
}