{
    "id": "14457306",
    "url": "https://archiveofourown.org/works/14457306?view_full_work=true",
    "author": [
        "thepartyresponsible"
    ],
    "title": "The Dawn Will Break Before You",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Marvel Cinematic Universe",
        "Marvel",
        "Batman - All Media Types"
    ],
    "relationships": [
        "Tony Stark/Jason Todd"
    ],
    "characters": [
        "Jason Todd",
        "Tony Stark",
        "Happy Hogan",
        "Bruce Wayne"
    ],
    "additional_tags": [
        "Alternate Universe - Bodyguard",
        "Alternate Universe - No Powers",
        "Alternate Timelines",
        "Crossover",
        "Slow Burn",
        "Friends to Lovers",
        "Idiots in Love",
        "Implied/Referenced Drug Use",
        "Implied/Referenced Alcohol Abuse/Alcoholism",
        "Fluff and Angst"
    ],
    "language": "English",
    "series": "",
    "published": "2018-04-28",
    "completed": null,
    "words": "12,603",
    "chapters": "1/1",
    "comments": "598",
    "kudos": "10,972",
    "bookmarks": "3,080",
    "hits": "70,138",
    "summary": "<p>“Okay, heartbreaker,” he says, “how much to put the tires back on the car?”</p>\n<p> Jason rolls his eyes and gestures at him with the lug wrench. “Why don’t I just beat you up and steal your money? Is this the first time you’ve been to a bad part of town? Don’t show me your wallet, asshole. Come on.”</p>\n<p> The man heaves a heavy, aggrieved sigh and starts pulling out bills. “Five hundred?” He tries. “Six? We can go to an ATM.”</p>\n<p> “You are mugging <em>yourself</em>,” Jason says, oddly impressed. “Holy shit.”</p>",
    "notes": "<p>There is now an amazing podfic for this fic right <a href=\"https://archiveofourown.org/works/19823593\" rel=\"nofollow\">here</a>. Everyone go fill quietnight's inbox with incredibly well-deserved compliments, because holy shit.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Follow me <a href=\"https://thepartyresponsible.tumblr.com/\" rel=\"nofollow\">on tumblr</a> for fic updates and crow facts.</p>\n<p>Title take from \"Your Love Could Start a War\" by the Unlikely Candidates.</p>",
    "text": "                Jason’s too old to steal tires. It’s beneath him. Anyway, he peaked back when he was fourteen. It’s hard to top stealing the tires off the Batmobile. But someone has imposed street parking on a fucking McLaren F1 road car, and Jason feels obligated to defend the car’s honor.\n                The thing can hit 62 mph in 3.2 seconds, tops out at over 240 mph, is one of only 65 or so like it in the world, and it’s parked, all alone, unwatched, unprotected, half a block away from a line of clubs where pretty idiots mix glitter-infused bodily fluids all night. Someone’s going to be covering the thing in sparkly piss by 2am, guaranteed.\n                “Don’t worry,” Jason tells it, passing a reverent hand over its sharply-sloping hood. “I’m here to rescue you.”\n                The bitch of the thing is, whoever owns it must care at least a little, because they’ve set it up with a security system that delivers one hell of a shock when Jason tries to pick his way into the car. He could bash the windows open and take a more direct approach, but he’s here to avenge the thing, not destroy it. The older he gets, the more he can appreciate how the two are different.\n                So he can’t steal the thing, at least not with the tools in his bike, but he can do his best to impress upon its owner the dangers of leaving beautiful things in bad parts of town. Maybe by taking the tires, the idiot who owns the car will learn to at least park it in some kind of garage.\n                Street parking, Jason thinks. He pats the car consolingly on the roof and then goes back to his bike for his tools.\n \n \n \n                He’s taken one tire off and is halfway through removing the second when he hears someone clearing their throat pointedly. “Yeah,” he says, “keep walking.”\n                “I’m done walking,” a man says. “This is my destination. That’s my car. Put the tire back.”\n                Jason peers under the car, where he can see a pair of fussy shoes pointed his direction. He frowns and then straightens up so he can stare over the top of the car at the man who left this beautiful car next to a curb stained with dozens of years of post-party vomit.\n                Pretty idiot, he thinks, taking in the dark hair and dark eyes and the neat, clean lines of his face. Probably twenty-one, but maybe not. Jason’s eyes narrow on what is absolutely a smear of pink glitter running from his lips to halfway up his cheek, like someone kissed him and he tried to wipe it off.\n                Exchanging glitter-infused bodily fluids. He fucking knew it.\n                “Nope,” Jason says, ducking back down by the tire. “I’m taking all four of them. You can have the car back when I’m done.”\n                “Are you fucking kidding me?” His words are slurred, but not as badly as Jason would expect, given that it’s nearly 1am and the idiot looks like he’s having some trouble standing up straight. “It’s my car.”\n                “You park it on these streets,” Jason says, “and it is everyone’s car. Find a fucking garage, asshole. Take a cab. Don’t tell me you can’t afford it.”\n                “I’m blacklisted by a lot of cab companies,” he says, like that’s any kind of explanation.\n                “So lie about your name, for fuck’s sake,” Jason says, exasperated. “Christ, like you’ve never been banned from a bar before? Recycle one of your old fake IDs. You’ve had one since you were, what? Fourteen?”\n                “Okay,” the man says, “a little on the nose. Are you with the press? Is this a setup? Are you following me?”\n                Jason straightens back up just so the idiot can get the full effect of his incredulous sneer. “No,” he says, “I am not following you. Why the fuck would I waste my time on some idiot who can’t fucking navigate his way to a parking garage?”\n                The man rocks forward on his toes, eyes narrowing, and Jason thinks that’s a pretty bold move, given how he wobbly he was a few seconds ago.\n                “You don’t recognize me,” he says, after a long moment. It’s probably supposed to be a question, but either he can’t coordinate that kind of inflection or he’s just too taken aback to manage it.\n                Jason squints at him. He does look vaguely familiar, now that he takes a second look. “You some kind of actor?” He tries.\n                “I—what?” He blinks bloodshot eyes at him. “I feel that way sometimes, I guess.”\n                Jason nods slowly. “Like, a porn actor?”\n                “Go to hell,” he says, with a reflexive prissiness that Jason finds a little charming. He falters the second after that, though, tipping his head to the side. “Although,” he says, “although, technically--”\n                “If you gotta argue technicalities about your porn career,” Jason says, “then you absolutely have one.”\n                The man shakes his head, looking about half as offended as he should be. “I never got paid.”\n                Jason rolls his eyes. “That just means you’ve got a bad agent.”\n                “Listen.” He runs a shaky hand through his hair, which is already standing up in about every feasible direction. He looks like he’s been making out with an electrical outlet. “Listen, will you just put the tires back? I’ve got places to be that aren’t here.”\n                “You’ve got somewhere to be that isn’t the alley behind a bunch of shitty bars in a neighborhood you don’t belong in?” Jason feigns surprise, but he doesn’t put much effort into it. “Color me fucking shocked, princess. Hope you’ve got a bus pass. And some pepper spray. It’s not a great time of night for public transportation.”\n                He groans, theatrically, eyes and hands rolling heavenward, like he thinks some celestial being is going to interfere on his behalf. Or maybe like he’s lodging a formal complaint with management. “Come on,” he says. “I feel like shit. I had a bad night. Just put them back.”\n                Jason thinks this guy has only ever felt one kind of shitty in his life, and, since it’s the self-inflicted kind of shitty, he doesn’t have much sympathy. “Oh, sorry, princess,” he says, “are the drugs wearing off? Coming back down into the dirt with the rest of us?”\n                The man squints at him, focusing completely on him for maybe the first time in this entire conversation. Jason’s a little alarmed to find there’s a lot of intelligence in those eyes; he hadn’t expected it. He wonders if he’ll need to threaten him, maybe bash him lightly around the head a couple times to encourage him not to remember his face.\n                After several long seconds of staring, he starts fumbling in his pants.\n                “Woah,” Jason says, genuinely startled. “Where the hell is this going?”\n                He looks up at Jason, awfully snide for a man with his hand down the front of his pants, and then pulls his hand back up, wallet cradled in his palm. “Please,” he says, “you’re not that cute.”\n                “I’m a fucking heartbreaker,” Jason says, letting out a relieved breath. “Watch your fucking mouth.”\n                “Okay, heartbreaker,” he says, “how much to put the tires back on the car?”\n                Jason rolls his eyes again and gestures at him with the lug wrench. “Why don’t I just beat you up and steal your money? Is this the first time you’ve been to a bad part of town? Don’t show me your wallet, asshole. Come on.”\n                He heaves a heavy, aggrieved sigh and starts pulling out bills. “Five hundred?” He tries. “Six? We can go to an ATM.”\n                “You are mugging yourself,” Jason says, oddly impressed. “Holy shit.”\n                It’s at this moment, when Jason’s leaning over the top of the car, staring at the crisp and ever-growing stack of bills this idiot is pulling out of his wallet – of his own volition – when three men turn the corner and stop, just as confused and intrigued by this spectacle as Jason is.\n                Only, judging by their expressions, they’re feeling maybe a little more opportunistic about it.\n                The man doesn’t even seem to notice for maybe thirty seconds, still rambling on about ATM limits and how it’s fine, they can just skip around from one to the other, because his account doesn’t actually have a daily withdrawal limit (and here he diverges from his point, saying something about how he can just hack whatever ATM they go to first, if Jason’s in some kind of hurry, and, also, if the camera is going to be a problem, he can handle that, too,) but then he finally notices the look on Jason’s face and turns his head slowly to take in the three guys at the end of the street, staring at him exactly like he’s some rich moron, alone, standing in the desperate part of town with hundreds of dollars in his hand and no friends, no guns, no nothing.\n                “So, hey,” he says, casually, “what are the odds you can put those tires on my car while I’m in it? I mean, you look pretty strong. I’m not that heavy.”\n                Jason snorts. The wise thing to do is to take the tires and walk away, let whatever’s going to happen to this jackass happen while Jason’s far enough away to dodge any subsequent subpoenas.\n                What he does, instead, is pull his gun, disable the safety, and aim directly at the biggest, meanest one. “Sorry, guys,” he says, “I found him first.”\n                The three men exchange quick looks and then turn promptly around and head back the way they came, going in search of either backup or a less troublesome business opportunity. Jason puts his gun away and gets to work putting the tires back on the car.\n                “Oh, thank God,” the man says, finally approaching.\n                “You know I have a gun, right?” Jason says, crouching down. “You got any survival instincts left at all?”\n                “Sure,” he says, leaning against the car and watching Jason with interest. “But you seem okay.”\n                “I seem,” Jason says, staring up at him, aghast and amused and, frankly, a little horrified, “okay.”\n                “Yeah,” he says, with a shrug. He smiles at him. It seems genuine, for all that it doesn’t do much to lift the heavy exhaustion in his eyes or the slow, dazed way he stares out at the word. “Not like you pointed that gun at me.”\n                “Jesus Christ,” Jason says, tightening the lug nuts extra tight, because this guy needs every last half-turn of safety Jason can provide.\n                “Hey,” the idiot says, soft and almost hopeful. He nudges Jason with his shoe, and Jason barely suppresses the instinct to take that shoe off and beat him with it. “You wanna get something to eat?” He asks. “After this? I’ll drive. I’ll pay.”\n                “Holy shit,” Jason breathes out, staring up at him. “Someone needs to put a leash on you. You are a danger to yourself.”\n                “I know this diner,” he continues, like Jason hasn’t spoken at all. “Twenty-four hours. Pancakes the size of your head. C’mon.”\n                “You’re not taking me to breakfast,” Jason tells him, climbing to his feet so he can get to the next tire. And also so he can loom over him, make himself big and scary and try to put some kind of fear into this moron before he wanders into the next lion’s den and showers his next mugger with fifties and breakfast invites. “You’re not taking me to breakfast, because I am fucking mugging you, and whatever you think you’re gonna pay with is actually my money now.”\n                “Okay,” he says, with a small, agreeable shrug and another smile. “So you’re taking me to breakfast, then?”\n                “No,” Jason says.\n \n \n \n                Half an hour later, Jason’s not sure what the hell is happening or who the hell he is anymore, but the pancakes are even bigger than promised, and the eggs aren’t bad, either.\n                “Hey,” the guy says, smiling over at him, “show me your gun again.”\n                “That was a euphemism,” Jason says, loudly, to the table full of wide-eyed college kids who swivel in unison to stare at him like startled prairie dogs. “He’s talking about my dick.”\n                “Can show me that, too,” he says, with an entirely inappropriate wink.\n                “Who are you?” Jason asks, finally, because he hadn’t really wanted to know, but it’s going to make it easier to put out a PSA later.\n                “I’m Tony,” he says, with a huge grin, like he’s won something.\n                “You’re crazy,” Jason counters. There’s a brief, expectant silence where Tony stares hopefully across the table at him, and then Jason sighs, feels persecuted and, somehow, completely out of his depth. “I’m Jason.”\n                “So, Jason,” Tony says, leaning his elbows on the table, “you steal tires. That’s fun. That the height of your professional ambitions, or do you think you’ll move on to other automotive parts in the future?”\n                “I steal cars, too, asshole,” Jason says, affronted. “But yours has a weird security system.”\n                “You noticed.” Tony sounds oddly flattered. Jason thinks about throwing his pancakes at him, but they’re apple cinnamon, and he’s still hungry.\n                “Yeah, of course I fucking noticed,” he says, rolling his eyes, “since I was trying to steal the damn thing.”\n                “You wanna drive it?” Tony asks.\n                “Are you just— how high are you?” Jason says. “You hate your life so Goddamn much that you want to end it bleeding out in your own trunk? You can’t just take a mugger to breakfast and then offer him the keys to your car. You are going to die horribly.”\n                The college kids are clearing out, throwing money on the table and heading for the exit. Jason’s a little disheartened that all six of them have better survival instincts than Tony, since college kids, in general, aren’t known for their exceptional life decisions.\n                Tony’s staring down at his breakfast. Dinner. First and only meal for the last seventy-two hours, maybe. All that lightness and life has gone out of him, like a switch, and Jason feels like an asshole for yelling at him, but he doesn’t want to read about the cops finding his dead body in the sewer, either.\n                “Oh, for fuck’s sake,” Jason says, refusing to apologize. “Don’t look like that. I’m trying to help you. Don’t fucking tell me, with a car like that, that you can’t afford some kind of security team.”\n                Tony looks up at him. After a moment, he shrugs. “I had a team when I was younger. My dad picked them out.” There’s some meaning in My dad picked them out that Jason can’t fathom, although he gets the distinct impression that it isn’t an endorsement. “Soon as he died, I fired all of them.”\n                “Shit,” Jason says, and then hums a little, thinking it over. “Well, if he got himself killed, can’t imagine he’s that great at picking out a security team.”\n                Tony blinks, and Jason has enough time to think oh shit before Tony’s laughing, loud and genuine and surprised. “Oh my God,” he says, when he stops, “you’re terrible. You’re an absolute asshole.”\n                “Well,” Jason says, helplessly, “yeah. I stole your tires.”\n                “You gave them back,” Tony says, dismissively. He tips his head to the side. “Wanna be my security?”\n                “Holy shit,” Jason says. He feels like he’s saying that a lot tonight. Tony takes it in stride, probably because people say things like that around him so often that they’ve lost their punch. “You can’t hire me. You’re the victim of a felony I perpetrated.”\n                “Just the theft,” Tony says, brow furrowed. “Isn’t that a misdemeanor?”\n                “Robbery,” Jason says. “There was threat of force involved. Robbery is a felony.”\n                “I never felt threatened,” Tony argues, eyes wide. “You’re buying me pancakes.”\n                “You,” Jason says, pointing his fork at him, “are going to die. Horribly.”\n                Tony rolls his eyes. “I’d better not,” he says, “or there goes your job security.”\n                Jason throws his hands up. His fork clatters loudly onto his plate, and Tony takes the opportunity to steal his last strip of bacon.\n                “I am not,” Jason says, as clearly as he can, “going to work for you, Goddamn it.”\n \n \n \n                It’s not a bad job, really. Jason’s sure as hell worked worse. In fact, one of the best parts of his new job is that he gets to quit both of his old ones, and Tony comes with him to do it, riding along in the McLaren, offering up cheerfully appalled commentary on Jason’s vocational aspirations.\n                “Oh my God,” Tony says, hooking his sunglasses half off his face to stare gleefully at the first place they stop. “Tell me you dance.”\n                Jason rolls his eyes so hard he damn near sprains them. “Yeah, asshole,” he says, “there’s a real demand for male dancers at The Boobie Trap.”\n                “Your tits,” Tony yells, at Jason’s retreating back, “are life-changing.”\n                Jason flips him off with both hands, but he can’t fault the guy for accuracy.\n                The warehouse goes a little better, because Tony gets immediately distracted by all the dissected machines. Jason spends a few minutes bullshitting his way toward a goodbye with Jo, but then they have to leave quick, because Tony pops his head into the office and says, “Hey, just curious, how much of this is stolen? Because I don’t have a lot of experience with this sort of thing, but I’ve noticed you guys have a real grudge against serial numbers.”\n                Jason figures the whole thing will last a week, maybe a handful of days. He doesn’t take direction well. Never has. But he makes Tony pay him for three months up front, in cash, and so, even if things go to hell and Jason decides to leave in the middle of the night, he’s still got the cash.\n                He can be gone by morning, surface in L.A. or Phoenix or Las Vegas.  And, with money like that, he’ll be better off than he has been in years. Better than he’s ever been, really.\n                It is, objectively, a lot of money. That’s not why Jason stays. Hell, it’s not why he signed up in the first place. When he’s feeling charitable, he lets himself pretend he’s here for the cars, and the pancakes, and the endless series of truly insane parties Tony brings him to.\n                When he’s not feeling charitable, he finds something else to think about.\n \n \n \n                Granted, it’s not exactly a dream job. He’s still working with Tony Stark, who’s a Goddamn walking, talking, whiskey-shooting disaster on his best days. And he’s still Jason Todd, who’s a look and a breath away from fighting anyone, anywhere, over anything at all.\n                Four weeks into his employment, he damn near fights Tony.\n                “Hey, asshole,” Jason says, barging into Tony’s office, “I’m not your fucking Ken doll.”\n                “Sure aren’t. Not in pants like that,” Tony says, in that upbeat, agreeable way he uses whenever he knows he’s in trouble but can’t fathom why. \n                Jason grabs a stack of papers off Tony’s desk and throws them at him. They explode into a hurricane of 8½x11, spiraling around Tony in a sad, fluttery storm before dropping to the ground. Tony blinks at him, looking genuinely nonplussed.\n                “Wow,” he says.\n                Jason almost throws the stapler at him, too, but Tony’s reflexes aren’t great, and he doesn’t want to accidentally staple him in the eye. No matter how pissed he is. “Not your Barbie,” he yells, “not your pet, not your fucking toy, Tony. I am a person. Get it? I am a human fucking being.”\n                “Yes,” Tony says, slowly, “I’d puzzled that one out on my own, actually. I’m very observant.”\n                Jason throws his hands in the air and lets out a completely reasonable, very manly noise that is not at all a shriek of frustration. Because Tony doesn’t get it. He still doesn’t get it. “You can’t just move me wherever you want me. You can’t send movers to my apartment when I’m not there, box up all my shit, and move it into your fucking castle by the sea, asshole!”\n                Tony’s face contorts like he’s trying not to laugh. A second later, he shifts right into hurt. “Well,” he says, “you can move out if you don’t like it.”\n                Jason groans, deep in his throat, and covers his face with his hands. “Goddamn it, Tony,” he says, “Goddamn it.”\n                “Is this about those unregistered firearms?” Tony asks, helpfully. “Because these guys are very discreet.”\n                Jason peels his hands off his face so he can stare at Tony. “Did you,” he says, slowly, “ask for an itemized list of every single one of my personal items, Tony? Did you do that? Did you honestly have them catalog everything I own?”\n                Tony hesitates. His mouth opens and shuts, and he drums his fingers on the desk. “Well,” he says, tentatively.\n                Jason very calmly picks up the stapler on Tony’s desk and throws it across the room.\n                “It’s standard practice!” Tony tells him, earnestly. “It’s standard practice, so they can be sure nothing’s lost in transit. Anyway, I just kind of glanced over it. I can see – looking back, in retrospect – how maybe this was a little invasive, but the commute was ridiculous. You were wearing yourself out. You slept in a car. Twice! Twice last week, you slept in one of my cars because I kept you out too late, and so it just made sense. It just made sense to move you in.”\n                “You moved me into your house,” Jason says. “You moved me in, and you went through all my stuff, and, for fuck’s sake, Tony, I gave a kid in a foster home a concussion for touching my stuff once. You can’t do this shit. It’s my stuff.”\n                “You were in foster care?” There’s something off about the question. Tony’s got that weird look on his face again, the one that means he knows he’s in trouble.\n                Jason settles heavily into the chair across the desk from Tony. “You pulled every record there is on me, didn’t you?”\n                Tony presses his mouth into a near-invisible line, like he thinks there’s a chance in hell that it will help him shut himself up. Three seconds later, he caves. “I was curious,” he says. “I get curious about things, and then I--”\n                “Then you run them into the ground,” Jason says. “I know.” He does. He’s seen people and things and theories catch Tony’s attention. He goes after them like a bloodhound. There’s no stopping him. Once his brain gives him a question, he doesn’t give up until he can hand it back an answer.\n                “I’m sorry,” Tony says. He looks deflated. He looks worried that Jason’s going to leave instead of ready to fire him, which is bullshit because Jason just tore in here and threw things and yelled at him. Jason’s an asshole.\n                Of course, Tony’s an asshole, too. Maybe they deserve each other.\n                “You gotta ask me,” Jason tells him. “I don’t like when things just happen to me, Tony. Okay? I don’t like no warning. When people just make things happen, and I don’t get a say.”\n                Tony nods. He fiddles with the nearest pen and then hooks a notepad over, starts writing. “I’ll have them move your stuff back tonight.”\n                Jason takes a long look at Tony’s face, the practiced nonchalance, the way he only shows tension in the tightness of his jaw and shoulders. He sighs. “It’s fine,” he says. “But you better not have put me in any of the shitty guestrooms.”\n                “Of course not,” Tony says, looking up at him sharply. He hesitates for a second and then starts to smile. “I gave you a suite.”\n \n \n \n                So then, suddenly, Jason’s not even paying for his own living expenses. He lives at Tony’s place, doesn’t pay rent, and, whenever he’s too lazy to go to the grocery store, he just puts what he wants on a list, and someone else drops it off for him.\n                It’s downright surreal, how easy life becomes.\n                Because, all in all, being Tony’s security team isn’t a particularly demanding job. He drives, sometimes, when Tony doesn’t want to bother waiting for his driver, and he goes where Tony goes, when Tony’s going somewhere other than his workshop. And he only has to dress like an idiot when they’re going somewhere with an actual dress code, and even that’s not so bad, really, because Tony pays for all the stupid clothes.\n                “Oh shit,” Tony says, the first time he comes upstairs from his workshop to find Jason loitering near the piano in a tux, “is this what you look like when you’re making an effort?”\n                “This is what I look like when I’m grumpy and uncomfortable,” Jason corrects. He’d spent fifteen minutes figuring out the stupid tie. He’s still pissed about the shoes. “How long are we gonna be at this bullshit party?”\n                “Couple hours, sunshine,” Tony says. “Gotta charm a few skittish investors. Show a little leg. You know how it is.”\n                “Huh,” Jason says, as he herds him toward the car. “Is that why your pants are so tight?”\n                Tony snorts and flashes him one of his unnaturally bright smiles, the ones that make him seem like he’s lit up from the inside. Those smiles get people in trouble. Jason’s seen iron wills crumple in the face of them. Fortunately, he’s been building up a tolerance.\n                “I’m wearing them for you,” Tony tells him, and Jason gags audibly and then shoves him into the backseat of the car, tries desperately to hide his smile as he climbs in beside him.\n \n \n \n                Those first couple of months, Jason doesn’t do his job very well. He’s too worried about getting fired. He’s busy doing what Tony wants instead of doing what Tony’s paying him for.\n                Jason has fun, most of the time. It’s impossible not to have fun around Tony. He creates it, easy as breathing.\n                The only trouble is the physics of the thing, that whole problem where everything that goes up must eventually come back down. When Tony’s up, he’s so fucking up that Jason thinks someone should put a leash around his ankle, make sure he stays in orbit. But there’s something mean in Tony, some kind of rich boy self-loathing that Jason rolled his eyes at, in the beginning, but quickly grows to hate, because it causes him innumerable issues.\n                He doesn’t know what the hell to say to Tony about it. It’s not his place, obviously, but that wouldn’t stop him if he had the first fucking clue how to approach it.\n                “Christ, Tony,” he says, the first time he spends half an hour in a club bathroom, waiting for Tony to stop puking long enough to put him in the car. “Everybody’s lonely, you know? Tequila is terrible company.”\n                It doesn’t help. Tony’s capacity to ignore things he doesn’t want to hear is damn near superhuman.\n                Jason makes his peace with the alcohol, especially when they’re home. He comes up with strategies, field tests them, hones their effectiveness. He learns the early warning signs, knows when Tony’s still gently pushing too much and hasn’t fallen into disaster levels yet. He successfully pays off several bartenders to give him shots of vodka that are 75% water. More than once, he switches Tony’s full shot glass for an empty one right before Tony tosses it back, and the poor, dumb, self-destructive bastard doesn’t even notice.\n                The drinking is obnoxious and inconvenient and occasionally alarming, but Tony’s twenty-two. Jason knows what that’s like. He’s twenty-three, but he grew up in Gotham, so his mid-teens were the rough equivalent. There are plenty of nights Jason doesn’t remember. Plenty of loud mistakes, plenty of alleys he decorated with puke.\n                It’s the drugs that scare the shit out of him.\n                He only sees them once. Despite the rumors, Tony doesn’t actually seem that interested. There’s weed, sometimes, but it’s California. And there are worse things that could happen to Tony than an evening spent trying to use tortilla chips to explain particle physics to Jason. At least he’s eating. At least he’s sitting down.\n                The first time Jason sees someone hand Tony a bag of pills is also the last time Jason sees it, because he throws an unholy fit about it.\n                “What the fuck,” Tony says, the whole way home, as Jason throws the pills, one by one, out the window and refuses to talk to him. “Jason, it was a party. I’m not even drunk. Let’s go back. Come on.”\n                “Hey, asshole,” Jason says, when they pull up in front of the house. “Hey. Listen.”\n                Tony goes quiet. He gives Jason a searching, sideways look.\n                “My mom overdosed when I was sixteen,” Jason says. It doesn’t even hurt to say. Because he’s not saying it. They aren’t having this conversation. He’s going to forget this whole evening, and this whole talk, as soon as he gets out of the car. “My mom overdosed on shit I bought for her. Okay?  She was sick all the time, and it made her feel better, so I’d get it for her. And then one of Batman’s fucking asshole enemies mixed up a bad batch, and killed half the junkies in the Crime Alley in one night.”\n                Tony makes a quiet, hurt noise. Jason ignores it. He can’t think about it. He can’t think about any of it.\n                “I watched her die for years. It was fucked up. I stuck around ‘til it was over, because she was my mom, and I loved her.” He looks over at Tony, makes sure he’s looking back at him. “I’m not gonna stick around for you. Understand? I don’t care if it’s casual. I don’t care if you only do it a couple times. You fuck with that shit again, and I am leaving the next chance I get.”\n                Tony rubs at his face. “I’m not--”\n                “I don’t care what you’re not,” Jason says, louder than he means to. He cuts himself off, lowers his volume, regains control. “My mom, she wasn’t an addict either. Swore it, every day of her life, until she fucking died from the thing she wasn’t. And I’ll be gone, Tony. I’m not fucking with you. I’ll be gone before you even come back down.”\n                “Okay,” Tony says. He breathes out, twists his hands together like he doesn’t know what to do with them. “Okay, alright. I won’t.”\n                “Good,” Jason says. Some part of him practically sings with relief, but he’s heard promises like that before. He’ll hold off on believing them this time.\n                “Good talk,” he says, and he climbs out of the car and shuts the door, takes the keys with him, and goes to his room to start working on forgetting any of this ever happened.\n \n \n \n                The cars are easily Jason’s second favorite part of the job. Tony has a regular driver – Happy, who turns out to be a decent guy once he’s decided Jason’s not a degenerate, or a gold-digger, or Tony’s pet drug dealer – and a whole pack of backups, but sometimes Tony gets sick of all his attendants, and then it’ll be just the two of them, setting off on some dumb adventure.\n                Jason likes driving. Always has. All of Tony’s cars are beautiful, and, most of the time, Tony lets him take whichever one he wants.\n                Jason doesn’t even mind when Tony picks someone up while they’re out, because, hell, Jason knows exactly what he’s signing up for, when he considers all the lined-up machines and picks the flashiest one. Besides, it’s good for Tony to get out of his workshop. And it’s nice, when Tony finds some giggly brunette at a research conference or a sweet redhead at a gala or a blonde with a crooked grin at some shitty bar. It’s nice, when they appreciate him, when he appreciates them.\n                It’s less nice when Tony leans into that self-loathing and finds someone who’ll echo it back at him.\n                Jason does his best to ignore it, when that happens. Not his place. Not his business. And no matter how much he’s willing to push things, Jason really, honestly doesn’t want to get fired from what is unquestionably the best job he’s ever had.\n                And then Tony picks up some asshole at a charity benefit who spends the first half of the ride home telling Tony’s he’s twice as pretty as his dad but half as smart, and it’s is so fucking creepy and weird that Jason gives up on dental insurance and longevity checks and pulls the car over in the middle of the highway.\n                “Get the fuck out,” he says, without turning around.\n                The guy opts to get loud, instead, which means Jason has to get out of the car, come around the side, and physically drag him out like a recalcitrant preschooler who doesn’t want to get out of the ball pit. Jason drops him on the sidewalk, spits in his face just for making him work for it, and then climbs back in the car and takes off.\n                “That was,” Tony says, “wow. Just. Really uncalled for.”\n                “Yeah, I don’t give a shit,” Jason says. “The only person who’s allowed to shit-talk you in this car is me. Me, and Rhodes. And sometimes Happy. But that’s it. Everyone else can be respectful, or they can take a Goddamn walk.”\n                Tony scowls out the window, neck craned to stare at the disappearing figure of the man they’re leaving behind. “Fuck off,” he says, “I don’t need you to look after me.”\n                Jason makes a noise that could, charitably, be called skeptical. “Then you shouldn’t have fucking hired me to do it.”\n                Tony turns around to stare at him in the rearview mirror, narrow-eyed and unhappy, and Jason figures he’s fired, but, after a moment, Tony just sighs and tips his head to rest against the window. “Let’s get pancakes,” he says. “I know a diner nearby.”\n                The diner isn’t as good as the first place Tony dragged him to, but, if that’s supposed to be a deterrent, it doesn’t work. Two weeks later, Jason kicks out a leggy blonde that treats Tony like an ATM with a pulse. A few days after that, Jason drops a man twice Tony’s age outside the closest strip club because the guy won’t stop trying to talk Tony into blowing him in broad daylight while Jason’s driving.\n                “Aw, c’mon,” Tony complains, “he was kind of sweet.”\n                “Gross,” Jason says. “I’m gonna puke, Tony. I am. Just all over myself, all over the upholstery. Everywhere.”\n                “I’m gonna get a privacy window installed in every one of my cars,” Tony says. “You’re ruining my life.”\n                “Fuck you, you’re ruining my life,” Jason says.\n                Over the next six months, Jason kicks seven different people out of Tony’s cars. He leaves the horny ones outside strip clubs and porn shops, leaves gold-diggers at banks. And once, memorably, he drops a guy outside the ER with blood on his mouth, and spends the whole drive back to Tony’s place ignoring the sluggish bleeding of his knuckles.\n                “Fuck,” Tony says, quietly, when they’re back at Tony’s place and Jason’s hefting him out of the car. “Jay, I’m fucked up. Tell that guy to go home.”\n                “Sure,” Jason says. And then he pitches his voice a little louder and yells, at no one, “Hey, asshole, fuck off.”\n                Tony laughs and leans into him, presses his face into Jason’s neck. He’s lighter than he should be. He can’t keep any weight on. Jason’s going to have to start badgering him to eat.\n                He doesn’t know how the hell this is his life. He doesn’t know how he ended up here, worried that a billionaire isn’t eating enough. But the shitty, inarguable fact of the matter is that Tony’s cars are Jason’s second favorite part of his job, and Tony is his favorite. So he might as well look after him.\n                Hell, he’s getting paid and everything.\n \n \n \n                One year into the job, some news company digs up dirt on Jason, probably because he threw one of their cameramen (and his camera) into a fountain, and then everyone with an internet connection knows Jason’s just some guy Tony found on the street.\n                “I can’t decide,” Jason says, pensively, “if they think I was your dealer or a hooker you brought home like a stray puppy.”\n                “This isn’t funny,” Tony says, scowling at the screen. “You want me to sue them?”\n                “Oh, sure,” Jason says, while dutifully chomping his way through a spoonful of the grotesquely crunchy, healthy cereal he filled Tony’s cabinets with. He’s been trying to lead by example. If this doesn’t work, he’s gonna have to hold Tony down and feed him like a toddler. “Can you sue people for facts?”\n                “You’re not a hooker,” Tony says. “I would’ve noticed.”\n                Jason shrugs. He isn’t, but he might’ve been, if things had gone a little differently. Anyway, he has no problems with the profession. “They just kinda insinuated I was. It’s not a crime to insinuate anything.”\n                Tony reaches over and pats him comfortingly on the hand. “We’ll let the lawyers decide that one, sweetie. Don’t you worry your pretty little high-priced escort head about it.”\n                Jason grins around his spoon. “You think I’d be expensive?”\n                “You are expensive,” Tony reminds him.\n                Jason keeps getting raises. He doesn’t ask for them, and Tony never mentions them. But every three months, his ludicrous paychecks push to new heights of insanity.\n                “Yeah,” Jason says, with a shrug. He pours more cereal into Tony’s bowl and smiles wider when Tony digs his spoon in without looking up from his screen. “Guess I am.”\n                They’re quiet for a while, crunching through the terrible cereal in silent solidarity, and then a particular image catches Jason’s eye. He makes a quiet, interested noise and clicks on the link, zooms in to examine the name typed neatly in the center.\n                “Oh, look,” he says, holding his phone up for Tony to see. “They dug up my high school diploma.”\n                “Huh,” Tony says, dropping his gaze quickly back to his cereal. “Did they?”\n                Jason rolls his eyes, utterly unimpressed with Tony’s feigned disinterest. “Yeah, says I graduated with honors. Which is real interesting to me, personally, since I know damn well that I dropped out junior year.”\n                Tony blinks and stirs his cereal around with unprecedented interest. “Educational standards have really hit an all-time low in this country,” he says, so damn innocuous that Jason would almost buy it, if this was the first time Tony had tried to lie to him.\n                “Tony,” he says, and he can’t help it. He’s laughing, right in the middle of being annoyed. “Tony, did you forge a high school diploma for me?”\n                Tony chances a look up at him and starts smiling the second he sees the look on Jason’s face. “It was almost entirely accidental,” he says.\n                Jason laughs harder and drops his head into his hand. “Goddamn it, Tony.”\n                “I just hacked in to see how you did. I was just curious. And then I just kinda clicked a few things to see what would happen, and, suddenly.” He waves his hands as if falsifying educational documents is a thing that could happen as easily as sneezing.\n                Jason shakes his head and stands up, grabbing their empty cereal bowls and heading for the sink. “Is there anything else I should know about? Any PhD’s? Am I a medical doctor? An ordained minister? Can I officiate weddings? How about exorcisms? Hey, Tony, can you make me a priest?”\n                “I just thought…” Tony shrugs, trails off. “You should have one. A diploma, I mean. For your next job.”\n                Jason blinks. He sets the bowls down in the sink and turns to give Tony a dubious look. “My next job? Should I be job hunting?”\n                “No,” Tony says, and it’s flattering, really, how horrified he sounds by the idea. “God, no. Not unless you want to. I mean.” He holds up his tablet, which is still locked on the screen of the news article about Jason. “I’d get it, if you wanted to. After all this.”\n                Jason snorts and crosses his arms over his chest. “Christ, Tony. What, am I supposed to be ashamed? I know who I am. I’m just some trash kid from Gotham who stole a billionaire’s tires and lucked into a good thing. Nothing in that article bothers me. I don’t give a shit what they say about me.”        \n                “You aren’t trash,” Tony says, so vehemently that Jason could kiss him, if that weren’t a weird, bizarre, absolutely ludicrous intrusive thought that had no business popping into his head like that. “I’m gonna sue them,” Tony says, decisively. He sets his tablet down and reaches for his phone. “We’re suing.”\n                Jason shakes his head and smiles, fond and exasperated in equal measure. “Tony,” he says, “I don’t give a fuck what they say about me. And I appreciate the diploma. That was real sweet. But I’ve got no plans to leave any time soon.”\n                Tony hesitates, fingers still wrapped around his phone. He seems brittle for a second. It happens, sometimes. He’s more sensitive than people would guess, and about the weirdest shit. When he finally looks up at Jason, he looks grateful.\n                “Good,” he says.\n                Jason stares at him, struck by the look on his face, struck by how much he really, really doesn’t want to leave. Then he clears his throat, refills Tony’s coffee cup, and hooks a hand in his collar, tugging him to his feet.\n                “Alright,” he says, “c’mon, c’mon, you’ve got that meeting in half an hour, and I’m not covering for you again. Stane hates me. Let’s go.”\n \n \n \n                After the news story runs, Jason has to buy new guns. “Well,” he says, when Tony asks, “I kinda stole the ones I have. I mean, from some real shitheads, so I don’t feel bad about it or anything, but, if I have to pull a gun in public, the cops might notice that it’s not registered to me.”\n                Tony nods slowly. “Alright,” he says. “Makes sense.”\n                Jason does research, because it turns out he’s a little into that sort of thing, when he has the opportunity to be choosy. He’s still comparing options online when a woman shows up at the house and delivers an envelope to Tony, who promptly hands it to Jason.\n                “The hell is this?” It’s not sealed, and, when Jason turns it over and shakes it, a credit card falls out. It’s shiny, new, and has the Stark Industries logo on the front, right above his name.\n                “That’s a company expense,” Tony tells him. “The guns. So use the card.”\n                “You’re fucking ridiculous,” Jason says, shaking his head. “Do you know how much you pay me?”\n                Tony shrugs. “It’s a company expense,” he repeats. “Use your money for personal expenses.”\n                Jason’s mostly been using his money to accumulate the kind of savings account that means he gets personal attention from bankers whenever he walks into a branch. He’s also been sending money to a few nonprofits back home, the ones that had actually helped him and his mom, back when they needed it. Other than that, he doesn’t have much use for it. Doesn’t really know what to do with it.\n                He uses the new credit card anyway. Tony looks over his guns when he brings them back, and Jason can’t work out if Tony’s flattered or offended that half of them came out of Stark Industries.\n                “You need anything else?” Tony asks, while he’s taking Jason’s guns apart, right there on the breakfast table. “Any other supplies? Training?”\n                “Training,” Jason repeats. He’s thought about it. He’s not worried about street fights; he knows how to fight fast and dirty and mean. But, sometimes, when he gets to bullshitting with the other bodyguards, he feels irritatingly outclassed. “Maybe, yeah,” he says. “Maybe training.”\n                Tony nods. Jason’s a little distracted by how quick he is, with the guns. How competent. Also, by the chronically and tragically underappreciated strength in Tony’s forearms.\n                “Sure,” Tony says. “Hire whoever. Have them come here, alright? Or HQ. You guys can use the gyms, or the range. Whatever. Just make sure it fits with our schedule.”\n                “Company card?” Jason asks, mouth curling up a little at the corner.\n                Tony looks up at him, blinks. “It’s a company expense,” he says.\n                “You’re a Goddamn menace, Stark,” Jason tells him.\n                Tony grins at that, clearly flattered. “Hey,” he says, “try to get some kind of certificate out of it. People love certificates. It’ll look good on a resume.”\n                Jason sighs. He reaches over and takes his guns back, before Tony can start upgrading them in their kitchen. “I’m not job hunting, Tony.”\n                “Okay, sure,” Tony says, making half-hearted grabby hands at Jason’s guns. “For when you do, though.”\n                Jason rolls his eyes and flips him off. He doesn’t know how to be any clearer about it than he’s been already. He has no intention of leaving. This is the best job he’s ever had. Hell, it’s the best job he’s ever likely to have. He’s not going anywhere.\n \n \n \n                Jason realizes he has to quit his job on a Friday night. It hits like a right hook to the ribs, damn near knocks the breath out of him when it lands. It’s a Friday night, in December. It also happens to be Christmas Eve.\n                They’ve been going to parties and galas and dinners and events almost every day since Thanksgiving. Tony calls it the busy season, but Jason figures he makes it that way. Burns himself out on people so, by the time Christmas rolls around, it feels like a gift, spending it alone.\n                Jason doesn’t mind it so much, the empty house, the slow, sleepy, business-as-usual Christmas morning. He hasn’t celebrated very many Christmases. And spending Christmas alone with Tony is a hell of a lot better than spending it playing bouncer at a strip club. But it seems to weigh on Tony.\n                It hits a fever pitch around mid-December, when the anniversary of his parents’ death rolls around. He won’t sleep for days leading up to it, just dashes around from party to project to pretty distraction, drinks coffee all morning and whiskey all night. And then he falls into a pit on December 16th, stays in his room all damn day, and emerges the next, ready for whatever array of events awaits him.\n                And now it’s the 24th, and they haven’t left the house since they got back around 1am the night before. Tony’s been in his workshop most of the day, and Jason spent a few hours in the gym, because he’s got this terrible inkling that his personal trainer is going to come for him on January 1st with some kind of unholy new year, new you rallying cry.\n                Not that Jason needs a new him. He’s a damn nightmare now. Turns out, with proper nutrition and a personally tailored exercise program, his body is happy to pack on muscle like it secretly always wanted to be Batman and was just waiting for the opportunity.\n                People seem to appreciate his new body. Jason doesn’t blame them, although he privately thinks the wirier, sharper version of him had a certain feral charm to it, too. On several separate occasions, people have wandered out of Tony’s room in the morning, found Jason at the breakfast table, and then tried to follow him back to his suite. Twice, he’s taken them up on it.\n                Well, he’s never been a saint.\n                As is evidenced by the fact that it’s Christmas Eve, and he’s trying to decide if he should wait for Tony to crawl out of his lab or go out to the bars alone, see if any of the lonely people out drinking on Christmas Eve would welcome some company.\n                He’s still weighing out his options when he hears a rattling knock on his door followed immediately by a burst of song.\n                “---won’t go until we get some, we won’t go until we get some, we won’t go until--”\n                “Hey,” Jason says, pulling the door open to find Tony standing there, barefoot, with oil stains on the front of his white undershirt and a dumb, happy grin on his face. This is the first sign of trouble, but it’s a glancing blow more than a knockout punch; Jason’s seen Tony like this plenty of times. “Are you caroling me or sexually harassing me?”\n                Tony salutes him with a glass. He’s got two, and he pushes one of them into Jason’s chest until he accepts it. “If you carol right,” Tony tells him, earnestly, “you can do both at the same time.”\n                “Huh,” Jason says, biting back at smile. “You got any sexy renditions of ‘Twelve Days’ in your repertoire?”\n                “Too easy,” Tony tells him.\n                “Yeah, that’s what I hear,” Jason mumbles, rolling his eyes.\n                “‘Twelve Fucks of Christmas,’” Tony says, with dignity, and then he clears his throat and launches right into it. “On the first day of Christmas, my lover gave to me--”\n                “If this song includes bestiality,” Jason says, “I just want to be clear, I’m quitting immediately.”\n                Tony falters. He hesitates for a second. “Would you,” he says, “be interested in ‘Jingle Balls’ instead?”\n                “Would I,” Jason says.\n                “Or,” Tony says, with a burst of enthusiasm, “‘Rudolph the Red--’”\n                “Bestiality,” Jason says, sharply. “Got my letter of resignation all typed up.”\n                “Spoilsport,” Tony accuses. He’s flushed and smiling. Happy. Whatever work he’s doing in his lab must be going really well. He nods his head toward the cup in Jason’s hand. “Drink up,” he says. “I made you some eggnog.”\n                Jason blinks down at the glass in his hand and takes an investigative sip. “Yeah,” he says, theory confirmed, “this is actually just whiskey.”\n                “Oh.” Tony furrows his brow. “Well, I thought about eggnog when I poured it.”\n                “Good enough,” Jason says, and taps his glass against Tony’s before taking a healthy sip.\n                They’re definitely not going anywhere tonight. They stayed in last year, too. It was nice, Jason thinks, although he doesn’t remember most of it.\n                “Hey,” Tony says, gaze suddenly scuttling to the side. “Wanna watch It’s a Wonderful Life with me?”\n                Jason thinks it’s maybe a bad idea to watch a movie about a man who wants to off himself on Christmas Eve, but, if he remembers right, things turn out alright in the end. And Tony looks awkward and hopeful and wary, like he’s ready to be dismissed or laughed at. It looks like this matters to him.\n                Jason’s not familiar with Christmas traditions. Sure, he knows the basics. The national ones, the everyday ones. But his family never had Christmas consistently enough to have habits. He wonders if this was something Tony used to do with his parents, when they were around.\n                “Yeah,” Jason says, with a nod. “Sure, Tony.”\n                Tony beams at him, bright and grateful. That’s the second warning shot. But Tony’s smiled at him plenty of times, and Jason doesn’t take proper precautions.\n                “And Die Hard after,” Tony says, decisively.\n                “Sounds fucking swell,” Jason says.\n                So that’s how they end up sprawled out next to each other on the couch, eating leftover Thai takeout and watching movies until something like three in the morning. There’s a bottle of whiskey on the coffee table, half-empty, and a bottle of eggnog, unopened, and a fire in the fireplace and blankets wrapped around both of them. It’s easily the best Christmas Eve Jason’s ever had, with the possible exclusion of the one from last year that he can’t remember so well.\n                Tony starts dozing thirty minutes into Die Hard. He always gets clingy when he falls asleep, but Jason’s ready for it. Tony burrows in, and Jason wraps an arm around his shoulders, and it’s easy and comfortable, not complicated at all. Tony keeps fading in and out, tracking the movie by sound more than sight. And then he stirs long enough to murmur “yippie ki yay, motherfucker” right into the skin of Jason’s neck.\n                And that’s it. That’s the moment Jason realizes.\n                Tony’s a warm, steady weight against Jason’s side, breathing soft and even, eyelashes standing out against the ever-present bags under his eyes. He smells like engines and whiskey and dumb rich boy shampoo.\n                And Jason is stupidly, hopelessly, helplessly in love with him.\n                Fuck. He has to quit his job.\n \n \n \n                He doesn’t want to quit immediately. He’s not going to leave Tony alone, especially at this time of year. And, anyway, it’s a shitty thing to do, quitting because he’s too unprofessional to keep his emotions to himself. He doesn’t need to make it doubly shitty by quitting when Tony’s still fighting his way back toward what passes as stable.\n                He’s making plans, trying to find his way forward, when the benefit invitation arrives in the mail. Jason can tell them just by weight, usually, so he passes it to Tony over breakfast and is more than a little taken aback when Tony glances at it, snorts, and then pushes it back his direction.\n                “Not your maid,” Jason reminds him. “Throw it away yourself.”\n                “You throw it away,” Tony says. “It’s addressed to you.”\n                Jason blinks, frowning skeptically at the heavy envelope in front of him. “No shit?” Tony just shrugs at him, so Jason reaches over, rips the envelope open, and shakes the contents out onto the breakfast table.\n                He, Jason Todd, has been invited to the annual Thomas Wayne Memorial Clinic benefit.\n                “Oh, did you make a donation?” Tony asks, leaning over into Jason’s space to study the paper in his hand.\n                “I—yeah.” Jason’s sent them more money than he can hold in his head at one time. He’s bad at money, he thinks. He keeps giving it away. But every time too much accumulates in his accounts, he thinks about being fourteen and hungry enough to steal the tires off the Batmobile, thinks about how much he’d hated rich assholes who kept more than they needed and left him without enough.\n                “Nice of you,” Tony says, a little too analytically too pass as casual. “Giving back to the hometown.”\n                “Parts of it.” The parts that mattered. The parts that looked after him, and his mom. Gotham’s a monster that swallows people whole, but even that hellhole has its lifeguards.\n                “Are you gonna go?” Tony fidgets with his phone for a few seconds and then shrugs. “Calendar’s clear.”\n                Jason hasn’t been back to Gotham since the month after his mother’s cheap funeral. He thinks, every year, he should go back, find her grave, give her flowers or whatever the hell good sons do. But he never does.\n                “Sure,” he says, because here he is, holding an actual invitation in his hands, and Tony’s checked the calendar, and so, if he doesn’t go, then he’s just a coward and an asshole, who throws money at problems but never looks at the heart of them.\n                He takes a quick, careful breath and then drops the invitation, face-down on the table. Tony’s watching him cautiously, just out of the corner of his eyes, like he’s trying to be polite about how he’s staring.\n                “Wanna be my date?” The words are out before Jason knows what the hell they’re planning. He’s been ambushed, and he feels betrayed. But Tony just jerks his head up to look at him, and grins, like there’s not a single thing weird about what Jason just said to him.\n                “You’re damn right,” he says. “But I’m warning you, I’m gonna blast different covers of ‘The Boys Are Back in Town’ the entire time we’re within Gotham city limits.”\n                “Goddamn it, nevermind,” Jason says, rolling his eyes, “I’m taking Happy.” \n \n \n \n                Happy does end up tagging along, mostly because they need a driver, and Jason’s endlessly grateful he’s there, because Happy only lets Tony play the stupid song three times in a row before he pretends the sound system’s broken.\n                Their hotel is in the Diamond District, because of course it is. Jason feels like a tourist in his own city. It’s weird, staring out the window, looking at the wrong side of skyscrapers he’d grown up seeing every day.\n                He visits his mom’s grave the morning after they arrive, brings a bouquet of flowers that he asked the lady at the flower shop to pick out. There’s nothing much to mark the spot, and Jason keeps meaning to do something about that, buy a real headstone, do something, but, as soon as he thinks about his dead mom in the ground, his head fills up with static so fast that he never gets anything done. He lays the flowers on the ground, stands there until he can’t anymore, and then he runs back to Tony, who doesn’t ask him where he’s been.\n                Over the next couple of days, he lets Tony take him out to a series of restaurants that Jason heard about as a kid but has never actually been near. When he walks in next to Tony, not one single person looks at him like he doesn’t belong, but the wait staff raise their eyebrows, sometimes, when he’s not careful enough about his accent.\n                “Aside from the architecture,” Tony says, one night, “and the weather, which is, objectively, fucking abhorrent, I don’t get what’s so bad about Gotham. Seems like a pretty normal city to me.”\n                Jason laughs. “Well, Jesus, Tony,” he says, gesturing around him helplessly, “that’s because you’re in the Diamond District.”\n                The benefit’s up in Crest Hill, which is just as bad as the Diamond District, but they have to go through the Bowery and Crime Alley to get there. Jason runs them right through the heart of it, instead of taking any of the easier, prettier loops or the flyovers. Happy gets visibly uneasy as soon as they enter the East End, and Tony leans forward, staring out the window, eyes focused and face a mask of something Jason can’t read.\n                Pity, maybe. Or guilt. Jason stops looking, after a while.\n                “You grew up here?” Tony asks. He’s watching his tone, which is nice of him.\n                “Yeah,” Jason says, after a beat.\n                It looks even worse than he remembers. The people they pass stare hard at the car, and Jason stares back, but it’s more difficult to meet their eyes than it should be. They’re his people, if he has people, and he still feels himself tensing up, like he’s some stupid, lost rich kid, who thinks poverty is an infectious disease.\n                He’s not ashamed, exactly. He doesn’t know what the hell he is.\n                He’s glad when they’re through it. He’ll have Happy take another route back to the hotel. He doesn’t care what it makes him. He doesn’t want Tony to see this again.\n                “You’ve done real well for yourself, kid,” Happy says, looking at him in the rearview mirror.\n                “Thanks,” Jason says. He feels like a coward and a traitor. But he can’t see how it would’ve done anyone any damn good, if he’d stayed. He’d probably be dead by now.\n                Tony nudges his ankle with his ridiculously shiny shoe. Jason doesn’t respond, and, after a moment, Tony reaches over, settles a hand on Jason’s shoulder. He leaves it that way the whole ride to the event hall and then, once they’re there, he gets a drink in Jason’s hand within sixty seconds of walking through the door.\n                “Christ, Tony,” he says, “I’m fine.”\n                “As hell,” Tony agrees, leering at him appreciatively.\n                It startles a laugh out of Jason and then, after that, things are easier. It’s a surreal evening. This isn’t a Wayne Foundation benefit, so most of Gotham’s highest tier of royalty have passed on attending, but Bruce Wayne shows up an hour or so after they do, and Tony lights up when he sees him.\n                “Oh,” he says, “let’s go talk to Bruce.”\n                “God,” Jason says, cringing reflexively. “No, Tony.”\n                “Yes,” Tony says. “Don’t be shy. He’s fun.” He throws a companionable arm around Jason’s shoulders and herds him along, and Jason could duck under that arm in a heartbeat, but he doesn’t want to.\n                And so that’s how he ends up standing there while Tony and Bruce exchange the kind of pleasantries that only wealthy people understand. Jason lets the references to vacation properties, and stock options, and investor confidence, and celebrity cocaine addictions wash over him while he stares around the room, trying to decide how much money he could raise for the Memorial Clinic by holding the entire party at gunpoint and demanding their jewelry.\n                “---from Gotham,” Tony’s saying, in the background. “Stole the tires off the Batmobile once, actually.”\n                “Tony,” Jason says, his head snapping back around. “Tony, no.”\n                Tony blinks. “Oh,” he says, “is that one of those stories we don’t tell in Gotham?”\n                Jason grimaces, looks toward Bruce Wayne, and finds one hell of an interesting expression staring back at him. For a second, Bruce has an expression like Tony in the workshop, focused with an almost unsettling intensity, and then he blinks and throws a wide, charming grin Jason’s direction.\n                “Did you really?” He sounds like he doesn’t believe it, but like he’s willing to laugh along anyway.\n                “He did,” Tony says. “Tell him. Tell him about how you couldn’t sell them, because---”\n                “No one would buy them. They were custom,” Jason says. If he finishes the story quickly, he can pretend this never happened, and he was never standing next to Bruce Wayne, Prince of Gotham, explaining how once, as a shitty street kid, he stole from the Dark Knight. “Couldn’t offload them. Everyone knew exactly where they came from. They thought they’d get tracked, somehow, and anyone who touched them would end up in Arkham.”\n                “Arkham?” Bruce tips his head to the side. “Not Blackgate?”\n                “Well, they just figured…” Jason shrugs. “I mean, anyone who stole the tires off the Batmobile is clearly a fucking lunatic.”\n                “Clearly,” Bruce says, with a small, crooked smile. “So what did you do with the tires?”\n                “Threw ‘em in the river,” Jason says. He shakes his head, still annoyed by the waste. “I should’ve tried to get Batman to pay for them.”\n                “Yeah,” Tony says, “like a hostage situation. With tires.”\n                “They might still be down there,” Bruce says, as he knocks back the rest of his champagne. “Maybe you could still give it a try.”\n                Jason laughs. “Hell, no,” he says. “I’m not fourteen anymore. I’ve got things to live for now.”\n                There’s an odd moment where Jason’s eyes go to Tony, and he finds that Tony’s staring back at him, a fond look on his face. They blink when their eyes meet and then both of them find something else to look at. They turn, in unison, to Bruce Wayne, who looks more amused than the situation calls for.\n                “Well,” Bruce says, “it’s good of you to come back. Brave of you, too.”\n                He shakes hands with Bruce Wayne, which adds an extra layer of what the fuck to the truly bizarre evening, and then he and Tony wander around for another hour before calling Happy to come pick them up.\n                It’s not late when they get back, barely past midnight, so Tony follows Jason into his room and calls down to room service to see what he can get away with while Jason grabs a change of clothes and heads into the shower.\n                By the time Jason’s out of the shower, Tony’s clearly ransacked through his suitcase for clothes, and is sitting there, utterly unashamed, eating room service pizza and wearing Jason’s Gotham Knights shirt and a pair of his sweatpants. He’d be pissed about it, but, honestly, the pizza isn’t bad, and it’s not like Tony’s going to stretch out the shirt.\n                They stay up late, watching the news, because Tony wants to see if they catch any sightings of Batman. Jason has to translate half of what the newscasters say, and he ends up drawing a map on the inside of the pizza box, just so Tony can orient himself to the stories.\n                Around two in the morning, Tony starts getting sleepy. “I’m not carrying you to your room,” Jason tells him. “You fall asleep in here, and you’re staying here.”\n                “Oh no,” Tony mumbles, face pressed into Jason’s pillow, “not into the briar patch.”\n                “Asshole,” Jason says. He bustles tiredly around the room, putting things away, clearing the food out of the bed so Tony doesn’t wake up covered in half-eaten pizza.\n                They’ve slept in the same bed before. It happens. They travel, and they go to a lot of parties, and they’re almost always out later than they should be, and Tony’s got no Goddamn sense of personal boundaries.\n                They haven’t done this since Christmas Eve, though, and Jason thinks maybe he shouldn’t, now that things have changed. Maybe it’s creepy now, where it used to just be kind of nice.\n                “Stop fucking around,” Tony grumbles. “Turn the lights out. Go to bed.”\n                “You’re in my bed,” Jason tells him.\n                “Oh, fuck off,” Tony huffs back, and so Jason figures, you know, the hell with it.\n                He ditches his shirt and climbs into bed. There’s more than enough space for the two of them, and there’s something comforting about having Tony this close, being able to hear him breathing. It’s good, knowing he’s safe.\n                “Hey,” Tony says, later, when Jason’s so close to sleep that he isn’t sure if this is the last bit of wakefulness or the first part of a dream. “Thanks for leaving all this. Your city.”\n                “Gotham’s got Batman,” Jason mumbles back. It’s not a complete thought, but the rest of it – and you needed me – isn’t something he can say out loud. Anyway, he thinks he needs Tony just as much as Tony needs him. Maybe more. Probably more.\n                “Thanks,” Tony says, again. He doesn’t say anything else after that.\n \n \n \n                Jason starts training his replacements in March. There are five of them, but he figures, by the time training’s over, there will just be a couple left. Tony mostly regards them with amusement. Every now and then, when Jason’s got a pair of them tagging along to some outing, Tony will shoot him these tense, unsteady looks, like maybe he didn’t fully buy it when Jason told him he was looking to add to the security team. But Tony never outright asks if Jason’s thinking about leaving, so Jason never has to lie to his face.\n                It feels shitty, holding the knowledge in his head but not sharing it with Tony. But he wants to give the trainees six months of training, just to make sure they’re ready, and Tony can get a bit overexcited about anything he reads as rejection. There’s a chance that if he thinks Jason’s eyeing the door, he’ll orchestrate something to push Jason out faster.\n                So Jason keeps his mouth shut and tries not to do anything stupid, like kiss Tony right on the mouth when he comes stumbling out of the workshop after an all-night inventing bender, hair a mess, face flushed with victory, hands shaking from too much caffeine and nary a Goddamn nutrient in the past twelve hours. It’s harder to resist than it should be. Sometimes, all Tony has to do is look across a room and smile, and, suddenly, Jason’s brain just flips over and fizzles out.\n                It’s a problem.\n                “Hey,” Jason says, one day, when Tony’s just escaped a board meeting and is slumped dejectedly in the back seat, drained of everything that isn’t boredom and dismay. “We’re doing a training exercise. Just you and me for the first round. Gotta check this company out before I let any of the kids try it.”\n                “Oh yeah?” Tony asks, barely stirring. “Training exercise?”\n                “Mhm,” Jason says. “Incident training.” He glances in the rearview mirror, catches Tony staring at him with a determined sort of blankness, like he’s doing his best to concentrate but can’t for the life of him figure out why. “They’re gonna simulate a kidnapping attempt.”\n                “Oh.” Tony thinks that over a second. “Attempt?”\n                Jason snorts. “Well, they’re sure as hell not gonna be successful.” He pauses, shrugs. “Maybe with the kids.”\n                Tony grins, tired and still too drained to care much. “Great,” he says. “Sounds fun.”\n                It’s perfect. He doesn’t suspect a single Goddamn thing.\n \n \n \n                The kidnapping simulation takes place in the last week of May, on a private island in the Bahamas. If Tony thinks it’s weird that they’re not trying this in a more urban environment, he doesn’t say anything. They land at the private airstrip, drive to the rented house, and then Jason carries their bags inside. Tony gets too distracted trying to impress Jason with his tropical-themed bartending skills to notice that the whole situation is a little strange.\n                By day three, Tony’s staring to get a little suspicious. “How long do they have?” He asks, stirring some unholy combination of fruit juice and rum. He found the stash of tiny paper umbrellas two days ago, and he’s been unrelenting with his use of them. “Are you sure they didn’t just forget us?”\n                “Maybe,” Jason says. He checks his phone, sends a text. “Actually,” he says, after a few seconds of watching Tony sipping at his newest creation, “fuck this. Let’s go find them.”\n                Tony’s eyebrows shoot upwards and then his expression settles into one of delighted mischief. “That’s an option?”\n                “We’re making it an option.” Jason slides his phone into his back pocket. “C’mon, Rambo, let’s fuck shit up.”\n \n \n \n                Tony, it turns out, has always wanted to be Rambo. He commits to the exercise, fully and completely, without any hesitation. They sneak their way toward the beach, and Jason pretends to hear a noise, twice, just to watch the way Tony throws himself down and goes completely still and quiet, for the first time in the year and a half since Jason’s known him. It’s fucking adorable.\n                By the time they make it to the beach, Tony’s dirty and a little sweaty, and Jason’s having a tough time looking at him, because he’s ridiculously, unfairly beautiful. When they break through the overgrowth and make it to the beach, Tony goes still beside him.\n                “What,” he says, “the fuck.”\n                “Surprise,” Jason says. The last of the caterers are leaving the beach. One of them sets a final dish on the table and then hurries after the others.\n                “Is that a cake?” Tony sounds completely lost. “Is that dinner? What is this?”\n                “Kidnapping attempt was the first night,” Jason says, shoving his hands in his pockets. “I told you, there was never any chance it was going to be successful. I handled it while you were asleep.”\n                Tony frowns at him, brow furrowing. “So we’ve just been hanging out for two days? What the hell? Why would we—holy shit.” He hesitates, eyes skittering from the cake to Jason’s face. “Did you trick me into going on a vacation for my birthday?”\n                Jason shrugs and tries not to look too smug. “Sure did,” he says.\n                Tony stares at him, mouth hanging open, for a long moment. He looks at the table, then the beach, then back to Jason. “Shit,” he says, visibly impressed. And then, immediately after that, “I love you.”\n                Jason blinks, too startled to say anything, and there’s a horrible moment where he watches Tony hear what he just said and then shuffle through a whole series of emotions, none of which look particularly pleasant to experience.\n                “Fuck,” he says, “shit. I mean—I meant—I mean, shit. Fuck.”\n                “Tony,” Jason says, “don’t freak out. It’s fi--”\n                “It’s not fine. It’s not fine!” Tony throws his hands up, damn near smacks Jason in the face, which makes Jason wonder when they hell he moved so close. “I mean, I do. Love you. Whatever. I just—you’re my employee, and I’m your boss, and it’s completely inappropriate, and I’ve been paying you to be my friend for eighteen months, and I’m a fucking disaster, and you did this whole thing for me, engaged in subterfuge and secrecy to surprise me, and I—fuck. Can we just—I’m just drunk, is the problem.”\n                Tony sips, aggressively, at the fruity cocktail he’d carried with him, all the way from the house. “I’m shitfaced, Jason. Shitfaced, and sorry. Which is the title of my upcoming biopic, by the way. You can play yourself, if you want, since I assume you’ll have a lot of free time, since you’ll be fucking leaving. And I just---”\n                Jason kisses him. He can’t help it. Tony’s done that thing where he just casually flips Jason’s whole brain inside out, and the only thoughts he has in his head are kiss him and then Tony’s voice, saying I love you.\n                Tony’s still talking when Jason’s mouth lands on his, so there’s an awkward, scrambling moment, and then there’s another, longer moment where Tony goes still, and Jason thinks fuck, abort, abort, but then Tony seems to figure out what’s happening, and then, suddenly, finally, they’re at the same place at the same time.\n                Tony tastes like rum and pineapple juice, sweet and a little tart. He fists his hands in Jason’s shirt so tight that Jason’s not sure he could pull away, if he wanted it. If he ever wants to. He kisses him like it’s all he ever wants to do in his life, and he’s been waiting too Goddamn long to do it.\n                “Hey,” Jason says, when they finally break apart to breathe. “I’m quitting.”\n                Tony blinks up at him. His mouth folds down into a frown, so Jason kisses him again. And then again, until he gets a small, hesitant smile. And then once more after that, because he can’t fucking help it.\n                “Oh,” Jason says, “and I love you, too. Since Christmas. It’s been fucking distracting. I can’t watch crowds when I’m busy staring at your ass. You need to hire another bodyguard.”\n                Tony’s smile cracks open into one of those blinding grins, and Jason thinks, oh shit, it hasn’t been since Christmas. It’s been months longer than that. He thinks maybe he was doomed from the very beginning, from the moment Tony Stark invited him to get pancakes.\n                “So you’re not leaving?” Tony asks, hands still curled tight in Jason’s shirt.\n                “I’m quitting the job,” Jason says, forehead resting against Tony’s. “I’m sure as hell not quitting you.”\n                Tony blinks and then beams up at him, and then Jason has to kiss him again, and he hopes like hell all the caterers have fled the beach, because he’s going to be pissed if any of this shows up online.\n                He’ll have to figure all of this out, soon enough. What he’s going to do, how long he’ll need to stay on before the replacements are ready. He’s not sure if he should move out or stay put or get his own place just to pretend like he’ll be spending time there. He doesn’t have any of those answers.\n                They don’t matter, right now. He’ll figure everything out. They’ve got this island for two more days.\n                He tugs Tony closer, pulls him in until their whole bodies are pressed together, and he keeps kissing him, works his mouth down to the edge of Tony’s jaw, to his throat, to the soft skin right below the arch of his collarbone.\n                The two of them have managed, somehow, to make this moment perfect. He’ll figure out how they’re going to manage the rest of the moments later."
}