{
    "id": "14501889",
    "url": "https://archiveofourown.org/works/14501889?view_full_work=true",
    "author": [
        "kianspo"
    ],
    "title": "Something Smart to Do",
    "rating": "Mature",
    "archive_warnings": [
        "Graphic Depictions Of Violence"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Star Trek: Alternate Original Series (Movies)",
        "Star Trek"
    ],
    "relationships": [
        "James T. Kirk/Spock"
    ],
    "characters": [
        "James T. Kirk",
        "Spock",
        "Leonard \"Bones\" McCoy",
        "Nyota Uhura",
        "Christopher Pike"
    ],
    "additional_tags": [
        "5+1 Things",
        "Fake/Pretend Relationship",
        "First Time",
        "Alternate Universe - Canon Divergence",
        "Tattoos",
        "Podfic Available",
        "Spanish Translation Available",
        "Russian Translation Available"
    ],
    "language": "English",
    "series": "",
    "published": "2018-05-01",
    "completed": null,
    "words": "21,322",
    "chapters": "1/1",
    "comments": "626",
    "kudos": "17,940",
    "bookmarks": "4,905",
    "hits": "135,257",
    "summary": "<p>In which Jim finds himself fake-married to his first officer every other month. It's not his fault. Mostly. Dowries and Klingons are involved. Starfleet is decidedly not amused.</p>",
    "notes": "<p>This is incredibly silly. I was actually working on <a href=\"https://archiveofourown.org/works/32344435/chapters/80182441\" rel=\"nofollow\">a different story</a>, but bits and pieces of this one kept popping up until I had to let them out. I never played cliche bingo, but I imagine if I did, this would have covered all of it. Just, in case you're wondering, yes, I noticed that.<br>ETA re: the inspired by link, I always wanted to write a mirror for Signed, Sealed, Delivered. I guess this is as close as it gets.</p>\n<p>AU - as in, STID and Beyond never happened, and the 5-year mission began straight after Reboot.<br>Not betaed, all mistakes are mine.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "--\n0.\n“I didn’t raise you for serial monogamy,” Winona Kirk says over tea. “That was Sam. You were supposed to be the child that lets me live through him vicariously when I’m old and senile.”\nJim winces. “Please stop.”\n“You’re a huge disappointment, kid. First you become a boringly good captain. Then you keep marrying the same person over and over again, like you had a stash of wedding magazines under your bed when you were thirteen or something.” She takes a delicate bite of her crumpet. “I cleaned out your room at least once a month and you never knew when I was coming, so I know for a fact, that they weren’t wedding magazines, Jim.”\nJim closes his eyes and wishes for a rogue band of Romulans to descend on them.\n“What happened, Jim?” She leans toward him, voice soft. “Have I failed you, kiddo? Because if this is your version of a romantic gesture, it’s pretty redundant, and you’re not that much of a social spaz. Although, the time when you were mad about Ellie McLean comes to mind—”\n“It’s a damn accident!” Jim snaps because there is only so much of this he can take. “I didn’t do it on purpose, it just happened!”\nWinona eyes him skeptically. “Three times in a row?”\n“Four,” he admits miserably. “But who’s counting.”\nShe gives up the act and laughs at him outright. “You know, somehow my deep-space missions were never that entertaining.”\nJim glares at her. “Just for that, I’m not telling you how to turn off the emergency transponder on a Klingon Bird-of-Prey.”\n“No problem, I’ll just ask your husband then.” She smirks. “I kept hoping for a nice Orion girl for you, Jim, but I suppose a Vulcan will do in a pinch.”\nJim buries his face in his hands. “Please disinherit me.”\n“Not a chance.” She eats the rest of the crumpet in one go. “Now spill.”\n \n--\n1. \nThe first time it happens, they’re just over a year into the five-year mission. Their orders, for once, are relatively simple – to formalize the first contact procedure initiated and conducted by the Tsiolkovsky and get the Velerians to sign the treaty, allowing the Federation to use one of their moons as a base. The Velerians prove to be good-natured and friendly, and incredibly easy to deal with, so Jim doesn’t suspect trouble, until the High Governess announces:\n“We are happy to welcome the Federation into our family, Captain Kirk. All we require from you is a small token of trust between our peoples in the form of personal commitment. When a high-ranking Starfleet officer such as yourself joins the governing family of Veleri by marrying one of my daughters, our negotiations will be concluded and formalized.”\nJim blinks, staring at the viewscreen, speechless. He can feel the bridge falling eerily quiet around him and turns to send a panicked glance to Uhura. She looks genuinely distressed but shakes her head at him.\n“Sorry, that wasn’t in the briefing,” she whispers.\nSo either the crew of the Tsiolkovsky had missed it or it didn’t come to that before they left. Jim smiles at the screen nervously, buying time. If Jim refuses without a good reason, there’s no telling how the Velerians might react, and he’d be loath to undo all the careful work of both the Tsiolkovsky and his own crew. Doesn’t mean agreeing to marry some alien princess is an option.\nHe looks at Spock who is standing next to him on the bridge, as has been his custom since the first time they were on a mission together, and inspiration strikes.\nJim grins at the governess apologetically. “I must apologize, Your Excellency, but that won’t be possible. Believe me,” he adds quickly as she begins to frown, “nothing could have pleased me more than to become a husband to one of your lovely daughters. Unfortunately, I’m prevented from accepting this honor.”\n“Prevented by what, Captain Kirk?”\n“By Federation law, Your Excellency,” he explains, trying to convey sincere regret. “You see, I am a Terran citizen, and on Earth it is forbidden to be married to more than one person at the same time.” He steps closer to Spock and puts an arm around his shoulders. “As I am already married to Commander Spock here, I cannot, in good conscience accept.”\nHe feels Spock go rigid beside him and turn to stare at him at point blank range. Jim swallows hard and doesn’t dare look at him. The bridge goes somehow more quiet at this pronouncement, a distinctive flavor of shock coloring the silence.\n“I see,” the governess says slowly, not looking happy about it, but her frown is disappearing, so Jim has obviously struck the right chord. “If that is the case, we will await your offer of a substitution.”\n“Of course.” Jim nods eagerly. “I will talk to my superiors and contact you shortly.”\n“Don’t take too long, Captain. Any further delay will be considered a sign of disrespect.” With that parting shot, she signs off.\nThe moment the screen goes dark, Spock steps away from him and turns toward him fully, glaring.\nJim throws his hands up. “Look, I’m sorry! I had to get out of it somehow.”\n“And this simply happened to be the first idea that came to your mind?” Spock asks acidly. \n“Yes – well, she surprised me! I guess I could have told her I’m sworn to celibacy for religious reasons or have an embarrassing disease or something—”\n“A mental affliction would have been a more fitting choice,” Spock supplies.\n“—but I had virtually no time to think, and you were standing right there!” Jim finishes, generously ignoring Spock’s comment. “I’m sorry if I made you uncomfortable.”\n“Uncomfortable? Not at all. Why would I be uncomfortable with lying, Captain?”\nJim frowns. “Okay, I get it, you’re pissed, but you need to get over it. It’s not like this is the first time you had to deceive someone in the line of duty, so really, Spock, get off your high horse. Sometimes my solutions will be illogical. Yes, I know, probably most of the time, put that eyebrow down. If I remember correctly, you volunteered to serve with me, so you’ll have to deal.”\nSpock’s expression closes off completely as he comes to attention. The bridge feels chilly all of a sudden.\n“Indeed, sir. If there is nothing else, I request permission to leave the bridge, Captain. My presence is required in Science Lab 9.”\nJim glares at him some more before nodding. “Go ahead.”\n“Sir.” Spock marches off, utterly correct and stiff as a statue.\nOnly when the turbolift doors close behind him, does Jim exhale. Abruptly remembering there’s a bridge full of people around him, he catches Sulu’s eye. \n“It was that bad, huh?”\n“Unorthodox, but inspired, Captain.” The helmsman grins at him. \n“Yeah?” Jim drawls, rubbing the back of his neck. “Then why do I get the feeling I’ll be sleeping on the couch tonight?” he mutters, looking after Spock.\nThere’s a sound very much like a giggle coming from the navigation station, and Jim whirls on Chekov.\n“Are you laughing at your commanding officer, Mr. Chekov?”\nThe ensign straightens instantly, caught off guard. “No, sir!”\n“Good, because I’ve been thinking who to assign to the next sanitation rotation all morning. The maintenance crew is always understaffed.”\nChekov goes pale and busies himself with his console. Jim smothers a grin and crosses over to his chair. Uhura is glaring at him, not that he had any doubt she would, but she also looks concerned when she sneaks a few glances in the direction Spock has departed. Jim wonders what that is about, but doesn’t think she’ll tell him if he asks her now. \nIt doesn’t quite end there. The Velerians insist on entertaining their guests while they’re all waiting for Starfleet to send them a new envoy. Which means that Jim has to order Spock to the transporter room and down to the planet along with the rest of his senior officers.\nSpock complies with no comment on the matter. Jim is a little nervous that Spock’s attitude will inadvertently give them away, but it turns out he needn’t have worried. \nDown on the planet, all through the tour and the banquet that follows, Spock accompanies Jim dutifully. They don’t hold hands or anything like that, but Spock keeps closer to him than he normally would and very occasionally calls him by his name instead of his title when the conversation drifts to subjects outside the official negotiations – an almost natural time for a ‘slip’ in formality. He enquires after the composition of dishes served, explaining politely that Jim has many allergies. In short, he creates every impression of a somewhat reserved – as befits his species – but completely sincere spouse.\nJim of course is a nervous wreck throughout, waiting for the other shoe to drop.\nThe moment they are beamed back to the ship, Spock turns off his amicable routine like a light. His tone is freezing cold as he excuses himself to finish the mission report and he doesn’t actually wait for Jim to dismiss him before leaving. For the next two weeks, he invariably declines every invitation Jim extends toward him, whether it’s to complete their paperwork together, visit the ship’s pool, join Jim for lunch, or play a game of chess. \nJim has almost lost all hope of ever regaining lost ground in his relationship with his first officer, when Spock shows up in his quarters late into the Gamma shift one night.\n“I hope I am not disturbing you, Captain,” he says when Jim opens the door. “I am aware that the hour is late, but I have hoped to speak with you.”\n“I always have time for you, Mr. Spock,” Jim says honestly, stepping aside. “Come on in.”\nTrue to his nature, Spock doesn’t waste any time beating around the bush. Coming to a species of parade-rest in the middle of Jim’s quarters, he says, “Captain, I wish to apologize for my behavior of these past two weeks. I am aware that this newfound tension between us is largely my doing, and I have found the situation quite intolerable.”\n“Oh, good,” Jim sighs. “It wasn’t just me then.”\n“Negative.”\n“Would you care to sit down?”\nSpock looks reluctant, but acquiesces, folding himself neatly into Jim’s guest chair. \n“My reaction was perhaps not unwarranted, but my persistence in it quite illogical,” Spock continues. He looks up at Jim almost hesitantly. “I wish to explain.”\nJim splays his hands. “You don’t have to. As you said, I deserved it. But if you want to talk about it…”\n“Our working relationship is valuable to me,” Spock states in his usual straightforward manner that never fails to give Jim heart palpitations. “I wish to clarify the situation so that it would not suffer.”\nClearing his throat, Jim admits, “It’s valuable to me as well, Mr. Spock. I’m sorry if I have upset the balance.”\n“The fault is not yours, Captain. Your solution was unquestionably unorthodox, but I have been familiar with your particular brand of problem-solving since our first mission together.”\nAt that, Jim grins and translates, “In other words, I’m an insensitive asshole who takes everything lightly, but you’ve met me, so it shouldn’t have ruffled your feathers quite that much.”\nSpock lifts an eyebrow, a hint of amusement in his dark eyes. “Essentially correct.” The glimmer of mirth fades. “I was initially disconcerted by the ruse you had suggested because humans and Vulcans view the institution of marriage very differently. For humans, it is quite within the norm to have multiple marriages throughout their lives as well as a great number of extramarital relationships. Even if a certain individual would choose to never enter matrimony, it would still be within the cultural tradition. Vulcans, on the other hand, generally mate for life. The only acceptable reason for creating another marital bond is the death of the spouse. Dissolutions for other reasons are extremely rare.” He pauses, studying Jim’s expression. “I do not point that out as a demonstration of the moral superiority of my species, Captain. Such judgment would be illogical. I merely say that this is one of the cultural differences between us.”\nJim smiles softly. “I get it, don’t worry. Carry on.”\n“In Vulcan society,” Spock continues, “a marital bond serves a very distinctive purpose. It facilitates the fulfillment of a biological imperative. The social function comes secondary. This is why an unbonded adult Vulcan, unless he is a Kolihnaru master, is more than an aberration – it is an impossibility, an error that requires correction. It is not a matter of personal choice, but rather of a person’s fitness to survive. This is why all Vulcan children are bonded at the age of seven. We do not leave anything to chance.”\nJim blinks. “Does this mean that you—”\n“I was no exception, yes, Captain.”\n“No way, you had a wife?”\nSpock’s face registers professional irritation of a linguist who’s dissatisfied with an inadequate translation. “There is no equivalent in Standard. The bonding we undergo in childhood connects us in a way that is less than a marriage, but more than a betrothal.”\n“Wait, what about Uhura?”\n“Vulcan society evolves as any other would. During the last two centuries, it has slowly become acceptable for a bonded pair to pursue different partners, should they so desire, until the moment their – betrothal – is formalized and their bonding consummated. My relationship with Lieutenant Uhura developed spontaneously, but we were both aware of its transient nature. Lieutenant Uhura is well-versed in the aspects of Vulcan culture. She had also agreed with me that our professional relationship must take precedence which is why we had terminated our romantic involvement when I joined the Enterprise as your first officer.”\n“Wow,” Jim mutters, slightly overwhelmed. “I feel like I’m seeing a whole other side of you. Wait a minute, did you say you were no exception? As in you’re not anymore? Did she die on Vulcan?”\nSpock’s face closes off some more. “Many bonds were indeed destroyed by the destruction of my home planet, which is another reason I did not appreciate your levity in this matter. It had put all surviving Vulcans at risk until new bonds could be established. For that reason, our species remains in danger even though we are no longer under attack.”\nAnd if Jim didn’t feel bad enough before, he definitely feels like an asshole now.\n“My betrothed T’Pring, however, survived the death of Vulcan,” Spock says in a tone that is so tightly controlled that it’s painful to hear. “Some time ago, she had reached out to me and informed me that she no longer wished to become my wife. She asked the elders to dissolve our bond and they had approved it.”\n“What? Why?”\n“She cited my genetic makeup as her main reason. I am half-human, and it would be illogical to bond with me while Vulcans remain an endangered species. The elders accepted her logic.”\n“But you don’t?”\n“We have never been close, T’Pring and I. During our formative years, I had been aware of her interest in another. When I learned that he, too, had survived the death of Vulcan, I knew to expect T’Pring’s call.”\n“Spock…” Jim has a bad feeling about this. “When did she call exactly?”\nSpock meets his eyes. “Two days before we assumed orbit around Veleri, Captain.”\nJim closes his eyes. Fuck. He’s an insensitive asshole, he’s always been an insensitive asshole, but damn, his timing takes the cake on this one.\n“I am so sorry.”\nSpock makes an abortive gesture with his hand. “You did not know of this. It is my own inability to process the experience in a logical fashion that had let to my – dissatisfaction – with your actions. For that, I do apologize.”\n“No, don’t even.” Jim shakes his head. “You had every reason in the universe to be pissed, Mr. Spock. I’m sorry my timing sucks. And for what it’s worth, I think your former fiancée is an idiot.”\nSpock lifts an eyebrow. “I understand that the human tradition of friendship requires you to say that, but I assure you, it is unnecessary.”\n“Oh, to hell with traditions.” Jim rolls his eyes. “Do you know why I put you on the spot like that? It wasn’t because you were standing next to me. I could have dragged Uhura front and center or, hell, even Chekov, though that’s disturbing in more ways than one. I picked you because I needed someone who would back me up without question even if they didn’t get it or disagreed with me. I knew I could rely on you to be, well, you, no matter what. Anyone who’s willing to give up that kind of loyalty from someone of your ability is, well, less than bright, shall we say. I don't know who that other guy is, but, unless she's marrying Surak, she's trading down.”\nSpock contemplates this for a few moments. The silence lingers, and Jim is beginning to fear that he’s been too open and has broken Spock with his emotionalism or something, when Spock says quietly, “I am gratified to learn you feel that way, Captain.”\n“You bet.” Jim nods, relieved. The room feels almost too intense after all the revelations, and he casts around for a safer topic. “It’s been a while since we’ve played a game,” he says, indicating the chess-set. “Fancy a match, Mr. Spock?”\nSpock follows his gaze and stands up. “Perhaps another night, Captain. I have taken enough of your time this evening.”\nJim grins up at him. “It’s yours for the taking, Mr. Spock. Have a good night.”\nSpock nods at him solemnly and takes his leave.\n \n--\n2.\nThe second time is not really Jim’s fault. Well, at the very least, it’s not his idea. It’s just that the Diplomatic Corps had spent three months negotiating with the Aurelians to gain access to the ancient transmitter array that has been flooding the entire sector with mysterious transmissions, interfering with the normal operation of Starfleet communications, and Jim can’t let all that careful work go to waste in less than thirty minutes, because as it turns out there are conditions to be met. The only ones allowed into the sacred cave should be of a certain age, physical strength, intellectual capability, social standing, and yes, marital status.\nThey pass all the preliminary tests easily enough (Spock almost looks bored solving the equations), but then the last condition is revealed, and Jim wants to swear. It’s been three months since Veleri, but it’s not like either of them has forgotten.\nThis time, though, Jim asks Spock’s permission tacitly, before opening his big mouth. Technically, they don’t have to be married to each other, but Jim needs to get inside the damn chamber and he sure as hell isn’t going in without his science officer. This was the whole point of this exercise, after all. He looks at Spock, a question in his eyes. Spock looks none too happy, but gives Jim a subtle nod of assent. The Aurelians seem surprised at this development, but mercifully don’t question it much.\nIt’s worth it though.\n“Captain,” Spock calls out, not looking up from his tricorder. He sounds enthusiastic enough for a Vulcan to indicate he’s excited. “The obelisk will have to be quantum dated, but the runes on the outer structure are similar to those in the Iotian temple. If my estimation is correct, based on the language drift pattern, this device predates them by at least five thousand years.”\n“No way.” Kirk looks at the readings over his shoulder. “Does this mean I’ll have to apologize to that dick Professor Daub for saying that the Seeders theory sucks?”\n“I would not jump to conclusions just yet, however, it is a significant discovery,” Spock replies, engrossed in the data. “And I believe the transmissions we have been intercepting indicate a malfunction in the energy grid.”\n“What energy grid?” Jim asks, staring at five cubic meters of solid rock towering over them.\n“This one,” Spock says as he reaches toward a specific rune and presses hard.\nThe entire structure of the monolith ripples and blinks out, revealing a complex network of holographic displays underneath.\nJim stares. “Warn a guy before you do that, will you?”\nSpock isn’t listening, deftly flicking away the lit up strings of data in some unknown, but undoubtedly logical order, walking further inside the structure, eyes wide and yes, completely fascinated. \n“The signal’s been interfering with our long-range communications,” Jim calls after him. “Don’t forget what we’re here for.”\nSpock doesn’t so much as acknowledge him, but then again, when he’s in this mode, a full-scale Klingon attack wouldn’t be enough to break him out of it. Jim grins to himself and leaves him to it.\nLater, when Spock manages to fix whatever’s been out of whack in the ancient civilization’s legacy – because apparently his hobbies include studying all available materials from five thousand years ago – and Jim half-bullies, half-coaxes him out of the chamber, they are greeted by rather excited-looking Aurelians.\n“We have prepared a commemorative feast for you,” the head of the warrior priests announces, purple eyes shining with obvious pleasure, secondary wings flapping excitedly behind his back.\n“That is not necessary,” Spock starts, probably impatient to get into his favorite lab and drown himself in the data he’d gathered since Jim has evicted him from the source. \nJim steps on his foot none too subtly. “A feast sounds great, High Priest,” he replies, bowing. “We are honored.”\n“Indeed,” Spock replies, only barely wincing as Jim presses down harder.\nJim almost feels bad for him when he sees piles upon piles of charred meat on the huge table, but Spock surveys it stoically and allows some to be placed on his plate, though he doesn’t touch it. Jim surreptitiously eats it when no one is looking so as not to give offence. The wine is excellent, though, and Jim almost forgets that this is work, especially when the younger warriors start demonstration battles. \nHe feels happy and relaxed up until the High Priest announces: “We wish to bestow a token of our respect upon you in honor of your union.”\nJim feels Spock go rigid next to him and thinks, ‘Oh, fuck’.\nIt’s not so bad as it turns out. The Aurelians merely want Jim and Spock to walk away from this with a set of matching tattoos. Even the tattoos themselves aren’t so bad, a simple band around their upper arms no more than a centimeter wide – fine, zero-point-nine centimeters – in an intricate pattern of vines and leaves. There’s some cultural significance to the plant depicted, which Spock tries to explain, something about it having the strongest binding capabilities on the planet, ropes made of it being almost as endurable as steel, as well as some complicated mythology around it. Jim’s eyes glaze a bit through that part, though the High Priest is looking more and more like he’s falling desperately in love with Spock by the minute and is wondering if he could take Jim in some kind of one-on-one combat.\nIt’s downright tasteful, is the point, and Jim for one is excited. Starfleet Uniform Code was clearly written by someone who hated joy in any shape or form, and when Jim had enlisted, they made him remove all his previous tats, since he couldn’t prove that the words EASY RIDER stamped just below his navel held any cultural significance. They won’t be able to make him get rid of this one, he thinks gleefully, since it’s acquired in the line of duty.\nSpock for his part seems less than excited, and Jim sort of gets it when they remove his shirts. It’s kind of a travesty to touch that skin with a needle or anything that could mar it, for that matter, and yeah, he should stop staring, but he’s had a lot of wine, and it’s not like Spock doesn’t know him.\n“Don’t worry,” Jim whispers, leaning over from his own chair just before they’re strapped in. “Bones can remove them no problem.”\nSpock nods tightly and doesn’t reply.\nJim’s excitement sours somewhat when he sees them sterilize the needle over open fire. “Oh, shit,” he mutters, and then his world goes red.\nWhen he knows anything beyond stabbing pain and gritted teeth – he vaguely remembers joking with the young warriors clustered around them throughout the whole thing, but he can’t for the life of him recall a single word he’d said – he’s free from the chair and swaying on his feet next to the fire. His whole arm feels like it’s burning from the inside, the thin bandage soaked with dried blood. Someone presses a flagon of wine into his hand, and Jim drinks greedily. \nSpock is on the other side of the fire, talking to a group of elderly women. The Wisdom Bearers, Jim remembers the title from the mission briefing. His first officer is still decidedly shirtless, the bandage on his right upper arm stained generously with green. Jim wonders dimly how they’d gotten from point A to point B, but then a tight wave of pain makes him swallow a meowl and double over. He straightens up almost at once, but he’s seeing white.\nWith the noise of the disintegrating celebration all around him, Spock couldn’t possibly have heard him, but he turns around all the same, as though alerted by an internal radar. He’s at Jim’s side in an instant.\n“Captain, what is wrong?” he asks urgently, pulling Jim close and holding him up by the elbow.\n“I think,” Jim manages through the panting, “there was something – in that ink – that I’m – allergic to. Oh God,” he groans, as another wave of pain nearly knocks him over. “Spock, I think we need to cut this party short.”\nSpock is on his communicator already, demanding at immediate beam-out, so Jim closes his eyes and leans into him, wondering why he can’t just pass out like a normal human being and get away from the agony.\n“It’s not the ink,” McCoy tells him an hour and a half later when he resurfaces in Medbay, the pain a distant echo. “It’s all the wine you’ve drunken down there, you moron. It contains xelovarvinol, which – surprise! – you’re allergic to. Of course, it wouldn’t have been so bad, if you hadn’t had quite so much of it, but it’s you we’re talking about, so really, why bother.”\n“Spock?” Jim demands, sitting up on the biobed and looking around with newfound alertness. “Is he all right?”\nMcCoy rolls his eyes. “The hobgoblin’s fine, since like a sensible adult he didn’t overindulge. He dumped your sorry ass here, had his arm treated and was gone, though not before half my nurses started a damn fanclub.”\nJim sinks back onto the bed, grinning. “I wondered why he didn’t stick around.”\nMcCoy snorts. “He wanted to, I think, but then one of them pulled out a holocam, thinking she’s being subtle.”\nJim laughs, shaking his head. “This means we’re overdue for another round of that damn sensitivity training, doesn’t it?”\nMcCoy shrugs. “I already yelled at her, but yeah, might be a good idea. Will you attend this time, Captain?”\n“Um, my schedule’s pretty tight.”\n“Maybe you should find the time. Matching tattoos? Really, Jim?”\n“Hey, it wasn’t my fault! Or, you know, idea. Hey!” He clutches at his right arm in sudden alarm. “You didn’t—”\nMcCoy rolls his eyes again. “Yeah, it’s like I just met you and hadn’t lived with you for three years listening to your whining that Starfleet made you get rid of your old ones. Though why anyone would tattoo a vomiting orangutan on their calf is beyond me.”\n“I was sixteen, it seemed funnier at the time. So you didn’t—”\n“I healed it, so you won’t have to go through the shedding and scratching stage, that’s all. Would have been better to leave it to heal naturally, but it’s you we’re talking about, so the chances of you not getting an infection are non-existent.”\n“Harsh, but probably true.” Jim stares at a remarkably clean bandage thoughtfully. “Thanks, Bones. You’re keeping me?”\nMcCoy nods. “Overnight, so don’t try anything.”\n“I won’t,” Jim mumbles, snuggling into the utterly un-snuggable biobed, feeling his eyes drift shut. It’s been a long day, and he doesn’t much care where to conk out. “Thanks.”\nHe can hear the eyeroll this time and a soft mutter of, “Unbelievable.”\n--\nThe tattoo isn’t mentioned much again, except when Pike calls in to talk about his mission report the next day and says, “Well, at least it’s not that ‘how do you like ‘em nuts?’ tramp stamp again.”\nJim narrows his eyes. “Did you read McCoy’s diary for fun or something?”\n“No, I just have vivid memories of picking you up from the bar floor where you were drooling after having the shit kicked out of you. Very nearly left you there and then when I saw that.”\n“I’m not sure, but I think somewhere in that reference, there was definitely some sexual harassment, sir.”\nPike actually smirks at him. “You weren’t enlisted at the time, genius. But speaking of harassment, how’s Spock? Not a fan of the body art, I take it?”\n“Nah, he got rid of his the moment we beamed back. No sense of adventure.”\n“Good for him. And for the love of my sanity, would you stop dragging him into those hairbrained schemes of yours? Not that I don’t enjoy watching Komack develop an aneurism every time he reads one of your reports, but I’m the one who has to present them to the Federation Council Starfleet Oversight Committee, the Enterprise being the test case for long-ranged missions and all. And do you know who’s the vice chairman of that committee, Kirk? Ambassador Sarek of Vulcan.”\nJim stills. “Um.”\n“Oh yes. Every time I have to explain to him in detail how you had to fake-marry his son, he looks at me like he thinks going back to the time when Vulcans weren’t pacifists might be a good idea.”\n“Look, first of all, Spock was onboard this time. And it’s not my fault that every new space race we meet has a grudge against single people. Actually, as a single person, I’m offended by that, but I don’t go around telling alien cultures to mind their own business, I just do my damn job. Spock can damn well suck it up and deal. Er.” He pauses. “Maybe don’t tell Sarek I said that.”\n“Oh no, I’ll quote you directly,” Pike promises in a tone that suggests he would do exactly that, the asshole. “Until next time, Captain Kirk.”\nThe truth is though that the tattoo is indeed tame enough to pass below the radar. No one onboard mentions it if they happen to catch a glimpse or even pay it any attention. It helps that, with McCoy’s healing, it looks well-set and like it’s always been there. Jim grins every time he catches sight of it in the shower, but it becomes absent-minded, habitual. He’s actually surprised when Spock asks about it.\nIt’s been three weeks since that particular mission, and they’re sparring at the gym. Jim loves sparring with Spock. For one thing, Starfleet regulation workout clothes are too cold for him – and isn’t that a thought as to how he survived at the Academy – so he wears the Vulcan version. It’s black and it’s the only vaguely calming thing about it. \nIt’s hardly a secret that whoever designed Starfleet uniforms for all purposes, except perhaps for the EVA suits, believed that a healthy degree of sexual appreciation is good for the working environment. That person, however, had nothing on Vulcans. \nEither their uniforms – and clothes, for that matter – are designed to test each other’s abilities for controlling basic urges or they’re just above acknowledging any such thing. Jim’s money is on the first theory, since the older a Vulcan gets, the less form-fitting his attire becomes. You can practically tell the decade of birth by the number of layers, just as their social standing can be divined by ones who know by the scale and length of the script embroidered somewhere near the collar. It’s hard with those who wear official marks of office – that lettering gets brighter and bigger the more important the post. But clan markings are another story. The string of characters on Spock’s clothes is miniscule and no more than three symbols in length, which pretty much says social strata: highest possible. \nYounger Vulcans are all about form-fitting and aesthetics, apparently. Jim had been onboard a Vulcan science vessel once during his Academy training. He spent most of his time there feeling half-terrified half-aroused and can sort of see why Vulcans en masse believe humans to be undisciplined, sex-obsessed savages. \nThat’s not the main reason Jim loves working out with Spock, though. Spock always holds back. Jim had seen him running drills with security and teaching the basics of Suus Mahna to the science staff. He controls every motion so completely that for a natural fighter like Jim it’s a bit painful to watch. He was the same way with Jim when they had first started sparring, and Jim had made it his mission to make him let go. \nIt worked on many levels. Faced with superior strength and speed, Jim had to become twice as unpredictable and creative, not to mention push himself harder than ever, in order to shake Spock loose, but eventually he’d succeeded. It had taken a year for Spock to only start holding back as much as he would during a training match with a Vulcan. Jim counts that as a personal victory even if he has to go to Medbay immediately after more often than not. \nHe’s definitely going today, he thinks, as Spock throws him to the mat and pins his arms above his head in a way that makes something go drastically out of place inside and Jim’s vision whites out for a moment. When he blinks himself aware, Spock is looking to the point where Jim’s t-shirt sleeve has ridden up, revealing the tattoo.\n“Fascinating,” Spock says, not even slightly out of breath, because he’s a dick like that. “You did not have it removed?”\n“Nah.” Jim grins. “They were a warrior culture and they accepted me as one of their own. That’s like every Earth boy’s childhood dream coming true, Spock. I wanted to keep the memento, since Starfleet definitely can’t make me get rid of this one.”\nSpock gives him a curious look and lets him up, stepping back. Jim lingers, not certain his arms are even attached to his body anymore. There’s also a not so good sensation coming from his ribs. Not wanting to admit he might need help, he stalls by glancing up Spock’s arms, covered to the wrists, of course. \n“Bet Vulcans think body art is illogical.”\n“Not illogical,” Spock replies in a tone of mild exasperation as he comes to help Jim sit up anyway. “Merely archaic.”\n“A personal choice then. Well, I guess you didn’t feel like being even more of an oddity to your peers.”\nSpock’s face shutters instantly as he pulls back. For a moment, he looks as though he’s considering saying something, but then his expression smoothens out once more.\n“No matter our current stage of development, Vulcans are a warrior race,” he says after a beat in his detached professor mode. “I do not need to be reminded of this by means of a souvenir.”\nJim nods a little sadly. “No, I suppose, you don’t.” He flashes Spock a grin, extending a hand. The motion makes him wince. “Ow. Care to escort me to Medbay, Mr. Spock? I feel like you’ve dismantled me piece by piece, only fair you’ll help put me back together.”\nSpock acquiesces, but his eyes are distant, his touch clinical. Jim wonders if it’s him and his big mouth or something else entirely – there’s no telling with Spock, ever – but then Bones is yelling at him for being a clumsy oaf, which, unfair, and it goes straight out of his mind.\n \n--\n3. \nJim doesn’t know the next time is the next time until he’s neck-deep in it. Although how he didn’t suspect something the moment Pike’s face appeared on the viewscreen in the middle of Alpha shift, he couldn’t say.\nApparently, something fishy is going on with a few Federation colonies in the Barradus Belt: important equipment suddenly malfunctions or is misplaced, shipments of precious cargo are mistakenly redirected and then lost, personnel are rotated unexpectedly with some key specialists being inexplicably dismissed. Any one of those would have been disregarded as an aberration or common mishaps that happen in all not-so-long-ago established colonies, but the sheer concentration of them within the past six months raised a red flag. The colonies officials are being cagey in their reports, and it’s clear that something’s going on there, but nobody’s talking. \nStarfleet feels that showing up at Barradus in force would only send them further into hiding. Instead, two officers would be sent there incognito to figure out what the hell’s going on there on the ground. It is just a matter of a happy coincidence then that the Enterprise happens to be the closest ship, and its captain has an up-to-this-point questionable but now suddenly incredibly convenient experience dealing with shady characters of all sorts. \n“You’re not going alone,” Pike tells him, when Jim’s shit-eating grin threatens to split his face.\nHe doesn’t say it with any particular inflection, but it brings Jim up short. He swivels back in his chair. “Uhura! Bet you’re dying to lend your sensitive ear to some backwater dialects?”\n“Not so much,” she replies, the corner of her mouth twitching. “I have you right here, don’t I?”\nShe’s so fired, Jim thinks, and jumps out of his chair to grin maniacally at his navigator. “Chekov! You’re dying to go undercover, aren’t you?”\n“Well, sir, actually—”\n“Right, you look like you’re twelve anyway. Sulu! Sulu, time to be badass again. I’ll let you bring your sword along and everything. Actually, come to think of it, maybe don’t, I still remember that bar on Vega III, and if you’re going to be banned from any more systems, we might as well plot a course for the Beta Quadrant right now. So yeah, just leave the sword, and—”\n“Spock,” Pike calls over Kirk’s head.\nSpock, the traitor, is already stepping down from his station. “Admiral?”\n“Do you know any secret Vulcan techniques to stop verbal diarrhea in humans without knocking them out so they could still listen?”\nSpock looks like this is a new and exciting possibility he hasn’t considered before. “Unfortunately, no, but I shall investigate.”\n“Please do. Kirk, stop with the headless chicken act and focus. It’s a two-man job and you’re going with Spock. No, I don’t want to hear it. I’m sending all the pertinent information to your comm spec, and we’re giving you a ride. You’ll rendezvous with the Kurosawa in six hours, they’ll have it ready for you. You should be ready to depart by then. Instruct Mr. Scott to proceed to Deep Space Three for that impulse engine upgrade he’s been bugging you about. He’s got approval.”\n“He’ll be happy to hear that,” Jim says, resigned.\n“Mission brief received, Captain,” Uhura calls out from behind.\n“Thank you, Lieutenant.”\n“Kirk, Spock.” Pike leans forward, all traces of mirth erased. “Whatever’s going on there, we need to know, and that only happens if you report back. Understood?”\n“Yes, sir,” they reply in unison.\n“Good. I’m counting on you. Pike out.”\n“Well, Mr. Spock.” Jim turns to look at him. “Looks like you’re with me.”\nSpock doesn’t reply just then, barring a slight nod of acknowledgement. But when the turbolift doors shut behind them, he turns to face Jim.\n“Captain, if you truly hold reservations about me accompanying you on this mission, I am certain you need only make them clear to Admiral Pike. If my performance has been in any way unsatisfactory—”\n“Oh my God, shut up.” Jim presses his fingers to the bridge of his nose. “If your performance is suddenly short of exemplary, ever, it means the apocalypse can’t be far behind.”\nSpock digests this. For once, he doesn’t question the illogical means of expression. Instead, he says quietly, “Then it is my company that you find objectionable.”\nJim drops his hand to stare at him. “No,” he says firmly. “Never. It’s just” – he looks away, trying to articulate –“there’s something about this mission. I have a – a feeling or something. Completely illogical, I know.” He smiles as he catches sight of Spock’s expression. “I’ll try to rein it in for the duration, I promise.”\n“I shall be delighted, Captain.”\nStarfleet has gone as far as to create actual undercover identities for them. Jim turns into one Merlin Monroe – the ID makes him scowl and vow retribution on Pike and his clearly juvenile sense of humor – officially a dealer in kevas and trillium, and unofficially a mercenary picking up odd jobs as he goes along, not always on the right side of legal, but in no serious trouble with the law. He grins as it gives him a perfect excuse to dig out his jeans and leather jacket. Seeing his own reflection is strange, he feels oddly disconnected, crawling back into the skin he had shed some time ago. But it still fits, and the mannerisms come back of their own volition, like a build-in accessory.\nSpock becomes Selek, a Vulcan astronavigator and computer tech who had left Vulcan a long time ago because of some ‘irreconcilable differences’ with his family and thus had survived Nero’s attack. Monroe apparently hires him for a specific job a while back and then decides to keep as a partner.\nWhen Spock walks into the transporter room, Jim feels a little dizzy. He’s wearing civvies as well in muted dark colors – charcoal grey pants and – what the hell? ankle boots? – dark blue tunic, and dark brown jacket made of some sort of eco-leather, of course, never the real thing for Spock, even though it’s all replicated these days. Even his hair is purposefully mussed, giving him a windswept, slightly rebellious look. He looks like he just rolled out of the backroom of some very classy yet very wanton nightclub. He meets Jim’s eyes and lifts an eyebrow in silent inquiry.\nJim swallows. “Looking good, Mr. Spock,” he says, looking anywhere but at him. “Very convincing.”\nThis. This is exactly why he didn’t want Spock on this mission. Or rather this is how it starts, because Jim’s sure with his luck there’s worse to come.\nFor a while, though, it goes on without a hitch. There is a small space station in the middle of the Barradus system that serves as a neutral territory, a hub for trade negotiations, a space dock, and a meeting point. Spock logically suggests they start their investigation there, and Jim agrees. Once docked, Spock ostensibly goes in search for supplies and Jim hits the bar scene, talking loudly about his supposed exploits in uncharted space. He hits on the patrons five times, is hit on by the patrons eleven times, gets into a bar fight twice, and is thrown out once before the point gets across and his reputation is established.\nWhen contact finally happens though, it’s not him they approach, but Spock, who’s been quietly collecting information in the background (hauls Jim back to the ship after a night of well-staged debauchery four times, administers hyposprays five times, uses the dermal regenerator McCoy had left because ‘I know you, Jim, goddammit’ once). \n“We have a meeting tonight,” Spock informs him, and Jim sags in relief. \n“Thank God. I don’t think I could have kept this up much longer.”\n“You appeared to be quite in your element. I was impressed.”\nJim gives him the evil eye. “Shut up.” He knows he will change his mind at some point, but right now he feels that if he never sees another glass of Saurian brandy again it’ll be too soon. \nBy that point, with everything they’ve learnt, Jim sort of expects to see someone from the colonies’ administration. What he doesn’t expect is to see all of them – two governors, three administrators, and one reverend from all the affected worlds – to gather in an abandoned cargo bay. Judging by Spock’s utter lack of expression, he’s as stunned as Jim is.\nIt turns out to be simultaneously simpler and more complicated than Jim thought. Every discrepancy Starfleet had noticed was due to the fact that the leaders of the colonies weren’t very clever about covering up the fact that they’ve been redirecting certain valuable equipment and cargo to the Orion Syndicate. Every colony leader present has a member of their family kidnapped and held hostage, and their continuous survival depends solely on the obedience of their powerful relations. \n“That’s fucked up,” Jim says, once it’s all out there in the open. “How long has this been going on?”\n“For the past six months,” Administrator Voronin admits reluctantly. “You have to understand. We didn’t want to do this, but our hands are tied.”\n“Why did you not contact Starfleet?” Spock asks. “Surely, they would have agreed to intervene—”\nThe leaders exchange grim looks. \n“We did, the first time around,” Governor Pani says. “About a year ago when my granddaughter was kidnapped. I called Starfleet immediately, and they came. They rescued Laura, and for a while we thought that was the end of it. But then two months later, there was a – a malfunction in the atmospheric controls in her room.” His voice breaks audibly. “She suffocated. It was ruled an accident, but a man came to see me directly after. He said, ‘That’s what happens when you call in the Feds’.”\n“Ouch,” Jim says, because his assumed persona is vapid and completely devoid of tact, and it takes an effort not to glance at Spock. “Look, I’m not that big a fan of Starfleet myself, obviously,” he says, letting his sarcasm show, “but they at least have really big guns. Not that we’re not flattered you came to us, but this is a really small operation. All I have is an old cargo ship. What makes you think I can do anything if the Feds can’t?”\n“It’s not a question of force,” Pani bristles. “We have the muscle. We combined our security teams into a special task force, and we have ships.”\n“Yes, but to take on the Orion Syndicate—”\n“Orion is pretty far from here, Mr. Monroe,” Administrator Kiara interjects. “And we happen to know that their operations are autonomous. If we eliminate this – branch, I suppose, is the word, that’ll be the end of it.”\n“Then again, what do you need us for?”\n“We don’t know where they’re keeping the hostages,” Pani explains. “And we can’t send anyone in to find out. They won’t let the women near, and the men – I’m sure you’ve heard of the Orion females and their pheromones. It’s no exaggeration, Monroe, let me tell you. Men go completely stupid, will tell them anything, do anything. We can’t risk it. If we tip them off, our families are as good as dead.”\n“You’re right, we’d never turn to a mercenary,” Kiara says frankly, looking at him with a distinctly unimpressed expression, “if you didn’t have a Vulcan for a partner.”\nJim stills. It must be premonition or something, but at that moment he already knows that when she says ‘partner’ she means anything but the professional.\nHer counterpart from another colony whispers something to her, and Kiara nods. “Forgive me, I’m not well-versed in the terminology. I meant bondmate.”\nJim does chance a look at Spock then. Spock seems utterly inscrutable, but he’s studying the elderly woman with dangerous intensity. \nThey’ve been paying attention all right, Jim thinks ruefully. But not to his spectacles in the bar. He hit on people, but he never left with them. He left half draped over Spock, because even anti-intoxication hypos will only get one so far, and they had to fit a certain profile. And on the nights he left alone, he excused himself on the grounds that his partner was waiting for him. Jim nearly groans realizing abruptly that it was his doing and that Spock is going to kill him when he figures it out.\n“Oh, who cares what it’s called,” Pani dismisses impatiently. “Point is, Vulcans are immune to Orion pheromones, and through your lover – partner, whatever, you’re immune as well. You can get close to them and pretend to be affected. All we need is the location.”\nIt’s actually not a bad plan, Jim has to admit with chagrin. He remembers his Xenobiology 101, and the colony leader is right on both accounts. If Jim really was married to Spock for once, instead of somehow stumbling into the role-playing yet again, they could have pulled it off. As it is… Is Spock asleep over there, Jim wonders. If ever there was a time to come up with a bit of bullshit Vulcan lore that would explain why it won’t work, it would be now.\n“And then what?” Jim asks, temporizing. “Your task force goes in, guns blazing? Have much experience extracting hostages without getting them killed, do they?”\n“Not really.” Kiara shakes her head. “But that seems to be your specialty, Mr. Monroe, if what we heard about you is right.”\n“Look, lady,” Jim starts, having no idea where he’s going. “I won my fair share of cat-and-mouse games, I’ll grant you that. But going against the Orion Syndicate—”\n“We would pay anything,” Voronin steps in, thinking Jim is just haggling over price. “I’ll give you a warp-grade dilithium crystal for every hair on my niece’s head.”\n“That’s – very generous,” Jim says, floundering, “I’m just not sure—”\n“We accept,” Spock says calmly.\nIt’s so unexpected that Jim nearly gives himself whiplash turning to stare at him. “We do?”\n“Indeed,” Spock confirms, eyes on the colonists. “On the condition that your task force will be placed under our command.”\n“You have it, Mr. Selek,” Voronin says instantly, and the others nod. “We’re risking much here, trusting you. But we’re desperate.”\n“I would like to confer with my partner now,” Spock says as though commenting on the weather. “We will contact you shortly to discuss the details. If you will excuse us.”\nThe moment they step out into the corridor, Jim grabs his shoulder. “Are you out of your Vulcan mind? We can’t possibly—”\nSpock shrugs off his touch easily. “Not here,” is all he says.\nHe’s right, but it still leaves Jim fuming. He barely contains himself until they reach the sanctuary of their ship. Spock makes him wait until he runs a complete security check and only then looks at him. \n“I apologize for interrupting you, Captain, but I believe you were about to refuse them, and I could not allow that to happen. True, they have not acted through proper channels, but their logic is understandable if flawed. We cannot let the situation continue.”\n“I agree, but we can’t do it the way they want us to, Spock,” Jim snaps, utterly disgruntled. “In case it skipped your attention, we’re not really bonded, which means I’m not immune, which means, newsflash: we can’t do it!”\n“I believe there is a way,” Spock says calmly. “I would not have accepted the deal if I did not have a solution in mind, Captain.” The reproachful ‘You should know me better than that’ remains unspoken. \n “Fair enough.” Jim narrows his eyes at him. “I’m listening.”\nSpock almost looks – uncomfortable. “It is – somewhat irregular,” he admits. “Perhaps I did speak too rashly. But if you trust me—”\n“Spock,” Jim interrupts. “In all the time that we’ve known each other, when have I ever so much as hinted that I don’t trust you?”\n“The solution I propose requires a somewhat deeper degree of trust as it is of a rather personal nature.” Spock definitely looks shifty now.\nJim has an epiphany. “It’s a mind-meld, isn’t it?”\n“As part of it, yes. If you will allow this, I can create a shallow link between our minds.”\n“Like a bond?”\n“No, nothing at all like a bond. This link would be superficial. It will not allow us access to each other’s deeper thoughts and memories.”\n“Wait, if it’s that shallow, will it be able to shield me from the effect of the pheromones?”\n“Ordinarily, it wouldn’t. However, I have noted a higher than average affinity existing between our minds. I am convinced that this link would indeed prove sufficient to protect you from any undue influence.”\n“How do you know that we have this ‘higher than average affinity’?”\nSpock’s lips twitch. “For now, it is sufficient that I do know. I believe you stated that you trust me?”\n“Low blow,” Jim mutters. Spock merely lifts an eyebrow and looks perfectly content to say nothing at all in the foreseeable future. Jim rolls his eyes. “Fine. If you’re certain it’ll work, let’s do this. But if my crazy brain screws up with your synapses or something, remember that this was your idea.”\nEither it’s Jim’s imagination, or Spock really does sigh softly. “I am unlikely to forget.”\nThey come to face each other, and Jim feels a moment of trepidation. But Spock’s touch is confident yet not forcefull, his breath a soothing gust against Jim’s skin, as he says the ritual words, “My mind to your mind, my thoughts to your thoughts.”\nFor a moment, Jim feels nothing. Then, all of a sudden he’s not alone. It’s nothing concrete, no thoughts, no feelings, just a presence. He feels like his skull is too tight, it’s too crowded in there, but before he can panic, the pressure eases and withdraws. Suddenly it feels too empty, as though additional space has been created and there’s not enough of Jim to fill it all. He’s alone, except there’s a small – spark? It’s an odd sensation, like a split lip. If he worries it with his tongue, he can feel it, but if he doesn’t it’s like it’s not really there.\nJim opens his eyes to find Spock standing at least two meters away from him, watching. “It’s done then?” Jim asks, bewildered.\n“Affirmative.”\n“But I don’t feel anything,” he says, pressing on the bundle of something inside just to make sure. “I mean, I don’t feel any different. At all. Are you sure this is enough to make me immune to Orion females?”\nSpock looks distinctly uninterested in Jim’s panic attack and abandons him in favor of activating his terminal. \n“I do not believe there is anything in the known universe that would make you immune to females, Orion or otherwise,” he says in his driest tone. “But yes, Captain, insofar as their pheromones are concerned, I am reasonably sure.”\nJim huffs in indignation, but as invitations to stop fretting go, this one is pretty straightforward, so he leaves it be and hopes Spock isn’t being an arrogant bastard and actually knows what he’s talking about.\nAs it turns out, he does. \nThe bar that the Orion crew frequents – and Jim can’t decide if he loves it or hates it that the better part of this mission is conducted in a drinking hole of some sort – only lets him in on sufferance, but a foot in the door is all Jim needs anyway. It’s not that he’s unfamiliar with Orion women. But Gaila was taking pheromone suppressants as part of her oath to Starfleet and was, in fact, trying to behave herself. The three ladies that zero in on him as he enters have no such compunctions.\nThey laugh, and drink, and talk with their hands and bodies as well as their mouths, and it’s an interesting sensation to be able to appreciate their sensuous, overwhelming and raw sexuality without being, well, overwhelmed by it. Jim only realizes he should long have been acting mad with lust when they start exchanging puzzled looks over his head. Acting like he’s drugged on them isn’t a hardship, but inwardly he can’t help but crow in delight.\nIt goes as planned in that they tag-team him to their ship. Then it promptly goes to hell when they knock him out cold as the ship goes to warp. \n“Lock him up with the others,” is the first thing Jim hears as he comes to, swallowing curses as a splitting headache hits. It recedes almost instantly though and he blinks, surprised, but continues to act groggy. \n“Too bad,” one of the females tells him as she lifts up Jim’s face. He gives her a stupid grin. “This could have been fun, handsome.”\nTwo security guards hold him up – and why do Orion males have to be so tall and bulky, Jim thinks resentfully – as he’s beamed down to the surface… of what? Jim squints at the orange sun, setting low at the horizon. He’s still in the Barradus Belt then, definitely, but which planet? He twists his head, groaning, in a would-be attempt to alleviate the pain in his neck and takes stock. Two moons, one decidedly closer than the other. His mind automatically calculates the angles in relation to the sun, and Jim grits his teeth, wishing he could transmit the information to Spock somehow. \nIt gets even worse when they drag him inside what looks like an abandoned mine, transformed into an honest to God pirates’ bay. The lower layer had been converted into a prison block – or perhaps animal stalls would be a better descriptor. From his cell, Jim can see at least half the others quite clearly, and he’s pretty certain that the bunch of frightened women and kids are the very hostages he’s been looking for. \nFrom what he could see while being rudely dragged through the entire facility, it hardly has half a dozen guards on duty. It makes sense, since the main advantage is the secrecy of the location. It’s not, he thinks ruefully, that he’s failed to gain access to that information, since technically he’s right on top of it. That he can’t do anything about it or report is another matter. Maybe if one of the women came for him or a guard brought him food, he could… He’ll have to wait and see.\nThat the wait only lasts two hours is strange, but what happens next is definitely stranger. The lights go out and the door of the cell swings open. Jim stares. Correction, all the cell doors are open, if the rising wave of confused voices is any indication. An energy blackout is the best way to initiate a computer override…\nJim springs to his feet and pitches his voice to carry. “Everyone, this is a rescue operation. Kindly come out of your cells, gather behind me, and keep quiet.”\n“Who the hell are you?” a young woman asks, frowning, half-hopeful, half-wary as she steps out into the corridor in the low glow of emergency lights.\nThere’s a definite family resemblance there, and Jim smiles at her. “Ms. Kiara junior, I presume? Your grandmother sends her regards. Now come out of there and get these people in order.”\nThe guards meet them in the outer corridor, screaming and frantic, aiming to intimidate apparently more than physically subdue. There’re only two of them, armed with hand weapons, and Jim hasn’t been training with Spock all this time for the hell of it. He’s way too fast for them, especially charged on adrenaline, and has them groaning on the floor before any of the kids can get a good look. Although, judging by the way a small girl kicks one in the shin as she passes, he needn’t have worried.\nThey spill into the main chamber on the upper level to find another guard howling in pain, apparently electrocuted by a short-circuit in a console. That one has a disruptor on his belt, which Jim immediately grabs and fires, keeping himself firmly between the remaining guards and the hostages. \nHe needs to get them out in the open and in a tight group. Where the instructions have come from, he doesn’t know, but there’s no hesitation in him. \n“Come on, come on, come on!” he yells, motioning them out one by one, as he keeps the Orions occupied. “Get out there and stay together! Keep your heads down!”\nNow would be an incredibly good time, Jim thinks, as the last hostage, a teenage boy, runs past him, covering his head with his arms. Jim aims his disruptor upward and fires at the ceiling, making the rock explode over the guards’ heads. Horrified screams are cut short almost instantly by the sound of the massive cave-in. Jim barely avoids being hit as he runs out, thinking, Now, now, now.\nThe transporter beam catches him just as he reaches the hostages and a moment later Jim is looking at the familiar surroundings of the cargo ship and Spock operating the controls.\nJim beams at him. “How on Earth did you find me?”\n“Later.” Spock shakes his head, looking grim. “Is everyone accounted for?”\nJim glances back over his shoulder. “That’s everyone they were holding down there. Spock, what’s wrong?”\n“The Orion ship that had delivered you here is on its way back as we speak,” Spock reports. “I have informed the task force of our location. However, if we do not make it to the rendezvous coordinates in time—”\nJim nods, his elation fading. Starfleet upgraded the sensors and computer systems on the cargo ship, but not the weapons.\n“Go,” he tells Spock. “I’ll get these guys settled and join you on the bridge shortly.”\nFor a thirty-something blissful minutes it looks like they’re going to make it. Then, the Orions are upon them. \n“Spock, give me helm control and take over weapons!” Jim yells over the sound of the ship being hit by disruptor fire. “Also hold on!”\nThey dodge and shoot, and dodge and shoot again. Jim’s pretty sure his Academy piloting instructors would have grounded him for good if they saw the way he’s handling the puny cargo ship, but he thinks Sulu might have liked it. He doesn’t have the time to transmit the target coordinates to Spock as he goes, but somehow Spock hits them unerringly anyway, which is the only reason they’re still alive if severely banged up when the task force shows up. \nIt’s somehow less satisfying than he thought it would be to see the Syndicate ship turn into a sun-like fireball. Then, Jim remembers the kids in the cargo hold, the heavily pregnant girl of no more than twenty, and the elderly man who could barely stand straight, and yeah, it’s satisfying enough.\n“Thank you for your assistance, Mr. Monroe,” the task force commander says tersely over the viewscreen after they finish beaming over the hostages. “We’ll tractor your ship back to the Barradus station where you can get your payment in full.”\n“Splendid.” Jim salutes him and cuts the connection off. There’s little to do now but relax and enjoy the ride, and he turns to Spock, grinning softly. “Hacking alien security systems via a remote link from orbit, Mr. Spock? I don’t remember that particular course being offered at the Academy.”\n“Is it not sufficient that I have been successful?” Spock asks, clearly not willing to be engaged, as he locks down his station and stands up. “If you would come to Medbay with me, I will see to your injuries.”\nJim tries to read him, but gets nothing. He frowns. “Fine.”\nHe suffers himself to be treated for his cuts and bruises mostly, all the while trying to catch Spock’s eye, but it’s futile. Spock is acting like an extremely good-looking if somewhat passive-aggressive AI.\n“Spock.” Jim rests a hand on his arm. Spock stills. Jim studies him. “You never did explain how you were able to find me. It was the link, wasn’t it? That’s the only explanation. I thought it wasn’t supposed to be that deep?”\nSpock almost sighs as he pulls away from Jim’s touch, but his frame actually softens. “It was not deep. It was as I told you, a superficial connection only. However, it appears I have underestimated the degree of affinity between our minds,” he admits. If Jim didn’t know better, he’d bet his captain’s stripes that Spock sounds rueful.\n“The evidence suggests that when you directed a particular thought at me, I was able to receive the information,” Spock explains. “For instance, when you were beamed down to the planet, you noted the moons and the relative position of the sun. I – heard it, for lack of a better term. From this data, it was possible to calculate which planetoid you were in fact located on.”\n“Okay.” Jim studies his face, still desperate to get Spock to meet his eyes. “Why is this making you upset? Because you are upset, link or no link, I can tell.”\nSpock turns away from him, a full retreat. “I was careless,” he says at long last. “There are strict rules regarding mental contact among my people. I have always accepted them but never understood. I do now.”\n“Spock.” Jim slides off the biobed, resting a hand on Spock’s shoulder. “Just remove the damn thing if it bothers you that much. I mean, I’d love nothing better than to keep it, but—”\nHe’d said the magic words, apparently, because suddenly he has Spock’s complete attention.\n“You would prefer to keep it?” Spock asks, almost openly incredulous. The intensity of his gaze is unnerving.\n“Well.” Jim shrugs, wondering what the hell he’d wandered into now. “You can’t deny that it has come in handy. You were able to find me. We could apparently trade important information back and forth. It was you who told me to get everyone out in the open, wasn’t it?”\n“You were able to perceive that?” Spock’s eyebrows crawl up to his hairline. “I did think it would be preferable for the transporter, but I did not believe you would be able to hear—”\n“Well, I did,” Jim says. “And then when the Orions caught us, you can’t tell me you didn’t feel that. We were moving and firing as one; I’m pretty sure that’s the only thing that saved us. So yeah, I can think of so many away missions where this would have been a life-saver. I’m a captain, I always look for ways to make my crew more efficient.” He grins at Spock.\nSpock stares at him a moment longer, then nods and looks away. “Of course, Captain. It is only logical.”\n“So what do you say?” Jim squeezes his shoulder gently. “Maybe better to leave it be?”\nSpock moves from under his touch with an almost apologetic subtlety. “I am afraid it would not be wise. Had everything been as you describe, it would have been unorthodox, but perhaps acceptable. However, the point remains that this very simple connection has not behaved as it was designed to. The probability is high, therefore, that should we leave it in place, it would develop spontaneously into a connection of a different nature, one that would require the services of a mind healer to dissolve.”\n“And that’s bad,” Jim says, finally beginning to see. “Because he’d tell others, and a link like that isn’t something Vulcans do lightly.”\nSpock meets his eyes. “You are mistaken, Captain. Apart from bonded pairs or family members, Vulcans do not do this at all.”\nJim stares, robbed of breath all of a sudden. “I want to say that you shouldn’t have to compromise who you are to this extent for the sake of the mission. But I can’t argue with the results.”\n“Nor I,” Spock says. “You do see why we cannot keep it, however?”\n“I guess.” Jim nods. “You want to do this now?”\n“The longer it remains in effect—”\n“Right. Go ahead, Mr. Spock. Do it.”\nIt’s strange when Spock touches his face this time. Too comforting, almost too personal for something so technical. Jim feels a sense of sweet vertigo, as though something wonderful is spinning in front of him just out of reach, and if he could only catch it for a moment—\n\nJim. You are resisting. Please desist.\n\nEmbarrassment overwhelms him. He doesn’t want to let the link go, like a child holding on to a favorite toy that someone is trying to take away, and it translates as resistance on the mental plain. \nSorry, he sends back clumsily. I’ll stop.\nSpock doesn’t respond except with a feeling, a soft touch of acceptance and understanding, a dismissal of guilt.\nJim stops struggling to hold on now that he’s aware he’s doing it, and a moment later he blinks his eyes open, alone in his own head. He feels small somehow, like he was holding a world in his grasp and now he’s just a pin on the map, a tiny, entirely separate being.\nSpock is still standing close, his hands cradling Jim’s face in a way that has no logical excuse for it that Jim can think of, eyes searching. \n“I’m fine,” Jim says hoarsely, pushing back, because another moment, and Spock would really have reasons to bring him up on charges. “It’s done then?”\n“Indeed,” Spock says, stepping back as well. “I must begin working on my report to Starfleet, Captain. If you will excuse me.”\n--\nStarfleet, however, is waiting for them at Barradus station, which Jim suspects is also Spock’s doing, in the form of one Captain Moreno of the Columbia. She’s a tiny woman in her late forties, with a mischievous smile and penetrating eyes.\n“I’m giving you a lift back to Deep Space Three, Captain Kirk,” she says cheerily as they meet her on her bridge. “Starfleet is taking over here.”\n“But – we haven’t been paid yet,” Jim protests, grinning.\nMoreno laughs. “I’ve talked to Voronin and told him we have you in custody for some previous transgression. He pleaded your case rather passionately, you know.” Her look turns sly. “Said something about how if you got a Vulcan to bond with you, you can’t be that bad.” She looks them over speculatively, eyes filled with humor. “Forgive me, Captain, Commander. I didn’t realize congratulations were in order.”\nSpock declines to dignify that with a response, but his eyes turn upward for a glorious moment, as though he’s praying for strength. \nJim sputters. “They’re not – we’re not married! Voronin and the rest of them – they came up with that all by themselves!”\n“And yet, the pheromones really had no effect on you, Captain,” Moreno drawls thoughtfully, clearly laughing at him. “I look forward to reading your mission report. That’s got to be something else.”\nFor a moment, Jim is sorely tempted to tell her to mind her own damn business, but she does have seniority over him and anyway, he’s grown as a person. He treats her to his most charming smile. “Why wait? Have dinner with me and I’ll tell you all about it.”\n“Captain,” Spock cuts in in his trademark Vulcan-bored voice. He adds in Moreno’s direction, a touch more respectfully, “Captain. As delighted as I am that both of you are enjoying yourselves, I do not believe I am needed here at the moment. May I therefore be excused? I find myself in dire need of a sonic shower.”\nMoreno nods at him, smiling sweetly. “You’re our guest, Commander, please do as you like. Though I have to warn you, my science officer might be lying in ambush out there somewhere waiting for you. If you don’t want to have your ear talked off about some article of yours or something, better be careful.”\n“Indeed.” Spock inclines his head in a reserved salute. “I appreciate the warning.”\nHe doesn’t so much as look at Jim as he leaves. \n“Hm,” Moreno hums thoughtfully, looking after him. “Are you sure you’re not married, Kirk? Something tells me you have a lot of groveling ahead of you.”\nJim presses his fingers to the bridge of his nose. “Tell me about it.”\nPike doesn’t waste time yelling at him over subspace this time. Instead, Jim gets a single-line message in his mailbox.\n\nIt’s like you can’t help yourself.\n\nJim groans and swears he will never find himself fake-married to Spock ever again.\n \n--\n4.\nLife aboard a starship, though, often has other ideas. \nAfter the undercover mission, Spock is slightly more distant. Or, as Jim realizes, slightly more distant than he’s been lately. It’s like the first days of their mission again, when Spock thought that Jim was dangerous, possibly crazy, and needed to be handled with the use of protective gear. \nJim doesn’t quite know what to make of it, and it’s becoming annoying. Spock disappears into his labs – and for a change he starts rotating them, instead of always going to his favorite Lab 9 – develops a sudden preference to complete paperwork in his off-duty hours, and feels the need to meditate at least twice as much as he used to. Jim suspects that meditation is complete bull at least half of the time, because the one time he needs Spock urgently for a conference with Command the computer locates him in the ship’s pool. Unless meditation is now code for ‘I’m punishing myself for something’ – Spock hates swimming, though he goes to great lengths to maintain his proficiency at it, Jim is definitely being led on.\nIt goes on for over two weeks. Then, they are sent to Pravotis, and this time it’s Uhura’s fault, all Uhura’s fault. Well, maybe a little bit Jim’s, too, but he’s sticking to his guns on this one.\nIt’s a simple fact-gathering mission, a prelude to the upcoming trade negotiations. The Pravoti people are of a similar development level and are overall rather nice, apart from their obsession with protocol in all matters. Jim can’t wait for one of them to get into Starfleet Academy and have their roommate put a sock on the doorknob or mix his colors with his whites.\nHe studies the mission brief relentlessly. He doesn’t have an eidetic memory, but he’s not so bad, either. Uhura quizzes him. Spock quizzes him. By the time they both pronounce him ready, Jim isn’t sure he can ever look at interior décor the same way again, that is without analyzing the relative position of the furniture as a means to communicate the host’s social status, but that’s par for the course.\nHe does well, is the thing. Spending an entire day constantly on alert for endless rules and twists and turns of etiquette is draining, but he doesn’t err once. A couple of times he has to wing it, but guesses right, so that doesn’t count. There’s only the evening banquet left to endure, and Jim fully intends to simply do what Uhura does, because his mind is reaching the overload point.\nHe has to take an urgent call from Scotty and is the last one to enter the ceremony hall where everyone is already seated along the long table. There is only one free chair left, right next to Spock in the middle of the table, and Jim smiles for the first time that day. It might not be so unbearable if he has access to Spock’s sotto voce social commentary, which is always delightfully on the sarcastic side. Jim walks up right to him and sits down.\nThe entire hall goes silent.\nUhura, seated directly across from Jim, stares at him with horrified eyes. That’s when Jim remembers that the correct thing to do would have been to ask one of the Pravoti officials to trade places with him. Sitting next to one of their own is considered a great insult to the host. \nJim clears his throat, blood rushing to his cheeks. He looks at Uhura, mirroring her horror, but his mind is blank. Diplomatic etiquette is something he avoids at all costs, but he tried, dammit. It’s just not his forte.\nThe Arch Councilor is frowning with all three sets of eyebrows, and that means they’re in deep shit. Uhura jumps to her feet.\n“My apologies, Arch Councilor, for failure to inform you,” she says contritely, bowing in his direction. “By the Pravoti custom, mated pairs are required to sit together during social gatherings. Captain Kirk and Commander Spock are life-mates,” she uses the Pravoti term. “Forgive my oversight, the fault is mine.”\nJim stares at her, half in admiration, half in shock. He hears a distinctive if quiet sigh drifting from Spock’s direction.\n“An oversight indeed,” the Arch Councilor agrees gravely, but his frown is lessening. “But you are aliens and cannot be expected to master our customs completely in a matter of a day. That you show willingness to do so must be enough. It is forgiven.”\nJim has the distinct impression that they’ve just been handed a gold star saying ‘You tried’, but at this point he’s not choosy. Between being mildly humiliated and creating an interstellar incident, he’ll pick humiliation any time.\nThe trouble is, now he’s stuck with Spock for the rest of their time on the planet. Life-mates, according to Pravoti custom, are supposed to always stay near each other, preferably touching thus informing everyone else of their unavailability. It’s not a bad way to operate society, Jim thinks. Must sure relieve a lot of social tension. It’s that he must now go where he’s clearly not welcome is the problem. \nFor the rest of the evening, Jim is hyper-aware of every point of contact. He tries to keep it innocent and light. A hand on Spock’s forearm. Bumping shoulders. Touching his fingers lightly to Spock’s wrist. It seems to be enough to satisfy the Pravoti protocol, and Spock seems to find it unworthy of special notice, although it must be draining on his shields. Jim is so determined not to screw up again, he nearly panics when at some point during the reception he turns to pat Spock’s shoulder and finds him gone. \nA chuckle breaks through his panic attack. “He’s allowed to take a bathroom break without you, you know,” Uhura says, coming over, a glass of sparkling wine in her hand. \n“Right.” Jim breathes then grins at her. “Thanks for saving my ass in there. I swear I don’t know how that happened, I damn well knew what to do. You grilled me yourself, you know I did, I just blacked out or something.”\n“No, I know.” Uhura nods, looking sympathetic for once. “It’s like walking on a social minefield, you can’t relax for a second, but at some point, autopilot takes over.” \n“Not for you, it doesn’t.”\nShe grins. “I almost sat down next to Chekov when I walked in. Had to pretend I dropped an earring to get out of it. Imagine explaining that to his mother.”\nChekov’s mother came onboard the Enterprise once when they were orbiting Earth to visit. She cornered Jim in a corridor, waved an antique shotgun in his face, berated him for not taking good enough care of her son – apparently, he didn’t write home often enough, and then stuffed his mouth with a huge slice of salmon kulebyaka before he could respond. (It was delicious, but he was too terrified to enjoy it.) \n“Ouch.” He winces. “A close call.”\n“Tell me about it.” She shudders. “At least you only have Spock to deal with.”\nAnd Pike and his smug lectures. Jim sighs. It’s sort of unfair that Uhura is probably going to get a commendation for the exact same thing that would have earned him another round of ‘I can’t believe I thought you enlisting in Starfleet was a good idea’.\nSpock returns and announces his presence with a hand on Jim’s shoulder. Jim turns to look at him, smiling guiltily. \n“You okay?”\nSpock looks Vulcan-ly surprised at the question, that is to say the tiniest bit less expressionless than normal. \n“Indeed, Captain. The Arch Councilor’s aide has just regaled me with a most peculiar piece of information. Apparently, we are not the only ones ‘courting’ the Pravoti. According to Ms. Wesla, the Klingons have also initiated trade negotiations.”\nJim stares at him. “The Klingons,” he repeats slowly. “And these people. Are involved in trade negotiations?”\n“There’s no way the Klingons would put up with any of the Pravoti rules,” Uhura says, frowning. “They’d sooner shoot everyone than wait for their turn to speak.”\n“Indeed,” Spock agrees in a quiet tone. “Yet Ms. Wesla indicated that the negotiations were proceeding well.”\n“Are you sure she wasn’t lying?”\n“She was highly embarrassed that I had accidentally discovered her in her inebriated state. In her anxiousness to get away, she did not have the time to concoct a lie. Of that I am certain.”\n“But if that’s the case, Uhura’s right, there’s no way the Klingons would do this ridiculous song and dance with the Pravoti, which means it wasn’t necessary for us, either. They’ve been making us jump through the hoops for no reason except for entertainment.”\n“I concur with the first part of your analysis, but disagree with the latter,” Spock says. “There is a very clear reason for them to be making us ‘jump through the hoops’ as you say, Captain. We have been so focused on memorizing their social rules and not committing a single faux pas that our attention was rather singularly occupied.”\nJim blinks at him, then looks at Uhura. “You nearly made a mistake, and you don’t make mistakes. I did make a mistake, and, not that I’m perfect or anything, but I don’t usually make silly ones, unless they involve Risan dancers and alcohol. They’ve been keeping us occupied, because something is happening right now.”\nUhura nods, and Spock says, “A logical assumption.”\nJim looks at him, unable to keep from grinning. “Well then, Mr. Spock. What do you say if we ditch this whole diplomacy gig and go for some good old-fashioned reconnaissance?”\n“They’ll notice that you’re gone,” Uhura points out, scanning the room. \n“Not if you explain to them with your usual amount of tact that Spock and I have become life-mates rather recently and are still in that phase where we can’t keep our hands off each other.”\nSpock actually steps back from him, dropping his hand. “Lieutenant, you will do no such thing.”\n“Oh, yes, she will.” Jim is still smiling, but there’s steel in his voice now. “First, because I outrank you. Second, because come on, Spock, under the circumstances, there’s no better excuse for the two of us to disappear for a few hours, and you know it. It writes itself really.”\nUhura gives Spock a sympathetic look. “He’s right. If you go now, I can cover for you.”\nJim nudges his shoulder with his own. “Yield to the logic of it, honey.”\nSpock gives him what Jim has come to know as his death glare, which means Jim has won.\nWhich is how two and a half hours later, he finds himself pressed against Spock in a cargo container, trying to take very shallow breaths, because the stench is unbelievable.\n“Not quite what I imagined for the honeymoon,” Jim grumbles.\nThe container around them shudders in a very telling way.\n“Captain,” Spock says slowly, “I believe the ship has just—”\n“—gone into warp,” Jim finishes. “Awesome.” He shifts, trying to return some feeling into his arm. “We have about three more hours until they’re going to miss us down on the planet. Maybe a little more, because Uhura can spin a really good tale. We have that much time to get the girl and bring her back for some much deserved spanking. The Arch Councilor is grateful, the Klingons are vanquished, we sign the damn treaty, and Starfleet can deal with the rest of it. Piece of cake.”\n“I foresee a small complication with that plan.”\n“Is it that we’re currently going at warp speed in the opposite direction or that we’re stuffed in a box?”\n“I foresee two complications.”\n“Aw, come on, Spock. You hacked the Orion defenses from orbit. You’re telling me you can’t find your way out of a box?”\n“This is a targ cage,” Spock says with what may or may not have been a sigh. “It does not have a way out, only a way in. The logical thing to do would be to wait until the Klingons are ready for their next meal and come to retrieve the animal.”\n“See, not a problem then.”\n“The Klingons are known to fast for several days leading up to an important battle or achievement.”\n“Klingons fast?”\n“Are you criticizing another culture’s spiritual practice, Captain?”\n“Wouldn’t dream of it. I just hope somebody’s hungry on this boat, because a) we don’t have a few days and b) I heard Qo’noS has lousy weather this time of year.”\n“Qo’noS has had ‘lousy weather’ year-round for the last two centuries, Captain. I concur with the sentiment, however. It would be most unfortunate.”\n“What do they want with the Arch Councilor’s daughter anyway?” Jim has despaired of his attempts to make himself comfortable and simply sags against the wall. “I mean, I get why she thinks she’s here – she’s obviously crazy about that helm officer. Very star-crossed lovers and all that. But I’m pretty sure that’s not why the Klingons are giving her a lift and at warp.”\n“The most logical assumption would be that she is to be married the moment the ship assumes orbit around Qo’noS. Not to the helm officer, of course, though he, I believe, is unaware of it, but to one of their senior generals. That way not only do they get a high-ranking hostage, but also, if memory serves, Pravoti brides come with a dowry. In the case of the Arch Councilor’s daughter, that dowry might very well entail—”\n“—the whole planet and its dilithium deposits,” Jim finishes grimly. “That would explain why the Klingons didn’t go for their usual surrender-or-die shtick. They can get the planet without a single shot fired if they manage to legitimize their claim. Damn, I wish someone in Starfleet had thought of that.”\n“If they had, the most likely candidate for such an arrangement would have been a starship captain. Would you volunteer?”\n“Ah, but I already have a husband, Mr. Spock, and he’s the jealous type.”\n“He is not,” Spock sounds pained. “In fact, if I could convince you to transfer your apparent matrimonial zeal to another subject—”\n“Not a chance, I like torturing you too much. Then again, how come you don’t come with a dowry? I keep marrying you yet I get nothing for my trouble.”\n“Another clear indicator that you should desist then.”\n“Yeah, not likely.” Jim pauses. “I am sorry though that you had to suffer through all of that back on Pravotis.”\nConfusion seeps into Spock’s voice, as he asks, “Pardon me, Captain, I was aware of no undue suffering on my part. To what are you referring?”\nJim shifts to look at him, pointless as it is with no light. “Well, I had to keep touching you to satisfy their stupid customs. Yes, Mr. Spock, I’m aware that I’m criticizing another culture’s social mores, to hell with it. They didn’t make any allowances for your culture or mine, for that matter. It had to be – taxing – for you to have me all over you like that.”\nHe can’t see squat, but the warm darkness pressed against his left side is distinctly amused. \n“Captain, are you under the impression perhaps that your behavior toward me on the planet was in any way different than your normal conduct while on the Enterprise?”\nJim freezes. “You’re saying it wasn’t?”\n“Perhaps only marginally.” Oh yeah, Spock definitely sounds amused. If he were human, he’d be laughing. “Jim, you touch me all the time. You touch everyone all the time, and you make no exception for me. That is part of how you interact with the world. I have long noticed and accepted this.”\n“But—” Jim sputters and tries to create some space between them, except there’s no room for him to move. Spock waits him out calmly. Jim deflates, face burning. “You never said anything. I’d have stopped if I realized…”\n“I am grateful for your willingness to respect my culture, Captain. I did not object because I also appreciate your desire to include me into yours.”\nJim is silent for a long beat, not trusting himself to speak. When at long last he can manage, he says, “I’m writing that down the first chance I get. Next time we’re fake married I’m using that as marriage vows.”\nHe could swear Spock rolls his eyes at him. \n“Captain, must you persist in this most illogical—” He falls silent abruptly and squeezes Jim’s arm in warning. “I believe,” he whispers, “that your prediction has come true, Captain. Someone is hungry.”\nJim nods; he can hear it too. “Ready to play targ, Mr. Spock? Maybe you could growl?”\nSpock elbows him in the ribs with uncanny precision, and Jim’s quiet ‘oof’ is enough. The front wall of the cage falls out with a crash. Spock jumps left, Jim rolls to the right, and everything dissolves in the chaos of loud cursing and cold weapons flying, because no one slaughters their targ with disruptor fire. All in all, it’s a happy coincidence that on this particular occasion no targs were harmed.\n--\n“They already think you’re some kind of sex fiend,” Uhura tells him almost six hours later, when Jim and Spock drag a sobbing but compliant girl into the reception hall between them. “This isn’t going to help, I just have to warn you on that.”\n“Noted,” Jim replies, sparing a glance over his torn clothes and Spock’s missing upper shirt. “But I think next to the biggest social scandal in Pravoti history, we’re hardly going to make a bleep on their radar.”\n“There’s also a small matter of that Klingon Bird-of-Prey in orbit,” Uhura says, matching her steps to theirs. “I don’t think Starfleet Command will accept you classifying it as ‘loot.’”\nJim whines. “Uhura, I already have a headache from where this one’s Klingon paramour had hit me with a wrench. If you can think of a better way to explain it—”\n“Perhaps,” Spock interjects, “a dowry, Captain? For this young lady when she is prepared to select her life-mate in a proper Pravoti fashion? A wedding gift from the Federation to further our good relations with the Pravoti people.”\nThe girl shows signs of life for the first time since the entire plot was revealed, lifting her head, a cascade of white curls falling back from her face. “My father would forgive any breaches of etiquette on your part for a prize like that,” she says miserably. “Though I don’t think he’ll forgive me.”\n“But he’ll have to be nice to you anyway, since it’s your dowry,” Jim points out. That seems to cheer her up. Jim looks at Spock over her head. “You know, when we started this mission, this isn’t at all how I thought it would go. Girls and dowries and stuff. And I have said the word ‘dowry’ in the last four hours more than I ever have in my entire life.”\n“Do not despair, Captain. I am confident our service will yet find a way to accommodate your predilection for displays of physical violence as a solution, barbaric as it may be.”\nJim is too tired to keep it up, but grins. “I love you, too, you know. Uhura, go get the Arch Councilor. Let’s get this over with.”\nUhura ends up doing most of the talking, while Jim is having lucid dreams about his bed and Spock is stern and correct for the both of them. When the Arch Councilor begins to look less like he might have a stroke at any moment, Jim pulls out his communicator.\n“Enterprise, three to beam up.”\nHe’s never been so happy to be home, and even a violent if expected attack of McCoy’s hypo can’t ruin it for him.\n \n--\n5. \nIt’s not Jim’s fault this time so much as it is his choice, and he doesn’t regret it.\nThey beam down into an ambush. They beam down into an ambush approximately 38.7 % of the time, as Spock reminded him the other day, and now it looks like the statistic will have to be adjusted. Shots are fired just as they have finished materializing, and it’s pure luck that all of them aren’t hit at once. They break apart, looking for cover, and Jim reaches for his communicator, but it’s blown right out of his hand, shocking skin. He can hear Summers scream in pain and is pretty sure Grabov is dead, but he can’t get a proper look. \nThen, the whine comes. Like the deadliest mosquito he’s ever heard, it’s getting closer and closer until he can see it. A projectile weapon of some kind zeroing in on him, ignoring others. He can hear shouts, but is too busy evading, except it’s no use. It’s not bullet-fast, but it’s persistent, avoiding obstacles, eating up the remaining space until he knows he only has seconds, and—\nWHAM.\nSomething heavy knocks him to the ground just before impact, pressing him down, and a moan so full of pain rips the space that Jim feels it slice through his heart. Then, the transporter beam seizes him.\nWithin seconds he’s back on the transporter pad, arms full of Spock. Grabov’s body is behind him, Summers is moaning softly at his other side, but there’s also a mechanical, whirling noise, as well as some slurping. \n“Captain, don’t move!” Chekov shouts, tricorder in hand, eyes wide with horror. \nOnly then does Jim look down and very nearly throws up. The arrow-missile, or whatever it is, is… digging into Spock’s ribcage, whirling incessantly, trying to – to get to Jim. Only now does Jim realize that he’s dripping with hot viscous blood, and he’s been in a skirmish or two with the Romulans, but he’s never seen so much green blood in his life. There are bits of bone in it, his mind supplies, ever-observant, and Spock is motionless against him, unresisting, pliant like a ragdoll.\n“Its guidance system is still locked on you,” Chekov says, pushing the words out. “If you move, it’ll move with you, and—”\n“And if I don’t—” He cuts himself off. “You’ve got to do something to deactivate this thing. An EM pulse or—”\n“Captain, it could stop your heart!”\n\nWhirl-slurp. Whirl-slurp. Whirl-slurp.\n\n“Now, Mr. Chekov. That’s a damn order.”\nChekov rushes to the toolkit to get a resonator, shouting for the techs on duty to call Medical, because apparently no one has done so yet. They are all fired, Jim thinks, fingers curling around Spock’s arms, unfeeling. All of them. All—\nHe blacks out, but only for a few moments. McCoy’s yelling fills the room, reverberating between the walls, and for once he doesn’t spare Jim a glance, arranging Spock on the floor and ordering Chekov to beam them directly to the surgical unit. Jim watches them dematerialize in some kind of torpor, then sits up slowly.\nSummers is being wheeled out on a stretcher, and someone’s already removed Grabov’s body. Jim’s drenched in blood, his shirt clinging to him unpleasantly, dripping from the hem and sleeves. \n“Captain, are you all right?” Chekov asks, worriedly, pale as a sheet.\nJim looks up at him, feeling nothing. “Absolutely fine, Ensign.” He pushes off the deck, his body obeying without fault, but it feels like someone else is wearing it. “I want an analysis of that weapon in my queue within an hour.”\nChekov snaps to it. “Yes, sir.”\nJim has never before appreciated how long it takes to get to Medbay from the transporter room. His walk is purposeful and measured. He steadily ignores people jumping out of his way, plastering themselves against the walls, eyes terrified as they watch him pass. He sees them, yet sees no one.\nHe steps inside the brightly lit Medbay, filled with organized activity. He passes Summers being treated, eyes scanning the readout on the monitors. A flesh wound. Good, nothing to worry about. Someone, probably a nurse, calls out to him, but he ignores her. He walks up to the surgical unit and plants himself on the carpet in front of it. \nHe sees nothing through the opaqued window, but someone probably spots him, because a few minutes later, Nurse Chapel emerges, wrapped head-to-toe in her surgical garb.\n“We’re doing everything we can, Captain,” she says. “But the damage is severe. Doctor McCoy says you should prepare yourself.”\nHe nods at her sagely. “Thank you, Ms. Chapel.”\nHe leaves. By then, the news of him wandering the ship looking like death has obviously spread, because the staring is kept to a minimum. He’s got a good crew.\n“Mr. Sulu, report,” Jim demands as he steps into the bridge.\n“Ship’s functions normal, Captain,” his helmsman replies steadily. “I’ve put security on high alert.”\n“Good,” Jim says. “I need a squad armed with phasers in the transporter room in five minutes. I’m beaming back down.”\n“Captain, I don’t think that’s wise. They’ve already tried to kill you once. What’s to stop them from trying again?”\nJim smiles. “Haven’t you read the mission briefing, Mr. Sulu? It’s the way the Karronians conduct themselves when they feel threatened. They made an opening move, killed one of our own. The next move is ours. And I intend to make it.”\n“Sir, our orders from Starfleet are to ensure their cooperation in the rubindium mining expedition,” Uhura says, stepping down from her station. “We can’t risk offending them.”\nWhat did it cost her to say that, Jim wonders. She must know by now. Chekov would have told them.\n“I’m well aware of that, Lieutenant,” he replies. “I intend to fully comply with their tradition, nothing more.”\n“Captain, their tradition dictates—”\n“I did read the mission briefing, Lieutenant, thank you. Suspend your disbelief. Prepare a preliminary report for Starfleet, but don’t send it yet.”\nShe looks at him a moment longer, but only a moment. “Aye, sir.”\n“Mr. Sulu, while I’m down on the planet, you’re in command. Maintain alert status. I’ll contact you when I can.”\n“Yes, sir. Captain?”\nJim turns back to him, impatient. “Yes?”\n“Respectfully, maybe you should change before you beam down, sir.” Sulu’s eyes are glued to his shirt.\nJim looks down, smiling in polite puzzlement. “Why, Lieutenant? I believe everything’s in order.”\nSulu swallows as he meets his eyes. “Yes, sir.”\nThis time, when Jim beams down, he’s greeted by a delegation. A two-dozen squad of well-armed Karronians sneer at him. \n“Caught you off guard like helpless children, Federation. A worthy ally you prove to be indeed.”\nJim ignores them. “Take me to Chief Ksar. I have a personal matter to settle.”\n“What personal matter could you have with the chief, Federation?”\nJim bares his teeth. “I bring him the challenge of kvaar’ti. If he refuses my claim, know that he’s a coward unworthy to lead you.”\nA disturbed murmur fills the air, replacing lighthearted mockery. The squad commander lifts up a hand, a universal call for silence, and regards Jim with narrowed eyes, lingering on his blood-soaked shirt. \n“Follow me,” he says at last. “But your men stay here.”\n“My men come with me to bear witness. They will not interfere. It is my right.”\nThe commander looks none too happy about that, but agrees with a curt nod. “Very well.”\nThe walk is short, barely two hundred meters. Jim is lead into the town square, the ground turned to stone by hundreds of feet marching day in and day out. On the dais directly beneath the temple gates, Chief Ksar is conferring with his men but turns toward the newcomers.\n“What is this?” he demands, eyes flickering to the commander in anger, before coming to rest op Jim. “Have you come here to complain, Federation? We do not hear the words of weaklings.”\nJim undoes his belt, allowing his phaser and communicator drop to the ground, and marches forward. \n“Chief Ksar of the Clan Orresta. You killed my mate. I demand the right of kvaar’ti. I challenge you.”\nThe Karronian regards him coolly, a calculating look. He dares not back down in front of his men, but if he comes up with some excuse… \n“Are you a man of justice or aren’t you?” Jim gauds him. “If you refuse to fight, let it be known that you’re a coward and a weakling.”\nKsar’s eyes narrow into slits. “The right of kvaar’ti doesn’t give you the right to insult me, Federation captain. Very well. I will fight you, human. Maybe I can reunite you with your mate.”\nRoom is made for them in the center of the square, a circle of red sand marking the sacred battle ground. Ksar steps down, throwing off his cloak. He’s a head taller and built like a bull. Jim grins up at him.\n“Captain—”\n“You are to witness only, Mr. Hendorff. And if I am dead, you take my body back to the ship, nothing more. Is that clear?”\n“Yes, sir.”\n“All right, Chief.” Jim has never taken his eyes off the Karronian. “Shall we begin?”\nHis mind is remarkably clear. He attacks and parries, defends and counterattacks, present in every movement, alive only in the moment. There is no thought, no doubt, no guessing game. No fear. His body is honed for this, trained for this, and Ksar might have bested every single one of his warriors in single combat, but the people who invented a weapon as cowardly as that missile-arrow will never hold the higher ground. \nAnger sips in with that thought and Jim’s concentration slips, causing him to miss a vicious blow that nearly ends it there. \nNo mind. No thought. No emotion. He repeats it like a mantra as he rolls away, coming back to his feet, whirling in place and striking, ignoring the pain in his broken ribs. There is no pain in the moment. There is only one way this will end. Moments stretch around him and through him. He knows he’s done it when he sees a flicker of fear in Ksar’s eyes.\nIt’s over before he knows it, though later Hendorff will tell him that close to an hour has passed. Jim doesn’t feel it. Holding Ksar in a headlock, he stares down at him, and for the first time in his life understands the urge to kill. It would be so easy now, just a twist of his hands, barely any effort. \nBut the part of him that is a starship captain steps forward. If he kills Ksar, another from his clan will take his place, and obviously they’re no fans of the Federation. But if he refuses to kill him, the humiliation will force him to step down, leaving the throne empty for the next best warrior. Regretfully, Jim grips Ksar’s neck until the chief loses consciousness and throws him down in disgust.\nHe stands up and looks around in absolute silence. His shirt is now stained with purple blood as well as green, and his hands are steady.\n“Ksar is breathing still,” he announces, enunciating clearly. “But he is your Chief no longer. I have defeated him, but I have no interest in ruling over you weaklings.” He looks around and noticing the squad commander who had greeted him, motions him forward. “What are you called, warrior?”\n“Trav of the Clan Harug.”\n“Congratulations, you’re the new Chief of Karronia, as all these men are witness. It is done.”\nThe entire square echoes him. “It is done.”\nJim smiles at Chief Trav. “Fan-fucking-tastic. Now, shall we talk business?”\nHe beams back to the ship an hour later, a newly signed treaty in hand. A nurse is waiting for him in the transporter room. Jim grits his teeth and doesn’t ask, allowing her to mend his ribs. It’s a patch, but it’ll do for now.\nHe goes up to the bridge and stalks toward Uhura’s station. Her eyes are wide as she takes him in, but she says nothing.\n“File this with Command,” he tells her, handing her the treaty. The document – and it’s some honest-to-God paper – is stained in blood, but she takes it without flinching. “Priority one.”\n“Aye, sir.”\nJim goes up to the central seat, waving Sulu back down. “Mr. Sulu, stand down from general quarters. Set a course for Starbase 16, warp factor two. You’re in command until I relieve you or until shift change, whichever comes first.”\n“Yes, Captain.”\nOnly as he steps into the turbolift, Jim remembers he never told them where he’d be. Doesn’t matter. Not like they don’t know anyway.\nHe stalks into his quarters and strips, stuffing his uniform, even his boots into the disposal unit. He puts the sonic shower on maximum and lets it pounder his body until he feels sore with it. He dresses meticulously as though getting ready for inspection, only unlike some sniveling first-year cadet he gets everything right on his first try. He leaves.\nHis feet carry him as though on autopilot until he finds himself outside the surgical unit again. There is no waiting area, so Jim sits on the deck, his back to the wall and waits.\nAlmost nine hours later a grey-faced McCoy steps out, swaying on his feet slightly. He doesn’t seem surprised to see the captain sitting on the floor. He crouches down in front of him, and it’s the hardest thing Jim has ever done to meet his eyes.\n“It was a race against time,” McCoy says, voice hoarse and rough from hours of tension. “We’ve repaired the bone damage, and the organ damage. Well, some of it. Blood vessels took the longest time, there were just so many bleeders...” He closes his eyes for a moment. “Sorry. We’ll continue to give him plasma, but that’s about it at this point. He’ll live or die now, Jim. I don’t know which.”\nJim nods. “Thank you, Doctor. I’m sure you’ve done everything you could.”\n“Don’t.” Bones winces. He surveys Jim critically. “You’re staying, I take it? You do know, we had to restart your heart, too, after that stunt you had Chekov pull?”\n“I’m staying.”\nMcCoy nods. “I have a cot in my office.”\n“I’m staying here.”\nJim’s heart absolutely doesn’t plummet when he realizes Bones isn’t going to fight him on this. \n“Right.” McCoy pulls himself upright slowly, moving like a man twice his age. “They have orders to get me if anything changes.”\nJim nods, says nothing, doesn’t watch him go.\nHe imagines if they were down on a planet somewhere, the sun would go up and then down, and he still wouldn’t have moved. People come and go. At some point a nurse comes up to him to wave a scanner over him. It’s Chapel. He doesn’t look at her, but he recognizes the perfume. Her fingers squeeze his shoulder before she leaves.\nSix hours later, McCoy comes back, and this time he’s not in a generous mood.\n“All right, Jim, up you get. You have a ship to run or have you forgotten?”\nJim looks up at him, surprised at the pain in his neck. “We’re at warp en route to a starbase. What do you think they could possibly need me for?”\n“They need to know you’re okay, dammit. You’re the captain, Captain. You can’t afford to fall to pieces.” McCoy waves a PADD in his face. “Efficiency’s down eight to twelve percent throughout the ship, did you know that?” He pauses, glancing at the screen. “Except for the science department, apparently. Theirs is up point-two.”\n“Yeah, I think Spock beats them.”\n“Jim.” McCoy sighs. “Get the hell out. I don’t care what you do, but the crew needs to know they’re not losing both of you.”\n“The thing is,” Jim says slowly before he can stop the words, before he even knows it, “he jumped in front of me. When it was clear there was no getting away from that thing. He jumped in front of me. I didn’t even see him.”\nMcCoy crouches down next to him. “Then I guess I owe the hobgoblin another one. If that was you, you’d be dead before you finished beaming.”\n“It’s not fair.”\n“It never is, kid. Now please get out of here, you’re scaring my staff.”\nJim nods and extends a hand. McCoy pulls him up, and Jim nearly topples over. “Ow.”\nMcCoy rolls his eyes. “Serves you right for sitting for so long in one position. Here” – he brandishes a hypo he’s pulled out apparently from thin air – “a muscle relaxant. Should have left you creaking, but the last thing the crew needs right now is to see you hobbling out of here.”\n“Thanks.” Jim nods, straightening with a curious sense of detachment. His eyes drift toward the still opaque window. “If there’s any change—”\n“You’re my first call.” McCoy grips his shoulder. “Go on then.”\nJim leaves. The crew is visibly relieved to see him, and Jim feels a pang of guilt. He never served on a starship in any capacity other than a captain. Every command track class he’d ever taken had pressed on the importance of leadership. The crew draws strength and confidence form their captain. Jim knows this, theoretically, but he has never felt it, never realized just how much of a symbiotic relationship that is until today.\nWhen he steps out onto the bridge and Uhura’s face melts in relief – Uhura of all people – he gets it.\n“No news, sir?” she asks quietly as he stops by her station.\n“No news.” He squeezes her shoulder. \nSulu is still in command, which at this point isn’t surprising. Jim sends him off to get some sleep and takes the chair. On a whim he decides to check on what’s keeping the science department so occupied. \nApparently, it’s some really advanced math exploring the relationship between a star’s gravitational emissions and time. Some months ago, Spock had postulated that a slingshot run around the sun could result in time regression. An intriguing theory which they had had no time to explore. By the looks of it, at the moment, his team is pulling triple shifts trying to prove him right. They’ve pulled every single person in on this, including biologists and geologists and other unrelated specialists, who’d taken over the rest of the work, leaving everyone who has so much as a smidgen of background in astrophysics and applied math to focus on this. Also, they have apparently kidnapped Chekov. Hopefully, they remember to feed him.\nJim shakes his head. It’s entirely possible that by this time tomorrow he’ll find himself walking the streets of some other version of the Roman Empire. In all likelihood he won’t remember this then, so he doesn’t care all that much. Besides, he’s pretty sure there’s only one person onboard who could make them stop at this point, and he’s currently unavailable.\nHours stretch. He completes his paperwork, approves duty rosters, checks in with department heads. He goes off shift as scheduled, eats in the mess, goes back to his cabin. He stretches out on his bed and lies staring up at the ceiling for four hours. Then, he gets up and begins a new day.\nHe’s reading reports from Starfleet Intelligence in his ready room that evening when McCoy finally calls him. The first thing Jim notices when he walks into Medbay is that Spock’s been moved from the surgical unit to the ICU. Jim steps in hesitantly, staring.\nSpock’s pale. No, not pale. White. A complete absence of color. Jim looks up at the monitors and blinks at the barely-there readings. He’s not ready for this. He thought he was, but—\n“Jim.” McCoy turns to him, eyes bright with – are those tears? “Jim, it’s the healing trance. He’s slipped into it half an hour ago. Jim, he’s going to be all right.”\nJim grips the doorframe hard for balance. “Are you sure?”\n“Positive.”\nJim exhales. “You’ll need to hit him when it’s time to come out of it, yes? Call me. I have a lot of energy saved.”\nMcCoy laughs. “Probably the only chance you’ll get to kick his ass. I’ll call you. Might be a few days, though. He has a lot of healing to do.”\nIt takes almost four days. Enough time for them to reach the starbase, load up supplies, and depart to do some extensive star charting – and Jim’s never been so happy to give the science department something else to do. When McCoy does call though, Jim’s on subspace talking to Admiral Komack and has to stay put. By the time he gets down to Medbay, Spock’s awake.\nJim stops in the doorway, out of sight, just watching.\n“—I assure you it is unnecessary,” Spock is saying, sitting on the biobed primly. “You know perfectly well that I am fully functional within minutes of coming out of the trance, Doctor.”\n“And I’m telling you, stay put and let me check you out, you ungrateful hobgoblin,” an incredibly irate McCoy answers. “You have no idea what I had to do to keep your guts – whatever was left of them – on the inside of your body. You lost over four liters of blood, do you get that? I don’t care how efficient that Vulcan voodoo of yours is, you’re fit when I say you’re fit.”\nSpock gives him a curious look, but miraculously says nothing. McCoy scans him three times for good measure, adjusts some settings and scans him again. He then does something he almost never does when he treats Spock – takes his arm to test the muscle resistance manually. Spock’s eyebrow climbs up, but he allows it without a word, eyes never leaving McCoy’s face.\n“I thank you for your efforts, Doctor,” Spock says quietly.\nMcCoy closes his eyes for a moment then lowers Spock’s hand slowly. “Yeah well, don’t do that again. Ain’t the same without your logic annoying the crap out of me.” He sighs and without looking up calls out, “Something to say, Jim?”\nJim jumps slightly. Spock turns to look at him, unsurprised, brown eyes warm. \n“Who, me?” Jim says, stepping inside. “Never.”\n“Damn straight.” McCoy presses a hypo into Spock’s neck with excessive force as though to compensate for a moment of weakness. “You’re on medical leave for the next two days, no, shut up, I don’t want to hear it. Eat, meditate, sleep. Lots of greens, lots of liquid. You still have about a liter of blood to rebuild.”\n“I will adhere to your restrictions, Doctor.”\n“You’d better.” McCoy shakes the hypo menacingly before pushing past Jim to the door. \nIt’s not a conscious decision, Jim’s feet simply bring him closer. Spock slides off the bed to face him, the light blue medical scrubs highlighting just how pale he is still. Only his eyes are dark, rich in color. Jim drinks it in.\n“Captain?” Spock lifts an eyebrow, a concerned inquiry.\n“I’m going to do something,” someone using Jim’s vocal chords says. “I know you don’t like it and probably don’t get it. But I need to do this. Just this once, Spock, bear with me.”\nJim steps closer still and puts his arms around Spock, pulling him into a full-body hug. Spock freezes for a moment. Then, tentatively, almost shyly, his hands come to rest on Jim’s back. \n“It was – that bad?” he asks softly, his careful articulation of a decidedly human phrase making Jim laugh. \n“You have no idea,” Jim murmurs, burying his face in Spock’s neck, inhaling deeply. There, underneath the sterile smell of Medbay, is the familiar scent that he didn’t know he could identify, let alone miss. “Your science minions were ready to go back in time to get you.”\n“Surely you would not have allowed this.”\n“Oh, I don’t know, Mr. Spock,” Jim says, making himself pull back. “I have a feeling they wouldn’t have taken no for an answer.”\n“Fortunately, there is no need for such drastic measures.”\nJim squeezes his shoulders. “Yeah. Fortunate, that.” He knows he needs to let go, but can’t seem to make it happen. “Fair warning, you might be dealing with a particularly touchy-feely crew for a few days, until they remember their manners.”\nThe corners of Spock’s mouth pull up. “I am getting that impression, yes.”\n“Right.” Jim grins ruefully and finally, finally steps back. “Um, I need to get back to the bridge.”\n“Of course, Captain.”\nJim turns to go before his body decides that Spock looking at him like that, eyes soft and filled with gentle humor, is a good enough reason to do something really inappropriate.\n“Jim,” Spock’s voice stops him at the door.\n“Yes?”\n“I would appreciate, that is, if you can spare the time after your shift and are not excessively tired—”\nJim grins. “You want an update on the ship’s status, don’t you?”\n“It would be most welcome. I do not wish to disobey Doctor McCoy’s orders, however, a verbal account would not violate his terms—”\n“You got it. We can have dinner and I’ll bring you up to speed.”\n“Thank you, Captain.”\nJim leaves.\nStarfleet commends him for his creative resolution of the Korrinian situation. Jim very nearly tells them where to stick it, but doesn’t. \nThe slingshot theory definitely has potential, Spock tells him when he is cleared for duty. The math, as it happens, bears it out. He doesn’t try to conceal his enthusiasm. Jim pats him on the back and makes a mental note to fire everyone in the science department before they can take over the ship with the combined power of their intellect and apparent crazy. \nSpock looks like he can read Jim’s mind and very pointedly doesn’t roll his eyes as he skulks back to his station. Uhura winks at Jim behind his back, and Jim grins at her. \nAll is well.\n \n--\n6. \nThe next one – Jim isn’t around for the next one. More precisely, he’s there but more as a prop than an active agent, and has to subside on what Bones tells him later, which is a damn shame.\n“Your captain became ill on our soil,” the Valesian ambassador repeats for the third time. “Only our healers can treat him.”\n“I’m the Chief Medical Officer of his ship.” McCoy glares at him, advancing. “I’m his personal physician. It’s my duty to treat him – you can’t deny me that!”\n“It would be in violation of our most sacred custom, Doctor,” the ambassador replies with infuriating calm and gestures for the guards. “I do not wish to use violence, but if you persist, I will be forced to.”\nMcCoy rounds on Spock, lowering his voice only just. “Spock, you can’t let them carry on with this madness. Jim’s got Rigellian flu, nothing major, but if not treated, it’s fatal, and these people don’t have the vaccine! He’ll die if I don’t treat him.”\nSpock doesn’t acknowledge him with so much as a glance as he steps around McCoy toward the Valesian.\n“Ambassador, we respect your customs. However, I must ask for an indulgence. On Earth, and indeed on the majority of the Federation worlds, the one undeniable custom is that family members are allowed to attend their sick, regardless of the circumstances. I believe, the phrase is, ‘in sickness and in health.’”\n“That is a custom we share, Mr. Spock,” the ambassador replies primly. “But I do not believe that, being Captain Kirk’s subordinates, you qualify as family members.”\n“Doctor McCoy is a close friend of the captain, but in the strict official sense you are correct in his case. As for myself, however, the captain and I are life-partners,” he uses the Valesian word with only a hint of a pause. “According to your own laws, you cannot deny my right to attend him.”\n“Indeed, if you are telling the truth.” The ambassador smiles in a would-be apologetic manner. “It is said that Vulcans never lie, and I certainly do not wish to insult you, Commander, but the timing of your revelation makes me doubt its validity.”\n“No offense is taken, Ambassador. However, I am telling the truth. Your healers have examined the captain, have they not?”\nThe Valesian nods, frowning slightly. \n“In that case, they must have discovered a band of vines tattooed around his upper right arm? It looks identical to this one.” With that, he pulls off his blue shirt in one smooth motion, rolls up the sleeve of his regulation black tee, and demonstrates his own arm for the ambassador’s inspection.\nThe ambassador looks at the healers, who come closer to take a look. They nod at him.\n“It is a symbol of our union,” Spock explains. “It was bestowed upon us in celebration of the occasion.”\nSpock is one smooth bastard when he wants to be, McCoy thinks, barely refraining from rolling his eyes. He leaves people with a completely wrong impression, but technically, there’s not a word of lie in anything he’d said. This must be why Vulcans make such good lawyers. Also why they piss everybody off so much. \nHe knew the tattoo was still there of course, but the security ensign looks like he has trouble picking his jaw off the floor. McCoy gives him a sympathetic look. Vulcan striptease would do that to a person.\nThe ambassador, on the other hand, looks like he’s chewing lemons, but denying Spock now would be going against his own words.\n“Very well, Commander. Forgive my doubt. You – and only you may attend him.”\n“This way, sir.” One of the healers opens the curtain for him.\nMcCoy steps up to Spock quickly, grabbing his arm, and presses a loaded hypo into his hand while blocking it from view. \n“Two cc’s every two hours until his fever breaks. If you run out, find an excuse to step out, I’ll give you more.”\nSpock doesn’t look at him, ostensibly busy with his shirt, but he gives a barely-there nod, and his fingers close around the hypospray, concealing it.\n“You may wait here, Doctor McCoy,” the ambassador indicates a padded bench when Spock disappears from view. “It is in the hands of the gods now.”\n“I’ll pray then,” McCoy grumbles as he sits down. \nAs God is my witness, Jim, if you die from the damn flu, I’ll kill you myself.\n \n--\n7. \nBeing released for light duty has its advantages. He feels perfectly fine and has the freedom of the ship, but no one will bother yelling ‘Captain on the bridge!’ or any such nonsense. This is how Jim sneaks into his ready room to catch the tail end of Spock’s conversation with Pike.\nSpock glances at him over the monitor, but otherwise doesn’t acknowledge his presence. By the slightly constipated look on his face, Jim can guess the subject of the lecture only too well and grins. It’s nice to have the tables turned for a change.\n“—was to save his life, trust me, no one is complaining about that,” Pike is saying. “But I wonder.”\n“Yes, Admiral?”\n“You were my XO for four years. Before then, it was Number One for six years. We’ve logged plenty of deep-space missions together, yet in all this time, do you know how many times I had to marry my exec in the line of duty?”\n“If memory serves, never, sir.”\n“Memory serves you fine.” Pike sounds amused. “Do you get what I’m trying to say here, Spock?”\nSpock doesn’t sigh, but looks resigned. “Indeed. Just as I trust you will understand when I say that you have not provided me with any information I did not already have.”\nThere’s a slight pause. \n“I see. I don’t know if I should wish you luck or offer my condolences.” \n“Nor I, Admiral. But I appreciate the sentiment.”\n“Until next time, then, Mr. Spock. Tell Jim I said hi. Pike out.”\nSpock waves the screen off and looks at Jim. “The admiral conveys his greetings.”\n“I heard.” Jim walks toward him slowly. Leaning on the edge of the desk in front of Spock, he presses his fingers to Spock’s arm briefly. “So. You kept it. I thought body art was archaic.”\n“It is. I believed it might prove useful to keep it for the duration of the mission. Demonstrably, I was correct.”\n“Ah, but you didn’t know I’d keep mine when you decided to keep yours. You were all surprised, I remember.”\n“Hardly surprised. Knowing your personality, it was reasonable to assume—”\nAlmost too fast to follow, Jim leans over and stops the rising flood of logic with a kiss. Spock hesitates only a moment before responding, and suddenly he is standing and Jim is sitting on the desk, pulling Spock in tightly, kissing him until he doesn’t remember anything but that. Spock’s hand slides over Jim’s face, and then he pulls back, looking deliciously affected. \n“Jim,” he pleads softly, lips swollen and bright. “I am on duty.”\nJim nods, steals one more kiss to the line of his jaw. He’d spent many an hour fantasizing about biting that stupid line. He’s allowed this one.\n“Your shift ends in two hours. I’ll be in my cabin, resting.”\nSpock looks at him carefully, hand pressed against Jim’s cheek. “If we do this, the possibility of the mind link reopening spontaneously between us is 96.7%.” \nJim slides his fingers over Spock’s because he can and because watching Spock shiver is making him high. \n“If we do this more than once, the connection will deepen, until—”\n“—we actually are married.” Jim turns his face to kiss Spock’s palm and is rewarded with a sharp intake of breath. “I thought you told Pike you were paying attention.”\nSpock’s eyes widen slightly. “Indeed. However, I was not certain that you yourself were aware—”\nJim knocks Spock’s hand away and kisses him again, and this time, he’s not taking prisoners. It’s hot, heavy, but not dirty, not yet, it’s just that Spock is so incredibly intoxicating with all the little noises that he doesn’t make but Jim feels run through him anyway.\n“You told me about T’Pring,” Jim breathes into the space between them. “You didn’t have to. I remembered – afterwards.”\nSpock looks instantly enlightened. “I see. At the time, it was not my intention to instigate—”\n“I know.” Jim grins, slides off the desk, brushing deliberately against him, hands lifting to straighten Spock’s shirt for him, brush his hair back in place. \nSpock watches him with amusement. “Am I now presentable?”\n“Hm.” Jim looks over his handiwork critically, using all of his willpower not to kiss him again. He had no idea he had that much willpower. “Give it two minutes, Commander. Chekov’s too young to die of a heart attack.”\nSpock shakes his head, but makes no move to follow him. “This match will be impossible to explain to my people.” \nHe doesn’t look too broken up about it. If anything, he seems stoically delighted by the idea.\nJim looks back at him from the doorway and smirks. “Just tell them I come with a dowry, Spock. The next Bird-of-Prey we run across is all yours.”\nThe look of horrified fascination on Spock’s face is making Jim’s year, mostly because neither of them can be certain he’s joking at this point, and Spock just – rolls with it.\nIf there are better foundations for a life-long partnership, Jim honestly doesn’t care.\n--"
}