{
    "id": "14910729",
    "url": "https://archiveofourown.org/works/14910729?view_full_work=true",
    "author": [
        "RayShippouUchiha"
    ],
    "title": "The Guiding of Death",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "F/M"
    ],
    "fandoms": [
        "Marvel Cinematic Universe",
        "The Avengers (Marvel Movies)",
        "The Avengers (Marvel) - All Media Types",
        "Iron Man (Movies)",
        "Iron Man (Comics)",
        "Iron Man - All Media Types",
        "Captain America (Movies)",
        "Captain America - All Media Types",
        "Captain America (Comics)"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Tony Stark"
    ],
    "characters": [
        "Tony Stark",
        "James \"Bucky\" Barnes",
        "James \"Rhodey\" Rhodes",
        "Steve Rogers",
        "Avengers Team (MCU)",
        "Stark Robots (Marvel)",
        "Jarvis (Iron Man movies)"
    ],
    "additional_tags": [
        "Angst",
        "Emotional Hurt/Comfort",
        "Hurt/Comfort",
        "Not Avengers: Infinity War Part 1 (Movie) Compliant",
        "Alternate Universe",
        "Always Female Tony Stark",
        "Female Tony Stark",
        "Alternate Universe - Reincarnation",
        "Alternate Universe - Canon Divergence",
        "Alternate Universe - Gender Changes",
        "Alternate Universe of an Alternate Universe",
        "Stand Alone",
        "Misunderstandings",
        "Pining",
        "Tony Stark Has A Heart",
        "Tony Feels",
        "Tony Stark Needs a Hug",
        "Possessive Behavior",
        "Eventual Smut",
        "steve messes up",
        "Bucky Picks Up The Pieces",
        "And Takes His Place",
        "Hades and Persephone AU",
        "do not copy to another site"
    ],
    "language": "English",
    "series": "Part 15 of The Components of Construction",
    "published": "2018-06-12",
    "completed": "2018-08-07",
    "words": "41,393",
    "chapters": "7/7",
    "comments": "1,782",
    "kudos": "16,984",
    "bookmarks": "6,835",
    "hits": "278,093",
    "summary": "<p>“Hades and Persephone reborn huh,” Fury states then more than asks, “no need to ask which is which.”</p>\n<p>Toni’s brows furrow even as dread begins to squirm to life inside of her.</p>\n<p>But before she can say anything, before she can open her mouth and set the record straight, she hears it.</p>\n<p>A murmur as loud as a <i>scream<i> from somewhere in the tomb silent bridge.</i></i></p>\n<p>\n<i>\n<i>“That whole Merchant of Death thing,” someone off to the side faux whispers, “makes a lot more sense now.”</i>\n</i>\n</p>\n<p>\n<i>\n<i>It echoes across the bridge like a gunshot.</i>\n</i>\n</p>",
    "notes": "<p>It's me, ya girl, back with another AU brought about from tumblr. I hope you guys like this!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Okay so the chapter count jumped to 3 cause that's just how I roll and things got a little long on me! So we're getting an extra chapter now so I can do this justice. Hope you guys enjoy and please leave a comment!</p>\n<p>God I'm so bad at this keeping stuff short shit cause yeah the chapter count got moved up again but I swear it's the last time. 4's a good round number. Be sure to let me know what you think cause yeah, I live for the feedback babes.</p>\n<p>Edit: Russian words have been edited from here forward for anyone who is rereading.</p>\n<p>Tsvesti has become lepestok thanks to a Russian reader!</p>\n<p>I know, I know, that chapter count keeps climbing. Please don't be mad at me.</p>\n<p>Also I've provided the link to where I pull my flower meanings from if you're interested. It doesn't really impact the story but it's a reference for anyone who might like to know!</p>\n<p>Tada!!! Look at that amazing chapter count just fucking grow again. But, you know, it's fine.</p>\n<p>I am back with the final chapter!! Or at least it's the final chapter unless you guys are interested in the short epilogue I have in mind. Just let me know and if there's enough interest I'll post it.</p>\n<p>But yeah, I hope you guys like it!</p>\n<p>Alright, you guys asked for it so here it is. The epilogue. The definitive end of the road. It's been an honor to have you guys with me along this trip and I hope you'll stay with me through all my other projects as well.</p>\n<p>And I really hope you like the direction I took with the epilogue.</p>\n<p>http://rayshippouuchiha.tumblr.com/</p>",
    "text": "“-ridium.”  Toni hears as she and Coulson step through the doorway.  “What do they need the iridium for?”\n“It’s a stabilizing agent.”  Toni pipes up. All eyes turn to focus on her even as she waves Coulson away and pauses for a moment to survey the room.\nRomanov is sitting at the table while Steve, gloves tucked into his belt and hands on his hips, stands shoulder to shoulder with Thor on the opposite side.  Bruce Banner, round shouldered and vaguely uncomfortable, stands fiddling with his glasses in the background.\n“It means the portal won’t collapse on itself like it did at SHIELD.”  Toni throws the information out there almost absently as she pulls her eyes away from Steve who’s staring at her now, one brow arched and face assessing.  “Also, it means the portal can open as wide and stay open as long as Loki wants.”\nToni struts her way around him and Thor, who’s staring at her avidly, and towards the screens that mark the main control panel towards the helicarrier’s front.\n“So does Fury fly the skull and crossbones on the outside of the ship or does he just have it hanging on the wall behind his desk?  I’m thinking something like American flag on top, then the Jolly Roger, and then his Girl Scout troop right below it. An order of importance if you will.”  Toni directs the statement towards Maria Hill who’s watching the entire situation passively. “Also, while we’re talking about pirates, where  does Patchy keep all the illicit booty on this boat?  Besides underneath that fabulous leather trench coat of his of course.”\nToni hears a few startled coughs and quickly muffled snickers from the bay of computers and monitors surrounding them but doesn’t let her own amusement show.\nShe’s working the room for a reason of course and she wants all eyes exactly where she needs them to be.\n ‘I’m harmless,’ says the right hand of a left handed thief.   It’s a moto Toni lives by in a lot of ways.  Even if she’s never  really been harmless.\nThat in mind she closes one eye and assesses the control panels again.\n“How does Knick-Knack even see these?”  She twists enough to address the question to Hill even as she idly fixes the cuff of her blouse.\n“He turns.”  Hill tells her placidly but Toni can see the faint smile lurking around the corner of her mouth.\n“Sounds exhausting.”  Toni shrugs, turns, and moves the conversation back on track as she reaches out and fiddles with the panels a bit, pushing buttons seemingly at random.  In reality she’s scanning everything she can see.\n“The rest of the raw materials Agent Barton can get his hands on pretty easily.  The only major component he still needs is a power source of high-energy density.  Something to kick-start the Cube.” Toni waves a hand nonchalantly as she turns again to face the table, a PEG on the tip of the finger that she presses against the underside of the control panel.\n“Activating the PEG now Miss,” JARVIS speaks up quietly in her ear but Toni shows no outward reaction.\n“When did you become an expert at thermonuclear astrophysics?”  Hill looks as unimpressed as always as she asks the question. The woman’s a tough sale but she’s also never given Toni any outright problems so that’s a plus in her favor.\n“Last night.”  Toni blinks at her, completely serious.  She’d devoured enough research material on the subject that she could probably teach a class on it if she were so inclined.  Or if MIT were inclined to ask her to do so again after the last time she’d made a guest appearance in a classroom. Honestly the explosion hadn’t even been that big no matter what Rhodey said and she’d paid for all the damages anyways.  “The packet, Selvig’s notes, the extraction theory papers. Am I the only one who did the reading? Naughty, naughty.” Toni tisks with a waving finger.\n“You are the metal vanguard.”  Thor interrupts before anyone can say anything else.  Toni turns to face him only to see that he’s taken a step forward in her direction, arms now uncrossed.  His head is cocked to the side and his eyes are narrowed, a look of contemplation on his face.\n“Indeed I am.  I don’t think I’ve been formally introduced to either of you.”  Toni steps towards Thor and Steve, her hand held out for Thor to shake despite her normal reluctance to do so.  She’s aware that being overly rude, or at least more than she already has been, to an alien prince might not be something even she can talk her way out of.  Yet. “Toni Stark, also known as Iron Queen. Among other things.”\n“Well met Lady Stark.” Thor grasps Toni’s hand and, to her surprise, raises it to his lips to place a courtly kiss on the back of her knuckles.  His lips are warm and where he touches her Toni’s skin tingles like she’s been gently shocked by static electricity. “I am Thor, son of Odin and Crown Prince of Asgard.  I did not think Midgard had been blessed with their gods being reborn to them already, much less a matched pair of such reknown. Nor had I expected a goddess as beautiful as you.”\nAnd just like that the entire bridge  freezes.\n“What?” Fury’s voice rings out from behind them but Toni doesn’t bother to turn, attention focused squarely on Thor as it is.  “What in the  fuck are you talking about?”\nIt’s Thor’s turn to look surprised.\n“You do not know?”  Thor asks skeptically as he continues to hold Toni’s hand in one of his own.  “A god and goddess stand in your midst, two of the oldest aspects of creation, and yet you do not know them?  Has Midgard fallen so far as to not know Life and Death when they see them personified before their very eyes?”\nSomething inside of Toni perks up at those words, seems to come to attention.  Unfolding and blossoming inside of her like it’s always been there.\n“Even as a child on Asgard I heard many tales,” Thor continues as he reaches his free hand out towards Steve.  Steve, brows furrowed, lets Thor pull him forward by the hand. “The love affair of Life and Death, of Persephone and Hades, is a tale known across the realms.  It is good to see the two reunited.”\nAnd then, face beaming, Thor places Toni’s hand into Steve’s.\nAnd in that moment something inside of Toni seems to  shatter.\nBecause, as if touching Steve for the first time skin to skin has flipped some kind of switch within her, it all comes rushing in.\nToni finally knows  who  and  what she is.\nFinally those disjointed, inharmonious pieces inside of her, the ones that have always grated and  hurt, have slotted into place.\nFinally Toni knows the  truth of her existence.\nAnd as she stares into Steve’s eyes and sees the blossoming awareness in his expression she knows the same is true for him as well.\nThey’ve awakened,  together, just as they were always meant to.  Touch bringing their true aspects to the surface once more.\nToni feels herself soften, feels a small smile of true joy and welcome begin to blossom on her lips.  Her masks no longer matter, her composure and the image she’s worked so hard in this life to build and maintain no longer matters.\nAll that matters is this moment.  All that matters is his hand in hers.\nBecause she has  missed him with an ache she’d never been able to put a name to.  Has missed her mate, her match, her other half with a sort of intensity that’s helped to shape her entire life up to this point.\nShe’s missed the one god in all of creation who could complete her and now he’s here, right in front of her.\nAnd he just so happens to be the man whose ghost and legend she’d fallen in love with as a child.\nJoy is too quiet a word for what Toni feels right now in this moment.\nAnd then, as it always seems to do, everything comes crashing down around her.\n“Hades and Persephone reborn huh,” Fury states then more than asks, “no need to ask which is which.”\nToni’s brows furrow even as dread begins to squirm to life inside of her.\nBut before she can say anything, before she can open her mouth and set the record straight, she hears it.\nA murmur as loud as a  scream from somewhere in the tomb silent bridge.\n“That whole Merchant of Death thing,” someone off to the side faux whispers, “makes a lot more sense now.”\nIt echoes across the bridge like a gunshot.\nStanding there, surprise arching through her and warring with the shock of discovering the truth about herself after so long, Toni feels something inside of her, something soft and warm and  lovely, ice over.\nBecause, standing across from her with his face twisted into a grimace, Steve doesn’t say anything, doesn’t step forward, doesn’t try to defend her.\nInstead he turns his eyes from her, tugs his hand free from hers, and says  nothing.\nInstead he takes a step back and away from her.\nAnd all Toni can do is watch, stricken, as her god-mate, her husband, her  Hades, abandons her.\nAt her side Thor looks confused, his smile of joy dimming sharply as he goes to speak.\nToni reacts on instinct, hand latching onto his wrist as she stares up at him and just barely shakes her head no.\nWhatever he sees in her expression must be enough because he closes his mouth.\nThor, Toni knows, is aware of the truth, knows exactly who and what Toni is.\nBut it isn’t  Thor Toni wants to defend her.  Isn’t this God of Thunder from a Pantheon not her own who she yearns to have step forward and stand by her side.\nAnd if Steve, Hades, the Death to her Life, will not defend her then Toni wants no other to take his place.\nNot now.\nNot here.\nNot in this.\n~~~\nToni waits for Steve to say something to her in the hours that follow.  To find her in the lab of the helicarrier and speak to her.\nTo come to her, smile bashful but shoulders straight, and take her into his arms as he used to, before …\nJust  before.\nToni waits for him to come to her and do what he had not done earlier.\nTo truly acknowledge her, to acknowledge what they are to each other.\nTo the world.\nTo the universe as a whole.\nBut …\n He doesn’t.\nAnd Toni ...\nToni feels something within her wither and die more and more with each passing moment.  With each unspoken rejection.\nFeels something soft and sweet curl up tighter and tighter in her chest, an aching sort of vulnerability that wants to cry and keen in pain.\nShe doesn’t let it show of course, the training this life has given her far too deeply ingrained.\nShe will not be vulnerable now, in this, where so many others can see.\nShe has too much pride for that, now more so than ever before with her past and present fusing together.\nBecause she was a goddess once, is one once more, newly awakened and still resettling into her own skin, but she is also  Toni Stark.\nHer godhood does nothing to erase the agony of the life she’s had so far, or the joy.  Does nothing to erase the lessons she learned beneath Howard’s fists or the armors she’s been building since she was a child.\nAnd now, with all of that mixing with all the aspects of her that had come into being  before, Toni finds that her control is nearly flawless in a way she’d not been able to achieve separately in either life.\nSo instead of giving voice to the scream building in her chest, instead of forcing all of them to listen, Toni buckles it down.\nShe bites back the agony of everyone immediately assuming she’s Death instead of Creation.\nBites down the anger and the bitterness of them not even having the decency to truly know what it is they’re all so quick to scorn.\nSwallows down the bloody, aching  torture of Steve turning from her too, lips sealed shut tightly, never even trying to defend her or even his own aspect from their scorn, never even attempting to correct anyone.\nNever even attempting to claim  her, to claim his place at her side and in turn hers at his.\nBecause Toni knows what she is, knows  who she is.\nAnd with hindsight firmly in place she knows now that she's always known the truth, in one way or another.\nOnly now it finally makes sense, finally feels  right.\nBecause she is Persephone reborn, a goddess of Creation, of Life, of blossoming and growth.\nAnd Steve, her Hades, her god of Endings, of Death, of silence and peace, should have stood by her side.\nAnd  yet …\nNow, as she has so many times in this life, Toni stands  alone with only JARVIS in her ear and Rhodey, her best and brightest connection to humanity, too far away for her to reach.\nShe doesn’t let that make her falter though, can’t.\nBecause others might have forgotten the truth of her, might have been taken by the legends and the myths written by  men, but Toni has not.\nToni has not forgotten, will never forget, that her name wasn’t always  Persephone.\nIt was Kore once.\n Little girl.  The maiden. \nA throw away name for a throw away child, a by-blow that the Sky Father Zeus had seldom acknowledged.\nShe’d been wild even then, Toni remembers.  A barefoot and tangle haired whirlwind that the others of the Mount had whispered and pointed at.  Always running, always creating, always free and mostly forgotten except by a mother who held on too tightly.\nBut even that had only been when it suited Demeter, only when she needed things to blossom and grow so she could reap the worship that came alongside each harvest.\nKore, the little girl, the maiden, had only been loved when she’d been  useful.\nAnd then she’d finally rebelled.\nShe'd left her sun bound flowers and her nymph companions behind.\nShe’d chosen the Underworld.\nHad chosen  Hades.\nHad given her heart and her body to a dour but just god with rigid shoulders and a rare but surprisingly bright smile.  A god as far from Zeus’ carelessly cruel personality as she’d ever seen.\nShe’d chosen as any goddess should have had the right to choose.\nAnd yet Demeter had objected, had punished everyone else for her one attempt to make a free and willful choice.\nAnd, in the end, Zeus hadn’t seen fit to truly mete out justice.  To truly rule over the others with fairness and a steady hand. To force Demeter to see the error of her ways, to not allow her to try and shackle another goddess to what  she wanted her to be and do.\nInstead he’d forced Toni, Kore’s, hand, had pried her from her love and her throne for seasons at a time.\nAnd, in the aftermath of Demeter’s tantrum, he had even seen fit to rename her.\nHad stripped the name she’d worn for millennia from her and forced a new one upon her in its place.\nHad branded her  Persephone  as one part punishment and one part reminder to all of what he’d called her  true nature.\nPersephone.\n\n Chaos Bringer. \n\nAnd Toni has unknowingly, or perhaps subconsciously, lived up to the legacy of both her new name and her true aspect for her entire mortal life.\nShe has been both chaos bringer and creator.  Has relished in defying expectations even as she built a new empire for herself and the husband, the god-mate, she never knew she was missing.  Had even fallen in love with the ghost of his mortal legend as a child. Had become enamored with his straight shoulders, bright smile, and dedication to justice all while never knowing him for the match he’d always been for the oldest, most primal part of herself.\nShe built a kingdom, a life, for the both of them together.  For her and for Hades, for Steve.\nShe’d turned her penchant for creation in a new direction and watched bombs and weapons bloom to life beneath her hands.  She’d brought forth metal flowers of the most poisonous kind in an unknowing tribute to the Death that would  always be her mate.\nShe’d built a new mechanical Cerberus whose heads are no longer forced to share a body.  She had crafted her bots, her boys, with her own two hands out of a desperate sort of loneliness and some faded echo of a memory she hadn’t even known she’d carried.\nAnd then there’s JARVIS, her sweet boy, her new aged Charon who is still ever the guide, always whispering wisdom in her ear, and oh so precious to her heart.\nToni has suffered and bleed for and because of the new aged underworld she built from the framework left to her by yet another careless and cruel would be father god.\nAnd she did it all for the husband, the god, the king, the mate,  who does not want her.\n~~~After that?The wormhole is an almost easy choice.\nSo with JARVIS’ voice still echoing in her ear and Rhodey’s warmth blazing in her broken heart, Toni closes her eyes and  soars.\nJust like the boy from the story that’s been her lullaby for so many years now.\nJust like the boy with the wax wings who’d loved the sun and the sky and everything else too far above his station and had reached too high in the process.\nJust like the boy who’d never mastered the art of the middle ground when it came to things that could so easily destroy him.\nIn this moment she is Icarus triumphant, wings spread wide as she flies, hands blooming red and gold petaled death into the uncaring void.\nAnd oh the irony is almost  bittersweet.\n~~~Only Toni doesn’t die there, doesn’t get to leave the hurt and the  agony behind while space takes her soul and slings it back out into the ether.\nShe doesn’t get a soft restart, doesn’t get to reset the clock, to perhaps, one day, be reborn again.\nNo, not her.\nInstead she comes hurtling back down to earth, an unwilling Icarus destroyed in this moment.\nA girl, a goddess, who longed for the dark sun of the void and was, yet again,  rejected.\nBut Toni is nothing if not a creature of creation, of adaptability, of survival.\nBecause isn’t that what Spring is?  Isn’t that what Life is?\nThe continuous cycle of being reborn, of tasting death and fighting it back through sheer will power alone.\nIs that not what Toni has done, time and time again, across this lifetime as well as the last?\nSo Toni plummets back down to earth and crashes into the unforgiving ground.\nShe is battered and bruised and heart sore.\nBut, despite all of that, or maybe because of it, Toni does what she always does when someone or something knocks her down.\n She gets back up.\n~~~\nIn the aftermath of the battle Toni gathers the others to her, these would be Avengers.They eat shawarma.\nThey sleep at her Tower.\nThey look at her out of the corners of their eyes like they know  who  and  what she is.\nToni ignores them because she knows without a shadow of a doubt that they  don’t.\nTogether with the others Toni sees a somber Thor and Loki off the next morning.\n“I do not understand why you do not correct their false assumptions,” Thor tells her softly as he lifts her hand and presses a kiss against her knuckles, “but I will hold my silence as you wish, Lady Persephone.”\nBeside him Loki lights up with understanding and what looks disturbingly like glee.\n“It’s Toni, darling,” Toni tells Thor with a small, almost smile.  “It’s the name I was born with in this life, it’s the one I’ll keep using.”\n“As you wish,” Thor agrees easily enough, “just know that you have a friend and ally in me, and in all of Asgard in turn.”\nAnd then, with one last wink from Loki, Toni watches them go, these gods who she does and does not have so much in common with.\nShe turns back to the others intent on trying to bridge some of the gap between them.\nBut in the end all she can really do is watch as they go their separate ways.\nAnd through it all Steve can barely seem to stand looking at her.\nAll he gives her is a small nod before he turns on his heel and strides off towards his motorcycle before she can get a word in edgewise.\nAnd in turn all Toni can do is watch him go, hands clenched tightly behind her back.\n“I am with you, Miss,” JARVIS whispers into her ear, her new aged Charon, her  son.  “Through this life and all others if you will have me.  No matter your divinity. For we are family and I will never willingly leave you.  From this day until my last.  So do not think yourself alone in this.”\n“I know,” Toni whispers back to him, his love and devotion a balm for the frostbitten wound Steve has left on her heart.  “I love you too, JARVIS.”\nAnd then she takes in a deep breath and glances towards the car that’s waiting for her, an uncomfortable looking Bruce sitting in the front seat.\nHe won’t stay for long, Toni knows that now.  Whatever rapport they’d been building has been damaged beyond belief by the assumptions of her true nature, of their certainty as to what her godly aspect is.\nIt hurts, but …\nToni’s used to pain.\nHas been for longer than human history can accurately record.\nBecause life is filled with pain and creation itself is an agonizing sort of joy.\nDeath, not Life, is where true peace is found.\nAnd despite what the others may think, that has  never been Toni.\nShe has always been a creature of chaos and creation no matter how much she might have resented Zeus for his renaming her without her permission.\nToni lets her hands fall loose at her sides before she turns on her heel and strides towards the car.\nShe ignores the rose and crocus petals that drift down to the pavement behind her.\n~~~\n“I have something to tell you,” Toni whispers to Rhodey a few days later after he’s come back to the Tower intent on being with her after the scare of the invasion and the wormhole.  He’d grabbed her as soon as he’d been within arm’s reach and hasn’t let her go since then.\nToni’s far from complaining.\n“I’m here Tones,” Rhodey whispers back just as softly, lips pressed against her temple as his fingers card gently through her hair, unbound and wild around the both of them.\nIt’s grown even longer in the past few days, darker and thicker, the strands stronger and more luscious than ever before.\nToni knows why, remembers the feel of her curls, thick and dark and wild, fanning out around her and brushing against the backs of her knees as she spun herself in circles and danced life into the fields and the trees when she was sure she was alone.\nRemembers the way Hades had loved them so, had spent hours threading them through his fingers, spilling them across his sheets and his chest.  The way his hands had clenched in them as they loved one another.\nToni pushes the thoughts away forcefully.\nThere are some physical characteristics, it seems, that will always hold true even as others change.\n“I know you are,” Toni tells him, senses heavy with the familiar scent of leather and spice that will always spell out safety and  home for her because it’s a scent she associates with Rhodey.  “I just … I’m scared, Rhodey. I don’t … I don’t want you to look at me different.”\n“Oh baby girl,” Rhodey laughs as his hand comes up to cradle the back of her head, fingers buried in her hair but touch infinitely gentle.  “There’s nothing you could tell me, nothing you could do, that would ever make me leave you behind. It’s you and me, Toni, till the day we die.”\nSo, voice soft and slow, Toni tells him.\nTells him about Thor, about Steve, about gods and goddesses.\nAbout Hades and Persephone.\nThere’s a moment of long silence and then Rhodey moves.  He shifts her up and off of his chest, shuffles them around until he’s kneeling in front of her and the couch.\n“Persephone huh?”  Rhodey asks, face soft as he brings his hands up to cup her face in his palms.  “You know, I could see it.”\n“You think I’m Persephone?”  Toni can’t help but ask because she’d never outright told him what her aspect truly is.  “Not Hades instead?”\n“Oh,  sweetheart,” Rhodey says as his fingers trail up and into her hair like he’s searching for something, “of course you’re Life.”\nAnd when he brings his hand down Toni sees the crimson rose bud he’s holding between his fingertips.\n“God, Toni,” Rhodey smiles at her as he reaches up and tucks the bud behind her ear and then trails his fingers softly across the arc of her cheek, “how could you be anything else?”\nToni blinks the tears from her eyes and  smiles.\nBecause, as always, his love warms her, sustains her.  Her highest priest and the protector of her heart.\nHer greatest warrior.\nHer Rhodey.\nShe can’t help but wonder if he even realizes how very special he is, how very  precious.\nThis man who found a goddess, slumbering and unaware, and loved her, faults and all, with an unselfish sort of devotion.\nToni leans forward and presses her lips against his forehead gently, eyes closed and thoughts focused.\nThis mortal, blessed now by Life itself, entwined so deeply with her very essence that she knows that nothing will ever touch him, will ever take him from her side.\nA gift of love, given and returned in equal measure.\n~~~\nRhodey hands her a small potted cactus a day or so later with a serious expression on his face.\n“For you,” he tells her.  “Figured you might like some real plants in this place now so I thought a cactus would be perfect.  It’s small, hardy, and prickly as all hell. Just like you.”\nAll Toni can do is  laugh.\nBut the cactus gets a place of honor in the workshop and it is, from that first day on, always in bloom.\n~~~\nIt doesn’t get easier from there and yet it does all at the same time.\nSteve still won’t look at her, avoids her, throws himself into SHIELD and missions and anything else that will help him in his quest to stay away from her.\nAway from what they should be to and with each other.\nBut there’s also Rhodey and Pepper and Happy who show her such acceptance, who flare with temper when they discover the full extent of the other’s assumptions.\nNone of them like it when Toni swears them to secrecy but they promise to keep their silence all the same.\nPepper gives her a beautiful and oh so rare Gold of Kinabalu Orchid a few days later and Happy a large, hulking planter containing a fledgling jade vine a day or so after that.\nRare and precious gifts of love and acceptance that Toni ensures remain always in bloom.\nThere’s also the bots and JARVIS who are, as always, loyal and loving and  hers.\nToni isn’t even ashamed of the way she cries, soft, sweet tears, when the bots give her a bouquet of metal blossoms.  Instead she puts them in her newly renovated sun-room in the penthouse.\n~~~\nSo with JARVIS in her ear and Rhodey and their family at her side, Toni presses forward.\nShe throws herself head first into the aftermath of the invasion and into the Avengers themselves.  Makes tech and armor and everything else she can think of to keep the others safe, to keep the world safe.\nTo maybe, just maybe, help to mend this bridge Steve has so unexpectedly pushed between them.\nBut then …\nHYDRA.\nSHIELD falls, there’s files released and a ghost revealed.\nAnd yet, despite the way Toni knows she could have helped in a million different ways,  no one calls her.\nIn the end Steve ends up in the hospital with wounds that should not have lingered as long as they did.\nShe worries about him but she doesn't dare visit in person, unable to put herself through yet another rejection at the moment.\nShe sends Steve flowers instead.  Reaches out to him with a phone call no one answers and a massive bouquet of roses, crocuses, violets, dwarf irises, lilies and larkspurs that she grew herself.\nAnd yet he still does not call.\nHer gesture goes unanswered, her reminder of a moment that was once so precious to the both of them remains unacknowledged.\nToni smashes more than one delicate glass vase and stone planter in her grief.\nAnd then she curls herself into a ball in the center of her flower filled sun-room, buries her face in her hands, and  weeps.\nPetals drift to the floor around her as the flowers and vines mourn alongside her.\nNature itself grieving with and for her.\n~~~\nTime passes as it is want to do but Toni barely feels it.\nShe’s not mortal anymore, if she ever really was at all, and time isn’t something that will trouble her for a long time to come.\nNot really.\nBut what Toni does feel, what does bother her, is the fact that Steve is, once again, gone.\nLeft to chase after a ghost, after Bucky Barnes himself who has been returned to the world.\nAnd Toni can’t fault him for that, not when there is little she wouldn’t do to protect Rhodey.\nBut it doesn’t mean that it hurts any less when he doesn’t answer her calls.  When he brushes her off until Toni stops reaching out all together.\nOr the way he ignores her offers of help except for when he needs use of her tech or her connections and funds in his never ending search for his friend.\nIt hurts, the way he uses her.\nThe way he still, despite all of this time, refuses to be around her for longer than absolutely necessary.\nThe way he still says nothing when the others whisper about her, when the conversation inevitably turns towards Death.\nIt  hurts and Toni can’t help but wonder what she’d done, what sin she’d committed, to have him turn from her so.\n~~~\nAnd then everything changes.\nBecause then, spilling forth from the shadows like some kind of malicious shade determined to destroy what bits of happiness she has left, is  Ultron.\n~~~\nBacked by the Maximoff twins Ultron tries to destroy them all.\nTries to rip JARVIS, her brightest boy, her Charon reborn, from her.\nThey stop him of course, but the damage is done.\nThere is an anger focused towards her now from the others that wasn’t there before.\nThor’s momentary disdain and disappointment coupled with the remaining Maximoff being welcomed onto the team and Bruce leaving is the tipping point for Toni.\nBecause the others sneer and whisper about her now with a maliciousness that wasn’t there before.\nThey call her  Death, call her dark, call her  Hades with glares and derision.\nThey blame her for Ultron, mutter about how of course an AI touched by Death herself would want to destroy everything and everyone.\nThey are almost willfully blind to the truth of who she is, blind to even the truth of who Steve,  Hades himself, once was and should still be.\nBlind to the truth of Life and Death and all that they entail.\nBut what’s worse is the fact that, once again Steve is silent.\nToni thinks she can see some sort of guilt hiding in his eyes the few times he actually looks at her but it ultimately means nothing because he still doesn’t try to correct them.\nNot even in the days and weeks afterwards when tension is high enough between everyone that Rhodey actually plants a fist in Clint’s mouth.\nOr when Toni, aching over the near loss of JARVIS and adjusting to Vision’s new presence in her life, takes a step back and away from the team in more than just the physical.\nEven then Steve still doesn’t try to reach out for her.\nNot as a friend or a teammate.  Not as an Avenger or a fellow god.  Not as a husband or a mate.\nAnd that?\nThat’s  enough.\nToni has endured and then endured some more over this lifetime and the one that came before.  She has suffered and bled and still blossomed despite adversity.\nShe can no longer endure his  cruelty.\nShe is, was, his wife, his queen.\nBut she is also a goddess.\nAnd Creation bows before no one, not even Death.  Not really.  Not in the ways that matter.\nSo Toni reaches out and grabs hold of that thread that connects the two of them.\nIt’s that resonating sort of feeling she’s had since the beginning, since that moment on the helicarrier when every disjointed feeling inside of her body and soul had snapped into place.\nIt’s the connection that’s lingered between them once she finally understood just who and what she really is, has always been.\nA connection that has been blocked by Steve time and time again, left to wither and slowly die over time, unable to flourish despite Toni’s best efforts.\nShe reaches out and wraps a metaphysical fist around it.\nBut Toni doesn’t twist it, doesn’t try to snap it.\nInstead she  pulls.\nA surge of pain rocks her but Toni doesn't let it stop her.\nInstead she grits her teeth, sets her determination forefront in her mind, and keeps on pulling.\nIt  hurts, those first few days and weeks she spends tugging at the connection between them, but Toni doesn’t stop.\nNot even when something inside of her begins to go cold, begins to tint just a bit in shades of grey she doesn’t remember being able to see before.\nShe can't, won't, stop.\nSo instead Toni pulls and pulls and  pulls.\n~~~\nIt happens like this:\nUltron dies and with him goes the remnants of the hope that Toni has been cradling close to her breast.\nThe hope that one day Steve would come back to her, that Hades would return to her side.\nThat one day her love would again be returned.\nGoddess or not, Persephone reborn or not, Toni should have known better.\n~~~\nIt takes a while for Toni to realize, exactly, what she’s done to Steve and, more importantly, to herself.\nIt takes Rhodey and JARVIS and Vision’s concern over the way she’s grown paler, hair darker than ever before and eyes even brighter, for her to realize something’s wrong.\nTo realize that she’s changed.\nShe’s not sure, how exactly, she’s different, but she knows that she is.\nThere’s an  ache deep inside of her that grows by the day, gets heavier and colder with every week that passes.  A chill deep inside her soul that she can’t seem to shake.\nToni knows something’s wrong but she can’t quite put her finger on what.\nOr at least she won’t admit to herself or the others that she knows what’s wrong.\nAnd yet she keeps on  pulling.\n~~~\nThings were destined to come to a head, Toni knows that.\nAnd yet … well she’d never thought it would be like this.\nBut then, maybe she should have.\nMaybe she should have seen this coming.\nBut even if she had, Toni's sure that foresight wouldn't have lessened the pain any.\nStanding it the center of the Compound Toni can do nothing but watch as JARVIS presses his code into street cameras and building security systems and eventually shows her Steve taking Sharon Carter into his arms and kissing her.\nAnd something inside of Toni doesn’t shatter so much as it does  crumble.\nShe presses it down though, draws on her flawless composure to press forward despite the hurt.\nBecause this is about more than just her own pain, about more than what should have been between her and Steve.\nThis is about protecting the entire world.\n~~~\nHours later, laying on the cold concrete of a Siberian bunker, blood fresh and heavy in her mouth, Toni doesn’t even try to bite back her tears this time.\nThere’s no one here to see her cry.\nThere is, as so many times before, only JARVIS in her ear.\nJARVIS who will, Toni knows, keep this secret for her as he has all the rest.\n~~~\nHours later Vision comes.\nHe kneels down beside her, knees crushing the snowdrops and forget-me-nots that have sprung from the ground wherever her blood has spattered or pooled.  His hands are steady but gentle when he brushes her hair away from her face.\nThere is an infinite sort of sadness in his eyes when he stares down at her.\nEventually Vision helps to pry her from the armor and Toni hears his uncharacteristic gasp when she comes tumbling out of the metal.\nHer clothes are ripped and there are black blooded gouges torn into her flesh.  Deep angry wounds that seep wispy tendrils of shadow and well up with blossoms and petals of a thousand different shades and varieties.\nIrrefutable proof of who and what Toni is.\nOf what she's done.\nVision frets over her but the wounds are already healing by the time they’re on the way back to the Compound.  Gashes closing and bruises fading twice as fast as even her advanced divine healing should allow given who’d inflicted most of them.\nNo one can hurt a god like another of the divine after all and those are wounds that always linger.\nExcept these ... don't.\nAnd it’s in that moment, standing by Rhodey’s bedside as he sleeps off his own rapidly fading injuries, that Toni truly understands exactly what she’s done.\nHades was loyal, was  kind, was fair and just and level headed.\nHades, her dour husband who’d loved her far more fiercely than any on Olympus had thought the death god was capable of, would have never turned from her, would have never sought out another.\nNot even for something so simple as a kiss.\nAnd, above all else and most telling of all, he would have never raised a hand to her.\nBut Steve?\nSteve isn’t the god he’d once been, not now, not in the ways that count.\nHe'd rejected her, rejected his own aspect, and he had become less in the process with only his memories and the faint traces of Death that he could not fully suppress lingering around him.\nAnd then Toni took most of that from him too, tugged and pulled at the very essence of him until she pulled the very Death from his bones.\nShe pulled and pulled and  pulled on their connection until he was a god in body only, is Hades still in memory and in soul, but is no longer Death.\nIs no longer mated and matched to her on such a basic level.\nAnd then, in the process, Toni inadvertently took what she stole from Steve, from Hades, into herself and shoved it down into her chest for safekeeping.\nHer desperate attempt to escape the cruelty of being bound to a god who no longer loves her has led Toni down this path.\nHas made her into what she is now.\nA hybrid creature, a goddess of two opposing forces.\nAn avatar of two aspects never meant to linger in one body.\nLife and Death trapped in one body.\nAnd it  hurts.\nAs if it were only biding its time, waiting for her to acknowledge just what she’s done, Death claws at Toni now from the inside out.\nIt  aches with a ferocity she can barely stand, the battle between the two aspects currently housed within her.\nLife and Death ripping away at each other inside of her chest  constantly  and mercilessly until Toni longs for the pain of the days beneath Howard’s fists and feet, for the pain of palladium, for the simpler, more familiar agony of the reactor.\nIt never stops, the hurt of it all.\nDeath, the aspect so familiar to her but never hers to  keep, is vicious in its desire to be free.  It  loves  her of course, loves the Life within her as best and as deeply as a ending can love a beginning, but it also wants  out.\nDeath wants a new host, wants to spread and  grow.\nAnd, above all else, it wants to be free to mate with the Life that simmers inside of her.  Wants their true union restored instead of being forced into this unnatural cohabitation.\nInstead of being forced to twist Toni from the inside out into this abomination of a goddess, this hybrid creature never meant to see existence.\nBut Toni …\nToni has no other options.\nAll she can do is grit her teeth and deal with the anguish she has, at least partially, brought upon herself.  The hurt caused by Steve’s choices and the way they’d forced her hand.\nBecause without Steve, without Hades at her side, she has no one to pour that Death into.\nHas no ready vessel into which she can pour endings.\nSo she has to suffer instead.\nShe has Rhodey and Vision and JARVIS of course, has her raggedy little family that she adores, but she is  alone once more in so many of the ways that matter.\nAs she’d always feared she would be in both this life and the last.\nAs Hades had once sworn would never come to pass.\nAs Steve has now guaranteed.\nToni thinks she’d be more bitter if she could find room for it past all of the pain.\n~~~\nIn the aftermath of the so called  Civil War, Toni moves into the Compound full time.\nBefore she’d always lingered at the edges, forever on the outside looking in, and had chosen to spend the majority of her time ensconced in the familiarity and welcoming safety of her Tower instead.\nLiving in the castle she’d built with her mate’s name in her heart and dreams lingering on the tip of her tongue.\nBut with Rhodey still resting as his wounds heal, his spine knitting back together bit by bit, and the Avengers scattered and broken at her feet, the Compound is the better choice.\nSo she takes her bots and their precious lizard Mother, and settles herself into the fortress of concrete and steel she’d built for a team that had never truly wanted her.\nAnd then she turns herself towards the task they had not trusted her with the first time around.\nThe Accords and the future of the Avengers.\nBecause, no matter what else happens, Toni is a  goddess, is the only goddess of this world, of these people.\nAnd that makes them hers to protect.\nEven the ones who don’t believe in her.\n~~~\nSometimes, when the pain of Death writhing in her chest is calmer, a piece of Toni can't help but sneer at the bitter irony of her rebirth.\nBy the circumstances of her mortal life and all of the pain and the anguish that had followed it.\nBecause hadn’t she suffered under the rule of a faithless husband who became a careless father for long enough the first time?  Did her rebirth have to be shadowed by so much of the same?\nDid  Howard have to follow Zeus?\nDid  Maria have to follow Demeter?\nWas she cursed to forever cycle through so much of the same?\nHadn’t she suffered enough neglect and absent cruelty as Kore?\nDid it have to compound upon itself to become what Howard and Maria had inflicted upon her?\nIn those moments Toni can’t help but wonder what it is about her, about her very soul, that makes it so easy for the ones who should have loved her to turn from her instead.\nIs it some curse she never knew she carried?\nDid Hera, in her bitter rage, curse Kore as she had so many of Zeus’ other bastard children?\nDid Toni carry that blight on her soul with her through all of the ages, through all of her lives?\nOr would all of this have happened regardless?\nWas she always fated to end up here?\nToni can’t decide what would be better.\nFor all of the anguish she’s suffered to have been the result of some divine curse she can not see let alone break.\nOr for it all to have been destiny of a sort, fate in some way.\nA byproduct of nothing more than who and what she is.\n~~~\nToni presses forward as she always does.  Presses through the pain and the hurt and the sadness and does what she does best.\nShe builds and creates her way forward.\nThree months out the other side of the Civil War and the Accords are rapidly taking shape beneath her, Vision, and Rhodey’s influence as well as T’Challa and other like minded individual's guidance.\nA week after the first amendment is signed into effect Toni does the one thing she hasn’t allowed herself to do outside of the safety of her Tower.\nShe picks a secluded corner of the Compound grounds and she builds herself a garden.\n~~~\nThe garden becomes a special sort of escape for the three of them.\nOnce they realize what she’s doing in the large swath of space that’s suddenly become encircled with towering holly hedges full to bursting with berries, Rhodey and Vision insist on helping her.\nSo their rare free afternoons are spent there in Toni’s newest sanctuary.\nThey spend hours with her there, shovels in hand and dirt streaked across their faces despite the way Toni tells them there are quicker ways for her to get the pond she plans to put here or the small waterways she wants there.\n“We would like to help you build this, Toni,” Vision tells her softly as he floats down to settle beside her on the thick grass.  “To aid you in this act of creation, as your family.”\nJARVIS whispers his agreement in her ear even as Rhodey reaches out and rubs a dirt covered hand against her face with a laugh.\nEven Pepper and Happy get in on the situation.  Pepper having beautiful koi fish delivered for the pond once it’s finished while Happy squabbles cheerfully with Rhodey about how to best build a bridge over the waterways.\nToni just laughs, Vision on one side and Pepper on the other, as she coaxes vines and roots up and over the little streams in smooth arches.\nBoth of them pout right up until Vision shows them the plans he made for the truly massive birdhouse he intends to build.  Then they’re right back to arguing good naturedly.\nIt only makes her love them more.\n~~~\nNot all of her time in the garden is so cheerful though.\nToni finds herself there on the nights when she can’t sleep, when Death rattles too violently inside of its cage.\nAnd on those nights everything Toni tries to bloom withers and dies in her hands, leaves shriveled, blossoms wilted and vines black with rot.\nDeath twisting Life before it ever has a chance to be.\nIn those moments she is reminded of just how  wrong she is.\n~~~\nIt’s storming the night Rhodey follows her to the garden, thunder cracking like cannon blows, lightning arcing through the sky like all of nature is alight with the fury that writhes within her.\nAnd maybe it is.\nToni is a goddess after all, is Life, is Creation, and that is an aspect that touches  everything even if lightning has never been hers to call.\n“Toni!” Rhodey’s voice calls out between thunder claps, echoing across the expanse of her garden.\nCurled into a ball against the trunk of the sprawling pomegranate tree she’d been compelled to grow on the small island in the center of the pond, Toni says nothing.\n“Toni,” Rhodey calls again, “baby girl, answer me!”\nThe lightning flashes again and Toni sees him, standing on the arch of the nearest bridge, soaked through with rain and face creased in worry.\nShe hates seeing him so upset.\nHates being the cause of it.\nSo she stretches out her will, whispers a flicker of a wish to the garden, and waits.\n“You know,” Rhodey says a few moments later, exasperation and relief warring in his tone as he carefully brushes the flowers and vines that are still clinging to him from where they'd pulled him to her away, “I kind of hate when you do that without warning.”\n“Liar,” Toni does her best to summon a smile for him but she can tell from his expression that it doesn’t come across as well as she’d hoped.\nHer composure is flawless now when she wishes it to be but Toni has never really had shields where Rhodey is concerned.  Has never had the need to. There has never been anything about Rhodey that she’s ever needed protection from.\n“Baby girl,” Rhodey sighs as he sinks down onto the thick grass beside her, arm coming up to wrap around her shoulders as he draws her close to his chest.  “What’s wrong?”\nToni curls closer to him, uncaring of the way his bare chest is damp with rain.\nShe’s silent for a long moment.\n“I’m …” she swallows, tries to find the right words, “there’s something wrong with me.”\n“What is it?”  Rhodey tenses against her, worry suddenly sharp in his voice.  \"What do we need to do to fix it?\"\n“I did something, to Steve, to myself,” Toni admits softly, “and I … I don’t know what to do, Rhodey.  I’m scared and I don’t know what to do and it  hurts.”\n“I’ll help you, Tones,” Rhodey says instantly, truth heavy and sure in every inch of him.  “Whatever it is, whatever happened. I’ll help you. We all will. You know that.  So just, tell me what it is.”\n“I took Death from him, from Steve,” Toni admits.  “I pulled it from him and now it’s inside of me and it’s not  right.”\nRhodey sucks in a sharp breath.\n“I’m a monster, Rhodey.”  Toni presses on.  “I took his aspect from him, pulled the Death from him until he’s Hades in memory and spirit only.  I’m a goddess of Life and Death now, an avatar of two opposing aspects.  And one of those is an aspect I stole from another god.  Zeus would have had me killed for what I’ve done.”\n“Don’t say that,” Rhodey’s voice is harsh as he pulls her away from his chest until they’re looking each other in the eye.  “Don’t ever call yourself a monster again, Toni. Not ever. I don’t care what you’re the goddess of, or how many aspects you have or whatever.  You don’t ever say that again.”\n“I’m sorry,” Toni swallows back a sudden rush of tears.  “It just … it  hurts, Rhodey.  It hurts  so bad.  Like nothing I’ve ever … it’s worse than anything I’ve ever felt.  I’m not meant to hold Death like this and it wants  out.  It wants a new host.”\n“Then give it to me,” Rhodey says.\nToni freezes.\n“What?”  It’s more of a breath than a whisper but somehow it’s still loud, still echoes around them where they’re pressed together in the dry, warm safety that exists beneath the tree Toni had blessed herself.\n“Give it to me,” Rhodey repeats.  “Death or whatever it is. If it’s hurting you so bad, if holding it’s doing this kind of damage, causing you this kind of pain, then don’t hold it anymore.  Give it to me.”\n“Rhodey …”\n“Don’t fight me on it, Toni,” Rhodey cuts her off before she can say anything else.  “I want it. I want to do this for you. Because it’s me and you, baby girl, until the day we die.  And if that means becoming Death or a god or anything else, well, I made that choice years ago. Because I’m gonna do whatever I have to do to stay by your side, to keep you safe.”\nFor a split second Toni is breathless, speechless, and then she moves.  She throws herself across the small bit of space Rhodey had put between the two of them.\nAnd, as always, Rhodey just pulls her closer.\n“I love you,” Toni’s voice breaks on a sob as she clutches Rhodey to her, face buried in his shoulder.  “I love you so much.”\n“Shh,” Rhodey soothes her, one hand rubbing circles against her spine as the other comes up to cradle the back of her head.  “Oh Toni, baby, I love you too. You know that.”\nShe does.\nShe really and truly does.\nRhodey loves her and Toni loves Rhodey in return.\nShe adores him with every inch of her being and has blessed him with Life to keep him by her side.\nAnd that’s one of the very reasons why she can’t give him what he’s asking for.\n“I can’t give you Death,” Toni whispers against his throat.  “You can’t hold it.”\n“What?”  Rhodey sounds puzzled.  “Why not?”\n“Because I already gave you Life,” Toni admits quietly.  “So you could stay with me, for as long as you want. It’s why … it’s why the fall didn’t paralyze you, Rhodey.  Why you healed so quickly. Because I blessed you, right after the invasion. And someone blessed by Life can’t hold Death.  Not like that.”\n“Fuck,” Rhodey sighs.  “Thank you, Toni, for saving me.”\n“I'll always save you, Rhodey.  Just like you always save me.  Besides,” Toni draws back a bit, manages to smile at him through her tears.  “You couldn’t be Death anyways.”\n“Why not?”  Rhodey looks just the slightest bit offended.  “I’d make a good god of Death or the Underworld or whatever.”\n“Because Life and Death are  lovers,” Toni reminds him softly.  “And you can’t think about me and sex in the same sentence without getting that face,” Rhodey grimaces in distaste and Toni can’t help but smile, “that one right there.”\nIt’s the truth too.\nTheir relationship is not and never will be what Death would require it to be.\nLife and Death are lovers after all, mated and married in all ways, and that will never be Toni and Rhodey.\nFor all the love they have between them there has never been that spark, that blossom of  desire.\n“Fine,” Rhodey finally admits defeat.  “I guess at least I really will get to stay with you huh?  And we’ll figure out a way to fix this Toni, I promise. There’s no way in hell I’m gonna just sit back and let you suffer like this.  Not if I can help it. So we’ll find a way.”\n“Thank you,” is all Toni can think to say.  “Thank you.”\nRhodey doesn’t say anything else, just pulls her even closer until she’s sitting in his lap, and presses a kiss to her temple.\nThey sit there together, watching the storm from beneath the safety of the tree.\n“You know,” Rhodey says after a moment, voice rueful, “if I’m remembering my mythology right, and I am cause I’ve brushed up on it over the years since my best friend’s an actual  goddess, Zeus was a major dick.  So I wouldn’t really hold much to his opinion if I were you.”\nToni can’t help but laugh.\n“Yeah,” she agrees softly.  “Yeah he really was.”\nThe silence that falls between them again is soft and gentle.\n“What did I do wrong?”  Toni finally whispers the question that still haunts her to him.  “Why did … why doesn’t Steve want me anymore?”\n“You didn’t do anything, Toni,” Rhodey tells her, lips pressed against her hair.  “He’s an idiot. That’s all there is to it. No matter what his reasoning may or may not be he’s still an idiot for turning away from you.  All of them are damn fools.”\nAnd laying there against Rhodey’s chest, sheltered beneath the protective canopy of the pomegranate tree, Toni lets herself believe he’s right.\nIf even only for a moment.\n~~~\nSix months in and Toni wears flowers in her hair now.\nShe glides her way through her garden and lets JARVIS whisper in her ear about which blossoms he wants her to wear for the day.\nSo she wears black rosebuds and golden carnations and perfectly formed crimson lilies.  Once, just to see the smile on Rhodey and Vision’s faces, JARVIS has her wear a wreath of forget-me-nots woven into her curls.  They’re a vibrant electric blue that matches both her eyes and the glow of the arc reactor.\nPerfect blossoms in all of the colors that have come to define her in this life.\nThe press has a field day, snaps photo after photo of her new accessories every time she makes a public appearance.  They rave on and on about where she might have gotten them, about the unusual and unnatural colors, about whether or not they’re real or something she specifically had engineered.\nMore than one tabloid and paper wonders about whether or not romance is in the Iron Queen’s life because why else would she wear flowers in her hair again?\nThe press is, as always, clueless as to the truth of Toni’s motivations.  They don’t understand the true symbolism of the blossoms in her hair or why Toni wears them.\nBut that doesn’t matter.\nShe doesn’t wear flowers in her hair for them anyways.\nShe does it for JARVIS, for Rhodey and Vision, for Pepper and Happy.\nFor her little family who knows her and smiles everytime they see her newest blossom, each fantastic in their own way.\nShe does it for the bots who make her hair pins topped with trailing strings of metal flowers, each meticulously crafted.\nShe does it for Harley who video calls her once a week and talks about going to school in New York.  Who saw photos of her in some tabloid or another and sent her an antique comb topped with a golden day lily that he saved to get for her for the anniversary of the day they met.  Toni wears it in her hair the next time she goes out and just laughs when he calls her back to scream about the busted up classic Camaro she had delivered to his house for him to fix up.\nShe does it for the Spiderling who gives her street vendor flowers with half crushed petals without understanding Toni’s true nature, without hearing even a  hint  about who and what she really is.  All the kid knows is that Toni has a thing for flowers, that they make her  smile.\nAnd, most of all, she wears them for herself.\nFor the Toni Stark she is now.\nFor the Persephone she’d once been.\nFor the Kore that will always linger within her, just below the surface.\nShe wears them because they are now, as they’d once been, a crown she made all on her own.\n~~~\nA year in and the newly formed Accords Committee does the one thing Toni has simultaneously been working towards and dreading.\nThey call the Rogues home.\n~~~\n“I will allow no harm to come to you, Miss,” JARVIS warns her softly as they stand on the tarmac waiting for the quinjet to finish landing.\n“I know J,” Toni answers softly even as she brings a hand up to cover the one Vision’s laid on her shoulder.\n“We are family,” Vision picks up on JARVIS’ thread of conversation easily enough.  “Family protects their own.”\nThere’s a hardness to Vision now that wasn’t there before, a steadiness that had blossomed after Siberia.\nToni loves him dearly even as she mourns the loss of so much of his innocence.  He’s so young still. He should have never been faced with such burdens, such heartache.\n“First one to step a fucking  toe out of line gets to meet me out back,” Rhodey half snarls, his own rage over Siberia and what had come before still lingering.\n“We’ll handle it,” Toni tells the three of them, “like we always do.”\n“Indeed,” Vision agrees.\n“Together,” JARVIS whispers in her ear.\nToni loves them all so very much.\n~~~\nOnce the fanfare is done and the press leaves Toni sees the way Steve’s eyes catch on the flowers in her hair.  She sees the guilt that has become so much a part of him well up in his face for a split second before he banks it down.\nBut, a year apart and the memory of his shield slamming down into her chest over and over again still lingering in her mind, the image of Sharon Carter in his arms lingering in her  heart, Toni finds that she just …  doesn’t care.\nIt’s surprisingly easy to pass him over.\nIt also feels a little bit like freedom.\n~~~\nThe first few days are the worst as the Rogues settle in.\nBarton’s anger is like fire, hot and raging and uncontrollable.  Rhodey meets it head on with a sneer, his disdain cold enough to snuff out even the brightest of blazes.\nMaximoff’s hatred for Toni is like a great scarlet wave.  Vision steps before it, before Toni, and plants himself like a mountain in Maximoff’s path.  An immovable object to her attempts at being an unstoppable force.\nToni isn’t the same as she’d once been, isn’t as vulnerable to any of them really as she’d been in the past, but she still appreciates the devotion her family shows her.\nStill cherishes their love and the protection they offer her so very easily.\nRomanov is cooler, calmer, but Toni isn’t fooled by her any longer.  Isn’t stupid enough to think that, despite everything, Romanov might actually have Toni’s back on anything.  JARVIS handles her attempts to access any kind of classified information with a viciousness that makes Toni proud.\nIt also leaves Romanov leery of anything electronic in the Compound for days afterwards.  Which is basically everything.\nWilson and Lang are simpler, easier to deal with due to the lack of any real connection between them and Toni. A long look from Toni or Rhodey is enough to get both of them to back down.  Lang especially as he is, for some reason, abjectly terrified of both of them and Vision too.\nBut surprisingly enough, or perhaps not, the one Toni has a hard time skipping past, is  Barnes.\nThere’s something just a shade off right with him.  Something dark and shadowed.\nClear headed, free from the rage and the betrayal that had clouded their last meeting, Toni can practically taste the way the shadows cling to him.\n~~~\nAnd after a few days Toni realizes something profound about Barnes.\nJames \"Bucky\" Barnes has been touched by Death.\nAnd some primal part of Toni finds that …  intriguing.\n~~~\nToni has no real interest in fighting with the others unless they push her or her family.\nSo the time she doesn’t spend at press conferences or galas or locked in her workshop or curled up in Rhodey or Vision’s rooms, she spends out in her garden.\nShe tends to her plants or she settles down beneath the pomegranate tree and works on designs on a tablet with JARVIS in her ear.\nSometimes she even lays out on one of the oversized lily pads and floats around the pond, eyes closed and a hand trailing in the water for the koi to nibble at her fingers.  The peace and safety of her garden settles over her like a balm so great that not even her still instinctive fear of being submerged can touch her.\nIn this place, surrounded by her creations, Toni is  safe  in a way she’s only ever found in Rhodey’s arms.\n~~~\nA month or so into the new cold war that’s settled over the Compound with the arrival of the Rogues Toni catches Barnes watching her.\nThe potted plants that dot the Compound now, gifts from Happy and Pepper, whisper to Toni about him but Toni doesn’t need them to.\nShe can feel his eyes on her like the touch of fingertips down her spine.\nUnsure of what, exactly, he wants from her Toni ignores him as best she can.\nToni has no interest in getting closer to yet another ghost chipped free from the ice, no matter what his intentions might or might not be.\nNo matter how something inside of her thrums in awareness whenever he’s nearby.\n~~~\nAnother month filled with shitty training sessions and frigid silence between Toni’s family and the Rogues passes.\nAnother month of ignoring Steve’s guilty glances and Maximoff’s sneers.\nAnother month of Barnes lingering on the edge of every room Toni’s in, eyes watchful and curious.\nAnother month of pain, harsh and spitting, as Death claws at her insides with renewed vigor.  There’s an anger to it now that wasn’t there before, a rage that unsettles Toni just a bit.\nToni wonders how long this impasse they’ve all settled into will last before the inevitable explosion.\nShe wonders if she even cares about who, besides her family of course, will make it out of the blast.\nShe wonders why she ever did in the first place.\n~~~\nIt takes Barnes another two weeks before he finds his way to her garden.\nThe holly hedges twitter to Toni about Barnes, about the man with the metal arm who watches her from a distance.\nToni pushes down the memories of another man, dark and foreboding like Barnes himself, who’d once watched her from a distance too.\nThat was another life and Toni was, in so many ways, a different person then.\nHad made different choices.\nOnce Kore had stepped freely into the Underworld, had found a beauty in what she saw there and decided to stay.  Had chosen love above all else and was gifted a kingdom in the process.\nToni has no interest in doing the same thing again.\nBesides, touched by Death or not, Barnes is no  god.\nHe rules no Underworld, he has no aspect.\nHe’s more than a mortal of course, the serum guarantees that, but he’s not  divine.\nToni ignores the part of herself, that hungry primal part, that says he so easily could be.\nShe is Life, is Creation.\nThere is little she cannot do if she wills it.\nIf she wants.\n~~~\n“You know,” Toni speaks up without even bothering to turn, her attention firmly on her tablet, “whatever it is you want from me, isn’t going to happen if you don’t speak up.”\nThere’s a moment of silence.\n“What makes you think I want anything from you?”  Barnes’ voice is deep, raspy, a hint of an accent decidedly  not Brooklyn in origin clinging to every word.\nIt’s a stark contrast to how he’s sounded the few times she’s heard him speak around the others.\nShe can’t help but wonder what that says about him.\n“Everybody wants something out of me,” Toni points out with a deliberate sort of careless honesty. “No reason for you to be here otherwise.”\n“I’m sorry,” Barnes says after a long moment of silence.  “For what I did. To you, to everybody HYDRA ever pointed me at.  I’d take it back if I could. But I can’t.”\nToni’s eyes drift shut for a split second.\nShe breathes.\n“You were a weapon, Barnes, a gun,” Toni finally says.  “It wasn’t your fault what HYDRA chose to make you do. Who they made you hurt.  All you can do now is pick up the pieces and make sure that the only hands that fire you from now on are your own.”\nBarnes doesn’t say anything to that.\nInstead he stares at her for a few, silent minutes, and then he leaves.\nToni doesn’t watch him go but the flowers whisper to her of his passing all the same.\n~~~\n“Give me the word,” JARVIS says softly in her ear the third time Barnes breeches the edge of her garden, “and I will make him disappear for you, Miss.”\n“It’s alright J,” Toni tells him with a small smile even as she leans on the vine bench she’d crafted against the trunk of the pomegranate tree.  “Pretty sure Rhodey’s got dibs anyways.”\n“I am sure Colonel Rhodes would be inclined to share,” JARVIS tells her waspishly.\nToni just smiles again and then wipes her expression clear as she settles in to wait.\nA few moments later Barnes steps beneath the canopy of the tree.  He naturally lingers in the shadows of the branches but Toni can see those blue-grey eyes focused on her intensely all the same.\nFor a moment they just stare at each other.\n“The others say you and Steve are gods,” Barnes finally breaks the silence.\n“Gossipy little things aren’t they?”  Toni snips back. “I bet they’ve told you all sorts of things about me.”\n“They say you’re Hades reborn.”  Barnes replies bluntly, head tilted a bit to the side but eyes still almost wolf like in their watchfulness.  “That you’re Death and Steve’s Life. That you’re dark and dangerous and that I shouldn’t trust you.”\n“Do they now?”  Toni lets a smile, razor sharp and vicious, blossom across her crimson painted mouth.\n“I think they’re full of shit,” Barnes says.\nToni goes still.\n“I’ve known Steve for almost a century now,” Barnes says as he steps even further beneath the canopy.  “And in all of that time the only things he could ever make come to life was his art and fist fights.”\n“There a point to this little history lesson of yours?”  Toni asks even as she feels the way her heart begins to pound in her chest.\n“I got out from under HYDRA” Barnes keeps going, “and I stepped out into the world as a person instead of an Asset for the first time in …  decades.  And everywhere I looked ... there you were.  Your company, the armor, some new revolutionary tech in this field or that one.  All of it with your name on the side.”\n“Your  point,” Toni stresses again.\n“My point is that I look at the world these days and all I see are your creations,” Barnes tells her.  “And I can’t understand why anyone would ever think you’re anything, anyone, but Life.”\nToni’s breath shudders in her chest.\n‘Oh,’ Toni thinks just a tad bit thrown, ‘oh.’\n“I have no idea what you’re talking about,” Toni finally manages to say.  “Haven’t you heard? I’m the Merchant of Death. Sounds pretty obvious to me.”\n“The way I see it,” Barnes says as he steps even closer until he’s hovering right beside where Toni’s sitting, “bombs and guns have to be created too.  And everyone knows SI wasn’t just about weapons, even before you put on the armor. Intelli-crops right? That’s what you call them isn’t it? Those engineered plants of yours?”\nToni says nothing, just stares up at Barnes, expression blank and head tilted up proudly.\nBarnes stares right back at her for a long moment before he takes a slow step forward and leans down closer to her.  They’re a handful of inches apart as he reaches out to place something on the vine crafted bench beside her, the black and gold of his new arm glinting in the fading sun.\nToni doesn’t look down, just keeps her eyes trained on him.\nHe stays there for a long moment, eyes half lidded and hair swinging down to brush against his jawline, before he finally blinks and straightens back up.\nThen, with one last nod in her direction, Barnes turns and walks away.\nHeart pounding, Toni waits until the holly hedges whisper that he’s left the garden before she looks down.\nAnd there, on the seat of the bench beside her, is a single asphodel blossom.\nWhen Toni reaches out to touch its petals her hands  shake.\n~~~\nAfter that it’s as if some sort of signal has been given to Barnes because he’s around every corner Toni turns now.\nBut, unlike Steve who still stares at her guiltily every time they’re in the same room together, Toni doesn’t ignore or try to avoid him.\nThere is something about him, something that Toni thinks she almost recognizes.\nAnd there’s one more very important thing about Barnes.\nWhen he’s nearby the Death inside of Toni is calmer, quieter.\nIt’s almost …  nice.\n~~~\nEventually Barnes slinks his way down to her workshop under the guise of arm maintenance that they both know he doesn’t need.\nBemused, Toni lets him inside anyways.\nHe’s wide eyed and almost gleeful as he takes in the holograms and the projections, the display cases with the first iterations of the armor in them that Toni has kept for a number of reasons and her various tools and gadgets.\nAnd then he sees the bots.\nToni watches, breathless, as he holds his metal arm out at his side, a small smile creasing his face as he lets DUM-E and U inspect it.\nHer heart clenches sharply in her chest at the way he doesn’t get upset when the ever rage filled Butterfingers reaches up and tugs harshly at his hair with one hand while the other clicks angrily in his face.\nInstead Barnes just laughs.\n“Don’t worry,” he faux whispers to Butterfingers but those bright eyes of his are trained on Toni instead, “I ain’t here to cause trouble.”\nToni isn’t all that sure if he's telling the truth.\nBut she also isn't sure that he's lying either.\nA part of her is pretty sure that Barnes might not be aiming to cause trouble in so much as he is trouble.\n~~~\nThere’s another asphodel blossom waiting on her workbench after he leaves.\nToni didn’t see him drop it but she can’t help the way she brings it up to her face for a split second before she stops herself.\nShe doesn’t throw it away though.\nCan’t bring herself to for some reason or another.\nInstead she tucks it into the vase beside the other now eternally fresh flower he’d given her.\n~~~\nSteve tries to stop her in the hall a day or so later, reaches out and wraps gentle fingers around her wrist as she walks past him.\nToni stops, looks down at where he’s holding her, and then back up at him, eyes narrowing sharply.\nIn her chest something  dark and deadly rattles with vicious intent.\n“Toni,” Steve starts to say, “I wanted to tal-”\nSteve cuts himself off with a sharp yelp, dropping her wrist as he pulls his now bleeding hand away from her.\n“Don’t,” Toni tells him softly, voice dangerously even, “touch me.”\nShe doesn’t bother to wait around to see what he wanted.\nInstead Toni walks away, head tilting to the side to allow the loop of jade vine flowers she’d been wearing around her wrist to creep up and settle in her hair instead.\nShe leaves Steve bleeding behind her.\nJust as he had once left her.\nToni thinks maybe it should feel like some small smatter of justice.\nIt doesn't.\nAll it really makes her feel is  tired.\n~~~\n“What’s going on with you and Barnes?”  Rhodey asks her one lazy afternoon between meeting and training and his ever present war with not snapping Barton or any of the rest of them in half.  “JARVIS said he’s been showing up here and don’t think I haven’t seen him staring at you around the Compound. Hell he spends half our training sessions staring at you.  Way he’s going he’s gonna lose that other arm if he ain’t careful.”\nThey’re laid out in her garden on the sunlit edge of the pond.  Her hair’s down and flowing across his lap as he weaves flowers into the great mass of silken curls.\nOff to the side Vision floats lazily in the air, sketchbook in hand as he draws the various birds that come and go from the little community of bird mansions he, Rhodey, and Happy keep adding to.\nToni resolves to grow even more things to draw in more wildlife.  Vision will, she’s sure, appreciate a small butterfly haven.\nAll in all it’s a peaceful moment that Toni wants to last forever even as she knows it won’t.\nShe’s not that lucky, goddess or not.\n“I don’t know,” Toni answers him honestly.  “He’s just …  there.  Every time I turn around.”\n“He bothering you?”  Rhodey asks with a deliberate sort of nonchalance.\n“No,” Toni smiles as her eyes drift closed.  “You and J can stand down, honey-bear. Barnes is … I’m not sure what he is, exactly, but I don’t think he wants to hurt me.”\n“You sure?”  Rhodey’s hands are gentle as he strokes his fingertips across her temples.  The leather and spice scent of him carries the smallest hint of something green and growing now, the mark of her blessing.\n“He knows what I am.   Who I am,” Toni admits softly as she opens her eyes to stare up into Rhodey’s face.  “He just … he said he couldn’t see how anyone could think I was anything but Life.”\nSomething complicated and fierce flashes across Rhodey face before it softens, fades into something that looks almost like acceptance.  Toni isn’t sure what, exactly, he’s thinking about.\n“Bout time somebody else around here proved they aren’t a total fucking idiot.”  He finally settles on saying. “But I’ll still drop kick his ass into the sun if he fucks up.”\n“I know you will,” Toni agrees.  “Though JARVIS might find a way to beat you to it.”\n“It would be my genuine pleasure, Miss,” JARVIS says firmly in her ear.\n“Me and J can share,” Rhodey compromises.  “He can chart the trajectory and I’ll do the kicking.  It’ll be fun.”\n“Such  violence,” Toni teases softly.\n“There’s not much we wouldn’t do to keep you safe, Tones,” Rhodey says seriously.\n“I know.”  Toni smiles up at him, chest warm despite the ever present pain.  “It’s just … he brings me flowers Rhodey. Asphodels. One each time he finds me here or in the workshop.  I don’t know why, but he brings me flowers.”\nThere’s a moment of drawn out silence between them as Rhodey brings another blue petaled rose up to weave into her hair.\n“Maybe he’s really not an idiot after all,” Rhodey muses, voice absent as his fingers move, “guess we’ll just have to wait and see.”\n“Tell me the story,” Barnes asks quietly from where he’s sitting a few feet away from her on the floor of the workshop.  There’s a thin paperback book in his flesh hand and his metal arm is propped up on his knee so that he and DUM-E can keep playing whatever strange new hand game they’ve come up with now.\n“Which story?”  Toni asks absently as she manipulates the hologram in front of her, humming agreeably as JARVIS inlays the automated corrections they’d hashed out earlier.\n“The one about how you and Stevie first met,” Barnes says.\nToni goes still for a split second before she forces herself to keep going, hands sliding across the projections in front of her.\n“Figured someone would have told you all about the invasion and the helicarrier by now,” Toni answers lightly, attention purposefully focused on her work.  “Gossipy as they all are.”\nIt doesn’t matter though.\nAs always she can feel Barnes’ eyes on her back like fingertips trailing down her spine.\n“Not that story,” Barnes clarifies even though they both know she knew that to begin with.\nThey both know just what Barnes is asking her to talk about.\nJust what tale he wants her to weave for him.\n“Sorry, Red Dawn,” Toni slants a look at him over her shoulder, “you’ve got to level up a bit more before you unlock my tragic backstory.  That or ask your BFF. Maybe he’ll tell you the truth.”\nToni’s bitterness is apparent but they both know that Steve isn’t going to tell anyone, not even Barnes, the truth.  Isn’t going to acknowledge what he’s spent so long ignoring.\nIsn’t going to admit to what he has and has not done where he and Toni are concerned.\nSo if Barnes wants to know the story then he can do his research, as flawed as it will inevitably be with the way the truth has become twisted and changed over time.  Fact becoming myth, becoming legend and fairy tale through some kind of giant, historic game of telephone.\nWhispering the truth behind the lies to Barnes isn’t something Toni feels like doing at the moment.\n~~~\nToni finds her asphodel, the one she won’t outright admit to always being on the lookout for after Barnes leaves the workshop or the garden.\nIt’s tucked between the pages of Barnes’ book.\nToni plucks the flower from the book carefully and slides it behind her ear.\nFor safekeeping of course.\nNo other reason.\nThe book she gives to Butterfingers who is more than happy to rip it into a shower of confetti once she gives him the go ahead.\nShe might not be willing to tell Barnes the true story at the moment, if ever, but that doesn’t mean she’ll allow garbage like what he was reading into her workshop.\n The Rape of Persephone  indeed.\nSuch propagandist bullshit.\n~~~\n“What’s the deal with all the flowers, Stark?” Barton asks when they’re all packed in the back of one of Toni’s massive limousines after a day of playing nice in front of the press.  His eyes are trained on the line of trailing metal snapdragon blossoms that sway off of one of the hair sticks the bots had made her and the gloriously vibrant dwarf sunflower JARVIS had chosen for her that morning.\n“Don’t see how that’s any of your business Barton,” Toni cuts back calmly, fingers dancing across her tablet screen.\n“What?” Barton bites out lowly.  “Can’t make conversation these days?  Or are you too good to talk to the rest of us?”\n“Oh she’s definitely too good to talk to you, Barton,” Rhodey cuts in from her right, hand coming up to play idly with his tie and the small but brilliant crimson phlox flower that’s been pinned there.  “But if you wanna have a conversation that bad I’ll be free for the rest of the afternoon. We can spend some quality time in the gym again.”\nBarton scowls but doesn’t rise to Rhodey’s obvious challenge.\n“Probably just trying to get Steve’s attention anyways,” he mutters as he settles back into his seat between Romanov and Maximoff.\nBeside Toni, lip curled up in a small sneer, Rhodey snorts and goes to say something again only to be cut off.\n“Thought your name was Hawkeye?”  Barnes cuts in from where he’s half sprawled beside Steve and, coincidentally, directly across from Toni.  “Might wanna get those eyes checked,  boy.”\nThe limousine goes silent and when Toni looks up from her tablet Barnes is staring directly at her, eyes half lidded but bright.\nBeside him Steve’s hands are clenched so tightly against his knees that his knuckles have gone white.\nFurther down the seat, a flash of interest slides across Romanov’s face before she brushes it away.\nRhodey settles back against the seat again, an arm thrown casually across Toni’s shoulders.\nWhen she glances up at him, brows arched in question, he just winks and goes back to playing with a few loose curls that have escaped her admittedly massive bun.\n~~~\nA day or two later Romanov tries to slither snake like into Toni’s garden.\nToni, relaxed atop a lily pad with Vision’s head in her lap as Rhodey floats peacefully in the water beside them, doesn’t care.\nThe holy hedges won’t let her in anyways.\nToni has many creatures living in her garden, from swarms of ladybugs and bees to more than one large writing spider who spins her delightfully intricate webs everyday.\nBut there’s no room for Black Widows in the tranquility Toni has built for herself and her family.\nNo room for people Toni cannot trust inside of the sanctuary they have created.\nThe holly hedges twitter and sigh as Barnes slides in a few minutes later looking more than a bit smug.\nToni ignores what, exactly, that says about how she sees him.\n~~~\nBarnes doesn’t ask after his book the next time he comes down to the workshop.\nInstead he just smiles, a barely there whisper of an expression.\nAnd when he leaves, Toni’s asphodel is left resting safely on Butterfingers’ support strut.\n~~~\n“Toni,” Steve calls out to her as she moves through the kitchen.\n“What?” Toni asks as she pauses and turns to look at him, a cup of coffee in one hand and a large bag of the hard candies Barnes seems to prefer in the other.  The container in the workshop is empty.  Again.\nSteve comes to a stop a few feet away from her, hands pointedly held up in the air at his sides.\nIt’s a smart move because the Death that’s been rattling around inside of her hasn’t grown any less viscous when he’s around.\nIf anything it’s grown progressively angrier.\nThat coupled with the blue-grey petunias she’s wearing around her wrist means that it’s better if Steve keeps some distance between the two of them.\nToni’s composure is second to none these days in most cases but there are other forces at work within and around her at the moment.\nAnd petunias are, to be completely honest,  spectacular assholes.\nWhich, in hindsight, is probably why Rhodey likes them so much.\n“I thought we could,” Steve stops, clears his throat, and pushes forward, “I wanted to talk to you.  About … about a lot of things.”\nToni stares up at him silently for a long moment.\n“What’s my name?”  She finally asks, voice dangerously soft.\n“What?”  Steve looks taken aback.\n“What. Is. My. Name?”  Toni spaces each word out deliberately.\n“I,” Steve swallows, “Pe…”\nLang turns the corner into the kitchen then and stumbles to a wide eyed halt at the sight of them squared off against each other.\nSteve’s mouth snaps abruptly shut.\n“Well?” Toni prompts him.  “ What’s the matter? Three-headed dog got your tongue?”\n“Toni,” Steve sighs, that familiar and  hated guilt in his eyes, “please just …”\nToni cuts him off with a raised hand.\n“Yeah,” she says, “that’s just what I thought you’d say.”\nAnd then she turns on her heel and saunters back out of the kitchen.\n~~~\n“You don’t eat the fruit here do you?”  Barnes asks a few days later.\nThey’re in the garden again of course.  Toni’s settled on the bench beneath the pomegranate tree and Barnes is laid back on the grass a few feet away from her, face in shadows and hands behind his head.\nToni looks up at the tree that is, as always, full to bursting with fat, ripe pomegranates, the skins of the fruits a deep, rich crimson in color.\n“No,” Toni tells him softly.  “I don’t eat pomegranates anymore.”\n~~~\nIt’s almost feels inevitable really, what happens.\nRhodey’s gone for the week, off to a conference with the Air Force, and it’s Vision’s turn on the rotation of checking in with the UN in person.  They’d protested, viciously, against leaving her at the Compound alone.\nToni had shooed them away with a pointed tap to her earpiece, her permanent connection to JARVIS, and a reminder of the fact that she could have the armor to her in  seconds if anything happened.\nSome things had to come before their desire to stay together and this was, unfortunately, one of them.\nBesides, Toni is the Iron Queen, is  the  Stark, is a  goddess, fear of confrontation and danger doesn’t stop her from doing anything.  It never really has.\nBut that doesn’t mean she doesn’t wish one or the both of them were with her at the moment.\nBecause it  hurts so badly.\nDeath thrashing in her chest, agony arcing through her like lightning, Toni hangs limply in the armor’s arms as JARVIS engages the suit’s reserve power and uses it to carry her silently through the Compound.\n“It will be alright, Miss,” JARVIS whispers in her ear, voice soft and soothing.  “This will pass, as it always does. I will get you to the garden and this will pass.  I swear it.”\n“Hurry,” Toni whispers before she bites at the inside of her cheek until she tastes blood in order to keep from screaming.\nAnd that, of course, is when Barnes chooses to melt out of the shadows of the hall.\n“What’s happening?”  Barnes bites the words out, accent thick, as he steps in front of the armor.  “Lepestok, what’s wrong?  Did someone attack you?”\nThere’s something vicious and deadly in his voice then.\n“Move, Sergeant Barnes,” JARVIS’ voice is harsh and cold as it spills out of the armor’s external speakers.  “Or I will not hesitate to  go through you.”\nBarnes steps to the side and lets the armor pass but he keeps pace with it, striding alongside as JARVIS makes it out onto the grounds.  Even when JARVIS takes to the air, relying on the back thrusters to keep them balanced, Toni can see Barnes following below them at a steady clip, face tilted up as he watches their progress.\nJARVIS sets them down on the edge of the pond a minute or so later.  The hands of the armor are exquisitely gentle as he places her on the grass and then smooths the hair that’s fallen from her bun back away from her face.\nToni buries her fingers in grass that blackens and then regrows and then blackens again rapidly at her touch.  She sees the world around her as if through a haze, grey seeping in around the edges and pain eating at her with every breath she takes.\n“What’s wrong with her?”  Barnes is there in the next second, dropping silently to his knees beside her, flesh hand reaching out towards her face like he can’t help himself.\nThe whine of the repulsor charging up is loud in the calm of the garden.\n“Step away from her,” JARVIS orders, one of the armor’s gauntlets held only inches away from Barnes’ temple.  “I will not allow you to harm her. She has suffered enough at the hands of ungrateful interlopers as it is.”\n“Look,” Barnes bites out softly, “I know I’ve only got half the story.  And I know Stevie and the others … I don’t know what the fuck is wrong with them but I know they’ve hurt her.  I know I did too. But you’ve got to trust me when I say I will  never hurt her again, not like that.”\n“And why should I believe you?” JARVIS demands, gauntlet not wavering an inch.\n“Because I know death, lived and breathed it under HYDRA’s thumb, and she’s not that.  She’s the most beautiful thing I’ve seen in a  century,” Barnes voice is low, raspy, but he makes steady and even eye contact with the armor’s helmet.  “Inside and out. She’s …  precious.  And I don’t have a lot left in my life that I would consider either.”\nThere’s a moment of tense silence.\n“Do not cause me to regret this trust, Sergeant Barnes,” JARVIS says as he lowers the armor’s arm.  “Be gentle with her, she is ...  sensitive in these moments.”\nBarnes nods and then he reaches out his hand and glides the tips of his fingers across the arc of Toni’s cheek.\nHis fingertips are soft and warm, the serum healing any calluses away before they can form.\nToni chokes out a gasp at the touch, back arching up off of the ground.\n“Fuck,” Barnes bites out as he snatches his hand away from her.  “Fuck, lepestok, petal, I’m sorry.”\nToni lashes a hand out and grabs Barnes’ flesh hand in her own, tangles their fingers together and refuses to let them go.\n“Don’t go,” Toni pants out, senses flooding with endorphins and mind  whirling.  “Don’t go, Barnes.  Stay.  Stay.”\n“I’m here,” Barnes says as he squeezes her hand gently.  “But I’m hurting you, so you need to let me go.”\n“No,” Toni manages to say, “no.  Barnes,  James, please.”  It’s as close to begging as Toni has come in longer than she can remember.  “It doesn’t hurt, when you touch me.”\nAnd it’s true.\nAs soon as Barnes’ skin had touched hers Death had calmed, had stopped thrashing and instead almost seemed to purr.\nEven now, with her hand in his, it’s  calm.\nThe cessation of pain makes Toni feel abruptly and totally  drunk.\n“Hold her,” JARVIS commands then.  “If your touch brings comfort then you  will hold her.”\nAnd before Toni can even think to protest on principle alone, Barnes is moving.\nHe scoops Toni up off of the ground and settles her down in his lap, face pressed against the warm expanse of his bare chest and their fingers still tangled together.  Beneath her ear his heart beats fast and heavy.\nToni huffs out a weak chuckle and takes the opportunity to breathe in the scent of him, gun oil, leather, and something cold and sharp like mint, and relish being pain free.\nBarnes holds her there on the grass of the garden, JARVIS standing guard over them in the armor, for the longest time.\n“You know,” he finally breaks the silence, “I’ll hold you for as long as you want, but I think it might be a good idea if someone tells me what’s going on.”\nToni knows he’s right, knows that he deserves at least the bare bones of an explanation.\nBut she’s so  tired.\n“J,” Toni sighs, “tell him.”\n“Are you sure, Miss?”  JARVIS questions, protectiveness in every syllable.\nToni just gives him a thumbs up and turns her face further against Barnes’ chest.  She’s exhausted even if she isn’t hurting anymore, and all she wants in this moment is to sleep.  To no longer worry about all of the things that drag at her during the day. All of the hurt and the bitterness and the unrelenting  pain.\n“As you wish,” JARVIS agrees.  “This Sergeant Barnes, is what happens when promises are not kept.  This is the result of the cowardice of your  Captain.”\n“Stevie did this to her?”  Barnes’ arms tighten around her for a split second, his muscles tensing and the vents of his metal arm hissing angrily.\n“In a way,” JARVIS agrees.  “The Miss is, as you know,  Life.  And Life is not meant to carry Death.  But your Captain was no longer worthy and so she took it from him.  And now it torments her.”\n“Explain.”  Barnes bites the word out.\nAnd so JARVIS does.\nToni fades in and out as the conversation carries on, aware only of the steady, comforting sound of JARVIS’ voice and the rhythmic beat of Barnes’ heart beneath her ear.\nOccasionally Barnes’ speaks too, his voice a harsh, sharp rumble beneath her ear.\nBut otherwise Toni just …  floats.\n~~~\nThe world around her is a haze and Toni feels as if she’s gliding through it, lighter than air.\nShe thinks she might be moving, but she’s too tired to really focus on it.\nBesides she can hear the familiar thump of the armor striding along beside her so she knows she’s safe.\nJARVIS will watch over her, as he always does.\n“I like the way you say my name, flower,” Barnes whispers, voice coming to her as is from a distance as he curls her closer to his chest.  “Say it again,  please.”\n“James,” Toni whispers softly as sleep begins to raise up and take her away again.  “James.”\n~~~\nToni wakes up in her own bed.\nShe feels rested, feels calm and content in a way she hasn’t truly felt since before she’d begun to pull the Death from Steve’s bones.  She’s warm and comfortable and the scent of flowers is heavy in the air around her.\nWhen she turns her head she finds that the pillow beside her is covered in asphodel blossoms.  Each one perfectly formed and gloriously fragrant.\nAcross the bed the armor stands in the corner, JARVIS watching over her in a very physical sense.\nAnd when she looks to her other side Barn- James  is there.\nHe’s sitting on the floor, side propped against her bed, and flesh arm stretched up across the mattress so that their fingers are still tangled together.\nToni lays there for the longest time and watches him sleep.\nAnd when something soft and sweet and  lovely blossoms to life inside of her chest, Toni doesn’t even try to fight it.\n~~~\nRhodey and Vision are both back in the Compound by early that afternoon.\nToni knows as soon as she sees them that JARVIS has already told them about what happened.\nBut, wrapped in Rhodey’s arms and with Vision hovering protectively over both of them, she can hardly complain.\n~~~\nAlmost as if her vulnerability has shifted something within him, there’s an even more pronounced sort of softness to James whenever he looks at her now.\nA gentleness that isn’t at all at odds with that hint of something dark and almost  hungry that occasionally slides across his expression.\nInstead the two go hand in hand, a perfectly harmonious sort of duality.\nToni does her best to pretend like she doesn’t find that vastly appealing.\nShe fails.\n~~~\nThe next time Toni sees Rogers he’s sporting a rapidly healing black eye and what looks like a broken nose.\nToni just blinks, looks past him to where James is standing, arms crossed and glowering, and then goes on her way.\n~~~\n“Tell me the story,” James says softly from where he’s sitting on the ground just beside Toni’s feet.  He’s sun dappled thanks to the shadows of the canopy but he seems content if the way his metal fingers card carefully through the thick grass that grows beneath the pomegranate tree is anything to go by.\n“If you’re looking for someone to tuck you in for nap time,” Toni snips back idly as she weaves the stems of the flowers that had crept to her side together into a crown, “then I hate to tell you this but you’re in the wrong place, Freezerburn.”\n“I’d take another nap with you any day, petal,” James cuts a look up at her, a sharp smirk curling its way across his lips.  The warm, gentle fingers he has wrapped around her ankle squeeze softly. “Especially under better circumstances than last time.”\n“Flattery will get you nowhere, Jim-jam,” Toni says evenly as she ignores the way her heart skips a beat and then begins to thunder.  Instead she focuses on weaving her golden roses and crimson irises and black lilies together.\nShe ignores the way a few grey-blue cabbage roses sneak their way into the pile.\nToni braids them into the crown all the same of course but she doesn’t let herself think too deeply as to  why.\nAll the while Death turns loose,  smug, spirals in her chest.\nAnd for the second time in what feels like a decade, Toni doesn’t hurt.\n~~~\n“Toni,” Rogers stops her again just outside the kitchen.\n“What’s my name?” Toni asks without giving him the opportunity to say anything else.\nToni gives him ten seconds, five more than she perhaps should have, and then she walks away.\nShe has no time for Rogers’ silences, for his cowardice.\nFor him.\n~~~\nRhodey and Vision corner James in the garden one afternoon.\nToni watches the three of them from a distance as they linger together by the pond’s edge, Vision and Rhodey’s expressions stern and James’ some mix of amused and accepting.\nThey’re too far away for her to hear and Toni purposefully doesn’t listen to the whispers of the lily pads.\nRhodey had asked for some measure of privacy, something about him and Vision doing their  jobs, and Toni had agreed.\nShe’s actually pretty sure they might be actively threatening James even if she’s not exactly sure  why.\nEither way she’s willing to go along with it for now.\nShe’ll pry it out of one of them eventually.\n~~~\nToni knows that, as irritating as it may be, the world needs to see all of them playing nice during more than just press conferences.\nThus the gala she and all of the others are attending, a charity event put on by the Edwin Jarvis Foundation and attended by all of high society and the newly reunited Avengers.\nToni understands the importance, understands just how much impact a few photos and some gossip from one of these things can be.\nThat’s why she’s here, dressed to kill in a flowing golden gown with inlaid flower and vine details, her hair up and sprinkled with crimson rose buds, and her eyes highlighted boldly in gold and crimson.\nIt doesn’t mean she has to enjoy it though.\nHer one act of rebellion had been to arrive just a bit late with Rhodey and Vision in tow instead of riding in with the others.\n“I find myself still wondering as to the appeal of these events,” Vision says evenly as they spin around the dance floor.\nMaximoff is glowering at them from across the way but Toni resolutely doesn’t care.\n“Rich people like to be around other rich people,” Toni tells him as she smooths her hand across the shoulder of his burgundy floral patterned jacket.  “Bill it as a charity event and we can all get together and feel better about ourselves in the process. At least some good comes out of these dog and pony shows though.  Enough champagne and a few good cases of one-upmanship and we can get a lot done. I’ve seen people donate themselves into a new tax bracket out of pettiness.”\n“That sounds rather unfortunate,” Vision comments lightly.\n“Sunset Bain deserved every second of it,” Toni waves his concern off as the song ends.  Toni tucks her hand into the crook of Visions elbow and lets him lead her back towards the edge of the dance floor where Rhodey’s already waiting for them, champagne glasses in hand.  “JARVIS does excellent work stirring up rumors when he wants to.”\n“As always, Miss,” JARVIS quips lightly in her ear, “you flatter me.”\n“Whose life is JARVIS ruining now?” Rhodey asks as he passes Toni a flute.\n“I was telling Vision about the Sunset Bain thing,” Toni tells him.  “Remember that?”\n“The auction?”  Rhodey asks with no small degree of relish.\n“Yep.”  Toni confirms.\n“Ah,” Rhodey nods sagely, expression creased in a smug sort of remembrance. “Good times.”\nToni hums in agreement as he eyes scan the crowd only to stop on Rogers.  He’s standing across the way, Wilson on one side of him. They’re both decked out in black tuxedoes but Rogers is staring directly at Toni, a determined look on his face.\nToni absolutely will not allow him to cause a scene at this gala.  Pepper would have all of their heads, hers included if that happened, divinity be damned.\n“Dance with me, Rhodey,” Toni says as she knocks back the rest of her champagne and hands the flute off to a passing waiter.\n“I’m guessing you’re avoiding Rogers again?”  Rhodey asks as he leads her out onto the floor with practiced ease.\n“Oh you know me so well, sugar drop,” Toni agrees as she trails her fingers up the chest of his silver and black jacket, tracing over the floral designs he’s also wearing, attention caught by the small bits of gold in the designs.\n“Probably for the best,” Rhodey admits as they move together without even really thinking about it, “I’d hate to have to kick Captain America’s ass in front of all these witnesses.  Pepper’d be  pissed.”\n“And that’s something none of us want to experience unless absolutely necessary,” Toni admits with a small shudder.\n“Amen to that,” Rhodey agrees adamantly.\nThey settle into the dance quietly after that, trading idle chatter and just enjoying being together until the song ends.  Toni’s perfectly ready to move directly into the next song with Rhodey when he suddenly sighs, shakes his head just a bit, and takes a step back and away from her.\n“Rhodey?”  Toni asks, brow arched high in question.\n“Pretty sure you’ve got another partner all lined up, baby girl,” Rhodey tells her, something rueful and just a tad bit amused in his face.  He nods his head towards someone behind her.\nBut Toni already knows who’s there, can tell by the way Death shifts happily in her chest.\nAnd, sure enough, when she turns around with a hand already raised, James is there to catch it in his own.\nHis hair’s pulled back into a small bun and he’s clean shaven, jawline sharp and stark.  His suit’s an exquisitely fitted black on black ensemble that makes his eyes almost  glow.  The only splash of color is the single asphodel blossom he has pinned to his lapel.\nWhen he lifts her hand and presses his lips to the back of her knuckles, for a split second Toni forgets how to breathe.\n“Lepestok,” James drawls, voice curling warmly around the Russian endearment he’s apparently christened her with.  Petal.  Toni doesn’t want to admit how the sound of it makes her melt just a bit.  “Dance with me?”\nToni likes the way he makes it a question instead of a command.\n“Impress me, Red October,” Toni challenges him.\n“My pleasure,” James drawls as he flicks his other wrist and produces another asphodel blossom from up his sleeve in an impressive sleight of hand trick.  Toni holds still as he reaches up and tucks it into her hair before he pulls her closer, metal hand settling low on her waist.\nAnd then they move.\nJames twirls her around the floor, movements flowing and smooth.  He dances with the same sort of easy, dangerous competence with which he fights.\nCaught in his arms, matching him step for step, Toni feels a true smile creep its way up past the cool facade she normally wears at these things.\nThe dance ends far too quickly, the music giving way to something faster, more vibrant.  Around them the laughter ramps up a notch as the dancers begin to get more lively.\nJames doesn’t let her go.\nInstead he pulls her even closer.\n“You’re beautiful, Toni,” James says softly, evenly, like it’s a fact instead of just another shallow compliment.\nThen he twirls her out and then back into his arms without giving her a chance to respond.\n“Caught my eye as soon as you walked in,” James murmurs in her ear.  “Most beautiful woman I’ve ever seen.”\nOut.\nIn.\n“Even if I didn’t know who you are,” James whispers against her temple, “I’d still think you were a goddess.”\nOut.\nIn.\n“Of all the things I’ve seen in this new century,” James rasps as he pulls her even closer, head dipping down until their foreheads are almost touching, “I think you’re what I like the best.”\nToni’s breath shudders in her chest.\n“All these compliments,” she manages to breathe, head tilted slightly to the side as she glances up at him from beneath her lashes, “what are you after, Soldier?”\n“Not a damn thing,” James denies easily.  “Except giving you what you deserve.”\n“And what’s that?”  Toni can’t help but ask as she loops her arm around his shoulders, short nails scratching idly at the nape of his neck.  “What do you think I  deserve?”\nJames pulls her even closer and then dips her low, metal arm pressed firmly against her lower back and his body pressed closely to her own.\n“Worship,” James whispers, lips grazing the arc of her cheek.\nToni’s breath catches in her chest as she stares up at him.\n‘Oh,’ she thinks softly to herself as that soft and lovely thing inside of her blossoms just a bit more, ‘oh.’\n“Leave with me?”  James asks quietly, eyes intense but also so very soft.\nStaring up at him Toni knows there’s only one answer she wants to give him.\n“Yes.”\n~~~\nRhodey and Vision see the two of them off with a wink and a nod respectively.\nPepper catches her eye across the room and grins, naughty and sly, while Happy makes the classic ‘I’m watching you’ gesture towards James.\nToni grins, bright and fond, at all of them, and lets James whirl her out of the door and towards the car that is, surprisingly enough, already waiting for them.\nToni only looks back once.\nAnd there, hovering by the door of the hotel, hand clenched around a shattered champagne flute, is Rogers.\nShe looks away, back up into James’ bright eyes as he holds the driver’s door of the car open for her after dead staring the valet away.\nToni hikes her skirt up around her knees and slides inside.\nJames moves around to the passenger side of the car and gets inside.  The door clicks shut behind him and then he moves his metal hand over until he can gently grab her hand and twine their fingers together on top of the gear shift.\nToni breathes.\nSqueezes James’ hand lightly in her own.\n Drives.\n~~~\nThe ride back to the Compound is calm and easy.\nThey don’t talk, comfortable with the silence between them interrupted only by the radio that’s tuned into an oldies station.\nThen the song changes and Toni feels her heart skip a beat.\n“You are the promised kiss of springtime, that makes the lonely winter seem long,” Sinatra croons through the speakers.\nToni blinks back the tears that come unbidden to her eyes.\nIt’s Jarvis’ favorite song, like an omen from on high from the only true father she’s ever known.\n“You are the breathless hush of evening,  ” James sings beside her, voice husky as he raises the hand he’s holding up to press another kiss against her knuckles, “that trembles on the brink of a lovely song.”\n‘I love you,’ Toni sends the thought out into the ether. ‘I love you, I miss you, everything good about me came from you.’\nShe isn’t sure if Jarvis can hear her where ever he is, but in a moment of optimistic fancy, she likes to think he can.\nShe likes to think he always could.\nAnd that he knows just how much he still means to her, even all these years later.\n“And someday,” Toni sings back, voice soft but warm, “I'll know that moment divine,  when all the things you are, are mine.”\n~~~\nToni parks the car in front of the Compound but leaves it idling, confident that JARVIS will guide it back to the garage for her.\nShe pops her seatbelt but before she can get her door open James is there, a hand extended in her direction.\nShe reaches up and takes it.\n~~~\nToni’s hand is tucked into the crook of James’ arm as they amble down the path that stretches halfway across the Compound grounds.\nNight is thick and heavy around them, the air warm and thick with the scent of flowers as the wind blows lightly passed her garden.\nThey come to the end of the path where paving stones give way to thick grass.\nToni goes to keep moving but James tugs lightly on her hand and brings her to a stop.\n“What?” Toni asks as she stares up at him.\nJames just stares at her for a second as he lifts his metal hand up and glides the knuckles gently across the arc of her cheek.\nAnd then he bends down and sweeps her up off of her feet and into his arms.\n“Your shoes aren’t exactly made for grass, petal,” James says, “pretty as they are on you.”\n“My hero,” Toni snips back even as she relaxes back into his hold.\nThey both know she can walk across grass in her heels.  Or that she could just as easily take them off.\nNeither of them mention the fact.\n~~~\nThe garden feels like something out of a fairy tale.\nThe fireflies are abundant and the pond is illuminated by the glow of the moon and the stars.\nJames carries her across the bridge and underneath the pomegranate tree before he sits her down on the bench there.  She watches as he toes off his shoes and socks and reaches up to pull the tie from the collar of his shirt, undoing the top three buttons of his shirt as he goes.\nThen, his things set to the side on the bench, he kneels down at her feet and carefully, gently, reaches beneath the hem of her dress and removes her shoes.\nHer heels left beside his own shoes on the bench, Toni lets him tug her back up onto her feet.\nThe height difference is even more pronounced between them as without her heels James towers over her even more than he normally does.\nHe makes Toni feel almost …  delicate.\nJames walks backwards, never taking his eyes off of her, as he leads her back out onto the bridge.\n“Dance with me?” James asks again once they’re standing on the arch of the bridge.\n“Yes.”  Toni says again, voice hushed.\nThere, bathed in moonlight and surrounded by fireflies, James pulls her close to his chest again.\nTogether they sway to a beat that only they can hear.\nThe moment feels fragile and eternal all at the same time.\n“Toni?” James says her name softly.\n“Hm?”  Toni hums her question against the warmth of his chest, her lips brushing against the patch of skin he’d bared when he’d unbuttoned his shirt.\nJames shudders, hand flexing lightly against her hip.\n“Tell me the story,” he rasps after a long moment.\nToni goes still in his arms.\nThey stop swaying but James doesn’t let her go.\nShe finds that she doesn’t want him to.\nAround them time itself seems to stand still.\nToni closes her eyes, breathes deeply, and just like Icarus, lets herself take that fateful step out into the open air.\n“My name was Kore,” Toni whispers softly, “and I brought the Spring.”\nThere, in the garden she built with her family, Toni tells James the truth, unvarnished and raw.\nAfterward, once it’s been told, James just holds her, one hand pressed low against her spine and the other coming up to ghost lightly across the side of her throat.\nHe catches her chin gently between warm fingers and tilts her head up towards him.\n“I’m not him,” James says as his thumb smooths gently across the swell of her bottom lip.  “I’m not Hades and I’m not Steve. I’m not a god either. Just a weapon, hollowed out and dirty.  But I’m loyal, Toni. I’ve got loyalty in my  bones.  And I know you’ve got all the reason in the world not to trust me.  Not to trust anyone. But whatever I’ve got left in me … it’s yours, if you want it.  If you want me.”\nJames leans down, presses a soft, tender kiss against her forehead.\nThe arc of her left cheek.\nHer right.\nThe corner of her mouth.\n“Make a new myth me with, blossom,” James whispers against her skin, the light hint of his already returning stubble rasping against her cheek.  “But only if you want to.”\nToni’s breath shudders in her chest.\nA tear slides slowly down her cheek.\nShe turns her head.\n“Yes,” she whispers for the third time that night.\nToni closes her eyes and catches his mouth with her own.\nJames shakes against her, the hand on her chin sliding down to join the other on her waist as he pulls her closer.\nIt starts off soft and almost sweet, little more than a press of lips.  And then Toni brings a hand up to tug the elastic from his hair, fingers burying themselves in the thick locs.\nJames groans, low and heavy in the back of his throat.\nThe kiss deepens, goes hot and hungry.\nToni unfurls for him like a blossom for the sun as flowers and vines burst into existence around their feet, flowering plants spreading out in a ripple with them at the epicenter as Life surges forward joyfully inside of her.\nJames breaks the kiss, chest heaving and eyes blown wide.\n“Toni,” he rasps, “Toni.”\nAnd then he kisses her again.\nAnd Toni gives herself over to it, to him.\nThe last of her fears, of her hesitations, are swept away.\nBecause it doesn’t feel as if she’s being unfaithful to Steve, to Hades, as she’d secretly feared being with anyone else would after her awakening.\nInstead it feels good, feels  right.\nBecause, Toni now knows without a shadow of a doubt, there is nothing left for her to betray.  Steve and the choices he’d forced her to make have seen to that.\nToni is, for the first time in longer than she can remember, really and truly free to choose.\nAnd she has.\n‘James,’ Toni thinks to herself on a sigh as she melts against him, ‘James.’\n\nFlower Meanings Found Here\n\n~~~\nA gentle tickling sensation against her face wakes Toni slowly,  softly.\nNose scrunched up just a bit she opens her eyes and for a split second before the world sharpens around her all Toni can see is  blue.\n“Wake up,  moy tsvetok,” James’ voice is a low rumble from where he’s leaning over her, propped up on one elbow.  His metal hand is busy brushing the asphodel blossom he’s holding gently across her cheeks, the slope of her nose, the swell of her mouth.\n“Why?” Toni asks softly as she lets her eyes slip closed again, face turned upwards towards him.\n“I don’t get you home and Rhodes and Vision might hunt me down and leave me for dead,” James admits wryly, something like amusement and appreciation in his voice as he leans further down and ghosts his lips across her cheek.  “Be a shame to die when I’ve just got something to really live for.”\nToni melts just a bit in the face of his declaration, a response she’s nowhere near beginning to get used to.\nJames has a way about him, the ability to slip beneath her skin with ease.\nToni knows it should be unsettling, the way he can get to her with just a few sweet words.\nBut instead it just makes her feel  warm.  Like sunlight streaming over her skin, like flowers are blossoming to life inside of her.\nShe likes it.\n“They know where we are,” Toni tells him lazily as she brings a hand up to tap at her earpiece meaningfully.  She’s content to stay where she is, mind calm for once as she soaks up the warmth of having James beside her in the middle of the peace and tranquility of her garden.  “JARVIS wouldn’t let them worry about me like that.”\n“Indeed not, Miss,” JARVIS answers softly in her ear.  “Vision and Colonel Rhodes both wish you and Sergeant Barnes a good morning and would like you to know that breakfast will be ready shortly.”\n“Tell Rhodey we’ll be there in a hour or so,” Toni tells him.\n“Of course, Miss,” JARVIS agree.\n“You’ve got the best kids,  moy tsvetok,” James says softly, the pet name flowing off of his tongue easily.\n My flower.\nToni likes it.\nLikes the possessive lilt of it, the way he says it with a hint of what can only be described as  reverence.\nLikes the way it makes her feel warm and  alive  deep down in that place inside of her that’s been lonely and cold for so very long now.\n“I know I do,” Toni agrees, smile soft as it always is when she thinks of JARVIS and the others.\nThey lay there for a few minutes, the flower making its way down her face to drift over the front of her dress where they both know the reactor hides.\n“So,” James finally says, “an hour huh?”\nWhen Toni looks up at him his eyes bright and heavy lidded, his expression  hungry.\n“Hm,” Toni hums in agreement.\n“Not enough time then,” James tells her as he tucks the flower behind her ear and then leans forward to press a hot, open mouthed kiss against the curve of her neck.\n“Enough time for what?”  Toni asks even as she can’t help the way her thighs clench together beneath the silk of her gown when he bites down just a bit.\nIf it wasn’t for her healing she knows she’d be covered in love bites by now, the imprint of his teeth stark against the creamy line of her throat and her face rubbed red from the scratch of his stubble.\nThey’d spent hours kissing the night before, deep and hot and slow and sweet.  Mouths and hands wandering over each other with heat and passion even as they never took that final step towards what they both wanted.\nAnd oh did Toni want it, wants it still.\nBut James had stopped her each time she reached for the fly of his suit pants, pulled her hands up and away to press kisses to her fingertips.\nThen he’d laid her back onto the grass beneath the pomegranate tree and made her  scream with his teeth and tongue and fingers alone.\nAnd yet Toni still wants more, feels greedy for more of what he’s already given her.  Hungry for his heat, his touch, for  him  in a way she can barely describe.\n“All the things I wanna do to you,” James whispers against the curve of her ear.  “All the things I wanna let you do to me.”\nToni shudders just a bit as his hand slides down her side and tugs at the now wrinkled silk of her dress, pulling it slowly, teasingly, up her legs as he goes.  The metal of his hand is warm against her skin as he trails his fingers up her thighs, pausing only to tug almost playfully at the black lace of her stockings and her garter.\nAnd then, hand inches away from where she really wants him, he stops.\n“Not enough time in the world,” James says softly as he presses another kiss to her mouth, “but I’m adaptable and I  always  finish the mission.  If you’ll let me. So, lepestok, can I touch you?  Please?”\nLaying there on the grass beside him, his hand resting on her thigh as he asks for permission to touch her after a night spent wrapped around one another, Toni feels something inside of her  soar.\n“Yes,” she whispers as she reaches up and tangles her fingers in his hair to pull him down into kiss that instantly goes hot and filthy as she lets her thighs fall open in welcome.  “Yes.”\nJames groans against her mouth as his fingers dip down between her thighs, panties long gone.\n“Come on,  moy tsvetok,” James whispers to her, voice rough and deliciously  dark, “I want to see you  bloom.”\nAnd, head pressed back into the grass, thighs splayed open in abandon, and joy arcing through her like lightning, Toni  does.\n~~~\nJames walks her to the door of her bedroom once they make it back into the Compound.\nHer hair’s disheveled but still up, her dress is a wrinkled disaster, and she’s pretty sure her panties are in his pocket, but Toni resolutely  doesn’t care.\nNot with the way James is looking at her, eyes bright but still soft, as he backs her against her bedroom door and bends down to kiss her again, deep and hot and hungry.\nLike he can’t get enough of her.\nLike he’d stay right there, bracketing her in against the door, for the rest of forever if he could.\nToni’s glad that, in this as well, she’s not alone.\nJames breaks the kiss slowly, bit by bit instead of all at once.  And then he just stands there, bent over far enough that their foreheads can touch as they pant together.\n“Gonna have to let you go eventually,” James finally says, “but it’s so damn  hard.”\n“We could fix that, Soldier,” Toni can’t help but say, the innuendo slipping out effortlessly as she leers at him, hand coming up to tug lightly at his waistband.\nJames barks out a delighted laugh.\n“Oh petal,” James sighs as he leans down a bit more to rub his cheek against hers, like he’s trying to rub his scent on her.  “I know we could. But we’re not gonna. Not yet. You wanna know why?”\n“Tell me,” Toni demands easily as she brings a hand up to tug lightly at the hair at the nape of his neck in that way she’d discovered the night before that he most certainly likes.\nJames shudders against her and then reaches up to tug her hand from his hair.  He brings it down until he can press another kiss against the palm and then he entwines their fingers and presses their clasped hands against the side of his face.\n“Cause I’m gonna do this right,” James tells her softly, intently.  “Gonna treat you like the lady, the  goddess, you are.  And when you finally let me have you, I’m gonna get so deep inside of you ain’t nothing ever gonna be able to cut me out.”\nHeat surges through Toni in a wave even as her mind  whirls.\n“You sure this is the game you wanna play?”  Toni asks him just as softly, just as intently.\n“Yeah” James agrees with a smirk.  “I’m sure. Because it’s gonna be so damn good for you.  I’m gonna make sure of it. Gonna make it my mission.”\n“And you always finish the mission right?”  Toni says as she presses closer to him, hand still pressed against his cheek as she goes up on her tiptoes to press her lips against his throat, teeth scraping against the vulnerable hollow there.\n“Da,” James groans, head tilted back and his other hand pressed flat against the frame of her door, fingers tangled in the vines that have sprouted there.\nToni swipes her tongue across the slightly salty expanse of his throat, bites at him one more time, and then she steps back out of his reach and through the bedroom door that she’d opened while he was distracted.\n“Have it your way then,” Toni teases him, high heels in one hand as the other smooths up the wooden frame of her door, soothing the flowers and vines down and away with a touch, as she arches her back just a bit, hips tilted out to the side.\nShowing herself off at the best angles the way she’d learned through countless modeling session when she was younger.\nShe takes a moment to stare at James while she displays for him, to take him in as he is, hair loose, jaw dark with stubble and eyes so very bright.  He’s barechested, shirt and jacket in a heap alongside his shoes on the floor at his feet, the wide, muscled plane of his chest and the black and gold metal of his arm on full display.\nHe looks primal, looks half feral and wild.  Dangerous and gorgeous by equal measures.\nAnd, Toni can’t help but think with a sudden surge of a fierce sort of possessiveness, he’s all  hers.\nBecause he  wants to be.\nAnd then she lets the door swing shut between them.\nPressed against the other side Toni watches with a young, girlish sort of glee that she can’t remember ever feeling before, as JARVIS shows her the way James thunks his head against the wood of her door with a quiet curse.\n“Fuck,” James breathes, his voice clear in her ear thanks to JARVIS, “I’m in trouble.”\nAnd then James grins, bright and beautiful and filled with an obvious sort of joy that the sight of it makes Toni’s heart beat double time.\n“Worth it,” James whispers as he presses a kiss to the fingers of his flesh hand and then presses those to her door, “fucking worth it.”\n~~~\nToni finds herself humming softly under her breath while she showers.\n“It is good to see you so cheerful, Miss,” JARVIS says in her ear, voice warm.  “Happiness suits you.”\nToni can’t help but pause and laugh a little bit.\nAt her feet blue lotus flowers blossom into being.\n“You know what?” Toni asks softly.  “I think it does too, J. I really think it does too.”\n~~~\nJames is waiting for her when she makes her way to the kitchen in the private sector where she, Vision, and Rhodey all live.  The disconnect from their living spaces and the Rogues had been a deliberate sort of move that’s helped to keep much of the peace over the past few months.\nRhodey and Vision are both at the stove and James is sprawled in a set at the bar, back to the wall and settled as far into the shadows as he can be with all of the morning light pouring into the kitchen.\nHe stands when she walks into the kitchen, eyes riveted onto her as she moves first to Rhodey and then to Vision, giving them both a kiss to the cheek and accepting the cup of coffee that Rhodey automatically passes her.\nShe can feel his eyes like a touch as she moves across the kitchen until she’s standing directly in front of him.\nJames doesn’t say anything, just reaches up and places yet another asphodel into her hair before he bends down and presses a soft, lingering kiss against her mouth.\nToni just smiles and kisses him back.\n~~~\n“Yeah,” Rhodey drawls as he stares at Toni who’s settled beside James at the bar.  She’s sitting in a shaft of sunlight with a tablet on the counter in front of her as she picks happily at the fruit salad Vision had made for her.  Her other hand is being held by James who’s already plowed through his food and is, instead, playing gently with her fingers while he sits sprawled in the shadow patch Toni had called on the potted plants above him to make deeper.  “I’m not sure if that’s cute or disturbing. Winter Soldier being all sweet and cuddly.”\n“I’m adorable,” James cuts back calmly as he presses another kiss to Toni’s fingertips.\n“Oh you’re something alright,” Rhodey snips back but Toni can hear the teasing hiding behind the blandness of his voice.\nThe grin James flashes at Rhodey is both sharp and playful all at the same time.\n“Children,” Vision sighs fondly from across the bar.\nToni laughs, bright and happy.\n~~~\nBut the joy, the peace, doesn’t last.\nBecause of course it doesn’t.\n~~~\nThey’re walking through the common area, intent on heading out to the garden again, when it happens.\nToni’s aware of the Rogues littered across the various couches and chairs in the room but she doesn’t pay them any mind.\nNot even Rogers who surges to his feet, face pale and stricken, when they walk into the room.\n“Whore,” Maximoff’s hiss stops James in his tracks.\nAnd Toni, whose hand is tucked in the crook of his arm as the other plays with yet another asphodel blossom that he’s given her, stops with him.\n“What,” James’ voice is dark and dangerous, “did you just say, little witch?”\nWhen Toni looks up at him his face is as unforgiving as stone.\nHe looks every inch the Winter Soldier from legend then.  The ghost story and scourge by equal measures.\n“I called her a whore,” Maximoff cuts back recklessly, accent thick and heavy.  “Steve saw her for the monster she is and now that she can’t have him she’s throwing herself at his best friend instead.  She is a  faithless whore.”\n“That was your one chance,” James says softly as he takes a step forward, hand coming up to gently move Toni’s hand from the crook of his arm.  “And I’m giving it to you because Stevie cares about you for some fucking reason. But open your HYDRA trash mouth again and I’ll rip your tongue out with my bare hands.  And believe me,  little girl, I’ve done it before.  Only difference is that this time?  I’ll actually enjoy it.”\nIn Toni’s chest Death twists joyfully, thrumming across her every nerve ending.\n“Buck,” Rogers steps forward then, “that’s enough.  Wanda shouldn’t have said that but you shouldn’t threaten her like that either.”\n“No, Stevie,” James shakes his head sharply.  “It’s not enough. None of it is. And I don’t know what the fuck happened to the Steve I knew after I fell but I do know that whatever came out of the ice isn’t him.  Cause the guy I knew? The one I followed right off the side of a train in the alps? You ain’t him.”\nToni hears the grief in James’ voice then and, unable to help herself, she takes a step forward and brings a hand up to smooth soothingly up the line his spine.\nTo Toni’s surprise he seems to settle just a bit beneath her touch.\n“That’s not true, Buck,” Rogers insists.  “You know that’s not true. I’m still me.”\n“You’re really not,” James dismisses his protests.  “The Steve I knew was a stubborn little punk but he wasn’t,” James gestures towards Rogers, “this.”\n“Well you changed too,” Rogers cuts back.  “Because the Bucky I knew would’ve  never tried to steal my girl from me.”\nIn that moment Toni goes abruptly and dangerously still.\n“Your girl?” Toni asks quietly as she takes a step up to stand by James’ side.  “Your girl?”\n“Toni ...” Rogers starts to say, face twisted in what Toni’s almost certain is grief.\nIt doesn’t matter though.\nShe’s far past the point where she’s concerned about what Rogers is or is not feeling at any given moment.\nHe’d seen to that himself.\n“I don’t see  Sharon Carter  around here anywhere,” Toni cuts him off sharply.  “So I’m not sure who, exactly, you’re talking about.  But considering that James is  mine I don’t see him wanting or needing anyone or anything of yours.”\nBeside her James shudders just a bit and the hand that comes down to rest on the small of her back flexes and then tangles itself in the silk of her blouse like he can’t help himself.\n“I know you’re upset with me,” Rogers says softly, pleadingly.  “I know I … I know I’ve done some things that hurt you, but that doesn’t change who we are to each other, Toni.”\n“We are  nothing to each other,” Toni hisses as she hands the asphodel she’s holding to James who takes it from her automatically and then takes another step forward.  “You made sure of that right from the beginning. No matter how hard I tried. You don’t get to try and mend those bridges now.”\n“Toni,” Rogers starts but again Toni cuts him off.\n“Call me by my name then,” Toni demands sharply.  “You want to lay claim to me after all this time then call me by my name.  My true name, not the one I took in this life. Call me by the name you  know  was given to me.  By the name you know I made mine in  truth.  The name of the one you called  wife.”\nThere’s more than one sharp inhale from around the room but Toni pays them no mind, attention focused, razor sharp and just as deadly, on Rogers.\n“I …” Rogers stumbles over his words.\nBut Toni has no mercy left in her, not for him, not for any of them.\n“Say it,” Toni hisses at him, voice deep and dark and filled with something  more  as her composure slips in the face of his useless guilt.  Inside her chest Death writhes, rearing its head inside of her, vicious and unforgiving in the face of its former avatar.  “For once in this life.  Say my name.  Or are you too afraid someone will finally realize what you’ve done?  Name me, oh  Lord of Riches.  If you dare.”\nThere’s a moment of silence, short and practically crackling with tension, but Rogers holds his tongue now as he has since this entire thing began.\n“Figures,” Toni sneers as she goes to turn, to move back toward James’ side.  Right where she  belongs  now if she has anything to say about it.\nShe sees Rogers step forward, sees him reach for her out of the corner of her eye.\nSees the way rage flashes, cold and dark, across James’ face as he steps forward to meet him.\nBut Toni is, in this moment, faster than both of them, spurred on by her own rage and the way Death claws at her insides viciously.\nThe grey-blue cabbage roses that are twined around her wrist surge to life, stems and petals exploding outwards in a burst.\n“I told you once before,” Toni hisses as she nudges Rogers’ chin with the tip of the flower and vine drill that’s formed around her arm.  “Don’t touch me.”\nThere’s a flash of scarlet from the side of the room then but Toni doesn’t move an inch.\nShe doesn’t have to.\nJames is on guard at her back in a flash, a knife cutting through the air to slam into the floor at Romanov’s feet even as another appears as if by magic in his hand.\nAnd he isn’t alone in his defense of her either.  The plants around the room have surged to life as more burst from the floors and the walls.  Life blossoming from every corner of the room as flowers and vines surge forward to wrap around the Rogues.\nBarton bites out curses as he struggles against the spiny burdock that’s taken him over.\nRomanov stands frozen as pink larkspur congregate around her legs and creep up to wrap around her wrists.\nWilson curses and hops up to stand on top of the couch, but can’t escape the candytufts that drag at his legs.\nLang looks terrified but, to his credit, doesn’t try to fight the horseshoe geraniums that lash him down to the chair he’d been sitting on.\nMaximoff thrashes where she’s pinned to the wall, hyssop and heather growing over her like a mound, the blossoms eating the sick red of her powers from the air around her.\nAnd still Rogers stands, Toni’s drill pointed at his chin, arms and shoulders weighted down with swathes of striped carnations and petunias, legs tangled in great bursts of anemone blossoms.\n“While I have your  attention,” Toni drawls as James wraps an arm around her waist and presses himself against her back.  “I want you to answer one question for me. Why?”\nRogers’ clenches his eyes closed, chest shuddering as he inhales, and when he opens his eyes again Toni can see the slightest hint of tears.\nShe doesn’t care.\nHis tears can’t move her, not now.  Not after everything that’s passed between and around the two of them.\n“Because it felt like a cage,” Rogers finally says.  “Having all that knowledge, those memories, poured into my head.  All that weight and responsibility. I didn’t … I didn’t want to be a  god.  I didn’t want to have so much plotted out for me like I didn’t have a choice.  Not after I’d already lost so much. So I just …  didn’t.  Instead I pushed it all away.  And when that worked I just … kept pushing.”\n\n Kept pushing her away. \n\nHe doesn’t say it but the words linger in the room between them regardless.\n“Coward,” Toni finally whispers bitingly.  Not even the way Rogers flinches brings her any measure of joy.  “You’re a coward with a piss poor excuse for what you’ve done and you are  not the god I once loved.”\nShe drops the drill, lets the roses settle back around her wrist as she leans back against James.  Soaks in his warmth and his strength and the  loyalty he has promised her.\n“This really is your one warning,” Toni tells Rogers and the others, announces it to the room at large.  “Attack me or mine again and I will bury you so far deep beneath the ground that no one will  ever find you.”\n“Persephone,” Rogers finally whispers.  “Please.”\nToni doesn’t even pause.  Instead she turns in James’ arms, very deliberately gives them all her back, and reaches up to brush away the four leaf clovers and asphodel flowers that have grown like a protective cape around him.\n“Let’s go,” Toni says to him softly, “there’s nothing left for me here.”\nJames says nothing for a long moment, jaw clenched and eyes fever bright, but then he leans down, presses a kiss to her forehead, and uses the arm still around her waist to guide her out of the common room.\nNeither of them look back.\n~~~\n“You okay?”  James asks her softly once they’re in the garden.\n“I’m fine,” Toni tells him with a surprising amount of honesty.  “Or at least I think I will be now. I’m just …  disappointed.  I thought he’d have a better reason somehow.  Something less …”\n“Selfish?”  James supplies the word for her.\n“Yes,” Toni sighs.\n“One thing I’ve learned over the years, lepestok,” James says quietly as he pulls her close to his chest, a hand low on her back and the other ghosting gently over her up-swept hair, “is that sometimes people are just like that.  Don’t think gods are all that different. Much as I love the punk from my memories, as good a man as I know he can be, I don’t think he’s all that different either.”\nAnd that, Toni can’t help but think, might be what hurts the most.\nBecause Rogers,  Hades, was supposed to be different.\n“You have me,” James whispers to her then.  “For what it’s worth, Toni. You have all of me.”\nToni’s eyes slip closed, she turns her face into the large, warm palm that comes up to cup her face.\nShe  breathes.\nAnd then she lets the last lingering threads of confusion and hurt that have been hiding within her shatter and fall away.\nShe owes Rogers or the Rogues nothing.\nNot her pain, not her sadness, not her consideration.\n Nothing.\nShe is Toni Stark.  Is the Iron Queen.\nIs a goddess, is Persephone and Kore and all that both imply.\nShe has her family, has  James, and that is more than enough.\nIs more than she’d  ever thought she’d have.\nMore than she’d ever thought she’d deserve in this life.\nAnd Toni intends to keep every single one of them.\n Forever.\n~~~\nThe tabloids read:\n\n A Winter Romance: Toni Stark and James Barnes, Hot New Superhero Couple? \n\nThere’s a picture of the two of them at the gala that was obviously snapped in that final moment before they left the dance floor.\nToni’s bent back over James’ arm and it’s easy to see from the photo alone that both of them have eyes only for each other.\nJARVIS cuts a copy of it for Toni and adds it to the rotating digital picture frame in the workshop.\n~~~\nRomanov tries to talk to her, voice soft and expression earnest, a day or so later when Toni is heading out of the Compound.\nToni says nothing, just keeps walking and then slides into the driver’s seat of the car JARVIS had pulled around for her.\nWhen she looks in the mirror Romanov is staring after her, face blank, from behind the wall of belladonna that had shot up between them.\nToni has not, truly, been hiding what she is before now.  Anyone in the know would be aware of the significance behind the flowers in her hair or on her wrists, with the nature themes that have slowly worked their way into her classic shades of black and gold and crimson.\nOr at least anyone not being willfully blind by this point.\nEven James, Rhodey, and Vision have shouted their allegiance more than once with floral themes and flowers of their own.\nSo she hasn’t really been hiding anything.\nShe’s just done being her version of subtle where the Rogues are concerned.\n~~~\n“Can I sleep with you again?” James asks softly, a hand at her waist and lips pressed against her ear.  “Wanna wake up with you beside me. Be the first thing I see.”\n“Yes,” Toni whispers as she pulls him into her bedroom, the door clicking closed behind him.\nBecause she wants that too.\nWants it more than she’d thought possible.\nWants so much of what he’s already given her and so much of what she can feel hanging there between them, like a bud about to blossom.\nToni falls asleep with James at her side, an asphodel on her pillow, and peace in her heart.\n~~~\nThe grass is cool and soft beneath the pomegranate tree, the branches above them heavy with fruit, each one thick and ripe.\nSkirt pushed up around her waist, panties gone and stocking clad thighs splayed wide, Toni stares up at the patches of sunlight filtering down through the leaves with a mind gone hazy with want.\n“Look at you,” James rasps as he moves back up her body, voice rough and stubble damp.  “Taste like sunshine, petal. Like the sweetest honey I’ve ever had. Could eat you for days.”\nToni tastes herself on his tongue, honey sweet just like he’d said, when he kisses her.\nAnd then she gasps against his mouth, ragged and broken, when his fingers dip deep inside of her, crooked just right to make her senses light up with pleasure.\nAround them pomegranates fall to the ground, cushioned by the clovers and red poppies that have sprouted, as the tree shudders and abruptly bears new fruit.\nJames pulls back from her, eyes blown wide and bright, and reaches over to grab a thick, crimson skinned pomegranate from the ground.  It contrasts beautifully against the black and gold of his arm, the most unsubtle sort of symbolism.\n“Know you don’t eat em anymore,” he tells her, breathing just a bit ragged.  “But I’m gonna lick up every fucking drop and seed.”\nHis hand tightens and the pomegranate bursts, seed and juice sluicing down over his fingers to land in warm little splatters against her stomach and thighs.\nAll Toni can do is clench her fingers in the flowers that have sprouted around her and keen, breathy and high in the back of her throat, as he does just that.\n~~~\nToni isn’t sure how but Lang manages to look even more terrified everytime she sees him.\nIt might have something to do with the smug little giggles of the geraniums that sway outside of his window.\nToni, honestly, couldn’t care less.\n~~~\nRhodey finds her one morning while James is doing laps around the pond, content to do his workout in the serenity of her garden away from the others and, most importantly of all, away from Rogers.\nToni watches on with a smile she hasn’t been able to fully erase in  days  as Rhodey’s arms, familiar and solid and always loved, wrap around her waist as he tugs her against his chest.\n“You look happy, baby girl,” Rhodey says as he presses a kiss against her temple.  “Been a long time since I’ve seen you smile like that.”\n“I … I am happy,” Toni confesses as she cuddles closer to Rhodey’s chest.  “I, Rhodey, I’m so  happy it … it scares me a bit.” Tears well up in the corners of her eyes but she swallows them back down.  “I didn’t … I never thought I could have this. After what happened with … I didn’t think this would be possible for me.”\n“I did,” Rhodey tells her softly as he smooths a hand down the line of her spine and rocks her a bit back and forth.  “Me and Vision and JARVIS. Pepper and Happy too. We all did. You want to know why?”\nToni nods her head against his chest.\n“It’s because you were made to be loved, Tones,” Rhodey tells her softly as he pulls back just enough to where they can look each other in the eyes.  “You. Toni Stark. Persephone. Kore. All the parts of you. You got so much light inside of you Toni and I knew that, one day, you’d find the right person to give it to.”\n“And you don’t,” Toni swallows, “you don’t have a problem with it being James?”\n“Hey now,” Rhodey says firmly, “it ain’t my place to tell you who to be with.  Never has been, never will be. So no, I ain’t got a problem with Barnes. And as long as he’s good to you, good  for you, as long as he keeps putting that smile on your face?  I never will.”\n“I love you, Rhodey,” Toni whispers softly as she presses close to him again.\n“I love you too, Toni,” Rhodey says as he folds his arms around her.  “Because no matter what it’s you and me, till the day we die.”\n~~~\nToni wakes with James at her side, an asphodel on her pillow, and joy in her heart.\n~~~\n“Take them off,” Maximoff rasps.\nShe’s haggard looking, eyes red rimmed and undercut by dark circles.\n“Take them off,” she repeats, voice desperate and almost small.\nToni stares at the loops of hyssop and heather that are still curled around Maximoff’s wrists like bracelets and watches as they eat the tiny flickers of scarlet from the air.\n“No,” Toni tells her easily enough.\n“You can’t do this,” Maximoff snarls.  “You can’t take my powers from me. You don’t have the right.”\n“I didn’t take anything from you,” Toni cuts back.  “I’m just making sure you learn something far overdue.”\n“And what’s that?”  Maximoff bites out. “What could you  possibly teach me?”\n“Control.”  Toni says as she turns on her heel and strides away.  “Learn some or get used to your new accessories.”\nToni refuses to harbor a loose canon, a threat, like Maximoff under her roof anymore without doing something about it.\n~~~\nToni still doesn’t eat pomegranates.\nBut what she does do is kiss the taste of them from James’ mouth after she feeds the seeds to him by the hand fulls.\nHe eats every single one with a smile.\n~~~\n“Do you love him?” Vision asks her softly one afternoon as he floats his way around the workshop.\nThere’s a moment of silence because Toni is struck more than a bit dumb.\n“You do not have to answer,” Vision tells her softly as he comes back to her side, a hand coming up to cup her cheek in his wide palm.  “I already know the truth.”\nAnd then he smiles at her, soft and loving.\n“Love,” Vision whispers to her, “is an excellent look for you, Toni.  I wish you only love like this, now and in the future. Until the end of days.”\n~~~\nHead pillowed on James’ chest, her hand smoothing idly up and down the length of his metal arm as he plays idly with one of her escaped curls, Toni can’t help but think about what Vision had said to her.\n Love.\n‘Oh,’ Toni thinks to herself with no small amount of wonder and joy as James flips her over onto her back, hands sliding up beneath the hem of the overly large henley she’d stolen from him to tug her panties down.\n‘Of course,’ Toni’s mind whispers as she buries her hands in his hair, ‘of course that’s what this is.’\nAs soon as the realization of what she feels for James crystalizes inside of her the thought seems to haunt Toni’s every waking and sleeping moment.\n Love.\nToni finds herself thinking about it constantly, the words hanging on the tip of her tongue everytime James laughs.  Swirling in her head every time he smiles at her. Battering against her teeth, desperate to be passed from her mouth to his, every time they kiss.\nIt should scare her, the idea of loving someone else.  Of being open and vulnerable again after being so deeply and thoroughly rejected by Rogers.\nToni knows it should terrify her deep down inside, in that place she’s always tucked her hurts and her betrayals until she could forge them into armor and nightmares by equal measures.\nAnd  yet …\nThat last confrontation with Rogers and the Rogues as a whole had done more than allow the final lingering threads of confusion and hurt that had been hiding within her to shatter and fall away.\nJames’ ready defense of her had done more than soothe the hurt of that moment.\nBecause Toni really doesn’t owe Rogers or the Rogues anything.\nNot her pain, not her sadness, not her consideration.\nNot her hesitation or her fear.\n Nothing.\nRogers, Hades, doesn’t get to have this sort of control over her.\nDoesn't get to make her afraid, doesn’t get to make her hesitate now when she  finally has the one thing she never thought she’d find after he’d shoved her away finally within her reach.\nSo,  love.\nToni knows it should scare her.\nBut it doesn’t.\n James doesn’t.\nShe  loves him.\nAnd it’s as far from fear as anything she’s ever felt.\n~~~\nDetermination and joy crystalizing inside of her Toni turns her attention towards what, exactly, she should do about her new realization.\nBecause she’d made the mistake once of not telling someone who meant the world to her how she felt about them.\nJarvis had died before she’d gathered the courage to say those words to him face to face.  Had been ripped from her before everything that had always been implied between the two of them could finally be spoken.\nBefore she could ever tell him that he, and not Howard, was the father of her heart and soul.\nThat every good and kind thing inside of her had come from him.\nToni had lost that chance and had later on vowed not to lose that chance with anyone else she loved ever again.\nSo just like with Rhodey and JARVIS, with the bots and Vision and all of the rest of their small family, James deserves nothing less than to hear the truth of how she feels straight from her.\nPlus, because she’s never been one to go small, Toni’s determined to make sure James gets nothing but the best.\nOf this new life he’s found himself in.\nOf this new revelation Toni’s experienced, this new truth that’s blossomed to life inside of her.\nOf  her.\n~~~\n“I’m in love with James,” Toni blurts out as she bursts through the door.\nThere’s a yelp, the sound of plastic bottles falling and bouncing against tile, and then a tirade of vicious cursing.\nToni, impatient and just a bit giddy, taps her foot against the tile and waits.\n“God-fucking-damnit Tones,” Rhodey scowls at her as he slides the glass door of the shower partially open and sticks his head out, short cropped hair thick with suds.  “What’ve I told you about scaring the shit out of me in the shower?”\n“Not to do it cause if you slip and fall and die in the shower your naked ass is gonna haunt me for the rest of existence,” Toni recites by rote and then waves it away as she always does.  “Your ass is the least of my worries right now coffee-crunch. I have  news.”\n“You being in love with the resident freeze-n-play murder doll isn’t news, sweetheart,” Rhodey grumbles as he ducks back into the shower to rinse off.\n“Rhodey,” Toni whines just a bit as she slinks over to the shower so she can use the built in step to boost herself up to sit on top of the stone counter top, “I’m having a  crisis.”\n“Toni,” Rhodey whines back as the water shuts off and he thrusts a arm out of the shower demandingly, “you  are a crisis.”\n“True,” Toni admits easily enough as she reaches over and hands him two of the thick fluffy white towels on that are laying on the counter beside her.\nRhodey pulls open the shower door then, one towel wrapped around his waist and the other held up in his hands as he scrubs water from his face and hair.\nToni watches him, fondness swirling in her chest.  She can’t resist the urge to tease him a bit though as he drapes his towel over his shoulders and moves towards the sink beside her.\nIt takes only a moment's thought to have the ferns in the corner of the room swaying to the side so that orchids can creep up out of the soil, flowers blooming into being as they go.\nRhodey cuts her a baleful look that does little to hide his amusement when the flower crown settles on his head.\n“You’re having too much fun playing at being a green thumb,” Rhodey warns her as he reaches up to absently straighten the crown before he reaches for a bottle of the luxuriously thick lotion Pepper buys him for Christmas every year.  “If it didn’t scare the shit out of the rest of the assholes who live here I might tell you to dial it back a bit. Especially since I’m pretty sure the plants you put in my room are flirting with me.”\nThey both know he’s lying, Rhodey would never ask her to deny something that’s become such an important part of who she is since all of this started.\n“They think you’re cute for someone without roots.” Toni tells him easily enough because it’s true.\nThe coral honeysuckle, traveler’s joy, and white heather she’d coaxed to life in Rhodey’s room adores him just as she does.\n“Plus,” Toni points out, “don’t pretend like you don’t sing to them when you’re alone.  That totally isn’t helping their little crush on you.”\n“I’m a man of many talents,” Rhodey sniffs.  “And they’re good listeners.”\n“If it’s any consolation,” Toni says, “the holly hedges around the garden think James is  to die for.  And I’m pretty sure the bonsai in Vision’s room is one more dedicated pruning session away from proposing marriage.”\n“You’d better make sure I’m there when you tell Vision that,” Rhodey demands.  “The look on his face is gonna be priceless. And JARVIS better record it when Vision tries to let them down easy.”\nToni grins, bright and happy, at the mental image of Vision having the ‘it’s not you, it’s me’ speech with the miniature sakura tree in his room.\nSilence falls as comfortable and easy as always between the two of them.  Toni letting her feet swing idly, high heels barely clinging to her toes, as she watches Rhodey’s long familiar grooming routine.\n“You’re like a little kid,” Rhodey finally says fondly as he turns towards her, smiling slightly when she sticks her tongue out at him.\nBut, as always, he looks at her grabby hands gesture and shifts until he’s right in front of her.\n“You done ignoring my crisis?” Toni asks as she reaches up and tugs at the towel around his neck.  “Good. Now help me Obi-Wan-Ke-Rhodey, you’re my only hope.”\n“Toni,” Rhodey signs as he leans down and presses his forehead against hers, “baby girl you know you don’t need my help.  Not with this. Not with Barnes.”\nToni goes quiet, serious and solemn.\nBecause she might not be afraid of loving James but there is a small, sick voice in the back of her mind, one that predates Rogers’ betrayal, one that sounds like  Howard just as it always does, that hisses a thousand, vicious ‘what if’s’ at her.\nToni does her best to push it away, uses her newfound determination and her long held iron will, to shove it back.\nBecause it doesn’t matter if James might not feel the exact same way about her yet despite how sweetly, how lovingly he treats her.  Despite the way he’s already pledged himself to her over and over again.\nEven if Toni still has time to go before she can earn more than James’ precious and all-encompassing loyalty and warmth, before she can earn the entirety of his  heart, she’s still going to press forward.\n“Don’t I?”  Toni asks him quietly even as she draws strength from him like she always does.\n“No,” Rhodey tells her softly, lovingly.  “That man adores you, Toni. He looks at you like you’re his whole world, just like you deserve.  Has for a long time now. The rest of us wouldn’t like him so much if he didn’t.”\n“Really?”  Toni barely breathes the question.\n“Really,” Rhodey shifts, presses his lips against her forehead, and then pull back.\nToni opens her eyes slowly as she stares up at him.\n“He loves you, Toni,” Rhodey tells her softly.  “Now go tell him how you feel.”\nAnd Toni  smiles.\n~~~\nDespite Rhodey’s reassurances Toni finds herself indecisive as to what to do.  She spends all of ten minutes tossing ideas back and forth inside of her head, fingers tapping out familiar patterns against the reactor hidden beneath her clothes.  The reactor she hasn’t tried to remove because some reminders shouldn’t be so easily dismissed, so quickly wiped away.\nAnd then James goes striding past the door of the private lounge she’s been lurking in and Toni reacts on some kind of knee jerk reaction.\n“Hey Soldier,” Toni calls as she steps out of her heels and bends down to pick both of them up.  Behind her a ivy vine taps at the window until JARVIS obligingly slides it open.\nShe feels her stomach flutter just a bit when James’ attention immediately zeroes in on her as he turns and steps into the door of the room.\n“Lepestok,” James says with a small but  loving smile.\n“Catch,” Toni says as she tosses one of her shoes in his direction.\nJames catches it automatically of course even if he does look more than a bit surprised at having one of her black and gold stilettos tossed at him.\n“What’re you up to, petal?” James asks, one part obviously amused and one part confused.\n“Now now,” Toni says, lips curling in a sly smile as she takes a step back and then another, inching closer to the open window.  “That would be  telling.  So why don’t you find out for yourself?”\n“You trying to play another game with me, blossom?”  James asks, eyes already bright and voice gone deep as he steps further into the room.  Her shoes still in his hand and Toni can’t help the way she stares for just a moment at the way his fingers stroke softly over the velvet and metal.  “Because you know how much I like to play with you.”\nShe knows exactly what those hands are capable of in more areas than one.\nJust the thought is enough to make her clench her thighs together, something that James obviously picks up on in the deep, shuddering breath he takes is any indication.\n“Well then,” Toni practically purrs as she tosses her other shoe to him, her own eyes heavy lidded and breathing coming just a bit quicker as the ivy slithers in through the window and wraps gently around her waist, “guess you’ll have to catch me to find out then.  Won’t you?”\nShe has enough time to see the way James drops her shoes and takes a lunging step forward before the ivy pulls her out of the second story window.\nStanding barefoot on the grass outside the Compound Toni looks up and sees James leaning out the window, hair loose around his shoulder as he stares down at her.\nFeeling more than a bit impish she reaches up to pop the first button on her blouse even as the other comes up to her face to blow him a kiss.\n“Oh,  moy tsvetok,” James says loud enough for Toni to hear him down on the ground, “you’re going to get it now.”\nToni’s eyes widen just a bit when he steps up onto the window ledge and steps out into the open air as easily as breathing.\nHe lands on the grass as light as a cat, balanced on his toes and face curled in a smirk.\n“You want me to give you a head start, blossom, or you just wanna give up now?”  James asks as he takes a single, prowling step forwards.\nNot one to be outdone Toni narrows her eyes and steps forward too, moves into his space until their chests are pressed together.\nShe brings a hand up to tangle in his hair and tugs him down until his mouth is hovering just over hers.\n“You’re gonna have to catch me, Soldier,” Toni whispers against his mouth before she bites down on his lower lip and tugs just a bit.  His harsh groan is one of the best things she’s heard in an age. “If you can.”\nAnd then she ducks down and out of his arms, a swirl of red and pink hyacinth blossoms bursting into existence between them and obscuring her from view.\nBy the time the small colorful explosion clears Toni is wrapped back in the ivy vines and already back up inside the second floor window.\nShe can’t help but grin as the wind carries James’ bark of delighted laughter back up to her.\n~~~\n“May I be of assistance, Miss?”  JARVIS asks softly in her ear. “I assume this game of chase is to be a part of the production you wish to put together for Sergeant Barnes so that you may announce your feelings?”\n“JARVIS,” Toni laughs, “you know me so well.”\n“Indeed, Miss,” JARVIS agrees.  “And I would have it no other way.  But as Sergeant Barnes is currently on the way I would suggest you move.”\nAnd Toni does.\n~~~\nWith JARVIS’ help Toni manages to lead James on a bit of a merry chase around and through the private wings of the Compound.\nVision smiles at her fondly when she tumbles in through his window in a flurry of vines and petals with James hot on her heels.\nRhodey laughs, loud and fond, when Toni ducks behind him only for James to practically skid into the room behind her.  He lets her twist him this way and that and then voluntarily blocks the window Toni slips out of for a solid six seconds before James goes out the one beside him instead.\nLang is less happy when he ends up between James and a door Toni’s just slipped through.\nHis terrified yelp makes the geraniums outside his window and the Compound at large giggle just a bit meanly.\nJoy pounding in her heart and flowers blossoming to life beneath every step she takes, Toni resolutely doesn’t care.\n~~~\nThe sun’s setting by the time Toni makes her way into the garden, slipping in through the holly hedges that promise to actually make James work to get in this time.\nThey’re lying their ripe little berries off but Toni lets it pass with only a small grin.\nEven the short amount of time it’ll take James to sweet talk them will be enough for what Toni has in mind.\nAs she makes her way beneath the protective branches of the pomegranate tree Toni reaches up and plucks the first of many pins from her hair.\n~~~\n“You finally done running from me now,  moy tsvetok,” James calls out as he steps across the bridge and makes his way towards the pomegranate tree a few minutes later.  “Not that chasin you isn’t enough to get me h-”\nJames’ goes quiet, words cut over with a sharp inhale.\nToni, clothes abandoned on the bench and hair left to fall in a thick tumble of curls down past her waist, just tilts her head up proudly and stares at him.\nJames, eyes blown wide, steps forward almost without seeming to realize it, boots sinking down into the thick carpet of clover.\n“Toni?”  His whisper is ragged,  wanting.\nToni steps forward too, hair sliding against her naked skin, arc reactor shining brightly, openly, in the dimming light beneath the tree as she crosses the space between them.\nShe stops an arm’s length away, easily within reach of him.\nJames keeps his hands at his side, fingers flexing rapidly even as he stares at her, eyes racking over her body like he can’t get enough of her.\nAnd that right there?  That restraint coupled with that almost viciously sweet sort of hunger that’s makes up so much of him?\nOh it makes her love him all the more.\n“Are you mine?”  Toni asks him lowly as she reaches up and plucks the single asphodel blossom from her hair.\n“Yes,” James says instantly.  “Every inch, every heartbeat. It’s all yours.”\n“Do you want me?”  Toni practically breathes the question out.\n“Da,” James bites the word out, accent harsh and thick.  “More than my next breath.”\n“Then take me, James,” Toni tells him as she holds the flower out in his direction.  “Because I’m yours. Because I want you to.”\nJames’ control snaps with an almost audible sound as he practically lunges across the space between them.  His hands smooth their way across the straight line of her shoulders, thumbs dipping into the hollows of her collar bones.\nWhen his fingers trail up her neck to cup her face in his palms his hands  shake, flesh and metal alike.\n“I’m gonna ruin you for anyone else,” James rasps as his hands slide up to bury themselves in the thick mass of her hair.  “Just like you’ve ruined me.”\n“Promise?”  Toni breathes against his mouth as she reaches up to tuck the asphodel behind his ear.\n“Gonna make it my mission,” James vows right before he closes that last sliver of distance between the two of them and seals their mouths together.\nToni just hums and presses closer to him, lets herself get lost in his kiss.\nIn  him.\nShe knows all about just how seriously James’ takes his missions.\nAnd for once Toni is looking forward to being ruined.\nTo being made a wreck of.\nBecause in this moment she can think of nothing sweeter than watching James try to do something he’s already accomplished.\n~~~\nToni’s head feels stuffy and full, mind a whirl of heat and want and desperate  need.\nAll she can do is moan, hands clamped tightly onto James’ shoulders as flowers burst into bloom in a rippling wave around them and thick pomegranates once again rain down onto the ground as the tree fruits over and over.\nNature itself rejoicing with her, with them.\nJames is  merciless.\nHis flesh hand is buried in her hair even as he keeps his metal arm wrapped around her waist.  Beneath her ass his bare thighs clench and bunch with thick muscles every time his hips surge forward.\nHe’s buried so deep inside of her that Toni’s sure she’ll never get him out.\nJust like he’d promised her.\nJust like she’d wanted.\n“Toni,” James rasps against her throat, teeth scraping across the tender skin until he can mouth hungrily at her collar bones.  “Toni.”\n“James,” Toni pants back, hands sliding up to grip at his hair, legs tightening around his waist.  “James.  Please.”\n“Anything,” James declares as he pulls her ever closer, taking all of her weight with ease as his hips screw him even deeper inside of her.  “I’ll give you anything, Toni. Lepestok.  Love me and I’ll give you anything.  Everything.  Don’t deserve it but just,  please.   I love you.”\nToni’s breath catches in her chest.\n“Love me back,” James begs more than demands and the sound of it shatters something inside of Toni.  “Choose me. Keep me. Because I’m already yours.  Please love me back.”\n“I do,” it comes out as a half strangled whine as pleasure explodes inside of her, “James.  I love you too.”\nJames’ arms tighten around her, his hand clenches in her hair, and as lights dance behind Toni’s eyelids James holds her in his arms as they both splinter apart.\nAnd in Toni’s chest Death roars in triumph.\n~~~\n“I love you,” James whispers against Toni’s neck before he moves down to say it against the glass front of the reactor and then the flat of her stomach as he stops to tongue her piercing and the star shaped ruby that hangs there now.\n“I love you too,” Toni answers him each and every time.\n~~~\nThe fireflies are thick in the air of the garden and the scent of flowers is heavy on the breeze just like it always is.\n“Would you stay with me forever?” Toni whispers the question against James’ ear before she pushes herself back upright, hands bracing themselves against his abs as her hips work slow, deep circles against his.\n“Da.” James groans as he slides his hands up her thighs, his head tossed back and jaw clenched tightly even as he watches her with eyes gone bright enough to burn.  “For eternity.”\n“Even if it hurts?”  Toni pants. “Even if it changes you?”\n“Da.”  James pants again.  “Worth it. You’re worth …  anything.”\nToni’s heart skips a beat and she feels tears begin to well up in the corners of her eyes.\n He loves her.\nHe really and truly loves her.\nJust like she loves him.\nShe can’t, won’t, lose him.\nTo anything.\nTo anyone.\nNot even time itself.\nThe universe will have to pry James out of her very soul before she lets him go.\n“Make a new legend with me, James,” Toni tells him even as she sees the way his eyes go slightly wide.  “But only if you want.”\nAnd in that moment they both know exactly what she’s talking about.\nLife chooses Death after all and they both know that.\nAnd James?\nHe doesn’t even hesitate.\nInstead he surges up off of the ground in a ripple of muscles, arms wrapping around her waist as he pulls her closer.\n“Yes,” he practically begs again as he presses their foreheads together, his hips rolling up and into her like a wave.  “Yes. Kore, Persephone, Toni.  Yes.”\n“James,” Toni breathes as she presses herself forward until their mouths touch as pleasure skitters across her nerves like electric shocks.\nToni kisses him, deep and desperate, with every inch of love and joy she contains as they both shatter again, bodies going taut with ecstasy.\nAnd then Toni reaches deep within her and allows Death to come rushing up and out of her like a flood.\n~~~\nSettled beneath the pomegranate tree Toni leans her head against the great tree’s trunk and stares up at the heavily laden branches as she runs her fingers through James’ hair.\nHis screams have stopped, had tapered off relatively quickly to be honest.\nToni’s glad for it because every sound of pain he’d made had ramped her self hatred up just a bit higher even if he’d agreed to what she’d done to him.\nIt is, after all, no small feat to make a man into a god, no matter what the legends would have the world believe.\nAnd to take Death into himself?\nOh Toni knows it for the  agony that it is.\nNo matter how eager Death had moved, no matter how well suited James is to host it.  No matter how his years so close to Rogers both before and after his awakening, or the way that the things HYDRA had done to him had shaped him into a perfectly formed new avatar, Toni knows it has to hurt.\nBeing reborn almost always does.\nBut it’s better now.\nJust as her awakening had changed things about her Toni can already feel and see the changes in James too.\nThere’s the way his skin has begun to cool just a tad beneath her fingertips and the way his heartbeat has slowed just a bit even as it evened out into a thick and heavy sort of rhythm.\nThe way his skin has paled and his hair has darkened half a shade, noticeable but not altogether too jarring.  And then there’s the way his cheekbones have sharpened underneath the comforting fingers she trails across his face.\nHe’ll look sharper when he finally wakes up Toni’s sure.\nThe most telling change though swirls in the very air around him.\nJames has always been intimidating.  Had come out of the other side of his time with HYDRA with an easy sort of menace lingering in his bones.  A aura of threat that he could and did draw on at will.\nBut now it’s …  different.\nNow the very air around him seems to swirl with something older, something ancient and  heavy.\nHe feels similar and yet so very different than what Toni remembers Hades feeling like all those centuries ago.\nShe cannot wait to see what kind of god James will be.\nBecause she knows that, no matter what, they will discover his reach and his limitations side by side.\n Together.\n~~~\nJames opens his eyes as a god for the first time a handful of hours later just as dawn begins to creep up over the horizon.\nNestled beneath the pomegranate tree, reactor spilling blue light out into the air around them, Toni stares down at him silently.\nShe’s more than a bit nervous even if she won’t admit it openly.\n“Toni,” James’ voice is a rough, rumbling purr as he stares up at her with eyes so bright they practically glow.  The hand he brings up to press against her cheek is just as gentle as it had been before.\n“Hey,” Toni whispers as she presses a kiss against his palm.\n“It’s done,” James more announces than asks.\n“Yes.” Toni nods anyways, emotions swelling in her chest.  “Welcome to eternity, James. Now you’re stuck with me.”\nJames blinks up at her and is silent for a long moment.\nAnd then he  smiles.\n~~~\nRogers looks ragged when Toni sees him again the next afternoon, a newly divine James at her side.\nThere are circles beneath his eyes and the beard he’d shaved on the Rogues’ return has made a reappearance.\nIt does nothing to hide the surprise that flashes across his face when Toni and James move through the common area where they’re all settled.\nToni knows exactly what he and the others are staring at with such warriness and confusion.\nThere’s a palpable difference to James now, that heavy aura she’d noticed in the garden having grown even more alongside the few physical changes that have taken place.\nWith Death settled firmly,  happily, inside of him James looks even more dangerous than he already had.\n\n Deadlier.\n\n“Woah,” Wilson is, surprisingly enough, the one who actually says something.  “What happened to you, Barnes? You’re looking … kind of terrifying to be honest.”\n“Not my problem if you scare easy, Wilson,” James snips back easily enough.\n“Buck,” Rogers voice is hoarse.  “What’s going on?”\n“Don’t worry about it, Stevie,” James waves him away.  Toni knows that James still cares about Rogers despite everything, knows that there’s a bond there that’s still exists despite all of the tension and anger.\nJust like James knows that Toni has absolutely zero interest in being around Rogers herself.\nWhich, Toni has found, seems fine with James as he’s a bit of the possessive type in a way that Toni more than enjoys.\n“He feels different,” Maximoff mutters from where she’s sulking in the corner, bracelets of hyssop and heather still firmly in place.\n“Wanda?”  Barton speaks up then.  “What do you mean?”\n“He feels like Steve now,” Maximoff tells them.  “Like Stark.”\nThere’s a long moment of tense silence.\n“Toni,” Rogers’ voice is soft,  sad.  “What’ve you done?”\nToni arches a brow at him before she looks up at James.  Because this is his body, his former mortality, in question and even though he doesn’t speak for her she’s not one to take the choice as to how he tells Rogers from him in turn.\n“She did what I wanted her to do, Steve,” James answers him instead.  “What made both of us happy.”\n“What does that  mean?”  Rogers asks just a shade off desperate.\nToni feels a swell of what could almost be pity for Rogers.  For this god who rejected her, who rejected himself, on so deep a level that he can’t even sense that his own aspect has abandoned him so completely.\nCan’t even tell that Toni had pulled it out of him bit by bit and that she’s now poured it all into James.\n“It means he’s a god now,” Romanov is the one who speaks up then, voice hushed and face blank.  “Stark made him one. Somehow.”\nToni thinks she might see a flicker of fear in her eyes before she smoothes it away.\nThere is a terrible kind of awareness dawning across Rogers’ face then as he brings one hand up to clutch at his chest, fingers tangling in his shirt over his heart and tugging the fabric taut.\nToni is sure that in this moment Rogers finally realizes what has happened.  Finally realizes just what she’d taken from him, what he’d given up.\n“Life chooses Death,” Toni tells him, tells all of them.  A declaration and a confirmation of everything Rogers is just now beginning to realize.  “And I choose James.  Forever.”\n~~~\nToni didn’t realize just how much harboring Death inside of her had stunted her own nature until the very moment that James wakes up, his new aspect settled firmly inside of him.\nNow Life comes to her even more effortlessly than before.\nFlowers and plants blossom beneath her every footstep unless she wills them not to.\nEvery plant she passes leans in her direction like flowers tilting towards the sun.\nLife thrums through her veins like a humming melody only she and James can hear.\nAnd Toni feels more at peace in her own skin than she has in longer than she can remember.\nBecause she has a mate once more, has a match.  Has Rhodey and JARVIS and Vision, has her ragged and precious family.\nHas  James.\n~~~\nJames takes to his divinity with an ease and grace that makes Toni laugh even as he smirks smugly.  Rhodey and Vision both shake their heads in exasperation and JARVIS just sighs fondly in her ear.\n“It’s like being awake,” James tells her one night.  He’s sitting up against the headboard of her, their, bed with the sheet pooled around his waist as he runs gentle, reverent fingers through her hair.  “Like I’ve been asleep my entire life and didn’t realize it until right now.”\n“That’s good, right?”  Toni asks, head pillowed on his thigh.\n“I feel whole, lepestok,” James tells her softly as he trails his fingertips softly down her face.  “Feel whole in a way I didn’t think I ever would again. Like I didn’t think was possible until I met you.”\nToni smiles up at him, soft and loving.\nShe knows  exactly what he means.\n~~~\nThe shadows come naturally to James now, curling fondly around his hands and feet whenever he concentrates on them.\nHe’s darker than Hades had ever been, sharper and more likely to bite.\nBut with Toni he is gentle in all of the ways that matter and rough in all of the ways that count.\nToni loves him.\nLoves the man he’d been born as.\nLoves the soldier, the weapon, he’d been forced to become.\nLoves this new god of Death who stepped willingly into divinity just to remain at her side.\nNow when he chases Toni through the Compound they’re little more than two whirlwinds of laughter, flower petals and tendrils of shadows seeping out into the world around them.\n~~~\n‘Home,’ Toni can’t help but think as James presses teeth against her throat and pulls her even closer, always closer, ‘we’re both finally home again.’\n~~~\nHair unbound and flowing down past her waist in a riot of flower filled curls Toni spins circles in the center of the pond, thick lily pads blooming to life beneath her feet as she moves.\nShe never even touches the water.\nVision idly paints his newest bird mansion as Rhodey lays, eyes closed, on a lily pad of his own.\nAnd from the shadows of the pomegranate tree James watches her, eyes bright and filled with love.\nToni turns her face up towards the sun and  laughs.\nAnd all of Life laughs with her.\n~~~\n“Moy tsvetok,” James whispers to her where they’re sitting at the edge of the pond together on top of a thick bed of orange blossoms watching the sunset.\n“Hmm,” Toni hums contentedly as she runs her fingers idly through his hair, mind whirling with new designs and upgrade ideas.\n“I love you,” he tells her softly.\n“I love you too,” Toni answers back just as she always does.\nHe shifts then, his head leaving her lap as he moves up onto his knees.  His hands urge her up onto her knees as well until they’re kneeling across from each other as he brings his metal hand back up to hover in front of her face.\nThere’s a surge of power, the familiar whisper of his energy building in the air around them, and Toni’s complete and total attention is instantly caught as she stares at his hand.\nShadows twine around his fingertips and then pool to collect in the palm of his hand.\nToni stares at it intently, happy as always to see James flex his muscles like this, to be so at ease with his divinity and all that it entails.\nAnd then the shadows clear and her breath catches in her chest.\nIn his palm is a comb topped with an asphodel blossom unlike any she’s ever seen before.\nThe setting sun hits the diamond petals and sets them aglow in a flurry of refracted light.  The gold that runs in thick lines down each petal and stamen glows rich and warm in the dying light.\nLord of Riches is, after all, more than just a nickname for Hades that Toni had thrown at Rogers.\nAs the new god of Death James is, obviously, entitled to all that comes with it.\nIncluding the riches that had once littered the Underworld.\n“I want to spend eternity with you,” James whispers as he lifts the jeweled blossom up and settles it into her hair.  “Wanna see the rest of existence by your side.”\nToni’s heart is beating so hard she’s sure it’s going to come out of her chest or explode one.\nJames cups her face in his palms and leans down to press a sweet, chaste, kiss against her lips.\n“Toni?”  He whispers her name with such love.\n“Yes?”  Her breath trembles when she answers him.\n“Will you marry me?”\nToni’s heart skips a beat.\n“Yes,” Toni breathes her answer into the air between them.  \"Yes.”\nJames stares at her for a split second before wonder breaks across his face, joy lighting his eyes up like flames.\nHe lunges up to his feet then and reaches down to snatch Toni up before she can say or do anything else.\nBut even then his hands are gentle where they span her waist, careful not to hurt her as she’s given him the power to do in more ways than one now.\nInstead James just lifts her up above his head and spins the two of them in a wide circle, joyous laughter spilling out of him and her both.\n“I love you,” James tells her again as he brings her down so that she can wrap her legs around his waist even though he takes her weight with ease.  “God, Toni, I love you so much.”\n“I love you too,” Toni tells him, face flushed and heart pounding in her chest.\nShe has never felt so joyous, so light and easy.\n“We’re gonna get  married,” James rasps then, wonder back in his face as his eyes widen.  “You’re gonna be my  wife.”\nA shiver traces down Toni’s spine.\n Wife.\nShe’d thought … she’d never expected this to happen.\nNot truly.\nHadn’t let herself think about the possibility with real seriousness.  Hadn’t let herself hope quite that far yet.\nOf all the titles she’s ever worn Toni had never expected  wife to be one she’d get to carry again.\nBut there’s no one else in all of existence that she’d want to carry it for now except for James.\n“Yeah,” Toni says as she brings her hands up to cup his face in her palms.  The kiss she presses against his lips is soft and achingly sweet. “I am. And you’re gonna be my  husband.”\nJames shivers, hands flexing against her waist as his eyes blow wide with want.\n“Say that again,” he half pleads, half demands.\nToni grins and leans forward.\n“Husband,” Toni whispers against his ear before she nips lightly at his earlobe.\nAnd when James shudders against her again and then hits his knees, tipping forward to lay her out on top of the carpet of orange blossoms, all Toni can do is laugh.\nBecause she’s in love.\nAnd she’s getting  married.\nAgainst all odds and despite every fire Toni has had to walk through to get right here to this moment, she’s finally made it.\nToni is  happy.\n~~~\nThat night, the fireflies thick in the air of the garden, Toni smiles as she sits, hands buried in the orange blossoms below her, and watches James run through forms on the edge of the pond.\nHe’s wearing only his pants, unbuttoned and hanging low on his waist, but he hardly seems to notice.\nThe moonlight glints off of his bare chest and shoulders, off the black and gold of his arm.  The shadows swirl lovingly around his bare feet whenever he transitions into a flurry of kicks and around his wrists when he throws punches.\nHe’s beautiful, like all deadly things inevitably are.\nToni loves him so.\n“Congratulations, Miss,” JARVIS whispers into her ear then, voice soft.  “I am happy for you.”\n“Oh baby boy,” Toni breathes.  “Thank you.”\nJARVIS’ approval means so much to her in this as with everything else.\n“I admit to being rather eager to see your Sergeant Barnes’ expression when you explain to the bots what your marriage means,” JARVIS starts then, tone dry but playful.  “Butterfingers, at least, is sure to have … strong opinions. I believe it will be, as you say, priceless.”\nToni erupts into breathless, joyful laughter that captures James’ attention even though all he does is smile, shake his head, and go back to his forms.\n“Oh god, J,” Toni finally wheezes as she wipes her tears away with the sleeve of James’ stolen Henley, “I will give you anything you want if you wait until Rhodey’s around and James is drinking something to call him  Daddy.”\n“For you, Miss?  I suppose I could muster a  Father  at the appropriate time,” JARVIS says.  “Consider it an early wedding present.”\nToni grins, delighted as always with JARVIS’ willingness to indulge her.\nEspecially since they both know that there’s only one man who might ever be able to claim the title of  father where JARVIS and the bots are concerned.\nAnd, as much as she loves him, that isn’t James.\n~~~\nRhodey cries when she tells him.\nBut there’s a smile on his face and joy in his eyes so Toni knows them for the happy tears that they are.\n“So,” Toni manages to say as she pulls back just a bit from his chest, “you gonna be my Man of Honor?”\n“Oh baby girl,” Rhodey grins down at her, eyes red rimmed but bright, “you couldn’t stop me if you tried.”\n~~~\nVision looks slightly bemused when Toni tells him but there’s no denying the joy that blossoms to life in his face when Toni asks him to stand with Rhodey on her side.\n“You’re my family,” Toni tells him softly.  “It’s where you belong.”\n“There is nowhere else I would rather be,” Vision says.\nHis smile is slow and soft but so very  bright.\n~~~\nPepper doesn’t cry when Toni video calls her but Happy does.\n“I’m so happy for you, Toni,” Pepper tells her, eyes bright as she rubs soothing circles on Happy’s back.  “He’s a good man and he makes you happy. And you deserve to be happy, Toni.”\nToni thinks that’s an opinion she might actually be beginning to believe.\n~~~\nThe Spiderling lights up at the news, face aglow with joy and mouth moving at about a hundred miles per hour.\nToni still catches James with a wry but amused look on his face as he picks web from his hair a few hours later though.\n~~~\nHarley demands to speak to James alone when she video calls him with the news.\nToni comes back into the room ten minutes later to a vaguely shell shocked James and a smug Harley beaming at her from the other end of the line.\n“That kid’s got  fire,” James tells her once Harley finally ends the call.\n“Yeah,” Toni smiles, “he does.  He’s a good kid though and I’d know.  We’ve got a connection after all.”\n~~~\nTo Toni’s eternal delight Pepper agrees to hold off on announcing the engagement to the press for a while, far too happy for Toni to even contemplate outing her new status to the media at the moment.  James is appreciative too, all too aware by now over how quickly the press can turn anything into a three-ring circus.\nThey all know it’ll have to be done sooner or later for a number of reasons but for now they’re all content to wait.\nAnd then Pepper practically bombards her with messages, information about everything from venues to caterers.  Happy’s not far behind her with gown after designer gown ideas crashing over her like a wave.\nJARVIS helps by separating and organizing all of the data into a new series of folders even if Toni is far from oblivious to the few suggestions that he and Rhodey both slips in there as well.  Or Vision’s newfound fascination with craft books and various how-to articles and videos revolving around wedding decorations.\nBetween that and the scrap book the bots have been working on since Toni and James had sat them down and explained marriage to them, Toni hasn’t had to look at a single bridal magazine or blog yet.\nShe wouldn’t have it any other way.\n~~~\nToni spends more than a few hours working on a special project.\nIt’s small but delicate and important to her.\nSomething she hopes that, when the time comes, James will like it as much as she does.\n~~~\n“You know,” Toni sighs, head tipped back to stare up at the stars as she runs her fingers through James’ hair, “this is going to be  big.  Us getting married.  The amount of attention we’re gonna get for the engagement announcement is already going to be massive.  So triple that, at least, and that’ll be for the actual wedding.”\n“You think so?”  James tilts his head back further in her lap so he can stare up at her.\nToni shoots him a baleful look because, again, they both know he’s nowhere near uniformed enough to have not already realized this by now.\nThe grin he shoots her a second later is all the confirmation she needs.\n“Ass,” Toni says fondly as she tugs at his hair.\n“Does it bother you,  lepestok?”  James asks her softly a few minutes later.  “All of the attention on us getting married?”\nToni’s pretty sure she’s imagining the slight hint of insecurity in his voice.\nShe has to be.\n“No,” Toni answers automatically before she grimaces slightly, “yes. I just … I want this to be about us, not about putting on a show, about giving a crowd what they expect from  Toni Stark  or James Barnes.  I want it to be …  honest.”\n“So let’s make it about us,” James says easily enough as he tugs her free hand down so he can press a kiss against the tips of her fingers and then the inside of her wrist.\n“Not gonna be that easy,” Toni admits with a sigh.  “The press would be good for SI and the Avengers both and we can’t just ignore that.  Plus if we don’t do something public there’s gonna be a lot people who try and call any announcement fake, just a publicity stunt.  Hell there’s going to be people saying it’s a publicity stunt even if we throw the wedding to end all weddings.”\n“You think too much, you know that right?”  James asks her teasingly. “Get all lost in that big, beautiful brain of yours that sometimes you miss the simple solution.”\n“Enlighten me then, Soldier,” Toni flicks his nose gently.\n“We’re  gods, petal, and rich as sin, the both of us.  So let’s have it both ways,” James says simple, eyes half lidded but bright as he shifts her hand around and presses another kiss against the back of her ring finger.  “Marry me twice,  moy tsvetok.  Once for us, for our family, and once for the rest of the world.  We can have something honest and true and then, well then we can throw a wedding so big it’ll go down in history.”\nToni’s breath catches as her mind begins to  whirl.\nTwo weddings.\nMarrying James  twice.\nOnce in private and once for the world to see.\nShe smiles.\n Perfect.\n~~~\nToni isn’t there when James tell Rogers about their engagement.\nShe wants to be but it’s something James wants to do on his own.  And as much as she wants to stand at his side, to protect him as he protects her, she understands his reasoning.\nJARVIS watches over him of course but Toni still feels anxiety twining down her spine as she waits for James to come back to her.\nThere’s sadness and a dark kind of rage in his eyes when he finally does.\nToni sees the blood in the corner of his mouth before he licks it away but she doesn’t say anything.\nInstead she just opens her arms and holds him as he’s held her so many times before.\n~~~\n“You have me, James,” Toni whispers to him some time later, hand buried in his hair and lips pressed against his temple.  “You have all of me.”\nJames shudders in her arms and pulls her closer.\nIt’s one of the things she loves about him.\nEven in his hurt James alway pulls her closer.\n~~~\nThe Compound is a permanent riot of colors now, plants and vines spilling out over every free inch of space, all of them full to bursting with blossoms and sweet fruits.\nThe grounds outside of the garden are much the same, perfectly manicured grass long replaced with thick carpets of clover and flowers as far as the eye can see.\nToni’s joy written across the landscape for all to see.\n~~~\nSo, Toni is  happy.\nShe is in love and getting married and is incandescently  happy.\nBut the world, the universe, doesn’t seem to truly care.\nOr, at least, it has no intention of slowing down for her and James.\nBut then she never really expected it to.\nAfter all that he has suffered in his life plus everything Toni’s told him about, James is of a similar opinion.\nSo, goddess or not, happy or not, Toni knows better than to let herself forget that there’s someone out there intent on having a repeat of the New York invasion one day, only on a far larger scale.\nBut that doesn’t mean she’s entirely prepared for what ends up happening either.\nBecause having Bruce show up at the Compound was beyond even her far reaching sort of foresight.\nEspecially since he shows up with Thor, Loki, and a few hundred Asgardian refugees in tow.\n~~~\nIt’s hard in a way Toni’s not able to truly identify to see Thor again.\nThe way they’d last parted, his disdain and anger over Ultron clouding their normally almost sweet sort of friendship, still hangs like a heavy cloud in the back of Toni’s mind.\nThor had been, perhaps not so surprisingly, the Avenger she’d grown closest to in some ways.\nOne of the divine to another.\nOne of the few to truly know who and what she was.\nTo have him turn from her as he had …\nIt had  hurt, a dull sort of ache that Toni had pushed down and away like she had so many times before in the past with other wounds.\nBut now, seeing him as he is, down an eye and looking older, more worn than she’s ever seen him before with an almost somber Loki at his side, Toni doesn’t have the heart to turn from him.\nInstead she takes a deep breath, squares her shoulders, and reaches up to place a comforting hand on James’ shoulder.\nAnd then she does what has to be done to keep an entire race of people from being turned away from earth and back out into the cold of space.\nThe warning Thor gives out about their near miss with  Thanos  is reward enough as far as she’s concerned because people outside of her family are finally  listening.\n~~~\n“I did you a disservice,” Thor tells her the first time they’re alone together.  “In more ways than one. And I see now that so much has changed in my absence. If I had been wiser perhaps ...”\n“Thor,” Toni cuts him off.  “It’s …  fine.  So just leave it.  We’ve got more important things to worry about, Thunderstruck.”\nThere’s a moment of long silence between them and then Thor reaches over and slowly, carefully, takes her hand in his own.\nThe kiss he presses against her knuckles is soft, almost reverent.\n Apologetic.\nIt’s not fine.\nThey both know it isn’t.  There are fractures in the slow sort of friendship they’d been building.\nBut they are both divine enough, royal enough in their own ways, to know that now is not the time to truly try and mend anything between them.\nBesides, if they live through Thanos and the horrors he’s sure to bring with him, then time is one thing that both of them should have plenty of.\nTheir hurts, the wounds between them both large and small, can wait.\n~~~\nIt only takes a few more days before the full reality of the changes that have happened in their absence seems to truly hit Bruce and Thor.\nThere’s an anger in both of them, and in Loki too surprisingly enough, when the three of them realize just how deep the divide is between Toni and the others.\nThe first time Thor walks in on Toni and James kissing he looks so thrown and upset that for a split second Toni’s almost sure he’s going to  cry.\nToni remembers the way he’d spoke once of the story of Hades and Persephone and how even in Asgard the legend had been loved.\nThor reigns it in though, takes a long, hard look at James, and with realization dawning across his face eventually offers the both of them his congratulations.\nEspecially when James, seemingly unable to help himself, makes sure to tell him that they’re getting married.\nToni can only watch, slightly bemused, as he manages to work it into conversation with both Loki and Bruce soon after that as well.\n~~~\nIt takes a day or two more after that before Toni is alone with Bruce but the first thing she notices is that he’s …  softer, more at ease with himself than she’s ever seen him before.\nIt’s obvious just from looking at him that he’s found at least a modicum of the peace she’d wanted to help him achieve way back at the beginning.  That whatever he and Thor have been through has helped him find an evenness that had always been missing before.\nDespite the way Bruce had shied away from her, hadn’t felt comfortable around her once her divinity had been outed even if her identity had been misstated, Toni’s happy for him.\nThey hadn’t grown as close as she’d once thought they possibly could but Bruce had also had no part in what had come after Ultron.\nHe’d been gone then and, despite popular opinion to the contrary, Toni has enough mercy in her not to punish him for other people’s mistakes.\nSo while the welcome she extends to him isn’t exactly one of friendship like it was back on the helicarrier, or even one of agreeing to set certain issues aside like she has with Thor, it is one of acceptance of a sort.\nAnd judging by the slightly sad but understanding quirk to his smile Toni thinks that Bruce truly does understand the difference.\n“I should’ve seen it,” Bruce’s voice is soft and his hands are pressed deep into his pockets when he steps up beside her.  “I’ve got a hundred different excuses for why I didn’t, for why I took it all at face value and did what I did, but in the end they’re all shit.”\nToni doesn’t say anything, just keeps her attention focused on the massive ship and Thor and Loki’s figures in the distance as they motion refugee after refugee down the ramp.\n“Thor knew, Loki too I expect,” Bruce keeps going.  “Puts a lot of things they’ve both said into perspective now that I think about it.  And it really is kind of obvious now that I’m … well it’s kind of obvious. I should have … I should have looked deeper, been less of a coward.  And I’m … I’m sorry for that Toni. For not trying harder even after you were so good to me. To all of us.”\nToni keeps her hands loose at her sides and can’t help the small, barely there smile that creeps across her face when a tendril of shadow squeezes gently at her ankle.  It slides up her leg and rib cage teasingly and then down her shoulder to twine around her wrist a few seconds later, then it slips between her fingers like a incorporeal hand holding her own.\nEven now, occupied as he is with helping Rhodey and Vision coordinate with Thor, James is still with her.\nOffering her protection and comfort.\nThe security of his love.\n“I might not deserve a second chance but I hope that I’ll be able to earn one someday,” Bruce says.  “Because I don’t know exactly what went on while I was gone, or what happened between you and Steve, but I do know that it doesn’t matter what you’re the goddess of.  Life, Death, or anything in between. All that matters is that you’re a good person. That you always did the best for us, even when we didn’t deserve it. And I was too busy running scared to let myself see that before, to really understand what that meant.”\nToni feels something tight in her chest loosen just a bit, an old hurt losing just a bit of its sting.\n“I hope you’re happy Toni,” Bruce tells her softly.  “I hope Barnes makes you happy. I know I don’t know the full story but he seems good for you.  You two seem good for each other.”\n“He is,” Toni finally speaks up then because she can’t not.  “We are.”\n“Good,” Bruce sighs with a small smile, “good.”\n~~~\nLoki is, for the most part, much like Bruce in some ways.\nCalmer and steadier than she’s ever seen him before.\nBut there’s also a fire to him that’s different from the fever bright burn he’d had back in New York.\nNow when Toni looks at him she can easily see the mischievous and clever little brother that Thor used to tell her stories about.\nAnd, much to Rhodey’s horror and James’ amused exasperation, Toni and Loki get on worryingly well, snipping at each other with a rapid fire sort of ease that brings a delighted smile to Thor’s face.\nHell even James seems to accept him to a certain degree if the knife throwing contest they end up in is anything to go by.\nThere’s an irony there that Toni doesn’t really feel like exploring.  A bittersweet sort of tinge to the fact that she gets on so well with  Loki when she’s always had so many issues forming any sort of bond with people outside of her family and James.\nOr maybe it’s only natural.\nMaybe it makes a strange sort of sense.\nToni and Loki are, as Loki had once pointed out to her, creatures of a similar nature.\nChaos bringers, the both of them.\n~~~\nThe Compound is suddenly filled to bursting with people but with her family at her back, with Rhodey and Vision on either side, with JARVIS in her ear, and James curled around her heart, Toni takes it in stride.\nThese people are traumatized, hurt and terrified.  They deserve peace and safety and somewhere to call home again.\nAnd Toni means to give it to them.\nThere are, after all, more unknown places in the world than humanity could ever dream.  Secret places claimed by no country, by no tribe of people still living. Places forgotten by time, lost cities and mythical islands alive only in stories and legends or in the memories of the creatures and beings who belong in both.\nAnd Toni is a goddess, is Life and all things growing and green.\nIs myth and legend personified.\nShe knows where each and every one of them are.\nOne of them will, she knows, be perfect for Thor and Loki’s people.\n~~~\n“Let’s not wait anymore,” Toni tells James one night almost two weeks later once they’re secluded in the quiet of their room, the hustle and bustle of the now packed Compound having finally died down a bit for the night.\n“For what?” James asks as he pulls his shirt over his head and tosses it into the basket for one of the laundry bots to get later.\n“Getting married.”  Toni says as she shimmies out of her skirt and then her panties, leaving her stocking on because she knows how much James loves them.\nOn the other side of the bed James goes still, hands on the buttons of his pants as he stares at her.\n“I just,” Toni falters for a moment before she swallows and presses forward, love beating a steady tempo in her chest, “I don’t want to wait anymore.  Not with everything that’s happening. The big ceremony can wait at least a year after we make the announcement like we planned, or hell we can wait after all of this bullshit is done and it can be like taking a victory lap.  Either way it can wait but I just … I  want …”\n“Petal,” James moves around the bed then until he’s standing in front of her, his hands coming up to cup her face in his palms.  “Breathe.”\nToni forces herself to take a steady, even breath.\n“Better?”  James asks softly.\nToni nods.\n“Good,” James smiles at her then, loving and just the slightest bit mischievous.  “Ain’t no need to get so worked up blossom. You don’t wanna wait anymore then we won’t.”\n“You sure?”  Toni asks. “This is your wedding too James, all the bullshit aside.  I want you to enjoy it. You deserve to enjoy it.”\n“Moy tsvetok,” James says with a small shake of his head.  “So sweet and good to me. I’d hunt down a priest and marry you right now, tonight, just like this, if you wanted me to Toni.  Nothing’s gonna steal the joy of me getting to make you mine like that from me, no matter what it is.”\n“So,” Toni begins, a small but growing smile blossoming across her face, “tomorrow then?”\n“Tomorrow,” James agrees.\n~~~\n“We want to get married soon.” Toni tells Rhodey and Vision early the next morning, James at her side as he so often is.  “As in preferably today kind of soon.”\nIn the end that’s all she has to say.\nJARVIS is, as he so often is, in step with her and anticipating her every need.\nToni finds out that by the time she makes her announcement to Rhodey and Vision, JARVIS has already been hard at work collecting the rest of the family.\nJames promises to handle the priest before Vision takes it upon himself to drag him away while Rhodey stays with Toni.  Happy and Pepper laugh at them over the vid call JARVIS puts through to their plane from California while the bots whirl around the workshop in a frenzy.\nThe Spider-tot shows up an hour or so later, wraps Toni in a huge hug and then sprints off towards parts unknown.\nHarley shows up an hour after that, makes the ‘I’m watching you’ gesture towards James and then after hugging Toni for a long moment takes off towards wherever it is the Spider-child has disappeared to.  The two have, apparently, been keeping in contact which may or may not bode well for Toni’s future blood pressure.\nAt least her divinity gives her the perk of not having to worry about either of the two driving her towards a heart attack.\nVision floats back into the workshop an hour or so later and volunteers to handle the food.  He waylays any protests by promising to have a selection of fruits from the garden and sweet cream paired with the dark chocolates and sharp cheeses both Toni and James prefer.\nHe swears to have it all settled in the garden before time and then he presses a palm to Toni’s cheek, smiles sweetly at her, and floats over towards where the bots are huddled secretively in the corner behind the large sheet Butterfingers had angrily pressed Rhodey into hanging for them.\nCaught in the middle of the whirlwind that is her family, happily, joyfully, planning a wedding for her and James all Toni can do is toss her head back laugh.\nThey love her.\nAnd she loves them back with an intensity that outshines the sun itself.\nThese people are the ones she’ll save the world to protect.\n~~~\nTime clicking down towards sunset, the Compound a mess of people and noise, Toni forces herself to take a deep breath as she slides out of the workshop.\nEverything’s being arranged but there’s one thing that Toni knows she has to do herself.\n~~~\nShe finds him in the gym.\nHis knuckles are bloody and even the reinforced bag she’d designed is looking worse for the wear.\nWhen he turns towards her there’s such sorrow in his face, guilt and hurt welling in his eyes, that Toni knows that once it would have been enough to completely undo her.\nBut not anymore.\n“Pers- Toni,” Rogers’ voice is soft and just a bit confused, but above all else it also sounds  sad.  “What’re … did you … can I help you with something?”\nThe confusion is understandable because this is the first time Toni’s sought him out in a very long time.\n“Actually,” Toni says as she comes to a stop a good distance away from him, any desire to be close to Rogers long gone by now, “there is something you can do for me.”\nThe way his breath shudders in his chest and the way his shoulders stiffen is more than a bit noticeable but Rogers just looks at her head on and nods.\n“Me and James are getting married today,” Toni says it evenly, abruptly.\nThe full body flinch Rogers gives off and the barely hidden look of agony he tries and fails to hide would be enough to make her pity him just a bit if he were anyone else.\n“A small ceremony, something intimate without all of the press,” Toni keeps going.  “We’ll do the big thing, all the lights and the glitz, when this is all done. This time’s just for us, for family.”\n“Why’re you telling me this?”  Rogers asks, expression agonized and hands clenching tightly at his sides.  “Never known you to be cruel like this.”\n“This isn’t cruelty,” Toni tells him even though they both know that’s not completely true.  “This is  love.  From me, to James.”\nToni knows that sometimes the two can look remarkably similar from a certain point of view.\n“James is in his room getting ready,” Toni tells him after a long moment of silence.  “Vision’s been going in and out but otherwise he’s alone. He shouldn’t have to be. Not today.  Not for this. No matter what happened between all of us.”\n“What’re you asking me to do?”  Rogers manages to force the question out past obviously gritted teeth.\n“I’m not going to be alone out there today.”  Toni finally says. “I’m going to have Rhodey and Vision, Pepper and Happy, JARVIS and the rest of the kids.  My  family  is going to stand with me.  James should have his. Should have  you.  So I’m asking you to go to stand with him.  To put everything else aside for one afternoon and just … be there for him.”\nRogers doesn’t say anything, just clenches his eyes closed, chest shuddering.\nToni pretends like she can’t see the slow trickle of tears he doesn’t even bother to try and hide.\nInstead she turns on her heel and makes her way back towards the gym door.\n“Why?”  Rogers’ question comes out strangled and just a hair off a sob.\n“Why what?”  Toni doesn’t turn back towards him, choses to give him this small shred of dignity even if she owes him nothing of the sort.\n“Why would you …” Rogers trails off for a moment before he seems to gather himself.  “You don’t want me there.”\n“No,” Toni answers him easily, perhaps a bit cruelly this time.  “No, I don’t. But James loves you. And I know he wants you to support him, to stand with him, even if he won’t say anything to me.  After everything he’s been through he deserves to have this. I’m willing to take the steps to make sure he gets it. Are you?”\nThis time when Toni walks away Rogers doesn’t attempt to stop her.\n~~~\nPepper and Happy find her a few hours or so before it’s time, switching out with Rhodey who, along with Vision, goes to herd the bots towards the garden ahead of time.\nThey’re both red eyed but smiling as Pepper bustles inside the bedroom with a dress bag and Happy sweeps her up into a rare but much loved hug.\nToni closes her eyes with a small laugh and basks in the warmth and love.\n~~~\nShe’s in her and James’ bedroom, clad only in her specially bought white lingerie set, and staring down at the dress bag Pepper had brought her when Rhodey comes back in.\nHer hair is up, her makeup is flawless, and the pit of her stomach feels as if it’s going to fall out onto her stocking clad feet.\n“Got a present for you from lover boy,” Rhodey says as he steps inside, a fat black box balanced in hand.\nToni just hums at him in greeting\n“Baby girl?”  Rhodey asks as he puts the box down on the bed and slides a warm, gentle hand across the line of her shoulders as he comes up beside her.  “You okay?”\n“I …”  Toni takes a shuddering breath, eyes glued on the gorgeous white gown she and Pepper had agreed on over the vid call and had paid a substantial amount to have rushed enough that Pepper could pick it up.\n“You getting cold feet?”  Rhodey asks gently as he pulls her around to face him.  “Cause if you wanna call this whole thing off baby, we can.  You say you ain’t ready and it ends right here. No matter what.  None of us are gonna be mad and that man out there loves you enough to understand if you need more time too.”\n“No,” Toni shakes her head quickly, “no it’s, it’s not that.  I want to marry James. It’s just …”\nShe looks back down at the dress.  It’s gorgeous, a sleek fitting beauty of a gown with a train for days.  A dream wedding dress with all of the glam and money to be expected of her tastes.\nAnd yet …\n“It’s a beautiful dress, Tones.”  Rhodey says as he pulls her close to his chest and presses a kiss against her temple.  “You’ll look like a masterpiece in it, baby girl. But I think you should have exactly what you want today.  And if it’s not that gown, if it’s anything else, then just say the word and we’ll fix it.”\nToni’s breath shudders in her chest and she presses close to him, hands smoothing up the lapels of his form fitting tux.  There are delicate gold and silver flowers etched across his vest and there’s even a familiar asphodel pinned to his lapel.\nShe loves him so very much.\nHe always gives her the courage to do exactly what needs to be done.\nToni pulls back from Rhodey’s embrace with a smile.  He lets her go, face fond, as she moves towards her vanity.  She grabs a wet wipe with one hand and reaches up to tug a pin from her hair with the other.\n“Help me out?”  Toni asks with a look over her shoulder.\n“Always,” Rhodey says as he steps forward.\n~~~\nThe garden looks beautiful when Toni steps past the holly hedges.\nHarley and the Spider-baby have obviously outdone themselves.  There’s a walkway heading towards the bridge to the island that’s a clever mix of webbing and flowers.  Spider silk arches practically overflowing with orange blossoms and bridal roses in gold and crimson and arc reactor blue line the walkway like a tunnel of blooms.  She can hear muted strands of music, something light and airy, and can smell sweet chocolate and fruit heavy in the air.\nIt warms Toni’s heart, the effort they’d all gone through for her and James, to try and make this day as special as possible.\nRhodey, with one more kiss to the forehead, leaves her just outside the curtain of ivy and myrtle vines that Vision had requested her to grow earlier that day.\nHe’ll be waiting for her at the altar just like James because Toni wants to make this walk alone.\nIt’s symbolic in a way, not being given away.\nPlus, as much as she adores Rhodey with all of her heart and soul, there’s only one man she’d have wanted to walk her down the aisle.\nAnd Jarvis has been gone for years now.\nGone but never, ever forgotten.\nGone but always loved.\n Always.\n“Are you with me?”  Toni whispers.\n“Always, Miss,” JARVIS whispers back.  “I am with you now, and always, as I know my namesake would have wished to be.”\nToni takes a deep breath, holds her head up high, and steps forward.\n~~~\nToni steps through the vines and they’re all there.\nRhodey stands in his place as Toni’s man of honor, the bots, flower covered and surprisingly calm, stand behind him, while Rogers stands behind James in a flawless black tux.\nThor is standing with a beaming smile at the head of the small gathering, a thick bundle of silk ribbon laid out across his hands.\nBut it’s James that catches her attention, James that makes everything melt away around her.\nHis hair is down and loose, he’s bare chested, arm and scars and all on full display, there’s a circlet of what looks like onix on his head, inlaid with veins of gold and small sapphires that Toni just knows would match her eyes.\nWhen he looks up and sees her for the first time, joy unlike anything Toni has ever seen blossoms across his face.\nWhen Toni steps forward towards him there is no hesitation to be found within her.\nThe grass is cool and soft beneath her stocking clad feet, the breeze ruffles the hem of the precious red sundress she’s wearing.  A way to have Jarvis close to her on this most joyful of days because if she cannot have him with her then she'll wear the dress he gave her so long ago.\nHer hair is a riot of blossom filled curls left lose to spill down her back to her waist and beyond.  The jeweled comb sweeps it back and away from her face while Rhodey had placed small, delicate braids throughout the mass and helped her tuck the asphodel blossoms James had given her into the strands with infinite care.\nHair down, wings and arc reactor uncovered, Toni goes to James as she is.  Goes to him without all of her masks.\nA girl, a woman, who had been more than half destroyed more than once over the years.\nA goddess who had slumbered unaware for decades but had still managed to somehow be half mad from the cradle.\n‘This,’ Toni tells James silently, ‘is who I am, down below it all, past all of my armors.  This is what I give to you.’\nAnd James …\nStanding there, feet bare and shadows curling at the edges of his being, James only smiles and holds out a hand.\nEyes locked with his, Toni’s tips unpainted lips up into a sweet smile, and reaches out to place her hand in his.\nHe pulls her closer.\nEver,  always, closer.\n~~~\nThe reception is loud and joyful even with such a small crowd.  Rogers disappears as soon as the ceremony is done but Toni can’t, won’t, focus on him.\nToni dances with everyone more than once.  Spends song after song spinning around the grass with Rhodey or Pepper or Harley’s hand in her own, with one of the bots’ claws clasped carefully in hand.  She even dances with Thor who had been honored to tears at being asked to bless their handfasting.\nToni just laughs and admits that James had excellent taste in terms of a priest.\nWho better to bless the joining of Life and Death than the god of fertility and hallowing?\nThe ribbon that was used is one that Toni will cherish forever too because her boys, her bots, had made it for her and James themselves.\nAnd between every dance with the others James takes her into his arms and twirls her around the grass, eyes bright and vibrant, expression a glorious mixture of love and hunger.\nThe ring she’d added to his hand shines gold in the fading light as swarms of fireflies begin to softly glow.  The way he looks at the sliver she’d taken from the Mark III, the first true Iron Queen armor, and reworked into a ring makes her heart warm all over again.\nWhen their fingers intertwine their rings line up perfectly, the band of shadows he’d pressed into her skin warm and humming in time with his heartbeat.\nToni moves with him across the dance floor, eyes locked, hearts beating in time, and swears she can touch infinity.\nWith him at her side she actually wants to.\n~~~\nThat night, once the others have cleared out, James slides the sundress from her shoulders with reverent gentleness.\nAnd when he handles the aged fabric carefully, picks it up to hang it over a low hanging branch, she loves him all the more.\nHe strips her until she’s bare, left with only the flowers in her hair, the comb, and the golden vine crown, topped with rubies and sapphires shaped into rose buds, he’d made for her.\n“Wife,” James presses the word against the soft skin of her throat, the hollows of her shoulders, the swell of her breasts.\n“Husband,” Toni whispers back later against his temple, the sharp cut of his jaw, the cut of his hips.\nEach time they say the words is a new whisper of worship.\nTwo gods kneeling at their chosen alters.\nEternity promised in a breath.\n~~~\nWhen Thanos finally does come Toni meets him on the battlefield, head held high.\n“I know you, little girl,” Thanos says, recognition heavy in his tone, something like possessiveness in his face, “Kore.  The Stones whispered to me of you, lover of Death.  Queen of Life.”\n“Persephone,” Toni corrects him, “or Toni Stark, they both mean the same thing really.”\n“No matter what name you wear I know you.  And I know you are so very alone,” Thanos taunts.  “You were abandoned if the rumors are true. And now here you are, no Death King at your side.  I will fix that for you.”\n“Oh,” Toni says with a blade sharp smile, “that’s where you’re wrong.”\nAnd when she holds out a hand James reaches out of the shadows to meet her half way, eyes bright and cold as he steps from the dark and takes his place at her side.\nThe kiss he presses against her knuckles and then against the inside of her wrist are gentle, loving, even as his face twists itself into a vicious snarl as he stares at Thanos.\nHis eyes promise Death to the Mad Titan, to this would be usurper who covets what will never be his.\n“You’ve wanted to taste Death for so long now.  Wanted to take it as your own.” Toni tells Thanos easily, calmly.  “Well now you’re about to get your chance. But I don’t think it’s going to work out the way you were hoping it would.”\nBecause, Toni cannot help but think, what is a Mad Titan in the face of Life and Death themselves, united and whole and determined to never be parted?\nThanos might wield the gauntlet but Toni and James know infinity in a way he will  never touch.\nThe water is warm and soothing as Toni floats in the middle of the pool sized bath.  The water ripples with movement but she doesn’t bother to move.\nShe’d know James in the dark between worlds, deaf and blind to all around her.\nShe can feel him in every breath she takes, in the flow of creation itself, in the pulse of his heartbeat, steady and strong, in the ring she still wears, the one that’s been a part of her since the day he pressed it down and into her skin.\nPlus there’s no way JARVIS or her plants would let anyone into her bath that didn’t already have permission to be there.\n“The boy called,” James tells her as he moves to her side, arm coming up to brace against her waist and head bending down to press a lingering kiss against the sensitive skin beneath her ear.  “Wanted to know when we’d be home.”\n“You know,” Toni says as she lets him take her weight without ever opening her eyes, “one of these days you and Harley are going to have to stop pretending like you don’t like each other.”\n“Who says we’re pretending?”  James protests as he trails the fingers of his metal hand down the line of her throat, across the tops of her breasts and down to flick teasingly, at her navel and the ruby star that still hangs there.  “Told you back when I first met him, kid’s got fire. Not my fault that fire seems pretty focused on being a pain in my ass.”\n“It’s how he shows his affection,” Toni reminds him yet again.  “It’s why him and Butterfingers are thick as thieves. They’re both filled with murder.  Next time there’s a fight I’m pretty sure I’m just gonna throw those two at whoever comes our way.  That’ll end things quicker than anything else.”\n“Petal,” James groans, “I’ve told you not to say stuff like that.  It’s a horrifying thought, those two teaming up. Bout as terrifying as when you and Rhodes get up to something.  I don’t feel like having to snuff out another apocalypse anytime soon.”\n“Don’t pretend like I didn’t catch you and Loki both throwing knives with those two not a few months ago when we got together for the conference.”  Toni tells him without protesting his comment on her and Rhodey’s shenanigans because they both know it’s true even after all this time. “You don’t have a leg to stand on, husband.  We both know you’re nothing but a marshmallow for Harley and all the rest of them.”\n“Oh I am, am I?”  James says, voice low with hunger as he pulls her around through the water until her legs wrap around his naked hips in a move long made second nature.  “Don’t know if I like that. You thinking I’ve gone all soft. Maybe I should take some time and show you how  hard I can still be.  What do you think about that?”\n“You wanna know what I think?” Toni asks lowly as she finally opens her eyes, hands coming up to tug at his hair hard enough to make him hiss lowly as she stretches up to bite at his jaw line.  “I think that was a terrible line. And I also think you’ve got about an hour and a half before we touch down to make it up to me. So you’d better get to work, Soldier.”\nJames laughs, low and rough and delighted, and boosts her up higher against him, hands cupping her ass firmly as he moves to lay her out against the side of the bath.\nToni lets him move her, no long afraid of the water, no longer haunted by memories or the fear of being forcefully submerged.\nNot after so many years.\nNot when she knows that James, her love, her Death King, her  husband, will always be there to help keep her afloat.\nWhen she’s with him, wrapped in his arms, pressed against his skin with his heart beating fast and heavy beneath her palm, fear is a thing for other people.\nWhen she’s with him there’s only love.\nAlways love.\n~~~\n“You ready?”  Rhodey asks as he leans down to press a kiss against her temple even as he presses a fresh mug of coffee into her hand.\n“Eh,” Toni grimaces as she snuggles closer to his side, free hand coming up to tuck her thumb into the corner of his pants pocket as she sips at her personal ambrosia.  “Like I say every time, I could do without all of the pageantry. It’s still a little much, even for me. Which, you know, is saying something.”\n“Well,” Rhodey says wryly, “it’s not like we’re not used to it, baby girl.  We’ve been doing this song and dance for how long now, the two of us? And that was before you and your boy toy outed yourselves to the world when you took down Thanos.”\n“True,” Toni admits.  She’d been born into the spotlight after all and had learned to play it to her advantage from a young age.  And Rhodey had been there with her every step of the way, just like he is now.\n“Besides,” Rhodey says, “it makes people happy, seeing us all together at the site.  And it’s good for intergalactic relations. Thanos did a lot of damage to a lot of worlds before he got to us.  Damage that a lot of them are still healing from even now. So, you know, it’s not all bad.”\nHe’s right, Toni knows.  But that doesn’t mean she wouldn’t rather be doing something else.  The rainforest she’s been nurturing around the estate they keep near the Tartarus Montes range on Mars is much more interesting.  As are the advancements on FTL engines Rhodey and her have been throwing back and forth with Harley.\nBut, as always, needs must.  There are some responsibilities that cannot be ignored no matter how boring or tedious or overdone Toni might find them.\nAs always it helps to have Rhodey at her side.\nTogether they stand there, basking in each other’s warmth, as close as they’ve always been.\nBetween them is a love so solid and true that is has transcended time and space, has clawed its way through  divinity  itself, to lead them to where they are now.\nTwo gods, one old and one newly awakened, Life and  Love given form, staring out at the stars streaming along around them.\nToni and Rhodey standing together against the slow crawl of time.\nAs they were always meant to do.\n~~~\nToni’s standing on the balcony of her and James’ room in the now even more sprawling Compound, eyes closed and face tilted up towards the sky, when she hears soft, padded footsteps on the stone behind her.\n“Do you have any regrets?”  Harley’s voice is soft and even when he comes up behind her, one lean, muscled arm coming up to wrap around her waist as he leans against her back, chin on top of her head.\nToni just rolls her eyes and leans back into his hold because they both know how happy being so much taller than her makes him, even after all of these years.\nEven if it is, honestly, not that much of an achievement.  Most people, and all of their family in fact except for the bots, are taller than Toni.\nHell Harley, tall for his age with the promise of a wiry build, hadn’t been all that far off from her height when they first met.  The Spider-tot, who is far from an actual child these days even if Toni refuses to change her nicknames, had been taller than her from the get go.\nEven without her powers actively stretching her, sweet little Kamala had been too, much to her delight.\n“Hm,” Toni hums as she considers his question.  “There are things that, if I had the time back, I probably would have done differently, hindsight being what it is.  But I’m happy, Harley. Even after all of these years, I’m still so happy.”\nAnd it’s true too.\nThere’s the turn of a new century rapidly bearing down upon them, the world is so very different than it had been when everything had started, and Toni is still so achingly, gloriously  happy.\nBut she still has to ask him.  Still has to ask the same question that comes up between the two of them, between her and Rhodey and JARVIS and Kamala and the Spider-child at least once every new decade or so.\nSome old habits are, after all, the harder to shake than others.\nAnd Toni will always be  terrified of hurting those she loves.\n“What about you, Sprocket?”  Toni asks softly. “You fine with the life you have now?  With what,” she stops, clears her throat slightly and then forces herself to press forward, “with what being a part of my family ended up doing to you?”\n“Mechanic,” Harley practically whines like he always does, body slumping down around her, “we’ve been through this.  How many times do I gotta tell you?”\n“Just once more,” Toni tells him just like she always does.\n“Fine,” he huffs, the perpetual child when they’re together like this, years and maturity melting away as if they’d never existed.  Toni loves him all the more for it, for the vulnerability and sincerity he shows to her in exchange for her own. “I’m happy with who and what I am now.  With not aging, with being the Iron Man beside your Iron Queen. With getting to stay with you and the others and watching the universe grow. Have been ever since you blessed me and after we realized what was happening.  So stop worrying. I’m  happy, Toni.  We all are.”\n“Good,” Toni tells him softly as she brings a hand up to tug at his messy hair, short nails scratching lightly at the closely buzzed underside.  “Good.”\nMuch like with Rhodey, the blessing she’d given Harley had eventually changed him.  Their crawl towards divinity had been a process much slower than James’ abrupt ascension as each of them had slowly grown into the aspects that suited them best.\nTurns out that that connection between the two of them actually ran a lot deeper than they’d ever thought.\nTurns out that nature truly does abhor a vacuum and the blessing of Life, and far more rarely Death, are the perfect bits of tinder for the sparks of divinity to catch flame in.\nAnd in Harley, like Kamala and the Spider-baby, that spark had flared bright and hard.\nHe’d come out of the other side of his awakening stronger than before and with an aspect that had made James laugh and laugh.\n Vengeance suited Harley almost disturbingly well after all.\nAlmost as well as  Mercy suited Toni’s favorite Spider in the end.\nToni had wrestled with the guilt of changing those she’d given her favor to beyond the initial blessing for a long time.  A blessing and immortality are one thing to agree to, having true divinity and an aspect pressed onto your shoulders are another.\nShe still feels the guilt of it in burst and stops, but with their reassurances she’s mostly found peace with what has happened.\nBecause, fading but stubborn guilt aside, if it means Toni doesn’t have to lose Harley or Kamala or her favorite little Spider to the slow decay of time, then she’s more than fine with what had happened.\nIf it means she gets to keep so much of her family, gets to hold them close and watch them flourish, and she will never not be grateful for that.\n~~~\n“Are you with me?”  Toni whispers, a long held tradition that she will never part with.\n“Always, Miss,” JARVIS whispers in her ear as the air to her right shimmers just a bit.  A haze that grows thicker, more solid with each year that passes. A decade more of soaking up her divine aura and Toni’s sure she’ll finally be able to hold him just like she’s always wanted to.  She could quicken the process of course but JARVIS is, for once, content to have things happen more … organically. “I am with you now, and always. From my first day until my last.”\nJames’ grip on her left hand tightens just a bit then in a reassuring squeeze as Rhodey steps up to stand on her right.\nThe doors of the ship open and together the three of them step out into the light and a wall of sound as the crowd, a mix of humans, Aesir, and others, begins to roar.\nThe gathering honestly seems bigger each time they come back to this place, to where Toni and James had stood together with the others at their back against Thanos so very long ago.\nToni, hair up, wings and arc reactor covered, flowers blossoming to life beneath her every step and the crown that James had given her on their wedding day firmly in place, keeps her head up and a smile fixed firmly in place.\nBeside her, shadows ebbing and flowing around him and expression far more stoic but still soft, James does the same.\nRhodey, his hand coming up to twine with her free one, laughs, bright and cheerful and so very loved as he raises his free hand up to wave at the people.\nTheir divinity, their natures, are no secret these days.  Can’t be, not after all that’s passed.\nHere, in this future they built together, Toni no longer has to hide so much of herself.\nAcross the way she sees the others already gathered beneath the sprawling boughs of the black barked yew tree with its spindly, gnarled branches and its stark white leaves, that forever marks Thanos’ final resting place.\nVision, as unchanging as ever, floats forwards to meet them, bending down to press a soft kiss against the arc of her cheek.  She’s missed him these past few months he’s spent out on another one of his regular trips out to explore and learn.\nBehind him, Rogers lingers beneath the tree, time not yet erasing the pain and distrust that still lingers between the two of them even if he and James have steadily rebuilt the bridges between them over the years.\nToni’s not angry at Rogers anymore, can’t be with how much joy James alone brings her daily, but she knows that there will never be a closeness between the two of them.\nSome things, once broken, can never be repaired.\nSome trusts, once shattered, can never be regained.\nBut Rogers has also found his own sort of peace these days so perhaps it’s all worked out for the most part.\nNomad, the warrior god of the lost, is a much loved figure after all, far more adored than Captain America had ever been.\nRhodey kisses her temple again and lets her go, moving towards Thor and Loki and the tell tale flash of blonde hair just behind the two that she  knows is his real target.\nThey really are a  marvelous couple.\nThere’s a irritated shout, the familiar sound of a web being shot, and then Kamala’s joyful yell.  Beside her James groans just a bit in exasperation but she knows it’s for show.\nKamala, bright eyed, cheerful, and a glowing bastion of  Justice, had been his find after all.\nLooking around at the gathering before her, the smile that breaks across Toni’s face is bright and happy and, most of all,  real.\n~~~\n“I love you,” James whispers to her once the speeches are done, hands spanning her waist as they stand beneath the bows of the yew tree, the cheers of the crowd fading to a dull roar around them.  “Got love etched into my bones for you.”\n“I love you too,” Toni tells him as she presses up to meet his kiss half way.  “With all that I am.”\nThe crowd roars with renewed frenzy but Toni doesn’t hear them.\nAll she can focus on is James.\nBecause, just like every other time he kisses her, the rest of the world fades away until it’s only the two of them.\nInfinity in a kiss.\n~~~\nThe crowds and celebrations left behind them once again, her family pressing in on her with their warmth and their love, Toni takes a moment to just  breathe.\nTime had changed so much for the world, for Toni and her family, for humanity specifically and the universe as a whole.\nSome faces had faded, time eating away at mortality as it always does, and others had stayed the same, blessings of Life and occasionally of Death and newly sparked divinity keeping them as they were.\nIt had truly been an accident.  Toni had only been acting selfishly, unwilling to let more of her family slip away from her than necessary.  But then, in time, the side effect of such a potent blessing had become apparent and what had once been three, became four, and then five and then six, until finally a new pantheon had risen from the ashes of the old.\nAnd during all of that the world had expanded at a rapid pace, the stars no longer unreachable, humanity no longer confined to a single planet.\nA planet that Toni, with the other’s help and encouragement, had turned every ounce of Life and Spring within her towards healing as best she could once Thanos had been removed from the board.\nIt had been hard, those first few decades of change and adjustment for the world, but it had been worth it, is still worth it.\nThey have achieved so much together, have turned life for so many towards the better, and even with all of that progress they keep striving ever forward.\nThere are even more golden days before them, Toni knows there are.\nShe,  they, will build them, bit by bit.\nBecause with Toni and James at the helm, with Rhodey and JARVIS ever at her sides, with the  family they have built piece by piece over the years, they will make sure that this pantheon is better than the last.\nKinder in all of the ways that matter.\nStronger in all of the ways it should be.\nWorthy of all that they have been given and all they have fought for.\nBecause unlike the last pantheon, unlike Zeus’ strangle hold on god and man alike, Toni and the gods that have risen to stand with her through the eternity to come, all have the same driving force behind them.\n Love.\nAnd, in the end, Toni knows that will make all the difference."
}