{
    "id": "14921627",
    "url": "https://archiveofourown.org/works/14921627?view_full_work=true",
    "author": [
        "aloneintherain"
    ],
    "title": "the beginning of a new and brighter birth",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Avatar: The Last Airbender"
    ],
    "relationships": [
        "Zuko & Gaang",
        "Zuko & Iroh",
        "Zuko & The Fire Nation (Avatar)"
    ],
    "characters": [
        "Zuko",
        "Aang",
        "Katara",
        "Sokka",
        "Toph",
        "Suki",
        "Iroh",
        "Original Characters"
    ],
    "additional_tags": [
        "Recovery",
        "Friendship",
        "Trauma",
        "Worldbuilding",
        "Fire Lord Zuko",
        "Post-Canon"
    ],
    "language": "English",
    "series": "",
    "published": "2018-06-13",
    "completed": null,
    "words": "15,637",
    "chapters": "1/1",
    "comments": "1,236",
    "kudos": "27,273",
    "bookmarks": "9,290",
    "hits": "240,084",
    "summary": "<p>“I’m so proud of you, my nephew.” Uncle cups Zuko’s face in his lined hand. The gesture is so tender, his palm so warm, that Zuko has to take a fortifying breath against the sudden swell of emotion in his chest.</p>\n<p>“I want to be a good leader, Uncle,” Zuko says. “I want to look after my people.”</p>\n<p>“You will,” Uncle says. “You <em>are</em>, nephew.”</p>\n<p> </p>\n<p>In a new era of peace, Zuko works to be a very different Fire Lord than his forefathers. Based on this <a href=\"https://captainkirkk.tumblr.com/post/174170933932/im-kind-of-disappointed-that-so-much\" rel=\"nofollow\">tumblr post</a>.</p>",
    "notes": "<p>This fic is based off this <a href=\"https://captainkirkk.tumblr.com/post/174170933932/im-kind-of-disappointed-that-so-much\" rel=\"nofollow\">tumblr post</a> I made a while back about Fire Lord Zuko fostering a kinder culture in the Fire Nation. </p>\n<p>This fic is also full gen. All relationships are platonic, aside from brief mentions of Sokka/Suki.</p>\n<p>I’ve included a lot of personal headcanons and taken liberties with canon (including comic canon, which I pretty much disregard entirely), especially in terms of worldbuilding at the beginning of the fic. I’ve adjusted some minor things in episode 21 for the sake of logic. Plus, I really like the idea that Agni Kai’s are nuanced and have a bunch of rules. I also like the idea that the Avatar can defeat and then dismiss people in power if they absolutely have to. I mean, I figured that was kind of what was going on in canon, but still.</p>\n<p>Also, Zuko’s characterisation may seem a little different, too, now that the stress of the war is over and he’s actively working to be a better person.</p>\n<p>Warnings for references to past child abuse, child soldiers, and underage drinking. If I missed anything, let me know.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Thanks to everyone on tumblr who stuck with me crying about ATLA for weeks on end. And thanks for reading!</p>\n<p> </p>\n<p> <a href=\"https://captainkirkk.tumblr.com/\" rel=\"nofollow\">My tumblr.</a></p>",
    "text": " \nThe most painful part of war is the waiting. They’ve taken Azula down, but they don’t know if Ozai still lives, or if the Earth Kingdom has been burnt to ash. They won the Agni Kai, but the war still wages beyond the palace. No one knows what has happened in this courtyard.\nKatara’s hands are pressed against his wound. He tries to grasp her wrist. “Katara,” he says, “I have to—”\n“You have to stay still and let me heal you.” It comes out sharper than she intended. She sniffles. “You could’ve—Zuko.”\n“I didn’t, though,” Zuko says, and he tries for a smile.\nShe smiles back, and it’s watery, her hair hanging in damp clumps around her face, but it makes something unwind in his chest. One of his friends is okay. He doesn’t know about the rest of them, or Uncle, but one of his friends is going to be alright.\nWhen he’s no longer in danger of bleeding out, Katara helps him stand and limp up into a side room. She pushes him onto a singed chaise, and he goes because he is feverish and in pain and he can still hear Azula bellowing fire into the air outside in the courtyard. She will exhaust herself soon, but the sound of her now—it wrenches at something in Zuko’s stomach, below the starfish-shaped wound in his chest.\nKatara fetches bandages, and spare robes, abandoned by a noble spooked by their fight, to throw on over their tattered clothes. She works on his injury until they hear the faint sound of engines.\nKatara pokes her head out of the courtyard. “It’s an airship. They’re landing just outside the city. ”\n“Just the one?” Zuko asks. Katara nods, yes. “We won. We must have. They wouldn’t be back this soon, and there wouldn’t be only one airship. It has to be Aang.”\nZuko pushes himself up onto his elbows, and Katara frowns at him. The city is quiet outside. The palace is empty, and the people have locked themselves in their homes. The only sound is the faint crackle of still-lit fires and the distant whir of an airship landing.\n“You’re hurt,” she says. “You need to rest.”\n“There are active Fire Nation soldiers all over the world taking advantage of the comet,” Zuko says. “The rest of the world doesn’t know that the war is over. It isn’t over, technically. The war survived the passing of Sozin and Azulon; it would continue until someone officially put a stop to it.”\n“Fine, then, I’ll fetch you parchment, and you can write up letters to the generals here.”\nZuko pushes up off the chaise. Katara’s hands fluttered around him, wanting to push him back down. “A letter from the traitor prince? They wouldn’t listen. It needs to come from the Fire Lord.”\n“You are the Fire Lord,” Katara says. “We beat Azula, and Aang has probably beaten Ozai, which means—”\n“No one else knows we won. At this point, people will ignore any order that doesn’t come with the official Fire Lord seal.”\n“Okay,” Katara says. Her eyes keep flicking to his chest, as though waiting to see fresh blood soak through the bandages, but she's doesn’t stop him from getting up. “How do we get that seal, then?”\nShe looks around the room as though it’s underneath the kotatsu or the debris scattered over the plush carpet, where the outer wall was burst open by a stray blast. It’s a fine room, a room for lazing nobles. A bowl of raspberries is upturned by the door.\n“I order someone to give it to me when I’m the Fire Lord,” Zuko says. “But first, I need the Fire Sages to legitimise my claim to the throne.”\nWith Katara steadying him, her arm around his waist, his arm around her shoulders, Zuko manages to walk without listing to one side. Raspberries are squashed under their boots as they head into the palace proper, ground into the carpet like pulpy blood.\nThey find the Fire Sages in the throne room. The Head Sage is still holding the Fire Lord crown.\nThe Head Sage looks Zuko up and down, and purses his lips. “It is done?”\n“Azula broke the Agni Kai,” Zuko says. “She went after my second, and Katara took her down.”\nZuko had given Katara a brief run down on Agni Kais on their way over. It’s considered dishonourable for participants of the Agni Kai to go after anyone other than their opponent. These are considered “broken” Agni Kais. Technically still legitimate, but dishonourable.\nZuko hadn’t named Katara his second, not out loud, but they all understood that she was. If a bender was hurt in an Agni Kai in a way that didn’t necessarily mean defeat, their second could continue the fight in their place. This tradition came to being centuries ago, back when Agni Kais were death matches. Clean, unquestionable kills were preferable. If your opponent broke their arm, you would rather their second step in, instead of being known for killing someone who was weak with pain and unable to bend properly.\nIt’s an old tradition. Nowadays, firebenders don’t mind killing or maiming their opponent when they’re injured and unable to fight back. They prefer it, even. But it’s a tradition that still stands.\nThe Head Sage’s gaze lands on Katara, and for a moment, Zuko thinks he is about to dismiss her as his second due to the blue peaking out beneath her robe, but then the Head Sage nods. Only a firebender can enter into an Agni Kai, but there are no such rules about who their second is.\n“Can you take us to her corpse?” asks the Head Sage.\n“She’s alive,” Zuko says quickly. “She’s chained in a palace courtyard, where the Agni Kai took place. She’s incoherent.”\n“We will need to see,” he says. He gestures for the Sages behind him to follow Katara out into the courtyard.\nWithout Katara by his side, Zuko feels the full weight of his exhaustion. The Head Sage eyes Zuko up and down—not like he’s judging his ragged appearance, but like he’s making a list in his head of all the things to be done. A proper coronation will take place later in the week.\nIf, of course, Ozai is dead. If Aang goes down, and Ozai is the one that comes back and finds Azula chained down and Zuko trying to claim the throne—he’ll kill all three of him. Zuko and Katara for winning, and Azula for daring to lose.\nThe Sages return, murmuring to one another, and Katara slots herself back under Zuko’s arm, taking his weight. She ignores him when he tries to tell her that he’s fine.\nThere are no guards to stop Aang and the others from marching into the throne room. The palace is deserted, like the Day of Black Sun.\nAang walks in first, exhausted and coated in a layer of grime. His clothes are tattered. He’s bleeding in places. His hand is out, and it takes a moment for Zuko to realise what he’s seeing—Ozai, eyes glazed, barely conscious, with his hands bound in front of him with rock.\nHe seems … smaller. It’s the only word Zuko can think to apply to this man—this painfully human man. His father has always been big. Zuko is used to looking up at him from a kneeling position on the floor, or from a child’s height, before his banishment.\nNow, though, Ozai doesn’t make him feel small. Zuko looks down at the sick, oily-haired man and feels—\nRelief. And then relief that he feels relieved. A part of him had expected to feel the way he had when he stood in front of Uncle’s cell, but he doesn’t.\nToph, Sokka, and Suki come next. Sokka is hopping. Suki is supporting his weight. Aside from his leg, none of them look badly hurt.\nThey see each other across the throne room and they all pause there, swallowed up with the realisation that they’ve both won, that Ozai and Azula have been taken down, the Fire Nation is theirs and no one is dead. They might have run and tackled each other if Sokka’s leg wasn’t broken, and Katara wasn’t supporting Zuko’s weight, and Aang wasn’t standing in front of the Fire Sages with Ozai.\n“I am Avatar Aang,” he says in a strange and echoey voice, “and I am here to revoke Fire Lord Ozai’s right to rule.”\nAang keeps going. This words are ancient and instinctual, like his connection to the spiritual world, pulled from somewhere deep inside of him. No one taught him these words. If asked to repeat them again in a week, he wouldn’t be able to.\nWhen Aang is finished, it is Zuko’s turn. He pulls away from Katara, makes himself stand straight. His hands fumble for the silk ties around his waist. The borrowed robe is for lounging in, something baby skin soft that nobles throw on over their sleeping clothes. It’s not the armour Zuko imagined wearing when the war’s climax came, or the elaborate robes he pictured for his coronation.\nThe Fire Sages hurry through their own vows. Zuko signs a handful of old papers and the Sages whisk them away before the ink has dried.\nAnd then, a few minutes after Aang’s ancient words stripped his father of his power, two hours after Azula was almost crowned, Zuko is the regent Fire Lord. With a simple command, one of the Fire Sages hands him the official seal. The seal that will stop an army.\nThere’s a feeling in his chest, too big to give name to. Zuko gives himself a moment to take in the bowed heads of the Fire Sages, the cloying incense thick in the air, the tired, accomplished smiles on the faces of his bloodied friends, before he retightens the sash of his robe, and says, “Okay. Let’s go.”\nZuko doesn’t spare Ozai a second glance. He won’t stay here and try and put into words all the things he wants to say to this father. He doesn’t have the time for that; he has a war to end.\n \n \n \nFive weeks later\n \nEarth Kingdom soldiers meet them at the wall. They look at Zuko with poorly disguised disgust. Zuko pushes down his temper. He can’t blame them for their animosity, not really. The previous Firelord wouldn’t have stepped foot in Ba Sing Se unless it was to personally burn it to the ground, and the last time Zuko was there, he helped Azula seize control.\nZuko is flanked by a handful of royal guards. The tension between them and the Earth Kingdom soldiers is palpable. Zuko resists the urge to fidget. Fire Lord’s shouldn’t fidget.\nAnd then Aang is whizzing down the steps and barrelling into him. His feet leave the ground, and he thinks Aang’s hug sends them a metre into the air, but he’s too busy scrambling to grab hold of the sunset orange robes to actually check how high Aang propels them.\n“Sorry,” Aang says when they’re back on solid ground again. “I got too excited. It’s been ages!”\nBehind Zuko’s back, his guards look at each other, as if wondering if they should have done something to stop their Firelord from being tackle-hugged by an over-exuberant teenager. But Aang is the Avatar and a famous friend of Zuko’s, and he’s been to the palace before. They’ve probably seen Aang do this sometime during his two week stay at the palace.\n“It’s only been three weeks,” Zuko says.\n“Ages,” Aang stresses.\nZuko thinks Aang would have swept him up into another hug if he could, but the others push him out of the way. Katara’s hug is much gentler than Aang’s. Toph socks him in the arm in greeting. He feels the force of it even though he’s wearing armour. When he looks down, he sees a noticeable dent in the metal plating.\n“Toph,” Zuko says.\nShe blinks at him innocently. “What?”\n“Fix my armour.”\nShe blows her bangs out of her face, and says, “Pansy.”\nShe does fix his armour and even pulls him into a hug too, so he lets the insult go. Sokka hugs him next. When he pulls away, Suki steps forward to offer her own hug.\n“I’ve heard some of what you’re trying to do in the Fire Nation,” she says. “Ty Lee won’t stop talking about it. She’s proud of you, and I think she feels a little guilty for her place in the war.”\n“We’ve all done things we regret.” Zuko doesn’t look at her when he says this.\nSuki squeezes his arm. “I’m proud of you, too. You’re doing a good thing—for your nation, and for the world.”\nSome of the tension leeches out of Zuko. His friends are behind her, smiling and looking so at ease now that their little group is all in one place, and it feels strangely normal being in Ba Sing Se as both the Fire Lord and a member of this group of friends.\nSomeone clears his throat. The Earth Kingdom soldiers are still standing there.\n“My apologies,” Zuko says, stepping away from Suki. “Let’s go.”\n \n \n \n \n \nLeaders from all over the globe are pouring into Ba Sing Se for the following week of peace talks. Tonight, there will be a grand ball in the palace to welcome them. Zuko doesn’t head to the palace right away, though.\nIt’s not that Zuko thinks he won’t be welcome. It’s only been a month since his coronation, but Zuko has already been in contact with foreign dignitaries—namely, King Kuuei and Chief Hakoda, who speak on behalf of their nations—and it has been going surprisingly smoothly. But Zuko is sixteen, and tired after spending weeks talking with (and replacing) the government that just lost the century-long war, and he misses his friends.\nUncle is waiting for him in the foyer of Aang’s apartment, and Zuko forgets about everyone else. He drops his bag, and pushes past Sokka, and then tackles Uncle in a hug. Uncle hugs back, just as fiercely.\nBehind him, Sokka picks Zuko’s bag up and sneaks around them to put it in Zuko’s room. Aang thanks his guards and sends them up to the palace, where Zuko will meet with them this evening. The guards go easily. Anyone that wants to harm Zuko will have to go through the Avatar, two of his masters, the leader of the Kyoshi Warriors, a Water Tribe warrior, and Uncle. Here, Zuko is safer than he’s been in months.\nZuko finally pulls away. He tries to discretely wipe at his face so no one will notice how wet his cheeks have become. Uncle rubs at his eyes, too.\n“Look at you,” Uncle says, holding him out at arms length. “You look so striking, nephew.”\n“Uncle,” Zuko says, ducking his head. “You saw me at my coronation.”\n\"That was a month ago! Your hair has gotten longer. It looks good like this.”\n“I want to grow it out,” Zuko confesses. “I know most Fire Lords grow their hair out, but …”\nUncle knows what Zuko means before he has even said it. “You will not look like your father. With long hair and your own budding grace, you will look like your mother.”\nWithout thinking about it, Zuko pushes back into Uncle’s arms and presses his face into his shoulder. He doesn’t initiate hugs often. But Uncle doesn’t push him away. He cups a hand to the back of Zuko’s neck, where his hair has begun to unravel. Zuko closes his eyes against the touch.\nThe others quietly move deeper into the house, giving them their privacy. Zuko barely hears them go.\n \n \n \nNo other nation has just one leader. The Earth Kingdom is separated into territories ruled by various kings, governors, and mayors with the Earth King at the nation’s head. There are two Water Tribes, each with an individual chief. The Air Nomads were a theocracy and had four separate councils.\nThe Fire Nation has one leader. One Fire Lord. One Zuko.\nZuko has never felt this as keenly as he does in the halls of Ba Sing Se. It’s not just heads of state here today. There are the uppermost noblemen and women of the Earth Kingdom, senior warriors from the Water Tribes, the Kyoshi Warriors, venerated war heroes, and the Avatar and his friends.\nZuko could have brought his minsters of his own, but it would have felt too much like bringing a murderer to a funeral, and so Zuko is the only blot of red in the crowded ballroom, save for his guards, standing by the door.\nUncle is here, but he’s wearing Earth Kingdom greens. There is a danger that, if he were to dress in royal Fire Nation red, the officials would flock to him to talk politics instead of going to Zuko. He doesn’t wear the Fire Lord crown, but he is older and better tempered. Some people resent doing business with a teenager. With a traitor.\nAgainst the pale greens of the ballroom, Zuko’s crimson robes seem that much darker. The blue of the Water Tribe and Aang’s soft orange robes seem to compliment the green of the Earth Kingdom, but Zuko and his guard’s dark reds stand out like a thundercloud in the spring sky.\nZuko isn’t alone, though. He has friends here. Allies.\nEven if it doesn’t feel like it.\n“The Fire Lord hasn’t stepped foot in the Earth Kingdom in over a century.”\nGovernor Situ is a small man that hails from a decent-sized city near the coast. The Fire Nation navy had only needed to sail across the sea dividing their countries and march a few miles inland before reaching the relatively undefended city.\nZuko had been introduced man from earlier, when Bosco had spent half an hour cuddling up to Zuko, enjoying the natural heat that firebenders' produced. King Kuuei had stood by beaming, and keeping Zuko and his bear company, and introducing Zuko to all the officials that passed by. Zuko has read about Governor Situ’s city in reports, too. There had been casualties on both sides, but the massive devastation wrought to the once-great city is nothing compared to the handful of inexperienced soldiers lost in combat.\n“I know,” Zuko says. “This is a time for change. For peace.”\nThey’re near the windows. Zuko had gravitated to this space when he had started to get overwhelmed after two hours of mingling with tense dignitaries. The Earth Kingdom air is familiar in its own way, even if the breeze wafting through the palace windows lacks the dirt and sweat Zuko remembers from the lower levels, back when he was a refugee.\n“Change,” repeats Governor Situ. “I heard you earlier, welcoming the Water Tribe chiefs, apologising to the men who were once held prisoner by your own country. Honeyed words.”\nZuko looks behind him, but he doesn’t see any friends in immediate view. Flagging down Uncle or Aang from across the ballroom would be too conspicuous.\n“I meant what I said,” Zuko says.\n“Maybe, but don’t forget who you are. I know you have no real power. One day, your people will rise up and place someone else, someone stronger and just as poisonous as your father, back on the throne.”\nZuko swallows. He can feel his fire at the base of his throat. “Excuse me?”\n“You’re babying them,” Governor Situ says. “If an armadillo lion bites you, you don’t clean its teeth and sing it to sleep.”\n“My people were damaged by the war, too,” says Zuko, “even if it was in a different way than the rest of the world. I’m doing what’s best for them. They’ll see that soon.”\n“Will they?” The governor swirls his goblet of wine. He looks almost bored, Zuko thinks, like talking with the Fire Lord in-person—something no Earth Kingdom official has done in a century—is an everyday chore. “You sound very sure of yourself. But then, the General who broke down my gates and murdered scores of my people seemed very sure that what she was doing was right. Your father was very sure of himself until the Avatar had him on his knees, unable to even bend. And your sister was sure, too, wasn’t she? Before she cracked.”\n“What is it that you want?” Zuko says through his teeth.\n“This can’t last. Your people will rise up, or an assassin will come for you in the dead of the night, or you will make a wrong decision and the Avatar will topple you, the way he toppled your father. Ozai was only on the throne for six years. Your sister was cut down before she was even crowned. How long do you think you’ll get, boy-king?”\n“Don’t call me that,” Zuko says. His temper is rising to the surface. He’s done so well to keep it down in public these past few months. He thought his days of throwing hissing fits on the sun-baked deck of his ship were beyond him, but if this governor keeps talking, keeps trying to bait him, then—\n“Boy-king?” Governor Situ repeats. Zuko can feel the fire building beneath his skin, rising up behind his teeth. He can taste sparks on his tongue. “You’re not even eighteen. How can you—”\n“Zuko, there you are!” Sokka cuts in, latching onto his arm. “We’ve been looking for you.”\nToph pushes up under Zuko’s other arm. “We’ll be kidnapping the Fire Lord, now,” she tells Governor Situ.\n“Our good friend the Fire Lord,” Sokka corrects.\n“Yeah,” Toph says, “our good friend the Fire Lord.”\nToph grins, and it’s that feral, toothy smile that’s too big for her face, the kind of smile she pulls out right before especially painful training sessions. She stomps one foot, just because she can, and this corner of the ballroom shutters beneath them. Governor Situ steadies himself with one hand on the wall.\nEven if he doesn’t recognise Sokka as a war hero and the eldest son of Chief Hakoda, Governor Situ has to recognise Toph as the Avatar’s earthbending teacher. In most areas of the world, the Avatar’s four masters are considered to be the best benders of their nation. The most honoured benders. Zuko thinks that’s at least true for Toph and Katara, even if it’s not true for him.\n“Lady Beifong,” Governor Situ says. “An honour to meet you in person.”\nSokka coughs into his hand. Governor Situ offers him a curt bow, too, and says, “And you, Sokka of the Southern Water Tribe.”\nSokka can’t help but look pleased at being recognised, even if he doesn’t return the governor’s bow. Toph slots herself more securely against Zuko’s side.\n“Now that you’re done antagonising a war hero,” Toph says, “we’ll be going now. Later.”\nGovernor Situ opens his mouth, but Toph wraps an arm around Zuko’s waist and manhandles him away from the governor. Sokka clutches at his other arm and scrambles to catch up.\n“Bye!” Sokka throws over his shoulder. “Don’t talk to Zuko ever again!”\n“He’s a governor from an important Earth Kingdom city,” Zuko says. “You can’t tell him to stay away from me. You shouldn’t be telling anyone to stay away from me.”\n“Sure we can,” Toph says with that same menacing smile.\nSokka snags a green-coloured cocktail from a passing table. Zuko thinks it belongs to one of Situ’s fellow governors that are hovering a few feet away, watching their six-legged progression with raised eyebrows. The Earth Kingdom hasn’t been visited by Fire Nation representatives in decades (not officially, anyway). They’re not used to Zuko’s elaborate crimson robes. They’re also not used to teenagers who have access to monumental power, both politically and physically, manhandling one another and elbowing their way through diplomatic balls.\n“We can when they’re jerks like that.” Sokka sips at the drink and then purses his lips like he’s sucked on a lemon. He deposits the drink on a random table. “Bleugh.”\n“I’m the Fire Lord,” Zuko begins. Toph nudges a low-ruling king out the way with her hip. Zuko offers the king an apologetic shrug as Toph and Sokka pull him past.\n“Zuko, your heart was going crazy,” Toph says. “I could feel it from the other end of the ballroom. Whatever that guy was saying to you, it was bad news.”\n“You can’t threaten every person that makes me nervous.”\nToph ignores that. She and Sokka tug him through the crowd, only stopping at the ballroom exit.\nUncle hands the Fire Nation guards tea. When he sees his nephew, his Fire Lord, being manhandled, he only looks amused.\n“Nephew,” Uncle says. “How has your evening been?”\n“I think it’s about to get a lot worse or a lot better,” Zuko says.\nUncle raises an eyebrow. “Oh?”\n“We’re kidnapping the Fire Lord,” Toph says. Neither Uncle or the guards look alarmed at this proclamation. “You can have him back sometime tomorrow.”\n“Tomorrow?” Zuko says, and tries to jerk out of her grip. She holds tight. “I have things to do. People to speak to. I can’t just disappear in the middle of the ball. People will notice and—”\n“Have fun, Fire Lord Zuko,” says Uncle. “You have done enough. Politics can wait until morning. I will handle any complaints people may have.”\n“Uncle—” Zuko begins, because Uncle shouldn’t have to weather the scorn of the Earth Kingdom officials in Zuko’s absence, not when he could be meeting up with old friends and enjoying his tea, not when this is Zuko’s responsibility.\nBut Uncle just waves a hand, and says, “Young people deserve the time and space to enjoy the springtime that is youth. Enjoy your night.”\n“Oh, we will,” Toph says.\nToph tightens her grip on him, and Sokka readjusts their linked arms so Zuko feels like a maiden being escorted home, and together, they bustle him into the outer chamber and through the double doors, into the palace gardens. If the guards posted at the palace exit think it’s strange that an earthbender and a Water Tribe warrior are dragging the Fire Lord around, they don’t say anything.\n“You know,” Zuko says, almost conversationally, “if we were in the Fire Nation, this might be considered a capital offence.”\n“We’d probably still do this if we were in the Fire Nation,” Sokka says.\nToph snorts. “We’re absolutely going to do this next time we visit you, Sparky.”\n“Good thing you’re the Fire Lord and would stop us from getting arrested.”\nZuko pretends to think this over. “Would I, though?”\nSokka jerks him the last few steps. Zuko trips on the long hem of his robes and collides with Sokka. Only Toph’s grip keeps them from being knocked onto the wet grass.\n“If you two knock yourself out, I’m not carrying you the rest of the way,” Toph says, hoisting them upright.\nAppa is waiting for them in the manicured gardens, wedged between two flower beds. He’s eating a hydrangea bush. The three people lounging on his back either don’t notice or don’t care that the Earth King’s flowers are being devoured below them.\n“There better still be wine left,” Sokka calls when they’re in hearing range.\nAang’s head jerks up. He throws himself over the side of Appa and plucks Zuko out of Toph and Sokka’s arms, hugging him like it’s been years since they last met, rather than a handful of hours. “Zuko!”\nZuko pats Aang on the back awkwardly. Sokka throws his hands up into the air, and says, “Hello to you, too, Aang.”\nAnd then Suki is jumping down from Appa and sweeping Sokka up into a tight hug, nuzzling into the skin beneath his chin. Sokka slackens in her hold.\n“Nevermind,” Sokka says into Suki’s hair. “Aang, who?”\nKatara follows them down. She hugs Toph, and then, when Aang finally lets go, hugs Zuko. Suki is still holding onto Sokka, so she ignores her brother completely.\n“You did really good in there,” Katara tells him.\nZuko ducks his head. “I don’t know—”\nKatara shakes her head. “You’re making progress, I can tell, even if it doesn’t feel like it right now.”\nToph socks him in the arm. This time, it’s not hard enough to dent metal. “Good job, Sparky.”\n“Oh.” He swallows. A wet badger-frog seems to be caught in his throat. “Thank you, guys.”\nSuki finally lets go off Sokka. She swoops in to hug Zuko, and then pulls back and thumps him in the arm, right where Toph had whacked him, hard enough for Zuko to feel it through his thick robes. “You’re doing amazing, Zuko. Don’t be surprised that the rest of us noticed, too.”\nShe goes to hit him again, but Zuko ducks behind Sokka. “Has Suki gotten more violent? It’s only been a few weeks, what happened?”\n“It’s the wine,” Sokka says. “She gets fight-y when she drinks.”\n“I could kick your ass,” Suki informs Sokka.\nSokka smiles goofily at her. “I know, babe.”\nThey climb back onto Appa, and someone passes Zuko a heavy water skin. He takes a swig. It’s wine. It’s strong and tastes faintly of berries and mint, and sits warmly in his stomach after only a few mouthfuls. This group has always been affectionate with one another, but the wine explains the intensity of it tonight.\nWill he be like that after drinking wine, too?\nRoyals are usually introduced to sake and spiced wines as they enter their teenage years, but Zuko was exiled at thirteen and then turned traitor at sixteen. He’s only had alcohol a few times.\nHis crew introduced him to overproof rum a few months into his banishment. Zuko, unused to having more than a few sips of Uncle’s wine at dinnertime, downed half a bottle with his face scrunched up, determined not to let the burn of it stop him. The crew laughed when Zuko spent the night throwing up, unable to even walk straight. Or, they had laughed, until Uncle had found him slumped against the ship railing alone, dangerously drunk. Zuko had been too far gone to remember what Uncle said or did when he realised what had happened, but the crew never offered him rum ever again.\nNow, sitting between his friends, equals who he fought and bled beside, he doesn’t feel anything like that thirteen year old boy, choking down rum to the encouraging shouts of strange men. The wine leaves him warm in the chilly evening, and he lets his friend’s laughter wash over him.\nAang settles behind the reins. Appa takes off, and then they’re flying low over Ba Sing Se. Aang laughs and the sound is caught in the wind, trailing back to where his friends are sprawled in the saddle.\n“Wait,” Zuko says, “how much has Aang had?”\nHe doesn’t think a drunk Avatar crashing his Sky Bison into a building will cause an international incident considering how much political sway Aang carries these days, but he’d rather not traumatise any Earth Kingdom citizens tonight.\n“Not much,” Katara says. “A few mouthfuls. He said since Appa has to stay sober, then he will, too.”\nZuko blinks the image of a drunk Appa out of his eyes. Toph leans across his lap, snags the water skin, and takes a generous gulp. She doesn’t move away afterward, just throws her legs out until her feet are propped in Katara’s lap, and settles in against his side.\n“Can’t you make it a little less cold?” Toph says.\nSokka takes the wine from Toph and waves it around imperiously. “Bend, firebender!”\nZuko spent the last weeks of the war lighting campfires and, during cold nights and chilly flights on the back of Appa, radiating heat to keep his newfound friends warm. It would have made Zuko feel used if he hadn't been so touched by the way his warmth made them shuffle closer, made their smiles come a little easier, made Aang see that firebending could be something beautiful and comforting rather than destructive.\nHe breathes in deep and draws his fire up into his chest. Warmth pushes through the air in a wave, and as one, the group sighs and relaxes as if they’re sinking into a hot bath. Toph pushes her face into his shoulder. He can feel the point of her nose above his armpit. Katara edges closer.\n“Toph is hogging Zuko,” Sokka complains.\nZuko sighs and holds up his left arm, the arm Toph hasn’t stolen for herself, and Sokka carries Suki over and settles them both against his side. There’s no way Zuko could get up now, not with his friends piled on top of him. His long robes are tangled in their legs. Toph runs her hands down the bottom of the skirt, where the velvet-softness gives way to the bump of gold beading. She always latches on to good textures.\nAt the front of Appa, Aang sighs and pats Appa’s forehead. “I know, buddy,” Aang says, loud enough for them to hear. “We’re all neglected up here. No firebender to keep us warm … No friends to cuddle with …”\n“I thought airbenders could regulate their breathing to keep warm,” Sokka says.\n“It’s not the same,” Aang says.\n“Aang,” Zuko says, “you’re a firebender, too.”\nAang pouts, but lets out a puff of warm air that ruffles his clothes. They all laugh at him. None of them feel bad. Aang will seize any opportunity to get hugs from his friends, and they know by the end of the night, when they make their way to their apartment being aired out in the Upper Ring, Aang will end up underneath a second cuddle pile.\nAs they fly above the city, they wave down at the people below. Half of Zuko’s hair has come loose from his topknot, and the wind pushes at him, scrubs its fingers through his hair. Zuko smiles against the feel of it, his eyes clinking up until the lights of Ba Sing Se blur into an interrupted sea of gold.\n \n \n \nTraditionally, princes and princesses know they’re going to inherit the throne decades before it happens. They are born the eldest child of the reigning Fire Lord, and are groomed from birth to lead the country. They know who they are destined to be from infancy.\nZuko spent three years as the Crown Prince before his banishment. After Azulon’s death, lessons ramped up, and Ozai spoke to him with increasing coldness, and Zuko walked through the corridors were tapestries of his ancestors adorned in Fire Lord robes were hung, a knot in his throat. He wanted to be a good leader. He thought that that was what he wanted, more than anything—to make his family proud.\nAnd then he was banished. Zuko spent as many years out at sea as he did in the palace, being trained as the Crown Prince.\nHe’s not as poised as he should be. Sometimes, he trips over tradition, and isn’t entirely sure how certain meetings should be run, and he gets turned around in the palace, like he’s somewhere strange, rather than the place he grew up. He had expected that, coming back.\nWhat Zuko hadn’t expected, however, was the way he feels on the journey to and from Ba Sing Se. The ship is much grander than the small, rusted ship he had commanded during his banishment, and the crew is twice as large and infinitely more polite, but when Zuko stands out on the deck, he feels a little bit like he’s returning home. The noise of the waves, the scent of coal and salt on the wind, the deck rocking beneath his feet, and the scurry of men bustling through the ship—it’s familiar.\nSuddenly living on a ship and visiting foreign ports had been a cultural shock, but it had hurt, returning to the Fire Nation and feeling that same shock. Once-familiar things had soured and turned strange in the years he was gone.\nHe sees the surprise of his crew—a new, temporary crew—when he talks about the ship like he knows it intimately, when he greets them in the halls, when he corrects the Captain about how the wind will affect their trajectory. He does it all with an even temper, too. He knows he came close to mutiny more than once when he was banished. He has so much more power, now; he can’t be that kind of tyrant again.\nThe years he spent in exile trained him how to be Fire Lord, in a way. The experience he gained shaped him into a leader, more than any lessons about etiquette and tradition ever could. Banishing him was the best thing Ozai ever did.\n \n \n \n \nZuko walks back to his rooms, mind still focused on the reports and colour-coloured maps back in his office. The Fire Nation is stretched over the globe in colonies and camps and war ships, and the responsibility of calling everyone home en-mass falls to Zuko.\nBefore Uncle left for Ba Sing Se, he made Zuko promise to take care of himself. Uncle passed that promise on to Mai, and Mai passed it on to his head of staff, and she passed it on to his personal servants, and now, Zuko gets gentle reminders to eat and sleep and let his mind rest, reminders he can’t ignore because of his weeks-old promise to Uncle, even though he wants nothing more than to turn back around and work out to get thousands of soldiers and civilians back home.\nBut if he had ignored his servants soft-spoken reminders to get some rest, he wouldn’t have seen this. He would have continued working without knowing about the violence that took place under his roof.\nA serving boy, struggling to balance a large dish in his arms, trips on the end of a rug. He doesn’t make a noise when he falls face-first into the marble floors, but Zuko hears the sound of metal plates spinning into a wall. He turns around in time to see a noblewoman strike the serving boy across the face.\nThe boy hits the ground a second time, and then he pushes himself onto his knees and scoops up the honeyed fruit spilt across the floor, eyes downcast, the noblewoman bearing down on him from above. Juice soaks his loose cotton pants. His cheek is red. Zuko can’t tell from this distance whether or not his lip is split.\n“You clumsy idiot,” says the nobleman through her teeth. The serving boy, barely a teenager, murmurs apologises as he cups dirtied fruit in his hands. The noblewoman continues on as if she can’t hear him: “Do you have any idea how much these robes are worth? Do you think liquids can be washed out of fine silk?”\nThe noblewoman raises her hand again. Zuko catches her wrist in mid-air. Both the noblewoman and serving boy freeze.\nWith his other hand, Zuko flags down a passing servant. “Bring something to clean up this spill. Thank you.”\nHe releases the woman’s hand. She cradles it to her chest and drops into a low bow. “My Lord.”\n“Don’t strike my servants,” Zuko says in a tight voice. “I will not see the people under my care hurt, especially not because of a mistake, and especially not from an educated noble that should know better than to use violence to vent her frustrations.”\nThe woman twists up the hems of her skirt, pulling it up to show off the juice splatters on the pale red fabric. “My Lord,” she says again. “His clumsiness—”\n“We’re all clumsy sometimes. No one should be afraid for their own safety after making a mistake.”\nThe noblewoman is taller and maybe two decades older than him, but he doesn’t know her from his childhood. Maybe that is why his double-meaning passes over her head. Any of the nobles that had seen Zuko, the unlucky, least favoured child, growing up in this palace would know what he meant when he defended a child from being struck by someone older. By someone stronger.\nZuko turns away from the woman. He can’t look at her anymore. He’s too tired and he’s been working too hard on keeping his temper to blow up now.\n“What’s your name?” Zuko asks the serving boy.\nThe boy’s nose almost touches the ground. Zuko has seen dozens, hundreds, of men knelt like this in front of the Fire Lord. Zuko has knelt like this, too.\nThe boy’s eyes are focussed on the hems of Zuko’s robes. His eyes flick up, as though checking that Zuko is talking to him, before settling back on Zuko’s robe. “Ako, My Lord.”\n“Ako,” Zuko says, “are you alright?”\n“I’m fine, my Lord.”\nZuko extends a hand. Ako wrenches his gaze away from Zuko’s robes and looks up at him, properly looks at him. His yellow eyes are blown wide and one cheek is flushed a splotchy red in what would probably become a nasty bruise. He looks as though he doesn’t know what to do with Zuko’s hand, hovering, palm up, in front of his face, so Zuko bends down and grasps Ako’s wrist and tugs him to his feet.\nAko ducks his head, chin touching his chest, so Zuko can’t see his face. He’s still holding fruit in his fist, and juice leaks out through his fingers from where he is squeezing too hard.\n“It’s okay,” Zuko says in that even tone he used with Aang when he got too shaken up to remember that firebending was more than raw destruction. “You made a mistake. You’re okay.”\n“Yes, My Lord,” Ako says to the floor.\nThe second servant returns with towels and a jug of water to rinse the floor. Ako bends down to help him.\n“You don’t need to do that, Ako,” Zuko says. “You should go wash your face, take the time to calm down.”\nAko opens his mouth, as though to argue, but then snaps it shut quickly. He rises back to his feet, head bowed again.\nTo the noblewoman, Zuko says, “You can go. Remember what I said. I won’t be as calm if you strike a servant, again.”\nThe woman’s jaw is tight, but she bows, and says dutifully, “Yes, My Lord.”\nThen, Zuko turns back to the two servants. “If anyone hurts you like that, tell me or my head of staff. Tell your coworkers what I have said. I won’t let people be hurt under my care.”\nThey peek up at him as though they don’t know what to make of him. Zuko nods once, overcome with familiar awkwardness now that he has said his piece, before turning on his heel and striding away. All thoughts of reports and maps are gone. He wants, more than anything, to sleep.\n \n \n \n\nMy dearest nephew,\n\n\nIt’s only been two weeks since you were in Ba Sing Se, and already you ask for my advice? If only you had listened to me this keenly when you were younger.\n\n\nIn response to what you mentioned in your letter—remember, the reason we call someone leader is because they decide to go first. The nation looks to you as its example. But people cannot trust if they do not feel safe.\n\n\nIn lighter news, the Jasmine Dragon is hosting an unofficial Pai Sho tournament next Sunday. I have called in extra staff as I will be busy the entire day trying to earn my title as Pai Sho master. It’s times like these I miss you the most. Your customer service skills left something to be desired, but it was so good to have an extra pair of hands around to wait tables. It’s a shame being the Fire Lord is so important, or else I would have thought you were neglecting your uncle’s family business. You made a very good waiter.\n\n\nHave hope, nephew, and remember that kindness will be our guide in this dawning age of peace.\n\n\nSincerely,\n\n\nUncle\n\n \n \n \nZuko has begun to remove his ministers and generals from power, but it is a long and exhausting process. He’s going to replace most of them—he knows that, and they know that, he’s sure. They knew from the first time he hobbled into a meeting with a barely-healed lightning wound, a stack of drafts waiting to be legalised under one arm. Katara had come in to drag him back to bed soon after, but she says the way he stood at the head of the table, swaying under his own weight, half-delirious with pain, would have been frightening for anyone that hadn’t seen him covered in bison slobber. Something about the set of his jaw, she said. Something about the way the torches caught his eyes, so they looked like pricks of burning ice, cold enough to burn the room to ash.\nThe idea that he might scare his ministers is surprising, but maybe it shouldn’t be, considering that now he could kill them, could burn their faces and cast them into banishment, if he wanted to. He won’t. He couldn’t. But they don’t know that.\nBut the current government can’t stand. When he took the throne, Zuko gained the ministers who simpered under Ozai’s feet and Generals who brought his plans into being, people who were ready and willing to burn the world. They cannot stay in this time of peace. Zuko has justifiable reason to bring in new ministers and the power to make it happen, but it will take time for him to do it the right way. It will take time for him to find people he can trust to replace them.\nBut it’s okay. Now, Zuko is realising that he has time. Decades of it.\n \n \n \nWhen Zuko takes a break from training and sees a boy peaking at him from behind a pillar, he realises he hasn’t seen children in the palace since he was a child himself. A guard had been trying to coax the boy out, but he remains stubbornly out of reach.\nZuko wipes sweat off his brow with a cloth, and then makes his way over. The guard looks pained when she realises Zuko’s training has been interrupted.\n“Who is this?” he asks.\n“Katsu,” says the boy, stepping around the pillar, still managing to stay out of the guard’s reach.\nEvery time he sees a child, Zuko is surprised at how tiny they are. He remembers the cold shock that washed over him when he pinned Aang’s hands down for the first time, way back at the Southern Water Tribe, and realised how small his wrists were.\n“You’re a firebender,” Katsu says.\n“I am,” Zuko says.\n“I’m a firebender, too. I want to be able to bend like you one day.” Katsu whirls around in a clumsy stance and thrusts his fist out. A cloud of smoke and sparks jump from his knuckles. Katsu looks disappointed at the lack of real fire. “I’m not very good at the moment, though.”\n“That was great,” Zuko argues. “Your smoke is dark. My smoke was pale for the first twelve months. How old are you?”\n“Five,” Katsu says.\n“Do you want to know a secret?” Katsu looks excited and nods his head up and down, so Zuko kneels down and whispers, “I couldn’t firebend until I was six.”\nKatsu’s mouth opens. “But I saw you bending just now—you’re so good. You must be the best firebender in the whole world. You had colours in your fire. No one ever has colours. How did you do it?”\n“I listened to my teachers and practised.” Zuko pauses. He’s barely an adult, but he’s an authority figure. What do authority figures say to kids? “And I ate my veggies every night.”\nKatsu pulls a face like he knows, even at five, that Zuko is lying to him. The guard bites at her lip to stop from snickering.\n“Now, Katsu,” Zuko says, “do you know how you got here? Where are your parents?”\n“I got lost,” Katsu says. “My Mum is thinking about working here and she brought me along since our neighbour is sick and couldn’t watch me. I went to explore and then I heard firebending …”\n“And you wanted to come see,” Zuko finishes. “Right. Well, we should probably go find your Mum.”\n“I can take him, sir,” says the guard.\nKatsu latches onto Zuko’s training pants and eyes the guard like he thinks she might wrench him off Zuko with force.\n“It’s okay,” Zuko says. “I’ll take him.”\nKatsu takes Zuko’s hand before Zuko can offer it, and he stares down at the place where their fingers are tangled together. Such small hands, he thinks. Small, and unblemished, and trusting.\nWith every passing day, he understands his father less and less.\nThey weave through the halls in search of Katsu’s mother. Katsu keeps up a steady babble of chatter as they go.\n“The Fire Lord has a scar like you do, you know,” Katsu says, and Zuko almost trips over his own feet.\nHe’s in his training clothes. Plain pants and a loose t-shirt. No crown. His hair is pulled back into a ponytail at the nape of his neck. Of course a child wouldn’t recognise a sweaty, dressed down teenager as the Fire Lord.\nZuko keeps his voice even, casual. “Oh, really?”\n“Yeah, so you shouldn’t be ashamed of your scar. The scar means the Fire Lord is strong and brave. That’s what Mum says.” Katsu leans in, like he’s whispering, even though he’s talking at regular volume. “I asked Mum where he got it, and she said the last Fire Lord gave it to him—the Fire Lord’s dad. Just ‘cause he said something rude.”\n“Really?” Zuko is proud of how steady his voice comes out, even though he feels torn between laughing and crying.\n“I like the new Fire Lord better, anyway.” If this were a different time, if the nation was run by a Fire Lord like Azula, such a sentence could be borderline treason. It suggests that the other option, not liking the Fire Lord, is a possibility.\n“Why’s that?”\n“He’s letting my dad and big brother come home. They’ve been fighting in the war for a long time.” Katsu squirms and his hand almost slips out of Zuko’s. “I haven’t met my brother before. He left before I was born. What if he doesn’t think I’m family? What if he doesn’t like me?”\nBefore Katsu was born. Katsu’s brother has been away from home for over five years. Zuko had been forbidden from returning home for over three years, and for a long time, there had been no foreseeable end to his banishment. It had eaten a hole through his stomach. Is that how soldiers across the globe had felt, being kept from their home and their families by the unending war, while knowing that they might die before they make it home? It sounds like torture. Zuko keeps finding new reasons to be grateful that the war is over every day.\n“I’m sure he’ll like you,” Zuko says, even though he’s not really qualified to be giving advice to siblings on how to foster a healthy relationship.\n“Really?”\n“Of course.”\nThey head away from Zuko’s wing of the palace. Katsu is interested in the gardens, and tapestries, and gilded doorways. By the time they find his mother, she’s worked up, half-jogging through a courtyard as she calls out Katsu’s name.\n“Mum!” Katsu waves. His mother looks up, sees her son, sees the man holding onto his hand, and looks like she’s going to pass out.\n“Mum,” Katsu says when she scurries over, “I met a firebender! His fire has colours and everything, even though he didn’t start bending until he was six.” Katsu slaps a hand over his mouth. “That was supposed to be a secret.”\n“It wasn’t really a secret,” Zuko says.\nKatsu hadn’t recognised Zuko in his training clothes, but his mother does. She drops into a low bow, her braid dangling over one shoulder and almost touching the floor.\n“My Lord,” she says, “please forgive me. I’m sorry for the intrusion.”\n“It’s alright,” Zuko says. “Katsu didn’t cause any trouble. He’s a curious kid. Curiosity can be a valuable trait.”\n“Mum?” Katsu looks from his mum to Zuko, not understanding what is happening.\n“Go with your mum, now,” Zuko tells him. “Don’t wonder away from her again, okay? I’m sure you scared her when she couldn’t find you. And remember to practise your firebending.”\n“I’m going to practise everyday until I’m better than you,” Katsu says, and his mum chokes on her next inhale.\n“I hope so.” To Katsu’s mum, he says, “You have a good son. I hope your husband and eldest have a safe trip home.”\nShe straightens up, one hand pressed against her sternum, and she looks like she doesn’t know what to do with Zuko’s kindness. If he had yelled her, she could have understood. But his gentle smile, his easy words—it rattles her.\n“Thank you, My Lord,” is all she manages.\nKatsu’s hand drops out of his. He stares up at Zuko with big eyes. “Should I bow?” he asks.\nZuko can’t stop the laugh that bubbles up his throat. “No, you don’t need to bow.”\nZuko bids them goodbye. As he leaves, he hears Katsu say, “Mum, I was right. The new Fire Lord is the best one yet.” He stops, and then adds, with some disgust, “He told me to eat my veggies, though.”\nZuko manages to wait until he’s in an empty corridor before he bursts out laughing.\n \n \n \nZuko wants to argue against this. It feels wrong to allow a tapestry of his image to be woven with fine silk and gold threads while knowing that the outer reaches of his nation are struggling. But his advisors are right—there have been enough whispers about the way Zuko had risen from exiled prince to traitor to Fire Lord. By hanging his image beside his ancestors, he would be securing his place as the blood-right heir.\nZuko had been raised in the palace. He had thought that coming back to a life of luxury would be easy, but the gross displays of wealth and power are hard to stomach after everything he’s been through. He floated for weeks on driftwood in arctic waters. He almost starved on the dusty Earth Kingdom plains. You don’t forget that.\nBut he makes himself sit for the head weaver at least an hour a day. He usually spends these hours filling out paperwork and drafting bills or letters to his friends or foreign dignitaries, but today, Zuko can’t pull his eyes away from the weaver’s fine hands. Charcoal and ink sketches are stacked in her lap.\nIf the final battle had ended differently, this woman would be capturing Azula’s likeness, not Zuko’s. Perhaps his father would have demanded more tapestries of himself, too, to commemorate his promotion from Fire Lord to Phoenix King.\nAnd Zuko’s image would have been lost forever. History would have remembered him as the traitorous son of the great Phoenix King Ozai, a son who knew nothing of loyalty or respect, who wrongly sided with the foolish Avatar in a bid for power—\nAfter his victory, though, history will remember him as a different man.\nThe weaver lowers her sketches. “My Lord …”\nZuko wrenches his gaze away from the beginnings of the tapestry, set delicately on the side table. “Yes?”\n“I was wondering, My Lord, what it is you … That is …” She wets her lips and looks anywhere but at his face.\n“You don’t have to be nervous,” he says, though his tone doesn’t have half the patience and mercy she deserves. He’s been working on becoming a better person, a better leader, for a long time, well before he was properly crowned, but he finds it hard to wrestle his temper down, sometimes.\n“Your scar,” she says.\n“Ah,” Zuko says, and tries to ignore the way she ducks her head at his tone, her greying fringe falling into her eyes—more a flinch than a bow. “Include it. Don’t try and hide it or distract from it. It’s a part of me and my story, even if it might not make for an attractive tapestry.”\nShe peaks at him from beneath her hair. She’s gained some of her strength back. That’s good. His people have never been the type to cower, even if a century of violence was left wounds on them all.\n“My Lord, you underestimate my skill. Every part of this tapestry will be beautiful.”\nHe can’t help but laugh. “I didn’t mean to insult a master of her craft. Continue, please.”\nShe makes a mark on the parchment and then bends down and picks up the tapestry, inspecting the work that has already been done. The final product will take up the better part of a wall. What she holds in her hands looks smaller than a throw cushion.\nShe has a small fleet of apprentices working for her, he knows. How many people will see it when it’s complete? The tapestry of the young, scarred Fire Lord will hang in these halls for centuries.\nZuko stopped feeling ashamed of the scar a long time ago. It would be an insult to his people if he was still embarrassed about it; he has already heard about Fire Nations civilians with disfiguring burns that have begun to take pride in the scars they were once ashamed of. People are reclaiming their marks because their young Fire Lord bears the same scars, and it is not a sign of his defeat. It is a reminder of his bravery. It is a testament to his strength that he could overcome a man as merciless as Ozai.\nZuko had heard his story circulating through ports and naval bases when he was chasing the Avatar, even if Uncle attempted to shield him from the worst of it. The way the Fire Nation officials had spoken of his Agni Kai had reinforced all of Zuko’s ugly, self-blaming thoughts and drowned out the words of passing Earth Kingdom people, who reviled any man who would hold a flame to his child’s face.\nNow, though, the Fire Nation tells a different story. There are still those that see his scar as further proof that he is unfit to rule, but there would always be people who despise him and everything he stands for. A larger part of the nation sees his scar as something else. A reminder of what kind of beast the last Fire Lord was. A mark of Zuko’s strength that he could overcome him. A sign of Zuko’s honour\nThe scar made him strong and brave, Katsu had said. Zuko keeps the words, the memory of his face shining up at Zuko with certainty as he spoke of the new Fire Lord, tucked close to his chest. From the mouth of babes, Uncle would say.\n \n \n \nSoldiers pour from the port like ants. They cannot see him from his place on the balcony of the Mayor’s office. His eternally present guards hover behind him, and Zuko wonders if they want to step forward and take a closer look at the sight unravelling beneath them.\nMany of the old ministers Zuko is working to replace see soldiers coming home in droves as a defeat. Zuko doesn’t understand it. If they were here, breathing in the salt air beside him, they would change their mind. How can anyone see a soldier jogging down the jetty and falling to his knees to embrace his crying children, planting frantic kisses into their hair, reaching out with one hand to grasp for the hand of his waiting wife, and see defeat?\n \n \n \nWhen Zuko was a child, the official age for military enlistment was 16. In the last years of the war, after Zuko’s banishment, Ozai pushed the age down to 14. Zuko didn’t hear the announcement in person. He heard it the way he heard everything, those days—through rumours circulating around inter-nation ports.\nOzai said that the Fire Nation was making its final push towards glory. He said young men and women would have the chance to bring honour to their families by helping to spread their superior culture to the world. He said the youngest soldiers would be contained mostly to the mainlands and colonies to fill desk jobs and keep Fire Nation-owned bases running so experienced soldiers could be out fighting on the front lines.\nZuko heard what soldiers and foreign countrymen thought of this law, too. He learnt a lot about what people thought about Ozai in those days. Traitors, he had called them. Cowards without honour. Dirt eaters. He called some of them these insults to their face before Uncle had jumped in and dragged him away, even if something he refused to name took root in Zuko’s chest. His father was the Fire Lord; he knew what was best for the country. Zuko was a loyal son and didn’t know how to run a nation, let alone how to win a war, and even if the thought of boys and girls who were his age—who were Azula’s age—being recruited to the army made him want to throw up—well, Zuko had been stripped of his honour. What did he know?\nTwo years have passed since Ozai first changed the enlistment age, and the horror is still there in Zuko’s chest, amplified twofold by the reports that are piling in.\nA ship carrying several divisions of soldiers—many of them injured, and most of them underage—was due to land in a few days. Zuko sails out to meet them with as many healers as he can carry.\nThe 107th regiment is the youngest in the army. They were officially assigned to man the Fire Nation bases inside Earth Kingdom territory, but when the Earth Kingdom retaliated and more soldiers were needed and no general sent back-up, they were sent in to fight.\nThe division’s Captain is Uncle’s age. His grey sideburns are uneven. He bows to Zuko when he boards.\n“My Lord,” he says. He stands with perfect, straight-backed posture, even if he looks like he might fall over with exhaustion. He bares the attention of his Fire Lord with a serious expression. Haunted, Zuko corrects. Not serious. His eyes seem almost vacant.\n“I’ve brought healers,” Zuko says, “as many available as I could find.”\nHe steps aside so the healers may board. A girl, maybe a few younger than Zuko, steps forward to lead them down to the lower decks.\n“Thank you, My Lord,” says the Captain.\nZuko opens his mouth. Hesitates. “I heard that children weren’t supposed to see active combat.”\n“That was what we were told at first, My Lord,” says the Captain. “But then …”\n“But then,” Zuko agrees. But then platoons of soldiers were lost and needed replacing. But then the Fire Nation wrestled more land from the Earth Kingdom and more soldiers were needed to guard it. But then the Fire Nation’s attacks got bigger and more ambitious, and required more warm bodies to push their territory forward.\nZuko takes a steading breath. On his exhale, steam comes out of his nose. The Captain takes a step back.\n“Sorry,” Zuko says, and ignores the wide-eyed look the Captain shoots him. A Fire Lord should not apologise. That is what he has been taught from infancy. “I knew it was bad, but hearing this is still …”\n“They’re children,” says the Captain.\n“Yes,” says Zuko. “This shouldn’t have happened to them.”\nSome of the tightness relaxes around the Captain’s eyes, and Zuko thinks, How many higher-ups has this man talked to? How many people looked this man in the eye and told him that they didn’t care how old the children under his care were, they were expected to fight and potentially die for their country? Did he expect Zuko to do the same?\nThat nauseous feeling is back. Zuko swallows and exhales steam again, and focuses on not vomiting all over his Captain’s shoes. His ministers haven’t instructed him on where a Fire Lord should or should not throw up, but he’s sure on his traumatised officers isn’t the right answer.\n“Send them home,” Zuko says. “If they’re still injured and their families can’t afford for them to continue seeing a healer, the government will compensate them. There are shelters and foster families for those that don’t have places to go.”\n“Foster families?” The Captain says the word slowly, like he’s testing how it feels in his mouth.\nZuko explains the new foster family programs, and some of the blankness leaves the Captain’s eyes. He has a good track record. Zuko has read his files, he knows that he was almost discharged for arguing, again and again, with the orders to send teenagers into the battlefield. Most of the combat that they saw was the unavoidable kind, because they were ambushed or because the Captain had been told they were send them somewhere worse if he continued refusing. If he wants to redeem himself by finally providing a safe place for kids, after a year of being unable to do so, then Zuko won’t stop him.\nZuko talks to some of the soldiers, the ones not too feverish to know what is going on around them. Many of them were fourteen when they were recruited. Now, they’re around his age.\nZuko leaves most of the healers onboard. Before he steps onto the gangplank, the Captain stops him.\n“My Lord,” he says, “may I ask—how old is the Avatar?”\nIf this was a different officer, Zuko would hesitate longer before answering. “He’s thirteen.”\n“And …” The Captain stops like he’s choked on his own tongue.\n“Yes?” Zuko prompts.\n“My Lord,” says the Captain, “how old are you?”\n“Old enough,” Zuko says, and heads back onto his own ship before the Captain can ask anymore questions that Zuko doesn’t know how to answer.\n \n \n \n\nThe Fire Nation is broke.\nSozin militarised the country, and Azulon and Ozai continued their armament. Families had spent generations making a living from the war. Factories had churned out weapons and armour for a century. Sons of sons of sons held careers in the army. Coastal villages had forgotten a time when they were anything more than a poverty-stricken extension of naval bases.\nThe war ended lives and pulled funds away from vital areas, like culture and education, but no one could deny that it made money. It created jobs.\nAnd Zuko had shut down that century-old moneymaking system in one brutal swoop.\nThe mass exodus of Fire Nation citizens from Earth Kingdom colonies and soldiers marching home from years abroad means there is an influx of displaced people, too.\nCountries financially and physically gutted by the Fire Nation had been considering war reparations. Thankfully, Zuko has the Avatar in his corner. Aang has been speaking to foreign leaders on his behalf and convincing them to focus on peace and rebuilding rather than ruining the Fire Nation’s economy. It also helps that Zuko is personally acquainted with people like Chief Hakoda of the Southern Water Tribe.\nZuko still sends foreign aid, even if his friends had helped quieten the demand for reparations. He has been fighting the older ministers that remain to create a skeleton welfare system to assist disabled ex-soldiers, widowers, and newly unemployed peoples who would’ve ended up on the streets without his help. He has been overseeing the construction of orphanages throughout the nation.\nZuko is busier than he’s ever been, and it’s hard work, frustrating work, but he finally feels as though he’s making progress. Zuko knows how to work for what he has, how to struggle; sometimes, it feels like it’s all he knows how to do. This is a different kind of battle than Zuko is used to facing, a battle of politics and tradition and trade, but Zuko is learning. He’s improving.\nFor the first time since Uncle said that Zuko should be crowned the next Fire Lord, Zuko feels as though he can do this.\n \n \n \nZuko had been looking forward to having his friends in the palace again. They bring excitement wherever they go; however, there’s only so much excitement the Fire Nation, a proud and serious country, can handle.\n“A dance?” Zuko says flatly.\nAang bounces on his toes. From his place behind his desk, Zuko can’t see if Aang’s feet are on the ground, or if he’s risen a few inches off the office floor. His weightlessness stopped being strange to Zuko months ago. Sometimes, though, he sees the palace staff’s bewildered faces as they watch Aang flit about the high-ceilinged palace as though unaffected by gravity.\n“It was one of my favourite things about the Fire Nation. There would be grand festivals every year.” Aang pivots on his heel and falls into a loosely structured dance, hands swaying in the air. “There were dozens of dances. Everyone would come together to celebrate and dance, and there would be brilliant lanterns strung up everywhere, and so much food, and—and now, people in the Fire Nation don’t even know how to dance.”\n“I don’t know these dances, either,” Zuko says, and only just stops himself tacking on, And I have no desire to learn.\n“I know them, though,” Aang says, “and other people have to know them, too. It can’t have been completely forgotten.”\nAang is still twirling around his spacious office like a cherry blossom petal caught in the wind. Aang always bounces from place to place effortlessly, appreciating cultures and making friends everywhere he goes. He’s a likeable kid. He belongs everywhere. It’s easy to forget that he’s the last of his people, the only person left who remembers his culture and customs. Some knowledge remains in the Air Nomad scrolls and artefacts that survived the attack and centuries of pillagers, but there are large chunks of Air Nomad culture that will never be recovered.\nZuko’s culture had been—stifled, he supposes is the right term. The war had eaten away at all of the nations. He still remembers the Southern Water Tribe, a shrunken village made up of women, children, and the elderly, tiny compared to the mighty force of the Northern Water Tribe. Across the globe, blood has been spilt and families decimated; in comparison, the Fire Nation losing traditional dances and festivals feels small, incomparable, but it still niggles away at Zuko.\n“Well,” Zuko begins, “no one has much money at the moment, especially the national treasury.”\n“It won’t cost much,” Aang says. “Food vendors would jump at the opportunity to set up stalls during a festival.”\nZuko considers this. “Hm. It may encourage spending.”\n“You might need some lanterns for decorations, but you’re all firebenders, it won’t take much to keep them lit. It’s making sure everyone knows the dances—that’s the main issue.”\n“I have the contacts of a few cultural experts. I assumed most of them would be concerned with maintaining traditions like my coronation ceremony, but if we’re reviving old dances, then maybe I could talk with them …”\nAang watches him rifle through his scrolls and mutter under his breath about planning and approval and city plans. A smile blooms over his face. He jumps so high his fingers brushed the ceiling.\n“We’re having a party!”\n“Maybe,” Zuko corrects.\nBut nothing can put a damper on Aang’s excitement. He dances around the office, commanding the wind with every artistic placement of his feet. “We’re maybe having a party!”\n \n \n \nThe festival begins in the late evening. Vendors have set up their stalls, musicians are strategically posted throughout the city, so music can be heard wherever you go, and lanterns hang in ropes, bathing the streets in soft candlelight. There will be dancers, later. Masters of the long-forgotten craft will coax people into an easy rhythm after the first dance of the evening has finished.\nUncle has returned to the Fire Nation for the festival. He sets up a stall a few minutes from the city centre. It’s large and comfortable, with canopied ceilings, and low tables and lounges for customers to sit on.\nTiny lights float through the air like fireflies, low enough to avoid the flammable gossamer draped along the top of the stall, but high enough to avoid the heads of passing customers. Precise firebending like this takes years to master, but Uncle manages it without even sweating.\nUncle has pinched his favourite servers from the palace kitchens without telling Zuko. They all look happy to work for Uncle, serving tea and talking to customers, so Zuko doesn’t nag Uncle about protocol.\nUncle moves between tables to check on his customers. Everyone is flushed with warmth from the tea, from the floating lights, from the contagious energy of the festival, and they open up under Uncle’s friendly attention. Uncle is in his element here. It settles something in Zuko’s chest to see Uncle so at peace.\n \n \n \nZuko meets his friends in Uncle’s stall an hour after the festival begins. He has reserved a table at the back for them. Gossamer is draped over the table like a curtain, separating them from the throng of customers.\nAang tells him about his Fire Nation friends that he invited to the festival. He says they will arrive soon. Zuko isn’t sure how Aang managed to make friends while hiding in enemy territory, and when Katara and Sokka pitch in to help tell the story, he’s still not sure he understands.\nZuko squints at the pale green tea cupped between his hands. “What did Uncle put in this? It can’t be just tea, because I could have sworn you said—”\nKatara cocks her head to the side like she thinks Zuko is especially slow. “Sapphire Fire, yes.”\n“Sapphire Fire,” Zuko repeats.\nSokka rubs at his bare upper lip like he’s twirling an invisible moustache. “And I’m Wang Fire, her curmudgeonly husband. We’re from the colonies.”\n“Wang,” Zuko says in a strangled voice. Beside him, Toph cackles and thumps at the table with her fist.\n“Realistic Fire Nation names, right, Zuko?” Katara’s head is still cocked. Her expression is innocent. Zuko knows when he’s being mocked.\n“How did you all avoid being caught?”\n“Hey, our disguises were great,” Sokka says. “We’ve always been good at hiding in plain sight.”\n“You know,” Zuko says, “I regret my actions in Ba Sing Se, but I’m kind of relieved that I didn’t have to watch you four pretend to be Fire Nation citizens. It would’ve given me a stomach ulcer.”\n“I thought we did pretty well,” Aang says.\n“Sapphire Fire,” Zuko repeats again.\n“The names were Sokka’s idea,” Katara says, “but in this family we stick with each other’s false identities, no matter how ridiculous.”\nAang snicks and elbows Katara, so Zuko assumes he missed out on months worth of outrageous aliases while he was chasing them around the globe.\nBut, really. Sapphire Fire. Was this the kind of stealth techniques that alluded him for so long?\n“I wish Zuko could’ve been there,” Toph says. “I wanted to hear his dumb voice when he had to dress up and use whatever crazy name Sokka gave him. Hearing the Fire Nation prince address himself as ‘Mr. Fire’? Priceless.”\nSokka continues stroking his invisible moustache, before snapping his fingers and pointing at Zuko. “I got it—Phoenix Fire. Kuzon’s older brother. My eldest son.”\n“Badass,” Toph says.\n“Son?” Zuko says. “I’m older than you.”\n“Hey, watch your tone, young man. I will take you over my knee if I have to.”\nKatara places a hand on Sokka’s shoulder. “Wang, be patient with the boy. You know he’s sensitive.”\nToph chokes on her laughter, bent almost in double. Aang’s lips are pressed together, trying to stop himself from laughing in Zuko’s face, since he is, apparently, the only decent friend at the table. He’s turning faintly blue from lack of air.\nZuko is glad they’re not out in the open, so his people don’t have to watch their Fire Lord being laughed at.\n“Please stop pretending to be my parents,” Zuko says. “It’s so wrong.”\nSokka turns to Katara and shakes his head. “Our boy is so disrespectful. We should have drowned him in the well when we had the chance.”\n“I take it back. You sound just like my dad.” Zuko runs a hand through his hair and laughs. “Although, he’d probably then say something about giving the drowning thing another shot if I didn’t improve. I mean, Azula actually did try a few times, and Ozai liked to watch and give her pointers on how to hold me down, so props for accuracy.”\nHe laughs, but then breaks off awkwardly when he realises none of the others are laughing with him.\n“Let’s move on from that before I start crying—” Sokka says loudly, and from the tight set to his jaw, Zuko thinks he might actually start crying if he thinks too hard about what Zuko just said.\n“Did Azula actually try and—?” Aang says, like the idea is so incomprehensible he can barely put it into words.\nZuko fiddles with his cup. “We had a lot of ponds and fountains around the palace. Azula got bored easily.”\n“And Ozai stood there and encouraged—” Katara cuts herself off.\nZuko clears his throat. “I shouldn’t have brought it up. Sorry if I made you guys uncomfortable.”\n“That’s okay,” Aang says. A stifling silence hangs over them.\n“You know,” Katara says abruptly, “Sokka actually glued the moustache and beard to his face for the disguise.”\nThe subject change is unsubtle, but Zuko appreciates it nonetheless. “Oh?”\n“Yeah, it was stuck to him for three days.”\n“Katara!” Sokka squawks.\nThe image of Sokka going about his day with a fake beard glued to his face pops into Zuko’s head, and he laughs so suddenly that tea gets sucked into his lungs. The tense atmosphere fizzles away.\n \n \n \n \nThey spilt up, after that. Zuko goes through the festival greeting and thanking all the important people: store-owners, event planners, dancers, the handful of historians and cultural experts who advised him on how to make today as accurate as possible. He knew he would have his work cut out for him trying to keep an entire country happy, but he hadn’t realised he also had to keep so many individuals happy, too. It helps that Zuko is genuinely thankful for their effort. From the way the people light up under his praise, appearing so happy beneath soft lantern light, Zuko assumes he’s able to properly communicate his gratitude.\nThe next time Zuko sees Aang, he’s surrounded by a huddle of schoolchildren. He seems at ease with kids his age.\n“Aang,” Zuko says, cutting through the enthusiastic chatter, “the harmony dance will begin soon.”\n“Zuko, hey! Has it really gotten that late?”\n“We still have another twenty minutes or so. Just don’t forget.”\n“Right, I won’t. Promise.” Aang turns back to the kids with a wide smile, oblivious to the way they’ve gone still, like prey freezing in front of a much bigger predator. Their eyes are fixed on Zuko. On his scar. On the Fire Lord crown that glints under lantern light. “Guys, this is my friend, Zuko. He taught me firebending. Zuko, these are some of my friends from school.”\nZuko shakes his head. “I still can’t believe you went to school in the Fire Nation when you were an enemy of state—a presumed dead enemy of state—and threw a … dance party, was it?”\nSokka melts out of the crowd with a drumstick the size of his head, lathered in honey sauce. He thumps Zuko on the back. “Hey, if you think your head hurts, imagine how I felt when he first tried to run the plan by me.”\n“A dance party,” Zuko says again. It’s been almost an hour since he heard the story and he still struggles to believe it.\n“In a cave,” Sokka says.\nThe girl with a severe fringe and a ponytail—On Ji, Aang had said—delicately clears her throat. “My Lord, I’m sorry, but aren’t you throwing a dance party for the entire Fire Nation?”\nSokka splutters out a laugh and Aang turns to his friend with a proud smile. The rest of the kids look amused for half a beat, before their eyes flick to Zuko and they freeze—with horror, this time, rather than shock.\n“Forgive me, My Lord,” On Ji says quickly, dropping into a low bow. The other kids follow suit. Aang frowns like he can’t work out why Fire Nation schoolchildren from a small coastal village would scrape and bow in front of Zuko. Sokka keeps munching at his drumstick.\n“It’s alright,” Zuko says, spreading his hands out and pulling out the especially kind smile he wears around jumpy servants and young children. “You’re not wrong. This is a dance party, but I can’t take all the credit; Aang was the one that suggested it.”\nShoji laughs behind his hand. It’s a nervous little sound, but it’s progress. “Two Fire Nation parties within six months?”\n“It’s not enough!” Aang says, and they all laugh. Some of the tension melts out of the air. Aang is good at this—bringing clashing groups of people together. It’s one of the many reasons why he is so effective as the Avatar and why Zuko trusts him so much.\n“Hey, aren’t you going to introduce me?” Sokka says. He waves his drumstick in the air, and Zuko grabs his arm and wrenches his wrist away before he splatters honey sauce all over the gold and crimson embroidery on his outer robes.\nAang rubs sheepishly at the back of his head. “Everyone, this is Sokka, my friend from the Southern Water Tribe. He’s Katara’s brother. You met Katara earlier. Sokka, these are my friends.”\nAang cycles through their names again, and the kids bow in greeting. Sokka waves at them. Zuko doubts Sokka was this calm or welcoming months ago in that cave, when they were one wardrobe malfunction away from being exposed as Fire Nation fugitives. Sokka also didn’t know many firebenders back then. He certainly wasn’t close friends with the Fire Lord.\nSokka throws an arm around Zuko’s shoulders and squeezes. “Don’t let this guy scare you. He’s friendly, I promise. Any friend of Aang’s is a friend of ours, right, Zuko?”\n“Right,” Zuko says.\nThe kids don’t look like they believe him. They’re smiling, but it looks pained. The kind of smile you would aim at a hungry tigerdillo to try and dissuade it from eating you.\n“Well, it was nice meeting you,” Zuko says, and even this small politeness makes the kids look faint again. People never reacted like this to meeting him when he was the Crown Prince, but then again, Zuko is the Fire Lord now. He doesn’t remember the previous two Fire Lords being polite towards him, let alone kind, and Zuko had been their immediate family. “I have to leave to prepare for the harmony dance. I hope you all enjoy the festival and get involved. Perhaps seeing younger people dancing will encourage the older people to join in as well.”\n“We’d be honoured, My Lord,” says On Ji, bowing again. The others bow stiffly behind her.\nZuko turns to go, but then stops. “Oh, and may I seek you out later? We’ve been considering changes to the education system, and I’d like to talk to students before that happens. You know better than anyone what schools are like now.”\n“Yes, My Lord,” On Ji says.\nSokka bids the group a more casual goodbye, and follows Zuko through the crowd. They’re not quite out of hearing range when they hear the kids exhale as one, like drowning men breaching the ocean’s surface, and start babbling to one another.\n\"My life just flashed before my eyes.”\n“Did that just happen? Shoji, hold me. My knees are giving out.”\n“On Ji, I can’t believe you just said that—”\n“I thought it was crazy that Kuzon turned out to be the Avatar, but no one said anything about meeting the Fire Lord. Aang, you never said we’d meet him!”\nThe crowds turn and flinch when they see Zuko’s shimmering crown. They drop into quick bows as they sweep past. This is more routine. The sound of the schoolchildren yelling at one another over the sound of Aang’s laughter, however …\n“Was that too much?” Zuko asks. “Was I too much?”\n\"Are you kidding me? That was the funniest thing I’ve seen all week.” Sokka sucks up the last of the meat and snickers against the yellowed bone. “Man, I thought they were going to cry. At you. You.”\n“I’m very scary,” Zuko informs him, and that only makes Sokka laugh harder.\n\"Oh, yeah,” Sokka says. “Very intimidating. Very manly. Off to go do a fancy synchronised dance with two girls and Aang.”\n“Don’t let Katara and Toph hear you say that. I wouldn’t save you from their wrath.”\nSokka wisely shuts his mouth.\n \n \n \nThe harmony dance takes place an hour after dusk. A large space has been cleared in the city centre. Guards usher the crowds back a safe distance.\nAang, Katara, Toph, and Zuko space themselves out in a circle. They’ve changed into formal clothes from each of their cultures, though Toph’s shoes are missing, and Katara has forgone wolf furs so she doesn’t overheat in the Fire Nation summer.\nZuko has shed his heavy outer robes. His clothes are hemmed in gold, but they’re lightweight and without armour. They remind him in part of the clothes he wore when he fought Azula, and in part of the Sun Warriors’ attire. His crown is the only thing that marks him as royal.\nThe band, on a tall platform off to one side, start up a slow and steady drum beat. The four of them take up a starting pose.\nThe harmony dance, known more commonly as the Avatar’s journey, is a traditional dance with a long history. It hasn’t been performed in over a century. Normally, the dance has five participants—the Avatar and their four bending teachers. The masters bend and dance in synchronised harmony with the Avatar shifting and moving between them, the bridge between the four elements.\nToday, though, there are four of them. Aang is only representing air. He didn’t want the dance to draw attention to his role as the Avatar, the way the dance is designed to—he wants the dance to celebrate the combined harmony of the four elements, working together as nature intended.\nThe music picks up and they move into the next bending position, and then the next, and the next. They move around the circle in tandem. They step and spin and move together, even as their styles remain unique. Toph is hard and unmoving where Aang is weightless; Zuko is fierce where Katara is fluid.\nAs they move faster and faster, they begin to bend. Air swirls through Aang’s robes. Water follows the arch of Katara’s arms. Chunks of the earth pull away from the ground and chase after Toph. Ribbons of fire twist around Zuko.\nThe beat of the song changes and so, too, does their bending. This is a new aspect of the dance; once, the change in rhythm guided the Avatar as they switched between each element, but now, they switch bending styles.\nThey move away from their proper bending forms and begin to dance like the person to their left. Zuko feet come down in a stomp like an earthbender, and Toph softs her spins so each movement seems less jerky, more fluid, like a waterbender, and Aang drops into an aggressive lunge, flames bursting in his air currents, dancing like a firebender, and Katara is lightweight as she twirls like an airbender.\nTheir form isn’t proper, but their bending doesn’t stop. Zuko still bends fire even as he moves like an earthbender.\nThe song shifts again, and their bending falters even more as they move into the style of their opposite element. Zuko mimics Katara’s grace. Katara is naturally fierce and takes to the forwardness of firebending with ease. Aang moves into the solidness of earthbending and dirt granules whirl through his air currents. Zuko is concentrating on maintaining his crackling strips of fire as he moves like a waterbender, but out of the corner of his eye, he sees Toph wobbling as she tries to spin like an airbender.\nThe beat changes. They switch styles again. Zuko flows up onto his toes and whirls around like an airbender. Their bending has picked back up, now that they’re in a style more resembling their own. His fire thickens and grows hotter in the air.\nThey’re almost done.\nThe song shifts for the last time, and they’re back into their individual styles. Zuko thrusts into a low lunge and his fire is propelled forward. Colours emerge through the flames. Greens and pinks. Colours that have been lost to firebenders for an age.\nAang moves like a hurricane, and Katara commands a tall wave. Toph strips the square of its earth. There is metal there, too. If any of them were to lose control, their elements would be flung out and maim the crowds around them.\nThe song begins to peter out. Traditionally, this is where the masters would move away and the Avatar would begin to dance on their own, commanding all four elements, but Aang twirls, throws a gust of wind into the sky, and folds himself into an end pose, going still like a performer frozen when the curtains close.\nThe three of them continue on a few more steps, and then Katara throws her water into the air. It fizzles out and falls over the crowd in harmless raindrops. She curls her arms over her neck like a sleeping swan and goes still.\nToph and Zuko surge onward, until Toph shoves her hands down and the earth reforms with the ground, and she, too, stops moving. Now, it’s just Zuko dancing in front of his assembled people. The song begins to wind down and Zuko breathes in and in and in, and then steps sharply on his heel and releases. A funnel of rainbow fire flows above the capitol. He strikes an end pose. The music stops.\nSilence rings out over the capitol, long enough for Zuko to begin to regret the entire festival. He can hear his friends breathing heavily around the circle, still frozen in their own end poses.\nAnd then, at once, the crowd starts applauding. They melt out of their end poses and line up and bow. The cheering continues. It echoes up the side of the volcano.\nZuko can see Aang’s friends in the crowd, jumping in place and applauding. Sokka is a burst of blue off to the left. He’s shouting something that Zuko can’t hear over the crowd, wearing a smile that’s too big for his face.\nZuko spots Uncle off to the left, flanked by guards. He’s crying. One of the guards is flapping his hands like a possum chicken and trying to offer Uncle a handkerchief, but Uncle only has eyes for Zuko.\nZuko lets himself be swept away by his guards to change back into his robes. Toph wanders off to find Sokka and make him escort her to the meat stalls, and Aang and Katara stay in the centre circle to help the master dancers lead the shy crowds into some beginner-level dances.\nAn office has been opened for the Fire Lord’s use this evening. The guards flank the door. Zuko doesn’t even have time to wash the sweat off his face before Uncle bursts in, crosses the floor, and drags Zuko into a hug.\n“It was one dance,” Zuko says. His hands rest on Uncle’s shoulder blades—not returning the hug with as much fever as Uncle, but relaxing bonelessly into the hold. “I wasn't even that good.”\n“It was more than a dance,” Uncle says. “It was a sign of the peace and strength and grace you will bring to our nation.”\n“Uncle,” Zuko says.\n“I’m so proud of you, my nephew.” Uncle cups Zuko’s face in his lined hand. The gesture is so tender, his palm so warm, that Zuko has to take a fortifying breath against the sudden swell of emotion in his chest.\n“I hope they understand what it means,” Zuko mumbles into Uncle’s fingers.\n“They will,” Uncle says, smiling, and his eyes are still wet. Back on the day of Sozin’s comet, when he had reunited with Uncle and poured out his heart in apology, he had told himself he would never make Uncle cry again. Zuko breaks that promise every time they meet.\n“Or they’ll figure it out,” Uncle continues. “After all, they have you to teach them.”\nThrough the office’s gauzy curtains, Zuko can see Aang and Katara spinning around with ease. Aang’s friends have lost their stiffness and have pushed away from the crowds, pumping their legs and arms into the air wildly. Already, the streets are filling with people running out to join the dance; people bobbing their heads in place; people tentatively falling into a loosely structured dance, like a toddler taking its first steps. People who are following their Fire Lord’s lead.\n“I want to be a good leader, Uncle,” Zuko says. “I want to look after my people.”\n“You will,” Uncle says. “You are, my nephew.”\nUncle pulls him into another hug, and Zuko closes his eyes against the familiar smell of brewed tea and smoke, and the sound of music and laughter and stomping feet. The sound of people learning how to dance again.\n "
}