{
    "id": "1518449",
    "url": "https://archiveofourown.org/works/1518449?view_full_work=true",
    "author": [
        "DevilDoll"
    ],
    "title": "Binomial Coefficients",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "Underage"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [],
    "additional_tags": [
        "Alternate Universe - High School",
        "Bullying",
        "Happy Ending"
    ],
    "language": "English",
    "series": "",
    "published": "2014-04-25",
    "completed": null,
    "words": "20,783",
    "chapters": "1/1",
    "comments": "1,106",
    "kudos": "23,449",
    "bookmarks": "6,511",
    "hits": "283,653",
    "summary": "<p>In which brainy freshman Stiles Stilinski wants star quarterback Derek Hale to join the math team, AKA math nerds in love.</p>",
    "notes": "<p>Inspired by <a href=\"https://yomikoda.tumblr.com/post/77636204298\" rel=\"nofollow\">this adorable piece of fanart by yomikoda.</a> This story does not accurately represent math teams, football teams, or even high school in general. Thanks to Bethy and Otter for the lovely beta work, as always.</p>\n<p>You can find my transformative works policy (podfics, translations, etc) for my stories <a href=\"https://archiveofourown.org/users/DevilDoll/profile\" rel=\"nofollow\">here in my AO3 profile.</a></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>You can find my transformative works policy (podfics, translations, etc) for my stories <a href=\"https://archiveofourown.org/users/DevilDoll/profile\" rel=\"nofollow\">here in my AO3 profile.</a></p>",
    "text": "\"Hey, you dropped this,\" Stiles says, scraping the piece of notebook paper up off the floor, but Derek Hale doesn't hear him. Derek just slams his locker shut and shambles off, taking a friendly punch in the shoulder from Vernon Boyd as they pass in the hall, exchanging fist bumps with a group of random jock types gathered near the water fountain before he disappears into the roiling ocean of teenagers. Just another crimson letter jacket in a sea of others.\nStiles trails after him, feeling a lot less significant in his wake. No one fist bumps or shoulder punches him; Scott's home sick today after a bad asthma attack, and he's pretty much Stiles' entire social circle. Stiles is just another faceless nerd struggling to lug his overloaded backpack from class to class, and no one looks at him twice. He's practically invisible. Derek always looks slightly annoyed with everyone around him, and he still has more friends than Stiles. High school isn't what Stiles had hoped it would be. \nOnce he gets past the worst of the crowd, Stiles glances down at the piece of paper--if it's something stupid or useless he might just throw it away. It takes a second for it to sink in, what he's seeing, and then he boggles. It's math. Really advanced math. And Derek has solved it using a method Stiles knows isn't taught in the run-of-the-mill math classes most of the Beacon Hills high schoolers plod their way through on their way to graduation.\nWhen he looks more closely at the page, it doesn't even look like it's Derek's homework, something he was assigned to do. Both sides of the paper are filled from top to bottom, and it isn't all math. Sprinkled in amongst the equations are other scribbles and drawings: a football, Derek's name in bubble letters, a toothy shark, the back of some dude's head. This is just Derek messing around, doodling on a piece of paper when he's bored. \nDerek does this beautiful math just because he's bored.\nStiles folds the paper up and tucks it in his pocket, and walks into study hall, the only period he shares with Derek. Derek is a senior, and a star athlete, and the only reason Stiles has ever had any contact with him is because they have the same study period. They've never spoken, because Derek usually looks like he'd enjoy squishing Stiles like a bug, but in this period he always takes the desk directly behind Stiles for some unknown reason. The easier to imagine snapping his neck, maybe.\nThat's where Derek is now, slouched down low in his seat, spinning his pencil on the desk, frown on his face. He looks up when Stiles walks in, like he always does. Normally Derek looks away again immediately, like Stiles isn't even worth the effort of blinking in his direction. But normally Stiles doesn't wave at him, which is what he does today.\nDerek looks visibly surprised, eyes widening for a fraction of a second, like he can't believe a scrawny little freshman like Stiles has the gall to greet him. Stiles pivots and slides into his usual seat, his back to Derek, and he swears he can feel Derek's eyes boring twin holes in the back of his head, but he doesn't turn around. He takes out his Spanish book and gets to work.\n~*~\n\"Look at this,\" Stiles says to Lydia when he walks into Ms. Yanke's classroom after school. He waves Derek's wayward piece of paper in front of her face.\nShe primly snatches it from him and smooths it out on her desk, studies it for a minute while Stiles tries not to fidget. \n\"Hmmm,\" she says, and then picks up her pencil and makes a small correction. \"Not bad.\"\nStiles has been waiting all day to drop this bomb. \"It's Derek Hale's.\" \nLydia looks up at him, pencil poised to make another correction. Her perfectly groomed eyebrows are arched in surprise. \"Derek Hale? The quarterback?\"\n\"Yep,\" Stiles says, smugly popping the P. He reaches for the paper and flips it over, so she can see the bubble letters. \"He's not just a musclebound meathead. We should ask him to join.\"\n\"He's not going to say yes,\" she says, shooting down Stiles' dream without batting an eyelash. She pushes the paper back towards Stiles, as if now that she knows whose it is she isn't going to sully her eyes with it any longer. \n\"He might,\" Stiles says, just to be contrary, even though she's probably right. \"Worth a shot.\"\n\"Fine. You can ask him,\" she says, and flips her shiny hair at him, which means Stiles is dismissed.\n\"Fine. I will,\" Stiles says snottily. He takes Derek's paper back and shoves it in his backpack as the rest of the math team slowly files in, and Ms. Yanke picks up her chalk.\n~*~\nHe plans to do it the next day in study hall, before the bell rings, but there are too many people around. And also when he walks into the classroom and Derek looks up at him with his piercing eyes, Stiles totally chickens out. He waves again like a giant dweeb and sits down. Because Derek is right behind him, he can't even bang his head against his desk like he'd like, just has to sit there and stew silently in his shame.\nHe thinks he'll have to wait until Monday and pray he can nut up and just do it, but when he comes out of the building at the end of the day, he spies Derek amongst all the post-final bell chaos, his spiky black hair standing out against his jacket. There's a football game tonight, and the school is a sea of red clothing. Stiles is wearing orange and blue plaid. Go team.\nStiles forgot his Spanish homework and had to run back to his locker, so his bus is about to leave without him, but he sees Derek break away from a group of cheerleaders and head toward his car. Everyone knows Derek's car. He drives it to school every day. It's grumbly and dark and slightly menacing, just like Derek.\nStiles hesitates for a second. If he stops to talk to Derek, he'll miss his bus and have to walk to the station and hang out with his dad until he goes home. That's not ideal, but not that inconvenient, either. And it's Friday; Dad usually tries to leave on time on Fridays, so he and Stiles can have dinner together before Stiles goes to Scott's. \nOkay, fine. Stiles hefts his backpack a little higher onto his shoulder and picks up an awkward, plodding run--all the books he's carrying are throwing him off balance, and his backpack weighs almost as much as he does. He only makes it halfway across the lot before he sees Derek open his car door. Crap. This is going to be embarrassing, but: \"Derek!\"\nDerek turns, and when he sees who's zigzagging across the parking lot screaming his name like a whackadoo his face does...something. Not something Stiles has seen it do before. He seems almost pleasantly surprised to see Stiles, or interested in his existence, or another thing that doesn't involve squishing him like a bug. Maybe all that waving in study hall helped thaw him out a little. Whatever the reason, Derek waits, standing there with his hand dangling over the open door of his Camaro. Stiles gratefully drops to a walk, sucking wind.\n\"Hey,\" Stiles wheezes, when he gets close enough and has enough breath to talk. He can feel his glasses sliding down his nose.\n\"Hey,\" Derek says. His voice isn't a raspy growl like Stiles somehow expected. Derek looks past Stiles to the busses pulling out onto the street, then back at Stiles, brows furrowing. There's a lot to furrow. \"You need a ride?\"\n\"Uh,\" Stiles says, intelligently, and it slowly sinks in that Derek Hale is offering him a ride home in his testosterone-mobile. It's unlikely that will ever happen again. \"Yes!\" he says, rolling with it. \nDerek's car is immaculate inside, and smells like Axe. \"Where you live?\" Derek asks, as the Camaro's engine rumbles to life. \n\"One twenty-nine Woodbine,\" Stiles says, pushing his glasses back up. \"Down the street from the community center.\" Derek doesn't say anything, but when he pulls out of the parking lot he heads the right way, so Stiles assumes he knows where he's going. \"I'm Stiles,\" Stiles adds belatedly, realizing Derek has no reason to know his name. It's not like the teacher calls on people during study hall. \n\"Yeah, I know,\" Derek says, in a tone that plainly implies there's an unspoken you idiot at the end of that sentence.\n\"Well, I didn't know you know,\" Stiles says, a little irritated. \"Sorry for being polite.\" He says the last bit in a tone he hopes implies there's an unspoken you asshole at the end of it. Inside, though, he's trying not to be too excited that Derek knows his name, because that's what a loser would do.\nDerek heaves a put-upon sigh and looks at Stiles like he'd like to just open the door and push him out onto the street, but he drives on. Stiles crosses his arms over his backpack and stares gloomily out the window. So far this isn't going well, which doesn't bode well for Derek being receptive to Stiles' pitch. Maybe he should just forget it.\n\"You miss your bus?\" Derek asks a few miles later, when the silence is reaching ridiculous levels. They're sitting at what must be the longest red light in the entire world.\n\"Um. No,\" Stiles confesses, fiddling with the water bottle pocket on his backpack. The idea that Stiles would miss his bus and think the solution is to ask Derek for a ride home is so preposterous Stiles almost laughs in his face. \"I wanted to talk to you, is the thing.\" He glances over at Derek, who is looking over at him with one eyebrow raised, like, Well, here I am. Talk.\n\"Okay, well,\" Stiles starts, as the light finally turns green. He should have planned what he was going to say in advance, because he's already floundering. \"I know you're really, you know, popular and stuff.\" He glances over at Derek out of the corner of his eye. Derek has no reaction to telling him is popular. Probably because he already knew that. Stiles decides to start over.\nHe searches his brain for a different opening as Derek turns onto Woodbine. He's almost out of time. \"What I mean is, I know you're probably really busy, with sports and all your friends, but I thought if you had some free time you might want to--this is it, right here,\" he says, pointing at his house.\nDerek pulls smoothly into the driveway, off to one side so he doesn't block it entirely, and puts the car in park. He looks pretty amused by Stiles' stumbling, awkward monologue; there's something that might turn into a smile pulling gently at the corner of his mouth. \nStiles registers that Derek's reaching for the ignition like he's going to turn the car off, but he's already whipping out Derek's lost paper. \"Anyway, what I'm trying to say is you dropped this the other day and I saw it and I was wondering...do you want to join the math team?\"\nDerek's hand falls away from his keys without turning the car off. The almost-smile falls off his face at the same time. He snatches the paper out of Stiles' hand and opens it up. He doesn't look happy.\n\"You want me to join the math team,\" he says flatly, and oh my God, he is glaring. Glaring so hard. Stiles feels like his sternum is being crushed under that glare. He instantly reassesses his prior assumption that Derek always looks angry, because apparently that was just neutral. That was Derek's neutral face. Stiles didn't appreciate that face when he had the chance.\n\"Yeah,\" Stiles says, what little confidence he'd had in this plan going up in a puff of smoke. \"You're really good. Not perfect, I mean, Lydia made some corrections,\" he says, leaning to pointing them out on the paper. Derek glares harder. \"But last year the team went all the way to regionals, and I really, really really want to go to regionals. Maybe more than regionals. You could help us do that.\"\nDerek's eyes flick from the paper to Stiles. When that happens, he looks less angry for just a second, though Stiles isn't sure what changed. His mouth, maybe, or his eyes. Whatever it is, for some reason it makes Stiles feel like he might be able to sway him.\nStiles clasps his hands together under his chin and wheedles, \"Pleeeeease?\"\nDerek makes a weird noise that might be a laugh that died a painful death somewhere on its way out. \"I'll think about it,\" he says. He folds the paper up, snapping it at each turn. That's some really angry paper folding, right there. When he's got it as small as he can, he shoves it in the pocket of his jacket and stares out the windshield.\n\"That's good. That's awesome,\" Stiles says, choosing to cling to hope. \"I'll see you Monday.\" Derek doesn't say anything. \"In study hall,\" Stiles clarifies. Derek still doesn't say anything. \"Okay, bye!\" Stiles says, and bails out of the car before Derek murders him.\nHe races up the front walk and unlocks the door and flings himself through it, wondering if he really just did that. He hears the Camaro idling in the driveway, until he's inside the house, and the door is closed and locked behind him, and then it slowly drives away.\n~*~\nThat night Scott's feeling better, but his mom wants him to take it easy and stay close to his nebulizer, so they play video games, and Scott lets Stiles stress-vent all over him about Derek Hale, and whether or not he'll join the math team, and whether or not Stiles' badly botched invitation will be to blame if he doesn't.\n\"Is he really that smart?\" Scott asks, clearly skeptical. He squinches his face down as he focuses, then swings his Wii remote and misses the spare anyway. Scott sucks at bowling. He makes up for it in snowboarding.\n\"He took the paper back or I'd show you,\" Stiles says. It's his turn again but he's getting kinda bored with the game. He'd rather obsess over Derek. \"And he was doing it just for fun. It wasn't even homework. He's perfect math team material.\"\n\"Yeah, except he's kind of a dick,\" Scott grumbles. \"He and Whittemore almost threw your backpack in the pool that time.\"\n\"I...whoa,\" Stiles says. On the TV, his Mii is waiting, but Stiles puts his remote down. \"I guess I didn't know he was there.\" He'd been in a panic at the time, imagining what would happen if his backpack went in the pool, everything in it wet and ruined. All his schoolwork, and his expensive calculator, and his iPod. That had been during his first week of high school. It hadn't been an auspicious beginning.\nA whole group of jock assholes had cornered him in the locker room, then herded him out into the pool area. The next thing he knew, Whittemore, who everyone agreed was the douchiest douche in a school loaded with douches, had Stiles' backpack and was walking toward the pool, smirking and taunting. Stiles had thrown himself at Whittemore, who tossed the backpack to someone else before Stiles could grab it, and Stiles had gone sprawling on his belly on the wet floor, angry and humiliated. \n\"Derek was definitely there,\" Scott says, wrinkling his nose in distaste. And he would know, because Scott had come out of the locker room right at the end, attracted by all the shouting, and yelled that Coach Finstock was right behind him. He'd been bluffing, but the jocks had scattered, which was probably a good thing, because neither Stiles nor Scott were any match for a single one of them, much less half a dozen. \"Don't you remember? He was holding your backpack. You almost shoved him into the pool after he gave it back.\"\nSo that was who Whittemore had tossed the backpack to when Stiles came at him. It was probably a good thing Stiles hadn't even registered who it was, because he probably would have never talked to Derek about the math team if he'd known. No wonder Derek had always looked at him like he was plotting how to kill him. He probably was. \nBut Stiles had brazenly approached him in ignorance, and Derek had been nice, in his own Derek way--he'd even offered Stiles a ride home. He'd nearly stripped the skin off Stiles' face with the power of his glare at the end, but he'd been friendly, up until that point, or at least tolerant. \n\"He was okay to me today,\" Stiles hedges. \n\"I don't like him,\" Scott says, glowering as he unwraps a Kit Kat. \"Is it really worth having someone like that on the team?\"\nStiles isn't sure he has the answer to that, but by the time his dad comes to pick him up later that night, he's decided to just barrel ahead and keep trying to recruit Derek for the math team, and he's even come up with a serviceable plan. He might regret it later, but…regionals.\nWhen he gets home, Stiles takes his school stuff out, even though it's Friday night and even thinking about homework on a Friday night feels wrong. But Derek was doing math in his free time, which means Derek likes math. Stiles digs through the team worksheets for the ones he thinks Derek might like, based on what Stiles saw him doing on his own. Bait. \nWhen he bops into study hall on Monday, Derek's already there, careless slouch and spinning pencil in full effect. He's wearing a black leather jacket today, and looks like every parent's idea of a bad news boyfriend. Stiles tells himself it's not appealing at all.\n\"Here,\" he says, slapping the worksheets down on the Derek's desk. Derek pulls them closer and sits up a little straighter, frowning down at them. When he sees what they are he looks up at Stiles and raises one questioning eyebrow. \"Thought you might like them,\" Stiles shrugs, and turns back around to face front. \nA few minutes later he hears Derek's pencil start scribbling, and it never stops, not until the bell rings at the end of the period.\n~*~\nDerek's waiting for him when Stiles comes out of the building at the end of the day. This is especially impressive because Stiles had two hours of math team after school. He can't believe Derek's been waiting all that time. \n\"Hey,\" Stiles says, tentatively. For all he knows, Derek's been hanging around waiting for a chance to pound Stiles into a grotesque pile of pulp. \n\"Hi,\" Derek says. His face still looks kind of pinchy, but not as murderous as he'd looked in the car the other day. Stiles decides he doesn't need to scream that his dad is the sheriff just yet. \"You want a ride?\"\nThere's an activity bus that takes people home after practices and what-not, but Stiles isn't turning down another ride in the Camaro. \"Sure,\" he says, and follows Derek across the parking lot.\nThe inside of Derek's car feels familiar already, and Stiles isn't as nervous this time, even though now he knows Derek was one of the assholes who bullied him. He's prepared to let bygones be bygones if Derek is, for the sake of intellectual pursuits.\nAs Stiles is fastening his seat belt, his stomach growls. Really loudly. Like, embarrassingly loudly.\nDerek looks over at Stiles as he starts the car. \"You hungry?\" he asks. \"We could—\"\n\"Actually, yeah, starving,\" Stiles groans, already digging through his backpack. He pulls out a Ziploc bag with a blueberry muffin in it. He gets it out and takes a big bite, then remembers he should have manners and breaks it in two. The muffin is nice and moist, and it's been beaten up by his school books all day, so it's practically falling apart in his hands. A bunch of crumbs go cascading down into the console between the seats.\n\"Whoops,\" Stiles says, looking at the mess. He holds the unbitten half out to Derek. \"You want some?\"\n\"No,\" Derek says, looking pained.\n\"You sure?\" Stiles asks, taking another bite. \"It's really good,\" he mumbles through a mouthful of blueberry goodness.\nSilence. There is nothing but utter silence as Derek stares at the muffin Stiles is still holding out to him. \nStiles swallows, and wishes he had some water, or a cyanide pill. \"I’m…not supposed to eat in your car, am I?\" he deduces. \n\"No,\" Derek says tightly, watching a blueberry bounce off Stiles' wrist and into the back seat.\n\"Crap, sorry,\" Stiles says, and crams the last part of his half in his mouth, then fumbles the remaining half back into the bag—more crumbs, ugh--and seals it up as Derek watches with an expression of resigned horror. \"I'll just leave this for you, in case you want it later,\" Stiles says, stashing it in the console. Then he sees the way Derek is side-eyeing him. \"Or not,\" he amends hastily, shoving it in his backpack instead.\nAs Derek starts to back out of his parking spot, a carful of cheerleaders zooms by, music and giggles pouring out of the open windows. They probably don't even come all that close to Derek's precious car, but he narrows his eyes at them anyway. Stiles feels marginally better that someone else has so quickly distracted Derek from the fact that Stiles just desecrated the interior with muffin crumbs.\nThey pull out onto the road, Derek muttering under his breath about reckless drivers. Stiles isn't sure what the point of having a car like this is if you're not going to be at least a little reckless with it sometimes, but he keeps that thought to himself. \nDerek's quiet as they make their way to Stiles' house, and Stiles can't stop fidgeting. He's dying to know if Derek liked the worksheets, and if he's thought more about joining the math team, but he doesn't want to pressure him, so he'll just wait for Derek to bring it up.\n\"Did you like the worksheets?\" Stiles asks, after they've gone another two blocks. He waited, okay?\n\"Yeah,\" Derek says. They roll to a stop at the world's longest light again, and he reaches into his pocket and pulls the sheets out, all folded up, and hands them to Stiles. \"I'm not sure about the third problem on the first sheet, though.\"\nStiles takes the worksheets and unfolds them with hands made a little unsteady by excitement. \"I've got the answer key at home,\" he says eagerly. \"We can check them if you want.\"\nDerek's eyes flick over at Stiles, then back to the road. \"Sounds good,\" he says.\n~*~\nDerek only got two of the problems wrong. Stiles is ecstatic.\n\"Do you want to join the team?\" Stiles prods, because he needs Derek to put him out of his misery. He can't take not knowing. They're sitting at his kitchen table with the worksheets and bottles of Vitamin Water, and Stiles can barely keep himself from grabbing Derek by the lapels of his jacket and screaming at him to just say yes already.\n\"I guess so,\" Derek shrugs. He looks at up Stiles, and says, uncertain, \"Isn't it a little late, though?\" \n\"Absolutely not,\" Stiles says, even though he's not completely sure that's the case. He didn't actually talk to Ms. Yanke about it before he started working on Derek, but he considers her the easier of the two to convince. \"We had a practice session today. You wanna try some of the problems?\"\n\"Sure,\" Derek says. He takes his jacket off and accepts the pencil Stiles hands him.\nStiles takes out his biology homework and tries to make some headway on it, but he keeps looking at Derek instead, first because he's a little entranced by the way his pencil moves so fluidly, almost never hesitating, and then because he's never seen him up close like this for this long before. Most of their interactions up to now have involved Derek and the back of Stiles' head. \nStiles realizes, with no small degree of irritation, that Derek is even more attractive up close and in person—he's usually so frowny-faced that it's hard to fully appreciate it, but he seems a lot more relaxed now. Even when he scrunches his face a little in concentration he doesn't look as intimidating as he does when he's stalking through the hallways at school. In fact, this close Stiles sees his eyes are almost pretty, an unusual color that makes Stiles' boring brown ones seem even more pedestrian. His jaw looks like it was carved from marble, and his biceps are straining the resources of his T-shirt. It's like someone accidentally left a male model in Stiles' kitchen.\nThough a male model probably wouldn't be so hairy. It's not just the thick, dark hair on his head and his caterpillar eyebrows and the shadow of a beard showing on his face--even the backs of his hands and his fingers are dusted with dark hair. Stiles has about six hairs in the center of his chest, and some fuzz on his arms and legs. Sitting across from Derek makes him feel about twelve years old. \nAt one point Derek catches him staring at his arm hair and Stiles jerks his eyes away and pretends to concentrate on his biology book. If Derek realizes Stiles is checking him out, Stiles' backpack might really end up in the pool, with Stiles still attached to it.\nDerek does great on the practice problems, and soaks up Stiles' effusive praise. Stiles doesn't actually need to butter Derek up more, now that he's agreed to join the team, but he isn't going to relax until Derek's sitting next to him in Ms. Yanke's room after school. And he really is impressed, so he's not lying. Derek's math is gorgeous. Stiles gets him to do another sheet.\nThis one's a little tougher, stuff Stiles struggles with, and they get into a spat over one of the problems. In the end, Derek is right and he gloats a little until Stiles throws his empty Vitamin Water bottle at his smug face.\nDerek catches it and lobs it back. It bounces off Stiles' forehead and then the refrigerator. \"Is the whole math team this rowdy?\" Derek asks, the smartass. \"I'm not sure I can handle it.\"\n\"You don't even know,\" Stiles sniffs, and adjusts his glasses. Derek has no idea what crazy things go on at high school math tournaments. Stiles doesn't either, since he hasn't been to one yet, but he's heard stories. He's been counting on them being true.\nDerek's phone beeps at him, and he picks it up and thumbs the screen. \"I should get going,\" he says, sounding like he'd rather not. Stiles looks at the kitchen clock with a jolt. It's almost seven. His dad will probably be home any second now, and Stiles hasn't even thought about what they're going to have for dinner. He's an accomplished leftover reheater.\n\"We meet again on Wednesday,\" Stiles says, as he's ushering Derek out the door. \"In Ms. Yanke's room.\" \nDerek hesitates. \"I have football,\" he says, and Stiles' heart sinks. Somehow he completely forgot the fact that football practice and math team practice are at the same exact time. That's why Derek was still at school this afternoon. \"But I talked to Coach,\" Derek goes on, scratching the back of his neck as he examines the door frame. \"He said I can miss one practice a week and he'll still let me play.\" He gives Stiles a hopeful look.\nStiles' heart unsinks, just a smidgen. The math team meets three times a week, but maybe they can make it work. \"I'll talk to Ms. Yanke,\" he promises. \"We'll figure something out.\"\n\"Thanks,\" Derek says. He gives Stiles that hint of a smile again, the one that makes the corner of his mouth twitch and his eyes light up, and Stiles' breath snags on something uncomfortable in his chest. \nWell. That's a complication.\n~*~\nThe next day, Stiles cuts his lunch short to talk to Ms. Yanke about this incredible opportunity to go to regionals--or maybe even nationals!--that Stiles has engineered for her. That's how he sells it, anyway. She's pretty enthused about it, until he gets to the part about practices, and then Stiles can practically see Derek slipping through his fingers, and he tosses aside all dignity.\nHe bargains. He begs. He gets his way.\n\"You'll come to math practice on Mondays,\" Stiles tells Derek when they're in study hall, waiting for the bell to ring. Derek's already working on another worksheet Stiles slipped his way. \"And then on Wednesdays and Thursdays you and I'll meet after you're done with football practice, and I'll show you what we worked on that day.\"\nHe's not sure Derek will go for it. It means doubling up on after school practices on Wednesdays and Thursdays, which Stiles has no problem with because he's a lowly freshman with no social life, but Derek might have better things to do.\nOr maybe not. Derek immediately says, \"Sounds good. Where do we meet?\"\nStiles has been so focused on finagling this whole thing he didn't think about that part. \"My house?\" he suggests. \n\"I'll wait for you after football,\" Derek says, drawing Stiles' address on his worksheet in bubble letters.\n~*~\nDerek waits for Stiles on Wednesday, and they get two solid hours of math in before he leaves for home. Three of the knuckles on Derek's left hand are scraped, scabbing over, and Stiles tell himself it's gross. Super gross. No one in their right mind would think that's attractive.\nOn Thursday, Dad comes home while Derek is still there. He looks visibly surprised to see someone who isn't Scott sitting at his kitchen table, but he watches them for a minute, engrossed in their worksheets, and asks Derek if he wants to stay for dinner. After a quick text exchange with his mom, Derek stays for dinner. They have Kraft mac and cheese with sliced hot dogs in it. \nThe following Wednesday, Derek stays for dinner again, and helps with the dishes, and then stays to watch the Giants lose to the Dodgers—both Dad and Derek are big baseball fans, and Stiles likes baseball because he can mess around on his phone while watching it and not miss much, and still feel like he's bonding with his dad. The next night Derek stays again, and the Giants win. \nAfter that Derek stays for dinner every Wednesday and Thursday. They usually hang out a bit after and decompress, find something to do that doesn't involve using any brain cells. Sometimes they watch a television, sometimes they play video games, sometimes they hang out on the couch and eat grapes and talk about stupid stuff. Sometimes Dad and Derek talk about cars, and the hazards of street racing, and how many speed traps there are around town, in locations Dad is absolutely not disclosing. Dad isn't as subtle as he thinks.\nOne night after Derek leaves, Dad says he's happy to see Stiles making more friends, which makes Stiles squirm a little. His dad doesn't know that at first Stiles was using Derek for his brain, and now he's using him for his brain while perving on his hairy forearms. \nStiles is probably not a very good person. \nOh well.\n~*~\nA new girl moves to Beacon Hills, and Lydia recruits her to join the team. Her name is Allison, and it's love at first sight between her and Scott, and within what feels like minutes Scott suddenly has a girlfriend. Stiles has to give up a little of his Scott time to her, and it stings a bit, but Scott's been good about sacrificing some of his Stiles time to Derek, so he can't really complain. And he likes Allison well enough, and doesn’t have any problem with her suddenly being included in stuff. In fact, he learns pretty quickly to appreciate it.\nAllison is a year older than Scott and Stiles, so she can drive, which unlocks a whole new level when it comes to socializing. They can go wherever they want, and if they get there and decide it's boring, they can just go somewhere else. Stiles doesn't care how many organs he has to sell, next year he is getting a car. It's a game changer.\nThey go bowling, and to the movies, and sometimes both things in the same night, and they don't have to ride their bikes or beg any parents for rides, or take the bus. Sometimes Stiles is the third wheel of the group, but a lot of the time Lydia—already Allison's best friend—comes, too, so Stiles and Lydia are basically thrown together by default. A year or so ago Stiles would have relished the chance to hang out with Lydia outside of school, but now it feels more like a math team outing than anything else. Which is probably a good thing, because she's just as uninterested in him romantically as ever. \nAll of this has the unexpected side effect of expanding Stiles' social circle at school. Allison and Lydia start sitting with Scott and Stiles at lunch, and eventually the rest of the math team gravitates toward their table, until they're forced to push two tables together to accommodate everyone. Stiles has never had an entire group of friends before, and certainly never sat with anyone at lunch but Scott. It's nice, if for no other reason than it gives him other people to talk to when Allison and Scott are busy making goo-goo eyes at each other.\nStiles would never admit to it, but he's a little jealous. Not of the time Scott spends with Allison instead of him--Scott is still his friend, and will always be his friend, and they don’t need to spend every spare second together, so it's not sharing him with Allison that bugs him. Stiles is jealous because the person Scott has a crush on likes him back. \nThe person Stiles has a crush on is Derek, and it's pointless, and will only lead to years of hopeless pining, just like Stiles' crush on Lydia did. And it's definitely a crush now, there's no denying it. The more he gets to know Derek, the worse it gets.\nIt would help if Derek were a jerk, but he isn't, despite his perpetual case of grumpy face. And Derek isn't even really grumpy so much as…guarded, it seems. Stiles isn't sure why, but Derek's very slow to warm up to people, and even slower to reveal things about himself, but gradually, through idle conversation and obsessive attention to everything he says and does, Stiles learns things about Derek.\nDerek likes pepperoni on his pizza and mayo on his chicken nuggets. His favorite book is American Gods, and his favorite color is blue. He wants to hike the Grand Canyon someday. He swerves to avoid running over squirrels with his ridiculous car, and when he smiles his entire face lights up. Stiles gets really irritated with him sometimes when he smiles, which only makes it worse, because the only thing cuter than a smiling Derek is a baffled Derek. Stiles can't win.\n~*~\nStiles is probably as surprised as anyone that the system they've set up for Derek to do the math team stuff actually works. He wasn't sure Derek would stick with it, and it isn't a cakewalk for either of them, but Derek has no trouble keeping up with the work. He never mentions that he'd rather spend the time doing something else.\nAfter a few weeks, though, the strain starts to show. Derek starts looking a little tired sometimes, and yawns a lot when they're watching TV, and sometimes goes home a little earlier than usual. All this extra time and work is wearing him down, but he doesn't complain about it, even though Stiles has no idea when Derek is doing his regular homework. Stiles sometimes has a hard time getting his done, and Derek has to be physically tired at the end of the day on top of mentally tired; he has morning workouts in the weight room before school with the football team, and then football practice after, and then twice a week he logs an additional two hours of math afterwards at Stiles' house.\nStiles starts to feel guilty for talking him into this.\nOn the Thursday before their first tournament, Derek is late coming out of the school after football practice. Stiles leans against his car and waits, exchanging some texts with Scott. Just when he's starting to worry a little, Derek finally comes out of the building, looking half-dead. He's quiet in the car, and listlessly works on his practice problems once they get settled at Stiles' kitchen table. He gets three of the first four wrong, and Stiles knows it's no use. This is like trying to get blood from a stone.\n\"Let's go watch TV,\" he says, shuffling the worksheets into their folder.\nDerek frowns up at the clock on the kitchen wall. \"Not yet,\" he says, grabbing at the folder, but Stiles holds it up out of his reach, well aware that if Derek really wants it, Stiles won't be able to fight him off.\n\"You're exhausted,\" Stiles says, slapping at his questing hand with the folder. \"And you're about as prepared as you're going to get. There's no use in wearing yourself out completely.\"\nFor a second it looks like Derek is going to argue, but then he slumps back in his chair and rubs a hand over his tired face. \"A movie might be nice,\" he admits.\nStiles waits until they're settled on the couch with a bowl of microwave popcorn to bring it up. \"You know, you don't have to do this. If you don't want.\" He crams some popcorn in his mouth so he won't say anything else, like beg Derek to keep doing it anyway. \nIt's not even the idea of possibly not going to regionals that bugs him--it's giving up all this one-on-one time with Derek. They never talk to each other at school, really, except those few minutes before the study hall bell rings, and they don't have anything else in common. If Derek quits the team, he'll be quitting Stiles, too.\nThat's selfish, sure, but this is all of Derek Stiles is ever going to get. He's going to hang onto it with both hands.\n\"I'm not quitting,\" Derek says, stubborn set to his jaw. \"I just need a night off.\" He picks up the bowl of popcorn, on the couch between them, and hands it to Stiles. \"Put this where I can't reach it,\" he says. \"I won't stop eating it otherwise.\"\nThat's kind of the point of popcorn, Stiles thinks, but he obliges, setting the bowl down on his far side, where Derek can't get to it. That means eating it with his left hand, but he supposes it won't hurt him to slow down a little.\nHe's so absorbed in the TV, and in trying to get popcorn to his mouth with a hand that feels like it's working backwards, that he doesn't realize Derek's fallen asleep until he feels Derek's head tip onto his shoulder.\nStiles' hand flexes convulsively and popcorn kernels shoot out of it, all over the couch. He barely dares move, but he gingerly sneaks a peek anyway, peering down at Derek. He can see the top of Derek's head, the crest of a cheekbone, and one closed eye. He has really long eyelashes.\nStiles feels a little wide-eyed at the thought that Derek is comfortable enough with Stiles to fall asleep on him, but the truth is it's not really all that pleasant right now. Derek's hard skull is digging painfully into the boney round of Stiles' shoulder, but Stiles doesn't really want to wake him up. He thinks about it for a couple seconds, then reaches out and moves the popcorn to the end table, swiping the spilled pieces onto the floor. Slowly, so slowly, he shifts around and brings his legs up onto the couch so he can stretch out, wrapping one arm around Derek's shoulders to draw him down with him. \nDerek follows easily, blinking groggily but not really waking completely up as Stiles lays them out flat. Derek ends up half on Stiles' chest and half wedged between Stiles and the back of the couch, but that's okay. He doesn't appear to mind, and Stiles certainly has no complaints. Even though he's the taller of the two, Derek's face is mashed against Stiles' chest, one arm looped around Stiles' waist. Stiles isn't sure where Derek's other arm is—it's probably going to be completely numb when he wakes up. \nStiles' shirt has ridden up, and Stiles is hyper-aware that the inside of Derek's forearm is touching his bare skin. He realizes he's holding his breath and lets it out, long and slow, and Derek unconsciously mirrors it, sighing out a deep breath and snuggling down a little more into Stiles' chest. \nStiles is cuddling with Derek Hale. This is the single greatest moment of his virginal life.\nSomething blows up on TV, and Derek twitches, shifts his legs, but Stiles says, \"Shhh, go back to sleep,\" as he palms the back of Derek's head and encourages him to stay down. Derek is so exhausted. Even a few minutes of sleep is something. \nThey lie there together as the movie plays on. Stiles isn't sleepy, and he wouldn't miss a second of this for the world anyway, so he tries to be as comforting as possible without crossing the line into creeper territory. He's not made of stone, though. He compromises with himself and cards his fingers through Derek's hair over and over again, like his mom used to do for him when he had the pukey flu or was too anxious to sleep, because that seems innocent enough. \nIt always felt so good then, and it feels almost as nice to be the one doing it now, even if Derek is a little heavy-handed with the hair gel. The shorter hairs at the back of his neck are clean and soft, so after a while Stiles focuses on those, rubbing his thumb back and forth along the line of fuzz. Derek doesn't even twitch, just breathes warm air over Stiles' chest, slow and deep, heating up a small patch of skin over his collarbone. He smells like Axe and bubblemint gum.\nThe movie ends, and the DVD menu begins playing on a loop, and Stiles doesn't care.\nDerek conveniently wakes up just as Dad pulls into the driveway. He lifts his head and looks a little confused, like he doesn’t know where he is for a second. Then he sees Stiles, who is under him trying to discreetly pull his shirt down, and pushes himself up to sitting between Stiles' knees. \"Sorry,\" Derek says, rubbing his eyes with his fingers.\n\"It was fine,\" Stiles says, though it wasn't. \nIt was amazing.\n~*~\nTheir first tournament comes up so fast, and Stiles is convinced they aren't ready. They're going to bomb, they're going to be humiliated, Stiles is going to have to pick another college major or change his name because he's going to be infamous in the math community for crashing and burning at a high school math competition and no one will ever respect him.\nHe's pleasantly surprised when the results are much better.\nLydia is her usual unflappable, brilliant self. Erica nervously twists her hair in her fingers while kicking ass like it's nothing. Danny is practically a human calculator. Scott and Stiles and Isaac trash talk each other, because that has always worked for them. Allison is frighteningly accurate, even under pressure. Greenberg appears to struggle and then somehow pulls a miracle out of his ass, which is how he usually operates. Derek is fucking phenomenal, but Stiles might be biased.\n\"He's pretty good,\" Scott allows. He's slowly warming to Derek. Very slowly.\nIn the end they take second place, which is better than Ms. Yanke had hoped, and certainly better than Stiles had predicted. When the scores go up, everyone on the Beacon Hills team screams except Derek, who hammers at the air with his fist, then wraps his other arm around Stiles and gives him a sideways hug that grinds all the bones in Stiles' upper body together and is really freakin' awesome.\n~*~\n\"Okay, spit it out,\" Stiles says when they're walking out of the school on Monday. Derek always drives Stiles home on Mondays after math team, and sometimes stays a little while, even though they don't have to do any homework. \"You're acting like you're working up to break some really bad news.\" He's been shifty-eyed every time Stiles has seen him all day.\n\"It's not bad news,\" Derek says. He looks a little irritated Stiles is so perceptive. \"Well. Maybe bad news.\"\n\"Are you quitting?\" Stiles asks, voice a little more shrill than he'd like. \"You can't quit now! We kicked ass on Saturday!\"\n\"I'm not quitting,\" Derek says, sounding exasperated. \"Why do you always think I'm quitting?\"\nStiles doesn't say, Because I feel like I forced you to do this for my own petty reasons. \"Just tell me what it is,\" he demands.\n\"My parents want us to do our math stuff at my house on Wednesday,\" Derek says, with a demeanor that suggests this is just about the worst thing that could happen. \n\"Okay,\" Stiles says immediately. Derek hasn't said much about his family, and Stiles is curious. Plus, Derek has spent weeks putting up with Dad's ham-handed attempts to keep Derek from killing Stiles with his car. Which is totally unnecessary, because Derek would never do anything that would risk putting the tiniest scratch on his car.\n\"Are you sure?\" Derek asks, giving him a hard look.\n\"Yeah,\" Stiles says, shrugging. It's a break from tradition, but it isn't really a big deal. Except, the way Derek's face looks, maybe it is a big deal. \"Why are you acting like they're going to kill me? Are they going to kill me? Are they serial killers?\"\n\"No,\" Derek says grimly. \"They're conservationists.\"\n~*~\nSo Derek's parents are conservationists. Stiles isn't exactly sure what that means, even after he Googles it, but it must pay pretty well, because the Hales live in a big house overlooking the Beacon Hills Preserve. They have a gatehouse. As Derek guides the Camaro up the long, curving drive, Stiles wonders what Derek must think of the Stilinski house, which Stiles has always thought was pretty nice but must look like a hovel to someone who lives in this place.\nWhen they walk through the front door the entire Hale family--Derek's parents and his two sisters--has gathered in the foyer like the world's most attractive welcoming committee. They look like they were all made from the same mold: tall and strong-jawed, with dark hair and light eyes. The Hale gene pool is pretty high quality. \nAs the introductions are made, Stiles realizes with a start that Derek's younger sister is Cora Hale, who is in Stiles' class. He isn't sure why he never made the connection, but he recognizes her the minute he lays eyes on her. They were dance partners on that horrible day in seventh grade when everyone had to learn the Irish jig in gym class. It was a humiliating experience all around.\nThe next few minutes are strange and a little awkward. Derek's parents are friendly and welcoming, plainly excited to have Stiles there. Derek's sisters…not so much.\n\"It's nice to finally meet you, Stiles,\" Mr. Hale says, as he whisks Stiles' jacket away from him and puts it in the closet. Mrs. Hale says, \"We've heard a lot of good things about you.\" Laura doesn't say anything, but he can feel her eyes on him. Cora looks like she's recalling every awkward, lurching step of their Irish jig.\n\"Nice to meet you, too,\" Stiles says, trying not to be too thrilled that Derek's talked about him to his family and has said good things--a lot of good things. Derek's obviously had to explain where he's been two nights a week, so it probably doesn’t mean much. Stiles is a little thrilled anyway.\nDerek's mom leads them toward the back of the house and into the library—the Hales have a library—and everyone else follows, bringing up the rear like Secret Service agents. There's already a tray of snacks and drinks set out on the table.\n\"Help yourself, Stiles,\" Mrs. Hale says, as Stiles sits down in a chair that's probably five times older than he is; the place is loaded with antiques. Derek takes a seat across the table from him, and then everyone else stands there and watches as Stiles self-consciously selects a cookie and takes a bite.\n\"Mmmm,\" he says, and takes another bite, because the Hales seem really invested in how he feels about the cookie. Stiles feels like some kind of exotic pet, brought out for everyone to marvel over, and he is starting to suspect that, as popular is Derek is at school, he really doesn't have many close friends, the kind that hang out at your house. Everyone's acting like Stiles' presence is an unbelievable occurrence.\nSeemingly satisfied with Stiles' taste in cookies, the Hales file out of the room. As soon as the door closes behind them, Derek gets up and moves to the chair next to Stiles instead, which is unusual, but Stiles isn't going to point that out when Derek looks like he'd enjoy murdering someone right about now and Stiles happens to be the nearest murderable person.\n\"They seemed nice,\" Stiles says tentatively. \nDerek scowls as he flips his study guide open with a vicious snap, and Stiles wonders what the hell his problem is, but doesn't ask.\n~*~\nThey don't actually get much math done. Neither of them can seem to focus, and it doesn’t help that Derek's family won't leave them alone. Every few minutes someone comes in to check on them or bring them hot chocolate or give Stiles the stink-eye, though that last one is mostly Derek's sisters. Both of them have obviously inherited the family gift for using their eyebrows like a weapon. It's a good thing Stiles has spent so much time with Derek over the last couple weeks; he's largely immune.\nThe second time Mrs. Hale comes back into the library to make sure they don't need anything, she calls Stiles \"honey\" and pats him on the arm. Mr. Hale offers to build a fire in the fireplace if Stiles is cold, which he isn't. A few minutes later Laura comes back in under the pretext of finding a book, and sits down across from them at the table and grabs a cookie. Derek slaps at her hand, but it doesn’t stop her. \n\"So your dad's a cop,\" Laura says, nibbling on her purloined cookie.\n\"He's the sheriff,\" Stiles corrects. Most people don't appreciate the difference. \n\"Our uncle Brad is a Navy SEAL,\" Laura says meaningfully. Stiles has no idea what he's supposed to take from that.\n\"That's nice?\" he guesses. From the look on Laura's face, that isn't the correct response. \"God bless America,\" he says, flipping a little salute. That doesn’t help.\nStiles casts a desperate glance at Derek, who isn't being very helpful at all in taking any of the pressure off of Stiles. He mostly looks like he's hoping the house will fall down and kill them all.\nLaura's still staring at him, unimpressed. \"I've heard cops' kids are the biggest troublemakers.\"\nThat's…probably at least slightly accurate. Stiles learned early on that one of the benefits of having a parent who fights crime is you learn exactly how people get away with stuff. He's not stupid enough to admit that to anyone but Scott, though.\n\"I've never even had detention,\" Stiles says, which is absolutely true. He's certainly done things that would have warranted detention, had he been caught, but that's just semantics.\nThey're all momentarily distracted when Cora comes in, grabs a book off a shelf seemingly at random and sits down next to Laura. The Hale library sure is popular today.\n\"You know Matt Daehler?\" she casually asks, reaching for a cookie. Derek demonstrates that slapping her hand works just as well on her as it did on Laura.\n\"Yes,\" Stiles says, because everyone knows Matt Daehler. He's the gross dude who took creeper pics of girls and put them on the Internet. Stiles might actually know a little bit more about it than most of the other kids at school, because his dad isn't always careful with his passwords, but it was big enough news in Beacon Hills that pretty much everyone recognizes the name.\nLaura narrows her eyes at him. \"Really? Are you friends?\"\n\"No,\" Stiles says immediately. \"No no no. I didn't mean I know him know him. I just know who he is.\"\n\"If he did that to my sister, I'd wring his neck,\" Cora says. \"I'd make him wish he'd never messed with her.\"\n\"Me, too,\" Stiles says. \"Probably.\" He doesn’t actually have any siblings, but he appreciates the sentiment.\n\"I'd do worse than wring his neck. I have a brown belt in Krav Maga,\" Laura says, eying Stiles coolly. \"I teach self-defense classes.\"\n\"I'm going to be forensic scientist,\" Cora chimes in, flipping her hair over her shoulder while Stiles gapes at the both of them. \"I want to work for the FBI. They have a facility out in Virginia where they study how bodies decompose. I'm doing my next research paper on it.\"\n\"That's nice,\" Stiles says weakly. He suddenly remembers the afternoon Derek asked him to come over, and Stiles had jokingly asked him if his family were serial killers. Ha. Haha.\nDerek's mom chooses that moment to walk in, possibly saving Stiles from a short, miserable future spent being kept in a hole and told to put the lotion on his skin.\n\"You two, out,\" she says firmly to Derek's sisters. Mrs. Hale can work the eyebrows, too.\nLaura and Cora flee immediately. They don’t even bother to take the books they pretended they wanted.\n\"Dinner's in fifteen minutes,\" Mrs. Hale says. When she leans down to pick up the snack tray she ruffles Stiles' hair and gives Derek a noisy kiss on his temple.\n\"You don’t have to stay for dinner,\" Derek says stiffly, after she leaves. He has some kind of lip gloss or something on his face where his mom kissed him, the faintest smudge of shimmery pink. \"I could take you home now.\"\n\"That would be kind of rude,\" Stiles points out. \"And I like your family,\" he says, then amends, \"I like your parents. Your sisters are cartoon villains.\"\nDerek snorts, and almost smiles. Almost.\n~*~\nIt doesn't take Stiles long to wish he'd decided to be rude and go home, because the longer they're at Derek's house, the less pleasant it gets. And it isn't even because of Derek's sisters, who are much less threatening at the dinner table. Either they're behaving in front of their parents, or Stiles passed some kind of incomprehensible test during that weird conversation in the library, because they're much friendlier now. No, the reason it's unpleasant is because of Derek himself.\nStiles hadn't realized how different Derek is now when they're hanging out, but the bigger a fuss his family makes over Stiles, the more Derek shuts down, until he's completely reverted back to the Derek Stiles first knew at school, the one whose social skills arsenal consisted mainly of eye rolls and sarcasm. Stiles is rapidly remembering why he initially thought Derek was a conceited dickface.\nAfter a while, Stiles gives up on worrying about him. Derek's parents are friendly, and obviously making an effort to be nice to Stiles, and his sisters are acting as if they weren't threatening him with bodily harm half an hour ago. Stiles digs happily into a plate of tuna casserole while Derek sits next to him, radiating hostility. Everyone ignores him, including Stiles. \n\"Do you have any hobbies, Stiles?\" Mr. Hale asks at one point.\nStiles' hobbies are mainly video games and sleeping in as late as possible on the weekends, but that's not what you tell parents. \"My dad and I have a model railroad in the basement,\" Stiles says. They haven't worked on it much lately, now that Stiles has school stuff going on, and Beacon Hills has been short two deputies for the last couple months, which means Dad's working longer hours. \nOut of the corner of his eye, Stiles sees Derek turn his head and look at him. \"Really?\" he asks. It's the first word he's said through the whole meal. \"I didn't know that.\"\n\"Well, my dad usually isn't home when you're over, and you and I are busy doing other stuff,\" Stiles says. \nDerek's eyes widen. Mr. Hale begins coughing. Cora and Laura both start laughing obnoxiously, braying like donkeys. Derek's mom sets her water glass down a little too quickly and sloshes water onto the tablecloth.\n\"Doing math!\" Stiles practically shrieks, when he realizes what that sounded like. Not that it hasn't crossed his mind that he'd like to do other things with Derek. It crosses his mind a lot, usually when he's alone in his room, under the covers. But no one needs to know that, especially Derek.\nSpeaking of Derek, now would be a really good time for him to chime in, but when Stiles looks over at him, he's covering his face with his hands.\n~*~\nWhen they finish their tuna casserole Mrs. Hale brings out a homemade cake, and not just the kind in a big rectangular pan. It's a layer cake. Stiles knows those are a lot more work because he tried to make one for his dad's birthday two years ago, and it took forever. Even worse, after all the effort that went into it, it was lopsided and sad looking.\nThis one looks perfect. It's chocolate cake, with chocolate frosting and fresh strawberries between the layers. Stiles can't stop exclaiming over how good it is, but the cake only seems to make Derek angrier. He eats his piece in precise, cheerless bites. Who gets angry about cake?\nWhen Derek eats dinner at Stiles' house they normally chill out for a bit afterwards, hang out a little. Stiles looks forward to that part, and is always a little sad to see Derek go home. The rules at Derek's are obviously very different, because as soon as they finish their cake and help clear the table, Derek announces he's taking Stiles home right now.\nStiles can't shove all his stuff into his backpack fast enough. He's had enough tension and awkwardness to last him until he graduates from high school at least. Maybe even longer.\nEveryone escorts them to the door, which seems almost normal now, so Stiles must be adapting to the Hale family weirdness fairly quickly. Derek's dad helps him into his jacket. His mom tells Stiles he's welcome to come back anytime. Derek's sisters look like they've warmed to him enough that they'll consider not gutting him like a fish if he dares to do so.\n\"Sorry about my family,\" Derek says, when they get in the car.\nStiles gives him an incredulous look. \"Your family was fine. You were kind of a dick.\"\nDerek looks both offended and shocked. \"What the hell did I do?\" he asks. Derek might be smart at math, but he's kind of dumb at life.\n\"Well, for starters, you acted like this was going to be a big ordeal, and then didn't do anything to make it any less of an ordeal, just let me swing in the breeze while your sisters explained all the ways everyone in your family can kill me and dispose of my body forever,\" Stiles says, ticking off a finger. He immediately unfolds a second one. \"You barely said anything all night, leaving me to carry the conversation with your family all by myself, which was rude.\" Now, the third and most damning finger. \"And you ate all the peanut butter cookies and left the oatmeal raisin ones for me, and I hate raisins.\"\n\"It was stupid, the way they made such a big deal over you being here. My mom made that dumb cake and everything,\" Derek says, scowling as he twists the key and the Camaro rumbles to life. \n\"Yeah,\" Stiles says quietly, folding his fingers back into his palm. He turns away, looks out the window at the trees that surround the house. \"Why make a fuss over me?\" \n\"I told them not to,\" Derek snarls, throwing the car into reverse a little less smoothly than usual. \"I knew this would happen if you came over.\"\nThis is what people mean when they talk about feeling like the rug has been pulled out from under you, Stiles thinks. This awful, hollow-belly sensation of falling. \"Did you not want me to meet your family? Are you embarrassed to hang out with me?\" he asks Derek, without looking at him.\n\"That's not it,\" Derek says vehemently. Stiles swears he hears a spray of gravel as they pull out of the driveway. It's kind of freaking him out, Derek handling his car like this. This car is his baby.\nThe ride to Stiles' house is silent. Every once in a while Derek huffs, like he's mad, but he doesn't have any reason to be mad that Stiles can fathom. Stiles did what Derek asked, and he was polite, and he didn’t break anything, and Derek's family seemed to like him--even his bloodthirsty sisters accepted him after a while. And now Derek's angry about it, which makes no sense, but then Stiles has felt like Derek's been operating in a reality just a hair to the left of this one all night long.\nWhen they get to Stiles' house, Derek gets out and walks Stiles to his door, like they're on a date. Stiles is so bummed he can't even fully appreciate it. \n\"See you tomorrow,\" Stiles says flatly, shoving his key in the lock.\n\"Wait,\" Derek says. \nStiles slowly turns around, clutching his backpack in front of him like a shield, wondering if he's going to get an apology. Derek's got his shoulders hunched, hands in the pockets of his jacket. He's standing one step down from Stiles, so they're the same height, and he looks the least angry he has in about six hours. \n\"What?\" Stiles asks, when Derek doesn't say anything.\n\"I’m not embarrassed to hang out with you,\" Derek finally says. He hesitates again, before asking, \"Are you embarrassed to hang out with me?\"\nStiles boggles openly at him, because that's the most outlandish thing he's ever heard Derek say. \n\"Of course not,\" Stiles says. \"You're the one who has to worry about being tainted with my nerdiness.\" Stiles, on the other hand, would get a definite bump up the social ladder if everyone knew he was friends with Derek Hale now. That's how high school works.\n\"Tainted by—\" Derek starts, frowning.\n\"You know,\" Stiles says. \"If your friends found out about us.\" That makes it sound like they're having some secret, torrid affair. If only.\n\"My friends know,\" Derek says, looking like he's surprised Stiles doesn't know that. \"How do you think I explain that I'm not at practice on Mondays? And where I am when we have tournaments?\"\n\"I dunno,\" Stiles shrugs. He hadn't really given it much thought until now.\n\"Stiles,\" Derek says, sounding exasperated. \"The whole team goes out for pizza every Thursday after practice. I'm the quarterback, and haven't been there in weeks.\"\nWhoa. Stiles had no idea. It hadn't occurred to him that Derek might be missing out on something important by coming over to do math with Stiles two nights a week. He'd agreed to it so readily, Stiles had assumed he wasn't sacrificing anything except some free time and maybe sitting around with his buddies, being good-looking and popular.\n\"I didn't know that,\" Stiles admits, acutely aware all over again that all of this is because he wants his moment of math glory. \"I'm sorry.\"\n\"That's not the point,\" Derek huffs. \"The point is everyone already knows what I'm doing on Thursdays instead of going out for pizza.\"\nStiles feels...pathetically warmed by that thought. \"And they don't care?\" he asks. It seems too good to be true. \n\"No, they don't care,\" Derek says, shaking his head. \"You know what Boyd does? He knits.\"\n\"Wow,\" Stiles breathes. He never would have suspected. Dude's got balls to admit it.\n\"Yeah,\" Derek says. \"And we give him a little shit about it sometimes, but we wear the lucky socks he made us, every game. So I think I can survive doing a little math with you.\"\n\"I guess so,\" Stiles agrees, courtesy of his newfound perspective. Knitting. Geez. \n\"So are we okay?\" Derek asks. He looks, for the first time, really worried they might not be.\n\"Yeah. We're okay,\" Stiles says. He still has a whole lot of questions about Derek's family and how they acted tonight—and that includes Derek—but he isn't touching that right now. There's still so much he doesn’t know about Derek, and so much Derek keeps to himself. He'd thought he was really getting to know him, but now he's not so sure. But he does know they're okay again.\n\"Good,\" Derek says. \"Here.\" He takes a cellophane-wrapped package of cookies out of his jacket pocket. \"My mom gave me these to give to you.\" \nStiles takes the cookies. The package is wrapped with a ribbon and everything. The cookies are peanut butter.\n\"Sorry I ate all the other ones,\" Derek says. He sounds heartbreakingly sincere.\n\"You better be,\" Stiles says, choosing to believe that apologizing for the cookies is Derek's way of apologizing for all of it. \n\"I'll see you at school tomorrow,\" Derek says, grinning as he backs down the steps.\n\"Absolutely.\" Stiles smiles back, and takes his cookies inside.\n~*~\nThe following day at lunch, Stiles nearly falls out of his chair when Derek slaps his tray down next to him and takes a seat. Stiles looks over at Derek, and then down at Derek's overloaded tray. He's got three slices of pizza, a chicken sandwich, and two cartons of milk, plus some baby carrots and a fruit cup. Stiles has an apple and a corndog. He also has a small pile of Swedish fish, brought from home.\n\"Are you lost?\" Stiles asks, looking around for Derek's friends. Or maybe there's been some team-wide flu epidemic and none of the jocks are in school today except Derek. But no, they're all in the cafeteria, at their usual table. A few of them are looking over at Derek, curious, but no one seems overly shocked he's sitting with the math team.\nIf anything, it's the math team that's shocked. When Stiles glances around his own table, most of them are gaping in disbelief, or simply looking confused.\n\"Can I have a fish?\" Derek asks, like it's totally normal for him to sit with Stiles and his friends. Like it's not a big deal he just made a declaration in front of the entire student body that he's not ashamed to be seen hanging out with Stiles.\nThat'll only get Derek so far, though. Stiles cups his hand protectively over his fish. \"You know me better than that,\" he sniffs, using his other hand to inch his tray away from Derek.\n\"Yeah, I do,\" Derek says, and steals Stiles' apple instead.\nThe next day, Derek sits with Stiles again, but this time Jackson Whittemore also joins their table—Stiles' lip curls in disgust, but Whittemore doesn't even notice—and makes several attempts to talk to Lydia that would be painful to watch if Stiles didn't take such complete and utter joy in watching that dickbag crash and burn. Eventually, Danny takes pity on Whittemore and starts a conversation with him, putting an end to Stiles' fun.\nOn Monday, Boyd joins them, too, and spends most of the lunch period talking to Erica, who looks slightly freaked out by the attention. On the other hand, Lydia already appears to be thawing to Jackson. Stiles decides she has terrible taste in guys and that's why she never liked him back. \nMonday math practice is the only official one Derek actually attends, and that afternoon Stiles has a surprise for him, arranged in advance. When they're done, instead of going their separate ways, the whole team goes out for pizza.\nWhen he pitched the idea to the others, Stiles had been a little worried that Derek might not want to go, or find it a poor substitute for his football buddies, but Derek has a great time. He sits between Stiles and Isaac, and talks to Isaac almost as much as he does Stiles. He even talks to Greenberg, who's across the table from him. Then, when the girls get up to go to the bathroom, he spends a few minutes talking to Scott, who has finally come around to believing Derek isn't made of pure evil. It's pretty heartwarming stuff.\nWhen every crumb of food on the table has been consumed, Derek insists on paying for everything, using a credit card he takes out of his wallet. If Stiles hadn't seen his huge mansion of a house he would probably feel guilty about it, because it's a pretty big bill--they ordered garlic bread and mozzarella sticks. \nAs everyone leaves the restaurant afterwards, Derek grabs Stiles by the elbow and stops him, letting the others walk on ahead and get in their cars, until they're standing alone in the parking lot. \"Whose idea was this?\" Derek asks, jerking his chin toward the restaurant. Stiles can tell by the look on his face that he already knows the answer.\n\"Mine.\" Stiles can't help grinning. Tonight was a total success. \"I thought maybe you missed going out for pizza with—\" he almost says \"your friends\" and then realizes that's pretty presumptuous \"—your teammates.\" \n\"Yeah, I kinda did,\" Derek admits. He doesn't say one word about it being the wrong team, which would totally spoil the moment. Stiles says a silent thank you. \"You didn't have to, though.\"\n\"I know,\" Stiles says. \"But it sounded fun, and it's a good idea, not just for you. We should all hang out. Bond as a team.\" It sounds stupid when he says it, but he means it. They all sit together at lunch, but this is different.\n\"That was really nice of you,\" Derek says. \"I had a good time.\" He hooks a finger in the shoulder strap of Stiles' backpack, right next to his armpit, and tugs him closer. His smile is soft and heart-stopping, and Stiles wishes he weren't standing so close because it's making him want to do something really, really dumb.\nLuckily, before he gets a chance to, a set of headlights washes over them, and they jump apart, wincing painfully in the sudden brightness. A pick-up truck barrels past them, blaring REO Speedwagon, and pulls into a spot a few feet away.\n\"Let's go, before we get run over,\" Derek says, gently shoving Stiles, who still has spots dancing in his vision, toward the car. \"Your dad'll never forgive me.\"\n~*~\nOn Wednesday, once they've reached the vegetating on the couch part of the evening, Derek begs off on the next night's practice because he has \"a family thing.\" Stiles tries not to panic. \nThey've been sticking to the schedule so far, and kicking ass at the tournaments, but the next meet is for their division, and they have a really good chance of making it to the state finals. That's the final step before regionals. Stiles isn't even letting himself think about nationals. Much.\n\"We can get together on Saturday, if you want,\" Derek offers, scrolling through the channel guide for something suitably mind-numbing. They flipped for rights and Stiles lost. \"I'm free.\"\nStiles hesitates. He usually spends Saturdays with Scott, though Scott's been spending a lot of his Saturdays with Allison lately, so maybe he won't be missed. And they'll still have Friday night to hang out as usual. Scott'll probably understand.\n\"We can do that,\" Stiles decides. \"But not too early.\"\n\"So, like, 8am?\" Derek asks, and then laughs and shoves Stiles' foot away when he digs his heel into the meat of Derek's thigh.\nThey eventually agree on 11am, which Stiles still thinks is hideously early on a weekend, but apparently Derek's family likes to get up early on Saturdays and go hiking—blargh—so Derek's never learned to fully appreciate the joys of staying in bed until noon.\nThe early hour means Stiles is even less equipped to handle it when Derek shows up unshaven. He usually has a five o'clock shadow by 10am, so Stiles has never actually seen him with a smooth face, but he's never seen him with honest-to-God stubble, either. It's a distractingly good look on him, and goes with his leather jacket, which he's wearing today because he's apparently merciless. Stiles would wonder when he became so attracted to leather and body hair, but he already knows when, and who's responsible. \nThey spend the required two hours on the math—a very trying two hours for poor Stiles, who can't stop wondering how it would feel to rub his palm over Derek's bristly jaw—and then Derek wants to go get something to eat. As they slide into a booth at the diner in downtown Beacon Hills, Stiles realizes this is the first time they've ever been out in public alone together. \nThe waitress is young and pretty, and flirts openly with Derek while Stiles tries not to glower at her. Not that the glowering has any effect; she barely even notices he exists, eyes fixed firmly on her little notepad as she takes his order. She probably thinks Stiles is Derek's annoying little brother. Very little brother, because Derek looks about twenty-five years old with that stupid stubble. Stiles bites angrily into his cheeseburger and tries not to sulk.\nDerek grabs the bill and insists on paying for Stiles, too, and then wants to go to a movie. They spend a few minutes in the diner parking lot, hunched over Stiles' phone, mulling their choices. The only movie they both want to see isn't showing for like an hour, but Derek doesn't care. He's obviously in no hurry to ditch Stiles and get on with his weekend, and Stiles sure isn't going to question his luck.\nThey kill some time by stopping at a convenience store and buying some candy to smuggle into the theater. Stiles insists on getting a box of Nerds. \"It's funny because we're on the math team!\" Stiles says. Derek doesn't look like he thinks it's funny. He gets a box of Junior Mints for himself.\nThey still end up being really early, and spend half an hour sitting alone in the theater waiting for the movie to start, arguing about pizza toppings. Derek refuses to eat anything on his pizza that comes from a plant, except tomato sauce.\n\"But black olives!\" Stiles insists. \"Mushrooms!\"\nDerek just shakes his head and shoves another handful of popcorn in his mouth. The bucket's empty before the movie even starts.\nIt's a superhero movie, and Stiles has already seen it twice, but it's still fun to see it again, and nudge Derek's arm off the armrest with his elbow, and listen to Derek laugh at the one-liners. In fact, it's probably the most enjoyable viewing of this movie out of all three for Stiles, just because Derek's there.\n\"My favorite part was that one guy,\" Stiles says, as they're walking back to the car.\n\"Which guy?\" Derek asks. His voice is light and amused. Stiles might even say fond. Yeah, he's going with fond.\n\"You know,\" Stiles says, kicking at a stray popcorn bucket rolling around in the parking lot. \"That guy. He was on that one show.\"\n\"Oh, yeah. That guy,\" Derek says dryly. \"From that show. He's my favorite guy on a show.\"\n\"Don't even front,\" Stiles says, jabbing Derek in the chest with a finger. \"You know who I’m talking about.\"\n\"I know you don't make any sense,\" Derek says, and catches Stiles' poking finger. He squeezes it briefly, smiling, before he shoves it away and unlocks the Camaro. \"Now get in the car.\"\n\"Bossy,\" Stiles grumbles in faux outrage. He gets in the car and promptly fastens his seat belt, and then double-checks it. Shortly after Derek started driving Stiles home from school three times a week Dad made them both look at a bunch of really gruesome pamphlets on the dangers of not buckling up. Stiles had been sickly fascinated, Derek pale as a sheet.\n\"Don't even think about taking those out in my car,\" Derek says threateningly, when he sees Stiles reaching for the box of Nerds in his jacket. There's still a bunch left, because Derek didn't want any, even though Stiles ate like half of his Junior Mints.\n\"Relax, I'll be careful,\" Stiles says, but of course he pulls the box out of his pocket upside down and a couple hundred Nerds pour of it and go everywhere. Some of them scatter across Stiles' lap, some roll onto the floor beneath his feet, some land in the little leather skirt thing around the gear shift, but a lot of them immediately disappear into the crack between his seat and the console.\nThere isn't a sound in car, except the delayed pitter-patter of one last Nerd finding its way deep into some probably-impossible-to-reach crevice beneath Stiles' butt.\nStiles stares down at the narrow space where most of the Nerds disappeared, as if he can somehow summon them back into the box with the sheer power of his desperation. It doesn't work. \n\"I'm not even sure I want to know,\" Derek says slowly, \"what would have happened if you hadn't been 'careful.'\" He makes little air quotes with his fingers.\n\"Hey, you did a really good job cleaning up the muffin crumbs,\" Stiles says brightly, when he notices how pristine the console is, aside from all the Nerds in it. \"You can't even tell they were there.\"\nDerek doesn’t acknowledge the comment. He's too busy banging his forehead on the steering wheel.\n~*~\nThe trip home is delayed because they have to stop at the car wash all the way across town that has the super-suctiony vacuums, and Derek makes Stiles cough up three bucks to turn one on. He apparently doesn’t trust Stiles not to strip all the carpet off the floor or something, so he does the clean-up himself, carefully moving the seat forward and back to get to the ones that are hiding. The sound the Nerds make rattling through the vacuum nozzle is pretty entertaining, but Stiles knows better than to mention that.\nWhen they get back to his house, Stiles half-expects to be rolled out onto the curb as Derek speeds past, but he pulls into the driveway and shuts the car off, which means he's coming in to hang out for a while. Staring at his fingers as they twist the key, Stiles has a sudden memory flash of that first time Derek gave him a ride home. When Stiles handed him the paper, Derek's hand had been on his keys. He'd been about to turn the car off. \nDerek was going to come in the house that day, and hang out with Stiles. Derek wanted to hang out with him, or was at least willing to give it a test run, way back then. \n\"You getting out, or you have a box of Raisinets in your pocket you need to spill?\" Derek says, when he notices Stiles just sitting there.\n\"Bite me,\" Stiles says, and opens the door, but he's grinning.\n~*~\nThey make it to state.\nEasily, even. They practically coast to first place at the final meet for their division.\nStiles is overjoyed. He goes on a Mountain Dew and Sour Patch Kid bender so long and intense that it strips at least three layers of skin off his tongue and keeps him awake the entirety of Saturday night. He plays video games all the way through, long after Scott's admitted he's a lesser man and gone to bed, and goes home Sunday afternoon still feeling the lingering effects of a sugar hangover. \nIt's Derek, looking slightly guilty, who bursts Stiles' bubble on Monday.\nThe state competition is in Sacramento on Saturday morning, but Derek has a football game on Friday night. And it's not just any football game--it's the division championship. If they win this, they'll go to state, just like the math team. Derek is the quarterback; he can't miss the game.\nThey have a strategy session at Stiles' house, over Oreos and milk. The rest of the math team is going to Sacramento on Friday and spending the night in the hotel, but that's not an option for Derek.\n\"I'll drive down on Saturday morning,\" Derek says, like it's no big deal to drive all that way the morning of the competition. Registration starts at eight in the morning, competition at nine. He'll have to leave Beacon Hills at an ungodly early hour to make it in time.\nThe other Hales are holding an unfortunately-scheduled pancake breakfast fundraiser that morning for an endangered snail found only in a small area in Northern California, so they'll be arriving in Sacramento around noon at the earliest. Stiles assumes his own dad is coming, but doesn't know what his schedule is; he sometimes works for a few hours on Saturday mornings, doing paperwork. Stiles normally sleeps through it and wakes up in time to have lunch waffles with him when he gets home.\n\"I'll ride with you,\" Stiles says impulsively. He's already imagining a hundred worst-case scenarios, like Derek oversleeping, or the car breaking down, or a freak snowstorm closing the freeway. Not that Stiles can do anything about a snowstorm, but he's a bit of a control freak sometimes, and this way he'll feel more in control and not spend all of Friday night hyperventilating instead of sleeping. \"Actually, you better spend the night here,\" he decides. That'll cover the oversleeping at least. \nPlus, that way he can make sure Derek takes it easy on the Axe. Stiles has to spend three hours in the car with him.\n~*~\nMs. Yanke agrees to the plan, looking relieved they're not losing one of their strongest team members. Derek's family agrees to the plan, too, though they don't really have much choice if they want to save those snails. Over dinner on Wednesday, Dad briefly lobbies to drive Stiles and Derek down himself, since he's planning to go anyway and says he can skip a few hours of paper shuffling. Stiles suspects he's also motivated by envisioning Stiles splatted all over the road like an unlucky squirrel, victim of careless Camaro handling.\nBut by now Stiles has warmed to the idea of going on kind of mini road trip with Derek. It'll be his first time leaving the Beacon Hills city limits with someone who isn't a parent or some other kind of authority figure, and the pull of the open road is on him. It's just an illusion of freedom, but it feels like a milestone to him, like something someone who isn't a kid would do. He's already bought snacks and made a playlist for his iPod and everything. He and Derek are making the trip in the Camaro. Alone.\nLuckily, Stiles never skimps on intelligence gathering, and he's ready with a counter-attack.\n\"Scott's mom is looking for someone to ride with on Saturday morning,\" he casually mentions. \"She wants to go, but she's working the overnight on Friday, and can't leave until after she gets off at seven.\" \n\"Mrs. McCall?\" Dad asks, like Scott has another mother roaming around Beacon Hills. He looks torn between sticking to his plan and jumping at the chance to spend some time with another adult who isn't a cop or a criminal. Or maybe Mrs. McCall specifically. She's pretty and stuff, even though she's a mom.\n\"Plus she'll be tired, from working all night. It's probably not safe for her to drive,\" Derek chimes in, then innocently chews his spaghetti. Dad made him watch a 20/20 expose on driving while sleep deprived.\n\"She probably will be tired,\" Dad agrees. \"Hmm.\"\nSometimes it's just so easy.\n~*~\nOn Friday night, Stiles and his dad go to the football game. It's the first Beacon Hills game they've ever attended, so Stiles has never seen Derek play. Five minutes in, he's kicking himself for wasting so many opportunities to watch Derek be athletic. He's so competent, and he's got an arm like a cannon. Stiles can practically feel his eyes turning into sparkle stars as he watches the game.\n\"Wow, he's good,\" Dad says, munching on some popcorn.\n\"Yeah,\" Stiles agrees, and hopes his face doesn't give anything away. His crush on Derek is in full bloom, and he doesn't want anyone to know. It's miserable enough as it is, and he'd made the mistake of telling everyone how much he liked Lydia, and now he'll never live it down.\nThe game is a nail-biter, Beacon Hills blazing ahead only to end up tied, then inching ahead again, then falling behind, until Stiles thinks he's going to skip right past chewing his fingernails and just gnaw an arm off. With only seconds left on the clock, Derek throws a Hail Mary and Boyd catches it and runs for a touchdown, and the stadium erupts in pandemonium. Dad throws his arms in the air and cheers, and Stiles feels like his face might split from grinning.\nThe Beacon Hills fans rush onto the field in a wave of screaming crimson, carrying Stiles and his dad along with them. It's utter chaos as far as Stiles can see, people cheering and whooping and hugging. Boyd's being held aloft by a bunch of the other players, and Derek's family—his parents and Laura--are fighting their way through the throng, trying to get to him. Stiles follows the Hales.\nWhen they finally find Derek, he's already taken off his helmet. His hair is a matted, ridiculous mess, and he's beaming, grinning, radiating a joy so intense Stiles feels his eyes start to sting, which is about the stupidest, most embarrassing thing that could happen to him right now. \nThere are a lot of people hugging Derek, screaming excitedly in his face, high-fiving him, so it takes a minute for Derek's family to even get close. When they finally get to him there's a pretty intense group hug, and when it breaks apart Mr. Hale slaps Derek's back, and Laura gives him a noogie, and Mrs. Hale kisses his face. Stiles hangs back, suddenly unsure if he should have come out here at all. He feels awkward and a little out of place. He has no idea where his dad is; he lost him in the crowd somewhere.\nHe's just about to slink away when Derek sees him. He calls Stiles' name and starts fighting his way out of the cluster of people around him, grinning. Stiles shoves his way forward, squeezing between the team mascot and two cheerleaders, suddenly desperate to get to Derek. As soon as he does, Derek grabs Stiles and hugs him, picks him right up off his feet. \nStiles has a moment where he thinks he'd rather not be handled like he's Derek's love interest in a movie, but then he realizes he actually doesn't mind at all and hugs him back. He wraps his arms tight around Derek's neck and hangs on, pushing the side of his suddenly hot face against Derek's sweaty one. Derek swings him in a circle, laughing.\nDerek finally comes to a stop and lets go, and Stiles slides all the way down Derek's body, his T-shirt riding up when it catches on the edge of the pads under Derek's jersey. When he lands, Derek's hands stay on Stiles' waist and Stiles' hands stay locked around the back of Derek's neck and they stare at each other for a second. Stiles feels like he can't look away from Derek's shining eyes.\n\"Great game, Derek,\" Stiles' dad says, appearing out of nowhere to clasp a hand over Derek's shoulder. Stiles and Derek hastily let go of each other, and Dad spins Derek around so he can hug him. \"I’m really proud of you,\" he says. It's hard to tell, because Derek's already flushed and sweaty, but Stiles thinks he blushes.\nJust as Dad lets Derek go, a bunch of football players come swooping down on them and pick Derek up, chanting the Beacon Hills fight song, and make off with him. \n\"I'll see you later!\" Derek calls back to Stiles. Any response Stiles would give would be lost in the mayhem, so he simply gives him a thumbs up. \nBy that time the crowd is already starting to disperse, and as they make their way back to the gate Stiles spies Derek's parents walking a short distance away, so he introduces them to his dad; Laura's nowhere to be seen. All three parents looked thrilled to finally meet each other. Stiles finds himself walking behind the adults, trying not to listen to what they're saying, though he does hear the phrase \"good kid\" three or four times. \nSomeone in a cheerleader's uniform bumps his shoulder, and when he looks over he sees it's Cora Hale.\n\"Hey,\" Stiles says. \"Good, um. Cheerleading.\" He'd barely paid any attention to the cheerleaders, truthfully. He'd only had eyes for Derek.\n\"Thanks. It was nice of you to come to the game,\" she says, but her tone is off, like she's actually angry he did. Stiles is baffled.\n\"I can come to the games if I want,\" he says, just to be contrary. \n\"Then why haven't you?\" she asks accusingly. \"There was a whole season before this, you know.\"\nStiles shrugs. \"Football isn't really my thing,\" he says. And the games are always on Friday nights, when he and Scott usually hang out, and also who wants to come back to school on Friday night after you've been cut loose for the weekend? Stiles practically has hives just from being here now.\n\"But it's Derek's thing,\" Cora says, really stressing Derek's name.\nStiles tilts his head and thinks about that for a second. Derek had never said anything, and Stiles hadn't given it even a passing thought until this week. This game was special, for a division title, so Stiles decided to come, like how he only watches the Super Bowl on TV, not any of the regular games.\n\"Did he want me to come to the games?\" Stiles asks. That has never occurred to him.\n\"You think?\" Cora asks, with a strong undercurrent of Duh. \n\"What's your freakin' problem?\" Stiles asks, annoyed. Derek's whole family acts so weird toward him, either suffocatingly nice or unnervingly threatening, and Stiles hasn’t done anything to deserve either. \"Derek probably doesn't even care if I'm here.\" Even as he says it, he feels like that's probably not true. They hugged and stuff, just now.\nCora pivots and steps in front of him, forcing Stiles to stop walking so he doesn't run right into her. She glares at him and crosses her arms over her chest, which is so reminiscent of Derek Stiles almost laughs. \"Listen,\" she says, dropping her voice so much Stiles has to actually lean a little closer to hear her. \"You might not think this is a big deal, but Derek had a girlfriend a couple years ago who really messed him up. You need to be careful with him.\"\n\"I’m not his girlfriend,\" Stiles says, dumbfounded. \"I'm just his…\" he searches for the right term \"…math friend.\"\nCora rolls her eyes heavenward, like she's hoping a lightning bolt will come out of the sky and kill her. Or maybe kill Stiles. Probably Stiles. She mutters something under her breath that sounds a lot like the word \"idiot.\"\n\"I have no idea what's happening right now,\" Stiles confesses.\nCora gives him an exasperated look and hits him in the chest with one of her pom pons. \"Derek says you're really smart. Start acting like it,\" she says, and flounces away in swirl of pleated skirt and swinging ponytail.\n~*~\nStiles already has the air mattress blown up and in place next to his bed, covered in clean sheets and blankets, by the time Derek shows up at the Stilinski house. His hair is still damp and he smells like too much Axe again. Stiles vows to dig through his duffle and throw away the bottle as soon as he falls asleep.\nAs soon as Derek walks in the door he gives Stiles one of those sideways hugs, like he always does when they do well at tournaments—that's two hugs in one night. He's still a little pumped up from victory, wired on adrenalin, and it's a good look on Derek. He looks happier and younger than usual, less like a vice cop trying to pass as a high school student. He's also ravenously hungry.\n\"Oh my God, do you have a tapeworm?\" Stiles asks, sitting at the kitchen table watching Derek systematically devour three slices of cold pizza, and wash them down with a big glass of milk. This is after Stiles heated up a chicken pot pie for him, and a leftover piece of lasagna. \nDerek doesn't answer, just keeps chewing.\n\"Cora talked to me at the game,\" Stiles ventures a minute or so later, not entirely sure he wants to bring it up, but he's been feeling guilty ever since.\n\"Great,\" Derek says tiredly, setting his pizza down. His face closes off a little, like he already knows he's not going to like what she said.\n\"I’m sorry I didn't come to more of your games,\" Stiles says. Derek looks slightly taken aback. \"I mean, if you wanted me to come to your games, I'm sorry I didn't. If you didn't care, then I guess I'm just making an idiot out of myself. Which is completely Cora's fault, not mine.\"\nBy the time Stiles shuts his yap, Derek's looking back down at his plate, picking at a stray piece of lasagna noodle. He doesn't say anything, which is all the confirmation Stiles needs.\n\"I would have come to all of them, if I'd known,\" Stiles tells him. He kind of wishes he had his own lasagna noodle to pick at, but since he doesn't he has to make do with nervously twisting his fingers in what was Derek's napkin. \nDerek takes a swig of milk before he looks up at Stiles. \"You don't like football,\" he says.\n\"Not really, no,\" Stiles admits. \"But I like you.\"\nDerek shyly ducks his head and smiles down at his plate. \"Thanks for coming tonight,\" he says, and goes back to his pizza like they didn't just have what probably passes for a heart-to-heart for teenaged guys.\nIt went well, though, Stiles thinks, giving himself a mental pat on the back before he gets up and pours Derek another glass of milk.\n\"We should hit the sack,\" Stiles says a little while later, fighting off a yawn. They have to be up at 4am. Plus, if he lets Derek hang out in the kitchen much longer there won't be anything left to eat for breakfast.\n\"All right,\" Derek burps, after draining the last of his milk. He snags a banana out of the fruit bowl on the way out of the kitchen.\nStiles brushes his teeth first, and then changes into sweatpants and an old T-shirt. By the time Derek's done in the bathroom, Stiles is already in his bed, under the covers, careening between anticipation and dread. He's never had anyone sleep over except Scott, and he doesn't have a crush on Scott. He was never this anxious about being alone in his bedroom with Scott. This is where Stiles jerks off! While thinking about Derek!\nWhen Derek finally comes back in, he strips down to his underwear--dark blue boxer briefs that leave almost nothing to the imagination--and Stiles silently gulps and tries not to stare. Derek looks really nice in just in his underwear, and somehow even older--more muscles and body hair than most of the guys in Stiles' gym class, and definitely more than Stiles himself. Dad keeps promising Stiles he'll hit a growth spurt soon. It can't come soon enough.\nStiles picks up his phone and futzes with the alarm until Derek's safely under the blanket. \"Where's your phone?\" he asks Derek. Dad's gonna get up with them, too, but better safe than sorry. \"Did you set your alarm?\"\nDerek flings the blanket back and rolls to his hands and knees so he can grope around in the pockets of his jacket, which is hanging over the back of Stiles' desk chair. The view is...stimulating. When he turns back around Stiles almost gets busted checking out his ass. He kind of wishes Derek slept in more clothes.\nDerek crawls over and sits on the edge of the mattress closest to Stiles' bed. \"Here,\" he says, handing the phone to Stiles to see for himself. He wraps his arms around his hairy knees and watches while Stiles carefully examines the alarm setting.\n\"Looks right,\" Stiles says, satisfied. He hands the phone back to Derek, who sets it on the nightstand next to Stiles' phone, but doesn't lie back down.\nStiles turns on his side and rests his head on his hand. Derek is looking at him, and Stiles looks back, waiting. It feels like Derek wants to say something.\nDerek finally clears his throat. \"You ready for tomorrow?\" he asks.\nAh, Stiles thinks. That's what's going on. He's got a case of the nerves. \"Yeah,\" he says, with a little more confidence than he feels. He's got a touch of the nerves, too. \"Are you?\"\n\"Think so,\" Derek nods. \"You're a good teacher.\"\n\"Nah,\" Stiles says, grinning. \"You're a math genius.\"\nDerek shrugs a bashful shoulder and looks down at his knees and then back up at Stiles. His eyes are bright and he's smiling that same soft smile Stiles recognizes from the night they went out for pizza. He takes Stiles' breath away. \n\"It's true,\" Stiles says, because he wanted to go to regionals so badly, and it looks like they have a chance to get there, but somewhere along the way that became secondary to Derek himself. Derek is a great guy, once you get to know him. If he lets you get to know him.\nAnd Stiles can't deny anymore that this chance to get to know Derek, and spend time with him, has been the real prize in all of this. Once the tournament season is over, they won't have an excuse to hang out anymore, and Stiles has been secretly hoping Derek might still find some time for him. At the end of the school year Derek will graduate, and probably leave Beacon Hills for college. Stiles might never see him again after that. He's been trying not to dwell on it. \n\"The team is full of math geniuses,\" Derek points out, lifting what Stiles thinks of as his smartass eyebrow. It's the one he uses around Stiles a lot.\n\"Yeah, but none of them are as pretty as you are,\" Stiles grins.\n\"You think so?\" Derek asks, just a beat too late to qualify as banter. He says the words lightly enough, but with just a hint of a tone that sets Stiles' alarm bells ringing. He shouldn't have made the joke. It's too close to home.\n\"Well, you aren't as handsome as I am,\" Stiles says, trying to cover with another joke. \"But don't worry, I won't tell anyone you joined the math team just to get in my pants.\"\nDerek is ominously, guiltily silent, but his face slowly turns a bright, unflattering red.\n\"No. Way,\" Stiles says, astounded. The back of his neck feels sweaty all of a sudden. \n\"It wasn't just to get in your pants,\" Derek says hurriedly. \"I like being on the team, and I like Isaac and Scott. I made friends. But.\" He stops, teeth worrying at his lower lip as he examines his knees some more. Stiles has never seen him look this unsure of himself.\n\"But what?\" Stiles asks, with what little air he's managed to suck into his lungs. He's still trying to figure out if this is really happening.\n\"But spending time with you was part of it.\" He hesitates, then looks up as he confesses, \"A lot of it, in the beginning.\"\nHoly shitballs, Stiles thinks. Cora was right. He is Derek's girlfriend. Wait, no--boyfriend! Something more than a math friend, that's for damn sure.\n\"You liked me back then?\" Stiles asks. That had never occurred to him. Sure, he'd hoped more than once that Derek would grow to see how amazing Stiles was while they were spending time together, like in the movies, but he'd never dreamed that Derek had liked him from the beginning. That hadn't even been on his radar.\n\"Yeah. I actually—I thought you were trying to ask me out, that first time I gave you a ride home,\" Derek admits, looking sheepish.\n\"And instead I asked you to be on the math team,\" Stiles groans, slapping a hand over his eyes. \"Oh my God.\" He's so deeply, retroactively embarrassed. That does explain a lot about Derek's hostile reaction that day, though. He must have been so disappointed, if he'd been expecting—hoping for--something else.\n\"Why didn't you just ask me?\" Stiles wants to know. \"I’m pretty sure that's how it works. The hotter, more popular one has to ask the loser out.\" \n\"You're not a loser,\" Derek says, mouth thinning into a flat line. \n\"You didn't actually answer my question,\" Stiles points out.\n\"I wanted to,\" Derek says, turning sheepish again. \"I sat behind you in study hall for weeks, trying to get up the nerve to talk to you.\"\nStiles is outraged by this information. \"What? I thought you were trying to kill me with your death glare!\" \nDerek looks irritated. \"I don't have a death glare,\" he says, giving Stiles a toned-down version of his death glare. It must be love if he can't even work up a real one.\n\"Boy, are you deluded,\" Stiles says, but nicely.\n\"Maybe.\" Derek looks down at his knees again, then back up at Stiles, face open and hopeful. \"Can I kiss you?\" he asks, already leaning forward a little to do it.\n\"Right now?\" Stiles asks, voice going embarrassingly squeaky.\n\"Yes, right now,\" Derek says, mouth quirking. He's so close Stile can see every single one of the six hundred different colors in his eyes. \"Or do I need to do that in front of the entire cafeteria, too?\"\nStiles' toes curl into the sheets just at the thought of it. \"Is that what that—really?\" he asks.\nDerek nods as he slowly slides his hand under Stiles' blanket and closes his fingers over Stiles' forearm, warm and sure. \"Really.\"\nSo maybe Stiles is also smart at math and dumb at life. \nClearly they're perfect for each other.\n\"I think the first time can be just us,\" Stiles allows. He pushes himself up onto his elbow and Derek comes up onto his knees and their mouths meet in a rush of toothpaste breath. Stiles remembers too late he's never kissed anyone before and should be nervous, but Derek's taking the lead anyway, cupping Stiles' face with his hand, thumbing his jaw open. His tongue is hot and gentle.\nIt feels like Stiles' insides are melting, and he wants to keep doing this forever, but no sooner does he think that than he hears his dad's footsteps on the stairs and he jerks away. Swearing under his breath—oh shit oh shit oh shit--he reaches up and turns off the lamp next to his bed, plunging the room into darkness, then flips over onto his back and pulls the covers up to his chin. Next to him, he hears Derek moving around, probably doing the same.\nDad comes down the hallway and pauses outside Stiles' room. With no light and no sound coming from it, he'll probably assume they're already asleep, which he must, because he continues on down the hall to his own bedroom. Stiles hears the squeaky hinge on his door squeal as he closes it.\nStiles' heart is beating a thousand times a minute, though he's not sure if it's from kissing Derek or almost getting caught kissing Derek. Probably a little of both. His eyes have adjusted to the darkness, and he can see a little now, thanks to the faint glow of the street light through the blinds. \nDerek's head pops up next to Stiles'. \"C'mere,\" he whispers, scooting back a little as he tugs Stiles down onto the air mattress with him, and Stiles gladly goes. The mattress is squishy, and they bonk heads while Stiles is trying to wiggle under the blanket, but finally they're both under it, knees knocking together, faces inches apart.\nThere's no sound at all from the direction of Dad's room now. All Stiles can hear is the whoosh of his own blood rushing through his ears, and Derek's stubble rasping against the pillow when he shifts to get comfortable. Derek's hand finds Stiles' beneath the blankets, twining their fingers together.\nStiles has never held hands with anyone before, except when he and Scott were little and had to hold hands for safety under parental orders. This is a lot different. Even just Derek's thumb stroking over Stiles' knuckles is making Stiles' lungs feel too small.\n\"Are we boyfriends now?\" Stiles wonders. He can't see the color of Derek's eyes, but they're almost glittering in the dim light, watching Stiles watch him.\n\"We better be,\" Derek says, fingers twitching in Stiles' grip. \"I put a lot of work into convincing you I'm not a dumb dickhead.\"\n\"I didn’t think you were a dumb dickhead,\" Stiles argues. The exact words he used to Lydia were \"musclebound meathead\" so that's technically true.\nDerek nudges Stiles' knee with his own. \"You called me a dumb dickhead right to my face,\" Derek says. \"Up until you asked me for a ride, I thought you hated me.\"\nStiles didn't actually ask Derek for a ride that day, but he lets that slide, because there's a more grievous error that needs correcting. \"I never called you a dumb dickhead.\"\n\"Yes, you did,\" Derek insists, and he sounds really convinced he's right. \"When you almost shoved me in the pool.\"\n\"Oh. That,\" Stiles says, swallowing. He wishes Derek hadn't brought that up. He'd effectively blocked out the fact that Derek once bullied him, and he doesn't want to be reminded of it right now. \"I don't remember saying that, but you were being a dickhead.\"\nDerek's mouth immediately draws down in displeasure. \"No, I wasn't!\" he protests in an enraged whisper. \nThis relationship is going to be over before it even begins, but Stiles cannot let that go. He lets go of Derek's hand so he can push himself up onto one elbow and glare down at Derek in the dark. \"You were bullying me. And it was my first week of high school, and you probably have fifty pounds on me. That's a huge dickhead move.\"\nDerek makes an annoyed sound and levers himself up, too, making Stiles lurch precariously forward again, but this time he catches himself before their heads connect. Stupid air mattress.\nDerek palms the back of Stiles' neck with his slightly sweaty hand and looks him square in the eye. \"Stiles, I swear I wasn't bullying you. I was trying to stop Jackson. Your backpack would have gone in the pool if I hadn't caught it.\" His mouth quirks. \"And then you screamed at me and tried to push me in.\"\n\"You were trying to help me?\" That's great news. Still humiliating, but great. \"I didn't realize—I thought--I thought you were, you know.\" Stiles waves a hand in the air. \"In cahoots with him.\"\nThere's the smartass eyebrow again. \"In cahoots?\" Derek asks. \"What are you, eighty years old?\" He gives the back of Stiles' neck an affectionate squeeze.\nStiles ignores both the comment and the eyebrow. \"You weren't picking on me?\"\nDerek shakes his head vehemently. \"No. Stiles, have you ever seen me do anything like that? Even if I wanted to—which I don't—Cora would tell my parents in a second, and my mom would kill me.\"\nThat's probably true, Stiles knows. And it's also true he's never witnessed Derek do anything mean to anyone at school. He looks intimidating, but he's actually a big marshmallow.\n\"And I wasn't giving you a death glare in study hall,\" Derek adds, stubbornly going back to that argument. \"I was hoping I could get you to talk to me a little, but you always ignored me.\"\n\"That's called survival instinct,\" Stiles explains patiently. Derek's probably never spent any time at the bottom of the pecking order. He doesn't understand how it works. Stiles likes him anyway. \"You always looked so annoyed. I thought you hated everyone, including me.\" \nBut now Stiles knows something he didn't know back then: the angrier Derek looks, the harder he's trying to hide something, and the more important that something is. And he was trying to hide how he felt about Stiles.\n\"I wasn't annoyed,\" Derek insists. \"I liked you. A lot. Why does that seem so unbelievable?\"\n\"Let's face it, I’m an easy target for bullies,\" Stiles says, shrugging. \"I weigh a hundred and thirty pounds, and I barely come up to your chin. I'm scrawny and—\"\n\"You're fifteen,\" Derek interrupts. \"I was scrawny when I was fifteen, too.\"\nStiles isn't quite sure how true that is, but whatever. \nDerek hitches a little closer, barely brushes his mouth against Stiles' before pulling back so he can look at him. \"There's just something about you,\" Derek says softly. \"I noticed you the first day in study hall and I just…I wanted to know you. And I like looking at you.\" He touches Stiles' face with his fingers. The tip of his nose, the middle of his upper lip, the hollow of his throat. Like Stiles is something beautiful and delicate. \nThis is a revelation. Stiles doesn't have Derek's rugged good looks, or Jackson's Abercrombie model ones, but Derek likes the way he looks. In Stiles' experience, people are usually too shallow to look past the glasses and the Star Wars T-shirts, but Derek did, right from the first time he laid eyes on him. Stiles feels a little bad now for how harshly and incorrectly he judged Derek based on how he looks. Derek is a good guy. Stiles is really lucky.\n\"I believe you,\" Stiles says, swallowing. \"Can we go back to kissing?\"\n\"Yeah,\" Derek says, sounding relieved. His hand creeps up the front of Stiles' shirt and tugs a little, drawing him forward until their mouths meet.\nOnce he gets a chance to apply himself without interruption, Stiles gets the hang of kissing pretty fast. He figures out how to move his mouth, where to put his tongue, and Derek helps by angling his head just right, fingers cupped lightly under Stiles' jaw. They keep doing that for a while, and pretty soon Stiles is lying on the mattress again, half underneath Derek, clutching at his bare back while Derek snuffles against his throat.\n\"You smell so good,\" Derek groans, which seems kind of weird, and makes Stiles a little self-conscious. He doesn’t really know what to say in response to that. He must be getting used to the Axe, because he thinks Derek smells okay, but that's hardly a ringing endorsement. It's probably best not to say anything at all.\nDerek doesn't seem to care either way, just keeps driving Stiles crazy with his mouth, nipping at Stiles' collarbone through this T-shirt, and biting at the tendon in his neck, catching his lower lip and tugging on it. Stiles has no idea if everyone likes to use their teeth so much or if it's just Derek, but he's not complaining. Derek's thumb has found its way under the bottom of Stiles' t-shirt and is rubbing a small circle into his side while he sucks on Stiles' neck. It's torture, and Stiles is praying he doesn't stop. \nHe grinds his hot face into Derek's bare shoulder and reminds himself that he doesn't want to end this awesome day by getting busted by his dad. He tries to keep quiet, tries to keep it to a choked out, \"Oh, my God,\" but his voice goes reedy at the end and he moans a little. Derek immediately surges up, shushing him, using his own mouth to muffle the little sounds Stiles can't stop making.\nBy the time Stiles calls a time out he's on top of Derek, his shirt's pushed up under his armpits and he can feel how hard Derek is, pressing against Stiles' hip. Stiles is in the same state. He doesn't want to do much more than this, though. He just had his first kiss a few minutes ago, and even as turned on as he is, the thought of someone touching his dick is a little intimidating. The thought of touching someone else's is terrifying. He's probably an embarrassment to horny teenaged boys everywhere.\n\"Is it okay if we stop?\" Stiles asks, hiding his face in Derek's fuzzy chest. He has no idea how much Derek's done, but he's undoubtedly more experienced. He's older, and looking like he does, he's probably had lots of opportunities to do lots of things.\n\"Yeah, of course,\" Derek says, smoothing his hands down Stiles' bare back, making him shiver pleasantly. \"Was this too much?\"\n\"No, this was just right,\" Stiles says. He pets the back of Derek's neck with his fingers, which makes Derek's hips twitch. Interesting.\nThey lay together for a while like that, just touching and breathing. It's really nice. Stiles likes the way their bare bellies feel against each other.\n\"Have you ever done it?\" he asks Derek, curiosity getting the best of him.\n\"Yes,\" Derek says, after a moment of hesitation. \"Have you?\"\nStiles snorts loudly in Derek's ear, and Derek flicks him in the head in retaliation, but then he rubs the spot where he flicked him.\n\"We'll do whatever you want to do,\" Derek says, kissing him on the temple. \"I'm not in a hurry. I like doing this.\"\n\"Me, too,\" Stiles sighs. \"I hope your sisters aren't going to kill me for it.\"\nDerek's laugh is low and rumbly. Stiles can feel it vibrating against his ribs. \"I think you're safe. I know Cora at least was rooting for this. She and Laura are just a little over-protective.\"\n\"You're going to have to tell me the story behind that at some point,\" Stiles says, and Derek sighs. \"You don't have to do it now,\" Stiles adds hastily, hoping he didn't ruin the mood.\n\"I might as well,\" Derek says, sounding resigned. \"The story is I had a girlfriend who threatened to kill my family.\"\nStiles immediately lifts his head. \"What? Are you joking?\" Derek does not look like he's joking. There is not one single trace of humor anywhere on his face.\n\"Not one little bit. It really sucked,\" Derek says flatly. \n\"Well, yeah,\" Stiles boggles. He's lived his entire life so far knowing his dad could get hurt, or worse, in the line of duty, but even he can't imagine how it would feel to have someone actually threaten to kill your family. No wonder Derek's parents made him invite Stiles over so they could vet him in person—they had every right to be wary. They'd certainly been very nice to him, considering the circumstances. \"That explains a lot about your sisters. And now I really appreciate how nice your parents are to me. Yikes.\"\n\"Sorry about that,\" Derek says, grimacing. \"And I'm sorry I was a jerk. I hate being reminded of it, and I hate that they worry about me, but I guess I deserve it. Laura and Cora were afraid I'd make another bad choice, and my parents were afraid I'd never date anyone again. So they overdid it a little.\"\n\"Just a little,\" Stiles says, holding up his thumb and forefinger an inch apart. \"I'm kind of glad I didn't know all this when I met them, though. I don't think I could have taken the pressure.\"\n\"Nah,\" Derek says, giving Stiles a little squeeze. \"You're fine under pressure. And anyway, you did great. Cora and Laura both like you, and my parents are really glad they got to meet you, and that I'm hanging out with someone my own age. I didn't tell anyone about Kate, until the shit hit the fan. She was…older.\"\nHoly crap, another bombshell. Derek dated a homicidal cougar.\n\"Well, it's safe to say I have no plans to murder your family,\" Stiles reassures him, putting his head back down and closing his eyes.\n\"Thanks,\" Derek says wryly. \n\"No problem.\"\nWith that squared away, there doesn't seem to be much else to say, and they lapse into comfortable silence. Derek's fingers settle on the back of Stiles' neck and begin to rub lightly back and forth. It feels so good Stiles almost purrs.\n\"We should get some sleep,\" Derek whispers a little later. It still feels like he's hard, but he doesn't seem to care.\n\"I know,\" Stiles whispers back. He's warm and drowsy, and Derek's fingers are still stroking his neck in a hypnotic rhythm.\n\"You wanna move your pillow down here?\" Derek asks, and the answer to that is yes, obviously. There's no way Stiles is letting go of Derek now that he can finally touch him all he wants. He reaches up and grabs his pillow, and lets Derek tug his shirt back down and spoon up behind him.\n\"Hey,\" Derek says, just before they drift off. \"Can I see the model railroad some time?\"\nNo one's ever seen it, except Scott. \"Of course.\"\n~*~\nStiles' alarm goes off about two seconds before Derek's does, and they both reach for their phones, fumbling around in the dark. \n\"Time to get up,\" Stiles says, once they're turned off, but he nestles down against Derek's shoulder instead. \n\"Mmm,\" Derek mumbles, slipping his hand up the back of Stiles' shirt. \"'S'early.\"\n\"Yeah,\" Stiles agrees. It's still pitch black dark outside. \"But we gotta get up. We gotta go kick some math nerd ass.\"\n\"We're math nerds,\" Derek points out, though the words get a little lost in a giant yawn.\n\"I know. It's awesome,\" Stiles says. He can feel Derek's dick rubbing against his own through their clothes, and it's making the small of his back tingle. He shifts a little, experimenting, and Derek's hand slips down to his ass and presses, holding them together. Derek makes a rough sound in his throat that lights up every nerve ending in Stiles' lower body. Stiles is already starting to get over his dick fear.\nThen he hears his dad's bedroom door open--thank God for that squeaky hinge--and Derek jerks and hisses, \"Shit! Your dad!\" but Stiles is already scrambling up onto his bed, kicking his feet under the covers and yanking them up.\nDerek tosses Stiles' pillow up to him, hitting him in the face, just before Stiles' dad taps his knuckles on Stiles' door and then opens it. \"You boys up?\"\n\"Yep!\" Stiles said, maybe a little too perkily. He sits up, pillow conveniently in his lap, and switches on the lamp next to his bed, which immediately floods the room with an almost painful level of light. On the floor, Derek groans and pulls the blanket over his head.\n\"I guess I'll get in the shower first,\" Stiles says, squinting down at him.\n~*~\nHalfway between Beacon Hills and Sacramento, Stiles pulls a bag of Cheetos out of his backpack. Breakfast of champions.\nBefore he even gets it open, Derek snatches it away from him and throws it out the window.\n~*~\nStiles almost has two nervous breakdowns during the state tournament, which Derek manages to stave off both times with liberal application of soft pretzels and softer kisses.\n\"We're going to regionals,\" Stiles murmurs against Derek's mouth. The tournament is over and Stiles is riding a victory high so intense he can barely stand still. Derek's helping him out with that by crowding up against his front. So thoughtful.\nThey're huddled together in a little alcove near the bathrooms, taking a minute to celebrate by themselves. The kind of celebrating that involves a lot of tongue. Their parents are out in the lobby with the rest of the adults, and they're all going out for a celebratory dinner after this.\nDerek drags the tip of his nose along Stile's jaw. \"Mmmm. I better spend the night again before we leave. Just in case,\" he says against Stiles' ear, curling his hands around Stiles' hips. His voice sounds deeper than usual, and it makes the hair on the back of Stiles' neck stand up.\n\"Yeah, you better,\" Stiles agrees, a little breathlessly. \nDerek moves to kiss him again, but then takes a quick step back instead, putting a little distance between them, when footsteps approach, just in case it's a teacher or a parent. It's just a hotel employee, and he walks right by without even glancing at them. \n\"False alarm,\" Derek says, as Stiles sticks his hands in Derek's jacket pockets to pull him close again. His fingers find a folded up piece of paper in one of the pockets. \n\"What's this?\" he asks, pulling it out, then realizes it's the notebook page of math that started it all. Derek's been carrying it in his pocket all this time.\nHe opens it up and smooths it flat against Derek's chest so he can look at it again. If Derek hadn’t dropped it, and if Stiles hadn't picked it up, they probably wouldn't be here right now. Stiles has a lot to thank this piece of paper for, he thinks, as his finger traces the scribbles. He recognizes the equations, the shark, the bubble letters. And this time, he recognizes the other drawing on it, the back of some dude's head. \nIt's him.\n\"That's me,\" Stiles says, blinking at the drawing. \nIt seems impossible he didn't realize that the first time, because it's so clearly him. His hair, his ears, the freckle on the back of his neck his grandma once tried to scrub off because she thought it was mud, even the ragged tear in the collar of the shirt he refuses to throw away because it's his favorite. Derek noticed every detail, captured each one perfectly, probably spent as much time on them as he did on the equations. \nAnother lightbulb goes on. \n\"That's why you were so upset I found this,\" Stiles says, looking up into Derek's amused eyes. He can feel Derek's heart beating underneath the paper. \"You weren't freaked out I saw the math. You were freaked out I saw me.\"\n\"Well, yeah,\" Derek says, mouth curving up into a smile as he dips his head to kiss Stiles again, slow and sweet. \"It was always about you.\"\n\nThe End\n"
}