{
    "id": "15231123",
    "url": "https://archiveofourown.org/works/15231123?view_full_work=true",
    "author": [
        "Isnt_it_pretty_to_think_so"
    ],
    "title": "Hot Chocolate",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [],
    "fandoms": [
        "Spider-Man: Homecoming (2017)",
        "Marvel Cinematic Universe",
        "The Avengers (Marvel Movies)"
    ],
    "relationships": [
        "Peter Parker & Natasha Romanov",
        "Peter Parker & Tony Stark",
        "Peter Parker & Avengers Team",
        "Natasha Romanov & Tony Stark",
        "Steve Rogers & Natasha Romanov",
        "Bruce Banner & Natasha Romanov"
    ],
    "characters": [
        "Peter Parker",
        "Natasha Romanov (Marvel)",
        "Tony Stark",
        "Avengers Team (MCU)",
        "Steve Rogers",
        "Bruce Banner",
        "Clint Barton"
    ],
    "additional_tags": [
        "a spider friendship fic that no one asked for",
        "also a little iron dad thrown in there because why not",
        "brief passover mentions of past steven \"skip\" westcott in conversations",
        "but no one ever really explicitely addresses it",
        "so I'm not even tagging him as a character",
        "peter parker lifts thor's hammer"
    ],
    "language": "English",
    "series": "Part 2 of An Unofficial Introduction to the AvengersPart 1 of Natasha Romanoff, Professional Problem Solver",
    "published": "2018-07-09",
    "completed": "2018-07-15",
    "words": "14,189",
    "chapters": "7/7",
    "comments": "966",
    "kudos": "26,757",
    "bookmarks": "3,632",
    "hits": "258,284",
    "summary": "<p>“So,” Natasha says smoothly, raising an eyebrow. “You’re Spiderman.”</p>\n<p>The kid is practically hyperventilating, staring at her with those damn eyes. “You . . . you . . .”</p>\n<p>“Relax,” she says, heading over to her secret stash of cocoa. “If I wanted to kill you, you’d be dead. Do you want some hot chocolate?”</p>\n<p>OR: The first time Natasha meets Stark's kid, it's almost three in the morning; spiders don't sleep, after all. Natasha is just used to being the only spider.</p>\n<p>The wonderful podfic: https://archiveofourown.org/works/41382891, done by the magnificent Lemon_Avocado.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>This fic is a tad more intense than the first in the series . . . whoops . . . sorry . . .</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>I have this fic mostly written out already, but I'm still ironing out some of the major plot points. Any feedback you have is wildly appreciated, you have no idea.</p>\n<p>Just to give you guys an idea of what I'm doing: there will probably be anywhere from one to four more chapters in this fic. I'm not sure how much of what I've written will make the final cut.</p>\n<p>Thank you all so much for your feedback, it means the world.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>The comments being left on this fic legitimately make me glow. Every five minutes when I check my email, new ones show up and they just make me so happy, you know? I read and reread them over and over again, you guys have no idea. The amount of warm fuzzies I've gotten is mind boggling.</p>\n<p>Also: for those of you asking about my update schedule, I do everything I can to update daily.</p>\n<p>I was so amazed by the incredible amount of feedback, I actually showed this fic to my older sister to try and get her to Beta for me. She was actually weirdly supportive . . .</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>I may not have spent all of last night trying to make medical advances BUT I did wake up at three and edit this draft to the best of my abilities SO THERE Peter</p>\n<p>So the first time I posted this, a huge chunk of it got deleted somewhere along the line . . . sorry guys. Thank you to Ticker for pointing it out to me!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>Just to let you guys know what I'm planning on doing: there will be one more chapter in this fic (two, if it gets too long) and one more fic in this series. It will probably be a one shot covering the evolution of Peter and Tony's relationship from the beginning, and it will be significantly longer than any of the chapters I've posted. Because of this, it might take me one or two days to get it up after I finish this fic.</p>\n<p>I'll also be posting a few one shots over the next few days; I posted the first one last night.</p>\n<p>And as always, thank you so much for your comments, you have no idea how much they mean to me.</p>\n<p>Yes, this is the last chapter in this fic. But stay tuned! There will be a third fic in this series - a one shot - capturing the evolution of Peter's relationships with everyone, but mainly Tony Stark.</p>\n<p>I hope you guys enjoy.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">more notes</a>.)\n</p>\n<p>I tried - and failed - to draw a picture of the Instagram pic, just for fun (and because I thought it would be cute.) But I'm really, really bad at art. Also, did I mention just how bad I am at art? I feel like I didn't. Oh well. I'll stick to writing.</p>\n<p>UPDATE 9/19/20! Unfortunately, I've been locked out of my old tumblr account. This is my new<a href=\"https://isnt-it-just-so-pretty-to-think.tumblr.com/\" rel=\"nofollow\"> tumblr</a>if you guys want to check me out. </p>\n<p>Also, I'm hoping to start posting new stories over the next couple of days, so keep your eye out for that &lt;3</p>\n<p>5/29/23 update:</p>\n<p>Hi friends! If you’re a fan of my writing, I’m happy to announce I’m self-publishing an original work. It’s free to read and contains chaos gremlins, hilarious hijinks, moments of angst, and an IronDad character dynamic between two of the leads—in short, if you like my fanfiction, you might enjoy my novel. I’m posting a chapter a day until it’s all up on Royal Roads. It would mean so much to me if you were willing to check it out and lend some love. Link <a href=\"https://www.royalroad.com/fiction/68991/bloodstained/chapter/1225449/chapter-1\" rel=\"nofollow\">here!</a></p>",
    "text": "The first time Natasha meets Stark’s kid, it’s almost three in the morning. The tower is usually empty at this point; everyone’s usually either asleep or pretending to be. Natasha’s used to having the place to herself.\nBut the kitchen light is on. And there’s a child sitting at the table.\nIt takes her a second to recognize the kid. He’s straddling a chair, his hands clasped around a mug of steaming tea, his lips moving soundlessly as he stares at an open textbook in front of him. He’s wearing a baggy, grey, long sleeved tee-shirt and a pair of fluffy Hello Kitty sweatpants.\nNatasha clears her throat.\nHe looks up in an instant, brown eyes wary and unsure. She places him as soon as she sees his face—he’s Stark’s intern. She’s never officially met him, but she’s seen him around. He follows Stark around like a puppy dog, talking incessantly. She doesn’t know that much about their relationship, but she’s observant enough to know that he’s got Stark wrapped around his little fingers.\n“Oh my god,” he says, and he shuts the chemistry textbook hurriedly. His eyes are rimmed with red, but their wider than should be humanly possible. “You’re the Black Widow.”\nShe sizes him up, from the Hello Kitty sweatpants to the weird wrist guards that are strapped to his hands.\n“Nice pants,” she says critically.\nHe glances down, and his face flushes. “Thanks,” he says. “Mr. Stark gave them to me. Do you . . . want some tea, or something?”\nNatasha raises her eyebrow, but doesn’t respond. She moves over to one of the many, many drawers Stark has, pulling one open. The fake bottom is still there. Her secret stash of Hot Chocolate is still hidden in the place where she left it, safe from Clint. \nThe kid’s mouth opens slightly. “Whoa,” he says. “How long has that been there?”\nNatasha doesn’t answer the question. “If you tell Tony, I’ll . . .”\nThe threat of castration dies in her throat, because his eyes are wide and earnest in a way that reminds her eerily of Steve. Also, he’s just a kid.\nNatasha clears her throat. “Don’t tell Tony.”\nThe kid bites his lip. “I shouldn’t lie to him,” he says. “But I can’t see it coming up in conversation, so your secret is safe with me.”\nNatasha makes it just the way she likes it—two packets of hot chocolate mix, ¾ mug of hot water, the rest cool so it doesn’t burn her tongue. She adds two pumps of the creamer that Tony keeps by the counter. It tastes exactly like she remembers it.\nShe leaves without saying goodbye to the kid. It doesn’t matter; his face is once again buried in his chemistry textbook. She’s not sure if he even notices that she’s gone.\n \n___\n \nHe’s left the compound by the time she wakes up the next morning, so she finds Stark instead. \nPeter isn’t adding up. There’s something off about him, something Natasha doesn’t understand. And Natasha doesn’t like to feel like she’s in the dark.\nStark is in his lab, busy making edits to a new suit for the vigilantly that fought with them in Germany. Friday lets her in without much of a problem, which means that Stark is feeling more social than usual.\n“What’s the deal with your kid?” Natasha says bluntly as soon as she’s inside the lab.\nTony doesn’t look up from his computer screen. His eyes are bright behind his large glasses, and he looks better rested than she’s seen him in a while.\n“You’ve been reading too many tabloids,” Tony says absently. “I don’t have a kid.”\n“Then who was doing his homework in your kitchen last night?” Natasha asks. “At three in the morning, might I add?”\n Tony frowns, and a crease appears between his eyebrows.\n“Peter? Why was he up at three?”\nNatasha’s looking for answers, not questions. “Who is he? And why did he spend the night?”\n“He interns for SI,” Tony says, with the practiced air of someone who’s been interviewing since childhood. “Can you sit down? You’re making me anxious, towering over me like that. Jesus.”\n“Why did he spend the night?” Natasha asks again, making no move to sit.\nTony finally looks up at her. “That’s classified.”\nTony Stark is hiding something important. Natasha knows all thirty-seven of his ticks, and right now he’s preforming approximately fourteen of them. Her lips quiver suspiciously.\n“His voice sounds familiar,” she says finally. “Do I know him from somewhere?”\n“You’ve probably seen him around the tower before,” Tony says. He goes back to his computer programming. “He talks a lot, I wouldn’t be surprised if you have his voice stored in your mental files.”\n“He didn’t seem too chatty last night,” Natasha says. “At least, on a scale from Bruce to Clint, he’s a lot closer to Bruce.”\n“He was probably just starstruck. Once you get to know him, you won’t be able to get him to shut up if you try. And of course he’s similar to Brucey Bear; Peter’s incredibly smart,” Tony says, and there’s something that sounds like pride in his voice.\nNatasha raises an eyebrow. “Are you saying Clint isn’t?”\n“Clint isn’t smart, he’s intelligent,” Tony says absently. “He’s a spy, I mean, of course he’s intelligent. And Clint’s self-preservation instincts are goals. Peter, unfortunately, is a little lacking in that department.”\nNatasha doesn’t know what to make of that statement.\n“And you sent him on his merry way at seven in the morning?” Natasha asks, checking her watch.\nTony shrugs. “He has school.”\nNatasha leaves before she does something stupid, like water board Tony Stark until he answers all her questions. Because Tony can make interesting life decisions, but he’s not a mentor. Who does he think he’s kidding?\n(Of course, it’s impossible to be an adult in Peter’s life without instinctively trying to nurture him. But Natasha doesn’t know that, yet.)\n \n___ \n \nThe next time she sees Peter, it’s two in the morning, and he’s once again studying in the kitchen.\nThis time its calc. Peter doesn’t like calc. She can tell by the way he’s chewing on his lip, his hands running through his hair every few seconds. \nNatasha isn’t scientifically minded. Not like Stark or Bruce. But her instincts tell her something is off about the kid, so she runs an experiment.\nIt’s a test, not attempted murder.\nAt a speed that only years of training could elicit, Natasha has her gun out and pointed at his head. He reacts quicker than she would’ve thought possible. He’s off his chair in an instant, calc textbook crashing to the floor. His wrist flicks, almost too quickly for her eyes to follow, and in a second the gun is out of her hands and stuck to the wall.\nThe kid is breathing heavily, staring at her with those wide, brown eyes. He’s dropped into a defensive crouch, arms extended and eyes wary. He’s stopped blinking.\nNatasha can’t stop the corner of her lip from torqueing upwards. She decides she likes the kid after all.\n“So,” she says smoothly, raising an eyebrow. “You’re Spiderman.”\nThe kid is practically hyperventilating, staring at her with those damn eyes. “You . . . you . . .”\n“Relax,” she says, heading over to her secret stash of cocoa. “If I wanted to kill you, you’d be dead. Do you want some hot chocolate?”\nShe thinks she can handle him, now. She can’t really deal with children—sometimes she feels like all her maternal instincts were removed with The Surgery. But she can deal with Spiderman, the hero who fought with her in Germany. \n“You weren’t supposed to find out,” Peter wails, scooping his textbook up from the ground. The tips of his ears are bright red. “Mr. Stark specifically said . . . ooh, he’s going to kill me.”\nNatasha doesn’t respond. It hurts, a little, just how much Stark doesn’t trust her. But she gets it. She silently hands him a mug and melts her face into an impassive mask. \nPeter’s shoulders set, as if he’s bracing himself for a fight. \n“I know what you’re going to say,” he says dully. “I’ve had this fight, with, like, one hundred different adults. Well, actually only two, but—,”\n“I very much doubt that you know what I’m going to say,” Natasha says, sipping her hot chocolate calmly.\n“You’re going to say I’m too young,” Peter says bitterly. “That Mr. Stark was wrong to let me—,”\n“I was younger than you, when I started out,” Natasha says, tilting her head to one side. “And I definitely wasn’t helping firemen get cats out of trees.”\nShe’s seen the YouTube videos. \nPeter’s eyes widened. “I’ll have you know that cat gave me a real run for my money.”\nNatasha almost laughs.\nPeter smiles at her again, and opens his calc textbook back up. Natasha leaves as soon as her cup is finished. They don’t speak again.\n \n___\n \nHe’s back in the kitchen almost a week later, this time at four thirty in the morning. His lip is split and both of his eyes are blackened, but he still manages to give her a genuine smile.\nHe’s reading a book. Nonfiction, she thinks. It’s about Georgia O’Keef. Maybe he’s just trying to keep her on her toes. She like to figure people out, and she can’t do that if he’s alternating between STEM textbooks and books about famous artists.\nShe makes him hot chocolate silently. She doesn’t leave after she’s finished this time, she just sits and watches him instead. She keeps expecting him to talk—lord knows he talks enough around Stark, but he keeps his mouth shut and his head down.\n“What happened to your face?” she finally asks, breaking the silence.\n“A couple of drug dealers thought they’d make some trouble at a local bar,” he says, and there’s tension in his voice. “I had it under control, Mr. Stark didn’t have to . . .”\nHe trails off, and his eyes flicker up to hers for a moment. She can see shame buried deep inside them.\nShe tilts her head to the side, wondering why he stopped talking.\n“You don’t talk as much as I thought you would,” she prompts. “At least, not around me.”\nPeter looks up, surprised. “I guess I just assumed you wouldn’t want me to ramble. Also, you’re, like, one of my heroes. And I have a really tough time filtering, so. Yeah. And—,”\n“There it is,” she says dryly. “Look who found his voice.”\nPeter flushes. “I didn’t think you liked idle chitchat. Which is fine, I mean, obviously you have more important things to do, lots of people don’t have time to just talk. I figured you were here for something.”\n“Do you want to talk?” Natasha asks him, making sure to keep her face a mask of apathy.\nPeter flushes. “You sound like a therapist,” he complains. \n“Is that who you want me to be?” she asks, because, for the life of her, she can’t figure out who he is. He’s socially awkward, but intelligent enough to know exactly how to react at any given time. He talks nonstop, but stays quiet if he doesn’t think people want to hear what he has to say. He’s a mystery, but seems to be a completely open book.\n“Dude, you don’t want to be a therapist,” Peter tells her. “They kind of got the shaft, you know? Because they have to go through a ton of school, but they can’t even prescribe medicine, not like psychiatrists, you know? My friend MJ says she might want to be a therapist, but she gives really, really terrible advice, so—,”\nNatasha interrupts, because she’s not entirely sure how to handle Peter. She’s so used to having people figured out instantly that all this confusion is sitting in her gut like a lead ball.\n“If you don’t want me to listen, what do you want me to be?”\nPeter closes the biography and meets her eyes. He looks as confused as she feels.\n“I don’t understand.”\nShe hears the words, but doesn’t quite comprehend them. What isn’t there to understand?\nStark wanted a yessir, a badass woman who could help Pepper run his company while giving him something pretty to look at. Maybe that’s not fair, because later he wanted something more intimate, a confident of sorts. Bruce wanted someone who loved him, who’d still be there even when he was the other guy. Especially when he was the other guy.\nFury wanted a merciless superspy. Clint wanted a partner. \nSteve wanted a friend.\n\nWell, there’s a chance you might be in the wrong business, Rogers.\n\n “No, I think I do understand,” Peter says quietly. He’s looking at her with something akin to pity in his eyes. “I want you to be yourself.\"\nAnd Natasha leaves, because she’s done with Peter Parker and her inability to figure him out.\nIt takes her about two weeks to figure out his schedule.\nFrom what she can gather, Peter works with Tony in the lab every Tuesday and Friday. He doesn’t usually sleep over on Tuesdays, but he’ll usually stay Friday nights. Every few weeks, he spends the weekend, leaving very early Monday morning. The only other nights he’s in the tower, he’s splattered with bruises and cuts, and the occasional broken bone. \nHis sleep schedule is more difficult to figure out. There are nights when they sit together from midnight to the morning, and also nights when she knows he’s there but doesn’t bother to show up at all. Natasha has trained herself to only need a few hours of rest here and there. She sometimes wonders what the kid’s excuse is. He always looks tired, but he never seems to sleep.\nIt must be a spider thing.\nThey develop something like a system, although they never really discuss it. When Natasha wakes up, however early, she’ll meet him in the kitchen and make them hot chocolate. Sometimes they talk. Occasionally, she helps Peter study. Usually, she reads quietly while he does homework or studies for Academic Decathlon. \nPeter is always there when she wakes up, though. As long as he’s at the compound, he’ll be there when she enters the kitchen at an ungodly hour of the morning.\nUntil one day, he isn’t.\nShe knows he’s staying the night—it’s a Friday night, after all. Natasha has been out all day, visiting Steve and Sam’s apartment in Brooklyn. There’d been some talk, earlier on, about everyone moving back into the compound. Natasha suspects it won’t be long—almost everyone is back in the tower at this point, save for the Captain and his number one. And, of course, Peter. As far as she knows, she’s the only one who ever sees him. He’s gone before the others wake up.\nMaybe she’s too early, she thinks, checking her watch. Peter’s always the first one out—Natasha kind of assumed that he didn’t sleep at all. She’d Googled it, purely out of curiosity, and figured out that spiders don’t typically sleep. She’d figured it was some side effect of his bite.\nShe finds she misses the company, sitting alone in the kitchen with her hot chocolate. Natasha doesn’t have friends, necessarily—putting a word to shared feelings of affection is practically daring the universe to tear people apart. But she likes Peter and his strange mannerisms. She likes talking to him, or rather listening to him talk to her. \nShe pulls out a book and begins to wait.\nIt’s about an hour before Peter stumbles into the room. His face is red and blotchy, his eyes are bloodshot. His hands are shaking.\nNatasha gets up in one quick motion and begins to make him hot chocolate. She lies her hand against the back of the kettle, waiting for the water to heat up. She bites her tongue, wanting to talk to him but not sure how.\nIf the roles were reversed, if she’d stumbled in looking like she’d seen a ghost, Peter would know exactly what to do. He’d start rambling on, digressing into stories about his aunt and his best friends. Perhaps he’d even tell her a story about his uncle. Peter doesn’t talk about him much, but Natasha likes it when he does. His face lights up and his eyes sparkle, and he usually is laughing by the end of the story.\nNatasha doesn’t have any stories that make her laugh like that.\nShe sets the mug of hot chocolate in front of him. “Drink,” she says.\nHe gives her a grateful smile but his eyes are dull in a way that she didn’t think was possible.\n“The first time Clint ever called me Tasha, I Tasered him,” Natasha says suddenly.\nPeter looks up at her, completely confused. “What?” he asks.\nNatasha bites her lip and turns away. She pours herself more hot chocolate, and pumps creamer into it.\n“You always tell me stories,” she says, regretting the words. “I . . . never mind. You seem upset.”\nPeter looks at her, and a grin slowly spreads across his face. “How’d Mr. Barton feel about getting Tased?”\nTo tell the truth, he’d pissed himself and spent the next six hours slurring his speech, but Natasha decides not to mention that part.\n“He was fine,” she says smoothly. \n“Do you not like being called Tasha?” Peter asks curiously.\nHer fingers still over the kettle. “I don’t care very much about what people call me, to be honest. Clint just surprised me, that’s all.”\n“But you’re name isn’t really Natasha, right?” Peter says. \nHe’s not asking in the way people usually ask. There’s no suspicious or condescending undertone to his voice. He’s just curious in his childlike, innocent way.\nAnd he doesn’t look as upset as when he stumbled into the room, so. Her plan must be working to some extent.\n“I’ve gone by a lot of names,” she says finally. “They all start to blur together, to be honest. Like I said, I don’t really care what people call me.”\n“Which one was your favorite?”\nHonesty is hard for her, but it’s never been a problem when she talks to Peter. She doesn’t understand it.\n“I don’t mind Natasha, if that’s what you’re asking.”\n“I don’t really know what to call you,” Peter admits, staring at the floor. “I’d call you Ms. Romanov, but I know that some people think it’s Romanovia, and I don’t want to offend you or anything.”\nNatasha’s mouth twitches. It hasn’t slipped her notice that he only calls her Ma’am, or the occasional “black widow” when he’s talking about her to someone else.\n“Nat,” she says finally, raising her mug to her lips. “Call me Nat.”\n___\n \nThe next day, she corners Tony.\nHe won’t let her into his lab—Friday claims he’s working on something important and cannot be interrupted. After waiting for him to take a break for almost three hours, Natasha ends up having to pull the fire alarm to get some face time with him.\nTony come out of his lab soaking wet from the sprinklers. Spluttering and cursing, he grabs the towel she silently hands him and throws her the middle finger.\n“What the fuck, Romanov,” he snarls. “There was no fire. You just drenched my tech for no goddamn reason.”\n“Language,” she says, raising an eyebrow. “And it wasn’t for no reason. I think it’s time we had a chat about your intern. Or, should I say, Spiderman.”\nTony’s eyes go wide. \nNatasha gives a small smile. “Why don’t we go sit down?” she asks. “I’ll make us some hot chocolate?”\n“No,” Tony says. “Absolutely not. Is ‘hot chocolate’ spy talk for cyanide or something? How long have you known? How pissed are you? Who else knows? If you’ve told anyone, I swear to god . . .”\nShe’s surprised by how much the accusation hurts her. It’s not Tony’s fault. He has no way of knowing the amount of time she’s spent making sure that Peter Parker could never be connected to Spiderman. \nBecause, see, Spiderman hasn’t exactly kept a low profile. There’s a series of viral videos on the internet that all but confirm he’s just a kid (the A-team challenge, she thinks they’re called, but she’s not sure. Sam told her about them at one point, but she’s forgotten.) So she’s spent hours bribing people in California and Delaware to swear they’ve seen him, so that the incident in DC doesn’t stand out. She’s leaked false clues about his identity, deleted videos, and randomized data. She has dedicated at least a tenth of her life to guaranteeing Spiderman’s secret identity will never see the light of day.\nTony doesn’t know this, of course. But it hurts, she thinks, more than it should.\n“Yes. I leaked his identity to Ross,” she says coolly.\nTony’s eyes go wide, and in a second the iron man suit is half assembled around him.\n“You—,”\n“Relax, I’m joking,” she says, not out of pity, but because she’s genuinely afraid he’s about to have a heart attack. “I wouldn’t do that.”\nTony lets out an exhale that sounds disturbingly similar to a wheeze. The iron man suit crumbles around him.\n“Don’t do that,” he says, and there’s an edge to his voice that she hasn’t heard before. “Jesus, Tasha, don’t do that .”\n“Sorry,” she says, not sorry at all.\n“How long have you known?” Tony asks, sinking down into a seated position against the wall, looking like he’s readying himself for an argument.\n“A couple of weeks,” she tells him. She drops into a seated position next to him. Tony is the type of person who will reveal more when he is comfortable. “We hang out in the kitchen whenever he’s here. He’s a good kid.”\n“What do you mean, whenever he’s here?” demands Tony. “He’s always either in the medbay or in the labs—,”\n“At night,” Natasha clarifies. “He doesn’t sleep. Is it nightmares or insomnia?”\nTony looks at her, perplexed. “What do you mean, he doesn’t sleep?”\nNatasha raises her eyebrows. “You didn’t know?”\n“No. I mean, well,” Tony hesitates. “He never said . . . no. I had no idea.”\n“It could be a side effect of the spider bite,” Natasha says. “We should have Bruce take a look next time he’s here. Do you know when that will be?”\nTony glances at her, smirking. “Subtle.” \n“I can kill you,” she warns. “I’ll get away with it, too.”\nTony laughs, and then pauses for a moment. \n“Has he said anything to you about nightmares?” he asks, almost nervously. “I mean, of course he has nightmares, we’re heroes, occupational hazard and all that. I just . . . I don’t want him to have them.”\nNatasha thinks about the dullness in Peter’s eyes the previous night.\n“I know.”\n“Dear god, he’s turned you soft,” Tony says, a look of amused disgust crossing his face. “You’re going to be packing his lunchboxes and handing him tissues in no time.”\n “He’s a good kid,” Natasha repeats. “Not as much of a little asshole as those YouTube videos he created implied.”\n“The A-team videos?” Tony asks. “Yeah, that was a shitshow. Do you know how many people have accused me of becoming a soccer mom?”\nNatasha eyes him, slumped against the wall with the dismantled iron man suit lying in pieces around him. \n“Hmm,” is all she says.\n \n___\n \n“And obviously I had to use some sort of nylon/rubber polymer,” Peter tells her, a manic glint in his eyes that reminds her eerily of Tony. He’s pacing across the kitchen, hot chocolate mug lying forgotten on the table beside her. “I wanted it to be able to stretch, but not too much or I’d miscalculate and crash into the cement.”\n“Do you know what the chemical composition is for normal spider webs?” asks Natasha smoothly.\nPeter waves a hand. “Normal spiders don’t weigh one hundred and twenty pounds. Even if I could’ve increased the textile strength, chances are they couldn’t hold up when I’m swinging over Queens at fifty miles per hour.”\n“Makes sense,” says Natasha, eying Peter over the top of her hot chocolate mug.\nHe sits down on his chair with a huff, turning his wide brown eyes onto her. \n“I’m boring you. Sorry, Nat.”\n“Don’t be. It’s interesting.”\nHe reminds her of Bruce in a way that makes her heart ache a little. He has little bits and pieces of all of them, mashed up into a character that is completely his own. He has Steve’s purity, Tony’s intelligence, Bruce’s passion. \nIt makes her miss having the team all living under one roof.\nPeter must see her expression flicker, because he pauses, staring at her.\n“Are you okay?” he asks hesitantly.\n“Fine.”\n“You sure?” \n“Very.”\nPeter nods, and then turns around to make them both more hot chocolate. The clock on the stove lets her know that it’s almost five in the morning. \n“When do you leave for school?” she asks.\nHe glances at the clock, frowning. “It takes about forty five minutes to get to Queens. I should probably leave at seven.”\n“I can drive you,” she offers. “I was planning to head into the city anyway.”\nShe likes to visit Sam and Steve in Brooklyn every now and then.\nPeter’s eyes widen. “Are you sure?” he asks. “Happy would probably be . . . well . . . happy to not have to come out here to get me.”\n“It’s no trouble.”\n“Why are you going to Queens?”\n“Brooklyn, actually,” she says, and then pauses. Peter’s eyes are earnest; she’s fairly certain that she could tell him anything, and he’d never breathe it to another soul. “I’m trying to talk the rest of the rogue Avengers into moving back into the compound.”\nPeter’s back straightens, and his eyes go wide. “Do you think they’ll move back in? Oh my god, that would be incredible! How’s it going?”\n“Slowly,” she says, carefully taking a sip of the hot chocolate. “Very slowly. I’m working on it, but there’s a lot of bad blood right now.”\nPeter nods knowingly. “Because of Germany.”\n“No, because Tony and Steve are self-righteous assholes who refuse to communicate with each other,” Natasha says, careful to keep her voice light. Peter’s eyes widen.\n“Why are they even mad at each other?”\n“You’ll have to ask Tony about that,” Natasha says firmly. She’s pulled security footage from the warehouse where everything went down between them. She knows what happened, and she’s smart enough to make sure that the surveillance never sees the light of day. But it’s not her place to tell Peter. \n“Didn’t they used to be best friends?” he asks.\n“The media often exaggerates things,” Natasha says mildly. “You should know that by now.”\n“But they were close,” he presses.\nNatasha purses her lips and drinks more hot chocolate.\n“People can do bad things to each other, even if they don’t mean to.” she says finally. “Friendship is irrelevant.”\nPeter’s eyes darken. \n“When people do bad things, they always mean to,” he tells her. “Whether or not they’re aware of it, they make a conscious decision.”\n“Sounds like you have experience with that,” Natasha says mildly.\nPeter shivers slightly, and then his million-dollar smile is back.\n“I fight crime in Queens,” he says. “Stuff happens. I’ve seen it.”\n“You have to hope for the best, but expect the worst,” Natasha agrees. “It’s a good way to survive.”\n“Life isn’t just about survival, though,” Peter says, his eyebrows creasing. \nGreat. Now he sounds like Steve.\n“It is if you want to stay alive,” Natasha says.\n“What’s the point of being alive if you don’t live, though?” \nNatasha grinds her teeth, hating that she doesn’t understand what he’s asking.\nShe gets the feeling Peter understands what he’s saying perfectly, though. There’s not a pretentious bone in his body.\n“Are you ready?” Natasha asks.\nSteve glances around the empty apartment and nods. Natasha puts a hand on his back and he leans into it for a second, closing his eyes and letting his head drop onto her shoulder. \n“If you guys could stop cuddling for a second and help me load these boxes into Clint’s van, I’d really appreciate that,” says Sam, his voice strained. “Considering you’re the one with super strength, Cap.”\nThe Captain nods and takes the box from Sam, disappearing out the apartment door.\n“So we’re really doing this,” says Wanda distantly as Sam locks up the apartment for the last time. “We’re all moving back into the compound. As if nothing happened.”\n“No,” Clint says, pulling his keys out of his pocket as they walk towards the elevator. “You guys are moving back into the compound. I’m staying the hell away from your guys’ shit show. I’ve said it once, and I’ll say it again: you guys are making a really big mistake.”\n“Thanks, Clint,” says Steve, his knuckles white against the moving box.\n“Relax,” Natasha says. “You’re all overreacting. This isn’t a big deal. We’ve been moving towards it for weeks.”\n“Easy for you to say,” says Sam. “You played both sides of the equation. No one’s pissed at you because you’re on everyone’s team.”\n“Are you calling me a double agent?”\n“Yeah.”\n“Okay,” Natasha says amenably. “That’s fair.”\n“And you’re sure Tony’s okay with this,” says Steve, who’s obviously not listening to a word anyone is saying. Sam opens the door for him, and he brushes by. “You’re sure he doesn’t mind us moving back in?”\nNatasha tries not to think about the hour long screaming match she had with Tony less than six hours previously.\n“Tony knows it’s what’s best for the team.”\n“Has anyone ever told you you’re quite good at dodging questions?” asks Wanda, her tone uninterested.\n“Just get in the van,” Natasha tells everyone. \nIf she’s being honest, she’s not sure it’s the right decision. But she’s sure as hell going to make sure that if it goes sideways, the team comes out on top.\n \n___\n \nAs soon as they enter the communal floor, Natasha knows something is about to go wrong.\nShe can’t sense anything off, but Steve immediately drops into a crouch, and they’re all immediately on high alert. She can hear the TV playing in the living room, but the lights are out in the entry.\nSteve holds up a hand, gesturing for them all to stop.\n“C’mon, man,” Sam hisses. “It’s probably just Tony. We weren’t supposed to arrive until tomorrow morning; he’s not expecting us.”\nSteve’s face is impassive. “That’s not Tony in there.”\nThey slink over to the door as a group, the same way they trained. If Natasha wasn’t on such high alert, she would think it was funny, the way they can all snap back into team-mode.\nSteve’s hand closes around the doorknob.\n“We are the Avengers,” whispers Wanda. “Whoever is in there, we can take. Why are you going so slowly?”\n“I’m with Sam,” says Clint. “It’s a Friday night, Tony’s probably just watching a movie with Rhodes.”.\nFriday night.\nThe panic hits Natasha before she’s even put two and two together. “Wait, Steve, don’t—,”\nSteve throws the door open.\nNatasha realizes in hindsight how it must look to them. A teenage kid, no older than sixteen, sitting on the couch in front of the TV eating a bowl of cereal. It stops every single one of them dead in their tracks.\nPeter is frozen too, staring at them with his spoon halfway to his mouth. His eyes are wider then Natasha has ever seen them, which is saying something.\nEveryone stands in shocked silence for about ten seconds before Peter finally speaks.\n“Um, hi,” he says. “Wow. You guys are the Avengers.”\n\"What the fuck,” Sam says. “What the fuck.”\n“You weren’t supposed to get here until tomorrow morning,” says Peter, carefully putting his spoon back in his bowl. He’s breathing heavily. \n“What are you doing here?” asks Steve, his voice dangerously low. \nPeter’s eyes are so wide that Natasha is genuinely worried that his face might break. \n“I live here?”\n“You live here,” Clint repeats disbelievingly. \n“Well, not permanently,” Peter hastens to explain. “My aunt is working at a hospital in New Jersey this weekend, so I’m staying here.”\n“And what are you doing here, exactly?” demands Sam, his fingers wrapped a little too tightly around his gun for Natasha’s liking.\nPeter frowns. “I’m . . . eating cereal?”\nPeter glances at her with a mixture of panic and wonder, and Natasha is broken out of her stupor.\n“This is Peter,” she says, firmly putting herself between him and the rogues. “Peter, meet Sam, Steve, Clint, Wanda.”\n“We’ve met,” says Wanda, smiling slightly at Peter. “How’s MJ?”\n“Girl, don’t even,” says Peter. “She never shuts up about you, I swear to god. It legitimately hurts my feelings—,”\n“Peter,” calls Tony from the kitchen, and Natasha feels her gut wrench as the situation goes from bad to worse. “Why is the box of Sugar-O’s on the counter?”\n“I felt like cereal,” Peter calls back, not taking his eyes off the Rogues.\n“When you said you were going to get dinner, I thought you meant, like, pizza or some shit,” Tony says, entering the living room, his eyes fixed on Peter. “You do realize you’re essentially eating pure\ncane sugar, right?”\n“I put some skittles in there, too,” Peter says. “Balanced diet, and all that.”\n“I don’t even know how to respond to that,” Tony fumes. “Congratulations, you have officially rendered me speechless. I thought you were supposed to be a child prodigy, how could you possibly think that—”\n“Tony,” Natasha says, genuinely worried about the rogues’ brains short circuiting.\nTony slowly spins on his heel, coming face to face with the Rogue Avengers for the first time in months.\nThe room goes deadly silent.\n“You’re early,” Tony says finally. “You weren’t supposed to get here until tomorrow.”\n“That’s what I said,” says Peter through a mouthful of skittles and cereal. “They didn’t seem to care.”\n“Peter,” says Tony, his voice deadly and low. “I think I left my phone in the lab. Can you please go get it for me?”\nPeter frowns. “I’m eating cereal.”\nTony grits his teeth, his eyes fixed firmly on the Rogues. “So put it down and finish it later.”\n“It’ll get soggy.”\n“Peter, please.”\nThere’s a sharp edge to his voice that Natasha rarely hears. Peter carefully nods and makes a beeline for the door without further protest.\nHe pauses in the doorway, glancing back at the Rogues.\n“It was really nice to meet you guys,” he says. His tone shakes slightly, but his eyes contact is firm. “I’ve heard a lot about you.”\n“That’s funny,” says Clint, tilting his head to one side. “Because we haven’t heard anything about you.”\n“And it’s going to stay that way,” says Tony quietly. “Peter, phone.”\nPeter turns on his heel and disappears.\nA heavy silence falls through the room again. \n“This was one of your better ideas, Tasha,” says Tony, the same bitter edge to his voice. “No, seriously, locking all of us in a building together? Fantastic. What could possibly go wrong?”\n“We don’t want to fight you anymore, Tony,” says Steve quietly. “We’re past that.”\nTony’s jaw clenches. “And the Winter Soldier?”\n“He’s gone,” says Natasha firmly. “He’s off the grid. Somewhere safe. He’ll get in touch with Steve when he’s ready. He won’t be stopping by for family movie night, if that’s what you’re asking.”\nTony nods jerkily. \n“I have to go,” he says. “I’m sure you guys remember the layout of the place?”\nTony doesn’t wait for an answer. He follows Peter down to the lab, grabbing the discarded bowl of cereal on his way out.\n \n___\n \nNatasha finds Peter in the kitchen later that night, sometime between two and three. He’s staring transfixed at an open dell processer in front of him. She silently makes the both hot chocolate and sets the steaming mug in front of him. \n“Thanks,” he says, smiling at her with bloodshot eyes.\nNatasha frowns. “How long have you been awake?”\n“I haven’t gone to sleep yet,” he admits. “We were in the lab until midnight, and I have a ten page research paper on the molecular biology of cellular reparation due Monday. I just started it.”\n“That’s poor planning.”\n“No, that’s high school,” Peter says, grinning. “Midtown, to be exact. They take a bunch of kids with an A plus average, make the new average a C, and have them battle for 4.0s in a way that makes the Hunger Games look like a pep rally.”\nNatasha raises her eyebrows.\n“The essay is extra credit,” clarifies Peter. “I flunked a test on naming acids.”\n“That seems like the kind of thing you’d be really good at,” Natasha says.\n“I didn’t study,” Peter explains. “I meant to, I just forgot. That’s the life of a part time vigilante for you.”\n“You should prioritize sleep over school, and school over Spiderman,” Natasha tells him.\n“You sound like May,” he complains.\n“There are worse people to sound like.”\n“True,” Peter says, smiling slightly. “May is the best. I honestly don’t know what I’d do without her.”\n“You guys are close?” asks Natasha, more as a prompt than a question.\n“Yeah, we’re tight,” Peter says. “I think it throws a lot of people, because we’re not even related biologically, you know? Ben was my dad’s best friend. There were people who thought that, after Ben died, she was going to release custody to the state. But she’d never; she’s not like that. She’s a really good person.”\nNatasha raises her eyebrows at the faux-casual tone.\n“Is that what you thought she’d do?”\n“I wouldn’t have blamed her,” says Peter. He smiles, trying to pass it off as a joke, but the look in his eyes is too intense. “I’ve put her through a lot over the years, you know? She and Ben were never even planning on having kids.”\n“The right choice is usually unplanned.”\n“Like what?” Peter asks eagerly, leaning forward. \nNatasha pauses, looking into Peter’s wide eyes. She realizes with a pang that she can’t leave him hanging now, not into the midst of whatever existential crisis he’s having. Natasha chews her lip, sorting through all the stories she can tell him. Most of her life experiences are too fucked up to put on the shoulders of a teenager, super strength be damned.\n“Okay,” she says finally. “Here’s an example. I’m not sure if you know this or not, but a couple of years ago we dumped all of Shield—and Hydra’s—Intel onto the web.”\nPeter nods emphatically. “Oh, yeah. I remember that. We studied a lot of it in government last year. It was super interesting, even if it was hard to understand.”\n“I was never intending to have all my covers blown,” says Natasha distantly, and suddenly she’s back in that building, dumping all the files online while Alexander Pierce goads her. “I’d spent decades making sure that information never saw the light of day, and then suddenly, out of the blue, I was releasing it for the whole world to see.”\nPeter’s eyes are burning with curiosity. “Why’d you do it, then?”\nNatasha stares into the distance. “It’s complicated.”\nPeter leans foward. “In my experience that either means you don’t know, or you don’t want to tell me.”\nNatasha laughs softly. “No. It really is complicated. I think in the end, I leaked those files because it was the right thing to do, and it was what Steve wanted. Leaking my life’s work was just a means to an end. Lives were at stake.”\n“But you don’t regret it,” says Peter eagerly. “It was unplanned, but it was for the best?”\n“It was the right thing to do,” Natasha says. “And I’m thankful I made the choice, even if I’m now officially too famous to do anymore undercover work.”\n“You miss being undercover?”\nNatasha meets his eyes. They stare back at her, wide and earnest.\n“I don’t necessarily miss the undercover ops. But I miss being sure of my identity.”\n \n___\n \nWhen Natasha enters the kitchen in the morning, Steve, Sam, and Clint are staring transfixed at Peter while he pours batter into a waffle iron.\n“My research paper on the molecular biology of cellular reparation is due Monday,” Peter is telling them animatedly. “I wanted to do starfish, you know, because they’re the obvious choice.”\n“Right,” says Sam, staring at him in confusion. “So obvious, don’t you think, Steve.”\nSteve doesn’t look like he knows how to respond.\n“I guess lizards would be a good choice, too, because they can regrow their tails,” Peter explains. “But I figure every other kid who’s writing the essay is going to pick one of those two options, so I’m thinking about writing it about what kind of tech it would take for humans to be able to do it. I mean think about it, if we had that kind of tech we could revolutionize modern medicine—,”\nClint leans over to her, his eyes wide.\n“I thought I was the only Avenger with kids,” he whispers.\n“I think Scott has a daughter,” Natasha says, pouring herself coffee. “Katy, right? No, Cassie.”\nClint gives her a dirty look. “You could’ve told me. They’re so similar, Tasha. I mean, Jesus.”\n\"Wait,\" says Natasha, stopping in her tracks. \"You actually think that-,\"\n“Hey, Nat,” says Peter, looking up from the waffle iron for the first time. “Do you want a waffle? I think Mr. Stark has some whipped cream, and I have skittles and gummy bears to add flavor and texture.”\nSam and Steve exchange a confused look.\n“I don’t know if I like waffles,” Natasha says. “I’ve never had one.”\n“Pro tip,” say Clint. “This kid is a psychopath. Do not, under any circumstances, put skittles or gummy bears anywhere near that batter.\nPeter holds out a plate to her.\n“You’ll never know unless you try,” he tells her.\nNatasha hesitates, then takes the plate from him.\n(They’re not cooked through, and they burn the hell out of her tongue. It’s still the best thing she’s ever tasted.)\nSaturday night, Natasha sleeps longer than usual. It’s probably the stress of the move, she thinks, but it’s distressing nonetheless. She normally can only get an hour at a time—two, if nothing happens to wake her up—but she sleeps for almost four.\nWhen she finally stumbles out into the kitchen at almost three in the morning, Peter is asleep too. He’s sprawled over his math textbook, a pencil still clutched in his hand. His mouth is open slightly, and his hair is messier than she’s ever seen it. She reaches out for a moment, wanting to ruffle it up, but she decides against it at the last moment and grabs his empty mug to disguise the movement.\n“Smooth,” says Clint from behind her.\nNatasha whirls around, her fingers resting on the gun in her waist band. Clint raises his eyebrows at her before sweeping past her to pour himself a cup of coffee.\n“You should know better than to sneak up on me,” Natasha says, but she’s almost smiling. She’s missed him.\n“You’re losing your touch,” is all Clint says, but he’s smiling too.\nShe turns her gaze back to Peter and her hands unclench. He’s undisturbed by the exchange happening between them. It’s almost funny; she would’ve pegged him for a light sleeper.\n“He’s cute,” says Clint. “Too smart for his own good, if you ask me.”\n“It’s a good thing no one’s asking you, then.”\nClint looks at her in shock. Even Natasha is a little surprised by the edge that creeps into her voice. She pauses for a minute, pouring herself a cup of coffee before sliding into the seat across from Peter.\n“It sometimes scares me a little,” she admits quietly, pressing her palms into her mug. “How smart he is, I mean.”\nClint smirks, glancing between her and Peter. “Come on, Tasha. We both know that’s not what’s really scaring you.”\nHe slides into the seat beside her, poking her shoulder gently.\n“You’re a mom,” he says gleefully.\nNatasha shoves him off the chair, grabbing him before he hits the floor so the thud doesn’t wake Peter.\n \n___\n \nPeter is still asleep an hour later, long after Clint has exited to go for a run. Natasha stays with him, drinking her hot chocolate and reading one of the books he’s left lying around. It’s a fiction work, and she suspects that it belongs to his friend MJ, judging by the notes scrawled in the margins.\nPeter jerks awake suddenly.\nHe goes from a motionless to high alert in about half a second. He practically jumps onto the ceiling, breathing heavily. It’s so unexpected that Natasha instinctively pulls a gun out of her pants, every sense in her body triggered instantly.\nPeter’s hand slips off the ceiling, and he comes crashing down in a heap onto the table. It makes an annoyed creaking noise, but it doesn’t break. Peter slides onto the floor in a heap, and in a second Natasha is kneeling next to him.\nHe shoves her hands away. “I’m fine. It’s okay.”\nIt’s not fine. His pupils are dilated and he’s breathing heavily. Natasha takes a step back, out of his personal space, and begins to make him hot chocolate as fast as she possibly can.\nShe’s not the type of person who can engage in an emotional heart-to-heart about nightmares, but she can make a half-decent cup of cocoa. The thought makes her set down the mug a little harder than she intended to, and it cracks along the bottom.\nIt’s not a problem. Tony has dozens of mugs. One breaks, and it can easily be replaced.\nThey’ve both calmed down by the time Natasha turns around to hand the mug to Peter. He’s sitting at the table again, but his hands are shaking when he reaches out to take the mug from her.\n“Thank you, Nat,” he says quietly.\nNatasha gives him a tight smile.\nThey drink the hot chocolate in silence for a few minutes, neither knowing exactly what to say. Peter’s hands are loosely draped around his mug, purposefully relaxed to avoid accidently crushing it. Natasha’s knuckles are white, they’re gripping it so tight.\n“Sorry,” Peter says finally, not looking at her. “I didn’t mean to freak you out.”\n“You didn’t.”\n“We don’t have to talk,” Peter says hurriedly, not meeting her eyes. “Not if you don’t want to.”\nNatasha doesn’t respond for a few minutes. When she finally does, her voice is light.\n“I think that Bruce should take a look at you the next time he’s here.”\nIt’s almost comical, the way Peter’s jaw immediately drops at the name. “Bruce? You mean Bruce Banner? Dr. Bruce Banner? Why?”\nNatasha raises an eyebrow, but she can’t stop a small smile from flicking across her face.\n“I can’t imagine you get much sleep,” she says finally. “Bruce should run some tests, and see if it’s something to do with the spider bite. We can figure something out from there.”\n“No,” Peter says instantly. His eyes go right back down to the table. “I don’t need to run any tests. It’s not because of the spider bite. I’ve never needed much sleep. It’s always been this way, don’t worry about it.”\nNatasha forces her face into an expressionless mask. Of course she’s going to worry, what kind of heartless bastard does he perceive her as? \n“If you say so,” is all she says.\n \n___\n \nEveryone eats breakfast together the next day.\nIt’s completely unplanned. It just kind of happens; Peter is making pancakes in the kitchen, and one by one people trickle in and accept the heaping plates he offers.\nIt’s funny, watching Steve and Sam poke at the gummy bears in the pancakes with bemused expressions on their faces. Clint, who is used to his kids’ experimenting in the kitchen, declares them the best pancakes he’s ever had, but it doesn’t slip Natasha’s notice that he refuses seconds. Wanda insists on making eggs, and suddenly it’s an actual meal that they’re all eating in the same room.\nTony stumbles in at half past nine. He looks around the kitchen with his eyebrows raised; from Steve and Sam playing cards to Wanda frying eggs to Peter sitting cross legged on the counter. \n“Tell me this is a dream,” he says. “This is so fucking domestic, I don’t think I can handle it.”\n“Hey, Mr. Stark,” says Peter, smiling cheerfully at him. “I made pancakes. Do you want some?”\nTony eyes the melted gummy bears sticking out of Steve’s half-eaten pancakes.\n“No,” he says. “Definitely not.”\n“You should have breakfast,” Peter says. “It’s the best meal of the day!”\n“Coffee,” Tony says, running a hand through his hair. He blinks sleepily at Natasha, who offers him a small smile. “Coffee is breakfast.”\n“I made you one of those disgusting fluffy coffees you like,” Peter says, pointing. “It’s in the stasis chamber.”\nTony doesn’t look like he knows how to respond. He looks at Natasha, completely confused, and she just shrugs.\nSam pulls it out and hands it to him silently.\n“Wow,” says Tony. “Wow. Thanks, kid. You’re officially my favorite person in the world.”\n“Would you mind telling that to Rhodey? Because—,”\n“Oh my god,” Clint whispers to Natasha. “I don’t think I can handle this.”\n“Don’t make me shove you again,” Natasha warns him.\nTony sits down on the counter beside Peter, throwing on a pair of sunglasses and chugging half the coffee in one sip.\n“I wish you wouldn’t wear those pants,” says Tony. “It makes me feel like an asshole.”\nPeter glances down at the Hello Kitty sweatpants. “They’re so fluffy, though!” he says.\n“Um, storytime?” says Sam. “What’s the deal with the pants, Pete?”\n“It’s not important,” says Tony smoothly. “So. What have you guys been up to?”\nThe words are carefully cool. There’s no bitterness behind them, but there’s still that edge to his voice that Natasha is beginning to think will always be there.\n“We’ve been lying low, mostly,” says Steve.\nThe kitchen lapses into an awkward silence.\n“So,” says Clint. “How’s school going, Peter?”\n“Fine,” says Peter, sprinkling more gummy bears over his pancakes. “It’s pretty boring. You know.”\n“Oh, come on,” says Sam, grinning. “You’re in high school, right? You must have some interesting drama for us. Have you got a girlfriend, or something?”\n“Sam!” says Steve.\n“I don’t want to hear about this,” says Tony. “It’s too early in the morning, the coffee hasn’t hit my bloodstream yet—,”\nWanda begins to open her mouth, and Peter tries his best to glare at her.\n“I did,” says Peter before she can say anything, his hand back in the gummy bear bag. “But I got in a really bad fight with her dad; he wasn’t exactly my biggest fan. He subtly tried to kill me like four different times. Then he turned out to be, like, a legit criminal who went to prison, and she moved to Oregon.”\nThe room goes quiet again.\n“Dating has really changed since I was young,” says Steve thoughtfully.\n“Only Tony Stark’s kid,” Sam mutters. “I just need to, like, stop asking questions. I do not want to know.”\n“I feel like that’s going to be you as a dad, when your daughters get that old,” Natasha tells Clint.\n“Wow,” says Clint. “Thanks.”\nClint glances over at Tony and raises an eyebrow.\n“And you were totally okay with all that going down? Like, you didn’t try to step in or anything?”\n“If it were my kid, I wouldn’t have let him anywhere near a girl’s family without a complete background check to everyone in the apartment complex,” agrees Sam.\nTony’s eyes shift over to Natasha’s, and she can see the panic in his eyes.\n\nDo they know about Spiderman?\n\nShe shakes her head, almost unnoticeably, and relief flashes across his face. Almost instantly, his million-dollar smile is back.\n“Like I could’ve intervened if I’d tried,” Tony says. “You know how kids are. They do whatever they want.”\nRight after breakfast, Peter and Tony head to the lab. Almost immediately, Natasha is cornered by Clint. \nHe waits a few seconds after she exits the kitchen, then follows her back to her room, just like he used to do while they were undercover. She can sense him behind her, following at a reasonable distance, and she leaves her door open a crack and settles herself onto her desk chair.\nHe sits on her bed, pulling out an arrow and beginning to fix the broken tip. She watches him carefully, waiting for him to speak.\n“So,” he says finally. “Stark has a kid. Who would’ve thought?”\nNatasha’s tempted to tell him the truth, because she really hates lying to him. Natasha doesn’t lie to Clint, at least, not when she can avoid it. He’s never lied to her, not in all the years she’s known him. It’s why they’re such good partners.\nBut this secret isn’t hers. It’s Peter’s.\n“Stark is definitely more paternal than I expected,” Natasha agrees. It’s not a lie. \n“What happened to his mom?” asks Clint, turning the arrow over in his hands and inspecting it for damage.\n“Dead.”\n“But he doesn’t live with Tony full time?”\n“His aunt has custody.”\n“She’s his mom’s sister, I assume.” Clint says, pulling another arrow out of his quiver.\n “Why don’t you ask him?”\n “Come on, Tasha,” says Clint pleadingly. “Give me something. I know you, you’ve probably done a full background check on anyone who’s ever come into contact with that kid. Surely you’ve dug up some dirt for me.”\n“His neighbor’s florist didn’t pass my polygraph, if that’s what you’re asking.”\nClint rolls his eyes at her, pulling out another arrow and beginning to make adjustments to the feathers. \n“Why was he in the kitchen with you at, like, three in the morning?”\nNatasha shrugs evasively. “He doesn’t sleep much. Neither do I.”\nClint gives her a look of disgust. “He had hot chocolate in front of him. I’m not an idiot, I know you must’ve showed him where your secret stash is. How’d he get it out of you, blackmail or bribery? I’ve known you for most of my life, and you’ve never—”\n“Listen,” says Natasha. “Drop it, Clint. You don’t want to push Tony when it comes to Peter. You don’t want to push me, either, for that matter. I don’t want to have to lie to you.”\nClint looks at her carefully. He’s smarter than people give him credit for. When they worked for SHIELD, people were constantly underestimating him, partly because of his reputation as her sidekick, partly because his personality is that of an immature child. People sometimes forget how dangerous he is.\nNatasha will never forget. It’s one of the reasons she likes him so much.\n \n___\n \nFriday lets Natasha into the lab without a problem. The pop music that’s blasting through the speakers dulls to a quiet backdrop as she enters, and she’s immensely grateful.\nShe raises her eyebrows at Tony, who points to Peter.\n“His music,” he says quickly. “Not mine.”\n“Hey, Beyoncé is queen,” says Peter, his hands completely submerged in a clear liquid that’s frothing dangerously.\n“Do I even want to know?” asks Natasha, eyeing the substance suspiciously.\n“He got stuck in his own web fluid,” says Tony, pausing from his computer coding to send her a smirk. “Dumbass.”\nPeter pouts. “He won’t help me get out.”\nNatasha sends Tony a disapproving look, her eyebrows raised.\n“The first rule of working in my lab is that if you do dumb shit, I’m not going to bail you out,” says Tony absently, returning to his laptop. He frowns slightly, deleting a significant chunk of code, and his eyes narrowing.\n“It will disintegrate in between two and ten hours; I don’t know much about the tweaked formula. Don’t worry about it,” says Peter, smiling at her. “What’s up, Nat?”\n“We need to talk about the team,” Natasha says, pulling out a stool and sitting down by Peter.\n“Do you need to talk to Mr. Stark alone?” Peter asks, his eyes widening. “I can leave. Actually, no I can’t, because I’m stuck to this table, but—,”\n“No, it’s about you,” says Natasha. “I want to know if guys are planning on telling the team about Spiderman.”\n“No,” says Tony firmly, his fingers flying over his keyboard. “Absolutely not.”\nNatasha tilts her head to one side, looking at Peter instead. “You can trust them, Peter. We’re all on the same team.”\nPeter frowns slightly. “Six months ago, you guys were all trying to kill each other.”\nNatasha supposes that’s a pretty fair point.\nTony smirks slightly as he balances the laptop on his lap, feel propped up on a table. “Is there a reason why you’re so eager to expose the kid?” \nNatasha considers him for a second. He looks better rested then she’s seen him in months. His hair is smoothed up, his goatee is freshly shaved, and he’s not wearing those stupid tinted glasses. He looks so different from the man she met years ago, the narcissistic hero dying from blood poisoning. \nThe memories make Natasha pause.\n“Secrets have a way of coming out eventually,” she says finally. She looks at Peter, her hands curling around the edge of the table. “Whether or not the team acts like it, they’re some of the most intelligent people I’ve ever met. I just want to make sure you’re prepared for them figuring it out sooner rather than later.”\nPeter’s eyes widen. “Do you think they suspect that I’m Spiderman?”\nTony’s head snaps to attention, his eyes narrowed.\nNatasha pauses. “They know you’re not just an intern.”\n“What does that mean?” demands Stark.\n“The current theory is that he’s yours,” Natasha says coolly, meeting Stark’s gaze. “Biologically, I mean.”\nThe laptop on Starks lap crashes to the floor. Peter lets out a string of incoherent babble that falls somewhere between expletives and laughter. Stark stares at her, his broken laptop in pieces at his feet.\n“You’re fucking with me,” is all he says, his eyes drifting over to Peter.\nPeter buries his face in his hands, ignoring the web fluid covering them.\n“And you didn’t correct them?” Tony demands, kicking the mangled corpse of his laptop under the table.\nNatasha raises an eyebrow. “Trust me,” she says. “You don’t want them poking around trying to figure out why an intern spends weekends at Avengers tower.”\n“I don’t spend every weekend here,” says Peter, his voice muffled by the web fluid. “Just when May’s out of town.”\nTony tosses his broken laptop back onto the table with a little more force than necessary.Natasha purses her lips.\n“What do you want me to tell them?” \n“I don’t know,” Tony says flatly, glancing at Peter. “I guess I’ve got a kid now.”\n“Congratulations,” Natasha deadpans.\n “I’m not calling you dad,” says Peter firmly, his forehead still stuck to his hands. “I draw the line there.”\nNatasha lets her face fall into an expressionless mask to keep herself from laughing. “You could just let me tell them the truth,” she offers. \nPeter and Tony exchange a look. Neither of them respond, but they don’t have to. Natasha knows exactly what they’re thinking.\n “They’ll figure it out eventually,” she can’t stop herself from warning them. She already has seventeen different plans for what to do if when that day comes, but they don’t have to know that.\n \n___\n \nWhen Natasha enters the kitchen at approximately one in the morning, Peter is flipping through a science textbook slightly manically.\nHis hands are shaking when he accepts the cup of hot chocolate from her, but his smile is soft. \n“Rough night?” she asks quietly.\n“I can’t figure out how to keep webs sticky enough to hold wounds together while preventing them from being toxically acidic,” he says dully. \n“It might be easier to work if you got some sleep,” Natasha says, faintly amused. “You don’t have to be self-destructive to be a superhero.”\nPeter rolls his eyes. “Funny,” he deadpanned. “On the job application, it said it was a requirement.”\n“It’s an occupational hazard, not necessarily a requirement,” Natasha corrects. “It’s a common mistake.”\n“I’d sleep if I could, but even if I try I won’t be able to,” Peter tells her. He takes her cup of hot chocolate, then heads over to the drawer to get her a refill. “I might as well do something useful.”\n“When is the last time you slept?” Natasha asks, genuinely curious.\n“English class, last Thursday,” Peter says, shrugging. “I probably should’ve gotten detention for it, but I think Mr. Harris felt bad. Ned took notes for me, so it was fine in the end.”\n“Peter.”\n“What?” he asks, and there’s an edge to his voice. “What do you want me to say, Nat?”\nHe sets down her hot chocolate in front of her extremely gently, the way he always does when he’s trying hard not to break things. Natasha looks away from him. She’s never been good at having conversations like this. Not unless she has a persona to hide behind, something that makes it real for the other person, but not for her. \nPeter said all those nights ago that he wanted her to be herself. She’s not entirely sure who she is without a persona. Natasha likes creating personas: she feels like a chef; a sprinkle of a sense of humor, a pinch of flintiness, three cups of emotional awareness. She likes being able to control who she is, so she can control how to react.\nBecause right now, staring at the kid in front of her? She has no idea what to do.\n“I want you to talk to Bruce,” she says finally, and she can see the disappointment in his eyes. “I don’t want insomnia to take over your life.”\nPeter’s hand curls tightly around the mug, and he looks at the ground. “It hasn’t—,”\nHe breaks off, and his eyes drift back up to meet hers. He glances around the kitchen, from the cups of hot chocolate sitting in front of them, to his hands clenched around his mug, to the clock on the wall that reads 1:34 AM.\n“Okay,” says Peter finally. “I’ll talk to Bruce.”\nNatasha blackmails Tony into tracking down Bruce the next morning. It’s not even really blackmail; all she has to do is mention Peter’s name and Tony is nodding in agreement. \n“I’ve been thinking about calling Bruce to take a look at him for a while now,” Tony admits. “I’ve done what I can for him; I’ve charted his DNA and done the best I can to figure out what’s changed inside of him, but biology isn’t really my area of expertise.”\n“And you know how to contact Bruce?” Natasha says, making an effort to keep her voice level.\n“Not really, no,” says Tony. “Just give me a couple of days.”\n \n___\n \nBy the time anything happens, it’s been almost two weeks. It’s Peter’s spring break, and he’s spending five days at the tower while his aunt attends a conference in DC.\nIt’s nice, having him in the tower. Without him, it’s tense and awkward. Steve and Tony avoid each other like the plague—idiots, Natasha thinks, but she isn’t ready to play referee. It’s a cesspool of unresolved feelings and avoided eye contact. It makes Natasha want to test out her new Bites on them until they stop acting like stubborn children.\nWhen Peter’s in the tower, the atmosphere changes somewhat. He was never really a part of the political rift between them all, so he acts as a sort of buffer. It’s not that he’s neutral; if it ever came down to it, everyone knows whose side he’s on. But even Team Cap is ridiculously fond of him.\nIt’s because he’s so nice, Natasha thinks. He goes out of his way to do things for people. He brings Wanda little trinkets he made in shop class. He gives Steve a stuffed pit bull that has a giant red, white, and blue hat (Tony can’t stop laughing, but Steve puts it on top of his dresser anyway). \nAnd with those wide brown eyes and that slack-jawed wonder? He makes them all feel like heroes. And that’s a feeling most of them haven’t had in a really long time.\nThey’re all in the kitchen watching Vision make spaghetti when the elevator doors ding. It’s funny, how the room instantly changes. Tony’s suit is on in half a second, Clint’s bow is in his fist, and everyone is on high alert.\n“Where did those come from?” Sam whispers, looking at her two pistols with wide eyes. Natasha glances down at her tank top and yoga pants and shrugs.\n“Stay here,” Tony hisses to Peter as the group begins to creep for the door.\nPeter’s eyes widen. “Oh you have got to be joking.”\n“Everyone should stay here,” Natasha says through gritted teeth. “I can go and see—,”\n“Hey guys,” says Bruce sheepishly from the doorway. “We would’ve called ahead, but neither of us have a phone.”\nThor waves awkwardly from beside him.\n“Brucey Bear!” says Tony, and suddenly everyone is rushing forward to greet the two people in the kitchen doorway. Natasha stands back, eyes narrowed, as she looks them over. They both are wearing jeans and hoodies, and Thor is clutching an umbrella but missing his hammer. They look happy enough to see everyone, but Natasha can see the fatigue in their eyes.\nPeter hangs back with her, his eyes wider than saucers. \n“Oh my god,” he hisses to her, his entire body practically vibrating. “That’s Dr. Bruce Banner and the god of thunder. Am I dead? I’m in heaven, aren’t I?”\n“Relax,” says Natasha, her lips twitching in spite of herself.\n“Oh, sorry Peter,” says Tony, glancing back at them. “Brucey, Point Break, this is Peter.”\nPeter stumbles forward, throwing his hand out. “Oh my god, it’s so cool to meet you guys. I’m, like, a huge fan. Of both of you.”\nThor clasps both of his hands around Peter’s. “The honor is mine.”\nBanner hesitantly shakes his hand next, glancing at Tony questioningly. “Are you the newest member of the Avengers?”\nPeter turns slightly red.\n“He’s Tony’s kid,” Clint says, his voice unrealistically casual.\nThe noise in the room quiets at once. Peter and Tony both freeze, but neither of them say anything to protest the claim. Natasha realizes suddenly it’s the first time the matter has ever been addressed by the general public.\nThor breaks the silence first, clasping Peter’s hand in his own for the second time. “It is an honor to meet you, Son of Tony. I am your Uncle Thor. Your father is a dear friend of mine.”\nPeter makes an odd squeak in the back of his throat, his eyes widening dramatically. Natasha turns away to cough into her hand.\n“I’m sorry,” says Bruce, closing his eyes and holding up a hand. “What?”\n“It’s a long story,” says Tony quickly, his smile wide but is teeth clenched. “I’ll fill you in later.”\n“You know,” says Steve. “I’ve never actually heard this story myself.”\n“Oh my god,” Peter whispers, looking like he hopes the floor will open up and swallow him. “Can we not?”\nNatasha decides to take pity on him. “Hey Vision, is the pasta supposed to be boiling over like that?”\nThe kitchen once again erupts into pandemonium.\n \n___\n \n“So, you don’t really have a kid,” Bruce clarifies.\nNatasha glances around the lab, from Peter, who’s eating a bowl of Vision’s spaghetti, to Tony, who’s attempting to unscrew part of the iron man helmet with a pair of scissors.\n“Afraid not,” says Tony mildly. “Sorry to disappoint you.”\n“And you’re an enhanced individual,” Bruce says, pointing at Peter. “But no one’s run any tests on you to figure out exactly what happened to give you your powers, or to make sure you’re not a danger to yourself and others.”\n“I got bitten by a spider,” says Peter helpfully, sprinkling gummy bears into his pasta. “That’s how I got my powers.”\n“But no one is exactly sure what you can do?”\n“I heal fast,” Peter tells him. “Like, really fast. If I get stabbed, it’s a cut by the next morning. And I can lift really heavy things, things I couldn’t lift before. And I have a spidey-sense that tells me when I’m in danger.”\nBruce scribbles frantically down on the notepad in front of him. “Do you know how that works, exactly?”\n“No idea,” says Peter. “Also, I can jump really high. And climb on walls. And the ceiling.”\nBruce looks completely thrown. “Walls and the ceiling. Huh.”\n“Yeah,” says Peter. “I looked at my fingers under a microscope, and there are these little hairs that I think help me grip.”\n“So why aren’t you constantly getting stuck to things that you touch?”\nPeter looks confused. “Because that would be inconvenient.”\n“Right,” Bruce says, intrigued. “Inconvenient.”\n“He also doesn’t sleep anymore,” Natasha says pointedly. \n“And he’s completely self-sacrificial,” Tony says. “Do you think you can give him survival instincts, or something?”\n“Okay, both of you, out,” says Bruce crossly. “I can’t run tests if you two are in here breathing down my neck.”\n“Um, no,” says Tony. “We’re not leaving.”\nNatasha nods in agreement, eyes flashing. Bruce has the decency to look ashamed.\n“Guys, I came here from space to consult for you,” he says. “Go for a run. Build something cool. But let me do my job, okay?”\nNatasha looks at Peter, who quickly swallows a mouthful of spaghetti to smile at her.\n“You guys can go,” he says. “I’ll be fine.”\n \n___\n \nWhile they wait, Thor attempts to teach them all some sort of Asguardian game with dice and a strange set of cards. He’s extremely vague about the rules, and Natasha isn’t entirely sure what the goal of the game is. Or who’s winning. She’s not even one hundred percent sure who’s playing. \nAt one point, Thor waves his umbrella around and it changes into his hammer. He holds it lovingly for a few minutes, and then sets it down carefully on a book on the coffee table.\nHe gives them a vague outline of what he and Bruce have been doing up in space. From what Natasha can understand, they met on a planet and fought in a gladiator show off, which Thor won by a very large margin.\n“That doesn’t sound right,” Tony says, glancing towards the staircase that led down to the labs.\n“It’s what happened,” Thor tells him firmly.\nThor tries to press them all for details about what’s been happening on Earth, but no one seems to want to talk about the civil war. Steve eventually tells him the bare minimum about the Accords, but no one says anything about the feud.\nNatasha suspects that Thor guesses some of what went down, but if so he’s too polite to say anything.\n“So,” says Sam finally. “What exactly are Bruce and the kid up to?”\n“Bonding,” Tony and Natasha say at the same time.\nThey don’t come up to the labs for an hour and a half. By the time they finally appear, Natasha actually understands about five percent of Thor’s game.\n“How’d it go?” asks Tony.\n“I’ll fill you guys in later,” says Bruce, settling down next to Natasha.\n“Hiding something?” asks Clint casually.\n“No, just tired of science,” says Bruce. His tone is casual, but he’s staring determinedly at the unique cards on the table. “Oh, you guys are playing Brauflutning.”\n\"I assume you will play, Dr. Banner,” says Thor, looking delighted. “And you as well, Son of Tony.”\nPeter freezes like a deer in headlights.\n“Um,” he says.\n“No, I think I’ve defiantly had enough,” Sam says, getting up and stretching. “We’ve literally been playing for hours, and I still have no idea what I’m doing.”\n“I’m out, too,” says Steve firmly. “Thanks for teaching us, though.”\n“Oh, come on,” says Tony. “I was just about to figure it out.”\nThor stands too. “In that case, I will retire for the night as well.”\n“Wait,” says Peter. “Mr. Thor, your hammer is on my chem textbook.”\nNatasha knows what is going to happen a second before it does. Peter reaches out over the coffee table and picks up the hammer like its weightless, holding it out to Thor with his genuine smile and wide eyes.\nThe room goes completely still.\n“Holy shit,” says Sam softly. \nNatasha shivers slightly, unable to tear her eyes away. \nThor reaches out to and takes his hammer, looking like he expects Peter to grow fangs and attack him. Peter takes a step back and nervously glances around the room.\n“Is everything okay?” he asks Tony. Tony doesn’t respond, his eyes fixed firmly on the hammer.\nPeter’s eyes swing over to Natasha. “Nat?” he asks uncertainly.\n“Jesus fucking Christ,” says Steve, determinedly not looking at Peter.\n“Language,” says Tony, and the spell is broken. Wanda lapses into hysterical giggles, and Natasha glances over at Bruce, who looks just as astounded as she feels.\n“Don’t worry, kid,” Natasha tells Peter, moving forward so she can put an arm around his shoulders. He looks up at her, relief in his eyes. “It’s just been a really long day for all of us.”\n“No kidding,” mutters Sam. “Just when I think I’ve got that kid all figured out. Jesus.”\n___\nLater, Natasha brings a cup of coffee to Bruce’s lab.\nIt’s late, but he’s still up, going over data that looks suspiciously like Peter’s DNA. He gives her a small smile and she sits with him, looking at the screens in front of him and pretends she understands what they’re saying.\n“Some kid, huh?” Bruce says.\nNatasha’s throat feels oddly tight. “Some kid,” she agrees.\n“You know, when I got Tony’s distress signal, this wasn’t exactly what I expected,” he says. “And that thing with Thor’s hammer? Jesus. I’ve never seen Thor look so put out.”\n“Seeing Peter lift it was definitely unexpected.”\n“Nothing could’ve prepared me,” Bruce says. He gestures towards the screen. “Tasha, this kid isn’t even human.”\n“Of course he is,” Natasha says firmly. \n“An insane amount of his DNA has been altered,” Bruce says, his eyes lighting up the way they always do when he talks about science. “If he’d been bitten earlier, I can’t even guess how he would’ve developed. Hell, if he’d somehow been infected in utero, he might have eight legs. There’s just no way of knowing.”\nNatasha nods.\n“Tasha,” Bruce says deliberately. “The amount of power this kid has . . .”\nNatasha waves the information away without processing it. “He can handle it,” she says firmly.\n“He’s a good person?” Bruce says anxiously.\n“The best.”\n“Jesus,” Bruce says, leaning back in his chair and rubbing his eyes.\nNatasha hesitates, unsure how to broach the subject she came down to discuss.\n“What about his insomnia?” she asks. “He doesn’t sleep for days at a time, Bruce, and he functions normally.”\n“I talked to him about it a little,” Bruce says. “As far as I can figure, the problems started before the bite. And you can’t really talk, Nat, you don’t sleep at all either.”\n“That’s different.”\n“Is it?”\nNatasha frowns at him. “So you’re saying you can’t help him.”\nBruce sighs. “I’m saying that whatever problems he has with sleep are psychosomatic.”\nNatasha’s voice is tight. “What does that mean, exactly?”\nBruce hesitates. “It means he’d probably be this way even if he hadn’t been bitten by some radioactive spider.”\n“May and Mr. Stark want to put me in therapy,” Peter tells her shyly a few weeks after his diagnosis. \nThey’re sitting at the kitchen table drinking their hot chocolate. Peter made the drinks, and he never heats up the water enough; he also screwed up the proportions so hers mostly tastes like water.\nNatasha doesn’t care. She talked him out of adding miscellaneous types of candy, so she’s counting it as a win.\n“Oh?” Natasha says. Her eyes find the clock on the stove. 4:14 AM.\n“Yeah,” Peter says. He bites his lower lip and stirs his hot chocolate slowly with a spoon. “It’s stupid.”\nNatasha raises an eyebrow. “Why do you think so?”\n“I don’t know,” Peter says, and there’s a hint of indignation in his voice. “There’s nothing wrong with me, alright?”\n“I never said there was,” Natasha says, but her eyes flick back to the clock.\nPeter’s hands clench around his hot chocolate. “That’s not fair,” he says. “You’re up, too. When you don't sleep for days everyone thinks it's badass, but when I do it it's this huge problem.”\nNatasha tilts her head to one side. Her eyes drift down to meet his, and she frowns slightly.\n“Peter, none of us want you to turn out like us,” Natasha says finally. “Please. Don’t try to turn me into a role model.”\n“That’s bullsh—,” Peter breaks off, catching sight of her raised eyebrows. “That’s ridiculous, Nat. You’re . . . you’re incredible.”\nHis eyes are so wide. Natasha realizes with a pang that she’ll do whatever it takes to make sure they stay that way.\n“You should go to therapy, Peter,” Natasha says. “You can’t exactly be prescribed melatonin; you’d metabolize it before it even started to kick in. And you can’t go through your life sleeping ten hours a week.”\n“Whose side are you on?” Peter demands. \nNatasha gives him a dry smile.\n“Therapy won’t help,” he says sullenly.\n“Maybe. But it might.”\n“No, it won’t,” Peter insists. He looks at her, his eyes narrowing. “Ben and May tried to make me talk to a few cheap counselors after . . . when I was nine. It was a waste of time and money. I don’t want to do that again.”\nNatasha takes a sip of hot chocolate and thinks for a minute. She knows that, of course; it’s all in his medical file. It wasn’t easy to get her hands on; it required a great deal of hacking and a few favors from an old friend at Kaiser. \nGetting it was part of the same routine background check. It’s nothing personal. She knows too much about everyone.\n“You’re older now,” Natasha says, wrapping her hands around her mug. “You never know, Peter.”\n“I’ll make you a deal,” Peter replies. “I’ll go to therapy if you do.”\nHe smiles at her, triumphant. He’s sure he’s backed her into a corner now, sure he’s got her on his side. Because she’s the Black fucking Widow, and there’s no way in hell she’d ever go to therapy.\n“Okay,” Natasha says, and the look on his face makes everything worth it. “Deal.”\n \n___\n \nNatasha goes to therapy once, doesn’t say a single word, and leaves after fifteen minutes. But that’s okay, because she technically kept her promise to Peter and he has no way of finding out.\nShe picks him up from school every other Tuesday and drives him to the private office in Manhattan. She knows that there’s no shortage of adults who’d be willing to take him, but it’s her way of making sure that he goes every time. After he finishes, she takes him back up to the compound to work in the labs with Tony.\n“How was it?” Natasha asks him after every session. He always tries to give her a dirty look, but he’s crap at being intimidating.\n \n___\n \nThe change doesn’t happen all at once.\nIt starts small. Natasha starts being the first one in the kitchen, with Peter not making an appearance until three or four. He still comes, every night, but he’s rubbing the sleep out of his eyes instead of stumbling around in a sleep-deprived fever.\nThen, after a few months, there’s a night when she doesn’t see him at all. She waits up until five-thirty before she crawls into bed and goes back to sleep. When she wakes up, someone’s left waffles with gummy bears and m&amp;ms on her bedside table.\n \n___\n \n“I don’t think I’ll ever be completely better,” Peter tells her quietly.\nIt’s 3:38 AM. She wasn’t expecting to see him when she went for her late night cup of hot chocolate, but he was there, chemistry textbook out in front of him, waiting for her to show up.\nNatasha makes them both hot chocolate and sits down across from him. His eyes are fixed firmly on the textbook in front of him, and he won’t look at her. \n“That’s okay,” Natasha tells him.\n“It’s not,” Peter says, and his voice is tight. “Nat, I’ve been seeing a goddamn therapist two times a month for three months. This isn’t supposed to still be happening. There are still nights when . . .”\nNatasha waits for him to finish his sentence, but he never does. He looks up at her with his huge brown eyes, full of desperation and fear. \n“I’m still so tired,” he says dully. “Like, all the time. I don’t think that’s ever going to go away.”\nNatasha has no idea what to tell him. Her throat feels tight too, and for the first time she’s the one who can’t look at him.\n \n___\n \nShe doesn’t see him often at night anymore. He’s gotten better at sleeping. There are still nights when she finds him slumped over the kitchen table in the early morning, but for the most part he stays in bed, even when he can’t sleep. That’s what he tells her, anyway.\nBut she still sees him. She picks him up from school sometimes, even though he’s stopped going to therapy. Natasha knows Tony and May are disappointed; they wanted him to keep going. \nThere’s a lot of things that they still have to deal with. Even when he gets to sleep, he still has nightmares. She knows because Tony gave her access to his vitals, monitored by the Starkwatch on his left wrist. He still hasn’t told the team that he’s Spiderman, but that’s okay. Natasha’s pretty sure the they know, even if they haven’t outright admitted it.\n“Hey,” says Clint one night, his tone extremely casual. “Pete, one of my friends has a fantastic recipe for cookies that seems exactly like something you’d make. They’ve got gummy bears and skittles and six cups of sugar. He even has a Youtube channel where he shows you how to bake them.”\nPeter doesn’t stop coughing for three minutes. His face is exactly the same shade of red as the Netfix logo on his tee-shirt.\n(The video disappears from Spiderman’s Youtube channel the next day. It doesn’t matter, bootlegged copies are just one Google search away. After all, once something gets put on the internet, it never comes down.)\n \n___\n \nSam says he was completely joking when he suggested a “family movie night” but somehow they all end up watching Star Wars in the compound’s home theater anyway.\nNatasha looks around the room. Wanda and Vision are determinedly six feet apart on the couch; their on-again off-again relationship is currently on hiatus. Sam is pointing out all the errors in the film to a perplexed Steve. Thor and Bruce are gone again, but they promised to swing by for a visit in a few weeks. Clint is visiting his family, but he’s bringing his kids by soon to meet everyone.\nPeter is slumped against Tony’s shoulder, fast asleep and silhouetted by the light of the screen. The room is too dark for anyone to see Natasha’s smirk.\n \n___\n \n“You never took the A-team challenge,” Peter pouts the next morning.\nHe’s making his signature waffles, and the kitchen reeks of burned Skittles. Everyone else has hastily made their way into the living room, but Natasha stays with him, watching carefully to make sure he doesn’t set anything on fire.\n“What’s the—,” Natasha breaks off. “Oh. Sorry.”\n“If you actually managed your own Instagram, you’d know that people are still begging you to take it,” Peter tells her.\n“Not really my thing,” Natasha tells him apologetically, her hand snaking out to steal some skittles from the bag. Peter swats her hand away.\n“You know, if you want good PR, you have to humanize yourself to the general public,” he tells her reproachfully. “Everyone who knows you loves you, but everyone who doesn’t is just terrified of you.”\n“Good.”\n“No!” Peter tells her. “Not good!”\n“Fine,” Natasha says, pulling out her phone. “Put on the mask.”\nPeter’s face lights up. “You’re doing the challenge?” \n“No,” says Natasha. “But I’ll take a picture with you. Final offer.”\n \n___\n \nThe picture is posted on her Instagram account twenty minutes later. It’s a selfie, with Natasha smiling dangerously at the camera. Peter stands behind her, his arms wrapped around her and his cheek pressed into hers.\nPeter insists she caption it Spiderfam.\n“It’s catchy,” he tells her.\n“It’s ridiculous,” she responds.\nIt also gets more likes than any other photo she’s ever posted. \nThis fucking kid."
}