{
    "id": "15319668",
    "url": "https://archiveofourown.org/works/15319668?view_full_work=true",
    "author": [
        "Isnt_it_pretty_to_think_so"
    ],
    "title": "Miscommunications",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [],
    "fandoms": [
        "Spider-Man: Homecoming (2017)",
        "The Avengers (Marvel Movies)"
    ],
    "relationships": [
        "Peter Parker & Tony Stark",
        "Wanda Maximoff & Peter Parker",
        "Peter Parker & Natasha Romanov",
        "Peter Parker & James \"Rhodey\" Rhodes",
        "Peter Parker & Avengers Team",
        "Clint Barton & Peter Parker",
        "Michelle Jones & Peter Parker",
        "Michelle Jones & Clint Barton",
        "Clint Barton & Tony Stark"
    ],
    "characters": [
        "Peter Parker",
        "Tony Stark",
        "James \"Rhodey\" Rhodes",
        "Wanda Maximoff",
        "Natasha Romanov (Marvel)",
        "Michelle Jones",
        "Flash Thompson",
        "Clint Barton"
    ],
    "additional_tags": [
        "Tony Stark Has A Heart",
        "Peter Parker is a Little Shit",
        "BAMF Peter Parker",
        "Tony Stark is Good With Kids",
        "Peter Parker Joins the Avengers",
        "Ceiling Vent Clint Barton",
        "Identity Reveal"
    ],
    "language": "English",
    "series": "Part 1 of Miscommunications",
    "published": "2018-07-16",
    "completed": "2018-08-16",
    "words": "14,324",
    "chapters": "6/6",
    "comments": "1,059",
    "kudos": "32,034",
    "bookmarks": "4,743",
    "hits": "396,431",
    "summary": "<p>Five times the Avengers learn about Peter Parker, and the one time the rest of the world does, too.</p>",
    "notes": "<p>UPDATE 9/19/20! Unfortunately, I've been locked out of my old tumblr account. This is my new<a href=\"https://isnt-it-just-so-pretty-to-think.tumblr.com/\" rel=\"nofollow\"> tumblr</a>. To my new readers, welcome! And to my old readers, welcome back. Enjoy the series.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>Due to popular demand, I posted a sequel to this chapter in which the Avengers view Steve's videos. It's the next fic in the series. Check it out if you haven't read it! &lt;3</p>\n<p>Trigger Warning: School Shooting</p>\n<p>5/29/23 update:</p>\n<p>Hi friends! If you’re a fan of my writing, I’m happy to announce I’m self-publishing an original work. It’s free to read and contains chaos gremlins, hilarious hijinks, moments of angst, and an IronDad character dynamic between two of the leads—in short, if you like my fanfiction, you might enjoy my novel. I’m posting a chapter a day until it’s all up on Royal Roads. It would mean so much to me if you were willing to check it out and lend some love. Link <a href=\"https://www.royalroad.com/fiction/68991/bloodstained/chapter/1225449/chapter-1\" rel=\"nofollow\">here!</a></p>",
    "text": "Tony isn’t really the kind of guy who likes to deal with his own mistakes. In his experience, it’s easier (and a hell of a lot less painful) to throw around some cash, flash a few smiles, and let someone else make everything okay. \nBut despite that, he’s never fucked up in a way that resulted in a pregnancy. Even in his early adulthood, which consisted of LSD hallucinations and blackout binge drinking, he’s never slipped up. Not once. Women have contacted his lawyers before, claiming they have his children, but the DNA tests always come back negative. Always.\n“Why are you telling me this?” Rhodey asks. They’re leaning against the most subtle car Tony has, the one that screams, ‘I’m rich,’ instead of ‘I’m really, really rich.’ \n“No reason,” Tony says casually. He hands over an extra pair of sunglasses and checks his watch.\nRhodey gives Tony an unhappy look. “We’re standing in front of a high school, Tony. Just break the news to me already.”\nTony ignores Rhodey’s pointed comment. “Be cool, alright?” he asks. “Here he comes.”\nHeads turn all from all around the campus, where students are trickling out into the warm sunlight. Tony has the kind of voice that carries, even over all the hustle and bustle of high school life.\n“Tony,” Rhodey hisses, trying to slink back into the car.\n“Relax,” Tony tells him. “We’re wearing sunglasses. No one knows who we are.”\nA loud, carrying whisper comes from inside the mob of staring students. “Holy shit, is that Tony Stark?” and suddenly everyone’s looking, trying to get a peek at the car and the two men leaning against it.\nRhodey wants to die.\nA brown haired, somewhat attractive kid makes eye contact with Rhodey and goes rigid. His eyes move from Rhodey to the car to Tony. His jaw goes slack, and he ducks his head and shoves his way through the mob of frozen students towards them.\n“Parker,” Tony says coolly. “Excellent timing. We were just talking about you.”\nRhodey clenches his teeth, because like hell Tony is getting off that easily.\n“Mr. Stark,” says the kid (Parker?) fiddling with the straps of his backpack. “Wow. This is, like, a huge surprise. What are you doing here? It’s Wednesday.”\n“Nice to see you too, kid,” says Tony, adjusting his sunglasses. “We were in the neighborhood, and I wanted to make sure you met Rhodey here.”\nNo, Rhodey wants to say. They were not in the neighborhood, they spent fourty-five minutes driving into the middle of Queens to pick up a random high school student Rhodey has never heard of before.\nInstead, he says, “It’s nice to meet you.”\nThe kid turns to face him, and his jaw drops. “You’re the Iron Patriot,” he says.\n“War machine,” corrects Tony.\n“Let’s talk about this in the car, Tony,” Rhodey says through gritted teeth. “Tony, children are staring at us. They’re staring at us, Tony.”\n“Right, let’s go,” Tony says, gesturing the kid and Rhodey into the car with a dramatic flourish.\n“Hey, Happy,” says Peter brightly as he gets in the car. “I like your haircut.”\nHappy grunts unhappily from the driver’s seat.\n“He’s not feeling particularly chatty, kid,” Tony says, pulling out his Starkphone. “He’s had a rough day. Did you hear about the hack?”\nPeter’s eyes light up. “Oh my god, it was beautiful,” he says, and Rhodey swears if his voice gets any higher it will crack from prepubescent strain. “We studied some of the coding in Comp-sci, and it was magnificent. They’re saying it didn’t just get through Oscorp’s firewall, it completely destroyed it!”\n“Don’t I know it, kid,” grunts Happy. “PR nightmare.”\nPeter shoots a quick look at Tony and starts firing questions. “Why does it have anything to do with Stark Industries?”\n“Everyone thinks we were the ones who created the hack. You know, to take our main competition out of the market, etcetera etcetera.” Tony snaps up his glasses and stares at Peter. “Mind you, Oscorp is crap, so it’s not like we needed to do anything. Their tech speaks for itself-,”\n“But did you do it?” Peter asks excitedly.\n“Tony,” Rhodey says quickly, because even though he’s had a little trouble following the conversation, it seems like this kid could get Tony in some legal trouble if he wanted to. “I strongly advise you not to answer.”\nTony waves him aside with a flick of his hand. “Quiet, Rhodes. I'm extremely proud of that coding, like hell I'm going to let someone else take credit.”\n“Tony!” Rhodey exclaims. “Jesus Christ. It’s like you want to get your ass sued off.”\n“First off,” says Tony, “Language.”\n“I’m sorry, you heard him say ‘language’ to me too, right?” Rhodey asked Peter. “The word ‘language’ just came out of his mouth, directed at me.”\nPeter’s jaw goes slack. “You’re the Iron Patriot,” he says again. \n\"Yes, I’m . . .” says Rhodey. “I’m . . . ugh. Tony. Explain.”\n“Here’s your stop, kid,” Tony says. Happy stops the car in front of some shitty apartment building that looks like it’s a light breeze away from keeling over. \n“Thanks for the ride, Mr. Stark,” says Peter happily. \n“Like I said, kid,” says Tony, putting his sunglasses back on with a flourish. “We were in the neighborhood.”\nRhodey coughs.\n“Goodbye, Mr. Iron Patriot, Sir. It was an honor to meet you,” says Peter, and then suddenly he’s gone, the door of the car slamming behind him.\n“Step on it, Happy,” says Tony, glancing at his watch. “I want to get back to the compound before Pepper gets home.”\nHe pulls out his phone and starts to scroll though his email. Rhodey’s hand reaches out before he can stop it, swatting Tony’s phone onto the car floor.\n“What the fuck,” fumes Rhodey. “Tony, what the actual fuck.”\n“Did you just let your annoyance manifest into physical aggression? You’re going to be a terrible role model for poor Peter.”\n“What the fuck?”\n“I wanted you to meet him,” says Tony, leaning down to pick up his phone, slightly annoyed. “He’s a good kid, Rhodey. Like, a really good kid. He’s crazy smart, he even comes down to the labs once in a while to help me with tech.”\n“Which brings us back to my question,” repeats Rhodey, a note of panic in his voice. “What the fuck? You still haven’t answered me, Tones.”\nRhodey hasn’t felt this much panic since the memorable night when Tony drank his way through four bottles of vodka. Or, as Pepper calls it, the Great Stomach Pumping of 2005.\n“The kid is a genius,” says Tony tiredly. “Sometimes I even wonder . . . not the point. He’s a genuinely good person with no self-preservation tendencies. Do I have to spell it out for you?”\nRhodey’s brain short-circuits.\n“Rhodes,” says Tony quietly. “Germany.”\nRhodey vaguely remembers a night, sometime around Tony’s twenty-fifth birthday, when they hit an all-night rave in Berlin. He distantly remembers meeting a woman there, holding a picture of a one year old, who claimed that Tony had gotten her pregnant two years before. Rhodey had shooed her away from them and given them Tony’s lawyer’s phone number. He’d never followed up.\n“No,” Rhodey says in a hushed voice. “Tony, tell me you didn’t . . .”\n“What happened was in the past,” Tony says firmly. “There are days when I regret it, of course, because when it comes down to it he’s just a kid. But I don’t regret meeting him, Rhodey.”\nRhodey’s jaw opens slightly.\nHe wants to get angry; there’s a little part of him that wants to hulk out at Tony, rage at him for being so fucking irresponsible.\n“Does Pepper know?” he asks finally.\n“She knows he’s my intern,” says Tony. “I haven’t told anyone else his other identity. He says he wants to keep it a secret. People could target the people he cares about, if they knew.”\n“And you’ve done tests on him in the lab,” Rhodey says. “You’ve made absolutely sure . . . Tony. We have to be absolutely sure.”\n“He’s a person, not a science experiment,” Tony snaps. “Jesus. Of course I’ve done basic DNA tests, tried to learn as much about his genetics and body-chemistry as I can.”\nThat seems a little overboard, even for Tony, but Rhodey figures they are talking about his son. \nHis son.\nJesus Christ.\n \n---\n \nWhen Rhodey shows up at the compound a week later, FRIDAY informs him that Tony and Peter are in the medbay.\n“What happened?” sighs Rhodey. “Science experiment gone wrong?”\n“Peter has two rounds in his lower abdomen,” says FRIDAY helpfully.\nThe bag of Chinese takeout Rhodey is holding crashes to the floor.\n“Rounds?” he demands. “Like, bullets?”\n“Yes,” says FRIDAY. “Do you have any other questions?”\nRhodey is already sprinting to the elevator, the takeout food forgotten on the floor. How could a sixteen year old kid have managed to get shot in the seven days since Rhodey’s last seen him?\n(Alright, Rhodey reasons with himself. This is Tony’s kid. Rhodey is just thankful the kid hasn’t decided to follow in daddy’s footsteps and fight crime in a homemade super suit.)\nHe throws the door of the medbay open. Peter’s shirt is rolled up to his belly button. He’s lying on one of the beds. Bruce is leaning over him, peeling some gnarly white stuff off of Peter’s abdomen. Tony is leaning against the wall, phone out, trying desperately not to look like a mother hen.\n“Hey, Mr. Rhodes,” says Peter cheerfully. “I got shot. Twice.”\n“What the actual—,”\nTony looks ready to explode. “And instead of calling for help like any rational preteen would do, he made the executive decision to dig the bullets out on the roof of a church with his eyebrow tweezers.”\n“They were actually May’s—,”\n“I’m sorry,” says Tony. His eyes flash dangerously as he sets his phone down. “Are we actually debating the owner of the eyebrow tweezers you used to dig two bullets out of your stomach?”\nRhodey hears himself make a noise somewhere between a whimper and a laugh.\nBruce glances up at him, amused. “This stuff happens more often than you’d think,” he tells Rhodey. “I’ve kind of just resigned myself to being this kid’s full time doctor.”\n“You’re so cool!” says Peter excitedly. He tries to sit up, but Banner puts a hand on his chest and pushes him back down. “Mr. Rhodes, have you read Bruce’s papers? His work with gamma radiation is iconic. I can’t believe—,”\n“Tony!” says Rhodey, completely at his wits end. “Can someone tell me why no one seems to be surprised that there is a child bleeding out on that table?”\nBruce, Peter, and Tony all stare at him, confused.\n“I thought you told him,” says Peter.\n“I did,” says Tony carefully. \n“I know you’re his kid,” says Rhodey, trying very hard to make his tone sound flippant, as though it hasn’t kept him up every night for the past seven days. “It makes sense. I actually met your mom, in that club in Germany, and she seemed legit—,”\n“Stop talking,” says Tony, holding up a hand with a horrified expression on his face. “Oh my fucking . . . Rhodey, darling, there has been a terrible miscommunication between us.”\nPeter is staring between the two of them, his mouth slightly open. Bruce is frozen. Blood is oozing out of Peter’s abdomen at an alarming rate, but no one seems to be concerned. \n“What . . .” Rhodey trails off.\n“Rhodey,” says Tony formally, his voice slightly higher than usual. “Meet Spiderman. He fought with us in Germany. That was the time I was referring to. You . . . you actually thought . . .”\n“So he’s not yours,” Rhodey clarifies. His airway feels more open than it has in days. “Wait. Please tell me you didn’t just say that he was Spiderman.”\nPeter laughs nervously.\nTony glances over at him, smiling slightly. The smile drops off his face immediately, and his eyes widen comically.\n“Bruce! He’s bleeding out on my fucking table!”\nEver since the Germany incident, Tony has pretty much had the tower to himself. The Avengers have scattered into the wind; Rhodey stays over, sometimes, but he’s active duty and never stays anywhere too long. Vision keeps to himself. Tony occasionally will see him cooking or reading, but for the most part he’s pretty private about his quest to become a real boy.\nWhen the Avengers move back into the tower, it’s more of a trickle-in system then a fully-fledged moving spree. Tony wakes up one morning and Natasha is in his living room, in a tank top and pajama bottoms, sipping tea and reading a book like she owns the place.\n“So that’s it?” Tony asks. “You’re just moving back in?”\n“I’m taking a break from Sam and Steve,” is all she says. She tilts her head, looking up at him. “Pepper didn’t tell you?”\n“You talked to Pepper and not me?” he says sardonically. “You do realize this is my house, right? You can’t just come and go as it pleases you.”\n“Pepper says it’s only sixteen percent your house.”\nTony rolls his eyes, because he really doesn’t think that’s fair and Pepper needs to let that one comment from four years ago go. \nNatasha raises her eyebrows. “Do you not want me to move back in?”\n“I . . .” Tony pauses. He has to tread carefully, because if he says something that pisses her off there’s a real possibility that he will never see her again. “Okay, of course I want you here. But I need a favor.”\n“I’m not killing anyone for you. Unless they deserve it.” \n“What? No!” Tony says. “Not that kind of favor. Jesus.”\nNatasha raises her eyebrows.\n“I need your experience. Lessons,” Tony clarifies at her confused expression. “In hand to hand combat.”\nNatasha’s lips quiver suspiciously. “You want me to teach you how to fight.”\n“Not exactly. I—,”\n“If this is some new kink you have, Stark, I swear to god—,”\n“I’ll have you know, I’m an engaged man,” Tony says, raising his eyebrows. “And besides, the lessons aren’t for me. They’re for the vigilant who fought with us in Germany. He got himself shot a few weeks ago, so I’ve decided it’s time to get him some actual training instead of letting him fend for himself against local criminals.”\n“The one from Queens,” Natasha says, narrowing her eyes. “Too chatty. Exuberant. Can’t throw a punch to save his life?”\n“I kind of feel obligated to defend him, but you raise some good points.”\n“Fine,” says Natasha. “Deal.”\nIt’s surprising, how easily Natasha fits herself back into his life. It’s nice, having someone around the house when Pepper’s gone and Vision is doing god knows what. \nA few days after she moves in, Natasha orders Chinese food and brings some down to his lab, and they eat together and talk about unimportant, trivial matters.\nThey talk about Germany a bit. He asks about Clint, she asks about Rhodey’s PT. They don’t talk about Steve, or Sam, or the Winter Soldier.\n“Should I be worried about Spiderman’s secrecy?” she asks in between bites of fried rice.\n“No,” Tony says. “He’s a good kid. Better than I was, anyway.”\n“How old is he?”\nTony figures there’s really no point denying it—Natasha will find out whether he tells her or not, and he knows what it feels like to find out people are keeping important information from you.\n“He’s not legally allowed to vote.”\nHe expects Natasha to verbally berate him for recruiting a kid, but she just shrugs. “I thought so.” \n“He fights okay, all things considered,” Tony says.\nNatasha tilts her head. “Yes,” she agrees. “Thank you for telling me.”\nThe rest of the Avengers trickle into the compound soon after Natasha. Three nights later, Friday alerts him that someone has spent the night with Vision in his room. Tony makes a point to reestablish with Friday what constitutes as a ‘threat,’ because he really doesn’t want to hear about Vision’s ‘intimate relations.’\nHe’s not surprised when he finds Wanda in the kitchen in the morning.\nShe gives him a tight smile. He returns it.\nEveryone else comes all at once after that, except for Steve and Sam. And suddenly, the tower isn’t empty and lonely anymore. He walks into the game room to find Clint and Natasha playing call of duty, and can’t go three feet without tripping over someone’s shoes or clothes or pistols. And it’s nice, the company.\n \n---\n \nNatasha corners him not long after. “I’m free this Thursday,” she tells him.\nTony is a little busy trying to keep Dum-ee away from the kerosene, so it takes a minute for him to absorb what she’s saying.\n“I’m flattered, but I’m actually in a relationship right now,” Tony says.\nNatasha glares at him. “Spiderman,” she says through gritted teeth. “You wanted me to teach him how to fight.”\nIn all honesty, Tony had forgotten about her promise, but just last night the Baby Monitor Protocol informed him that Peter had cracked two ribs, so it’s probably best to cash in.\n“Thursday,” Tony agrees.\n“Four to six,” says Natasha, and she’s left his lab before he can even confirm.\n \n---\n \nOn Thursday, when Peter comes bounding into the compound, Happy in tow, he looks like Christmas has come early.\n“Happy says that I’ll get fighting lessons today,” says Peter, and Tony braces himself for the fanboying that will inevitably burst forth.\n“Hi, nice to see you too,” Tony says, not looking up from the suit Peter hands to him. “Jesus, kid, what happened here?” \nThe suit has a long gash running down the front, probably in the same place where Peter’s two broken ribs are currently healing.\nPeter winces. “Sorry,” he says, deflating slightly.\n“Do I even . . . no, I don’t want to know,” says Tony firmly. “Nat’s waiting for us down in the gym, I can fix this later.”\nPeter’s eyes widen comically.\n“Nat?” he says. “Like, Natasha Romanov? The Black Widow is going to teach me how to fight?”\n“I called in a few favors,” Tony says, brushing it off.\n“Oh my god,” says Peter, thrilled. “I’m going to die.”\n \n___\n \nHe doesn’t die.\nHe actually lasts about twenty seconds, which surprises Tony to no end. But then Natasha stops going easy on him, and he’s flat on his back almost instantly.\n“Oh my god,” wheezes Peter, the wind completely knocked out of him. “This is the best day of my life.”\nNatasha stares at him, perplexed.\nPeter’s gone down six more times by the time Tony finishes his fourth game of flappy bird. When he looks up, Peter is curled up in a ball on the floor. Natasha is standing over him, looking amused.\n“What did you do to him?” Tony demands.\n“I’ve been wanting to test out that new Widow Bite for ages,” Natasha says, smirking at him.\n“You tased him?” Tony demands. “His aunt is going to kill me.”\nPeter moans loudly from the ground. When he rolls over, he still has a huge smile on his face. Either that, or his facial muscles are spasming.\n“Wasn’t fair,” he mumbles into the mats. “I almos’ had you.”\n“Do you think the criminals in Queens are going to play fair?” Natasha asks dangerously. “Do you think they’re going to say, ‘Oh, he’s just a kid, guess we should go easy on him?”\n“I’ve been doing this for seven months,” Peter slurs into the mats. “I’ve never been tased before.”\nIf Tony didn’t know Natasha so well, he’d say she looked amused.\n“Alright,” she says, and she’s defiantly smiling. “Get up, Underoos. Let’s go again.”\n \n---\n \n“You like him,” Tony accuses after Peter leaves.\nNatasha glares at him. She grabs a towel and exits the gym. Tony follows her, smirking.\n“It’s okay,” Tony says, giving her a condescending pat on the back. “He has a way of growing on you.”\n“He’s a good sport,” Natasha agrees. “And he learns quickly.”\n“Not quickly enough,” mutters Tony. “Did I tell you he got shot two weeks ago? Scared me and Rhodey half to death.”\n“You mentioned it,” Natasha says. Her eyes fall down to the ground.\n“Thanks for letting me meet your kid,” she tells him. “And for being upfront with me. Rhodey says you tried to pass him off as yours instead of telling the truth.”\nThe smile slides of Tony’s face. “That’s actually not what went down at all. Rhodey is a filthy liar, who completely misinterpreted—,”\n“Stop while you’re ahead, Stark.”\n \n---\n \nAnd if Natasha makes a point to say hi to Peter every time he’s at the compound, well. Who is Tony to judge?\nThe aliens that are currently invading Manhattan are extremely nonthreatening. In fact, they’re so easy to beat up that Tony has no idea why Dr. Strange felt the need to call in the Avengers for backup.\n“It’s not that they’re a problem,” says Strange shortly when Tony tries to make fun of him for needing help. “They’re scouts. They’re gaging Earth’s defenses for something bigger. I want whoever’s out there to know that we’re no joke.”\nIt’s a distressing statement.\nThe alien-robots invading are so pathetic that Tony feels a little bad beating them up. They don’t even have guns, they just have long metal poles that they swing around mechanically. They also make adorable distressed beeps when they’re being crushed to bits by the Avengers.\n“Call the kid,” Rhodey tells Tony over comms. “This is pretty much as safe as it gets. It will be good practice for him.”\n“’The Kid,’” Roger echoes, amused. “Some superhero name.”\nNo one bothers to correct him, but Tony does make the call.\nPeter shows up twenty minutes later, swinging into the scene with enough energy to put them all to shame.\n“Hey,” says Steve, finally understanding, when he catches sight of him. “Queens, right?”\nPeter is practically hyperventilating with excitement. “Hey, man! I’m a big fan. Remember that time I stole your shield?”\n“Stay close to the ground,” Tony instructs him through the comms. He can’t see Peter, but he can hear him trying to engage the aliens in conversation (Tony doesn’t say anything, because he knows that it’s annoying Steve more than it’s annoying him.) “Help civilians, take out aliens. Don’t do anything stupid.”\n“Of course not,” says Peter. “Hey, quick question. Morally speaking—,”\n“I’m going to stop you right there,” Tony says, blasting his way through a dozen aliens at once. “If a question needs to be started with the words ‘morally speaking,’ the answer is automatically no. New rule.”\n“But would it be morally okay to take a few of these robot carcasses with us? We could figure out how the alien tech works!”\n“Don’t call them carcasses,” says Strange, annoyed. His voice sounds oddly tinny through the comms.\n“Cadavers, then.”\n“They’re not—,” Tony breaks off. “Kid, just . . . don’t mess with the dead aliens. Please.”\n(He's not smiling. He's not.)\n \n---\n \n“He has good instincts. He kept part of a building from collapsing on me, today. I wouldn’t have noticed until it was too late,” says Wanda quietly to Tony on the tense, silent Hellicarrier ride back to the tower. \n(Stark tower? Avenger’s Tower? Tony doesn’t really know what it’s called anymore. He doesn’t think it’s either.)\nTony glances at Peter, curled up in a ball on his seat, masked face buried between his knees. Tony knows him well enough to safely assume that Peter can here every word anyone on the plane says, regardless of how low they keep their voices.\n“Yeah,” Tony says, “Spidey-sense, patent pending. It’s a real thing.”\nWanda gives him an approving look.\nHe raises his eyebrows at her, silently asking the question he’s afraid to hear the answer of.\n“Of course I know,” she murmurs, lips barely parting. She leans in closer, as if she’s whispering a secret in his ear. “I won’t tell any of his secrets. Don’t worry. You can trust me.”\nTony’s gone to extreme lengths to protect the kid’s identity. Legally speaking, there is absolutely no way to tie Spiderman back to Peter Parker. He swore to himself that no one, not even the Avengers, could ever be trusted with a secret this important (besides Rhodey, of course. But isn’t Rhodey always the exception? And Nat. But she doesn’t count, really, because she would’ve found out anyway.)\nBut, even after everything that’s happened, he does trust Wanda. He sees in her eyes that she’d die for Peter, the same way she’d die for Steve or Vision.\nAnd maybe even him.\nHe may not get along with Clint. He might still have a little resentment for Natasha. He might hate Steve in ways that it will be impossible to let go of. But he trusts them all, every single one.\nAnd he sure as hell trusts Peter Parker and his crazy instincts.\n \n---\n \n The conference room is tense. It’s the first time they’ve had an official meeting since the split. Tony really wishes he’d made a seating chart, because watching the team awkwardly segregate back into Team-Cap and Team-Tony is a little hard to swallow.\nRhodey sits in the seat on his right hand side, like they’re all fighting the way they were six months ago (are they? Tony doesn’t really know anymore.) Tony gestures to the seat on his other side when the kid comes in, still wearing his suit and mask. The eyes of the suit widen comically.\n“Damn, kid, be cool,” Tony says, as the kid scrambles to sit on Tony’s left-hand side.\n“I’m cool, I’m cool,” Peter says. “I’m, like, the coolest—,”\n“I wouldn’t finish that sentence if I were you, little spider,” Wanda says kindly, taking her seat at the other end of the table, by Steve.\nThe unmentioned barrier is broken when Natasha slides down besides Rhodey. She’s somehow managed to change into a cocktail dress, and Tony has no idea where she got it from.\n“Hey,” Rhodey says pointedly. “No team Cap on this side of the table.”\nNatasha gives him a look and pulls a gun out of god knows where. She begins to polish it, nonchalant and cool as a cucumber.\n“I’m not team Cap,” she tells him smoothly. “I’m not on your team, either, for that matter. I’m on team Natasha. Always have been.”\n“Hey, nice gun,” Peter tells her. “It’s super badass. I actually don’t really like guns, mostly because there’s too much gun violence in the US, though. But I mean, you’re obviously not the kind of person who would, like, shoot up a school, so I guess—,”\nNatasha’s smiles slightly when she looks at him. “It’s good to see you again. I assume you had fun today?”\nThe eyes of the suit widen. “Oh my fucking . . . did you see the aliens, Nat? It was so lit.”\n“I’m sorry,” says Sam snarkily to Peter, entering the room and sliding into the seat to the right of Cap. “Who are you, again?”\nPeter deflates under his piercing stare. “Underoos?” he says helplessly, the end of his sentence turning up like a question.\n“You talk a lot,” Steve says. He raises an eyebrow. “Why are you still wearing your mask?”\n“Hey,” Tony snaps. “Stop interrogating the kid. Take it easy.”\n“No, Steve has a point,” says Sam. He’s more curious than aggressive, but it still rubs Tony the wrong way. “Why is he wearing the mask still?” \n“Maybe he’s horribly disfigured,” Clint suggests. He turns to Wanda. “How many Pringles do you think I can fit in my mouth?”\n“Um, no,” said Tony, moving the can of Pringles far out of harm’s way. “I just got this carpet dry cleaned, thank you very much.”\n“I’m not,” Peter says at the same time. The eyes of the mask squint as everyone turns to look at him. “Horribly disfigured, I mean. At least, I don’t think I am.”\n“Then take the mask off,” urges Steve. “You can trust us.”\n“Haven’t you seen The Incredibles?” Peter rambles. “Secret identities, and all that jazz. Oh my god, the sequel just came out, it was fantastic . . .” \nThey don’t have a chance to discuss the matter further, because Dr. Strange enters with an expression so serious it makes Tony feel depressed.\nAnd then they’re talking about Thanos, aliens, and infinity stones, and Tony realizes there was a second when he forgot there was anything more important than keeping Pringles off his carpet and secret identities.\n \n---\n \nTony thought that would be the end of it. \nThere was no reason for the Avengers to meet Peter Parker, because Peter made the conscious decision not to move up to the major leagues. Tony just assumed that there wouldn’t be another run-in for a few years. At the very least, six months. \nBut, of course, Peter is absolute shit at staying on the down low.\nThe headline catches Tony’s attention as soon as he turns on his Stark phone. \nWell, not the headline, exactly. Scarlett Witch spotted with a new man. Has Vision been Unplugged from Her Life? is so obviously clickbait that it almost makes Tony roll his eyes and swipe it off his screen without looking at the picture.\nAlmost. \nBut the image of Peter Parker catches his attention before he can do so, and suddenly Tony’s heart is beating fast enough to power an entire building.\nShit.\nThe picture is of Peter and Wanda (Peter, not Spiderman,) casually leaning against the side of a building, both holding Starbucks. They look like they’re in the middle of a conversation; Wanda is rolling her eyes. Peter is laughing, his eyes bright.\nTony’s calling Peter before he can even wrap his head around what he’s doing.\n“Misser’ Stark?” Peter’s voice sounds raspy and low, and instantly Tony is on high alert.\n“Kid? You okay?”\nThere’s a slight pause.\n“It’s three in the morning,” Peter says, sounding slightly more alert. “I was sleeping.”\n“Oh,” says Tony in surprise, glancing at the clock on the wall of his lab. Huh. He must’ve gotten carried away working on the Iron Spider suit.\n“What’s up?” Peter asks. “Mission?”\n(He always asks that, when Tony calls. It hurts more than Tony is willing to admit.)\n“No,” says Tony casually. “Hey, fun story. Buzzfeed seems to think you and Scarlet Witch hang out regularly. Crazy, right?”\nThere’s a pause on the other end of the phone.\n“I saw the picture,” Peter admits. “It’s just clickbait, though, you know that.”\n“Why the hell were you having coffee with Wanda?”\n“We’re friends,” says Peter offhandedly.\nTony’s brain is having a little trouble working, so he slides onto the sofa that’s shoved into the corner of his lab and buries his face in his free hand.\n“Friends,” he echos.\n“Yeah,” says Peter, sounding unnerved by the edge in Tony’s voice. “We . . . we hang out. Why does that upset you?”\n“What—exactly—do you do?” says Tony, trying very hard to be patient.\n“I don’t know,” says Peter, sounding more annoyed then Tony has ever heard him. “We braid each other’s hair. Talk about boys. What 'exactly' do you do with your friends?”\n“I’m not joking,” says Tony, his voice hard.\n“Neither am I,” says Peter coolly. “She hangs out with us after decathlon, all right? She watches Star Wars with Ned and me, and she gets along great with MJ, almost too well, really, but that’s not the point. And . . . I don’t know, we just hang out, there’s no other way to put it.”\n“How long has this been going on?” Tony demands.\n“Since those weird robot-aliens invaded last week,” Peter says. “Why are you so bugged out by this? She’s really nice.”\n“Are we even talking about the same person?” says Tony harshly. “I beat her at Uno once, and she told me that she sincerely hoped my death was painful and full of agony. She’s not a good person, Pete, not like—,”\nHe trails off before he can say something stupid, like ‘you.’\n“Yes, she is,” Peter says quietly.\nTony wants to dig in his heels. He wants to keep Peter far away from Wanda, because the fact of the matter is she’s dangerous. But telling Peter about all the things Wanda has done isn’t really fair to her, he supposes.\n“Okay,” Tony says finally.\n“Okay?”\n“But I’m still your favorite Avenger,” Tony says firmly. “Say it. Say, ‘Iron Man is and always will be my favorite Avenger.’”\nPeter laughs, but says it anyway.\n(When Peter shows up at the tower the next day, he’s visiting Wanda, not Tony. Tony animatedly refuses the offer to join them for a Pretty Little Liars marathon. He’s not that far gone.)\nClint likes making lists. \nFirstly, because it’s a good way to express himself. His therapist doesn’t like most of his coping mechanisms—he went through a phase where his self-expression mainly consisted of tracking down, torturing, and putting down hydra agents, which was, according to his therapist, unhealthy and obsessive.\n“It’s art,” Clint had said firmly.\n“It’s assassination,” his therapist, Neil, had corrected. \nWhatever.\nSecondly, the lists help him keep track of every single detail. Neil says it’s a way to store the obsessions; the little ticks he has that make him Clint. Clint just likes everything to have its place in the world. Because if it doesn’t have a place, it shouldn’t exist.\n“That’s . . . an odd way to look at the world,” Neil the therapist had told him carefully.\n“You’re an odd way to look at the world,” Clint had snapped back. He felt judged. Clint does not like to feel judged.\nLaura put up with it for a while. She was good like that. She’d tolerated the lists, and the obsessions, and the whole gotta-go-save-the-world-now bullshit he’d been putting her and the kids through for years. \nBut then there was an incident with a list, Nathaniel, one of Clint’s pistols, and a can of Aresol Spray Whipped Cream that resulted in Clint standing in front of Stark Tower with two packed suitcases.\n“I need a place to crash for a few nights,” Clint tells a very confused Tony as he makes his way through the living quarters.\n“No, totally,” Tony responds, but there’s an edge to his voice as he takes Clint’s suitcases from him. “Hotel Trivago is open for business.”\nClint actually likes Tony okay, because; 1) Tony is a self-sacrificing bastard, who hides all the good parts of him under a layer of sarcastic narcissism. 2) However pissed off Tony is at the Rogues, he’s the kind of man who would rather eat a bullet then burn bridges. And, 3) Tony has always been good to Clint. \nSure, they’ve never been really tight, but they both love three things: alcohol, Natasha, and world peace. So how hard can bonding be?\n“Thanks for letting me crash here,” says Clint cheerfully, removing one of the panels in the wall so he can set up camp in one of the vents. “Hey, how’s world peace coming along?”\nTony’s lips quiver angrily as he glares at Clint over the top of his phone. Clint realizes too late that Tony might think he’s being made fun of. Oops.\n“What I meant was, uh . . .” Clint sets the vent cover down on the floor as his mind scrambles to find a new topic to bond over. “Have you . . . drank . . . any good alcohol lately?”\n“I’m four months sober,” says Tony coldly. \nOh.\n“How . . . bout . . . Natasha?” says Clint, a little desperately, as he positions his shoulders just right so he can shimmy into the vent.\nTony, apparently, is done with Clint’s rambling. “You know you have a bedroom, right? You don’t have to dissect my wall to make room for yourself.”\n“It’s fine,” Clint says firmly, reaching down to grab his backpack so he can pull it through the vent, too. “I like vents. I prefer them, really. I usually sleep in the vents at home, too.”\n“Can’t imagine why Laura kicked you out,” Tony mutters. \n“Right?” says Clint, but he knows why Laura decided enough was enough. He’s already made a list of all the reasons.\n \n---\n \nClint meets Peter the next day.\nHe wakes up early—early enough that the sun still hasn’t illuminated his vent. It takes him a while to shimmy out, and somehow he ends up in a random bedroom instead of the living room.\nIt’s not a bedroom that Clint recognizes, so he assumes it must be empty. So he pops the vent board off the wall and shimmies out, tucking into a roll when he hits the ground.\nIt takes him approximately half a second to realize that the room is not empty. There is someone in the bed.\nClint has done a lot of incredible things in his life. 1) He singlehandedly tracked down and destroyed an entire hydra cartel. 2) He gained the trust of the Black Widow. 3) He challenged six Olympic archers to archery competitions, and beat the four that accepted. 4) He successfully completed the Saltine challenge.\nSo, needless to say, he has lots of life experience. He doesn’t hesitate, he doesn’t, he just . . . pauses, for a second. To watch the steady rise and fall of the mystery-person’s breathing.\nThen he looks around the room.\nIt’s a nice bedroom. The king bed makes mystery-person look like a child, it dwarfs him so much. There are Stark Wars and I Love Iron Man posters decorating all the walls. There’s a desk, messy with lots of spare parts, sheets, and science textbooks. There’s an unfinished cup of hot chocolate on the dresser, and dirty clothes in a pile by the head of the bed.\nIt’s not that the room is messy; there’s an orderly chaos vibe that Clint can dig. He has the urge to clean up after mystery-person, but he stops himself. He’s not mystery-person’s dad. He’s doesn’t get to be a dad to every person he meets just because he’s not allowed to see his kids until Laura cools off.\nStill. Clint decides he likes mystery-person, because 1) mystery-person seems to like hot chocolate, and Natasha likes hot chocolate, and Clint likes Natasha. 2) Mystery-person has yet to fly into a towering rage at Clint for accidentally breaking-and-entering his bedroom, and 3) any person who has a heart shaped poster of Harrison Ford is a friend of Clint’s.\nThen mystery-person mumbles something in his sleep, and rolls over onto his back. And every part of Clint’s brain freezes, because mystery-person is not a person.\nMystery-person is a kid.\n \n---\n \nWhen Tony wakes up to find Clint’s face hovering half an inch above his, he doesn’t scream. Instead, Clint is blasted backwards at an alarmingly violent speed. He slams into a wall a good twenty feet away from the bed and slides down, slightly dazed.\nAlright. He deserved that.\n“What the fuck?” Tony snarles, sliding out of bed. Somehow his hands are both covered in Iron Man gauntlets (does he sleep in them? Clint wonders.)\nClint scrambles to his feet. \n“Kid,” is all he says, but there’s excitement in his voice. “I saw a kid.”\n“What am I supposed to say to that? Good for you, I guess,” snaps Tony. He looks slightly demonic, with his messy bed-head and his grey sweatpants and his Spiderman tee-shirt. “Now why . . . exactly . . . are you in my room.”\n“There’s a kid in one of the bedrooms,” says Clint, and understanding rushes into Tony’s eyes. \n“Peter.”\n“I’m waiting for him to wake up so I can introduce myself—,”\n“No,” snarls Tony.\nIt’s aggressive and harsh, and not a noise Clint is used to. He frowns slightly.\n“No,” says Tony again, and this time he sounds slightly calmer. “You don’t get to meet him. He’ll be leaving for school in a few minutes, anyway. But you have to stay away from him. Don’t push me on this.”\nJust because Clint hasn’t built a super suit or gotten seven PHD’s or lifted Thor’s hammer doesn’t mean he’s not smart. And yes, he likes to make lists, but he’s also ridiculously good at figuring things out.\n“Is he your kid?” asks Clint. \n“Why does everyone automatically assume that he’s mine?” fumes Tony. “God, I know I’ve had some fun, but—,”\n“One. You’re weirdly protective of him,” says Clint. “Two. For some reason, a kid has a bedroom in your tower—,”\n“He’s not—,”\n“When do I get to meet him?” asks Clint defiantly. He raises his chin up to meet Tony’s gaze. “Do you not trust me?”\nTony gets up and begins to pace, shooting irritated looks at Clint every few steps.\n“I have a schedule,” says Tony absently. “For who gets to meet him, and when. Too many people have already . . . I can’t . . .”\n“When?”\n“Not until he’s eighteen,” says Tony firmly. “It’s not personal, Clint. But everything to do with Peter Parker is strictly on a need-to-know basis.”\nLike hell it’s not personal.\n \n---\n \nWhich is how Clint finds himself in a black car with tinted windows, watching Tony’s driver drop the kid off at some nerd school.\nClint has been undercover more times than he can count. His therapist, Neil, says that’s why he acts the way he does. With the childish humor and the coping mechanisms and the lists. Neil says that somewhere along the line, Clint must have lost himself in one of the Hydra bases. And now, this . . . person he is, it’s all he has left.\nFuck Neil the therapist.\nClint has infiltrated a hydra base with no less than sixty armed guards. In, out. They never even knew he was there, at least, not until it was too late.\nAnyway, he can infiltrate a high school, no problem.\nHe waits until the bell rings and all the small children scurry to class before he gets out of the car. He pulls his hoodie low over his face and jogs to the doors of the school. Some idiot has left them unlocked, possibly to allow late children the opportunity to get to class. Ha.\nClint has a plan. 1) Find the vents. 2) Find the crawlspace above Peter’s classroom. 3) Observe. 4) Take notes. 5) Figure out whatever Stark is hiding. 6) Use aforementioned information as leverage to infiltrate his way into Starks inner circle. Or possibly as blackmail, Clint isn’t particular.\nThe school is eerily empty, and Clint has no trouble finding a vent outlet. He tugs off his backpack and sets to work getting the panel off the wall.\nEasy, peasy. \nAnd then, from somewhere behind him, a loud slurp echoes through the empty hall.\nBeing undercover is about maintaining one’s cool. So, as soon as he hears the slurp, Clint becomes Nathaniel Clinasha, Vent Repair Man. He’s good at being undercover; really, really good. So he turns around slowly and finds himself face to face with a girl.\nShe’s drinking some sort of Starbucks drink—quite possibly the cause of the slurping noise. Her messy black hair is pulled back into a low bun, and her tee-shirt is cropped with the words Fuck the Patriarchy scrawled across in Sharpee.\n“The vents are off limits,” says mystery-girl coolly. “Flash got suspended two months ago for releasing a few hamsters into them. I wouldn’t mess around, if I were you.”\n“It’s okay,” Clint says. His voice is lower than it usually is, and his body is filled with a euphoric calm that he always gets when he’s undercover. “The school hired me to take a look at some faulty wiring. Its okay, kid. You can get back to class.”\nThe girl doesn’t look impressed, which is weird. Normally his I’m-not-doing-anything-wrong-voice is quite convincing.\n“The school hired you,” she repeats. “For faulty wiring.”\nClint thinks fast. He tries to remember everything about wiring that Tony has ever casually mentioned in conversation.\n“I need to access the building’s mainframe,” he says importantly. “This is one of the best points of access. What did you say your name was, again?”\nThe girl puts the hand that’s not clenching her drink on her hip. She quirks an eyebrow, and he’s reminded vividly of a younger, non-white version of Natasha.\n“I’d be convinced,” she says coolly. “Except for the fact that I’m vice president of Robotics, and I’m fairly certain that our school doesn’t have a mainframe, especially not one you can access through the fucking vents.”\nShit.\n“I—,”\n“Also,” she says coolly. “I have a poster of you on my bedroom wall.”\nDouble shit. Cover blown. Initiate: comical Clint. Goal: diffuse situation.\n“I had no idea you were a fan of Nathaniel Clinasha; vent repair man,” says Clint, smiling in what he hopes is a friendly, please-don’t-blow-this-for-me kind of way.\n“I don’t,” says the girl coolly. “I have a picture of the Black Widow, and I’m afraid it will mess up the poster if I cut you out.”\nOuch.\nThe girl sighs and dumps her drink in a nearby trash can. When she returns, she’s taken off her sunglasses and she’s looking thoroughly unimpressed.\n“You’re here for Peter, aren’t you?” she asks. “God, now I know how everyone in Harry’s year at Hogwarts felt. Here I am, trying to have a normal sophomore year, and a fucking Avenger is here to open the Chamber of Secrets. Thanks a lot, Potter.”\nClint chooses to ignore her, continuing to jimmy open the vent.\n“What exactly is the plan, here?” asks the girl coldly. “Are you just going to parade through our schools ventilation system until you stumble above the right classroom?”\n“I’m going to access the schools mainframe,” says Clint through gritted teeth, “And then I am going to repair the faulty wiring.”\n“God, this is painful,” says the girl. “You’re a loser, you know that? I’m going to go to class, I don’t think I can take the secondhand embarrassment when you inevitably fuck something up.”\n“You know,” snaps Clint. “I’m actually really good at what I do. Contrary to popular belief, I’ve had a ton of training, and I’d really appreciate being given the benefit of the doubt.”\nThe girl pauses. She moves so that she’s standing beside him, staring at his face. It’s kind of freaking Clint out. \n“Okay,” she says. “I guess I’ll trust whatever credentials you got from . . . from vent repair-person school.”\nClint jerks out a nod.\nThe girl turns away.\n“Take your first left and then keep going straight,” the girl calls over her shoulder. “You should find Mr. Wallmon’s calc classroom eventually. Not that you’re looking for Peter, or anything like that.”\n“Of course not,” says Clint dully. “Because I’m a vent repair man.”\n“Looking for the mainframe so you can fix the faulty wiring,” the girl agrees.\nClint pauses for a minute, staring at her. “Thanks,” he says finally.\n“Yeah,” the girl says. “You know, people do take you seriously. Just because you’re kind of childish on your Instagram, and because of all that bad PR you got from jogging through central park sans clothing—,”\n“A dare,” Clint says firmly. “But go on.”\nThe girl rolls her eyes. “In the fifth Harry Potter book, everyone always gets on his case for being a dick, you know? But PTSD does weird things to people. You don’t have to apologize for your weird coping mechanisms, and you sure as hell don’t have to prove anything.”\n“I’m a vent repair man,” says Clint again. “I mean, sure, there were a few times when I got stuck in bad situa—I mean, when I got stuck in vents. But it’s not enough to get PTSD over. I don’t have PTSD.”\nThe girl tilts her head to the side. “You’re a loser,” she says instead of answering, but there’s no bite behind it.\nClint doesn’t quite know how to respond to that.\n“Turn left and keep going,” he finally says, trying to remember her instructions from earlier.\n“Mr. Wallmon has a really nasally voice,” says the girl. “You’ll know it when you hear it.”\n“Thanks.”\n“I’m sure you’ll be able to return the favor someday,” says the girl flippantly. “Just remember, you owe me. I’m trying to make sure as many Avengers as possible are indebted to me. I’m up to two.”\nBy the time Clint shimmies his way into the vent, the girl is gone.\n \n---\n \nIt’s hard to see Peter through the vent. The slits are angled down, so Clint is virtually invisible, but it also makes it kind of hard to see through them.\nHere’s what he does observe:\n1) Peter is smart. Like, really smart. Smart enough to be Tony’s kid. He’s finished the eight pages of calc in the time that it takes Clint to find his classroom.\n2) He’s a smartass. Clint’s high tech hearing aids can pick up all the little barbs he mumbles to the Asian kid beside him, even if no one else can hear. See again: possible offspring of Tony.\n3) He seems to know that someone is watching him.\nThe girl from the hall, the one with the fuck the patriarchy tee shirt throws a middle finger at the vents as she enters the room ten minutes later.\nPeter follows her gaze, frowning suspiciously up at the vent. Clint isn’t concerned; he’s virtually invisible from Peter’s angle. He has plenty of time to observe and wait.\n“What’s up, dude?” asks the chubby Asian kid from beside Peter.\n“I think I hear someone breathing,” mutters Peter, so softly that Clint almost misses it. \n“Yeah,” says the Asian kid. “People sometimes do that.”\nPeter frowns suspiciously up at the vent. Clint puts his hand over his mouth and tries to stop breathing. It’s harder than he expected. He decides he needs oxygen more than he needs to be quiet.\nThe hallway girl slides into the seat next to Peter. Peter and the Asian kid exchange a baffled look, but don’t say anything.\n“I’m sitting here today,” says hallway girl. “This is going to get a lot more interesting than multiplying matrices.”\n“What’s interesting?” asks Peter’s friend.\nThe hallway girl shrugs and pulls out a sketchbook.\n“Is something up, MJ?” Peter hisses to her. Clint feels a stab of disappointment that her name isn’t actually hallway girl.\nMJ shrugs again.\nPeter glances up at the vents, looking vaguely alarmed.\n“Nothing you need to worry about,” says MJ coolly. “The usual. Stalkers and maintenance workers, the whole nine yards, really. Hey,” she says, and her eyes casually drift upwards. Peter follows her line of sight. “I think the school is having a bit of a problem with infestations in the vents. Pity no one in this classroom has the ability to check it out, make sure we’re all safe.”\nPeter’s whole body goes rigid.\n“Make an excuse for me,” he mutters to MJ, side eyeing the teacher.\n“Congratulations,” MJ deadpans. “You’ve officially been diagnosed with the bird flu. Go ahead, I’ll let Mr. Wallmon know.”\nPeter looks at the Asian kid a little desperately. “Keep her from telling the class I have bird flu, okay?” he says, and then he’s crouched over and sneaking out the cracked door.\nKids today , thinks Hawkeye. If hallway girl has outed him, he’s going to be pissed. The last thing he needs is for Iron Man to show up at the school to bail his secret kid out. \nAnd for a few minutes, life is good. Clint watches the girl begin to sketch a drawing of someone who looks suspitiously like him. He listens to the teacher try and explain some obscure calculous topic. He waits for Peter to return from wherever he's disappeared to with his backpack.\nThen the vents creak from somewhere in front of him. Clint freezes.\n“Don’t you know it’s dangerous to spy on Stark Industries Interns?” comes an unnaturally raspy voice from somewhere in the crawlspace in front of him.\nClint raises his eyes from the vent slowly.\nDamn it. Of course. Of course this fucking kid called in Spiderman as backup. Because why would the universe want a simple in and out opp to be easy.\nJesus. \n“Don’t you know it’s dangerous to go sneaking around vents if you’re not a certified vent repair man?” whispers Clint back.\n“What are you doing here?” Spiderman rasps.\n“What’s wrong with your voice?”\n“Karen, cut interrogation mode,” Spiderman hisses. “Look, man, I don’t want to have to get Mr. Stark involved.”\n“You sound familiar,” Clint says suspiciously. The vent wavers suspiciously underneath him, and he realizes suddenly that the crawlspace was not meant to support two fully-grown men.\nSpiderman, however, seems a bit slow on the uptake.\n“You can’t be here,” he says. “Just . . . you have to go, okay?”\n“We both have to go,” says Clint, trying to scoot backwards. “We have to get out of here, like, yesterday, how much do you weigh?”\nThe eyes of the Spiderman suit widen angrily. “You can’t just ask people how much they weigh.”\n“I can if I’m trapped in structurally unsound—,”\n\nCreak.\n\nAnd suddenly the ceiling is falling.\nYears of training kick immediately. Clint reaches out to try and grab Spiderman; perhaps to drag him out of harm’s way. But Spiderman is stuck to what’s left of the ceiling, and falling fast. Clint reaches out and looses his balance, too, and suddenly they’re on the floor of the classroom, looking up past twenty confused faces into a hole in the ceiling.\n“Um,” says Clint. Spiderman groans and brushes some ceiling debris off of his hands. \nThe teacher is hyperventilating, staring at him with wide eyes. The Asian Kid is trying to hide his laughter behind his hands. \nMJ is the only one who looks unbothered. She brushes some ceiling debris off her desk and goes back to drawing in her sketch book.\n“Hey, Nathaniel,” she says.\n“Um, yes,” says Clint. “I am the ceiling inspector. We have received reports that the ceiling was structurally unsound—,”\n“Holy shit, is that Hawkeye?” asks some douchey kid with slicked back hair and a Nirvana tee-shirt. “Wait, that’s Spiderman. You totally carjacked me!” \nSpiderman winces.\n“I’m . . . um . . . helping the ceiling inspector,” he says haltingly. Clint makes a point to ask Nat to give him a hand with his lying, because it’s pretty terrible. \n“The ceiling was fine,” says the teacher faintly. “I mean, until you two crashed through it.”\nClint points at it, eyes wide.\n“Water damage,” he says firmly. “Tony Stark will be paying for that.”\n“Tony Stark will never find out about this,” says Spiderman firmly, getting to his feet. His voice is once again low and raspy.\nAnd then, suddenly, Clint understands.\nOh.\nOh.\n \n(Later, when Natasha asks how he met Peter, he tells her she doesn’t want to know. Plausable deniability, and all that.)\nTony really shouldn’t leave the room—it’s the first time all of the Avengers have been together since the split. It’s definitely not a happy reunion—the underlying tension in their conference room is enough to make him want to get a drink, regardless of his status as a recovering alcoholic.\nHell, this meeting is such a big deal even Thor and Bruce decided to make a guest star appearance. Sure, that was completely coincidental, and there’s a hole in Tony’s backyard with an Asgaurdian crest burned into the ground. But their presence is probably the only thing keeping Tony from trying to beat Roger’s head in, so. \nAnyway, the meeting is super important. It involves the signing of the modified accords, the abolishment of the “war criminal” status, and residency treaties—which pretty much means they’re moving back into the compound, but whatever. Tony has a mansion upstate, it’s not like it matters that he’s officially a landlord again.\n“We should talk about Barns,” Natasha says, her voice cutting through the cold silence of the room.\nBruce shifts slightly, well aware that the tension in the room has gone up about thirty percent. The only sound is the scratching of pens on paper.\n“Do I even want to know-,”\n“I’ll fill you in later,” Tony says abruptly. He ignores Natasha and makes eye contact with Rogers. It takes every ounce of control in his body not to spew an avalanche of quipping insults. “Where is he?”\nRogers doesn’t break eye contact. “Safe,” he says smoothly, in that aggravating I-know-best tone.\n“What?” snarls Tony. “Is trust not a too-way street?”\n“You should not let petty squabbles get in the way of brotherhood,” Thor says wisely. “In the past year, Loki and I have gotten closer than I would’ve thought possible. True, he tried to sell me to this creepy old man who I’m fairly certain he was having intimate relations with, but I stuck a Taser on his back and now we’re stronger than ever.”\nTony raises a finger. “Believe me, we are going to come back to that story, but we have pressing-,”\nThat’s when his watch buzzes and flashes red and blue, the colors he reserves solely for Peter Parker. And shit, if that isn’t enough to make his blood pressure go through the roof.\nHe stands up so fast his chair is knocked over. “I have to go. Rhodey, can you handle this?”\n“What?” Rogers says. He stands up too. “Really, Tony? Is now the time-,”\n“It’s urgent,” Tony says, and in half a second the nanotech is spreading over his body, coating him with a layer of red metal. He rushes towards the window, which Friday swings open for him manually.\nRhodes reaches out and grabs his arm. Tony glances back—everyone in the room is staring at him, completely nonplussed. Natasha has two guns out, as if she expects him to declare that the Battle of New York is resuming.\n“Tony,” Rhodes hisses. “This is bad, even for you. You can’t just leave us here—,”\n“It’s my kid,” he fumbles, the ‘my’ slipping out before he can stop it. Raw panic is engraved in every word, because they’re wasting precious time. “Something’s wrong, I . . . I have to get to the city now.”\n“Peter?” asks Natasha, standing up quickly. Wanda stands too, biting her lip, her fingers glowing red. \nRhodey lets go of his arm, and Tony can see the panic in his own eyes reflected in Rodey’s face. He’s knows Peter, has even hung out with them sometimes on days when Peter’s come over after school to work with Tony in the lab. Rhodey likes Peter.\nTony doubts you can meet Peter and not love him instantly, but maybe he’s biased.\n“Do you need us to go?”\n“Stay,” says Tony firmly, already halfway out the window. “I’ve got this.”\nIt takes approximately ten minutes for him to fly at top speed from upstate to the city, and while he does he pulls up Peter’s vitals. \nHe monitors them through a watch on Peter’s wrist. He’s not entirely sure if Peter knows just how much the watch keeps tabs on him, but Peter’s smart enough to know that Tony didn’t just give it to him for the aesthetic appeal.\nAs far as Tony can tell, nothing’s wrong. There’s no elevated heart rate or high blood pressure; Peter hasn’t even been in the suit for three days. Peter isn’t picking up his phone, but it’s a shitty, cracked cheap Android that’s about four years old. \nTony wouldn’t be surprised if the phone committed suicide because it was so sad about its terrible quality.\n“Ok, Friday,” Tony says, just a little irritated. “If there’s nothing wrong with him, why did you give me a code Spandex?”\n“Peter’s blood alcohol content is currently at .8,” Friday says mildly.\nTony stops, actually stops in midair, hovering over some part of upstate New York, and lets a feeling of absolute horror wash over him.\n“What?” he says.\n“It isn’t as drastic as it sounds,” Friday says. “With his enhanced metabolism, the substance should be out of his system within the next few hours. But I thought it best to inform you . . .”\n“Call May,” Tony says through gritted teeth, resuming his flight towards Queens.\n“Calling May Parker.”\nTony hasn’t fully decided what to say by the time the line clicks and May Parker answers with a concerned, “Hello?”\n“May,” Tony says, smiling the panic away even though she can’t see him. “How are you on this lovely night? Listen, I want to talk to Peter about some suit upgrades, but he doesn’t seem to be answering his phone. Can you put him on?”\n“Oh,” May says, and gives a little laugh. “No, I can’t, actually. I dropped him and Ned off at another party in the suburbs about an hour ago. I can take a message, if you want.”\nTony digests that little piece of trivia for a second, and then decides to pry.\n“A suburb party?” Tony says casually. “Hey, I remember those. Aren’t you worried about the underage drinking?”\nHe knows he’s being blunt, but May just laughs.\n“This is Peter we’re talking about,” she says. “Besides, he knows how I feel. I’m fine with him experimenting, or whatever; I mean, kids do it whether or not their parents approve. I just want him to be in the house while he’s messing around, you know?”\n“Yeah,” says Tony, his throat tight.\n“Boss,” Friday says urgently in his ear. “Peter’s pulse has dramatically increased by over 200 beats per minute. He has left the party and is currently heading down Westmark Street.”\nShit, Tony thinks. He should let May handle this, it’s not his place. He should let her know that Peter has a ridiculously high BAC, turn around, and fly back to the Tower so he can breathe down Rogers’ neck until he gets his John Hancock. It’s the right thing to do.\n“Hey, do you mind if I pick Peter up?” he asks, because he’s never been good at removing himself from situations he should have no part in. “I really need to go over some of these upgrades with him. He can stay at the compound overnight, I don’t care.”\nMay pauses for a second, thinking it over.\n“He’d like that,” she says finally. “And it works out nicely. I have a night shift at the hospital, Ms. Leeds was intending to drive him home.”\n“Perfect,” says Tony. “Thank you, Ms. Parker.”\n“May,” she says firmly. “I’ll see you tomorrow, then? When you drop him off.”\n“See you then.”\nFriday ends the call without being prompted, and pulls up Peter’s location again. He’s stopped moving, now firmly centered in a park on the Upper West Side. Tony has Friday text Happy to meet him at the park with a car.\nAren’t you supposed to be in some meeting right now? Happy texts back.\nTony doesn’t reply.\n\nPepper’s going to be pissed. Happy writes a second later.\nIt's Peter, Tony writes.\nHe gets three letters back. Omw.\n\n\nTony lands in a clearing at the edge of the park and exits the suit. The nanotech recedes back into his chest, and he whips on a pair of sunglasses and puts on what he hopes is an authoritative grimace.\n\n\n\nHe finds Peter on the swings. Anger hits Tony like a whip, red and hot.\n\n\n\n\n“This time, on Peter screws the pooch . . .”\n\n\n\n\nIt would be almost funny, if it weren’t so pathetic. Peter whips around and almost falls off the swing, his hands whipping out at the last possible second to grab the chains.\n\n\n\n\n“Misser S’ark!”\n\n\n\n\n“Hey, Pete,” says Tony, sliding down on the swing to the right of Peter. “How’s it going? It’s a fantastic night to get totally wasted, I’ll give you that.”\n\n\n\n\nPeter wavers slightly, staring fixedly at a spot a good six inches to the left of Tony’s face.\n\n\n\n\n“Science,” he says helpfully.\n\n\n\n\n“Excuse me?” says Tony. He’s pissed and he’s got all the time in the world, and like hell he’s going to let Peter get off easily.\n\n\n\n\n“Science,” Peter repeats. He sways slightly. “Wanted to see if I could. Drunk. Drink. I can.”\n\n\n\n\n“Wait,” Tony says, holding up a hand. “I’m sorry, pause. Are you actually trying to tell me that you somehow got your BAC up to .8 for a goddamn science experiment?”\n\n\n\n\nPeter shrugs.\n\n\n\n\n“No,” says Tony, rubbing his hand over his eyes. “I can’t deal with this, Parker. I can’t deal with a drunk teenager. I lied to your Aunt for you, I figured you were having some . . . some mid-childhood crisis and were in need of a supportive—,”\n\n\n\n\n“Flat earth!”\n\n\n\n\nTony breaks off and stares at him, not sure whether to laugh or fly into a towering rage.\n\n\n\n\nPeter hesitates at Tony’s expression. “Flat earth,” he repeats, his voice significantly smaller. “Flat earthers . . . they’re fat shaming the earth. Isssnot right, Mr. S’ark.”\n\n\n\n\nTony sits in stony silence for a full thirty seconds before he officially gives up.\n\n\n\n\n“Alright,” he says through gritted teeth. “I’ve had enough. Let’s get you back to the—,”\n\n\n\n\n“Tony?”\n\n\n\n\nTony is on his feet in an instant, a gauntlet spread over his hand. He can’t see very well, not out into the darkened playground, but that better not be who he thinks it is. \n\n\n\n\nBecause if it is . . . \n\n\n\n\nOf course it is. Steve emerges from the shadows, arms held up in surrender, eyeing Peter with an intrigued curiosity.\n\n\n\n\nThe muscles in Tony’s hand flex subconsciously, and the gauntlet goes off. The blast hits Steve squarely in the chest. Not hard enough to make him fall, but it gives him the message. Stay where you are.\n\n\n\n\n“You followed me?” snarls Tony.\n\n\n\n\nSteve raises his hands in surrender. He doesn’t try to come any closer, but his eyes do drift over to Peter.\n\n\n\n\n“Eyes on me, Rogers,” says Tony, malice laced through every syllable. \n\n\n\n\n“I’m sorry, Tony,” says Rogers. His blue eyes are wide, and unnecessarily sincere. “I thought you might need backup. You seemed so freaked out. I only wanted to make sure you were okay.”\n\n\n\n\n“If I’d wanted backup, I would’ve asked Rhodey to come with me,” hisses Tony. “Or Natasha. Hell, Clint Barton would probably be above you on the list, and he annoys the shit out of me.”\n\n\n\n\n“Misser S’ark!” says Peter excitedly, a little slow on the uptake. “Misser S’ark, tha’s Captain America.”\n\n\n\n\nSteve’s eyes widen slightly.\n\n\n\n\n“He’s drunk,” says Tony coldly. “And before you get all 'alcohol is the seventh sin' on me, I'm going to remind you that you're still technically a war criminal and therefore your opinion is invalid.”\n\n\n\n\n“Flat earth,” says Peter distantly. “Science.”\n\n\n\n\n\"I'm not judging him. Or you,\" adds Rogers quickly. \"I'm a little taken aback, Tony, but I'll be the first to admit-,\"\n\n\n\n\n“You know what, this is actually a pretty good punishment,” says Tony. “First time he drinks, Captain America shows up to smite him for his poor judgement. I dig it.”\n\n\n\n\n“He’s already tol’ me that drugs and alcohol are anti-American,” slurs Peter.\n\n\n\n\nTony stiffens slightly, but Rogers looks just as baffled as Tony feels.\n\n\n\n\n“I’m sorry,” says Tony, his voice tight. “Have you two met before? And I want you to think very, very hard before you answer, Rogers, because this is my kid and if I find out you’ve been corrupting him in secret. . .”\n\n\n\n\n“Tony, I swear,” says Steve earnestly. “I only came tonight because I thought you might be in trouble. I would never—,”\n\n\n\n\n“So. The peer pressure is gettin’ to you,” mumbles Peter.\n\n\n\n\nSteve freezes.\n\n\n\n\nTony glances back and forth between them, his eyebrows raised. His hands are clenched into fists at his sides, and he’s shaking slightly.\n\n\n\n\nWanda? Fine. Natasha? Alright, Tony couldn’t have hidden Peter from her if he’d tried. Clint was a bit of a wild card, but Tony can swallow that bitter taste because Clint is a good agent. But the idea of Steve meeting Peter without Tony’s consent? Tony’s not sure he can deal with that.\n\n\n\n\n“Explain,” he says, his voice tight.\n\n\n\n\nPeter seems to know how angry he is, and backtracks immediately. “It’s a . . . a PSA. They show them in school all the time. For detention an’ drinking an’ . . . an’ sex-ed and stuff.”\n\n\n\n\nIt’s almost comical, how miserable Steve looks.\n\n\n\n\nLuckily for him, Happy pulls up at that exact moment. Tony points a firm finger at him, says, “This is not over, Rogers. Believe me, we will be revisiting this,” and pours Peter into the car.\n\n\n\n\n \n\n\n\n\n---\n\n\n\n\n \n\n\n\n\n“I’m sorry, Mr. Stark,” says Peter, half an hour later, as the car pulls up to the tower. He’s metabolized the alcohol, for the most part, and he’ll be fine as soon as he sleeps it off.\n\n\n\n\n“Kid, I will legitimately buy you any kind of alcohol you want if you tell me more about those PSAs.”\n\n\n\n\n“Tony!” says Happy sharply, but Tony doesn’t care. He’s joking; of course he is. And after Peter sleeps it off, they’re going to be having a long talk about what qualifies as a science experiment. \n\n\n\n\nBut for now?\n\n\n\n\n“Friday, tell everyone to meet me in the home theater after I tuck spider-baby into bed,” says Tony, unable to keep the glee out of his voice. “I’ve found some videos I think they might enjoy.”\n\n\nThere’s this rumor going around that drowning is peaceful.\nAllegedly, after your lungs fill up with water and you surrender control, it’s actually a pretty easy way to go. Not pleasant, by any means, but nothing terribly traumatic either.\nTony can confirm (0/10, would not recommend) that the aforementioned rumor is complete and absolute bullshit.\nHe doesn’t really like to think about the terrorist cell in Afghanistan. While ranking all the things in life that have fucked him up (starting with the wormhole and including Howard, Rhodey falling out of the sky, Sokovia, and pretty much every other major life event since birth) being water boarded definantly is in the top five Most Traumatic Things.\nHe can still remember the feeling of helplessness. The hands behind his neck, forcing his head down into the basin of water. They weren’t interrogating him. They just wanted him to know that they had complete and total control.\nMaybe it wasn’t pleasant for him because his lungs never really “filled” with water. Because when the water was Tony’s reality, in his lungs and eyes and ears, they would pull him out, and he would briefly remember what it felt like to be able to breath.\nHe’d be perfectly happy to never have to experience that feeling again. Unfortunately, luck has never been on his side.\nHis day starts out normal. He wakes up next to Pepper. Makes breakfast for her in his Spiderman tee-shirt. Showers. \n“You have two meetings today, one with shareholders and the other with Ross,” Pepper informs him, giving him a peck on her way out. “If you miss either of them, I will personally see to it that you are castrated.”\nTony hands her toast and promises to be a good boy.\nHe never shows up to either meeting.\nIt’s about ten when he gets the alert that Peter is in the suit. The alert pops up suddenly on all the screens in Tony’s lab simultaneously, made urgent by the fact that Peter’s vitals are off the charts. His blood pressure is insanely high, and Tony is concerned if his heart rate gets any higher he’ll have a heart attack.\nImmediately, he grabs the nearest helmet to him and pulls it over his head. He opens his mouth, ready to demand that Friday call Peter, but he never gets the chance.\nPeter calls him first.\nIt says a lot about Friday that she doesn’t even have to ask before she puts him through. Friday’s scan lets Tony know that Peter’s on the roof of his school.\n“It went through,” Peter chokes out. There are tears streaked down his face, and he’s practically hyperventilating. “I didn’t think it was going to.”\n“Pete?” Tony says, and he can’t keep the panic out of his voice. \n“I had to sneak out of the window of math class to get here. I’m pretty sure some kids saw me climb up the wall with my backpack, but—,”\n“Fill me in,” says Tony. There’s a pain in his chest that feels suspiciously like his heart repeatedly throwing itself against his rib cage.\n“Shots,” Peter chokes out. “Four so far. Someone has a gun, Tony.”\nIt would be funny, if it weren’t so terrifying. Tony doesn’t quite comprehend any of it, but the word ‘Tony’ resonates in a way that nothing else does. He’s suit is around him before he can quite comprehend what’s happening, and he’s crashed out of the skylight before Friday has time to open it.\n“Gun,” Tony says distantly. “But . . . but aren’t you at . . .”\nThe word ‘school’ dies on his tongue.\nAnd then he’s drowning again, and the water is everywhere. It’s streaming down his face before he can stop it, the blind panic giving way to a cool, dull sense of shock. The water hits his mouth, and he realizes distantly that it’s salty.\n“—signal blockers,” he can hear Peter saying distantly. “Wifi went down first, then the cell service . . . no one can make calls from inside. Tony, can you—,”\nFriday is on it before Tony has time to blink. She’s notified everyone from the police to the FBI to the CIA to what’s left of Shield before Tony’s even had time to register what she’s doing.\n“Alright, Pete,” says Tony distantly, but it’s as though he’s still under water. “You’ve done fantastic, alright? Sit tight, I’m on my way. I’m about twenty-five minutes out still, goddamn it, Friday, can’t this thing go any faster?”\n“Mr. Stark.”\n“But whatever you do, do not go back in that building. Peter, I swear to god—,”\n“Mr. Stark.”\n“—if you go back in that building I will make sure you—,”\n“Mr. Stark.”\n“What.”\nPeter is crying again. “You have to tell May that I love her. Please.”\nOne of the things they don’t tell you about drowning is how hard it is to hear. When underwater, the only reality is the burning in the chest and eyes.\n“No,” Tony fumbles. “Pete—,”\n“I’ve handled worse than a kid with a gun,” Peter says. “Mr. Stark, Ned is down there. MJ. Hell, even Flash is somewhere in this building and none of them have Spiderman. I do.”\nTony tries to tell Peter to stop being stupid, but the only noise that comes out of his mouth is a sort of choked gagging.\n“But in case I—,” Peter breaks off. “Promise you’ll tell May.”\n“Peter—,”\n“Promise.”\n“I swear to god, if you go back in side that building—,”\n“Tony. Please.”\nTony wishes that he could give in and let the water take him. That his lungs would fill up and he’d just have peaceful nothingness. \nBut he can’t afford that. Not now.\n“I promise.”\nSpiderman swings himself over the edge of the roof and crawls back through the window. Tony can here the gasps of surprise, and then the line goes dead.\n“Friday,” says Tony. For some reason, his voice sounds different. He can’t put his finger on it. “Get me everything you can on those signal blockers. Get me everything you can on the shooter, too. I want you to hack feeds, go into school security records, whatever it takes.”\n“On it, boss.”\n“And pull up the Avengers’ group chat.”\nThe chat hasn’t been used since 2016. On July 8th, Clint texted in a bunch of pictures of a cat with a cheeseburger, and Nat got into a hot chocolate vs coffee debate with Rhodes. On July 9th, Rhodey texted Ross is here. Briefing room. Now. \nOn July 10th, 2016, Tony texted Anyone seen our American Idol lying around?\nNo one has texted anything since. Tony shoves down his displeasure about being reduced to double-texting and hits send.\n[sent 10:21 am] Anyone in the city: Midtown high is having a school shooting. \n[sent 10:21 am] It’s Peter’s school. Please hurry. I’m still 20 minutes out.\nNo one responds. Tony hopes that means they’re all busy getting on it.\nTony must black out for a little after that, because the next thing he knows he’s at the school.\nIt reminds him eerily of a war zone. Cops and bucars have surrounded the school. There are ambulances regularly stationed, and SWAT teams are bringing out pools of students. \nThere’s also a fucking media team filming the whole thing, which would make Tony fucking livid if his brain could form any thought but Peter.\nSteve is waiting for him in the center of the courtyard. The cops, media, and students hurrying from one place to another steer clear of him.\nTony lands in front of him.\n“Why aren’t you in there?”\nIt’s as if all the tension and hostility that’s been buried under the surface reaches a breaking point. Distantly, Tony registers the various media focusing their cameras on him and Steve, but he’s too pissed to give a fuck. \nSteve doesn’t move.\n“Get out of the way, Rogers.”\nIt’s the most dangerous he’s ever sounded. The metal around his face amplifies the harshness of the words, and Steve looks away.\n“We both know I can’t do that, Tony.”\n“My fucking kid is in there!” Tony yells.\n“If you go in there, guns blazing, blinded by rage and fear, people are going to get hurt,” says Steve. His voice is deadly calm. “Nat will be able to shut this down before it starts. Clint says he knows this school’s ventilation system like the back of his hand. They’re both already inside. Stand down, Tony.”\n“You lost the authority to give me orders when you left me to die,” Tony snarls, and his voice breaks. “Right, I’ve had enough of this.”\nHe raises his gauntlet, ready to blast Steve into a pile of red and blue sprinkles. Rockets pop out of the plates in his shoulders.\nSteve doesn’t move. His expression doesn’t shift, but a tear traces its way down his face.\nIt’s enough to make Tony hesitate. Because this is a man who grew up during the pinnacle of toxic masculinity. This is the man who watched his friends die in an open war zone, who learned to shut down and hide any and all insecurity, because Captains can’t afford to show weakness.\n“Tony,” says Steve. “Men like you and me leave collateral damage wherever we go. This is a school; there are kids still in there. Kids just as innocent as Peter. Hell, as . . . deranged as the shooter is, he’s probably a kid, too. You and me cannot afford to go in there.”\nThere’s a moment of stillness around the courtyard, when everything and everyone fall silent. Yeah, there’s still the hustle of extraction teams bringing out pools of students. But the parametics, and the media with their cameras, and students who are already out fall silent, watching Steve and Tony.\n“He’s . . .” Tony breaths heavily, but Friday puts the rocket launchers back in his suit without prompting. “He’s my kid, Rogers. He’s the future of my company and the future of the Avengers, but even more then that . . . he’s my kid. I can’t . . . I can’t just . . .”\n“I know,” says Steve.\nAnd suddenly Tony is stumbling forward, out of the suit, and Steve is there to catch him. Tony’s not entirely sure who’s wrapping their arms around who, but his head is on Steve’s chest and Steve’s heart is beating wildly and . . . \n. . . and Tony lets the water take him.\n“Found the shooter,” Natasha’s voice echoes through Steve’s earpiece.\nTony only hears because he’s pressed so tightly into Steve’s chest, and at once he snatches the comm out of Steve’s right ear.\n“Peter,” he gasps into the comm. “Is he there?”\n“The shooter is webbed up,” Clint says, and Tony can hear him giving orders to the cops on the other end of the line. In a second, he’s back on. “No sign of Peter. But . . .”\n“What?” Tony demands harshly. He makes a move towards the doors, and Steve puts a hand on his chest. Clint doesn’t respond. “Nat, tell me what’s going on in there.”\n“There’s a lot of blood,” Nat’s voice says, almost apathetically. But there’s a waver in it that Tony has never heard before. “It’s not the shooters.”\nTony loses an additional bit of sanity he didn’t know he still had.\nThe front doors of the school open, and a paramedic comes out.\nTony doesn’t even completely register the blue and red body the medic is half carrying before he’s running. The paramedic has one hand around Peter’s waist, supporting him, and the other is pressing a blood stained cloth to the wound in Peter’s side.\nPeter is pressing an oxygen mask to his face.\nHis bare face.\nHis maskless, tear-strained, barely-able-to-breath, maskless, maskless, maskless face.\nMaskless.\nTony has an Iron Man helmet draped over Peter’s head and hand as soon as he reaches him, but it’s too late. The damage is done. Tony can see the knowledge, the identity reflected in the face of Peter’s classmates. \nThe kid who Tony distantly reconizes as the little shit who bullies Peter is white. His lips move, but he doesn't seem to be able to produce sound. Teachers and classmates alike stare in bemused disbelief. A shiver runs through the police and medics. An (admittedly small) number of reporters have the fucking human decency to lower their cameras.\nFor the first time, Tony registers just how many live-streams have been trained on him since his arrival.\nFuck. Fuck fuck fuck fuck fuck fuck fuck fu—\n“I’m sorry,” Peter whispers, and suddenly his arms are wrapped around Tony’s neck. Tony shudders slightly, automatically taking the blood stained cloth from the medic and pressing it into Peter’s side. Peter hisses slightly, but doesn’t protest.\n“Don’t apologize,” Tony says automatically.\n“The mask,” Peter says, his voice hollow. “I took it off to . . . to try and reason with him, show my humanity, y’know. And then I got shot and I guess I forgot and . . . and I’ve really fucked up this time, haven’t I?”\nTony doesn’t have time to respond, because a first responder rushes forward to try and take Peter away from him. Tony doesn’t’ have to shove him aside, though, because Steve is there, pushing everyone away from them.\nTony has never been more appreciative in his entire life.\n“He needs treatment,” Tony hears a medic say.\n“We treat our own,” says Nat’s voice from somewhere behind him, and he realizes suddenly that she and Clint are flanking him.\n“Team unity doesn’t pull out bullets!” the medic says.\n“And hopes and prayers don’t stop them,” snaps Tony, hoping the camera catches it because it’s an admittedly badass line. “But you know who does pull out bullets? Bruce Banner. And he’s the only doctor who’s I'm letting go near my kid, so fuck off.” \nPeter’s body shudders slightly as he leans into Tony. The bullet wound in his side is bleeding steadily, but it doesn’t appear to be life threatening.\nRhodey is pulling into the parking lot when they get there.\n Wanda hops out of the black military van. Her eyes well with tears as she runs to Peter. She gently takes him from Tony, red tendrils of magic swirling around them as she helps him into the car.\n“Ned and MJ?” she asks him tenderly, her face carefully blank.\n“They’re both okay, they had Econ in one of the portables,” Peter says, his voice shaking. “Some shots went off, some people were injured and stuff, but as far as I can tell there aren’t going to be any casualties. I hope.” \n“Thanks for the ride,” says Tony, his voice dull, as he slides in next to Peter.\nRhodey’s face is blank. “We were in the neighborhood,” he deadpans. “Sorry we didn’t get here sooner.”\nClint trades seats with Tony so he can lean over Peter and start emergency field surgery; Tony’s hands are shaking too much to play chopsticks, let alone hold open his kid’s bullet wound so it doesn’t close up before Bruce operates.\n“You didn’t try to pull it out with your aunt’s eyebrow tweezers again, did you?” asks Rhodey.\nPeter lets out a shaky laugh. “No,” he says. “I learned my lesson.”\n“Then I’ll count today as a win,” says Rhodey.\nTony has thirty-six texts from Pepper. He only responds once.\n\nCall a press conference.\n\n“It will be tough to clean this up,” Nat says, reading the text over his shoulder.\nPeter’s eyes flutter closed.\n“It’s okay,” Tony says, but his words sound hollow even to his own ears. “It was bound to get out eventually.”\n“We can get ahead of it,” Steve says firmly. “His life doesn’t have to change too much. Maybe a security detail for him and his aunt—,”\n“They should move into the tower—,”\n“Peter, it’s going to be okay—,”\n“I just texted May, she’s freaking out but she’ll be fine, she’s going to meet us at the compound—,”\n“You did beautifully today, kiddo. I’m almost as proud as I am pissed—,”\n“Guys?” says Peter lamely, shifting slightly as Clint’s practiced hands dig into his skin. “Stop. Please.”\nIt’s almost funny, how quiet the car gets instantly.\n“I know it’s going to be okay,” Peter says, and his voice cracks slightly. Prepubescent strain, Tony wants to joke, but now doesn’t seem like the time. “I mean, obviously things are going to change.”\n“Obviously,” Wanda says, a slight smirk on her face. She raises her left hand and they touch pinkies. Damn inside jokes, thinks Tony. \nPeter’s eyes drift around the car. From Rhodey, through Nat, to Wanda, Clint, and Steve. They come to rest on Tony.\n“Thanks,” he says. “For being on my team. I really appreciate it, you guys.”\nAs cavity inducing as it is to see Nat purse her lips and look away, eyes damp, a distant thought drifts into Tony’s mind. A secret that came out during his fight with Steve that he’d subconsciously filed away for later.\n “Clint?” Tony asks. “What did Steve mean when he said you knew Midtown’s ventilation system like the back of your hand?”"
}