{
    "id": "15492474",
    "url": "https://archiveofourown.org/works/15492474?view_full_work=true",
    "author": [
        "Lp37451 (BirdieBats)"
    ],
    "title": "That Bridge was Burnt",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Multi"
    ],
    "fandoms": [
        "The Avengers (Marvel Movies)",
        "Doctor Strange (2016)",
        "Iron Man (Movies)",
        "Captain America (Movies)"
    ],
    "relationships": [
        "Tony Stark/Stephen Strange",
        "Carol Danvers/James \"Rhodey\" Rhodes",
        "Tony Stark & Avengers Team",
        "Scott Lang/Hope Van Dyne",
        "Tony Stark & Hope Van Dyne",
        "James \"Rhodey\" Rhodes & Tony Stark",
        "Peter Parker & Tony Stark",
        "Harley Keener & Tony Stark",
        "Wanda Maximoff/Vision"
    ],
    "characters": [
        "Tony Stark",
        "Stephen Strange",
        "Carol Danvers",
        "Peter Parker",
        "Harley Keener",
        "Hope Van Dyne",
        "Loki (Marvel)",
        "Thor (Marvel)",
        "Bruce Banner",
        "Steve Rogers",
        "Sam Wilson",
        "Scott Lang",
        "Natasha Romanov (Marvel)",
        "James \"Rhodey\" Rhodes",
        "Brunnhilde | Valkyrie (Marvel)",
        "Wanda Maximoff",
        "Vision (Marvel)",
        "Friday (Marvel)"
    ],
    "additional_tags": [
        "Reunion",
        "Civil War Team Iron Man",
        "Team Cap bashing",
        "Not Avengers: Infinity War Part 1 (Movie) Compliant",
        "Not Ant-Man (2015) Compliant",
        "Panic Attacks",
        "Not A Fix-It",
        "Nightmares",
        "Not Steve Rogers Friendly",
        "Not Wanda Maximoff Friendly",
        "Tony Stark Needs a Hug",
        "Stephen is gonna give him one",
        "Tony Stark Has Issues",
        "Bisexual Tony Stark",
        "Tony Stark favouritism",
        "Post-Spider-Man: Homecoming",
        "Iron Man Mark 50",
        "One-Sided Relationship",
        "Which is the Wanda/Vision btw"
    ],
    "language": "English",
    "series": "",
    "published": "2018-07-30",
    "completed": "2018-09-02",
    "words": "27,024",
    "chapters": "10/10",
    "comments": "483",
    "kudos": "9,860",
    "bookmarks": "2,105",
    "hits": "211,302",
    "summary": "<p>6 months after the Avengers Civil War the Rogue Avengers have been pardoned and are back at the compound. They didn't expect to see Tony had already recruited a whole new team.</p>\n<p>or</p>\n<p>Tony Stark didn't want the Rogues back however with threat on the horizon he, sadly, needed them. But just because they're back doesn't mean he has to be happy about it. </p>\n<p>or </p>\n<p>The Rogues are back, Tony doesn't care for them anymore but Stephen Strange and Tony Stark have a surprising amount in common.</p>\n<p>A meeting and Training.</p>",
    "notes": "<p>My first attempt at IronStrange. Please don't murder me if it's bad...<br>This chapter doesn't have any huge plot thing or whatever just the return of the Rogues. It will get more interesting (and more IronStrangey) as time wears on.<br>:)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Thanks so much for all the kudos and comments :) this story is getting much more popularity than I expected so here's another chapter:))))))</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>What did you think of how I wrote for Carol so far? I haven't really read many comics with her in them so I was mostly going off the internet... :) and don't worry Peter will get more protective of Tony soon he was just a bit surprised poor spidey :/</p>\n<p>Comment what you thought :D</p>\n<p>I decided to release this now even though its a bit shorter than the other chapters. Mostly since I wanted to give you guys some more before going to bed. The joys of waking up to your awesome comments in the morning. :)</p>\n<p>A couple of things that I'm not sure I made clear:<br>-Hope and Tony were childhood friends before their dads fell out and then they still were after but didn't see one another as often.<br>-Ragnarok happened completely the same as the movie but Thanos wasn't there at the end instead he was attacking Xandar.<br>-All of the New Avengers know about Siberia and Tony's Panic attack's/anxiety/PTSD/medication<br>-Tony was way more injured than he was in the MCU and actually in a coma for a couple of weeks which is part of the reason the New Avengers aren't that welcoming to the Rogues.<br>-The other reason is just that they don't really like them because of the Civil War fiasco</p>\n<p>Alright, enjoy the chapter!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>ARGH the IRONSTRANGE is too ADORABLE!<br>I love them so much *wipes away tear*</p>\n<p>That joke Harley made is their new 'connected' joke so expect it to crop up more often :)))<br>Don't worry fellow IronStrange shippers, there will be some fluff soon</p>\n<p>Please comment what you thought or if you have any questions/suggestions/general ideas and expect a new chapter most likely tomorrow! <br>:D</p>\n<p>You guys are the BEST! Your comments are all so kind and funny and just <br>A M A Z I N G!!! I literally had a fangirl heart attack while reading them XD<br>Hopefully, this chapter will answer most of your questions/requests...</p>\n<p>Also, some of the powers people have specifically Loki, Stephen and Carol are from the comics so they may seem more awesome than in the MCU. :)</p>\n<p>Enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>Another chapter done, phew that definitely didn't take a whole day of solid writing. :)</p>\n<p>What did you guys think of Captain Marvel being stronger than Thor sans Stormbreaker?<br>And what about Loki vs Dr Strange?</p>\n<p>Please leave comments/questions/requests! You guy's awesomeness is what got me to write this all so fast :))))<br>and the next chapter has more IronStrange fluffiness... Maybe even a certain declaration... *cackles in an evil and yet super gay fashion*</p>\n<p>Until Next time </p>\n<p>:D</p>\n<p>MORE AMAZING COMMENTS!!! You guys are just the best :D<br>Well here’s the next chapter with an extra serving of IronStrange fluff ;) Sorry if the actual romancy parts suck since I don’t really have that much experience in that area forever alone...</p>\n<p>Speaking of romance... I... being the idiot I am, forgot to mention that the Vision/Wanda thing is one-sided for Wanda because Vis is too adorable and nice for that fiend!</p>\n<p>Another thing, I finally got my hands on a Captain Marvel comic so Yay! It’s the ones from 2014 I think? anyway I got a new character from there... who I added cause why not! :)</p>\n<p>Anyway, on with the chapter! :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>So... What did you guys think? <br>Please leave me some comments/questions/requests for scenes or interactions or just in general requests<br>:D<br>Until next time</p>\n<p>YOU GUYS ARE AMAZING!!! Thank you again for such AWESOME and KIND comments!!! </p>\n<p>Finally, a new chapter is here now I have figured out how the hell I'll finish the fic :)</p>\n<p>Someone asked me if I'll add Riri. I finally got a comic with her in it but don't think I'll add her to this fic as it would be a bit random but she'll probably show up in some future fic I'll write.</p>\n<p>Hope you enjoy the chapter!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>Uh Oh, there's going to be some trouble now! :) </p>\n<p>Remember to comment what you thought and if you have any questions/comments/suggestions or anything!</p>\n<p>:)</p>\n<p>Again such AMAZING comments you guys! :)))))</p>\n<p>I'm going to TRY to have this fic done by next Sunday but school might be an asshole so no promises!</p>\n<p>Enjoy the chapter!</p>\n<p>WARNING: A bit of Homophobia in this chapter, mostly because Rogers is from the forties where all the gayness was in Berlin until the war so he kinda isn't used to that stuff. Or maybe I just want to cement the assholeyness that is Steve Rogers.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">more notes</a>.)\n</p>\n<p>Oh, those stupid idiots. Stealing an Infinity Stone? How thick can you get... *evil laugh*</p>\n<p>Also sorry if I wrote the bits about pain in a crappy way. Luckily I don't really have that much experience with Pain flare ups so if I somehow offended anyone then I'm sorry.</p>\n<p>If any of you guys read What has Happened Since (my DW fic) that is going to start up again after this fic is done :)</p>\n<p>Remember to comment what you thought or any questions/comments/concerns or whatever!</p>\n<p>3 chapters to go!!! </p>\n<p>:D</p>\n<p>Thank you guys again for your awesome feedback! :) I'm now on the second page of IronStrange fics sorted by kudos!!! I feel so fulfilled :))))))</p>\n<p>Here is the next chapter where the Rogues put their stupid ass plan into action so it's told exclusively from Steve and Clint's POV.</p>\n<p>Enjoy the chapter!<br>:)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">more notes</a>.)\n</p>\n<p>IM SORRY!!! <br>I know a lot of you thought that Wong would kick their asses but I need them to manage to just get away for the plot's sake. :( On the plus side, Wong injured Steve and knocked Wanda unconscious.<br>I'm so sorry Wong );</p>\n<p>I'll try and get the next chapter out on Friday and then the final chapter on Sunday and don't worry the more shit the Rogues do the more consequences, and they just hurt one of Stephen's best friends and stole his Infinity Stone so up the pissedness by 50%</p>\n<p>Remember to comment what you thought and if you have any comment's/questions/concerns or whatever! </p>\n<p>Thanks for Reading :)</p>\n<p>Thank you again for all the awesome comments! <br>Here's the second to last chapter, you're comments have inspired some of the things in this chapter and the next so thanks to those people who inspired me!!! :)<br>Enjoy the chapter!!!<br>:D</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">more notes</a>.)\n</p>\n<p>ONE CHAPTER LEFT!!!!<br>Looks like I will have a lot of writing to do tomorrow! XD<br>Remember to comment what you thought/any questions/suggestions for the final chapter or anything!!!</p>\n<p>Thanks for reading<br>:)</p>\n<p>OH MY GOD! THE FINAL CHAPTER!!!! :D<br>Thank you for all your comments guys! they were amazing and once again influenced some things in this chapter do thank you so much for commenting, and reading this fic, and just being so kind and amazing.</p>\n<p>Enjoy the chapter!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">more notes</a>.)\n</p>\n<p>So it's over then... A couple of people requested a sequel but I don't think that's going to happen, (sorry guys) I might do a one shot if there is a high demand and I can actually think of something to put in it but apart from that...</p>\n<p>If you want me to do a prompt then feel free to send one over and I'll check it out :) otherwise, I most likely will write several one-shots I have swimming in my mind and continue work on the fics I neglected to write this one (whoops)<br>If you want to send a prompt email me at <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"375b47040003020619515659515e54435e585977505a565e5b1954585a\">[email protected]</a></p>\n<p>Thank you again for reading this and for being so awesome, nice, and inspiring. Remember to keep being awesome and protect Tony Stark for his is the universe's most glorious creation.<br>I love you my readers<br>:)</p>\n<p>Hope you enjoyed!<br>A new chapter will be soon but in the meantime comment what you thought :)</p>",
    "text": "\nStephen watched Tony work over the top of his book. He was comfortably positioned on a sofa in the main lab in the Avengers Compound. As per usual Tony was working his ass off at a table nearby. Since Stephen had joined the New Avengers, kind of after all he still had his duties as sorcerer supreme but he helped out and joined in for the exercises, but he wasn’t really a member, Tony and he had become close friends. It had started with just the occasional meeting at the compound, then joining in on game nights, then hanging out together outside of the exercises, then, little by little, they had opened up to each other. It was refreshing to have someone to talk to about science considering that wasn’t exactly Wong’s forte. To talk to someone who had also experienced pain the way Stephen had. Chronic pain wasn’t exactly a common talking point among many. But Tony understood Stephen and Stephen understood Tony. When the magic world was having a quiet day Stephen would portal to the lab and he and Tony would just enjoy one another’s company. Maybe Stephen was enjoying it a little more than he should but that didn’t matter. Stephen checked the time. The Rogue Avengers would be arriving in 30 minutes, fully pardoned in all their assholey glory, Stephen was fantasising about giving Rogers the shit he deserved. But alas, he couldn’t, not in the way he wanted to anyway. \n\n\n“It’s almost time Tony.” Said Stephen softly. Tony froze at the words for a full second before continuing his work.\n\n\n“Well, it isn’t required that any of us meet them so I guess everything is fine.” Tony’s voice was strained and Stephen could sense the panic building in the man. \n\n\n“I guess so.” Several more minutes passed in silence before Tony spoke.\n\n\n“Are you sure the implant will work?” He turned to face Stephen, fingers gently tapping the Arc Reactor. “I’ve had enough of that witch in my mind, and having that out of the way will be a relief.” Stephen stood up, placed his book down on the cushion and moved over to the brunet. He narrowed his eyes slightly as a slightly shaky finger gently ran itself along the small, healing incision on Tony’s head. At the contact, Tony stiffened but slowly relaxed into the touch, as he normally did. \n\n\n“It should be fine, I did enchant it myself you know.” Stephen smiled, sliding his hands into the pockets of his jacket. “Besides as manager of all magic on Earth, I do have the option to limit her powers.” At the mention of magic, Tony rolled his eyes fondly, lip twitching slightly. This was their relationship, teasing, banter, silence, teasing, bragging, music, more teasing, and talking. There were soft footsteps down the flight of stairs leading to the lab, Tony turned startled at the sound, he then relaxed though at the sight of Hope entering the lab. \n\n\n“Hey Tony, Stephen.” She walked to where they were now standing. Leaning on the table littered with tools she continued. “Sadly, the \n\nothers \n\nwill be arriving shortly. The council thought at least one of us should meet with them as a show of good faith.” She snorted sceptically. “As if any \n\ngood faith \n\nexisted at this point. But since none of us is stupid I thought I should meet with them considering Carol is out with Rhodes doing god knows what, we don’t exactly want the kids near them alone, Thor, Bruce, and Loki are dealing with Asgardians which is understandable considering their recent arrival, and sorry Stephen but I’m probably the least likely to tear them limb from limb out of the two of us.” She sighed adding “I haven’t ruled it out though” under her breath. Tony nodded along, obviously grateful at the kindness.\n\n\n“Will Vision be meeting them with you?” Tony asked, failing miserably at any attempt he was making to keep his voice calm. \n\n\n“He was indifferent so I guess he may or may not show up.” Hope shrugged. “Honestly, I think they should be grateful anyone is greeting them at all.” Tony smiled slightly at that.\n\n\n‘Boss, they are here.’ \nFRIDAY said bitterly. Tony made an odd choking noise but Stephen took his hand and smiled comfortingly at him, which luckily seemed to calm Tony down slightly. Hope stood sighing,\n\n\n“I’ll go meet them then.”\n\n\n—\n\n\nHope walked stiffly up the stairs to the elevator, she really didn’t want to do this but no way was she making Tony greet those ungrateful bastards and Scott. To be honest, Hope had no idea how she felt about Scott, but that didn’t matter, there were more important Captain America shaped issues to deal with. Hope stood in front of the closed door to the main common area, she could already hear the voices on the other side, muffled by the walls. Hope sighed and put on an indifferent mask that she had gotten from being the daughter of Hank Pym and nodded to FRIDAY to open the door. \n\n\nEntering, all the conversation stopped, and she ignored the shocked look Scott was giving her, wide eyes, jaw hanging open, the whole lot, and stared icily at the group.\n\n\n“Hello, we were expecting Tony.” Said the oh so punchable face of Captain America. \n\n\n“Tony was unable to meet you today due to… recent personal issues.” That drew a snort from half the group, but Rogers looked slightly worried, which only infuriated Hope more.\n\n\n“What is it? Is he okay?” Hope’s jaw stiffened at the words from the super soldier. \n\n\n“That isn’t your business considering it is a \n\npersonal \n\nissue.”\n\n\n“So Stark is just being the usual asshole.” Hissed one of the group. Before Hope could retort Scott muttered.\n\n\n“Shut it, Clint.” To the offender. Scott was doing a cycle of staring at the floor, at her, and then at the floor again.\n\n\n“So anyway.” Said Rogers hurriedly, “I am Steve Rogers, that’s Clint Barton, Wanda Maximoff, Natasha Romanoff, Sam Wilson, and Scott Lang.” Hope raised an eyebrow slightly, not even looking at his outstretched hand.\n\n\n“I know.” \n\nUnfortunately, \n\n“Hope Van Dyne,” she introduced. At the remark, Rogers looked slightly surprised. \n\n\n“How could you know?” He’s asked, Hope had to hold back an eye roll.\n\n\n“Well obviously it couldn’t be because you’re all famous, and my father made Scott his suit.” That first made Rogers redden and then look even more shocked. “Well unless you want to be perfectly honest and say that Scott stole the suit from my father causing an extensive investigation into whether or not we were, or had contact with, known terrorists.” The expression on their faces was almost amusing, a mix of both shock and outrage at the terrorist comment. Hope almost smiled. \n\n\n“Hope, I am so, so, sorry. I didn’t mean for that to happen.” Scott said looking horrified.\n\n\n“Sure you didn’t.” She said crisply. \n\n\n“There goes Stark, ruining even more people’s lives with his whole intent to break down the Avengers.” Muttered Wanda. Hope rounded on her fury in her eyes. \n\n\n“Yes, it definitely wasn’t your fault for recruiting Scott and making him steal the suit in the first place.” She said sarcastically. “For your information, it is because of Tony that my father and I aren’t still on the run considering his frankly alarming defence of us especially considering he had only woken up from the state \n\nyou \n\nleft him in two days prior.” Hope breathed deeply, collecting herself and ignoring the stunned silence from her outburst. “But I guess that’s what real friends do for each other.” She finished sweetly.\n\n\n“I-I…” sputtered Rogers. Luckily at that moment, Vision walked in. At the sight of the group his face quickly turned expressionless. \n\n\n“Viz?” Smiled Wanda starting to move forwards towards him.\n\n\n“Miss Maximoff.” He replied curtly before going to stand next to Hope. \n\n\n“Almost done” Hope sighed running a hand through her dark hair. \n\n\n“Would you like me to finish for you?” Asked Vision, almost completely ignoring the Rogues.\n\n\n“Thanks, Viz.” Hope smiled. Visions smiled slightly back before turning to the others.\n\n\n“Due to relatively recent damage to multiple floors in the Compound.” Wanda winced at that, still obviously heartbroken at the cold shoulder. “Your new rooms are located on the East Wing, you are all prohibited from the West Wing lacking invitation, where the other Avengers are staying.” Vision continued interrupting whatever tirade was about to happen as Clint opened his mouth furiously, “FRIDAY is no longer available to you upon your beck and call. Only the people whitelisted are allowed to communicate freely with her and none of you is on that list.” Rogers interrupted at that.\n\n\n“But what if we want to talk to one of you?”\n\n\n“If you wish to communicate with the Avengers individually you may message them via your StarkPhones which are awaiting you in your rooms. Response may not occur though.” Most of them, minus Scott who was still following the cycle of looking at the floor then at Hope, looked outraged at that. Any meeting’s or training sessions will be communicated via your StarkPhones as well. All are required and not showing up without council approved absence will mean instant termination of your probationary period. Your rooms are that way.” Vision pointed down a hall. Then without another word to the Rogues, they headed back through the door to the West Wing, leaving silence behind them. \n\n\n--\n\n\n“Well that went well,” said Clint sarcastically. Steve turned to the others a shocked expression still on his face. He saw most of them looked either awkward or angry. Scott was staring at the door Hope and Vision had left through with an odd expression on his face. \n\n\n“Who does Stark think he is?” growled Wanda, hands glowing slightly. She looked hurt and angry. \n\n\n“I’m sure it’s just Stark’s influence making Vision act that way.” comforted Clint. \n\n\n“But he’s keeping us out of half the compound!” she hissed at the group.\n\n\n“He thinks he’s the owner of the Avengers Initiative and well the most important person in the world.” sighed Sam tiredly. Steve sighed too, then placed his bag by the door and sat at the counter by the kitchen. The others followed behind except for Natasha who went and stood on the other side of the counter. \n\n\n“He’s playing the long game, Stark is just hiding and sulking, waiting for us to beg his forgiveness.” Clint muttered, “like that’s going to happen.”\n\n\n“But Hope said it was a personal problem,” said Scott uncertainty. “I know her and she wouldn’t lie. Well, she might’ve once but most of the time she wouldn’t lie.” Sam snorted.\n\n\n“No offence man but she didn’t seem overjoyed by the sight of you.” Scott looked down again and then back at the door. \n\n\n“Well this place looks not that different,” said Steve in a feeble attempt to change the subject. \n\n\n“Except it does. Tasha, I’m starved can you check the cupboards?” Clint groaned, rubbing his face with his hands. Natasha turned and began to rifle through the cupboards. \n\n\n“There’s not much except coffee, more coffee, even more, coffee, some crackers, pop tarts and whatever’s in this bo-” she suddenly froze as she opened the box.\n\n\n“What is it?” asked Wanda now intrigued.\n\n\n“Nothing,” Natasha replied, calmly placing the box back into the cupboard. Clint moved quickly next to her and grabbed the box.\n\n\n“Clint, we really shouldn’t” she hissed but Clint ignored her bringing the box back to the counter. Opening it the group all looked inside. Steve furrowed his brow, inside was a lot of cylindrical, orange box’s. \n\n\n“That’s a lot of pills,” said Sam picking up an orange box. “Doesn’t have a name.” he pulled the box towards him. \n\n\n“What kind are they?” asked Steve a sick feeling in his stomach.\n\n\n“Guys this doesn’t seem like a good idea…” said Scott standing up and taking a cautious step back. He glanced at Natasha who was leaning against the cupboards looking wary.\n\n\n“Well, there are some anti-depressants, anxiety meds, pain meds, and barely touched bottles of pills for insomnia.” At the end of Sam’s explanation, Clint gave a long whistle.\n\n\n“That’s a lot of drugs, I wonder who they’re for.” He looked at Natasha. “You know don’t you.” she didn’t respond and Clint continued to rummage through the box. He looked back up at Natasha and was about to say something when a glowing orange circle appeared in the room and a man stepped out.\n\n\n--\n\n\n‘Boss, you need to take your medication.’ \ninformed FRIDAY. Tony groaned and turned his chair again. Stephen looked back up from his book. \n\n\n“Where are they,” Tony grumbled ignoring the amused look Stephen was giving him.\n\n\n‘Yeah about that…’ \nFRIDAY began, \n‘they are in the main common area.’\n Tony froze.\n\n\n“And?” he whispered. \n\n\n‘The Rogues have not vacated the area.’\n Tony groaned, even more, breathing getting a bit faster at the point that FRIDAY was making. Stephen looked at him and Tony was surprised to say the man was smiling slightly.\n\n\n“Can I get them?” he asked, “I would love to freak them out completely by just portalling in there full wizard.” Tony couldn’t help grinning at the idea.\n\n\n“You are amazing.” Tony sighed smiling. “FRIDAY, make sure to get a picture of their reaction.” Stephen snickered and stood up. \n\n\n“Do you think the cloak would be a bit much?” Stephen questioned.\n\n\n“Maybe,” replied Tony. “We can freak them out with the cape another time.” at the despised word Stephen grimaced.\n\n\n“It’s a cloak, Tony.”\n\n\n“Whatever you say Gandalf.” Stephen smiled rolling his eyes then portalled out of the room to the Sanctum to get wizarded up.\n\n\n--\n\n\nAs Stephen stepped through the portal to the common room, an overly serious expression on his face he almost burst out laughing at the expression on the Rogues face as they saw him and got all defensive. Then Stephen noticed the box they had been looking at and his expression darkened. Without a word, he strode up, grabbed the box and pulled one of the pillboxes out of Wilson’s hand and ignored the words being shouted his way.\n\n\n“You can’t take that it’s not yours!” Stephen just had to stop at the absurd words said by Rogers.\n\n\n“That’s rich coming from you,” Stephen replied with a calm anger. He didn’t even have to turn to sense the knife thrown in his direction. With a quick motion, the dagger was flung through a portal into deep space. He turned back to them.\n\n\n“Seriously?” He sighed as he saw the motion made by the witch. He was going to enjoy this. The red magic swarmed towards him and he flicked it away with a small motion. The look on their faces at this was laughable. \n\n\n“Are you done yet?” he asked sounding bored.\n\n\n“Who the hell are you.” hissed the witch.\n\n\n“Someone more powerful than you Miss Maximoff so I recommend you stop before I have to limit your powers.” \n\n\n“Why on earth would you be able to do that!” Clint growled.\n\n\n“Well it’s my job.” he turned back around and left through the portal.\n\n \n\nBack in the lab, Stephen burst out laughing. Tony looked at him surprised. \n\n\n“What happened?” he asked as Stephen handed him the box still chuckling.\n\n\n“That was so… enjoyable.” he grinned at Tony. “They almost had heart attacks when I appeared from nowhere. Then when they attempted to attack me and I just brushed off the witch’s magic they looked ready to die then and there.” Tony snorted at that opening the box and swallowing the required pills. \n\n\n“How long do you think I could stay down here before they go on a rampage?”\n\n\n“Sadly only a couple of days.” Stephen sighed sitting down next to him before realising he was still in his dark blue robes. He stood back up.\n\n\n“I will be right back,” he said opening a portal back to his room in the sanctum. “I just need to change.” Tony mock pouted.\n\n\n“Shame, you look so good in robes.” he jumped up and leaned against Stephen. “It’s very sexy.” Stephen reddened looking at the man unamused. \n\n\n“I’ll just pretend it’s the drugs saying that.” but he couldn’t keep the smile off his face. Tony sighed dramatically collapsing onto the sofa.\n\n\n“You wound me.” Stephen rolled his eyes smirking at the man before heading back into his room.\n\n\nIt was several days after that Steve and the others even saw proof that Tony was in the compound. They were all milling around the main common area. Steve and Sam talking at a coffee table, Clint whispering with Wanda, a dark expression on his face, Natasha standing and staring out a window, Scott was just sitting in a chair looking depressed. At the sound of a couple of pairs of footsteps Steve looked at the hallway. Laughter and talking was growing louder by the second and grabbing most of the rooms attention. Steve had just stood up expectantly when two teenagers came walking through the hall. At the sight of them the younger one’s face darkened and the older looked horrified. \n\n\n“Hi,” said Steve kindly. “What’s your names.” there was silence was a beat before the younger one answered.\n\n\n“That, is none of your business.”\n\n\n“He didn’t mean to offend you, he was just being nice.” Wanda smiled slightly at the boys, leaning on the kitchen’s counter.\n\n\n“That must be a stretch for you.” snorted the boy, the older boy nudged him, gesturing towards the door to the forbidden West Wing. The boy nodded and they began to continue walking. Steve didn’t want the conversation to end, this was a chance for information from someone that might know what was happening. \n\n\n“My name is Steve,” he stated awaiting an answer from the younger boy who had stopped at the words. The older boy tugged him, apparently not wanting to talk.\n\n\n“Honestly Rogers, I don’t care.” The boy replied simply turning back to face him. “I don’t especially want to know you so whatever you’re trying to start between us? It isn’t going to work.” Steve opened his mouth to reply but then closed it again the boys began to walk again but Wanda glided next to the door.\n\n\n“Are you part of the Avengers?” she asked sidetracking them. The older boy pursed his lips.\n\n\n“Tony won’t let us join officially until we’re trained and older.” The younger said stiffly, not looking at Wanda. \n\n\n“Well at least he can get that right.” snorted Clint. That seemed to be enough for the older boy who finally opened his mouth to speak.\n\n\n“At least he’s done more right than you.” That left them in silence. Natasha, who had been ignoring the conversation, looked at the boy, a puzzled expression ghosting on her face.\n\n\n“Well looks like they’re already corrupted.” sighed Clint dramatically. Scott was still seated, shaking his head slightly as if in a daze. All of a sudden the door to the West Wing opened and the man in question stepped in front of the boys and between Wanda.\n\n\n“Tony,” said Steve stepping forward, a hopeful expression on his face. Finally they could get some answers and sort this stupid situation out. Tony ignored him, instead staring down Wanda. After Wanda snorted and turning away, Tony turned to the kids, checking them over with his eyes. After the inspection a look of relief graced his features. That’s when Steve noticed the glowing light, that was all too familiar, on his chest. He paled ever so slightly.\n\n\n“You replaced the Arc?” he questioned surprised. Tony froze at the question and the younger kid shot Steve a dirty look. Tony nodded stiffly. \n\n\n“Could we talk?” Steve tried hopefully. The younger kid glared at Steve.\n\n\n“You’re not coming anywhere near him.” he growled. Tony sighed giving the kid a look.\n\n\n“Harley, it’s fine.” the newly dubbed ‘Harley’ gave Tony an incredulous look. The older kid made a disbelieving noise and Tony rolled his eyes at him. \n\n\n“Where’s the shield?” asked Sam at an obvious attempt at conversation but dread instantly filled Steve, considering their last meeting and Tony’s wince at the mention of it now.\n\n\n“Like you’d get that back.” said the older kid also glaring at them. \n\n\n“Didn’t T’challa make you new shields while you were in Wakanda?” Tony asked still not looking at them, he rubbed his chest, near the glow of the new Arc Reactor. \n\n\n“You knew where we were?” asked Sam surprised. Tony hummed in answer.\n\n\n“He was really bad at hiding it, especially when I was there.”\n\n\n“You were in Wakanda.” Wanda sounded disbelieving, “What were you doing there?”\n\n\n“Picking up some stuff.” Tony replied mysteriously.\n\n\n“Vibranium?” Natasha offered, Steve noticed Tony had begun to drum his fingers nervously on the Arc, his silence was Natasha’s answer.\n\n\n“Is that what you did with Cap’s shield?” Clint hissed, “turned it into one of your little creations?” Harley and the other kid, kept on glancing at each other nervously.\n\n\n“Clint it’s fine.” Steve almost ordered. Tony made a great effort in rolling his eyes before turning back to the kids and ignoring Steve again. \n\n\n“So you guys want to work this weekend? Or is it another movie marathon.” Tony was saying as he led the kids away to the ever-closed door. \n\n\n“Tony wait.” Steve began to say but Tony had already brought the kids through the door.\n\n\n--\n\n\nAs soon as the door closed behind them, Peter turned to Tony.\n\n\n“Are you alright Mr Stark?” he asked nervously. Tony sighed, breathing deeply. He wouldn’t lose it again, not in front of the kids. Tony lent his arms against the wall rubbing his chest. The pain was jumping up by the numbers as he began to panic.\n\n\n“It’s okay Tony, you’re okay.” soothed Harley, but he kept on glaring at the door. Tony sighed again straightening before looking at the two kids. \n\n\n“Sorry I forgot to tell you \n\nthey \n\nwere back.” Peter looked at him concerned. \n\n\n“It’s okay Mr Stark-”\n\n\n“Tony.” Tony interrupted.\n\n\n“It’s okay \n\nTony\n\n” Peter said again, obviously holding back an eye roll. “It’s not us you should be concerned about.”\n\n\n“Ah, but it is.” Tony replied as they began to walk down to the lab. “Do you not remember our little chat?” Peter did roll his eyes this time.\n\n\n“This is different.” he pointed out.\n\n\n“I beg to differ.” Tony snorted, “So, are you guys wanting to come to the meeting on wednesday or not.” Harley sighed at the obvious change in subject.\n\n\n“Well, yes?” Peter said uncertainty in his voice. “Aunt May said I could come anyway.”\n\n\n“And remember, you don’t have to reveal yourself as the spiderling if you don’t want to.” Tony recited, Peter nodded, irritated by the change in subject.\n\n\n“Oh Tony, I forgot to tell you.” Harley began excitement now in his tone. “My mum said I could stay with you during school break so that’s until the end of next week.” Tony grinned at him, joy written on his features.\n\n\n“Well I guess we’ll have a lot of work to do.”\n\n\n“And I’ll have more time to practice in my armour” Harley added. Tony smirked at him.\n\n\n“We’ll see.”\n\n \n\nEntering the lab Tony saw Stephen once again was on the sofa, under a blanket, looking quite frankly incredibly adorable, especially with the effect of the blanket which for some reason was incredibly fluffy, reading a different book this time though, one that was bigger and dustier. Tony could practically smell the rotting pages from the door.. At their entrance, Stephen looked up smiling at the kids and giving Tony a concerned look, that clearly indicated, \n\nare you okay?, \n\nTony smirked at him and winked. Maybe Stephen was right about the drug thing. He was definitely more flirtatious than usual. \n\n\n“So you kids can do whatever you want I need to rest for a while.” Peter looked slightly put out. “We can watch something after if you want. Your choice.” That seemed to satisfy Peter and he grinned at Tony before he ran off with Harley to the adjoining room made to test armour. \n\n\n“Are you sure you’re okay?” Stephen asked sounding concerned as he turned the page of his book. Tony sighed before sitting on the couch beside Stephen.\n\n\n“When have I ever been?”\n\n\n“Fair point.” Stephen looked over the top of his book at him. “Do you want to talk about it?” Tony was silent for several seconds before he lent back in the couch and replied.\n\n\n“I can’t even look at them without freaking out. How on earth can we work together?” Stephen thought for 89 milliseconds before answering.\n\n\n“You won’t have to most of the time. You are on a different field team than them so…” \n\n\n“That my friend is the sucky part of being a hero. Putting everyone else’s needs before your own.”\n\n\n“Something Rogers definitely doesn’t get.” Stephen smiled grimly.\n\n\n‘Boss, Dr Banner is here.’ \ninformed FRIDAY. Tony grinned. \n\n\n“Is he on his way down?”\n\n\n‘Yes, Boss.’ \n\n\nThe door opened and Bruce came in. Tony jumped to his feet.\n\n\n“About time you got here. You’ve been so busy I didn’t even get to reunite with my science bro!” Tony put an arm around a smiling Bruce’s shoulder’s.\n\n\n“Sorry about that Tony, things have been crazy with the Asgardians and I thought it would be a tad mean to abandon Thor with all the work.” Tony nodded leading him towards the sofa.\n\n\n“Understandable. Now…” Tony grinned again. “Science Bro, meet Awesome Facial Hair Bro!” Stephen raised an eyebrow in amusement as he stood up.\n\n\n“Hi, I’m Bruce.”\n\n\n“Stephen Strange.”\n\n\n“Like the neurosurgeon?”\n\n\n“Ex-neurosurgeon.”\n\n\n“Now Stephen’s a fancy wizard.” grinned Tony. \n\n\n“Master of the Mystic Arts.” Stephen automatically corrected. \n\n\n“You got it Dumbledore.”\n\n\n“I never thought you would be so supportive of magic Tony.” teased Stephen.\n\n\n“I’m supportive of a lot of things,” he replied wiggling his eyebrows. Stephen scoffed and looked away amused. \n\n\n“Right…” said Bruce slightly confused.\n\n\n“So, Brucie Bear!” Tony smirked. “Where’ve you been all these years?”\n\n\n“Space. As Hulk. Fighting as a Gladiator for some reason.” Tony raised his eyebrows.\n\n\n“Okay. That wasn’t exactly what I was expecting but I’ll roll with it.” They sat down.\n\n\n“I didn’t see anyone else upstairs except Vision. Where is everyone?”\n\n\n“About time they got into their own wing,” muttered Stephen darkly.\n\n\n“um What?” asked Bruce confused.\n\n\n“Long story short. After you left the Avengers fell apart. Rogers and his little band of misfits ran off and became wanted worldwide. Then since I am so nice I, with the help of T’challa, who is the king of Wakanda, got them pardoned and now they’re back.” Tony said quickly. Bruce gaped for a second.\n\n\n“So… terrorists?” he finally asked. “Jeez Tony.” Bruce rubbed his face with his hands. “How the hell did they manage that?”\n\n\n“Let’s see…” He began to tick off on his fingers. Bruce seemed to notice his slightly shaking left hand. “1.) Rogers had a whole car chase with Barnes and destroyed several cars in the process then got arrested. 2.) He broke out of custody. 3.) He and his crew trashed a German Airport when I was trying to bring them in by the order of the government. 4.) Rogers and his pal Barnes almost killed me and left me to die in Siberia.” as Tony said number four his voice shook and Stephen and Bruce’sfists clenched. “5.) they broke into a high-security prison to break the captured members of the band of misfits out. That’s basically the jist of it.” By the end of the explanation, Bruce looked like he was about stand up and go give Rogers a piece of his mind. \n\n\n“That… Asshole.” Bruce finally sputtered. “I mean god, Tony? How can you stand to be in the same room as them even?”\n\n\n“To be honest I can’t,” Tony replied simply. “In other news, I have a new team of people who are actually nice. You’ll like them.” Bruce gaped at him, silence filled the room for several more seconds before Bruce spoke again.\n\n\n“And you had a new Arc Reactor?” the implication Bruce was making was clear.\n\n\n“Don’t worry Brucie Bear, this one isn’t to stop me dying it’s got my suit in it.” Tony grinned, his hand was still shaking so he rubbed it. “Nanotech, it’s pretty awesome but you’ll have to wait until the next training session for the big reveal.”\n\n\n“Drama Queen.” snorted Stephen.\n\n\n“Well, wow,” said Bruce still shocked at all this news.\n\n\n“Hey Tony?” came the voice of Harley as he entered the room, at the sight of the new arrival he grinned in excitement.”Peter get in here. Dr Banner’s here.” Peter entered the room fanboyish joy clear on his face.\n\n\n“Yeah you have a bit of a fan club.” smiled Tony.\n\n\n—\n\n\nSteve didn’t listen to the conversation happening between the others as they headed to the main common area or dinner he was too busy thinking about how to fix the Tony problem. He did, however, notice when they stopped talking and as he was pulled back to reality he heard several voices talking and laughing. He continued to walk into the room and saw grouped together on the sofas surrounding the coffee table, Tony, Rhodey, Bruce, Vision, Hope, Harley, the other kid, Some blond woman, and… and…\n\n\n“You,” said Clint surprised. The groups talking stopped.\n\n\n“Yes me…” replied the wizard from the other day. Steve noticed how the man was sitting quite close to Tony. Maybe it was his mind playing tricks on him but his dislike for the man deepened.\n\n\n“There’s Chinese over there if you want some.” said the blond woman professionally. Steve slowly walked towards the pile of boxes on the counter. The rest of his team followed him, Scott lingering for a second and looking at Hope before following, throwing looks at the group had begun talking again.\n\n\n“Tony, being Tony, Wanted to make our parents coffee.” Hope was saying. “But he hadn’t actually made coffee before just, for some reason, fooled around with the machine and giving it an AI. Soon enough coffee was all over the room and ourselves. First time I’d ever heard someone have an argument with a coffee machine.” Everyone began laughing.\n\n\n“Hey not my fault, that coffee machine was being an asshole,” grumbled Tony. which only made them laugh harder. Steve kept glancing up and staring at the group as he picked a random box of noodles. He and his team sat at the table and ate in silence as they listened to the conversation occurring between the others. Natasha was staring at Bruce, Wanda at Vision, and Scott at Hope. But the entire group ignored them.\n\n\n“Okay, this is getting kind of irritating. Are you just gonna keep gawking at us or ask us the burning question obviously on your mind.” the blond woman said suddenly facing them.\n\n\n“Um,” Steve muttered, the woman raised an eyebrow expectantly. “Who exactly are you?” the woman sighed as if disappointed by the simplicity of the question. She glanced at Tony and the others, Tony shrugged still firmly avoiding Steve’s eyes. \n\n\n“Fine, I’m Carol Danvers,” She began to point to the unnamed people, “Stephen Strange, and Harley and Peter. I assume you already know the others.” She looked at them as if she was saying \n\nis that all? \n\nSteve didn’t say anything as his mind struggled with deciding which question was the most important. Obviously, he took too long since the group started talking again. Now with Rhodes telling some other story about his and Tony’s time in MIT. Steve noticed with a pang that Strange was whispering something to Tony. He stared back into the box of noodles. This was going to be harder than he thought.\n\n\n“You showed a surprising amount of kindness to them.” Hope commented as, after dinner, the group left through the hall and sat in the smaller West Wing common room. Quite tired of all the stares from the Rogues. \n\n\n“Well, I am actually trying to be a professional Team Lead who apparently isn’t supposed to be biased so I kind of have to.” Carol sighed. Vision floated towards their small bar. \n\n\n“Would anyone like Tea?” \n\n\nHope and Carol both nodded thanking Vision, Rhodey just shrugged.\n\n\n“No thanks, Vis.” Rhodey finally decided. \n\n\n“Yeah, thanks Vision.” Bruce sighed gratefully.\n\n\n“Nothing for us thanks,” Peter said for himself and Harley.\n\n\nTony opened his mouth about to request coffee before Stephen interrupted.\n\n\n“Tony and I would like some too thank you.”\n\n\n“But-” Tony sputtered. “Coffee.”\n\n\n“No milk for Tony, but still Tea,” Stephen added firmly. \n\n\n“Stephen.” Tony wailed.\n\n\n“You actually have to sleep tonight Tony if you don’t want to collapse in training tomorrow. Coffee will keep you awake longer.” Stephen said logically.\n\n\n“Fine. But don’t expect me to be happy about this.” Tony grumbled.\n\n\n“I wouldn’t expect anything less sweetie.” Stephen mocked smirking at Tony who, very immaturely, poked his tongue out at the Doctor. Meanwhile, everyone was staring rather amused at the pair.\n\n\nVision floated back over sporting several mugs, Peter quickly jumped up to help the android. As the tea was passed around Tony stared sullenly into the dark liquid.\n\n\n“And I can’t even add any alcohol to this. You torture me.” \n\n\n“So you’re sober now too?” Bruce asked taking a sip from his mug.\n\n\n“Trust me, it’s unwilling.”\n\n\n“Speaking of.” Stephen formed a small portal and reached in grabbing the box and handing it to Tony.\n\n\n“And here I was thinking you didn’t practice medicine anymore.” Tony glared.\n\n\n“Firstly you brought the subject up, secondly, this isn’t practising medicine, it’s reminding you to take some medicine, which is actually called caring,” Stephen replied, Tony, rolled his eyes but took the box watched surprised by Bruce. \n\n\n“Stop panicking Brucie. These are mostly just since I’m still technically post-op.” He sighed with sarcastic regret. “The joy of having another new ribcage.” Bruce’s eyes widened at the comment but Stephen continued the sentence for the billionaire ignoring the lie about what the pills were for.\n\n\n“You were the one who wanted the new ribcage, the surgery was supposed to just be for the new Arc Reactor.” Tony shrugged.\n\n\n“I was tired of it being broken all the time.” \n\n\nMeanwhile, having already had this conversation with Tony, Hope and Carol were talking about the organization of training the next day with Vision, Rhodey, and the attentive listening of the kids. \n\n\n“So is it going to be an actual exercise or just a free for all?” Hope was asking.\n\n\n“It would be good to test out the teams wouldn’t it?” asked Rhodey from his seat next to Carol. \n\n\n“I guess so, I was thinking it should just be a vs thing at first but then I was wondering if we should get to know one another’s limits in their powers. Especially certain no pardoned gods of mischief.”\n\n\n“We can figure out the matches tonight if you want,” Rhodey suggested to her. Carol grinned.\n\n\n“You got it second in command,” she replied. From his seat Tony winked dramatically, wiggling his eyebrows to the knowledge of everyone. Rhodey scoffed. \n\n\n“You’re one to talk, your conversations with Stephen are 90% flirting.”\n\n\n“Which what makes them so interesting,” Stephen answered making Rhodey snort and Tony to grin and his eyes flash with what Rhodey thought looked a lot like hope. \n\n\n“My, my.” Tony suddenly said looking at the time. “Off to bed kids or your Mum and Aunt will have my ass.” Peter groaned standing up, followed by Harley. They moved with dramatic enthusiasm towards the bedrooms. \n\n\n“Night dad!” Harley called cheerfully, giving them an overly dramatic wave. Peter snorted in synchronization with Tony and Rhodey.\n\n\n“Night kids! Sweet Dreams!” Tony responded with an equally dramatic grin and blowing them a kiss. \n\n\n“Drama queen.” sighed Stephen amused. Tony put a hand to his chest giving him a look of utmost shock. \n\n\n“Oh Doctor, you wound me.” \n\n\n“Uh huh,” Carol said raising an eyebrow and smiling. “We all should actually get to bed though. If not now then soon.” She said the last sentence with a pointed look at Tony.\n\n\n“Aye Aye Captain,” Tony replied saluting. \n\n\n“Are you sure that wasn’t coffee?” Bruce asked looking amused by the enthusiasm shown by Tony. \n\n\n“Relatively sure.” Vision said, “unless Tony filled all the tea bags with coffee.” Tony winked at him not providing an answer.\n\n\n“I actually have to do something back at the sanctum.” Stephen informed them, “I guess I’ll see you tomorrow.”\n\n\n“Super secret wizard stuff?” Tony asked.\n\n\n“Something like that.” \n\n\n“Have fun, Merlin.” Tony snarked as Stephen formed a new portal into the Sanctum. \n\n\n“Bye Bye Einstein, try and get more than 3 hours of sleep this year,” called Stephen over his shoulder, waving at the others as the portal shut behind him. After he left everyone else began to head to their rooms.\n\n\n“Me and Tones will clean up Vis it’s okay.” Rhodey smiled at the android who nodded in thanks before phasing through a wall to his room. \n\n\n“I’ll meet you in my room when you’re done ‘kay Rhodes?” said Carol as she headed to the hall to the bedrooms.\n\n\n“Sure Carol,” Rhodey replied smiling somewhat dreamily as she left. Once Tony and Rhodey were the only ones remaining Tony smirked at the man.\n\n\n“You are the Captain huh?” Rhodey glanced happily at the man.\n\n\n“Something like that.”\n\n\n“You’re good together,” Tony reassured as he picked up the mugs from the table and carried them with Rhodey to the sink.\n\n\n“So you and the Sorcerer Supreme huh?” Rhodey mimicked. Tony blushed. “Oh don’t bother denying it Tones. You guys are besotted with one another, you’re just too full of yourselves to admit it.” Tony smiled slightly looking at the now running tap.\n\n\n“You really think so?” Rhodey snorted at that.\n\n\n“Seriously man, you’re acting like a schoolgirl right now. Yes, I think so.” Tony grinned at his friend.\n\n\n“Excellent words of reassurance buddy.” He placed the now rinsed and emptied mugs into the dishwasher.\n\n\n“That man appears to be spending every free moment of his time with you. Basic sign of a crush.” Tony snorted.\n\n\n“Fair enough. I guess we’ll see what happens” he clapped Rhodey’s shoulder as they began to head to his room. “Good luck with Marvel Platypus. And remember” he whispered the next words suggestively. “The rooms are soundproof.” Rhodey pushed Tony away blushing furiously. Tony chuckled.\n\n\n“I hate you.” sighed Rhodey but he was smiling.\n\n\n“Sleep tight honey bear.” He winked at Rhodey before heading into his own room. Deciding, maybe because of the recommendation given by Stephen, that he would actually try and get some sleep.\n\n\n“Hope, can I talk to you?” Hope stopped and sighed. \n\n\n“Fine Scott, but make it quick. We do have a meeting you know.” Scott rushed up to her. \n\n\n“Hope, I just want to say, I am so sorry about everything. I was an idiot who didn’t find out enough about the accords or anything really when running off like a fool.” Hope stared at him keeping her face neutral. “Look, I understand if you don’t want to forgive me but I just want you to know how sorry I am and to your dad too.” Hope touched the small box in her pocket and considered the apology.\n\n\n“Well Scott, you’re right in calling yourself an idiot. As for me forgiving you? I probably will at some point.” She smiled slightly. “And kicking your ass in training today will definitely make me feel better.” Scott snorted slightly and Hope smirked at him before turning and heading into the meeting room. She moved and sat next to Tony and Stephen. None of the Rogues except an awkward Scott was there yet but Carol and Rhodey were muttering to each other and entering things onto a tablet.\n\n\n“Is no one else here yet?” she asked Tony.\n\n\n“Well if they get here in the next 3 minutes and 13 seconds they should be fine.” he replied. “I cannot wait for the shitstorm that is likely to happen when Thor and Loki get here.” Tony groaned beginning to tap his Arc Reactor. The door opened and the Rogues, Bruce, and Vision filed in. \n\n\n“Tony,” Bruce began sitting opposite the man. “Thor is bringing someone else with him apart from the obvious.” Tony raised an eyebrow.\n\n\n“Who? And was it cleared by the council?” Bruce nodded in answer to the second question before speaking.\n\n\n“Well her name is Brunnhilde, she’s an Asgardian Valkyrie.” Tony nodded intrigued. The door opened again and Harley and Peter came in with all the energy of children. \n\n\n“Hey kids, you sleep alright?” Tony asked as they sat down next to Bruce. Harley nodded in sync with Peter.\n\n\n“Peter was just showing me the new suit,” Harley said with relative quiet to avoid the Rogues listening in too attentively from the other end of the table where they were talking in hushed voices and looking at them. \n\n\n“It’s super awesome, thanks, Tony.” Peter grinned.\n\n\n“Soon enough your entire vocabulary will become the word thank you.” Tony snorted but his face was filled with joy.\n\n\n“So, now we are just awaiting Thor and his… company.” Carol said finally to those seated.\n\n\n“Thor’s back then?” Natasha asked he eyes kept on flicking to Bruce.\n\n\n“He’s been dealing with the remaining Asgardians,” Carol informed them, at the word remaining Natasha raised an eyebrow. The door opened again and Thor stood in the doorway.\n\n\n“Avengers!” he cheered. “It is a pleasure to see you all again.” Thor still hadn’t left the doorway which confirmed the suspicions Tony was having about Loki being behind him.\n\n\n“It’s good to see you too Thor.” Steve smiled and Tony looked away, panic rising in his throat at the voice.\n\n\n“Woah man, what happened to your eye?” Sam asked in shock.\n\n\n“My sister stabbed it out” Thor answered matter of factly. “After destroying Mjolnir and before destroying Asgard.” The room gaped at him. \n\n\n“Why don’t you come sit down Point Break?” Tony suggested. Thor hesitated looking doubtfully over his shoulder.\n\n\n“It’s fine Thor.” Stephen said and the Cloak of Levitation floated over to the door from where it had been behind his chair with the intent to block attacks made to Loki. Thor nodded and stepped aside. The sight of Loki behind him began a deafening uproar with Clint jumping to his fight looking ready to tear the god in half.\n\n\n“Friends.” Thor boomed. “My brother regrets his actions in New York and has proven himself worthy since.” The noise settled down but a tension in the room remained.\n\n\n“Like we should believe that.” Clint hissed still not seated.\n\n\n“Well, it’s true Clint.” Bruce sighed from where he was sitting having smiled at the gods as they entered.\n\n\n“Barton the council has already cleared this decision so don’t bother disagreeing,” Rhodey stated looking slightly wary of Loki.\n\n\n“Can we just get this meeting started?” Hope asked impatiently. Thor came and sat down, Loki following glaring straight ahead as he sat next to Thor. A woman followed after them looking frankly bored. Tony guessed this must be who Bruce was referring to. She grinned widely at Bruce and sat in the chair left in between Loki and Bruce leaning over and whispering something to Bruce while doing so.\n\n\n“Thor, Loki, and Brunnhilde have all signed the accords and are Avengers so any attempt to harm Loki without recent provocation will result in your immediate termination from the Avengers initiative,” Carol said firmly to the Rogues and Clint specifically. \n\n\n“Now this meeting is mostly to make sure everyone knows what is happening,” Rhodey added helpfully.\n\n\n“The Rogues are going to remain on a team since they’re all still on probation that’s limiting their field work.” Carol said getting some relieved looks from the Rogues. “Colonel Rhodes will be joining that team as the new team lead during combat.” This however gave the Rogues pause.\n\n\n“But Steve has always led us,” Wanda argued. Rhodey smiled grimly at her.\n\n\n“Mr Rogers has displayed an inability to lead fairly before and after what happened he is no longer going to be leading anything unless instructed to by his new Team Lead. The New Avengers already have Mr Stark in a similar suit as Iron Man and this is also to divvy up the heavy hitters.” The Rogues made several protests but Carol ignored the protests.\n\n\n“If you would like to make a formal complaint then take it up with the council.” Carol continued. “Due to the probation, your team will be serving as a backup unless in a major crisis.” She addressed this to Rhodey who nodded in agreement. \n\n\n“Thor will be also joining my team since the New Avengers team already has an energy wielder of a similar skillset. He has the option of Co-leading the team if he chooses.” Thor smiled at Rhodey but seemed interested in who the new people were. “Loki will be on the New Avengers team mainly to avoid conflict. As for Brunnhilde, a decision will be made after she demonstrates her skills in training today.” \n\n\n“The kids will be placed on a team once they are of age.” added Carol, “and Dr Banner has requested that Hulk is only called upon in serious situations and this request has been approved so he is not assigned to a team.” Bruce sighed looking thankful.\n\n\n“What are their identities?” Steve asked. “The kids I mean.”\n\n\n“That’s that question to answer if they choose to,” Carol said firmly.\n\n\n“I’m fine with it.” Harley shrugged. “I’m training as the next Iron Man.” the Rogues gaped at that. Not only was Tony allowing someone else to use his suits, it was a kid and his well… replacement. \n\n\n“He’s going as Rescue at the moment,” Tony informed them.\n\n\n“Iron Lad and Iron Boy sounded horrible.” cringed Harley and then turned to Peter whispering something in his ear that made the boy snort. \n\n\n“As for me…” Peter began sounding unsure.\n\n\n“You don’t have to if you don’t want to,” Carol said gently. Peter nodded.\n\n\n“No, it’s fine.” he coughed awkwardly. “I’m Spiderman.”\n\n\nThere was a long silence after that until Steve finally sputtered. \n\n\n“What?!” \n\n\n“Well, that was responsible Stark, bringing a kid to Germany.” Clint hissed. Peter glared at him.\n\n\n“Well, that was responsible Clint, leaving your family to go to Germany.” Peter mimicked. Clint glared at the kid, fury in his face.\n\n\n“Calm down Clint,” Steve said looking at the man. “We all made mistakes back then.”\n\n\n“Some were just bigger than others” Harley commented darkly looking at the Rogues. \n\n\n“Wow Stark, you corrupted them good.” Wanda sneered. Tony had his eyes closed and was drumming nervously on his Arc Reactor. Vision looked at her in disappointment causing her to fall silent.\n\n\n“Got them right onto your side.” Clint growled. \n\n\n“Shut it, Clint.” Natasha snapped. Thor was looking immensely confused. \n\n\n“What exactly is happening?” Thor asked Bruce but before Bruce could explain what he found out Harley snapped a reply to Clint.\n\n\n“Obviously it was corruption.” He was saying sarcastically. “Definitely not you beating our father figure within an inch of his life!” Steve paled at the reminder.\n\n\n“I didn’t mean to…”\n\n\n“What? Lie to him? Shun him? Almost kill him?” Peter snapped\n\n\n“Peter, Harley, dial it down a bit bud.” Tony said his voice dry and tight. Harley and Peter gave a final furious glare to the Rogues before muttering to each other darkly. Thor was looking horrified and even Loki was looking surprised and even a little sympathetic.\n\n\n“What happened while I was away?” he gaped at them all. \n\n\n“A lot of things Point Break.” Tony replied voice still hoarse, and tapping even faster on the Arc Reactor. Stephen rested his hand on his shoulder and looked into his panicked eyes. Tony gulped down another panic attack. Phantom pain having a festivity in his chest. \n\nIt’s okay. I won’t let them hurt you. \n\nThe words projected themselves into Tony’s mind with Stephen’s voice and he calmed slightly. Tony rubbed his face with his hands, breathing deeply.\n\n\n“Anyway, moving on.” Carol was saying, directing a furious glare at Clint and the Rogues. “Behaviour such as that will result in the end of your probation and your time as Avengers.” Rhodey continued stiffly also glaring at the Rogues. “This meeting is adjourned, please take this time to prepare for training in two hours.” Hope pushed a small box into Scott’s hands. \n\n\n“Your new suit. Took a lot of convincing but Dad finally did it.” She then left after Tony who at the end of Carol’s sentence had quickly stood up and walked quickly out of the room followed closely by Stephen who was followed by the other New Avengers. Tony didn’t stop walking until he was at his lab. \n\n\n“Tony.” Stephen said. Tony didn’t reply instead collapsing on the sofa, putting his head in his hands and attempting to slow the hyperventilation. He vaguely registered Stephen offering him the medication that would calm him down but waved it away clumsily so Stephen just sat down next to him saying comforting sounding things as the Cloak of Levitation drifted down to his shoulder and hugged him in comfort. \n\n\n“So.” Tony finally managed. “You’re telepathic now?” Stephen gave him a slightly irritated at Tony ignoring what had just happened but he just sighed.\n\n\n“Only when wearing the Eye of Agamotto,” Stephen answered seated next to Tony. DUM-E came over making chirping noises and Tony absentmindedly patted his robotic arm. \n\n\n‘Are you okay Boss?’ \nFRIDAY asked nervously. Tony leaned back in the sofa rubbing his chest and Arc Reactor repeatedly breathing as much air into his lungs as possible. \n\n\n“I’m fine baby girl.” Tony murmured closing his eyes wishing his racing heart would slow the fuck down.\n\n\n“Tony?” Harley rushed in followed by Peter, both looking apologetic and guilty. \n\n\n“We’re so sorry.” \n\n\n“We didn’t mean to spaz you out.” \n\n\n“They shouldn’t speak about you like that.”\n\n\n“We’re super sorry.” \n\n\nTony opened his eyes looking at them. \n\n\n“It’s fine guys, just me freaking out.” he attempted a smile but Stephen thought it looked more like a grimace. \n\n\n“At least there’s no snow for you to throw at me this time,” Harley said jokingly. Tony snorted. \n\n\n“I’ll probably find something.” Rhodey came into the room looking nervous.\n\n\n“You alright man?” Tony made some noise of agreement.\n\n\n“Just need to calm down before training.” Rhodey made a noise of disbelief at that.\n\n\n“Hey Rhodes?” asked Harley. “Can I just stay down here and practice with the suits some more? I doubt I’m ready for any kind of combat.” Rhodey smiled kindly at Harley. \n\n\n“Sure man, whenever you’re ready.” Harley thanked him.\n\n\n“Hey Doc, are you bringing the Eye thing to training?” asked Tony.\n\n\n“The Eye of Agamotto.” Stephen corrected, “Probably not, it is extremely powerful.”\n\n\n“True, but the telepathy thing is pretty neat,” Tony argued casually. Stephen understood what he was getting at though.\n\n\n“Fair point. I’ll bring it then.” \n\n\nTony got to his feet the Cloak helping him remain balanced in his damned shaky state. \n\n\n“You’re not getting coffee are you?” sighed Stephen. Tony shrugged. \n\n\n“I find it oddly calming.” Stephen rolled his eyes.\n\n \n\n“Are you sure you want to train today?” Rhodey asked Tony outside the training room later. \n\n\n“Why wouldn’t I?”\n\n\n“Well, you had serious surgery barely a month ago. You also had a panic attack barely an hour ago.” Rhodey pointed out. Tony sighed. \n\n\n“I feel fine Platypus, besides, I’ve fought villains in worse states.”\n\n\n“That’s not exactly a good point Tony.” Tony ignored him instead going over to Stephen as the Cloak finally lifted itself from his shoulders and returned to the wizard.\n\n\n“Time for the big reveal.” Tony grinned putting a finger on his Arc Reactor.\n\n\n“I seem to be really looking forward to the event now” Stephen smiled tucking the Eye of Agamotto into his robes. He and Tony followed Rhodey into the training room. Everyone was there and suited up except for Carol, Bruce who was in a chair working as he watched, and Tony. Tony grinned at Peter who smiled back and walked over looking awesome in the Iron Spider. \n\n\n“So everyone. Here’s how it’s going to work.” Carol started. “To test each other’s power and strengths we will be fighting either 1v1 or in small groups at a time. We don’t exactly want anything exploding so…” She nodded at Stephen who stepped forward and made a sharp motion. There was a cracking as the very air seemed to splinter at his touch. Stephen entered followed by Carol who made a ‘come on’ gesture. \n\n\nOnce everyone was in Stephen spoke.\n\n\n“This is the Mirror Dimension. We won’t harm the real world here.” Most everyone was gaping at the strange place. \n\n\n“So everyone could just hang out at the side so there is enough space to practice.” Loki made a gesture and enough chairs for everyone appeared. They all sat, the Rogues looking wary of the chairs conjured. \n\n\n“While you wait your turn you’re welcome to do whatever you want as long as you don’t interfere with the fight. Or you could watch.” Rhodey offered. Everyone made noises of agreement. Brunnhilde had found a bottle of alcohol from somewhere and was now chugging it. Rhodey looked at her disapprovingly. \n\n\n“There’s no point in trying to stop her,” Bruce mentioned without looking up from the tablet he was working on. “She doesn’t do anything sober.” Rhodey sighed and looked around. \n\n\n“Anyone want to go first?” No one really offered so Hope sighed and stood up. \n\n\n“Come on Scott. Don’t bother going easy on me, it’s likely to just make me angrier at you.” Scott got up looking nervous. \n\n\n“Ant-Man vs Wasp.” smiled Rhodey.\n\n\n“Kick his ass Hope.” cheered Tony. Hope snorted and rolled her eyes. Her helmet flipped on covering her face. \n\n\n“You ready?” Hope asked Scott. \n\n\n“I guess so-” before he finished speaking Hope had kicked his legs out from underneath him. Scott fell with a bang and several cheers came from the audience of the others. “Ow,” Scott muttered, “It’s on then.” his helmet flipped up as he spun around getting back up as he began to grow twice his size, punching Hope backwards. Hope chuckled, \n\n\n“Now you’re getting into it.” She began to unfurl her wings as she was hit backwards..\n\n\n“You have wings.” wailed Scott.\n\n\n“Can’t grow as well though.” as her wings finished snapping open she shrunk down into a speck and ran up Scott’s arm. \n\n\n“Not happening.” Scott shrunk down as well and fell to the floor, he looked up seeing Hope fly down to him and before he could react she seized his arms and spun him into the air. Scott cried out as her foot connected with his chest sending him flying back to crash into the sharded wall. He went back to regular size as he crashed back to the ground. Hope appeared next to him and her helmet retracted as she held him against the wall with her arm.\n\n\n“You done?” she asked smirking.\n\n\n“Definitely not.” He sent his knee into her stomach, and as she was pushed back, shrunk down again. He grew back up behind her and attempted to punch her. Hope shrunk back down for a second to dodge it before returning to normal size and jumping on him from behind. She held his arm behind his back and aimed a blaster at his head.\n\n\n“What about now?” \n\n\n“Never,” Scott answered stubbornly. She began to apply pressure to his arm into he yelled and banged his hand on the floor. \n\n\n“I’m done, I’m done.” Hope got off him and offered a hand. \n\n\n“Your fightings rusty.” she gave him a small smile before heading back to sit down.\n\n\n“Alright Hope!” Tony congratulated high fiving her. \n\n\n“Who’s next?” asked Carol. \n\n\n“Who can I fight?” asked Brunnhilde.\n\n\n“Rogers. You have an opponent.” Carol smiled. Steve got up looking at the opposing woman dressed in silver armour and armed with a sword. He flicked his shields out and smiled at her. Brunnhilde rolled her eyes and moved to the centre of the room looking at him challenging. \n\n\nThe whole fight didn’t last longer than three minutes and before long Steve was pinned against the wall with an alarming amount of strength and with a sword a centimetre from his throat. Stephen was choking from laughter and Tony was having a hard time keeping a straight face. Several people, more specifically Loki and Thor, were laughing out loud. \n\n\n“That was fun,” Brunnhilde said simply before heading back to her seat and sheathing her sword. Steve looked embarrassed as he sat back down.\n\n\n“I wish to fight someone!” Thor boomed enthusiastically. Carol grinned. \n\n\n“You’re up against me God of Thunder.” she glowed slightly as her casual clothes morphed into a blue, red, and gold armour complete with a star on her breast. “Don’t bother holding back, especially with your lightning.” Thor beamed excitedly as he moved to the centre of the room. \n\n\n“What is your hero identity?” he asked curiously.\n\n\n“They call me Captain Marvel.” She floated into the air looking relieved to be flying again. Her eyes and hands began to glow and crackle. “I’m the other energy harnesser talked about in the meeting. Thor looked ecstatic to be fighting someone of similar powers as the blue glow of lightning crackled around him. The fight that followed was hard to watch, mostly because the combined forces of their energy was blinding. Captain Marvel zoomed towards Thor and dodging several blows began to crackle brighter with every contact with Thor’s electrical skin. Thor was getting more intrigued with every failed hit. She seemed to know what he was doing before he did it. Finally a punch sent Captain Marvel flying back through the air, she spun in mid air as Thor gathered up as much lightning as he could. The force of the resulting lightning blast sent Marvel pummeling towards the ground. Thor could dimly see the silhouette of her standing up in the haze of electricity. When the lightning had dissipated Captain Marvel glowed brighter than ever and smiled, her hands and eyes blinding with light. \n\n\n“You shouldn’t have done that.” she flew into the air at the speed of light and her hands began to Glow brighter as she looked down at Thor. Thor jumped into the air about to make another attack when Captain Marvel released an energy blast so powerful the audience had to cover their eyes. Thor crashed into the wall held there by the strength of the blast. He fell to the floor and Captain Marvel had flown to his side in milliseconds. She pinned his arms behind his back. \n\n\n“You are extremely powerful,” commented Thor. Carol grinned as the energy faded from her skin. \n\n\n“Why thank you. You’re not bad yourself.” She stood up smiling at Thor. \n\n\n“Holy Shit,” yelled Brunnhilde loudly gaping at them both. Loki appeared beside them smiling slightly.\n\n\n“That was much appreciated,” he said smiling at Carol who smirked at Thor. “In other news, you definitely need a new hammer, Thor.” Thor frowned. \n\n\n“I know that. I just wanted to drop you guys off on Midgard first.”\n\n\n“If it makes you feel better it’s mostly because of the pre-cognition that I beat you.” Carol comforted. \n\n\n“Is that the most powerful you can get?” Loki asked curiously. Carol grinned.\n\n\n“If I absorb strong enough energy I become Binary for a while and Binary is way more powerful.” She considered. “Doesn’t happen often though.” She gave a final smile to Thor before turning back to the others. \n\n\n“That was so incredibly awesome,” Peter said in awe. Carol smiled at him as her suit morphed back into her favourite leather jacket.\n\n\n“Who wants to go next?” Peter jumped up.\n\n\n“Can I?” Carol smiled, “Sure, you’re against Falcon, Hawkeye, and Widow.”\n\n\n“Three people?” Tony asked in worry.\n\n\n“It’s just because he has superpowers and they don’t mostly.” Rhodey explained. Sam rolled his eyes as he stood up followed by Natasha and Clint. Peter was already on the ceiling with his mask on. Tony snorted slightly at the enthusiasm. During the fight Peter mostly jumped and swung around the moment that scared Tony the most being when he fell and was jumped by Natasha but the Iron Spider legs got him out of that quickly and the shocked cries at the sudden metal appendages would be something that Tony cherished. By the time Wilson had been webbed down Peter was laughing as he jumped around happily. He dodged a stun arrow as it whizzed by his face and grabbed the second aimed towards his chest. He sent several globs of webbing around Clint and watched amused from above as they exploded and covered the man. Peter landed in front of Natasha in his signature spider crouch. \n\n\n“Spider versus Spider the ultimate showdown,” he said grinning under the mask. Natasha raised an eyebrow looking amused.\n\n\n“I’m not going to go easy on you kid.” \n\n\n“I wouldn’t expect you to.” \n\n\nNatasha jumped making a swipe with her stun gloves. Peter ducked and flipped over her aiming a kick at her chest. Natasha grabbed his foot and yanked making Peter lose his balance. She put him in a choke hold and sighed as she electrified one of the stun gloves preparing to knock Peter out.\n\n\n“KAREN.” Peter said frantically, “Taserweb” the web shot from his wrist and hit Natasha’s foot mere milliseconds after the glove had come into contact with Peter. They both collapsed. Tony rushed over. Peter’s mask retracted and after several seconds he blinked and grinned at Tony. \n\n\n“You okay?” Tony asked worriedly.\n\n\n“I didn’t lose,” Peter said proudly. \n\n\n“But you didn’t win either kid,” smirked Tony helping Peter to his feet. \n\n\nNatasha smiled good-naturedly at Peter who looked nervously back. She had begun to cut the webs entangling Clint away with a knife. \n\n\n“Well played kid,” Clint muttered once free looking none too happy about losing. After the web had all been vanished by Stephen, Rhodey looked at Tony. \n\n\n“Do you want to go now?” \n\n\n“Sure, get ready for some embarrassing loss,” Tony smirked walking to the middle of the room. Rhodey rolled his eyes and stepped into the waiting War Machine suit. \n\n\n“Um, Friend Stark?” Thor asked confused. “You are lacking your armour.” Tony grinned at him.\n\n\n“Not for a while now Pointbreak.” Rhodey stood now suited opposite Tony. \n\n\n“Come on man suit up.” Tony smirked obnoxiously. Then brought his hands up, flicking them down to reveal little black bits of metal expanding from the Arc Reactor. He tapped the blue glow twice and Red and gold began to flow like water over his body encasing it in first a silver skeleton then the familiar red and gold of an Iron Man suit. The helmet encased Tony’s face and he put a foot back getting into a defensive stance as metal separated from the suit forming floating Proton Cannons around him and enlarging his hands into repulsor cannons. The audience gaped at this drastic and unexpected upgrade.\n\n\n“Wow, you weren’t kidding at the idea of a big reveal.” Bruce stared in fascination.\n\n\n“You upgraded to this in six months” Scott gaped.\n\n\n“C’mon Man.” Rhodey groaned the faceplate retracting to reveal his shocked and annoyed face. “That’s just showing off. You couldn’t have humoured me first?” Tony’s helmet retracted revealing his smug face. \n\n\n“That would’ve been a lot less dramatic.” \n\n\n“I hate you.” sighed Rhodey tiredly.\n\n\n“Does this mean you just forfeited?” \n\n\n“No?” Rhodey replied sounding unsure. Suddenly his helmet snapped down and he shot two missiles at the Proton cannons causing them to blow apart. Tony glared at him, helmet covering his head again.\n\n\n“That was just rude.” One of the machine guns began to release a spray of bullets at Tony who quickly formed a large shield to shelter behind. Tony flew into the air firing a group of nanites at the offending gun. The nanites swarmed over the gun disabling it. Tony shot back down towards Rhodey and forming two blades began to slash at Warmachine. Rhodey fired a unibeam blast at Tony and he was blasted back the armour quickly knitted itself back together as if no damage had been done. Tony reformed the repulsor cannons and gave Rhodey two quick blasts sending him back against the wall. Tony shot into the air followed by Rhodey were the two grappled for a short while before Tony formed his hands into Jackhammers and began to bash the Warmachine armour down. Tony’s armour formed a clasp on the boot and pinned Warmachine down before his hand formed an even deadlier and more powerful hammer which knocked Warmachine down. Two more shots of nanites held Warmachine to the ground and Tony came over his helmet coming off again.\n\n\n“You forfeiting now?” Rhodey rolled his eyes.\n\n\n“Fine, but you need to upgrade my armour again,” Tony smirked. \n\n\n“We’ll see now back to papa guys.” the nanites slid back from where they held Rhodey down and around the room. They formed back into the armour as if they never left and then the entire armour slid back into the Arc Reactor.\n\n\n“You okay buddy?” Tony asked Rhodey stood up and stepped out of the armour sending the suit back to stand by the wall.\n\n\n“Yeah, I’m fine just a little beaten up.” He shook his head fondly at Tony as they went back to their seats. \n\n\n“That was certainly impressive.” Stephen smiled at Tony who smirked smugly. \n\n\n“Science just displayed its awesomeness, now go and display the awesomeness of magic Doc.” Stephen smiled and stood up, moving to the centre of the room. Steve was still gaping at Tony who was still ignoring him. His shield upgrades seemed childish in comparison to the new Iron Man suit and his powers seemed boring after seeing all the New Avengers.\n\n\n“Stephen.”  Carol said, “You will be fighting Wanda and then whoever wins will fight Loki.” Stephen nodded and looked expectantly at Wanda who stood and moved over to face Stephen. \n\n\n“Whenever you’re ready Ms Maximoff.” Stephen spoke with an irritating calmness as he took the Eye of Agamotto out from under his robes. Wanda quickly summoned a red ball of energy to her hands and flung it at Stephen who moved his hands and formed a shield around himself that the magic slammed into dissolving into the air. A spare chair flew through the air and Wanda split it apart with one motion. She spun sending the two chair halves at Stephen who was quickly protected by the Cloak of levitation. Pulling his hands apart a string of energy appeared and Stephen swung it towards Wanda who blocked it with a reddish mist of magic. Stephen retaliated by whipping the energy around her leg and causing her to fall over with a quick motion. Wanda pushed back with Magic causing Stephen to falter and fly back into the air. Red magic began to surround Stephen which seemed too much for the man to handle. However when Wanda looked ready to ask him to surrender Stephen uttered something and the magic dissipated, the Cloak of Levitation quickly flew out to protect Strange. Wanda glared at him and prepared to cast again when Stephen made several motions and a glowing, translucent sphere made up of odd symbols formed around him. Wanda gasped and collapsed the red glow fading from her fingers. At the same time, Loki, who was seated and watching the events with intrigue, gasped and shuddered he stared at his hands for a second before glaring furiously at Strange who smirked.\n\n\n“What did you do?” Wanda asked a mixture of anger and curiosity in her voice. \n\n\n“Weakened nearby magic users powers.” Stephen replied matter of factly. Thor made a noise of understanding after having been confused at Loki’s random reaction. Wanda made a move towards Strange and they began to battle hand to hand. Stephen was obviously going easy on Wanda and her meager combat skills. Eventually he made a quick movement and glowing energy streams restrained her. \n\n\n“Fine,” Wanda muttered icily. “You win.” Stephen smiled in satisfaction and the effects of his magic were removed. Loki and Wanda began to rub their hands both glaring at Stephen. \n\n\n“I guess it’s Loki versus Stephen then,” Carol said cheerfully. Loki stood up still glaring at Strange. \n\n\n“This is likely to be long and entertaining.” Loki snarked, Stephen, smiled.\n\n\n“At least we can agree on that.” Stephen began to fly into the air until he was looking down at Loki.\n\n\n“We’re going to fight flying are we?” Loki asked smirking, he began to rise up into the air, he crossed his legs and looked at Strange challengingly. \n\n\n“You can fly brother?” Thor questioned surprised.\n\n\n“I’ve been able to for ages, I just haven’t,” Loki replied coolly, then there were almost 20 Loki’s in the room all glaring at Strange. \n\n\n“Oh, we’re doing that are we?” Stephen said more to himself than Loki, he crossed his arms in an X and multiple versions of his arms opened up from his side. They split until a circle of Stephen’s surrounded Loki. Loki smirked amused, each Loki turning to face a Stephen. The Loki’s and Stephen’s moved in synchronization. Each made an attack, Stephen’s with strings of energy and Loki with a dagger. The Loki’s and Stephen’s disappeared, leaving the originals to glare at one another. Loki sent a dagger at Stephen and with a wave of his hand the dagger turned around and shot back at Loki who caught it be the blade and threw it down. There was a screech from Loki as his body began to transform. The audience gave several yells of shock and fright when all of a sudden there was a large green dragon staring down Stephen. \n\n\nThe dragon lunged making a snap at the man who flew backwards out of the dragons range. Loki roared and a fiery burst exploded from the dragon’s mouth. Stephen swept his hands out and cutting the fire in half so it swept around him. He gathered the fire together and shot it back at the dragon who hissed as the flames scattered over his skin. Making a motion and uttering something the dragon began to screech as it was forced to change back into Loki. Loki fell to the ground and landed in a crouch a snarl on his face. \n\n\n“Go Strange!” cheered Tony along with several others who didn’t want Loki to win. \n\n\nHe conjured up at least a hundred daggers and threw them at Stephen who with a wave turned them into a hundred pink butterflies. The butterflies flew and tickled Loki’s face who regarded them with minor interest at their colour before looking back at Stephen anger on his face. Loki disappeared and then reappeared behind Strange grabbing the man's shoulder. Ice spread from his hand and began to cover Stephen’s body. A look of minor shock appeared on the Sorcerer's face and panic began to rise in Tony. Just before the Ice covered his face Stephen uttered another word and the ice broke. He spun, breaking free from Loki’s grasp. Loki quickly conjured up another dagger and stabbed Stephen. A gasp rose from several of the audience as the Eye of Agamotto enlarged blocking the attack. \n\n\n“Interesting amulet you have there,” Loki commented as the attack was blocked. Stephen hummed in acknowledgement as he grabbed Loki’s wrist. A glowing band appeared there and Loki fell down. He growled at Strange before closing his eyes and going limp.\n\n\n“Um, what?” asked Peter worriedly. Stephen furrowed his brow for a second before seeming to understand something. \n\n\n“So we’re doing that,” he muttered before going limp himself the cloak holding him afloat. Rising from his physical form Stephen saw Loki looking at him. \n\n\n“I’m impressed.” Loki mused as he watched Stephen’s limp body. Then he dived for Stephen and they grappled in mid-air, Stephen managed to kick Loki away and quickly broke into the physical plane. \n\n\n“Stephen? What the hell?” Tony almost shouted at him. “You gave us a heart attack.” \n\n\n“Sorry Tony, apparently we’re fighting in our astral forms now.” Tony glared at him.\n\n\n“Is that supposed to make any sense.” Before Stephen could reply Loki broke through as well and tore at Stephen, They spun in mid-air Loki managing to punch Stephen several times in the face. Stephen grabbed the man and threw him through the wall. Stephen followed and those not fighting gaped at what was happening. \n\n\n“I am so confused right now,” Rhodey muttered staring at the point Loki and Stephen had gone through the wall. Several people jumped as Loki reappeared and flew towards Stephen’s physical form. He made a motion towards his head and spoke some words softly. Stephen burst through the wall and upon seeing Loki’s actions hissed.\n\n\n“Mind control is not allowed.” The Clint’s eyes widened the most at that.\n\n\n“You never said that,” Loki smirked before disappearing. Stephen disappeared as well and jerked awake in the physical world. Stephen was about to cast something when his eyes glazed over. Tony jumped up about to do something when Stephen moved his hand and the band on Loki’s wrist broke off. \n\n\n“Much better.” sighed Loki rubbing his wrist. Tony was about to jump the god and tear him in half himself when the Eye of Agamotto glowed and Stephen’s eyes reverted back to normal.\n\n\n“Asshole.” he glared at Loki who smirked back. He made a motion and a circle appeared under Loki.\n\n\n“Not again.” Loki cried before falling through the hole which closed behind him. Stephen floated back to the ground and began to walk back to the chairs.\n\n\n“I’ll bring him back in half an hour or so,” Stephen said to Carol as he walked past.\n\n\n“You idiot,” Tony muttered, poking Stephen as he sat down.\n\n\n“Please,” Stephen started offended. “I’m a hot idiot if anything.” Tony grinned at the man.\n\n\n“Can’t argue with that.”\n\n\n-\n\n\nAfter everyone had trained the Avengers dispersed. Stephen bringing back Loki who glared at the man, swearing profusely in several alien languages before oddly enough complimenting him on his magic skills. \n\n\n“Vision?” Wanda called as Vision began to head back to his room. He paused.\n\n\n“Yes, Ms Maximoff?” \n\n\n“Vis please.” She begged reaching for his hands but her skin phased through it. Her eyes burned.\n\n\n“Do you want something.”\n\n\n“I thought you had forgiven me. For what I had done.” Vision looked at her, almost sadly.\n\n\n“I had, but then you didn’t change. If one does not change for the better after regretting something then forgiveness is not deserved.” Wanda blinked her eyes, determined not to burst into tears. \n\n\n“I’m so sorry Vision. I can be better. I can be good.” Vision considered this. \n\n\n“You can already be good. I wanted you to be kind.” \n\n\n“Then I’ll be kind,” Wanda said firmly.\n\n\n“We shall see.” Vision replied before turning and phasing through a wall. Wanda wiped her eyes choking back sobs.\n\n\nTony stumbled into the West Wing common room, another night lacking sleep meaning he sported dark shadows under his eyes, tousled hair, and a half asleep expression. The coffee machine started up and he moved in the direction of the noise. The beautiful scent of fresh coffee made him sigh as he managed to stare at the mug filling with dark liquid at a sickeningly slow pace. \n\n\n“No sleep?” At the voice Tony jumped a foot in the air and spun around.\n\n\n“Jesus- fucking- christ Strange! Give a man a heart attack why don’t you?!” Tony blinked several times in an attempt to wake himself up first. Stephen was watching him in amusement, his own mug embraced in his shaking hands. \n\n\n“You walked right by me so it wasn’t actually intentional.” Stephen sipped the liquid in his cup. The constant image of perfect calmness. \n\n\n“Of course it wasn’t.” Tony muttered glaring at the still filling coffee. “What are you doing awake even? It’s only…”\n\n\n‘12:52 Boss.’\n\n\n“Already?” Tony looked at his watch to confirm FRIDAY’s response.\n\n\n“Where you holed up in the lab again?” Stephen asked disapprovingly. \n\n\n“No actually, the mix of regular nightmares, phantom pain, and nightmares induced from the phantom pain just kept me from sleep.” Tony retorted avoiding Stephen’s eyes and willing the coffee to fill faster. \n\n\n“That can get quite irritating.” Stephen answered in a soothing yet knowing. “Do you want to talk about it?” \n\n\n“Not especially.”\n\n\n“Ok.” With Stephen’s reply Tony eyed the doctor suspiciously. \n\n\n“You’re not going to push me to tell you?” Tony asked as he picked up the finally finished coffee.\n\n\n“Not if you don’t want me to.” Stephen said matter of factly. Tony smiled in relief.\n\n\n“God I love you.” Tony sighed grinning at Stephen. \n\n\n“Trust me, the feeling’s mutual.” Stephen smiled back, joy in his eyes. They stared at one another for several seconds when Hope spoke from where she had appeared right next to them.\n\n\n“So this is incredibly adorable and everything but can you either kiss or get out of the way of the coffee machine.” she was staring at said machine longingly. Tony smirked at Stephen.\n\n\n“I’m fine with the first option.”\n\n\nStephen’s grin grew and Hope groaned. “Go eyefuck somewhere else that isn’t blocking the caffeine.” she begged. \n\n\n“Way to interrupt the moment Hope. I was really feeling the gay.” Tony grumbled\n\n\n“The gay you’re eminatting isn’t confined to that spot trust me. You will end up suffocating the world with the unresolved gayness surrounding you guys.” She was still gazing at the coffee machine and Tony rolled his eyes smiling slightly before he and Stephen edged away from the coffee machine.\n\n\n“Now where were we.” Tony smiled flirtatiously at Stephen. \n\n\n“Maybe I’m reading too much into the situation but I believe we were going with option one.” Stephen replied eyes glinting. \n\n\n“I’m fine with that.” Tony winked and pressed his lips to Stephen’s.\n\n\n-\n\n\nWhen Rhodey and Carol came in later the first thing they saw was Tony asleep on the couch with his head on an also sleeping Stephen’s lap. The Cloak of Levitation was settled on top of them both.\n\n\n“Well it’s about damn time.” Rhodey smiled heading over to the table Hope was working at. \n\n\n“Their sexual tension between them would’ve ended up destroying the universe before Thanos had his chance.” Carol added. \n\n\n“You should’ve been here when they were making out.” Hope retorted. “It got quite distracting while I was coding.” She looked up at them. “Where’d the cat come from.” Carol smiled at the cat she had cradled in her arms.\n\n\n“We found him while out walking.” Hope opened her mouth looking amused. “Before you ask he was homeless so we didn’t steal him.” Hope closed her mouth smirking. Peter entered the room Harley following behind him.\n\n\n“Morning.” they yawned.\n\n\n“Afternoon.” Rhodey replied. \n\n\n“Teenagers.” sighed Hope typing quickly. At the sight of Tony and Stephen, the kids grinned looking at each other and then at the others. \n\n\n“Yep.” Rhodey grinned motioning them to come over. At the sight of the cat they grinned wider.\n\n\n“That is adorable.” Peter smiled scratching the cats ears. “What’s his name?”\n\n\n“Chewie.” answered Carol. At that Peter’s entire face lit up. \n\n\n“You are amazing.”\n\n\n“Nerds.” scoffed Rhodey amused.\n\n\n“Why thank you.” Carol smirked at him. \n\n\n“Is anything happening today?” Harley asked sitting down.\n\n\n“Not really. There is a charity thing this evening but Tony and Stephen were going to go to represent the Avengers.” Rhodey replied scratching his chin. \n\n\n“So nothing then.” Hope summarised. Peter stood back up from patting Chewie and headed to the fridge. He closed the door to the fridge and jumped back a foot dropping the carton of milk which was quickly recovered with a flick of his wrist and the new web shooters.\n\n\n“Loki.” He stuttered.\n\n\n“Spider.” Loki replied from where he was leaning against the wall.\n\n\n“I thought you were staying with the Asgardians?” asked Harley watching them from the table.\n\n\n“Yes but they get so dull sometimes.” Loki stated surveying the room. His eyes stopped a millisecond on Stephen and Tony before looking back at Peter who scrambled away from the fridge looking slightly nervous.\n\n\n“I actually wanted to talk to the wizard about something but he appears to be a bit- preoccupied- at the moment so I guess I’ll just wait.”\n\n\n“Right.” Rhodey said before turning away from the god. \n\n\n“Hang on what time is it.” Hope asked looking at her watch.\n\n\n“Isn’t a bit pointless to ask the time while looking at your watch?” Harley questioned snorting. \n\n\n“Crap. I gotta go guys. I’m late meeting my dad.” Hope jumped up pulling the box containing her suit out of her pocket and shrinking the tablet she had been working on.\n\n\n“Is it that hard to carry a regular sized item.” snickered Carol. Hope glared at her before rolling her eyes and hurrying out. “Speaking of time, I should wash Chewie.” Carol stood up cradling the purring cat before walking out.\n\n\n“That’s going to end well.” Rhodey sighed pulling out his phone.\n\n\n-o-\n\n\n“Have you seen Stark?” asked Sam, “I needed him to look at my wings.” Wanda snorted.\n\n\n“Like he’d do that.”\n\n\n“Not for days.” answered Steve irritated. Everytime Tony had spotted them he had either ignored Steve’s questions completely or walked in the opposite direction. \n\n\n“He is purposely trying to be difficult.” grumbled Clint. \n\n\n“Hasn’t he always.” argued Wanda.\n\n\n“FRIDAY? Where is Tony?” tried Steve again. As per usual, there was no answer.\n\n\n“FRIDAY please.” Steve begged. \n\n\n‘Boss is out doing press.’ \nFRIDAY replied sounding highly annoyed. \n‘I will not be telling you any more. Boss has more important things on his mind then your inquiries.’ \n\n\n“I just want to talk.” Steve muttered. “This is just getting ridiculous. Tony is acting childish when some of us are just trying to put this behind us.” There was no answer and Steve huffed, resound to sit in the Main Common Room until Tony returned from wherever. \n\n\n“He probably is ‘doing press’ just not in the PR sense.” Clint growled clenching his fists. Wanda’s face darkened. Natasha sighed and stood up leaving to her room. She had been getting more and more fed up with them for a while now. Scott had mostly been avoiding them which didn’t bother Steve that much. He didn’t really know Scott \n\nthat \n\nwell. \n\n\n-\n\n\nAn hour later Steve looked up from his sketchbook to the noise coming from the hall. He couldn’t make out the words but it was definitely Tony and someone else.\n\n\n“-go get the damn thing then. I won’t wait for you though… Oh who am I kidding, I will.” Tony’s voice started making more sense as they grew closer. There was a chuckle and then Tony’s was the only set of feet heading this way. Steve stood up the others tensing. Tony entered the room looking at his tablet. He was wearing a suit so FRIDAY must not of been lying when it said he was coming from an event. \n\n\n“Tony?” At the sound of Steve’s voice Tony turned sharply. Paling slightly before replacing his usual expression.\n\n\n“Rogers.” Tony replied stiffly before continuing to the door. Steve moved in front of him. \n\n\n“I just want to talk. You’ve been avoiding us.”\n\n\n“I just want to go to bed.” Tony replied before stepping around him. Wanda’s red magic surrounded the door and Tony stopped. \n\n\n“Like the \n\ngreat Tony Stark \n\never sleeps.” Clint snorted also standing.\n\n\n“So you’ll hold me in this room against my will. How mature.” Tony said coolly ignoring Clint. \n\n\n“Don’t be dramatic Tony, we just want to talk.” Steve sighed.\n\n\n“Then talk.” Tony stated. “You probably have a couple of minutes before whoever FRIDAY alerted arrives.” Steve glared at the immature man for a second before speaking.\n\n\n“You’ve been avoiding us.” Steve began. “We are trying to put what happened behind us and you are making that impossible.” Tony turned sneering at them.\n\n\n“I’ve already put it behind me, except for the PTSD, thanks for that by the way. I don’t actually have to see you at all apart from during training and meetings so if I don’t want to talk to you I don’t have to.” Tony turned back towards the door obviously preparing to break through. Steve grabbed Tony’s shoulder.\n\n\n“Look at us.” At the touch Tony flinched severely, jerking out of Steve’s grasp and glaring at him.\n\n\n“Again, no thank you.” \n\n\n“Tony.” Steve stepped forward again, Tony stepped back in an attempt to keep distance between them, instead he pressed up against the wall. “I’ve already apologized, we should just go back to how things used to be.” Tony snorted attempting to conceal the overwhelming panic filling him. \n\n\n“You mean the shit letter you sent me? The one in which the words \n\nI’m Sorry \n\nwere never actually written?”\n\n\n“You’re the one who actually should be apologizing Stark.” Wanda growled red magic still consuming her fingers. Tony shook his head disbelieving. \n\n\n“Fine Tony, If that’s what you want.” Steve sighed, “I’m sorry, now will you talk to me?”\n\n\n“That sounded \n\nso \n\nconvincing.” Steve glared at Tony.\n\n\n“How about we try a conversation? How about… Where’s my shield?” Tony grimaced at the mention of the weapon.\n\n\n“I should’ve known this was about your precious shield.” Tony hissed, the pain of his chest throbbing. \n\n\n“What the hell did you do to it Stark?” Clint growled. Tony considered for a moment. \n\n\n“Let’s see.” he spoke mockingly. “I melted it down with info gotten from Wakanda… And then I made it into my new ribcage. Kind of poetic you know? The thing that smashes in your ribcage \n\nagain, \n\nis used to make a new one.” There was a shocked silence. \n\n\n“You’re a selfish bastard you know Stark?” Wanda growled obviously ignoring the smashed in ribcage part. She moved forward threateningly causing Tony to press himself into the wall. Her magic swelled around her hands and her eyes darkened as she brought one hand to his head, pushing a hard force of magic against his chest with the other. Nothing happened. \n\n\n“What did you do?” Wanda asked confused as to why her usual mind trick wasn’t working. Tony had fallen silent and was barely breathing pressed against the wall looking like a deer in headlights. \n\n\nA glowing portal opened and Stephen stepped out, Steve was irked to see he was also in a suit but unlike the tie, Tony was wearing, sported a bow tie that had been undone after the event.\n\n\n“Tony, FRIDAY said there was an is-” he stopped speaking as he saw the situation in front of him. Tony pressed against the wall, Wanda in front of him with magic swirling her fingers and around Tony. Steve and Clint both in defensive stances and Sam just chilling in the background. His face darkened considerably and he looked truly terrifying as he glared at them with enough fury to kill them then and there. Steve saw his mouth move and hands flash and then there was darkness.\n\n\n-o-\n\n\n“Tony?” Stephen said in worry rushing over to the frozen man in worry. Tony didn’t move still staring straight ahead and eyes wide in terror. Stephen hesitantly took his hand and after no reaction hugged a comforting arm around his shoulder, leading him to the West Wing. \n\n\n“Those assholes are lucky I didn’t curse them.” Stephen hissed, eyes flashing in anger. “Why you let them come back so… kindly… I’ll never know.” Stephen brought Tony into the darkness of his room, FRIDAY setting the light to a dim glow. Tony regained vague consciousness as he stiffly lay down eyes still filled with terror of whatever memories the encounter had brought on. Stephen sat down next to Tony in the bed. Tony hesitantly put an arm around Stephen’s waist. Stephen breathed in sharply as he noticed Tony was shaking. \n\n\n“I’m so Sorry.” He whispered to Tony. “I shouldn’t have left even for those few minutes.” Tony shook his head slightly still shaking.\n\n\n“Not your fault.” He murmured into the bedclothes. Stephen sighed and placed a gentle kiss on Tony’s for, he thought steadily darker thoughts about the Rogues, as he listened to Tony’s breathing eventually grow slower and more calmed as the shaking stopped and he relaxed into Stephen’s comfort\n\n\n“So Stephen,” Hope asked looking at the man. “Scott was wondering what happened to the other Rogues and FRIDAY told me to find you.” \n\n\nStephen didn’t answer straight away instead he added some tea leaves to a cup before talking.\n\n\n“Well isn’t that interesting” Hope sighed and leant against the counter glancing briefly at Tony asleep on the couch. \n\n\n“Okay. What did they do.” Stephen drank from his cup before answering, a dark look crossing his face.\n\n\n“According to Tony, it’s just their usual assholeyness.” He glared angrily at nothing in particular.\n\n\n“And what does that mean?” Hope said raising her eyebrows.\n\n\n“That they cornered him, demanded to talk to him, and mind raped him \n\nagain\n\n.” Hope’s expression darkened.\n\n\n“Well, point me to them and I’ll throw their asses in jail,” Stephen smirked. \n\n\n“Well, that would be easy if they were in this dimension.” Hope grinned and was about to answer when Tony groaned and got up rubbing his face.\n\n\n“Seriously? Not that I’m particularly against the idea but what dimension exactly are they in?”\n\n\n“The Dark Dimension,” Stephen answered taking a long sip from his tea. Tony’s eyes widened.\n\n\n“Couldn’t they die in there?”\n\n\n“No actually, they’re shielded.” Stephen wasn’t looking too happy about that fact. “They should be happy they aren’t in the Nightmare Realm.” Tony sighed.\n\n\n“Well, we have to bring them back.” \n\n\n“Excellent.” Hope smiled, “Then they can be put in jail.” Tony rolled his eyes.\n\n\n“As satisfying as that sounds, we can’t.”\n\n\n“Why not? there’s plenty of evidence against them.”\n\n\n“I know it’s just, We could use them against Thanos.”\n\n\n“None of them would be able to scratch someone who is the strength of them all combined.” Stephen argued, “The only one who could be of any use is the witch who will \n\nnever \n\nfollow any orders.”\n\n\n“Stephen,” Tony sighed taking his hands. “Thanos is bigger than the issues that the Avengers are having. He will kill us all if we don’t stop him and I don’t want to lose you or frankly the universe for that matter. Even if it means working with them.”\n\n\n“So until Thanos comes Rogers and his band of assholes get to hurt you left and right.” \n\n\n“Just…” Tony grimaced. “We can give them one last chance and if they dial down the assholeness then we don’t arrest them.” Stephen stared at him incredulously.\n\n\n“You are far too forgiving for your own good,” Hope muttered. \n\n\n“Very true.” Agreed Stephen. \n\n\n“Come on Stephen, at the very least we can throw them at Thanos’s army when the time comes.” Tony pleaded. Stephen sighed in defeat.\n\n\n“Fine, but if they even look at you funny, nightmare realm here we come.” Tony rolled his eyes a ghost of a smile on his mouth. \n\n\n“I’m liking this protective boyfriend thing, it’s very hot.”\n\n\n“Well, it is what you signed up for.” Stephen grinned pulling Tony closer. \n\n\n“The protectiveness or the hotness?”\n\n\n“Hmm… What do you think?”\n\n\n“I can’t really decide… one of them is clouding my decision.” Tony leaned in so his and Stephen’s noses were a centimetre apart. \n\n\n“Which one would that be?” Stephen almost whispered. Tony grinned closing the distance between them.\n\n\nRight…” sighed Hope. “I’ll just leave you to it then.” Smirking, she turned and headed in the direction of her room. “Why I’m the one you always decide to make out around I’ll never know. But make sure you send the Rogues back at some point!” She called over her shoulder.\n\n\n-o-\n\n\nScott screeched and jumped up on a chair in a ridiculous fighting stance as a portal opened above him. He relaxed as he saw Steve, Wanda, Clint, and Sam fall out of it.\n\n\n“Where have you been,” Natasha asked sounding bored as she turned the page of some Russian book she was reading.\n\n\n“I am going to fucking murder that wizard.” Hissed Clint through gritted teeth. He was shaking slightly and still looked frightened from his little interdimensional trip.\n\n\n“How’d you piss him off this time?” Scott questioned getting down from his chair. \n\n\n“That’s just it!” Sam exclaimed. “We didn’t!”\n\n\n“We were just speaking to Stark when he shows up and goes all crazy on us,” Wanda growled flexing her glowing fingers. \n\n\n“And he sent us to that place…” Steve shivered. “There was some messed up stuff in there.”\n\n\n“How exactly were you speaking to Tony?” Natasha asked eyeing them over her book.\n\n\n“Well…” Steve muttered collapsing into a chair opposite her, still shaking slightly. Then Rhodey and Carol stormed in. \n\n\n“What the hell were you thinking.” Rhodey practically yelled at them. \n\n\n“You don’t corner a teammate and use your power’s unwillingly on them,” Carol said, looking more professional than Rhodey and yet still furious.\n\n\n“We just wanted to talk to Stark,” Wanda argued. Rhodey glared at her.\n\n\n“No. This is the part where you shut it! No stupid ass excuses. No piling the blame on Tony. We all saw the footage and that is not you \n\nwanting to talk to him\n\n. Or you \n\nasking to speak with him\n\n. That is you blocking his exits, Provoking traumatic memories, and attempting to force your way into his mind!”\n\n\n“Rhodes, dial it down.” Muttered Carol shooting him a look, Rhodey obeyed and taking several breaths but still glaring bloody murder at them as Carol continued. \n\n\n“What you did was unprofessional, uncalled for, and frankly incredibly rude. It is not permitted in the Avengers Initiative and is the kind of behaviour we are supposed to be fighting not invoking. Because of Tony’s reluctant arguments, yet still, arguments for you to remain, members of the Initiative, you will get one more chance. But no talking to Tony, no contact with Tony unless by his request. If any more behaviour like that occurs. Immediate termination of your positions will occur, removal or restriction of your powers, and possible jail time will occur.” She glared at them again, “Do I make myself clear?”\n\n\nWanda scoffed, “What about the Wizard. He attacked us.” Carol took a deep breath. \n\n\n“Dr Strange was aiding a teammate that you were assaulting and will not be punished for his defence.” Wanda continued to glare at Carol not saying anything.\n\n\n“You have made your point clear… \n\nCaptain\n\n.” The word said to another seemed dry on Steve’s throat, he coughed and looked down. After a final dirty look, Rhodey and Carol left the room muttering to one another.  \n\n\n“So…” Natasha said coolly. “You went and tried to forcefully talk to him after I specifically told you not to.” Steve winced recalling a conversation Natasha and he had the morning before. \n\n\n“Wait…” Scott muttered. “How’d did he react that made it so bad I mean apart from the obvious... bad reasons.”\n\n\n“Stark froze up,” Sam explained as everyone threw themselves onto the couch. “Like wide eyes, deer in headlights froze up. Looked a damn sight near terrified.” Natasha was glad to hear regret in at least \n\none \n\nof their voices.\n\n\n“And who specifically made him terrified?” Scott asked sounding worried and curious.\n\n\n“It was me I guess…” Steve muttered, “I didn’t mean to. He was just overreacting when I put my hand on his shoulder.”\n\n\n“Oh really.” Natasha’s voice was cold. “Well Steve, judging by Tony’s seemingly extreme reaction, it’s about time you told the truth about Siberia.” Steve blinked, avoiding her eyes. \n\n\n“I told you. We went to find the soldiers. Tony showed up, Zemo pitted us against one another and we fought. I disabled Tony’s suit and me and Bucky escaped.” There was a silence.\n\n\n“The \n\nwhole \n\ntruth Rogers.” Natasha snapped. Steve looked at her oddly for the halt in using his first name.\n\n\n“That is the truth.”\n\n\n“Oh really. Well, tell me how Zemo pitted you and Tony against one another.” Steve didn’t answer and soon enough everyone was looking at him expectantly.\n\n\n“He showed Tony the video of the Winter Soldier killing his parents.” Steve finally muttered. More silence followed these words, everyone looked horrified except for Natasha who looked furious. Even Wanda had trouble holding back her shock.\n\n\n“And you hadn’t told him.” Natasha practically snarled. Steve avoided her eyes. “You idiot! You said you would. That you would handle it and I could trust you.” Steve still isn't looking at her.\n\n\n“I had to protect Bucky Nat, Tony was going to kill him!”\n\n\n‘If I could correct that Mr Rogers.’ \nFRIDAY’s voice was surprisingly cold, \n‘Boss was barely using any of his attacks against you and had no intent to kill. Unlike some people.’\n\n\nSteve flinched slightly at the last words. \n\n\n“Tony was going to be okay, I didn’t hurt him. I just disabled the suit with my shield.”\n\n\n“What?” Scott asked confused, “How?”\n\n\n“Well, I destroyed the Arc Reactor.” At these words, Natasha seemed to get even angrier.\n\n\n“You smashed in his chest with a \n\nvibranium \n\nshield then.” She hissed. The reality of that statement made Steve looked a bit guiltier.\n\n\n“Yikes man.” Sam gaped.\n\n\n“I second that statement,” added Scott.\n\n\n“I had to protect Bucky.” repeated Steve, “If he was captured they would jail him for life! He doesn’t deserve that.”\n\n\n“And Tony deserved what he got?” Natasha retorted, then glared at Wanda as she looked like she was going to say he did.\n\n\n“Bucky is my friend,” muttered Steve. Natasha narrowed her eyes.\n\n\n“Well if he is all that matters to you then I guess we’re just working together.” Natasha snapped turning her back on them and leaving the room.\n\n\n“Yeah, I second that.” Scott agreed. “Stark can be an ass but yeah, he didn’t deserve that.” He cautiously followed Natasha out glancing back at them several times while he did.\n\n\n-o-\n\n\nLoki stared at Stephen for a second. The Main Common Room was empty except for the sorcerer meditating in midair. After Thor had left to Nidavellir in the night without really telling anyone save Heimdall, Loki had decided to get away from the Asgardians and use the opportunity to finally talk to Strange. \n\n\nLoki rose into the air and sat in front of Stephen, imitating his cross-legged posture. \n\n\n“What do you want Loki,” Stephen asked without opening his eyes.\n\n\n“I am curious about your amulet,” Loki stated calmly. Stephen opened his eyes, looking at the god,\n\n\n“What about it?” Loki noted Strange immediately looked defensive.\n\n\n“Merely what it is. One magic user to another.” Loki kept eye contact with the Doctor as he spoke. \n\n\n“I believe you know what it is.”\n\n\n“I have my suspicions.” Loki smiled slightly as Stephen sighed. \n\n\n“The Eye of Agamotto is a powerful relic.” \n\n\n“Very powerful.” Loki agreed, “One of the most powerful, dare I say \n\nthe\n\n most powerful that there is.” Stephen narrowed his eyes, trying to see if there was a plot in Loki’s mind. \n\n\n“I’d argue that it is one of the most powerful.” Stephen finally said.\n\n\n“So it is an Infinity Stone.” Loki smiled triumphantly. \n\n\n“Well, it would be quite rude to consider Vision a relic but, yes. The Time Stone in fact.”\n\n\n“How I wonder is it that you humans managed to get your hands on so many Infinity Stones.” Loki sighed, Stephen snorted.\n\n\n“Partly from you, but what I wonder is how you got the Tesseract when Asgard was destroyed.” Loki didn’t say anything, opting to stay silent and narrow his eyes at Stephen who was smirking.\n\n\n“Couldn’t let Thanos find it in the ruins,” Loki answered softly. \n\n\n“Right, sure.” Stephen closed his eyes again. “I am trying to meditate if you could leave me be.”\n\n\n“Really?” Loki smirked, “I’m surprised you aren’t in a dark corner with Stark.” Stephen’s eyes immediately flew open, becoming defensive again.\n\n\n“What’s that supposed to mean?” He asked Loki raised an eyebrow amused.\n\n\n“Oh, you know exactly what it means. Don’t worry, on Asgard gender preference doesn’t often occur.” Stephen sighed.\n\n\n“Okay then, I didn’t ask for your opinion but whatever. Changing the subject again, the Tesseract is safe with you?”\n\n\n“You can count on it. Thanos will not be getting the Space Stone from me if I can help it.” \n\n\n“Good.” Stephen closed his eyes again and after watching him for several seconds Loki returned to the ground and left, as he left the room seeming to be distracted by his thoughts, Loki didn’t notice Clint duck out of sight, eyes wide with what he had just heard.\n\n\nClint burst into the East Wing Common Room, which one might notice, was smaller than the West Wing Common Room, he was panting and looking panicked.\n\n\n“What is it?” Wanda asked immediately, standing up.\n\n\n“You guys, this is bad, super bad.” Clint gasped, gesturing in the direction of the Main Common Room.\n\n\n“What?” Steve pressed urgently.\n\n\n“I just heard \n\nLoki \n\ntalking to \n\nStrange.\n\n” Clint spat both their names with disgust.\n\n\n“And?” Sam asked the only one who hadn’t stood up at his entrance. \n\n\n“Loki has the Tesseract,” Clint said furiously. Steve gaped.\n\n\n“What!?”\n\n\n“It gets worse.” Clint insisted. “The thing that powers the Tesseract, the Infinity whatever, Strange has one too.” Wanda and Steve stared in horror at Clint, Sam, however, only looked mildly anxious.\n\n\n“Well, it should be fine,” Sam said uncertainty lacing his words. “Stark wouldn’t let them keep them if they weren’t trustworthy.”\n\n\n“I doubt Stark would do anything against \n\nStrange.\n\n” Clint snarled, “Not when they are all cozying up together.” A beat of silence followed this statement.\n\n\n“What’s that mean?” Steve asked sounding genuinely confused. Clint rolled his eyes.\n\n\n“It means that Strange and Stark are together.”\n\n\n“Like together together?” Steve raised an eyebrow barely believing this. \n\n\n“It would make sense.” mused Wanda, her eyes flashing.\n\n\n“I’m still not following,” Steve said, Clint rolled his eyes again.\n\n\n“It means they’re fucking Steve.” \n\n\n“But-” Steve closed his mouth, then opened it again, then closed it, doing a great expression of a gormless fish. \n\n\nOut of all the things that Steve had to get accustomed to after waking up from the ice, the concept that men could be with men and ladies could be with ladies, still confused him.\n\n\n“We have to do something about this.” Clint was saying as Steve tried to process the information.\n\n\n“Yes, we do.” Steve agreed, thinking about Tony and Strange. “Strange could hurt Tony.”\n\n\n“I think he meant Loki having the Tesseract Steve.” Wanda sighed.\n\n\n“Um, why?” Sam asked, unconcerned. “I doubt Loki would try anything. Especially with all the Avengers around.” \n\n\n“Oh, he would.” Clint hissed, still fuming. “We need to get it away from him, and Strange too if he has another similar thing.”\n\n\n“Yes.” Wanda nodded, “He didn’t hesitate to throw us in that place, without any provocation even!”\n\n\n“Tony probably doesn’t know about Strange having an item that could be as dangerous as the Tesseract. If he did I doubt he’d trust Strange” Steve said attempting to convince himself. \n\n\n“Yeah sorry, man.” Sam sighed, finally standing up. “I’ve stood behind you for ages, but going up against two of the most powerful people in the Avengers? Maybe even all the Avengers again?! You guys are nuts.” He shook his head disbelievingly. “I’m going to my room.” He strode out, still shaking his head.\n\n\n“Honestly.” Wanda scoffed. \n\n\n“We don’t need him.” Clint waved off, “Right now we need to figure out a plan.” Steve blinked, staring at the door Sam had left through. His friends were just abandoning him left and right.\n\n\n“We should gather more information,” Steve ordered. “Make sure they actually have the Tesseract and whatever.”\n\n\n“Also,” Clint flicked his eyes upwards. “We should actually make a plan later.” Steve nodded, understanding that FRIDAY could hear all their words. \n\n\n“Let’s meet after the meeting later today,” Wanda suggested. Steve nodded.\n\n\n“Yes, let’s.”\n\n\n-o-\n\n\n“Is Tony still in bed?” Bruce asked looking around.\n\n\n“I don’t know.” Stephen furrowed his brow, “I’ve been at the Sanctum and haven’t heard from him since last night.” Bruce nodded vaguely.\n\n\n“Well, he’s going to miss the meeting if he doesn’t get up soon,” Carol said from the couch where she and Rhodey were watching the news.\n\n\n“He probably isn’t asleep.” Rhodey snorted, he was seated next to Carol, an arm around her. “Tony sleeping willingly is not commonly heard of.”\n\n\n“Hmm.” Stephen gazed at the hall to the bedrooms, looking concerned. \n\n\n‘It is 14:10.’ \nFRIDAY informed them. Rhodey sighed. \n\n\n“Looks like we have to go set up the meeting.”\n\n\n“Can I come?” Bruce asked, “I don’t really have, well anything, to do.” Carol nodded smiling. \n\n\n“Sure. Stephen? Can you make sure Tony doesn’t miss the meeting?” Stephen nodded starting to head towards the bedrooms.\n\n\nStephen could hear Rhodey, Carol, and Bruce talking as they headed towards the meeting room. He walked to the door to Tony (and maybe sometimes his) room. Carefully, he opened the door. The room would be completely dark lacking the blow glow from the Arc Reactor. \n\n\n“Tony?” Stephen asked softly, leaving the door slightly ajar as he moved towards the man lying on the bed. Tony made a noise halfway between a groan and a whimper in reply. Sitting on the bed, Stephen could now see that Tony was covered in a sheen of sweat and was shaking uncontrollably. \n\n\n“Tony?” Stephen repeated, worry filling his tone as he gently rested a hand on the man’s skin. Tony groaned again, rolling towards Stephen. \n\n\n“Urgh.” He groaned. Tony hands were rubbing the Arc Reactor furiously. But he was obviously awake. \n\n\nUnderstanding immediately, Stephen opened the nearby box of pills and in the dim light attempted to read the boxes, looking for the box of medication. \n\n\n“No,” Tony muttered, voice tense and hoarse.\n\n\n“You have to.” Stephen breathed, still rummaging through the packed box. \n\n\n“I won’t be able to take-” His voice cut off with a severe wince, his hands pressing more firmly on the Arc Reactor. \n\n\n“A 10?” Stephen asked softly, hesitating over the box. Tony chuckled dryly, wincing again. \n\n\n“Try 20, or 50,” he hissed, squeezing his chest. “Or 1-fucking-thousand.” He groaned, “Fri? Why’s it so hot in here?” The room instantly cooled a few degrees.\n\n\n“I’ll go tell Carol we’re skipping the meeting,” Stephen said, stroking Tony’s hair. \n\n\n“No.” Tony winced, “You go. I’ll-” He breathed in sharply, wincing again. “Be fine.” Stephen snorted quietly. \n\n\n“I’m not going.”\n\n\n“Then I’ll drag myself to the meeting and we’ll both look stupid.” Stephen glared at him.\n\n\n“At least take your pills.” He said firmly, placing the right dosage on the bedside table. \n\n\n“Once I can actually breathe properly.” Tony agreed, panting slightly. Stephen paused, before standing and quietly closing the door. He began to head back to the kitchen, still troubled. \n\n\nStephen knew that Tony had more trouble with pain than him, the chronic pain mixing in with the phantom pain, causing a pain-a-palooza. He had said once that it was like being back in a desert with terrorists tearing up his chest all over again but only \n\nslightly\n\n muted. \n\n\n“Crap,” Stephen muttered to himself as he opened the small freezer in the common room and taking out an ice pack Tony had specially bought for this purpose. He headed back to the room, quietly opening the door again and moving to the bed, wrapping the pack in a tea towel as he did so. He gently eased it into the hand Tony had on his chest. Tony sighed slightly in relief. \n\n\n“I’ll be back in 20 minutes to check on you,” Stephen promised, kissing Tony’s forehead comfortingly. \n\n\n“Always the Doctor,” Tony whispered, clutching the pack to the skin around the Arc Reactor. Stephen’s lip twitched, and after several seconds, he reluctantly got up. Looking back sadly as he closed the door, Stephen sighed. Turning away from the now closed door, Stephen glanced at his Cloak who had floated towards the room seeming unnaturally concerned. \n\n\n“Can you watch him?” Stephen asked, the Cloak ruffled in response before floating towards the door in an apparent yes. “Thank you,” Stephen whispered, running his shaking hand down the red fabric before heading towards the meeting room. \n\n\n-o-\n\n\nEveryone but Thor, Tony, and Strange are in the meeting room and Steve is getting restless. His eyes keep on moving to Loki, who has the Tesseract, the thing that has haunted him throughout the years. Carol and Rhodes are muttering together and Natasha, Scott, and even Sam, are sitting deliberately far from the Steve and the others. Finally the door opens and Strange walks in. He completely ignores Steve and the others, sitting in one of the two empty seats near the front of the room.\n\n\n“Tony?” Steve hears Rhodey ask softly. Strange shakes his head. \n\n\n“Tony’s… not feeling well, he’s still in bed.” Steve feels a twinge of something that feels in between confusion and disgust at the implication that Strange has been in Tony’s room. \n\n\n“So he gets to skip the meeting,” Clint said sounding mildly irritated. Strange and the others ignore the question continuing to discuss in even quieter voices. Steve notices that Strange isn’t wearing gloves like he normally does. He, along with several others in the room begin to stare at Strange’s hands. The thick white scars that almost seem like a line tracing his bones are obvious in the bright light of the room and Steve notices that they are shaking obviously. Apparently feeling their eyes on him Strange casually moves his hands off the table and into his lap. \n\n\n“Okay…” Carol began, standing. “Since Thor isn’t coming apparently, we will just go ahead and start the meeting.”\n\n\n“Are the children at school?” Vision asked in his usual calm voice. Steve guessed he knew what happened considering he hadn’t even acknowledged their presence in the room. \n\n\n“Yes, they know most of this stuff already though so it is okay.” \n\n\n“And Thor?” Natasha questioned As if he had just been summoned the door opened and Thor strode in. \n\n\n“Excellent.” He cried joyfully, “I haven’t missed the meeting!” There was a shocked silence in which Loki had stood up and moved towards Thor.\n\n\n“What the hel happened.” He hissed, Steve reluctantly had to admit that there was worry in Loki’s voice. For good reason too.\n\n\n“Why does it look like you were roasted,” Brunnhilde asked casually, but obvious concern was on her face. That, Steve thought, was a reasonable description. Thor’s skin was dirty, scabbed, and red with burns, but despite the mildly gruesome appearance, he was joyful.\n\n\n“Look, brother, I have acquired a new weapon!” Thor lifted a heavy looking axe off his back. “Stormbreaker is more powerful than Mjolnir and can even summon the Bifrost!”\n\n\n“Impressive, but what happened that got you, as Brunnhilde rightly put it, roasted.” Loki snapped.\n\n\n“Oh this is nothing, it’s just from taking on the force of Nidavellir.” There was a silence in which no one but the Asgardians seemed to understand something. Loki was staring unamused at Thor.\n\n\n“How exactly does one take on the force of a star?” he questioned irritated.\n\n\n“Painfully.” Thor smiled, clapping Loki on the shoulder and moving to his seat. Loki sighed, sitting back down next to Thor. \n\n\n“Right…” Carol said slowly. “Well, Thor, if you wish you can go to the med bay otherwise we should get started with the meeting.”\n\n\n“Of course Lady Danvers.” \n\n\n“Well…” Carol sighed, “Basically, we need to inform you of a threat on the horizon.”\n\n\n“Who?” Scott asked.\n\n\n“Thanos.” Strange informed. “He is the biggest threat any of us ever have, or ever could face.”\n\n\n“What’s he want?” Hope prompted.\n\n\n“The Infinity Stones.” Strange stated with disturbing calmness.\n\n\n“The what nows?” Scott mumbled. \n\n\n“The Infinity Stones are six elemental crystals of immense power.” He raised his shaking hands and three glowing rocks appeared in the air, surrounded by glittering stars. “Each containing an essential aspect of the universe. Reality, Power, Soul,” with each word the appropriate crystal in the air glowed. “Mind.” Strange indicated Vision’s forehead, “Space.” He glared at Loki for a second who sighed and raised his hand. The Tesseract formed in it and Thor shot a glare at Loki. The original Avengers were all staring at the cube with hatred. “And Time.” Strange stood and made a hand motion, opening the iris of the amulet around his neck to reveal a glowing green stone. \n\n\n“Thanos basically wants them to destroy half the universe,” Brunnhilde said still speaking annoyingly casually. \n\n\n“That’s a very simplified, blunt, way of putting it,” Loki responded coolly, making the Tesseract disappear again. \n\n\n“Oh I’m sorry,” Brunnhilde huffed sarcastically, “Thanos wants them to bring balance to the universe by destroying half of all life.”\n\n\n“Does that mean ants too?” Scott asked suddenly. Hope stared disbelievingly at him. \n\n\n“Is that seriously what you’re asking right now?!”\n\n\n“I don’t know.” Scott cried helplessly, raising his arms in bewilderment. \n\n\n“And we can trust Loki with an Infinity Stone?” Steve asked attempting to sound concerned and not confrontational. Which apparently failed.\n\n\n“Yes, you can.” Loki snapped. Clint snorted.\n\n\n“I understand your misgivings,” Thor said calmly, running a finger along the edge of the axe. “Loki is one of the more qualified people to protect the Tesseract.”\n\n\n“Especially with the trying to kill us with it.” Clint hissed.\n\n\n“Because shooting an arrow at Thanos will definitely keep the stone from him.” Strange sighed, glancing at the clock. Clint glared at the man. \n\n\n“Though I must say, you are taking the new of Loki having one of the Infinity stones much better than I expected.” Strange mused, looking directly at Clint who glared defiantly back. \n\nHe knows you listened in. \n\nObviously, Clint didn’t hear Steve’s mental warning and he continued to glare at the Sorcerer. \n\n\n“That is quite a good point.” Loki agreed, eyeing Clint. “I expected several measly death threats at least.”\n\n\n“Can you stop pondering your wish for death threats and focus?” Rhodes raised an eyebrow. “We still have things to discuss.”\n\n\n“We’ll need to find a way to remove Vision’s stone though.” Wanda murmured, concern in her voice. \n\n\n“Would that work? Removing the stone?” Vision asked Bruce. Bruce fiddled with his glasses.\n\n\n“It should. If there is a way to remove it you shouldn’t be harmed. The mind stone makes up only part of you, there’s also parts of me, of Tony, of ULTRON and JARVIS. There should be enough of you remaining to still… well… be you.” Vision nodded.\n\n\n“How will you remove it?” Natasha questioned leaning forward on the table. \n\n\n“Tony has a meeting with Princess Shuri sometime soon.” Strange supplied glancing at the clock again a worried expression on his face. \n\n\n“They’ll have a plan within the first 2 seconds of speaking.” Rhodes smiled. \n\n\n“Speaking of plans, we need one.” Carol began. “We need to decide if we are going to protect, destroy, or hide the Infinity Stones.”\n\n\n“Or something else,” added Rhodes.\n\n\n“Destroy them obviously.” Brunnhilde pointed out. “He won’t be able to get them at all.”\n\n\n“Or just some of them.” Loki continued.\n\n\n“Like the Mind and Space stone.” Strange added, Loki glared at him.\n\n\n“And not the Time Stone? Seems like that is the most important one to destroy.”\n\n\n“Generations upon generations of Sorcerers have protected the Eye of Agamotto. That is my job, not destroying it.”\n\n\n“So you’d rather die?” Loki snapped.\n\n\n“If even one of the Infinity Stones is destroyed then Thanos can’t wipe out half the universe If anything happens to the Eye of Agamotto that is a decision made by the Sorcerer's not the Avengers.” Strange replied curtly. \n\n\n“And your not an Avenger?”\n\n\n“I am both a Sorcerer and an Avenger.” Strange responded glaring at Loki.\n\n\n“Then where will it stay?” Loki raised an eyebrow.\n\n\n“At the New York Sanctum.”\n\n\n“Right, the horrendous place on Bleeker Street.”\n\n\n“I didn’t find it horrendous.” Thor butted in.\n\n\n“Especially after you smashed half the glass there.” Loki snapped. \n\n\n“You’re just irritated about the falling thing.” Strange sighed. Loki opened his mouth furiously but was cut off by Carol.\n\n\n“The decision on the destruction of the Time Stone will be left to the Sorcerers,” Carol confirmed. “The other Stones in out possession, however, will be destroyed.”\n\n\n“That is probably for the best.”Vision agreed. \n\n\n“I have means of destroying the stones.” Strange offered still glaring at Loki.\n\n\n“Perfect.” Rhodey smiled.\n\n\n“We’ll have to destroy them all at once though as it’s much safer that way.” \n\n\n“Then we wait for the Mind Stone.”\n\n\n“Well, that was a relatively simple plan,” Scott mumbled. \n\n\n“Once we make sure the Stones are destroyed we will confirm a plan against Thanos,” Carol said, ruffling through some notes in front of her.\n\n\n“Tony and I have been making plans.” Strange seemed to say more to himself. He glanced at the clock again.\n\n\n“Let’s discuss training for today.”\n\n\n“Basically, we need to make sure that the teams can actually work together and follow orders.” Steve sighed slightly considering the last words Rhodey had pointedly directed at him. \n\n\n“We have a simple exc-” Carol’s words were cut off by FRIDAY.\n\n\n‘Dr Strange, Boss requires your assistance.’ \nAs soon as she had finished speaking Strange was already leaving the room. \n\n\n“Is it urgent FRIDAY?” Rhodes asked sounding worried.\n\n\n‘Not anything horribly bad, just the usual bad.’\n\n\n“How comforting.”\n\n\n‘That isn’t a strong point in my programming.’\n\n\n“Well, Tony did create you.”\n\n\n“Okay then.” Carol continued. \n\n\nAt the end of the explanation, the basic training plan was laid out. They had to enter a simulation in which they would infiltrate and retrieve the objective. Seemed fairly simple to Steve.\n\n\n-o-\n\n\nAlmost half an hour later Stephen was quietly closing the door to Tony’s room. Passing the kitchen he dropped the ice pack in the sink and continued down to training. Thankfully Tony had been able to take the medication and was now drifting off to sleep in an attempt to sleep away the pain. \n\n\n“You can stay or join me,” Stephen told the cloak who had hovered up next to him. After a couple of seconds of Stephen looking expectantly at it, the cloak hovered back to the door of Tony’s room. Stephen couldn’t help but smile at it. Continuing back downstairs Stephen’s mind began to wander. He stopped outside the door of the Training room. \n\n\n“So Loki.” He began. “What exactly was the point of letting Clint see out conversation?” Loki stepped out of seemingly nowhere, smirking. \n\n\n“Reasons.”\n\n\n“That reason being just to make them pissed about you having the Tesseract?”\n\n\n“More or less, they were going to find out anyway and this meant they were less likely to attempt to murder me in the meeting.” Stephen glared at him before rolling his eyes and turning back to the door. He heard Loki chuckling behind him as he headed towards Hope who was standing next to an awkward looking Scott and watching several screens that displayed the other team.\n\n\n“‘Tis quite the shitshow.” Hope stated in her most serious voice. “None of them but Thor are listening to any of Rhodey’s orders half the time, the other half they are doing stupid things or complaining.”\n\n\n“As if they could act any more like spoiled children.” Stephen sighed. \n\n\n“Yes, they are quite the collection of brats.” She paused. “How’s Tony going?” Stephen sighed.\n\n\n“He is asleep. And hopefully will be feeling better tomorrow.”\n\n\n“Oh yes, he is making big plans for tomorrow,” Hope smirked at him suggestively. \n\n\n“He is?”\n\n\n“Oh yes, it’s supposed to be a secret though, so I didn’t say anything.” She put a finger to her lips. \n\n\n“Right tell me there are big plans but don’t tell me what they are. How considerate.” Hope didn’t answer, instead continuing to smirk.\n\n \n\nOnce training was over, the New Avengers team had successfully retrieved the objective in half the time it took the Rogues with fewer ‘casualties’ which was unsurprising considering the only Rogues following any orders were Sam and Natasha.\n\n\n“You are actually supposed to follow my orders!” Rhodey growled at the Rogues. “You’re not exactly doing yourself favours by not following them.”\n\n\n“Right,” Clint said clearly trying not to sneer. “We’ll remember that.” \n\n\n“You better. Otherwise, you are no use to the Avengers Initiative.” The Rogues looked offended as Rhodey began to talk to Carol in a low voice. Stephen was barely holding back a smirk. Tony would be sorry that he missed even more humiliation of Rogers and the assholes.\n\n\n-o-\n\n\nThey met later outside the compound and as far away as they could without drawing a large amount of attention.\n\n\n“So what’s happening?” Wanda asked.\n\n\n“We need a plan,” Steve stated. “Any ideas?”\n\n\n“Well…” Clint smiled devilishly. “The Sorcerer said the Time Stone was kept on Bleeker street right?”\n\n\nWhen Steve next saw Tony it was the morning of the second day since making their plan. Tony completely ignored him and Clint as he walked Peter and Harley towards the exit. Steve had to admit, he did look like he’d been sick. Tony’s skin was several shades paler than normal and if one looked closely he was shaking slightly. Steve made to say something but Tony and the kids had already left the room. \n\n\n“Ignoring us now,” Clint mumbled, fiddling with his glass. Steve didn’t answer, he could tell that Tony was saying something in the other room but they were too far away to make out the words. \n\n\n“What the hell?” Clint jumped to his feet as a portal opened nearby. \n\n\n“You are still the Sorcerer Supreme and you’re supposed to be \n\nprotecting\n\n the sanctum. Not popping by now and then.” An irritated sounding man spoke from the other side of the portal. \n\n\n“Now Wong, I have been doing both.” Strange replied, also ignoring Steve and Clint. “Besides, you are at the Sanctum almost all of the time.”\n\n\n“Yes, but I won’t be forever. My library is actually at Kamar-taj, and I need to be there.”\n\n\n“Just one more night.” pleaded Strange.\n\n\n“You have to stay at the Sanctum and protect the Eye Strange,” Wong answered sternly. \n\n\n“I can take it with me?”\n\n\n“No, No way Doc,” Tony said returning to the room. “You are not taking that damned amulet to dinner, it will completely and utterly ruin the mood.”\n\n\n“Exactly.” Wong jumped on the opportunity. “So you should stay at the Sanctum.”\n\n\n“What?” Tony yelped. “No way. Not happening. Cmon Wong, if Stephen bails then it will ruin the mood even more. You can’t have a date with only one person!”\n\n\nSteve grimaced at that, Tony ignored him even though he obviously had noticed. \n\n\n“Exactly,” Strange grinned. “You wouldn’t want to ruin our night would you?”\n\n\n“Oh and what about my night?” Wong retorted. \n\n\n“What were your plans? Reading a book and listening to Beyonce? You can do that in New York.” Wong glared at him before sighing. \n\n\n“You are incredibly infuriating Strange. Fine. One more night while you and Tony do whatever it is you do.”\n\n\n“Well.” Tony began grinning. \n\n\n“That does not mean I want to know.” Wong interrupted quickly.\n\n\n“Hang on, why am I Strange and Tony, well, Tony?” Wong smirked. \n\n\n“It depends how annoyed I am with you.” Strange rolled his eyes.\n\n\n“Gee thanks.”\n\n\n“Actually though, thank you.” Tony smiled at the man, Wong sighed again and then stepped back through the portal.\n\n\n“I expect you back by midday at the latest Stephen.”\n\n\n“Yes, mum.” Strange turned back to Tony as the portal closed and they began to head towards the West Wing together. \n\n\n“That’s useful,” commented Tony.\n\n\n“You do realise that with Wong returning to Kamar-Taj that I will have to stay there and only visit the Compound.” The implication made was clear in his voice.\n\n\n“Well, then I guess I’ll have to change my sleeping arrangements,” Tony smirked at the man, raising his eyebrows suggestively. \n\n\n“Well as the protector of the New York Sanctum I do get a private room.” Strange replied calmly. Tony grinned at the clear offer and Steve grimaced again.\n\n\n‘Boss you have a meeting with Ms Potts in 15 minutes.’\n\n\n“Oh shit.” Tony grimaced. “Pepper will kill me if I’m late.” He turned and began to head to the balcony. Strange watched amused as the suit began to melt around Tony. “Just I’ll send you a location. Meet me at 6?” \n\n\n“That is oddly early. I’ll see you then I guess.” Tony gave a final wave and then flew off.  At his exit, Strange’s eyes fell on Steve and Clint still seated. His smile fell replaced by a calm, yet dark, look. Without a word, he continued into the West Wing.\n\n\n“Idiots.” Clint scoffed rolling his eyes.\n\n\n“We should talk to Wanda.” Steve finally said shaking his head slightly. “It’s tonight.” Clint nodded understanding with a grim look on his face. He and Steve stood up and began to move towards the training room where they knew Wanda was practising. On the way down as they passed a door, they heard Loki and Thor’s voices. Clint quickly motioned for Steve to stop and they paused by the doorway.\n\n\n“It is supposed to help your diplomatic skills brother.” Thor was insisting.\n\n\n“My diplomatic skills are fine.” Loki hissed back, someone snorted at that and there was a silence in which they could almost picture Loki glaring at someone.\n\n\n“We need to go to Xandar and check their protection of the Power Stone.” Thor reasoned, Loki scoffed.\n\n\n“So obviously you send me to check the defence of it.”\n\n\n“He did try to steal one on several occasions.” They heard Brunnhilde comment. \n\n\n“I’m not entirely sure how I should be taking that.”\n\n\n“Then Brunnhilde can accompany you,” Thor suggested with a smile in his voice.\n\n\n“I do need to opportunity to buy stronger alcohol…” Brunnhilde mused Steve wrinkled his nose in disgust. He didn’t really like Brunnhilde. \n\n\n“See,” Thor said. \n\n\n“I hate you.” Sighed Loki. “Fine. I will go on your little mission.”\n\n\n“Excellent.” boomed Thor. There was a silence and too late Steve realised that footsteps were coming towards them. The door swung open and Steve attempted to look natural.\n\n\n“Spying are we?” Loki said coldly. Clint sneered at him in distaste.\n\n\n“We were just going to the training room.” Loki rolled his eyes in disbelief and Thor was looking hesitant. Steve smiled at him kindly before Clint motioned for him to keep moving. \n\n\nOnce out of earshot Steve whispered to Clint.\n\n\n“One less Sorcerer on our tail.” Clint smiled wickedly but didn’t respond.  \n\n\n-o-\n\n\nAt 5:30 pm they headed out. While leaving Clint talked loudly about various Pizza places they could try. He continued to do this while in the car all the way to New York. Once they had almost gotten a block away from the car, Clint leading them down the least crowded streets to avoid attention. They began to discuss the plan.\n\n\n“What are we going to do about the Sorcerer guarding the Sanctum?” Clint asked. \n\n\n“I’ve been working on my magic since that first training session.” Wanda grimaced at the memory of the quick defeat. “I might be able to disable him if he isn’t as strong as Strange.”\n\n\n“Well Strange is the Sorcerer Supreme,” Steve began, “I’m assuming that isn’t just to inflate his ego.”\n\n\n“I could try and find the stone while you distract the wizard,” Clint suggested. Steve nodded. \n\n\n“That should work… It would also minimize the time we spend in there.” They continued in silence as they entered the more crowded Bleecker Street. They were all wearing hats and sunglasses as foolproof disguises. \n\n\n“We all have burner phones so let’s go up and down the street and contact one another if we find a wizardy looking place,” Steve suggested. Clint and Wanda nodded, Steve began to walk right with Wanda while Clint walked left.\n\n \n\nAlmost half an hour later Steve’s phone rang. He quickly flipped it open.\n\n\n“Anything?” \n\n\n“I found a place, looks pretty wizardy to me.”\n\n\n“What address?”\n\n\n“177a.”\n\n\n“We’ll be there soon.” He motioned to Wanda and they took off at a fast walk in the direction Clint went.\n\n\n“What do you think?” Clint asked flicking his head towards the building. It was large with lots of windows and a green roof. The most unusual thing about it was a large circular window on the roof that was made of an odd symbol that reminded Steve of a basketball.\n\n\n“This place is magical.” Wanda murmured flexing her hands.\n\n\n“Shall we go in then?” Clint questioned, looking at Steve. Steve gulped and nodded. Wanda discreetly waved her hand in the direction of the door. There was a soft click and they entered.\n\n\nThe landing was empty with a large staircase leading to some other place. They looked around for a second before a voice echoed in the room.\n\n\n“What is your business here?” At the voice Steve started, looking up to see the man, Wong, at the top of the stairs a stern expression on his face. Clint glanced at Cap who shook his arms a bit to release the Wakandan shields on his wrists. \n\n\n“I repeat.” Wong sharply jerked his hands, two shields appearing, on either hand, made of what looked like pure energy. “What is your business here, Rogues.” Steve jerked his head at the nickname as if trying to ward off a fly. \n\n\n“We’re here to take something, that frankly, isn’t safe in your hands.” Clint snapped. Wong’s eyes narrowed. \n\n\n“I wouldn’t recommend that.” His voice was soft yet menacing. All of a sudden the fight had begun. Steve snapped his wrists, bringing out the rest of his shields and raising them to block a sudden hit by Wong. He attempted to kick out the man's legs but was flung off his feet by a harsh force. \n\n\n“Steve.” Wanda cried moving her arms in a precise motion so the staircase bannister broke off with a loud crack and began to pelt itself at Wong. A portal appeared and managed to catch most of the staircase, flinging it into a horribly dark looking place. Steve ran forward making a swipe with a shield that Wong dodged, before swiping with the other shield in the direction the man had gone. It bashed into him sending him back into the air. Wong crashed into a large metal cauldron, knocking it over with another loud crash. Steve saw out of the corner of his eye that Clint had disappeared, clearly looking for the amulet.\n\n\n“We don’t want to hurt you,” Steve said with a mournful tone.\n\n\n“And yet that seems to be your aim,” Wong growled jumping back up and using a portal to bring the fallen staircase rubble down on their heads. Temporarily distracted by his worry for Wanda, Steve didn’t see the energy whip come slashing down at him. Steve felt a burning sensation in his arm as he staggered back, the second attack crashed on him but, ready this time, it banged into his shield.\n\n\n“Move!” Wanda ordered, sending Steve out of the way with a blast of red magic. She threw her hands on the ground and the ground cracked, sending a wave of stone floor towards Wong who quickly formed an energy shield to protect himself.\n\n\nIt wasn’t strong enough.\n\n\nThe man was covered in a layer of floor and Steve stood up, looking at a cold faced Wanda, staring at the pile of rubble.\n\n\n“Is he down?” Steve asked her, moving towards the pile. All of a sudden the pile began to crumble inwards and a portal appeared above them, Wong landed in front of them, face cut and bruising, but he stood up easily, a look of defiance on his face.\n\n\nThey began to fight again.\n\n\n-o-\n\n\nClint jumped through a gap in the staircase bannister, ignoring the fighting below, after a quick inspection, the upstairs didn’t have the amulet only a whole lot of freaky looking wizard stuff. Landing in a crouch, Clint ran down a hallway located behind the large staircase. He had his bow drawn and loaded with shock and stun arrows. \n\n\n“Shit,” Clint muttered, slowing slightly as he reached a large door. Pushing on it he found it was locked. “Alright then, extreme shit.” He sighed and rummaged in his quiver pulling out three of the few explosive arrows he had brought. Loading them all at once he moved back a safe distance. Eyeing the door, he pulled the bow taught and aimed for the handle, where the lock presumably was. \n\n\n“Goddammit.” He breathed as he let the arrows fly. Clint ducked to the floor as a large explosion shook the vicinity. Looking up he saw a smallish gap in the door. Big enough to shoot through in the least. \n\n\nGoing up the door he smiled as he saw the eye-shaped amulet resting on a plinth. He loaded a grappling arrow and aimed through the hole at the amulet. The arrow hit the mark, as it always did, and attached to the amulet. With a harsh pull, the amulet broke free from the stand and Clint’s eyes widened as he heard voices, a lot of them coming from one of the door’s he could see in the other room. He quickly pulled up the eye, taking it off the end of the grappling arrow and running back to the landing, storing the surprisingly heavy amulet away. \n\n\n“Guys, we gotta go!” He yelled, skidding into the wreckage of the fight. “There are more wizards. A lot more.” His eyes widened again at an unconscious Wanda on the ground next to an also unconscious Wong. There was a worrying hole in the wall above them and Steve was kneeling next to the girl. A cut bleeding on his face and dark patches on his clothes where attacks had somehow made it through his armour concealed by a dark hoodie. \n\n\n“She’ll be okay.” murmured Steve, heaving Wanda into his arms and turning back to Clint. “Let’s go!” the voices from the hallway were getting louder.\n\n\n“Shit!” Clint swore again as they ran towards the door. They burst through and began to run down the street, ignoring the stares from the few people on Bleecker Street as they ran.\n\n\n“Those stupid fucking idiots!” snarled Stephen pacing the room. After the news of what had happened reached them the Avengers had gathered in the meeting room to make a plan. Stephen was still frighteningly angry and had been cursing the Rogues for almost five minutes straight. \n\n\n“We know they are idiots Stephen, but right now we need a plan to get back the stone.”\n\n\n“That shouldn’t have been able to happen.” He growled to himself. “There were a million enchantments protecting it, what happened is impossible.”\n\n\n“What do you mean?” asked Rhodey impatiently. \n\n\n“It should’ve been impossible for them to even touch the Eye of Agamotto, or even break into the Sanctum. The Witch isn’t powerful enough to break any of my enchantments. Let alone the thousands put on the Sanctum by generations of Sorcerers.” Stephen resumed his pacing. Tony was watching him with his eyes. \n\n\n“So you think they had help?” Tony suggested softly. Stephen nodded.\n\n\n“That would be the only way they could’ve done anything to the Sanctum or Amulet.”\n\n\nSilence followed the statement. Everyone was sending worried looks at each other about not only the Stone but also the angry Sorcerer who normally wouldn’t lose his calm. \n\n\n“Oh, this is tense,” Brunnhilde announced as she and Loki entered the room. “What the hell happened.” Stephen ignored her, instead turning his cold gaze on an unfazed Loki.\n\n\n“What did you do,” Stephen said to him in a voice so cold Tony shivered. \n\n\n“Quite a lot of things. I believe you’ll have to be more specific.” Loki drawled staring down the Sorcerer.\n\n\n“The Time Stone,” Stephen answered abruptly. \n\n\n“What makes you think I did anything?” Loki raised an eyebrow seeming slightly amused. Stephen strode up to him until they were facing one another. Barely a foot between them. \n\n\n“You are the only Magic user powerful enough to have done anything, and you knew about the stone.” Loki didn’t blink, instead, a flash of disappointment went across his face for a millisecond. \n\n\n“It was a simple test of trust.” At Loki’s words, Stephen looked ready to murder the god. \n\n\n“Stephen…” warned Carol preparing to jump in if the situation escalated. \n\n\n“Trust,” Stephen whispered disbelievingly. \n\n\n“I guess they failed then.” Loki glanced around at the tense and angry Avengers. \n\n\n“No shit Sherlock.” Tony murmured. \n\n\n“Oh Brother.” Sighed Thor looking tired. \n\n\n“Well what was your plan if they weren’t ‘trustworthy.’” Brunnhilde questioned looking bored. \n\n\n“We go get it back,” Loki stated simply. \n\n\n“Which can’t happen because you removed all the enchantments.” Stephen pointed out still looking angry. \n\n\n“With the simple tracking spell I cast on it.” continued Loki ignoring Stephen. \n\n\n“Excellent.” Carol sighed, “Where are they then.” Stephen, still looking angry leaned on the wall, glaring daggers at Loki. \n\n\n“Hang on.” Loki murmured. He raised his hands and green magic drew a map of New York in the air. \n\n\n“Where are they?” asked Rhodey looking around the glowing map wearily.\n\n\n“Oh, they move fast,” Loki said to himself more than the room. His eyes swept the map and located an orb that glowed brighter than the actual map. “They are over there.” He nodded towards the orb.\n\n\n“Great, let’s pull up an image of the place and I’ll teleport there,” Stephen stated looking at the orb himself. \n\n\n“You can’t,” Loki answered simply.\n\n\n“Why can’t I?” Stephen challenged.\n\n\n“They’re underground.” Stephen glanced at the orb again frowning. \n\n\n“Where are they then?” Rhodey asked confused. “That’s a fairly busy shopping street and Roger’s is most likely too full of himself to go into a sewer.”\n\n\n“I’m not sure.” Loki mused.\n\n\n“We could ask Scott.” Hope offered, everyone looked at her.\n\n\n“How do we know that he’s trustworthy?” pointed out Tony.\n\n\n“He didn’t go with them did he?” Hope said, “And he barely talks to them anymore, he told me, and FRIDAY confirmed.”\n\n\n“Fine,” Carol nodded, “FRIDAY? Can you call him here?” \n\n\nA minute later a nervous looking Scott entered the room. \n\n\n“Hey guys” He looked around worriedly, hesitating at the clearly angry Sorcerer and other Avengers. \n\n\n“Scott,” Hope stood up and went over to him. “Do you know of any underground hideout that the Rogues had while on the run. One in New York, on 86th.” Scott fidgeted, glancing at the glowing map in the air. \n\n\n“I dunno. Natasha always did that stuff.” He muttered Hope held back a sigh. \n\n\n“Well, then we’re screwed.” Rhodey groaned. “Natasha would warn them.”\n\n\n“Who? Steve and the others?” asked Scott confused. “She’s really angry with them. Hasn’t talked to them after finding out Steve lied.” Tony grimaced, Steve was really lying to everyone then. \n\n\n“Then we can ask her.” Bruce determined. Carol sighed and nodded. \n\n\n‘She’s on her way.’ \ninformed FRIDAY.\n\n\n“What happened?” Scott looked at the map again looking nervous. Hope shook her head. Scott quietened and looked at the door as Natasha entered wearing her usual guarded expression. \n\n\n“What did they do?” she asked calmly, glancing at the map and the angry expressions piecing together the story.\n\n\n“Mr Rogers, Mr Barton, and Miss Maximoff stole the Time Stone, damaged the Sorcerer’s Sanctum and harmed one of Dr Strange’s friends” Vision answered quietly a look of utter sadness and disappointment on his face. Natasha closed her eyes regaining her calm whereas Scott looked horrified.\n\n\n“They have hidden in one of your hidey holes from when you were wanted terrorists,” Stephen said coldly, although he had sort of calmed down he was still radiating anger. Tony kept on eyeing him with concern, wary of approach as Stephen was likely to snap at even at those closest to him at the moment. \n\n\n“I’ll take you there.” Natasha opened her eyes again. \n\n\n“How do we know that you are trustworthy?” Stephen accused. \n\n\n“I don’t plan on forgiving Roger’s and anyway, I am not so egotistical to ignore the fact that most everyone in this room could overpower any of the Rogue Avengers or myself. I’ll take you there.” Carol nodded again.\n\n\n“We should try to do this without fighting. Although it may be tempting to beat the shit out of them, there are plenty of civilians in that area and we don’t want any casualties.” \n\n\n“That is going to be simple. I’ll just banish them to the nightmare realm and be done with it.” Stephen said viciously. Carol shook her head quickly. \n\n\n“No Stephen. They can be locked away and rot in jail but leave that sort of cruelty to the bad guys.” Stephen sighed but nodded at her point. \n\n\n“Dr Strange, Loki, you are both adept at magic and most likely will cause less damage than everyone else here with our lasers, bullets, and energy blasts.” Rhodey stood up and examined the map closer. “We’ll send you in to apprehend the Rogues, and only apprehend.” He looked sternly at Stephen as he said that. “Use whatever means necessary to arrest them and they will be taken to the government.” \n\n\n“Hope?” asked Carol, Hope looked at her.\n\n\n“Yes?”\n\n\n“Can you and Scott suit up and make sure that Civilians stay away from the fighting? In case things get out of hand.” Hope and Scott nodded, pulling out the small boxes in their pocket’s containing their suits and heading out to suit up. \n\n\nThe final aspects of the plan were made and Natasha began to lead Stephen and Loki away, Tony moved after them.\n\n\n“Stephen.” At Tony’s voice, Stephen turned and immediately realised what Tony was about to ask. \n\n\n“No way. You are not coming.” The rate that he switched from incredibly angry, I will smite all in my path, Sorcerer to protective boyfriend was rather amusing. \n\n\n“My new suit has features that could help,” argued Tony. “Especially with detaining them.” Stephen shook his head. \n\n\n“You also haven’t recovered from yesterday’s flare-up.” Stephen pointed out sternly.\n\n\n“Minor detail.” \n\n\n“There is also no way I’m letting Roger’s anywhere near you.”\n\n\n“And what about you? You may be more powerful than him but I was as well yet he still almost killed me, and the Witch is more powerful than she let on at training you could get hurt!”\n\n\n“I’m not going to.” Stephen embraced the man. “I’ll kick their asses and come back without a scratch.” Tony didn’t answer instead hugging Stephen tighter. “Though I do have to go to do that.” Tony groaned softly and let go of Stephen.\n\n\n“You better protect him,” Tony said to the Cloak on Stephen’s shoulders, the Cloak fluttered in the answer. Stephen smiled at Tony and turned back to the waiting Loki (Natasha had gone to suit up). \n\n\nThe Rogues were so in trouble now.\n\n\n-o-\n\n\n“How you doing?” Clint asked Wanda as she began to stir. Wanda groaned in answer putting a hand to her head. Clint helped Wanda up, a comforting arm around her shoulder. \n\n\n“Where are we?” Wanda looked around still slightly out of it.\n\n\n“One of Nat’s hideouts,” Clint answered.\n\n\n“What,” Wanda looked at him panic on her face. “She could sell us out”\n\n\n“Nah, She may be pissed at us but I trust her.” At Clint’s words, Wanda seemed to calm. She got to her feet unsteadily, Clint helping her all the way. Steve was looking at the amulet they had \nstolen\n retrieved in interest. \n\n\n“How do you think it works?” Wanda walked over to where he was sitting at a table. \n\n\n“I don’t know but that is not for us to know, Just like the Tesseract this thing will be dangerous. Wanda nodded but as she looked at the amulet something like greed flickered in her stomach. \n\n\n“Do you want a drink?” Clint was looking in a mini fridge that occupied the corner of the room. “By that I just mean water.” he sighed, pulling out a large bottle he handed it to Wanda who drank some before giving it back to Clint who chugged a quarter of the bottle. \n\n\n“What now?” Wanda asked eyes still on the amulet. \n\n\n“Well, we have no idea how to destroy this thing so I guess we just keep it away from the others.” Clint nodded in agreement to Steve’s words. \n\n\n“Or at least until they realise that they can trust us and not people like Strange with the stone,” Clint added. Steve nodded. Wanda put her hand on the table, feeling a little dizzy. Steve looked at her in worry. \n\n\n“C’mon kid, you should lie down for a bit.” Clint put his arm back around Wanda’s shoulder and guided her to one of the small rooms illuminated by a lamp.\n\n\n“I hate being underground.” murmured Wanda as she lay down.\n\n\n“Your parents?” Clint breathed. Wanda nodded, sadness filling her. \n\nIt was Stark. \n\nShe thought firmly, replacing the sadness with anger towards the man which lasted several seconds before it was replaced this time with tiredness. \n\n \n\nThe next time Wanda opened her eyes, Clint had gone and another voice had joined them underground. Getting up she wandered to the doorway of the room. \n\n\n“I thought you’d be here.” Natasha was saying from the door. \n\n\n“Well it’s a good place to hide,” answered Clint from the couch he was lounging on. \n\n\n“Is something wrong?” asked Steve standing up. Wanda noticed the amulet was on the table. The feeling resembling greed resurfaced. \n\n\n“Did you seriously steal from the Sorcerer?” asked Natasha in disbelief.\n\n\n“We can’t trust him,” Wanda said immediately she fully entered the room, heading towards the table and taking a seat in what she hoped was a casual movement. \n\n\n“I know that.” Natasha sighed. “Stealing from them was a bad move though.” \n\n\n“What’s happening back at the compound?” questioned Clint as Natasha moved into the room and sat on the arm of the couch. \n\n\n“They are completely panicked.” Natasha smiled slightly. “They tried to get me to tell them where you were but I said I didn’t know.”\n\n\n“They believed you?”\n\n\n“I can make anyone believe anything.” At those last words, another feeling began to drown out the greed. Wanda couldn’t name it though. Clint snorted. \n\n\n“Idiots.”\n\n\n“What’s your plan now?” asked Natasha calmly, her eyes flicking to the Amulet. \n\n\n“Hide it,” Steve answered, Clint, nodded and shrugged. \n\n\n“Seriously?” Natasha rolled her eyes. “You are horrible at plans if you don’t even know what is happening now.”\n\n\n“Well, we don’t know how to destroy it.”\n\n\n“Then why did you steal it?” Natasha snapped, standing back up. “You can’t just hide forever!”\n\n\n“It’s fine Nat.” Steve smiled at her. “We have been on the run before.”\n\n\n“But last time you weren’t being hunted by the other Avengers! Tony knew our exact location half the time but did nothing. Do you think that’s just going to happen again now you’ve stolen something of great value to them?” Steve was quiet for several seconds. Clearly, he had not realised this. \n\n\n“What would you have us do?” asked Wanda waspishly. \n\n\n“I would have you give it back to them! You don’t have to turn yourselves in if you just leave it for them to find. Then they probably will stop hunting you.”\n\n\n“That is stupid Nat.” Clint sat up. “We can’t give it to them.”\n\n\n“Steve?” Natasha pleaded with him. Wanda snapped her gaze to him expectantly.\n\n\n“Nat…” Steve sighed. “I’m sorry, but we can’t trust them with something possessing this kind of power.”\n\n\n“But it can be trusted with you?”\n\n\n“More so than them. We at least won’t use the power for our own gain. We can protect it without endangering anyone.” Natasha glared at him. “I’m sorry.”\n\n\nIt was as if someone had flicked a switch. Natasha straightened and her expression of kindness and trust was replaced with a cold indifference.\n\n\n“If that is your final answer.”\n\n\nWanda then managed to name the feeling that had drowned out the greed.\n\n\nIt was dread.\n\n\n“Tasha?” asked Clint, standing up and taking a defensive stance.\n\n\n“I’m sorry,” she repeated, but this time it was sharp and cold. “But this is bigger than any of us.” Steve opened his shields, looking wary.\n\n\n“What do you mean?” he questioned, there was hurt in his voice by this sudden turn of events. Wanda also stood up, shielding the table with the amulet and magic beginning to flow through her fingers. \n\n\n“She means you are screwed,” Loki smirked as he entered and took a place beside her.\n\n\n“You’re working with Loki?!” Choked Clint, horror and hurt in his voice. \n\n\n“He is an Avenger,” Natasha said, her eyes softening for a moment at Clint’s expression before seeing Wanda’s protection of the Amulet and they hardened again. \n\n\n“A title you don’t have the pleasure of having.” Strange entered and stood on Natasha’s other side. Clint growled, opening his bow, picking up his quiver and drawing an arrow in the span of a second. \n\n\n“Let’s make this simple,” Strange said with a deadly voice. “You give me back the Eye of Agamotto and this won’t get painful.”\n\n\n“No,” Steve said simply raising his shields. \n\n\n“Alright then,” Strange answered coolly, orange magic circling his shaking hands. \n\n\n“You really are horribly stubborn,” Loki commented, jerking his hands out, daggers appearing in them. Wanda grabbed the amulet, putting it around her neck so they couldn’t go up and grab it. Strange’s eyes darkened. \n\n\n“Oh, Wanda.” Natasha sighed in disappointment. \n\n\n“You should’ve seen the android.” Loki smirked at her, “He was so disappointed in you.” Wanda growled in fury, her insides breaking as she raised her hands, throwing glowing red magic at their opponents.\n\n\n“Hope informed me they about to come back,” Carol said to Tony glancing at a screen. \n\n\n“Unharmed?” Tony asked immediately. Carol frowned. \n\n\n“She didn’t say.” At Tony’s face, Carol quickly continued. “That implies that they weren’t, if there was anything serious then she would’ve said.” Tony nodded still uncertain. There was a startled yell from outside the compound. Tony looked towards the open window.\n\n\n“That’ll be Stephen’s portal.” He smirked at the sound made by the shocked government officials here to pick up the arrested Rogues. \n\n\n“Let’s go then.” Carol smiled and began to walk towards the door. Tony quickly overtook her and went outside. He let out a sigh of relief as he saw the Rogues held down by some of Stephen’s Eldritch magic that quickly turned to a grin at the sight of the Sorcerer himself handing the Eye of Agamotto to a highly irritated Wong. Tony moved up to him and instantly began to babble.\n\n\n“Are you okay? What happened? And don’t give me that ‘im fine’ bullshit I can clearly see your bleedin-” he stopped abruptly as in response to his babbling Stephen had kissed him with so much enthusiasm that Tony completely lost track of every thought running through his head (which is quite an achievement.) \n\n\nCompletely forgetting where they were and how they were surrounded by almost a hundred government officials, several news reporters that had managed to get in, and the Rogue Avengers Tony put his arms around Stephen and answered with an amount of enthusiasm to rival Stephen’s.\n\n\n“Honestly.” Wong scoffed. “I’ll just go put the Eye in the Sanctum then.” Stephen didn’t answer, not exactly focusing on his friend at the moment. Wong shook his head fondly before opening a portal back to the Sanctum. \n\n\nConsidering Stephen and Tony weren’t exactly showing any sign of stopping their make-out session (the cloak had actually wrapped around both of them, the collar shielding them from the eager and astounded press.) Loki and Natasha had begun to explain what had happened to Carol, Rhodey, and several of the government officials there. \n\n\n“You won’t have to worry about containing the witch’s powers.” Loki was saying, sounding immensely bored as he balanced a knife on the tip of his finger, gaining cautious looks from almost everyone there. \n\n\n“Why is that?” asked Carol, glancing at Wanda, who was staring at the floor a shocked, vacant expression on her face. \n\n\n“Witch tried something a bit too advanced for her meagre talents,” Loki smirked, letting the knife fall and catching it by the blade. Natasha rolled her eyes. \n\n\n“That’s a simplified way of putting it.” As she spoke she was dabbing at some blood on her forehead with a damp cloth. \n\n\n“Short version.” Loki straightened, eyeing the officials with a calm expression. “She tried to use the Time Stone, failed miserably and now no longer has her ‘powers.’” At this news, Tony and Stephen finally broke apart. \n\n\n“Hang on. What?” Tony questioned confused. \n\n\n“Ah, Mr Stark, nice of you to return to reality,” Rhodey smirked, Tony glared at him.\n\n\n“Just some magical mumbo-jumbo without any scientific explanation whatsoever that you won’t understand,” Loki said casually. Tony gave the man an immensely dramatic eye roll. \n\n\n“Just explain it, brother,” Thor ordered, appearing next to them. Loki sighed.\n\n\n“So,” Loki began, “Do you remember when I tried to control your mind before?” At these words, there were several startled cries and Stephen and Rhodey, in particular, looked ready to curse/beat up Loki on the spot. \n\n\n“Yeah.” Tony nodded, ignoring the reactions. \n\n“Your Arc Reactor, it was based on the Tesseract?” At Loki’s question, Tony nodded again.\n “Basically.” A look of understanding graced his features. “The Arc Reactors similar energy to the Tesseract meant you couldn’t use the Mind Stone. They cancelled each other out basically.” Loki nodded. \n\n“The same thing sort of happened when Maximoff tried to use the Time Stone.” Stephen continued for Loki. “Although it was a stronger reaction, one might say, as he powers came from the Mind Stone however the Arc Reactor was just based on the Space Stone.”\n\n\n“So what exactly happened then.” Vision murmured softly. Looking at Wanda an unreadable expression on his face. \n\n\n“Her powers are gone, I double checked and it’s almost as if she didn’t have them in the first place.”\n\n\n“She also appears to have Amnesia,” added Loki, still in the same bored voice. “That’s probably temporary though.” Vision didn’t say anything, his eyes turning away from the girl and focusing back on the conversation.\n\n\n“We will make sure that she isn’t given the same treatment as the raft then.” One of the officials said with certainty. Rhodey nodded retaining a respectful mask. \n\n\n“We’ll contact you about the trial.” one of the officials said, \n\nIsn’t he one of the many, many, Ross’s? \n\nTony thought dully barely listening to the conversation. \n\n\n“Thank you.” Carol smiled politely at them and as all the officials turned around she gave the Rogues the middle finger, somehow she managed to hide it from the press. Roger’s face reddened and he aimed the glare he had been using on Stephen and Tony on her instead. \n\n\n“If that is all.” Tony clapped his hands together, the press clambered forward but Tony gently waved them off, a winning smile on his face. “Sorry guys, you’ll have to wait for the press conference after the trial to get answers out of us.” He smirked at Stephen. “Even for questions not related to the arrest.” He bade a final goodbye to the press and turned back to the compound. The grin on his face remained though. He was finally free.\n\n\n-o-\n\n\nThe trial took place a week from the Rogue’s arrest. Tony had forbidden the kids from coming despite the pestering, specifically from Harley, instead giving them the compromise of a flight/swing around New York later. An hour before the trial Tony stood in front of the mirror in his room since he didn’t exactly need his suit today, he was making sure the glow of the Arc Reactor was hidden from sight. Satisfied he buttoned the dark suit jacket over his dark red tie. \n\n\n‘Hello, Boss.’ \nFRIDAY said cheerfully as he slid some glasses onto his face and the lenses lit up with a mini HUD. \n\n\n“Hey Fri,” Tony answered softly. He sighed and closed his eyes, taking a deep breath. Tony smiled as familiar arms wrapped around him from behind.\n\n\n“You ready?” Stephen asked as leaned back into the man’s embrace. \n\n\n“Yep.” Tony turned to face Stephen and smirked. “Wow, you look good in a suit. It’s a nice change from your hobo wizard look.” Stephen scoffed, a slight smile on his face.\n\n\n“I’m sorry that my hobo wizard look is so disappointing.” He answered, calmly straightening Tony’s tie. \n\n\n“Oh, you’d look hot in anything don’t worry.” Tony grinned. “Or in nothing for that matter.”\n\n\n“I thought we already established I look good in nothing?”\n\n\n“I don’t know.” Tony put his arms around Stephen’s waist smirking. “I might need to check again.” Tony pressed his lips to Stephen’s and sighed in contentment. \n\n\n‘Boss, sorry to interrupt, but you just got your clothes back on and I doubt the Court would appreciate you being late.’ \nTony groaned at FRIDAY’s interruption, pulling away from Stephen and doing up the button on his suit jacket. \n\n\n“Right you are baby girl. Although you completely ruined the moment.” Tony smiled slightly, he could practically hear FRIDAY sighing. \n\n\n‘Right I forgot, you and Dr Strange have so few of those.’ \nFRIDAY answered dryly. Stephen’s mouth twitched as he fiddled with his sling ring. \n\n\n“Shall we?” he asked gesturing to Stephen’s Sling ring. Stephen nodded, slipping it on and raising his hands to open a portal. \n\n\n-o-\n\n\nThe entire trial was hilariously humiliating for the arrested Rogues. They got to give their side of the story and Rogers gave his usual rant about how he just wanted to do what was right, about how this was bigger than all of them, and he didn’t want to harm anyone.\n\n\nBut then it was the other sides turn. It was quite entertaining albeit depressing to hear Tony relay event after event after event of the Avengers hostile attitude towards him and whatever he did. \n\n\nWith each word, Rogers and the others got paler and paler. Maximoff had been excused from the trial due to her current state (the amnesia) but it was satisfying enough to watch Barton and Rogers steadily become white as sheets. \n\n\nThen Tony reached Ultron. \n\n\nAt the news of Wanda Maximoff influence on Tony to create Ultron, the tenseness of the room increased so it was as if no one was making any sound spare Tony. Tony then relayed how she had manipulated all the Avengers, also causing Hulk’s rampage in Johannesburg. \n\n\nBy the time Tony had reached the subject of Siberia Roger’s looked ready to faint. \n\n\n“Heinrich Zemo revealed to me that the Winter Soldier had actually killed my parents, Howard and Maria Stark, under the orders of Hydra.” At this statement, the silence broke and people began to speak and yell over the news. \n\n\n“Then, it was also revealed that Steve Rogers knew this already but neglected to tell anyone.” Tony continued ignoring the outbreak of words, instead just raising his voice. \n\n\n“Since they returned Rogers, Barton, and Maximoff have committed several more acts of assault, mostly towards me, and then they decided to steal an incredibly powerful artifact they had no right to because according to them it was safer in their hands than the Avengers.” Sometime during the long speech Tony’s voice had became detached, he had probably rehearsed this, maybe in his mind for years. A hopeful plea in his mind that something someday would be done about Steve Rogers. \n\n \n\nThey were going away for an incredibly long time, Tony almost cheered but decided to keep some air of professionalism. \n\n\n“That was exhausting.” Tony smiled as he and Stephen talked, in the hallway outside the courtroom. \n\n\n“But… you won.” Stephen reminded him, Tony’s smile widened. \n\n\n“I won.” he closed his eyes and lent his head on Stephen’s shoulder. They stayed there in silence for several minutes, just enjoying each other’s company when.\n\n\n“Tony?” The horribly recognizable voice pleaded with him and Tony’s eye immediately snapped open. Steve was at the end of the hallway, being led by half a dozen guards who were now having trouble moving the super soldier planted firmly on the ground. \n\n\n“What?” Tony practically snapped at the man. No fake courtesies anymore. \n\n\n“I just, want to fix this.”\n\n\n“Bit late for that,” Tony answered simply.\n\n\n“Also incredibly stupid timing considering you are about to be locked up for most, if not all your life.” Stephen pointed out, putting an arm around Tony protectively. \n\n\n“We were friends Tony.” Steve pleaded, “We are family.”\n\n\n“No we aren’t” Tony did snap this time, breaking free from Stephen’s hold to point a finger angrily in Steve’s direction. “We never were family, we weren’t even friends. I was just a doormat to you, you’d walk all over me, manipulate me, and take advantage of my resources. But we were never friends so don’t fucking kid yourself.” Steve stared at him, fake remorse in his eyes. \n\n\n“Tony be reasonable.”\n\n\n“I am being reasonable. I am being the most reasonable I’ve been in years. I’m wiping myself clean of you, I don’t ever want to think of you again.”\n\n\n“You can’t forget me, Tony, you can’t forget the original Avengers.”\n\n\n “No, you know what, I will remember the original Avengers, but not the people, not you, but the promise we made. We would protect our world, we would protect the people. No matter the cost. Just putting aside our ego’s and avenging the damn Earth. And in several generations time people won’t remember Captain America or Steve Roger’s, he’ll just be a name in a history book that people flip by because they don’t care about the hero turned terrorist. They won’t even bother to remember you, but god…” Tony grinned, opening his arms wide in triumph, much like he once did on a hot day in the desert back in 2008, on the day Iron Man was born. \n\n\n“They will remember Iron Man. They will remember \n\nTony fucking Stark\n\n.” \n"
}