{
    "id": "16138103",
    "url": "https://archiveofourown.org/works/16138103?view_full_work=true",
    "author": [
        "Kandakicksass"
    ],
    "title": "you've got the antidote for me",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Draco Malfoy/Harry Potter",
        "Hermione Granger/Ron Weasley"
    ],
    "characters": [
        "Draco Malfoy",
        "Harry Potter",
        "Ron Weasley",
        "Hermione Granger",
        "Penelope Clearwater"
    ],
    "additional_tags": [
        "Alternate Universe - Soulmates",
        "Soul Bond",
        "Red String of Fate",
        "Heavy Angst",
        "Terminal Illnesses",
        "Major Illness",
        "Angst with a Happy Ending"
    ],
    "language": "English",
    "series": "",
    "published": "2018-09-30",
    "completed": null,
    "words": "20,730",
    "chapters": "1/1",
    "comments": "1,563",
    "kudos": "52,704",
    "bookmarks": "14,615",
    "hits": "553,344",
    "summary": "<p>When Harry Potter unintentionally severs their soulbond before it can fully form, Draco Malfoy resigns himself to a slow death and decides not to burden Harry with a soulmate he's made it very clear he doesn't want.</p>\n<p>He's never been selfless before, but for Harry, he can try.</p>",
    "notes": "<p>I meant to finish and post this ages ago, but unfortunately being a teacher means that this is how writing works for me: (Available Time - Available Energy)/Other shit I need to do = Writing. As you can tell by that equation, this fic got pushed off a bit and while I might go back and edit in the distant future, I'm pretty happy with the result.</p>\n<p>The title is from Honey, Make Me Healthy by the literal goddess Flannel Graph. One of my favorite songs and it's so relevant to this fic, so please look it up! :)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "Draco had always imagined that his soulmate would be his saving grace.\nEven when he was young, he’d been under no illusions about what he was like – proud, yes, but not oblivious. He was spoiled and irritable and downright vindictive when angry, so he’d always thought that it was lucky there was someone destined to love him regardless. Over the years several of these things changed (or were beaten out of him by the war), but the idea of a soulmate – someone who would love him in spite of the Mark on his arm and the many, many mistakes dotting his history – held fast.\nEven when the rest of the wizarding world ostracized him, Draco had always soothed himself with the promise that his soulmate was out there, waiting. One day he’d meet someone or reconnect with someone and his string of fate would become visible to him, a thread connecting him to the person he was meant to love and who was meant to love him.\nThen, three months after he was officially released from Ministry custody, Draco attempts to make amends with Harry Potter and is told quite firmly that not only does Potter not want anything to do with him, but that he would also prefer that Draco stay away from him entirely.\nAt first, he doesn’t know what to say. He’d done all the right things – he’d apologized after the war, been contrite and polite and had waved his metaphorical white flag. He’d even been genuine about it. It isn’t as though he’s asking to be best friends. Still, though, Potter turns him away with a frown and eyes like steel, and Draco feels a sick lurch in his chest, in what feels like the core where his heart and magic meet.\nHe looks down, unable to meet Potter’s eyes, trying to figure out what to say. It’s at this moment when he realizes that there is a glossy red thread tied around his right pinky finger. He follows it with a growing sense of nausea only to find that the other end is tied to Potter’s finger, turning grey and dead the closer it gets to his hand.\nHe stares, blank-faced. This moment was supposed to be like a fairy-tale, where Draco and his soulmate reconnect and then their soulbond snaps into place like fate. He has never even imagined that his moment of connection would be broken with an immediate rejection. The strange, sick feeling he’d gotten – it had been the bond.\nHe can feel it, just like he’d always been told he would. He can also feel where it’s severed, cut at the wick.\nPotter looks down, appears to see nothing amiss, and then narrows his eyes like he thinks Draco’s up to something. It occurs to him that Potter has no idea. He can’t see the string, and doesn’t have the faintest inkling that he is ensuring Draco a slow, agonizing death by rejecting their bond.\nDraco could say something. Should, even, for his own health; Potter has that notorious savior complex of his, doesn’t he? He’d take it back, if it meant saving Draco’s life. They could be friends, keep the bond platonic, and sustain it just enough to keep Draco alive.\nThe thing about that is that Draco will know for the rest of his days that given the choice, his soulmate wouldn’t have chosen him. His one saving grace – the one thing that mattered enough for him to keep going, to keep bettering himself – would be a lie.\nHe knows that Potter, the one rejecting him and their bond, who doesn’t even know… Potter will never feel a thing. He’ll never know why. Draco will wither, but the bond that was broken before it could even touch Potter won’t affect him.\nIt’s rare, that Bonds are left one-sided like this. It takes a sharp, immediate rejection to break a bond before it’s fully formed. If he leaves it like this now, it will stay broken and Potter will never know what he’s done. Draco is forever changed, and will spend the rest of his days seeing Potter in this strange new light, knowing they could be perfect for one another, and Potter… will not.\nThe place where the bond is connected to his soul, the tug in his chest, feels leaden at the realization that if he speaks up, Potter will sacrifice his own happiness to tie himself to someone he hates. Neither of them would be happy. Draco would be unfulfilled and Potter would be miserable.\nMaybe before the bond Draco would have been selfish enough to say something.\n“Apologies, then,” Draco says instead, stiffly. It comes out more pained than he would like. Then, he turns around and heads for the nearest floo out of the Ministry.\nIt’s harder than it should be to say the words Malfoy Manor when it means that Potter will disappear from his sight.\n***\nDraco has a couple years. Soulmate rejections are slow deaths, and for the first couple months Draco’s only symptoms are emotional. Immediate depression, mild anxiety. He’s already familiar with those, anyway, and there is no one to tell even if he wanted to. No one to take care of him. His mother, father, and Vince are all dead. Pansy, Greg, and Theo are abroad with no intentions of ever returning to England. Blaise is married and, while he accepts his floo-calls, is typically far too busy with the business he’s running with his wife in Germany. He lives in the Manor, drafty and huge as it is, alone. He misses Potter, which feels strangely natural, and spends a lot of time reliving the way that Potter had made him feel alive when they were “rivals” during their Hogwarts days.\nHe goes to his Ministry check-ins and the job in the Ministry mailroom that was given to him as a rehabilitation requirement. He hears someone gossiping about how he looks about ready to kill himself.\nThe witch who says it claims she hopes he does sooner rather than later, because working next to a Death Eater gives her the creeps.\nThat one makes him put his head down in the middle of the day, thanking god they’d put him in a cubicle more or less away from everyone else. His mail sorting waits half an hour while he stares at the red string tied around his pinky and tries to get his head on straight.\nThree months in, he runs into Hermione Granger – soon to be Weasley – in a muggle coffee shop. That’s the only place he can go where he won’t be refused service, and as a result he’s gotten friendly with the muggle who serves his drinks. She’s eighteen – only a few years younger than him – but he looks so much older now that when they meet she thinks he’s closer to thirty than twenty. He doesn’t remember looking so old only months before, but the bags under his eyes and the sallow tint to his skin that comes from underfeeding himself doesn’t do him any favors. His lack of self-care isn’t intentional. He’s just tired.\nThe barista is holding out a straw for him when he hears a familiar voice say his name.\nHe turns to see Hermione Granger staring at him in disbelief, eyebrows furrowed. He can imagine she’s surprised to see him in a muggle shop, but he finds that he can’t bring himself to care. She’s the least hostile of the Golden Trio, at least, so he nods at her in greeting. It’s the best he can do.\n“Thanks, Mimi,” he tells the barista, and she smiles at him as he unwraps his straw and slides it into his coffee. “Goodbye, Granger,” he adds in passing, and then is gone. She doesn’t say anything else to him, but she watches him leave.\n***\nHe goes in for his next check in, wan and something close to lifeless, to find that Ronald Weasley is the new auror assigned to him. Weasley doesn’t say anything at first, just glares and checks his wand as he is required to do. Draco doesn’t say anything either, he just slumps in his chair and stares down at his string. He does that a lot as of late.\nWeasley marks off what he needs to – Draco doesn’t know, they don’t tell him – and then sets his clipboard down with a sharp thwap. It startles him out of his thoughts. “So my fiancé tells me she saw you in muggle London. What were you doing?”\nHe looks angry, suspicious. Draco suspects for a second that he was reassigned on purpose, that he asked to be in order to interrogate Draco.\n“Getting coffee,” Draco tells him honestly. There’s no emotion to it. He blinks up at Weasley tiredly.\n“Why go to muggle London for coffee?” Weasley asks him, gritting his teeth like he assumes Draco is avoiding the question. Draco sighs.\n“I like iced coffee drinks,” Draco says flatly. “And there is one wizarding coffee shop in Diagon Alley, which wouldn’t serve me water if I was dying of dehydration.”\nWeasley doesn’t look impressed. “So you’re terrorizing muggle coffee people?”\n“I’m not terrorizing Mimi.” There’s a long pause in which Weasley just stares at him. Draco assumes he’s confused. “The barista. Her name is Mimi.”\nAnother long pause. “Harry told me you tried to make nice with him. Does that have anything to do with making nice with muggles? Is this some kind of new leaf you’re trying out?”\nThe sound of Potter’s name makes his chest throb. He glances down at his string. “There’s no leaf. I’m just trying to live my life.” He sighs, a headache beginning to pound between his temples. “Weasley, please. I’m not up to anything except existing, and even that is starting to seem rather lackluster. There’s nothing to interrogate, nothing I’m hiding from you.” Nothing except the red string of fate tying him to Weasley’s best friend, of course, but that has no bearing on anyone except Draco. No one needs to know, especially not Weasley or his friends.\n“I have an eye on you, Malfoy,” he says, unmoved, and Draco shrugs listlessly.\nWeasley lets him leave.\n***\nThe depression doesn’t get worse, per se, but it also doesn’t get better. His days start to blur together, and every day he’s more tired. He falls asleep in public and lies awake at night, and becomes more and more apathetic. He goes to work, is totally ignored by everyone he works with, and goes home to the Manor. There are days where he doesn’t speak at all, not even in reply to his supervisor, Quinley. He gets away with this largely because they expect and even enjoy the idea that his spirit is broken, and so Quinley just nods and lets him reply in gestures when told to do (or not do) something.\nHe hasn’t seen Granger again since the first time, but Weasley remains his check-in auror. Weasley doesn’t even bother to glare anymore. He comes in with a blank expression and leaves with a conflicted one, getting more and more data every meeting, though Draco still has no idea what it is. The only person who talks to him with any intent (or kindness) is Mimi. No matter how exhausted, he can’t stop himself from craving the sight of a friendly face.\n“Are you sick?” Mimi asks one day when he stops in. She asks it quietly, like she doesn’t want to call attention to it, but he just shrugs. “You look like you’ve lost weight.” She bites her lip when he just shrugs again.\nDraco makes to leave, but Mimi stops him.\n“If I give you one of our croissant sandwiches, will you stay for a bit and eat it?” she asks gently, and Draco realizes she’s worried he’s starving himself. He gives her a small smile and agrees just to assuage her fears.\nTo be fair to Mimi, he really hasn’t been eating much. He’s not a very good cook, and all of the Manor’s house elves have been requisitioned by the Ministry. He will sometimes grab lunch at work, and orders food for the Manor that he doesn’t have to cook, but the end result is that his diet is limited and his appetite is nearly nonexistent.\nMimi continues to work while he eats, but it’s nice that she keeps an eye on him. Her worry makes him smile a bit to himself. She waves at him when he leaves.\n***\nDraco doesn’t seek Potter out, and never ventures into spaces where he spends his time. He doesn’t know how his body will react to seeing Potter (how he will react) but he doesn’t imagine it will be good.\nHe does, however, begin to see Weasley around regularly. Being his check-in auror, Weasley has also been stopping into to observe him while he works, which was something his previous auror had apparently been supposed to do and never had.\nAlong with Weasley’s presence, Draco is also introduced to a new symptom of his broken bond: a constant feeling of cold that no warming charm will hit completely. He starts wearing cardigans and winter robes in September, when it barely warrants long sleeves.\nThe Manor is drafty and without house elves to keep the fires going, Draco finds himself falling asleep in front of his study fire more nights than not just because it’s easier than trying to keep multiple rooms warm by himself. He keeps a quilt there now, made when his mother used quilting as a form of practice for fine magic. He remembers sitting with his head in her lap watching her needle re-thread, disappear, and reappear from one side of the fabric to the other.\nHe can feel her magic now, sometimes, when he has the quilt over his head and focuses. He’s noticed that he’s becoming more sensitive to magic as of late, and while he’s sure that it’s leading nowhere good, it’s given him this one blessing.\nIt’s been half a year. Draco sometimes finds himself playing with the string around his pinky like a nervous habit. Every now and again, he’ll tug on it, but he never feels a tug back.\n***\nWeasley is waiting at his desk when Draco comes in one Friday morning. He tends to get there before everyone else, because he’s rapidly turned into an insomniac and doing mindless repetitive work is the only thing he has going for him while he’s spending his long hours awake. This said, it’s somewhat impressive that Weasley is here before him.\n“I need your help,” Weasley says, and Draco remembers a time where he would have felt something more than a vague spark of huh. He would have been smug or proud or even irritated about Weasley coming to him for help once upon a time, but he doesn’t have it in him.\nMaybe his coworkers are right – maybe his spirit is broken.\n“What with?” he says instead of voicing any of his thoughts. Weasley visibly startles. He’d come in looking disgruntled, clearly expecting some kind of snark from Draco, but Draco doesn’t have any to give. Besides, Weasley could literally get him thrown into Azkaban, and he only narrowly avoided that the first time with Potter’s testimony at his trial.\nHe doubts Potter would give it again.\nWeasley shakes his surprise off. “I ask this only because you work here in the mailroom and I trust you not to be one of the crazies trying to get into Harry’s pants.”\nDraco almost wants to laugh. He’s never considered getting into Potter’s pants, no, but for a split second he did have a moment where marrying the man seemed like a very real possibility, so Weasley really was batting a little too close to home.\nHe doesn’t say any of that. “Potter’s getting fanmail, is he?” Draco asks. He wouldn’t know. He’s not allowed to go anywhere near Potter’s mail, which comes in such copious quantities that his supervisor’s supervisor is assigned to his mail exclusively. Not even the Minister has a mailroom employee assigned only to his mail.\n“He’s getting letters bordering on stalking and harassment,” Weasley says flatly, unimpressed. “We can’t exactly stop whoever they’re coming from, and I don’t trust the bint that’s currently handling it considering that she’s asked Harry out twice in the time he’s worked in the auror office.\nDraco nods in understanding. “And you think that I, the dog on the leash, have neither the motive nor the means to go against you.”\nWeasley’s eyes narrow. “That response makes me wonder.”\nDraco actually snorts. It might be the first emotion he’s felt in months – a sharp, quick surge of incredulous humor. “Auror Weasley,” he sighs. “I have no designs on your Potter. If you want me to handle his mail, I solemnly swear not to tamper with it.” At least, he has no designs on Potter now. He might have, before Potter had severed their connection and left Draco for dead, but Draco has let his hopes die with his childish daydreams of true love.\nHe’s not bitter, in spite of his own sharp phrasing. He’s just aware is all.\nHe’s mildly surprised himself when Weasley snorts in return. “Actually, I’m asking you to tamper with it. I want all this creepy shit sorted out of his mail and fucking burned. I trust you’ll find some pleasure in destroying Harry’s love letters.”\nWell. While not quite right and not for the reasons Weasley assumes, he’s also not entirely wrong. Pleasure, no. Satisfaction? Perhaps.\nHe can’t say no, anyroad. He knows how it works when a person with power over you asks you for a favor.\nLess than an hour later, Draco has an entire fucking bin of Potter’s mail on his desk, and Weasley wasn’t wrong. It is creepy. Draco’s only been through fifteen envelopes so far and three of them have been love letters of the obsessive variety. Two of the three referenced other letters they’ve sent him.\nHe puts a trace on letters with the same magical signature of the letters he’s already pulled, and is able to eliminate another four letters total in the batch on his desk. He stares at what’s left. It will take him all day to get through it, considering that unless they’re sealed with official seals, he must open, read, and reseal everything that’s left.\nThen he remembers why he’s doing it.\nHe pictures Potter, the tightness of his face a striking contrast to his usual grins, and wonders how many of these letters have caused him to make that face again.\nHe’s not sure if it’s a decade-plus obsession or the soulbond that makes his chest tighten at the idea of Potter reading these sleazy, objectifying, often frightening letters. It seems like such a little thing, but if Draco is bothered just by reading them addressed to someone else…\nHe stays an hour and a half late to finish Potter’s mail for the day. Another small basket pops up as he’s leaving.\nHe leaves it for tomorrow.\n***\nDraco is Potter’s exclusive mail person for the next four months. He’s not even sure Potter knows who’s rifling through all his mail, and though part of him feels a sick lurch every time he thinks about how little he matters to his once-could-be-soulmate, he’s also a little relieved by it.\nEven once his hands start shaking regularly, he still opens and reads and seals Potter’s mail. There’s something soothing about knowing Potter’s schedule, what’s going on in his life, all through the sharp strokes of Granger’s pen, the invites, the inter-department notes about meetings and missions (what’s not strictly confidential, anyway).\nWeasley comes in to check on him one day. When he arrives, there’s a hurricane of mail around Draco’s head. Fourteen letters neatly lined up mid-air are from the same person – the owner of three letters from the first day he’d begun sorting Potter’s mail. The writer is getting desperate. Draco doesn’t know if she realizes her letters aren’t being received. He also doesn’t care.\n“Weasley,” Draco says, voice a little distant. He’s focused on his task, but he’s also not entirely in his head. He’s felt floaty for days. This is the fifth major bout of illness he’s had since the new year began in earnest. He wonders every now and again whether it’s his broken bond making him more susceptible or the Manor’s constant chill that’s ruined his immune system, but the end result is the same and he doesn’t quite care.\n“Draco,” Weasley says, an eyebrow raised high into his fringe. He’d begun using Draco’s first name ages ago, the result of prolonged familiarity. “You look like shit.”\nHe pauses, turning slowly. He looks up at Weasley through watery eyes. His fever has been kicking him in the ass, but his healer recommends that he stay away from Pepper-Up for a while. It’s hard to abuse Pepper-Up, but he’s found that it’s not as effective as it should be for Draco, which his healer had shown concerns about at his last checkup.\nHe hasn’t told anybody about the broken bond, though he’s sure Healer Clearwater – the only healer at St. Mungo’s willing to treat him - suspects. Without a letter about the circumstances, though, he can’t get out of his mandatory work assignment, and so he soldiers on and wishes passively that his bond will finally put him in a coma sooner rather than later.\n“Yes,” he says once he realizes Weasley is just staring at him.\n“Sick?” He nods. “Again?” Another nod. Weasley sighs heavily. “You look like shit,” he says again. “I was going to go for lunch after stopping by here. Have you eaten?”\n“No.” Draco’s not convinced he can keep anything down, and is about to say so when Weasley starts gesturing for him to stand. “Weasley –“\n“No, Draco. Shut up. We’re going to get food and that’s that.” He mutters something under his breath about being unable to believe what he’s doing, but Draco isn’t particularly surprised. Weasley began acting as though he pitied Draco a month and a half into their working relationship, and now is a frequent observer of his unhealthy lifestyle and slow descent into hell. “Merlin, can you move faster?”\n“… no.”\nHe knows that the place Weasley drags him to is wizarding, but doesn’t argue. Let him find out what happens when a death eater walks into any establishment in wizarding London, he figures. Him and Granger, that is, he amends once Weasley leads him over to a booth where the almost-Weasley awaits.\nShe raises an eyebrow. “Ron. Malfoy.” Draco nods at her in greeting like he had the day in the coffee shop, only the result this time is that he goes a little unsteady. Weasley grips his arm to keep him upright and makes an exasperated sound. “You don’t look well, Malfoy,” she says slowly once Draco gets himself sat and more or less stable.\n“That’s what I said!” Weasley agrees, nodding.\n“I’ve been ill,” Draco muttered, unsure of how to interact with these people in a semi-casual setting. Weasley is still technically his superior, but Granger is unknown territory. Best to treat her with the same deference he does Weasley, he figures.\n“You don’t look like you’ve been ill,” Granger says. “You look like you’re dying.” She looks skeptically down at his hands, which tremble against the table top. He puts them down in his lap, out of sight.\n“I’ve been very ill,” he corrects, and doesn’t acknowledge the fact that she’s absolutely right.\n“Mm-hm.” There’s a long pause in which Weasley and Granger share some sort of look, and then Granger says gently, “They have a soup that should be pretty easy on your stomach,” and then orders it for him.\nDraco discovers that if surrounded by two-thirds of the Golden Trio, magical establishments will serve him. Who knew.\nThough lunch is awkward, he still feels comfortable enough in their presence – or tired enough to not care – to fall asleep.\nThey stay an extra half hour before waking him and returning with him to the Ministry. When they enter, the wards sizzle against his skin. For the first time, the magic sensitivity he’s been developing hurts him, and he grits his teeth to keep from making a sound.\n***\nLunch with Weasley and Granger becomes a regular part of his week. He almost looks forward to it. After the second week, Granger attempts to get him to have real conversations with her, and his voice goes hoarse from how much more he’s talking than usual.\nHe goes with Granger to the muggle coffee shop, and she watches him with a surprised expression as he talks to Mimi the barista, who welcomes him with a familiar greeting and a smile. Granger tells him she thinks he’s changed, but he thinks he’s been changed. He doesn’t say it out loud, but he thinks it.\nWeasley stops in more and more to discuss the letters with him, because he apparently cares about Draco’s opinion of Potter’s stalkers. It’s because of the frequency of his visits that Weasley is the first to realize when the bond starts eating his magic away.\nIt takes him several tries to incendio a pile of letters (larger than normal, thanks to Potter’s recent success with a high-profile auror mission), and Weasley watches with his brows furrowed.\n“Has that been happening a lot lately?” he asks, and Draco shrugs. To be honest, even basic charms have been difficult for him lately. He’s chalked it down to the exhaustion – the way his hands tremble, or the lack of sleep itself – but once Weasley says something, he realizes it’s worse than that. It’s not just a lack of control; it’s a lack of magic. He can barely feel it – though he can feel the magic of others only too well.\nHe glances around at the letters stacked neatly on his desk. He’d convinced himself he was too lazy and too tired to keep his floating organizational system up, but once brought to his attention, he sees what he’s been denying.\n“Sorry, Weasley,” Draco mutters. “I’m not well.”\n“Yeah,” Weasley says. He incendios the next batch of letters, and the sparks of his magic make Draco hiss. Weasley just looks at him afterwards. “You’ve been saying that a lot, lately. About time you go to a healer, don’t you think?”\nDraco does.\n***\nHealer Clearwater looks at him with a very blank expression once he explains what’s happening.\n“This entire past year?” she asks. He nods. “Why come forward now?” Her eyebrows are furrowed like Weasley’s had been.\n“I think my magic is going,” he tells her, painfully honest. Her mouth drops open a little, and he has to swallow before continuing. “If it’s not just the exhaustion, if it is a symptom of the bond… then I’m going to need a note for my work assignment.”\n“You won’t be able to work much longer if your magic is starting to deteriorate,” she agrees, point-blank. “It’s typically the turning point for bond rejection. You’ll be housebound before Christmas.”\nShe’s giving him something like four months, he realizes, doing the math. Four months of having a real life. Four months before the clock really starts ticking down.\n“I’ll be back when it starts to get to be too much,” he tells her, and she purses her lips before nodding.\nShe stops him when he stands, ready to leave. “Who is it?” she asks, and he’s surprised to see that she looks almost upset. “Do they know? Have you talked to them?”\nHe wonders if she’s remembering the twelve year old who’d had a crush on her, who’d slipped away from his friends to ask for her tutoring help in the library as a way to spend time with her. He’d been spoilt and bratty, sure, but he’d also been soft as a kid, and had spent weeks trying to charm her before she’d gently told him that she was both too old for him and interested in someone else.\nPenelope is too kind to him, even now. He hasn’t been that kid in a while now, and he has the Mark to prove it. He is a man who probably deserves this. “He’s better off not knowing,” Draco tells her, and slips out of the room.\nWhen he goes home that night, he lays down and covers himself in the quilt his mother made. The residual magic clinging to it makes his skin burn instead of comforts him, and he cries himself to sleep in front of the fire he barely managed to start with the quilt abandoned on the couch. He wakes up cold.\n***\nIn early September, Weasley invites him out for lunch, like he does every couple days. He almost declines, but there’s something about the way Weasley invites him that seems shifty. He wants to know what’s going on, and so he agrees with a dubious expression.\nHe carries a walking stick now. He pretends it’s for fashion, but it’s not. It’s the clicking of the stick that alerts Potter and Granger when Weasley leads him to the table they normally share at The Camelia, Granger’s favorite spot for lunch. Potter looks at Weasley in disbelief, but Draco doesn’t say anything. Granger scoots down the booth and lets Draco take the aisle seat. Draco orders quietly, sits quietly, and shivers quietly as he is wont to do. Granger tries to drag him into conversation multiple times, but he dodges with one-word answers.\nHe feels both alive and dead, tortured and at ease, having Potter so close. With his hands in his lap, he tugs on his string, which – he’s noticed with a feeling of pure agony – has begun to fade to a brownish-pink, like blood on cloth. Potter doesn’t react. He likely can’t even feel the string, though Draco can see where they connect.\nFinally, Hermione sighs and gives up on making him talk. Potter’s been watching them interact (shooting incredulous looks at Weasley every few minutes) with a stony expression, but there’s something that sparks in his bright eyes once Granger asks, “Warming charm?”\nPotter’s eyes bore into him when he nods gratefully and sharpen when Granger’s charm visibly hurts him, though Granger and Weasley have both learned not to ask. He’s cold enough to accept every time she goes to renew the charm, even though the magic bites. The rest of lunch is awkward and passes quickly, but Draco keeps feeling Potter’s eyes on him.\nPotter doesn’t say anything when Weasley apparates him back to the Ministry, but he watches. Draco wonders what he sees.\n***\nDraco has a severe sense of déjà vu when he arrives at his cubicle the next day to find Harry Potter leaning against his desk. There is a stack of letters in his fist – stalker love letters that Draco has been waiting for Weasley to visit to burn. It’s easier to just incendio in bulk instead of tear each letter apart by hand.\nPotter glares at him when he approaches, watching in peripheral as the string gets shorter and shorter as the distance between them disappears. “You’re the bloke assigned to my mail?”\nDraco doesn’t bother to defend himself. He just nods. “Weasley assigned me to it ages ago. Months ago.”\nPotter’s jaw clenches. Draco had thought, before yesterday, that he’d almost forgotten what Potter looked like, but now he knows that he couldn’t. The way Potter’s dark hair would cover his scar if not for the way the lightning pattern darts down into his eyebrow and disrupts the hair growth there, or how square his jaw is, or how his bronze skin glows with the remains of his summer tan – these are all things that are seared into Draco’s memory.\nThis is the soulmate he will never have.\n“I hate knowing that someone goes through my mail,” Potter tells him firmly, as though that affects Draco at all. “It’s an invasion of privacy.”\nDraco sighs. He looks up at Potter with weary eyes. “I’m sorry you feel that way. You’re a public figure and your friend worries for you. He asked that I dispose of the stalker-letters and I rather fancy not pissing off the auror that determines whether or not I walk free, so I complied.”\nPotter just stares at him for a long moment. “What the bloody hell is wrong with you?” he asks – barks, almost – and then to Draco’s confusion he’s shifting out of Draco’s cubicle, spinning Draco’s chair to face him in the process, and gestures wildly for Draco to sit down. “You look like you’re about to collapse.”\nDraco cautiously sits, and the strain in his legs eases. He sets his walking stick against the wall.\n“What’s going on with you?” Potter asks once he’s taken a deep breath and is able to speak without hollering. “Something feels off.”\n“I’m surprised you’re asking instead of following me around,” Draco says, and Potter’s jaw clenches again. “I’m fine, Potter.”\n“You look like you’re dying,” he says, accusatory, much like Granger had that first lunch together.\nDraco, taken aback, just looks up at him with huge grey eyes. He probably looks haunted, is how he looks, but something in his expression must give him away because Potter’s expression twists.\n“You’re dying,” he says, and it’s not a question. “Fuck.”\nHe sighs again, slumping a little in his chair. No point in pretenses. “Quite.”\nPotter leans against the wall opposite his cubicle. “You haven’t said anything to anyone.”\n“My healer knows,” he shrugs. “I don’t have anyone else to tell, Potter.” Potter scoffs, but Draco can’t read if it’s unimpressed or unhappy or something else.\n“Hermione and Ron seem to like you well enough,” Potter tells him, sounding something close to huffy about it. He doesn’t seem to know what to do with Draco’s lack of fight. “They invite you to lunch and cast warming charms for you – which, what the hell is that about? Hermione kept your warming charms up the entire time we were at the restaurant yesterday.”\n“Granger and Weasley pity me,” Draco replies frankly. He doesn’t answer the question about the warming charms. Best not to give himself away. Potter’s not Granger, but he’s also not stupid, and if Draco gives him enough clues he’s sure the man will figure out his condition. He’s positive Granger has already, which means that if he figures it out he’ll get a confirmation before too long.\nPotter surprises him with insightfulness at the exact wrong time. “There’s something wrong with your magic, isn’t there?” he asks, and the hostility in his face and posture finally melts away. “Merlin, what’s happening to you?” He looks lost.\nDraco feels his chest warm slightly at the hint of concern. Trust Potter to show it even to an old enemy. “I’m not up to anything this time, Potter,” Draco tells him, probably too open. His voice sounds raw. “I’m just dying. Let it be.” His over-sensitive skin feels a flare of Potter’s magic. It’s the first time in a long while that the touch of magic hasn’t felt like fiendfire.\nThen he turns away and waits for Potter to leave.\nWhen he goes, his work seems duller and quieter than it ever had before.\n***\nWeasley stomps up to his front door that night. Draco knows he’s coming before he would have even before he lost his magic – the wards are suffocating him more and more every day, and when the chime at Weasley’s arrival hits him it knocks him breathless with pain.\n“You’re dying?” Weasley asks, a demand in his voice, when Draco opens the door. “What the fuck, Malfoy? I knew you were sick but why wouldn’t you tell us how bad it was?”\nDraco coughs a little, his chest tight. He’s sure he’s getting ill again, but doesn’t say anything.\nWeasley deflates when Draco just looks at him. “Why wouldn’t you say something?”\n“Why would I?” he asks, confused. “It’s not like anyone would care.”\nWeasley glares at him. “Because we’re fucking friends, you berk. Of course I’d care if you died – it shocks me, too, but I didn’t think you’re so oblivious that you didn’t even know!”\nDraco just blinks at him for a long moment. “You consider me your friend.”\nWeasley sighs. “Yeah, you git, in spite of everything, I do. I kind of felt bad for you at first, but once we started going to lunch together every week… did you really not know?” Draco shrugged helplessly. “Why did you think we invited you out all the time?”\n“I don’t know,” Draco says. “To keep an eye on me? Because you were suspicious of me?”\n“Because I kind of like you, idiot,” Weasley tells him. “You’re kind of funny and usually thoughtful, and you’re rarely a prick anymore.”\nDraco takes a long breath in and lets it out slowly. He doesn’t know how to respond. After a moment, he shrugs again awkwardly. “It’s probably the exhaustion,” he tries, and Weasley presses his lips together. He can’t tell if Weasley is smothering a laugh or an angry sound. “Weasley…”\n“Draco.”\n“Ron,” he corrects, still awkward, and then says softly, “I’m sorry I didn’t tell you. I didn’t think it would matter.”\n“How long have you known?” Ron asks, and Draco feels the last of his walls come down. He only has the one thing to hide now, and it’s not like posturing or appearances will save him.\n“A little over a year,” he admits. Ron sucks in a sharp breath, and Draco silently leads him up to the study. It’s freezing, to be honest; he’s not good at building or stoking fires by hand, and he can’t access his magic at all anymore. Before he can ask, Draco sits Ron down on the sofa he sleeps on and tells him the truth. “It’s a rejected soulbond.”\nRon takes that in.\n“Fuck,” he says, like Potter had earlier that day. Draco almost laughs. “That’s… Draco.”\n“I know,” he agrees, sitting down in an armchair. “But I can’t change it. I was rejected quite thoroughly – no point in hoping they’ll change their mind.”\n“Why?” Ron asks, and when Draco raises an eyebrow with a wan smile, he clarifies, “Why did they reject you? Surely your soulmate wouldn’t want you dead.”\n“Oh, he doesn’t know,” Draco says. Ron clearly notices his pronoun slip, but he can’t bring himself to care. “He cut the bond off before it could even form on his end. It’s interesting, really – my string…” He raises his hand, wiggles his pinky. “It used to be red, and faded to grey on his end. My end is fading, too, now, though I’m fairly sure that it’s because of my health rather than a lack of feeling.”\n“You should tell him,” Ron says, appearing dumbfounded. “Broken bonds are meant to be agony, aren’t they?”\nDraco just looks at him for a minute. “Ron. It’s over. I’m in agony anyway.” He stares into the weak fire he’d managed to keep going. It gives off very little heat. “I don’t have much longer, anyway. My healer says I’ll be bedridden by Christmas, and everyone knows that bond death comes quickly after that.”\nRon swallows. Draco glances at him, noting with some surprise that Ron looks as though he might cry. He doesn’t like that Ron’s upset, but at the same time, he realizes that just isn’t.\nHe’s had a year to come to terms with this – a year of avoiding the problem – but now that he can’t any longer, he’s finding that there’s something cathartic about being up front about it.\nThere’s also something cathartic about being a part of Potter’s life, even in a small capacity. Avoiding him worked fine, but having him around is surprisingly good for keeping Draco’s head on straight. He’s seen Potter and didn’t fall apart or spill his secret. Maybe he misses what he never had, but he’s still functioning. The fear of what would happen if they met is gone – he knows that in spite of the ache, he’ll keep functioning.\nHe’ll function until he can’t.\nHe smiles thinly and stands. “Would you like tea?” It’s one of the few things he knows how to make satisfactorily, and one of the few he can both stomach and enjoy nowadays.\nRon nods. They drink it in silence.\n***\nIn spite of everything, Draco finds himself genuinely shocked when he joins Ron and Hermione for lunch the next Monday only to see Harry Potter sitting at their table awkwardly yet again.\n“Hi, Malfoy,” Potter greets him, a little stiff but not unfriendly.\nDraco pauses, and Ron turns a suspicious eye on him, so he kicks himself into gear and nods in greeting. “Potter,” he says aloud, coughs weakly, and takes his customary seat next to Hermione. Both she and Ron are staring at him like he’s a zoo creature. He sighs. “Yes, we all know I’m dying now. It’s splendid. Can we stop acting like I’m going to keel over on sight?”\nHermione sighs. To her credit, she doesn’t pretend for a second that wasn’t what she was doing. “You should have told us.” He figured that Ron would tell her and Potter the second he’d returned home, and isn’t surprised at all.\nHe sneezes. It’s kind of pitiful the way it makes his whole body ache at the movement. “Like you didn’t figure it out ages ago,” he says, wiping his nose with a handkerchief.\nPotter, to his surprise, just nods. “If I figured it out within five minutes of being alone with him, it’s probably pretty obvious.”\nHermione makes a face. “There’s you being ill and you having a rejected soulbond, Draco. That’s…” Her irritation slips away. He’s left only with the sight of her genuine sadness – the face of someone mourning. He’s not even dead yet, nor does he think he’s really someone to mourn… but for some reason, both her and Ron have made that same face.\nHe wonders if the gods are laughing at him, sitting here with his childhood rivals, his only friends.\n“My soulbond is my business,” he tells her instead of voicing his self-deprication.\n“Mate, seeing you suffer is hard,” Ron says, wincing when Potter looks at him like he’s lost his mind. Draco winces a bit too at Potter’s reaction, though he tries to hold it in. “I thought it was kind of funny, at first – you had been so high and mighty – but…”\nDraco manages an eye roll. “Thanks ever so.”\nRon huffs. “You know what I mean. Even if we still didn’t get along, I wouldn’t wish a rejected bond on anyone. That’s a shitty way to go – it’s like double the shit. You die and it’s because of something that was supposed to make your life better.”\n“You’re helping tremendously by reminding me how terrible my lot in life is, thanks again. Really piling it on with the comfort, Weasley.”\nRon goes to argue with him – expand on his point, perhaps, though Draco has no interest in hearing it, but luckily their usual waiter stops by. He takes their order, smiling a little wider at Potter, and leaves.\nRon has lost the wind of his argument, but it still startles Draco that it’s Potter who breaks the silence that follows.\n“Why are soulbonds such a big deal?” he asks, and all three of them stare at him. “What? I came from a muggle background and I don’t research the hell out of things like you do, Herm. I get that having a soulmate is a good thing, but…” He shrugs. “I just don’t get it. What makes a rejected bond extra terrible?”\nDraco doesn’t think he can speak. When she glances at him, Hermione nods and answers for him. “A soulmate isn’t just a good thing, Harry. It’s a permanent bond that seals two people together in literally destined love – it’s the one person on the planet meant to compliment you and love you unconditionally. Rejected soulbonds really only happen when someone is rejected before it can fully form – like if you get hit on at the bar and shoot someone down immediately without talking to them or giving them a shot. Once it’s in place, it’s hardly ever severed because it’s so strong.”\n“Wizarding children are raised on soulmate stories,” Ron adds, a little wistfully. Draco watches Hermione’s expression, and feels faintly proud of her when she doesn’t react. She and Ron aren’t soulmates, he knows, though they’ve decided their love is worth it. That can be a hard thing to reconcile in and of itself. “There are people who wait their entire lives to find their soulmates without dating or loving anyone else. To be rejected by someone who’s supposed to love you more than anyone else in the world…” He glances at Draco, who looks away. He can’t stand being pitied, though he understands it can’t be helped.\n“It makes you feel like dying,” Draco says, abrupt. He hadn’t meant to start speaking, but now he can’t stop and the words spill out like water. “The second you feel the bond sever, it makes you want to die. You can always feel it like a hole in your chest where your soul is supposed to be, but the rejecting partner… if you don’t tell them, they’ll never know. They won’t feel it.” He glances down at his pale hands, at the fading string. “You can see the fate string connecting you, but it turns grey on their finger. If they don’t take it back and seal the bond, then your end of the string will eventually fade from red to grey, too, and you’ll die. You’ll get sick and grieve over them until you die, and you won’t even be able to hold it against them because all you’ll want is to be with them and make them happy.”\nHe can’t take his eyes off his rust-brown string.\n“You miss them, then?” Potter asks, the words coming out like he didn’t even make a conscious decision to say them – like they just slipped out.\nHe looks up and meets Potter’s gaze. He can’t imagine what his face looks like. “I will grieve over him and our bond until they day I die,” he says, unintentionally grave, and then he wrenches his gaze away and stands. He leans heavily on his cane as he nods his head to Ron and Hermione. “I’m headed back to the Ministry. I’m not hungry.”\nThey don’t stop him, but he feels their eyes on his back until he leaves.\n***\nDraco can feel the bond tearing him down piece by piece. He’d never thought there was a feeling worse than the pain he felt when he took the dark mark, but he was wrong. What he feels now is the literal rending of his soul into pieces, and he can’t even put into words why he breaks down crying in the middle of the work day from the pain. He begs out of lunch dates to the point that both Ron and Hermione start visiting him instead of going out. He frequently has to jerk his head up and pretend that he wasn’t on the verge of passing out before they’d arrived. He thinks Hermione sees through him – that she knows he’s getting worse – but he doesn’t have proof, and she hasn’t cornered him about it.\nThen, Potter starts visiting with them.\nThe first day he shows up, Draco doesn’t even realize he’s there at first. He greets Ron and Hermione tiredly and chats with Ron about one of Potter’s frequent stalker writers before he sees a familiar head of messy hair. He zeros in on Potter, standing awkwardly outside of Draco’s cubicle. His glasses are slipping down his nose. Draco hates that the sight of him almost makes him smile.\nDraco pauses then examines the area. There’s not enough room for four grown adults, even if one of them is thin to the point of emaciation.\n“Let’s go to the lounge,” he suggests instead of calling out Potter’s loitering. “We can’t all fit down here.”\nIt occurs to him that this is the first time all day that he’s felt well enough to wander out of his cubicle. He’s sure that both Ron and Hermione have picked up on this, because Hermione lights up, looking hopeful.\nThey follow him out of the mail room, and it occurs to Draco that this will be the first time he’s ever even stepped into the lounge. He avoids his coworkers with everything he’s got, and they avoid him – he’s never been tempted to visit. The free coffee wasn’t worth it.\nWhen he opens the door and steps in, there are two of his coworkers sitting on a couch talking quietly. There’s plenty of room for him and the golden trio, but at the sight of him, one of the women’s faces screw up.\n“We’re busy,” she says. Her friend nods next to her, uncomfortable. Draco can’t tell if it’s the animosity or his presence that makes her wince. “We’re using the lounge.”\nNormally, Draco would slink away and not respond, but his only two friends and his soulmate are standing behind him. He grits his teeth. “We’re not here to disturb you – we just want to spend lunch together.”\n“Spend it elsewhere,” the woman says. It comes out with a sneer. Draco realizes he doesn’t even know her name, but she knows his – she seems to know all about him. “Not that they’d want to see your face anywhere else. Death eater.”\nThe woman next to her takes a sharp breath, and Draco just stops breathing entirely. Humiliation burns through him, makes him wonder if this is the moment that the three behind him realize just who they’ve been making friends with. What that says about them.\nThere’s a long, ugly moment of silence, and then Potter speaks up from behind him. A hand gently comes up to push him to the side. He finds that when he’s moved sideways, there’s another hand on the opposite shoulder to keep him from toppling over. “What’s the hold up?” Potter asks, voice very bland.\nIt’s obvious he heard the exchange.\n“Mr. Potter,” the woman says. “We’re just –“\n“Chatting during your lunch break,” he interrupts, moving Draco aside (gentle hands still on his shoulders) so he can move forward into the lounge. “Which is what we want to do. Glad we got that settled.”\nHis eyes dare her to argue. She goes quiet, and Potter smiles a very satisfied smile, gesturing for Ron and Hermione to follow him inside. He leaves his other hand on Draco’s shoulder the entire time. He shivers a little under Potter’s touch, and a quiet warming charm lays over him. He doesn’t see Potter’s wand, but he knows the touch of his magic – warm, instead of biting.\n“Thank you,” he says under his breath. Potter doesn’t even listen, just leads Draco over to the empty table with four chairs, the perfect space for their little group.\nPotter doesn’t sit next to him – once he’s ensured that Draco is safely seated, he sits across from him. His expression is nearly impossible to read, but Draco doesn’t try no matter how much he’s dying to know what the man is thinking.\nAfter that day, Potter shows up for lunch regularly, and he doesn’t get handsy with Draco again, necessarily, but he’s also no longer afraid to steady Draco when he stumbles or nudge him awake when he nods off at lunch.\nHe also – and Draco has no clue how to explain this away – has begun to regularly cast Draco’s warming charms instead of Hermione. Draco isn’t sure if he’s realized that his magic doesn’t hurt Draco, or if it’s just easy for him to do quickly since he can perform wandless magic… he doesn’t have an excuse for it. He’s scared to get an answer about what they have or haven’t noticed, and so he doesn’t ask.\nLunch becomes Draco’s favorite time of the day.\n***\nThey’ve finally settled into a routine – with only a month left on the mental countdown until he’s inevitably house-bound – when the day comes that both Ron and Hermione are too busy for lunch.\nHe has no expectations. He stays in his cubicle, trying to sort the Stalker 7 letters out of Potter’s mail (Stalker 7 being the most presumptuous as well as the most persistent. Draco hates their letters with a passion). He’s got a blinding headache, and he can no longer take pain potions to ease them. The magic in potions makes his stomach cramp so badly he cries, and he’s too proud – or too scared – to ask for help.\nHe’s afraid that if he takes his problems back to Healer Clearwater, she will tell him it’s time to quit working, and the thought of being isolated in his huge, empty home (of being away from Potter, when he finally gets to be around him) terrifies him.\nHe has his head down, trying to block out the light and muffle the sound of his harsh breathing from anyone else in the office, when he hears a gentle knock behind him.\nHe looks up, hoping to Circe his whirlwind of emotions doesn’t show on his face, to find Potter standing in the entrance to his cubicle with a conflicted expression. His posture, however, is non-threatening, asking for welcome rather than expecting it the way Ron’s had been in the early days of their acquaintance.\n“Lunch?”\nDraco looks up at him, eyes watering from the pain. “I don’t think I can stand,” he murmurs without consciously deciding to be honest, and Potter’s expression goes from unsure to concerned in a heartbeat. He kneels in front of Draco, peering into his eyes. “Sorry, Potter. I’m not feeling well.”\n“You’re never feeling well,” Potter says archly, still examining him. Draco wonders what he intends to find.\n“Not when you’re around,” he grouses, the pain in his chest easing ever so slightly. It never goes away, but Potter’s presence is like a balm. “You make my condition worse by proxy.” He lets his mouth get away from him, too eager to push Potter away.\nTo his surprise, Potter just chuckles a little. “You’re terrible. C’mon, let’s go get lunch. I’ll carry you if I need to.”\nDraco surprises himself by agreeing. His headache throbs when he nods his head. “While I would love for the Ministry to see me being carried around like a prince by their savior, I’d rather walk.”\n“Best let them think you’re a strong and independent prince instead,” Potter agrees affably. Draco tries to smile, but doesn’t think that it comes out quite right. He opens his mouth to argue but thinks better of it. Potter seems to sense his agreement and stands, holding out a hand for Draco to take. With the other, he grabs Draco’s cane and hands it to him.\nDraco takes his hand, and tries not to think about the string connecting them, even though he can see it shorten when they touch. For a moment, he thinks it glows red, but when he gives it a closer look, it’s rusty-grey as usual.\nPotter takes him to a new place, a small diner that’s out of the way and surprisingly pleasant. Draco’s found that he likes places like this, little bustling cafes and restaurants that are so common in muggle London. When he steps in, the staff don’t even seem to start at his presence, the way the staff at The Camellia have only recently stopped doing.\nPotter sits him down and orders for him, saying only trust me when Draco gives him a look. “Thanks for coming out with me,” he says, as if he didn’t come to fetch Draco himself. “I was starving and Ron refused to look away from the case he’s working on.”\n“I haven’t eaten all day,” he answers with a shrug, trying to seem nonchalant. “I figured that I might as well.”\nPotter gives him a glance out of the corner of his eye, but doesn’t argue, even though he’s long since figured out how rarely Draco eats anyway. “Even so. It’s routine, coming to get you.” He pauses, looking down at his menu and trying very hard not to stare Draco down. It’s kind of endearing, but Draco would rather know what Potter has to say.\nHe raises an eyebrow. Potter makes a face. He waits, very patiently. Potter’s not good at holding things in.\n“Why don’t you ever come up to us?” he asks finally, proving Draco right. “Do you not want to have lunch with us? Are you just putting up with us because we ask?”\nDraco wants to smile at how easily Potter slots himself into the we. We, this group that asks him to join and wants him around.\nHe doesn’t smile. Instead, he’s brutally honest. “No. I’m just never sure of my welcome. Even now, months later… you told me you didn’t want me around you. I wasn’t going to impose on you when you’re only putting up with me because your friends like me.” Circe knows why they do, anyway.\nPotter turns red, and Draco isn’t sure if it’s anger, shame… embarrassment? Luckily, Potter clears it up for him when he mutters, “I was wrong.”\nFor all that Draco started this conversation himself, he can’t stop the way his chest clenches. He was wrong? The moment when Potter had severed their bond is the most poignant of his life – and now he’s taking it back? Draco glances down toward his string, but it hasn’t changed. It’s still faded. The sight of it makes him take a deep breath before he can even look at Potter again.\nJudging by the expression on Potter’s face, he’s picked up on the gravity of the conversation – at least the gravity for Draco, who’s sitting still except for the trembling of his hands (which never stop).\n“You were wrong,” he says flatly. He doesn’t know what else to say or how to respond.\nPotter looks vaguely ashamed of himself. “I was. You tried to create a truce between us, and I was still angry enough about the war and our past that I blew you off. I didn’t realize until you and Ron became closer that you were being genuine. I thought…”\nDraco finishes for him. “You thought I was trying to make nice in order to look good around others. To bolster my own reputation.”\nPotter nods. “It’s not fair, and I should have handled it better. I’m sorry, Malfoy.” Draco glances down at his string again. Yes, he probably should have. Things would be very different if he had. For a moment, Draco debates telling him – he can, can’t he? Now that Potter has almost admitted to wanting him around, to liking him.\nHe doesn’t. Instead, he gives Potter his best smile – a friendly one that hopefully doesn’t look like a grimace. “It’s okay,” he says gently. He wonders if it’s his growth as a person or the bond that allows him to be so gentle. He’d never been gentle before. “We’ve all changed. You had every right to be angry, to never want to see me again. I’m just glad we managed to reconcile after all.”\nPotter looks up from his food, surprised, but he breaks out a relieved grin of his own. “We’re okay, then?”\nDraco thinks of his broken bond, of the way he’s missed Potter and wanted him for over a year. Then, he meets Potter’s gaze and nods. “We’re okay.” He pauses. “Harry.”\nPotter looks almost startled, but then his grin widens. “Draco.”\nReally, very little has changed, but Draco feels like his world has brightened ever so slightly.\nIf he must go out, at least he’s managed to make his peace.\n***\nThings change after that.\nHarry greets him with a smile now and tends to walk next to him when they go from his cubicle to the floo. He likes to keep a hand on Draco’s elbow to keep him steady, though Draco doesn’t quite need that much support. He doesn’t call him on it; the touch is reassuring.\nIt’s clear that both Ron and Hermione are aware of the change – they sit together so that Harry can sit next to Draco. Draco asks about it at the end of one of their check-in meetings, and Ron only says “He always was obsessed with you,” with an eye roll before giving him a lazy salute and leaving the room. Draco doesn’t know what that means, but he just sighs. Apparently he’d just have to put up with his could-be soulmate being his best friend.\nAnother new development is that, like Ron, Harry begins to come down and check in on him. He uses the stalker letters as an excuse – I was just wondering if so-and-so is still writing, but while I’m here, you should tell me about your time abroad in France – but mostly he seems concerned about Draco’s ever-ailing health.\nIt’s strange. Before Ron, there had been no one to tell if he was having a bad day and no one to care about his death. Now, there are three people who are around to ask how he’s doing. Harry Potter himself comes down and check’s Draco’s temperature. It’s kind of flattering, but the rest of him hates how easily he’s come to rely on Harry’s presence just to feel like a person instead of a walking sore. It’s unhealthy – he knows it is – but he can’t quite stop. Loving Harry Potter is in his soul, and Harry is making it too easy.\nDraco remembers disliking him – at the very least, being green with envy at the sight of him. Even now, he doesn’t know what for. The fame? The talent? His kindness? His ability to be whoever he wants to be and damn the consequences? But he doesn’t feel envious of him any longer. He doesn’t dislike him or think he’s annoying. The bond didn’t make him like Harry, but it allowed him to see all the ways they fit together. It made him aware of the yearning he felt just to be around him, a yearning that’s haunted him since he was young.\nHe finds himself reaching out for Harry’s arm, and leaning into his hand when he puts it on Draco’s shoulder. He finds himself falling in love with his soulmate, and he can’t make it stop.\nHis string of fate goes from a rust brown to a faded almost-grey.\nRon calls him out on the way he’ll twirl it around his fingers sometimes. Draco’s barely paying attention to the conversation; he has a fever again and he’s half-convinced it’ll kill him this time. Ron asks him at lunch one night what it’s like to be able to see it.\n“It’s supposed to be red,” he mutters, and the words come out half-choked. His looks up blearily. Hermione looks stricken, and next to him Harry has covered his hand to stop its fidgeting.\n“Is it not?” Ron asks, and Harry hisses, “He’s told us before, Ron, it’s grey!”\n“I’m tired,” Draco says slowly. He must be, if he can’t pin down why he’d said what he did in the first place. Normally, he tries to avoid telling them about the bond (about how much he aches, or how he’s falling in love with a soulmate that doesn’t want him, about how Harry’s touch soothes the pain only for it to come back worse when he’s gone like it’s punishing him - )\n“Draco?” Hermione’s gentle voice sounds like it’s coming through a thick fog. “Harry asked you a question.”\nAll three of them are staring at him. At her prompting, Harry leans in to murmur, “I said, do you want to go back to the office? Or go home? You don’t look well.”\n“That’s becoming your catch phrase,” he mutters, but he leans against Harry’s side when his shake of the head makes him dizzy.\n“What, that you don’t look well?” Ron snorted. “It’s because you never do. Forgive us for worrying about you, your majesty.” He looks over to Harry. “Maybe you should take him home, though. I don’t like the idea of taking him back to the office and leaving him there.”\n“I can take care of myself,” Draco says, going for exasperated and ending up at tired. “I appreciate your concern, but… you don’t need to take care of me.”\nHermione shrugs, smiling wryly. “The way you can barely sit upright indicates otherwise.” The smile slips off. “… it’s getting worse, isn’t it?”\nDraco shrugged. His shoulder rubbed up and down against Harry’s. “We knew it would.”\n“Doesn’t make it easier,” she says. She’s wringing her hands in her lap, he can tell, though she’s trying to hide it under the tabletop. Hermione’s kind of fidgety, he’s noticed, but so is Harry. It makes it easier to tell when something’s bothering them. When Draco doesn’t have any rebuttal for her, she sighs. “You really should go home, Draco. I’m sure your supervisor will let you.”\nDraco snorts. “I bet you he won’t.” It comes out more bitter than he would have liked. When Hermione makes a face at him, he rolls his eyes. “Quinley hates me. Rightly so – I think he’s a prick and have no respect for his authority.” He makes it as haughty as he can, and Hermione graciously doesn’t mention Quinley’s real motivation, nor does she mention that Draco hasn’t talked back to Quinley once to justify his hatred. It’s not worth it, and would likely leave him in auror custody again if Quinley reported his defiance.\nThey do a marvelous job of ignoring the dark-mark shaped elephant in the room, the four of them.\n“I’ll go with you,” Harry volunteers, and then without waiting for a response he nudges Draco out of the booth. By ‘nudges,’ Draco of course means that he practically lifts him out, as a strong breeze could knock Draco over. He opens his mouth to argue, but Harry just raises an eyebrow at him. “Do you really want to go back to sorting my mail?”\n“I was rather looking forward to what secret admirer 12 had to say this time,” Draco mutters, but now that he’s on his feet again he can admit he’s feeling rather faint. Harry’s presence makes the effects of the bond better, but he by no means cures them.\n(He could. Draco won’t ever ask him to.)\n“I’m sure whatever she has to say is riveting,” Harry snorts while he grabs the papers he’d brought with him to lunch. He’d never actually ended up reviewing them like he’d meant to.\n“Last time they begged for a couple strands of your hair so they could polyjuice into you and molest your gorgeous auror body.” He makes air quotations with the hand not keeping him upright on his cane. Ron is startled into a laugh.\nThey say their goodbyes, and Harry leads him away with that fucking hand on his elbow, leading him to the nearest floo. Apparition has been too hard on him lately.\nIt’s Harry’s hand on his elbow that makes him privy to the way Draco’s entire body shudders with pain when they break through the Ministry’s wards. “That looked like it hurt,” he says cautiously, pulling Draco to the side so he could check on him without blocking the floo. “The wards…?”\nDraco nods, even though it makes his head ache. “It only hurts when I pass through them. I’m not the one that monitors them, so they don’t bother me whenever I’m in the building.” He shrugs. “It hasn’t affected my work thus far, anyway.”\nSomething about what he says makes Harry narrow his eyes a little, but Harry doesn’t ask; he just gestures for them to move forward toward the mail room. They walk down at Draco’s pace, Harry patiently walking with him even though Draco is slow and somewhat shaky on his feet.\nAs it turned out, Quinley really doesn’t argue when it’s the savior himself asking for a half day off, and Harry gives him a very fake smile before shoving Draco out the door and back toward the floo.\n“I hate the way he looks at you,” Harry mutters. “Like you’re dirt beneath his shoe. Elitist prick.”\nDraco glances over at him. There’s a small voice in his head that wants to say that he is the dirt beneath Quinley’s shoe, and he can’t figure out if it’s the depression or his own belief. “You used to look at me that way,” he says, going for conversational but falling flat.\nHarry doesn’t even react. “And I’ve told you I was wrong for it.”\n“Yes,” Draco says agreeably. “But you also can’t deny that I have brought that treatment upon myself.”\nHarry pauses in the middle of the hall, face blank. “You… are you trying to convince me you deserve to be treated like hippogriff shit?”\n“I’m just saying it’s not entirely uncalled for,” he clarifies slowly. “Perhaps people deserve to be forgiven, but human behavior does not always align with ideal morality, and I have made a great many bad decisions.” He looks down at his greying string, flexing his finger around his cane handle. “I can’t fault any of them – my coworkers, my soulmate. Their rejections make sense.”\nDraco is growing sick of seeing the dark clouds that cross Harry’s face without any idea of what thought prompts them. Agreement? Disagreement? He is normally good at reading people, but he realized very quickly that he can’t read Harry Potter at all.\n“We can’t have this conversation here,” Harry says, abrupt, and he leads Draco back toward the floos at a quicker pace. He half-struggles to keep up, but Harry doesn’t stop this time, and Draco doesn’t complain.\nHe doesn’t expect Harry to go with him, but when Draco asks in confusion, Harry tells him curtly that it wouldn’t do for Draco to collapse in his entryway and brain himself on the floor. He hasn’t collapsed yet, but he also knows that Harry’s concern isn’t unwarranted, and so he sighs and lets Harry follow him into the floo.\n“Malfoy Manor!” Harry says, and they are swept away.\nThey emerge in the Manor, and though Draco tries to hide it, the wards immediately dig into his skin. He grits his teeth and forces a smile when Harry glances over at him. “Are you going to help me upstairs, too?”\n“I’m taking you to bed, yeah,” he answers, raising an eyebrow like he expects Draco to say I’m actually going to do some work…\nInstead, he just sighs. “I sleep in the study.” At the raised eyebrow he gets, Draco adds, “It’s easier than keeping multiple fires lit over the course of the day.” He doesn’t question that (probably knowing exactly where the Malfoy house elves went), and just nods, letting Draco guide them toward the study.\nOnce he gets seated on the couch, Harry lights a fire, and the wards flicker with the foreign magic happening within its walls. His face screws up when the pain goes from a constant low-level prickling to a stab. It’s not until he schools his face back to a neutral expression that Harry says, “I knew it.”\nDraco blinks over at him and thinks to himself that he’s getting sick of Harry taking him by surprise. “What?”\n“You’re still tense, and the wards alerted you when I cast the incendio just now,” he snaps, and Draco has to physically restrain the flinch. He knows that Harry isn’t upset with him. “You said earlier that the wards at the Ministry don’t bother you because you’re not their keeper – that means that the Manor’s wards are hurting you, aren’t they?”\nThere are mice in the cellar. If his sensitivity to magic wasn’t ramped up to eleven, he wouldn’t even be able to feel that twitch in the wards, but every movement they make feels like a needle under his skin. The constant pressure of the wards makes a headache pound behind his temples. He can feel it growing now as they speak, and he grits his teeth at his own weakness.\nHarry’s brow furrows when he doesn’t respond. “Draco. You don’t need to lie to us about you being in pain.”\n“I’m always in pain,” he bites out, hating the way his voice comes out acidic like he’s 16 again and Harry’s getting to close to his secrets. In a way, he feels like a 16 year old, and he hates it; at 23, he shouldn’t still be feeling like an overwhelmed child, should he? “Everything hurts, Potter –“ and he’s on a roll, now, spitting out Harry’s name like a curse and pitying himself even though he’s tried so hard to be reasonable about everything – “and I can’t do anything to stop it. I’m in pain so often now that I’d rather be dead than remember that I’m dying because my soulmate doesn’t want me! I can’t do magic! I can’t move faster than a bloody turtle’s pace and I feel so empty –“\nHarry tugs him close, tucking Draco’s head into the crook of his neck without his permission, and Draco feels his mouth twist into a sob before he can control it.\nHe won’t let himself cry, but he does let himself rest his head on his soulmate’s shoulder and breathe for a long moment.\n“I apologize,” he mutters against Harry’s robes.\nHarry surprises him by rubbing a hand up his back. The other is dangerously close to cupping the back of his neck. Draco tries very hard not to sink into his warmth, into the expectation that Harry is going to be here for him. “You know you don’t need to apologize for being upset about this, right? Do you know how often I lashed out during the war, when it seemed like everything bad that could possibly happen to me did?” He pulled away and grinned a little sheepishly. “Maybe that’s a situation where we have to learn to control our tempers, but… it’s okay to be upset. It’s okay to need to rant about it sometimes.”\nHis hands are still gentle on Draco’s shoulders. Harry really is so touchy with Draco - he’s tried to find some logical reason to explain it, but everything he’s considered seems like him getting his hopes up and he refuses to fall into that trap.\n“I don’t understand why you’re like this,” Draco tells him lowly. “You… you’re nothing like I used to think you were.”\nHarry gave him a crooked grin. “People are like that. You’re different than I thought, too.”\n“Not too different, I’m sure.”\nHe shrugged. “Snarky, yes, and proud. But… in a lot of ways you’re nothing like I thought. You don’t give yourself enough credit for how much you’ve changed since Hogwarts.” He stood and cracked his neck. “C’mon. Why don’t you stay at my place? The wards at Grimmauld shouldn’t bother you once you’re inside, right? It’s too big for just me, anyway.” Draco wants to snort. Imagine how I feel in the Manor, he wants to say.\n“I couldn’t…” Impose. Be so close to the one person he wants to be close to. He doesn’t know how to finish the sentence, but Harry stops him before he can figure it out.\n“You can, and will,” he says with a raised eyebrow. He gives Draco The Look until he sighs and nods in defeat. He wonders if Potter thinks him too easy. It doesn’t matter; Draco is, for him.\n“Let it be noted I’m agreeing under duress.” He gives Harry a pointed look.\n“Noted. Let’s go.”\n***\nHe all but moves into no.12 Grimmauld Place, and while on the surface he’s incredibly unhappy about it, something within him settles a little bit at the proximity, like the dying is a little easier to bear.\nHarry’s easy to live with. He’s good at the chores that Draco is now too weak to do, and has so much magical energy that he can cover both his own and Draco’s magical needs. The fires are always kept, their clothes cleaned, and Kreacher is there to feed him when he can’t get out of bed after a long day at work.\nThey eat dinner together. Draco hates how domestic and cozy it makes him feel, like he’s safe.\nDraco finds out that Harry is pretty good at wizarding chess, which they play often on their days off, when Draco is awake and needs something to do. Ron, apparently, is better, and sometimes he comes over to play as well.\nDraco works late one day early into their new arrangement, and when he gets home Harry is waiting in the living room for him with a book in hand.\n“You read?” Draco asks, as teasing as he can be when his back hurts and his head is pounding and even the split-second of pain when he goes through the Grimmauld Place wards makes him want to vomit.\n“Come here, you berk,” Harry says, rolling his eyes, and Draco settles on the other end of the couch, folds his legs underneath his body – trying to ignore how frail he feels, how thin he is even compared to his naturally slender frame. Harry stretches out, stuffs his feet under Draco’s shin, though he can’t imagine that he gives off any warmth. Then, Harry summons a blanket for them both and begins to read.\nIt’s a muggle novel about some shithead detective and his level-headed companion, and Draco enjoys being read to, though he often falls asleep (only to wake in his own bed the next morning).\nThey settle into a comfortable duo, going from a pretense of I’m doing you a favor, I just want to help to I want you around. I’m happy you’re here.\nDraco has missed living with another person. Living with Harry makes him remember why going home after work is a good thing and what it’s like to have something to look forward to.\nOf course, it’s once he settles into this pattern – once he starts to feel okay in spite of the cold, of the magic loss, the magic sensitivity, the exhaustion, the pain – that he collapses one day at work.\nThe woman who’d tried to kick him out of the lounge – the woman who’d once said that she wished he would kill himself – finds him in the hall, eyes closed, bleeding from where he’d hit his head on the corner of a desk.\nHe has no idea what happens after that, but finds out later that it had taken half an hour for them to finally call a Healer and get him taken to St. Mungo’s.\nWhen he wakes up, Healer Clearwater is standing over his bed. Hermione and Harry are sitting in visitor chairs off to the side. Hermione’s eyes are red. Harry’s are very green, and he looks like he’s swinging back and forth between anger and sadness. Ron, he remembers, had an important meeting that afternoon, and hadn’t even been planning to join them for lunch. That exhausts the list of people who would care about him being in the hospital.\n“It’s time,” Healer Clearwater tells him once she’s sure he’s lucid. He struggles through a heavy sigh and nods.\nHe leaves with a healer’s note for permanent leave. Harry frog marches him to his bedroom at Grimmauld Place and snatches his leave note. He’s the one who turns it into Quinley, and later recounts to him Quinley’s very pained looking well wishes.\n“I’m going to miss that smarmy bastard,” Draco sighs. Harry, who’s lounging on the other side of the bed with the book he’s been reading, snickers.\n“You’re a smarmy bastard.”\n“Like calls to like.”\n“Strange, because I hate him even though I’m pretty fond of you.”\n“You must be biased.”\nThere is a moment where Harry just snickers at him. He smiles sleepily and hopes his expression isn’t overly soft.\n***\nHe makes Harry go with him to the muggle café he still visits, albeit less frequently than he had a year ago. It’s only been a week since he was put on proverbial house arrest, and Draco is sick of his bedroom walls, lovely as they are. Harry had provided him with the old master bedroom, and the opulence reminded Draco of better days at the Manor. He refused to thank Harry for it, but he had said very quietly that he loved it, and Harry had squeezed his shoulder to show he’d gotten the message.\nMimi is glad to see him. He’s honestly wondered if she would still be working here, but he comes in during her usual hours anyway and is rewarded with her huge smile.\n“You brought another friend,” she says once they’ve exchanged greetings. There’s no one else in the shop – it’s late afternoon, between lunch and dinner rushes, and she chats with them while she makes their drinks. “I thought the ginger one was the only one you had.”\nDraco smiles dryly. He watches her try to avoid looking at the cane and back up at his face in worry, and it’s almost amusing. “Slander,” he says. “If this is your idea of customer service, I’m leaving.”\nShe wrinkles her nose, making Harry laugh. “The ginger one? You’ve brought Ron?”\n“This is my favorite café! I’m allowed to bring whoever I want.”\nThey bicker as they wait, and by the time Mimi slides their drinks out with a charming grin, he’s half-leaning against Harry to remain upright, but he’s smiling.\nThey finish their coffee in the café, because Draco’s hands shake too bad for him to carry his drink back to Grimmauld and Harry can’t carry drinks and catch him if falls. He’s not mad about it – he loves the warm colors and the way Mimi will stop to check on him every couple minutes to catch up. She rags on him about his absence lately, and he explains to her that he’s been busy. He has, after all – he spends all of his time with the Golden Trio (as he can’t stop calling them in his head) or at work.\n“Who’s the boy?” she asks with arched eyebrows when Harry uses the restroom. “Boyfriend?”\nDraco shrugs. His cheeks might have turned pink a year and a half ago, but now he stays as pale as ever. “Old flame of a sort. He doesn’t want me.”\nMimi pouts, but her eyes are sad for him. “He should. You deserve good things,” she says.\n“You don’t know that.” Draco can’t help but smile a little. His lips feel chapped, and he wonders how bad he looks, whether or not he’s even presentable. He hasn’t had the energy (or reason) to worry about his appearance in a long time. “I could be a terrible person. You only see me for five minutes a week.”\n“You’ve got an alright energy, Draco,” she tells him knowingly. “Sometimes, you’ve got to trust the energy.”\nSomething about her surety makes him sad. “I appreciate that,” he says, and Harry comes up over her shoulder with a quick glance between them. “Ready to go?”\nShe backs up a little to let Harry pass. “Yeah, ready,” Harry agrees, and then he turns a smile on Mimi. “Thanks for the coffee. Have a good day.”\n“Have a good day, Mimi,” Draco agrees gently, and she smiles warmly at them both, watching Harry help Draco stand. He hands Draco his walking stick and then carefully cups his elbow to help him get steady on his feet.\n“Feel better!” Mimi says as they leave, like she always does. He doesn’t know how to tell her he’s not going to get better. He wonders if she’ll even realize he’s stopped coming after he dies.\nHarry seems to pick up on his odd mood, but he chatters quietly as they make their way to a quiet space to apparates home anyway.\n***\nDraco tries not to become bitter the longer he’s kept inside Grimmauld Place, but even his four-poster bed with its gauzy curtains and the open window into the back garden can’t stop him from feeling sequestered away like a maiden with consumption from the eighteen hundreds.\nHe’s good at not being bitter now – much better at it than he was in his teens, anyway - but it’s not always easy. He’s got plenty to feel sorry for himself about, and very little to look forward to.\nThe list is small. One is that Harry still reads to him and engages him in discussion about the book. Draco is the intellectual between them, but Harry’s better at people, and always has interesting insights about the characters. He also likes it when Hermione and Ron come over for dinner, and when Blaise makes the time to floo-call him.\n(Blaise doesn’t even know he’s sick. Harry thinks it’s cruel not to tell him, but Draco doesn’t care about Harry’s opinion – not in this.)\nThere are other things, too – Harry can cook, and makes him dinner. He often visits on his lunch break, breaking up the monotony of Draco’s day. He has a large bathtub to soak in, and Harry buys him fancy bath salts because Draco “looks like the type” (he is). Draco sometimes goes into the study and examines the Black family tree, looking at his parents’ names. It’s a place of solitude and calm for him that he hasn’t had in a while.\nAt the end of the day, though, most of his happiness comes down to Harry. He gets used to living at Grimmauld Place, and prays he gets to stay here until the end. Harry would be well within his rights to hospitalize Draco if it came down to it, to not want a dying man living in his home, but he’d rather die in bed.\nHe gets sick again, and wonders to himself – burning with fever and half-delirious – if the end is coming.\n***\nHarry calls Healer Clearwater to the house when, a week and a half after he gets sick again, Draco still finds himself spending most of his time dizzy and cold, a perpetual layer of sweat slicking his body.\nAfter her examination, Harry pulls her out of the room for her opinion, but Draco can still hear her tell him in a gentle voice that he’s got a couple of weeks. If he’s lucky. His immune system is weak, and his overall health is fading regardless. He has a hard time eating, his sleep patterns are unhealthy… his body is shutting down. Draco ponders that, calmer than he thought possible, and surprises himself by feeling relief. The guessing game is over – He can breathe at last.\nWhen Healer Clearwater comes in to break the news, she also tells him very quietly that Harry’s not handling it well. Draco could have told her as much.\n“He really cares about you,” she muses. “You had strong feelings about each other at Hogwarts, but I never imagined you’d be so close one day. I probably shouldn’t be surprised; your rivalry was legendary. Of course there’s a lot of pent up emotion there.”\nDraco huffs a weak laugh. It’s really not funny. “Ron said the same thing. A pretty pair we make – the savior who wants to fix everyone, and the dying death eater who can’t be fixed.”\nPenelope reaches out to pat his hand. “You don’t need fixing anymore, Draco, but… let Harry take care of you while he can. I think he’s going to take this pretty personally, like he failed you somehow.”\nDraco sighs. His eyes kept fluttering shut, the exhaustion trying to drag him back into sleep. “He doesn’t know the half of it, but he shouldn’t. I don’t want him to blame himself.” After a long beat, he opens his eyes again to see Penelope looking down at him with huge eyes, putting the clues together. Before she can say anything, he manages a small, knowing smile. “Healer-patient confidentiality,” he reminds her, and watches as her jaw tightens.\n“If you hadn’t signed the paperwork forbidding me from sharing information that could save your life, I would walk right out there and tell him what you just said to me,” she hisses, standing and crossing her arms. “Total privacy clause – what hippogriff shit.” \n“Don’t be angry,” he says softly. “I made a choice based on circumstances, and I intend to follow it through. I’m okay, really, and he’s better off.”\n“I disagree,” she snaps, but after a moment she just takes a deep breath. “If I can’t convince you out if it…”\n“You can’t.”\n“… at least tell Weasley or Granger,” she finishes. “Let them help you. You’re underestimating how much that man cares about you, and it’s going to kill you.”\n“Funny,” Draco says dryly. “He rejected me.” He yawns. “It doesn’t matter. We’re okay now, and I’m not going to make him feel like he has to choose between me and his future. I’m at peace with it.”\nHe can hear her foot tapping. “As your healer, I strongly advise against it.”\n“Noted. Thank you, Healer Clearwater.”\n“… You’re welcome, Draco.”\nShe leaves again, and Draco lays alone in bed for several long minutes. He assumes that Harry is seeing Healer Clearwater out, but then several minutes turns into half an hour, and Draco finds himself drifting off, wondering distantly what Harry and his healer are talking about. He’s not worried she’ll spill his secrets, but he wouldn’t put it past her to give him a hint, or recommend him to talk to someone that would steer him in the right direction.\nHe needn’t worry. Harry wakes him he doesn’t know how long after, his green eyes rubbed red and puffy.\n“Have you been crying?” he asks, voice a soft rasp with sleep and sickness. “Gryffindor.”\n“I can’t believe you’re so calm about this,” Harry manages to say thickly. “Slytherin.”\nHe sits on the edge of Draco’s bed, and with a sigh Draco scoots back so Harry can lay down comfortably. Harry does, staying to his own side, but he does let a tear slip from his eye and down his nose. Draco watches him cry quietly. “Are you really going to miss me that much?” he asks after several minutes have passed.\n“You have such a hard time acknowledging that people care about you,” Harry says, and his voice is thick with his tears. He hadn’t been crying that hard, but Draco suddenly has a pit in his stomach telling him that Harry is trying to hide how upset he is. There is a suspicious wobbling to Harry’s lower lip. His tears make his eyes so much greener.\n“Historically, very few people have,” he shrugs as much as he can laying down. “But… oh, Harry. Stop crying.”\n“You’re so heartless,” Harry laughs wetly. “Stop crying. I can’t stop, you git. Look at you. We’ve only just gotten to be friends.”\n“I’m not heartless; I’m pragmatic. There’s no point in crying over me.”\n“You may be okay with this,” Harry says quietly. “But Merlin, Draco, I’ll miss you. I’m sick of losing friends, and I hate seeing you suffer like this. I want to go flying with you and go out with our friends and be people, and I hate thinking that we’ll never be able to do those things.”\nHarry shifts a little closer, and Draco sighs before shifting onto his back and reaching over his own body to pull Harry into his side. Harry goes willingly, pressing his nose into Draco’s shoulder.\n“When I was a kid,” Draco tells him, hesitantly – still debating whether or not to even say it. “… all I wanted was to be your friend. From the time I was very young to about when I turned twelve, I had this stupid daydream that we would be best mates and save the world. I don’t know. I wanted to be a hero and go on adventures and…” He shrugs, shifting Harry’s head against his shoulder.\n“You were a prick and I’m not going to apologize for turning down your shitty friendship in first year,” Harry mumbles, and Draco snorts.\n“I’m just saying,” he continues pointedly. “I always wanted to be your friend, and I wanted to be glamourous and have everyone love me… but it’s better now. Just you and me. No adventures, just being people. I’m… happy with this. I’m glad we got our time.”\nThere’s a very long moment in which Harry stiffens against him, and Draco thinks that perhaps he’s somehow angered him – maybe Draco’s self-absorbed childish fantasies have pissed him off.\n“I want more,” Harry chokes instead, and Draco realizes he’s not angry. Harry’s still body begins shaking with sobs, and Draco is stunned into stillness of his own when Harry cups his hand around his neck and pulls him in so that they’re wrapped around each other even tighter. Draco brings up a shaky hand to pet at his hair. “I don’t want you to die – I want to do those things I said, and maybe even go on adventures like you wanted, but the good kind, where I take pictures of everything and you try to pretend you’re not impressed by any of it even though you are. I want to… I want to see what you’ll be like in a decade, and I want you to be healthy and happy like I haven’t seen before Voldemort came back. I want all those things, and it’s fucking shit because you’re dying and none of it will ever happen!”\n“Harry…”\nBut at the sound of his name, Harry cries harder. He’s an ugly crier, Draco thinks, but somehow the sound makes his own lower lip wobble with the effort it takes to keep himself from crying.\n“Stop,” Draco sighs again, and he lets his hand card through Harry’s hair gently, scratching at his scalp. “Harry, I don’t want you to cry.”\n“Then stop bloody dying,” he snaps, but his voice cracks, and Draco closes his eyes to try and stop his own tears. He fails, and one slips down his cheek to land on Harry’s hair.\n“I don’t want to die either,” he whispers, and Harry’s shoulders shake. “I… don’t want to give this up.”\n“Then don’t,” Harry says, and he sits up abruptly to look Draco in the face. “Draco, your soulmate. So they were a fucking prick, so what? You don’t have to be with them, right? Tell them, make them take it back, and then you can stay here with me – and Ron and Hermione, obviously.” His cheeks are pink, but Draco can’t tell it’s because of the slip (can’t even tell if it was really a slip or just thoughtless phrasing) or his tears. “Just… make them heal your bond, and then don’t die. This is avoidable, isn’t it? If you can convince your soulmate to take back the rejection?”\nWhat really kills him is the fact that he… can’t think of a reason not to now except that if he tells, Harry will not only get to keep him, but that he’ll also have to live with the fact that Draco lied to him about for almost two years. Draco wonders if he could handle telling Harry and having to live without him if Harry felt betrayed by him, or if Harry didn’t want anything to do with him romantically.\nSome soulmate bonds are platonic. His feelings for Harry are anything but. That one fact shouldn’t scare him so much, but it does. His fear of Harry’s reaction – of the possibility of Harry abandoning him once he finds out the truth – keeps his mouth shut.\nWhen he doesn’t respond right away, Harry grabs the hand that had fallen out of his hair. “Draco, please. If you tell me who it is, I can bring them here for you, I could send a message – I’ll help however I can.” His voice dropped low at the end, gravelly. “Just let me help you. If there’s a way to fix this, let me do it.”\nHarry has never asked him for this before. Ron and Hermione both have – Healer Clearwater has, too – but never Harry, not until the truth of Draco’s mortality slapped him in the face.\n“I’ll think about it,” he says softly, unable to say no but too afraid to say yes.\n“You don’t have long.”\n“I’ll let you know soon,” Draco sighs, and he manages a small, teary-eyed smile when Harry just nods emphatically and hangs his head. “Thank you, Harry.”\nHarry huffs a wet laugh. “For what, caring about you?”\nHe wants to tease, to make it a joke, but it’s too honest when he replies with: “… yes. For caring about me.”\nHarry’s quiet for a long time, but he doesn’t let go of Draco’s hand. “You’re welcome.”\nHarry holds his hand until he falls asleep.\n***\nWhen he wakes up, the muggle clock Harry bought for him lets him know that he’s lost almost a full day, and it’s late afternoon. He hates thinking that he’s losing what little time he has left, but the extra hours leave him feeling a little more awake – a little less frail – than usual.\nHe gets out of bed for the first time in days, the wood floor cool against his feet, and he slowly goes downstairs. Kreacher makes him tea, and he sits in Harry’s living room (their living room) with the telly on. He’s not a huge fan of any of the shows Harry’s had him watch, but it’s good background noise, and he curls up on the couch with his tea to relax to the sound of an angry muggle trying to teach other muggles to cook.\nThis is where Ron finds him an hour or so later. He comes through alone, making Draco wonder idly where Harry is if their shifts are over.\n“What are you not doing in bed?” Ron asks, eyebrows raised, when Draco startles him with a greeting.\n“I woke up and was sick of laying around,” he shrugs. “I feel like I’ve been in bed for ages and I didn’t feel terrible when I woke up, so I got up.”\nRon nods. “Makes sense; I’d be about ready to punch myself in the face if I was stuck in bed all the time. No fever?”\n“Guess not,” Draco hums. “Healer Clearwater gave me something last night when she stopped by and I feel alright now, so I figure it helped. Some variant on Pepper-Up, I think she said. Anyway, where’s Harry?”\nRon’s face does something interesting when he mentions Healer Clearwater, but he doesn’t comment on it. He figures Harry must have told Ron about the diagnosis. “He’s working late tonight,” he answers instead, and Draco nods. “We just got in a case – it’s not especially bad and nobody’s dead, but the paperwork is a nightmare.”\n“Poor savior,” Draco snorts. “Trapped by paperwork.” Ron’s lips twitch upwards, and he comes to sit down on the couch next to Draco. He called for Kreacher to make something for an early dinner, and they eat there together, chatting and quietly watching the telly. Draco’s kept the cooking show on, and while they eat they chat about magical ways to improve the show – ways magic makes cooking easier, or foods prevalent to the magical community that would make the recipes better.\nRon stays for several hours, and it’s not until they’ve eaten desert and Draco is beginning to nod off where he lays that Ron speaks up.\n“You know, I think the thing with you and Harry is interesting,” Ron hums.\n“Couldn’t ever picture us getting along?” he asks, yawning.\nRon gives him a weird smile. “I could, actually. Funnily enough, I always thought if you could sit down and work through your shit, you’d be mates. I used to think I was the placeholder friend because he always seemed like he’d rather be talking to or about you, even if he hid it with anger. He always was obsessed with you, you know.”\n“You’ve said.” He pauses. “You do know that I’m not going to steal your best friend.”\n“No, I know that now. I’m just saying…” There was a long pause. Ron’s expression was unreadable. “Would it be so bad to tell him?”\nFor a very long moment, Draco doesn’t breathe. The silence in the room deafens him. He looks over to meet Ron’s gaze with what must be fear plain on his face, but Ron doesn’t react to it. He looks like he’d expected it. Draco had been half asleep two minutes ago, but now he’s wide awake.\n“He wouldn’t turn you away,” Ron says quietly.\nHe can’t breathe.\n“You knew?”\n“Not for sure,” Ron shrugs. “Not until just now. But I suspected. It made sense.”\n“You can’t tell him.”\nThe look Ron gives him is almost pitying. “I can’t promise you that, Draco. Not if it would save your life. I’m sorry.”\n“You can’t meddle in my life,” he snaps, and he means to sound angry – but he’s not angry, he’s desperate, and it shows in his voice. “You can’t make this decision for me!”\n“This is life or death, Draco,” Ron says evenly. “I won’t respect your privacy if it means keeping you alive.”\n“It’s not your decision!”\nRon leans forward toward his chair, his hands clasped in front him. He looks painfully earnest. “But it is his, and you’re taking his ability to decide from him. I know you’re scared, but he deserves to know, Draco, and I think you’d be surprised by how much he’d want to.”\nDraco’s fists are clenched. Why do people keep saying that? “He rejected me. I was going to die alone so he’d never have to know. He told me he didn’t want me.”\n“He was angry. He judged you based on your past and he apologized for that. You can’t hold it against him.”\n“I'm not, I just... I don’t know how to tell him,” Draco says, honest even though it kills him, and Ron’s entire expression softens. “At first, I didn’t say anything because I didn’t want him to be with me out of obligation… but how do I explain that now? How do I explain I’ve been his friend for months and haven’t told him?”\n“He’s going to care more about you living than how long it took you to tell him,” he answers. “That doesn’t make it easier, but it’s true. He needs to know.”\nThe thing is, Draco knows he’s right, but he also can’t shake the idea that Harry would agree just to save his life. That had always been his fear, and it hasn’t changed. He had a very clear vision of Harry, willing but more and more resentful every year of the soulmate he’d been shackled to…\nDraco had gotten so used to the idea that he’d die from this that now it’s more frightening to consider that he might have to live with it.\n“I don’t want him to be with me out pity,” Draco says, thinking back to the face Harry made while begging him not to die. Ron sits up straight, recognizing the change in tone. “And I don’t want him to know.” He looks down at his string, almost entirely grey now. “We’ve got a good thing going,” he adds quietly. “I want to tell him, I swear I do – I just don’t know how to do it.”\nRon nods. “You don’t have long, mate. If you’re going to tell him – and I think you should – you need to do it soon.” He reached over, patting the top of Draco’s foot. “Please, Draco,” he adds softly. “Harry would be crushed if you died, but it wouldn’t be a walk in the park for me or Herm, either.”\nThere’s a very long silence, and then Draco says, oddly gentle, “You changed my life, you know.” He laughs like it surprises him. “I hated you in school, you know, you and Hermione and Harry all. I thought you were arrogant and disrespectful and no matter how obsessed Harry and I were with each other, just the sound of your names would make me angry. Harry and I becoming friends I understand – maybe it was inevitable, with the bond and all – but you and I… I never could have predicted our friendship.”\nRon pressed his lips together tightly, but then he snorts. His shoulders relax. “Me fuckin’ either, mate,” he agrees, grinning. “It was kind of my fault though, wasn’t it? You always looked so miserable and you never left your cubicle… it depressed me. I played it off like I was being the better person, but to be honest, I just felt bad for you.”\nOnce upon a time, that wouldn’t have sat well with him, but Draco’s known for a long time that Ron’s friendship had been borne out of pity. He’s made his peace with it. “Yes, well, I only agreed because I was too tired to fight you,” he retorts, and Ron shrugs. He knew, as well. “Either way… I don’t regret it,” he admits, yawning again. “I should probably thank you from dragging me out from my cubicle that first day. You brought me and Harry together, and allowed me to die with friends by my side. I always thought I’d do it alone.” Ron’s little grin turns sad, recognizing his words as the beginning of a goodbye.\nThere’s a long silence. When he speaks, it’s nothing that Draco expects. “Are you in love with him?”\nDraco debates whether or not he wants to be honest, but Ron is asking because he already knows, and Draco is more than aware of that. “He’s my soulmate.” It hurts to say.\n“You don’t have to be in love with your soulmate. Sometimes it’s platonic.”\nDraco sighs heavily. His head lolls to the side along the back of the sofa. He wishes he were in bed; he’s so tired. “He’s Harry Potter.” His expression must give away the graveness of the statement, so Ron just nods like he understands.\n“And you’re you,” he says, and it’s final.\nHarry is Harry, and Draco is Draco. They’ve always been tied together, and Draco has probably wanted Harry before he knew he’d been supposed to have him, though he can’t pinpoint the when or why.\n“I’m going to go,” Ron tells him gently, and Draco nods. Ron helps him upstairs and back to bed, leading him up the stairs and past Walburga’s portrait. He even tucks him in.\n“Don’t tell him. I’ll do it,” Draco whispers, but his eyes are already closing. He feels Ron squeeze his arm gently, but doesn’t hear a response.\nHe drifts.\n***\nA week passes. Draco knows he’s running out of time, but he can’t make his mouth say what it needs to. When Hermione and Ron come over for dinner, Ron just looks at him, but Draco doesn’t know what to tell him. He hasn’t found the words.\nHarry reads to him. He can’t stay awake very long anymore when he does, but Draco still likes to listen. He stops eating and he’s generally so cold he doesn’t get out of bed. The second he leaves his magically warmed blankets, he shivers and has to hug himself for warmth he just doesn’t have. He can’t leave Grimmauld, because the wards will probably stop his weak heart when he goes through them, and he has to ask Kreacher not to apparate into his room, as the residual magic makes his chest constrict too much.\nHe’s dying. He’d never really known what dying felt like – he thought he did, but he didn’t. This is like nothing else. This final stretch is tearing him apart.\nHarry takes off from work, and starts spending almost all of his time at home, entertaining Draco or just taking care of him. He makes soup almost aggressively, because it’s the only thing that Draco can keep down. He brushes Draco’s hair – though Draco hasn’t been vain enough to care in a long time – and opens his window to let the sunshine and fresh air in. When he’s not actively grieving Draco, he acts as though nothing is wrong. For several days, Draco lives with a Harry Potter who not only seems to love him, but would do anything for him. It’s not organic, but he can see the pieces shine through that are just naturally Harry – the kindness, the tendency to take care of people better than he does himself, the ability to smile even when everything else is going wrong.\nDraco loves him.\nThis is why, five days after Healer Clearwater’s visit, he turns to Harry, who’s lying next to him in bed and reading a horror novel aloud, and says, “I have something to tell you.”\nHarry pauses, then lays the book on his lap. “You gonna give up all your secrets? I’d rather you didn’t; it’ll be morbid and depressing.”\nDraco’s lips quirk up into a tired smile (everything he does is tired. He misses having enough energy to leave his room). “I don’t have any secrets from you anymore. Well, except for the one.” He’s not trying to be cryptic – it’s really just an offhand comment, but Harry’s eyebrows go up. He coughs a little, nervously, but he forces himself to speak. “I don’t know how to tell you, but I need to.”\nSomething serious and grave settles over Harry’s face. “You don’t have to tell me anything. If you’re trying to… I don’t know, give us closure or something, I don’t want to hear it. I don’t want you to talk like you’re about to die.”\n“I am about to die,” he says, exasperated. “You can’t pretend I’m not, and fuck you very much, I need to say this for me as much as you need to hear it. It’s important. It could change everything.”\nHarry visibly grows more upset. “I don’t want everything to change, though – I don’t want your confession, especially if it's something bad. Whatever it is, you don’t need to make things stressed now; I’ll be happier not knowing. I want us to be happy right until…” He trailed off, swallowing.\n“It’s important, Potter,” Draco huffs, struggling to sit. He coughs again – this time from the pressure in his chest and lingering pneumonia – and Harry softens, moving to push him back onto his pillow.\n“Merlin, Draco, stop,” he sighs. “Fine. If it’s that important, tell me. I just don’t want you to feel the need to tell me things just because you think it’s the thing to do.”\n“It is the thing to do,” Draco disagrees. “And this is something…” He swallows. He can’t explain it, or explain himself.\nThere’s a very long moment where Harry just looks to him, concerned and ever so slightly curious. Then, he just says it.\n“It’s you.”\nHarry’s eyebrows furrow in confusion. “What is?”\nDraco doesn’t answer him properly, but he feels his own expression weaken into something vulnerable and afraid. “I’m sorry I didn’t tell you. When it first happened, you seemed so angry, so offended I even spoke to you, that I figured… I figured it was better for us both if I didn’t say anything. I thought it would be a bother for you, that you’d feel obligated to – I just didn’t want to make a bigger problem than there already was, and I felt… crushed. I didn’t want to reveal that pain to you.”\nRealization – and horror – is dawning on Harry’s face. “A bigger problem? Are you saying what I think you’re saying?”\nHe presses his lips together tightly, bottom lip wobbling, but after a minute he nods, his hair mused against his pillow. “I’m sorry,” he whispers. “Once we became friends, I didn’t know how to tell you, and I didn’t want you to feel obligated to me. I just wanted to be friends, to know what it was like to be around you. I wasn’t trying to take advantage.”\nThere’s a storm brewing in Harry’s eyes. “You weren’t trying to take advantage. You just became my friend, to torture me by letting me watch you die – you just wanted to… fuck, Draco.” He hangs his head, pressing his palms against his eyes. “I cannot believe you, you – you berk.” He drops his hand, looking over with suspiciously glossy, wet eyes. “When you said that it’s me, you meant that I’m your soulmate, didn’t you?”\nHe nods, and Harry makes a low, angry sound. Draco squeezes his eyes shut, immediate regret hitting him, but then Harry brackets his face in both hands and turns his head so that when Draco opens his eyes, he’s looking right up at Harry’s devastated expression.\n“I’m the one who rejected you,” he says, and it’s not a question. “Fuck, that day when we ran into each other outside of Fortescue’s… that’s when it happened, wasn’t it? When the bond broke?”\nHe swallows and nods. Harry’s hands move with him, not leaving his pale, wan cheeks. “It didn’t get a chance to form on your end,” he says in a voice so low it’s hardly audible. “I felt this sick feeling in my chest and stomach, like a spell had hit me down to my magic core, but I didn’t realize what happened until I looked down and saw the string.” He glances down at it now, holding the hand up to follow where it goes, ash grey, from his pinky to Harry’s.\n“It’s been two years,” Harry mutters, half to himself. He looks as crushed as Draco feels. “And you wanted to suffer in silence instead of tell me.” He meets Draco’s gaze. “I thought… you had to know I’d take it back, didn’t you? I wouldn’t have let you get like this. I never would.”\n“But I wanted you to want me,” Draco explains, and it comes out a low, pained whine. “Ron’s told you, hasn’t he? Soulmates are like fairytales to wizards, Harry – I didn’t want to have a soulmate who put up with me because he had to. I wanted to be loved, and after a while, I just loved you so much I couldn’t…” He shuts his eyes again to slow the tears, but they slip out anyway, sliding hotly down his cheeks. “I’m not good at vulnerability.”\nHarry leans down, pressing their foreheads together. “Merlin, Draco. I can’t believe you. I…” He makes a soft sound himself. “I’m so sick of crying over you, Jesus – I take it back, Draco, okay? I take it back. I want you and I’ve wanted you for months and I never said anything because I knew you had a soulmate you loved.” Draco sobs aloud, and Harry shudders, too. “I’ll fix this,” he chokes. “We’ve been so good together, haven’t we? We can do it for real now that you’ve finally told me; I can fix us and the bond and –“\nThere’s a sharp, hot feeling in his chest. It’s not exactly pleasant, but he feels complete for the first time in years.\n“Fuck,” Harry whispers, and when Draco looks up at him his eyes are tightly shut. He doesn’t seem to care about the tears streaming down his face. For several minutes, neither of them say anything, but Draco reaches a hand up to wrap around Harry’s neck and pull him closer.\nHe sees a flash of red on his hand and trembles, pulling his other hand up to clutch at Harry. “I’m sorry,” he whispers back. “I’m sorry I hid it and never gave you a chance.”\n“I’m sorry I let my anger get the best of me back when you tried to fix things between us.” He tosses his book to the foot of the bed and shifts so that his entire body is pressed against Draco’s like it had been the night of Healer Clearwater’s visit. “I… I’m so sorry that I did this to you.”\nDraco takes a deep breath. “To be fair… with our history, you had every right not to want anything to do with me. You kept me out of Azkaban; you didn’t owe me anything, your friendship or otherwise.”\nThe response is a strong surge of feeling from their soulbond, and Draco gasps aloud at the strength of Harry’s regret, affection, and a complicated emotion closest to relief. “I can feel your emotions,” Harry murmurs. He pulls away, and Draco brushes a lock of messy brown hair out of his face. Harry’s face is so terribly open; Draco can see every emotion he feels just as easily as he feels it through their bond. “Do you really love me?” Harry asks, hesitant. “There was always something about you, but I didn’t ever think we could get along like this. Do you think we can make this work?”\n“I don’t know,” Draco replies, halting. “I used to think that we’d never be able to put our differences aside, but once the bond was in place… even broken, I could feel it, all the ways we would work together and the ways I could love you if I had half a chance.”\n“You got it,” Harry told him, and Draco nods. “I could love you, too. So easily. I just need you to hang on a bit longer.” He gives a slightly disbelieving laugh, like he can’t believe he’s saying what he is. “I’ll be mad about you lying to me later, once you’re better. The bond is complete now – will you get better?”\nDraco swallows. “This far along… I don’t know. I hope so.” But he’s still tired – his body still aches – and he’s not sure if his magic can even come back now that it’s been so thoroughly exhausted.\nHe wonders what a recovery would look like for him, and if he’ll ever find out.\n“When you get better,” Harry says slowly, firmly, like he can will it into existence by saying it. “When you get better, I’ll be mad, but I’m going to love you, Draco. I’ll make it up to you for letting this happen, and then you’ll make it up to me for lying. We’ll be okay.”\nDraco, surprising himself, finds it in him to smirk. “Quid pro quo. Spoken like a Slytherin.”\nHarry’s startled little laugh is the best thing he’s heard all week, and it gives him hope.\n***\nHe doesn’t get better overnight. Harry hopes that he will, the absurd man, but Draco is just pleased that he wakes up the next day. And the next, and the next after that – long enough that the week after their bond is properly sealed, they call in Healer Clearwater only for her to burst into tears at the sight of him. She's not usually overly emotional, but Draco fancies that Healing probably takes a lot out of a person; life-or-death experiences are intense, and they've become something like friends as well. He'd probably cry from relief, too, if it were the other way around.\nPenelope comes to give him a hug, and she looks between them with knowing, reddened eyes. “You two fixed things?”\nHarry nods. “I didn’t know, I swear – when he told me, I took it back right away. I hadn’t even meant to truly reject him in the first place; I had no idea.”\nPenelope waves him off. “No one knows they’re rejecting their soulmate. So long as you two have sorted things out, that’s all that matters.” She turns to grin down at Draco, proud and relieved. “I want you to know that I haven’t lost a patient in my direct care yet, and I was terrified you’d be the first.” She squeezes his shoulder. “I’m glad you’re not.”  \nHe grins at her, still weak, but sitting upright in bed and feeling the best he has in months. “You think I’ll live, then?”\nShe nods. “If you’ve allowed the bond to finish forming properly, so long as you take care of yourself the symptoms of bond death are totally reversible. You’ll be fine.” His smile freezes a little when he hears the word totally.\n“Even my magic?” he asks, and Harry’s eyes widen. They’d both thought and have been preparing for the eventuality that Draco’s magic will never return. Draco’s been struggling with the idea, but Penelope nods, looking unconcerned.\n“Yes, of course. Your magic is still present – your body and soul have just been too weak to sustain use of it. Your core shut down, but you’re a magical being; there’s no real damage, just dormancy.” Draco’s not ashamed to say that he almost cries again, and Penelope smiles gently. “You’re going to be fine, Draco, and more importantly, you have a long life to live with your soulmate. You’re lucky.\"\n“Thank you, Healer Clearwater,” Harry says, and he beams at her. “For everything.”\nShe rolls her eyes.” I knew you when you were a snot-nosed kid; you can call me by my name. But you’re welcome.” She gives Draco’s shoulder another squeeze, and pulls away. “At this point, you should be fine. Stay in bed and don’t return to work until you can stay upright for more than an hour without fatigue, but other than that you shouldn’t need to check in with me unless you’d like to. It’s an easy downhill journey now, Draco.”\nThey say their goodbyes. Harry sees her out shortly thereafter, but when he comes back, he presses a hard, fast kiss to Draco’s mouth. “You’re stuck with me, asshole,” Harry tells him, still grinning so wide his face must ache. The feeling that’s blooming from the bond is bright like the sun. “You and me, we’re going to make it.”\n***\nFour months later, Draco and Harry debut in the Prophet. It isn’t their idea, but Draco has to admit that the photo Dennis Creevy gets of them isn’t a bad one – he’s wearing smart grey trousers and a navy sweater, fashionably muggle, and there’s a healthy flush to his cheeks. Next to him, Harry squeezes his hand on repeat, looking the happiest he’s ever appeared in the papers.\nThe article is suitably sensationalist, but the tone is friendly and the end result is that some people begin (very slowly) to warm up to him. With Harry at his side, he’s offered an opportunity to take his NEWTS – an opportunity previously denied to him. He gets Os in Potions, Runes, and Charms, and Es in the rest, which is more than enough to get him a tentative apprenticeship offer as well. He gets permission from the Ministry to leave his job in the mailroom – with the flimsy excuse that he’s showing evidence of rehabilitation.\nHe doesn’t argue; he just takes the offer, and happily tells Quinley to go fuck himself like he’s wanted to since he was forced to work under him. The depression had messed him up something fierce and made it seem like there was no point in even responding to the insults or cruel statements, but since their bond healed, he's found himself bouncing back emotionally. He's sarcastic and irritable sometimes, but he's also largely playful and curious, and he feels more like himself than he has in ages.\nBlaise floo-calls him and tells him that he’s glad Draco’s feeling better. He never wanted to press, but apparently he’s been worried for months that Draco wasn’t well. It doesn’t make up for his absence – it doesn’t necessarily mean he cares about Draco in any way that matters – but it makes him feel better, and he thanks Blaise and says he’s doing fine. He feels better after the conversation regardless.\nHis life doesn’t miraculously become perfect, and he still gets spat on in public. There are days that Harry annoys the hell out of him, and days when he pisses Harry off – but their bond helps, and life wasn’t perfect before the bond or even before the war. What he has instead is growth and a sense of contentment that changes a lot.\nHe heals, and when he goes to sleep at night, he follows the red string around his pinky to the man he loves, waiting for Draco to join him in bed.\nIt’s enough.\n "
}