{
    "id": "16193540",
    "url": "https://archiveofourown.org/works/16193540?view_full_work=true",
    "author": [
        "denyingmyselfalways"
    ],
    "title": "Parker DNA",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Spider-Man: Homecoming (2017)",
        "Marvel Cinematic Universe",
        "The Avengers (Marvel Movies)"
    ],
    "relationships": [
        "Peter Parker & Avengers Team"
    ],
    "characters": [
        "Peter Parker",
        "Tony Stark",
        "Natasha Romanov (Marvel)",
        "Sam Wilson",
        "James \"Bucky\" Barnes",
        "Steve Rogers",
        "Clint Barton",
        "Scott Lang",
        "Avengers Team"
    ],
    "additional_tags": [
        "Fluff",
        "Precious Peter Parker",
        "Spidey-DNA",
        "Domestic Fluff",
        "Avengers functioning as a family",
        "Natasha is Peter's spider mom",
        "Scott is freaked out",
        "Everyone loves Peter",
        "Peter is literally everyone's child",
        "The Avengers all love each other",
        "Tony Stark-friendly",
        "Steve Rogers-friendly",
        "We're All Friends Here",
        "no ships in this one"
    ],
    "language": "English",
    "series": "Part 12 of How Tony Stark accidentally became a dad",
    "published": "2018-10-04",
    "completed": "2019-01-03",
    "words": "15,824",
    "chapters": "5/5",
    "comments": "221",
    "kudos": "9,278",
    "bookmarks": "1,229",
    "hits": "111,086",
    "summary": "<p>It took a bit for Peter to get used to the fact that the Avengers officially knew he was Spider-Man. He had to teach himself that it was okay to lift heavy things and web objects into his hands when they were around. However, it took even longer for the Avengers to get used to the fact that he could do these things.</p>\n<p>or</p>\n<p>Peter being Peter and weirding everyone out.</p>",
    "notes": "<p>I'M STILL ALIVE! Sorry for waiting so long to post, I was only motivated to write in the middle of my classes, which didn't give me much time. For those in the comments of my last one, yes I am planning on letting Bucky and Peter snuggle, you'll just have to wait, cause I'm working on like four things right now.</p>\n<p>Anyway, sorry if that summary's super general, but this fic covers a lot of different things. You'll just have to read it to find out.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>For those following this series and not me as a user, I accidentally forgot to publish this one to the series and so if you didn't get a notification for the first chapter, that's on me, sorry.</p>\n<p>This one is more Tony-centric because I absolutely love their dynamic, just so you know. And for those of you who asked for a Bucky and Peter snuggling scene, here it is! It's not the longest or most descriptive, but I figured you guys deserved at least a little bit after all the support you've given me! THANK YOU SO MUCH!!!</p>\n<p>(Sorry in advance if the sensory-web is confusing, I tried to make it as clear as possible)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>I'm planning on adding a third chapter with some extra fluff, but I haven't planned all the weird spider stuff that Peter's going to indulge in, so recommendations for weird things for Peter to do are wanted! Please comment any weird spider/spider-man/just strange in general qualities that you might want to see next chapter and thanks again for all of you who read my stuff!</p>\n<p>sooooo, you guys gave me SO many ideas to work with so there will definitely be more chapters after this! This one is focusing mainly on Peter's inability to thermoregulate because I got a LOT of requests for that one, with an extra portion on his super strength. (also mother-hen Steve, which who doesn't love that?) THANK YOU SO MUCH FOR ALL THE SUGGESTIONS AND FOR YOUR SUPPORT IT MEANS SO MUCH!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>I might be doing two or three more chapters of this depending on what I want to explore and all that, just so you know. Suggestions are always appreciated, but just know that I may not use them all. </p>\n<p>There is a possibility that I'm PLANNING on Thor, Loki, and Brunnhilde joining the Avengers later on in this fic but that could change.<br>Also, you know how I said this is probably the last fic in this series, that may turn out to be a lie, but idk yet.</p>\n<p>So Peter's officially in college at this point in my fic. I know I didn't do a graduation one, but I was just too lazy to, sorry guys. Maybe someday I'll go back and insert one in there, but that's why it's okay for him to skip a couple classes. I don't know how many more chapters I'm gonna do because of how many ideas I got from you guys, but there will be at least one or two more.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>Do not worry, loki and thor are eventually coming.</p>\n<p>Also, someone asked me for a Skip Wescott fic, which I may actually write, but I will not be writing it in this series as it's a little late for it in this storyline and wouldn't make as much sense. If I do write it I will make a comment about it in the notes of whatever chapter I post next so that people who are only subscribed to this series can still know about it.</p>\n<p>I just recently got a tumblr and it's a mix of fandoms/fanfiction stuff/some poetry, so go follow me if you'd like: https://denyingmyselfalways.tumblr.com/</p>\n<p>sorry it took so long for me to update, i've been working on some other things and haven't been able to really come up with any good writing material for this, but here's what I have for you, try to enjoy!</p>\n<p>also, as of today it's my birthday! not sure how that's relevant, but i thought i'd let you guys know! thanks for being there for me, it means a lot!!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>thank you all so much for your help with this fic, even those whose idea's i didn't use. it's not that your ideas weren't good, it's that i either didn't have enough space in the timeline of this fic, or i wouldn't have been able to incorporate them well enough into the story with my current writing abilities and the story still flow. </p>\n<p>i do have a few more ideas for the last couple fics ( i know i said this was the last fic before, but i lied ) but they may not come in a while, so bear with me, thanks!</p>\n<p>for those wishing for a longer chapter, i'm sorry that i couldn't comply, my brain has literally been a trash can for the last couple of weeks, but i hope you still like it, even though its no longer than the other ones :D</p>\n<p>I may post a second chapter, but this should be the last(ish) fic in the series, so please tell me if you want another chapter in the comments. I just wanted to end it on a happy note after the angstiness of some of the others, so idk. TELL ME ALL YOUR THOUGHTS! I seriously love you guys.</p>",
    "text": "It took a bit for Peter to get used to the fact that the Avengers officially knew he was Spider-Man. He had to teach himself that it was okay to lift heavy things and web objects into his hands when they were around. However, it took even longer for the Avengers to get used to the fact that he could do these things.\nAfter Spring break had ended, Peter had gone back to live with his aunt and things were back to semi-normal. Tony had to get used to the fact that he couldn’t be around him all the time. The team had to get re-used to the fact that Rhodey had to go back to DC. Steve had to get used to the fact that Bucky and Tony talked? Like they would mutter under their breath to each other and share super morbid jokes and smirk behind people’s back. That was a thing now, apparently.\nThey’d become accustomed to Peter’s absence, but it was an unspoken truth that they were all on edge now that Peter was gone. He was their sunshine which sounds incredibly cheesy, but that kid had the ability to make every one of them smile.\nFinally, the weekend rolled around and Peter drove over to the compound, and the Avengers tried to be subtle, but their excuses to talk to him were flimsy. Thank goodness that Peter was oblivious.\nThe shenanigans did not begin, however, until the next morning, when Peter was playing Mario Kart with Sam and Bucky. Bucky, for whatever reason, was amazing at this particular video game, which baffled Sam to no end.\n“How?!” Sam threw the controller in the air and it clattered back to the ground. “How are you so good at this? You were under when it was invented!”\nBucky just shrugged, smirking. “Maybe you just suck.”\n“I don’t- ngggg.” Sam growled. “I demand a rematch.”\nPeter chuckled and shook his head. “You’re never going to beat him, cardinal.”\nSam rolled his eyes. “Hardy-har-har. You’re hilarious.” He bent down to pick up his controller, frowning when he came back up with the piece holding the battery unattached and one of the batteries missing. “Crap.”\nPeter pinched his nose, and Bucky barked a laugh. “This is why you don’t throw temper tantrums, stupid.”\nSam ignored them both, searching around on the floor, only stopping when he peered under the couch. “Well, I found it. Sorry, guys, I’ll have to move the couch.\nBucky sighed, standing. “I’m not helping you move it.”\nSam groaned as Peter got up as well. “But Stark’s couches are like boulders and I don’t have super strength.”\n“Don’t worry, I got it,” Peter said, lifting the couch with one hand and kneeling to grab the battery from underneath. He set it down with barely a thump.\nSam’s jaw practically hit the floor.\nPeter blinked at him. “What?”\nSam gestured at the couch. “You just… you…”\nBucky laughed. “That’s impressive, for a kid.”\n“For a kid?! That’s impressive for a grown man! That’d be impressive for you. What the heck man. What the heck.” Sam sat down on the couch and put his head in his hands. “This might take some getting used to.”\nPeter laughed nervously. “Sorry?”\n“Why are you sorry? That’s freaking awesome, dude. I wish I could do stuff like that.”\nPeter’s face contorted in confusion. “But… you’re the Falcon. You can fly.”\nBucky raised an eyebrow. “Yeah, Sam. You’re the Falcon.”\nSam stuck his tongue out at Bucky before turning to Peter. “What else can you do?”\nPeter looked at him quizzically. “I already told you guys, remember?”\nSam threw up his hands. “Yeah, but I obviously didn’t understand all the implications of what all that meant!”\nPeter shrugged, his smirk scarily resembling Bucky’s. “Guess you’ll have to find out.”\n \nPeter, as an enhanced individual, ate a lot of food, which, in turn, caused him to have to visit the kitchen a lot. Having to take snack breaks every hour got a bit boring after a while, so instead of walking like a normal human being, he’d just jump onto the ceiling and crawl out to the kitchen. The first time someone caught him doing this, it was just Natasha, who tossed him a box of Cheez-its and a little smirk. The second time he was caught, however, was a few hours later.\n“This place is so cool. Do you think we’ll meet any of the Avengers? I think War Machine is my favorite.”\nPeter froze on the ceiling, panicking. Who the heck was that? Last he checked, he was the only non-adult allowed in the compound, and the voice that he’d just heard around the corner was definitely not an adult. It was a little girl. He listened a little closer. Three heartbeats. Who could it possibly be?\n“I’m hurt. I thought I was your favorite Avenger.”\nPeter cocked his head. That was definitely Scott. What was Scott doing here?\n“Daaad, you can’t be my favorite- oh my gosh, look!” Peter looked down just as Scott and the two others rounded the corner. “That guy is on the ceiling!”\nScott screamed.\nPeter fell off the ceiling, laughing. He grunted as he hit the ground, but it didn’t affect him much. He scrambled to his feet. “What the hell, Scott?”\n“What the hell to me? What the hell to you!” Scott exclaimed, waving at him with both arms. “Why are you-? How can you… right. You’ve got those Spider-abilities. I forgot.”\nPeter rolled his eyes.\n“Are you Spider-Man? That’s so cool! You’re one of my favorites! I like your spiderwebs!” the little girl standing next to Scott exclaimed. “Are you an alien?”\nPeter chuckled. “No, I’m human. I think. But who might you be?” he asked, crouching a bit to get on her level.\nThe girl crossed her arms. “I’m Cassidy. That’s my dad,” she said, pointing at Scott.\nPeter nodded slowly before looking up to the woman. “And who are you?”\nShe held out her hand. “I’m Hope Van Dyne.”\nPeter’s eyebrow’s shot up, as he straightened and accepted the handshake. “Oh! Scott’s mentioned you! I love your work as the Wasp and research on the quantum realm. I was wondering when I got to meet you!”\nShe smiled, a little amused at him. “So, you’re this Spider-kid that Stark had us look for a couple weeks ago. The hanging on ceilings thing is pretty cool.”\n“Yeah, I’m just getting used to actually doing Spider-Man stuff in front of the Avengers. And apparently,” he said, pointedly igoring her mention of the search for him and shooting a look at Scott, “they’re still getting used to it too.”\nScott threw his arms up in the air. “Seriously, man? A month ago, you were just some weird genius fanboy that I was highly certain was the son of Tony Stark and now you’re… crawling on the ceiling!”\nPeter snorted. “Well, you better get used to it, because walking is boring.”\nCassidy laughed. “That’s so cool. I wish I could be a superhero.”\nPeter gave a half-shrugged, fighting to keep his face neutral against the wave of memories that hit him. “It’s got its ups and downs.”\nScott threw an arm around her and planted a kiss on her head. “You’re my superhero, peanut.”\nHope and Peter shared a look. Scott was a huge softy when it came to his daughter.\n“Well, sorry for freaking you guys out, but if you don’t mind, I’m going to the kitchen to grab a snack.” Peter backed up a bit, so he could safely jump back on the ceiling.\n“At two-o’clock? Why are you having a snack now?” Hope asked.\nPeter laughed. “Spider-metabolism. Got to eat a lot to keep it up. See you all later.” He leaped up back on the ceiling.\nScott jumped.\nAs he was crawling toward the kitchen, he heard Scott mutter, “That kid is weird.”\n“No, he’s awesome!” said Cassidy. “Let’s go meet another superhero!”\n \nNow that the rest of the Avengers knew that Peter was Spider-Man, Natasha thought that it would be a good idea to train him. Tony resisted at first, not wanting his kid to get hurt, but Peter’s excitement at the prospect and the rest of the team’s agreement with Natasha caused him to cave. And that’s how Peter found himself crouching into his fight position against the Black Widow with Iron Man watching.\nShe cocked her head, glancing at his bouncing feet. “You need to keep yourself steadier. You can only get away with a stance like that if you’re incredibly quick on your feet.”\nPeter quirked an eyebrow. “What if I am?”\nNatasha smirked. “Maybe you are against most, but I’m an Avenger. You’ll have to be pretty damn fast to get away from me.”\nPeter shrugged. “It’s not like I’ll be surprised if you end up pinning me to the floor. You’re the Black Widow.”\nNat shook her head. “Enough chit-chat,” she said, swinging. He dodged, adrenaline pumping through him like a drug. He lived for this.\nThe exchanged blows back and forth, both getting used to each other’s fighting styles. As soon as she was comfortable, she went on the offensive, driving Peter back on the mats. While, at first, he’d been thinking through each move he made, now he was acting purely on instinct, relying on his senses. He could see where she was tensing, and his brain would calculate which move she was about to make. He heard her breathing and could hear her tiring a bit. He could smell the sweat in the air and Tony’s stress from the corner where he stood, watching. His Spider-sense was going off every other second, warning him, causing him to react.\nThe hair on his neck stood up and he leaped up just as she swept her feet under him, but as he relished in his victory in dodging Natasha’s kick, she reached up with lightning speed and grabbed his ankle, dragging him back down into the mats and in one fluid motion straddled his hips and pressed her elbow gently into his throat.\nAs soon as the room had stopped spinning, he gave her a shaky grin. “Hey.”\nNat smirked a little and stood, offering him a hand. “Come on little Spider. Again.”\nThey went again like that, and she beat him every time, but he was improving. He was staying in longer and fighting harder and not just acting purely on instinct. They were both beginning to tire, and it was showing a bit in Peter, but Natasha kept pushing herself, not complaining once, so neither did Peter. It wasn’t until she managed to pin him in five seconds that he gave a huff of disappointment.\nShe helped him up, but this time walked him over to where Tony was waiting. “The stamina from the spider bite is extremely helpful, but when that runs out, you need to be able to get up and keep going. Get quicker, get stronger, get more endurance.”\nPeter nodded slowly, too tired to be disappointed in her critiques.\nHe looked up her to thank her for the training but stopped when he saw her smiling. “What?”\n“You’re very good, for someone who’s practically trained themselves. I want you to work out every day and come back next week. I’m sure if you asked, Steve and Sam would pick you up to work out with them. They’d like that.” She reached up and ruffled his sweaty hair before sauntering out, hips swaying.\nWhen he turned to Tony, his mentor was practically gaping at him.\n“What?”\n“You must be a lot better than I thought.”\nPeter wasn’t sure whether that was a compliment or an insult. “Um, why?”\n“Because Natasha gives out compliments about as much as I give out hugs.”\nPeter’s eyes widened. “Wow. You’re right. I must be fantastic.”\nTony rolled his eyes. “Come on, Spider-ling. You need to hit the showers.”\n \n“Boss, the elevator is down.”\nTony frowned, looking up from his Stark tablet. “What about the other one? Are they both down?”\n“No, just the eastern one.”\n“Can you get it back up?”\n“Yes. However, that is not why I informed you. Mr. Parker and Mr. Rogers are stuck in the elevator, and the former appears to be having a panic attack. Mr. Rogers is trying to calm him down.”\nTony practically launched himself from his chair, running over to the elevator entrance. “Which floor are they on?”\n“Conveniently, the ground floor.”\n“Can you open it manually?”\n“I am unable to do that at the moment.”\n“Is there anyone down there that you can notify to force the doors open?”\n “Sir, those doors are titanium plated. Steve does seem to be trying to force them open, but he hasn’t been successful.”\n“Isn’t there an emergency open?”\n“That has been disabled as well.”\n“Security footage? I’d rather see it than have a play-by-play.”\n“It will take a few minutes, but I do have the audio if you would like me to play that for you.”\nTony mentally braced himself, knowing it was going to be bad. “Play it for me, Fri.”\n“-please help me, please I’m stuck I can’t-!”\n“Hold on, Peter, I’m trying to open the doors.  I need you to calm down for me, please. Come on, Peter,” Steve said, his usual façade of stoicness slipping with Peter’s strangled cries.\n\n“I can’t do it on my own. I can’t.”\n\nTony growled as he sprinted towards the elevator at the end of the hall. He tapped his arc reactor twice, activating the nanotech. “Steve! Rogers, can you hear me?!”\nSteve didn’t respond over the audio, but Peter went oddly silent.\n“Tony?” his voice asked over the speakers and relief shot through him like morphine.\n“Fri, open up the audio in the elevator so I can talk to them,” he said, preparing himself to pry the door open.\n“Yes, boss.”\nThere was a grunt and a short screech and Tony froze, staring with wide eyes as the elevator doors slowly eased open, Peter’s strained form appearing on the other side. He saw Steve rush to help him open the doors, and Tony managed to unstick himself from the floor in order to do the same. As soon as the doors were wide enough, Peter launched himself through, clutching at Tony, who stumbled with the unexpected extra weight of a baby spider, wrapping his metal arms protectively around him.\n“Pete?” Tony asked stiffly, throwing a questioning look at a just as lost Steve. The super soldier shrugged. “How did you even…?”\nAt the sniffle of the boy clutching him, Tony abandoned that line of questions to double tap the arc reactor at his chest so that Peter would have an easier time of anchoring himself. “You’re alright. You’re okay, kid. You’re here now.”\nPeter’s shaking slowed to a stop, and his hold on Tony released a bit. Tony pushed him out to arm’s length, swiping at a stray tear under Peter’s eye with the pad of his thumb. “You good, kid?”\nPeter gave a half-shrug and a wet smile. “Sorry. I don’t… I don’t like small spaces.”\nTony huffed and shook his head. “It’s not your fault. Come here.” He pulled Peter back into his embrace, glad that Peter ignored his thundering heartbeat.\nSteve cocked his head at the two questioningly. “How in the world did you manage to open those doors?”\nPeter pulled back a little, to Tony’s disappointment (though he’d never admit it) and shrugged. “I don’t know. The adrenaline I guess.”\nSteve frowned, considering, and opened his mouth to continue, but snapped it shut due to a sharp shake of Tony’s head. Not now, he mouthed.\n“You good, kid?” Tony asked, frowning down at a stoic Peter.\nPeter nodded, his small smile beginning to return. “I am now, thanks. Sorry for freaking out.”\nTony chuckled. “If I had a dollar for every time I freaked out, I’d be a billionaire.”\nPeter frowned. “But you are a billionaire.”\nTony huffed, reaching up to ruffle Peter’s curls. “Not the point, kid. Not the point.” Raising his chin a bit in order to speak to his AI, he said, “Fri, can you do a maintenance checkup on this elevator. Make sure this doesn’t happen again.”\nPeter ducked his head as FRIDAY gave an affirmative reply, beginning to pull away, but Tony grasped his shoulder to stop him before turning to Steve. “You needed him for anything?” he asked, grinning when Steve shook his head.\nPeter’s eyes lit up, erasing the memory of the panic attack in the elevator. “We gonna work on the Iron Man suits?”\nTony shook his head. “Nope,” he said, popping the ‘p’. “We’re gonna work on a car.”\nPeter wrinkled his nose as Tony threw an arm around him and led him towards the direction of the garage. “Why? You have, like, twenty.”\nTony rolled his eyes. “It’s character building. Besides, what would a car owned by Tony Stark be if it didn’t have extra and very unnecessary additions?”\nSteve shook his head at the two of them as they walked away, marveling at how quickly Tony seemed able to calm him down after a full-blown panic attack. His own attempts had been vastly unsuccessful, but those two. Those two were practically made for each other, as they bantered and grinned and cared for one another.\nHe sighed, making his way towards the kitchen. He’d known from the beginning that Tony had a heart. He’d helped break it after all. Granted they were healing, but… the protectiveness that oozed from Tony whenever he was around Peter was something he never would have thought he’d see from the billionaire. If you had told him a few years ago that Tony would be calming down a mutant teenager from a panic attack because of an elevator by inviting him to go work on a car, Steve probably would have looked at you weird. But now, he’s not even surprised.\nPepper, Rhodey, and Happy were a huge part of Tony’s family before Peter ever showed up, but he didn’t have to be soft around them. He could be all sharp edges and panic-induced phone calls and drinking alcohol around them and they would still function. But something was different about Peter that changed him. He was soft and calm, and Steve hadn’t seen him with a single drink of alcohol ever since he’d been back from life as a fugitive.\nSteve would have never thought that Tony would willingly wear his heart on his sleeve for anyone.\nBut for Peter, Tony would alter gravity if he thought it would make the kid’s life easier.\nFor Peter, Tony would save the world.\n \n“FRIDAY, call everyone down for dinner. If they protest tell them Wanda made lasagna.”\nTony continued to help set the table with Nat and Wanda, making small talk as the rest of the team filed in, only stopping to frown when Peter didn’t show. “Where’s Peter?”\n“I’m over here,” came Peter’s voice from the entrance.\nTony turned. “Well, come on buddy. It’s time to eat.”\nPeter reached one foot into the room but pulled back immediately and sneezed. At this point, the Avengers had gone silent, staring at a very wary looking Peter.\n“Uh, kid? Come on, I’m starving,” Clint said, reaching halfway across the table to pile the lasagna on his plate.\nPeter wrinkled his nose. “You can’t feel it?”\nSteve frowned, voicing Tony’s confusion. “Feel what?”\nPeter waved his hands through the air. “Feel… it. I don’t know! It feels weird.”\nSam rolled his eyes, snatching the large spoon from Clint and scooping lasagna for himself. “That’s very specific.”\nPeter took a step forward, hunching his shoulders. “The air feels… weird. Like it stings. Or something. I don’t know.”\nTony frowned, standing and walking over to Peter was standing, looking very uncomfortable. “Nothing. It feels normal.”\nPeter walked forward warily, looking more and more tense as he got closer to the table, finally stopping two feet away. He sneezed twice, then reached up and rubbed his eyes. “I don’t like this.”\n“FRIDAY, do you know what’s up with him?” Natasha asked, frowning and leaning forward.\nThe AI was silent for a few seconds. “I cannot identify anything in the air that would hurt him.”\nThe Avengers collectively frowned at Peter.\n“Is it just in this room?” Bruce asked. “Or have you been feeling sick lately.”\nPeter shook his head, preparing for a sneeze then slumping in both disappointment and relief when it didn’t show. “No, I… I felt fine until I walked in here.”\nTony frowned. “Maybe you’ve come down with something. Do you think you can eat with us, or do you need to go stay in your room?”\nPeter shook his head vigorously. “No, no. I don’t feel sick, just weird. I can eat with you guys.”\nTony gave him a skeptical look, but Peter grinned widely at him. The effect was ruined, however, as he sneezed again.\nNat looked sympathetic, waving him over to the empty seat between her and Steve. “Come on, little spider. Perhaps the food will help.”\nHe nodded, making his way over, getting even tenser as he walked. He plopped down in his seat, visibly miserable. He only glanced up when everyone hesitated, looking at him. “Well?” he asked, trying and failing to amend his expression to something resembling normalcy.“Let’s eat!”\nThey continued dolling out the food, the banter starting up again as they began their meal, each of them shooting a few sympathetic glances to the barely-eating Peter.\nHowever, most soon forgot about Peter’s strange behavior as Bucky began telling them all embarrassing stories about Steve before he’d been iced.\nBucky was halfway explaining how he used to be terrible with the shield and would sometimes forget where he left it, only to find it later by stepping on one end and having the other end slam into his calf.\nWanda winced. “That sounds miserable.”\nSteve just rolled his eyes good-naturedly. “Yes, yes. And I’m sure all of you were amazing at using your powers or tech when you first got them,” he said stabbing at his salad with his fork and shoving it into his mouth.\nTony laughed from across the table. “You should have seen Peter when I was first mentoring him. He was terrible.”\nPeter managed to look up and roll his eyes without looking too terrible. “Honestly, that wasn’t even that bad compared to the first couple days. Those were absolutely miserable.”\nSam leaned forward, grinning. “Do tell.”\nPeter groaned. “I went to bed sick and woke up even more sick cause all my senses were on fire. My glasses didn’t work anymore, my hearing picked up on my neighbor’s heartbeat three floors down, and my muscles had been stimulated the entire night just so I could wake up with abs, so I was sore,” he buried his face in his hands, almost forgetting about the weird stinging in the air around him. “And that wasn’t even that bad compared to that weird spider-sense that I inherited. That gave me so much anxiety.”\nNat smirked. “Aw. Poor little spider. How could you ever have survived?” she asked semi-sarcastically.\nPeter looked up and rolled his eyes, opening his mouth to reply until she reached over to ruffle his hair.\nHis brain didn’t catch up to his body’s reaction until a few seconds later he was staring down at everyone from the ceiling. “What the hell is on your hands?” he asked, the hair on his arms standing straight up.\n“Would you stop using those freaky spider powers to stick to the ceiling?” Scott asked, a hand pressed over his heart, but everyone ignored him.\nThe rest of the team was blinking at him, confusion and amusement written on their faces as Nat sniffed her hands. “Peppermint. I’m prepping for Christmas.”\n“In September?” Clint asked incredulously, but everyone ignored him.\n“FRIDAY, why is Peter reacting to peppermint?” Steve asked, but Tony’s laughing cut off any answer they could have received.\n“Oh, I should have known,” he managed as soon as he’d collected himself.\nPeter began lowering himself from the floor, careful to stay away from Natasha and her mint-scented hands.\n“Should have known what?” Bruce asked, leaning forward.\nTony grinned. “Spiders don’t like peppermint.”\nSam threw his hands in the air. “Kid, when are you going to stop being a weird half-spider. I swear none of this stuff happened before we know about you being a spandex-wearing punk.”\nPeter would have responded, but he was too busy sneezing.\nNatasha chuckled, standing. “I’ll go wash this off, I guess. Maybe cinnamon? Or Pine. Pine smells good.”\nClint shook his head, looking at anyone for an answer. “Seriously, why is she prepping for Christmas? It’s September.”\nStill, everyone ignored him.\n“What the-!” Tony said, ducking as his body reacted to the sight of the clear string that he almost ran into. His eyes widened as they took in the thin shiny thread not six inches from his face. His gaze followed from where it hung seemingly floating in the air to where it turned the corner and continued down the hallway. Glancing over his shoulder, he saw that the cord was not floating, but was stuck to the wall at the other end of the hall. He sighed deeply, turning back and following the cord, that he now realized was a strange deviation of Peter’s webbing, down the rest of the hallway and around the corner, where he found another string of web crossing it where two hallways met. Continuing to follow his web, like a string of fate, he managed to find the hub of strings, where they all crisscrossed mid-air and held up an extremely concentrated Peter.\n“What are you doing?”\nPeter jerked up, his brown eyes blown open in surprise as if he hadn’t noticed Tony walking towards him. “Oh! Sorry, Mr. Stark, I would have asked, but I couldn’t find you and I’m pretty sure this stuff’s harmless. Honestly, I’m surprised it’s holding me up, but the textile strength is off the charts! Granted, it isn’t an exact replica of spider silk, but still, it’s pretty good for a slight variant. Although I don’t weigh all that much either, so that could be part of it.” Peter frowned again. “I need to put one up in the west wing hallway, I think Mr. Rogers may have broken it.”\nTony chuckled shaking his head. “How do you know that it’s Steve?”\nPeter scrunched his eyes shut. “Well, given the weight and amount broken off, I’d say its either Bucky, Steve, or Thor. Thor’s not here and Bucky’s not a klutz, so… Steve… err Mr. Rogers.”\nTony rolled his eyes at Peter’s over-politeness. “So… what is this for, exactly?”\nPeter seemed to fold into himself a bit, his face darkening as his eyes reopened. “Well, I don’t know. I just thought it could be useful if I developed it further. Maybe some sort of alarm system. If I was ever on a mission or something and I needed to watch all the doorways, but I was by myself,” he shrugged. “I don’t know,” he said again. “I thought the compound would be a pretty good place to test it out, cause my apartment isn’t the largest.”\nTony nodded, a bit impressed, turning a full circle to survey the different threads leading down various hallways. “How’d you get this all done without anyone noticing?”\n“Well, I got Ms. Pot-err Stark permission, so she knew. And I got a suggestion from Mr. Banner earlier today on the amount of nonpolar hemoglobin I should keep in the formula and all that jazz, so he knew. Natasha and Clint helped set it up, although how they got anything done with all that bickering is a mystery to me. But, yeah… everyone else is just oblivious.”\nTony barked a laugh. “Well, you’ve really outdone yourself this time,” he said, nearing the closest strand and squinting at it. “How’d you get it that thin?”\nPeter shrugged. “It stores in liquid form,” he said, pointing over to a glass sitting on the living room table. “I just had to make the straw that the liquid came out of really small.”\nTony approached the ‘refurbished’ glass that Peter had pointed at. It was a bang-up-job, mostly, but it worked, made apparent by the complex array of webbing stringing through his halls. Peter had taken a glass out of the cupboard and duct-taped over the top of it multiple times so that liquid could only possibly come out from the incredibly thin straw that Peter had poked through. The straw must have been custom-designed in his and Peter’s lab because no McDonalds would be giving out straws with that small of a circumference. Inside the glass was what looked like Peter’s web fluid in liquid form. Tony grunted. “This is… cool. Surprisingly effective for a glass and duct tape.”\nPeter shrugged, embarrassed. “Just an idea that I had. I didn’t know if it would actually accomplish anything.” His eyes suddenly widened, then immediately shut.\nTony opened his mouth to ask what was going on, but Peter shushed him. A few moments passed and then Peter’s eyes flew open and his head whipped around to the hallway to his left. He pointed, saying, “Wanda.”\nTwo seconds later, Wanda walked out, looking supremely confused.\nTony raised an eyebrow. “That’s impressive, kid. How’d you know it was her?”\nPeter grinned. “Vibrations. Her footsteps, breathing, motion, all that stuff makes the webs vibrate.”\nTony frowned. “How can you tell, though?”\nPeter shrugged. “I dunno, I just can.”\nWanda smiled, still slightly confused. “You are a strange little spider.”\nTony barked a laugh. “You can say that again.”\n \nBucky trudged out of his room, reaching up to rub his eye with his left fist and hissing when the freezing metal touched his skin. He groaned, switching hands and scrubbing his face as if that would dispel the lingering effects of sleep. He needed coffee.\nHe walked down to the kitchen, pausing only when he saw the light on in the stairwell leading down to Tony’s lab. He frowned, turning to the clock on the wall. 4:14 am. He huffed. “Stark and his self-deprecating habits,” he muttered, turning to the coffee maker. He brewed enough for two, and, not knowing how Tony preferred his coffee, just brought the bottle of creamer down with him.\nHe walked down the stairs, making enough noise so that he wouldn’t freak him out. “Tony?” he asked, rounding the corner into the lab. It was not, however, Tony who greeted him, but Peter.\nPeter had frozen, eyes widened, his hands buried in a tub of an oozing clear liquid. “Uh… hey?”\nBucky frowned. “What are you doing down here?”\nPeter scowled, hunching his shoulders. “It’s my lab too, you know.”\nBucky rolled his eyes, walking over to the table that Peter was standing at and setting down the two mugs of coffee. “Yes, but what are you doing down here at four in the morning?”\nPeter looked down at his hands and, pulling them out, walked over to the sink at the end of the table to begin washing the stuff off. “Couldn’t sleep. Figured I might as well get something done.” He still wouldn’t look Bucky in the eye.\nBucky took a sip of his coffee. “And you claim that you don’t take after Tony.”\nPeter smiled a bit at that, but Bucky’s accusatory stare had him focusing back on the tub of liquid.\n“Speaking of Tony, does he know you’re down here?”\nPeter gave a half-shrug.\nBucky nodded, gesturing for Peter to take the coffee that he’d gotten for Tony. As Peter grabbed for the bottle of creamer, Bucky took out his phone and sent Tony a text regarding Peter before turning around and blinking in surprise at Peter’s almost-white coffee. He sighed and shook his head. “So, you’re allowed to be here?”\nPeter shrugged again. “I guess so. He never really gave me a curfew.”\n“Uh-huh, and if he did know you were down here, he wouldn’t be mad?”\nPeter scoffed but didn’t answer.\n“That’s what I thought,” Bucky said, taking a sip of his coffee and making his way around to where Peter was standing. “What are you working on that’s so important?”\nPeter frowned, concentrating. “Web fluid for the sensory web that I just created. I’m trying to get it even thinner without reducing its strength. It keeps coming out too thick though.”\nBucky nodded, pretending like he knew what he was talking about. “Why don’t you take a break and come back later. It might help with the thinking process.”\nPeter raised an eyebrow at him. “I know what you’re doing, but I don’t have a better idea, so I might as well.”\nBucky smirked and turned to walk up the stairs, glancing over his shoulder to make sure Peter was following. Peter wiped his hands off with a spare towel, grabbed his coffee and jogged up to where Bucky was waiting for him. They made their way upstairs, where Bucky lead Peter over to the couch and they practically collapsed onto it. Peter sighed, setting his mug on the table.\n“I probably don’t need that. I’m not good with caffeine.”\nBucky nodded. “Yeah, that was supposed to be for your dad, but you were the one in the lab instead of him.”\nPeter nodded absentmindedly, before shooting up, “Hey! He’s not my dad!”\nBucky huffed a laugh, reaching over to the side table and scooping up the remote. “Whatever you say, kid. You wanna watch anything?”\nPeter pouted, still slightly annoyed at Bucky’s comment, but shrugged all the same. “I don’t care. Put anything on.”\nBucky turned it on, the channel that popped up playing one of the Harry Potter movies. He scrunched his nose, but Peter settled in, seemingly content with the movie on the screen.\nBucky sighed, setting down the remote after turning it down a little. No use waking anyone up who wasn’t up at ungodly hours of the morning. He pulled out his phone to see if Tony had responded, but there was no answer. Perhaps Tony was actually getting sleep for once.\nHe set down his phone, half-turning to Peter. “So how long has this been going on?”\nPeter frowned. “Has what?”\n“The not sleeping?”\nPeter hunched his shoulders, pulling into himself a bit. “I don’t know. A while.”\n“Is it because of your powers?”\nPeter shook his head after a moment. “They didn’t help, but… it started before that.”\nBucky turned fully. “Did something cause it.”\nPeter’s ‘no’ was far too quick to be truthful.\nBucky just raised an eyebrow.\nPeter sighed. “I stopped sleeping after my uncle died. He was, uh… he was shot. So, yeah… I guess that’s why.”\nBucky nodded after a moment, trying to hide his aching for the boy who most likely got too much sympathy from people who didn’t understand. “Okay.”\nPeter blinked. “You aren’t going to make me go to bed?”\n“Not if you don’t want to,” Bucky said, already conspiring about how he would get the kid to fall asleep.\nPeter smiled a little, scooting closer. “Thanks, Bucky.”\nBucky smirked. “Sure thing, kid.”\nIt wasn’t long before Peter was laying his head on Bucky’s (right) shoulder, his breathing steadying a little as he took in the wizards and magic on the screen. Bucky wrapped his arm around Peter’s frame and found himself smiling a little. He was almost as lanky as Steve used to be and just as reckless. With Steve, Peter, and Tony’s total lack of self-preservation, Bucky had his hands full, but one glance at the dozing boy leaning against him made it all worth it.\nBucky’s phone buzzed. He reached for it and read the text from Tony.\n\nWHAT DO YOU MEAN HE’S NOT SLEEPING?\n\nThe hypocrite.\nHe’ll have to deal with that in the morning. He leaned his head against Peter’s and allowed himself to sleep, the movie on the screen becoming nothing but white noise.\nWhen Tony finally found the two ten minutes later, he froze, taking in the sight of his kid and Bucky Barnes dozing side-by-side. Tony smirked a little. Only Peter.\n \nTony’s leg was jogging unceasingly. Rhodey had pointedly looked at him multiple times throughout the ordeal, but he ignored his best friend in favor of watching the scene play out in front of him. It was training day with Captain America.\nPeter was holding his own, thank the heavens, but he still wasn’t winning, not by a long shot. He was mostly going on the defensive, as if not sure what to do with himself. Whenever Steve purposefully left himself open, Peter hesitated to strike, as if believing it was a trick or perhaps not wishing to hurt his idol. Tony scowled at that thought. He didn’t like the fact that Peter hero-worshiped Steve.\n“Come on, kid, just hit me already,” Steve said, pulling back a bit. “I may be old, but I can take it.”\nPeter huffed a little, dropping his fists. “It just feels too easy.”\nSteve cocked his head. “I’m leaving myself open on purpose you know.”\nPeter blinked. “Oh.”\nTony rolled his eyes.\nPeter stuck his tongue out at him.\nSteve waved Peter towards him. “Again.”\nTony managed to tear his eyes away to take in the people watching the match. Pretty much everyone was here, excepting the Guardians, Scott, and Bruce. The rest were watching with rapt attention, almost as focused as he’d been. He turned back to see Peter lunge forward, slamming his fist into Steve’s abs. Rhodey winced beside him. Punching Steve in his rock-hard abs hurt. They’d all learned from experience.\nTrue-to-character, Peter shook out his fist, but he barely even winced, and just kept fighting, as if the punch had barely fazed him. Tony leaned forward again. This just got a bit more interesting.\nSteve threw a punch to Peter’s head. Dodge. Swing. Block. Kick. Dodge. Peter flipped over Steve as he swung, effectively causing him to stumble forward. As Peter landed, he didn’t miss a beat, whirling around and slamming his knee into Steve’s back.\nSteve fell onto the mat and rolled straight back up, but not before grunting in pain.\nTony saw Rhodey’s eyebrow’s shoot up in surprise out of the corner of his eye, but Tony just smiled.\nPeter blinked as if surprised at his own abilities and the apology was half out of his mouth when Steve’s grin stopped his talking.\n“That’s more like it, kid. Fight me like you mean it.”\nTony half-stood, opening his mouth to veto that idea and keep it simple, but Nat, sitting on Tony’s other side, placed a hand on his knee. He tried to snap something about safety and Peter’s age, but the look on her face effectively shut him up. He slumped against the back of the bench and pouted. Fine. Let Peter train like an Avenger. It’s not like he’s my kid or anything. Oh, wait, yes, he is.\nRhodey chuckled and patted his shoulder. “It’s okay, Tones. He’s grown into it.”\n“Grown into it, my ass. He’s still-”\nThe slamming of Steve’s fist into Peter’s hand cut him off. Tony saw Sam’s jaw drop out of the corner of his eye. Tony couldn’t help but smirk. Maybe he had grown into it.\n“That’s what he did to me!” Bucky hissed from somewhere to Tony’s left. Steve brought his other fist around as if to knock Peter down, but Peter ducked under it, pulling Steve’s fist with him and flipping him over his shoulder. On the pad, Steve swept his feet out from under him and Peter landed with a pained grunt.\n“Ow,” Peter muttered, before scrambling to his feet and away from Steve. Steve huffed, taking his time as if knowing Peter wouldn’t hit him while he was down. They went again, punching and swinging and flipping around as if they were in some sort of choreographed dance that only they knew the steps to. Tony wasn’t grinding his teeth. And if he had been, the reason for it would definitely not be jealousy. What a preposterous suggestion.\nThen Steve’s fist met Peter’s gut and Peter went flying into the padded wall at the far end of the room.\nTony was standing before he realized what he was doing, only held back by Rhodey’s hand on his shoulder.\nBut Peter was already shoving himself off the mat and sinking back into a defensive stance. Steve stalked forward, slightly warier now that he’d dealt a pretty hefty blow to the teenage hero.  \nPeter’s face twisted into an almost snarl, his chest heaving and his fists shaky.\n“You good there kid?” Steve asked, hesitating.\n“Fine,” Peter ground out, obviously not.\n“Maybe we should-”\n“I said I’m fine,” Peter snapped, voice slightly clearer, his muscles tensing.\nTony almost protested, but Nat’s hand pressed against his other shoulder and he found himself pushed back onto the bench.\nAnd then it happened.\nSteve stepped forward, sweeping out with his leg as if to knock Peter off his feet, and Peter leaped.\nHe didn’t just jump, no he leaped, straight into the air with the grace of a practiced dancer. His eyes slid shut as he ascended, his expression serene as peaked just under the vaulted ceilings of the training room, hovering there for a moment. Then, just as suddenly, he came plunging back down out of the air like a War Machine suite whose arc reactor had just been destroyed.\nTony shouted in alarm, jerking out of his friends’ grips and taking a step forward.\nBut Peter was not a broken suit and he did not need an arc reactor to function. He landed in a roll, not stopping until he was ten feet away from Steve and then he popped back up, hands already balled into fists and knees half-bent in his fighting stance.\nAwed silence.\nSteve turned slowly as if still processing what had just happened.\nAnd Peter had the audacity to frown at his gaping teammates, confused, and ask: “What?”\nTony just barked a laugh, cracking the silence that had begun to grow. Immediately, words began flowing in, compliments and questions and exclamations of awe from the rest of the team, but Tony just strode forward and clasped Peter’s sweaty shoulder. “I think you’re done for today, yeah? End it on a good note.”\nPeter frowned, looking as if he were about to protest, but quickly changed his mind and nodded. “Yeah. I was getting pretty tired anyway.”\nAt that, the others began retreating, Sam stepping up to spar with Steve next.\nPeter followed Tony out, grinning. “Was it really that impressive?” he asked.\nTony smirked. “It was impressive, kid. I didn’t know you could jump that high.”\nPeter gave a one-shoulder shrug. “The spider that bit me was half jumping spider, so… I guess that’s where I get it from.”\n“You don’t say.”\nPeter stuck his tongue out again, making his face look even more juvenile. He was saved Tony’s snappy comment by slipping into the bathroom to shower, leaving Tony by himself to shake his head and wonder if Peter would ever stop surprising him.\nTony stabbed the Chinese with his chopsticks, frustrated.\n“What is it, Tony, spit it out,” Bruce said, double tapping the screen and clearing a single line of code.\nTony sighed. “I just… miss Pepper, that’s all.”\nBruce nodded, only half paying attention. “Uh-huh, and where is she this time?”\nTony pouted, pulling his legs down from their perch on his work table and standing. “Another stupid business trip. I feel like I never see her anymore.”\nBruce looked at Tony over his glasses. “That woman works too much.”\nTony barked a laugh, setting down his Chinese. “Tell me about it.”\nBruce opened his mouth to respond when FRIDAY’s voice cut through their conversation. “Boss, Peter has entered the building.”\nTony and Bruce frowned at each other. “What, why?” Tony asked, already making his way towards the stairs, Bruce trailing behind him.\n“I’m not sure, but it seems he has a mild case of hypothermia and his fingers and toes have minor frostbite,” her voice carried concern that should have been impossible for her to convey.\nTony was sprinting up the stairs now, taking two at a time. “Why?” he snapped, “It’s not even below zero outside!”\n“The causation is unclear. He’s making his way through the lobby and towards the fireplace. The best course of action would be to take the hallway to your left.”\nTony followed her instructions without question, only taking a moment to glance behind him at a very frazzled-looking Bruce. “Get me some of those heated blankets, will you?” he asked, not bothering to wait to see if he complied.\nHe ran into the lobby, slowing to a stop in order to look for Peter. Sure enough, he was sitting on the floor by the blazing fireplace, shivering like he was having a seizure.\n“Pete?!\" he said jogging over to where his kid was. Peter turned and Tony’s eyes shot up at the tinge of blue on his lips. Tony sat down and pulled Peter into his arms, surprised when he found the saturated fabric of the spider-suit beneath his hands. “Whatcha doing with this on, kiddo?”\n“H-heater,” Peter managed through chattering teeth, before burying his face in Tony’s shoulder. Tony frowned, pressing a kiss against his head without really thinking about it. Why would Peter be so cold? How long had he been out in the snow? Did his aunt know about any of this?\nBruce stumbled into the room under the weight of about four different blankets, managing to make it all the way to them before dumping them all on the floor. “I turned them on before I grabbed them so they’d have a little time to warm up,” he said, grabbing one and tucking it around Peter’s shoulders before collapsing next to them. “Those things are heavy.”\nTony ignored him and, remembering FRIDAY’s diagnosis, pulled Peter’s hand out from where it had been tucked into his armpit and examined the fingers. They were indeed a pale yellow with a waxy look to them and FRIDAY quickly supplied that they could be treated by being placed in heated water for up to thirty minutes.\n“Make sure he doesn’t get too hot too fast or else he could damage his skin,” the AI warned, and Tony moved them further away from the fire.\nHe sent Bruce to go get the hot water and told FRIDAY to make a hot chocolate with the Keurig, remembering vaguely something about Peter not being good with coffee. As soon as he was finished doling out tasks, he pressed the spider emblem on Peter’s suit and it ballooned outward.\nPeter grunted in protest and embarrassment, and Tony winced apologetically. “Sorry, baby, I know it’s weird, but I have to get this thing off. It’s damp from the snow.”\nPeter’s face went red with the nickname, but he did his best to help get the suit off with what little use he had of his stiff limbs. When he was stripped down to his boxers, Tony wrapped a blanket around him like a burrito and then pulled them both onto the couch so Peter could lean into him without his back completely giving out.\nPeter lay his head against Tony’s chest as he put yet another blanket on top of both of them and then settled in to let the little spider baby steal his body heat. “When you get warm enough to function, you are going to have a lot of explaining to do kiddo.”\nPeter huffed, rolling his eyes, muttering something through still chattering teeth about overprotective dads.\nThe warmth coming from Tony’s expression could have thawed a frozen spider.\n \nSteve stepped into the living room, blinking the sunlight out of his eyes. He was coming back from his morning run in the snow, heading to the showers, when he stopped, frowning at the scene in front of him. Peter was conked out on the couch in the sun, barely visible under the huge pile of blankets that almost seemed to be smothering him.\nSteve made his way over to the blanket pile carefully, hoping Peter’s spider-senses wouldn’t alert him to his presence. He was standing over the passed-out kid, one eyebrow quirked upward and both hands resting on his hips when a voice came from behind him.\n“So you’re finally back from your run.”\nSteve glanced over his shoulder at a disheveled-looking Bruce (although, let’s be honest, when has Bruce ever been put together) and gave him a half-smile before turning back to the spider-kid in front of him. “Do you know anything about this?”\nBruce huffed a laugh and strung a hand through his hair as he walked over to the kitchen counter. “Yeah, the poor kid came in here shaking so bad that it looked like he was having a seizure. As it was, he was just freezing.” Bruce sighed and pulled an empty glass from a cabinet and began filling it with water. “We ran some tests and figured out that Peter got more spider DNA then we first thought. Turns out he can’t thermoregulate,” Bruce said, shaking his head.\nSteve blinked for a moment, trying to process as Bruce opened the fridge and pulled out a burrito. “Yeah, I have no idea what that means.”\nBruce glanced back, surprised. “Oh. Right. Uh, spiders are cold-blooded, yeah? So’s Peter. He can’t produce his own heat,” he said as he put the burrito in the microwave and started it up.\nSteve shook his head, confused. “How are we just now figuring this out?”\nBruce huffed, gesturing wildly over his shoulder in the direction of Peter. “You know how he is. He apparently just used to grin and bear it, thinking that it was because of his enhanced senses. He only told us this time because the heating in his apartment went out and his Aunt was at work.”\nSteve clenched his jaw, turning back to look worriedly at Peter. “And I assume Tony took it well?” he asked, sarcasm lacing his words.\nBruce barked a laugh. “He took it as well as he usually does. After he found every blanket he could get his hands on in the compound and dumping them on little spider-boy over there and once we got his frostbite down, he went to the lab to work on something to help and has been down there since last night. I found him passed out on his work table this morning.” He gestured to the food in his hands. “He’s not eaten anything either, so…” He trailed off in true Bruce Banner fashion before shrugging awkwardly. “Anyway, better get going. By the way, Tony told me to tell you that he has another Bucky note for you. It’s down in the gym somewhere. Oh, and Peter told me last night that he’s done getting the glitch out of Bucky’s arm, but he might want to tell you all about that when he waked up.”\nSteve huffed a laugh, his gaze finding Peter. “I’m sure he would. Tell Tony not to be too hard on himself.”\nBruce shrugged with one shoulder. “I’ll try.”\nSteve then went on about his business, checking up on Peter every once in a while. It wasn’t until about noon that he saw the spiderling sitting up and blinking.\n“What time is it?” Peter mumbled and FRIDAY responded.\nSteve tossed Peter a granola bar and told him to head down to Tony’s lab. “He’s been working on something for your… issue.”\nPeter nodded absentmindedly, tossing off the blankets and hissing when his feet touched the tiles. He grabbed one of the blankets as an after-thought and Steve smirked as the drowsy teen stumbled his way down to Tony.\nWhen Peter came bounding into Steve and Bucky’s room later that afternoon wearing a thick Iron Man Christmas sweater and a huge grin, spouting stuff about the in-sweater heating system and how it affected his spider-DNA, Steve had to smile. Bucky was happy and Peter was happy and Tony was happy and everything was okay.\nIt had been a while since things were just… okay.\nSteve relished in it.\n \nAfter the whole ‘hypothermia’ incident, Tony decided that they couldn’t deal with anything like that ever again and they’d have to test Peter’s different spider abilities. So, that’s how they all ended up in the training room with a bunch of different lab equipment spread throughout it. Peter was sitting cross-legged on a mat, sensors attached to different points on his body that were feeding information into a machine. Tony and Bruce were taking notes, Ned eagerly watching by their side, barely holding back his fanboying. Peter had convinced Tony to let Ned come along as they’d been planning to hang out this weekend before the heating in Peter’s apartment went out. That and Ned was actually pretty smart, considering. Nat and Steve were talking Peter through some of the physical exercises they were going to put him through, Wanda sitting off to the side to help with the mental exercises later.\nThey were setting up for the first strength test. Tony had a couple of notes scribbled down during some of Peter’s earlier training sessions, but this was the first time they’d actually sat down and pushed the limits of Peter’s strength.\n“So,” Tony said, silencing the chatter between the Avengers watching on the sidelines. “I have written down that Peter has lifted almost one ton with ease and that was definitely not the extent of his strength, so let’s see what is possible with those little spider-abilities of his, yeah?”\nThere were some appreciative murmurs at the ton comment from the side, but Tony shot him a glance and he shut up.\n“FRIDAY send in the DUM-BEL please,” Tony said, before reading Ned’s notes over his shoulder and pointing out a revision.\nAs Ned erased his mistake, the doors hissed open and a small robot rolled in, basically a metal bar with two wheels on the ends and a small monitor embedded inside. The team collectively cocked their heads at it as Tony puffed out his chest. “I am particularly proud of this particular robot.”\nPeter grinned. “Shout-out to DUM-E for one of the parts.”\nTony rolled his eyes. “Is there ever going to be a time when you don’t say that when we use this robot?”\nPeter shook his head. “Of course not. We must honor DUM-E for his contribution.”\nTony huffed and strode over to the waiting robot, stopped down and picked it up. “FRIDAY, detach wheels,” he said, and they fell off, thudding to the floor. Scott jumped.\nWalking over to where Peter was waiting, he set it on the ground and punched in a couple numbers. “Settings at 2500 pounds, subject is…” Tony glanced up at a very perked up Peter, “way too energized for seven in the morning, are we ready?”\nPeter nodded excitedly.\nTony looked back at Bruce and Ned, who were both scribbling things down on their StarkPads furiously. Ned, not bothering to look up from his writings, gave Tony an ‘okay’ symbol, which Bruce mirrored with a thumb’s up.\n“Well, kid, why don’t you give that a whirl?” Tony asked, stepping back.\nPeter took a second to stare down the robot, in order to establish his dominance of course, before reaching down and pulling it off the floor. He blinked at it as if surprised at his ability to hold it with little difficulty, before looking up and shrugging.\nTony smirked, looking over at his fellow sciencers. “Subject has shrugged. Suffice to say, I think he’s pretty okay with that much weight.”\nPeter rolled his eyes at the over-formalities. “Want me to up the weight?”\n“Put it on the floor as you do it, I don’t want you surprising yourself and breaking something,” Tony said, ignoring Peter as he made a face.\n“You’re such a mother hen,” Peter muttered, much to Clint’s obvious delight.\nDoing as Tony said, he set down DUM-BEL and plugged in new numbers. “I’m putting it at 3000.”\nTony nodded, watching with good-natured amusement as Ned meticulously wrote everything down. Turning back to Peter he nodded, watching as he again lifted the bar with ease, letting out a small grunt. Ned wrote that down too.\nTony shook his head. “Put it at 4000.”\nPeter obliged, setting it on the ground first as Tony had asked and lifted it, again with a grunt, his muscles tensing a bit. “Yeah, I’m starting to feel it a little.”\n“Feel it a little, what the heck Peter,” Ned muttered under his breath with an eye-roll. Tony snorted.\n“Alrighty, kid, go all out. Anything you think you can lift.” Tony said, waving his hand. “Just don’t pull any muscles.”\nPeter set down the bar with a thunk and reset the numbers. “I’m setting it to 6000.”\n“You sure, kid?” Bruce asked, switching his gaze from his StarkPad to the monitor they’d brought down, double-tapping a control on one of the sensors.\n“Yeah, yeah, it’ll be fine. I think I could do at least double the four-thousand, but, you know, ‘keeping it safe’,” Peter said, using air-quotes. Tony sighed through his nose. This kid.\nHe again lifted the bar, straining only a little more than before.\nTony saw Steve’s eyebrow’s shoot up out of the corner of his eye.\n“What the actual hell,” Clint muttered, leaning forward and putting his chin in his hand.\n“That’s insane,” Wanda murmured, shaking her head.\nPeter put it back down and looked up nervously. “Sorry?”\nTony barked a laugh. “Sorry?! What are you sorry for? Keep going!”\nPeter gave a one-shouldered shrug. “Okay. Going on 8,000.”\n“My word,” Bruce muttered under his breath watching the screen as Peter plugged in the numbers. “He’s barely breaking sweat.”\nTony shrugged, throwing both hands in the air like ‘what can I say?’.\nPeter again lifted the bar, taking a bit to pull it up and over his head, his arms straining. “Oh, yeah, this one hurts.”\n“You wanna stop?” Steve asked.\nPeter put down DUM-BEL with a thud and grinned. “Nah.”\n \n\n“Eight tons?!”\n\nTony laughed, switching the phone from one ear to the other and holding it with his head and his shoulder so he could free up his hands. “Oh, yeah. Your nephew is raw potential and I completely called it.”\n“I… I just…” May couldn’t seem to even speak.\nWanda called for the salt from behind her and he tossed it into the air before resuming his stirring. He heard the tell-tale whoosh of her powers catching it and smiled a little.\n“I didn’t think-! I just… wow.”\nTony huffed a small laugh, glancing over at Peter who was gorging himself on his third cheeseburger. “Yeah, he’s building his metabolism back up, I think. He’s on his third cheeseburger.”\nMay’s delirious laugh came through the audio. “I imagine he is after all that.”\n“Oh, yeah, and Ned loved every minute of it. I think he’s back there grilling Bruce on some of his gamma stuff or something like that. Not really my specialty.”\nMay snorted. “Oh, really? I didn’t know there was anything out there that existed that wasn’t your specialty.”\n“Ha ha.”\nMay hummed, amused. Then: “Eight tons?”\nTony barked a laugh. “I know, it’s crazy. You want him to stay over here until tomorrow, or are you ready for your nephew back?”\n“Are you done running those tests? I want that information too. I had no idea about the thermo-whatever-it’s-called, so…”\nTony shrugged, reaching over to grab the chili powder and dusting a bit into the bowl. “We’re all done with the strength tests, obviously, and we’ve got down how high he can jump, which is pretty damn high by the way. Wanda says other than his instincts and spider-senses and all that, his brain works like any other human’s, so there shouldn’t be any future brain issues or anything. We’ve already got a lot of tests done on his super-healing due to his, uh, extracurriculars. I want to do some spidey-sense tests and kinda do some trial-and-error with different quirks that spiders can have, but that should be it… oh! And I want to see how fast he can run.”\nMay chuckled. “That’s a pretty extensive list.”\nTony smirked. “Yeah, honestly I’ll probably come up with more later, knowing me.”\nMay was silent for a moment, calculating. “Have him stay up there for tonight, but I don’t want him late for his classes.”\n“Of course,” Tony responded, glancing back at Peter.\n“I’ll see you soon?”\n“Yeah, maybe we can have a lunch date or something.”\n“A co-parenting date.”\nTony laughed. “I’m not co-parenting, May, just mentoring.”\nMay snorted. “Whatever you say, Tony. Whatever you say.”\nThe testing thing kind of died when Peter stayed up till four a.m. trying to work on his sensory web. He woke up the next day, practically dead on his feet, so running tests on his spider abilities was kind of out of the question as was going to school.\n“Peter you look like you got run over by a truck,” Wanda said as she flipped the pancake she was currently working on into the air and catching it with the pan.\n“Thanks, Wanda,” Peter muttered sarcastically, shuffling over to the bench and plopping down onto it.\n“You wanna coffee?” Wanda asked, sliding the pancake onto the ever-growing pile of them she’d accumulated on a plate.\nBucky, standing next to her and working on the sausages glanced back at Peter over his shoulder. “He’s not good with caffeine, remember?”\nWanda’s brow creased. “But I mean… look at him.”\nThe two cooks turned to take in the very drowsy Peter who was trying to keep his eyes open but failing miserably. Bucky shrugged. “It’s his call.”\nPeter lowered his head to the table with a muffled thunk. “Give me the life juice.”\nWanda huffed a laugh. “FRIDAY, start up the Keurig.”\n“Affirmative, Ms. Maximoff.”\nThey continued their breakfast making as the other team members began trickling in. It had begun to be a tradition among them to have meals together, as they usually didn’t interact much besides that, and some of them had previous bad eating habits (Tony) that needed to be broken.\nTony was the last to arrive, unsurprisingly, almost as drowsy-looking as Peter. He told FRIDAY to add another cup to her list, as it was, many Avengers ‘ordered’ coffee every morning.\nWanda and Bucky passed out plates of pancakes and sausage, pilling up the enhanced individuals such as Peter and Steve. Wanda grabbed Peter’s mug of coffee from the Keurig and handed it to him. “An extra shot of espresso, just cause you need it sweetheart,” she said with a wink.\nPeter tipped his head back and just chugged it.\nHalfway through his drink, Bruce whipped his head toward Wanda. “What did you just say?”\nShe blinked at him. “Peter was really tired this morning, so I added an extra shot of espresso.”\nBruce jumped up from his bench with a cry and ran towards Peter’s seat. “Stop!”\nPeter froze, his eyes blown wide, before slowly setting down his mug. “What?” he asked, coffee lining his lip.\nBruce grabbed the cup and looked into it, groaning when he saw the fact that there was barely an inch left of liquid in it. “Caffeine is poisonous to spiders,” he finally muttered.\nOne. Two. Three seconds of silence. Everyone burst into a flurry of speaking and running around, many heading straight for a still-tired-but-now-very-stressed-Peter, freaking him out.\n“Do you think we’ll have to pump his stomach?!” Tony.\n“With his metabolism, it’s probably already in his blood.” Bruce.\n“Is he going to be okay?” Wanda.\n“Come on, son, let’s get you to the med-bay.” Steve.\n“We’re going to have a very hyper spider-child on our hands pretty soon.” Sam.\n“What can we possibly do?” Tony.\n“Probably just wait it out? Obviously, it’s not lethal to him because he’s had it in chocolate and small stuff before, so maybe we’ll get lucky.” Bruce.\n“We never get lucky.” Natasha.\n“He’ll be fine. A little poison never killed anybody!” Clint.\n“Do you even hear yourself sometimes?” Natasha.\n“What?!” Clint.\nPeter huffed, standing on his stool. “Will you guys shut up for one second?”\nSilence.\n“I’ll be fine. I’ve had coffee before, okay? It takes a bit to wear off, but I’m not going to die. Now, will you guys stop mothering me?” Peter asked, crossing his arms.\nClint leaned over to Nat, almost comically, and stage-whispered: “Are mood swings a symptom of poison?”\nPeter rolled his eyes and hopped off the stool. “At least I’m feeling less tired. Maybe we can do those tests now.”\nTony laughed humorlessly. “Oh, no you don’t, young man. You are not doing any sort of testing today. You lost that privilege when you stayed up till four in the morning and then decided ingesting poison was the best way to wake up the next day.”\nPeter huffed, pouting. “Then what am I supposed to do all day?”\nTony threw his arms in the air. “I don’t know! Occupy yourself! But eat first because everyone knows its not good to have caffeine without eating anything.”\nBucky laughed. “You dirty little hypocrite.”\nSteve ruffled Peter’s hair, chuckling when Peter swatted him away. His expression sobered for a moment as he leaned down. “Are you sure you’ll be okay?”\nPeter shook his head. “I’ll be fine.”\n \nHe was not fine.\n3 hours 42 minutes and 14 seconds after Peter Parker had ingested caffeine, he was still buzzing. FRIDAY had kept track. And by buzzing, I mean literally vibrating. Every part of him was moving. He would pace back and forth on the ceilings and swing around on webs in the gym and just leap fifteen feet in the air for no reason at all whatsoever, which still terrified Tony to no end. He couldn’t keep still for anything. Tony tried building with him, but when that didn’t work, he sent him to go bake something with Wanda. When he was too hyper for that, she told him to go play the piano, which usually was a good outlet for his energy, but not this time. So, Steve invited him to hit some punching bags, but Peter was so sloppy that Steve just shook his head and told him to go run around outside.\nAnd run around he did. He ran around in the grass until that felt stupid and then he ran up the side of the compound until he got bored with that and then he decided it would be a good idea to see how long he could fall without catching himself on his webbing and nearly gave Nat a heart attack when she saw him falling past her window (not that she would admit that). He got a pretty good scolding for that one, but he did manage to extract a promise that she would not tell Tony.\nShe blamed it on those huge brown eyes of his.\nFinally, Sam decided it was his turn to step up and get some energy out of Peter, so he asked him if he wanted to go for a flight.\nPeter blinked at him rapidly, which weirded Sam out a bit. “A flight?”\nSam gave a half-shrug and tossed a thin mint into his mouth. “Yeah! Well, more like a swing for you, but I would be flying.” He shook his head. “The point is, whenever I have too much energy or feel like I’ve been cooped up for too long I go out and fly. Maybe the same thing will work for you, except with… swinging.”\nPeter cocked his head at him. “Are you being nice to me?”\nSam scoffed but didn’t say anything.\nPeter finally grinned. “I think that would be fantastic.”\nSam exhaled a bit in relief. “Great! Go, uh… gear up I guess!”\nPeter gave a solemn nod as if they were two soldiers about to enter battle and bounded away, much too excited for Sam’s taste.\nHe sighed and walked up the stairs towards his room, hoping the spider-kid wouldn’t be too much to handle.\nHe slipped on his gear, doing a double check on his goggles and turned back toward the door, but instead, he came face-to-face with a red-clad superhero.\n“OH MY WORD!” Sam screamed, leaping backward and slamming a hand against his chest. Peter cocked his head at him.\n“What?”\nSam took a second to steady his pulse. “You scared the crap out of me. How’d you get here so fast?”\nPeter shrugged. “I dunno. I’m just excited I guess.”\nSam rolled his eyes. “What an astute observation. Alright, spidey, let’s go.”\n \n“WOOOOOOOOOOO!” Peter shouted, doing a cartwheel in midair and extending his web-wings. “This feels AMAZING!”\nSam’s chuckle came through his comm. “Alright, kiddo, don’t wet yourself.”\nPeter tried to flip him off over his shoulder, but it jacked up his balance and his previously-smooth glide turned into a tumble. He shot a web and it caught on a nearby building, so he used his momentum and swung himself straight up into the air. “I LOVE THIS!”\nI mean it was the life, wasn’t it? Swinging around New York in spandex with the Falcon flying overhead. It was like a dream. Peter plummeted down back toward the earth, forty feet from the ground, thirty, twenty, ten-\nPeter star-fished his limbs outward just as Sam cried out in warning and a complex system of webs shot out from the emblem on his chest, catching him in a huge net that spanned the entire alleyway. And then he was laughing with huge, tearful gasps because he loved his job with every particle of his being and he loved falling through the air and catching himself at the last second and he loved his webs and the pure aesthetic of them and- oh no now he was going to get yelled at by the Falcon.\nSam landed on a fire escape and pulled off his goggles to glare down at him. “Kid. I swear if you do one more thing like that ever again…”\nPeter heaved in big lungfuls of air as he waited for Sam to finish his threat, but he just shook his head and chuckled. “You almost gave me a heart attack you idiot.”\nPeter cocked his head and grinned under the mask, though Sam couldn’t see it. “What if that was the point?”\nSam shoved his goggles back on his face and lunged downward. “Why you little shi-”\n“Language!” Peter said, dodging and leaping up to the side of the building his webbing was connected to. “Knife,” he murmured to Karen and it ejected from one of the fingers of his suit and he sliced off the ends that were connected to the wall. Sam, meanwhile, was trying to disentangle himself from the webbing he’d just jumped into, muttering and cursing the kid that was springing a trap without his knowledge. Peter lunged across the alley to the other wall and cut those loose as well. Before Sam realized what was happening, the last connection was severed, and he plummeted the last few feet to the ground, completely wrapped up in webbing.\nSam yelled in surprise, but as soon as he’d comprehended what had just occurred, he just sighed and closed his eyes. “What did I think was going to happen when I invited a hyperactive teen to go flying with me?”\nPeter grinned down at him. “Yeah, what were you thinking?”\n \nThey made it back to the compound in one piece, surprisingly, although Sam had a bruise on his arm from when he fell on it in Peter’s webbing (which Peter apologized profusely about btw). They trudged into the living area, masks and goggles off, gasping for air.\nSteve looked up, frowning, from his book. “What are you too so out of breath from?”\nSam bent over and put his hands on his knees. “We… we raced,” he made out between breaths. “Man… that kid is… fast at swinging,” Sam said, straightening, before turning and walking towards the stairs. “I’m gonna hit the showers.”\nPeter laughed a little and collapsed onto the floor, still in his spider-suit. “That was amazing.”\nSteve chuckled. “You like exercise?”\nPeter nodded his head vigorously. “I mean… what else am I supposed to do with all this energy?”\nSteve turned back to his book. “You wanna go on a run with me tomorrow? I assume you’re sleeping over again.”\nPeter cocked his head. “What’s today?”\n“Friday.”\n“It’s not going to be at three in the morning again, is it? Because when I stay up that late I can’t-”\nSteve laughed. “I know very well that you can’t function without sleep. Look what happened this morning!”\nPeter sighed, laying back against the carpet. “Right.”\nHe stayed there for a while until Tony came up from his lab and snapped at him that he shouldn’t be laying on the carpet in his sweaty super-suit.\n \nPeter groaned, shifting so he could stare at his screaming clock. “Why did I ever agree to this?” he muttered to himself before webbing the off button and stretching in his bed. He groaned again and slid out, rubbing his face with both hands.\nHe glanced at his phone and called out for Karen. “Hey, can you ask Mr. Rogers when we’ll be back so I can tell D-Tony?”\nHis face reddened at his almost slip-up, but Karen thankfully didn’t mention it. “Sure thing, Peter.”\n“Thanks, Karen.”\n“No problem.”\nPeter quickly changed into athletic shorts and a t-shirt and splashed his face with some water on his face to wake himself up.\n“Mr. Rogers said you’d be back around eight-thirty.”\n“Okay, thanks, can you tell Tony that?”\n“Already on it.”\nPeter looked at himself in the mirror and sighed, glad that he’d woken up somewhat. “Well, get going, Parker, what are you still doing here?” he muttered to his reflection.\n \nIt was just a light jog, Steve had said, but Peter wanted to run. His legs were aching with adrenaline as they made their way around the compound’s perimeter. He saw Steve glance at him from the corner of his eye every once in a while, but he didn’t complain about the slow pace because he wasn’t about to leave Captain America behind.\nSteve finally chuckled. “You can go faster if you want. I usually go at a much faster pace than this, but I didn’t want to outrun you or anything.”\nPeter jogged forward and turned around, so he was jogging backward in front of Steve. “You outrun me? I was thinking it was gonna be the other way around.”\nSteve raised an eyebrow. “That’s how it’s gonna be, huh?”\nPeter laughed. “See if you can keep up old man.”\nHe turned and then they were at it, testing out each other’s speeds and seeing how much they could push it, pulling in front of the other back-and-forth. Peter laughed in the wind and took off, Steve barking out an unbelieving laugh before running faster in order to keep up.\nBut Peter wasn’t paying attention because he was flying, forgetting his troubles and nightmares and strife because he felt good. And then it was an all-out-sprint, the sidewalk seemingly falling away from his feet and he threw his arms outward and felt the wind on his face and the sun warming his skin and the smell of the morning air.\nSteve was already lagging behind, but he jogged to a stop and watched in awe as Peter just ran as fast as his legs could carry him and it was so amazing to watch the beautiful boy shed the stress and tiredness of life like a blanket and just embrace his own happiness. And man was that kid happy. He was getting faster by the second, going faster than Steve could’ve hoped to ever go and now his jaw was dropped because the only person he’d seen run that fast was Pietro Maximoff and he was enhanced.\nPeter seemed to realize that he’d left Steve behind, and slowed down, looking back with the biggest grin on his face.\n“I won!” he called back to him and Steve laughed and shook his head.\n“That you did.”\nSteve then cocked his head. “Race you back to the compound!” he called, pointing at the building that he was much closer to than Peter.\nPeter’s eyebrows shot up, but Steve laughed, already running towards it.\n“Hey!” his indignant protest sounded, and Steve sprinted as fast as he could.\nBut even Captain America had nothing on Peter Parker.\nSteve practically fell to the grass with shock when Peter zoomed past him and jogged the last couple of feet and touched the side of the building. “I won,” Peter panted, planting his hands on his knees. “Again.”\nSteve just shook his head, completely in awe. “I think you need to do a running test for Tony. He’ll… want to see that.”\nPeter cocked his head. “Why?”\nSteve rolled his eyes. The obliviousness of this kid.\n“Peter? Peter, honey, where are you?” May called through the apartment. “Michelle’s going to be here in half an hour!”\nNo response. May frowned, turning the corner into the kitchen and seeing him sitting on the kitchen counter, staring at the wall. “Peter?”\nNothing.\nShe sighed, pulled a bobby pin from her hair, and threw it at him, not bothering to watch him catch it, but turning away to gather her coat. “Come on dear, you have to get ready. I’m going to cover a shift at the hospital, you can either stay here by yourself or you can drive over to Tony’s… Peter?” she said, frowning. She turned to see that other than the hand that had come up to grab the bobby pin, he hadn’t moved an inch.\nMay walked up to him and prodded his knee with one finger. “Peter, sweetie.”\nHe blinked, tension leaking out of his shoulder. “Yes, May?”\nShe laughed a little incredulously. “You need to get ready.”\nHe shook his head as if clearing it and then smiled. “Right, right. See you tomorrow,” he said, leaning in to kiss her cheek.\n \n“You know after all this time, I’m still surprised that he wants me. I mean you, of course, are used to it because of, you know, our red-clad friend. But me?! I’m just… me! I’m not a superhero! Mr. Stark says I can start interning next week, as long as I get my parent’s permission, but I won’t be in his personal lab. I’m okay with that though, as long as I get to work at Stark Industries. Wait… is interning a word? Yes, it is. It definitely is. Right? …Peter?”\nPeter didn’t move, still staring at his worksheet, but writing nothing on it.\nNed huffed. “Earth to Peter!”\nNo response.\nNed frowned, leaning towards him and following his gaze to the worksheet. “Is there something super interesting going on that I’m missing. Do you suddenly have x-ray vision? Because if so… that would be… amazing.”\nPeter just sat there, frozen.\nNed prodded him with his pencil and Peter yelped, jumping out of his seat and onto the ceiling.\n“What the heck, dude?”\nPeter blinked down at him. “Uh… sorry… just got…” he shook his head, lowering himself down, “distracted.”\nNed raised his eyebrows. “I can see that. So… no x-ray vision?”\nPeter looked at him like he was crazy. “What?!”\nNed sighed, dejected. “Nevermind.’\n \nIt was as if all of existence had narrowed down to a single point. Nothing else mattered except that single spot on the wall. Peter thought he felt his forehead wrinkle, but it was possible his face hadn’t moved at all. He was unaware of his surroundings, unaware of anything that was going on around him except that spot and what it might entail.\nIt was brown, shaped vaguely like a thumb-less hand and it could be from anything really. It could be from coffee, chocolate, or possibly dried blood.\nIt was most likely coffee, as this was Mr. Farkle’s room and that man was known to always have a cup. He even had a Keurig machine sitting on his file cabinet in the corner for the sole purpose of keeping his coffee cup filled at all times. All times. He was the type of guy to get things done quickly and in order. He was the type of guy to run with a push mower just to get done quicker. He was the type of guy to record every single lesson he taught even if no one was absent ‘just in case’. He was the type of guy to get papers graded and back to the students by the next day, even if it was a large test. He was the type of guy that didn’t sleep very much, so coffee was the answer.\nPeter laughed a bit to himself, not noticing the weird look Flash tossed back at him. If only he could get away with not sleeping and drinking coffee to keep himself going. But Peter remembered where that got him last time. He mentally shuddered. That was a nightmare.\nBut wait, Mr. Farkle never spilled anything. He was just one of those people that were immune to stains, so it couldn’t be him or his infamous coffee cup that was the source. If Peter didn’t know any better, he’d say it was himself, as Peter was as immune to stains as he was to getting into trouble.\nBut again, no coffee for him.\nPeter wondered if it was blood after all. He wondered if it was from him because honestly, that would make the most sense as he was almost always bleeding from some not-quite-healed-yet injury from patrol.\n“Hey, loser!”\nPeter’s head snapped up to see an empty classroom. He turned to the source of the voice to see MJ staring at him with her bookbag on and one eyebrow raised.\n“Whatcha thinking about?” she asked him. “Must be pretty interesting because…’ she glanced around at the empty classroom, smirk slightly visible, “class ended five minutes ago.”\nPeter gave her a nervous grin. “Sorry… sorry,” he shook his head, gathering his things. “I just… uh… I start thinking about something and an hour has passed in like two seconds.”\nHe stood, slinging his backpack over his shoulder. “It’s a weird effect I got from, you know…”\nShe rolled her eyes at him. “Come on, dork, let’s get going. You’re going to be late for your next class,” she said, turning and walking out the door. He jogged up to her, then matched her pace, a full-blown grin lighting up his face.\n“What?” she finally asked, not sparing him a glance.\n“I really like you,” he said.\nShe huffed, not meeting his eyes. “Damn you, Peter, you know I hate it when you say adorable stuff like that.”\nPeter barely dodged body-slamming a guy that was walking past them because he was so busy staring at his girlfriend. “I know, but it makes you all cute and flustered.”\n“Exactly. I do have a reputation to uphold you know.”\nHe laughed, bumping her with his shoulder. “Whatever you say, beautiful.”\n“Peter, I swear-”\n \nPeter was being suspiciously quiet, and Tony wanted to know what was going on.\n“Hey, Steve told me about how fast you can run,” Tony said, trying to start a conversation.\nNothing.\n“I thought maybe we could do one last test run for it later. I mean I wanted to test your running anyway last weekend, but with the whole caffeine thing… and that meeting I had to go to… we never really got to it.”\nStill no response.\n“I know you don’t really like those test runs, cause you get self-conscience and all that stuff, but really it is pretty amazing watching you kick ass. Kick butt, sorry. I forgot we have a spider-baby in the room.”\nNot even a reaction to the nickname.\nTony sighed, not looking up from his project. “Come on, Pete, talk to me. You’ve been quiet all day… what’s gotten into you?”\nSilence.\nTony finally looked up at Peter, concerned. The spider-ling was sitting completely still, staring straight at the glass monitor in front of him, his eyes not moving. They were just… staring. Taking in a single point and contemplating it as if it held the secrets of the infinity stones.\n“Peter?”\nPeter didn’t even blink.\nTony got up from his chair, frowning. Was Peter unconscious? He walked over to Peter’s desk and tapped him on the shoulder. Peter leaped out of his seat and into the air, sticking straight onto the ceiling. “Shit!” he barked, his muscles tense and his eyes blown wide.\n“Language!” Tony snapped instinctively. “What in the world was that?”\nPeter stared down at him, looking as if he were finally realizing where he was for the first time that day. “Oh! Oh, uh, sorry. I get like this sometimes. This is actually the second time this week I’ve been scared onto the ceiling.”\nHe dropped, bending his knees to absorb the impact. “Though my apartment ceiling is admittedly a lot lower than this one is.”\nTony shook his head. “Spider-bite affect?”\nPeter shrugged. “I guess so.”\n“Did you hear any of what I said?”\nPeter’s smile looked more like a wince. “Um… no?”\n \n“This again? Seriously?” Peter asked, rubbing his face with his hands when he saw the rest of the team filing into the training room. “How many times am I going to have to keep doing this? Especially in front of everyone?”\nTony smirked, ruffling Peter’s hair. “When you stop surprising us, spider-baby.”\nPeter stuck out his tongue. “Stop calling me that.”\nTony laughed, pulling the returned Ned off to the side. “Your friend Petey over there is full of surprises. You know if he’s got anything else up his sleeve?”\nNed gave a half-shrug, looking back at Peter, who was squinting suspiciously at them. “Nothing that I know of, sir, but I’ll get back to you if something comes up.”\nTony pursed his lips. “Alrighty, then. You gonna ask your parents about that SI internship?”\nNed’s grin spanned his face. “I already did, and they were thrilled, Mr. Stark. They can’t wait until I start!”\nTony laughed. “Yeah, well, me neither. We can start scheduling later for you and Michelle, k?”\nNed couldn’t stop smiling. “Thank you so much for this Mr. Stark. It means the world!”\nTony shrugged. “It’s the least I can do. You have kept Peter alive after all.”\nNed huffed. “Tell me about it.”\nTony clapped him on the back and turned to face Peter. “Alright Pete, get up on the track. Let’s get this started.”\nPeter strung a hand through his hair. “Okay. I don’t know if I’ll be that impressive, but I’ll give it a shot,” he said walking up the steps to the track lining the perimeter of the training room.\nSteve rolled his eyes. “Not that impressive my ass.”\nMultiple people gasped sarcastically at that, Tony barking out a ‘Language!’.\nSteve rolled his eyes and opened his mouth to snap back, but Peter called out, “Ready!” and cut him off.\nBruce gave a thumbs up from behind the monitor that was showing his vitals. “Light jog first, okay Peter? We’ll tell you to step it up once I’m sure these are in sync.”\nPeter nodded a little self-consciously, beginning to jog around the track. Bruce made sure everything was in order then looked up towards Peter. “Alright, let’s see what you can do!”\nPeter sped up a little bit, swinging his arms in time with his legs as he built up momentum. He was gaining speed slowly, testing himself out now that he had people watching his every move. He pulled forward in a sprint, but his running was still slow enough to be human.\nAnd then it just… wasn’t.\nSteve barked a disbelieving laugh as Peter went speeding around the track, somehow still managing not to run into the walls as he rounded the corners. Tony had to whip his head around to keep Peter in his sights over and over again because Peter was flying.\nHe was full out sprinting faster than anything humanly possible, and his breathing and heart rate were only slightly elevated and then he let out a breathy laugh, the tension melting from his body as he became one with the air and sweat and track beneath him.\nTony was gawking, as was everyone else, all except Steve, who was just shaking his head. Tony glanced at Wanda who had a smile that was awed and happy and sad all at the same time. Peter was definitely not running at the speed of light, but it was still the closest anyone had ever gotten to Pietro’s speed, and Tony frowned a bit at the connection.\nBut then he turned back to look up at the track and Peter was still going. Nat laughed gleefully from behind Tony. This was going to make training so much more interesting.\n \n“It was amazing May. He was going so fast it was crazy! Like, not Quicksilver fast, but for someone who’s powers aren’t supposed to be speed related...” Tony just shook his head, unable to describe what it was like. “He’s amazing.”\nMay smiled back at him through the screen. “Yes, he is full of surprises, isn’t he?” she chuckled to herself, stringing one hand through her hair before focusing back on the screen. “He’s been going through this weird phase lately where he will just… sit for hours. He’ll just sit and stare at a wall or a desk or something like it’s the most entrancing thing in the world. I thought he’d learned to sleep with his eyes open, but he told me that he’s awake. He says that’s how he gets when he concentrates on something but I definitely think it’s an effect from that spider.” She shook her head and laughed again. “He’s a handful, that one.”\nTony rolled his eyes good-naturedly. “Oh, believe me, I know. I told Ned to tell me if there’s anything else that he’s hiding from us just so we’re prepared, but I have a feeling Peter has that kid wrapped around his finger as well. It’s a good thing he doesn’t know the effect he has on people. If he did, he could take over the world.”\nMay smiled. “He wouldn’t though. He wouldn’t think that he’d be good enough for that job.”\nTony huffed. “Since when is Peter not good enough?”\nMay raised her eyebrows. “In his eyes? He’s never good enough.”\nTony pursed his lips. “We’re going to have to do something about that.”\n“You can try,” May said, shrugging. “But I’ve been trying for years and he still doesn’t seem to understand.”\nTony wagged his finger, smirking. “Have some faith. I have a team of superheroes on my side.”\n“Okay. Whatever you say Tones. Make sure you two get to sleep at a reasonable time tonight, okay? I don’t want you staying up too late.”\n“You sound like Pepper.”\nMay barked a laugh. “She’s a smart woman.”\n“See you, May,” Tony said, ending the facetime. He strung a hand through his hair. Now how was he going to get a self-deprecating spider-baby to love himself?\n \n“Boss, it’s midnight,” FRIDAY said, sounding tired of repeatedly reminding him of the time for the past half hour.\nTony sighed, dropping his tools and stretching. “Fine. Come on Petey, let’s get to bed.”\nThe little spider was working on his spider-suit, too engrossed in his work to look up.\nTony shook his head. “Come on kiddo, let’s go.”\n“Just give me a minute, dad, I’ve almost got this,” Peter said, still concentrating.\nTony’s eyebrows shot up, and his feet stilled. Just like every time Peter had slipped and called him dad, his entire body felt lighter and his face split into a grin.\nBut then Peter seemed to realize what he’d said as his hands froze as well, the back of his neck and his ears reddening. He turned slowly. “Sorry, Mr. Stark, I-”\nTony shook his head, reaching forward. “No, no! It’s… uh… it’s okay. Come one, let’s get you to bed.”\nPeter didn’t seem to know what to do with himself. He set down his stuff, and walked towards Tony, looking everywhere but his face. Tony huffed. “Peter, it’s okay. You’re my kid. It’s not weird that you called me that.”\nPeter blinked, surprised. “I am?”\nTony snorted. “Why do you think I call you kiddo? Only lame dads do that,” he said, throwing one arm around his kid, guiding them towards the stairs. “Let’s go. Both of us need the sleep.”\nSilence for a bit as they walked up the stairs, then Peter piped up. “You are a lame dad, aren’t you?”\nTony glared. “I was kidding. I’m the coolest dad.”\nPeter stopped, the beginnings of a grin forming on his face. “No, no. You make dad jokes all the time and are terrible with slang and you think you’re hilarious. You are the lamest dad!”\nTony threw his arms in the air. “Come on, I’m so cool! I’m Tony Stark!”\n“Exactly. Lame.” Peter said, jogging towards the fridge. “That’s okay though. Lame dads are the best dads.”\nTony crossed his arms, skeptical. “How does that work?”\nPeter pulled a half-pint carton of chocolate milk out of the fridge, smiling. “Well, cool dads don’t watch cheesy movies, or prefer takeout over fancy diners, or snuggle with their kids. They’re too sophisticated for those things. But those are my favorite things, and if you were a cool dad…” Peter shrugged, not looking Tony in the eye. “I don’t know if I’d be enough for you to want to do those things with me.”\nTony’s eyebrows shot up. “You, sir, are a little idiot aren’t you.”\nPeter blinked, taking a long sip of his milk. “What?”\nTony walked over to him, smirking. “You, kiddo, are enough to make even the coolest of dads lame.”\nPeter pressed his lips together, unsure but happy, nonetheless. “Whatever you say.”\nTony rolled his eyes. “Now for real we need to sleep, or Pepper will kill me.”\nPeter smiled a little, putting the chocolate milk back into the fridge. “Okay, let’s go.”\nPepper found the two of them passed out on Peter’s bed, the younger laying on the older like a giant pillow. She laughed and shook her head at them. How could a father and son be so damn cute?"
}