{
    "id": "16213721",
    "url": "https://archiveofourown.org/works/16213721?view_full_work=true",
    "author": [
        "fancyh"
    ],
    "title": "No Harm Will Come to You Here",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Merlin (TV)"
    ],
    "relationships": [
        "Merlin/Arthur Pendragon (Merlin)"
    ],
    "characters": [
        "Merlin (Merlin)",
        "Arthur Pendragon (Merlin)"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence",
        "Season/Series 05",
        "Merlin's Magic Revealed",
        "Fluff and Angst"
    ],
    "language": "English",
    "series": "",
    "published": "2018-10-17",
    "completed": null,
    "words": "6,792",
    "chapters": "1/1",
    "comments": "202",
    "kudos": "16,854",
    "bookmarks": "2,308",
    "hits": "111,602",
    "summary": "<p>\"That was magic,\" Arthur accuses.</p>\n<p>\"Oh.\" Merlin just nods, looking unperturbed. </p>\n<p>Arthur fights to keep his expression calm, mind racing and heart pounding. \"Sorcery is outlawed in Camelot. On pain of death.\"</p>\n<p>Merlin splutters, finally fixing Arthur with an affronted glare. \"It's not like I meant to do it!\"</p>\n<p>***</p>\n<p>Merlin gets hit with a spell meant for Arthur and loses his memory. Revelations ensue. Set sometime after 5x02.</p>",
    "notes": "",
    "text": "It starts, as most things do, with magic.\nArthur and Merlin are hunting - or rather, Arthur is hunting and Merlin is doing his best to scare off the game - when the sorceress attacks, stepping from behind a tree as she spits our unfamiliar words. It happens too quickly for Arthur to react, sword just barely drawn from its sheath and muscles tensed in anticipation, the sorceress's eyes glowing a harsh yellow that makes his heart skip a beat, and Arthur knows he can't get out of the way in time, he's going to die here-\n\nWham!\n\nThe impact sends him crashing to the ground, breath leaving his lungs in a rush. Merlin collapses on top of him limply, and Arthur has a moment of horror that Merlin is dead, he's finally sacrificed his life for Arthur, the idiot - but he can't think of him now, instead grabbing the crossbow Merlin had dropped and aiming at the sorceress.\nHer eyes widen in alarm and she yells more words, eyes flaring as she disappears into thin air. The bolt thunks into a tree, passing through right where she was standing, and Arthur throws the crossbow away.\nBending down next to Merlin, Arthur rolls him onto his back and frantically presses two fingers to his neck, searching for a pulse.\n\nThere.\n\nHe feels it, a steady thump-thump that makes relief course through him. He checks Merlin over, but he's unharmed, and Arthur hopes whatever spell the sorceress had cast isn't fatal. Merlin has to be okay, especially since Gaius isn't in Camelot at the moment but in a neighboring village, treating an outbreak of sweating sickness.  \nSuddenly Merlin groans, eyelids fluttering, and Arthur anxiously hovers over him, watching as hazy blue eyes focus on him.\n\"Merlin,\" he breathes.\nA furrow appears on Merlin's brow and he blinks, staring up at Arthur in puzzlement, before bolting upright in alarm.\n\"Who's Merlin?\" He turns his head slightly, looking around. \"Where am I? And who are you?\"\nCold dread settles in Arthur's heart, blood rushing in his ears.\n\"You're Merlin,\" he says slowly, praying this is all some elaborate joke. \"I'm Arthur. Do you remember what happened?\"\nMerlin's brow furrows further, eyes lost in thought. \"No.\" He peers at Arthur in concern. \"I don't remember anything.\"\n\"Nothing? You really don't know who I am?\"\n\"Er, no, sorry. I take it we knew each other?\"\nArthur sits back on his heels, pinching the bridge of his nose. \"Damnit.\" This is bad. Very bad. Merlin doesn't remember anything.\n\"I have to get you back,\" he says. \"Gaius will take a look at you when he gets back. He'll find a cure, I know it.\"\n\"Who's Gaius?\"\nArthur sighs. \"I suppose I'll have to start at the beginning.\"\n\"You're really the King?\" Merlin asks incredulously, looking around Arthur's chambers like he's never seen them before. \"And I'm your servant?\"\n\"Yes, Merlin, we've been over this. You've been my servant for almost ten years.\" Arthur picks at the food on his plate, watching Merlin stuff berries into his mouth, the corner of his lips stained purple. He has the strange desire to lick them clean.\nHe'd figured his chambers were the safest place to keep Merlin for the time being, not wanting to set him loose in Camelot without any memories. He had briefly informed the knights and sent them after the sorceress, and left Gwen in charge of council today. They had all introduced themselves to Merlin, who smiled at them endearingly, before Arthur had hustled him away, citing the need to not overwhelm him.\nIn truth, he selfishly wants to keep Merlin with him. Merlin without memories seems...happier. More like the cheerful, idiotic boy Arthur had met a decade ago, and not the unsmiling man that has graced Camelot's halls recently. Arthur wonders what happened to change Merlin, at what point he lost that gleam of innocence in his eyes.\n\"I must be a good servant,\" Merlin says confidently, tongue darting out to catch a drop of juice that trails down his chin.\nArthur scoffs. \"Hardly. You're the worst servant I've ever met.\"\nMerlin tilts his head like a curious cat. \"Then why do you keep me around?\"\n\"Because....\" Arthur swallows his pride. \"Because we're friends,\" he replies firmly. \n\"Oh.\" Merlin grins, eyes crinkling at the corners, and Arthur tries to remember when he last saw Merlin smile like this, a real smile, but can't.  \nMerlin is still grinning, and Arthur rolls his eyes, finding a smile creeping across his own face. He's missed this, Merlin's infectious smile, and it should feel strange, having Merlin with no memories, but if anything Arthur feels like he knows this Merlin better than the real one. This Merlin is simple. Happy. \nArthur reaches for his goblet without looking, hand brushing the edge and sending it tipping over towards the tablecloth. His head whips around, fingers reaching too late, only to find the goblet stilled halfway down, wine frozen in midair. \nMagic. His heart stutters, eyes searching out Merlin across from him; Merlin whose hand is outstretched, eyes glowing a traitorous gold. In the next instant it vanishes, leaving only blue, and the goblet clatters on the table, red soaking the white fabric like blood and spreading quickly.\nArthur is frozen, staring in shock at Merlin, who seems equally surprised. Merlin has magic, his brain repeats over and over. Merlin has magic.\nHe should arrest him, run him through where he stands, but he can't move.\n\"What did you do?\" he chokes out.\nMerlin blinks and shrugs, scratching the back of his neck. \"I don't know. It just...happened.\"\n\"That was magic,\" Arthur accuses.\n\"Oh.\" Merlin just nods, looking unperturbed. \nArthur fights to keep his expression calm, mind racing and heart pounding. \"Sorcery is outlawed in Camelot. On pain of death.\"\nMerlin splutters, finally fixing Arthur with an affronted glare. \"It's not like I meant to do it!\"\nArthur opens his mouth, then closes it, at a loss. If that's true, if this Merlin didn't mean to do it, he can't in good conscience condemn him. He can't blame him for the real Merlin choosing to learn magic. \nIs that what changed Merlin? Has he been corrupted by magic, just like Morgana?\nAs soon as the thought comes, it brings with it another, worse, one. Is Merlin betraying him?\nNo. He can't believe that. Not of the Merlin who followed him into Ismere, who nearly died at Morgana's hand. Who has saved his life multiple times over the years. The Merlin who somehow pulls him off the battlefield over and over, who frets over him like a fishwife, who has had ample opportunity to harm Arthur and never raised a finger against him.\nBut the fact remains. Somehow, Merlin's body knows magic. And suddenly, things click into place. Falling branches, miraculously defeated enemies, Merlin's disappearances and odd quirks, the missing piece of a puzzle Arthur's never solved until now. \nMerlin has magic. \nMerlin has lied to him, for years.\nMerlin is his friend.\nMerlin is sitting across from him, without memories, looking at Arthur questioningly.\nArthur takes a deep breath, shoving the anger and betrayal and confusion down. There will be time to question Merlin when his memories return. \"Magic is dangerous,\" he says seriously, making sure to meet Merlin's eyes. \"It is against the law. You cannot use it. Understood?\"\nMerlin nods rapidly, eyes wide.\n\"And you can't tell anyone else,\" Arthur adds. \"No one. I mean it.\"\n\"Why?\"\n\"Just do what I say, Merlin.\"\nMerlin scowls but nods, fingers trailing over the table nervously. \"Why is magic dangerous?\" he finally asks. \n\"Magic is evil,\" Arthur replies. \"It corrupts even the purest of souls. It is what made you lose your memories. It killed both my parents. Those who practice magic knowingly break Camelot's laws and endanger the kingdom.\"\n\"I'm not corrupted, am I?\" Merlin looks scared now. \"I didn't mean to do it, I swear. Did I practice magic, before? I must have.\" He blinks. \"Oh god. You're going to execute me-\"\n\"Calm down. I'm not going to execute you.\" Arthur pinches the bridge of his nose, sighing in frustration. \"I'm not sure what I'm going to do,\" he admits. \"But I won't do anything until you've regained your memories. I cannot convict you for a crime you haven't committed.\"\n\"Oh. Well, that's good.\" Merlin laughs nervously.  \"I am rather attached to my head.\"\nThe problem, Arthur soon realizes, is that Merlin has no control over the magic he apparently possesses. The second time he uses it is in the evening as the chill seeps into the room, when he glances at the dark fireplace and it roars to life, startling them both.\n\"Merlin!\" Arthur shouts. \"What did we just talk about?\"\n\"I wasn't trying to do it!\" Merlin replies heatedly. \"I was just thinking about how I was cold and wished there was a fire. It was an accident.\"\n\"There's no such thing as accidental magic,\" Arthur snaps, ignoring the small voice that tells him he's just had proof it's possible. \"Magic takes spells, practice. Even I know that.\"\n\"I don't know any spells.\"\n\"I know!\" Arthur stands from his desk abruptly, pacing back and forth. It makes no sense. Magic is a choice, and yet Merlin seems to have none. Has he been wrong all this time?\n\"Just...try not to,\" he finally says.\nMerlin nods, eyes wide and guileless. Arthur resolves not to let him out of his sight. \nMerlin goes to grab a goblet and it flies into his hand. Merlin trips and a chair screeches across the floor to catch him. Merlin sets fire to Arthur's drapes. Merlin goes to clumsily undress Arthur for bed and he suddenly finds himself naked, Merlin's shocked eyes trained on his body and making Arthur's face heat uncomfortably.  \n\"You idiot!\" Arthur bellows, grabbing his sleep breeches from his dressing screen and yanking them on. \"One more act of magic and I swear I will throw you in the cells myself-\"\n\"I can't help it!\" Merlin shouts back, gold flashing in his eyes. The inkwell on Arthur's desk shatters. \"You think I want this? I don't know what's happening to me, I don't know who you are, I can't remember anything, and you keep threatening to execute me for something I can't control!\"\nArthur has never seen Merlin so angry, and has never seen such anger directed at him. It stops him cold, stealing his breath and sending cracks through his heart. He thinks of how Merlin feels right now, with no memories, surrounded by people he doesn't know and who seem to hate the magic he possesses.\n\"I bet the real Merlin hated you,\" Merlin snarls, vicious, the gold in his eyes intensifying and all the furniture in the room beginning to tremble. \"I bet that's why he never told you about his magic, because he knew you'd kill him for it. Because you'd call him evil. I bet he was plotting against you, I bet-\"\n\"That's enough.\" Arthur steps forwards, into Merlin's space. \"Merlin would never betray me.\"\n\"Then he's a coward!\" Merlin's fists are clenched at his sides, eyes still burning a terrible, traitorous, beautiful gold. \"You don't understand. I can feel it, the magic. It's inside me. It is me. I know I didn't learn it, or choose it. This is who I am and I'm not-I'm not a monster-\"\nHe breaks off, a harsh sob torn from his chest, and the shaking around them calms, the gold fading from his eyes. He looks small and vulnerable, arms wrapping around himself as he avoids Arthur's gaze. \n\"I'm not a monster,\" he repeats quietly. \"I may not remember anything, but I know that much. And if you're going to kill me for who I am then so be it. But I will never forgive you.\"\nArthur carefully places his hands on Merlin's shoulders, heart breaking open.\n\"Merlin,\" he says. \"Look at me.\"\nSlowly, Merlin drags his eyes up to meet Arthur's, clear and blue once more. \n\"I'm sorry,\" Arthur says, words laced with ardent truth. \"I was wrong. I don't know much about magic, or trust it, but if I know anything it's that you aren't evil. You're the only friend I have, and I couldn't bear to lose you.\"\nMerlin searches his eyes, a furrow appearing between his brow. \"I don't even know you,\" he murmurs. \n\"Well, I know you,\" Arthur replies, feeling a sense of deja vu. \"You're brave, stupidly so, and loyal, and often quite wise, though I'd never admit it. You've made me a better man. A better king. You have my word that no harm will come to you here.\"\nArthur is suddenly aware of how close they are, his hands gripping Merlin's shoulders tightly and face inches from his. Merlin's eyes flicker over his face, and Arthur finds his own drawn to Merlin's lips, parted and slightly chapped from the cold. \nHe releases Merlin, stepping back and clearing his throat as Merlin seems to snap out of his trance.\n\"You'll stay here tonight,\" Arthur orders.\n\"What? Why?\"\n\"Because I can't have you gallivanting around the castle doing magic. Someone could see.\"\nMerlin glances at the bed, then crosses his arms. \"I'm not sleeping on the floor.\"\nArthur rolls his eyes. \"Yes, Merlin, you may sleep on my bed. It's certainly big enough for two.\" It's a oft-whispered fact that Gwen sleeps in her own chambers, their marriage one of friendship and mutual respect rather than love.\nWalking to the bed he pulls back the covers, sliding in and patting the space next to him. \"Come on.\"\nMerlin edges forwards, perching on the far end of the bed as if Arthur's going to bite and pulling off his boots. He strips off his jacket and neckerchief and throws them without care, and Arthur has to stifle a laugh at how much like Merlin the gesture is. Apparently he truly is naturally messy.\nSliding under the covers Merlin lays on his back, profile visible in the candlelight.\n\"Put out the candles,\" Arthur says.\n\"I just got in bed,\" Merlin complains. \n\"With magic.\"\n\"Oh.\" Merlin turns to look at him, then stares at the candles intently. They flare brighter for a moment before extinguishing, and Arthur hears Merlin's small sound of pride and smiles, something warm filling his chest. He doesn't know what he's going to do about Merlin, doesn't know what the morning will bring, but it doesn't matter, because Merlin is safe next to him, and Arthur finally, truly, understands.\nArthur wakes to a warm weight against his side, something soft tickling his cheek. Blinking open sleep-gummed eyes, a mop of black hair enters his vision, Merlin's cheek pillowed on Arthur's shoulder and nose pressed to his neck. He's sprawled over Arthur, an arm thrown over him and one leg hitched up on Arthur's thigh, dangerously close to his groin. \nArthur also becomes aware of another...predicament concerning said groin - namely, a maddening arousal that only flares when Merlin shifts and grunts in his sleep, knee brushing against him. He tries to breathe steadily, thinking of his father with the troll and Gaius naked and anything sufficiently horrifying enough to cool his blood, and manages to get himself under control just as Merlin starts to wake, snuffling and twitching against him.\nMerlin's head raises and two blue eyes peer down at Arthur, still soft and unfocused with sleep. \n\"Good morning,\" Arthur murmurs, secretly hoping Merlin never moves. The real Merlin never lets himself this close, never lets Arthur truly see him. He pulls away each time Arthur advances, until Arthur has nearly given up hope that Merlin will ever return his feelings. He cannot have Merlin; it seems he never did at all.\nMerlin flushes a bright red all the way to the tips of his overlarge ears and Arthur suppresses a smile, unused to a shy and abashed Merlin. It's rather adorable, if he's being honest - not that he'd ever tell another soul.\n\"Sorry,\" Merlin stammers, drawing back. \n\"It's fine.\" More than fine, actually. He only wishes Merlin hadn't withdrawn. But no matter what he wants, he cannot take advantage of Merlin like that. Not in his memory-less state. The real Merlin does not want Arthur, and he must respect that.\nHe throws back the covers and slides out of bed, toes curling as he bare feet land on the cold stone floor. \n\"Start the fire, would you?\" he throws over his shoulder. \nHe hears Merlin's feet pad across the flagstones and then stop.\n\"Arthur?\"\nArthur turns, raising a questioning eyebrow and keeping his face blank, already knowing Merlin's question.\n\"Can I...?\" Merlin wiggles his fingers in a gesture clearly meant to indicate magic.\nArthur nods, feeling a strange desire to see, or maybe to assure himself that yesterday wasn't a dream. \"Go ahead.\"\nMerlin's face breaks into a broad grin and he stares at the fireplace intently until flames leap up, the flash of his eyes almost familiar now. He looks so pleased with himself, glancing at Arthur with open happiness, that it makes Arthur's heart squeeze painfully. All these years, Merlin has never even been able to do such a simple thing. He has had to lock away a part of himself that seems so natural, so integral, that he can scarcely contain it. \nArthur steps behind the dressing screen to hide his expression, pulling on new breeches and a tunic without looking at them. Magic is still a mystery, and how Merlin can do it another, but he knows two things: One, that Merlin would never betray him, and two, that Merlin's magic isn't evil.\nIt shouldn't be enough, but it is. It is enough to tear down all his father's teachings, the years of hating magic, for the simple fact that it is Merlin, and Arthur loves him with an intensity that terrifies him. \nAfter he emerges from the screen he ducks out into the hall, hailing a servant to bring breakfast and to tell Gwen that he won't be attending council today. He can't leave Merlin alone now, not with magic bursting from his every pore. No, he'll have to find a way to keep Merlin away from everyone.\nThe idea strikes him suddenly. Hunting. Of course. Though it's what got them into this mess, Arthur's not worried. He has a feeling that if anything tried to attack them, they'd soon find themselves on the receiving end of a nasty bit of magic. Besides, maybe the'll find the sorceress, and get her to reverse the spell on Merlin. As much as Arthur is strangely enjoying this new Merlin, he misses his friend. He misses the Merlin who has saved his life countless times and insulted him more, who has stayed by his side for a decade. For all the seeming closeness, this Merlin and he are strangers.\nHe poses the idea over breakfast - or rather, tells Merlin in no uncertain terms that they're going hunting and he can't refuse. Merlin, predictably, scrunches his nose and whines about the killing of innocent animals, a sentiment Arthur is tickled to see is present even without his memories. \n\"Don't be such a girl, Merlin,\" Arthur responds easily, taking a bite of bread. \"It'll be fun.\"\nTongue seemingly looser than yesterday, Merlin pesters Arthur with questions the entire way, asking about Camelot, about Arthur, about himself, until Arthur wants to shoot himself with his crossbow.\n\"So I'm not from Camelot?\"\n\"No.\"\n\"Why did I come here?\"\n\"I'm not sure. You said you didn't fit in anymore in Ealdor.\"\nAnd-\n\"I'm a physician?\"\n\"Of a sort. You've been helping Gaius for years, so, yes, I suppose so.\"\nAnd-\n\"How did we meet?\"\n\"Well, you tried to punch me, and I threw you in jail. Then I tried to take your head off with a mace. It's a long story.\"\n\"Seriously?\"\nAnd-\n\"Are you going to make magic legal now?\"\n\"Merlin!\" Arthur pinches the bridge of his nose. \"Would you do me a favor?\"\n\"Depends.\"\n\"On?\"\n\"The favor.\"\n\"Could you, please, shut up?\"\nMerlin scowls at him. \"How would you feel if you didn't have any memories?\"\nArthur can admit he understands Merlin's curiosity, but it's grating on his nerves. \n\"So, are you going to make magic legal?\" Merlin presses.\nArthur sighs. \"Maybe. Let's stop here,\" he says, indicating the banks of the small stream they come upon. They dismount and unload the food they'd brought, sitting in comfortable silence as the stream rushes past with a soft tinkle, the birdsong hushed and forest around them tranquil. Merlin is looking around him, a small smile on his face, and before Arthur can say a word he stretches out a hand, dragging fingers through the clear water. \nArthur watches in amazement as drops of water float upwards, hovering above the surface of the stream. Merlin's eyes glimmer with gold, smile curving across his face as he moves his hand, making the droplets dance and form shapes in midair - a miniature horse, rearing; a sword; the Pendragon crest.\n\"Beautiful,\" Arthur whispers to himself, unheard by Merlin. He feels tears prick his eyes.\nIs this what magic really is? \nHe reaches out without thinking, touching the suspended water. His hand comes away wet, the shapes blurring before resolving as Merlin bends the water to his will, more rising up from the stream to swirl in the air like ropes of silver.\nFinally, the water eases back down into the stream with the lightest of splashes, Merlin dropping his hand to his lap as the gold fades from his eyes. \n\"Hod did you do that?\" Arthur asks, curious instead of accusing.\nMerlin shrugs. \"I just...think about it, and it happens. I can feel it, the magic. I can't explain it.\" He looks around again. \"Everything here is so...full of life. Full of magic.\"\n\"Magic?\" Arthur frowns. \"It's the woods. There's no magic.\"\n\"Yes there is. I can feel it.\" Merlin cocks his head. \"I think...magic is in everything. Some things more than others. There's magic in you.\"\nArthur stares. \"I have magic?\"\n\"No, I don't think so,\" Merlin muses. \"But there is magic in you. And my magic likes you.\"\n\"Your magic...likes me.\"\nMerlin nods, as if this isn't making Arthur's head spin. \"Maybe it's because we're friends.\"\n\"Maybe,\" Arthur repeats faintly. \"You feel...all that?\"\n\"Don't you?\"\nArthur shakes his head. Merlin looks slightly disappointed.\nShifting closer, Arthur plucks an apple from their spread, biting into it. \"Show me,\" he says. \"Show me everything you can do with your magic.\"\nMerlin beams, eyes lighting up with joy, and Arthur falls in love all over again.\nThey return to the castle in the evening, empty-handed but happy, Merlin looking tired but content. In fact, Arthur isn't sure he's ever seen the real Merlin look so content. There are no lines of stress around this Merlin's eyes, no stiffness to his spine. It's so obvious now, the weight that had rested on Merlin's shoulders. The weight of lies and fear.\nMerlin had seemed to glow, doing magic, experimenting with his power all afternoon as Arthur watched. It was as if he'd scratched an itch, the nervous energy that had surrounded him bleeding off until he was languid and sleepy, yawning every so often with eyes soft and drooping. Back in Arthur's chambers, there hasn't been another incident of accidental magic, and Arthur wonders if letting it out helps Merlin to control it, like pouring off an overflowing cup.\nIf that's so, then no wonder the real Merlin wears tension like a cloak. There aren't many chances to let magic free in Camelot without the risk of someone seeing, and Arthur can't imagine how Merlin must chafe, magic locked away inside him. This Merlin had told him that trying to rein in his magic felt unnatural, like holding one's breath. He told Arthur that letting it out felt like he could breathe again.\nHas Merlin been holding his breath this whole time? Just waiting, waiting to finally be free?\nWhy hadn't Merlin told him?\nHe knows why, of course, but it still hurts. That Merlin doesn't trust him, can't trust him. For when has Arthur ever showed himself worthy of that trust? He has rejected magic, vilified it, persecuted and killed sorcerers without hesitation. He has belittled Merlin, insulted him, treated him without an ounce of respect for all Merlin has done for him. \nHe does not deserve Merlin. \nHe does not deserve Merlin, who makes shapes of glittering water droplets, who touches flowers and brings them back to life, whose magic is beautiful and benign and so unquestionably not evil that Arthur, for all his distrust at the start, had never once felt afraid of Merlin. He has only ever seen magic used before to kill and to maim, to curse; he has seen magic take all he loves from him, and yet the one he loves above all wields the very same magic and uses it for good, to heal and to protect, to provide.\nMagic is like a sword, Arthur thinks, neither good nor evil. It depends on the wielder.\nExcept, no, magic is not like a sword, for what sword can heal? \nArthur mulls this over as he prepares for bed, watching as Merlin flops down on his bed without invitation, limbs sprawled and eyes fluttering closed. Arthur slides in next to him, propping himself on his side as he traces Merlin's profile in the candlelight.\n\"Thank you,\" he murmurs. \nMerlin turns his head slightly, eyes cracking open. \"For what?\"\n\nFor trusting me. For showing me your magic. For showing me who you really are. For protecting me all these years and staying by my side.\n\nInstead of replying, Arthur says, \"I'm going to make magic legal.\"\nMerlin turns on his side, facing Arthur, and scoots closer, until he's scarce inches away, so close Arthur can smell the watered wine on his breath. \n\"I can see why he loves you,\" Merlin says softly.\nArthur blinks. \"What do you mean?\"\nMerlin reaches between them, pressing a hand to Arthur's chest. \"I can tell. My magic, it...it loves you. He loves you.\" \n\"No.\" Arthur shakes his head. \"He doesn't. How could he?\"\nMerlin's lips curve upwards, eyes searching Arthur's face with open tenderness. \"How could he not?\" he whispers. Slowly, hesitantly, he tilts his head, pressing his lips to Arthur's. There is no experience in the kiss, no skill, only warm, dry lips against Arthur's own, bearing down with gentle pressure. Arthur relaxes into the kiss for a few moments before gently pushing Merlin away, regret gnawing at his heart.\n\"No, Merlin,\" he says quietly. \"I won't take advantage of you like this.\"\nA furrow appears in Merlin's brow. \"It's not taking advantage. I want this.\"\n\"If - when you regain your memories, you'll regret this.\"\n\"You don't know that.\"\n\"I do. Just...it's not right. You've no memories, Merlin.\" He knows Merlin probably wants him because Arthur is the only person he knows right now in his limited memory, and because he accepted his magic. Without memories Merlin is impressionable, vulnerable, and Arthur will not take advantage of that to sate his own selfish desires.\nMerlin sighs, but seems to accept Arthur's reasoning, resettling his head on the pillow and not making another move towards Arthur. His lashes flicker with every movement of his eyes, fluttering like moth's wings against his skin, and his lips are as red as Arthur's cloak in the candlelight, soft and plush. Inky strands of hair fall over his forehead, stark against his pale skin, and his eyes are the color of the ocean, deep and blue, flecks of gold before unnoticed swimming in their depths. He looks somehow more than human, as if some Fae creature had borne him instead of a peasant woman with hands roughened by labor. \nHe is magic, Arthur thinks. \nHe falls asleep to the feeling of Merlin's hand still resting on his chest, over his heart. \nWhen Arthur wakes Merlin is curled into him, head tucked under his chin and hands slack against his chest, one leg shoved between Arthur's. His breathing shifts, signaling he is waking, and Arthur blinks sleepily as he tightens his grip on him. \nMerlin's head pops up so suddenly it nearly knocks into Arthur and he stares, wide-eyed, hair sticking up in all directions and making him look crazed. \n\"Arthur?\"\nArthur raises an eyebrow. \"Merlin?\" he mimics.\n\"What am I doing here?\" Merlin sits up, scooting away from Arthur and leaving his side cold. \"What happened?\"\n\"We...went to sleep?\"\n\"Went to sleep?\" Merlin presses a hand to his forehead. \"But we were just hunting, and there was a sorceress...\"\nArthur sits up abruptly. \"You're back!\"\n\"Back? What do you mean back?\"\n\"What's you mother's name?\" Arthur questions. \n\"Hunith,\" Merlin answers, still looking puzzled. \"What did you mean by 'back'?\"\n\"It's you.\" Arthur breathes a sigh of relief, ignoring the small pang of disappointment that comes with it. That Merlin had been open, honest, so easy to talk to. He had been happy.\n\"Of course it's me! What are you going on about?\"\n\"So you don't remember anything after hunting?\"\nMerlin shakes his head. \"No. Why, what happened?\"\nSo Merlin doesn't know that Arthur knows about his magic. He doesn't remember any of it.\nArthur swallows, forcing down his grief. \"Well, it's a long story.\"\nHe doesn't tell Merlin that he knows. Perhaps he should, but he doesn't. He wants Merlin to tell him himself, wants to earn Merlin's trust. He only tells Merlin that he lost his memory for a couple days, and then woke up fine. He doesn't know what ended the spell, as the sorceress is yet to be caught, but he's strangely glad he didn't have to seek out and kill her. Most likely she was only acting out of revenge for the wrongs Arthur has done her, and a memory spell is hardly lethal. \nThe change in Merlin's demeanor is startling now, when compared to his memory-less self. Arthur can see the tension in his shoulders, the hardness in his eyes, the firm set of his mouth, everything he'd noticed but never truly thought about before. He suddenly misses the naive Merlin, misses his easy smile and the way his eyes sparkled, that mischievous glint that's long since faded. That Merlin was happy. That Merlin was unafraid. \nHe wonders how long Merlin has kept the secret of his magic. Was he truly born with it? Or did he learn it, and where? When?\nIt is pure evil, he'd told Merlin, and Merlin had said nothing. Merlin had stayed by his side, protecting him, advising him, being his friend, knowing that Arthur wouldn't accept him. Why? \nHe makes sure to knock his goblet over at breakfast, testing, but no magic leaps to halt it's trajectory down as it bounces on the table, spilling water everywhere. Merlin simply scowls and grabs a rag to mop it up, leaving Arthur in deep contemplation.\nHe wonders when Merlin had learned to control his magic. Otherwise, he would have been found out long ago. \nA thought strikes him. Gaius. Of course. Gaius had practiced magic during the Great Purge. If anyone taught Merlin magic, or at least knew about it, it was him. Luckily for Arthur, Gaius is returning today. He'll have the answers to Arthur's questions.\nIt's not until later that day that Arthur gets a chance to speak to Gaius, once everyone has been assured of Merlin's restoration and Arthur assigns him a long list of chores to hopefully keep him occupied while they talk. He finds the physician making tinctures in his quarters, the room smelling of herbs and steam wafting up happily from a pot over the fire. \n\"Sire,\" Gaius greets. \"What can I do for you?\"\nArthur sits down on one of the benches, twisting his ring on his finger. \"I wanted to speak with you about...magic.\"\nGaius straightens up, setting down his ingredients and wiping his hands on a rag. \"Magic?\"\n\"Yes. I've realized I don't know much about it, and I can hardly make uninformed decisions. I was wondering if you could help me.\"\n\"I could try.\" Gaius sits down across from him, clasping his hands together. \"What do you want to know?\"\n\"Magic takes...spells, right? Practice?\"\n\"Yes. It can take years of study.\"\n\"So it is a choice, then.\"\nGaius wears an expression that Arthur knows to be one that means Gaius is hiding something. \n\"Be honest,\" he says. \"I won't hold anything you say against you.\"\nGaius sighs. \"It is a choice to study magic, to learn spells, but for some magic comes to them whether they want it or not. Morgana's dreams, for instance.\"\n\"Her dreams?\"\n\"She's a Seer. She sees the future in her dreams. She often suffered from nightmares she could do nothing about. Her magic scared her.\"\n\"And you knew.\" It's not a question. \n\"I suspected.\" Gaius sighs again. \"I knew the king would not look favorably on the art of Seeing, so I tried to keep her unaware of her magic. But eventually, she found out.\"\n\"So she didn't choose it.\" It feels like his whole world has been turned upside down, and the only thing Arthur can think is why did no one tell me?\n\"No. Not until later did she start practicing magic. I fear she was already lost to us by then.\"\n\"Because she knew she would be killed for something she couldn't control,\" Arthur murmurs, echoing Merlin. He feels a pang of grief. Perhaps Morgana could have been saved, once, before she became twisted with hatred. He should have known. He should have protected her.\n\"So is it possible for someone to be...born with magic?\" he questions. \"Able to do it well without spells?\"\nGaius stiffens imperceptibly, and Arthur knows he's struck home. Gaius definitely knows about Merlin.\n\"Yes,\" Gaius replies slowly. \"It is...possible, but rare. One would have to possess exceptional magical abilities the like of which I've never seen before.\"\nMerlin, exceptional? Powerful? It's strange, but not as strange as Arthur would have thought. Somehow, it fits. The magic he had seen Merlin do was more than parlor tricks. He had done all of it without a single spell, and Arthur may not know much about magic but he knows that isn't easy.\n\"Thank you, Gaius.\" He stands, heading for the door before pausing. \"One last question, and I want you to be completely honest. I swear, no harm will come to you.\"\nGaius looks wary. \"Yes, sire?\"\n\"What do you think of magic?\"\nGaius is silent a long time, face drawn in contemplation. \"I think,\" he finally says, \"that magic is neither good nor evil. It depends how you use it.\"\nArthur nods. \"I think you may be right, Gaius.\"\nWith that he opens the door and strides through, ignoring Gaius' shocked expression.\n\"I'm lifting the ban on magic,\" Arthur says as he sits at his desk, watching Merlin potter around the room tidying up.\nA plate falls to the floor with a deafening clang.\n\"What?\" Merlin sounds breathless.\n\"I don't believe all magic is evil,\" Arthur continues, as if nothing has happened. \"And not all sorcerers are evil, either. I've persecuted those with magic for far too long.\"\n\"You-but-you-why?\" Merlin stutters, mouth flapping like a fish. \"How? I thought you-I thought-\"\nI thought you hated magic, is what he leaves unsaid.\n\"I've had a change of heart,\" Arthur replies. \"I've realized that my father was wrong. Gaius told me that there are sorcerers that don't choose magic, and I know that magic can be used for good as well as evil.\"\nNone of it is a lie, though he's omitting the real reason for his change of heart. He's realizing now how easy it was for Merlin to lie to him all these years. A little truth, a little misdirection, a little playing the bumbling fool, and Arthur was none the wiser.\nMerlin is gaping at him in shock, something like hope dawning in his eyes. \n\"You're serious,\" he says.\n\"Yes. I am. I don't want those with magic to ever have to live in fear again.\"\nMerlin swallows, and Arthur thinks there is a sheen to his eyes.\n\"That's...\" He swallows again, nods. \"That's..good.\" He bends, picking up the plate he dropped and holding it up. \"I'm going to...um, I just-\"\nArthur nods. \"You're dismissed.\"\nMerlin practically flees the room, the door swinging shut behind him. Arthur lets out a breath.\n \nMagic is legalized a week later, after hours, days facing down irate councilors and debating magical law. He spends hours learning about magic from Gaius, reading pages upon pages of books he piles in front of Arthur, and Gwen joins him, a steady support at his side in the face of opposition. His knights take the news with varying reactions, from disbelief and fear from Leon to nonchalant acceptance from Gwaine. Merlin seems to waver between almost feverishly invested and deeply despondent, guilt written in every line of his face when he looks at Arthur. \nAs Arthur signs the scroll in front of the council, making magic legal, he can almost feel a weight lifting from his heart. Later, when he stands in front of the people, announcing that no longer will magic be persecuted, if feels as if this is what he was meant to do all along. Maybe he was meant to right his father's wrongs. Maybe he was destined to meet Merlin, and fall in love with him, Merlin who is magic itself. \nGaius had told him, in his own evasive way, about Merlin. Emrys, he'd called him, but Arthur knows it can be no one else. Emrys is the most powerful sorcerer ever to walk the earth. He is destined to protect the Once and Future King, and together they will unite the land of Albion and bring back magic. That is what Gaius had said, what the prophecies say. Emrys is the old man apparently, the one who tried to save his father and failed.\nOf course it is Merlin. Merlin who has stood by his side, who has protected him, probably in ways Arthur doesn't even know yet, who has become his most trusted advisor and friend. Merlin who can start fires without a word, whose magic spills out of him in rivers.\nHe had known those eyes were familiar. Dragoon the Great. Only Merlin could have come up with such a ridiculous name.\nThe night after he legalizes magic, as he retires to his chambers, fire crackling merrily and sheets turned down, Merlin approaches with the look of a hunted animal, standing before Arthur with body taught as a bow.\n\"I need to talk to you.\"\nArthur knows what he's going to say. He sits on his bed, patting the space beside him until Merlin sits down with a confused expression. Arthur waits.\n\"I-\" Merlin's voice cracks and he looks down at his hands, which are visibly trembling. \"I have to tell you something.\"\n\"Alright.\" Arthur keeps his voice soft, as if speaking to a spooked horse. \"What is it?\"\n\"I wanted to tell you, but I-I couldn't, because your father would have chopped my head off, or you would have, and then-then it was too late, and I didn't want to lose you, and you hated it and it was all my fault but now you just-you legalized it and you didn't even need me, and I have to tell you but you're going to hate me because I've been lying to you all this time-\"\n\"Merlin.\" Arthur cuts off his rambling, watching as Merlin shakes with suppressed sobs. He turns to him, taking his trembling shoulders in a firm grip as he tries to meet his eyes. \"No harm will come to you here.\"\nMerlin inhales sharply and his eyes flick to Arthur's, searching his gaze. \n\"You-\" he whispers. \"You said that before...\" He takes another breath, eyes filling with tears, and Arthur sees the moment the memories slot into place. \"Oh.\" \n\"Don't you see, Merlin?\" Arthur reaches up to brush away a tear from his cheek. \"I do need you. This is all because of you.\"\n\"You knew,\" Merlin breathes. \"You knew and-and you don't hate me.\"\n\"How could I?\" Arthur echoes. \"I love you.\"\nAnd then Merlin is kissing him, gasping desperately into his mouth as tears dampen their lips, something like magic twining between them. When finally they part, foreheads pressed together and breaths intermingling, Arthur cups Merlin's cheek, feeling the last cracks in his heart mend.\n\"Show me?\" he whispers.\nAnd Merlin smiles.\n "
}