{
    "id": "16230920",
    "url": "https://archiveofourown.org/works/16230920?view_full_work=true",
    "author": [
        "dragongummy"
    ],
    "title": "Withdrawal",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Venom (Movie 2018)"
    ],
    "relationships": [
        "Eddie Brock/Venom Symbiote"
    ],
    "characters": [
        "Venom Symbiote",
        "Eddie Brock"
    ],
    "additional_tags": [
        "Porn with Feelings",
        "Tentacles",
        "Tentacle Sex",
        "Mildly Dubious Consent",
        "Restraints",
        "Suicidal Thoughts",
        "Possessive Behavior",
        "Emotional Hurt/Comfort",
        "Multiple Orgasms",
        "Anal Sex",
        "Rimming",
        "Touch-Starved",
        "Telepathy",
        "Telepathic Bond",
        "Self-Hatred",
        "Praise Kink",
        "Mind Control",
        "Partial Mind Control",
        "Plot What Plot/Porn Without Plot",
        "I mean there are feelings",
        "a lot of this is porn",
        "Sounding",
        "Riding",
        "Subspace",
        "kind of",
        "Gentle Sex",
        "Porn With Plot",
        "Shower Sex",
        "Internalized Homophobia",
        "and Venom ain't having that shit",
        "Intense Sex",
        "Intense Orgasms",
        "Dry Orgasm",
        "Prolonged Symbiote Orgasms"
    ],
    "language": "English",
    "series": "",
    "published": "2018-10-08",
    "completed": "2018-10-19",
    "words": "9,783",
    "chapters": "3/3",
    "comments": "559",
    "kudos": "18,575",
    "bookmarks": "2,760",
    "hits": "338,919",
    "summary": "<p>Eddie tries to convince himself that it is something they don't want or need. He fails.</p>\n<p>Update: August 2021. So I went back and reread this and added about 1.5k more words worth of porn throughout the chapters. Mostly on Chapter 2 because the flow of it when reading was least satisfying to me. If you're someone who goes back to reread, you're in for a few surprises!</p>\n<p>In a rush, the memories of the previous night flood back. He's embarrassed. Oh, he's embarrassed all right. But he can't hide. Not from Venom. Who's hunger for him has become insatiable. Matched by Eddie's denial of wanting to give in completely.</p>\n<p>Eddie doesn't want to hear the sweet words Venom says; they hurt. They've always hurt. Venom knows.</p>",
    "notes": "<p>.......OK BUT DID YAL SEE THE MOVIE<br>omfg *hands folded on desk*<br>\"You are mine.\" *SCREAMS INTERNALLY* *EYES LIKE O___O IN THE THEATER BECAUSE WOAH I WAS NOT EXPECTING THAT, FAM*<br>Also he saved Eddie no less than like 25 times and they are a married couple and Venom is possessive as fuck and no one can convince me otherwise *out of breath*<br>I just needed to write porn immediately, sorry<br>ok enjoy</p>\n<p>Here we go. Per heavy request, I'm going to attempt to continue this. Yal realize this is just smut af? Like, a teeny TEEEENY bit of feelings but MOSTLY porn? Cause if that's the content yal signed up for THATS WHAT IM HERE TO DELIVER</p>\n<p>sitting here with a bag of skittles in my lap and my leopard gecko on my shoulder like the hoe I am<br>it's 3:20am<br>fuck sleep<br>ship Eddie and Venom<br>I'm running for Senate<br>enjoy</p>\n<p>LOL WHOOPS I WROTE ANOTHER ONE<br>fuck</p>\n<p>Different format from the first two chapters. But, still porn. Don't think I'd gone all soft (pun intended) on yal now.</p>\n<p>(Btw its currently 4:43am and I'm watching/listening to the director's commentary of Tom Hardy's Locke with my lava lamp on and I'm wrapped in 2 fuzzy comforters. Loner's lifestyle, man.)</p>\n<p>**I know in the movie that Eddie was a chaotic bisexual XD but I took a different liberty here creatively that Venom was the first experience with \"gay sex/gay acts\" that he's had (he sees Venom is a male).**</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>who am i</p>",
    "text": "There's a lot of things Eddie hasn't been able to do since Venom. That's all his life can be broken down to now; pre-Venom and post-Venom. He can't shower like he used to. The familiar press of Venom's curiousity blooming in his mind as he washes his body. He hasn't even considered masturbation. Though the thought pops up naturally from time to time and even though Venom never says anything, there's a hunger there. A deep seeded hunger that radiates from Venom that Eddie tries to shut out completely. He can't sleep like he used to either. He's been having dreams. Not every night, but often enough. Filled with swirling black tendrils and the feeling of safety. Echoed words in Venom's deep, all encompassing voice.\n \n\n\"You did not find us. We found you.\"\n\n \n\"I am Venom. And you are mine.\"\n \nHis. Venom told him that the very first night he showed himself and the words replay in his head when he feels sad. Whenever he feels lonely. A dark, dark pit settles in his stomach. He swallows it down when it threatens to travel up his throat. He wakes from these dreams with Venom's corporeal form wrapped around his body. Tight around the backs of his knees and the insides of his thighs. Under his arms and across his chest. Possessive. Venom stirs the moment he does, but he never moves. He caresses Eddie's body to calm him, pleasant chills traveling up his spine at the attention. Every time.  He's content with squeezing around Eddie's back to get closer still, which isn't possible, but Venom tries. He feels a safety with Venom he's never had with anyone else. The warmth of the realization fills him with emotion. Maybe because Eddie knows somewhere in the back of his mind that Venom can see his dreams, can feel what Eddie needs even though Eddie can't ask for it.\n \n- - - - - \nHe just wanted a few drinks. He had no intentions of talking to anyone. Watch the game, maybe. On his fourth beer, the familiar swirl of pleasant heat rocks his body to let him know he should stop soon. One more, he thinks. There's a flash of unease about something before it happens, so Eddie is at least a little prepared when a man slides down to sit next to him at the bar. Venom is watching. The man raises a finger at the bartender and in a few moments he's slid a drink across the counter. \n\"Another one for him, too.\" Eddie hasnt realized his beer is almost gone before it's taken from his hand and his fifth of the night is pushed into his fingers. Eddie looks up at the man over the top of the mouth of the beer bottle. He's nice looking. Dark haired. Not quite as drunk as Eddie feels. Dressed in a suit. He's had men hit on him before. It still makes him flush; men are usually more direct about their attraction. They make it more obvious about what they want from him, looking at his lips and ass.\n\"Anyone told you what you're pretty?\" His gut flips at the compliment. \"I mean, you're masculine and all that, but-\" Eddie watches the man look over his frame before his confident gaze rests back up to his face. \"But you're really pretty.\"\nEddie. He can feel the blistering heated anger from under his skin. It rises up to settle tight in his chest. Eddie squeezes his eyes shut. He opens them and finds the man is waiting for him to answer, head tilted.\n\"One or twice, yeah.\" He supplies. Fuck, he'd just wanted to drink alone. He should have just bought a pack of beer at the store and-\nThe man shifts closer until they're touching, his mouth pressed against Eddie's ear. A hand grips the small of his back and pulls his crotch almost onto the man's lap. Despite his discomfort, the starts of arousal prickle the edges of his vision. To be desired is...\nThe man nips at his neck. Just once, but Eddie bites down on the inside of his cheek against the shudder that threatens to rack his body. It's been so long. Eddie has kissed men at clubs before too, when he's too drunk and unguarded. He tells them he's straight and they just smile and kiss him some more. Eddie wonders how good it would feel to kiss this stranger who so clearly wants him.\nEddie. Venom is bristling, like a cat with its back raised. Eddie puts his hand on the man's chest. Moreso to get distance between their bodies but the man takes it as encouragment.\n\"Come on, pretty. Let me take you home. You deserve,\" a wet swipe of tongue along his pulse, \"a good fucking.\"\nNo. It sounds like a command. Definitive. An answer that you can't respond to. Possessive. \n\nBut-\n\nNo. Eddie doesn't know how to tell Venom it's been a long time since he's had this, since he's let someone give him pleasure. The man was clearly interested. It's been since before Anne, since he was the one who...he really just wanted...\nBut he doesn't have to explain anything to Venom because he's thinking all these things and Venom knows because he's inside him, he's listening and he knows what Eddie needs. He knows. No sooner are these thoughts all jumbled together that he feels a rumble at the base of his spine.\nYou are mine.\nThe rumble travels up and down his back like an invisible tongue and Eddie holds back a sound at the sensation. \n\"I'm in a relationship,\" he whispers. The man doesn't seem bothered. He just nuzzles his face into the bunched up clothe of Eddie's hoodie. He bites the skin of his neck again.\n\"Well I don't see them here,\" he responds. Eddie feels lightheaded and Venom only sends through a single warning before taking control. Thankfully, he still used Eddie's voice as opposed to his own.\n\"He is here. He's watching you.\" And that was that, Venom gives Eddie control back as easily as he had taken it and the man backs away from him with his hands raised. Eddie puts a few bills on the counter and manages to leave the bar and get into the open air. The coolness takes the edge off a little from his flaring arousal. It frightens him; this feeling. The bar isn't that far from his apartment and he walks with rockets on his heels along the sidewalk. He feels exposed. He just wants to go to sleep. Venom is uncharacteristically quiet but he can feel the thrumming of the symbiote's anticipation sitting in his stomach. Eddie doesn't know what he anticipates. \nWe want to touch you. He freezes. His heart is hammering against his ribs. He's drunk. He's hearing things. There's no way that-\nI want it. Eddie shakes his head. The lights above him on the posts are shining in and out of focus. Eddie can't let that happen. He can't. Once it does; if Eddie lets that happen, then...\nYou won't be able to live without my touch again. Eddie grits his teeth. Venom is everywhere in his mind, all consuming. He's scared, he's turned on. Shame rises and rests in his cheeks and he clenches his fists in his pockets so hard that it hurts. He forces himself into a near run. Almost home. \n- - -\nHe runs the shower the second he gets home. Scalding. Hot enough to almost burn, but they're the showers Eddie likes best. Pleasure rolls through him when he dips his head under the spray as the heat envelopes his body. The chill from the night leaves him in waves and he sighs against the shower wall. His erection hasn't flagged. Eddie ignores it and reaches for the soap to wash with. \nEddie. He jumps and almost falls backwards before catching himself by bracing both of his hands on the wall in front of him. His cock twitches.\n\"Stop saying my name,\" he breathes pathetically. He turns around so his back is against the cool tile and the hot spray down his front.\nYou like it. Said so matter-of-fact like, like what they were doing wasn't skirting the edge of something else. The familiar ripple extends from his shoulder and Venom's face comes into view. Eddie swallows as he watches his tongue slide over his teeth. His head bobs a little as he starts to speak.\nTouch yourself. Or I will. His milky eyes narrow as if he knows what Eddie is about to say. Maybe he does.\n\"I don't need to,\" he lies. He knows he's lying which means Venom knows he's lying. Venom doesn't like it when he lies to him; he takes it personal. Like when Eddie called him a parasite. He understands the meaning of jokes more now, but that first time he was aggressive. Dangerous. \nIf you won't, then- Eddie can't let that happen, he can't let it boil over to that. So he grabs his cock in his hand and his stomach clenches from the neglected touch. It's been so long. Besides holding himself to piss, he'd not touched himself. Venom is watching him closely. The skin around his mouth shifts with his teeth and Eddie has to close his eyes. But when he closes them he sees what Venom sees. Sees that Venom is looking at all of him, seeing his whole self and not just one part. His parted lips. His eyes screwed shut. The muscle of his thighs. The 'V' of his hips. His hand on his cock. The pounding of his heart. It's too much so he opens his eyes again.\nVenom waits. Patient. Eddie's hand shakes as he starts to stroke himself. He tries to keep his mind empty, tries to imagine a wall or a fence to block out any desires he may have. That Venom could see. Venom knows what he's trying to do but he still says nothing. It's only a matter of time, probably. Sounds threaten to escape and he swallows them down, embarrassment coloring his cheeks. Sharp irritation cuts through his haze of bliss.\nThere's suddenly a huge, strong hand over his hip and the fingers curl around his back. Eddie jumps and turns his head to see one of Venom's arms has emerged from the skin of his ribs to hold him. There's several other thin, black tendrils snaking out around them both and Eddie's hand stops. The fingers on his back lightly scratch at the skin there. Eddie can't stop the shudder this time.\nYou're quiet, Eddie. Eddie swallows and grits his teeth. He tries. He tries hard to stop the onslaught of negative thoughts but they pour out like a water toppling over the top of a glass. Inevitable. Logically Eddie knows Venom can't want this. He only does because Eddie does. Because he is Eddie and Eddie is him, whatever. Otherwise why would he? He's using Venom like he uses everyone else in his life. Maybe if he just waited until Venom entered into his sleep mode. He could just pop open his bottle of sleeping pills and simply wake up tomorrow and not do this. He could to it every night. \nThe hand that's not on his cock is jerked above his head with a power Eddie is all but used to by now. The fear is back and he wants to sink to the ground and fold in on himself but he's held up by Venom. He's always holding him up, the only thing that can hold him up. Eddie doesn't know if what he feels is gratefulness or resentment for it, that Venom decided to stay with him. To be with him. To learn about him in his mind and find out everything he loves. Everything he fears. To go looking for his weaknesses so obviously. He can feel Venom shuffling around up there sometimes, searching for information.\nWhen his hand moves over his cock without him, he bites his tongue. Looks down and sees black veins ghosting over his skin to let him know he's no longer in control. When a very thin, slick apendage sinks into him from behind without any warning Eddie's back arches. He almost doesn't feel it because it's so small, but Venom makes its presence known by exploring and seeking.\nIt doesn't hurt, quite the opposite and Eddie's lower lip trembles when he realizes he can't stop the sound that escapes him. It swells inside him slowly, pushing deeper into his body. Venom's satisfaction vibrates through him, even more so when that fullness in his ass pushes against that spot that makes his body shake. The initial firm press has Eddie clenching down against the pleasure of it. He drops his head to his chest. Venom allows him to for only a moment before the hand wrapped around his waist travels to his chin to lift his face back up.\nYes. Like this. Eddie is already so close, he won't be able to last long. He whimpers into the air between them and a possessiveness roars through Eddie's body that he realizes belongs to Venom. Belongs to them both. The slide inside him is languid and precise. The intensity of it continues to push sounds out of Eddie in choked off gasps like he's in pain. There's a pressure behind his balls that Venom pushes against with another swollen tentacle and Eddie's eyes roll back in his head.\nYou are so tight around me. Does this feel good? He asks as if he doesn't know, as if he isn't aware of everything he's feeling. Because Venom knows what to do to pull him apart, knows where to push to break through. The point puncuated by deep, gliding presses against his prostate and Eddie is hanging over the edge. Once he starts making sounds, he can't stop, and he sobs into the side of Venom's face which has moved to be close to his.\n\"Venom-\" he pleads. He's panting, writhing against the wall. The warm water tingles against his chest. He's asking for something but Venom wants him to say it outloud.\nEddie. Tell me. Eddie can only show him and it's a start. Venom accepts it as an answer. He's pushed hard against the shower wall; hard enough that his back creaks in protest. Venom hikes up his body until his feet leave the floor. His bare legs drape over with Venom's blackness and his legs are spread by Venom to accompany more of his corporeal body. His other arm joins the one already over his head and when Venom's own form encases his dick in slick, too perfect heat, Eddie's back arches. Involuntarily. And Venom fucks him with that same fullness. Hands are clamping over Eddie's thighs, holding him against Venom's body as Eddie is taken over the edge. His legs jerk, his arms fight the hold and Venom finally takes his mouth with his. Tongue sliding into his mouth and claiming it in a way no one else has as he cums. Venom's body seems to be sucking his release straight from his cock, the suction making his hips stutter with what little room Venom lets him move. There is no space between their bodies; Eddie's legs are spread and pulled tight against Venom's sides and their chests touch as Eddie arches and writhes. Venom doesn't slow, doesn't relent as he swallows Eddie's screams with his tongue like it's the last time he can have them. His orgasm goes long past anything Eddie's ever experienced and his toes curl and the heat in his gut spreads through his body until he can't breathe.\nHe's being wrung dry inside too, Venom stroking him, fucking him, against his prostate even as he tightens. Twisting and coaxing pleasure out of his body in ways he's never experienced. He pulls away when the pleasure doesn't stop, shaking and panting against the waves of ecstasy. But Venom is fucking him so good, keeping him at that peak and prolonging it. Slowly letting Eddie experience it, be selfish with it and still desire to give him more. Venom wants Eddie to cry with it. He wants Eddie to shake and spasm around him. He wants to feel the pulsing of his body as he releases. He wants to see how much Eddie is scared to feel when he rides Eddie through it, punishing and surgical. Eddie knows because he sees it. He feels it all. Another pathetic sound is pulled from his throat at the deep thrusts against his insides and his head drops against the shower wall behind him.\nThere's a large hand behind his head, pulling him back into the kiss, holding him close as he cries the remains of his euphoria into Venom's mouth.\nHe sags against Venom's body, gasping for air when his mouth is finally released. He's held like a child, and he's vaguely aware of being set down in his bed.\nI like you like this. This is what you deserve. Your body is perfect for me, Eddie. Only for me. You were made for me. He's on his back, he can't move. There are powerful arms wrapping around his thighs again and something slips back into his body.\nMy tongue, Venom supplies. Again. I want to see it again. It doesn't take as long as Eddie thinks, but then again he's not thinking much. His whole body is thrumming with electricity, pleasure rushing under his skin and across his nerves. Venom finds the spot deep within him in moments. Eddie arches. He's reduced to high pitched sounds and he can't stop shaking. Venom's arms flex around his legs when he fights the hold, keeping him steady. The possessiveness of the notion loosens his body enough that he acutely feels the twisting of a tongue in his gut. Something is rushing hot and fast. Something new he's never felt before.\n\"Stop-\" That fear is back, the fear of the unknown. The loss of control and vulnerability. Venom feels it but guides him on, recognizing the emotions Eddie is experiencing but also the pleasure his body is cresting towards. He deems the pleasure greater.\nDon't be scared, Eddie. Release for me. Eddie's head tips back at the words and his first dry orgasm rushes into him fast. He chokes on the intensity, body jerking. His dick is pulsing but remains erect, even when Venom wraps tendrils around it to milk him for all he's worth. Eddie's legs are rigid as he trembles through it. Eddie twists on the sheets when the tongue pushes deeper, flexes and rides him hard. Uncoordinated, he reaches down and puts his hand on Venom's head and pushes while the white rush envelopes his nerves. He has goosebumps all over and tears slide down the side of his face. Venom likes that. The tears that stain his cheeks. The fear Eddie feels because Venom knows Eddie is experiencing a pleasure he's never felt before. The way his body pulses and shivers. Eddie feels satiated. So warm. Another shorter but stronger wave of it hits him and his back goes ramrod straight. Venom melts closer to him, pushes deeper inside him. Twisting his tongue like a corkscrew until Eddie's moans break into high pitched puffs of air. Venom massages his calves to settle him while he continues his relentless pace, the pure strength of his tongue forcing into his body as it tightens. It pushes past the resistance of his orgasm to that place that elevates his pleasure. When his tongue is thick enough and deep enough to milk him dry inside.\nPretty. Pretty. Pretty. Pretty. Venom chants it over and over to him. Until more tears leak from his eyes. Until his body is clenching down again too soon. He chases the feeling blindly with his hips. The fear is clenched in his chest again and he can feel it in his throat. But Venom is with him. Aggressively pulling his hips down onto his tongue, frenzied by the endorphins and Eddie's state. Eddie can only lay there with an open mouth and his fists clenched in the pillow above his head. Venom wants him to beg. He wants Eddie to say it.\n\"Ve-\" The bed is squeaking with the force of Venom's thrusts and the way he's still being pulled to meet them. Venoms clawed hands are wrapped around his back and waist, leaving no room for imagination. Venom is enjoying Eddie's pleasure. If Eddie wasn't too for gone to be chasing the pleasure with his hips, Venom would be making him. Like a cocksleeve, except Venom wants to be used. Wants Eddie to use him for pleasure.\nTell me. Let me, Eddie. Let me. I want to. Tell me. Eddie isn't even in his right mind anymore, his entire body is quivering. He doesn't have the capacity to feel shame. He just feels safe and loved.\n\"F-\" He arches against the swell of Venom's tongue. \"Fuck me through it.\" And that's all it takes, Eddie is cumming properly again on Venom's tongue. Venom howls with delight, pulling Eddie closer. Forcing his tongue deeper and deeper while flicking the tip against places inside him no other being can reach. Eddie can feel the prick of teeth against his skin and doesn't need to look down to know how close Venom is. He can't cover his mouth like he vaguely wants to; the sounds erupting from him will be embarrassing tomorrow when he sleeps this off. Venom moves into him through the contracting of his orgasm and Eddie feels the affection pouring from Venom, pouring from them both as he fades out.\n \n- - - - - \n \nEddie wakes in the middle of the night. His mind is fuzzy, his body is heavy. There's a tightening around him, around his back and legs and chest and Eddie makes a small sound.\n\nSleep.\n\n \nHe doesn't dream.\nWhen Eddie wakes, it's slowly. One eye at a time, squinting. Like he just came out of a four hour showing of Phantom of the Opera in the darkest theater on the globe. He makes a sound when he feels how heavy is body is compared to how light his mind feels. Endorphins. Eddie reaches for his phone resting by his head to check the time. \n \n\n10:41am\n\n \nEddie blinks twice; he hasn't slept in like this in a long time. Since Anne. Good thing he doesn't really have a job right now that he could be late to. Not until noon, anyway. He tosses his phone back up by his pillow, and no sooner has it hit the bed that Eddie is aware there are small black tendrils wrapped around his wrists. Wrapped around his legs and waist. All at once he's conscious of the light pressure around his neck and-\nAround his cock. His hard morning cock. Underneath his balls and curving the lines of his back and ass. He's still naked from...from...\nIn a rush, the memories of the previous night flood back. He's embarrassed. Oh, he's embarrassed all right. The noises he'd made, the expressions that openly melted on his face as he came and Venom showing him what he looked like through his eyes. Up against his shower wall, Venom's tongue on his neck, his legs shaking as Venom ripped pleasure from him. Venom fucked him with his tongue, holy shit. Eddie's face heats up, his heart skips a beat. His dick jumps. Holy shit.\nEddie's teeth clench involuntarily as he senses that Venom is coming out of his stasis, awareness starting to crack open. Eddie isn't ready to have this converstation, any conversation about what happened or about what Venom might need from him now. Because Venom will need more from him. They can't go back after last night. Eddie knows this. Venom senses his fear immediately as he feels it and his attention zones in on him completely, the hold around his body, around his dick, tightening. A dominating action Eddie isn't sure Venom is aware of. Or maybe he is. The pressure of it makes his eyes close for a moment. He fights the heat already rising in his stomach. The possessiveness of it...\nEddie. But Eddie doesn't have any words to offer him, no thoughts to share except fear and shame and self loathing. Venom is confused, the onslaught of conflicting emotions engulfing them both. He sends through feelings of affection back to Eddie and as much as Eddie wants to volley them away, that affection so genuine in it's effort to comfort him that he sighs into Venom's hold.\nDon't be afraid of us. We would never hurt you. No, not Venom. It's Eddie. With all his flaws and his mistakes (Eddie feels Venom's tongue trail hotly against his chest in denial of his thoughts). It's not Venom. Venom is perfect, Venom gives him everything he asks for. So gentle with him, so loving. It's Eddie. His buried insecurities that he supposes every human has. The ones that surface when someone gets too close.\nYou need it again. Venom becomes immediately aware of Eddie's hard cock, the fixation Eddie has of the tentacles wrapped around his ass. Venom squeezes the globes hard, massaging the outside muscle. Eddie exhales.\n\"It's something that happens in the morning. Blood rushes there. You've noticed it before.\" Venom listens, but with a distracted focus. Despite his own words Eddie feels the hunger coming back. Venom hums.\nYou need it again, Eddie. Thats the only warning he gets. Venom doesn't ask for any more explicit permission as he suddenly pushes into Eddie with a thin tentacle that he can feel leak out from his back. Venom forms behind him as he's pushed onto his side. There's a clawed hand that wraps around over the entire expanse of his stomach while another lifts his leg higher. Eddie muffles his cry into the side of the pillow from the feeling even as Venom shows him flashes of last night. Just like then, he expands inside Eddie, going straight to the place that gives him the most pleasure. He pushes insistantly against his prostate until Eddie's body squeezes down on him.\nThis spot makes you weak. When you clench down like this, that means you're feeling good. It means Eddie is happy. We like that. Eddie groans at that, shuddering as he feels the familiar arm on his stomach snake around his chest to hold him close to Venom's solid form. More images stream through Eddie's mind of his head thrown back, those arms holding his thighs open as Venom fucks into him with his tongue-\n\"I have to get ready for work,\" he tries. A pause. Then Venom is moving inside him, against the spot deep within where he needs it most. He's peaking fast and the force of the build up makes Eddie jerk his hand down to grab at his leaking cock. Barely has his fingertip touched it that it's wrenched away. Venom traps it underneath his own arm around Eddie's chest. It won't budge.\nIt's us or not at all, Eddie. Eddie drops his head back in exasperation and Venom runs loose tentacles along the muscles at his neck.\nOnly us. Venom fucks the thoughts from his head, the words from his mouth. Eddie needs Venom to touch his cock, and in the span of a breath he's there. He holds Eddie in his hand, the texture of his form working him in waves up and down his shaft. His mouth falls open and Venom's tongue slips inside. Traces his teeth and the roof of his mouth. Under his tongue and the back of his throat. The intense sensation when Venom's tongue runs along the top of his mouth keeps him there. Fixated on Eddie's squirming. The pleasant tickle Eddie feels when he strokes hot and wet over the hard palate. How it feeds straight into his arousal. Eddie's toes curl, he arches up against the onslaught. He doesn't know how Venom is managing to move inside him the way he is when he can feel his own pelvic wall clamping down so tightly onto him. \nEddie is happy. Eddie is happy. The arm pressed to his own chest by Venom's arm pulls him even closer and Eddie could swear something close to fingers wrap through his own. Eddie is going to cum, he's going to-\nYesssssss, Eddieeeeeeee. He feels Venom's joy and satisfaction as he does; into Venom's hand that's holding him tight. Venom prevents him from moving any more than small jerks of his hips to ensure that he stays where he is. To ensure that he gives Eddie the most pleasure he can by keeping him still. He hears himself crying out, but the ringing in his ears overpowers it as the movement inside him remains consistant and focussed. He gasps for air, his head tilting back as he sucks it in. He can only center his attention long enough to see that Venom is looking down at him, towering over him, and Eddie feels so small. So perplexed that he's being given something like this.\nAs he comes down, Venom remains inside him, gently rocking. It only serves to make his aftershocks more intense; he shudders as they come and go along his tense muscles. Venom is ruining him, he's ruining him; he'll never be able to feel like this with anyone else. Venom purrs. He can feel the sound through his back. He rocks and rocks into Eddie through the shaking. Through the overstimulation. Until the overstimulation passes and the rocking just feels like pleasant warmth.\nOnly with me, Eddie. That tone of ownership is back again, and even when Venom finally slips out of him, a hand remains wrapped around his hip.\nEddie shudders.\n \n- - - - -\nAfter that morning it's like Venom can't have enough of him. Eddie showers and Venom has to have him against the wall. Pushes into him while he washes his legs, makes him scream against the tile. Bends him over the table after breakfast, knocking everything off the counter and fucks Eddie with his tongue until he drools on the table's hardwood surface. Leads him into bathroom stalls while he's at work or out in public when Venom can't wait any longer.\nWe need you now, Eddie. That first time in public he pushed him down to sit on the toilet and slides a thin tendril deep into the tip of his dick and plunges it down, down into him to block his release. The feeling is alien and Eddie doubles over but it doesn't hurt and Venom thrills in the way Eddie's body reacts. Alternating between trying to push out the intrusion and relaxing to let Venom thrust as deep into his dick as he wants. And Eddie cums like that, except he can't with the tendril there and he jerks and cries through a full body dry orgasm. Venom fucks him through his ass and through his dick until he begs. Panting against the stall wall, Venom's knee between his legs the only thing keeping him from collapsing. He sits on that leg at some point after he has his second dry orgasm and his legs give out while he twitches through it. Venom milks his insides relentlessly, pushing himself thicker, deeper inside in between his pulses of release.\nEddie's body contracts weakly around the intrusion, sitting on Venom's leg and staring with an open mouth at the slitted white eyes above him. Venom is slowly nodding at him, encouraging his pleasure.\nWe can make it better. Eddie doesn't respond, so Venom acts. The hot-cold rush under his skin is momentary. Then his body is clamping down harder, too sudden, and another dry orgasm is forced on his body. Only it's more intense than his second. Venom forces his insides to squeeze harder, to become wetter to accommodate Venom's hunger for his euphoria. \nNeed to milk you. Venom does. Vibrates the tendril inside his dick to match his release. Pushes it deeper into him so the tip can ride on his prostate from the other side. Large hands wrap around his hips, hold him in place on Venom's leg, rocking him on the tentacle in his ass as the wetness Venom has created eases the way for his thrusting. Eddie doubles over from the sensations. He can feel himself drooling, can hear the satisfied rumble Venom releases when Eddie's body constricts around him in a particular brutal contraction of his walls. His body is so overloaded with tension from his orgasms that it's like it wants to push Venom out for good this time, but Venom chuckles and pushes. And pushes. Pushes further inside instead, muscling deeper in between another shuddering pulse of his orgasm when his body isn't as tight and slides thick and deep, thrusting shallowly. \nDeeper, Eddie? He'll break him. Eddie shakes his head. It's not possible. Yet...deeper, deeper. Until Eddie cries, until his sobs are caught in his chest. Venom claims his mouth and Eddie almost bites his tongue from shaking so much. Venom is content only pulling out an inch or two before thrusting back in, satiated with remaining this deep seated inside.\nEddie looks down and it's not a tentacle anymore. It's positioned in between Venom's legs and it's a dick now.  Long, black and thick. Holy shit; Venom has made himself a dick to fuck him with. Eddie feels impaled, head finally falling back again when Venom pistons shallowly into his body. His thighs flex against the heat in his groin as it builds and Venom's mouth opens wide in satisfaction, holding Eddie down onto him now without moving. Eddie's body starts to clench and that brief swell of fear bubbles in his chest. He's never had an orgasm like this, held open and held down onto an impossibly thick cock nestled as deep as humanly possible. It's so good that Venom can milk him without even moving-\nThicker? Venom starts to swell and Eddie cums again. Hard. Thats all the cue Venom needs. The moment his body starts to clench through the start of yet another dry orgasm, Venom moves again. Fucks him with shallow thrusts, holding his legs open and immobile to make him take it. Eddie's head hits the wall behind him as he convulses through it, Venom following to keep their mouths connected. Venom rests his tongue on top of Eddie's to prevent him from biting his own. \nVenom loves it. Chants his name like it's all he knows when he finally withdraws the intrusion from inside his dick and allows Eddie to cum properly. He does so almost violently onto the floor. Tears slide down his cheeks when Venom pushes against one of his thighs to hold his legs wider apart to accommodate his thrusts. His legs shake as Venom fucks more cum out of him with every perfect thrust against that warmth inside him. Pulses landing on his stomach in time with each slam against his prostate. Eddie can barely take enough air in to breathe without sobbing.\nWe like to fuck you through it. You like it too, Eddie. We can tell you've never felt pleasure like this before. Eddie can only cry. Held open and vulnerable.\n \n- - - - - \nInsatiable, he waits until Eddie lies in bed to sleep before draping over him completely, entering him through his ass and his dick and his mouth, blinding him with pleasure as he cums again and again and again until he finally falls asleep from exertion. Some nights Venom doesn't stop even when he passes out, and those nights his body (or Venom) will wake him to an earth shattering orgasm that Venom has been working his unconscious body to. Venom has his tongue down Eddie's throat for these because Eddie is always taken off guard by them. He's sleepy and feels a strange sense of intimate vulnerablility from being woken up to that intense pleasure. It makes him loud, and Venom wants those sounds to belong only to him.\nYet Eddie can tell Venom wants something from him. He's not quite as good at reading Venom as Venom is at reading him. But he can sense it. The hunger is there, the want for Eddie's body is there. He pushes against Eddie's mind during their intimacy and Eddie can feel something.\n- - - - -\nWe want you do something for us. Eddie knew it was coming. It has been for weeks. He can't say no, he's too far in. They're too deep into this. He can't deny Venom. Eddie is sitting on his bed and he scratches his neck.\n\"Okay, bud. As long as it's nothing too crazy. I don't like heights though, so if it's something like suspending from a pole, you can fuck off.\" Tenderness floods from Venom. He can sense the sarcasm and see Eddie's willingness to please him underneath. Eddie feels his cheeks burn.\nHe feels himself lifting off the mattress and he has to balance by pressing a palm flat to the sheets. He looks down  and sees most of Venom's form shaping there. The bed creaks with their combined weight. A sound like bubbles, then Eddie feels the heat of a formed dick against his naked ass. Eddie grips the skin of his own thighs.\nFace us. Legs on either side. Eddie's heart picks up. He does what he's told and swallows the knot in his throat. Venom wants Eddie to ride him. His milky, slitted eyes shine. It was a desire that he kept deep, deep down. Something he thought about once in a while but tried to keep it hidden. The fear was irrational, it was a common position. But he'd wanted it and was scared to want it. To sit in Venom's lap with his dick up his ass. To shake apart.\nWe want this because Eddie wants this. We need it because Eddie needs it. It all sounds so simple when he says it like that. But it wasn't. This was all very, very complicated.\nEddie is happy when we are inside him. We are happy. Eddie makes pretty sounds, pretty faces. We like it. He gasps as Venom lifts him up, presses into him with a much, much smaller version of what was bumping against his ass a moment ago. Venom's hands are on either of his ass cheeks. He kneads the skin there as the now recognizable feeling of Venom growing inside him floods his senses. Expands inside him until the self modulated dick is resting against that spot that sets him on fire. He's fully seated on Venom, his dick is already coming to life at the intimacy of the moment. He can't start shaking now, they haven't even begun, but Eddie does. He can't help it. The stretch continues until Eddie's body tells Venom it satisfies him. It's a connection that no one can have with anyone else. Only he and Venom.\nMove. Venom has never let Eddie set his own pace before. He freezes. Venom waits. Always so patient with him. The first drop of his hips has his back in a sharp arch. It feels good. Too good. Buzzing under his skin through his dick and up his ass. The feeling travels up his back to his eyes. He bucks up again and realizes that he won't last long. Not like this. Venom grips his ass harder. His body tightens around Venom in response.\nDoes it feel good, Eddie? There's a sudden press of something against the tip of his dick. It's a touch he now knows well. Eddie clenches his fists on Venom's chest. He nods his head, opening his mouth in a silent plea.\nStick your tongue out. He does, and only then does Venom tilt his head forward and slide his tongue in. His tongue still hangs out of his mouth, and Venom moves his tongue like a mock dick along his teeth and down his throat. Drool trails down his chin and falls between them and Eddie's eyes roll back. His orgasm is careening towards him like a train.\nSo good, Eddie. The tendril finally presses, slides, pushes down into his dick. Rests at the base, nuzzling against the muscles inside that rushes him to orgasm rough and fast. But his release has nowhere to go, nowhere to escape. Eddie yells. High pitched. Wet. Venom hums. His dry orgasm is slowly pulled from him. Venom's tongue strokes the sides of his throat, his dick milks his insides and the tendril pulsing in his dick rides him higher. His thighs are clamped to Venom's sides as he trembles through it. Eddie can only move his hips back and forth; he doesn't have the strength to lift himself up like this, but Venom seems not to mind. Contentment surges his system from Venom's mind to his.\n\nMove your hips in circles on us, Eddie. In circles. \n\nJust came, he speaks brokenly in his mind. Can't move, it's too good.\nYes, can still feel you releasing. Your insides are pulsing. Move your hips, Eddie. He tries. Euphoria up and down his spine. He realizes Venom is right, he's still releasing, the peak maintaining its intensity and the thin tentacle still nestled deep in his dick. He's had dry orgasms before, but this is different. More intense. Prolonged. Uncontrollable. Vulnerable.\nYes, want you vulnerable. We are keeping you where we want you. Eddie shudders at the admission from Venom, pulsating again around the length inside him. He tries to swivel his hips, dropping his gaze to Venom beneath him. Venom has always been hard to read, but when he looks down, Venom is nodding. Encouraging him. Eddie's hips falter at the sight, he can't even do the simple things Venom wants him to do. Venom's tongue pulls from his mouth to caress his face.\nGently, oh so gently, Venom's places his hands on Eddie's hips and rocks Eddie on top of him. Eddie keens, he writhes. He gasps. Shouts. His thighs are cramping as sweat is pouring down his body.\nWe want to give this to you. Venom wraps himself around Eddie's legs and up his hips, lifting Eddie up and dropping him down. We want you to take it. Venom has Eddie riding him slow and steady, engulfing him in a kind of ecstasy that makes breathing difficult. He'd fantasized about riding Venom. He'd wanted this so much. Venom was giving it to him.\nYessss, Eddie. The thrusts become deeper, the roll of Venom's hips honey to his insides, working his prostate so good, fucking him so fucking good.\nEddie. He focuses on Venom's face.\nTake it. He can only shut his eyes and let Venom manipulate him where he wants, where Eddie wants, and after a few minutes of near unbearable vulnerability does Eddie break.\n\"V-V-Vennomm,\" he pants. \"Cum. L-Let me...\" Eddie's toes curl, his insides are molten lava and his head drops back.\nTongue out, Eddie. He does, and Venoms own tongue finds it's home again. Then his dick is free, he's cumming so violently that Venom has to hold him tight to his body as he fucks up into him. They are chest to chest as Eddie spasms, Venom's tongue deep down his throat to catch and drink his screams. Eddie's tongue hugs the bottom of Venom's uselessly past his lips. He likes fucking Eddie like this. Waits until he's topling over the edge before taking him fast and hard. Fucks up into his convulsing body while it throbs through an orgasm. Pounding his prostate into shooting rope after rope of cum.\nEddie can only hold on as he sobs through it. Venom's body swallows his release down and Eddie bucks against Venom's grip as he's fucked so perfectly deep, deep inside. Finally, he goes limp, letting Venom give and give and give and Venom likes that. Likes Eddie's surrender. So he forces another orgasm to wrack Eddies body. Colors cascade into each other and he stares out at the floor just past the bed until he's dizzy. His head is turned to the side, resting on Venoms chest. He's cumming pulse after pulse between their bodies, aware of Venom's own dick coating Eddie's insides with his own seed as it thrusts deeper and deeper to continue to milk them both.\nWe love you, Eddie. You are everything to us. We want you to be happy. \nEddie can only hold on.\n\n  Pretty  \n\n \nVenom says it a lot. Over and over. Whispered sweetly in his ear until his insides quiver. Until he has to squeeze his eyes shut.\n\"Please.\" His breath catches on the word, so he bites his lip. His cock throbs, Venom is slick inside him. Pressing, pressing. Always pressing into him perfectly. Smooth tendrils spread his legs, massaging into the meat of his thighs. Appreciating the muscle.\nSo pretty, Eddie. Eddie sobs because he can't escape the voice in his head, all consuming and unforgiving. He doesn't want to hear things like that. We know, Eddie. Venom is purring against his chest, running a clawed hand up and down his stomach.\nMy host is the prettiest. None of your kind are as pretty as you. We know, Eddie. We can see them. Venom passes encouragment and lust through their wavelength when Eddie tightens around him. He opens up Eddie's throat and a noise he's been repressing leaves his mouth. Loud. Desperate.\nYour lips are plush. Tendrils trace his lips. Unusually, so. So, so pretty. He pushes one into Eddie's mouth, swirls it around his tongue and settling it against the roof of his mouth as a comforting gesture. Eddie's toes curl. His cock jumps again.\nYour body is strong. Your eyes are expressive. And Eddie is cumming, arching against the bed and sobbing around Venom in his mouth, drool leaking from the corner of his lips. And your insides are so tight, so perfect around us. Words punctuated by thrusts deep, deep inside. Knowing where he needs it, knowing where to break him. A hand is wrapped around his hip as he releases, and the thumb rubs against his abdomen.\n\nEddie.\n\n \n \n\n  Together  \n\n \nSomewhere along the line as a tongue is being pushed into him, treating him with such care, he has an embarrassing and naive thought. He's not gay. Eddie isn't gay, he's never been gay. He's never let anyone inside him like this, it's never been a thought to cross his mind. He-\nBut you are mine. We're always inside you. Venom is always listening. Eddie drops his head until his forehead is hitting his arms below him. A shiver is traveling up his spine. One so strong it raises goosebumps along his back. Venom senses it. Senses his insecurity.\nWhat is gay? Eddie huffs. He can't believe this is happening. He uses a hand to wipe away sweat from the side of his face. He shows Venom images of men kissing, comparing it to a man and a woman kissing. Shows a man penetrating another man beneath him and the passion that goes with it compared to a man penetrating a woman.\n\"Two men together is gay. Two women, too.\" He pauses. Tries to find the right words. \"It's not uncommon, really. But-\" A twist of tongue and Eddie whines, curls his hands into the sheets. Liquid heat is settling into his belly. Venom grinds against his insides. Pulsating deep, so deep.\n\nBut?\n\n\"But I've never been with a man before. Ever. I'm...\" Eddie licks his lips. He feels exposed to Venom's satisfaction and contentment as he licks into him. Deeper. A gentle, rocking pressure against his sweet spot. Tastes so good, Eddie. You taste so good.  Chanting on loop in his mind. And again; deeper. His body clenches down hard again and he pushes his face into the sheets beneath him. More. We want more. More of Eddie's taste. Will I find it deeper? The wet sounds slosh against the skin of his ass and thighs as Venom pushes deeper. Deeper, deeper until Venom not only has a hold of that tender bundle of nerves and rolls against it. But deep enough that it feels like he's resting inside his belly. Almost unnatural with how much of himself feels full. Eddie can only shudder and sob against the bed, sounds driven out of him by Venom's growing eagerness to pleasure him. A black tendril tilts his face to the side so that the remains of his whimpers are heard. His jaw is slack. Tastes so good. Eddie is lost in it. He doesn't know how he hasn't cum yet, but he suspects it's not that complicated for Venom to figure out.\nNot yet. We want to feel you tighten around us for a little longer. A pause. Like he's remembering what they were originally talking about. But? Venom's voice draws him back to the original topic. He gasps again at Venom's tongue filling him completely.\n\"I-I'm not s-sexually attracted to men.\" Venom's mild confusion was expected.\nYou are mine, Eddie. It does not matter if you are gay. You are mine. His name like a prayer echoing through his head. Constant litany of Mine, mine, mine and Tastes so good, has Eddie crying out. Spurring Venom on, joy and giddiness emptying into him from Venom's mind to his at his pleasure. He moves into Eddie with steady thrusts now that has Eddie lifting up from the mattress onto his elbows and knees. He only lasts a few more strokes, shaking apart. He cums hard, panting hotly into the side of his arm. And just like that, his hand is not his own; it's enlarged black form is moved from its position by his head to hold him tight in its fist. Eddie's entire body shakes with his orgasm, the hand milking his cock relentlessly. Venom purrs against him as he clenches around his tongue, maneuvering his wetness into him in almost machine like accuracy even when his body drops to the mattress. He cries into the sheets, eyes squeezed together tight and legs held open.\n\nEddie is happy. Eddie is happy.\n\n \n \n \n\n  Defeat  \n\n \nShuddering and twisting through his second orgasm sends his body into a fit of spasms. Too much, too much. But it was still so good, somehow. It should have hurt, he should feel numb by now. And he knows, he fucking knows that Venom has something to do with it. He's firing off some kind of chemicals into him to allow this to happen. To keep it building and keep sending him crashing over the top.\nHungry, Eddie. And Venom for once isn't talking about food. He's hungry for Eddie, hungry for his pleasure. That sends another pang of lust through his dick and Eddie feels the same lust feeding from Venom. \n\"Venom,\" he rasps. He can barely get the words out. \"I can't. Not again.\" But his hips are lifted to get better access, Venom's thick dick he made just for him pushing and caressing his insides, making them come alive, making Eddie fight the hold on his thighs.\nSo perfect. So wet. So delicious. Venom looms over him, his large hands pushing Eddie's own into the bed. He follows Eddie's movements when he tilts his head back, lifting a tendril to pull Eddie's chin so he can see his face. His nipples are tweaked. Once. Twice. Tears fall down his face, pushed out by the bliss.\nEddie. Again. As hard as you can around our cock.The words trigger a visceral reaction. He's cumming again on the dick buried against his prostate, clutching onto Venom's hands as he convulses.\nThat's it. He's taken higher, being rammed hard and fast and this time when his mouth opens, no sound comes out. Venom is watching, his eyes slitting, his teeth shining. Pulses of his release land heavily on his stomach and Venom's grip around his hands tightens when Eddie arches. Holding him down.\nThat's it, Eddie. Venom coos softly at him. On our cock. Then Venom pushes deeper, grinds perfectly. Eddie's hips are kept still and Venom's hold on his hands is unyielding when he pushes against them as his body tells him its going to release again. The pleasure piggybacking off of itself. His dick is still pulsing the remains of his current orgasm onto his belly in time with Venom milking his insides. He barely has time to catch his breath, to take in gasping pants to steady his pulse when Venom pulls him over the edge again.\nJust like that. Impossibly, he's cumming again, shrieking, and Eddie really, truly can't breathe. He's clamping down on Venom's dick and his eyes roll back in his head. Venom presses fully against him and he's embraced through it. Arms are wrapped around him for leverage as Venom pistons into his body. Brutally. Spurts of his release land between them with each slam against his prostate. Their individual euphoria clashes together into one burning sun behind his eyes.\nHis legs are cramping from his body's contractions as Venom slowly pulls him through it. Drags him through measured and steady. Until he relaxes, until he just shakes and shakes and lets Venom give him what he wants to give him. Venom keeps his legs wide apart, making him open and vulnerable to the point that his hip joints start to protest.\n\"Please...please.\" It's all he can manage to whisper, arching through another spike in euphoria when he feels his cock rub against the front of Venom's body. Eddie doesn't know what he's begging for; for more. For mercy. Venom rakes a clawed hand through his hair before linking their fingers again. He likes pinning Eddie to the bed in this way, fingers laced through his. He's being suspended over the edge of another euphoric release in a series of slow, well aimed thrusts. Venom requests access into his mouth with a lick at his lips and he can't deny him. Eddie opens to it, making a pathetically high pitched sound around the tongue halfway down his throat.\nI want to- He chokes the words out in his mind.\nAgain, on your cock- A growl deep within Venom's chest rumbles through Eddie's body and raises chills along his arms. \nAgain. Venom tilts his head closer, nodding at him. On our cock. He's thrown over the cliff and squeezing around Venom in orgasmic bliss again. He pushes against the hands holding him down and Venom doesn't let him budge. Makes Eddie take it, unhurried and measured. His release is taken from him slowly this time; Venom doesn't pull out. He stays buried deep inside him and simply pulses his hips forward and lets his cock do the work as it roughly milks Eddie from the inside.\nGood boy. Eddie's feels drool leaking from his mouth around Venom's tongue and he whimpers though it, his ass squeezing tight around the dick deep inside him. He's powerless to stop his reactions; his throat releasing wet moans as he pants. \nThat's it. Self satisfaction oozes from Venom when Eddie is powerless to stop another release. He squeezes around the dick in his ass, and it remains unmoving as Eddie's insides pulse through it. Venom's dick presses against all the right spots, warm and thick. Impaling him deep inside and pushing through his orgasm to the place where the stimulation elevates it. Venom just holds him like that for a while, arms wrapped around him as Eddie convulses through his ecstasy time and time again. \n\"On...on your -\" Eddie's in the clouds, and he doesn't realize his mouth has been released. That his neighbors have been pounding on the wall. That his hands have been released and his arms are above his head, palms pressed flat against the headboard.\nYes, pretty. On my cock. Come on. Eddie chokes on the pleasure, body twisting to the side. Venom is looking at him, rocking into his warm body even as it twitches and flinches with overstimulated pleasure. There's a cold rush under his skin that forces his ass to clamp down. That morphs his growing numbness back to bone crunching pleasure. Until the pulses forced through him cause more cum to shoot from his cock each time Venom rolls his hips against him. Eddie sobs. Back arching. One of the hands above his head reaches down and grips onto Venom's forearm. But Eddie doesn't move to stop him. No. He blinks up at Venom with wet lashes, keeping his legs open.\nThat's it. Good boy. Take it, Eddie. He does because he doesn't think he could do anything else at this point. Venom moves to pull him from his position on his back to sitting in Venom's lap. Venom's tongue finds it's way into his mouth again. The position changes the angle inside and Eddie chokes on it. Throws his head back and lets loose muffled mewls as Venom strokes the insides of his throat with his tongue. \nEddie. He's drawn back to the present, aware of the rocking inside his body again. Aware that Venom holds Eddie's cock in his fist, that his nipples are being tweaked. Would you like to cum on our cock again, pretty? \nHe sucks on the tongue in his mouth and Venom coos at how good he's behaving. The praise makes Eddie's lashes flutter.\n\n Eddieeeeeee.\n\n \n \n\n  Reveal  \n\n \nEddie's tries to swallow down his embarrassment as Venom squeezes his ass in his hands. His claws scrape lightly. He's in Venom's lap, and they've not done this position a lot. It scares Eddie the most, and Venom knows this. He knows everything. Finally, after what seems like ages of him seated on Venom's makeshift cock (he creates it from his form between his legs), Venom moves. Eddie doesn't want it slow tonight. And Venom obliges. Pistoning into him until the air is knocked from his lungs. Venom's arms are around him, holding him close. His tongue is in the crook of his neck, down his back and between his cheeks.\n\"What are-\" The tongue joins Venom's cock and that's it, Eddie's done. Wave after wave spurts from his cock with each hard thrust and Eddie's toes curl against the spit slick tongue driving against him inside. And Venom keeps moving, his form has engulfed Eddie's hips, forcing him to move his pelvis back and forth until he feels sick with want.\nWe would have you like this forever, Eddie. And he knows Venom means it. That he would have Eddie impaled on him always if he could. Tight around him, shaking around him, full of nothing but him.\nNothing but us, he repeats.\nNothing but them."
}