{
    "id": "16304705",
    "url": "https://archiveofourown.org/works/16304705?view_full_work=true",
    "author": [
        "Pleasedial123"
    ],
    "title": "Being Over-Prepared is Impossible (and other mottos)",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "F/F",
        "F/M",
        "Gen",
        "M/M"
    ],
    "fandoms": [
        "Naruto"
    ],
    "relationships": [],
    "characters": [
        "Uzumaki Naruto",
        "Haruno Sakura",
        "Uchiha Sasuke",
        "Hatake Kakashi",
        "Dai-nana-han | Team 7 (Naruto) - Character"
    ],
    "additional_tags": [
        "BAMF Hatake Kakashi",
        "BAMF Dai-nana-han | Team 7 (Naruto)",
        "AU",
        "Kakashi isn't a bad teacher",
        "Kakashi kicks the training up a notch",
        "He laughs at their pain",
        "Kakashi POV",
        "set immediately after they graduate the academy",
        "Teamwork",
        "Team 7 being awesome",
        "Team as Family",
        "Team Bonding",
        "What Team Seven should be"
    ],
    "language": "English",
    "series": "Part 1 of How to Make a Team",
    "published": "2018-10-15",
    "completed": "2018-12-19",
    "words": "40,028",
    "chapters": "15/15",
    "comments": "1,085",
    "kudos": "15,825",
    "bookmarks": "3,761",
    "hits": "291,357",
    "summary": "<p>In one world, Kakashi awoke, felt grieved at being assigned a team he sees his own in, and he let that grief make him a lazy teacher. He saw himself in Sasuke, Obito in Naruto, and Rin in Sakura. He woke, saw himself in them, and took a large step back, regretting accepting them as his new team. In another world he was quite hands off, merely a watcher because it was so very painful to watch. He saw himself and all his mistakes in this new team of his.</p>\n<p>In this world, Kakashi awoke, saw the similarities, and instantly panicked. He suddenly realized what he had done, passing a team. Kakashi was left scrambling not to repeat old mistakes and regrets. This team would not suffer the fate of his team.</p>\n<p>In this world, simply put, Kakashi became a teacher. This is the starting of a new Team seven.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Some of this may be OOC but i think a lot of it can be due to the fact that Team 7 barely knows one another and yet have to keep relying on one another to survive Kakashi's insane training. I make it sound pretty straightforward but imagine being dropped off in the woods partially naked with no supplies with three classmates you've barely talked to. I would personally go a little crazy.</p>\n<p>I also think of all problems that could have been solved by a mediating adult. So Sakura, who is emotional and even described as a cry-baby early in the manga, probably would have snapped under certain circumstance. But she's logical as is Sasuke, so I think Kakashi could have fixed so much with just some little communication. They are also both impressionable young kids who look at Kakashi and see a legendary ninja (who hasn't been lazy in this world) and so they respect and listen to him.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>I know i keep giving Sakura crying scenes, but as Kakashi said; tears are not a weakness. I wanted to show some of her frustration and bring back the nickname she had of 'crybaby'. She is a young girl who is dealing with being isolated with three boys, only one of which even vaguely understands her. </p>\n<p>And while i think Sasuke being rude would be cannon, his apology might seem ooc. But on this idea, i reiterate that they are in isolation, and he is being given exactly what he as always wanted; training. This Sauske is a bit better than cannon because he is getting training and good attention. Kakashi gives him leeway but also doesn't allow disrespect or stubbornness from the boy, tossing him around until he is too exhausted to be a jerk.</p>\n<p>As for Naruto, i feel like this is all positive attention for him and that he barely notices the fact they are isolated.There is little reason for him to be antagonistic or harping on Sasuke when Kakashi takes an active role in their lives. Kakashi also waited till he was sure they were far from Konoha and he had their trust before he told Naruto the secret of his mom.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>I wanted to see the appearance of some more traditional ninja items. But so many were so interesting i couldn't just pick one for each kid! I won't focus heavily on the weapons but many of them will make multiple appearances briefly in upcoming chapters.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>I think the capital town of a non-ninja village would be impressive but not unlike edo period or even earlier. The kids also do their first kill which i think a good ninja sensei would introduce in a more controlled environment than many situations. Against civilian bandits is a lot more easily handed. That it happened in defence and instict would make it easier for all of them to handle.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>I feel Kakashi in cannon did Sasuke a disservice by not sitting him down and telling him he had the sharingan and how he got it. Sasuke is a traumatized child raised on stories of doujutsu theft. Kakashi could have gained his respect and trust by having a serious talk with him about it. </p>\n<p>I also feel Sasuke would have thought Kakashi had a different reason for being his sensei if he hadn't known about the sharingan. </p>\n<p>Kakashi is also training alongside his students so he is getting back to a good physical fitness level. He hadn't exactly let himself go, but years of lazy training and outside of ANBU had dulled him. With a little training Kakashi improves rapidly as shown by how the first fight with Itachi in the manga had him going down quick, but later on he was facing high level opponents with more ease. </p>\n<p>Get ready for Wave btw. I couldn't leave it out.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>I made the battle against Zabuza go a bit differently because i think as the kids changed, so has Kakashi. His reactions have changed from mess around with the opponent to kill them quickly if he doesn't want them near his kids. Also in the manga when he fights Zabuza with the sharingan and his own attacks, i think it would be risky. I mean a master of water versus a quick copy? Why not use lightening he later uses often.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>A little bit more of the team learning about one another. And some Sasuke angst. And more life lessons.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">notes</a>.)\n</p>\n<p>So i always hated how they never fully investigated Wave when they knew that Gato was going to try and destroy the bridge and kill Tazuna. SO here they did it, though i didn't show the scene. </p>\n<p>I also never liked how they killed of Zabuza and Haku. I know it taught Naruto about loss or something and then gave some good flashbacks, but i felt like the whole thing was bleh. So Kakashi, stronger and more driven than in the manga, makes a different choice.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>Timeline so far: 1 month in the forest the first time they got dropped, two weeks forest the second drop, two weeks to tea country and their base, six weeks in tea country, two weeks to wave, three weeks in wave, week and a half back to Konoha. Approx. 5 months and a few weeks. </p>\n<p>I am trying to make travel time look a little more realistic, and doing ninja vs. civilian, than some stories that say places like Suna are 3 days away. Fire Country is one of the larger countries and getting around would take a while, especially in dense forests and winding roads. </p>\n<p>So the team is finally back in Konoha and kakashi is already preparing them for the chunin exam!</p>\n<p>As for needing a certain number of D-ranks, it shows discipline and hours spent working for Konoha. There must be some form of level needed before they can enter an exam. </p>\n<p>The Hokage also demanded he enter them because its all a power play and as nice as they make the Hokage in the manga, he is still a dictator that must keep a firm grasp on his power.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_12_endnotes\">notes</a>.)\n</p>\n<p>I never understood why Kakashi didn't introduce his pack at some point, especially after using them in wave and such. </p>\n<p>The explanation of summons is half made up, half pieced together from my knowledge of the manga and stuff. </p>\n<p>The armor stuff i made up because i cant imagine heavy taijutsu fighters not using armor or others who specialize in things like long range. I know the reasons such as heavy armor decreases speed and flexibility and stealth, but they have seals to seal literal demons away, why not to make things like cloth hard. It would make more sense than someone wearing fishnet as a shirt in a fight out in the elements.</p>\n<p>Gave them another new outfit too. They're kids, even if most ninja seem to pick one look and stick to it, kids get bored of the same shirt after some time. And they're still growing and finding a style. I know i don't wear the same clothes i did when i was young, or even from a year ago.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_13_endnotes\">notes</a>.)\n</p>\n<p>A little more weapons training and a quick breakdown on what i think a military village would work it's pay system like. All the stories where they get paid per mission never made much sense to me. How would people dedicate time to training? And it would create such a competitive system that people would probably try and actively sabotage others to get their cash. Bounties make sense, but you would want some sort of equality in a ninja village.</p>\n<p>And finally some fluff about moving into the Hatake compound.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_14_endnotes\">notes</a>.)\n</p>\n<p>Music therapy and D-ranks. The scene with Iruka vs. Kakashi is something i thought would be more realistic than the arguing in the manga.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_15_endnotes\">notes</a>.)\n</p>\n<p>Some fluffy team arguing and then some serious politics. And then the end. Or perhaps the real beginning.</p>\n<p>Someone made a super cute fanart of Team 7!!!!!! https://oxenfire.tumblr.com/post/188868619800/team-7-outfits-from-this-cute-fic-by</p>",
    "text": "When Kakashi woke the morning after passing the New Team Seven, he woke from a dream of his own genin days, of Rin, Obito, and Kakashi all together. For a brief moment he woke feeling nostalgic. He realized in that moment, that in these three genin he saw his own team. \nTheir teamwork was weak. Very, very weak, and Kakashi really shouldn’t have passed them based on it. But he had. He had because there was something there, a spark, ready to bloom into fierce loyalty. They were also all skilled in their own way. Kakashi had seen many shinobi, had personally failed many genin, and he could spot talent. And these three had it. So he had passed them.\nIn one world, Kakashi awoke, felt grieved, and let that grief make him a lazy teacher. He saw himself in Sasuke, Obito in Naruto, and Rin in Sakura. He woke, saw himself in them, and took a large step back, regretting accepting them as his new team. In another world he was quite hands off, merely a watcher because it was so very painful to watch. He saw himself and all his mistakes in this new team of his.\nIn this world, Kakashi awoke, saw the similarities, and instantly panicked. \nKakashi was not a man prone to panic or hysteria, but in that instant he felt it overwhelm him and he fled to the memorial stone. Kakashi had a full blown panic attack before the stone, begging his dead team for advice. Begging them to protect this new team and not let them end as tragically as his had. He could see himself in Sasuke ignoring his team, seeing them below him. He could see Obito in Naruto acting out for attention and recognition. He could see Rin in Sakura crushing after Sasuke and snapping over Naruto. He could already see cold Sasuke being broken over stubborn Naruto’s death when Naruto would be the one to remember team loyalty and pay for it. He could see broken Sakura, caught because of his failings to teacher her and murdered. He could see Sasuke breaking all over again. \nKakashi panicked, suddenly realizing what he had done, who he had passed. He did not want to watch history repeat itself. \nSo Kakashi had a panic attack and a break down like he had not had since ANBU. Ever lazy Kakashi was suddenly thrown from first gear into full speed and it left him scrabbling and frantic. \nAnd so Kakashi, the genius copy-nin who had been a genin at age 6, did what he did best. Kakashi was born and bred to be a shinobi and shinobi were good at a few things. One was killing your problems, the other was being paranoid and over prepared. Since Kakashi wanted to do the opposite of kill this problem, he kicked himself into gear and started to plan for every way this could go wrong and what he had to do to not watch this new Team Seven die. \nSimply put, Kakashi became a teacher.\n.--.\nKakashi watched the three very carefully for the next three days, watching them as they did D-rank missions. He offered them no training and watched as they didn’t take the initiative while he made them wait two hours for his late arrival. He watched as Sasuke ignored the other two, Naruto challenged him at every turn, and Sakura switched between crushing on Sasuke to yelling at Naruto in an instant. \nTo be honest, Kakashi really wasn’t surprised or disappointed. You had to have expectations to start too even feel them get destroyed. \nInstead Kakashi watched and knew he could train them, could train any bad habits out of them. It was why kids graduated at twelve and were put in 3 man teams. One teacher for three students was better than one teacher to a full class. It was Kakashi’s job to train them. In reality, genin was not considered much of a step above academy student to most ninja. Shinobi didn’t consider genin to be ninja to be honest. They were still students, who were to be trained. They may take “missions” but those were just glorified chores that were more often a different form of training. D-ranks trained genin how to work together, how to work with civilians, how to follow orders, and even skills they made need for disguises later. D-ranks weren’t really missions.\nSo Kakashi didn’t worry. He knew they would be pretty bad straight out of the academy with its lax training. He would get them up to snuff or so help him.\nSo Kakashi watched for three days, made plans, and prepared. Then, on the fourth day, Kakashi woke up at 3am and put his plan into motion.\n.--.\nKakashi grinned beneath his mask as he grabbed Naruto like a sack of potatoes. The boy didn’t even twitch, just kept snoring. There was something quite fun about kidnapping his new precious students, after having caught them in genjutsu. Especially with how easy they made it. Sure, Naruto had some impressive traps about his apartment, but Kakashi was a jonin thank you very much.\nKakashi was a tad impressed with Naruto’s creativity and skill with traps though. He had heard of his pranks and like most others, not really considered the trap-potential in them. Now he was having second thoughts considering even Sasuke’s traps weren’t half as good as Naruto’s.\nSakura had no traps of course. He’d fix that later.\nKakashi tossed Naruto onto the back of Bull with his other two cute students and strapped them down. Then he and his ninken waved at the ANBU who watched them leave the gates. Kakashi had made sure to get permission before they left. This time at least.\nIt was the work of ten hours of some very, very, quick tree-hopping to get them deep into Fire Country, deep into the thickest parts of the forest and the wild. It would take the poor genin at least two weeks to walk back, maybe a week if they decided to run some of it. \nKakashi spent the next hour searching the area with his ninken for an ideal place. They found one that had a river and small lake with in a safe distance. The forests of Fire country were thick and wild, nigh on impenetrable to those who had not been raised to survive in them. Even civilians rarely left roads or towns. Such large swaths of wilderness always held large predators and dangerous plants. That wasn’t even considering the more northern parts of the country that was still riddled with dead traps from the wars. \nBut what was deadly to civilians was safer for ninja. Not easier, but survivable. \nSo Kakashi found an area, dismissed his ninken, and dropped his students in a heap. He set their own sandals and three brand new travelling cloaks at their feet. And then he dismissed the genjutsu that had helped keep them asleep. Nearly as one they awoke, their instincts suddenly telling them something was wrong. Sasuke came awake ready and aware, leaping to his feet even as Sakura and Naruto groaned, rubbing their eyes and groggily peering.\n“Good morning!” Kakashi chirped. \n“What?” Sakura asked, blinking as she realized she wasn’t in bed.\n“Wuzzit?” Naruto shook his head like a dog, “Where are we?!”\nSasuke gave no accusations, just narrowed his eyes at Kakashi and took stock of the situation. \n“It’s time for some training ducklings!” Kakashi sang, eye smiling, “Survival training specifically! Doesn’t that sound fun?”\n“Where are we?” Sakura asked standing up finally, “This isn’t Konoha.”\n“Oh? How do you know that?” Kakashi asked curiously.\nSakura flushed as Naruto and Sasuke looked at her as well and hesitantly pointed to a plant near Kakashi.\n“Um, that’s a species only found in southern Fire country, not near Konoha.”\nSasuke and Naruto turned to Kakashi, one giving him a narrowed expression while the other gaped.\n“What?! Why are we not in Konoha?!” Naruto leapt to his feet. \nKakashi was quite pleased they had trusted Sakura immediately on her information. That was good. Trust was good. \n“Survival training,” Kakashi repeated with a smile. \n“Did you kidnap us out of bed?” Sakura asked aghast as she realized she was in her pajamas. \nNaruto gave a shout of outrage as he realized this as well. Sasuke had already realized this, along with the fact he had no weapons.\n“We have no supplies,” Sasuke said lowly.\n“Survival training,” Kakashi repeated, “It isn’t real if I gave you everything to survive. I was nice and brought your sandals and some cloaks for you. I will give you one more gift though.”\n tossed three kunai to their feet and smiled. They shrank back from this smile. Kakashi would forgive them for that. This smile was a tad more foreboding and gleeful.\n“You have one month to make it back to Konoha,” Kakashi smiled, “I’ll see you there. Good luck!”\nAnd then he vanished before their eyes. Or appeared too. He watched from a tree branch, under layers of genjutsu, as the three panicked. Even Sasuke, who looked calm and collected on the outside, clenched his fists and stared at the ground. Naruto shouted a lot and Sakura looked a tad frazzled. \n“He left us!?” Naruto howled.\n“Shut up!” Sakura hissed, “Can he even do that?”\n“We’re going to die!” Naruto yelled again. \n“We won’t die,” Sakura snapped, “He won’t be allowed to let us die.”\n“But he abandoned us!”\n“He’ll have to check in on us,” Sakura said, trying to sound assured and sounding less than so. \nSasuke said nothing, simply pulled his sandals on, shouldered the cloak, and picked up the kunai at his feet, looking around. Kakashi could see his eyes tighten and his mouth curl downwards as the kid was hit by the realization he had no idea where they were.\n“Sakura,” Sasuke said sharply, cutting into the other two’s yelling, “You said we were in the south?”\n“Um, yes,” Sakura said quickly, looking at Sasuke hopefully, “Do you recognize the area?”\n“…I’ve never been outside of Konoha,” Sasuke said stiffly.\n“Neither have I,” Sakura admitted.\n“Me neither,” Naruto frowned, “How do we get back if we don’t know where we are?”\n“If we’re south, we head north,” Sasuke said simply.\n“Um…Fire Country is really big,” Sakura said slowly, as if unsure she wanted to contradict Sasuke, “We could head North and still miss Konoha by a hundred kilometers easily.”\nSasuke clenched his kunai and glared at the ground. Sakura drew back from the displeased expression on his face, clenching her hands worriedly. \n“What about the stars?” Naruto asked suddenly, “If we wait for night we can just follow them.”\nThe other two turned to him slowly, surprised, and stared.\n“What?” Naruto asked nervously as they continued to stare.\n“That’s…that’s actually really smart Naruto,” Sakura said slowly.\n“Hehe,” Naruto laughed nervously, scratching the back of his head, “I mean, Iruka told us they can be used as a guide right? He helped me finish an assignment one night on them.”\nThe two still stared as if they couldn’t believe Naruto had had a good idea. \n“Okay. So we wait for night,” Sakura said hesitantly, “What should we do till then?”\n“Food,” Sasuke grunted. \n“Such a good idea!” Sakura beamed at him, “Do you know what we can eat?”\nSasuke faltered.\n“We can hunt,” he declared after only a brief pause.\n“We can eat some berries and roots and stuff to,” Naruto said. \n“We meet back here tonight,” Sasuke said, and then set off into the trees.\n“Wait!” Sakura yelped leaping to her feet, “Shouldn’t we stay together.”\n“You’ll get in my way,” Sasuke snorted as he disappeared into the undergrowth.\nSakura looked after him aghast and dejected.\n“Ne, Sakura,” Naruto said hesitantly looking around, “I think we should stay together.”\n“If Sasuke says we don’t need to,” Sakura started strong.\nBut then she trailed off, looking about.\n“We’re pretty deep in the woods,” Naruto insisted, “Really deep if Sensei thinks it will take us a month to get back. There are wild animals out here.”\nAs if answering a call, a roar rang out from ahead of them where Sasuke had gone.\n“Sasuke!” Sakura screamed even as Naruto leapt after the boy. \nKakashi followed as the two crashed through the bush and came upon Sasuke facing a giant bear. In the trees Kakashi chuckled weakly, not having expected them to have run into trouble that soon. But they were trained for all they weren’t considered real Ninja, and Kakashi was pleasantly surprised when they even half worked together. \nSasuke and Naruto were quick enough to dodge any hits and Naruto kept spamming clones while Sasuke used some quick fire attacks when they realized their kunai were useless against the tough hide. The fight went on for a bit as Sakura leapt about the edges, obviously frayed and worried. Kakashi waited to see if she would jump in at all, and was finally rewarded when her expression changed and she put her hands together.\n“Sasuke, Naruto! Get out of the way!”\nNaruto obeyed immediately, but Sasuke lingered until a Naruto-clone threw him out of the way. Then Sakura channeled her chakra and used a very low level genjutsu they were taught in the academy to make people think their opponents had disappeared, visually and scent wise. Kakashi was currently using a much more advanced version of it.\n“Don’t make a sound!” Sakura hissed at the two boys as the bear roared, confused.\nThey stood absolutely still at the edges, waiting as the bear sniffed about, rumbled, and finally strode off. When they were sure it was gone, Sakura dropped the jutsu, panting just the slightest.\n“Awesome Sakura!” Naruto crowed. \n“Thank you,” she flushed.\nShe looked to Sasuke for kind words as well but he looked away, crossing his arms.\n“We need to stick together,” Naruto announced, “We can hunt together or within yelling distance.”\n“Don’t make decisions for us, Dead-last,” Sasuke snapped. \n“Says the person almost eaten by a bear!” Naruto yelled.\n“I was doing fine,” Sasuke hissed, “Idiot.”\nIt quickly devolved into a scrap as Naruto lunged. \n“Stop it, both of you!” Sakura finally interrupted, stamping her foot, “We have to work together! Which means no fighting! We don’t have the energy to waste on fighting.”\nThey looked away sullenly, but listening for now.\n“First thing we need to find is water,” Sakura said, tone bossy, “We can do without food for now and figure out the hunting thing later. But water we will need. On the way we can look for roots and berries.”\nKakashi wore a pleased smile as he watched Sakura herd the two. He had hoped she would pick up a spine along the way and not make eyes at Sasuke constantly. He supposed being dropped in a forest and told to survive was a good way to do that. Maybe also the fact she had actually made a difference in a fight. Oh, she wasn’t instantly cured, but he would bet anything that by the end of the month, she’d be much less of a squealing fangirl. Especially if Sasuke kept this attitude up.\n.--.\nKakashi would readily admit he laughed himself sick when the kids found the river and tried fishing. None of them knew how to catch fish, let alone gut them. Sakura had come close to catching one, realized her finger was digging into an eye socket, and had a brilliant freak out throwing the fish away. Right into Sasuke’s face. He was left spluttering, looking exactly like someone who had just been slapped by a fish. And then Naruto had almost drowned laughing and Sakura and Sasuke had had to drag him out of the water. \nThey did indeed learn though, going to bed that night full and sated, after they had finally figured out which way to head the next day. \nBut it couldn’t be that easy for them, oh no. So Kakashi snuck into their camp, which was an old den under a tree that no bear could fit in, and stole two of the three kunai. Just to fuck with them he left fish in their places.\n.--.\nFour days later the kids were scratched, bruised, but looking to be doing okay as they slowly but surely made their way in the direction of Konoha. They had found a system of staying close but also splitting up to hunt, gather food, and scout out areas ahead of themselves. \nThey were doing well.\nThat meant it was time for Kakashi to step in and start to make it a tad more difficult.\n.--.\nThree days later and they finally figured out that they had been caught in a genjutsu and been walking in the opposite direction of Konoha. Sakura’s scream of rage was louder than Naruto’s. \nJust to be mean Kakashi caught them in another not an hour later.\n.--.\nKakashi was quite proud of how twitchy Sakura had gotten. To be honest they were all quite twitchy, glancing about with narrowed eyes and ready hands. But Sakura was the one who muttered ‘kai’ every hour and disrupted her chakra to make sure they were under no genjutsu.\nHe was even more proud when Naruto asked what she was doing and she made no complaint or insult before she taught him. She didn’t even do anything but roll her eyes when Naruto had no idea what chakra was. \n.--.\nKakashi rubbed his chin thoughtfully as they got closer to Konoha and wondered what he would do to turn them away. They had been walking for two weeks now and even with his genjutsu setback they would make it in a week. He didn’t want that though. He wanted them to take longer, to work together longer. \nSo Kakashi gathered his hands together and gleefully summoned his ninken in the night. \nHe was correct in his thinking that the kids would not know the difference between his ninken and wolves under the cover of night. They were awoken by the howling, and then snapping, howling, and quick flashes of teeth had his students running, leaping through the trees as his ninken harried them in a new direction. \nKakashi kept it up most of the night before letting his ninken vanish in the first rays of dawn, seemingly having lost the three. He watched as his kids collapsed, all panting and sweaty and wrecked from nerves and running all night. \nThis time it was Naruto and his boundless energy which got the three dunking in a river to clean off the stench of sweat and exhaustion that could be tracked. Then they somehow gathered enough energy to find food before collapsing in the tree tops. Kakashi watched over them as they slept, letting them have that rest.\nThat night they awoke and started moving again, following the stars. Kakashi figured he had set them back by about three days again. Kakashi decided to be merciful and allow them the rest of the journey unscathed.\n.--.\nWhen his cute little students tumbled through the gates of Konoha it was early morning. They were all dirty, tired, bruised, and looking exhausted, but they were all standing. \n“Good morning!” Kakashi chirped cheerfully from where he had been waiting by the gatehouse, “You made it with two days to spare! Good job!”\n“I’m going to kill you,” Sakura hissed, looking wild with her bloodshot eyes, tangled dirty long hair, and dirtied torn pajamas under her cloak. \n“I’ll help,” Sasuke said darkly, just as disheveled and twitchy.\nNaruto, usually the one with boundless energy and a loud voice, merely growled.\n“Well, since it’s only early morning, I think we should do some training!” Kakashi smiled.\nThis is where they started to crack.\n“Please,” Sakura said, tears in her eyes, “No more. We need time off.”\nNaruto was nodding heartily looking close to tears as well.\n“Aw,” Kakashi sighed as if disappointed, “I suppose a short break would be okay. You have two hours to go shower, nap, eat, and then I want you in training grounds 4.”\nThey didn’t even bother to argue just took off down the street without looking back. Kakashi grinned gleefully after them and set off to get some supplies.\n.--.\n“I have decided to be nice,” Kakashi announced, appearing via shunshin in the middle of the training clearing, “We’ll do research today instead of any physical training.”\n“You’re a merciful sensei,” Naruto cheered, “What are we looking up?”\nKakashi dropped an armful of scrolls and books.\n“We’ll be studying survival techniques and knowledge,” he grinned, “Everything from how to survive with no chakra to what plants are okay to eat. For all the countries.”\n“A-all the countries?” Sakura spluttered.\n“You had it easy,” Kakashi nodded sagely, “The academy teaches more about Konoha’s landscape than any of the other countries. But ninja missions take you far and wide and you need to be ready for emergencies.”\nAnd so the reluctantly took scrolls and books as Kakashi started to lecture in between, keeping them all on the same topics. He would give them a wide basic understanding, and then start to focus on individual talents. He already planned to educate Sakura in herbs and plants for consumption and medical usage. Sasuke would be on scouting and sensing enemy, along with how to disguise their trail. Naruto would be their trap specialist and hunter. \nSo they set in for an exciting day of research. The fact that none of them complained showed they were still very much cowed. Perhaps the exhaustion was keeping them quiet as well.\n.--.\nThe growl of Naruto’s stomach interrupted Kakashi while he was teaching Sakura about useful medicinal plants. Everyone looked up at Naruto who blushed. \n“What? It’s dinner time,” he grouched. \nIt was rather late in the day Kakashi realized looking up at the sun. \n“A quick break then,” Kakashi said. \nHe had sent Sasuke running to the convenience store earlier and they had had some snacks and drinks, but they would be needing food. \n“You guys have half an hour to relax while I go get dinner,” Kakashi announced.\n“We’re not done?” Naruto asked mournfully.\n“Are you finished the scroll I assigned you?”\n“No,” he pouted, mulishly.\n“Then nope!” Kakashi grinned right before he disappeared.\nWhen Kakashi returned half an hour later he had his arms stacked in take-out boxes. \n“I love you!” Naruto screamed as he realized there were four bowls of ramen in there for him. \nEven Sakura and Sasuke looked happy to see the pile of food he had brought.\n“Sensei can treat you sometimes,” Kakashi said cheerfully, “But don’t get used to it.”\nThey devoured their food even as Kakashi quizzed them on what they had learned for the day. They replied in between bites and yawns. By the time they had finished they were yawning, rubbing at their eyes adorably and looking ready to drop off. Well, it was late and they had been exhausted.\nAlso Kakashi had drugged their food.\nKakashi cackled when Naruto was the last to drift off, having needed nearly five times the amount of drugs the other two had. \nTheir screams of rage the next day, when they woke hundreds of kilometers outside of Konoha would warm the cockles of his heart.\n.--.\nThis time around Kakashi had dropped them off to the West in the middle of the mountains. This time he also stole their sandals, stole their shirts, stole their cloaks, and left them hunting knives. He had also given them only two weeks.\nThe mountains were a much different territory then the vast but mostly flat woods of Southern Fire country. Watching his kid’ scale a mountain yelling about no shoes, only to find a group of very angry mountain sheep sent Kakashi into hysterical laughing, especially when Naruto ended up getting head-butted off a cliff. Oh he was ready to step in if needed, but his kids were resilient. \nThis time when he came at them with genjutsu, he layered it. It took Sakura only one day to realize it was there, hidden under weaker layers that he reset every time she dismissed the last one. When she wasn’t strong enough to disrupt this stronger hidden layer, it was Sasuke who remembered pain could be a better disrupter and they all bit their lips hard while using ‘kai’. Kakashi was very proud. \nWhen they ran into a bear this time, they were ready. Naruto’s creativity paired with Sakura’s more academic knowledge paired with Sasuke’s practicality had armed them with handmade spears and they actually brought the bear down. It was Kakashi’s earlier lessons on their ‘day off’ that had taught them how to skin and cut up a larger animal, or at least the theoretical knowledge.\nThey messed up a bit of course and the hide wasn‘t useful with how much they had cut it, but they got a good deal of meat from it. They spent the next few hours cooking enough meat to last them a few days, even unrefrigerated. \nThen Kakashi followed them over a few more mountains, Sakura gathering plants as they went, some edible, some medicinal. Sasuke learned how to hide their tracks better and was a very devoted scout. Naruto made sure that every time they hunkered down for the night, even with limited supplies, nothing would be able to make it them unawares. \nWhen they had realized how far out from Konoha they were, and with the two week time limit, they had realized they needed to set a fast pace to make it back. So they did with very little complaint. None of them were at a place where they could run as fast or as far as a jonin, but they weren’t civilians either and they kept a steady jog up most days. \nNaruto by far had the most stamina, a truly ridiculous amount for a kid his age and size. Sasuke was well trained as well but even he could tire. Sakura on the other hand was the weak link and they all realized it. During the first month Sasuke had been dismissive and even cruel in some of his comments aimed at her. Kakashi didn’t think the boy actually knew how mean his words were but they had affected Sakura. She had been dejected at first, near tears at some remarks, but as Kakashi had guessed, she was stubborn. Sakura was far too stubborn to give up. \nSakura was also not a doormat. She let Sasuke get away with quite a few comments, quite a few barbs for the first few weeks, trying desperately to keep up and keep polite and ‘cute’ in front of her crush. But at some point, when you’re lost in the woods for weeks at a time, driven to exhaustion every day, and made to survive off what you can forage with only the company of two boys, sometimes you snap. \nSakura had snapped brilliantly. It happened in the first week of this new trip when Sasuke made another decisive comment offhand about how weak she was. Sakura, driven to the very edge of her strength trying to keep up with the faster stronger boys who had far more training than her, was at her wits end and it showed. So when Sasuke made that one fated comment, not even the thought of her crush could stop her. \nWith a roar, Sakura had launched herself at the startled Sasuke. It took the combined effort of three Naruto clones to pull the two apart as Sakura tried her best to beat Sasuke’s face in. Kakashi had also noted her anger problems but she had kept them well contained. Now they were unleashed. \nKakashi watched in interest at how strong Sakura’s hits were, how coordinated. That girl had potential in taijutsu was all he thought as he watched. Her academy profile said she was weak in taijutsu, average in form and strength. Kakashi wondered how often she had pulled her punches because ‘ladies weren’t violent’. Wondered how weak her previous diet had made her. Wondered how much Sakura had repressed to be a cute little lady in front of Sasuke. \nWell that cute little lady was beating Sasuke’s face in. \n“Sakura! You’re gonna really hurt him!” Naruto yelped, two clones holding the girl down while the other helped Sasuke up, “Not that the bastard doesn’t deserve it but I don’t want to have to carry him back to Konoha!”\nSasuke spit out a wad of blood, reaching up to touch his broken nose, obviously still bewildered. Sakura let out another cry of fury, raging against Naruto’s hands before she finally stopped, collapsing panting.\nFor a moment silence rang out as Naruto looked between the two nervously and Sasuke touched his bloodied face. And then Sakura burst into heaving sobs. Kakashi decided it was time to intervene.\n“Naruto, go help Sasuke clean his face in a stream. Don’t reset touch his nose, I’ll reset it.”\nNone of the three looked all that surprised to see him. They had of course known he was following, watching over them due to his genjutsu and his way of fucking with them. Naruto did as he said, dragging Sasuke away and dismissing his clones. Kakashi hovered over the sobbing heap for a minute, trying very hard not to have an allergic reaction to emotions. Then he sighed, maned up and gathered the girl into a hug.\nSakura clung to him like a limpet, sobbing into his vest.\n“Hush now Sakura,” Kakashi pat her back gently.\n“H-He’s an asshole,” she cried.\n“I don’t know how you didn’t see it before,” Kakashi said wryly, “Most Uchiha were.”\nSakura sniffled and snuffled and Kakashi waited with her, rubbing soothing circles in her back, as she slowly got her tears under control. \n“I want to go home,” Sakura finally sniffled pulling back to wipe at the tears and snot on her face. \n“Sakura,” Kakashi said gently, “Do you really want to?”\nSakura heard all the unasked questions and quieted for a moment.\n“I-I…I want to be strong,” she finally whispered as if confessing a secret.\n“And you will be,” Kakashi told her seriously, “Do you know why I’m doing this training?”\n“Yes.”\n“Why?”\n“Teamwork. You said the first day it was the most important thing,” she wiped her nose, “But, but, our team sucks!”\n“I wouldn’t say that. You have been working together,” he smiled, “Would you have been able to do this alone, would any of you have?”\n“…maybe Naruto,” Sakura admitted slowly like it was an unfair truth, “But even he would have…”\n“You see,” Kakashi said, “You all clash but you have been working together well. Teamwork doesn’t always mean loving the other person or even liking them. It’s about working together anyways, knowing they are your comrade, and at the end of the day, making sure everyone stays alive.”\nSakura nodded miserably.\n“Plus, this training has done other things as well,” he offered lightly, “Would you have put as much effort into stamina if you had been assigned laps at the village?”\nShe shook her head knowing the truth they both already knew. Sakura would have obeyed but she wouldn’t have put such effort, such desperation into it.\n“Do you trust me Sakura?” Kakashi finally asked.\nShe looked up at him, surprised. \n“Of course,” she said, without hesitating.\nKakashi felt his smile shift, twist to become a small genuine thing.\n“Even though I’ve abandoned you in the forest twice now?” he smiled.\n“But you haven’t,” she said, a tad bewildered, “We knew you were watching us.”\n“And you’re not upset I left you to fight bears and such?”\n“I mean, its training,” Sakura said, “It’s supposed to be a bit difficult.”\nKakashi pat her on the head happily.\n“Mah, my cute students, understanding my lessons. You’re a very bright child Sakura.”\nShe flushed happily at the compliment. \n“And don’t worry about Sasuke, he’s a bit emotionally stunted but he’ll come around. Without needing to punch him in the face.”\nHe gave her a pointed look and she flushed again, this time in embarrassment.\n“Maybe wait until we spar, ne? While I don’t usually condone violence against teammates, spars are a different matter,” he relented with a wink, “And don’t let his comments get to you. You never had the privilege of clan training or the heritage that predisposed you to the shinobi arts. You are doing fantastic on your own.”\nShe beamed up at him and he ruffled her hair again.\n“Now, put on a brave face, apologize for beating his face in, and start heading for Konoha again. If you guys make it in five days instead of seven, Dinner is on me.”\n“I don’t know if I trust any of your offers anymore,” she huffed but stood, wiping the rest of her tears and snot away.\n “How about I swear to never drug you guys again then,” he offered, “It was a tad rude of me.”\nShe peered at him to see if he was being honest before offering a small shy smile and a nod.\n“And Sakura, I’m very proud of you.”\nHer resulting smile was a blinding beam. Kakashi left her to get the boys. Naruto was lecturing Sasuke relentlessly about being a good teammate even as he was helping wash the last of the blood of his face.\n“Good job separating them Naruto, now why don’t you go join Sakura while I help Sasuke reset his nose.”\nNaruto stuck his tongue out at Sasuke and vanished after Sakura.\n“Now, Sasuke, can you tell me what you did wrong?”\nSasuke stared mulishly at the water. Kakashi sighed and motioned him over. It was the work of a moment to reset his nose, Kakashi’s hand lit green with his very basic grasp of medical chakra.\n“Sasuke,” Kakashi prodded.\n“I shouldn’t have insulted a teammate,” he finally said.\n“Yes. Does Sakura deserve you insults?”\nSasuke struggled.\n“No,” he finally admitted voice a tad lower.\n“She has been working really hard to keep up with you boys. You know she’s not as skilled as you yet. And while some of the blame can be placed on her and her lack of effort, you must know that she is trying and that what training is for.”\nSasuke wasn’t looking at him, but Kakashi could tell he was listening. \n“She’s even let up on the fangirling hasn’t she? She’s been much more exhausted then both of you, but she’s not dragging you behind. Her knowledge has been an asset and you know it, even if she can’t run as far as you guys each day.”\nSasuke looked at his feet, eyes unfocused.\n“Sakura is your teammate, Sasuke. She will be, even when you all become chunin. That could be years of interaction. It will be years of being with her on missions and in training. It will be days upon days upon days of her company. It will be battles upon battles where she will be watching your back for you. She may even be what stands between you and death one day. Wouldn’t you agree it would be good to have a good working relationship with her?”\n“…shes annoying,” Sasuke said, a sulk in his voice.\n“She’s a twelve-year-old girl. Most twelve-year-olds are annoying,” Kakashi said lightly, “But you can admit she’s changed hasn’t she? Just as she will change every day for the next few years as she grows and matures.”\nSasuke nodded hesitantly.\n“Now, I think if she does something you don’t agree with you are allowed to speak up and talk to her about it. You can tell her you are not interested in dating or fangirls. Tell her honestly and straight and she will back off. If she doesn’t, I will make sure she does. But snapping at her for being slower is not fair to her. She is trying. And she will not always be as good as you, nor will you always be as good as her. Teams are meant to round each other out. You will both have your skills and your weaknesses.”\nSasuke finally sighed and nodded.\n“Now, you’re going to apologize for insulting her. She will apologize for punching you in the face. And when we get back to Konoha, we will have a nice chat all together.”\nSasuke only hesitated a moment and then nodded.\n“Good,” Kakashi smiled. \nKakashi watched from the trees as Naruto frowned at both teammates till they apologized and shook hands. He had told neither of the boys about the deal for dinner. He didn’t want them pushing Sakura, he wanted Sakura pushing them. \nSo he watched happily as they started to run. Kakashi may or may not have cleared the way for them, lessening his genjutsu and taking care of a cougar as they set off for home.\n.--.\nThe three students that stumbled in the gates at the end of the fifth day looked like wild feral things. Since Kakashi had stolen their cloaks, shoes, and shirts at the beginning (to Sakura’s embarrassment despite the fact her sports bra was more cover than many ninja wore), they had spent some precious time scavenging. Kakashi was impressed with the reed sandals they had woven. He was also impressed with the spears and the make-shift bamboo canteens. \nHe was also impressed by how they had given up baths to make it back at the five day mark and all stood grimy and dirtied and panting, gazing at Kakashi, awaiting a command.\nHe beamed at them.\n“Good job! You all did very well. You have tomorrow off.”\nThey cheered, even if it was somewhat tired. \n“But the day after that we meet here at seven am. Pack for a month long trip. Make sure you have everything from weapons to rations. Don’t worry about tents. I doubt any of you have one yet so I will provide those.”\nThey stared up at his smile, aghast.\n“Sensei, please,” Sakura said weakly.\n“I promise I won’t abandon you alone in a forest again,” Kakashi soothed, “It’s a training trip.”\nThe relaxed minusculely and he waved them off. Kakashi grinned after them.\n“They’re going to mutiny,” Kotetsu murmured having watched the last interaction as well.\n“And kill you,” Izumo said sympathetically, “In a ‘training accident’ and we will never find your body.”\n“Mah, they can try,” Kakashi waved a hand, “Such cute little ninja. I am sure they’ll love this trip.”\n“Yup. Totally going to mutiny,” The two nodded even as Kakashi wandered off to do his own planning and packing.\n.--.\n“Okay kiddies, let’s see what you packed,” Kakashi said as he appeared amongst his three students. \nHe could already see they had over-packed. He supposed they were a tad paranoid after having already seen Kakashi’s version of training. Kakashi went through their weapons, noting quality and quantity, Sasuke having the higher quality but Naruto having the most and most varied. He went through their medical supplies, Sakura by far the most prepared with Naruto the least. He went through the rations, Sakura having a good solid amount while Naruto had the most and Sasuke had the most balanced nutritious ones. As for bedrolls, Sasuke once again had the highest quality and Naruto the least. \nIt was easy to read their circumstances in their supplies. Naruto on his shoe string budget but with a trap-ninja mind frame and living a bit of a harder life. Sasuke with his pick of the Uchiha weapons, supplies, and money. Sakura with no ninja background to help know more intimate details but a good practical mind-frame. \n“Okay, seems like you’ll be good. A little more than you really need but oh well,” Kakashi shrugged and didn’t let any of his plans to help them lose some of that extra luggage show.\nTheir outfits had changed slightly as well and Kakashi nodded as he looked them over. Sakura and Sasuke had switched to pants. They were both light and breathable in the hot weather, but would cover more at night when it got chilly. They had both picked sensible black pants and strapped them to their ankles with bandages. Sasuke had kept his wide collared blue shirt but wore a tight dark colored long sleeves shirt underneath. Sakura had kept her red shirt that hung low to her knees, but also wore a thin long sleeve shirt under it and a dark green vest over it with a hood. Naruto still has the orange jumpsuit, but Kakashi could see he wore an extra layer of mesh and bandages underneath. All three now wore fingerless dark gloves.\nHe was quite proud as he quickly realized what every extra layer was for. The three had found out how much help an extra layer of clothes could be, not just for protection or warmth but to be used as extra material. Shirts could be cut into emergency bandages of made into rope. Extra bandages could be used as thread and ties. Everything could be of use, but bags could be lost, clothes often weren’t. \nThey also all carried the dark brown cloaks he had given to them on the first trip. They were meant to blend in well with trees and dirt, waterproof and thick. \n“Okay then team, lets head out!” he beamed. \n.--.\nKakashi didn’t tell the kids where they were going, just pushed them at a fast pace. At the end of each day they were all panting an exhausted. For the first week Kakashi didn’t bother setting watches, just let them rig traps and alarms and they all slept. On the second week he started a watch rotation as they drew further and further from Konoha.\n“Where are we going sensei?” Sakura finally asked after the second week of hard quick travel.\n“To the border of Tea country,” Kakashi smiled, “Along the coast.”\n“Why?”\n“Meh, seems as good as place as any,” he shrugged.\n“If any place would work why are we going two weeks out of our way?” she asked, exasperated.\n“Mah, it’s teaching you all how to travel quickly and efficiently,” he smiled, “It’s a taste of what we would be expected to do if we were to be called on a mission”\nSakura drew back, thoughtful at that. It was true. Kakashi had been teaching them watch rotations, how to pick their way through unfamiliar terrain in a more sure way then just trying to bumble home as quick as they could. When he had dropped them in the woods their only goal had been get home in a decent time frame. Now he was teaching them how to actually travel through terrain with a leading commander and supplies. There was a difference. \nThey didn’t ask any more questions about where they were going as they efficiently travelled forwards. Kakashi taught them how to best jump quietly through the trees, working on their bounding and leaping and footing. He hadn’t taught them how to stick with chakra yet, but he wanted them to learn without it at first. If they ever found themselves drained or unable to use chakra, being able to still leap and twist gracefully and quickly through the trees was a good skill. \nKakashi also taught them better how to hide their tracks, how to hide signs of a camp. He taught them how to make false signs as well and lay false trails. He taught them about how you could be tracked. He didn’t teach them any ninja skills as much. He taught a low level genjutsu or two for hiding their trail, but everything else was a survival technique require merely wits and knowledge. \nKakashi also took the time to tell them of various mission stories he knew weren’t classified. At the end he’d subtly test what they had been listening for, what they had been picking up. Every story had a lesson, be it how to escape a bad situation, when to abandon a mission, when to continue, etc. Kakashi made sure they remembered and could repeat what to do in situations back to him. He also tested all the things they should know coming out of the academy knowledge wise. \nHe did all of this easily enough as they travelled, his cute little genin panting and rushing after him, answering him between gasps and pants as he worked on their stamina and barely paused. He knew he was pushing them hard but none of them complained.\nSasuke and Naruto would never complain, Sasuke wanting strength and Naruto always wanting to know more about how to be ‘an awesome ninja’. Naruto would grumble of course, ask how certain things were relevant, but if Kakashi explained he would quiet down and listen. Sakura would have been the one to complain if the past two trips and the consequential punching Sasuke in the face conversation had not occurred. Instead she was determined not to be the one left behind.\nKakashi was very, very proud of all of them by the time they reached the border of Tea country and stood on a beach, looking out at the Kawa pass. \n.--.\n“Okay, we need a more permanent camp,” Kakashi smiled at his exhausted students, “Once that is set up you may have a day off to explore the area and relax.”\nSakura gave a halfhearted cheer. \n“Now, where is the ideal location? We aren’t in enemy territory, nor should there be any foreign ninja in this area unless they are passing by on a mission. Nor are there any villages within a day walk, so doubtful we will see any bandits.”\nThe three glanced at one another.\n“In the trees I think,” Sakura said hesitantly, “Definitely not in the open on the beach here.”\nAll Konoha ninja felt safer under trees and so he nodded. He got them working on an idea of what their camp should look like, chipping in here and there, until they had sketched out something in the dirt and then they all set out together to find an ideal place. They ended up twenty minutes back into the tree line beside a small creek, tucked out of the way. \nKakashi pulled his own supplies out via a seal scroll and handed the three confused genin a set of axes.\n“Well, go cut some trees down. We have enough tarp to make a covered area but we need some poles.”\nThey set out after a bit more encouraging and Kakashi watched until they came back, dragging some young cut trees. Together they all set up a wide tarped area, using an extra-large tarp Kakashi had brought of molted greens and browns. It was an extra thick one and they draped it up and over the poles so it fell down the sides where they tied it down. \n“You won’t always have the tools to make a camp like this, but if prepared for longer stake-outs or stationary missions, it is very useful,” Kakashi told them, “Tents are fine by themselves but are by necessity small. If you are in the same place for a long time these tarps can help with camouflage but also provide you shelter from wind and rain while giving you a communal area.”\nThey also dug a small fire pit under the new tent like tarp and Kakashi showed them how to use it without smoking themselves out. Then he dug out the two tents he had brought and directed them to set them up still under the large tarp near the back.\n“You will decide how we are pairing up. Two people a tent,” Kakashi said.\nSakura hesitated, as if she wanted to object. But she’d spent the last two months curled up in a heap with the two due to minimal supplies and the chilly nights.\n“Sometimes you will not have the opportunity for separate sleeping arrangements,” Kakashi further drilled, “Best get used to it.”\nDespite the fact he did not want to talk to them about it, Kakashi made a mental note to make sure they had all had the Talk. The academy should have went over it, with warnings of how rape was used as a weapon, but kids never listened well to such talks. Too giggly and thoughtless at that age. Kakashi would make sure they understood the safety, the danger, and what No meant. He could turn it to harassment as well and kill whatever was left Sakura’s fangirling. They needed to know how to respect other people. \nHe watched as they set the tents up and when they were done sent them out with the axes again to gather firewood.\nHe was pleasantly surprised when they returned, arms loaded with wood, and a brace of pheasants hanging from Naruto’s shoulder. Naruto babbled a story about running across them as he held them up like an offering to Kakashi.\n“Good job,” he told the boy.\nNaruto beamed, all sunny smiles and crinkled eyes, as if he had been offered the world. Sometimes Kakashi was reminded of how desolate Naruto’s life had been and what a small bit of praise meant to him. He was constantly reminded that these cute little kids, trying so very hard to be shinobi, were in fact kids. Twelve-year-old little kids with stick thin wrists and wide eyes. It was so easy to forget. Too easy to forget. \n“Now, what else could we need?” Kakashi raised a brow at all of them.\nThey shuffled and looked at one another.\n“Proximity alerts and traps!” Naruto finally chirped up. \n“Good. Go set those up. And show Sakura and Sasuke how and where. Then you can have the rest of the day free.”\nKakashi watched them run off fondly and turned to gutting the pheasants to get them ready for dinner. \n.--.\nKakashi watched with half an eye as his cute little students ran around the beach and through the water. It was not sandy here, more rocky but they had no care, turning over rocks to look at crabs and fish. It was revealed Naruto couldn’t swim more than an instinctive doggy paddle and soon Sakura was teaching him with a bossy tone. \nKakashi was merely there to make sure they didn’t drown as he sat with his book open as a prop and mentally made a list of what they needed to learn. \nTree walking, water walking, various ninjutsu, various genjutsu, he needed to get their hand signs down to half signs, he needed to make sure they knew the basic academy jutsu so well they could do them in their sleep. They also all needed taijutsu practice as Naruto only had a brawler style, Sakura didn’t suit the academy style, and Sasuke had never learned the full Uchiha form. He needed to make sure Naruto was caught up on everything and get him started on some more high-level traps and perhaps seals. Sasuke needed more elemental jutsu and perhaps some blade training. Sakura needed some more of everything to better round her out. \nIt was going to be a long few weeks. But, Kakashi would have the distinct pleasure of not being the one tired or exhausted.\nHis students looked up at him alarmed as he let a cackle out.\n.--.\nPeople liked to joke that they felt bad for whatever team of genin finally got Kakashi as their sensei. With how many he failed it had become a larger joke that many jonin weren’t afraid to rib him over. With his chronic lateness, bad excuses, bad habits, bad self-care, and all around eccentricity people assumed he would be a terrible role model for children.\nKakashi wondered if he should be offended. \nBut the thing was, the thing people brushed aside, was Kakashi was a genius. He was smart. Most people had also forgotten that Kakashi had taught teams before. It was an open secret that he had been an ANBU captain, and Tenzo called him senpai all the time, but people seemed to forget. They seemed to forget that ANBU captains were responsible for training teams and new recruits. \nSo Kakashi had been a teacher, albeit not of genin, but really, ANBU weren’t that much different, you just taught them at a higher level. \n“How is everyone feeling?” Kakashi beamed at his students.\nA series of groans and moans met his ears as he looked at the slumped exhausted genin. The first day of training had gone well. Better than well in fact. He had taught them tree walking to start. \nSakura had gotten it on her first try. \nKakashi had tried not to gape at her the way the boys had when she reached the top of the tree with one single try. The boys had been envious and awed, but Kakashi had been blown away. None of them understood how much chakra control something like that took. That wasn’t even a skill Kakashi had gotten down on his very first try (his third, but still not the first). As he half listened to Sakura try to help the boys out by saying what she had done, Kakashi’s mind had sprung into overdrive on what he could teach a with that level of chakra control. \nHe had set the boys to mastering it and pulled her off towards the water to get her started on water-walking. He twitched only the slightest when it took her five minutes to get it down. He’d made her practice on water all day to help her grow her chakra reserves, telling her to practice jumping and sliding and running and even pulling herself out of the water with her hands. \nBy the end of the day, all three had gotten it down, though Naruto had needed a bit more one on one coaching, but Kakashi could see his problem lay in how much chakra he had. \n“We have to do dinner now,” Kakashi smiled, “What shall we have? Shall we go fishing?”\n“Can please just eat rations tonight?” Sakura groaned, “I don’t think I have the energy to forage or hunt.”\nKakashi gave them a long look before relenting. He made them do all the preparation though. It only took half an hour for a fire to be started in their cover, rations cooked, and each of them to be sitting on a log in a circle, happily eating.\nKakashi let them have some peace while they ate. He wouldn’t push them physically in the evening unless they needed some night training, but he had an array of other things to teach them.\n.--.\nThe first two weeks went well. \nKakashi ran his cute little genin into the ground either physically or mentally every day. They spent many a morning and afternoon working tirelessly on taijutsu, a clone giving them each one-on-one time to refine and work on katas. To Sasuke he gave more of the Uchiha’s main form, copied from working with various Uchiha on the battlefield. To Naruto he showed how to hit harder, how to roll with the punches better, how to shift between stances flawlessly; his brawler style suited him too well to try introducing a formal form. To Sakura he gave her various stances of the Iron Fist style; Gai would agree with her potential when he saw her use it. \nEvenings were spent on chakra control, playing tag across the rolling waves or upside down on trees. He taught them to fight and roll across the water and across any surface. They switched back and forth, from one surface to another, sticking with their hands or feet as he threw them about in games of keep away. If they were too tired to keep running after their taijutsu in the morning, they did slower exercises, carrying boulders across the water and mediating upside down. He watched Naruto and Sasuke’s control grow in leaps and bounds while Sakura’s chakra reserve swelled. \nOn days they were too tired and sore to move he drew them into what seemed like simple games and questions and conversations. Every single one was a test, a skill to learn. Kakashi had them play question games that could double as interrogation with more dangerous intel. They played keep away games designed to train them to avoid enemies. They played games that involved innocent play-acting that could be disguises and personas for infiltration later. They played word games that worked like codebreaking. They played games trying to make Kakashi give them answers that could be used for intel gathering.\nSasuke was the most reluctant to play ‘games’ of course, but the other two dragged him in and he had gotten better at listening to commands from Kakashi. Punishment, especially physical activity after an exhausting day was helping Sasuke get over his attitude. Perhaps also the fact that Kakashi had given what he always wanted; training. \nThe first two weeks were on stamina and taijutsu and chakra control exercises and subtle mind games. \nThe third week he moved them onto ninjutsu much to Naruto’s glee.\n.--.\n“Naruto, stop laughing at him,” Sakura sighed, exasperated. \nBut Naruto was a heap of giggles and laughter as he pointed wordlessly at Sasuke’s eyebrows. Or lack off.\n“That is the danger of fire jutsu,” Kakashi eye-smiled, “They can blow up in your face if not careful.”\nSasuke kept his face expressionless but kept giving these full body twitches. \n“Mah, you’re turn Naruto,” Kakashi said, subtly edging Sakura and Sasuke back, “And remember, too much chakra and it will get your eyebrows too.”\nNaruto leapt eagerly to his feet and ran through the hand seals without chakra with Kakashi at his side. Kakashi made sure every one of them was right and showed him how to control the fire when it bloomed. Then he made sure to put a good twenty feet between him and the blond. Sasuke and Sakura, behind his protective form, looked up at him, confused as to why they were suddenly giving Naruto space. Kakashi just watched, waiting for the explosion.\nNaruto, with a jinchurki’s chakra and with little control from excitement and a lack of experience trying to use an explosive fire jutsu, did not disappoint.\n“Holy shit!” Sakura blurted out tucked under Kakashi’s arm.\nSasuke merely stared from under Kakashi’s other arm, eyes wide beneath his singed face. Kakashi raised a brow at Sakura.\n“Oh, sorry for swearing,” Sakura squeaked, flushing.\n“I think it’s deserved,” Kakashi said blandly from where they stood on a tree branch, forty feet away from the blast zone. \nHis clone had already went to put the fire out while another checked on Naruto.\n“DID YOU SEE THAT?!” Naruto screamed looking spastically happy.\n“I’m sure the whole country did,” Sasuke frowned. \nKakashi gently patted Naruto down, trying to wipe ash and soot from where it layered the whole boy. Naruto was missing his eyebrows now too and his hair was singed. His jumpsuit would probably be a loss as well. Kakashi said nothing about the burns that healed even as he watched. Naruto was shouting and squirming in his grasp and when he finally let the boy go he started leaping about, waving his arms excitedly as he took in the damage. \n“Mah, maybe you should celebrate after you actually master it, not fail at it,” Kakashi said much to Sasuke’s smugness and Naruto sulk.\n.--.\nHe did not test his students for their affinity yet, though he had his suspicions regarding each one. Instead he gave them a few small ranked jutsu of every style, refusing to let the knowledge of what they would be best at psychologically hamper them. When they looked frustrated or close to giving up, he gave them an extra moment, gave them extra tips, and pit them against one another, using their competitive streak against them. Sasuke was the best at ninjutsu, unsurprisingly, with his average chakra, his decent control, and his previous training. Naruto had the most powerful ninjutsu unsurprisingly. But Sakura surprised with how creative she could get in using her jutsus, her control allowing her to twist many of them beyond their basic purpose; she could turn a stream of fire into a lance or a set of them with careful focus. \nAfter their week of ninjutsu, Kakashi started them on genjutsu. \nSasuke had a knack for it and would be even better when he awoke his sharingan, and Sakura was quickly picking them up, but Naruto was utterly hopeless at them. Kakashi declared him unteachable by the third day and moved him back to chakra control exercises and practicing his ninjutsu. The other two did well with genjutsu and Naruto could use the time to perfect his other work. Whereas he would never let his students get away without knowing a few basic ninjutsu, genjutsu was a different area and sometimes you just didn’t have the talent for it. Naruto accepted it with good grace and went back to blowing himself up with ninjutsu quite happily. \nHe didn’t let them get away with no physical activity of course and mornings were still dedicated to exercising and sparring. His students seemed to enjoy actual jutsu lessons more though, as younger ninja usually did. Something about being able to bend elements and making illusions seemingly cooler than just kicking. \n.--.\n“How does this look, Kakashi-sensei?” Sakura asked hopefully, holding her paper up to the light of the fire.\nKakashi took it and titled it towards the lantern light near his own pile of papers. He peered at it carefully, giving it due consideration.\n“Very good Sakura. Your symbols are very neat and tidy. Work on infusing your chakra a bit more.”\nShe beamed at him and set to practicing again. Sasuke held his out without a word.\n“Good. Your symbols could stand to be a bit wider, especially these ones, so they interact better, but your chakra flow is good.”\nSasuke shot Naruto a smug look as Naruto held his own work up beaming. \n“Um…,” Kakashi said, turning the paper around, not sure which way was up, “I don’t know how you did it, but despite the fact I have no idea what I’m looking at it is ready to function.”\n“Hear that!” Naruto cheered, “I’m better than you at sealing Sasuke!”\n“Naruto, bragging is unattractive,” Sakura said blandly.\n“But Sakura!” Naruto whined. \n“I suppose I should have assumed you’d be good at this,” Kakashi hummed.\n“Huh, what, why?” Naruto demanded.\nHis eyes had narrowed as he looked at Kakashi almost nervously. Kakashi glanced down to where the boy’s hand crept up his stomach. Kakashi wondered how the boy had drew that conclusion.\n“Because your mother was an expert at sealing,” Kakashi said.\nA harsh silence fell over the camp. Naruto had frozen up, going stiff and still. Sakura and Sasuke turned to Kakashi with surprise, both knowing full well Naruto was an orphan.\n“M-my mother?” Naruto stuttered.\n“Yes. Uzumaki Kushina. Amazing woman,” Kakashi nodded, aiming for a light tone.\n“You knew her?” Naruto whispered low and hopeful.\n“Hey Sasuke, let’s go check the perimeter,” Sakura announced standing up and abandoning her work.\nSasuke went with no fight. Kakashi was very proud of them.\n“Sit down Naruto,” Kakashi said gently.\nNaruto sat down instantly still staring at him wide eyed.\n“I’m sorry I didn’t tell you sooner,” Kakashi started, “I should have, but I didn’t because I didn’t know how to tell you. I could use the excuse most other people use, about how your mother has enemies who would love to take their revenge out on you, but truth is, I just couldn’t bring myself to talk about it.”\n“You…you were friends then?” Naruto asked, all trembling hope.\n“In a way,” Kakashi allowed, “Her name was Uzumaki Kushina and she was from Uzu before it fell, but grew up in Konoha. She was a fierce and strong woman, and like most from Uzu, a seal master.”\nAnd so Kakashi told Naruto what he could without giving any real details away. Naruto listened attentive and desperate, shifting closer and closer until he was curled up against Kakashi’s legs. Sasuke and Sakura stayed out of the way, hovering at the edges of camp. And Kakashi told Naruto what he should have told the boy long ago. Naruto couldn’t have his father yet, but he could have his mother.\nIt made a world of difference to the small boy. \n.--.\n“ARGH! FUCK YOU SASUKE!” Sakura screamed, her angered shout echoing across the water.\nNaruto tripped over his own feet gaping at her outburst and even Sasuke let his kunai drop through numb fingers in surprise.\n“You shithead!” Sakura howled, slugging him across the face.\nSasuke fell back into the waves that lapped at the shore surprise making him freeze up.\n“Mah mah, Sakura, such cute little genin shouldn’t swear like that,” Kakashi said.\nWhat came out of Sakura’s mouth was far too filthy to repeat and Kakashi quickly covered Naruto’s ears hoping the water would block Sasuke’s. When Sakura finally cut off panting, she was starting to look less angry and more teary.\n“What has you so upset?” Kakashi asked as gently as he could.\n“He,” she swung an accusing finger at Sasuke, “Keeps pulling my hair!”\nWell. Yes, he had seen that happen a few times in spars. The thing about Sasuke that made him unlike his two teammates was he didn’t hesitate to fight dirty. While Kakashi knew Sakura and Naruto had it in them, they didn’t use any dirty tricks in team spars despite Kakashi having told them such things were quite helpful. Naruto had this idea of fairness and Sakura had been raised by civilians who usually tainted shinobi stories with things like honor. Sasuke though, had been raised by ninja. He had also seen his whole family massacred before him and things like that could seriously destroy any idea of honor. So Sasuke didn’t even seem to consider it fighting dirty, it was just fighting. \nAnd Sakura’s long hair was such a tempting thing to get a grip on and yank in the middle of a spar. \n“Tch, it’s an easy tactic,” Sasuke said, wiping water and sand from his face as he stood up.\n“It hurts!” Sakura shouted back at him, sniffling.\n“Maybe if you weren’t such a girl,” Sasuke sneered. \nNaruto ‘meeped’ sensing the danger rising at that comment.\n“What’s wrong with being a girl?!” Sakura demanded.\n“…Nothing,” Sasuke admitted with a growl, “Except you spend so much time on your stupid hair when you could be learning to fight better.”\n“Stupid?!” Sakura asked, voice shrill, “Fuck you! My hair isn’t stupid!”\n“It’s a liability,” Sasuke sniffed.\n“A liability!?”\nKakashi was wondering if he was going to have to get between them before Sakura throttled Sasuke. The possibility grew as Sakura whipped a kunai out. \nAnd then she grabbed a fist of hair and started hacking.\n“Fuck you Sasuke! And fuck ‘a liability’!” she yelled, as she slashed at her hair, the boys gaping at her, “I am not a liability.”\nSakura hew off the last large chunk and threw it on the ground at Sasuke’s feet, panting and red faced. Sasuke gaped at her, full open mouth and wide eyes. \nThen Sakura burst into tears.\n“Okay, you boys go take a break,” Kakashi said, quickly shooing the two boys away to do damage control. \nThey left quickly, still unsure of how to treat emotional girls. Kakashi crouched in front of Sakura, tugging her hands away from her face as she sobbed nosily.\n“Mah, that was a bit dramatic,” he smiled.\n“I’m stupid,” Sakura sobbed looking at him through teary eyes and a red face and a snotty nose.\nHe sometimes forgot how young these kids were, but looking at her like this he was reminded they were indeed children.\n“Sasuke was right, I’m a liability. I’m stupid and a crybaby,” she choked out trying to tug away as she looked at her feet and the pink strands littering the ground.\n“Ne, Sakura, look at me.”\nSakura did so slowly.\n“Crying is not a bad thing. You are allowed to cry,” he told her softly, “Emotions are not a weakness. And you’re very far from stupid. In this situation I would argue that Sasuke is the stupid one for upsetting you so. Boys should know making girls cry is just rude.”\nShe gave a half choked watery laugh.\n“Now. I feel like this was a while in coming. Why do you feel like a liability?”\n“I…I cant keep up with the boys,” she sniffled, “I’m trying. I’m trying really hard and they just…they just do everything so much better! I can’t win any spars against them and I can’t do as many ninjutsu and my taijutsu is sloppy and…and...”\n“Shh. Take a deep breath,” he soothed rubbing circles on the top of her hands with his thumbs, “Sakura, Sasuke and Naruto are both powerhouses in their own right. Most of the genin would have trouble keeping up with them. There is no shame in not being better than someone. You are doing fantastic. Neither boy has your control with chakra or your skill with genjutsu. Even your sealing is solid. And neither can ever hope to beat you in knowledge.”\nShe had stopped crying so hard during his talk and was mostly just sniffling now looking at him so heartfelt he wanted to give her a hug.\n“Sakura, you are a very good genin,” he said honestly, “and you shouldn’t ever feel as if you are lesser just because someone is better. You are working really hard and I am very, very proud of you.”\nShe surprised him by throwing her arms around his neck, hugging him tightly.\n“Thank you,” she whispered in his ear.\n“Mah, you’re all my cute little students and I’m very happy to help. Talk to me if you ever feel this way again okay? Don’t bottle it up. I know what it’s like to do that and it never ends well.”\nShe nodded against his neck and he pat her back a tad awkwardly.\n“Now, why did you chop off your hair? Was that just a spur of the moment, anger driven action?”\n“I was getting so annoyed,” she admitted, “He kept pulling at it in spars and it did hurt. Plus it kept getting caught in the trees and bushes. And it gets dirty so easy when it’s long. I like it long but it was getting really annoying.”\nThat was probably partly his fault. He had admittedly wanted to press on her that looking perfect everyday was not reality for a ninja. So he had not allowed her to spend too long on it and made sure to aim her at mud puddles and Naruto’s smoke bombs when they spared. But he had expected her to put it up, braid it, or wrap it, not chop it off.\n“Would you like a hand evening it out?” Kakashi asked carefully as he ran a hand through the choppy uneven length.\n“Please,” she said pulling back from the hug to wipe her nose, “And I’m sorry, I got snot on you again.”\n“Mah, it won’t kill me,” he smiled at her embarrassed face. \nThen he made her turn around as he took out a kunai and tried his best to even out the mess she had made of her hair. In the end it was very short in the back only an inch at most. The sides were a tad more salvageable and he let them taper past her chin. \nWhen they wandered back into camp the boys were trying to look busy. Kakashi knew they had eavesdropped on the whole conversation. \n“Wow! Sakura your hair looks great!” Naruto said immediately and with great enthusiasm. \nSince it was Naruto it sounded 100% sincere as well and Sakura’s shoulders relaxed just the slightest as she offered him a small smile. Then Sasuke stepped forwards and her shoulders hunched up again, defensive.\n“…I’m sorry,” Sasuke blurted out, “I didn’t mean to insult you. You…you are getting very skilled.”\nShe stared at him as if trying to divine if this was the truth.\n“And, I like your hair like this,” He finally said, mumbling.\nShe beamed at him.\n“Thank you,” she smiled. \nKakashi nodded to himself. All was well.\n.--.\n“Okay kiddies, I have a treat for you,” Kakashi announced interrupting the three-way spar on top of the ocean waves.\nThey ignored him, exchanging blows and dodging around him as if he wasn’t there.\n“My cute little students, ignoring me!” Kakashi said, put his face in his hands as if he were crying.\n“Your surprises are usually painful,” Sakura said shortly, throwing Naruto over her shoulder straight into Sasuke. \n“Yeah! They suck!” Naruto yelled, as Sasuke braced and let Naruto use his back as a springboard so he could fly right back at Sakura.\n“No trust!” Kakashi sniffled, “Fine, no weapons for you then.”\n“Weapons?” Sakura perked up right before Naruto drop kicked her into the water. \nSasuke turned to focus on him with a sharp keen gaze. Only for Sakura to tug him under the waves as well.\n“Like some badass sword?!” Naruto demanded right before his teammates came at him from two different sides, bursting from the water. \nHe waited till they finished their spar, pulling themselves onto the beach, squabbling. \n“I don’t know enough to teach you about any weapon enough to be a master, but I’ve copied a lot of basics,” Kakashi said when they finally sat at his feet looking eager, “And at least one weapon is always a good thing to know. Can anyone tell me why?”\nSakura’s hand shot in the air.\n“It gives us reach,” she said eagerly, “Like if they have a contact poison or lean towards poison weapons its best to keep out of their reach. A sword or something would keep hands away from you.”\n“Good, any other reasons?”\n“If we can’t use chakra,” Sasuke said, “It’s an extra edge over just fists and feet.”\n“It also looks badass!” Naruto cheered. \n“Now, this is going to be a personal choice,” Kakashi said, “But let’s go over some weapons and their history and advantages first. Starting with the tanto.”\nEven Naruto listened as Kakashi gave them a lecture on a wide variety of ‘classic’ weapons from swords to fuma shuriken to specialty knives and on; what pros and cons he knew about them. Finally, he pulled out a sealing scroll he had brought along just for this purpose. \n“I’ve been on a lot of missions,” Kakashi prefaced, “and it’s such a waste to leave good weapons behind. But I’m too lazy to go get them evaluated and sold every time, so I stock-pile. You kids are lucky I haven’t been by to sell them for a few years.”\nWhat he released from the scroll was a veritable mountain of weapons. Naruto practically had hearts in his eyes and Sasuke’s gaze was very evaluating. Even Sakura looked interested. \n“Don’t cut yourselves, but swing some around,” Kakashi encouraged. \nThey did so eagerly, and he made sure to keep a close eye on them to make sure no one was hurt. He watched closely to see what happened to settle in their hands the easiest.\n“Ano, Kakashi-sensei,” Sakura was the first to stop exploring, “I think…I think I would like to learn how to use this one.”\nHe looked at her unconventional choice and couldn’t help but smile. \n“That could be very deadly in the right hands,” he told her cheerfully, “So we better make sure those are your hands.”\nShe smiled up at him and gave the long war hammer a spin. It was just a plain one that was a tad aged, but it would do until she was beyond the basics. Kakashi ran through his head trying to remember in anyone in Konoha knew how to use them. He couldn’t actually think of anyone at the moment. He wondered if it spoke of her character that she had picked a war hammer. Not a blade, but a bludgeoning weapon. She would crush, not cut. She would grind her enemies underneath her. \n“Kakashi!” Naruto yelled next, pumping a fist as he grinned at his choice. \n“Interesting choice,” Kakashi chuckled.\nNaruto spun the sickle and chain and nearly cut his nose off but Kakashi thought he would do well with it. It would give him reach and would work well with his wind affinity. It also wasn’t cumbersome and could be used for capture which was more Naruto’s style. Sasuke was the last, looking over a few weapons more closely than the rest.\n“Ah, a Naginata or a Sasumata,” Kakashi hummed as the boy looked at both very carefully, “Both would be good. They give you range. The Sasumata would be good to pin opponents down to do close range jutsu or genjutsu. The Naginata would be a good one to make them keep their distance.”\n“…My mother knew how to wield the Sasumata,” Sasuke finally offered, quiet.\n“I imagine she was very good at it,” Kakashi said easily, “Do you want to follow her?”\nSasuke didn’t answer verbally, but he picked the Sasumata and nodded once. \n“Good choices,” Kakashi smiled at all three of them, “But before we get into the particulars of those personal choices, we are going to go over some weapons you are all going to carry.”\nKakashi dug through the pile to lay out a set of weapons before them.\n“The Fukiya,” Kakashi said picking up the tube, “Is very useful. I’m sure with Sakura’s growing herb knowledge we can start working on paralytics and poisons. They are a silent weapon that only really takes aims and strong lungs. They may be useful in a pinch and well worth carrying.”\nHe let the kids peer at the ones he put before them before picking up the next item. \n“Do any of you recognize these? They are not as popular these days.”\n“Are they knuckle dusters?” Naruto asked, peering at the ring with a spike on it.\n“Nope. They’re karute,” Kakashi said, slipping one on, “They’re actually worn with the spike hidden in your palm.\n“Why?” Sakura asked, frowned.\nKakashi waved her up and when she stood in front of him her made a grabbing motion.\n“See where that would end up?” he asked.\n“Oh,” Sakura said in surprise, “It would puncture my skin or at least tangle in my clothes.”\n“It’s to help with your grip,” Kakashi nodded, “Naruto, you would suit these well with your brawler style.”\nNaruto already had one on every finger. Kakashi rolled his eyes and picked up the next item. \n“Here are the knuckle dusters. They are useful to add some more damage to your hits,” Kakashi told them, “And they can be used to deflect weapons as well. But you have to be very precise and sure in that instance since it isn’t a large surface. Sasuke, with your precise style they could be an advantage.”\nSasuke looked at them closely, turning them over in his hands.\n“Now, onto some less conventional weapons. I don’t actually have any for you. These are from my own collection,” Kakashi said holding up the first one, “This is a tessen, I’m sure you’ve heard of them. Careful, it’s very sharp.”\nHe passed the small folding fan about and they each peered at it.\n“The Tessen is reinforced with steel spines. Generally people use them to bludgeon. They are also sharp as a kunai though, and can slice in an emergency. They can also be invaluable for wind jutsu, helping give a bit of a kick to an attack.”\nNaruto perked up at the element he had the most luck with. Kakashi hadn’t tested them yet, but Naruto was most likely wind element. \n“And here is a weapon you will rarely see these days. This was my grandfathers.”\nKakashi held up the long thin pipe almost two feet in length.\n“It’s made of steel and fully functional as an actual pipe, but getting hit by one of these in the head can crack a skull.”\nSakura gave a whistle of appreciation at that.\n“You can also sharpen the end,” Kakashi said motioning to where it would be placed in your lips, “My grandfather killed a man by shoving it through his eye. Said the next smoke was even better.”\nThey all wrinkled their noses and Kakashi chuckled at them. \n“And while I don’t know how to do it myself, my grandfather used his with his fire element. He could create a smoke thicker than a smoke bomb with it.”\nNow Sasuke looked a tad more interested.\n“And I know a decent number of his friends who claimed he smoked some poisonous mixtures that would create poisonous haze that was deadly in enclosed areas.”\nNow Sakura perked up. Kakashi had been starting to teacher her less of the medical side of plants and more what he knew about the deadly side.\n“These two are very useful weapons in discreet situations,” Kakashi said, folding the fan ad pipe away, “And here is the last weapon I’m definitely going to train you on.”\nThey stared as he pulled out a long bow.\n“Any guesses why?” Kakashi asked as they stayed silent.\n“For long distance,” Sakura said immediately. \n“Yes. But why? Why not just kunai?”\n“Arrows can go farther and keep more force,” Sakura said, “Especially out of a bow that size.”\n“We could stay out of sensing rang and snipe people,” Sasuke said, eyes narrowed in thought. \n“And disappear before they even realize where we are!” Naruto grinned. \n“And if, you say, wrapped an explosive seal around an arrow?” Kakashi asked off handedly.\nNaruto’s grin was unholy.\n.--.\nWhen they had all mastered the seal to store items, Kakashi let them have the evening off. Not that there was much to do alone in the woods though, so they ended up sitting around the fire anyways, asking Kakashi questions about their lessons or anything they could think of. \n“Do you have any hobbies other than porn?” Sakura asked, partly exasperated as Kakashi talked to them over top of Icha Icha.\nHe wanted to giggle and tell her they had it good. He had actually set the book down most days to help them out. \n“I have some hobbies,” he drawled in a tone he knew pissed them off. \n“Like what?” Naruto badgered, “Being lame?”\nSasuke gave Kakashi a flat, unblinking, stare that was actually a tad unnerving.\n“I rescue puppies,” Kakashi said aloud.\nWhich wasn’t even really a lie, hilariously enough. They gave him suspicious looks and he smiled innocently at them.\n“And I do challenges with my eternal rival. A man who wears green spandex and has a bowl cut.”\nNow they were just looking disbelieving. \n“I also play the shamisen.”\n“Okay, I call bullshit,” Sakura declared, “None of that can be true.”\n“Well, maybe the puppies,” Naruto chimed in, “I mean, Kakashi-sensei isn’t heartless.”\n“Mah, no trust,” Kakashi said mournfully, “It’s all the truth.”\n“Prove it,” Sakura said triumphantly.\nOh he was going to have fun the day they met Gai. And his talking ninken. But that was not this day. So Kakashi pulled out a scroll he rarely used and had only brought last minute. It was a small thing, only the size of two of his fingers and tucked away carefully. In a puff of smoke Kakashi had a shamisen on his lap.\nHis students blinked in surprise and all looked up at him incredulous.\nKakashi idly tuned the instrument under said incredulous gazes. At the first note they started to lose the surprise and shifted closer, curious. In the still night Kakashi grabbed the bachi and drew a sharp note out of the instrument that had belonged to his mother before she had died giving birth to Kakashi. \nKakashi had learned when he was young and though learning her favorite instrument would be a way to get closer to her. He had a bad habit of picking up the habits of the dead (Obito’s excuses, Rin’s overstocked medical supplies, his mother’s shamisen). So the kids listened as he played them a song he had never heard his mother play but what his father had told him was her favorite.\n“You’re really good Kakashi-sensei,” Naruto said as the last note faded away. \n“Mah, your old sensei isn’t that good,” he said as he looked at the three young faces.\n“No, you are,” Sakura insisted, “My mother plays the shamisen as well and you sound just as good as her.”\n“Well thank you,” he smiled, “But I don’t know that many songs. Can you play the shamisen as well then Sakura?”\nShe flushed as all the boys looked at her.\n“A few songs. I’m not good though.”\nKakashi held out the shamisen and she dithered for a moment before she took it and strummed out an easy tune that most beginners started with.\n“Wow Sakura! You’re good!” Naruto cheered, ever the ball of enthusiasm.\n“Can you play anything?” Sakura asked the blond.\nKakashi winced knowing that would be a no. Naruto drew back, fumbling, and Kakashi gave him a soft look over Sakura’s head. There was nothing to be ashamed about being an orphan, nor with being hated for something not of your own fault.\n“I can play the koto,” Sasuke announced as Naruto fumbled, “Not very well but my mother was teaching me before-”\nHe cut off and the circle fell in an uncomfortable silence as Sakura looked up at Kakashi desperately, unsure of what to say to the two glum boys. \n“It’s always good to know how to a play an instrument,” Kakashi said, “A good hobby and good for the mind. When we get back to Konoha I will see if I can find anyone to help you more with the Koto. And I can show you a bit more Sakura. What about you Naruto, would you like to learn to play something.”\nNaruto looked surprised at the offer.\n“Yeah,” he said, almost shyly as everyone looked at him. \nKakashi smiled at them all.\n.--.\n“My cute little students! I have a surprise for you!”\nThey all peered at him suspiciously.\n“Well, I suppose your last surprise was pretty good,” Sakura allowed. \n“We’ll trust you this time, Kakashi-sensei,” Naruto declared.\n“Nh.”\nKakashi sighed dramatically. \n“Mah, maybe I won’t tell you the surprise if you will be such downers all the time.”\nThey gave him identical flat looks and he couldn’t resist. He reached out and ruffled their hair, switching when they batted at his hands until he had thoroughly messed up all their hair.\n“The capital of Tea Country is a half a day’s journey from here if we move quickly. I was thinking you might all like to go have a look.”\nThey perked up and nodded eagerly.\n“Mah, we’ll treat it as an infiltration mission. Sakura, you’re in charge of our cover and disguises. Naruto and Sasuke, you work on contingency plans in case anything goes wrong.”\n“Like what?” Naruto wrinkled his nose.\n“Anything. We will leave tomorrow morning so you all have the rest of the day to plan. Chop chop.”\nNaruto and Sasuke descended on their supply of scrolls tucked in a bin by the tents while Sakura flopped down on her log, brow furrowing in thought. \nBeyond their shelter the rain was still pouring as it had been for the past day. Monsoon season was soon. It would build character to make them work in the torrential downpour. \n.--.\n“Okay, so, Kakashi-sensei is our Master,” Sakura said, “Or, well, yours. He’s a trapper and you two are his apprentices. I’m his daughter.”\n“Why do you have to be his daughter?” Naruto wrinkled his nose.\n“Cause we’re going among civilians,” Sakura said patiently. \n“So?”\n“Civilians have strict gender roles,” Sasuke rolled his eyes.\n“Gender roles?” Naruto questioned, confused. \n“It means they think girls can only do certain jobs,” Kakashi chipped in, “And that they are unsuitable to do a lot of skilled jobs.”\n“That’s…that’s stupid,” Naruto said flatly.\n“That’s civilians,” Sakura sighed, “It’s one of the reasons I became a ninja. It’s a bit better in ninja villages with ninja politics being so prevalent, but I still would have been married off an expected only to be a housewife if I had not become a shinobi. I could have helped run my husband’s business or such, but I wouldn’t be expected to work outside the home much, especially not in labor jobs.”\nNaruto gaped at her, and even Sasuke raised a brow.\n“But, but girls are just as good as guys,” Naruto protested, “And you’re strong! I mean, you can hit harder than I can!”\nSakura flushed, pleased and embarrassed. Kakashi nodded sagely behind Naruto. Their cute little pink teammate could hit really hard. Kakashi had been surprised at first before he realized she had been continuously focusing chakra to her limbs with her near perfect control. A few months of that started to naturally augment muscles and strength. Sakura must have been doing it instinctively for years because even without the use of chakra she could pack a punch. \n“Okay, so I’m a trapper, and you two are my cute little students!” he said, ruffling the boys’ hair, “That means hidden weapons and civilian clothes.”\nThey grumbled but obeyed. Instead of trying to find clothes that would blend in, and which they didn’t have, the used small henge. It wasn’t ideal for ninja places, but in the capital of Tea Country, it was fine. Sakura did the same but used a small genjutsu so it looked like she was wearing a worn yukata. \n“Okay, all ready?” Kakashi double checked.\n“Yes!” The chorused.\n“Let’s go then,” he said cheerfully.\nThey ducked out of the trees onto the dirt road and started too head in the direction of the town that was close to four hours from where they had slipped from the woods. It would be a bit of a ways to jog but his kids seemed to enjoy the journey as the bound along the road. It had finally stopped raining and the kids jumped over the puddles happy to be out and about and dry, even if it was only six in the morning.\n.--.\nThe capital of Tea country was surrounded by a simple wooden wall with guard towers that was more than good enough for simple bandits and wildlife but would never work against ninja. Since they brought no goods to declare they passed by the guards with simple nods. He students looked around with curiosity and excitement, none having been anywhere other than Konoha. \n“Okay, I take it when I told you to pack back in Konoha you all packed cash?”\nThey all nodded.\n“Good. Cash is always a good emergency item. If you ever lose supplies or need to blend in, cash is a must. You may, of course, spend some today.”\nThey nodded eagerly.\n“Every two hours we meet back here, on the hour, to check in, okay?” he said, looking at them seriously. \nThey nodded again.\n“Good. And Sakura, unless you henge to look like a man, it isn’t smart for young civilian girls to wander around. I trust you to look after yourself but it draws questions. Think of this as a test. No one should ever suspect you are ninja.”\nThey all nodded solemnly, but when he gave a dismissive wave they all took off with wide grins. He was happy to see they all stuck together despite the fact he had given them permission to split up. He could have insisted on staying together, but to be honest, the kids did need a break. He had a disguised clone following them just to be careful anyways. It probably wasn’t need, but they were only genin and they weren’t in Konoha and that meant supervision. \nKakashi himself headed off with a few destinations in mind.\n.--.\n“Sensei, you gotta try this!” Naruto greeted him at one of the check-ins, holding up a stick with some sort of cheese meat thing on it.\nSo Kakashi did what no one in Konoha could ever say they had seen him do. He tugged his mask down and took a bite. None of his students batted an eye at his face, simply waiting for his opinion on the food. \nKakashi wanted to grin at them again. He had considered it for a long time when he first took them as students, when he had first started to treat them as real students, when he had first realized this was going to be his team. And Kakashi had decided that if he was going to put the time, effort, trust (love), into this team, it had to start with him as well. \nThey didn’t even understand how absolutely crazy it was to see his face. He had not made a big deal of it and they had not asked about the mask. He took it off to eat, to drink, to simply wring it out when it got wet. They thought it was normal to see his face. \nHe couldn’t wait till they realized what a rarity seeing his face. He couldn’t wait till the rest of Konoha realized they had seen his face. Kakashi had been keeping hidden for a very long time and could count on one hand the number of people in Konoha who had seen his face.\nHe looked at their curious faces, waiting for approval of the food and having no idea the show of trust (and love) he was giving them. \n“Very good,” he approved, “Have you been being good?”\n“Of course!” Sakura and Naruto chorused.\n“I got some souvenirs for my parents,” Sakura added, “Tea of course.”\n“And I got some for Jiji and Iruka!” Naruto cheered.\n“We also found some beautiful yukata,” Sakura sighed, “But they were too much.”\n“And of course food!” Naruto grinned.\n“Good good, and how have you been enjoying it Sasuke?” Kakashi raised a brow at the most quiet member.\n“…It has been fine,” Sasuke said, looking away.\nHe smiled at his more sullen student but could see he was enjoying it as well. \n“How about you Kakashi-sensei?” Sakura, the ever thoughtful one prodded.\n“Mah, I’ve been enjoying it. Now, go off and explore a bit longer. Next time we meet up we have a few things to do and then we are leaving.”\nThey nodded and took off again, Naruto bee-lining for a food stand.\n.--.\nKakashi had indeed kept himself busy as his team ran around the town. His first stop had been a geisha house to talk to the matron. He had revealed himself to be a ninja for said purpose because she would never have come to talk to a regular trapper. It took some quick haggling and a great deal of charm to buy a few older training instruments that her maiko used. It wasn’t cheap, but it would be the only place to get them on short notice. Then he convinced her to let him copy some of the girls playing. That took a bit more money but she was interested enough to see how he would do it that she allowed it.\nThe hushed gasps and whispered when he uncovered the spinning sharingan were normal. The girls were a tad nervous but a few braver ones played for him as he focused on their hands. Kakashi made sure to thank the matron and the girls before vanishing in a swirl of smoke and leaves just to impress the girls peering around the doorways to watch.\nHis next stop was at a black smith with his cute little students weapons in hand. Since they were weapons he had gotten off his dead enemies, he wanted to make sure they would truly stand up in combat. The blacksmith declared the Sasumata to be in good shape and made of very decent craftsmanship. He declared the same of the sickle and chain but said the hammer would was poor quality and would not last well in a heated battle. \nSo Kakashi made a note to order a better hammer for Sakura. The weapons shop in Konoha that supplied more unique and varied weapons would most likely have one in a dusty corner. He’d send a message with a ninken asking to have one sealed and sent his way soon. \nThen Kakashi went to a few bars, hopping from one to another just long enough to pick up on gossip. None of it was very important at the moment except some rumors about bandits near the border, but you never knew. And civilians could be canny. They tended to gossip more than a shinobi because no one threatened them with death for it. \nThen he went to meet with his students again.\n.--.\n“Okay, first thing we need to do before we can head home, is supplies,” Kakashi clapped his hands together, “Specifically thing’s that last like Rice. Remember, the scrolls will slow down things like rot but won’t stop it completely. Same with things going stale. So try to pick longer-lasting items. Since you can all do sealing scrolls decently we can carry more as well. And what is a saying about being over prepared?”\n“There’s no such thing if you can carry it all!” they chorused with rolled eyes.\n“Good!” he beamed at them, “So let’s go get supplies.”\nHe made them take turns haggling as they went between vendors. Sakura proved to be the best at this, though she admitted her parents took her shopping and had her do the same sometimes, especially with supply vendors for their shop. Naruto was decent at it as well as he was just so cheerful and friendly everyone seemed to like him. Though he could be taken in with a sucker story since he tended to be a tad gullible and too kind. \nSasuke was the worst of the three for the simple reason you had to talk and say more than one sentence which he seemed to struggle with. It had Kakashi wondering how often Sasuke had actually talked to be people or been able to hold one on one conversations outside of the classroom. If Sasuke had been isolated aside from class it would explain a great deal. \nThey stocked up on rice, beans, jerky, and other such more preserved foods, Kakashi lecturing his students on proper nutrition. He had already given them such talks of course over the last few weeks. Sakura had needed it because after having a stable camp she had tried to fall back on dieting again, but he had dissuaded her of that notion after a few exhausting harsh physical days that showed she needed more stamina.\n“Now,” Kakashi said when they had had everything sealed away in a discreet alley, “What else could we possible need?”\n“Clothes,” Sakura said immediately, “I mean, most of ours is pretty…damaged.”\nShe wasn’t lying. He had pushed them and pushed them hard. And clothes didn’t stand up that well sometimes, even shinobi clothes. Naruto and Sasuke being boys had not thought too much on clothes and has only brought a few outfits each. Even though Sakura had brought more it had also suffered. Kakashi had been extra vicious towards the clothing he deemed ridiculous. Naruto’s orange jumpsuit only lived because he had given up and sealed it away. All Sakura’s flimsy red dresses had been shredded trough training. Even Sasuke’s pristine white shorts were no longer white. When they were powerful ninja who didn’t have to give a fuck about being discreet they could wear what they wanted, until then they needed every advantage.\nOf course they all knew how to do basic mending but things never looked good after you had to patch up a hole bigger than your hand. So every outfit was looking a tad hole-y. They had outfits and weren’t going to freeze or be exposed to too many elements, but they did look a little rough. Almost like they had been training in the woods for weeks. \n“Fair enough. We’ll find a place.”\nAnd they did find a place that was geared more towards travelers with thicker more durable clothing. Since none of his students planned to wear it forever, most likely aiming to get more shinobi clothing, they mostly picked things out that would make them look a little less like feral children. \nAll three bought dark trousers that were a tad too loose for ninja, but would do for now. Then Naruto and Sasuke bought dark shirts, in green and blue respectively. Sakura went for a tad nicer looking short kimono top that was made of thick woody-red material and held shut with a thick black obi. Their travel cloaks (also looking very warn in now) could go over top. To top it off they bought some extra material, whispering about how to cut it into strips to use to die down loose pant legs and sleeves.\nKakashi was proud of them as they strode out of the capital restocked and relaxed in early afternoon. They set off at a light jog once out of sight and his students looked even more relaxed and cheerful after a day of fun. Only two hours into their jog Sasuke fell back from where he had been scouting ahead to mention a group of wagons ahead of them. \nAs a group they slowed, setting their pace closer to a civilians and henging backpacks onto their shoulders. Unencumbered by a group or wagons, they made a show at catching up to the wagons. \n“Ho, you folks heading towards Fire Country?” a man asked when they caught up to the small group of merchants\n“We are,” Kakashi answered idly, “Are you?”\n“We are. You would perhaps be better to stick with us though folks,” his partner said, “There have been rumors of bandits on this road recently. Larger groups tend to be unscathed.”\n“Sure,” Kakashi agreed, having heard such rumors from the bars as well, “I’m Hataka. This is my Daughter Hiromi, and my apprentices Kimako and Nagao.”\n“Nice to meetcha,” the first one one grinned from his seat, “I’m Higashi and this is Rei. If the little miss wants she can hop up on the wagon with us.”\nSakura gave a shy smile and let Kakashi lift her up into the back of the wagon filled with bags of what looked like tea. Kakashi watched them all carefully as Naruto quickly grew bored of the slow pace and dragged Sasuke into running ahead a bit to poke at puddles and bugs. Sakura chatted happily with the two men when they asked questions, her background from a shop-keeper civilian family helping her out. \nKakashi watched his students fondly as they took the time to act like the kids they were even as they seamlessly blended in with the civilians.\nIt was not a surprise when they ran into bandits almost an hour later as the hour grew later, dusk on the horizon. Kakashi had been expecting it really since he had heard of the rumors in the pub. He had even been going to lead his students to root them out but this had worked out better.\n“Give us all your valuables!” the leader menaced, sword drawn as the rest of the group surrounded the set of wagons and travelers that had made up this small group, “And leave the women as well!”\nKakashi eyed them, surprised they had even attempted to rob a group as large as this one. A few merchants had swords as well, but looked wary of drawing them with how surrounded they were.\n“Ooh! Dibs on this one boss!” one bandit laughed, grabbing Sakura’s arm and yanking her off the wagon bench, “Look at her coloring!”\nKakashi didn’t even have to say go. Sakura had lashed out as soon as she was pulled free of the wagon, a kunai going for the man’s throat in an instinctive slash. Naruto and Sasuke hadn’t hesitated a moment seeing their teammate in danger. Sasuke came in low from the left going for the legs while Naruto went high, aiming a kick at the man’s head.\nHe was dead before he hit the ground and it was hard to tell if it was the slashed throat, the broken skull, or the deep cuts through his femoral arteries that nearly separated his legs from his body.\nFor a moment silence rang out as he students stared at the first man they had killed. Then they looked up at the rest of the frozen bandits.\n“Well, go get them,” Kakashi smiled, waving at the surrounding men.\nThe bandits tried to flee realizing they were ninja, but his cute little students were cute little monsters. Only two more bandits died, one when Sakura underestimated her strength and ruptured a man’s stomach, the other when Sasuke aimed for a man’s chest and cut right through his throat when he fell forwards unexpectedly. Naruto had used considerably more restraint and the rest were knocked out and bound. \nKakashi waved the civilians off mid battle and though they were grateful for the save, they were also grateful to get away. One left Kakashi and his students a bag of mochi as a thank you and the wagon drivers had left them some very high-quality tea before they were gone.\n“Good job,” Kakashi smiled at his students as he looked them over, “You were all very calm and collected and reacted accordingly. I’m very proud of how you helped your teammate with no hesitation.”\nThey nodded faintly, all looking a tad green about the gills.\n“Let’s head back to camp. We’ll go over it later.”\nThey would also need to talk about their first kill and would probably need some reassuring words. So Kakashi sent them ahead and then dealt with rest of the bandits. There was no point in trying to haul them back to the city. \nThat night they talked softly around the fire and drank rich matcha tea with mochi.\n.--.\nOf all of them, it was Naruto who took the first kill the hardest. Sasuke had already seen death dealt so often that while he had been initially surprised, he was over it. Well, not over it, but he had long since been broken and one kill wasn’t going to change that. Sakura on the other hand had been more shocked at how easy it had been than the fact she had killed someone. \nNaruto though, well Naruto put a lot of stock in life. Kakashi could tell Naruto would be one of those people who always despised killing. It just sat wrong on his shoulders and his mind. \nSo Kakashi fought off Naruto’s gloom by running him into the ground and physically exhausting him. Then, when they were all beaten and tired he pulled out the new instruments he had bought. \n“Practice ones,” he said as Sasuke ran his hands over the old worn koto and Naruto spun the bamboo flute around, “You probably have your mother’s koto tucked away, but I thought you may like one to practice on with no fear.”\nSasuke dipped his head in the barest show of gratitude, eyes lingering on the strings as if he saw ghosts. \n“Now, I said it the other night; Music is a good thing for you to learn. It will never be a waste of your time,” he said smiling, “Use it to release emotion and stuff. Kind of like free art therapy.”\nThey gave him raised brows and incredulous looks at that delivery but they all looked over their instruments. \n“Show us what you can do Sasuke.”\nAnd so Sasuke slid on the finger picks and plucked hesitantly at the strings as if trying to dredge up old memories of how to play. It was a simple tune and Kakashi could tell he had missed a few notes. But he was past the very beginner level at least and knew his strings. \nKakashi tuned it by ear and showed Sasuke the first song he had learned from the maiko. Leaving Sasuke to fumble over his strings he glanced at Sakura but she was doing her own thing with his shamisen. Then he turned to Naruto who was going red in the face trying to make the flute make sound.\n“It’s a tad tricky,” Kakashi agreed.\nNaruto pouted and tried again to no avail. So Kakashi pulled his mask down and tried. He showed Naruto a few notes and then backed off, watching with amusement as it took ten minutes for Naruto to make even a single note.\nHe had been serious though when he said music was free art therapy. Plus, perhaps it would teach them some more patience.\n.--.\n“Like this,” Kakashi corrected, straightening Sakura’s arms.\nSakura shifted but didn’t look away from her target.\n“Here it comes,” Kakashi murmured.\nNaruto was raising holy hell on one end of the woods near them while Sakura and Kakashi sat poised on a small cliff shelf. Sasuke was somewhere behind Naruto helping drive prey towards them. Sakura remained focused on the break in the trees in front of the cliff, patient and still. \nWith a flurry of movement a buck came leaping from the bush, driven away from the boys and their noise. Sakura didn’t even hesitate for a moment, letting the arrow fly.\n“Good aim!” Kakashi praised as the buck dropped instantly.\nSakura beamed and scrambled down the cliff wall with him as Naruto burst from the underbrush.\n“Didja get it!” he yelled.\n“We got it,” Sakura cheered. \n“Yay!” Naruto whooped, “Sauske got a bird too!” \nSasuke emerged behind him with a pheasant in a hold and a smirk on his lips.\n“Good job,” Kakashi congratulated them, “Now, let’s go hang the deer. We’ll skin it later and then let it hang overnight before we butcher it. We can catch some fish while we wait and tomorrow after taijutsu practice, I will show you how to smoke it so we can keep it longer.”\nThe kids nodded excitedly. He would send them out for some fungi and tubers tomorrow as well. He was damn well gonna make sure his kids could survive no matter what situation they found themselves in. \n.--.\n“It’s time we had a serious discussion.”\nSasuke looked up at him, startled. Not that Sasuke was an expressive boy but Kakashi could see the flare of his eyes, the way his mouth twitched, the way his fingers made for hand signs. He may not be overly expressive, but he was a twitchy boy when startled. \n“A discussion,” he said flatly, to hide his surprise.\n“Yes,” Kakashi nodded, “Do you know why I was picked to be your sensei?”\nSasuke shot a discreet look after the other two who were sparing on the waves again and furrowed his brow.\n“You are a legendary jonin, an ANBU at one point,” Sasuke said, because they had all seen his fading tattoo, and the walking library that was Sakura had recognized it even if he gave them no conformation, “If…that man ever decided to come back and finish the job, you would be able to fend him off.”\nKakashi blinked. He had…he had not considered that might be the angle Sasuke was looking at. He had not thought Sasuke still…had a fear of Itachi. Kakashi felt like he had been caught flat-footed. He had not even considered that while Sasuke obviously hated Itachi, he also highly feared him.\n“I could,” Kakashi said with no hesitation.\nAnd it was honest. Oh he might not be able to defeat Itachi for that man was a monster and Kakashi would know having been his ANBU captain (and knowing Itachi would have been further pushed by a criminal lifestyle on the run) but at the very least Kakashi would make sure he never touched a single hair on his student’s head, even if it meant his death. Team Seven above all. \nMaybe a few months ago Kakashi would have been less sure of himself in the face of an S-ranked criminal, but his cute little students weren’t the only ones getting a work out with all this training. Kakashi’s own control and strength had been improving in leaps and bounds with all the activity and clones he used on a daily basis. In fact, he felt like he was back up to par of his glory days as an ANBU captain. \n“But that’s not the only reason,” Kakashi said, pulling from his thoughts.\nDespite the fact that Kakashi had shown them his face, that he peeled his mask back regularly, he had never lifted his headband. He did so now, red sharingan spinning as it opened. With the clarity it revealed, Kakashi could see the moment Sasuke stopped breathing.\n“I got this during the war,” he said, “from a friend.”\nSasuke didn’t breathe for a long moment and Kakashi let that sink in, let it sink in that this wasn’t doujutsu theft and had happened long before the slaughter. \n“Who?” Sasuke finally croaked.\n“A cousin of yours, Uchiha Obito,” Kakashi said softly, trying not to let the grief well inside of him, “We were on a genin team together and he died to save me and our teammate.”\nSasuke swallowed thickly as Kakashi slowly tilted the headband back over his eye.\n“I’m mostly learned it through trial and error since the Uchiha refused to teach me,” Kakashi said, “But when you awaken yours, I can help you.”\nSasuke gave a slight, shaky bow of acknowledgement and turned on his heel. Kakashi watched him run towards Sakura and Naruto, less graceful and more like a child running from something that troubled him. Sasuke collided with the other two, tackling them into the water and Kakashi watched fondly as they all started squabbling and fighting. Kakashi could practically see the tension drain from Sasuke and allowed a small pleased smile as Naruto and Sakura both caught on to it and squabbled louder to distract the boy.\n.--.\nKakashi watched as his students sunk into an easy meditation. He had gotten them into the habit of doing it everyday before lunch. It was a good way to unwind and find themselves, centering their thoughts and bodies. Naruto had had the most trouble at first, but now Kakashi was proud to see he fell into it easily, even upside down from a tree branch. Sakura meanwhile, was amazingly meditating on the open water, the waves bobbing her up and down as she drifted. \nKakashi let his students be and returned to the scroll he was writing on. He had a request of the Hokage and he would need to use all his manners and his rarely used legible handwriting to make sure he got it.\n.--.\nKakashi read the scroll carefully and then glanced at his genin, with a wide smile.\n“Okay kids,” Kakashi yelled out, “Stand to attention!”\nThey hesitated only a moment, never having had such a command, but they all also knew the importance of listening to his commands and as such dropped what they were doing to stand, looking at him curiously.\n“We’ve been assigned a mission.”\nAnd there was the excitement as they all looked at him eagerly.\n“It’s our first C-rank,” Kakashi smiled, “We are going to escort a bridge builder to Wave country and act as a guard while he completes it. Questions?”\n“Who are we guarding it from?” Sakura asked immediately, “Ninja?”\n“Bandits, which means civilian or low-level ninja, like academy drops outs or genin missing-nin.”\n“Duration?” Sasuke asked.\n“Most likely a month,” Kakashi nodded.\n“When do we leave?” Naruto asked, bouncing in place.\n“Two hours.”\nThey froze.\n“T-two hours?” Sakura stuttered.\n“Better get packing kids,” Kakashi grinned evilly.\nThey stared at him aghast. And then they were a flurry of activity.\n.--.\n“Sensei, don’t genin usually have to do a certain number of D-rank before they can take a C-rank mission?” Sakura asked as they flipped through trees at a steady pace.\n“Mah, D-rank are generally meant for trainees and those stuck in the village on downtime since D-rank don’t extend outside of Konoha’s territory, so fresh genin usually get assigned them during training. They also help out with teamwork. But since we have been working outside of Konoha’s walls for a while now I asked for permission to skip D-rank for now.”\n“You’re the best sensei!” Naruto cheered at that.\n“Don’t be so excited,” Kakashi said amused, “Before you can enter the chunin exams you have to have at least 30 D-rank finished or special permission from the Hokage. So when we return after this mission we will have to get started.”\n“What sort of special permission?” Naruto asked slyly. \nThey all knew he was close with the Hokage but Kakashi knew that the Hokage would trust Kakashi’s opinion on their readiness before Naruto’s needling.\n“The Hokage is in charge,” Kakashi said dryly, “He can, in essence do as he pleases, such as allowing students to do things without reaching certain markers of development. But he is also the one who put those markers in in the first place, so he probably won’t let you cute little kids get around them.”\nKakashi didn’t say that the Hokage would if Kakashi asked. When Kakashi had laid out his training plan before the Hokage he had expected at least some resistance. When he said he was taking three genin out of Konoha’s protective walls to train in isolation he had expected a ‘no’. But the Hokage had surprised him. Sarutobi had leaned back and asked Kakashi why. And when Kakashi had explained he wanted them to survive, to live, no matter what the world threw at them (and it would throw things at the Last Uchiha, The Kyuubi Jinchuriki, and the unfortunate soul who was their teammate).\nAnd the Hokage had immediately granted him permission, flooring Kakashi. Kakashi knew Sarutobi trusted him. It was apparent in how much he let Kakashi get away, how much Kakashi was allowed to know, how when Kakashi asked for an audience it was granted. Kakashi knew he was one of Sarutobi’s favorites. But even he had expected resistance. Apparently he was more trusted and respect by their dictator than he had though. \nBut Kakashi was not going to tell the kids that. That might change their notion of him or something silly. It would also lead to badgering that he was not interested in.\n“Where are we meeting the bridge-builder?” Sakura asked, interrupting Kakashi’s thoughts.\n“Just East of Konoha, about three days walk out of it. Another team is escorting him until we meet up since they have a mission in a similar direction.”\n“And when are we supposed to be there?” she raised a brow at him.\nAh, she must have noticed he was pushing them quite hard each day. Well, that was to train them as well as be on time.\n“Three days,” Kakashi smiled.\n“Three days?!” she shrieked. “We’re still at least five days out!”\n“Guess we’ll have to pick up the pace than. If you have the energy to talk you must all have the energy to run!”\nThey all gave despairing groans as Kakashi pushed off the branch even faster.\n.--.\n“I can’t do it,” Naruto moaned, “I’m going to die.”\n“Think of how we feel, you stamina freak,” Sakura hissed. \nNaruto managed to make a face at her from where he was laying face down in the dirt.\n“All out of energy?” Kakashi asked mournfully looking at the heaps that were his students.\nSasuke tried to stand, as if to prove he could, and failed, muttering into the dirt.\n“Well, I suppose we can set up camp here,” Kakashi said, “We are only three hours away from the meeting point.”\n“But we have to be there by tonight,” Sakura whined. \n“Nope. We need to be there by tomorrow at noon.”\nThey all stilled before turning deadly looks on him. He grinned. \n“I lied, we had an extra day,” he told them cheerfully.\nTheir screams of rage scared away all the birds in the area, but they had no energy to attack him, so he continued grinning at them.\n.--.\nBy the time the time Kakashi sensed a group coming down the road his Genin had laid out various plans of dealing with bandits and other troubles. They had also all taken a dunk in the river a few kilometers over to wash the travel off. They were dressed neatly, carrying only small packs that held the essentials for a few days of travel. The rest was sealed up. Weapons were strapped to their backs and they all looked rested and ready, faces set politely. \nHe had to admit, they actually looked like ninja as they all stood ready in dark clothing, loose ends bound tightly at wrists and ankles and waists. Naruto and Sasuke wore their headbands across their foreheads while Sakura’s was wrapped neatly around her throat. Sasuke’s Satsuma protruded above his head, strapped loosely to his bag. Sakura had her hammer sealed in a scroll tucked in the top of her kimono-top, for easy access. Naruto’s sickle and chain were tucked at his waist. \nThey had been told not to use the weapons unless they were sure they could, or at the very least use it only if it was useful and drop them the moment they became a burden. This would actually be a good mission to test them out against low level opponents. If you couldn’t handle a weapon well it was more of a liability, but this would give them some experience wielding them in battle.\nHis cute little genin looked like proper shinobi and it brought happy tears to his eyes.\n“So cute!” he cried, burying his face in his hands, “They grow up so fast!”\n“So embarrassing,” Naruto moaned.\nSasuke gave Kakashi a look that screamed ‘you’re an adult, act like it’ while Sakura just shrugged it away, giving Kakashi a comforting pat on his arm. A team of chunin came into view with an older civilian man.\n“Hatake,” Kotetsu greeted, the only one familiar to him.\n“Kotetsu,” Kakashi greeted with an eye-smile lifting his face from his hands, “You’re relieved. We will take the mission from here.”\n“Yes sir,” they all snapped salutes. \nWithout another word they were gone, leaping into the trees.\n“How do they know we aren’t imposters?” Sasuke asked, frowning.\n“One of them was an Inuzuka. Hard to fool their noses. Other than that, this is a C-rank mission, it is doubtful anyone would go to that length to get a hold of a bridge-builder,” Kakashi explained, “And if you watched very closely you would have seen some of the silent signals I made with my posture and which they responded too.”\n“And who are you?” said bridge-builder blustered, narrowing his gaze on them, “I asked for ninja, not a group of shrimpy kids.”\nNaruto’s cheeks puffed up, indignant, but a sharp look from Sakura had him holding his tongue.\n“Team seven,” Kakashi said lazily, “I’m the Jonin in charge, Hatake Kakashi. Are you Tazuna?”\n“Yeah,” the man frowned before taking a swig from a sake bottle.\nWell this was going to be fun. At least it would make his kids get used to working with prickly civilians.\n“Let’s head out then. We still have six hours of daylight,” Kakashi said cheerfully. \n.--.\nThe first sign of trouble came four days later, a week’s travel out of Konoha at a civilian pace. Kakashi spotted the puddle as soon as it came in sight and then turned his eyes on his students. Sakura was frowning, glancing around as if she could sense something out of place but couldn’t figure out. Sasuke had tightened his fists, also sensing something off. And Naruto, well he obviously didn’t sense anything off in the environment around them. But he was very quick to pick up on the tenseness that ran through his teammates.\nAll their reactions showed something about them. Sakura was a well of knowledge and a quick evaluating mind. She had seen the puddle in the view and subconsciously realized that in this dry weather such a thing was out of place even if she hadn’t yet focused on the puddle itself as what was bothering her. Sasuke could most likely sense the faint buzz of chakra in the air from the genjutsu. And Naruto, good with emotion and reading people as he was, had picked up on his teammate’s wariness immediately. \nKakashi watched as Sakura’s frown turned deeper and felt her chakra well up. Sakura had gotten so good at dispelling low level genjutsu she didn’t even use hand signs anymore, just very precisely pulsed her chakra. The genjutsu shattered just feet ahead of them and the enemy was left surprised as they were suddenly pulled from their cover. They quickly tried to rally an attack. \nWatching his students react was like proudly looking at something you had worked on finally be unveiled.\nNaruto used his sickle to deflect a chain out of the way even as Sasuke used his back as a spring board and launched himself at the two ninja now facing them. Sakura had gone the opposite and went low, aiming at the knees with knuckledusters decorating her fists. \nOne of the ninja managed to stumble back from them, but the other had to brace to block Sasuke’s kick which gave Sakura the moment needed to break both his kneecaps. \nEven as the one went down screaming, Sasuke bearing down on him to finish the job, the second recovered. But he wasn’t fast enough. Naruto was in his face, fist drawn back. As the man stumbled from the blow Sakura was gunning for him as well, spinning neatly to nail him in the ribs with a hard fist. Kakashi winced in sympathy knowing how hard Sakura could hit, the knuckle dusters helping all the more. The sound of his ribs breaking seemed to echo. Naruto punched him in the face a second time and the man slumped, out like a light. \nKakashi looked at his students and the two ninja at their feet, one dead and one unconscious. Tazuna the bridge-builder was gaping.\n“Good job!” Kakashi eye-smiled, “Now, did their claws touch you at all? They are poisoned.”\nNone of his students had a single cut or bruise though and simply looked at him. He ruffled their hair as he went for the last enemy left alive.\n“Good job,” he repeated proudly. \nSakura and Naruto beamed and even Sasuke gave a small curling smile at his praise.\n“Now, Naruto, make a seal for that one. These are missing-nin so we can most likely collect a bounty.”\nNaruto obeyed with only the faintest grimace to the body. \n“And now,” Kakashi said overly cheerful, “Let’s have a chat Tazuna.”\nThe bridge builder looked ready to flee in the face of Kakashi’s cheer because even he could sense it was hiding a monster. He broke immediately, giving up on the ruse and explaining the situation. Kakashi listened carefully and didn’t let the emotional manipulation get to him even as he saw Naruto tear up at the heart-wrenching story of Wave’s struggle. \nIn the end, Kakashi left the decision up to his team. While he had ultimate authority, letting them look over details and make logical decisions was good practice. They huddled a-ways away talking, laying out yes or nos. Sakura seemed the most opposed for the simple reason they didn’t know risk factors or any real details besides Tazuna’s biased ones. Naruto was all for it because he was a bleeding heart who always wanted to help. Sasuke wanted the mission, to test them on, and he glanced only once at Kakashi as if to double check they had their oversight. \nA few minutes later they were all back on the road, heading towards Wave, and Kakashi freely handed out hair ruffles. \n.--.\n“Duck,” Kakashi ordered harshly. \nHis students, used to obey his commands in all their training, dropped like stones. Sakura was quick enough to think of grabbing Tazuna and hauling him down even as a huge sword spun through the air and sunk into a tree just over the heads.\n“Dog formation,” Kakashi barked.\nHis kids rolled away, coming up in a triangle formation around Tazuna, kunai drawn. They had taken many mornings and spars to drill into their heads various formations. Most were simple, just a quick command, but it worked better than yelling out instructions. It also had the bonus of immediately thrusting them into the mindset of fighting and they knew to obey him when he used them. \n“Well, well, well, Hatake Kakashi,” a deep voice chuckled, “Fancy seeing the Copy Cat Ninja all the way out here.”\n“Mah, I could say the same thing, Demon of the Mist, Momichi Zabuza,” Kakashi chirped.\nThe man now standing on the hilt of the sword still buried in the tree leveled a glance at his students and Kakashi felt his hackles raise.\n“Now, now,” Kakashi said, deceptively calm, “If you have a problem it’s with me.”\nZabuza gave a nasty grin behind his bandages but Kakashi leveled killing intent at him and the man finally looked away from his students. An instant later Kakashi was gunning for the man. He knew a threat when he saw one and he was going to get this man away from his students right now!\nThey exchanged a series of neat blows, Zabuza ripping his sword out to help keep Kakashi at a distance. Zabuza was decent with taijutsu, but much better at kenjutsu as all the famed Swordsmen of Kiri were. Kakashi ducked under a blow only to be hit by the flat of the blade and tossed through the air like a ball. His vest absorbed a great deal of the impact as did the thin armor he wore under it, hidden by the bulky green. Still, he was tossed back, flipping neatly through the air.\nWhen he landed on the water it didn’t even take but a brief moment to start using chakra to stick. \nKakashi slid across the water, chakra helping him find purchase even as he tried to calculate the quickest way off the water. Before Kakashi could move, water snaked up, coalescing around him leaving him hovering in a bubble. Never fight a Kiri ninja on water they said, just like you never fought a kumo ninja in a storm or a suna ninja with a wind at their back. Or a Konoha ninja when their students were in danger.\n“Water prison,” he burbled before holding in his air. \n“Caught you,” Zabuza leered.\nKakashi was already working on subtle chakra manipulation, drawing air out of the water to breathe slightly. He would still suffocate but more slowly. And Zabuza could do little while holding the prison, hand and chakra balanced, which was why the water prison was a two man take-down technique. \n“Now let’s deal with the kids,” Zabuza grinned.\n“If you touch them, I will show you why I am feared across every nation,” Kakashi said lowly, a snarl in his voice and killer intent rising-up around him like a tsunami. \nHe caught the slight wincing of Zabuza’s eyes, the tenseness of his shoulders and merely snarled again as his threat sunk into the man. On the shore his students were still positioned around Tazuna but were exchanging harsh whispers. Then Sasuke and Naruto closed ranks as Sakura dropped to her knees beside Tazuna, hands pulling a scroll from her bag. A slow mist was settling around them, rising up subtly from Zabuza. It was an impressive use of a jutsu, well mastered and no hand signs in sight. A water clone peeled away from the man a moment later and through his haze Kakashi felt a grudging respect for the A-rank missing-nin. Hand sign-less clones were a feat. \nBy now Kakashi could no longer see the shore or his students, though he could sense them, even though the swirling chakra water encasing him. Kakashi was waiting for his moment, waiting to light this water up with his chakra that was gathering, pooling in his hands subtly. He would have one shot and he needed to prepare without the ability to make hand signs as frozen as he was in the water. \nHe would have to trust his students to handle the clone. \nBut just as he was getting ready to unleash his lightening, just when he was starting to fear the silence on the land, there was a sharp snap. And an arrow was coming straight for Zabuza’s chest. The man swore, saw his course of action in a moment, and pulled back, dropping the jutsu holding Kakashi prisoner. Another arrow came flying and Zabuza was forced to dodge another blow as Kakashi found his feet, shaking himself free of the chakra water like a dog. \nThe mist started to fade with Zabuza’s concentration and Kakashi smiled grimly at Sakura and her wide stance, long bow held carefully in her arms and a quiver at her feet. Sasuke was tussling with the water clone, a Naruto clone backing him up while the real Naruto guarded the client.\n“Zabuza,” Kakashi snarled, much like his ninken, forcing the man to focus on him and not the arrows still being aimed at him. \nZabuza switched focus mid jump and came barreling at Kakashi, hands flashing through signs that Kakashi’s sharingan picked up in an instant. Kakashi thought of copying the water dragon but decided not to at the last moment. Instead he charged his body with the lightening chakra he had been gathering moments earlier. Kakashi was after him like a shot a moment later, heading straight for the dragon that roared a watery challenge. Kakashi grinned and let the electricity spark across his hands, a half form of the chidori. \nZabuza’s eyes widened in alarm and then Kakashi was blasting through the dragon, white lightening around his fist as he headed straight for the man. Just before his hand could pass through the man’s throat, a brace of senbon did it first and Zabuza dropped like a stone, already half sinking into the water. Kakashi flipped over him, landed with a slide on the land, and cast a brief glance at his genin. Sakura still had an arrow knocked and drawn while Sasuke was looking a little damp but victorious. \nA hunter-nin dropped from a tree like a wraith and hauled Zabuza out of the water by the back of his waistband.\n“Thank you for your help Hatake,” the kiri hunter-nin rasped through his mask.\n“Stealing a kill is rude you know,” Kakashi said pointedly.\nThe Hunter-nin simply loomed. Kakashi understood if he had killed Zabuza before the Hunter-nin politics might have been involved and Konoha definitely would have demanded the body. \n“Get lost then,” Kakashi waved.\nIn a blink the hunter and his prey were gone.\n“Um, shouldn’t he have burned the body?” Sakura asked, bow still in hand. \n“That’s Konoha procedure,” Kakashi said, “The Kiri-nin like to take their bodies back as proof. Heads alone don’t do it for them. Besides, anyone might be leery of doing procedure before non-allies, especially one with a sharingan.”\nSakura nodded and Kakashi cast a critical eye over all of them as he covered his sharingan. While his chakra was a tad low now, the last few months had dragged him back towards peak form and he was not as exhausted as he could have been. \n“Well,” Kakashi smiled, “Let’s go.”\n.--.\n“Do you know anyone around who knows how to teach music and may be interested in making cash?” Kakashi asked Tsunami on the second day in their home.\nShe stepped back, startled at his sudden appearance, but rallied quick enough.\n“Katsuya may be interested. He was a local performer until… Well, he lives alone out in the soy field to the south.”\nSo Kakashi went and paid him a visit. The man accepted immediately with an air of desperation and Kakashi decided to trust him and paid him in advance. Kakashi then had to tactfully ignore the tears in the man’s eyes as Kakashi handed him cash and half paid him in a bag of rice. He had already gotten a sense of how desperate the people here were. The fact a man was nearly crying over a bag of rice was far more real though and Kakashi strategically retreated.\nThat night Kakashi sent his three students off under the cover of nightfall with their sealed instruments and instructions to be good. He was more than fine to watch the family on his own for a few hours as his students got real lessons. The fact that it helped calm them down and give them something to focus on outside of training and the run-down air of the place was a bonus. \n.--.\n“This is what poverty looks like,” Kakashi said lowly.\nSasuke and Sakura are looking about with wide shocked eyes at the hollow-eyed people watching them back. Sakura is from a well to do family and Sasuke had been a part of a clan where something like this would never happen to an individual. His two students kept very close, as if almost scared of how to respond in the face of desolation. Kakashi kept his head high and wasn’t afraid to meet peoples gaze, giving acknowledging head tilts to the few who lingered. \nThey followed Tazuna in to what was a grocery store when it was fully stocked. Now it held some sad looking vegetables and a few dented tins of food. Kakashi noted the way Tazuna eyes darted to them and then the way he weighed his coin pouch. \n“We will find our own meals,” Kakashi told the man simply, watching as Sakura gave some beaten down kid a candy from her pocket. \nTazuna nodded, relief clear in his face as he paid an abhorrent amount for a small bag.\n“Where did the blond brat go?” he blustered as the stepped out onto the street.\n“A few streets over I think,” Kakashi said, “We’ll collect him on the way out of town.”\n“I have nothing else to get,” Tazuna shook his head.\nKakashi nodded and led them down an alley, a street, around a corner, and then into a narrow street with a line of doors. Naruto was sitting on a stoop, talking animatedly at a lady sitting beside him. The woman, thin and hollowed like every other village, looked much more lively as she laughed. Naruto grinned at her and then spotted them and gave a short wave. Kakashi watched and saw only a brief flicker of movement as Naruto tucked a stack of coins in the woman’s hand. She frowned, tried to slip them back in his pocket and he merely danced back, giving a wave before he fell in between Sakura and Sasuke.\n“Who was that?” Sakura asked peering after the woman.\n“A prostitute,” Naruto said unhesitant.\nKakashi watched as his other two students reared away from Naruto in surprise. \n“You live near the flower district back in Konoha, don’t you Naruto?” Kakashi asked offhand. \n“Yup,” Naruto smiled, “The girls there are super nice! Well, I mean some are. They would let me sit in the kitchen and give me scraps if I was real quiet.”\nSakura and Sasuke are looking at him in horror, as if trying to understand that little blonde Naruto sat at the feet of whores and broke bread with them.\n“And you thanked them right,” Kakashi said, slightly scolding.\n“Of course!” Naruto scoffed, “I know my manners when I need them.”\n“Good boy,” Kakashi ruffled his hair. \nNaruto looked at the people around them and saw familiar looking nightmares; poverty, starvation, fear. Naruto had grown up in the slums, so close to this sort of thing he looked around with familiar eyes. Kakashi could see how hard it was for Sakura and Sasuke to accept this. Perhaps they might learn something from this.\n.--.\n“Here,” Kakashi said couching beside Sakura, “Watch closely.”\nShe watched with sharp eyes and a single-minded focus he found startling sometimes. Ever since she had decided she was not going to be a ‘liability’ to her team, or fall behind the boys, she had been focused. At least it made her a tad calmer than the boys.\n“That looks like a water jutsu,” she said, picking apart the hand signs and meanings.\n“It is,” Kakashi agreed, happy that she could break down something like this so quick.\nShe was such a quick smart student he was sure she could give any Nara a run for their money. He showed her one more time and then had her practice the symbols until they were smooth.\n“I lifted it off of a Zabuza during our scrap,” he told her cheerfully.\n“The water dragon one,” Sakura realized quickly.\n“Yes. Very good for dragons and …,” he prompted.\n“And if I can learn it, I might be able to change it into smaller forms, maybe something other than a dragon,” Sakura chimed in, “Or maybe even shape it into a…well, I guess I could do a lot with it since it’s form manipulation of water. In theory at least.”\nHe ruffled her hair and she took it without a frown. They had started to realize that was his way of showing his pride and praise. They had started to accept such actions happily, beaming at him. \n“Go practice under the bridge. Within yelling distance of course.”\nSakura smiled and cheerfully threw herself off the bridge to the horrified shouts of the civilians. Their startled gasps when she landed neat-as-you-please on the surface of the water reminded him how little civilians truly knew of ninja. \nSasuke had cast a glance their way when he heard the scream, eyes searching for a threat. But when he found no such thing he turned back to the group he was working with. Sasuke was apparently a large help with the welding. He was used to working with flame and since he could walk up any surface he could work anywhere at any angle. He had also made them all gasp in amazement when they realized he needed no welding torch and could instead breath out white hot flame. Since Kakashi didn’t want him wasting chakra he only did it sparingly for jobs too large for the torch to be convenient. \nNaruto on the other had was running around carrying things. He had about ten clones doing the same, all of them fetching tools and keeping an eye on workers who were working at heights or in harnesses. Since Naruto was stronger than even the strongest civilian man here he was often asked to carry heavy supplies with his clones or hold things in place as others worked. Sakura had been the look out while the boys worked before he sent her off.\nHis team was doing a fantastic. They were in fact speeding up the building time and Tazuna admitted things were moving forward at a fast pace despite the fact their crew was so small. \n.--.\n“I don’t understand,” Sasuke growl, frustrated one day, eyes glinting and fists clenched.\n“Don’t understand what?” Kakashi asked lightly.\n“How?!” he demanded, pointing at Naruto accusingly.\n“How what Sasuke,” Kakashi repeated, “You need to use your words.”\n“How is he so terrible at taijutsu form yet so good at it!” Sasuke growled, “And how does Sakura have harder hits than me!? They were both losers in school!”\nSakura shot him a nasty glare but didn’t pull away from where she was waist deep in the water, a fishing net in her hands. Naruto sulked across from Sasuke, his knuckles bloody from where he had smashed them against Sasuke’s nose. While Kakashi didn’t like them to bloody one another, sometimes Naruto’s style was too unpredictable to completely avoid injury. \n“How long have you been practicing the Uchiha Cold Fire style?” Kakashi asked idly, watching as Sakura cast her net. \n“Since I was four,” Sasuke growled.\n“And how did you practice?”\n“I did it in the family dojo,” Sasuke said crossing his arms.\n“Did you ever spar?”\n“Once in a while. Not after the….” \nSasuke trailed off, looking at the ground angrily. \n“And how long have you been wrestling, Naruto?” Kakashi looked to his blond student.\n“I dunno,” Naruto said, scratching his cheek, “All my life I guess?”\n“Why?”\n“Well the other orphans liked to steal my stuff,” Naruto shrugged, “And then when I moved out some people thought they could paint my door or destroy my stuff so I fought them.”\nHe shrugged in a sort of matter-of-fact way, unaware of Sasuke and Sakura turning incredulous looks on him. \n“See Sasuke?” Kakashi asked, “If it were a competition of form, you would win hands down. But in a spar it’s a matter of instincts; and Naruto’s have been honed in more dangerous situations than yours.”\n“And Sakura?” Sasuke asked, still angry.\n“She has perfect chakra control,” Kakashi said, “Even unknowingly she’s been using chakra to enhance her strikes. It helps grow the muscle harder and makes her hits harder. Just like every child who learns how to channel chakra starts to unconsciously channel it making them stronger and faster than any civilian will be able to be. You can all jump house-high now, even without chakra because of this. She just has the fine control to do it for her muscles in a fight.”\nSasuke, in the face of logic, kicked at the ground angrily.\n“There is always going to be someone better than you Sasuke,” Kakashi said with a sharp voice, “Maybe not in everything, but in something at least. Instead of finding fault in yourself and your teammates, you should think of how to work your strengths together until as a team you have no weaknesses.”\nSasuke muttered something and stomped off. Naruto went to go after him but Kakashi held up a hand, stopping him.\n“Go help Sakura. If you walk out farther, you can get larger fish.”\nNaruto looked after Sasuke and then at Kakashi before nodding and plodding out to join Sakura in catching dinner. Kakashi went after Sasuke and found him curled up at the base of a tree, face in his knees. \n“Sasuke,” he said, crouching beside the boy, “Why does this bother you? You should understand you can’t be the best at everything and that your teammates will grow. They won’t be the same people you attended the academy with forever.”\nSasuke seemed like he was going to ignore Kakashi, and Kakashi hunkered down ready to wait him out, when finally, the boy looked up, dark eyes look at Kakashi with a suspicious wetness to them. \n“That man told me I had to be strong, that caring is a weakness, that teams are a weakness that will hold me back.”\n“And you’re going to listen to him?” Kakashi asked, “Tell me Sasuke, if you went after him and somehow got poisoned, what would you do?”\nSasuke said nothing.\n“Now, if say Sakura was with you, do you think you would be better off? Or say you ran into a problem that needed an application of traps; would Naruto be a weakness there?”\n“No,” Sasuke finally relented.\n“Sasuke, Teams can be a weakness in only one way,” Kakashi said, “They can make you vulnerable because you care, that is true. But the benefits far out-weigh the risks. Konoha has only sent out shinobi in teams since its founding for a reason.”\nSasuke breathed heavily through his nose.\n“You do realize, that if you ask, we will all help you face Itachi,” Kakashi said gently, resting a hand on Sasuke’s head.\nSasuke flinched at the man’s name and looked wildly up at Kakashi.\n“No!” he blurted out, “He’ll kill you!”\n“I don’t mean now,” Kakashi said gently, “But if we train, one day in the future, I’m sure a team as strong as us can even deal with a S-class missing-nin. We are a team Sasuke. We will have your back.”\nSasuke still looked a tad panicked by the idea, but Kakashi felt him slowly relax under his hand.\n“You aren’t alone anymore Sasuke,” Kakashi hummed.\nSasuke stayed quiet and Kakashi merely sat with him. When Sakura and Naruto came looking, two large fish in their hands, they had ready smiles for Sasuke who cautiously peeked up at them. Their good cheer pulled him from his mood and it was a happy team that returned to Tazuna’s with dinner. And if Sasuke’s eyes lingered on his teammates, Kakashi merely smiled encouragingly. \n.--.\nKakashi had been ignoring the Inari problem. The little boy was a sulking mess and still a little too young to let things like logic work against what he thought was the truth. Kakashi also didn’t care for any kids but his own and this one was not his problem. \nLuckily, or maybe unluckily for Inari, Naruto wouldn’t let the argument go and butted heads with the boy the entirety of their stay. Even Sasuke seemed annoyed at the child and Sakura frustrated. Kakashi let them fight like kids, arguing over the dinner table. Either they would convince the boy and feel accomplished, or they wouldn’t and they would learn sometimes you couldn’t change people’s minds. \nAnd if the kid drove Naruto to frustration which drove Naruto to work those frustrations out with extra training, well Kakashi couldn’t find any fault there. It was good to be motivated and learn how to work out frustration in a healthy manner.\n.--. \n“Weave it under like this,” Tsunami said gently.\nNaruto scowled at the material, tongue peeking out of his teeth as he scrunched his nose in concentration. His hands fumbled, more use to the handle of a kunai than a needle. But he seemed to get it.\n“Good job!” Tsunami praised.\nNaruto brightened like the sun, whole face lighting up under the warm praise. \n“Miss Tsunami! What do I add next?” Sakura called.\n“Keep practicing that row of stitches,” Tsunami told Naruto before retreating to the kitchen to help show Sakura the recipe. \n“Those are looking quite tidy, good job,” Kakashi said peering at the small cross stitching on the material.\n“Yeah!” Naruto grinned, “Now my clothes won’t look so terrible!”\n“Your stitching did leave much to be desired,” Kakashi said dryly, remembering the terrible way Naruto had patched some rips before. \nHe would never trust the boy to sew someone up, but he was improving. Naruto was doing well under a calm gentle manner like Tsunami’s, who had endless patience and a careful hand with children. Naruto had never had a mother figure in his life and he flourished under the guidance. Kakashi was trying to think of anyone who could possibly step up to that plate back in Konoha. Naruto needed a calm influence in his life that Kakashi couldn’t always afford to be. Maybe a talk with that academy sensei of his. \nSakura was often in the kitchen, helping Tsunami cook, Sasuke a silent shadow behind her. The boy acted indifferent but Kakashi had noticed his careful looks. He doubted the boy knew how to cook much and made a note to look into his living arrangement when they got back to Konoha. He had already seen Naruto’s. \n“We’re going to do some lessons after dinner,” Kakashi announced after a thought, “Do any of you know anything about finances and accounting?”\n“My father sometimes gets me to help calculate his books with him,” Sakura piped in.\n“I gotta manage my allowance,” Naruto shrugged.\nSasuke didn’t answer but gave a shrug.\n“We’ll talk about personal finances and maybe even a bit about a larger network like, say, Wave’s,” Kakashi smiled, “Maybe Tsunami can help and teach us about households.”\n“I’d be happy too,” Tsunami smiled from the kitchen.\nShe was a grateful woman; grateful for the return of her father safely, grateful for the help the kids gave in repairs around the property, grateful for the fact they kept bringing fish and game home for dinner, grateful for sharing extra rations they had tucked away. She was a good influence on the kids and so Kakashi took advantage of the gratefulness in little lessons.\n“So, what have we learned?” Kakashi asked in the dead of night, a small lantern set on the ground between them.\nSakura unrolled a map of wave between them all and Naruto leaned eagerly forward, a pen in hand. \n“Gato’s got warehouses here, here, and here. He’s also got control of the shipyard and has an office there that’s swarming with mercenaries.”\n“His home base,” Sasuke grunted.\n“Yeah!” Naruto nodded, \"He has a ship there too that’s just his and not his company’s.”\n“Good. Wave is a small island,” Kakashi said, “And seizing shipping ports is the best way to put a chokehold on the economy. How is he doing that?”\n“He controls outgoing and incoming shipments,” Sakura said, “Maybe not the vessels, but with taxes when they land.”\n“So why is there no food coming in?” Kakashi asked her.\n“Because the taxes are too high. People are skipping this port,” Sakura said, “He’s choking out the competition so only his ships will come here afterwards and have a monopoly. Supplies will become more common again then, but first he’s monopolizing.”\n“Legally?” Kakashi raised a brow.\n“No,” Sasuke snorted. \n“I mean, the Daimyo guy really isn’t doing anything to stop him,” Naruto said scratching his head, “Since Gato isn’t stopping any of his ships or supplies.”\n“Courts never care for civilians,” Sasuke snorted again. \n“So Wave will be in a depression until the shipping war is over,” Sakura concluded. \n“Does Konoha have any stock in Wave?” Kakashi asked. \n“No,” Sakura said bluntly, “We don’t get anything from them we can’t get elsewhere. Its why we haven’t heard of the problem or seen a rise in any goods or prices.”\n“Wave is pretty small scale,” Kakashi agreed, “If it were any bigger we would have felt it, but Gato chose correctly. Now, onto the problem of Zabuza and his accomplice. If they’re still alive. Gato must be paying him a fortune to work for him and come after us. How do we deal with this?”\nNaruto was frowning at the map thoughtfully, Sasuke was pushing a stick through the dirt in battle plans, and Sakura was squinting at Kakashi as if trying to find a trick question.\n“I got an idea,” Naruto finally said, turning to grin up at them.\n“Let’s hear it then,” Kakashi smiled.\nIn the cover of night, their small lantern glowing over their map, there was no one to listen to Naruto’s idea or Kakashi’s laugh.\n.--.\nKakashi batted Sakura’s strike out of the way, redirecting it carefully knowing how hard that hit was. He had learned not to block her blows unless his was braced. Out on the waves Naruto was facing one of his clones, learning how to grapple better on the rolling surface. And it gave Naruto more chakra control practice which the boy needed in larger doses more frequently than the other two. In the bushes Sasuke was running from a clone, practicing how to hide. It was an exercise in patience for the boy who liked to meet opponents head on. \n“You over extended that punch,” Kakashi said idly as she Sakura lunged at him.\nShe huffed but straightened her next strike, followed by a leg combo that nearly caught Kakashi.\n“Good,” he encouraged.\nThe moved quickly across the ground, Sakura not backing off the offence for even a minute. Sakura wasn’t a stamina freak yet, but she was a powerhouse, so she hit hard and fast, hoping to wear an opponent down before they wore her down. It was working well for her and Sakura’s confidence grew in leaps and bounds with her hard hitting taijutsu. \nSakura, the softest of his students, the civilian raised girl with candy floss hair and a face still chubby with baby fat, looked good wreathed in violence. It straightened her spine, focused her gaze, and set her shoulders straight. She was a different girl when she was trying to collapse his rib cage and Kakashi was very proud. \nSasuke came spinning out of the bushes, Kakashi’s clone hot on his trail, and leapt over Sakura and the real Kakashi to disappear into the bamboo grove. Kakashi saw the faint shaking of the bamboo even as his clone winked at him and went after the boy. Kakashi smiled as he dodged a punch and reflected that Sasuke was getting much more quick and agile. His little aloof student with an attitude problem was coming out nicely. He just needed a calm authority figure who he could rely on. And Kakashi would be that for him, be there for him, to reassure him. \nNaruto on the other hand, was flourishing just being around other people. Kakashi knew how isolated Naruto had been. While Sasuke had been isolated, more by choice, he still had memories of family to fall back on. He had shop keepers who smiled at him and people who would bend over backwards to help the last Uchiha. Oh it wasn’t perfect but it wasn’t as desolate as Naruto’s position. He was not isolated like Naruto was, not just from people but from positive emotion. \nNaruto, for a boy treated like dirt and left to grow on his own, had turned out shockingly well rounded. And under Kakashi’s care and his team’s closeness, Naruto was growing like a weed, improving in leaps and bounds and blooming. \nKakashi was ridiculously proud of them all. \n.--.\nKakashi was reading his icha icha idly when he felt Zabuza approach. He sighed, a perfectly good reading moment interrupted. He so rarely got a moment alone with his book these days. He snapped it shut and tucked it away, straightening from where he had been slouched on a beam. \nNaruto was already herding men away from the fog that was rolling in. They had started early today, eager to get more work down, and there was usually fog, but this one was thickening instead of dissipating with the sun. Naruto and his clones got everyone off the bridge even as Sakura and Sasuke drew Tzauna between them. Tazuna was a prime target and this scene would probably get messy, but better he was closely watched then out of sight.\n“Naruto, send a clone running back to Tazuna’s to check on his family,” Kakashi called.\n“Already have some there!” Naruto hollered. \nZabuza loomed out of the mist, the fake hunter-nin at his side. \n“Why don’t we make this easy Hatake,” he called, “You give up the bridge builder and we don’t have to fight.”\nKakashi snorted.\n“That’s what I thought,” Zabuza grinned, “I’ve been wanting a rematch. Haku, get the kids.”\nKakashi twitched but forced himself to relax as the hunter-nin went spiraling towards his students. Naruto intercepted and gave a holler as he kicked Haku out of his path. Sasuke broke off from Tazuna to help while Sakura kept a defensive position.\n“Keep him busy,” Kakashi ordered, “I’ll help after I deal with Zabuza.”\n“Not if I deal with you first,” Zabuza grinned, “And don’t underestimate Haku.”\nKakashi lifted his headband to reveal his spinning sharingan.\n“Mah, I’m not. I’m just thinking my cute little students outnumber him.”\nZabuza snorted and swung his sword off his back. Kakashi had a plan of course. They all had a plan and he had drilled them on it in case Zabuza hadn’t been as dead as he seemed. Kakashi had had to many incidents of ‘fake deaths’ and an old enemy at his back to discount such things. \n“Let’s go,” Kakashi grinned.\nHis hands flattened against one another and he flashed through signs to fast for most to see. He turned to an art he rarely used but was much more powerful backed up by the sharingan. \n“Genjutsu,” Zabuza hissed as the world wavered, “I hate that bullshit! Let’s go with good old swords and fists!”\nHe smashed through the first genjutsu, flaring his chakra, and Kakashi was forced to dodge a swing of the sword. He sighed. So little appreciation for the mental arts. Oh well. He’d give Zabuza what he wanted. Kakashi dove into the mist willingly and began a dance with Zabuza, keeping a close ear on his students fight as well.\nZabuza was an A-rank missing nin for a reason, S-rank in kenjustsu alone. But Kakashi was of similar breed. They were both monsters and Kakashi had honed himself recently. It was also an entirely unappreciated fight, hidden by mist and done alone. On the edge of his senses Kakashi could feel the faint body of people approaching on a boat. He was sure Zabuza could feel them as well, but they had no concern for civilians as they traded blows. Kakashi layered light genjutsu on Zabuza, feeling it only fair in the senses dampening mist. \nThey exchanged light banter with heavy blows.\n“Why are you so interested in Tazuna anyways?\" Kakashi asked at one point, trying to sound out where Zabuza was hiding on the bridge. \nHe usually didn’t care for the enemy’s reasoning but in this instance it was odd to see a A-rank missing nin going so hard for his throat over a civilian hit. \n“Gato is paying me more than well for his head,” Zabuza’s voice echoed.\n“Hmm,” Kakashi replied even as he dodged a slash and tumbled after Zabuza, kunai flashing. \nThere was tinge of blood on his blade and Kakashi smiled at his opening. With a quick summoning he had a growling pack with Zabuza’s scent in their noses.\n“Let’s finish this,” Kakashi smiled at the mist. \nThe hounds all howled and darted into the mist. Kakashi followed them, lightening chakra pooling ready in his hand. And when he heard the crunch of teeth in flesh and bone he lit the spark, the sound of a thousand chirping birds filling the air. The mist started to clear as Zabuza released the jutsu and tried to see the angle Kakashi was coming from. Double edged jutsu and all that. \nThe mist cleared in time for Zabuza to see Kakashi with his fist raised and wreathed in lightening. Kakashi could hear his students end their scuffle even as his eyes tunneled in on the enemy. There was no last minute witty words or last minute saves. \nKakashi sunk his arum up to the shoulder into Zabuza’s chest. The boy, Haku, pinned by Sasuke and Naruto screamed a shrill broken noise. It was an animal noise of pain as Kakashi let Zabuza sag and fall free of his arm. Sasuke and Naruto didn’t look away, respectful, as Kakashi’s opponent fell to the concrete. The boy in their arms was limp making wounded moans.\n“Kill me,” the boy sobbed, “please just kill me.”\nKakashi shook his arm once, splattering blood on the ground and looked at Haku for a long moment.\n“And why would I do that?” he asked blandly.\n“Please, just let me join him,” Haku choked out.\n“Ha!” a voice joined the, “I’ll do that for you little brat.”\nKakashi glanced over at the end of the bridge to find a small gathering of mercenaries bristling with weapons and headed by a short man in a nice suite.\n“Seems the Demon of the mist was really no demon at all,” the man sneered, “Couldn’t even beat a team of kids and their teacher.”\nKakashi smiled at the man blandly behind his mask but Gato didn’t seem to register the threat.\n“Now, hand over the bridge builder and get the hell out of my country,” Gato ordered, “And if you give me the boy I might be nice enough to let you leave alive and uninjured. You did me the favor of killing Zabuza before I did but that only gives you a small amount of mercy for your interference.”\n“Ah,” Kakashi said blandly, “the old ‘have them do the job and then kill them so you don’t have to pay them’ ploy.”\nGato laughed in agreement and Kakashi could see Haku stiffening in anger. \n“So you weren’t going to pay them?” Kakashi asked again, “Just to be sure, I want to know if you were going to break the contract?”\n“Of course I was!” Gato scoffed, “It’s business, boy.”\n“Hear that Zabuza,” Kakashi smiled, “He was going to betray you.”\nEvery eye went to the body slumped and bleeding and dead. It didn’t even twitch and everyone slowly looked back at Kakashi like he was crazy. Kakashi raised a hand and dismissed the layered genjutsu with a single wave. He covered his sharingan a second later feeling the drain from holding that layer of the genjutsu up under the lighter layers he had allowed to be caught and dismissed. \nThe body of Zabuza wavered and vanished like a mirage. In its place was the real Zabuza sitting with Kakashi’s dog’s still holding him down and a glancing blow of the chidori across his side. Kakashi had pulled at the last second. He’d kept the man pinned of course just in case things hadn’t turned out like he had anticipated. Zabuza must have seen something was up because he hadn’t tried to disrupt the genjutsu or fight too hard against his dogs. \nNow he looked murderous.\nHaku made a noise of relief so deep Kakashi felt it echoed in his bones.\n“How did you guess?” Zabuza growled.\n“No guessing about it. My cute little students and I practiced some infiltration,” Kakashi eye-smiled, “Naruto had a good plan on how to break Gato’s strangle-hold on Wave. Had to make sure he wasn’t a big enough threat to derail our mission after all. First we needed to make sure you wouldn’t be an issues. So we broke into his offices and stole a bunch of ship deeds. Then we stole all his business plans. And then we decided Gato really needed to go. We thought we’d give you first dibs though, as the betrayed. We made sure to leave your broken contract and your fees tucked away nice and safe in his office.”\nHis students looked pleased with themselves. As they should be. They had done very well on that little adventure and Kakashi had some important documents tucked away for Sarutobi’s view. Zabuza looked faintly pleased at the ‘dibs’ and ‘fees’ part.\nWith a displacement of air and smoke Kakashi’s hounds vanished, letting Zabuza straighten. Kakashi helpfully picked up his sword and offered it out to the man.\n“We don’t have any issues now do we?” Kakashi asked pointedly.\n“None,” Zabuza said flatly.\nSasuke and Naruto let Haku up and the boy scrambled for them, eyes bright and alive as he looked at the mostly uninjured Zabuza.\n“Let’s take out the trash Haku,” Zabuza said gruffly.\n“Yes sir!” Haku said eagerly.\nKakashi retreated back to Tazuna’s side with his students and watched the ensuring blood bath.\n“My clone popped over at Tazuna’s house,” Naruto reported, “And headed off some of the mercenaries. There’s a mob forming in the town, but we should be done before they get here.”\n“Good job,” Kakashi ruffled his hair, “All of you. You stuck to the plan.”\n“Haku was tough but we beat him together!” Naruto cheered.\n“It would have been easier to kill him,” Sasuke muttered.\n“Perhaps,” Kakashi allowed, “But then we would have had to deal with the mercenaries. And Konoha has never had trouble with Zabuza. Sometimes it is a mark of a strong shinobi when you can let an opponent live instead of killing them.”\nSasuke mulled this over as Zabuza and Haku finished off the last of Gato’s men and then beheaded Gato himself. Tazuna was whispering prayers behind them but they ignored him. \n“I guess we owe you some thanks, Hatake,” Zabuza grunted, bad naturedly, as he shouldered his blade.\n“Mah,” Kakashi said, “No need. You’ve got a cute kid there.”\n“Not my kid,” Zabuza huffed.\nKakashi raised a brow at him and the man looked down and away.\n“Really dedicated,” Kakashi said, “and strong. He’s a good student.”\n“…Yes,” Zabuza finally agreed.\n“Look after him. Good students are hard to find,” Kakashi said.\nZabuza snorted.\n“Let’s go Haku,” Zabuza said, “Well collect our fee from his office before the mobs get it.”\n“Yes sir!” Haku beamed.\nAs they headed off, Haku turned to give a wave that Naruto returned enthusiastically.\n“I don’t want to know,” Kakashi sighed seeing a story there.\n“I met him in the forest the other day while training. We talked about precious people,” Naruto grinned, “I thought he was a girl.”\n“I said I didn’t want to know,” Kakashi rubbed at his forehead.\n.--.\nThey stayed to see the bridge completed and enjoyed a few celebrations or two before he and his team got the hell out of Wave. Just because they had been freed from a corrupt business and opened up the economy didn’t mean everything would go all sunshine and rainbows immediately. They shook Tazuna’s hands, all his students gave Tsunami a hug, and Naruto even ruffled Inari’s hair. They left the family the last of their rations and food supplies as a gift and then headed off for Konoha. \nKakashi spent the journey back to the village posing questions about the situation to his students, letting them bounce idea of what Wave’s political climate would be in the next few years.\nThey were all cheerful after their completed mission, proud of what they had done despite all the road bumps. Kakashi was proud as well and liberally handed out hair ruffles as they hurried back to Konoha for the first time in months.\n.--.\n“Naruto, what are you doing?” Sakura asked slightly incredulous as Naruto flopped face first into the dirt.\n“We’re home!” he crowed, throwing his arms across the ground, “It feels so good to be back!”\n“Get off the ground, Moron,” Sasuke rolled his eyes.\nAs one, Sakura and Sasuke grabbed an arm and heaved him up. There was a fine layer of dirt and dust all up his front, but he didn’t seem to care.\n“Team Seven checking back in,” Kakashi smiled at the gate guards who were watching with bewildered looks. \n“Ah, of course. Hokage has ordered you to his office for debrief,” the one guard said, clearing his throat as Kakashi signed them in.\n“Well, come on kids,” Kakashi said cheerfully.\nThey followed him quick enough and they all headed for the tower. While they waited for the Hokage to have time to see them he managed to bully them into using the washrooms to wash their faces and hands and pat Naruto down of dirt. \n“Team Seven,” the Hokage said kindly when they finally entered his office, “Finally back in Konoha. How long were you gone for again?”\nKakashi was under no illusion the Hokage didn’t know down to the minute but he nudged Sakura forwards. \n“Since we left for training near Tea country, 3 months and 3 and a half weeks,” Sakura said.\n“And since the beginning of your training trips into the woods?”\n“All together from the first day dropped in the Southern Forests, about 5 months and one week and 4 days,” Sakura said instantly.\n“You have a quick mind,” the Hokage praised. \nSakura bowed, flushed at the praise, and stepped back.\n“Well, you certainly took time training and on your first C-rank. I hope the results are good,” the Hokage smiled, “Would you like to lodge any complaints about your sensei or the unusual training method?”\nKakashi watched them carefully. This was a test of course, to see if they knew better than to complain about Hokage-authorized training. Perhaps Sarutobi might take Naruto’s words to heart, but the other two would get black marks on their record if they spoke up against Kakashi who was assigned by the Hokage. \n“No sir,” Sakura answered instantly and unhesitantly, “It has been a privilege.”\nHer words were honest even though she could see it was a trick question. She wasn’t just giving him what he wanted to hear though, she was being truthful and Kakashi rewarded her with a hair ruffle. She smiled shyly sideways at him and didn’t slap his hand away. \n“Good, good. I expect mission reports to be submitted by tomorrow. Dismissed Genin.”\nNaruto gave him an enthusiastic wave while the other two bowed.\n“Go relax,” Kakashi further commanded, “At seven, meet me for a team meeting at Ichiraku’s ramen stand.”\nNaruto gave a noise of joy as the others lugged him out of the room. \n“I hope it was worth it Kakashi,” Sarutobi said as the door shut, “The council threw a fit.”\n“What did you tell them?”\n“That they had pushed me to make you a teacher and they could deal with it.”\nKakashi chuckled lowly.\n“It was well worth it,” he said to the Hokage, eye earnest.\n“What level are they at then?”\n“Mid-Chunin. At the very least,” Kakashi smiled, “They all have a terrible amount of potential. I just needed to iron out some attitude problems and get them working as a team. That’s why I requested the isolation.”\n“It’s why I granted it,” Sarutobi nodded, “I eagerly await their display of skill. Enter them in the chunin exams when the applications open up. Dismissed.”\n“Of course, Hokage-sama,” Kakashi bowed.\n“Oh, and Kakashi?”\n“Yes?”\n“Thank you,” the Hokage smile. \nKakashi wondered if the Hokage was thanking for him for taking this new team seriously, for treating Naruto right, or for helping upset the council. Maybe all of it.\n“It’s a pleasure,” Kakashi smiled.\nThen he ducked out the door. Kakashi had to get unpacked himself and then he had three genin to teach mission reports and debrief procedures too. Then he had to go fill in the paperwork to enter them in the chunin exam. He already had the forms of course, having been planning it before he had been ordered to, so it would be easy enough.\nMah. Being a jonin-sensei was so much work. But so far… so far it was well worth it.\n.--.\n“Okay kids, no time to rest!” Kakashi announced as he appeared on the stool beside his students.\nHe was met with a series of groans as the kids shoved ramen into their faces. He gave them a fond look as they practically inhaled the food. He supposed months in the forest cooking on a campfire and then eating pretty much nothing but fish in wave had made them starved for ‘real’ food. Even ramen made that cut now.\n“I’ll be gracious and let you finish your ramen,” Kakashi said in a saintly tone.\n“If you had tried to get between us, I would have eaten whatever body part appeared in the way,” Naruto declared around a mouthful of broth.\n“Ew,” Sakura muttered, “You don’t know where his body parts have been Naruto. Actually, wait, you do. That makes it worse.”\n“You’d get indigestion,” Sasuke snorted.\n“Mah, no respect,” Kakashi lamented to the chef and the girl who both were watching with amusement. \nThey didn’t even ask what he wanted, just slid him a bowl. He wondered how good the man’s memory was if he could remember what Kakashi had always ordered when Minato brought him here. Kakashi let peace reign as everyone ate, reveling in the warm salty goodness. \n“Okay, as I was saying, we have no time to rest,” Kakashi announced, “We only have three weeks about.”\n“What, why only three weeks?” Sakura asked with narrowed eyes, “What's in three weeks?”\n“Mah, it’s a secret,” Kakashi grinned, “Needless to say we must prepare! What is team seven’s motto!”\n“The serious one or the silly ones?” Naruto asked.\n“All our mottos are serious!” Kakashi gasped.\n“If that was true we’d have like, a hundred,” Naruto rolled his eyes, “Music is free therapy! Never use lightening attacks on water! Always have at least 5 weapons on hand! Always smile because it confuses your enemies! There is no such thing as over prepared, only underprepared! Always-”\n“The last one,” Kakashi said decisively, “And none of those are silly. Anyways, better to be over prepared. So we need to work out a schedule. I will give you the rest of tonight off-”\n“How nice of you,” Sasuke said dryly, “Seeing how it’s so early at 7 pm.”\n“-But we start bright an early,” Kakashi continued unfazed, “I’ll teach you how to write succinct mission reports and how to give mission debriefs if ever needed to do it in person. We need to restock on supplies after that. Then, training! I want to polish up all your taijutsu more and I’m working on finding tutors for your weapon training. After that we need to make sure you all have your ninjutsu mastered in the next few weeks. No new ones. We need to focus on what you have. Remember, ‘Jack of all trades-”\n“But master of none, is still better than a master of one!” his kids chorused.\n“Good. So these three weeks are going to be less new stuff and more polishing of all the skills I’ve been teaching you. This is going to require patience,” he said with a pointed look at Naruto who squirmed, “It will be boring at times, but it is needed. We also need to finish some D-rank missions. So, tomorrow, 9am, Naruto’s place.”\n“What, why my place?” Naruto squawked.\n“Because it’s closest between all of our places. And that means you can get a few minutes of extra sleep.”\n“What! Why does he get the extra sleep?” Sakura blurted out.\n“Because he’s paying for dinner,” Kakashi said, “See you tomorrow!”\nHe vanished in time to miss Naruto’s scream.\nHe wondered if Sakura and Sasuke would follow his example or stay and split the bill. They would learn in time.\n.--.\nKakashi gave his students a nod when they all handed their mission reports politely and calmly. Even Naruto managed to keep his voice a reasonable level. The chunin working the desk, accepting the scrolls, raised a surprised eyebrow. He peeked in one of the scrolls and turned an incredulous look on Kakashi as if he couldn’t believe he could actually read the handwriting. Kakashi honestly liked to make it hard for them with bad hand writing and half of it in code. But his students needed to be able to do it right before they could have fun with it.\n“Now what?” Kakashi asked his students patiently.\n“Team Seven requesting some D-ranks,” Sakura said, chin raised and tone even.\nThe desk chunin raised a brow at her but offered a smile and pulled a few forms from his desk.\n“There is a request for weeding, a fence painting, walking the Inuzuka dogs, finding Tora, doing a grocery run for the orphanage, helping run some games at the senior center, and cleaning up the south city park,” the chunin said, shuffling the papers, “Since you are the first ones here today you get first pick.”\n“We’ll take them,” Sasuke nodded for the team, sharp and brisk.\nNaruto reached out and plucked the forms from the stunned looking chunin.\n“A-all of them?” he blinked.\n“Yup. Thanks!” Naruto beamed.\nAnd then they followed one of his lessons to heart and ducked out the door before anyone could gather their wits and argue. \n“Attack plan?” Kakashi asked.\n“Grocery run while the markets are quiet, then the weeding and painting while it’s not too hot out,” Sakura said immediately, gathering the forms from Naruto to look at addresses and detail, “And then we will need to do the center since its time sensitive. Then we can do the dogs and look for Tora at the same time since there is no detail beyond wander about with the dogs. And then we can end it with the park in the cool of the evening.”\n“Good! Let’s go then,” Kakashi said cheerfully.\nThey all nodded determined. He knew they would have thrown a fit if he hadn’t explained the purpose of D-ranks was to give back to the village, work on teamwork, learning how to work with civilians, and so on. If he also hadn’t warned them of how dull the missions could be they might have groaned and whined. As it was, they understood the purpose of them now. \nPlus he had told them all the other Genin Teams had at least forty D-ranks done each and that on paper Team Seven looked to be failing. That had lit a fire under their feet.\n.--.\n“Good job today,” Kakashi said to his tired genin.\nThe D-ranks beyond Tora hadn’t been all that exhausting, but keeping up with all of them and keeping a cheerful facade in the face of a center full of grumpy seniors had drained his kids. Neither of the boys were a socialite by any means and even Sakura had lost some tolerance for it lately. Talking to people was hard.\n“Do you have the energy for some training?”\nThey all looked at one another and Kakashi waited as they made a decision. It was their job to evaluate their own capabilities. They also had to want to train or it would be a waste of time. \n“Yes,” Sakura finally nodded for all of them, “But I don’t think taijutsu.”\n“Good. Tomorrow we will skip missions and do taijutsu. If we can do as we did today, we will only need to do missions every third day. I also have a surprise lesson for you.”\nThey nodded, looking a tad curious, and he gathered them all up to start smoothing out some of their ninjutsu.\n.--.\n“Who knows of summons?” Kakashi asked the three.\n“Summons?” Naruto asked, confused.\n“You mean like summoning animals?” Sakura asked eager.\n“Yes. Naruto, if you sign a contract with certain animals you can summon them to your location and they will fight with you,” Kakashi said simply.\n“What?! Cool!” Naruto grinned, “Any animal?”\n“It depends. If you do sign a contract they have to accept you first of course,” Kakashi said, “They can always turn you down and strike your name from their scroll. Summons aren’t mere animals, most are powerful with grasps of human language and even some jutsu. Often they can be much larger than a normal animal as well.”\n“Like the sanin!” Sakura chirped.\n“The sanin?” Naruto echoed.\n“Another time perhaps,” Kakashi cut Sakura off from indignant explanation, “The three she is talking about had summon contracts. They also give a good example of the different kinds of summons there can be. There is the Toad Contract that summons various toads from regular sized to some the size of the Hokage monument. They live in the summons realm and are known as prophets and warriors. The Snake summons is quite similar in you can summon varying snakes of varying sizes. Lastly was the slug Contract. Do any of you know why the slug contract is different from the other two?”\nThey all shook their heads, listening very carefully. \n“While the other two contracts had a great deal of animals to summon, multiple toads and snakes, the slug contract has only one summon. Katsuyu is the only slug it summon.”\n“Is there a reason?” Sakura asked, ever the knowledge seeker.\n“Summon animals live in a realm separate from ours,” Kakashi started, “So they are not normal animals in a sense. We don’t really know that much of them but some relate them closer to kami and spirits then animals. The Toad and snake contracts are tied to the species as a whole. All the Toads are linked to it just as all the snakes are linked to their contract. For Katsuyu, she is the only one of her kind. She appears to be a slug the size of the monument, but she possess the ability to break down into a hundred smaller slugs. Though she can split, she is still the same being, and it is said her contractor can communicate and channel chakra through her.”\nThey stared at him, trying to sort this information and he gave them a moment.\n“So some contracts can only have one animal?” Naruto finally frowned.\n“Indeed. Take my contract for example.”\n“You have one?” Naruto blurted out, eager.\n“He used it in Wave against Zabuza,” Sakura elbowed Naruto.\n“The dogs? I thought that was part of the illusion,” Naruto grinned sheepishly. \n“I have a contract with a pack of ninken,” Kakashi smiled, “Ninken are a unique contract as well, as they sign on as a pack, not as a species or individually. The Inuzuka also hold a ninken contract, but it’s not for one person. They hold it as a clan. You’ve probably seen their companions, each Inuzuka paired with a dog. Those dogs are ninken, not normal dogs. The pack the clan signed contract with lives full time in this realm and grow up alongside the humans. So they aren’t summoned but work alongside each other every day all the time.”\n“…Can we meet yours?” Naruto asked looking a tad overwhelmed.\n“Of course. That’s why I brought the subject up. I’d like you to meet them.”\n“Can we get our own summoning contracts?” Sakura asked as Kakashi withdrew a scroll from his vest. \n“If you can find one or find a summon animal in this realm to talk to. They aren’t uncommon but nor are they an everyday thing. Most people inherit them from teachers or family. I inherited my pack from my father,” Kakashi explained as he unrolled his contract, “But keep an eye out. They can be invaluable to you.”\nWith a flash of smoke they were suddenly surrounded by a herd of dogs.\n“Yo!” Kakashi greeted, “Look at my new puppies!”\n“Puppies!” the dogs spazed. \nHis genin were buried under wagging tails and prodding snouts and a mountain of rapid fire questions as his dogs tried to sniff them, get pets, and see if they had treats. Kakashi laughed at Sasuke’s indignant squawk and Sakura’s yelp of surprise and Naruto shrill yip of joy.\n.--.\n“Yo! Treat time!” Kakashi called.\nHis students and dogs alike came tripping over eagerly.\n“What did you get us?” Naruto asked, jumping up and down.\n“Treats! Treats! Treats!” Guruko yelped jumping alongside Naruto.\nKakashi lifted the convenience store bag above their heads and gave them stern looks.\n“Sit.”\nAll his ninken sat immediately, as did Naruto. Sakura and Sasuke rolled their eyes behind him and dragged him to his feet. Kakashi tossed Naruto a box of dog treats and the boy eagerly opened it to give the dogs a few treats each. The rest of the box got poured into Bull’s mouth as the giant dog waged his tail happily. \n“Here you go,” Kakashi smiled, handing Sakura her iced coffee and Sasuke his bottle of tea.\nNaruto got a bottle of orange juice since it was the only way to make him consume fruit and veggies it seemed. They each got a box of pocky as well.\n“You’re the best sensei,” Sakura gushed.\n“Mah, it fills my heart with joy to hear you say those word,” Kakashi wiped a tear away.\nShe grinned at him and cracked her drink.\n“After you’re finished we’ll play a game of tag and then I have a task for us to do in town,” Kakashi declared.\n“Tag?” Naruto asked around a mouthful of pocky.\n“Tag where you can’t touch the ground,” Kakashi smiled, “Or I punish you.”\nThey stared at him wide eyed and he cackled to back up his threat. They shuddered.\nBy the time the game of tag was done his students were panting sweaty messes with sticks leaves and dirt in their hair and clothes. But they had improved on their tree sticking and their water walking because he had come at them from every and any angle. Sakura, sticking to the edge of a boulder by her fingertips while one foot clung to branch and the other to a post just millimeters above the ground, had been inspiring. \n“Okay, rinse off and then we have a quick task,” Kakashi smiled.\nHis students trudged to the river’s edge, splashing their arms and legs and faces. Naruto gave up and just chucked most of his clothes and waded in in his boxers. Sakura rolled her eyes and helped Sasuke pick sticks out of his hair and high collar. As those two were distracted Naruto got a devious look on his face, Kakashi ended up tugging Naruto from the water before he could splash his teammates and star an all-out war.\n“Things to do,” Kakashi tsked as Naruto whined. \nNaruto huffed but shook himself off like a dog once on land and redressed.\n“Okay kiddes, follow me!” Kakashi said leaping off.\nThey scrambled after him and Kakashi pretended not to see when Sasuke tripped Naruto to get ahead of him. The entire trip soon consisted of small sabotages as the kids made a game out of catching up first. \nWhen Kakashi dropped suddenly from the roof, they were almost all nearly on top of him. He laughed as they squawked, overshooting the stop. The backtracked quick enough through and joined him on the ground.\n“Yamada,” Naruto squinted at the sign above the door, reading carefully.\n“What type of store is this?” Sakura asked eyeing the dusty window and the lack of display.\n“A well-respected shinobi shop,” Kakashi said simply as he held the door open.\nThey all filed into the dark dusty little shop and peered curiously about at the shelves.\n“Ah, Hatake,” the shopkeeper greeted immediately.\nHis students stared at the positively ancient woman that shuffled out from behind the counter, bent over and wearing thick glasses. \n“What can I do for you today?” the woman asked peering up at Kakashi, “You haven’t lost another set of armor, have you?”\nKakashi held his hands up at her suspicious huffy tone. \n“I have three cute little genin for you to outfit today!” he said cheerfully.\nShe peered at the dazed kids and finally smiled. \n“Armor?” Naruto asked.\n“Yamada makes the best armor in all of the west,” Kakashi nodded, “discreet, lightweight, and well worth the high price. Her armor has saved my life a few times.”\n“Hmm, with a teacher like him you’ll need it,” the woman muttered, “who first?”\nSakura and Sasuke glanced at one another than shoved Naruto forwards. It took an hour to fit the kids with armor. Yamada’s armor was very modern, made less of metal and more of seal reinforced chain, mesh, and cloth. Her seals were very secret and very useful and it was said the Yondaime himself had come to her for help with seals. It was even rumored she had Uzumaki blood. \nYamada was one of the best kept secrets of Konoha and her armor had saved hundreds of lives. Each piece was unique and handmade and valuable. Nearly every Konoha jonin wore at least a piece of her armor. Kakashi knew for a fact that the mesh shirt Anko wore openly was one of Yamada’s more advanced ones, the mesh stronger than steel. \nHis students were each fitted with specific pieces. Naruto argued for mesh in the end because he said he needed to be able to squeeze into small spaces to set traps. Mesh wasn’t the strongest of her armor, but Naruto had a very good healing rate so Kakashi was not as worried. The mesh would give for nothing less than the sharpest chakra blades anyways. Oh he may get cut between the spaces, but he would never be disemboweled. So Naruto was outfitted in a long sleeves mesh shirt, and spandex like pants to wear under his normal clothes that were so inked in seals they had appeared to be black despite the fact the cloth was white. \nSasuke went next and got a set of heavier armor. He got a shirt that was a few layers thick, delicate chainmail sewed between layers of cloth. It was flexible enough for his style but solid enough to take heavier hits. He got pants and a shirt, all in dark colors.\nSakura was the trickiest of the lot. While he wanted to get her the heavy armor she also needed room to grow, not just up, but around the curves. \nArmor was expensive enough he wasn’t going to buy them new sets every time they shot up a few inches. For that reason Sasuke and Naruto’s were a few sizes too large. Easily fixed by folding and bandaging tight at places like the ankle, wrist, and waist. Since they had picked thinner armor, it was flexible enough to do so. But Sakura was going to grow in different ways from the boys. \nIn the end Kakashi sent the boys on a convenience store run and Yamada spent some time fitting her with various combinations. By the time they had decided, Sakura had a chest piece of armor that was fashioned to look like a tank top. It covered mid-stomach to her collar bone and was flat and smooth protecting her ribs and heart. It was made of a layer of plate set between cloth. It was held on by straps under her arm over her shoulders that could be adjusted for growth. The layer touching her skin was a tad more padded and would fit comfortably unless Sakura…developed quite a bit. Sakura wore a layer of mesh like Naruto’s underneath the plate to cover her stomach and lower back . \nSakura was a heavier hitter than the boys and would most likely be more often engaged in taijutsu battles so she got a few extra pieces as well. Arm guards were tucked in the pile to cover her forearms to her wrist. On top of that she got plate armor that hugged her legs and travelled from her ankle up to mid-thigh that was a masterpiece of interlocking pieces to cover her legs while also keeping her flexibility and staying silent. Her plate armor was quite heavy but well worth it in Kakashi’s opinion. She would grow used to it. \n“I can have it to you in two weeks if it’s a rush,” Yamada said with a knowing look.\n“That would be perfect,” Kakashi smirked. \n“Good. I will have to resize and readjust some of it. Leaving room for growth of course,” Yamada said as she tallied his total, “Girl, what color do you want the plating?”\n“I can chose?” Sakura asked startled, “I thought it was automatically black?”\n“I cover the seals with a layer of paint to hide them,” the woman explained, “Do you want plain black?”\nSakura looked to Kakashi but he shrugged.\n“Um, could I have them mostly black? Maybe just some detailing?”\n“Acceptable. What color?”\n“Red,” Sakura finally decided.\nWhen she said the total Sakura winced but Kakashi willingly paid.\n“Are you sure?” Sakura asked shyly, “That’s a lot of money.”\n“And it will most likely save your lives at some point. So well worth it,” Kakashi ruffled her hair, “Let your old sensei give you a gift.”\n“You constantly give us gifts,” she protested.\n“Not like I’m broke,” he chuckled.\nShe let him off the hook but he caught her muttering something to Sasuke and Naruto as they returned. They all took a break outside the shop, sipping at their new drinks and nibbling on the treats Naruto had picked out.\n“So, armor down. I feel like after our adventures in the forest, some of you need some new clothes,” Kakashi said looking them over. \nThey had each got something in the Tea capital, but it was civilian make, not meant for ninja stress. After the trouble in wave the clothes were even more tattered, if not well mended. \n“Let’s go take a quick look,” Kakashi said leading them off to another popular shinobi shop.\nOnce again, this shop was not distinguished by signs or advertisement but by word of mouth. It was a popular store for jonin and Kakashi even recognized one of the men browsing when they entered. It was once again a small shop that had a few racks of clothes but specialized in customization. Most ninja wore a regular uniform or wore custom outfits that rarely changed. \n“Go take a peek,” Kakashi waved his students on. \nThey hesitantly flipped through the racks before getting a tad more into it. Kakashi kept half an eye on them as Sakura started to hold things up against the boys, talking about colors and fashions.\n“Hello Hayate,” Kakashi said, giving his brightest smile to the other patron.\n“Good lord. That look says you want something,” Hayate rolled his eyes, coughing lightly into his hand. \n“Perhaps,” Kakashi grinned.\n“What do you need Hatake?” the man sighed. \n“Anyone you know that can use the Sasumata?”\nHayate paused, eyeing him carefully.\n“Kotetsu,” he finally answered, “Is the only one I can think of. He learned off some man in the capital on a mission, but you know Kotetsu, he doesn’t have it mastered, he’s just passable.”\n“Yes, too distracted by a new weapon before he could master it,” Kakashi nodded sagely, “Apparently one of Gai’s students is like that. Wants to be a weapons mistress.”\nHayate nodded and Kakashi gave him a wave as he went to pay for his own purchase.\n“Sensei, what do you think?” Naruto called, tugging at his sleeve.\nKakashi turned around and tried to hide his wince.\n“I think no,” Kakashi said, “Sakura, why would you let him put that one?”\nSakura smirked at him over Naruto’s bright pink, feathered shoulder. He was wearing some kind of pink feathered cape.\n“Just testing stuff,” Naruto said innocently, hiding giggles behind his hand.\nKakashi tugged it off gently and hung it back on the rack. He paused though as he caught sight of what Naruto was wearing underneath.\n“That is acceptable,” Kakashi said nodding to the rest.\nNaruto was wearing a pair of dark green pants that fit well enough he could wear armor beneath but wouldn’t billow. His shirt was now a dark grey t-shirt that would fit over his mesh and similarly was a tighter fit. He had found a nice multiple pocket and pouch belt that sat snug about his waist in muted green. He wouldn’t be Naruto without orange, but they had found a dull burnt orange haori with a tasteful pattern of swirling grey clouds and green leaves. \n“You’ll have to watch the sleeves,” Kakashi said, tugging at the wide sleeves, “But you can also ditch a haori easily enough if need be.”\nIt actually looked good on the kid, professional but with a touch of his personality. The haori also helped hide the pouches. His chain and sickle would be hidden tucked in his waist against his spine under the haori as well. It was also large enough to make Naruto look smaller, more unassuming when paired with the orange color. More likely to be underestimated.\n“Can I put seals on the jacket?” Naruto asked, looking at the inside of his jacket, “the lady at the shop puts them on cloth and stuff for armor, so can I put storage ones on here?”\n“That is a good question,” Kakashi smiled, “and correct. They are a tad trickier to make stick to cloth but I can teach you.”\n“How does Sasuke look,” Sakura said, pushing Sasuke forward next.\nSasuke didn’t need pants as he would be getting the dark armored ones, nor a shirt as he had one of those coming as well. But he had picked a dark grey kimono like top that had long but narrow sleeves, no large baggy pieces, tied shut with a black strip of cloth he had tied in front, tucking the loose ends in so they couldn’t be grabbed. It was a flat grey, but had patterns in black and blue with hints of silver of mountains and clouds that looked like smoke curling about. The top was tight and secure enough he would be able to carry his Sasumata on his back.\n“Also good,” Kakashi nodded, “Try to find some good kunai pouches. I noticed your one was a tad ruined from our last spar.”\n“I have some at home,” Sasuke said.\n“Find new ones,” Kakashi said again. \nSasuke looked up at him with narrowed eyes but Kakashi reached out and ruffled his hair.\n“Pick out you own. You have the money.”\nSasuke finally nodded and wandered off, Naruto looking between them confused. \n“Make sure he gets some,” Kakashi told the blonde boy seriously, “He doesn’t need to wear his dead family’s.”\nNaruto’s eyes widened and he hurried off. Technically it would be a waste not to use the Uchiha’s, but Kakashi didn’t think Sasuke needed to use the things of his dead relatives. He’d obviously been using their weapons, but weapons were different than clothes that had been worn into shape by specific people. \n“Me next!” Sakura interrupted his dark thoughts, stepping forwards. \nShe would be covered ankle to waist with first spandex armored pants and then plating but she had found a short dark red kimono that fell mid-thigh with wider sleeves than Sasuke’s so it fit looser, but not the long impractically dangling ones that kimono usually had. She had tied it shut loosely in the front with a black belt that held a few smaller pouches along its length. The pattern on her kimono was a series of blooming chrysanthemum in dark purples and pinks with tasteful designs between them. It was clear she intended to only wear her armor plating and mesh beneath it.\n“Very nice,” Kakashi complimented, “Same as Naruto, make sure no one gets a grip on it if you have it that loose.”\nShe nodded and went off to fetch the boys who were digging through a box of kunai pouches. By the time they exited the shop, new clothes paid for it was well into the afternoon.\n“I think I see a theme,” Kakashi said amused, looking at his cute little students in their dark pants and traditional patterned tops.\n“Like a uniform!” Naruto grinned. \nKakashi laughed and ruffled their hair.\n.--.\nKakashi watched with half an eye as Kotetsu went through the motions beside Sasuke. Sasuke was watching with careful attention but Kakashi had his sharingan out, since Kotetsu couldn’t come back every day to teach Sasuke. They would at least know better basics and could work on their own after he left.\nThe other half of his attention was on Naruto and Sakura lightly sparing on the other side of the clearing using their own weapons. \nKakashi had bartered with Miyazaki, owner of the local weapons shop and weapons enthusiast to copy an hour’s worth of lessons using a hammer and a chain and sickle. He had known enough about the chain and sickle that Kakashi would be able to keep Naruto busy for a bit, but even he had only known the bare basics of using a hammer. His cute little student just had to pick the one weapon no one in Konoha used. Oh well, she’d muddle through it till they could find a sensei. He had already noted she as heading for the library after lessons, and after checking up, had found she had been looking at the few scrolls on intel they had on said weapon. \n“I have one more gift for you,” Kakashi smiled at Sakura as she and Naruto took a break.\nHe held out a scroll and she eagerly unsealed it.\n“Wow!” Naruto crowed, leaning over her shoulder to look at the large hammer.\n“The wooden one you were using is okay, but it wouldn’t hold up to the strain of real battle. Miyazaki got this one from Iwa. Real steel so it will be heavy,” Kakashi warned.\nSure enough she had trouble lifting it as easily as the wooden one. He trusted she would get it though.\n“This must have been expensive,” she muttered, eyes narrowed.\n“Got a deal actually. No one wanted it for the same reason we can’t find you a teacher; no one in Konoha uses the hammer.”\nWhich was true, he had gotten a splendid deal actually. He ruffled her hair and set her and Naruto back to work, Sakura much slower under the new weight. \n.--.\nNo one became a ninja for the pay. \nEvery ninja got a small stipend a month (based on rank) as long as they worked either missions or in village. It wasn’t done per mission as that would create a competitive work environment in a place they tried to foster cooperation and teamwork. So instead you were paid according to your rank as long as you filled a certain number of hours a month. Out of village missions could count towards more hours since you were technically on duty at all times while away. You could also stock pile hours, such as working back to back missions for one month to take the next off as long as you were not specifically needed. It made sure ninja took the initiative to keep busy but since everyone got a similar pay no one was fighting for missions or sabotaging others to get hours. Genin were given a bit more leeway in the hours department if the sensei filed for more training hours (which is what Kakashi had done for their training trips) which was usual before exams and the like. \nThe only way to make extra money was to get bonuses on well done missions (by the Hokage’s decision) and by collecting bounties while out on missions. There were cases where ninja accepted small missions while out on larger ones as well. Local villages would sometimes ask for certain help if a ninja wandered through town. As long as it didn’t interfere with the village assigned mission it was fine. You just had to declare it to pay taxes on the mission. Same as the bounties. \nIn return Ninja got subsidies on housing, ninja specific housing available to those who did not want to find anywhere else or couldn’t. Healthcare was free. Certain bars and restaurants (especially the Akimichi ones) would give discounts as well. Standard weapons could be gotten from the armory, a certain amount per month, only extras needing to be purchased out of pocket. And since D-ranks were provided free of charge to any villagers who could prove a need, most civilians tended to tip the ninja since they hadn’t had to pay for the service. \nAs for teachers, well, jonin sensei got a decent stipend while training. They were treated as working hours and they were given a tad extra to help with the training be it for tools, the odd team bonding meal, or such. \nKakashi had been holding onto that stipend saving it carefully as they didn’t have to spend anything in the middle of nowhere. Kakashi was also by no means a large spender. He had his cheap apartment and he had everything he could need. The only things he regularly purchased was food and weapon replacements. His only vice was porn, so he didn’t spend money at the bar or the brothels. The only other thing he ever spent money on were his ninken, but the Inuzuka rarely charged him for check-ups or appointments. \nSo Kakashi who had been working full time since he was 6 years old had a decent amount of savings on his own. But he was also the head of the Hatake clan. While they had never been the most prosperous clan, they had still at one point had a decent amount of members. Most Hatake had preferred simple lives, not spending lavishly, so savings had built up there as well. While there were other Hatake in the ninja ranks, distant cousins and relatives, Kakashi was the last of the main branch. To be honest the Hakate wasn’t so much a clan now as it was a scattered family. Kakashi could claim no relative to be close nor did he want to to be honest. \nBut that didn’t man he wasn’t still head of the clan with a vote on the council and a nice nest egg of savings.\nAlong with a house. \n.--.\n“This is your house?” Sakura asked, nose wrinkled as she looked at the dusty doorway.\nThe front gate had squeaked atrociously when they had opened it and there were so many dead leaves and weeds on the ground they had had to push hard. \nKakashi hadn’t touched the place since his father had died to be honest. When he remembered every few years he got a D-rank ordered to clean it up and do a few repairs, but it had been a few years since then. To be honest, Kakashi had thought of selling it many times, but in the end he always paused. For one, it was a hassle to go through the trouble of selling it, for another…well it had been his families. He had been born here, he parents had died in here (one in childbirth, one via suicide). It was his families and while Kakashi had doubted he would have more family to fill it, some lingering ghosts and memories had compelled him to leave it be. \n“Yup,” Kakashi said with a slightly forced cheerfulness.\n“Looks like a mess,” Naruto declared looking around the small yard before the front of the house. \nAt one pointed it had been a beautiful garden with trimmed trees and flowers. Now it was a wild tangle of dead leaves, weeds, and out of control plants. \n“Haven’t been in here in…hmm must be going on twenty years now.”\nThe stared at him surprised, trying to understand, but he just smiled at them, book tucked away and hands in his pocket. Kakashi made a go-ahead gesture after a long silent moment. The kids cast him looks under their lashes and then looked at one another in silent communication before entering. \nKakashi stayed, leaning against the front gate, and listened as they wound their way through the house, through the traditional rooms and up the narrow stairs. He could hear it when they stomped through the inner courtyard and then leapt to the roof. He couldn’t help the fond smile as they all yelped, suddenly realizing the ninja house was defended against sticking to the roof. \nThe sound of their fall into the pond was hilarious. \n“It’s a ninja house!” Kakashi yelled over their splutters, “The roof and the walls and fence are all made to make sure no one can use chakra on them!”\n“Now you tell us!” Naruto howled. \nThy joined him a few minutes later, after they had boosted themselves on the roof without the use of chakra to peer at the tiles and the fence surrounding the property. He decided not to let them know yet that their were seals rigged under tiles and stone and that at any moment he could activate them to send lightening chakra surging through the roof, fence, or gate. That was a well held Hatake secret. \nThe three trooped back up to him, all dripping.\n“Naruto,” Sakura said, “Make at least twenty clones.”\nHe did so, filling the small front yard to the brim. \n“Send some to get supplies,” she further commanded handing him a list.\nKakashi snagged the clones before they could run off and tucked his wallet in their hands with a stern look.\n“It’s my house so you use my money to buy supplies,” he said.\nNaruto shrugged and hurried off. Or well, three clones did. To be honest Kakashi wasn’t sure which one was the real Naruto; that was the beauty of shadow clones. \n“Sasuke, do you know how to fix paper doors? And clean tatami mats?” Sakura asked Sasuke, relying on his knowledge of more traditional styled homes.”\nSasuke nodded and was sent off with three clones.\n“The rest of you,” Sakura said turning to the fifteen Naruto’s, “Two on this courtyard, five in the back, five for downstairs, and three for upstairs,” \nThe clones all saluted and fell on the pile of cleaning supplies they had all brought for this mission.\n“There should be yard work tools in the back,” Kakashi called at the outdoor clones. \n“And don’t forget Naruto went off to get plants as well when he gets supplies, so don’t feel bad about uprooting to many,” Sakura added.\nThey gave a war cry and attacked the house as a mob of cleaners. \n“And what are you going to do?” Kakashi asked Sakura.\n“I’m supervisor,” she said with an innocent look, “It’s a full-time job wrangling Naruto and his clones.”\nHe laughed and ruffled her hair. She batted his hand and then gave him a shove out of the gate.\n“Go get tea of something, sensei. Leave this to us.”\n“Mah, I can help,” Kakashi smiled at her.\n“No,” Sakura said putting her foot down in a childish sort of huff, “You can see it when we’re done, and you have calmed down.”\nHe stared at her, but she glared back, arms crossed.\n“So smart,” he told her absently, patting her head.\n“Go sensei,” she said gently, “and whatever you hate about this place, we’ll fix it.”\nHe wondered if she was too optimistic. He would never forget the way his father’s blood had pooled on the tatami mats or the way his hair had looked in the dawn sunlight coming through the windows. But…but maybe these three could chase the memories away enough he could enter for the first time in twenty years.\nHe went to get tea to calm himself down. And to say thank you he made sure to order a very nice lunch for the three.\n.--.\nIt took the kids all day to clean up the old Hatake manor, and the only reason they finished in a day is Naruto made a few more clones. Kakashi had had lunch delivered to them as he went to the memorial stone, still a tad unsettled, but he made sure to take them a late dinner himself. \nWhen he arrived at the manor, dusk was drawing closer, but enough light still shined to show him the differences. Someone had also cleaned up the lanterns around the property and lit them all, casting soft glowing light. Sakura met him at the gate, obviously having been forewarned by a clone or Sasuke’s excellent chakra sensing to his arrival. Naruto and Sasuke joined her a moment later as Kakashi admired the front garden.\n“Come see,” she demanded. \nKakashi nodded, took a deep breath discreetly and stepped onto the property.\nThe front yard was back to its former glory with beautiful trimmed trees and blooming flowers set between rocks. Someone had straightened the granite lantern as well as the bench at the back corner. Naruto had even raked the gravel path nicely and it was a sort of calming vision.\nKakashi toed his sandals off and followed his students into the well-lit house. The doors slid easily in their tracks and any wear or tear had been touched up with stain. The floor had been polished to an inch of its life and Kakashi could see they had already replaced a few tatami mats. The kitchen had been scrubbed to gleaming, a small pile of wood stacked to the stove. The table had been washed and Kakashi found it set up with a small vase of flowers. \nEvery window had been cleaned and wiped, all the paper doors fixed and tidied. Even the ceiling looked to have been dusted and wiped with a clean cloth. Sakura said something about replacing a few roof tiles and fixing a leak or two. Naruto made a face and said the bathroom had been scrubbed. \nWhen they led him onto the back porch, looking over the inner courtyard Kakashi paused. This garden had been cleaned, trimmed, and weeded as well. It looked like they had found some more rocks somewhere, and somehow cleaned out the small pond. And if Kakashi wasn’t mistaken….\n“Did you get new koi?” he asked faintly.\n“Sasuke donated them!” Naruto was the one to grin and nod.\nKakashi raised a brow at the dark boy who looked away.\n“I never took care of them,” the boy murmured.\nKakashi looked across the darkening courtyard, lit by granite lanterns tucked inside the garden and lit by paper lanterns that hung from the porch. \n“The electricity will have to be turned on again,” Sakura remarked, “and maybe checked. It’s old and I don’t know if it’s a fire hazard. The water will need to be turned on as well, but we used water jutsu to fill the pond.”\n“Mah, you talk as if I’m moving in,” Kakashi waved a hand.\n“Aren’t you?” she asked shrewdly.\n“Nope!” Kakashi grinned.\n“Then why make us clean it!?” Naruto demanded.\n“Because you are moving in.”\nThey all froze.\n“What?” Naruto squeaked. \n“Your apartment is atrocious,” Kakashi smiled at Naruto, “And this place is free. You might as well take advantage of that. All you have to pay for here is utilities.”\nNaruto was staring at him.\n“You’re all welcome of course,” Kakashi said giving Sakura and Sasuke a look, “I know you all end up hunkered down at Naruto’s half the time.”\nThey didn’t look ashamed of the fact they often got together most nights to practice music, or go over lessons that one or the other had trouble with, or even to share a meal. Kakashi had been invited a few times but they needed time alone to bond together and be kids, not students.\n“I know Sakura will want to go home to her parents some days, but nothing wrong with having a bed here as well,” Kakashi continued, “And the Uchiha compound is so far out of the way it might be more convenient to have a bed here as well.”\nAs Sasuke looked down Kakashi gave Naruto and Sakura meaningful looks. Kakashi was not happy with Sasuke wallowing in grief and ghosts alone in a large empty compound surrounded by memories of blood and death. But Sasuke was too practical to ever rent an apartment when he had the compound. If Naruto and Sakura pushed though, he would follow. Especially if the place was offered freely. The two gave him curt nods over Sasuke’s shoulders. He hadn’t outright told them such things but they had started to pick up on it.\n“I’ll get the utilities hooked up again tomorrow,” Kakashi announced, “And you can move in.”\nHe didn’t phrase it as a question. Didn’t want to give any of them the choice to refuse. When Naruto tackled him in a hug Kakashi beamed at them. \n.--.\n“Here,” Kakashi said, offering an instrument to Sakura. \nNaruto was thumping about somewhere above him, Sasuke following silently, but Sakura had been tucking groceries in the fridge so it was just them in the kitchen. The plumber and electrician had declared the place sound enough and re-hooked up the water and power easily. Kakashi had gotten it put under his name but the Naruto had said strongly that they would pay for them. \nIt was the work of a few clones and an hour for the kids to gather everything they needed to move in and they were now unpacking. One of Naruto’s clones had pulled Kakashi aside and revealed he was worried about Sasuke after seeing the Uchiha manor and how empty and isolating it was. Kakashi merely patted him on the head and told him that they had to make sure Sasuke spent all his time here then. Kakashi was proud of how well Naruto had taken stock of his teammates situation. The Naruto from before would not have known Sasuke enough or been observant enough to notice such a thing. \nSo Naruto had bullied Sasuke into moving most of his stuff to this place, making him take up the room next to Naruto’s. Even Sakura had moved a great deal of her stuff in, leaving the bare minimum at her parents. Sasuke had even graciously given her an extra futon from his own manor so she would have a permanent bed here.\nSakura looked at Kakashi from where she was putting their combined food stuffs away in the kitchen and only reached out when Kakashi continued holding the instrument out. She took it, running her fingers over the cherry colored wood and the pink sakura patterns on the silk side.\n“It’s beautiful,” she breathed, fingers running over the strings.\n“It’s yours now,” Kakashi smiled.\n“Kakashi-sensei! I can’t accept this! It looks expensive!” she protested, aghast.\n“I got it for free,” Kakashi said cheerfully.\nSakura wavered looking at the beautiful instrument she couldn’t afford on her own pay cheque and her will crumbled. \n“Thank you, I promise to take care of it,” she said solemnly.\n“You better,” he teased, “Or my Mother’s ghost may haunt you.”\nHer eyes flew wide and surprised and he vanished in a swirl of leaves before she could insist on giving it back again, running off to help Naruto and Sasuke.\n.--.\n“How many are we at?” Kakashi asked as his kids handed in the last D-rank mission scroll for the day.\n“28,” Sakura said instantly. \n“Good good, we’ll come back tomorrow then for one final sweep.”\nThe chunin at the desk groaned. There were no rules saying they couldn’t take all the missions in one day as long as it even out over a week, but he had to deal with the teams who had planned to do a mission getting hissy when there were none. \nHis kids merely smiled innocently at the groaning chunin and followed him like ducklings back into the street.\n.--.\nSasuke had brought his mother’s Koto along to the Hatake manor, and finally pulled it out one evening. Naruto and Sakura oohed and awed over the quality of it as Sasuke flushed proudly. \nSakura had tried returning the Shamisen a few times in the last couple of days but Kakashi pretended to be deaf and blind every time she brought the topic up much to the amusement of Naruto and Sasuke. Kakashi had also got Naruto a new bamboo flute was what he told her whenever she pushed. She spluttered saying it wasn’t the same but he just ruffled their hair. \n“Okay,” Kakashi flopped down onto the cushion set on the deck, “You’ve been practicing for weeks. Let’s hear what Katsuya taught you in Wave.”\nThe three snapped to attention sending looks to one another. Sasuke settled the Koto gently on the polished wood porch and settled on his own cushion. Sakura sat formally in the seiza, close to Sasuke and set the shamisen on her lap, bochi in hand. Naruto sat much less formally, legs hanging over the edge of the porch. \nEvening had settled a while ago and the sun was gone. The only light came from the living room, the paper doors thrown open so the light fell onto the porch, and the paper lanterns Sakura liked to light. The soft sound of the rain muffled the sounds of Konoha as the rain that had been spiting all day fell heavier in the nightfall.\nSakura took a deep breath, looked at the boys who nodded, and struck the strings, sending note trilling.\nKakashi listened, slouched on his cushion, book nowhere to be seen. It hit him, as he sat with a cup of steaming tea near his hand and his three students starting up a song, perfectly in sync, that he was …happy. The sound of rain and the traditional instruments, looking at his students concentrated faces, feeling safe and content, Kakashi realized he was actually happy.\nHis heart felt light and he let himself relax to the music and Kakashi breathed easily for the first time in a very long time\n.--.\n“The chunin exam will take place in three days as you well know,” the Hokage announced to the assembled crowd of jonin, “You have all been given your duties and assignments.”\nKakashi glanced across the room idly, taking in the fact most of Konoha’s jonin were packed into the room. It seemed the Hokage had recalled all Jonin back to Konoha for extra security for this exam. Not unusual. \n“Additionally, any sensei who would nominate entries into the exam may now step forward.”\nThere was the usual shuffling as people glanced about, unwilling to be the first ones to draw attention to themselves. Most waited as well to see who was assured of their team enough to entire. It would hold up a marker of what level was generally expected.\n“I nominate, Team Seven,” Kakashi said cheerfully, snapping his book shut.\nUmino Iruka, the Hokage’s favored chunin and paper-work nin outside of the academy, spluttered from where he was busy writing down the Hokage’s words. \n“They are six months out of the academy,” the man hissed, “You think they’re ready for this exam?!”\nKakashi eyed him, looking at the Hokage’s smile. Umino Iruka was a very loyal and very proficient ninja, one of the reasons the Hokage blatantly favored him. He also had a protective streak which had made him an asset in the academy. Iruka may have only held the rank of chunin due to skill level, but Kakashi was absolutely sure his clearance level and political power was well beyond that. \nIruka was a dangerous man to cross.\nKakashi merely smiled at him. The Hokage watched with a fond sort of amusement, silent even as they took over the meeting. No one even thought to get between the Hokage’s two favored ninja in this argument. Especially not with the Hokage tolerating, if not actively encouraging, it. \n“You think they aren’t?” Kakashi asked.\n“They’re children.”\n“As are all the students you graduate. That does not mean they are not ready.”\n“They’ve had barely six months of training under you!”\n“And it has been intensive training,” Kakashi said flatly, smile slipping away, “I have trained them to be soldiers and shinobi and they are damned good. They are more than ready for the chunin exams. Do you doubt me Umino?”\nIruka finally huffed, winding down. While he may hiss and spit all he wanted, challenging Kakashi in subtle words, even he would not question Kakashi when it came down to it. Iruka was a quick witted man and he knew with certainty that no good would come from challenging Kakashi’s professional opinion and decisions.\nKakashi met his gaze and Iruka finally bowed out, writing the nomination down. \nKakashi saw the other jonin exchange silent looks, obviously breaking down the argument. He also saw the other jonin sensei hesitating now, having heard the conviction in his words. Kakashi had made sure he was 100% sure Team Seven was ready. This was no wishy washy test run for them to try in the safety of their own village. While the majority would nominate their teams just for them to see the exam in the more relaxed environment of their home territory, many would not expect their teams to pass. \nKakashi expected his team to dominate.\n.--.\n“Well, that makes a nice even 35,” Kakashi brushed his hands cheerfully.\n“35 isn’t an even number in any way, shape, or form,” Sakura glowered at him. \n“It is now,” Kakashi declared.\n“That doesn’t make sense,” Sasuke muttered under his breath.\n“Anything I say makes sense,” scolded Kakashi.\nThey all rolled their eyes at him and he grinned.\n“Now, let’s go pick up your armor.” \nThey followed him through the streets, picked up their armor with many thanks for Yamada, and retreated to their training grounds to tug it on.\n“Well, it’s been three weeks since we arrived back in Konoha,” Kakashi announced as the kids pulled on their footwear, “And you may have noticed I was pushing you hard to finish D-ranks and smooth out all your training.”\nThey focused on him instantly, all going still as they sensed he had something important to say. Kakashi only spoke long groups of sentences when he had an important lesson and they had all taken to concentrating when he started in on more than just a few sentences. \n“And I got you armored up and prepared,” Kakashi continued.\n“Please don’t tell us you’re dropping us back off in the woods,” Naruto moaned in despair. \n“Not exactly,” Kakashi said lightly.\n“That’s not a no,” Sakura eyed him like he was a wolf; all sharp teeth.\n“I mean, I’m not allowed to say whether or not there will be a forest in which you get dropped off in,” Kakashi said, “As in really am not allowed to say that there is a good chance.”\nThey stared at him wide eyed and he let them evaluate that for a minute.\n“I’ve entered you in the chunin exams,” Kakashi finally announced, holding up three forms.\nThey all froze, staring at the papers.\n“It’s in two days,” he smiled.\nThey stared, aghast, and he saw panic and awe and excitement all start to creep in together.\n“So, if you want to enter, here are the forms.”\nThey took them, all staring holes in the paper.\n“You have tomorrow off to prepare. If you decide to enter, you need to be at the academy at 9am the day after. 3rd floor, your old classroom.”\nSakura looked up at him, lips pressed in a narrow line as Sasuke read the paper religiously. Naruto was starting to grin.\n“Do you think we’re ready?” Sakura asked carefully, “I mean, it’s in Konoha which makes it a safer test run to participate in than any other country, but are we really actually ready?”\nHe offered her a grin and ruffled her hair.\n“Yes,” he smiled.\nShe beamed. Naruto grinned behind her and even Sasuke smiled, pleased.\n.--.\nKakashi felt the intrusion before even the first knock, sensing the miniscule but revealing flare of chakra that was almost unnoticeable in the village of ninja. Kakashi stood and flashed a few signs at his students so as not to alarm them and was at the door in a moment, smiling in welcome at the two shadowed figures standing inside his gate.\n“Hokage-sama, Umino. Would you like tea?”\n“That would be lovely,” the Hokage smiled.\nKakashi held the door open and they entered toeing their sandals off to follow him down the hall. Kakashi led them to the back garden where Sakura had already pulled out extra cushions for their guests. Sasuke had went to the kitchen to fetch tea at the sound of their conversation. \n“Jiji!” Naruto crowed happily, reaching for a hug.\nThe Hokage readily folded him in an embrace and smiled a lot more genuinely as Naruto babbled something about his day. Naruto went for Umino next and Kakashi watched in interest as Umino’s smile softened and deepened from politeness into fondness. Umino and he often clashed for the fact that Kakashi treated all shinobi as soldiers and tools in various situations. Kakashi was a field commander, a war veteran, and a genius. He was also a pessimist at times, or a realist in his own mind, and as such he could be harsh and cold at times and he knew it brushed Umino the wrong way. Umino was a man of empathy and emotion who probably cared a tad too much for his students (not that Kakashi could say that anymore without being a hypocrite). \nThey had just never gotten along.\n“Thank you Sasuke,” the Sandaime said as Sasuke gracefully set a tray down and served the elder tea. \nUmino likewise gave a wide smile and a thank you. \n“Did we interrupt something?” the Hokage asked sipping his tea.\nKakashi cast a glance about at the abandoned instruments as the three genin sat together and listened respectfully. Good to see his lessons on patience and manners were working as well. \n“Just some practice,” Kakashi smiled, “Would you like to see?”\n“Yeah! I learned the flute Jiji!” Naruto crowed diving for said flute.\n“Let’s hear then,” the Hokage laughed.\nNaruto, Sakura, and Sasuke took up position and picked up their instruments with nervous-excited fingers. They exchanged glances, Naruto vibrating with energy and Sakura showing the open nervousness while Sasuke went stone-faced. The first notes were struck and Kakashi watched all the tension melt away as his kids fell into their relaxing hobby. With half an eye Kakashi watched as Umino’s expression morphed into astonishment and joy, watching the three kids like a fond parent. \nPutting Umino in the academy had been a good idea, even with his other use as the perfect bureaucrat. He felt too much for the kids to ever be put on active missions with them; he’d go rogue in an instant for any of his kid’s safety. But that nurturing and care worked perfectly to mold future ninja who were loyal, who looked at their caring instructors with fondness. \nUmino clapped happily as the kids finished and the Hokage gave them all a wide smile and congratulated them.\n“Naruto, why don’t you and Sasuke do that duet you learned,” Kakashi said, “Sakura, maybe you could grab the mochi from the kitchen.”\nHis kids obeyed with only a few sideways glances. Kakashi stood and held the door open for the Hokage to show him inside. They left Naruto and Sasuke picking up a jaunty tune, the music drowning out their footsteps as Kakashi led the Hokage to what was a neat and tidy little office. It was where all their rogue scrolls and paper work were filed. Kakashi had been trying to teach his students the art of filing and keeping track of finances and missions properly. \n“What brings you out this late Hokage-sama,” Kakashi asked, offering the chair at the desk to the man. \nThe Hokage sat down, hands tucked carefully in his sleeve and Kakashi carefully sat on the floor, seiza. The Hokage did not do house visits. Unless it was a formal meeting or dinner. Or punishment. Kakashi kept his hands on his knees, kept his chakra carefully controlled, and waited for whatever was to be said. \nThe Hokage sighed faintly, glancing about the room.\n“You have taught your students well,” the Hokage said, “I had high hopes in you; I’m glad they weren’t unfounded.”\n“Thank you,” Kakashi said simply.\n“I’ve been watching the past week,” the Hokage said, flipping idly through a mission report on the desk, “You have made, what was a disaster of a team on paper, into a well-oiled machine. They have teamwork, they have respect for authority, they are more loyal than ever before. I had…”\nThe Hokage paused, frowned. Kakashi waited for the other shoe to drop even as a faint trace of pride welled in him. \n“I had my doubts about the team. The civilian raised girl, the broken Uchiha, the Kyuubi jinchuriki. A political powder keg of a team. But you did what you do best Kakashi; you preached teamwork and left no man behind. You have made a team I think is on the way to greatness.”\nThe Hokage paused again, sighed and rubbed wearily at his face.\n“You’ve given them weakness too,” the Hokage said calmly.\n“Weakness?” Kakashi questioned.\n“They are like you,” the Hokage said pointedly.\nAt first there was pride, but it withered to ash on his tongue and Kakashi abruptly felt sick.\n“When one of them dies, the others will fall apart just like you,” the Hokage said not unkindly. \nKakashi could not help his flinch. Kakashi knew the failure of his own genin team. Knew how the world had crumbled and greyed and Kakashi had been the only one to walk away. He had learned to care and learned what caring too deeply did all in only a few years. He carried those regrets every day. But he had survived. He had survived and fought and was still loyal to Konoha.\n“They won’t shatter,” he said, words like poison in his gut.\nNot like me, he didn’t say.\n“Perhaps,” the Hokage allowed, before giving the finishing blow; “They’re more likely to all die together.”\nKakashi looked down at his hands and tried to hide his trembling. There was a scream building up in his throat, of horror, of denial. \n“But…” the Hokage sighed, “I can’t say you did wrong. Of all the shinobi in this village, they will need bonds that strong the most.”\nBut Kakashi couldn’t agree anymore. What if he has just molded them into his old team? One dies and they all fall like dominos with one shattered husk remaining. \n“Hatake Kakashi,” the Hokage said solemnly, “I have a mission for you.”\nThe Hokage has always held Kakashi’s leash, always known how to make him focus. And so Kakashi snapped out of his doubts and snapped to attention. He could scream later, could worry his way into being sick later. But for now, his Hokage was commanding him.\n“Yes sir,” he said.\n“I will need your full attention for this,” the Hokage said looking solemn, “I have only trusted three other people with this information.”\nKakashi slipped into the cool controlled veneer that had gotten him in and out of ANBU alive.\n“I am yours to command, Hokage-sama!” he bowed.\n“Good. The chunin exams,” the Hokage started.\nKakashi sat perfectly still as the Hokage delivered his information, delivered his mission. In the very end the Hokage stood and handed him a small security locked scroll. Kakashi checked the authenticity and then summoned Pakkun to take the scroll somewhere safe. The Hokage clasped Kakashi’s shoulder and gave it a firm squeeze, eyes dark and sad all at once.\n“I am counting on you Hatake Kakashi,” he said solemnly. \n“I will not fail you sir,” Kakashi saluted.\n“Good. Now let’s go get back to the genin. I can feel their agitation from here.”\nWhen they returned to the porch Naruto had eaten half the mochi and Umino was showing Sakura a tune on the shamisen. Sasuke was sitting, carefully looking like he wasn’t tracking Kakashi by his chakra signature. \n“Shall we hear another song before we go for the night,” the Hokage smiled.\nKakashi watched his students clamor to obey and carefully did not look at Umino or the Hokage again. \n.--.\nKakashi looked at the three nervous faces before him and pretended he didn’t feel any of the same nervousness. Sakura was working the hem of her kimono shirt, Naruto was fidgeting, and Sasuke was looking everywhere but anyone’s faces. They had slipped up the walls of the academy, bypassing the pre-test of genjutsu so easily and still looked so anxious. His cute little students.\n“What are you?” Kakashi asked, no hint of humor in his voice.\n“Team seven!” Naruto cheered.\n“And what does that mean?”\n“No one gets left behind,” Sakura said, sure and still. \n“And?”\n“And everyone must live,” Sasuke whispered fists clenching. \nKakashi crouched to look them in the eyes, face still solemn.\n“Remember, the team before the mission,” he told them, heartfelt.\nThey looked at him, all wide eyes and childish faces with weapons in their hands and power in their fists. He looked at their odd little uniforms and the armor he had purchased to protect their breakable bones and organs. He thought back on the Hokage’s words, though of the idea that he had molded them into his old team. And he shook the thought away. Maybe he had indeed bred weakness into them, but there were worse things for a ninja to be then reliant on teammates, in and out of combat. Each of them would have struggled alone, would have faced a harsh world all alone, but he had brought them together at the very least; given them teammates to rely upon and all the knowledge they could need to survive.\nKakashi looked at them and finally, finally he didn’t see his old team. He didn’t see the dead looking out.\nInstead he saw Team Seven. He saw his students. He saw the living.\n“Go give them hell,” Kakashi smiled, soft and loving.\nThey smiled back and Kakashi’s heart finally seemed to find a hold in his chest. Finally his heart beat evenly, fully, like it wasn’t half dead anymore. \n.--.\nEND PART 1\n.--."
}