{
    "id": "16374530",
    "url": "https://archiveofourown.org/works/16374530?view_full_work=true",
    "author": [
        "100percentfluffster"
    ],
    "title": "Your Bruises Drive Me Insane",
    "rating": "Not Rated",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Peter Hale/Stiles Stilinski"
    ],
    "characters": [
        "Peter Hale",
        "Stiles Stilinski",
        "Derek Hale",
        "Scott McCall (Teen Wolf)",
        "Erica Reyes",
        "The Pack (Teen Wolf)"
    ],
    "additional_tags": [
        "Peter Hale & Stiles Stilinski Friendship",
        "Protective Peter Hale",
        "Pack in the background mostly",
        "Stiles is a squishy human",
        "Abuse",
        "Hurt/Comfort",
        "Fluff",
        "Peter is FluffWolf",
        "Peter Hale Loves Stiles Stilinski",
        "Peter respects Stiles",
        "Bad Friend Scott McCall (Teen Wolf)"
    ],
    "language": "English",
    "series": "",
    "published": "2018-10-22",
    "completed": "2018-10-23",
    "words": "10,118",
    "chapters": "2/2",
    "comments": "205",
    "kudos": "7,560",
    "bookmarks": "1,592",
    "hits": "60,996",
    "summary": "<p>They always seemed to forget that Stiles was human. In some manners at least. Scott and Derek always went on about how he was too fragile to be helpful. That he was a liability and the weak link of the Pack, but that awareness of his fragility seemed to always disappear when it came to their own aggression. </p>\n<p>A story of how Peter notices the way the Pack treats Stiles and does everything he can to step between Stiles and further harm.</p>",
    "notes": "<p>I wrote this with a romantic relationship in mind, but it's never clarified so could be read as platonic. Whatever floats your boat really. <br>Playing fast and loose with the timeline because I've only actually watched the first season.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Here by popular request is a continuation of the story! This time from Peter's point of view.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Thanks for the great response to this story, all within just a day! That's amazing! By far the best response I've ever gotten from a fandom. I think I'll like it here in the TW fandom :) I have many Steter ideas to write about!<br>Let me know what you thought about Peter :) Thanks for reading</p>\n<p>This didn't come out the way I wanted it, but it's also four in the morning so... *shrug* <br>Let me know what you think. I may rewrite this later if I get a better idea of what I want to convey here. Any thoughts on that would be appreciated. </p>\n<p>I normally very much love Derek and Erica (and Lydia) but in this fic I needed the Pack to be douchey as a unit. </p>\n<p>This is my first TW fic and I know I don't have a great grasp on the characters yet, but I hope they aren't too OOC. Thanks for reading! Happy to get criticism.</p>",
    "text": "\nThey always seemed to forget that Stiles was human. In some manners at least. Scott and Derek always went on about how he was too fragile to be helpful. That he was a liability and the weak link of the Pack, but that awareness of his fragility seemed to always disappear when it came to their own aggression. \n\n\nStiles was getting tired of being shoved into walls and slammed into steering wheels by Derek. He was tired of being dragged by the wrist or arm by Scott or pushed around by Erica and the others. He was human and he bruised and scarred and didn’t heal like a wolf. \n\n\nHe started to have to wear wrist braces after having his joints pulled violently too many times. He kept Tylenol and Advil on his person for when his bruises proved to be too much when he was studying. He wore long sleeves and layers to prevent scratches from too strong nails. He avoided all physical contact with the Pack in an effort to stop being injured in their forgetfulness. \n\n\nHe could forgive them at first. The betas were new and didn’t have great control, he understood that. Derek had anger issues and a dead family haunting his every step, he understood that. Scott had troubles treating him any differently than he always had, he understood that. But even after telling them countless times that they were hurting him, nothing got better. \n\n\nSure, Scott would sometimes act like a kicked puppy if Stiles snapped at him, and things would get better for a couple days, perhaps even weeks. Eventually, his best friend would resort back to grabbing his wrist and pulling though and Stiles would feel his joints pop and strain under a powerful grip. \n\n\nJackson shoulder checking him into lockers became exponentially more painful and Erica smacking his hands away from her fries ended with bruised bones and an actual fear of doing it again. Isaac accidentally smashed Stiles’ bruised fingers in a locker at some point which very nearly broke his hand into pieces. Lydia once even partially burst his eardrum during a pixie hunt. \n\n\nThey’d apologize and whine and try to kiss it better and give him ice packs, but it never stopped it from happening again. And after a while...they stopped noticing. Or caring. Stiles stopped yelling at them for leaving bruises every time they touched him because all it did was make him lose his voice. It started to seem normal to him and he figured he was still alive, so what did he have to complain about.\n\n\nThen Peter came back from the dead and Stiles was reminded of something. \n\n\nPeter never hurt him. Even when he’d been insane, each touch to his body had left behind no evidence. The claw to his chin, the hand on his neck, the gentle grip on his wrist, none of them had hurt him. When Stiles had rejected the bite and pulled his arm back, there was no hesitance in Peter’s release of him. \n\n\nAfter the kanima, when Peter came back, the man kept his distance from them all. He never got close enough to touch or strike out at, he just hovered at the edges. The problem was, that’s where Stiles also liked to be. Ever since Derek had nearly knocked Stiles’ kneecap out of joint by pushing a chair into his leg, he’d decided the safest place for the Pack human was at a distance. \n\n\nIt didn’t always work, he’d often need to be in the thick of things to explain the most recent plan or show them something, but he tried to stay out of range. Which put him right next to Peter. It stayed that way for a couple of months. Stiles began to understand all of Peter’s different silences. All the ways he would use sarcasm to deflect attention and the ways he avoided touching anyone. Except for Stiles. He was always casually touching Stiles and he was the only one of the Pack who never hurt him while doing it. \n\n\nPeter started to talk to him more and hang around for longer. Instead of fleeing after each meeting he’d walk Stiles back to his car or just stop to debate some supernatural topic. Stiles watched as Peter started to fully regain his sanity and begin to settle back into life. He couldn’t deny that he liked Peter when the man wasn’t homicidal. He agreed with Stiles most of the time and helped with research unlike everyone else. Stiles could hold up a conversation with Peter without the man getting lost or bored, it was exhilarating. \n\n\nPeter was back and Stiles finally had someone to talk to, to research with, to complain about Scott to. Peter was back and Stiles was happy to have him. The two of them stayed on the edges of the Pack, providing research and support when needed, but otherwise keeping their distance from everyone else. They stayed to the side, but in general, everything carried on as it always had. Until they didn’t. Until Peter had gotten comfortable enough around the Pack to stay at the loft with Stiles to help with research instead of retreating to do it elsewhere. Stiles really should have seen it coming, but he’d gotten used to no one caring. \n\n \n\nStiles had taken off his braces for the day because his wrists had been feeling pretty good recently. He must have been doing a better job of staying out of reach because the joints in his wrists and elbows didn’t feel like they were scraping together as much. He was enjoying the freedom of writing without the stiffness of the wrappings as he researched harpies with Peter in Derek’s loft. \n\n\nLydia and Jackson were off visiting a relative of one of theirs, leaving Peter and him as the main core for research. They were translating the articles Deaton had found on harpies at the dining room table as the rest of the Pack mulled around. Peter was obviously tense and a bit jumpy, wouldn’t allow anyone behind him and he always had an eye out around them, but he was still there. Stiles hummed an inane song as he jotted down a few of the trickier conjugations in the book, making a note to himself to check his translation of them with Lydia, when Peter very gently tapped the top of his hand to get his attention. \n\n\nStiles leaned over to look at the page Peter was pointing at and they quickly fell into a debate over whether the author had meant to translate ‘blood feather’ metaphorically or literally. It was an easy conversation and one Stiles found himself far too invested in. Peter was smirking at him with light eyes and a raised brow as Stiles tried to make the argument that blood feather could mean the beginnings of feather growth because didn’t Peter know that growing feathers had a vein up the center that provided the new growth with nutrients, and that could create different levels of pigmentation that could lead to-- \n\n\nStiles was cut off abruptly as Scott grabbed his wrist and hand and pulled Stiles away from the table and toward the kitchen. Stiles muffled a curse at the sharp pain through both his wrist and elbow as the joints protested the sudden pressure. “I’m coming, Scotty, no need to damage the goods!” Stiles insisted as he tried to separate himself from his best friend’s iron hold on his arm. He shouldn’t have let himself get so distracted by Peter.  \n\n\nThere was a low growl from behind Stiles and he could feel the heat of Peter coming up behind him. He braced for a tug on his other wrist, berating himself for not wearing his braces and mentally cursing impatient and handsy werewolves. Instead, Scott dropped Stiles’ wrist as if it burned him, and Stiles looked on in surprise as Peter continued to deftly twist Scott’s wrist until it gave a painful pop. “Mind the human would you, Alpha?” Peter drawled, his anger poorly concealed.\n\n\nScott scowled at Peter and shook out his hurt wrist, the injury already rapidly healing even as he began screaming at Peter. “What the fuck, Peter? What is your problem?” Stiles rolled his eyes and interrupted Scott to ask what he wanted before he got the attention of the rest of the wolves. Scott turned angry eyes to Stiles and just shrugged and stomped off. \n\n\nStiles sighed and retreated back to the table where the books lay. Peter joined him not a moment after. Stiles went back to reading as he searched around his backpack blindly looking for his braces. He barely paused in his reading as he wrapped them securely around both wrists and tried not to wince at the movement. \n\n\n“That’s what those are for?” Peter asked in a careful tone that sounded nothing like his normal one. It had Stiles’ head coming up to look at him in seconds. Peter’s eyes were locked on Stiles’ left wrist, the one Scott had grabbed. \n\n\n“It’s sure as hell not a lacrosse injury, dude,” Stiles responded. \n\n\nPeter scowled and instantly responded, “Don’t call me dude.” \n\n\nStiles smirked and rolled his eyes before he looked back down at his notes, trying to remember what he’d been doing before Peter distracted him with feathers. \n\n\n“How often does that happen then?” Peter asked, eyes still very much focused on Stiles and not on the pertinent research on the table in front of them. Stiles groaned in frustration. He just wanted to read about harpies and go to sleep. Was that really so much to ask for? Derek had had him up late for the last several days and he was really running low on energy.\n\n\nStiles was thankful when Derek’s shout for everyone to come get dinner interrupted the conversation. He could feel Peter’s gaze on him for the rest of the night however as he talked to Scott and Isaac about the latest Marvel movie.\n\n\nHe shouldn’t have been surprised when he found Peter leaning against his Jeep later that night, it wasn’t an uncommon sight anymore. He huffed and walked around to the driver's side door and said, “You should really put more effort into not being such a creeper, zombie wolf. The others might like you more.” \n\n\n“Does that mean \n\nyou\n\n like me, Stiles?” Peter asked with a smarmy grin and raised eyebrows. Stiles glared at the other man over the Jeep and flipped him the bird as he tried to stop himself from smiling. Peter slipped into the passenger seat as Stiles got behind the wheel, and honestly, Stiles was expecting nothing less. “Is it normal for your best friend to nearly dislocate your wrist then?” \n\n\n“It’s not dislocated.” \n\n\n“I said \n\nnearly\n\n dislocate. And that’s not the point, Stiles.” \n\n\nStiles rolled his eyes and sneered at Peter, “Get out of my car, Peter. I’m tired and I want to go home where the wifi connection doesn’t suck ass and there aren’t rude werewolves all around.” \n\n\nPeter pursed his lips but opened the car door. “Of course.” Stiles was surprised that Peter was following his command but thankful that he was that much closer to getting to his warm bed. “It’s not acceptable that he did that though, you know that right?” Peter was now looking at him through the open door, crouched awkwardly outside to make eye contact. \n\n\n“Could have fooled me,” Stiles replied as he leaned over to close the door all the way. He didn’t bother with any further reply as he drove away from the loft and back home. Sure, it was rude but Peter wasn’t exactly a ray of sunshine either. He just wanted to sleep, he would talk to Peter later. \n\n \n\nStiles’ breath was forcibly expelled from his lungs as Derek slammed him into the nearest flat surface. That surface happened to be the side of his beautiful Jeep. “I swear Derek if you manage to hurt Roscoe along with me I’m going to poison your coffee with wolfsbane. The kind of Wolfsbane that gives you indigestion for days.” Stiles rolled his shoulders, or at least tried to, Derek’s tight grip on his shoulder prevented him. “Let me go!” \n\n\nDerek just growled and pushed him harder into the side of his car. “Shut up, Stiles.” \n\n\nStiles gave up trying to break out of the grip and instead tried to stay as still as possible to lessen the bruising that Derek’s hand would undoubtedly cause. He didn’t even know what he’d done to piss the Alpha off this time. \n\n\n“I’d take your hands off him, dear nephew.” Peter’s voice surprised Stiles with just how angered he sounded. Peter was often irritated or mocking, but he was rarely so transparently angry. \n\n\nDerek’s spine straightened and his grip tightened even further on Stiles’ shoulder. He could hear his bones grinding against each other and he didn’t even try to hide his wince. He never had, Derek just didn’t care. Or he liked it. Stiles hoped for the first one. \n\n\nPeter made an answering hissing sound and then Derek’s arm was ripped away from Stiles and the human slumped in relief. It was hard to ease his body into a position where both his arm and his sides weren’t being strained though, so he ended up in a half hunched position that left him feeling slightly less achy though undoubtedly pathetic looking. He didn’t think Peter would hold it against him though.  \n\n\nStiles didn’t watch the Hale interaction but was surprised when a soft hand titled his head back after a few moments of trying to breathe through the pain in his body. It was time for another dose of painkillers it would seem. Stiles looked up into the blue eyes of Peter Hale and couldn’t find it in himself to feel anything but relief. “Hi, zombie wolf. How’s the afternoon treating you?” \n\n\n“What was that?” Peter demanded. \n\n\nStiles looked over Peter’s shoulder but didn’t see the sulky younger Hale anywhere. “I don’t know. Weren’t you just talking to him? You should know better than me, I can’t for the life of me keep track of all the ways I piss off your nephew.” \n\n\nPeter’s jaw tightened and Stiles watched in morbid fascination as Peter made a valiant attempt to keep his expression neutral but completely failed to hide his rage. “So that’s normal then?” \n\n\nStiles shrugged and ignored the pain the action caused. He cracked his neck to the side and tried to look anywhere but Peter. “Derek has anger management problems. We all know this.” \n\n\n“Yeah, I know. But that doesn’t give him the excuse to bruise up our token human.” \n\n\n“I’m not the only human!” Stiles protested with a practiced offense. \n\n\n“No, but Scott would slash Derek’s throat the moment he did anything like this to Allison and no one touches Lydia. Except for you and Jackson.” \n\n\n“You think I don’t know that?” Stiles snapped back. It wasn’t something that had missed his notice after all. He \n\nwas\n\n the only ‘fragile’ human that was a\n\nctively \n\ntreated like a chew toy. \n\n\nPeter stepped back and gave Stiles a long look over. Then the werewolf reached forward and gently took Stiles’ right wrapped wrist and pulled it to him. Stiles could barely feel the man’s grip but his breath still caught in a habitual preparation for pain. Peter smiled with no mirth and coaxed his fingers up Stiles’ sleeve until he reached skin. \n\n\nStiles realized what Peter was about to do a fraction of a second before the pain started to drain from him. Stiles didn’t even resist, just sighed and melted back into the car door behind him in relief. The constant aches and stabbing pains of his body slowly bled away and left him feeling a little spacey. A little high. \n\n\nStiles giggled and let his head roll back to smack into his car. “Oh my god,” he groaned out in appreciation of not feeling any part of his body. \n\n\n“Stiles,” Peter said. Stiles’ head snapped back around at the torn up sound of Peter’s voice. He could see the black veins up Peter’s arms and he got distracted by that. “Is this normal? Please, Stiles, is this normal?” \n\n\nStiles looked up into blue eyes and shrugged without pain. “Of course it is. I’m the boy who runs with wolves, right? What else would I expect?” Stiles didn’t try to hide the bite behind the words. He was tired of the pain. He was tired of the pain the first week after Scott was bitten, and it had only gotten worse since then. \n\n\nPeter looked devastated and Stiles couldn’t help but watch as the man reached up to ghost a thumb across Stiles’ cheekbone with the hand that wasn’t currently holding his arm. It was just like every other time Peter touched him. Gentle but sure and so very very comforting. “We’re not animals, Stiles.” \n\n\nStiles snorted and leaned his face further into Peter’s hand. “Except for the part where you all lose your eyebrows and grow teeth and everything.” \n\n\nPeter’s lips twitched up into a slight smile but he still looked all kinds of serious. “My family had humans in it too, you know. Most packs have human members, whether they be born or married into it. This,” Peter said with another glance at Stiles’ lithe form, “isn’t okay.”\n\n\n“I know.” Stiles dropped his eyes and tried to shift away from the warmth of Peter so close to him. \n\n\n“Why don’t you say something?” \n\n\nStiles jerked away fully and glared. “You think I haven’t? \n\nMe?\n\n I’ve complained until I’ve gone blue in the face, Peter! I’ve talked until their ears bled and each time they’ve just… You really think I would just let it happen without standing my ground?” \n\n\n“It’s still happening! I don’t know how you’re even functioning with how much pain you’re in, Stiles.” \n\n\n“Why, because I’m a weak human? A little pain isn’t going to stop me!” \n\n\nPeter exhaled harshly through his nose and waved his hand in an unclear gesture of frustration. “That’s not what-- look, Stiles, I’m not trying to start an argument here. I’m just saying that you shouldn’t have to deal with this. Them being werewolves is not an excuse for them to treat you like this.” \n\n\nStiles swallowed harshly and tried to detect a lie in Peter’s words. He hadn’t expected the older Hale to be the one to come to his defense. Not because he thought little of Peter, but because he’d stopped hoping for anyone doing anything a long time ago. He gave up on anyone caring about his pain level since well before Peter managed to claw his way back int he world of the living. The acceptance of his fate had only been reinforced the night Stiles had been kidnapped and beaten and no one cared enough to help him drive home. \n\n\nAnd now Peter was here… the previously insane coma patient was the only one to stop and drain his pain. Not his best friend or his other friends. No, it was a man he’d just truly met a couple months ago. A man that treated him like an equal and kept looking at him like he deserved so much better. \n\n\n“It may not be an excuse, but they don’t seem like they’d be stopping any time soon, do they?” Stiles glared at Peter in some form of challenge that he didn’t understand himself. \n\n\nPeter growled and something in Stiles unclenched at the sound. He wasn’t sure why, and he thought that he should probably be very concerned about that, but he was still a bit loopy from the pain drain. “Come on, Stiles. We can do the research at your house. Derek’s going to be in a pissy mood all night now anyway.” \n\n\nStiles grinned and turned back around to get into his Jeep. Looked like he got to avoid the rest of the Pack for another few hours at least. Until one of them came climbing through his window demanding something or other. Perhaps Peter would throw them out if they did that. \n\n \n\nHe looked away from the notes in front of him and grabbed the bottle of Advil on his desk. It’d been a few hours, probably, he was due for some more pain relief. Ever since Peter drained the pain away from him yesterday it’s like the pain gotten even worse. Like he was reminded of how a normal person feels on a regular day and now he can’t unsee it. He’d be mad at Peter if he wasn’t so grateful for even those few short hours of relief. \n\n\nHe shook a couple pills into his hand and was about to pop them into his mouth when a warm hand plucked the two tablets away from his fingers. “Should I be concerned about how much of this stuff you take?” Peter asked. \n\n\nStiles huffed in annoyance and went to shake out a couple more from the bottle. It was almost empty, he’d need to replace it soon. “Fuck off, Peter. Would you rather me be in pain for the rest of the day?” He didn't even have school to distract him today since the pipes in the boys’ restroom at the high school had exploded. They had the day off, which of course meant that Stiles was to spend it all finding a way to stop the harpies from terrorizing the preserve. \n\n\nStiles rubbed at a new bruise on his sternum from where Derek had smacked him when he’d complained about not getting to use his day off like the rest of the Pack. Stiles wondered where Derek was now. Was he getting the day off? Was it just Stiles that had to work today? \n\n\nPeter’s fingers crept over the skin of his throat and just passed the collar of his t-shirt. A moment later Stiles felt the pain once again draining out of him. He hummed in relief and appreciation. “Fuck, Peter, you’re going to get me addicted to this.” \n\n\nPeter’s tone was flat as he replied, “I’d rather you be addicted to me for different reasons, sweet boy.” \n\n\nStiles was too tired to admonish the man for his creep factor. The man had already shown that he would back off if Stiles said no, so he wasn’t overly concerned. Besides, Peter was the only one that had shown any amount of concern, so what if he took Peter up on that offer. \n\n\n“Will you show me?” Peter asked after several long minutes of Stiles relaxing into the cloud of non-feeling. \n\n\nStiles dopily rolled his head over to look up at Peter and just asked, “You want to see? Really?” \n\n\nPeter grimaced and nodded, “I can tell it’s bad from how much pain I’m taking, but I need to see it.” \n\n\nStiles pondered the request and found no small amount of satisfaction in the idea of someone finally seeing what he had to put up with. Someone who would actually care at least. So after a long moment of consideration that was really more just Stiles killing time before he had to force his muscles into action, Stiles shakily stood up. Peter helped him keep his balance as he swung his shirt up and over his head displaying mottled bruising over his ribs and chest. His left shoulder was a mass of darkness and there was a distinctly raised redness to both his unwrapped wrists. He knew he was a mess, but he’d gotten used to seeing it all in the mirror every day. \n\n\nPeter hadn’t. For obvious reasons. And Stiles smirked with validation when Peter let out a small gasp of surprise or horror or something. A shaking hand came up to run down his chest and over his abused ribs and Stiles watched Peter’s veins turn black once again. How was there even more pain to take? He couldn’t feel a damn thing anymore. “How does that even work? The pain drain thing?” Stiles asked quietly, more to himself than to Peter. \n\n\n“Stiles,” Peter said. Nothing else followed though and Stiles squinted at Peter in confusion. \n\n\n“Yes?” \n\n\nPeter ran the back of his hand over Stiles’ throat and down the sides of his shoulders. Stiles wasn’t an idiot and recognized the blatant scent marking. It had been a while since anyone in the Pack had even bothered to do it. The sensation of skin on skin and the idea of being wanted made Stiles relax even further. If he was a werewolf he probably would have been growl purring. \n\n\nThat calmness dissipated almost immediately as Peter’s eyes drilled into his. “What?” Stiles asked, words coming out a bit slurred. Damn that pain drain was better than a double dose of Adderal. \n\n\n“If they actually cared about you this wouldn’t be happening.” \n\n\nStiles flinched away from Peter at the words but the werewolf kept his hands light and gentle on Stiles’ skin. Stiles allowed himself to be pulled into Peter’s chest and the embrace that awaited him. \n\n\n“Does that mean you do?” Stiles asked. \n\n\n“You’re the only person in this forsaken hell that’s worth my time, Stiles.” Peter nuzzled his nose into the area between shoulder and throat and Stiles melted even further into the hug. “They take you for granted and it drives me insane.” \n\n\n“Maybe not a joke you of all people should be making, Peter,” Stiles reprimanded. \n\n\nPeter snorted and replied, “Or maybe I’m just the one to do it. I’ve had experience after all. Watching you with them is maddening. You deserve so much better.” \n\n\n“Yeah, well I deserved a childhood too and I didn’t get that. I think I’d be suspicious if the world suddenly started to give me things.” \n\n\nThe conversation was cut short as Stiles’ phone rang obnoxiously. He flailed out of Peter’s grip in both surprise and his normal amount of overenthusiasm and clumsiness. He answered the phone with a quick flick of the right icon and said, “Stiles here, wh--” \n\n\nDerek started shouting from the other end of the line about harpies and Stiles screwed his eyes shut against the waves of frustration that went rolling through him. Stiles didn’t even react when Peter snatched the phone from his hand and started to talk to Derek in clipped tones. He didn’t bother to listen either. He just slumped back into his chair and rested his head on his arms on his desk. He simply basked in his pain-free existence and cherished his easy breathing. \n\n \n\nStiles tapped his foot impatiently as he waited for Derek to pick up the phone. He’d finally found what they needed to fight the harpies without the Pack being torn to shreds. The problem was after all, not the killing of the harpies, but the not being killed by the harpies part. Peter had been the one to find the article in one of his many secret books, but it had been Stiles who’d managed to translate it. He was feeling rather accomplished, but Derek and the others wouldn’t answer their damn phones. \n\n\nHe hummed in thanks when Peter’s hand slipped under his t-shirt once again, for the fourth time that day, to drain any returning pain from him. “Is it time for us to swoop in and save their poor pathetic lives?” Peter asked after Stiles got Derek’s voicemail for the third time. \n\n\n“Almost undoubtedly.” Stiles sighed and leaned into Peter’s side as he stood up. “They would crash and burn without us.” \n\n\n“Maybe they should.” \n\n\nStiles looked up sharply at Peter in surprise. “What?” \n\n\nPeter shrugged carefully so as to not jar Stiles as he replied, “You really think they’ll start treating you any differently any time soon?” \n\n\n“Well, no probably not--” \n\n\n“And how long are you going to put up with it? With this?” Peter gestured at Stiles and then at the desk of research and the empty bottle of Advil. \n\n\n“What else am I going to do?” Stiles asked in genuine confusion. Yeah, the Pack may not treat him the best, he wasn’t a fool, he knew he was being abused, but what else would he do? \n\n\n“You want to go to college, yeah? Princeton if I’m remembering correctly?” \n\n\n“Yeah, but with the Pack and everything I don’t know if I should.” \n\n\n“Oh, you should. I’d recommend getting out of Beacon Hills as fast as possible and never coming back. Especially to get away from this pack.” \n\n\n“I thought you said they weren’t a pack?” \n\n\n“They’re not. They have no idea what Pack entails.” \n\n\n“And you do?” \n\n\nPeter pulled back from Stiles to look him in the eye. “I know what Pack is, Stiles, and it’s not this. I know what family is and it’s most certainly not this. I also know what being taken advantage of is like, and if you’re not careful you’ll end up like me.” \n\n\n“Like you?” \n\n\n“Used and abused to the point of apathy.” \n\n\n“I thought you cared about me?” \n\n\n“I do. Why do you think I’m still here in Beacon Hills?” \n\n\nStiles paused and studied the wolf in front of him. The only wolf that had noticed his pain and taken steps to alleviate it. The only man who treated him gently without babying him. Peter respected his ideas and his mind while also respecting his body’s limitations. But Peter had only noticed a couple days ago. He and Scott had been friends for their entire lives. How could he turn away from his brother all because Peter was showing him kindness? \n\n\n“I don’t need--” \n\n\n“I’d take you away from here in a heartbeat. All you have to do is ask.” \n\n\nStiles swallowed with difficulty and tried to ignore the way his heart stuttered at the words. He couldn’t just leave… could he? “We’d better get going. We don’t want to have to clean up werewolf bits out of the preserve after all.” Stiles carefully stepped back and away from Peter.\n\n \n\nStiles watched in detachment as the Pack around him shredded the harpies with gusto. Turned out harpies were weakened by continuous loud noise. It made them go batty. So here they all were, with a giant boombox blaring electro music right next to Stiles, and the wolves taking out shrieking and crippled harpies left and right. \n\n\nStiles hummed along to the music and tried to stand in a position that didn’t put unneeded pressure on his ribs. The pain drain was amazing but it didn’t last long. He was starting to feel his bruises again. \n\n\nHe breathed deeply and ignored the pain that lanced through his ribs and made his lungs spasm. They’d feel better in a few days, nothing to worry about. He ignored the reality that he would be covered in new bruises by the time his current ones faded.\n\n\nStiles ducked on instinct as a mostly dead harpy was tossed in his direction, very nearly slamming into his face. He scowled over at Erica even as he gasped for breath as the movement jarred every ache and pain in his body. The blonde had merely grinned unabashedly and returned to the fight. He’d chew her out for it later when she could actually hear him.\n\n\nStanding there, uselessly, he was beginning to feel the long hours of the past few days. He just wanted to sleep. Maybe get some more Advil on the way home if Peter wasn’t willing to keep draining his pain away. It’d only been a couple days and he was already getting hooked on the lack of pain. Maybe that was Peter’s plan? Seemed unlikely.\n\n\nStiles didn’t even notice Erica approaching him from the side with a mischievous look in her eye, at least not until the last minute. He belatedly noticed her sprinting toward his side and he tried to brace himself for the impact of the tackle knowing it would hurt like hell. He’d told her multiple times that her roughhousing habits should be kept to the other weres, but she never seemed to get what he was saying. Or she was just ignoring it.\n\n\nA body stepped between him and the approaching wolf at the last minute, and Erica flailed as she tried to backpedal away from Peter’s wall of muscle. She only partially succeeded, managing to crash past him but receiving an elbow to her side on her way. \n\n\nShe cradled her side and bared her teeth at Peter. Fortunately, the brewing fight between the two of them was cut off by a harpy attacking and distracting her. Stiles sighed in relief and turned back to Peter with a thankful grin. It quickly dissipated at the obvious anger in Peter’s eyes. “Peter?” he asked uncertainly. \n\n\nUnnerving blue eyes jerked over to him and Stiles swallowed at the intensity of the gaze. Some of the anger leaked away from Peter however as the man lifted a hand to gently cup Stiles’ shoulder. “You okay?” he asked, eyes darting away from Stiles only to keep check on the battle around them. \n\n\n“Of course.” \n\n\nPeter eyed him doubtfully but turned to continue the fight after a quick scan of Stiles for injuries. \n\n\nOnce the fight was done Scott and Boyd both landed hard punches to Stiles’ shoulder in thanks and congratulations. A simple action that Stiles had asked them not to do multiple times. He bit his lip as his entire body jarred with the contact. Peter was there a second later, growling at Scott and preventing Erica from landing her own smack on his body. Peter escorted him to his Jeep, careful to keep himself between Stiles and the others. Stiles just smiled and thought to himself that he could get used to this. Maybe with Peter here, things wouldn’t be so bad. \n\n \n\nSix months later…\n\n\nStiles hissed in pain as he tried to sit in his Jeep without pulling at the new stitches in his leg. A training accident gone wrong left Stiles needing stitches and Scott with his kicked puppy expression. \n\n\nStiles was done. It wasn’t the first time Scott had wounded him after being distracted by Allison or Derek or a passing butterfly. Peter hadn’t been there to stop it from happening. He hadn’t even been around to help him get to the hospital. Stiles had to drive himself to the emergency room after Derek claimed he couldn’t leave the others just to drive him. \n\n\nPeter was out of town on an assignment from Derek to visit some witches a few counties over. Derek had been sending Peter on a lot of assignments recently, any excuse to send his uncle away really. Stiles didn’t like it. \n\n\nStiles and Peter had grown closer over the months since the harpy incident. Peter helped keep Stiles safe and he didn’t care if Stiles rambled, he actually liked talking to Stiles. They debated everything from the supernatural to tv show plots. Peter and Stiles cooked most meals together now and Stiles was the only one of the Pack to know where the man lived. He even had his own key. \n\n\nSo he wasn’t happy that Peter was being so clearly ostracized. \n\n\nHe wasn’t happy that he himself was clearly becoming the Pack’s favorite punching bag again either. \n\n\nHe wasn’t happy. Period. \n\n\nStiles drove over to Peter’s apartment instead of home. He didn’t want to have to deal with his dad ignoring his injuries again, and he missed Peter. It only seemed natural to let himself in and start making dinner. The Hale should be getting back in soon, and he had news to share with him. The thick envelope was burning a hole in his pocket. Hopefully, he didn’t get too much blood on it. \n\n\nThe chicken was nearly done when Stiles heard Peter’s key in the lock. A moment later he had an armful of warm werewolf and was being intently scent marked. “You’re bleeding? What happened?” Peter growled out. Stiles could see the flash of too blue eyes and he smiled at Peter’s obvious protectiveness. \n\n\n“Twelve stitches in my thigh,” Stiles said with a grimace. Peter’s hand immediately found its way under Stiles shirt and just under the belt line of his pants. Stiles smiled in relief as the pain began fading away leaving him pleasantly cool and light headed. “I made dinner for you.” \n\n\nPeter growled and picked Stiles up by the hips and placed him carefully on the counter behind them. “You shouldn’t be standing on this leg, Stiles.” \n\n\nStiles felt something warm unfold in his gut, in a way he was getting very familiar with, and he rubbed his cheek against Peter’s in silent thanks. \n\n\n“What happened this time?” Peter asked after a few more moments of them taking each other in. Peter sounded resigned and angry and tired. Much like Stiles himself did. \n\n\n“Scott.” Stiles didn’t bother with the whole story because it was just the same as all the times before. Scott insisted on doing something even after Stiles said no. Stiles suffering for his friend’s adamancy. Story of his life. \n\n\nStiles hid a smile in Peter’s neck and pushed on the man’s shoulders, urging him to back up a bit. “Come on, get the plates out. Dinner’s ready and I have a surprise for you.” \n\n\nPeter obligingly backed up, as he always did, but scowled at Stiles. “Scott doesn’t--” \n\n\nStiles shook his head and pointed at the cabinet, a silent order. Peter shut his mouth and his eyes flashed but he did as he was told. Stiles just hummed quietly as he brought the food to the table. They were soon chatting about witches and covens while eating chicken, Stiles’ injuries not forgotten but on the side of their attention. Peter’s hand lay possessively over Stiles’ uninjured thigh in a wordless comfort. \n\n\nStiles leaned back as he finished his plate and looked at Peter. The wolf had been nothing but loyal for the last half a year. He’d had his back the entire time. Sure, the man was cocky and mocking at times and he never backed down from a fight, but he also never pressured Stiles. Never made him feel like he wasn’t important or not valued. Peter treated him the way he deserved. \n\n\nStiles felt nothing but relief and lightness as he pulled the crumpled up letter from his back pocket and wordlessly handed it over to Peter. He’d just gotten it in the mail earlier today. \n\n\nPeter scanned the papers and Stiles watched as comprehension slowly seeped in. Peter looked up with a shocked and proud and anxious expression. “I didn’t know you applied for early admission.” \n\n\nStiles smiled wide and winked, “I didn’t tell you. Didn’t want you to get your hopes up after all.” \n\n\n“My hopes?” Peter looked like he couldn’t comprehend what had been handed to him. \n\n\n“Well, I was thinking… I want you to take me out of here. If we stay any longer…” Stiles trailed off because they both knew what could happen. What would \n\neventually\n\n happen. They’d either die or get stuck indefinitely. Stiles cleared his throat and repeated, “Take me away, Peter. Take me as far away from Beacon Hills as we can get.” \n\n\n“Jersey’s a good start for that,” Peter said with a near-manic grin spreading across his face. He sobered in a moment. “Are you sure, Stiles? I would stay for you. I’d never leave you, if you’re doing this for me--” \n\n\n“I’m doing it for me. And you. I’m doing it because you were right and there’s nothing for me here. Or at least, there won’t be if you come with me.” \n\n\n“There’s nowhere I’d rather be, sweet boy.” \n\n\n\n\n\nPeter whistled to himself as he skipped up the last few steps that led to the entrance to Derek’s bereft loft. He couldn’t tamp down on the glee furling through every cell of his body, not that he wanted to.\nHe pushed the door open with a quick flick of his wrist and strolled into the living room area with confidence and a dramatic flair that he loved. The unruly pack was already there and congregated around the small coffee table and mismatched couches. They all looked up at him with disgust and annoyance and Peter’s satisfaction swelled even higher. Oh, this was gonna be good.\n“Afternoon you miserable teenagers,” Peter greeted with a smarmy grin and a wave. He made his way around the edges of the room, careful to keep his back to the walls as he moved.\n“Just sit down,” Derek snapped. His eyes were already back on the door as if he could will Stiles into being. “Did you give Stiles a ride here?”\nPeter rolled his eyes and didn’t try to hide his sneer. “No, dear nephew, I didn’t. Because Stiles won’t be coming tonight.” Peter paused and waited for everyone to look at him again before he added, “Or ever again.”\nScott’s face crumpled up in an unattractive expression of confusion and bewilderment. “What do you mean? Did he get grounded for life again? Because his dad always says stuff like that but he always gives in in the end. Stiles drives his dad insane when he’s home all the time.”\nDerek’s eyebrows converged together in one of his trademark constipated and irritated expressions. “I don’t care if he’s grounded, he needs to be here. Pack meetings are important.”\n“Indeed they are. They allow us to come together and share life-altering information. Like this: Stiles is leaving Beacon Hills.” Peter rolled back onto his heels as he practically hopped in place in his excitement. These pathetic children had hurt Stiles an uncountable amount of times, and if he had anything to do with it they would never touch him again. He was so proud of his boy for the decision to leave. It pained him to imagine Stiles wasting away in this cesspool of a town. He had too much potential and spirit.\n“Sit down Peter and stop being so over dramatic. Your reluctant villain act got old the first week you came back from the dead,” Lydia drawled. Her voice was dismissive but he could see the sharpness to her gaze as she studied him. She was perhaps the only one who would know what they were losing if Stiles left. She was, of the entire pack, the one Peter held the least against. She was an amazing young woman who had merely gotten involved with the wrong people. Just like Stiles. Stiles, however, was treated as badly as Lydia was treated well. The beauty guru could do nothing wrong in the eyes of the Pack, while Stiles could barely get through a day without being threatened.\n“I’m not staying,” Peter replied affably.\n“Damn it, Peter, go get Stiles and bring him here. We’ve got another pixie problem in town and we need the research he did a couple months ago on them.”\n“I do believe he gave you the research, so you don’t need him.”\nScott piped in, “We don’t know where we put it, but it’s fine because Stiles can just print out another copy or do it again or whatever. He won’t mind.”\nPeter couldn’t understand how simply stupid the boy Alpha was. “He won’t mind you say. You do realize Stiles spends hours collaborating with me and online sources, and sometimes Deaton or close by witches, to create those profile for you guys, right? He cross-references everything, indices the different approaches, creates pros and cons lists, and tries to dumb it all down enough for you to understand. He spends  hours  doing that, all for you to just lose it? You couldn’t just put it in a fucking folder? You couldn’t just email it to yourself?”\n“Stiles has them in folders, Peter. That’s his job,” Erica said.\n“Stiles--” Peter broke off and shook his head. This isn’t why he was there. “See this is why we’re leaving. Consider your self lucky that he told me to come here and tell you before we just disappeared.”\nLydia flinched at the words but she was the only one who took the words seriously. Scott and Derek just look irritated and angry and the betas were confused.\n“Where are you going?” Lydia asked after a long pause.\n“Oh, please, Lyds. Stiles wouldn’t just up and leave us,” Scott dismissed the idea with a wave of his hand and a glare at Peter. “Whatever game you’re playing leave us out of it, okay?” Scott pulled his phone out of his pocket and pulled up Stiles’ contact. The picture was of a smiling Stiles from two years ago.\nDerek stood up as Scott made the call and crossed his arms to glower at his uncle. “What are you up to? What are you doing to Stiles?”\n“What am I doing to Stiles?” Peter asked in disbelief. “I’m giving him a ride across the country. I’m helping him get away from your abusive pack and dismissive actions.”\n“Stiles is part of our Pack, he can’t just leave!” Jackson said. He quieted when Lydia put a warning hand on his thigh, but he looked mutinous.\n“Stiles hasn’t been a part of this pack for a long time, if he ever was,” Peter said.\n“Stiles is my best friend!” Scott shouted as he looked down at his phone in confusion. Clearly, his ‘best friend’ hadn’t deigned to answer the phone. Peter figured it must sting to be on the receiving end of that treatment for the first time. The irony made him smile with malicious glee.\n“What did you do to Stiles? He wouldn’t just decide to run away with you of all people. We’re his friends!” Allison interjected. She was trying to console her boyfriend as he stared despondently down at his phone.\nPeter had an iron control over his shift but his gums itched slightly with the urge to rip into the people in front of him. How dare they? “Stiles was nothing but a means to an end to you all. He’s been in constant pain from your abuse since this goddamn Pack was started.”\n“Stiles is fine!” Erica insisted.\n“He’s fine, huh?” Peter crossed his arms and aimed a hard glare at the girl and was pleased to watch her shrink into herself under its pressure. “Then tell me why his doctor is so concerned about Stiles’ joints... the way the ligaments of his wrists and elbows and shoulders are all dangerously loose and leaving him vulnerable to dislocation or subluxation. Tell me why Stiles’ oxygen intake is lower than average because of the constant bruising around his ribs and chest. Tell me why Stiles has had to get 57 stitches for various wounds in the last six months. If Stiles is fine then why would he need me to drain his pain every goddamn day? If Stiles was  fine  then why would he be so eager to escape you all?”\nLydia had paled during his small speech and he watched her gaze turn to Derek and Scott and couldn’t help but wonder what she was thinking. She didn’t reach out to her friend either, so she was just as much to blame for Stiles’ continued pain as the wolvess in his opinion. But he knew Stiles had a soft spot for her.\n“Stiles never said anyt--” Isaac started to say.\n“Bullshit!” Peter interrupted. “He was always asking you guys to lay off him. Told you that you were hurting him. Even if he hadn’t vocalized it you should have noticed the way he wears wrist braces and leg wraps. How he’s constantly icing his sides and struggles to breathe. You should have seen the bruises and the pain and the misery that was drowning your  friend .” Peter had to take a step back before he tried to take a swipe at his nephew or the infuriating McCall kid. Stiles deserved so much better.\n“Peter, we need to talk to Stiles,” Derek said with a serious expression. When Peter didn’t reply Derek growled and flashed his alpha red eyes at him. Peter just scoffed and looked away. “Peter, if Stiles thinks we mistreated him then he should be talking to us not hiding away.”\n“Stiles has never hidden from anything,” Peter defended. Stiles was strong and brave and had looked down the barrel of a gun or the claws of lethal monsters with no hesitation. His boy was anything but weak despite how easily his skin bruised or his joints popped.\n“This is immature!” Allison exclaimed. “If Stiles has a problem with us then he should have come here himself.”\n“So you could all drag him around and berate his every decision? He gets that enough on a regular day, thank you.”\nDerek growled again and shoved Peter’s shoulder hard enough to push it into the wall behind him. Peter just smirked and scowled and snapped, “Exactly, Derek. Have you seen Stiles’ shoulder after every time you do that to him?”\nDerek paused and looked chastened for a second before the expression twisted into one of frustration and defensiveness. “I’m his Alpha. He should listen to me the first time and I wouldn’t need to.”\n“Victim blaming, really Derek?” Lydia spat. She looked furious.\n“I would have thought that with everything Kate had done, you wouldn’t sink to such levels, dear nephew.” Peter knew the words would hurt and he craved it. “You never were one to learn from your mistakes.” Derek deserved to stew in his regrets after painting Stiles black and blue and making the human doubt his intelligence and morality. Peter wouldn’t stand any more insults or assumptions being thrown in Stiles’ direction.\nDerek reeled back from Peter as if the man had hit him. Red eyes flashed and Peter saw his nephew’s teeth elongate and sharpen as the young Hale lost control once again. Derek had never been particularly good at control. Peter had tried to help at times but Derek wouldn’t listen.\nPeter took several steps away from Derek and closer to the door he’d come in through at the beginning. “As fun as this has been, children. I’m due back by now.”\nScott asked, “Where are you going? Where is Stiles going?” The kid looked devastated and angry and a million other emotions that exhausted Peter to just look at. If the young alpha wanted sympathy or pity from Peter he wouldn’t find any.\n“If he wanted you to know, you’d know.” Peter only paused for a short moment before the door. He turned to look at Lydia and said, “He’ll be texting you and you alone his number. It should only be used to inform him of changes to his father’s health should something happen or other emergencies. I trust you won’t be giving the number out to your overbearing friends?”\nLydia’s thick lips were pressed together in annoyance and undoubtedly barely restrained words, but she nodded once and that’s all Peter needed. He hopped down the stairs from the loft for the last time and strode over to his car. He could hear Scott and Derek coming out of the house behind him and he didn’t hesitate to peel out and away from the building. Away from the useless Pack that took Stiles for granted. They wouldn’t be able to hurt his boy any longer.\n \nSix months later…\nPeter glared at the offending piece of technology that was dragging him out from sleep. He really needed to get Stiles to change the ringtone to something less abrasive. Stiles was, of course, sleeping directly through the racket of his phone. Peter sighed and rolled over to grab the thing, with all intentions of throwing it at Stiles. He paused when he saw the number on display, however.\nHe scowled and declined the call, rolling out of bed as he did so. He knew they’d call back. Stiles moved drowsily after him grabbing weakly at Peter’s hand. “Where you goin’, Peter?” he slurred out, very obviously mostly still asleep.\nPeter bit his lip to stop the soppy smile he could feel coming, and leaned down to place a quick kiss to Stiles’ forehead. “Client’s calling. I’ll be back in a few minutes, sweetness. Okay?”\nStiles pouted with his eyes closed but let go of Peter’s arm and let the werewolf exit the bedroom. Peter was barely down the hall when the phone rang again. He angrily accepted the call and said, “Whatever you want, it’s a no.”\nThere was a long pause on the other end of the line before Scott said, “Let me talk to Stiles, Peter.”\n“Just as demanding as always then, McCall?” Peter sighed and ran a hand over his face and walked further away from the bedroom, not wanting to wake Stiles. His boy didn’t need to know this call was happening in any sense.\n“Look, we need Stiles back okay? We get it, we weren’t good enough to him but it’s time he came back.” Scott sounded exhausted and more than a little panicked.\n“And what makes you think Stiles will want to?”\n“What?” There was the rustling of movement on the other end of the line. “Of course he wants to come back. Just put him on the line.”\n“No.” Peter rolled his eyes when he heard Scott huff in annoyance and indignation. He glanced down at the screen when Stiles’ text notification sound went off.\n&gt;&gt;From Lydia 2:04 a.m.\nDerek threatened my dog if I didn’t give up this number. I think it’s high time you tell them all to fuck off or neither of us is going to be left in peace.\nGood luck. Love you. &lt;&lt;\nPeter smiled genuinely and fondly at the text. Lydia and Stiles were much better friends when there was an entire country between them. She’d been helpful in warding off any attempts of the Pack trying to find the two of them.\n“Peter?” Scott asked, clearly having been talking while Peter was distracted with Lydia’s text. “Where’s Stiles?”\n“He’s asleep in my bed if you must know. Where he should be.”\n“Damn it, Peter, give the phone to Stiles, we need him!”\n“That’s all well and good, McCall, but he doesn’t need you.”\nThere was some loud scrambling and yelling from Scott’s side and Peter held the phone further from his face and glared at it as if the boy could feel it through the cellular connection. When the noise died down Peter tentatively brought it closer once again.\n“Peter?” Derek’s voice was quiet but determined.\n“Nephew, what a surprise,” Peter replied drily. He was honestly surprised Lydia had managed to keep Stiles’ number a secret for this long. He knew the Pack would come begging for Stiles to come back because they were a mess without him. There was no way in hell Peter was going to allow that though.\n“Look, Peter, listen to me. Stiles  needs  to come back. No one else can handle Scott like he can and Allison is gone again to France and Isaac is acting up. Erica’s been pouting since he left and Lydia won’t do half of what Stiles did for us. We can’t keep going like this.” It was the most Peter had heard Derek say in one breath in years. Peter listened as Derek took in a comically audible deep breath before continuing. “The loft is a mess and half of the information we come by isn’t true and Deaton is being a mysterious ass hole that won’t give anyone but Scott a straight answer. Stiles needs to come back and do his part. He owes us that much.”\nPeter, who had been listening in relative disinterest, snarled at those last five words. “Stiles  owes  you  nothing . He ran your pack for you and did everything you asked and he got nothing for it.”\n“That’s what Pack is for! We’re supposed to support each other no matter what!”\n“And what part of the abuse Stiles suffered was you supporting him?”\n“We didn’t know what we were doing!”\n“Maybe at one time you didn’t. But he waited for months for you to get better. Stiles gave all of you chance after chance, opportunities that you in no way deserved, to fix it. But you didn’t and Stiles left because it was the only option left to him.”\n“But we need him, Peter! He has a responsibility to us!”\n“Maybe he did at one time, but you gave that up when you turned away from your own responsibility of taking care of him.”\n“You can’t really think that Stiles won’t want to return to Beacon Hills?”\n“Oh, I know he doesn’t. Stiles is doing well here. He’s thriving in every way he couldn’t when he was back in your pitiful excuse of a puppy pack. People here don’t take advantage of him or berate him for being himself. He can talk without fear of rebuke and he gets to use his time as he wants to, not the way you decree it. Stiles is  happy  without you. He’s happy  because  you guys aren’t here.”\nPeter relished in the defeat that the following silence was saturated in. It was high time those bastards had to live with the consequences of their actions.\nWhen Derek spoke next it was with a stark coldness, “So what do you get out of this Peter? How much will it take to get you to bring him home?”\nPeter was silent for a long moment as he stewed in his disbelief. Derek took his silence as a confession and he pushed on. “Look, I get that you’re trying to get back at me for everything but this is ridiculous. So whatever, I cave. What do you  want ?”\nPeter couldn’t believe the audacity of this mongrel. There were so many things he could say right now, so many answers he could demand. He could tell Derek that if he wanted to ‘get back at him’ he would already be dead. Or perhaps he could play along and see just what Derek would be willing to do before brutally turning him down. Instead, he went with the one thing he thought might actually get through to his nephew. “How could you possibly think that this is about you?”\nPeter rubbed at his temple during the answering silence. This was exhausting and the vindictive joy he’d gotten from the beginning of the conversation had grown old. “This isn’t about you, Derek. Or Scott the beloved True Alpha. This is about Stiles not needing or wanting you in his life. He’s moved on, nephew. I suggest you do the same.” Peter didn’t wait for a response, he just curled his fist into the phone and cracked the fragile piece of tech into pieces. Stiles would need a new number anyway now that the cat was out of Lydia’s bag.\nPeter made a mental note to buy Stiles a new phone in the morning, but for now, he just let the jagged pieces of metal and plastic and glass to fall around his feet. He carefully stepped around it and trodded back down the hallway and into the bedroom.\nStiles was staring at him in the dark and Peter winced. Apparently, he hadn’t been quiet enough. A small part of Peter was still terrified that Stiles would pack it all up and decide to return home. He would follow his boy back and try his best to continue protecting him, but he hated the very thought of it.\nStiles just gave Peter a slow sleepy smile and made grabby hands towards the werewolf. Peter scoffed but obligingly made his way over to the bed and laid down, pulling Stiles into his chest as he did so.\n“You broke my phone didn’t you, you bastard?” Stiles said after a few minutes of content snuggling and silence.\nPeter smiled and rubbed a hand up and down Stiles’ spine. Out of an old but hard to forget habit he tried to draw the pain from Stiles’ body but could find none. He smiled even wider and peppered Stiles’ face with gentle kisses. He was so goddamn thankful for this boy who didn’t begrudge him his acerbic wit or his tendency for malevolence. Stiles appreciated who he was as a person and never demanded things from him like everyone in his life before Stiles had.\nFor that Peter would step between Stiles and any danger that manifested, including the Pack in Beacon Hills. They thought they were entitled to beautiful genius Stiles. Peter would be sure to remind them time and time again that Stiles had moved on to bigger and better things.\n“I’ll buy you a new one, sweet boy.”\n“You better, old man.”\n“In the morning. Go to sleep you little monster.”"
}