{
    "id": "16435904",
    "url": "https://archiveofourown.org/works/16435904?view_full_work=true",
    "author": [
        "dirgewithoutmusic"
    ],
    "title": "yer a wizard, dudley",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "Major Character Death"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Dudley Dursley & Piers Polkiss",
        "Dudley Dursley & Nymphadora Tonks",
        "Dudley Dursley & Percy Weasley",
        "Dudley Dursley & Hagrid"
    ],
    "characters": [
        "Dudley Dursley",
        "Harry Potter",
        "Minerva McGonagall",
        "Nymphadora Tonks",
        "Filius Flitwick",
        "Moaning Myrtle",
        "Penelope Clearwater",
        "Cedric Diggory",
        "Cho Chang",
        "Rubeus Hagrid"
    ],
    "additional_tags": [
        "Dudley goes to Hogwarts",
        "I don't know why I did it either folks",
        "Minerva McGonagall and all the things she doesn't say"
    ],
    "language": "English",
    "series": "Part 16 of boy with a scar",
    "published": "2018-10-28",
    "completed": null,
    "words": "21,860",
    "chapters": "1/1",
    "comments": "772",
    "kudos": "14,190",
    "bookmarks": "2,530",
    "hits": "130,679",
    "summary": "<p>Harry Potter spent his eleventh birthday in a cabin on a tiny rock in the middle of the sea, listening to his cousin snore on the couch.</p>\n<p>When a knock sounded on the wind-swept, rain-drenched door, it was not a giant fist (or a half-giant's fist). It was a short sharp rap that sounded once, twice, three times before Minerva McGonagall simply charmed the lock open and stepped inside.</p>\n<p>\"Apologies,\" Minerva said crisply, as Vernon raced out brandishing his rifle and Petunia pulled Dudley up off the couch and behind her. \"I wasn't sure you could hear me over the weather.” The rain fell down behind the professor in a roar. She was perfectly dry.</p>\n<p>Minerva fished in her pocket without looking, because the only things allowed in her pockets were only ever exactly what she needed. “I've come to deliver this,\" she said, pulling out a letter and handing it to Harry, who was cross-legged on the floor, \"because our owl post seems to have been unable to get through.”</p>\n<p>“And I've come to deliver this,\" she added, pulling out a second letter, \"because Hogwarts by-laws require a professor to hand-deliver acceptance letters to Muggleborn families for their explanation and comfort.\"</p>",
    "notes": "<p>Various people have asked for Dudley The Wizard over the years, so here it is. I'm not quite sure /what/ it is, but it's here.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "1\nHarry Potter spent his eleventh birthday in a cabin on a tiny rock in the middle of the sea, listening to his cousin snore on the couch.\nWhen a knock sounded on the wind-swept, rain-drenched door, it was not a giant fist (or a half-giant's fist). It was a short sharp rap that sounded once, twice, three times before Minerva McGonagall simply charmed the lock open and stepped inside.\n\n\"Apologies,\" Minerva said crisply, as Vernon raced out brandishing his rifle and Petunia pulled Dudley up off the couch and behind her. \"I wasn't sure you could hear me over the weather.” The rain fell down behind the professor in a roar. She was perfectly dry.\nMinerva fished in her pocket without looking, because the only things allowed in her pockets were only ever exactly what she needed. “I've come to deliver this,\" she said, pulling out a letter and handing it to Harry, who was cross-legged on the floor, \"because our owl post seems to have been unable to get through.”\n“And I've come to deliver this,\" she added, pulling out a second letter, \"because Hogwarts by-laws require a professor to hand-deliver acceptance letters to Muggleborn families for their explanation and comfort.\"\n\nThe Dursleys did not look comforted, nor did they sound it once they opened their mouths. Dudley rubbed sleep from his eyes while Harry retreated to a corner out of everyone's reach to open his letter (finally) and read through it. When he looked up again, Uncle Vernon's rifle had turned into a rubber chicken and the professor was almost yelling.\n\n\"Your son has magic,\" Minerva snapped. She had just come from a little family of Muggle dentists, who had taken notes on everything she told them, and their bushy-haired daughter, who had stared up at her with big hungry eyes and asked questions at breakneck speed. After that, this was not just exhausting but almost insulting.  \"Whether or not you want him to be, Dudley is magic. If we do not teach him to handle it, it will still happen.\"\n\n\"I want to go,\" said Harry, very softly.\n\nMinerva couldn't decide whether to go softer or more fierce. \"Of course you will, Mr. Potter, if I have to escort you myself.\"\n\n\"We won't-- we won't allow--\" Vernon began to bluster, but Dudley was watching Harry's set face. His little eyes squinted.\n\n\"Dudley is not--\"\n\n\"If  Harry  gets to go,\" said Dudley at the top of his sizeable lungs.\n\n\"Dudley,\" Vernon snapped, so Dudley raised his voice even higher to announce, \"Then I do, too  .\"\n\n\"But Duddikins--\"\n\nDudley's face was going red. Harry moved quietly out of his radius and Minerva watched him go. \"It's not  fair  , you can't  stop me,  I'm not gonna sit and learn dumb  maths  while he does  magic--  \"\n\n\"Don't say that word!\"\n\n\"Neither  of you is going--\"\n\nDudley bellowed, no words, just sound, drowning out his parents. Harry watched the rain out the window. Minerva had known James Potter. She had known him well, in war and in peace, from behind a teacher’s desk and beside him in the trenches. This eleven year old looked very little like the grinning boy she'd so often scolded-- but he looked a bit like the young man she'd later had the privilege of fighting alongside.\n\nMcGonagall drew close to Petunia as Vernon tried to muffle Dudley's hollers with big hands and wheedling promises. \"Mrs. Dursley, you may not be aware, but every letter to the Hogwarts admissions office goes through me, and has for decades.\" Petunia's bony face snapped up to meet Minerva's eyes. \"Including those sent with stamps.\"\n\nPetunia was pale, her fists claws at her sides. \"Childish-- those were childish, absurd wishes--\"\n\n\"He is a child,\" said Minerva. \"He's magical. Let him have this.\"\n\nDudley took a breath and let out another bellow, kicking at his father's shin.\n\nMinerva tried not to wince. She tried to mean it. \"Let him have the chances you didn't.\" Petunia's gaze shifted away to the ground. Minerva reached out for the other woman's elbow, her bony fingers as gentle as she could force them to be, which wasn't very. \"Don't hate him for it, Ms. Dursley.\"\n\n\"I would never,\" Petunia snapped, raising her eyes in a swift, angry jerk, but Minerva had known Lily Evans, too.\n\nOnce Minerva had convinced Petunia and Dudley's caterwauling had convinced Vernon, she set up an appointment date and time to take them to Diagon Alley the next week and left them to their impromptu seaside vacation. She napped on their back porch in Animagus form the day they were meant to meet her, watching with a cat's focused patience as they piled into the car, snapping at each other. She'd sent them two follow-up reminders by the blandest owl she could lay her hands on.\n\nIn the Leaky Cauldron, Vernon cornered Minerva up against a table. She didn't move a step backward, achingly resisting returning to her schoolgirl ways and transforming him to a lizard.\n\n\"If you're not back from this-- this  Alley--  with Dudley within the hour, I'm calling Scotland Yard.\" He put his finger in Minerva's face, and he miraculously remained human-shaped. Sometimes Minerva impressed even herself. \"I have a direct line to one of their superiors. We provided the drills for their latest expansion, and I will not hesitate to call in favors.\" Then he stomped off to get himself a drink.\n\nMinerva raised her eyebrows at Raul, behind the bar, whose Head of House she had been for seven years, conveying quietly her expectation that any drink Vernon gulped down would have a generous dollop of frog spawn, and that Raul would charge him extra for it, too.\n\nDudley started gaping and didn't stop as she led the boys into Gringotts and changed some of Dudley's Muggle money for Knuts and Sickles. She watched his little beady eyes tick through an interested count of the little piles moving across the wood. A watery blue, they looked just like his father's in his pink, squashed face. Minerva apologized briskly to Grelda, the Gringotts receptionist who watched Dudley while Minerva took Harry to his parents' vault, and promised her some grateful banana bread at their next poker night.\n\nWhile they clattered through the darkness of Gringotts's underbelly, Minerva asked Harry about his hobbies, the latest books he'd read, and got brief answers-- he was more interested in staring over the edge of the cart, gaze chasing after a glimpse of dragon fire. She nodded and let the silence sit between them as they bounced and screeched toward the Potters's vault.\n\nWhen Harry climbed out of the cart, all knees and elbows, she followed, thinking about book lists and schedules, maybe a new set of clothes. The chill of the underground clung to her ankles. She twisted the key in her pocket.\n\nMinerva didn't expect it to matter to her, the piles of coins that appeared when the vault door wicked away into smoke. It was metal, dead and cold-- no, not dead, never even living. This was an errand run, like fetching her mail or a bottle of milk.\n\nBut Harry was standing there in his ratty hand-me-downs, and this had been left to him.\nGalleons glittered in the dim light. This had been Lily's, and James's, and Minerva remembered when they had been as small as the child hesitating before her, staring.\n\n\"I knew them.\" The words were fluttering behind the ridge of her teeth, and she didn't say them.\n\nHarry was eleven years old, just barely, and every child in the wizarding world knew his name. Only the tips of his fingers peeked out from the sagging sleeves of his sweater.\n\nMinerva didn't say, \"I took Lily from her family's house, with its greenish carpet, its lacey kitchen curtains, and big backyard. She wasn't much bigger than you, and I walked her down this street and picked out her books and her robes and her cauldron, and I never gave her back.\n\n\"You've got her eyes,\" she didn't say, \"but not the ones from back then, finding out magic was real for the first time. You've got her eyes from the end, from the last days. Not a single Evans came to her funeral, but I did.\"\n\n\"Well, Mr. Potter? We have a lot to do,\" she said instead, and helped him gather some fistfuls of Galleons into a pouch.\n\nAt the equipment shop, Harry looked like he might ask for a solid gold cauldron until Dudley shouldered past him and demanded one himself. At that, the smaller boy peeled away in disgust and found a pewter one. \"No,\" Minerva said to Dudley, and hauled him along by the shirtsleeve.\n\nDudley parroted his father's words about robes, but he ran his grubby fingers over every cloth in Madame Malkin's until Minerva made him sit. He wrinkled his nose at the smell of the Owl Emporium but ended up shrieking, rolling, and pounding his heels on the street when Minerva refused to buy him an owl.\n\n\"Apply to your parents,\" she told him sternly. She cast a Silencing Charm and sat with him, reviewing the shopping list, until he was done yelling.\n\nShe returned them in exactly sixty minutes. Dudley, sulking, went straight for his mother, towing his sack of new possessions behind him.\n\"I will see you all at Platform 9 and 3/4s at promptly 10:45 a.m. on September 1st.\"\n\n\"9 and 3/4s?\" Vernon scoffed. \"There's no such--\"\n\n\"It's approximately three quarters of the way between platforms 9 and 10. I will see you then,\" Minerva said and then went off to get a drink from Raul.\n\n-\n\nMinerva expected Harry to get Gryffindor. He was Lily's son, after all, and she had seen him stand in that shack with his chin high and tell her he wanted a brave new world. (It never occurred to her, and Harry never told her, that for that wanting the Hat had offered him Slytherin first.)\n\nIt was the Dursley boy she expected in green and silver. He was a pudgy, unformed larvae of a child. She'd seen him at age one, screaming for sweets, and then again at eleven, screaming to drown out his father's protests, and she didn't really see much difference other than size.\n\nThe Hat sat on Dudley's head for ages while the kid fidgeted and sweated. In the entryway, he'd stuck a finger through the Fat Friar's translucent robes and ignored Harry talking with a freckly redhead. Minerva wasn't sure exactly how she felt about Harry falling in automatically with a Weasley-- she was hoping this latest one turned out more like Bill or Percy, rather than the twins, but Harry was James's son. He and Ron already looked inseparable, huddled together in the waiting line of first years.\n\nDudley kicked his heels against the wooden stool, the Hat slipping down over his watery little eyes. The silence in the Hall was breaking to murmurs as the wait stretched on-- Minerva frowned. Was this shallow bully going to be a  Hat stall  ? Between what? Slytherin, and--? Merlin, please not  Gryffindor-- \n\n\"RAVENCLAW,\" the Hat announced and Minerva almost spat out her mouthful of pumpkin juice.\n\n-\n\nWhile Harry installed himself in the bunk next to Ron's, Dudley followed the other Ravenclaw first-years up to their tower, quiet on Penelope Clearwater's guiding heels, and wondered what he was doing there.\n\nThe staircases were moving, and the paintings-- what nonsense was that? Those of wit and learning-- what nonsense was  that  ? Dudley had liked the sound of Gryffindor. That's the sort of House his dad would have been in at school, the sort of stories he told when businessmen came over for his mother's roast-- what had dumb squeaky Harry done to get sent there?\n\nAnd couldn't someone have given that ugly cap a wash and some mending, or bought a new one? Did they de-lice it? It had spoken, when it dropped down over his eyes. It had laughed at him.\n\nDudley could almost see his mother, lifting her chin up at that weird bearded headmaster until he apologized and put Dudley in the right House. He could almost see his father, checking the plates in the dining hall for their provenances and calling them cheap. He could almost hear them--  Rubbish castle, weirdos, walking around in silly clothes. \n\n\"Rubbish Hat, rubbish stairs,\" he said to the first-year next to him and Anthony Goldstein stared at him warily and didn't say anything back.\n\nPenelope showed them the riddling painting that guarded the Tower, and Dudley tried not to imagine the hours he was going to have to wait on this threshold for someone he could bully the answers out of. She showed them the dormitories with their wide high windows and built-in bookshelves; the fifth years' botany experiments growing fluorescent purple in the back of some dark cabinets; the constantly moving chalkboard of inspirational multi-lingual quotes, sketches, and chicken-scratch Arithmancy equations; and finally, beaming, the scale model wetworks she was building of the sewer systems under Paris.\n\n\"We made her run it with water,\" called a fourth-year from behind a fortress of textbooks on eggshell divinations. \"As opposed to more, uh, accurate fluids.\"\n\n\"Sometimes I put a fluoride dye in to track flow,\" Penelope said brightly, while Padma Patil leaned away from the contraption and Sue Li leaned closer.\n\nIt took three weeks for Professor Snape to realize who Dudley was. Snape had no patience for slowness-- or for excellence, curiosity, or interest-- or for the children who napped in the back of the class. Snape had no patience with children, full stop.\nBut he'd been too busy being distracted by the sight of James Potter's son in his morning class to realize that he had Petunia Evans's baby boy in his afternoon session.\n\n\"Mr.  Dursley  ,\" Snape almost purred. \"If that isn't the most Muggle name I've ever heard. Are you sure they got the right address?\" Dudley poked at his smoking potion, then looked up at the professor, confused. Snape smiled. \"For your Hogwarts letter. I just find it a more reasonable possibility that the Deputy Headmistress mislabeled a letter than that a true wizard could do this poorly in my class.\"\n\nIn Charms class, Dudley's feather caught on fire under the snap of his wand while Padma's floated slowly up to get lost among the ceiling's vaulted shapes. He hunched his way into Transfiguration, and kicked over his desk after thirty minutes of glowering at a match that was looking nothing like a needle. He spent his detentions scrubbing tiles, clearing out musty cabinets, and boxing old filework.\n\nHe spent his nights with his face smashed into his pillow, trying to imagine how to write a letter home, if he had a way to get a letter home, that wouldn't make his mother pale or his father scowl. He waited on the threshold of the Ravenclaw Tower, but he didn't have to kick anyone in the shins to get the passwords out of them, just listened to them squawk it out and pushed by them to get inside.\n\nAnthony Goldstein set up a train set that ran over and around Penelope's sewer system. Padma Patil drew henna over her palms and up her arms that curled and rewrote itself all day long, through magnificent feasts and magical lessons and Dudley throwing late-night tantrums in the boys’ dorm over storage allotment.\n\nMinerva McGonagall kept her eye on Dudley, and Harry, too. Dudley she saw tipping over other people's glasses of milk during breakfast-- she docked him fifteen points from Ravenclaw. Harry she saw flying, on a class broomstick outside her window, chasing down a bully with a fistful of stolen Rememberall. She found Wood, she bought him a broom, and she sat in the stands on game day with her breath stuck in her throat.\n\nThe first time Minerva had seen James Potter, his hair had been windblown. He'd been tossing a Snitch, snatching it out of the air and laughing. James had been ten, the late and only son of rich parents who had wanted him so badly. It had shown in the way he had laughed loud and golden, the way he had wanted for nothing, the way he had known the answer would always be \"yes.\" Minerva watched his son fly, and she wished him the laughter. She wished Harry windblown hair, and a fist of winged gold, and nothing to fear.  \n\n-\n\nThe first time Nymphadora Tonks saw Dudley Dursley, he was on the ground, kicking his heels against the tile and screaming.\n\nTonks knew his name because she'd decided one of the duties of a prefect was to learn the name of every Hogwarts first-year, no matter the House. She also knew his name because some dipshit had overheard the kid's mother on the train platform and so for about a week everyone had called him by her terrible petnames.\n\n\"I used to throw tantrums like that,\" said Tonks. \"When I was like three. Are you secretly a baby, Dursley?\"\n\nHe stopped kicking at the ground in order to glare at her. It was not a particularly impressive glare, with those little eyes and his splotchy red cheeks. \"I'm not a baby.\"\n\nTonks squatted down next to him. \"I dunno, your mum calls you Duddikins and now you're sitting on the floor crying, so what's that say?\"\n\n\"I'm not crying, I'm-- I'm--\"\n\n\"You're what, exactly?\" Tonks's nose went flatter and her cheeks went pinker. \"Look, I'm Dudley Dursley, waaah wah.\"\n\n\"Shut up.\"\n\n\"You're the one who's making noise.\"\n\n\"It's not fair,\" he said. \"I hate it here. I hate you. I don't know how to do this--\"\n\n\"And you think crying on the floor is going to help that?\"\n\n\"I'm not crying.\"\n\n\"Sure, kid.\" Her nose was drifting longer again, her eyes flicking through shades of brown.\n\n\"I hate this,\" he said. It wasn't quite quiet, but he was sitting up. She shrugged. He stared up at her, an eleven year old on his bum looking up at a seventeen year old with bright pink hair and a class she was already late for. \"The staircases move, and the paintings are mean, and I can't find anything, and everyone looks so weird, and I miss--\" He clamped his mouth shut.\n\n\"You're lost?\" she said. He shrugged and nodded. \"Cool, lead with that, kid. The crying, it doesn't do you any favors.\"\n\n\"I wasn't crying--\"\n\n\"Uh huh,\" she said. \"You're lost and late for class, too.” She shrugged, straightening up. “Lookin' good, Dud. Well, see you around.\"\n\n\"You're just going to leave me here?\" he squeaked, throat tight and thick under his chin.\n\n\"Do I look like a babysitter?\" she said. She was five minutes late to Advanced Transfiguration. McGonagall gave her a Look and made her clean the chalkboards after class.\n\nNymphadora Tonks kept an eye out at Hogwarts for Muggleborns, because her father Ted was one. Tonks also kept an eye out for anxious spoiled brats, because, according to Andromeda, her mother had been one, once.\nThe next time she saw Dudley Dursley, he was standing stock-still in front of an empty staircase, clogging up the flow of traffic and getting jostled for his trouble. His face was getting redder and redder, his pudgy little fists clenching. She put her hands on her hips and headed for him.\n\n\"So I'm going to give you a pointer, kidlet. The screaming? I don't care, no one cares but your momma probably. But you're a little bit right-- you have a conundrum here. The staircase  does  move, and the paintings can be a little sassy if you're not patient with them. But you know what you should do about it instead of rolling around on the ground?\"\n\n\"What?\" he said, suspicious and mulish. \"And I'm--\" he gestured widely. \"I wasn’t screaming. And I’m not lying on any floors!\"\n\n\"Ask for help.\"\n\nHe stared up at her with his little watery blue eyes so she shrugged and stepped past him.\n\n\"You're just going to leave me here again?\" he called after her. His voice was high and squeaky for his size, but not for his age.\n\nShe turned around, raising her hands up. \"You didn't ask!\"\n\nHe stared at her, sweat on the bridge of his nose and his hands clenching at his book bag. \"Can you-- can you help me find the Charms classroom?\"\n\nShe beamed. \"Yes,\" she said, holding her hand out to him.\n\n\"I'm not holding your hand. I'm not six.\"\n\n\"Keep up, then.\"\n\n-\n\nTonks had weekly prefect meetings with Penelope Clearwater, so the next time they found themselves with a bottle of purloined butterbeer and a box of Chocolate Frogs and their bare feet in the steaming water of the prefects' second floor bathroom, she said, \"So. That Dudley boy.\"\n\nPenelope put her Chocolate Frog card in the pocket of her robe (Elphius Stodge, inventor of the modern magical sewage system-- she was going to keep that one in her wallet the way some people kept pictures of their dogs or children). \"Has he been bothering one of yours, Tonks?\"\n\n\"No,\" said Tonks. \"Well, he stole Hannah's quills off her desk, but I got them back, and he may have kicked someone in the shins, but they wouldn't tattle to me.\"\n\nPenelope unpeeled another Chocolate Frog, catching it by the hind leg while she read the card. \"Olga Sorenson-- you want it?\"\n\n\"No,\" said Tonks, so Penelope folded it into a little origami boat, lit it on fire with a cold, waterproof flame, and dropped it into the baths to float about with the rest of her flaming armada. \"He doesn't seem like he's doing well.\"\n\n\"Noted,\" said Penelope. She stirred the tip of her wand into the steaming water, and a low wave rippled out to rock her ships. Flames guttered and hissed, washing across violet soap bubbles. \"How's your baby prefect-in-training doing?\"\n\n\"Do you mean Diggory? Of course you mean Diggory. Lordy, I think he was singing the first years lullabies last night... What do you think of the new Gryffindor prefect? Weasley? I saw him herding first-years, with that troll, and he looked like he was thinking about newspaper crosswords.\"\n\n\"He's dreamy,\" said Penelope.\n\n\"You're kidding,\" Tonks informed her and Penelope laughed.\n\nShe leaned back and watched her armada burn. \"I'm really not,\" she said.\n\n\"But he looks like a walking headache, Pen,\" said Tonks and this time Penelope laughed so hard she almost fell into the bath.\n\n-\n\nIt had been a long emotional decision for the Dursleys-- to either not speak to their son except on holidays, or to deal with owl post-- but they had made up their mind. They had kissed him good-bye on the train station, and they had kissed him hello at Christmas, and in between Petunia had told the neighbors all about the sports teams Dudders was on and how he was doing well in his posh boarding school but not, you know,  too  well.\n\nHarry stayed at Hogwarts for holidays, and when Dudley got back he took three trips to carry his armfuls of presents up to Ravenclaw Tower. \"Help me with these,\" Dudley snapped at his dormmates, but Anthony just turned a page in his milk-stained Transfiguration textbook.\n\nIn the Great Hall, the echoing bang of wizard crackers broke the air all through breakfast, leaving Dudley scowling into his porridge. Enchanted snow fell from the Great Hall ceiling. It disappeared before it touched Dudley’s upturned face, or it would have, if his face had been upturned.\n\nDudley counted his presents when he couldn't sleep at night-- one more than last year-- and let that lull him to sleep.\n\n-\n\nOn the Ravenclaw Tower's western wall, a doodle of an armadillo was careening madly around the chalkboard, knocking careful cursive and scribbled spell diagrams about like a bouncing ball.\n\nThe armchairs had all been shoved into a little huddle, to make floor space for Penelope's sewer model, a towering tea leaves cabinet, a second hearth (for potions brewing experiments), and Sue Li's loom.\n\nSue was clacking away there, working on a night-blue cloth whose twinkling constellations seemed to move, while most of the rest of the first years leaned forward in the armchairs, staring at Dudley. Anthony sat near the first hearth (the one with less hazardous fumes) and tried to read despite them.\n\n\"Harry slept in a  cupboard  under some stairs?\"\n\n\"Well, yeah,\" said Dudley. \"He's a freak. Mum's got to be able to face the neighbors.\"\n\n\"You're  a freak,\" said Padma Patil, who was painting minuscule landscapes onto her fingernails-- fields of waving orange poppies and streaky blue skies.\n\n\"He doesn't sleep there anymore,\" said Dudley. \"Dad moved him up to the second bedroom, because the Hogwarts letters were all addressed to the cupboard and he was hoping they'd stop.\"\n\n\"You had a second bedroom, and he got stuck in the coat closet?\" Anthony said, disgusted. He pushed himself to his feet, heading toward his haphazard pile of half-glued model dragons and shaking his head.\n\nPenelope's lips were just slightly compressed. \"What?\" said Dudley.\n\nPenelope turned to him slowly, sorting through a host of things she could have said. She settled on, \"They were  addressed  to the cupboard under the stairs?\"\n\nDudley shrugged, nodding. Rain was sheeting down the narrow glass windows, turning the light cascading and liquid. Penelope chewed a lip softly. \"So Dumbledore knew,\" she said.  \n\n\"Huh?\" said Dudley. Penelope wound a string of her dark curls around her finger and wandered off to make the tea kettle play Twinkle Twinkle Little Star by enchanting the pressure inside the kettle and the shape of its spout.\n\nThe armchairs were so soft that they were hard to excavate yourself from. Dudley sat, thinking,  the staircases move  , thinking,  rubbish  , thinking about thudding down Privet Drive's staircase every morning, or the longer walk that was Ravenclaw's spiral stairwell.\n\nDudley listened to the first few bars shrilling into the air (Padma was humming along, and ignoring him), and then he wobbled out of the armchair. Penelope's foot and wand tapped out the beat. Dudley fiddled with a jar of darjeeling, then put it down to snatch some chamomile and watch the powdery little bulbs fall across the curve of glass as he turned it in his hands.\n\n\"Can you,\" he said when she paused and didn't quite look at him. \"I mean, you're supposed to help us out, right? Prefects-- right? The classes here... I don't want to flunk out, but my matches stay matches, and Professor Snape says-- well, I mean?\"\n\nHe shook the jar of chamomile, petals bruising, dust flying inside the glass, golden, contained, and Penelope waited.\n\n\"Can you help?\" he said.\n\n-\n\nIn Charms class, Dudley's feathers stopped catching on fire but they didn't start doing anything else either.\n\nTonks found him sulking by one of the ruder paintings and dragged him out into the sunlight. \"I'm a prefect; you have to do what I say.\"\n\n\"I do not,\" he said, but he let her pull him along by the wrist.\n\n\"Even if I'm magic, I'm too dumb for this,\" said Dudley, flicking his wand back and forth. That morning, cleaning sticky fingerprints off of it, he'd managed to turn a patch of his blankets blue, but here by the quiet lakeshore he could barely raise a colorless spray of sparks.\n\n\"The Hat put you in the smarties house,\" Tonks said with a shrug. Her hair was metallic, throwing off the pale sunlight of the day. \"You've got hidden talents.\"\n\n\"They're really well hidden,\" he said. He yanked up strands of grass, leaving his hands green and sticky with it.\n\nTonks eyed him sidelong. \"Penelope's ace at Charms, but I can help you with Transfiguration.\"\n\nHe slanted a look up her way, confused. \"I didn't ask,\" he said.\n\n\"But you didn't throw a tantrum either, and you asked Penelope,\" Tonks said. \"Now say thank you.\"\n\n\"Thank you.\"\n\n-\n\nHarry won Gryffindor the House Cup. The Great Hall preened, all done up in red and gold, but Dudley skipped the feast. He spent it down in the house elves' kitchen, out of sight but within reach of a bowl of jam donuts. He smudged powdered sugar all over his wand, but squinting, whispering, flicking and swishing, he played Penelope's careful voice over and over again in his mind's ear. Swish, and  flick  . Swish and  flick  .\n\nNeville was staring, up above, as Dumbledore read out his name. Tonks's laugh split the air, rivaled only by the strength of Oliver Wood's Quidditch-pitch-sized whoop of joy. Ron gripped Harry's shoulder, Hermione's, and shouted down the table at his brothers in a voice that vanished in the general noise. The whole Hall was a cacophony of Slytherin sulking and Gryffindor glory, but down in the kitchen Dudley flicked his wand. A silver tea tray rose silently into the air, just like magic.\n\nJam dribbled down onto his knee, but Dudley held still. His head tipped back and he clamped his breath down in his chest, like if he moved or breathed the spell might break. The tray turned slowly in the steam-heavy air, firelight and lamplight and torchlight flickering on its glinting metal, and Dudley didn't look away.\n\nThe year ended and the Hogwarts Express cut crimson through the hills and over rivers. Dudley changed into his polo and jeans on the train, tucking his robes into the bottom of his pack, wrapped round and round his wand. He bought three fistfuls of sweets from the trolley cart lady and ate them all before the train pulled into the station. He left the wrappers on the seats.\n\nHe shouldered his bag, stepped back through the barrier of Platform 9&amp;3/4, and slammed into his mother’s bony arms. Harry slunk into view behind him, and then they went home-- home, where Dudley’s mother loved him; home, where they never said the word magic and shushed him if he tried. Dudley bragged all over the neighborhood about his cool boarding school, with its rugby team and brand new sports stadium. \n2\nThat summer, they put bars on Harry’s window. Dudley did his school reading-- not under his covers, but behind his locked door, because  his door locked from the inside only. He turned the TV volume up high and let the video game load screen’s music play on loop for hours while he chewed on his quill and struggled through Bathilda Bagshot.\nThat summer, a business man and his wife came to the house for Dudley’s mother’s roast. His father told golfing jokes. Dudley wore a little suit, and it felt as much like dressing up as putting on his robes did. That summer, a tiny little squinty creature appeared in the house and ruined a pudding Dudley had really strongly been looking forward to; he spotted it on the stairs before it vanished.\nIt wasn’t a goblin, Dudley knew, because he’d spent History of Magic staring at the moving pictures in the textbooks and doodling beside them, and because he remembered those high ribbed ceilings of Gringotts, the beings up on spindly stepstools behind the counters. He remembered the way the receptionist had talked him through the pound-to-Knut conversion rates and helped him count out his little sack of coins while they waited for Harry. Much nicer than this dessert-ruining little imp.\n(He knew what house elves looked like, because he had met them in Hogwarts’s cheery, steamy kitchen. But this skinny, flinching, desperate thing didn’t remind him of them in the least).\nThat summer, Dudley woke to a crash and a bang and the roar of an engine. He didn’t even see Harry go, just caught the glare of the rear lights of the Ford Anglia as he pounded down the hallway. His mother’s voice was going higher and his father’s deeper, and they were both getting louder in the cold night air flooding in the broken window. Dudley kicked over a lamp or two, just to join the fun, and then went back to bed. He wasn’t sure what had happened, but maybe his father’s growling commentary over breakfast would explain it in the morning. Under his covers, he dreamed, covetously, of flying cars.  \n(Harry woke on Ron’s floor, at the very top of Burrow, and stepped carefully down the stairs to the kitchen, where Molly filled his plate full.)\nDudley had to fight to get back on the train. It took not just shouting, but also pounding the floor with his heels and eventually some pitiful snivelling. His father didn’t want the fuss. His mother melted whenever he cried, but neither of them fully caved until a plain blue kettle sputtered and turned polka-dotted; until the door knob rattled, untouched. His parents’ eyes flicked toward the curtained windows.\nHe remembered that, as they dropped him off at King’s Cross Station-- he remembered the rapid, anxious look to the sightlines, the flinch at the thought of neighbors’ eyes. His mother kissed his cheek at the platform and Dudley felt less like he was escaping, less like he was setting off, and more like he was being tucked away, the curtains drawn, the voices dropped to embarrassed whispers.\nStrange things had always happened at 4 Privet Drive. They’d always called them Harry’s fault.\nThe first few compartments were far too occupied-- Marcus Flint looming, his barking laugh shoving out into the corridor; Sue Li holed up with some Hufflepuffs and firmly latching the door. Dudley kept a wary eye out for Harry and a compartment full of redheads, pressed close and riotous and loud, but he didn’t find him.\nHe slid back the door of a compartment with only one occupant-- a first-year who looked even smaller than she probably was. Her legs were pulled up onto the seat so she could rest her chin on her knees while she paged through a fluorescent magazine. Blonde hair about the same volume as the rest of her fluffed and curled against the seat. She lifted her head, blinking two big luminous eyes at him, and said, “Hello.”\nWhat Dudley wanted was to be home, with his video games and his big bed with its rocketship comforter. He wanted his dad to tell him what was rubbish. What Dudley wanted was to find Tonks, to tell her about some of the dumb things Mrs. Figg’s cats had done in the front yard, or the day his father had been so flustered by a broken window that he had worn his tie backwards all day long. He thought it might have made Tonks laugh, which sounded a bit like a donkey braying, but it was nice. When Dudley’s mother laughed, really laughed, not tittered or chuckled or smirked, it sounded barnyard like that.\n“Hi,” he said. “Is that-- this seat, it’s open, yeah?”\nShe turned her head, gravely considering the empty seat across from her, and then turned herself back towards him. “I don’t think it’s closed,” she said. “I’m Luna.”\n“Dursley,” he said. “So I can…”\nShe was still looking at him, with those big unblinking eyes, and it was making his skin crawl. She had her robes loose around her shoulders, but the shirt she had under it was fuzzy orange and her stockings were striped. Her hair could have hidden a small nation, and he hadn’t seen her blink yet. He wasn’t sure what his mother would have called her, but he knew she would have crossed the street to avoid this girl and her ilk. If she’d walked onto a Muggle playground like that, he knew his head and Piers’s and the rest of their crew’s would have turned to her, predatory. He could feel the ghosts of smirks rising, the scorn curdling in the backs of their throats.\n“Nevermind,” he mumbled, shutting the compartment door between them and stomping down the corridor until he found a truly empty one. He slumped down on the bench seat, and thought grumpily that it was too bad that Tonks was so clever. She could have repeated her seventh year instead of graduating, and then the whole castle populace would be one  ounce  less stupid, and he’d have someone to sit with.\nWould Tonks have let him sit with her, on the train? Was there a special prefect compartment? Maybe she’d have shut the door in his face. Maybe she’d told all her friends he liked to cry like a baby, rolling around on the floor. Maybe she was only nice when no one was watching, on a lakeshore telling him his talents were just very hidden indeed.\nThe compartment door slid open. Dudley jerked his head up, wearing a glare certain to guarantee him his space to sulk, but a fourth year stepped over the threshold and beamed at him anyway.\n“Hello,” he said. “I’m Cedric Diggory, apprentice prefect.” The hand the kid stuck out was sun-brown and broad with big square handsome fingers.\nDudley squinted at the creases on his palm. “That's not a thing,” he said.\nCedric nodded excitedly. “Tonks made it up just for me.”\n“I’m in Ravenclaw,” Dudley said, lifting his eyes from Cedric’s open palm to Cedric’s yellow tie.\n“You’re in Hogwarts,” Cedric said, lowering his hand but still smiling. His robe was buttoned up, flapping around his knees. Dudley didn’t know this, but his father had ironed it that morning while Cedric fried them both eggs in the kitchen, and Cedric would carry the warmth of that all the way into the winter hols. “I’m going down to every compartment, to introduce myself.”\n“Well, you’re through here, then,” Dudley said, slumping back down against the cushions.\n“Introductions are sort of two-way,” said Cedric. “You are?”\n“Dudley,” said Dudley. “Dursley.” He knew this kind of unshaking smile. As soon as he was out of sight-- the curtains pulled, ducked back down behind the backyard fence-- Cedric would sniff and roll his eyes and mutter.\n“So nice to meet you, Dudley,” Cedric said. He hesitated. “Are you alright?”\n“Sure,” said Dudley.\n“I have a few more compartments to greet, but you let me know if you need anything,” Cedric said.\n“Sure,” said Dudley, and the door shut behind Cedric.\nHarry and Ron took a flying car to school their second year, but Dudley didn't know that until the gossip machine shoved it through the school halls the next day. He sat on the shabby upholstery of his empty train compartment, watching grass and sky flit by out the window, and he didn’t look up.\nDudley continued sulking, all through the Welcome Feast, even as he filched rolls and chicken wings and nibbled on them through the speeches. The weird girl from the train got Ravenclaw and he watched Luna settle herself at the end of the table, looking like she might blow away.  Hippie, his mother hissed in his head,  weirdo, freak. Look at that hair, probably homeless. Look at those eyes, probably on drugs. Drugs! \nThe feast ended; the first-years trekked wide-eyed up (or down) to their dormitories; classes began.\nWhen Mrs. Norris got hung, frozen, from her tail in a hallway, Dudley shoved past without looking, without thinking about all street cats whose tails he’d pulled.\nWhen the first Muggleborn got petrified, he holed up in his room and refused to go to class for a week-- it’s not like he would learn anything, it’s not like it was of any  use , it’s not like he was smart enough. He tore up letters that he didn’t and couldn’t send to 4 Privet Drive, asking to come home.\nPeople called Harry the Heir of Slytherin in the halls, when Dudley finally caved and slunk out to attend class. Dudley scoffed and told them that was  rubbish, clearly, his dumb cousin was too dumb to be up to anything. He didn’t kick at anyone’s shins, but he had a reputation, now, and they scuttled away from him.\nDudley had detentions after class for ages, from the week of ditching; he sorted, repaired, and reshelved books under Madam Pince’s watchful eye. The constant attention reminded him of his mother, peering over the neighbor’s fences, and that made him feel better, mostly. He counted the books, alphabetized and muttered their titles, hauling stacks up and down the long aisles of shelves, and that helped, too.\n-\nMinerva didn’t ask herself why when she wandered down to the emptiest girls’ bathroom. Even she did not always want to know her answers. As she washed her hands, her mind offered them up anyway-- maybe she had wanted the quiet. Maybe she had wanted the walk; there were a half dozen bathrooms closer to her office.\nThere was a gurgle behind her and Minerva twisted the faucet shut. “Hello, Myrtle,” she said. The sink was grubby, the metal flecked and tarnished, the bowl speckled with calcified deposits. She reached for a towel.\nMoaning Myrtle’s warbling voice rippled out across the damp tile. “You’re down here because it’s back, aren’t you?”\nMinerva twisted the towel in her hands and turned to face Myrtle’s translucent, silvery face. Her eyes were bulging, almost blue. Her hair struggled to escape two clumped braids.\n“I’ve heard the girls whispering in the stalls,  professor ,” Myrtle said. “I’m not dumb; I’m just dead.”\nLooking at her, Minerva felt young. She had lived most of her life around children, hordes and masses of them, watching them grow, and maybe this pimply teenager scowling at her should have made Minerva feel old.\nBut if Myrtle had gotten to grow, she’d have been seven years Minerva’s senior-- she’d be in her seventies, now, cranky and hopefully still silly, still kind.\nMinerva had met her at eleven, hiding out in this bathroom to have someplace quiet to read. After she’d gotten over being startled, Minerva had read her book aloud to her. Now, she said softly, “I don’t think you’re dumb, Myrtle.”\nMyrtle blew a raspberry and dropped back down the pipes with an angry flush. Peeves had taught her how to blow raspberries, Minerva was pretty sure; that hadn’t used to be in her repertoire.\n“Well,” she said to the empty, echoing tiles. “At least she’s making friends.”\nOne by one, vulnerable students joined the ranks of the petrified in Pomfrey’s infirmary. Minerva baked ginger cookies, dense little brownies, millionaire bars heavy with caramel, and left them in the teacher’s lounge. She asked Pomona about her seedlings, and not her mandrakes. She argued with Severus over Neville Longbottom’s potions grade. She pestered Filius about his worst second-year, who had recently shouted down a passel of Hufflepuffs until one of them cried.\n\"How  did Dursley get into your House?\" Minerva asked. \n\"The Hat put him there,\" Filius said, breaking off a bit of biscuit. \"These are good,\" he added through a cheerful mouthful. \"Anise seed?\" \n\"He's a bully,\" Minerva said and Filius swallowed, thoughtful.\n\"What has he been taught?\" \n\"What has he learned?\" Minerva countered briskly. \"Filius, Potter was raised in the same house--\"\n\"Not quite,\" said Filius. \"But yes, Minerva, I know what you mean.\" He shrugged, a minute gesture. \nMinerva gathered up the crumbs that scattered the table, floating them over to the trash with a wandless flick of her hand. \"You think Dursley is not responsible for what he does?\"\n\"We are all responsible. But that does not mean it is yet the end of the story,\" Filius said. \nMinerva sniffed and dropped another lump of sugar into her tea as he went on. \n\"The Hat believes in the children,” Filius said, slowly, as though he was formulating his thoughts as he went. “I have always thought it Sorts not by where they belong-- they are ten, there are so many things they can still be and become-- but by what House will serve them best. What home will serve them best. Look at Granger-- look at yourself. You could have belonged in Ravenclaw, but that was not what Hermione needed. We would not have challenged her the way she needed; we would not have helped her grow.” He shrugged, reaching out for a biscuit. “If Dudley needs this, I won't argue. I will try to see where I can help him, where I can challenge him, as I do with all of my students. I am content to wait, and to believe, and to see what he will become.\" \n\"I envy your patience,\" said Minerva. \n\"Then build it,\" said Filius, but he was smiling. \"I kid. If I had Fred and George in my House, I might sing a different tune.\" \nMinerva put a hand over her eyes. \"Oh, they'll become  something.\" Filius reached for another biscuit. Minerva didn’t lower her hand. She said, softly. “You really think they’ll shut down Hogwarts?”\n“I admit,” Filius said, after a long moment. “I cannot imagine it.”\nMinerva said nothing. Together, they finished the plate of biscuits.\n-\nThe first time Percy Weasley met Dudley Dursley, it was at Penelope Clearwater’s infirmary bedside. The kid, Ron’s age, was sounding out the word  effluent. He wasn’t doing a very good job of it.\nPercy cleared his throat and the kid almost fell off the stool. “Er, sorry. Dursley, isn’t it?” Percy said.\nDudley squinted up at his red hair. “Hey, you-- you drove a flying  car  through my  house.\nPercy’s eyebrows met in the middle in a sharp little movement. “Did-- did they? Those twins, I don’t even know how Mum and Dad-- That was my brothers, yes.” He shook his head in a small movement, stern, but then he narrowed his eyes at Dudley. “But Harry  did  seem quite flustered that morning, and  relieved.”  \n“Er,” Dudley said. “Not quite  through  the house, but  still.” He shrugged, jerky under Percy’s disapproving attention. “He’s  weird, and the neighbors-- Mum says, well.” He shoved himself to his feet, his book tumbling open to their feet. “Whatever.”\nPercy watched him stomp away, and then he bent to rescue the book. It was a Muggle one about municipal sewage system design, likely stolen from Penelope’s book bags. It was the sort of thing Percy’s father might have read at bedtime, only understanding half of it and making up fantastic theories for the rest; Penelope, Percy knew, understood all of it.\nHe settled down into Dudley’s abandoned seat. “Hey, Pen,” he said, and started to read.\n-\nMinerva saw Harry and Ron come out of the Chamber-- dirty, bruised, a crying Ginny held up warm between them. Madame Pomfrey swept Ginny away, and Dumbledore seized Harry and Ron, and Minerva let him.\nShe cornered Albus in his office later, because to yell at your subordinates or peers was something she considered unbearably uncouth; and he was her only superior. “How did we let that  happen, Albus? How was our last line of defense Gilderoy Lockhart and two  twelve year old boys?”\n“And Fawkes,” added Albus, and she only didn’t hurl her hat at him because of the bow of his head over his desk, low and tired. The robed sag of his shoulders was familiar, and she knew how few people had been privy to it. To see Albus tired was a privilege. It made one afraid.\nShe didn’t say, “Why do you look like we’re still at war? I know that slouch. I know that sigh. Do you know something I don’t? Harry looks like James did, at the end, in the war-- are we at war, Albus? You tell me the truth.”\n“We will have to write the Weasleys,” she said instead. “Apologize and explain all we can. I think Miss Weasley may have a tough time of it, and it will be better if her parents are prepared.”\n“If you could handle that, Minerva.”\n“Albus…”\n“Thank you, Minerva,” he said, his voice kind, his voice firm and cheerful and final, and so she left him. A gouged leather journal sat small on the desk beside his curled left hand. Among all the detritus, paperwork, and empty saucers she didn’t spot it.\nMinerva McGonagall had grown up on a farm-- dirt between her toes and morning chores like clockwork in the dim dawn light. She still liked getting up early, even if the chickens had been replaced by test papers and her father’s thick coffee by the house elves’ simple tea service.\nShe went back to her office. She reviewed the list of next year’s first years, noted which ones required in-person visits. She flipped through Transfiguration papers, turning her quill’s ink red with the flick of her wand. She pulled a blank parchment across the smooth surface of her desk and turned her ink back to black--\n Molly and Arthur,  she wrote,  I am sorry to inform you that there has been an incident… \nDuring the war, they hadn’t been an army. They had been vigilantes. They had been the resistance. They had been angry kids and furious adults, and Albus. They had had no uniforms, badges, pensions, or marching orders, but after every death Minerva had sat herself down and she had written to the next of kin.\nGinevra Weasley was in the infirmary-- she was breathing, she was eleven, she had never been to war. But Minerva had written Molly Weasley eight times in her life-- seven Hogwarts acceptance letters, and one informing her of the death of her brothers, Gideon and Fabian Prewett.\nThe Hogwarts acceptance letters Minerva had drafted over the years far outweighed the number of deaths she had quietly, diligently documented-- apologizing for every one,  I am sorry to inform you--\nWell, they outnumbered them. She wasn’t sure anything could outweigh them.\nMinerva had stumbled home, that first night they lost a friend. She had washed off the dirt, and the ash, and had realized that if she didn’t write Benjy’s mother then no one would. Dorcas had had her battle plans. Albus had had his long game, his diplomacy and his tricks. The Potters had been children, and Lupin not much better, and the Prewetts had had a mission that midnight. So she had sat down in her soft nightgown and wrote an apology in her best handwriting, and then she had gone to sleep.\n Molly and Arthur,  she wrote, now, and she felt heavy writing it, felt tired and old.  I am sorry to inform you that there has been an incident… \n3\nNo one wrote home to the Dursleys--  Dear Vernon and Petunia, I am sorry to inform you that your nephew, once again, looked down the long barrel of his own death and said a solemn hello to it coming. A bird cried on him, though, so he’s okay. \n\n Also he regrew every bone in his arm over one very, very long night this year, and this may have been disturbing to him. Please be kind. \n\nAt 4 Privet Drive, Dudley accepted his Aunt Marge’s hug and the crisp money his father pressed into his hand after. It was an old habit, routine, and he was already counting from memory the shoebox full of coins and notes under his bed. The constant tick of numbers climbing and sorting themselves was soothing, and he flicked his thumb over his adjacent knuckle for each count, a steady beat.\nDudley was jostled out of his count, quite literally, as Marge’s thick hand came down to grip his thicker shoulder. “Neffy-poo!” she announced, and asked him something about school. He managed to get out his answer, to his mother’s encouraging nod-- sports teams, toilet bowls, television in the dorms. When Marge turned back to snap something about Harry’s hair, Dudley tried to take up his count again, but he was distracted by the thought of how much Tonks would be laughing at Dudders, little neffy-poo. It wouldn’t be her nice laughter.\nMarge was saying something about Harry’s hair, and Dudley’s mother was humming something in harmony with it. Dudley’s father scoffed and Dudley reached for the first slice of lasagna. He was the only one who could feel the magic rising in the air. He gripped his water glass to keep it from spilling and watched, still chewing, as Marge sneered about Harry’s dead parents and then as Harry blew Marge up like a balloon.\nHe felt like Tonks would have laughed at this, too, and it would have been a different sort of laugh.\nHarry wasn’t laughing. He didn’t much, except that sometimes Dudley spotted him across the Great Hall at Gryffindor table, and he laughed then. Dudley took another slice of lasagna, because being hungry wouldn’t stop his mum from yelling or his dad from screeching or Harry from storming off into the night. The door slammed shut behind him. Dudley’s mother’s voice was rising higher and higher, so Dudley climbed up the stairs and pulled his shoebox of money from under the bed and started counting. His thumb flicked over the knuckle of his forefinger, one two three, one  and  two  and three.\n-\nDudley didn’t see Harry again until he hunted down his compartment on the Express. Dudley banged the door open, rolling his eyes at the startled stares of Redhead#5 and that little girlfriend of theirs. “Here,” he said, thrusting a second signed Hogsmeade permission form at his cousin.\nHis cousin stared back, dumb and four-eyed.\nDudley dropped the paper on the empty seat. “It’s just so you won’t mope and then blow up the trolley lady before she gets to my compartment. I spent a whole summer without chocolate frogs and I can’t take it anymore.” He slammed the compartment door shut and stomped down the corridor to his own, where he was only interrupted by Cedric Diggory and his cheery yearly handshake, and then by Percy Weasley, who dropped by to check in on Dudley’s summer and bring him up to speed about Penelope’s health.\n“We ended things amicably, Pen and I,” Percy added, unbearably posh about it, especially for a specky ginger twat. “We were still penpals all summer, just with slightly more professionalism.” He nodded earnestly at Dudley, who stared back, missing his video games already.\n“Isn’t there a prefects compartment?” he said.\n“Have you ever used a Muggle library?” Percy asked. “Pen mentioned them.”\n“Yes?” said Dudley, or he tried to. He turned away, scrabbling in his bag for his robes, for a jacket.\n“Well, I--” Percy made a noise.\nWhen Dudley turned back around he saw him still standing, clutching the door frame.\n“Chilly for September, isn’t it?” Percy managed, and then the dementors slid past the frosting windows. The black edges of their robes flickered like candle flames\nDudley huddled in his jacket, pushing himself back against the furthest wall from the darkness. Percy thudded down onto the other seat. The train went silent, from the engine to its furthest compartment. Dudley would realize, later, slurping hot cocoa down in the kitchens, that he had been expecting screams. How could you feel so bad, and stay silent? But he had been right there with them all, shivering. His lungs turned to ice in chest.\nDudley didn’t know what the things were, just that they were terrible--  dementors , Percy would tell him when they were gone. They dug up your worst memories from your chest and laid them bare before you.\nIf someone had sat down Dudley for a school exam, with a blank paper and a number two pencil, and asked him to list out the worst moments of his life, he wasn’t sure what he would have chosen--\nThe week of hiding in the Ravenclaw Tower, away from the filling beds in the infirmary and the threats painted on the walls? Getting the wrong count of presents on his birthday? Screaming at his father in a shack on the water, because he was trying to deny him something that was his  his his ?  \nHis father shouted, fleshy hand banging down on the dinner table. The silverware all rattled and Harry-- Harry  flinched, his too-big sweater sleeves dragging through the gravy on his plate.\nPetunia glared out the windows. Petunia hissed at Harry, ugly words, terrible ones, and slid the bolt in the cupboard door locked. Petunia yanked the last slice of french toast off Harry’s plate and slid it onto Dudley’s with a sweet smile. Dudley dug in, the syrup bursting sticky on his tongue, and he was full and fed and happy so what did it matter that Harry was shivering, that Harry was flinching, that Harry was glancing away, hungry and still and tired?\nThere was nothing special about Dudley, and the cold whispered that to Dudley now. There was a long thin line between Dudley and the boy under the stairs. His parents’ eyes flicked to the shrieking tea kettle, now polka-dot-- big cheery yellow ones and Dudley shivered and shivered, pulling his jacket close. The windows were drawn and his mother was hissing about the neighbors, about what they would think, about  freaks freaks freaks --\nWhen it was all over, the trolley lady came around and Dudley bought two fistfuls of chocolate frogs. Percy went to find Ginny. Dudley counted wrappers and Knuts and didn’t offer any of them to Weasley’s retreating back. He didn’t know they were medicine. He just wanted them, so he ate them and left crumpled wrappers on the seat cushions.\n-\nMinerva had known Sirius Black. She had taught him, scolded him, buried laughter in his presence-- as a disciplinarian, it was no good to let your local troublemakers know quite how much your delight in them outweighed your exasperations. She had seen Black and Potter walking the halls, knocking shoulders, heads bent close and she had been surprisingly, achingly certain she’d never loved anyone like those two kids loved each other.\nMinerva had not gone to the smoldering ruins of Godric’s Hollow. Minerva had sat on the sun-warmed brick outside 4 Privet Drive and waited for Dumbledore, waited for Harry.\nSirius Black was in her school again, skirting the edges of it with the same arrogance that had alway catapulted him to the center of crowds. Black and Potter had been loud, they had been reckless, they had been cruel, as children-- had she always thought that? Had she named their pranks what they were? Or had she let them drown her with their charming grins and the warm ways they orbited each other?\nLily had hated them, and then she had loved them. Lily had folded into their orbit by seventh year, and didn’t that say everything? Lily had walked away from Severus-- but here Snape was, with Albus’s blessing, watching after Minerva’s latest children. Lily had loved James, had named Sirius her son’s godfather-- and here Black was, haunting them still, so what did that say? Sirius had always made Minerva want to laugh, even at her most disapproving.  \nMinerva went and got herself another cup of tea. She walked the Hogwarts grounds before she went to bed each night, checking the wards, dropping new ones in her wake. Sometimes she passed by Filius on a similar stroll, or Sprout, and they nodded the quiet nod of sentry to sentry as they moved on through the quiet nights.\n-\nDudley still didn’t care for Charms, and felt about Transfiguration the way Piers did about the maths he’d been complaining about all summer.\nBut Care of Magical Creatures-- it wasn’t rubbish, okay? Not entirely. There was too much standing and walking and it made him tired, but at least creatures made  sense . Turn a needle to a matchstick? Fat chance. But he could look at things moving and making noises and eating the slop Hagrid ladled out for them, and he could name them and talk about how high they could jump and what sort of slop they liked. Hagrid didn’t make them write it down, either.\nThe hippogriffs were the biggest things Dudley had ever seen. He’d never seen real horses, or eagles either, but he was sure they couldn’t compete. Everything felt smaller in the summers-- Privet Drive a bare boring shadow of Hogwarts, Piers’ tales of mathematics, and bothering kids off the local playgrounds. He bet if he ever saw a horse, after looking at this thing in its liquid gold eye and bowing, he’d be disappointed. “They’re rubbish compared to you,” he assured the hippogriff as he patted its neck and it blinked at him slowly.\nWhen Draco frightened the thing, Dudley almost kicked him in the shins, but dumb old Pansy Parkinson got in his way.\nThe year passed slow. There was some hullabaloo about a criminal in the castle, but that seemed both less concerning and less cool than a giant snake. Dudley skipped History of Magic class to go down to Hagrid’s hut to visit Buckbeak and to feed the flobberworms. He liked watching them wriggle, and Hagrid always gave him rock cakes.\nSometimes Hagrid was weepy, and Dudley wasn’t sure what to do about it. He nibbled the hard cakes and tried to name the flobberworms silly things. It made him mad, if he thought about what was going to happen to Buckbeak. He wasn’t sure what to do about it, so he’d wander out to the pumpkin patch and tell Buckbeak what things were rubbish that week, while the hippogriff watched him with those big gold eyes.\n-\nMinerva was busy guarding Black’s locked and warded door, suffering through Severus’s insufferable smugness, and drafting angry letters in her head to the Ministry about their dementor management, when Madame Pomfrey stopped by to gossip on her way to pick up more chocolate.\n“I don’t know what spell he used, or maybe a contact potion, but Potter and Granger are both  vehement-- spinning fantasies about a rat, I don’t know,” said Poppy. Her stringy grey hair was pulled back neatly under her medical kerchief, spelled white and gleaming. “I’d be worried, but Albus is so very certain that it will fade eventually. Do you know of any spell that would do this, Minerva? They’re not Imperiused, I know the signs for that.” She crossed herself at the mention of the Unforgiveable Curse, pale.\n“I don’t,” said Minerva, grim. “Severus?”\nSeverus sniffed. “Black has always been  creative .”\nThere was no sound from inside the locked room. Minerva had her wand ready, for the escape attempt she was hoping wouldn’t come. She remembered Black at fourteen, snorting milk out his nose and onto Potter’s robes. She remembered going down the brick pathway to a home of two dentists and their baby girl, remembered Hermione staring up at her and firing off questions like she’d been preparing all her life for a magical world to drop into her hands.\n“They say he’s innocent?” Minerva asked. “Potter and Granger?”\n“Framed, by Peter  Pettigrew , imagine that,” said Poppy, and left Minerva and Severus there in the empty hallway. Severus wondered gleefully if they’d get to see the dementors perform the Kiss and Minerva let his voice slide around her, unheeded, unheard.\n-\nDudley wouldn’t say  most  nights, but it was certainly  many nights that he puffed and scowled his way down to the kitchens. It was a boring evening for Dudley, nearly to the end of the school year, when he stopped partway there to lean on a window ledge and look out.\nHagrid’s hut was a shadowed shape against the forest, small the way Hagrid himself never was. The executioner had been supposed to arrive that day; Hagrid had told him the last time he went down to feed flobberworms and Dudley had done his best to forget it.\nIt was a boring day, a rubbish day. Dudley shoved his elbows against the stone of the window. The cooling air was nice, though. He hoped Buckbeak had gotten to eat a really fat gopher before it all ended. Did they give hippogriffs last meals?\nThere came a great flapping of wings. Dudley almost fell out of the window, leaning out of it so that he could catch sight of Buckbeak’s massive wingspan blocking out the starry sky. He gave a laugh and then a whoop of joy that was answered back by a triumphant whinny. There was a shout from the grass below, but no one gave chase and Dudley hung half out of the window until the hippogriff had disappeared from sight.\nThe stars hung small in the darkening sky. The cool air flooded in the window, turning his cheeks a cheerful, ruddy red. Dudley caught his breath. He tried to hold onto the joy of it all, but something was curdling in his chest as he pulled away from the window and the empty sky beyond it. Buckbeak was alive, and wild, and free, and that was good. There would be so many more fat gophers for him to pounce on. The sky above the castle was empty, and dark.\nDudley hurried on down to the kitchens, trying not to be reminded of Harry disappearing into the night with the roar of a Ford Anglia’s engines.\n4\nThat summer was the summer of quarter grapefruits and forbidden ice cream. “They’re ruining you at that school,” Petunia mourned, pinching Dudley’s cheeks. He sidled away from her, but couldn’t convince his parents to feed him more than a few pieces of lettuce for lunch.\nHe tried to tell them about the many stairs to Ravenclaw Tower, and helping Hagrid unload Care of Magical Creatures supplies, and how he ate spinach and peas and cauliflower with dinner because otherwise the house elves sulked when he went to visit, but they shushed him as soon as the subject became clear.\n“Stairs aren’t magical!” he snapped, though Hogwarts’ were. “Neither is harvesting pumpkins!” He didn’t mention the pumpkins’ size, though, really, that wouldn’t make his case any better. “You’re not listening!”\n“Boxing!” said his father. “That’s good, normal sport.”\n“I’m not-- I’m not  ruined ,” Dudley said.\n“Boxing!” said Vernon. “That will fix it.”\nThey got Piers’s parents to sign him up, too, despite Piers being as tiny as Dudley was big. Dudley told an excited Piers all about Buckbeak, except he claimed he’d been just a rather cantakerous horse who had run away to Be Free.\nHarry went off to the Quidditch World Cup with the Weasleys. Piers and Dudley whispered through boxing, talking about running away to start a horse ranch in Scotland, and bought clandestine ice cream after with smuggled pocket money.\n-\nPercy Weasley was a judge for the second task, which Dudley found out when he almost smacked into him in the Hogwarts halls. Dudley squinted at him. “Didn’t you graduate, Weasley? Didya flunk out?”\nPercy laughed, though it wasn’t funny and the laugh didn’t sound like he thought it was funny either. “I’m Mr. Crouch’s assistant, and acting as judge for the Triwizard Tournament.”\n“That dumb rubbish?”\n“Isn’t your cousin one of the champions?” Percy said, as though absolutely everyone didn’t know Harry Popular Kid Potter was the Great Hogwarts Champion. Dudley had been struggling through the joint and conflicting desires to grumble at the attention Harry-the-Champion got, and also to kick the shins of every unwary dumb-butt he found flashing a “Potter Stinks” badge. He’d decided, eventually, that those things weren’t conflicting after all and he could just quietly hate both parties at once.\nHe had a  Cedric the True Hogwarts Champion  badge himself, but only because Cedric had looked so uncomfortably flattered every time he saw one.\nTonks showed up in the crowd for the second task, too, and greeted Dudley with a cheery shout of, “You never write!”\n“ You  never write!” he hollered back. Half her head was buzzed and the rest was a bright tangerine that oughtn’t to have looked so awesome, but it did. Her big boots cut big shapes into the soft lakeside dirt and her fists pressed into the bulging pockets of her heavy leather jacket. Somehow, she had gotten even cooler. Tonks grinned at him and let him tag in her shadow as she said hello to half the crowd.  \n“God, I’da gone for this kind of thing,” Tonks told him as the contestants took off into the water, splashing like champions.\n“You’re here to cheer on Diggory, right?” Dudley said suspiciously.\nTonks barked out a laugh. “My apprentice prefect! Of course I am, dumbass.”\nDudley nodded seriously and bumped her elbow with his own. “Good.”\nThe task itself was rather boring-- just flat water with the occasional magical announcement or dramatic surfacing. Tonks told stories about Auror training to him, and to Luna and the littlest Weasley, who were standing nearby. Luna told them all about creatures Dudley wasn’t sure actually lived in the lake, while Ginny glared at Dudley and called him a lot of names, which made Tonks laugh.\nDudley didn’t even mind when Harry popped out of the water to massive cheers. His cousin had stolen someone else’s sister, weirdly, the over-achiever.\n-\nMinerva McGonagall was in the audience, for the third task. It was other professors who paced the outside of the hedge, ready to respond in an emergency. They expected emergencies-- she had helped Albus draft the plans for meeting them. They expected accidental magic, a patriotically-inspired fist fight or two, emotional distress, or maybe some mild mauling from one of the creatures.\nShe was much more eager for a Hogwarts victory than she was worried for something terrible occuring. They were children. Even in the last war, Hogwarts had remained untouched. It had never been a battlefield.\nIt didn’t occur to her, until she saw Harry thud to his knees in the grass, his fist clenched in Cedric’s limp robes, that that wasn’t technically true.\nShe stumbled down from the stands. Harry was shouting something but she couldn’t hear him. Emergency protocols were spinning through Minerva’s mind, but none of them were right. Hogwarts had never been a battlefield. Even at the height of the war, it had remained--\nBut hadn’t that war begun with the death of a child? Hadn’t it begun on Hogwarts ground?\nThey hadn’t understood the culprit, back then, but it didn’t keep it from being true.\nHadn’t Myrtle been the first casualty of Tom’s war?\n-\nDudley didn’t pay much attention to politics but he did recognize, at the end of the year, that something bad had happened with Harry, involving someone who’s name was like God’s (you didn’t take it in vain), and also that Percy was in trouble for some part of it.\n“How was  Percy supposed to know his boss was evil?” Dudley complained at Luna, who was stringing jewelry in the Common Room. She had agreed to let him complain so long as he helped hold the end of her necklace strings and pass her the beads and feathers and bottlecaps she needed. “Bosses you just-- you just do what they say, right? And like, aren’t they all evil?”\n“Seize the means of production,” Luna said thoughtfully. A peacock feather (did they come in iridescent violet? Dudley hadn’t thought so) bobbed from one ear, hanging almost to the ground.\n“How was he supposed to know?” Dudley demanded. “How can you get in trouble for not knowing?” Luna asked for a round blue bead and Dudley bent down to find it, grumbling.\nDudley spent the last few days of school writing a blisteringly pissed-off letter to Tonks, who he thought might be pissed-off with him, which seemed rather nice. Then he had a spark of inspiration and wrote one to Percy, too, telling him exactly how dumbly people were treating him. He sent them off with the school owls from the Owlery, and hoped they’d know to bring any responses back to 4 Privet Drive. He scritched the top of one owl’s head before he sent it off. “Smarter than most people, aren’t you, ugly?”\nWhen Dudley’s mother swept him up from the platform to cover his face in kisses and ignore Harry behind him, he suffered under these attentions. “And how was… school?” his father asked.\n“Rubbish,” said Dudley and Vernon chuckled.\n“That’s my boy,” he said, and led them all back to the car.\nAlso, Cedric Diggory was dead.\nThat probably should have been the first thing on Dudley’s mind but-- how could you think of it, really? He didn’t want to.\nDudley wanted Cedric to have flown away like Buckbeak. He had a dream like that, Cedric with big wings that blocked out the blue sky, but then the wings started to slide and melt and vanish, the way the floor did in bad dreams sometimes. And then Cedric was on the ground, on the grass again, and Amos Diggory was kneeling on the grass beside him and screaming his son’s name loud enough to wake Dudley from a dead sleep.\nHe didn’t like that dream much, but he had it a lot. He didn’t tell his parents about it, because he had a feeling what they would say about a grown boy crying, especially over another grown boy. He didn’t cry where anyone could see. He murdered some video game space aliens on mute and went down to the kitchen for some sneaky tea, feeling illicit and missing the house elves.\nOn his way to midnight tea one night, he heard noises from Harry’s room and hesitated at the closed door. Was someone coming to break him out again? If so, Dudley was going to head straight back to bed to avoid the ruckus. But Dudley recognized the words breaking through the still night air--\n“No,” Harry said. “Cedric.”\nDudley pushed away from the door and went down to the kitchen, careful to avoid the creaky steps on the stairs. He shivered. Moonlight glinted in the stream of tapwater as he filled the kettle.\nThe next morning, Harry stepped straight into the lukewarm tea waiting outside his door, oversetting it and flooding his socks. Vernon assumed Dudley had left it there for a lark and laughed through breakfast. Harry dried his socks and Dudley stabbed at his grapefruit, meeting no one’s eyes.\n5\n“Isn’t that your cousin?” said Piers, lifting his nose as though he was locating Harry’s location by smell rather than sight. Harry seemed to spot them and then, for some reason, he sped up in their direction.\n“Whatever,” said Dudley. “I want chips. You want chips? Let’s get chips. They don’t make them right at school.”\n“Your school sounds like it sucks,” Piers said. He was still watching Harry move toward them. “Except for that horse.”\nLeaves skittered across the pavement. They were brown, grey, limp, and that didn’t seem right. Harry was almost running and Dudley couldn’t pick up his feet. A loose gate slammed shut in a sudden burst of wind.\nDudley had been in the stands, for the third task. He hadn’t been sitting with anyone in particular, and he’d brought some homework in case it was as boring as the second task had been. It had been cold, and maybe that was why he was thinking about that now-- the chill wind was rising up, scouring away the summer heat.\n“Dudley?” said Piers, and he sounded scared. He sounded far away. “I feel funny.”\n“Shit,” said Harry, rushing right past them, and Dudley turned to see black robed figures coming down the sidewalk. Harry was small, skinny and knobbly-kneed, standing between them and the dementors.\nIt had been cold in the stands. Dudley had sat alone. Harry had appeared on the field with a crack and a bang-- with a  thud as Cedric’s body hit grass and ground.\n\n There will come a choice between what is right, and what is easy. \n\nThere had been nothing to do. Dudley had sat, the same way he was sagging down now.\n\n Remember a boy who was good, and kind, and brave. \n\nDudley was dreaming about wings against the sky. Dudley was leaning out a Hogwarts window, stone pressing into his sternum, cheering while Buckbeak crashed into the hard ground, bird-bones snapping like twigs.\n\n Remember Cedric Diggory. \n\nTonks was beside him on the shore of the Lake, calling Cedric’s name across the rippling water. Amos Diggory was on his knees in the grass, screaming, and Dudley was frozen in the stands. Dudley was on his knees on the pavement and he thought maybe he was crying. Maybe he was dying. Cold hands closed over his shoulder.\nIt would be easier to forget-- the Forbidden Forest dark across the grounds at night; the warm static of his television monitor right after he switched it off, prickling all the hairs on his forearm; dripping blood on the boxing mats, tasting it down the back of his throat.\nHooves hit the pavement. White light threw Piers’s cheekbones into sharp relief. Dudley staggered for his friend’s elbow, pulling them both to their feet as Piers gasped something about  a horse, your horse, it came. “It’s not my horse,” Dudley tried to say, but the words were all garbled on his tongue.\nHarry got them home-- dropped Piers at his doorstep and lugged Dudley back to Privet Drive. He must have, but Dudley didn’t remember. He just leaned heavily on the kitchen counters and shivered while his mother patted his face and shoulders and sides, crying, while his father went red, while Harry explained what happened. Harry dropped the story in bits, distracted.\n“Voldemort,” Petunia stuttered. Dudley’s hands were slippery on the counters, sweaty and cold.\nThe only soul in the Dursley’s kitchen who didn’t know something of what that name meant was Vernon, but he watched his wife pale and step backwards. Vernon’s face twisted. Harry didn’t twitch, just turned to look at his aunt.\n“These-- these dementoids, they’re here because of you,” Vernon said, stepping towards Harry, who was still looking at Petunia. “This-- Volder-whatsit is after you, and that’s why Dudley’s gibbering--”\n“I’m not--” said Dudley.\n“That’s it,” Vernon said, the same way he had about the letters, nailing the mail slot shut, or about Mr. Wilson’s unkempt hedges before he went out with trimmers and a mad look in his eyes. “That’s  it  , you’re out. We have put up with this-- this  nonsense--  for far too long, and you will not put my  family in danger.” Vernon towered over his nephew’s narrow frame.\nHarry stared back steadily, unflinching, contemptuous. “Alright,” he said.\nPetunia’s hands were pressed up against her lips.\nThere was an owl racing over trees and boulevards, coming to drop its letter at Petunia’s feet, but Dudley didn’t know that.\nHarry lifted his chin, scorn in the twist of his nose. This was how Harry looked at Snape, at Crabbe and Goyle and Malfoy, at Rita Skeeter-- people who thought they could hurt him. People  could  hurt him, with fists or words or wands-- Harry knew it, he must know it, and he looked at them anyway, just like this.\nHe looked at Dudley like that, sometimes. Dudley had always been taller than his cousin, bigger and stronger, wanted.\nHarry had probably looked at He-Who-Must-Not-Be-Named like this. He’d probably thought he was going to die, and he’d probably spit in Voldemort’s face, been angry instead of scared, done something magical and unexpected--\nDudley’s hands were pressed into the cold, heavy weight of his mother’s counter, slippery with sweat and despair. He took a shaking breath.\nHarry had hit the Hogwarts Quidditch pitch on his knees. His fists had been buried in Cedric’s askew robes, his cheeks streaked with tears. Dudley had been in the stands, cold.\nThere was a Howler clenched in an owl’s talons, flapping through the high winds, ready to spill out its words in the 4 Privet Drive kitchen--  Remember. \nDudley didn’t know Dumbledore was sending a reminder of a promise to the one Dursley he thought would listen. Dudley was standing on the linoleum of his childhood home, feeling too small for his skin.\n\n Remember. \n\nDudley remembered standing in a shack on the water, screaming at his father.  If Harry gets to go, so do I.  “I,” he said. “If--if--if you kick Harry out, I’m going, too.”\nPetunia squeaked, her knuckles whitening where they were pressed to her lips.\nHarry turned to stare at him.\nHarry had green eyes, and every other wizard seemed to like to gush about how they were his mother’s, but Dudley wasn’t sure he’d ever actually met his Aunt Lily. His parents didn’t like questions. Harry was staring at him with a dead woman’s eyes. It was like looking at a ghost, except Dudley knew ghosts and that was nothing like this.\nDudley shook his head and shook his head and then he walked out of the kitchen and up the stairs and to his room.\nDid going up the steps always drop dust down into the cupboard under the stairs, set the spiders to stirring? Or only if he leapt down them, laughing?\nDudley shot up aliens on the television screen until dark fell. When a sleek black owl dropped a Howler at his mother’s feet, he wasn’t there to hear the letter rise up and thunder at her--  Petunia, remember my last. \nHarry was still there at breakfast. Dudley ate his quarter grapefruit and went to meet Piers for boxing practice.\n-\nHis mother didn’t like letting him out of her sight in those days, so when they went off to some sort of lawn competition, Dudley came with them. He stole cheese slices from the buffet table while his mother cooed over fertilizer and hedge trimmers and boring straight lines of turf.\nWhen they came home, the door was ajar and the house was empty. The umbrella stand was knocked over in the front hall. Dudley stumbled over the front step. His father was saying something and his mother was saying something-- about burglars, police, the gardeners-- but Dudley slipped by them and stumbled inside.\n“Harry?” he said.\nShadows spilled long and inky over his mother’s tidy carpet. His wand was bundled up in the bottom of a shoebox in his room, and what would he have done with it in defense, anyway? The kitchen was empty-- the cold kettle on the stove, the humming fridge, the clean expanse of the counters. Dudley was heading for the stairs, to check the second bedroom when he heard his mother yelp.\nThe sprint from the top of the stairs to the sitting room wasn’t enough to make even Dudley pant, but he was damp with sweat when he got there, anyway. His feet hit the steps-- dust fell from the rafters inside a little dim cupboard, dirtied the musty blankets still folded up there. His feet hit his mother’s tidy carpet, thudded down the hallways-- and Dudley was remembering Cedric’s body hitting the grass with that  thud , was imagining his mother standing over Harry and screaming like Amos.\nShe’d weep, wouldn’t she? If every bad thing hunting Harry came to call, if his body hit the sitting room floor with a thud, if she found her nephew spread-eagled and still-- or would she just weep for the carpets?\nDudley stumbled to a stop in his mother’s perfect hallway, at the door of the sitting room. His mother’s fingers were pressed to her lips, pale and frightened.\n“Hey Duddikins!” Tonks’s head said cheerily from the fire.\n“Is--is Harry-- did they--”\n“We came and grabbed him up,” Tonks said. “Dementors in Little Whinging! Dumbledore sent us out.”\n“There’s a  head  in our  fireplace  , Vernon,” his mother said. “Vernon,  look  , Dudley  get away from it  -- why is its hair  blue-- ”\nDudley waved off his mother’s fluttering hand, stepping further into the room. Tonk’s hair was indigo, a nice deep hue, and her ears were a size larger than her norm. He wondered if those were her actual ears, and if it mattered if they were. His father stumbled into the room, gaping for a moment before he caught his breath enough to roar questions at the fireplace.\n“Harry’s safe,” Tonks said to Dudley, her gaze barely flicking toward Vernon’s bellow. “We’ll fix this whole expulsion thing, and get him to Hogwarts in September. I just--” Tonks glanced over her shoulder, as though listening to someone. “Duds, I’ve gotta go. Just didn’t want to freak you out.”\n“Yeah,” said Dudley. “Thanks. Tonks.” He buried his hands in his pockets. “I mean, I’d have figured it out, when I saw Hedwig and all his stuff was gone. That he wasn’t dead or whatever.”\n“See?” said Tonks. “House of the smartypants. You keep care, Dudders.”\n“Yeah,” said Dudley, but she was gone, the fire flicking out like a light switched off.\nHis father was still shouting. His mother had sagged down onto a couch, pale as vanilla pudding. Dudley climbed up the stairs, shut his door, and killed space aliens until he fell asleep sitting up in his squashy armchair.\nThe last weeks of summer rolled out slow as sludge. His parents grounded him, though they still drove him out to boxing practice (his mother refused to let him walk alone or even with Piers, now, which led to Vernon and Petunia having a screaming match in the kitchen about Dudley being a sissy).\nDudley thought about writing a letter to Tonks, or Percy, to ask how things were going (the Weasleys had to be involved, didn’t they?), but he didn’t have an owl or a mailing address.\nDudley watched the Muggle news with his dad, trying to translate it, to watch for mysterious explosions or fires or deaths. There were plenty, but it was hard to tell what might be magical and what was mundane. He thought maybe Tonks would pop her head into the fireplace again and tell him what was up, but she didn’t.\n“She’s probably busy,” Dudley told the space aliens dying at the ends of his blasters. “Maybe she’s dead.”\nWhen he badgered his parents to take him book buying in Diagon Alley, the hidden street was still there-- bustling, brimming, the first taste of clean magic after a long grey summer. Petunia and Vernon sweated and fidgeted over a bowl of dry pretzels in the Hog’s Head, waiting until Dudley came out with a stack full of books and a small owl’s cage dangling from his pudgy fingers.\n“I’ll keep her in Harry’s room,” he promised his mother, and stole some pretzels from their table.\nWhen Dudley showed up at Platform 9 3/4s on September 1st, the Express was there. He stepped up onto the train, shoes pressing into the thin carpet. The sound of young voices, the soft hoot of owls, croak of toads, and mewls of cats filled the musty, sweet air.\nAt school, Dudley stole the Daily Prophets that got left over in the Ravenclaw Common Room, heavy with his peers' annotations and red-inked critique. He wrote Percy Weasley, because Percy was the smart sort of dumb and he might know something. Dudley's new owl was small and black and noisy, and he was calling her Spot.\nPercy wrote back, patronizing and deeply dismissive of the whole Voldemort notion. Dudley told him he was dumb (had he seen Harry on the Quidditch pitch? Had he seen Cedric?), and asked after his Ministry job. Percy wasn’t talking to his parents, and Dudley thought that was stupid, too. He told Percy so.\nTheir letters all year were half name-calling and half commiserating over Ministry politics every bit as contentious as Petunia’s neighborhood gossip. Percy knew nothing about the war, but it was nice to spit out arguments and it was nice to hear something of the larger magical world, even if Percy was probably the mundanest wizard who ever lived.\n-\n“Detention again, Mr. Dursley?” Madame Pince said, looking down her severe nose at him. “Well, the Potions section is horrendously out of order, if you could…”\n“No, I, uh,” said Dudley. “I wanted-- a book?”\nHer thin eyebrows rose slowly up above the shiny rims of her glasses. “I suppose that  is what a library is for,” she said. “Any book, or were you looking for a particular flavor, Mr. Dursley?”\n“Like, history,” he said. “Modern, you know-- like, the last war? How it… ended.”\nShe directed him back to a section of shelves he vaguely remembered sorting before-- this one with the friendly primary colors, and this one that read aloud if you asked politely, and this one that fluttered back up to waist level if you dropped it. He dropped that one, to see if it still would fly itself back up (it did), then plucked the brightly-colored one off the shelf. Its words were as friendly as its pages and he read slowly through its summaries and euphemisms.  Noble sacrifice  , the pages said.  War heroes Lily and James Potter. The end of fear. \nHe pulled out a green book next, slim and not too scary. It used words like  noble  too, but it also used words like  murdered  . The book after that was a survey of key figures in the War. They wrote  War  like that--  the War -- like it had been the only one; some of the old people on Privet Drive talked like that, but Dudley didn’t think it was the same one.\nThis book had pictures, which was one of the reasons Dudley picked it up. It talked about newspaper people You-Know-Who had killed, and Aurors, and politicians, and particularly political educators. Sometimes it showed pictures of them dead, and sometimes it showed pictures of them waving and smiling or staring quiet at the camera.\nIt had a section on Harry, too. Dudley sat for some time, looking at the still black and white images of two figures lying on the floor. It was a nursery floor, he thought, because he could see a cradle and a blanket that probably would be dumb primary colors if the book was in color. The roof was gone. A breeze moved the edge of the blanket back and forth and that was the only movement on the page.\nHe couldn’t see their faces. Lily’s hair fell across the carpet in an arc like a comma or the curve of Buckbeak’s wing. Dudley knew it was supposed to be red, because people loved to tell Harry all the ways he did and did not look like his mother.\nDudley had never met his aunt or his uncle. He wondered if Lily Evans had looked anything like her sister. His mum was sharp and weird and kind of mean and she never stopped moving. Lily Evans was dead. He shut the book. He put it carefully back on the shelf with the others (all in the right places otherwise  he  would be fixing them, next detention), and headed over to the Potions section to get it set to rights.\n-\nCho Chang was crying in the Ravenclaw Common Room.\nDudley didn’t really like the Common Room. It was big and always a bit chilly and you had to share it with a bunch of smart, rude nerds. But the big wall of glass jars of real loose-leaf tea was rather pretty, when the light hit it. If you squinted out the big narrow windows, you could see for miles over the Forest and the Lake and the ripples of the earth. The couches were squashy and their blue fabric was fun to run your hands over.\nDudley sat down next to Cho, trying not to tilt the cushions with his bulk and unbalance her. She was smaller than him, like most people, but she was all wiry muscles and broad shoulders. “Uh, hey,” he said. “You didn’t, um, you’re crying out here? So I’m figuring being alone kind of wasn’t the plan.”\nShe wiped one red, shining cheek with her sleeve and said, “I’m okay, Dursley.” Her voice sounded a little like she was talking underwater, which made sense, with all the crying. Dudley wondered what it had been like in the Lake, during Cedric’s second task.\n“Are you crying because of Cedric? Or because my cousin’s a bad kisser, because that’s what the people who went to Hogsmeade said.”\n“Yeah, well they’re full of crap,” said Cho, calmly drowning, and Dudley squeaked out a high-pitched little giggle of surprise. “You didn’t go to Hogsmeade?”\n“No,” said Dudley. “I was shelving books. Detention,” he lied, and squished the couch cushion under him with his big hands. “I, uh, I didn’t know him that well, or anything. Cedric, I mean. I know Harry, I mean, well, I guess. It was just-- he was nice.”\nCho reached out for a tissue and Dudley pushed the box closer to her. “He was,” she agreed.\n“Seemed like a good dancer, at the Ball,” Dudley said and Cho smiled slightly.\n“Not really.”\nDudley nodded, solemn. Cho was still crying. She wiped her face, then blew her nose on another tissue. Her cheeks were flushed, her hair sticking to the damp skin. She was still very pretty. “I’m sorry you’re so sad,” said Dudley. “D’you want… tea?”\nCho took a long breath and looked at him with her red-rimmed eyes and her dark eyelashes all sticking together in little clumps. “Okay, Dursley, let’s do tea.”\nDudley got them chamomile out of the pretty glass jars and heated up the water right on his second try at the spell. Penelope had taught him that one.\nCho was gone when he got back to the couch. Dudley stood there for a moment, holding the two steaming mugs next to the empty couch, but then she reappeared in the door to the girls’ dorms, carrying a box of sweets. She put them down on the table and Dudley handed her tea over.\n“So, Cedric was nice, you say?” Cho smiled at him. The light, which was dropping through the high windows, lighting up the glass jars of every kind of tea, and turning Penelope’s abandoned old sewer model gold and glinting, lit up the tear-streaks on her creasing cheeks.\nThe mug was hot in his hands, almost scalding, so he brought his palms up to it, and then away again. He held them up against the ceramic as long as he could, longer each time, just this side of burning. Dudley said, “He didn’t think I was dumb and he didn’t give up on me.”\n“Yeah,” said Cho. She was crying more now, but she didn’t seem to mind, exactly. “Yeah.”\n-\nThe same night that Harry and his friends descended into the Department of Mysteries, chasing of a bad dream, Minerva was in St. Mungo’s, staring up at the ceiling of her hospital room.\nHer chest ached from the four Stunning Spells she’d taken in the sternum when she’d protested Hagrid’s eviction. She didn’t know what her students were doing, in that moment. She didn’t know the way Ron clutched Ginny’s sweaty hand or the way Neville breathed slow and careful, trying to keep calm. Harry’s heart was playing anxious hummingbird in his chest, slamming against his ribcage.\nMinerva had known Sirius Black at eleven. She’d seen the furious, fast-thinking scowl on his face as the Sorting Hat came off his head. She had known him at fifteen, bumping shoulders with James, making Remus laugh. He’d been a bully. He’d been a friend. He’d walked with his head held high and scorned the young men who would have welcomed him to their smug clusters in the hallways, hissing pureblood hate. He’d walked away from his family, from easy answers and long legacies, and she’d thought him brave for that.\nShe had known him in school, and then in war-- a student and then an ally. She’d seen him asleep on meeting room tables or Remus’s shoulder. She’d seen him kill men with a streak of green fire and a steady hand, and she’d seen him fall apart after, seen James pull him aside to some place quiet.\nMinerva didn’t know if they’d ever met Regulus Black on the battlefield. She bet Sirius would have recognized his little brother, even with the mask. She thought about the way Sirius laughed at late nights, the way he tugged on Lily’s braids, the way he asked after Gideon’s nephews, and she bet, with the certainty of years removed, that even if Sirius had recognized Regulus through the mask and the hood, he still would have killed him. James would have picked up the pieces, after.\nMinerva had known Sirius for thirteen years as a mass-murderer, a liar, a prisoner rightfully punished, a retracted name, a mistake. She had known him for the last two years as an awkward godfather, a walking skeleton, a man both reborn and left behind. She didn’t know how to apologize.\nWhen Sirius died in the Department of Mysteries, Minerva turned over in her uncomfortable hospital cot. Moonlight fell through the window and the healing spells around her hummed endlessly. Four Stunning Spells to the chest-- she was getting too old to bounce back from something like that. That was how she felt, in that moment, at the death of a boy she had known in peace and war and grief: she felt old. She went to sleep.\nThey would tell her the news in the morning, an owl from Dumbledore the nurses would let in only because she intimidated them. She would think about all the ways she had known him. The healing spells would keep on humming.\nBits of the story would spread all through Hogwarts by the end of the next week, even up to the cold heights of Ravenclaw Tower. Cho Chang worked on homework, dry-eyed. Anthony Goldstein and Padma Patil cornered Luna with questions and follow-up questions, and Luna handed answers out like she handed out everything-- easily, sideways, precise in the places you didn’t expect.\nDudley sat on the couch, running his palms over the blue fabric in long slow sweeps. Anthony and Padma and Luna clustered on the far couch, but he could hear them, and he listened. The couch was soft under his hands.\nHe didn’t really know Sirius Black, other than from his wanted posters nailed up in Diagon Alley. He didn’t know him, so he didn’t care, really, but Dudley imagined Harry kneeling over the body, like with Cedric, fists clenched in his robes.\n6\nThat summer, the Dursleys were themselves. Dudley ate lettuce and got presents, went to boxing practice and cleaned up his bloody noses before Petunia could see.\nVernon watched the news and talked about how the female newscaster was getting fat and sloppy. Dudley slouched into the couch cushions, looking for mysterious fires or explosions or phenomena; looking for the wizards and their brimming war. If he slanted his eyes sideways from the TV to the chair on the far side of the sofa, he could see Harry sitting there, staring tightly at the screen, looking for the same thing. Dudley turned his eyes back to the screen and sunk lower into the cushions.\nFeeling stupid yet? He wrote Percy, sending it off with his little owl.\nSpot flapped back into his room later that night, and Percy’s ragged old owl came by a few days after. Percy had written, in his annoyingly excellent handwriting,  The world was not as I was expecting it. I thought something that bad couldn’t be true. I was wrong and now I don’t know what to do. \nHe followed this with four pages of petty complaining about the paperwork approvals system’s brokenness and the cabal of administrative assistants in his department. Dudley scratched under Percy’s owl’s chin.\nOn a rainy Sunday, while Petunia thought he was at Piers’s house, Dudley boarded a train for London. It would have been nice to use a Floo, but the 4 Privet Drive fireplace was still boarded over, and anyway no one had ever explained to Dudley how to use a Floo. Would it count as underage magic? Harry had done it, Dudley knew, but sometimes Harry was an exception to rules like that.\nDudley sat on the stiff seats of the train, tapping his fingers over the plastic edging and staring out the window. Trees zipped by. Sheep dotted the hills. The suburbs and then the city flooded past, overwriting all the greenery.\nPercy’s apartment was in a Muggle building, a few blocks from one of the Ministry entrances. Dudley didn’t think that was normal for wizards, but he wasn’t surprised either. He rang the bell outside and Percy buzzed him in.\nDudley had barely gotten a glance through the door before Percy’s owl divebombed him, hooting spoiled requests for scritches. It perched and preened on Dudley’s sweatered forearm while Percy let him in and laughed. “I see you’ve made a friend.”\n“I see you’re still ugly,” Dudley said, because it was the sort of thing they said in his letters, and Percy kept writing back so it must be okay. Percy snorted and went to put the kettle on the stove, so it probably was okay. His owl nibbled at Dudley’s sweater curiously, sifting through the lingering drops of rain.\nPercy talked about Ministry politics for ten minutes, and then about an offensive price hike at his favorite local bakery. Dudley reported his mother’s latest beef with the neighborhood association while he worked his way through his first cup of tea. When Percy reached over to fill Dudley’s mug a second time, he stopped talking. The pause sat between them, silent.\n“So, a Muggle apartment,” said Dudley. “How very Weasley of you. Sure you never flew a car through my house?”\n“I’m not that type of Weasley,” Percy said and put his hand over his face. The silence sat between them for another moment. “I don’t know how I’m supposed to talk to them, now, after I’ve been so idiotic.”\n“You’re like the dumbest person I know,” Dudley agreed, friendly.\nPercy’s hair was a mess, a little too long and tangled behind his ears. Dudley reached out and stole a gingersnap as Percy said in a rush, “Dad could have  died, and I didn’t even visit-- the last thing I would have said to him would have been to call him a disgrace. How do you say sorry for that?”\n“I don’t know,” said Dudley. “Maybe you don’t, maybe it’s too big for that.”\n“They must hate me.”\n“I bet they don’t,” said Dudley. The bulky knitted blanket tucked neatly over the back of Dudley’s chair was all big clumps of autumn colors, and it was warm under his back. Framed up on the wall was a newspaper clipping of the Weasleys beside a pyramid, and every black and white figure was grinning and waving hard. “Ask them.”\n“What? Ask them if they hate me?”\nSometimes words mattered. Sometimes they saved lives. Sometimes a girl with bubblegum hair stopped to roll her eyes at a boy who had never lived in a world where tantrums weren’t the answer. Sometimes a boy who had followed the rules all his life, who had listened to his teachers and his superiors and his bosses, who had been rewarded for doing, for obeying, and not for thinking-- sometimes he needed to be reminded that he came from a family of good-hearted troublemakers.\n“Sure.” Dudley shrugged. “Or ask them what you can do, you know, other than say sorry.” He turned his tea on the little side table, pressing his fingers against the ceramic until they got too hot, then pulling them away again. He pushed at the mug, scraping it along the table, before he said, “You’re feeling like you’ve screwed it up too much for a sorry to ever be enough. So don’t just say sorry. You have to ask, if you want things to change, or happen.” He pressed his fingers back against the mug. “Your family’s loud and dumb, but like you seem to want them.”\n“Yeah,” said Percy. “Yes.” He put one big hand over his face. Dudley took another cookie.\n-\nThat year, in the stereo surround sound of a Pensieve, Harry Potter witnessed one of Snape’s worst memories. For Snape, it was the bile he spat at Lily Evans’s feet that haunted that memory. Severus could still taste the round syllables of  Mudblood skating over his tongue. That was the thing that sat in his Pensieve: the retrospective realization that it was in that moment that he lost her. He crossed a line in the sand that turned out to be a chasm.\nHarry sat in that moment, sixteen years old and on his way to becoming whatever man he was going to be. He watched his mother run, angry, across the green grass. She was his age. She could have been a white, ginger Hermione, coming down like an furious steam train to slap Draco Malfoy across his smug face.\nBut it wasn’t Draco standing smug and preening there, another boy helpless at the end of his wand. James Potter grinned at Sirius Black-- sixteen, flushed with health, their dark hair pushed rakishly back-- and Sirius grinned back. Harry scuffed his sneakers on the grass. Lily’s shout filled the thick air of the Pensieve, James’s laugh echoed, and Harry could hear his own heart beating and beating in his chest.\nEveryone always told Harry he looked like his father. James’s young, bright face was turned up to the sky, watching Severus’s miserable form, flicking glances over to Lily’s pretty fury, and Harry hoped he had never looked like this.\nThis was Snape’s memory, but it belonged to Lily, too, and James and Sirius. It was Harry’s, too, now, and it would lurk in his chest for years, whispering about all the terrible things he could become.\nHarry sat on the green grass of Severus Snape’s worst memory, until the man himself came and yanked him out of it. Snape towered over him and Harry looked back, filled with pity and with fear.\nSeverus Snape’s worst memory was one regretted. So was Albus Dumbledore’s-- every word of the argument rolled over his tongue, every curse he and Aberforth and Gellert had thrown. He never knew which one of them it was who cast the curse that killed Ariana. Albus didn’t look. He didn’t ask. He regretted.\nThis would not be Harry’s worst memory, these borrowed grass stains, the stolen glimpse at his father’s cruelty, this forced empathy with his worst bully’s misery. He had worse things to carry. But this would always linger, a fear rising up whenever he smirked too much with a wand in his hand.\nMinerva didn’t rank things like that-- not in worsts and not in bests. She filed thoughts away and revisited them on rainy evenings. But she remembered that smile, too, James Potter at sixteen with so much to prove. He’d been looking for a laugh. He’d been leaning into Sirius’s shoulder. She remembered seeing Harry’s gaunt, bowed shoulders at eleven and wishing him some of that sunlight, some of that smile.\nIf someone had sat Dudley Dursley down with a test and a number two pencil, and asked him about his worst memory, what would he have answered? What would he have written out in those painstaking big block letters? Would he have answered differently with a quill or a ballpoint pen, the nib scratching along the paper?\nDudley got less detentions in his sixth year at Hogwarts, but when his brain started to spit and hiss like bacon burning on the stove, he went down to the library and reshelved books anyway. There was something soothing about putting things where they were supposed to go, to knowing the answers to unimportant questions.\nHe went down to the edge of the Forest to throw pebbles at Hagrid’s giant pumpkins and get invited in for tea and rock cakes. Hagrid’s teacups were actually mugs, big and warm and chipped. Care of Magical Creatures was still Dudley’s favorite class, even if he was finally skating by okay in Charms.\nDudley felt too big, a lot of the time-- sitting with Cho on the sofa, or sifting his fat fingers through Luna’s beads when she was jewelry-making, or any time his mother handed him a quarter grapefruit with her bony little hands. But he cradled Hagrid’s teacup in his hands, looking at the golden tea and the small blue-painted flowers, and felt like something was, for once, the right size in his soft pink palms.\nDudley looked like his father, but he had his mother’s watery blue eyes. He was never going to grow up to be anything other than big. He sat in Hagrid’s cluttered little hut, the sort of place that would have had Petunia calling for an exterminator, and held a warm porcelain mug that filled up the whole of his hands.\nHe looked like his father. Somewhere in Dudley’s memories, Vernon’s fist hit the dinner table and Harry flinched.\nHagrid roused the fire when the afternoons got cold. Hagrid moved among stalks of drying herbs and hanging bird cages, smiling just a little on his big broad face whenever one started up a little trill of a tune. Hagrid filled the whole space, but he fit-- he didn’t knock his head on the rafters or bump the chairs or stub his toe on the listing bags of feed. He reached up easy onto the highest shelf and brought down some more sugar for the table.\n“Thanks,” said Dudley, and passed him the cream when Hagrid asked for it. \n-\nIt was a peaceful year, until it wasn’t. Hogwarts didn’t get cable news, but Dudley still filched leftover Daily Prophets from the tables in the Ravenclaw Tower. Hermione Granger sicced a flock of enchanted birds on Ron Weasley; Filius sent Minerva silent judge-y looks in the Great Hall until she finally caved and pulled the two of them each aside to talk about Feelings and How to Express Them Healthily.\nIt was a peaceful year, until it wasn’t.\nSeverus had the Dark Mark, so the barrier around the top floor of the Astronomy Tower let him pass through, that night.\nHe had Minerva’s trust--no, he had Albus’s trust, and Albus had Minerva’s-- and so she let him pass by, too. She was still attacking the barrier, on the stairwell, still trying to get through, when Albus’s body hit the courtyard below.\nMinerva had known Albus as a teacher, as an ally, as a friend and a confidante. She’d known him silly and kind and terrifying. She’d known him bent over his desk under the worst weight of the war, and there were so many things she hadn’t said.\nShe didn’t say them now. She drew her wand. She cleared the castle with the other professors and the fledgling DA. She heard Harry Potter scream  coward  as he chased Severus Snape from the grounds.\nAt the funeral, she walked down to the front of the long full rows of chairs and spoke about decency, sacrifice, and intelligence. She talked about Gryffindor, and the ways in which Albus had personified the best of that House. She called him her dear friend and then she sat back down.\nShe didn’t say, “You idiot.”\nShe didn’t say, “How dare you leave us, now, here, at the beginning of a war I don’t know how to win? You selfish, secretive, dramatic piece of shit, how is it even possible you can be dead?\nShe didn’t say, “You taught me Transfiguration. You led us through that first war, and all that came after. You gave me a path, when I was fourteen and reading aloud to ghosts in bathrooms and dreaming of going back to the farm. I fell in love with magic in your classroom, under your twinkling goddamn eye, and I have given up everything to have this world-- to live in it, to witness it, to protect it for the children.\nShe didn’t say, “I don’t know how Hogwarts can exist without you, Albus. I’m so angry with you and I don’t know if that will ever go away. I’m so angry with myself and I know, when you lose someone you could have saved, maybe, if you had just-- I  know that anger never goes away.\n“But maybe this will. I miss you already. I’ve already reached for your support, your advice, your knowledge so many times and found myself slipping because you aren’t here. You have  been Hogwarts, for decades. You were the safest haven we had, and I don’t know how to do this.”\nShe didn’t say any of it. She listened to Flitwick’s speech; she spotted Aberforth in the audience. She watched how still Harry’s shoulders were, in his nondescript back row. The castle rose up above the green field, above the figures moving and murmuring in their chairs.\n7\nThat summer, wizards descended on 4 Privet Drive. His parents were impressed because Kingsley Shacklebolt had been on television with the prime minister, and knew how to wear a suit, but they eyed every other member of the gathered Order protection detail suspiciously.\nDudley packed his bags and hauled them down to the front lawn while Petunia kept arguing with Shacklebolt in hissed whispers on the front lawn. He thought about suggesting they bring the conversation inside, but he didn’t. With no neighbors to see, his mother might be less offended by every wand and colorful robe, but she’d also be much more comfortable really ripping into them. She was basically convinced now, anyway; this was just noise.\nOne of them, a very small man in purple, introduced himself as Dedalus Diggle. Dudley, clutching at Spot’s cage, realized he knew him-- seven years ago, in the Leaky Cauldron, this man had shaken Harry’s hand and Dudley hadn’t understood it, not then.\n“Very clever of you, sir, very clever,” Dedalus told Vernon brightly, looking over his shoulder through the open car door. “I personally would be utterly bamboozled by all those buttons and knobs.”\n“Why isn’t Harry coming with us?” Dudley didn’t ask it of his parents. He turned to Shacklebolt, frowning. “If people are coming-- Death Eaters--”\n“Death  Eaters?” Vernon scoffed. “What sort of dumb name is that?”\n“Mr. Shacklebolt,” said Dudley.\n“He’ll be safe with us, lad,” Shacklebolt said.\nDudley nodded slowly.\n“You’re at Hogwarts, too, right?” Hestia Jones said encouragingly. “What House?”\n“Ravenclaw,” said Dudley and Jones smiled. Petunia’s face went pale and pinched.\n“Yes, I can see you thinking there.”\nDudley lifted his eyes to glance at Jones, then dropped them again. He scraped his shoes on the gravel. He looked up at Harry. “It’s ‘cause you’re joining up, aren’t you?” he said. “You’re going to fight.”\n“Yeah,” said Harry. “That’s not really news, Dudley.”\nDudley nodded again, still slow. “Okay,” he said. He looked down at the bags at his feet, the cage still clutched in his big hands. “Okay,” he said. “Mum,” he said and looked up at her. “Dad. I’ll write, okay?”\n“Mr. Dursley,” said Shacklebolt. “I’m afraid we can’t--”\nDudley shook his head. “Did I ask you to take me with you?” he snapped, and then back-pedaled. “I know. Whatever. I’m just--” He turned back to his parents. “I can’t go with you.”\nDudley had been eleven once, screaming in his father’s face in a cabin on an island in the sea, because he wanted something and his father wouldn’t let him have it. Because Harry was getting something, and Dudley didn’t want to be left out. He had pummeled his father’s stomach with his fists. He had kicked his shins. He had screamed.\nHis father was raising his voice now. His mother’s was climbing, like Harry was climbing into the passenger’s seat of a flying car, like he’d burnt the bacon, like Dudley wanted to walk alone to boxing practice.\nDudley had been fifteen, dripping sweat on his mother’s counters, while his father thundered threats. He had dropped his own ultimatum. He had walked away. Harry had left, anyway, and Dudley had sat through that long sticky summer, wondering if there would even be a Hogwarts to come back to.\nDudley was seventeen, and he had lived six autumns, winters, and springs out from under his parents’ roof. “Don’t die,” he said to Harry, over his father’s bellow. He adjusted his grip on Spot’s cage. He grabbed the rest of his bags. He walked away and didn’t stop until they were all out of sight.\nOn an empty street corner, Dudley put down his bags and fished in his pockets, making sure he had enough Muggle money for the train fare to London. He had a stop to make first, however.\n-\nPiers choked on his soda.\n“I’m a wizard,” Dudley added helpfully. “So is Harry. And they’re having a war.” Dudley blinked and buried his fists into the big pockets of his blue jeans. “We,” he said. “We’re having a war. So I gotta go help.”\n“You’re a wizard,  what,” said Piers, who had finally caught his breath. “Long beard, glowy staff, pointy hat? What the fuck, D. You go to a  wizard school?”\n“We do actually wear pointy hats,” said Dudley.\n“This is the dumbest prank, Dud. it’s a-- it’s a  dud.”\n“That is the worst pun.”\n“Thank  you.”\n“That horse was actually a hippogriff named Buckbeak,” said Dudley. “Harry’s like some infant folk hero, it’s a long story. There’s this crazy guy without a nose, and he wants to kill everyone. Everyone like me, and Mum and Dad, and you.”\nDudley was over twice Piers’s size at this point. He tried not to corner him, letting the pretty morning sunlight dapple the sidewalk between them. Piers’s sharp little nose was sweating. “Duds, stop being weird.”\n“I wanted you to know, because the Muggles don’t know-- Muggles, that means not magical, people like your family-- the Muggles don’t know, but they get hurt, anyway.”\n“Like that time with the-- with that gas leak, or whatever,” said Piers, his voice cracking under the memory.\n“They’re called dementors. They’ve got big black cloaks, and something ugly under it, but you can only see them if you’re a wizard. Or a witch, I guess.”\n“Dudley, do you understand how bonkers this sounds?”\n“If something feels wrong, just get out of there, okay? Just be careful. You can trust Mrs. Figg, the weird cat lady, she’s like a witchy spy, sort of? She can’t do much herself, but she’ll know what you’re talking about.” Dudley shuffled his feet side to side for a moment, then stepped forward and crushed Piers in a hug.\nPiers squeaked. He was not a large young man, at seventeen, but he was dense with muscle from boxing class and swim club after school. Dudley shoved his face against his friend’s warm shoulder and Piers lifted up his arms and squeezed back. “Okay, Big D,” he said. “Okay.”\n-\nPercy was still in the same drab Muggle apartment. He didn’t have his bags packed when Dudley bustled through his front door, which only went to show maybe Gryffindor was the dumb house after all.\n“Aren’t we going?” Dudley said, dropping his own bag on Percy’s spindly kitchen stool. Percy was trying to be stern, bunching his thin ginger eyebrows together, but he just looked like an opinionated paper clip. “I sent Spot ahead to warn you.”\nPercy stalked after him, across the like three square feet of the flat and into the bare kitchenette. “Dudley, I have a  job .”\n“Cease the means of production,” Dudley said, but he didn’t think he got the words right. “Percy, come on, your bosses are like the manifestation of evil, especially now.” He flapped his hands at Percy, waving him toward his uneven set of drawers and neat piles of laundry. “Pack a bag, call your brothers, ask them how we can help.”\n“Why don’t you ask your  cousin?” Percy said stiffly.\n“Because I used to put his head in the toilet and flush it, okay, now hurry up.”\nDudley watched carefully while Percy put in the Floo call, because he figured he better learn how to do this now. “Send an owl, dumbass, they’re listening to the Floo,” George hissed when they go through to him. Dudley offered up Spot, because he seemed more likely to make it back from the journey than Percy’s balding bird.\nDudley sat around Percy’s flat, going systematically through his kitchen cabinets, while Percy went back to work the next day. “No reason to warn them early, if I’m going to disappear,” Percy had told him too haughtily in the too early morning. “And, anyway, I have some loose ends to tie up and I’d rather not leave my co-workers scrambling to reach deadlines when I abandon them in the crunch.”\nDudley had thrown a pillow at him. Percy had wrinkled his brow like he wasn’t sure what had prompted that.\nSpot arrived that evening, bearing news. It turned out Lee Jordan was starting a radio station to keep the resistance informed and chipper, and looking for operatives/reporters/agents.  Dursley can be our coffee boy , Lee wrote, and Dudley rolled his eyes and badgered Percy into properly packing his bags.  \n-\n“That Sue Li girl is still brewing up Polyjuice to spy on Dumb and Dumber,” Myrtle said. The faucet, which Minerva could see through her translucence, tripped with maddening irregularity. Minerva was going to have to learn more plumbing spells than she’d ever bothered with before, if she was going to keep coming down here.\nMinerva put a hand over her eyes, leaning forward on the little cushioned stool she’d summoned for herself. “Please tell her to be careful.”\n“I’m keeping an eye, I’m keeping an eye,” Myrtle said. “And the Bloody Baron didn’t  say  he was, but he keeps conveniently knocking over suits of armor whenever her cover seems maybe about to get blown. So, you know.”\n“He always was an old softie,” said Minerva. She dropped her hand.\n“Knight to F6, by the way,” Myrtle added. Minerva nodded and reached out to move Myrtle’s piece for her.\nThe radio beside them staticked into full volume. “--a warm welcome to our special guest, our Order of the Phoenix liaison, Rainbow!” \n\n “Thanks, River, you always know how to make a girl feel appreciated.” \n\nMinerva looked down at the straight, even lines of the chessboard-- squares of buttery golden wood laid up against ones of dark charcoal. The pieces had weight, heft. Minerva liked to play Muggle chess now and again. It was what she had grown up on and she liked the weight of it in her hands.\nShe wondered why Lee had chosen “River.” The Jordan, certainly. But maybe it was his first name, too-- there was a Lee River in Ireland. Maybe it meant something to him. Once upon a time she had written a letter to him and his family, had penned it and folded it and put it in an envelope and written the address on the front, but for the life of her she couldn’t remember it. How many letters had she written, how many Hogwarts acceptances? How many apologies? I am sorry to inform you--\n“So Rainbow, we’ve brought you in to clear up some of the rumors that have been flying around about that latest hubbub over in Kent. You were out there as part of the action, is that right? ”\n“That’s right. It was a dark and stormy night, River, and let me tell you, I didn’t bring my rainboots. We got sent in trying to pick up some vulnerable, anonymous persons to move to a safer spot.” \n\n “And then--!” \n\n “Thanks for the dramatic interjection,” Rainbow said, dry.\nMinerva smiled. She hadn’t been in Gryffindor, but Minerva knew that voice all the same.\n “And  then  , not as much as could have happened, really. There was a fire fight-- I know you’ve had listeners calling in about it-- but thanks to our tips from your station we were able to head off the ambush and go in prepared.” \n “Listeners,”  said River.  “I’m not sure if you’re aware, but our tip line receives hundreds of Floo calls, owls, and whispers every day. A lot of it is nonsense-- yes, you know who you are-- and all of it needs to be distilled, archived, and followed up on.” \nMinerva had known Lee as someone she had to interrupt, someone she had to stifle, up far above a green Quidditch pitch in a stuffy announcer’s booth. He had been sixteen and terrible with it, grinning and brilliant and spitting out cheerful vitriol at Slytherin’s fouler fouls.\nHe had said so many things that she hadn’t been able to. Minerva had held her tongue so many times in her life.\nShe reached out now and moved a piece, taking one of Myrtle’s bishops. Myrtle blew a raspberry and Minerva grinned at her.\n“That set of tips was collected and collated by our intern, uh, Pumpkin. He’s a recent addition, but his ability to listen to our tip line for eight straight hours and not go crazy has really endeared him to us.”\n“I’m not your intern,” said a new voice, and Minerva knew that combative, whining cadence.\n“My  remaining  bishop to E4,” Myrtle said, pouting. Minerva moved her piece, then studied the board.\n“Well, we don’t pay you,” River explained.\n“I’m a  volunteer.”\n“Aren’t you pedantic,” River said cheerily. Pumpkin snorted and moved away from the microphone.\n“House of the smarties,” announced Rainbow and let out a donkey bray of a laugh.\nThere were Death Eaters running Hogwarts. There were so many things Minerva wasn't saying. But she watched over the children-- watched them lying, fighting back, refusing to be broken-- and kept them safe when she could. She remembered Fred and George's fireworks, and missed them, and heard reports of their antics and adventures out in the world.\nShe sat in this dripping, locked bathroom once a week and listened to what her children were becoming. She sat and she weighed chess pieces in her palms, thinking, breathing, ready for the fight. She, too, was still becoming.\n-\nThe cafe where they’d recorded Lee’s latest episode of Pottercast was closed Wednesdays, which was why the sympathetic owner had let them borrow the space. The thick curtains were drawn across the windows. Light squirmed through the gaps in them and lit up Fred’s thick protection spells-- against detection, interference, and anyone hearing Tonks’s laugh resounding off the walls.\n“You should be our guest star every time,” Dudley told her, picking at the sofa cushions under him. At the next little circle of couches and small tables, the twins and Lee had broken out a game of Exploding Snap. Percy would be back soon, from the latest scouting trip, and Dudley had a billion tips to sort and archive away, but it was nice to sit and watch Tonks grin at him.\n“My little first-year, all grown up and gone to war,” Tonks said. “Lee said you’ve been here three months, now? And not a single letter.”\nShe tapped his nose accusingly and Dudley scowled at her. “I’ve been busy! This tip line is worse than the returns bin at the library by like a hundred. It’s terrible.”\nHer eyes were warm-- a brown today, deep and filled with sunlight even in this dark room. “I’m really proud of you, Duds, honestly. You’ve come a damn long way.”\n“I just grew up,” Dudley complained. “It’s not a big deal. Remember that mullet phase of yours? You did weird stuff too, when you were small and dumb.”\nTonks shook her head. \"I don't know what you would be like if we'd left you with those Muggles.\" \nDudley looked at his knees for a long moment, while Tonks frowned into the pause, concerned. “Duds?”\n\"It's not because they're Muggles,\" Dudley said finally. “You shouldn’t say that.”  \n\"What?\" \n\"Mum and dad-- I know they're not... right. They love me, but they're not...\" He shook his head. \"It's not because they're Muggles, it's because they're bullies.\" \nTonks looked at him for a long moment, and then reached out and brushed his bangs off his forehead. \"Yeah,\" she said. \"Yeah, kiddo.\" When she put her arm around his shoulders, he leaned into her, staring down through blurred vision at her stripey socks. \n\"They tried,\" Dudley said, and he could feel the weight of her cheek on the top of his head. Across the room George’s Exploding Snap cards went bang, and Lee threw himself back in his chair, laughing.\nNot all of them would live through this-- through these long cold days and the end of the war. They wouldn’t all make it to the riotous after-party full of fireworks and Firewhiskey. They wouldn’t all make it to see Hogwarts rebuilt or to see this become chapters in history books droningly recounted by Professor Binns. They wouldn’t all make it to a train platform, nineteen years later.\nBut Percy would stalk in, sometime soon, and fix all the cushions on all the chairs, and quiz everybody up and down until he knew exactly how many Sickles and Knuts to leave behind to account for the day-old scones they’d stolen from behind the counter. Fred and George would finish each other’s sentences, but so would Lee.\nOn the rare occasion when Dudley stumbled out a punchline they’d all turn to him and beam encouragingly. They’d laugh even when it wasn’t funny. They’d laugh hard enough that they’d make it funny and Dudley would stand there, giggling too, with his stomach shaking and something warm growing under his breastbone.\nThey wouldn’t all make it. But they would remember this moment, or be remembered in it, every one of them.\nDudley leaned into Tonks’s shoulder. He was big, almost fully grown now, but he didn’t worry about crushing her under his weight. It was Tonks-- there was nothing she wasn’t strong enough for. And if she wanted him to move, she’d tell him so.\nLee and George were calling to Tonks, calling her  Rainbow , while she laughed and said, “I can’t believe you named me that.”\n“Hey, he tried to name  me  Weasel!”\n“No, Weasel was  George--  you’re Rodent, Freddikins.” Lee grinned, easy and wide, even as Fred lobbed a pillow at his face.\n“Oh a throw and a miss from Weasley!” Lee crowed, toppling over as Fred launched himself at him. “You can tell that Chaser isn’t his natural position!”\nThey wouldn’t all survive this. But they were here, and the room was cozy and dim. The couches were soft under Dudley’s hands. There was a bell’s jingle as Percy pushed through the back door, shaking snow from his boots and blowing into his hands. \nGeorge grinned, lobbing Bertie Botts’s beans at Lee and Fred wrestling on the opposite couch. Tonks was laughing and Dudley could feel her shoulders shaking under the weight of him-- with joy, with ease, with an unwinding desperation here in this warm, hidden room. \n Remember. \nHe wanted to remember this. He wanted Tonks to be always laughing. He wanted Percy to walk always into warm rooms full of his brothers, their voices filling up the whole space.\nDudley closed his eyes. Through the closing door, the last gust of cold air kissed his face. Tonks didn't stop laughing. "
}