{
    "id": "1668068",
    "url": "https://archiveofourown.org/works/1668068?view_full_work=true",
    "author": [
        "WhatTheBodyGraspsNot"
    ],
    "title": "5 times Bucky and Steve were Unnaturally Comfortable Around Each Other, and the 1 Time They Weren’t",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Captain America (Movies)"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Steve Rogers",
        "Tony Stark/Clint Barton if you squint really hard and want it to be"
    ],
    "characters": [
        "James \"Bucky\" Barnes",
        "Steve Rogers",
        "Tony Stark",
        "Clint Barton",
        "Natasha Romanov",
        "Bruce Banner",
        "Thor (Marvel)",
        "Jarvis (Iron Man movies)"
    ],
    "additional_tags": [
        "5 Times",
        "and 1 Time",
        "Oblivious!Steve/Bucky",
        "Scheming!Tony&Clint",
        "Masturbation",
        "First Kiss",
        "Explicit Language",
        "Fluff",
        "Light Angst",
        "Humor"
    ],
    "language": "English",
    "series": "",
    "published": "2014-05-21",
    "completed": null,
    "words": "5,238",
    "chapters": "1/1",
    "comments": "369",
    "kudos": "19,152",
    "bookmarks": "2,989",
    "hits": "188,094",
    "summary": "<p>\"Steve gently tosses his book to the side and then places his hands on Bucky’s shoulders, kneading thoroughly against the impressively tense muscles. Bucky sighs, his eyes falling shut and mouth dropping open in a mixture of slight pain but mostly relief.</p>\n<p>“Oh fuck,” he groans, leaning into the touch.</p>\n<p>Clint snickers quietly, trying to busy himself with pouring milk into a bowl of cereal before one of his trademark sarcastic comments can escape him and make the situation more awkward than it’s already quickly becoming.\"</p>\n<p>OR: Five times Steve and Bucky should have been uncomfortable but weren't, so Tony and Clint devise a plan to prove that they're sleeping together (even though they aren't, they're just really really oblivious).</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>Thanks for reading! :) Please feel free to leave a comment if the spirit moves you.</p>",
    "text": " \n1.\nThe other fellow Avengers notice it right away—this beyond-comfortable vibe that consistently floats between Bucky and Steve.  Maybe it’s how there doesn’t seem to be any kind of personal space between them.  Maybe it’s how they know nearly all there is to know about each other.  Maybe it’s how they often find themselves in situations that others would deem uncomfortable, but they don’t even bat an eyelash.\nIt hasn’t been a week before Bucky enters the common area in Avengers Tower, groaning about the tension in his shoulders. Bruce offhandedly mentions a treatment that he learned during his own bouts of stress, to which Bucky mutters some noncommittal grunt of thanks before plopping down and settling between Steve’s legs on the floor, his back to Steve’s chest.\nThe glance between Natasha and Clint is quick but pointed.\nSteve gently tosses his book to the side and then places his hands on Bucky’s shoulders, kneading thoroughly against the impressively tense muscles. Bucky sighs, his eyes falling shut and mouth dropping open in a mixture of slight pain but mostly relief.\n“Oh fuck,” he groans, leaning into the touch.\nClint snickers quietly, trying to busy himself with pouring milk into a bowl of cereal before one of his trademark sarcastic comments can escape him and make the situation more awkward than it’s already quickly becoming.\nSteve slides his left hand over just a touch, massaging into a particularly tense spot that makes Bucky drop his head, eyes still closed. “Right there?”\nBucky moans quietly, his body relaxing against Steve’s hands. “Fuck, Steve.”\nIf either of them really cared, or really considered that this might not be the way a normal pair of men might interact with each other, they might have noticed how Tony has halted mid-step in the doorway, an eyebrow raised as he glances in.\nAnd Clint’s just staring into his bowl, trying so hard not to grin with a mouthful of cereal but failing miserably because really? How can these two not realize what they sound like right now?\nTony sticks his head in the doorway. “Hey Buck Rogers, you’re not slumming it anymore, you know,” he says, trying to be helpful, “We have people for that kind of stuff now. Trained people. Masseurs and whatnot.”\nBut Bucky lets out another quiet little moan as that super tense spot gets rubbed out satisfyingly. “Steve knows how I like it.”\nThere’s a sputtering sound from over by the sink where Clint has finally lost all ability to reign himself in, that last comment enough to pull a pointed laugh out of him, cereal spraying everywhere.\nTony examines the spectacle that the common area has become before turning on his heels, wondering why he even stopped in the first place. “I bet he does.”\n \n \n2.\nIt’s not that they’re super affectionate toward one another, it’s just that there’s usually a whole lot of unnecessary touching when it comes to carrying out the simplest of tasks. Or like, it’s possible to sit on the gigantic half-moon couch that everyone shares without practically being in the other’s left pocket. But yet and still…\nAnd it’s not as if they’re aware that they’re doing it either, Clint and Tony eventually realize. It’s totally normal for Steve and Bucky to nearly mold into one being whenever they’re near each other.\nClint chuckles like he’s five. Tony does too, let’s not deny it, but he also wants to maybe test out a theory he has. Like how Steve and Bucky don’t bat an eyelash at sharing food or whatever they might be drinking at the time.\nSteve’s at the counter one morning, groggy as fuck as he sips the coffee that he’s poured into his gigantic red mug. He’s about to dive back in for another drink when Bucky appears, hair defying gravity as it sticks in every direction imaginable. And not even touching on the fact that that’s definitely Steve’s shirt that he’s wearing because it’s way too big on him, the calm between them isn’t so much as nudged out of place as Bucky reaches out, his hand clamping down on Steve’s giant red mug and pulling it out of his friend’s grasp.  He downs half the cup at an impressive speed, his head tipping back and throat working smoothly as he swallows the life-source that he’s learned to run on.\nThen he hands the mug back to Steve without looking, who doesn’t even react except for taking another sip as he goes over to the coffee pot for a refill. Like it’s no big deal. Like they do it every morning. Because they do.\n“Plenty of mugs in the cabinet, you know,” Tony says, but his eyes are locked onto the smirk that’s slowly stretching across Clint’s face as he looks at him.\nBucky and Steve shrug. In unison.\n“They’re best friends,” Natasha states warily that night when Clint and Tony corner her and ask for an opinion.\n“Germs,” Tony declares, his hands gesturing plainly as if to make his point. “Disease. Mouth herpes. Should I continue?”\n“I’d rather you didn’t.”\n“Listen, all I’m saying is there has to be a reason they’re so touchy feely all the time.”\nNatasha raises an eyebrow at him, realizing now that she probably won’t get back to her mission research as soon as she wants to. So she says it again. “They’re best friends.”\n \n \n3.\nBucky likes Clint, he’ll admit it. Coming across a kindred spirit in sarcasm is a difficult task, and Bucky thinks he might have just found one. Even now, as they sit in Steve’s living room while said blonde is too busy taking a shower in the adjacent bathroom to join them, Clint and Bucky are knee-deep in a hard-hitting debate.\n“I’m just saying your hair is like, beyond poofy today.”\nBucky frowns, fighting the urge to run a hand through his hair self consciously. “Fuck off, it’s always like this.”\n“It’s not.”\n“What’s the problem?”\n“No problem—you’re just channeling some Edward Cullen today.”\nBucky frowns again, his eyes narrowing. “Who is that? Is that a singer?”\nClint chuckles, so irrationally amused by moments like these when popular culture references are completely lost on Bucky and Steve. He repositions himself on the couch, slinging an arm over the back of it as he does a quick Google search on his phone, pulling up a picture of the mentioned fictional vampire.\nWhen the screen is turned toward him, Bucky scowls, clearly unimpressed. “I don’t look anything like that.”\n“I’m sure you guys use the same shampoo,” Clint grins wildly, scanning through the rest of the pictures for more ammunition, “Some kinda girly shit.”\n“I do not.” Bucky is getting riled up now, and Clint just loves pushing his buttons.\n“Probably strawberry-kiwi,” he continues, “Or no wait—what’s that stuff called…?”\nBucky’s posture straightens, frown etched dangerously across his face as Clint continues listing as many girly scents as he can think of, including but not limited to vanilla bean, sweet pea, and fairy dust—which Bucky is fairly certain isn’t even a scent.\nThen Bucky stands up, determination blazing in his eyes, leaving Clint to watch, puzzled from the couch as Bucky wrenches the door to the bathroom open. The living room is immediately filled with the sound of running water and hot steam.\n“STEVE,” Bucky says without hesitation, his entire body disappearing behind the door, “Throw me my shampoo.”\nThe shower door isn’t tinted. Not even a little bit. So Steve’s confused expression is completely visible through it (along with…well everything else). “What? Why?”\n“Clint is being a dick.”\nAnd it must be a feasible excuse, because Steve tilts his face under the stream of water before grabbing the bottle of shampoo from the hanging wrack in the shower, sliding the door open and sticking his arm out.\nBucky advances quickly, grabbing the bottle out of Steve’s hand with a short “Thanks,” before emerging back into the cool air of the living room and slamming the shampoo down on the table in front of Clint with gusto.\n“Fuck. You.” He says with this sort of proud little grin because how did things escalate so quickly that he has to prove that he doesn’t use women’s soap?\nBut Clint isn’t even really focusing on that whole thing anymore, he’s more-so just sitting there, mouth slightly parted and eyes still fixed on the bathroom door.\n“He just barged in there?” Tony is equally engrossed by the gossip once Clint weasels his way back to the common area.\n“Yep.”\n“And Rogers. He was just—letting the flag fly?”\n“Yep.”\n“No eye-covering? No discretion of any sort?”\n“Nope.”\nNatasha sighs from across the room, clearly over it before it has begun. “They grew up together, for God’s sake,” she drones.\n“Yes and they’re grown now. Big boys,” Tony huffs because why does she have to keep stifling his fun? “Let me have this one thing.”\nBut Natasha doesn’t even look up from her notes. “I’m sure it isn’t anything they haven’t seen before.”\n \n \n4.\nThis notion, the one where Bucky has seen all of Steve already and Steve has seen all of Bucky already, well it’s made pretty clear a few nights later.\nBi-monthly trivia night is being held in Bucky’s living room for some God-forsaken reason. Bucky protests and protests and protests until Steve pouts at him, his big blue puppy dog eyes proving to be too much to handle so it ends up being: “God damn it, fine.”\nBut Bucky shuts himself away in his room because he doesn’t exactly feel like camaraderie through trivia games, plus he knows jack shit about whatever the questions will be about, unless they’re all pre-1950 (which he doubts).\nAnd he is correct. There’s only a thin spattering of questions that extend past the 70’s, and with every card that’s drawn from the deck, Steve’s sad little player piece begins to lag behind the others' on the game board. The only one who’s doing worse than him is Thor. He hasn’t moved at all. Not even one space. But he’s still overwhelmed with joy, going on and on about comradeship and whatnot.\nThere’s a question about Star Wars and Steve answers so vaguely that everyone feels bad for him and gives him a pity point. He’ll take what he can get.\n“Here’s one for you, Steve,” Natasha—who has been slyly giving him answers from across the table all night—says, staring down at the card in her hand. “What 1930 war film won an Oscar for ‘Best Picture’?”\nTony raises an eyebrow. “That’s oddly off-base. Is that even the question? Did you just make that up for him?”\nBut Steve’s mind is spinning like crazy because he knows this. He knows this. Visions of a damp movie theatre and stale popcorn flood towards him, Bucky to his left. They had seen this together. He had been so excited and felt so important because it kind of felt like he was seeing history in the making, his eyes taking in all he could from the Oscar-winner. “Shoot,” Steve mutters now, brow furrowed in concentration. And then. “Wait, I bet Bucky knows.”\n“Um, excuse me, cheating,” Tony states, pointing at Steve, who is already disappearing into the hallway. “That’s textbook cheating.”\n“He’s fourteen spaces behind you,” Natasha smiles, “Let him have this one.”\nSteve nearly runs down the hallway, Tony and Natasha’s bickering fading not completely out of earshot as he reaches Bucky’s closed door. And the adrenaline and sheer happiness from the possibility of actually answering one of these questions correctly briefly pushes away his manners, because then he’s swinging Bucky’s door open, his voice urgent, “Buck! What’s the name of that—oh…”\nSteve stops, his hand still on the doorknob although his entire body is already in the doorway, a perfect front seat to see Bucky deep in the throes of jerking himself off: jeans pushed down around his ankles, bare chest, his face scrunched up in this look of pleasure as his hand works vigorously against himself.\nSteve’s ears finally filter in the hitched little breaths and quiet noises Bucky’s making. “Never mind, I’ll just—”\n“No wait,” Bucky breathes out hotly, his hand never leaving his body or even slowing, “Wait just gimme a—fuck, so close.”\nAnd then he’s coming, strong and shameless onto his chest, his head thrown backward against the pillow and back arching as a long, wrecked moan escapes the back of his throat.\nHis worn breathing is all that fills the room, basking in his orgasm, until he slings an arm over his head, upper arm lazily covering his eyes. Then he inhales deeply, lets it out, and says: “Okay…what now?”\nSteve jumps right back into his excitement. Like none of this just happened. Like he didn’t just watch his best friend get off and come all over himself. “Remember that one war movie we saw that won an Oscar?”\nBucky’s silent, then an unsure: “Uhhhh…”\n“We saw it and then went over to Molly’s for a burger because you had just gotten paid. And you ordered that gigantic chocolate milkshake and got a bad brain freeze.”\nThat’s when Bucky sits up, a fond smile on his face as the metaphorical light bulb goes off in his memory. “Oh yeah!” Then he realizes that he’s still covered in the sticky white mess on his chest and he makes a face. “Jesus. Can you throw me that towel?”\nSteve glances around the room, his eyes landing on the dark towel before throwing it over to his friend. Bucky catches it with one hand. “What was the name of that movie?”\nBucky’s eyes unfocus for a second, narrowing in an attempt at recollection as he wipes the towel over his chest and stomach without looking. “Shit. What was it…”\n“Something about being on the front,” Steve thinks out loud.\nAnd it must be all he needs to jog his memory, because then Bucky is almost shouting, “All Quiet on the Western Front!” like it’s his job.\n“Yes!” Steve grins so widely it almost hurts. “That’s definitely it!”\nAnd then he’s disappearing from the doorway, leaving Bucky pretty much naked and still wiping the come off himself. “Steve! Close my fucking door!” he shouts after him.\nSteve reappears with a sheepish grin. “Sorry,” and then closes the door behind him. “I got it!” his excitement follows him back into the living room where the rest are still waiting. “It’s All Quiet on the Western Front!”\nHe takes the liberty to move his player piece up a space on the game board proudly, his pride swelling so much that he doesn’t even notice how everyone is looking at him, mouths opened in disbelief—and it’s not because he finally got an answer right.\nTony and Clint are the first to move, each turning to Natasha in synchronized motions, giving her a look that screams ‘still think we’re crazy?’\n \n \n5.\nIt’s a total accident that Steve and Bucky get stuck in a room that has a tiny sink, a kitchen, and one bed. It’s a total accident that Tony and Clint may have caused and was actually not an accident at all but instead a full-fledged plan that actually worked pretty well and “Well of course it did, I made it,” says Tony.\nTo their credit, there is plenty of space for Bucky and Steve to move around. There’s even a stocked fridge and some nice fluffy white sheets on the bed. And of course, the hidden security camera that’s linked to the computer that Clint is now hovering over.\n“You’re both disturbed. Really.” Natasha says when she comes across them, arms crossed and a bothered frown written all over her face. “This is getting beyond creepy.”\nTony hums quietly to himself, tapping his fingers on a screen that apparently adjusts the temperature in the room that they’re observing. “Listen, we’re not saying they’re sleeping together—“\n“But they’re sleeping together,” Clint finishes, not taking his eyes off of the screen.\nAnd all Natasha can do is stand there, wondering aimlessly why again she decided to join this group in the first place. “You’re children. You understand that, right?”\n“We are,” Tony muses, “It’s true. Now let us play, Mommy.”\nNatasha does an impressive job at staying calm—not breaking bones today. “What is this accomplishing?”\n“We’re evidence-gathering.”\n“Alright. So say they are sleeping together. You get your evidence—did I mention you’re being beyond creepy?—so what?”\n“Then I’m right,” Tony grins pompously until Clint clears his throat from across the room. “We’re,” Tony corrects. “Then we’re right. Sorry, dear.”\nNatasha is about to fire off again, but the Clint is making excited noises and gesturing at Tony to come look quickly. Tony all but sprints to the other side of the room, his eyes falling onto the screen as Steve and Bucky’s bodies move extraordinary close to each other.\n“JARVIS, how long have they been in there?”\n“Captain Rogers and Sergeant Barnes have been contained for just under 35 minutes, sir.”         \nClint snorts, “Horny bastards, aren’t they?”\nAll eyes are on the screen, on the two blissfully unaware men in the other room. Steve’s hand reaches up and runs through Bucky’s hair. Then again. Almost as if he’s...\n“Damn it,” Clint mutters as Steve fixes Bucky’s hair once more and then backs away. “False alarm.”\nThey don’t realize Natasha is still watching them from the other side of the room before she speaks again, damn near giving them a heart attack. “So here’s what I guess I’m still stuck on: you’re waiting for them to have sex, and then you’re going to watch them do it?”\nTony looks at her like she’s grown a second head, his voice dripping with horror, “Jesus, no. JARVIS is doing it.”\n\n“I beg your pardon, sir—”\n\n“Relax, JARVIS, it’ll be fine. Should be pretty intriguing. I’m doing you a favor, really.”\n\n“…how is that, sir?”\n\nTony blinks, thrums his fingers against his thighs in a moment’s thought, and then changes the subject quickly. “What’s happening, Barton?”\nClint, who now seems rather bored with the entire project, props his chin up with his hand, his eyes not once leaving the screen. “Talking.”\n“Interesting.”\nThe sudden boredom must transfer across the room, because Natasha is halfway down the hallway, muttering something about immaturity as she walks.\nTony and Clint stay and watch for another hour, only met with their subjects talking and throwing something around the room to stifle their own boredom. Tony quickly delegates the task over to JARVIS, who has no other option but to tentatively accept.\n“Update,” Tony will say throughout the night, elbow deep in the machinery of whatever project he’s working on.\n“Nothing to report, sir.” Is nine times out of ten what JARVIS will respond with. The last time he’s asked, he replies with: “Captain Rogers and Sergeant Barnes are sleeping, sir.”\nIt peaks Tony’s interest, his head popping out of a towering pile of metal like a prairie dog. “Pull it up.”\nThe live feed of the bedroom is transferred to the large projector that takes up most of the north wall.  Steve and Bucky’s images are plastered there, squeezing themselves into the provided bed with just too little room that their backs are pressed against each other. Then Steve shifts, rolling over and slinging his arm around Bucky protectively.\nTony props an elbow up against a metal beam, his head tilting just slightly. “Well how ‘bout that.”\nThe feed cuts out for a moment but then is right back up, just in time for Bucky to snuggle back against Steve’s larger frame.\n“JARVIS.”\n\n“Yes, sir.”\n\n“My heart is full.”\n\n“Shall I put Ms. Potts on the line?”\n\nTony blinks, looks over the feed one more time, and then says contently, “Would you?”\n \n \n \n \n \n+1.\nIt’s during a group meeting when the hammer falls. Not Thor’s hammer, in case there’s any confusion—but the metaphorical hammer that Clint and Tony have been waiting so desperately to drop.\nThey’re all going over a recap of the week’s events, villains they’ve destroyed, malarkey they’ve put a stop to, and their overall concerns.\n“Speaking of concerns,” Tony interrupts, now in full-fledged Tony Stark mode, “When are you two getting hitched?”\nThere’s silence. Lots of it. And then Bucky glances up for the first time, finally tuning into the conversation and suddenly realizing that he’s being pointed to. His eyes shift cautiously between everyone until landing on Stark again. “Huh?”\n“Tony…” Natasha warns, but of course it falls on deaf ears.\n“You and the Cap,” Tony continues, walking around the large oblong table they’re all seated at. “When’s the date?”\nBucky’s brow knits in confusion, glancing over at Steve for any kind of assistance. “The date for what?”\n“When are you tying the knot,” Clint offers, an amused smile playing across his lips, “Getting married.”\nThe room stills. Completely silent.\nSteve and Bucky look at each other with a solid mix of bewilderment and confusion between them.\n“Uh…” Steve tries, adjusting the collar of his shirt. “I don’t follow you.”\n“Come on, Rogers,” Clint muses, folding his arms across his chest and leaning back in his chair, “It’s all good now.”\n“There’s equal marriage in New York now, Cap,” Tony clarifies, “Equal opportunity for everyone to be miserable together forever.”\nBucky’s eyes are still on Steve, his scowl very apparent. Steve is the only one who can see past it and notice the slight quirk of silent thought swimming against all the blue.\nOn the other side of the table, Thor is simply beside himself with joy. “Wonderful! Truly a match made in the heavens.”\nOpposite him, Bruce is glancing between the clearly-uncomfortable couple in question, and Tony. “Maybe some explanation might move this along more productively.”\n“If you insist,” Tony says, immediately launching into his speech-giving voice, simultaneously making Bruce regret he said anything. “It’s not lost on us how chummy you two are. Touchy feely, even…” he begins, directing his words at Steve and Bucky now. “…how long you’ve known each other, how remarkably undeterred you seem by what normal people might call uncomfortable situations, et cetera—”\nBucky’s scowl intensifies, “Name one thing.” And then he wishes he didn’t say that because Tony ignites with examples.\n“Well let’s see…intimate massaging, an incredible lack of a concept known as personal space, sharing each other’s food—”\n“Natasha and Clint share food all the time,” Bucky disputes.\nTony nods. “Mm, they do. And they’ve also had relations.”\nNatasha rubs a hand over her face.\nAnd Steve just looks even more confused. “…relations?”\nBut Bucky gets it 100%. “He’s saying that since you and I share food, we’re fucking.”\nSteve blushes. It would be adorable, really, if it weren’t for all the eyes on them.\nTony shrugs, nodding, “Well…yes. What I’m also saying is that that’s kind of in right now. There are entire industries all about male on male por--”\n“Alright, I think that’s enough,” Bruce says standing, and Steve and Bucky are glad for it. “Does anyone else have any concerns? No, not you, Tony, you’ve had your turn.”\nWhen nobody else speaks up, all probably still reeling from the previous conversation, Bruce nods and they all dismiss themselves from the table, going their separate ways.\nIt stays with Bucky—what Tony said—long after the conversation is over and he and Steve have called it quits for the night in favor of stretching out on the plush couch in Steve’s living room. They’re supposed to be relaxing, each taking up half of the L-shaped couch and their feet meeting at the intersection. Indeed, that is the near-nightly routine for them. But all Bucky can do is ruminate over all the ridiculous claims that Stark had thrown on the table not two hours ago—and more importantly the not so ridiculous ones.\nBecause here’s the thing: he doesn’t need some cocky, high-techy billionaire telling him something he already knows. It’s not like Bucky has no idea that he stares after Steve for much longer than necessary. It’s not like Bucky has no idea that he’s be goddamn head over heels for the man since before he can remember. What he does need is someone—preferably still not Tony—to inject him with a remarkable dose of confidence to actually act on this infatuation. Because regardless of how much time has passed and everything that has happened in between, they haven’t done anything about it. And the pull between him and Steve has become so outrageously strong that he knows Steve feels it too.\n“So what do you think?”\nBucky looks up, meets Steve’s curious gaze from across the couch. “What do I think about what?”\n“What Tony said.”\nSteve can read his mind, Bucky’s almost entirely sure. It’s been this way since Brooklyn. He tilts his head, stares at his socks, does pretty much anything to hide the sudden curl of discomfort that blossoms in his chest. “I dunno.”\nSteve allows the beat of silence before speaking again. “Well it’s pretty great, though. Right? That men can be together now in some states.”\nBucky shifts silently.\n“In this state.” And Steve’s voice is so purposeful, sharpened down to an obvious point that Bucky has to look at him.\n“Yeah. It’s uh…”\nSteve is patient—waits for Bucky to finish his thought even though he knows it’s not going to come because he knows Bucky and knows when Bucky is flustered about something. So he clears his throat quietly, wondering exactly how he got stuck being the one to move this conversation along when he’s the one who still nervously calls sex ‘fondue’. Then he says: “Marriage, even…”\nThe idea floats between them, nudging at Bucky’s chest until Bucky sighs, letting his head rest back against the back of the couch, his words coming out hushed but important. “Steve…Jesus, you know how I feel about you…”\nSteve nods. An agreement. “Then why aren’t we—I mean why haven’t we done something about it?”\nBucky’s eyes are on him now, his discomfort translating flawlessly into his self-conscious movements. “I don’t--…should we?”\nHis arms have snaked their way around his own body, blocking his chest in a barricade from not only this conversation but probably a good portion of the thoughts that are swirling around in his brain.\nThen Steve’s moving, picking himself up and then settling down next to Bucky when he draws his feet up. But it’s not their normal in-your-left-pocket close. It’s understated—backed off just a little.\nSteve looks at his hands, then raises his eyes to meet Bucky’s. “I-…I mean, I want to.” He’s just as uncomfortable, Bucky can tell by the way the corners of his mouth are turned just slightly downward without actually looking upset. Especially when he says, “Do you want to?”\nIt’s ridiculous. He feels like he’s twelve again, trying to summon up the courage to talk to that one dame with the pigtails from the candy store. But this is different. Because he’s grown now—not twelve. And this is Steve. Steve Steve. His Steve. But now, maybe after all these years he can actually, legitimately be his Steve. Bucky nods, swallowing down the lump in his throat that’s forming just from the thought of finally being that much unbelievably closer to him.\nAn impossibly quick smile flits across Steve’s face, only to be replaced by this look of broad, smoldering determination as his eyes flick down to Bucky’s lips.\nAnd Bucky doesn’t know what to do—knows what he wants to do—but god damn him if he doesn’t feel that sudden pang of dull panic all the same. Steve’s there. Right there. All glowing and faultless like he is—like he’s always been: a permanent fixture of perfection in Bucky’s otherwise less-than stable existence.\nBut his heart is beating so fast. And he knows he’s leaning in, closing that distance that’s lingered between them for over ninety years, but—\n“Jesus, why am I so fucking nervous,” Bucky breathes out, his eyes trained on Steve’s mouth, neither of them moving forward anymore. They’re so close, like they’ve always been. “Fu-”\nSteve kisses him then, pressing forward with such determination even though he misses his mark by a few inches, the kiss landing firmly against the corner of Bucky’s mouth. But it’s beautiful. And it’s sweet. And it reaches into Bucky’s chest and gently unravels that curl of discomfort that’s hovering there.\nBucky breathes out slowly. Tentatively. Then he presses so much closer and their lips are meeting straight on and it’s got his entire body working the tension loose that’s always hidden there, in the fraction of a space that was left to linger between the two of them.\nBucky reaches up, his hand cupping Steve’s cheek: metal on skin and it’s not enough so he adds his other hand and he’s sitting there, gently holding Steve’s face, his thumbs brushing over defined cheekbones as Steve hums against his lips.\nIt’s so beautiful and heavenly and warm and long past due.\nSteve’s hands find Bucky’s waist, pulling him over and into his lap with a remarkable ease that leaves Bucky breathless. He worries for a moment about putting so much weight on Steve until his brain returns to normal functioning, reminding him that this is not the 40’s. This is not Brooklyn. Steve could probably support the weight of a goddamn semi-truck if he had to now. It makes Bucky chuckle, tender and low and quiet against Steve’s lips.\n“Hmm?” Steve hums, not breaking their kiss as he slides his hands up Bucky’s back.\nBut Bucky just shakes his head, sinks into Steve like this is the only place he wants to be for the rest of his life, because it is. So they just sit there, tangled helplessly together like they’ve always been, but more now. Closer now.\nThere’s plenty of time for awkward touching and strong hands on new places and skin on skin.\nThere’s plenty of time for “I love you. I’ve always loved you. I’m always gonna love you.”\nThere’s plenty of time for Tony and Clint to engage in a manly fist bump because they were totally right, and for Natasha to roll her eyes but not be able to stop the endearing smile that pulls at her mouth because Steve and Bucky together are truly truly beautiful.\nThere’s plenty of time for Bucky to freak out, his eyes scanning over the display in the jewelry store before he remembers that they have money now and nothing is too good for Steve because for Bucky, Steve is the epitome of good. Of all good things.\nThere’s plenty of time for Steve to come home and freeze in his spot, heart welling up and key’s clattering to the floor to find Bucky, dressed to the nines in his army service uniform and on one knee, smiling hopefully as Steve’s eyes finally come to rest on the thin, silver ring in his hand. (And he swears to God he doesn’t cry when Bucky slips the band on his finger--but everyone, including himself, knows he totally does.)\nThere’s plenty of time for all of it. For all good things. So for now, they just wrap themselves in one another, and they kiss for the first time."
}