{
    "id": "167156",
    "url": "https://archiveofourown.org/works/167156?view_full_work=true",
    "author": [
        "riventhorn"
    ],
    "title": "Finding Home",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Merlin BBC"
    ],
    "relationships": [
        "Arthur/Merlin"
    ],
    "characters": [
        "Arthur Pendragon (Merlin)",
        "Merlin (Merlin)",
        "Gaius (Merlin)"
    ],
    "additional_tags": [
        "Hurt/Comfort"
    ],
    "language": "English",
    "series": "",
    "published": "2010-08-03",
    "completed": null,
    "words": "7,857",
    "chapters": "1/1",
    "comments": "220",
    "kudos": "18,957",
    "bookmarks": "3,303",
    "hits": "230,988",
    "summary": "<p>Written for a kinkme_merlin prompt. When Gaius retires a new physician takes over and quickly kicks Merlin out of his room and takes it for himself. Arthur finds Merlin sleeping in the stables...and it's winter.</p>",
    "notes": "<p>Translation into Chinese by Monsoonyy: https://jiyu5738.lofter.com/post/1f55c328_1ccb1baeb</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>sunatsubu has drawn two wonderful art pieces for this fic! Check them out <a href=\"https://sunatsubu.tumblr.com/post/147122614687/arthur-frowned-after-him-something-was-wrong-with\" rel=\"nofollow\">here</a> and <a href=\"https://sunatsubu.tumblr.com/post/147978306997/arthur-sighed-and-took-off-his-jacket-he-put-it\" rel=\"nofollow\">here</a>.</p>\n<p>Aconit has translated this fic into French: <a href=\"https://archiveofourown.org/works/11474223\" rel=\"nofollow\">Ao3</a> or <a href=\"https://www.fanfiction.net/s/12568445/1/Finding-Home\" rel=\"nofollow\">ff.net</a></p>\n<p> </p>\n<p>Monsoony has translated it into Chinese here <a href=\"https://jiyu5738.lofter.com/post/1f55c328_1ccb1baeb\" rel=\"nofollow\"> on Lofter</a></p>",
    "text": "Merlin carefully set his armful of books down onto the table and glanced around the small room. It had taken some doing, but together, he, Gwen, and Gaius had managed to fit most of Gaius’s things into his new quarters. Stacks of books and parchment took up most of the space, but there was a small table that Gaius could conduct his experiments on. A bed and washbasin were squeezed into one corner.\n“I think that’s the last of it,” Merlin said to Gaius, who was flipping through a book, his spectacles perched on his nose.\n“Thank you, Merlin,” Gaius said, glancing up. “Perhaps I’ll finally be able to get all my notes and writings into some kind of order.”\nMerlin grinned. “You’ve been saying that ever since I’ve known you.”\n“Yes, but this time I mean it. Now that Ilberd has taken over as court physician, I am looking forward to many pleasant hours with nothing to do except read and write in the comfort of my room.” Gaius settled onto a chair with a sigh. “I certainly will not miss dashing about on cold winter mornings when it seems as though everyone in Camelot is down with a cough.”\nMerlin fiddled with a glass vial. “You were good at it, though, Gaius. Everyone will miss you. I still don’t see—”\n“I’m getting too old for it, Merlin,” Gaius interrupted gently. “And Ilberd is well versed in all the latest remedies and techniques. Besides, I’m not going anywhere. I shall still be right here in the castle, should anyone need me.”\n“I know,” Merlin said softly.\n“And you are certainly welcome to visit anytime.” Gaius got up and came over to Merlin, putting his hand on Merlin’s shoulder. “I shall be quite disappointed if you aren’t in here at least once a week, telling me all about the latest monster to trouble the kingdom.”\n“Don’t think you’re getting out of helping me with those,” Merlin told him, smiling.\nGaius smiled back. “I shall be here whenever you need me, Merlin.”\nIt felt strange to return to their old chambers, knowing that Gaius was no longer there. Not to mention that Merlin wasn’t exactly thrilled with the new physician—Ilberd. Whatever Gaius said about his skills, the man was rather cold and aloof. And now Merlin wouldn’t be able to practice his magic, not with Ilberd right there. Ilberd’s mouth curled into a sneer at the very mention of magic, even healing magic. It had made Uther happy, but it meant the loss of one small freedom that Merlin had enjoyed.\nWhen Merlin opened the door, Ilberd was organizing his own books neatly on a shelf. He looked up and gave a disparaging sniff when he saw Merlin.\n“Come to collect your things at last, have you? About time.”\n“My things?” Merlin repeated, confused.\nIlberd narrowed his eyes. “Yes, your things. I want that chamber cleared out so that I can get settled. Preferably before midnight, as I have an early meeting with the king on the morrow.”\n“You—you want me to leave?”\n“Yes, of course.” Ilberd waved a hand. “I hope I didn’t give you the impression that I wanted an assistant because I do not. And I certainly do not intend to sleep out here in the main chamber. Gaius may have done so, but I prefer a modicum of privacy.”\nMerlin swallowed, hesitating. He didn’t have anywhere else to go and besides, this was his home! Ilberd had no right—\n“Get a move on, boy!” Ilberd snapped.\nMerlin flinched and stumbled over to his room. Unfortunately, Ilberd did have the right—these were his chambers now, and the king would certainly give his wishes preference over those of a servant. Angrily, he began collecting his things, shoving them into his bag. He’d have to come back for the staff later, but he managed to cram his book in under his shirts. He didn’t have much and only a few minutes later he found himself back out in the corridor, Ilberd slamming the door behind him, his few belongings clutched in his hands.\nIt was dark, only one torch sputtering fitfully above the stairwell. And it was cold—the day had been fairly mild for mid-winter, but with the sun gone, winter had returned with a vengeance. Merlin could see his breath, and he shivered. What was he going to do?\nHis first thought was to go to Gwen, but that wouldn’t work. After the dragon’s attack, Gwen had taken in several of the townsfolk whose homes had been destroyed. Although they had rebuilt and left after a few weeks, Gwen had kept up the practice, letting the poor who were homeless and destitute shelter in her house for the night. Merlin couldn’t go and demand that she turn them out—they were in a far worse situation than he was. And there was barely enough space in Gaius’s new room for Gaius, let alone Merlin.\nHe could go to Arthur, but Merlin knew how that would turn out.\n“Can’t you manage anything, Merlin?” Arthur would say, sounding exasperated and annoyed. Arthur already thought he was completely useless most of the time—Merlin didn’t want to give him one more reason to complain. Besides, what did he expect—that Arthur would let him sleep in his room? He couldn’t imagine Arthur sharing his bed—even if it was big enough for at least five people.\nMerlin was growing colder by the second—he had to go somewhere or freeze to death here in the corridor. He finally made his way down to the stables. The stable boys had sought out all the warmest spots, of course, but Merlin found a disused room in the back, door half-rotted away. He could put his things here, and hide his book. He dragged in some armfuls of straw, and took out the thin blanket he had taken from his old room. Keeping all his clothes on, he curled up in the straw, trying to get warm.\nIt didn’t work too well. His old room had never been exactly cozy, but at least it had been surrounded by sturdy stone walls. Here there were a thousand cracks in the walls that let in the cold air. He could try to start a fire but there was no hearth, and the last thing he needed was to accidentally burn down the royal stables. He finally slipped into a light doze, but kept shivering all night long.\nHe woke up to find snow falling outside. He tried to get all the straw out of his hair and trudged up to Arthur’s chambers.\n“Are you all right?” Arthur asked him as Merlin did up the laces on one of Arthur’s warmest wool tunics. “You look tired.”\n“I didn’t sleep too well last night, that’s all,” Merlin replied.\nArthur hissed as Merlin’s fingers touched his skin. “You’re freezing!” He batted Merlin’s fingers away. “I’ll do that.”\n“It is snowing outside, sire,” Merlin muttered.\n“What does that matter? What are you doing—going for early promenades around the courtyard?” Arthur shook his head. “Try to be slightly competent for once, Merlin.”\nIt was a long day, and by the time Merlin crept back into the stables that night, he was tired, hungry, and just as cold as when he had woken up. His boots were soaked from walking through the snow, and he took them off, trying to rub some warmth back into his feet.\nIf things had still been the same, he would have been up in the castle now, sitting down to dinner with Gaius. He had managed to grab some bread in the kitchens that evening, when he picked up Arthur’s supper, but by the time he had brought the dishes back down, everyone else had eaten and the dogs were gnawing on the few scraps of leftovers.\nMerlin sniffed and wiped at his eyes, telling himself that it was ridiculous to cry. He wasn’t out under a snow bank somewhere, and he had eaten, even if it hadn’t been very much. But it wasn’t just his bed or his room that he missed—he missed the feeling of home, of belonging. He had arrived in Camelot from Ealdor, nervous and lonely, and Gaius had given him a home. It had been a safe place to go at the end of the day.\nShivering, Merlin cast a spell, and a globe of blue light hovered over his hand. It cast weird shadows on the walls, but didn’t give off any warmth. He was too tired for much magic anyway. With a sigh, he let the light go and lay down in the straw.\n*\n“Will that be all, my lord?”\nArthur had been sitting in front of the fire, staring into the flames, feeling warm and pleasantly drowsy. He yawned and looked over at Merlin. “Yes, you may go. Good night, Merlin.”\n“Good night,” Merlin replied quietly, slipping out the door.\nArthur frowned after him. Something was wrong with Merlin—for the past week he had looked exhausted and seemed to be getting thinner, if that were even possible. He was always shivering when he arrived in the morning, and one afternoon Arthur had found him just kneeling in front of the fire, eyes closed. He had scrambled up when he heard Arthur and tried to make it look as though he had been brushing the hearth.\nTrying to ask what was wrong did no good—Merlin either shrugged or said that it was nothing.\nArthur was getting ready to go to bed when he remembered that he hadn’t told Merlin to attend him earlier than usual the next morning, as his father wanted to ride out to one of the outlying villages to investigate rumors of a bandit attack. Well, it wouldn’t take long to go tell Merlin. Grumbling, Arthur shrugged on his jacket and set off through the cold corridors.\nIlberd answered the door when he knocked. “May I help you, your highness?” he asked, bowing.\n“I’m looking for Merlin,” Arthur replied.\n“Merlin?” Ilberd looked taken aback. “Why should I know where the boy is?”\nArthur stared at him for a few seconds. “Because he lives here.”\nIlberd’s face cleared. “Ah, I see, my lord. The boy is no longer here. I had no need for an assistant, so I asked him to move out.”\nArthur frowned. “Well, where did he go?”\n“I have no idea, my lord.”\nArthur looked at Ilberd for a long moment. He suspected that Ilberd had not “asked” Merlin to leave but had simply tossed him out the door with no warning. And where the hell was Merlin now? Nowhere good judging by the way he had looked all week.\n“I will speak with you about this later,” Arthur growled, and turned away, striding down the corridor. He tried Gaius’s new chambers first, but Gaius was out and there was no sign of Merlin. He asked a few servants that he passed, but they hadn’t seen Merlin since supper.\nHe finally went to the guards at the front door, who reported that Merlin had gone out earlier—heading for the stables, they thought.\nThe stables were dark, but enough moonlight trickled in to see by. Arthur clambered about, cursing as he stumbled into things. He was about to give up when he noticed the small door, half-hidden behind a few barrels. He shoved it open.\nMerlin was curled up in some straw on the floor. Arthur could tell that he was shaking from the cold, only a thin blanket covering him.\n“Merlin,” Arthur breathed, kneeling down. “What are you doing here?” He gently shook Merlin’s shoulder.\nMerlin slowly opened his eyes. He gasped when he realized it was Arthur, and quickly sat up, bits of hay clinging to his hair and tunic. “Arthur,” he mumbled. “What—?”\n“Why didn’t you tell me?” Arthur asked softly.\nMerlin looked away. “I just—I don’t know.”\nArthur sighed and took off his jacket. He put it around Merlin’s shoulders and pulled him closer, rubbing his arms, trying to get him warm. “You’re such an idiot.”\nAfter a moment, Merlin rested his head on Arthur’s shoulder, his cold nose pressing against Arthur’s neck.\n“Come on,” Arthur finally said, pulling Merlin up. “Let’s get you out of here and somewhere warm.”\n“Ilberd—he won’t let me stay with him.” Merlin looked lost and nervous, hands clenched in Arthur’s jacket.\n“I’m not sending you back there,” Arthur told him. “Just follow me.”\nMerlin stumbled along, stiff from the cold. When he realized they were heading for Arthur’s chambers, he stopped. “Arthur, you don’t have to—”\n“Quiet, Merlin” Arthur said, tugging him along.\nWhen they reached his chambers, Arthur let go of Merlin’s arm and went to rummage in his wardrobe. Merlin stayed in the middle of the room, glancing uncertainly about. Finding one of his warmest woolen nightshirts, Arthur stuffed it into Merlin’s hands. “Here. Put this on.”\n“I can’t take—”\n“I’m not letting you into my bed covered in hay,” Arthur interrupted him.\nMerlin looked up, eyes wide. “Your bed?”\n“Yes,” Arthur replied, sitting down and tugging off his boots. “We’ll get something sorted out for you tomorrow, but it’s too late and too bloody cold to deal with it now.”\nThere was a long pause, and then Merlin began fumbling with the laces of his tunic, drawing it off over his head. Arthur pulled on his own nightshirt and slid under the mound of blankets. Merlin crawled into the bed a few seconds later, not looking at Arthur. He curled onto his side, as close to the edge of the bed as he could get without falling off.\n“By the gods, Merlin,” Arthur muttered, reaching out and pulling at Merlin’s shoulder. “I’m not going to bite you.”\nMerlin resisted for a moment, but then gave in and moved closer to Arthur. “Thank you,” he said quietly. He was still shivering a little.\nArthur put his arm around Merlin, shifting forward so that they were almost touching. “You need to get warm.”\nMerlin nodded and slid downwards so that only the top of his head was showing above the blankets. Arthur ruffled his hair. “Should have told me,” he murmured, and Merlin made a little noise that Arthur couldn’t interpret. Sighing, Arthur decided he was too tired to try and decipher Merlin’s motives.\nSlowly, Merlin grew warmer, and eventually his breathing deepened as he fell asleep. Arthur could have moved away, but he kept his arm around Merlin even as he drifted off to sleep himself.\n*\nWarmth—blissful warmth. Consciousness tugged at Merlin, but he tried to ward it off, burying his face in the wonderfully soft pillow. Gaius would be coming any minute to tell him to get up. But no—he wasn’t in his old room anymore. The memory of the stables returned and with it the image of Arthur, bending over him, brow furrowed with concern. And then Arthur had—\nMerlin’s eyes snapped open, and he sat up, legs tangled in the blankets. He was still in Arthur’s bed, sunshine streaming in through the open curtains. It looked to be late morning, and Arthur wasn’t there, although the blankets on Arthur’s side had been tucked back in around Merlin.\nA covered tray sat on the table, and Merlin could smell sausage. His stomach growled. Disentangling himself from the blankets, Merlin got up, shivering when his feet hit the frigid stone floor. He sat down in Arthur’s chair and pulled off the cover, revealing a plate of cheese, bread, and the fragrant sausages. He went through half of it in about five seconds, wiping his greasy fingers on his shirt before belatedly remembering that it was Arthur’s. Merlin glanced around, looking for his clothes. His boots were tumbled in a corner, but there was no sign of his tunic or breeches.\nFrowning, he got up and began poking around. What had Arthur done with them? He vaguely remembered Arthur saying something about not letting Merlin into his bed covered in hay, but surely Arthur wouldn’t have just thrown out his clothes. Did he expect Merlin to wander about in his nightshirt all day? Then Merlin saw the tunic and breeches neatly folded and lying by the bed. He recognized them as an older pair of Arthur’s—slightly worn, but the tunic was still thick and warm—much warmer than Merlin’s had been.\nHesitantly, Merlin picked it up. Had Arthur left this for him? He didn’t want to put it on and then have Arthur yell at him when he returned. But Merlin’s clothes were definitely gone and these were here, so…\nMerlin finally put them on. The tunic was a little too big on him, and the breeches a little short, but they fit well enough. He went back to the table and finished off the food, and then just sat there for a few moments. It was nice and quiet in Arthur’s chambers, and Merlin half-felt like crawling back into the bed for a while. But he had work to do. Arthur would definitely yell at him if he returned to find Merlin still in his bed, dishes piled on the table and the wood-box empty.\nAs Merlin went about his chores, he wondered where Arthur would find room for him to sleep. Probably a disused storeroom somewhere. Merlin spared a regretful thought for Arthur’s bed—it really had been amazingly comfortable. A blush crept up Merlin’s face as he remembered Arthur tugging him closer, putting his arm around him—and in the stables, when he had draped his jacket over Merlin’s shoulders. Merlin was slightly embarrassed at Arthur taking care of him like that, but at the same time—well, Merlin knew that Arthur cared about him, but those feelings were so often buried behind a wall of orders and teasing and royal aloofness. Merlin stroked the soft fabric of the tunic. It was nice to have a tangible reminder that he meant something to Arthur.\nWhen he took the dishes back down to the kitchens, Merlin found out from the other servants that Arthur and the king had ridden off to inspect an outlying village and probably would not return until dusk. Merlin spent the afternoon polishing Arthur’s numerous pairs of boots. By the time he was done, he was yawning again, and Arthur’s bed looked very tempting. Merlin added another log to the fire and glanced out the window. The shadows were long against the snow, the sun dipping down closer to the hills. Merlin glanced at the bed again. He’d just lie down for a few minutes—just until he heard Arthur returning.\n*\nArthur stomped wearily down the corridor, his body still chilled from the wind despite his fur-lined gloves and cape. It had been a discouraging day. The rumors of bandits were in fact true—one village had lost half its remaining grain supplies and two homes had been burned. The recent snow had obscured any tracks, but it looked as though the bandits had melted back into the forest where it would be difficult, if not impossible to hunt them out. They had left behind a small garrison of soldiers but the same couldn’t be done for every village.\nEntering his chambers, Arthur wrestled off one of his gauntlets and was about to toss it onto the table when he saw Merlin. He stopped and laid the gauntlet down quietly, and then walked over to his bed. Merlin was sprawled across it, fast asleep.\nThat morning, Arthur had woken to find Merlin snoring softly beside him. He had been about to jostle Merlin awake, order him off to find breakfast, but then he had remembered how exhausted Merlin had been the night before. How cold and miserable he had looked, curled up in the straw in the stables. Arthur still didn’t understand why Merlin hadn’t come to him; why Merlin hadn’t asked for help. Did he think that Arthur would refuse to give him any?\nThe thought had made Arthur’s stomach clench unpleasantly. Whatever Merlin’s reason had been, Arthur clearly had not been looking after him properly. Merlin might be annoying and clumsy and impossible to decipher half the time, but Arthur was his prince, and it was his responsibility to make sure Merlin was all right.\nAnd he’s my friend, Arthur had added to himself and had reached out to softly lay his hand on Merlin’s arm.\nSo he had let Merlin sleep. The sting of guilt had returned when he picked up Merlin’s clothes from where they were strewn about the floor. They were threadbare—no protection at all in this cold weather. Arthur had found an old tunic and breeches in his wardrobe and set them out. And he had called for a servant to bring up an extra large breakfast so he could leave most of it for Merlin.\nMerlin had slept through all of it, and Arthur had closed the door quietly behind him when he left. Arthur could tell Merlin had done most of his chores when he woke up but had apparently given in to the temptation of a soft bed once more.\n“Merlin,” Arthur said, leaning down to shake Merlin’s shoulder.\nMerlin blinked awake, scrubbing a hand through his hair. Then he focused on Arthur and sat up abruptly. “You’re back!” he exclaimed and tumbled hastily off the bed.\n“Thank you, Merlin, for stating the obvious once more,” Arthur said dryly. “Help me off with this armor before it freezes to me permanently.”\n“At least then I wouldn’t have to keep putting it on you,” Merlin retorted, his fingers brushing Arthur’s neck as he worked.\nArthur hid a smile and grabbed Merlin’s hand. “You’re nice and warm,” he observed. “A definite improvement over last night.”\nMerlin cleared his throat. “Right—about that. Thank you, for letting me sleep here and—and for these,” Merlin added, tugging at the tunic.\nArthur waved a hand. “It was nothing. Now can you please hurry it up, Merlin? I’d prefer not to eat dinner in my chainmail.”\nMerlin went back to his task. “So,” he asked hesitantly after a moment, “what about tonight?”\nArthur frowned. “Tonight?”\n“Where—where should I go?”\n“Oh.” Arthur rubbed at his neck, trying to relax the muscles. “I’ll need to speak to the steward, but it’s too late tonight. You can sleep here again.”\nA pause, then quietly, “Thank you.”\nA maid came a short while later, a tray loaded with food balanced in her arms. She set it down and curtsied before hurrying off again. Merlin glanced at the food and raised an eyebrow. “There’s enough there to feed half the garrison.”\n“That’s because you’re eating with me,” Arthur told him. Ignoring Merlin’s spluttered protest, he sat down, gesturing for Merlin to do the same. “You look as though you haven’t eaten a decent meal in days.”\nMerlin slowly sat down, holding himself stiffly, but eyeing a roasted duck. Arthur pushed it towards him. “Go on. Eat whatever you like,” Arthur said.\nIt was odd, having Merlin eating at the table with him. They had often shared a meal when out on a hunting expedition or on one of their more dangerous escapades of course, but in Camelot Merlin had always stood by, serving Arthur, pouring more wine when required. He found that he rather liked Merlin sitting by him, though. He liked watching the way Merlin’s quick fingers tore hungrily at a piece of bread, liked the little noises of appreciation Merlin made as he ate the roasted duck. As Merlin’s nervousness faded, he managed to draw Merlin into a conversation. Nothing spectacular—just what had happened in the castle that day, the servants’ gossip, how Merlin really didn’t see why all the wood had to be kept out in the yard because the staircase was bloody long and after going up it five or six times it was no wonder he had fallen asleep. Arthur hid another smile in his wine glass and told Merlin it was good exercise.\nThere was a bit of an awkward moment after dinner, when the conversation lagged and Merlin looked uncomfortable again. He finally stood up and started gathering the dishes, muttering that he was going to go see how Gaius was doing.\nMerlin didn’t return for at least two hours, and Arthur finally gave up on waiting for him and got ready for bed. It had been a long day, and he sighed in relief when he finally relaxed into the pillows. He must have dozed off, for the next thing he knew, Merlin was quietly slipping in beside him. A few moments later, Arthur felt a sudden shock of cold against his bare leg.\n“Your feet are freezing, Merlin!” Arthur exclaimed, jerking away.\n“Sorry! I’m sorry—I thought you were asleep.” Merlin started to draw away.\nArthur clamped his hand around Merlin’s arm. “Get back here,” he ordered. Merlin edged slightly closer. Arthur sighed and felt about with his leg until he found Merlin’s cold feet again. He made a mental note to find Merlin a pair of slippers. “Now go to sleep.”\nAfter a minute or two, he felt Merlin relax and wiggle his feet further under Arthur’s legs. Arthur winced but made himself stay still. As Merlin’s feet warmed up, Arthur realized that he rather liked the feel of Merlin skin against his own. It made him wonder what the rest of Merlin’s skin would feel like—if he slipped his hand under Merlin’s tunic, for example. His hand was actually moving towards Merlin to find out when Arthur came to his senses. What was he thinking? This was Merlin! He did not have any—any feelings like that when it came to Merlin. Deciding that it was simply the effects of the long day and too much wine, Arthur pushed the thought firmly from his mind and clenched his wayward hand in the blanket.\n*\nMerlin smoothed down the blanket on their—no, Arthur’s—bed and fluffed the pillows, making sure to put the fluffiest one on Arthur’s side. Arthur kept complaining that Merlin was hogging the pillows—when Merlin was doing no such thing. Frowning, Merlin punched the pillow a few more times for good measure and set it back on their—Arthur’s—bed.\nIt had been two weeks, and Merlin was still here. No wonder he was getting mixed up. Every time he asked Arthur if he should move somewhere else, Arthur muttered that he hadn’t had time to talk to the steward yet, although Merlin had seen the two of them discussing repairs to the kitchen storeroom yesterday morning.\nNot that Merlin exactly wanted to leave. It was quite lovely, waking up all warm in Arthur’s bed each morning, spending the evening lying in front of the fireplace with a book and a goblet of mulled wine. After the first two awkward evenings, Arthur had handed Merlin a stack of books and told him to make himself comfortable. And when Arthur had some mulled wine brought up from the kitchens and had caught Merlin looking at the pitcher hopefully, he had given Merlin a glass. And then ordered it every night thereafter.\nAnd that morning—Merlin felt his face heat up just thinking about it. He had awoken to find Arthur pressed up against him, his arm draped over Merlin. After a frozen second, Merlin had determined that Arthur was still asleep. At first, he had been going to inch away, but then found himself putting his hand on Arthur’s arm. And then a sudden rush of images had flooded into his mind—pinning Arthur to the bed and kissing him, stripping off Arthur’s clothes, sliding his mouth down Arthur’s hard length. That had gotten Merlin out of the bed. A second later, he was standing on the far side of the room, willing down an erection and listening to Arthur murmur in sleepy confusion behind him.\nMerlin was trying hard not to think about it, occupying his mind with the other imminent disaster that was looming. Whenever he had been alone in his room, he had allowed himself to use his magic. Just for little things—heating the water, lighting a candle, levitating a clean tunic to the bed when he felt too lazy to get up in the morning. It had become a habit and now, as he began to feel more comfortable in Arthur’s rooms, he could feel his guard relaxing. The night before, he had almost used magic to pass Arthur the salt during supper. He had stopped himself just in time and spilled his wine all over the table, much to Arthur’s annoyance.\nNo—things couldn’t go on like this. Merlin would have to sleep somewhere else. He’d demand that Arthur speak to the steward that evening.\n*\nThe early winter night was already closing in when Arthur finally escaped from a meeting with his father and the council. Ilberd had been present as well, and Arthur beckoned for him to follow.\n“My lord?” Ilberd asked, hurrying to catch up.\n“I would like to speak with you privately for a moment. In my chambers.”\n“Certainly, your highness,” Ilberd said, bowing his head.\nMerlin wasn’t there—Arthur knew that he was down in the kitchens at this hour, waiting to collect supper—but it was quite evident that Merlin was making himself at home. Arthur had ordered several new tunics made for Merlin, along with a new pair of breeches, and over the past week they had managed to spread themselves over Arthur’s room. The books Merlin was reading were strewn about, along with a few half-empty cups. Merlin still kept putting away Arthur’s clothes and things, but apparently did not think he should clean up after himself.\nThe strangest part was that Arthur didn’t mind. He rather liked the clutter—it gave his room a lived-in feeling, something it had never had before. Servants had always kept his chambers immaculate. Even when he was a boy, his toys were always quickly picked up and stored neatly away.\nIlberd entered behind him and Arthur shut the door.\n“Are you feeling unwell, my lord?” Ilberd asked.\n“No.” Arthur sat down in his chair, leaving Ilberd—who was beginning to look uneasy—standing before him. “I want to speak to you about Merlin.”\n“Merlin?”\n“Yes.” Arthur’s voice hardened. “I know that you cast him out of his room. Told him he was unwelcome.”\nIlberd cleared his throat. “I would hardly say—”\n“Do you know where he went?” Arthur leaned forward. “He was sleeping in the stables. The stables! In winter! He could have frozen to death.”\n“My lord,” Ilberd said stiffly. “I do not see how this is my fault. How was I to know the boy had nowhere else to go?”\n“Well, you didn’t bother to ask him, did you? You’re a physician. You’re supposed to care about the welfare of others!”\nIlberd paled. “I do care, my lord. I assure you that—”\n“That you care about nobles? About people with enough influence and money to ensure that you are well fed and housed? That you reserve your concern for them and not for the hundreds of others who need you but are too poor to merit your attention?”\nIlberd flinched and stayed silent.\n“As the court physician, it is your job to ensure the welfare of all of Camelot’s citizens. No matter who they are. Is that understood?”\n“Yes, my lord,” Ilberd said quietly, and he had the grace to look ashamed.\n“Good. You are dismissed.”\nIlberd let himself out and a few minutes later Merlin arrived.\n“What did you do to Ilberd?” Merlin asked, laying out supper. “He looked like he was about to throw up.”\n“I told him that he was a cold-hearted bastard who was too full of himself to see when people needed help.” Arthur paused. “A trifle more diplomatically, though.”\n“Ah, well, he deserved it,” Merlin replied, trying not to grin.\n“He did.” And Arthur couldn’t seem to stop himself from reaching out and putting a hand on Merlin’s arm. “You must come to me, Merlin. If something like that happens again.”\nMerlin nodded slowly. “I will. I’m sorry—I just—you already thought I was useless most of the time.”\nArthur’s grip tightened. “I don’t think that. I never thought that.”\nMerlin glanced at him. “Never?”\n“Well, perhaps that first week—when you forgot my sword,” Arthur admitted, and Merlin laughed. “But not now. Not now.”\nMerlin sighed and squeezed Arthur’s hand, before pulling away and sitting down. They had eaten most of their supper before Merlin spoke again.\n“Arthur, I was wondering if you could speak to the steward—about finding another room for me to sleep in.”\nArthur paused and set down his piece of chicken. “Aren’t you comfortable here? If you need—”\n“I am,” Merlin broke in quickly. “I am. You’ve been—it’s been—nice. Very nice,” he added quietly. “But I can’t imagine you want me to stay here forever.”\nArthur opened his mouth to say that of course he didn’t, and then suddenly realized that he did. That the thought of Merlin leaving—of Merlin’s clutter disappearing, of Merlin’s cold feet no longer jolting him into abrupt wakefulness, of no longer opening his eyes in the morning with Merlin warm and sleepy beside him—made him feel terribly unhappy.\nHe cleared his throat. “I find it rather useful to have you around, actually.” He tried to make his voice sound unconcerned. “You’re on time in the mornings, for one thing. And I don’t have to hunt you down whenever I need something done.”\n“Well, yes, but—”\n“No,” Arthur said firmly. “You’re staying.”\nMerlin stared at him. “You really want—”\n“Why are we even having this conversation?” Arthur glared. “I certainly don’t have to explain my reasons to you. I want you to stay. So you’re staying.”\nMerlin looked down at the table, and Arthur thought he saw the beginnings of a smile on Merlin’s face. If Merlin started laughing at him… But then Merlin just said softly, “All right. I’ll stay.” And he sighed again.\n“Good.” Arthur studied Merlin carefully for another moment, and then gestured at the dishes. “Now if you’re so eager to be useful, you could clean this lot up.”\n“Right.” Merlin was definitely smiling now, but Arthur let it go. And not because he liked the way Merlin’s eyes crinkled when he smiled.\n*\nMerlin took the dishes down to the kitchens and then sought out an empty corridor. He leaned against the wall and shut his eyes. He couldn’t have said no to Arthur. Arthur had looked so—so hurt that Merlin wanted to leave. He would just have to be extra careful not to use his magic inadvertently.\n*\nThe next morning, Arthur woke before Merlin. He propped himself up on one elbow and stared down at Merlin, who was huddled under the blankets. Gently, Arthur brushed his fingers through Merlin’s hair. Why had Merlin wanted to leave? Surely he couldn’t want to go back to a narrow, cramped bed in some cold room? Surely he couldn’t be unhappy here? He didn’t look it, but perhaps he was.\nArthur’s fingers became a bit more forceful, just thinking about Merlin wanting to leave, and Merlin made a little noise and pushed into his touch. Arthur’s breath caught, and then he realized Merlin was still asleep. He kept up the gentle pressure, while pulling the blankets more securely around Merlin’s shoulders. Dammit, he was not going to let Merlin leave. He was going to take care of Merlin, keep him happy. Because Merlin was his friend and he enjoyed Merlin’s company. One of Arthur’s fingers wandered down to stroke Merlin’s forehead. Yes, just friends. Just friends.\nA week later, Arthur admitted to himself that his feelings for Merlin had gone beyond friendship. Every morning he had to restrain himself from kissing Merlin awake. He kept catching himself staring at Merlin’s mouth during the day. But he couldn’t let on to Merlin. Gods, Merlin might think Arthur had deliberately brought Merlin into his bed just for sex. Granted, getting to the sex was rapidly becoming one of Arthur’s main goals in life, but it wasn’t his reason for letting Merlin stay with him in the first place. But Merlin might not see it that way.\nThankfully, Merlin didn’t seem to notice Arthur’s fixation on his mouth. Now that he seemed to finally believe that he was welcome, he was becoming more and more relaxed around Arthur. The other day he had actually taken a bath, and Arthur had walked in on him and spent the next hour trying to forget the sight of Merlin’s wet skin and the way his hair looked all spiky with soap. It hadn’t worked.\nAnd then Arthur discovered why Merlin had been nervous about staying.\nThey had finished supper, and Arthur was trying to work his way through a stack of reports while Merlin lounged on the rug in front of the fire, yawning and lazily cracking open walnuts.\n“Give me a few of those,” Arthur had said, realizing that Merlin was going to eat the entire bowl if he didn’t speak up. But instead of getting up, Merlin had waved his hand, never tearing his gaze from the warm flames, and the bowl had drifted up and over to Arthur, settling on the table.\nAfter a minute or two, Arthur managed to shut his mouth. A minute after that, his mind went from a blank of pure amazement to screaming He’s a sorcerer! He can do magic! Magic! Magic! Magic! Arthur’s brain seemed to stick on that one word, repeating it over and over, each time more hysterically than the last.\nAnd Merlin—Merlin didn’t seem to realize what he had done. He was still stretched on the rug, sleepily looking at the fire. After a few more minutes, Merlin rolled over and gave Arthur a contented smile. “You done with those?” he asked, standing up and coming over to take the walnuts back. “Arthur?”\n“Yes. Walnuts. Excellent. All done.” Arthur’s voice came out a bit cracked and whispery.\nMerlin gave him a puzzled look, but didn’t say anything. He took the bowl and went back to the fireplace, lying down in front of it again.\nArthur stumbled to his feet. He made it to the door, opened it, and tottered out into the corridor. He started walking, hardly noticing where he was going, and twice almost ran straight into a wall. Finally he arrived out on top of one of the towers, and the cold air jolted him back into reality. A reality where Merlin was a sorcerer.\nArthur sank down, leaning his back against the wall. Merlin had magic, and he had never said a word about it. Never trusted Arthur enough to tell him. That hurt, and Arthur felt a rush of anger. But then he remembered that Merlin also hadn’t told him about sleeping in the stables. If he hadn’t come to Arthur with that, why would he have brought this to him?\nMerlin must be terrified. Terrified of someone finding out. Terrified of being executed. But if he had magic—why was he in Camelot of all places? Why had he stayed on as manservant to the crown prince of all people?\nThe answer was so obvious that Arthur couldn’t believe he hadn’t seen it before. Merlin was protecting him. He was using his magic to protect Arthur. A thousand moments suddenly took on a new light. Briefly, the thought occurred to Arthur that perhaps Merlin was simply trying to get close to him, that Merlin had some evil plan in mind. But no—no, Arthur would never believe it of him. Not his Merlin, who snored and always smiled a little when he put on the tunics Arthur had given him and loved cheese and had haltingly asked Arthur the other day if perhaps Arthur might teach him how to play Twelve Man Morris.\nBut his father—the king—if he knew…\nHe wasn’t going to know. That was all there was to it. Arthur would keep Merlin’s secret. He would keep him safe.\nBut that night, when Merlin had crawled into bed next to him, and was settling down into the pillows with a happy sigh, Arthur knew—he knew what Merlin had done for him, how scared Merlin was, and—and oh gods, he loved him. He leaned forward and gently pressed his lips to Merlin’s.\nMerlin drew in a sharp breath, and his eyes snapped open. “Arthur, what—”\nArthur kissed him again. Merlin blinked, looking endearingly confused. So Arthur kissed him once more. And this time Merlin kissed him back.\n“Arthur,” he breathed softly when they pulled apart. “I—” And then he suddenly rolled onto Arthur, pinning down his shoulders, and claimed his mouth again.\n“I take it you’ve wanted to do that for a while?” Arthur managed to say, a bit breathless.\n“Yes, but I thought—”\n“Don’t,” Arthur replied, and rolled Merlin over so that he was on top, pressing Merlin into the bed.\nMerlin complied for once and didn’t think or talk, just kissed Arthur and started tugging at Arthur’s shirt. As Arthur stripped it off, he had a sudden thought. It was probably ridiculous, but—well—there were certain stories. Rather bawdy stories and people usually stopped telling them when their prince drew near, which was quite annoying. But the stories, which were about sorcerers, suggested that—that said sorcerers could not maintain control of their magic when being physically pleasured.\nWhat if Merlin lost control? Now that he knew, Arthur was very curious to see Merlin actually do magic. Besides, it seemed silly for both of them to try and keep a secret from each other that both of them knew even if Merlin didn’t know that he knew and—well, it was confusing enough just thinking about it. Arthur didn’t think he could pull it off in actual conversation.\nSo he proceeded to make Merlin lose control. First, he spent some time licking and sucking at Merlin’s collarbone. This made Merlin squirm a bit and groan rather loudly. When he cupped Merlin through his trousers and squeezed, Merlin arched up off the bed and started trying to undo his laces. Arthur stopped that, batting Merlin’s hands away. Merlin whimpered as Arthur slowly, ever so slowly, worked them open, stopping frequently to kiss Merlin or nibble a little on his ear.\n“Finally,” Merlin gasped, when Arthur finally pulled down his breeches to reveal Merlin’s hard cock. Arthur took off his own breeches and then divested Merlin of his tunic. The blankets were tumbled down at the end of the bed, and it should have been cold, but it wasn’t. In fact, the air was quite pleasantly warm.\nArthur smiled and reached down to stroke Merlin. Merlin moaned and his eyes fluttered shut, but not before Arthur caught the glimpse of gold.\n“Look at me,” Arthur whispered, and Merlin did, his eyes widening as Arthur started licking his fingers, getting them nice and wet. Merlin pushed his hips up hopefully, and Arthur wrapped his hand around Merlin again. He bent down and sucked on one of Merlin’s nipples, and Merlin made a surprised noise. Arthur quickly glanced up and saw that flash of gold again.\n“Arthur—Arthur, I—” Merlin started to say, his voice shaking, but Arthur slid down and took Merlin in his mouth, and Merlin’s words cut off into a stuttered moan.\nWhen Merlin’s fingers wound into his hair, Arthur hummed, pleased, swirling his tongue around Merlin’s cock.\n“Oh, oh, fuck, Arthur,” Merlin gasped, and his hips thrust forward, his cock hitting Arthur’s throat. Arthur gagged and pulled back.\n“Sorry! Sorry,” Merlin said, his voice hoarse. His hair was damp with sweat, and he was breathing hard.\n“It’s okay,” Arthur murmured, pulling Merlin into a quick kiss. He could see the gold swirling in Merlin’s eyes for a second before Merlin closed them. Arthur went back to what he had been doing, licking Merlin’s cock before sucking it in again, and when Merlin put his hands back in Arthur’s hair, they were trembling.\nHe felt Merlin tense and then he was coming. Arthur pulled off and looked up in time to see every object in the room—including the bed—suddenly levitate a few inches into the air. There was a humming noise, and it was hot enough that Arthur was sweating, his skin slipping along Merlin’s. Merlin shuddered and collapsed back into the pillows. The bed settled heavily back onto the floor.\n“That was amazing,” Arthur whispered, lowering himself onto Merlin. He rutted against Merlin’s stomach, his cock sliding in Merlin’s come. Merlin opened his eyes, looking dazed and entirely out of it. Arthur groaned and reached down to pump himself, and then came, spurting onto Merlin’s skin. Merlin whimpered, and his eyes flared gold once more. There was a soft ‘wump’ as a lump of soot fell down into the fireplace and a cloud of ash billowed into the room.\n“That—not so amazing,” Arthur wheezed, coughing as he got up to open a window. When he turned back, Merlin was backed up against the headboard, eyes wide with terror.\n“I—I can explain! It wasn’t what you think, Arthur, really!” Merlin swallowed hard. “It was just—I just—”\n“It was magic,” Arthur said calmly and got back into the bed. He reached for Merlin, and Merlin flinched away. Arthur sighed and lowered his hand. “Do I look upset?”\n“Yes!” Merlin paused and looked at Arthur again. “Or—no? Why—why aren’t you?”\n“I saw you doing some magic earlier,” Arthur admitted. “And I wanted to make sure—to see what it was like.”\n“So this—” Merlin choked and gestured at the bed. “You just did this to—to make me reveal it?”\n“What? No!” Arthur exclaimed, appalled. “No. I’ve wanted to do this for, well, quite a long time actually. But—but I did want to see your magic. I thought you might never tell me, otherwise.”\nMerlin looked away. “I’m sorry. I should have told you. I wanted to—so many times. But—but I was afraid. Afraid of what you would think of me.”\nArthur tried to touch him again, and this time Merlin let him. He let Arthur draw him into his arms. “I think you’re brave,” Arthur murmured, kissing Merlin. “Loyal.” He drew his fingers through Merlin’s hair. “Wonderful.” He settled Merlin against him. “And I want you to stay. Stay right here with me. Always.”\nMerlin sighed and the tension fled from his limbs. He tilted his head, enough to kiss Arthur jaw.\n“I will.”\n*\nListening to Arthur’s breathing, having Arthur’s arm wrapped around him, smelling Arthur’s skin—and the beautiful, freeing sensation of no longer having to hide his magic—Merlin didn’t feel lost anymore. He didn’t feel lonely and uncertain, the way he had ever since Ilberd had thrown him out. He had a home again. A home here with Arthur."
}