{
    "id": "16731783",
    "url": "https://archiveofourown.org/works/16731783?view_full_work=true",
    "author": [
        "dracogotgame"
    ],
    "title": "Guess Who's Coming to Dinner",
    "rating": "General Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings",
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Draco Malfoy/Harry Potter",
        "Sirius Black/Remus Lupin",
        "James Potter/Lily Evans Potter"
    ],
    "characters": [
        "Draco Malfoy",
        "Harry Potter",
        "James Potter",
        "Lily Evans Potter",
        "Sirius Black",
        "Remus Lupin",
        "Teddy Lupin"
    ],
    "additional_tags": [
        "Not Canon Compliant",
        "Alternate Universe - Canon Divergence",
        "james and lily live",
        "Family",
        "Humour",
        "Fluff",
        "Established Relationship",
        "Protective",
        "I Fixed Everything",
        "But I Kinda Had to break the universe to do it",
        "I think it worked out okay",
        "Oneshot",
        "No prophecy",
        "No boy who lived",
        "Bisexual Harry",
        "slightly OOC"
    ],
    "language": "English",
    "series": "",
    "published": "2018-11-25",
    "completed": null,
    "words": "5,098",
    "chapters": "1/1",
    "comments": "171",
    "kudos": "12,400",
    "bookmarks": "1,788",
    "hits": "93,267",
    "summary": "<p>Harry's bringing his boyfriend home to meet his parents. It goes about as well as can be expected.</p>",
    "notes": "<p>This was written for the fantastic prompt provided by <a href=\"https://hairasuntouchedaspartoftheamazon.tumblr.com/\" rel=\"nofollow\">hairasuntouchedaspartoftheamazon</a> on tumblr: </p>\n<p>\n<i>Harry Potter AU where all the Potters live and there’s no war etc. Harry is bi, ends up dating Draco. Cue a torn James Potter, who really wants to hate the kid because he’s a Slytherin and a Malfoy and not that Weasely girl, come on Harry, he liked her. But on the other hand, HE LOVES QUIDDITCH AND HES A SEEKER AND A BLOODY GOOD ONE AT THAT, and he sides with James on debates about players that he always loses against Lily and Harry, so James is very torn about whether he wants to kill the kid or ask him to move in.</i>\n</p>\n<p>Warnings for massive, massive canon divergence. But this was so much fun, I really don't care.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Okay, so...I admit I went a little OOC with Harry not liking Quidditch as much as he does in canon. My reasoning was that maybe a Harry who grew up with his father, instead of trying to find a connection with him in every little thing James ever touched, may be less connected to Quidditch in this AU. I thought it worked alright, but if you disagree, I can totally get that.</p>",
    "text": "The entire house smelled like garlic and spices. James wrinkled his nose but wisely kept his silence. He had been informed — repeatedly — how monumentally important this dinner was, and he was not stupid enough to get between Lily and her over-seasoning. Not when she’d finally got the roast in the oven and succumbed to a small meltdown over pudding. Instead, he focused on fishing the good silverware out of the cupboards and oh-so-subtly prying for information.\n“What’s his name again?”\nLily hummed thoughtfully as she added six — six cinnamon sticks — to her mulled wine concoction. James felt his throat clench in protest but he managed to keep a straight face and focus on his wife.\n“Draco, isn’t it?” Lily mused thoughtfully. “Unusual name, but…I think I like it. Very old-fashioned.”\nJames snorted. Yeah, old-fashioned was one way to describe the Malfoys. Also, uptight, puritanical, snobbish and so painfully conformist he’d bet they still brewed their tea in brass cauldrons and bestowed ceremonial beatings on their house-elves. In summation, he was not a fan and he didn’t understand how Lily could be so calm about all of…well, this.\n“Does this wine look right to you?” Lily asked, cocking her head and frowning at the bubbling, frothy mess on the stove-top. “Alice said to…you know, never mind. I’ll just throw in some more star anise, I’m sure it’ll be fine.”\n“So what do we really know about this kid?” James asked, in a last ditch attempt to distract her. Lily turned to him and he promptly seized an opportunity to edge in around her and rescue the wine. “You know,” he coaxed as he stirred some brandy in, “other than the basics.”\n“Harry only gave me the footnotes when he called,” she admitted, crossing her arms and leaning against the counter. “They knew each other at Hogwarts, didn’t always get along. You know, Gryffindor, Slytherin…that kind of thing. Oh!” She snapped her fingers, making James jump a little. “Do you remember that one time McGonagall called us when Harry got the bad end of a Jelly Legs Jinx? Apparently, that was him.”\nUnderstandably, this didn’t do much to reassure James. “So he’s a Slytherin, he’s Lucius Malfoy’s son and he hexed my kid,” he listed off dryly. “Remind me, why are we letting this boy in the house again?”\nLily scoffed incredulously. “Really, James?” she quipped. “You want to talk about pulling pigtails in the school-yard?” Okay, so she had him there. Lily smirked victoriously and nudged him out of the way with her hip. “If it helps at all, I’m sure your son gave as good as he got. Besides, it was years ago. They’re all grown up now and they’ve been dating for months. And you –” she gave him a pointed look – “are going to behave yourself. It’s not every day Harry asks to bring someone to dinner. The only other one who got that far was little Miss What’s-Her-Face.”\n“Cho Chang?” James put in helpfully. He remembered the bright, young brunette from about a year ago. Pretty, smart, solid Puddlemere U fan…he’d actually liked her. Lily, on the other hand…James snorted. “You just don’t like her because she said your chicken was a little dry.” Lily glared at him and he wisely changed the subject. “How about the Weasley girl? Wasn’t Harry seeing her? She was cute.”\nLily rolled her eyes. “Very. I’m sure Nymphadora agrees, considering they’re sharing a flat in Diagon Alley.”\n“Yeah?” James perked up at the mention of Tonks. The kid was his best Auror, now that Kingsley had officially moved on to politics. “I didn’t know they were friends.”\n“They’re lesbians, James.”\nWait, what? James gaped at her and threw his arms up in incredulous defeat. “How come I never know these things?”\nLily shrugged. “It took you four years to figure out Sirius and Moony were together, you tell me.” Her green eyes lit up speculatively. “You know, if you really want to complain about Draco, I’ll bet Padfoot will join you. He loves bitching about family, you know that.”\nThat…wasn’t the worst idea, actually. Didn’t Padfoot’s fright of a cousin end up with Lucius Malfoy? That meant Draco was probably his second cousin. Or nephew. Or something. If the boy was hiding some dark, potentially deal-breaking secret, Padfoot would know for sure. He still kept tabs on estranged relatives— a precautionary measure James heartily endorsed. “That’s not a bad idea,” he said out loud. “Maybe I’ll just head over for a check in, get the lay of the land, you know?”\n“You do that, Head Auror.” Lily’s answering laugh was all amusement and fond exasperation. “But be back in an hour. The boys will be here by then, and I need you to set the table.”\nGreat. So, Malfoy Junior was officially one of the boys now. James’s mouth twisted. This was starting to get out of hand. Clearly, he had work to do if he wanted to contain this situation. So, he nodded to himself and stole a kiss from his beautiful wife. “I’ll leave right now.”\n“Good. And I’ll get back to my recipe.”\n“You mean, Alice Longbottom’s recipe.”\nLily gave him another kiss and her lips quirked in a soft, dangerous smile. “James, darling? You’re the love of my life but if you don’t get out of my kitchen right now, I will hex you.”\nPoint taken.\nJames grabbed his coat and headed to the Floo.\n \nIn minutes, he was comfortably ensconced in an armchair at his best friends’ flat, twirling a glass of Ogden’s and watching tiny Teddy play with his blocks. Teddy gurgled happily and waved a chubby fist at the grown-ups. James couldn’t help but smile fondly. Godric, had Harry ever been this little? Every time he saw Teddy, his heart soared with happiness for his friends. It had taken years before they were even seriously considered for adoption, thanks to Remus’s affliction. But Teddy was here at last, and they couldn’t be happier. James raised his glass in a silent toast before turning to Sirius.\n“Draco Malfoy,” he declared ominously. “Tell me everything.”\nSirius made a wibbly-wobbly gesture with his hands before succumbing to a disinterested shrug. “Meh.”\n“Meh?” James echoed. “That’s all you’ve got for me? He’s your cousin!”\n“Or nephew,” Sirius drawled consideringly. “Or something. I don’t know what to tell you, Prongsy. I barely know him. Reg’s the one who keeps up with that side of the family.”\n“And what did your creepy little brother have to say about Draco Malfoy?” James demanded. Teddy gurgled urgently and toddled over to his father. James bit back on a resigned sigh as Sirius was immediately distracted. He Shifted — much to Teddy’s delight — and barked affably, nuzzling and fussing as the child grabbed at his fur with tiny fists.\n“Sirius.” Remus entered, sighing and shaking his head disapprovingly. “How many times…if you rile him up right before bed, he won’t sleep all night.”\nSirius yipped apologetically and Shifted back. “Sorry, love,” he grinned, placating his husband with a sweet kiss and settling back down with the baby.\nRemus gave him a fond look and took a seat too, shifting his attention to James easily. “Why the sudden interest in Draco Malfoy?”\n“What, I’m not allowed to enquire about my son’s former classmates or…”\n“Prongs.”\nJames held up his hands in defeat at Moony’s warning tone. They’d collectively learned a long time ago that The Tone was not to be ignored. “Fine. Harry’s dating him and he’s coming to dinner. I’m just trying to figure out this kid’s deal. Did you know he used to hex Harry back at Hogwarts?”\nRemus cocked his head. “As far as I remember, Harry hexed him right back. Of course, I only taught them DADA for one term before I quit, but…they sort of reminded me of you and Lily at that age.” His lips twitched at James’s noticeably sour expression. “Sorry.”\n“Wow,” James declared with genuine amazement. “You two are no help at all.”\nSirius didn’t look too broken up about it. “Reg did bring him up at dinner one time. He said he’s alright. Which coming from him…well, you know.”\nJames did know. Sirius’s younger brother was notoriously anti-social. Their eventual reconciliation hadn’t done much to soften him up. Allegedly, Teddy was the only one who could get a half-smile out of the dour man. If even Regulus I-hate-everything Black had something halfway decent to say about Malfoy then…\n“It’s not enough,” James declared firmly. “Obviously, I’m going to have to crack this case myself.”\n“Or,” Remus chided, “you could just get to know the boy with an open mind.”\nJames gave him a blank look. “You don’t know me at all, do you?”\nHe glanced at Padfoot — a normally reliable source of support — but all he got was another shrug. “Harry’s got good instincts,” Sirius pointed out.\nMaybe, but that didn’t stop a father from worrying. That’s just how it was. His one job in the world was to protect Harry and keep him safe. Now he was all grown up and dating and that was bad enough but a Malfoy? There was no way this ended well for Harry. That boy was obviously using him, or worse.\nAnd James was going to figure his game out if it was the last thing he did.\n“I’m going home,” he told them. “Got to take care of this.”\nRemus sighed and Sirius smirked and raised a glass. They watched as James disappeared through the fireplace.\n“Lily’s going to kill him if he ruins dinner,” Remus remarked in the silence.\n“He’ll pull through,” Sirius chuckled. “You have to admit, it’s rough when your kids start dating.” Teddy cooed and planted a grubby hand on his cheek. Sirius’s laughter trailed off into a soft smile and he planted an affectionate kiss to his son’s head. “Good thing that’s a long, long way off for us.”\n \nWhen James stumbled out of the Floo, it was to the sounds of conversation and laughter.\n“Dad!” Harry exclaimed, heading straight for him. “You made it!”\nBefore James could blink, he was being enveloped in a crushing hug. His heart warmed and he immediately moved to embrace his boy. Harry was so tall now, it felt like he grew a little more every time James saw him. It was almost hard to remember a time when he’d barely come up to his father’s knee. The thought made him tighten his hold just a little more.\n“I missed you too, kiddo,” he murmured, ruffling Harry’s hair a bit. It was just as messy and unkempt as his own. Those shining green eyes though…that was all Lily.\n“Where have you been?” Harry demanded petulantly. “We’ve been waiting ages.”\nIt was the we that brought him back. James cleared his throat and disentangled himself to peer over his son’s shoulder. Lily grinned and winked at him, before gesturing subtly to her right.\nAnd there he was.\n“Mr. Potter,” Draco Malfoy cleared his throat, stepped forward and extended his hand. “It’s an honour, sir. Harry’s told me so much about you.”\nHuh.\nJames gave it a good five seconds before taking the proffered hand and shaking it firmly. He took his time, sizing up this…interloper in their midst. So this was Draco Malfoy. Dressed in tailored robes sporting the Malfoy crest...well, James had to admit he certainly looked the part. Grey eyes, sharp features, white blond hair — yeah, that was all Lucius Malfoy. The resemblance made his eyes narrow in well-founded suspicion.\n“Malfoy,” he intoned gruffly, when Lily raised a meaningful eyebrow at him. “Welcome to our home.”\nThe for now went unsaid, but he’d like to think it was heavily implied.\n”Thank you, sir,” Malfoy replied, all eloquence and politeness. Oh, he was smooth. And by the looks of it, he already had Lily and Harry eating out the palm of his hand. James’s jaw tightened. Draco Malfoy, he decided, would soon find out that he was a much harder nut to crack.\nLily seemed to have sensed some underlying tension because she quickly stepped in. “It’s so wonderful to finally meet you, Draco,” she said, kind and trusting as always. “We’ve been looking forward to this dinner all week.”\nMalfoy was quick to jump on the offered bone. “The pleasure’s all mine, Mrs. Potter,” he replied, bestowing another smooth, clearly practiced smile on Lily. Her eyes lit up, and so did Harry’s. “If it’s not too forward, I brought a little something for your table.” James bit back on a scoff as Malfoy produced a massive bouquet of Madonna Lilies and offered them to…oh right, lilies for Lily.\nCute.\n“They’re beautiful,” Lily exclaimed in delight. “Oh Draco, you shouldn’t have!”\nHarry smiled proudly and laced his fingers with Malfoy’s, and that’s when James decided he had to say something.\n“Interesting choice,” he said stonily. “I mean, lilies are a funeral flower.”\nHarry stared at him. Malfoy blinked but quickly recovered with a small, sheepish smile. As for Lily…well, it took all his Auror training not to quail at the look she gave him. James swallowed. Suddenly, his throat felt very dry. Where was that over-spiced mulled wine when he needed it?\n“Oh, you never know, darling,” Lily said, light and breezy and utterly menacing. “They might just come in handy.” With that sorted, she gave them all another dazzling smile and proceeded to usher everyone into the dining room, effectively dispelling the awkward silence. “Well, I hope everyone’s built up an appetite! Draco dear, sit anywhere you like. Oh and Harry, be a lamb and fetch me a vase for these gorgeous lilies.”\n \nDinner progressed, as dinners tend to do. James glared sullenly into his wine, resolutely ignoring the conversation around him despite Lily’s watchful eye. Everyone seemed to be doing just fine without his input anyway. Malfoy was having no trouble holding court. So far, he’d been a model guest — making easy conversation, showering Lily with compliments on everything from her Charms work to the food, liberally summoning wine…no doubt it was all those etiquette lessons Lucius Malfoy had obviously sprung for.\nAnd that wasn’t even the worst part. The boy was sitting right next to Harry and — despite their laughable attempts to be respectfully discrete — they clearly couldn’t keep their hands off each other. Every time James looked over, they were brushing shoulders or exchanging soft smiles and glances or lacing their fingers together. Harry was clearly besotted by the kid, and as much as he hated to admit it, Malfoy seemed to honestly return the sentiment. It was all kinds of terrible.\nJames wasn’t sure he could take it anymore. He speared a piece of roast with his fork and choked it down, coughing around the liberally seasoned meat.\n“Allow me, Mr. Potter,” Malfoy piped up on cue, sending a glass of wine his way. James managed a half wave in grudging thanks as he took a hearty swig.\nHarry laughed and nudged Lily playfully. “Went a bit wild with the seasoning again, Mum?”\n“Oh, hush you,” Lily scolded, with a smile in her voice. She passed Malfoy the potatoes and rolled her eyes. “You see what I put up with?”\nMalfoy smiled and took a liberal helping. “I wouldn’t take it personally, Mrs. Potter. Everything’s delicious. Some people just don’t have an…adventurous palate.”\nJames scowled. Was that a dig? It sounded like a dig. But Malfoy was looking at Harry now, grinning teasingly at him.\n“Oh, here we go.” Harry rolled his eyes. “Here’s a tip, Mum. Never try Draco’s Pad Thai. I fed some to one of Hagrid’s Fire Salamanders once and it exploded.”\nLily laughed over Malfoy’s protests of exaggeration. The conversation drifted from there, going from food to music to travel…apparently, Malfoy had cheffed at a dive bar in Bangkok, played the cello, spoke fluent German and he and Harry were planning their first trip to Prague soon. James listened to it all, just waiting for this suave, smooth talking little serpent to slip up so he could pin him down.\n“So, Malfoy,” he broke in, when the conversation lulled. “What is it you do exactly?”\nMalfoy blinked, apparently surprised at the direct address. Fair enough, considering James had done an excellent job avoiding him all night. “I’m training to be a Curse Breaker, sir,” he answered carefully. “I’m finishing my apprenticeship with the goblins next week, actually.”\n“He’s really good,” Harry continued, smiling fondly at Malfoy. “Bill Weasley says he’s a shoo-in for…”\n“It’s a noble profession,” James cut in pointedly. Harry frowned and glanced uncertainly at Lily, who pursed her lips. James kept his penetrating gaze trained on Malfoy. “Funny, I had you figured for a politician. Like your old man.”\n“Dad…” Harry began.\n“No, it’s okay,” Malfoy murmured, squeezing his hand gently. He turned back to James. “That…was the plan for a long time,” he admitted. “My father wanted me to follow in his footsteps and I didn’t really see any reason not to.”\n“What made you change your mind?” Lily asked.\nMalfoy smiled faintly and turned to Harry. “He did,” he said softly. “Harry’s always so…he just does what makes him happy. He could have been an Auror like you, Mr. Potter. It would have been safe, sensible thing to do.” He glanced briefly at James. “But he wanted to work with Magical Creatures, so that’s what he did. Honestly, I thought he was mad but…I realised that he’d inspired me. Harry made me want to find my own way. He showed me that I didn’t have to be what was expected of me. So, after a bit of soul searching, I told my parents I was going to be a Curse Breaker and that was it. Of course, Father was not happy but…I am.” His smile widened and he bussed a kiss to Harry’s cheek. “I couldn’t be happier.”\nHarry stared at his boyfriend with wide, shining eyes. “You never told me any of that,” he said softly. Malfoy managed a sheepish grin and Harry leaned into him. “Come here.”\nThey indulged in a sweet, unhurried kiss and Lily sniffed and dabbed her eyes. She gave James a watery smile and gestured to them. He could almost hear her unspoken you see?\nThat was it. That was the moment he officially gave up. The boy was as good as adopted at this point, so why even fight it? Clearly, Draco was everything Harry and Lily wanted so who was he to stand in the way?\nJames drained the rest of his wine and stood up. “I’m going to get some air,” he announced.\nHarry broke away from Malfoy and blinked at him. “Dad?”\nBut James was already out the door.\n \nAll things considered, it was a nice night. James sat on the porch of Godric’s Hollow, alone with his thoughts. The small wireless he’d pilfered from the living room crackled cheerfully beside him. The Semi-Finals were tonight and he had his money on Puddlemere.\n“Mr. Potter?”\nJames started at the soft, cultured voice. He didn’t turn around to look, nor did he react when Draco approached hesitantly, settling beside him on the porch. Honestly, the kid even managed to make slumping on a porch look elegant.\nJames sighed heavily.\nNo wonder they liked each other so much. Harry was wild and spontaneous and carefree, and Draco was cultured and poised and polished. Wasn’t that a thing, opposites attract? It must be, he decided. What other explanation could there possibly be for Moony and Padfoot?\nThe train of thought made him chuckle a bit — which no doubt concerned Draco judging by his discrete side-eye.\n“I swear I’m not always this crazy,” James explained. “You’ll understand, when you’re a parent someday.”\nDraco nodded although it didn’t look like he got it. “Did I do something wrong?” he asked finally.\n“No,” James answered at once, because really, he hadn’t done anything wrong. He was just a kid who wanted his boyfriend’s parents to like him. “No, you didn’t, Draco. It’s just…”\n“You don’t like me,” Draco said. He sounded so resigned about it, like hoping for anything more was pointless.\nJames felt guilt coil deep inside him. “I didn’t expect you,” he corrected. “I think…I think I had this idea of you and I just ran with it.”\n“You thought I’d be more like my father,” Draco concluded. He was sharp, James had to give him that. “If it helps, sir, you’re not the first.”\n“Look, kid. I don’t mean to go after your old man. It’s just…”\n“I understand. My family can be…and yours is…I suppose it was too much to ask to get along right from the start.” He gave James a cautious glance. “Maybe we just need to spend more time together?” James shrugged in reply and Draco took a deep breath, clearly steeling himself for what he had to say next. “Look, Mr. Potter. I realise you might not want to hear this right now, but I think it’s important for you to know. Harry…he’s my everything. He means the world to me and — assuming that he’s alright with it — I plan to spend the rest of my life with him. So, I would strongly suggest that you get used to me because…well, I’m not going anywhere.”\nFair enough. Fair. Enough.\nJames nodded firmly, clapped the boy’s shoulder and looked him dead in the eye. “If you ever hurt my son, I will hunt you down.”\nDraco cracked a smile, even if it was a little shaky. “Duly noted, sir.”\nWell, that was that. James withdrew and reached out to tune the wireless. If they were really doing this whole bonding thing, Quidditch scores were a good place to start. And after all this, he would be remiss not to give this boy a fair shot.\n“I assume you have the good sense to support Puddlemere United?” he asked.\n“Who else would I support?” Draco asked, sounding genuinely confused. “The Arrows? Or Merlin forbid, the Chudley Cannons?” He visibly shuddered at the thought and James couldn’t help a bark of laughter.\n“Harry likes the Cannons,” he pointed out. It was one of the few things they’d always argued about.\n“And I love him despite that,” Draco reassured with a smirk. “It’s all Ron Weasley’s fault, you know. He’s a terrible influence on your son.”\nThey chuckled and swapped player stats until the announcements started. James shushed the boy and held the wireless up, craning to hear. Draco shuffled closer, all propriety promptly forgotten, contorting into James’s space to get a hint of the news. Puddlemere had the Quaffle, they lost it, they got it again, and…\n“Yes!” Draco howled, pumping a victorious fist in the air. “Blenkinshop kills it again!”\n“He’s a national treasure! Why they have him in Reserve I’ll never know, he should be front and centre at the…”\n“That’s exactly what I said…”\n“Shh! Draco, shh! They’ve spotted the Snitch!”\nCheers rang out from the wireless and James whooped like a madman as Draco eagerly joined in.\n \nMeanwhile, back at the house, things were a lot less cheery.\nHarry glared sullenly as the plates floated into the kitchen and set themselves neatly in the sink.\n“What’s Dad’s problem?” he burst out. He’d been simmering in silence ever since his father had all but fled from the table, and Draco had cautiously opted to follow him. Now they were both gone and he just…he didn’t know what they could have done differently.\nLily smiled gently and brushed a kiss to his temple. “Oh, sweetheart,” she murmured. “I’m sorry tonight didn’t go the way you wanted.”\nHarry huffed and slumped on the couch. He turned big, sad eyes on her and it was all she could do not to take him in her arms and hold him until it was all better. But Harry wasn’t six anymore and this wasn’t a scraped knee or a banged up elbow. She would just have to do her best to be there for him — and give James a piece of her mind later. “You’re his baby boy,” she explained gently. “As far as your Dad’s concerned, nobody could ever be good enough for you. You could have brought home Celestina Warbeck and he’d still find something to complain about.”\nHarry made a face. “Really? Celestina Warbeck. That’s the bar then, is it?”\nLily grinned and ruffled his hair. “You know what I mean.”\n“I know,” he sighed. A thought struck him and it was painful enough to bring a sting to his eyes. “Is it…is it because Draco’s a man?”\n“No.” Lily refuted that at once. “No, Harry. Never. You’re our son and we love you no matter what. If you’re happy, if you love him and he makes you happy…then we love him. It might take your Dad a while to get there, but he will get there. I promise.”  \nHarry cracked a smile. “I do love him, you know,” he admitted quietly.\n“I know, sweetheart.”\n“I just wanted you and Dad to like him too.” He looked up at her hopefully. “You do, right?”\nLily just pressed a kiss to his forehead. “He’s polite, charming, sweet and he likes my cooking. Trust me, we’re keeping this one,” she said firmly. Harry pulled her into a tight hug and she smiled into his hair. Everything would be just fine, she knew it. Lily gave her boy a reassuring squeeze before pulling away. “Now, let’s go find them, hm? I think a little dessert is just the thing to pull this party back together.”\n“Yeah. Yeah, okay. I think they’re outside…”\nThe shout rang out suddenly, scaring at least ten years off Harry’s life. He exchanged an alarmed look with his mother and then they were both running for the door, wands out and raised. Harry stumbled out on the porch, searching for the source of all the unholy screeching, prepared for anything from hexes to a literal punch up...\n“Oh,” Lily blurted, coming to a halt right beside him.\nHarry just stared, unable to comprehend what he was seeing.\n“I told you!” James was yelling, holding the wireless aloft. “What did I tell you?”\n“Salazar, did you hear the crowd?” Draco ran his hands through his hair, all composure forgotten. He was flushed and grinning, eyes bright with excitement. “That had to be a new world record!”\nJames whooped and threw an arm around Draco’s shoulders, jostling him playfully. “You’re alright, kid. Say, did you play back at school?”\n“Seeker, yeah!” Draco replied, nodding frantically.\n“Me too!”\n“I’m out of practice though. Father thinks Quidditch is for plebians and vagabonds…”\n“Harry hates it too! Go figure!”\nHarry’s jaw dropped. “I do not hate Quidditch,” he informed his mother indignantly. “I’m just not a lunatic about it like some…”\nLily waved a hand to shush him. She was trying to keep a straight face, but a stifled laugh escaped her anyway. “Just let it play out, baby,” she told him. “Just…let them go.”\n“I’ve got a couple brooms in the shed,” James was saying, already dragging Draco towards said shed. “You ever played Seeker’s Tag on a Firebolt?”\n“You have a Firebolt?!”\nAnd with that, they bolted off, leaving Lily smiling behind them and Harry gaping in the dust.\n“Quidditch,” he mumbled. How could he have missed…? He knew what Dad was like about the sport. And Draco honestly scared him during World Cup Season. And yet somehow, he hadn’t put two and two together. He shook his head, amazed at his own cluelessness and turned to his mother for emotional support. “Quidditch,” he bleated helplessly.\nLily was practically doubled over with laughter by this point. It took her a good two minutes to compose herself, and by the time she did, two brooms were easily spotted in the sky, swooping and sailing towards a golden ball glinting in the moonlight.\n“Come on,” she laughed, herding her baffled boy indoors. “Let’s get you some pudding. And we’ll make a plate for your father and his new best friend too.”\n \n\nSix months later:\n\nThe Floo flared up at six in the morning, bathing the corridors of their small flat in bright green. Harry muttered sullen curses under his breath as he stumbled, still half-asleep to the living room. If this was what he thought it was…\n“Hey, son!” James waved cheerfully through the flames. “Merlin, you look awful. Are you getting enough sleep?”\nHarry groaned and palmed his face. “Dad,” he moaned. “It’s Saturday.”\n“Oh, is it? Well, I was just heading out for a run and I thought I’d check in and say hi…”\n“Save it,” Harry grumbled. “I know you’re not calling for me.”\nAwkward silence. It lasted maybe a beat or two before…\n“So, can Draco come out to play or…?”\n“Draco!” Harry yelled, slumping on the couch and mentally willing the coffee to make itself this morning. “It’s for you!”\nHe wasn’t even slightly surprised when Draco bounced out, already dressed in full Quidditch gear. It took him thirty minutes to gear up on a good day. When had he even woken up? Harry decided he didn’t want to know. Nothing good ever came from getting in between those two and their Quidditch obsession.\n“Hey James,” Draco said, hoisting his broom up in greeting. “I’m all set.”\n“So what are you waiting for, an engraved invitation? Get over here, son!”\nHarry grumbled and rubbed his eyes as Draco kissed him goodbye.\n“I’ll be back soon,” he promised. “Go back to bed, you look exhausted.”\n“Gosh, I wonder why,” Harry muttered. He scowled blearily at his father, still grinning in the flames. “If you don’t return my boyfriend in two hours, I’m calling Mum. And I will tell her about the window you broke.”\n“Yeah yeah, two hours. Merlin, you’re just like your mother with the nagging…”\nHarry waved him off and buried his head under a cushion. The hiss of the Floo faded away with the sounds of his boyfriend and his father excitedly swapping Quidditch strategies for the day.\n\nHonestly.\n\nStill, despite his exasperation and annoyance at all things Quidditch, an amused smile played on his lips. All in all, that dinner could have been a lot worse. Harry settled in, bemused but content with how things had played out.\nHe was asleep again before the ash had settled."
}