{
    "id": "16856581",
    "url": "https://archiveofourown.org/works/16856581?view_full_work=true",
    "author": [
        "Lomonaaeren"
    ],
    "title": "Music Beneath the Mountains",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Goblins & Harry Potter"
    ],
    "characters": [
        "Harry Potter",
        "Goblins (Harry Potter)",
        "Garrick Ollivander",
        "Hogwarts Staff"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence",
        "Harry Potter was Raised by Other(s)",
        "Present Tense",
        "Worldbuilding",
        "Canonical Child Abuse"
    ],
    "language": "English",
    "series": "Part 21 of From Samhain to the SolsticePart 1 of Realm of Song",
    "published": "2018-12-05",
    "completed": "2018-12-06",
    "words": "7,324",
    "chapters": "2/2",
    "comments": "512",
    "kudos": "16,183",
    "bookmarks": "1,987",
    "hits": "142,539",
    "summary": "<p>Little Harry Potter wanders away from the Dursleys’ home one day and is found by a goblin on a mission from Gringotts. Harry grows up in the goblin deeps.</p>",
    "notes": "<p>This is a story being written for my “Samhain to Solstice” series of fics being posted between Halloween and the Winter Solstice this year. The title is a variation of a line from J. R. R. Tolkien’s poem “Song of Durin,” quoted below, and the section titles likewise come from that poem. This is a twoshot, with a second part to be posted tomorrow.</p>\n<p> </p>\n<p> <i>Unwearied then were Durin's folk;</i><br><i>Beneath the mountains music woke…</i></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>This is the end for now, but I will probably write a sequel someday.</p>",
    "text": " The World Was Young\n“What is this?”\nThe boy looks up. He’s been wandering by himself for a long time. His stomach aches, and he thinks that his aunt is going to be so angry with him. But he can’t find the way back by himself, he really can’t.\nBending over him is what looks like an ugly person. But the boy is used to his uncle and cousin being ugly, and he just looks at the person’s jagged teeth and narrowed eyes and claws on his hands. He doesn’t flinch when the person reaches out and picks him up. He thinks that maybe they’re going to take him home.\n“Why are you here?” the person asks him.\nPeople rarely ask the boy questions. He has to think about it before he finally answers, “I went out of the garden.”\n“You’re lost?”\nThe boy nods. That ought to explain it, he thinks, and now the person will take him home.\nBut the person just goes on staring at him, as if lost boys are strange. Then he reaches up and brushes away the boy’s hair. The boy flinches. He’s sure, he’s sure, that any second the person is going to laugh at his scar. His aunt is always telling him how ugly it is. Sometimes the boy thinks he would like it if she didn’t call it ugly, but that never happens.\n“Your name is Harry Potter?”\nThe boy hesitates. “I don’t know?”\n“You must know. Human children are old enough by your age to know their names!”\n“Well, I mean, I just get called boy and freak,” the boy explains, even though he doesn’t like explaining it. “Maybe my name is Harry Potter? I think Aunt Petunia called me Harry once.”\nThe person closes his eyes and mutters to himself in what sounds like another language. The boy listens with interest. “Can I learn that language?” he asks, when the person falls silent and opens his eyes again.\n“Listen to me. I called you a human child. Don’t you know what that means?”\n“You’re not human?”\nThe person starts to answer, and then pauses. “And that doesn’t bother you?”\nThe boy shakes his head. He feels a little hopeful. Maybe he’s found a freak, like him. Maybe the person will take him away to the land where all the freaks live, and then he’ll be with people like him and won’t have to wash the dishes or weed the garden again. “Can I come with you to where your land is?”\nThe person just keeps staring at him. Then he asks, “What are your relatives like?”\n“They don’t like me. They call me freak. I sleep in a cupboard—”\n“What?”\n“A cupboard,” the boy repeats, glaring at the person. He can’t tell the truth if the person keeps interrupting! “It’s under the stairs. My cousin has two bedrooms, but they say I can’t have one. Because I’m a freak.”\nThe person chatters his teeth together sharply. It makes a noise like something dangerous. The boy hopes he can learn to do that, too. Before he can ask the question, the person smiles. “So they won’t come looking for you?”\n“I don’t think so. They don’t know where I am right now.”\nThe person nods and says, “Then you can come with me. There is a land for my kind—we are called goblins—and I think we should have the charge of raising you. Since your guardians have done such a poor one.” He laughs deep down in his chest. The boy thinks the sound is kind of scary, but it makes the goblin’s chest underneath him vibrate pleasantly.\n“Okay. Can I learn your language? Can I chatter my teeth like you do?”\nThe goblin nods and begins to carry him away. The people walking by don’t seem to notice them, the boy realizes. It’s as if they have a magical bubble traveling with them. “You may need some help with the teeth. But you will receive all the help you need, and more, from my clan.”\n*\n“I suppose you don’t know what you’re doing.”\n“Of course I do.”\nThe goblin who rescued the boy is called Ripclaw, he has learned. He thinks it’s a wonderful name. He plays next to the desk in the office that Ripclaw has brought him to. They don’t think he’s listening, but he is. The boy learned how to listen when he was young. Sometimes that means he can avoid Uncle Vernon or Aunt Petunia when they’re in a bad mood, or Dudley when he’s coming with his gang.\n“The wizards are going to come looking for him.”\n“Let’s ask him. Potter!”\nThe boy stands up and walks obediently around the desk. They’re underground, he knows that much, from the stone walls and the cool air around them. But the desk really does look exactly like the one in offices he’s sometimes seen on the telly, when Dudley doesn’t notice him standing in the kitchen doorway. It’s huge and made of white rock and has gold lines in it. Another goblin leans down from behind it and stares at him.\n“What is a wizard?” the goblin asks.\nThe boy considers it carefully. He hopes this isn’t some kind of test. He’ll probably fail it. “I don’t know,” he finally has to say.\nRipclaw laughs. The goblin behind the desk, who also has gold in his teeth, gives Ripclaw a harsh look that makes the boy step back. He doesn’t want to be in between them if the desk goblin attacks Ripclaw the way Uncle Vernon attacks Harry.\nBut instead, the desk goblin turns back to Harry. “A wizard is a person like you who can do magic.”\n“I can’t do magic.”\n“Surely something has happened around you? Something strange that the Muggles couldn’t explain?”\n“I don’t know, because I don’t know what a Muggle is.” The boy hopes that the desk goblin is calmer than he looks, because otherwise he’s probably going to get tossed out. Then he’ll never get to learn that language or chatter his teeth like Ripclaw.\n“The Muggles are humans like your aunt and uncle who don’t have any magic.” The desk goblin lowers his hand and rips the side of the desk up with a screeching sound. The boy hopes he can learn to do that, too.\n“Oh.” The boy thinks about it. Then he offers, “Once I got up on the roof of the school without knowing how I did it. Dudley, he’s my cousin, he was chasing me with his friends and I knew they were going to beat me up, and I ran fast, and then the wind tossed me up on the roof of the school.”\n“That’s not the wind. That was your magic.”\nThe boy gives that some consideration. Uncle Vernon says there’s no such thing as magic. But then, Uncle Vernon probably thinks there’s no such thing as goblins, too. The boy feels that maybe Uncle Vernon isn’t as smart as he always thought he was.\n“All right. Then I suppose I’m a wizard?”\n“Yes. You are. And famous among them, for surviving a curse that no one else could survive.” Ripclaw leans forwards, and the boy holds still as he traces the zigzag path of the scar on his forehead with one talon. “You have the most inspired luck. Or perhaps someone did powerful magic to protect you.”\nThe desk goblin says something in the language that the boy wants to learn. Ripclaw answers, and it sounds like they’re arguing. The boy hunches his shoulders a little. He doesn’t like arguments. They always seem to end up with him getting hurt.\n“But they must know where he is,” the desk goblin finally says in English.\n“I suspect not.” Ripclaw glances at the boy. “I want you to tell Gorgeslitter what you told me. About what your relatives called you and where you sleep.”\n“They call me freak. I sleep in a cupboard. My cousin beats me up a lot,” the boy adds, because Gorgeslitter’s face is getting dark but the boy is starting to think that he isn’t angry at him. “They want me to make meals for them. Sometimes I have to do it and sometimes I don’t. They don’t like it when I act like a freak—I mean, use magic.”\nGorgeslitter stands up and leaves the office. The boy glances at Ripclaw. “Do I get to stay?”\n“Gorgeslitter needs to check some things.” Ripclaw takes a long knife from somewhere. One minute his hand isn’t holding it, and the next it is. “In the meantime, why don’t you come here and I’ll show you some of the finer points of using a blade?”\n*\nThe boy thinks he’s getting pretty good at holding the knife and twisting it so that it will cut flesh or fur by the time Gorgeslitter comes back. There are more goblins behind him. The boy holds the knife so that it points at the floor. The first thing Ripclaw told him, besides who made the knife and how old it is, is that you never point it at another goblin unless you’re challenging them.\nThe boy is still determined to be a goblin. It sounds much more interesting than being a wizard.\n“We have decided,” says Gorgeslitter, motioning at the goblins with one claw. The boy watches them. They wear all sorts of blades, and some carry spears. They have bracelets and collars and rings of metal, too, and some of them have caps. Helmets, the boy thinks that’s the word. “If the humans do not want him, we will take him in.”\nThe boy whoops and dances around with the knife in his hand, taking care to keep it pointed at the floor. He makes it all the way around, and stops to see Gorgeslitter staring hard at Ripclaw. “Was that necessary?” he asks, pointing at the knife.\n“He wants to be a goblin. You can’t start him too young.”\n“And I’m already six,” the boy thinks he has to say. “I’m six years behind all the other goblins.”\nThere is a murmur from some of the goblins behind Gorgeslitter, and one that Harry thinks is a woman moves forwards. She has a chain of teeth around her neck and thick bracelets on her wrists. The boy looks at her. “What’s your name?” he asks.\n“Toothsplitter,” she says. “I am a smith. Do you know what that is?”\nThe boy shakes his head. Toothsplitter touches him gently on the forehead. “Then I will tell you, as soon as you tell me your name in return. It is very rude in goblin society to offer your name and be scorned.”\n“Oh.” The boy flushes. “Sorry. My name is—Harry Potter.” When he says it, he says it more confidently than he ever has, and he knows that he is leaving “freak” and “boy” behind forever.\n“Better. I make weapons and jewelry and many other things out of metal. Come and see the smithy.”\nToothsplitter takes his hand, and Harry gives the knife back to Ripclaw with a whispered thanks. Or he tries to give it back. Ripclaw steps away and shakes his head. “Keep the knife. Your first knife is always lucky. And you’ll remember old Ripclaw when you’re great and powerful.”\nHarry thinks that’s kind of silly, because he doesn’t want to be great and powerful, he just wants to be a goblin. But he nods and smiles at Ripclaw, and then Toothsplitter takes him through a hole in the wall and down a long tunnel that’s lit by fires. Harry thinks they’re brilliant. They’re not torches on the walls, but fires that dance on the walls. Toothsplitter lets him stop at one point and reach out so that he can touch one.\n“They’re geodes,” she tells him. “Bits of gems that we’ve embedded in the walls, so that they can reflect any sort of faint illumination and fill our lives with light.”\nHarry is learning all sorts of new words today, but not the ones he wants to learn. “How do you say those things in your language?”\nToothsplitter laughs and tells him. Harry rolls the words around in his mouth like rocks as they go down and down.\nThey finally come to a huge archway that has darkness behind it. No, wait, not darkness. When Harry squints, he can make out red flashes in that darkness. It looks as though something’s on fire in the distance.\n“Come and see,” Toothsplitter says, and she guides him under the archway. There’s a snake with spread wings over it. But Toothsplitter tells him it’s a dragon, and their image brings good luck to smiths, because dragons have the hottest fire.\nThey step into the darkness, and Toothsplitter says something in the goblin language. The darkness suddenly flashes harder and harder, and Harry is looking out into the largest cave he’s ever seen or dreamed of. He can’t even see the walls.\nThere are glowing red fires everywhere, and huge lakes that are silver and gold—Toothsplitter tells him there are actual metals in those lakes, not just water—and goblins walking around with stones and axes and geodes and rings and knives, and hissing steam as water gets poured over the fires, and ringing hammers, and voices singing. Harry isn’t sure about the singing voices at first, but then he listens, and they’re there. He hops up and down in delight.\nThe songs rise and twist back and forth. They’re in the goblin language. Harry wants to know what they say. He wants to know what they say more than he’s ever wanted something in his life. It sounds like the earth itself is singing.\n“Welcome,” Toothsplitter says softly in English, “to the Realm of Song.” And then she repeats it in the goblin language, so Harry can learn that, too.\n\nMany-Pillared Halls of Stone\n\nHarry grows to maturity in the embrace of the Realm of Song.\nIt sprawls everywhere underground, breathing in the darkness, the deepness, the vents of warm air from the smithies and the lakes of silver and gold that surge back and forth in the deepest caverns. Harry hangs over the edge of red-glowing abysses and stares down, and goblins like Toothsplitter or Gravensword, her burly apprentice, teach him the names of all the stones and the exact shades of light that he can see.\nHe walks through shadows, and learns how to see in them better than in the daylight. In fact, when he comes up sometimes to walk through Diagon Alley in disguise, he has to hide his eyes from the sun. They see so much better in the darkness.\nHe learns how to wield a hammer, although Toothsplitter is an exacting master and keeps stopping him so that she can show him how to grip the shaft better, or aim it at a place in the metal that needs to be beaten smooth, or lecture him about how he can’t just get lost in the blows and all of the tools he makes will need a different strength. Then Harry goes back to using the hammer again, only for her to stop him a minute later and teach him something else.\nBut the day comes when Harry gets through sixty strokes uninterrupted, and Toothsplitter studies the blank of metal and proclaims that it will be a good sword.\nHarry is so happy that night that he nearly bangs his head on the low stone roof above his sleeping quarters, something he hasn’t done since his first night here.\nHe plays tag with the goblin children through the abandoned mines and quarries, always together. Although there are few dangers here coming from gas—which the goblins cleared out long ago—or from the darkness they can all see through, sometimes the mines plunge deep, and wake the Deep Ones.\nHarry learns all the warning signs from the goblin children: the way the earth shakes under your feet in jerks too sharp for it to be an earthquake, how the walls turn purple instead of black or grey, how a sweet smell like nightshade fills your nostrils. Then you run, and run, and never look behind you, until the things that sleep in the deep places of the world go back to that sleep.\nThere’s only one of the children eaten during the time that Harry grows up in the Realm of Song. But the screams of that one, the way that flesh sounds when it’s pulled apart, remain in Harry’s dreams forever.\nHe learns the names of jewels finished and rough, the veins of ore that run through all the tunnels of the joined world, and how to judge at a glance whether a tunnel is supported well enough to run through or not. He learns Gobbledegook, as he wished, and he learns Latin because Toothsplitter says that’s proper for a wizard to know, and he learns knife-fighting because he’s not going to be strong enough to lift a heavy goblin sword even if he’s taller than they are.\nHe learns laws and customs and proper behavior, and exactly how far he can go to break them before someone snarls at him. He wants to file his teeth to points like the bank guards do, but no one will let him. Harry tries to do it himself, but all he does is break a tooth and get a long glare from Blackeye, the chief goblin healer.\nNo one wants to anger Blackeye. Harry meekly submits to her healing and then tosses the file he tried to use back where he found it.\nHe learns maths by counting the coins that pour through his fingers when he and the goblin children sneak into unclaimed or abandoned vaults. He learns natural history with dragons and underground plants. He learns history from the legends of the Deep Ones and the goblins’ side of the wars—which are always started by something stupid the Ministry does because they don’t understand goblins. Harry has to shake his head when he hears the tale of how the Eighth One started. Imagine, not letting a goblin with an iron knot on his sword take the first seat at the table. Harry doesn’t understand how wizards can be so stupid.\nSometimes, he despairs that he was born human.\nOn the other hand, the goblins teach him magic, too, and Harry can learn both goblin and wizard magic. Goblin magic involves speaking to things. The first time he asks the fire in the forge to reach his desired temperature instead of building it up with a bellows, Harry laughs with exhilaration, and not just because his arms and shoulders are going to thank him for this later.\nHe spoke, and the fire listened! It’s wonderful.\nThere are always things that he can speak to, Harry finds. Swords listen when he asks them to sharpen themselves, and they might do it or they might not, but they hear him. The walls throb with the voices of metals and rock, the voices of the earth, older than anything else. The water sings to Harry as he walks through the darkest places, and once a river asks him to help turn its course, because it wants to run through a deeper bed and rejoin a current that it can hear on the other side of a wall. It takes Harry several days and wizard spells to blow up the wall and let the waters flow together, but he manages it.\nAnd the water sings its thanks, and Harry smiles at it.\nWizard magic is fun, too, juggling light and calling fire and opening locked doors and summoning objects, but when Harry asks what wizards talk to, Gorgeslitter shakes his head.\n“They talk to themselves,” he said. “And sometimes us and centaurs, or merfolk if they know Mermish. But even then, they don’t listen.”\nHarry stares at him, appalled. “But—they have to be able to hear.”\n“Hearing is different from listening.”\nHarry nods, chastened. He learned that as his very first lesson. “But really? They don’t even listen to us—I mean, you?”\n“They don’t know that we have anything valuable to say.”\n“I’m so glad Ripclaw found me.”\nThey’re in one of the offices at the bank, covered with a vulgar display of marble and gold to impress the wizards. In truth, Harry knows the marble would like to return to the quarry and the gold would like to be running free in one of the molten lakes. It’s a depressing place with all the yearning voices he can’t answer.\nGorgeslitter smiles at him. “So are we, young amaraczh.”\nIt’s the name they call him when they don’t use his wizard name, a combination word that means “human” and “speaker.” Harry beams. He knows they’ll never call any of the stubbornly deaf wizards that.\n\nThe Light of Sun and Star and Moon\n\nAs Harry grows older and towards the time that he’ll need to go to Hogwarts, the goblins start to insist that he spend more time outside the Realm of Song and walking the streets of Diagon Alley and other wizard enclaves that spread around the goblin banks. “You need to practice English,” Gorgeslitter tells him as he guides him around the wizarding section of Paris. He has an illusion on to look like a wizard so no one will rudely gape at him. “Your Gobbledegook is sounding more and more like your native language now.”\n“What’s wrong with that? And I can’t practice English here anyway.”\n“There are wizards here who speak English.”\nHarry sulks, but Gorgeslitter is firm, and Harry has learned that he won’t get away with anything when a goblin looks like that. Grudgingly, he spends more time speaking English, and he spends more time casting spells, and he learns to ignore the voices of wood and stone and water weeping when wizards won’t listen to them.\nBut he does nearly rebel on the day that Gorgeslitter takes him to Ollivander’s wand shop.\n“Do I really need a wand? I function fine without it,” he grumbles in Gobbledegook as Gorgeslitter guides him firmly into the shop.\n“Not fine in the way that other wizards will want to see,” Gorgeslitter answers.\nHarry nods glumly. He has learned that presenting a secretive front to wizards, conforming to what they expect to see, is important. The goblins could win a war with the wizards if they called upon all the resources of the Realm of Song, but no one wants to do that. Exposing those secrets? Having wizards know about the lakes of metal and the Deep Ones and the secrets of forging and crafting? It would be terrible.\nSo Harry puts his chin up and puts on what he thinks of as his “wizard smile,” one calculated to make everyone think that he’s nice and simple, and marches into Ollivander’s shop. Gorgeslitter stays outside. Harry wishes he could, too, that he had a goblin body as well as a goblin soul, but needs must.\nThe old man who comes out of the back of the shop to stare at him is at least interesting, with magic writhing around him and his head cocked as if he hears the wands speaking in their boxes. Harry bows his head a little and makes sure he’s speaking in English when he says, “Hello, sir. I’m Harry Potter. I’ve come for my wand?”\n“You are Harry Potter. But you haven’t come for your wand.”\nStartled, Harry lifts his head. “But I need it to be a wizard!”\n“You are here because the goblins made you come.”\nHarry narrows his eyes. His hand rests on the knife that Ripclaw gave him, although he hopes that it just looks like he’s resting his hand on his hip like a prissy little wizard. He whines, “But I need a wand! Even if the goblins made me come, why can’t you give me a wand?”\n“I only sell my wands to those they’re meant to bond with, Mr. Potter. After you spent so many years in the Realm of Song, there is nothing for you here.”\nHarry tilts his head to the side, ignoring the wizard for a moment, while his mind drifts among the boxes and listens to the voices of wood and hair and—many other things. Then he looks up and blinks. “You’re wrong, sir. There’s a wand here that wants to bond with me. Don’t you talk to them when they speak?”\nOllivander’s mouth falls open a little. Then he turns and gestures at the boxes. “Tell me which one it is, if you can hear them.”\n“Not just hear, listen,” Harry corrects him. He’s always liked that distinction. He makes his way along the shelves, listening harder when he hears the murmur ahead of him become sharper and more excited. Then he reaches out, and his fingers brush the edge of the right box. He laughs aloud as the box actually splits apart so the wand can leap into his hand.\nIt’s such a pretty wand! The holly wood gleams, and Harry can’t help but pet the side of it where he can see a slight knot in the wood. And the core is phoenix feather. It sings to him with an echo of the bird it comes from. Harry thinks it’s ghalimart, and he never uses that word for anything but some goblin magic.\nHe turns around to find Ollivander squinting at him. “Can it be?” he murmurs to himself. “Can you really be a goblin-trained wizard who has retained wizard magic?”\n“They always taught me wizard magic,” Harry corrects him. But he does it gently, because so many wizards don’t know a thing about goblins. It’s not their fault, the poor stupid things. “Here are the Galleons, sir.”\nOllivander takes the Galleons slowly, moving as if he wants to drop them. Harry can ignore the sad chirping voices of the coins well enough. They’re so changed from what they used to be that they don’t retain much more than a dream of living free in lakes.\n“I think you are going to change the wizarding world, Mr. Potter,” Ollivander says as Harry steps out the door.\nHarry throws a startled look over his shoulder, but shakes his head and keeps walking. He can’t change it by himself. That would require wizards to start listening to goblins and walls and floors and all the rest, and he doesn’t think they ever will.\n*\n“This is the train that you must depart on.”\nHarry sighs and stares at the train in front of him. It has too many voices in it for him to separate them: voices of iron and other metals and steam and wheels and coal and furniture. He turns to Toothsplitter, who stands lightly next to him and ignores the whispers and stares from other wizards. “What if I don’t like it and I want to come home?”\n“The Realm of Song will always be your home,” Toothsplitter replies in Gobbledegook, and reaches out to cup the sides of Harry’s face. “And I have a present that should make you feel better.”\n“Unless it’s you coming with me, then—”\nHarry gasps when he sees the belt buckle glinting in the middle of Toothsplitter’s palm, though. She’s right, it does cheer him up. He scoops it up and stares at it, aware that he’s licking his lips and looks greedy. He doesn’t care. The intricate pattern of gold and iron knots on the buckle can only mean one thing.\nHarry looks up. “You’re promoting me to journeyman because I’m leaving?”\n“Of course that is not the only reason. Did you think I would let you get away with shoddy work?”\nHarry grins, because he does know his teacher. No, Toothsplitter would never do a thing just for sentimental reasons. If she’s promoting him to journeyman smith, she really does think his work is that good. He leans closer and rests his forehead briefly on her arm, giving her the greeting an apprentice goblin uses to a master for the last time. “Good-bye. I don’t know what the wizarding world will be like, but I think they’re a little stupid.”\nToothsplitter laughs aloud and puts one hand on his shoulder. “Go in peace, little one. And astound them. That’s the way you are.”\nHarry waves at her and runs onto the train. He has a trunk with his clothes and his weapons and his wand and his school supplies. He doesn’t have much else. The knowledge he carries is in his head; Harry does read books, but most of the way goblins pass on knowledge is with song.\nHarry wonders if he’ll run into anyone else in the wizarding world who values such things. Probably not. But he might still have a good time here anyway if he can keep in mind that wizards just don’t listen the way he does.\n*\nPeople keep gawking at him. But when Harry says something in response to their demands to see his scar, or their gasps, or something else, they all flinch back from him. They seem to expect him to be human.\nOh, well. Harry did tell Toothsplitter that he already knew most wizards would be stupid. It’s only a little disappointing to be proven right.\nThey’re standing in the Great Hall right now, with clouds hovering overhead. Harry thinks that’s fascinating and hopes he gets the chance to talk to the ceiling. Sometimes it’s hard to do that because the walls or the floor think you’re addressing them instead, and the Great Hall is the highest place he’s ever been in.\nAnd the brightest. Harry’s eyes are watering behind his glasses. He hopes that most of the corridors are darker.\nSome of the schoolbooks he got did talk about the Houses, but Harry wasn’t sure which one he wanted to be in until he heard some of the other students talking on the train. Now he knows there’s only one choice.\n“Gryffindor!’ shouts the Hat for a few people, and “Hufflepuff!” for others. Harry waits. The line in front of him gets shorter and shorter, but some people already have their eyes fixed on him. They knew what he looks like because of pictures in the newspapers when he was young, the books told Harry.\nIt still makes Harry think they’re all slightly stupid. Why would you trust a photograph to tell you what someone is really like? Only their magic and their work can do that.\n“Potter, Harry!”\nHarry walks forwards and confidently reaches for the Hat when the older professor standing by the stool hands it to him. She’s staring at him. Harry smiles at her, but he’s embarrassed for her, too. By the time that you get to that age in goblin society, you’re respected and probably a master smith or healer or counter or some other important profession. You don’t go around gaping at people because you should be the kind of person they gape at instead.\nThe Hat settles over his eyes, and promptly says, “What a fascinating notion of the world you do have, to be sure.”\n“I’m glad you can talk back,” Harry tells it. “There are so many objects here that feel dim and dull, probably because no one ever pays attention to them.”\nThe Hat chuckles, making the older woman gasp. But its other words are mental, like Harry’s, and no one else can hear them. “They are dim and dull. But you have—well, an unusual mind. Where would you like to go, Harry Potter? There is only one House that would be absolutely unsuited for you, and that would be Hufflepuff.”\n“Because they’re all so loyal to many things instead of one?”\n“That would be part of it, yes.”\nHarry nods. “I’d like to go to Ravenclaw.”\n“Only because they have a half-goblin Head of House?”\n“Do you really think that most wizards are going to like or sympathize with me once they find out that I was raised by goblins? I want someone who will. And I like learning, too. Just because I don’t read books all the time doesn’t mean that I wouldn’t fit into Ravenclaw.”\nThe Hat chuckles again for him. “Indeed, and well-argued. That logical side will help you in your new House as well. Best of luck to you in RAVENCLAW!”\nHarry hands the Hat back to the older woman, who’s blinking, and then hops off the stool. As he heads towards the table decorated in bronze and blue, he catches the eye of the small professor and mouths, “Hello,” in Gobbledegook.\nThe professor’s mouth falls open, but he nods and mouths back, “Welcome, young speaker,” and then applauds harder than ever, and Harry’s heart sings.\n\nUnwearied Then\n\nIt actually turns out to be simpler living in the wizarding world than Harry ever thought.\nFor one thing, he just speaks the truth when people ask him about where he was, and he ignores the gasps and outrage. Some people think he shouldn’t have been raised by goblins. But then, some people think they have the right to steal possessions, and some people think wands don’t have voices, and some people think they should be allowed to kill others and get away with it outside a war or a formal dueling ring. That doesn’t make them right. Harry lives in reality. He ignores their opinions and guards his possessions and listens to his wand and is ready to defend people.\nHis Potions professor hates him. He keeps saying Harry should read the book. Harry chants the properties of aconite and bezoars the first day for him in class, but it just makes Snape turn incredibly purple.\nHarry reckons that’s partially because he couldn’t answer the question about the Draught of Living Death with goblin knowledge. Well, Harry does try to read the books more often, but they are boring. Things would be improved if wizarding society had bards you could pay to sing about potions.\nSome of the Ravenclaws think he’s mental for creating music for himself when he studies, but he hums it quietly and goes into the dungeon corridors that few people seem to use when he wants to sing aloud, so they mostly ignore it.\nHarry also finds plenty of friends in the castle when humans are avoiding him. There are mirrors that no one has ever asked to shine, blocks of stone in the walls that still remember their quarries, and staircases that always lead Harry in the right direction because he asks them nicely. The Great Hall’s ceiling is as fascinating to talk to as Harry thought it would be.\nProfessor Flitwick is pretty fascinating, too. He asks Harry lots of questions about the Realm of Song when Harry is serving the inevitable detentions Snape assigns him, and the detentions he gets from Professor McGonagall because he asks his wand to do things instead of using the proper incantations, and the detentions he gets from the Astronomy professor for not doing the homework (Harry just doesn’t think stars are interesting, because they’re too far away to talk to).\nProfessor Flitwick arranges for Harry to serve the detentions with him, and he does try to speak to Harry about doing his homework more. But he ends up laughing most of the time, so Harry knows Professor Flitwick isn’t annoyed.\n“You should do your Astronomy essays, however, Harry,” he tells him in Gobbledegook as Harry finishes up writing some lines in English about how he will not disobey the professors. “Poor Professor Sinistra.”\n“But how much am I going to use Astronomy? And my eyes can’t see some of the things she’s talking about, anyway.”\nProfessor Flitwick leans forwards and studies him seriously when he says that. “Are you saying that your eyes were damaged from living underground, Harry?”\n“They’re not damaged. But they’re not used to looking at stars. And how much do you use Astronomy in your life now, Professor Flitwick?”\nProfessor Flitwick says, “Harry, that is not the point. I want you to start doing your Astronomy homework.”\nBut he smiles when he says it, so Harry decides he’s won and that squinting a little harder to see the stars Professor Sinistra is talking about won’t be so bad.\n*\nProfessor Dumbledore comes ambling up the stairs to Ravenclaw Tower one day and wants to stop and talk to Harry. Harry tells him that he can but he’s very busy working on one of those missing Astronomy essays, so can it wait?\nProfessor Dumbledore looks at him for a very long time when he says that. Harry gets bored and goes back to writing his Astronomy essay. They’re sitting on the stairs outside Ravenclaw Tower. It’s one of the staircases that likes Harry, and Harry reaches out and absently pats one of the steps.\nIt seems the professor decides that means it’s good to talk now. “One of the things that I am concerned about, Mr. Potter, with you being goblin-raised, is that you don’t seem to have many friends at Hogwarts.”\nHarry blinks. “I’m not sure who told you that, sir. I have lots of friends. I can think of fifty or so off the top of my head.”\n“Is that so, Harry? Would you mind introducing me to them?”\n“Of course. The first one is the staircase you’re standing on. It’s grateful that people don’t spill butterbeer on it like they do with the floor in Gryffindor Tower, but it doesn’t like us carrying all those heavy books up it. The Sorting Hat is fascinating, too. Sorry that you found me in your office that time, but I just wanted to talk to it.”\nBeing in the Headmaster’s office is one of those things that everyone else treated with shock and horror. Even Professor Flitwick seemed upset with him. But Harry doesn’t understand. Finding hollow places in the stone is natural to him. And he doesn’t understand why they call them “secret passages,” either. Harry offered to tell the professors about them, so they wouldn’t be secret anymore. The only people who wanted to listen were those two red-haired Weasleys from Gryffindor, though.\n“I was asking about human friends, Harry.”\n“Oh, sorry, sir. You didn’t say. Well, there’s Fred and George Weasley from Gryffindor, and Professor Flitwick. I also think that it’s very easy to talk to Cedric Diggory. He wants to know a lot about how his broom sounds when he rides it. I was able to tell him some of the bristles were about to break off! He said thank you and that he would take better care of it.”\n“If you had grown up with your relatives, Harry, then you would have had a normal life when you came here.”\n“How does sleeping in a cupboard make me normal, sir?”\nProfessor Dumbledore stares at him. He doesn’t appear to know what to say.\n“They called me a freak and never told me about magic,” Harry tells Professor Dumbledore, shaking his head. He thinks poor Professor Dumbledore can’t be that smart, even though Fred and George’s brother Percy always says he’s a genius. Well, Percy also isn’t that smart. “My people always told me about magic and that I was human and had me practice English and wizard magic. That’s a lot better than my relatives.”\n“You—you are the Boy-Who-Lived, Harry.”\n“Yes, sir, I am. I lived a much better life in the Realm of Song than with my relatives.” It’s been a long time since Harry thought about the Dursleys. He pities them now. They’ll never hear a river speak or watch molten gold dance in front of them or argue with Toothsplitter about cases in Latin. It’s such a sad, limited life.\n“That means that you must face down Voldemort.”\n“Oh, him. He’s kind of a waste of space, isn’t he? Anyway, most of my people don’t think so. Blackeye thinks that it had something to do with my scar, but she healed the piece of soul in my scar, so it can’t have anything to do with that anymore.”\nProfessor Dumbledore sits down very hard on the steps.\n“Your—your scar is still visible,” he whispers when a few minutes have passed and Harry has written a few more lines on his Astronomy essay.\n“Yeah, Blackeye said it had been there too long to do much about in the end,” Harry says distractedly as he flips through the book to find the fact he needs. Honestly, he wishes books had voices of their own instead of the voices of the leather and sinew and paper they’re made from. It would make it easier to ask them where facts are hiding. “But she got rid of the piece of soul.” He looks up hopefully. “Sir, do you know why Jupiter’s rings are important?”\n“I think,” Professor Dumbledore says slowly, “that is a question you must answer for yourself.” He stands up even more slowly. Harry hopes that he hasn’t broken a hip or something. Toothsplitter is always unhappy with Gravensword when that happens to him. “Voldemort may still come after you, you know, Harry.”\n“I’ll cut his head off when he tries.”\nProfessor Dumbledore looks like he wants to sit down again. “What?”\nHarry draws the knife Ripclaw gave him. “I can cut through skin very fast,” he explains. “I can cut off his head.”\n“It’s—it’s not that simple, Harry.”\n“It can be,” Harry says, and puts the knife away. “If you just let it.”\n*\nThere are other conversations, and adventures. Harry makes friends with the sinks in the boys’ bathrooms, and they tell the others, so when a troll comes wandering into the school and into a girls’ bathroom, Harry just has to ask the sinks to turn on all at once. The water comes spraying out and the troll gets it in its eyes and lumbers off so the professors can take care of it.\nHarry finds study partners in his House who don’t mind that he constantly hums under his breath. Some of them even want to learn Gobbledegook and how to talk to objects. Harry happily shares some of the speaking with them that won’t betray secrets of the Realm of Song or crafting and forging, and smiles when he hears Terry Boot asking a shower to turn on and Michael Corner sulking because a stone was mean to him. (Harry did try to tell Michael: you never insult a stone’s flakes of mica. It’s just not done).\nA few Slytherins try to insult him, but they stop when the floors beneath their feet constantly buckle and their own books refuse to open.\nAll in all, Harry fits better into the wizarding world than he thought. But he’s still happy when the Christmas holiday comes and he can go back to London and through the front offices of Gringotts that are only for show and down into the darkness again.\nToothsplitter welcomes him with a challenge to prove that he hasn’t lost all his smithing skill, and Harry spends his first night hammering all the dents out of a breastplate that some idiot giant wore against a dragon.\nThen he sits on the shore of a dark river and exchanges tales of Hogwarts with Gorgeslitter and Ripclaw and Gravensword and his young goblin friends, and listens to the songs continually going on in the background.\nHe falls asleep in his small sleeping space that night, and goes running through tunnels the next morning. The stone chants underneath his feet, tales as old as the planet. Harry feels the weight of his wand in his pocket, its soft curiosity about the Realm of Song, and smiles.\nHe can have two worlds, and anyone who says that he can’t is lying. But the Realm of Song is always going to be home.\n\nThe End.\n"
}