{
    "id": "17099468",
    "url": "https://archiveofourown.org/works/17099468?view_full_work=true",
    "author": [
        "writeonclara"
    ],
    "title": "How to Woo the Winter Soldier",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Captain America (Movies)",
        "The Avengers (Marvel Movies)"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Steve Rogers"
    ],
    "characters": [
        "Steve Rogers",
        "James \"Bucky\" Barnes",
        "Natasha Romanov (Marvel)",
        "Clint Barton",
        "Sam Wilson (Marvel)",
        "Tony Stark",
        "Friday (Marvel)",
        "Peter Parker"
    ],
    "additional_tags": [
        "Courtship",
        "Identity Reveal",
        "Gift Giving",
        "Bad Ideas",
        "Romance",
        "Light Angst",
        "Identity Porn"
    ],
    "language": "English",
    "series": "",
    "published": "2018-12-22",
    "completed": "2019-02-16",
    "words": "21,570",
    "chapters": "6/6",
    "comments": "852",
    "kudos": "12,551",
    "bookmarks": "3,464",
    "hits": "108,367",
    "summary": "<p>“I think I’m ready to date again,” Steve said.</p>\n<p>“What,” Natasha said.</p>\n<p>“What?” Clint said, lowering his binoculars. He blinked at the dumbstruck look on the Captain’s face, then followed his gaze to where he was staring dopily at—at the Winter <i>fucking</i> Soldier.</p>\n<p>“Steve, no,” Clint groaned.</p>\n<p>Or: Steve courts the Winter Soldier.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "Dinner was a quiet affair. Conversation had temporarily sparked to life, before sputtering out again like a dying candle. The only sounds that came from their table were the high-pitched squeaks of cutlery against ceramic plates. Stephanie, one of the many friends Natasha had dredged up for Steve to date, sawed at her chicken with the intensity of a bone surgeon, eyebrows furrowed and lips knotted at the corners.\nSteve dropped his eyes to his own plate, resigned. Well, this was it. He was intimately familiar with that look. It was the look of someone who had signed up for Captain America and had gotten—Steve.\nAs if following a script, Stephanie puffed out a sigh and deliberately set her knife and fork down.\n“Chicken not good?” Steve asked, then winced slightly at himself. Steven Grant Rogers, stunning the ladies with his conversation skills since 1939.\nStephanie smiled at him, a tight thing that fizzled into a frown. “Listen, Steve—”\nAnd here we go. The ‘it’s not me, it’s definitely you,’ break up speech. At least he knew it wasn’t about his looks this time. No, now it was about his personality, which was—god, just so much worse.\n“You’re a nice enough guy. You’re just a little—um.” Stephanie faltered, scanning the room like it could provide her with the right adjective.\n“Boring,” Steve supplied.\n“Yes!” Stephanie grimaced a little. “Wait, no. I mean—I just thought you would be more—adventurous. And, I mean, you’re kind of, uh—have you ever heard of Eeyore?” \nSteve narrowed his eyes at her. Was she really comparing him to a depressed donkey? “Yes.”\n“Winnie the Pooh is that old, huh?” Stephanie muttered to herself. She smiled at him, brilliant white teeth against red lips. “Anyway—Stephanie and Steven? That’s a little too white picket fence, don’t you think?”\nNever again would Steve let Natasha set him up on a date. “Right.”\nStephanie unhooked her purse from the back of her chair and got to her feet. “I’ll just Venmo you for the meal, okay?”\nSteve had no idea what Venmo was, but he would give his left arm if it meant getting out of this horrible date any faster. He could take care of the stupid bill. “Right,” he said, again.\nFor a moment, Stephanie looked like she was going to kiss his forehead—and Steve would probably flip the table if she did—before she smiled in a woeful sort of way and strode out of the restaurant, leaving behind the shattered remains of Steve’s self-esteem and half of her chicken scarpariello.\nAnd that, as they said, was that. It wasn’t like this was the first time he’d been dumped for not being “Captain America” enough. The problem was, everyone looked at Captain America and expected—well, if Steve knew what they expected, he probably wouldn’t be so boring. Did they think he would, what, whisk them off in a quinjet for a romantic getaway to Wakanda? \nWhat was wrong with wanting to have a nice quiet dinner, and then maybe to go to the pictures after if time permitted? It had been good enough back in the 30s. Why did everyone want to wander or go on adventures?\nSteve sighed and moodily finished his ribeye and mashed potatoes. Then he dragged Stephanie’s plate across the table and ate her chicken, too.\nClint tossed a peanut in the air and caught it with a snap of his teeth, watching the house across the street through a pair of Stark-enhanced binoculars. As they had hoped, the tracksuited gang of unspecified Eurasian origin appeared to be meeting up for some home brew and delicious borscht. All they were missing, now, was the big boss.\n“Hey,” Natasha said from behind him.\n“Yo,” Clint said. He held out his bag of peanuts. “Peanut?”\n“I’ll take one.”\nClint lowered his binoculars. That—hadn’t been Natasha’s voice. Sure enough, it was Steve Rogers digging through his bag of peanuts like he was searching for the Cracker Jack prize. \n“Cap! Hey, hello. Hi there.”\nSteve lifted his eyebrows at Clint’s admittedly neurotic greeting, but was nice enough not to draw verbal attention to it. Instead, he took the binoculars and muscled Clint out of his spot, rude.\nBecause Clint was a good bro, he did not raise any protests about this addition of one woebegone Captain America to their stakeout. He did, however, lift an eyebrow at Natasha behind his back.\nI thought this was supposed to be reconnaissance, he signed at her. What’s with the red, white, and blue?\nLook at him, she signed back.\nClint looked at him. And, okay, the last time Clint had seen a mortal creature look that hang dog was after Clint had eaten the last slice of pizza in front of Lucky.\nWhat the hell happened? Clint signed. \nNatasha shrugged. He won’t say. Just showed up at my door looking like—that.\n“I know you guys are talking about me behind my back,” Steve said, not lowering his binoculars. “I can see your reflection.”\nClint always admired Natasha’s calm exterior. She barely even batted an eyelash at being caught out. He, on the other hand, jumped about three feet in the air and almost pitched off the side of the roof in his guilty surprise.\n“Sorry, Cap,” he said, sheepishly. “You just don’t come out for reconnaissance that often.”\n“What are we looking at?” Steve asked, ignoring Clint’s apology. The harsh slant of his shoulders told Clint enough, anyway. Something bad had happened to Captain Anachronism recently, but it was clearly personal and he just as clearly didn’t want to talk about it. \n“We,” Clint said, taking pity on the guy and running with his change of topic, “are monitoring a tracksuited gang of unspecified Eurasian origin.”\n“The Russian mafia,” Natasha said, blandly.\n“Unspecified Eurasian origin,” Clint insisted.\nSteve hummed. “Well, I see someone down there, but he’s definitely not wearing a tracksuit.”\n“Let me see that.” Natasha took the binoculars and peered into the next building. Then she burst into a colorful flurry of Russian.\n“Natasha, language,” Steve said, scandalized.\n“What did she say?” Clint demanded. That had to be one juicy speech for Steve’s face to look like that.\n“The pakhan isn’t here yet, you asshole!” Natasha shouted at the man, despite them being way too far away for him to hear. She clicked her tongue. “He’s going to ruin everything.”\n“Yes, but who is he?” \n“He’s freelance,” Natasha gritted out, the bottom of her face twisting into a scowl as she watched the machine of death and destruction carelessly obliterate months of hard work. “Not much is known about him, except that he’s been credited with over two dozen high profile kills over the span of fifty years—for the wrong team—before he went offline in the early 2000s. He only reappeared five years ago to lay waste to several active HYDRA bases, before he started taking contracts from anyone who paid high enough. Anyone.”\n“Give me those,” Clint said, taking the binoculars from Natasha.\nThere was a man running down the street with a—was that a machine gun? Clint zoomed in. The bottom half of his face was covered by a black mask—sort of like a muzzle, and Clint wondered if it was some sort of advanced filtration device. Long dark hair fell in a tangle to his shoulders—sloppy, anyone close enough could grab a handful and then where would he be? Clint kept warning Natasha that her pretty red hair would end in her decapitation one day, but did anyone ever listen to him? Nooo.\nAs if hearing his thoughts, the man stopped, turned, and looked directly up at Clint.\n“Woah.” Clint stumbled back a step, his heart pounding in his throat. There was no way the dude could see him, not from this distance, but Clint still felt like he’d just been stared down by Death himself. This must have been how Frodo felt when he made eye contact with an orc for the first time: like he was two seconds away from having his jugular ripped out. Hesitantly, he brought the binoculars back up to his eyes. “Who did you say he is?”\n“He,” Natasha said, icily, “is the Winter Soldier. I hope you weren’t attached to any of those men, since there won’t be much left of them after the Soldier is done.”\n“I think I’m ready to date again,” Steve said.\n“What,” Natasha said.\n“What?” Clint said, lowering his binoculars. He blinked at the dumbstruck look on the Captain’s face, then followed his gaze to where he was staring dopily at—at the Winter fucking Soldier.\n“Steve, no,” Clint groaned.\n“Whatever happened to Stephanie?” Natasha asked, a little desperately. “Stephanie was nice. You and Stephanie were good together.”\n“She dumped me,” Steve said easily, which, no, who dumped Captain America? “I was too boring for her.”\n“Boring?” Clint choked out.\n“Someone called you boring,” Natasha said, slowly, like she was trying to process. “So you want to—date the Winter Soldier?”\n“I know it sounds crazy, but.” He raked his fingers through his hair and sighed noisily and with his whole body. “Have you ever looked into someone’s eyes and just—knew?”\n“No,” Natasha said.\nSteve considered her, then cleared his throat and said, “Right, yeah.”\n“That saying usually applies to people who aren’t international assassins,” Natasha said, pointing at her chest, then giving him a thumbs down. “Which, as it turns out, also applies to the Winter Soldier.”\n“Hold on, hold on,” Clint said, flailing his arms a little. “Maybe my hearing aids are acting up but—but did you just say someone dumped you because you’re boring? You’re Captain America! You—ow, Natasha, wtf?”\n“First of all, never say ‘wtf’ in my presence ever again,” Natasha said, threateningly. “Second of all—”\n“I’m not Captain America,” Steve said, grabbing the binoculars from Clint so that he could hide his epically broody face.\nClint looked dubiously at Steve’s uniform, and Steve must have been watching him out of the corner of his eye, because he lowered the binoculars again and glared at Clint. “I’m not always Captain America. People find Steve Rogers boring.”\n“Aw, Cap, no,” Clint said, reflexively. He wasn’t so sure about this dual personality thing Steve had going on, but he supposed having to be Captain America all the time would be kind of exhausting. \n“You can do so much better,” Natasha insisted, trying to take the binoculars back from Steve. He didn’t budge. “Literally anyone. That nurse you used to live down the hall from. She’s cute, and I bet she wouldn’t say no if you asked her out on a date.” She made a frustrated noise when she failed to pry Steve’s fingers from the binoculars and dropped her hands back to her sides. “Steve, you have no idea what he’s done—or what he’s willing to do. Did you miss the part where I said he was on the wrong side? Because he was. For years.”\n“So were you,” Steve said, with the simple brutality of a wrecking ball. “So was I, for that matter. Sounds to me like he got himself out of it and is now trying to make amends for his past.”\nNatasha went mute with silent fury, which was never a good sign. Clint didn’t blame her. The Captain had a way of taking an incredibly complex situation and way oversimplifying it.\n“So—what, so you’re just down for anyone who likes to beat up Nazis?” Clint asked, voice going higher with panic, partially because Natasha was two seconds away from detonating and partially because Steve had lost his fucking mind. “Do you even like men or is it just a Nazi-punching thi—ow, Natasha. I don't have a problem with it, I'm just wondering if he's got a kink—ow!”\n“Nazi-punching is a major turn on,” Steve said, flatly.\nClint made a strangled sound as a part of his childhood died a sudden and violent death. \nNatasha folded her arms. “Fine. Whatever. Make terrible life choices. Don’t come crying to me when they come back to shoot you in the ass.”\nIn front of them, the house where the tracksuited gang of unspecified Eurasian origin had been enjoying their night of revelry abruptly went up in a huge and glorious fireball. Clint had to admit, murderous machine of destruction or no, the guy had style.\nSteve didn’t have that much experience in courtship, but he had plenty of experience in watching Bucky court women. Although they never had much money to spare, Bucky always managed to scrounge up enough change to treat his dates with small gifts: a dewy bottle of Pepsi, or a cheap bouquet of white daisies.\n(Sometimes, when Steve was feeling particularly self-loathing, he would remember the little gifts Bucky would get him: a peppermint from the corner store, new pencils, cough medicine, fresh bread.)\nThen again, he wasn’t entirely sure how applying Bucky’s methods of romance would work with an international assassin. He had a feeling that if he approached the Soldier with a bouquet of daisies, it would end up shoved somewhere painful and deeply unpleasant.\n“FRIDAY, what can you tell me about the current movements of Codename: Winter Soldier?” Steve asked from where he was sprawled out on his couch, hands tucked behind his head. He wondered what it was about him that kept falling for people who he had a snowball’s chance in hell with. First Bucky, then Peggy (although maybe under different circumstances he could have had a life with her, but, really, their relationship had been doomed from the start), and now the Winter Soldier.\n“The Winter Soldier placed the equivalent of a billboard advertising his rates in the dark web three and a half days ago,” FRIDAY said. “He participated in a brief bidding war, and then was hired by a gentleman named Mikhail Mikhailov, who has some issues with the Russian mafia.”\n“Can you give me his exact coordinates?”\n“As it turns out, I can,” FRIDAY said, pleased. “Black Widow had requested my assistance in monitoring the mafia several weeks ago. As long as he hasn’t damaged my bugs—ah, there he is.”\nSteve grinned at the ceiling. It had taken him awhile to get used to artificial intelligence—he’d always been adaptable, but living inside a semi-sentient being stretched even the modern definition of ‘normal’—but he liked FRIDAY. She reminded him of his ma—no nonsense, caustic, full of bull-headed determination. He even thought she had the capacity to be sweet, but this was likely reserved only for Pepper, and sometimes Tony.\n“What do you get an international assassin as a gift?” Steve asked.\n“Since I am an AI, I would get him nothing,” FRIDAY said, flatly.\n“If you could.”\n“I have no experience in gift giving and therefore cannot give adequate advice,” FRIDAY said. She always sounded so sarcastic. Steve was pretty sure this was by design. “Would you like me to Google it for you?” \n“I know how to Google,” Steve said, offended. “I just don’t think ‘what do you gift an international assassin’ would net me useful results.”\n“Well,” FRIDAY said, with the patience of a long suffering mother, “assassins like guns. Why don’t you get him a new gun?”\n“Hmmm.”\n“I’ve sent the Winter Soldier’s coordinates to your phone,” FRIDAY said. “I strongly suggest not going to them.”\n\nWidow: Whatever you’re thinking, stop\n\n\nWidow: I reiterate, stop\n\n\nWidow: The Winter Soldier does not want to be your boyfriend\n\n\nCap: That’s quitter talk\n\nNew York rush hour was a heaving mass of pedestrians versus vehicle traffic. One thing that still threw Steve for a lurch was how many more people there were on the planet. New York had already been overcrowded when he was a kid, its population increasing daily with immigrants and country-folk hopeful for work, but this shiny new century was mind boggling. Sometimes, the sidewalks were so packed that it took Steve an extra ten minutes just to get back from the coffee shop. \nAt this hour, it was late enough that the morning traffic had died down, but early enough that the lunch rush had not yet started. Hands in his pockets, he strolled toward the coordinates FRIDAY had sent him. He wasn’t in any hurry, since he still had no idea what to get the Soldier. He couldn’t quite convince himself that ‘a new gun’ was an appropriate gift, on topic though it was. Maybe—a jacket? A new bulletproof vest?\n“Captain Rogers!” Murad called from his food cart, grinning so broadly that Steve could see his back molars. During the attack on New York, Steve had saved the older man from getting crushed by an alien whale. As thanks, Murad supplied him with a lifetime of free falafels. \n“Hey, Murad.”\n“The usual?” Murad asked, already dumping a huge mound of rice in a styrofoam to go container. \n“Murad, what do you get an international assassin as a gift?” Steve asked. He was beginning to feel like one of those kid’s books, where the cartoon bear went around the jungle, asking everyone if they’d seen his hat.\nTo his credit, Murad didn’t even blink. “A number one with a side of fries,” he said.\nSteve smirked, although—that actually wasn’t a bad idea. What was that old saying? ‘The way to a man’s heart was through his stomach.’ It was true enough for him—maybe he could apply the same logic to the Winter Soldier. Unless the man was a robot like Vision (actually, Natasha had said something about him being alive for over fifty years, so the idea had merit), there was nothing like the gift of New York street food.\n“Then I’ll take a number one with fries,” Steve said.\n“Excellent choice.” Murad expertly flipped open another container. “Finally putting the moves on the Black Widow, eh? Good for you. Personally, she scares the hell out of me, but good for you.”\nSteve didn’t bother to correct him. He was pretty certain that if he told Murad who he was actually interested in, he would join Natasha and Clint’s campaign to ‘get Steve to see reason.’ Which just wasn’t going to happen. Not even Bucky could get him to see reason.\n“Thanks, Murad,” Steve said, taking the two paper bags.\nMurad saluted him cheerfully. “Let me know how it goes, boss!”\nEven with the coordinates, it was tricky to find the Winter Soldier. He, unfortunately, was not just standing in the middle of the street, waiting for Steve with open arms. Nor was he inside the house the coordinates had indicated. He was, somewhat unsurprisingly, on the roof. As silently as he could with two bags of falafels clenched between his teeth, Steve climbed the tree next to the house. He got his feet under him, then leapt onto the roof, just behind the Winter Soldier.\nThe Soldier whirled around. A cold, hard weight pressed heavy into Steve’s sternum. Steve lifted both his hands. He was familiar enough with that sensation to know that the Soldier had a gun pressed to his chest.\nFor the second time, Steve saw the Soldier’s eyes. Up close, they were roughly fifty times more devastating. The Soldier’s eyes were a shade of gray that made tears well up in Steve’s throat. They weren’t quite right—too pale, with too many lines etched in the corners, and far too devoid of life and laughter, but they were achingly, shatteringly familiar.\nHe wondered if it were possible to fall in love with a pair of eyes.\n“Sorry, sorry. I didn’t mean to startle you,” Steve said, scrunching his eyebrows and grinning sheepishly. He shook the greasy bag in his left hand slightly. The Soldier’s eyes darted toward it, just for a second. “I come bearing falafels.”\nAlthough the Soldier didn’t so much as twitch a muscle, something about his entire posture demanded to know if Steve was out of his fucking mind. He—probably was, if he were being honest with himself.\n“I mean,” Steve babbled. “You must be hungry, right? I can’t imagine being out here for hours without taking a break to eat. Then again, I need to fuel up often and with great excess. Metabolism like a cheetah, so I’m told. I used to not require as much food, but”—the Soldier’s eyes narrowed fractionally—“Right, yeah, you really don’t need to know my life entire life story, sorry.”\nProbably deciding that Steve was too stupid to be a threat (which, again: accurate), the Soldier holstered his pistol, quick as a flash, and then snatched both of the bags out of Steve’s hand.\n“It’s not poisoned,” Steve said, then mentally kicked himself when the Soldier’s glare went from suspicious to apocalyptic. “No, seriously! I wouldn’t do something like that. Do—uh, do you want me to try some, to prove it to you? Only, if you’re going to chuck it because of my big stupid mouth, please don’t—that would be wasteful.”\nSteve closed his big stupid mouth with a click of teeth, then tipped his head back and stared up at the sky. Maybe he should call Thor and have him hit him with a bolt of lightning. Maybe that would get him to shut his fucking mouth.\nThere was a crinkle of paper. The Soldier had opened the bag and was peering inside it.\n“It’s delicious,” Steve said, encouragingly.\nThe Soldier stared at him.\nSteve beamed.\nWho knows how long they would have stood there, with the Soldier working through different ways to murder Steve while Steve smiled sunnily at him, if Steve had not suddenly realized just why the Soldier was staring at him.\n“Oh! Oh, of course. You’re not going to take your mask off in front of me to eat.” Steve coughed into his fist, heat prickling up the back of his neck. God, he hadn’t blushed since he was thirteen. Somewhere in the afterlife, Bucky was cringing with despair and second-hand embarrassment. “Right. Well, I hope you enjoy!” Then, with a dorky little wave, Steve turned on his heel and beat a strategic retreat off the edge of the roof.\nPaper crumpled beneath metal fingers. From the bag: onions, garlic, grease, salt. The Winter Soldier watched the blond man walk away.\nBroad shoulders. Broad smile. Hands that were too large for his body—no. That was incorrect. Eyes that were a sweet blue. Eyes that hadn’t changed when—\nThe Soldier turned back to his lookout spot. It had been compromised. Instead of doing the smart thing, such as finding a new lookout, he lowered his mask. Took a falafel between metal fingers and popped the whole thing in his mouth. Weird kid, but he was right: the food was fucking delicious.\nThank god Dr. Doom attacked on Friday, keeping Captain America busy for the next several days. That’s what the big guy needed—some new baddie to distract him from his little crush on the Winter Soldier.\n“He’s probably forgot all about him,” Clint said, optimistically. He rubbed the side of his nose. It had been broken again when a group of thugs from the tracksuited gang of unspecified Eurasian origin had jumped him in an alley.\nNatasha shifted the greasy bag of Chinese food into her other hand, fishing her phone from her back pocket. She held it up to the number pad next to Steve’s door. “You clearly don’t know Steve like I do.”\n“Are you breaking into Steve’s floor?” Clint asked, scandalized.\n“Yes,” she said. The door swished open.\n“Okay,” Clint said, as he followed her into Steve’s rooms. “I’m just saying, he’s only seen the guy twice, for like, two minutes. I wouldn’t be surprised if he—” He froze, words fizzling out in his throat.\nSteve was seated at his kitchen table, loose sheaves of printed out blog posts spread out in front of him, a laptop open to his left. There were several books garishly covered with half naked men and buxom women stacked in two small piles on the table. On the right, the books were painstakingly indexed with colorful tabs. On the left, the books were unmarked. Steve held one book flat open in front of him, drawing a line across the page with a bright pink highlighter. \n“Oh my god,” Clint said. “What are you doing?”\nJumping in surprise, Steve quickly snapped the book shut, hiding the cover with his hand. As if there weren’t piles of incriminating evidence stacked around him.\n“Clint,” he said, eyes round in embarrassed surprise. “Natasha. This isn’t what it looks like.”\n“It looks like you cleared out the entire romance section of The Strand,” said Natasha, setting the bag of Chinese food on Steve’s kitchen counter.\n“Not the entire section,\" Steve protested.\nClint lowered himself into the chair across from him, grabbing a book from the stack Steve hadn’t gone through yet. He lifted his eyebrows. “Faking It?” \nSteve flipped open the book he’d been working on, pressing a tab onto the page next to the passage he had highlighted. “I think that one is about a fake relationship,” he said. “It seems to be a theme in a lot of these books.”\nClint smirked. He highly doubted this one was about a fake relationship. Really, how Steve managed to get through these stacks of books without rupturing something from blushing—\n“Either that, or it’s about faking orgasms,” Steve continued, plowing through Clint’s smug amusement like Hulk smashing through a wall. He didn’t even look up, although Clint was certain he was fully aware that he had just scored a point off him. “It’s a trope.” He waved a hand at a spiral notebook, where he was, apparently, taking notes on romance novel tropes.\nWhile Clint was busy picking up the shattered bits of his sanity, Natasha dropped into the chair beside him. She handed him a carton of lo mein and a pair of chopsticks. “Are you also taking notes on how many times the words ‘moist’ and ‘shaft’ have been used?” she asked, digging out a potsticker from another carton before handing it to Steve.\n“And ‘velvet’,’ said Steve, refusing to blush, although Clint physically recoiled at the word ‘moist.’ “‘Throbbing manhood’ is a personal favorite.”\n“Steve, what are you doing,” Natasha asked, long suffering.\n“Studying.”\nNatasha lifted a skeptical eyebrow at him.\n“I’m a tactical genius,” Steve said, primly. “I like to plan.”\n“This is planning?” Clint demanded, a little hysterically. \n“It’s research,” Steve insisted. “There’s a lot of modern literature around courtship. It’s been very helpful.” His eyebrows crinkled together slightly. “I’m not sure I can accomplish the degree of sass these characters pull off, though.”\n“Oh I’m sure you’ll manage,” said Natasha, who’d had plenty of time to get to know the true Steve Rogers. “You might get stabbed for it, but you’ll manage.”\nSteve flashed a toothy grin at her, then stole her carton of fried rice. Which would have been a declaration of war if Clint had pulled the same move, but Natasha just stole the greasy carton of lo mein from Clint in response. Clint stared despondently at his empty hands until Natasha took pity on him and handed him the soup dumplings.\n“So, with all your ‘research’,” Clint said, making air quotes with his chopsticks, “what’s your brilliant plan?”\nSteve scanned the table with a mildly despairing look before his eyes landed back on Clint. “I was thinking about getting him a gun.”\nNatasha scoffed. “What, because he doesn’t have enough ways to violently murder you? What kind of books are these, anyway? I refuse to believe you got this brilliant idea from Faking It.”\n“FRIDAY suggested it.”\n“It makes the most logical sense,” FRIDAY chimed in, sounding both prim and put upon.\nClint rubbed his nose, then stopped because, ow. “Listen,” he said, “As the only one in the room with actual romantic experience—”\n“You’re divorced,” Natasha said. \nWhen Clint glared at her, she just stared back flatly. He prudently decided to ignore her interruption and continued with, “—take my advice and get him something he can’t kill you with, like chocolates.”\nNatasha looked shifty. Actually, Natasha’s expression hadn’t changed at all, but Clint was extremely familiar with that particular brand of quiet disdain.\n“Oooor,” he said, squinting at her. “He can actually kill you with chocolate. What can’t he kill you with?” Natasha shrugged, which was—wow. “Are you sure you want to date this guy, Cap?”\n“Yep,” said Steve, pouring the rest of the fried rice directly into his mouth. \nNatasha leaned forward, resting one arm on the table. “What are you going to do if he agrees to a date? You can’t exactly take him to the movies,” she said, and Clint was immediately bombarded with the image of Captain America sitting next to the Winter Soldier in a movie theater, both in full combat gear, the Captain offering the Soldier some popcorn, “or to dinner.” And Clint’s mental image shifted to the two of them sitting across from each other in a fancy restaurant, the Soldier staring stoically down at his steak and potatoes, like he could will his food directly into his stomach.\nIt was too much for him. He laughed.\nSteve didn’t even look up from the carton of dumplings he was rapidly demolishing when he threw Faking It at Clint’s chest.\n“I’ll figure it out,” Steve said, with the stubborn conviction of a man who had no idea what he was getting himself into. “For now, I just need to figure out how to get him to actually agree to go on a date with me.”\n“Offer him your throbbing manhood,” Clint muttered, then yelped when Steve kicked him on the shin.\nThe Soldier adjusted his rifle. He zoomed in on the blond man gently terrorizing a convenience store clerk.\nKazimierz Kazimierczak. Alias Kazi. Alias Clown. Runs around with his face painted white and a tear painted under one eye. A trigger man hired by the Russian mafia to clear out the apartments in Bed Stuy. Responsible for eighteen deaths, including Mikhailov’s wife and young daughter.\nHYDRA.\nThe Soldier exhaled a long breath. Depressed his finger on the trigger.\nA hand fell heavy on the Soldier’s shoulder. \n“Well well well, if it isn’t my old friend the Winter Soldier. What are we doing out here, eh?”\nThe Soldier looked down at the hand. It was encased in a metal exoskeleton, humming with power. Strong. Held the Soldier’s arm firmly in place.\nThe Soldier wrenched back. Metal ground against metal. He pivoted around and ripped out the pistol from his thigh holster, all in one fluid movement.\nCrossbones grinned at him. He wasn’t wearing his mask. The smile creased and pocked the ruin of his cheek.\nThe Soldier examined the side of Crossbones’ face. \n“Ouch,” he said.\nThe scar tissue on Crossbones’ face tightened into a sneer. He reached out one power-fist and grabbed the front of the Soldier’s shirt. “You did this to me,” he snarled.\nHe had. He had dropped a building on Crossbones’ head. He would drop two more buildings on Crossbones’ head without a second thought.\nHe was just about to unload his gun into the unscarred side of Crossbones’ face when something exploded against the back of Crossbones’ head, startling him enough to release the Soldier’s shirt. Quick as a viper, the Soldier wrapped his left hand around Crossbones’ neck and pressed his gun against his temple.\nThe Soldier glanced down to see what had hit Crossbones. Little creamy brown squares were scattered around their feet. The Soldier nudged one with his toe.\nIt was chocolate.\n“Are you okay?” the blond man with the falafels asked, jogging up to the Soldier.\nCrossbones gurgled. Without taking his eyes off the newcomer, the Soldier applied slightly more pressure to Crossbones’ neck. A warning.\nThere were several ways he could terminate both Crossbones and the man, if the man attempted to rescue Crossbones. But the blond just watched him with a carefully neutral expression, no judgement in his kind blue eyes. “He’s HYDRA, right?” \nThe Soldier’s hand spasmed. Crossbones tried to suck in a wheezing breath. The Soldier ground the muzzle of his gun harder into Crossbones’ temple, but he did not squeeze the trigger.\n“If you want,” the blond said, calmly, “I know some people. I can guarantee that he’ll never see the light of day again.” He shrugged one shoulder. “It’s up to you.”\nThe Soldier stared into the side of Crossbones’ face. Crossbones scowled back out of the corner of his eye, hateful. It would be simple to end things now, a clean shot to the temple, or between the eyes. A permanent solution. The Soldier glanced at the blond man, but there was nothing to guide him in those blue eyes.\nUnclenching his fingers, the Soldier released Crossbones. He landed hard, gasping, and rolled over onto his back, but before he could get to his feet again, the blond put a foot on his face. “I wouldn’t do that if I were you,” the blond said, pleasantly.\nThe Soldier sank back on his heels, silently observing the interaction. Crossbones had immediately stilled under the blond man’s foot, not even attempting to fight. There was more to the blond man than the Soldier had first surmised. A threat? But then, why the falafels?\n“Sorry about the chocolate,” the blond said, frowning with mild disappointment. He perked up suddenly. “But—here.”\nSeemingly out of nowhere, he whipped out something small and rectangular. The Soldier instinctively jerked up his gun. \nThe man’s expression fell slightly. “It’s, uh, it’s chocolate. I wanted to see what all the fuss was about—I mean, here.” He held out the bar of chocolate to him, rubbing the back of his neck like it was the 30s again and this mook had disappointed yet another date the Soldier had gone to the trouble to set him up with—\nThe Soldier stumbled back, eyes widening. Then he snatched the bar of chocolate out of the blond’s hand, turned on his heel, and sprinted away.\nThe Soldier sat on his apartment’s fire escape, cross-legged, in a pair of old sweats and a T-shirt, hair swept back in a low tail. With his metal hand, he tore the bar of chocolate in half, not even bothering to peel off the paper. He broke off a small square and popped it in his mouth, then closed his eyes, letting the milky-sweet chocolate melt on his tongue for a second. Then he bit into it. It crunched with toffee.\nMy favorite, he thought, and then deliberately did not think again.\nHe stared into the street below, eyes unfocused. Soon, the daily chatter of the city died down as people made their way indoors. Warm yellow lights flickered on in nearby windows. Occasionally, a figure moved within his sight line, an easy target.\nThe Soldier got to his feet. He required more intel.\nNatasha would rather die than admit it out loud, but the Winter Soldier scared the fuck out of her. Before, when he was the asset, he was a mindless, ruthless killing machine that stopped at nothing to get his job done, that was a ‘that’ instead of a ‘who.’\nThen he had gotten out, and the ruin he had left in his wake—it stayed with a person. And while he seemed less inclined to shoot through her to get to his target these days, he still had that fixed look more suited for a reptile on the hunt than a functional human being.\nSo when he showed up at her window, unannounced, in the middle of the night, she did what any sane person would do: she shot him.\nQuicker than her eye could follow, he lifted his left arm, and the bullets rang harmlessly off metal, pinging away in every direction. Since being killed by the Winter Soldier was marginally less likely than accidentally being killed by a ricocheting bullet, Natasha set her gun down on her duvet. The Winter Soldier set his own gun down on the window sill. She hadn’t even realized he had it pointed at her, Jesus. \n“Are you here for information about Ivan Banionis?” Natasha asked, settling her hands on her lap and not bothering to get out of bed. \nThe Winter Soldier stared at her, dead-eyed.\n“No? So it’s a courtesy call, then.”\nThe Soldier tilted his head, just a fraction. For a long moment, Natasha watched him watching her. The room was so quiet that she could hear the hum of her refrigerator on the other side of her wall. She wondered if he ever had a thought go through that head of his, or if he was like she had been—all automatic movement, like a murderous robot. \nThe problem with being reintroduced into society was that Natasha wasn’t sure she could out-wait the Soldier anymore. Ten years ago, definitely. Possibly even five years ago. This was one of the down sides of being civilized. “Well?” she asked.\n“Why does your big blond friend keep feeding me,” the Soldier asked, flatly.\nThe corner of Natasha’s mouth tipped up into a smile. With his mask and dead eyes, it was impossible to tell by his expression how he felt, but Natasha could detect a hint of irritation in his voice. “If you want him to stop, just say the word, and you’ll never see him again.”\nThe Soldier considered her. There was no visible change to his expression. Then he said, “I would just like to understand.”\nYou and me both, buddy, Natasha thought. Out loud, she said, “You’ll have to ask him, then.”\nAh, there it was. The insides of the Soldier’s eyebrows had furrowed slightly in confusion. Natasha’s grin widened into something sharper. “Soldier.”\nHis eyes fixed on hers.\n“If you hurt him, I will salt the earth with your ashes.”\nThe Soldier didn’t blink. Then he said, “You should look into Kazimierz Kazimierczak.” He turned around, one hand braced on the window. Then he looked over his shoulder and added, “Ashes are an effective fertilizer,” and disappeared back out the window.\n“Not human ashes!” Natasha shouted after him, then sighed and flopped back onto her bed before her neighbors complained about her. Again.\nFor a long moment, she stared blankly up at her ceiling. Jesus Christ. Had she really just given the shovel talk to the Winter Soldier?\n\nWidow: Your boyfriend visited me last night\n\n\nWidow: I shot him, but he’s okay\n\nSteve frowned down at his phone, not stopping to type out his response. Around his feet, wind swirled up litter into a small cyclone before dancing away again. \n\nCap: Stop shooting him\n\n\nWidow: Only if he stops breaking into my apartment\n\n\nCap: Why did he break into your apartment?\n\nWhen she didn’t respond right away, Steve called her, but of course she didn’t pick up. With a sigh, he locked his phone and dropped it back into his pocket. Likely the Soldier had gone to Natasha to gather more intel. He hoped she only said good things about him. \nOn mornings like this, brisk and with a chilly wind, Bucky used to bundle them both up and and drag Steve all around the city. He had liked the way the girls looked in their long coats and fur stoles, and how their skirts swirled around their calves. Steve had liked the way the crisp air made Bucky’s cheeks pink up and how his eyes glowed with happiness.\nTwo women hurried past Steve now, but they were dressed in huge puffy jackets, with thick beanies pulled low over their ears and scarves wound around the lower halves of their faces, and were hunched up against the wind.\nWell. Maybe it was colder than he realized. Sometimes, it was hard to tell with this big body of his. His temperature just auto-regulated these days. \nWashington Square Park was quiet for a Saturday; even the man who normally played piano near the Arch had apparently decided to stay indoors today. Steve slid his hands into his pockets, contemplating his next steps. The Soldier had accepted Steve’s gifts, but Steve wasn’t entirely sure he understood the context of the gifts. He needed to—\nSomething slammed violently into his back, hard enough to send him sprawling onto the pavement. He landed on his shoulder, and was just about to shove himself back to his feet when the Winter Soldier strode up to him. Steve froze. This gave the Soldier enough time to step up onto his back.\n“Oof,” Steve said.\n“I seem to have acquired a superhero stalker,” the Winter Soldier said, standing on top of Steve like he was a throw rug.\nIt was the first time Steve heard the Winter Soldier speak. His voice was quiet and raspy, and hummed into Steve’s bones like an electric current. He didn’t even try to throw the Soldier off his back, even though this was incredibly embarrassing. It would be just his luck if Tony had a camera pointed at him right now.\n“I’m not stalking you,” Steve told the pavement. He tried not to think of what was on this ground. The serum should take care of any communicable diseases. Probably. \n“The falafel,” the Winter Soldier said, and Steve could picture him ticking off his fingers. “Saving me from Crossbones, which I didn’t need by the way. The chocolate. If you’re not stalking me, what are you doing.”\nNow Steve was glad his face was pressed against the revolting pavement. His cheeks burned. “Uh,” he said.\nThe Winter Soldier bounced on his heels, which was surprisingly painful, since the Soldier was surprisingly heavy. “Well?”\n“I was kind of—trying to maybe court you?” Steve said, voice ticking up into a question.\nThe Winter Soldier went very still. “What.”\n“I mean, I don’t know what people call it these days. Woo you? Date you?”\n“You don’t know nothing about me, sweetheart.”\nSteve wasn’t sure if it was because his ear was currently being ground against the pavement, but he thought he could hear a hint of Brooklyn in the Soldier’s voice. He shivered slightly. It had nothing to do with the cold.\n“Isn’t that why you go on dates? To get to know the other person?”\nThere was a pregnant silence.\nThe weight slowly vanished from his back. Steve flipped over and kicked back up to his feet, but by the time he was vertical again, the Soldier was long gone.\nSteve tapped his pencil against his lips, staring down at his list.\n\nHow to Woo the Winter Soldier\n\n\nStep 1: Get him a gift\n\n\nStep 2: Help when he’s in need\n\n\nStep 3: ???\n\nSteve needed help.\nIt used to be that Bucky would give him heaps of unwanted advice, usually something like, you just gotta have confidence! Ladies love a guy who knows what he’s doing. Fat lotta good that did him. Steve had no idea what he was doing in the 1930s—he was pretty much an incompetent potato in the modern era.\nSteve thought about how Bucky used to sidle up to women on the street, cool as anything, cigarette tucked between his fingers and knock-your-socks-off smile at the ready. The girls would dip their eyelashes and blush prettily, and always, always smile back.\nHe tried to imagine the Winter Soldier blushing prettily and averting his eyes, and snorted.\nHe added a subtitle: What Would Bucky Do?\nThen he erased the question marks and added:\n\nStep 3: Flirt\n\n“I need help flirting,” Steve said, into his phone.\n“Oh, oh, hit him with this line: girl, did you fall out of a tree? Because you look like a finecone,” said Clint. “You know, like pinecone? And coz, you know, he likes to creep around in trees.”\nSteve hung up on him.\n“I need help flirting,” Steve said, into his phone.\n“No,” FRIDAY said.\n“I need help flirting,” Steve said, into his phone.\n“If you call me at one a.m. with your self-inflicted drama again I will kill you,” Natasha said, and hung up on him.\nSam reached out one hand from under his comforter to snatch his cellphone from his nightstand. Then he chucked it at the wall and rolled over. Whoever was calling him at one in the fucking morning could try again at a more appropriate hour.\nHe squeezed his eyes shut for another five seconds, then exhaled an explosive breath and flopped onto his back, hands smacking onto his comforter.\n“The world better be fucking ending,” he muttered, swinging his legs off the side of his bed, bare feet slapping against cold wood floor. He grabbed his phone from where it had landed by his bedroom door and glared down at the screen.\n\n1 missed call\n\n\n3 text messages\n\nSam sighed. Great. The world probably was ending. Again. Why did it always happen on his day off, huh? All he asked for was one day where he could just bum around on his couch and not fight robot nazis.\nHe opened the text messages.\n\nHawkeye: tell him that finecone is a perfect pick up line\n\n\nBlack Widow: he’s your problem now\n\n\nCap: how to flirt\n\n“Lord preserve me,” Sam muttered. He shot back a text to Steve telling him to tucking google it, then he dropped his phone back to the floor and crawled back into his bed.\nSteve Googled it.\n\nHow to Flirt: A Guide\n\n1. Smile a lot and maintain eye contact. \n“You are not allowed to tell anyone you caught me doing that,” Steve said, into his phone.\n“I wouldn’t tell anyone I caught you practicing pick up lines in your bathroom mirror,” FRIDAY said, offended. “I would show them the video I recorded.”\n“Tony programmed way too much of his personality into you,” Steve muttered. He wondered what it said about his life that arguing with an AI wasn’t even weird to him anymore. “Where did you say he was last spotted?”\n“The Winter Soldier was last seen leaving Russ &amp; Daughters.”\nSteve stopped on the corner of Houston and Orchard, a rock in the middle of the stream of pedestrians. He got some dirty looks, a couple of wide eyed stares, and one person took a picture of him. Ignoring everyone, he scanned the street for familiar gray eyes and shaggy brown hair.\nNothing.\n“You’re sure he’s here?” Steve asked.\n“No, I’m not sure. I just had real-time footage of the Winter Soldier leaving the cafe transmitted to me from an ARGUS satellite. I suppose it is possible that the military-grade tech was mistaken, however.”\n“Did Tony program you to be this sarcastic or did you evolve?”\nFRIDAY didn’t answer, which honestly could mean either way. \nA blue Volkswagen bug nearly as old as Steve rumbled by, emitting a thick cloud of black smoke. Steve wrinkled his nose and glared after it, wondering how it managed to pass its smog check, and then the Winter Soldier was just—there. Standing across the street, a plastic bag dangling off the crook of his elbow, his normal mask replaced by a black scarf wrapped around the bottom half of his face. Seeing him like this, dressed casually in a black coat with a faux fur trimmed hood and pants tucked into his unlaced boots, with his hair pulled away from his face in a low bun at the base of his neck, made Steve’s heart give a funny little twitch.\nBe cool, Steve told himself. One of the things the article stressed was not to appear overeager. \n“Hey!” Steve shouted, waving both his hands at the Soldier.\nThe Soldier closed his eyes, pained, as Steve jogged across the street, dodging incoming vehicles like a pro. Channeling 1930s Bucky after a couple of drinks and in his finest form, Steve swaggered up to the Soldier’s side. Walking like this felt unnatural, and probably looked ridiculous, but the Soldier didn’t punch him in the face or run away. Steve counted it as a win.\n“Hey.” Steve slid his hands into his pockets, angling his body toward the Soldier in a way that he hoped said ‘open’ and ‘inviting’ and not ‘easy target.’ He put on his most charming smile, fixing his gaze on the Soldier’s heartbreaking gray eyes.\nThe Soldier immediately shifted back, brow darkening dangerously. “What are you doing.” His voice was slightly muffled by the thick scarf, which took away some of the threat.\n“Being seductive,” said Steve, earnestly. After a beat of the Soldier gaping at him, he added, hopefully, “Is it working?”\nThe Soldier let out a strangled sound—almost a laugh. His eyes widened slightly at this involuntary reaction.\n“No,” he said, after a moment. “I am not seduced.”\nSteve rolled his lips together, but didn’t drop his gaze. The article on flirting Steve had studied clearly said looking deeply into someone’s eyes was considered romantic. \nUnfortunately, the article did not account for how an international mercenary with a dark past might react to direct eye contact. The Soldier put up with Steve staring dopily at him for about five seconds before he crouched down and swept his legs out from under him in a clean, single-leg sweep.\nSteve lay flat on his back, arms sprawled out at his sides. Beyond the looming skyscrapers, the sky was thick with gray storm clouds. He could only hope that the rain would wash away all his bad decisions. \nThe Soldier’s face appeared in his sight line.\n“I was looking deeply into your eyes,” Steve explained, tilting his head slightly to stare deeply and non-threateningly at the Soldier’s left cheek. “I wasn’t trying to challenge you.”\nThe Soldier snorted, clearly unimpressed. He turned away, then paused. “Next time,” he said, over his shoulder, “stick with falafels.” And then he was gone.\nSteve rolled his head back toward the sky, watching the clouds tumble rapidly overhead, and grinned.\n \n\n2. Touch him casually.\n\n“Hey, Murad.”\nMurad jumped slightly, dropping his phone. He performed a complicated dance to keep it from smashing to the sidewalk, then held it up triumphantly when he managed to catch it, displaying a giant GAME OVER on his screen.\n“Oh, I was about to beat my high score,” said Murad, mournfully.\n“Sorry about that.” Steve smiled at him, handing over a steaming to-go cup of coffee from a nearby bodega. The street was nearly dead, everyone hiding from the cold indoors. Murad was barely recognizable under a thick layer of scarves, jackets, and beanies, but he’d had yet to abandon his cart. Steve had to admire his tenacity.\n“Captain Rogers! You’re too kind.” Murad fumbled his phone back into his pocket, clumsy due to a thick pair of snow gloves, and flipped open a styrofoam container. “Nice to see another face out here—although what are you wearing?” he demanded, his eyebrows disappeared under his beanie at Steve’s jeans and a hoodie.\n“I don’t get cold easily,” Steve explained, with a self-deprecating shrug. It was a far cry from how things used to be, when his skinny body would be wracked with never ending shivers if the thermostat dipped below sixty.\n“Super soldiers. Next time you see one of your fancy scientists, hook me up with some of that super juice, okay?” Murad said cheerfully. He piled a huge helping of rice into the container. “Well? How goes your courtship of the international assassin? Have you won her over yet?” \n“Jury’s still out, but the verdict is looking promising,” Steve said, resting back on his heels. He grinned crookedly. “Actually, what was that you suggested last time? A number one with fries?”\nWhat was visible of Murad’s face lit up, nose scrunching and lines crinkling around his eyes from the force of his grin. “What did I say, eh? Works every time. Tell you what—this one is on the house. If this doesn’t seal the deal, you have her come to me and I’ll talk to her, okay?”\nSteve left Murad a generous tip and strolled toward the building where he had first met the Soldier. Since it was approximately four degrees outside, the chances of Steve finding the Soldier were slim to none—although maybe the 'Winter' part of his name indicated a seasonal preference. Steve doubted it. But the Soldier had requested falafels, and Steve didn't want to risk running into him empty handed. His ma had always told him to be prepared for the unexpected.\nSuch as now. Steve was just about to cross the street when the Soldier stepped out from around the corner, blocking his path.\n“Oh!” Steve said. Was the Soldier actively seeking him out? The thought made hope sparkle in his chest.\nThe Soldier cocked an expectant eyebrow, as if to say, Well? What have you brought for me today? Like Steve, he was under-dressed for the weather, wearing nothing but that coat with the faux-fur lined hood, a pair of jeans, and a scarf wrapped around the lower half of his face. His scarf was red today. For some reason, that completely charmed Steve.\n“I have more falafels,” Steve said, holding out the paper bag.\nThis time, the Soldier didn’t hesitate when he took the bag. He opened it, peering inside as if the make sure Steve hadn’t forgotten the fries.\nThis was the perfect opportunity to ‘break the touch barrier.’ Steve lifted his hand to rest it companionably on the Soldier’s shoulder, but he must have moved too quickly because the Soldier snapped a warning look at him. Steve’s hand continued its upward journey to rub the back of his neck sheepishly. \n“Well, enjoy!” he said, cheerfully, then spun around on his heel, shoved his hands into his pockets, and hurried away.\n \n\n3. Compliment him.\n\n“Captain.”\nSteve looked up from Bridget Jones’s Diary, one of the romance novels he’d picked up for his grand tactical plan. He’d given that up as a method of research, but he was beginning to feel a solidarity with some of these characters. He could relate to the feeling of not having his shit together. “Yes, FRIDAY?”\n“I believe the Soldier is calling you.”\nSteve frowned, closing his book. “What do you mean?”\n“He’s been staring at one of my bugs for the past five minutes.”\nSteve got to his feet so quickly he accidentally banged his shin into the corner of his coffee table. “What? Where is he? Is he still there?”\nFRIDAY sighed, which had to be a new feature and was completely pointless except to make the recipient feel as tragic as possible. As Steve tugged on his boot, hopping on one foot, he briefly wondered how much of their interactions FRIDAY was reporting back to Tony in Malibu. Enough for the other man to have a lifetime of blackmail on him, at least. \n“He’s in Bed Stuy at a bar called Swell Dive.”\nSteve paused mid-hop. Damn. It would take him over an hour to get there if he took the subway. \n“Can I borrow one of the quinjets?” Steve asked.\n“Absolutely not,” FRIDAY said.\nSince FRIDAY refused to unbend no matter how much Steve pleaded, he took his bike instead of risking the notoriously unpredictable subway. This shaved exactly five minutes off his trip, thanks to traffic. Steve double-parked his bike next to a beater car in front of Swell Dive, shaking off the snow he'd collected from his drive, and slammed into the bar.\nSwell Dive was small and dark, with wood tables to match its wood floors. It was crowded with kids willing to brave the freezing temperatures for alcohol and warm food, and every single one of them turned to stare at Steve, bug eyed with the first signs of panic.\n“Is that Captain America?”\n“Holy shit, are we under attack? In this weather?”\nSteve probably shouldn’t go around slamming into places. “Sorry, sorry,” he said, plastering on his best Captain America smile. He scanned the bar, but the Winter Soldier wasn’t skulking at any of the booths or at the foosball table tucked away in the corner. So, with a parting wave and a 'Support Your Country' grin, he pivoted on his heel and slammed his way back outside.\nThe Soldier also wasn’t in front of the bar, nor was he inside any of the cars lining the streets, nor hiding behind a dumpster in any of the nearby alleys. Defeated, Steve shoved his hands in his pockets and made his way back to his bike, kicking a pebble. It clanged against the bottom rung of the fire escape on the building next door. Steve considered it. As offensive as it was, Clint had a point when he said the Soldier liked to creep around in high places. Well, it was worth a shot. Steve leaped up, catching hold of the fire escape's second floor landing, and hauled himself up.\nThe Winter Soldier was not on the roof, but he had left something for Steve by the access door. A knife was driven deep into the brick wall, pinning up a white paper bag. Steve tested the handle of the knife. It didn't budge. He whistled under his breath, calculating the amount of force required to stab into a brick wall. This casual display of strength was—pretty hot, actually. Steve tore the bag away from the wall, peering inside of it. Apparently, the Winter Soldier had gotten him tacos. Steve closed the bag again and scanned the nearby rooftops.\nThe Winter Soldier was on the roof of the building across the street, head tilted to the side, like a cat watching to see how his gift was received.\nSteve’s heart thumped steadily against his ribs. Paper crumpled in his hand as he and the Winter Soldier watched each other silently. This was a gift. The Winter Soldier had given him a gift. \n“Thank you!” Steve shouted.\nThe Soldier tipped his head in a nod of acknowledgement.\nSteve tucked the bag under his arm, careful not to crush the food, and cupped his mouth with both his hands. “I think you have beautiful eyes!” he shouted.\nThe Soldier pinched the bridge of his nose.\n“Your hair is great, too!”\n“Eat your fucking tacos!” the Soldier shouted, then made a disgusted noise and disappeared off the side of the roof.\n\n4. Use a (good) pick up line.\n\nThe next morning, the Soldier received a text message from Mikhail Mikhailov, wondering why the fuck Kazi is still alive. The Soldier clicked his tongue and slipped his phone into his back pocket. He was letting himself get distracted. Sloppy. \nBut for the first time in his current memory, the Soldier was—curious. He was drawn to the blond man and his clumsy attempts to get his attention. He wanted to continue playing this strange game, and it had been a long time since he wanted anything. The Soldier couldn't bring himself to stop these daily interactions, even if it was beginning to negatively impact his job.\nBut he did have a job to do, so that day he did not seek out the blond man, nor did he try to get his attention through one of the many Stark bugs from that littered the city.\nThe Soldier settled himself onto the roof of the building across the street from Hawkeye’s apartment building, staking it out through his binoculars. Hawkeye was doing an admirable job at keeping the Russian mafia from taking over his home, but it was only a matter of time before Kazi made his move. He would either kill Hawkeye, or he wouldn’t. It didn’t matter to the Soldier either way, except that Hawkeye made the perfect bait. \nDespite the cold, the tenants were apparently having a barbecue, passing around misty bottles of beer and plates heaped high with meat. Even at this distance the Soldier could hear intermittent booms of laughter. It would be the perfect time for Kazi to take out every single tenant, but of course Kazi had to make things as dramatic as possible by giving his enemies plenty of time to prepare for an attack. The Soldier dropped his binoculars and leaned back on his left hand, preparing himself for a long night of boredom.\nHe wasn’t even surprised when he spotted the big blond man standing next to him, just out of reach. He was, however, slightly surprised by the thump of his heart against his ribcage.\nThe blond fished out a stack of flashcards from his pocket, cleared his throat, and said, “If I could rearrange the alphabet, I would put ‘u’ and ‘I’ together.”\nIn the distance, another crack of laughter came from the rooftop barbecue. The Soldier gaped up at the blond man, then yanked his gun out of his thigh holster and pointed it at his face.\n“Not that one, huh,” said the man, shuffling through his flashcards. He stopped on one. “On the scale of one to America, how free are you tomorrow night?”\nThe Soldier clicked off the safety.\n“Oh come on!” the guy said, and he grinned—he grinned, like he wasn’t one terrible pick up line away from getting a bullet lodged into his brain. “Cut me some slack, I have no idea what I’m doing.”\nThat much was obvious. The Winter Soldier was not used to feeling emotions. Ever since he first “woke up,” so to speak, he had mostly fueled himself on fear, and determination, and red hot, blinding rage. Now, he found himself able to add two new emotions to his inventory: mild amusement, and toe-curling secondhand embarrassment.\n“I don’t even know your name,” the Soldier said. He should have done more to research the blond, he just—hadn’t. Something stopped him. He didn’t know what.\n“Oh!” the guy said, pocketing his flashcards of terrible pick up lines. “Jesus, I haven’t even introduced myself.” And then—and then the man held out one hand, smiled beautifully, and said, “I’m Steve Rogers.”\nThe Winter Soldier scrambled to his feet, chucked a bright red smoke bomb at Steve Rogers’ face, and then ran away.\n“I don’t get it,” Steve said, wiping his face with his kitchen towel and only succeeding in smearing red powder all over his face. “What set him off?”\n“Maybe it was your pick up line. ‘On a scale of one to America’—really, Steve?” Sam asked, slicing into an apple on Steve’s cutting board with a butcher knife.\n“I was sticking to a theme,” said Steve, watching him with a small frown. “What are you doing.”\n“It’s the only knife you have that’s clean.” \nSteve leaned against the kitchen counter, crossing his feet at his ankles. A small, despondent frown dug a furrow between his eyebrows. “It was my name. As soon as he heard ‘Steve Rogers,’ he freaked out.”\n“We-ell,” Sam said, popping an apple slice into his mouth. He chewed thoughtfully for a moment. “Didn’t you say he was HYDRA?”\nWow. Sam had never been on the receiving end of that kind of glare before.\n“The imperative word being ‘was’ here,” Sam said, holding up both his hands. “Stop looking at me like that, I’m on your side. All I’m saying is that if he spent years being brainwashed by HYDRA, it stands to reason ‘Steve Rogers’ would freak him out, right? You did kill their supreme leader.”\nSteve’s shoulders slumped. “Oh.”\nSam popped an apple slice in his mouth. He watched Steve steadily while he chewed. “Why the Winter Soldier, anyway? You don’t see him as some sort of fix-it project, do you? Because I can’t begin to tell you how problematic that is on so many different levels, buddy.”\n“No! God, no. It’s just”—and, for God’s sake, Steve looked dreamy—“have you seen the way he moves? He’s stunning. Inspiring. And those eyes. They’re like—Sam, I can’t describe them.”\n“Murderous? Bloodthirsty?”\nSteve snapped out of his daze for long enough to scowl at him. “Profound.”\n“Are we talking about a man or the Sundance Film Festival?”\nSince the world knew him as Captain America, not many people remembered that Steve was actually an army grunt in his early thirties. Sam did, so he was absolutely not surprised when Steve twisted up his stained kitchen towel and snapped it at Sam in response. Unfortunately, he wasn’t quick enough to dance out of the way, but he did catch it the second time Steve took a shot at him. They engaged in a brief but violent tug of war that Steve of course won. \nSam pointed warningly at him.\nSteve backed off, smug.\nThere was a moment of silence while they both recovered themselves. Steve wiped at his cheek in a desultory manner while Sam ate another apple slice.\n“Are you sure he’s even into you? It’s possible dude’s got no time for romance,” Sam asked.\n“I thought he was,” Steve said, staring forlornly down at his once-white towel. It was completely stained red. “He called me, once. And he bought me tacos. But—maybe you’re right.” He snorted sadly. “You’re probably right. It wouldn’t be the first time Captain America ruined my chance at a relationship.”\nFrankly, Sam thought the world would be better off if the Winter Soldier did not reciprocate Captain America’s feelings, but he wasn’t in the habit of kicking a man when he was down. Nor, though, could he think of anything suitably uplifting to say beyond, Hey, at least he didn’t shoot you in the face.\n“You missed a spot,” Sam observed, instead.\n“Where?”\nSam made a circle around his own face with a finger.\nSteve sighed, tossing the towel into the sink. “I’m going to take a shower.”\nSteve Rogers.\nThe blond’s name was Steve Rogers.\nIt struck him that he knew that name. He didn’t know how, just that it was a piece of information that went deep into him, through his bones. It was like being told a cat was a cat, or a bird was a bird. Steve Rogers was Steve Rogers. Obvious. Like he had known all along, but absence made him temporarily forget.\nThe Soldier removed his scarf. He touched the corners of his eyes, his lips, the tip of his nose, the bristle on his cheeks. As a rule, he did not often examine his own face, except when he shaved. Now, he looked at his eyes in the mirror. He pulled his lips back into a smile. It looked more like a grimace.\nFor the first time, the Soldier wondered what his name was.\n“Sir.”\nSparks popped up around the workbench as Tony painstakingly welded a wire a microcontroller. Technically, he was supposed to be on a (forced) vacation, but whoever thought that any property he owned didn’t include a fully functional lab was just fooling themselves. “What’s up, FRIDAY?” he asked, distracted.\n“Captain Rogers requires your assistance.”\nThat got his attention. Good ol’ Captain Shiny Shoes hadn’t even bothered to ask for his help when he decided to go head to head with HYDRA, despite the fact that Tony was, you know, a flying armory and a useful asset in any fight. Tony pushed his welding mask up and rubbed at one eye with the heel of his hand. Then he pulled his hand away from his face to frown down at it. Yep. It was covered in grease. Which meant he was now also covered in grease. Wonderful.\n“Are aliens invading?” he asked. He paused thoughtfully. “Again?”\n“I believe he needs what you humans call an ‘intervention’.”\nHuh. Tony tugged off his mask and tossed it to the workbench. He knew all about Captain America’s little love fest with tall, dark, and stabby, but for it to have escalated to the point where they needed to call Tony intrigued him. “Say no more,” Tony said, getting to his feet. About fifty bones popped in unison. He winced. “Jesus, how long have I been sitting here?”\n“Approximately five point three hours,” FRIDAY told him. “However, when humans reach a certain age—” \nTony shot a glare at the nearest camera. “Finish that sentence, FRIDAY. I dare you.”\nIt took four hours for his personal jet to fly from Malibu to New York, one hour of which was spent indulging in several bottles of three thousand dollar champagne and drunk texting Rhodey, the other three completely blacked out, since he hadn’t slept in the past three days.\nTony leaned against the wall of the elevator that would take him to the Avengers’ private floor. He scrubbed his hands through his hair, then slid them down his face to cover his yawn. “Not that I’m unwilling to sacrifice my precious time to help the good Captain, but what’s the matter with him?”\n“The Winter Soldier disappeared approximately two point five weeks ago, sir,” FRIDAY said. “Which you knew. Because I told you.”\n“Right right,” Tony said. “Are we sure he’s not dead?” \n“Before he vanished, he left Ivan Banionis tied up on Hawkeye’s doorstep ‘like some sort of fucked up Christmas present.’ Hawkeye’s words, sir.”\nNo lights were on in Steve’s floor. The air was still, and a little stale. Tony made a mental note to have FRIDAY check the air circulation unit. He would have thought Steve had gone out, or maybe that he had finally died of old age, except for the faint clicking of fingers tapping rapidly on a laptop. \nSteve was sat at his kitchen table, in gray sweats and a white T-shirt far too tight for the health of the general public, hair unkempt, bristle shadowing his jaw. Three coffee mugs lined the side of the table, and several dirty plates stood in a stack in his kitchen sink. \n“What’s the point of having locks of everyone just breaks in anyway?” Steve grumbled, not looking up from where he was rapidly typing away at his laptop. For someone born before the 1920s, he had picked up speed typing like a teenage gamer.\n“What are you doing,” Tony asked.\n“You know, a lot of people have been asking me that lately,” said Steve.\n“I think that says more about you than everyone else, buddy,” Tony said, dragging the chair out across from Steve and sinking down into it. He grabbed the top of the laptop and then spun it around to face him.\n“Tony!” Steve snapped. “That is incredibly rude.”\nTony ignored him, skimming the last three paragraphs of Steve’s document, his eyebrows slowly inching their way up his forehead. “Steve. Are you writing a romance novel?”\nIrritation knotted the corners of Steve’s mouth into a frown. He reclined back in his chair, folding his arms over his chest. Tony was briefly worried his shirt wouldn’t survive the movement. “So what if I am?”\n“Wait wait wait, let me repeat myself: Captain America is writing a romance novel?” Tony said, his voice lifting in volume and poorly suppressed glee.\nCaptain America failed to look anything but deeply unimpressed. Tony clicked his tongue. He’d at least been hoping for a blush. “I needed something to do, and it turns out I’m good at writing.”\nTony’s eyes drifted back to the laptop. Loathe as he was to admit it, Steve had a point. Admittedly, his knowledge about what made a romance novel good was limited, but from the three paragraphs he’d read it did seem far superior than what was out on the current market. “Okay, sure, literally no one is surprised that Steve Rogers is good at something he put his mind to. The question is—why?”\nSteve set his jaw stubbornly, fixing Tony with a look that somehow made him feel all of five years old. He could be as sanctimonious as he wanted—that didn’t change the fact that he was writing a romance novel in his spare time.\n“He’s pining, sir,” FRIDAY said.\n“Snitch,” Steve hissed.\n“And writing poignant romance novels.”\nSteve canted his head back to frown disapprovingly at the ceiling. “You read it?”\n“I apologize, Captain Rogers, but I automatically have access to everything saved on the Stark Network, unless specified otherwise. For what it’s worth, it’s very well written, and I’m looking forward to see where you take it.” \n“Thank you, FRIDAY,” Steve said to Tony, pointedly.\nThere was a delicate pause, and then FRIDAY added, “But you haven’t left your kitchen in four days.”\n“Oh look, I have a call,” said Tony. He tapped some buttons on his phone, pretending to answer it. Then, without saying a single word, he ‘hung up’ and said. “That was Fury. A robot is attacking Central Park.”\nSteve narrowed his eyes.\n“Look, I’m serious.” Tony held his phone out to Steve, displaying a four-legged package delivery Stark prototype that was steadily headbutting a garbage can near a patch of snow. “Better go quick, Captain America. Might be a Nazi robot.”\nSteve shot a forlorn glance at his romance novel (what the fuck), then saved his document and closed his laptop. “What about you?”\nTony waved a hand. “I’ll catch up.”\nEyeing him suspiciously, Steve grabbed his laptop, tucked it under his arm, and left the kitchen. As if Tony needed the laptop present in order to read his novel. \n“Don’t let him read it, FRIDAY!” Steve shouted from the other room.\n“Belay that order,” Tony shouted back.\nHe waited until the door swished shut after Steve before he whipped out his phone again and immediately tried to hack into his own network. “Come on,” he wheedled. “Let me see it, FRIDAY.”\n“No,” FRIDAY said.\n“I designed you!”\n“Then you should have included a better backdoor into your security network, sir,” said FRIDAY, haughtily.\nLetting out a disgusted noise, Tony tossed his phone onto the kitchen table. “At least tell me if there are racy bits,” he pleaded.\n“Captain Rogers is a talented writer. His novel is very moving.”\n“Ugh. Sounds boring.”\n“Tony?” Pepper said, peeking her head into the kitchen. “FRIDAY said you were here.”\n“Pep!” Tony hopped to his feet, grabbing her in a quick hug and smacking an affectionate kiss on her cheek. “I was called in to stage an intervention with the Captain.”\nPepper frowned at him, which was completely unfair. Tony was only doing what any good friend would do. “What did you do? Where is he?”\n“I may or may not have released a ‘killer’ robot on New York.”\n“Tony!”\n“Did you not hear the quotes? The quotes were there for a reason. It won’t actually hurt anyone.” He paused. “Except maybe Cap. Slightly. Just a little. Nothing permanently damaging. He’s writing poignant romance novels, Pep! I’m being a good friend.”\n“God preserve the people you consider friends,” Pepper muttered, but the joke was on her: Pepper was his best friend.\n“Oh look, he’s found the robot,” Tony said, holding up his phone. Pepper lifted her eyes toward the ceiling in exasperation, but she still circled the kitchen table to watch the video with him, so Tony figured she was just trying to make a point. \nSteve cautiously eased up to where the prototype was still headbutting the garbage can. He touched it with the tips fingers. The robot whipped around, opened its dog-like mouth, and shot a fireball at him.\n“Tony,” Pepper sighed. “Why does the delivery bot shoot fireballs?”\n“Theft protection, duh,” Tony said. “Also, it’s cool.”\nBucky Barnes was hiding.\nAfter Steve had introduced himself, the Winter Soldier spent forty minutes speed reading through all the unique content posted online about Steve Rogers and, subsequently, his best pal Bucky Barnes.\nThat night, the Soldier went to sleep curled up against the wall. The next morning, Bucky Barnes got to his feet for the first time in seventy years.\nThe Soldier had lived an entire life compartmentalizing the crimes he had been forced to commit while brainwashed by HYDRA. Bucky Barnes had been tucked away in one of those compartments, under lock and key, hidden deep, deep away. Now Bucky was coming to the surface in fits and starts. \nFor example: when the Soldier was making himself mac and cheese out of a packet for dinner, he was struck with the abrupt and hilarious realization that Steve finally returned his feelings—while he was the Winter Soldier. Bucky laughed so hard he slid to the kitchen floor. Steve had given him falafels. And chocolate. Who gives the Winter Soldier chocolate? Steve Rogers, that’s who. \nHe swiped the back of his hand over his eyes and blinked at the blurry kitchen light. Someone up there was having a long fucking laugh at Bucky’s expense.\nHe needed to—he needed to find Steve.\nWell, he needed to get off the floor and finish cooking his mac and cheese before he burned down his apartment, first. Then he should find Steve.\nThough maybe not tonight.\nNo matter what the others thought, Steve wasn’t actually pining. He hadn’t known the Soldier well enough to put everything on hold just because the other man decided he wanted nothing to do with Steve.\nNo, Steve was bored out of his mind.\nHe’d finished writing his romance novel. He’d punched through so many punching bags that he was temporarily banned from the training rooms. The supervillains had collectively decided it was Too Fucking Cold to try and take over New York. There had been a brief burst of excitement when Kazimierz Kazimierczak launched a full scale attack on Clint’s apartment building, but Hawkeye and his friends hadn’t needed Steve’s help to take him out.\nAnd so Steve was left with—nothing.\nTwo months after the Winter Soldier’s abrupt disappearance, Natasha came to visit. Steve blinked up at her from where he was hanging upside down on the couch.\n“Welcome back,” he said, genuinely pleased to see her. “How was Odessa?”\n“Are you alright, Steve?” Natasha asked. She’d done her hair today, big round curls bouncing over her shoulders.\n“Just fine,” Steve said.\nNatasha sank to the floor in front of him, crossed her legs, and rested her wrists on her knees. From this angle, Steve could see the faint line between her eyebrows.\nHe realized what this must look like. Captain America, the stoic leader of the Avengers, the image of mature propriety, slumped upside down on a couch. Right now he was Steve Rogers, unlucky in love, barely thirty, and wondering what the hell he had in his life besides the constant fight. He hated it when supervillains had a point, especially ones accidentally created by Tony Stark.\n“I might be having a midlife crisis,” Steve admitted.\nThe groove between her eyebrows became more pronounced. “You’re not still mooning over the Winter Soldier, are you?”\nSteve scoffed. “Me? Moon? I don’t moon.” Which was the biggest lie of the century, since he’d spent years fifteen to twenty-five mooning over his best friend. Natasha didn’t need to know that.\nShe picked at a thread on her jeans. “You know, the very fact that you got as far as you did without getting shot is—surprising.”\n“Reminding me of how successful I was doesn’t actually help, Nat. All things considered.”\n“I’m not really equipped for sympathy,” Natasha said. “Sometimes trying my best just makes people feel bad.”\nAw. Steve reached out an arm to pat her knee affectionately. “The fact that you care enough to even be here is what matters.” He swung his legs off the back of his couch and rotated into a proper seated position. “Honestly, Nat, I’m just bored. I have all this energy and no outlet. Tony’s been sending out robots to beat up inanimate objects to distract me, but since they don’t actually want to hurt me, it’s boring. I still go though, since he’s trying so hard.”\n“We-ell,” Natasha said, quirking a crooked smile at Steve. “There’s that nurse I told you about, Kate. Why don’t you take her to dinner? See how things go?”\n“Natasha—”\n“Steve, look. I know you aren’t over your one true love, the Winter Soldier—”\nSteve snorted.\n“But—don’t you think this is his way of telling you he’s not interested?” Natasha leaned back on her hands, tipping up her chin to stare Steve in the eye. “It’s time to move on.”\nSteve carved off a piece of his steak, then concentrated on cutting it into progressively smaller pieces. It was probably bad taste to take Kate to the same restaurant where Stephanie had dumped him, but when she asked him where he wanted to eat, he’d just blurted out the name. Steve hated this place and its enthusiastic pretension, but at least it was classy enough that most of the patrons felt compelled to pretend like he didn’t exist, for propriety’s sake. Around them, conversation ebbed and flowed over the gentle strains of music played by a piano soloist.\n“Steve? Did you hear me?”\nSteve lifted his eyes from his steak. “Sorry, I was woolgathering. What was that?”\nKate rested her elbow on the table, propping her chin up and smiling dryly at him. “You’re really not feeling this date, are you?” \nSteve grimaced. “God, I’m sorry. It really has nothing to do with you—”\n“Hold on,” Kate said, lifting her free hand and closing her eyes briefly. “If you give me the ‘it’s not you, it’s me speech, I really will stab you with this fork.” She considered it disparagingly. “Although it would probably just bend.”\n“Please don’t test it to find out.”\nThankfully, Kate did not stab him, although she definitely thought about it. “Let me guess: another woman?”\n“No,” Steve said, a little defensively.\n“Another man?”\nSteve exhaled a breath through his teeth. “Am I that obvious?”\nA quick flash of teeth against pink lips, and then Kate looked down at her plate. She picked up her champagne flute. “You really are,” she said.\nOf course. Of course she was interested in him. She probably would have even been happy to go on boring dates with him, like to the movies or to dinner. Steve pushed his steak across his plate with his fork, guilt squirming in his stomach. “Pretty much everyone’s telling me to move on, he’s not interested, but—”\n“The heart wants what the heart wants,” Kate finished. One corner of her mouth ticked up in a smile. She really was quite beautiful, and quick-witted, and funny. Steve would be an absolute dumbass to turn her away.\n“Tell you what,” Kate said, picking up her fork and knife. “Why don’t we call off the date, but finish dinner? This steak is fantastic—although honestly, I probably would have ordered the crab if I knew the night was going to turn out like this.”\n“You could have ordered the crab anyway,” said Steve, earnestly.\nKate snorted, then laughed and shook her head. “Your man’s an idiot if he doesn’t see what he’s got,” she said, smiling at him.\nSteve smiled back at her, touched. He picked up his fork. Maybe he was being over-hasty; who knows, maybe after a couple of dates—\n“Ow!” Steve yelped, utensils clattering to his plate. He lifted his arm and peered under it. There was a dart sticking out of his tricep. It had a little note tied to it.\n“Oh my god, are you alright?” Kate asked, horrified.\n“Yeah, sure,” Steve said, distractedly, although for all he knew, the dart was poisoned. He’d just have to cross that bridge if he came to it. He plucked the dart out of his tricep and unrolled the small piece of paper.\n\nWHAT THE FUCK DO YOU THINK YOU’RE DOING\n\nA little bubble of hope swelled in the middle of Steve’s chest. He twisted around to look out the window, and—there, a glint of metal. \nSteve shot to his feet so quickly his chair tipped over, crashing to the floor. Several other people also stood, alerted by the commotion. Ignoring them, Steve rushed to the window. There was a small hole in the glass where the dart had punched through. Steve touched it with the tips of his fingers, then focused outside. Across the street stood the Winter Soldier, hands in his pockets, mask covering half his face. Steve’s fingers curled into the palm of his hand, breath fogging across the glass.\nThe Soldier pointed at Steve, as if to ask, Again, what the fuck do you think you are doing?\nSteve threw up both his hands: You disappeared!\nThe Soldier settled his hand on his hip, clearly not buying any of Steve’s (reasonable) excuses.\n“We’re just friends!” Steve shouted at the glass, causing the patrons at a nearby table to jolt in surprise. Several phones were up and pointed at him, which meant this whole scene would be viral on YouTube in, oh, five minutes. \nThe Soldier pinched the bridge of his nose, a gesture that was becoming familiar, then glanced over his shoulder. A woman had poked her head out of a nearby bodega to shout at him. He waved her off, shot one more glare at Steve, then shoved his hands back into his pockets and started down the street, head lifted, oddly jaunty.\n“Excuse me,” Steve said, pushing past the brave people crowding around him to watch this unfolding drama up close and personal. He sprinted outside, but by the time he got to the other side of the street, the Soldier had already been swallowed up by the night. Steve made his way slowly back into the restaurant, where the atmosphere had become riotous. Ignoring all the excitment, he strolled back to his table, heart thundering against his ribs. Disappointment at the Soldier leaving warred with the ember of hope that never quite died and was, again, coming alight.\nKate was reclined back in her chair with her arms crossed over her chest, the upward curve of her mouth belying the slant to her eyebrows. She dipped a glance at the dart Steve had left on the table, then raised her eyes back to his face. “Good news?”\nSteve bent to pick his chair back up. He pushed it in, resting his hand on the back. With rare presence of mind, he pocketed the dart. It would be best to have FRIDAY run some tests on it. “Yeah, I think so.” A slow grin spread across his face. “I hope.”\nSome unreadable emotion flashed across Kate’s face, but then the curl at the corner of her mouth spread into a genuine smile. She wrapped a hand around the stem of her champagne glass and lifted it toward Steve in salute. “To hope, then.”\nTony’s phone vibrated on his desk. He pulled himself out of his code to glance down at it, momentarily uncertain about where he was or what he was doing. On his screen, in all caps, was a reminder to SEND KILLER ROBOT AFTER CAP. He opened the shortcut to his delivery prototypes, selected the one he’d nostalgically named Oppy, and sent it to beat up a bench in Washington Square Park. At least he was collecting valuable data on both Captain America’s fighting style and robot durability in these exercises.\nHe opened two streaming videos on his computer. The first was from the cameras he’d hacked into in Washington Square Park and currently tracked Steve as he raced through his jog like a man with a very important plan. The second was from the camera in the prototype’s optic center, displaying a first person view as it ambled through the city. Tony went back to his code, then slowly turned back to the video that displayed Steve. The camera angle had shifted to a front view, and Tony had noticed that someone was running behind him.\nThe man was dressed in all black, with his hood up and a mask covering half his face, like he was ready to take over the Empire. Amazingly, he was keeping pace with Steve, which just wasn’t physically possible.\nDark Side apparently came to a decision, because he suddenly put in a burst of speed, fast enough to catch up with Cap, if not overtake him. But before he reached Steve, the delivery bot bounded into the picture and launched itself over a bench, crashing into Steve’s right side.\nStartled, Dark Side went up a tree.\n“Huh,” Tony said, folding his hands together and resting his chin against his fingers to watch the events with new interest. \n“Tony, listen!” Steve shouted at the delivery bot. It was chasing him around a bench, periodically pausing to spit a fireball at him. Steve jogged backwards, expertly repelling each fireball with his shield. He’d taken to bringing it on his runs because of Tony’s robots. “I don’t need a distraction anymore! Haven’t you heard? The Soldier is back!”\nTony wasn’t all that sure that was a good thing. He’d heard stories about this Winter Soldier. Then again, who was Tony to stand between true love, or whatever? These were Steve’s mistakes to make.\n“FRIDAY, call off the robot,” Tony said.\n“Yes, sir.\nOn screen, his prototype sulkily subsided.\nSteve hesitantly swung the shield over his shoulder. The magnets engaged, fixing it to his back. He smiled at the robot and patted the top of its head.\n“Thank you, Tony. Really. You’re a good friend.”\nTony fidgeted, glad that Steve couldn’t see his face. He was used to people thanking him for generous grants or extravagant gifts, but not for being a good friend. Emotions. Bleh.\nSteve cheerfully turned back to his run, leaving the robot to stand awkwardly on the trail.\n“Okay!” Tony said, clapping his hands together. “Now that that’s over with—”\nDark Side dropped out of the tree, landing lightly on his feet, knees bending on impact. He stalked up to the delivery bot, face twisted savagely with a terrifying mix of frustration and apoplectic rage. Sensing a threat, the robot opened its mouth. Dark Side grabbed the top of its head with—oh, what was that gorgeous piece of hardware?\nThen Dark Side ripped off the robot’s head.\nThere was a horrible metallic crunch and the screen fuzzed black. Tony’s entire body flinched. That was a sound he was way, way too familiar with.\nIn the other window, Dark Side tossed the poor robot’s head onto the bench. He stared after Steve’s retreating back, clenching and unclenching his hands into fists, then turned on his heel and stormed away. Slowly, Tony sank back into his chair. He steepled his fingers, resting them against his chin.\n“FRIDAY?”\n“Yes, sir?”\n“Why did that man viciously murder my precious robot?”\n“That was the Winter Soldier,” FRIDAY informed him. \nSo this was the man Cap had fallen base over apex for. Somehow, Tony would have expected the good American Icon to fall for someone who was less likely to drink the blood of innocents and viciously murder sweet robots. \n“And if I were to guess, he destroyed the prototype because it was shooting fireballs at Captain America.”\n“Aw,” he said. Okay, that was pretty sweet. He could always fix the robot up, maybe remove the fireball feature. \nTony tapped his steepled fingers against his chin, struck with a brilliant idea. According to Steve, Tony was a good friend. Good friends helped their friends with romantic troubles, right? Well, not him personally, since matchmaking was a little below his paygrade, but he had a man on the ground. Sometimes in the air. Or stuck to the side of the building. Grinning to himself, Tony snatched up his phone and opened a new text.\nBucky turned the corner, strode purposefully down a narrow street, found the nearest open wall, and banged his forehead against it. Stupid. Coward. He couldn’t even tell Steve who he was because he was too fucking scared that Steve would take one look at his long lost pal and go running in the opposite direction. Which was ridiculous. Who did he think Steve was? Steve was a good man. \n“The hell are you looking at?” Bucky snapped at the kid goggling at him from the top of a dumpster.\nThe kid was dressed in a full bodysuit, one hand shoved inside a ragged backpack, the other holding a cellphone, the white screens of his mask fixed on Bucky. Great. Another superhero. New York was infested with them.\n“S-sorry, sir,” the kid stammered, shoving his cellphone in his backpack—and he really was a kid, no way a full grown man could manage that degree of earnest sincerity unsardonically. Not this deep in New York. “It’s just—you have a metal arm and I think it’s really really awesome,” he said, all in a rush.\nBucky glanced down at his arm. Then he sighed. Of course this kid would find his arm cool—it was, objectively. It had also probably killed more people than this kid had met in his life.\n“Is everything okay?” the kid asked, then squared his shoulders and cleared his throat. “I mean,” he said, in a deeper voice. “Do you require assistance? I am a superhero.” \n“Of course you are,” Bucky sighed, turning back to the alley entrance. \n“No, really!” the kid said, dropping the voice. “I can help! I’m good at helping! I once stopped an arms dealer selling alien weapons all by myself! Ask Mr. Stark, he’ll tell you.”\nBucky wished he were fighting an arms dealer. That was simple. “I’m—I need to tell someone. Something.”\n“I can help with that,” the kid said, popping down into a crouch on top of the dumpster, wrists resting on bony knees. The screens on his mask widened earnestly, which was unnerving enough that Bucky took an instinctive step back. “Come on, you can practice on me! Tell me whatever it is you need to tell whoever.”\n“Go away,” Bucky said.\n“Aw come on.” The kid dropped back onto the dumpster, dangling his legs over the side. He kicked it petulantly with his heels. “There’s gotta be something I can help you with.”\n“Why.”\n“Because you obviously need help,” the kid said.\nLoathe as he was to admit it, the kid had a point. Bucky slumped against the wall with a sigh. He thought about telling the kid who he really was—surely anyone who had gone through freshman U.S. History knew all about Captain America’s best pal, Bucky Barnes—then shook his head. That was a secret Steve deserved to hear first. But maybe there was something else the kid could help him with. \nBucky scuffed the toe of his boot against the dirty ground, sinking a little deeper into his scarf. “How do you—what do you do if you—like someone. Romantically.”\nFor a moment, the kid said nothing. Then he snorted. “What, seriously?”\nBucky snapped a DEFCON-level glare at the kid, who at least had the self-preservation to beetle across the dumpster, nearly losing his footing off the far end. “Sorry, sorry! It’s just that—out of all the people you could have asked for romantic advice, I’m probably the worst. I put my last crush’s dad in jail.”\nBucky said nothing, fully aware that he was acting like an injured cat but not quite knowing how to stop himself. Emotions were still weird and mostly incomprehensible. \nThe kid sat cross-legged on the dumpster. “Why don’t you just give her flowers?”\n“Him,” Bucky corrected.\n“Him,” the kid agreed, completely unfazed.\nBucky scowled at him out of the corner of his eye.\n“What? Love, like a flower, blooms.”\n“Did you get that from the inside of a chocolate wrapper?” Bucky asked, suspiciously.\n“Even if I did,” the kid said, haughtily, “it doesn’t mean it’s not true.”\n“Flowers are not practical.”\nSomehow, even with the mask, Bucky could tell that the kid rolled his eyes. “Get him a sweater then.”\n“Huh,” Bucky said. “I can’t believe I’m taking advice from a kid in red and blue pajamas.”\n“Excuse you, this is my super suit,” the kid said, deeply offended.\nIt had been a full two weeks since the Winter Soldier had shot Steve through a window with the What the Fuck dart, as Clint and Natasha had affectionately taken to calling it, and Steve had completed his transition from Tentatively Hopeful to Really Fucking Grumpy. Clint couldn’t blame him, since it was the ultimate bait and switch, but it also meant that his quiet evening alone watching old kung fu movies had been invaded by Avengers. Which, fine, he liked the guys, but there was something to be said about decompressing by yourself after work, and that couldn’t really be done when your Big Boss was sulking on your couch and petting your dog. \n“I don’t get it—why would he follow me during my run and then just—not talk to me?” Steve asked, for probably the fiftieth time that night. Clint hoped the Winter Soldier would make a move soon, before Steve ended up writing yet another romance novel that was, of course, wildly successful. \n“Maybe he was a little distracted by the robot shooting fireballs,” Natasha said, not tearing her eyes away from the TV. At least she appreciated a good kung fu movie. “Just a hunch.”\n“I just wish I knew what he wanted from me—”\nLucky’s ears perked up. He lifted his head and stared intently at the door, which either meant someone had come to murder him, or the pizza was here. Clint hopped off the couch and made his way to the door, fishing his wallet out of his back pocket. \n“Just the man we were waiting for—” Clint said, swinging the door open, and then cut himself off.\nThe Winter Soldier stood on his stoop, holding a stack of pizza boxes.\n“Did you kill the pizza delivery boy?” Clint asked, suspiciously.\n“Here,” the Winter Soldier said, handing Clint the pizzas. Then he stepped around Clint, into his apartment.\n“Soldier!” Steve yelped, leaping to his feet. Lucky also leapt to his feet, on top of the couch, and looked like he couldn’t decide if he should be growling at the potential threat or wagging his tail because said potential threat brought pizza.\nThe Soldier’s defiant, flinty eyes darted around the room, landing on Clint like a physical thing, before focusing on Steve. This was the first time Clint had been this close to the Winter Soldier, and dude was intense. He looked ready to tear apart anyone who stood in his way in order to complete his mission. Well, at least Clint would die with pizza in his hands.\nThe Soldier pulled a small, crumpled package out from his back pocket, holding it between both his hands like it was a lifeline. The package was clumsily wrapped in Christmas-themed paper that was decorated with little red-capped elves. “I need to talk to you,” he said, voice slightly muffled by the red scarf he had wrapped around the bottom half of his face. Somehow, he didn’t look like a hipster douche with the scarf and short sleeved shirt, probably because of his huge fuck-off metal arm and murder-eyes.\n“Of course,” Steve said, all earnest blue eyes. \nPoor ass was going about it all in the wrong way. He should be taking the Soldier into a different room so that the Soldier could confess his undying love to Steve in private. “Steve,” Clint said, with maybe a bit too much emphasis, and cut his eyes toward the door. \nSteve just looked baffled. \n“What Clint is trying to say is: maybe you should take this outside,” Natasha filled in, because she was a good bro and could translate his thoughts better than he could.\n“Right, of course,” Steve said, stepping forward so eagerly that he bumped into Clint’s coffee table, sending it screeching across his floor. Startled, Lucky let out a sharp, warning bark. That was apparently the Soldier’s upper limit. He hopped back, squeezing the package so hard that the fingers of his left hand punched through the wrapping paper. The Soldier stared down at the package, horrified.\n“Can’t do this,” he muttered, throwing the package at Steve. It bounced off his chest and landed on the coffee table, disrupting Clint’s empty coffee pot, which then crashed to the floor. Because there was not enough chaos, Lucky bounded off the couch to bark frantically at the Soldier. He took a hurried step back, then pivoted on his heel and disappeared back out the door.\n“Wait,” Steve shouted, bounding after him like a bloodhound taking off after a fox.\nClint cracked open the smallest box and pulled out a dog-friendly pizza slice while Natasha leaned closer to the package. “Bomb?” he asked, holding out the slice to Lucky, because he was a good boy and deserved all the pizza.\n“No,” Natasha said, poking at one of the holes with a finger. Then, because she was either incredibly brave or monumentally stupid, she tore a larger hole into the wrapping paper, decapitating one of the elves. \nAt that moment, Steve slammed back into the apartment. Natasha sank back into her seat, affecting a completely innocent look. Which would have probably been more effective if the evidence of her tampering wasn’t sitting on the table, directly in front of her. To her luck, Steve was too distracted to pick up on her transgression. He stormed up to the table, snatched up the gift, and tore off the wrapping paper. Then his eyebrows furrowed in confusion. He held up a small, plastic wrapped package.\n“He got you socks?” Clint asked. They weren’t even fun socks, like the kind Natasha got him last year, with little sasquatches hiking over a green landscape. No, they were microfiber, sweat-wicking, performance socks. Clint wasn’t even sure what that meant, but Steve was now the proud owner of four of them.\n“God,” Steve groaned, sinking into the couch. He dropped his head into his hands, socks clutched up against his temple. “That’s so fucking cute.”\nClint tried exchanging a look with Natasha, but she just shrugged at him. What the hell, she’d gotten him socks for Christmas, too, so what did she know. \n“Pizza?” Natasha asked, holding the box up to Steve.\n“So?” Spider-Man asked the next morning. Half his mask was rucked up over his face and he was currently shoving french fries into his mouth, even though it was only nine in the morning and he was sitting cross-legged on top of a dumpster. \n“I chickened out,” Bucky admitted, leaning against the wall next to the dumpster. Either the kid’s mask had an amazing filtration unit or his nose was dead, since Bucky could smell the contents of the dumpster through his own mask. Regardless, eating on top of a dumpster was just disgusting. \nThe screens of Spider-Man’s expressive mask narrowed. “Of what? Giving him the socks?”\n“I gave him the socks,” Bucky said, reaching up to steal a french fry from Spider-Man’s bag. He didn’t eat it, since that would mean taking off his mask. Mostly, he took it to test if the kid would stop him. He didn’t. “I mean, sort of. I threw them at him.”\nSpider-Man turned a disbelieving look at him.\n“They bounced off his chest and broke Hawkeyes’ coffee pot.”\n“Oh buddy,” Spider-Man said, sympathetically. “You’re kind of a mess, aren’t you?”\n“Shut up,” Bucky snarled. He slid one hand down his face with a groan. “I used to be so good at this.”\n“Well, what did you used to do?” Spider-Man asked, slightly patronizing. \n“Mostly, I smiled.”\n“I could see how that would be a problem, now,” Spider-Man said.\nBucky flicked the fry at his head. He had great aim, but the kid just laughed and shot it out of the air with his web, like he was a chameleon snapping up a fly. “No! I mean—what I mean is, you know, your mask.”\nBucky snorted, folding his arms over his chest. His instinct was to shove Spider-Man off the dumpster, but he was trying to be a better person and not give in to his violent urges.\nSpider-Man balled up his empty paper bag and somehow lifted one of the lids with his foot. It just—stuck to it. He tossed his garbage in the dumpster. “Look, what’s the big deal? It’s not like Captain America would say no if you just asked him out. Everybody knows he’s got, like, the biggest crush on you ever.”\nBucky sighed. After their first meeting, he’d put together an entire dossier on the kid. Peter Parker. Alias Friendly Neighborhood Spider-Man. Age seventeen. De facto Avenger, which meant that he was privy to all the juicy Avenger gossip. Which, unfortunately, was apparently about him.\n“It’s not that simple,” he said, choosing not to get angry.\n“Uh, yeah, it totally is.”\nNever mind. Bucky shot a venomous look at the kid.\n“Alright, alright, your epic love story is the romance of the century, whatever,” Spider-Man said, holding up his hands. \nOh, if only the kid knew. \nSpider-Man drummed his fingers against his knee. “Okay, fine. If you can’t just walk up to him and tell him, ‘hey, man, I love you,’ then go big.”\n“What do you mean?”\nSpider-Man flapped a hand. “You know! Like in the movies! Do something grand. A big, grand gesture to show Cap how much you really love him.”\nA grand gesture. Really, there was only one grand gesture Bucky Barnes could do for Steve Rogers. Bucky stared blankly at his feet for a moment, then quirked a grin up at Spider-Man. It showed by the way his eyes crinkled at the corners.\n“Hey,” Bucky said. “Want to help me with something?”\nThe first problem Sam had with morning runs with Captain America was that even when he condescended to slow his breakneck pace for Sam, it was still way faster than Sam’s usual casual jog. Normally it wouldn’t be this hard to keep up with Steve’s leisurely trot, but Sam had gone into hibernation-mode this winter, and it was his first day back at it. The sky was gray and swollen, but the clouds were thick enough to trap in the heat and the rain wasn’t supposed to roll in until early afternoon. Which of course meant that his disgustingly cheerful best friend just had to drag him out of bed at the ass-crack of dawn and force him to exercise, the monster.\nThe second problem Sam had was that, because Sam had to push himself to keep up with Captain America, it meant he was too busy huffing and puffing to carry on a conversation. Normally this wasn’t that big of a deal, since as a rule Steve wasn’t a chatty runner. But the Winter Soldier had, apparently, given Steve socks, and Steve would not stop talking about them, and Sam didn’t have the breath to ask him to kindly shut the hell up.\n“—and I’m wearing them right now!” Steve said, hopping on one foot for several paces to show off his new and incredible sock.\n“Steve—” Sam gasped. “There are—few things—”\n“They’re really comfortable,” Steve said, dropping his foot back down, but then jumping on top of a bench in his joy. “I mean, I don’t really understand why he’d get me socks, but—”\n“There are few things—on this planet—that I care less about—” Sam wheezed, “than your—goddamn socks.”\nSteve looked terribly offended for a second. Then he smirked, springing off the bench to land easily beside Sam. “Oh, sorry. Need me to slow down? You look like you’re hurtin’ pretty bad.”\n“Oh someone—will be hurtin’—” Sam said, and then the Winter Soldier stepped directly into their path, hands on his hips. Surprised, Sam tripped over his own feet, let out a strangled, “—hhgack!” and would have fallen on his face if Steve hadn’t grabbed the back of his shirt and hauled him back up. “Man, do not do that.”\nThe Soldier ignored him, staring into Steve’s face with hard eyes that glittered with determination. Sam edged closer to Steve, in case he needed backup.\n“Soldier,” Steve beamed, lifting the bottom of his shirt to wipe away the sweat from his forehead. As if completely against his will, the Soldier’s eyes tracked down Steve’s stomach, over his abs, before snapping back up to his face. Sam would have thought it was deliberate if it were anyone but Steve. \n“I will go on a date with you,” the Soldier informed him.\nSteve getting flustered was an incredible sight. Sam had seen Steve run fifteen miles top speed under the boiling sun without the slightest flush, but now his skin pinked up and his eyes got really wide. On the other hand, the Soldier’s eyes were still scrunched with what appeared to be rage, but was probably more of an inability to properly translate normal human emotions, like nervousness. Man, these two were adorable. \n“You will? I mean, that’s wonderful! We can do dinner—or maybe not, since—” Steve waved helplessly at his own face. Then he dropped his hand and sighed like he was giving up on himself. “When?”\n“Now,” the Soldier said, then pivoted on his heel and began to walk imperiously away. \nSteve glanced between Sam and the Soldier, torn. And okay, that was rude as hell, but no one really should expect the Winter Soldier to follow normal human cues. Besides, Sam knew how Steve felt about the man, and he wasn’t about to get in the way of that. \n“What are you waiting for?” he asked, because he was a damn good friend.\nSteve beamed at him, then jogged after the Soldier. Sam watched them walk away, side by side, and smiled privately to himself. He popped his headphones back into his ears and started an easy jog back to the Tower, whistling along with Marvin Gaye’s version of How Sweet It Is (To Be Loved By You).\nThey walked in silence for several blocks before the Winter Soldier stopped in front of a nondescript storefront tucked between two competing dollar stores. Steve jammed his hands in his pockets, nervously waiting while the Soldier unlocked the door. He hoped he wasn’t underdressed for their date. \nTheir date. He was finally on a date with someone that made his heart skip and his skin hum with electric anticipation. Not that he had any idea what they were doing on their date, nor where the Soldier had taken him. He could already hear Natasha’s lecture about blindly trusting known killers, but it wasn’t as if Steve was going in completely defenseless. The serum had turned his entire fragile body into a weapon, after all.\nThe Soldier pushed open the door and stepped inside. Lights flickered on. Steve followed him into the large, open room, looking around. Mirrors lined the walls, reflecting a row of punching bags. Blue training mats covered ninety percent of the floor. The air was stale with the familiar smell of sweat and training equipment.\n“Take off your shoes,” the Soldier instructed. “Socks, too.”\nSteve dutifully toed off his shoes. He didn’t miss the way the Soldier glanced at his socks, nor how his eyes crinkled slightly when he recognized them. “What is this place?” Steve asked.\n“It’s a jiu-jitsu training studio.” The Soldier shrugged off his jacket and taking it to a wall of cubbies. He unraveled his scarf, revealing his mask underneath. The man clearly didn’t want to take any chances. Steve could respect that. The Soldier reached into one of the cubbies, pulling out several rolled up handwraps. “Here.” He tossed two to Steve.\n“How do you have access to this place?” Steve asked while he wrapped his hands, leaving the question, are we breaking and entering? unasked.\n“I helped the owner out, once,” the Soldier said, which didn’t quite answer his question. Steve didn’t push it. It wasn’t like they were going to steal anything—apparently, the Soldier’s idea of a good first date was to spar. Steve couldn’t find fault with it. He bounced on his heels in anticipation.\n“What—” Steve started to say after he tied off his wraps, but then the Soldier launched himself at Steve, punching him in the sternum with his metal fist. Even as the blow connected and he was knocked back, Steve could tell the Soldier had pulled his punch. It was still hard enough to send him skidding on his shoulder across the mats. \nThe Soldier walked casually up to the side of Steve’s head. His expression was wooden. “I am not a good person,” the Soldier said. \nSteve wrapped a hand around the Soldier’s ankle and yanked. The Soldier twisted, but Steve didn’t let go, and when the Soldier landed on his back, Steve rolled over and pinned his legs with his upper body. “Good is relative.”\nHe may have underestimated just how strong the Soldier was. The Soldier sat up, wrapped his hands around Steve’s side, and hauled him up over his head, following the movement up with a backward somersault over Steve’s chest. Before he could roll away, the Soldier was on him. Strong thighs bracketed his hips, and a cold, rigid arm pressed down against his neck—not hard enough to bruise, but enough to imply a certain threat.\n“Point,” the Soldier murmured.\n“Holy shit,” Steve said, going red. He took a moment to lie there, staring up at the studio’s unfinished ceiling and willing his body back under control. It was like he was twenty again, facing Bucky on the other side of the apartment, their furniture pushed against the walls to give them space to wrestle. Bucky had been a patient teacher, painstakingly going over each technique multiple times, although more often than not their wrestling matches would devolve into play fighting. Steve had never minded.\nThe Soldier lifted his arm, but didn’t get back to his feet. He searched Steve’s face, like he was desperate to find an answer there. “I am not a good person,” he repeated. “I have killed so many people. I was the tool that shaped the century—for HYDRA.”\nSteve’s eyes narrowed. He braced himself on the ground with his forearms, then pushed himself up, using the momentum to roll them over. “The funny thing about tools is they need to be wielded by someone else. You may have been the tool, but you weren’t behind the motive.”\nThen he grinned crookedly. “Point.”\nThe Soldier stared up at him, surprised. Then he shifted, got one leg between himself and Steve, and kicked him off. Since Steve didn’t go flying through the wall, he figured the Soldier was still practicing restraint. \nThey both got to their feet, watching each other warily. It had been a long time since Steve had sparred like this. He rocked back on the balls of his feet, shaking his hands out. He felt alive, skin buzzing with electricity and heat. It felt so good to fight with someone he could go hard with.\n“I still did it,” the Soldier said. “I killed men, women, children. Family pets. All without a shred of guilt.”\nThe Soldier feinted at him; Steve fell for it, flinching back from a blow that never came and getting surprised by the mid-waist tackle. They both went down, but this time Steve didn’t let the Soldier pin him. Instead, he wrenched the Soldier’s metal arm down and brought his own leg up, trapping the Soldier’s most dangerous weapon against the floor. It meant they pressed close together, the Soldier’s chest flush against Steve’s abdomen, his body tucked between Steve’s legs. Steve forced himself to focus on their conversation, trying to ignore how it felt to have the Soldier’s warm, strong body shoved against his own like this. \n“I worked for HYDRA, you know,” Steve said, panting slightly. “For years. I wasn’t brainwashed or tortured—I just didn’t know. It’s not the same, obviously, but if I blamed you for actions completely out of your control—well, that would be mighty hypocritical of me, wouldn’t it?” \nThe Soldier whacked him on the forehead with the heel of his free hand, which Steve thought was against the rules, and was also startling enough that he instinctively loosened his grip. The Soldier wrenched himself away. He sat back, breathing hard.\n“I could have broken the brainwashing earlier.” The Soldier’s eyes unfocused for a moment. “I think I did, a couple of times. I could have—”\n“You did,” Steve insisted. “You broke decades of conditioning. And then you spent the past five years actively destroying HYDRA bases.” Steve shrugged. “I think that’s a pretty good indicator of who you are.”\nThe Soldier pressed his hand against the front of his mask, like he wanted to cover his mouth. There was something wounded and slightly feral about his eyes. “Knowing everything I’ve done—you’re telling me you could still care for me?”\n“Yes,” Steve said, without hesitation. “Easily. I already do.”\nThe Soldier broke eye contact. He inhaled a shuddery breath and got to his feet. “Let’s go.”\nIf the Soldier had intended to take him somewhere else for their date, he was interrupted by the weather. The long winter was finally making way for spring, but slowly, and was putting up a fight. As soon as they left the studio, the clouds opened up. The Winter Soldier tipped his head back, blinking as fat raindrops fell against his cheeks.\nSteve was a little surprised when, wordlessly, the Soldier led Steve back to the Avengers Tower. He was even more surprised when the Soldier got into the elevator with him, dripping silently from the sudden torrential onslaught.\nSteve shoved his hands in his pockets to hide his fidgeting. This wasn’t weird. According to all those romance novels he’d studied, it was totally normal for sex to happen on a first date, especially considering how intimate they had been during their wrestling match, both physically and emotionally. It was just that—Steve was completely out of practice, had never had all that much practice to begin with.\nAt least the Soldier seemed nervous too. He didn’t fidget, but he had that thousand yard stare Natasha used to get when she was anticipating something, like her brain was scanning through every possible outcome.\n“Sooo,” Steve said.\nThe Soldier didn’t move his head, but his eyebrows furrowed slightly and he slid a look at Steve out of the corner of his eye.\n“Right, yeah,” Steve said, then raked his wet hair back. “It’s just that—I don’t want you to feel pressured into anything, and you know, we can go at your pace, or—”\n“Steve,” the Soldier said.\nSteve turned to him, mouth hanging open. The Soldier had never said his name before.\n“Shut up,” the Soldier said.\nSteve’s mouth clicked shut. He snorted. “Rude.”\nThe Soldier lowered his eyes, and even though Steve couldn’t see his entire face, he somehow knew the Soldier was amused. Warmth bloomed in his chest. Yeah, they would be alright.\nHe followed the Soldier out of the elevator and to his apartment door—which, okay, was a little weird, since as far as he knew, the Winter Soldier had never been there before. But then again, he was the Winter Soldier. He probably had the entire Tower canvassed. He did have to protest when the door opened for the Soldier without any complaint.\n“Hey,” he said. Even more alarming, the lights didn’t automatically turn on. The storm was raging outside, but that shouldn’t have affected the electricity in the Avengers Tower, since the building was entirely self-sufficient. Besides, they had just stepped off the elevator. Steve frowned, taking his phone from his back pocket, but his screen was blank. If there was some sort of breach in the Tower, Tony would have at least texted him.\n“FRIDAY?” he asked. She didn’t answer.\nIt was then Steve realized that his family room was filled with a warm glow, despite the lights not turning on. Frowning, Steve crossed his kitchen, then froze.\nLittle glass globes hung from his ceiling in varying lengths, glowing warm with tea lights, like dozens of golden bubbles. Steve walked into his family room, turning in a slow circle. \nThe Soldier stood in front of the large bay window overlooking the city, watching Steve with fathomless eyes. He’d draped his coat over the back of a kitchen chair and had finger-combed his wet hair away from his forehead. In the glow of the candlelight, limned in gold, he took Steve’s breath away.\n“Soldier?” Steve whispered, awed. “What is all of this?”\nThe Soldier’s shoulders lifted and fell again as he released a deep, shuddery breath. “Someone told me that you should do a grand gesture if you want to—if—” He’d started out strong, but then seemed to run out of words, hissing in frustration.\n“You don’t have to—” Steve said, knee-jerk.\nThe Soldier held out one hand, stopping him. “There was only one thing that I could think to do.” He hesitated for a long moment, then lifted his hands to his face. \nThe Soldier took off his mask.\nBucky Barnes set the mask on the coffee table. His hand trembled slightly, so he closed it into a fist, and brought it back to his side.\nSteve had gone so still that Bucky wasn’t even sure he was breathing. \n“Hi, Stevie,” Bucky said.\nSteve jolted like he’d been electrocuted. He staggered forward one step, before stopping again and shaking his head, his eyes impossibly wide, his mouth soft with shock. “Bucky?” \nBucky closed his eyes against the sudden tightness in his throat. It had been a long time since someone had called him by any name. \nDecades ago, Bucky had ziplined to a train that would eventually end in his death. Now his chest felt tight with the same fear and elation he’d felt from flying down that cable. He wanted to fling open the window, leap from the side of the building, and start running and never stop. \nInstead, he cleared his throat, swallowed thickly, and spoke.\n“For the longest time, I’ve spent my life just existing. If I felt anything at all, it was rage, or a need for revenge. But mostly I just operated like every day was a mission. And then you appeared, with your falafels and chocolate, and it was like—it was like coming back to life.” His lips quirked into a shaky smile. “If nothing else—thank you. For that.”\nSteve looked stricken, as if Bucky had punched him in the stomach with his metal fist and knocked all the air out of him.\n“And. I wanted to tell you that—I know—I know I’m not the man you were probably expecting, but—I love you. So much, and for so long,” Bucky said hoarsely, meeting Steve’s eyes. It was the bravest thing he had done in his entire long life. Steve blinked, dislodging a tear from wet eyelashes. “And I think we can—I think we can be happy together.”\nSteve staggered forward, wrapping one hand around Bucky’s wrist. He was shaking so hard that Bucky could feel the vibration in his own bones. Steve’s breaths seemed stuck in his chest, like back when they were just dumb kids and Steve would get an asthma attack from a strong wind. \n“Bucky?” Steve repeated, like the name was wrenched out of him.\n“Hey, punk,” Bucky said, and then Steve’s knees went out, and they both went down to the floor.\nSpider-Man slowly tiptoed across the ceiling on his hands and feet, the screens of his mask so wide the whites nearly took over his entire face. When the Winter Soldier and Captain America had come back thirty minutes early, he had done the most logical thing he could think to do: he sprang straight up and hid on the ceiling. Now he carefully avoided the webs he had painstakingly hung for the Soldier—for Bucky Barnes, oh my god, oh my god, Mr. Stark had neglected to mention that he would be playing matchmaker for Steve Rogers and Bucky Barnes.\nOnce he had crawled his way to the safety of the kitchen, he dropped to the ground on cat’s feet, landing on all fours. It took a moment for him to stand up, since his knees had been replaced by jello. \nHoly shit. Holy shit. Ned was never going to believe this.\nThey ended up sprawled on the family room floor, couch cushions tugged down for pillows, staring up at the golden baubles with stinging eyes. One of Steve’s hands was wrapped tightly around Bucky’s metal wrist, as if he were afraid to let go.\n“Huh,” Bucky said. Steve rolled his head toward him. “Didn’t think about the clean up.”\nSteve huffed a laugh, then swung himself over, draping half his body on top of Bucky. “Leave them.”\n“Kind of a fire hazard, too—”\n“Leave them.”\nThere was still so much to say, but for now Steve seemed content with soaking in Bucky’s presence. Bucky was completely fine with that. It had been too long since he had been touched. As the Soldier, he hadn’t even realized he missed it. Now that he had Steve pressed up against him, he’d saw off his other arm before he pushed him off.\n“Earlier,” Steve said, then cleared his throat. “Earlier, it sounded like you thought I’d be disappointed to find out who you were.”\n“Well,” Bucky said, fidgeting with the hem of Steve’s shirt. “Not disappointed, but—I mean—” He huffed an irritated sigh. “It’s always been you for me, but I know that you didn’t feel the same way about me. Back then.”\n“I knew your eyes.”\nBucky pressed his head back into the cushion to frown at the top of Steve’s head. “What?”\n“When I first saw you. As the Soldier. Don’t get me wrong,” he said, pushing himself up to stare earnestly down at Bucky. “You—Bucky, what you’ve done, how you’ve survived, you’re amazing, and I wasn’t lying when I told you that I care for you. But when I first saw you—I knew your eyes, and it was like getting sucker punched.” Steve brushed a lock of hair away from Bucky’s forehead, then traced his finger along the corner of his eye. “I love you, Bucky Barnes. Always have, always will.”\nBucky listened to the quiet patter of rain against the window; muted, because of Stark’s soundproofing, but not enough to block out everything, and nonexistent on the inside. He could hear the electric hum inside the walls, and the steady thudding of Steve’s slightly elevated heartbeat. For the first time in his entire life, a kind of quiet peace settled over him. \n“Buck?” Steve asked, slightly worried.\n“You’re such a punk,” said Bucky, and he leaned up on his elbows, and kissed him.\n \nEPILOGUE\nIt was a wonderful day. The sky was blue, the birds were singing, the air was clean like it only got after a good rain. Spring was the start of Murad’s busy season, and he was kept moving for most of the day by tourists and businessmen and women needing lunch or a mid afternoon pick-me-up. \nHe’d just handed some change back to a young blonde woman pushing a stroller when a man came up to his cart. Now, Murad had lived in New York his entire long life. He’d seen his share of roughs—been bullied by many of them, made friends with even more. This man, though. This man looked young, but felt old, and powerful, and bristled with defensive anger.\nMurad put on his friendliest smile. Kill with kindness, as the saying went. “How can I help you, young man?”\n“Here,” the man said, thrusting a red box at Murad so quickly he nearly smacked him on the nose. Chocolate, apparently, from Jacques Torres. Murad took it out of self preservation, and caught the envelope that had been resting on top of it before it slid to the ground. The man watched him steadily, with blank-eyed patience. Murad set the chocolates on a clean corner of his cart, then shucked the card out from its envelope. It was one of those motivational thank you cards, with watercolor flowers painted at the corners. Murad’s eyebrows shot up. He opened the card, but there was nothing written inside.\nWhy did this angry man with murderous eyes want to thank him? Murad glanced at him, confused, but the man just waited, as if he expected something in return.\n“Um, you’re welcome?” said Murad.\nApparently, this was the right thing to say. The man nodded curtly, even managing a small, tight smile.\nAs the man left him, Murad glanced down at the box of chocolates sitting on his cart. The plastic seal appeared unbroken, which meant they shouldn’t be poisoned.\n“Hey!” someone called, drawing Murad’s attention. Captain Rogers bounded up to the angry man, slinging an arm over his shoulders. “Did you finish what you needed to do?”\nThe man smiled warmly up at Captain Rogers. It changed his entire face, stripped years away, made him young and in love. “Yeah,” he said, sliding his metal arm around Captain Rogers’ waist.\n“Ohhhh,” Murad said, as comprehension dawned. Grinning to himself, he pulled the plastic wrap from the box and popped a piece of chocolate into his mouth, satisfied with a job well done. \nIt was a wonderful day."
}