{
    "id": "17221628",
    "url": "https://archiveofourown.org/works/17221628?view_full_work=true",
    "author": [
        "Origamidragons"
    ],
    "title": "rock'n'roll, buckaroo!",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Kaminari Denki & Todoroki Shouto"
    ],
    "characters": [
        "Todoroki Shouto",
        "Kaminari Denki",
        "Jirou Kyouka",
        "Midoriya Izuku",
        "Pro Heroes (My Hero Academia)",
        "My Hero Academia Ensemble"
    ],
    "additional_tags": [
        "Social Media",
        "YouTube",
        "POV Outsider",
        "Based On Buzzfeed Unsolved",
        "how is that a real tag",
        "Fluff",
        "Humor",
        "Class 1-A Shenanigans (My Hero Academia)",
        "Class 1-A as Family (My Hero Academia)",
        "Secret Santa",
        "Conspiracy Theories",
        "Shinsou Hitoshi is in Class 1-A"
    ],
    "language": "English",
    "series": "Part 1 of that one catastrophe bnha youtube/buzzfeed au",
    "published": "2018-12-30",
    "completed": "2019-03-11",
    "words": "6,491",
    "chapters": "2/2",
    "comments": "833",
    "kudos": "25,060",
    "bookmarks": "5,769",
    "hits": "200,161",
    "summary": "<p>Kaminari walks up to Todoroki in the hallway after class and says, “Dude, I need your help.”</p>\n<p>Todoroki checks over his shoulder, twice, to verify that Kaminari is indeed talking to him. “Why?”</p>\n<p>“Yesterday you asked Shinsou-kun if he was Aizawa-sensei’s son,” Kaminari says, as though that explains anything at all.</p>\n<p>“...yes?”</p>\n<p>“Make a hero conspiracy YouTube channel with me.”</p>",
    "notes": "<p>For FeferiSushi! Prompt was “Kaminari and Todoroki friendship. Preferably them doing something like Buzzfeed Unsolved, or Kaminari inviting Todoroki to play video games with him. I love this friendship.”</p>\n<p>My brain just grabbed the ‘Buzzfeed Unsolved’ part of that prompt and absolutely ran with it, whoops. So merry Christmas, hope you enjoy, Fef!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>- holy shit i wasnt expecting people to like this uHHH SEQUEL IN THE WORKS</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>this is.... maybe the end? there might be more. I absolutely was not anticipating how huge this got, thank you so much for the comments and kudos, I love you all &lt;3</p>\n<p>(the discord server is fake by the way, its a fake link. though a lot of people have expressed interest in joining so like... who knows?)</p>",
    "text": "\nhang on, hang on, i don’t think it’s recording yet!\n\n\ndidn’t you turn it on before we sat down?\n\nI did!! it’s just, fancy cameras are hard to work!\njirou! hey, jirou! Can you help us out with- oh\nwell, now i feel like a dumbass\n\nyou are a dumbass. you didn’t check the lens cap?\n\n\nyou didn’t notice it either!\n(thanks jirou you’re the best i don’t know what i’d do without you.)\n\n\ndie, probably\n\nuncalled for\nbut also! not wrong\nanyways, we ready?\n\nyeah\ni’ve got all my notes\n\n\naaaaaand…. action!!\n\n---\nIt starts, as do many of the more interesting episodes of class 1-A’s dorm life, with Kaminari getting an Idea. Now, the collateral damage of said ideas is ordinarily borne by Kirishima, Sero, and Mina, because they’re Kaminari’s best friends and generally willing at any time to throw themselves headfirst into any and all dangerous, harebrained shenanigans.\nThis time, however, is different.\nThis time, Kaminari walks up to Todoroki in the hallway after class and says, “Dude, I need your help.”\nTodoroki checks over his shoulder, twice, to verify that Kaminari is indeed talking to him. “Why?”\n“Yesterday you asked Shinsou-kun if he was Aizawa-sensei’s son,” Kaminari says, as though that explains anything at all.\n“...yes?”\n“Make a hero conspiracy YouTube channel with me.”\nTodoroki blinks. Then he blinks again. When he opens his eyes, Kaminari is still standing there and his smile hasn’t given an inch.\n“I’m sorry, what.”\nKaminari shrugs casually, rubbing the back of his neck. “You just seem like you’re into that kind of thing! And I think it’d be fun! So what do ya say?”\nTodoroki is silent for a long moment, until Kaminari starts to fidget slightly. Then he nods, once, and says, “Yeah, sure.”\nKaminari fist-pumps. “Hell yeah! You’re not gonna regret this, dude. Come on, I need to tell you some ideas I’ve got.”\nTodoroki, still not entirely sure what’s happening, follows.\n“So, I was thinking for our first episode we could do one of the top ten! That’d net us more attention, and everybody already knows who they are anyways. Uh, probably not Endeavor. But like, Best Jeanist? He’s pretty weird. I think maybe he’s got a mustache, and that’s why his turtleneck is pulled up all the way past his nose. Then when he’s out of costume, people won’t recognize him. I bet it’s a bad mustache, too.”\n“Hm,” Todoroki says when Kaminari pauses for breath. “What makes you sure he has a mouth at all?”\nKaminari slowly turns to look at him, and whispers to himself, slightly awed, “This was the best idea ever.”\n---\nThe borrowed camera switches on, focusing on two boys sitting on a couch. The one on the left is blonde-haired and practically bouncing with excitement, while the other has mismatched eyes, a stoic expression, and a jumble of papers on his lap.\n\nhey! hello! i’m kaminari!\n\n\ni’m todoroki\n\nand this is the first episode of hero theory!!!\nthe way it works is basically, my hella smart friend here will explain some wild theories about the pro heroes we all love and look up to\nand i’ll react and like chime in and stuff!\n\nsuddenly it sounds like i’m doing more work here\n\n\ntoo late! you already agreed to this\n\n\ni did and that was my mistake\nalright, so today we’re talking-\n\n\ntheorizing!\nmakes us sound smarter\n\n\nTHEORIZING about the current number three hero, Best Jeanist, and what exactly is under his… neck. turtleneck.\n\n\njurtleneck\n\n\nno\n\n---\nThey post the first video the same day they film it, with minimal editing because neither of them really knows how to do that. Kaminari holds up a hand for a high five, which Todoroki returns with some hesitation and a few moments of confused squinting, and then they press the upload button together.\nThey don’t really expect much.\nWhen he wakes up the next morning, Todoroki’s email inbox is full of comments and subscription notifications. Not an overwhelming number, but far more than the amount he had expected (which was zero).\n---\nHero Theory Episode 1: What Does Best Jeanist Really Look Like?\n1,034 views\nComments • 21\nMico Nico\nHoly shit these kids are hilarious\nSketching\nisn’t that endeavor’s son?? from the sports festival? i didn’t know he could look excited\nTara Wonder\nOk but THEYRE NOT WRONG how do we KNOW he has a mouth\nAll Star\nmeh, production quality’s crap but the idea’s solid\nPaxxxton\nim lmao @ todoroki’s face every time kaminari calls jeanist’s hero costume ‘the jostume’\n---\nTodoroki is just finishing rereading the comments for the third time when Kaminari’s practically breaking down his door, yelling in incoherent excitement. Todoroki lets him in before he can wake up Bakugou next door and cause an incident, and they go over the comments together, making note of the criticisms. They’re both smiling, Kaminari huge and bright and Todoroki small and proud.\nTodoroki starts writing actual scripts, outlining the episode so he doesn’t get distracted or lose his place. Kaminari visits Present Mic after class to ask for lessons in video editing. Jirou commandeers her camera back to film for them, and starts teaching them about lens options and audio settings.\nThe next day, Aizawa-sensei is collecting worksheets when he blinks down at the back of one, seemingly nonplussed, and says, “Todoroki.”\nTodoroki looks up.\n“What’s this list on the back of your homework?”\n“Brainstorming,” Todoroki says.\n“For what?”\nTodoroki doesn’t miss a beat. “An extracurricular project.”\n“What kind of extracurricular project would produce the words ‘Mount Lady is actually giant and her quirk is shrinking down to normal size?’” Aizawa-sensei asks, his voice totally flat.\n“Oh, dude, that’s a great one!” Kaminari exclaims, drawing the attention of the classroom. “We should do that next. Hang on, what else is on there?”\nAnd that’s how the rest of Class 1-A finds out about the project.\n---\n\nso, if she’s actually huge\nwould she get big again if she had quirk restraints on then? or her quirk was cancelled somehow?\n\n\nthat would depend on whether her quirk is active when she’s small\nlike, is she constantly using it to stay that size or does she just use it once to shrink\n\n\noh probably the second one! right? cause otherwise how would she sleep?\n\n\nin a… really big house? \n\n…\n\nwait, don-\n\n\nHEY AIZAWA-SENSEI!! CAN YOU HELP US TEST A THEORY?\n\n\nwe’re going to die\n\n---\norigamidragons posted\nokay so hero theory is a great show just in general but my favorite part of it is the confirmation that todoroki shouto is not in fact that stoic badass we all thought he was after the sports festival and is instead a gIGANTIC NERD\n108 notes #hero theory #person: todoroki shouto\n---\nOne by one, a few of their other classmates get roped into the production. Other then Jirou, who’s settled into her role as their camerawoman, there’s also Midoriya, whose encyclopedic knowledge of heroes and quirks makes him a common guest expert; Yaoyorozu and Iida, who are always willing to help with research; and Hagakure, who’s happy to be equipped with a Go-Pro and set to work trying to get evidence for various theories.\nMost of the rest of class 1-A makes at least an appearance or two, be it by crossing through the background to get leftovers from the fridge and scowling at the camera (Bakugou) or belly-flopping onto the couch between the two hosts to insert their own opinion (Mina, frequently).\nAnd slowly, steadily, their subscriber count begins to grow. As word gets around about the series and it increases in quality and popularity, they start getting more views, more likes, more comments. Some of them are trolls or spam, but the vast majority are genuine praise.\nTodoroki’s not exactly sure just how it happens, but before long he’s the writer and co-host for one of the fastest-growing new shows on YouTube. He’s also suddenly friends with Kaminari, and he’s not quite sure how that happened, either.\nBut he’s definitely not complaining.\n---\nHero Theory Episode 9: What Species is UA’s Principal Nedzu?\n41,567 views\nComments • 291\nPterror\nokay but did you see that wink at the go pro at 5:66? nedzu definitely knew they were filming him im Afraid\nTake On Me\nI love how they say Midoriya’s a guest star but really Todoroki just drags him over to the couch, gives him a topic and just lets him run.\nFree Bird\nI think he’s a rat? A really big rat? I don’t know what kaminari’s on but that is DEFINITELY not a bear\nYuki Nora\nfdgsjgdhdj koda’s face when they ask if his quirk works on nedzu WHAT DOES HE KNOW\n---\nThe show makes Endeavor furious, which of course is only another reason to not just continue it but continue to improve it. He calls Todoroki one day to rant about how the ‘ridiculous’ videos are damaging his reputation and preventing people from taking him seriously.\nTodoroki plays the entire four-minute message on speakerphone, stone-faced, in the credits to episode fourteen as Kaminari absolutely loses it laughing next to him.\n---\neverywhereilook reblogged from kingofthegarbagehill\nGif: Todoroki explaining a theory very seriously to the camera while Kaminari reacts with exaggerated expressions of shock next to him.\nGif: Sero, not noticing the camera, walks directly into the shot and starts searching for the TV remote under the couch cushion that Todoroki is sitting on.\nGif: Kaminari acting out a theoretical fight scene, complete with sound affects and a lightsaber substituting for a sword.\nGif: Selfie-cam style footage with Todoroki staring flatly into the camera in the foreground. In the background, Kaminari can be seen trying to get an explanation from Aizawa as to why his hair floats.\nGif: Midoriya, sitting between Todoroki and Kaminari on the couch, sketches out a diagram in a notebook while muttering to himself, then holds it up to the camera.\nGif: Kaminari and Todoroki sitting on the couch, ready to film. A hand appears in the shot from behind the camera, someone counting down on their fingers: three, two, one.\n451 notes #hero theory #gifset #gif warning #class 1-a content\n---\n\nhey guys! i’m kaminari\n\n\nand i’m todoroki\n\n\nand this is episode fifteen of hero theory! \n\ntoday we’re going to be theorizing about the ghost hero, ectoplasm.\nfor some background, ectoplasm’s hero costume consists of a long sleeveless trenchcoat-slash-cloak, and he does all his fighting exclusively with his legs\nthis has led some people-\n\npretty sure it’s just us, dude\n\n\n-to wonder if he has arms at all\n\n\nwe couldn’t find any pictures or anything confirming either way, so we decided we’d try and find out ourselves!\nwish us luck!\n\n\ni want it on record that I think this is a terrible idea \n\nThe screen switches to a shaky, hand-held found-footage camera feed. Ectoplasm is visible in center of the shot, clearly unaware of the students’ presence. The camera pans slightly to one side to show Todoroki, who activates his quirk to create a snowball in his right hand.\n“Ready?” Kaminari whispers from behind the camera. Todoroki nods once, expression tight. Kaminari yells, “THINK FAST!” as Todoroki throws the snowball, aiming directly at Ectoplasm’s head.\nEctoplasm’s head jerks up at the shout and he launches himself into a leap, spinning around in midair and smashing the snowball to power with one peg leg. Kaminari makes a strangled sound as the teacher, clearly annoyed and lightly dusted with snow, glares directly at the camera. He grabs Todoroki’s arm and starts backing down the hallway.\n“Abort mission, abort mission, run run run run-“\nThe footage ends there, switching back to the familiar sight of the two boys on the couch, obviously filmed on a later date than the first segment.\n\ni told you it wouldn’t work\n\n\nit was worth a try!!\n\n\nwas it worth the week of lunch detention?\n\n\nabsolutely, dude. \n\n---\nAmilie Red @houseofarms\nthe real reason todoroki and kaminari from hero theory r so good at their job: their homeroom teacher is a certified cryptid\nShalyssa @itsyagirllyssa\nyaoyorozu appearing in the latest episode of hero theory solely to roast uwabami for being anti-feminist cleared my skin, watered my crops,\nFive Plastic Dinosaurs @katitulips\ni relate to todoroki shouto bc i too am an antisocial mess constantly being dragged into dumb shit by an extroverted friend\n---\nThe idea for episode twenty comes, of all places, from Midoriya. He catches Todoroki’s attention one day during lunch, and says, “Have you ever thought about researching any older heroes for your show? Like from the Silver Age?”\n“No,” Todoroki admits. His knowledge of heroes is extensive, but it’s limited to those that are currently active or very recently retired. Endeavor never saw any use in teaching him about dead or long-retired heroes who would never pose a threat to him, which means he barely knows anything about any heroes from before the time of All Might beyond what’s taught in history class. “It’s a good idea, though. Do you have one in mind?”\nAnd Midoriya says, without a moment of hesitation, “Nana Shimura.”\nIt’s harder to research than the other episodes, even with Midoriya’s pre-existing knowledge to draw from. Nana Shimura is from before heroes were widely monitored and registered, so most information about her is vague, but Todoroki recruits Yaoyorozu to help him and Midoriya search, and little by little they build a story.\nIt’s quite a story.\n---\n\nhey hey guys! as you all know, i’m kaminari\n\n\nand i’m todoroki\n\nand this is episode 20- holy shit- of hero theory!!\nwe’ve got a surprise for you guys today! a deep dive into the age of heroes past!\ntodoroki, you wanna explain?\nright. today we’re talking about a lesser-known heroine from the silver age\nit’s important to learn not just about the heroes who are active today, but also those that came before\nso today we’re telling you the story of a woman named nana shimura, hero name adamant\n\nhell yeah!! and let me tell you guys, this lady was a certified, grade a badass\nshe could beat me up and i wouldn’t even be mad\n\n\nlots of people could beat you up, though\ndidn’t ojiro kick your ass in training this morning?\n\n\ndon’t expose me like this, dude\n\n\nit’s what i’m here for\n\n\nyeah i know\nANYWAYS!! Tell us about adamant!\n\n\nright. so, adamant first emerged as a hero around the middle of the silver age\n\n---\nHero Theory Episode 20: Who Was Nana Shimura?\n231,239 views\nComments • 1,012\nKono Pisces\nThis was a really cool episode! I know it was a departure for you guys, but it’s actually my favorite so far.\nCleopatra\nshE PUNCHED OUT MATTERHORN?? THAT GUY WAS HUGE??\nAb3see\nwow thanks I’m crying ;-;;;\nWesterling Pride\nhow have i never heard of her? man suddenly i really want to read up on the silver age\n(*^o^*)\nHey petition to add this lady posthumously to the memorial for heroes died in the line of duty!\n---\nThe day after the video on Nana Shimura goes up, All Might walks up to Todoroki and Kaminari in the hallway and drags them both into a tight hug, muttering thank yous. After a long beat of silence, Todoroki, very slowly and uncertainly, hugs him back.\nHe might not be able to understand just what he’s being thanked for, but he can tell it’s something important.\nIf All Might’s rake-thin shoulders are shuddering, Todoroki doesn’t mention it.\n---\n\nso normally, we’re always talking about heroes on this show, right?\n\n\nyes, it is called ‘hero theory,’ kaminari\n\nright! so today, we’re taking a break from all that!\ninstead, we’re going to be theorizing on the other side of the law! the villains!\ntake it away, todoroki\n\nso stain was wrong and people who idolize him are terrible\nhere’s why\n\n\nheck yeah, man, spill that tea\n\n\ni have no idea what that means\n\n---\nJosephine Johnson @jojojojo\nmy aesthetic is todoroki shouto completely dismantling stain’s fucked-up ideology while kaminari cheers him on\nHitsumi Tatsuya @burnboiburn\nMusutafu Tonight Whomst? I only know Hero Theory\nEmpty Bitch @lulupeir\n@chargebolt why doesn’t todoroki have a twitter how else am I supposed to roast him for his conclusions\nKaminari Denki @chargebolt\n@lulupeir dude dm me your roasts and ill read them out loud to him in the next episode\nEmpty Bitch @lulupeir\n@chargebolt isn’t the hero we need but he’s the one we deserve\n---\nIt gives Todoroki an idea, seeing the impact that the Adamant episode has. He has to spend a while thinking about it, making sure it’s what he wants to do. Talks to Midoriya, and All Might, and Fuyumi and Natsuo.\nThen he tells Kaminari he wants to do an episode on Endeavor. And through halting words, he tells him why.\n---\nHero Theory Episode 23: The Truth About Endeavor?\n432,765 views\nComments • 3,283\nRazzmatazz\nholy fuck\nMira Ramone\nis this for real? if this is a publicity thing, it’s really tasteless.\nZevvon\nThe part at 10:51 where Kaminari puts his hand on Todoroki’s shoulder? My HEART\nTerabyte Tim\ntodoroki sounds so… off. i want to give him a hug???\nReimi \nDID KAMINARI REALLY CALL THE NUMBER ONE HERO A BURNED CHICKEN NUGGET WE STAN ONE ICON\n---\nFrom behind the camera, Jirou counts them down with hand signals: three, two, one, go. As soon as she hits the last, Kaminari breaks out into a beaming grin. “Hey guys! So, Hero Theory is going to be a little different today. There was a lot of demand on it for Twitter, especially after the last episode, so we’re doing a Q&amp;A thing to celebrate hitting a hundred thousand subscribers!”\nTodoroki nods. He looks a little more downcast and anxious than he usually does, not quite making eye contact with the camera.\n“If you have a question, remember to submit it on Twitter under the hashtag #HTQA! Asshole questions will be smited with the fury of a thousand suns and one point three million volts!”\n“Smote.”\n“Huh?”\n“Past tense of smite is smote,” Todoroki clarifies.\n“Okay, then asshole questions will be smote. Let’s get this started!” Kaminari pulls out his phone and starts scrolling through the tag. “First question! One I’ve been asking for ages. Todoroki. Dude. Why don’t you have a Twitter yet?”\n“I don’t need one,” Todoroki says, like it’s obvious.\n“I’ve been trying,” Kaminari confides in an aside to the camera. “Dude’s intent on being a social media ghost. Second question: ‘are you two dating?’ Tragically, no. He’s hot, and I know, anybody would be lucky to have me, but Todoroki’s already got a cru-”\nThe last word is abruptly cut off into a stifled yell when he takes a couch pillow hard to the face. Todoroki, holding the pillow over Kaminari’s mouth with one hand, steals his phone with the other and scrolls through the next few questions while ignoring his co-host’s muffled complaints.\n“‘Will you ever do theories on your classmates?’” he reads. “Maybe, but probably not. We already know them very well, and the hero license exam revealed that we place ourselves at a disadvantage if we release too much information about ourselves.” He scrolls down to the next question, and reads it silently with raised eyebrows before staring flatly into the camera. \"Keep your questions appropriate.\"\nKaminari finally succeeds in shoving free of the pillow a few questions later, and seizes his phone back, settling into his seat again. “‘Where did the idea for the Adamant episode come from?’ I actually don’t know. Todoroki?”\n“That one was Midoriya’s idea. Apparently he was a big fan of hers and wanted her to get more recognition.”\n“Nice. ‘Who’s your cameraman?’ Camerawoman, actually. Say hi, Jirou!”\n“Hey,” Jirou says, sounding bemused. A hand wearing chipped black nail polish appears in the shot, flashing a peace sign at the audience. Todoroki gives her a thumbs up.\n“‘Question for both of you,’” Kaminari continues. “‘which episode was your favorite?’ Oh, uh, I was really proud of the Thirteen episode. We had a whole ton of nonbinary folks commenting to tell us they were happy with the way we handled all the theorizing about their gender! That was great!”\n“The Adamant episode was mine,” Todoroki says. “It was harder to research, but it felt good to see a less glorified hero get the recognition she deserved.” He pauses, then adds, “Personally, though, I got the most satisfaction out of the Endeavor episode.”\nKaminari grins at that, before moving on to the next question. “‘Why don’t you guys have a Discord server?’ We should absolutely have a Discord server. That’s such a good idea. I’m making one as soon as we’re done with this.”\n“Next question! This one’s for Todoroki too. Let me know if you’re not comfortable answering this, dude. ‘Why’d you decide to make the Endeavor episode?’”\nTodoroki is quiet for a long moment before he answers, measuring his words. “Because… it’s important that people understand what sort of person he is. Even if he’s trying to be better now, and do better.” He shrugs a little. “After the Adamant episode proved that our show could actually have an impact, it just felt right.”\n“Good answer, dude,” Kaminari says. “‘How did you get the idea to start this show?’ This one I can answer. Okay, so one of our classmates, Shinsou, you guys know him, he showed up in one of our episodes when we were talking about, uh…”\n“Negative quirk stigma,” Todoroki says.\n“Right, that. So he’s got kind of crazy hair and looks tired all the time, and Aizawa-sensei has crazy hair and looks tired all the time, so on the first day after Shinsou joined our class-“\n“Is this necessary?”\n“Yep!” Kaminari answers, sounding absolutely delighted. “On the first day after Shinsou joined our class, Todoroki walked up to him and asked him, to his face, if he was secretly Aizawa-sensei’s secret love child.”\n“It wasn’t that unreasonable,” Todoroki mutters, looking away from the camera. “Aizawa-sensei was privately training him to get him into the hero course, and gave him a version of his capture weapon too.”\n“So I saw this go down, and my immediate thought was, of course, dude, that guy would be a perfect co-host for a show about hero conspiracy theories.” Kaminari grinned widely, and hooked an arm around Todoroki’s shoulders, pulling him into a one-armed hug. “And look, I was right!”\n---\n“Are you okay, man?” Kaminari asks, after they finish filming. He sounds uncharacteristically cautious when he says it.\nTodoroki has to think about it for a moment. He nods. “Yeah, I think I am.”\nWhen Kaminari holds his hand up for a high five this time, Todoroki doesn’t hesitate.\n\nhey hey everybody! kaminari here!\n\n\nand i’m todoroki\n\n\nand this is episode 25 of hero theory! lucky number 25!\n\n\nthat’s not a thing\n\n\nsure it is\n\n\n25’s not lucky\n\n\nhow do you KNOW, though\n\n\nit’s just not? Numbers aren’t just lucky cause you say they are\n anyways-\n\n\nare you an expert in which numbers are lucky and which ones arent\n\n\nANYWAYS\n today we’re talking about the famous vigilante popstar, pop step\n\n\nyou mean pop☆step!!\n\n\nhow did you pronounce that out loud\n\n---\nCap Addy @bowieb1\ni hope todoroki shouto knows i would die for him. i mean, he could kill me with one hand, but still. i would Die for him.\nKaminari Denki @chargebolt\n@bowieb1 i read this to him and he said “please don’t” with a completely straight face dude is unreal\nHitsumi Tatsuya @burnboiburn\nhero theory is like half conspiracy theories, half insane sitcom with a cast of 20 and im so here for it\n ---\nThe suggestion sheet is- well, really it’s Todoroki’s idea, but Mina’s fault. Once the show explodes in popularity, she and Sero develop a habit of ambushing Todoroki to suggest ideas. After the third time Todoroki very nearly sets them on fire, he gives up and yanks a piece of tape from Sero’s elbow to stick a sheet of notebook paper to their classroom wall.\nFor a time, the suggestion sheet serves as an anonymous idea dump for anybody in Class 1-A. Sooner or later, however, knowledge of it spreads to the rest of UA’s student body.\n'Why Class 1-B is definitively better than the 1-A idiots' has shown up more than once, so Monoma, at least, definitely knows about it.\nMost of the ideas on the sheet are usually nonsense even by the show’s spectacularly low standards, but Todoroki makes a point of checking the sheet every day after class regardless. Sometimes they have potential.\nWhen he checks the list on Thursday, this is what it says:\n“Huh,” Todoroki says.\n ---\nHero Theory Episode 26: Why Is UA’s Class 1B Better Than Class 1A?\n201,294 views\nComments • 1,032\nLemonlion\ndid i\ndid i seriously just get rickrolled in the year of our lord 2197\nFacepalm\nit really does loop for the whole twenty-six minutes if you were wondering\nジヨリン\nI’m not sure if I want to high five Kaminari or punch him in the face\n ---\n“We need to get Bakugou on the show more, man,” Kaminari declares with no prelude, kicking Todoroki’s door down and tossing himself onto his bed. Todoroki, who is not entirely sure when he got used to this, has already relocated to the end of the bed to avoid impact.\n“Why,” Todoroki says flatly after a moment. “All he does is yell. And try to blow up the camera. And us.”\n“He’s a crowd-pleaser! The people love him!” Kaminari protests.\n“Why?” Todoroki repeats, lost.\n“Hell if I know,” Kaminari says with a shrug. “But it doesn’t matter, dude! Giving the people what they want is an important part of showbiz! Even when what they want is a walking landmine throwing a perpetual tantrum!”\n ---\n\nhey hey awesome people! i’m kaminari\n\n\nand I’m todoroki\n\n\nand this is episode 28 of hero theory\n but before we get started, i just gotta say\n midoriya. bro. I am sorry\n this was NOT MY IDEA\n\n ---\nHero Theory Episode 28: Is Midoriya Izuku All Might’s Secret Love Child?\n311,382 views\nComments • 1,678\nKKun\nkaminari laughed so hard he electrocuted the couch omg\nゆうゆう\nbest part starts at 11:56 that’s a really impressive flying tackle on midoriya’s part\nRyuno Ji\nWATCH TO THE END OF THE CREDITS\nIIDA LOOKS LIKE HES HAVING A HEART ATTACK WHEN HE SEES THE COUCH\nMimi Marks\nTodoroki is so SERIOUS I’m DYING\nNamija\nCan’t figure out if the ‘technical difficulties’ like twelve mins in are because Todoroki and Midoriya knocked the camera over or if the girl filming just couldn’t stop laughing\n ---\nLili Lao @girlsfromvenus\nyou ever think abt how even tho he’s constantly explaining shit and violating other peoples privacy we don’t know shit abt todoroki (1/3)\nLili Lao @girlsfromvenus\nlike ik ik he’s endeavor’s son and has a stupid op quirk but like?? no social media?? never pics of him in the tabloids?? who is he??? (2/3)\nLili Lao @girlsfromvenus\nconclusion: todoroki shouto theorizes abt other heroes to distract from the true hero cryptid, which is him. in this essay i will (3/3)\n ---\n\nhey hey!! i’m kaminari!\n\n\nand i’m todoroki\n\n\nand this is-\n\n\nstupid\n\n\ncome on man, don’t be like that!\n we had a deal!! and I almost got my face punched in by midoriya keeping my end\n soooo suck it up\n\n\nfine\n\n\nANYWAYS! this is episode 29 of hero theory!\n\n\ntoday we’re talking about\n (sigh)\n ‘why dabi is endeavor’s secret son’\n why are you making me do this\n\n\nit’s funny??\n\n\nit’s stupid\n\n\nbro i dunno how to tell you this\n this isn’t even CLOSE to being the stupidest thing you’ve said with a straight face on this show\n\n\nfine\n but i want it on the record that I think this is dumb\n\n ---\nA response video goes up twelve hours after the Dabi episode is uploaded, at four in the morning. By the time Kaminari wakes up and learns about it, it’s already been taken down twice, re-uploaded by various accounts four times, and racked up hundreds of thousands of views.\nHis immediate impulse, of course, is to drag Todoroki out of bed and set up a camera to film a response.\n ---\n\ni’m kaminari!!\n\n\nand i’m todoroki\n are you going to tell me what this is about now?\n\n\nyep!\n you might have noticed that this isn’t part of our standard upload schedule!\n And that’s because we’re trying something different this time!\n This’ll be a reaction video\n somebody uploaded a response video to our last episode and it’s absolutely blown up online\n it’s been taken down like three times for some reason but just keeps getting reuploaded!\n so neither of us have seen this yet!\n\n\n...this is what you woke me up at seven am on a saturday for?\n\n\nahaha... ha… yeah…\n ANYWAYS let’s start the video now!\n\n ---\n\nThe video is grainy, obviously filmed someplace with bad lighting on a shaky, handheld phone camera. The phone is held vertically, so the view is narrow. Nonetheless, the trademark scars and staples of the villain Dabi were clearly visible. The start of the video had caught Dabi mid-rant, and cackling, wheezing laughter was audible in the background.\n\n\n“I’m going to kill that brat,” Dabi seethed. “I swear I am.”\n\n\nA girl’s voice cooed from behind the phone. “Awwww, Touya-chan, don’t be like that!”\n\n\n“I am going to set you on fire,” Dabi ground out, jabbing a finger at the phone. “Then I’m going to set him on fire. And then you,” he snapped at someone offscreen, “if you don’t stop FUCKING LAUGHING!”\n\n\nThe laughter did not stop. Blue sparks were falling from Dabi’s fingertips and he looked about two seconds from a conniption.\n\n\n“Naaaaah,” the girl said. “You won’t. You looove us.”\n\n\n“Don’t test me,” Dabi snarled. “Fuckin’ Shouto… When I finally off the old man, he’s not allowed to bitch about it. It’s his fault I have to deal with all of THIS now. Fuck this. Fuck everything. I need to go burn something.”\n\n\nHe stormed out of frame, and a few seconds later a door could be heard slamming. There was a pause, then a rustling sound, and the video flipped around to show Himiko Toga’s sickly golden eyes, flushed cheeks, and wide, mischievous smile.\n\n\n“You’re welcome, Denki-kun, Shouto-kun!” she said with a wink. “For the record, I don’t think Best Jeanist has a mouth either.” She brandished a knife in front of the camera. “But I hope I can find out someday!”\n\n\nShe blew a kiss to the camera, and then the footage ended.\n\n ---\n\n...\n\n\n...uh. huh. that was...\n you okay there, dude?\n Todoroki?\n oh shiiiit jirou get the fire extinguisher-\n\n ---\n“Hey, Todoroki?” Kaminari tries, rapping his fist against the door. The wood feels cold beneath his knuckles, which is a good sign, because it means that Todoroki probably hasn’t set anything else on fire. “You in there?”\n“Yes.”\n“We, uh, put the fire out. In case you were wondering. The couch is a little charred, but it’s still not as bad as the time Bakugou and Kirishima tried to have a horror movie marathon.”\nHe’s rewarded by a soft huff of bemused laughter from the door, and surreptitiously fist-pumps in triumph before sobering again. “Dude… I’m sorry. This is my fault, I know you didn’t want to do the episode, and now it’s stirred up all this shit.”\n“It’s not,” Todoroki starts, then stops, then starts again, “I’m- not angry. Really. I just… need to call my sister before she sees that on her own.”\n“Oh, right, shit, yeah. You should do that. I just needed to ask, are you cool with me uploading the reaction video? I won’t if you don’t want me to.”\nThere’s a long pause.\n“No, upload it.” There’s a hint of a smirk in his voice when Todoroki adds, “The comments will be amazing.”\n“Dude, you are so right.”\nHe’s right. The comments are amazing.\n ---\nThe Prez @PresidentKamina\nso uh we gonna talk about how hero theory just Did That\nKuroyuki no Ryu @KYnR\nEventually I feel like the school’s gonna stop paying for new couches for 1-a’s dorm, isn’t this like the second one in two weeks?\nLoulou❤️ @pickmeup\n@KYnR for a school that can afford as many giant killer robots as ua can id like to think they can spring for replacement couches\nMeme-chan @himecut\nwish I could deal with all unpleasant emotional reveals by setting the nearest thing on fire\nおにでりあ @onydalia\ni know we’re all flailing right now but can we consider hero theory being right about one absurd thing means that aLL THEIR OTHER RIDICULOUS THEORIES MAY ALSO BE TRUE\nSar C @sacchari\nthe fact that dabi is confirmed to be touya combined with that older episode about endeavor paints... a really unsettling picture\nJHR @number47\n@sacchari oh fuck oh fuck you’re right I didn’t even think of that\n ---\n\nhey hey everybody! kaminari here\n\n\nand i’m todoroki\n\n\nback from our unexpected two week hiatus!\n sorry about that, guys. we had a few unpleasant revelations i think everybody in japan knows about by now\n\n\ntouya, if you’re watching this, call mom, you asshole\n\n\n(wheeze)\n oh my god\n hahahahahaha\n and (wheeze) and then we had to face the worst villain yet-\n\n\nwhat do you m-\n\n\nmidterms\n\n\noh right\n\n\nbut we’re back in STYLE now\n take it away, todoroki!\n\n\nright, so today we’re talking about the hero team known as the wild wild pussycats\n most people know they suffered a major fall in the rankings lately, but not why they did\n and it’s actually pretty important\n\n ---\nHero Theory Episode 30: What Happened to the Wild Wild Pussycats?\n341,382 views\nComments • 1,480\nCW\nalright, time to start a gofundme to mail ragdoll the biggest goddamn box of chocolates i can find, who’s with me\nどぞよろしく\nMidoriya was a really good guest in this episode! He seems like he’s really passionate about quirkless discrimination, huh?\nAnna Trinidad\nthey’re all such good friends i’m gonna cry???? &lt;33333\nMarigold77\nfor somebody with a fire quirk dabi sure got r o a s t e d this episode\n ---\nKaminari Denki @chargebolt\nhey!!! to celebrate hero theory’s return from hiatus, we got something cool for you guys that was promised a while ago!!!! the discord server is FINALLY HERE!!\nKaminari Denki @chargebolt\ncome chat with us! https://discord.gg/zTiVr5\n ---\nThe server proves to be an explosive success. It starts as just a place to chat about the latest episodes of hero theory and ask the creators questions, but it doesn’t take long for it to go completely off the rails in the best way. The entirety of Class 1-A joins it, as do (to everyone’s surprise) a few pro heroes, followed swiftly by a veritable flood of civilians. Todoroki and Kaminari are admins, while Jirou, Midoriya, Kirishima and Yaoyorozu get made moderators.\nTodoroki mostly lurks on invisible mode, and inserts his opinion into conversations whenever it’s least expected, while Kaminari enthusiastically and constantly hypes up whatever the next episode will be, runs polls, and is generally a ray of hyperactive sunshine.\nThe suggestion sheet stays up on the classroom wall, of course, but now they have a constant stream of video ideas from the public as well. Most of the ideas are a bit too crazy even for them, Todoroki starts keeping a list on his phone of the good ones.\n“Hey,” Kaminari says one day, while hanging upside down off of his bed, squinting at the results of the latest community poll on his phone. “People really want more villain episodes.”\n“Mm?” Todoroki asks, glancing up from his English homework.\n“Yeah! Like, yesterday I asked the server what their favorite episodes were, and the Adamant and Endeavor episodes were right up there at the top, but like the next two after that were the ones we did on Stain and Dabi.”\n“I don’t think the Dabi episode was popular because he’s a villain,” Todoroki said. “That was because it actually turned out to be true.”\n“Touché.”\n ---\nPETITION: ADD NANA SHIMURA TO THE NATIONAL HEROISM MEMORIAL\n500,000/500,000 signatures received\n ---\nThe petition is posted anonymously online. As soon as he finds out about it, Kaminari shares it on Twitter and announces it on the Discord server, and it reaches the signature goal almost overnight.\nAll Might gives a speech at the unveiling of the amended monument in the center of Tokyo, and all of Class 1-A crowds together in the common room to watch it on live TV, stacked on top of each other so they can all see the live feed. Yaoyorozu holds out an arm to generate a constant supply of tissues for Midoriya, who’s a weeping mess.\n ---\n\none of our most popular episodes ever was our feature on adamant, aka nana shimura\n\n\nand hey shout out to everybody who signed the petition! You guys are the best!!\n\n\nso today we’re doing another feature on a former hero we think deserves some more credit\n\n\nand we’ve got a special guest to help us out this time!\n cmon out, iida!\n\n\nah- hello!\n\n\ncamera’s there, buddy\n\n\nright!\n er, what do you want me to do?\n\n\ncan you tell us about the first ingenium’s approach to heroism?\n\n\ni’d be honored to!\n\n ---\nHero Theory Episode 33: Who Was Ingenium I?\n372,221 views\nComments • 1,480\nYuka Miyua\nas a former sidekick who worked with team idaten, i have to say this got me right in the heart, but i’m glad tenya seems like he’ll be upholding his brother’s legacy!\nRunaway Butterfly\ni really love these more serious episodes mixed in with the goofy ones. subscribed and set to notify.\nGreyduck\nawww at 2:36 he sounds like he’s gonna start crying right that’s not just me?\nBetterOrWorse\nCheering for you, Ingenium II !!!\n ---\neverywhereilook posted\n\nGif: Endeavor, in the midst of a press conference, is suddenly ambushed by a teenager with a bucket of cold water, who sprints off in the chaos that ensues.\n\nGif: A clip from Toga’s ‘response video’ of Dabi screaming in frustration, blue sparks falling from his fingers and sizzling on the floor.\n\nGif: All Might reading his speech in front of the Memorial for Heroism with Nana Shimura’s newly-added name, tears running down his cheeks.\n\nGif: Todoroki and Kaminari high-fiving, both smiling.\n\n{real-world impacts of hero theory}\nA little something I wanted to do to celebrate the birthday of this excellent show.\n\n12,909 notes #hero theory #gifset #class 1-a content #happy anniversary to my favorite channel\n ---\nTodoroki Shouto\n@freezerburn\nCo-host of Hero Theory and UA heroics student."
}