{
    "id": "17431178",
    "url": "https://archiveofourown.org/works/17431178?view_full_work=true",
    "author": [
        "Chiharu"
    ],
    "title": "Operation Old Men",
    "rating": "Not Rated",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M",
        "F/M"
    ],
    "fandoms": [
        "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù"
    ],
    "relationships": [
        "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian",
        "Jin Ling | Jin Rulan & Lan Jingyi & Lan Yuan | Lan Sizhui",
        "Jiang Yanli/Jin Zixuan"
    ],
    "characters": [
        "Jin Ling | Jin Rulan",
        "Lan Yuan | Lan Sizhui",
        "Lan Jingyi",
        "Jiang Cheng | Jiang Wanyin",
        "Wen Ning | Wen Qionglin",
        "Jin Zixuan",
        "Jiang Yanli",
        "Jiang Fengmian",
        "Yu Ziyuan"
    ],
    "additional_tags": [
        "Alternate Universe - Modern Setting",
        "Alternate Universe - Boarding School",
        "Single Parents",
        "Everyone Is Alive",
        "Matchmaking",
        "Family Dynamics",
        "Hospitals",
        "Meet the Family",
        "Family Vacation",
        "Weddings",
        "School Reunion",
        "Happy Ending"
    ],
    "language": "English",
    "series": "",
    "published": "2019-01-15",
    "completed": "2019-04-19",
    "words": "37,645",
    "chapters": "6/6",
    "comments": "1,299",
    "kudos": "13,007",
    "bookmarks": "3,302",
    "hits": "114,401",
    "summary": "<p>An ill-fated parent teacher conference reunites Jin Ling's wayward uncle with Sizhui's father. AKA: A matchmaking disaster as told by Jin Ling, Sizhui, and Jingyi. </p>\n<p> </p>\n<p> <i>Jin Ling knows he’s in deep trouble even before reporting to Headmaster Lan’s office, but the words “your uncle will be here soon” still strike the fear of God in him. His only consolation is that Jingyi and Sizhui’s guardians are also in the office, Jingyi’s mom already lecturing her sheepish-looking son. Lan-<i>ayi</i> only stops when Sizhui’s father, a quiet and tall man in white, clears his throat, causing her to engage him in one-sided smalltalk.</i></p>\n<p> </p>\n<p> <i>This is a disaster. Jin Ling had spent such a nice break at home for Mid-Autumn Festival, and Fairy’s presence had soothed his homesickness after returning to boarding school in Gusu. He knows pets aren’t allowed, but who is going to report Jin Ling when his father pays good money for a private suite in the dorms? Then there was the incident with Jingyi, a box of mooncakes, and a door left ajar. Long story short, he spent an hour chasing Fairy down the halls with Sizhui and Jingyi before finding his dog nosing up to a very angry Headmaster Lan.</i></p>\n<p>The boys serve detention, and Sizhui visits his cousins.</p>",
    "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>Beta'ed by the lovely and <a href=\"https://archiveofourown.org/users/kyuu\" rel=\"nofollow\">kyuu</a> and <a href=\"https://archiveofourown.org/users/phraseme\" rel=\"nofollow\">Hedge</a>! </p>\n<p>Ayi - 阿姨 Auntie<br>Jiujiu- 舅舅 Uncle from the mother’s side of the family<br>Dajiu- 大舅 the oldest jiujiu<br>Jin Daxiaojie -金大小姐 Little Mistress Jin<br>Chunjie - 春节 Chinese New Years</p>\n<p>I know WWX canonically calls Jin Ling “A-Ling” but the pet name possibilities are endless!! Ling-zi? Ling-er? Ling’bao? Lingling? YEAH WE OUT HERE, LOVING AND SUPPORT MY LITTLE GOLDEN SON. Also I know they're not supposed to have more than one child, so Jin Ling shouldn't even have any siblings, but on ao3 I do what I want!!!11</p>\n<p>Me: Would LWJ have the “Han Guang-Jun” title in modern day China?<br>Kyuu: No but I think they should all have shitty English names, like Michael Lan.<br>Me: Bye</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Beta'ed by Kyuu and Hedge!</p>\n<p>Xiaojiu- 小舅 - The younger jiujiu aka Jiang cheng<br>Daijiu- 大舅 - The older jiujiu (by 5 days lmao) aka WWX<br>Qingming Festival- 清明节- Tomb-Sweeping Day</p>\n<p>I found a map of the MDZS world overlaid with a modern map of China, and Gusu seems to be right on top of Shanghai. Let’s just pretend Gusu is a 30-50 minute ride away from Shanghai, where WWX/WQ/WN works. Of course none of the major MDZS cities are located in Beijing, the only place I have actual experience living in. So why do half of the characters have a Beijing accent in the donghua?? WHAT IS THE TRUTH?</p>\n<p>Some thoughts re: Sizhui’s adoption. WQ and WN weren’t in a good place (socially, economically) to adopt Wen Yuan at the time, but they fully believed the Lans would return their foster child without a problem. So of course Sizhui bursted out crying “PAPA!! I don’t wanna go!” all snot nosed while clinging onto LWJ’s. WQ’s promotion was pretty recent, so they weren’t always well off, especially after Wen Ruohan bankrupted most of the extended family.</p>\n<p>NEXT CHAPTER WILL BE PRESENTED BY LAN JINGYI, and I promise it’ll be more fun!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Mala = 麻辣 = Numbing and spicy, a popular cooking method in Sichuan. I'm a total wimp and can't eat this<br>Laolao = 姥姥 - maternal grandmother, as in Madam Yu<br>Nainai = 奶奶 - paternal grandmother, as in Madam Jin<br>Fei Cheng Wu Rao = 非诚勿扰 A popular chinese dating show.. DOES ANYONE REMEMBER THIS? I used to binge this show all the time</p>\n<p> </p>\n<p>Thank you to everyone who has commented so far!! I love reading your thoughts hehe! Once again, thank you to the wonderful Hedge for betaing!</p>\n<p>Baidu Tieba = Basically the Chinese equivalent of... Reddit? They're very loosely comparable. I haven't been on a baidu tieba in 5 years so I really don't know anymore.</p>\n<p>There was an issue and I ended up having to delete ch4 and repost it!!!! SORRY FOR THE CONFUSION!!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>BUCKLE UP BECAUSE WE'RE GOING TO YUNMENG FOR NATIONAL WEEK! There, we will meet Jin Ling's family hehehe That's actually the segment I wanted to write the most while brainstorming for this fic. I can't believe the last 4 chapters have been a set up for me to indulgently write about Jin Ling's family dynamics. I ALSO PROMISE MORE WILL ACTUALLY HAPPEN IN THE NEXT CHAPTER so pls anticipate Jingyi's fish out of the water narrative.</p>\n<p>I've given up maintaining a pinyin dictionary in the end notes. In the novel, Jin Ling calls JGY \"小叔叔/xiao shushu.\" Here, the title has been given to Mo Xuanyu. I had some sort of dialogue in mind for Jin Ling to explain what his shushus (paternal uncles) are doing now, but it never made it into the story. TLDR; JZX eventually hired a handful of his half brothers to work under him, partly for them to prove their worth and partly because his wife convinced him to. Why? Probably because I saw too many happy fanart of JZX/JGY/MXY as siblings</p>\n<p>Looking back, I question my own transitions from english to pinyin to hanyu, especially in the WeChat section... The entire story is supposed to take place in China, in Chinese, but who even knows at this point lmao.</p>\n<p>Chapter 5 will be told from Jingyi's POV, and Jin Ling will wrap up the story in Chapter 6!</p>\n<p>LASTLY THANK YOU TO MY LOVELY BETA <a href=\"https://archiveofourown.org/users/phraseme\" rel=\"nofollow\">HEDGE</a></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>Bao bao = 抱抱= hug hug, but also when kids ask to be picked up<br>Youtiao = 油条 = fried dough sticks aka what I wanna eat every morning</p>\n<p> </p>\n<p>Jin Ling = 14<br>Jin Bing =~ 12<br>Qianqian (Jin Minqian) and Tiantian (Jin Yutian) =~ 4. I feel the need to clarify their names AREN'T homonyms for 今天 and 金钱 LMAO</p>\n<p>NGL I was too lazy to come up with names so I used my friends’ names. Wasn’t sure how much screen time I wanted to give Jin Ling's fictional siblings but here we are!!! The Little Mistress and the three princesses. Jin Bing is all of us when we were 12, but cooler. </p>\n<p>Sorry for the delay in updating! I was preparing for a con, then attended the con, then had to recover from the con lol. THIS STORY IS REALLY DRAGGING ON BUT I HOPE YOU ENJOY THE HAPPY HETEROSEXUALS! One more chapter to wrap everything up, maybe with an epilogue as well. GOD THESE CHAPTERS KEEP GETTING LONGER AND LONGER.</p>\n<p>As always, beta'ed by the lovely <a href=\"https://archiveofourown.org/users/phraseme\" rel=\"nofollow\">Hedge</a>.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>Beta'ed by <a href=\"https://archiveofourown.org/users/phraseme\" rel=\"nofollow\">Hedge</a>.</p>\n<p>THAT'S A WRAP! Sorry the last chapter took so long for me to publish! I had a lot of fun writing this so I hope it was equally fun to read. The ending was very cliche and very self indulgent for me hehe. (voice breaks) I just WANT JIN LING TO HAVE FrIendS</p>",
    "text": "Jin Ling knows he’s in deep trouble even before reporting to Headmaster Lan’s office, but the words “your uncle will be here soon” still strike the fear of God in him. His only consolation is that Jingyi and Sizhui’s guardians are also in the office, Jingyi’s mom already lecturing her sheepish-looking son. Lan-ayi only stops when Sizhui’s father, a quiet and tall man in white, clears his throat, causing her to engage him in one-sided smalltalk.\nThis is a disaster. Jin Ling had spent such a nice break at home for Mid-Autumn Festival, and Fairy’s presence had soothed his homesickness after returning to boarding school in Gusu. He knows pets aren’t allowed, but who is going to report Jin Ling when his father pays good money for a private suite in the dorms? Then there was the incident with Jingyi, a box of mooncakes, and a door left ajar. Even whistling hadn’t done the trick. Long story short, he spent an hour chasing Fairy down the halls with Sizhui and Jingyi before finding his dog nosing up to a very angry Headmaster Lan.\n“-And I told my Jingyi he needs to stop being such a bad influence on Sizhui,” Jingyi’s mother continues. “Sizhui is such a well-mannered and accomplished child. I’d be so happy if any of my children were like him.” Behind her, Jingyi makes an exasperated face, like he’s heard this too many times. Jin Ling supposes that’s one thing they have in common.\n“Not at all. Sizhui is lucky to have a friend like him,” Sizhui’s father replies. It’s the first time he’s spoken at all, and Jin Ling is not surprised at the quiet note of authority in his voice. \nHeadmaster Lan huffs. “See, I always said you were too soft on Sizhui. Now look where we are! Running? Shouting? Boarding illegal pets in my school? Preposterous. Now we have to deal with the Jin family again, and his guardian has the audacity to be late! Why must history always repeat itself?” \nSizhui and Jingyi will probably be fine, both being a part of the Lan family that funds and runs the school. Jin Ling is the one facing possible expulsion and a shameful return to Lanling, to the quiet disappointment of his mother and the obvious disapproval of his extended family. His time at Cloud Recesses Academy is supposed to be a chance to prove himself, yet Jin Ling struggles with newfound rules and socialization with students his age. Even worse is the fact that Jin Ling has no clue who is coming, aside from the small hint that it would be an uncle on his mother’s side. At least his mother isn’t making the trip. Jin Ling would rather step into Shanghai traffic than make her travel so far just to take him home.\nAs if on cue, familiar voices carry in from the hallway. \n“I told you to not get him that dog! It’s the year of the pig now! Why couldn’t you just send Ling-er off with some ribs instead?”\n“Oh, shut up already! As if you don’t spoil him too! And you know he choked on those ribs before!”\nOh god, Jin Ling thinks. He feels his face burning as the door bursts open to reveal both of his jiujius arguing their way into the room. Jiang Cheng is polite enough to greet Handmaster Lan, but Wei Wuxian just flies to Jin Ling’s side and pulls him into a half-hug. \n“Ling-bao! Don’t look so unhappy to see me!” Wei Wuxian laughs, obviously on his life mission to embarrass Jin Ling with endless pet names. \n“He’s always unhappy to see you,” Jiang Cheng mutters. He gives cold nods of acknowledgement to everyone in the room.\nWei Wuxian just laughs, his voice reverberating. “Tell him you like ribs, Ling-er! And I’ll definitely help if you start choking again.”\n“That happened when I was five!” Jin Ling hisses in embarrassment and tries to extract himself from his uncle’s grip. \n“Yeah, but you’ll always be five in my-”\n“ENOUGH!” Headmaster Lan says, and Wei Wuxian blinks as if he’s noticing everyone else for the first time. “Wei Wuxian! You’re disrespectable as always! You’ve learned nothing since I last saw you, and now your nephew is every bit of a troublemaker!”\nWei Wuxian just grins. “You look as distinguished as always, Headmaster Lan! I see your beard grew!” \nNext to him, Jiang Cheng very obviously rolls his eyes. \n“Just looking at you is making me age rapidly!”\n“And Ling-zi is a good kid! Don’t be so harsh on him!”\nIf possible, Headermaster Lan’s face grows even redder in anger. “Do good kids break half a dozen rules and get one of my best students in trouble?!” He points at Sizhui, causing Jin Ling’s gaze to travel to the quiet boy and his equally wordless father.\nWei Wuxian does the same, and his grip on Jin Ling’s shoulder tightens noticeably. “Lan Zhan?”\n“Wei Ying,” Sizhui’s father says, voice unreadable. This surprises Jin Ling, for he can’t even remember the last time his parents called his uncle by his real name. Sizhui seems to share the sentiment, with the way he peers up at his father. \n“No greeting for me, huh?” Wei Wuxian smiles. “You’re the same as always. It’s nice to see you again.”\nJingyi’s mother decides it’s her turn to speak again. “I’m so sorry that my son bothered young master Jin. He’s always been a troublemaker, you see. I told him to be on his best behavior at Cloud Recesses, but he’s just not one for following the rules. I’m sorry he-”\n“It’s not Jingyi’s fault!” Jin Ling blurts out, then closes his mouth when all the adults turn to him. Even Sizhui’s eyebrows are lifted in surprise. Jin Ling sets his gaze on his lap, tears of frustration already welling in his eyes. He hates this childish side of him, but he also hates making others atone for his mistakes. It makes him feel even more helpless, like Jin Ling can never be accountable for himself. When Wei Wuxian sets a comforting hand on his shoulder, Jin Ling continues. “I’m the one who brought Fairy in. Lan Jingyi and Lan Sizhui were just trying to help me. It’s not their fault. If you’re going to punish someone, then punish me! Expel me instead!” \nAfter a moment, Headmaster Lan coughs. “No one is getting expelled. Wipe your tears. It’s unbecoming.”\nWei Wuxian slips a black and red handkerchief into Jin Ling’s hands. Even Jiang Cheng looks somewhat sympathetic and sets a hand on Jin Ling’s head. \n“Lan Sizhui, Lan Jingyi, and Jin Ling: all three of you will serve detention for a week. Administrator Chen will oversee the details.” Headmaster Lan declares, then sighs. “And the dog must go. Bring it in.”\nJin Ling cheers up immediately when the secretary opens the door to let Fairy in. As always, Fairy is excited to see everyone and rushes over to Jin Ling, causing Wei Wuxian to yelp and skitter across the room, to the farthest corner away from Fairy. He looks almost comical, hiding behind Sizhui’s father.\n“Get that thing out of here!” Wei Wuxian hisses as he crouches behind Sizhui’s father. He tugs desperately on Sizhui’s father’s arm. “Jiang Cheng! Get rid of it!”\n“You’re an embarrassment,” Jiang Cheng says, but clips a leash to Fairy’s collar regardless. Nonplussed, Fairy goes to sniff Jiang Cheng’s feet. \nWhile Sizhui’s father doesn’t move away from Wei Wuxian, Jingyi’s mother seems to be rapidly losing respect for him. It’s normal for people to feel a disconnect between Dr. Wei Wuxian, nationally recognized pediatrics trauma surgeon, and the foolish way he carries himself. Jin Ling had grown up buried in sand by his jokester uncle on family vacations only to have him rush out in the middle of dinner to attend to emergencies at the hospital. Then there was Jiang Cheng, who was harsh with words but soft with his affection for Jin Ling. It’s no wonder that Jin Ling’s mother put them down as emergency contacts on his school file, especially after Jiang Cheng began overseeing the Suzhou branch of Grandpa Jiang's company and Wei Wuxian got transferred to the biggest hospital in Shanghai. \n“I have a headache,” Headmaster Lan adds. “All of you are dismissed for the day. And Wei Wuxian, I don’t want to see you or your nephew in my office again.”\nWei Wuxian nods fervently, still hiding behind Sizhui’s father. He’s the first out of the door after the dismissal, and he makes wild-armed gestures at Jiang Cheng to keep Fairy away from him while everyone empties into the hallway. When Wei Wuxian gets pulled into a conversation with Jingyi’s mom, Sizhui moves over to Jin Ling.\n“I didn’t know your uncle was Dr. Wei,” Sizhui says softly, watching Wei Wuxian charm Jingyi’s mom. \n“More importantly.” Jingyi lowers his voice. “Are your uncles always like this?”\nJin Ling doesn't know how to explain that Jiang Cheng and Wei Wuxian’s banter doesn’t even scratch the surface of Jin Ling’s convoluted family dynamics, especially with his father’s large extended family. He’ll never admit it, but Jiang Cheng and Wei Wuxian are probably his favorites. Now, Jin Ling watches Wei Wuxian chat with Sizhui’s father with the same overt familiarity he does with the children in the pediatrics ward. He knows that his parents, and probably the parents of everyone here, once attended Cloud Recesses. Yet his family rarely speaks of their time at school. “It’s a long story,” Jin Ling says at last. \n“Are your uncles friends with Han Guang-Jun?” Jingyi asks. All three of them look as Wei Wuxian throws an arm around Sizhui’s father’s shoulder.\n“If you can even call them that,” Jiang Cheng tsks, having supernatural hearing as always. He dumps Fairy into Jin Ling’s arms and watches as Fairy leans up to lick Jin Ling’s nose. “Oi, Wei Wuxian! Stop blabbering and get over here! We’re leaving!”\nJin Ling’s heart falls. “You’re leaving already?”\nJiang Cheng looks at him for a moment, then pats Jin Ling’s arm. “Don’t be so soft. You can still come see me on the weekend. The headmaster went easy on you. Don’t think I’m not gonna punish you for sneaking Fairy in. You said the dog was gonna stay in Lanling! Did you lie to your parents too?”\n“Punish-?” Jin Ling begins.\n“Your punishment is to eat dinner with us!” Wei Wuxian cheers. He puts both hands on Jin Ling’s shoulder and gyrates Jin Ling in his spot. “You don’t have any more classes for the day, right? Just skip them if you do!”\n“Jie is not paying for this school just so you can set a bad example for A-Ling!” Jiang Cheng huffs, but leads them towards the direction of the building exit regardless. For a moment, Jin Ling had forgotten that they both attended Cloud Recesses too. \nWei Wuxian just cackles. “Bad example? I’m his favorite uncle!”\n“Oi!\n“Okay, I’m his favorite dajiu-”\nWhile his uncles argue, Jin Ling turns around. He doesn’t quite try, but still manages to catch Jingyi’s eye as Jingyi gives him a hasty wave goodbye. Sizhui stands next to him, a soft smile on his face. Yet, Sizhui’s father gaze is direct and unwavering, fixed very obviously on Wei Wuxian’s retreating back. Weird, Jin Ling thinks. \n“Anyways, we should go to the Sichuan hot pot place I discovered-”\n“I’m not eating anything that will burn my mouth off,” Jiang Cheng cuts in. They’re out of the building and heading to the east part of campus, towards the parking area. “Anyways, Fairy can ride in my car. A-Ling, you go with this idiot so he doesn’t get distracted, take you to McDonalds, and leave you in the bathroom again.”\n“Okay, that was one incident-”\n“Sichuan hotpot is fine!” Jin Ling croaks. They’re still on still Cloud Recesses grounds and people are starting to pay attention to the noise. Jin Ling can’t have any of his classmates hearing this. Jingyi would never stop bringing it up!\nLater, when they’re stuck in traffic and Jin Ling has sent his parents an abridged version of today’s events on WeChat, Jin Ling turns to his uncle. “Does Sizhui’s father hate you?”\n“Who? Lan Zhan?” Wei Wuxian taps his long fingers on the steering wheel. “I haven’t seen him in a decade. Who knew he even had a child?”\nJin Ling rolls his eyes. “Sizhui is older than me, so you should’ve known about him more than ten years ago. You suck at math!”\n“Yeah, but you’re barely nine.”\n“I’m fourteen!!” Jin Ling yells, then frowns when his reaction sends Wei Wuxian into a fit of laughter. “And he couldn’t stop glaring at you! His gaze is colder than Grandma’s when she’s out for blood!”\n“Lan Zhan’s not a cold person. He just, I guess, doesn’t like me? We’re better off avoiding each other.” Wei Wuxian replies easily, his eyes on the road. “And don’t bring your grandma up. I’m scared of her!”\nEveryone is scared of her, Jin Ling thinks but doesn’t say. It’s bad enough that she’s the toughest on him for being the oldest. He’s pretty sure his parents only narrowly avoided her scorn by being the only pair to bring her grandchildren. Jin Ling has heard her berate Jiang Cheng on more than one occasion for ruining his own matchmaking sessions, and Jin Ling doesn’t even want to think about the kind of people Wei Wuxian would date, much less procreate with. Adults are so weird.\n“Anyways, don’t let my bad blood with Lan Zhan ruin your budding relationships! I’m glad you’re making friends!”\nJin Ling can feel his face flushing, so he turns towards the window and stares out into traffic. The kids at home always made fun of him. First for his haughty nature, then for his lack of hobbies outside of archery, and then for being the prettiest out of four kids when three of them were girls. Jin Ling doesn’t know how to interact with real people besides his younger sisters and caretakers. Jingyi has even taken to calling him Jin Daxiaojie, although his voice is starting to irritate Jin Ling less these days. “Whatever. They’re not my friends.”\n“They’re not your friends yet you still defended them? In front of old man Lan, no less? Wow, you’re so chivalrous!”\n“Stop making fun of me!”\nMore laughter. “I’m not making fun of you! I love you! You’re my favorite nephew!”\n“Y-you! How can you say that so easily! You’re so shameless!” Outside, a red Tesla edges past them on the right only to get stuck at the next traffic light. Maybe they shouldn’t have driven so far out of Gusu. There were perfectly fine, non-spicy food options near Caiyi. “And I’m your only nephew! How far is the place anyway?”\n Wei Wuxian just hums. “We’re here!”\nSure enough, they pull into a parking garage connected to a large mall. Jin Ling follows his uncle out of the car only to be led on a strange winding path behind the building, into a series of hutongs. They eventually arrive in front of a nondescript looking store framed by lanterns. Jiang Cheng is already waiting outside, looking irritated.\n“Where’s Fairy?” Jin Ling asks immediately.\n“Relax, your dog is fine. I left a crack open in the window for him. I don’t see you worrying or apologizing to me for making me wait.” \nWei Wuxian makes silly face. “Sorry! I got lost!”\n“You’re the one who recommended this place! Haven’t you been here before?!”\n“I have bad memory!”\nThankfully, Jiang Cheng’s mood improves when they’re seated inside. He orders a clear broth for their side of the table and ignores the liberal amount of spices Wei Wuxiang orders for his section of the hot pot. The food arrives quickly, and both of Jin Ling’s uncles engage in a race to see who can put the most on Jin Ling’s plate.\nThe food is good, probably the best he’s had since coming to Gusu. Jin Ling is chewing on a piece of tofu when he remembers something else. “Headmaster Lan said something about dealing with my family again. What does he mean? Did Father get in trouble?”\nA piece of mushroom slips through Wei Wuxian’s chopsticks. He says “Eh,” while Jiang Cheng snorts. “Your Father is… A good person. We get along now. You know? Richie Ren Boys forever!” \n“Okay?” Jin Ling squints. Although he’s never seen Wei Wuxian display obvious affection towards his father, Jin Ling could never forget the year he was eight and spent Chunjie in Yunmeng. Wei Wuxian had challenged Jin Ling’s father to a karaoke competition that ended with them drunkenly dueting to Richie Ren. Even worse was that Bingbing, Jin Ling’s first sister, had gotten ahold of the matching tambourine and given him one. Jin Ling had gotten so excited that he consumed too much fried peanuts and soy milk, only to throw all the food up later. Grandma had been furious with everyone involved. “So what? Where is this going?”\n“Did your mother tell you that this guy here was kicked out of Cloud Recesses during our first year?” Jiang Cheng portions more dipping sauce into Jin Ling’s bowl. \nJin Ling’s mother didn’t tell him that, but he supposes the timelines match. He knows Wei Wuxian studied abroad in Canada for a few years before going to Beijing for medical school. “What did you do to get expelled? Did you get in a fight with Sizhui’s dad?”\nThis makes Jiang Cheng laugh. “Not that Lan kid’s father! He got kicked out for punching your father!”\n“WHAT!?!?!”\nThis is what Lan Sizhui knows:\nHe was born Wen Yuan, to distant members of the Wen family that once attempted and nearly succeeded in creating an exports monopoly in southern China. Sizhui remembers a little of his life before joining the Lan family, but his adoption has never been a topic of shame. He knows he’s fortunate to survive the three-car collision that killed his birth parents, and even more so to be taken in by the Lan brothers.\nWhat Sizhui learns later is that he had hovered on the edge of death for so long that even his aging grandmother had made peace with it. Sizhui had no memories of the three months he spent in the hospital, so he’d been surprised to hear his uncle recall Sizhui’s past on the 5th anniversary of his parents’ death, long after his grandmother had joined her children in the grave.\n“Your lung collapsed, and you suffered from abdominal and intracranial hemorrhage,” Lan Xichen had explained calmly. “The outlook was quite grim. The surgeon operated on you for six hours. Then you had multiple follow-up surgeries. The hospital director wanted to transfer you out to make bed space for patients with more hopeful prognosis, but your father and the pediatric surgeon petitioned your case.” \nHis uncle had smiled then, fondness obvious on his face. “You survived and blossomed into such a compassionate child. You have Wangji and Dr. Wei Wuxian to thank for that.”\nSizhui has, of course, done his best to become a child worthy of Lan Wangji. His father is modest with his affections, but kind in every way that matters. His peers and teachers call him a prodigy, a model student, but Sizhui knows he’d be nothing without persistent hard work and an ever-present yearning for his father’s approval. He’d also researched Dr. Wei throughout the years, wondering what happened to his faceless savior. Yet his father never spoke of Dr. Wei, and eventually Sizhui found more value in focusing on the present than questioning the past.\nSeeing Wei Wuxian in the flesh is unprompted, unexpected, and unlike anything Sizhui could have imagined. There’s something unsettlingly refreshing about Wei Wuxian, who is unconventionally charming and has eyes that makes Sizhui want him to smile in his direction. \nSizhui’s father seems to share this sentiment. He’s unnaturally quiet through the entire meeting and makes no effort to step away from Wei Wuxian, even after Jin Ling’s uncle becomes unnecessarily touchy. Sizhui has never seen his father react positively, or even neutrally, to unwarranted contact. The sight of Wei Wuxian throwing an arm around his father sends a million questions through Sizhui’s mind. \n“Father?” Sizhui asks after Jin Ling leaves with his uncles, and Jingyi wanders off with his mother. “Was that the Dr. Wei Uncle told me about?”\n“Yes,” Lan Wangji says tightly, as if he’s seen a ghost. \nSizhui treads carefully. “Are you friends?”\n“Old acquaintances, at most. Come, let’s get dinner.” \nLan Wangji turns, and Sizhui knows that’s the end of this conversation. He has so many questions, but past experience dictates his father will probably answer none of them. \n \n \n \n \nSizhui is still thinking about this weird encounter when Administrator Chen assigns them to clean the rabbit pens a few days later. Sizhui and Jingyi wait at the student gardens after class for Jin Ling to arrive, Jingyi busy scrolling through his phone. Jin Ling appears ten minutes later, huffing and puffing.\n“You’re late!” Jingyi points out while Sizhui is unlocking the gate.\nJin Ling doesn’t quite pout, but his face does something equally endearing. “I had to tell the archery club that I can’t make it to practice this week.”\n“Must be hard being the star of the archery team.” Jingyi whistles. It’s a compliment coming from him, but it sends Jin Ling into an indignant yelp. \nSizhui pushes the gate open then and leads them into the student garden. This seems to be Jin Ling’s first time here, because his mouth opens slightly as his eyes land on the fountain, the seasonal crops maintained by the horticulture club, and the rabbit pens at the west end of the garden. “Welcome to detention”\n“We got off easy,” Jingyi says as they follow Sizhui towards the custom built rabbit pens. “This is barely a punishment. Sizhui already cleans and maintains this area regularly anyway.” When Jin Ling’s mouth drops open, Jingyi grins. “Oh, stop staring and help me set up. We gotta make a play area so they stay away from the plants.”\nJin Ling diverts his eyes from the rabbits when Jingyi hands him a stack of gates to interlock. “Who-why are there so many rabbits? I thought pets weren’t allowed!”\n“Pets are not allowed in the dorms,” Sizhui explains as he works on creating a series of pet gates. “But these rabbits are maintained and cared for by students. They’ve also been here longer than me. Some of the clubs take turns cleaning and feeding them, but when there’s a lapse in schedule, I like to come in and help.”\nAs always, Jingyi manages to nip his finger on one of the metal sections. He grins when Sizhui hands him a bandaid. “Rumor has it that these rabbits once belonged to Han Guang-Jun and Ze Wu-Jun! They just kept breeding and Headmaster Lan didn’t have the heart to get rid of them. Now he uses them to teach us about responsibility and all that. Sizhui- what is this?” Jingyi sticks his finger out to show them the cartoon sheep printed on his bandaid.\n“One of the girls in my class gave me a box of these. I just kept them.” Sizhui pays no attention to Jingyi’s comment of you’re so popular and gets back to work.\n“Is this big enough?” Jin Ling asks once they’ve set up a free roaming area that covers half of the garden. \nIt’s obvious Jin Ling got a bit overzealous. The sides are hardly straight and Sizhui has never seen such a weirdly shaped pet fence before. Still, a preliminary tug at the gate shows it’s secure enough. “This is fine. Would you like to hold the rabbits?”\n“Yeah, sure whatever,” Jin Ling mumbles, but his eyes light up when Sizhui unlocks the pen and a few rabbits hop over towards Sizhui’s hand. Jin Ling opens his mouth wordlessly when Sizhui picks up a nearby grey rabbit and sets him in Jin Ling’s arms. “What-how do I hold this thing?”\nJingyi tsks and moves over to help. “Here, put your right arm underneath the butt. You want all four feet to be pressed against your body so they don’t get scared. Don’t stress him out!”\n“You’re stressing me out!” Jin Ling hisses, but lowers his voice when the grey rabbit stirs in his arms. He stares down, fondness obvious on his face while Jingyi and Sizhui each pick up their own. \nSizhui has already taken today’s food out of the storage area. This week’s supply is a mix of artichoke leaves, green beans, and a mix of spring greens.\n“No carrots?” Jin Ling asks, peering over Sizhui’s shoulder. “And where did all this come from anyway?”\n“Carrots are high in sugar. They shouldn’t be a main source of food,” Jingyi says knowingly as if imitating Sizhui. He scratches his rabbit lightly on the cheek with one finger. “And the cooking club sets aside their extras every week. They say the leaves will go to waste anyway, but look at how nicely some of these pieces are cut! The president definitely has a crush on Sizhui!”\nThe only response they get is a weird look from Jin Ling, who picks up a thin piece of artichoke leaf and feeds it to his rabbit. \n“These are just snacks. Feel free to feed some to them while they free roam. We still need to change out the hay and water.” When Jin Ling doesn’t reply, too engrossed with his new friend, Sizhui laughs and moves another rabbit out of the pen. After most of them are settled in the free roam area, Sizhui sets today’s snacks on a small stool. \nCleaning out the bedding and litter box feels therapeutic. It's been a relaxing pastime for Sizhui, ever since his father first showed him how to care for rabbits. There was always something undeniably fond about the way his father handled them, and Sizhui slowly begun to see the same care his father put into everything he touched. \n“Let me help!” Jingyi scoots over after Sizhui has readjusted the hay in the feeder. “You go play with them!”\nIt’s still mid-autumn, and the temperature is perfect for an afternoon spent in leisure. Sizhui misses times like this, when he could go to the rooftop gardens of his family’s complex and play guqin without bothering anyone. On those days, he’d always find a distant relative there drinking tea and praising his playing. Sometimes the elderly relatives in the building voiced their concerns about Sizhui not having a mother. Yet, how could Sizhui worry about such things when there was always an endless line of aunties bringing snacks to the penthouse his father shared with his uncle? It’s in the same building that he met Jingyi, both of them having been enrolled in the Lan family day care managed by Jingyi’s cousins on the first floor. \nSizhui is brought back to reality when a black rabbit circles around his knee, begging for attention. He pets it absently and turns to Jin Ling. “Do you visit your uncles a lot?”\n“I see Xiaojiu on the weekends,” Jin Lin says, now feeding a white rabbit a green bean with utmost focus. “Dajiu’s place is so messy, and he’s never home anyway.”\n“Your Dajiu is… Dr. Wei?”\n“Yeah, he’s adopted. So I definitely don’t have any of his crazy genes.”\nSizhui pauses. “Are you close to him?”\nThis is the point where Jin Lin looks up. “Why are you asking me so much about him? He’s famous, isn’t he? Go look him up on Baidu if you want to join his fan club.”\nEven Jingyi seems to have taken notice of the direction of this conversation. “I want to know how someone so casual can end up as a surgeon! Maybe there’s hope for me yet!”\n“You, as a doctor?” Jin Ling snorts, plucking at a patch of long grass near him. “Yeah right. He apparently wanted to be a mortician and work with dead people, but my grandma put her foot down. She said she didn’t send him to medical school for this and told him to become a real doctor.”\n“Hey, why can’t I be a doctor? What does your uncle have that I don’t?”\n“A brain, for starters-”\nSizhui interrupts the brewing argument by handing Jingyi his rabbit. “Let’s not fight. It’ll upset them. And Classmate Jin-”\n“Call me by my name,” Jin Ling cuts in. “You sound like a teacher.”\n“Jin Ling-” \n“Not you,” Jin Ling snaps at Jingyi, who laughs and leans back until he’s lying on the ground, stray rabbits nipping at the ends of his hair. \nSizhui brushes some grass out of Jingyi’s hair and smiles at Jin Ling. “Thank you for helping us.”\nThis makes Jin Ling frown, his face twisting into a sour expression. He looks away as if embarrassed. “Don’t thank me. This is our punishment. I don’t have a choice.”\n“We’ll still come back after our detention is over,” Sizhui says. Would you like to join us?”\n“Maybe. If I’m free.”\nJingyi and Sizhui share a look. They both know that Jin Ling will be back.\n \n \n \n \nThat evening, Sizhui retires to his dorm room and sends new photos of the rabbits to his family WeChat group. He also includes pictures of Jingyi teaching Jin Ling how to change water bottles in the play pen, Jin Ling obviously distracted as a spoiled bunny nibbles on the sleeves of his yellow shirt. \nThe reply is almost immediate:\nGreat Uncle: This is your punishment. Take it seriously.\nFather: Good\nFather: [Sticker]\nThe thumbs up sticker, coupled with his father’s succinctness, makes Sizhui laugh.\nSizhui is already getting ready for bed when his uncle replies. He hadn’t expected him to respond at all, Lan Xichen being on an extended business trip to Beijing to discuss the acquisition of new artifacts with the Palace Museum. Sizhui’s uncle is undoubtedly the face of the Lan family, their decades of history in the preservation of cultural heritage goods putting the Lans firmly in the category of old money. The modest nature of the home Sizhui shares with his father and uncle is only betrayed by the value of their musical instruments. \nUncle: Are you having fun with Young Master Jin?\nIt’s a private conversation outside of their group chat. The last message Sizhui’s uncle had sent him privately was over eight months ago, asking Sizhui if he needed help selecting a birthday gift for his father. His uncle has always been more perceptive than most.\nSizhui: Jin Ling likes the rabbits\nSizhui: His uncle is Dr. Wei\nUncle: Yes, I am aware. I’m an old acquaintance of Jin Ling’s mother-- Dr. Wei’s sister.\nUncle: I believe Dr. Wei now works with your cousins\nThis is news to Sizhui, who hasn’t spoken to his cousins lately. It’s embarrassing to remember how badly Sizhui reacted the year he turned seven and Wen Qing had come knocking on Lan Wangji’s door, asking the Lan family to return custody of Sizhui to herself and her brother. They were easily the closest living relatives of Sizhui’s deceased parents, who had been acquaintances with the Lan family. Yet, an internal power struggle with Wen Ruohan had made the extended Wen family powerless in the face of his wrath, forcing Lan Wangji to adopt Sizhui as way of protecting him. It had all been too complex, or perhaps too real for Sizhui to understand at the time. He had burst into tears at the thought of being separated from his adopted father. In the face of Sizhui’s obvious distress, they had arrived at the conclusion that Sizhui would stay with the Lan family and be allowed to interact with his cousins when he felt ready. \nSizhui liked Wen Ning and Wen Qing perfectly well, especially after their move from Qishan to Shanghai in recent years. Whatever awkwardness between them dissolved after their first trip together to the Wen family graves during the Qingming Festival. Seeing Wen Ning bowing to the tombstones had made Sizhui feel like he wasn’t just the adopted child of Lan Wangji. Like he had a greater purpose in the grand scheme of everything.\nNow, Sizhui wonders if some cosmic force is connecting everyone in his life together. \nThe gears in Sizhui’s head begin to turn. \n \n \n \n \nShanghai Children’s Hospital is a solid fifty-minute bus ride from Gusu, but Sizhui still braves the trip with the excuse of visiting his cousins. He almost gets lost on the way, but receives directions from an elderly woman after helping her cross the street. Surprisingly, Wen Ning is not waiting for him at the front as promised, so Sizhui makes his way to the third floor and asks around. The floor is full, and someone almost brushes him off when he asks for Head Nurse Wen. \n“We’re kind of busy here! Any unsolicited visitors need to go to-”\n“A-Yuan! You’re here.” Wen Qing appears then, looking stern as always in her white coat. Still, her gaze softens at the sight of Sizhui. “Nurse Zhang, this is my cousin.”\nThe nurse flushes immediately. “I’m so sorry, Director Wen!”\n“It’s no trouble!” Sizhui insists. “Sorry to bother you!” He doesn’t hear the nurse’s reply before Wen Qing steers him in the direction of her office. \nWen Qing cuts an impressive figure, and Sizhui notes the way the staff parts around her with obvious respect. They soon arrive in front of a door, completely nondescript if not for theWen Qing, Director of Cardiology plaque on the front. Wen Qing pushes it open and gestures for Sizhui to sit. When Sizhui offers her the sweets he’d brought from Gusu, she frowns. “I told you to stop bringing us gifts! We’re supposed to take care of you! Not the other way around!”\nSizhui is about to respond when Wen Ning comes through the door, his scrubs rolled up to his elbows. “Jie! A-Yuan! Sorry I couldn’t come fetch you! There was a situation with a patient, but I’m free now!”\n“You better be free,” Wen Qing says while browsing through some files on her nearly organized desk. There’s a single window in the office overlooking a courtyard. “It’s not every day A-Yuan comes poking around with the facade of visiting us.” When Sizhui is lost for words, she looks at him. “Well, am I wrong?”\nWhile Sizhui tries to think of what to say, Wen Ning smiles. “Jie sees through everything. Don’t worry about it! Why don’t you tell us why you came? Are you sick? Do you need something?”\nHonesty is the best policy, so eventually Sizhui settles on, “I came to ask you about someone.”\nWen Ning and Wen Qing share a look.\n“I met someone who works with you-- Dr. Wei Wuxian? He’s the uncle of a classmate.” Whatever Sizhui expected, it’s not Wen Qing rolling her eyes. \n“He’s a disaster,” Wen Qing says, tapping her fingers on her desk. “Loud, obnoxious, and unprofessional. He’s also the best pediatric surgeon in this hospital, possibly in this province. Did Lan Xichen tell you about him?”\nSizhui pauses. “Why did you assume Uncle is the one who told me?”\n“As if Lan Wangji would openly talk about anything. If you must know, Wei Wuxian was one of my classmates from Beida Medical School. He’s a genius, but his head is in the clouds. That guy almost got himself expelled multiple times, yet he managed to work his way into the operating room to prove his worth. He was doing a residency at Yiling East when-” Wen Qing pauses. “When you were brought into the hospital.”\nWhile Wen Qing deliberates her next words, Wen Ning pours some tea for Sizhui. \n“Yiling East was a small hospital very low on funding. No one wanted to work there in the long run. Wen Ruohan had his hands deep in political stuff, but he also owned a good chunk of property and businesses in Qishan and Yiling. Wei Wuxian getting assigned there was supposed to be a lesson in humility, but he managed to do the impossible.”\n“Dr. Wei still does the impossible,” Wen Ning explains kindly. \nSizhui takes a sip of his tea. He’s surprise to find that it’s the variety he had given Wen Qing over the summer. “You mentioned my father knowing him?”\nThe tapping on Wen Qing’s desk resumes. “Lan Wangji knew Wei Wuxian even before all this. I have no clue how. Even back then, they had a love-hate relationship.”\n“Jie! Don’t call it that-”\n“I’m calling it what it is. The two of them could never agree on anything, yet Wei Wuxian took such delight in bothering Lan Wangji. I don’t understand any of it. I would avoid that guy, A-Yuan. He brings trouble everywhere he-”\nThe door to Wen Qing’s office opens as if on cue. A familiar figure pushes in with his back against the door, his face buried in documents. “Wen Qing, my patient got transferred to Cardiology. I need you to look through- Oh. Am I interrupting something? Is this a party?”\nWen Qing looks exasperated. “Speak of the devil.”\n“Such high praise!” Wei Wuxian laughs. He’s clad in black scrubs underneath the white coat, looking younger than Shizui remembers. There’s a red clip holding back a handful of his bangs, as if a child had haphazardly placed it there. “Should I come back later?”\n“We were just talking about you,” Wen Ning says with a smile. He carefully accepts the files from Wei Wuxian and puts them on his sister’s desk. \nWei Wuxian turns to Sizhui. “Slander! Don’t believe anything she says about me!” He squints. “Why do you look so familiar?”\n“You have advanced Alzheimer's,” Wen Qing tsks. \n“I have a selective memory!” Wei Wuxian protests as Wen Ning tries to hide his laughter and fails. \nSizhui stands up. “Dr. Wei. We met briefly last week in Headmaster Lan’s office. Do you remember?”\n“Oh!” Wei Wuxian’s entire face lights up. “You’re Ling-er’s friend! Eh.. Lan Zhan’s kid?”\n“Idiot,” Wen Qing says. “This is A-Yuan, our cousin. Don’t you remember? You got into a fight with Director Xu at Yiling East over him!”\nWei Wuxian waits a beat, then two, before recognition flickers in his eyes. “Wen Yuan? Really? Little Wen Yuan?” His hands land on Sizhui’s shoulders as he turns Sizhui around, examining him. “You’re so tall now! Wow… That’s crazy… How are you doing? Any trouble breathing? Do you play sports? Let me see your surgery scar-”\n“That’s inappropriate!” Wen Qing cuts in when Wei Wuxian starts touching Sizhui’s coat. “This is why you’re getting passed over for the vice head of department!”\nWhile Wei Wuxian banters with his cousin, Sizhui collects his thoughts. “I’m doing fine, Dr. Wei. I don’t have any problems running. The scars are barely visible.”\n“Good!!” Wei Wuxian says. “I was so shocked when I saw Lan Zhan with you! I thought, who in the world would marry Lan Zhan? I was the only person he didn’t kill with that ice prince glare, but not for lack of trying! He never spoke to me about wanting to start a family, so I thought...” He trailed off, seemingly unaware of the implications of his rambling. \n“I-” Sizhui opens his mouth. “Father is not married.”\nWei Wuxian blinks at him. “Oh! Well. There’s nothing wrong with that! Being a bachelor is the life! A life I wouldn’t know, anyway!”\nSizhui has no clue where this is going. His mouth, however, seems to have a mind of its own. “Dr. Wei… Are-Are you seeing someone?”\n“Why? Is Old Man Lan teaming up with Madam Yu now?” Wei Wuxian straightens up, hand on his chin. He looks thoughtful. “She has too much power… I thought Jiang Cheng would be her next target for sure, but now she’s even sending kids to investigate me-”\n“What in the world are you talking about?” Wen Qing demands the same time a ruffled looking nurse comes in.\n“Dr. Wei! There you are! Dr. Xi from Endocrinology needs you. He says it’s urgent.”\nWei Wuxian’s expression changes immediately, and for once Sizhui sees someone older, more focused. “Sorry, talk to you later. Wen Qing, you’ll get back to me about the arrhythmia patient, yeah?” He barely waits for her reply before following the nurse into the hallway.\nThankfully, Wen Qing waits until the door is closed again before speaking. “That’s just how he is. Wei Wuxian remembers patient history down to the date but not their faces. He can recall articles from obscure medical journals but doesn’t remember what he had for lunch.”\n“Dr. Wei is definitely an interesting person,” Wen Ning adds. “But he’s popular with the parents and children, and his success rate is undeniably high.” \n“What’s high is my blood pressure after dealing with him.” Wen Qing says, but Sizhui is used to her roundabout way of showing approval. “So. Whatever little plan you’re formulating in that head of yours-- I want nothing to do with it. Wei Wuxian is so troublesome. It’s bad enough he forces us to go drinking with him every month.”\n“Jie!” Wen Ning laughs, already gathering jackets from the coat rack. “You enjoy those drinking sessions! You have the most fun out of all of us! Anyways, A-Yuan. It’s getting late. Let’s go get dinner as promised, mmh?”\n“Dinner sounds great,” Sizhui says. He’s thankful neither of them brings up Sizhui’s weird interaction with Wei Wuxian again, but he knows fully well this is far from over.\nSizhui needs to speak to his uncle.\nLan Jingyi may not be the most perceptive person at school, but he’s fully aware that Sizhui is Up To Something. Jingyi is no stranger to Sizhui’s contemplative moods, especially after a decade of friendship spent causing trouble (Jingyi), cleaning up the mess (Sizhui), and charming aunties along the way (a little bit Jingyi, but mostly Sizhui). Thus, Jingyi easily recognizes the subtle restlessness in Sizhui’s behavior.\nIt’s a true testament to Jingyi’s maturity that he doesn’t bug Sizhui immediately, which is what Jingyi did everyday when they were ten until Shizui told Jingyi what he wanted for his birthday. Jingyi also knows that something shifts between them and Jin Ling after the Dog Incident, and they begin seeing him more at detention, in the hallways between classes, and sometimes in the dorm common areas when Jin Ling deigns to grace them with his presence.\n“What’s so great about Jin Ling?” Jingyi asks Sizhui once, when they’re working on a literature assignment together. “He’s prickly. Do you think he’s fun to tease?”\nSizhui smiles. “No. I think you think he’s fun to tease.”\n“I don’t know what you’re talking about,” Jingyi mumbles. “And let me see your answers! I have no clue what number 4 is asking!”\nDuring their week of joint detention, Jingyi learns that Jin Ling has a weakness for fluffy things and also a habit of vehemently denying his fondness for said fluffy things. He also notices that Sizhui has taken a weird interest in Jin Ling’s family. This bewilders Jingyi because Sizhui is normally the least nosy person he knows, preferring to gather information through observation than gossip.\nJingyi really doesn’t understand the connection. Jin Ling is haughty and quick tempered, and probably a bit young to be in some of Jingyi’s classes. Sizhui, on the other hand, has been voted twice as the Class Prince according to a survey of 100 female students at Cloud Recesses conducted by Ouyang Zizhen’s sister. Not that Jingyi pays attention to these things.\nFor the most part, Jin Ling keeps to himself. Jingyi is aware of Jin Ling’s reputation even before accidentally setting his dog loose. The kids at Cloud Recess call Jin Ling spoiled and rude. They say he only entered the school due to family connections, which makes no sense to Jingyi since Cloud Recess has always been a place for rich families to feed their children. Jingyi himself had only gotten in due to a subsidized fund made available to everyone in the Lan family. Even so, most of his cousins preferred public education to the rigid rules of the boarding school.\nJingyi would feel more obligated to be a better upperclassman if Jin Ling wasn’t so unrepentant. Still, they end up unconsciously spending more time with Jin Ling -- arguing about sports in the canteen, comparing answers to their English homework after class, and cleaning the rabbit pens together in their spare time.\nOn Wednesday, Jingyi spots Jin Ling with his archery bag in the dorm halls. “Hey Hotshot! Off to practice?”\n“Practice just ended,” Jin Ling replies, the beginnings of a telltale frown obvious on his face. “I need to do maintenance on my bow.”\nJingyi eyes the black bag slung over Jin Ling’s shoulder. “Can I see?”\n“See what?”\n“Your bow, of course! Unless that’s actually your dog in that bag and you’ve smuggled him in again?”\nJin Ling flushes immediately. “Of course not!” He swings the bag around and unzips it to pull out a sleek-looking brown bow. “Here it is, the Striker RK1 60 Takedown Recurve,” he says proudly.\nJingyi asks “Can I hold it?” at the same time Sizhui appears and says, “That looks very nice.”\n“Thanks,” Jin Ling mumbles, reluctantly handing it over. He looks concerned at the way Jingyi holds the frame.\n“Don’t look so scared, I’m not gonna break it.” Jingyi turns it over in his hands. “Huh. This looks a lot like the one in the guestroom of Sizhui’s house.”\nSizhui shakes his head, a stack of papers in his arm, probably left over from his student council meeting. “I wouldn’t know about that.”\n“This is top of the line,” Jin Ling huffs, making a grabby hands motion until Jingyi returns his bow. “It can’t possibly compare to whatever you’re using as wall decoration!”\nThis elicits a thoughtful hum from Sizhui. “I don’t know about the market value. All I know is that it was a gift from Zhang Xieming to Great Uncle.”\n“Zhang Xieming?!” Jin Ling blurts out, then lowers his voice inconspicuously. He takes a step forward, the bow clenched close to his chest. “Three time Olympian? Gold medalist at the 2000 Olympics? That Zhang Xieming?”\nSizhui takes a step back. “Yes. I believe it’s the one he used in 1996.”\n“From his Olympic debut?” Jin Ling’s eyes are visibly sparkling now.\nSizhui looks mildly amused. “He’s a friend of my Great Uncle and donated it for a Lan family charity auction. Apparently some third party sellers got ahold of his later models around that time and began auctioning those off at a higher price, so Great Uncle decided to keep it.”\nJingyi remembers all the times he’d received firm looks of disapproval from Han Guang-Jun for touching it. “That old thing? We used to play around with it all the time.”\n“That ‘old thing’ is a piece of history!” Jin Ling insists. He then becomes aware of his own enthusiasm and falls silent.\nAfter a moment, Sizhui ventures, “Would you like to see it?”\n“... Can I?”\n“I’m going home with Sizhui this weekend,” Jingyi points out, remembering the jeans he’d haphazardly thrown into his overnight bag. “Why don’t you just come with us? You can look at that old-”\nJin Ling glares.\n“Okay, you can admire that piece of history while we play the new Monster Hunter Game.” Jingyi doesn’t add that he’s only staying with Sizhui on the premise of working on their history project so his mother won’t talk his ear off for slacking off all weekend.\nJin Ling considers this. “I guess … I’ll have to ask my uncles first. I usually have lunch with them on Sundays.”\n“Why don’t you come home with Jingyi and I on Friday? You can leave on Sunday morning to make it to lunch?” Sizhui suggests. “Or you can ask them to pick up? My home is a bit far from the academy.”\n“I’ll work something out,” Jin Ling says, carefully tucking his bow back into the bag. His phone vibrates then, and Jin Ling digs it out of his pockets to frown at the screen. “My mom is calling. I’ll talk to you guys later.” Then he’s gone, rushing in the direction of his room.\nIt’s not until Jin Ling disappears around the corner that Sizhui turns to Jingyi. “Thank you.”\nJingyi blinks. “What for?”\n“For being you,” Sizhui says with a soft smile. “Did you want to go over our math problem set?”\nIt’s then that Jingyi remembers his subpar grade and the ambitious vow he made about acing their next test. “Yeah!\n \n \n \n \nOn Friday afternoon, they meet Jin Ling at the main exit of the dorm. Well, more like Jingyi waits while Sizhui engages everyone that passes by in polite conversation. By the time Jin Ling shows up with his tacky gold suitcase, Sizhui has already been invited to two parties, a study group, and dinner with an overzealous first-year whose family owns half of Hangzhou.\n“Perfect timing!” Jingyi decides, looping one arm through Jin Ling’s and the other though Sizhui’s. “Sorry, Classmate Liu! We’re leaving for the weekend and have a bus to catch! Maybe next time!”\n“Slow down!” Jin Ling demands after Jingyi manhandles the two of them half the distance towards the East Gate. “Where's the fire? And why are you freakishly strong?”\nJingyi drops both boys’ arms and shrugs. “I’ve had a lot of practice. And why did you pack so much? You’re only staying for two nights!”\n“I like to be prepared,” Jin Ling huffs, rubbing tenderly at his elbow where Jingyi had previously grabbed him. His gaze moves from the simple overnight bag across Jingyi’s shoulders to Sizhui’s lone backpack.\n“There’s plenty of room for your stuff,” Sizhui reassures him as they arrive at the gate. He glances around and lifts his arm. “I already notified my father of your arrival. He instructed me to call a taxi.”\nJin Ling pushes Sizhui’s outreached arm down. “I thought we were taking the bus!?”\n“We can’t have Little Mistress Jin travel amongst commoners!” Jingyi mock gasps. Around them, students look in their direction while meeting chauffeurs at the gate, no doubt also going home for the weekend.\n“I’m not that spoiled!” Jin Ling says, his cheeks red. “I, too, can understand the proletariat spirit!”\nJingyi can’t believe what he’s hearing. “You’re not the proletariat! You’re the bourgeois!” He laughs even more when Jin Ling makes a grabbing motion at him as if to punch him, completely unthreatening. Jingyi just grips his outstretched hands and ends up swinging Jin Ling’s arms around, like Jingyi often does with his toddler relatives.\n“Our taxi is here,” Sizhui declares then, reaching for Jin Ling’s stuff. “Please don’t feel bad. The bus takes too long and my father is expecting us.” He’s already holding the door to the back seat open, so Jingyi lets go of Jin Ling.\n“After you,” Jingyi tells Jin Ling, who glares at him but scoots into the waiting car. Jingyi follows after throwing his bag into the trunk next to Jin Ling’s suitcase. He closes the door just as Sizhui finishes giving the driver directions.\nWhen Jingyi asks Jin Ling if his seat is comfortable enough, Sizhui turns around and says, “Jingyi, please behave.”\n“I always behave!” Still, Jingyi doesn’t tease Jin Ling for the rest of the ride. They miraculously make it to the entrance of the Lan neighborhood before rush hour hits, Sizhui paying the driver while Jingyi tugs both his and Jin Ling’s luggage out of the trunk.\nJin Ling grabs the handle of his suitcase and glances around. “This entire neighborhood is for your family? How many of you are there?”\n“Not the entire neighborhood,” Sizhui replies easily. He leads the way through the entrance, greeting the guards on duty who recognize Sizhui and Jingyi immediately. “This area has belonged to the Lan family for centuries, but it was reconstructed into a gated community a few decades ago. Now there’s only a dozen complexes, and only half of the buildings have been portioned off to Lans.”\n“They’re mostly older folks,” Jingyi explains as they pass by the main garden area. “Or families who have lived here for so long they don’t want to relocate. A lot of people have moved out, but the elders want to retire here, and parents like the communal amenities. Oh, Ayi! Hello!” Jingyi waves at the sight of a familiar auntie who’s holding the hand of a small child. The little boy waves back cluelessly.\nJin Ling just hums in response, looking around as he takes in the playground in the distance. He stays silent when they pass a lady pushing a stroller, the auntie welcoming Sizhui and Jingyi back while the baby makes cooing sounds at Jin Ling. “This is nice,” Jin Ling says.\n“It is,” Sizhui agrees as they arrive at the foot of the main complex. “We’re here.”\n“Do you live here too?” Jin Ling asks Jingyi while they check in at security. Once again, the guards at the desk greets Sizhui warmly.\n“Nah! My parents live three buildings down.” Jingyi shrugs once they're cleared.\nThe elevator ride to the top floor is fast, and they don’t encounter anyone else on the way up. Sizhui punches in the passcode to the penthouse speedily, and soon they’re stepping into the entryway, the light from the floor to ceiling windows illuminating the entire area.\nLan Wangji stands a feet meters away, as if waiting for them. “Sizhui, welcome back.”\n“Hello, Father.”\n“Thank you for having me, Han Guang-Jun!” Jingyi chimes in while stepping out of his shoes.\nLan Wangji shoots him the same look of passive approval he’s been giving Jingyi for years, ever since he first asked Jingyi to call him shushu. As if Jingyi could actually call one of the heirs of the Lan family “Uncle.” Jingyi’s mother, in particular, likes to remind Jingyi of how popular Han Guang-Jun is with women, children, and elders alike. Jingyi is pretty sure Shanghai Weekly even ranks the man at the top of the bachelors list, making it even harder for Jingyi to address Lan Wangji by anything but his title.\nEventually, Jin Ling gulps and adds, “Thank you for letting me stay over.” He looks almost in awe of Sizhui’s father, whose gaze sweeps across Jin Ling as if evaluating him. Sometimes Jingyi forgets how intimidating Han Guang-Jun can be.\n“No need,” Lan Wangji says evenly. “Sizhui’s friends are always welcomed. I need to take care of some business. Sizhui, show your guests to their quarters. We will leave for dinner in thirty minutes.”\nScore, Jingyi thinks as he follows Sizhui to the guest room. He knows the layout of this floor by heart, so Jingyi effortlessly opens the door and throws himself across the queen sized bed. Next to him, Jin Ling gasps as he spots the infamous bow on display on the shelves.\n“You weren’t lying,” Jin Ling whispers as Sizhui opens the display case. He touches the frame of the bow gently, as if approaching a small animal. “Wow.”\n“Is it that impressive?” Jingyi wonders, rolling over on the bed.\nJin Ling doesn’t seems to be listening, too busy turning the bow around in his hands.\n“Let him be,” Sizhui says as he goes to open the curtains. He does the regular round of checking the area for dust, but the room is spotless like everything else in Sizhui’s home. Still, Sizhui moves Jingyi’s bag from the floor to the dresser. He disappears for a moment and returns with extra blankets that he sets at the end of the bed. Also tucked under his arms is a book of some sort. “Jin Ling, you’ll be staying in my room.”\n“What?” Jin Ling turns around. “Why not in here?”\nThis is news to Jingyi too. He knows for a fact that this penthouse has no less than five spacious rooms belonging to Han Guang-Jun, Ze Wu-Jun, and Sizhui. Not to mention the private study and this guest room. The living room and kitchen combined are large enough to cover Jingyi’s parents’ entire unit.\n“We only have one bed in here, and I can’t ask you to share with Jingyi. So you will be sleeping in my room.”\nWhen Jin Ling begins to argue, Sizhui pulls out the book, which turns out to be a photo album. “I told my uncle about the bow, and he suggested I look through these albums. They may contain photos of Zhang Xieming with Great Uncle. Would you like to take a look?”\n“Yeah!”\nSizhui takes a seat on the edge of the bed and Jin Ling follows. Even Jingyi feels obligated to sit up as well, peering over Sizhui’s shoulder as he opens the cover.\nThe album begins with faded photos of a younger Headmaster Lan. Jingyi can’t believe his eyes as he’s faced with undeniable proof that once upon a time, Headmaster Lan’s face wasn’t permanently glued into a frown. The photos must be from at least three decades ago, for most of the pictures include faces Jingyi has never seen before or doesn’t recognize. Jin Ling’s hero appears soon enough, arms folded as he stands side by side with Headmaster Lan, both of them caught mid-laughter. Sizhui carefully removes the photo from the plastic covering and turns it around to reveal a handwritten message from the archer.\nWhile Jin Ling reads over the scribbled note, Sizhui continues perusing. There are a few empty pages before the paper quality changes drastically, and the pictures begin featuring two almost identical looking boys.\nJingyi squints. “Oh my god! Is that Ze Wu-Jun and Han Guang-Jun as kids?”\n“Oh,” Sizhui says softly, touching the protective covering. “I’ve never seen these before.”\nThis is gold, Jingyi thinks as he urges Sizhui to continue. They’re awarded with a few more adolescent snapshots of the famous brothers before coming across a photo of them standing in front of the Cloud Recesses gates, Headmaster Lan posing behind them. Even more baffling is the next page containing a commemorative photo from a competition of some sort, the subjects all standing in front of a podium.\n“Wow. Han Guang-Jun must be around our age here.” Jingyi blinks at the sight of a familiar jawline and sharp eyes. “Why does this guy look so much like Jin Ling?”\nJin Ling turns his attention back on them. His gaze drops down to the album for a second before his mouth opens. “T-that’s my dad!”\nOn second thought, the resemblance is almost uncanny. They can pass for brothers, even, with the way Jin Ling’s father is pseudo-glaring into the camera. Looking constipated must run in the family, Jingyi thinks.\n“Wait, that’s Xiaojiu!” Jin Ling says, pointing at someone at the end of the lineup. He then points at the figure standing next to the young Han Guang-Jun. “And that’s Dajiu!”\nSizhui and Jingyi put their heads together to look. Sure enough, a young Wei Wuxian stands to the right of Sizhui’s father, an insufferable grin on his face as he holds what appears to be the first place trophy. At the end of the photo is Jiang Cheng, looking like he wants to hit Wei Wuxian with said trophy. Lan Wangji’s own expression is unreadable.\n“I need to take a photo of this,” Jin Ling decides, pulling out his phone. He looks at Sizhui for a moment. “Can I?”\nSizhui moves the album towards Jin Ling in response.\nJingyi tests his luck. “Can I take a photo of Headmaster Lan without his goatee?”\n“I’d prefer if you didn’t,” Sizhui says with a grimace, which is about what Jingyi expects.\nThey’re already done with the album when Lan Wangji appears in the doorway. His eyes linger on the cover for a moment, but he does nothing to address it. “It is time for dinner.”\nJin Ling seems to have other plans. “Han Guang-Jun! Do you know my dad?”\nThe room is silent for a good minute as Lan Wangji stares at Jin Ling, who straightens his spine under his scrutiny. “I was schoolmates with your father.”\n“And my uncles?”\n“Jiang Wanyin and Wei Ying too.”\nWhen it becomes obvious that his father will not offer any more information, Sizhui gives Jin Ling an apologetic smile. “Let’s get going.”\nJingyi nudges Jin Ling a little, but Jin Ling doesn’t deflate until after Lan Wangji leaves the room. The three of them follow him into the foyer for their shoes, and then down the escalator where Sizhui updates his father on the bow, the photo of Zhang Xieming, and his alleged connection with Headmaster Lan.\n“Uncle is acquainted with many people,” Lan Wangji says while they walk towards a family restaurant outside of the neighborhood. He gives Jin Ling a look. “He will tell you about Athlete Zhang if you ask.”\nJin Ling shrinks a little under his gaze. “Headmaster Lan said he doesn’t want to see me or my uncle again!”\n“Was Dr. Wei a troublemaker?” Jingyi asks as they’re nearing the restaurant. It’s a popular spot, hovering in between a casual street shop and somewhere stuffy and upscale.\n“Wei Ying was … the worst,” Han Guang-Jun says before the proprietor appears and welcomes them inside. When he doesn’t elaborate, Jin Ling mumurs something along the lines of, that sounds about right. \nThey’re seated at a table towards the back of the shop, the other patrons chatting amicably around them while Sizhui and Jingyi are tasked with ordering.\n\"What would you like to eat?\" Sizhui hands a menu to Jin Ling, who scans rapidly through the options before replying that anything is fine. Jin Ling is obviously being overly polite, as if he's afraid of mistepping.\n\"Alright,\" Sizhui says and puts in the orders with the waiter. In the time it takes for their side dishes to come, Sizhui updates his father on his studies, the state of the student council, and the rabbits. The only reaction he elicits is a noise of acknowledgement. Sizhui and Jingyi are used this, both of them having grown up with Lan Wangji as a quiet but firm presence. This, however, only seems to stress Jin Ling more, and their little mistress looks almost startled by the time the food comes out.\n\"Is it not to your liking?\" Lan Wangji asks after a soup noodle dish is placed in front of Jin Ling.\nJingyi peers over at Jin Ling, who can barely lift his eyes up to meet Lan Wangji. Instead, he stares resolutely at the soup, a signature dish the shop is famous for. Even though the entire Lan family has bland tastes, Jingyi knows for a fact that the noodle soup is perfectly savory.\n\"I can order something else,\" Sizhui offers the same time his father pushes the chili oil bottle on the table towards Jin Ling.\nAfter a moment of silence, Jin Ling accepts the bottle and adds a few drop to his food. “T-Thank you.”\n\"There's no need to be so formal. You are Sizhui's friend and I am acquainted with your parents.\"\nFor a moment, Jingyi is afraid Lan Wangji ask Jin Ling to call him \"Lan-Shushu\" which would actually kill Jin Ling with embarrassment. Still, the relief on Jin Ling's face is obvious as he begins eating. He doesn't even protest when Sizhui moves some of the side dishes closer to Jin Ling, reminding him to eat slowly.\n\"How did you know he wanted the chili oil?\" Jingyi asks with a mouthful of his own noodles.\nLan Wangji puts down his tea cup. \"Just speculation.\"\n\"My mom's side of the family all like spicy food,\" Jin Ling explains. \"My dad has low tolerance though, so I inherited my mom's genes.\" He looks almost proud at this. \"Laolao is from Meishan, right outside of Chengdu, so she can outeat anyone with it comes to mala except...\"\nJingyi raises an eyebrow. \"Except?\"\nThe conversation is interrupted when the waiter returns with more hot water for their tea, which reminds Jingyi of the time the Chinese Tea Club tried to cook their own Pu-erh tea. He shares the story of how the failed fermentation attempt led to the chemistry classroom to smell for weeks. \"The vice president of the club tried to give away the rest. She's my biology lab partner and gave me cookies with pu-erh baked into them!\"\n\"They were very unique,\" Sizhui says.\n\"They were nasty!\"\nDinner continues with Sizhui and Jingyi taking turns sharing anecdotes from school. Lan Wangji listens dutifully, but it's Jin Ling who seems most interested in their stories. \"Is Lanling so boring that nothing interesting ever happened at your school?\" Jingyi asks when Lan Wangji goes to pay the bill.\n\"I don't know,\" Jin Ling says, tugging at the end of the table clothes. \"I was homeschooled by private tutors. Nainai wanted to send me to boarding school in America, but my parents convinced her that coming to Cloud Recesses was better.\"\n So rich people have their own brand of problems, Jingyi thinks. \"Why America? You're not even good at English.\"\n\"I know!\" Jin Ling says, his voice more relieved at the acknowledgment of the truth than annoyed.\nThe walk back to the complex is peaceful, and they encounter a handful of people in the courtyard taking evening strolls. When Lan Wangji gets pulled into conversation with an elderly grandpa, he instructs them to go home first. Sizhui leads them back inside, where he turns on the lights and carefully adjusts all the curtains. The penthouse itself is pretty bare, filled only with essential but artisanal furniture. Sizhui is showing Jin Ling the switch for the heated floors when the door opens, and Lan Wangji appears with an unexpected visitor.\n\"M-mom?!\" Jingyi gapes. It's not the first time his mother has visited, but she usually doesn’t interrupt sleepovers. Jingyi closes his mouth immediately at the sight of a box tucked under her arm. \"What are you doing-\"\n\"Oh, stop acting!\" Jingyi's mother huffs, hands on her hips as she ascends on Jingyi. \"You think I wouldn't notice the charge on your father's card? Just because he's scatter brained doesn't mean I am! I was wondering there you mailed this thing, but thankfully I ran into Han Guang-Jun a couple of days ago at the mailboxes and saw him take this out!\" She thrusts the game in Jingyi's face. \"Lan Jingyi, where did you learn to be such a troublemaker?!\"\nJingyi really should've asked Sizhui to order the game for him. His mother catches on immediately to his train of thought, and her hand lands on Jingyi's ear before twisting it. \"Ouch! Mom! That hurts!\"\n\"Good! I'm confiscating this game! You're not allowed to play it until you raise your mathematics grade! Honestly, math was my best subject at school. I don't know where you get your bad genes from, probably from your dad!\"\nSizhui, in a charitable act truly befitting of the Class Prince, takes pity on Jingyi and steps in. \"Ayi, maybe you should let him go.\"\nThe grip on Jingyi's ear loosens, and Jingyi automatically goes to massage his poor ear. This is so embarrassing. Even Jin Ling is doing his best not to laugh.\n\"You too, Sizhui! Don't just go along with my son’s plans!\"\nSizhui puts his hands up to placate her. \"It's not Jingyi's fault. I um, I also wanted to play the game.\" It's an obvious lie that no one bothers to point out.\n\"Either way,\" Jingyi's mom continues. \"I'm already late to go dancing at the square. Lin-Ayi is waiting for me downstairs. I can’t believe you, making me come all the way up here...\" She sends Jingyi one last glare before pulling a bag of fruit out of her large purse and thrusting it into Sizhui's arms. \"Here are some clementines. They're really sweet. You boys share this.\"\n\"Mom, we don't want-\"\n\"Eat it or I'm flushing your game down the toilet!\"\nJingyi grabs the bag from Sizhui. \"I'll eat it!\"\nHis mom narrows her eyes for a moment. \"Share with Sizhui and Young Master Jin. Anyways, message me if you need to come home. Your father is off playing mahjong again and I don't know when I'll be back. Han Guang-Jun, don't hesitate to send him home if he causes any more trouble for you!\"\nLan Wangji, who has stayed blissfully silent the entire time, gives her a nod. Still, the ends of his lips are pulled up by a fraction, and he clearly finds this whole exchange entertaining. Jingyi really can't get a break.\nThankfully, his mom takes her leave, but not before giving Jingyi one last warning. The door is barely closed when Jingyi collapses dramatically on the couch.\n\"Sorry.\" Sizhui pats him sympathetically on the arm.\n\"Why are you sorry?\" Jingyi wants to know. Still, he feels the need to apologize to Lan Wangji for the disturbance.\nSizhui's father just hums. \"No need.\"\n\"Eh,\" Jin Ling says, taking a seat next to Jingyi. \"Was that the game you were gonna play?\"\nJingyi nods pitifully.\n\"So what will you do now?\"\n\"Eat the fruit, I guess.\"\nLan Wangji sets a serving plate on the table. \"Sizhui, I'm retiring to the study. Take care of your guests.\"\n\"Yes, Father.\" Sizhui is already bringing napkins and cups of water over. He waits until his father rounds the corner before a smile breaks across his face, and Sizhui has to hide his laughter in his hands while Jingyi shoves him.\n\"It's not funny!\" Jingyi cries.\n\"It was pretty funny,\" Jin Ling says.\nJingyi doesn't even have the energy to argue, so he mopes while Sizhui turns on the TV. The three of them move to sit on the now-heated floor, each taking one side of the low table and peeling the clementines.\n\"My mom is always like this,\" Jingyi mumbles, playing with a length of pith. He looks up when Jin Ling deliberately clears his throat. \"What?\"\n\"Can I ask something?\"\n\"You just did.\" Jingyi grins when Jin Ling half glares, half pouts.\nJin Ling turns to Sizhui, looking conflicted. \"Where is your mother? No one has mentioned her, but there's no sign of a memorial alter here...\"\nThis is definitely not what Jingyi expected. In fact, it's been years since Jingyi has heard anyone address the absence of a mother in front of Sizhui, the extended Lan family having instructed their children not to probe.\nSizhui looks surprised too. Eventually, he says, \"My parents passed away in an accident when I was four. I was adopted.\"\n\"Oh,\" Jin Ling says quietly. \"...Sorry\"\n\"There's no need for you for be sorry,\" Sizhui reassures him, but Jin Ling just looks even more upset for bringing the topic up.\nJingyi, of course, already knows all this. He'd known about Sizhui's situation ever since they were eight and he'd gotten them both in trouble for scattering a box of legos. That night, Jingyi's mother had responded to Jingyi's declaration of Sizhui is my new best friend with the warning he must never pry into Sizhui's past. Still, Sizhui was the one who told him everything, his voice unnaturally even and calm for a child as they tried to hide evidence of the lego spill in a vase.\nAll three of them are quiet for a moment before Jin Ling puts a neatly peeled clementine in front of Sizhui. It's a cute gesture of apology, and Sizhui accepts gratefully. \"Actually,\" Sizhui says. \"Your uncle was my doctor. It's thanks to him I'm still alive.\"\nThis, Jingyi didn't know. He turns to Sizhui, but finds that he doesn't know what to say for once.\n\"It's not thanks to him,\" Jin Ling speaks up after a while.\nSizhui blinks. \"Pardon?\"\n\"Patients send Uncle gifts all the time, saying this and that about how he saved their lives, but he says they put too much faith in him and not in themselves. I mean, sure, he's a doctor. But, Lan Sizhui, you were alive because you had parents, and now you're alive because you have Han Guang-Jun and because of yourself. No one else can make you live the life you want. So, eh, give yourself some credit.\"\nJingyi understands what Jin Ling means, but he's still surprised by his thoughtfulness.\n\"Thank you,\" Sizhui tells Jin Ling again, this time with more feeling.\nJin Ling looks flustered at his own rant, and he goes back to peeling clementines while Fei Cheng Wu Rao plays on the television. They return to bickering when Jingyi starts commentating through the episode, and Jin Ling immediately starts arguing with Jingyi about the male contestants.\nThey spend the rest of the night watching reruns until Jin Ling yawns very obviously, and Sizhui insists Jin Ling rests. It's already midnight when Jingyi finishes washing up and climbs into the guest room bed, where Sizhui is scrolling through his phone.\n\"Hey,\" Jingyi says when Sizhui sets his phone down. \"Jin Ling is right, you know.\"\n\"About what?\"\n\"You don't owe Han Guang-Jun everything. He raised you because he wanted to, not because he wanted you to be indebted to him.\"\nSizhui looks down at the frayed ends of his old t-shirt. \"I know, but I feel like I do.\"\nJingyi kind of wants to shake Sizhui, but he settles on poking him in the shoulder. \"Everyone feels grateful for their parents, but you have this, like, extra sense of guilt. I mean, do you think you ruined Han Guang-Jun's life or something? It's not like he chooses not to get married because of you. I'm pretty sure you add value to his life, not the other way around!\"\nWhen Sizhui doesn't respond, a thought occurs to Jingyi. \"Is that why you're been so mopey lately?\"\n\"Jingyi,\" Sizhui says instead, grabbing Jingyi's finger until they're holding hands. \"Thank you.\"\n\"Hn! See, I do have good ideas. I don't want to hear anyone else say you're the brains and I'm the brawn.\"\nThis makes Sizhui laugh. \"No one has ever said that!\"\n\"That’s what you think,\" Jingyi says, hiding his grin by turning around. \"Let's go to sleep!\"\nIn the morning, Sizhui wakes both Jingyi and Jin Ling up with the promise of food. They enter the dining room to find Lan Wangji sitting at the table with freshly made congee and a variety of pickled dishes. \"Father made this,\" Sizhui says while setting the table. \"Come eat while it's still warm.\"\nWhile Jin Ling runs a finger through his horrible bedhead , Jingyi digs in, heedless of his own morning hair. They eat in comfortable silence until Lan Wangji declares that he has business to take care of today.\n\"Sizhui, take your friends out for dinner.\" He leaves cash on the table before heading out for the day, his white coat looking immaculate.\n\"What should we do now?\" Jin Ling asks after breakfast, when Sizhui is washing the dishes.\nWith Jingyi's original plan of playing Monster Hunter all weekend ruined, they take a moment to come up with a new itinerary. After the dishes are done, they dress for a day outing and take Jin Ling to the nearby park where more than one person lets Jin Ling pet their dog. In the afternoon, Sizhui leads them to his favorite musical instruments store, where Sizhui purchases new guqin strings while Jingyi pokes around. They have shaved ice at a local shop, the three of them sharing flavors after Jingyi demands to try Jin Ling's. After that, they wander back to Sizhui's house and spend the afternoon marathoning the 1995 version of The Chinese Odyssey.\nIt's nice, really, to have a quiet day away from school. At Jingyi's insistence, they order KFC for dinner. All three of them stay up way too late watching some Hollywood series with bad dubs. Eventually, they give up and switch to the original audio, Jingyi dubbing over dialogue with incorrect translations until Jin Ling throws a pillow at him.\nWhen Sizhui suggests Jin Ling retires for bed, Jin Ling frowns. \"I'm not a child! I can stay here with you guys.\"\n\"If you're not sleeping in Sizhui's bed, then I am!\" Jingyi jokes, only for Jin Ling to tug him back. They somehow start wrestling, which ends with Jingyi holding Jin Ling in a headlock and Sizhui trying to separate them.\nJingyi honestly doesn't remember how they all fell asleep in the guest room, but he's rudely awoken in the morning to a sore back and the sound of laughter. He glances up and realizes that (1) he'd fallen off the bed during the night and (2) Jin Ling's uncle is now standing at the door way, next to Lan Wangji.\n\"Looks like you kids had too much fun,\" Wei Wuxian says, no doubt having been let in by Sizhui’s father when he came to fetch Jin Ling. \"Having fun, A-Ling?\"\n\"Ack!\" Jin Ling shouts, shooting up in the bed and knocking his head into Sizhui's shoulder. \"Get out!\"\nThis just sends Wei Wuxian into another fit of laughter. \"And to think I woke up early just to come pick you up. Lan Zhan, let's wait elsewhere. \"\nLan Wangji levels all three of them with a firm look before turning to Wei Wuxian. \"I have tea.\"\n\"I would love to have tea with you while my silly nephew gets ready,\" Wei Wuxian says. He gives Jin Ling a wink before following Lan Wangji.\n\"I can't believe we overslept so much.\" Jingyi checks his phone to find it out of battery. He lies back on the ground as Jin Ling jumps down from the bed, stepping around Jingyi as he runs back into Sizhui's room. Sizhui follows Jin Ling out, but instead of heading towards his room, he tiptoes through the hallway. Jingyi, for lack of anything else to do, follows.\nThey're both in the hallway, out of sight, when Wei Wuxian's voice carries over.\n\"Lan Zhan! I didn't know you had this tea! It's my favorite! None of the stores in Shanghai carry it. Where did you get this?\"\nSilence, followed by, \"It was a gift.\"\n\"Always so verbose, huh? Did Ling-zi behave while he was here?\"\n\"He was fine. I was out most of the day.\"\nA gasp. \"Lan Zhan! You gotta keep an eye on my little dumpling! Who knows what kind of trouble they can get up to!\"\n\"Sizhui has never misbehaved.\"\n\"Wow, so much faith in A-Yuan! You never afforded me the same courtesy when we were in school! Remember how you always caught me when I was out of the dorms past curfew? I swore you were following me! And then you got us both in trouble!\"\nA-Yuan? Trouble? Jingyi can't imagine their Han Guang-Jun breaking any of the rules at Cloud Recesses, much less spend time with someone as loud as Jin Ling's uncle. A quick glance at Sizhui confirms that he's thinking the same.\nAfter a moment, when it becomes obvious Lan Wangji doesn't plan on responding, Wei Wuxian speaks again. \"Can you give me a tour?\"\n\"Fine.\"\nJingyi and Sizhui immediately duck into the bathroom. They can hear Wei Wuxian's continuous, one-sided chatter as Lan Wangji shows him the living area, the music room, and finally the study. It's not until the door to the study is mostly closed that Jingyi and Sizhui emerge from the bathroom, both of them quietly making their way through the hallway again.\n\"Wow. This place looks almost exactly like the historical fiction section of the library!\"\n\"Hn.\"\nWei Wuxian laughs. \"It brings back memories, mostly bad ones. Remember how we were stuck in the library for a month?\"\n\"... Was it bad for you?\"\n\"Well, not all bad. Copying the rules sucked, but you were fun to tease, Lan Zhan!\"\nWho in the world dared to tease Lan Wangji? Jingyi's head is swimming with questions when he hears the soft padding of feet behind him. He turns around to find Jin Ling standing in the hallway, looking at the two of them strangely.\n\"What are-\"\nSizhui immediately shushes him with a finger on his mouth. To his credit, Jin Ling doesn't protest much and just looks at them like they're crazy.\n\"That's nice,\" Wei Wuxian's voice carries out once again. He seems to be picking up something, and Jingyi cranes his neck enough to see their backs as Wei Wuxian holds a picture frame in his hands. \"I didn't know you were the type to press flowers, Lan Zhan.\"\nNo response.\n\"Come to think of it, this reminds me of the ones outside of the library pavillion. Do you remember them?\"\n\"Hn.\"\nWei Wuxian is right. Cloud Recesses still maintains a healthy patch of flowers outside of the library, carefully tended to by the gardener.\n\"Do you remember when I stuck those flowers in your hair?\" Wei Wuxian is laughing now, obviously recalling a fond memory. \"I took a photo as evidence to show the others, but we ended up fighting over my disposable camera and breaking it! No one believed me when I said you broke it!\"\nSizhui seems to be overwhelmed by the image of flowers in his father's hair, because he covers his mouth entirely to prevent any sounds from escaping. Jingyi thinks this must be a joke, but even Jin Ling is silently mouthing what the fuck. Jin Ling presses further and further to get a good look, practically using Jingyi's back as an armrest.\n\"After all,\" Wei Wuxian continues. \"No one else got a glimpse of your cute angry face, Lan Er Gege!\"\nJingyi chokes on thin air at the sound of such a shameless pet name. He goes down with a cough, lungs hacking as Jin Ling also loses his balance on top of him. Sizhui tries to help, but the three of them end up collapsed on top of each other with a loud thud, Jingyi gasping for air as he rolls out from underneath Jin Ling.\n\"See?\" Wei Wuxian says when he's standing in the doorway with Lan Wangji. \"I told you to keep an eye on them.\"\nJin Ling stands up and brushes nonexistent dust off him. \"I'm ready to go,\" he declares as if he wasn't just caught eavesdropping.\n\"I bet you are,\" Wei Wuxian says, setting a hand in Jin Ling's hair which he abruptly bats away. When Jingyi snickers, Wei Wuxian gives him a knowing smile. \"Lan Zhan, we've taken up enough of your time. Plus, Jiang Cheng will be mad if we're show up any later. Come on, Ling-zi.\"\n\"Don't call me that,\" Jin Ling mumbles, but follows Wei Wuxian towards the door anyway with his suitcase. He dwindles a bit longer when Sizhui’s father goes to see him off, both Jin Ling and Wei Wuxian thanking him for the hospitality.\nJingyi stays painstakingly silent until the door is closed and Lan Wangji has retreated to his study. He then turns to Sizhui. \"What the heck is going on?!\"\nOn Wednesday, Sizhui is roughly tugged by the arm from his evening student council session and shoved into Jin Ling's room for the inaugural meeting of Operation: Old Men.\nAll Sizhui can think about, besides the sheer size of the private suite, is how Jin Ling was right about Jingyi having unnatural arm strength. Sizhui is still rubbing absently at his forearm when Jingyi forces him to sit on the couch, next to a large stuffed husky plush. \"That's cute,\" Sizhui says for lack of anything else.\nJin Ling grabs the plush immediately and throws it into his bedroom, face red. He then clears his throat. \"Lan Jingyi and I have been talking-\"\n\"Planning,\" Jingyi cuts in.\n\"Strategizing,\" Jin Lin corrects. \"We think something is going on with my uncle and your dad.\"\nAh. Sizhui hadn't expected this type of response, especially after Jingyi's incredulous reaction and Jin Ling's tight-lipped behavior since they all returned to Cloud Recesses that Sunday. Sizhui had thought that he had read too much into Wei Wuxian's interactions with his father or was simply imagining things. \"I see.\"\nJingyi flops down the couch and spreads his legs. The white blazer of his uniform jacket is already gone, and his blue tie is now crooked. Sizhui resists the urge to straighten it for him. \"No, seriously! Something is going on!\" Jingyi says.\n\"No, I meant-I see it too,\" Sizhui says. \"But, I'm not quite sure what it is, and Father doesn't like to talk about his feelings.\"\nJin Ling responds by crossing his arms and huffing, \"Well! I did some digging and contacted my sources. Look!\" He pulls out his phone and opens up his WeChat history.\n \n3:04 PM\nJin Ling: dad\nJin Ling: DAD\n6:34 PM\nJin Ling: DAD !!!\n金子轩: What is it, A-Ling?\n金子轩: You know I'm busy at work\n金子轩: Do you need me to transfer more money into your account at school? Do you need something?\nJin Ling: what?\nJin Ling: no\nJin Ling: do you know what's going with dajiu and han guang-jun?\n金子轩: ?\n金子轩: Lan Wangji?\n金子轩: Did Wei Wuxian do something to offend him again?\nJin Ling: what?\n金子轩: I don't know. Ask your mother.\n \n\"Wow,\" Jingyi mutters. \"All fathers are the same, huh? What did your mother say?\"\n \n7:02 PM\nJin Ling: mom do you know what's going on with dajiu and han guang-jun\n江燕子: A-Ling! Did you eat dinner? ^^\nJin Ling: i ate already\n江燕子: Okay! Don't skip your meals! Let myself or your father know if you need more money on your dining card!\n江燕子: The twins have been so picky lately. They won't eat anything too salty or too bitter.\n江燕子: Oh, Tiantian wants to talk to you\n江燕子: [AUDIO]\nJin Ling: yeah, tell her i miss her too\nJin Ling: i don't need more money\nJin Ling: anyways do you know anything about what i asked?\n江燕子: About A-Xian? Why don't you just ask him?\nJin Ling: he never gives me straight answers!\n江燕子: [Confused Cat Sticker]\nJin Ling: mom im serious! do you know anything?\n江燕子: Well, your Daijiu and Han Guang-Jun have been rivals since their school days. They have a very interesting friendship. That's all I know for sure ^^\nJin Ling: mom what does that mean?\n8:01PM\nJin Ling: mom????\nJin Ling: [Sad Cat Sticker]\n江燕子 Sorry, A-Ling. The twins wanted me to read to them before bed. Why don't you ask A-Xian if you have questions?\n \n\"Nice stickers,\" Jingyi says, which makes Jin Ling punch him in the arm. Jingyi doesn't even wince at the force of it.\nSizhui rereads the messages. \"Do you think your mother is hiding something?\"\n\"She's not the type to give me answers easily,\" Jin Ling mumbles. \"That's why I hate asking her for help on my homework... She always makes me think.\"\nJingyi tugs the phone out of Sizhui's hands and scrolls up. \"So is that it?\"\n\"Keep reading!\"\n \n11:25 PM\nJin Ling: shushu can i ask you something?\nMeng Yao: A-Ling? Do you need something?\nJin Ling: do you know han guang-jun?\nMeng Yao: Lan Wangji? I am acquainted with his brother\nJin Ling: ok that's a stupid question\nJin Ling: you know everyone\nMeng Yao: What did you want to ask?\nJin Ling: you know my dajiu right?\nMeng Yao: Dr. Wei?\nJin Ling: yeah do you know if there's something going on between him and han guang-jun?\nMeng Yao: Your father is the one who went to school with them. Wouldn't it be better if you asked him?\nJin Ling: urg\nJin Ling: nevermind\nMeng Yao: You should go to sleep soon. Staying up late is bad for you.\nJin Ling: shushu!!!\nMeng Yao: The early bird gets the worm. Good night!\n \n\"No luck either, huh?\" Jingyi clicks on the button that takes them back to the main chat screen. A new message is highlighted, and Jingyi opens it after receiving a nod of approval from Jin Ling. \"Is this your cousin or something? An aunt?\"\n\"That's my xiaoshu! That's just what he looks like!\"\nSizhui peers over Jingyi's shoulder. Jin Ling's father and shushu had used generic headshots while his mother had a photo of a swallow in her profile picture. This new user, however, had a very androgynous looking profile photo of someone wearing faint red makeup.\n\"How many uncles do you even have?\" Jingyi demands. He doesn't complain when Sizhui takes the phone from him.\n \n7:20 AM\nJin Ling: xiaoshu pls tell me you know something\nJin Ling: what the heck is going on with dajiu and han guang-jun???\nMo XY: Good morning, A-Ling!\nJin Ling: come on you are my last hope\nJin Ling: i know you know some gossip\nJin Ling: or something!\nMo XY: Han Guang-Jun as in Lan Wangji?\nMo XY: I know he's... Very handsome?\nMo XY: Oh. His baidu profile photo is very...\nJin Ling: stop checking him out! so do you know him or what?\nMo XY: I think Huaisang went to school with him\nJin Ling: can you ask him\nJin Ling: ask him if he knows my dajiu too\nMo XY: I will~\n3:12 PM\nMo XY: Are you sure you want to know?\nJin Ling: tell me!!!\nMo XY: Huaisang said he sold Wei Wuxian some porn magazines and Wei Wuxian snuck them into Lan Wangji's desk. They both got in trouble and served a month of detention together.\nJin Ling: what\nMo XY: Huaisang also said he was one of the founders of the Cloud Recesses student newspaper but he used it as a front to smuggle goods in school\nMo XY: Actually, I shouldn't be telling you this\nJin Ling: xiaoshu don’t be like this!\nMo XY: I'm gotta go! Talk to you later~!\n \n\"Huh.\" Jingyi rubs his chin thoughtfully. \"Fascinating.\"\nJin Ling sighs. \"There's one more person.\"\n \n11:30 AM\nJin Ling: what happened between dajiu and han guang-jun??\nJiang Cheng: I don't know and I don't care\n \nJingyi is quiet for a moment before speaking up, \"Your sources are just your family members?\"\n\"At least I didn't ask my sisters!\"\n\"Your sisters are babies!\"\n\"You're a baby!\"\nSizhui cuts in then, putting his hands up. \"Can we please focus? I think Jin Ling's family confirmed that there was some history between them, although they didn't provide details.\"\nThis makes Jingyi snort. \"You're all amateurs! While Little Mistress J-\"\n\"You wanna die?!\"\n\"While Little Mistress Jin was busy chatting up his three hundred uncles, I did some actual investigative work!\" He pulls a stack of newspapers out of his bookbag. \"Jin Ling said Wei Wuxian was only in school for a year, right? So I went to the library and pulled all the publications from the student newspaper from the year he was here.\"\nJin Ling stops frowning and begins flipping through the stack. \"What did you find?\"\n\"Officially? Nothing much. Just an article from that archery competition.\" He shows them a darker, aged copy of the competition photo they'd seen at Sizhui's house. \"Remember what your xiaoshu said about the newspaper? I thought it was weird that the newspaper kept printing ads for very specific things like a bundle of pencils and a pack of coke flavored popsicles.\"\nThe issue Jingyi shows them has a sidebar on page 3. It's a fairly normal looking ad about a student looking to sell his calculator. However, the descriptions are weirdly specific and littered with strange word choices. Sizhui pauses. \"Are you saying this was code for the smuggling ring?\"\nJingyi shrugs and extracts another issue from the top of the pile. \"Who knows? But look at this! Usually the ads are people looking to sell or buy physical objects, but this one is from someone name Mianmian advertising her group!\"\n\"Year long study group for Human Psychology class. Meet at Phoenix Mountain?\" Jin Ling reads from the page. \"What the heck is Phoenix Mountain? And there's no such thing as a psychology class here, is it?\"\nThere's something very off about the snippet, Sizhui agrees. He thinks for a moment. \"Is Phoenix Mountain a real landmark?”\nSome shuffling ensues as Jingyi procures his phone. \"I wondered about that too! So I looked up ‘Phoenix Mountain' and you're not gonna believe what I found! I mean, besides nature photography! Guess!\"\n\"Just tell us!\" Jin Ling snaps.\n\"Fine! What I found was a locked Baidu Tieba full of Cloud Recesses gossip! I have no clue who's managing it but it's still active! There's even a whole thread about people wanting to date Sizhui which I... Eh. Totally didn't read or anything!\"\nSizhui can feel his face heat up. \"Jingyi!\"\n\"Anyways! I had to beg A-Qing from Class 3-C for the password. She is not easy to please, let's just say that. Anyways, I was up late looking through the archive threads. A lot of them have been deleted or closed, but there were a few from the year Wei Wuxian was in school. The only problem is that everyone used codenames to chat.\"\nWhen Jin Ling goes to load the tieba page on his desktop with the large monitor, Sizhui turns to Jingyi. \"Good work.\"\n\"Yeah?\" Jingyi grins. He has always been selectively attentive, but even Sizhui is impressed by this turn of events. \"You can call me Detective Lan. Maybe I should open my own investigative agency.\"\n\"Maybe you just watched too many episodes of Detective Conan,\" Jin Ling says. He gestures for the other boys to huddle around him before scrolling down the touchscreen monitor. \"Urg. These usernames are so annoying. Who the heck is Blind4Love04?\"\nJingyi bats Jin Ling's arm away until he's in charge of navigating. \"Look at this thread from 18 years ago!\" He points to Xianxian and 2Jade.\nBoth Sizhui's father and uncle have been hailed as traditionally handsome by the media, to the point where they were often referred to as the \"Twin Jades\" of the Lan family. Sizhui had no clue this nickname originated more than two decades ago. Regardless, there's no doubt in Sizhui's mind that \"2Jade\" is a codename for his father. A quick glance at Jin Ling's annoyed expression confirms that \"Xianxian\" must refer to Wei Wuxian.\n\"Well?\" Jin Ling asks. \"What are you waiting for? Let’s see it.\"\n09-11-20XX\nCxn1223: Hasn’t our 2Jade been extra expressive lately?\n     m1@n_2: Because of Xianxian!\n          Cxn1223: Xianxian is really trying hard to befriend 2Jade!\n               m1@n_2: Watching them is so much fun\n     264jjj: He always looks constipated\n     Jianbingbing: Handsome! Handsome! Male God!\n     Ok1983v: He’s going to kill that guy one of these days\n               Cxn1223: They’re either going to kill each other or fuck each other!\n                    Ok1983v: Are you crazy? 2Jade hates him!\n                         Cxn1223: There’s a thin line between love and hate~\nOk1983v: Am I the only one who sees that they hate each other???\n     m1@n_2: Yes\n     264jjj: Debatable. 2Jade acts like he hates everyone. I bumped into him in the halls and thought he was going to kill me with that glare. Xianxian (I hate this nickname by the way) seems to get on his nerves even more than the rest of us commoners\n     P0tato: There’s something between them but I can’t tell if it’s hatred or sexual tension or just Xianxian being obnoxious.\n \n09-19-20XX\nJianbingbing: I SAW IT! I SAW IT! I can’t believe I saw it with my own eyes! The magazine!\n     264jjj: 2Jade….\n     Ba0ba09: There’s no way that belongs to him!\n     Ok1983v: Old Man Lan looked like he was about to snap\n     m1@n_2: Did you see how Xianxian burst out laughing?\n          Jianbingbing: How can he do that to 2Jade (cry)?\n          Jianbingbing: His reputation!!!!\n               Ba0ba09: Everyone knows Xianxian planted it in his bag lol\n               Cxn1223: Xianxian really can’t stop bothering 2Jade huh?\n \n09-19-20XX\nSJH888: I was in the library tonight and Xianxian was definitely... Hitting on 2Jade and calling him Lan Er Gege\n     Cxn1223: LAN! ER! GE! GE!\n     264jjj: Wow\n     P0tato: This is too much… How is this real? Homosexuals in Cloud Recesses? No matter what, I just can’t accept it….\n          Cxn1223: It’s 20XX….\n          m1@n_2: No one is asking you to accept it. Just shut up.\n     Jianbingbing: HE IS RUINING! RUINING! Our beloved 2JADE’S REPUTATION!\n          Ba0ba09: Isn’t 2Jade ruining his own reputation with the way he responds?\n \n“So there really was a dirty magazine?” Jingyi appears on the verge of laughing. “Your uncle really is something!”\nJin Ling looks resigned. “I feel bad for Han Guang-Jun.”\n“Let’s keep going,” Sizhui proposes. So far, they’ve only covered perhaps one-third of a page, yet he can’t force himself to look away. “How many more pages are left in this thread?”\nJingyi scrolls to the bottom and turns to Sizhui with grave eyes. “Eighty-nine.”\nIn their defense, Jin Ling and Jingyi manage to go through twenty pages before giving up, decidedly after Jingyi is forced to recite an anonymous user’s recollection of how he spotted Lan Wangji and Wei Wuxian fighting and/or flirting in the men’s shower area. Sizhui is starting to wonder if this is all an elaborate hoax when Jin Ling says, “Some of these stories are suspiciously believable.”\nThey decide to resume at a later date, Jingy making a pained noise when Sizhui reminds him of their history homework. “What a gold mine of quality content,” Jingyi says as they walk back to the other side of the dorms, where Jingyi and Sizhui occupy rooms across the hall from each other. “Who knew Han Guang-Jun had such an exciting school life? And a potential love interest dating back a decade?”\nSizhui considers this. His father has never shown any interest in offers from matchmakers. He was ruthless at navigating even the most subtle of romantic set ups, preferring to stare mirthlessly until the other party beat a hasty retreat. For the longest time, Sizhui wondered if his father was even capable of harboring romantic feelings for anyone. Then Wei Wuxian appeared like a storm in Sizhui’s home, leaving traces of his laughter echoing in every corner and drawing genuine emotions from his father.\nThe truth is Sizhui doesn’t know what to do with all this information. He fears that they’re overstepping or overreacting, or perhaps both. Some part of him feels ashamed for peeping into such a private part of his father’s past. The main branch of the Lan family have always found themselves in the media spotlight, despite their private nature. It’s something Sizhui’s father and uncle have always ignored, preferring to redirect the focus on their work rather than their personal lives.\nJingyi seems to be aware of Sizhui’s internal conflict, because he slaps Sizhui on the back to knock him out of his reverie. “Stop spacing out! You still gotta help me with homework!”\nUnfortunately, Sizhui’s habit of over analyzing everything can’t be solved with Jingyi’s constant prodding. He thinks about the tieba at night, in the mornings, during class, and in the spaces in between until he’s so distracted that a rabbit nips on his finger for attention. “Ouch,” Sizhui says absently, looking down at the fluffy friend in his lap. Next to him, Jingyi very obviously snickers.\n“Serves you right,” Jin Ling says, sitting an arms length away from him in the garden. He’s feeding a spotted rabbit with a small piece of celery. “Stop zoning out so much! If you’re so concerned, why don’t you just ask Han Guang-Jun? Go home this weekend and confront him face to face, like a real man!”\n“Like you’re not invested too!” Jingyi laughs. “Who’s the one that stayed up til 2am reading about their uncle’s love life? Why don’t you ask him face to face?”\nJin Ling turns his head away. “Hn! I was just curious! And I would, but he’s busy this weekend! The Pediatrics Cardiac Association is holding a gala and he was invited to attend!” Regardless, Jin Ling sounds quite proud of this.\n“Father is attending that gala too,” Sizhui says, remembering the quick conversation they had last weekend. “My family has been a donor for years. Uncle is usually the one who handles social outings, but he’s still in Beijing for work so Father will be going in his place. Actually, my cousin will probably be there as well.”\nJingyi looks up from setting a rabbit on his own face. He’s lying with his back on the grass and two other rabbits seated comfortably on his stomach. “Can you ask your cousin to spy for us?”\nThe idea of Wen Qing spying on Wei Wuxian is laughable at best. Sizhui scratches his cheek. “Probably not. She’s pretty busy, and I think she may be accepting an award there?”\n“Fancy,” Jingyi hums. He nudges Jin Ling with his knee. “Why are you so quiet?”\nJin Ling doesn’t stop from furiously typing on his phone. “Events like that are half for charity and half for publicity, right? My parents attend them all the time and there’s always media coverage.”\nThis is something Sizhui hadn’t considered. He’s been taught from a young age to ignore agencies that publish stories about the Lan family. “Are you suggesting we… Look to the tabloids for updates?”\n“No! What I’m saying is these type of galas also invite rich people who are likely to donate. Rich people like to flaunt their social lives, so it’s not a bad idea to keep track of their accounts.” Jin Ling gracefully ignores Jingyi’s comment of like you’re not a rich person too and pulls up someone’s weibo page. The display photo is of a Tang dynasty hand fan. “Xiaoshu’s friend, this Nie Huaisang guy, is the biggest gossip around. My dad is always telling me not to say too much around him.”\nSure enough, the latest update on the page shows Nie Huaisang is already in Shanghai, two days ahead of the event. His page is filled with curated photos of food and scenery, interrupted by occasional photos of himself. He reminds Sizhui of the socialites who often approach his uncle at events.\n“This guy went to school with Han Guang-Jun and Wei Wuxian too, right?” Jingyi points out. “We should ask around to see if anyone else’s family member is going to that event. Then we can keep track in case they update.”\n“So we’re going to… Stalk people on the internet?” Sizhui frowns.\nJingyi just grins. “I prefer to call it ‘Social Research.’”\n \n \n \nBy Saturday evening, Sizhui is seriously regretting his decision to bring Jingyi and Jin Ling into the fold. Still, he dutifully finishes this week’s assignments before making his way to Jin Ling’s suite, where Jingyi and Jin Ling are already camped out. Jingyi sits with the KFC Family bucket he’d especially ordered for the event, using a drumstick to point at the monitor that Jin Ling is setting up.\n“Do you think maybe we’re… Making this a bigger deal than it is?” Sizhui suggests.\nThe drumstick is pointed at Sizhui warningly. “Nothing is bigger than matters of the heart! Plus, I like looking at photos of rich people! That’s why I like our Little Mistress so much.”\n“I hope you choke on that chicken,” Jin Ling tells him seriously. He refreshes the article currently on screen. “Looks like there’s even a red carpet. People are already showing up.”\nIf anything, Sizhui agrees with Jingyi’s sentiment. Following socialites is truly a spectator sport that he'd never given himself the luxury to indulge in. Sizhui takes a seat and accepts Jingyi’s offer of food as the page refreshes on a familiar face.\nOn screen, Wen Qing looks completely unamused as she’s forced to pose in front of a wall full of sponsors’ logos. She’s clad in a red dress with a white blazer hanging on her shoulders while glaring into the camera. The caption on the photo states Wen Qing of Shanghai Children’s Hospital Cardiac Ward Arrives In Unbranded Dress. Dr. Wen will be receiving an award tonight on her research and work in the field..\n“That’s your cousin?” Jingyi asks, gulping down a bottle of sprite. “I don’t see the resemblance!”\nSizhui takes a bite of a biscuit, using a bowl to hold his crumbs. He’d spotted a roomba previously in Jin Ling’s room, but Sizhui still tries his best not to make a mess. “She’s not really my cousin. We’re distantly related but, she’s still the closest thing I can call an older sister.” He privately thinks about how Wen Qing had looked offended the one time he called her “Aunt,” but chooses not to share that.\n“Look who else updated.” Jin Ling hands over his tablet which displays Nie Huaisang’s weibo page. There’s a new post from five minutes ago with photos of the venue interior. The ballroom is not so much of a surprise as the photo that follows.\nThe picture is slightly blurry, but Wen Ning looks happy to be posing in a selfie with Nie Huaisang. “He really does know everyone, huh?” Sizhui says to no one in particular.\nUnfortunately, that weibo post is the only thing relevant to their interests. Even with their combined efforts in social research (three cell phones, one desktop, and one tablet) all they manage to find are photos of strangers and detailed pictures of the bathroom mirror where everyone is taking full body shots of their outfits. Jin Ling claims to have spotted his uncle in the background of one photo, but zooming in confirms it’s just someone else in a black suit.\n“I’ve been thinking,” Sizhui says after a while, when Jingyi is very obviously playing a puzzle game on his phone instead of researching. “Everything we’ve read so far on the tieba has been from years ago. Maybe it’s true that there was something going on between Dr. Wei and Father, but it’s been so long. How do we even know if there are any feelings left?”\nJingyi looks up and turns to Jin Ling. “Well? Has your uncle brought dates home before?”\n“Hell no.” Jin Ling pulls his legs into a butterfly pose. “Everyone in my family knows that you don’t bring anyone home unless they’re marriage material, or else Grandma would tear them apart. Dajiu would sometimes make comments about certain people being attractive, but I’ve never seen him date anyone.”\n“Or maybe he just never introduced you to any of his dates,” Jingyi suggests.\n“Fine, that too.”\nSizhui turns the idea over in his head. Homosexuality has never been a topic of conversation in his family, but then again, neither was love in general. In fact, it seems like most of the adults in Sizhui’s life chose their career over conventional expectations of a nuclear family. “How do we even know he likes men?”\nJin Ling shrugs. “How do you know if Han Guang-Jun likes men?”\n“I don’t,” Sizhui says at last.\n“So we’re back to square one,” Jingyi mumbles. He resumes playing the puzzle game, which devolves when Jin Ling begins giving him strategy advice that ends with the two of them arguing. Their bickering leaves Sizhui alone with his own thoughts again, and he’s about to suggest they wrap up for the night when another weibo update pops up on the tablet.\nNie Huaisang’s newest post is another collection of selfies. This time, it includes a blurry shot with Wei Wuxian, who laughs while holding a jar of liquor that he appears to have snatched from one of the catering tables. In fact, Wei Wuxian seems to be constantly photobombing every photo until the last one.\nSizhui nearly drops the tablet.\n“What?” Jin Ling demands, coming over. He takes a moment to squint at the screen before making a disgusted face. “Well, this answers your question of whether they’re still interested in each other.”\nThe very last photo is a blurry portrait shot of Wei Wuxian caught mid laughter. He looks delighted in his black suit and very much like a young bachelor. Right next to him, however, is a figure clad in white. They’re attached by the hands, where the person in white is tugging at Wei Wuxian’s wrists and leaning in to whisper something into his ear. The fall of his hair, coupled with the strange angle, hides most of his face, but Sizhui knows without a doubt that the second person is his father.\n“How incriminating.” Jingyi whistles.\nSizhui can’t believe what he’s seeing. “Maybe it’s too loud inside and he needed… To speak to Dr. Wei privately?”\n“Un-huh.” Jingyi scoots over towards Jin Ling, pulls him in by the arm, and is about to plant a fat kiss when Jin Ling starts hollering and pushes Jingyi away.\n“WHat-WHAT DO YOU THINK YOU’RE DOING?!” Jin Ling shouts, covering the side of his cheek that Jingyi barely even touched. “How dare you-you-you-”\nJingyi shrugs. “I’m demonstrating that normal people don’t do stuff like this.”\nSizhui knows that Jingyi is right. There’s really no logical, innocent explanation for this. His father is not big on skinship to begin with. That singular photograph is so damning that they may as well quit gathering evidence.\n“What should we do?” Jin Lin asks, having finally stopped stuttering and glaring at Jingyi. “The article is no longer being updated either.”\n“Let’s put that monitor of yours to good use, then,” Jingyi says. He takes a step forward and bursts out laughing when Jin Ling stumbles back. “Relax! Did you think I’d actually kiss you? Get in line!”\n“There is no line!” Jin Ling all but shrieks. “And what do you propose we do?!”\n“Let’s watch a movie!”\nIn the end, they decide to stream Lost in Thailand. It’s the fourth time Sizhui has seen this movie, so he allows himself to zone out while periodically refreshing Nie Huaisang’s weibo. When he doesn’t find any relevant updates, Sizhui sets his head on Jingyi’s shoulder. Jingyi, used to Sizhui’s moods, just absently pats Sizhui’s head a few times. The movie is funny enough, and soon Jin Ling and Jingyi are both laughing. Sizhui feels himself shake with laughter too, his arm pressed against Jingyi’s.\nThe next thing Sizhui knows, a strip of harsh sunlight from the window is landing directly on his face. It’s morning and Sizhui barely remembers his late night decision to stay here instead of walking back to his room. Thankfully, he’s on the outer edge of the bed, so Sizhui rolls off it silently and turns back to the other occupants.\nJin Ling is still asleep, his body sprawled almost diagonally across the queen size bed. His mouth is open, but no noise escapes it as Jin Ling continues his peaceful slumber. Curled up around Jin Ling’s hip is Jingyi, who has one arm thrown across Jin Ling’s stomach and is using a scrunched up section of the comforter as his pillow.\nA cursory glance at his phone informs Sizhui that it’s 9 am, early enough for the canteen to be open on a Sunday. Sizhui has always kept a regular eating schedule, so he tip toes out of the room in yesterday’s t-shirt and jeans and heads in the direction of food. The dorm is still empty save for the guard on duty, and Sizhui easily makes his way to the canteen with zero distractions. He’s not sure if anyone would even point out his wrinkled t-shirt or bedhead, but he does not encounter any classmates regardless.\nIn the canteen, Sizhui grabs three cups of freshly made soy milk-- no sugar for him and full sugar for Jingyi. He’s not sure what Jin Ling prefers, so he orders medium sugar and a bottle of green tea as well. Sizhui manages to cram six scallion pancakes, ten mini meat buns, a cup of tofu pudding, and an extra large take-out container of century egg porridge in two bags while the aunties on duty chat with him about the weather.\nWalking back to the dorm is balancing act. Thankfully, Sizhui runs into Ouyang Zizhen, who holds the main door open for him while laughing, “Are you trying to feed a village?!”\nIt’s not until Sizhui arrives in Jin Ling’s hallway that he remembers not having a key. Thankfully, Jingyi and Jin Ling are already up, because Sizhui can hear the sound of arguing inside when he knocks.\n“You’re back!” Jingyi beams when he yanks the door open. He immediately goes to take half of the food from Sizhui’s arms, mumbling something about Jin Ling having bad morning etiquette. “Sizhui, can you believe this guy was petting my hair?” Jingyi asks after setting the food on the table.\n“I thought you were my dog!” Jin Ling wails, probably not for the first time. He looks torn between wanting to eat and wanting to tear his own hair out. When Jingyi makes a fake barking sound, Jin Ling throws a stray pillow at him. It misses.\nSizhui laughs and sits down. “Let’s eat before the food gets cold.”\nJingyi thanks Sizhui before digging in. He inhales the scallion pancakes easily and doesn’t wait for a communal spoon before digging into the tofu pudding. Even Jin Ling seems satisfied with his soy milk. They eat in silence until Jingyi says, his mouth still half full, “By the way, the photo is gone.”\n“What photo?” Sizhui asks.\n“You know,” Jin Ling says. “The incriminating one! That entire post got deleted for some reason. If I hadn’t saved a copy of it, I would’ve thought we dreamed it up!”\nSizhui has no clue what this all means. He can’t even imagine breaching the topic with his father, so Sizhui thumbs through his phone and decides to message the person who is most likely to give him a straight answer.\n9:45AM\nLan Sizhui: Good morning!\nWen Ning: Morning, A-Yuan!\nLan Sizhui: Did you and Wen Qing-Jie have fun last night?\nWen Ning: It was really fancy! Jie acted like she didn’t want to go, but she was quite pleased to receive an award!\nLan Sizhui: Did you happen to see my father there?\n(Wen Ning is typing…)\n“Well?” Jingyi asks, now serving himself porridge.\n“Don’t talk with your mouth full,” Jin Ling reprimands, but makes a pleased noise when Jingyi also puts a serving of porridge in Jin Ling’s bowl.\n \nWen Ning: I did speak to Han Guang-Jun, but only brief before he…\nLan Sizhui: What is it?\nLan Sizhui: Is everything okay?\nJingyi is kind enough to also put some porridge into Sizhui’s bowl, and he pushes it towards Sizhui. “Stop frowning and eat already!”\nWen Ning: I think Han Guang-Jun had a little too much to drink ^^;;\nWen Ning: He was with Dr. Wei most of the night\nWen Ning: I wasn’t really paying attention to them, sorry!\nThis seems almost impossible to Sizhui, who has never seen his father drink. He’s vaguely aware of the fact that both his father and uncle have low alcohol tolerance, but Sizhui has never witnessed it in action. Yet he’d seen the photo with his own eyes, so there really was no denial that his father had improperly attached himself to Wei Wuxian while drunk.\nLan Sizhui: Thank you for telling me\nLan Sizhui: I’m sorry for the strange question\nWen Ning: A-Yuan… It’s okay\nWen Ning: Jie and I are used to it ^^;;;;\nUsed to what? To his intrusive questions? Doubtful, since Sizhui tried his best to behave in the Wen siblings’ presence.\nWen Ning: Dr. Wei and Han Guang-Jun have been like this forever…\n“Oh my god,” Jingyi says, reading over Sizhui’s shoulder. He makes a muffled noise when Jin Ling manually pushes his jaw up. “Everyone! Everyone knows about their sexual tension! Urg! I wish there was something we could do, but we’re stuck at school. We need to be where the action is!”\n“It does feel like our options are limited,” Sizhui agrees. He takes a few spoonfuls of the porridge and sighs. “I suppose there’s nothing we can do, especially with National Week coming up.”\nJingyi sticks another pancake in his mouth. “What are you doing for the week anway? My aunt’s family is going to Taiwan. We were supposed to go too but my mom didn’t get our visas filed on time, so now we’re stuck in Gusu. Lame.”\n“My cousins are working and Father did not have anything planned,” Sizhui says. “I suppose I’ll spend it in Gusu too.”\n“I’m going to Yunmeng,” Jin Ling says when he realizes the other boys are waiting for him to contribute to the conversation. “My parents and sisters and I are going to visit my mom’s side of the family.”\n“I’ve never been to Yunmeng. Is it nice?”\nJin Ling puffs his cheeks up like a goldfish. “It’s beautiful there, especially this time of the year! My grandparents own an estate on the water, and there are so many lotus ponds everywhere. It’s actually a huge tourist destination. My sisters love visiting!”\nSizhui can’t help but smile. “Your sisters aren’t the only ones, it seems.”\n“Why don’t we go to Yunmeng too?” Jingyi says, apropos to nothing.\n“What?” Jin Ling frowns.\n“Well, Sizhui and I have nothing to do for the week, right? And you said it’s a good vacation spot, right? So let’s go! Plus, Wei Wuxian will be there for the family reunion, so maybe Han Guang-Jun can chaperone us and meet Wei Wuxian there? Then their love can blossom like a lotus in autumn!”\nJin Ling is quiet for a beat before saying, “That’s not how lotuses work, but okay. I don’t see why you can’t come to Lotus Pier. Plenty of tourists do.”\nThis is an unexpected turn of events, and Sizhui tries his best to think of a flaw in their logic. “I’d have to ask my father… I’m not sure he’d consent to chaperoning us. And what are the chances of us running into Dr. Wei anyway? I don’t want to disrupt Jin Ling’s family.”\n“Well, I know my mom would be fine with it if I traveled with you and Han Guang-Jun.” Jingyi shrugs.\n“If you guys come, I’ll definitely find a way to meet up with you,” Jin Ling promises. “Why don’t you just ask Han Guang-Jun? What do you have to lose?”\nProbably nothing, Sizhui thinks.\nWhat Sizhui doesn’t realize, days later, is that the universe has a way of both conspiring with and against him. While his father seems indifferent to the idea, it’s Sizhui’s uncle who suggests that the scenery in Yunmeng is admirable this time of the year. He also mentions being invited on an unexpected business trip to Malaysia during National Week, thus absolving them of the potential guilt of leaving Ze Wu-Jun by himself.\nThe second factor is Jin Ling, who casually mentions to his mother that his friends are visiting Lotus Pier. When it comes to light that one of the friends is the child of Han Guang-Jun, who will be traveling with them, the Jiang family decides to extend a personal invitation to their estate.\n“I told them you guys can just book a hotel,” Jin Ling says three days before the start of the holidays. “But Laolao started yelling at me about how she owns all the hotels in Lotus Pier and that everything has been booked out for the holidays. She says it would personally offend her if you found accommodations elsewhere when there are perfectly good guest rooms at her place.”\nJingyi is counting his fingers. “Aren’t your family staying with them too? How many guest rooms do they have?”\nJin Ling looks as if someone has asked a very dumb questions about how many guest rooms the emperor’s palace has. “More than enough.”\n“Huh.” Jingyi sets a heavy hand on Sizhui’s shoulder. “I guess we’re going to Yunmeng!”\nOn the Friday before National Week, Jingyi dashes out of his last morning class to grab his suitcase from the dorms, where Suzhui and Jin Ling are waiting for him with varying levels of patience. Jingyi commends himself on having the foresight to pack beforehand, even if Sizhui deserves most of the credit for gently needling Jingyi days in advance. Still, most of Jingyi’s travel belongings are safely packed in his luggage, neatness notwithstanding. “I’m ready!” Jingyi huffs when he finally joins the other boys.\n“Better late than never,” Jin Ling mumbles. He looks even more overpacked than usual, clad in a overcoat that screamed I’m rich! \n“Father is waiting for us,” Sizhui adds. He’s too polite to rush them, but Jingyi knows him well enough to understand that’s code for we’re late. \nTogether, the three of them lug their bags to the school gates toward the car Jin Ling had called for them. The ride to Shanghai West Station is long and tedious, and Jingyi recognizes the telltale signs for the great National Week migration as the roads are clogged even more so than normal. Thankfully, they arrive in time to go through baggage check and meet Lan Wangji at the gate.\n“Sorry for our lateness.” Sizhui takes a seat next to Lan Wangji. He pauses at the stacked items next to them. “Father, what are these?”\n“Gifts for the hosts,” Lan Wangji replies. His gaze lands on the box of sweets in Sizhui’s hands. “I see you brought some as well.”\n“Jin Ling is the one who suggested it.” \nSizhui leaves out the fact that Jingyi and Sizhui were the ones who had lined up for over an hour at the local traditional dessert shop while Jin Ling was busy at archery practice. In his defense, Jingyi had kept his mouth shut while the girl at the counter made heart eyes at Sizhui as she wrapped up their box. \n“My grandmother has very selective taste,” Jin Ling says, as if he hadn’t warned them a dozen times of his grandmother’s strictness. In no uncertain terms had Jin Ling told Jingyi to be on his best behavior. At this point, Jingyi fully expects to be meeting Empress Dowager Cixi at Lotus Pier. \nEven worse than the repeated prodding had been Jin Ling’s family tree, which he presented to Jingyi and Sizhui in the form of a powerpoint. Jin Ling had stressed the importance of memorizing his family members, lest they misstep and embarrass Jin Ling. Jingyi was pretty sure Jin Ling just recycled his family tree presentation from English class. Either way, his head was so filled to the brim with useless information about the Jin-Jiang family that Jingyi had accidentally written Jin Ling’s name by accident on his history quiz. \nJingyi wonders if Jin Ling sent Lan Wangji the same slideshow. Probably not, considering how Jin Ling still seems in awe of Sizhui’s father. \n“Thank you for arranging accommodations for us,” Lan Wangji says, passive as always. He seems to be appraising Jin Ling, who straighten up under his gaze. \n“N-Not at all! My family insisted!”\nThey move to the boarding area soon after that. Shanghai West is the departure station for their high speed rail, and the station attendants let them board the business class cabin without fanfare. Jingyi is impressed by the extra leg room in their row, and soon turns their chairs around so all four seats face each other. The cabin is half empty, so no one complains about the noise.\nJin Ling is still on his phone when the train begins moving. “My mother is sending someone to pick us up from Yunmeng station. Most of my family is already at the estate.”\nIt must be nice to be rich, Jingyi thinks. His own parents have to work through the weekend before their break officially starts on Monday. Jingyi had only gotten away with his last-minute vacation plans due to Lan Wangji’s participation and his improved math grade. He continues nibbling on the sunflower seeds Sizhui packed. “What about your dog?”\n“Fairy is traveling with Xiaojiu.” Jin Ling looks visibly excited at the mention of his dog. Behind him, sceneries flash through the window as the train picks up speed. “But my parents are taking him back to Lanling after this.”\n“I’m excited to see Fairy again,” Sizhui offers. He turns to his father as if expecting Lan Wangji to contribute to the conversation with some farfetched declaration of being excited to see Wei Wuxian. This, of course, does not happen.\nFor the most part, Lan Wangji is blissfully quiet through the ride. He reads a novel silently while Jingyi cycles through a series of proposals to keep them busy. They play cards, a multiplayer game on Jin Ling’s iPad, and then cards again. Lan Wangji orders them late lunches when the cart ladies comes around with boxed meal, but leaves his own serving mostly untouched while the boys inhale their food. \nA few people onboard and offboard the cabin at the intermittent stops between Shanghai and Yunmeng. After a while, Jin Ling dozes off against the window while Jingyi watches the scenery change from urban snapshots to the wide expanse of the countryside. Just for fun, Jingyi snaps a photo of Jin Ling’s sleeping face with a dog filter and shows it to Sizhui.\n“Behave,” Sizhui mouths silently, despite looking amused. \nThe three hour ride ends unexpectedly fast, and soon Jingyi is shaking Jin Ling awake while Sizhui moves their luggages from the overhead compartments. “Wake up, Little Mistress! We need you to navigate us~”\nJin Ling manages to glare through sleepy eyes. Still, he leads them off the train and into the utter chaos that is Yunmeng station. “What?” Jin Ling asks when a family almost runs into him. “I told you this is a popular tourist destination.”\nWith utmost determination and a little bit of side stepping, they manage to make it out of the exit to find a sea of taxis and personal cars parked in the arrival area. Jin Ling immediately locates a man holding a purple sign and leads them to him.\n“Welcome back, Young Master Jin.”\n“Driver Li,” Jin Ling says importantly. “Take us to your vehicle.”\nThe vehicle turns out to be a luxury minivan. Jingyi bites the inside of his mouth as Driver Li loads all of their stuff into the trunk. He supposes this is better than cramming into a taxi, and tries his best to keep his mouth shut while climbing into the back row of the van. \n“We will arrive in forty minutes,” Drive Li tells them as they pull out of the station. “Please help yourself to snacks and beverages in the middle compartment.”\nJin Ling has the audacity to take the front passenger seat. While he asks Driver Li questions about traffic, Sizhui turns to his father.\n“Have you visited Yunmeng before?”\nLan Wangji doesn’t turn his head from the window. “No,” he says almost wistfully.\nThe station is located in a rural part of Yunmeng, amidst vast fields of crops broken by tiny stone houses. Every so often, their van has to slow down to weave around small work vehicles and farmers pulling donkeys along. The main road follows the curvature of a large lake, the surface so wide and smooth that Jingyi can’t see where the water ends. But the scenery soon changes into something more commercialized, and farm houses are replaced with newly built villas. \n“This is lovely,” Sizhui says when the road begins expanding, and they see more visitors milling about. \nWhen they drive through a large stylized archway, Jin Ling turns to them and says, “Welcome to Lotus Pier. Well, this is only the outer edge. My grandparents’ estate is towards the other end.”\n“The Jiang family home is famous for its architecture,” Driver Li explains as the car pulls off the main road and towards what appears to be a dock. “It’s surrounded by water, and visitors at Lotus Pier regard it as a signature landmark.”\n“Why are we stopping here?” Jin Ling asks when Driver Li parks the vehicle. They’re currently at a dock that doubles as a viewing area, with other families parked nearby as they sit at picnic tables overlooking the water. \nDriver Li opens the door for Jin Ling. “The rest of the road is blocked by tourist traffic. It would take another hour for us to reach the estate. Madam Jiang has advised you to take the boat. We will part here.”\nJingyi looks around the pier. There are a few sailboats docked by the water, but what Driver Li leads to them to can only be described as a small yacht. “Are we taking this?”\nWhile Driver Li diligently moves their luggage, another man appears from the inside of the boat. He’s round and tall and tan, and the hand he sets on Jin Ling’s shoulder is nothing short of friendly. “Young Master Jin! You’re so tall now! Do you remember me?”\n“Wu-Shushu,” Jin Ling says, his nose high in the air. “Long time no see.”\n“Lao Wu,” Driver Li cuts in. “Someone should be waiting for them at the West Port.”\n“Got it, got it,” Lao Wu laughs as he gestures for Jingyi and Sizhui and Lan Wangji to come onboard. “I’ve been sailing this boat for Master Jiang for thirty years, and Driver Li still feels the need to remind me every time. I’m telling you-- I’ve been doing this since Mistress Yanli has been a child. Just because I took Master Jin to the wrong dock in the middle of the night once... Oh, Driver Li, stop giving me the stink eye! They’re in good hands!”\n“You did that to my dad?” Jin Ling asks, mouth wide. “Why?”\nLao Wu waits until everyone has boarded to turn on the engine. “Why? Young Masters Jiang and Wei told me to, of course! They thought it would be a fun prank to ambush your father. Those boys have always been trouble makers, but no harm done, you see? Your parents are happily married, years later!”\n“If you don’t mind me asking,” Sizhui says when Lao Wu is done laughing at his own story. “Where are we going?”\n“The Jiang family has a private dock on the west end of their estate. Before the main roads were built, taking the boat was the fastest way of getting to the rest of Lotus Pier! We’ve been doing this for decades. My old man worked for Master Jiang’s father, and now I work for Master Jiang.\"\nJingyi squints as the boat starts to move. On the dock, a little girl is waving at them. Jingyi waves back. “What is this? Your grandparents have servants?”\n“They’re staff, not servants!” Jin Ling huffs.\n“Jingyi, don’t be rude,” Lan Wangji speaks up for the first time in an hour. \nLao Wu just cackles some more. “No offense taken! There’s no better employer in Lotus Pier than Master Jiang! We almost got bought out by commercial realtors around thirty years ago. They wanted to drive all the locals out and fill this place with chains! But then the Jiang family stepped in and bought out the land so they can keep leasing to the locals. We used to just be a fishing port fifty years ago, and now look at us! Tourism keeps bringing money in! Business is good!”\n“Sorry,” Jingyi mumbles after a bit. “Guess your grandparents are cool after all.”\nOver the water, the Jiang estate appears like a vision. As the boat pulls closer, they’re greeted by patches of lotus almost floating on the water, as if parting a path just for them. Jingyi can make out the shape of a woman standing on the end of the wooden boardwalk, her long purple skirt swaying in the breeze. She’s flanked by identical small girls on each side.\n“Mom!” Jin Ling gasps. He doesn’t wait for the boat to dock properly before jumping onto the wooden steps and enveloping his mother in a hug. \n“A-Ling,” Jiang Yanli laughs. “It’s nice to see you too!” Next to her, the girls tug on Jin Ling’s arms and legs and clothes, going Gege! Gege! Gege!.\nJin Ling is playing when the kids when Lao Wu finally secures the connection between the boat and the dock. Jin Ling looks sheepish, but not embarrassed. “Sorry, Han Guang-Jun. This is my mother.”\nLan Wangji gives Jiang Yanli a nod. “Thank you for your hospitality.”\n“There’s no need to be so formal, Han Guang-Jun. I’m still indebted to your brother after all the help he’s given me. Not to mention how close Ze Wu-Jun is to A-Ling’s shushu. Our families are so close already, it’s an honor and a pleasure to have you here.” Coming from anyone else, her words may seem insincere or over-exaggerated. Yet there’s something calming and genuine about her voice that puts Jingyi at ease.\nEventually, Lan Wangji says. “The honor is ours. This is Lan Sizhui and Lan Jingyi.”\nJiang Yanli smiles directly at Jingyi. “I’ve heard so much about you two from A-Ling. It’s not everyday my son brings friends home.” \n“Mom!” Jin Ling yells, face red.\nJiang Yanli smiles even more, gesturing for the twins to come to her. “These are my daughters, Tiantian and Qianqian.”\n“Where’s Dad?”\n“He stayed behind to watch Fairy with Bingbing,” Jiang Yanli says, letting go of Qianqian’s hand when the child decides to cozy up to Sizhui. Tiantian, however, stays half hidden behind her mother. It would have been impossible to tell them apart if not for the introduction. “Remember, you promised to keep Fairy away from A-Xian.”\n“Should I call you Lingling now?” Jingyi asks while Jiang Yanli speaks to Lao Wu. \n“Only if you want to die,” Jin Ling hisses. \nTwo more staff members appear then, moving everyone’s luggage onto a rolling cart. They nod when Jiang Yanli asks them to take the bags to the East Wing, where the guests will be staying. \n“We are only operating at half capacity at the moment,” Jiang Yanli explains when they begin walking away from the water, towards the estate. “Most of the staff went home for the holidays. We even sent our nanny on vacation, so I hope you don’t mind the noise. Tiantian, what’s wrong?”\nTiantian is completely silently, gripping her mother’s hand while Qianiqan circles around Sizhui like he’s a fun new toy. “Up up,” she says quietly when everyone looks at her.\n“What?” Jingyi asks.\n“Up up,” Tiantian says again. “I want bao bao!”\n“She wants to be picked up,” Jin Ling translates.\n“We’re almost there,” Jiang Yanli tells her daughter. “Don’t you want to walk just like Qianqian and Gege?”\nThe desire to be just like her siblings seems to trump Tiantian’s need to be picked up, and she goes back to following her mother silently. They continue at a leisurely pace until the wooden boardwalk turns into a stone path through the gardens, the expanding walkway framed by poles with large purple lanterns hanging on top. In the distance, to their right, Jingyi spots smaller pond with a gazebo on top.\n“That’s my mother’s favorite place to lounge,” Jiang Yanli explains when she catches Jingyi looking. “During the summertime, you can come out in the evenings to see fireflies on the waters. In fact, I think there’s a tree near the gazebo that A-Cheng and A-Xian used to mark their height on growing up.” \nAt the mention of Wei Wuxian, Lan Wangji turns his head to the pond as well. \nJiang Yanli just hums. “The garden was especially designed by my mother. It’s her pride and joy, and she severely punished my brothers when she discovered them carving into her favorite elm tree. Oh, we’re almost here.”\nSure enough, they soon arrive at a stone moon gate that connects the gardens to a courtyard. Waiting at the entrance are two people who look undeniably related to their little mistress.\nAt the sight of Jin Ling, Fairy jumps out of the teenage girl’s arm and comes bouncing along until he’s climbing up Jin Ling’s legs. Jin Ling picks him up immediately and laughs when Fairy licks his face in excitement. “Calm down, it’s just me!”\n“Just you is enough. Welcome back, A-Ling,” Jin Zixuan says while Tiantian immediately latches onto him. Up close, Jingyi can see how Jin Ling shares the same haughty nose and curved mouth as his father. “Han Guang-Jun, long time no see.”\nWhile Jin Zixuan and Lan Wangji exchange pleasantries, Qianqian pulls Sizhui’s arm down and loudly whispers, “that’s Daddy, he’s the best,” into Sizhui’s ear. \n“She loves strangers,” the person who has to be Jin Bing tells Jingyi. She’s almost his height and can probably pass for Jin Ling’s twin if not for the look of passive disinterest on her face as she listens to another round of introductions. The Jin genes really run strongly in this family, Jingyi thinks but doesn’t say.\n“Let’s go in,” Jiang Yanli suggests after Fairy has calmed down. She gives Jin Ling a firm look that gets Jin Ling to quickly clip Fairy’s leash onto his collar. They’re led through a series of paths until arriving at a large, four-sided courtyard. Facing the north is an open-air hall. At the top of the steps sits a stern looking woman in a throne-like chair. Jiang Yanli smiles up at her. “A-Niang, our guests are here.”\nYu Ziyuan descends slowly down the steps until she’s looming over them. “Han Guang-Jun. Welcome to my home. My husband is taking care of some business with my son. Please excuse their absence.” Everything that comes out of her mouth sounds more like an order than a request.\n“Thank you for having us,” Lan Wangji says, perhaps for the 10th time that day. He looks at Sizhui.\nAs if on cue, Sizhui steps forward. “Madam Yu, thank you for extending your hospitality to us. Please accept this box of sweets from Gusu’s famous dessert shop. They’re infused with chili, which Jin Ling told us may be to your liking. We also brought three jars of Emperor’s Smile from my great uncle’s collection, along with a box of fresh crystal loquats.”\nYu Ziyuan eyes offerings appraisingly. After an eternity, she says, “I didn’t know Lan Qiren had a taste for rice wine.”\n“Uncle has an interest in collecting them,” Lan Wangji speaks up when Sizhui gets flustered under Yu Ziyan’s gaze. \n“Very well,” Yu Ziyuan says as she calls a staff member forward. “Have Chef Wang use the loquats in tonight’s meal. He knows how Jiang Fengmian likes it prepared. Serve the sweets for dessert. I’ll be the judge of whether A-Ling knows my taste.”\nA small smile breaks across Jiang Yanli’s face, and Jingyi takes that as a sign Madam Yu has more or less accepted them. “Let’s set the Emperor’s Smile aside for tomorrow, when A-Xian arrives. He’ll be disappointed if we drink it all without him.”\n“Yes, Madam.” The staffer accepts all the gifts and hurries away. \n“Han Guang-Jun,” Yu Ziyuan continues. “I have some thoughts about your brother’s contribution to the exhibition in Hangzhou. Since he’s not here, I hope you’ll indulge me and hear me out?” Again, her request is worded more like a demand, and Lan Wangji slowly goes to her side. “Let’s walk and talk while the children settle in. A-Li, help everyone to their quarters, won’t you?” \n“Of course,” Jiang Yanli says, but Madam Yu is already off, commanding Lan Wangji to follow.\nEveryone waits until they’re both out of sight to relax. Jingyi nudges Sizhui. “Your face was so red! It’s like you forgot to breathe!”\n“She has that effect on people,” Jin Ling says, sympathetic. Even Fairy has stayed on his best behavior. \n“Can I go now?” Jin Bing asks, looking bored by it all. Upon getting a nod of approval from Jiang Yanli, she disappears around the corner, presumably back to her room. “Come, Fairy!”\nJin Ling looks betrayed when his dog goes bouncing after his sister happily.\n“Don’t be upset,” Jiang Yanli laughs softly. “You haven’t been home in so long, and Bingbing usually takes care of Fairy when you’re gone. Although A-Cheng definitely spoiled him for the last few weeks.”\nAs if following Jin Bing’s lead, one of the twins tugs on Jin Zixuan’s hand. “I wanna go too… I’m tired..” \n“It’s about that time. ” Jiang Yanli sets a hand on her husband’s arm. “Can you put them down for a nap? You remember where I left their bag, right? Qianqian’s blanket is still in our room.”\n“Of course,” Jin Zixuan says, looking more amused than annoyed. “I can do this much.”\nAs if to prove her dad otherwise, the twin currently standing next to Jin Ling starts complaining. “I don’t want to nap! I want to play with Gege!”\n“Gege is busy with Lan-gege,” Jiang Yanli replies, trying to hide her laughter at the sight of Jin Zixuan’s astonished face. “He’ll have time for you after your nap, Qianqian.”\n“I want to play with Lan-Gege!” Qianqian stumps her little leg on the ground. “I’ll show him the entire house! I’ll be the host!”\n“You don’t even know the layout of the entire house,” Jin Zixuan says. When Qianqian looks offended at his suggestion and her face turns red, on the precipice of tears, Jin Zixuan adds, “Can you relax?”\nThe only thing funnier than Jin Zixuan asking a four year old to relax is the look of betrayal on Jin Ling’s face at the suggestion that his sister likes Sizhui more than him. \n“I’m feeling a little tired too,” Sizhui suggests when Qianqian is on the verge of a fit. “Let’s both take naps. Then we can play when we’re both energized. How about that? I’ll be here for the week. We have plenty of time to play. You can show me the rest of the house too.”\nQianqian considers this for a moment. “okay.” \nIt’s not until Jin Ling’s parents have led the twins away that Jingyi bursts out laughing. Jin Ling’s glare doesn’t help, and Jingyi is wiping tears of mirth from his eyes when Jin Ling leads them to the East Wing, where their luggage is already waiting. Sizhui and Jingyi have been assigned to connected rooms, the layout reminiscent of a traditional guesthouse. “This place is humongous,” Jingyi says after testing the bed. It’s firm but comfortable. “Your grandparents are crazy rich.”\nJin Ling gives him a funny look. “Our property in Lanling is even bigger.”\n“Of course it is.” Jingyi flops with his back down on the bed. “Don’t forget though, we’re here for business, not pleasure.”\nThis makes Jin Ling tsk. “Stop acting like we’re here on a secret mission. How difficult can it be to set two old men up?”\nJingyi says “pretty difficult” the same time Sizhui says “I wouldn’t call them old.” \n“What is your plan anyway? Are you going to lock them in the same room?” Jin Ling takes a seat on the bed and slap absently at Jingyi’s leg.\n“Love needs to blossom naturally!” Jingyi huffs. “Being locked in a dark room isn’t romantic! We need ambience! We need the mood to be perfect. We need Han Guang-Jun to look up at Wei Wuxian, bathed in moonlight, and he realize he’s fallen in love!”\n“What you need is to stop. You’re almost bad as Bingbing. All she does is stay in her room reading internet novels and talking to her online friends!”\nJingyi promptly sits up. “Oh… I wonder which one she’s reading? Maybe she can give me recommendations.” When Jin Ling gives him an incredulous look, Jingyi brushes it off and goes to open his suitcase. Jingyi and Sizhui spend the rest of the afternoon unpacking with the door between their rooms open and Jin Ling lording over them. By the time Jiang Yanli comes to announce dinner, all three of them are lying horizontally on Jingyi’s bed, watching videos on Jin Ling’s phone.\nDinner is extravagant as expected, with enough food to feed a small village. What’s more impressive is how many dishes now contain the loquats they’ve brought, ranging from fried to steamed to stewed. Jingyi’s mouth is already watering by the time he’s seated between Jin Ling and Sizhui, although he abruptly straightens up when Madam Yu’s gaze passes over him.\nSitting at the head of the table, under a pair of elaborate wall scrolls, is Jiang Fengmian. He looks incredibly mild next to his scowling wife, both of them instructing the staff on place settings. After some deliberation, Jiang Cheng takes the seat to Madam Yu’s right. Han Guang-Jun sits wordlessly on the other side of Jiang Fengmian while the twins are flanked by their parents. Jin Bing, in a power move that will probably never be mastered by her brother, appears at the last minutes and slides effortlessly into the only empty seat left. \n“Welcome to my home,” Jiang Fengmian begins when all the staff have stepped aside, “I apologize for seating us in the reserved dining area for now. Tomorrow we will dine in in the main hall.”\nJingyi almost chokes on his water. There’s another dining room even bigger than this? He recovers just in time, no thanks to Jin Ling swatting him unsympathetically on the back.\n“It’s not everyday that we have the honor of hosting the Lan family,” Jiang Fengmian continues with a good humored smile. “My wife and I have been long time acquaintances of Lan Qiren. It’s my wish that he, too, will visit Lotus Pier.”\n“Uncle would be honored,” is all Lan Wangji says. \nWhether Headmaster Lan would actually step foot in Yunmeng, no one will know. This doesn’t deter Jiang Fengmian. “It’s always a great blessing when I can be surrounded by my children and grandchildren, although A-Xian won’t be joining us until tomorrow.”\n“We would have more grandchildren if Jiang Cheng and Wei Wuxian would hurry up and get married already,” Madam Yu cuts in, shooting a glare at her son. “Those two… All they do is run around with no regards to their responsibilities…”\nThe look of great consternation on Jiang Cheng’s face suggests this isn’t the first time he’s heard this rant. Regardless, he stays silent.\n“Yu Ziyuan and I are very happy to be with the grandchildren we have now,” Jiang Fengmian adds, offering the kids a smile that’s met with a blush from Jin Ling, silence from Jin Bing, and vague noises from the twins who complain about wanting to eat already. This sends the Jiang head into a bemused laugh. “Well. Without further ado, let’s eat!”\nThe food is good. Really good. Jingyi doesn’t have time to offer compliments, too busy stuffing his face. He zones out on all the small talk and focuses on the slow turning of the glass top on the table as new dishes are presented before him. Jin Ling tsks at his behavior but still waves staff over to refill Jingyi’s teacup whenever it runs out. Soon, Jin Ling gets called away to fill the adults’ glasses with alcohol, and Sizhui is left with the sole duty of making sure Jingyi doesn’t choke himself to death on food.\n“Does Lan Qiren even feed these kids at school?” Madam Yu huffs. “We can’t have him starving A-Ling in Gusu.”\n“I’m fine,” Jin Ling insists, face red at the sudden attention. “Mom sends me lots of snacks and the food is okay. Dad and Xiaojiu all came out of it okay.”\n“That’s questionable.”\nJiang Cheng looks like he has something to say, but he stops himself from participating in the conversation by putting more rice in his mouth. A cowardly tactic, if Jingyi has ever seen one.\n“A-Ling is doing fine,” Jiang Yanli says while cutting the meat in Tiantian’s bowl into tiny pieces. Her husband seems to be less successful, since Qianqian keeps ordering her dad to do it better! This one is shaped weird! “He’s even grown a bit since starting school.”\nMadam Yu narrows her eyes and beckons Jin Ling over to fuss over him. “Did you get taller? I’ll be the judge of that. Your dad has good genes, so you should be fine, but it doesn’t hurt for you to eat more.”\n“T-thank you?” Jin Zixuan says, looking surprised by the sudden compliment, if one can call it that. While he’s not looking, Qianqian snatches the fried egg from his bowl and pops it in her mouth with quick work of her chopsticks. \nDinner continues for hours, even after Jingyi had overeaten and driven himself into a pseudo-food coma. He’s half leaning on Sizhui’s side when staff members come out with the dessert they brought from Gusu. Everyone is served a piece on a delicate, lotus-shaped plate, but Jin Ling trades his with Jingyi when he decides he likes Jingyi’s better. \nIt’s already late in the evening when everyone is dismissed from dinner. Jingyi barely remembers Jin Ling showing them where his room is. He splashes some water on his face and calls it a night. \nIn the morning, Jingyi fumbles his way to the bathroom for a quick shower and discovers Sizhui is already awake. They chat idly about their non-existent plans while Sizhui tidies up.\n“We should really ask Jin Ling what’s next,” Sizhui suggests.\nJingyi checks his phone to find it’s already 10am. “Jin Ling should be up. Let’s go.” He traces last night’s steps until arriving at the room that Jin Ling is staying in and abruptly throws the door open. “Little Mistress, are you up ye-”\n“I told you not to call me that,” Jin Ling mumbles from his spot on the floor. Standing behind him is one of the twins, who’s busy brushing Jin Ling’s hair with a plastic toy. Behind her is the other twin, clipping bows into her sister’s hair. Behind both of them is Jiang Yanli, who patiently combs the girls’ hair out. Fairy lies lazily in front of Jin Ling, happily showing his belly as Jin Ling works on absently brushing him. It’s an incredible snapshot of domesticity.\n“Good morning,” Jiang Yanli says when Jingyi fails to contain his laughter. She’s busy braiding one of the girl’s hair. “Have you boys had breakfast yet? There’s a spread laid out in the dining area from last night.”\n“Thank you,” Sizhui says, just as one of the girls comes over to tug at him. She pushes Sizhui to sit on the floor next to Jin Ling and demands to do his hair too.\nJiang Yanli puts all the hair accessories back into a small box with the help of the other twin. “Don’t bother Lan-Gege, Qianqian. We’re almost done anyway. Don’t you want to go to the lake with Daddy? You made him promise to go with you and Tiantian.”\n“I suppose,” Qianqian says importantly, as if deliberating a grave issue. Jingyi has a few ideas where she may have picked that up from. “Okay.”\nIt takes a while for the girls to pack up. They look offended when Jin Ling pulls a pink heart-shaped clip out of his hair and tries to hand it back, so Jin Ling is forced to wear it until his mother has led both girls out of the room. \n“Jin hair salon, huh?” Jingyi grins. \n“It was worse when they wanted to be chefs and tried to make me eat plastic food.”\nJingyi just cackles more. “What’s our plan for the day?”\n“Food first.”\nTogether, the three of them make it to the dining area. Lan Wangji is already there, silently working on his congee, so they sit down next to him with their assortment of buns and soups. When asked, Lan Wangji admits he’s been invited by Jiang Fengmian to discuss business, which leaves the three of them with no chaperone and no supervision. \nAfter breakfast, Jin Ling takes them on a stroll through the marketplace at Lotus Pier. Merchants line both sides of the street as they blend into crowds of tourists. Jingyi is surprised to find that the shop fronts are all different, each promising a new Yunmeng speciality that he hasn’t seen before. For lunch, they have something light at one of the restaurants overlooking the water. The owner recognizes Jin Ling immediately and tries to give them food on the house, but Jin Ling settles the bill with a gold card that he pulls out of a tacky designer label wallet. \nLotus Pier is bustling with noise from every corner, but it’s a fun kind of rowdiness that makes Jingyi thrum with excitement. He drags Jin Ling and Sizhui around by the arms as they sample all the street food and find suitable souvenirs for Jingyi’s parents. \nThe sun is making its way towards the horizon when they finally wander back to the Jiang estate. They’re greeted by a strange scene in the East Wing courtyard, where the twins are crouched around a large tree. At the top, on a particularly thick branch, sits Wei Wuxian. He waves at the sight of them. \n“Ah! A-Yuan! Lingling! Little Lan!”\n“Don’t call me that!” Jin Ling huffs the same time Jingyi shouts “My name is Lan Jingyi!” up into the tree.\nSizhui glances around. “What’s going on?”\n“Dajiu brought us a kite and it’s stuck in a tree,” Tiantian says quietly, her eyes watering. “Xiaojiu went to find a ladder but Dajiu climbed up. He’s stuck.”\n“I’m not stuck!” Wei Wuxian shouts down, one arm holding the offending kite. “I can come down at any point! In fact, I’ll do it right now!”\n“You’re gonna break a leg!” Jin Ling hisses. “Just stay up there and wait for the ladder!”\nIf anything, this just spurns Wei Wuxian to move more. He drops the kite and laughs when Jin Ling leaps forward to catch it. “Don’t worry about me, Ling-zi! I can do it! You’re not strong enough to catch me anyway!”\n“Just stay up there!” Jingyi snaps at him. “You’re way too high up!”\n“Move aside! I’m seriously going to jump!”\n“NO!” Jingyi and Jin Ling scream in synchrony. \nThankfully, Lan Wangji appears then. He takes one look at the scene and seems to understand the situation. With a wave of his arm, he dismisses both Jin Ling and Jingyi. Even the girls step aside, hiding behind Sizhui. “Wei Ying. Don’t do anything rash.”\nWei Wuxian just laughs more. “Lan Zhan! What are you gonna do? You can’t stop me! Are you gonna catch me?”\nA beat passes before Lan Wangji opens his arms. “I will.”\n“Okay! Here I come!”\nMultiple things happen at once: Sizhui steps in front of both girls and covers the view in case their uncle does break a leg, Jingyi grabs Jin Ling’s arm in a moment of suspense, and Wei Wuxian leaps down from the branch without a worry. Wei Wuxian’s movement is followed by the sound of fluttering fabric as Lan Wangji manages to grab ahold of him, his whole body twisting from the momentum until Lan Wangji turns around, both of his arms wrapped around Wei Wuxian in an incredible bridal carry that reminds Jingyi of clutch saves in wuxia films. \nEven more incredible is the fact that Wei Wuxian makes no effort to part from Lan Wangji’s embrace. “Lan Zhan! You’re so strong!”\n“Strong!” Qianqian says, making grabby hands up. “I want to be picked up too! Up up!”\n“Lan-shushu is busy picking me up. You gotta wait your turn!”\nQianqian looks like she wants to argue, but Jiang Cheng appears then with the aforementioned ladder. She runs right to him, tugging at Jiang Cheng’s arm until he crouches down to listen. Jiang Cheng’s eyes narrow slowly as he takes in the scene. He glares at Wei Wuxian, who is still in Lan Wangji’s arms. “I was gone for ten minutes.”\nThe only response he gets is an absent wave of Wei Wuxian’s hand. “You took too long, and now you can’t play the hero!”\nJiang Cheng looks like he has some words for Wei Wuxian that he can’t say in front of the kids, so he just tsks loudly. He’s starting to leave with the ladder when Jin Zixuan appears, prompting both girls to fly to his side. \nTo his credit, Jin Zixuan doesn’t even ask what’s going on, like he can’t be bothered to comprehend Wei Wuxian’s shenanigans. “I came to tell you all that dinner is ready. Han Guang-Jun, you may want to put my brother-in-law down.”\n“Looks like you have to let me go. We don’t want people to get the wrong idea, Lan Er Gege~.”\nWhat wrong idea?! Jingyi wants to scream. People can only get the RIGHT idea!\nStill, everyone is presentable by the time they arrive at the main dining room. If possible, the food spread is even larger today. Everyone settles into a familiar seating arrangement, with the addition of Wei Wuxian at Lan Wangji’s side. Today, they’re saved from a speech and allowed to dig in immediately. Jingyi is amazed to find that not a single dish from last night’s feast has been repeated.\n“Lan Zhan, you gotta try this. It’s my favorite!” Wei Wuxian say while picking food from a few dishes up with his chopsticks and setting them in Lan Wangji’s bowl.\nJingyi’s eyes nearly fall out of their sockets at the sight. Almost everything is covered with chilli powder to the point where the food is indistinguishable. “Are you trying to kill Han Guang-Jun?!”\nWei Wuxian pauses. “What? Lan Zhan loves spicy food!”\n“Actually,” Sizhui says helpfully. “Father’s palette is quite bland.”\n“Really? But he used to always orders spicy food when we ate together. I thought we had the same taste… Lan Zhan, your appetite really dulled through the years!” He looks to the other adults for agreement, but Jiang Cheng just rolls his eyes.\nLan Wangji doesn't respond. Instead, he valiantly puts a chilli-covered piece of meat into his mouth and swallows it whole. \n“That’s one way of doing it,” Jin Zixuan mumbles, his own bowl devoid of red colored items. He gives Lan Wangji a sympathetic look and goes back to picking soft food for his daughter.\nThe Emperor’s Smile comes out soon after that, and Wei Wuxian’s entire face light up at the sight of the jars. He beckons Jin Ling over to pour for him, which ends in a round of toasts with all the men of the family. \nWhen Lan Wangji shakes his head at Jin Ling, Madam Yu speaks up. “Han Guang-Jun? Aren’t you going to drink with us? You didn’t touch the wine at all yesterday. Surely, if you don’t like Emperor’s Smile, then we can find you something else from my husband’s collection.”\nLan Wangji stares resolutely at his cup and reaches for it. He’s foiled, however, when Wei Wuxian snatches the cup and downs the liquor. \nNext to Jingyi, Sizhui lets out a small breath of relief. \n“Lan Zhan has really bad alcohol tolerance! I’ll drink for him!” Wei Wuxian offers. “I can handle both of our shares and still outdrink Jiang Cheng and Jin Zixuan!”\n“A-Xian,” Jiang Fengmian says. “It’s not a competition.”\n“Besides! Lan Zhan is such an angry drunk! The last time we drank together, he stuck to my side the entire time! I couldn’t shake him off at all because he was so mad at me, haha! Let’s not offend Han Guang-Jun with our drinking habits!”\nEveryone is quiet, staring Wei Wuxian in disbelief. \n“Let’s not pressure Han Guang-Jun,” Jiang Yanli suggests, an unreadable smile on her face. “Besides, you should also hold off on the alcohol, Father. It’s bad for your blood pressure. Why don’t you have some lotus rib soup? I helped Chef Wang prepare it.” \nWhile everyone is served a bowl of soup, Madam Yu turns to Wei Wuxian. “It’s best if you stop bothering Han Guang-Jun. He’s too polite to say otherwise, but I’m sure Han Guang-Jun is only tolerating your overly familiar behavior.”\nWei Wuxian’s smile wavers. He straightens himself up and moves away from Lan Wangji when the man in question stops him. \n“Wei Ying does not bother me. I enjoy his company.” A moment of silence passes over them as every member of the family stares at Lan Wangji. Still, his passive expression remains the same, unmovable as always.\nEventually, Madam Yu lets out of a bark of laughter. It’s equal parts incredulous and amused. “If that’s the way it is, then suit yourself.”\nLater, when dinner is finished and everyone is dismissed, Jin Ling confesses this is the closest thing to approval he has heard from his grandmother. \n“At least she approves of this marriage,” Jingyi mumbles, remembering how Wei Wuxian had downed alcohol like water and walked away from it all unfazed. Jin Zixuan had called it quits early, saying he needed to help the girls get ready for bed. It was a cowardly escape, leaving Jiang Cheng to drink against Wei Wuxian. By the time dessert was finished, Jiang Cheng was busy flicking open peanut casings and sunflower seeds and Wei Wuxian while Wei Wuxian draped himself over Lan Wangji. Madam Yu herself had gone cup to cup against Wei Wuxian before bowing out, to the great amusement and concern of her husband. Really, the entire Jiang family was intent on showing each other up in strange ways that Jingyi cannot begin to comprehend. “Hey. Maybe Wei Wuxian and Han Guang-Jun will drunkenly hook up.”\nJin Ling makes a disgusted face. “Ew. Don’t think about that.”\nTo Jingyi’s disappointment, Han Guang-Jun and Wei Wuxian do not drunkenly hook up that night. Jingyi knows because he gives himself the task of camping behind a bush outside of Wei Wuxian’s quarters, just to catch a glimpse of Jin Ling’s uncle retiring for the night. If they’re lucky, Wei Wuxian would drag a compliant Lan Wangji in with him! Unfortunately, Jingyi’s luck has always been rotten, and he finds himself getting a cramp from crouching for so long. It’s a good thing he didn’t invite Sizhui and Jin Ling along, both of them too indignant for such an important task like espionage. \n“Urg,” Jingyi hisses when his phone runs out of battery. “Where are you?”\n“Where’s who?” A voice asks, and Jingyi falls on his butt at the surprise. Wei Wuxian grins back at him, also squatting behind the same bush. “Who are we spying on?”\nYou! Jingyi thinks but bites his lips from saying. He sits up, crossed legged. “N-nothing! I just heard …That... That this area of the house is haunted. I wanted to see the ghost with my own eyes.”\n“Where’s A-Yuan and Ling’er?”\nJingyi tries to feign annoyance. “Sizhui doesn’t believe in ghosts and Jin Ling went to sleep already.”\n“I see. They have no appreciation for the wonderful world of the occult!” They’re both crouched on the grass with nothing but the courtyard lanterns illuminating the area, yet Wei Wuxian’s grin is unbearably bright. “Why don’t you go hunting with me?”\n“Hunting? For what?”\nWei Wuxian shoots up, grabbing Jingyi’s arm in the process. “Ghosts, of course! Let’s go!” He effortlessly drags a fumbling Jingyi out of the courtyard and through a series of walkways. They encounter a few members of the nightstaff on the way, but for the most part, the estate is silent and peaceful if not for Jingyi’s sputtering. \n“Where are you taking me?” Jingyi demands.\n“The most haunted part of this place!” Wei Wuxian replies cheerfully. He then proceeds show Jingyi a series of baffling locations in the estate: a well where a servant was apparently pushed in by a jealous lover, Madam Yu’s favorite gazebo which allegedly lights up red with the blood of all who’s drowned in the waters but really just feels like a peaceful date location, and an abandoned broom closet where Jiang Cheng found dead rats years ago. Not once do they encounter a ghost, but Wei Wuxian still makes Jingyi keep him company as they sit near the docks. “And that’s how the corpse head of the general came to be buried under the house, and why he comes out to haunt us every spring.”\nJingyi swats at another fly that has managed to land on his leg. He’s been scratching a particular spot on his ankle for while. “That sounds fake, like one of those period dramas. How are these bugs not biting you?”\nWei Wuxian drops a small tube on Jingyi’s lap. “Use this! It’ll help. And anyways, I didn’t steal it from a drama. I actually read it in one of Bingbing’s webnovels!” \nJingyi squints at the tiny pack. “What is this? Toothpaste? You don’t have real bug cream? Aren’t you a doctor?”\n“Sometimes you gotta improvise! I guess you’d rather get eaten alive instead~?”\n“Ack! Gimme that.” Jingyi smoothes a dollop of minty toothpaste on his existing bites and frowns. “How come none of the bugs are biting you? Is your skin too thick?”\nWei Wuxian laughs. “They’ve had enough of me! You’re the newcomer here with your exotic blood~ All the mosquitoes are clambering to get some of that Lan juice. You’re all so plump and pure and sweet.”\n“I’m not a peach ripe for the picking,” Jingyi mumbles. “You’re so weird… I don’t know why Han Guang-Jun likes you.”\nIn an act that truly infuriates Jingyi, Wei Wuxian has the audacity to tilt his head in confusion. “Lan Zhan doesn’t like me! He just tolerates me because he’s so polite and patient.”\nJingyi kind of wants to push Wei Wuxian into the water, but killing one halves of the pair he’s trying to matchmake would be counter intuitive to his plans. Plus, Jin Ling would probably throw a fuss. Jingyi thinks about what Sizhui would do, and tries to reason with him. “Why would you think Han Guang-Jun doesn’t like you? He spends the most time with you.”\n“Lan Zhan just goes along with my whims because it’s easier than the hassle of rejecting me,” Wei Wuxian replies, completely serious. The smile on his face does slip a little, and Jingyi kind of regrets offering to play therapist to someone with the emotional comprehension of a rock. This guy is even more hard-headed than a piece of white rabbit candy that’s been sitting around for too long. \n“Urg,” Jingyi grumbles at last. “Whatever. I want to go to sleep already.”\n“You’re not gonna wait for the ghost head to appear? How lame.” Still, Wei Wuxian cheerfully stands up and leads Jingyi towards the living quarters. \nThe walk back is smoother, calmer, as they’re accompanied by the distant chirping of crickets. Lotus Pier really is beautifully peaceful, with well tended gardens and ponds at every turn. Jingyi thinks it must be so idyllic to grow up here. They’re almost in the East Wing when a familiar bark startles Wei Wuxian, and Jingyi turns around to find Fairy happily wagging his tail near a tree. Next to him is Jiang Cheng, looking bored, while Jin Bing sits a few steps away on the stone steps leading up to the rooms. \n“J-j-jiang Cheng! What are you doing? What is that beast doing?!” Wei Wuxian very obviously steps behind Jingyi. \nJin Bing barely looks up from the glow of her phone screen. “Fairy was getting restless and had to pee. I took him out here and ran into Xiaojiu.”\n“My dog senses were tingling,” Jiang Cheng says seriously as he sits on the stone walkway and plays with Fairy. He seems notably happier to be ruffling Fairy, the look of constant irritation having melted off his face. “What are you doing out here? Are you hazing A-Ling’s little friend?”\n“My name is Lan Jingyi!”\n“The adults are talking, Lan Jingyi,” Jiang Cheng says. He doesn’t look very intimidating with Fairy licking his jaw. \nWell, Jingyi thinks. Wei Wuxian hardly feels like an adult with the way he’s trembling behind him. “I’m leaving now!” Jingyi declares, if only to have an excuse for Wei Wuxian to retreat and lead Jingyi back. Wei Wuxian takes the bait immediately and latches onto Jingyi’s arm, practically dragging him out of the area.\nStill, this gives Jingyi an idea.\nThe next morning, Jingyi drags his tired body out of bed when Sizhui finally comes knocking on their shared door. It’s National Day, and they find a modest assortment of breakfast laid out in the main living room as the Jiang family scatters around the large low table, watching the Beijing National Parade on the large television. Jingyi takes a strip of youtiao and a cup of soy milk. He takes a seat next to Jin Ling, who makes room and grabs two extra floor cushions for them.\n“Don’t eat too much,” Jiang Yanli reminds them while blowing gently on the congee in Tiantian’s bowl. “Remember, we’re going out for lunch.”\nThe parade is pretty typical and anticlimactic. Madam Yu and Jiang Fengmian discuss the unnecessary opulence of it all while Wei Wuxian makes weird commentary that everyone but Lan Wangji ignores. Everyone has various level of interest in the show-- the twins are amazed by the army drill formations, Jiang Cheng comments idly about terrible Beijing traffic, and Jin Bing just stares at her phone screen through the entire televised program. \nAfter the National Parade ends, Madam Yu makes a thinly veiled comment demanding everyone change into proper attire for lunch. Jingyi looks down at his shirt and pajama pants and gulps when he feels the heat of her disapproval.\nAn hour later, everyone gathers at the main gate. Jingyi, having been bullied by Jin Ling into changing into something more formal, is rolling up the sleeves of his button-up shirt when three separate cars come to chauffeur them into the center of Lotus Pier. There, the entire family step into a three story restaurant already crowded with patrons. They’ve booked the entire third floor, which has an open air balcony that overlooks into the busy merchant streets. \n“Grandpa owns this restaurant,” Jin Ling explains when Jingyi’s jaw drops at the sight. “We have lunch here every year and stay through the Lotus Pier parade.”\nWei Wuxian manages to wiggle his way over with Lan Wangji in tow. “The Lotus Pier parade is organized by locals. We never know what they’re gonna include. Last year, there was a blown up balloon of Uncle Jiang whic-” He coughs abruptly. “Which we all agreed was a poor and rude caricature, and not funny in any way. Nope. Maybe this year they’ll do one of our Master Jin~”\n“Not a chance,” Jin Zixuan says wryly. “I’m not a local favorite. If anything, I’d say you or Jiang Cheng are up next.”\n“If it was Jiang Cheng, his balloon head would pop from anger!”\n“I’m about to pop your head,” Jiang Cheng hisses. Next to him, Madam Yu and Jiang Fengmian very obviously ignore this entire conversation.\nJiang Yanli touches her husband’s arm, her smile devious. “What about me, Darling? Do I not warrant a balloon figure too?”\nThis stuns Jin Zixuan for a moment before he says, “A-Li. A balloon will never be able to capture how lovely you are. There’s simply no comparison.” His comment sends half the table into embarrassed groans, but the most embarrassing part is how genuine he sounds. Jin Zixuan looks even more pleased when this reply earns soft laughter from Jiang Yanli.\n“How sweet,” Jingyi tells Jin Ling. “Your parents are still so in love after four kids.”\n“Yeah, but we all know the twins were an accident,” Wei Wuxian whispers, then yelps when Jiang Cheng slaps him on the arm. His comment was quiet enough that everyone either did not hear or chose to ignore him. Still, Wei Wuxian is shameless as always. “Lan Zhan! Protect me from this brute!”\nLan Wangji responds by carefully rubbing at the spot Jiang Cheng slapped Wei Wuxian. \nJingyi is immediately distracted by the food after that. The nightly feasts at the Jiang estate feel almost like child’s play compared to the quantity of dishes served this time around. Ducks and fish and beef and pork and lamb, all prepared in a variety of ways that make Jingyi wish he could become one with the table. Jingyi doesn’t know how he can go back to Cloud Recesses after being spoiled in Yunmeng. Maybe he should be the one marrying into this family, if their beloved Han Guang-Jun fails.\nSpeaking of Han Guang-Jun-- Jingyi turns around to find Wei Wuxian putting dishes into Lan Wangji’s bowl again. This time, the items are only sprinkled with a hint of red. Jingyi kind of wants to scream. How can Wei Wuxian turn a blind eye to their dynamics when they’re already acting like a married couple? How can someone who’s allegedly brilliant in his field be so dense? Is this fun for him? \n“Chew your food,” Jin Ling reminds him. “Breathe. Stop acting like an animal.”\nJingyi sneezes then and almost spits food from his mouth onto Jin Ling’s face. He’s only saved from public disgrace when Sizhui shoves a cloth napkin in front of Jingyi’s mouth at the last minute. \n“I’m never taking you home again,” Jin Ling hisses, turning a piece of eggplant over in his bowl. “All you do is embarass me.”\n“Spoken like a true little princess,” Jingyi says, then makes a noise of complaint when Jin Ling shoves a tiny fried mantou into Jingyi’s mouth to shut him up. \nLunch proceeds like any other large meal. The younger kids are restless by the end, causing Jin Zixuan to pick Tiantian up and take her to the balcony to people watch. Qianqian ends up climbing into the seat next to Sizhui, babbling to him about a story she made up about little carrot people. The owner of the restaurant keeps sending complimentary bottles of alcohol up, and Jiang Fengmian leaves to speak with him and all the other tourists itching to get a glimpse of the Lotus Pier patriarch. \nWhen the eating comes to a lull, Jin Bing pulls out her iPad. Jingyi, Sizhui, and Jin Ling take a go at her rhythm games and try to cheat the system by having all three of them tap on the screen at the same time. They come nowhere near Jin Bing’s original score, despite Jingyi’s best attempt at poking at random dots on the screen. Jin Bing then opens a puzzle game, but Jingyi and Jin Ling’s team loses terribly to Sizhui and Jin Bing’s team.\n“Clearly we are the superior Lan-Jin combo,” Jin Bing says, which makes Jingyi challenge her to a rematch. He doesn’t get his wish because a loud horn signals the beginning of the parade below them. \nSome shuffling ensues as the twins squeeze themselves to the front, held carefully up by a grandparent each so they can see over the balcony. A quick glance below shows that the rest of the street-facing stores are all filled with people lined up at the front to witness the show. \nThe sound of distant drumming arrives first as they catch sight of the lion dancers. An ornately crafted lion head jiggles and preens and drops its mouth as the first lion dancers move around the streets to the excited cheers of the audience.\n“Lan Zhan, did you know? It’s an honor to be the lion dancers opening the parade! Jiang Cheng and I fought for days about who got to be the head the year we turned eighteen! I won, of course-”\n“Only because you got lucky at rock paper scissors!”\n“Pay attention!” Madam Yu chides, effectively silencing them both.\nTwo more sets of lions appear, prancing and jumping and performing stunts. It’s pretty impressive, now that Jingyi knows that the dancers change on a yearly basis and are selected by the parade committee out of all the youths in the area. \nThen comes 24 drums performers, causing the younger kids to vibrate exciting to the beat of the music. Huh, Jingyi thinks, the budget for this must be pretty high.\nThe drummers are followed by folk dancers, the signature dragon dances looping through the streets in golden glory. A group of aunties soon follow, with their long sleeves waving to the sound of folk music. The audience seems delighted, as more and more people appear, crowded on top of each other at storefronts. \nSoon, a group of kids dressed in purple appear with detailed fans. They move messily, but endearingly, to the choreography until all the kids are called back to the center. All of them stretch on cue, their extended fans forming the undeniable shape of a nine-petal lotus.\n“How quaint,” Madam Yu says, sounding pleased. \n“Did you ever participate in this?” Sizhui asks Jin Ling.\nWei Wuxian pokes his head over. “He sure did! And I sure have pictures!”\n“No! Stop it! Pay attention!” Jin Ling demands, face flushed.\nThe procession of balloons are next. Thankfully, there is no caricature head of the Jiang family this time. However, the giant inflated pig is very obviously wearing a qipao with lotus designs. Jingyi is torn between laughing and crying when the pig winks. \n“We need to consider limiting the funds to this,” Madam Yu says. “This is getting ridiculous.”\nJiang Fengmian laughs in amusement, with Qianqian in his arms. “Oh, San-Niang, but I’m enjoying this.”\nAt the very end of the parade are people dressed up as famous characters like the cast of Journey to the West. However, it’s not until they get closer that Jiang Cheng very obviously says, “Oh, no.”\nBelow, someone very obviously dressed as Jiang Fengmian seems to be reacting a skit with another person in red. There’s fake weapons, fake shoutings, and a fake fight scene choreographed until the man in red fake collapses. \n“Oh my God,” Wei Wuxian is laughing so hard he’s crying now. “Is that supposed to be Wen Rouhan?”\nBelow them, a maiden wearing purple appears and swoons at the sight of fake Jiang Fengmian. \n“I’m going to have a serious talk with Organizer Fei,” Madam Yu decides while her family bursts into hysterics. Even Jiang Yanli has to hide her laughter in her husband’s shoulder.\nOn the streets, fake Madam Yu has to be carried bridal style by her fake husband to loud cheers.\n“This parade gets better and better every year,” Wei Wuxian tells a passive looking Lan Wangji. “Wasn’t it great? Didn’t you like it, Lan Zhan?”\nLan Wangji says, “I would’ve liked to see you as a lion dancer.”\nWei Wuxian grins immediately. “Oh! I was only the head, you know! According to locals, Jiang Cheng is the one with the better ass!”\n“If Jiang Cheng finally kills Wei Wuxian,” Jin Zixuan tells his wife quietly while Jiang Cheng reaches for Wei Wuxian with murderous intent, stopped only by Wei Wuxian hiding behind Lan Wangji. “It will be what he deserves.”\nWhile Jiang Cheng’s attempt to eradicate his brother goes on in the background to the annoyance of Madam Yu and the giggling delight of the twins, Sizhui regroups with Jingyi and Jin Ling. “Isn’t Dr. Wei already so close to my Father? I don’t know what to do at this point for him to get a clue.”\n“Oh,” Jingyi says, remembering last night. “I have an idea!”\nJin Ling is pretty sure that all of Jingyi’s plans will always, inevitably, lead them somewhere ridiculous. In this case, it’s with Jin Ling squatting behind a wall as Sizhui and Jingyi position themselves inconspicuously around him, all three of them watching Wei Wuxian speak to Lan Wangji in Grandma Yu’s favorite pagoda on the water. They’re far enough that Jin Ling can’t read his uncle’s lips, much less hear the conversation. “This is a waste of time,” Jin Ling hisses.\n“Patience,” Jingyi replies while holding Fairy in his arms. Fairy looks excited to be included in their plans and proceeds to lick Jingyi’s chin. “We need to wait for the most opportune time.”\nIn the distance, Wei Wuxian sets a hand on Lan Wangji’s arm as he laughs. Lan Wangji looks back at Wei Wuxian silently, comfortably. They exude an air of an old married couple, much like Jin Ling’s parents whenever they get a moment of reprieve from the kids. Not for the first time, Jin Ling wonders if they even need to be here, butting into his uncle’s business.\n“Maybe we should call this off,” Sizhui says, voicing Jin Ling’s concerns. “I don’t think it’s a good idea to bother them, and Dr. Wei really seems to be frightened of dogs.”\nJingyi waves him off with the arm Fairy isn’t currently drooling over. “He needs to get over his phobia anyway. It’s weird to be scared of dogs.”\n“You were scared of the cockroach in the dorm,” Jin Ling points out, irate. \n“That thing was coming for my life!” Jingyi snaps. He then goes on to retell the story of a fist-sized cockroach crawling into his stall in the dorm bathroom, all of which Jin Ling has heard more than once with varying degrees of over-exaggeration. \nJin Ling is distracted from Jingyi’s ridiculous storytelling when a small fist pulls at the sleeve of his shirt, and Jin Ling looks down to find big, brown eyes peering up at him. He hadn’t heard the girls sneak up on them at all, but Qianqian and Tiantian now stand in front of him, blocking his view of the pagoda. They’re much more independent than Jin Ling had been at their age. Not that Jin Ling remembers much except the incident about him throwing a fit over a lost balloon that no one in his family will let him forget.\n“Gege,” Qianqian says, opening her arms wide as if expecting a hug. “Up up.”\nJin Ling sets a hand on her head. “No. You heard Laolao. You’re too old to be picked up now.”\n“Lan-Gege is holding Fairy,” Tiantian says quietly, pointing a tiny accusatory finger at Jingyi. \nJin Ling doesn’t know how to explain that Jingyi is only holding onto Fairy to stop him from interrupting the next stage of their plan. “That’s different.”\nQianqian blows her cheeks up like a goldfish. “It’s not.”\n“It is,” Jin Ling insists, even though he already knows he’s on the losing side of this conversation. His gaze lands back on the pagoda. “Come on, get out of the way.”\n“Wanna play?”\n“We’re busy. You can’t play with the big kids. Go find Bingbing or something.”\n“So you admit you’re a kid, but just bigger?” Jingyi points out with a laugh. “And you’re barely older than Bingbing! Why are you acting all high and mighty?”\n“Um-” Sizhui says but is cut off by Jin Ling’s tsk.\n“I’m way older!” Two whole years are nothing to scoff over, even if they’re almost the same height now. Not that Jin Ling has a complex about it or anything!\n“The girls-” Sizhui coughs. “They left.”\nSure enough, Tiantian and Qianqian have wandered off hand in hand towards the water. Jin Ling watches, jaw slack, as his sisters interrupt Wei Wuxian and Lan Wangji, no doubt asking to be picked up again.\n“We should’ve just done what they asked,” Jingyi mumbles as they watch the girls tug on Wei Wuxian’s pants.\nWei Wuxian, like the rest of Jin Ling’s family, has probably been given Grandma Yu’s decree about not caving to the twins’ demands. Jin Ling personally thinks she’s being too hard on them. Jin Ling himself had gotten piggyback rides from his uncles even after entering primary school, not that he’d admit any of this aloud. \nStill, Jin Ling watches as Qianqian turns her pleading eyes on Sizhui’s father. He’s shocked when Lan Wangji effortlessly picks up a girl in each arm, like they’re Sizhui’s rabbits instead of little bundles of energy that kicked and screamed after missing a nap. \n“Han Guang-Jun really knows how to turn on the charm, huh?” Jingyi says while Wei Wuxian obviously beams. “He’s really working that hot single father angle.”\n“Jingyi!” Sizhui whispers, scandalized. \n“What? I’m just giving credit where credit is due.”\nJin Ling feels the beginning of a headache. “That’s nice and all, but how do we proceed with your plan now? How can Dajiu fall into Han Guang-Jun’s arms when it’s already occupied?”\nAs if answering Jin Ling’s question, Qianqian sticks fingers into her mouth and whistles, loud and shrill. It’s the whistle the trainer taught them when Jin Ling’s parents first took Fairy to doggy school, meant to orientate Fairy and get him to come to them when he’s off-leash. Fairy had responded so well to the training that they started teaching him other tricks.\nUnfortunately, this also means Fairy jumps out of Jingyi’s arms and goes running off towards the girls. Jingyi’s complaint of I got kicked in the chest! is followed by the unmistakable sound of Wei Wuxian shrieking.\n“Oh, no,” Sizhui says. \nIn the distance, Wei Wuxian leaps onto the red side railing and flails while Fairy happily circles him in greeting. Lan Wangji steps in to do something, but Wei Wuxian promptly loses his balance and falls out of the pagoda into the pond. He goes down with a splash, to the sound of laughter and barking.\n“So much for your plan!” Jin Ling hisses at Jingyi. By the time he arrives at the site of the action, Wei Wuxian is sitting in knee-deep water, blowing a wet strand of hair out of his face. The twins are currently making a fuss and protesting Lan Wangji’s attempts to put them down so he can help Wei Wuxian. Fairy, having received a look of disapproval from Lan Wangji, now sits calmly on his hind leg, looking perfectly innocent. Sensing obvious disapproval from Lan Wangji, Jin Ling moves to clip Fairy’s leash to his collar. “S-sorry, Han Guang-Jun!”\n“Apologize to Wei Ying.”\nBefore Jin Ling can do so, Sizhui and Jingyi come barreling towards them. Sizhui leans over the railing. “I’m so sorry, Dr. Wei!”\n“I’m fine!” Wei Wuxian calls back from the water. “Just tell Ling’er to get that beast out of here!”\n“It’s just a dog,” Jingyi says for the nth time. Still, he’s rolling his own pants up and stepping into the water to help Wei Wuxian stand. When Wei Wuxian half laughs, half shivers, Jingyi squints. “You didn’t break anything, did you? Do you need Han Guang-Jun to carry you?”\nGreat, Jin Ling thinks sarcastically. This isn’t obvious at all.\nSizhui, having coaxed Qianqian into his own arms, frowns at the implication. “Jingyi!” \n“What? I’m just saying, better safe than sorry! I think Han Guang-Jun should also check him over for injuries later, in private!”\nDoes Lan Jingyi have money riding on this? Jin Ling wonders as Lan Wangji hands Tiantian over to Jin Ling, Tiantian’s arms wrapping naturally around Jin Ling’s shoulder as he holst her up. Heck. She’s definitely heavier than he remembers! \nLan Wangji doesn’t pause at all before wrapping his pristine white jacket around Wei Wuxian’s shoulders. “Wei Ying, are you okay?”\n“I’m fine~ I’m not a maiden in distress! You don’t have to be so worried!” Wei Wuxian grins before sneezing right into Lan Wangji’s face. \nIn the end, Wei Wuxian is escorted back to his room by Lan Wangji while the boys are tasked with babysitting. Jin Lin supposes that everyone got what they wanted-- Jingyi looks weirdly satisfied with himself for the half-assed plan execution, the girls are happy with being held, and even Fairy gets a treat for his performance. \nJiang Yanli soon finds them huddled in the courtyard and leads the girls away for their afternoon naps. Jin Ling is so exhausted from the commotion that he decides it’s not a bad idea. “I’m gonna nap too,” he says and doesn’t wait for a response before heading back to his room. He doesn’t even protest when Fairy jumps up on his bed and settles happily along Jin Ling’s leg. \nIt’s easy to fall asleep after that. For some reason, Jin Ling dreams that he’s on a boat in the lotus ponds, with Wei Wuxian rowing. “I’m getting married to Lan Zhan,” Dream Wei Wuxian says. “But I have no money for a dowry, so I must drop my treasure in the water in exchange for money and power.”\nIn the dream, Jin Ling can’t speak, but he quickly realizes that he’s the treasure Wei Wuxian plans on throwing overboard. He makes an escape back to shore, where Jiang Cheng is waiting on the back of a giant turtle. The turtle has a collar around its shell, and Fairy is leading it back towards the estate with the end of the leash in his mouth. Jin Ling tries to follow them towards the gardens, but then his grandma appears and tsks.\n“What did I say about picking up the turtle? You’re going to spoil it! Now look how big it’s gotten!”\n“No,” Jin Ling croaks, reaching for the end of the turtle’s leash. His hand lands in something warm. He blinks.\nJingyi is holding the hand Jin Ling has stretched into the air. “No to what?” Jingyi asks, sitting casually at the foot of Jin Ling’s bed. To his right, Fairy snoozes happily on the ground using Sizhui’s lap as a pillow. \n“Why are you here?” Jin Ling drops his arm. He’s vaguely alarmed when Jingyi doesn’t release his hand. \n“We need to talk about the next stage of,” Jingyi lowers his voice. “The plan.”\nJin Ling scowls but doesn’t move to sit up. “What plan? We should just cut it out already. What can we possibly encourage my uncle and Han Guang-Jun to do that they’re not already doing? Are you sure they’re not-” He waves dismissively, their joint hands causing Jingyi to follow the movement of Jin Ling’s arm like a loose jump rope. \n“I agree with Jin Ling,” Sizhui speaks up from running a hand through Fairy’s coat. “Nothing good will come out of force. We should just watch how things proceed.”\nHow Things Proceed is Wei Wuxian sitting so close to Lan Wangji at dinner that they may as well be sharing a seat. Thankfully, everyone is either used to or immune to their special brand of obnoxiousness. Dinner proceeds normally, with Jin Ling’s grandma fussing over the kids eating more while Jin Ling is tasked with pouring alcohol for the adults again.\nThat is, until Qianqian declares loudly, “Lan-Shushu is stronger than Daddy!”\nIf Jin Ling wasn’t standing next to Jiang Cheng at that very moment with a jar of chrysanthemum wine in hand, he would have missed the subtle way his uncle shakes, trying to contain his laughter. One look at his father’s face confirms Jin Ling’s suspicion that they’re about to repeat the infamous Ritchie Ren pissing contest of Chunjie 20XX. \nJin Zixuan is silent as Qianqian tells with vivid detail their afternoon adventure. She even claims that Lan Wangji picked both her and Tiantian up in one arm, which Jin Ling personally did not witness. Eventually, Jin Zixuan smiles and gestures for Jin Ling to go to Lan Wangji. “Han Guang-Jun, I must toast to you for taking care of my daughters so well. A-Ling, pour for our guest.”\n“Lan Zhan can’t drink!” Wei Wuxian repeats for the nth time. “I’ll drink for him!”\n “I insist,” Jin Zixuan says, ignoring the way Jiang Yanli is pressing her face into his shoulder to suppress her laughter. Jin Ling is eerily reminded of the family gathering last year in Lanling where his father had loudly argued with Jin Ling’s shushus late into the night, only for Jin Ling to find Mo Xuanyu passed out on the floor the next morning while Meng Yao nurses an obvious hangover in the guest bathroom. Sometimes his father can be even more stubborn than his uncles.\n“Han Guang-Jun, are you really going to reject the honor of drinking with my son-in-law?” Madam Yu asks smoothly, but the implication is obviously there. There’s no way she’ll accept Lan Wangji as her new son in law if he doesn’t drink with her favorite, and currently only, one. \nJin Ling almost feels bad as he dutifully serves Lan Wangji. In his peripheral vision, he can see Sizhui frowning and Jingyi trying to hide his amusement. \n“It would be my honor,” Lan Wangji says at last. He picks up the liquor cup and raises it towards Jin Zixuan. Then they’re both downing the alcohol to cheers. \nThings almost go back to normal after that, with Jiang Fengmian commenting on how they’d sourced and bottled this particular brand of chrysanthemum wine right in Lotus Pier. Wei Wuxian insists he needs to take a few bottles back to Shanghai, which leads to another walk down memory lane with Jiang Yanli commenting on Wei Wuxian’s unparalleled alcohol tolerance. \nJin Ling is back in his seat when Lan Wangji, who had been entirely silent, stands up. \nThe conversation halts abruptly as everyone looks at him.\n“Father?” Sizhui asks softly, which is Jin Ling’s first indication that something is about to happen.\n“It would be my honor,” Lan Wangji declares.\n“....Yes,” Jin Zixuan says when no one else does. “You’ve said so already, Han Guang-Jun.”\nIf possible, Lan Wangji straightens up even more as he turns to Jin Ling’s grandparents. “It would also be my honor to drink on behalf of Wei Ying. To honor his family.”\nHoly shit, Jin Ling thinks as realization dawns on his grandparents’ faces. Lan Wangji is basically asking for his uncle’s hand in marriage! The entire scene is bewildering and embarrassing. Even Bingbing has put down her phone to focus her attention on the disaster.\nYu Ziyuan’s expression is complicated, but Jiang Fengmian smiles eventually. “Let’s toast!”\n“No!” Wei Wuxian insists. “I think Lan Zhan had too much, hahaha! See! He’s already blabbering nonsense!! Maybe it’s time for him to go to bed!”\n“It’s eight o’ clock,” Jiang Cheng says.\n“And that’s almost Lan Zhan’s bedtime, haha!” He doesn’t wait before attempting to drag Lan Wangji away from the table, but Lan Wangji is immovable like a mountain as he regards Wei Wuxian. “Don’t you want to go to bed, Lan Zhan?”\nAfter an eternity, Lan Wangji says, “If that’s what Wei Ying wants.”\nJin Ling is gonna die. He can’t watch this anymore, and physically uses Jingyi’s back to block his view of the scene. To their right, Sizhui buries his face in his hands, as if he’s forced to witness something shameful. \n“What I want?” Wei Wuxian repeats dumbly. “No! I mean! You just need to go to bed because you’re tired and it’s late! Right? Right!” He seems to be convincing himself more than anyone else.\n“Let’s go,” Lan Wangji agrees, with a hand firmly on Wei Wuxian’s wrist. Then they’re off, heading out of the dining room without bidding anyone goodbye as Wei Wuxian splutters in his wake. \nThey’re gone for a good minute before Jiang Cheng speaks up. “Now I need to drink to forget that. More?” He grabs another bottle and gestures towards Jin Zixuan.\n“Definitely,” Jin Zixuan says as Jiang Yangli bursts into a fit of giggles. \nTo Jin Ling’s family’s credit, they’ve either brushed off or forcibly forgotten the entire thing by the time dinner draws to a close. Wei Wuxian never comes back, and thankfully, no one comments on it. Jiang Yanli spends a good amount of time whispering into the twins’ ears, which leads to Qianqian running up to Jin Zixuan at the end of the night and throwing her arms around his neck. “Daddy is still my favorite!” she declares loudly. “Don’t be mad, Daddy!”\n“I’m not mad,” Jin Zixuan says, although his expression does become visibly less pinched. \n“That was wild,” Jingyi says when they’re walking back to the guest quarters. “Who knew Han Guang-Jun would be so forward?”\nSizhui blushes more, as if he was the one who’d just declared his intention to marry a member of Jin Ling’s family. “Can we please… Not talk about this anymore?”\nJingyi and Jin Ling both shrug, sharing a look. \n“Fine,” Jingyi says. “But we’ll see what happens in the morning.”\nWhat happens in the morning is, apparently, nothing. Lan Wangji and Wei Wuxian make no mentions of what transpired last night, and even Jin Ling’s parents seem uninterested in bringing it up at breakfast. Things are essentially back to normal, or whatever constitutes as normal these days, until Jingyi coughs very loudly.\n“I heard there is a hiking trail close by,” Jingyi says. “Can we go for a walk?”\n“What hiking trail?” Jin Ling replies with a mouthful of food. He doesn’t like where this is going.\nJingyi raises an eyebrow. “Oh? You don’t know? There’s a path up the mountains. Apparently there’s a temple too.” He turns obviously towards Wei Wuxian. “Do you know about it?”\n“Yeah, but it was under construction for a few years after a bad rainstorm destroyed most of the original trail.” Wei Wuxian pauses thoughtfully. “Come to think of it, I haven’t been there in years. Lan Zhan, let’s go check it out! Jiang Cheng and I used to climb up to the temple all the time as kids. I want to see it again!”\n“I want to come too!” Jingyi decides. He volunteers Sizhui and Jin Ling before they get a word in otherwise. “Great! We’re all going for a walk!”\nJiang Yanli, having observed the scene with some interest, smiles at them. “Have fun!”\n“How did you know about this anyway?” Jin Ling asks later, after he’s changed into sneakers and is waiting for them in the courtyard. \n“Your mom told me when I asked her about things to do around here! I need some exercising from all that feasting! Plus, think of potential scenarios that could unite your uncle and Han Guang-Jun! Maybe a landslide? Getting lost in the woods? Forced to share a bed in an abandoned cabin?”\nSizhui clears his throat. “Can we please not wish natural disasters upon my father?”\n“Forget your father! What about us?” Jin Ling demands. “Where we do factor into this landslide? Are we in the cabin too? Do we just die?!”\n“Some sacrifices need to be made,” Jingyi says solemely. “We cannot stand in the way of true love.”\nUnfortunately, true love takes the shape of Wei Wuxian blindly leading them through the newly cleared trail on the east end of Lotus Pier. From the look of things, the hiking path must now be listed in the visitor’s center brochure, because they encounter a handful of tourist on their climb up to the peak. Wei Wuxian almost leads them off the trail multiple times after allegedly spotting pheasants, and Sizhui has to remind them of the markings on the trees. \nOn the hike up, Wei Wuxian tells them stories about forest deities and water guardians that protect Lotus Pier. Sizhui and his father are polite enough to listen along, but Jingyi questions the narrative and plot holes until Wei Wuxian starts going off tangent. \nThe temple at the peak is small, with one main compound and a few incense stations. The groundskeeper recognizes Wei Wuxian and immediately chats him up, leaving the others to roam alone. Jin Ling steps aside when a few travelers walk to the door of the exposed parlor and bows in front of the statue. \n“I’m gonna go make a wish,” Jingyi declares. “Maybe then I’ll ace Math.”\nSizhu nods encouragingly. “I’m sure you can achieve anything with hard work and determination.”\nBoth Lan boys turn to Jin Ling. “What about you?” Jingyi asks.\nJin Ling supposes he doesn’t lack anything in particular. He used to wish for more toys and more attention from his parents, only to realize he was already spoiled on that front. At some point he learned that it was possible for his family to obtain anything with monetary value, so Jin Ling began wishing for companionship instead. What Jin Ling really wants now is a peaceful vacation, to spend more time with his dog, and maybe for Jingyi and Sizhui to stop dragging him into ridiculous plans. He already got two out of three wishes, and is coming to realize that spending time with Jingyi and Sizhui is not so bad.\n“I don’t need anything,” Jin Ling says at last.\nJingyi hums. “Must be nice to have everything you want.”\nThis makes Jin Ling blush, because being friends with Jingyi falls in that category. “W-whatever! Go make your wish! Like you’re not just gonna make Sizhui tutor you.”\nSizhui just smiles placidly at them. “I’m happy to tutor both you and Jingyi.”\n“I don’t need tutoring!” Jin Ling turns away so they can’t see his face heating up. By doing so, he accidentally catches sight of Wei Wuxian watching them from afar. His uncle gives him a very unsubtle thumbs up for god knows what reason, and Jin Ling snorts. \nAll in all, the trek is pretty uneventful and ends with mud stuck along the bottom of Jin Ling’s new sneakers. Wei Wuxian and Lan Wangji never clarify the status of their relationship, and everyone else is too polite (Sizhui), weary (Jin Ling), or weird (Jingyi) to ask outright. \nThe rest of the week continues in a similar fashion. Jin Ling spends his time alternating between babysitting his sisters, playing host to the Lan boys, and tagging along on short outings when he’s not eating or sleeping. He goes on morning walks with Fairy and Bingbing, afternoon trips into town with Sizhui and Jingyi, and gets dragged into shenanigans in the evenings when everyone isn’t watching the newest period drama together in the living room.\nJin Ling is pretty sure that Wei Wuxian and Lan Wangji have settled into some sort of arrangement, but he really can’t bring himself to ask. Even Jingyi seems to grow bored of playing matchmaker after a while, mumbling to himself about lame domestic adults. \nJust like that, their National Week vacation comes to a close. On Sunday, Jin Ling bids goodbye to Fairy and his family before stepping onto the express train back to Gusu. \n“Don’t cry, Little Mistress,” Jingyi says, then laughs when Jin Ling snaps that he just has something in his eye. \nTheir only reprieve is that Wei Wuxian had to report back to work two days ago, saving them from witnessing a teary parting scene between Wei Wuxian and Lan Wangji. Sizhui’s father is silent as always on the train ride back, although he does occasionally stare at his phone. Jin Ling doesn’t have time to worry about his uncle’s love life, as he and Jingyi spend the entire ride back comparing answers on their history homework. Sizhui, being the only one who worked on assignments during break, calmly helps them correct a few answers.\nWith school starting again and the archery club’s preparation for the next tournament, Jin Ling doesn’t think much about Wei Wuxian’s ongoing romance. It helps that Sizhui and Jingyi are equally busy with classes, and the one time they meet up to check on the rabbits, Jingyi falls asleep with a bunny resting on his chest. \nSo really, Jin Ling isn’t expecting to arrive at his standing Sunday lunch date to find Wei Wuxian sighing gloomily. They’re seated at a table in the far back, behind a standing partition that separates them from the rest of the room. That doesn’t stop the other dimsum patrons from looking their way when Jiang Cheng demands, “What the heck is going on with you?!”\n“Nothing,” Wei Wuxian sighs. Something is obviously wrong, because he barely puts any food on Jin Ling’s plate, much less eat anything himself.\n“Did something happen at the hospital?” Jin Ling asks, picking idly at the turnip cake in front of him. \nWei Wuxian shakes his head. “No. Work is fine.”\n“I’m going to the bathroom,” Jin Ling declares. Which really means he’s going to text Sizhui, who’d gone home for the weekend, for an update. The group chat he shares with Jingyi and Sizhui had been weirdly silent, but Jin Ling hadn’t paid much mind to it, assuming they probably got tired of him after an extended week in Yunmeng. \nThere’s a huge line waiting at the bathroom, so Jin Ling heads back to the table instead. He’s about to step out from behind the partition when he hears Jiang Cheng ask, “Did you have a lover’s quarrel with Lan Wangji?”\nWei Wuxian laughs awkwardly. “What? Don’t be silly. We’re not lovers!”\nWhat the fuck, Jin Ling mouths to himself, rooted in his spot. He’s positioned perfectly out of sight to hear the conversation.\n“Don’t pull that shit with me,” Jiang Cheng snaps. “You two were all over each other last week. It made me sick to watch. Don’t tell me you didn’t hook up.”\n“Well-” Wei Wuxian starts, then stops. “That doesn’t matter! It’s not like Lan Zhan has feelings for me!”\nJin Ling’s mouth drops open. The lady pushing the desserts cart gives him a weird look as she passes by, but says nothing.\nJiang Cheng’s voice echoes Jin Ling’s thoughts. “Are you an idiot? Of course he cares about you? There’s been something going on between you two for years. Here I thought you finally got your head out of your ass, and now you’re telling me there nothing?”\n“I told him he should only sleep with people he actually cares about, that we both should. And he got really quiet and-and- we agreed not to see each other for a bit.”\nToo much information. Jin Ling cringes.\nJiang Cheng sighs audibly. “Well? Do you have feelings for him? Are you attracted to him?”\n“Of course I am! Lan Zhang is the most handsome person I know! He’s so talented and kind and thoughtful. Who isn’t attracted to him?”\n“I’m not, for one.”\n“Well, you just don’t know him well enough! You don’t have any experience in the love department, huh?”\n“Don’t divert the conversation. This is about you and Lan Wangji! What really happened between you guys? I know something went down in Yiling.”\nJin Ling knows Yiling is where Wei Wuxian did his residency, but he’s really not old enough to remember what happened around that time.\nWei Wuxian hums for a moment. “The two years I was in Yiling… I didn’t think I would make it out of there in one piece.”\n“What do you mean?”\n“I mean-I wanted to quit. Nothing was going right. I was in a bad place, barely sleeping or eating, living off pure spite over my placement. I missed everyone in Yunmeng and my life here… Then Lan Zhan showed up, and then he kept showing up. He was always in town for business, although I never knew what business. Lan Zhan started meeting me at my apartment, helping me clean up, cooking for me… Eventually he started staying over, and I thought it would be so nice to do this forever and have Lan Zhan with me...”\n“Where is this going?” Jiang Cheng asks. “So you enjoyed being with him? What’s the problem?”\nWei Wuxian falls silent. When he speaks up again, his voice is firmer. “He kept asking me to leave Yiling and to go back to Gusu with him. I was so tempted. I thought I could probably do anything if Lan Zhan was with me, but I couldn’t just leave Yiling! I had duties and a mission there, and leaving would mean giving up everything I worked so hard for. So I said no and told Lan Zhan to leave… I hated how just looking at him made me soft, and just being with him made me feel like nothing else matters as long as I was with him.”\n“Did you explain why you couldn’t leave with him?” \n“I wanted to, but Lan Zhan didn’t seem to care what the reason was. He just upped and left, and I thought, maybe I wasn’t important enough for him to stick around. But things were just starting to look up for me, and then I got transferred… By the time I came back to Shanghai, it all just felt like water under the bridge. I wanted to see Lan Zhan again, but then I heard he had a child or maybe got married? I mean, it should be fine for me to see him, but just thinking about him having a family made me so upset. I thought maybe, eventually, Lan Zhan and I could just go back to the way we were… Maybe we could live together in the countryside when I stopped working, and he could clean and cook for me again? And we’d have no other obligations except towards each other, but we obviously couldn’t have that, so I avoided him instead.”\nJiang Cheng is quiet for a long moment. “And now?”\n“Well, I-fine, now I still don’t know how he feels about me!”\n“You-” Jiang Cheng starts to say, just as Jin Ling jumps out from behind the partition.\n“You!” Jin Ling points at a shocked Wei Wuxian. He wants to scream. “How can you not know how Han Guang-Jun feels about you?! You’re always all over him! I know it, my friends know it, even Fairy probably knows it! You two were so disgustingly married! He practically asked for your hand in marriage in front of everyone! Do you know how much of my vacation was wasted trying to set you two up?! How many stupid matchmaking shenanigans I had to endure? You-you-You villain!”\nWei Wuxian’s jaw drops open. He turns to Jiang Cheng. “Are you gonna let him talk to me like that?”\nJiang Cheng takes a sip of his tea. “I didn’t hear anything that wasn’t true. A-Ling is right. You’re being ridiculous.”\nIn an extremely rare feat, Wei Wuxian opens his mouth only to close it, speechless.\n“Lan Wangji is besotted with you. He’s been for a long time, as incomprehensible as that is,” Jiang Cheng says pointedly. “The fact that you can’t see it makes me concerned about your emotional aptitude, but I actually thought that maybe you refused to acknowledge it because you didn’t feel the same way. But here you’re telling me that you’ve been entertaining married, retirement fantasies with him?? Now I know for certain that you’re just a dumbass.”\n“Yeah!” Jin Ling chimes in. “You need to make up with Han Guang-Jun!”\n“Preferably before he gets sick of you, but I doubt that will happen any time soon.”\nWei Wuxian’s expression shifts before settling between determined and resigned. “I’m gonna go find Lan Zhan. Cover the bill for me, Jiang Cheng!” Then he’s off, grabbing his coat and heading for the restaurant exit. He nearly knocks into the dumplings cart on the way out, but narrowly makes an escape with an incomprehensible apology.\nJiang Cheng waits until Wei Wuxian is out of sight before gesturing for Jin Ling to sit down. When Jin Ling obliges, Jiang Cheng abruptly slaps the back of Jin Ling’s head. “You need to watch your language! Show your Dajiu some respect!”\n“What?! You said I was right!” Jin Ling rubs absently at the back of his head. It doesn’t actually hurt. “And you talk like that to him all the time.”\nJiang Cheng glares, but there’s no heat to it. “That’s because we’re adults. You’re a child and can’t speak to him like that. You’re lucky your mother didn’t hear you talking that way. Now eat properly.”\nJin Ling looks at the amount of food that has accumulated on his plate in his absence and pales. After finishing a small serving of cold tripe, he asked, “Does Dajiu know where he’s going?” \nJust to be safe, he opens Wechat again.\nChicken Exchange Anonymous\n12:23 PM\nJin Ling: Sizhui\nJin Ling: SIZHUI\nLan Sizhui: Yes? ^^\nJin Ling: are you home with your dad right now?\nLan Sizhui: Yes, we’re just having lunch\nLan Sizhui: I actually need to talk to you about something.\nJin Ling: yeah me too. Just wait.\n12:40 PM\nLan Jingyi: lololol this is so cryptic \n \nJin Ling looks up when a waiter comes to refill the hot water in their teapot. “Has Han Guang-Jun really been pining after Dajiu for so long?”\nJiang Cheng gives him a irritated look. “You think you’re the first person who has tried to set them up?”\nObviously not, Jin Ling thinks, remembering the Cloud Recesses baidu tieba. “Are you fine with them? Since they’re both…”\n“Both what? Men? Pining idiots? Liable to give me a headache? Be specific.” Regardless, Jiang Cheng doesn’t wait to continue. “It’s none of my business until Wei Wuxian makes it my business by wasting my time over it. Now eat more food.”\nJin Ling supposes his uncle is right. \nThey’re at the front of the restaurant, Jiang Cheng paying for the bill, when Jin Ling’s phone chimes again.\n \nChicken Exchange Anonymous\n1:15 PM\nLan Sisi: Dr. Wei is here!\nLan Sisi: He just barreled in and started ranting breathlessly. Now he’s speaking to Father in the study.\nLan Sisi: I’m not supposed to be eavesdropping but...\nLan Jingjing: TELL US!\nLan Jingjing: WHAT’S GOING ON?\nJin Lingling: ...\nLan Jingjing: You can’t leave us hanging like this!\nLan Sisi: [Photo]\nLan Jingjing: OH SHIT THEY’RE HUGGING\nLan Jingjing: THEY’RE KISSING?\nLan Jingjing: THEY’RE EMBRACING\nLan Jingjing: OPERATION OLD MEN IS A SUCCESS!!!\nLan Sisi: You don’t need to narrate the photo to us ^^;;\nJin Lingling: wtf… who changed our display names???\n \nPhoenix Mountain &gt;&gt; Xianxian and 2Jade &gt;&gt; [&lt;&lt;][&lt;][89] [90] [Page 91]\n10-18-20XX\nKFCKing: (Image)\n     m1@n_2: OH MY GOD\n     m1@n_2: im gonna die I screamed at my phone and my husband thought an intruder came in. He ran into our room with with the kitchen knife\n          Cxn1223: You’re married? Congrats!!!\n               m1@n_2: Thanks! Our daughter is in elementary school now!\n               m1@n_2: Congrats to Xianxian and 2Jade too!\n          Sweet_XY2: hope he was holding cleavers\n     Cxn1223: Is this for real?\n           KFCKing: You bet!\n           m1@n_2: I waited 15 years for this\n     Ba0ba09: nice to see love is still alive in cloud recesses\n     Cxn1223: I never expected for this thread to be revived but I’m blessed for it\n     AQinQin: what the hell i never knew this thread existed… I just read through all 90 pages.. What the ever loving fuck happened\n          Sweet_XY2: you need to get a life\n                     AQinQin: shut your pie hole\n     Oy@ng@ng: Umm where did you get this photo?\n          KFCKing: Secret~\n\nEpilogue\n\nIt’s Spring when they’re all in Yunmeng again, Jin Ling dressed like a glorified waiter as he shows people to their tables. His only consolation is that Sizhui is also here, forced to play host to the incoming stream of reception guests while Jin Ling’s grandparents make small talk with unfamiliar faces.\nJin Ling huffs. He’s still mildly annoyed at his stupid uncle, the stupid elopement, and his Grandma’s insistence on having a stupid reception to make up for the lack of a stupid wedding. \nMadam Yu had had been furious upon learning that Wei Wuxian and Lan Wangji eloped on their trip to Taiwan. They’d even had the audacity to make a show of it by getting married in every country possible. Then came the honeymoon to Europe, Wei Wuxian spamming his Wechat moments with endless badly taken selfies of the happy couple. \n“Weddings are occasions for family and friends! How could you even consider forgoing it?!” Madam Yu had hollered at Wei Wuxian during the following family gathering. Then she’d decided that an elaborate reception was necessary. Jin Ling was pretty sure Wei Wuxian had only agreed because Madam Yu insisted on planning it to the last detail, leaving Wei Wuxian with no responsibility whatsoever except to keep his marriage alive until then. \nJin Ling supposes that part isn’t hard, what with the way Wei Wuxian is currently laughing into Lan Wangji’s neck as the two of them greet guests hand in hand. Jin Ling wrinkles his nose. Gross. \n“A-Ling,” Jiang Yanli says, appearing out of nowhere. “There are more guests.”\nSure enough, Lan Xichen is now at the door, politely depositing a red envelope into the box. Sizhui has beaten Jin Ling there as he greets his uncle. Well, also Jin Ling’s uncle now. His uncle-in-law? Jin Ling’s head hurts just thinking about it. He follows his mother to the door.\n“Ze Wu-Jun!” Jingyi is present too, dressed in something probably too casual. He’d spent the last few hours lounging around until Headmaster Lan had ordered him to help Sizhui and Jin Ling. “Long time no see!”\nLan Xichen smiles. It’s weird for Jin Ling to think this is what Lan Wangji would probably look like if he could express emotions on command. “Sizhui, Jingyi-- it’s nice to see you again. Madam Jiang-- It’s always a pleasure.”\nJiang Yanli laughs softly. “There’s no need to be so formal. I’d say we’re already so close, but now we are actually one family. You already know A-Ling.”\n“Good evening,” Jin Ling says stiffly, and glares when Jingyi snickers at his formal behavior. \nThe happy couple chooses then to join the conversation, Wei Wuxian’s arm still looped through Lan Wangji’s as people mingle around them. Wei Wuxian looks much brighter these days. He’s always been a bit of a people pleaser and played the role fit for someone used to being the center of attention, but nowadays Jin Ling’s wayward uncle looks happy and complacent just simply existing in Lan Wangji’s orbit.\n“Brother,” Lan Wangji says softly while Wei Wuxian goes on a long winded greeting for his brother-in-law, recollecting some event or another from their shared past.\nJin Ling zones out for most of it until his mother taps his shoulder. “A-Ling, please take Ze Wu-Jun to his seat.”\n“This way,” Jin Ling says as both Lan Xichen and Sizhui follow. He only gets halfway across the room before Lan Xichen halts at the sight of familiar faces. Jin Ling should be annoyed, but he’s somewhat intrigued when Sizhui makes a soft noise of embarrassment. Together, they trail after the man to the errand table. \nLan Xichen is all smiles as he speaks to Sizhui’s relatives? Cousins? Second Aunt twice removed? “Long time no see, Dr. Wen. Nurse Wen.”\nWen Qing seems completely unmoved by Lan Xichen’s charms, a complete contrast to the man next her who looks flustered. “I’d say the honor is all mine. It’s no surprise to see you here.”\n“It’s not everyday I get to celebrate my younger brother’s marriage.”\n“Is that so? You should tell your brother that,” Wen Qing replies smoothly, nursing a cup of tea. “He sure likes to appear at the hospital and obstruct our work everyday.”\n “Jie! I think it’s sweet that Han Guang-Jun visits Dr. Wei and brings him lunch every day! I, um, think it’s also good for the nurses’ morales. And you were so thankful for Ze Wu-Jun’s presence the last time we went drinking with Dr. Wei and Han Guang-Jun.”\nJin Ling raises his eyebrows while Sizhui flushes at the obvious start of another incriminating story about his father.\n“It’s not my fault Lan Wangji is such a lightweight,” Wen Qing says primly. “Wei Wuxian would’ve been able to take his perfect husband home by himself if Lan Wangji wasn’t busy making a drunken scene.” She pauses, then says something surprising. “Marriage is good for them.”\nLan Xichen just smiles in agreement. His eternally pleasant expression doesn’t change even when Jin Ling’s grandmother arrives at the table, her face stern as always. She gives Lan Xichen and Sizhui’s relatives curt greetings while lamenting Wei Wuxian’s inability to entertain the guests. \n“Dr. Wei seems busy,” Wen Ning suggests helpfully and receives a scrutinizing look from Madam Yu for it. \n“Han Guang-Jun is too obliging,” Madam Yu says. “And to think Wei Wuxian was able to secure such a wonderful match while Jiang Cheng is still tragically single-”\nJiang Cheng sneezes loudly from across the room, where he is speaking to people who look too stuffy to be anyone but business associates. Bingbing, dutifully playing the role of the perfect Jin Heiress, hands him a tissue.\n“I’m sure Wangji’s affections for Dr. Wei is not limited to his family background, however excellent they are…” Lan Xichen replies.\n“Yes, yes, your brother has no shortage of praise for his Wei Ying. It’s a wonder they ever lived without each other, with the way they’re now attached at the hips. I haven’t seen anything as sickenly sweet since Zixuan begged A-Li to marry him. ” Madam Yu makes a dismissive hand wave, but her pleased expression belies her ire. “Ze Wu-Jun, let me escort you to your table. We have much to discuss.” Then she walks off with a hand set firmly on Lan Xichen’s arm-- an act that Jin Ling always thought was an endearing habit from his mom that he now recognizes as a power move passed down in his family. \nSizhui just gives Jin Ling a sheepish smile. It’s an expression he’s adopted a lot since his father threw all caution to the wind and began engaging in gross amounts of PDA with Jin Ling’s uncle. “Shall we go back?”\n“Work hard, A-Yuan,” Wen Ning says when Jin Ling and Sizhui head back to the entrance. \nThe man currently chatting with Wei Wuxian at the front is vaguely familiar looking. Jin Ling has to do a double take when he recognizes Nie Huaisang, someone he has always associated with his dad’s side of the family. This converging of people of interests is starting to give Jin Ling a headache. He’s just glad his father is away on a business trip and the twins are too busy being preoccupied and babysat by the endless stream of relatives present.\nNie Huaisang is currently accompanied by a woman in pink who looks less like a date and more like a handler. She looks amused at the way Jingyi is currently gaping at her.\n“Ling’er! A-Yuan!” Wei Wuxian beams. Somehow, he’s still hanging off Lan Wangji’s arm. “Come meet my old classmates! I haven’t seen them in forever! Huaisang, I still can’t believe you ran into Mianmian!”\n“Yes, it was quite a coincidence.” The woman, the legend, baidu user m1@n_2 smiles back at them. “I’m sorry for crashing your reception unannounced.”\nWei Wuxian grabs her hand. “Don’t be silly! Of course you’re welcome! And to think most of our original hiking group are all here! Who’d thought Lan Zhan and I would end up together? I seriously thought he would kill me out of annoyance when we got stuck in that cave together, hahaa!” \n“Yes,” Mianmian says. “What a surprise.”\nJin Ling has to clench his jaw shut to stop himself from calling out the obvious lie. From the looks of things, Jingyi is struggling equally hard as he tries to hide behind Sizhui. \n“Your kids are quite handsome,” Mianmian adds, apropos to nothing.\nWei Wuxian just grins. “Lingling gets all of his good genes from me, of course~ Sizhui is Lan Zhan’s baby bun. He takes after the handsome Han Guang-Jun.”\n“Mn,” Lan Wangji replies passively. No one bothers to point out that neither Jin Ling nor Sizhui are genetically related to either of them.\n“And this is their friend, Lan Jingyi~”\nNie Huaisang chooses then to unfold his handheld fan and hide his obvious laughter behind it. The amused look Mianmian is sending Jingyi also makes sense, for Lan Jingyi is the only idiot who would use a real photo of himself holding a drumstick as his baidu icon. \n“It’s nice to have friends,” Nie Huaisang says cryptically. “Friends who look out for you, watch your back, and investigate your personal life through the internet.” He levels a particular look at Jin Ling.\nWei Wuxian blinks while Lan Wangji gives the Lan boys a searching look. “What?”\n“What?” Nie Huaisang echoes the question back, feigning innocence. \n“What do you mean?”\nNie Huaisang closes his fan. “Oh, ignore me. I was just lost in thought. Now please excuse me. I must find Jiang-Xiong. I believe he owes me some money.” He heads for the other end of the room with Mianmian in tow.\nBoth of them are barely out of earshot when Jingyi bursts out laughing. He runs out of breath and has to use Sizhui as an anchor while Jin Ling does his best to stare through the ceiling.\n“For the record,” Wei Wuxian says. “I know the three of you are up to something. I’m just choosing to ignore it. Oh, there’s my coworker. I gotta go talk to her!”\nLan Wangji waits until Wei Wuxian has run off to turn to them. “Say nothing to Wei Ying,” he warns them placidly, which now explains his willful participation in their matchmaking schemes.\nSizhui just hums as he watches his father leave. “I guess we really weren’t the first people who tried to set them up.”\nAcross the room, Wei Wuxian is laughing as Lan Wangji wraps an arm around his waist. Wei Wuxian beams up with unbridled happiness. It’s a little gross and a little sweet. Jin Ling sincerely hopes that the two of them will never drift again so they can be the last people to bring them together."
}