{
    "id": "17759321",
    "url": "https://archiveofourown.org/works/17759321?view_full_work=true",
    "author": [
        "SailorChibi"
    ],
    "title": "Best Served in Front of the Whole School",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M"
    ],
    "fandoms": [
        "Miraculous Ladybug"
    ],
    "relationships": [
        "Adrien Agreste | Chat Noir/Marinette Dupain-Cheng | Ladybug"
    ],
    "characters": [
        "Adrien Agreste | Chat Noir",
        "Marinette Dupain-Cheng | Ladybug",
        "Lila Rossi",
        "Chloé Bourgeois",
        "Tikki (Miraculous Ladybug)",
        "Plagg (Miraculous Ladybug)"
    ],
    "additional_tags": [
        "Post-Episode: s03 Caméléon | Chameleon",
        "not lila rossi friendly",
        "the salt is strong in this one",
        "i am seriously bitter about lila guys",
        "protect marinette dupain-cheng",
        "the girl deserves so much",
        "Identity Reveal",
        "Secret Identity Reveal",
        "Marinette Dupain-Cheng | Ladybug Identity Reveal",
        "Adrien Agreste | Chat Noir Identity Reveal",
        "Angst",
        "Angst and Fluff",
        "Revenge",
        "sometimes there is no high road ok",
        "Protective Adrien Agreste",
        "Lila Rossi deserves to be taken down",
        "lila rossi is a psychopath",
        "mild violence",
        "but really nothing more extensive then what you see in the show itself",
        "Marinette Dupain-Cheng Needs a Hug",
        "Lila Rossi is a Liar",
        "Marinette Dupain-Cheng Angst",
        "Adrien Agreste Is So Done",
        "seriously this fic is just me being pissed about lila and exposing her in front of the school",
        "like she deserves",
        "Chloé Bourgeois Redemption",
        "it's kind of a redemption in that she also hates lila",
        "Chloé Bourgeois Finds Out",
        "Miraculous Holder Chloé Bourgeois",
        "open ending in some ways",
        "but a happy ending"
    ],
    "language": "English",
    "series": "",
    "published": "2019-02-12",
    "completed": "2019-03-11",
    "words": "18,662",
    "chapters": "8/8",
    "comments": "735",
    "kudos": "21,114",
    "bookmarks": "3,738",
    "hits": "244,695",
    "summary": "<p>When Lila goes a step too far by physically attacking Marinette, that's it: Adrien's reversing his stance.</p>\n<p>That girl is going <i>down</i>.</p>",
    "notes": "<p>I don't have much to say except I really hate Lila and I hope she gets her comeuppance in a big way. This fic is fully written, clocking in at just over 18,000 words. Chapter count may vary a bit depending on how I break the story up into chunks.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Wow, I'm kinda bowled over by the response to this fic. Thank you so much for all the comments!</p>\n<p>Thank you so much for all the comments, kudos, bookmarks and subscriptions on this fic. I'm so glad y'all are as salty as I am. I really hope you enjoy the last chapter, and that it lives up to your expectations!</p>\n<p>Find me on <a href=\"https://tsuki-chibi.tumblr.com/\" rel=\"nofollow\">tumblr</a>.</p>",
    "text": "Chat is the first to admit that he's distracted when he shows up for patrol that night. It's been a long day, and his mind is still dwelling on what happened earlier. Spinning around in useless circles, actually, as he tries to figure out how he could've done better. How he could’ve protected Marinette better. But short of pushing Lila Rossi out the window of the classroom, he's still not sure what he could have done. \nFrankly, pushing Lila out the window hasn't been scratched off the list as an option.\nSo he's distracted, but not even he could miss the fact that there's something wrong with Ladybug. There's no cheerful greeting, not even a greeting, when she lands beside him. Chat glances over at her, a teasing remark springing to his lips, but the words die on his tongue when he catches sight of her face. There's a bruise on her right cheek and a cut on her bottom lip. The injuries are so familiar that it takes his brain several seconds to accept what he's seeing, and realize that he's not just superimposing the injuries of another blue-eyed brunette onto her lovely face.\n\"My Lady?\" he whispers. \"What happened?\"\nLadybug's bottom lip trembles. Then suddenly, her face crumbles as tears well up in her eyes. The sight of it is familiar to Chat, yet he has no chance to fully grasp why it's familiar. She turns towards him, arms half-raised; Chat jolts, responding to the silent question, and moves towards her, carefully wrapping her up in a hug. She sinks into him, her cheek coming to rest on his shoulder as she shakes with sobs. \n\"I c-can't st-stand it anymore,\" she cries. \"I'm tr-trying s-so... so hard and she just w-won't leave me a-alone!\"\n\"Tell me,\" Chat says softly, his heart sinking through the floor. He's pretty sure he already knows what Ladybug is going to say.\nLadybug cries for a couple of minutes before she starts to talk, her words broken by sobs. \"There's this girl in my class. She's a liar, but she's a good liar. Everyone believes whatever she says and she hates me. She threatened me. She said she would make me lose all my friends and make Ad-this guy that I like her boyfriend. She said I'd be left alone.\" \nChat's heart is pounding in his ears. \"She sounds like a horrible person.\"\n\"She is!\" Ladybug bursts out, her fingers digging into his back. \"She's awful! I... I tried to ignore her. I really did. I kept myself back... I didn't want anything to do with her. And that just pissed her off. She attacked me today. She slapped me across the face. And then... and then we got caught... she told everyone that I attacked her. And they believed her! Oh Chat, I got suspended!\" Ladybug's voice breaks as she collapses into renewed bawling. \nMarinette is Ladybug. Chat stands there dumbly, both arms wrapped around his beloved partner, and tries to understand the magnitude of not how badly he's fucked up, but how badly everyone at Collège Françoise Dupont has fucked up. It's almost too much for his brain to wrap itself around, especially when there is one rising thought that swells above everything else.\nBeing thrown out a window is too good for Lila Rossi.\n--\nIt was an otherwise normal Monday, if you discounted the fact that Adrien had spent the whole day visiting his teachers to get all the homework for the week. His father was demanding Adrien's presence at company events from Tuesday to Saturday. Adrien wasn't even sure what he would be spending his time doing, but he knew that he could look forward to some very long days capped off by struggling to get through several days of schoolwork in the span of a couple hours. He honestly wasn't sure when he was going to find time to sleep.\nMaybe that was why he'd gotten all the way to the front doors before he realized he'd forgotten his math book. He sighed heavily but made the trek back to Ms. Bustier's classroom and pushed the door open, fully expecting the room to be empty since it was late afternoon on a Monday. He looked up when he realized that it wasn't - and froze.\nLila and Marinette froze too. \nThere was a tense pause as Adrien's wide eyes took in the scene. Lila had Marinette by the hair, forcing Marinette to bend double. It looked like Lila was in the process of drawing her knee back, and Adrien's shocked brain quickly realized that there was only one target: Marinette's face. Marinette's bruised, bleeding face. \n\"Oh my god, Adrien! Thank goodness you're here!\" Lila cried, snapping out of her surprised state. She released Marinette's hair and rushed over to Adrien, grabbing his arm and pressing herself against his side. Big tears formed in her eyes. \"Marinette, she - she just lost it and suddenly attacked me! I was doing everything I could to protect myself. I was so scared!\"\nMarinette was staring at the two of them. To Adrien's experienced eye, she actually looked more confused by what was going on than anything else. He watched as Marinette slowly lifted a hand to her face and touched her split lip. She flinched a little at the pain and lowered her hand, staring at the blood on her fingers with an expression of befuddlement. Then she looked back up at Adrien and Lila. That brought the bright red mark on her cheek into stark relief. Adrien didn't think it was his imagination that it looked like a handprint.\n\"Marinette attacked you,\" he repeated flatly, a wave of pure fury piercing through the shock. Part of it was directed at Lila, but he was also furious with himself. He was the one who'd told Marinette to take the high road, to just ignore Lila and ler be. And now this.\nMarinette flinched again, her eyes widening. Adrien watched in horror as they started to fill with tears - genuine tears, not the fake ones that Lila could summon on cue. Her hands fall back to her sides as the tears start to roll down her cheeks. And in that moment, Marinette Dupain-Cheng, one of the strongest people that Adrien knew, looked completely and utterly defeated. It was a heartbreaking sight.\nLila smiled. \"Let's hurry and call the principal, Adrien, before she tries to get away.\"\nAdrien snapped. He jerked his arm free of Lila and hurried over to Marinette. She had her head down, eyes closed, so she didn't see him coming. She startled violently when he gripped her shoulders, but Adrien didn't let go. He gentled his hold, but he thought that too many people had let Marinette down over the past month. It was high time someone began helping her.\n\"I'm sorry, Marinette,\" he said, staring straight into her wide eyes. \"I never should've told you that it was okay if just you and I knew the truth. I didn't think it would come to this. I'm sorry.\"\n\"What?\" Lila exclaimed behind them. \"She attacked me!\"\n\"If you think I'm going to believe that, you must really be stupid,\" Adrien hissed, turning to face Lila. He wrapped a protective arm around Marinette's shoulders. \"I know what a liar you are, Lila Rossi. Your bullshit isn't going to work on me. For someone who's claiming to be attacked, you look pretty put together. The only person with injuries that I see here is Marinette.\"\nLila sputtered, clenching her hands into fists. \"I just don't bruise easily! I can't believe you're taking her side!\"\n\"Someone has to,\" Adrien seethed, taking out his phone and texting Nino. \"I've told Nino to get the principal. Don't move, Lila.\"\nLila glared at them. Then, suddenly and much to Adrien's amazement, she started messing up her hair and tugging at her clothing. His jaw dropped as she actually ripped her the hem of her shirt. He couldn't figure out what the hell she was going until the door opened again and Principal Damocles hastened in, followed by Nino and Alya. Lila took one look at the principal and burst into fresh tears, throwing herself at Principal Damocles just like she had at Adrien.\n\"Marinette attacked me!\" she wailed. \"I was just sitting in my seat and - and - she started yelling at me for working too closely with Adrien and then the next thing I knew she pushed me to the ground!\"\n\"That's not true!\" Adrien said furiously.\n\"You weren't even here!\" Lila cried.\n\"Is that true, Adrien?\" Principal Damocles asked, looking over at them. He was frowning, and Adrien suddenly realized how it looked: he was holding Marinette like they were a couple, which was making Lila's story about Marinette's jealousy look true. \n\"I - well yes, but -\"\n\"I think that Miss Rossi, Miss Dupain-Cheng and I need to have a talk,\" Principal Damocles said, cutting Adrien off. \"Immediately.\"\nAdrien's mouth hung open uselessly as Marinette pulled out of his grasp. She kept her eyes on the ground as she walked quietly over to the door. Alya and Nino stepped aside to let the three pass. \n\"Wow,\" Alya said once they were gone. \"That was crazy.\"\n\"Right?\" Nino said.\n\"I knew Marinette was jealous about Adrien, but -\"\n\"Are you kidding me?!\" Adrien yelled. Both of them jumped.\n\"Dude!\" Nino said. \"What's your problem?\"\n\"You! This whole class! We've known Marinette for years, but as soon as Lila comes around you guys start taking her side without even questioning her. You,\" he said furiously to Alya, \"are supposed to be an investigate journalist! What kind of journalist just blithely accepts whatever she's told without asking questions? And you!\" He turned on Nino. \"You've been friends with Marinette since you were kids! You should know her better than any of us!\"\nHe stormed up the steps to Marinette's desk, where her bag was, and grabbed it. Alya was just starting to sputter a response, but Adrien didn't want to hear it. He stomped past her and headed towards the front of the school. He would only get in trouble if he went to Principal Damocles's office to show his support for Marinette. He recognized now that he should've kept his mouth shut until a better moment, when he could've told his side of the story. Now it would only look like he was making things up to get Marinette out of trouble, instead of telling the truth.\nBut he wasn't going anywhere until Marinette came out. She needed to know that someone was on her side, and Adrien needed to know how things had gotten this bad. He doubted that Lila had just spontaneously attacked Marinette. There had to be build-up. Signs he'd missed. Things Marinette had suffered through alone. Adrien wanted to know everything Lila had done so that she could be paid back twice over for each transgression.\n\"You know,\" Plagg said. \"I would go along with it if you wanted to Catacylsm her.\"\n\"Don't tempt me,\" Adrien muttered, sinking down onto the front steps. He set Marinette's bag beside him, keeping it tucked beneath his arm. \n\"I'm just saying. It's an option. She would just disappear. No body, no muss, no fuss.\"\n\"It should concern me that you seem to know that for a fact, but honestly it's just making me want to pay that bitch a visit tonight,\" Adrien said. Plagg just chuckled darkly and disappeared back into Adrien's pocket.\nIt was a full half hour before the door opened behind him. Adrien leapt up just in time to see Marinette walk out. If he'd thought she looked bad before, it was nothing compared to now. Her face was streaked with tears and her chin was covered in dried blood, though at least it seemed like her lip had scabbed over. She stopped when she saw him, fresh tears rolling down her cheeks. She covered her lower face with a shaking hand.\n\"I've been suspended for the rest of the week,\" she said brokenly. \"Principal Damocles believed her... just like everyone else.\" She started to sob then, her whole body shaking with the force of it.\n\"Oh, Marinette.\" Adrien closed the distance between them, pulling her into a hug. She clung to him, crying into his shoulder. \n\"My parents are gonna be so mad at me,\" she wept. \"Principal Damocles called them... he told them I attacked Lila... he said they needed to get me under control.\"\nAdrien's heart broke for her. \"No. There's nothing wrong with you. It's Lila who has the problem. I'm so sorry. I never should've told you to ignore Lila.\"\nMarinette just shook her head. \"What difference does it make? Everyone hates me anyway,\" she whimpered.\n\"I don't hate you,\" Adrien whispered. Actually, right now he'd happily committ murder on Marinette's behalf. \nHe was keenly aware of the fact that they were attracting curious glances from the handful of students still around, but Marinette seemed too distraught to do much more than stand there and cry. Adrien made an executive decision and bent, sliding an arm behind her knees. He lifted her up with a little more effort than he would've expected; Marinette was small, but compact. But he was Chat Noir, and increased strength followed him into his everyday life.\nIt was a sign, he thought, of how overwrought Marinette was that she didn’t react, just kept crying against him. He wanted to soothe her, but thought it was more important to get her home. He paused to grab their bags and then kept walking, carrying Marinette out the school gates; they crossed the road and headed down the street towards the bakery as quickly as Adrien could move.\nA customer saw them coming and kindly held the door open for them. Adrien thanked her with a polite smile and nod. Marinette’s mother was standing behind the counter. Her hands flew to cover her mother when she saw the state of her daughter. \n“Marinette!” she cried. “Oh, Adrien, thank you for bringing her home. This way.” She ushered them both upstairs to where Marinette’s father was waiting.\n“Oh, my Marinette,” her father said, his face falling. He held his arms out. Adrien hated to hand Marinette over, but it wasn’t like he could keep her. He gently passed Marinette into her father’s arms and watched as her father carried Marinette out of the room.\n“Thank you,” Madame Cheng said again, touching Adrien’s arm.\n“It was no problem,” Adrien said, setting Marinette’s bag on the floor. “Madame Cheng –”\n“Call me Sabine, please, dear.”\n“Sabine,” Adrien repeated awkwardly. “What happened today, it wasn’t Marinette’s fault. She got the blame for it, but please don’t be angry at her. This is all Lila Rossi’s fault. And… it’s mine too.” He lowered his gaze, ashamed. “The only person who hasn’t done anything wrong is Marinette.”\nMadame Cheng was quiet for a moment. Then she sighed. “I appreciate you telling me that. I think my husband and I need to have a very long chat with our daughter.”\n“Oh, right,” Adrien said, realizing that was his cue. “Would you, um. Would you tell Marinette that I… that I’m sorry? And that I want to help her?”\n“Of course I will.” She patted his arm. “Please help yourself to anything you want from the bakery on your way as our thanks.”\nAdrien nodded, but he knew he wouldn’t take anything. He didn’t deserve it. He quietly slipped out of the Dupain-Cheng’s apartment; his last glimpse was of Madame Cheng heading down the hall where her husband and daughter had gone, her expression filled with concern.\nIt takes a long time for Ladybug to cry herself out. Chat holds her tightly the entire time, stroking her hair and trying to offer what comfort he can. It’s probably the most contact he’s ever had with her, but he can’t even enjoy it because it’s his fault. He spends the whole time torn between feeling like the worst person on the planet and fighting the urge to go track Lila down so he can accept Plagg’s offer to use Catacylsm on her.\nAt last, Ladybug sniffs and pulls back slightly. Her face is a mess, and she sniffs as she wipes at her face with shaking hands. “I’m sorry for that, Chaton,” she croaks, her voice thin and raspy. “I didn’t mean to explode on you like that.”\n“My Lady, you never have to apologize for that,” Chat says, meaning it. “I’m always going to be here for you, no matter what. And I’m going to help you figure this out. You’re not alone anymore.”\n“I know that. Actually… there’s a boy in my class who wants to help me too.” Ladybug’s cheeks turned pink, the color seeping beneath her tear-stained mask. “I guess… it’s the silver lining, you could call it.”\n“The silver lining?” Chat echoes blankly. “What do you mean?”\n“N-nothing.” Ladybug turns away quickly.\n“Do you have a crush on this guy?” Chat presses, hardly able to believe he’s actually having this conversation. Hardly to hope what the answer might be.\nLadybug blushes harder. “Don’t tease me, Chat,” she whispers. “Not right now.” Her face is still wet, beautiful blue eyes vulnerable.\n“No, that’s not – I just – ” Chat forces himself to stop and take a deep breath, then reaches out to take her hands. “Bugaboo, I owe you the biggest apology in the world. I didn’t understand the full scope of everything Lila did until now, and I hate myself for telling you that exposing someone like that never goes over well, and for telling you that you should take the high road. That wasn’t fair to you, and I’m really sorry.”\n“Chat?” Ladybug frowns. “What are you –”\n\"Plagg, claws in,\" Chat says. As the green light rolls up over his body, Ladybug makes a startled sound and tries to pull her hands away. Adrien tightens his grip reflexively, unsurprised when she squeezes her eyes shut.\n\"Chat! What are you doing?! We can't know each other's identities!\"\n\"But I already know, Marinette,\" Adrien says as gently as possible.\nShe stiffens then, her face going pale. Suddenly, a similar red light appears around her ankles and quickly sweeps up and over her. Marinette is left standing in front of him, wearing the same pajamas she'd been wearing that day Adrien's fans chased them all over Paris. Her eyes are still squinched shut, her mouth forming an adorable little 'o' of shock as Tikki zips over to Plagg with a happy squeal. Plagg lets out a yelp as Tikki's tackle sends them both spinning head over heels towards the opposite side of the building.\n\"T-Tikki!\" Marinette stutters.\n\"Uh, I think they're gone,\" Adrien says, squinting. His eyesight is still better than the average human, even in the dark, but there's something about kwami that make them blend into shadows spectacularly well.\n\"I can't believe this,\" Marinette says. \n\"Bugaboo, it's just me. Please open your eyes? It's okay, I swear.\"\nA line develops on Marinette's forehead when she scrunches her face. Adrien is seized with almost irresistible urge to lean forward and kiss it away. He's never seen that line without the mask. He almost misses the moment when her eyes finally blink open and focus on him. Her mouth drops open wider as recognition flashes across her face. She stares at him in wonder, and he lets go of one of her hands so that she can reach up towards his face. Her fingertips touch his cheeks, tracing the place where his mask would normally be.\n\"Adrien?\" she whispers. \"It's you?\"\n\"Just me,\" Adrien says. He's still got one of her hands, and he brings it up to his lips and kisses her knuckles. Marinette's face immediately turns bright pink.\n\"You... you. It's been you all this time.\"\nAdrien nods. \"And I know I've said it already, but Marinette - I'm so sorry. I had no idea Lila would escalate this far. She's crazy. Like legitimately, scarily crazy.\"\nSome of the color drains from Marinette's cheeks, and she shakes her head. \"It's not your fault. Please don't blame yourself.\" \n\"But I told you not to expose her. I said that as long as you and I knew the truth, that was enough.\"\n\"You were trying to help,\" Marinette points out. \"You couldn't have known that me ignoring her was going to make Lila even worse.\" She licks her lips, wincing when her tongue swipes over her bottom lip. \"I should be the one apologizing. What kind of Ladybug am I? I got beaten up by a teenaged girl.\"\n\"I wouldn't have blamed you for pushing her out the window. I'm still considering it myself.\"\n\"Cataclysm!\" Plagg calls from somewhere to their left.\n\"I haven't taken it off the table!\" Adrien yells back.\n\"Adrien!\" Marinette says, eyes wide. \"You can't be serious.\"\n\"My Lady, I've never been more serious in my life. I was already thinking about getting back at her when she hurt my friend Marinette. But now, knowing that she hurt my lady?\" Adrien feels a renewed surge of rage. \"Not only has she caused us trouble as Ladybug and Chat Noir, she threatened you. She slapped you and then had people believing that you were the one who started it. She even got you suspended from school. One way or the other, she's getting what's coming to her.\"\nMarinette stares at him. \"Really?\"\n\"Of course. There's no way we're letting her get away with this.\"\nFresh tears fill Marinette's eyes. On a whim, Adrien opens his arms to her again and she falls into them, sobbing into his shoulder. He hugs her tightly and, since they're no longer transformed, back them up towards the center of the roof. He sits with his back to the wall and pulls Marinette down sideways into his lap. She comes willingly, still crying. But this time, he doesn't think she's crying because of what happened so much as crying because someone is finally on her side. How lonely must she have been for the past few weeks, doing her best to ignore Lila while everyone else ignored her?\n\"I'm sorry,\" he whispers again, the words muffled against her hair. He knows he's going to be making up for this for a long time. He might not have said or done anything to hurt Marinette like everyone else, but he contributed to Lila's cruel actions by remaining quiet. Maybe the class wouldn’t have believed him either – Principal Damocles didn’t – but he still should’ve tried.\n“What’re we gonna do?” Marinette whispers back, voice thick from tears. “How are we gonna expose her?”\nAdrien tilts his head back, looking up at where the stars would be if it weren’t too bright to see them. “She’s lied a lot,” he says thoughtfully. “A video of Ladybug saying Lila’s not her best friend would be a start.”\nMarinette stiffens slightly. “I – is that a good idea? What if she gets akumatized again?”\n“We can’t let Lila get away with this just because she might be akumatized, My Lady. We can’t let her play us like that.”\n“Adrien’s right!” Tikki says suddenly, making them both jump.\n“T-Tikki?” Marinette stutters in surprise.\nTikki balls her little fists up. “That girl has gone too far! You can’t let people do bad things just because they might be akumatized when they get caught.”\n“People like that don’t stop,” says Plagg, floating beside Tikki. “They push and push until they can’t anymore. She’s only gonna escalate from this point forward. Imagine what she’ll do next time?” He looks pointedly at Marinette’s bruised face. “If she gets akumatized, we’ll deal with it. Don’t let that stop you from giving her what she deserves.” He grins wickedly.\n“No Cataclysm,” Marinette says, pointing a finger at him. “Stop being a bad influence on my kitty!”\nAdrien blushes, but Plagg just smirks at her. \n“I think a video is an excellent idea,” says Tikki. “And I think both of you should be in it.”\n“Both of us?” Adrien repeats, surprised.\n“That way, Lila can’t start making up lies about Chat Noir,” says Plagg. “You should both probably do a couple tricks too. Something only you can do. That way, she can’t say that it’s a videotape of imposters.”\nIt makes sense. Adrien nods slowly. “And you know Jagged Stone, Marinette. We can get him on video too. We might even be able to get a recording of Prince Ali. Rose would have his contact information. She might give it to me if I said my dad was planning a trip to his country.”\n“You’d lie to her?” Marinette says, looking up at him.\n“For you, Princess, I’d do anything.”\nIt’s Marinette’s turn to blush, this time a shade of red that rivals her suit. She opens her mouth but all that comes out is a squeak.\n“What about Lila’s parents?” Tikki says, mercifully drawing attention from Marinette.\n“What about them?” Adrien says.\n“Well, Lila was out of school for a while. And she wasn’t traveling. So where was she?” Tikki asks, and it’s such a reasonable question that Adrien just blinks stupidly at her because that never once crossed his mind.\n\"I bet she was lying to them too,\" says Plagg.\n\"That's possible, probably even likely, but it's not like Marinette and I can go talk to them,\" says Adrien. \"That would be weird.\" He pauses. Or would it?\n\"Would it? Couldn't you just say you're Lila's friends from school?\" Plagg says.\n\"That would be lying, Plagg. I don't want to stoop to Lila's level,\" Marinette says. \"I appreciate what you guys want to do for me, but I'd much rather do this without lying to anyone. That includes Rose.\"\n\"You won't have to lie to anyone,\" Adrien promises. He makes no such promises about himself: Adrien lies all the time to his father, Nathalie and his driver. He's used to it by now. Maybe that makes him no better than Lila, but frankly right now he doesn't care. He catches Plagg's eye and sees the wicked grin on his kwami's face. Within the next day or two, they're going to be making a visit to Lila's house. \n\"Let's, um, let's do the video.\" Marinette blushes heavily, apparently realizing that she's still sitting in Adrien's lap, and stands up hastily.\n\"I don't think we should do that tonight, Marinette,\" Tikki says, peering up at Marinette worriedly. \"You still have a bruise on your face and a split lip. If someone sees that, they could put two and two together and realize who you are.\"\n\"Oh gosh.\" Marinette puts a hand to her face, wincing. \"I didn't even think about that.\"\n\"Why don't we do it on Saturday night? It's only Monday, so that gives your face five days to heal. It will probably be barely noticeable by then,\" Adrien says.\nMarinette nods at him. \"Okay, yeah, that will work. In the meantime, Maman and Papa say I have to help at the bakery every day. And Madame Bustier is supposed to be sending me homework to do.\"\n\"It'll probably be similar to what I'm working on this week. I won't be in school for the rest of the week, either. Maybe we can work on it together?\" Adrien suggests hopefully. His lady may not have wanted their identities to be revealed, but to Adrien it suddenly opens up a whole new world. Before, he would've had to go the rest of the week without seeing any of his friends from school. He only would've seen Ladybug during patrols or if there was an akuma attack. Now he can see his lady and a friend from school every night.\n\"I... sure,\" Marinette says, smiling shyly. \"I'd like that, Adrien.\"\nHe grins. \"Okay. Will you be alright, My Lady?\"\n\"I think so. I feel lighter now, knowing that we have a plan. Maybe I'll call Jagged Stone this week too, and see if he'll agree to me recording him saying that he's never heard of Lila Rossi.\"\n\"I wish we'd never heard of her,\" Adrien mutters. Marinette lets out a soft giggle; it's the best sound in the world.\n\"Me too. Tikki, spots on!\"\n\"Plagg, claws out!\"\n\"Thanks for everything, Chaton. I really needed you tonight,\" Ladybug says. Her cheeks are still pink, but she takes his hand and squeezes it.\n\"I'm always here for you,\" Chat says, and he means it.\nLadybug's face softens. \"I know.\" She steps closer and very lightly kisses him on the cheek. Chat barely dares to breathe as she pulls away, then runs towards the edge of the building. She leaps off, throwing her yoyo out, and is quickly nothing more than a blur of red.\n\"I love you,\" Chat says to no one in particular, gazing after her. He wishes he could follow Ladybug back to her room, but he can't.\nHe's got work to do.\nThe next four days are insane. Adrien feels like he barely has time to breathe, much less sneak away. He manages to find a little time to spend with Marinette each night, the two of them chatting over the phone, but he justifies that because they really do work on their homework. Adrien talks her through their physics worksheets and she helps him out with history.\nHe might be exhausted from losing a few hours of sleep, but, at the very least, his teachers at school will be impressed with how much he got done when he was up to his ears in work for his father's company.\nBut he doesn't get the chance to sneak away during the day until Thursday morning. A stroke of incredibly good fortune means that three of the models don't show up, and the session can't happen without them. Adrien takes his chance to slip out while the photographer is screaming into the phone and transforms outside. He takes a moment to just breathe, appreciating his stolen moment of freedom, and then leaps straight up.\nChat bounds across the rooftops, heading towards Lila's house. He knows exactly where it is because Lila's bragged about it before, telling the whole class how much money her parents made and how big her house is. As he lands on the ground, the spiteful side of Adrien notices that her home is a lot smaller than his. He de-transforms and turns to Plagg.\n\"Okay, Plagg, here. I'll get her talking, you get ready to record,\" Adrien whispers, handing his kwami his phone.\n\"I don't know how to use this,\" Plagg says.\nAdrien gives him a look. \"That's crap. Don't think I haven't noticed all the youtube videos about cheese that you've been watching. Not to mention, all the pictures you've been taking of your camembert.\"\n\"Works of art,\" Plagg says with a sigh.\n\"Uh huh. Just be ready. Now come on.\" \nHe walks up the steps and lightly knocks on the door, hoping against hope that Lila's mother or father will be home. His prayers are answered when the door is opened by a woman of average height, with dark brown hair pulled back into ponytail. She has dark brown eyes as opposed to Lila's olive green eyes, but her face looks otherwise identical to Lila's. Adrien pastes on the biggest, fakest smile in his repertoire.\n\"Hi. Are you Madame Rossi? Lila’s mother?\" he asks.\n\"Yes, that's me. What can I do for you?\"\n\"I'm Adrien Agreste.\"\nHis name makes her smile, and she visibly relaxes. \"Oh yes, Adrien! Lila talks about you all the time. It's such a pleasure to finally meet her boyfriend! I’ve been asking Lila to bring you over for dinner for a while now, but she’s told us how busy you are.\"\nHer boyfriend? Adrien wants to gag. Even before he found out what a lying liar Lila was, he wasn't interested in her that way. Finding out that she was supposedly a new superhero was interesting and exciting, but Adrien's heart has only ever belonged to one woman. Ladybug - Marinette - is the woman he loves. He wants nothing more than to inform Madame Rossi that he wouldn't touch Lila with a ten foot pole, but that's not the way to get the information he wants. Still, his smile definitely gets a little more strained.\n\"Right. I am really busy. Well, it's lovely to meet you too,\" he says politely, accepting her hand and shaking it.\n\"Please, come in.\" She steps back and lets him in, leading him into a living room. Adrien takes a seat on the couch when she waves her hand, but shakes his head when she offers him a drink.\n\"I really can't stay that long, but thank you.\"\n\"Well, I'm afraid Lila isn't home. She's at school.\" Madame Rossi frowns and looks him over critically. It's not hard to tell what she's thinking.\n\"My father pulled me out of school this week. I'm a model for his company and I had work to do,\" Adrien explains. \"I just had a bit of free time, so I took the chance to sneak over here. I needed to speak to you while Lila was out.\"\n\"Oh, and why is that?\"\n\"Everyone at school loves Lila,\" Adrien tells her, which isn't actually a lie. \"We're planning a party for her. We missed her a lot when she was traveling.\"\n\"Traveling?\" Madame Rossi's eyebrows furrow, and, in his peripheral vision, Adrien catches a glimpse of Plagg holding the phone and pointing it right at them. He smiles again at Madame Rossi, making sure that she keeps her focus solely on him.\n\"Oh yes. Lila's always told me how much she travels with you and her father,\" Adrien says innocently. \n\"She did, but not for a long time. I'm settled in Paris, and have been for the past two years. We haven't done any traveling recently, and Lila hasn’t been out of Paris for close to three years now.\" Madame Rossi frowns again. \"Though I am beginning to think that Paris is no longer a safe place for my bella, what with all these dreadful akuma attacks that have been going on.\"\n\"Ladybug and Chat Noir are doing their best to protect Paris,\" Adrien says, the hair on the back of his neck rising.\n\"I recognize that, but it just doesn't seem like enough. Closing your school for as long as they did... it's a travesty. Your education is suffering.\"\n\"Closing the school?\" Adrien echoes. He doesn't have to pretend to be baffled.\nMadame Rossi leans forward, looking at him earnestly. \"Lila told me all about those poor people who have been akumatized. The ones who Ladybug couldn't save? Paris has practically come to a standstill! I just don’t know how the police haven’t done something by now!\"\n\"What.\" Adrien doesn't mean for it to come out that flatly, but he's honestly, genuinely, flabbergasted. He's also kind of pissed. Ladybug always saves everyone, even the people who don't deserve it. Case in point: Lila.\n\"Even your poor principal,\" Madame Rossi says fretfully. \"Adrien, tell me. Is it really safe now? Is Lila in any danger now that the school has re-opened?\"\nAdrien takes a moment to work through his incredulity and fury, making sure his voice is even and comforting. \"Of course not, Madame. Whatever... problems Ladybug and Chat Noir may have run into in the past have since been solved. I can personally assure you that all of the akumatized victims are back to normal. My own father was one of them, and honestly it's like it never happened.\"\nA look of pure relief flashes over Madame Rossi's face. \"Oh, thank goodness. That's such a relief. I wish I had more time to look into these things myself, but I'm just so busy with my work... I was so glad to hear that the school re-opened, because Lila was getting terribly bored staying at home, working with tutors. And of course, it must have been hard on you. Lila's told me how much you care about her. You’ve been such a good boyfriend.\" She smiles at Adrien.\n\"Uh, yeah,\" Adrien says, revolted. He's not sure why it's such a shock that Lila would blatantly lie to her mother, but it is. \n\"And to hear that everyone likes her so much to throw her a party! I'd love to help, but I'm not sure how.\"\n\"I just came to find out more details about what Lila likes. Her favorites foods and stuff like that. If I ask Lila too many questions, she'll get suspicious,\" Adrien explains. He's kind of proud of himself for thinking up such a decent lie. \nAnd sure enough, Madame Rossi buys right into it. Of course, it means Adrien has to spend the next twenty minutes listening to a rundown of Lila's favorite foods, activities, colors, animals... he stops listening after that, honestly. When she winds down, he seizes his chance.\n“I’m afraid I really do need to get back, Madame. I only had a quick break,” Adrien says, trying to sound regretful. “But thank you for telling me all of this. It will really help.”\nMadame Rossi smiles again. “Of course, Adrien.”\n“And… I know this may sound a bit odd, but do you think you could not tell Lila I was here? We really want this to be a surprise.”\n“I won’t say a word,” she promises, hand over her chest, and stands. Adrien gets up too and they walk to the door together. She sees him off with a happy wave, and he walks down the steps wondering how such a nice woman ended up with a bitch for a daughter. \n\"So, does Princess know you've got another girlfriend?\" Plagg asks, appearing beside Adrien's shoulders.\n\"Guh!\" Adrien shudders dramatically. \"Good god no. Not in a million years.\"\nPlagg snickers and drops the phone into Adrien's waiting hands. Adrien immediately opens up the camera app and smiles in satisfaction as he watches the video. There it is, in full color and surprisingly apt focus, Lila's mother telling the whole world that Lila has been in Paris for the past two years and that she lied about the school being closed. No one can argue against this. Adrien didn't coerce her, or really even guide the conversation. Everything Madame Rossi said, she said because she believed it.\n\"Thanks, Plagg,\" Adrien says, meaning it.\n\"I didn't do it for you.\"\n\"You did it for Marinette?\" Adrien says skeptically.\nPlagg shrugs. \"Tikki says her father makes amazing cheese bread.\"\n\"Suuuure,\" Adrien says, amused, and pockets his phone. Now that he's got this, he doesn't feel the need to reach out to Rose. It would be good if they could have Prince Ali confirming that he doesn't know who Lila is, but he would rather not risk raising the suspicions of anyone at school right now. Knowing Rose, she'll innocently mention it to Alya or someone else who will wonder why Adrien suddenly wants to talk to Prince Ali now.\nHe heads back to work. The delay from the shoot means that their day runs even longer than usual. It's well after midnight before Adrien finally gets home, and he collapses straight into bed with a faint moan. Friday is even worse than Thursday, and it rolls seamlessly into Saturday. By the time the gala ends on Saturday night, Adrien is so exhausted that he's seeing double. It's a good thing that transforming gives him a rush of adrenaline and energy, or else the only company he would be good for would be his bed.\nHe makes his way across the rooftops towards their meeting place. As he gets closer, he sees the red-suited figure waiting for him and his heart speeds up. The realization that he knows who Ladybug is now hasn’t fully sunk in yet; he’s just been too busy, and too tired, to be able to fully dwell on it the way he wants to. But now, the knowledge sends a rush through him. \nFor the first time ever, he knows who the girl behind the mask is.\n“What – Chat!” Ladybug gives a startled yelp when Chat lands beside her and immediately scoops her up into a big hug. She laughs as he spins her around in circles, her hands coming to rest on his shoulders. She looks down at him, grinning.\n“I’m just so happy it’s you, My Lady,” Chat says breathlessly. \nHer eyes soften even as her cheeks pinken. “I’m happy it’s you too, mon minou. But, um, you’re making me dizzy.”\n“Oops, sorry.” He stops spinning and sets her down carefully, pleased when she doesn’t immediately pull away.\n“How has your week been? You look tired,” she observes, her smile tipping into a concerned frown.\n“I’ve been flat out,” Chat admits.\n“My poor Chaton. Are you sure you want to do this tonight?”\n“Yes,” he says instantly, taking the chance to examine her face. “It looks like you’ve healed well.”\n“Oh.” She puts a hand to her cheek. “I put some concealer on. I didn’t want any sign of it to show up.”\n“Smart,” Chat says with a nod. “Okay, let’s do this.” He pulls out his baton and holds it up. It took him a little while of playing with it one boring morning, but he’s finally figured out how to shoot video. Better yet, he can then send that video to his and Marinette’s cell phones. He presses the right configuration of buttons and they both see the red light come on.\nLadybug squishes in beside him, their cheeks brushing together. “Good evening, Paris! Your favorite cat and bug team here!”\n“I’m pretty sure that should be bug and cat,” Chat says. “Salut, Paris!” He gives the screen an awkward salute with his free hand. This feels weird, but he’s keeping in mind that it’s for his lady.\n“I’m not gonna argue that,” Ladybug says with a giggle. To the camera, she adds, “Chat and I are feeling kind of bored tonight. There’s only so many times you can patrol this city before you start getting tired of seeing the same things over and over. So we thought we’d show you a few tricks.”\nShe backs off then, and Chat turns his baton around so that he can focus entirely on her. Ladybug smiles at the camera, looking more beautiful than ever. He watches with awe as she performs a couple of tricks with her yoyo that should be scientifically impossible, including writing out the name ‘Ladybug’ with the string. Then he films her leaping carelessly off the side of the building and flipping through the air to land effortlessly on a rooftop some two dozen feet away.\nLadybug uses her yoyo to get back, and then it’s his turn. He can’t use his baton, obviously, so Chat focuses more on doing acrobatic tricks. He jumps off the building and lands effortlessly on the ground five stories below (later, when he watches the video, Ladybug makes a snarky comment about cats always landing on their feet) and then scales the building to get back to her side.\n“Before we do anything else tonight, we wanted to clear something up,” Chat says, coming to a stop before the baton. Ladybug hands his baton back to him so that she can move to stand next to him. Much to his surprise, she actually tucks herself beneath his free arm and wraps her arm around his waist. The shock leaves him speechless, but Ladybug’s already talking.\n“It’s come to our attention, thanks to the Ladyblog, that someone has been going around saying she’s my best friend and that we know each other in real life. I’d like to make it clear to everyone in Paris that…” Ladybug pauses for effect, then turns to Chat. “What was her name again?”\n“Lila, wasn’t it?” Chat says, pulling a confused face.\n“Right, that’s it. Lila. She got akumatized a couple of times, and Chat and I worked together to save her, but I’m going on the official record to say that we don’t have any other connection to her. We don’t know any of our fans personally. My only friend is Chat Noir.” Ladybug tips her head, letting it rest on Chat’s shoulder.\n“And my only friend is Ladybug,” Chat says, hoping that his quickening pulse isn’t evident in his face or voice. “It’s really dangerous for anyone to claim to know us personally. Doing so can make you a target for Hawkmoth. That’s not what anyone wants.” He lets himself frown with worry. “Ladybug and I can’t have friends when we’re wearing our masks. I would hope that in the future, anyone who makes this kind of claim would be gently corrected. Not have the footage of their fake interview broadcast all over Paris.”\nLadybug pinches his side at the not-so-subtle dig towards Alya, but Chat can’t bring himself to be sorry. Frankly, Alya deserves a lot more than just that that. She never once tried to verify Lila’s claims, and it would’ve been easier for Alya than most: she could’ve approached him or Ladybug after a battle and asked. For something like that, either one or both of them would’ve stopped to deny it.\n“The point is, we’re here to protect Paris. Like Chat said, we’re not here to be anyone’s friends,” Ladybug says, looking directly into the camera. “And we strongly discourage anyone from trying to bring attention to themselves by claiming otherwise. It’s just too dangerous.”\n“Stay safe, Paris!” Chat winks at the screen, and Ladybug gives a little wave. Then he presses the button to stop the recording.\n“Seriously? You had to make that dig at Alya?” Ladybug says, immediately pulling away to frown at him.\n“She deserves it. I’ve had contact with more than my fair share of journalists as both Adrien and Chat Noir. Alya isn’t doing herself any favors by posting unverified content on her blog, Bugaboo. It’s practically the first rule of journalism to make sure your sources are on the up and up. Alya didn’t even question Lila. She just blindly accepted that Lila was telling the truth.” Like me, Chat doesn’t add, remembering how easily he believed that Lila was a superhero like them.\nLadybug sighs and moves closer, cupping his face. “Chat, stop that. Lila’s a good liar. You saw through her a lot quicker than anyone else did.”\n“But she still hurt you,” Chat says quietly, pressing his hands over hers and looking down into her eyes. “And so did everyone else. You don’t have to forgive them right away, Marinette. It’s okay to be angry.”\n“How do you always know what to say?” Ladybug asks, biting her lip. \n“I don’t know.”\nShe lets her hands drop and paces away, looking out over the city. “Alya is my friend. So is Nino. But they were so quick to attribute everything I said to jealousy.” Her voice cracks. “They thought I didn’t like Lila because she was trying to suck up to you. They banished me to the back of the class without a thought. At least you tried to make things a little better.”\nChat comes up behind her and dares to wrap his arms around her, relieved whens he sinks into his embrace. “I did, but instead I made things worse.”\n“No, you didn’t. You really didn’t. I just…” Ladybug trails off, tipping her head back against his chest. “I’m really tired. I dread the thought of going back to school on Monday.”\n“I’ll be with you,” Chat promises. He wants to kiss her cheek, but he doesn’t know if that’s crossing a line.\nShe opens her eyes and smiles up at him, upside down. “Thanks, Chaton. Knowing that… it helps. I don’t think I’d have the courage to do it otherwise. I’m sure Lila will have been spreading lots of poisonous lies during this week I’ve been out.”\n“Probably,” Chat mutters, frowning. What rotten timing. Without him at school, he doubts many people have been standing up for Marinette. \n“Maybe Alya or Nino have,” Ladybug says with false brightness.\n“Maybe,” Chat says, but he can tell Ladybug doesn’t believe it. And honestly, neither does he.\nThey separate not much later, with plans to meet up on Monday morning. Chat goes home and immediately passes out; he spends most of Sunday texting with Marinette in between doing homework and editing the two videos. He’d love to sneak over and see her, but she regretfully reports that she’s still helping out in the bakery and has her own homework to do.\nOn Monday morning, Adrien gets up earlier than normal and sneaks out. The school is pretty quiet when he gets there. He goes inside and finds his way to Madame Bustier’s classroom. She’s sitting behind her desk, organizing her files. She looks up when the door opens and her eyes widen in surprise.\n“Adrien! What are you doing here so early?”\n“I actually wanted to speak to you,” Adrien says, stepping inside. \n“Oh? Did you have problems with your homework?” Madame Bustier asks, giving him her full attention.\n“No, nothing like that. I just wanted to know if I could change seats again.”\n“Change seats? To where?”\nAdrien scuffs his foot against the ground. “It’s not that I mind helping Lila,” he says slowly, the words well rehearsed thanks to Plagg. “But… I think she requires more help than I’m capable of giving her. I feel like my grades are starting to slip in certain places. If they sink too low, my father will get angry and pull me out of school.” He doesn’t have to fake the quiver in his voice at the thought. Now that he knows Marinette is Ladybug, and how badly she needs him, he would run away from home before allowing that to happen.\nMadame Bustier frowns thoughtfully, her eyes sweeping the classroom. “The only spare seat is next to Marinette,” she says after a pause. “Last time, Marinette seemed very distracted when you sat together.”\n“I don’t think it’ll be like that anymore. Marinette and I have studied together a few times over the past couple weeks. We’re great partners,” Adrien says, flashing her an innocent smile.\n“Well… alright, Adrien. But only as long as you and Marinette both pay attention in class. I won’t hesitate to move one of you if you don’t.”\n“We will,” Adrien swears. “Thank you, Madame Bustier.”\nShe smiles at him. “You’re welcome. And perhaps I’ll approach Lila about tutoring, if she’s really having that much trouble.”\n“I definitely think you should,” Adrien says, nodding. “She’s asking me upwards of fifteen questions a period.” Now, he knows that Lila is only doing that because she likes him, as shudder inducing as that thought is. But maybe some extra attention from a teacher will be enough to make Lila sweat a bit.\n“Adrien,” she says, right before he leaves, and Adrien pauses.\n“Yes?”\n“There have been a lot of rumors flying around during the past week. Rumors about Marinette and Lila.” Madame Bustier folds her hands, looking at him seriously. “Personally, I don’t believe the rumors. I know Marinette very well; I know what she is and isn’t capable of. Unfortunately a lot of students are inclined to take Lila’s side, especially since Marinette wasn’t here to defend herself.”\nAdrien’s hand clenches into a fist. Damn it. This is exactly what they were afraid of. “I’d hoped that wasn’t the case,” he says quietly.\nMadame Bustier sighs. “People can be fickle when they hear what they want to hear. I’m glad that you, at least, have been able to see clearly.”\n“Not as clearly as I should’ve,” Adrien says with a bitter smile.\n“Marinette is going to need you on her side now more than ever,” Madame Bustier says. “She may put on a strong front, but she’s a sensitive girl. I’ve done what I can, but it’s hard for a teacher to interfere.”\n“Don’t worry, Madame Bustier. We’ve got a plan to put Lila in her place.” As soon as the words are out, Adrien wonders if that was wise. Technically, as a teacher, she could stop them. But then Madame Bustier smiles at him, her eyes twinkling.\n“I look forward to seeing how things play out.”\n“Thanks,” Adrien says again, backing out of the classroom and sliding the door shut. Tempting as it is to ask for Madame Bustier’s help, he knows that she won’t be able to. As a teacher, she has to at least pretend to be impartial. Lila might be bullying Marinette right now, but, so far as the teachers are concerned, they don’t have any proof of that. Adrien wouldn’t put it past Lila to go after Madame Bustier if she thought their teacher deserved her ire.\nHe heads down the hall, conscious of the students that are now entering the building. Several girls wave at him, but Adrien doesn't do anything more than give them curt nods. He hurries down the front steps, across the courtyard, and out the gates. The Dupain-Cheng bakery is just down the street, beckoning to him with warm, fragrant smells. Adrien turns in that direction, but he only gets a few steps before a hand lands on his shoulders.\n\"Whoa, Dude, where you goin'? School's about to start,\" Nino says.\n\"I'm going to get Marinette,\" Adrien says. \"Today's her first day back, remember?\"\nNino frowns, looking uncomfortable. \"Dude... are you sure you should -\"\n\"Don't finish that sentence, Nino. You're my friend. I would really hate for our friendship to end over this,\" Adrien says, staring Nino in the eyes. Carapace, he can recognize now. He wonders how he didn't see it sooner. And Alya is obviously Rena Rouge. It makes him angry. Marinette - Ladybug - had trusted them so much she'd given them a miraculous, and this was how they repaid her? By falling for Lila's lies without even trying to talk to Marinette to figure out the truth?\n\"I'm just saying... I know what your father can be like. The rumors going around about Marinette aren't good. If that got back to your father...\"\n\"My father has nothing to do with this. I won't leave Marinette to face everyone alone.\" Adrien brushes Nino's hand from his shoulders and turns, jogging towards the bakery. If a small part of him is hoping that Nino will follow, it's quickly snuffed out.\nAdrien opens up the door to the bakery, inhaling instinctively. Vanilla, cinnamon, sugar - his stomach rumbles as the smells waft past his nose, but it’s a comforting smell too. Ladybug always smells like cookies, and it’s something that Adrien has to come associate with home. At least now he knows why she always smells like that, and why his search for a cookie-scented perfume never bore fruit. \nHe steps inside and shuffles to the back of the short line. It gives him the chance to look at the shelves and admire their contents. There are more pastries here than Adrien can name, all of them bright and colorful and appetizing. Madame Cheng is working the cash register, while an assistant fills orders, taking pastries out of the display cases and laying them inside containers. Finally, it's Adrien's turn.\n\"Hi, Madame Cheng,\" he says shyly. \"I'm here to pick up Marinette?\"\n\"Oh, Adrien. I thought I told you to call me Sabine?\" Madame Cheng smiles back at him. \"Are you looking for Marinette?\"\n\"Um, yes. I was going to walk her to school.\"\nMadame Cheng beams. \"What a lovely boy you are. Feel free to go upstairs. She should be just about ready by now.\"\n\"Thanks.\" He skirts around the counter and enters the back, following the hallway to the stairs. He climbs up them and knocks awkwardly on the door. It opens seconds later to reveal Marinette with her hair around her shoulders, clutching her hair ribbons in one hand and a half packed bag in the other.\n\"I'm not ready for this,\" she says. \"Adrien, they're all going to hate me.\"\n\"I don't hate you,\" he says, swallowing back the 'I love you' that springs to his lips. Now isn't the time. \nShe looks up at him, her expression utterly miserable. \"But that's you. You're my partner.\"\n\"So I don't count, is that what you're saying?\" he asks, and it's a joke but Marinette's face crumbles.\n\"No! That's not what I - I didn't mean - I -\"\n\"Hey, Princess, I was just joking,\" Adrien says gently. \"Go finish getting ready. It'll be okay.\"\n\"I doubt it,\" Marinette mutters, but she sighs and retreats from the door. Adrien steps just inside and is a little surprised when Tikki flies right up to him.\n\"Marinette is really upset about this,\" Tikki whispers, looking worried. \n\"I can't blame her. I don't think today is going to go well. But I plan to stick to her like glue. Anyone who wants to say anything to her will have to go through me first,\" Adrien replies, crossing his arms. \n\"Based on what that Nino kid said, Princess is probably gonna get the hint just from dirty looks alone,\" Plagg comments, poking his head out of Adrien's shirt pocket.\nTikki looks distressed. \"What did Nino say?\"\nAdrien sighs. \"He said that the rumors going around about Marinette aren't good, and he questioned whether or not I should hang out with her when it might get back to my father.\"\n\"Nino said that?\" Marinette says. Adrien's head snaps around and he spots her standing at the bottom of the stairs, hair now neatly tied and bag packed. He stares at her in amazement for a few seconds, wondering how on earth she managed to get herself together in the span of about sixty seconds when it takes him at least forty-five minutes to get ready, before realizing that her eyes are filling with tears while he stands there like an idiot.\n\"Oh, Marinette.\" Adrien lurches across the floor towards her, arms open. She meets him halfway, already crying.\n\"I hate this. I just hate this. It's not fair,\" she sobs. \"Why does she hate me so much? She's turned my friends against me.\"\n\"I don't know. I wish I did.\" Adrien hugs her tightly, wishing that he could do more.\n\"She's jealous of you, Marinette,\" Tikki says.\n\"What is there to be jealous of?\" Marinette asks bitterly, lifting a tear-streaked face. \"The fact that I can't walk down the stairs without falling? The fact that Chloé bullied me for years? The fact that I can never get to school on time? The fact -\"\n\"Hey,\" Adrien says. \"Stop talking like that about my partner.\"\n\"Sorry to break the news, mon minou. Your partner is a worthless flake.\"\n\"That’s not true. Hey.\" He pulls back, gently catching Marinette's chin and tipping her head up. He stares into her swimming eyes. \"My partner is beautiful, smart, passionate, strong, and amazing. She's saved the city more times than I can count. She's always there for the people who need her, whether or not she's wearing her red, black-spotted suit. Her kindness knows no bounds. She was nice enough to give a second chance to a dumb, socially awkward kid who messed everything up when he joined a public school for the first time.\"\nMarinette blinks, a tiny smile touching her lips. \"I'm the one who jumped to conclusions that day. I yelled at you.\"\n\"It was a mistake, a mistake that you owned up to and apologized for when other people wouldn't have bothered. You were my first real friend at school, Marinette. I actually spent a lot of time wondering why we could never be better friends. I wish I'd known then that we were closer than friends. You were, are, my lady. The person I care about most in the world.\" He takes her hand. \"And someone who I will never abandon, no matter what.\"\nShe's quiet for a moment, her cheeks pink, looking beautiful even though she’s still crying. \"Do you mean that?\"\n\"Every word of it,\" Adrien says with as much sincerity as he can muster. \"You're the best thing that ever happened to me, Marinette. Just because you're clumsy and kind of hot-headed and impulsive doesn't change any of the good qualities that you have. There are lots of reasons for Lila to be jealous of you. Not the least of which is that you were smart enough to see through her lies from day one.\"\n\"That's only because I knew I hadn't saved her as Ladybug, and I was jealous she was trying to get close to you,\" Marinette admits. \nHe rubs his thumb beneath her eye, wiping away her tears. \"You never needed to be jealous, My Lady. My heart is, and always will be, yours.\"\n\"Adrien.\" Her flush deepens, but there's a glow to her eyes that wasn't there before. Her voice is very soft when she confesses, \"I... I feel the same way.\"\n\"R-really?\" Adrien says, shocked.\nMarinette's smile widens a little. \"Of course. Why do you think I never talked to you? I had such a horrible crush on this really nice, sweet, kind guy who gave me his umbrella when it was raining outside. And then I had this amazing partner who made the dumbest puns and flirted constantly, but was always there for me when I needed him. My literal knight in black leather.\"\nAdrien chuckles. \"My father would pass out if he heard that.\" He brings her hand up, brushing a kiss to her knuckles. His stomach is fluttering like crazy, and he has to make himself focus. \"Please, Marinette. I know it hurts because of Alya and Nino. I understand that. But please don't let Lila get into your head. You are worth so much more than she'll ever be.\"\n\"Did I also mention my partner is good with words?\" Marinette asks, but she's still smiling. \"Okay. You're right. At the very least, I want to see the look on her face when we play our videos.\"\n\"Videos?\" Adrien repeats, because she doesn't know about the one he has.\n\"I got a hold of Jagged after all. He was pretty surprised to hear about this kitten that he supposedly had.\"\n\"Excellent.\" Adrien grins viciously. \"Shall we, Bugaboo?\"\n\"Let's.\" Marinette turns her head, cupping her hand around Tikki, and kisses her kwami's cheek. Tikki giggles and gives her a kiss back, which is so insanely adorable Adrien wants to melt. \nMarinette goes to wash her face. Once she comes back, Plagg and Tikki disappear into Marinette's purse and then she and Adrien walk downstairs together. Madame Cheng looks worriedly at her daughter, but hands Marinette a small box and wishes her good luck. Marinette puts the box into her backpack and follows Adrien out the door. Her footsteps grow slower as they walk back towards the school, but she doesn't stop until they're standing right in front of the doors. The courtyard is empty, most likely because the school bell rang about five minutes ago, but Adrien doesn't give a damn. He doubts Madame Bustier will chastise them for being late today, of all days.\n\"Shall we, My Lady?\" Adrien asks, offering her his arm.\n\"We shall, Chaton.\" She clasps her hands around his upper arm, and he escorts her up the steps and into the school. They walk down the hall and Adrien slides open the door to Madame Bustier's classroom.\nAll conversation grinds to a halt as all eyes swing in their direction. Though Marinette's fingers tighten around his arm, she doesn't back down even though none of the stares are friendly. Adrien catches a glimpse of the smirk on Lila's face right before Lila looks away, and feels his blood boil with rage all over again. It's probably a really good thing that he's not transformed right now, because he's not wholly sure that his self-control is good enough to stop himself from using Catacylsm on her. And he's not sure that Marinette would be inclined to stop him, either.\nAdrien meets the stares with a blank expression, one that he's perfected after years of having to attend boring functions with his father, and enters with a straight back. He and Marinette climb the stairs to the back row. Marinette stares at him with surprise when he sits down beside her; Adrien casts her a wink, which is enough to make her face break out into a beautiful smile that makes his heart skip a few beats, and he remembers what she said earlier. A crush. She has a crush. A crush on him! \nNow he's really motivated to get Lila out of the way so that they can focus on what really matters.\n\"Excuse me, Madame Bustier, Adrien is supposed to be sitting up here beside me!\" Lila exclaims, throwing her hand in the air.\n\"I've decided that Adrien is going to sit at the back of the classroom for the time being,\" Madame Bustier says. \"Now, please take out your language books.\"\n\"But Madame Bustier -\"\n\"Lila, I said take out your language book,\" Madame Bustier says sharply. “Class has been in session for almost ten minutes and we haven’t gotten anywhere. We have a lot of material to cover today.” \nAdrien can’t see Lila’s face, but the angry slump of Lila’s shoulders speaks volumes. He smirks to himself. \n\"Thanks,\" Marinette whispers beneath the clatter of students getting their books out.\n\"Anytime, Princess,\" Adrien murmurs back, taking her hand beneath the desk. She smiles, blushing a little, and scoots closer enough that he can feel her warmth.\nClass isn’t too bad, though they do have to put up with students staring at them whenever Madame Bustier turns back to the board. Chloé turns around a couple of times and looks their way too. It’s obvious from the angle and the look on her face that she can see their joined hands, and Adrien hopes that she won’t make a big deal of this. They could use Chloé’s help with getting the school on board for the party.\nHe says as much to Marinette when the bell rings for lunch, and Marinette raises her eyebrows. “Chloé hates me. You really think she’ll help?”\n“I know you guys don’t like each other, but I think she’s pretty fed up with Lila stealing the spotlight,” Adrien says honestly. He’s pretty much given up on Marinette and Chloé ever being friends. There’s too much bad history. But he would settle for them being united against the common enemy of Lila Rossi. That would be a decent start.\n“Chloé may make fun of me, and she might’ve pushed me down a few times and ruined my art project once, but at least she didn’t try to turn everyone against me,” Marinette says grimly.\n\"She ruined your art project?\" Adrien repeats, frowning.\n\"Yeah, last year. She spilled red paint on it right before I was about to hand it in. I'd worked on it for weeks.\" Marinette doesn't look at him, instead stacking her books and slipping them one by one into her bag. \"Our teacher gave me the night to re-do it because it was an accident. I didn't get a very good grade.\"\n\"I didn't know that.\"\nShe shrugs at him. \"Adrien, I'm not going to stand here and rehash every single mean thing Chloé has ever done to me. There's no point, and we’d be here all night.\"\nAdrien begs to differ - he wants a list of everyone who ever dared to hurt his lady in every way, including details on exactly how they hurt her so that he knows how much punishment to deal out - but he recognizes that now isn't the time. They really do need Chloé's help to make things happen, and bringing up old slights isn't the way to get Marinette on board. So he settles for a silent nod and quickly packs up his own things, putting them into his backpack. \nBy that point, the classroom is empty of everyone else except for Chloé. She sits at her desk looking at her phone like she has no idea that Adrien and Marinette are still in the room, but Adrien knows damn well she’s completely aware of their presence. That’s Chloé for you.\nHe stands up and walks down the stairs towards her, pausing by her desk. \"Hi, Chlo.\"\n\"What do you want?\" Chloé says, not looking up from her phone.\n\"What makes you think I want anything?\"\nChloé does look up then, expression flat. \"Please. You never call me 'Chlo' unless you want something. Add in the fact that Rossi has been a major bitch lately, and the way you and Marinette came in all buddy-buddy, and even I can put two and two together, Adrikins.\"\n\"You're right. I do want your help,\" Adrien says, figuring he might as well be upfront about things. Chloé is many things, but she's not stupid. And making her feel stupid is a guaranteed way to insure they never get her help.\n\"We both do,\" Marinette says, because she's never been one to shy away from a hard conversation. She holds her backpack to her chest as she comes to stand beside Adrien, like she wants something between her and Chloé, but she doesn’t back down.\n\"Ugh, don't tell me you two are dating,\" Chloé says with a faint sneer, eyes darting between them. Yet she doesn’t look as upset as Adrien would’ve guessed, and he’s not really sure what to do with that bit of information. Still, this isn’t the time or the place.\n\"Chloé,\" he says warningly. \"We can talk about this later.\"\nHer sneer deepens and she rolls her eyes. \"That's as good as a yes. I would say I thought you had better taste, but I suppose I should be grateful that at least you didn't fall for Rossi.\"\nAdrien blanches at the thought. \"I give you both full permission to shoot me in the head if I ever start dating Lila Rossi.\"\n\"Done,\" Marinette and Chloé say in such perfect unison, it's a little creepy.\n\"You didn't have to agree that fast,\" Adrien mutters.\n\"If you ever started dating that bitch, it means you've gone certifiably crazy,\" Chloé says matter-of-factly. \"The fact that the two of you are planning on putting her down is the only reason I'm still sitting here listening.\"\n\"We're going to throw a party for the whole school to attend. And then, once everyone has arrived, we're going to play videos that prove Lila has lied repeatedly,\" says Marinette. \"I have one from Jagged Stone saying that he's never met Lila before, and that he definitely never owned a kitty or wrote a song about her. And we're working on getting a video from Ladybug and Chat Noir saying that they don't know Lila that well.\"\nChloé's eyes gleam. \"So you plan to embarrass her in front of everyone? Why, Marinette, I didn't know you had it in you.\"\nMarinette looks slightly uncomfortable. \"That's not really... I just want everyone to know she's lying, Chloé. I'm not doing it to embarrass her.\"\n\"Sure you're not,\" Chloé drawls, tapping her nails on the desk. \n\"I'm not!\" Marinette frowns, then just as suddenly smirks. \"Though... I can't deny it's a slight bonus, even if I am worried she might end up akumatized over it.\"\n\"Who cares if that brat gets akumatized? She deserves it after all of her lies,\" says Chloé. \"Tell me why I should help you.\"\nAdrien puts a hand on Marinette's shoulder and says, \"Because you're just as tired of Lila as we are. She's stealing the attention of everyone, including Sabrina. She also doesn't like you. It's only a matter of time before Lila turns her attention to you and tries to do the same thing to you that she did to my la - to Marinette.\"\nChloé looks at him oddly for the stutter, but shrugs. \"What makes you think I care?\"\n\"You care. You may not want to admit it, but you do,\" Marinette says. \"Believe me, you may think it's fine if everyone hates you because of a bunch of lies that someone else spread. But it's not fine. It's horrible.\" Her voice quivers a little, and Adrien tightens his grip. \n\"We can discredit her before that happens. Make sure that everyone knows not to believe a word Lila says,\" Adrien says. And then, when Chloé still looks doubtful, he lays out the finishing argument: \"Don't think of it as helping out Marinette. Think of it as helping out Ladybug. Lila has been lying about her too, pretending that she's best friends with Ladybug. Not only is that a lie, it risks putting Ladybug in danger if Hawkmoth comes after Lila and then Ladybug has to save her.\"\nFor a long moment, Chloé is quiet. Adrien would almost think that they hadn't gotten to her, except for the fact that he can see the way a muscle in her jaw is twitching. He knows Chloé; he knows that Lila's popularity is getting to her, and he knows that Chloé's probably put some thought into what she'll do if Lila ever turns on her even if she'll never admit it. He also knows that Chloé is very possessive of Ladybug, and that she'll turn herself inside out to help out Ladybug in any way. It's almost enough for him to tell her the truth, so that she'll know Ladybug is the one asking for her help right now.\nInstead, he softens his voice and says, \"Chloé, please.\"\n\"Okay, fine!\" Chloé snaps, throwing her arms in the air. \"You've convinced me. I’ll throw my weight around with Principal Damocles and I’ll even pay for the stupid thing, but I want a personal visit from Ladybug out of this.\"\n\"Done,\" Marinette says.\n\"You'll have your party by Friday,\" Chloé says, getting to her feet. \"Friday afternoon. Both of you better be ready, because you're only going to get one shot at this and you better not waste it.\" She pushes past Marinette and stalks out of the room, head held high.\nWatching her go, Adrien sighs. \"She really can be nice sometimes. I know it doesn't seem that way, but it's true.\"\n\"Oh, I don't know. Agreeing to help was nice,\" Marinette says thoughtfully. \"And she only asked for one visit from Ladybug in repayment. For Chloé, that's practically a declaration of eternal friendship.\"\nAdrien cracks a grin at that. \"You're not wrong. How are you holding up, My Lady?\"\n\"I've been better. I just… I hate the way everyone stares at me.\" Marinette hunches her shoulders. \"It's like they think I'm going to snap at any minute and start throwing punches.\"\n“It’s only for a few more days,” Adrien says, reaching for her hands. He hates that that’s the only comfort he can offer her right now. It seems so paltry. He really wants to scream at the whole school and demand to know what they’re thinking. How could anyone believe Marinette, the kindest girl Adrien has ever met, could be capable of attacking anyone?\nOf course, they’ve never seen her lose her temper with an akuma. But still!\nMarinette gives him a tiny smile. “I know. Thanks for being here with me, Chaton. I don’t know what I would do without you.” She looks away from him. “Adrien… about Alya and Nino.”\n“What about them?”\n“I don’t want to give them back their miraculous.”\nAdrien stares at her. He’s not really sure what to say to that. Finally, he says, “Ever?”\n“Maybe. I don’t know. At least not for right now. I can’t trust them, and we have to be able to trust each other out on the field, right?” Marinette’s chin trembles, and he immediately pulls her into a hug.\n“Shh, Princess. It’s okay.”\n“It’s not okay,” Marinette chokes out, trembling. “They’re supposed to be my friends. I’ve tried to talk to Alya about this, and she keeps brushing me off. All she’ll say is that I need to be less jealous of Lila, and that she doesn’t want to talk to me if I can’t be reasonable. Nothing I say gets through to her and… and I’m at the point where I don’t want to talk to her anymore because it just hurts too much.”\n“I’m so sorry, Princess,” Adrien whispers, resting his head on top of hers. \n“And Nino, he’s known me since we were kids. A lot of my classmates have known me since we were kids. I never once snapped and punched Chloé even after everything she did to me. How could they think I would do that to Lila? How could they think I would do that at all?”\n“I don’t know,” Adrien says, a mixture of anger and shame swirling in his chest. They’ve all failed Marinette so badly. “If you don’t want to give their miraculous back right away, or even ever, I support that. We’ll stay with what works the best, right? Me and you, the original duo, against the world.”\nMarinette gives a wet giggle. “But we’re not enough. We keep needing more help.”\n“Then we’ll depend more heavily on Chloé. And maybe, if we have to, we’ll find new holders for Trixx and Wayzz,” Adrien replies. \n“Maybe,” Marinette whispers, though Adrien can tell she’s not thrilled about the idea and he can’t blame her. It would be weird to see anyone else as the fox and turtle holder now, but he also completely understands where Marinette is coming from. This whole experience has shown an unpleasant side to everyone in their class, including Adrien himself. He considers himself extremely lucky that Marinette still trusts him as much as she does.\n“In the meantime, I’m going to be right here beside you for the rest of the week, My Lady,” Adrien vows. “Anyone who wants to say anything to you will have to go through me.”\n“You don’t have to do that, Adrien. I can take care of myself.”\n“Just because you can doesn’t mean you have to. I’m your partner. I’ll always be here for you.”\nMarinette pulls back a little, looking up at him. “I know. Thank you, Chaton.”\n“Don’t thank me yet. We have to make this work first,” he says. “In the meantime, how about we get some lunch? My treat? I know a great little restaurant a couple blocks away.” He doesn’t think Marinette going into the school’s cafeteria is a good idea right now.\n“Sure,” Marinette says, with a small smile. “I’d like that.”\nSchool is rough on both of them for the remainder of the work, but moreso on Marinette than Adrien. No one in their class is willing to talk to them, but she’s the one who gets the dirty looks. At one point, Nino walks in the boy’s bathroom just as Adrien is leaving. Nino actually pauses and opens his mouth like he might say something, but Adrien just gives him a cold look and walks out. \nAdrien does talk to Chloé sometimes, but he also doesn’t want to make it too obvious that he, Chloé and Marinette have cooked something up. And besides, he can tell that Chloé isn’t very happy that he and Marinette are dating now. At least her reasons for keeping her distance from Adrien are legitimate, and he hopes that the tension between them will ride out with time.\nTheir names are carefully left out of the party. No one seems to be quite sure who put the idea forth, but with Chloé’s considerable weight behind it the party goes forward full steam ahead and soon enough everyone forgets to question who came up with the idea. They’re all just buzzing with excitement and Lila, of course, walks around with the biggest, smuggest shit-eating grin on her face. Adrien has to stop himself from punching her on several different occasions, but he dreams about it with increasing frequency.\n“You’re doing it again,” Ladybug says Friday morning. “Stop it.”\nChat drags his gaze away from the school to look at his hands. He realizes with a burst of shame that he’s been angrily flexing his claws into the roof of the building, unintentionally prying up chunks of concrete in the process. He removes his claws and awkwardly sweeps the chunks back into the hole he’s dug, patting them down like that will fix the damage.\n“Oops,” he says half-heartedly.\nLadybug sighs. “Are you picturing her face when you do that, just out of curiosity?”\n“Her face, her bag, her clothes. I’m not picky,” Chat says, brandishing his claws. Plagg is gonna be pissed that they’re covered in concrete dust, but oh well. He’ll understand.\n“I hate that I pulled you into this,” Ladybug says, wrapping her arms around her legs, which are pulled up to her chest. She looks small and sad, face pale and thin behind her mask. He suspects she’s only eating and sleeping when they’re together. He’s been spending every minute with her that he can, but his after-school activities are just as demanding as ever and there’s only so much time he can spare.\n“You didn’t pull me into this, Ladybug. Lila made me a part of it from day one, remember?” Chat sighs, rolling his head back in an effort to loosen up the tension in his muscles. “And even if she hadn’t gone after Adrien Agreste, I’m still a part of it because I’m Chat Noir. Whatever happens to you affects me, and vice versa. Right?”\n“Right,” Ladybug says with a tiny smile. She holds out her fist and he gently bumps it with his own, then scoots closer and wraps an arm around her shoulders. She lays her head on his shoulder and they go back to watching the preparations for the party.\nBoth of them decided that avoiding the school this morning would probably be best. In the excitement of getting ready for the party, Chat is sure no one has noticed their absence. And if they did show up, they’d only be subject to more stares and whispers. No, he and Marinette will make an appearance just after the pary starts: just in time to swap out the video that’s supposed to be playing. Instead of the interview that Lila once did for the Ladyblog, the whole school will see something completely different.\n“I hate her,” Chat says after several moments of silence. “I didn’t think I could hate anyone other than Hawkmoth, but I actually, legitimately hate her.”\nLadybug nods. “She’s a pretty horrible person. I wish she’d never come to Collège Françoise Dupont.” \nChat sighs at that, looking back down at the courtyard. Max is in the middle of setting up the huge viewing screen. Everyone else is hard at work too, helping to set up long tables for refreshments and putting up decorations. Chloé is nowhere to be found – Chat’s pretty sure it just about killed Chloé to use her influence to put this party on – but they all seem so happy. He doesn’t understand that. How they can be so happy believing in such blatant lies?\n“Madame Bustier told me that people can be fickle when they hear what they want to hear,” he says at last. \n“Lila said the same thing to me once. She said that people like her when she tells them what they want to hear.” Ladybug’s shoulders slump. “So… do you think that means people wanted to hear that I beat someone up?” \n“No! I just think… when Lila started here, she was telling everyone what they wanted to hear. She told Alya that she had a connection to Ladybug, and she told Nino that she could introduce him to people with influence in music, and she told me that she was a superhero. Everyone knows how much I love superheroes. She just didn’t get that I love you, not just superheroes in general. It was exciting to hear that she was Volpina because I thought she would help us, not because I could love her.” Chat laughs to himself, shaking his head at his own gullibility.\nOf course, at the time he hadn’t known that Master Fu existed. And Plagg had never explained how the Black Cat miraculous came to be in Adrien’s hands. It made sense now that Master Fu would never choose someone like Lila to be a miraculous holder, but Adrien had just… sort of figured that miraculous fell into the right hands naturally. Not by design. \nNot noticing that Ladybug has tensed up beside him, he continues, “But lies like that can only impress people so much. That’s why she had to keep telling bigger lies, which are easier to disprove if people are paying attention. I mean… Jagged Stone? Really? She should’ve chosen another musician that you don’t personally know.” He rolls his eyes. That was a mistake on Lila’s part. Just a little bit of research would’ve told her that.\n“Then there’s people like you. People who are smart, beautiful, kind, and naturally good leaders. Everything Lila wants to be, but she’s not willing to put the work in. So she just lies, and that makes you a threat to her. To make herself seem better, she had to put you down. When threatening you didn’t work, she tried something that she thought your reputation couldn’t recover from. She was probably hoping you’d leave school and she would get me and everyone else all to herself.”\n“Chat…” Ladybug’s voice is barely audible, and he turns to look at her. Her eyes are wide.\n“What? What’s wrong?”\n“You… you love me?”\nChat blinks at her, a little shocked. Then he replays the last two minutes and, when he realizes what he said, blushes a shade of red to rival her suit. “I – uh – well. Yes,” he squeaks, mortified but also determined. “I love you, My Lady. I always have.”\nLadybug stares at him. “I-I thought you were just flirting with me. I thought you flirted with everyone, because you flirted with Marinette too…”\n“Oh… I guess I did. I never thought about it like that. Um…” Chat looks away, biting his lip. His stomach is doing flips. “I… I guess it’s always been you, Marinette. No matter what mask you have on.”\nShe tackles him. Literally. Chat yelps as he falls over, but before he can figure out what’s happening Ladybug is grabbing his bell and yanking him into a kiss. He’s frozen beneath her for the first couple of seconds before his brain gets with the program, but then he brings his hands up and slides them into her hair and angles his head ever so slightly to better fit.\nHer lips taste like vanilla.\nWhen they break the kiss, by virtue of the fact that even in the suits they still need to breathe, Ladybug’s eyes are filled with tears. “I love you too, mon minou.”\nShe loves him. It’s not just a crush. She loves him! Chat savors the sounds of the words, knowing he’ll be replaying them for years to come, as he leans up to kiss her again. He wants to pull her down against him and spend the rest of the day making out here on the roof, where all of their responsibilities seem miles away. But he’s all too aware that this is probably their one chance to take Lila down.\nAs though knowing what’s going through his mind, Ladybug pulls away after pressing one last kiss to the corner of his mouth. She lays down on top of him, her cheek resting on his chest so that she can hear his heartbeat. Chat lazily runs a hand through her hair, knowing that she can hear the way his heart is racing and hoping that she knows it’s all for her. This is everything he’s ever wanted, even if he never actually thought he would be lucky enough to have it.\nThey lay in silence for a while before Ladybug finally asks, “You really think I’m a threat to her? Me?”\n“Absolutely. It’s probably the smartest thing Lila’s ever done, pinpointing you as a threat,” Chat says. Also the stupidest thing Lila’s ever done, but that’s neither here nor there. “I also think at this point, she’s told so many lies that people will buy into anything she says just because they don’t want to consider that maybe they were wrong to believe her in the first place.”\n“Then… do you really think this will work?”\n“Yes,” Chat says, with all the confidence he can muster. “We’ve got proof. But I don’t think that things are just going to go back to normal, either. People will have to sort through what happened, and hurt feelings don’t just magically disappear.” He knows that firsthand.\n“I wish they would,” Ladybug mutters. \n“I know. But they don’t. What I mean is…” Chat takes a deep breath. “You don’t have to forgive everyone just because they apologize. If they apologize. You can be angry and hurt. What we did really sucked.”\n“We?” Ladybug shifts, sitting up. His claws catch in her hair ribbons and pull them free, so that her hair spills around her shoulders. “Stop it. You didn’t do anything wrong, Adrien.”\n“But – ”\n“No! No ‘buts’! You told me to take the high road because you really thought it was the best thing to do based on the information you had. You didn’t know Lila threatened me. You couldn’t have known she was going to attack me. And when you did know, you immediately apologized and took steps to make things better. Stop tormenting yourself, okay? I’m not mad at you and I definitely don’t blame you. For any of this.”\nHer gaze is so intent that Chat swallows. “Okay.”\n“Good,” Ladybug says. “Because you’re right, I probably won’t forgive everyone right away. And I’m going to need you with me when that happens.”\n“I’ll always be with you,” he promises, reaching for her hand. He presses a kiss to the back of it, relishing the way she lets it happen now. She hasn’t pushed him away since this began. And while he hates that it took Lila Rossi to bring them to this point, he wouldn’t change a thing either. \nShe smiles down at him, her cheeks lightly flushed, and taps his nose with her free hand. “I know. Now, come on. We have a villain to expose!”\nThey make their way down off the roof and detransform a couple streets over, just in case anyone caught sight of Ladybug and Chat Noir on the roof. Marinette's hair is still around her shoulders, but she doesn't seem inclined to tie it back as they walk towards the school. Adrien wonders if she's nervous, but, if she is, her expression is outwardly calm. He pastes a similar look on his face and links their arms together. They can do this.\nThe party is just starting, with students assembling in the courtyard. Chloé is standing by the refreshment table, paging through her phone while ignoring everyone. Adrien gravitates towards her automatically, and Marinette willingly follows. They pass plenty of familiar faces on their way there, but no one is willing to meet his gaze. He does see a few raised eyebrows and smirks, and his accelerated hearing picks up the whispering that starts once they've moved by; they're all wondering why he and Marinette have bothered to show up.\n\"This party sucks,\" Chloé says as soon as they're within hearing distance. \"Tell me why I’m here again? I could be shopping right now.\"\n\"Stick around, you're going to want to see this. I promise,\" Marinette says. Adrien moves so that Marinette is left standing between him and Chloé. The side eye he gets from both girls tells him they know what he's doing and neither is thrilled, but he doesn't care. It must be a cold day in hell, because Marinette Dupain-Cheng is actually safer standing next to Chloé Bourgeois than she is anywhere else in school.\n\"How are you going to make it happen?\" Chloé asks. \n\"Leave that to me,\" Adrien says with a smirk, surveying the refreshment table. He picks up a few cubes of cheese and slips them into his shirt pocket for Plagg to munch away on. Chloé watches him do this, her lips pursed and eyes narrowed. Adrien winks at her.\n\"There she is,\" Marinette says suddenly, her nails digging into Adrien's arm.\n\"Oh my god, all this for me?!\" Lila cries out at the same time. She clasps her hands to her face. \"This is so wonderful. Thank you, everyone!\"\n\"Ugh, I wish I had my miraculous so I could Venom her ass,\" Chloé says mournfully, folding her arms across her chest. \n\"I wish you did too,\" Marinette mutters.\n\"Me three,\" Adrien says, patting Marinette's hand. \"I'll be right back. I need to use the bathroom.\"\nHe heads back into school. Part of him hates to leave Marinette alone, but having Chloé there is a minimal comfort. There's no love lost between them, but Chloé knows Marinette is important to Adrien and she hates Lila. Plus, although Adrien would never out his lady, Chloé would literally happily scratch Lila's eyes out if she found out exactly what Lila's done to her beloved Ladybug. Frankly, Adrien thinks Lila should be damn grateful they haven't told Chloé that part of it yet. \nAfter finding an empty classroom - not hard, because everyone is outside - Adrien sets their secret weapon on a desk. \"Plagg, claws out!\"\nChat picks up the USB stick and sneaks outside, making it seem like he came from anywhere except inside the school. This was Tikki's idea; she thought that the footage would seem even more believable if it was delivered from Chat Noir. He struts into the middle of the party using his best runway walk. It definitely gets attention. A few people catch sight of him and then words spreads, to the point that by the time he gets to Max everyone is staring at him - including Lila, though her expression is about as far away from friendly as it gets.\n\"Hi,\" Chat says politely. \"I heard about the party you were having. Ladybug sent me over, actually. We have a video that we'd like played, if that's okay.\"\n\"Absolutely!\" Max says, straightening his glasses. Of course it's okay. Ladybug is Lila's best friend, right? Chat smiles and hands over the USB stick.\n\"Make sure you play the whole thing, okay? It's really important to Ladybug.\"\n\"Of course. Let me just - \" Max plugs in the USB stick and types a few things into the computer. Chat stands back and watches, smirking, as the viewing screen flickers to life.\nJagged Stone's face is the first thing that comes into view, filling up the screen. Then he pulls back, revealing that his assistant Penny is hovering over his shoulder, and says, \"What do you need to ask me, Marinette?\"\n\"I just wanted to know if you'd ever heard of someone named Lila Rossi,\" Marinette says, her voice sounding slightly distorted. It's obvious this is a recording from Marinette's computer and that she’s standing over her laptop, probably leaning over the microphone.\n\"Lila Rossi?\" Jagged repeats, screwing his face up. \"No, the name doesn't ring a bell. Penny?\"\n\"No, I don't recognize it either,\" Penny says, brushing a strand of purple hair out of her face. \"Who is that, Marinette?\"\n\"Just this girl I know,\" says Marinette. \"So... out of curiosity, you've never had a kitten that needed to be saved from an airplane?\"\n\"A kitten?\" Jagged starts to laugh. Penny sighs and leans in closer to the screen.\n\"Jagged's not crazy about cats. He likes Chat Noir just fine, but that's about the only cat he can tolerate. Besides, even if he did like cats, we couldn't have one around Fang. He would eat the poor thing.\" She cocks her head. \"Where did you hear such a weird story?\"\n\"Oh, nowhere special,\" Marinette says.\n\"So when are you going to design something else for me?\" Jagged demands, pushing Penny out of the way to move in closer. \"I need another Marinette original!\"\nMarinette laughs. \"I'll design you something whenever you want, Jagged.\"\n\"Good! I have loads of ideas and no one gets me quite like you do.\" He leaps up from the table to air guitar, and Penny sighs, shaking her head with a fond smile.\nThe screen goes dark. Chat looks around. Several students are wearing confused expressions, but he can tell that no one has quite figured out the truth just yet - no one, that is, except for Lila. Her face is flushed with anger and she's glaring at him like she wants to burn a hole through his head. Chat smiles brightly back at her, all innocence, knowing that it will just make her more angry.\nWhen the screen lights up again, it's showing Adrien and Madame Rossi. This time, already knowing exactly what the video is going to say since he lived through it, Chat keeps an eye on the crowd. He sees the shock on Marinette's face when she realizes what's going on. He sees the shock and disbelief dawning on Alya's face as Madame Rossi insults Ladybug and Chat Noir and makes it crystal clear that Lila is the one who has been feeding her all those lies. \nHe sees the way Principal Damocles puffs up when Madame Rossi makes reference to the school being closed. He sees the surprise on Nino's face when Madame Rossi says her family hasn't traveled in well over two years, meaning that there's no way Lila was in New York to meet a bunch of music producers last year. He sees the outraged expression on Chloé's face when Madame Rossi calls Adrien Lila's boyfriend.\nBut best of all is the way that Lila slowly goes dead white as her mother unknowingly unravels so many of her lies. The video only lasts about five minutes, because that's all they really needed for the most incriminating information, but it's five of the sweetest minutes of Chat's life. There's dead silence in the courtyard when the video finishes. Lila just stands there, mouth opening and closing soundlessly. No doubt she's trying to think of a lie, but her mind is coming up blank because there is no lie that could get her out of this.\nAnd then, the last video starts to play. Everyone snaps to when Ladybug and Chat Noir's faces fill the screen. Chat takes the chance to slip away, now knowing that there's no way Max is going to shut off the video prematurely. He detransforms behind some bushes and then walks back to over to Marinette and Chloé. Marinette startles when he wraps an arm around her shoulders, but leans into him anyway. Chloé turns away from the screen, where Chat Noir is doing acrobatic feats, to look at Adrien with a strange, indecipherable expression on her face. Adrien meets her gaze, hugging Marinette to him.\n\"Stay safe, Paris!\" Chat Noir calls out from the screen, and then it goes blank.\nThere's silence.\nThen Alya says, sounding slightly hysterical, \"What the fuck was that?! You were lying to me? I posted your interview on my Ladyblog!\" \n\"That - that wasn't true!\" Lila says feebly. \"It's - obviously those were fakes!\"\n\"No one else could do that, Lila!\" Alya screams. \"That was them! Chat Noir himself brought that footage!\"\n\"They had to say that! Because Ladybug wants to protect me!\" Lila exclaims. \"To keep me safe!\"\n\"And what about everything else?\" Nino demands. \"What about Jagged Stone, or you traveling to New York?! Were your mom and Jagged just trying to protect you too?\" Adrien's never seen him look that angry. Alya’s turning new shades of red and purple.\n\"Or closing the school?\" says Alix, crossing her arms. \"And saying that Ladybug and Chat Noir never saved all those people?\"\nSuddenly everyone is yelling, shouting accusations at Lila. Adrien almost feels sorry for her, because Lila is clearly overwhelmed by the amount of vitriol being spewed in her direction. She puts her hands up and backs away.\n\"No, you don't understand! It's all - it's just - it's her!\" Lila points at Marinette. \"She's working against me, just like when she attacked me!\"\n\"Marinette never attacked you. That's just another one of your bullshit lies,\" Chloé says, loudly and clearly to be heard over the angry whispering. \n“Yes she did! I had the injuries to prove it! She attacked me, I’m telling you!” Lila looks around, her eyes roving over all the faces staring at her. Adrien can pinpoint the moment when Lila realizes that not a single person here is on her side. Even Madame Bustier looks pissed off.\nLetting out a savage scream, Lila lunges towards the refreshment table and grabs a knife. “This is all your fault, Marinette Dupain-Cheng! I warned you that you would be sorry if you didn’t back off!” She brandishes the knife and comes at Marinette. A few people scream.\n“Holy shit!” Chloé exclaims. She gets out of the way and yanks out her phone, training it on Lila.\nAdrien moves to intercept Lila, but Marinette is already in motion. She grabs Lila’s wrist and twists it, making Lila yelp with pain and surprise. The knife falls from her suddenly limp fingers and Marinette grabs it, quickly passing it over to Adrien. Then she spins Lila around, wrenching Lila’s hand up behind her shoulders. The whole process takes less than twenty seconds, so that, by the time any of their teachers have started to act, Marinette’s already got Lila taken care of.\n“See? She attacked me!” Lila shrieks, wriggling. Marinette effortlessly keeps Lila pinned.\n“Yeah, after you attacked her. Which I got on film, and is totally illegal,” Chloé says, still filming. She catches Adrien’s eye, and there’s something new in her face that he’s not yet sure what to make of.\n“No! You don’t get it! I don’t – Marinette just – she – ” Lila collapses to her knees and starts sobbing. Marinette lets her go and takes a few steps back, eyeing her warily.\n“Principal Damocles, it doesn’t seem very safe to have Lila here. Maybe Sabrina could call her dad,” Adrien says.\n“What?” Marinette says, surprised.\n“I can do that,” Sabrina says, already whipping out her phone. She sneaks a glance at Chloé, who ignores her.\n“Mademoiselle Rossi, we will wait for the police in my office. I’m going to call your mother as well. Your behavior at this school has been reprehensible. You are hereby expelled from Collège Françoise Dupont!” Professor Damocles storms over, Madame Bustier on his heels. Between the two of them, they get Lila on her feet. She walks between them, still sobbing into her hands, back into the school.\n“Nice reflexes, Princess,” Adrien says, carefully setting the knife down on the edge of the table. Officer Raincomprix might need it if Marinette decides to press charges. He really doubts that she will, because Marinette’s heart is too big for her own good, but it could happen.\n“Thanks,” Marinette says with a tiny smile, turning to him and smiling. It feels like a moment where they should bump their fists together and say “Bien joué!” but that would, of course, be a dead give-away to anyone who is watching them. So instead…\n“Wanna go grab a coffee?” Adrien suggests. A lot of people are still staring at them, including Chloé, but he has the feeling Marinette isn’t ready to deal with any of them.\n“Yes,” Marinette says emphatically, reaching out for him. He takes her hand and they walk out the gates together, leaving everyone else behind.\nThey celebrate their success with pastries, cookies for Tikki and cheese for Plagg, and coffee. Marinette is all smiles, like a weight has been taken off her shoulders; Adrien knows exactly how she feels. It’s wonderful to see her smiling again. He’s just considering whether or not they have time to go see a movie before he has to show up to fencing practice when Chloé drops into the seat beside him.\n“I’ve changed my mind,” she announces, propping her elbows on the table.\n“Oh really,” Marinette says. “About what?”\n“I don’t want a personal visit from Ladybug. I want to keep my miraculous all the time.”\nAdrien freezes. Marinette chokes on her sip of coffee.\n“Come on, it was so obvious after that whole incident,” Chloé says, leaning her chin on her hand. “Chat Noir shows up just as Adrien slips away? The two of you getting such good footage of Ladybug and Chat Noir? Not even Césaire has ever accomplished that, and she’s obsessed with Ladybug. Plus, I’ve never seen anyone move like that except for Ladybug. It also makes way more sense why you two suddenly got so close. Obviously you revealed your identities to each other.” \nMarinette opens her mouth, then closes it. She opens it again and says helplessly, “Chloé…”\n“Don’t bother lying to me. Adrien’s been head over heels for Ladybug for ages. That wouldn’t just suddenly change,” Chloé says. “Now I get why you two are dating. And honestly, now that I know, I just can’t believe I didn’t see it before. Adrien is a dork, just like Chat.”\n“What – I am not!” Adrien says indignantly. “My puns are paw-some, thank you very much.”\nChloé just looks at him with this deadpan expression. “I can’t believe I ever wanted to marry you.”\n“Hey!”\n“Okay, fine,” Marinette says. “You’re right. But I don’t know about your miraculous. It’s not our choice to make.”\n“But you do have a say in it. You’re Ladybug.” There’s something reverent about the way that Chloé says that, though it’s obvious she’s desperately trying to hide it. It’s kind of adorable and Adrien works hard to suppress his grin, knowing that this has to have thrown Chloé for a complete loop.\n“I might get a small say,” Marinette says grudgingly. “We’re just not comfortable with too many miraculous being out and about all at once.”\n“Well, it’s not like you’re going to be giving out the fox and turtle anytime soon,” Chloé says, grabbing Adrien’s coffee. She takes a sip and wrinkles her nose. “Ew, Adrikins, seriously. Try having a little coffee with your sugar.”\n“I like it that way, thank you very much,” Adrien says, grabbing it back.\n“I’m suddenly getting a vision of my life in the near future and regretting my choices,” Marinette mutters, looking totally unsurprised when Chloé promptly steals her coffee instead. \n“Oh please. I’m an upgrade and you know it. If you’d told me you were Ladybug, I would’ve made Lila Rossi disappear ages ago,” Chloé says.\n“It concerns me that I’m not sure whether you’re serious or not,” Marinette says.\n“I’m 100% serious,” Chloé says, not smiling. “Daddy has connections.”\n“Not helping your chances of getting your miraculous, Chlo,” Adrien says.\n“Hey, you both owe me. And I miss Pollen.” Chloé’s voice gets a little quieter at that. Adrien feels a pang and knows, glancing at Marinette, that she’s affected too. Losing Plagg for even a few minutes when Sandboy was rampaging around was horrible. He can’t imagine only getting to see Plagg here and there.\n“We’ll see what we can do,” he promises Chloé.\nThat night, Ladybug pays Master Fu a visit. Saturday morning, Adrien escorts Chloé to the bakery and then up to Marinette’s room. There, Marinette formally presents Chloé Bourgeois with the Bee Miraculous.\n“This is a big responsibility, Chloé. By taking the miraculous, you’re pledging to put Paris first before anything else,” Marinette says, Tikki floating beside her. “You’re promising to care for your kwami and fulfill her needs to the best of your abilities. You’re vowing to keep any secrets that you discover in the line of duty, including our identities, to yourself, no matter what kind of situation presents itself. You’re agreeing to work with Chat and me, including patroling with us, no matter what sacrifices it requires of your civilian life. And most of all, you’re affirming that you will never use your miraculous for evil.”\nChloé nods, looking unusually sombre. “I swear,” she says, holding a hand out.\n“Then you, Chloé Bourgeois, are now the holder of the Bee Miraculous. You will keep your miraculous safe at all cost. If anyone asks, you will neither confirm nor deny that you are still Queen Bee.” Marinette gently sets the comb into Chloé’s hand. It glows, and Pollen emerges.\n“Hello, my queen!” she chirps.\n“Pollen!” For a moment, it almost looks like Chloé is going to cry. Adrien can’t blame her for excusing herself to the bathroom.\n“I still can’t believe Master Fu agreed,” he says into the silence.\n“Well, he didn’t want to. Not until I explained that I won’t be asking for the turtle or fox miraculous anytime soon. He was disappointed, I think. In me, and in Alya and Nino.” Marinette sits down beside him on the chaise, leaning against him.\n“Master Fu wasn’t disappointed in you, Marinette. These things happen,” Tikki says, landing on Marinette’s knee. “That’s one of the reasons why he didn’t want you to give out the miraculous for good right away. Not everyone is suited to having one.”\n“Maybe in the future, Alya and Nino will re-earn your trust,” Adrien says gently. \n“Frankly, I’m surprised the old man was willing to let Chloé have the Bee Miraculous when the Butterfly and Peacock are still out there,” says Plagg.\nMarinette shrugs. “I told him the truth. That Chloé was going to be our choice for back-up from now on, and that it doesn’t always make sense for Adrien and me to leave a battle to go retrieve a miraculous. It’s worked out for us so far, but Hawkmoth has shown that he’s only getting stronger. Originally I was going to ask about the fox for Alya, but…” She bites her lower lip.\nAdrien squeezes her in a hug, kissing the side of her head. “Have you heard from them?”\n“Oh yeah. I’ve been flooded with texts. It’s crazy.” Marinette reaches out and grab her phone from her desk. She shows him the screen and all the texts. “I haven’t responded to anyone yet. I don’t really know what I’m going to say yet.”\n“Not even Alya?”\n“No. I need some time to think about it. And frankly… a text isn’t going to cut it.” Marinette puts her phone in her pocket. “She’ll probably talk to me on Monday. Depending on what she says, I might accept her apology. But I’m a long ways away from trusting her again.”\n“That’s fair,” Adrien says. He feels similarly about Nino. They’re still friends, but this whole thing has definitely made Adrien question how well he knows Nino. \n“Alright, I haven’t been Queen Bee in ages,” Chloé says, throwing the trap door open and barging up the stairs. “I want to go out.”\nMarinette smiles. “I don’t see why not. Sometimes Chat and I do patrol during the day.” She stands up. “Tikki, spots on!”\n“Plagg, claws out!”\n“Pollen, buzz on!”\nQueen Bee is the first one on Marinette’s bed and out onto the balcony. Chat grins to himself as Queen Bee leaps off the balcony, letting out an excited scream. He pulls himself up onto the balcony and stands there for a moment. Ladybug joins him, and they watch the yellow-and-black silhouette swing towards the Eiffel Tower. Queen Bee’s excited whoops echo back to them.\n“I never thought I’d say it, but I’m actually glad Chloé picked up the miraculous that day,” Ladybug says.\n“You and me both,” Chat says. He leans over to kiss her. “I love you, My Lady.”\nLadybug’s eyes sparkle for the first time in what seems like forever. “I love you too, Chaton. Now… last one to the Tower buys everyone else juice and feeds the kwamis?”\n“You’re on!”"
}