{
    "id": "1793110",
    "url": "https://archiveofourown.org/works/1793110?view_full_work=true",
    "author": [
        "zeitgeistic"
    ],
    "title": "You First, Loser",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Draco Malfoy/Harry Potter"
    ],
    "characters": [
        "The Weasleys",
        "Lucius Malfoy",
        "Narcissa Black Malfoy",
        "Ron Weasley",
        "Hermione Granger"
    ],
    "additional_tags": [
        "Mpreg",
        "Bets & Wagers",
        "Humor",
        "Romance",
        "Nesting",
        "Companionable Snark"
    ],
    "language": "English",
    "series": "",
    "published": "2014-06-16",
    "completed": null,
    "words": "6,372",
    "chapters": "1/1",
    "comments": "520",
    "kudos": "17,724",
    "bookmarks": "2,975",
    "hits": "177,092",
    "summary": "<p>When Harry and Draco’s “not serious” three-year relationship results in a one-in-a-million pregnancy, they decide who will be the unlucky one to tell their families in a very mature and adult fashion that indubitably proves their inherently stellar parenting abilities: with a bet over a (probably rigged, let’s be real; Draco is playing) game of Exploding Snap.</p>",
    "notes": "<p>I picked this prompt because my beta, eidheann, prompted it. She puts up with all my wibbly shit so I wanted to write something surprising for her. Surprisingly for me, she was secretly co-modding the fest. Failed surprise, but I hope she liked it anyway. :) Thank you to firethesound for betaing this time so it could at least be sort of a surprise!</p>\n<p>But if you'd like to find me, I'm @lol-zeitgeistic on Tumblr and Gloame#0082 on Discord. :)</p>\n<p>FOLLOW ME ON TUMBLR for snippets, what I'm working on next, and to ask me anything :) <a href=\"https://lol-zeitgeistic.tumblr.com/\" rel=\"nofollow\">lol-zeitgeistic on Tumblr</a></p>\n<p>DO NOT REPOST OR ARCHIVE THIS FIC ANYWHERE. (I can't believe I am having to put this notice up again. What happened to fandom etiquette?) ty</p>\n<p>SPANISH TRANSLATION: <a href=\"https://www.fanfiction.net/s/12032312/1/You-First-Loser-TRADUCCION\" rel=\"nofollow\">here</a>, via Adigium21!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>FOLLOW ME ON TUMBLR for snippets, what I'm working on next, and to ask me anything :) <a href=\"https://lol-zeitgeistic.tumblr.com/\" rel=\"nofollow\">lol-zeitgeistic on Tumblr</a></p>\n<p>DO NOT REPOST OR ARCHIVE THIS FIC ANYWHERE. (I can't believe I am having to put this notice up again. What happened to fandom etiquette?) ty</p>",
    "text": "“Loser does the talking,” Harry says. \nDraco raises his eyebrows. “Go ahead then.”\nHarry scowls. “Don’t fuck with me, Malfoy.”\nDraco grins slyly. “Already did. That’s our problem, or have you forgotten?”\n“I imagine I won’t be able to forget for at least another eighteen years.”\nDraco scowls at him. “I give you six months until you change your tune there, Potter,” he mutters.\nHarry looks at him askance, momentarily baffled. They usually don’t go six months between shag fests. More like two. Lately, it’s been closer to a few days apart, here and there. Harry’s never been sure if that means anything or if their mutual dwindling of ‘serious’ romantic partners has just pushed them closer together more frequently because they’re fucking lonely. \nIt’s just that Harry’s never been the type to get lonely. He doesn’t miss people. But sometimes, he misses Draco. The annoying twat. He shrugs it off and slaps down another card. It explodes. Fuck. \nDraco smirks at him, leaning back against his chair and crossing his arms over his chest. “Shall we Floo to my parents’ or your Weasleys’ place first?”\n“I despise you,” Harry mutters, without heat. Then, to himself, he adds: “How did this happen to me? I’m a good person. I do good things and I’m nice and I usually only ever forget Hermione’s birthday once a year.” (Typically, on September 19th) \n“We’ll start with my parents then, my dear good person,” Draco says, rolling his eyes.\nHarry meets his eyes again, feeling his skin tighten with the uncomfortable crawl of dread. He’s an Auror, for fuck’s sake; it’s not like Lucius or Narcissa could do anything to him if he told them he’d knocked their son up...but the thing is, when the Malfoys find out, that means that the Weasleys will be shortly following. And what if they don’t like it? What if they can’t get past Draco’s past? What if they make him choose between them and Draco and his baby? \nIt makes Harry want to vomit. \nThey’ve only known about this pregnancy for three weeks, and it’s really fucking weird and there’ve been like four cases of male pregnancy without taking a strict fertility potions regimen in the history of the world ever, and of course Harry’s got to be an active party to case number five, and he’s never really thought he’d ever be a dad at all, much less with Draco, who is surprisingly copacetic about the whole thing and the fact that it will legally and sort of familially tie him to Harry for the rest of their sodding lives, not to mention probably give him stretch marks, and also Harry’s surprisingly copacetic as well, and— \nHe’s run-on-sentencing again. In his own head. It’s not uncommon when he’s thinking about Draco. There are just so many things to think about Draco at any given time, and if he spared an individual sentence for each one of them, he’d...well, he’d have a lot of sentences.\n“Maybe we should wait.”\nDraco’s eyes narrow. “Until when?”\n“Another month or so?” Harry suggests hopefully.\nDraco wrinkles his nose, but Harry knows he’s dreading his parents finding out just as much as Harry is the Weasleys, so he considers it. After a moment, Draco huffs. “Alright, Harry.” Harry grins. Then Draco says, “But my hormones are ridiculous. Come fuck me. No wait, I want to fuck you before I get too fat.”\n“Best day ever,” Harry says, standing right up. He doesn’t have to go talk to Mummy and Daddy Malfoy today and he’s getting laid. Draco pushes away from the table, pulling his shirt off as he turns and saunters into the bedroom. The look he gives Harry over his shoulder is one hundred per cent slaggy, and Harry is all about being a slag for Draco. \nHe’s just not too keen on telling the Weasleys what a slag for Draco he is. But there’s always next month.\n\n-x-\nFour weeks and three hours later, Harry’s misconception is corrected.\n“Mother caught me as I was walking by the Floo and I couldn’t get out of dinner,” Draco says when Harry walks in from a weekend shift to find him tying a cravat in front of the mirror. “I told her I’m bringing a guest. Don’t forget you lost.”\nHarry’s good mood at the sight of Draco in a prissy necktie (his favourite thing, basically) quickly evaporates like a Weasleys’ Portable Oasis. “Damn it, really?”\n“Afraid so,” Draco says. \nHarry scowls and tries to distract him by snuggling up against Draco’s back and wrapping his arms around him. He’s three months along now and barely showing; you still can’t tell when he’s wearing what he refers to as his ‘weekend slumming robes’ but when he’s walking around in one of Harry’s tight t-shirts, it’s starting to look like he has a little belly and Harry thinks it’s incredibly adorable. He presses his palms over the small curve of Draco’s stomach and props his head on Draco’s shoulder, eyes closing as he tries to feel for something. He knows it’s too soon, but it’s just so fucking amazing that this could happen and, Merlin, some days Harry really wishes he could tell Ron and Hermione. \nBut of course he can tell them. He could’ve told them two months ago when he and Draco first found out, or a month ago, when he lost that game of Snap and the subsequent bet that went with it. Draco’s okay with everyone finding out about their strange almost-not-quite relationship—well, okay is probably not the right word. But he’s contentedly resigned to the fact that Weasleys will, one day, know that he regularly has sex with Harry. And has done on and off for three years now.\nAnd content is such a strange word to think of Draco. Out in the world, he’s known for being a first-class prick (and he is) but Harry is, apparently, attracted to first-class pricks and sometimes it’s hard to reconcile the Draco that shacks up with him here three nights out of seven with the Draco who works with Susan Bones and Pansy Parkinson—all together affectionately referred to as the “Bitch Battalion” by their employer, the editor of the Daily Prophet.\n“Maybe you could just write a story on it,” Harry suggests. “Sexy and merciless (male) senior political reporter somehow impregnated by Harry Potter, no doubt due to Potter’s strange and unceasing ability to be a walking Murphy’s Law.”\nDraco scoffs. “Please don’t flatter yourself. Also, you’re awful at headlines. And you’re still telling my parents. You lost.”\nHarry grunts and rubs his hands slowly up and down Draco’s stomach until he lets go of the cravat and sinks back against Harry’s chest. “It’s just that I sort of almost like your mum these days and I don’t want her to hate me again.”\nDraco huffs out a laugh. “I know you’ll be delighted to tell my father, though.”\n“I would’ve been if I could’ve done it anywhere but the Manor. Will you rescue me if he invokes ancient Malfoy magic and traps me in a looking glass or something?”\n“Depends on if the looking glass he puts you in matches my furniture or not.”\n“How will I support you and baby Potter if I can’t go to work?”\n“Baby Malfoy,” Draco says, scowling. He then turns around to scowl more directly. “I carry, I claim as heir. You want an heir, you can damn well carry one.”\nThis is pretty reasonable, but Harry likes to bring it up every chance he can anyway. Because it pisses Draco off. Harry grins, leans in to kiss him. He’s half a mind to undo the cravat so he can watch Draco do it again, but then he feels something hard pressing against his thigh and decides on another course of action. Not at all intended to be a diversion.\nHarry sinks to his knees, neatly pushing aside Draco’s robes to finger the laces of his trousers. Draco’s breathing speeds up as Harry looks up at him over the curve of his belly. It should be weird, and Harry admits he’s still getting used to the idea, but it’s so fucking hot to think that part of him and part of Draco are making something brand new, that their magic is so sodding compatible that they created life without even the need for potions. \nHe unlaces Draco’s trousers and slowly tugs the flies apart, grinning as Draco’s cock springs free. Draco’s face is intent, his eyes focused on Harry’s mouth, his breath coming in shallow little huffs. Harry licks his lips and Draco’s stomach clenches, his fingers thread into Harry’s hair and tighten.\n“Want it?” Harry asks, running his nose along the shaft.\nDraco’s fingers tighten again before moving down and back up again, petting Harry restlessly. “Yeah, do it. Come on, suck me.”\nHarry likes the way he says that, so he does. At great length. By the time Draco’s thighs are tensing and his head is dropping back, Harry’s got a rhythm going that he wouldn’t mind continuing for the rest of the night. But then Draco whispers, “Fuck, Harry, yeah,” and Harry whines deep in his throat, suddenly desperate to get off. He reaches down and clumsily unzips his own jeans, pulling his cock out and jerking himself in time with the bobs of his head. He adores it when Draco uses his name. The sound of it’s brought Harry to orgasm on more than one occasion, generally with Draco’s cock up his arse at the same time, but this, having Draco in his mouth and the taste of his precome slicking up Harry’s mouth gets him there just as fast. He feels his balls tightening and then the hot splash of come inside his palm as he closes his hand around the head and rubs. He whines again, dragging Draco’s hips closer with his free hand and then Draco gasps and breathes his name again as hot come spills into Harry’s mouth. \nThere are worse ways to prepare for a visit to one’s almost-not-really in-laws.\n\n-x-\nHarry will absolutely not be salting anything tonight.\n“So, Mr Potter,” Narcissa says. “Draco tells me that you often work together. Do you think a career in politics is in your future?”\n“Fuck, no,” Harry says before he can think better of it. He hears Draco choke next to him and panic rises in his chest before he can comprehend that he’s just swallowed his water wrong. Harry quickly pats him on the back and thinks, ‘Come on Potter, don’t accidentally kill your child, you moronic mouthpiece.’ Draco glares up at him, eyes watering as he gets his breathing back under control.\n“Sit down, Harry,” he mutters, but he’s fighting a smile. \nHarry obeys and only then glances up to see the matching looks of scrutiny on Mummy and Daddy Malfoy. Harry clears his throat. “Sorry about that. I’m a product of my upbringing,” he says, which he suspects will endear him to them because there’s nothing a Malfoy likes better than the bourgeoisie knowing their place.\nIt works. Lucius smirks and Narcissa’s eyes crinkle, and the rest of the dinner isn’t so bad, except for the part where they make it all the way to the end, and Harry still hasn’t told them that Draco’s pregnant.\n\n-x-\nAnd Draco hasn’t kicked him out yet. Which is really weird because Draco usually kicks him out after a week max. Usually on a Sunday, when he has dinner with his parents. But lately, Harry’s been to every one of those dinners, and somehow it’s just happened that he’s gone back to Draco’s after every one of them. It’s a really good thing that he doesn’t have a pet because he totally would’ve forgotten to feed it by now what with all the kinky, hormone-fueled sex Draco’s been demanding non-stop. \nHarry’s awful at this responsibility thing; he should probably never be a par—\nOh, fuck.\n\n-x-\nBut here he is, and here the Healer is, pointing his wand excitedly at a hologram projected above Draco’s abdomen.\n“Oh, for fuck’s sake.” \nThat’s what Draco had said when the very same Healer came back with the initial test results that told them that Draco wasn’t sicking up all week because of a late season flu going around the Ministry (and by default, the press who slink about there). \nDraco says it again now because it’s equally appropriate. Harry has, once again, dragged him into one of those ‘only happens in late-night WWN stories’ circumstances.\n“Two,” Harry repeats, head tilted sideways. “What.” He can’t even quite make it into a question. That’s how gone he is.\nThe Healer points to some weird, squishy area and then to another weird, squishy area. “Girls.”\n“Is that what a vagina looks like?” Draco asks, leaning up on his elbows to get a closer look. “It’s so odd.”\n“You’re odd,” Harry says absently, and the Healer seems to agree. He twirls his wand and the hologram spins, and then, wow, fuck, there are two heads. Fortunately on two separate bodies. Then, “Have you really never seen one before?”\nDraco gives him a pointed side-eye. “I’m gay, idiot.”\nHarry shrugs. “Just thought you might’ve, I don’t know, experimented.”\n“I did,” Draco says. “With men.” He turns back to the Healer then and says, “I’m really disappointed here, Healer Gaelan. I told Potter if he wanted an heir he had to carry it himself and now you’re telling me that, yet again, he gets something for free just because he’s a lucky son of a witch.”\nHarry nods to confirm this when Healer Gaelan looks uncomfortably in his direction. “I used to fight against it, but now I just accept it.” He scoots his chair closer to the bed, and takes up Draco’s hand, interlacing their fingers. “Thanks for the freebie, babe.”\nDraco grunts and lets himself drop back against the bed. “My pleasure,” he grunts, sarcasm dripping from his voice. \nBy the time they get out of St Mungo’s, Harry happily staring at the little printout of their amoeba-like offspring swimming around in Draco’s belly, he feels like he could do anything.\n“I guess now’s as good a time as any to tell our families,” Draco says. \nExcept that. \nHe and Lucius are starting to develop this mutual loathing thing that’s really working for Harry. Harry still hasn’t salted any of the food he’s served at the Malfoys’, but he suspects that one day it’ll only be coated in a strong emetic and not professional grade arsenic. They’re getting somewhere comfortable, like they could spend a week-long holiday in the same country and probably both make it home alive afterwards.\nSo he’s not exactly keen on the fact that he’ll have to shortly tell the man that he’s knocked his son up. With twins. Of which both are girls. And Draco’s already said one can be a Potter.\nIt’s just that he values his life and would at least like to see his daughters born before their grandparents put a hit on him.\n\n-x-\nSo the following Saturday, Harry tells Molly he’s bringing a guest to the weekly Weasley Weekend Unwind, as Arthur likes to call it. Then he tells Draco that he’s going to be a guest at the Weasley Weekend Unwind. \n“Should I wear a tie?” Draco asks.\n“No, save it for tonight and our headboard,” Harry says. He tosses Draco a pair of jeans and a t-shirt that says Cuddly Chudley in bright orange script. Draco eyes it distastefully, but when Harry adds, “I’ll lube up and ride you for an hour if you wear it,” he slips it right on. Draco’s belly’s getting big quickly, but it’s not too big to fuck Harry yet. In public, it’s softened by the glamour he puts on when he’s going into work or the shops. It can’t cover all of it, but it makes it look like he’s just getting pudgy instead of carrying two additional humans.\nMolly’s not the least bit surprised when Harry shows up with Draco, which is unexpected. “Oh, hello there, dear. I wondered if we’d ever get to meet you. Ron tells me that you and Harry work together all the time.”\n“He tips me off on his corrupted superiors,” Draco confirms. “It’s a symbiotic relationship.”\n“What does Harry get out of it then?” Hermione asks, sipping a glass of red wine as she leans against the kitchen counter. Harry and Draco give her identical hunted looks, but she only says, “If it’s symbiotic, he’s getting something out of it, too.”\n“A headache, probably,” Ron says. “That’s what I always get when Malfoy or Bones shows up at my office.”\n“Draco’s really good at, er...” Fellatio? Backwards Cowgirl? Morning sex? \n“Painting,” Harry finally decides, sending Draco a confused look as though to say, ‘What is wrong with me, where do I get these ideas?’ “He’s helping me restore Grimmauld.”\n“Oh, that’s wonderful,” Hermione says. “Be sure to use a proper spell to get rid of all that lead paint. I worry about bringing Rose over. She’d probably eat the paint chips all over the floor.\nLead paint? Harry thinks, panicking. He can’t bring his daughters into a place full of lead paint, and they’re probably going to have to move there eventually because Draco’s flat’s just a studio. There’s no way four of them can live there together. Grimmauld’s got six bedrooms and a garden. It’s definitely the better idea but if there’s lead paint and, oh god, there’s probably asbestos in the fucking drywall or— \n“I’m glad to hear you’re finally settling down,” Molly says, startling Harry even further. Settling down? Do they know? “It’s not good for a young man to not have a place to put down roots.”\n“Oh, erm, yeah,” Harry says. \n“Malfoy you’re getting a bit chunky there, aren’t you?” Ron says. “Desk job’s not really working for you.”\nThis is a perfect time to say, ‘Actually, Draco’s pregnant,’ and Draco seems to think so, too, judging by the look he’s giving Harry. Harry blinks quickly, still thinking of all the potential carcinogens in the only house they own between the two of them that isn’t a studio or inhabited by Malfoys. He says nothing.\n“Ronald!” Molly says, at the same time as Hermione smacks the back of his head. Draco delivers a scathing, yet still somehow polite enough for a Weasley Weekend, rejoinder and life continues apace. \nHarry doesn’t know where the time goes. He eats mechanically, only half paying attention to the taste of his food or the happy conversation going on around him. By the time everyone’s heading for the Floo and Draco’s eyes are drooping from exhaustion, Harry still hasn’t said anything about his new membership into the Dad Club. \nBut Merlin, the lead paint. He’s gotta fix that shit.\n\n-x-\n“Are you nesting?”\n“What?” Harry says.\nDraco walks further into the drawing room, being careful to avoid splatters of paint on the carpeting, which Harry had not bothered to cover since he’s just going to rip it up. In fact, maybe he should’ve ripped it up first, except then he’d have had to cover the hardwood floors. Whatever. \n“You,” Draco says, grinning. “You’re nesting. You’re not even the pregnant one.”\n“What’s nesting? Like a bird? I’m not a bird.”\n“Same thing,” Draco says. “You really want us all to live here when they’re born?”\nThis feels like an important moment. Harry slowly bends down to set his paint roller on the tray before standing again. “Do you want to?” Harry asks.\nDraco rolls his eyes. “I was going to start looking for a new flat next week. I’ve already contacted my estate agent about putting mine on the market, but really, there’re so few decent places in the city, and I refuse to live outside of London again. My parents are welcome to their idyllic pastoral retirements, but I’ve spent enough time in Wiltshire.”\n“Grimmauld’s in London,” Harry says.\n“Obviously,” Draco says. “But we’ve never really talked about what we’re going to do now that, well.”\n“Yeah,” Harry says. “I know.” They stare at one another for a moment past intimate and Harry gets this feeling in the pit of his stomach that he often does when Draco looks at him intently. \n“Last night was the first night you haven’t slept at my place in two months,” Draco says. \n“It sucked,” Harry says. “I couldn’t sleep without you. I’ve been painting for about eighteen hours. Before that, I was Banishing lead paint from the house. Did you know that getting rid of lead paint requires a special regulation Banishment spell? It has to go to specific containment centres or the Ministry’ll fine you like a thousand galleons for public endangerment. And there were two Boggarts in the upstairs Floo—no wonder it hasn’t worked in years, and—”\n“Harry,” Draco says. \nHarry stops rambling. “Yeah?”\n“I was thinking that maybe we should try this thing without the breaks in between the shagging. I thought you were thinking the same thing, but then you didn’t come home last night, and…Was I wrong?”\nHome. Harry swallows. “You weren’t wrong,” he says. \nA beat passes, and then Draco smiles at him. That little secret smile he saves for Harry because the rest of the world gets his Bitch Battalion sneer instead. Harry’s breath leaves his lungs in a great whoosh, leaving his legs wobbly and his head dazed. God, he loves that smile. He takes two decisive steps forwards and bends to wrap his arms around Draco’s thighs, ignoring his squawking at the paint all over his robes. He lifts Draco up and carries him up the stairs to the bedroom he hasn’t slept in in six weeks. \n“God, you’re heavy,” Harry mutters at the tenth step.\n“Fuck you,” Draco says before bending to kiss Harry. They wobble on the steps briefly, not because Draco’s heavy but because he makes Harry’s legs weak. Harry groans into the kiss and takes them the rest of the way up. He didn’t come home last night not because he wasn’t at Draco’s flat, but because he wasn’t with Draco. It doesn’t matter where they live, it just matters that they live together.\n\n-x-\nAnd now Draco is kicking him out. Of his own house. Well, it’s sort of theirs since Harry’s added him to the deed, but really. He was here first. \n“I mean it!” Draco says, face a blotchy red. It’s strangely endearing; reminds Harry of the flush he gets when he’s about to come, only this time he’s been crying. “Get out.”\n“But, babe,” Harry says, “Come on. I didn’t mean to. It was an accident.”\nDraco sniffs. “Intention is irrelevant. You destroyed it. Destroyed us.”\nThat’s taking it a bit far, in Harry’s estimation. It’s on the tip of his tongue to say ‘It was just a sodding shirt,’ but of course he’s smarter than that. Barely. “I thought it was just reds you couldn’t wash with other things,” he tries.\nDraco snarls at him and throws the formerly white (now orange) shirt at Harry. It hits his face and flops to the floor. “Orange is a derivative of red, you fuckwit!”\nHarry groans, Merlin fuck it makes him hot when Draco uses toffy words in the same sentence as swears. He can feel himself hardening and would really love nothing more than to pull both their cocks out, summon a tubful of olive oil from the kitchen, and just rub their bodies together endlessly, or at least until they’ve come three or four times. He likes the feel of Draco’s belly between them nearly as much as he liked the firm flatness it’d been before. Actually, maybe he likes it just as much, now that he thinks about it. Maybe he—\n“Potter,” Draco snarls, and Harry realises he’s unconsciously taken several steps forward and started grinding his dick against Draco’s hip. \n“I’ll buy you three of them,” Harry says. Draco sniffs. “And I’ll toss the Chudley Cannons shirt,” he adds enticingly. Draco relaxes a little bit.\n“Can I burn it instead?” he asks, sniffling.\nHarry nuzzles his nose into Draco’s neck, inhaling the delicious masculine scent of him. “Yeah, babe. Anything you want. Just come down to the kitchen with me.”\n“Why?” Draco asks suspiciously.\nHarry grabs his hand and begins tugging him towards the basement stairs. “Olive oil,” he says. “And that big table,” he adds, piecing together a plan even as they begin to descend. “And then you naked for the next three or four hours. Maybe more.”\nDraco snorts, but by his decreased resistance, Harry can tell he’s intrigued by the idea. Good. After three years, he’s finally learned how to appease an overset Draco. He really has no idea what he’ll do about toddler tantrums, but they certainly won’t be resolved anything like what he’s about to do to his man. He wrinkles his nose at the unintended thought. Gross.\n\n-x-\nThey’re in a press conference at the Ministry when Harry sees him clutch his stomach and stagger against a wall. Harry’s down from the podium and at Draco’s side so quickly he’s not entirely convinced he didn’t Apparate.\n“What is it?” he whispers quickly. “What’s wrong?”\nDraco grimaces. He falls against Harry, letting Harry support his weight, and at that point, Harry knows there’s no way this can’t be an emergency. The Bitch Battalion do not show weakness in public.\n“Oh, fuck,” Harry says, reasonably panicking. “Fuck fuck fuck, oh Merlin fuck me.”\n“No,” Draco says, panting. “Only—I—fuck you.”\nIt’s not loud, but they’ve got so much attention on them now that Harry knows the few gasps that rise up near them have heard correctly. Draco’s glamour’s starting to fail, his belly shimmering like a mirage in front of the illusion it usually is in public, but Harry really could not give even half a fuck at this point. He bends to slide his arms under Draco’s back and thighs, lifts him up, and sprints for the Floos like his life depends on it. Because it does. The man he—\n\nFuck—\n\nThe man he loves is going into labour two weeks early and Harry will not let anything happen to him or their daughters.\n\n-x-\n“I hate you,” Draco grits out.\n“Calm down,” Harry soothes, brushing his hand over Draco’s forehead. \n“You—first—loser,” Draco growls at him between pants. His contractions are coming really quickly now, much more quickly than Harry’s given to understand happens for Muggles. Healer Gaelan is standing over the bed, running diagnostics entirely too slowly. \n“They’re early but well-developed. I’m confident that if we deliver now both babies will be perfectly fine. Early labour’s not uncommon in male pregnancies. We’ll begin the extraction in, oh, about twenty minutes,” Healer Gaelan says, entirely unmoved by Draco’s death glare. \nHarry, on the other hand, is very much moved by it. He grabs the front of Healer Gaelan’s robes, jerks him forward, and hisses, “You will begin the extraction now or I will destroy you.”\nHealer Gaelan nods once, shoots a shaky Patronus into the corridor behind them, and a dozen Mediwizards and Mediwitches rush in. Harry gives Gaelan a final warning glance, and then returns to his post beside Draco, to stoically suffer the systematic crushing of each of his metacarpals.\n\n-x-\nGrudgingly, Draco agrees that they can each name their own heir. They look just alike—both with blonde hair and indeterminate eye colour—so there’s no point in picking based on familial resemblance. Draco claims the one that came out first, but he can’t stop staring at either of them. Neither can Harry, really.\nHarry smiles down at Twin Two. “Lily James Potter,” he decides.\n“Oh, for fuck’s sake,” Draco says, slumping back against the bed. “She’s just a child. She doesn’t need to be saddled with all of your baggage. She hasn’t done anything to deserve it yet. Save this emotional guilt trip for when she’s coming home from sixth year engaged to a Hufflepuff.”\n“We can call her LJ,” Harry adds, unmoved.\nDraco glares at him, and then, slowly, smirks. “Fine. Then mine’ll be Narcissa Lucius Malfoy.”\nHarry gapes. “That’s not fair! Your dad’s a murderous arsehole with a rap sheet and those names don’t even flow well. It’s too many syllables!” \n“We can call her Narcius or maybe Lucissa. Which do you like better?”\n“I like the one not related at all to your parents better.”\n“Salazina?” Draco asks innocently.\n“Godrica?” Harry counters, eyebrows raised.\n“Why don’t you give them names that won’t get them beat up?” a voice suggests from the doorway, and they both freeze. \nHarry watches Draco’s eyes widen, his body stiffen, and slowly, Harry turns towards the door of Draco’s room. He feels his face drain of blood. Ron is there, eyebrows still raised in query after his suggestion, and next to him, Hermione has Rose, who is sucking fiercely on a dummy, propped on one hip. But, even worse, behind them stand the Malfoys, who look too shocked to even speak.\nHermione is the first one to recover. “Oh, Harry,” she says, handing Rose off to Ron and gliding forward into the room. \nShe bends down and wraps her arms around him. Still bemused, terrified, and startled, Harry hugs her back on autopilot. He hears her sniff and then feels little drops of wetness hit his neck. He wrinkles his nose. Just then, Ron sets Rose on the cosy chair by the door and steps forward to intercept. Because he is an amazing best mate.\n“Herm, let the man breathe,” he says. “He’s just become a dad.”\n“I know!” Hermione wails, and hugs Harry even harder before launching herself off him and bending over the bed to—carefully—hug Draco as well. Draco stares at Harry in horror over her head, awkwardly patting her on the back and trying to keep Twin One from getting a face full of hair in the meantime. \nFinally, she stands again. “Why didn’t you tell us?” she says, sniffling. \n“Yeah, really,” Ron adds. “What the fuck, Harry? How come I had to hear it from Dawlish that you and Gitfoy’d Floo’d off to St Mungo’s in a panic?”\n“And why,” Lucius finally grits out, his voice low and menacing, “did your mother and I have to learn from the fuc—damned Family Tapestry that you have an heir?”\n“Oh, shit,” Draco says faintly. He turns to Harry, grimacing. “I forgot an alarm sounded whenever there’s a new Malfoy.”\n“We were going to tell you,” Harry says. Draco shoots him a sharp glare. “Honestly,” Harry says. “We had a bet and everything. I lost, by the way, so I was supposed to say something every time we came over for dinner but I…” he trails off, shrugging.\n“Chickened out,” Draco supplies.\nHarry tosses a glare over his shoulder at him. “You would’ve, too, Slytherin.” \nDraco shrugs in response, bringing Twin One up to his chest and holding her tightly. Twin Two starts making tiny little baby whimpers and Harry then proceeds to ignore everyone else in the room so he can properly freak out. \n“Healer, help!” he calls and a Mediwitch rushes into the room, wand out. “Something’s wrong!” Harry says. “She’s in pain or something.”\nThe Mediwitch takes Twin Two from him and then rolls her eyes. “She’s hungry, Mr Potter. I’ll send a Mediwitch in with formula to teach you both how to feed them.”\nWhen she leaves again, Ron snickers. Harry sends him a dark look but it only makes Ron laugh harder. “See if I make you godfather,” Harry says.\nRon shakes his head, still grinning. \n“What will you name them?” Narcissa asks then. She pauses delicately. “I do hope not Narcius, darling,” she adds to Draco. \n“Or Lucissa,” Lucius adds, looking close to vomiting. \nDraco shrugs. “We should probably think about it for a week or so. Baby Malfoy’s good for now.” He looks between the two of them and then shrugs. “Actually, we’ll probably get them confused before we even leave the hospital so we could just stick to One of Two Daughters for the both of them until we work out and identification method.”\n“Mum’s convinced that the baby that she originally named George ended up being called Fred his entire life,” Ron adds.\nHermione laughs. “I’m sure they had something to do with that.” Then, “Why don’t you just put a bracelet on them that says Baby Malfoy and Baby Potter?”\n“So obvious and yet so effective,” Harry muses. He taps his wand to Two of Two’s wrist and a bracelet materialises declaring the same. He repeats it on One of Two. Draco sends him that smile, that same smile he’s never used in public before. Harry melts so hard that he’s almost afraid of dropping Baby Potter. \nWhen he’s aware of the world outside of Draco and his daughters again, he realises that the room’s cleared out, and it’s just the four of them again. Draco moves over, silently offering half of the hospital bed for Harry and Baby Potter. Carefully, Harry manoeuvers himself up, wary of jostling either of their babies. It’s amazing how those strange amoebas turned into these. (Secretly, Harry hopes one of them ends up a Hufflepuff, just to annoy Draco. )\nDraco lays his head on Harry’s shoulder and closes his eyes, exhausted. When the Mediwitch returns with two bottles full of formula, he opens them again to feed Baby Malfoy. Harry likes the feel of his head on Harry’s shoulder as their daughters eat on their chests. He likes the feel of being a dad. He likes the feel of doing it with Draco.\n“I love you, you know,” he says quietly. \nHe feels Draco stiffen for just a second. “I,” Draco says, and for a moment, Harry’s terrified he’s not going to say anything in return. \nBut they’ve been together for three sodding years. Even the breaks in between never had anyone else, not for Harry, and he’s almost positive not for Draco. They were formality breaks. To declare that they “weren’t serious”. Which was bollocks. Part of him thinks he even knew that back then, in the first year. Whether enemies, friends, or lovers, he and Draco have never been “not serious”. They’ve always done everything to the max. \n“I love you, too,” Draco finally says.\n“I love that we did this together,” Harry adds, his heart swelling. “I wouldn’t want it with anyone else.”\n“Fuck, Harry,” Draco whispers after a moment. There’s a telltale hitch in his breath. “My hormones are still fucked up. You can’t say shit like that. You have to stop being so amazing.”\nHarry smirks, reaches out to run his fingers through Baby Potter’s blonde hair. “You first, loser.”\n\nTHE END."
}