{
    "id": "1799623",
    "url": "https://archiveofourown.org/works/1799623?view_full_work=true",
    "author": [
        "dropdeaddream",
        "WhatAreFears"
    ],
    "title": "A Long Winter",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "Captain America (Movies)",
        "The Avengers (Marvel Movies)"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Steve Rogers",
        "Peggy Carter/Steve Rogers"
    ],
    "characters": [
        "Steve Rogers",
        "Peggy Carter",
        "Howard Stark",
        "James \"Bucky\" Barnes",
        "Jim Morita",
        "Timothy \"Dum Dum\" Dugan",
        "Historical Character(s)",
        "Tony Stark"
    ],
    "additional_tags": [
        "Steve Rogers: The Bisexual America Deserves",
        "Cold War",
        "September 11 Attacks"
    ],
    "language": "English",
    "series": "Part 1 of Not Easily Conquered",
    "published": "2014-06-17",
    "completed": "2014-06-17",
    "words": "35,754",
    "chapters": "2/2",
    "comments": "1,160",
    "kudos": "15,342",
    "bookmarks": "5,089",
    "hits": "437,548",
    "summary": "<p>In 1945, Steve Rogers jumps from a nosediving plane and swims through miles of Arctic Ocean to a frozen shore.</p>\n<p>In 1947, Steve Rogers marries Peggy Carter. </p>\n<p>In 1966, the New York Times finds the lost letters of Sergeant James Buchanan Barnes.</p>\n<p>So because we had a lot of fun researching this fic, and had a lot of notes on it, we decided to include them. Sorry this isn't a sequel or something.</p>",
    "notes": "<p>This fic was a total ball for us to write. Expect two more installments: a second chapter which will be a functioning annotated bibliography with our research and some cool historical facts, and the next an extension, detailing the contents of Bucky's other ten letters to Steve.</p>\n<p>Translation to Vietnamese here: http://archiveofourown.org/works/4653102/chapters/10613871</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Here are the research notes, as promised. If you detect any errors in it, let us know. We strive for accuracy whenever possible and we don't pretend to be infallible.</p>",
    "text": "Come join us on tumblr! we are emily and ellen. For more of this series, check out our Not Easily Conquered tag and our tag for fanworks inspired by this one.\n \n \n \n \nAnd Lot’s wife, of course, was told not to look back where all the people and their homes had been. But she did look back, and I love her for that, because it was so human. \nSo she was turned into a pillar of salt. \nSo it goes.\n \n—Slaughterhouse-Five\nKurt Vonnegut \n \n\n1947\n\n\nNew York, June 17. — Captain America: wed! Steven Rogers, our bravest American hero, was married this last Sunday, the sixteenth of June, at Saint Patrick’s Cathedral in his own native New York, New York. The lucky lady? Cap’s wartime sweetheart, a British correspondent from the Strategic Scientific Reserve. The ceremony was a private affair with only close friends and family in attendance. From here at the Times, we personally wish the Captain and Mrs. Rogers all the best of wedded bliss. \n\n\n(Welch, Jonathan. “A Happy Ending!” The New York Times 2 Feb. 1947. Print.)\n\n \n \n\n1954\n\nThe wind is cold enough to burn as it hits Steve’s cheeks. His own red fingertips reach out, down. Bucky’s hand strains up, up.  \n“Stevie,” says Buck, entreatingly. It doesn’t matter how far he stretches; Steve cannot reach him. Helpless, he watches as blue frost creeps up Bucky’s white throat like spreading ivy. Just when Steve thinks he can grab him, winter’s long fingers lick down Bucky’s arm to freeze his hand a millimeter too far away. If Steve were to touch him now, he knows that Buck would shatter into a million frozen pieces, and then he’d scatter, forgotten, into the howling wind. \n“Stevie,” Bucky repeats, his fingers so close to Steve’s, “Wake up. Wake up.” \n“Wake up!” says Peggy, and Steve jolts upright, gasping. He thrashes for a second, legs tangled in the bedsheets, and grips blindly at a small arm. His heart pounds thunderously in his ears and limbs and he thinks for a terrified moment that the thudding is a train speeding up to meet him. \n“Buck?” he asks, confused and hopeful.\n“No, Steve, it’s me, it’s Peggy,” she says, hushing him. Carefully she pries his fingers off her arm with small, strong hands, one by one, until he’s left clenching his fist around nothing. “Steve, look at me. You were dreaming. It wasn’t real.” \n“Pegs.” Steve blinks heavily. It is her. Bucky’s eyes, a terrible, dead blue, begin to fade in favor of Peggy’s face. “Pegs,” he repeats, relief flooding through him.\n“You haven’t had one that bad in a while,” Peggy murmurs.\n“Sorry,” says Steve hoarsely. He tucks his face into her hair and breathes in deeply. “Jesus, I’m sorry. Do you think I woke Kat?”\nYou weren’t so loud,” Peggy assures him. “I only woke because you were tossing and turning.” \nSteve pulls back. “Did I hurt you? Peggy?” \n“Hush,” says Peggy. “No. No, Steve. Now go to sleep.” \nShe maneuvers them easily into a familiar position: curled opposite each other, perfectly mismatched parentheses. Steve buries his nose into the hollow of her throat. Peggy tucks his head under her chin and holds onto him. Their toes press together, and Steve warms up.\nWhen he wakes again his elbow is thrown over his eyes to keep out the sunlight. The nightmare comes rushing back and he jerks into consciousness, sitting up, his heart beating too fast. The bed is empty. He looks around for a second, panic curling in his throat, and then realizes that Peggy is only in the bathroom. So he settles, watching with renewed sleepiness as she finishes fixing herself up in the mirror. Not, Steve thinks, that she needs to at all. Styles have changed, which is why Steve figures she leaves the red tube of lipstick unopened as often as not anymore. Steve doesn’t care, seeing as it makes it easier to kiss her whenever he likes without having to worry about little red stains.\nPeggy turns back into the bedroom and, upon noticing that Steve is awake, grins. \n“Oh, don’t lay there looking at me like that,” she chastises. “You know all I want to do is climb back into bed.” \nSteve flushes all over and raises an eyebrow. “Oh yeah?” \nPeggy looks at him for a moment with bright eyes. “Come zip me up,” she decides after a moment. Obediently Steve stands and crosses the room to her. He brushes her hair carefully over her shoulder so as not to disturb the fresh curls and tugs up the little hidden metal zipper. The dress is the one Howard gifted her with for her birthday. It’s a heavy winter fabric in a deep burgundy that flares out at the waist. Howard, thinks Steve, has good taste. Steve presses an affectionate kiss to Peggy’s temple as he steps away. \nDownstairs he fries up some eggs and makes toast and coffee while Peggy wakes up Kat and wrestles all that hair into a braid. Kat gets down first and kicks her little legs back and forth while she sits on her hands, waiting impatiently for breakfast. Peggy shows just as Steve is dishing them up and settles down at the table to flip through her miles and miles of paperwork. \n“Thank you, sir,” Kat says very primly when Steve sets her plate in front of her, the toast cut neatly on the diagonal. \n“You’re welcome, ma’am,” replies Steve formally. He shoots a smile up at Peggy but she doesn’t see, caught up in her SHIELD reports as she is.\n“Daddy,” says Kat after a moment of thoughtful chewing, “Why were you shouting last night?” \nSteve, his coffee mug halfway to his mouth, freezes. \n“You must have been dreaming, darling. Daddy wasn’t shouting at all,” covers Peggy lightly. She stands, then, and Steve, still frozen solid, listens to her shoes click against the tile. She kisses Kat with a smack on the cheek to make her giggle, and then presses her mouth to Steve’s. Her face an inch from his, she says, “I’ve left a file for you.” \nSteve watches as Peggy walks out the door and listens to the car start in the driveway. Then he gathers himself up and turns to look at the clock. \n“Alright, miss,” he says. “Time to get you to school.” \nTwenty minutes later, pleased that Kat isn’t too old yet to still hug him goodbye at the bus stop, Steve finds the file Peggy was talking about. It sits innocuous and unlabeled on the coffee table in the den. \nIt isn’t very thick. Steve knows what a thin intelligence file means, and it isn’t anything good. \nPeggy gets home at nine, even later than usual, and goes upstairs to kiss Kat goodnight though she’s already in bed. When Peggy comes back down, she stays silent as she pours herself a brandy and sits across the kitchen table from Steve, who is still reading and re-reading the file, his coffee gone cold and sludgy by his elbow. \nHe finishes skimming over the last page again and sets it down. Peggy, her glass in hand, kicks off her heels and sips her drink, looking across at him with the cool and patient stare he recognizes from the war. \n“I don’t speak enough Russian to read this one,” Steve finally says, sifting through the papers until he finds the page. “I can recognize a couple words so I think I got the gist of it, but I wanted to be sure.” \nPeggy glances over the report and hears precisely what Steve didn’t say: that he wants to be proven wrong and told he read it incorrectly. His hope flickers out as her mouth purses into a thin line. “They’re taking children,” she affirms. \nSteve wonders at the logistics of an operation like this. Are the kids being plucked out of their homes in the dead of night, their screaming parents shot, or bound and gagged? Or are they instead made to sign release forms, understanding that their children will be serving the USSR to the best of their ability? Are they proud? What do they say to the neighbors when they ask? \nPeggy pushes the report back to Steve. “Officially, in the eyes of the USSR, this organization does not exist. It’s one of the most deeply buried special ops projects I’ve ever seen; we weren’t even sure it was real until last week. In the grand scheme it’s an astoundingly small operation, with, by my estimate, a maximum of one hundred people directly involved, less of whom are entirely or even partially informed. I doubt we would have even come to know of it if it hadn’t been for Howard’s informant in Chukotskiy.” \nThat wasn’t in the file at all. “Chukotskiy?” Steve asks. “That’s a wasteland. The only thing that far north is frozen tundra.”\nPeggy shakes her head. “That’s what I thought. That’s what we all thought. But…”\nShe meets Steve’s gaze. They both know that she shouldn’t be telling him this, but it’s never stopped them before, and it doesn’t stop them now. \n“But we believe it to be their base of operations,” Peggy finishes. “Or, at the very least, some type of training ground. We can’t get close enough to know for sure. And, as you can probably imagine, it isn’t just children.” \n“They train adults too?” \n“One in particular has come to our attention.” She reaches into her briefcase, propped against a table leg, and clicks it open. She fishes around inside it for a moment, her red lacquered nails glinting in the dim light. She then procures a long sheet of paper all in Russian that across the middle reads ПРОЕКТ: ЗИМНИЙ ВОИН in huge black lettering. It is very clearly an Electrofax copy of a manilla envelope. He can read the first two words, but after digging around for a moment in his memory realizes that he has never before seen the last one.\n“Proyekt Zímnij Voin,” Peggy pronounces, pushing it across to him. Her accent is flawless; Steve didn’t even know she was learning Russian. He chews on his thumbnail as he examines it. “The last word translates directly to ‘warrior’ or ‘berserker,’ but our linguists say that colloquially to the region, it may simply mean ‘soldier.’” \n“I don’t like the sound of any of the above,” Steve mutters. \n“This is the first shred of evidence anyone has found that the Winter Soldier Project is more than an urban legend. We’ve been keeping our eyes open for a very, very long time,” confesses Peggy.\nSteve glances up at her. “How long is very long?” \n“I was first made aware of it in ’48.”\nSteve is thrown, though he knows he shouldn’t be; of course operations happen without his knowledge. If Stark and Peggy are pursuing this then it isn’t something to be taken lightly. That aside, though — \n“Why are you telling me about all this?” Peggy has asked for Steve’s advice on SHIELD projects in the past, but not often, seeing as she is more than capable, and far surpasses Steve in espionage besides. There is something more here, Steve thinks. There is something that Peggy feels she and the SHIELD cannot deal with completely on their own. \nShe is, Steve realizes, scared. \n“We’ve had several agents who have reason to believe that we should…investigate the death of Joseph Stalin,” Peggy says. She is choosing her words very carefully now. \n“Stalin,” parrots Steve, a cold and dreadful feeling settling like a stone in his stomach. It spindles icily up his spine. “Stalin died of a brain hemorrhage, Peggy.” \nUnblinking, Peggy agrees, “That’s certainly what the papers said.” \n—\nSteve has been on leave for seven years, starting a few months after Kat was born, when Stark started getting twitchy about calling Peggy back to work. Since then, Steve has been informed by at least ten politicians in the United States, Howard Stark, and SHIELD itself that this is a war of intelligence and technology, Rogers, and not one of brute force. It has been made abundantly clear that there is no place for him in this fight. \nBut, figures Steve, there wasn’t a place for him in his last fight, either, and it’s not like that ever stopped him. \nSteve is made to set up an interview with SHIELD in order to be cleared again for active duty. The building has changed since he was last here and now it has Stark’s name all over it, its spire reaching high into the DC skyline, its millions of windows dizzyingly reflecting the blue sky and white clouds above it. The place buzzes with men in smart black suits, sporting ties that probably cost a prettier penny than Steve’s leather shoes. Steve has to stop to consult a receptionist twice but finally ends up finding his way through the winding corridors to his interview room. \nThere are two agents waiting for him: a young woman with a recording device and some kind of a very small typewriter, and a young man who keeps apologizing for having to hook Captain America up to a polygraph machine. They introduce themselves as Agents Sanchez and Lee. \n“It’s really only procedure, sir,” Lee says.\n“Of course,” Steve reassures, for what he estimates to be the hundred and fifty-first time. “I wouldn’t want any less, son.” \nAgent Lee sits down across the table and pushes his wiry glasses up the bridge of his nose. His bony fingers fiddle with the switches on the machine for a moment before it shudders a bit and hums to life, its five little needles skittering across the reams of rolling paper beneath it. \n“Please state your name and date for the record,” says Lee. Steve does. “Please state your reason for contacting SHIELD.” \n“I want to be moved back to active duty.” \n“Please clarify, sir?” \nSteve isn’t entirely sure that there’s all that much to clarify, but tries his best anyway: “I’d like to be moved back to active duty in order to help with the war effort in any capacity that I can.” \nAgent Sanchez taps busily away at her device and cranes her neck to watch the needles scratching at the paper. Lee opens the file in front of him and scribbles down a couple notes. Steve doesn’t bother trying to read them and instead looks upside-down at his own identification photograph, printed and adhered to the page just under his name and date of birth. \nLee shifts for a moment before finally getting on with it. “Were your parents Joseph and Sarah Rogers?” \n“Yes,” confirms Steve.\n“And they immigrated to America in 1917, is that correct?” \n“Sure is,” says Steve.\n“Irish Catholic?” \n“Yes.” \n“To your knowledge, were they affiliated in any way with the Socialist Party of Ireland prior to or following their immigration?” \nSteve blinks. “I’m sorry,” he finally says, “Could you repeat that?” \nLee’s eyes, behind his glasses, flick nervously to Agent Sanchez. In turn she looks to Steve, her young face passive and impressively, entirely unreadable. Lee swallows thickly and forges ahead. \n“To your knowledge, were they —“ \n“No,” Steve interrupts, looking between them. “Sorry, no, I heard you fine. Are these questions procedure too?” \nLee is sweating. He sets his pen down like he’s afraid he’ll drop it otherwise, and Steve wouldn’t doubt it, considering the way that he’s shaking like a damn leaf. “Sir, uh, yes sir. A new mandate states that each potential or returning agent must undergo a complete background check, sir.” \nUnder Steve’s hands the plastic arms of his chair creak. He nods to the file. “And what other questions have you got in there?” \n“I’m supposed to review your voting record, sir, and the employers you worked for prior to your deployment,” says Lee. “And…” \nA tightness begins to ball up inside of Steve’s chest, an epicenter around which he thinks his heart is contracting. He recognizes the feeling as the same kind of anger that got the shit kicked out of him in a lot of Brooklyn parking lots. “And?” he prompts.\nLee looks like he’d rather face a goddamn firing squad than say the truth of it. Stiltedly, he confesses, “And I’m supposed to ask you about the nature of your relationship with Sergeant James Barnes of the 107th Division and the Howling Commandos, sir.” \nSteve is completely unaware that he is standing until he realizes that it must be the reason why Lee is no longer at eye level. There was a snapping sound when he moved; belatedly he figures out that it was the polygraph bands that Lee had hooked around his chest breaking. Blood rushes in his ears. “Can you tell me where Stark’s office is?” \nLee is scared shitless and can’t even speak. Steve sometimes still forgets he’s six feet and two hundred pounds of muscle now, and it isn’t Lee he’s mad at, anyway, not some green kid who’s only following orders; everyone has been there. He tries hard to soften the blow. “Son? Will you tell me where Stark’s office is?” \n“It’s on the top floor, Captain Rogers, and to the right,” Agent Sanchez replies instead, looking truly apologetic, but otherwise unruffled. \nOf course it is. “Thank you,” says Steve. He proceeds to yank the sensors off his right hand and rip the blood pressure cuff clean in half when he pulls it from his arm. Looking at the carnage of the machine, he nods to it and suggests, “Foot me the bill.” \nSteve jogs up eleven flights of stairs, having no desire to be enclosed in a metal box with a bunch of guys in monkey suits, but feels no better when he reaches the top of them. He walks right up to the door of what is obviously Stark’s penthouse office and takes a long minute to gather himself up and make sure his muscles are relaxed so that he won’t put a hole in the door when he tries to knock on it. It’s a really nice door and Steve has already broken government property once today. \nHe knocks. \n“Susan, I thought I said no —“ unheeding, Steve walks on into the office, and Stark’s voice tapers off. “ —appointments. So, you found my office.” \n“Kinda hard to miss, Howard,” Steve says. “Only takes up one entire floor.” \nHoward spreads his arms, spinning around to face Steve fully in his leather desk chair. Whatever fury Steve managed to work off by taking the stairs comes back full throttle. “Well, what brings you to my —“ \n“I want to know what the hell kind of interrogation I was just subjected to under the guise of an interview,” Steve snaps. \n“Cap, it’s just procedure,” Stark says, in that deliberately exasperated and placating way he has. “Did they ask you if you were a commie? We have to ask everyone if they’re a commie; blame it on McCarthy. Look, what was the name of the agent? I’ll just have him fired and we’ll call it a day.” \nSteve is horrified by that. It’s extravagant and cruel. “You’re not firing anyone. I just want to know why you’re treating potential employees like prisoners of war.” \n“Haven’t you heard? Red is the new black,” Stark replies. His tone is flippant, but he eyes Steve critically for a long, disconcerting moment. Abruptly, he stands and crosses the room to his drink tray, pouring two tumblers of something expensive and amber-colored. Steve takes a second to look around the office, which is truly huge and truly, really ostentatious, but probably also one of the most secure places in this building, which doesn’t reassure or impress Steve but instead disquiets him, making his stomach churn uncomfortably.\nStark offers him a drink. Steve shakes his head, and Stark shrugs, throwing it down himself. “So,” he says after a moment of measured silence, “Carter told you about the Red Room.” \nSteve remains quiet.\n“Okay, okay,” says Stark. “I get it; you won’t confirm or deny, the two of you are a well-oiled machine, etcetera. That’s fine. But Cap, you have been on active duty.” \n“No, I haven’t. In the last six years I’ve received two honorary promotions for nothing more than filling out a couple of forms. That damn well isn’t active duty and you know it,” Steve says, goggling. Stark laughs aloud, and the sound grates on Steve’s nerves sharply. \n“Uh, yeah,” he says, “You definitely have. What, you think that there’s such a thing as leave from SHIELD? And for — for Captain America? Steve, buddy, come on. If we’d needed you, we would have called you.” \nIt takes a moment for the implication of that statement to settle. When it does, it stings. \n“What about when I think you need me?” Steve asks. Stark remains silent. “If your informant is right — if we do have reason to believe that the Red Room was somehow involved in the cover-up of an assassination mandated by the government of the USSR itself —“ \nStark looks ready to relent. Steve thinks it’s mainly because he wants to cut short the impending lecture and quiet down Steve’s raising voice, a trick that Steve only learned to use after seeing Stark back right off of dames the second they start causing a scene. \n“If I can help, I should be helping,” finishes Steve firmly. He thinks of saying the same words to Bucky in a hundred different ways a lifetime ago, right from the second they sat huddled around their little flaking radio, their knees knocking together as they listened to the news of Pearl Harbor filter in through the static. \nBut Stark does not look at Steve with that familiar disapproving worry. Instead he appraises him openly, the way he looks at his machines, and then nods, once, and turns back to his desk to shuffle through papers. Steve, frankly, is sick of watching people shuffle through papers. “Fine,” Stark agrees. “You want active duty? I’ll give you one better. We’re running some recon for the CIA and VENONA down along the southern border of Leningrad. What do you say we warm you up with some field work?” Rapid-fire, he continues, “I’ve got a meeting in — right now. How about my people contact your wife who contacts you, huh?” \nStark makes a shooing motion just as his office phone starts to ring like it’ll fall off the hook if he doesn’t answer it right away. Steve, bewildered by this abrupt turn of events, shows himself out. \n—\nHe comes clean to Peggy a day later, who, it turns out, has already been contacted by Stark after all. \n“I didn’t actually want to get shipped off right away,” Steve explains over re-heated dinner once she’s home from work. She frowns at him as he frowns at his overdone pasta. He knows he shouldn’t cook nervous; his ma always promised that you could taste it in the food. Turns out she was right. \nPeggy tilts at him a wry smile, entirely and beautifully unconvinced. “Really,” she says.\n“If anything, it’s only for a couple days,” defends Steve mulishly, after a moment. “Are you sure that you and Kat will be —“ \n“God knows I’ve earned a three-day weekend,” Peggy cuts in. She reaches across the table to take his big hand in hers, their calloused palms fitting easily together, and adds, “There’s no point in being your own boss if you can’t take time off for your family when you need to.” \n“Well, when you put it like that,” Steve concedes, smiling. He threads his fingers through hers, and knows she loves him when she digs into the crispy alfredo without a single word.\nSo on Thursday evening Steve gives Kat a big kiss before bed, reads her an extra story, and promises to try his absolute best to be back in time for cartoons on Monday. Later in the dark of their front porch Steve presses his mouth to Peggy’s and spans her waist with his hands, feeling the thin, unyielding strength of her torso as she reaches up to tangle long fingers in his hair. She finishes kissing him and pulls away to smile softly. “Good luck, soldier,” she says, conspiratorially, before slipping back inside. \nA moment later Steve’s ride shows up, a nondescript black car that looks hugely ominous on their little suburban street. Steve slides into it, ready for debriefing. \nThe thermal uniform they’ve fitted him with is similarly nondescript and black, and tight enough that he can wear it under a regular suit without having to worry about constricted movement or even a disrupted line in the fabric of his pants. Steve is grateful for how warm it keeps him five minutes into the car ride. Repainted to a matte gray, his shield rests heavy and familiar in his lap. By 2100 he’s on one of Stark’s jets and headed across the ocean, squinting in the dim light of the plane at the files he’s been handed. Stark and Peggy want them investigating an abandoned meat packing plant in the Vinnitsky District; when Steve had looked up from his briefing to ask why, the CIA operative blinked down at him and deflected, “It may be a branch of a fledgling intelligence agency, sir.” \n“Might help if I knew what I was looking for,” Steve replied, friendly enough.\n“I have no other information, sir,” the operative had said. \nSo either the operative didn’t know, or — and Steve doesn’t know which is worse — Steve doesn’t have the clearance to be told. \nIt really is only recon. \nBut any help is good help, and Steve talks out a drop plan with his team — five junior agents, all men, all white, and all apparently born fully-formed on this Earth without the ability to crack a damn smile, Buck’s voice tells him, but Steve studiously brushes that one off as being unnecessarily mean — over the course of the long flight. He doesn’t even have to raise his voice because the engines in this jet are quieter than the devil. They’ll be in at around 0600, and have one hour to get to the location they should be observing. Steve wants to keep it simple: surround the facility from a distance, watch Agent Richardson’s six while he gets their photographs, and take shifts on surveillance for the next twenty four hours.\nThey’re right on schedule when they land in a big field of snow. Steve and his team shuck their civvies, keep their black SHIELD issue thermals, and pull on bulky white snow suits that rustle dangerously when they move. They pass around balaclavas that are a mottled grey and white. Steve’s fits snug and tight over his mouth and nose, trapping his breath in a little pocket. He straps the shield to his back, glad Stark, or whoever, included that capacity in the design.\nThe wind whips bitterly. They have half an hour to hump through until they reach their location; after the first ten minutes Steve’s eyes have gone dry and hurting and he imagines the other guys aren’t doing much better. They tuck their chins to their collars and have to nearly lift their knees to their chests to fight through the snow banked up against some of the icy wooden fences.\nThe team is quiet, not so much out of necessity — they are, pretty literally, in the middle of nowhere — but rather a sheer lack of things to discuss. If anything, the silence of a long trek is good and familiar. That last winter before VE Day, the Commandos were told to take on a stealth mission in occupied France, and it was balls freezing just like this, and Steve would have probably died on the spot if it hadn’t been for the serum. As it was, all he had to do was curl up on the ground head to foot with Bucky, and he was warm enough. \nThey were ambushed in the night while Falsworth was on watch. Bucky took a slug to the gut that, by some miracle, didn’t hit a single vital. He bled like a stuck pig for a heart-stopping ten minutes and scored permanent bite marks into the belt that Steve shoved between his teeth before Morita started digging out the bullet. They were behind enemy lines so he couldn’t scream without giving them away, and he didn’t; didn’t make a single sound other than panicked whimpers while Steve held him down. They echoed in Steve’s head like church bells anyway.\nHorrifically he didn’t pass out like Morita thought he would. Bucky was lucid the whole time, and Steve was afraid to even open his mouth and talk, that’s how close to the Nazi base they were, so when the bullet was finally out and Jim was threading the needle, Steve pressed his forehead to Buck’s, just for a second, just to keep him there, afraid still that something would go wrong and Bucky might leave him. \nMorita did a good job on the stitches, though, and it healed faster than it should have, all things considered. \nAfterwards, Gabe swore up and down that it had been the longest he’d gone without having to hear Dugan’s Chatty Cathy mouth run a mile a minute, and that just for that he’d take a cold-weather stealth mission over a good warm bed any day. Dugan had scowled and Bucky had laughed at them both, and Steve remembers to this day the rush of relief he felt when Bucky’s face didn’t contract in pain. \nBuck had hated the winter. He hated the rattle it put in Steve’s lungs, and he hated the graves he stayed out late digging when pneumonia took someone else in the neighborhood.\nThey approach a copse of trees now that tapers off and then, after some more walking, becomes a snow-brushed thicket. In the middle of it is the big ugly packing plant. It seems hollowed out and abandoned but still structurally sound, just as the briefing promised. Steve gives the signal and they split, O’Brien and Morrison to the west side of the factory and Fuller and Watkins to the east. Richardson watches the northern entrance, tucked under a tree so the camera stays intact; right by him there are tire treads just now being covered by snow. Steve watches his six and keeps an eye on the perimeter. They wait. \nIt comes from the snow.\nOne second Steve is shifting closer to the ground, haunched on the balls of his feet, and the next pain is exploding in the back of his neck. His vision flashes black. Snow burns his eyelids, soaking through the balaclava, and when he looks up a tall black figure is already on Richardson. \nA sickening crack echoes across the snowbanks. \nSteve gets up running, but the man he chases is fast. He is headed to the western entrance, straight across the front of the factory; O’Brien and Morrison open fire simultaneously, the bang-bang-bang of their handguns muffled by the wind. Their shots are going wide because of it. Steve sees a bright, tiny flash of silver, and then red arcs across the snow. Morrison clutches at his neck with a gloved hand and O’Brien keeps firing, desperate now, while Morrison bleeds out from his carotid, gasping wetly on the ground. \nAt closer range O’Brien’s bullets begin to connect. The man doesn’t falter. Something’s wrong. Steve pushes until his thighs burn and then throws his full weight onto the man’s back, expecting the momentum to take them both down. It doesn’t. With an odd whirring noise, Steve is flipped onto his back, the breath knocked out of him from the impact onto the ice beneath the snow. And just like that the man is up and running again, O’Brien shooting defensively. He runs out of bullets. Steve rolls to his feet and, the second before the man can reach out to snap O’Brien’s neck, hurls his shield with all his strength.\nThe man turns whip-fast and with a dull thunk of metal catches it one-handed. \nHe wears a mask that covers his mouth and jaw. Goggles shield his eyes, black, reflecting nothing. His short hair is dusted with snow. \nThen, aiming for Steve’s head, he hurls the shield back. Steve ducks reflexively and hears it connect into the trunk of a frozen tree behind him, almost cutting it clean in half. He knows with complete certainty that if he had tried to catch it it would have killed him. And then the man is on him, swinging his entire left arm into a punch aimed for Steve’s throat. Ballistic striking — next to nobody uses it. It’s a tough technique to master, but Steve knows it too. He blocks, and connects shockingly with something hard that isn’t flesh. While Steve grunts in surprise, the man takes the split second to drive his right fist into Steve’s ribs. Steve kicks him hard in the kneecaps and he’s down but then up, lightning-fast. He punches at Steve again, spins and lands a solid kick to the ribs that hurts bad enough to bruise. He aims another kick, and another, and Steve jumps back, ducks low, the man’s boot grazing the side of his ear. Two sharp punches are aimed for Steve’s head and he deflects them, dancing back, on the defensive. \nSurprising him, Steve crouches low and flips the man over his shoulder and into the snow. He’s heavier than Steve expected, and with that whirring sound again a hand shoots up to pull Steve beside him, a leg catching him unexpectedly behind the knees. They grapple, and the man closes his hand around Steve’s throat, too strong, his knees bracketing Steve’s thighs. Steve knees him in the kidneys, and when he curls up, kicks him hard enough he thinks it’ll throw him off. But it doesn’t, and he lands on top of the man instead, looking into those sightless goggles. He tries to pin the man’s hands into the snow, succeeds finally, and in desperation pulls back and cracks their skulls together. The move would have knocked anyone else out cold, especially after hitting the hard ice. It doesn’t. The man shakes his head like a dog and frees his left arm enough to tuck it between their bodies, bucking upwards and stabbing his elbow into Steve’s solar plexus so hard the breath rushes out of him. As he gasps the man hooks his ankles high on Steve’s back, and then he twists, quick, and suddenly two strong thighs are crushing Steve’s neck, muffling his hearing, flexed hard around his head. Steve gasps, his lungs failing to catch up just the way they used to. His fingers scramble along the man’s legs, finding nothing but slick fabric, unable to gain purchase. He twists but can’t budge. Steve’s vision starts to white out and he grasps desperately at the man’s waistline.\nHe finds a knife.\nSteve rocks forward with all the strength he has left and draws it from the man’s belt. He stabs him soundly in the top of his thigh, and the man yelps, sharp and pained, and Steve somersaults over and off of him. Blood is smearing through the snow. Steve thinks he hit the artery. The man clutches his leg in pain, curling in on himself. Steve has an easy shot from here. He steps closer, raising the little knife. And then like a flash, right when Steve’s in range, the man uncurls and throws one of his own. Pain zips from Steve’s forearm up. He grits his teeth and can’t help but yell when he yanks out the blade.\nThe man staggers to his feet. He taps his ear and reports something, voice unwavering, in Russian. Steve waits. Over the man’s shoulder, maybe a yard away, Agent Fuller has a clear shot. Steve nods sharply. \nEverything happens in quick succession. The bullet rings out, the Soviet ducks, and Steve has barely crouched when he feels it rush just over the top of his head. The man spins and throws the knife in his hand with unerring accuracy: it hits Fuller between the eyes, and like Richardson, he’s dead before he hits the ground.\nThen the Soviet takes off at a breakneck run toward the factory. Steve hurls the knife at him, but his wrist is weaker than it should be and it misses the man’s back, going half an inch wide. The man does something to the door and breaks in, disappearing inside. \nSteve makes a judgement call, and instead of giving chase runs back to the surviving three of his team. He falls to his knees in the snow and takes over from O’Brien, pressing his hand to Morrison’s neck in a belated, last-ditch attempt to stem the bleeding. He listens as Watkins, his voice shaking, calls it in. There’s no trace of the Soviet left. The wind screams.\n \n \n \n\n1962\n\n\n…Another guest of note spotted at the White House Correspondents’ Association Dinner was  Colonel Rogers, pictured above, with the lovely Mrs. Rogers on his arm. After President Kennedy greeted the couple, Colonel Rogers spent the majority of the evening speaking with longtime friend Howard Stark…\n\n\n(Brooks, Kelly. \"A Night At The White House.\" The Washington Post 28 Feb. 1962. Print.)\n\n--\n“And do you agree with that, Colonel Rogers?” \nSteve shifts in his dress uniform, hugely uncomfortable at these events, as always. When he hears his name he snaps back to attention, searching in his memory for the thread of conversation. “Absolutely,” he replies. He abruptly feels again the annoyance he had managed to shake off a second ago. “I’m all for safety in schools, Congressman. But I’m just not entirely sure how hiding under a desk will save my daughter’s life in the event of a nuclear attack.” \nHe’s met with a kind of gobsmacked silence. Steve looks past Ervin’s shoulder in the hopes of catching Peggy’s eye, but she’s speaking quietly and intently across the crowded ballroom with Howard Stark and John Dulles, the Secretary of State.\n“The duck and cover films are about reassurance and safety, Colonel,” says Vice President Johnson. His tone is almost stern and certainly impatient. Steve is pretty sure it’s actually about politics and placation, and is opening his mouth to say just that when a hand claps down hard on his shoulder.\n“Jokester, isn’t he?” asks Stark’s voice. “That’s fatherly instinct for you. His baby girl is his entire world. Give us a minute, boys?” \nStark steers Steve out towards the balcony doors just as Julie London steps up to the microphone to sing. There is a smattering of applause before the piano starts to play. Steve shakes Stark’s hand off the moment they’re far enough away from the crowd. It’s so cold out that the balcony is empty, snow dusting the rails and the White House lawn. He rounds on Stark the second the doors close behind them. \n“The hell was that?” Steve demands.\nThe sleazy smile Stark was wearing inside drops instantly off his face. He tugs irritably at the cuffs of his tuxedo and brushes snow off his arms. “You’re a national icon, pal,” says Stark,  “And we’re at the biggest White House gala of the year. You can’t just go around saying shit like that. Look, I’m all for speaking your mind, but save it for the board room, will you? Jesus Christ.” \n“You know, Stark, it amazes me how little you seem to care about the fact that your own country is facing a threat from a bomb you created,” Steve snaps, thoroughly fed up. \n“Aw, Rogers,” Stark demurs, clutching sarcastically at his heart, “It’s sweet how you give me all the credit.” \n“Is nothing serious to you?” Steve asks, truly wondering. This horrible limbo they’re living in reminds Steve of that blurred time in his memory of the weeks before the carnage at Pearl Harbor. Nobody knew what was coming, but there was something terrible in the air all the same.\nStark fishes in his pocket and after a moment lights up a cigarette. Its cherry ember glows brightly in darkness. “Sure I take things seriously. You have any idea how much money I donated tonight? Talk about a dent.” \nSteve, by some incredible miracle, manages not to sock him in the jaw. “Do you have any idea what will happen if we keep telling our kids that the best way to deal with a nuclear attack is to bury your head in the sand? The potential for damage is enormous, not to mention the collateral that would result—“ \n“I know it’s news to you, but not everything can be solved with a couple of tanks and a gun.” Stark is angry now; good, thinks Steve. “Jesus, Cap. Pull your head out of your ass. Times are changing. This is bigger than a war. This is bigger than any war. The technological advancements we’ve been making in the last two years alone as a result of this conflict will change the world.“ \n“If there’s a world left to change.” \nStark steps closer, his dark eyes glittering fervently. “I’m going to put a man on the moon, Rogers.”\n“Sure,” agrees Steve. “Remind me, is that before or after you waste millions on what amounts to a pissing contest?” \nStark falls silent, his cigarette hanging out of the corner of his mouth. Steve thinks for a glorious moment that he’s actually managed to shut him up, but then Stark takes another drag and barks out a laugh. \n“I made you,” he says, abruptly quiet, his eyes narrowing. “You know? I made you what you are. Do you have any how much you cost? Do you have any idea what the financial fallout was like after the serum was destroyed?” He scoffs. “No. No, of course not. Because you’re a soldier, Rogers.You’re a grunt. But this isn’t a war for soldiers. This is a war for weapons.”\nThe doors open just then, and it’s Peggy, thank God, standing there silhouetted by the light of the party happening inside.\n“What are you two doing?” she asks, sharply suspicious. \nStark plants his hand on Steve’s shoulder. “Nothing at all, sweetheart,” he says. Steve’s skin crawls and Peggy’s look becomes deeply unimpressed. “Just sharing a smoke. I’ll see you back inside.” \nHe flicks his cigarette carelessly off the balcony of the White House and brushes past Peggy, who gives him a wide berth and looks ready to hit him. Steve, familiar with the feeling, walks over to her as she shuts the doors. \n“You shouldn’t be out here, it’s freezing,” he says. \nPeggy eyes him and then proceeds to ignore his attempt at pleasantry entirely. “Let’s go home, shall we?”\n“Peggy, if you have to stay for longer you know I don’t mind,” Steve says, and he doesn’t; Peggy is the Director of SHIELD now, Stark having signed it off a year prior in order to expand his weapons empire even further and make investments in developing technology. His investments are lucky, Steve supposes. Stark picks them sparingly, and, like Midas, the second he touches them, they turn to gold. \n“If you and Howard have resorted to arguing on the balcony then it’s definitely time to make a tactical retreat,” says Peggy archly. She wrinkles her nose at Steve and adds, a smile in her eyes, “Besides, my feet are starting to hurt. These shoes are absolute hell.” \nPeggy extricates them from the gala deftly, kissing cheeks and, Steve notices, nodding sharply at Dulles before they exit. He can hardly recognize Peggy when she puts it on like this, handling every question and well-wish and photograph like she’s spent her entire life doing it when really it’s only been the last couple of years.\nUnglamorously they take a cab back home, and Peggy takes her shoes off while Steve gives the driver directions. The babysitter, Jennifer from next door, initially tries to wave off the extra twenty Steve hands her, but relents when he insists that it’s for staying so late and managing to get Kat into bed so early. Peggy brews Steve a pot of coffee and makes tea for herself while Steve shuffles around, kicking off his shoes and hanging their jackets. \n“I saw you met Lyndon Johnson,” calls Peggy from the kitchen. Steve sifts through their mail: bills, bills; Dugan’s gotten himself engaged, bills. At least it’s no problem to pay them anymore; used to be that — \nWell, a lot of things used to be. \nPeggy continues digging around for a tea bag and asks, “What did you think of him?” \n“He’s alright,” Steve replies. He didn’t like him, not really, and had heard stories aplenty about how bad he wants the presidency. Steve’s next words fade, distracted; there is a file on the bottom of the pile of mail, a thick one, with CONFIDENTIAL stamped across it in red, prohibitory letters. At the bottom it reads ПРОЕКТ: ЗИМНИЙ ВОИН. \n“Peggy,” says Steve, rounding into the kitchen and offering the file out. “Do you need —?“\n“Oh, Christ,” says Peggy, her eyes going wide. “Thank you, I can’t believe I left that out.” \nSteve hasn’t heard a word about the Red Room in years, much less the Winter Soldier Project, not since that first operation in Leningrad went to hell in a handbasket and Agent Morrison, twenty at the oldest, died under Steve’s hands. Steve, who has been running recon and taking care of the occasional hostage situation since, simply figured that the information had petered out, trusting SHIELD to come to him should anything important come to light. \n“You need it for work?” Steve asks.\n“Yes,” says Peggy, searching around now for her briefcase. Her tone indicates that this is as much as she has to say on the topic. Steve pours himself a mug of coffee and leans against the counter and watches. \nSarah Rogers sometimes talked about the Sight and would claim that she knew just when a spider would be spinning its web inside the pantry or when prices for milk would go up, again. Steve never put a lot of faith into it, chalked it all up to Old Country superstition. \nHis spine prickles now all the same. \n“Is there a situation?” Steve tries.\n“Not at all,” Peggy replies evenly. She makes a small noise of triumph and slips the file into her briefcase; Steve hears it click and realizes he does not know the four digit code to unlock it and never has.\nPeggy carries her briefcase to the closet. Steve stands in their kitchen. He scuffs his socked foot against the tile, listening as she pushes shoes out of the way to make room. “You know,” he says after a moment, “I, uh, I haven’t really asked you recently — how’s work?” \n“Alright,” Peggy replies. Steve hears the door shut and schools his face into an open smile as Peggy rounds back into the kitchen. She returns it and then reaches for her tea. She takes it black with sugar, the same way that Steve takes his coffee.\nSteve thinks of how a week earlier he woke to an empty bed and heard her on the phone in the study with an operative, talking about a situation in Volgograd. She was snapping out orders with more force than Colonel Phillips ever had, rest his soul. \nThey finish their drinks in silence and Steve tells her he’ll be upstairs in just a second.\n“Just gonna wash the mugs, tidy up,” he explains.\nSteve kisses her on the mouth but doesn’t manage to make eye contact, seeing instead the sweep of her eyelashes and the black line of her sharp eyeliner before she turns away and goes to bed. \n—\nIn Steve’s dreams, Bucky reaches out with his blue fingertips and whispers Stevie, so sweetly, like he aches all the way through his bones, all the way down to the meat of his heart, for two syllables and a childhood nickname that’s long since gone. But in the dreams he says it again, quiet like a secret, just in the moment before the frost creeps up his throat and strangles his voice into silence. \nThis is a lie, of course. Bucky died screaming. \n—\nIt’s only the three of them tonight, Morita in town on SHIELD business and Dum Dum on a long layover back to New York. They snap to attention and salute him when he finds their table at the back of their usual dive, one where everyone remembers the war and nobody dares hassle Jim or Gabe besides. Steve returns the formality before clapping them both on the back and settling down next to Morita and across from Dugan, drinking a perfunctory first toast. It’s strange to talk without the others, but Falsworth and Dernier are both back home, and Gabe’s out of the life as much as anyone can be, spending all his time with his six kids in Oregon. They drop each other lines when they can — though, Steve knows, more amongst each other than to him, but that’s alright — that’s how it is. It’s good enough that they like sharing drinks with him, because he doesn’t know another company who’d voluntarily drink with their CO. \nDugan’s got one son from his marriage during the war that didn’t last through the victory, and they talk about him, about Leo, how he’s going to law school, and about Miss Morris, who, according to Morita, has decided to make an honest woman of Dum Dum at last. \n“And Mrs. Rogers?” asks Dugan, his eyes bright from the alcohol. The boys don’t drink much anymore because they haven’t got as much sorrow to drown, but Steve still insists on buying for everyone, even if it is only three of them. Tradition, routine; and a good one. \n“She’s good, she’s still in intelligence,” Steve replies.\nMorita, who’s switched out of medical and has spent the last six years code-breaking for SHIELD and doing other things involving Stark’s technology that are ironically above Steve’s clearance level, nods to himself. SHIELD flies so far under the radar now that even Dugan can’t know, despite being involved with the SSR previously. And isn’t that something, these days — how everyone is willing and ready to lie to their friends in the name of national security. Loose lips, sunken ships…\n“How’s Miss Kathryn?” Morita says.\n“Growing up,” Steve confesses. Dark hair like Peggy’s. Steve’s eyes. She’s a stunner, and she’ll be breaking hearts left and right in the next year or two, Steve just knows it. “They shoot up so damn fast; Dugan, now I know what you mean. She’s so much older.” \n“Aren’t we all,” Dugan agrees, gone thoughtful and quiet. \nMorita examines Steve in the darkness of the bar. “Not you, though.” \n“Hmm?” asks Steve, finishing off his beer.\n“Not you,” Morita repeats. “Look, me and Dugan — especially Dugan—” an eye roll, “We’re going all gray. Cap, you don’t look a day over twenty-five.” \n“Lucky bastard,” Dugan agrees.\n“Guess that serum was good for a couple things, huh,” Steve jokes, but weakly. Dugan chuckles dutifully but Morita just looks at him askance, knowing. Dugan putters around, finishes his beer, and checks his watch.\n“Hell,” he swears suddenly, “My flight’s early tomorrow, and Lillian will have my balls if I miss it. Last toast?” \nThis tradition is sixteen years old, older than Kat, older than Steve’s marriage. Dugan goes up to the bar and orders four stiff shots of Glenfiddich and then arranges them on the table. Morita raises his glass first, as it’s always Morita, whose voice will not crack, and who has different words each time.\n“To Sergeant James Barnes,” Jim says. “Steady hands, steady heart.” \n“To Barnes,” Dugan echoes. They down their shots at once, gather their coats, and leave the fourth glass full, sitting in an empty space at an empty table. \n— \nOutside the sun is setting and Steve has dinner finishing up. Kat does homework upstairs, preferring these days to sequester herself away and study. She has a very high GPA and likes to spend long days out by the ponds and lakes to watch little fish and crustaceans swim and scuttle up onto the bank and away again, keeping notes and drawings in a field journal. She’s a grade ahead of what is average. Steve knows that Peggy wants her to learn more of self defense, and respects that even though he has realized that he should not try to pretend to understand it. He doesn’t. He has no idea what it’s like, in these days that are somehow more unforgiving than ever, for girls and women who want a career. \nBut, selfishly, Steve doesn’t want Kat to have to learn those things at all. \nThe front door opens a little past seven and Peggy comes in, finally, after a very long day.\n“How was work?” asks Steve from the stove.\n“Alright,” Peggy replies, smiling vaguely.\n—\nSteve brushes his teeth, Peggy already asleep with her back to the light spilling out from the bathroom. He spits into the sink and rinses his brush and then stares hard into his reflection and hears Dugan’s words echo back at him from weeks before. There are no lines on his face, no creaks in his joints. He leans close to the mirror; there isn’t a single gray hair on his head. His skin is young and taut, his teeth white and straight. His jaw is strong and clenched, his eyes blue and scared. Steve Rogers is forty-three years old. If he didn’t shave for a while he could pass, at oldest, for a youthful twenty-eight. \nSteve thinks of Stark, who drinks like he’ll live forever, and realizes that there is gray that flecks his mustache. He thinks of Dr. Erskine, who was balding, who never warned him, who couldn’t have known all the effects besides. \nSteve thinks of Peggy and realizes that yes, there are the very fine beginnings of lines around her mouth, laugh wrinkles at the corners of her eyes. She’s taken to wearing her hair short again, and Steve hasn’t seen a tube of red lipstick on their bathroom counter in a long time. Steve didn’t notice because Steve sees her every day, and because she’s beautiful. But it’s true. Morita was right. \nAround him the world is aging.\nHe doesn’t know why this is a surprise; his body has always betrayed him. He was born sick and tiny and too soon, with bad lungs and a bad immune system. And now — now, even after he’s been fixed — it turns out he’s still broken. \nSteve has never thought about living forever, not even abstractly, not even in the way that the young and the reckless tend to do. He doesn’t want death but he’s never been afraid of it. He worries what Kat would do without him when he goes out on the more dangerous missions but knows if he was lost out there in the perpetual Soviet winter that Peggy would pull her through. Steve has lived through an improbable number of maladies, a cellular recalibration, a world war. He’s been shot more times than he can remember and once took a knife to the jugular. He jumped out of a plane that was nosediving into the Arctic and swam a hundred miles to a frozen shore.\nHe hasn’t died yet.\nWith a steady and growing unease, Steve looks in the mirror and realizes that he might not for some time. \n— \nSteve wakes up gasping and Peggy presses a hand to his chest. She offers him water. He says no thank you. Peggy falls asleep again with her back to him.  \n—\n“How was work?” asks Steve. The clock in the living room ticks; Kat is at a friend’s for the night, and it is almost ten. \nPeggy smiles at him in an unintentionally sharp-edged way that says she has been doing something very unpleasant all day long. Steve thinks of her punching Hodges in the face a million years ago at Basic and wonders what she does now when the USSR captives mouth off during an interrogation — or what she has other people do for her.\n“Just fine,” Peggy says, and takes her briefcase, locked, straight upstairs.\n— \nIn the dark Steve stares at the ceiling, Peggy breathing steadily next to him, and he wonders — was Bucky even real? Or some fantastic concoction of his fever-addled mind? Sergeant Barnes Steve can believe in; other people remember him. There are photographs and news reels and programs on the television about Captain America and his Howling Commandos. There are movies with big Hollywood stars. Sergeant Barnes has his name on a wall of SHIELD and the Pentagon both, fallen soldier, fallen hero. KIA, 1945. Kids write about him in school on Memorial Day. They have their comic books, vintage now and not worth shit because nobody’s buying. Sergeant Barnes, James Buchanan: as much as Captain America, he’s larger than life, a legend that refuses to die just as much as Steve’s hair refuses to go gray. \nBut that Brooklyn kid who came home reeking like cigarettes and the docks, who laughed with his head thrown back, who spiffed himself up in the mirror every Friday night, smelling good and sweet, not a hair out of place — there’s not a soul alive who knows him, no one but Steve anymore with a soft spot left for that hell-raising boy. \n \n \n\n1963\n\nKat tells Steve that she is maybe thinking about possibly going steady with Robert Morrow, who is in her grade and spends, to Steve’s understanding, about sixty percent of his time yanking on Kat’s braid and daring her to climb trees by stating loudly that she probably can’t climb trees, not in those shoes. He sounds just like Buck, which sends Steve straight into a panic. Bucky could drop girls with a wink and had a grin that might have easily launched a thousand ships. Which was fine, at least when it was Buck, but Steve doesn’t know who the hell this Morrow kid is except he sounds like a troublemaker. \nHe doesn’t tell Kat no, of course. He feels his general gripping fear that this kid will hurt her isn’t justification enough for that. And besides, she has none of Steve’s awkwardness, maybe because growing up the daughter of Captain America she hasn’t been afforded it. When she talks about Robert Morrow she’s collected like Peggy and doesn’t blush once. \nDespite the outward cool, Steve knows what it’s like to get hit with the full force of attention that way. \nThe same week that That Troublemaker Morrow asks her out, Peggy teaches her how to throw a punch and the proper angle at which to take someone out at the kneecaps. Steve figures it’s a fair trade. By the time Morrow turns up to pick up Kat for dinner and a movie, stammering and terrified of Captain America, Kathryn, looking very pretty and very, very young, is equipped with the knowledge of breaking his nose should he try anything. \nSteve thinks this is enough stress to last him a lifetime and is vaguely relieved that Peggy had swiftly put her foot down after having one child. \nA week later Kat’s out at school, probably hanging around that Morrow kid again. Steve is trying and failing to make an edible lunch, distracted by the previous day’s inconclusive debrief at SHIELD HQ about KGB activity when the program he’s watching cuts out suddenly, replaced by the CBS logo. \nPresident Kennedy’s been shot. \nHe calls Peggy’s office line directly and can’t get through. He kills the oven and runs sixteen blocks to the Triskelion. Stark is there. \nSteve spends three days asking what he can do. On the fourth, Stark tells him he’s having a press conference. Johnson — President Johnson now (guess he got, says Buck’s voice, what he was jonesing for so bad) — approved it. A PA presses a slim stack of notecards into Steve’s hands. He reads a bunch of words to the reporters that mean very little to him. Steve assures everyone that they’ve caught the man who did it. \nPeggy and Stark don’t act like they’ve caught the man who did it. They work so late into the night that Steve generally turns in without her. For weeks he receives nothing. No crises, no orders. It’s radio silence. Some people, maybe, remember stories from their grandparents about the day that Lincoln was killed, but by and large, no one has a single goddamn idea what’s supposed to be done. They follow procedure best they can. Steve views the footage that SHIELD has procured of the assassination but it’s whisked away before he can take a look at it frame-by-frame.\nHe thinks of the First Lady trying to climb away from her husband’s body, her pink suit stained with blood and brains, for a long time. \nIt’s after 2400 when Peggy gets home on the seventh day, Steve waiting at the kitchen table with a cup of coffee and a book that he hasn’t been reading, doesn’t even know the title of.\nWhen the door opens Steve sets it down on the table in front of him. Peggy walks in, brushing a wet snow from her coat. She hangs it up and gets almost to the stairs before spotting Steve in the kitchen. She stops and stands and they calculate one another openly, Peggy’s head cocked to one side, Steve’s hands folded atop the open book. \nSteve breaks the silence. “How was work?” \nPeggy cracks a dry and humorless smile and goes upstairs. She doesn’t take the time to lie.\nThe next night she doesn’t make it in at all. Steve waits up for her until eight in the morning, after Kat is already at school, and makes coffee. She opens the door half an hour later, carrying her shoes in one hand. Peggy freezes when she sees him reading the paper in the kitchen, still dressed from yesterday. After a moment of stunned blinking she recovers and sets her shoes onto the floor.\n“You shouldn’t have waited up,” she says briskly. \nSteve stays silent, watching as Peggy goes about making herself a cup of coffee. Her lipstick has been wiped off and in the back her skirt’s buttoned all wrong. \n“I’m only gonna ask once,” Steve says, boiling and quiet. “What the hell’s going on?” \n“I’m not entirely sure if you’ve noticed, but the nation’s in a panic,” says Peggy tightly. \n“You work in intelligence, Pegs. Everything from here on out is public relations. The assassin was apprehended —“ \nEven from behind Steve knows all of Peggy’s tells, and doesn’t miss the way her shoulders tighten. She’s tired, and her guard is down, and it’s suddenly obvious that Steve’s suspicions have been right. She’s been lying to him about something. She’s been lying for a while now.\n“The assassin hasn’t been apprehended,” realizes Steve, feeling an awful dread. “Peggy — why hasn’t the assassin been apprehended?” \nPeggy appears to be weighing her options, her back still turned. \n“Dammit, Peggy!” Steve suddenly barks, standing. He plants his hands on the kitchen table and wills her to turn around, to put a goddamn stop to this. “So help me, if you’re helping Stark feed SHIELD’s lies to the people —“ \n“It isn’t like that,” Peggy snaps harshly, wheeling around on him. Her eyes blaze. “Not anymore. It isn’t like that anymore. Nothing’s the same as it was, Steve. Can’t you see? Can’t you see that the entire game has changed? Not only the board, not only the pieces, not only the players.” \n“What are you doing?” asks Steve, bewildered and furious and confused. “What the hell is it that you’re doing, Peggy? What’s got you so damn guilty?”\n“I am protecting this country,” Peggy says, barely keeping her voice from a yell, her hands shaking with rage. Steve scoffs and then fiercely she repeats, “Listen to me. I am protecting this country. Everything has changed, and I have had to change with it or drown. Do you understand? Can you understand that? I have changed myself to keep this country in one bloody piece, Steve. I have torn myself to pieces to keep people safe.” \nSteve’s stunned into silence and after a moment Peggy turns, stirring milk into her coffee, her movements sharp. Steve wonders when she started drinking her coffee with milk. It’s an affectation, he thinks bleakly, of Howard’s. She runs her hand through her hair and takes a breath. Steve watches her do it, still angry, unwilling to let it go.\nHe tries to push it down, though. He softens his voice as best he can and takes a couple deep breaths. But it comes out snappish anyway, because it turns out that Steve just wants to be mad. “You were just gone for almost twenty-four hours,” says Steve into the silence. “You didn’t call. You didn’t leave a note. I had no idea where —“ \nPeggy’s turns, her eyes narrowing again. “I’m not sure how it’s escaped your notice, but I’m the director, Steve. Sometimes I have to stay later than what I’d prefer.” \n“Kat knew you didn’t come home last night,” Steve replies. “I’m not going to lie to our daughter for you.” \n“I was working,” Peggy says. She looks at him and then squeezes the bridge of her nose, closing her eyes and taking another breath. “I need to be back in the office after dinner,” she says, in a voice that is deliberately very calm. “I’m going to wash up and take a nap. Alright? I’ll be down in two hours.”  She turns to the stairs, and Steve’s self control crumbles. \n“Are you fucking him?” Steve bites out to her retreating back.\nPeggy stills. She turns and walks back down until she stands very close to Steve. \n“Do you want to repeat that?” Peggy asks.\nSteve breathes in through his nose, a directionless fury building behind his eyelids. He knows he’s lashing out. He knows, and somehow, he can’t stop himself. “Are you,” he enunciates, “Fucking him.” \nPeggy’s hands clench into fists by her sides. For a split second Steve is entirely sure that she’s going to hit him. Instead she says, icily, “I don’t have time for this. I don’t have time for your petty jealousy or your insecurities when the intelligence community is crumbling around my ears. I have bigger problems than you.”\n“Is that a yes?” pushes Steve.\n“You bloody hypocrite,” Peggy hisses. “How dare you say that to me? You?” \nSteve reels back. “What the hell are you talking about? Peggy, I’ve been faithful to you my whole life.”\nPeggy shoves at his chest. He doesn’t budge, but she uses the momentum to push herself away. When she speaks again her voice comes out strangled. “If you truly believe that, you’re even more blind than I thought. Don’t expect me home tonight either.” \nShe walks back to the door and shoves her feet into her heels. Grabbing her briefcase and her coat, she turns to look at him and snaps, “I slept in my office. All Howard did was call in for breakfast.” Her face becomes suddenly sad, and her entire body is held rigid in a way that means she’s very tired and trying very hard not to cry. “I still love you, Steve. God help me, I think I’ll always love you. I just don’t much like you anymore.”\n \n \n\n1966\n\n\nIn 1943 then-Captain Rogers was called upon to lead an SSR-sanctioned rescue mission for the captured 107th Division of the US Army behind enemy lines in Austria. The mission was successful, and Rogers returned to allied territory with 200 of the 243 captured men. From these soldiers he selected a team of specialists known as SSR Strike Unit One (see “Howling Commandos”, page 255). This was the rescue mission that not only launched Colonel Rogers’ military career, but is also recognized as being one of the most courageous operations that occurred during the Second World War. \n\n\n(Cochran, Stacey, and Randall Cross. A Boy From Brooklyn: The Authorized Biography of Captain America. Reprint. New York: Simon &amp; Schuster, 1950. Print.)\n\n\n—\n\nSteve crosses the Red Square briskly, the reflection of the Kremlin looming behind him in the window of the cafe he approaches. He opens the door and spots Agent Sanchez, drinking from a tiny espresso cup in the corner. He weaves through little tables and chairs to sit across from her, not bothering to take off his coat or gloves. He pushes his horn-rimmed nonprescription glasses up his nose as he pulls his chair in and drinks from the coffee she’s bought him, black and too hot, with a little sugar. \n“Recon complete,” he reports lowly. “We’ll be back by 2100 at the latest. Let Director Carter know that I’ll be in for a debrief within the hour.” \nSanchez nods. “Noted,” she says, but keeps looking at Steve instead of redirecting her attention to her book the way she’s supposed to. \n“What is it?” asks Steve, immediately on watch.\nSanchez evaluates him for a moment and finally says, “I wanted to let you know before we get back that there’s a situation with a number of media outlets.”\nSteve, whose body has tensed for confrontation, is confused. “What?” He says. \n“Mr. Stark has been calling through SHIELD for the last hour. He said it wasn’t urgent but that he’d like me to tell you to, and I quote, get your ass back to the States for damage control ASAP.” \nSteve drinks his coffee, which is cool enough now. “Do you know what happened?” \n“I…” Sanchez’s brow wrinkles. She seems young and confused in a way that she never has before, and Steve looks at her as her gaze drops. Her eyeliner is drawn on neatly, her hair curled, the scar bisecting her left eyebrow filled in with pencil. She seems, suddenly, softer.\n“Sanchez?” \n“I’m not at liberty to say,” she finally decides. She raises her head and looks at him again with a stare that is piercing and sure. “But Colonel Rogers, I do want you to know that no matter the fallout, or the truth of the accusations, I know where my loyalties lie. And they lie with you.” \n—\nIn 1943, Steve, rain soaking through the worn soles of his boots, his hair dripping against his forehead, watched inside a command tent as Phillips’ face fell into a look that was apologetic but matter-of-fact. In 1943 Steve panicked, defied direct orders, and enlisted the help of a civilian engineer to fly him into Nazi territory on the sliver of a chance that Bucky was still alive. Quite incidentally he freed 200 men. He should have gotten a court-martial. Instead, through dumb luck alone, he ended up the captain of his own team. \nB-A-R-N-E-S. Steve had spelled it out a million times, to his employers, in the hospital; yes ma’am, he’d gasp between coughs, that’s my next of kin. He never really thought of all the times Buck himself must have spelled out Steve’s name, to his manager at the docks, to the officers at the recruitment office and, later, Basic. R-O-G-E-R-S, that’s right, Steven G., yes sir, he lives in Brooklyn. Yes sir, mark him down.\nIn that tent Phillips told Steve he’d been writing letters all day long. It’s only now, twenty-five years later and staring at the lurid headline splashed across the cover of the Times, that Steve belatedly and randomly realizes that one of the condolence letters in that pile was addressed to him.\n \n\nWAR HERO’S LOST LETTERS FOUND;\n\n\nSERGEANT JAMES BARNES’ EPISTOLARY CONFESSIONS SHOCK THE COUNTRY;\n\n\nWERE THESE ADDRESSED TO “CAPTAIN AMERICA”?\n\n \n“Who the fuck wrote this?” demands Stark into the phone. Beside him Peggy is flipping through the article, her face very blank. Steve numbly holds his own copy of the newspaper in his hands, looking down at the black and white photograph of Bucky in uniform. He smiles handsomely into the camera, his officer’s hat tilted rakishly to the side; it’s the same photograph thousands of people have of their dead soldiers. Steve doesn’t know where they got this picture. Even he doesn’t have it, hasn’t laid eyes on it in years, never realized it had even disappeared. It’s what he gets, he figures, for allowing the SSR to box up their Brooklyn apartment instead of doing it himself. \nStark is continuing, his knuckles white around his tumbler. “Ever—Lyle Everhart? Who the fuck is Lyle Everhart? Listen to me, whoever that cocksucker is, he obtained these letters through illegal means. He — are you listening? He infiltrated an intelligence agency of the US government to get a headline. —Yeah? Well, maybe next time you should check your fucking sources. Make sure your reporters aren’t about to get your ass sued in federal fucking court. Jesus fucking Christ.” Stark slams the phone so hard down on the receiver that it rings a little. He lets out a breath and turns to face the window of Peggy’s office, running a hand over the top of his gelled hair. \nStark’s words finally penetrate. Steve tears his eyes away from Bucky’s printed face and looks up at Peggy and Howard, a hot panic beginning to push through the sludge of shock. “What do you mean, he infiltrated an intelligence agency?” \nStark’s shoulders go stiff. \n“Stark,” says Steve, slowly. “What the hell do you mean, he infiltrated an intelligence agency? Are you —?” The thought is awful, and Steve’s throat closes up around it. It takes him a moment to speak. “Are you telling me, are you saying that you — you knew about these? All these years, you knew about these letters? You had them under lock and key, all these years, and you never told me? Nobody ever told me?” \nStark turns. “We thought,” he starts, placating. \n“You thought,” laughs Steve. He is, he registers a little dimly, getting hysterical. “You thought? You thought — what, you thought it was within your goddamn rights to pry into my life far enough to keep me from reading my own mail?” \nUnexpectedly, Stark’s face drops in surprise. “You mean you’ve never seen these?” \n“Of course I’ve never goddamn seen these!” Steve shouts. \n“Shut up,” says Peggy sharply. “Both of you, calm down. Howard, I’m going to handle this. We’re going to find a secure location, and you are not to call, you are not to visit, not until I tell you that we are finished and that you may speak to us. I want you to contact your legal department. I do not want you to issue any kind of statement or speak directly to the press. Do you understand me?” \nThey stare at one another for a tense moment until finally Stark gives a small nod. Satisfied, Peggy gathers up her coat and briefcase and the paper and brushes by Steve, saying, “Let’s go.” \nSo Steve follows her numbly to the car and doesn’t fail at all to notice the SHIELD employees in the elevator and the front desk and even walking into the door who stare at him before snapping their gazes away like they haven’t been. They drive home in silence, Steve going for the passenger seat because he doesn’t think it’s a very good idea to get behind the wheel. He looks out the window and feels Bucky’s black and white eyes, crinkled by that smile, staring right up at him out of the page. Steve walks inside the house and into the kitchen. And then he remembers about Kat.\n“Has she seen these?” he asks, suddenly and coldly terrified, dropping the paper onto the counter.\n“She’s in school, she won’t know about it for a few hours if we’re lucky,” Peggy replies evenly. She crosses into the kitchen and sets her briefcase on the table. Steve looks down again at his copy of the Times, staring at the headline. The words of the article itself blur and he can’t focus enough to read them. He rubs a hand over his mouth and takes a breath.\nPeggy waits with impersonal patience at the other end of the kitchen. Steve looks at his shoes, his hands; at the paper again. He owes this to her, he does, owes it to her more than anyone, but is not entirely sure that he will be able to make his voice work right, not after seeing that smile on Buck’s face, not after finding this out. Now. After all this time. \n“Even when I had nothing,” begins Steve, “I had Bucky.” \nAs though she expected this Peggy nods. She looks down at her own copy of the Times, and Steve can see her eyes move across the text of the headline, once and then twice. She nods again to herself, just a little, and asks, starkly, shatteringly, “Did you love him?” \nHere is the horrible truth of it, cover to cover: for as long as Steve can remember, the entire universe began and ended with James Buchanan Barnes. It spun on the axis of them. But then James Buchanan Barnes fell miles into a frozen ravine, and the universe, in an act of unspeakable cruelty, kept spinning on.\nSteve loves Peggy. He has loved her since the moment he saw her, and during the war he thought about her every night before he fell asleep and every morning after he woke up. He loves her endlessly, loves her growing wrinkles, loves the mole beneath her left breast. He loves her in her multitudes, in her singularities, and the night he proposed he felt unworthy and small in the face of something so huge as the love he felt for her and the love that she returned. He loves the life they have built. He loves her despite the lies and the fights and the chill that has settled over their brownstone. \nSteve didn’t — he didn’t, with Bucky. \nIt was never so simple as that.\nWhen Steve’s lungs rattled so bad and started him coughing so hard he went white, when his ma would sit beside his bed and pretend hard like she wasn’t thinking of calling in the priest, Steve breathed for Bucky, just for Bucky, who’d kill Steve himself if Steve left him alone without anyone to throw rocks with. When Steve would start gasping in the winter after trying to walk up the three flights of stairs to their shoebox apartment, Bucky would stop on the landing and press Steve’s thumb to the healthy pulse inside his wrist and sway close, waiting for their heartbeats to match. When they fell asleep — at nine, at sixteen, at twenty-five and freezing cold in Allied France — they aligned like two pieces of a puzzle, so perfectly fitted together that it would take an act of God Himself to tear them apart. And it did take an act of God. It did. They ruled the world with scraped knees and no central heating and not even two dimes to rub together. Steve would raze cities to save him. He would march through miles of the blackened hell of wartime Austria all over again, a thousand times, a million, barefoot or even naked, bleeding, carrying one hundred pounds uphill like Sisyphus, just to see one last time the smile that spread across Bucky’s face when he recognized Steve as his savior. Steve knows this the way that he knows the sun rises in the east and sets in the west. With Bucky, Steve is covetous. He has seen him in his dreams a hundred times. He has wanted him for a thousand years.\nThere is no way to say this; Steve couldn’t make his throat open enough to get the words out even if he knew how. He can only form his mouth around the simplest truth he has ever known, the truth that he has never spoken; the truth he is only just now, twenty-five years later, realizing completely. \n“Yes,” says Steve, and experiences for the hundredth time the boundless grief that lays in wait inside of him, always.\nPeggy’s face remains expressionless. “And do you still?” \nDoes he? He knows now. A moment before he didn’t, but now he does, and suddenly he sees the last twenty-one years with startlingly clarity. It makes sense — the ache he carries everywhere he goes. The pain he cannot shake. The way his marriage has fallen into splintered bits of what it used to be. It makes terrible sense.\n“Peggy, you gotta know,” Steve says, roughly, because this is the most important thing for her to understand right now. “It doesn’t mean I love you any less.” \nPeggy makes a noise like she’s been hurt and Steve looks at her. She isn’t crying but she looks betrayed, and confused, and rightly so — she doesn’t deserve this; she doesn’t deserve any of it. Steve hasn’t heard her cry in years, not since she thought he was going to die putting that plane in the ocean, and her pain pierces right through him, cutting through the numbness of realization. \n“Peggy —“ he tries. \n“I’m going to stay here and so are you,” Peggy says, her voice suddenly collected and businesslike. “We’ll speak to Kathryn about it once she gets home. You’re not to tell her a single thing that you’ve told me. I don’t care what you say to the press. Say whatever you like. But the day she moves out for MIT is the day that you will move out.” \nSteve’s throat closes. He wants to fall to the floor and beg but knows it would only disgust her, and he doesn’t want to hurt her anymore than he already has. He hasn’t lied. He loves her, but— \nAnd isn’t that it? He loves her, but. \n“Do you mind if I still speak to Kat?” asks Steve.\n“She’s an adult,” Peggy says. “She can do what she likes.” \n“Is there anything I can do?” Steve asks helplessly.\nPeggy looks at him with a hardness in her eyes that Steve has never seen directed to him. It chills him in a way that he knows he deserves. \n“No,” she says. “No, there’s nothing to do, Steve. Not anymore.”\n—\nThe letters might as well be journal entries, Steve supposes, except for how they are obviously written to someone, obviously deserving of an address and a name that they do not have. There are even two fold marks on each page, both horizontal, the way you’d fold a letter. They aren’t dated, but Steve figures Buck wrote them pretty far apart. Each one is filled up with emotion so vast and violent that Steve knows he couldn’t have been keeping up with them each and every day. \nStark can’t or won’t get Steve the originals, but Steve is too exhausted by the whole situation to raise hell about it. Instead he makes do with copies of them, Bucky’s scribbled handwriting stretching across the pages. SHIELD delivers them to Steve. There are an unlucky thirteen. Steve wonders if these were all the letters that Bucky wrote or if there were more that didn’t survive the war. \nStark swears up and down that all he knew was that Phillips put Buck’s pack from the war into the care of the SSR. They tallied the contents — leather-bound journal, cigarettes, handful of knives, a broken watch, a half-empty flask — and put it in storage. And that was it. That was all. Then he advises Peggy loudly to fire every single employee who works archives and every security officer in the building too for allowing a breach of security like that, and Steve stops listening.\nThe photocopied pages are stapled together in the upper left hand corner. Steve picks and worries at the staple until it falls out of its own accord. He’s holed himself up in his bare SHIELD office to finish this, locking the door and drawing the blinds. For two long nervous minutes Steve thinks that he can’t do it. He thinks that he can’t read them, and that he will shatter into a million pieces if he tries.\nBut he’s thought this before, in alleyways and movie theaters, in Basic, during the procedure; when Buck slipped away. So he cracks his knuckles and gets to work. He owes it to Bucky. He owes it, maybe, to himself. \n—\nKathryn gets back from school two weeks after the news hits with torn-up knuckles and scrapes on her knees. Steve rushes to his feet as soon as he sees, fear streaking through him. \n“Dad, I’m fine,” she protests. \n“What the hell happened?” he blurts, heading to the downstairs bathroom and rifling around for a moment before he finds the alcohol to blot at the scrapes. When he comes back out Kat’s still standing where he left her, looking exasperated and wary. He takes her little hands in his own and dabs and them. She flinches but hides it quickly. \n“Kat,” he says. He catches her eye, forces a little smile, and says honestly: “You’re killin’ me here. You just have to tell me what happened. I’m not gonna be mad.” \n“I was walking home with Mary, and there were these boys with a newspaper. I heard one of them —“ She takes a sharp breath and looks away, her brows furrowed. She works her jaw when she’s angry just the way that Steve does. He hasn’t held his daughter’s hand in a long time, but he does now, setting the cloth aside and folding his hands around hers.\n“They called you a commie,” Kat says. “They said — they were waving the paper around, the one with all that stuff in it about Bucky, and when I went over to tell them to shut up, the boy said that I should be ashamed to have a father who’s a communist and a — and a queer. And I punched him in the face.” \nThis is, impossibly, worse than Peggy’s reaction. This is his daughter, who has been directly harmed because of his mistakes. She bled for him. \nTears catch thick and fast in his throat, which is a first in a long time. “You didn’t have to,” manages Steve.\nHer eyes meet his, the same blue that he recognizes from the mirror.\n“I wanted to,” she says. \nSteve studies her. He drops his gaze and knows that Peggy will be angry if she finds out, but he has to do it. He has to tell her. He doesn’t like to lie, and he isn’t comfortable with doing it, not the way that she is. “Your mother didn’t want me saying this to you,” he says. “But I think I owe it to you now that you got into a fight about it. Kat…” \nTerrified, he can’t meet her stare. He’s too much of a coward. And then Kathryn’s wrapping her arms around him tightly. “Just means you’ve got a really big heart,” she mutters, “That’s all.” \n“You believe that?” asks Steve, after a long, steadying breath. \nKathryn nods into his neck. \nShe graduates Valedictorian of the class of 1966 with her knuckles still scabbing over, and Steve and Peggy do the heavy lifting for her when she moves into her dormitory. Her roommate is a sweet girl named Janine who looks about ready to faint when she meets Steve. Steve thanks God privately for small mercies; at least she didn’t spit in his face and Kat’s too. \nThat night, true to his word, Steve packs up a duffle bag. He doesn’t have many clothes, and he leaves his uniform and suits behind. He brings his sketchbook, his wallet, a pair of shoes, the photocopies of Buck’s letters, and the flag.\nThe hands of six strangers folded this flag. Steve did not wear his dress uniform that day, only his best suit. He sat with his head bowed through the ceremony and held his palms outstretched from his seat to receive it. The fabric has faded now, but on that day it was almost too bright. He hasn’t been to Arlington before or since. Beside him, Peggy did not flinch when the shots were fired. When he did, she took his hand in hers. \nHe tucks the flag into the bottom of the bag and goes downstairs. Peggy stands waiting for him in the quiet of their brownstone. He offers her a weak smile.\n“Do you have enough money?” she asks. \nSteve shrugs. “Got a fifty in my wallet. I’ll figure out the rest. SHIELD still pays me, even if I’m only a consultant anymore.” \n“Steve —“ \n“I’m not taking our money, Peggy,” he says. “That’s for you and Kathryn. I know you hardly need it, and that you make a hell of a lot more than I do, but I’m not taking a cent from you. Not now or ever.” \n“Alright,” says Peggy quietly. They look at each other for a moment, and Steve misses her already and can see clear as day that she misses him too. Despite how angry they make each other these days, all that matters when you’re saying goodbye is the good times. But she’s right, as she usually is, and they both know it, and so he’ll leave, at least for now.\n“Where are you going?” she asks. \nSteve shrugs, smiling without humor at the corner of his mouth. \nPeggy opens the door and in the dim light of their porch raises a hand to his face. Her eyes are wet and she keeps them open when she kisses him at the corner of his mouth. “Be well,” she says. \n“Yeah,” croaks Steve. “Yeah, Pegs. You too.” \nShe waits, falling into parade rest, and stands vigilantly as Steve straps the duffle to his motorbike and takes off into the quiet of the night. \n—\n\nWhat do you say, after this I’ll take you someplace nice, and I’m not talking about one of the dance halls you hate so bad either. It’s so God damn cold in Brooklyn your lungs make a louder racket than our broken radiator and Mister Eli’s mangy cat combined, and then here mud sucks at our shoes and gets under my fingernails and I swear to God that I haven’t felt warm in half a year. Neither have you, no matter how hard you pretend otherwise. \n\n\nSo if we ever get out of this frozen wet hell we’re going out to the Grand Canyon. I tell you, I dream of the Grand Canyon. We’ll be there at night, just you and me, and throw rocks off the edge to hear them make land a thousand miles down, thunking like fat little raindrops into a puddle. That’s all I want to do anymore. Lay on the baked red ground next to you until my bones heat up. Warm again. Warm again with no more of that thick dried blood smell in my nose, just you, clean like your soap. You’d be heaven for anyone, but you’re especially heaven for a sinner like me. And even if we freeze where we lay like that Nazi splinter group we found — I heard the desert gets real cold at night, or maybe you told me that — at least it’ll be because we wanted to be there, and at least the air will be dry.\n\n \n \n \n\n1969\n\nDumbstruck, Steve reads the papers on the morning of June 29th. There have been riots in Greenwich Village at some place called the Stonewall Inn. The West Village has always been alright, nicer than where Steve kicked around anyway, and he’s surprised, but not as surprised as when he reads more and sees what they were rioting about. This is how Steve learns the word bisexual. \nLike the electricity in the air before a lightning storm, there is change coming.\nSteve does odd jobs for a while and keeps an eye on the news. He worries about Peggy and sends postcards to Kat. He does paint work in Pittsburgh and construction for a month in Nashville. From a motel in Little Rock Steve watches Stark put his men on the moon and is mystified by their slow and plodding steps on the grainy black and white television. Aldrin makes his speech and then plants down the American flag, as if it matters — as if, in this whole huge universe, the most important thing to do is show up the Soviets on a little rock that’s out of everyone’s jurisdiction anyway. He sketches the scene, the little men on the far-away rock in the sky, and draws Howard Stark’s face on the flag instead of the stars and stripes.\nWhen Stark has a kid a few years on Steve’s surprised, because he was sure that the space program, that was it, that was his real baby, even if it was only one of a thousand others, discarded once it was done and filed. Howard’s got no goddamn idea how to love people. All he loves are the things he creates. \n—\nThe letters are worn now by Steve’s constant worrying, the edges all frayed, soft and peeling where he’s folded and re-folded them. By now he can recite them all almost word for word.\n\nThey fucked me up, but I don’t ever wanna tell you just how bad. I won’t even now, don’t even want to think those things in your direction. But I will tell you — mostly because God willing you’ll never see these — I will tell you that when you first came for me I thought, hand to the Lord, that I was finally dead. And then I figured it was just another trick. They did that, made me think you were there. They’d shoot me up with something, and after I felt it slide through my veins under my skin I would see you, or I’d hear you, and I’d say your name the way I used to. You know what I mean — that nickname you hated, the one I still sometimes say just to rile you up because you’re amazing when I piss you off, your face all red like that, something about the fact that I can get your heart going. \n\n\nBut that name, I’d say it over and over. Up until I realized that they were back to their old drill, asking how’s that feel, does it hurt when I cut here? How about the sole of his foot next? And then I’d go back to it, name, rank, serial number. You wouldn’t believe all the German I learned on that table. It was a God damn language lesson.\n\n\nAnd now I’m trekking around with you, killing anyone who’s got a swastika on and looks at you wrong, and I’ll tell you, my feet bled for three days straight after you came to get me, and I didn’t once feel a thing. \n\n\nIt’s like this. You were the best at mythology when we were kids, and I remember one day we were reading about Icarus. And you remember this, I know you do, but I’m going to tell you the story again anyway. Icarus made wings out of wax to escape a prison. But when he was outside for the first time in years there was the sun hanging up in the sky above him and he thought it was the most beautiful thing he had ever seen. He flew closer and closer and his wings started to melt, but he didn’t give a good goddamn. He kept flying up until he couldn’t fly anymore, and his eyes were probably burning, and his skin was probably burning, but still he didn’t care. And then his wings melted all the way and he fell miles and miles into the ocean and brained himself on a rock, that poor stupid asshole. And I’ll tell you what: I’m no better. I’m no fucking better.\n\n—\nAt the Grand Canyon Steve makes a campfire. It’s a little cold, just the way Bucky predicted it would be, and by the flickering orange light Steve starts a sketch. It’s not the portrait that he’s got cut out from the newspaper and pressed between the pages in the back of his sketchbook, not even close. Instead it’s Buck the way that Steve remembers him, those big heavy-lidded eyes, the cleft in his chin Steve sometimes thought about pressing his thumb into, his hair a little unkempt like it was after a night of dancing. He draws Buck with his mouth open on a smile, on a laugh, and shades in the crinkles around the corners of his bright eyes, and sketches the broad slope of his shoulders and even the loosened knot of his tie. \nHe looks at Bucky’s face for a second, frozen in a laugh, frozen in time, and then he takes the sketchbook in one hand and holds it up and out so that Bucky can face the stars and the full moon and the Canyon itself, stretching and winding as far as Steve can see, and he hopes that Bucky knows, wherever he is, that they’ve made it; they’ve finally made it here, together. \n \n \n \n\n1971\n\nIn some bizarre twist of fate — that is to say, Steve gets lost near San Fran — Steve finds himself close to where he knows Jim’s living, and so, at a bit of a loose end and feeling the loneliness catch up to him besides, he calls Morita up from a pay phone to ask if there are any okay places around to stay the night. \nThis ends in Jim saying he’s got a perfectly fine guest room, which, “honest to God, Morita, wasn’t my intention —“ \n“Will you get in here?” asks Jim, looking amused as Steve loiters uncomfortably on his front porch. “You’ve got some scruff, and I think you’re making the neighbors nervous.” \nSelf-consciously Steve scrubs a hand over his jaw, which he has, admittedly, neglected shaving recently. He comes inside. Joseph’s off at school, Kat’s age now, but little Trisha waves bashfully at Steve when he comes inside. Michelle Morita, who comes up about to the middle of Steve’s chest, gives him a matching wave from the kitchen where she’s finishing up dinner. \n“You look cold,” she says, “I have soup, if you’d like some?” \nSteve stutters his way through what’s supposed to be a polite decline but somehow ends up with a bowl of chicken noodle anyway, homemade, and he slurps it all down in about two seconds before handing it back, embarrassed. Meanwhile Jim roots around in the liquor cabinet and comes back out with a bottle of Jack, good and cheap. \n“I’m gonna take Cap out back for a bit, it’s not as cold as it was earlier,” he says.\n“Don’t you dare have a smoke, James Morita,” says his wife threateningly, pointing her wooden spoon at him. Jim raises his hands in a gesture of innocence and Michelle narrows her eyes at him, flashing Steve a wink before he follows Jim out onto the little porch outside.\nMorita doesn’t have any cigarettes, he says, uncapping the bottle. He takes a sip and then hands it to Steve, waving him off when he tries to pass it back over.\n“Not much of a drinker anymore,” he explains. Morita leans against the rail of the wood porch, looking comfortable enough in his deep emerald sweater despite the chill in the early February air. Steve takes another drink of the whiskey, enjoying the familiar taste of it if nothing else, and mirrors Jim’s position, looking up at the night sky. \n“You hear about Detroit?” asks Jim after a moment. He doesn’t give Steve time to reply, which is alright; Steve hasn’t heard anything about Detroit at all. “Bunch of vets from ‘Nam are getting together, holding a testimonial. They’re telling all the stories of what they had to do over there. Talking about it…calling them war crimes.”\n“It’s like Nuremberg?” asks Steve, troubled by this.\nMorita gives a shrug. “Nobody’s being prosecuted, no names given. First Lieutenant this, Major that, you know. Real vague. It’s not a real trial, either, so I guess it’s not like Nuremberg at all. Just a bunch of kids, broken in a million ways, talking about the things their CO’s made them do. I’ve got a…well, a friend, I guess. Real young guy, you know, but he’s testifying, yesterday and today. I talked to him on the phone, he sounded pretty broken up about having to relive it. I tell you, Basic just isn’t what it used to be.”\nThough he had no idea about Detroit, Steve does know what Jim references — how some CO’s nowadays like to skin a little rabbit live in front of you the day before you ship out.\n“Yeah, I heard about all that, from Sanchez,” replies Steve. “She was supervising the testing of Stark’s newest weapons out in the desert.” \nMorita hums. “Stark made white phosphorous, huh? Nasty shit. Should’ve known it was him.”\n“Nobody wanted to fight in this war,” Steve says, quiet. \n“No, they didn’t. And it’s not a hell of a surprise, you know?” \n“I do,” Steve agrees. \nAfter another second of silence, Jim says, “They’re calling it the Winter Soldier Investigation — what?” \nSteve realizes a second too late that he’d allowed his recognition of the term to show on his face. “Nothing,” he deflects, shrugging. “Just — that’s an odd name, isn’t it?” \n“Maybe, or at least until you think about it. Thomas Paine, right? The American Crisis, and all that.” \nSteve remembers sort of vaguely learning about Thomas Paine during school but can’t say that he knows how that pertains to Vietnam, of all things. It’s a little funny, in the bleak sort of way that anything is funny these days, that Captain America — is he still Captain America, even? — knows the pledge, and the national anthem, and pretty much nothing else in terms of his country’s history. \nMorita, though, is in a different boat. Steve remembers that like a lot of their generation, Jim actually headed back to school after they got home. “These are the times that try men’s souls,” he quotes, reaching back for the bottle. After a sip, he continues, “The summer soldier and the sunshine patriot will, in this crisis, shrink from the service of their country; but he that stands by it now deserves the love and thanks of man and woman.” \nSteve nods, pulling the rest from his memory. He did read this, but it was a really long time ago, on a class trip to the Smithsonian with Kat’s fifth grade class. “Tyranny, like Hell, is not easily conquered,” he finishes softly. “So if the summer soldier shrinks away from the truth…” \n“The winter soldier accepts accountability,” Jim agrees. \n“I’m proud of them, then,” Steve decides. \nJim slants a smile at him. “No matter what you think of yourself, I think it wouldn’t hurt them to hear you say that. Even if most of them got the draft instead of enlisting, like you.” \n“Well, it’s not like none of us got the draft, even back then,” Steve replies, and then goes ahead and starts stumbling all over himself. “I mean, you know…even in our own company.” \nMorita looks at him quizzically. \n“I didn’t know either,” Steve hastens to explain, fiddling with the neck of the bottle. “You know, not until the letters in the paper and all, I had no idea that Bucky didn’t actually enlist.” \n“Oh,” says Morita, understanding now. “No, you see, I didn’t read any of those letters.” \n“What?” asks Steve, thrown. “Why not? They were all over the papers for an entire year.” \nJim eyes him. “Did you want those published? Did Barnes want them published?” \nSteve shifts. “I didn’t even — Jim, you know, I didn’t even know about them, not until they hit the news.” \n“Then there you go,” Morita says, nodding sharply. “I figured it was private. Between you and him and no one else, even if nobody agreed with me.” \n“But it’s — I mean, you —“ Steve huffs out a breath, uncomfortable as hell, and finishes, terrified, “It doesn’t — bother you?” \nMorita gives him that glance again, a kind of centered, examining look on his face. “All the things I went through before I shipped out, all these years of people staring down their nose at me, and then seeing the same thing happen to innocents in Germany, persecuted and murdered just for being who they happened to be, it would be a little hypocritical of me now to give a damn about you and Barnes being that way, don’t you think?” \n“I don’t know,” Steve says, honestly.\n“Well, I do,” says Jim, “And it isn’t just that. You and him, you were the two best CO’s a soldier could ask for. And you’re a damn good friend to boot.” \n“Thanks, Morita,” says Steve, a little hoarse. \nMorita keeps on studying him. “They really fucked with you, didn’t they? Whatever Barnes wrote to you?” \nSteve has a deep drink of whiskey and wishes, not for the first time, that it still worked the way it used to. He gives a dry laugh. “Yeah, I guess you could say that.”\nWhen Jim waits, Steve continues, bolstered on by the silence. “I just — I realized a lot of things, after I read them.”\n“You’re not with Peggy anymore,” Jim observes. \n“Haven’t spoken in a while,” Steve admits. “She, ah —“ \n“Kicked you out?” \nSteve’s surprised into a laugh. “Something like that, yeah.” \nJim gives him a smile in return. “You ever thought of…I don’t know, writing him back? You think it might help?” \nThat hasn’t crossed Steve’s mind once. “I’ve been, you know — I draw a lot, try to get it out of my system.” \n“I’m a shit therapist,” Jim says, “But I know enough to think that might be a good idea.”\nThe silence is, by some miracle, not uncomfortable, and they pass the bottle back and forth a couple more times. Steve searches his memory for the rest of The American Crisis that he had hung back to read during that field trip. If he thinks hard and tries to picture it on the dark canvas of the sky, he can remember it word for word. Let it be told to the future world, he reads from his memory, that in the depth of winter, when nothing but hope and virtue could survive, that the city and the country, alarmed at one common danger, came forth to meet and to repulse it. \n“Getting chilly,” Morita says, after a while. He nudges Steve’s shoulder with his own, and after a few more drinks they had back in. Steve doesn’t sleep a wink that night even though the guest bed is all kinds of comfortable, but he does shave, and after that cooks a big breakfast for the family and high-tails it out of there by noon.\n \n \n \n\n1972\n\n\nCAPTAIN AMERICA ARRESTED — REFUSES TO ACCEPT BAIL! \n\n—\n“I swear to God, you little shit, you just go lookin’ for trouble,” Bucky told him once in ’41, getting ready to set Steve’s steadily bleeding broken nose. Steve glowered up at him through two black eyes and Buck just looked disapprovingly back. “You’re a punk, Rogers. Now hold your breath and don’t move, for Christ’s sake.” \nSteve, of course, jerked away at the pain, and they didn’t get their security deposit back due to all the blood that ended up being impossible to get out of the carpet, and it wasn’t half so bad as it looked, really, stopped hurting in less than two weeks. But not even the serum could fix the crooked beak that Steve’s got as a result of Bucky’s lacking nursemaid skills. He could sew up wounds daintier than any lady, could Cap’s steady-handed Mrs. James Buchanan Rogers, the Commandos used to joke. But setting bones was just never Buck’s forte. \nThis is what Steve thinks about as he kicks around in a holding cell with a bunch of other protestors from the demonstration that got them all in trouble in Manhattan, offering a crumpled-up handkerchief to a bulky dark kid with a busted nose that just won’t quit bleeding. Steve doesn’t think it’s broken, but he knows it’s got to hurt like a son of a bitch. \nThe demonstration started in Suffolk County outside a police station. Steve was only passing through, dithering around on the Coast, too chickenshit yet to decide if he wants to brave the streets of Brooklyn after all this time, weighing the pros and cons for weeks now: will the familiar neighborhood accent outweigh the crushing loneliness, or will it just make everything that much worse? And then Steve saw the signs, some group calling themselves the Gay Activists Alliance. They were marching on a police station that arrested two of its own officers for sodomy.\nOne kid, real young, her hair parted down the middle wearing a fashionable dress, all flowing and white beneath a big coat, was holding up a big sign. On it was Bucky’s photograph, the one of him in his uniform that was printed in the papers. She had painted on it in big black letters, “SHOW SOME RESPECT.”\nAnd what was Steve supposed to do in the face of that? So he joined the gathering crowd, and when people started to recognize him he smiled a real smile and shook their hands and returned the odd salute. The girl holding the sign introduced herself as Casey and blushed when Steve thanked her, his voice mostly working, and blushed even harder when he kissed her on the cheek. And when the police came out and told them to stand down and even started waving their nightsticks around, they didn’t move. And when Steve got pushed up against the wall with twenty other protestors, got his legs kicked apart and cuffs slapped on his wrists, even though he easily could have broken out or pulled rank he didn’t, and now here he is, adrenaline still pounding in his veins as he bends over this bleeding kid and waits for his turn for a phone call. \n“You put up a hell of a fight,” Steve comments. The kid does; he didn’t pull any punches with the officer who started hitting him. The officer didn’t get reprimanded for it, no guesses why. The kid gives him a wry sideways grin from underneath the stained handkerchief. \n“That’s really somethin’ coming from you, Colonel,” the kid says. \nSteve knows his accent, a little faded but recognizable all the same. “Hell’s Kitchen?” he asks.\nThe kid nods. “Good ear. Born and raised in Clinton.” \n“Brooklyn,” says Steve needlessly, but the guy doesn’t laugh at him, just nods. “You’re military?” he asks, already knowing the answer. \n“Sure am. Was, I guess. I just train kids now. Back from ‘Nam for good, God willing.” He salutes, a little sloppy considering the way he’s got his head tilted back to stop the bleeding. “First Lieutenant Nicholas Fury, sir, it’s a pleasure to meet you.” \nHe’s young to be a First Lieutenant, Steve thinks, or maybe Steve is just getting old. He returns the salute anyway. “So what brought you here?” \n“I used to work at Suffolk County Station,” Fury replies. The bleeding at least has stopped, but he’s still speaking thickly, and he has to breathe through his mouth. Steve remembers vividly that feeling. “I spent a summer traveling around the state, looking for odd jobs. Got sick of Hell’s Kitchen. So I got work here for a summer, just filing papers, stuff like that. I was seventeen, never bothered finishing school; didn’t know if I wanted to sign up or join the force yet. Long story short, I knew the guys who got arrested. Good officers. Officer Perry, he wouldn’t let anyone hassle me, and I appreciated that. I was just passing through, going to visit my Granddad back home. Saw the protest. Figured if anyone deserved me backing him now, it was Perry.” \nSteve nods, impressed. \n“What about you, if you don’t mind me asking?” Fury says. \nSteve shrugs, taking a seat on the concrete bench next to him. An officer comes in to let the next person out for their call home, and Steve contemplates his response while the man shuts the door and locks it again. “You’re a smart guy, Lieutenant,” he says carefully. “I’d think you’d have it figured out.” \n“Yeah,” Fury agrees, looking at him sidelong. “Yeah, you know, I guess I do have it figured out.” \nHe grins at Steve then, and holds out the handkerchief. “Guess you won’t be wanting this back, huh?” \nSteve is startled into a laugh. “Not really,” he admits. \nJust then the officer comes back, opening the door and pointing to Steve. “You’re up,” he says. Steve, who already knows the media’s going to be up in arms over this, has decided not to worry anyone else about it. He got himself into this mess, and he’s not about to call Peggy and ask her to come bail him out. Calling Stark is entirely out of the question. Calling Kat doesn’t even cross his mind; she’s busy as hell with her internship at Stark Industries and doesn’t need any kind of distraction.\n“Pass,” he says. \nThe officer is visibly surprised, and then uncomfortable, and then even more uncomfortable when he directs his attention to Fury. “You, then,” he says. \nFury shrugs. “Nah, I’ll pass too.” \nSteve looks over at him, raising his eyebrows. “Nobody to bail you out?” \n“Not in particular,” Fury replies. \n“Listen,” Steve says after a second. “If your CO’s are pissed that you spent your leave letting cops off easy —“ Fury grins again, “I’ll give you a number to call once we get out of here. I think you’re suited to the kind of jobs they’ve got.” \nFury raises an eyebrow. “Are you recruiting me?” \nSteve shrugs shamelessly. “Sure am,” he says. “You’ve got something in you I haven’t seen in a long goddamn time, kid.”\n—\nPeggy — God knows how she tracked him down — calls him in his motel for the first time in a good few years to yell at him. She only yells when she’s worried. It’s the first time he’s heard from her since Kat’s graduation from MIT last year, where she kissed him on the cheek and looked at him with sad eyes. He asks how she likes Lieutenant Fury; when she doesn’t say a word, he tells her he’s missed the sound of her voice. She says, “Well,” and hangs up on him. He smiles for the rest of the week. \n \n \n \n \n1975\nSteve goes to see Kat and Joseph Morita the first Christmas after they are married, and they’re just — just glowing, really glowing. Kat stuffs him full of food (which Joe cooks) every chance she gets, because she’s gotten it into her head that if she just feeds him enough he might be okay. She’s not far off: Steve still has a very strong ‘food = happiness’ reaction from growing up poor in the Depression and then not eating so well sometimes when he was on extended missions with the Commandos.  \nHe’s also glad to see Joe treating Kat well, not that he really expected anything else. Joe’s a good kid, and anyway, he has no doubts that Jim would tell him off before Steve ever could if Joe was doing something wrong.  \nJoe and Kat have a cozy house in rural Virginia, while Steve mostly stays in hotels and the occasional apartment, and Peggy, last he heard, had moved out of their old place to an apartment closer to SHIELD headquarters, so it seems pretty natural that they would all meet up at the kids’ house. \nSteve, however, clearly didn’t think about this until Kat walks into the kitchen and announces more to Joe than to him, “Okay, Mom’s coming on Christmas Eve and staying through New Years. Here’s a list of all of her favorite foods, pick like… three, and I’ll help you make them.”  \nIf Steve had realized this when he agreed to come for Christmas, he might have said no. Peggy deserves to spend time with Kat and Joe without feeling uncomfortable, the way he’s sure she did at the wedding in July. \nStill, he’s here now, and when he offers to leave Kat gives him an excellent glare, backed up by her husband’s snort, and says, “Dad. If I thought I couldn’t handle awkward-land with you and Mom, I would have told one of you not to come, or to come for New Years, or something. I can handle it, Mom can handle it, everything will be fine. If you two can’t find something to talk about I’ll start rambling about my latest scientific discoveries and you’ll be so bored you’ll be forced to speak to each other. Trust me. I have a doctorate.” \nSteve suppresses a smile at that, nods, and tells her, in complete honesty, “Yeah, well. You always were my little genius.”\nKat smiles, offers him a slice of the mincemeat pie she knows he loves, and shoves it into his hands him before he can wave her off.  \n—\nThe day before Christmas Eve Joe pokes his head into Kat’s office, where Steve is sketching silently and Kat is working unnecessarily on some project or another. He looks at both of them, nods, and then announces, “Okay: Kat, I need to go grocery shopping for some stuff you put on your mom’s list, and Steve, you wanted some of that eggnog you’re so finicky about picking. I was gonna let you off the hook, but you both are obviously introverting so hard you’ll soon forget how to speak, so you’re coming with me.”\nKat and Steve exchange looks, glance at Joe, look at each other again, and get up. Joe has this look on his face that scarily reminds Steve (and probably Kat) of Peggy when she isn’t going to take no for an answer, and suddenly Steve finds himself looking forward to Peggy’s arrival tomorrow, if only to see how she and Joe get on.  \n—\nHaving offered to drive, Steve can’t really take his eyes off the road long enough to figure out what kind of conversation Kat and Joe are having with their eyes and little gestures, but he can tell that they’re probably about to tell him something he’s not going to like. \nBefore they walk into the tiny grocery store, Kat puts a hand to the middle of his chest, and, not quite able to meet his eyes, whispers, “Dad. People around here… they don’t always like us so much.” \nShe must see the quizzical look on his face, because she goes on. “You have to promise to let us deal with this our way, okay? Don’t — don’t say anything, or, ah, punch anyone. They’re not gonna hurt us, they just don’t like us, so we’re just gonna go in the store, and get what we need, and leave, and probably sing a song. You can sing along if you want, but I don’t know if you know the lyrics, so don’t worry about it.” \nSteve is still extremely confused, but he can tell it’s important to her, so he says, “Yes ma’am.” \nKat, recognizing their ritual instantly, gives a watery laugh and follows up with, “Thank you, sir.”\nThey’ve only just walked in the store when Steve begins to understand. The cashier looks up at the sound of the bell, then looks down as fast as he can, like he never saw them in the first place.  No hello, no how can I help you, nothing. Not even eye contact. Ahead of him, Joe takes Kat’s hand and they both grab baskets, then head off together into the store to find what they need. Steve follows slightly behind, watchful.  \nJoe gives Kat’s hand a tug and she follows him into the spice aisle, where a man stands puzzling over a grocery list probably given to him by his wife. He looks up when he notices their approach, then scowls and grumbles “fuckin’ Japs” under his breath.  Steve wants to yell, wants to shout and maybe punch the guy, but he remembers what Kat asked of him and instead watches his daughter and her husband. Kat glances at Joe, and they both begin very quietly singing. If not for Steve’s serum-enhanced hearing, he wouldn’t have been able to make out the words, but he can, and they are: \n\nCome mothers and fathers\n\n\nThroughout the land\n\n\nAnd don’t criticize\n\n\nWhat you can’t understand\n\n\nYour sons and your daughters\n\n\nAre beyond your command\n\n\nYour old road is rapidly agin’. \n\nThe man in the aisle glares at them but grabs what he came for and storms off. Kat and Joe keep singing; having started in the middle of the song, they soon get to the end and start back up, this time at the beginning, and keep going as they walk through the store, as though the glares and grumbles of those in the store are merely musical accompaniment.  \n“For the times, they are a-changin’” indeed.\n\n—\n\nPeggy arrives for Christmas Eve, and they seem to get along. They actually inadvertently have a few decent conversations, but neither of them are really focussed on the other, which in hindsight Steve guesses might be a good thing. Too distracted to pay attention to whatever’s between them, the love and the fights and the betrayal, they forget to be stilted and instead fall back, so far back, into their comfortable quiet and their quick banter. \nSteve can’t say he knows why Peggy is distracted, but it isn’t for the same reason that he is.  The cause of Steve’s distraction is Kat and Joe. Specifically, how he forgot that even his daughter and her new husband could have anything to teach him. But they’ve taught him this: he’s forgotten how to stand up for himself.  \nAfter the grocery store, Steve watched them quietly, trying not to stare and make his daughter wonder why he was suddenly all glare-y, but he does, he watches, and he wonders what it’s like to be them.  \nSteve used to stand up for the things he believed in, for himself, and he used to be breakable.  He used to get beaten up in alleys and thrown bodily out of bars, and it wasn’t difficult for the people doing the beating and the throwing. But he would stand up anyway, again and again and again, and still he would be knocked down.  \nSteve thinks maybe he’s forgotten how to get up again. He’s stood up for things, sure, but nothing has knocked him down in a long time, not since Buck’s letters and all the disaster that followed.\nSteve is pretty sure he hasn’t quite gotten back up yet. \nMaybe it’s time he remembers how to stand on his own.  \n \n \n \n\n1976\n\nTwo days after New Years, while Kat is working on some project-gone-wrong and Joe is taking a call about the potential effects of a power outage on one of his computing machines, Steve realizes that he needs to leave soon and also that he needs a new jacket. He also needs at least one new pair of pants, and probably a good hat, and gloves if he can find them. He turns to Peggy sitting in the comfy chair next to him and wonders if he should interrupt her reading to ask her if he could borrow her car for a quick trip to town. \nPeggy, having long practice with Steve’s considering silences, puts down her book and quirks an eyebrow at him.\n“Sorry, uh, I was just wonder if maybe I could borrow your car? I kinda need a few things from town and I don’t want to interrupt Kat or Joe when they’re doing their intense… working… thing.”\nPeggy smirks at him.  “You can’t borrow it, no, but I’ll drive you into town and go shopping with you.”\nSteve considers this silently for a second. Then he nods. “Sure you won’t mind?”\n“I’m sure.”\nThe drive into town is silent except for the moment they pass the only other house on Kat and Joe’s long driveway — through the bare branches of the trees it’s easy to see the roof, where Christmas lights have been arranged in the unmistakable form of an American flag. They both try to suppress snorts, then end up giggling like children, and Peggy asks, gasping, “Can you imagine how much work it must have taken to get those lights up there?”, to which Steve can only shakes his head and laughs more. \nSteve tells Peggy to pull over when they get to a thrift store, which, along with army surplus, is where Steve gets most of his clothes these days. Peggy kind of rolls her eyes but follows him in and watches as he goes through racks of clothes anyway, holding things up to see if they’ll fit, and then shoving them into the basket. Steve is no good at shopping. Peggy knows this intimately.\n“Go wander,” she commands after a bit. “You need a jacket and trousers, correct? And a hat, too; the one you’ve been wearing is a bit beat up. I’ll meet you at the changing rooms.”  \n“And gloves, if you can find them,” Steve says, cowed. Peggy nods and turns away.  \nWandering the store, he sees a bookcase and decides to make a quick stop to see if there are any good novels. Nothing good he hasn’t read, but he does find a beat-up Vietnamese phrasebook, and he wonders how long it’s been there — what soldier left with it and came back, or didn’t come back; what soldier didn’t want the reminder of war anymore. Steve understands. He still flinches sometimes when he hears German, and can speak it pretty well for someone with no formal training, even though it’s only with a pretty heavy focus on phrases like “give me the location or I’ll shoot.”\nSteve doesn’t think about buying the book, but he also doesn’t put it back, only wanders to the changing rooms and sits on a bench to wait for Peggy, which reminds him of all the times Peggy and Kat dragged him shopping in much better places than this, places that didn’t feel like home and always charged too much, but which he put up with because Peggy and Kat liked them alright, and it was the dad thing to do.  \nTo pass the time Steve opens the book and starts reading, committing phrases to memory. He creates a vocabulary out of thin air, trying out pronunciations till he think’s he’s got it pretty right.  In his head a world passes before his eyes, the world of the first war to be so publicly televised. A war so unlike to his own war, and yet a war so terribly familiar. \nHe thinks of Bucky getting the draft and never admitting it, and he wonders if they wouldn’t have fled to Canada too, had the battlefields of Europe been flashed in front of their eyes day after day on a TV before they even arrived.\nSteve’s quick brain puts together the dots of this new language, just the way it once captured the locations of HYDRA from a glimpse of a map. \nPeggy arrives when he’s still engrossed in the last pages of the book. She cocks her head to the side at his intense expression, and says, amused, “Now I know where Kat got her ‘intense… working… thing’.”\nSteve only looks up, wide-eyed, and says, “I think I need to go to Vietnam.”\n“Fantastic,” replies Peggy, long-suffering. “Now I really know where she got it.”\n \n \n \n \n\n1977\n\nSouthern Vietnam is dry in the winter, just the opposite of that wet cold that Bucky hated so bad about Europe. Steve had done some reading before hopping a plane here, but he can’t say he was expecting this kind of weather — that reading was mostly about the clothes he should bring and what gestures not to make, and a few more language books because really, one phrase book was not going to get him through when he was all alone. \nAnd he is all alone. This isn’t unusual, but he doesn’t think he’s ever actually been alone before in a foreign country.  \nSouthern Vietnam is dry in the winter, and wet in the summer, and Steve had not expected that.  \nSouthern Vietnam is riddled with land mines and people who don’t trust him for very good reason, but he speaks Vietnamese pretty well even though he butchers the dialects fabulously. So the locals get to laugh at his pronunciation, and his earnest way of learning when they correct him, and pretty soon people mostly like Steve. Which is good, because otherwise he wouldn’t get fed.  \nAdmittedly, he is pretty useful, because he can pull livestock out of muddy rice paddies on the occasions when they get stuck, and move lots of bags of rice, and whatever else, but you have to get people to trust you at least a little before they’ll take you up on your offers of help.  \nSpeaking of people and land mines, he has to be told by the locals of wherever he is where not to go all the time, and there are still accidents among the people who supposedly know this land. People lose limbs like Bucky used to lose nuts and bolts working in the garage — all the time, and unnecessarily.  \nSteve never liked bullies, didn’t matter where they were from. \nThe mines were planted by both sides. \nHe thinks of Morita telling him maybe he should write a letter back to Bucky, see if it would help. He can’t think of much to say and there’s not a scrap of paper out here to spare anyway, but when he thinks about it, thinks of writing home, it goes something like this: \n\nI know I will never find every mine, because hell, the villagers may never find every mine, and a hundred years from now there may still be land mines beneath farmers’ feet. But for the time being, on the days when they trust me, they tell me where not to go because there are explosives there, and so I walk to the edge of wherever that place is — and it’s always too close to someone’s house, it’s always land they could be farming for the starving stomachs of the children who also know where the land mines are — the children, who come to watch me as I stand on the edge of the place where the land mines are. And there, I throw heavy things and watch the explosions, and think about my birthday in the summer, and I remember how sometimes explosions represent freedom and sometimes, well, sometimes they’re just feared.  \n\nFor a long time after he came home he’d jump six feet in the air every time he heard a firework. Nobody but Peggy knows that. He spent a lot of birthdays in the basement with the record player turned up high. \nSouthern Vietnam is dry in the winter, and when the rice isn’t growing, Steve detonates land mines, hurling heavy things sometimes very great distances and watching holes get blown into the earth.  \nSometimes he wishes his shield wasn’t in storage, because he could hurl that too. \nSo when he can Steve stands up from the dinner table, thanks the family of this week for the food, and walks to the hill to set off bombs again. There’s a pile of heavy things waiting for him. Isn’t there always?\nSteve stands up.  \n \n \n \n\n1980\n\n\nThere are a bunch of stories in this world. I know this because I slept through every single one of them in school with you snoring away right beside me. Long stories, short stories, ghost stories. Sad stories and romance stories, parables, tall tales, and even the stories that have happy endings — And let me tell you, men on Mars make more sense to me than those do these days. \n\n\nI’m the story that’ll never get told, but that doesn’t much bother me. They’ll remember you which is as it should be. Just like me, they were caught off guard. Nobody ever saw you coming, not the army, not the country. You went and blindsided us all. And now that all the storytellers have got a hold of you, you’re gonna live forever. \n\n\nI remember maybe third day of Catechism when Sister Catherine said that each and every one of us are sinners and there wasn’t nothing to be done for it. And I believe it of me, hell yes I do — I’m a killer, stone cold. Some people are good at math and some people are good at art, but me, I’m good at shooting, and it scares me right to the bone the things I’d do for you. When they turn me away from the pearly gates I imagine they’ll give me a list full of the names of the Germans I killed for you and won’t look twice at what I think about doing every time I curl up around you at night, sayin it’s just to keep warm. Because it’s fine and all to kill for your country, I think, but not quite the same when you’re killing for just one person in particular. \n\n\nAnd besides, I’ve got a whole laundry list of other sins, past even those. I’m a liar and a coward, and once I got the draft I burned the letter so that you’d never find it. I’m so God damn afraid to die, but it’s not for me. It’s because I can’t leave you alone in a world as ugly as this one. Somehow you don’t know it, but there’s no justice here, not anymore. All the word about the death camps. The shit Morita put up with before he shipped out. You took a knife to the neck last year and still you can’t see it, don’t understand that Hell isn’t some place underneath us, all filled up with fire and brimstone. Hell is right here, and I’ve been damned for a long time. \n\n\nI know you’re not alone without me anymore. You’ve got your girl and you’ve got the boys. I know you can take care of yourself, and it puts me at a loose ends, how you can keep safe on your own now. You don’t need me. Doesn’t mean I’m not still afraid for you, not scared shitless that this world is gonna eat you alive. \n\n\nBut at least now I understand, I think, the feeling you had when you talked about doing right by your country, because I don’t mind living in Hell if it means doing right by you, just the way I’d strip the boots off a million dead Nazis if it meant your feet staying warm and dry. \n\n\nI see you worrying your daddy’s rosary at night, the poor battered old thing, and I wonder how you can still pray. I went to confession a hundred times until I gave up on it, because no matter how many Hail Marys I recited in the dark with you laying next to me, it didn’t stop. Sister Catherine would spit on me because I don’t have much need for God out here, but I’m glad you do. I’m real glad one of us does. But you keep giving me those big sad eyes of yours, like I’m breakin your heart when I try to explain it to you, and so I’ll give it another go, just one last try, even if you’ll never know about it — \n\n\nAve Maria, gratia plena, get him out of this war, and if you’ve gotta take someone then take me, because I’ve got nothing real to go home to but he’s got a girl now and I can see the hope written all over his face when he sees her. Sancta Maria, Mater Dei, pray for us sinners, but don’t spend too much time on my immortal soul, because not even divine intervention can help me now. I know when to walk away from a fight and trying my damnedest not to need him was a losing battle. \n\n\nI won’t be in the history books; that’s for you. But I loved you first. As long as they get that right, I don’t care what they say. \n\n\n—\n\nThere’s a perpetual hush over Arlington that Steve remembers too well from the last time he was here, standing in this exact spot. \nThe grave is empty: there was nothing of Buck left to bring back. Steve falls to his knees before it anyway, the dusting of snow across the grass seeping through his pants. There are flowers all over it, and notes held down by rocks, and little rainbow flags pushed into the icy grass. Steve presses his fingers to the indented lettering.\nJAMES BUCHANAN “BUCKY” BARNES\nSGT\nUS ARMY\nSSR\nMARCH 10 1917\nAPRIL 1945\nPURPLE HEART\nWORLD WAR II\nThis grave is the only thing of Bucky left in this entire world, this grave and the letters Steve has shoved into his back pocket today. He traces Buck’s name, lingers on the base of the Y. There are a million things to say but he can’t think of a single one of them and knows that if he opened his mouth his voice wouldn’t work besides. So instead he kneels in silence and presses his forehead to the frozen headstone and learns the weight of regret. He knows what it is now to love someone for their whole life and then beyond. Time goes by slowly, but he’ll love Buck until time runs out. He’ll love Buck when he’s got his own grave here, and then he’ll keep on loving him, even after that. \nIt’s cold enough that his tears slow on his cheeks, and when they finally sink into the snow Steve thinks of drops in a puddle, of pebbles thrown into the Grand Canyon. It’s a long fall; a long way down. None of them really make a sound in the end. But he’ll whisper the one truth he knows into the abyss anyway — \nYou are the soul inside of me. Even now. Even though you’re long gone. \nIt counts for something. Bucky will be loved until the end of time. He’s the one who will make it into the history books that really matter. This love, it has counted for something.\n—\nSteve goes home. \nBrooklyn has changed in the years he’s been avoiding it. The accents have faded, for one, and for another the roach-infested building he and Bucky made their paltry home in is long gone, replaced by a nice-ish restaurant. Steve doesn’t mind so much, past the initial shock. These changes have no right to come as a surprise — he’s been away for forty years — but they do anyway, and as he wanders through the familiar streets and smells the familiar Brooklyn smells he feels incomplete, but at least now he knows exactly why. \nStill he eats at one of their old haunts that’s miraculously still standing, and then he sees some posters for a demonstration happening up in the West Village to raise awareness and education about AIDS, so he takes the B train there and stays for a night in an okay hotel and shows up early to the rally to help kids make signs that say “ACT UP — FIGHT AIDS.” They’ve got a big crowd going and when they start up even more join, holding up the extra signs that have been left out just for that purpose. The police force shows up, but Steve doesn’t think it’s going to get violent, at least not today. \nHe spots her bending down to pick up a sign. She’s just as beautiful as she was the day they got married, or maybe even lovelier, with thick streaks of grey in her hair and that same smile on her face. Down the way, she holds up her sign. He jogs to catch up with her. They march together. She reaches down and takes his hand. \n“I forgot how to be uncompromising in my beliefs,” she tells him. “I thought maybe if I came here you could help me remember how.”\n“Okay,” says Steve, his smile huge and uncontainable. “I want to do that. Peggy, I’d love to do that.” \nShe looks at him for a second longer, their hands still folded together as they walk. “I learned the word — bisexual. Is that correct?” \n“It is,” Steve says. It’s the first time he’s said it out loud. Around his hand, hers tightens. \nHe loves her. She knows now.\n \n \n \n\n1985\n\n“I want to dance with you,” Steve insists. Even from here he can practically hear Kat’s almighty eye roll. She’s been designated Christmas ham duty while Joe gets more eggnog and the grandkids hang out upstairs, and Steve’s put the radio on a station that plays all the old carols he and Peggy remember from growing up. \nPeggy narrows her eyes at him from her armchair. “I’ll break my hip, just you watch. Not everyone here is still a spry twenty-nine.” \n“He looks thirty-five at least,” Kat calls helpfully from the kitchen. The phone rings and she picks it up, greeting whoever’s on the line with a “Hey, kid,” which probably means it’s Stark’s son calling because he’s blown something else up in the MIT chem lab. Kat, who is has proven herself to be a master at cleaning up Anthony-call-me-Tony’s chemical, mechanical, and explosive messes, chatters away while waving around a spoon, likely letting dinner start to burn. This is why Joe cooks. Kat might be a scientist, but she generally finds following directions on the mashed potato box to be very boring. As she talks, Steve wonders briefly what it means that Tony is calling them on Christmas. Sure, Steve likes him, and so does Kat, and Peggy’s got herself years of Stark-wrangling experience, but it seems… odd. \n“Come on,” wheedles Steve. Peggy relents, smiling, and he tugs her to her feet and wraps her up in his arms, swaying her gently. He’s too goddamn lucky. He doesn’t deserve her, and he thinks about it every day, and thanks God double that. “My best girl,” he murmurs into her hair. If there’s one thing Steve’s learned, it’s that the heart is huge and cavernous and big enough for two, and he loves Peggy the way he’s never loved anyone before or since. \n“Ugh, yeah, my parents are just being my parents,” Steve hears Kat say to Tony. Thirty-seven years old and they can still embarrass her; it’s amazing. Peggy muffles her laugh into Steve’s chest. \n \n \n \n\n1991\n\nPeggy’s been retired for years now, passing the mantle on to new directors. She’s out this evening, though, staying late to consult on an issue concerning an undercover op in Stalingrad. Steve takes a shower at around 2030, and by the time he gets out there’s a message on the landline. \n“Rogers, listen to me,” it’s Stark’s voice, sounding tight and panicked in a way that Steve has never before heard. He thinks at first that Stark must be drunk, knows that there was some kind of function tonight — a gala, a fundraiser, something of Maria’s? — but his speech isn’t slurring and he hasn’t started yelling. Steve and Howard haven’t spoken past civilities in thirty years. “I was — we were wrong. We fucked up. I need you to phone when you get this. Peggy —” \nSteve frowns at the machine. The light blinks; there are no more new messages. He presses the button again to replay, wondering if the recording was cut off somehow. \n“Rogers, listen to me. I was — we were wrong. We fucked up. I need you to phone when you get this. Peggy —“ \nThat’s it — there’s nothing more. Stark is scared, Steve realizes. He’s spooked. Steve hits the button one more time to make sure, already digging in the drawer for the address book so he can get the number for Howard’s private line. \n“Rogers, listen to me.” \nThe phone rings just before Steve can begin to dial. \n“Stark?” Steve answers. \n“This is Special Agent Alexander Pierce,” the man on the other line says. “Colonel Rogers, Margaret Carter has asked for you to come in.” \n—\nThe site of the crash is lit up under floodlights and surrounded by police tape. It’s past midnight now. Peggy is speaking in low tones to Pierce, a man of maybe Fury’s age whose name Steve has heard before in passing. Steve circles the crash. The bodies were removed two hours ago, but the vehicle is still here, too big to take and still in need of being analyzed. The roads are covered in deadly patches of black ice, and it’s easy to see how the car could have spun out of Howard’s control, especially if he had spent the night at the bar. \nSteve hasn’t told anyone about the message. SHIELD has marked time of death as being within  the hour of 2000. The message Steve got was timestamped 19:45. \nThere’s nothing wrong with the car that anyone can find. Steve snaps on gloves and checks it over himself. It flipped onto the driver’s side but never ran off the road. It didn’t impact against anything except the guardrail, and the only way Steve knows it hit there is because of the sizable dent in it. The wreckage itself is right in the middle of the road; Stark hadn’t been driving on the highway. And why would Stark take a back alley route home, anyway? Unless he  thought —\nThere’s nothing wrong with the engine of the car, so far as Steve can tell. Buck was always the mechanic between the two of them, though, and Steve really can’t differentiate much outside of the very basics. The brakes weren’t cut. There are tire tracks on the road like Howard slammed the car to a stop. It makes sense if he had been sliding around on the ice, trying to regain control of the vehicle. It also makes sense if there was something blocking his way forward. \nThe passenger side door is torn off cleanly at the hinges. The door itself is feet away. \nIt could have come off when the car flipped.\nBut how can a closed door come off when a car is flipped? \nSHIELD medical declared cause of death to be blunt force trauma. Maria went through the windshield. Or at least the windshield was broken and they found Maria spread out on the road. Howard smashed his head against the steering wheel, which is covered in blood. \nSteve tries to map it out in his head. The car hit ice, Stark hit the brakes. The tires skidded across the pavement and the vehicle stopped abruptly. Maria — who must not have been wearing a seatbelt — went through the windshield. Stark’s head hit the wheel. And then the car flipped? Or they hit more ice, but that’s impossible, if Stark was already dead. Steve tries again: Stark hit the brakes, cracked his head; Maria went through the windshield. Maybe Stark’s foot was pressed on the gas; the car hit more ice, flipped. The passenger side door…\nThere is glass from the windshield inside the remains of the car. Too much glass. So much glass that it looks like the windshield was broken from the outside. \nThe wind picks up, whipping the snow in flurries around the site of the crash. Maria’s blood is all over the asphalt, steadily being covered in white. \nThe day of the funeral it doesn’t snow, but the air is cold like ice and Steve’s nose goes numb. Peggy doesn’t shed a single tear, but her back is ramrod straight. She’ll miss him. Kat doesn’t cry either, even though she keeps looking around, worried, through the entire service — it’s all for nothing, though, because Tony never shows.\nAfter the wake Steve impulsively deletes Howard’s message from the machine before Peggy can hear it. He can’t even justify to himself why he does it — he isn’t sure. But he does it, and jumps about six feet when an incessant banging starts on the door a moment later. \n“I’m really only wondering one thing,” says Tony Stark. It’s like talking with a ghost, Steve swears to God, the ghost of Howard Stark from 1943. The voice, the face, Christ, even the eyes. Except the Howard Stark of 1943 never got higher than a kite, which Tony definitely is — his pupils are blown and he looks like if he wasn’t leaning against the doorframe he’d topple over onto Steve’s feet. \n“Is it true that she was the mistress?”\nAnger boils hotly in Steve and he says, “Now listen here—” just as Peggy sweeps up behind him. \n“No,” she says. “Astonishingly, it is possible for a high-ranking female operative of the British armed forces to earn a prestigious title at the head of an intelligence agency without fucking anyone to get there. Are you coming in? It’s snowing.” \nTony blinks wordlessly, opening and then closing his mouth. There isn’t much to do when Peggy speaks to you like that, and so he comes in from the cold.\n \n \n \n\n1998\n\nTony Stark has been “Tony fucking Stark” in Steve’s head and between him and Peggy for four years when Tony announces that he’s throwing Kat a surprise 50th birthday party. Steve’s not entirely sure how it can be a surprise since Kat is one room over when he makes his announcement, and he really doesn’t do it quietly. Ultimately it’s probably all for the best, as Tony is really, really bad at keeping secrets. This way, Steve figures Tony can pretend he kept the party a surprise and pretend to be mad if she doesn’t act surprised, all the while not feeling the pressure of, you know, actually keeping a secret. This is how Tony fucking Stark works; they don’t pretend to understand.  \nHe asks for a list of all the people who should be invited to a 50th birthday, and while Steve hasn’t been to all that many birthday parties, much less 50th ones, he figures he can come up with something.  \nTurns out he’s completely wrong. Steve’s first inclination when faced with a blank sheet of paper is to doodle, to sketch little balloons and birthday cakes and streamers, all the things he remembers from Kat’s birthday parties as a little girl. Unfortunately for Steve, Kat’s childhood friends do not live down the street from them, nor are they even still her friends. That’s generally what happens when you grow up — you grow apart. Steve wouldn’t know, he acknowledges to himself, and only a little glumly. He only had one friend growing up, and now that only friend is dead.  \nHe shakes his head, draws another balloon with a little figure dangling off the end, hanging by one hand, a fluffy cake below.  \nSteve flips the paper over and starts again, first with Kat’s husband and her kids, because that’s easy.  \n1. Joe Morita\n2. Jamie Morita\n3. Tim Morita\nThen he doodles Jamie-girl at a table with her three namesakes, Grandpa Jim, Bucky, and Falsworth, chuckling to himself as he adds the two Tims scheming in the corner. At this point Steve is nearly out of paper, so he adds Kat’s doctoral advisor who she still keeps in touch with and Janine plus all of the other roommates Kat got along with, which is a surprisingly large number. Steve supposes that with parents whose personalities are as strong as his and Peggy’s, Kat had to learn how to get along with people. She’s an excellent mediator; very good at talking the kids out of Tony’s crazy plans.  \nAt the very bottom of the page Steve doodles himself holding the shield against an onslaught of party decorations, and writes, in his best comic-style calligraphy, “HELP.  DON’T KNOW WHO KAT STILL LIKES OR HOW TO PLAN PARTY”, sets aside his pen and leaves the list out for Peggy to find.  \n—\nDespite the fact that Tony fucking Stark technically planned the party, it goes surprisingly well.  Joe managed to get his dad to come up to DC for once, and Peggy gets Gabe Jones to attend as well. (Steve would suspect blackmail of some kind if he didn’t know Gabe so well.) No one gets horribly drunk, though everyone besides Steve is a little bit buzzed, even Tim, who is technically underage. Tim likes to break rules in front of Steve and Jim; Steve suspects this is some inborn trait for his family, the urge to break rules. He doesn’t know if he’s encouraging this trait by not punishing it, or discouraging it by not giving it any attention.  \nAt some point in the night, Steve realizes that he hasn’t toasted Bucky with the Commandos for years. He looks over at Jim, who nods at Gabe, who turns and reaches for the bar, the bottle of Glenfiddich, the four glasses. \nJim, who has different words each time, whose voice cracks from age these days but still never anything else, is steady as ever when he says, “To Sergeant James Barnes, who would have liked a family big as this one.”\n \n \n \n\n2001\n\nSteve is on a four-week training detail to keep fresh on SHIELD protocol in prematurely-cold Montana, of all places, when he hears about it. The base he’s on is probably the most remote one SHIELD’s got in the United States, barring maybe locations in Alaska, which is still a newly minted part of the country to him. Because of this, they only get cell service on the fancy SHIELD satellite phone, which means the duration of each call is pretty limited.\nHe is waiting for Peggy to call, Barton sitting off in the corner with a badly affected air of nonchalance. One of his hearing aids, the left, Steve thinks, got trampled on the course this morning, and so, as Barton cheerfully announced earlier, his hearing is “completely for shit.” Steve doesn’t think that’s all that’s going on, though; Barton seems antsy about his turn with the phone, and it’s probably because he recently brought in a new recruit and he’s nervous about how she’s settling in. Rumor has it she’s the infamous Black Widow, but Barton calls her Romanoff most of the time, and some variant of Natasha when he thinks the others can’t hear. \nSteve is also pretty sure that Barton is certifiably insane. Still, he’s a better shot than even Bucky was, as much as Steve would never say it. Steve also kind of feels he should apologize to the picture of Buck he’s got stuffed in his wallet for speaking ill not of the dead, but rather of Buck’s much-lauded ability during leave to shoot a bottle to bits from increasingly improbable distances in increasingly improbable contortions, usually to the drunken laughter of everyone. \nFinally the phone lights up, but it’s with Kat’s name. Still, that’s not too unusual — Kat’s a busy woman with a career, a husband, and kids, but she makes time to go see her parents on occasion, and maybe she thought Peggy would be lonely with Steve gone for four weeks.  Steve answers, and barely gets out a hello when it’s — \nIt’s a bit like December 7th, 1941 all over again, the way the moment rushes up to meet him, like biting the pavement from a punch to the nose and knowing you’re going down, and yet somehow still not expecting it; the way his limbs turn heavy and cold with abrupt terror. \n“Dad,” Kat gasps into the phone, “Dad, it’s — really bad, it’s really bad. The Towers are just collapsing, they had — planes? I don’t know how they — they had planes, and they got the Pentagon — they’re at the Pentagon, tell me, oh God, Dad, tell me you’re not in the city —“ \n“Kat, Kat,” Steve says, firmly, and then gently: “I’m just fine. I’m alright. I’m in Montana, remember? Real far away. I need you to take a breath, okay? I love you. Breathe for me.” Kat does, he can hear her gasping slow through the tiny speaker, and he shuts his eyes tight and gives himself a second to panic. Over the line Kathryn’s calmed and so Steve makes himself calm too. She tells him, “Sorry. Okay. Christ, I can’t — I’m passing the phone to Mom.”\nSteve presses the back of his hand to his mouth, moves it away, and waits for Peggy to come on. He can hear the tension in her voice when she tells him what’s happened, what’s happened to his country, his city, his home. He knows she wants to be out there helping, because he does too, but he’s stuck in Montana and already knows there’s no way anyone is going to be flying, not after this. He closes his eyes and shakes his head as he listens. Barton has stopped pretending not to watch and is standing ready, because he’s good enough to know when something has happened and good enough to know when he needs to be prepared. \nPeggy’s voice is trailing off when she tells him, “Steve, you come home as soon as you can.  You come home to us, and then you go do what you can to help.”\nAnd Steve knows how that is, remembers how well Peggy knows him, because she was there a million years ago when he set his jaw and wouldn’t take no for an answer, and she knows she can’t stop him when he gets this way.\n“Okay,” agrees Steve. “I love you, Pegs, and tell Kat I love her too. I’ll be there as soon as I can.”  \nSteve hangs up and beckons Barton closer so he can hear.\n“Somebody flew planes into the World Trade Center and the Pentagon. We’re in for a hell of a ride, Barton.” \nA lot of things happen very quickly on Barton’s face. He swallows hard and says “fuck”, looking jarred and terrified. And then suddenly, to Steve’s shock, he straightens himself up and sets his shoulders, more serious than Steve’s ever seen him.\n“Call me Clint, sir,” he says. Steve recognizes that look in his eye; it’s the look all snipers get when they’ve finally sighted their target, and it’s now just a matter of time until that target is in range. That moment of perfect stillness.\nThis is what Steve is good at — not the spying, not the covert ops, not really even being a soldier. This is what Steve is good at: pulling people together, and holding them up when they need it most.\n“Tell everybody to pack up, and get the cars ready. We’re going to DC.”\nSteve takes a deep breath, and calls Fury’s line. He’ll be busy, but not too busy to deal with Steve Rogers informing him that he’s leaving Montana with 20-some agents and heading for clean-up duty. \n—\nTony is the next person who calls him, getting through once they reach the nearest town.  Tony likes explosions as much as Howard ever did, or possibly — terrifyingly — more, but he also likes people about ten times the amount that his father did, which is probably why he can be so difficult to deal with. That’s not to say that Tony will ever admit to liking people. From experience, Steve has decided that he infinitely prefers this to Howard’s method, which was to hate people privately and put on a very convincing show of loving them publicly.\nTony doesn’t sound drunk, which is odd, and the conversation is short, which is also odd.  Normally Tony takes about fifteen minutes to get to his point, if not more, and that’s assuming there’s any point to begin with.\n“Tony?” Steve asks, after Tony’s said hi, and then nothing else. “Hey, son. You okay?”\n“Sure, sure. Yeah; I’m fine. Wasn’t in DC or New York or anything, I’m fine.” That’s not what Steve meant and Tony knows it, so he doesn’t give Steve a chance to interrupt. “Hey, you remember how I was thinking about shutting down some of the weapons lines ‘cause, hey, nobody’s using ‘em?” There’s a huff of laughter that doesn’t sound a whole lot like laughter. “Yeah, I’m probably not gonna do that anymore, huh?”\nSteve has to take a minute to think of what to say. “Tony,” he finally comes up with, a little careful, and trying not to sound careful, “You can do whatever you want with Stark Industries. It’s your company.” This is mostly the truth. It’s Tony’s name on the products, at least.\nTony’s response is stilted. “Yeah, yeah of course. But — well, I mean.”\nSteve, terribly, does. “I know, Tony.”\nTony hangs up abruptly, and Steve can’t say he really blames him. \nThey’ll be in DC in another twenty hours or so. Steve spends a lot of the drive there thinking of how he’s going to go to New York and do everything he can, which is more than most people, but still not nearly enough.  \n—\n\nNew York, September 14. —Amid rescue and clean-up workers yesterday was Steve Rogers, known also as “Captain America”, the World War II hero whose serum-enhanced body allowed him to perform superhuman feats of strength, and also to keep his youthful looks. Rogers’ past has been fraught with scandal, leading to, many claim, his reclusiveness over the last few decades. This is the first time since his arrest in 1972 that he has been seen in public, though he was not wearing the iconic Captain America uniform, instead working side-by-side with rescue workers and lifting rubble too heavy for one man and too delicate for machinery.  Regardless of his past, we here in New York City are glad to have our fellow New Yorker to help us out.  \n\n\n(Roberts, Josephine. “Captain America back in New York.” The New York Times 14 Sep. 2001. Print.)\n\n \n \n \n\n2004\n\nSteve is starting to get used to funerals. Dugan passed on first, then Falsworth and Dernier a few years later, and of course Stark died first in the crash back in ’91, whether Steve cares to remember it or not. Tony’s at this funeral, which Steve thinks is odd until he remembers how much Tony likes Kat. Kat’s supporting Joe through his loss, pretending she’s not torn up about losing Jim, and so Tony is probably hoping to help out Kat, distract Jamie and Tim, whatever — Tony’s a good kid, even if no one would ever admit that. Ms. Potts, Tony’s PA of four years, is also there, which Steve figures is a very good sign considering Ms. Potts always manages to keep Tony on a leash.  \nSteve keeps telling himself he’s getting used to funerals, but the truth is, he’s not.  And besides, when was the last time the funeral was for a member of his family? His mom’s funeral? Does Buck’s count, since Steve’s the one who got his flag? \nSteve has tuned most of what the pastor is saying out, a habit learned from years of Catholic school and Catholic church and apparently works regardless of denomination, but he catches the end when the man says, “And now Mr. Morita’s son would like to say a few words.”\nJoe stands, slowly lets go of Kat’s hand, and takes the microphone. \n“I remember when I first fell in love with Kat, the woman who would become my wife,” he says, voice sad, but also a little amused. “When I came home from our third date I had what must have been the most idiotic smile on my face, and dad took one look at me and said ‘oh, no.  You’ve fallen in love.’  I must have gone pretty pale at that point because he took my shoulder, sat me down, and poured me a glass of scotch. Keep in mind, my dad was not typically a drinking man, but he poured himself a glass about twice the size of mine before he sat down.” The crowd chuckles a little, sniffles a lot, and Joe keeps talking. Steve had no idea his son-in-law was so good at talking to crowds. “So my dad looks me in the eye, and he says, ‘Ace, people are gonna tell you it’s a bad idea to fall in love with Captain America’s daughter, and they might even be right, and they’re gonna tell you that falling in love with a white girl is gonna be hard, and they’ll definitely be right, but you remember this: Kat’s not just the daughter of a famous guy, she’s her own person, and so are you. You both keep that in mind, and you’ll be just fine.’  And then he tipped back his scotch, clapped me on the shoulder, and went to bed.  And that was my dad. He always remembered that people were people first, no matter what.”\nAfterward Steve and Gabe pour glasses of Glenfiddich, but they make no toasts, and keep the shot count to two.  \n \n \n \n\n2006\n\n\nIn the past year I have been afforded the privilege of sitting in on a class at Harvard University. It is a course offered only to upperclassmen in the English Literature department, titled “The Thirteen Letters: An Examination.” \n\n\nOver the course of the semester students were assigned to do close readings of at least five of the now timeless wartime love letters written by Sergeant James Buchanan Barnes. This means that students would approach Barnes’ letters as a complete literary work and analyze it as such, combing through the text for imagery, symbolism, and metaphor. This is groundbreaking, as it marks the first instance of Barnes’ letters being studied not for their historical or sociopolitical relevance, but rather purely for their artistic merit. After two days of auditing the class, I couldn’t help but wonder how no one had ever studied the letters in this way before.\n\n\nBarnes was no conventional writer. Public records tell us that he attended school until the seventh grade and then dropped out in order to find a job, as many boys of the time did. Despite this, Barnes’ grasp of the English language is by turns electrifying and anguished; he expresses effortlessly an entire range of human emotion, even with his lack of formal education, his poverty-stricken upbringing, and his age. \n\n\nSpeaking of age, James Barnes died in battle at a criminally young twenty-six after seeing combat for a little less than two years. This means that he penned his surviving creations between 1943 and 1945, arguably the most dangerous period of the war. His KIA status makes his vibrant account of love and loss all the more poignant. Had he lived longer, Barnes may have become America’s greatest wartime novelist. As it is, he unintentionally joined the ranks of O’Brien and Vonnegut with his unapologetic approach to the incendiary topics of violence and sexuality.\n\n\nEach hour in the classroom was focused on discussion, rather than traditional lectures. One day in late November, the homework assignment had been to prepare any kind of story detailing  your own personal experience with the aspects of the letters that had gained even more fame after being integrated into popular culture. Several students showed up in the familiar t-shirt with Barnes’  army photograph printed above a large, slanting repetition of “Love is love is love.” One senior brought a movie poster, signed by director Joe Wright, of the controversial 2002 film “Unrequited.” Memorably, near the end of class, another young man pulled up his shirt to show off a tattoo on his ribs that read in a simple font “I loved you first,” a beloved quote from Barnes’ final letter. He shared that he got the tattoo because his mother, who had died of breast cancer two years earlier, treasured the honesty and universality of Barnes’ letters.\n\n\nAt the end of the semester, Professor Alison Chen, to every student’s immense relief, made an announcement that there would be no final, cumulative or otherwise. Instead there was a small assignment: a one page paper, no longer than 1200 words, detailing each student’s emotional reaction to the letters as whole. I spoke to students after their last paper was due.\n\n\n“It was, in total honesty, I think the hardest paper I’ve ever had to write at this school,” one junior, a whopping double major in English and Engineering, told me. “I didn’t realize how emotional the letters made me, but over the course of the semester I just got so invested in this man’s story. He bared his soul, and so I wanted to be generous in return. It was so hard to keep it short enough to turn in and still express all that I felt.” \n\n\nShe confessed, laughing, that she ended up writing eleven pages, which she spruced up and submitted to the Harvard Crimson, where it will be published as an article in the spring. \n\n\nThere are two sides, however, to every story. Chen’s lecture series, unfortunately, could not fully address the other man who played an integral role in Barnes’ life, as very little is actually known about him. \n\n\nIt’s a question for the ages. Were these letters truly addressed to Steve Rogers? All evidence seems to point in that direction, even though Rogers has never spoken about the content of the letters, not even to confirm or deny if they were in fact written to him. \n\n\nAs for Rogers himself, he has joined in on a number of demonstrations made by the LGBT community. He is rumored to have donated huge amounts — anonymously, of course — to various LGBT organizations, and has championed in campaigns for HIV/AIDS fundraising, research, and education. The public, being the public, will continue to speculate. It seems increasingly likely with every passing year, however, that Barnes’ love was truly and tragically unreturned. \n\n\n(Hendrix, Naomi. \"The Thirteen Letters, Forty Years Later.\" TIME Magazine. Print.)\n\n—\nThe reporters just outside are raising all kinds of hell. Steve shifts where he stands, trying hard not to think of all the people out there. He hasn’t done a press conference since the ’60’s when he was still letting Stark use him as a mouthpiece, just after President Kennedy was killed. Steve’s hands aren’t shaking — they didn’t shake when he put the plane in the water, they didn’t shake when Erskine strapped him into the VitaRay — but he is, ridiculously, after sixty years in the public eye, nervous about this.\nBeside him Tony is texting someone lightning quick. Steve figures it was a good deal of blackmail and pointed stares on Kat’s part that convinced Tony to be here today, as neither Peggy nor Kat were able to, in a show of moral support. Or maybe just as a distraction. Knowing Tony, and knowing how Kat knows Steve, it’s probably the latter.\nTony snaps his phone shut and pushes it into his back pocket. “Sure you don’t want me to prep them for you? I could, hah, loosen them up a bit.” \n“Not necessary,” Steve grits. He doesn’t have any notecards. He has no idea what he’s supposed to say. He wishes for a ludicrous moment that he had his shield on him, not the one he still uses on the odd recon mission, but the old one, the one made of painted plywood that he used to tape his lines onto the back of. Jesus Christ, Rogers, thinks Steve. This is a bad idea.\nTony looks insanely uncomfortable. He’s not very good with words of encouragement, which is frankly no surprise, considering who tried to raise him. Steve berates himself again; he shouldn’t think ill of the dead, not even when he wants to turn tail and make a run for it. \nThe crowd outside saves Tony the trouble of a stilted emotional moment, though. They’ve settled, a silence hushing over them. \n“Well, get out there, Cap,” Tony says, slapping him on the back with his free hand; his phone has made an appearance again. No one has called Steve that in thirty-five years. “Kiss some hands, shake some babies.”\nSteve steels himself, squares his shoulders, and walks out. Cameras flash and someone, thank God for them, must have directed the reporters to stay seated Or Else, and so there’s no vicious clambering when they see Steve. A few hold out microphones. A few others tape recorders. The room is so quiet you could hear a goddamn pin drop. Steve is afraid to break the silence. \n“Hello,” he says, after a moment of hovering. His voice echoes hugely in the quiet room. “I haven’t…been around a lot. I don’t think my career choices are really what you’ve come to hear about, though.” \nIt’s not really a joke, but either way, it falls completely flat. Steve takes a breath, and says, “I think I better start at the beginning.”\n“I had a best friend, growing up. You all know about him. He was…Christ. I don’t even think I can explain him. I won’t do him justice if I try. He was — he was giving. Caring, funny. Real good dancer, to boot. The ladies loved him. We had a lot of burdens, growing up when we did, and with the war looming over us. But I remember that when he wasn’t working, he was out at the dancehalls, and when he was doing that, he was nothing but a carefree kid.\n“But the thing is, beneath that, like anyone back then who ever thought of someone of the same gender in a romantic way, he was scared as hell. You gotta remember, it wasn’t just frowned upon: it was illegal. Buck and me, we lived in a…well, a pretty open neighborhood, I guess you could say. But that didn’t make it any less dangerous for him, or for anyone else. A lot of people lived in fear.  \n“I didn’t know those letters existed,” Steve continues. He looks out at their faces. Most of them seem unfazed so far, as if they’ve been expecting this, and are now ready for Steve’s gently-worded confession that he’s straighter than an arrow and has a wife and a family to prove that in spades. Jesus Christ. Steve swallows. \n“I didn’t know they existed,” he repeats, “And if I had — if I had, my life would have probably been a whole lot different. For one, I wouldn’t have been so scared of the way I felt about Buck. I didn’t know it, not for a long time, but I loved him. And don’t — look, don’t misquote me, because I mean that. I was in love with him. I was in love with James Barnes. I’ve been in love with him for as long as I can remember. \n“I may not look it,” Steve continues, quiet now, “But I’m an old man. All the guys I fought with are dead, but I’m still here, looking about as old as my grandkids do. I see no reason to hide from it anymore, and I’ve had decades to figure myself out. I’m telling you in the hopes that I can help anyone who’s felt as scared or wrong or prosecuted as Bucky and I did. So here it is: I’m bisexual. My wife and I are still happy as anything to be together. I love her to this day, and I’ll always love her, the same as I’ll always love Bucky.”\nFor a long moment the room is silent. And then it bursts into noise and camera flashes and motion, and Tony comes to Steve’s rescue and causes a whole outburst of pandemonium on his own, waving an arm and smiling vaguely behind his sunglasses, giving Steve a free second to escape while his heart pounds in its chest like it’s trying to break right out.\n“Alright, alright — Jesus! None of you were this excited when my sex tape leaked —“ \n—\n“You didn’t tell me it was being televised,” says Peggy from her armchair when Steve finally comes home, having walked all the way back. Summer is creeping up on them, and he’s sweating a bit, at his forehead and the small of his back. He’s calmer now, the walk having helped him, the adrenaline wearing off. He pours himself a glass of water and refills hers before returning to kiss her on the cheek and sit at the corner of the couch closest to her. Wolf Blitzer is on mute, talking via Skype with a woman. The ticker tape reads CAPTAIN AMERICA CONFESSIONAL: “I WAS IN LOVE WITH JAMES BARNES.” Steve is just grateful she’s watching CNN instead of Fox. He doesn’t know what Bill O’Reilly has to say about this, but he can imagine. \nThe TV flicks off and Peggy turns her head to look at him. She smiles at Steve and he smiles back helplessly, relieved to be home and away from all those flashing cameras. There’s a reason, he thinks, that he’s been avoiding the press for so long. It’s even more exhausting than he remembered.\nPeggy reaches out and cups his face in her hand, the wistful expression fading from her face. \n“You look just the same as the day we met,” says Peggy softly. It’s a blatant lie; Steve, who finally has one entire gray hair, looks absolutely nothing like the skinny kid she first laid eyes on back in ’43. But Steve understands what she means, the way that two people stupid in love always do: she looks just the same to him, too. \n“Whole year older than you on the inside, though,” Steve replies.\n“Older, probably,” Peggy says. Her brow is furrowed now, and Steve clasps his hand over hers. Her eyes search his. “We were happy, weren’t we?” she asks, as though wondering at the fact of it. “Despite all of it, we were happy. I’ll never know how we managed that.”\nSteve’s throat closes up, and he says, truthfully, “The happiest. We were the happiest, Pegs.” \n“Was it worth it to you?” she asks.\n“Every single second,” Steve replies. “I wouldn’t have traded you for the world.”\nPeggy looks at him for a moment longer and then drops her hand from his face, curling her strong fingers around his. She takes a shaky breath, and Steve is concerned immediately, but she’s fine, only thoughtful. Her voice is rough when she speaks again. “In a moment I’m going to beg you for forgiveness, because I think it’s unfair of me to ask for it before I tell you. You were so brave today and it did nothing but remind me of my own cowardice.”\nConcerned now, Steve shakes his head. “What’re you talking about, Peggy?” \n“I’ve done terrible things,” Peggy says, hushed. “I’ve done terrible things, Steve. I’ve lied to you.”\n \n \n \n\n1943\n\nSteve’s red pencil is worn down almost all the way to the nub, but he only needs a little more to shade in the space just between the building across him and the beginning of the sunset. He takes a moment to shave at it with his pocketknife before bending back over his sketchbook, kicking his feet into the empty air below him.\nThere’s a commotion at the front door as Bucky gets in. Steve snorts to himself when he hears Buck step on the loose nail in the floorboard and let out a colorful string of curses for what must be the sixth time in as many days. Barefoot, Bucky climbs out the window Steve’s left open and joins him on the tiny fire escape. \n“That was a new one,” Steve comments. \nBucky hums and leans over to see Steve’s drawing. He smells like he always does after work, a mix of sea-salt and sweat-salt and cigarette smoke, his arm pressed damp and warm against Steve’s. He looks at the sketchpad in Steve’s hands for a second and then out at the sunset, squinting. Steve flips to the next page and scratches down, fast but precise as he can, Buck’s profile, illuminated by the dying orange and pink light of the sun. \n“So what’s your story, morning glory? Wanna go out tonight?” asks Bucky. He glances down at the sketchpad again, smiling a little when he sees what Steve’s switched to drawing. He always wants to go out. \nSteve raises an eyebrow, still focused on getting down the line of Bucky’s brow. “Shouldn’t you be getting ready for tomorrow?” \nBucky leans back on his elbows and shrugs. “I don’t think there’s a better way to get ready for Basic than dancing.”\n“Well, guess I wouldn’t know,” Steve replies, before he can check himself.  \nBucky looks at him sharply. “Hey,” he says. “None of that.”\nSteve sighs. If they’ve had this argument once, they’ve had it a million times. “Buck—“\n“It’s only Basic,” tries Bucky again. “Steve.” \n“Buck.”\n“Will you look at me? Jesus.” \nSteve huffs and glares at him.\n“What’s got you all worked up?” asks Bucky quietly. He’s leaning in so close that their foreheads are almost touching. “I know you want to get out there, and I know that you’re — you’re sore, about me gettin’ in and you not, but you gotta hear me, it’s like I keep telling you —“\n“It’s not just that,” Steve says. He looks at Buck helplessly, wishing for the words to come. The truth is that he and Bucky haven’t been apart for longer than maybe a week in the last decade and he’s not entirely sure what he’s supposed to get up to without him. Bucky’s his only real friend in the whole entire world. The only thing he has is Bucky. And if Bucky goes out there, if Bucky dies out there, Steve has no goddamn idea how he’s supposed to forgive himself for not being right beside him the whole time.\nFirst and foremost Steve wants to fight for his country. But now that the future is coming up to meet them, Steve thinks more and more about Bucky alone out there, about letters that could get lost so easy in the mail; about, ridiculously, how cold Bucky’s feet get at night.\nIt’s a weird role reversal, Steve worrying about Bucky this way. Their balance has been upset by it, but Steve can’t help himself. \n“Then what is it?” pushes Buck, clueless asshole that he is. His voice is a little reedy. “You gotta tell me, Steve. You gotta tell me. I can’t fight with you tonight.”\nDefeated, Steve shakes his head, looking at Bucky and summoning up a smile for him. “It’s not you, Buck. I just had a long day. It isn’t you, huh?” \n“You’re better off here,” says Bucky, quiet and firm. “You hear me? Someone’s gotta hold down the fort until I get back.” He pauses for a second, and Steve can hear the joviality in his voice, even if it’s faked, “Who knows, maybe you’ll even learn how to cook me a decent meal without burning the whole complex down first. And you can write me letters so I won’t get bored.” \n“Smartass,” says Steve, softening. “Like hell I’m cooking you dinner; I’m not your girl, Barnes.”\n“No,” Buck says, looking at him. He smiles, but it comes out strange. “No, guess you aren’t.”\nSilence falls over them. Bucky looks back out at the sunset, just the last strains of it, and Steve finishes up his sketch by the light he has left, drawing the sharp, strong line of Buck’s jaw, the bulge of his Adam’s apple, and then shading in the five o’clock shadow which he’ll have shaved off by tomorrow. \nBucky appears to decide to drop it, because just then he rummages in his discarded jacket pocket. “Saw you were runnin’ low,” he explains, handing over the new pencils he must have just bought on the way home. “So. Just in case.”\nSteve thinks for one horrific, embarrassing moment that, honest to God, he’s going to cry. \nTheir balance is upset. Bucky, much as he’d never admit it and Steve would never, ever say it, is the crier out of the two of them: Steve remembers Buck’s frustrated tears two winters ago when Steve almost died in the night, spilling warm and wet over Steve’s hand while Buck thought he was sleeping. He cries when he’s scared. \nAnd now, right now, Buck’s scared. \nHe does a hell of a job of hiding it, but he can’t hide anything from Steve. He’s been saying goodbye to Steve in little ways for weeks now: stuffing all his cash under the ratty couch cushions, sorting his civvies into clothes that might fit Steve and clothes that are falling apart at the seams, and now this, giving Steve pencils before he leaves because he knows damn well that Steve’s not going to buy them for himself while Buck’s gone. \nAnd it’s all because Bucky’s got this idea in his head that his ticket out of Brooklyn is one way only.\nSteve takes the gift, and because he doesn’t know how to do anything but wear his heart on his sleeve today, Buck’s brow furrows. “They the right ones?” he asks, concerned. \n“Jesus Christ, James Buchanan Barnes,” says Steve, shoving hard at Bucky’s shoulder, angry and disbelieving and somehow suddenly elated all at once. Bucky laughs and grins that grin that could start a riot. \n“Goddamn, they must be perfect if you’re saying that,” Buck teases.\n“You better be planning to scrub all that smug off if you want a single dame to look at you tonight.” Steve moves to shut his sketchbook, but Bucky catches his hand by the wrist and stops him, looking down at the half-done sketch of himself on the page.\n“Hey, why’re you drawing me? I’m not even shippin’ out yet,” Bucky says, sounding a little rough. “It’s only ten weeks, anyway. You’re not getting sentimental on me, are you?” \n“You wish,” Steve says, kicking Bucky’s bare foot with his own. But he doesn’t move away, and Buck doesn’t either, and so they end up with their legs tangled together. Bucky is the subject of about eighty percent of Steve’s sketches anyway, Steve almost tells him, but he stops himself and says instead, “I’m just documenting your ugly mug so I can show all the girls how handsome I am in comparison.”\n“I keep tryin’ to convince them that you’re the looker,” Bucky says, absent and honest. “You sure you don’t mind dancing tonight?”\n“Nah,” says Steve, if a little despondently. “Go get scrubbed up, I know you want to go out.”\n“Aw, c’mon, don’t be so serious,” Buck cajoles. “Not like there won’t be plenty of time for me to bug you night and day between Basic and the war, right?”\nSteve looks over at him. “Just want you to be careful, is all,” he says, echoing a statement he’s heard from Bucky a thousand times. \nBucky stands, brushing off his pants and heading back inside. Over his shoulder he calls, “None of that, now. I’m your bad penny, Rogers! I’ll be turning up under your shoe until the day you die, wait and see.” \nFrom the sketchbook Buck looks out at something in the distance, his eyes squinted against the sunset, the light long gone by now. \n \n \n \n\n2006\n\nPeggy, unable to meet his gaze, begins to talk. \n“There were only the rumors. The man had been alive for far too long, you see. Howard and I assumed that it was several men over the years in the same costume, but then we received reliable intel, a file from as far back as ‘46, that corroborated with yours about the arm. We were forced to conclude that it was the same person. And then a few years after Leningrad, Stark’s informant successfully infiltrated the Winter Soldier Project. They called him —“ Peggy’s voice catches. “I’m sorry, Steve. They called him the American.\n“Stark’s informant gathered as much information as he could. The Soldier healed fast; too fast. We believed they were experimenting on him. But that’s as much as I know, because soon after, Stark’s informant was discovered, and he was executed. They — the Red Room, that is — they sent photographs, to warn us. And in one of them — Steve, please believe me; it was only the side of his face. The photograph was blurred and grainy. We couldn’t know for sure. We never knew for sure. His hair was a little longer but he wasn’t wearing a mask, and it — Steve, I’m so sorry. It looked like him.” \nSteve realizes he is shaking, his breath caught in his chest. He’s unable to breathe, feeling like his lungs are closing up, like his asthma is back again. Like Pearl Harbor, like 9/11, his limbs have gone cold and heavy, an unspeakable dread clawing at his throat the way the ice claws at Bucky’s in his nightmares. \n“Like who, Peggy,” he says. \nPeggy wraps her hands tighter around his and says, urgently, “We didn’t have the technology for facial recognition. It was 1962. And it was impossible, Steve. It all seemed so impossible.” \nSteve has never begged, not once in all his years; not when Peggy asked him to leave, not even for his ma’s life, not even for Bucky’s. He’s begging now. His voice is filled with a need so raw and base that he can hardly recognize it. \n“Peggy, please tell me. Please.” \n“It was James Barnes,” Peggy confesses in a whisper. There are tears in her eyes. “Oh, Steve. It was him.”\nSteve’s heart pounds in his limbs and around him the world seems to slow. Dimly he tries to reconcile it. Steve left him — he left him — but only because there couldn’t have been a body. There wasn’t time to look. No one could have survived —\nZola’s lab. The gunshot wound behind enemy lines that healed in two days. How Buck would drink with the other guys, drink a lot, but never quite pass tipsy. In the letters, how Buck said — they shot him up with cocktails upon cocktails of chemicals. Realization comes like a punch, like the hard fist in Leningrad that knocked the air completely out of him. \nHe was there. He was right there. And his arm — the arm — Buck — \nTerribly, miserably, Peggy continues. “We were convinced we couldn’t tell you. It would have compromised us. The balance was too delicate; we were facing a nuclear war. If you had known, Steve, if you had known that there was even the slightest possibility… I knew that you’d tear the world apart, and all for him. You would tear the world apart to find him, and you wouldn’t give a damn about anything else.” She’s right. God help him, she’s right. “You would have destroyed everything we had worked for. You would have tipped the nation into a world war, and the stakes were too high, and I knew, I knew that I couldn’t let you do that.” She’s crying, now, the tears falling slowly. “God forgive me, Steve, I am so sorry.”  \n“He didn’t know me in Leningrad,” Steve realizes. And maybe it makes Steve selfish, but this is worse than the arm; this is worse than anything. Scared and childlike, he asks, “Pegs, he didn’t —?” \n“I know,” Peggy whispers. “Stark’s informant, he told us — Steve, I —“ she collects herself visibly, and then continues, “It was electroconvulsive. They wiped him. They wiped his memory, not just once, but after every single mission.”\nThe pain pierces Steve like a stab wound to the gut. It’s worse than anything he’s ever felt. He had thought — after Bucky fell from the train, he thought, he was so sure, that it was the worst pain he would ever feel, that shock of initial agony followed by miles and miles of colorless grief. Nothing, Steve knew that night, trying to get drunk in a bombed-out bar, could feel worse than this.\nHe was wrong. \n“Howard and I thought he was deactivated in the 80’s. We were so sure he was gone. There wasn’t a single trace left of him, and by the time the KGB was disbanded we thought the horror was finally over. He killed — Steve, he was the assassin who killed the President.” \nThis blow lands more softly, perhaps because there’s no room left for shock in Steve’s body. Stalin too, Steve knows. And how many others? How many did they make him kill — and what did they do to him, how else did they break him, to make him do it? \nSteve hears like it was yesterday Bucky’s delirious mumblings in the HYDRA base. James Barnes, Sergeant, 32557038…Sergeant, 32557…\nHow long did he repeat that to the Soviets? How long, until they stripped it from him too? \n“But there were no records, you understand. Just the one photograph. And then…” \nPeggy looks at Steve, shaking her head. More tears fall, but she makes no move to brush them away. Her voice is cracking now, very finely, like splintered china. “Howard thought someone was watching his house. But you knew him — and oh, even me, I thought it was the drink or the drugs, something causing the paranoia. He had his eccentricities. So none of us listened, and eventually he hired a security detail. Then, the night he died, he raised hell with Maria about keeping Tony at home.\n“You knew something was wrong, didn’t you?” Peggy asks. “You deleted the message he left because you didn’t want me to hear it.”\n“Yeah. I did,” Steve admits. He knows what’s coming next, now. It’s inevitable. He remembers the panic in Stark’s voice. How Stark said Peggy’s name like it was a warning. And Steve realizes that the last thing Stark saw that night — after, Christ, after the Winter Soldier pulled Maria through the windshield and broke her body on the pavement, after he ripped the door off its hinges and hurled it into the snow — the last thing Stark saw was Bucky Barnes, a ghost from sixty years past. And he knew that death had come for him. \n“You were right to delete it,” Peggy continues, her voice thick with guilt. “He left a message at my office. He must have called me first. All Howard said was, ‘he’s coming.’ And that’s when I knew how wrong I had been to keep it from you for so long. How wrong we had all been.” \n\nI was — we were wrong. We fucked up. Rogers, listen to me — \n\nPeggy brushes her tears away now. “There’s one more thing. Only one more, Steve. I feel that I owe it to you above all else.”\nNumbly, Steve meets her gaze. What more could there possibly be?\n“It’s another reason why I didn’t tell you,” she says. “The real reason, maybe.” \nSteve doesn’t speak; he doesn’t think he can. Instead he holds her look at waits. \n“I’m selfish,” Peggy confesses, brokenly. “I have loved you so much, and love made me selfish. And I knew that if I told you I would lose you.” \nAnd the terrible thing, the worst thing, is that Steve knows down to his bones that this is true — that Peggy is, as always, right. He would have left. He would have torn the world apart to bring Bucky home, and he wouldn’t have looked back.\nPeggy is truly crying now, curled in on herself, her hand covering her eyes as her body shakes. Steve can’t stand to watch it; doesn’t know if he’s angry or hurt or betrayed; if he forgives her or not, or if he ever, ever can. It’s not that he doesn’t understand her reasoning, because he does. That makes it no easier to reconcile. \nSteve knows only that he loves her, and wants her not to hurt over it anymore. She’s unburdened herself, and the truth belongs to Steve now. It is his weight to carry. \nHe wants to carry it. \nCarefully, he takes her hands in his. “It’s alright,” murmurs Steve, pressing their foreheads together. He cups her face in his palms and feels her tears meet his thumbs. “Hey, it’s alright. Listen, you weren’t wrong. I would have left. I would have left, because love made me selfish too.” \nPeggy’s face twists, like his words have hurt her. She shakes her head and pulls back to look at him, closing her hands around Steve’s. “I’m sorry I’ve kept you for so long,” she whispers. “Steve, I’m so sorry. I denied you, didn’t I? I denied you the life that you wanted. That you deserved. I’m sorry.” \n“Pegs, don’t ever be sorry,” replies Steve, quiet, pressing devoted kisses to her knuckles. “I loved you, and I love you still. I had the time of my life, Pegs, don’t you know that? I had the time of my life, dancing the night away with you.”\n“But it’s last call, isn’t it?” Peggy asks. Steve takes a long moment to wipe away all of her tears. When she’s collected herself, she continues quietly: “The lights are coming up, I think. It’s time for you to go.” \nShe cups her strong withered hands around his face. She does look the same as the day they met: despite what the years have done to her, despite the lies she has had to tell, the people she has hurt, the deaths she has seen, her eyes are the same reliable, steady brown. He loves her, no buts. He didn’t lie. Nothing can stop him from it, not even now. It burns in him, the same way he will burn until the day he sees Bucky’s face again. And he will. Steve won’t rest, not until he finds him. Wait for me, he begs Buck. Whatever hell you’re in now, hold on, just a little longer, just for me. \nWait for me. I’ll come for you. I always will.\n“I’ll move Heaven,” Steve promises, intently. “And if that fails, I’ll raise Hell. But I’ll make this right, Peggy. I’ll bring him home.” \nPeggy smiles; sad, faithful, tired. “I know, Steve,” she replies. “I know you will.”\n—\nThe Triskelion has changed over the years, and though it’s no longer Stark’s long and straight Bauhaus monstrosity, it is still buzzing with suits and blanketed in glass windows. Director Fury’s office is high up, but not half so large as Stark’s had been. Steve takes the elevator, which is made of windows too, and by the time he is on the right floor he can see all the way out to the Potomac. \nFury’s office is white and gray, and sunlight streams in hotly. Fury, uncaring, wears all black and even a coat. The eye-patch jars Steve every time, but he doesn’t show it. Instead he falls to parade rest, waiting as Fury hauls the box onto the desk and dusts it off. There’s a battered file next to it, courtesy of Agent Romanoff. Written across it is ПРОЕКТ: ЗИМНИЙ ВОИН. Fury takes a step back and gives a sharp, quick salute.\n“Colonel,” he says. “Welcome back, sir.” \nSteve takes a couple steps forward and pries open the cardboard. He presses his hand flat to the white star of his uniform.\n“You know what?” asks Steve, “I really think I’d prefer Captain.” \nFury agrees, a smile, maybe, at the corner of his mouth. “Captain, then. Well, Cap, I got one more thing for you.” \nHe pulls it out from behind the clean lines of his desk. Steve can’t remember it ever looking this nice, though maybe that’s because the last time he saw it was when he locked it up in his SHIELD-issue storage unit years back, and it was still matte gray then. It’s all spiffed up with a new paint job now, though, and the red, white, and blue catch the sunlight, gleaming brightly.\n“I took some liberties,” Fury explains, offering it out. \nThe weight of the shield rests heavy and familiar in the crook of his arm. \nIt’s been a long time. \n \n\n“1954” \n\n\n-In Steve’s ‘interrogation’, Lee asks him if his parents were associated with the Socialist Party of Ireland.  This was a real party, founded originally in 1896 with several failures and revivals along the way.  It eventually became the Communist Party of Ireland in 1921, so while Lee would probably know it better as that name, Steve’s parents, and therefore Steve, would not.  In addition, while regarded as significant by Irish historians, it was a very small party, so Steve’s parents probably would not have been part of it.  \n\n\n-The KGB was established in march of 1954; it is the KGB that Steve is working recon on in this section.\n\n\n-The Venona project mentioned was a decrypting operation run out of the US that worked to counter Russian intelligence.\n\n\n-The Vinnitsky district was a tiny industrial county in Leningrad that existed from 1927 to 1963 — I have no idea where in Leningrad it actually was, nor any idea if the KGB actually had roots there — obviously, it probably didn’t.\n\n\n-Chukotskiy was located in the far, far, far, FAR, FAR northeast of the AOk (a region of the USSR) and technically, from what i understand, operated autonomously from the USSR. it was (and probably still is) a mostly-abandoned, largely uninhabitable wasteland, and therefore seemed the perfect place for kicking off something as hugely fucking shady as the Red Room, particularly when the asset they’ve just acquired from the splinters of HYDRA is hugely unstable, unpredictable, and prone to lashing out like a feral animal. Note that this isn’t comic canon; there’s actually no canon whatsoever elaborating on the location of the Red Room at all. Fanon likes to put it in western Russia. I…think that’s way less fun, at least for the beginnings of it. \n\n\n-ПРОЕКТ: ЗИМНИЙ ВОИН/ Proyekt Zímnij Voin: I thought using a Russian word that can mean berserker, warrior, or soldier depending on the connotation and context would be way fun to acknowledge that the Winter Soldier hasn’t always been called the Winter Soldier. Maybe first he was patient zero, and then subject one, and then that became a project when the Red Room followed HYDRA’s footsteps and wanted to try recreating their own brand of super assassins. Also, I love this idea that the Red Room thought maybe it was the serum itself that was making Buck unpredictable — I love this idea that Buck was very difficult to control for the first decade or so, because cryo was new and unstable and the memory wipes just weren’t as efficient. So that’s my justification for using a word that has connotations beyond “soldier” — the Red Room was unsure of him. \n\n\n     -We originally used “ЗИМА” rather than “ЗИМНИЙ” because… well, we don’t speak Russian, but we were informed by the lovely isamai that “ЗИМНИЙ” would make more sense because you’re not supposed to put two nouns in a row.  This made me realize that in English two nouns are… Ok?  Not sure, I’m not a linguist or anything, but Winter Soldier is definitely two nouns in a row, but Winter still acts as a modifier for Soldier.  If we didn’t allow for the two nouns and instead needed an adjective and a noun, it would be Wintry Soldier, and that sounds a little silly.  This linguistics rant is now over unless someone who knows their shit with linguistics happens to tell me otherwise.  \n\n\n-I couldn’t help giving him the signature thighs of death Red Room move. Work it, Buck\n\n\n-The Soldier reports into his comm that he’s injured in a potentially fatal way and asks if they still want the mission completed. they say no, so he beats it. Obviously this isn’t because Buck wants to live — he’s been instructed to let them know if he thinks he’s dying so that they can pull him immediately. He’s too good of an asset to lose. Additionally, you’ll notice that I didn’t give the Americans comms but did give them to the Red Room. This is mostly because we know that the Red Room’s tech is miles beyond anything the Starks have, even by 2014. \n\n \n \n\n\n“1962”\n\n\n\n-The WHCA dinner is a gala that happens annually at the White House to raise funds for scholarships. It’s pretty much a relaxed and fun evening despite the part where it’s black tie, involves a bunch of military officials, and is held at, you know, the White House. I fudged the date; in ’62 the dinner actually happened in late april, but the snow was more dramatic.\n\n\n-“Duck and cover” was really strange. In schools they’d air these short films about how the best way to survive a nuclear attack was to hide underneath your desk. Like we have fire drills or lockdown drills, they’d have duck and cover drills. I have links to the propaganda cartoons if you want to see them; it’s so fucked up. I actually found out about this from my dad a million years ago, who told me about the duck and cover drills they did up through middle school. I thought this would be something that Steve would be deeply unimpressed by. \n\n\n-Steve is Colonel Rogers because of his two honorary promotions.\n\n\n-LBJ, apparently, wasn’t too cool of a guy; he was famous for something called “the Johnson treatment” which involved intimidating people physically in order to get them to pass his legislations. JFK didn’t want him to be president, ever. As we know, Steve hates bullies. \n\n\n-Women were actually banned from the WHCA dinner up until 1962, so Peggy’s presence here is… rather significant?\n\n \n \n\n\n“1963”\n\n\n\n-CBS cut into a new episode of As The World Turns to report the news that the president had been shot. As the world turns was a soap opera. Literally the only way for me to make this historically accurate was to have Steve watch a soap opera. Can’t make this shit up. amazing.\n\n\n-Famously, the coverage of JFK’s death lasted for four days. So that’s why it’s four days until cap makes an appearance to Reassure The Nation. The timing of the press conference is obviously fictional though.\n\n \n \n\n\n“1966”\n\n\n\n-The format of the headline is unusual but is actually typical of the NYT, both then and now, so I rolled with it. Also, you would not believe the number of gay scandals in ’66. There were a lot.\n\n \n \n\n\n“1969”\n\n\n\n-Stonewall was a few months before the moon landing so that explains the order of this section.\n\n\n-I could not physically stop myself from referencing issue #5 of Man Out Of Time with the Grand Canyon scene because I have a disease.\n\n \n \n\n\n“1971”\n\n\n\n-The Winter Soldier Investigation happened in, ironically, the winter of ’71 (jan 31 - feb 2), so I put this section in this year and changed Steve’s arrest/meeting Fury to ’72. \n\n\n-Just a personal note, good luck watching the actual testimonies about the Winter Soldier investigation; I actually had to stop about every five minutes for a breather. I couldn’t finish it. It was actually too much for me, and that is — saying something. The things that were done, the atrocities they were forced to commit under orders, the mutilations, the executions, the women and children they killed, it’s enough nightmare fuel for the next century. Do you know what white phosphorous does to the human body? I didn’t either, at least not in vivid detail, and now I wish I didn’t. I don’t know how those boys ever got a wink of sleep after they got back home. I sure as hell won’t forget these testimonies and I know I’ll think about them for a long time. \n\n\n-At this point in time, San Fran was a hotbed of hippies. It was one of the places to be for hippie culture, so that’s interesting, and also why Jim doesn’t live directly in the city, probably. I also don’t know how I feel about Morita going back to live in Fresno. There’s probably a lot of bad memories.\n\n\n-The Winter Soldier investigation was kick started by Vietnam vets who wanted accountability and change. (John Kerry actually testified, fun fact. he was very, very young then, and had about the same amount of hair.) It happened in Detroit and received basically no media coverage outside of the city itself, no guesses why. It’s completely reasonable to assume that Steve knew nothing about the investigation at all: it wasn’t televised and the documentary was released over a year later, in late ’72. Jim, on the other hand, who’s still keeping up with shield despite getting up there in age, doubtlessly heard about the organization that kick started it through one of his work contacts.\n\n\n-The story about the rabbit is true; the guy said his CO gutted it, and said, “now you know,” and he shipped out six hours later.\n\n \n \n\n\n“1972”\n\n\n\n-The protest Steve marches in is real, except for I changed some of the details: it wasn’t members of the police force arrested, it was members of the gay organization that marched, and the march actually happened in 1971. But making it the cops themselves was too fitting and I had to. Other than that, the demonstration did take place on a frigid December day, and there was almost a riot, and a lot of people got arrested.\n\n\n-I’m pretty much ignoring MCU canon regarding Fury, mostly because MCU’s canon for Fury is a complete disaster and also because everything is way more fun this way. And also because it’s actually not that far fetched that fury fought in Vietnam before doing his secret cold war ops.\n\n \n \n\n\n“1975”\n\n\n\n-Song lyrics from Bob Dylan’s “The Times They Are A-Changin’.\n\n \n \n\n\n“1977”\n\n\n\n-Southern Vietnam is actually fairly dry in the winter, while the north is rainy- this situation is flipped in summer, with southern Vietnam more rainy and northern Vietnam more dry.  I picked southern Vietnam because from what I have found of maps on the internet, most of the battles of the Vietnam war were fought there.  \n\n\n-Both sides did indeed leave land mines.  \n\n \n \n\n\n“1980”\n\n\n\n-I figured it would make sense for Buck to get a purple heart, as that’s reserved for soldiers killed by the enemy or soldiers who died in battle. Even though this isn’t technically completely accurate, he was Captain America’s second in command, and I feel like awarding him with it would have been the done thing. Buck also has the SSR listed in his service record because the Commandos were technically outside of army jurisdiction and under SSR jurisdiction instead. \n\n\n-This protest is NOT real, but during the AIDS scare there were plenty just like it, particularly in the west village. Act Up — Fight AIDS is a real slogan. There were a lot of myths about AIDS — how you contract it, how you cure it. Papers called it “the plague.” Basically it was a really shitty time to be LGBT, and mostly everyone in the community was focused on tamping down fear and stigma to get out the facts and keep people safe. \n\n\n     -ACT UP is actually the name of an organization: AIDS Coalition to Unleash Power. the whole purpose of ACT UP is to raise awareness, education, and money for research about HIV/AIDS in an effort to stop what was pretty much The Red Scare Take 3: Gay Community Edition. There’s also the added benefit that it sounds nifty. Someone really wanted to the acronym to spell act up, I think. Because that’s what it’s about — making your voice heard. Acting. Educating. Keeping people healthy and safe and disputing irrational, panicked fears. \n\n \n \n\n\n“1998”\n\n\n\n-Quick summary of Kat: Kat was born in ‘48, meets Joe Morita at age 25 (in 1973) over the summer at an internship in California when she goes to visit uncle Jim Morita.  Joe and Kat fall in love, marry two years later (’75) after Kat finishes her PhD.  Neither of these events are in this fic because everything happens in the winter and Kat’s life is clearly all about summer.  Assuming they had their first kid two years later (77) and then the next two years after that (79), that would make her eldest 21 and her youngest 19 at this point, which I’m sure is a great time for Tony because here he’s only 28 and he’s probably having the time of his life mentoring Kat’s kids because YOU KNOW she mentored him YOU JUST KNOW.  This commentary probably could have gone better in a section under “1985” but I’m too lazy to move it.  \n\n \n \n \n\n\n“2006”\n\n\n\n-Joe Wright directed the film about Steve and Buck because Joe Wright directs all the saddest historical love story movies. It was probably very depressing and involved a lot of whoever played Buck staring longingly across the way at whoever played Steve while soft sad piano music played, and probably there was some kind of bombed-out French mansion involved, and maybe a claw footed bath tub, and probably an uncomfortably erotic scene involving water somehow, and I can guarantee that he made up a few extra letters that were incredibly dirty, because Joe Wright’s favorite thing is to put dirty letters into period pieces and have the protagonist read them out loud to himself. All the reviews are like, the shocking sexual tension! An American icon! Destroyed!! most of the movie is done in voiceover. Even the butchest dude men who went in to appease their girlfriends got a little teary when the movie ended with Steve, like, tragically finding the letters somewhere improbable, and resting his head in his waif-like, confused blonde wife’s lap and crying One Single Tear. It was super overdone and even a little melodramatic in parts and tumblr like, made a million gifsets of it, and to this day hipsters quote it to each other. I’m spending way too much time thinking about this. Anyway.\n\n \n \n\n\n“1943”\n\n\n\n-Basic takes 10 weeks unless you end up getting recruited to train for an MOS — a Military Occupational Speciality — in which case you’re there from anywhere between 14 to 16 weeks. So Bucky doesn’t know it yet, but he’s lying to Steve when he says he won’t be long; he was probably gone for 16 weeks, which is the norm for sniper trainees. This is also how he managed to ship out as a Sergeant even though it was only his first tour. This also means that he was consciously working to become an officer before he finished basic, because if you can do that your pay increases. But Buck doesn’t think he’s coming back. So like. He probably just clawed his way up the ranks before he shipped out because he wanted Steve set up nice for when he died out there. Like that’s probably canon.\n"
}