{
    "id": "18000440",
    "url": "https://archiveofourown.org/works/18000440?view_full_work=true",
    "author": [
        "a_dale"
    ],
    "title": "Falling to You",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling",
        "Thor (Movies)"
    ],
    "relationships": [
        "Harry Potter/Thor (Marvel)"
    ],
    "characters": [
        "Harry Potter",
        "Thor (Marvel)"
    ],
    "additional_tags": [
        "Pre-Slash",
        "Pre-Relationship",
        "Soulmate-Identifying Marks",
        "Alternate Universe - Soulmates",
        "harry is 11",
        "Thor has just been cast from Asgard",
        "Pre-Thor (2011)",
        "Not Canon Compliant",
        "Friendship",
        "Protectiveness",
        "they are NOT ROMANTIC YET",
        "NOT UNTIL HARRY IS OF AGE THANKS",
        "splitting scars",
        "Not Underage",
        "probably a bit OOC",
        "Loki shows up later",
        "Loki is a Good Bro",
        "Don't copy to another site"
    ],
    "language": "English",
    "series": "Part 7 of Your Soul is Bound to Mine",
    "published": "2019-03-04",
    "completed": "2019-03-10",
    "words": "5,537",
    "chapters": "2/2",
    "comments": "451",
    "kudos": "7,812",
    "bookmarks": "821",
    "hits": "77,172",
    "summary": "<p>Thor has been cast out but he isn't just sent to Earth - Fate sends him directly towards his splitting.</p>",
    "notes": "<p>So this one is actually inspired by a femHarry/Matt Murdoch fic that I read, because I really liked the idea of soulmates literally being one soul ripped in two.</p>\n<p>The existence of this chapter is basically just a big thank you to one of my readers - you said this was your favourite after all :)</p>",
    "text": "Thor could feel nothing but rage as he fell. His father had cast him out for doing exactly as he had done! He was only trying to follow in his father’s foot steps! After all, the Frost Giants were war hungry. They had attempted to steal from Asgard and they would pay for their treachery! \nHe felt the moment his trajectory changed - the sharp turn as he was pulled away from the expected path and in another direction. His whole body jolted and he cried out in outrage as a force beyond his will decided his path for him. Just another thing he could blame the Allfather for. \nHe landed hard, body weaker than it had ever been - and he struggled to his feet, rage burning through him once more. He looked around at his surroundings, even angrier than before. He was in a dark forest, the sky invisible above him - blocked out by dark and looming boughs. \n“What is this place?” he demanded, even as the chill began to seep under his skin. He knew the feeling of danger even if he’d never felt real fear before. The sound of a twig breaking behind him had him spinning around, ready to shout and curse at whoever was sneaking up behind him, but then the scar on his chest began to glow the colour of a flame and words failed him as he came face to face with bright green eyes peering out of the darkness. A darkness that was being pushed back by a matching fire glow, revealing the young face of a boy, watching him curiously. \n \nHarry woke up, the scar on his chest itching. He knew it was his soulmark, but he’d never felt anything from it before - to the point where he often forgot it was there. He knew everyone had one - but it wasn’t until he’d been brought into the magical world that he really understood what they were. \nThey were called splitting scars, and they were said to be the mark left behind when one soul had been ripped in two, the sign of soulmates. That when the other half of your soul was near, both scars would glow, a sign that the two halves were reuniting. \nHe’d never really had cause to believe those words before. Not that he doubted, per say, but he’d never really seen it, and his own scar had always just been that - a scar. \nBut not anymore. \nNow it itched, like something was trying to scratch its way from under his skin, and there was something akin to the prickle of anticipating making itself known. \nCarefully, he slid out of bed, putting his shoes on. He hesitated a moment before reaching for his invisibility cloak. Even as he clasped it around his neck, he revelled in the fact that it had been his father’s. He’d only had it for a month, but it was his most prized possession and he hugged it close as if by doing so its last owner would feel his affection. Cautious, he pulled the hood over his head, slipping from his dormitory. He knew the other first years wouldn’t wake - they all slept like the dead - but he was more worried about the fat lady in the portrait giving him away. He may be invisible, but portraits never opened for no reason. \nHe was in luck because the fat lady was fast asleep when he slipped from the common room and stood at the top of the staircase, hesitant once more. \nHe wasn’t really sure where he was going or just why he felt so strongly about following the urge, but then it was like his scar tugged on his chest and he followed the feeling. He followed it down the stairs and out the doors onto the school grounds. He followed it all the way past Hagrid’s hut, hesitating only briefly on the edge of the Forbidden Forest. After all, he’d already been beneath its boughs and the experience had been less than pleasant. \nHarry shook the thought off, the pull in his chest more insistent now. He followed it into the forest, weaving his way over roots and around bushes, very aware of the sounds of the forests residents as they moved around him. A shiver crawled its way up his spine but he ignored it, pushing forward. \nA bright flash of light shone up ahead followed by a resounding bang of something landing hard on the ground. Harry knew without a doubt that whatever was pulling him forward, was what had just landed. He hurried forward, not noticing when the hood slipped from his head in his haste. He heard a man’s voice shout up ahead - not quite catching the words - but then he saw him and he couldn’t help but shrink back at the sight at first. The man was huge; tall, and broad, with muscles that made everyone he knew look weak and scrawny. He had golden hair to his shoulders, and when he spun around, bright, electric blue eyes fell on him. The moment they did, a light flared on the man’s chest, through the shirt he wore, the colour of fire. He jolted in surprise when those eyes met his, and then he felt a flare of magic from his own chest. He pushed his cloak aside and watched in awe as a light the same bright colour glowed from his own chest. \n“Well met, little one.” and the anger he’d heard in the man’s tone earlier was gone. Harry’s head snapped up to look at him, but he had his hands up in a show of peace, lowering his stance so he no longer appeared quite so big. \n“Er, hello.” Harry greeted in return, unsure. He’d never seen anyone meet their soulmate before, he had no idea how this was supposed to go. He also hadn’t heard of anyone else meeting their soulmate when they were only 11. He knew it was probably something else people would find unusual about him. \n“What is your name?”\n“Um, Harry, Harry Potter.” he offered. It couldn’t be wrong to tell his soulmate who he was, could it? And after all, most people knew who he was without introduction anyways. He mustered up all the courage he had. “Who - uh - who are you?”\n“I am Thor Odinson, prince of Asgard.” Harry blinked. A prince?\n“Where’s Asgard?” he found himself asking, despite himself, and Thor offered him a bright smile. \n“It is one of the nine realms of Yggdrasill. The world tree.” Harry nodded. It sounded vaguely familiar, but he was fairly certain he’d heard it from a myth. He wondered if the magical world felt differently about it. \n“Oh. Um. That’s cool.” he replied, feeling awkward. “But if you’re the prince, what are you doing here?” that rage came flooding back, but it wasn’t aimed at him. That was the only thing that didn’t have him scuttling back. \n“Father banished me to this realm as punishment.” he scowled, glaring up at the sky. “He banished me for wanting to punish those that would steal from us. My father once declared war on their people and made them bow before him. Now they would spit in the face of his mercy and steal from our kingdom.” Harry frowned. He didn’t really understand. \n“But - what were they trying to steal?”\n“A cask. One my father claimed as reparations for the damage done during the war.”\n“So, it was theirs?” Thor scowled. \n“Once, but-”\n“So they were taking back something that already belonged to them.” Thor’s scowl darkened. \n“They would have if we had not stopped them.”\n“So, really your father stole it. They just wanted back something that already belonged to them.” Thor didn’t respond right away. In the glow from his soulmark, he looked particular dangerous. \n“Yes.” because the boy’s words were true despite his feelings on the matter. \n“And you want to kill them for that?” the boy looked nearly heartbroken by the thought. It hit him like a physical blow. That he would be the one to put such a look of sadness on his soulmates expression made him realize that perhaps his father might’ve been right to cast him out. \n“There was a time when they killed many of my people.” \n“But so did you,” Harry countered, unsure when he’d decided he could speak his mind without fear, but he couldn’t seem to help himself. “It was war, right? People die in war.” Thor wondered what sort of pain this youth had experienced to have such ghosts lingering in his gaze. It seemed he didn’t have to ask because the boy, Harry, volunteered the information. \n“My parents were killed by someone who wanted to rule over everyone. He thought he was better than everyone else too. He thought that because of where his blood came from he was better than everyone else and everyone else didn’t deserve to be his equal.” his eyes were liquid bright when they looked up at Thor, filled with unshed tears but unwilling to back down. “He killed them and he was going to kill me and the only reason I’m alive is because my mum loved me so much she protected me even after she was dead.” \nThor could only stare at the boy who was meant to be his other half. He stood there with such grief and pain in his gaze, and yet even still he stood up against him, someone many times his size, and refused to stand down. \nHe wanted to rage and scream at how unjust it was that his soulmate had felt such grief - such terror at such a young age, when all he wanted was for people to live safely and in peace. It put his own actions in sharp relief. When had he not fought? When had he not killed any who would stand against him on the field of battle? Though he wanted to believe his actions were justified, in the face of this boy’s pain, he could feel nothing but shame. \n“I am sorry.” he wasn’t sure if he was apologizing for his own actions, or for those brought against his soulmate, but he was sorry all the same. Harry blinked at him, surprise clear on his features. All of the ferocity that had been visible in his expression faded back behind discomfort as he scuffed a shoe against the ground. \n“You don’t have to apologize to me. You didn’t hurt me.” \n“Perhaps not, though I damaged your opinion of me, and for that I am also sorry. I would not have you think less of me.” And those huge green eyes stared at him, wide. \n“I don’t think less of you.” the boy hurried to assure. “You’re my soulmate, aren’t you?” and there was insecurity there now. Thor could not have his other half being so uncertain of their bond. He moved forward, lowering to a knee in front of the boy. \n“Aye. We are bound.” he offered a hand and watched the indecision flit over Harry’s expression. The longer he watched, the more he realized that the hardships Harry had shared with him were not the only ones he’d faced. It was obvious now that it was not just his own worth he doubted but that he deserved such a thing as a soulmate. Thor vowed to prove otherwise. If he was to spend time here on Midgard, he would spend it all making sure his soulmate knew he was cared for and deserved such care. \nAs he didn’t remove the hand despite Harry’s hesitancy, the boy slowly put his hand in Thor’s. The moment contact was made, the light between them flared before tempering out. Harry sucked in a sharp breath but didn’t pull away, and Thor was sure he made a similar sound, though he was focused on the boy in front of him. From this close, he could see even more clearly just how young he was, but beyond that, how small he was. Far too small in Thor’s opinion.\n“Wow.” the boy breathed, and Thor didn’t even try to contain his grin.\n“Aye.” he repeated, warmth spreading through him. \n“So now what?” Harry asked, still looking nervous but making no move to pull his hand away. \n“Now I can only strive to prove to you I am worthy of such a title as being your soulmate.” Harry stared in surprise.\n“You don’t have to prove anything to me. I’m just Harry.” Thor shook his head. It seemed he had more to prove than he’d initially thought. \n“You are the only one I must prove myself to.” Thor countered. “Until then, I would hope you would allow me to remain by your side as your friend. I would protect you from any further hardship.” For now, that’s what the boy needed - a friend. Anything else could come with time. For now, Thor was content to be both the boy’s sword and shield until a time when he was old enough that they could stand side by side. \n“You - you want to stay with me?” Thor nodded, sincere.\n“There is nowhere else I would rather be.” Not even the thought of the halls of Asgard called him now. Knowing his soulmate was here, so young and vulnerable and clearly mistreated, he could not imagine being anywhere else. He watched the tentative smile spread over Harry’s features, and he returned the expression easily. Standing, he offered his hand once more, helping Harry clamber over the large collection of roots between them. \n“Shall we then, Harry?” and he didn’t comment on the tight grip Harry kept on him, or how he kept darting glances in his direction, surprised and pleased in turn. Once they were well on their way to returning to wherever Harry had come from, he spoke once more. “Where is it we are going?” Harry’s smile was tentative once more, but excited all the same.\n“I live at Hogwarts. It’s a school for witchcraft and wizardry.” his cheeks tinged pink, embarrassed even as he was clearly pleased. “I’m a wizard.” Thor could only blink in surprise before he offered a blinding grin. His soulmate could use magic, just as his brother could.\n“That’s very impressive.” he announced. Harry’s smile became a little more confident. \n“It’s the best.” he admitted, and Thor beamed back. \n“Then I look forward to being able to witness your growth as a Seidr.”\n“A what?”\n“A user of magic.” Thor explained, glad that for once that he was able to share his knowledge. Harry nodded, expression thoughtful. When they were clear of the forest Harry paused, looking up at the castle up ahead, and Thor could admit to finding it beautiful. It lacked the majesty of Asgard, but there was something haunting about it that he was sure would stick with him for years to come. \n“That’s Hogwarts.” Harry told him, voice reverent. Thor made sure his expression was one of appropriate appreciation. \n“And this is where you live?”\n“During school, yeah.” There was something about the way Harry wouldn’t quite meet his gaze that told him he would have to ask about just what about Harry’s life outside of school made him quite so skittish, but knew now wasn’t the time. Then Harry was looking up at him in a panic, hand tightening around his. “What if they won’t let you stay with me? Since you’re not a student?”\n“I imagine not even the Seidr of Midgard would risk separating soulmates once they are bound, regardless of age.” but Harry didn’t look relieved. \n“You don’t have to stay with me, though. It’s probably boring. There’s only kids here.” Thor lowered to a knee once more so Harry could see directly into his eyes, and know his words for the truth they were. He kept Harry's hand in his and placed his free hand on the boy's shoulder.\n“I would not wish to be anywhere you were not, Harry. You are my bonded, as I am yours. I wish to remain by your side. Nothing could convince me otherwise.” his smile then was wry. “I will repeat myself as often as necessary until you believe me.” and Harry looked surprised he was willing to do such a thing. Thor did not like what that implied about Harry’s childhood. Once more, he pushed the thought aside. It didn’t matter. Not yet. All that mattered, was making sure he could remain with his bonded. \n“Now then, take me to the ruler of this castle.” Harry cracked a smile, eyes sparkling with laughter.\n“There isn’t a ruler, exactly. Just the headmaster. I’ll take you to his office.” Thor nodded imperiously.\n“Onwards!” and that did spark a laughter from Harry.\n“Onwards.” he repeated, giggling. \n \nThe weeks after falling to Midgard were strange but not unwelcome. He learned much about the magical world and its schooling - much about the school and its residents - and a fair amount about his bonded himself. It turned out the boy was famous - but it rankled to know he was famous for an event that had brought him such pain and that people were constantly reminding him of that pain.\nHe’d met the Headmaster of the school on his very first night as well as the potions master, and he could say he wasn’t particularly pleased with either. He knew the moment he met the headmaster Albus Dumbledore that the elder wizard was scheming around his young soulmate, and he did not appreciate the endangerment of children, bonded or not. As for the potions master, one Severus Snape, he had been hard pressed not to speak against him considering how he spoke to young Harry, but as Harry hadn’t seemed too upset he let it be for now. \nThor scooped some eggs into his mouth, looking out across the great hall. He could see Harry chatting amiably with his two closest friends, Ron and Hermione, and he grinned at the boy when he chanced a glance at the head table. Harry flushed but grinned right back. On his left, professor Minerva McGonagall let out a soft huff of laughter. He turned a questioning look on her, expectant, and she indulged him with a small smile. \n“I’ve never seen him quite this happy before.” She admitted. “Except maybe when he’s flying.” It took Thor a minute to connect flying with the game she’d previously explained to him, quidditch. He quite like Minerva - she’d been especially welcoming, and she’d even lobbied for him to hold a class of sorts of his own - Mythology and the Stars. It was in the evenings after sundown a few times a week. After all, she’d argued, who better to teach the stories of the stars than someone who’d lived many of them? And she didn’t believe in anyone being idle. \nThen he caught on to just what she’d said.\n“Was he not happy then? Before?” Before his arrival - before he truly believed he had a soulmate. Minerva shrugged elegantly, but her frown was telling. \n“Those muggles,” And she stopped herself, offering him an apologetic look. “His non-magical relatives,” she corrected, “they hate him.” And there was bitterness in her voice. A ferocious anger that flashed briefly in her eyes that surprised him. \n“Why have you allowed him to live there if you knew they mistreated him?” Because he knew that’s what she meant by her words. He also knew it explained Harry’s visceral reactions to some things; how he flinched if someone moved too quickly just out of sight, how he always seemed to know exactly where the exit was. \n“I haven’t a choice.” She snapped, then softened her voice, apologetic once more. “He needs the protection only blood can offer.” She admitted. And he’d heard by now the story of Harry’s fame - of how his mother and father stood between him and death knowing it meant their own end in turn.\n“I am more his than any other.” Thor said then, without really thinking, because he was literally the other half of Harry’s soul, as Harry was the other half of his. She blinked at him, surprised, before a light lit in her gaze, and a small smile curved her lips. \n“I dare say you’re right, Mr. Odinson.”\n“Please, Lady Minerva. I would have you address me by name as you have allowed me the same courtesy.” And her cheeks flushed a soft pink but she nodded. They didn’t speak of the matter again, but Thor knew the look of someone turning an idea around in their thoughts and Minerva had that look. \nAfter breakfast, when Thor had decided he would like to explore more of the castle, he was surprised to find Harry waiting for him, looking rather nervous. Thor offered his hand and Harry was quick to take it, fingers gripping his nearly as tightly as they had that very first night. Thor didn’t say anything until they’d wandered together out onto the grounds, well out of earshot of everyone else. \n“Is everything alright, Harry?” He often found himself at odds, having to ask. It had never been something he’d been particularly good at - guessing at the moods of others. It had always been a skill of his brother really, but he found himself wanting to learn, if only so he could help Harry as he grew. Harry shrugged, and the look he shot him was pinched with worry. “You know there is nothing you could tell me that would turn me against you.” He reminded him, for what felt like the millionth time, but he knew he’d say it a million more if that’s what it took for Harry to believe him. \n“I know.” And Harry said it with such surety, and with the hints of a smile. It filled Thor with warmth. \n“Then what is it that troubles you?” Harry didn’t answer right away. It was clear he wanted to share whatever it was on his mind, but it was equally as clear that whatever it was, Thor would probably not like it. Else Harry wouldn’t be so hesitant. \n“If I told you Voldemort wasn’t dead, what would you say?” Thor stopped in his tracks, turning to fully face Harry. \n“Is it true? Is the one who murdered your family alive?” It filled him with such a burning rage he had to force through it to make sure he didn’t miss a single thing Harry said - a single expression he made. Harry’s face held that pinched expression once more before he nodded. \n“Yes. At least, we’re pretty sure.” Thor didn’t have to ask who the ‘we’ was. “We think he’s not really fully alive, but half, I guess. But that he’s trying to come back. Completely.” \n“How?” \n“The philosophers stone.” And then the story just tumbled from Harry’s lips, everything that had happened since the beginning of the year - the troll - the nightmares he still had - the mirror he’d found and what he’d seen. He told him about the detention and what they’d encountered in the forest and Fluffy -\n“It seems you were bound for adventure even before you met me.” Thor interrupted with a grin when Harry paused for breath. Harry stared at him for just long enough he feared he’d jested in poor taste before Harry burst out laughing. \n“I guess so.” Then he beamed at Thor, pleased as punch, and Thor could do nothing but beam right back.\n“Right then. What would you have me do?” And that earned Harry’s surprise. \n“Do?” And it was clear he hadn’t really meant to ask, but Thor was proud of the fact that Harry was getting comfortable enough with him to speak without really thinking. He’d realized, the more time he spent with Harry, that he’d been far luckier than most to be allowed such freedom. \n“You did not think I would allow you to partake in such a task by yourself, did you?” He asked, making sure to keep his tone soft. “I would help you, if you’ll allow it.” \n“You can do whatever you want.” Was Harry’s immediate reply, but Thor shook his head.\n“No. I will not intervene unless you allow it. This is your task. You have solved this mystery. It is your quest. I am only welcome upon your invitation.” \n“But you’re a grown up.” \n“I am also your soulmate.” Thor returned easily. “You have as much control over me as I do you.” Harry blinked at him, looking distraught. “What I mean is - I have no control over you, beyond what I would ask of you. But you always have the ability to decline, do you not?” Harry nodded slowly. “As your bonded, it is much the same. Though the reverse, in this case. I would like to aid you in your task. Will you allow it?” Harry stared at him with such wide, solemn green eyes before he nodded. As soon as he’d done so he launched forward, catching Thor by surprise and hugging him tightly.\n“Thank you.” Thor realized it wasn’t the help he’d offered he was being thanked for, but for allowing Harry the choice. Not trusting his voice, Thor just hugged him back. \n \n&gt;&gt;&gt;\n \n“Heimdall.” Thor called, standing in the very place he’d fallen to Earth. He realized he hadn’t even looked for a way home since he’d found Harry - hadn’t even really thought to ask for guidance. “I am not calling on you to come home. I know now that I have made mistakes, and that I must learn from them. I would ask a favour though. I would ask that you call Loki for me. There are Seidr on this planet and I do not know nearly enough about their ways to be much help. But - as I am sure you have seen - I have found my bonded. He is in danger - hunted - by a man who is said to control great magicks. I would seek my brother’s council.” he bowed his head, unsure of whether he should say more, and then he gave a wry smile. This was what he still had to learn, he supposed. “Thank you.” he said to the sky instead, and then he turned and walked back to the castle. \n \n&gt;&gt;&gt;\n \n“Thor.” Harry, hidden by the chair who’s back was to the figure, all but fell out of his chair in his haste to spin around, wand in hand and pointing at the intruder to Thor's private sitting room. The man in the doorway lifted a brow of surprise before a small smile curled his lips in amusement. “So this is your bonded.” Harry glanced at Thor and the blonde immediately stepped forward, placing a hand on Harry’s shoulder.\n“You have nothing to fear, Harry. This is my brother, Loki. I called to him, seeking his council.” Harry just looked back at Loki, still not speaking, and Loki, in turn, frowned at Harry. \n“How old are you?” He asked, tilting his head as he regarded him. Harry looked up at Thor again, but when Thor smiled encouragingly, he finally spoke. \n“11.”\n“Fascinating.” he came forward then and Harry jerked back, colliding with Thor who steadied him easily. Loki raised his hands in the universal sign of surrender, but he crouched down so he was eye to eye with Harry. \n“You’ve not one but two magical signatures on your person. Only one of which reflects your true age.” Loki informed him, and Harry blinked back.\n“How?” Loki lifted a hand but didn’t reach out, looking at Harry instead. When Harry gave a slow nod of permission, Loki reached out, touch gentle, and brushed his fingers against Harry’s lightning bolt scar. The pulse of pain was brief and intense and Harry realized he must have lost consciousness briefly because next thing he knew he was sitting in the chair once more, Thor at his side but Loki kneeling in front of him now. \n“My sincerest apologies.” Loki offered, frown in place. “I had no idea it would fight even the touch of magic.” Harry blinked, his head pounding, but he cleared his throat. He had questions. \n“What - what is it?”\n“A piece of a soul.” Loki said, glancing at Thor. Harry followed his gaze and saw Thor looked beyond enraged. He shrank back from it. If he had someone else's soul attached to him - \n“Does that mean you aren’t really my soulmate?” He asked, voice small, and it was Loki who answered with a scoff. \n“Ignore him.” he ordered, making Harry jump. “His reaction to everything is anger first because he is an oaf who uses brute strength when cunning would do. The piece of soul that inhabits your scar has no affect on your splitting.” Loki cast a glare at Thor though his words were aimed at Harry. “He clearly has no idea that you would regard his anger as directed at you when you clearly know as little about soul magic as he does.” Harry wasn’t certain if he was supposed to be insulted by that or not.\n“I’m trying to learn.” he admitted. “But the books are locked up. And I’ve only been able to sneak in once or twice.” and his cheeks pinked. Loki smirked, the expression pleased.\n“Well, you’ve certainly got the brains between the two of you. If you’d like, I can provide you with the sorts of books I imagine you’re looking for. That this place would keep them from you only proves their inadequacy.” then he waved a hand, clearly done with the subject for now as his sharp gaze focused on Harry’s scar once more. \n“Could the piece of soul cause nightmares?” Thor interrupted, and Harry looked back up at him in surprise. Thor placed a hand on his shoulder, expression apologetic. Harry leaned into the touch, accepting.\n“Of course. What do you see in your nightmares?” Harry was silent, looking at his hands, face pale. He’d told Thor about his nightmares, but it felt weird telling his brother. The brother he’d only just met. He looked back at Loki who was watching him patiently, and realized that Thor obviously really trusted Loki if he’d called for him, and he trusted Thor. \n“My mum. When she dies. I hear her scream my name. Then a laugh. Then bright green light. Then my scar hurts so much I wake up.” Loki’s expression had grown more and more severe as he’d spoken and he nodded, looking back to Thor.\n“The wizard you called me for.” and it wasn’t really a question, but Thor nodded. \n“I did not realize-” but Loki waved off his words before he could even really speak them. He looked back to Harry. \n“Do you want to stop him?” and Harry frowned. \n“Of course.” but Loki’s expression hadn’t changed, was just watching him, expectant. Harry took a deep breath, trying to organize his thoughts. He was only 11, he’d never considered the fact that he might have to make such a decision. He was fairly sure he was too young to really make it properly, but both of these people were looking to him for a decision. He wondered if it was a test. Harry took a breath. \n“He killed my parents.” he said slowly, brow scrunched in focus. “I think he killed a lot of people, really, and he tried to kill me. I think people are so scared they won’t even say his name, which means if he really did come back he would try to kill people again. All he cares about is power. He just wants to control everyone. Killing people because you want power is wrong.” and Harry nodded, firm, confident now. “It’s wrong. I want to stop him.” and when he met the gaze of both brother’s, they were watching him with varied expressions of pride. \n“Very well. In order to stop him, we’ll have to make sure there is nothing tethering him to this world. Fortunately for us, he is tethered here, to your scar. With that, we can find and make sure there is nothing else left of him in this world - then I can remove the fragment from you as well. What do you say?” and Harry nodded fervently. Loki stood then, looking at Thor, and his expression was amused.\n“It seems even in banishment you manage to involve yourself in world changing events.” Thor grinned, wide and bright.\n“This journey is that of my bonded.” he boasted, and Loki rolled his eyes. “I am only able to join because he gave his permission.” Loki turned a curious gaze on Harry once more.\n“He asked to join you?” Harry nodded, confused.\n“He said it’s always my choice.” he didn’t really understand why Loki’s expression went all soft, or why he reached out then to clap a hand to Thor’s shoulder. \n“I will join you properly in a day’s time.” and then with that, he disappeared from sight. Harry just blinked at Thor who smiled at him in turn. \n“It would seem we have a proper quest on our hands.” Harry offered a tentative smile back. \n“Onwards?” Harry asked, almost cautious, mimicking their first decision to stay together. Thor ruffled his hair, pleased and affectionate in his agreement. \n“Onwards.” "
}