{
    "id": "18052598",
    "url": "https://archiveofourown.org/works/18052598?view_full_work=true",
    "author": [
        "Esselle"
    ],
    "title": "Thanks for Saving Me",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Midoriya Izuku/Todoroki Shouto"
    ],
    "characters": [
        "Midoriya Izuku",
        "Todoroki Shouto"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence",
        "Quirkless Midoriya Izuku",
        "Pro Hero Todoroki Shouto",
        "College Student Midoriya Izuku",
        "Romantic Comedy",
        "Awkward Crush",
        "Celebrity Crush",
        "Age Difference",
        "First Time",
        "Supportive Class 1-A (My Hero Academia)"
    ],
    "language": "English",
    "series": "Part 1 of Thanks for Saving Me",
    "published": "2019-03-09",
    "completed": "2019-04-27",
    "words": "46,179",
    "chapters": "7/7",
    "comments": "2,130",
    "kudos": "25,180",
    "bookmarks": "5,975",
    "hits": "326,637",
    "summary": "<p>\"You saved my life,\" Todoroki says. </p>\n<p>Izuku freezes. Then he looks up. Todoroki Shouto is staring at him, his eyes calm but wide, dust and soot all over his face. His perfect, handsome face. He's more beautiful in person than Izuku could have imagined. </p>\n<p>\"You just saved all of us,\" Todoroki says again. \"What's your name?\" </p>\n<p>\"M-Midoriya,\" Izuku chokes out. \"Midoriya Izuku.\" </p>\n<p>Todoroki nods. \"Midoriya. Thank you.\" </p>\n<p>-- </p>\n<p>Midoriya Izuku is a university sophomore, a fanboy, quirkless. On the list of things he is not: a hero. </p>\n<p>That's why he's more surprised than anyone when he rescues Todoroki Shouto, his favorite pro hero, from a deadly villain attack. His actions fling him into the media spotlight, grabbing the attention of the entire country, including Todoroki himself. But Todoroki actually wants to get to know him past the headlines. </p>\n<p>Izuku finds himself living a story straight out of a fairy tale, one where the mysterious, handsome prince is played by the real-life superhero he has always admired. But Izuku is convinced he's the ugly duckling, not the swan; could he ever be remarkable enough to get his happily ever after?</p>",
    "notes": "<p>A quick heads up: this fic is preemptively rated M for much later sections (and may switch to E), but could basically be rated T up to that point. I just want to avoid any surprises!</p>\n<p>The most grateful thanks to RC, Ellie, and Val, for being here for this fic from the moment the idea broke to helping me finally nail down a title (especially RC, not just for creating the title banner, but who was drunk and very supportive when I first started talking about the idea for the story, and then forgot everything so that she could be re-surprised by each plot point later on)!!! You guys bore the brunt of my agonizing for many weeks and I owe it to you all for helping me make it through! &lt;3333 </p>\n<p>And thanks so much to the friends who read through this ahead of time and let me ramble at them about the story (and my frustration levels) as it was coming along!!! Ainu, Cat, Karli, Jessie, Zine Stress District seagulls.... XD I really appreciate you listening and all the encouragement so, so much :')</p>\n<p>Finally, onto the story. I hope you all enjoy &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>There's a bunch of Hollywood Science-y stuff in this chapter for which I had to do a lot of googling and fudging of details and it is probably still wrong, so please take it with a grain of salt.</p>\n<p>There is now some <a href=\"https://twitter.com/ainudraws/status/1106988026150952960\" rel=\"nofollow\">really beautiful art</a> of the scene from chapter 1 when Todoroki helps patch up Izuku's cheek, courtesy of the lovely <a href=\"https://twitter.com/ainudraws\" rel=\"nofollow\">AinuDraws</a>! &lt;3333 Go looook tddk are so cute ;;</p>\n<p>Also just so everyone's clear, because this is Very Important -- I'm imagining Todoroki is like, Chris Evans build/stature in this fic... but taller, probably. And maybe his waist is a bit less narrow. Regardless: BIG. (Also, he's around 26 years old.)</p>\n<p>Good? Good. Proceed:</p>\n<p>Thank you so much everyone for all the kind words and comments!!! I'm sorry I couldn't reply to all/replied late to many, but I've been reading them all week and they have encouraged me so much! This story was so self-indulgent, and it just makes me really happy to hear people are able to enjoy it along with me &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>The ending of this chapter was really important to me in terms of the fic as a whole. In keeping with the canon divergence, this is my stand-in for two scenes from the start of Izuku's original story: it takes place on a rooftop because that is where All Might first told him there's no way for him to be a hero without a quirk; but also takes place at sunset, because that was the time of day when All Might found Izuku again to tell him he COULD be a hero, because he has something even more vital than power -- his determination and heart! </p>\n<p>This story revolves around Shouto seeing that spark in him and acknowledging him as a hero from the start, and that's why I set this scene up the way I did. </p>\n<p>Thanks especially once again to <a href=\"https://twitter.com/reallycorking/\" rel=\"nofollow\">Reallycorking</a> for her art &lt;3333 She captured exactly what I hoped for, and I'm just really grateful :)</p>\n<p>Welcome back everyone! &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>In case anyone doesn't know what they are, this is a <a href=\"https://s3-ap-southeast-1.amazonaws.com/seenitcdn/378285971dec3ecc9c.jpg\" rel=\"nofollow\">typical henley shirt</a> :D</p>\n<p>Also! This upcoming week I am going on VACATION WITH RC!!! <b>This likely means I'll be skipping next Saturday's post date,</b> as I won't have time to edit the chapter. I'll update on Twitter one way or another, but just want to give everyone the heads up!</p>\n<p>We're back! Thanks for your patience, friends! </p>\n<p>Thank you immensely and always for all the kind words and feedback and support (and for all the well wishes on my trip last week! I had an amazing timeee)! Hope you all enjoy this new chapter &lt;3</p>\n<p>Can't believe we're almost at the end... thank you all a thousand times for your kind words and for sharing your enjoyment of this story with me (´• ω •`) ♡</p>\n<p>BTW <a href=\"https://curiouscat.me/Esselle_hq/post/841668074\" rel=\"nofollow\">I answered an ask</a> about how Shouto developed into the person he is when Izuku meets him in this AU, and I think it's particularly relevant to this chapter if anyone wants to read it!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>The comments on chap 5 made me laugh because several people expected something to go horribly wrong and I just had to hold my tongue while knowing that was absolutely not the case XD </p>\n<p>ANYWAY y'all remember back in my notes of chapter 1 when I said the rating of this story will probably go up? Next week is <i>that time.</i> (Yes... the last chapter is the smut chapter.)</p>\n<p>Thanks for reading me &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">more notes</a>.)\n</p>\n<p>Don't be afraid to dive<br>Be afraid that you didn't try<br>These moments remind us why<br><a href=\"https://www.youtube.com/watch?v=ev09JMjGSLk\" rel=\"nofollow\">We're here, we're so alive</a></p>\n<p>--</p>\n<p>Whether you've been reading from the start, or are just joining now, THANK YOU SO INCREDIBLY MUCH for taking this ride with me!!! Editing this final chapter made me really emotional, because I've truly been so blown away by everyone's support and kind words; I realize I sound like a broken record probably, but I just can't thank you all enough for reading my fic(s). It'll always mean the world to me. Thank you for being here, so I can tell you stories. </p>\n<p>And of course, because I fell so in love with TFSM, I'm not quite done with it yet -- so please feel free to subscribe to the <b><a href=\"https://archiveofourown.org/series/1344193\" rel=\"nofollow\">series page</a></b> I have created for it! Most people are probably aware I've already started up a fic for Todoroki's POV, <i><a href=\"https://archiveofourown.org/works/18609220/chapters/44120356\" rel=\"nofollow\">\"Thanks for Texting Me\"</a>!</i> I hope I get to keep chipping away at more stories for this verse (but I am working on quite a lot of other things and I know my tendency of getting distracted, so we'll see where the road leads)!</p>\n<p>I also wanted to put links to all the fan art that I've been so lucky to receive for this fic! Please give them a look and share my appreciation ^^</p>\n<p>The <a href=\"https://twitter.com/d_ominaecaede/status/1120365727267975169\" rel=\"nofollow\">first kiss</a> scene, beautifully illustrated by Domi!<br><a href=\"https://twitter.com/aoba_hime/status/1114973856362446848\" rel=\"nofollow\">THE HENLEY</a>!!! by Aoba_hime, ty for blessing us &lt;333<br>And Coco drew <a href=\"https://twitter.com/CocoNoSuga/status/1112891135251234816\" rel=\"nofollow\">Izuku in Shouto's pajamas</a>, <a href=\"https://twitter.com/CocoNoSuga/status/1108854191458377728\" rel=\"nofollow\">interview-ready Todoroki</a>, and <a href=\"https://twitter.com/CocoNoSuga/status/1109769496942637056\" rel=\"nofollow\">the closet scene</a> (ahhhhh) &lt;3333</p>\n<p>Thank you so much once again, to everyone &lt;3 Hope to see you in the next story :)</p>\n<p>Not sure which of my stories to read next? <b><a href=\"https://esselle.carrd.co/\" rel=\"nofollow\">Check out my guide to my fics on Carrd!</a></b></p>\n<p>[Multishipping at <a href=\"https://twitter.com/Esselle_hq\" rel=\"nofollow\">@Esselle_hq</a> / Instagram at <a href=\"https://www.instagram.com/esselle.fics/\" rel=\"nofollow\">@esselle.fics</a>! Writing updates <a href=\"https://twitter.com/Esselle_on_AO3\" rel=\"nofollow\">@ Esselle_on_AO3</a>! I also have <a href=\"https://curiouscat.me/Esselle_hq\" rel=\"nofollow\">Curious Cat</a>.]</p>",
    "text": "Midoriya Izuku is nineteen years old, an unremarkable college sophomore in everything aside from the nature of his unremarkability.\nHe's quirkless. At worst, a magnet for bullying, but nowadays he's mostly just a scrawny, shortish young man, easily and quietly dismissed by those around him. He double majors in Chemistry (with an emphasis in thermodynamics) and Hero Studies. He's a member of the Pro Hero Fan Association at his college—he would like to be president of the club by his senior year, but currently some of its members are skeptical of how qualified he is to discuss heroes without having a quirk of his own.\nRight now, he's content to attend club meetings and contribute whatever he can, most specifically his vast and extensive collection of All Might merch and knowledge. All Might has been his idol since early childhood, and the man's decline in the last decade has not done anything to diminish Izuku's literal hero worship. But a lot of his peers have started to move on to the newer, younger heroes. Even Izuku has his favorites among the new crop.\nMostly, he likes the Yuuei heroes, because that's where All Might went. The academy is still famous for the talent it breeds, and many of its new graduates are already predicted to be announced as nominees for multiple awards categories at the Annual Japan Hero's Gala later in the year. Considering how young most of them are, this is a notable honor.\nUravity had quickly stolen Izuku's heart (not just because she's cute! Although… yes, she is very cute), and he likes Ingenium a lot because of his extreme earnestness. Lemillion is basically unstoppable, and Ground Zero and Red Riot are  awesome—they're everyone's favorites, of course. Bakugou Katsuki is actually from the same hometown as Izuku, and Izuku even went to his old middle school, though that was years later. Izuku has been one of his biggest defenders for years even when nobody else really liked him, but now that he's one of the top five pros everyone's jumping on his bandwagon.\nEven though he wasn't a Yuuei student, Izuku likes Hawks for the cool factor, though he thinks Hawks's former sidekick turned pro hero Tsukuyomi is cooler (most people… disagree, so Izuku tends to keep this opinion to himself). On the flipside, he never really got that invested in the new #1 hero after All Might—Endeavor. Maybe the blow of losing All Might as the Symbol of Peace was just too bitter at the time, but Endeavor was always such a  different kind of hero that Izuku's obsession never kicked off in the same way.\nEndeavor's son, however, is a different story.\nIzuku's uncontested favorite after All Might has been, for at least the past six or seven years, the pro hero Shouto. Todoroki had just started to rise up through the ranks when Izuku was entering middle school. The more he did, and the more Izuku learned about him, the more he found himself having the traitorous thought that Todoroki was the actual  coolest. \nThis had made him feel guilty at first—All Might was, and would always be, the coolest! But there's just  something  about Todoroki. The hair, the eyes, the scar, and  that quirk. Izuku has spent years analyzing it, pouring hours into research, scribbling away in his notebooks.\nThe motive behind his obsession is embarrassing. Todoroki's track record as a hero alone is enough for no one to question why Izuku likes him so much: the #5 pro after Ground Zero, Hawks, Endeavor, and Lemillion; an intimidatingly long and ever expanding list of rescues and villain arrests; a not insignificant reputation as an eligible bachelor and one of the most beautiful faces in the hero business—the reasons go on and on.\nBut Todoroki became Izuku's (second) favorite just after his debut, back when Izuku was still in grade school. There's an old video online—newsreel footage, taken just after a fairly large scale villain attack in the middle of the city. The video is mainly an interview with Endeavor but the scene of the attack is visible in the background, with heroes still helping with the clean up.\nFor a very brief moment during the video (judicial slowing and pausing is required), Todoroki appears in the background. He had still been something of a nobody at the time, though afforded a bit more attention due to his family connections. But at that moment, nobody was watching him. Nobody saw him stop what he was doing upon noticing a little girl, uninjured but alone, sitting off to the side of the crime scene. Nobody saw him crouch down to talk to the girl, before picking her up and walking out of frame.\nIzuku had scoured the internet for news articles, before finally finding a tiny footnote in one paper from a small local news outlet, just a couple of sentences, from the mother of the girl. She had been separated from her daughter, taken to the hospital after she'd been knocked unconscious during the attack. Todoroki had personally brought her daughter to her.\nRight at that moment, Izuku fell. In years to come, people would always point to one of Todoroki's defining features as a pro being his cold and aloof personality. It's part of his allure. But Izuku has always known there's another side to him, as warm as they come.\nSo, naturally, he pretty much flung himself headfirst into revolving his life around Todoroki.  Half-Cold Half-Hot is the whole reason he became a chemistry major in the first place. He picked up Hero Studies not as a hobby or afterthought, but hopefully to propel along his ideal career path. His dream is to one day work for the Todoroki hero agency, developing support items for Shouto himself. He does like chemistry as well; all the possibilities for theoretical-to-practical application interests him greatly, and gives his brain an outlet when it starts working overtime (like, for instance, obsessing over which awards Todoroki will likely be nominated for—and win!—at the Hero's Gala).\nWhen he's not in class, Izuku has a part time job on weekends as a university tour guide for his school. He mostly likes his job; the high school kids and their parents don't know he's quirkless and they usually don't find out over the course of an afternoon. Mostly the parents just have a lot of questions he's not really qualified to answer, and the kids are impressed by him simply because he's in college. At least, they are at first; his standard tour guide uniform of a short-sleeve gingham shirt and khakis is not exactly the height of cool, and he's fairly awkward and easily excitable, even at his best. The illusion of Chill Older Guy usually fades pretty quickly. Generally, they only make fun of him when his back is turned, and not very loudly, so it's not so bad.\nIt's an otherwise typical Saturday afternoon on campus. He's taking a group of high schoolers around the science building to show them some of the facilities, and they're a pretty attentive group, asking lots of questions, although a couple of them have been imitating him and giggling about it whenever he accidentally talks too fast and starts stammering. They don't seem to mean any real harm and he just smiles sheepishly and reminds himself to calm down and speak at a normal pace whenever it happens.\nThey're in the chemistry building, Izuku's home turf, and nearing the end of the tour when the ground floor suddenly explodes without warning.\nIzuku has spent his entire life being obsessed with heroes. Now, during his first encounter with real, live villains, his first thought is:\n\n I could never have been a pro. \n\nIt's terrifying. The ground keeps shaking beneath his feet—he can't tell if it's more explosions, or if structural damage to the building has weakened it to the point of collapse. There is smoke everywhere, choking him. People are screaming, crying—mostly kids a lot younger than him, too young, afraid they're going to die.\nIzuku's second thought is:  I have to get them out of here. \nHe sucks in a lungful of air, coughs violently, and calls out, \"Everyone!\" Then again, as loud as he can, when no one hears him the first time. \"LISTEN! We need to go out the fire escape and get down to the ground. Quickly!\"\nPeople start to take notice, possibly because he seems to be the only one doing more than panicking. Though, to be clear—he is definitely panicking. But he's the only person who knows this building, so he's got to  act. \nHe keeps his voice loud, jumps up and down to make sure the kids can all see him as he herds them out of the classroom and down the hall—he's not very tall. He reaches the fire exit door at the end of the corridor and flings it open, to be met by blessed fresh air. The scene outside is a nightmare—other buildings have been attacked, and are on fire. Helicopters already hover above the campus, news crews filming the carnage from a safe height.  \n\"One at a time, please don't push!\" he calls, as the kids all start to file out onto the fire escape ahead of him. Thank god, thank god, they're going to make it out.\nHe has this thought a split second before the most violent explosion yet rocks the building, knocking him to his hands and knees.\nScreaming erupts again, but this time it's accompanied by the horrifying shriek of grating metal, as the fire escape begins to tear away from the side of the building right before Izuku's eyes. Half his tour group is already on it.\n\"NO!\" he screams, completely helpless,  useless—as he watches it fall.\nAnd then, someone saves them.\nThere's a crackling, crystalline sound, the most familiar, wonderful sound to ever reach Izuku's ears. It comes a split second before a massive slab of gleaming ice rises with blinding speed, appearing almost out of nowhere to bracket the fire escape, holding it fast and secure against the side of the building.\n\"I have it!\" a voice shouts, and Izuku was wrong—that's  the most familiar, most  wonderful sound he's ever heard, and he looks and sees him.\nBeneath the fire escape, looking up at them all, stands their savior:  pro hero Shouto. \n\"Oh my god,\" Izuku whispers.\nThen he realizes he's going to have to save his fanboy meltdown for later, because he can't tell his mom about this if he's fucking dead.\nHe jumps to his feet and starts directing the kids back down the fire escape. \"Wrap your sleeves or your shirts around your hands!\" he yells. \"And watch your step on the ice!\" He knows from his research that Todoroki's ice is cold enough that once exposed to outside air, the surface will begin melting instantly, causing it to become slippery.\nThey've almost all made it onto the fire escape, when one of the last girls to climb on turns to him, weeping openly.\n\"You have to get on—\" Izuku starts to tell her, but she cuts him off.\n\"We—we got separated,\" she gasps, \"and I don't see her, I don't think she went down yet—\"\n\"What?\" Izuku asks. \"Who?\"\n\"M-my friend—\"\nHe feels fear mounting again. He recognizes this girl, because she and her friend were the two that kept mimicking him. He has gotten a pretty good look at everyone as they fled onto the fire escape. He has not seen the other girl.\nSomeone screams from behind them—from inside the building.\n\"Fuck,\" he says. \"Okay—go, you  need to go. I'm gonna get your friend!\"\n \"You are?!\"\n\"Just go!\"\nHe only hesitates for a second, long enough to make sure she starts out onto the stairs, before turning and racing back through the door. It's bad inside. The air is thick and smoky, enough to make his eyes water, and the last blast that rocked the building seems to have crumbled parts of it. Sections of the roof and hallway have caved in, resulting in a huge pile of rubble. And then he sees what he's looking for, and his heart jumps into his throat.\nThere's a girl, struggling and trapped beneath some of the rubble. She must have been one of the last ones in the line to get out, and nobody noticed in the explosion. Izuku rushes to her.\n\"Are you hurt?\" he yells, and she startles so badly upon seeing him that it almost scares him in return, before she starts sobbing. He can't even make out any words. Izuku takes a deep breath. \"Hey, it's okay now—I-I'm here!\"\nAll Might's catchphrase blunders leaving his mouth, stammered and hardly heroic. But the girl stops panicking long enough to listen to him.\n\"More help is on the way. But I need you to tell me if you're hurt!\"\n\"M-my leg hurts,\" she says. \"And I can't move!\"\nThe pieces of rubble she's stuck under are undoubtedly heavy. Izuku swallows. \"Okay,\" he says, \"okay, just stay calm, and I'm gonna get you out.\"\nHe doesn't know if he can do it. But he has to try, or at least, make her think he can. He can't just let her be afraid.\nHe hefts some of the loose slabs of concrete off the pile as best he can. Oof, those are already nearly too heavy for him, but he'll never be able to do it all at once. His palms get scraped to hell clearing things away, but finally, it's just the last toppled chunk of the wall left. Gritting his teeth against the pain in his hands, he plants his feet, grips the edge, and heaves.\nRight away, he can tell it's not going to happen. He swears and strains, sweat pouring off him. He swears to himself he'll put in more hours at the gym after this, if he survives. But the concrete isn't moving, no matter how hard he pushes. The girl watches him with terrified eyes.\n\"Please don't let me die,\" she begs.\n\"I'm not going anywhere! I promise—\" he wheezes, and then throws all his weight into it, \"I promise I won't leave you!\" \nThe concrete starts to shift. Izuku is so surprised that he almost loses his grip on it, but a voice calls out to him to \"Move!\"\nHe gasps and spins around. He's no longer alone in the hallway. Todoroki has arrived, ice lancing forward to lend support to the crumbled concrete, before it spikes upward, a protective sheet forming over the girl as more ice pushes the rubble away with sheer force, power unrestrained. Izuku wants to cry with relief, and shock.\n\"Crawl!\" Izuku urges the girl, and he reaches out to her as she scrambles free of the debris. He helps pull her, supporting her as she gets to her feet with a wince. Nothing looks broken, but her ankle may be sprained. \"Okay, you go—out the door at the end of the—\"\n \"Look out!\" Todoroki shouts, and before Izuku can tell what's happening, a wall of ice rises in front of them. But an explosion follows immediately, and the ice barrier simply shatters.\nIn the back of his mind, Izuku registers that something is strange. There is no light, no heat, accompanying the blast. But then the dust clears, and all his thoughts are wiped away as he stares down the hallway right at one of the villains responsible for everything. All he has room for is fear.\nIt's hard to tell if the villain is a man or a woman; they're covered from head to toe in some kind of formless, black getup. They raise a hand—or what would have been a hand on a normal person. At the end of their arm is a strange, whirling black mass, like looking down a darkened tunnel.\n\"R-run,\" the girl says tearfully.\n\"No—\" Todoroki starts to say.\n\"Exit is too far, his quirk is long range,\" Izuku rattles off in one breath. \"He just blew up the ice from that distance, and she's injured. We'll never make it.\" Trying to carry the girl will slow him down too much, and Todoroki can't pick her up and use his quirk at the same time. Izuku pushes the girl behind himself nonetheless. It probably won't do anything to save her.\n\"Classroom,\" Todoroki says under his breath. The black mass at the end of the villain's arm starts to shudder alarmingly. \"GO!\"\nTodoroki throws out more ice, this time aiming for the already weakened support structure of the building. The rest of the hallway crumbles, as Izuku and the girl race for the nearest classroom doorway, her arm over his shoulder. He hears the explosion, and turns just in time to see a blast of wind send shards of concrete and ice flying. Todoroki is caught in it; he's spun around by the force, his costume tearing to shreds. He staggers, falling through the doorway, and Izuku slams it shut and locks it, for all the good that will do.\nThey have probably seconds, maybe a minute tops, to figure out what to do before the villain blasts away the rubble Todoroki caved in to get to them. Izuku tries to take a deep calming breath, and smells, beneath the smoke, a musky, sweet odor.\nHis plan forms.\n\"Are you okay?\" Izuku asks Todoroki. The pro hero is slumped alarmingly on the floor, leaning against the wall, teeth grit in a grimace as he clutches his right arm. He doesn't seem to be able to stand.\n\"Right side,\" Todoroki says. \"Can't feel it. Don't think I can use my ice. When the villain comes in, I'll use my left so you two need to take cover—\"\n\"No,\" Izuku says hurriedly. He can barely contain his panicked glee over the phrase \"use my left\" because—Todoroki.  Is talking to  him.  About his  quirk.  He would be convinced this is a dream if he wasn't so absolutely sure he's about to die. He has to focus. He waves his finger in the air vaguely. \"Do you smell that? The sweet smell?\"\n\"Yes,\" Todoroki replies. He's staring, famously recognizable eyes sharp and all attention focused on Izuku, which is something Izuku can't afford to process right now or he'll stop functioning.\n\"That's ethylene,\" he says. \"It must be leaking from somewhere and it's flammable as hell.\"\n\"Shit,\" Todoroki mutters.\n\"It's fine,\" Izuku says, \"because it's also gonna save us.\"\nTodoroki's eyebrows raise. \"How?\"\nAnother explosion blasts down the hallway—likely the villain clearing a path to them, but Izuku shudders to think of what would have happened if they'd still been standing out in the open. He needs to move fast, or he might still get to find out.\n\"Actually, it's not, exactly—but its hydrate, diethyl ether, sure can,\" he explains, because if he just keeps talking, maybe he can keep calm enough, have the presence of mind to do this.  \"And if they're keeping some in here—which they should be, if I'm smelling ethylene—we can use it to knock this bastard out cold.\" He looks at the girl stuck there with them. \"What's your name?\"\n\"H-Hana…\" she whispers.\n\"Okay!\" Izuku smiles at her. \"Hana-chan, I really, really could use an extra pair of hands to help find this hydrate. Be extra careful, and start looking in that cabinet over there, okay? It will be clearly labeled. Diethyl ether.\" He spells it out for her just to make sure she's got it.\nThe chemicals in this lab aren't a joke. He hates that he doesn't have time to give the girl safety gear, at least a pair of gloves, but they're already opening shelves, searching frantically. Another explosion goes off outside, and Hana yelps in fright.\n\"Hana, do you know what a hydrate is?\" Izuku calls to her.\n\"What?\" she asks, bewildered. \"N-no…\"\n\"Well,\" he says, trying to ignore the way his own hands are shaking, \"a hydrate is just a substance that contains water. They're created by adding water, or its elements, to another molecule.\"\n\"O… okay…\" Hana whimpers.\n\"Yup, pretty cool stuff!\" Izuku says. Another  boom, closer. He flinches, and keeps going. \"S-so,\" he croaks, \"diethyl ether is a liquid f-formed out of the—the vapor-phase hydration of ethylene. It used to be used as an anesthetic.\"\n\"You mean,\" Hana says, \"it'll put him to sleep?\"\n\"Exactly,\" Izuku tells her. He glances at Todoroki to see that Todoroki is still watching him intently.\nHis eyes are really, really beautiful. Izuku has never seen them up close before, only in videos and magazines.\nThere are footsteps outside, and he wrenches his gaze away. A shadow seeps into the room beneath the crack under the door. There is someone standing right outside it. Izuku's heart hammers so hard he is sure the villain on the other side can hear it.\n\"S-senpai,\" Hana says, so quiet he can barely hear her.  \"I found it.\" \nIzuku reaches out without looking at her, eyes still fixed on the door. He feels a bottle settle into his palm.\nThe door blasts open. With a monumental effort, Todoroki pulls himself upright, planting himself between the civilians and the villain, ready to fight with his bare hands—but then Izuku pops the cap off the bottle, pulls his arm back, and flings it as hard as he can over Todoroki's shoulder.\nIt hits the villain square in the head and shatters. They stagger backwards, and Todoroki charges, lunging clear off his feet to bodycheck them out of the door right as they fire off another explosion from the vortex stump of their arm. It blasts so close to Izuku that it slices a cut open on his cheek, narrowly misses Hana, and blows a gigantic hole through the back wall of the building. Izuku stands there, paralyzed for a brief second, before recovering.\n\"Shouto!\"\nHe flings himself through the doorway and sees Todoroki lying next to the villain on the floor. The hero struggles to sit up, but the villain doesn't move.\n\"It worked,\" Todoroki says, as Izuku rushes to his side. \"They're passed out.\"\nIzuku collapses to his knees next to him. \"Holy shit,\" he whispers, \"holy shit, holy shit, holy—\"\n\"Hey,\" Todoroki says, and a steadying hand lands on Izuku's shoulder. \"Take a deep breath. Slowly.\"\nIzuku nods, inhaling deeply. He needs to make sure Hana is okay. He needs to stop trembling. He needs to get out of this fucking building. He needs—\n\"You saved my life,\" Todoroki says.\nIzuku freezes. Then he looks up.\nTodoroki Shouto is staring at him, his eyes calm but wide, dust and soot all over his face. His perfect, handsome face. He's more beautiful in person than Izuku could have imagined, even now when he looks more disheveled than Izuku has ever seen him when he's staring out of the pages of some glossy magazine spread. He looks older than he usually does in those photoshoots, too, maybe because of the lack of makeup, or possibly due to the extremely recent near-death experience. He's also  huge,  up close; not quite as big as his six and a half foot father, but still tall and broad and  sturdy. \n\"You just saved all of us,\" Todoroki says again. \"What's your name?\"\n\"M-Midoriya,\" Izuku chokes out. \"Midoriya Izuku.\"  \nTodoroki nods. \"Midoriya. Thank you.\"\nIzuku bursts into tears. Without thinking, he flings his arms around Todoroki, sobbing disgustingly into the older man's shoulder. After a second, he feels Todoroki's arm come up, and a warm hand pats him soothingly on the back.\n\"It's alright, now,\" Todoroki just keeps repeating softly. It's a different kind of reassurance than All Might's, less bombastic, but no less comforting. Izuku just clings to him and cries, and Todoroki doesn't push him away.\nThe other pros find them like that in just a few minute's time. They bring Izuku, Todoroki, and Hana out to safety, where Hana is reunited with her friend. All the other kids are safe, and ambulances have started arriving in droves. Izuku is almost immediately mobbed by paramedics, and he doesn't even have the strength remaining to say anything as Todoroki moves off in the direction of the other heroes where the news crews are already gathering. His movements, especially along his right side, are still very stiff.\nThe paramedics check Izuku out thoroughly to make sure he's okay and doesn't need to go to the hospital. They bandage his hands and give him water and wrap a blanket around his shoulders. He sits in the back of an ambulance, kicking his feet aimlessly. He can't stop shaking.\nNearly a half hour has passed when someone drops down to sit next to him, startling him. It's Todoroki, again. Izuku stares at him. The danger is behind them, which means Izuku is now all too acutely aware of the fact that he has to exert the mental effort to form sounds into syllables to make words to speak to Todoroki Shouto, in the flesh.\n\"Hello, again,\" Todoroki says.\nIzuku gurgles.\nTodoroki is there to get looked over by the medics as well, which they do with brusque efficiency, checking his reflexes, and any larger injuries. When he's deemed fine, they move off, leaving Izuku alone with him. Alone with Todoroki. Todoroki's costume, shredded on top after the villain's first explosion, exposes a lot of bare skin. Izuku is spiraling.\n\"How are you doing?\" Todoroki asks him.\n\"Um,\" Izuku says, his voice coming out a shrill squeak. How… is it possible for a human being to be so attractive? How is Todoroki's voice so  low, and so nice? \"I… don't… know.\"\nTodoroki snorts, and Izuku panics internally. He must sound so dumb. Todoroki must think he is an idiot.\n\"Yeah, that's fair,\" Todoroki says.\n\"It—\" Izuku gapes at him. \"It is?\"\n\"Villain encounters suck,\" Todoroki says with a shrug. \"And that's even when you're trained to handle them. You aren't, but what you did back there? That was impressive.\"\nIzuku's face explodes into heat. \"N-n-no!\" He waves his hands frantically. \"Me? I didn't do anything! You saved  everyone on the fire escape, and you made sure we didn't get hit by all those crazy explosions, and you freed Hana-chan—\"\n\"I was wondering where you went,\" Todoroki says, and Izuku falls silent. \"I saw you at the top of the stairs, then the next second you were gone. That's when the other girl came running up to me. She told me you went back to save her friend.\"\n\"I—I tried,\" Izuku says, completely ashamed at the reminder. \"But I couldn't. We would've both died if you hadn't—\"\n\"You  went back,\" Todoroki repeats. \"And then you were there to save us both, when I couldn't do anything.\"\nIzuku ducks his head, his lower lip wobbling. \"That was just… really lucky.\"\n\"It  is lucky, that you were there,\" Todoroki says, and then nudges Izuku's shoulder with his own. \"Guess I owe you.\"\n \"What?\" Izuku jerks around to look at him. \"You don't—Shou—Todoroki-san—\"\n\"Todoroki is fine,\" Todoroki says, with a look that suggests he's trying not to laugh.\n\"Todoroki-san,\" Izuku says again, emphatically. \"You don't owe me  anything. Without you, we'd all be de-dead.\" He swallows. Saying it out loud is a bit terrifying, even after the fact.\n\"Yes,\" Todoroki says, \"just like I would have been if  you hadn't been here.\"\nIzuku opens his mouth to argue further and then stops himself at the look on Todoroki's face. He settles for a tiny nod, and staring at his feet.\n\"Midoriya.\"\nIzuku looks up at him again and almost passes out when he realizes how close Todoroki is—it only gets worse when Todoroki reaches over to grab his face, holding Izuku's chin in his hand so he can turn Izuku's head to the side. Todoroki narrows his eyes, peering at the long scratch on Izuku's cheek.\n\"They didn't give you anything for that?\" Izuku shakes his head and Todoroki clicks his tongue in annoyance. \"Hold on.\"\nHe clicks open one of the little metal canisters on his belt to procure a square band-aid patch and tiny tube of disinfectant. Painstakingly, he squeezes a little of the paste onto a cotton swab. His hands are very steady, even if they are a bit too big for the task. Izuku watches him, transfixed, and realizes he's got his tongue stuck between his teeth in concentration.\nOh, he's… he's so cute.\n\"Turn,\" Todoroki instructs him, and Izuku does as asked. \"Sorry if it stings.\"\n\"It's okay,\" Izuku says. He closes his eyes as Todoroki gently swabs at the cut to clear away the blood and grime. The disinfectant stings a little, but then fades to a tingly coolness. Todoroki finishes up by affixing the bandage over the cut. His left hand is warm as his fingers brush Izuku's cheek, just barely.\n\"Be sure to put more disinfectant on it when you change the band-aid,\" Todoroki tells him.\n\"Okay,\" Izuku whispers. He can't manage to get any more volume to come out than that. \"Thank you.\"\n\"Do you have your phone on you?\"\n\"Yes,\" Izuku says, surprised.\n\"Can I see it?\"\nSpeechless, Izuku fishes his phone out of his pocket and hands it over. Todoroki fiddles with it as he nervously watches, before handing it back a moment later. Izuku stares at the screen.\nTodoroki has created a new contact. For himself.  Todoroki Shouto,  and a phone number, right there in Izuku's phone.\nTodoroki Shouto just gave Izuku his phone number.\n\"Can I trust you with that?\" Todoroki asks him. Izuku nods lightning fast, staring down at his phone in shock. \"Good. Text me, if you want, so I can save your contact. I'll be in touch.\"\n\"W-with me?\" Izuku asks.\n\"No,\" Todoroki says, \"with the other guy who saved my life today.\"\n\"R-right…\" Izuku stammers.\nTodoroki pats him on the shoulder again and then stands, ready to depart. Izuku needs to—say—something.  Anything. Todoroki starts to cross the grass.\n\"Todoroki-san, wait!\"\nTodoroki turns. Izuku hops to his feet, out of the back of the ambulance, and bows as low as he can without toppling over.\n\"I'm—\" He struggles to get the words out. \"I wish it could've been under better circumstances, but I'm so—so  glad I could meet you!\"\nTodoroki nods. \"You know,\" he says, \"in retrospect, I don't mind the circumstances all that much myself. Take care, Midoriya.\" He bows, then; not quite as low, but respectful all the same. Then he waves goodbye and is gone, soon swallowed up by mobs of more important people who need him.\nIn his wake, Izuku feels like he is floating. All the people bustling around seem to have forgotten him, so he starts on the trek back to his apartment. He needs to call his mom; surely she's seen the news by now. He looks at his phone again and realization sets in once more.\n\n Todoroki said to text him. \n\n\"Oh, god,\" Izuku murmurs. His hands are shaking again—maybe even worse than they had when he was being attacked. \"Oh, jeez, okay—okay, I just gotta do this…\"\nHe taps on Todoroki's contact and sends a very quick and hopefully not embarrassing message:  Hi, Todoroki-san. This is Midoriya. Thank you again for everything!!! \nHe's already back in his apartment (lying on his bed and staring at the ceiling, still in a state of shock) by the time he gets a response. It sends his heart up into the stratosphere once again.\n\n Hello, Midoriya. I should have said back there: I'm glad we could meet today, too. \n\nIzuku touches his fingers to the band-aid again. He imagines he can sense the lingering presence of warm fingers there; it makes his head spin, and his chest feels light and like it's being tightly constricted at the same time.\nHe might have almost died today, but Izuku has never felt happier—because now he's had the chance to see for himself that Todoroki Shouto is every bit the hero he has always believed in.\n\n A phone call… is here! A phone call… is here! \n\nIzuku's phone wakes him up the next morning, shortly before his alarm. Half asleep, he pats his covers in search of it, answering it without even glancing at the Caller ID.\n\"Hello…?\"\n\"Morning, Midoriya.\"\nIzuku nearly drops his phone as he bolts upright in bed. \"T-T-To—\"\n\"Sorry to call you so early.\"\n\"Todoroki-san!\" he screeches. \"What—how—good morning?! Wh-why… are you calling me…?\"\nHe's still asleep. That's it. He  must  be dreaming; that's the only explanation possible for Todoroki's voice in his ear before eight AM, so husky and warm and low. Oh,  dear. \n\"I wanted to give you a warning…\" Todoroki says. \"Have you seen the news yet?\"\n\"The news? No…\" Izuku blinks in confusion. \"Um, one second?\"\nHe doesn't have a TV in his tiny apartment, but he grabs his laptop, fumbling to keep the phone caught between his shoulder and cheek as he boots it up. He should probably just put it on speaker but—he still can't really believe that it's  Todoroki on the other end. Izuku doesn't really want to put the phone down and have Todoroki talk to him from farther away… Okay, he's being creepy, isn't he?\nHe doesn't know  which news site to check, so he just pulls up NHK World to look at the homepage. For what feels like the hundredth time in far too few hours, his heart skips several beats too many.\n\"Why… why am I…\" His eyes feel like they're bugging out of his head. \"Why am I on the front page of the news?!\"\n\"Ah,\" Todoroki says.\nIt's true. News coverage of the villain attack from yesterday is plastered all over the homepage, but for some reason, one of the primary stories seems to be the one about himself and Todoroki facing the villain in the chemistry building. There's a video taken from one of the helicopters he saw, of him trying to get people onto the fire escape; Todoroki showing up to use his ice to save it from collapsing; then the camera zooms in on Izuku talking to the girl before turning and running back inside the building. There's multiple headlines, videos, articles:\n\n Heroic University Student Saves Two Dozen Lives \n\n\n Who IS Midoriya Izuku? \n\n\n Man Evacuates People From Collapsing Building (What He Does Next Will Shock You)\n\nAnd finally:\n\n Quirkless Boy Wonder Rescues Seasoned Pro \n\n\"Oh,\" he says softly.\n\"Midoriya?\"\nIzuku doesn't respond at first, too busy staring at the headline. Todoroki prompts him again, questioningly, and he shakes his head to clear it. The tone of some of the articles leaves a sour taste in his mouth, like what happened makes Todoroki less than capable, just because Izuku doesn't have a quirk.\n\"Nothing, I just, um—\" He clenches a fist in his blankets. \"They found out I was quirkless.\"\n\"Ah, that,\" Todoroki says. \"I think that may be why the story blew up in the first place. I wasn't expecting it to gain this much traction, or I would have warned you yesterday.\"\n\"Mmm,\" Izuku utters, a little whine in the back of his throat. \"I'm—I'm sorry.\"\nThere's a brief silence on the other end of the line that feels like it lasts slightly longer than it should, before Todoroki asks, \"Why are you apologizing?\"\n\"You didn't, um, you didn't know I was quirkless,\" Izuku says, \"and I didn't tell you, and now—\"\n\"There was no reason for you to inform me,\" Todoroki interrupts. \"I should be the one apologizing.\"\n\"N-no, it's fine—\"\n\"I know that kind of thing is private,\" Todoroki continues, \"but I don't think most people are thinking about it in this instance. And  I don't care if you're quirkless.\"\nIzuku sucks in an unsteady breath. \"You… don't?\"\n\"Not at all.\"\nIzuku knows—he's  known, with every fiber of his being—that Todoroki is a good person. He's always believed that. But this one tiny thing, that Todoroki has acknowledged and accepted about him, is so personal. It's so different from knowing Todoroki jumps into burning buildings to save civilians. It's something he's done only for Izuku.\nIzuku is grateful.\n\"How did they… how did people even find out who I am?\" he asks tentatively.\n\"I, uh,\" Todoroki says, and for the first time since they'd met the night before, he sounds unsure of himself. \"I told them.\"\n \"You did?\" Izuku asks. \"But—why?\"\n\"Because I can't take credit for everything,\" Todoroki tells him. \"And because I wanted people to know who you are. After what you did, you deserve at least that much.\"\nIzuku can feel his eyes welling up already. Jeez, the sun's barely in the sky and he's already crying.\n\"I'm sorry if I overstepped,\" Todoroki says.\n\"No, I—\" Izuku swipes at his watery eyes. \"I still… can't really believe all this happened, but. But it does mean a lot to me, Todoroki-san. That you thought of me.\"\nThere's a soft huff on the other end of the line. Was that… a laugh? \"Midoriya, I haven't done anything  but think about you since last night.\"\nIzuku does drop the phone this time. When he picks it up again, his cheeks on fire, phone slipping in his sweaty hands, Todoroki mercifully does not seem to have noticed and is still talking.\n\"—saved two dozen people. You didn't hesitate. Someone I know who I admire  a lot  used to tell me when I was still in school… that's the mark of every great hero.\"\nIzuku doesn't know whether to be more giddy over his praise, or the fact that Todoroki has been  thinking about him. He keeps scrolling through news articles, some of his awkwardness fading as the surrealism of the moment starts to sink in, when there's a knock on his door.\n\"Oh, one second,\" he says, hopping off his bed, \"there's someone at the door.\"\n\"Ah—Midoriya, wait—\" Todoroki starts to say, but Izuku is already opening the door, phone still held to his ear.\nA thousand blinding flashbulb pops go off in his face, leaving him stunned and somewhat terrified.\n\"Midoriya-san!\" cries one of at least a  dozen reporters, all with mics pointed straight at him, cameras rolling to capture his every move. \"Can you give us a quote about your daring rescue on campus yesterday?\"\n\"That sounds like what I called to warn you about,\" Todoroki says.\nThe last shot the reporters get before the door slams in their faces is Midoriya Izuku, wide-eyed, in a set of official Shouto hero uniform pajamas that are slightly too big for him.\n\"Todoroki-san,\" he whispers, leaning against the door and gasping for air. He can still hear the clamor outside his apartment, people shouting his name.  \"Help me.\" \n\"Don't panic,\" Todoroki says, \"I have a plan.\"\n*\nThe plan turns out to be a joint interview on one of the most popular variety shows on Japanese television.\nIzuku isn't really sure how he manages it—maybe by throwing around his agency's considerable weight—but Todoroki stops the media from harassing him in the interim before the interview. They arrange for filming to occur on a day when Izuku doesn't have any early classes. The morning of the interview, he arrives by train, following Todoroki's very detailed directions.\nThe studio is unbelievably bright and loud and he's already sweating in his suit—maroon, with pinstripes. It clashes horribly with his shoes. The receptionist at the desk is distracted by multiple phone lines and doesn't immediately look up when he nervously introduces himself.\n\"Who are you here to see?\" she asks vaguely.\n\"Todoroki… Shouto?\" Izuku asks, feeling clueless himself. Todoroki had said to ask for him, but Izuku is suddenly sure that everything he is doing, currently, is wrong.\nThe receptionist looks up at him. \"Oh!\" she says. \"Oh, you're Midoriya-kun! Sorry, I'll buzz you through. Just go around the corner there to the elevators and up to the sixth floor.\"\nHe pushes through the turnstile once she's unlocked it and does as asked. His knees knock together the whole way up to the sixth floor. The elevator dings and the doors slide open and Izuku's panic grows tenfold.\nThere's  tons of people there, very stylish, busy-looking people, with high heels and sleek hair and holding clipboards. This contrasts with Izuku in every way possible; he is wearing sneakers, his hair is a bird's nest, and he has absolutely no clipboard of which to speak. He wonders if there are extras around, if it would go unnoticed if he just snagged one when no one was looking. He needs a safety clipboard.\n\"Midoriya, over here,\" a voice calls out, and he turns and sees Todoroki standing there.\nIzuku is fairly sure he dies and ascends to heaven in that moment. True, the other day he'd thought that Todoroki couldn't have looked better than he did, disheveled and grungy from the fight. That was probably a combination of shock, delirium, and adrenaline, however, because now Izuku sees that he was a fool. Interview-Ready Todoroki is a whole different beast, and that beast is dangerous.\nTodoroki isn't wearing a suit; just a slim fitted dark navy blazer with a white button down underneath. His trousers, also navy, hug his long, long legs. The shirt is some thin, soft material that clings to his chest distractingly, and the top buttons are undone, so the skin of his collarbone and a little lower peeks through, exposed. The watch on his wrist is a bit chunky, but not unattractively so, and looks incredibly expensive. His short hair is combed back off his forehead, swept over from right to left so that more white than red shows. He looks simultaneously more casual than Izuku and yet a million times more put together. And the outfit, with its tailored lines and clean cuts, really shows off just how…  big he is.\nTaken all together, this is, in Izuku's opinion, one hundred percent more life-threatening than a villain attack could ever hope to be.\n\"Good to see you again,\" Todoroki greets him as Izuku joins them.\n\"Y-you, too!\" Izuku stammers. \"I'm—did I overdress? I wasn't sure what to wear…\"\nA stylish woman in glasses standing next to Todoroki eyes Izuku like a hawk. He recognizes her a moment later as Todoroki's manager. When she taps her clipboard with her pen, he has to resist the urge to hide.\n\"Should we get him into hair and makeup?\" she asks. \"It's nearly time to go on…\"\nTodoroki's face molds into the sort of hardened blankness he exudes when he disagrees with something. Izuku has seen him do it in a million interviews.\n\"He's fine,\" Todoroki tells her. \"Here.\"\nHe reaches for Izuku, who stands very still and tries not to make any sudden movements. Todoroki tugs his jacket off his shoulders and passes it to his manager, and then after a moment's consideration, removes Izuku's bowtie as well. His mouth twitches.\n\"Top button,\" he says.\n\"Oh! R-right,\" Izuku says, hands flying up to undo the button under his throat.\nTodoroki nods. \"Better.\"\nAn assistant scurries up to the two of them to tell them they can proceed onto the set.\n\"Ready?\" Todoroki asks Izuku.\nIzuku erupts into nervous giggles that he has to work very hard to stifle. \"No.\"\nThis time, Todoroki does actually offer him a tiny smile. \"It'll be over quick. Promise.\"\nThe set, like the rest of the studio, is very brightly lit. Izuku and Todoroki are led to a blindingly white couch where their hosts, an energetic comedy duo, greet them exuberantly. Todoroki is a fairly frequent guest of theirs and they genuinely seem to know him well, wasting no time teasing him about something or other, some old inside joke. They're very engaging—even Todoroki cracks a smile here and there, seeming very much at ease.\n\"Midoriya, let me introduce you,\" Todoroki says, and the two turn their attention to him, beaming in welcome. \"This is Kaneda-san and Mori-san. They were kind enough to fit us into their schedule on short notice.\"\n\"Kind enough?\" Mori exclaims, eyes wide. \"I thought Kenta-kun was pulling my leg when he told me you  asked for an interview. I thought hell had frozen over.\"\n\"He accused me of doctoring your voicemail!\" Kaneda protests, very indignantly.\n\"I still haven't recovered from his first interview,\" Mori says. \"Do you remember that?\"\n\"The one where—\"\n\"Y-you made it a game!\" Izuku chimes in, clapping his hands together in delight. \"To try and make him smile, but he didn't!\" The other three all turn to stare at him, and he realizes, too late, that he's given himself away.\n\"You… remember that?\" Todoroki asks, as all the blood drains from Izuku's face.\nBut before he can shrivel and die of embarrassment, Kaneda and Mori both start roaring with laughter.\n\"I can't believe there's still someone who remembers that!\" Kaneda crows. \"Besides us, that is.\"\n\"You want to know a secret?\" Mori whispers conspiratorially to Izuku. \"He smiled, as soon as the cameras stopped rolling.\"\n\"Really?\" Izuku asks eagerly, curiosity winning out. He is stunned. He never knew this about that interview; this is true behind the scenes knowledge of Todoroki Shouto!\n\"I knew what they were trying the whole time,\" Todoroki says dryly. \"A friend found out and warned me.\"\n\"It was unfortunate luck having Earphone Jack on the show right before you,\" Kaneda admits. \"But we had fun, just like we will today! Ah, they're signalling!\"\nFeeling much less panicky, Izuku takes his seat beside Todoroki on the couch.\n\"Welcome back, welcome!\" Kaneda says, enthusiasm bubbling out of him. \"Next up, we have two incredibly exciting guests, who have caused a big stir these past few days. I think everyone will be very familiar with one of our favorite returning guests—Todoroki Shouto.\" Todoroki nods at the camera stoically as the audience cheers and claps. \"But our second guest is  very new to being a hero—please fondly welcome, Midoriya Izuku!\"\nIzuku is on his feet reflexively before he can stop himself, bowing awkwardly and exhaling a nervous  thank you for taking care of me. Immediately, their two hosts start laughing about this, comparing it to Todoroki's barely there acknowledgment.\n\"Amazing! He really gives you this feeling of—\"\n\"Gratitude, that's true, that's true!\"\n\"But, then, Todoroki-san…\"\nThe studio audience laughs uproariously as Todoroki stares back at them impassively. Izuku waves his hands frantically.\n\"I'm sorry, no, no, it's because I'm  really nothing like a hero,\" he tries to say. \"I'm just very honored to be here—\"\n\"Ah, so Todoroki-san must not be very honored then,\" Mori says with a wicked twinkle in his eye and Izuku starts stammering in despair. Before he can apologize any further, Todoroki grabs the back of his shirt and tugs him back down onto the couch.\n\"I told him you were nice, so don't tease him,\" Todoroki says, with something approaching an admonishment in his voice. The hosts capitulate readily, but he still plants a hand reassuringly on Izuku's shoulder. \"Besides, it's alright. I don't mind that he keeps showing me up.\"\nIzuku gapes at him as everybody laughs again. Finally, now that pleasantries have been exchanged, the hosts move on to conducting the actual interview portion. Izuku discreetly tries to wipe his hands on his pants. His palms are as sweaty as they've ever been and he can feel perspiration gathering at his hairline. He wishes he had a handkerchief handy, but it's too late for that.\n\"First things first. You had a special announcement you wanted to make!\" Mori prompts.\nTodoroki nods. \"Yes—I just found out I was nominated for the Rescue of the Year award at this year's Annual Japan Hero's Gala. I'm really grateful for everyone's support.\"\nThere are a lot of  ohhh-s from the viewers. Izuku is among them, although the noise he makes is more of a squawk of excitement.\n\"Con-congratulations, Todoroki-san!\" he yelps. He  knew Todoroki would get nominated for something, and this is one of the most prestigious categories.\nTodoroki gives him a tiny, fond smile. \"I'm sure I owe that nomination to you.\"\nIzuku's brain cannot compute this outright. \"Huh?\"\n\"Speaking of that,\" Kaneda cuts in, pointing at Izuku. \"Midoriya-kun, the entire nation of Japan wants to know more about you. You're an ordinary university student, yes?\"\n\"Very ordinary!\" Izuku confirms, drawing another laugh from the audience.\n\"Before the attack, that day was just a day like any other for you,\" Kaneda says, and now his tone has changed, to that of a storyteller's. A hush falls over everyone, as he helps Izuku weave the tale for the cameras. \"Can you talk us through that, up to when the attack started?\"\nThat's easy enough for Izuku to do, and he finds himself settling again, as he tells them about his school, what he majors in, and his job. He explains that he likes showing the groups of touring students around and answering their questions, although sometimes he wishes he could be less awkward.\n\"Ah,\" Kaneda notes, \"so you're saying, usually people expect you to be intimidating, but actually, they make you feel nervous.\"\nMori chimes in. \"Kind of… he's more afraid of you than you are of him!\" \n\"I'm literally  always more afraid,\" Izuku says, covering his face with his hand.\n\"But,\" Mori says, leaning forward, nearly on the edge of his seat, \"when the building you were in was attacked—we can show the viewers what that looked like—\" A large screen behind them comes to life with images of the chemistry building from that morning, flames and smoke pouring out of the first floor windows. The audience murmurs in shock and Mori turns back to Izuku. \"Midoriya-kun, can you tell us what happened?\"\n\"O-oh, sure…\"\nTo a rapt audience, Izuku relays the story. How he basically freaked out with everyone else at first. How the smoke started to choke him, and the floor started to sway beneath his feet. How he realized, eventually, that none of the high school students he was watching could be expected to take charge, and how he led them outside.\n\"Incredible,\" Kaneda says. \"And Todoroki-san, it was about then that you showed up, wasn't it?\"\n\"Right,\" Todoroki says, and begins to tell his side of the story from that point onward.\n\"So, this is where everyone wonders exactly what happened, and Todoroki-san, maybe you can clarify—the kids had all made it to safety when Midoriya-kun ran  back inside the building?\"\n\"Yes,\" Todoroki says, \"because they weren't all safe. There was one still trapped inside.\"\n\"What, what? Midoriya-kun?\"\n\"One of the girls had gotten stuck under some rubble,\" Izuku confirms. \"It's so lucky she wasn't seriously hurt. I think I've seen some interviews with her…\"\n\"Ah, Hana-chan!\"\n\"Yes!\" Izuku nods. \"I went back to help but I—I couldn't…\" This part is still a bit hard to dwell on, and his throat starts to close up at the memory. He remembers staring into a young girl's frightened eyes and thinking  she must realize she's going to die. All because he hadn't been strong enough to do anything. \"The, um, the concrete was too heavy. I thought…\"\n\"That's when I got there,\" Todoroki says, taking over. Izuku exhales slowly—relax, relax. \"The other kids told me what happened so I came in after them. I got there just in time to hear Midoriya saying he wouldn't leave.\"\n\"Wouldn't leave, even though he couldn't do anything?\" Mori presses. \"Why?\"\nThe question is directed at Izuku. He swallows, hesitates. \"She would have been alone.\" Another murmur goes through the audience as Mori's eyebrows raise.\n\"I know there's no recording of what happened inside the building,\" Todoroki says, \"but I heard him promise not to leave. I think he would have stayed even if he had to face the villain by himself.\"\n\"But,\" Kaneda says, \"doesn't that mean Midoriya-kun would have…?\"\n\"Yes,\" Todoroki says, blunt as always, \"he'd have died.\" There is a very long period of silence, during which Izuku mostly stares down at his hands in his lap.\n\"I think we can all say,\" Mori eventually speaks up, \"that we're glad you were willing to take those risks. In fact, we do have a message for you…\"\n\"For me?\" Izuku asks, dumbfounded. The large screen that has been showing footage of the attack changes to a different image—the inside of someone's home, it looks like. Two girls wave out at the audience, and Izuku yelps, \"Hana-chan?!\"\nIt's Hana, and her friend, the one who told Izuku she was still trapped inside the building. They both seem to be having a hard time not lapsing into giggles, but Hana regains control quickly in order to talk.\n\"Hello, Midoriya-senpai!\" she says brightly.\n\"H-hi!\" Izuku says, waving back. \n\"It's pre-recorded,\" Kaneda tells him in a stage whisper. Izuku freezes with his hand in the air, face going hot, as the audience laughs.\n\"Akimi and I wanted to tell you,\" Hana continues, \"that you were awesome! Even though it was so dangerous, you were really brave. Also…\" She twists her hands together nervously, before bursting out: \"We're both really sorry that we laughed at you before! Please… forget about that, because—because you're actually really cool!\" She glares determinedly into the camera for a second, like she's daring him to argue.\nIzuku laughs at this, stunned. He is very much not really cool, but he appreciates the sentiment immensely. \n\"I'll never forget that you came back for me,\" Hana says. \"Thank you.\" \nThe message is a short one; Hana is already waving goodbye, and the screen is going blank again. Izuku, however, just sits there, too stunned to know how to reply.\n\"Midoriya-kun,\" Mori says finally, surprisingly gentle, \"this all doesn't sound to me like you're always afraid.\"\n\"I—well, th-that's the thing,\" Izuku stutters, because it all seems very  grand, but when it comes down to it… \"I don't think I've ever been more scared in my life. I really don't know how pros do that all the time.\" He glances at Todoroki, feeling grateful all over again, and is startled to find Todoroki staring at him just as attentively as everyone else, even though he was there, and knows this part of the story.\n\"Being a hero doesn't mean never feeling afraid,\" Todoroki says—more to Izuku than to the cameras or the audience.\nKaneda hums. \"True, so true. So now—the two of you are both in the building, with the villain. What happens next?\"\nRetelling this part of the story to such a captive audience is honestly a thrill. Izuku gets overly excited describing the way Todoroki had removed the rubble, and shielded them from the first explosion, and everyone gasps at the last second rescue. His explanation starts to veer a bit too much into the technical side of things—the villain had been explained, later on, to cause explosions using sound wave frequencies, which was fascinating when Izuku wasn't in danger of being murdered by it. And then there was the marvel that was Todoroki's ice—density, temperature, cryogenic structure… The hosts gently steer him back towards the account of the actual events.\n\"So then,\" Kaneda says, \"I think this is the most amazing part of the story to me—you saved everyone with  chemistry?\" \nIzuku laughs sheepishly. \"Not exactly. I wasn't mixing chemicals or anything like that. That's, ah, Hollywood stuff.\"\n\"It wasn't quite that, no, but he thought… incredibly fast,\" Todoroki muses, recalling the moment. \"Even before that, he had a good handle on our weaknesses, the villain's strengths… I remember thinking, 'who is this guy'?\"\nThe audience laughs pleasantly, and Izuku ducks his head, as a whole rush of—of  something  he's not used to feeling comes crashing over him. Todoroki had acknowledged  his  quick thinking. He's second to no one in that area, well known for being one of the most well-collected and fastest acting pros in a crisis. For him to have thought that highly of Izuku…\nAh. It makes Izuku feel genuinely  proud of himself. Wow.\nPerhaps sensing that Izuku is far too overwhelmed to talk, Todoroki continues.\n\"After I got hit, I was basically useless. I thought I could use my fire, but, turns out that would have probably killed us.\" He looks contemplative. \"I don't think there was any way out of that room. The other pros didn't get there for another four or five minutes, and by then it would have been too late.\"\n\"But Midoriya-kun found a way,\" prompts Kaneda.\nTodoroki explains how Izuku had figured out the connection with the anesthetic, and how he and Hana had searched for the diethyl ether (he remembers the name of the chemical, which makes Izuku feel even more warmly fond).\n\"Hollywood!\" Mori shouts, breaking some of the tension built up from such a harrowing tale. \"That's  completely Hollywood!\"\n\"To be honest, I could barely believe it either,\" Todoroki admits. \"But he just kept talking, he kept Hana calm, despite everything. I could see how scared he was, but he kept trying to smile. And I just got this feeling from him, like I could trust him with my life. And that he'd get us out.\"\nLots of  oohhhh-s from the audience follow this statement. Todoroki tells the rest of the story as Izuku stares at him, speechless, unable to believe what he just heard.\n\"Amazing…\" Kaneda says, when he's done. \"Really amazing, isn't it?\" The audience claps their agreement, and Izuku tries again to execute an awkward bow from his seated position. \"One thing I kept thinking while listening to that was… ahh, how did Midoriya-kun know to do all those things? And I think one reason is because you're very interested in heroes, right?\"\n\"Ah, yes.\" Izuku nods, having somewhat recovered from before. \"It's kind of a hobby of mine, even outside school!\"\n\"But you—and correct me if I'm mistaken—are quirkless, aren't you?\"\nIzuku had expected this to come up. Todoroki starts to interject.\n\"I don't know that that's relevant to—\"\n\"It's okay,\" Izuku tells him quickly. It's not a thing he advertises, but he doesn't like to seem embarrassed of it either. It's just… who he is. \"I am, yes—quirkless, I mean. I know it's unusual… when I was still really little, I wanted to be a hero more than anything. And, well… I couldn't, of course…\" There are some sympathetic noises, and he waves his hands hurriedly. \"But it made me really, really interested in them! I've always thought heroes are amazing, so I wanted to study them, and who knows, maybe at some point I'll still be able to get involved in some other way.\"\nMore applause follows his words as the hosts commend him for pursuing his dreams in the face of great adversity. It's kind of embarrassing, because it's not like he's the only person who's ever had to make the best out of bad luck before, but it is also nice to not be told he's on a fool's errand.\n\"So you know everything there is to know about heroes, then!\" Kaneda says.\n\"Yeah, kind of,\" Izuku says. He grins shyly. \"I'm pretty good at impressions, too.\"\n\"Oh?!\" Mori exclaims delightedly. \"Do some, and we'll try to guess!\" \n\"Oh, um, okay…\" Izuku draws a blank at first. It's not often people actually want to see his hero impressions. He goes for the first one he can think of: steeples his fingers, smiles brightly, and says, \"Everyone! Do your best and we'll all get through this together!\" \nThe whole crowd  uwoooah-s, and Mori actually shouts in shock. He points at Izuku.\n\"Uravity!\" he says. \"That was totally the anti-gravity hero, Uravity!\"\n\"Yes, you got it!\" Izuku says, beaming. \"Okay, what about…\" He makes his arms stiff and movements robotic as he says sternly,  \"Your evil-doing stops here, villain! You won't get past me!\" \n\"That's Ingenium,\" Kaneda says. \"One hundred percent.\"\n\"How does he make even his  face look like them suddenly?\" Mori wonders. \"Maybe he does have a quirk?!\"\nThere's a snort from next to him, and Todoroki puts a hand over his mouth, but not quite fast enough to hide the smile growing there.\n\"He's making Todoroki laugh, keep going! Be relentless, Midoriya-kun!\"\nEverybody wants one more, so Izuku thinks hard before going for broke, adopting a ferocious grin and growling out,  \"I'll kill you! DIE, SCUM!\" \n\"IT'S GROUND ZERO! GROUND ZERO IS HERE!\"\n\"Everyone, stop laughing, stop laughing immediately, or it will be bad!\"\nThe whole audience is in an absolute uproar, the hosts are pretending to cling to each other in fright, and Todoroki gives up, putting both hands over his face as he dissolves into laughter. The hosts jump out of their seats and start telling the cameramen to zoom in on this rarest of sights, as Todoroki tries to turn away from them.\nIt takes a very long time for things to calm down again. Izuku can't stop smiling; he made  Todoroki laugh. He has a playlist of interviews saved where Todoroki smiles, but outright laughter is so rare he can count the number of videos on one hand. Now there will be one more.\n\"It's almost time for us to wrap up,\" Kaneda says, \"but before that, I have to know, who is your favorite hero, Midoriya-kun?\"\n\"It has to be Shouto!\" Mori says.\n\"Ah, yes, he's my second favorite!\" Izuku confirms.\n\"Second?!\" Mori gasps, like he's been personally offended. Kaneda puts a comforting hand on Todoroki's shoulder, which Todoroki just stares at.\nBelatedly, Izuku realizes his grave mistake. He gasps even louder than the host. \"Noooo, no, no—\"\n\"Stay strong, Todoroki-san,\" Kaneda says.\nTodoroki shakes his head, amused. \"He doesn't have to say I'm his favorite.\"\n\"But, Todoroki-san, I—I admire  everything  about you!\" Izuku tries to clarify, somewhat desperately. \"I've looked up to you for years!\" It really is no competition, between Todoroki and the rest. He  likes  other heroes, but he  adores Todoroki.\n\"What do you admire most about him, Midoriya-kun?\" Kaneda prompts.\n\"R-really, everything,\" Izuku says, and his face is going red, but he has to explain  properly. \"I always thought he seemed like he wanted to be a hero… just to help. To help other people.\"\nIzuku fidgets in his seat. There's a lot he wants to say—a lot built up inside him from the years and years of observation and idolization, crystalizing with utter clarity the past few days. He might not ever talk to Todoroki again after this interview. This is probably Izuku's one and only chance to tell him the things he always wanted to say. He takes a deep breath and turns to look at Todoroki.\n\"I've been a… a fan, since you became active, so I've watched you since the beginning,\" Izuku says, \"the  very beginning. I remember you, um, from Yuuei's sports festivals, but I think the first time I heard about your work as a pro hero was the fight against Razor Edge.\"\n\"Oh, that  is far back,\" the hosts confirm as the audience makes some noises of amazement.\n\"I think what amazes me most is how hard you always work to reassure people,\" Izuku continues. \"You've mentioned how that kind of thing was difficult for you at first, because you weren't very outgoing. But I think it's obvious how much you care about your fans and the people you helped. And now, I got to see that firsthand! I can't believe how nice you actually are. Even your smile is—it makes me so happy! I know some people still like to say you're cold, but even before I knew you, you always made me feel—feel safe…\"  \nIzuku trails off, realizing too late that his infatuation is palpable in everything he says. Todoroki is silent, watching him with a frighteningly unreadable expression. The hosts also seem quietly stunned.\n\"A-also I have your entire figure series collection,\" Izuku bursts out, \"even the limited edition models!\"\nThe one saving throw as the mark of a true fan. Actually, he has a lot more than just models. His Shouto memorabilia collection is as vast as his All Might one, although somehow (astoundingly) even more embarrassing. In his defense, he discovered Todoroki right around the very fraught days of his teen years, and Todoroki is… very attractive. There are some fan comics Izuku has tucked carefully away that he would not want anybody to find, ever.\n\"I take it back,\" Kaneda says, breaking the silence, \"clearly you have a  very high opinion of him.\"\nIzuku nods, emphatic. \"I  do!\" \nTodoroki finally blinks, his pretty eyes very wide. \"Midoriya…\"\n\"He's my favorite  active pro hero,\" Izuku rushes to clarify. \"The reason I said second is because my first favorite hero has always been All Might. I wanted to be just like him when I was younger.\"\n\"Ah,\" Todoroki says. \"I think I can handle placing after him.\" Izuku smiles at him, relieved, and he smiles back.\n\"What made you want to be like All Might?\" Kaneda asks.\nThis is Izuku's oldest memory. \"I wanted to save people,\" he tells them. \"With a smile.\"\nThe hosts nod understandingly. \"I sense a common thread,\" Kaneda says. \"And now, I think, you can say you've achieved it. We are so sadly out of time for today—but thank you both for joining us this morning.\"\n\"Thank you so much for having me,\" Izuku says, before turning to Todoroki. \"Thank you for inviting me!\"\nThey wrap up after that, but get to spend a little bit more time chatting with the hosts and more of Todoroki's team. The scary, stylish, bespectacled manager seems to have warmed to Izuku considerably, and seems very pleased with how well he knows Todoroki's brand and history, which Kaneda and Mori keep randomly quizzing him on. Todoroki keeps trying to make them knock it off, which only encourages them more.\nIzuku is enjoying himself so much that he almost forgets the time. It's an errant glance at his phone that makes him squeak a surprised exclamation, and start apologizing to everyone as he hastily makes his goodbyes.\n\"I should go, if I want to catch the next train back! I'll be late for my afternoon class otherwise.\"\n\"We can arrange a driver for you,\" Todoroki says. \"Aiko?\"\nHis manager nods, already making a call. \"Shouldn't be more than three minutes. Is that alright, Midoriya-kun?\"\n\"Oh—yes! That's really generous…\" Izuku says. Having Todoroki and his team go out of their way for him makes him feel extraordinarily guilty, but it's already in motion, it seems. They're very efficient.\nThey bid the show hosts a last farewell and head down to the lobby. A sleek black car is already waiting at the curb, and Izuku is already wondering if it will be too embarrassing to roll up to campus inside it when Todoroki walks around and gets in behind the driver.  Uh… \nIzuku jumps in the back on the passenger side. \"Y-you're coming with me?\"\n\"Your university isn't much out of the way of my agency, so I thought I might as well,\" Todoroki says. \"Would you rather go separately?\"\n\"No!\" Izuku gasps. \"This is okay!\"\n\"Alright,\" Todoroki says.\n\"To the school first, Todoroki-sama?\" the driver asks.\n\"Yes.\"\nThey're both quiet for a few awkward moments as the car pulls away from the curb. Izuku sneaks a glance over at Todoroki, to see the hero is watching the world go by outside the window. His placid expression gives away nothing of what he's thinking, but he still manages to look regally handsome. Izuku barely feels worthy of being in his presence.\n\"I didn't…  not want you to come with me,\" he says softly. \"I just wasn't expecting it.\"\n\"Ah,\" Todoroki says, turning to look at him. \"I didn't mean to make you uncomfortable…\"\n\"Oh, no, I'm not!\" Izuku says. He's just flustered, but that's nothing new. Todoroki still looks unsure, so Izuku barrels ahead to a new topic. \"Congratulations again, on being nominated!\"\nTodoroki shakes his head. \"I should be thanking you,\" he says. \"I meant what I said… I wouldn't be nominated if not for you.\"\n\"You don't know that!\" Izuku protests. \"You had some amazing saves the past year, like that flipped bus in April… or the baby in August!\" Todoroki's mouth twitches, and Izuku realizes he's revealing his hyperfocus a bit too obviously again. \"Sorry…\"\n\"There's a reason they announced my nomination now, and we both know it,\" Todoroki says, and even Izuku can admit that's true. What happened at the university has really caught everyone's attention. Todoroki clears his throat. \"Seriously though, I can't believe you remember which month those other things happened. I hadn't realized you were… I didn't know you were such a…\"\nIzuku stares at his knees, cheeks burning up. \"A fanboy?\"\n\"An expert,\" Todoroki amends politely. \"But now that I do, I can't help but feel I've made a terrible impression.\"\nIzuku whips his head around to stare at him. Todoroki is watching him very seriously, like he truly believes what he's just said. Never has anyone been so hopelessly  wrong,  and Izuku doesn't mean to say what he does next, but his thoughts are completely jumbled between  don't fucking let him think that  and  I'd never think something so stupid and what comes out is:\n\"Don't be fucking stupid!\"\nTodoroki's eyebrows lift in shock. Izuku claps his hands to his mouth with a strangled shriek.\n\"Am I…\" Todoroki says slowly, \"being fucking stupid?\"\n\"That's  not  what I meant to  say,\" Izuku wails, slumping forward until his forehead touches his knees. \"You haven't made a terrible impression at all. Unlike me.\"\n\"I don't know exactly what you meant to say,\" Todoroki says, \"but I think I got the gist. It seemed very emphatic, which is fortunate for me.\"\n\"It is?\" Izuku asks, still mortified.\n\"Well, given I wanted to arrange a tour of our hero agency for you,\" Todoroki says, \"yes.\"\nIzuku slowly raises his head to look at him again. Todoroki is watching him out of the corner of his eye, like he's afraid if he looks at Izuku full on, Izuku will fling himself out of the moving vehicle. Honestly, the assumption might not be that far off.\n\"Arrange a what?\" Izuku asks dumbly.\n\"I might've thought to ask sooner if I'd known about your… expertise,\" Todoroki says, still judiciously refraining from calling Izuku a total nerd. \"But listening to you in the interview, hearing your interests, I thought that maybe that would be a good way of thanking you.\"\n\"Wh—but,\" Izuku flounders to find the right words as he comprehends what Todoroki is saying, \"you already did! This interview was the thanks part.\"\n\"Subjecting you to being a talk show victim isn't exactly what I'd call a proper thank you,\" Todoroki says. \"That was just to get the press off your back. Maybe this is a bit egotistical of me to offer, I just thought—\"\n\"It's not!\" Izuku practically yells. \"No, I'm just—this is very—\" He waves his hands by his face excitably and then laughs, too loud. \"YES! Please, absolutely!\"\nTodoroki blinks at his increase in volume level. \"So, you would like to visit.\"\n\"It would literally be the best thing that could ever happen to me,\" Izuku tells him.\n\"Oh,\" Todoroki says. \"Great—I'll set it up.\" Then he smirks, the tiniest bit. \"Also, second best.\"\nIzuku cocks his head. \"Huh?\"\n\"It would be the second best thing,\" Todoroki explains. \"The best would be seeing All Might's agency, right?\"\nIzuku puts his face in his hands again, peeking through his fingers so he can watch as Todoroki's smile widens to an outright shit-eating grin. \"Todoroki-san!\"\nNaturally, every member of the Pro Hero Fan Association on campus has seen all the news coverage about what happened during the villain attack a couple weeks prior. So it's no surprise that everyone is aware of what took place involving Izuku that day. However, it seems nobody realized the full extent of what happened to him and Todoroki until after the talk show interview airs.\n\"I can't believe you almost  died,\" says one of his friends at their weekly circle meeting. Mayumi is a sweet first year girl with an affinity for the history and fashion of hero costuming. \"Senpai, that was sooo dangerous!\"\nIzuku scrubs a hand through his hair bashfully. \"Yeah, I'm still… sorta processing it myself.\"\nOne of the older boys smacks him on the back and he stumbles. \"It's been a month, Midoriya,\" he says. \"Just accept it, you're a national treasure.\"\n\"No, I'm sure everyone will forget pretty soon,\" Izuku says. \"The news cycle moves fast.\" He's flustered, very unused to receiving this amount of attention in meetings. Mostly he stays quiet (unless the topic of All Might comes up, on which he is the undisputed expert).\n\"When I saw your interview,\" says their president, and Izuku nervously stands at attention under her gaze. \"I thought, he's spent so much time studying them, of course he wouldn't stop to consider he  shouldn't do what he did.\" She gives him a tiny smile. \"You're kinda dumb, but really brave, Midoriya-kun.\"\nThe club president is a very pretty, popular senior who has never so much as spoken to Izuku before, and he can barely look her in the eye when he says, \"Yes! Th-thank you!\"\n\"He's so desperate to be a hero, he'd kill himself trying.\"\nIzuku tries not to wince. This last is said by their vice president. She  does speak to Izuku, frequently (her favorite hero is Shouto), but it's not usually something he looks forward to. She is generally the reason he stays quiet in most meetings.\n\"I was hoping not to die, mostly,\" he says hesitantly.\n\"I can't hear you when you mutter, Midoriya,\" she says with a sigh. \"Anyway, it's a good thing you know so much about chemistry, since you couldn't have really done anything else.\"\nHer quirk is seeing slightly better in the dark than most people, which wouldn't have been any help in the situation, either. But she doesn't really hide the fact that she thinks it's lame that he's so obsessed with heroes without having a quirk of his own.\n\"Um, yeah…\" Izuku says, lacing his fingers together in his lap and staring down at them. He knows he might be pretty useless normally, but he was still able to save Todoroki and Hana. That feels like the most important part, so he tries not to forget it. He remembers what Todoroki said to him.\n It was lucky you were there. Izuku smiles a little bit.\n\"Just lucky, I guess.\"\n\"I think it's  really  lucky you were able to meet  Shouto!\"  squeals Mayumi. \"He's your favorite! Were you  dying?\" \n\"I kinda was,\" Izuku says. \"He's, um… he's really amazing, in person.\"\n\"Is he nice?\"\n\"Yeah, he is,\" Izuku confirms eagerly. \"I was pretty freaked out about talking to him at first, but he's super nice!\"\n\"Ahhh, you must be so happy to be right about that,\" his kouhai says brightly.\n\"And relieved,\" Izuku admits.\n\"Is that why you said you think it's so  obvious  he's not cold?\" the vice president asks.\n Uh oh.  Izuku and the vice president don't exactly see eye to eye on Todoroki's hero persona. She's actually a fairly well-known artist among Shouto fans, but while her art itself is very nice, Izuku often feels she has a tendency to portray Shouto as overly well mannered, stand-offish, and indifferent. While a lot of people enjoy this part of Todoroki's appeal, and he  can  be that way at times, Izuku has always insisted that this misses the nuances of who he actually is as a person.\nTodoroki has shown plenty of times in the past that he can be  very  rude, but it often comes from a place of strong emotion. He's also funny, and warm, and kind… a lot of times, people forget all this when they only want to idolize his sexy Ice Prince persona. But it's just plain  wrong. \nOf course, Izuku has never told her she's wrong to her face. But he has made his opinion on Todoroki clear on Twitter, and his thread about it had gained a surprising amount of retweets. Given their mutual contacts, she had seen it, and quote retweeted it with a caption that suggested she had been personally attacked, to all her followers. They had not been very nice about it. She had apologized during the next club meeting, saying she only wanted to have an open discussion, but regardless, Izuku's Twitter has been private for the better part of two years. This is fine by him. He never had any followers or anyone interested in him anyway. After the past few days, though, he's been getting a lot of follow requests that he has steadfastly pretended not to notice.\n\"I just—wanted to make sure he knew how much I appreciated him reaching out to me?\" Izuku explains, voice rising at the end into a nervous question. It's not, strictly speaking, a lie. He wasn't even thinking about her specifically when he said that, there was too much else going on.\nBut yes, it does feel good to have firsthand evidence that he was right all along.\n\"He seems to really like you!\" Mayumi says. \"Like,  a lot.\" \nShe is peering at him with a very significant expression and he giggles nervously under her scrutiny. \"Like I said, he's really nice…\"\n\"I  guess so, but those pictures are really something…\" she singsongs.\n\"Huh?\" Izuku asks. \"What pictures? What do you mean?\"\nShe gasps loudly. \"You haven't  seen! Them!\" \n\"He was  there,\" the vice president says loudly.\n\"But he was talking and stuff!\" Mayumi says, oblivious. \"He might not realize!\" She whips out her phone and after a moment of searching for something, holds it out to him. \"This thread, senpai, look!\"\nBaffled, Izuku takes her phone from her. It shows some Twitter thread from a popular pro hero fan blogger that tends to be a little more on the ridiculous side, usually heavy on the memes. It's all a bunch of images from the interview, with the caption  \"Every single time   @TodorokiShouto   looked at Midoriya Izuku like he was the best thing to exist during That Interview.\" \nThey  tagged  Todoroki in it. Izuku's stomach churns as he scrolls through screenshot after screenshot, all of which feature, as promised, any moment Todoroki was watching Izuku during the interview. Of  course Todoroki was watching him; Izuku was telling the story and Todoroki was listening. He wants to point this out, but he keeps getting distracted the further he looks.\nHe hadn't had the chance to look at Todoroki that much during the interview. He'd been too preoccupied with talking without stuttering or making a fool of himself. So he really hadn't noticed how intense, practically unwavering, Todoroki's gaze was. And it's not just that he's watching Izuku closely. He looks protective when Izuku gets flustered over being teased, amused when Izuku is describing his school and job. And in the parts where Izuku is talking about the attack, there's something alight in his eyes, something soft that makes Izuku's heart do an incredible series of flip flops. It looks like—fondness, pride? Almost, but… but it's even warmer.\n\"Those are…\" Izuku says faintly, handing the phone back to his clubmate like it's a grenade about to go off. \"Those are lots of great Shouto pictures, yeah…\"\nShe looks exasperated at him. \"You didn't even look at the best one!\" She tugs on his arm and he reluctantly leans over to look at her screen, his dread mounting higher.\nThe last tweet in the thread is actually a moving gif. Izuku doesn't remember which moment this was, but he seems to be explaining something in a particularly animated (and embarrassing) fashion. He pauses for a moment, and runs a hand through his hair, a nervous tic as much as to get it out of his eyes. The gif very rapidly zooms in on Todoroki, who has been watching Izuku intently the entire time—just in time to catch him lick his lips, tongue running over them to wet them.\n \"Oh,\" Izuku utters out loud, without quite meaning to say it. \"Oh, um…\"\nHe wants to say  it's just editing!  He doesn't know why someone felt the need to make all of this, make nothing look… like  something.  It's awful, because what if Todoroki sees this and regrets  everything—their interactions, the interview, inviting Izuku to tour the agency…\n\"He seems very focused,\" Mayumi notes.\n\"People's lips get dry,\" Izuku replies defensively. Even Todoroki's, which are perfect in every way.\nNot that Izuku has been staring at them up close! Oh, no, he's not going to be able to stop thinking about Todoroki's lips now, is he?\nHe sighs. \"At least there's probably no way he saw any of this.\" Todoroki has millions of followers, all tweeting at him, about him, every day.\n\"He retweeted the first one,\" the girl tells him, \"so he did.\"\n\"He what,\" Izuku says dully, as his heart pounds out what are undoubtedly its last few, ponderous beats.\n\"He  what?\" the vice president snaps.\n\"Okay,\" the club president says, clearly sensing disaster, \"it's time to get started everyone!\"\nThe vice president looks murderous. Izuku sits as far away from her as possible and tries not to make eye contact the entire rest of the meeting, or think about the fact that Todoroki  retweeted a thread of himself staring at Izuku.\nIzuku has no idea how he's going to face him again at his agency on Friday.\n*\nTodoroki does not retract his invitation, much to Izuku's everlasting surprise. So come Friday, he finds himself walking up to the posh, multi-story office building just outside the city center. It's a building he knows well, given its proximity to his school, which is not  entirely a coincidence. His reasons aren't purely creepy, though; he chose to study so close because it's not unusual for the agency to pluck students fresh from his university, given their familiarity with it. Or maybe that's still creepy? He's not… sure.\nHe smooths down the front of his shirt, feeling nervous about his choice of attire. He actually asked Todoroki earlier in the week about what he should wear (fortunately before the Twitter thread revelation, after which he had felt far too awkward to talk to Todoroki at all). It was an office building, so business wear? Business casual? He'd had no idea so, still feeling amazed that he could just  do  it, he'd sent a text.\nTodoroki had called him back, instead.\n\"Just dress casually.\"\n\"Really?\" Izuku asked. \"Are you sure?\"\n\"It's my agency,\" Todoroki replied. \"How would I not be sure?\"\nIt was a valid point. \"Maybe you're worried I have crappy business clothes,\" Izuku says.\nTodoroki had let out that low snort of laughter he sometimes did that always made Izuku grin, too.\n\"Are they maroon?\" he'd asked, and Izuku groaned.\nIt's still so weird to talk to him on the phone. Izuku knows Todoroki can text just fine, but he seems to prefer talking directly, possibly because he always seems to be doing something that requires the use of both hands already, like paperwork, or driving, or exercising.\nThis is bad for Izuku, who is extremely anxious about talking on the phone always, and still has a hard time dealing with hearing Todoroki's voice directly in his ear. The time Izuku had spoken to him about scheduling the interview had been in the middle of one of Todoroki's workouts and had almost resulted in Izuku's death, because he'd been so distracted that he'd ignored a traffic light and nearly walked into oncoming traffic. Izuku wound up having—some  thoughts,  later on that night. There were some scenarios he had imagined that he is not proud of, but it had been nearly impossible  not to think about Todoroki's slightly breathless voice, right in his ear.\nSo, it's dangerous. But he also really likes talking to Todoroki (and listening to Todoroki talk), so the phone is just a necessary evil he has to make his peace with.\nTodoroki meets him out front, just outside the entrance of the building. Izuku is surprised—he hadn't actually expected to see that much of him today. It's still a weekday, and Todoroki must be extraordinarily busy. He's wearing his recognizable blue hero outfit; maybe he hasn't yet left on patrol…?\n\"Hi!\" Izuku says, feeling suddenly out of breath, even though he took the train and the walk was short. \"Sorry, were you waiting long?\"\n\"I just walked out,\" Todoroki tells him. \"They told me when you arrived at the station.\"\nIzuku's information sensors all start pinging so hard he forgets to be shy about Todoroki coming out to welcome him personally.\n\"Wow—what! You have it monitored? Is that part of your jurisdiction, or do you share it with other agencies in the area? Is it for security purposes, for the city? Or more like a private security type thing? Do you have a system set up at other stations, and how much coverage—\"\n\"I can't tell you the answer to most of these things, because you don't have proper security clearance,\" Todoroki says, and Izuku deflates.\n\"Oh,\" he says, \"right.\"\n\"But, if you want to come inside,\" Todoroki continues, \"I can have you sign a non-disclosure agreement, and then I can answer… some of it.\"\nIzuku perks up. \"You can?!\"\nHe can feel himself literally shaking in excitement. This means he isn't just getting a tour, he's getting  insider info. The stuff the pros know. Or, at least, some of the stuff.\nTodoroki inclines his head in the direction of the main entrance. \"After you.\" Izuku scurries towards the doors, and Todoroki squints at the writing on his plain white T-shirt as he goes by. \"Dress… shirt…?\"\n\"Oh, yeah!\" Izuku says, looking down at his chest. \"Because you told me to be casual, but I thought this way… my intent would still show.\"\nTodoroki just  looks at him for a moment, before shaking his head. \"You're strange.\"\nIzuku beams at him. \"Yeah, I get told that a lot.\"\nIt's true, that Izuku may be biased. But within about five seconds of entering the building, he's decided—Todoroki's agency is the most amazing building he's ever been inside in his whole life.\n\"W-wow!\" he breathes, standing in place and turning in circles to take in the entire glassy atrium. It has no ceiling, soaring up through all the floors with the sky open above them.\n\"That has a cover that extends to create a roof,\" Todoroki says. \"In case of bad weather.\"\nIzuku has seen some images of the inside of Todoroki's agency, but as it's basically a privately owned government office, civilians and press aren't often allowed inside, and neither is picture taking. This is indeed a once in a lifetime opportunity for someone like Izuku.\n\"Did you design this office, Todoroki-san?\" Izuku asks, as he signs in with the receptionist at Todoroki's request.\n\"No, that was Aiko,\" Todoroki says, just as a set of elevator doors dings softly behind them and the manager herself emerges, trusty clipboard in hand. Izuku is actually relieved to see her this time. Besides Todoroki and Aiko, he doesn't know anyone else at the agency, so if Aiko will be giving him the tour he won't feel as awkward. She's surprisingly nice.\n\"Sign this, and you're all set,\" she says, holding out the clipboard with the company NDA. Once Izuku signs, she takes it and smiles. \"Welcome to the Shouto Hero Agency.\"\nIzuku presses his lips tightly together and lets out a noise like a kettle boiling, before he starts bowing to them both repeatedly.\n\"Thank you so much—it's such an honor, I really can't say it enough!\"\n\"We're glad to have you,\" Aiko says. \"Shouto was very keen on it.\" Todoroki's expression doesn't change, so Izuku is left to flounder until she says, \"Let's go up, unless you're still enjoying the atrium?\"\n\"Oh—I am, but let's go!\"\nThey talk on the elevator ride up, and Izuku learns that Aiko graduated Yuuei a year before Todoroki, in the business course. Her business savvy is all hard earned, since her quirk is entirely unrelated—she can turn liquids into any kind of shape she chooses.\n\"It makes us a hit at parties, though,\" Todoroki says blandly, which makes the other two laugh.\nThey stop on the main work floor, where most of the offices are. The work space is very inviting and open, the desks not closed in by walls. The windows are big and let in lots of light, and there's lots of seating areas for people to gather. It looks like a really nice place to work.\n\"I'll leave you to it,\" Aiko says, turning to go.\n\"Oh, you're not—giving me the tour?\" Izuku asks, surprised.\n\"No, I am,\" Todoroki says. \"Unless you prefer Aiko…\"\n\"I thought you'd be too busy!\" Izuku practically yells, before covering his mouth. Todoroki is staring at him with slight uncertainty, and he wants to kick himself over somehow managing to make Todoroki think he would rather  not spend as much time together as they possibly can. \"No, Todoroki-san, I would—that would be amazing, but don't you have to work? I don't want to impose—\"\n\"Fridays are usually mostly for paperwork,\" Todoroki says, his face pulling into an expression that suggests he is not a fan of this in the slightest. \"But I don't have much to do today.\"\n\"Because he's been staying late at the office the entire past week, trying to finish it all,\" Aiko mentions breezily.\n\"Aiko.\"\n\"Y-you shouldn't have done that!\" Izuku gasps. Oh, no, now he  really feels like he's imposing.\n\"He wanted to,\" Aiko says, before Todoroki can get a word in. \"After all these years, I can tell when he's looking forward to something.\" She bows neatly to the two of them, before setting off.\n\"She knows you really well, doesn't she?\" Izuku asks, somewhat in awe. Aiko-san is very cool.\n\"Unfortunately,\" Todoroki sighs, but he sounds fond. \"Where would you like to start?\"\n\"You're letting me choose?!\"\nRather unsurprisingly, the rest of the agency is just as impressive as its atrium. Izuku decides to beeline for the surveillance room, which Todoroki says is fine now that he's under contractual obligation not to spill all their company secrets. Not that he ever would, but it's good to know they're careful. The control room is mind-blowingly high tech, and all the people that work there have quirks that help augment their eyesight or awareness in some way. The setup is baffling to Izuku, even when Todoroki and the security team explain it to him (including the train station camera set up), but he's thrilled just to see it all.\nThey make their way through different wings of the facilities, through the state-of-the-art gym and rec room that all employees have access to, before visiting the practice gym reserved only for heroes and sidekicks.\nThis is, of course, where they spend the rest of the morning. There are a lot of people training, but they stop when Todoroki comes in with Izuku to say hello. Izuku recognizes them all (Chlorophyll! Precision Ox! Ionizer!) and is fairly unable to stop his excitement meltdown at meeting them all at the same time.\n\"Uhhh, is the little guy gonna be okay?\" Precision Ox whispers to Todoroki, his bull nostrils flaring with concern as Izuku blushes and sweats and hyperventilates his way through regurgitating Ox's entire heroic history up to that point without taking a breath.\nTodoroki pats Izuku on the back calmingly. \"Yeah, he does this, just give him a minute.\"\nIt would be impossible to get  all of the nervous excitement out of his system, but they all recognize him from the interview already and he does manage to hold a proper conversation with them. After that, they go back to training, and he and Todoroki stay to watch. Todoroki seems to want to hear what Izuku thinks about their sparring, the strategies and usage of their respective quirks. Even though this is a bit nerve-wracking, it's also an immensely interesting challenge, and Izuku does his best to give his own input, ask questions, provide some of the insight he's gained from years of cramped writing collected in countless notebooks. Todoroki listens without seeming to grow tired of it.\nNext is lunch, at the sprawling cafeteria. All the food looks incredible, and Izuku has to try the katsudon, of course—but then the American cuisine section smells so amazing as he walks by that he also winds up with a huge cheeseburger in honor of All Might. Belatedly, he realizes it would be a travesty not to eat Todoroki's trademark favorite food  with the man himself, so he gets a whole bowl of cold soba, which they both slurp together contentedly. Even Todoroki's noodle slurping technique is impressive! After eating it all, Izuku is unable to move for several minutes, while Todoroki patiently waits for him to recover.\nAfter lunch, they visit the research and development labs, and end up spending nearly the whole afternoon there. Todoroki's agency is well-funded enough to have its own team of support engineers that develop most of the items and costume improvements in-house. Their work is fascinating to Izuku—some of it he's studied and researched himself, but the cutting edge stuff is all new and exciting. Todoroki doesn't try to hurry him along, instead introducing him to the team. They're all too happy to answer Izuku's questions, and he's brimming with them.\n\"I don't want to bother you,\" he keeps saying, until the head of R&amp;D finally tells him he doesn't have to worry about it.\n\"You saved our boss's life, remember?\" she asks. This finally and effectively stops Izuku's constant fretting.\nThe sky outside the windows begins to turn from blue to pink and orange. It'll be time for Izuku to head back soon, so they stop on a quiet upper floor to say goodbye to Aiko. Walking through the hallways, they pass by a big corner office, and Izuku spots a name on the door.  Todoroki Shouto. \nHe thinks he's being very sneaky in walking slower and trying to peek inside, but apparently not, because Todoroki says from behind him, \"You can go in, if you want.\"\nIzuku jumps, caught. \"You don't mind?\"\nTodoroki shrugs, shaking his head.\nThe office on the inside is very nice, but it's not as intimidating as Izuku would expect from a typical pro hero executive office. There are awards on the wall, and a small but neatly kept trophy case, which gives the illusion that these are stored here more as mementos than due to pride. Many of them are from Todoroki's time at Yuuei, some of them from his earliest years there. And a couple of them…\n\"Award for… best air conditioning unit?\" Izuku reads off one of the most ostentatious looking awards.\n\"My finest achievement,\" Todoroki says, voice incredibly serious. \"Specifically given to me by two illustrious heroes. I'm sure you know of them, Chargebolt and Cellophane. Momo—Creati made the trophy… that was back in our second year.\"\n\"Oh my gosh…\" Izuku whispers, gazing at the award with newfound awe. There's a lot of stories about the students from Todoroki's year,  All Might's students. Izuku has devoured them all, but hearing new and silly anecdotes from Todoroki himself is a whole new level of amazing.\nTodoroki has picture frames on his desk, of his friends, his siblings, his mother. There is only one photo of his father, Enji—taken in the past few years, judging by the wicked looking scar down the left side of the man's face. The relationship between father and son has always seemed strained, clearly evidenced by the Shouto Hero Agency standing separate to Endeavor's sprawling complex. There's not much public info known about why the two are so at odds with each other, and Izuku has never been interested in prying that deep. That particular facet of Todoroki's life is too private, too personal.\nA tinny beeping noise makes him look up from his snooping, to where Todoroki is standing, leaning against the doorframe. Todoroki puts a hand to his ear.\n\"Aiko? What's—\" He pauses as he listens, his expression going from confused, to alarmed.  \"Fuck.\" \n\"Todoroki-san?\" Izuku asks.\n\"Sorry,\" Todoroki says, \"we have to go—not here. Somewhere else.\"\n\"Wh-what? What's wrong—\"\n\"My old man's here,\" Todoroki says. He sounds more annoyed than anything else. \"Of  course he'd turn up today…\"\n\"Oh,\" Izuku says, \"well, I can wait, while you—\"\n\"No, I don't particularly want to talk to him right now,\" Todoroki says. \"And I'm sure he won't see eye to eye with my taking a day off. He'll come to my office to look for me, so we have to move.\"\nThey hurry out into the corridor, Izuku following behind Todoroki as they head for the elevators. They've nearly reached them when Todoroki stops dead and hisses, \"He's  where?\" to Aiko, presumably, before grabbing Izuku's arm and dragging him through the first random door nearest them.\nIzuku yelps. The room they've ducked into isn't a room—it's a tiny storage closet, with a couple of shelves digging into Izuku's back. It's barely big enough to fit the assortment of mops and brooms inside it, and it is  definitely not big enough to fit two whole people, especially not ones as tall and broad as Todoroki. It's a small blessing that Izuku is as small as the hero is large.\nAll this happens in seconds, and on the other side of the door, Izuku hears the elevators  ding as they open.\nNext he hears footfalls—solid, heavy ones. If footsteps could be described as intimidating, then that's what he'd call these. He realizes right away who they must belong to, and why they have found themselves here, hiding among the cleaning supplies.\n\"Endeavor,\" he hears Aiko call. It sounds like she's down the hall. \"What a pleasure to see you.\"\n\"Aiko,\" comes the greeting, and  gwohh, Izuku thinks, his voice is even deeper in person somehow. \"Is Shouto in his office?\"\n\"Ah—he's not, I'm afraid.\"\nA strange shudder goes through Todoroki, and he puffs a soft breath through his nose—and Izuku realizes in shock that Todoroki is  trying not to laugh. He can't see him very well in the dark, but Izuku stares up at him, incredulous, and a bit delighted.\nTodoroki is a little  shit. \nOutside, Aiko continues to painstakingly deter Endeavor from seeking out his son—she probably doesn't realize where they are either, and it's this admittedly hilarious detail that makes Izuku suddenly overly aware of the situation.\nHe's in a  tiny closet.  With  Todoroki Shouto. Standing so close to him that he can feel each little tremor of laughter that shivers through the other man.\n\n Oh my god, oh my god, oh my god. \n\nTodoroki lets out another quiet  huff  of air, and it happens. Izuku remembers The Gif. Todoroki's captivating eyes, staring so intensely, and then the  lip licking.  Suddenly, he can't stop thinking about it; Todoroki watching him, Todoroki's lips, so close to his ear, like they're talking on the phone except right now  there's no phone.  Todoroki is right there and so are his lips and they're probably  warm and soft.\nTodoroki has grabbed onto Izuku's arms to steady him; his hands are so big his fingers can almost touch, encircling Izuku's biceps. So big… Todoroki is really so large in person. The shelves at Izuku's back force him directly into Todoroki's front, and there was little time to arrange himself better before Endeavor appeared. Right now, he's bordering on dangerously  gropey, pressed up against Todoroki with his hands resting on the older man's broad chest.\nIt is, Izuku really can't help but notice, exactly as firm as it looks when he's just staring at it from afar, either in real life or in those somewhat risqué photoshoots Todoroki very occasionally agrees to, the ones that manage to get him almost or entirely shirtless. Izuku notices distantly that he  does  run hotter on his left side, the realization a dim roaring in his head, buried beneath the mass of his stupid lizard brain. It's making things below the belt (he's not wearing a belt but…  south) distinctly uncomfortable.\nAiko is saying something that Izuku doesn't catch, and Todoroki shifts a bit, angling his body so he can turn his head to press one ear up against the door. The movement makes him shift; his leg juts out a bit more, and his thigh slots between Izuku's, and Izuku's soul abandons his earthly body.\nOh,  dear. \nTodoroki is tall, and his legs are much longer than Izuku's, and Izuku has nowhere to go, so he falls forward slightly. The inner seam of his shorts pushes firmly against the sturdy bulk of Todoroki's thigh, and he gasps at the pressure.\nAwful timing, terrible timing, the worst  fucking possible timing.\nRight now, trapped in a closet with Todoroki, with his crotch pressed against Todoroki's thigh, is the most mortifying moment possible for him to pop a boner.\nIf he had any hope of his dignity being spared, of Todoroki not noticing, it is quickly dashed when Todoroki goes absolutely still against him.\nIzuku couldn't say anything even if there was something  to  say, because of the danger that Endeavor will overhear. Softly, with no other course of action open to him, he drops his face into Todoroki's chest in shame. This is a mistake, too, because with his nose stuffed in Todoroki's shirt, he gets the faintest hint of musky sweat and the scent of some light, intoxicating cologne, barely applied but enough to make Izuku's head swim with something that  feels like hunger, even after the buffet they'd eaten earlier.  \nHe closes his eyes and murmurs as many silent apologies as he can until he hears Aiko say, \"Of course, right this way,\" followed by the clicking of her heels and Endeavor's loud boot falls fading away down the hallway.\nOnce they're no longer audible, Todoroki murmurs,  \"Quick.\" \nIzuku hears him fumble for the handle and the door flies open, nearly blinding him with the bright lights outside. Again, Izuku finds himself being towed along as Todoroki's hand closes around his wrist, and they run, making a beeline for the elevators. Todoroki jams the button with his finger frantically until the doors finally open and they tumble inside. To Izuku's bewilderment, he hits the button for the top floor.\n\"He might leave, which means we can't go down to the atrium,\" Todoroki explains. \"But he won't come up.\"\nIzuku nods dumbly. Todoroki is still gripping his wrist, but no sooner does he think about this than Todoroki lets go of him jerkily. They're still standing awkwardly close together, silent, in the elevator.\nIzuku stares at the floor. \"I'm—Todoroki-san, I—\"\nHe doesn't get any further before Todoroki interrupts. \"That… wasn't very professional of me,\" he says. \"I should have just dealt with it like a—well, not like a child.\"\n\"I understand.\" Izuku swallows painfully. \"You didn't want your dad to know I was wandering around here, right?\"\n\"It's not that,\" Todoroki says. \"I didn't want him to ruin today, that's all.\"\nThe doors open, and they find themselves at the top of the building. The elevator goes all the way up to the roof. There's a helipad, and a pavilion that looks like it might be used for social gatherings.\nThe view of the city from the rooftop is stunning, especially bathed in the pastel colors of golden hour, right before the sun sets. Izuku would be awestruck, if he didn't feel so horrible.\nTodoroki must regret everything, now, for sure this time. Izuku has never felt so low. His dream for so long has just been to meet Todoroki, to talk to him. To somehow let him know the impact he's had on Izuku's life, how much he means to him—but  god,  not like  that. Endeavor hadn't ruined things, but Izuku definitely had. And as much as he wants to slink away and never face Todoroki again, he has to apologize.\n\"I'm so  sorry,\" he blurts out, without explanation. There's no justification he can give. He just bows as low as he can manage. Maybe he should get on his hands and knees. \"For what happened back there—\"\n\"It's fine,\" Todoroki says. \"That was my fault.\"\n\"—after everything you've done—\"\n\"I'm not mad.\"\n\"I'll leave now, I'll leave and I  promise you never have to see me or talk to me again, but I'm really so sorry—\"\n\"You can't promise that,\" Todoroki says, raising his voice to be heard over Izuku's panicked stream of consciousness, \"because I wanted to ask you if you'd like to go to the Hero's Gala next month.\"\nIzuku falls silent. Slowly, he straightens out of his bow, to look at Todoroki, to see if he's—if he's joking? Or maybe Izuku completely misheard him, that must be it…\n\"To what?\"\n\"The Hero's Gala,\" Todoroki says. So, no, Izuku didn't mishear him.\n\"The Hero's Gala?\" he repeats faintly. \"The  Annual Japan Hero's Gala?\"\nTodoroki nods. \"Yes.\"\nIzuku stares at him. Not only is the Hero's Gala one of the biggest (and fanciest and most televised) events of the year in Japan, but it's also, obviously, one of the most exclusive. It's part award ceremony, part entertainment show, an event that only the cream of the crop pro heroes are invited to attend.\nIzuku's mouth feels dry. \"How would I go to that?\"\n\"With me,\" Todoroki says, head tilted like a confused puppy. He looks so cute when he does that—Izuku can't help but notice. \"I'm allowed a guest.\"\nIt takes another moment for Izuku to process this.\n\"Wait,\" he says, then practically shrieks,  \"WHAT?!\" \nTodoroki's eyes slide away from him. He almost looks  nervous, which in itself seems ludicrous. \"I should have asked sooner… I know it's a bit last minute, now. So I understand if you can't—\"\n\"I don't have anything to wear,\" Izuku croaks.\nThere's roughly seven hundred other things he should say instead of this, but none of them come to mind in that instant. All he can think is that he doesn't have a suit nearly nice enough to wear to be allowed into the Hero's Gala. Maroon won't cut it.\nWhich is terrible, because he's never wanted to say  yes  to something so badly in his life.\nTodoroki looks at him again. \"If I… help with that,\" he says slowly, \"you'll go?\"\nIzuku nods. And Todoroki does that thing, where he doesn't smile with his mouth or… even really with his eyes, but Izuku can tell he  is  smiling, somehow. That's just what it looks like on him sometimes and it's no less happy.\nHe still doesn't understand, though. So he asks.\n\"Why are you inviting me?\"\nThe multi-colored sky is Todoroki's backdrop, standing on the rooftop so far up, and the breeze blows and lifts his hair like some scene straight out of an anime.\n\"Because it's for heroes,\" he says, \"so I thought you should be there.\"\nHe then has to try to awkwardly comfort Izuku as Izuku bawls his eyes out for several minutes straight. But Todoroki reassures him—as they stand together on the rooftop looking out over the city until the sun drops below the horizon line—that he doesn't mind in the slightest.\n\n\n\nTalking to Todoroki becomes, weirdly enough, far easier than it had been before the Closet Incident. Izuku still can't really bring himself to think too hard about what had transpired, but the fact of the matter is that it had been, bar none, the most embarrassing thing he's ever done.\nAnd Todoroki hadn't pushed him away. Not literally, and not figuratively, either. Instead, Todoroki had invited him to the Hero's Gala, of all things. He could have… he could have not done that. Izuku doesn't know if Todoroki still felt a lingering obligation because Izuku had saved his life, but he didn't  have  to do something like this.\nSo Izuku is forced to fully grasp, finally, that maybe Todoroki isn't going to get annoyed by being around him. Izuku is somewhat used to bothering people eventually, with his nervous habits and awkwardness. Who would've thought that one of the people he  didn't  bother would be  pro hero Shouto?\nThe realization makes him feel lighter than air, and makes phone calls with Todoroki much less terrifying. Izuku's face still gets hot, and the butterflies in his stomach never really go away, but he stops worrying that every little thing he says is going to make Todoroki hang up, never to call him again.\nOne quiet evening, Izuku's phone buzzes with a message from him as he's studying for an exam. He snatches it up immediately.\nTODOROKI Do you have a minute? I wanted to talk about plans for the gala.\nIZUKU yes! I'm here!\nAll Might's voice announces he has a call a moment later, only managing to blare out, \"A pho—\" before Izuku answers.\n\"Hi!\" he says.\n\"Hey,\" Todoroki replies. \"This isn't a bad time, is it?\"\n\"No, no!\" Izuku tells him. \"I was just studying.\"\n\"Ah. This can wait until tomorrow, if—\"\n\"It's fine, really!\" Izuku insists hurriedly. \"It's nice to hear—good to talk to you.\"\n\"Oh,\" Todoroki says. \"You, too.\"\nIt hasn't been that long since Izuku visited his hero agency, but Todoroki's words bring a silly smile to his face.\n\"Thanks,\" he says, and then winces. \"I mean, for thinking it's good to talk to me. Or, or wanting to talk to me? Um—thank you! For calling!\"\n\"I haven't even said what I called to tell you yet,\" Todoroki says.\n\"Right… the gala?\" Izuku asks. He's an idiot, but, as he keeps trying to remind himself during moments of crippling awkwardness, it hasn't stopped him from being invited to go to a gala with Todoroki. Not like  with Todoroki, that makes it sound too much like they're—he's just going as Todoroki's friend. His guest? He is Todoroki's friend-guest.\n\"Yes,\" Todoroki says. \"I'm sure you know most of the details, but since it's out of town this year, we'll travel and stay overnight. I'll cover all those expenses, obviously, so you don't need to worry.\"\n\"Y-you will?\" Izuku squeaks. He  did  know the gala wasn't being held in Tokyo, but he's been too excited to stop and think about how he would pay for things, or who  would pay for things on his behalf.\n\"Of course,\" Todoroki says. \"The travel part is easy, we'll take my plane.\"\nIzuku has to bite his fist to keep from screeching. He's going to get to fly on Todoroki's  private jet? He might not make it through takeoff.\n\"Okay,\" he manages to wheeze, finally.\n\"Good,\" Todoroki says. \"Now, the main thing I called to discuss. Attire.\"\nIzuku laughs nervously. \"Yes…\"\n\"Do you have anything in mind? Any preference?\" Todoroki asks. \"The cut of the suit, the color—\"\n\"None,\" Izuku says, heading him off at the pass. \"Todoroki-san, you've seen my clothes.\"\n\"I… have,\" Todoroki says, \"and I was trying to give you the benefit of the doubt…\"\nThis makes Izuku grin. \"You don't have to be polite,\" he says. \"Just put me in something that's not going to embarrass you. You  are going to be winning an award, after all.\"\nTodoroki huffs. \"Not this again.\"\nIzuku rolls his eyes. They've been going back and forth over this for the past few days, with him insisting, and Todoroki refusing to listen. Todoroki keeps saying that there are more qualified gala nominees, and that there's no way for Izuku to know. But Izuku  does know. He believes Todoroki will win, without a doubt. He always believes in Todoroki.\nIf Todoroki wants to be obstinate, then Izuku will have to be, too.\n\"I'm positive,\" Izuku says.\n\"You really seem to be,\" Todoroki sighs, humoring him. He pauses, inhales. \"But you wouldn't, you know.\"\n\"Wouldn't what?\"\n\"Embarrass me,\" Todoroki tells him. \"You could wear the maroon one, honestly—\"\n\"I  can't,\" Izuku says, horrified at the thought.\n\"That's not why I'm offering to help you find something to wear,\" Todoroki continues. \"I just want you to be—I don't want you to think I'm embarrassed by you. I'm not.\"\n\"Okay,\" Izuku says. He currently feels embarrassed of himself.\n\"I never have been,\" Todoroki continues. \"Not when you saved me, not in the interview, not on the tour—\" He stops speaking abruptly. Izuku can feel himself withering away.\n\"Okay!\" he says again, much more shrilly. It is a relief, to be told outright that Todoroki isn't rethinking everything, but he is not ready to discuss…  the Closet Incident yet. Or ever.\nTodoroki clears his throat. \"I can arrange to have you fitted for a suit.\"\n\"Oh,\" Izuku says, \"wow, that's… fancy.\"\n\"It's a fancy party,\" Todoroki says. \"Could you make time in the afternoon next week?\"\nIzuku can, and so Todoroki tells him he'll book a time with his tailor (the same one who fits him for everything from business suits to exercise wear to his hero outfit). All the logistics sorted out, Izuku thanks Todoroki one final time, and then hovers nervously, not quite wanting to say goodbye, yet.\n\"I'll… I'll talk to you later, then?\"\n\"Soon,\" Todoroki says. It reassures Izuku, somehow.\n\"Goodnight, Todoroki-san.\"\n\"Goodnight,\" Todoroki says. But before Izuku can quite hang up, he suddenly adds, \"I meant to ask—how was your, uh… how was your day?\"\n\"Oh!\" Izuku says, surprised. \"It—it was good.\"\nHe starts to tell Todoroki about a lab project he worked on that day, and then about his most recent club meeting. Todoroki doesn't stop him—and before Izuku realizes it, it's been at least another hour, and he really does have to force himself to hang up because Todoroki has an early morning patrol, and Izuku has to finish studying.\n*\nThe following week, Wednesday, arrives quickly. It's the day they've settled on for the suit fitting, after Izuku finishes with club activities for the day. Someone will be coming to pick him up to take him to the tailor, but another member's presentation runs a bit long and the whole meeting ends up stretching on past their usual time to let out. Izuku waits anxiously, not wanting to be rude, but as soon as they wrap up he jumps out of his seat and starts packing up his things, sending off a hurried text message to Shouto.\nIZUKU  could you let the driver know I'm on my way? So sorry to keep him waiting We finished late!!!!\nLike clockwork, his phone starts ringing. Panicking slightly, he fumbles to pick it up.\n\"I'm headed out right now!\"\n\"No rush,\" Todoroki says calmly. \"You said room 302 in the humanities building, right?\"\n\"Yes!\" Izuku huffs, trying to juggle his phone, books, club materials, and the bag he's trying to stuff everything in as he heads for the door. \"Sorry, Todoroki-san—\"\n \"Todoroki?\" someone asks from behind him.\nIzuku spins around, phone still clutched to his face, to see the whole of his club staring at him, trapped while he struggles ineffectively with the door to the classroom. There's no way they could have failed to hear his brief conversation.\nImmediately, he starts to sweat. The first thing Todoroki had asked when he gave Izuku his number was if he could trust him—and Izuku just let it slip he has it to about two dozen random people.\n\"You have Shouto's  number?!\" one of the first years asks. Mayumi muffles an excited shriek behind her hands.\n\"Ah…\" Izuku says, as a bead of anxious perspiration trickles down the side of his face. \"That's… well, you see…\"\n\"Come  on…\" The vice president pushes past the others as Izuku continues to blink at them all in terror. She surveys him very coldly. \"Midoriya-kun, this is getting so awkward. I know that you think you're his biggest fan and all, but you can't just make stuff up.\"\nIzuku gapes at her. She thinks he was faking the phone call?!\nActually, he can use this to his advantage. He has to admit that he, too, would assume he was faking the phone call if he wasn't himself. Eyes averted, he gropes for the door handle behind him, laughing awkwardly as he tries to escape.\n\"God, yeah… you're right! Haha…\" He has got to get out of here, he can never show his face at a club meeting again. \"I guess… there's no way he'd ever give me his number—\"\nSomeone pulls the door open abruptly and he yelps.\n\"I did give you my number, though,\" a familiar voice says blankly, and Izuku realizes he never hung up the call, and that Todoroki is, in fact, now standing in the doorway right behind him.\n\"Oh,\" Izuku says faintly. \"Hello.\"\nHe ends the call. Slowly, cheeks burning, he turns to face Todoroki. He can barely bring himself to do it, but he looks up, all the way up, until he meets Todoroki's eyes.\nThis is vastly unfair. Izuku hadn't even realized Todoroki was going to come fetch him personally, and is he trying to kill Izuku by looking so good doing it? He's dressed more casually than Izuku has ever seen him, outside of creepy tabloid shots of him going about his day off duty. The grey henley he's wearing seems like it can barely contain him, stretched tight across his chest, biceps straining against the thin fabric of the long sleeves, pushed up to his elbows. Todoroki looks good in jeans, Izuku muses, from somewhere far outside his head—he feels like he's having an out of body experience. The rough, laidback look of his clothes is offset by the dark beanie and big sunglasses he's wearing, which gives him a soft and vaguely hilarious incognito look. Up close, though, it's still recognizably him. Especially when he talks.\n\"Ready?\" is all Todoroki says. He's staring down at Izuku with a carefully blank expression that Izuku is too shell shocked to try and puzzle out.\n\"Yes,\" Izuku says demurely.\nTodoroki looks at the rest of the club, who are all still frozen in shock, and nods. Izuku swallows, wondering what he'll say. Maybe he'll tell them all not to bother trying to get his contact info from Izuku, because he's going to make Izuku delete it. Maybe Todoroki is already planning on changing his number.\n\"I don't know if he's my biggest fan,\" Todoroki says, shrugging. \"He's a good friend, though. Sorry for interrupting.\" He waves in farewell, and starts walking away.\nIzuku forgets to follow, momentarily just as stunned as everyone else. The vice president's mouth is hanging open; she covers it with her hand. Izuku isn't sure if she has anything else to say or not, but he quickly bows before she can get the chance and scurries after Todoroki.\nThey don't talk until they're in the car. It's far too quiet inside the vehicle, and Todoroki doesn't seem like he's going to venture any comments. Izuku folds his hands in his lap.\n\"I didn't mean for them to find out,\" he blurts out, when the silence goes on too long. \"I should have been more careful.\"\n\"I didn't intend for you to keep it entirely clandestine,\" Todoroki says. \"I just didn't want you giving it out or… pasting my number on chat forums.\"\n\"I wouldn't!\" Izuku gasps.\n\"I know,\" Todoroki says. His lips twitch. \"That's why I gave it to you in the first place.\"\nIzuku tries to smile, but it comes out wobbly. \"So you… heard everything?\"\n\"I got the gist of it,\" Todoroki admits. \"Does that happen often?\"\nIzuku hesitates. \"Not all the time. But… sometimes.\"\n\"She's that fan artist,\" Todoroki says. \"She comes to events a lot… I recognize her.\"\n\"Yeah…\"\n\"She seems like an asshole.\"\nNot expecting this, Izuku wheezes out a laugh. \"Todoroki-san! She's… forceful.\"\n\"Forcefully an ass,\" Todoroki mutters, which makes Izuku giggle harder.\n\"We just started off on kind of the wrong foot,\" he says.\nBriefly, and with as little detail as possible, he explains their falling out to Todoroki. Todoroki's eyebrows rise to his hairline, and Izuku's explanation gets more nervous and scattered as the temperature in the car drops and an almost imperceptibly thin layer of frost creeps over the right side of Todoroki's face.\n\"I think I should have a discussion with her,\" he says stiffly, once Izuku is done.\n\"Nooo,\" Izuku moans. \"That… might be worse. Besides, it doesn't bother me that much. I'm just relieved you're not upset.\"\nTodoroki sighs. \"Alright. I guess I'm relieved, too.\"\n\"You are?\" Izuku asks. What is there for Todoroki to be relieved about?\n\"Yes,\" Todoroki says. \"I thought I'd made things awkward by trying to follow you on Twitter.\"\nIzuku smiles serenely at him, uncomprehending. \"What?\"\n\"I worried maybe you didn't want me to follow you, since you never accepted my request,\" Todoroki explains. \"But you said you turned off notifications, right?\"\nIzuku's expression turns to stone, smile freezing on his face.\nLike his life flashing before his eyes, his Twitter feed scrolls past in his mind. His intensely geeky, hero analysis heavy, Shouto-obsessed feed. The last thing he retweeted was a photoset of Todoroki's back muscles. He screeches.\n\"AHHHHnoyoucan'tfollowmeI'msorry!\"\nBenign shock filters across Todoroki's beautiful face. \"Oh.\"\n\"Not because—it's not anything  you've done, it's really—not you, it's me!\" Izuku says desperately.\nTodoroki rubs his chin contemplatively. \"Not something I was expecting to hear at this stage…\"\nIzuku expires. He slumps against the window of the car in boneless despair. \"Todoroki-san… I'm trying to protect you.\"\nThis makes Todoroki laugh that soft laugh of his. \"I see.\"\nIzuku cracks one eye open to peer at him. Todoroki really looks so  good in his soft, comfy clothes, almost-smile creeping onto his features, afternoon sunlight shining through the car window behind him. Izuku has always assumed that cameras couldn't really do Todoroki justice, and now he sees it's true; Todoroki always looks very handsome, but Izuku doesn't know that he's ever seen him truly relaxed. It doesn't surprise him, somehow, that Todoroki manages to be so much more good-looking in close proximity than in photos.\nWhat  is surprising, but no less wonderful, is how funny he is in real life.\n\"You like messing with people,\" Izuku accuses, \"but nobody realizes it. So you always get away with it.\"\nTodoroki looks very deliberately out the window. \"But you see right through me, apparently.\"\nIzuku opens both eyes. \"I don't think I want to see through you. I just like seeing you for who you really are.\" Todoroki's expression softens for one brief moment, before Izuku adds, \"Which is sometimes a jerk.\"\nTodoroki stretches out one long leg and lightly kicks Izuku, who grins and kicks him lightly back, and then the driver announces that they've arrived and it's time to get out.\nThe tailor is located in a quiet upscale part of Tokyo that Izuku hasn't had cause to venture to before. The driver drops them right outside the shop, where tastefully arranged mannequins behind the glass windows display a variety of finely cut suits and other menswear. A doorman opens the entrance to admit them, and Izuku finds himself immediately surrounded by people offering to take his hoodie, store his backpack, asking if he would like anything to drink, providing slippers when he steps out of his shoes. It's like entering a fancy hotel as opposed to a clothing store.\n\"Wow…\" Izuku whispers, as they are lead to a private room where the fitting will take place.\nA short, elderly man is waiting to greet them, bowing deeply when they enter.\n\"Todoroki-sama, so good to see you,\" he says warmly, \"are you keeping well?\"\n\"I am, thank you Chinoda-san,\" Todoroki says, returning the bow. Izuku bows as well, feeling jittery.\n\"This must be Midoriya-sama,\" Chinoda says.\nIzuku whips his head up. He's never been addressed so formally or politely before. \"Uh, I—I'm him, yes!\"\n\"Excellent, excellent… stand up straight, let's get a good look at you.\"\nChinoda prods Izuku out of his characteristic slouching, straightening his shoulders, has him turn all the way around. Izuku thinks he sees the man's eyes flash purple, and then Chinoda is motioning for an assistant and giving them all Izuku's measurements, as the woman quickly jots them down.\n\"He can measure anything just by looking at it,\" Todoroki informs Izuku upon seeing his quizzical look.\nIzuku's eyes widen. \"A-anything?! Does it have a limit? Can you measure liquids as well as solids—volume, I mean? What about—\"\n\"Incredible,\" Chinoda says. He glances at Todoroki. \"As sharp as you described him. I can see why you took such a liking to him.\" Todoroki nods, and Izuku blushes furiously.\n\"Quirks are… very interesting to me…\" he says lamely, as if it's not obvious.\n\"I see that,\" Chinoda says. \"Suits are very interesting to  me. So I'm very glad Todoroki-sama brought such a bright young man to my shop, so I can ensure you stand out as much as you deserve.\"\n\"Oh, gosh,\" Izuku says, feeling very bowled over by all this. The lavish treatment, the praise, and apparently Todoroki telling people things about him—good things! He's got to be careful not to let it go to his head, he thinks resolutely.\n\"Let's try you in a couple of our exclusive pieces,\" Chinoda tells him, as assistants start to bring out suit after suit after crisp, well-pressed suit.\nThey get started dressing Izuku right away. He tries out standard black, charcoal, powder blue, even a dark green, but Todoroki and Chinoda both survey him in each before shaking their heads and moving on to the next. Finally, however, he comes out in a light grey tuxedo, and both their eyebrows lift.\n\"This,\" Todoroki says.\n\"It has to be this,\" Chinoda agrees. \"But it will need to be altered.\" He beckons to a different assistant, whose quirk seems to be similar to Best Jeanist's. She can manipulate fabric, shrinking or stretching it at will. As she starts on the alterations, Chinoda turns his attention to Todoroki.\n\"Have you given yours much thought?\" he asks.\nTodoroki shakes his head. \"I hadn't. I was thinking maybe a navy—\"\nIzuku makes a guttural noise in his throat that he doesn't quite manage to conceal fast enough. He purses his lips together immediately, avoiding looking in their direction.\n\"Midoriya?\" Todoroki asks.\n\"Nothing!\"\n\"I feel like that was definitely something,\" Todoroki says. \"What's wrong?\"\n\"Really, nothing,\" Izuku tries to insist. \"It's just, well… navy?\"\n\"Maybe,\" Todoroki says. \"Why?\"\nIzuku really wishes he could learn to keep his mouth shut. He can't, though, so he steamrolls ahead.\nFirst he tries to set the stage: \"W-well, not that long ago, one of the people in my club did a presentation on you. She's a really big fashion buff, so a lot of it was on costume history, but she talked about the Warring Hairstyles Era, too. The time when you were just starting out as a pro…\"\nTodoroki blinks. \"Is that… what people call it.\"\n\"That  is what people call it, yes,\" Izuku tells him, as Chinoda nods knowingly.\nTodoroki sighs, looking resigned. \"I refuse to believe that there's anything worthwhile to discuss about the hairstyle choices I made when I was nineteen.\"\n\"Well… probably not to you, but people get in really heated discussions over it anyway,\" Izuku says. \"It's sort of all in fun, but also sorta serious. People argue a lot about what was best… though I think the current favorite is still when you grew it out super long!\"\n\"Really?\" Todoroki says. His exasperation transitions to surprise. \"I only did that to piss off my dad.\"\n\"I  knew  it!\" Izuku says, snapping his fingers.\n \"You  knew?\" Todoroki asks. \"How?\"\n\"The amount of press photo ops of the two of you together is practically non-existent from your Shoujou Prince phase.\"\n\"My what?\"\n\"Fan nickname,\" Izuku says, waving his hand. \"I always thought it was strange at the time, given you were still at his agency.\"\n\"You noticed that,\" Todoroki says. Izuku can't tell if he's impressed or despairing. Izuku has realized by now, though, that his insane amount of recall tends to just amuse Todoroki, so he doesn't try to deny it. \"He told me when I graduated that my hair was getting too long and that it made me look like an anime character. I thought I could do even better.\"\nChinoda chuckles as Izuku smiles. He remembers the long hair days pretty fondly. Everyone lost their minds over every new picture, and whenever Todoroki had pulled it into a bun or a braid it had been an event on a practically national scale. There were so many accounts dedicated to images of the nape of Todoroki's neck.\n\"You did look very elegant,\" he says. \"Anyway, the point is—a lot of people also have strong opinions about what kind of clothes you looked best in, pretty much based on what you were doing with your hair at the time.\"\n\"How do people have  time to make these judgments?\" Todoroki asks. \"Don't they have jobs? School? Lives?\"\n\"Clothing coordination  is our life, for some,\" Chinoda says sagely, causing Todoroki to put his hands together in apology.\n\"For your long hair, everyone liked the white suit best,\" Izuku explains. \"The one you wore on the red carpet to the premier of Twinkling's first movie.\"\n\"Ah…\" Todoroki says. \"He requested I wear that.\"\n\"It matched your look really well, though!\" Izuku says.\n\"Was that your favorite hairstyle, too?\" Todoroki asks him.\nThe question catches him off guard. \"M-mine?\"\n\"Mhm.\"\nIzuku considers. \"I think my favorite was probably Punk Prince.\"\n\"Please tell me you don't mean the—\"\n\"The mohawk,\" Izuku says, grinning broadly as Todoroki shakes his head.\n\"That was a  joke,\" he says, real regret creeping into his voice as Izuku laughs. \"I only did that because—I heard Bakugou wanted to get one, and so I did it first.\"\nIzuku wheezes with laughter. \"What?  Why?\" \n\"To spite him, obviously. He was furious.\"\n\"Oh my gosh,\" Izuku says, as realization dawns,  \"that's why he blew up in that interview where they asked him what he thought of your hair!\"\n\"I didn't plan that,\" Todoroki says, \"but he still thinks I did, to this day.\"\nIzuku isn't sure whether or not Todoroki completely believes him about the mohawk, but he doesn't push him further. Truthfully, Izuku had always liked any of the styles he'd tried out, no matter what they were. The rotating hairstyles had always seemed to him kind of silly, a more playful side of himself Todoroki didn't show very often, but that clearly existed nonetheless.\nBut if he's being honest, Izuku would have to say that his current style—a bit too short for bangs, but easy to push back or to the side, always a bit windswept—might be his favorite. Maybe it's because it makes Todoroki look a little more mature, or maybe it's just because Izuku is getting to know him so well now, while he has it styled that way. Either way, it suits Todoroki.\n\"What suit was best on the mohawk?\" Todoroki asks, sounding genuinely curious, at this point.\nThat's an easy one. \"The electric blue suit you wore for that benefit party.\"\n\"Ah!\" Chinoda says, clapping his hands together. \"I told you, that suit was a  statement. But you were convinced it was hideous.\"\n\"It sort of  was,\" Todoroki says. He seems to be amused at finding himself ganged up on. \"Maybe I was too young to realize its worth at the time.\"\nChinoda swats the air dismissively. \"He's as young as you were, but he's putting you to shame. He must have an eye for this.\"\n\"Oh, no, I really, really don't,\" Izuku says. He can see Todoroki's mouth twitch and knows he's thinking:  maroon. \"I just know what looks good on Todoroki-san!\"\n\"You  are the expert,\" Chinoda says. \"So, what do you suggest now?\"\nIzuku had expected Chinoda to make the final decision either way, but Todoroki seems to be interested in hearing his answer as well. He puts his chin in his palm, thinking hard. Todoroki's hair now is the opposite of those early styles. He reminds Izuku of a film star as much as a pro hero, sometimes. His look these days is understated and classy, mature…\n\"Something dark,\" Izuku says, nodding decisively. \"Kinda… mysterious?\"\n\"Ah…\" Chinoda says, approving. He taps the side of his nose conspiratorially. \"I think I have just the thing.\"\n\"Finished,\" announces the seamstress altering the suit Izuku is wearing.\n\"Midoriya-sama, turn so we can see…\" Chinoda says, and Izuku does as asked. He turns in a slow, full circle. Behind him is a mirror, and he pauses when he sees his reflection.\nThe suit is fitted absolutely perfectly. The cut makes his normally skinny frame look lean and slender instead. The light shade of the grey doesn't distract from the dark green of his hair and eyes, and actually seems to… to make the color  pop, as he imagines a person who knows much more about these sorts of things than himself would say. It makes him look… pretty okay, he thinks. He thinks he could wear this to the gala and not feel like he's embarrassing himself or Todoroki.  \nHe turns back to face the other two again, smiling nervously, and stops at the look on Todoroki's face.\nTodoroki is staring, too, staring at all of Izuku. His lips are parted slightly, as if in shock, and his eyes are darting everywhere, taking in what seems like every inch of Izuku, studying him from head to toe. The way he's looking makes Izuku's face start to burn hot, but it doesn't feel like nerves, as usual. He's… he's…\n\"T-Todoroki-san?\" he says breathlessly. \"Is this okay?\"\nTodoroki swallows. Then he seems to snap out of whatever weird trance he's in, nodding jerkily. \"It looks perfect.\"\n Now Izuku starts to blush from shyness. He can only nod back, too awkward and flustered to actually say anything.\n\"We'll take it,\" Todoroki tells Chinoda.\n*\nNot long after the fitting, Todoroki leaves Japan for a mission overseas. He can't say much about it to Izuku, only that he'll be back about a week before the gala. Izuku spends the next few days in a fit of anxious excitement, reading up on all the info about the event, the heroes who will be in attendance (he needs to make sure he brushes up on everyone), the awards that will be presented. It seems like time is passing both too quickly and very slowly.\nOn the weekend, he decides to visit his mom, just to combat some of the jitters. Inko has been made well aware of all the recent escalating craziness in his life, and though she can't quite keep up with the level of his intensity, she does her best. She understands the freakouts, at least—after all, his room is only covered in Shouto posters, and the merch is all he wanted for birthdays when asked for the past eight years.\n\"So… you're staying overnight for the gala?\" his mom asks, as Izuku helps her make dinner. It's a quiet Saturday evening. The TV is on in the background, and the hero news program and running water and quick chopping of vegetables are all familiar sounds, a backdrop he's familiar with. It does help him feel calm.\n\"Yeah, just the one night, at some fancy hotel,\" Izuku tells her. Todoroki gave him the name—it's 5-star, and looks very nice.\n\"Ohhh,\" his mom says, smiling. \"Seems kind of serious.\"\n\"I hope it'll be more fun than serious,\" Izuku says, and she laughs.\n\"I didn't mean the event, I meant  you,\"  she explains. \"This relationship you have with Todoroki-san. He  likes you.\"\nIzuku stops cutting potatoes to look at her. His mother is smiling as she cooks, little crow's feet around her eyes wrinkled with happiness. Izuku shouts as he realizes what she's suggesting.\n\"Mom! No! What?!\"\n \"Izuku,\"  she says. \"You've been on two dates already, and now the gala?\"\n\"Two?!\" he splutters. \"Where are you getting these numbers?\"\n\"There was the time he invited you to see his agency—\"\n\"That was a  tour!\" \n\"And the time he took you to get a suit—which  he paid for!\"\n\"Because I needed one,\" Izuku points out. \"It was just a suit fitting—\"\n\"And you had dinner together afterwards?\" she asks, like he needs reminding.\n\"Yes, but—\"\n\"He made reservations,\" Inko says.\nThis is all true. They'd gone to eat at one of the fancy restaurants in the area after the tailor. Izuku isn't  actually sure, though, if Todoroki made reservations or if the wait staff just let them in upon recognizing who he was (once he removed the beanie and sunglasses). But it wasn't a—there was nothing… special about it. Besides the fact that he was having actual dinner at an actual restaurant with actual Todoroki Shouto. It was just dinner.\nBecause they were friends. Like Todoroki had told Izuku's clubmates.\n\"It wasn't like that,\" he says to his mom. \"Todoroki is just really nice. But… I don't mind that, at all. I like being his friend.\"\n\"Izuku,\" Inko says again, but it's not teasing anymore, just warm. She stands on her toes, and he ducks down slightly (not all that much) so she can kiss his forehead. \"I know you do. And I like that he likes being your friend, too.\"\nThey smile at each other, and it's then that a few snatches of a breaking news report on TV catch Izuku's attention.\n\n —brought in to a local hospital after suffering injuries during a villain encounter overseas. The young hero was apparently working an undercover mission at the time… \n\nIzuku turns, feeling like he's moving in slow motion. He hears his mother gasp, right as he sees the TV, and the news report, and the picture of Todoroki, overlaid on top of footage from whatever fight had taken place.\nHe blinks, unable to process what he's seeing at first. Then it sinks in.\nTodoroki got hurt.\nThe news report continues on.\n\n ...although he is expected to recover, it was surely a very worrying brush with disaster. At this time, neither Shouto's agency or hospital officials are currently releasing any information to the public… \n\n\"Shouto—oh god,\" Izuku says softly. \"I—mom, sorry, I—\"\nShe doesn't try to stop him when he runs to his room, shutting the door behind him to dig out his phone. For a minute, he feels frozen. Is it alright for him to try to contact Todoroki? Will Todoroki even want to hear from him right now?\n\"Shit,\" Izuku murmurs, before he sends a text, fingers shaking.\nIZUKU please be okay\nHe's not expecting a reply right away, and he doesn't get one. For a long time he sits staring at his phone, before he slumps sideways on his bed. He doesn't feel tired at all, so he just lays there; staring at the walls.\nTodoroki—well, Hot and Cold Hero Shouto—stares back at him from every surface. Posters, figurines, photographs; Izuku has them all, treasures each one that he's carefully and lovingly researched and added to his collection over the years. For his whole adolescence, he dreamed in this room—of what it would be like, to be a hero, to be  somebody, to be on equal footing with this man. Shouto is his hero.\nBut  Todoroki Shouto is human. Like his quirk, he is two halves of some unnameable whole. Todoroki is hot and cold, he's intimidating and kind, serious and funny. Unreadable sometimes, and an open book at others. And as much as Izuku idolized him as a hero, he feels something so much more for the person he's come to know.\nHis mom knocks on his door later to quietly ask if he can eat anything, but he says he's not hungry. His stomach can't handle it right now. Eventually, without realizing he's fading, he falls asleep with his phone clutched in his hand.\nIt's his phone buzzing that wakes him up, hours later in the middle of the night. Not a call—a text message. He gasps, instantly wide awake when he sees it.\nTODOROKI It's okay. I'm fine.\nIzuku doesn't even think before he dials Todoroki's number. It's the first time he's called Todoroki in response to a text, instead of the other way around. It barely rings before the line picks up.\n\"Midoriya? I didn't want to wake you up—\"\n\"Todoroki-san,\" Izuku says. His voice cracks, and Todoroki stops speaking mid-sentence.  \"Todoroki-san—\"\nTodoroki's voice is soft when he murmurs, \"You were worried.\"\nIzuku starts babbling. \"The news only said—just said you were expected to recover, and I didn't know what that meant, I know that's stupid, but I couldn't stop thinking…\"\nHe trails off. He kept thinking of terrible things—he's mad at himself for even considering them, because he knows Todoroki is strong. But texting Todoroki, and not having him call back right away for once, was so scary.\n\"You couldn't stop thinking… we'd miss the gala,\" Todoroki fills in.\nIzuku gapes into the dark of his room. \"I didn't think of that  once!\"  Todoroki snorts, and Izuku gasps. \"Are you  teasing me right now?\"\n\"No—well,\" Todoroki amends quickly, \"I figured you weren't worried about that. But I didn't want to make you miss out, so maybe I was projecting. We'll definitely make it, though.\"\n\"Todoroki-san, I don't care about the gala at all right now,\" Izuku says sternly. \"I just—I just wanted to make sure you were okay.\"\nHe can't believe this; Todoroki is lying injured in some foreign hospital somewhere,  mocking him. What a terrible, wonderful man.\n\"I am,\" Todoroki reassures him. \"It was just some bad cuts, a dislocated shoulder. Mild concussion.\"\n\"That doesn't sound okay,\" Izuku says, as heat pricks at the corner of his eyes.\n\"I've been through far worse,\" Todoroki tells him. \"Remember how I almost  died the first time we met?\"\n\"Yeah, but you didn't wind up in the hospital,\" Izuku argues.\n\"That's true,\" Todoroki concedes. \"I guess it's because you weren't here to help me this time.\"\nIzuku's breath shudders. For some stupid reason, this is what sets him off. It's ridiculous. It was a one in a million chance, how they met, and even slimmer odds that Izuku managed to protect Todoroki, let alone save his life. And still—if he could do it again, if he could spare Todoroki from getting hurt…\n\"Ah…\" Todoroki says, when he realizes what's happening. \"No, that was a bad joke. I'm sorry, don't cry.\"\nIzuku bites his lip to try and stop, but it's never that easy for him. \"I j-just—it was just a lot worse than I thought it would be, hearing about it.\"\n\"It's the way my job works,\" Todoroki says.\n\"I know. I know I'm being an idiot, but—Shouto—\" He stops. He's never, not once, called Todoroki that before. That wasn't a  hero  Shouto, that was a  first name Shouto. That was an accident. He wipes his eyes desperately with his sleeve. \"S-sorry. Um…\"\n\"You're not.\"\n\"No, I really am—\"\n\"You're not an idiot,\" Todoroki clarifies. \"I appreciate you worrying about me.\"\n\"O-oh.\"\n\"You don't have to be sorry about calling me that, either.\"\nIzuku knows Todoroki wouldn't be mad about it. He's very informal himself, and he doesn't seem to care about social hierarchy or that he's older than Izuku or anything like that. But it's… it feels like something really big, to Izuku.\n\"I—okay, I just—\"\n\"Izuku,\" Todoroki says.\nIzuku lets out a soft gasp that he is sure still carries over the phone. Todoroki has never used  his first name, either—only ever called him Midoriya. His name, said by Todoroki, sounds…\nHe curls into a ball on his side, phone pressed to his ear, mouth wobbling hopelessly.\n\"Y-yes?\"\n\"You can call me Shouto.\"\n\"…Like, your hero name?\"\nTodoroki's laugh is low and quiet and sweet in his ear. Izuku shuts his eyes, and thinks, helplessly, about his mouth. His lips. His voice is so close.\n\"No,\" Todoroki says, \"my actual name.\"\nIzuku exhales, very shakily and all in a rush. Oh,  gosh,  oh gosh.\n\"I d-don't think I can do that!\"\n\"It's not mandatory,\" Todoroki relents, still sounding amused.\n\"Sorry...\"\n\"Don't be,\" Todoroki says. \"Thank you, again. For checking on me. You should sleep, though.\"\n\"Yeah,\" Izuku says. It's three AM. \"See you in a few days?\"\n\"Looking forward to it,\" Todoroki says.\nThere's a long silence on both ends of the line.\n\"Mido—\"\n\"Do we have to hang up?\" Izuku blurts out. What the  hell, what a weird thing to—\n\"No.\"\nIt takes Izuku a moment to register what Todoroki has said—he's still reeling from his own audacity. He bites his lip.\n\"I don't want to hang up,\" he confesses.\n\"Then I won't,\" Todoroki says. Simple as that.\nEventually, at his insistence, Izuku puts him on speaker, laying the phone next to him on his pillow. The sound is a bit fuzzy, but he can hear Todoroki's breathing, slow and calm. Maybe Izuku should feel weird, but he just feels relieved. He doesn't have to hang up and go back to staring at Todoroki on his walls, knowing he's really in a hospital bed somewhere with a concussion.\nAs he falls asleep, Izuku can't help but think about what it means that this adoration he's always had for the hero in his posters pales in comparison to how much he cares about the real Todoroki.\nIzuku keeps in touch with Todoroki throughout the rest of his hospital stay, so he knows when he gets released and when he's flying back to Japan. Still, when there's a knock on his apartment door the same evening Todoroki happens to return, Izuku doesn't have a clue who it could be.\nHe's entirely caught off guard when he opens it to find Todoroki standing there in a hoodie and sweats, his hair messy and unstyled, carrying a plastic bag that turns out to be takeout.\n\"You're here?!\" Izuku squeaks, an unnecessary question considering yes, Todoroki is very clearly there on Izuku's doorstep in all his dressed down glory.\n\"My flight just landed,\" Todoroki says. \"Is now a bad time?\"\nA bad time for  what?  Izuku wonders. For a famous pro hero and extreme object of his affection to show up unannounced at his door?\n\"No, no, come in!\" he says. He stands aside to let Todoroki slip past him. As Izuku shuts the door, he thinks he should have thought this through better, because suddenly his tiny apartment contains exactly one hundred percent more Todoroki than it did before (which is saying a lot, he has a ton of Shouto merch), and he's not sure what to do about it.\n\"Did you already eat?\" Todoroki asks.\n\"Um, no!\" Izuku says.\n\"I brought you curry,\" Todoroki tells him, somewhat hopefully, like maybe the food will result in him being better received.\n\"Oh, that's so…\"\nHe wants to say nice,  or convey how thankful he is in some way, but now that Todoroki has stepped into the light of his apartment, Izuku can see the signs of the fight he'd been in overseas. There's a fading bruise on his jaw and a mostly healed cut on his cheek, and Izuku forgets what he started to say because his chest goes all sore with worry again, at the same time his stomach goes fuzzy and hot with  something else. \n Um.  Todoroki is very attractive when he's a bit roughed up.\n\"I should have called ahead,\" Todoroki says abruptly. \"I didn't know if you'd be here, but I knew if I told you I was coming you'd feel like you had to meet me, and I didn't want it to be an inconvenience, so I just showed up. But now that feels like maybe even more of an inconvenience…\"\nHe trails off awkwardly, and Izuku realizes that his own lack of response is probably unnerving Todoroki. Izuku waves his hands anxiously.\n\"No, sorry, it's—\" Izuku starts to say, and then stops, because he still doesn't know what to say. He's so happy to see Todoroki he can't even find the words to tell him. \"It's not an inconvenience!\"\n\"It's not?\" Todoroki asks.\n\"Nope!\" Izuku gives him an encouraging thumbs up for good measure. \"Not at all.\"\nTodoroki stares at the plastic bag of food he's holding. \"I was just thinking about… what your reaction would be if I surprised you.\"\n\"With takeout curry,\" Izuku says. Not that he'd turn his nose up at that. It's just… so cute? He reaches out to take the food, and Todoroki relinquishes it.\n\"And coming here,\" Todoroki clarifies.\nIzuku blinks at him. \"You came here… just to surprise me?\"\nTodoroki starts to nod, and then shakes his head. \"Actually, I don't know what I was—I'll just go now. I know you're probably in the middle of studying, or—\" He starts to reach for the door.\n\"Wait!\" Izuku yelps.\nTodoroki freezes, and Izuku panics, slightly. He doesn't really get why Todoroki wanted to do all this, but he doesn't want Todoroki to  leave, either.\n\"You should stay. O-only if you want to, though—sorry, I'm not trying to make you—\" Todoroki is giving him this  look like he has no idea what Izuku is trying to say, which is fair, because neither does Izuku. \"I want you to stay, I just can't believe you're here? I'm so h-happy you are, though!\"\n\"Oh.\" This makes Todoroki smile faintly. \"I wanted to see you when I got back.\"\nIzuku presses the backs of his hands to his cheeks as he feels them grow hot. His mom's words keep bubbling up in his head: he  likes  you,  he  likes you, he likes  you. \nWell, okay—it's definitely true that people probably don't pay visits to someone they don't like immediately after flying home from an international business trip that ended with them in the hospital. Izuku has logically had to accept a while ago that Todoroki does like spending time with him.\nBut he still can't wrap his head around what his mom is talking about. There's no way Todoroki could like him that way, how could he? Todoroki is amazing, and he could find someone amazing to be with as easily as breathing if he wanted. He deserves to fall for someone amazing.\nAnd Izuku is fine with that, because even getting to be Todoroki's friend is so much more than he'd ever dreamed would happen.\nHe smiles back at Todoroki. \"I'm glad you're home safely.\"\n\"And kind of starving,\" Todoroki admits.\n\"Oh, I'll clear some space!\"\nIf there's one thing Izuku can say about his life, it's that it has led him to places he never thought it would. Primarily, sitting on his bed eating curry out of plastic containers with Todoroki Shouto while they discuss his vast collection of hero figurines.  \n\"So, that one's your favorite,\" Todoroki says, pointing at the detailed seven-inch figure of All Might that Izuku has been waxing on about fondly for several minutes.\n\"Yes!\" Izuku says. \"It was extremely limited edition, too. I actually begged my mom to let me stay home from school that day to try and buy him as soon as they started selling it—and she let me!\" He'd scared her half to death with the volume of his scream after he'd managed to get one.\nTodoroki makes a noise of appreciation. \"I wish I could've got one of those, too.\"\n\"You couldn't?\" Izuku asks, surprised. With how rich  and well-connected the Todorokis are, he can't imagine it being a problem.\n\"My old man would have made me train until I puked if I'd tried to pull that,\" Todoroki tells him. \"He was never really too happy about All Might being my favorite hero.\"\n\"He is?!\" Izuku gasps.\n\"Yeah,\" Todoroki says. \"By the time I got to high school, I thought I'd outgrown stuff like that but… All Might proved me wrong. He's as amazing as everyone always says.\"\nIzuku lets out a wheeze of excitement. \"Really?\"\nTodoroki nods. \"Eraserhead is, too.\"\n\"He was your homeroom teacher!\" Izuku says excitedly. He can barely even comprehend something so cool.\n\"Yeah,\" Todoroki says, \"and he kicked my ass almost every day.\"\n\"What was the training like?\" Izuku asks. \"At Yuuei?\" There's a lot of info about Yuuei, but very little about the standard curriculum is known—in fact, it tends to be a pretty closely guarded secret, both for the safety and the success of its students. This is Izuku's chance to learn from one of its brightest alumni.\n\"Brutal,\" Todoroki tells him. \"I learned more in three years there about using my quirk than I had the rest of my life.\"\n\"Even though Endeavor trained you?\"\nTodoroki shakes his head. \"My relationship with my dad… was a lot worse when I was younger. I mean, I'm sure you've noticed it's still pretty shaky now. But I was pretty, uh… I was kind of fucked up when I got to Yuuei.\"\nIzuku listens to all this with wide eyes. \"If you don't want to talk about it…\"\n\"It's fine, it's just not really a pleasant story,\" Todoroki says. \"I had no intention of giving anyone the time of day when I started high school, really. I just wanted to get out and reach the top on my own, so I could prove to my dad that everything he'd tried to teach me was bullshit. And I was kind of right, in some ways.\"\n\"Did you, um… really never use your left side?\" Izuku asks softly. He's heard stories about that, and still remembers the first sports festival at Yuuei, where Todoroki had shot through the rankings, only to be finally taken down by a young Bakugou when he'd refused to engage with his fire. Todoroki had taken second place that year.\n\"Yeah,\" Todoroki confirms. \"I hated it—hated my dad, what he'd made my life into. And a lot of what he'd taught me  was wrong, because being a hero isn't just about being the strongest, but… I didn't really get it yet, then, either. I just wanted to be the best to get back at him. Aizawa-sensei, and All Might, and everyone in my class helped me figure things out eventually, but I was a complete ass for a long time.\"\nTodoroki is so laid-back these days, but Izuku can kind of imagine him: sixteen and full of himself, and probably a whole lot ruder than he is now. It makes Izuku happy to know that all these people he looks up to as pro heroes now have been helping Todoroki right from the start. And hearing that Todoroki hasn't always been fearlessly confident, and was just as unsure of himself back then as a normal kid, makes him seem a bit less untouchable.\n\"You know, I started using my fire more because it actually made people  less afraid of me,\" Todoroki says. \"Not more, like I thought it would. I didn't want everyone to think I was just… cold, all the time.\"\nIzuku pulls his knees up to rest his chin on them thoughtfully. \"I think people would've figured it out. Even if you only had an ice quirk.\"\n\"Maybe,\" Todoroki says, \"but it took me awhile to even realize I couldn't always be like that. Not if I wanted to become the hero I dreamed about being as a kid.\"\n\"A hero like All Might,\" Izuku says quietly. A thought strikes him, and he shifts until he's sitting facing Todoroki, so he can stare directly at him with as much earnest intent as he can muster. Todoroki looks wary. \"Wouldn't it be amazing, Todoroki-san—\"\nTodoroki sighs. \"You're relentless.\"\n\"—if  you won  Rescue of the Year?\" Izuku continues, leaning forward in his conviction. Todoroki leans back. \"All Might won it when he was just starting out!\"\n\"Yes, and then several more times, I'm aware.\"\n\"It would be like you're following in his footsteps!\" Izuku points out, hands held toward Todoroki placatingly. \"Just like you wanted.\"\n\"It wouldn't,\" Todoroki says. He slowly reaches out, pressing on Izuku's hands to push them back down.  \"You  took down that villain. And I was able to rescue all those kids because  you  got them to the fire escape. If I win this, it would be like… like I'm taking credit for  you  following in All Might's footsteps.\"\n\"Wh-what…\" Izuku says weakly. \"Todoroki-san…\"\n\"That's what I keep trying to tell you,\" Todoroki says. \"I owe that all to you. I don't even feel like I deserve—\"\n\"No.\"\nIzuku's voice is so firm it startles them both. Todoroki stops talking, eyes wide. Izuku takes a deep breath and leans closer again; this time Todoroki doesn't pull away.\n\"You deserve it,\" Izuku says. \"Because I couldn't have stopped that fire escape from falling. And I couldn't have saved Hana no matter how hard I tried. And  you  were ready to protect us, even when you couldn't use your quirk. You were just as normal as me at that moment, and I bet that's even scarier when you've always had a quirk to rely on before.\"\nTodoroki doesn't deny that it was scary. \"I haven't… thought about it like that.\"\n\"I know,\" Izuku says. \"That's why I'm telling you now.\"\n\"But in the end,\" Todoroki says, frowning, \"I still wouldn't have survived if not for you.\"\n\"Well, I guess we rescued each other, then,\" Izuku says with a roll of his eyes. Todoroki's smile seems to indicate he can accept this. \"They can't nominate  me, though, so I guess you just have to go and win for both of us!\"\nSomething in Todoroki's expression clears, and when he nods again, Izuku doesn't see any more doubt in his eyes. \"I see.\"\n\"Oh,\" Izuku says. Somehow, he hadn't expected that to be the thing that convinced Todoroki. It makes his stomach all fluttery and light. \"Good!\"\n\"Yeah.\" Todoroki glances at him. \"Midoriya, you don't mind… talking about this? We can stop.\"\nIzuku waves his hand. \"I'm fine! I gave up on wanting to be a hero like All Might a long time ago, so, it doesn't upset me anymore. It's amazing to hear about this actually… it's stuff I've always wanted to know about you.\" He worries at his lip with his fingers. \"Um, sorry, if that's weird…\"\n\"Well, I'm probably the best person to ask,\" Todoroki reassures him.\nIzuku smiles. \"Thanks for the honest answers.\"\n\"Anytime,\" Todoroki says. \"Also, your turn.\"\n\"For what?\"\n\"Honesty,\" Todoroki says.\nIzuku sucks in a breath and holds it. For a moment, he's worried that Todoroki is going to ask about his feelings, that maybe he already knows. Maybe he thinks he has to let Izuku down gently, or something. That would be embarrassing enough, but also unnecessary, because Izuku wouldn't dream of trying to push any of that on Todoroki; but if Todoroki feels like he does, then Izuku must be making him uncomfortable, and once it's out in the open, it can't be taken back—\n\"Why am  I your favorite hero, after All Might?\" Todoroki asks.\nOh. Izuku exhales all his breath in a relieved  whoosh. It takes him a moment to respond, as he processes the question, relieved it wasn't something infinitely more embarrassing.\n\"Todoroki-san, why wouldn't you be?\"\n\"There's so many other heroes!\" Todoroki exclaims, startling Izuku with how animated he suddenly is. He seems genuinely perplexed. \"What about Lemillion? He's All Might's successor!\"\n\"He's amazing, too!\" Izuku says. He is a pretty huge Lemillion fanboy, for sure.\n\"Then?\"\nIzuku fights the urge to cover his face. Todoroki has just told him so much, and only asked for honesty in return. Izuku can give him that much.\n\"Because… you remember how I said in the interview it was because I could tell how you try to reassure people?\" Todoroki nods, and he continues hesitantly. \"I think before you, I felt a little bit like even if I'd had a great quirk, I could never have been a hero like All Might, or Hawks, or even Lemillion when he first came out of Yuuei. I could never… I could never make people like me, the way they do. I'm too…\"\nTodoroki looks like he gets it. \"Too awkward.\"\nIzuku sighs. \"Yeah. I'm… I mean, you've met me.\"\n\"So you're saying you could see I was awkward as fuck and sensed a kindred spirit,\" Todoroki concludes.\n\"Basically,\" Izuku says, laughing, because it's  true.  Less so, as Todoroki has grown more confident over the years. But eighteen year old Todoroki Shouto was a whirlwind of brusque replies, blank stares, and awkwardly long pauses. \"But you're still the kind of hero who makes people feel safe. I don't really have the tall, brooding, handsome thing going for me, though, so it was probably always hopeless, anyway.\"\n\"That's incidental,\" Todoroki says. \"For what it's worth… I really think that all the stuff I didn't get about being a hero, back then—in high school, I mean. You just do. You get it.\"\nIzuku opens his mouth wide, and no words come out.\n\"It was All Might who used to tell us the story of what all the top heroes have in common,\" Todoroki says quietly. \"That the first time they ever faced danger, they moved before they had a chance to think. To save people. And that's what I saw you do. I think All Might would definitely consider you a hero.\"\nThere's really no way for Izuku to respond to anyone telling him that, let alone Todoroki. He just stares glassily, and wonders if he may be going into shock.\n\"Thanks,\" he finally manages to whisper.\nTodoroki shrugs. \"You deserve to know. Even if you're past it, and none of that even matters anymore, I liked you right away.\"\n\"Todoroki-san,\" Izuku says, \"that matters.\"\n\"Good,\" Todoroki replies.  \nThey both sit in silence for a while. Izuku would like to say more, but he also feels like he could never speak again for the rest of his life, and that would be just fine.\nAfter a moment, Todoroki says, \"I really didn't mean to make things all intense and awkward, but apparently that's why you like me, so…\"\nThe seriousness dissipates as quickly as it came on once Izuku starts giggling. \"I like you for more reasons than just that, now.\"\n\"That's a recent development, then?\" Todoroki asks.\n\"Maybe.\"\n\"Ah. Nice.\"\nIzuku grins at him, and he grins back.\n\"Thanks for letting me hang out here tonight,\" Todoroki says.\n\"Thank  you  for dinner,\" Izuku replies.\n\"Thanks for calling me in the hospital.\"\nIzuku huffs another laugh. \"Thanks for trusting me with your number.\"\nAnd Todoroki smiles at him. \"Thanks for saving me.\"\n*\nThe morning of the gala arrives a week after Todoroki gets back home. Against all odds, Izuku wakes up and discovers he's not anxious.\nHe is a  little nervous, but it's not the restless, audible heartbeat kind of anxiety he gets when he's really unable to stop worrying about something. It's only a soft flutter, these nerves, and he realizes it's more excitement than anything else that's stirred him awake. Despite the monumental occasion lying ahead of him, he's not that fixated on what he might mess up.\nHe's so eager to see Todoroki again that it overrides most of the potential mental stumbling blocks. Mostly, it helps to know that Todoroki is looking forward to seeing him again, too.\nEven though the gala isn't until that evening, the day gets started pretty early. A car comes to pick Izuku up from his dorm at half past ten, and shortly after eleven he's being dropped off onto the tarmac of a private runway offshoot at the airport. A gleaming white jet is waiting, and Todoroki along with it, standing at the foot of the airstairs. He waves when Izuku gets out of the car, and Izuku beelines for him, hitching his backpack up around his shoulders excitedly. He still can't  really believe he gets to fly on Todoroki's private plane.\n\"After you,\" Todoroki tells him, and Izuku books it up the airstairs and steps into the very height of luxury transportation.\n \"Wooowww,\" he breathes, taking in the interior, a sleek, futuristic space that mixes dark wooden furniture with stark white and black accents, to exude a feeling of class over opulence. There's literal  couches in there, and separate rooms, and a dining area.\nHe's never even been on a normal plane, let alone one that puts any other first class cabin to shame. He'd heard about pro hero transportation and how fancy some of them tended to fly but actually seeing it with his own eyes is  beyond cool. \n\"Can I take pictures?\" Izuku asks.\n\"Go for it,\" Todoroki says, coming up the stairs behind him. \"I know it's slightly over the top, but it does make traveling for work much more bearable.\"\n\"Can't argue with that!\" someone says, and Izuku pauses with his phone poised to snap a photo right as two more people emerge from one of the little lounge areas. He gasps loudly and claps a hand over his mouth.\nPro heroes Uravity and Cellophane wave at them cheerfully. Izuku stares at them both, and does not wave back, because he's far too busy freaking out internally to move or respond.\n\"Seriously, as long as you keep letting us fly with you, I promise we won't make fun of your swanky ass plane,\" Sero says. He turns his always-on grin towards Izuku. \"Yo, I'm Sero! Nice to meet you.\"\n\"I'm Ochako,\" Uraraka says, and oh my gosh, she is even happier and cuter in person than she looks on TV. \"You're Midoriya Izuku, right?\"\nIzuku can only make some kind of wheezing noise in response to their entirely unnecessary introductions.\n\"Sorry, I forgot to warn you,\" Todoroki says. \"Ochako and Hanta are flying with us to Hokkaido because they're both freeloaders.\"\nSero puts a hand over his heart. \"Wow. We're just trying to make sure you have company, and this is the thanks we get?\"\nUraraka claps her hands together. \"Saving time  and money! Thanks again, Todoroki-kun!\"\nTodoroki shakes his head fondly. \"Anyway, yes, this is Midoriya-kun—\"\n\"Iiiiit is  such an honor to meet both of you!\" Izuku says in a rush, bowing frantically, before jabbing Todoroki in the ribs. The hero jerks in surprise and rubs at his side, staring at Izuku in shock. \"You didn't actually forget to warn me, you just wanted to watch me lose it.\"\nTodoroki scratches his chin. \"Hmm.\"\n\"Admit it!\"\n\"Ohh? He isn't afraid to call Todoroki out at all!\" Uraraka says. \"I like him already.\"\nIzuku blushes, but doesn't deny it. He  is getting pretty good at figuring out when Todoroki's expressionless face is carefully hiding his mischievous gremlin scheming. Fortunately, his schemes tend to be good-natured, as far as Izuku is concerned, and this time he appears to be mostly interested in surprising Izuku with a hang out involving two of his favorite heroes. Aboard a private jet on their way to a high profile event where Izuku will undoubtedly get to meet even more.\nJeez, how is this even Izuku's real life anymore?\nHe barely has time to wonder, because Uraraka and Sero are the polar opposite of Todoroki. They're both non-stop talkers, with sharp senses of humor, something Izuku has witnessed in plenty of interviews of the two of them. It's a lot more like being caught up in a whirlwind when most of it is directed right at him, though. He's already pretty overstimulated by just being on a plane for the first time in his life.\n\"That's a window,\" Todoroki tells him as the engine starts to whirr louder outside the cabin. \"You can adjust the transparency from that panel.\"\nIzuku slides his fingers over the glossy touch screen Todoroki has indicated, and the black glass wall next to him shimmers and melts from completely darkened to fully transparent. \"So cool!\"\nHe can see outside the plane now as they taxi down the runway. And then they're tilting, and he presses his face to the glass, momentarily forgetting his nervousness about getting it dirty in his excitement as the ground drops away underneath them. A soothing voice announces over the cabin speakers that the flight will be about an hour and a half.\nSero stretches with a satisfied sigh. \"This is the life! Todoroki, remind me to repay the favor when I finally break into the top twenty pros, like, fifteen years from now.\" He wipes a fake tear from his eye and Uraraka laughs.\n\"That can't be more than four years away, though,\" Izuku says, without thinking. All three of them look at him.\nSero grins. \"Oh, man, you don't have to try and make me feel better! I'm not actually bothered by it, we just like to get on his case.\"\n\"I'm the easiest target when Bakugou's not here,\" Todoroki says.\n\"Exactly!\"\n\"Oh,\" Izuku says. \"Sorry, right! You probably have the numbers already.\" He doesn't want Sero to think he's being nosy.\n\"What numbers?\" Sero asks.\n\"Just the, um, the trajectory numbers,\" Izuku says. \"For your hero rank.\"\nSero laughs out loud. \"Oh, those? Forget it, I'm barely in the top fifty! My agency isn't going to waste resources on hiring an analyst for me.\"\n\"Is it really costly?\" Izuku asks. He had no idea!\n\"It's super expensive!\" Uraraka says. \"I've actually taken some courses for calculating it, so I can kind of do my own, but…\" She scrunches up her face in displeasure. \"There's so many variables!\"\n\"I just don't even bother,\" Sero says, waving a hand.\n\"Well, uh…\" Izuku says, nervously. Should he tell them…?\n\"You've done it, haven't you?\" Todoroki asks. He's doing that sideways glance thing, at Izuku. Sero and Uraraka look between the two of them.\n\"Done what?\" Uraraka asks.\n\"I g-got curious!\" Izuku says. \"So… I… may have figured out the rank trajectory for… Todoroki-san's graduating class…\"\nThe others gape at him.\n \"What?\" Sero finally says.\n\"Our  whole class?\" Uraraka asks incredulously. \"Why?\"\n\"Um… it was fun?\" Izuku offers. He's met with blank stares. \"I c-can show you, actually…\" He grabs his backpack by his feet and pulls out a notebook and pencil.\nAbout twenty minutes later, the tea table near them is covered in little pastries, steaming mugs of tea, and sheafs of note paper with Izuku's equations littered all over them. The four of them pore over the notes.\n\"Top twenty by next fall!\" Uraraka says delightedly. \"That's  way faster than I thought!\"\n\"It's all my best guesswork, pretty much…\" Izuku says hesitantly. \"But I really think you could do it, Uraraka-san! Especially if you win tonight for Most Popular, which I'm pretty sure you will…\"\n\"Izuku-kun!\" Uraraka says, shocked. \"There's just no way, the other nominees are—\"\n\"There's really no point in arguing with him,\" Todoroki says distractedly. He's comparing two stats sheets, looking back and forth between them with his brow furrowed. \"I've had to sit through meetings about this stuff. It's always guesswork. But these look like… very good guesses.\"\n\"Todoroki,\" Sero says, very seriously, \"you gotta share with the rest of us. You can't snatch Midoriya up and hog him all to yourself once he graduates!\"\nThis statement startles Izuku so much he knocks his pencil off the table. He dives down to retrieve it, cheeks blazing red.\n\"He's not a vending machine item,\" Todoroki's voice says from somewhere above him. \"Besides, he's going to have lots of opportunities. He'll be able to choose whatever interests him most.\"\nIzuku doesn't reemerge immediately after locating his dropped pencil. He knows his thoughts must show on his face and he's too embarrassed to let the others see. He desperately wants to ask Todoroki what he means. Is it something he's thought about, too? Could Izuku apply to work at Todoroki's agency that easily, even without a quirk? Or is Todoroki trying to let him down gently, guide him away from the possibility? Or maybe this, like the trajectories he's just calculated, is all conjecture anyway—\n\"Midoriya?\"\nRealizing too late that he's started mumbling, Izuku quickly tries to straighten up, and bumps the top of his head on the underside of the table. He yelps.\n\"Are you okay?\" Todoroki asks.\n\"I'm fine!\" Izuku says. Maybe the bump on the head will cover up why he looks like such a deer in headlights, all of a sudden. He hopes, anyway. \"Um, Todoroki-san, the bathroom…\"\n\"That last door toward the back of the cabin,\" Todoroki directs him.\n\"Thanks!\" Izuku says, scurrying away quickly.\nHe sighs as he locks the door behind himself. He doesn't have to use the bathroom; he just needed a place to regain his composure (also, his eyes are watering from the bump on the head and he doesn't want anybody to think he's crying).\nThe last thing he wanted tonight was for all his expectations and questions and uncertainties to get in the way of just enjoying things. He splashes his face with cold water vigorously. This gala is the pinnacle of  Coolest Things  he will ever do in his life, and he doesn't want to let his brain ruin the event, or the time he actually gets to spend with Todoroki.\nIzuku chews on his lip. It's felt for awhile like things have been building up to this weekend. All the phone calls, the time they've spent together—after this, what happens? Todoroki is immeasurably busy, with things and people all far more important than Izuku. He can't continue indefinitely making time for Izuku like he has been, and Izuku would never expect him to. But he also can't help but wonder how often he'll see Todoroki after the gala is over and done with. Lost in thought, he bites down on his lip too hard, nearly breaking the skin.\n \"Ow!\" He winces, licking the sore spot tenderly.\nThe image of Todoroki appears in his mind unbidden, licking his lips as he watches Izuku talk, and his friend's voice in his head reminds him,  he seems very focused. \nHis mom's voice comes next, a knowing smile and an even more knowing:  he likes you. \nAnd then, a memory of Izuku's name in that  voice,  right in his ear. Todoroki murmuring,  Izuku. \n\"Okay!\" Izuku yelps frantically, cranking on the cold water again. There's a shower in here—maybe he should just dunk his whole head under. No, that would definitely look suspicious when he comes out. He wets his face again and then dries it with one of the fluffy hand towels. \"I am calm,\" he tells his reflection in the mirror. \"I am totally cool and I am not thinking about kissing Todoroki.\"\nWait, what?  Why is he thinking about kissing Todoroki?! \nThe soothing voice that announced their takeoff filters over speakers in the bathroom and he nearly jumps out of his skin.\n\n We may be experiencing some slight turbulence… we would like to ask all passengers to please take their seats… \n\nHe's just gonna have to pull it together. He pats his cheeks and unlocks the door, heading back to where the others are sitting. Right as he passes by Todoroki, the whole plane hits a pocket of rough air, lurching unexpectedly and completely unbalancing Izuku. He flails, but before he can fall flat on his ass and injure himself a second time, Todoroki shoots a hand out and grabs him around the waist. Izuku topples over with a squeak and finds himself suddenly seated very securely.\nIn Todoroki's lap.\nWell, there goes any last hope of staying calm.\n\"Ohh!\" Sero says, eyebrows raised at them. \"Rescue of the year!\" Uraraka giggles. \n\"Thank you, I'm so sorry, thank you!\" Izuku says shrilly. Oh  no,  Todoroki is so warm, and also so much  bigger, looking down at Izuku with an arm still wrapped around his waist. Any heat Izuku had managed to dissipate from his face with all the cold water splashing has immediately rushed back in. His cheeks feel molten hot. \"Sorry!\"\n\"You don't have to apologize,\" Todoroki says.\n I do, though, Izuku thinks hopelessly, but Todoroki doesn't know that, because he is unaware of how carefully Izuku is mentally filing away every detail regarding the entire experience of Todoroki Shouto's Warm Lap.\nTodoroki helps him scoot over to sit on the sofa next to him, just as the plane rolls again. It's a bit dizzying, and makes Izuku's stomach swoop strangely, though not as much as literally falling into Todoroki's lap had.\n\"Izuku-kun, do you want some water?\" Uraraka asks kindly. \"He looks kinda pale, Shouto…\"\n\"This is pretty routine turbulence,\" Todoroki explains, perhaps mistaking Izuku's mortified silence for nerves. Uraraka hands Todoroki a glass of ice water that he passes to Izuku. \"We'll be landing soon.\"\nIzuku nods, not daring to look at him, but the conversation between Todoroki and his friends resumes quickly enough, without anyone dwelling on the weirdness of the moment. Todoroki reclines back against the couch, stretching his arm over the backrest behind Izuku. The next time the plane judders, causing Izuku to jump, he feels a gentle hand ruffle his hair briefly. Todoroki scoots over slightly so their legs are almost touching, and Izuku glances at him, but the hero is still engrossed in talking to Sero and Uraraka about what some of their classmates have been up to recently.\nIt's not wholly unexpected, since Todoroki has always seemed more willing to look past his awkwardness than most people. Still, it helps Izuku to relax, and before too long he's staring out the plane windows at Hokkaido below them as they come in for their landing.\nThey part ways with the other two heroes as they all head to their respective hotels to get ready for the evening. It takes some time to get to where Todoroki and Izuku will be staying by car, and they pass the drive discussing who will be in attendance, and who might win some of the awards that year.\nIzuku can barely keep his jaw from dropping as they pull up through the impressive entryway of the hotel. It looks even more beautiful than it did in the pictures, a luxury ryokan-style resort with a modern touch, tranquil even amidst the bustle of the city. The staff is expecting them, and they don't even have to check in at the concierge. Instead they are discreetly taken up to their rooms on the uppermost floors, where Todoroki has booked two suites for their overnight stay.\nThere is, apparently, personal concierge service on offer, as well as a  butler, though Izuku can't imagine what he might possibly need a butler for. And, Todoroki reassures him before he heads to his own room, if Izuku needs anything he's right down the hall. They'll be reconvening again at four thirty, in just a couple hours, so Izuku thinks he will (probably) be able to manage that long on his own.\nHe ends up wasting a fair amount of time documenting everything about the room as soon as the staff have departed. The bed is  enormous, and soft when he faceplants directly into it. The windows have an incredible view, looking out over the whole city towards the distant mountain range. The bathroom is similarly stunning, with a full sunken tub that he desperately wants to try. He sends about two dozen pictures to his mom, which she exclaims very satisfactorily over, before he gets interrupted by a knock on the door.\n\"Hello, Midoriya-kun!\" Aiko greets him when he opens it, to admit her and what seems to be a small army of stylists. \"Shouto told you we were coming, right?\"\n\"Ah, yes!\" Izuku says. His flushed face and permanently surprised expression probably give off the impression that he was not expecting this. He was, it's just that he forgot, in all his excitement over the suite. \"Come in!\"\nAiko introduces him to the stylist team, and barely has he said hello to everyone that they start pushing their hands into his hair and turning his head this way and that.\n\"I'm going to check on Shouto now,\" Aiko tells him cheerfully, as he is dragged away to his fashionable fate. \"You're in good hands, Midoriya-kun!\"\nAs it turns out, he is in very good hands. In addition to all the experts who make sure Todoroki is always field ready, he has an extremely capable team working behind the scenes to ensure he's always camera ready for events like these, as well. This, Izuku suspects, is more Aiko's doing than Todoroki himself, but he's certainly the last person to complain, given the incredibly vast array of Todoroki pictures he's saved to his phone and various computer folders over the years. And now, they're hellbent on turning that same expertise on him.\nThey end up washing his hair again so they can style it properly, blow drying it after putting some fancy, nice-smelling product in it to make it manageable instead of messy. Somehow, they get his bangs to fall to the side a little bit, half off his forehead. It makes his hair look more deliberately rumpled as opposed to wildly untameable.\n\"No, no!\" one of them—the woman who seems to be in charge of the team—says, right before another can start dabbing some kind of beige, skin-colored cream on Izuku's cheeks. \"Aiko-san said nothing on his face.\"\nThe other one clicks her tongue. \"He's so pale, though…\"\n\"He's fine,\" says the first, waving her hand. \"Todoroki-san likes all these freckles.\"\nIzuku gapes at her. \"D-did he say that?\"\n\"That's what Aiko said,\" the woman tells him, \"and if it comes from her, that means he as good as said it.\"\nIzuku rubs his cheeks hard. \"UmMM—\"\nShe smacks his hand away. \"You're going to make your face blotchy.\"\nHe really doesn't know what to do with the new information he's been given, and now that his hair is done he's pretty much good to go. All that's left is to change into his suit, which has been freshly pressed and delivered to his room personally. They wait until Izuku has gotten dressed to make sure everything still fits correctly—the grey suit is still perfect, and after helping him with his tie and smoothing everything into place, he's finally ready.\n\"Thanks,\" he tells the team breathlessly, and they all give him encouraging nods.\nRight on cue, there's a knock on the door. As everyone starts to bustle around cleaning up their styling tools, Izuku hurries to answer it. It's four thirty on the nose. He pulls it open.\nHe's struck absolutely speechless.\nTodoroki stands waiting at his door. He took the words to heart when Izuku had suggested he wear something dark-colored. His suit is full black-on-black; black fitted shirt under an ink dark vest, black tie. His coat, also black, is sleekly aligned with his torso to show off his distractingly strong shoulders. The pants are so dark yet so shiny, possessing a rich luster that only serves to highlight how nice Todoroki's legs are: long, powerful like the rest of him.\nAgainst the pale skin of his throat, his wrists, with his hair swept off his forehead, the suit makes him look more than just mature. He looks darkly enigmatic, like a handsome vampire from a movie or something; like if Izuku let himself, Todoroki could steal him away and he'd be lost forever. Izuku is sure he'd never want to come back.\n\"Wow,\" Izuku whispers, accidentally out loud.\n\"Yeah,\" Todoroki mumbles back, which seems odd, until Izuku tears his eyes away from Todoroki's… everything, and looks at his face, and realizes Todoroki is staring at him, in return.\n\"Oh,\" Izuku says, and Todoroki's gaze jerks upwards to meet his. He looks as surprised as Izuku feels.\n\"Hi,\" Todoroki says.\n\"Hi,\" Izuku responds.\n\"You, um,\" Todoroki starts to say, waving his hand vaguely above his head. \"You did something to your hair…\"\n\"I—yeah,\" Izuku says, before shaking his head rapidly, because he in fact did nothing. \"I mean, your stylists did. They, uh, they brushed it…\"\n\"Oh,\" Todoroki says. \"It looks—it looks good.\"\n\"Really?\" Izuku asks.\n\"Yeah.\"\n\"Ah, g-good,\" Izuku stammers, before realizing how arrogant that sounds. \"You, also! Your hair looks good. Not just your hair! All of you. It looks good.\"\n\"Thank you,\" Todoroki says.\nIzuku puts a hand over his face. \"I mean—the suit.\" All of Todoroki does look very, very good, but how weird does  that  sound?\n\"You recommended it,\" Todoroki reminds him.\n\"I did, huh?\" Izuku says. He feels very buoyant, suddenly, and can't help but giggle. It does come out somewhat hysterical, but he's just—this is surreal. \"Good job, me.\"\nHe might be imagining it, but he thinks Todoroki gives him another quick once over, eyes flicking down and then back up again. \"Good job on a lot of things.\"\nIzuku laughs nervously again. \"T-time to go?\"\nTodoroki nods. \"If we don't want to be late.\"\nIt takes about an hour to get to the venue where the gala is being held. The event doesn't officially start until six, but there's one more important thing to do before it gets in full swing.\nThey pull up to the curb, and as people hurry to open the car doors for them, Todoroki says, \"You don't have to smile if you don't want to, just wave. And ignore all the yelling. Oh, and don't look directly into the flashes.\"\n\"Wait, can you repeat—\" Izuku starts to say, but then the car doors are opening, and he feels like Present Mic is shouting directly in his face—which, actually, is almost exactly what's happening.\n\"THERE HE IS, EVERYONE'S FAVORITE, SMOKING HOT AND DASHINGLY COOL HERO,  SHOUTO!  AND WHO'S THAT WITH HIM?\"    \nThe amount of camera flashes that pop off in Izuku's face blind him almost instantly. He stumbles getting out of the car, but a big, steady hand splays warm at the small of his back, making sure he doesn't fall.\n\"I know it's the worst,\" Todoroki mutters to him under his breath.\nActually, Izuku has gone to a lot of events like these, one of the many, many faces lining the red carpet past the roped off barriers and security guards. He's just never been the one the cameras are pointed at. Still, he grins at Todoroki, or at least tries to—there's still so many spots swimming in front of his eyes he can't actually tell if he's even looking at the hero.\n\"People are just really excited to see you!\" he says. \"I know how that is.\"\nThere are tons of people in the crowd wearing Shouto merchandise, waving signs, trying to get his attention. A lot of people are pointing at Izuku. Shouto waves at them, and they get stopped for pictures and questions a couple times. Todoroki gets complimented on his choice of attire, which he seems oddly appreciative about.\n\"Thanks,\" he tells the reporter. \"Midoriya recommended the suit.\" \nIzuku nearly chokes on his tongue. \"Not exactly!\" \nTodoroki ignores his protests, conveniently spotting something to point out in the crowd.\n\"Midoriya, look,\" he says. Izuku follows the line of his arm and sees what he's pointing at. There are two girls in the crowd, both waving and yelling something. They're wearing Shouto gear but when Izuku looks their way, they both start waving wildly. Izuku has no idea what's going on, until Todoroki says, \"They're fans of yours, so you should wave back.\"\nIzuku blinks, uncomprehending. They're what, now?\nHe raises his hand and gives them a tiny wave, and a hesitant smile.\nThey both start jumping up and down, squeezing each others' hands in excitement. Izuku thinks they might be screaming, and then he realizes they  are—they're shouting something about autographs. One of them holds up her Shouto poster and a pen.\n\"Me?\" Izuku asks, pointing at himself. Todoroki pushes him forward.\nOn wobbly legs, he meets them at the velvet ropes. Most people don't pay him that much attention, still trying to get pictures of Todoroki (who stays safely out of reach), but Izuku signs his name as neatly as he can, with a hastily added  Thank you for saying hi! \n\"You're our hero!\" one of the girls tells him, and he reflexively hides behind his hands in shock, which in turn makes her also cover her face in embarrassment.\n\"Thank you!\" he says, as he's hurried along by staff, who are already shepherding Todoroki towards some of the interviewers, before they get inside the venue.\n\"Well, well, well!\" someone says as they draw near, and Izuku recognizes the very familiar face of Chargebolt, who gets nearly as many gigs as a celebrity host with his electrifying personality as he does hero work. \"Look who it is!\"\nHe's disarmingly magnetic in person, grin a million watts, so bright it nearly makes Izuku overlook the mic in his hand and the cameras following his every move. But Todoroki appears completely at ease with him, which makes it easier for Izuku to relax.\n\"How've you been, Kaminari?\" Todoroki asks.\n\"Oh, the usual,\" Kaminari says, \"pretty awesome. Glad you could grace us with your presence this evening. And happy to have you back in Japan! You freaked us all out pretty good, you holding up okay after that?\"\nIzuku vaguely recognizes the flow of an interview question, but it's casual, and Todoroki doesn't seem put off by it. Kaminari is good at what he does, especially at an event like this, where he knows so many of the attendees. He makes every interview seem like a conversation between two friends just catching up.\nTodoroki talks a bit about his speedy recovery following his recent injury, reassuring Kaminari that he's doing just fine. Kaminari does seem genuinely relieved to hear it, although he must have already known most of the details, given their class network.\n\"Well, so glad you made it tonight. And, uh, I can't help but notice… not alone!\"\nContent just to listen, Izuku startles when attention suddenly shifts to him. He bows and waves at the camera. \"Hello!\"\nKaminari grins and turns to Todoroki. \"He really doesn't need it at this point, but, gonna introduce us?\"\nTodoroki does that thing again, settles his hand at the base of Izuku's spine—a little protective, and very calming. \"This is Midoriya Izuku. My…\" He looks down as Izuku glances up at him, wondering why he paused. \"He's my guest.\"\n\"Midoriya-kun,\" Kaminari says, \"how are you enjoying the evening so far?\"\nIzuku leans into the mic when it's thrust toward him. \"Oh, it's amazing. I'm super excited to be here! H-how about yourself?\"\nThis makes Kaminari laugh. \"I'm having a pretty good time! Thanks for asking!\"\n\"This is why everyone keeps saying he's more polite than me,\" Todoroki comments.\n\"To be fair, that's not hard to achieve,\" Kaminari says, his grin getting wider when Todoroki shakes his head. Conspiratorially, right underneath the nose of Todoroki's impassive stare, he tells Izuku, \"You know this guy has never brought anybody to one of these events before, right? Like, ever?\"\nThis  is  something Izuku knows, because what  doesn't he know about Todoroki, but somehow he hasn't thought of tonight in those terms.\n\"I'm—\" he says, not sure what exactly he's supposed to say to this, \"I feel very lucky to be here tonight!\"\n\"I'm sure you're not the only one,\" Kaminari says. \"Thanks so much for your time, you two! I'll catch up with you later—enjoy the rest of the evening!\"\nInterview completed, they're funnelled on through, finally stepping into the main doors to the hall itself. Inside, the atmosphere is lively, but less frantic. Music drifts throughout the venue from a live band, and the floor is packed with people mingling and talking. Everywhere Izuku looks, he spots familiar faces, heroes he thought he'd only ever see up close through his computer monitor. Now he's in the same room as all of them, at once. It's incredible.\nBut the most amazing thing to happen yet, probably, is when Todoroki leans closer to say quietly, \"Kaminari was right, actually.\"\n\"About what?\" Izuku asks, standing on his tiptoes to catch a glimpse of someone he thinks might have been Lemillion.\n\"I feel pretty damn lucky that you're here tonight, too.\"\nIzuku spins around to look at him. Todoroki just smiles, before looking away, across the hall.\n\"Want to check out the food?\" he asks, as though he hasn't just rocked Izuku's world, once again.\nFood does sound good—and Izuku would follow Todoroki pretty much anywhere. So he says, \"Lead the way!\"\nHe feels like he's walking on air, all of his earlier worries suddenly seeming pointless. The night is just getting started, and whatever happens after is a million miles away, like the ground seen from the windows of an airplane.\nThe first half of the gala is something of a blur to Izuku. There are a lot of important, impeccably dressed people that keep stopping Todoroki to talk, even if he doesn't always seem like he wants to. Fortunately, they also keep bumping into a lot of interesting heroes that Todoroki knows, for Izuku to ogle disbelievingly. He's never dreamed he would get to be in a room with this many pros at the same time. Todoroki continues to make sure Izuku is included in the conversations, despite how surprised most people seem to be meeting some young, nameless college kid at such a prestigious event.\nThey warm up to him once they realize he's the one who saved all the children in the university villain encounter. He's not expecting so many people to recognize him, but more than just a few take the time to commend Izuku for what happened that day, until he's fairly overwhelmed by praise from all the heroes he's admired and looked up to for so long.\nDespite his awkwardness, Izuku finds every conversation immensely interesting, and he's content to listen in and file away as much information as he can. Todoroki, on the other hand, looks more and more fatigued after each encounter.\n\"Do you want me to get you any more food?\" Izuku asks him after what seems to be a particularly draining conversation with a prominent politician. \"Or a drink, maybe?\"\n\"I could use several drinks,\" Todoroki mutters, and then shakes his head when Izuku laughs. \"No, I'm fine. Sorry—this must be so damn boring for you. I swear I didn't invite you just for you to get stuck listening to a bunch of people drone on and on.\"\n\"It's not boring, actually,\" Izuku reassures him. \"Besides, I know it's all stuff you're obligated to do, or something.\"\n\"The perks of being a hero,\" Todoroki says. \"Some of my friends are great at these events, but I'm…\"\nIzuku nudges him in the side with his elbow. \"I think you're doing great, too.\"\nTodoroki looks surprised, so Izuku just smiles at him. He  has been doing pretty great; a lot of the conversations with the political and government elite are thinly veiled requests for his public support in various areas. Navigating that minefield is tricky, but Todoroki and his resting blank face pull it off admirably.\n\"The awards should be about to start soon,\" Todoroki says. \"Ah, actually, there is someone I wanted to introduce you to before they do…\"\n\"Me?\" Izuku asks, following him through the crowd, to one of the tables closest to the stage. There are several very high-ranking pros seated at it, though one man in particular sits with his back toward them, his face not yet visible.\nIt's a thin back, almost skeletal, though the figure in the dark blue suit is very tall. Their hair is on the long side—a bit scraggly, going grey, though it's hard to tell for that startling shade of yellow-blond.\n\"T-Todoroki—\" Izuku starts to whisper, a strange, breathless panic overtaking him, but Todoroki is already saying very respectfully,\n\"Sensei?\"\nThe man turns, and Izuku stops breathing entirely.\n\"Todoroki, my boy,\" Yagi Toshinori says, his shadowed eyes crinkling up at the corners in happiness, \"you look remarkably well.\"\n\"I am,\" Todoroki agrees. He bows to the man sitting next to Yagi. \"Aizawa-sensei.\"\n\"Don't mind me,\" Todoroki's other former teacher says, waving a hand tiredly. He looks like he means it. Izuku has never seen all that many pictures or videos of the reclusive underground hero, but even in a sharp black suit with his long hair pulled back, Aizawa appears remarkably exhausted.\n\"I wanted to introduce you,\" Todoroki says, with a nod at Izuku.\nIzuku barely notices that this is his cue. Internally, he is shrieking. This is like meeting Todoroki's parents; no,  worse,  because Endeavor may be terrifying but this is  All Might. \nALL.  MIGHT. \nIzuku has one chance,  one, to make a meaningful first impression, and he wasn't even expecting to speak to the man tonight. He wishes Todoroki had warned him so he could mentally prepare, but maybe that would have been a disaster, too, given his tendency to overthink things.\nWhat does he say, what does he say,  what does he say? \n\"Hello,\" he says, hearing the words come out of his mouth without actually comprehending them, \"I'm Todoroki's date.\"\nTime seems to slow to a near standstill. Dimly, Izuku is still aware of things occuring—Todoroki at the periphery of his vision turning towards him, Yagi's eyebrows raising, Aizawa expressionlessly taking another sip of his drink. It all seems meaningless, just like his existence, now. His words are pinging about in his clearly empty skull, over and over.\n\n It's not a date, mom, how many times do I have to tell you, we're not going on a date. \n\n\"Just—\" he wheezes, \"kidding, I didn't mean—a date like a  social  engagement, Todoroki didn't—I mean, we're  not,  I don't know why I  said that,  probably because I'm so—freaking out, right now, but I'm just his guest, this is just a normal, totally normal gala and I'm just here to be Todoroki's friend—I mean,  guest, and I am so, so sorry, does anyone want another drink? Some of those shrimp cocktail things? I can—\"\n\"It's okay, Midoriya,\" Todoroki says, and Izuku snaps his mouth shut. Yagi and Aizawa are still staring at him.\n\"So,\" Aizawa says at length, \"he does have a name besides 'Todoroki's date,' then?\"\nIzuku stares numbly into space at a point somewhere above Aizawa's ear and, even though his name is no longer worth mentioning, mumbles, \"Y-yes… it's—\"\n\"Midoriya Izuku,\" Yagi says kindly.\nIzuku flounders soundlessly, like a fish left out of water for far too long. All Might said his full name; All Might  knows his name.\n\"Yes!\"\nYagi's eyes crinkle again. His face is… is honestly kind of terrifying, Izuku has to admit, but also somehow very kind. He hasn't seen much of All Might up close after his decline, years ago. After the horrible fight with All For One, a villain most of the rest of the world hadn't even realized existed until that night. Maybe the heroes had wanted to keep All Might's memory, his legacy, as close to intact as they could.\nIzuku feels a very pronounced sadness over this. Not that Yagi has waned in the way that he has, because all people do, even heroes. But standing in front of him now, Izuku doesn't feel the slightest bit different about the man he's wanted to be like all his life. Even gaunt around the edges, All Might's smile is  real. \n\"I was hoping I'd see you here, tonight,\" Yagi says.\n\"M-me?\" Izuku asks. He knows All Might doesn't lie but how is he supposed to believe  that? \nBut Yagi laughs. \"Of course! Imagine my surprise when I heard you say I was your favorite hero. I felt very well represented.\"\n\"You saw that interview?\" Izuku gasps. The thought is vaguely horrifying. He'd been so…  himself in it.\n\"I was very curious about you, I'll admit,\" Yagi says. \"Shouto was so taken with you that I had to—\"\n \"Sensei,\" Todoroki hurriedly interrupts, and Yagi's smile widens as Izuku swivels his head back and forth between them.\n\"Sorry, sorry,\" Yagi says, \"just an old man rambling. Mostly, what I wanted to tell you tonight, is thank you.\"\nIzuku shakes his head, shocked. \"For what?\"\n\"For putting yourself in danger to save others,\" Yagi says. \"Including the life of one of my former students.\"\n\"But that was…\" Izuku swallows. \"I was just in the right place at the right time.\"\n\"That's all it ever is, for the most part,\" Yagi says.\n\"No, it's—it's really thanks to you, and Shouto, too! And other, real heroes.\" Izuku clasps his hands together nervously. He doesn't know how to accept this—thanks from someone who has done so much, when Izuku has done so little.\nYagi's brow furrows, and Izuku wonders if he's said something wrong. \"I don't understand,\" the man says, \"I wasn't there that day. You were alone, when you did what you did.\"\n\"Ah, I know, but—I was able to do it, because of everything I've learned about you—because of you!\" Izuku explains. \"That's why I admire you so much. You inspire people to do that kind of thing, even someone like me.\"\n\"My boy, that's not how it works.\"\n\"If it hadn't been for you, I—\"\n\"Young Midoriya!\" Yagi says, his voice suddenly more forceful, enough that Izuku can't help but listen. \"Believe me when I tell you: even if you'd never heard of me, you would still have found a way to do what you did.\"\nIzuku worries the bottom of his suit jacket will be irreversibly crumpled with how hard he's clutching it. He's always believed in All Might, all his life. So why is this time so difficult? \"How… do you  know  that?\"\n\"No one, not even I, could ever make someone else a hero,\" Yagi says, with complete certainty. \"The only way for any of us to become one is through our own actions.\"\nSpeechless, Izuku stares at him. His eyes feel hot, and go blurry a moment later.\n\n All Might just called him a hero…? \n\nThe lights dim, and an announcement for people to begin taking their seats for the awards portion of the evening is made.\n\"Thanks, sensei,\" Todoroki says. He puts a warm hand across Izuku's back again, as much to steady him as to get him moving. Izuku swipes at his eyes, and bows to Yagi and Aizawa as deeply as he can without looking ridiculous (he probably looks a bit ridiculous).\n\"Thank you for everything,\" he says. He doesn't know what else he could say that would ever be adequate.\n\"I am honored to have been your hero, my boy,\" Yagi tells him.\nIzuku dares to look him right in the eye. \"You're  still my favorite hero!\"\nTaken aback by the force behind his words, Yagi laughs, before glancing at Todoroki. \"I do wonder how long that will last…\"\n\"Huh…?\" Izuku starts to ask, but the lights dim again, and they've got to get to their table before they wind up stranded.\nIzuku sits in his seat numbly. Present Mic has already bounded onto the stage to the podium, but Izuku barely hears what he's shouting. He's still working out what just happened; even just the fact that he got to talk to All Might is almost too great to comprehend, nevermind the fact that All Might…  believes  in him, somehow.\nDespite everything people have said, despite even what  Todoroki has said, Izuku can't quite buy into his own hype. He can acknowledge that he made a difference. And he realizes he saved Todoroki's life, and the schoolgirl, Hana. For that, he's especially grateful.\nBut since then, it's felt like people are trying to insist that Izuku is something he's not. He's never felt like a hero—just a scared boy who stumbled his way into a lucky solution. The most nerve wracking part of this is that it makes him feel like all Todoroki's reassurances and time and friendship are the result of something with no real basis. When he's at his most anxious, it still makes him feel like he's tricking Todoroki, somehow; and that at any moment, Todoroki will realize it too, and Izuku will no longer be worth his attention.\nBut All Might is  the  hero, the greatest hero who ever lived. He knows what it means to be one. And Izuku has never doubted him before. There's something in what he said that feels different. Izuku had even talked about it himself, when he'd recalled Todoroki shielding them without a quirk to defend himself. It wasn't about the situation or the stakes, but the  choice. \n\"Are you okay?\"\nIzuku jumps slightly, broken out of his daze. He turns to look, and there's Todoroki, leaning in close with a frown. It's dark, hopefully too dark to see that Izuku is crying (although Todoroki probably knows); but not quite dark enough that Izuku can't see the concern in his eyes, light and dark, illuminated by the reflection from the lights on the stage.\nAnd suddenly, he realizes that Todoroki doesn't just see a kid with skinny wrists and watery eyes and no quirk to speak of, a fleeting media sensation, with nothing else remotely remarkable about him. Todoroki doesn't see everything Izuku isn't, or can't be. He sees everything Izuku aspires to be; he sees a hero in him.\nTodoroki always looks at Izuku as though Izuku is something he's never seen before.\nIzuku realizes his hands are shaking (adrenaline or nerves or both) and clenches them together in his lap. They're announcing the first award category—Rescue of the Year, already, and Todoroki is supposed to be paying attention to  that, not him.\n\"I'm okay,\" Izuku says, smiling at Todoroki to show he means it. He's so okay that it kind of hurts. \"I'm really good.\"\nTodoroki nods and then—tentatively—lowers his hand over both of Izuku's. He does it softly, the warmth of his palm settling in hesitant degrees, like he's afraid if he moves too swift or too sudden, the spell will be broken, and Izuku will be gone.\nIzuku stares down at their hands, too stunned to speak once again. Todoroki's hand is heavy over his, and his fingers are long and slender; he can easily cover both of Izuku's hands with one of his own. He squeezes, and the weight and pressure makes the trembling of Izuku's fingers start to subside.\n\"If you're my date,\" Todoroki murmurs, \"is it alright to hold your hand?\"\nIzuku bites his lip as he feels laughter bubbling up inside him. \"Jeez, Todoroki-san,\" he whispers back, \"I panicked.\"\n\"I know,\" Todoroki says.\n\"You knew I would.\"\n\"I did. I'm sorry.\"\nIzuku exhales slowly. He turns his hand upwards, so that his palm is pressed to Todoroki's. \"It's alright with me. If it's alright with you.\"\nTodoroki smiles a tiny smile of his own and keeps his hand resting over Izuku's, as Present Mic checks the results.  \n\"Rescue of the Year goes to…\" A pause for dramatic effect… \"Shouto!\"\nThe room bursts into applause and Izuku gasps so hard he almost chokes. Ecstatic, he literally pops up onto his feet, wriggling his hand free from Todoroki's to clap with everyone else, before realizing that Todoroki isn't moving. He seems to just be opting for sitting there looking surprised and mildly baffled.\n\"Todoroki-san!\" Izuku squeals, pulling on his arm to get him to stand. \"You have to go accept the award!\"\nHe decides to only say  I told you so in his head, because he's too happy to really try and hold it over Todoroki. He watches Todoroki take the stage, can't help but admire how drop dead gorgeous he looks under the lights. Truly a job well done, Izuku thinks proudly. If all his accumulation of fanboy knowledge results in nothing beyond that suit, he'll still be happy.\nTodoroki leans into the mic and clears his throat. Izuku can tell he feels awkward; he's known Todoroki's body language well even before spending so much time with him in person, but the straight-backed way he's standing and emotionless expression give it away immediately.\n\"This is really surprising,\" Todoroki says, in his most deadpan voice, and the whole audience laughs. It makes him snort, too, and he smiles a bit—reluctantly, at first, before his eyes flick over to where Izuku is sitting. Izuku gives him the tiniest of waves and a thumbs up, and Todoroki's shoulders relax a fraction. \"Actually, I was convinced I wouldn't be winning anything tonight. But then a friend talked some sense into me… so I do have something planned out to say.\" He clears his throat, before continuing.\nHe thanks All Might and his old teachers, the group that works for him at his hero agency, the organizers of the gala and awards ceremony. He thanks Endeavor, too, very belatedly—Izuku will ask him later if he really almost forgot or if that was intentional. He mentions how he never really would have been able to anticipate winning something like this, during his years at Yuuei, and that he's glad to have been given the opportunity.\nHe's nearing the wrap up point, when he pauses to say one last thing.\n\"I realize I've said more than most people have ever heard me talk in one go, so I swear I'm almost done…\" More laughs from the crowd follow this statement, and Todoroki finds Izuku among them one more time. \"I do need to talk about Midoriya Izuku.\"\nIzuku, who has been watching him fondly with his chin propped on his hand, nearly slams his face into the table when his elbow slips off the edge as he startles in surprise.\n\"Midoriya, this would have been a, uh… posthumous award if you hadn't been there…\" This startles even more laughs out of everyone as Izuku puts a hand over his face. He cannot believe Todoroki would joke about that  now.  \"But you did, and because of that I'm here. And I'm glad that I won tonight, so I could prove you right. I can gratefully accept this because of you, and I wanted to win it  for you—as a thank you for saving me… and for believing in me since the start.\"\nHe steps back from the mic and bows, as Izuku proceeds to have a mini-heart attack. He wants to cover his bright red face, but he also can't take his eyes off Todoroki as the hero jogs down the stairs probably a little faster than is necessary. Izuku stares at him with wide eyes up until he drops back down into his seat at the table, looking very relieved to have that over with.\nHe looks at Izuku, who instantly looks away with a squeak. Then, worried that that's too rude, he tears his gaze back. Todoroki is watching him.\n\"I embarrassed you,\" Todoroki says, very quietly.\n\"Yeah!\" Izuku whispers. \"I wasn't expecting that.\"\n\"I needed to say it,\" Todoroki says.\n\"I'm not sure that's true,\" Izuku says. \"But I still liked your speech.\"\n\"Really?\"\n\"Mmhm,\" Izuku says. He hesitates, before turning his hand palm up, on his lap. He's not even sure Todoroki is looking.\nA second later, Todoroki takes his hand again.\nThe awards are extremely fun to watch. Uravity does end up grabbing the award for Most Popular, while Ground Zero very proudly brings home the high honor of Hero Performance of the Year. Many of Todoroki's classmates are nominated or winners in their categories. Izuku is very satisfied to see most of his predictions for the winners come true.\nThere's also the fact that he gets to  hold Todoroki's hand  the entire duration of the awards ceremony. He's not sure what he's going to tell his mom after this. Is it really a date, then, even if he's the one who accidentally called it that first? Todoroki didn't disagree… also, he seems to  want to hold Izuku's nervous, sweaty hands. Besides being an act of martyrdom in and of itself, that's a whole new level of closeness between them that Todoroki was willing to initiate.\nIzuku can't really think about these details for too long without feeling like he's going to spontaneously combust, so he tries to focus very hard on the awards being presented.\nIt can't last forever though, and eventually Present Mic is screaming out a last thank you and goodnight, before the lights come back up and the band begins to play again. The audience still lingers to talk and congratulate the winners, and more people come up to chat with Todoroki.\n\"Shouto!\" Sero calls as he sweeps by on his way out, \"see you at the after party?\"\n\"Maybe!\" Todoroki says.\n\"Aw, come on!\"\n\"After party?\" Izuku asks, peering at Todoroki curiously.\n\"Yeah, my old class has one every year,\" Todoroki explains. \"But we don't have to go if that's not—\"\n\"I can too?\" Izuku demands.\n\"Yes, guests are invited,\" Todoroki says, blinking at his fervor. \"Do you want…\"\nIzuku grabs his arm. \"Todoroki-san! Your class—Yuuei's  most promising generation—\" \n\"Okay, okay!\" Todoroki agrees, as Izuku shakes him with a manic passion. \"Right, I should've expected that, I guess.\"\n\"Yes!\" Izuku yelps, punching the air in his excitement. \"This is the best night of my life!\"\nThe Yuuei class after party is at a fancy hotel nearby, but apparently not heavily publicized or open to press. They've reserved the penthouse for the evening, a beautiful sprawling space that is already rambunctiously loud by the time Todoroki and Izuku turn up. Several people shout out to them when they walk in, drinks raised in greeting.\nIt's a good thing Izuku already met All Might earlier in the evening, because by now, his breaking point has been reached. If it hadn't, he thinks the sheer combined presence of the people in this room would have knocked him unconscious.\n\"Izuuukuuu-kuuuun!\" Uraraka calls over the heads of her former classmates. She holds up her statuette, pointing to it animatedly. \"You were right!\"\nIzuku waves back, thrilled to even be acknowledged by anyone. He's barely thought this when a second later someone is slinging an arm over his shoulders affably.\n\"Glad you guys made it!\" Sero says, his grin as wide as ever. \"Todoroki, you decided not to go into Old Man Mode, huh?\" Loudly, he whispers to Izuku, \"When we were still in school he used to go to bed before nine, like, every night.\"\n\"So responsible, Todoroki-san!\" Izuku exclaims.\nSero sighs. \"Okay, I'm clearly trying to mock you in front of the wrong demographic here.\"\n\"I always come to our class parties,\" Todoroki says mildly, unbothered by being poked fun at.\n\"Yeah, but we weren't sure if you had other plans tonight,  obviously,\" Sero says, as Kaminari, joined by the recognizably pink Ashido Mina, strolls up to join them. Kaminari wiggles his eyebrows at Izuku.\n\"Sorry, Midoriya, we didn't hijack your man, did we?\"\n\"My wh-what?\" Izuku stammers. \"No, I wanted to come, too!\"\n\"Ohhh, he's cute and  a party animal!\" Ashido crows, ignoring the fact that Izuku is clearly anything but. \"He needs a drink!\"\n\"I'll take that,\" Todoroki says, intercepting the beer she passes to Izuku, who is still a few months shy of the drinking age. Ashido makes disappointed noises as Todoroki drains half of it in one go.\n\"Aww, nobody's gonna care, let him have some fun!\"\n\"I'm having fun!\" Izuku reassures her. He really is, and even with Japan's practically non-existent underage drinking regulations, he doesn't want to risk getting Todoroki in trouble for letting him loose on the open bar. Not to mention, Izuku is absolutely sure he'd be an embarrassment if he got drunk surrounded by so many of his idols, so it's probably best to play it safe.\nKaminari laughs. \"You're too good to this guy, Midoriya. Don't let him cramp your style, alright?\"\n\"I won't!\" Izuku chirps, which makes the other three laugh.\n\"We'd all be lost without your guidance, Denki,\" Todoroki says dryly. Kaminari flashes them the most exaggerated wink Izuku's ever witnessed before he, Mina, and Sero drift off to chat with some of their other friends.\n\"Shouto-kun!\" someone calls out excitedly, and more familiar faces hurry to greet them—two people Izuku recognizes as Todoroki's closest friends from Yuuei, Yaoyorozu Momo and Iida Tenya. For a few moments, Izuku is too starstruck to even introduce himself properly. Like Todoroki, Yaoyorozu and Iida are basically pro hero royalty; both of them are as towering as he is and equally as beautiful in their formal wear (Yaoyorozu looks particularly stunning in an intricately designed traditional kimono). Being surrounded by the three of them makes Izuku feel a little bit like a sentient potato, but a very happy potato nonetheless.\nIida moves his arms around just as much in real life as he does on TV, and Izuku has a hard time not watching the sharp cuts he makes with his hands as he animatedly congratulates Todoroki on his award.\n\"And Midoriya-kun!\" Iida suddenly blares. \"I'm delighted to be able to make the acquaintance of one as admirable as yourself! Shouto has spoken very highly of you to us.\"\n\"Aah, me as well,\" Izuku says, flustered, \"I mean, I can't believe I get to meet you both! I've always thought you're both incredible heroes, and Todoroki-san has told me so much about you!\" They both look extremely touched.\n\"We were thrilled when Todoroki-san told us you would be joining him tonight,\" Yaoyorozu tells him. \"We've been looking forward to meeting you for so long.\"\n\"R-really?\" Izuku squeaks. He hopes it isn't proving to be a letdown, given he hasn't done much beyond stare at everyone in awe.\n\"Oh, yes!\" Yaoyorozu gushes. \"It's the first time he's ever been so fond of someone! We wanted to talk to you ourselves, of course, but Ochako already told us girls all about you, so I'm just so happy!\"\n\"That's so nice of her!\" Izuku practically wails.\n\"We all think you two look very cute together,\" Yaoyorozu says, delicately putting her fingers to her mouth as she smiles. Izuku wheezes.\n\"How much wine have you had, Momo?\" Todoroki asks, and then deftly dodges the swat she aims at his arm.\n\"This is my first glass!\" she says indignantly. \"You're working faster than me it looks like.\" Todoroki's response is a very long and defiant drink from his beer.\nUnlike most of the discussions he'd been dragged into during the gala, Todoroki seems quite content to let his old friends sweep him away into various topics of conversation. They talk about the past year, hero rankings, reminisce on their school days—Izuku hangs on every word, and instead of feeling like an outsider, finds them all eager to share the impressive laundry list of their exploits with him. In fairness, he's a very good audience of one. He's never even heard  half these stories, like the quirk apprehension test their very first day of class, or their two on two hero versus \"villain\" fights.  \nTodoroki is also probably the most relaxed Izuku has seen him around other people, besides Aiko, and more recently, Izuku himself. Todoroki does still retain an air of respectfulness around the two of them that he drops entirely with his former classmates, likely out of self-preservation. They're all ruthlessly overfamiliar with him and look for every opportunity to find something to tease him about. It's also probably saying something that he's several beers in; his responses to teasing have become less reserved and more hilarious with every bottle, and his cheeks are a very telling shade of pink. It's… kind of unbearably cute, in Izuku's opinion.\n\"It's not like that magazine shoot was my first choice,\" he explains adamantly to Jirou and Tokoyami at one point, who are both snickering at his attempts. Izuku has never actually seen Tokoyami smile, in any pictures—it's pretty weird seeing him laugh. \"Aoyama is… persuasive,  you know that better than anyone…\"\n\"Yes,\" Tokoyami admits, \"but that is also why I always say I'm busy when he starts proposing his schemes of dark design.\"\n\"Dude, no judgment though,\" Jirou says innocently. \"It was a good spread.\"\n\"Shut up,\" Todoroki says, finishing off his beer.\n\"I'm serious!\" Jirou insists. \"Midoriya agrees with me, right?\"\n\"Uhhh,\" Izuku says, trapped unexpectedly. The photo shoot in question had basically been a vanity piece for luxury products, featuring several of the hero world's most eligible bachelors. Todoroki had been very handsome in it, and also very inexplicably shirtless, and Izuku has those pictures burned into his brain at this point.\n\"Not a question you have to answer,\" Todoroki says sagely.\n\"Nnnnno, no, I think he does,\" Jirou says. But before Izuku can say anything in response, a new challenger approaches.\n\"Oy!\" The shout is loud, and sharp, and pretty unmistakable. Izuku freezes, shoulders hunching up around his ears. Todoroki shakes his head.\n\"Here we go,\" he sighs.\nMost people in the room literally clear the way as Bakugou Katsuki stomps his way down the center of the room, right toward them. His husband follows behind him at a more leisurely pace, in a full red suit no less. Kirishima grabs Kaminari to hug him and fist bumps Sero as he passes with a brilliant grin. Bakugou doesn't say hello to anyone until he reaches Todoroki and Izuku, where he stops in front of them, sizing them up.\n\"Yo,\" Todoroki says.\n\"Half-and-half,\" Bakugou barks in return. His distinctive glare is absolutely terrifying up close.\nWithout so much as another word between them, the two top pros go from a stare down to grinning at each other like old friends—which, of course, they are.\n\"The fuck is wrong with you?\" Bakugou asks, like he's asking Todoroki how he's been doing. \"Trying to get yourself killed abroad without a word to any of us, you damn lunatic…\"\n\"You're right, I should've run it by you first,\" Todoroki says.\n\"Todoroki!\" Kirishima yells, draping an arm around Todoroki's neck. \"New rule—you gotta at least be in Japan if you're gonna wind up in the hospital. Don't scare us like that!\"\n\"I wasn't scared,\" Bakugou says. \"He's fine, look at him.\"\n\"I was fine,\" Todoroki confirms, as he accepts another beer from Kirishima.\nBakugou and Todoroki have one of the most famous public pro rivalries, stemming from their time at Yuuei as two of its strongest students since they both set foot on campus. Their similar attitude problems in the early days only served to cement them as two peas in a pod, regardless of the fact that they tended to be at each others' throats. Though they evened out into something resembling friendship over the years, the undercurrent of competitiveness is never far below the surface with the two of them.\n\"Hang on a sec,\" Bakugou says, squinting at Izuku, \"you're the little shit that did that impression of me, aren't you?\"\nOh, crap, Izuku had practically forgotten about that. \"I… might've done that… yeah,\" he says. \"It  was on request, though.\"\nBakugou stares at him a moment longer, and Izuku feels himself breaking out into a nervous sweat. Then the explosion hero throws his head back and laughs uproariously.\n\"That was pretty good, kid!\" he cackles, jamming a heavy hand down on Izuku's head to ruffle his hair like a pleased older brother. So much for all the hard work of Izuku's hairstylists.\nIzuku puts a hand over his racing heart. \"Oh, thank god—wait, you're not mad?\"\n\"Nah,\" Bakugou says, \"a true fan should damn well know my catchphrase!\"\n\"Since when is your catchphrase 'die, scum'?\" Todoroki asks.\n\"That's not my catchphrase,\" Bakugou says, frowning.\n\"His catchphrase is just 'die,' actually!\" Izuku pipes up.\nTodoroki stares dully into the distance. \"I shouldn't be surprised by this, and yet.\"\nBakugou scoffs. \"Quit actin' all high and mighty, you're just as dramatic.\"\nIzuku can't quite stifle the giggle that escapes him, causing Todoroki to fake-glare at him instead. \"Sorry!\"\n\"Don't apologize to this asshole!\" Bakugou snaps sharply. \"You know he's way more trouble than me, right? He tell you about the time he told the chief of police to go fuck himself?\"\n \"What?\" Izuku gasps.\n\"In language  somewhat less uncouth than Bakugou-kun's interpretation,\" Iida interjects from nearby, where he is eavesdropping, \"but I can confirm this is true.\"\n\"There was—a slight misunderstanding,\" Todoroki says.\n\"You tried to fight him!\" Bakugou wheezes.\nBakugou is unsurprisingly very eager to tell embarrassing stories about Todoroki. It turns out he's heard more about Izuku than he lets on at first, eventually revealing that he knows Izuku went to his old middle school, which leads to the two of them discussing their shared hometown. He's also about as demanding as can be expected, and keeps insisting Izuku show him and Kirishima more hero impressions, which cracks them both up every time (although Bakugou insists that Izuku's impression of him is hands down the best one).\nIt's only when Bakugou asks to see his pro hero Shouto impersonation that Izuku realizes Todoroki is actually not standing next to him anymore. He looks around, confused, before finally spotting Todoroki sitting on one of the huge sofas, slightly isolated from all the commotion.\n\"I promise I'll show you later!\" he tells Bakugou, who is becoming slightly belligerent in his now inebriated state.\nKirishima ushers him away laughingly, as Izuku makes his way over to where Todoroki is sitting, with his head tilted back, eyes closed. He's undone the top button of his suit shirt, and his collarbones and the smooth column of his throat are exposed. Izuku swallows.\n\"Hi,\" he says, and Todoroki opens his eyes to look at him. His gaze is a bit fuzzy, eyes lidded, and Izuku fights back a smile.  Tipsy. \n\"Ah—I wanted to sit down for a bit and it looked like you were… fine.\" Todoroki's shoulders rise and fall in a shrug.\n\"Yeah, that was… I can't believe I got to talk to him for so long!\" Izuku says giddily. He really can't believe it; not just because Ground Zero is another of his favorite heroes, but because he'd never imagined one of the most intimidating pros would even care to talk to him for more than a few seconds at a time, let alone be interested in an actual conversation.\n\"He's really not as bad as everyone thinks,\" Todoroki says. \"Well, not anymore, anyway. He's another favorite of yours, right?\" Izuku nods emphatically, and Todoroki gets a funny look, like he wants to frown and knows he shouldn't.\nIzuku tilts his head, confused at first, as Todoroki glances away and takes another sip of his beer. \"Is everything okay…\"\n\"I'm not in danger of slipping to third place on your list, am I?\" Todoroki asks, blinking up at him.\nThird place on his… wait,  oh my god, is Todoroki actually…\n\"You won't!\" Izuku says. \"Of course you aren't! Todoroki-san, you're not—o-or,  are you—\"\nDrunk? Definitely at least halfway there.\nBut  jealous? \nIzuku doesn't think he can actually voice that aloud. The reality of a world in which Todoroki could be jealous of someone else getting Izuku's attention seems so far off that he can't bring himself to imagine it. But…\n\"Sorry,\" Todoroki says abruptly. \"God, that was a really—never mind, I don't know why I—\"\n\"Want some company while you're over here?\" Izuku blurts out. Todoroki's face is considerably redder than before. Is that still just from the alcohol?\n\"Yeah,\" Todoroki says. \"Please.\"\nIzuku smiles. He wonders if he should try to see if Todoroki wants to hold his hand here, too, and if that would make him feel better (if there's even  something going on at all). Or maybe there's too many of his eagle-eyed friends watching?\nIzuku is pondering this so intently that he doesn't notice there's a tipped over bottle on the floor next to the couch until he steps on it and his feet fly out from under him.\n\"Izuku!\"\nHe's saved, once again, from an embarrassing fate by Todoroki's reflexes. The pro hero grabs him before he can tumble over backwards to the floor, or crack his head on the coffee table. Before Izuku knows what's happening, he finds himself being hauled into Todoroki's lap, one strong arm wrapped firmly around his body, his back pressed to Todoroki's chest. For a second, he doesn't dare speak.\n\"That's… the second time today,\" Todoroki remarks. Izuku can feel the warmth of his breath against his ear. He can't help it; he shivers.\n\"S-sorry,\" he whispers. \"Thanks.\" He doesn't think they've ever been this close before, not even when this same thing had happened on the plane… god, Todoroki is going to think he's doing this on purpose. He hadn't been holding Izuku quite so firmly then, and Izuku starts to scoot off his lap, face burning in shame—but Todoroki's arm around his waist tightens.\n\"Maybe you should stay here,\" he says, barely a whisper, like he's not sure he should be saying it. Izuku's breath catches in his throat. \"If you want. It… might be safer.\"\nIzuku closes his eyes. This is likely the closest he will ever get to heaven and he's not ready to leave just yet.\nAnd so, even though it's horrible of him, because Todoroki has obviously had a bit too much to drink, and probably currently doesn't have the best judgment, Izuku says, \"Okay. I will.\"\nHe feels, rather than sees, Todoroki nod. \"If you… wanted to go talk to other people, though, that's fine. I wouldn't be—I mean, I'm not—\"\n\"I'd like to stay with you,\" Izuku tells him.\nAnother nod. \"Okay.\"\n\"With my second favorite hero.\"\nHe feels the huff of Todoroki's laugh flutter against the back of his neck. Izuku's chest is tight from how inflated his heart has become.\n\"All Might did say that could change,\" Todoroki reminds him.\nIzuku has to grin at this. \"You're welcome to try, Todoroki-san.\"\nSo quietly, Izuku almost doesn't hear him, Todoroki murmurs, \"Maybe I have been trying.\"\nIzuku doesn't get a chance to respond—they are waylaid by more of Todoroki's friends shortly thereafter, and Izuku scrambles off his lap to save him any unnecessary embarrassment (almost—they didn't see Hagakure coming, and she tells everyone how they were sitting before more people showed up). He still spends the rest of the party sitting pressed up against Todoroki's side, with Todoroki's arm draped over the back of the couch behind him. Todoroki doesn't seem to be the least bit bothered with subtlety, and Izuku is left to replay his words over and over in his head.\nAll Might himself has already called him a hero that night; maybe there are other impossible things that might not be as far out of reach as he thought.\nThe after party doesn't wind down until late; it's nearly three in the morning when they finally get back to their hotel. Izuku is exhausted, worn out from excitement and more interaction over the course of one evening than he's probably ever had before in his life, all with a group of people so much larger than life they're literally on billboards all across his city. He's grown up hoping to get so much as an autograph from any of them; tonight, he got phone numbers. And more than that, he got to know them, a little bit. The old saying warns against meeting your heroes, but he's more than glad that he did.\nHe walks down the hallway of the hotel side by side with Todoroki, footsteps swallowed up by the plush carpet beneath their feet. Todoroki is quiet next to him, and Izuku feels overly aware of how close they're standing, their hands by their sides almost touching, but not quite.\n\"Todoroki-san,\" he says, \"did you enjoy yourself tonight?\"\n\"Me?\" Todoroki glances at him. \"Shouldn't I be the one asking you that?\"\n\"Hmmm, I feel like maybe the pressure is more on you,\" Izuku says. \"We both knew I'd have fun.\"\n\"Does that mean you did, then?\"\n\"Yes!\" Izuku says. \"Of course. This was amazing.\"\nTodoroki looks pleased. \"Good.\"\n\"That doesn't answer  my question, though,\" Izuku wheedles.\nTodoroki doesn't respond for a few seconds. Finally, he says, \"I wasn't sure if I should invite you to the gala, or not.\"\nThe admission comes as suddenly as a slap. \"Oh—\" Izuku says, the happy bubble in his chest deflating. He trips over his next words as old doubts surge back in. \"Oh, I hope—I hope you didn't feel like you had to—or like you were p-pressured in any way, or—\"\n\"No, I've just never asked  anyone to an event before,\" Todoroki explains. \"I wasn't sure what you'd think. Honestly, I wasn't really sure what I was thinking, either. I just wanted…\"\nThey've reached the door to Izuku's room, and Todoroki trails off as they stop in front of it.\n\"Wanted what?\" Izuku asks. His throat is tight. He's not sure what to feel. Everything had seemed like it was going so great—too good to be true. Had Todoroki just been humoring him, all this time?\nHad he just felt bad for Izuku?\nTodoroki pauses. He rests his fist on the wall and then thumps it a few times, seemingly for good measure, before looking up at Izuku again. The cloudiness has disappeared from his expression; any lingering effects from the alcohol appear to have worn off.\n\"I just wanted to be around you, more,\" he says. \"First the interview, then at the agency, then just—talking to you over the phone, every time—I just didn't want any of them to be the last time.\"\n\n What? \n\n\"…Oh,\" Izuku whispers.\n\"I knew inviting you to this would be a lot,\" Todoroki confesses. \"I didn't know if it was too much, or what would happen after. You already said it's been the best night of your life, so I know I can't really… I can't top this.\"\n\"Wait,\" Izuku says, \"was the gala… to try and impress me?\"\n\"No!\" Todoroki says. He sighs, running a hand over his face. \"Fuck, I'm bad at this—I don't  know  what else to offer beyond this. You like hero stuff and this is… this was a  lot of hero stuff.\"\n\"Todoroki-san!\" Izuku says, shocked. \"You know I don't just like you because you're a pro, right?\"\n\"That's  the entire reason you like me, actually!\" Todoroki points out, sounding very stressed.\n\"It is  not,\"  Izuku says. \"I  know  about you because you're a hero. I  like you because of—everything else about you! What, did you think I was just going to lose interest once we ran out of 'hero stuff' to do?\" He stares Todoroki down, daring him to argue.\n\"No!\" Todoroki says hurriedly. \"I know you're not like that. You don't… you don't expect anything, but you  should! You deserve this much—\"\nIzuku hides his face in the crook of his elbow. \"You're being ridiculous—\"\n\"What's ridiculous is that you think I'm amazing,\" Todoroki says, \"but I can't even—I've been trying to tell you, to make you realize, that I—goddamn it.” He runs a hand through his carefully styled hair in frustration, mussing it up hopelessly as Izuku watches, stunned. “I want to do all of this for you, but I can't even come up with something better than an agency tour and a free ticket I never would've even used otherwise to some party—\"\n\"Todoroki!\" Izuku yelps, cutting him off very rudely, but Izuku doesn't care at the moment. \"Just tell me… did you enjoy tonight, or not?\"\n \"Yes,\" Todoroki says.\n\"So did I,\" Izuku tells him (again). \"I mean, yes, tonight was the best night of my life, how could it not be? But not just because of all the hero stuff. It's mainly because I had a lot of fun with you. And if you somehow think that's not good enough for me, you are an idiot.\" \nTodoroki's eyes are very wide. \"Yeah?\"\n\"Yeah,\" Izuku says. \"I like you a lot, Todoroki-san.\"\n\"Okay,\" Todoroki says. \"I just—right, okay.\"\n I like you a lot is the biggest understatement ever made, perhaps an outright lie at this point. Izuku's heart is so full of fondness (and maybe something more that he keeps dodging, because it doesn't yet feel like it can be real) that it's threatening to hammer out of his chest. He has to do something about it, or it's going to explode, messy and rose-colored, all over the immaculate hotel hallway.\nHe leans up onto his tiptoes—but he's still not quite tall enough, so he has to grab the lapels of Todoroki's jacket and tug him down a few inches. Briefly, trying not to think too much about it, he presses his mouth against Todoroki's in the quickest, softest kiss. It's the first one he's ever given anyone.\n\"Goodnight, Todoroki-san,\" he whispers. \"Thank you again for everything.\"\nRapidly, he lets himself into his room, bowing to Todoroki's feet (Izuku doesn't dare look at his face) as he closes the door behind him. He leans back against it and stares up at the ceiling, and then squeezes his eyes shut.\nHe did that, he just  did that, what did he just do? \n\n Knockknockknock. \n\nThe sound makes him leap away from the door. Oh,  no. He stares at the glossy wood until the knock comes again, light and frantic, and it seems like he has no choice but to face fate.\nWith a trembling hand, he reaches out and opens the door again, eyes still downcast.\n\"I'm sor—\"\nThat's all he gets out. The door is flung wide open, Todoroki takes one step forward, and then two big hands are cupping Izuku's cheeks to tilt his face up, warm lips are finding his, and Todoroki is kissing him, kissing him in  earnest, body pressed flush up against Izuku's own.\n\n \"Izuku—\" \n\nThe way he says Izuku's name against his lips is all kinds of  ruined—and the sound of it makes Izuku sob, a wordless gasp of pent-up longing and adoration all flooding out of him at once; and he's shaking, and his legs don't seem to be able to support him, and he's flinging his arms as tight as he can around Todoroki's neck as his hero in all things picks him up and carries him into the moonlit room beyond, kicking the door shut behind them so they can finally have each other.\nIzuku can't stifle the breathy gasp that punches from his lungs as Todoroki pushes him up against the wall just inside the room. He carries Izuku like it's nothing, holds him effortlessly in place. Todoroki's hands are  on his ass—Izuku would have already expired over this, if he wasn't so preoccupied with everything else.\n\"To—Todoroki-san—nnnh—!\" \nThe noises he's making are shameful, but he can't help himself; not when Todoroki is kissing him again with all the desperation that Izuku is feeling. Izuku is by no means a good kisser—he has no idea what he's doing, only that he can't stop doing it, mouth falling open on another sigh as Todoroki's tongue swipes his lower lip gently. Todoroki exhales, shaky, and slips his tongue inside Izuku's mouth; and the room spins with how fast Izuku gets lightheaded as all the blood in his body rushes south.\nHe tightens his legs around Todoroki's solid waist, knees gripping hard even though he's in no danger of falling. He doesn't want to let go; not now, not ever. He fists one hand in the back of Todoroki's suit jacket, pushes the other into his hair, and nearly cries. It's smoother than satin, softer than he's ever even imagined.\nIt's impossibly good. He's never kissed anyone, but he thinks that even if he'd kissed a thousand people before now, it probably wouldn't have been like this. Yes, admittedly, he's always had a vivid and active imagination, but it's never come close to the real thing. It's all so slow, and so wet, and  warm—there's a strange heat building, almost  in him, starting at the back of his throat. Someone else's tongue in his mouth seems like it should be weird, but when Todoroki's tangles with his own, Izuku starts shaking.\nTodoroki shifts against him like he's trying to get even closer, somehow. With the way he has Izuku pinned, that's  definitely  too much—but it's also  perfect, and Izuku lets out a frantic, shaky moan as Todoroki's hips press into his.\nThat heat he keeps swallowing flares hotter, too fast, and then Todoroki jerks away from him suddenly. Izuku pinches his lips together, but a thin whimper of protest still escapes him. His hands move like they don't belong to him anymore—he tugs at Todoroki uselessly, trying to bring him back, he needs Todoroki closer,  needs him. \nTodoroki is panting, maybe even harder than Izuku. He turns his head, slightly, exhales; steam billows from his mouth out into the room and Izuku realizes—he wasn't imagining the heat.\n\"One second,\" Todoroki says, strained.\n\"Todoroki-san?\" Izuku can't help but feel nervous over every little thing. Did he do something wrong? He realizes he's still clutching at Todoroki's jacket and forces himself to loosen his grip.\n\"I can't—\" Todoroki starts, voice uneven. He clears his throat and then looks back at Izuku. Their foreheads are nearly touching and Izuku feels trapped by his stare—he's suddenly so much closer than ever before. Even in the moonlight, or maybe because of it, his eyes are gorgeous. \"I'm having… trouble regulating.\"\n\"Regulating…?\"\n\"My internal temperature,\" Todoroki explains. \"I don't—didn't want to burn your tongue.\"\n\"Oh!\" Izuku blinks, and then understands. \"O-oh? Is that—that's a thing that happens? When you're…\"\n\"When I'm aroused,\" Todoroki states point blank.\n\"Oh my gosh,\" Izuku whispers.\nNow Todoroki looks nearly as embarrassed as him. \"I should have asked if you're okay with this.\"\n\"Y-yes!\" Izuku yelps. \"Are… are you?\"\n\"You're kidding, right?\" Todoroki asks. When Izuku shakes his head, he frowns. \"Why wouldn't I be?\"\n\"Ah, w-well,\" Izuku stammers, \"I'm the one who k—kissed you! Out of nowhere. And I, um, I don't want you to feel like… I mean, I know I'm just…\" He trails off into nothing. It had been hard to look away from Todoroki before, and now Izuku can't meet his eyes.\nThat's when Todoroki sets him back down to stand on his own. It's gentle, but Izuku's heart sinks as he's lowered. When his feet finally hit the floor, it grounds him.\nRight. Well—he's just glad he said something early, before they got swept up in the moment and Todoroki did something he would regret later. He's just himself, after all; plain, quirkless, Midoriya Izuku. The telltale burning starts at the corner of his eyes, and he blinks rapidly, knowing once it starts it'll never stop. \n\"Todoroki—\"\n\"I'm glad you're braver than I am,\" Todoroki says, cutting him off. \"Because I've been trying for days to figure out how to kiss you tonight.\"\nIzuku looks up at him so fast, teardrops go flying. Todoroki shakes his head, whispering Izuku's name so fondly that it makes his knees wobbly again. He closes his eyes as Todoroki raises a hand to sweep the tears away with his fingers.\n\"What?\" Izuku asks croakily.\n\"I've wanted to kiss you,\" Todoroki tells him, \"for a long time. I want to kiss you again, right now. Can I?\"  \nIzuku tries in vain to swallow the lump in his throat. \"Y-yeah—\"\nTodoroki doesn't give him a chance to second guess. He surges forward, and Izuku can only cling to him, arms flung as best he can across Todoroki's broad back in an effort to stay upright. It's making him dizzy all over again, Todoroki licking his way into his mouth—it feels a little filthier, like Todoroki is holding back less, and Izuku never wants it to stop. He breathes Todoroki in and kisses back, and the heat starts to swell, but he's too afraid to say anything that would make Todoroki stop.\nBut Todoroki at least knows himself, and as soon as it reaches a peak that's almost sharp against Izuku's tongue, he pulls away. Izuku wants to whine but he stays quiet; and he's rewarded the next moment, when Todoroki kisses him just below his ear instead, lips a firebrand whisper on his skin.\nIt's like heaven, as Todoroki moves his mouth over his jaw, down his neck. And then there's the sudden sharp pressure of teeth, shocking and raw, before the slick wet of Todoroki's tongue soothes over the bite, and Izuku can't think anymore.\n\n \"Ah—mmh—\" \n\nThis can't be happening—something like this could never really happen to him, can it? There's no way Todoroki could want—\n\"Want what?\" Todoroki asks, and Izuku realizes he's actually been babbling out loud.\nHe gasps, as Todoroki's breath steams over his throat, leaving him literally hot under the collar,  boiling. The jacket and vest, the layers, are all becoming restrictive.\n\"What couldn't I want?\" Todoroki asks insistently.\n\"Me,\" Izuku whispers.\nTodoroki touches his fingers to the top button of Izuku's shirt. His stare is determined. \"I'll convince you.\"\nIzuku nods deliriously. \"Please.\"\nHe tilts his head back when Todoroki slips the top button undone. As he bares Izuku's throat one button at a time, his lips follow, tracing every newly revealed inch of skin with painstaking attentiveness. Izuku melts under his mouth and hands, barely able to do more than choke down the whines that keep bubbling up in his throat. Todoroki is moving so slowly, hands sliding lower and lower down Izuku's front as he undoes his vest buttons and pushes it open. Izuku wants Todoroki to convince him  faster. \nHe lets go of Todoroki for the first time since they started, hands flying to his shirt to rapidly unfasten the rest of his buttons. Todoroki's eyes widen, watching as Izuku clumsily tries to loosen the knot of his tie.\n\"S-sorry—\" Izuku mutters, wishing he'd just been patient, because now his fingers are stuck and he looks ridiculous. \"I'm bad with—knots—\"\n\"Shit,\" Todoroki rasps, and then Izuku smells something  burning,  and looks up to see Todoroki shrugging off his jacket as fast as possible. \"Shit,  shit—\" \n\"Y-your sleeve!\" Izuku squeaks, which is unnecessary, because it seems like Todoroki is all too aware that his shirt is literally going up in flames before their eyes. \"Todoroki!\"\nTodoroki strips out of his clothes so fast that Izuku barely has time to register what's happening. His vest goes flying, and he doesn't bother with more than the top few buttons of his shirt before yanking it over his head as the left sleeve smolders red-orange, not quite on fire yet but close. Todoroki stamps it out with his foot.\n\"Uh…\" he says, rubbing the back of his neck sheepishly. The movement makes the muscles of his bare chest shift and flex and Izuku's mouth goes dry as he stares.\nThese are the abs he's dreamed about for years; the chest that fueled all his hormonal fantasies since he knew what hormones  were.  Todoroki's muscles are even hotter up close. Maybe slightly less defined or sculpted in person than they would be in a photoshoot, thanks to makeup or touched up photos, but Izuku likes that. In reality, Todoroki is strong and toned and  big, all over. He's perfect.\nUnthinkingly, Izuku reaches out to touch him.\n\"Ah!\" He yanks his hand back in surprise. Todoroki's left side is  radiating heat. Even though it's not quite hot enough to burn, it's enough to startle him, like getting too close to a lit stove.\n\"Izuku!\" Todoroki grabs his wrist with his cooler right hand and Izuku hazily registers the fact that the pro hero seems to use his first name by default now when he's worried. \"That's exactly what I was trying to avoid.\"\n\"I'm fine!\" Izuku reassures him. He can feel the scorching heat fading, as Todoroki regains some control of himself. Whether that's because he's focusing harder on getting it in check, or because his tongue is no longer down Izuku's throat is unclear.\n\"Fuck,\" Todoroki murmurs, holding Izuku's fingers up to inspect them. \"I swear I'm pretty good at controlling my quirk usually.\"\n\"Um, yeah, I've seen you do it plenty of times.\" Izuku can't stop himself giggling anyway, giddy laughter spilling out. He's not laughing  at  Todoroki, really. He's just unable to process that Todoroki nearly burned through a designer suit because of  him. \n\"Sorry,\" Todoroki says, right before he sticks Izuku's fingers in his mouth, and Izuku's brain short circuits.\n \"Buh?\"  is all he manages. Todoroki's breath, now chilled and icy, cools the lingering sting in his fingers. His eyes go half-lidded, red and white lashes lowering, his cheeks hollowing out as he sucks, and then—\nTodoroki holds Izuku's fingers up to his lips and licks between them, tongue deliciously cold, sending shivers racing up Izuku's spine. He laves his tongue between the middle and forefinger, slicking them up in a manner that is far more suggestive than a mere first aid application.\n\"Oh my  god, Todoroki-san—\"\nOverwhelmed, he lets his head fall back as Todoroki pins his wrists to the wall on either side of his head and kisses him again. His body is just pleasantly warm, now, but his mouth is cold in contrast. Izuku groans as one of Todoroki's thighs slips between his legs, making him spread them apart wider. This time, Izuku doesn't stop himself from rocking against him, and Todoroki doesn't go still or pull away.\nIf this had been just ten minutes ago, Izuku thinks he would have been too embarrassed to ever do what he's doing now; but it's almost like his body is making up for his nerves at this point, and he needs Todoroki, and he can't stop until he gets what he wants. He's embarrassingly hard already considering they've barely done anything yet, but Todoroki is letting him grind against his leg, pressing back to allow Izuku the friction he needs.\nHe slides his hand down to grip Izuku's ass, pulling him in more firmly, and Izuku realizes he's in trouble.\n\"W-wait—Todoroki-san, I'm going to—gonna—\"\nIt's a close call. Todoroki freezes up immediately as Izuku grips his shoulders, teeth gritted, toes curling in his shoes. Todoroki letting him grind against his leg, helping him chase his pleasure, goes straight to his head as well as his—his dick, which is so hard that it hurts. Just the  thought that Todoroki wants to touch him, wants to make him feel good like this, is enough to shove Izuku towards an early orgasm.\n\"We have to—go a little slower,\" he manages to gasp. \"Or else I'll—or I'm going to…\" It's too humiliating to say.\nHe can't be finished yet, not when they've hardly done  anything  and Todoroki has barely touched him (and  he's barely gotten the chance to touch Todoroki). Besides being embarrassing, he doesn't want this to end, not that fast.\n\"Okay,\" Todoroki says immediately. \"We don't have to do anything you don't want. I could just kiss you all night, and that would be more than enough…\"\nIzuku shivers again, full body. That  does sound very nice, but it's not what he wants right now. \"No, it's not that. I want to k-keep going. I just have to—w-well, when you touch me, I think it makes everything happen too fast…\"\nTodoroki doesn't laugh at him. He nods, and seems to be mulling it over. Finally he says, \"I might have an idea. Can we…\"\nHe glances toward the bed, and Izuku blushes, nodding too quickly. He feels like bringing that into the equation can only make his problem more pronounced, but, well…\nHe feels like he's walking in a dream when Todoroki takes his hand and leads him further into the room. \n\"What now?\" Izuku asks hesitantly, once he's sitting on the bed, back against the headboard, legs stretched out awkwardly in front of him.\n\"I thought—if I don't touch you directly, maybe it'll be fine?\" Todoroki ventures. He's sitting on the edge of the bed, like he doesn't want to overwhelm Izuku again by coming too close. Which isn't what Izuku wants, it's just that he's hopeless.\n\"You weren't, um… you weren't. Touching me directly before,\" Izuku reminds him.\n\"I mean, at all,\" Todoroki says. \"I'm not going to do anything—you touch yourself.\"\nIzuku's mouth falls open. \"Wh-what? Wait, but then—what will  you do?\"\nTodoroki swallows. \"I'll watch.\"\n\"Oh!\" Izuku squeaks. He covers his face as his cheeks start to burn. \"You—w-want to watch me—\"\n\"Unless you don't want that,\" Todoroki says instantly. \"I can just—I'll—\"\n\"No, it's okay!\" Izuku yelps, surprising himself. Let Todoroki  watch  him? The idea in itself is terrible; Izuku can only guess at the kinds of ridiculous, stupid faces he makes when he's masturbating, and he is fairly sure he doesn't want Todoroki to see a single one of them. But if Todoroki can't touch him or watch him, then what else  is there?\nSlowly, he undoes the fastening of his slacks, pushes them off his legs. He spares a brief prayer of thanks that he did not wear his All Might boxers for luck tonight—or worse, the half-and-half Shouto briefs. The pair he has on are just dark green, and obviously tented at the front, and he quickly covers the evidence with both hands in embarrassment. Todoroki is going to think he's  useless for getting excited this easily, he'll think Izuku is gross—\nTodoroki ducks down and kisses his wobbly mouth again. \"You're okay,\" he breathes, and Izuku breathes with him, deep and slow. \"It's really okay if you don't want me to look, either. What if…\"\nIzuku watches, first in confusion, then understanding, as Todoroki reaches out to loosen his tangled tie carefully. Somehow the knot that had seemed so impossible for Izuku to undo falls away easily under Todoroki's fingertips, until he can slide the tie from around Izuku's neck, holding the dark green silk in his hands.\n\"Will you tie it for me?\" he asks Izuku.\nIzuku bites his lip nervously, and can't help but notice how instantly Todoroki's gaze is drawn downwards to his mouth. \"Are you… sure…\"\nTodoroki seems to give in, then. He leans in and brushes his lips over Izuku's. \"I trust you.\"\n God.  Izuku shivers, as he feels the tie being pressed into his hand, wraps his fingers around it.\nTodoroki pulls back just enough to let Izuku shakily place the soft silk over his eyes, knotting it behind his head to secure it in place.\n\"Okay… there,\" Izuku says nervously.\nTodoroki stretches out a hand, patting around blindly until he finds Izuku's. He curls their fingers around each other, which is familiar, now, after all the hand holding at the gala. It relaxes Izuku—knowing that Todoroki is fine with this, and still wants to touch him, regardless of how weird it is that Izuku basically can't even handle him keeping his eyes open during sex. God, he thinks again, Todoroki could have  anyone,  but he's settling for  this? \nTodoroki slowly leans forward, until he can bump his face against Izuku's. He tries to kiss Izuku again, not seeming to care that he can't quite find Izuku's mouth on his first try, which makes Izuku have to stifle a sudden fit of giggles. Well, at least that means the blindfold is on properly, he thinks, out of his mind with nerves and desire as he helps meet Todoroki's mouth to kiss him back. It's so deliberately sweet that it makes Izuku melt.\n\"It's not too tight, is it?\" he murmurs, in between tentative explorations of Todoroki's lips.\n\"It's fine.\"\n\"You really… don't have to do this for me…\" \nHe feels it's unfair somehow, that he gets to have everything, see everything, while Todoroki isn't allowed to touch and now can't even look. Not that Izuku thinks he's all that much for Todoroki to look at, but it's the principle of the matter. It's unequal.\nTodoroki brings a hand up and brushes his fingers over Izuku's face, quiet at first. He still seems to be figuring out where things are, before he presses his fingers to Izuku's lips, tracing his mouth. His thumb drags there, the only barrier between them. It's more effective than his quirk, makes Izuku's lips feel achingly oversensitive when Todoroki puts his mouth right up against his thumb so his words buzz and vibrate against Izuku's skin. It's like fire roaring through Izuku's veins when Todoroki speaks, hoarse and longing and undeniably  desperate  for it.\n\"I really think I'd do  anything  for you.\"\nA soft moan leaks from Izuku's lips, but it doesn't get far before Todoroki swallows it, mouth sealing over Izuku's, drinking down every little noise he makes. The kisses are clumsier now, wetter and messier, because Todoroki can't see what he's doing and Izuku is too far gone to do anything but let himself be overwhelmed with affection. Todoroki's hair is fully a mess, now, and he looks so good with it falling down over the dark strip of cloth covering his eyes.\nHe's at Izuku's mercy, blind and wrapped up and waiting. It makes Izuku's breath shaky, whiny, to know that Todoroki insisted on exactly this.\n\"N-no peeking,\" he whispers into Todoroki's mouth, and Todoroki groans like he's said something especially sexy. Which Izuku doesn't think that he has, but—but  wow, it's incredible, feeling needed like this.\n\"Swear I won't—\" Todoroki mumbles distractedly, nipping at Izuku's lips. \"Do you want to—you can touch yourself, now…\"\n \"Oh—\"  Izuku hiccups. It's more out of necessity than anything else at that point that makes him go for it. He presses a hand down against the damp front of his underwear unthinkingly, hips riding up—fuck. His breath stutters in his throat, eyes slipping shut.\n\"Izuku,\" Todoroki murmurs, and Izuku pants at it, the sound of his name, said with that intent. He grinds his palm down against the front of his briefs again and groans. \"You sound so good.\"\n\"Ah—n-no, I—\"\n\"No, I mean it,\" Todoroki says.\nHis lips are so distracting, the way he brushes them across Izuku's cheek until he finds the spot just below Izuku's ear. Izuku can't stop the breathless gasps that spill from him as Todoroki sucks on the skin there. In fact, he's so distracted that he can't respond in any way to Todoroki; he can only stroke a hand over himself clumsily through his underwear while Todoroki murmurs praise into his skin, warm and determined.\n\"Your voice is really—it's  cute,\" Todoroki whispers, and Izuku whines in embarrassment (and maybe relief, a little bit—Todoroki has had to listen to him a lot, lately). \"I'm glad I can finally tell you.\"\n\"Have you b-been  waiting  to tell me?\" Izuku asks, incredulous. That seems impossible. Not just that his voice is  cute to Todoroki, but that Todoroki likes it enough that he's contemplated the need to make that fact known.\n\"I know it's weird,\" Todoroki confesses. He noses his way under Izuku's jaw, mouth hot under Izuku's chin—kissing anywhere, everywhere he can reach, it feels like. Izuku's pulse hammers so hard it almost hurts; is that his  heart?  Is that even  safe,  how fast it's beating? \"I thought… you might realize—\"\n\"H-how would I have—\"\n\"I always called you,\" Todoroki says softly. \"Instead of texting.\"\n\"Oh…\" Izuku says, equally soft. He chances a glance down at Todoroki, and—oh, no, he thinks he can see a faint hint of red spreading across his cheeks. He seems to sense Izuku is looking, head lifting to blindly turn towards him. \"You… you really think that…?\"\n\"Yeah,\" Todoroki breathes. \"I like listening to you.\"\nIzuku's breath hitches in shock. \"U-um—\"\n\"Not like—\" Todoroki rushes to say, \"not in a weird way! Though… after this, I think I'm probably screwed.\"\n\"Oh, god,\" Izuku says, and hiccups a laugh. \"I was already—that time you called me during a workout, I—th-thought about it a  lot after—\"\n\"Fuck,\" Todoroki mutters, leaning closer again,  \"definitely screwed, now—\"\nEven when he kisses Izuku senseless, he stays true to his word, utterly careful—he doesn't touch, hands braced on either side of Izuku's body, and the blindfold stays firmly on. It makes it even worse somehow, this cursory degree of separation between them, makes Izuku squirm and pant, desperate to feel more of Todoroki's lips and tongue.\n \"Fu—haah—\" Izuku keens. \"To-Todoroki-san—\"\n\"You can use my first name,\" Todoroki tells him, like he always does.\n\"I kn-know—\" Izuku says, \"I'm just used to—it's too much to—\"\n\"It's okay,\" Todoroki tells him. He moves away, though, and Izuku worries briefly that he's getting frustrated, before he realizes where Todoroki is going.  \nIzuku's eyes fly open wide as Todoroki slides lower on the bed, ducks his head so his lips land like a whisper brushing against Izuku's stomach. \"To—Todo—\"\nHe cuts off as Todoroki presses a barely there kiss to the V of his hips next. He trails his mouth low across Izuku's stomach, so soft each kiss barely lands, and Izuku throws his head back so fast it bangs on the headboard. He's moaning; just seeing Todoroki down there, voluntarily sightless and so close to him, is so  much  to deal with. He grips his cock through his briefs, loosely fisting it through the fabric.\n\"Izuku,\" Todoroki says again, lips touching just above the waistband of his underwear, words tattooing into his skin. \"Don't ever think you're not worth wanting. Please.\"\n\"I—I'm—\"\nTodoroki kisses one of his hipbones gently. \"I want—I want to watch you, too… \"\nIzuku tells his nerves to take a hike. He hooks his fingers in his briefs and shoves them down, and his dick springs free, right in front of Todoroki's nose. Before he can overthink anything, he reaches out, shaking fingers fumbling with the blindfold over Todoroki's eyes, before he gives up on the knot and drags the tie off Todoroki's head, leaving his hair a disaster in its wake.\n\"Y-you can look,\" he says, all in one terrifyingly brave exhale.\nTodoroki's wide eyes blink in surprise—they focus quickly and clearly on the back and forth pendulum swaying of Izuku's dick. He swallows.\n\"Can I touch you?\"\nIzuku whimpers. \"Y-yes.\"\nTodoroki stays cautious, slow. He kisses the bare tops of Izuku's legs, before nudging them farther apart so he can put his mouth to the insides of Izuku's thighs. His lips scorch Izuku everywhere they touch, making him gasp, helpless soft cries of pleasure.\nHe doesn't even care that Todoroki can see everything, that his legs are open wide, that Todoroki is  between  them, kissing the ghost-pale freckled skin of his knees. Todoroki keeps his thighs spread with a hand on each, fingers splayed and squeezing like he can't get enough, can't have his fill of Izuku. He nips at Izuku with his teeth, drags his tongue over trembling thighs, tastes him. All the while he remains maddeningly  near—Izuku can feel steaming breath ghosting over his cock, reaches down to trail his fingers over himself and shudders violently, his whole body sweetly tormented by non-stop, uncontrollable shivering.\n\"Close?\" Todoroki mumbles into his thigh, and he nods, incoherent. \"Then—\"\nHe grabs Izuku's hips and drags him closer, and then Todoroki is diving down, lips parting to take Izuku's cock between them, surrounding him with wet heat. Izuku chokes out a sob that is nearly a scream.\n\n HOLY SHIT. \n\n\n \"Sh—Shouto!\"   \n\nHe's never felt anything like it, heat and  wet  and tight, almost painful in its intensity. He buries a hand in Todoroki's hair, he needs to hold onto  something  or he's going to slip away into a void of stars and sensation—and then Todoroki bobs his head up and down, gaze flicking up so their eyes lock, so Todoroki can watch him, just like he said he wanted to.\nIzuki comes instantly. He can't stop himself, can't even warn Todoroki beyond his leg jerking once, erratically, and his fingers scrabbling in Todoroki's silky hair. It's like lightning hitting him right between the eyes, the world flashes white and then dark a second later, like a negative image superimposed over his vision. The shivers racing up and down his spine now are white hot pleasure, sending fresh waves of tears rolling down his cheeks. He's moaning, he can feel the noises tearing from his throat, but he can't hear them.\nThe first thing he registers through the unending golden haze is a hand clutching his, and he blinks his eyes open once he realizes they're closed. Todoroki's face swims into view, his mouth open in shock, eyes wide. There's a splatter of white on his chin that he doesn't appear to realize is there.\n\"S-sorry,\" he says, \"I thought it was okay if you were about to come, are you—\"\n\"Shouto—\" Izuku gasps again, and Todoroki's eyes light up all warm and surprised, \"you have to touch yourself, too, I can't be the only one to just—\"\nHe ends up yanking at Todoroki's fitted black pants until Todoroki manages to kick them off haphazardly. The distractions are too numerous to do anything properly, as Izuku grabs at his face to kiss him again, not caring that it tastes a little bitter; as Todoroki rolls over on top of him, all warm bare skin and hard muscle making Izuku feel tiny as he's pressed into the mattress; as Todoroki pumps a hand over his own cock, rolling his hips down into Izuku at the same time, desperately. The friction is a little over the edge of overstimulation for Izuku, but he can't stop himself from wanting more, either. His first orgasm almost knocked him unconscious but a second is already building, buzzing up from his toes, making his legs quiver and the pool of lava low in his belly pull tight.\n\"C-can't believe I get to—touch you—\" Izuku babbles, trailing his fingers over Todoroki's face, his neck. He takes a deep breath and then goes for it, running his hands down Todoroki's chest—he cups one of Todoroki's firm pecs in each hand and squeezes, kneading the smooth muscle under his fingers. He feels like an absolute pervert—scratch that, he  is a pervert. Todoroki is laughing at him, though not meanly; breathless, almost soundless, in between each gasp of pleasure.\n\"I l-like it when you touch me,\" he tells Izuku. \"I don't—think anyone's ever enjoyed touching me this much, actually—\"\n\"Hey!\" Izuku protests, thoroughly chastised and enjoying it much more than he probably should. After one mind-blowing climax, he feels loopy and loose and lucid. He pushes at Todoroki's shoulder, and Todoroki goes over easily, flopping onto his back on the bed. The way Todoroki is looking up at him emboldens Izuku—parted lips, lidded eyes, hair a mussed tumult of mixed white and red.\nTodoroki likes him.\nHe pulls himself up, slides a leg over Todoroki's waist. Todoroki's hands settle on his hips as Izuku straddles him, and Izuku may as well be on top of the world, in this luxury penthouse, flushed and naked over the hips of one of the strongest heroes.  His hero.\n\"Of course I enjoy it the most,\" he says with a smile so sincere it hurts his cheeks. \"I'm your number one fan.\"\n\"You're more than that,\" Todoroki says, fingers squeezing his hips. \"Izuku, you're so much more—\"\nTodoroki throws his head back in the pillows as Izuku starts to grind down on him, their cocks sliding together on his belly, sticky with sweat and Izuku's cum. The coarse line of hair that trails down from there to his cock is… half red, half white, Izuku realizes. Fascinated, he scrapes his fingers through it, and feels Todoroki's stomach muscles jolt at his touch.\nHe leans forward, bracing his hands on Todoroki's shoulders so he can slide against him more easily. There's so much skin on skin his head is starting to fog up again, his eyes watering with how  much he's feeling. The way their bodies fit together, the sounds Todoroki is making for him, the way he looks as he lets Izuku bring him to the edge—it's all pure, unfiltered bliss.\n\"I want—to make you feel good,\" Izuku pants. For everything Todoroki has done for him, whether on purpose or unknowingly, Izuku wants to return it, double it, multiply it by infinity. \"Because you… you're—you're mine.\"\nTodoroki gasps, and Izuku thinks for a second he sees a tendril of flame spark from the left side of his face—but then Todoroki grabs his arms, pulling him down until Izuku is pressed against his chest. He buries a hand in Izuku's hair and swears into Izuku's ear, voice low and raspy and throbbing.\n\"Fu-fuck—Izuku—\" \nTodoroki comes messy and warm between them, and Izuku follows, clutching at his shoulders as he cries out unsteadily. Todoroki shakes under him, trembling, full-body shudders as his orgasm punches through him in wave after wave. Izuku's is a little softer, after the first, but not by much; it wrings him dry and boneless, and when he's done, all he can do is slump onto Todoroki unmoving. Everything is gross and sticky, and he doesn't give a damn.\nTodoroki's breathing starts to even out, ruffling into Izuku's hair, and Izuku shifts to nuzzle against his neck, completely sated. The pro hero turns to steal another kiss, long and lingering and soft.\n\"Did I convince you?\" Todoroki murmurs.\nIzuku smiles. \"Yeah.\"\nIt's strange, because a lot of things still seem like they came right out of a fairy-tale. Meeting Todoroki, becoming his friend, becoming something  more. The public attention and the luxury treatment fit for royalty and the gala. It's all so unbelievable that it feels like none of it could have really happened to Izuku.\nBut one thing Todoroki makes damn sure Izuku can't doubt are his feelings. Forget the sex; it's the way he kisses Izuku's soapy fingers in the shower as they wash up. It's the way he smiles with his eyes when he leans their foreheads together as he towels Izuku's hair mostly dry. It's the way he says Izuku's name when they're just talking, curled up in bed again with the covers over their heads. Any one of those would be enough to convince Izuku, now that he finally gets it.\nHe's not nobody. He's the guy who saved Todoroki Shouto, and the one who liked him from the start.\nAnd Shouto wants  him. \n*\nA morning entertainment channel plays on the hotel room television, but neither Izuku nor Todoroki are paying very much attention to it.\n\"Are you sure?\"\n\"Yes—Todoroki-san, if you keep asking I'm going to change my mind.\"\n\"Okay, okay. I just want to make sure you're comfortable…\"\n\"Well, it'll feel a  little weird, but I don't… mind. If it's you.\"\nA knock on the door announcing the arrival of room service makes Izuku startle, and look up from his phone.\n\"Accept my follow request,\" Todoroki tells him, hopping out of bed. He grabs one of the plush hotel robes to slip on, but not before Izuku gets another glance at the masterpiece that is his bare ass. Todoroki seems to have no qualms with wandering around the room entirely nude, but Izuku still feels shy.\nFortunately, Todoroki has loaned him one of his undershirts, which is so big on Izuku that he can practically swim in it. He's been rolling around in it all morning, in the bed that they've yet to vacate, because Todoroki is VIP enough to get away with checking out whenever he wants. They aren't flying back until that evening; afternoon plans include savoring some of the best food Hokkaido has to offer. Morning plans include savoring more of each other.\nThis has, however, resulted in Izuku's Twitter being brought up again, to his dismay. He would have gladly avoided the subject forever, but it's much harder to do when Todoroki asks him innocently if Izuku would consider adding him now, lying with his head pillowed on Izuku's stomach, his shoulders just  looking the way they do (which is to say, magnificent).\nIzuku had capitulated, because Todoroki must have realized at this point that Izuku is as thirsty for him as a man in the middle of the desert with no water supply. There shouldn't be any surprises on his Twitter, especially not after last night.\nStill, he is acutely nervous, watching Todoroki heft the breakfast tray in one hand as he closes the door behind him with his foot, making his way back over to the bed.\n\"Oh, wow,\" Izuku says, momentarily distracted by the impressive array of options on each plate.\nTodoroki checks his phone. \"Ah, you accepted.\" He clicks on Izuku's profile, and starts scrolling.\n\"Don't look at it now!\" Izuku screeches.\n\"Why not?\" Todoroki asks. \"When did you even get the chance to retweet this much meta about the winners of the awards last night?\"\n\"Before you woke up!\" Izuku says. He may be a private account, but he likes to keep his timeline updated, for his own analysis purposes.\nTodoroki looks like he's trying not to smile, when something must catch his eye. He squints at his phone screen. \"Is this a photoset of my back muscles?\"\nIzuku chokes on the quail egg he just started eating. \"Uh—\"\n\"Izuku, do you follow an entire twitter dedicated to my—\"\n\"They post a lot of up to the minute updates about you!\" Izuku shrieks, diving at Todoroki to grab his phone. The entire breakfast tray nearly gets overturned in the ensuing scuffle, which ends with Izuku lying flat on top of Todoroki, pinning the pro hero's arms above his head to prevent him from finding even more damning evidence. Izuku suspects Todoroki let him win.\n\"I'm not too bothered,\" Todoroki says, his expression sly. \"I'm just glad I could catch your eye in the way I have.\"\n\"Todoroki-san,\" Izuku tells him, leaning in to kiss him, \"shut up.\"\nIn the background, the talk show still plays, now airing footage of the gala. The glitz and glamour of the event has been captured from every angle, and what many stations seem most interested in focusing on is the subject of Todoroki's unexpected (though not  too  unexpected) guest. They replay Todoroki's and Izuku's arrival on the red carpet, the interview with Kaminari, their interactions with other heroes inside the hall. Pictures and video have surfaced of Izuku speaking to All Might, though the media seem to have been prevented from getting close enough to overhear their conversation.\nAnd Todoroki's acceptance speech has been repeated almost non-stop, on every outlet, every social media platform. Most of the cameras were trained on him, but there are some videos that show Izuku's reactions. In case how he felt about Todoroki wasn't obvious to people already, it is now, by the way Izuku watches him. Izuku might have been embarrassed by that, before. Now he just thinks it's easier than having to tell everyone himself.\n\n \"...and I wanted to win it for you—as a thank you for saving me… and for believing in me since the start.\" \n\nTodoroki's voice plays over the speakers, and then the two TV show hosts are back, familiar voices waxing sentimental about the entire thing.\n\"Waahhh…\" Mori says, \"it feels like it really came full circle.\"\n\"The whole story is incredible!\" Kaneda agrees. \"The two of them truly are remarkable…\"\nThe program continues on, though the two people the hosts are discussing have more important things to do, and don't hear it.\nBut if they had, they would agree—remarkable is a pretty good word for it, after all.\n \n "
}