{
    "id": "18220739",
    "url": "https://archiveofourown.org/works/18220739?view_full_work=true",
    "author": [
        "orphan_account"
    ],
    "title": "No Hesitation",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "F/F"
    ],
    "fandoms": [
        "Miraculous Ladybug"
    ],
    "relationships": [
        "Marinette Dupain-Cheng/Kagami Tsurugi"
    ],
    "characters": [
        "Marinette Dupain-Cheng | Ladybug",
        "Adrien Agreste | Chat Noir",
        "Alya Césaire",
        "Nino Lahiffe",
        "Lila Rossi",
        "Kagami Tsurugi",
        "ml class",
        "Chloé Bourgeois",
        "Melodie (Miraculous Ladybug)",
        "Kid Mime (Miraculous Ladybug)",
        "Sparrow (Miraculous Ladybug)",
        "Master Fu (Miraculous Ladybug)",
        "Jagged Stone (Miraculous Ladybug)",
        "Penny Rolling",
        "Sabine Cheng",
        "Tom Dupain",
        "Tikki (Miraculous Ladybug)",
        "Plagg (Miraculous Ladybug)",
        "Longg (Miraculous Ladybug)",
        "dragon miraculous Kagami",
        "Original Akumatized Character(s)"
    ],
    "additional_tags": [
        "hi im still a little upset over chameleon",
        "Post-Episode: s03 Caméléon | Chameleon",
        "ml salt",
        "kind of",
        "you can prise kagaminette out of my cold dead hands",
        "protect marinette squad",
        "uncle Jagged",
        "i love the quantic kids"
    ],
    "language": "English",
    "series": "Part 1 of No Hesitation",
    "published": "2019-03-24",
    "completed": "2019-12-23",
    "words": "15,494",
    "chapters": "10/10",
    "comments": "524",
    "kudos": "7,033",
    "bookmarks": "1,240",
    "hits": "87,505",
    "summary": "<p>Marinette could never have foreseen just how quickly Lila's plan would work - but now a new school year has begun and she has transferred to a new school that could support her fashion career far better than Dupont ever could.<br>Kagami isn't expecting anything to change this year - fencing, studying, brief interaction with the students at her school that don't seem to be put off by her blunt personality. She certainly wasn't expecting to find Marinette, lost on her campus.</p>\n<p>The assumptions the pair held toward each other are quickly shed, and they find themselves getting closer than ever. Meanwhile, Adrien cannot understand Kagami's growing animosity, Lila's lies may be getting too big to handle and the class realise the consequence of abandoning their 'Everyday Ladybug'.</p>\n<p>---</p>\n<p>Chameleon fix-it-fic with Kagaminette because there is definitely not enough kagaminette content on this site.</p>\n<p>We get introduced to Kagami and the Quantic Kids, and Bustier's class find themselves without their Class Rep</p>\n<p>Marinette sees Jagged Stone for the first time since Lila arrived, and comes face to face with two of her old classmates.</p>\n<p>A storm is brewing in Ms Bustier's classroom, and who can say where the fallout will land?</p>\n<p>An empire shows the first signs of cracking. Kagami confronts Adrien.</p>\n<p>Feelings! </p>\n<p>Happy pride, ya'll</p>\n<p>The competition is here, but both Lila and Hawkmoth have opportunities to disrupt it.</p>\n<p>Chat has a long overdue talk with a Princess.</p>\n<p>Marinette and Kagami go on a date.</p>\n<p>An akuma attack disrupts their planned lunch, but Kagami knows just what Marinette is hiding.</p>\n<p>An Akuma fought. A liar brought to light.</p>",
    "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>I'm gonna be shooting for at least one update a week for now, but I have the next few chapters planned out! The response to just the first chapter of this has been amazing, I am blown away. Hope you like the new chapter :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>That whole once a week thing went out the window real quick - university has been dead busy recently! Hope you enjoyed :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>Real quick, does anyone know if there's a way to fix the weird formatting I always seem to get every time I copy my fic chapters over from Google Docs to Ao3, because I'm running out of ideas and I'm not sure how to make it look better.</p>\n<p>That being said, apologies for the somewhat wonky format in some places and I hope you enjoy the new chapter :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>Hi! Just to clear some things up that people have been asking - we will see a clash between Marinette's new and old friends - but because in this fic Season 3 basically didn't happen, we won't see Bunnix or any new heroes/villains the later episodes introduced.</p>\n<p>I've planned out this fic to be around 10 chapters, but I was thinking of adding an epilogue(s) where the class confront Adrien, a full old friends meet new friends, Alya apology etc. Let me know what you think! </p>\n<p>Hope you enjoyed this chapter!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>Hi! Hope you enjoy this chapter - it is a few days later than I wanted but my laptop decided that it wanted to explode, so naturally that was a higher priority.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>Hi, everyone!</p>\n<p>Sorry this chapters so late, I could not figure out how I wanted Lila to interfere!</p>\n<p>Hope you enjoyed this chapter! We are now only two chapters away from the end, not including any epilogues.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>Ya'll have no idea how long the date and confession took me to write. That's literally the reason this chapter took so long.</p>\n<p>Hope you like this chapter!</p>\n<p>Next time: the team land at the Louvre to pull off their plan, but a certain class are surprised to see a Fox holder they swore they knew.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">notes</a>.)\n</p>\n<p>And this is the end!<br>..<br>Of the main story!</p>\n<p>Truthfully, I have a lot of “epilogue” ideas for this story, which I want to write and will probably write. They maybe added onto this story or put as one shots in a series, unsure. If you have anything you’d like to see, drop a comment and let me know! </p>\n<p>I am sorry updates have been so few and far between. If you’re interested in Honey Butter and Breaking Point, they’re on temporary hiatus until a few chapters have been written to try and lessen the update gap. Similar thing for cut the cord. There are a few other one shots in the docket, not all salty! If you want sneak peeks at future updates or a time for the next one, check out my tumblr tawnoak because it’ll all go there, under the tag my writing !</p>\n<p>Thank you all for reading and commenting - this is the first multi chapter fic I’ve finished in almost 5 years, which is incredible to think about :D</p>\n<p>Edit: @ the Lila anon. You are wasting your time. I will delete all of your comments and mark them as spam. Take a hint.</p>",
    "text": "\n Marinette thought she could handle Lila’s lies - like Adrien said, they were in it together.\n\n\nAnd yet, they weren’t. \n\n\nWhen Lila pretended to trip and fall on her way past Marinette, acting as if she’d tripped over Marinette’s feet, causing her to get sent back to the back row, Adrien said nothing. When Alya cornered Marinette and revealed her crush and secrets to anyone and everyone listening, Adrien did nothing. When Marinette asked him for help, he pretended to hear nothing. \n\n\nThey were\n not\n in it together. They never had been. It had taken her far too long to realise that the ‘high road’ for Adrien meant pretending that nothing was wrong and sweeping it under the rug - who cares if you get hurt, just don’t make a big deal out of it. Lila could get akumatized, he’d reasoned - but what would happen when someone got akumatized because of her lies? It had almost happened once already, Marinette thought bitterly to herself. It reminded her painfully of all the times Adrien had never bothered doing anything about Chloe - how he had had the nerve to be disappointed in Marinette and the others for daring to be happy that the girl who had bullied them for years was leaving. \n\n\nAnd Alya. Alya, and the rest of the class. Marinette wanted to scream as she thought of the way they had been acting. Her so-called best friend, who had volunteered her to go to the back, hadn’t been listening to her at all. Her eyes stung as she thought back to the last day of the school year.\n\n \n\n\n“Girl, I’ve tried to be patient with you but this is ridiculous! You’re acting no better than Chloe - I mean, bullying Lila? That’s not the sort of girl I made friends with. Besides…”\n\n\n \nShe’d gone on and on and on, and even Lila had made an appearance, batting her eyelashes and spinning some sob story about how she just didn’t understand why Marinette hates me so bad, I only ever wanted to be friends!\n \n\nThe class had turned on their ‘Everyday Ladybug’ in an instant. She supposed she should have taken Lila’s threat more seriously, but she had still had faith in her friends, in Adrien, then. \n\n \n\nShe didn’t anymore. \n\n \n\nShe had left school with a heavy heart and returned home to find an acceptance letter waiting on the counter for her. Three months after Lila started her Anti-Marinette campaign, her parents had sat her down and gotten her to tell them everything. Marinette had begged them not to make a scene, but agreed to switch schools. Part of her ached to leave her friends to Lila’s machinations, but what else could she do? She had tried everything to get her friends to see the truth, and yet they refused to hear her.\n\n \n\n\n“I only tell people what they want to hear.”\n\n\n \n\nThat’s what Lila had told her, and she was able to see the reverse for herself. The class didn't want to believe she was lying, and so it was obviously Marinette that was the problem, Marinette the new class bully, Marinette the strange and freaky girl who bailed out of plans without a reason, Marinette who was just jealous of darling Lila, Marinette who had a \n\ncreepy stalker schedule on her wall, Marinette, Marinette, Marinette! \n\n\n \n\nMarinette took a deep breath, trying to focus herself on the feeling of Tikki curled up in her hand. She couldn’t run the risk of being akumatized again. Summer had passed without word from any of her old friends, and she hadn’t seen them near the bakery. It was safe to say that she had changed - she’d worried Chat at first, she knew, he was unaccustomed to seeing his Lady so serious and upset. She had also been avoiding Alya - luckily they hadn’t needed to make use of any extra miraculous over the summer. She couldn’t trust Alya, or Nino, anymore, that was for certain. Fu had agreed, when Tikki had finally persuaded her to talk to the Master about everything that had happened. He had not admonished her for it, but said he understood.\n\n \n\n\n“I have always told you to choose an ally you can trust, Marinette. If you no longer trust Rena Rouge or Carapace you may second guess yourself in battle, and it may cost you. It is wise of you to retire them. Are you planning on retiring Queen Bee, as well?”\n\n\n \n\n\n“I’m.. not sure, Master. Chloe never exactly defended me, she doesn’t even like me, but she’s the only other person not enamoured with or willing to let Lila’s lies slide, and she’s tried to change since becoming Queen Bee.”\n\n\n \n\n\n“I see. Perhaps it would be wise to keep someone who is used to the role of fighting akumas, and if Miss Bourgeois is trying to change then she may be the only one who can.”\n\n\n \n\nMarinette felt lighter than she had in weeks following the talk. She’d thrown herself headfirst into designing - her new school was known for promoting student’s individual interests, and she wanted to expand her portfolio. She leant back in her chair and surveyed her room. That had changed too.\n\n \n\nBefore, photos of her friends and Adrien had littered the walls, his schedule hidden in its slot, and a wallpaper on her computer boldly declaring her crush. After school had ended, after Alya had ripped her heart in two, she’d looked at her surroundings with a heavy heart, and moved forward. The schedule was gone, replaced a message board pinned to her wall with ideas and inspiration for new designs. The pictures of Adrien, save one of him wearing her derby hat, were also gone, as were the pictures of her friends. She had saved their class photo in a scrapbook, as well as an old selfie she and Alya had taken. The rest had gone into the bin. Her computer wallpaper was still one of her own design, but was now a collage of her summer designs.\n\n \n\nHer eyes lingered on her scrapbook, and Tikki was a comforting presence on her shoulder.\n\n \n\n“It’s ok to miss people, Marinette. You’ll be ok.”\n\n \n\nShe smiled at her Kwami, and picked up the jacket she had been working on.\n\n \n\n“Thanks, Tikki. What do you think?”\n\n \n\nHer new jacket was a deep blue, her signature just underneath the collar, and a ladybug descending down the right side. It was simpler than most clothes she had been designing, but she had wanted something that went fairly well with almost everything and she was proud of the results. \n\n \n\n“It looks great Marinette! Are you going to wear it to school tomorrow?”\n\n \n\nMarinette giggled at her Kwami’s enthusiasm, but shook her head. Her new school had a uniform, simple yet elegant. She had been informed that her small side bag would not be allowed, which had caused a brief moment of panic before Tikki pointed out that there was an inner pocket to the blazer of the uniform that she could hide in. She could, of course, wear the jacket over the blazer as she came and went, but she wasn’t sure if she could consider it a finished piece yet - she was always thinking of new ways to change her clothing.\n\n \n\nHer mother popped her head through the trapdoor, reminding her to get some rest before the new day tomorrow - her new school was farther away than Dupont, and she would have to fix her sleep schedule if she didn’t want to get a reputation for lateness - damn Hawkmoth. She called goodnight to her parents and climbed up to her bed, Tikki whizzing over to curl up on her pillow.\n\n \n\nTomorrow would be the start of  a new day. She was nervous, and excited.\n\n \n\nBut, for the first time in months, she felt okay. And that was enough.\n\n\nAs usual, Kagami arrived early to school, eager to make use of the relative quiet to catch up on some things before the majority of other students arrived. Her gaze flickered to the courtyard quickly - sometimes Allegra was just as early to sneak in some more practice on her flute before lessons - and she stopped as her eyes fell on a familiar face.\n\n \n\n“Marinette?” The girl near jumped, turning quickly to face Kagami. Behind her, the school principal and two others she didn’t recognise, presumably Marinette’s parents, turned as well.\n\n \n\n“..Hi Kagami” Marinette was smiling, but even she could see that it was tense, strained, nervous? Kagami frowned - she had not necessarily thought highly of Marinette, stringing along Adrien as she did with that other boy, but she couldn’t help but be concerned at the lack of the usual light in the girl’s eyes.\n\n \n\n“Ah, you know Ms Tsurugi already? Wonderful. Well, that’s about all I had to say, if you have any further questions please don’t hesitate to ask me, another teacher, or one of your fellow students” The principal hesitated for a second before continuing, “I hope my school proves to be a much happier environment for you, Ms Dupain-Cheng.”\n\n \n\nHappier? If Kagami had not been confused before, she most definitely was now, even if it did somewhat explain the dullness of the normally peppy girl.\n\n \n\n“Yes.. we hope so too.” Marinette’s mother said, squeezing her daughters shoulder affectionately. \n\n \n\n“I’m sure Ms Tsurugi will be able to help you find your way?” The principal said, looking questioningly at her.\n\n \n\n“Of course.” He smiled at her response, before handing a few leaflets to the family and departing. Marinette’s parents hugged her tightly, before leaving as well.\n\n \n\nMarinette turned towards her, that nervous smile still plastered on her face.\n\n \n\n“Thanks Kagami, I didn’t know you went here.”\n\n \n\nShe nodded, and the two walked in silence for a while.\n\n \n\n“So, Marinette. Why did you leave Dupont? You seemed popular and happy.” She asked, wincing slightly as Marinette visibly shrunk in on herself. Damn.\n\n \n\n“I uh.. I..” She stuttered, before looking away and speaking in a small voice, “I.. may have gotten bullied out of my old school.”\n\n \n\nKagami stopped dead. She was not good at this sort of thing, it was Allegra that was always better at being kind and helpful. But, looking at her, she felt the odd need to try.\n\n \n\n“Do.. do you want to talk about it?” She finally asked, placing a hand on the smaller girl’s shoulder.\n\n \n\nMarinette stopped, as if she were thinking hard to herself. Eventually, she turned back to Kagami, who tactfully tried to pretend she could not see the glint of tears in her eyes.\n\n \n\n“Do you know a Lila Rossi?” She asked\n\n \n\n“Ah, yes. The liar from your class, correct?” Kagami scowled - Adrien had mentioned the girl and her lies, and yet had not seemed concerned about them, even when he told her that Lila had lied about knowing a prominent fencer (whom had died ten years ago, but that was hardly the point), and seemed uninterested in counteracting her. It had struck her as cowardly, but then Adrien often did, and she paid it little heed. \n\n \n\n“Yeah - she lied about all this crazy grandeur stuff, really stupid simple stuff that could easily be disproved, I mean, come on, any five second internet search could tell you Jagged Stone has never had a cat! I tried to call her out on it, but everyone else believed her and I was sent to the back of the class for it, right out of the seat I’d won from Chloe who’d bullied me for ages at the start of the year, all because my supposed best friend wanted to sit next to her boyfriend and ‘didn’t think I’d mind’” Marinette’s face had twisted into an angry glare, but Kagami did not interrupt - she had learned from a young age that anger is more quickly dissipated if let out all at once.\n\n\n\n\n\n“And even then, I kept trying. She kept lying, and tried to suggest that I could have gouged out Max’s eye with a napkin I’d thrown. A napkin! Max, who wears \n\nglasses\n\n and is supposed to be one of the smartest people in Paris if not France, honestly believed he was in danger and the class scolded me for ‘hurting poor Lila’. And then, she got me in the bathroom - she said she would take all my friends away - I was almost \n\nakumatized\n\n about it I was that upset and -”\n\n \n\nShe stopped suddenly, throwing her arms up in frustration.\n\n \n\n“Let me guess - your friends continued to buy into her lies and that threat started to ring true? Did you have no one who believed you?” Kagami asked\n\n \n\nThe anger in her eyes quickly faded to sadness.\n\n \n\n“Adrien knew. He knew she was lying, but he told me to stop trying to call her out - he said that as long as the two of us knew it didn’t really matter - he said he’d be there with me, but.. He wasn’t. The class turned on me, they isolated me, they belittled me, and everytime he wouldn’t \n\ndo anything\n\n. He told me towards the end that maybe I should just pretend to start believing Lila, because if I did the others would eventually forgive me-”\n\n \n\n“He said \n\nwhat\n\n?” Kagami asked, aghast. She knew Agreste could be cowardly at times, but to abandon the girl he obviously cared for to the machinations of a girl that he knew was lying? \n\n \n\n“Yeah - when Alya had finished screaming at me about what an awful person I was, he came up and said that maybe I should have given her a second chance, as if I was the one who was in the wrong for trying to protect my friends! If they ever find out she’s lying, they’ll be so hurt, but I tried! I tried so hard.. And they just.. They just..” \n\n \n\n“Akuma!” A teacher’s cry alerted them, and Kagami spun around to find a blasted purple butterfly heading straight for the now crying girl at her side. She drew her foil, wondering if she could keep Hawkmoth from out of her head for long enough for Ladybug and Chat Noir to show up when Marinette dragged her sleeve across her face and stepped forward.\n\n \n\n“I won’t allow you to control me. I’m allowed to be upset without you taking advantage of me. I’m.. I’m stronger than you.” Her voice wavered, but she stood firm, and the akuma fluttered away.\n\n \n\nKagami could only watch in wonder. Even when overcome by grief, Marinette could find the strength to keep her mind. It was incredible. The girl turned back to her, wanting to find a bathroom - Kagami pointed one out and settled down on a bench to wait. A few minutes later, excited chatter from the main entrance told her that Ladybug had appeared to purify the stray akuma, easing her nerves. Marinette emerged not too long after, eyes still red but looking more at ease than they had before.\n\n \n\n“Sorry, Kagami. I guess I still had some cooped up emotions about it.”\n\n \n\n“Don’t worry about it, Marinette. I’m.. sorry that you had to go through that - and disappointed that Adrien did not defend the girl he loves.”\n\n \n\nThe confusion on Marinette’s face was evident, and gave her pause.\n\n \n\n“Adrien has a crush on you. I thought you were aware of this?”\n\n \n\nTo her shock, Marinette chuckled, shaking her head lightly.\n\n\n“Nope. He doesn't have a crush on me. I used to crush on him, like badly, but then Lila happened and honestly now I’m not quite sure what I ever saw in him. Adrien has a crush on Ladybug, not me.”\n\n \n\n“I.. I see. Then, I owe you an apology, Marinette. I believed that the girl Adrien liked was you, and that you were stringing him along with that other boy from the ice rink.”\n\n \n\n“What?? No! Adrien asked me for help going on a date with you, but I felt embarrassed, and a little broken hearted, to go alone, so I asked Luka to come with me. And don’t get me wrong, he’s very nice, but I don’t think I like him like that,” Marinette smiled, the only real smile she had seen so far, “So why don’t we start over? No misconceptions.”\n\n \n\n“I’d like the sound of that” Kagami smiled, and held out a hand for Marinette to shake, “Kagami Tsurugi. Nice to meet you.”\n\n \n\n“Marinette Dupain-Cheng. Nice to meet you too.”\n\n\n\n\n\n \n\nAlya collapsed into her seat with a sigh, squeezing Nino’s hand in greeting. Her other hand skimmed over the Ladyblog on her phone. The summer had seen some incredibly strong or elaborate akumas, and yet she had never been offered the chance to become Rena Rouge again. A talk with Nino confirmed that neither of Paris’s heroes had approached him to become Carapace, either. It was a small relief that Queen Bee hadn’t been spotted either - but then, it seemed to Alya that Ladybug had been avoiding her. She knew that the spotted heroine was often close to detransforming once an Akuma had been purified, but she had, at least, always been friendly to Alya. But over summer, she’d swung right past Alya with nothing at all - and even when she’d caught Ladybug on patrol, Ladybug had cut off her questions with a terse ‘I’m busy’ and had swung away before she could say anything.\n\n \n\nShe frowned, wondering what she had done wrong, when Lila arrived, settling in her seat in front of her.\n\n \n\n“Is everything ok, Alya?” She asked, concern clear and evident in her voice.\n\n \n\n“Lila, I don’t suppose you could tell me if Ladybug’s mad at me?”\n\n \n\nLila stopped rummaging in her bag, and smiled up at her friend.\n\n \n\n“Don’t worry Alya, Ladybug’s just been so busy with all those Akumas and she’s a bit stressed - she’s definitely not mad at you though - she tells me how much she loves your blog all the time!”\n\n \n\nAt Lila’s words, a weight lifted off her shoulders - Lila was Ladybug’s best friend, she’d know and wouldn’t lie if Ladybug actually was. \n\n \n\n“Thanks, Lila - I was just worried, y’know?”\n\n \n\n Lila smiled, before launching into a story of yet another amazing person she’d hung out with over summer. Alya hung onto every word - her friend was amazing. Even if \n\nsome people\n\n couldn’t see it, she thought, sending a quick glance up to the back row. Marinette hadn’t shown up yet, and to be honest? She was sort of grateful for it. Marinette had been nothing but vile to Lila ever since she’d come back - she couldn’t believe she’d ever called that girl her best friend - honestly, all that fuss over a seat change? Her crush was way out of control. \n\n \n\nAlya thought nothing of it when the bell rang and Marinette hadn’t arrived yet. She was often late. It was odd that Ms Bustier went through the attendance, and didn’t call her name - but maybe she just didn’t want to concern herself when she could clearly see that Marinette was not present. It was odder when the bell rang for first period, and Marinette still wasn’t there. She almost missed Adrien’s quick glance up to the back row, but paid it no mind. \n\n \n\nBut then Marinette didn’t turn up at all, and her name wasn’t called in any class. It was the last period, when Lila piped up.\n\n \n\n“Hey Ms Bustier? Is Marinette okay? I haven’t seen her all day.” Alya smiled - it was so much like Lila to worry about a girl that had bullied her relentlessly.\n\n \n\n“Marinette is no longer attending this school.”\n\n \n\nAlya blanched - she knew the girl was dramatic, but this was way too far. She had to go there after school and shake some sense into the girl - she’d get along so well with Lila if she could just let go of that awful jealousy.\n\n \n\n“Oh, this is all my fault,” Lila lamented, “I should have tried harder to get her to like me” she sniffled, and immediately the class turned to reassure her, Alya among them, and Ms Bustier had to slam a book down on her desk to be heard above the noise, shutting the class up immediately.\n\n \n\n“That’s enough, class. We have work to finish - open your textbooks to page 86 and read the highlighted text.” She said coldly, a tone that surprised Alya - a quick glance around the class confirmed that she was not the only one.\n\n \n\nJust what was going on today?\n\n \n\n\n\n\n\n\nBy the time the final bell had rung, Marinette’s head was swimming with the new names and faces she’d met. Kagami had introduced her to her small group of friends - Allegra, a tall brunette with a kind smile who was apparently a very skilled flutist as well as the student leader for their year, Claude, a small blonde boy with an infectious laugh, and Apollo, who was aptly named if his love for science was anything to go by. They’d easily accepted Marinette into their fold, each making sure she had someone to help her find her way around, and slowly but surely she’d let down her guard. It felt like she was also meeting Kagami for the first time - she was blunt, but she wasn’t the cold Ice Queen she had previously believed her to be. She paused on the stairs outside the main entrance - presumably, in the time it would take her to get home, her old class would have dispersed from Dupont and she wouldn’t have to see them, but she still worried. She heard a shout and looked down to see Kagami waving her over from a sleek silver car.\n\n \n\n“I am going to fencing practice at Dupont. You live nearby, correct? I suppose you may be looking to avoid your old classmates.” She gestured for Marinette to join her inside.\n\n \n\nMarinette nodded gratefully and slid in beside her. The drive to the bakery was short, and as she leant forward to direct Kagami’s driver, the bakery came into view and her heart sank.\n\n \n\nAlya was standing outside, arms crossed and glaring out into the road.\n\n \n\nKagami followed her line of sight and scoffed. \n\n\n\n\n\n“Is there another entrance?” Marinette nodded, and directed them around the corner.\n\n \n\nMarinette thanked them both before disappearing inside and Kagami sighed as they drove back onto the main street.\n\n \n\n“Tai, stop here, please.” She requested, eyes fixed on the auburn haired girl that had given Marinette so much grief.\n\n\nIt had been just over a month since Marinette had transferred to her new school, and, if nothing else, it had confirmed to her she had made the right choice. Her new friends were kind, funny and intensely protective - as she’d found out two weeks in, when she had eventually gotten around to telling Allegra, Claude and Apollo the reason she had left DuPont. Allegra’s typically sunny smile had grown ice cold in an instant, and for a second she had feared she’d need to restrain Claude from marching over to DuPont to deal with the ‘lying witch’, as he had dubbed Lila, himself. Kagami had already faced off with Alya, she knew, and it had gone about as well as anyone had expected. Later that night, she had finally blocked Alya’s number, unable to deal with the multitude of, frankly, rude messages she’d received in the hours following her arrival at home. She’d blocked the rest of the class as well, including Adrien - he had texted her something roughly the time after their fencing practice was over, but she had deleted it without looking. Probably something berating her for not being a doormat. Her phone was, however, more active than ever before - her new friends had quickly added her to their group chat, as well as a larger class-wide one - Allegra and Claude were in her class, with Kagami and Apollo being in the class further down the corridor. \n\n \n\nShe was happy, though, and people were noticing.\n\n \n\n“You look happier these days, My Lady.” Chat Noir spoke up from behind her, startling her from her perch on top of the Eiffel Tower.\n\n \n\n“You scared me, minou!” She pouted, settling down as Chat swung down to join her, smiling apologetically, “But yes, I am a lot happier now.”\n\n \n\n“I’m glad. If you do need me to cataclysm anyone, though, just let me know,” He grinned, “I’ll do it in a heartbeat to whoever made you so sad over summer.”\n\n \n\n“Relax, Chat. You can’t cataclysm civilians - I’m practically over it. How are you feeling anyway? It has been a while.” She mused - the two hadn’t been able to do a patrol together since the summer, and they were never able to really stick around following akuma attacks.\n\n \n\n“I’m feline fine, milady!” Chat grinned, snickering when Ladybug rolled her eyes at his pun, “My schedule is finally clearing up a bit, so I can take back some more patrols again”\n\n \n\n“Good to hear, kitty.” Chat’s civilian life had kept him busy over summer, and so she had taken on the majority of patrols.\n\n\n\n\n\nChat grinned again, opening his mouth to say something when an explosion echoed in the distance.\n\n \n\nAn Akuma. Great.\n\n \n\n“Shall we, my lady?” Chat stood, extending his hand.\n\n \n\nShe nodded, and the Heroes of Paris swung out to take down Hawkmoth’s latest akumatized victim.\n\n \n \n\nA giant of green was rampaging through the streets of Paris, faster than either hero was expecting. They landed across from the Akuma. Upon closer inspection, the green masses were piles and piles of leaves, swirling about as if they had their own mind - just inside, a man could be seen floating at the centre of the mass, clutching a thick book. \n\n\n\n\n\n“Chat - the Akuma may be in that book, we just need to get through those leaves.”\n\n \n\nChat nodded and threw himself towards the mass - the man turned and thrust a hand out towards him, and the leaves followed his cue, whipping out towards Chat and sending him flying backwards.\n\n \n\n“Ladybug and Chat Noir! I am the gardener! My trade was disrespected and now all of Paris will face my wrath! Give me your Miraculous!”\n\n \n\n“You ever feel like Hawkmoth is starting to run out of ideas, my lady?” Chat Noir asked, landing next to her. \n\n \n\nBefore she could answer, the man’s book glowed, and the leaves spread out, forming a sphere that was impossible to see through. When it faded, there were eight smaller forms where one once stood, each looking completely identical.\n\n \n\n“Great! Leaf Man has illusions” Chat sighed\n\n \n\n\n“I am the Gardener!” \n\nThe forms shrieked, tendrils of leaves racing out to grab them.\n\n \n\nLadybug and Chat Noir darted across the rooftops. The forms merged back into one, easily hauling itself up onto the rooftops to follow.\n\n \n\n“Maybe we could use some illusions of our own, eh?” \n\n \n\nLadybug nodded, and with a quick goodbye Chat Noir had successfully gained the Akuma's full attention, giving Ladybug the room she needed to race to Master Fu.\n\n \n\nFive minutes later, Marinette was kneeling in front of the Miraculous Box, hesitating over the jewellery.\n\n \n\n“If I may advise, Marinette, you may wish to make use of both Trixx and Longg.\"\n\n\n\n\n\n“Longg?” \n\n \n\n“The dragon miraculous!” Tikki piped up, “His Inferno may be useful for the Gardener.”\n\n \n\nShe picked up the Dragon Miraculous, a black necklace with a flame-decorated pendant attached - smaller than the fox pendant, which she hesitated over.\n\n \n\n“Have you found a potential wielder, Marinette? Somebody you can trust?” Fu asked, eyes creasing in concern.\n\n \n\nMarinette considered it for a moment - Tikki nudged her phone, notifications lighting up her screen. She glanced down quickly, and made up her mind.\n\n \n\n“Yes, Master. I believe I have.”\n\n \n\nAnd with that, she transformed and darted out. She was getting close to the Akuma, when a flash of blue hair caught her attention. There in the alley, Kagami stood with her foil drawn, staring up at the wall as if contemplating the best way to scale it. Ladybug landed behind her, and the girl whipped around, the frown on her face becoming more neutral when she saw who it was.\n\n \n\n“Good evening, Ladybug.”\n\n \n\n“Kagami, everything okay?”\n\n \n\n“Your partner took me out of the fight. I was handling myself, but supposedly it is too dangerous for civilians.” She said, scowling. \n\n \n\n“Well, it is. But what if you weren’t just a civilian?” She asked, trying to hide a smile at the confusion on Kagami’s face. She held out the box of the Dragon Miraculous.\n\n\n\n\n\n“Kagami Tsurugi. Here, if you wish to accept it, is the Miraculous of the Dragon, which wields the power of conviction. You will use it for the greater good. Once the job is complete, you will return the Miraculous to me.”\n\n \n\nKagami took the box almost reverently, flipping the lid and quickly shielding her eyes from the flash that followed, staring at the red Kwami that formed in front of her.\n\n \n\nLongg stretched out and bowed to Kagami. \n\n \n\n“Hello. I am Longg.”\n\n \n\nKagami attached the necklace around her neck as Longg went over her powers.\n\n \n\n“You have a sword with which to fight. You do not have a way to travel quickly, such as Ladybug with her yo-yo, as my wielders are fast of foot and of mind - you do not need an extra tool. Your power is Inferno - your blade will be as alight as your conviction, and you can send your flames out a considerable distance. Once you have called Inferno, you will have five minutes before you detransform. You will be kept aware of how much time you have left from the flames on your necklace. They will extinguish one at a time with each minute.”\n\n \n\n“Understood. How do I transform?”\n\n \n\n“I like this one,” Longg smiled at Ladybug, “You need only say ‘Longg, fire up’.”\n\n \n\n“Longg, fire up!”\n\n \n\nKagami transformed, her usual outfit turning into a dark red suit not unlike her fencing uniform, with a small belt looped around the middle to hold her swords sheath at her back.\n\n \n\n“What shall we call you?” Ladybug asked.\n\n \n\n“.. Call me Kasai.”\n\n \n\n“Right. Kasai, I need you to help Chat lure the Gardener towards the Eiffel Tower. I will be back with another hero in a few minutes - please try to not use your Inferno until I get back with them.”\n\n \n\nKasai nodded and darted back towards the fight. Ladybug turned and ran, calling Chat to quickly update him on the situation. \n\n \n\nSoon, she hung outside Allegra’s house, waving to catch the brunette’s attention from her bedroom window. Allegra’s face lit up when she spotted her, hurriedly moving to let her in.\n\n \n\n“Ladybug? What are you doing here? The Akuma, isn’t it still out there? Why-” She cut herself off when Ladybug held out her second box.\n\n \n\n“Allegra Collette. This is the miraculous of the fox, which grants the power of illusion. You will use it for the greater good, and when the job is done you must return it to me.”\n\n\n\n\n\n“Woah! Wait, like Rena Rouge? Why didn’t you just go to her?”\n\n \n\n“Rena Rouge has been retired. The mantle of the Fox will fall to you if you choose to accept it.”\n\n \n\n“I will. I won’t let you down, Ladybug.”\n\n \n\nAllegra opened the box, and Trixx came flying out.\n\n \n\n“Trixx, I-”\n\n \n\n“There is no need, Ladybug. Master already explained everything to me.” Trixx spoke before she could even finish, a reassuring smile on his face before he turned to Allegra and quickly briefed her on her new powers. \n\n \n\nSoon enough, Allegra transformed.\n\n\n\n\n\n“What should we call you?”\n\n \n\n“Call me Melodie!” She grinned, throwing her flute from hand to hand. \n\n \n\nThey were at the fight moments later. Kasai and Chat had cornered the Gardener underneath the Eiffel Tower, but he had split and become difficult to control. They landed next to the pair.\n\n \n\n“There you are, milady! And with Rena - wait. You’re not Rena Rouge!”\n\n \n\n“No, this is Melodie. Rena Rouge has been retired, permanently. Melodie is the new fox wielder.” Ladybug corrected, relaxing slightly when Chat Noir grinned and shook her hand. They could do this.\n\n \n\nAll of them missed the quiet gasp from below. \n\n \n\n\n\n\n\nAlya ended her footage, slipping her phone back in her pocket with a shaking hand. \n\n \n\nMelodie. Melodie, not Rena. Melodie.\n\n \n\nShe had been replaced. \n\n \n\nAbove her, she heard the familiar call of \n\nMirage\n\n, and numerous copies of the four leapt at the eight copies of the Akuma, who quickly merged back into one. Ladybug called her Lucky Charm, and the new hero called out \n\nInferno\n\n, the sword she had been wielding becoming encased in flame, allowing her and Chat to break through the leaves. Ladybug broke the Akuma with her Charm, and the Miraculous Cure soon followed. Ladybug ran with the new heroes before she could summon the urge to call out after her.\n\n \n\n“Hey, Ladyblogger! Out late, aren’t we?” Chat landed behind her, his trademark grin slipping slightly when he saw her face, “Everything okay?”\n\n \n\n“..What’s with the new Fox hero, Chat?” \n\n \n\n“Not sure,” Chat shrugged, “I trust LB though, and we’d discussed retiring Rena over summer, so…” His Miraculous beeped, indicating he was on his last minute.\n\n \n\n“I’m sorry, Alya, guessing you were a Rena fan? If you can catch me or LB on patrol, we’ll probably be able to give more detail to our favourite blogger. Cat out!” \n\n \n\nWith a wink and mock salute, Chat leapt over the rooftops and out of sight, leaving the former Fox hero wondering just what it was she had done wrong.\n\n\nMarinette returns home one day to find Penny Rolling in her kitchen, laughing with her mother over tea and some chocolate chip cookies they’d baked the day before. Penny lights up when she sees her, wrapping her in a hug. She explains that Jagged wanted her to come and see him at his suite in the Hotel, and after a nod of approval from her mother she skips up the stairs to change and meets Penny in the car. Marinette shrinks down a little when they pass her old school, a move that doesn’t go unnoticed by Penny, but she doesn’t bring it up immediately.\n\n \n\nJagged grins from ear to ear when they arrive and slings an arm around her shoulders as they sit down.\n\n \n\n“Marinette! Good to see ya again!” \n\n \n\n“Good to see you too,” Marinette laughs, waving to Fang in the corner. She knows he probably doesn’t register it, but it didn’t feel right to ignore him.\n\n \n\n“So, my little rockstar, Penny said your mom had said you switched schools?” He asked, watching her curiously.\n\n \n\n“Ah.. yeah. I decided to go to a school that’d help out my career aspirations a bit more, that’s all!” Marinette gives an awkward smile and tries to laugh it off, but Penny frowns and leans forward.\n\n \n\n“Then why did you shrink the way you did when we passed DuPont?”\n\n \n\nThe question is innocent enough, but Marinette’s face falls, and she drops her gaze, unable to meet either of them in the eye.\n\n \n\n“Marinette?” Jagged’s voice is soft, and the dam bursts.\n\n \n\nShe really thought she would be over crying about them by now.\n\n \n\nThey let her cry herself out, and when she’s done Penny passes her a glass of water and a wipe to clean her face.\n\n \n\n“What happened, Nette? Please, tell us the truth.” She says, taking up the other empty spot on the sofa.\n\n \n\nAnd she does. She tells them everything about Lila, about Adrien, about every way the class had treated her. She tells them she was nearly akumatized, and Jagged shoots up, angrily pacing around the room, disturbing Fang in the process and good lord Marinette had never known there were so many ways to curse in French. Penny takes both her hands in her own, and they let Jagged run out of steam, before he drops down in front of her and covers their hands in his too.\n\n \n\n“Ah, Marinette. I’m so sorry. I.. I’m sorry. You didn’t deserve that kinda treatment.” His voice is uncharacteristically serious, and he looks pained on her behalf.\n\n \n\n“Thanks, Jagged. It.. It hurts, still, but I really am doing much better now. I have some great new friends and my designs are improving all the time!”\n\n \n\nJagged smiles, and the topic is passed over. She leaves almost an hour later with a promise to organise a dinner with her parents later in the week, and new inspiration for an outfit scribbled down in her phone. She’s still engrossed in a conversation with Penny when she collides with someone around the corner.\n\n\n\n\n“Hey! Watch where you’re goin- Wait, Dupain-Cheng?”\n\n \n\nChloe stands blinking in front of her. Penny puts her hand on Marinette’s shoulder protectively, but she smiles and motions that it's alright.\n\n\n\n\n“Hi Chloe, how’ve you been?”\n\n \n\nChloe seems thrown by the question for a second, looking at Marinette like she’s someone she can’t quite figure out - she tries and fails to look like the haughty blonde Marinette remembers, but there’s a bitterness in her eyes that’s not too unfamiliar.\n\n \n\n“Other than our sheep class blindly following Lie-La? Fine.”\n\n \n\n“Even Sabrina, huh?” Marinette’s suspicions are confirmed when Chloe looks down, “You know, I always thought you believed Lila too.”\n\n \n\n“What?! How dare you I would never..” Marinette raises an eyebrow as Chloe fades away, gaze flicking quickly between Marinette and Penny.\n\n \n\nPenny squeezes her shoulder and tells her she’ll meet her in the car.\n\n \n\nChloe slumps the second she's gone, and it's such a drastic change in her usual demeanor that Marinette has to look down to confirm she isn't currently transformed. \n\n\n\n\n“I.. I used to. I was jealous, and I thought the whole song thing was true, because hey Jagged likes \n\nyou \n\nso it’s not too unbelievable. But then I saw how the class started to act, and I wasn’t there the first month back at school and when I came back I was alone, and Adrien he - “\n\n \n\n“Tried to tell you that her lies weren’t hurting anyone, right?” \n\n \n\nChloe’s eyes snap up in shock.The lack of his usual nickname didn’t go unnoticed, and she nods for the blonde to continue.\n\n\n\n\n“Yes! I yelled at him that I was hurting, and I guess Lila overheard, because the next day she- God I don’t know why I ever thought you were the enemy (“Chloe..”) because at least you’re a nice person - she told everyone I’d made fun of Adrien about his mom disappearing, that I’d taunted him by saying at least my mom was still around. And then everyone yelled at me about her, because lets be honest here (“Chloe.”) my mom isn’t exactly around and-”\n\n \n\n“Chloe!” Marinette finally manages to cut through her rant, and passes her the packet of tissues Penny had given her earlier.\n\n\n\n\n“Did Adrien stand up for you?” She asks. She’s certain she already knows the answer, and Chloe’s short bitter laugh as she wipes the worst of her ruined makeup off of her face is all the confirmation she needed.\n\n \n\n“You were right to leave, Marinette. Those idiots, they’re ridiculous, utterly ridiculous! You’re the number one person they could’ve asked to prove what Lila was saying - you know Jagged Stone, you know Adrien, you’re freaking Ladybug, you…”\n\n \n\nMarinette’s mouth drops open, completely missing the tail end of Chloe’s sentence.\n\n \n\n“What did you just say?”\n\n \n\nChloe looks confused, for a second, before horror flashes across her face and she claps her hand over her mouth. She grabs her hand and runs up to her suite, stammering apologies all the way. Marinette can almost hear Tikki stifling a giggle at the absurdity of it all.\n\n \n\n“I haven’t told anyone, I swear!” She says when the doors shuts behind them, “I just, I figured it out, and that’s partially how I knew Lila was lying because there’s no way she’s besties with Ladybug and enemies with you-”\n\n \n\n“Like you, you mean?”\n\n \n\nChloe has the decency to look ashamed, at least.\n\n \n\n“Yeah. Like me. And about that.. I wanted to apologise. I treated you like garbage for no real reason - I was a bully, and a coward, and a fraud and you have no obligation to accept my apology or forgive me. And.. It’s going to sound selfish of me, but I need to know. Are you going to replace Queen Bee too?”\n\n\nChloe’s expression is almost heart breaking, and it makes her consider her words carefully.\n\n \n\n“Chloe.. You aren’t a good person,” Her face falls, “But you could become one.”\n\n \n\nShock quickly replaces the anguish and she leans forward.\n\n \n\n“You’ve hurt me, but you’ve also been a good hero. I replaced Rena because I couldn’t trust her civilian self any longer, either as Marinette or as Ladybug, but I’ve never really been able to trust you as Marinette, even if I suppose I can as Ladybug. And because of that, I’m not going to replace Queen Bee - but now that you know my identity, I need to know I can trust you as me.”\n\n \n\n“I.. thank you, Marinette. I’ll become a better person, I’ll be worthy of your trust, I promise.” Chloe swore.\n\n \n\nMarinette nods, Tikki giving her an approving smile from her purse, and pauses with her hand on the door.\n\n \n\n“Would you like to hang out with my friends and I on Saturday?”\n\n \n\n \n\n\nKagami opens the door to the bakery at precisely three in the afternoon that Saturday, and is promptly bowled over by Apollo, who grins and leads her behind the counter, past a large man that smiles and waves at the register and up into the apartment.\n\n \n\n“Kagami! Hello!” \n\n \n\nKagami glances over to greet Marinette and stops dead in her tracks.  She, Claude and Allegra, as well as another blonde girl she’s sure she recognises but can’t place, are gathered around the kitchen counter, laden with cookies, icing bags in hand. Marinette is smiling, hair tied back into a bun, with a pale pink blouse and pleated white skirt. The ensemble suits her, and Apollo has to nudge her to get her moving again. Kagami greets her friends, and can’t help the small feeling of satisfaction when Marinette moves aside to make room for Kagami at her side.\n\n \n\n“Sabine and Nette are teaching us how to decorate cookies!” Claude explains, showing off an… interesting looking design of blue and green swirls.\n\n \n\nKagami glances at the girl she doesn’t recognise, and Marinette fills in.\n\n \n\n“Oh! Kagami, this is Chloe. She’s an old classmate of mine - she and I are starting over, I guess?”\n\n\nThe girl, Chloe, gives her a hesitant nod, before returning to her board of cookies - Kagami notes that all of her designs seem to be bee themed for some reason.\n\n\n\n\n“And this is my mom!”\n\n \n\nMarinette motions to a kind looking woman, who smiles and brings over two more boards for Apollo and Kagami to use.\n\n\n\n\n“Thank you, Mrs Dupain-Cheng.”\n\n \n\n“Oh, please, dear. Call me Sabine.”\n\n \n\nKagami nods, and picks up a bag of pink icing hesitantly.  Baking, and decorating, was \n\nnot \n\nher forte - though by the looks of things, the only one whose forte it was was Marinette’s. The girl in question happily adjusts the position of the bag in Kagami’s hands, presumably oblivious to the way she short circuits Kagami’s brain and to the knowing smirk Allegra shoots her way.\n\n \n\nThey decorate in amicable silence - Claude, predictably, is the first to break it.\n\n \n\n“So Nette, did you make that outfit?”\n\n \n\n“Yep! Finished it last night - it’s not my usual style but I like it.”\n\n \n\n“It suits you - you look very nice Marinette,” Kagami says, “You are a very talented seamstress - I would not be opposed to wearing a design of yours at my competitions should the rules allow it.”\n\n \n\nMarinette drops her icing bag onto the table and stammers,  cheeks red. Apollo mutters something along the lines of \n\nyou didn’t have to break her, K\n\n under his breath while Allegra tries and fails to stifle a giggle.\n\n \n\nIt’s evening when they leave, all with carefully tied boxes of cookies under their arms. Kagami gives Marinette a quick hug before she leaves, that small satisfied feeling swelling up when she blushes and stammers through her goodbye. She settles into the seat of the car, smiling to herself. She never hesitates, and Marinette is a much worthier target. \n\n \n\nShe doesn’t look back at the bakery, though. But maybe she should have - she would have seen the storm on the horizon.\n\n \n\n \n\n\nChloe is the last to leave, blinking as Marinette’s dad passes her another box to put in her limo. They eventually drift upstairs, and Chloe turns to Marinette, whose cheeks are still pink.\n\n \n\n“So… you and Kagami, huh?”\n\n \n\n“W- What? I… I don’t know what you’re talking about Chloe.” \n\n \n\n“Uh huh..” Chloe doesn’t buy that for a second, but she drops it, heading out the door to drop the last box in. She turns to say a last goodbye to Marinette when a shriek catches both of their attention.\n\n\n\n“What. The. Fuck?!”\n\n \n\nStanding there, looking royally pissed off, is Alya.\n\n \n\nMarinette’s eyes dart towards the bakery doors, but Alya marches forward before she can act.\n\n \n\n“Oh no. Hell no. You are not running away from this Marinette! I don’t understand you anymore! First you act like a raging bitch to Lila, then you leave because you can’t get Adrien, and now you’re hanging out with Chloe? You’ve not returned \n\nany\n\n of my calls, girl! Come on, I thought I knew you better than this.”\n\n \n\n“I thought I knew you better too. I haven’t returned your calls because I blocked you, Alya, and all that outburst has done is prove I made the right choice. This was never about Lila, and I fell out of love with Adrien long before I left DuPont. Lila is a liar, and one day you will all realise.”\n\n\n“Lila isn’t a liar, you’re just jealous!”\n\n\n“A quick google search would disprove half of her claims. But I have put that behind me now. You dumped me, all of you, for a compulsive liar, and I will not be there to pick up the pieces when you realise that. Now, leave. You are not welcome at this bakery.”\n\n \n\nAlya’s face goes red, and Chloe pulls out her phone just in case she either has to call the police or put up an Akuma alert because honestly she’s not sure which one’s more likely at this point.\n\n \n\nAlya opens her mouth a few times but nothing comes out, and just as quickly as she stormed up she storms off. Chloe looks between her retreating figure and Marinette, whose eyes are glassy, and her worried looking parents who obviously came to investigate the yelling behind her, and gives her former enemy a quick hug before getting into her limo.\n\n \n\nThe second Chloe’s limo disappears around the corner Marinette turns on her heel, pushes past her parents, walks into her room, sinks down onto her chaise, and cries.\n\n\n\"En garde! Prêts? Allez!\"\n\n \n\nKagami slipped around Claude’s defense and landed her eighth and final point of the match. She removed her mask, moving to shake Claude’s hand as the blond removed his own, his eyes gleaming as the referee read out the score: 8 - 6. He had been close this time, and yet she knew neither the loss nor the closeness of the score would faze him. That was just the way Claude was.\n\n\n\n\n\n“Nice job, Kagami!” He tucks his mask under one arm. “Looking to impress, are we?”\n\n \n\nKagami follows his cocky grin to where Marinette, Allegra and Apollo are sat, watching the various matches. Allegra and Apollo’s gazes are wandering between those still fighting.\n\n \n\nMarinette’s gaze is very firmly fixed on her. Her eyes widen when she realises the pair are staring back, quickly averting her gaze to a pair Allegra is watching.\n\n \n\n“She’s been watching you this entire time, y’know.” Claude teases, before jogging off to the trio, presumably before Kagami can kill him.\n\n \n\nKagami rolls her eyes at his retreating back and follows. And if she stretches a little just to see Marinette’s reaction, who can blame her?\n\n \n\nThere was a storm in Ms Bustier’s classroom that morning, and Adrien could only watch it stew in the seat of one Alya Cesaire.\n\n \n\nHis friend was \n\nseething\n\n. A glance at Nino proved he had about as much idea as to what was upsetting Alya as he did.\n\n \n\n“Um.. Al? Babe? Talk to me.”\n\n \n\nIt takes a minute or so for Alya to speak, but with twenty minutes to spare before Ms Bustier typically arrives and twenty five before the start of class, as well as the anger emanating from her eyes, neither boy is inclined to press her.\n\n \n\n“I went to see \n\nher\n\n. Last night.” Alya jerks her head to the back of the classroom.\n\n \n\nNino and Adrien share a look of understanding. Alya had gone to see Marinette.\n\n \n\n“So, what happened?” Adrien is almost hesitant to ask\n\n \n\n“She was hanging out with Chloe!”\n\n \n\nAdrien takes advantage of Nino pressing for details to sneak a glance at the blonde in question. Chloe arrived during the commotion, sweeping past the class to settle at the back. She meets his gaze for a fraction of a second before staring down at her notebook. He frowns, and turns his attention back to Nino and Alya.\n\n \n\n“ - and I can’t believe she’d do this!”\n\n \n\nIt sounds like Alya’s just finished ranting, but she’s looking at Adrien expectantly like she’s waiting for his response. Crap.\n\n \n\n“I’m sure she’ll come around Alya - to this, to Lila, to everything,” He smiles, hands raised in a pacifying gesture, “I’m sure she just needs time to get over every- \n\nouch!\n\n”\n\n \n\nAlya and Nino look at him with concern, but he gives a flimsy excuse and heads to the bathroom. The second the door shuts behind him, he angrily glares inside his jacket.\n\n \n\nInside, Plagg has stuck his claws through Adrien’s shirt and is hanging on tightly. He looks angrier than Adrien has ever seen him.\n\n \n\n“I’m sure she just needs time to get over everything?” Plagg repeats, scoffing and flying out of the jacket before Adrien can catch him. “Need I remind you \n\nLila \n\nis the one in the wrong here?”\n\n \n\n“What are you talking about Plagg? Lila’s lies aren’t hurting anyone.” Adrien answered shortly, narrowing his eyes at the Kwami.\n\n \n\n“Tell me, Adrien. How does Hawkmoth akumatise people?”\n\n \n\n“What?”\n\n \n\n“Answer the question, kid.”\n\n \n\n“He… preys on people’s negative emotions?”\n\n \n\n“Yes. Emotional hurt - caused by lies! Lies can cause akumas!”\n\n \n\n“Oh please. Since when have lies ever caused an akumatisation?”\n\n \n\nPlagg narrowed his eyes, flying close to Adrien’s face.\n\n \n\n“One word, kid. Copycat.” He hissed. “When you decided to lie about you and Ladybug being together, you caused that sculptor to get akumatised.”\n\n \n\n“That doesn’t mean anything, Plagg! It doesn’t change the fact that Lila’s lies aren’t hurting anyone!”\n\n \n\nPlagg scowled, glaring at his Chosen.\n\n\n\n\n\n“How can you be so blind? Did you not see the way that Alya was talking about bakery girl? Lila’s lies did that!”\n\n \n\n“No, Marinette did that.”\n\n \n\nPlagg’s mouth dropped open for a brief moment before he snapped it shut and sent Adrien the most scathing glare he could muster.\n\n \n\n“Ladybug would be disappointed in you.”\n\n \n\nAdrien snarls. They’ve had this conversation before and it usually almost ends the same way, with them not talking to each other for a few days. But Adrien is angry and Plagg is looking smug \n\nas if he’s right what does he know\n\n and he snatches the Kwami out of the air and hisses at him to\n\n stop talking\n\n, stuffing him unceremoniously back in his jacket and heading out of the bathroom.\n\n \n\nHidden beneath the fabric, Plagg runs a paw over the space where his mouth used to be and wonders what it will take to get through to his Chosen.\n\n\n \n\n \n\nBack in the classroom, Alya feels her mood slip from bad to worse when Ms Bustier allows the class to see news footage of the new fox hero. She and Kasai has been seen, though not at the same time, for the two most recent Akuma attacks. \n\n \n\nShe watches Melodie wave shyly to the camera before bounding after Ladybug, Chat departing the other way with his signature wink and salute. She thinks back to his parting comment, the offer of an interview. Ladybug was still ignoring her, and Chat was seemingly cool about everything. It was \n\ninfuriating, \n\nit was -\n\n \n\n“- right, Alya?”\n\n \n\nShe starts at her own name and looks down to the front row. Rose is beaming up at her, and Lila is smiling, cheeks red as she twists back to see her too.\n\n \n\n“Um, sorry Rose, I didn’t catch that.” Alya apologises\n\n \n\n“That’s fine, Alya! I was just saying that Lila looked really happy to see Melodie in the news!” Rose says, and Lila ducks down, looking almost shy.\n\n \n\n“Are you a fan, Lila?” Sabrina asks, forever eager.\n\n \n\nLila deliberates for a second, (almost) the entire class waiting on her answer. Then, she beams, and opens her arms wide.\n\n \n\n“I’m not really supposed to say anything, but I know I can trust you guys! The reason I’m so happy to see Melodie in the news is because,” She drops her voice, “I’m just so glad that Ladybug gave me the Miraculous back from that ridiculous faux fox!”\n\n \n\nIt takes a second for Alya to register the words. \n\n \n\n… Ridiculous? \n\nFaux fox?!\n\n\n \n\nNino squeezes her hands hard under the table, and she’s the first to speak, fighting to keep her voice even.\n\n\n\n\n\n“What are you talking about Lila?”\n\n \n\nLila beams at her, completely oblivious to the war she’s sparked inside the reporter.\n\n \n\n“I was Rena Rouge!”\n\n\n“I used to be Rena Rouge!”\n\n \n\nIt takes everything in Alya not to freak out. \n\nSince when?\n\n Chloe scoffs audibly, and Lila tilts her head, smiling sweetly.\n\n \n\n“Yes, Chloe! Ladybug gave me the fox, because we’re such good friends! My debut was with those awful multiplying demonic akumas, remember? Afterwards, though, I had to give it back to Ladybug because of my travels with my mother. She gave it to some brat that \n\ncompletely\n\n destroyed the reputation I’d built up as Rena, so I changed my persona to Melodie so Paris wouldn’t think I was the same person!” She laughs at that, and Alya feels her heart sink to the floor.\n\n \n\n\n….She’d destroyed her reputation? \n\nHad she really been that poor of a hero? She’s desperately trying to stop the shake in her hands when Nino speaks up.\n\n \n\n“...Multiplying demon akumas? You mean Sapotis? Alya’s sisters?” \n\n \n\nLila’s face falls briefly, and she turns to Alya.\n\n \n\n“Oh no! Alya, I didn’t mean to insult your sisters like that, I’m so sorry! It was just such a hard akuma and I…”\n\n \n\nAlya doesn’t pay attention to the rest of the sentence.\n\n \n\nLila said her debut was Sapotis.\n\n \n\nBut that wasn’t right.\n\n \n\nSapotis had been \n\nAlya’s \n\ndebut.\n\n \n\n\nAlya \n\nwas the Fox hero - the \n\nonly\n\n Fox hero. She always had been.\n\n \n\n“I thought you were still travelling when Sapotis happened, Lila?” \n\n \n\n“The fox can do illusions, Sabrina!” She beams, “So I was able to help from afar, but it took so much energy and I can only do so much, so I gave it back to Ladybug so she could have someone to help her more often!” \n\n \n\nThe class match her smile, murmuring praises and affections.\n\n \n\nChloe scoffs again.\n\n \n\n“And why tell us? I can say from personal experience that’s a poor move.”\n\n \n\n“Well, Chloe, you told all of Paris. I can trust my friends in here, right?”\n\n \n\nThe class murmurs their agreement.\n\n \n\nAlya feels like she might be sick. She stands suddenly, ignoring the concern from her classmates, and pushes her way out of the room, purposefully ignoring Ms Bustier calling after her. She locks herself in a bathroom stall, pulls out her phone, and brings up Google.\n\n \n\n\nLila Rossi\n\n\n \n\n\nLila Rossi Jagged Stone\n\n\n \n\n\nLila Rossi Jagged Stone Airport\n\n\n \n\n\nLila Rossi Jagged Stone Airport Kitten\n\n\n \n\n\nLila Rossi Stephen Spielberg\n\n\n \n\n\nLila Rossi Achu\n\n\n \n\n\nLila Rossi Achu Prince Ali.\n\n\n \n\nThe only link with her name, staring Alya right in the face as though it's taunting her, is her Ladyblog interview. She brings up a hand to cover her mouth, the screen blurring in front of her.\n\n \n\n\nA quick google search would disprove half of her claims. But I have put that behind me, now. You have dumped me, all of you, for a compulsive liar, and I will not be there to pick up the pieces when you realise that.\n\n\n \n\nMarinette’s words repeat over and over again, like a burning mantra in her brain.\n\n \n\nOh God.\n\n \n\nOh \n\nGod.\n\n\n \n\nShe replays the last school year in her mind. Linking arms with Lila as she not-so-accidentally shoves against Marinette in the hallway, snickering when stumbles and the books in her hands fall to the ground.  Repeating every subtle dig and insult until the entire class was saying it too. Revealing her crush to the school just to embarrass her. Pushing her up against the wall and yelling at her, following it up with vicious texts that she \n\nknows the girl read, and oh god what the hell is wrong with her some reporter she was why did she ever believe -\n\n\n \n\n“Alya?! Alya, are you alright?”\n\n \n\nIt takes a few minutes for her to register Rose’s voice, and she opens the stall shakily. \n\n \n\nRose hands her tissues, and it’s only then she realises that she’s crying.\n\n \n \n\nKagami really wants to throw something.\n\n \n\nAnd right now, Adrien Agreste is looking like a wonderful target.\n\n \n\nHis heart isn’t in training today, and as much as she wants to hate him for hurting Marinette, she also wants to have a somewhat productive fencing lesson, especially with a tournament just weeks away. So she sighs, grabs the blonde by the wrist, ignoring his squeak of surprise, and marches away to a hallway where they won’t be disturbed.\n\n \n\n“Spill, Agreste.” She crosses her arms, dropping her mask down on a bench, and waits.\n\n \n\nIt takes a minute, but eventually, Adrien removes his mask, though he, infuriatingly, still won’t look her in the eye. She says nothing, just raises an eyebrow. \n\n \n\n“I feel like you’re mad at me.” He eventually admits, and she can’t stop the snort that escapes her.\n\n \n\n“How observant of you, Adrien. I \n\nam\n\n. What I would like to know, however, is if you \n\nknow\n\n what exactly it is I am mad at you about?”\n\n \n\nAdrien wrings his hands together nervously.\n\n \n\n“Marinette?”\n\n \n\n“Marinette.” She nods.\n\n \n\n“I just didn’t want any trouble, you know that, right? Exposing Lila wouldn’t have made her any better. She got akumatized when Ladybug called her out, if Marinette did the same Lila would just get akumatized again.”\n\n\n\n\n“So it’s only\n\n Lila \n\ngetting\n akumatized you’re worried about? Lila, in general?”\n\n \n\nAdrien finally looks her in the eyes then, but she holds a hand up before he can protest.\n\n \n\n“No, do not try to deny it. Marinette has been almost akumatized four times because of Lila, and the fact that Ladybug and Chat Noir have not had to face off against her yet is a testament to her brevity and courage. And yet, she should not have to. She told me how you promised her that you were in her corner, but when the class started to turn on her, you were hiding in with the bullies,” She scoffed, “It seems I was right to call you a coward. You should have supported her.”\n\n \n\n“But - !”\n\n \n\n“Shut. Up.” Her tone was icy.\n\n\n\n“And not to mention, Adrien, you should have supported not just Marinette, but your class as well. Nino is your best friend, no? How do you think he will take the news that you simply allowed Lila to make fools of everyone and taint their opinions of their ‘Everyday Ladybug’, to the point where they gleefully chased her out of the school? Your inaction will cause everyone to hurt just as Marinette has.”\n\n \n\n“But they didn’t believe her from the start!” Adrien cries, “And if they didn’t believe their ‘Everyday Ladybug, why would they believe me? They’d turn on me too!”\n\n \n\nEvidently, that had been the wrong thing to say. \n\n \n\nIf looks could kill, Adrien Agreste would be a dead man.\n\n \n\n“I see,” Kagami is fuming, “So you’re fine with watching everyone be played for fools, with your friend being belittled and chased out of school, as long as you are not caught in the crossfire?  You \n\nare \n\na coward, and a selfish one at that, but allow me to break your little bubble of complacency. You are already \n\nin\n\n the crossfire. Lila’s lies will be exposed, maybe not by Marinette, maybe by herself, but it will happen. It will come to light that you knew all along. Enjoy the high road while it lasts - it will not be enough to save you from the hole you’re digging yourself.”\n\n \n\nKagami snatches up her mask and leaves, focussing on a memory of Marinette laughing to keep black butterflies away.\n\n\nTo say Marinette was surprised to see Apollo and Chloe at her kitchen table that morning was an understatement.\n\n \n\n“Morning, Nette!” Apollo chirped, happily snacking on the pastries that her parents had presumably provided.\n\n\n\n\n\n“What are you guys doing here?”\n\n \n\n“We need to talk, Marinette,” Chloe said, and Marinette would have been worried by the tone if not for the teasing grin on her face, “about you and Kagami.”\n\n \n \n\n“About me and Marinette?” Kagami asks, bewildered.\n\n \n\nAllegra and Claude nodded in unison, sprawled on her bed as if they’d been there all along and hadn’t barged in five minutes prior. \n\n \n\n“What about us?”\n\n \n\n“Welllll…..” Claude draws out the word, eyes bright, “We’ve seen the way you look at her, K! Annnnnnd we’ve seen the way she acts around you..”\n\n \n\nKagami \n\ntsks\n\n and nudges Claude into a position more befitting of a human being.\n\n \n\n“I know my feelings for Marinette. You do not need to question me.”\n\n \n\nAllegra pouts, and Kagami sighs. Clearly they want her to elaborate, though if she’s being completely honest with herself, Kagami never needed a reason to talk about Marinette.\n\n \n\n“..Fine,” She relents, and Claude throws his arms up in victory, “Marinette is.. many things. She is sweet, and kind, giving me a second chance as easily as she did after how callously I acted. She is brave, and courageous - did she ever tell you how she managed to keep an akuma from reaching her, her first day at our school?”\n\n \n\nAllegra and Claude gawk at her, and she instantly knows she’s not seen the last of \n\nthat\n\n particular incident.\n\n \n\n“She is talented, and quite pretty, to boot. Just because I have not won her over yet, does not mean I do not ever intend to. I never hesitate, but it is more difficult when I do not know how she feels about me.. Or about girls in general.”\n\n \n\n“I don’t think you need to worry about that, Kagami.” Allegra’s eyes twinkle as she stares down at her phone, a text from Apollo on the screen.\n\n \n\n\nSpace Cadet: Marinette’s been repeating “I have a crush on Kagami” for five minutes over and over\n\n\n \n\n\nAllegra: Isn’t that good?\n\n\n \n\n\nSpace Cadet: It is. :-P I wish you’d have seen her talk herself through it, it’s obvious she’s been thinking about it, comparing it to crushes she’s had before.\n\n\n \n\n\nSpace Cadet: So how’s Kagami?\n\n\n \n\n\nAllegra: Claude is offering to “purposely look bad” at fencing so that K can impress Marinette.\n\n\n \n\n\nSpace Cadet: Kagami could kick his ass any day of the week, what\n\n\n \n\nAllegra chuckles, and slips back into the conversation.\n\n \n \n \n\n“So… are you going to tell your parents?” Apollo asks, lounging on the chaise.\n\n \n\n“They sort of already know. Papa said Kagami’d be a lovely addition to the family. Maman was quieter about it,  but said Kagami seemed sweet, and if I was happy, then so was she.”\n\n \n\n“I suppose it may have been a little obvious, considering you’ve replaced all those photos of Adrien with ones of Kagami~” Chloe grins as Marinette shot her a betrayed look.\n\n \n\n“\n\nGroup \n\nphotos, Chloe, \n\ngroup photos. \n\nThere’s a difference!” She pouts.\n\n \n\nIt’s still strange to her, Marinette thinks, having Chloe around like this. Then again, her life had gone down several twists she never thought she’d take, and having Chloe Bourgeois was actually one of the least shocking.\n\n \n\nQuestioning when she’d crossed the line from a crush into somewhat of an obsession had been one of the most, but she was glad she had realised. The schedule, the gifts, the photos in every crevice of her room… It was embarrassing to think about, now, but it had been the reason behind why Marinette had been so confused about Kagami.\n\n \n\nKagami was pretty. After dealing with Adrien’s passive nature, the fire in her soul was refreshing, and she couldn’t deny the warmth in her heart whenever she did something to make the girl smile.\n\n \n\nBut it had felt nothing like how she had felt about Adrien, which given recent circumstances she wasn’t even sure how she felt about him now.  Though, as Chloe had pointed out, she never really knew Adrien. Not really.\n\n \n\nAnd that was the difference, she had realized. Adrien was nice, she knew that, but time and circumstance meant they never got to really get to know each other. He was almost unobtainable, and besides, the level she’d gotten to was “utterly unhealthy”.\n\n \n\nShe understood far better now. \n\n \n\nShe had loved Adrien. But an idea - the perfect Sunshine Boy. It had taken Lila for Marinette to spot the cracks in her own facade, and after that everything had crumbled.\n\n \n\nAnd yes, Kagami had flaws. Of course, she did. Marinette wasn’t going to make the mistake of putting someone on a pedestal like \n\nhim\n\n ever again. \n\n \n\nBut she loved her anyway. The girl who turned away slightly when Apollo or Claude dropped in with a terrible pun, so that nobody could see she was hiding a wry smile, unwilling to give either of them the satisfaction of her laughter. The girl whose eyes shone fierce with determination, no matter what. The girl who fought hard for her friends. Who ran a hand through her hair whenever she was frustrated in class. Whose reputation as the Ice Queen was wholly undeserved, because she was warm and kind to those who bothered to get to know her.\n\n \nAnd she did actually know her. That was the difference.\n \n\nApollo snapped his fingers in front of her face, startling her.\n\n \n\n“Hello? Earth to Mari? Chloe and I have to go.”\n\n \n\n“Oh! Sorry, yeah, right… Got distracted a little..yep..” She trails off, painfully aware of the redness on her cheeks and the knowing grins from her friends.\n\n \n\nShe walks her friends through the bakery and out to their cars. Her phone buzzes as they pull away, and she can’t help but smile as she saw what was on the screen.\n\n \n\n\n[Message from ‘Kagami &lt;3’]\n\n\n \n\n---\n\n \n\nDinner was a quiet affair at the Tsurugi household that evening. Claude and Allegra had left a few hours prior. Kagami glanced at her mother, poised as usual, and sighed. It was as good a time as any.\n\n \n\n“Mother. There’s a girl at my school that I-”\n\n \n\n“You wish to court, yes?” \n\n \n\nShocked, Kagami looked at her mother to see her send a small smirk in her direction.\n\n \n\n“How?”\n\n \n\n“Your friend Claude, quite loud isn’t he? Tell me, do you think this girl is a good fit for our family?”\n\n \n\n“I do. Marinette is very capable and I am very fond of her.”\n\n \n\nTomoe Tsurugi hummed, and after a few moments spoke up.\n\n \n\n“I would like to meet this Marinette. Invite her to next week’s fencing tournament, with the D’Argencourt Academy. If she cannot attend, find out her availability and I shall clear a spot.”\n\n \n\n“Yes, mother.”\n\n \n\nKagami smiled, and returned to her dinner. Today was shaping out quite nicely, after all.\n\n \n \n\n“Your fencing competition? Yeah, dude, you know I’ll be there!” Nino grinned and slung an arm around Adrien’s shoulder, “You coming too, Al?”\n\n \n\n“Coming to what, guys?” Lila cuts off Alya’s response, sidling up far too close for comfort to Adrien.\n\n \n\nAdrien sees a shadow of \n\nsomething\n\n flicker across Alya’s face when Lila appears, but it’s gone as quickly as it appears, and he writes it off.\n\n \n\n“Adrien’s fencing team’s got a competition next week, you coming along Lila?”\n\n \n\nLila grins.\n\n \n\n“Oh! I’d love to, thanks!”\n\n \n\nAdrien smiles politely, and the four said their goodbyes and went their separate ways. Adrien settled into the back of his car, tuning out Nathalie’s explanation of that afternoon’s photo shoot.\n\n \n\nHis day had been good, and his friends were coming to support his tournament.\n\n \n\nWhat could go wrong?\n\nAdrien slipped his mask over his face with a sigh.\n \nKagami was still avoiding him, and her sudden iciness had not gone unnoticed by the rest of the team. Worse still, it seemed to have spread, as the others seemed to have been shorter and shorter with him recently. \n \nHe stepped out of the changing room and moved towards the side of the makeshift arena, waiting for the competition and the teams to be introduced, and looked around the stadium. \n \nNo sign of his father, of course. But he could see Nino, and Alya, and Lila towards the side. If he looked up at the center, at the very top of the rows, he could see Kagami’s mother, a few other students that he believed attended her school, Marinette happily chatting away with what looked like a banner in her hands, a few other family members of his fellow fencers-\n \nWait.\n \nMarinette?\n \nBefore he could wonder what she was doing sitting with Kagami’s party, D’Argencourt put a hand on his shoulder and beckoned him forward. Time for the first match.\n \n \nKagami smiled, placing her mask carefully inside of her locker, before stepping out into the entrance hall. Allegra waved her down from where she, Claude, Apollo, Marinette and her mother stood, engrossed in conversation.\n \nMarinette noticed her approach, and immediately turned to her, her banner now poking out from her bag, beaming widely.\n \n“Kagami! You were incredible!”\n \nTo her immense surprise, her mother nodded.\n \n“Yes, Kagami. Your technique was impeccable. Slow to strike in your fourth bout, but nonetheless acceptable.”\n \n“Thank you, mother.”\n \nAs Marinette turned slightly to respond to Claude, Tomoe leant closer to Kagami, dropping her voice so that she couldn’t be overheard.\n \n“This Marinette is a good fit. You may court her.”\n \nKagami’s smile grew wider, nodding and stepping forward to place a hand on Marinette’s shoulder, who looked back at her and smiled. She resolutely ignored Apollo’s teasing smirk, and rolled her eyes at Claude’s snicker.\n \n“Marinette, that banner, it’s incred-”\n \n“Oh, Marinette!”\n \nKagami didn’t need to look at the shock and anger in Marinette’s eyes to know who had arrived. Yet she turned anyway.\n \nLila Rossi. The lying wretch that had caused someone dear to her so much grief. She stood with Alya and Nino - she noted that the former looked almost forlornly at Marinette, but she dismissed it. \n \nIt was too late for the girl to have opened her eyes.\n \n“Friend of yours, ‘Nette?” Claude asked, subtly moving to stand just ahead of Marinette, placing himself between the two girls.\n \nMarinette didn’t answer, or perhaps she would have, but Adrien, fool that he was, ran up at that point, and Lila immediately threw herself at him. Kagami’s lip curled in disgust, and she met her mother's eye, nodding at her questioning glance. Tomoe’s eyes narrowed. She had heard of Lila from Kagami, and knew what she had done.\nShe scowled, tuning back into the conversation.\n \n“I was so upset to hear you had left you know, Mari.”\n \n“Don’t call me that.” Marinette snapped, eyes narrowed, scoffing almost inaudibly at Lila’s faked cries.\n \n“Why not? I thought you were so nice, Marinette, but then you became so mean to us and then you just left instead of making anything better or apologising for what you did!” \n \nKagami noticed Alya flinch again, but she aggravatingly did not interject. \n \nHuh, it seemed Adrien was not the only one complacent in the girl’s lies.\n \n“I don’t believe you.” \n \nKagami moved to stand before them, looking the liar in the eyes.\n \n“Take your lies elsewhere, they are not wanted here.”\n \nShe ignored the girl’s pitiful attempts at rebuttal, turning to place a gentle hand on Marinette’s shoulder.\n \nTurning her back on the enemy was a mistake.\n \nLila pretended to trip, stumbling towards the pair. Taken unaware, Marinette yelped when Lila fell against her, and Kagami slipped an arm around her waist to keep her steady. She fought a blush rising at having the girl so close, until Lila stepped back, paper in her hands.\n \nWait.\n \nPaper?\n \nMarinette came to a realisation as quickly as Kagami did, only a quick glance down at her bag necessary to confirm it. Lila had used her fall as a cover. \n \nLila spouted her false apologies, but all Kagami could do was stare at the scraps of the banner Marinette had worked so hard on in the liar’s filthy hands. \n \nHer hands clenched, her breathing getting shallower.  She picked up a strand of the paper, a carefully designed  K  visible in the scrap. Marinette had made that for  her . She had worked so hard on it, she had poured her heart and soul into it.\n \nThe  nerve of that brat!\n \n\n The nerve, indeed. Défenseure, I am Hawkmoth. I will help you defend the one you love from the liar who continues to hurt her.. \n\n \nShe was vaguely aware of Marinette calling out for her, even as she accepted Hawkmoth’s proposition. \n \nHer voice was the last thing she heard before everything went dark.\n \n \n \n \n“Pound it!” \n \nChat waved as Ladybug swung away, the last dot beeping precariously on her earrings. He turned to Kagami, offering a hand to help her stand.\n \n“Thank you, Chat Noir.”\n \nHe nods, brings her to the entrance of the stadium and disappears over the roof, landing in a back alley.\n \n“Claws in” He breathes, and detransforms.\n \nPlagg doesn’t say anything, zipping into his jacket for cheese.\n \nPlagg doesn’t say anything much, lately.\n \nHe returns to the entrance of the stadium, watching Kagami rejoin her friends, Marinette among them. Marinette wrapped Kagami in a hug, and he felt a pang of sadness as she and the others left, Allegra handing Kagami’s equipment to her.\n \nMarinette met his eyes as he stepped forward, and the smile on her face was quickly replaced by a small frown, before looking away, Kagami slipping an arm around her waist.\n \nThe group ignore him as they pass, though the other girl looks at him disdainfully as she walks.\n \nThe pain in his chest lingers, even as Nino wraps him in a hug, even as dinner passes, as night falls and he’s pacing in his room, wondering when everything changed so suddenly.\n \nWondering whether he had been right.\n \nHe stops at the window, and looks out in the direction he knows Marinette’s bakery is.\n \n“Plagg, claws out!”\n \nHe lands on her balcony, knocking on her trapdoor to alert her, sketching something on her chaise.\n \nHer head pops out a moment later.\n \n“Chat? Is everything okay? Is there another akuma?”\n “Just wanted to see my  fur vorite civilian,” He grins, striking a dramatic pose on her railing, “Would you be so kind as to let this alley cat in?”\nMarinette rolled her eyes, but let him in anyway, saying something about snacks from the bakery and disappearing through her trapdoor.\n \nHer room was a lot different than he remembered. There were no more photos of him, for one. Anywhere. There were still photos though, and looking at the collection on the wall, he noted that Kagami featured in a lot. There was a large message board on one wall that he couldn’t recall seeing, full of loose sheets of designs and fabric scraps, scribbled notes and reminders. \n \n“Ok, I’m back! I got some leftovers from the bakery, if you want some?”\n \nMarinette smiled and offered him a croissant, laughing at the gleam in his eye as he gladly took it.\n \n“Noticed you redecorated, Princess, what happened with that boy? Anyone I need to deal with?”\n \nMarinette started, but she smiled and shook her head.\n \n“No, no, Chat. I’m in a much better place now. I was… having a lot of trouble at my old school, but you don’t need to hear about a civilian’s problems.”\n \n“Try me? I’m a  pur ety good listener,” He winked, “I thought you had a lot of friends at school?”\n \n“I  did , but then this new girl, she came with all these fantastical lies… When I tried to expose her, she threatened me, and then she made good on her threat. I lost all my friends, they started bullying me, and my crush? Adrien knew too, see,” She lets out a bitter laugh, the smile on her face slipping into a frown, “He knew, but he didn’t see a problem with it. These weren’t white lies, Chat, she was faking disabilities and using it to take advantage of people, getting them to do her work, carry her things. I couldn’t stand by and let my friends be manipulated, but I guess they weren’t really my friends in the end. Adrien said we were in it together, but he never stood up for me. I know he doesn’t have the best home life, but it would’ve been nice to actually have a friend at DuPont. A real one. I stopped loving him after that, and transferred over summer.”\n \nChat was struck silent. Eventually, he hugged her, not sure of what else to do.\n \n“I’m sorry, Princess.”\n \n“Don’t be, Chat, it’s not like you were there.”\n \n“Are you happier now?” He asks, feeling himself relax as a real smile returned to Marinette’s face.\n \n“I am, I really am. I have a great new school, wonderful new friends, and there’s Kagami too..” She trails off, blushing furiously.\n \nHe can’t help himself, a teasing grin on his face.\n \n“Oh? Does the princess have a new crush?”\n \n“Stop it, you,” She snickers, pushing him away, “She’s incredible. We got off on a rough foot way back when we first met, but we were able to make a fresh start when I transferred, and ever since we’ve been really close. She’s amazing, Chat, she’s so confident, and that Ice Queen reputation of hers is just a mask, she’s so sweet, and she’s a great fencer…” She continues to wax poetic about Kagami, and Chat smiles despite himself. \n \nShe sounded just like Ladybug. Ladybug had had similar issues in love, he’d heard about it from patrol, but had met a girl that seemed like a far nicer fit. He was happy for her, and had gladly offered to Cataclysm the first boy who had broken her heart. Sure, he loved her, but more than anything he was her friend, and partner. Plagg had really opened his eyes about that, back when they were still talking.\n \nIt’s getting close to midnight when Marinette yawns, and he decides to head home, smiling apologetically.\n \n“Sorry, Purrrincess, but this alley cat has a city to patrol. I’m glad you’re doing so much better now, and I hope you have more luck in love this time around!”\n \nWith a wave and a smile, he leapt off her balcony and into the night.\n \nThe smile slips as soon as she can no longer see him.\n\n“Allegra, you are \n\nnot\n\n helping!”\n\n \n\nStifling a laugh, Allegra dodges the shirt chucked at her, and holds out a discarded jacket.\n\n \n\n“How about this?”\n\n \n\nMarinette turns, taking the jacket and glancing over it with a critical eye, before shaking her head vehemently and dropping it. \n\n \n\n“Calm down, Nette, it’s a bistro, not a five star restaurant! Besides, Kagami will love whatever you wear.”\n\n \n\nMarinette groaned, flopping onto her chaise. \n\n \n\n“Marinette?” Her mother raps gently on the door, “Kagami’s waiting downstairs, sweetheart.”\n\n \n\nAllegra could only watch in disbelief as Marinette shrieked in surprise, grabbed an armful of clothes and disappeared through the door. She heard the slam of the bathroom door and shook her head, deciding to meet Kagami downstairs.\n\n \n\nTom was in the middle of engaging a very startled looking Kagami in conversation on Japanese pastries, whilst Sabine muffled a laugh behind one hand, and placed the other on her husband’s back.\n\n \n\n“Tom, dear, we talked about this.”\n\n \n\nHe laughed, stepping back, and allowing Sabine to admire the bouquet of azaleas and roses clutched in Kagami’s hand.\n\n \n\n“I’m here!” Marinette scrambled down the stairs, skidding to a stop just past the bakery counter. \n\n \n\nKagami smiled, offering Marinette the bouquet.\n\n \n\n“These reminded me of you,” She said, a fond lilt to her voice, “though I should have known that even the best of flowers would pale in comparison to you.”\n\n \n\n\nShe’s going to kill me..\n\n Marinette thought, painfully aware of her parents cooing behind her.\n\n \n\nTen minutes of her parents taking photos and fussing over the pair passed before Kagami’s driver came inside.\n\n \n\n“I’m sorry to intrude, but it is coming close to your reservation, Miss Kagami.”\n\n \n\nMarinette quickly waved goodbye to her parents and dragged Kagami outside.\n\n \n\n“Don’t be back too late!” Her father yelled as the door shut.\n\n \n \n\nKagami held the door open for Marinette to pass through, the host’s cheerful goodbye echoing into the night behind them.\n\n \n\n“It isn’t too late yet,” Marinette mused, glancing up at the sky and then down at a notification on her phone, “Andre’s been spotted nearby at the Seine, want to see if we can catch up with him?”\n\n \n\nShe nods, sending a text to her driver with the change of plans. She doesn’t bother hiding the smile on her face when Marinette slips her hand in hers and pulls her along.\n\n \n\nAndre is cheerful, calling out to the two with a gusto Kagami wasn’t sure anyone could sincerely have. His eyes sparkle when he sees their clasped hands, and he turns to Marinette with a twirl.\n\n \n\n“Dear Marinette! Such a sweet new love! Wonderful, just wonderful! Tell me, who is this that helped you find that love in your eyes? ”\n\n \n\n“This is Kagami,” Marinette smiles at Andre, who beams and produces two cones from his cart.\n\n\n\n\n\n“A pleasure to meet you, Kagami! And just for the two of you, an ice cream as sweet as your new found love! Chocolate, strawberry and white nougat! Enjoy!”\n\n \n\nAndre waves them across the bridge, and Kagami regretfully pulls her hand from Marinette’s to eat her ice cream before it melts.\n\n \n\n“So, he just doesn’t charge people for this?”\n\n \n\n“Not that I know of,” Marinette shrugs, “He’s got a whole thing about miracle love finding ice cream, I think it’d lose the magic if he charged people for it.”\n\n \n\n“That’s nice, but I don’t think I need an ice cream to tell me I love you.” Kagami smirks, and even so it takes her a minute to realise Marinette is stood as still as a statue, her face aflame and her mouth dropped open.\n\n \n\nA small ball of worry curdles in her gut when the girl goes one, three, five minutes without moving an inch, and she steps forward, slipping one hand onto her shoulder and the other underneath her chin.\n\n \n\nThe contact seemed to jolt her back to life, and she buried her face in her hands, an almost hysterical sounding giggle escaping.\n\n \n\n“Y-you, you can’t just \n\nsay\n\n things like that! You, you..” She trails off, and finally, \n\nfinally\n\n, looks Kagami in the eyes, and the raw vulnerability in her eyes squeezes around her heart like a vice, “..did you mean it?”\n\n \n\n“Every word. You’re wonderful, Marinette. You’re bright, and kind, and beautiful. I would have to be truly oblivious to not see you. To not see you and love you as you deserve to be.”\n\n \n\n\nI don’t know how he didn’t\n\n, she thinks, but she keeps that to herself. \n\n \n\nHer declaration works though - Marinette smiles, and takes Kagami’s hand in both of her own.\n\n \n\n“I.. I see you, too, Kagami.”\n\n \n\nThe true words may go unspoken, a stammering staccato in her head no doubt, but Kagami sees them in her eyes as clearly as the morning sky.\n\n \n \n \n\nMarinette floats into school the following morning, Allegra and Claude pressing for every detail. Her phone chimes, and Claude instantly perks up and peers over her shoulder when she tells them its from Kagami.\n\n \n\n\nKagami &lt;3: Shall I assume Claude and Allegra are as keen for details as Apollo is?\n\n\n \n\n\nMarinette: Yes! :D\n\n\n \n\n\nMarinette: Oh! Claude wants you to know he’s getting all the details from you after school at fencing!\n\n\n \n\n\nKagami &lt;3: Good. \n\n\n \n\n\nMarinette: ?\n\n\n \n\n\nKagami &lt;3: He’ll be easier to beat when he’s distracted. \n\n\n \n\n\nKagami &lt;3: Join me for lunch? X\n\n\n \n\n\nMarinette: Sure! Meet me by the art room? Xx\n\n\n \n\n\nKagami &lt;3: Of course.\n\n\n \n\n“For the new power couple!” Claude cries, pressing a fist against his chest in a mock salute and bowing dramatically, spilling out of his seat just as their teacher arrives.\n\n \n\nClasses pass normally enough until they reach the art room. Claude had dragged both Allegra and Marinette over to a corner to discuss his latest project when an angry yell bursts suddenly from the front of the room. Two students, stand face to face. She recognises one, Matthew, she thinks, a fellow art student who loved abstract art above all else. Matthew looks furiously at the other student, who simply shrugs and walks away. Allegra tried to calm him, but he slapped her hand away and stalked from the classroom as the bell rang.\n\n \n\nMarinette slips out of the classroom, leaning against Kagami with a sigh.\n\n \n\n“What was he so angry about?” She asks, and Marinette shrugs.\n\n \n\n“I didn’t hear, Claude was telling us about this new mask he’s designing and then-” \n\n \n\nA scream cuts her off, and she looks to the top of the stairs to see - \n\n \n\n“Matthew?” \n\n \n\n“Not anymore.” The akuma said, gesturing to his patchwork outfit, “I am Abstraction! You think you can insult my passion! You think the Louvre does not respect me? I’ll show you respect!”\n\n \n\n“Matthew!” The student from before darts out “I was kidding, man! Come on, please!”\n\n \n\n“I am \nAbstraction!\n” He snarls, darting forward and flicking a multicoloured ball in his direction\n\n \n\nWhen the dust clears, her classmate is frozen in place, his body contorted. \n\n \n\n“All of Paris will become the canvas for my abstract beauty!” The akuma crows, darting through the doors and out into Paris.\n\n \n\n\nTime to transform, just gotta sneak away!\n\n\n \n\nBefore she can even think of an excuse, Kagami grabs her arm tightly and takes off further into the school.\n\n\nShe sees Tikki send a concerned glance toward the transformed student as they’re dragged farther away.\n\n \n\nKagami stops just as suddenly as she started, and pushes Marinette into an empty classroom with one window already ajar.\n\n \n\n“Here,” She says, sounding satisfied, “This should be a safe place for you to transform.”\n\n \n\nMarinette tries to stammer out an excuse, but Kagami simply raises an eyebrow.\n\n \n\n“How.. How did you know?” She asks.\n\n \n“As I said before, Marinette,”  Kagami smiles, cupping her face in her hands, “It is impossible for me to not see you. In or out of the suit. Now, go. Paris needs you. And if you need Kasai, I shall remain here until you return.”\n \n\nMarinette nods, calling on her transformation. Emboldened, as she often is with a mask, she presses a kiss to Kagami’s cheek, and flies through the window towards the Louvre.\n\n \n\nChat crashes into her halfway there.\n\n \n\n“Whoops, sorry Ladybug! Abstraction is at the Louvre. He can do something strange with the people he turns into paintings, they play with your eyes,” He holds up his hand, two paw pads bright on his ring, “I need to recharge, but I think we could use a hand, or two!”\n\n \n\n“Good thinking, kitty. Recharge and meet me behind the Louvre, I’ll get our team!”\n\n \n\nWaving off her partner, she changes course.\n\n \n\nShe’s in and out of the massage parlour and back to the school in less than fifteen minutes, Fox and Dragon in hand. She tracks down Allegra first, and Melody hops up to wait on the roof while she swings back into the classroom Kagami was in.\n\n \n\nFreshly transformed, Kasai leaps from the window behind her and lands on the roof beside Melody.\n\n \n\n“All right guys. Let’s go find Chat and defeat Abstraction!”\n\n\nThe Miraculous Team land on the roof of the Louvre, Melodie leaning over the side to assess the damage.\n\n \n\nThere’s … a \n\nlot\n\n of people contorted, faces drawn in pain. One spots the heroes as they descend, and points towards the doors. Chat Noir sends him a grateful smile and the team slip through the door.\n\n \n\n“How do we find the Akuma?” Kasai whispers, brow furrowing.\n\n \n\nThe second she closes her mouth a group of screams ring out from a nearby exhibit, and the team rush through the entryway and hide behind a display, peeking over to see the Akuma standing in front of a group of students.\n\n \n\nMarinette’s old class.\n\n \n\nIt’s been long enough since she’s seen them that seeing them again is like a punch to the gut. Lila is front and centre, stammering when the Akuma demands she brings Ladybug to her. \n\n \n\nMélodie taps Ladybug’s shoulder, and places her flute to her lips.\n\n \n\n“\n\nMirage\n\n” She whispers, and a series of abstract paintings materialise. She whips them at Abstraction, who dodges just in time and tries to hit them out of the air.\n\n \n\nAbstraction is frantic, twisting and turning and it’s then Ladybug catches a glimpse of a ball of paper clutched in one hand. The Akuma.\n\n \n\nShe whispers quickly to Kasai and Chat, Melodie still successfully distracting Abstraction.\n\n \n\n“\n\nInferno!” \n\nKasai yells, and leaps at the Akuma, sword already ablaze. Abstraction yelps and jumps, the paper falling from his hand. He scrambles for it but Kasai is quicker, snatching it up and throwing it into Chat’s waiting Cataclysm. \n\n \n\nLadybug steps up, purifies the Akuma and casts her Cure, catching that attention of the class who cheer and clap.\n\n \n\nActions that abruptly end when Melodie stand behind her.\n\n \n\n“.. Huh?” Rose is the first to speak, eyes wide in confusion.\n\n \n\nThe look is mirrored on Ladybug’s face. Melodie had been all over the news since she started out, surely the class had heard?\n\n \n\n“Did you .. did you \n\nlie\n\n to us?” Myléne says next, and she’s talking to \n\nLila\n\n, Ladybug realises, Lila who looks like she’s trying to figure out how to spin this.\n\n \n\nIt’s Alya who steps up to Ladybug.\n\n \n\n“Ladybug, Lila told us all \n\nshe\n\n was Melodie, because you were friends..” Her explanation trails off after Melodie lets out a sharp scoff.\n\n \n\n“Melodie is not Lila. Lila has never held a Miraculous. We are not friends. It would be far too dangerous for Ladybug to have civilian friends and even if I did, I would expect them not to spread that information in case they catch Hawkmoth’s attention.” She’s thankful her tone isn’t cold, but it’s enough for the class to look towards Lila with betrayal in their eyes.\n\n \n\nAll except Alya, it seems, who just looks down at her phone as if she’s received confirmation of something she desperately didn’t want to be true.\n\n \n\nShe doesn’t get time to think more on that though - Melodie is down to two minutes and the rest of them aren’t too far behind. She picks up the freed student and waves to the class.\n\n \n\n“Sorry, but we really have to go. Bug out!” \n\n \n\nShe leaves just as they start yelling.\n\n \n\nChat leaps away with a wave, and the three of them get close enough to their school before Kasai drops into an alley and Melodie stops on a rooftop as they detransform. Ladybug safely sees the boy to the steps of the school - noticing last minute Claude and Apollo are standing together near the bottom, and doubles back. Allegra hands over the Fox with a grin before Ladybug helps her down, watching her run off towards the school before she lands in the alley next to Kagami, detransforming as well.\n\n \n\n“How are you feeling” Kagami asks, taking her hand.\n\n \n\n“I… I don’t know,” She murmurs, leaning into her girlfriend’s touch, “I guess, maybe, I thought that I would be happier when the class found out the truth about Lila. It’s not as cathartic as I thought it would be. They’re not being manipulated anymore, but..”\n\n \n\n“But it doesn’t change what they did to you.” Kagami finishes and Marinette closes her eyes, Tikki providing her own small comfort in the crook of her neck. \n\n \n\n“.. No, I guess not. Maybe one day. It depends, I think, if they come to see me, to apologise. Maybe in a letter though - I’ll tell my parents that I’ll allow that - I don’t think I can see them yet.”\n\n \n\n“If they are truly sorry, they will understand.”\n\n \n\nKagami presses a kiss to her forehead, and they step out of the alley hand in hand.\n\n "
}