{
    "id": "1828311",
    "url": "https://archiveofourown.org/works/1828311?view_full_work=true",
    "author": [
        "Yuu_chi"
    ],
    "title": "The Crown and the Crow",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Haikyuu!!"
    ],
    "relationships": [
        "Hinata Shouyou/Kageyama Tobio"
    ],
    "characters": [
        "Hinata Shouyou",
        "Kageyama Tobio",
        "Sawamura Daichi",
        "Sugawara Koushi",
        "Tanaka Ryuunosuke",
        "Tsukishima Kei",
        "Azumane Asahi"
    ],
    "additional_tags": [
        "Soulmates",
        "Alternate Universe - Soulmates",
        "Canon Compliant"
    ],
    "language": "English",
    "series": "",
    "published": "2014-06-22",
    "completed": null,
    "words": "8,973",
    "chapters": "1/1",
    "comments": "281",
    "kudos": "23,048",
    "bookmarks": "4,715",
    "hits": "225,591",
    "summary": "<p>Somewhere out there is your forever one wearing your Mark on their skin; it's just a matter of finding them.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n<a href=\"https://capshere.tumblr.com/post/138348353543/i-read-the-crown-and-the-crow-on-ao3-and-it\" rel=\"nofollow\">amazing Mark fanart by capshere over on tumblr! (thank you a lot, this is beautiful)</a>\n</p>",
    "text": "When Shouyou’s born it’s with beautiful red and gold on his collarbone, small on his sticky new-born skin and the lines not yet curled together like they’ll grow to be.\n“Oh,” His mother says the first time she sees it properly while cradling him close. “That’s not a name, is it?”\nAnd it’s not. It’s hard to tell what it is yet – what it will come to be – but it’s easy to see that it’s not a name in this language nor any other.\n“He’s starting off difficult already,” His father agrees with a sigh, pushing his glasses up his nose so that the words like ink on the back of his wrist catch the light, spelling Mariko in beautiful dainty purple in the same way the little inscription on his wife’s neck says Takashi.\n“My precious boy,” his mother sighs against his fluffy infant head as she rocks him in her arms. “You’re going to give us a world of trouble.”\nShouyou blinks at her blankly and coos, grabbing with chubby fingers at her blouse. His mother smiles at him and rubs one slender finger along the shapeless lines on his skin like she could will them to resolve themselves.\n“Takashi,” she says absently to her husband. “Still, don’t you think his Mark will grow to be quite beautiful? I’ve never seen one in colors like that before. ”\n“Well,” he ponders as he leans forward to smooth a hand along his son’s fat cheek. “They say those without names grow up to be blessed.”\nAnd that is how Shouyou comes into the world; in red and gold and ready to be blessed.\n.\nThey say it can take up to a decade for someone’s Mark to become clear, but Shouyou’s more or less flows itself together a week before his ninth birthday; a string of royal colors flush on his skin that makes everybody he surrounds himself with curious.\n“Don’t complain Shouyou,” His mother scolds the first time Shouyou asks for something to keep it covered with. “You’re unique, there’s no shame in that.”\n“You don’t understand,” he says awkwardly, rubbing at it with a finger. “I’m not ashamed of it. It’s just… I don’t like people staring at it all the time. I mean, it means I belong to someone, right? It doesn’t feel right to share it like that.”\nHis mother pauses in the middle of folding the washing and stares at him for a moment, her wide hazel eyes reflected back at her in the face of her son. Shouyou hesitates for a moment. “What’s wrong? Did I say something weird again?”\nHis mother blinks and shakes her head, like waking from a daze. “No, that’s not it.” She places the dress of his sister’s she’d been folding back into the basket and crouches so she’s at his own eye level, folding her skirts neatly into her knees. “It’s just that I forget you’re growing up so fast.”\n“Mom,” Shouyou says awkwardly and his face goes nearly as red as his hair. “It’s no big deal.”\n“No, no,” She says, rubbing a thumb along Shouyou’s cheek that is still fluff with baby fat and smiling at the way he wrinkles up his face at her. “You’re not wrong. If you don’t want other people to see it, that’s your right. It’s just a pity. It’s very lovely to look at.”\nShouyou frowns at that and moves to slap one hand over the crest. “It’s weird,” he almost snaps. “It feels like everybody else has a name but me.”\n“Shouyou,” his mother sighs, exasperated but patient because it’s not the first time they’ve had this conversation since Shouyou was old enough to understand about Marks and Soulmates. “Everybody’s Mark is different, okay? And they say having one without a name is a sign of good fortune.”\n“It’s weird,” Shouyou insists. “I have a picture and a word but no name.”\nHis mother pauses. “What do you mean a word?” She asks. Shouyou shuffles a little where he stands like a guilty child and casts his gaze everywhere but at her. “Shouyou,” she repeats. “What do you mean a word?”\nShouyou bites his lip before sighing and tugging his shirt collar a little to the side to show his mother the Mark just past the curve of his shoulder. “It’s been like this for a while,” he says. “I can’t read it. I don’t know what it means.”\nIt’s been a while since Mariko had looked at her son’s Mark in earnest. Shouyou was long past the age where she needed to help him change or wrestle him into the bathtub, and although he was admittedly clumsy and a little bit off-kilter on his own feet, he was also fiercely self-driven and independent.\nHis Mark was as she remembered it from the last time she’d gotten a close look – although heaven knows how long ago that was – but it was clearer now, much more woven together in its intricate red and gold, but it was the scrawl of barely legible writing beneath it that attracted her attention. It was wrapped so tightly along the symbol on his skin it was almost impossible to notice it unless one was looking for it.\n“Oh,” she breathes in surprise, tracing along it with a fingernail as she tries to sound out the foreign hiss of the letters.\n“What is it?” Shouyou asks as his mother huffs out sounds.\n“It’s part of your Mark,” she says after a moment, giving up and pulling back so she could drag Shouyou’s shirt closed again. “I haven’t seen one in a good long while. They’re not so common these days.”\nShouyou wrinkles his nose at her like she’s talking in riddles and Mariko realizes she might as well be. Her son is not quite nine and doesn’t yet know much about Soulmates and Marks. “It’s the meaning of your Mark,” she says and he just looks more confused. “The language has been dead for centuries by now, but those who were so lucky as to be Marked with a symbol instead of a name used to get an inscription to match.”\n“Oh,” Shouyou blinks. “And that’s what I have?”\nHis mother smiles and stands, ruffling his hair a little. “It looks like it,” she says. “Do you want me to try and have it translated for you?”\n“No,” Shouyou says, and Mariko realizes he’s already losing interest in the conversation. Her son’s attention is a lot like a flickering candle, and there’s no telling when the light of his interest will turn to shadow. “It’s alright, so long as it’s not weird I’m okay. I’m going out to play for a bit.”\n“Alright,” she agrees amusedly as she turns to go back to the washing, watching Shouyou scurry out of the kitchen in a flurry of hands and feet.\n“Oh!” He exclaims, rocketing to a stop at the doorway and grabbing at the frame for support as he smiles sheepishly over his shoulder at her. “Can I have something to cover it with now now?”\n.\nAs Shouyou grows up he almost forgets about his Mark altogether. His attention shifts to volleyball and tournaments and the sound his hand makes when he slaps a ball against the court. He could care less about this girly Soulmate nonsense. As far as he’s concerned twelve is much too young to worry about his future anyway, and his Soulmate will come when they come.\n“You’re incredible,” Izumi remarks one day as Shouyou focuses on the ball he’s bouncing on the heels of his wrists. “Aren’t you the least bit curious about your Soulmate? I mean, with a mark as unusual as yours they’ve got to be pretty extraordinary.”\nShouyou shrugs but doesn’t stop bouncing. “That’s all way off. Right now a Mark is just a mark. Anyway, are you sure you won’t come to the tournament with –.”\n“No,” Izumi says and that ends the conversation there.\n.\nShouyou meets Kageyama at his first ever tournament outside the bathrooms with anger making his brain numb and something unsettling that he pins as his nerves in the pit of his stomach.\n“I came here to win,” he declares with all the seriousness he can muster and for the briefest moment he swears he sees Kageyama’s eyes widen just a fraction but the subsequent blow off and the way he treats Shouyou like a kid playing pretend destroys any and all hopes of a good first impression.\nShouyou has never met somebody so arrogant in all his life, and when he hears him referred to as ‘King of the Court’ he can’t help but think it’s fitting. Not because the name is cool enough to make him squirm but because Kageyama is not. He’s somebody who seems so superior that even those who stand on even ground with him seemed cowed.\nShouyou pities his teammates something fierce and admits to himself that half the reason Kageyama makes him so furious is the way he takes everything around him for granted.\nShouyou would kill for a team – for somebody to toss him the ball and pat him on the back when he manages to spike it into the ground – but Kageyama treats those things like dirt, and something about that rubs him the wrong way.\n“I can’t stand that guy,” he mutters under his breath as they march into their starting lineups and Izumi shoots him a curious look from the corner of his eye but doesn’t say anything in return.\nThe referee blows the whistle and Kageyama hoists the ball up high.\nThe game begins.\n.\nAfterwards Shouyou clutches at the net and tries to breathe through the way his chest is too tight and his throat too small.\nIt’s nothing short of a slaughter – a massacre.\nIt’s not the first time Shouyou’s had his dreams thrown back in his face by reality. He can come back from this. In a moment he’ll go back to being the happy-go-lucky redhead that everybody expects him to be, but right now he just needs a moment to pull himself together.\nThere’s the sound of sneakers squeaking on polished maple floorboards and Shouyou looks up just as the net rattles to the sound of somebody on the other side leaning against it.\nIt’s Kageyama and for a moment Shouyou can’t do anything but stare because whatever words he wants to say stick strangely in the scrape of his throat.\nIt might be the first time Shouyou’s been close enough and calm enough to really look at him. He’s still tall and he’s still frightening, but there’s a look in his eyes that makes it even harder for Shouyou to catch his breath. It’s something furious and angry and Shouyou can’t quite figure out who it’s directed to.\nThe little scrap of gold and red on his collarbone burns white hot for a reason that he can’t explain.\n“You,” Kageyama hisses and it’s only the fear that keeps Shouyou from flinching. “Just what have you been doing for the past three years?”\nAnd that stings. Stings more than it should because Kageyama is just some stupid kid who he met a bare hour ago who doesn’t know how to share or play nice or anything about being a decent human being. It shouldn’t hurt – not something like that from someone like that – but it does.\nKageyama turns and heads back to the lineup but it’s a long moment before Shouyou can move.\n.\nShouyou spends the next year slapping balls until his palms bleed.\nHe still doesn’t have a team – nobody to toss him the ball or pat him on the back – but Shouyou throws himself into his training with a kind of mad fanaticism anyway. Every time he feels so exhausted he thinks his knees might give he remembers Kageyama’s face behind the shadows of the net and the sharp hiss of his voice.\n\nWhat have you been doing for the past three years?\n\nIt’s all the drive Shouyou needs to carry him through the rest of junior high. It carries him all the way through graduation and then enrollment in high school. It carries him right up to the gym door of Karasuno even.\nThe drive to beat Kageyama’s pretty boy face into the ground and make him recognize him propels him up until the second where that gym door rattles open.\nAnd then there’s Kageyama dressed in the exact uniform Shouyou’s wearing; shoulders curved and neck arched perfectly backwards as he leaps for a ball mid-serve.\n“You!” Shouyou shrieks as his visions of destroying Kageyama and his title of King of the Court fade into dust before his eyes.\nKageyama falters midflight, turning to look at Shouyou in amazement as his feet touch the ground again and the ball drops to hit him on the back of the head.\nShouyou wishes he could find that funny. It’s surprising how much he doesn’t.\n“You…” Kageyama mutters and for a terrifying moment Shouyou thinks that Kageyama has forgotten him, that while Kageyama had been the drive behind Shouyou’s mad flight to succeed he was barely a blip on the outside of Kageyama’s consciousness.\n“You probably don’t remember me,” he starts, a mix between awkward and angry, to which Kageyama cuts him off without missing a beat:\n“I do.”\nHe remembers him. Shouyou’s heart does something a little funny in his chest – like a volleyball spinning much too high across the air – but when Kageyama opens his mouth to spew out a verifiable landslide of insults it’s pretty much downhill from there.\nShouyou hates this guy.\n.\n“Oi,” Kageyama says during one of their evening practices while they prepare for the three-on-three. “Why do you want to play volleyball so badly?”\nShouyou is so surprised he misses the toss, wincing as it bounces badly off his arms and off to roll into the line of trees behind them. “Huh?”\nIt was their second night of grudging practice and probably the first time Kageyama had spoken to him with a sentence that didn’t start with an insult. So far he’d treated Shouyou like necessary baggage. Shouyou was needed to obtain entry into the club, but he wasn’t wanted.\nHe’d made that much at least clear.\n“I mean,” Kageyama continues, apparently unconcerned he’d just called their hissy fit of a practice session to an unscheduled stop. “It’s not even like you’re good at it. You’ve got some nice reflexes, but no talent for the sport. You’d work just as well in basketball or something.”\nFor a moment Shouyou can’t see through a haze of red rage. How dare Kageyama say something like that to him when Kageyama has a long documented history of being completely insufferable? Sure, Kageyama might have the natural talent for the sport that Shouyou lacks, but his way with people has left that talent compromised.\nShouyou more than anybody knows how essential a team is to victory. One person can’t play the whole court on his own, no matter how hard he tries.\nIt’s on the tip of tongue to blurt as much out when he comes to the realization that Kageyama looks curious. He’s not being mean, Shouyou realizes, just obtuse that he’s being rude. Or maybe he simply doesn’t care.\nRegardless, Shouyou isn’t a person given to prolonged fits of anger. Usually he wasn’t given to fits of anger at all, but Kageyama was especially talented at drawing out the worst in people.\nOr maybe it was just Shouyou.\n“I don’t get what you mean,” he says after a moment of carefully considering Kageyama’s frustrated but not angry expression. “I mean, I kind of get what you mean but not really.”\n“I mean,” Kageyama grits out between his teeth. “It shouldn’t matter to you whether you play volleyball or something else, right? It’d be the same either way.”\nShouyou looks at him for a moment – at the irritated slant of his eyes and the way his hair is falling unevenly across his forehead after three hours of tossing and slamming – and wonders if Kageyama is actually this dumb.\n“Yeah,” Shouyou says after a pregnant pause. “I suppose I could play another sport. But I don’t want to. I mean, I don’t really have a natural talent for anything in particular – not like you – so what does it matter if I pick one sport out of the rest? I love volleyball and that’s enough. If you play a sport because you think you’re obligated to, then aren’t you just wasting everybody’s time to begin with?”\nKageyama stares at him blankly for a moment and Shouyou wonders if he’s just said something really stupid.\n(up close like this without balls flying every which way or one of them sniping at the other Shouyou realizes that Kageyama is actually really attractive when he’s not frowning.)\n“You know,” Kageyama says after a moment longer of the absent rattle of the soccer club across the field packing up. “You’re kind of stupid.”\n“Oi,” Shouyou snaps.\n“But you’re also kind of smart sometimes,” Kageyama adds grudgingly after a moment and it feels a little like something up near his spine must have toppled over like hastily spilled water because the shock of Kageyama of all people complimenting him drips something cool under his skin.\n“Oh,” he says blankly and is suddenly very glad it’s dark out because he’s pretty sure he's blushing right now. “Um. Thanks?”\n“Don’t thank me,” Kageyama snaps, suddenly back to anger so quick he’s going to give Shouyou whiplash or something. “It wasn’t a compliment.”\n“Are you sure?” Shouyou asks doubtfully. “Because it kind of sounded like –.”\n“Go get the ball,” Kageyama growls and his tone leaves no room for argument.\nShouyou does just that – stumbling on the ground in the poor lighting and stubbing toes on roots and sticks as he scurries after the ball – not because he wants to but because part of him is still a little confused by their whole exchange just now.\nIt felt like – if even for a moment – that they had a connection.\nShouyou doesn’t want to wreck whatever little progress they just made by opening his mouth.\n.\nAfter the three-on-three match something seems to change between them – him and Kageyama – and Shouyou doesn’t know exactly why or when or even quite how but he winds up looking forward to seeing Kageyama’s face when he barrels into practice each day.\n“You two seem to get along quite well these days,” Sugawara observes one afternoon not long after their first practice match as the pair of them squeak the floor clean. “It’s nice not to see you bickering all the time. For a while there Daichi and I thought you might never stop.”\n“I don’t know what you’re talking about,” Shouyou blurts, even though he really clearly does.\nIt’s hard to hate somebody whose tosses make you feel like you’re walking on air. It’s hard to hate somebody who might not know how to say ‘well done’ or ‘you’re getting better’ but somehow manages to pull Shouyou out from depression when he misses a serve.\nIt’s hard to hate Kageyama and these days Shouyou’s wondering if he ever did.\n“There’s no reason to get all worked up about it,” Sugawara laughs, pausing in his mopping to scrub his hand affectionately through Shouyou’s hair. “The two of you are amazing. This team is very lucky to have you.”\nSomething in Shouyou’s chest tightens a bit at that, but it’s a snug kind of tightening, not unpleasant or painful.\n“We’re lucky to have you too,” he says a bit awkwardly but completely earnest and Sugawara blinks at him in surprise. “I mean, I’ve never been part of a team before, but with you and the others it really feels like one, you know?”\nSugawara stares at his hopelessly sincere look for a moment before softening his expression into a smile but before he can reply a volleyball collides painfully with Shouyou’s side and sends him stumbling back a few steps.\n“You’re meant to be cleaning the gym,” Kageyama snaps across the court and it’s quite obviously him who had just pitched a ball into Shouyou’s side like it was nothing.\n“We are!” He shouts back. “Don’t be such a tyrant!”\nKageyama’s expression hardens and he casts a supremely irritated glance at Sugawara for no apparent reason before stomping off to the back room.\n“What’s his problem?” Shouyou grouches as he rubs at his pained side.\n“Oh dear,” Sugawara smiles and he looks entirely amused for no good reason. “That might be my fault. I think I made him a little worried there.”\n“Worried?” Shouyou repeats blankly. “What has he got to be worried about?”\nSugawara smiles enigmatically at him for a moment but doesn’t answer, just shuffles away to leave Shouyou alone with his mop and his bemusement.\n.\n(“As long as you’re with me, I’ll make you invincible!” Kageyama shouts at him and Shouyou feels something click in place somewhere deep inside he’d never realized was missing.\nNo matter the teasing they cop from the neighborhood team, or the way Tsukishima occasionally brings it up like trying to rub dirt into an open wound, it never stops Shouyou from seeing the words as something special.\nIt never stops them from flying him high.)\n.\nThe thing about Marks is that Shouyou had been ignoring his for so long that he’d almost forgotten they were a part of everyday life.\nThis more than anything is why he’s extremely alarmed when he walks into class one day only to be ambushed by what feels like half the girls in his year, grabbing at his sleeve and tugging him into their conversation like this was an everyday thing.\n“What?” Shouyou asks in alarm. “What’s going on?”\nSomebody giggles – Shouyou thinks her name is Nakamura, although he’s not sure. “We’re talking about Marks, of course,” she exclaims.\n“Oh,” Shouyou says, baffled, not really sure why this should involve him of all people.\n“We were wondering where yours is? What does it say?” Somebody else pushes and a panicked glance around the classroom tells Shouyou that he’s probably not the first one to be assaulted today. Half the boys in the room are looking at him sympathetically and nodding in what’s probably meant to be an encouraging manner.\n“Um,” Shouyou says as somebody tugs his sleeve again to drag his attention back to the conversation. He feels way out of his depths here. “It’s nothing special.”\n“Don’t be like that,” probably-Nakamura laughs and when she tilts her head Shouyou can see a string of Kanji where her neck joins her shoulder, much in the same place as his own mother wears his father’s name. For a moment he’s almost a little envious. He wonders what it might be like to have a perfectly ordinary Mark so that you didn’t feel out of place in a room of uncovered names.\n“Really, it’s not that interesting,” he lies, and his fingers creep to make sure his shirt collar is dragged closed enough that they can’t catch the sprawl of colors in their little impossible shape. He almost wishes he was still in the same habit of hiding it beneath plasters and bandages that he had when he was younger. \n“If you don’t want to show us can you at least tell us what it says?” Another girl begs and Shouyou wonders a bit at this sudden Mark fever.\nA Mark is a reasonably private thing – or so Shouyou has always thought – and he can’t fathom why anybody should be all that interested in somebody else’s. He’s never felt the urge to peep on any of his teammates while they change, had never asked or felt obliged to answer when it came up in casual conversation.\nHe supposes this might be a high school thing. The idea of true love – of Soulmates – is a very appealing prospect to discover while you’re still young.\n“Um,” he stutters and everybody’s attention is so rapt on him that he feels unbelievably nervous. There’s no reason to lie, exactly, but Shouyou’s still vastly uncomfortable with everything going on right then and there. “It’s a symbol,” he says and he doesn’t tell them what it is if only because he doesn’t want people to start speculating. “And, uh, I’m not exactly sure what it’s meant to say. I’ve never had it translated.”\nA chorus of squeals makes him a bit unsteady on his feet and suddenly he’s got a dozen girls talking at him at once – touching him.\nShouyou’s never been uncomfortable with physical contact – he’s always been a very touchy person – but being swamped like this by people he can barely claim to know makes him desperately uneasy and when fingers stray too close to his Mark he physically jerks back.\nAs it is Shouyou is saved from the situation when the door rattles open to admit a very confused looking teacher but even when he returns to his seat Shouyou can’t quite manage to drag his mind away from it all.\nFor the rest of the day it’s all he can think about.\n.\n“Hey, do you think it’s weird that people are so open about their Marks?” Shouyou blurts out after practice one day while they’re changing in the clubroom. He’s not exactly sure what possesses him to ask because it’s not like this is the kind of stuff they discuss when whamming volleyballs around a court, but it’s been stuck in his head since the whole incident in the classroom the other day.\n“Huh?” Tanaka asks as he shrugs into his jacket. “Why do you ask?”\n“No reason,” Shouyou says, self-conscious now that the whole fucking team is looking at him like this. “It’s just… I always thought they should be kind of private, you know?”\nTanaka looks at him for a moment like he’s grown a second head and Shouyou’s not really surprised. Out of all of them Tanaka’s probably the most open about the whole business. His own Mark is a curve of English lettering in a soft blue beneath the jut of his ear, and, if anything, he’s always seemed more than happy to show it off. \nIt’s Daichi who – with a look of some concern – asks: “Did something happen?”\n“No, it’s…” Shouyou hesitates because in the strictest sense he supposes something did. “It’s just, everybody seems to be getting really intense about this stuff lately and I don’t know why.”\n“Are you an idiot or a high schooler?” Tsukishima asks him sneeringly as he jams his jersey back into his bag.\n“It’s quite typical for it to become the focus of everyone’s attention when they’re in high school,” Asahi says, and it’s probably only the fact that he has about fifteen pounds on Tsukishima that keeps him from arguing back.\n“I know, but won’t it just happen when it happens?” Shouyou can’t help himself asking. Even he can’t explain why he feels this frustrated about the topic. “Isn’t it worse to try and rush things?”\nIt feels like the whole club is eyeing him now and there’s a look on Kageyama’s face that he really can’t place. Shouyou feels foolish – feels like he’s just making himself out to be a little kid – but he also feels restless and annoyed and a bit like he’s going to cry for no good reason.\n“Never mind,” he says into the awkward silence and finishes yanking his shoes on in a hurry as he stumbles his way over to the door. “I’m going ahead.”\n“Hey!” Someone calls out behind him but Shouyou’s already stumbling his way down the clubroom steps and rushing for the bike rack.\nIt’s not like he’d expected anybody to understand what he meant when he barely understood himself.\nBy the time he reaches his bike he’s worked himself up into such a state that he can barely remember the combination of his lock, let alone twist it in when his fingers are shaking so badly that his nails clatter against the hefty metal and plastic of the lock piping.\nShouyou’s just really irritated and he can’t figure out why. He hasn’t stopped to think about Marks and Soulmates since he was a child. He’d almost forgotten they existed. His Mark was just that little funny thing on his collarbone that he didn’t like other people looking at and Soulmates was just a word that explained why his parents never got tired of one another.\nHis bike lock jingles in his hands and it takes everything he has to keep himself from ripping it free.\n“Hey,” Somebody snaps and warm hands close over his shaking fingers.\nIt’s Kageyama – of course it’s Kageyama – and he looks concerned in an irritated kind of way, which was basically the only kind of concern he was capable of showing.\n“What?” Shouyou snaps and even he’s surprised by his rudeness.\n“What do you mean what?” Kageyama growls and the grip on his fingers tightened. “What’s with you today? First all that shit about Marks and then you jump down everybody’s throat when they try and answer you? Also, you were rubbish on the court today. You missed nearly every toss I sent your way. That’s not like you.”\nIt wasn’t, not at all, but Shouyou isn’t going to admit that to Kageyama of all people.\n“Nothing,” he grunts. “I’m just… I don’t know. I don’t think I’m feeling well.”\nThe look of concern on Kageyama’s face deepens and without so much as a word he releases Shouyou’s hands only to – oh my god – lean forward and press the back of his palm against his forehead.\nHe was leaning in so close that Shouyou can see the pale slide of his skin and how his eyes are almost blue in this light; sharp and focused and beautiful.\n“You do feel kind of hot,” Kageyama allows and it takes everything Shouyou has to keep from blurting no, you’re kind of hot.\nSomething is seriously wrong with him. He feels sick to his stomach.\nKageyama pulls back and frowns at him, completely oblivious to the way Shouyou probably stopped breathing the second he leaned in. “Are you okay? You’re really red.”\nNo, he isn’t fucking okay because all he can think about is how attractive Kageyama is right now and how much he loves it when he tosses him the ball and how every time they were in the same room together something inside Shouyou feels like they just weren’t close enough and –\nShouyou feels sick to his stomach.\nHe likes Kageyama Tobio’s face and his passes and the way he would sometimes smother a smile if Shouyou managed a spectacular spike when he was in just the right mood. He likes the fact that Kageyama Tobio is a genius on the court but somehow still manages to turn his homework in late like everybody else and how excited he gets when they win a set against a particular strong opponent, how he sometimes shouts for pork buns when the seniors are short on cash and how even though he never says anything he always gives Shouyou first pick.\nMore than any of that though he just likes Kageyama Tobio.\nHe just really fucking likes Kageyama Tobio.\nThe Mark on his skin feels heavy and thick. Like it was weighed down by real gold instead of glitter-bright lines of color.\n“I’ve got to go,” Shouyou says and he’d already started backing away by the time the words are halfway out of his mouth.\n“What do you mean ‘go’?” Kageyama blinks at him, looking so confused he can’t even manage anger. “Your bike is –.”\n“I’ll get it tomorrow,” Shouyou blurts. “I’ve just – I gotta – tomorrow.”\nHe turns and flees after that and he thinks he hears Kageyama calling out after him as he runs but if he does the words are lost to the sharp hiss of the wind around him and the thumping of blood in his ears.\nHe’s more than a little head over heels for Kageyama Tobio and he’s not quite sure why he’s only noticing this now.\n.\nShouyou doesn’t go to school the next day. Instead he gets his mother to call him in sick before she takes the family out to visit a relative and then makes an appointment with a specialist in Soul Marks for the early morning. It’s perhaps one of the most nerve wracking phone calls he’s ever made.\n(“Hello, my name is Hinata Shouyou and I was wondering if you can translate the inscription on my Mark for me? Yes, yes. No. I, um – No, I’ve never – yes, I know it’s late – ten you said? No, I mean yes. Yes that’s fine for me. Okay, thank you, see you then.”)\nShouyou sorely regrets leaving his bike behind in his mad dash from the school the previous day – the hike is long and swelteringly hot – but not enough to actually go back and retrieve it once he actually makes it to town. He’d rather walk all the way back than risk bumping into anybody he knows at school.\nThe place he goes for his appointment is small and nondescript and the door opens on the first knock and Shouyou is ushered inside by a kindly old lady who fusses about him something awful.\nThe appointment itself takes no more than twenty minutes but when Shouyou emerges from the building it feels like it should have been an eternity.\nHe doesn’t even remember how he gets home after that but he does and he spends all day lying in bed staring at walls like if he can just ignore the world long enough it’ll just go away.\nHe’s being really stupid – even he knows that – but it’s easier to convince himself he’s sick than to admit that he’d been a little in love with Kageyama for a long while now. He wonders if his obsession with him had just turned into something else without him realizing it or if there had been a spark there from the beginning.\nHe doesn’t know. He really, really doesn’t know.\nHis phone goes off pretty much non-stop for the whole day. He should probably turn it off, he thinks, but there’s something nice about hearing it rattle uselessly against his desk. On one hand he’s not brave enough to face his teammates – to face his friends – but on the other at least this way he knows they’re thinking of him.\n(he’d never realized just how much of a coward he was before.)\nHe needs to get up. He needs to talk to Kageyama. He needs to stop being afraid of everything.\nShouyou doesn’t know how long he stays curled up in bed, but evidently it’s long enough to fall asleep because at some point he’s woken up by a loud banging on his front door like someone is trying to mine it for gold.\n“Mom!” He calls out after a moment of muddled blinking only to remember that his parents and his sister had gone to visit his aunt for the night and weren’t going to be back until tomorrow morning sometime.\nBlinking blearily Shouyou stumbles out of bed and drags himself to the door – somewhat irritated at the interruption to his pity party – and hopes whoever it is isn’t going to be mortified when he answers it looking like he’d just climbed out of his own grave.\nThe knocking gets louder and louder as Shouyou makes his way down the hall. “I’m coming,” he sighs and shoves the door open.\nIt’s Kageyama.\nOf course it’s Kageyama.\nOh crap, Shouyou thinks as he takes in Kageyama’s pissed expression and the way he’s gritting his teeth, and it’s nothing short of complete stupidity that he goes to slam the door shut in his face but Shouyou’s just woken up and Kageyama has the well-honed reflexes of a volleyball player so it’s no surprise that he manages to slam it open again before it even fully closes.\n“Don’t you dare try to shut me out,” he hisses angrily as he shoulders his way forcibly into the house and Shouyou just knows he’s in for a whole world of hurt.\n“You shouldn’t be here,” he says. “I’m – um – really sick. You’ll catch it.”\n“No you’re not,” Kageyama says bluntly as he closes the door behind him loud enough to make the doorframe shudder. “You’re avoiding me like a piece of shit. You’re not sick.”\nShouyou’s heart is beating up a storm. He can barely breathe. He can’t get the kindly old woman who translated his Mark out of his head, the light pattering of her fingers against his skin and the sigh of her voice as she’d said you could say it means – \n“Okay,” Shouyou says and shoots for a new tactic. “Okay, yes. I’m avoiding you. So will you please go now? Please?” His voice cracks embarrassingly loud on that final plea and he backs up into a wall and buries his face in his hands in mortification.\nHe doesn’t know how to deal with this. His whole life has just been a whole lot of avoiding things that weren’t volleyball. What do people do with this real life stuff that swoops in so unpleasantly whenever it wants like an uninvited guest?\nLike Kageyama Tobio who had just invited himself into his home like it wasn’t enough already that he’d invited himself into Shouyou’s heart.\n“Hey,” Kageyama says, and his voice is several degrees higher in alarm. Shouyou feels him shuffle in closer and wrap slender fingers around his wrists as he tries to drag Shouyou’s hands away from his face. “Would you just tell me what’s going on? I can’t fix it if I don’t know.”\n“You can’t fix this,” Shouyou says into his palms and his voice is muffled horrendously but he thinks Kageyama gets the drift because he stops trying to force Shouyou’s hands away.\nIt’s silent for a moment but for their respective heavy breathing and then Kageyama’s fingers tighten so much they’re almost painful on his skin. “Was it – am I…” he makes a noise that sounds both pained and frustrated at the same time. “Have I been a bad teammate? Is that why you won’t receive my tosses anymore?”\nSomething clicks and Shouyou realizes with absolute horror what Kageyama is trying to tell him and he can’t believe he’s been this dense.\nIt’s one thing for his inability to deal with his feelings for Kageyama to affect him – but to have them hit so close to home for Kageyama like that is another.\nShouyou doesn’t think Kageyama has ever really recovered from having his team walk off the court on him; for being benched just for being himself. When Kageyama asks if he’s been a bad teammate he’s really asking ‘have you had enough of me now?’\n “No!” Shouyou snaps viciously as he finally forces himself to look up into Kageyama’s startled eyes because he cannot have him misunderstand something this serious. “No! It’s nothing like that, okay? This hasn’t got anything to do with that.”\nKageyama just looks really surprised for a moment and then really relieved – cycling through emotions like they were hats in need of being dropped – before he finally settles back on exasperation as he looks down at Shouyou from their considerable height difference, fingers still solidly around his wrists like he intends to wrench his hands off if Shouyou shows any indication of trying to hide again.\n“So if this isn’t about that,” Kageyama says, “what is it about?”\nShouyou feels like throwing up all over again – nerves tend to manifest that way in him – but he probably can’t just go on as he is now. Pretending nothing’s wrong hadn’t worked and there was no way he was ever going to be able to be alone with Kageyama without wanting to kiss him so.\n“I… I need to show you something.” The words are harder than he’d like to admit to get out.\nKageyama blinks at him and then narrows his eyes suspiciously. “And you promise you’re not going to bolt if I let you go?”\nShouyou tries for a laugh. “It’s my house,” he reminds him. “Where would I go?”\nKageyama hesitates for a moment longer, but whether it’s Shouyou’s words or his dead serious expression he eventually steps back, reluctantly releasing his wrists like he’s still a little afraid Shouyou might make a dash for the next prefecture over without a leash on him.\nYou can do this, Shouyou encourages himself as he takes in several deep breathes and turns to head back to his room.\nAfter a moment Kageyama follows him.\n.\nShouyou comes from a family with a full set of parents and a sister. He’s not really used to having the house to himself like this, let alone at this time of the evening.\nIt makes him bizarrely nervous as he rattles open his bedroom door and gestures for Kageyama to follow him in. “You can have a seat on the bed,” he suggest a little awkwardly, because there’s nowhere really else for it.\nKageyama doesn’t seem half as nervous as Shouyou is, he just shrugs his bag to the floor and sits himself down on the edge of the mattress like they did this every day.\nPossibly Shouyou is the only one working himself up in knots over this.\nHe closes the door for no real reason other than habit. The same reason he asked Kageyama to his room instead of just having this conversation out in the hallway. They’re alone in the house. It’s not like anybody is going to overhear them or burst in at an awkward moment, but Shouyou is nervous enough.\nHe needs some sort of familiarity here.\n“Well?” Kageyama asks as Shouyou hovers by the door. “You going to tell me what’s going on or what?”\nShouyou takes in a deep breath and shuts his eyes for a moment as he steels himself before straightening his back and turning around, walking with small, uneven steps so he can plop down besides Kageyama on the bed.\n“It’s… Do you remember how I was talking about Marks the other day?” He says and it’s probably just his imagination but it feels like Kageyama stiffens beside him.\n“I remember,” he says slowly.\nShouyou coaches himself through another handful of breaths, his fingers rolling and unrolling in the hem of his rumpled button-up. “Have you ever seen mine, Kageyama?”\nKageyama definitely starts at that. “Of course not,” he almost snaps. “Why would I – that would be beyond rude to snoop on someone’s Mark like that without asking.” He’s flustered. More than flustered.\nIt’s beyond endearing.\n“Okay,” Shouyou says. “Yeah, I thought as much.”\nThen – without so much as a word – he reaches up and starts unbuttoning his shirt.\nIf Kageyama had been red before it was nothing compared to now. He jerks back like Shouyou had just slapped him, putting space between them in an instance. “What are you doing?”\nShouyou ignores him, focusing on the steady click-click-click of buttons sliding beneath his fingertips until his shirt was half-undone and just hanging on his shoulders; the Mark on his collarbone plain as day as he hovered uncertain fingers over it and slowly turned to face Kageyama.\n“Give me your hand,” he demands and Kageyama just stares at him blankly.\n“What –.”\n“Just do it,” Shouyou says, trying to sound confident instead of shaky, making impatient grabbing motions with his own hand. “Trust me, okay?”\nTrust me like I trust you. A hundred percent and without a doubt.\nAnd after a moment Kageyama does; slowly edging closer and holding out his hand so that Shouyou can take his wrist and guide it so that his fingers are hovering over his own that he was pressing so tightly over his Mark.\nHe takes in a deep breath and moves his hand so that Kageyama’s fingers hover an inch away from his naked, exposed Mark.\nThe breath Kageyama takes in is like breathing static electricity. Shouyou can almost feel it from where he’s sitting, sweating in the summer heat but shaking with the way Kageyama is staring unabashedly at his Mark like somebody had just kicked him in the gut.\n“What – is that…”\nShouyou’s Mark was a crown; obvious in the beautifully gilded edges that swirled around on his skin like somebody had finger painted along his collar with nails smudged in gold and red. It was beautiful – even Shouyou knew as much – and there was absolutely only one person in the world it could belong to.\n“Can I…?” Kageyama doesn’t seem capable of getting a full sentence out – he looks almost as shaken as Shouyou feels – but he understands him all the same.\n“Yeah,” he says awkwardly. “I mean yes. Yes, you can touch it.”\nSlowly – reverently – Kageyama lowers his hand until his fingertips graze along the skin.\nShouyou bites down on his lips to stop what might have been a very embarrassing gasp. It’s hard to explain exactly what it felt like in that moment when Kageyama touched him skin-on-skin for the first time; his finger tracing gently along his Mark.\nIt was a little like the feeling Shouyou got when he spiked a ball perfectly; exhilarating and endless and electric.\nKageyama moves in closer, shuffling so that they were pressed right up against each other with one of his hands pressed into the soft mattress on the opposite side of Shouyou’s thigh and his face close as he stared intently at the Mark as he traced it.\n“The inscription,” he breathes into the silence and Shouyou feels his finger glide along the beautiful, forgotten lettering. “What does it mean?”\nShouyou closes his eyes against the way it was suddenly very hard to find breath. “It means ‘to command a royal aura, especially amongst the presence of fellow nobility’.” \nKageyama’s fingers freeze. “So it…”\n“Yeah,” Shouyou smiles, strained and nervous but not unhappy. “The direct translation works out to be ‘King of the Court’.”\nKageyama’s fingers unfurl against his skin so that’s he’s pressing the palm of his hand against Shouyou’s Mark – skin on skin.\n“Kageyama –.”\nWhatever Shouyou is about to say is cut off when Kageyama shoves him, sending him sprawling back on the bed so that Kageyama settles over him like an impenetrable wall, massive and looming.\nShouyou’s words die in his throat and his eyes widen as Kageyama leans back on his heels a little and reaches down to curl his fingers around the hem of his own shirt as he lifts it.\nShouyou makes a noise that is half a word – Kageyama’s name, he thinks – and half just a sound of petrified surprise. It sticks on his lips and comes out garbled as he watched the way Kageyama tilts his head to the side and flexes his shoulders as the shirt comes over his head.\nShouyou knows he must have seen Kageyama do this at some point – they get changed in the same locker room after all – but between the heat in the room making him drip sweat and the naked skin above him it’s – it’s.\nErotic.\nThere’s not really another word for it.\n“Stop freaking out for a moment,” Kageyama says and the words are familiar even if the shake in his voice is not. He shifts, leaning down to take Shouyou’s hand in his own and guiding it up like Shouyou had done to Kageyama himself. “Just… look.”\nAnd just like that he settles Shouyou’s fingers over something dark and shaded on his chest where it lives just above his heart and Shouyou realizes, as his fingers brush the cool, shimmering lines that this is Kageyama’s Mark.\nShouyou’s mouth goes dry. “It’s...”\n“Yeah,” Kageyama says, a little awkward and more than a little nervous.\nIt’s a deep beautiful blue – a very rich and noble color that wouldn’t look out of place in throne rooms – and Shouyou’s fingers tremble as they trace along countless, countless little hooks in the lines, the intricate sprays of shiny blue that could almost be trembling beneath his touch.\nIt’s a crow; wings spread like it’s midflight. Each one of the splayed feathers is an individual little curve and although the Mark is as small as all other Marks are, the spread of the wings makes it seem endless and inevitable.\nThere’s a scratch of writing – beautiful letters like the ones Shouyou wears – resting right beneath the tucked up talons.\n“What does it – do you know?”\nOne of Kageyama’s hands comes up to rest on Shouyou’s, spreading his fingers so that they’re intertwined in a fist against his skin. Shouyou can feel the rapid thump-thump-thump of his heart beneath his palm and it occurs to him to wonder just how much of that is nerves and just how much might be arousal at this point.\n“Yeah,” Kageyama says again, and he’s looking right at Shouyou now. “It means ‘to be made invincible’.”\nShouyou’s heart freezes for a moment and when it starts beating again it feels like a splash of hot water in his veins.\n“Oh my god,” he mutters and he lifts one of his arms to bury his face in the crook of his elbow.\n“Oi,” Kageyama says as he settles above Shouyou and reaches down with his free hand to gently pull Shouyou’s arm from his face. “You’ve got to stop hiding like that.”\nSeeing Kageyama leaning above him with their hands joined over his Mark is nearly too much for Shouyou to take. This is his Soulmate – Kageyama is Marked for him.\n “How long have you known?” Shouyou asks and Kageyama shifts uncomfortably.\n“A while,” he admits. “I started thinking about it the very first time I tossed for you, but I think I really realized after the match with Asahi and Nishinoya.”\nShouyou feels like he can almost taste the rapid fan of his pulse. It tastes a lot like sweat and blood. “That long?” he hisses. “Why didn’t you say anything?”\nKageyama sighs and pulls back a little, letting their entwined hands unfold so he can scrub a hand through his hair. “I didn’t know for sure and you hadn’t said anything. I didn’t want to spook you.”\n“You wouldn’t have spooked me,” Shouyou says immediately and Kageyama’s frown softens a little into something that wasn’t quite a smile but almost.\n“Well I know that now, dumbass,” he mutters and cuffs Shouyou lightly on his forehead, only his hand lingers, fingers opening to cup Shouyou’s cheek. He looks undeniably fond and it’s not an expression Shouyou is used to being aimed his way but he thinks he could adjust to it. \n“Hey,” he whispers as he reaches up so that he can tangle his hands in Kageyama’s hair, drawing him in closer and trying hard to focus on the way Kageyama’s breathing grows more rapid the closer he gets, the light sheen of sweat on his naked skin.\n“What?” Kageyama says and it’s almost a rasp.\nShouyou takes a deep breath and lowers his face into the crook of Kageyama’s shoulder.\n“Nobody’s going to be home tonight.”\nKageyama freezes for a moment and Shouyou thinks he might have said something wrong.\nAnd then he pulls back, looks him in the eye and kisses him.\n.\nKageyama’s lips taste like sweat and spice.\nThey’re both clumsy and inexperienced, but it just makes the way Shouyou’s heart is filled to bursting even sweeter. He doesn’t know how he’d feel if Kageyama kissed like he had any real experience, and the awkward slide of his hands and the way he can’t seem to undo the last few buttons on Shouyou’s shirt is so adorable he almost laughs.\n“Here,” he says and gently nudges aside Kageyama’s fingers so that he can undo them himself, but it’s Kageyama he allows to shuffle the shirt off his shoulders to drop unwanted to the floor.\nWhen Kageyama gets a hand down his shorts Shouyou gasps and clutches at Kageyama’s shoulders for an anchor. When Kageyama leans forward to press his lips against the golden crown on his collarbone he nearly sobs, and the noises Kageyama makes when Shouyou manages to get a hand between them to touch him too nearly sends him over the edge.\nHe comes with the feeling of being loved and wanted and needed.\nHe feels invincible.\n.\nAfterwards they huddle together beneath the blankets on Shouyou’s bed. It’s too hot for this – really – but there’s something about being piled together in a tangle of naked limbs and jutting elbows that appeals to them.\nThere’s been enough confusion and heartache and hopeless yearning to last a decade. Right now Shouyou thinks they need this, to lie together with wayward fingers tracing lines in the dark with sweat trickling down the small of their backs and hair sticking uncomfortably to damp skin.\nThey talk about things. Little, inconsequential, and with halting sentences like they’re still a little scared to jump into this with all they have.\nIt’s not their nature to take things slow, but they’re still young and restless and Shouyou never thought he’d ever find his Soulmate hidden away in a gym wearing a crown on his head to match the one on his collar, but he thinks he’s glad he did.\nTheir relationship has been strange from the beginning and Shouyou wonders why he didn’t notice this then. Daichi once told him it was unnatural to trust someone the way he trusted Kageyama; to leap with his eyes closed and have faith that Kageyama wouldn’t let him fall.\n“Hey,” he mutters against Kageyama’s shoulder and the way he shifts sleepily around him makes him think that he might have been asleep.\n“Hmm?”\n“I love you,” Shouyou says and he means it.\n“Yeah,” Kageyama groans. “I love you, too. Now go to sleep dumbass before I make you.”"
}