{
    "id": "18694951",
    "url": "https://archiveofourown.org/works/18694951?view_full_work=true",
    "author": [
        "Lissadiane"
    ],
    "title": "Wolves and Foxes Don’t Get Along",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [
        "Derek Hale",
        "Stiles Stilinski",
        "Scott McCall (Teen Wolf)",
        "Sheriff Stilinski",
        "Allison Argent",
        "Jackson Whittemore",
        "Cora Hale",
        "Lydia Martin",
        "Kira Yukimura",
        "Malia Tate"
    ],
    "additional_tags": [
        "Werefox AU",
        "Stiles is a werefox",
        "New Kid Stiles Stilinski",
        "Puppy Scott",
        "Derek is a Good Alpha",
        "he tries his best"
    ],
    "language": "English",
    "series": "",
    "published": "2019-05-03",
    "completed": null,
    "words": "14,557",
    "chapters": "1/1",
    "comments": "146",
    "kudos": "8,857",
    "bookmarks": "1,850",
    "hits": "62,478",
    "summary": "<p>The first werewolf Stiles ever sees is a goofy looking dude with floppy brown hair and a crooked smile, leaning up against a black camaro outside the high school, wearing an oversized leather jacket, surrounded by half a dozen other preternaturally beautiful girls and guys, also in leather. Also probably werewolves. </p>\n<p>They look like they stepped right out of Twilight and it’s not subtle.</p>",
    "notes": "<p>Happy belated birthday to <a href=\"https://pantstomatch.tumblr.com/\" rel=\"nofollow\">Skoosie</a>, who asked for a fic with hurt/comfort where Stiles was a werefox for her birthday gift. I thought, \"Sure, easy! I'll write a little 3,000 word fic and it'll be great\" and then this fic happened instead. I apologize if it's a dumpsterfire, I tried my best, and it's half beta'd, so that half's good, at least? Right?</p>\n<p>(Thank you to <a href=\"https://villainny.tumblr.com\" rel=\"nofollow\">Nny</a> for betaing -- all remaining mistakes are mine because I just didn't care enough to fix them, I'm sorry, forgive me, all the good parts are because of her influence, thank you for making me rewrite the beginning, it was a disaster, IT IS ALL A DISASTER, skoosie I'm sorry!. And to <a href=\"https://kangofu-cb.tumblr.com/\" rel=\"nofollow\">Kangofu_cb</a> for reading it and reassuring me that it wasn't the worst, when she doesn't even go here.)</p>",
    "text": "Wolves and foxes don’t get along.\nHere are the things Stiles remembers most about his mother:\nHe remembers that she taught him to control his werefox shift when he was just a kit, and that they spent their afternoons as foxes, chasing each other through the house, in her closet, where the hems of her summer dresses were the perfect hiding places for a baby fox.\nHe remembers her bedtime stories of all the horrific things a werewolf would do if it caught a fox trespassing on its territory. How they would hurt him, and go after his family.\nHe remembers she let him shift outside only once, when he was six, and they’d gone on a family vacation far from home, so that if any wolves caught their scent, they’d be long gone before they were found.\nHe remembers his dad coming home from work and finding them curled up as foxes on the sofa, and throwing up his hands and laughing and asking where his family went, and laughing harder when Stiles used his little claws to scale his deputy uniform and perch on his shoulder.\nHe remembers his mom getting sick, her human body wasting away slowly until she was too weak to shift, and how he’d curl up on her lap as a fox and she’d stroke his fur as chemo drugs dripped into his system.\nHe remembers that he spent two entire weeks as a fox after she died, curled up in her closet with sweet summer dresses drifting over his head, until her scent started to fade away.\nWhen he came out as a boy, his dad grabbed him tight and cried into his hair and Stiles decided that he would never, ever, ever shift again.\nThere was no point when his mother wasn’t there to play with, and his dad needed him as a boy, not a fox.\nAnd then, seven years later, they moved to Beacon Hills and, as soon as they crossed the boundary line, Stiles just knew. There were wolves here, and if they found him, they’d tear him apart.\nIt doesn’t matter, though. Stiles barely remembers how to be a fox at all, and hasn’t since the doctor diagnosed his jittery, hyperactive energy from containing that side of him as ADHD.\nHe’s barely a fox and if the scent of wolves that’s so thick in Beacon Hills makes him a little more jittery, a little more aware of that part of himself that he’s kept buried for so long, well. He resolves to ignore it and do his best to be a regular kid starting at a new school at the beginning of senior year.\nHe’ll take this year as a win if he manages to make even one friend by graduation.\nThe first werewolf Stiles ever sees is a goofy looking dude with floppy brown hair and a crooked smile, leaning up against a black camaro outside the high school, wearing an oversized leather jacket, surrounded by half a dozen other preternaturally beautiful girls and guys, also in leather. Also probably werewolves. \nThey look like they stepped right out of Twilight and it’s not subtle.\nHe always thought he’d be afraid if he ever met a real werewolf, but Stiles has been in beacon Hills for two weeks by this point, and he’s smelled them everywhere.\nWhich probably means they’ve caught his scent, too, even though Stiles hasn’t actually shifted since he was 11.\nBut these wolves -- with their red lipstick and perfect hair and leather and super hot sports car -- they don’t look half as scary as his mother always warned him werewolves were. They look like they’re trying just a little too hard.\nStiles tosses them a sarcastic salute on his way by and no one eats him, so. It’s a win as far as first days of school go.\nThey don’t seem to be the best at being werewolves, because though they look constipated and concerned whenever he’s near them, they never seem to actually see him, and if being invisible is what it takes to stay alive until college, Stiles will take it.\nIt’s hard, though. The longer he’s there, the harder it is not to give into the part of him that seems to believe that if they can go around willynilly being wolves, then he should be able to be a fox, and Beacon Hills is surrounded by miles and miles of forest -- Stiles starts to dream that he’s running through the trees on four little paws and as the days turn to weeks and months, it becomes nearly impossible to focus on anything but that.\nHe doesn’t make friends, but he’s not surprised. Stiles is an acquired taste and no one here has any interest in acquiring him, especially as he gets more tightly wound, fox energy practically vibrating to find its way free.\nHe gets a lot of detentions. His grades aren’t the greatest. His dad gets called in for more than one meeting with the principal, and then sits him down for a few Concerned Conversations, but Stiles is trying his best. He’s just… holding on as best he can until he gets out of here.\nIt’s his dad’s idea to take up running -- Stiles is half convinced that his dad thinks if Stiles starts running, maybe he’ll start shifting, because, though not a shifter himself, his dad has some idea that it cannot be healthy. He’d given up trying to talk to Stiles about that when Stiles was 14 and angry at the world and now it’s just. Something They Don’t Talk About.\nRunning as a human is painful and awkward and stupid, but it’s good for burning off his hyperactive energy, so he does it.\nAt first, he sticks to the sidewalks and side streets in town. There’s no use pushing his luck, and he knows he’s lucky that he’s managed half a school year of being a werefox surrounded by wolves without getting discovered. He’s managed to suppress any foxy urges, however.\nThe Preserve is too much to resist, however. For all that he’s pretending his foxy instincts aren’t there, Stiles is, at heart, a fox. And a fox needs to run, to explore.\nSo one early spring morning, Stiles gives into the urge and takes an abrupt left off a sidewalk, cuts through someone’s backyard, and then he’s in the woods.\nHe jogs for a little while, slow and steady, keeping his heart rate calm, pretending he’s just gonna jog like any other day before returning home.\nSoon enough, however, he’s so deep in the woods that he cannot smell the houses, the cars, the pavement. All he can hear is the wind in the trees and the distant sounds of birds.\nHe’s completely alone.\nSo no one would know if he shifted. Just for a few minutes. Just a chance to stretch his muscles.\nIt’ll help him contain his hyperactive energies. It’ll help him focus. Hell, maybe it’ll calm him down enough that he can be a normal kid long enough to make a goddamn friend.\nHe’s so far from town and from the werewolves and they haven’t caught him yet -- they’re obviously terrible at being werewolves. So if he shifts out here, for just a little while, to take the edge off, they won’t know.\nAnd he’ll be able to sleep again. And focus in school. And his dad’ll stop worrying so much about him.\nAnd he misses his mom so much -- maybe it’ll help him feel closer to her again.\nHe strips, tossing his clothes to the ground at the base of a tree trunk, and then, rubbing at his arms and looking around nervously, he takes a moment to second guess his intentions.\nAnd then he decides, fuck it.\nHis body remembers how to be a fox better than he thinks it should, seeing as he hasn’t shifted in so long. One moment he’s human, the next he’s not.\nStiles takes a moment, just adjusting to his new centre of gravity, his new height, his sharper senses.\nAnd then he runs.\nHe darts through the underbrush, leaps over fallen logs, rolls through soft soil and dead things. He hops over stones spanning the river, scrambles up muddy embankments, hunts strange scents through rocky outcroppings, down hills, through thickets of raspberry bushes and ivy.\nHe runs until his little heart is pounding and his lungs are aching and he’s still vibrating with the adrenaline of being free, of worrying about nothing more than where his little paws are taking him and what he gets to smell along the way.\nAt dusk, he finally starts to think about going home. \nHis dad will be getting off work soon, Stiles likes to have a healthy dinner waiting for him, and he’s still got homework to do before school.\nHe turns back and starts picking his way through the forest towards home.\nAnd then he puts his front paw down on what looks like a flattened stone, and something clicks.\nStiles has half a second to freeze and then the bear trap jerks up and out of the fallen leaves, sharp teeth snapping shut around his shoulder.\nHe feels his bones crack and shatter, his skin tear, and all he is aware of is the sharp, blinding pain and the scent of his blood.\nHis screams as he thrashes and tries to pull himself free send the nearby birds fleeing, and all he manages to do is tear himself up even more.\nIt hurts. It hurts more than anything has ever hurt before. He can feel shards of his bones tearing his flesh from the inside, can feel his body trying to heal around the sharp teeth of the trap, can feel it tearing open again when he moves.\n \nHe finally gives up and falls to the ground, panting so raggedly, his muzzle is wet with bloody foam.\nHe whines and he licks at the wounds on his leg and his shoulder and he thinks about animals chewing their own legs off to escape a trap like these.\nHe wonders if he has the strength to do that.\nHe knows he doesn’t.\nDarkness falls.\n*\nStiles loses consciousness, and when he wakes again, it’s with a start. The forest is lit up by the full moon above, he’s still trapped, and in the trees, he can see a pair of shining golden eyes.\nOf course he’d be stupid enough to go for a run in the woods on the full moon.\nStiles doesn’t know what werewolves do to werefoxes, his mother had never gone into too much detail, but it won’t be good. Stiles knows that much.\nHe drags himself to his feet, the chain pinning the trap to the ground rattling as he does, and he backs away, whining soft and low. He tries to pull himself free and the pain makes everything spin, going gray around the edges.\nThe wolf comes closer, growling low, and Stiles makes one last, desperate attempt to pull himself free. \nAll he does is tear his shoulder open and the scent of fresh blood makes him want to puke. He collapses, a pathetic lump of fox red fur, trembling and panting and waiting to die.\nHis dad’s never going to know what happened to him.\nThe wolf bares its teeth in a fierce snarl, sniffing at him, and Stiles lashes out with his other paw weakly.\nThe wolf doesn’t react much -- just blinks down at him -- and then it sits back on its haunches, lifts its muzzle, and howls.\nGreat. Great. Calling for reinforcements. \nJust what Stiles needs.\nThe world drips out of focus again.\n*\nStiles comes to screaming, and for a few moments, nothing exists except pain and blood and fear.\nHe lashes out wildly, pure feral terror, and he’s pinned to the ground easily. He’s not in the trap anymore, but he’s still torn apart and bleeding.\nHe can’t breathe, he can’t think, all he knows is that there are teeth at his throat and a subvocal growl is vibrating in his bones and it isn’t his.\nGoing very still, Stiles tries to catch his breath and remember where he is and why.\nThe teeth gradually relax and even when the wolf pinning him backs away, Stiles holds still, closes his eyes, and pants.\n“That’s the fox we’ve been hunting?” someone sneers. “Pathetic.”\n“What are we going to do with him?” someone else asks. Stiles opens his eyes enough to get a hazy image of half a dozen naked human-shapes and -- yeah, he totally called it his first day in Beacon Hills. \n“Let him die, do us all a favour,” someone else says. “What? He didn’t follow the rules, he invaded our territory, he knew what would happen.”\n“He’s just a kid,” someone says, quiet. Stiles pulls his lips back in a weak snarl because he knows these people -- they go to his fucking school. If he’s a kid, so are they.\n“Bring him to the house.”\nHe opens his eyes, blinking into the darkness, because he’s never heard that voice at school, but before he can make out who the speaker was, most of them are shifting back to wolf form and taking off into the shadows with a chorus of howls, leaving one behind.\nLeaving Jackson Whittemore behind.\n“Seriously?” Jackson growls, and then he’s a wolf too, picking Stiles up by back of his neck and taking off after the others.\nIt hurts. It hurts so fucking much.\nStiles is grateful when he loses consciousness again.\n*\n“He’s still a fox.”\nStiles holds himself very still, swallowing down the urge to pant, to cry. Of course he’s still a fox -- even now, his body burning up with fever and pain, his mom’s warning about wolves holds true.\nIf they find out who he is, they might go after his dad.\n“Of course he is,” someone else says, a girl, voice sharp and cutting. He recognizes it, he thinks. “He’s terrified -- can’t you smell it?”\n“Why isn’t he healing?”\n“The trap was laced with wolfsbane,” says the sharp voice. “Even foxes are affected. Deaton’s sent some salve that should help, but his body is smaller -- the poison travels faster. We’re doing our best.”\n“Wolfsbane? But that means --”\n“Hunters,” she says, quiet. “Allison’s looking into it.”\nA door slams. Stiles wonders if he’s alone. He takes a deep, careful breath, which pulls at his shoulder, and just as he’s about to convince himself that he’s alone, someone reaches out and lays a careful hand on his side.\n“C’mon, little fox,” she says, soft and melodic. “I know you aren’t sleeping.”\nStiles opens his eyes and stares. He should have known Cora’s voice -- they were in class together often enough, but she never really had much to say.\n“There you are.” Her eyes are dark and narrow, studying him. “You don’t need to be afraid here.”\nCora Hale is the Hale Alpha’s younger sister. Stiles has every reason to be afraid.\nHe does his best to study the room he’s in -- it looks like an ordinary guest room -- and notices the sun shining brightly out the window.\nIt’s morning. Oh god, his dad is going to be losing his mind.\nStiles tries to get up, but it tears at his shoulder, and Cora hisses and holds him down. “You aren’t healing,” she says. “We haven’t put any stitches in because we’re hoping the antidote counteracts the poison and you start to heal, but if you move, you’ll start to bleed, and you’ve already lost a shit load of blood. Okay?”\nHe holds still.\n“Just rest,” she says, taking her hand away carefully once she’s sure he’s not going to move. “And when you’re healed, we’ll deal with everything else.”\nEverything else like Stiles trespassing on pack land.\nStiles closes his eyes and pretends to sleep.\n*\nHe waits until she’s gone and then drags himself off the bed they’ve put him on, limping over to the window. He can smell the fresh blood, knows he’s torn himself open, but it doesn’t matter. He needs to get home.\nThe window is open and he drags himself up onto the window sill, shoving at the screen with his muzzle until it pops free. \nHe’s on the second floor. But he’s a werefox -- he’ll heal -- won’t he heal?\nHe takes a breath and jumps.\nAnd screams as his body breaks when he hits the ground.\n*\n“I thought foxes were supposed to be smart.”\n“Not this one, apparently. Is Derek on his way? If the fox dies, we’re in so much trouble.”\nStiles can’t move or see or feel, and his hearing is fading in and out with his consciousness. Not feeling, he’s sure, is a blessing, because his body is too broken to work and that has to hurt.\nHe drifts, catching little snippets of conversation and letting them go, and then, quietly, someone says, “I know who you are.”\nStiles opens his eyes.\nHe’s still in his fox form and his body is twisted, torn open, slick with his own blood, and for a moment, all Stiles can focus on is his vision, slowly fading into existence.\nThere’s a guy beside his bed, dark hair and stubble and a killer jawline. His eyes are light and hazel and super fucking pretty.\nAnd then his body decides that he’s conscious enough to feel pain, and everything shatters into a broken, sharp mess of pain and screaming.\nHe’s not sure how long it lasts, but when it fades, he realizes that the guy -- Derek Hale, alpha fucking werewolf, of course Stiles knows him -- is stroking one hand along Stiles’ flank, as if he doesn’t even care that Stiles is sticky with blood.\nBlack lines are moving up Derek’s forearm, disappearing into his skin as he takes Stiles’ pain, and it’s a dizzying, super sweet rush of adrenaline and relief as he does.\nStiles lets his eyes close and breathes shakily and Derek says, quiet, “Don’t do anything stupid like that again, Stilinski. We are not going to let you die.”\nStiles drifts away, still fumbling with the knowledge that for some reason, the alpha wolf has decided to let Stiles live.\nTo demand that he live.\nStiles doesn’t know what to do with that.\n*\nStiles has dreams -- nightmares born of fever, a hazy impression of fear, of running through the woods in wolf form, chased by monsters who turn out to be his mother with blood in her teeth.\nWhen his fever finally breaks, his body is sweat-sticky and his muscles ache and he’s human again.\nAnd very naked.\nHe lays very still as consciousness comes back slowly, water drops running down a window pane. He remembers who he is, first, and but where he is takes a while.\nThere’s music playing -- something soft and classical, and he can distantly hear water running, pots and pans clanking. He can smell something cooking.\nHe’s not at home, and even if he was, it couldn’t be his dad cooking, because --\nHis dad.\nStiles remembers everything abruptly, sits up so quickly his head spins. He groans at the spike of pain, hand coming up to his forehead as he closes his eyes.\nHe’s at the Hale house and he doesn’t know how long he’s been gone, but his dad is going to be flipping out. He has to go, he has to escape somehow -- jumping out the window is out, but maybe if he shifts, he can get down the stairs and out the door before anybody realizes what’s happened and --\n“Here,” someone says, appearing at the door. Stiles holds himself as still as he can, tensed up and ready to fight or to run. It’s Derek, wearing a worn out henley and super tight jeans and bare feet that look a whole lot less threatening than the boots he usually wears, while out intimidating innocent foxes with his leather jacket and his toothy smile and his pack of werewolves. He’s always looked unapproachable and scary hot and Stiles has always sort of admired that, objectively, in the way anyone might admire someone who’d probably break their neck if they ever realized they were being admired.\nThe bare feet, though, suddenly make him seem a little more human than wolf, and Stiles doesn’t know what to do with that.\nDerek’s holding a plate and Stiles cocks his head and scents the air even though he has no intention of eating Derek’s food.\nHis stomach grumbles because it’s a goddamn traitor.\nDerek comes in, holding the plate of scrambled eggs and toast out, and Stiles takes it with an ungracious grimace.\n“Thanks,” he mumbles, glaring down at the plate even as he crams an entire piece of toast into his mouth.\nDerek leans a hip against the doorframe, crosses his arms over his chest, and says, wary, “How’s the pain?”\n“Head hurts,” Stiles says, mouth full. “Muscles ache. I gotta go home.” He shoots Derek a quick glare. “Unless you’re keeping me here.”\nDerek holds up both hands, like he’s surrendering, and says, “You’ve been free to leave the entire time. Just unable to actually do it.” He shrugs one shoulder. “Especially after you jumped out the fucking window.”\nStiles looks at the window, chewing petulantly, and then says, “I should’ve been fine.”\n“You’d have incapacitated yourself even if the poison from that trap hadn’t hindered your healing,” Derek tells him. “You lost a lot of blood. Deaton wasn’t sure you’d pull through.”\n“Oh god,” Stiles groans. “If I died because of my own stupidity and you buried my body in the woods and my dad never found out what happened to me, it would be the worst.”\nDerek looks like he’s trying to hide his amusement. “Yeah. Well. Luckily, Deaton counteracted the poison, we were able to give you a transfusion to jumpstart your healing and your body rallied.”\n“How long--”\n“A week.”\n“Fuck.” Stiles scrambles out of the bed but the dizziness is sudden and complete and he almost falls as soon as his feet hit the floor. Derek’s there to steady him though, gently but firmly guiding him back onto the bed.\n“Don’t be stupid,” Derek says, tucking him in and glaring whenever Stiles makes any movement that might suggest he’s going to try again. “You need to rest.”\n“But my dad --”\n“Knows where you are.” Derek watches Stiles carefully, hovering, and it makes Stiles want to shove him away or say something sarcastic and cutting, but his entire body is tired, including his tongue. “He was here just a few hours ago.”\nStiles stares. “He wouldn’t have left,” he says. “Even if he had work, if he knew--”\n“There was a break in the case, we figured out who set the trap,” Derek says, sitting on the edge of the bed and resting one hand on Stiles’ shin, on top of the blankets. “He wanted to be the one to arrest him and I promised to text him if you woke. Your fever had already broken, so we knew you’d be okay.”\nStiles fidgets with the hem of the blanket and takes a deep breath and asks, “Did you text him?”\n“He’s on his way.”\n“Okay.”\nStiles feels small and young and stupid and he wants to cry. He’s already caused his dad so many problems, and now this? Getting mixed up with the local werewolf population, after swearing he’d keep himself safe, after promising his mom and his dad both that he’d remember everything she told him?\nStiles closes his eyes to keep the tears from escaping and takes a deep breath. “Why didn’t you just let me die?” he asks.\nDerek doesn’t reply, not until Stiles finally opens his eyes and looks at him. “Because we’re not monsters,” Derek says, firm. “We don’t make a habit of killing when we can help it. Besides, you’d done a good enough job trying to get yourself killed already.”\n“But -- but I’m a fox,” Stiles says. “Wolves and foxes don’t get along.”\nDerek shrugs, getting to his feet. “Maybe not. Lucky for us both that we’re human too.” He takes Stiles’ plate. “Do you want to shower?” He wrinkles his nose, and it’s incongruously cute on his super hot face. “You stink, but I don’t think your dad will notice.”\n“Jesus,” Stiles says, mortified and sniffing at himself cautiously. “Sure, yeah, I need a shower before my dad gets back.” He throws the blankets aside.\nDerek carefully averts his eyes. “I’ll get you some clothes, too.”\nBecause Stiles is naked.\nSmelly and naked.\nFuck.\n*\nStiles goes home that night with his dad, who carefully keeps all the lectures to a minimum until they’re safe at home, which Stiles appreciates.\nHe also appreciates that most of his dad’s anger comes from the fact that it took over 24 hours for Derek to realize who Stiles was, and he only figured it out after the whole town became aware of the fact that the sheriff’s son had gone running in the woods and hadn’t come home.\nTwenty-four hours was a long time to be missing a child.\nEventually, though, his dad relaxes and hugs Stiles a whole lot while they both manfully pretend they’re not blinking back tears, and the sheriff gives Stiles one entire day of rest before he returns to school.\nIt’s surreal, to go from thinking he was going to die in the woods to walking back into school as if nothing happened.\nExcept everyone’s staring.\nApparently going missing for a week only to turn up suffering from ‘dehydration’ and no other wounds was enough to make Stiles go from invisible, to social pariah.\nHe makes his way to his locker, fights with the sticky lock, and before he can pull the door open, Scott McCall -- co-captain of the Lacrosse team and very unsubtle werewolf -- hops out of the crowd and beams at him.\n“Stiles, hey, hi, I’m Scott,” he says brightly, before thrusting a pile of books and papers into Stiles’ arms. “I’ve collected your homework for you and I even got Boyd to do a bunch of it. He’s the smartest of us.”\nStiles blinks at him, clutching the homework. “Uh, thanks,” he says. \nScott just continues smiling at him, eyes bright, and Stiles isn’t very good at social interaction, so he’s not sure where to go from here. “Sorry about, uh. Nearly dying.”\n“Dude, no, it’s fine, but.” He leans close, eyebrows going up pointedly. “Did Derek tell you? About --” he wiggles his eyebrows. “The thing?”\nStiles wants to step back, to reestablish his personal space, but the locker’s at his back and he’s trapped. “Uh,” he says. “Which thing?”\n“The blood thing,” Scott whispers earnestly.\n“The blood -- oh. Oh! The transfusion.”\nTo be entirely honest, in all the confusion and angst of reuniting with his father, Stiles hadn’t given much thought to the lengths to which the Hale pack had gone to in order to save his life. He wonders if maybe he ought to write a thank you card -- maybe send a fruit basket. How does one adequately thank a werewolf pack for saving his life?\n“The transfusion,” Stiles echoes. “Right. Yeah, he mentioned it.”\nScott leans even closer -- their noses are nearly brushing. “It was my blood,” he whispers. “That means we’re, like. Brothers.”\nDoes it? Stiles isn’t so sure. But it definitely means he owes Scott something more than a fruit basket.\nAnd brothers might just mean regular friends, in werewolf-language, and fuck, could Stiles ever use a friend in this fucking school.\n“You saved my life,” he says, trying to match Scott’s level of earnestness. He fails, but from the way Scott finally backs off, if only enough to make sure Stiles can see his bright smile, he’s not sure it matters. “I just thought it was Derek’s blood, I didn’t even--”\n“Derek’s an alpha,” Scott says with an easy shrug. “Deaton said his blood would do more harm than help, so.” He bounces on his feet. “Dude, I was happy to do it.”\nThen, before Stiles can prepare himself for the physical contact, Scott throws an arm around his shoulders and says, “Me an’ the others’ve been looking all over for you, you know. All year. We knew there was someone -- something -- strange but you were so good at hiding, dude.”\nHiding is easy when the entire school was prepared to pretend you were invisible, but Stiles doesn’t say that, just shoves most of his books in his locker and fishes out the ones he needs. It’s hard, with Scott’s arm around his shoulders, but he finds he doesn’t mind.\n“Well,” he says, closing the locker, snapping the lock. “I guess anything is good at hiding when compared to you and your pack.”\nScott looks appalled. “We’re not that bad!”\nStiles rolls his eyes and elbows him in the side and says, “I spotted you the first day I got here,” he says. “You’re all wearing leather and skulking around like you smell something terrible. It was straight out of Twilight.”\nScott mulls that over a bit as they begin making their way down the hall. “Okay,” he says gamely. “If this is Twilight, that makes you Bella. Right? Sheriff’s kid?”\nStile groans, because he’s not Bella, for fuck’s sake. He’s, at most, the snarky side character who went on to win an Oscar.\nThey’re at his Chemistry class, however, and Scott finally lets him go, after playfully slapping his open palm against Stiles’ shoulder, dragging it down his arm.\nIt’s only after Stiles finds his seat that he realizes that Scott McCall, werewolf, lacrosse co-captain, popular dude was scenting him.\nWhat the fuck.\nThe day gets weirder when Isaac Lahey, pretty, tall, super skinny, too many scarves, walks in to class, looks around, makes a face, and takes the seat behind him. Willingly. Despite the many empty seats.\nWhat the absolute fuck.\n*\nAt lunch, Scott is wait at Stiles’ locker again, this time with Allison Argent, his gorgeous girlfriend who smiles at Stiles even though he stumbles to a surprised stop when he sees them.\n“Stiles!” Scott says happily. “This is Allison. She’s the one who got the stuff for the antidote that Deaton needed to keep you from dying.”\n“Uh, hey,” Stiles says, before fumbling with his goddamn sticky lock and finally opening his locker. He crams his books inside.\n“Hey, Stiles,” she says, super sweet. “You’re looking better.”\n“Feeling better,” he says, grabbing his paper bag lunch. “Thanks. Should I, uhh. I don’t know the etiquette on saying thank you to packs, should I, uhm. Send a note? A fruit basket? Flowers? Edible Arrangement?”\n“Nope,” Scott says easily. “You’re good. It’s just what pack does.”\nAllison elbows him in the gut and says, “Don’t worry about it, Stiles. It’s taken me my whole life to understand werewolf etiquette and I promise you, Scott is the absolute worst at it. I’m just glad they finally figured out who the strange were was.” She rolls her eyes. “They were all driving me nuts.”\nStiles squints at her leather jacket -- it’s too big for her. It’s probably Scott’s. “You’re not a wolf,” he says, startled.\n“No,” she laughs. “Human. Come have lunch with us.”\nIt’s not really a suggestion, but Stiles has taken to sneaking his lunch in the back study stall in the library when the librarian wasn’t looking, so he’ll take it. \nScott and his pack eat lunch out on the lacrosse field, camped out on the bleachers, and Scott waves both arms when they leave the school and step onto the quad.\nA few of them wave back. More of them roll their eyes. Jackson scowls and crosses his arms over his chest and looks belligerent.\n“You’ll be fine,” Allison says quietly, nudging him. “Just stick with me and Scott. They can be intimidating but I promise, they’re a bunch of ill-mannered puppies.”\nIt’s true, Stiles realizes some time later, after watching them. He tries to keep to himself, but Scott’s exuberant and touchy beside him. Liam is, if anything, worse. Jackson, Erica and Isaac are territorial, full of hormonal posturing. Kira and Malia sit back, quiet and watchful and curled around each other.\nStiles feels a creeping sort of anxiety sitting with them, waiting for the other shoe to drop, for someone to flash fangs and lash out or threaten him or explain just what the repercussions for being a werefox on wolf land are.\nNo one does.\n*\nDerek’s pack keeps it up for the rest of the month, and it takes Stiles an embarrassingly long time to figure out that they’re probably, like. Surveilling him. Keeping their friends close and their enemies closer.\nIt’s pretty disappointing, once he figures it out, because they’d lulled him into a false sense of security and he’d almost convinced himself that maybe they just. Wanted to be friends.\nOf course they didn’t.\nIt’s Lydia who gives the game away.\nShe doesn’t like him. She’s made it pretty fucking clear that she doesn’t like his jittery inability to stay still, she doesn’t like how talkative he gets when he thinks he’s got friends. She doesn’t like how clumsy he is, how badly he fucks up when they hang out after school and help the wolves on the lacrosse team practice.\nAnd he gets it. Stiles is an acquired taste and Lydia is not all that likely to be acquired.\nNearly a month after he’s started hanging out with them at school, and Scott after school, Lydia shoves her juicebox aside, wrinkles her nose, and flicks her hair over her shoulder. She huffs and says, “I’m having a birthday party tomorrow and you should probably come.”\nStiles takes an obnoxious slurp of his pop and then realizes that she’s looking at him.\nHe glances over his shoulder, like maybe there’s someone there she could be inviting, but there isn’t, and she just rolls her eyes when he points to himself, stunned.\n“Yes, Stiles,” she says with a scowl. “You.”\nSomeone kicks her under the table and she flashes a smile but her teeth are gritted. “I mean, I would love it if you would come to my party.”\nAllison slings an arm around her shoulders and smiles sweetly and says, “Yeah, Stiles, you should totally come!”\nAnd then Stiles realizes that everyone -- everyone around the fucking table -- is smiling wide, fake grins at him and staring, like they’re all holding their breath and waiting to see if he’ll agree and -- and Stiles just. Gets it.\nBecause there is no way that Lydia Martin actually wants him at her birthday. Just like there’s no way that Jackson wants him there, or Boyd, or Isaac, or Liam, or Erica. Scott might want him there. But Cora? Kira? Malia? No way.\nIt’s all fake. It has to be. It’s the only thing that makes sense.\n“Uhm, maybe,” he hedges, and all of them look disappointed, share quick, sidelong glances. Cora’s eyes narrow and she leans closer to his side, breathing deeply and frowning, like she’s smelling him.\n“D’you have plans, Stilinski?” she asks.\nWolves can tell when you’re lying, Stiles knows they can, so he says, “Not really, no. I just. Need to check with my dad.”\nThere’s a beat of awkward silence and Scott finally breaks it, sounding almost like he’s whining when he says, “Why do you smell…” he looks at the other wolves helplessly. “Sad.”\n“Just. Thinking about my econ test next period, you know how it is,” Stiles says brightly.\n“Lie,” Cora says, soft.\nStiles starts packing his things up quickly, shoving them into his bag, and pretending they aren’t all looking like he kicked their dogs. Heh.\n“Gotta go get some last minute studying in, I’ll let you know about the party, see you later, bye!”\nHe flees.\nHe’s not ashamed.\nBut he is fucking sad.\n*\nStiles hides out in the library, skips econ (he doesn’t have a test anyway), and then walks home. It’s Friday, he doesn’t care if he misses the rest of his classes, his dad is working the late shift, and Stiles just. Wants to take some time to wallow.\nHe microwaves some Bagel Bites, drags himself upstairs and throws himself backwards onto his bed, both arms coming up over his face.\nHe’s so fucking stupid. Of course they don’t want to be his friends. Of course they’re just. Spying on him for Derek. Making sure he keeps his nose out of trouble. He was so stupid to think otherwise.\nHis phone chimes at 3:20, right when class lets out -- once, twice, three times with texts and then with two calls and then it goes silent.\nStiles tries to read for a while, tries to do some homework, to watch some Netflix, to jerk off. None of it helps break through the foggy sadness that comes from realizing your only friends are actually just secret werewolf agents keeping tabs on you.\nAnd then he falls asleep.\nHe wakes up some time later when his window is shoved open roughly from the outside and Derek Hale slides in.\n“What the fuck,” Stiles gasps, sitting up before he’s fully awake, already fumbling for the baseball bat he keeps under the bed before his eyes are open. He grabs it, brandishes it like it’ll actually make much of a difference, and stares.\nDerek’s dressed in too tight jeans and a leather jacket, shoulders hunched up and hands shoved in his pockets. He’s stubbly and scowling and lurking in the shadows and Stiles wonders for one hazy, sleepy moment if he’s actually still dreaming. Maybe this is a dream, one that’s about to get interesting, the universe paying him back for his failed efforts to jerk off earlier that evening.\n“Hey,” Derek says finally, like Stiles isn’t carefully crawling out of bed, baseball bat still held up and ready to swing for his stupidly attractive face.\n“Hey?” Stiles asks, voice embarrassingly shrill. “Hey? That’s all you’ve got to say? You break into my room in the middle of the night and that’s what you open with?”\nDerek shrugs, scuffing his foot against the carpet, and says, “I was just. Around. Thought I’d check in.”\n“Right. Right. You were just around. Because I stopped answering your puppy’s messages and you needed to make sure I wasn’t out pissing on wolf-claimed trees or whatever.”\nDerek stares at him. “What?”\n“You know! They weren’t doing the spying shit for you so you had to do it yourself!”\n“The… spying shit.”\nStiles throws up both hands, nearly smashing his light out with the bat, and says, “Do you think I’m stupid? I mean sure, it took a while, but I did figure it out. Of course -- of course they didn’t actually want to be friends with me, they were watching me. For you. Because I’m a fox and wolves don’t get along with foxes! Like you think I’m gonna -- gonna steal or chickens or whatever, but I’m not! I didn’t ask to come here, my dad got transferred here and I had to come too and it isn’t my fault!”\nDerek just stares at him, looking stony and uncomfortable, and then he says, “None of that makes sense, Stiles.”\n“Then what are you doing here!”\n“Scott’s upset.”\nStiles blinks at him once, and then again, and his words still don’t make sense. “How is that relevant?”\n“You’ve been around long enough to know how irritating he can get when he’s upset.”\n“Sure,” Stiles says, because Allison and Scott had an argument last week and the hour of angst it caused was one of the worst experiences of Stiles’ life. “But why are you here?”\nDerek crosses his arms over his chest and glares into the shadowy corner of Stiles’ room and says, “They said you… smelled sad.”\nStiles just stares. Finally, he drops his bat, kicks it back under his bed, and says, “Do I?”\nDerek shoots him a quick look. “You smell like. Like sweat. And jerking off.”\n“What the fuck.”\n“You asked.”\nStiles makes an inarticulate sound of rage and reaches for the bat again, and Derek rolls his eyes. “And yes,” he snaps. “You smell sad. Why?”\n“Because I thought they were my friends and then I realized that they were just… doing surveillance. For you.”\nDerek cocks his head, studying Stiles for a long moment. “What the hell gave you that idea? I don’t need my betas to conduct surveillance for me - if I wanted you watched, I’d do it myself.”\n“Which is also fucking creepy and possibly an explanation for you sneaking into my room in the middle of the night, but whatever. Listen. Derek. I’m not stupid. I know -- well, I thought Scott liked me. And Allison. Maybe Malia and Cora. Maybe Liam. But I’m not stupid. Lydia will never think I am cool enough to invite to her birthday party.”\n“Lydia invited you to her birthday and that’s what caused this --” he gestures around Stiles’ room, like the place has been contaminated by Stiles’ despair and his frustrated hormones. “This entire mess?”\nIt sounds stupid when Derek says it like that, but Stiles just can’t think of another reason why a group of the most attractive, popular kids in school would go out of their way to hang out with him.\nHe crosses his arms over his chest and stares at his bare toes and says, “There’s no way she actually wants me there.”\n“She doesn’t,” Derek agrees bluntly. “But she’s pack. And pack does what is best for the pack, even if it goes against what you personally want. And the pack -- most of the pack -- wants you at that party because they fucking like you.”\nStiles glances up at him through his lashes and bites his lip and hesitates for a moment. “They -- they do?”\n“Yeah, Stilinski. They do.” Derek rolls his eyes so hard, it’s gotta hurt. “So please answer your fucking phone because despite whatever you may be thinking, I have more important things to be doing rather than solving high school melodramas.”\nStiles can’t help a small, grateful smile, even as he says, soft, “Yeah, like lurking outside my house.”\nDerek scowls, cheeks a little pink. “I run the perimeter every night,” he says gruffly. “And part of that involves checking on the houses of -- of people in my pack. And people of interest to my pack.”\n“Like -- like enemies? Pack enemies?” he asks, uncertain.\nDerek growls a little as he pulls himself out the window again. “Like friends, Stiles. Jesus.”\nAnd then he’s gone.\n*\n“Stiles,” Lydia says with a fake sweet smile. “You made it. Awesome.”\nStiles hands her a clumsily wrapped birthday gift and a tacky foil balloon in the shape of an otter and says, “Happy birthday, Lydia, it’s a sweater and the receipt so you can exchange it at your leisure.”\nHer fake smile goes a little wry and honest. “You know me so well. Please, for the love of god, go find Scott and put him out of his misery. He’s out back.”\nStiles nods gratefully and slips past, making his way towards the back yard.\nLydia’s house is huge and it takes longer than it should, even though the house is much emptier than he’d imagined it would be. He’d sort of pictured a high school rager complete with makeshift dance floors, hip hop music, and popular people grinding on the couches, stairways and in the bedrooms.\nInstead, he finds the Hale pack clustered around a bonfire, roasting smores while Jackson plays a terrible rendition of Stairway to Heaven on an ill-tuned guitar.\n“Stiles!” Scott says, beaming and jumping to his feet. “I didn’t think you’d make it!”\n“Yeah, well. Turns out my other plans didn’t work out,” Stiles says gamely, hugging Scott back when Scott bounces into his personal space.\n“Amazing. We have booze. Well. The humans have booze. Doesn’t work well on the the wolves.” He hesitates. “Does it work for foxes?”\n“No,” Stiles says, and Scott’s eyes go wide as he leans close, whispering conspiratorily.\n“We have some wolfsbane brew, Lydia made it for us, gets us drunk, do you want to try some, I won’t tell Derek.”\n“Won’t tell me what?”\nStiles jumps -- he’s not used to people sneaking up on him, his foxy senses usually picking up the sounds of footsteps, heartbeats, but Derek is quiet and moves fast.\n“Scott’s trying to get me drunk, probably to get into my pants,” Stiles confesses automatically, even as Scott starts loudly confessing his innocence and everyone else cracks up.\n“Glad you came,” Derek says, quiet, as he brushes by, close enough that their shoulders touch.\nStiles is glad too, taking the spot Scott makes for him, and the marshmallows Liam passes over.\nIt’s a good night, full of laughing, teasing, a few flashes of wolfy eyes that make Stiles want to turn tail and run. He doesn’t, though, and by midnight, he’s slumped against Scott’s side, stomach aching from laughing.\n*\n“So,” Jackson says after gym class, leaning a hip against Stiles’ locker and one elbow up over Stiles’ head. It’s a deliberately lazy move, puts him all up in Stiles’ space, and Stiles isn’t sure he likes it.\nSure, Jackson’s pretty.\nBut he’s also an asshole.\n“Yeah?” Stiles asks, making himself look busy, shuffling through a binder like he’s looking for something.\n“Full moon tonight.”\n“Oh,” Stiles says, smirking a little. “That’s why you’re acting so squirrelly.”\nJackson’s been fucking weird this week. Hovering in Stiles’ personal space, watching him a little too close, being a little touchy. If Stiles wasn’t a realist, he’d worry that Jackson’s got a crush.\nBut this is reality and Stiles is not delusional and Jackson is far out of his league and possibly playing a sport that Stiles isn’t sure he even wants in on.\nSure, he’s got a thing for assholes, but usually they’ve got to have fluffy marshmallow centres, and he’s pretty sure Jackson just… doesn’t.\n“Just wondering if you were coming out with us.”\nStiles cocks his head, finally giving Jackson his full attention. “Out,” he echoes. “With you. And your… wolfy friends. On a full moon.”\n“Derek has a bonfire, a barbecue, a whole thing, out in the Preserve. We run together.”\nStiles isn’t 100 per cent sure but he thinks Jackson just, like. Flexed his pecs. What the fuck.\n“That’s cool. Cool,” Stiles says, narrowing his eyes on Jackson’s lacrosse jersey, trying to see if that was really a jumping pec muscle or if Jackson had just developed some sort of twitch. Either way, he ought to get it checked out by a doctor. “But why would I want to be there? I’m not a wolf.”\n“Neither’s Allison and she comes,” Jackson says. “So does Lydia, and Kira.”\nStiles isn’t sure what Lydia is but he knows it’s something not quite human. He’d asked Scott about it once and Scott had gotten all awkward and said it was her story to tell, and thus far, she hadn’t chosen to tell it. Allison, as far as he could tell, was a badass with a bow, and Kira had some sort of electrical thing that involved a sword and it was all incredibly hot and distracting and all three of them are, as far as he can tell, amazing. Much more amazing than werewolves, which made them exponentially more amazing than a mangy werefox.\n“That’s cool,” Stiles says. “But why would I want to --”\nJackson goes a little tight around the eyes. “Derek’ll be there,” he grumbles finally.\nAnd that’s… well. It’s a thing. An ill advised thing, but Stiles dares anybody with a heartbeat and a passing appreciation for the male form to look at Derek shirtless and doing pull ups for the fucking fun of it not to fall in love just a little with his abs.\nSure, Jackson’s got dancing pecs, but Derek’s got… everything.\nAnd if Jackson is out of Stiles’ league, Derek is out of his entire sport.\nBut Stiles can allow himself the pleasure of enjoying Derek’s Derekness from a distance. And he likes to. As often and in as many positions as he can.\nBut it’s possible he’s been a little obvious with his lusting after the dude if even oblivious Jackson has picked up on it.\nStiles stares at him, eyes narrowed, and then jabs him in the offending pec with one finger and says, “Whatever you think you know, you don’t know,” and also, “Will he be wearing a shirt?”\nJackson rolls his eyes. “We strip,” he says bluntly. “I don’t know how foxes do it, but wolves don’t like to get tangled in their fucking underwear.”\n“I am in,” Stiles declares. “But only because I want smores, not because of any --” he waves a hand around. “Lusting.”\n“Sure,” Jackson says, knocking his fist against Stiles’ locker once before straightening up. “Whatever you say, Stilinski.”\nHe walks away with a goddamn saunter and Stiles can’t help but watch the line of his hip as he does.\nGoddamn werewolves.\n*\nThe woods are dark and Stiles feels an instinctive urge to head for home, to hide and pretend this isn’t happening. Foxes aren’t connected to the moon the way wolves are, but it’s still an energy he can feel, a vibration in his bones.\nThey’d gathered out at Derek’s place in the Preserve, and Stiles had recognized it as the place he’d woken up in after he’d gotten caught in that trap. There was a different sort of energy than at Lydia’s birthday party -- that had been relaxed, fun and lazy.\nTonight, everyone was snappy, keyed up, eager to run.\n“You gonna run with us?” Jackson asks, a smirky sort or grin on his lips. He’s already stripping out of his clothes, and he’s hot. Stiles knows objectively, Jackson is hot. Hell, he’s seen him mostly naked in the locker room.\nBut tonight with the energy of the moon an almost palpable force Stiles finds himself unable to make eye contact. He’s blushing and his mouth is dry and his skin feels over-sensitive.\n“Can I?” Stiles asks. He’d kinda figured he’d just hang out with the humans or nearly humans back at the house. Allison and Kira had plans involving chickflicks and ice cream that sound pretty good.\n“Sure,” Jackson says, snapping his teeth. They’re just a little too sharp. “Give us something to hunt.”\n“Fuck you, Jackson,” Scott says, growling a little. “He’s joking. We’re not gonna hunt you.”\n“Oh, I don’t know,” Erica purrs, wrapping both arms around Stiles from behind, draping herself over his back. “Stiles would make delicious prey.”\n“Back off,” Derek snaps, and Erica pouts but obeys leaving Stiles off-balance and twitchy. Derek cuffs him on the back of the neck, letting his hand linger there, and says, “You’ll be fine if you want to run with us.” His voice is low and earnest. “I won’t let any of them hurt you, and there aren’t any traps out there. Those hunters were dealt with and we ran the Preserve earlier to make sure it was safe.”\nStiles shudders remembering that trap snapping shut around him. “Okay,” he says, clearing his throat when his voice comes out hoarse.\nDerek’s smile is small and careful but his eyes light up. “Yeah?”\nStiles shrugs like it’s not a big deal - like he’s ever shifted in front of someone who wasn’t his mother before. \nHe tugs off his shirt with a little bit of defiance and tosses it onto the pile with Jackson’s and Scott’s. “Sure,” he says. “Why not?”\nDerek’s eyes linger on his chest for a moment, dilating and glowing a little red, and then he fixes his gaze at something over Stiles’ shoulder and says, “I’ll keep you safe.”\nStiles… Stiles believes him.\nWhen the fuck did that happen?\n*\nThe woods are dark and Stiles is on four paws, dashing through the shadows. He’s smaller, more agile, able to slip through trails the wolves can’t navigate, and he loses them easily.\nThe vibration of the moon, the adrenaline in his veins that spikes whenever a wolf howls, all of it combines into an electric sort of energy that sends him running faster and farther than he’s ever run before. \nIt feels like his heart is going to burst but if it does, it’ll be the best way to die.\nStiles usually doesn’t feel like prey as a fox -- there are too many mice, rats and rabbits to hunt, and not many big predators, especially in the city with his mother. Here, though, the forest is teeming with wolves and it just adds to the sharp-edged energy coursing through his veins.\nA wolf catches up with him soon enough, as his paws start to tire and he slows. The teeth snapping playfully at the fluffy tip of his tail gives him a burst of speed and he scrambles up a fallen tree trunk laying at an angle up an embankment, ducks around a boulder, and scrambles up on top of it, hoping he’s too clever for whichever wolf is chasing him.\nFor a moment or two, it works, and then the wolf leaps out of the shadows and knocks Stiles clear off the boulder, sending him tumbling onto the grass. Before he can get up, the wolf has him pinned.\nThe wolf shudders and shifts above him and it’s Jackson, grinning with two many teeth, his hand holding Stiles pinned to the ground as he ignores Stiles’ snapping teeth.\n“Got you,” Jackson says, and then a dark shape darts out of the shadows and slams into him with a vicious snarl.\nThere’s a sudden scent of blood in the air and Jackson whines, shifting again and slinking off into the woods.\nThe big wolf disappears a heartbeat later and it’s Derek, looking a little feral. “Did he hurt you?” he asks, almost a growl.\nStiles is in a predicament. On one hand, he wants to squirm away and run -- on the other, Derek looks fierce and upset and his eyes are burning red and Stiles… Stiles wants to roll over and submit. And he can’t answer the question without shifting back to human and, well. Then he’ll be naked.\nAnd Derek is already naked.\nAnd Stiles does his best but even with his fox vision, he can’t see more than the hint of the angles and planes of his body, brushed with moonlight.\nHe’d lean a little to the left and tip his head for a better look, but. Well. Derek would probably notice.\nSo he yips playfully, hops forward, nips at the line of his jaw (it’s an act of submission, he knows it is, and it prickles low in his stomach, and he ignores it).\nDerek growls, low, an instinctive reaction to Stiles’ teeth near his throat, and then Stiles dances back, flicks his tail, and runs.\nIt’s an invitation to chase and Derek picks up on it, back in wolf form a moment later and tearing through the underbrush after him.\nStiles can feel his breath, can hear his heartbeat, and everything else is lost under the rush of it, the thrill of it, as he tries to lose Derek in the trees.\nIt doesn’t work, but Derek never tackles him, never pins him, just follows wherever Stiles is willing to lead.\n*\nIt’s nearly dawn when Stiles’ little paws give up and he throws himself to the ground, panting, in a moonswept clearing. He rolls on his back, twisting a little, tongue lolling, breathing in the scent of clover, tree bark, pine needles, and Derek, who stands watching, like he doesn’t understand what Stiles is doing.\nStiles flops onto his side and goes still, and Derek inches a little closer, sniffling at him, so Stiles makes a show of stretching and yawning and flopping in the grass again.\nIt’s fucking nap time and he wants, more than anything, for Derek to curl up around him and keep him warm.\nHe lets his eyes slide shut and then there’s a shiver on the air as Derek shifts. “If you fall asleep there,” he says, voice hoarse from howling, “You’ll wake up human and naked and if your dad finds you like that out here with me, he’ll kill me.”\nStiles opens one eye and tries to care, but he just… doesn’t. He closes his eye again.\nDerek laughs, low and husky and it’s something worth opening his eyes for, so Stiles does, just as Derek runs a hand slowly down his back, smoothing his fur, brushing grass out of it, and Stiles doesn’t know if foxes can purr, but he wants to try.\n“Brat,” Derek says, quiet, and then he’s a wolf again, nosing at Stiles until Stiles gives in and gets up with a grumble.\nDerek keeps herding him with gentle, firm nudges, leading towards home, and Stiles is tired. He doesn’t have whatever magic the moon sends coursing through wolfy veins. He needs a nap.\nHe does his best, stumbling along, tail and ears drooping, casting baleful glares at Derek, and then he gets an inspired idea, and before Derek can react, he hops easily up onto his back.\nDerek as a wolf is big and muscular and there’s plenty of room for Stiles to stretch out, snuggling into his thick fur, even as Derek stands still, startled, beneath him.\nFinally, with a huff, Derek starts walking the rest of the way home, and Stiles knows he’s more careful now, not running or leaping or doing anything to knock Stiles off, which he appreciates, he does.\nAnd he’ll tell him so. After he naps.\n*\nStiles wakes up to springtime sunshine cresting over the treeline, spilling through the windows of Derek’s house.\nHe’s naked and curled up with half a dozen naked peers, and Derek, tucked up against his back with one arm wrapped around his stomach.\nStiles blinks and lets all of that sink into his sleepy mind, and then resolutely closes his eyes.\nHe’s not gonna be the first one to deal with this, no way. He can wait out the wolves as they sleep off whatever lingering effects the moon left in their veins. He can.\nExcept he can hear Allison, Lydia and Kira in the kitchen, talking and laughing softly and -- he sniffs -- apparently making breakfast.\nAnd Stiles has always been terrible at holding still.\nHe eases his way out of Derek’s grip, over Scott’s legs, inches around Boyd’s naked back, and deliberately avoids making eye contact with Erica’s boobs, and then he’s free, tugging the first shirt he finds up over his head -- it’s too big, it’s way too big, it’s definitely not his. He sniffs the neckline and it smells like Derek and something small and sweet and soft curls up in his chest.\nHe avoids making eye contact with that, too, and pulls on some pants that are definitely not his.\nAllison greets him with a bright grin when he stumbles into the kitchen. “Oh, hey! Usually the pack doesn’t wake up til noon after the full moons.”\n“Probably a wolf thing,” Stiles says. His voice his hoarse and Lydia rolls his eyes but slides him a glass of orange juice.\n“Butter the toast,” she says, jerking her chin at the toaster, and Stiles drains the juice and obliges.\n“We’re almost the same,” Kira says, nudging him with her hip and smiling shyly. She’s scrambling eggs on the stove. “Me and you. We’re both foxes.”\nStiles looks at her, startled, and breathes deeply, but her scent is still strange, run through with electric current, and nothing at all like any fox he’s ever scented.\n“I’m a kitsune,” she tells him with a small shrug, biting her bottom lip and tucking her dark hair out of her eyes. “Fox spirit. Trickster.”\nStiles looks from her to Allison to Lydia and back again. “And you guys are -- Derek lets you be in the pack?”\n“Derek didn’t have much of a choice,” Lydia says primly, whipping up more eggs. “If he wanted Jackson, he had to have me. If he wanted Scott, he had to accept Allison.”\n“And I just.” Kira shrugs again. “Came along with Malia?”\n“Who’s his cousin,” Allison explains. “Sort of.”\n“And also a coyote, in case you couldn’t tell that.” Lydia purses her lips a little. “It’s complicated.”\nStiles butters some toast, stacking it and thinking it over. He’s got so many questions but doesn’t know where to start. “This isn’t like any of the wolf packs my mother warned me about,” he says finally.\n“Derek’s Pack is different,” Lydia tells him. “So I’m not sure any of her warnings would apply.”\n“He’s definitely not the regular sort of alpha,” Kira agrees. “He was never raised to be alpha.”\n“And he really sucked at it, at first,” Allison adds, pulling herself up to sit on the counter, watching Lydia scrambling the eggs. “But he got better. We all got better.”\nStiles knows a little bit about the Hale history -- Derek, losing his entire family in a tragic fire, except for Cora and Malia and an Uncle Peter who he’s never met. Scott had told him all about it, about becoming a werewolf after being attacked by Derek’s crazy uncle, how Derek had come back to Beacon Hills to kill his uncle and had inherited the pack almost by accident. And Uncle Peter, apparently, hadn’t quite stuck to being dead.\nIt’s a crazy story and Stiles has so many fucking questions.\nHe doesn’t ask any of them because it doesn’t seem his place to ask, and because he figures if he’s gonna ask anyone, it should be Derek.\n“My mom told me wolves and foxes didn’t get along, and I shouldn’t ever let anyone other than other foxes like me know what I am, and even then… foxes don’t really have a pack.”\n“I don’t know about other packs,” Allison says, like it’s easy. “But we don’t discriminate. I’m sure there’s a place for you in Derek’s pack if you want it.”\nIt isn’t her place to offer, but Stiles appreciates it all the same.\n*\nHe goes home before the wolves wake up, because it seems easier than dealing with the whole pile of naked puppies issue, and easier than getting Jackson alone to ask what the fuck his problem was, after the whole stalking thing, and especially after the way Jackson seemed to have gone from World’s Biggest Asshole to World’s Biggest Asshole Who Seems To Be Flirting. With Stiles. Like that’s a thing that happens.\nIt isn’t. Stiles knows his appeal and it isn’t there for guys like Jackson.\nOr Derek. Which is a tragedy no matter how he looks at it, so he doesn’t.\nInstead, he goes about life as normal. He goes to school, he hangs out with Scott, he sometimes hangs out with more of Scott’s wolfy friends, he sees Derek lurking around sometimes, but everything is kind of normal.\nAnd then all of a sudden, it’s not.\nThe witch starts stalking Beacon Hill virgins as graduation looms on the horizon, and at first, Stiles doesn’t even know it’s happening. Sure, his dad is extra busy at work, trying to solve a few missing persons cases, there’s one brutal murder that Stiles does his best to get sordid details from his dad about, but other than that, there’s homework and gaming with Scott and that’s about all.\nThey go bowling -- Stiles and Scott and Allison, and Stiles is totally cool with being the third wheel, he’s used to it, so he has an amazing time, and then Allison and Scott are flirting as she pretends to show him how to make his shot, like he’s never fucking bowled before, so Stiles makes his way to the concession stand because he’s gonna need a blue raspberry slurpee with extra sugar to deal with this.\nAnd before he gets there, he runs into Liam, who’s looking a little, well. Squirrelly. His eyes are flashing gold and his fingers are flexing and he’s breathing hard, hunched in on himself in the hall leading to the bathroom, like he’s trying to hide it.\nStiles doesn’t know Liam well -- he’s a freshman, a new werewolf, has temper problems. Other than that, the kid’s just a hyperactive, naive sort of mystery who Stiles woke up naked with.\n“Hey, Liam?” he asks, a quick look over his shoulder to make sure no one else is noticing Liam’s wolfy little problem. “You okay?”\n“Do I look okay?” Liam hisses. It comes out slurred because he’s got fangs. Shit. “No! No I am not okay!”\n“What’s up? Need to get out of here?” Stiles isn’t an expect on wolves but he knows a little about control, and usually avoiding whatever is inspiring the lack of it is the first step to keep from losing your shit and shifting in public.\n“What’s up? Hayden’s here,” he moans. \nStiles doesn’t know a Hayden, but he looks around again. Liam’s younger friends are all cheering each other on excitedly a few lanes away from Allison and Scott, and if there’s a Hayden here, Stiles doesn’t recognize her.\n“Behind the counter,” Liam says, pointing.\nThere’s a cute girl working the shoe counter. Right. “And Hayden is…”\n“My worst nightmare.”\nLiam’s cheeks are pink and growing furry and Stiles does not have time for these young werewolf hormonal situations.\n“Right. Okay. Why don’t we get you out of here? C’mon.”\nHe takes Liam’s arm, hauling him out of the bowling alley and propping him up against the brick wall outside, grabbing his phone and texting Scott real quick, letting him know that something’s come up and he’ll see him tomorrow.\nChances are, Scott’s not gonna notice he’s gone, but whatever.\n“You got your phone?” Stiles asks, and Liam takes a deep, shuddery breath and pulls it out of his pocket, unlocking it for him.\nIt only takes a moment or two to find Derek’s name in Liam’s contacts, and he hits call and takes a few steps away to give Liam time to catch his breath and rein in the claws.\n“What,” Derek answers.\n“Hey, Derek, it’s, uh. Stiles.”\nInstantly, Derek’s voice is a little less snappy but much more gruff. “Are you okay.”\n“You need to learn to punctuate,” Stiles tells him. “Listen, one of your little wolves is having a bit of a control problem, I just wanted to let you know. I mean, I think he’s fine? But there’s also a possibility that he’s about to stalk a girl in his class and either lick her over or disembowel her, so I thought I ought to let you know, because I’m a tiny bit worried that he’s not going to react well when I try to shove him in my car.”\nDerek growls. “Fucking Liam. Bring him home, he’ll be fine. He won’t hurt you. None of them will hurt you.”\nIt sounds something like a promise.\n“Uh, cool. Okay. Thanks.”\nHe hangs up before Derek can answer, and hustles Liam into his Jeep.\nLiam is much calmer by the time they get to his place, fangs carefully tucked away, eyebrows firmly in place, and he looks pretty sheepish.\n“I’m not gonna hurt her,” he says, scowling at the dashboard. “I just. She just gets in my head. And it’s hard to stay in control.”\n“You gotta work on that,” Stiles tells him, serious. “You can’t go losing control because a pretty girl makes you mad or whatever. You can hurt people, Liam.”\n“I know,” he mumbles. “It’s just… hard.”\n“It’ll be harder if you come down after losing your shit and found out you hurt her. Get your shit together and stay away from her until you do.”\nHe leans over, shoves the door open, because he’s tired and he doesn’t have time for this. \n“Yeah. Okay.” Liam slumps out of the car and drags himself miserably up to his house and Stiles watches to make sure he gets in okay.\nThen he texts Derek’s number -- which he never asked permission to have but he’s not gonna feel bad about it, no -- and says, “Little wolf safe at home.”\nDerek texts back almost instantly. “Thx.”\nStiles snorts and heads home.\nHe gets halfway there before the world suddenly gets darker, the stars winking out and shadows growing thicker, and then his Jeep just… dies.\nAnd there’s a woman dressed in rags standing on the road a few feet in front of his car, all cast in shadows.\nStiles freezes. He’s not even sure his heart is beating but one thing he knows before is that he is completely fucked and something has gone very, very wrong.\nHe should run. He should shift and run as far and fast as he can.\nThe woman starts walking towards his Jeep, lifting a hand that glows bone white in the darkness, that’s crisscrossed with scars.\nAnd Stiles fumbles for his phone and calls Derek.\nDerek answers and Stiles doesn’t give him the chance to say anything, just starts to babble. “So either it’s Halloween early or there’s a scary woman in a costume about to murder me, Derek, and I think it’s probably that one because it’s real dark and my Jeep stopped working and I -- and I --\n“Where are you? Stiles. Where--”\nThe woman tears the door off his Jeep like it’s easy and Stiles kicks out at her, losing his phone as he does, and when his feet make contact, her chest crunches beneath them like leaves in the fall.\n“Oh god, oh shit,” Stiles gasps, and she wraps a cold hand around his ankle and pulls.\nShe looks frail but she’s strong enough to drag him from the Jeep, sending him falling to the pavement, and her hood falls as she stands above him.\nHer face is a raised, dried network of scarring with two dark eyes and a slash of a mouth and Stiles can’t help scrambling back and screaming.\nHe tries to shift but she lifts a hand and closes her fist and it’s like all the magic inside him is cut off, like he’s being strangled, and he can’t breathe, nevermind become a fox.\n“Well, that’s interesting,” she purrs, falling to her knees beside him. “Your blood is like nothing I’ve ever tasted, Stiles. A virgin and a shifter? Your blood will sustain me for years.”\nStiles’ heart is beating rabbit fast and he can’t move, can’t think, can’t breathe, and she’s got a wickedly sharp knife in her hand, at his throat, and he’s going to die like this, on a random road halfway home, all because Liam couldn’t keep his goddamn hormones under control.\nAnd he’s going to become one of the horrific murders or missing persons cases his dad has been working on in the last few weeks.\nThey’d worried it was a serial killer but it was a goddamn witch.\nShe uses the knife to cut open his shirt, from neck to hem, pushing it open with a brush of cold hands.\n“Hold still, Stiles,” she says, a rasp that makes him want to scream, before she draws the knife down his chest, making a shallow cut that stings more than anything and quickly wells up with blood. She runs her fingers through the blood and begins to paint sigils on his chest, his neck, his face, with his own blood that dries sticky.\nStiles just keeps gasping like a fish out of water, fighting against the paralysis, but he can’t fucking move.\nHis temples are wet and sticky like the rest of him and it takes him a moment to realize that it’s from tears, not blood.\n“Almost done,” she says, like she’s trying to be sweet. She brings one bloody thumb up to her lips and sucks the blood off of it and it’s like her face shifts, shimmers, a younger mask dropping over the ruined skin -- and it’s his English teacher.\nAnd then she presses the blade to his throat.\nThe knife burns cold against his skin and Stiles wants to close his eyes but he can’t.\nSo he sees every brutal, bloody part of Derek appearing, dark and huge in his wolf form, and tearing her off him by the throat.\nShe screams curses as she dies, dark magic arches out and up from her clawed finger tips, dying before it can do any harm, as the curses turn to wordless screams of pain and then strangled gurgles because her throat’s been torn out.\nDerek doesn’t stop tearing her apart until she’s stopped breathing and as soon as she does, with a snap, the paralysis is gone and Stiles can draw a full breath.\nHe wants to scream or cry or something but he can’t -- can just lay there, gasping, while his blood runs onto the pavement with his tears.\n“Stiles,” Derek says, urgent, leaning over him just as the witch had done. “You’re okay. You’re okay.”\nHe pulls Stiles up so he’s sitting, tries to pull the torn remains of his shirt closed over his bleeding chest, and quickly gives up, tearing it from him to wipe at the blood instead.\n“You’re fine,” he says. “Stiles, tell me you’re fine.”\n“I--I--” Stiles is shivering, in shock. “I need to call my dad. Derek, I need --” and then he’s crying brokenly and Derek is cursing and holding him too tight.\nWhen the sheriff arrives, Derek’s wearing a pair of Stiles’ gym shorts that are doing absolutely nothing to contain his thighs, and he’s wrapped up tightly around Stiles, who is shirtless with blood smeared all over his chest and face. The wound on his chest has healed and he’s stopped crying, but he’s still shaking.\n“Stiles, Jesus,” his dad says, falling to his knees beside them both, cupping Stiles’ face with both hands, scanning him for injuries. “What happened?”\nHe looks at Derek, at the torn up body, and then at Stiles again. “Shit,” he says. “Shit, Stiles do you need a hospital?”\nAnd then he crushes Stiles into a hug, shaking nearly as badly as Stiles is, and Stiles says against his shoulder, “I’m okay. Dad. I’m okay. I swear. Derek got here in time -- this is. This is what all those safe sex lectures get you, dad. If I hadn’t been a virgin, she wouldn’t have -- wouldn’t have tried --”\n“Shut up, Stiles,” his dad says tiredly, smoothing his hair back. “Just. I’m so glad -- so glad --”\nShit, his dad is going to cry.\nStiles hugs him back hard, holding onto the back of his uniform and taking a few shaky breaths to get himself under control. He meets Derek’s gaze over his dad’s shoulder and says, “Derek, you gotta go. The police are coming and you don’t wanna be linked to this shit show. Dad, I’m okay. I already healed. Derek stopped her before she could do whatever she was going to do. I’m okay.”\nIt takes him a long time to convince his dad to let him go, and longer to convince Derek to go home.\nThey tell the deputies and paramedics that Stiles had come upon the scene to see an animal attacking an old woman and he’d stopped his Jeep and tried to intervene. The animal had run off but the woman had already been dead and all the blood was hers.\nThe murders and missing persons cases stop.\nAnd Stiles doesn’t sleep for a long time.\n*\n“A few years ago, Beacon Hills was a mess for this kind of thing,” Scott tells him, while they sit together playing Halo. “It was like every week, another monster. Derek was a new alpha and it was like the entire supernatural community was coming out to test his strength. It’s a pretty powerful territory, but we got our shit together and got stronger and now, it doesn’t happen so much.”\nStiles swallows hard and focuses on the game and says, “She was gonna drink my blood to help look young and, uh.To keep up her disguise, I guess.”\nScott dies in a hail of bullets and says, “Lydia’s mom is gonna sub til they find a long term replacement and Derek thinks you blame him.”\nIt takes a beat for the words to register, and then Stiles shoots him an uncertain look. “What?”\n“Do you?”\n“Why would I --”\nScott shrugs and says, “Well, he’s the alpha. It’s his job to keep Beacon Hills safe. And he specifically said he’d keep you safe. And then you almost died. And now you’re avoiding him.”\n“I’m not -- I’m not avoiding him,” Stiles argues, still stunned. “I’m.” He doesn’t know how to say ‘afraid to leave my house’ without sounding pathetic. “I’m just. I didn’t know he’d notice.”\nScott gives up on the game entirely, turning to face him and looking perplexed. “Dude, of course he’s going to notice. You’re pack.”\nStiles laughs, a sputtering, stunned sort of laughter, and says, “What? No I’m not.”\n“Of course you are.” Scott frowns, shifting to cross his legs and lean closer, eyes narrowed. “Unless -- do you not wanna be?”\n“I don’t -- it’s not -- what I want doesn’t matter,” Stiles tells him. “I can’t be pack. Pack is for wolves and I am not a wolf.”\n“Lydia and Allison and Kira aren’t wolves. Hell, Malia’s not a wolf either if you’re getting technical. That doesn’t matter. I mean. Stiles, if you don’t wanna be, that’s cool.” He looks like it breaks his heart to say it, but Stiles isn’t going to call him out on it. “But you should maybe tell Derek before he gets anymore attached.”\nAttached.\nStiles cocks his head and pauses the game and says, “Did he -- when did he get attached?”\nScott looks more confused than ever, and now a little angry too. “I don’t know,” he says. “Maybe when you spent all that time naked and raving with fever about how pretty his eyes were?”\n“That… did not happen,” Stile says. “Please tell me that didn’t fucking happen.”\n“Or after, when you were all funny and charming and, you know.” Scott gestures to Stiles as if it’s supposed to mean something and Stiles just stares blankly. With a huge eye roll, Scott says, “Pretty and surprisingly muscular for such a narrow frame? I don’t know, dude, you’re hot. You obviously know that.”\nStiles is not hot. Stiles has never been hot. Stiles has also never been at a loss for words before, but here he was, gaping like a fish. “That doesn’t make any sense,” he says finally.\n“Jackson spent an entire month trying to get into your pants because he knew Derek wanted to and he is a little shit who’s got a problem with authority,” Scott says dryly.\n“I knew he didn’t actually like me,” Stiles says, and it should feel like a victory but it rings a little hollow. He takes a deep breath and and then says, “If Derek wanted… any of that. Then he’d have talked to me more. Or something.”\n“Dude. You’re in high school. He’s 22. And also he’s a super powerful alpha werewolf trying to coax you into being in his pack without actually asking if you want to be because he’s socially inept.”\nStiles just. He can’t. It’s too much for his brain to handle, and he flops back onto his bed and buries his face in both hands and moans. “This can’t be actually a thing that’s happening,” he says.\nScott pats his knee. “He’s pining,” he says, cheerful. “Sorry. He’ll stop of you tell him to.”\nStiles considers that. He thinks about Derek showing up whenever Stiles was hurt and needed help. Thinks about Derek easing the posion he’d been hit with in that trap. Thinks about Derek offering a bunch of lonely, damaged kids the chance to belong to a real family, even if the family was awkward and strange and Jackson was part of it.\nHe thinks about Derek, shy and awkward and angry and sneaking into his window that night.\nHe thinks about Derek’s hand running through his fur, and he thinks about waking up with Derek pressed up against his back, naked, arm tight around his stomach.\nHe peeks at Scott between his fingers and says, “Graduation is in two weeks.”\nScott flashes a chipper pair of finger guns and says, “Erica’s got a countdown going on Derek’s fridge and he hates it. But he hasn’t taken it down.”\n“Oh god,” Stiles moans, hiding his face again.\n*\nThe thing about tracking Derek down and making him use his words like a good werewolf is that it means Stiles has to get his shit together enough to actually leave his house, and that’s hard when his lack of sexual experience left him vulnerable to a witch looking for virgin sacrifices to keep up her ruse of teaching high school English.\nThe Crucible was decent as far as English assignments go but Stiles doesn’t think it’s really worth sacrificing virgins for.\nIt takes him three days to gather up his courage, and in those three days, Stiles types up and deletes at least a dozen texts to Derek before distracting himself cooking up healthy and nutritious freezer meals for his dad to keep stocked up for when Stiles goes away to college.\nIt’s a dreary Tuesday when Stiles finally shoves his feet in his running shoes -- they’ve got blood stains on them, he needs new fucking shoes -- and grabs a hoodie and steps outside.\n“Not so scary,” he says, scanning the street for any hint of threat. It’s rainy, and other than Mrs. Henderson out walking her Yorkie, the street is quiet.\nHe twists his keyring nervously around his finger and then hops down the front steps, intending to drive out to Derek’s place.\nAs soon as his feet hit the sidewalk, however, Derek says, “Should you be out here alone?”\nStiles yelps, spins around so quickly, he rolls his ankle, causing him to stagger sideways, catching himself on the side of his Jeep.\n“What the fuck,” he says, staring at Derek, who’s suddenly appeared beside the shrubbery lining Stiles’ driveway. He’s wearing that stupid leather jacket again, those same tight jeans, his hands shoved in his pockets and shoulders hunched. He looks wet and miserable, like he’s been out here a while.\n“You don’t even have a coat. That sweater isn’t waterproof. You’ll catch a cold.”\nStiles stares at the hoodie he’s got clutched in a ball in his hands and then back at Derek and says, “You’re worried I’m gonna catch a cold?”\nDerek shrugs, looking grumpy. “Well. You don’t seem to have the best sense of self-preservation.”\nStiles pushes himself away from his jeep, taking a few steps closer to Derek, who watches him warily. “That witch wasn’t my fault,” Stiles says, and his stupid voice has gone a little breathy.\nDerek swallows hard, eyes going dark. “Did I thank you,” he asks, licking the rain off his bottom lip before adding, “For looking after Liam that night? You didn’t have to, and it nearly got you killed.”\nStiles comes a little closer. “Couldn’t really let him go feral and attack a girl just because he’s got a crush on her,” he says. “Could I?”\n“It wasn’t your problem to solve.”\nStiles hesitates now, chewing his bottom lip in thought and watching Derek carefully. “I don’t know, Derek,” he says, slow. “It kind of seems like that’s something pack’s supposed to do. Take care of each other.”\nDerek looks a little wary, studying Stiles just as carefully as Stiles had looked at him a moment before. He rubs at the back of his neck, shifts on his feet, and Stiles almost thinks Derek is going to panic and run. He wonders if he’d be able to catch him, and figures that maybe he can, in his fox form.\n“Are you pack?” Derek asks finally, abruptly.\nA few weeks ago, Stiles might have taken that to mean Derek didn’t want him to be, but now he’s not so sure. “If you want me to be,” he says, quiet.\n“You’re smart,” Derek tells him. “You’re clever and you’re kind. You pay attention. You notice when people need you, even if you don’t know them well. You’ve gotten Lydia to warm up to you in only a few months. Scott would never let me forget it if I didn’t let you into the pack.”\n“But what about you,” Stiles asks. “What do you want?”\n“You,” Derek says, and then he clears his throat, his cheeks a little pink as he glares at the ground and says, “I mean. I want you in the pack. I want you--”\n“Do you want to go on a date with me some time,” Stiles asks, all in a rush, and Derek stares at him.\n“You’re in high school,” he says.\n“I’m 18.”\n“Your dad’s the sheriff and he knows every single way to kill a werewolf, we can’t --”\n“Derek,” Stiles says, exasperated and fond and thinking that maybe, maybe Derek just as much of a social disaster as he is. “I graduate in a week. And you’re 22. My dad’s not gonna kill you. You’ve saved my life twice.”\n“That’s not really -- I put your life in danger twice,” Derek corrects. “That trap never would’ve--”\n“Derek.”\nDerek snaps his mouth shut, scowling, and Stiles finally closes the distance between them, running his hands up the rain-slicked leather of his jacket, and straightening the collar. He can hear Derek’s heartbeat speed up, just a little, as well as the way he breathes more deeply, like he can’t quite help wanting to breathe Stiles in.\nStiles rubs a thumb along Derek’s bottom lip, wiping the rain away, and he smiles brightly. “Maybe we should talk about this next week. At Lydia’s graduation party.”\nDerek swallows hard and studies his eyes for a moment before his gaze follows a stream of rain that Stiles can feel build up on his eyelashes before spilling down, to his mouth.\nDerek doesn’t look away for a long moment, and when he finally meets Stiles’ eyes again, he says, almost helpless, “A week’s a long time to wait.”\n“You’ve probably been lurking outside my house for longer,” Stiles laughs and it catches him off guard when Derek evidently decides that he’s waited long enough, tugging Stiles that last half a step that separates them and kissing the laughter right off his mouth.\nIt only takes Stiles half a second to get into it, to forget about his laughter, about waiting, about his dad with a shotgun full of wolfsbane. He pushes up into the kiss, holding onto Derek’s shoulders and forgetting all about the nightmares and worries that had kept him hidden in his house since the witch nearly killed him.\nWhen Derek finally lets him breathe, Stiles clings to his shoulders and pants, “You know the best way to keep me safe from crazy witches sacrificing virgins would be to fuck me, right?”\n“Jesus,” Derek laughs, and then he’s taking Stiles by the hand and tugging him towards the front door. “You’re going to have to wait at least a week for that.”\nStiles figured he’s waited his whole life for somewhere to belong, so another week… well, that’s nothing.\nThe End."
}