{
    "id": "1889694",
    "url": "https://archiveofourown.org/works/1889694?view_full_work=true",
    "author": [
        "CryptoHomoRocker"
    ],
    "title": "The Bucky Barnes Guide to Household Management",
    "rating": "General Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "The Avengers (Marvel Movies)",
        "Captain America (Movies)",
        "Marvel Cinematic Universe"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Steve Rogers"
    ],
    "characters": [
        "Steve Rogers",
        "James \"Bucky\" Barnes",
        "Tony Stark",
        "Natasha Romanov",
        "Sam Wilson (Marvel)",
        "Clint Barton",
        "Bruce Banner",
        "Thor (Marvel)"
    ],
    "additional_tags": [
        "Domestic",
        "Domestic Avengers",
        "Fluff",
        "Knitting",
        "Post-Winter Soldier",
        "Cooking",
        "Oblivious Steve Rogers",
        "Protective Bucky Barnes"
    ],
    "language": "English",
    "series": "",
    "published": "2014-07-03",
    "completed": null,
    "words": "5,506",
    "chapters": "1/1",
    "comments": "271",
    "kudos": "17,524",
    "bookmarks": "2,895",
    "hits": "153,748",
    "summary": "<p>\"Steve doesn't even notice at first, is the thing.\"</p>\n<p>Or: Steve is unobservant, Bucky learns to be good at things that aren't killing people, and knitting happens.</p>\n<p>(Written for starlight_sugar, who requested \"domesticity, and also knitting.\")</p>",
    "notes": "",
    "text": "Steve doesn't even notice at first, is the thing.\nHe tells himself that it’s understandable after the fact, that he's had a hard couple of years, what with being unfrozen and then fighting gods and monsters and corrupt government agencies, but the truth is he might not have seen what was going on even before all that happened, because there are some things he’s just not very observant about.\nSam is the one who eventually points it out to him, because Sam is the kind of guy who notices these things.\n\"Huh,\" he says, looking around the entryway. \"Did you get a maid or something?\"\nSteve frowns up at him from where he's untying his shoelaces. \"What? No.\"  Natasha had suggested that he hire a maid once, having seen how quickly his apartment turns into a disaster area when he's alone, but Steve had balked at the idea. He used to live with people who worked as cleaners and maids—he doesn't think he'd be able to hire one, no matter how bad things get.\nSam raises his eyebrows. \"Okay. So you finally started cleaning, then? I have to admit, I'm impressed. I thought I'd come over one night and find you buried under your own trash.\"\nWhich is deeply unfair. Steve is not a disgusting garbage monster, Sam is just freakishly tidy. Steve looks around and realizes that the laundry basket is no longer sitting on the couch, the cups crowding the living room table have all disappeared, and the carpet in the hall looks suspiciously as though it has been vacuumed. And it smells nice, light and clean and slightly chemical.\n\"I'm pretty sure I didn't do that,\" he says finally.\nSam shakes his head. \"You're pretty sure? You don't know?\"\n\"Well, who else—Stark. Of course.  He must have hired somebody for me.  Probably thought he was doing me a favour.\"  He thinks about how much it must have cost him and tries to suppress a wince.  He forgets sometimes that he knows rich people now.\nSam shakes his head again, looking more amused than baffled now.  \"You honestly think Tony Stark would do something like this without telling you?  Loudly and repeatedly?\" He looks around again.  \"Either you've got elves or you've gotta start looking closer to home.\"\nIt takes him a while even after that.  He forgets sometimes that he doesn't live alone anymore.\nHe asks Bucky about it a few nights later, when they're both in the living room.  The television is on, because Steve's working his way alphabetically through Tony's very long list of \"Shows Cap Has to Watch So He Stops Feeling Like a Sad Grandpa.\"  He hates that list, but since he's started to go through it he does feel like less of a sad grandpa.  He's on The Golden Girls now, which he likes mostly because he knows that Peggy liked it, back in the day.\nBucky is curled up against the arm of the couch, dressed in a pair of Steve's old sweats.  He has clothes of his own—Steve took him out shopping months ago, and then Clint took him out re-shopping after he saw the things he'd bought with Steve because “not everyone loves khakis as much as you, Steve, Jesus”—but he tends to wear Steve's things instead, even though the sleeves trail over his hands and the pants hang too loose and too long.  His feet are bare.  He's watching the television, occasionally chuckling a little when Estelle Getty cracks wise.\n\"Bucky?\"\nHe turns his face to Steve's then, no hesitating, not like when Steve had first brought him home and he had to think carefully about the name every time he answered to it.  He looks at him wordlessly, waiting for him to continue.\n\"Have you been, uh.\"  Steve shifts a little, unsure of how exactly to have this talk.  \"Cleaning?  The apartment, I mean?\"\nNo hesitation again.  Just a quick nod, and then, \"Yeah,\" Bucky says.   His voice is still hoarse and too quiet, one of the most tangible reminders of all the years he didn't use it. \"A few times.  Just while you were out.\"\nThere's nothing there, no tone or expression to clue Steve in to what he's thinking.  He lets it sit for a few seconds before going on.\n\"Why?\"\nA slight crease appears between Bucky's brows.  He looks at Steve for a moment as though he thinks the question might be a trick.  \"Because it was messy?\" he offers at last.  \"And because I know how long it takes for you to notice things like that?\" He does have a point there.  Military training aside, when left to his own devices Steve tends to forget that he lives in a pig sty. \"I mean, I'm not really doing anything all day. Might as well make myself useful, right?\"\nThere had been a day, not too long after Bucky had come to live with him, when Steve had asked him to join the Avengers, against the wishes of... well, pretty much everyone except Sam and Natasha, who'd been there for his recovery and knew.  He's not Natasha, he can't talk people into jumping off cliffs and thinking it was their idea—he’s not even Tony, who people seem to listen to out of sheer fascination—but he can be pretty convincing when he wants to be, he thinks, when he believes in what he's saying. (And he had.) He'd explained what Bucky could do to help people, how he could make a difference in the world, who he could save and protect by using his skills to be a shield instead of a weapon. Bucky had heard him out, still and patient like he was waiting for a clear shot, and then said \"No.\" Nothing else. Just \"no.\" It was so absolute that Steve had never asked him again.\nMaybe it had been a mistake to even ask.\n\"You don't have to, you know,\" he says.  The crease between Bucky's eyes deepens.\n\"I know,\" he replies, sounding so honestly confused that Steve feels compelled to continue.\n\"I don't want you to feel like you have to earn your keep,\" he elaborates.  \"You're my friend.  I want you here no matter what-\"\nBucky's face shuts down completely, cutting him off.\n\"Steve,\" he says, his voice quiet and calm. Steve remembers that tone. It's always been his cue to shut up for a few minutes and listen.  \"You ever think that maybe I want to earn my keep?\"\nSteve has not thought about that.  Bucky seems to read this on his face.  He sighs, carding a hand through the length of his hair.\n\"It kills me that I can't help you,\" he says.  It sounds like he's forcing the words out from between his teeth.  \"You can do so many things I can't now.  You're helping people, you're saving the world every other damn day.  And I-I've thought about it, coming with you, I have, but I can't. You've seen me when we even watch movies with guns or loud noises in them, right? I get too twitchy.  I get scared. I can't use what HYDRA did to me like you can use what Erskine gave you. But this...” He waves his hand at the apartment, which is clean and tidy and smells like Lemon Pledge. \"I can do this. I like it. I want to feel useful. I don't want to be a-a drain, or a pet-\"\n\"You're not!\" Steve blurts, even though he'd promised himself he wouldn't interrupt, because the thought of Bucky thinking that kills him. \n\"Then let me have this,\" Bucky says.  He sounds almost pleading.  \"Please. I want—I need to know I can be good at things, okay?\"\nSteve remembers the tiny apartment they'd rented after his mother had passed, how rarely he was able to help with rent.  He'd been either too sick to work or too weak from having been sick to find work most of the time, and every odd job he'd been able to find—sign painting, paper-selling, even sweeping doorsteps—had felt like the world.  He'd hated spending all of his time in bed, thinking about Bucky out there struggling to make ends meet while he waited for him to come home.\nHe smiles.  It wobbles.  \"Never thought I'd see the day when you argued for the right to clean the place,\" he says, and his voice, at least, is steady.\nBucky's smile back is small, but sincere.  \"Yeah, well, you never used to leave your dirty socks lying around so damn much.\"\n\"Jerk.\"\nThat earns him a bigger, brighter smile, the kind that makes him ache a little bit.  He smiles less than he used to now, and every time he does Steve feels victorious, even if he’s not the cause.  \"Punk,” he says, and Steve knows it’s going to be okay.\nThey don't talk much more that night.  Bucky sits pressed against the arm of the couch, his bare toes just brushing Steve's thigh.\n“Elves, man,” Sam says the next time he comes over.  His mouth twitches a little, his eyes landing on Bucky curled up in one of Steve’s battered wing chairs, reading.  “Or maybe just one.”\n***\nMonsters happen a few weeks later, crawling out of the New York sewer system like a bad joke.  They keep him out of the apartment for a few days—there's the planning, and then the fighting, and then what feels like an endless round of press conferences in which he has to explain to crowd after crowd of shouting journalists why half of the Manhattan Line is shut down, because apparently all the other Avengers voted him their official media liaison at some point. \n\"It does make sense,\" Sam says as he drives him home.  Steve's bike somehow got eaten by one of the creatures, which can apparently digest steel, and he didn't want to have to go home on foot while he's still suited up.  He'd tried that once before and got mobbed in front of an artisanal bakery.  He doesn't think he'd be able to manage the walk today even if that weren't the case—serum or no serum, his whole body hurts.  \"You've got that whole clean cut, all American, aw-shucks-I-cannot-tell-a-lie thing going for you, they like that.  Besides, who else could do it?  Bruce is too shy, Thor's logic is not like our Earth logic, Clint and Natasha hate the spotlight, and Tony's… Tony.\"\nThinking about it like that, it does make sense.  Steve wishes it didn’t.\nHe's still sore when he walks through the front door, but the worst of the pain has ebbed, replaced with a full-body ache that makes him think longingly of the days when aspirin actually worked for him.  It takes him a minute to realize that the apartment smells different.  Clean still, but sweet, floury, warm.  He follows the scent to the kitchen, where Bucky is sitting cross-legged on the floor in front of the oven, staring intently through the glass on its door.\n\"Hey, Buck,\" he says, bemused.  Bucky nods but doesn't look up.\n\"How were the monsters?\" he asks.\n\"As advertised.  Big, mean, scaly.  A few were green.\"  He squats next to Bucky, staring with him.  He can't really see what's inside, since the oven light's not on, but he can make out the faint outline of something in a round pan.  \"What have you been up to?\"\n\"Coffee cake,\" Bucky replies.  \"One of those cooking shows was on all morning.  I saw someone make this.  It looked like something you'd like.\"\nSteve smiles, touched.  Bucky glances at him sidelong, a brief little flash of the eyes, before turning back to glare at the oven door like he's trying to will the cake to bake faster.\nIt isn't that great—it's a little too dense, and the crumble on top comes out burned—but Steve eats it all anyway, Bucky watching him the whole time.\nCoffee cake is just the beginning.  Bucky had never shown much of an aptitude for cooking when they were young; they'd lived on bachelor rations, beans and day-old bread and whatever they could find on the cheap, except when the old woman who lived in the apartment across the hall had taken pity on them and sent over something she'd made.  But now he makes something new every day.  Sweets seem to be his favourite (he makes a mean Brown Betty, Steve discovers), but he does real dinners too, shepherd's pie and beef stew and chicken dumplings with soda bread.  It's all food Steve remembers from his childhood, heavy, Irish dishes that stick to his ribs and make him feel sleepy and content. \nAfter a few weeks, during which Steve eats all he can and smuggles the rest out to pass off to the family three doors over, Bucky starts to move out of his comfort zone.  There's a week when he makes nothing but complicated sauces, throwing them on top of whatever they have in the fridge.  (Mole and refried salmon turns out to be surprisingly tasty, but even Steve can't finish the hollandaise hot dogs.)  There’s another when he sees a show about sushi and spends three days making nothing else, skeptical of its edibility even as he feeds it to Steve (“you don’t even cook it, Steve, you can’t tell me that’s right”).  One week he makes nothing but fancy, airy desserts—his flan collapses, but the others turn out fine.  Steve finds that he likes trying to guess what kind of week it’s going to be by looking in the fridge and seeing what new, strange ingredients are crowding the shelves.  He gets pretty good at it after a while.  \nThey've never gone grocery shopping together before, really—that had meant something different when they were young, and food was something you had to fight to get enough of.  Taste hadn't mattered then.  It hadn't mattered later either, when Bucky had first started venturing out to Whole Foods with Steve, huddled up small in an oversized hoodie and avoiding people's eyes.  Steve had had to steer him by the elbow, gripping tighter when some loud noise or sudden movement had spooked him.\nNow he's the one being led, watching with fascination as Bucky inspects the ingredients available to him with a critical eye.  He has to smell everything, touch everything (with his flesh hand—they learn that quickly, after he accidentally bursts a tomato all over himself while trying to squeeze-test it with his metal one).  Steve can't tell half the time what makes him nod and put something in his basket, what makes him scoff and toss it away.  It reminds him, oddly, of watching him at target practice, the way his eyes move constantly, seeking out weak spots.\n \"You ever thought of cooking professionally?\" Steve asks one day after he's cleaned his plate.  \"You could, you know.\"\nBucky shakes his head.  \"I don't want to do it for everyone,\" he replies.  \"Just you.\"\nBeef Wellington is Bucky's Waterloo. He tries to make it three times in a row with no success—the first time the pastry burns, the second time the beef is undercooked, the third time he forgets the pate and the whole thing is dust-dry and bland. Bucky doesn't try again after that, moving on to other dishes without saying a word.  Steve thinks he must have forgotten about it.  But a few weeks later he comes home late to the smell of beef and pastry and spices, and sees Bucky standing triumphantly in the kitchen, the table already set.\n\"I did it,\" he says, and he looks so happy that Steve forgets how tired he is, how badly he wants to lie down and sleep.\nThe Wellington is delicious, tender and flavourful, the pate soaking into the pastry just right.  Steve's never had to fake his enthusiasm for the food Bucky makes him, even when it's bad, but he feels like he could eat this every day for the rest of his life.\nHe looks up at one point and sees Bucky watching him, his chin resting in one hand.\n\"What's wrong?\" he asks, after swallowing a huge mouthful of meat and pastry.\n\"Nothing,\" Bucky replies.  His mouth curls slightly at the edges.  Like paper in a fire, Steve thinks, and his fingers itch for his drawing pencils.  \"I just like watching you eat.\"\nAnd suddenly it's 1940 again, with Bucky across from him at the wobbly card table they'd rescued from a junk heap and dragged up to their apartment, pushing his half-full plate over to him and insisting that he just isn't hungry. That same smile played on his face then, watching Steve eat, even though he knows—knew then, too---that he was lying. He was hungry. They were both hungry all the time.\nBucky took care of him then, and he's taking care of him still, after everything. The thought makes Steve's breath hitch.  He reaches out and touches Bucky's arm, the metal one, and Bucky starts a little at the pressure.  (Pressure, he confided to Steve one night, is all he can really feel with that arm.)\n\"Buck,\" he starts, and then stops.  How do you say thank you for all those years of someone looking out for you?  How do you say thank you for someone caring more about you than they do about themselves?  \"This is really good,\" he says instead, knowing that it's inadequate but not knowing how to make it better.\n\"I know,\" Bucky says, all confident and cocksure, sounding so much like the Bucky who used to turn girls' heads at the dance hall that Steve can't help but laugh and throw his napkin at him.  Bucky catches it, looks pleased, looks away.\n***\nSteve doesn't usually enter Bucky's room without knocking.  In the early days of his recovery being startled would set him off like nothing else, and he'd backslid that way a few times, just from Steve entering a room.  But he seems to be better now—Steve can't even remember the last time he accidentally tore a door off its hinges—and so he's gotten lax about it, occasionally forgetting and just walking in without a sound.  Which is what happens the day he goes in there to ask Bucky something and finds him hunched over a pair of knitting needles, his brow furrowed with concentration.\nIt's not the first time Steve's seen a man knitting.  It's the twenty first century, after all, and a lot of things are fine now that weren't when he was growing up.  But he has to admit that he's a little surprised, partly because Bucky is so engrossed in what he's doing that he doesn't seem to know he's there.\nHe coughs, hoping to alert him to his presence as gently as possible.  \"Hey, Bucky,\" he says softly.  Bucky looks up, his face an intensely focused mask.  His hands don't stop moving.  \"I’m going to the store in five, you coming out?\"\nIt seems to take a minute for Bucky to process what he says.  Then he nods, glancing back down at the tangle of yarn in his lap.  \"Soon,\" he says.  \"I just wanna finish this row first.\"\nSteve doesn't really know what to say to that, so he nods and lets the door fall shut.  As he turns to walk away he hears Bucky begin to murmur, \"Knit one, purl two…\"\nHe waits a few days before bringing it up, unsure of how Bucky will react.  The cleaning and cooking were one thing.  He doesn’t see how this is the same.  When he asks over morning coffee, hesitantly, Bucky shrugs.\n\"Sam taught me,\" he replies.  \"He said some of the guys he counsels have started doing it. Said it helps to have something to do with your hands.\"  He holds his own hands out in front of him, gleaming metal and soft flesh.  \"I’ve got to hold back with my left, though, otherwise I rip the yarn.\"\nSteve thinks of that still, concentrated look on Bucky's face, the minute wrinkle between the eyebrows.  \"Does it?\" he asks.  “Help, I mean?”\n \"A little,\" he says.  \"I can't do much yet, though.  Just straight rows.  Sam's going to teach me to do the harder stuff later.”\nThat’s all he seems to want to say on the subject.  He closes his mouth and leans over the newspaper, squinting at the funnies like he can make them actually funny through sheer force of will.\nBut that night, while Steve is watching television, Bucky plops down next to him with his needles and yarn.\n \"What are we watching?\" he asks.  He doesn’t actually look at the screen, just frowns down at what he’s making.  It doesn’t look like much of anything yet, although Steve is pretty sure it’s blue.\nHe checks the menu.  \"I Love Lucy,\" he reads.  The note on the Sad Grandpa list says that he’ll like this one “because it’s old.  And you’re old.  So.”  “You might like it.”  After all, Bucky’s old too.\nBucky nods and doesn't ask any more questions, the only sound from him the clacking of his knitting needles.  Steve watches him as much as he watches the program, the movements of his metal hand a little fast than his right.  The light of the screen washes him out, makes him look pale and delicate, turns his eyes a bright, electric blue.\nAfter a few minutes he stretches out, draping his legs across Steve’s lap.  He doesn’t look up as he does it, or even change the speed at which he knits. Like it’s nothing.\nBut it’s something.  Before the fall, the ice, the war, Bucky had been a very tactile person, always ruffling Steve’s hair or slinging an arm across his shoulders and pulling him close.  It had been hard for Steve to get used to when they’d first met.  Then, when he came back, he avoided touch completely, flinching if he even got too near when they passed one another in the hallway.  He’s gotten more comfortable since then, he can stand brushing Steve’s fingertips with his own when he passes him a plate, doesn’t squirm when their shoulders touch in the movie theatre.  But this… this is more physical contact than Steve has had with him since they were boys.  He is a warm and heavy weight, and Steve can feel his face prickling with heat.\nHe looks away from him, keeping his eyes locked on the screen.  He’s lost the plot at this point.  Lucy is wearing a fake nose, he’s pretty sure. \n“You okay, Rogers?”\nHe can feel Bucky’s eyes on him all of a sudden.  His voice is low.  Steve hopes the light from the screen washes him out the way it does Bucky, turns him blue and white so he can’t see the colour on his cheeks.\n“Never better,” he replies, hoping he sounds cheerful and not like he’s about to swallow his tongue.  “Never better.”\nIt’s true, he thinks firmly, and pays strict attention to the television.  But later he can’t remember anything he watched.\n ***\nA few days later Steve enters his bedroom and finds a lumpy, uneven blue scarf on top of his pillow.  There’s no note.  He wears it the next time he goes to Stark Tower—or Avengers Tower, as it is now officially known—for a meeting, wrapping it twice around his neck even though it's warm and sunny.\nTony notices, of course, because Tony Stark will never fail to notice things that give him an excuse to be a brat.  \"What's with the noose?\" he asks as Steve sits down.  \"Did your master finally give you clothes?  Are you a free elf now?\"\nSteve rolls his eyes.  It's a reference he understands—thanks to Clint and his weird, intense obsession with those books about kid wizards, not because of Tony—but that doesn't make it any less stupid.  \"It was a present,\" he replies shortly, sitting down and looking at the tablet in front of him. There's another mad scientist threat. Apparently this one mostly does robots.\n\"A present from the Winter Soldier,\" Natasha adds from her seat further down the table.\nFor a minute Steve is confused as to how she knows all this.  Then he remembers that just about everyone he knows now is a highly skilled covert operative and is no longer confused.  \"I told you to stop spying on us,\" he says to Natasha. \nNatasha shrugs.  \"If you really wanted me to stop you'd move into a building with fewer windows.\"\n\"And better locks,\" Clint agrees from further down the table.\n“Thicker walls would not go amiss either, Steve Rogers,” Thor adds.  Bruce nods.\nSteve ignores his awful friends, because Tony looks like he's died and gone to heaven, and that almost never means anything good for Steve.\n“The Winter Soldier,” he says.  “The bionically enhanced super-assassin you’re keeping in your living room is knitting for you now.  You couldn’t have just shacked up with one of the millions of normal people who want to sleep with you.  You had to choose a ninety-year-old former HYDRA agent with a robot arm.  Who knits.”\n“It’s probably not millions,” Steve replies, irritated.  Then the first part of what Tony says catches up to him.  He sets the tablet down.  “Bucky and I have not shacked up.”\nTony snorts.  “Please.  The last time I saw anyone look at anyone the way you and C-3P0 there do was…”  He considers for a moment.  “Well, probably me looking at Pepper, actually.”\n“Please,” mutters Nat, just low enough for Steve to hear, “it was you looking in a mirror.”\nIn other circumstances he might laugh.  Not now, though.\n“You and Miss Potts are in a relationship,” he argues.\nTony raises his eyebrows.  “I’m aware,” he says.\n“Bucky and I aren’t in a relationship.”\n“Oh?” He snorts.  “Well, if you say so.”\nThey start talking about the scientist then.  At least, the others do—Steve’s not really paying attention.  He tries to remember the exact way that he and Bucky look at each other.  He remembers the weight of Bucky’s legs on him instead, the burning of his cheeks by the light of a screen.\n“But you love Miss Potts,” he blurts out, interrupting Natasha’s recitation of the intel she’d gathered the night before.  Tony actually rolls his eyes at this.\n“I’m aware of that too, weirdly enough.”\n“But if that’s how Bucky and I look at each other…”\nHe trails off.  Behind him, somebody—he thinks it might be Bruce—coughs gently.  Tony looks at him.  His expression is one Steve doesn’t recognize immediately.\nEmpathy, he realizes.  It’s empathy.\n“Yeah,” Tony says, as though Steve has spoken aloud.  His tone is different now too, softer and almost kind.  “Kind of whacks you in the face, doesn’t it?”\nAnd maybe it really is understandable this time, because it’s not like they’ve exactly had normal person time to process things lately, but the truth is he hadn’t seen what was going on even before all that happened.  (Although maybe Bucky had—he remembers the living room again, the low timbre of his voice.)  But now that it’s said—now that it’s something he can actually think about—he can see it.  Bucky curled up on the couch, wearing his sweats.  The pages of dozens of sketchbooks filled with Bucky’s face, before and after.  The way Bucky had watched him eat, with a little secret smile, and the way he’d always taken care of him, the way he still does even when he’s half a mess himself.  Waking up after the Potomac and knowing that he’d saved him, that even in the mess that HYDRA had made of his brain there’s still something in there that knows Steve, that can’t not carry him to safety.  Knowing that if it was the other way around, if Steve had been the one who’d fallen and been emptied out and remade, there would be the same thing in his own brain, like he was born understanding that Bucky is important, that he’s Steve’s.\nHe thinks, I’m in love, and it’s like the lights go on inside him.\nHe stands abruptly, nearly knocking his chair over.\n“I’ve got to go do something,” he says, and leaves.\nAs he closes the door behind him, he hears Tony say something that sounds like, “And that, my friends, is how you do it.”\n***\nIt should take almost an hour for him to walk from the Tower to their apartment. With a creative approach to what constitutes \"walking,\" and \"crosswalks,\" and occasionally \"streets,\" it takes him fifteen. \nIt could have been ten if he’d taken a similarly creative approach to pedestrian safety, but no matter how in love he might be, he’s still himself.\nBucky isn't in the kitchen. He's not in the living room. He's not in his bedroom or Steve's bedroom or the bathroom or even the crawl space you can only get to through the hall closet. Steve is reasonably close to panicking when he passes by an open window and hears a familiar voice singing quietly, something sweet and low in a language he doesn't understand. He looks out and sees Bucky sitting cross-legged on the fire escape, golden sunlight making him look impossibly young. Underneath his singing Steve can hear the gentle click of knitting needles.  His metal arm flashes as it moves.\nHe looks up when Steve steps out onto the fire escape, squinting into the light. \"You're home early,\" he says. He is gilded and beautiful, and Steve wonders how he never realized before.  Maybe he had, maybe that’s what this has been about all along, ever since they were kids.  \"Apocalypse ain't happening yet, I take it?\"\nSteve still isn’t used to standing over him after all these years, and he doesn’t like it.  He sits down instead, folding his legs under him so they both have room—it’s a small fire escape, and they’re both bigger than they used to be.\n“It might be,” he replies.  “I just figure I have more important things to do right now than stop it.”\nHe practiced that line all the way home.  He thinks it’s pretty good.\nAs it played out in his head, he’d drop the line and then go in for a kiss immediately, and things would go from there.  As it actually plays out, Bucky moves and starts to say something just as he begins to lean forward, and he starts back immediately, suddenly sure he’d miscalculated somewhere.\n“Sorry,” he says. He’s already trying to plan some way to fix this, because his brain is racing ahead to Bucky hating him and feeling uncomfortable and God, leaving, and he needs to head all those off at the pass.  “I didn’t mean to-“\nBucky actually rolls his eyes.  “Christ, Rogers,” he all but growls, and reaches out, grabbing the ends of the scarf with his metal hand.  He yanks, Steve falls forward, and then they’re kissing, clumsy and sweet and warm.\nAfter a moment Bucky pushes him back, still holding on to the scarf, like Steve might float away any minute and needs to be tethered to the ground.  “What I was going to say,” he says, “was ‘what the hell could be more important to Captain America than saving the world?’”\nSteve’s grinning so hard his face hurts, his breath coming in quick, warm pants.  He feels lightheaded and shivery and incredibly good.  “Well, I dunno,” he says.  He thinks he might sound a little drunk.  “Turns out there’s this fella I’m a little crazy about.  Have been since I was a kid.”  Bucky inhales sharply at that but says nothing, his eyes tracking every movement in Steve’s face.  “And he’s been taking care of me since then, too, and I only realized what that meant about, oh, twenty minutes ago.”  He pauses, then adds thoughtfully, “And I needed Tony Stark to help me get there, too.  Guess I never was the brains of this outfit.”\n“Never,” Bucky confirms.  He winds the scarf tighter around his hand, pulling Steve back in until their foreheads touch.  He glanced at the yarn wrapped around his fingers and says, “I'm learning to make other things, you know.\"\n\"Yeah? Like what?\"\nHe hums.  \"Hats. And mittens.”  He leans forward again, nips gently at Steve’s lower lip. “Maybe a sweater if you're good.\"\n\"And if I'm not?\" Steve manages, once his brain has started up again.  He has, admittedly, very little experience with kissing, but the fact that teeth can be involved, and that it can feel good, is frankly mind-blowing.\nBucky smiles, letting the scarf go.  \"Long underwear. Itchy, scratchy long johns that you'll have to wear under your suit.  I’ll check before you leave the house, like your ma used to do in winter.\"\n\"You wouldn't.\"\nHe drops another kiss on his lips, quick and hot, and says, \"Try me.\"\n***\nHe does."
}