{
    "id": "1892094",
    "url": "https://archiveofourown.org/works/1892094?view_full_work=true",
    "author": [
        "novembersmith"
    ],
    "title": "Unusual Weather",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Captain America (Movies)",
        "The Avengers (Marvel Movies)"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Steve Rogers"
    ],
    "characters": [
        "James \"Bucky\" Barnes",
        "Steve Rogers",
        "Tony Stark",
        "assorted Avengers"
    ],
    "additional_tags": [
        "Dubious Consent",
        "Painkillers",
        "High Horny Snuzzly!Bucky",
        "General reference to violence and torture",
        "Mild exhibitionism/voyeurism?",
        "Tony Gets A Show",
        "A New Arm For Bucky",
        "Established Relationship"
    ],
    "language": "English",
    "series": "",
    "published": "2014-07-03",
    "completed": null,
    "words": "8,689",
    "chapters": "1/1",
    "comments": "528",
    "kudos": "24,704",
    "bookmarks": "5,860",
    "hits": "353,310",
    "summary": "<p>Bucky’s been at the Avengers Tower for three weeks before he finally gives in to Steve’s gentle coaxing and Stark’s cheerful waving of fistfuls of circuits, and lets them scan the arm.</p>\n<p>It doesn’t go well.</p>",
    "notes": "<p>This fic was intended to be a porny drabble about high horny snuzzly!Bucky, and I have no idea how this 8K thing happened. But yay for getting in the writing groove? /o\\</p>\n<p>A billion thanks to everyone who looked this over, especially lquacker and _eirene, who convinced me it was worth turning into an actual story. Beta job done by the fabulous torigates, and all mistakes are entirely mine, not hers.</p>\n<p>WARNING: Fic contains dub-con, given that Bucky is high on painkillers when he initiates sexual activities.</p>\n<p>Title is from the Wizard of Oz! This scene:<br>Cowardly Lion: [noticing the snow that fallen on the poppy field] Unusual weather we're having, ain't it?</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "Bucky’s been at the Avengers Tower for three weeks before he finally gives in to Steve’s gentle coaxing and Stark’s cheerful waving of fistfuls of circuits, and lets them scan the arm.\nIt doesn’t go well.\n“Just rip it off,” Bucky says, and he’s not panicked. Panic is something that’s been beaten and burned out of him. But he does put a hand to the join at his shoulder, dig his fingers in and start pulling. Steve makes a distinctly panicked sound and pulls Bucky’s bloodied fingers away.\nBucky lets Steve press gauze to his shoulder. His breathing rate is slightly higher than optimal, but the bleeding stops quickly.\n“Okay, one: that was freaky, you know that, right?” Stark has both his hands held out, as though to distance himself. Understandable, given that Bucky has apparently been leaking increasingly dangerous levels of unknown radiation from his arm this entire time. High enough that even a supersoldier might be affected. That a human certainly would. “Two, this is why we scanned your arm to begin with, and it’s not as simple as ripping it off. Pretty sure that will lead to A) you dying and B) explosions.”\nBucky thinks, put me back down in the ice. Put me deep down where I won’t hurt anyone ever again. Get me out of here.\nBut it’s been a year of running, and yelling at each other on rooftops, and saving Steve from the stupid, stupid shit he gets up to when Bucky’s not there to drag him out of it. And he thinks Steve means it when he says wherever Bucky goes, Steve’s gonna follow.\nIt pisses him off. It makes him feel—uncomfortable. Too warm. Frantic, because he’s stuck here now, stuck in this fucked-up mess of a head and warzone of a body, because that’s what Steve needs. Bucky needs Steve to be okay, and Steve needs Bucky to be okay, and isn’t that a fucker.\nDeep freeze is out. Brute force, blunt removal: also out. Bucky doesn’t know what else to do. He’s not designed for finesse, not like this.\n“We’ll get it off, but these things must be done delicately,” Stark is saying, twirling a tool in his human fingers and looking at the arm pensively.\n“Are you the Wicked Witch of the West in this scenario?” Steve asks with careful lightness, head tilting, perfect eyebrow rising. His hands are rubbing Bucky’s shoulder, tracing patterns. A star. A crescent moon. A sun. Bucky tries to focus on that, and not his pulse roaring in his ears. “Gotta admit, Buck would look great in ruby red slippers.”\nBucky thinks he’s had enough red for a lifetime, but he doesn’t say anything, just stares at metal fingers and tries to think. Tries to imagine a world where he doesn’t have this thing attached to him. It seems impossible.\n“Sure thing, Toto. Add that to the list. So, here’s the plan: we’ll give you some good ol’ juice of the poppy, detach the armed bomb—oh, come on, that was hilarious! We’ll gussy you up while we’re at it. Attach a new arm with a clean power source and give you pigtails and blue gingham. Everyone wins!”\n“Give me what juice,” Bucky says flatly, and Stark takes a step backwards.\n“Asgardian poppy,” he clarifies quickly. “Thor assures me that you’ll feel no pain! Besides, Steve gave it a go last week, and all it did was turn him into a snoozy puppy—not literally, but you remember.”\nSteve draped over Bucky in the common room while Star Trek played, drooling on Bucky’s shoulder, mumbling about space pants. It’d been nice. Quiet. Simple, threat levels minimal. Nice to card through Steve’s hair carefully.\nSnoozy puppy is not an inaccurate description. Just one Bucky can’t ever imagine applying to himself.\nAlso.\nBucky glares at Steve. “Steve. You said you’d just had a hard workout with Natasha and Thor.”\nSteve scratches his head and looks at Bucky sheepishly from under his bangs. Bucky refuses to let the flood of fond memory that ensues soften his outrage. Fucker never learned, always flung himself on grenades and into experiments and through fire. What did Bucky have to do to make him stop?\n“Well, kinda? Mostly we took shots. I just wanted to make sure it wouldn’t hurt you before you tried it.” Now Steve’s making doe eyes, toeing the ground in front of him. Bucky knows he’s being played like a piano, loud and obvious, and is aggravated that it seems to still be working. Working all the better for Steve showing his hand so deliberately.\nBucky tables the self-preservation argument, because he knows that tactically, it’d be way too easy for Steve turn that blade back on him. But he’s still feeling prickly and hurt. Nasty.\n“Not real pleased you guys’ve been sneaking around behind my back all this time, pal,” Bucky growls, and it’s true. He’s not proud that Steve flinches, but still feels a vicious vindication all the same. He hates feeling that. He hates feeling anything. It’s hard. It hurts. “How long have you been discussing this op without me?”\n“Uh, when was it that you called me about Operation Arm, Steve? Was it—yes, it was, right about when you were getting chased by nurses as you and Sam tried to flee the hospital in your delightful backless hospital couture and got your personal assets on the front page of the internet. Last summer, yep.”\nThe internet doesn’t have a front page. Bucky still remembers seeing that, all the way in Croatia, on a computer screen in an internet cafe. Hard to forget. A year ago. A year this has been coming, that they’ve been discussing his arm, him, what to do with him. He rubs his face and tries to calm down.\n“Forgive me for worrying, but I don’t know if you noticed, but your first instinct was to rip your own damn arm off with your bare hand, Bucky!” Steve’s saying, bright angry eyes and red cheeks. “We’re not gonna do anything without you okaying it, we just—wanted to have options ready. Before we talked with you about it. So you didn’t feel—”\n“Trapped,” Bucky says, breathing through his nose. He gets it. Logically, he gets it. This isn’t Hydra. They think he’s a person. They care about how he feels. That he feels.\n“We were gonna ease you into it more, but then the scan showed radiation, and the time table kind of—sped up.”\n“You don’t have to treat me with kid gloves, babe,” Bucky says dully. They do. They do. He hates this. He wishes he could just—rip. Rip it off. Rip the bad parts out of and off of him. It’s not fair that he can’t—but he must have known, somewhere, in some forgotten programming, some old rust-brown lesson, than he couldn’t. Or he’d have done it already, a long time ago.\nHe’s stuck the way he is.\n“Look,” Stark says, not looking at either of them. He’s looking somewhere off in the distance, beyond the window, beyond maybe even the sky behind that. “I know a thing or two about non-con body modifications that are killing you slowly, and, what do you know, I also have trust and control issues. So. Here’s what’s going on. Here’s your arm, JARVIS, blow it out for us, show the nerve attachments. Labels, yeah—sure, add some Russian, why not.”\n“Oh,” Bucky says, and takes a step closer, tilting his head to take it in. The arm. He’s seen the innards, but not like this. Not without restraints on his arms, guns to his head, blood and smoke everywhere.\n“Settle in, have a read. But this is the plan, which we have been discussing without you for some time, yes. That sucks. Sorry. But: zero restraints, you still conscious, you not assassinating me for causing mind-blowing pain as I detach that bomb you’re walking around with, and at the end, you get a brand new, arc-reactor-powered arm which Steve has commissioned on your behalf and which I have spent a year designing.”\nBucky doesn’t say anything. Stark could have altered these scans. Could have tricked Steve. Could have—but the snaking wires around his nerves, his veins, his bones. The power source that degrades and poisons him and everyone around him if he goes too long without a check-in. It does sound like Hydra. Sounds like something Bucky might even have heard being discussed around and over his head, a long time ago.\n“Think about it?” Steve asks softly, and rubs his hand up the arm. Bucky shudders, fighting the urge to tackle Steve away from—himself. Fuck.\nSteve doesn’t ask for a lot. Not out loud, just watches and hopes, with those eyes. It’d be easier if he asked outright. Bucky, come inside, it’s raining. Bucky, talk to me. Bucky, trust me. Bucky, be human again. \n“I’ll think about it,” Bucky says, despite not wanting to, not wanting to at all. Steve smiles at him.\n“That’s all I’m asking,” he says, when he could ask for the moon and Bucky would try, try so hard, to give it to him. Doesn’t know who he’d have to kill to get ownership papers, but he’d do it. It’d be easier.\n“You’ve got a while to think, I gotta readjust my specs. Those crazy Hydra bastards, hope Bruce is more up on neuroanatomy than I am,” Tony mutters, wandering off with a wave over his shoulder. Bucky feels his body relax, slightly, infinitesimally, when it’s just them and Stark’s computers in the room.\n“Sorry, Buck,” Steve sighs, moving in closer, until he’s just barely brushing against Bucky’s right side. He’s hanging his head. He looks tired. “I never meant to make you feel like we were making your decisions for you. That’s not what I wanted at all.”\n“I know. ’s not you I’m sore with, Steve,” Bucky sighs back. He hesitates, then leans in and presses his mouth over Steve’s, just to see Steve’s pinched look vanish for a second, to feel Steve’s lips curve into a smile. And maybe also because it makes Bucky feel a little warmer, a little less like a malfunctioning machine or a problem to solve.\n“So what’s it like,” he asks tentatively. “This drug you got. It won’t—” of course it won’t, Steve wouldn’t do that to him, but he can’t not ask, he has to ask “—make me forget?”\n“Not a thing,” Steve says immediately. “I remember you had that happen sometimes, with booze, so I checked. It just made everything bad, I dunno. Matter less? Everything that was nice got pumped up. Way my suit felt on my skin, the taste of Oreos. I liked it.” He turns red, and Bucky cocks his head. “I really liked you petting my hair.”\n“Yeah?” Bucky replies, and smiling’s not so hard, he thinks. He should try it more, for Steve. He reaches out, feeling clumsy and robotic even with his human hand, and tucks a strand of hair carefully behind Steve’s ear. “That doesn’t sound so bad, I guess.”\n***\nBucky keeps repeating that to himself as he lays down gingerly on a reinforced cot in Tony’s lab a week later. Pillows and everything, sheets. It’s not a chair at all. The sheets have cartoon Avengers on them; Stark thinks he’s funny. Maybe it is a little funny. Maybe one day Bucky will laugh about this.\nBut right now, he doesn’t want needles, he doesn’t want drugs, he doesn’t want Stark’s hands on him. He wants to grab Steve and rabbit to the North Pole, to the ice and darkness where Bucky belongs, and where Steve doesn’t. So Bucky can’t do that. He can’t leave Steve, so he’s gotta stay here. Stay on this bed, on these stupid sheets, and get experimented on, again.\nIt’s fine, it’s fine, it’s fine, it’s not so bad, he lies to himself, every muscle tense. He finds himself opening his mouth for a guard and snaps it shut so hard his teeth hurt. Steve makes a worried sound.\n“I promise, Hydra never gave you anything like this,” Stark’s rambling, tinkering with the IV, tapping a needle while Steve paces nearby. Hydra didn’t ramble. Stark’s annoying, but Bucky still... He appreciates it. The difference.\nThe arm has to come off, so Bucky’s going to bear this. He examined the schematics in-depth over the last week, and it’s—exquisitely cruel, the way only Hydra can be. The inner workings of the arm are exactly beyond Bucky and his reach, his capabilities. Just close enough to be a torment. De-wiring the old and re-wiring the new is designed to hurt, and Bucky knows his programming, knows himself well enough to know how that will go.\nHe has enough blood on his hands without adding Steve’s buddy to the list. But he can’t—won’t—can’t let himself be knocked out entirely. Even with Steve there. He can’t. \nBut apparently even Hydra hadn’t planned for Asgardian opioids. \nBucky’ll be vulnerable. But Steve’s here, and Stark’s an ally, if not a friend.\n“Just a pinch,” Stark warns, and Bucky feels his entire body tense. Cold, it’s inside and it’s cold, it’s—\nIt’s Steve’s warm hand, rubbing his arm just above the needle.\n“’S fine, Buck,” Steve says, hovering like a damn helicarrier. “Everything’s under control, you’re gonna feel real good, no pain. You okay, Buck? We’re alright. You’re alright. You’re doing so good.”\n“So you say, pal,” Bucky says, feeling waspish, buzzing and metallic and poisonous. He always feels like that, though, so he tries to summon up a smile again. Because it’s Steve, Steve’s trying so hard for him, every damn day, even with Bucky snapping and tense, leaking radioactive shit everywhere in more ways than one.\nSo Bucky can try, too. Pull out a smile, and it’s just as hard every time, making sure it’s not fake, finding something genuine.\nBut it’s worth it for the way Steve’s shoulders settle a little, his eyes brightening. And besides, the cold from the needle isn’t so bad now. Not with Steve’s hand on him, rubbing his veins warm. Like rubbing his hands together on a winter day, blowing on the tips of his fingers. Bringing the outside in.\nBut the cold goes down farther these days. Bucky’s not sure even Steve, stubbornness personified, can reach it. But maybe trying to let him reach it is enough. It’s probably the best he can do, so Bucky hopes so.\n“Should be hitting soon,” Stark says. “Stop hovering, Cap, pull up a chair. You know, I’ve had less attractive but more terrifying nursemaids. You’re a lucky man, Barnes. Think we could convince Cap to put on the appropriate outfit? Just for verisimilitude.”\n“Little hat with a cross,” Bucky says absently. He’s staring at the needle in his arm, his arm, not the arm. Not the Asset’s arm. This is Bucky’s arm, and there’s a needle in it. He kind of wants it out, but it doesn’t hurt. He doesn’t like the chill, though, and Steve’s hand’s not on him anymore. “Yeah, Stevie likes that. To dress up.”\n“Buck! Dammit, Tony. Don’t start—Bucky’s compromised. Doesn’t know what he’s saying.”\n“Oh my god, you did dress up! This is the best day. Tell me there are pictures.”\nNo. Too bad, Steve was pretty as a picture. In Bucky’s uniform from the docks, eyebrow cocked and neckerchief knotted at his slender throat. Pretty. In stockings some dame left behind one night. In a USO skirt, or a striped French shirt, or with a rose tucked in his hair, extra red to his pout. Why’d he done that? Playful. Silly. Making Bucky laugh. Bucky’d forgotten they’d done that. He’s forgotten a lot.\n“We had some good times, huh, Rogers?” he says, blinking, interrupting the bickering back-and-forth above him. “Long time ago.” Gone now. There’s no more good times, just bombs and blood and Steve’s battered face, Christ, he’d hit Steve. Low as you could go. Anybody that hit Steve deserved a bomb for an arm, and a no man’s land of mud and corpses for a head, and ice for veins.\nSomeone’s petting his hair, and it is nice, it’s really nice. Bucky shouldn’t have it, it’s too nice. But. The chill’s not so bad now. It’s funny. Bucky actually feels pretty warm. Like—booze-warm, four bottles of Piel’s down the throat warm. Spring, sweet and sunny, before summer starts stinking and sweating up the place. Melting, like butter in a pan.\n“Whoa,” Bucky says, and blinks. He’s butter. He’s snow in the sun. Slush. Water. He blinks again, and the light gets trapped in his eyelashes. He tries to raise a hand to get it out, but someone gently presses him back down.\nIt’s nice, he realizes with dawning wonder. He feels good. He didn’t remember – could he always do that?\n“Alright, Bucky?” a worried voice says.\nBucky replies before he gets his eyes to work right, “You the nurse, sweetheart?” Because he’s supposed to have a nurse. Weren’t they just saying that?\nBut no, it’s better, it’s Steve.\n“Steve!” Bucky says, delighted, and tries to sit up. Steve presses him down, big hand, so damned warm, and Bucky goes, smiling up at him. No restraints, just Steve’s hands, like they’d said. Steve never lies. Steve’s the best, and he looks so good, lopsided frown, big blue eyes, damn. But he’s frowning, he shouldn’t be frowning when everything’s this warm and nice. “Baby doll, hi, baby.” Steve’s eyebrows move upwards, fast. Wow, he’s gorgeous. Steve’s just so pretty, even when he’s frowning. ”You come here often, doll?”\n“Annnnd I’m gonna go ahead and say operation nuclear disarmament is a go!” another voice says, and something’s happening with his shoulder, but Steve’s on his right so Bucky can’t be fucked to worry about it. “That hit fast, huh? You feel anything besides the need to drop some Paleolithic lines, Sergeant? The urge to maim or kill rising at all?”\n“What’s the blue face for, baby? Gimme a smile, doll. Pretty guy like you shouldn’t be looking so glum,” Bucky says, ignoring the ramble and the whirring noises coming from his left, thrilling to his toes when Steve’s eyes crinkle up as he grins. That’s good, that’s what Bucky likes to see. “That’s it. Gimme that smile. S’all I need. Better than penicillin, pretty smile like that.”\n“I’m not pretty, Bucky. Or your nurse,” Steve laughs, rolling those baby blues of his. But when Bucky fumbles around with the arm he can move, Steve catches his hand. So Bucky’s lines are clearly excellent. It’s so nice, Steve’s big artist hands, the strong deft fingers, long and warm, and the familiar palm, Bucky’s favorite hands. Through everything, thick and thin, small and tall, over seventy years this is one thing that didn’t change much at all. Like the North Star with fingers.\n“Love your hands, you never draw no more, Stevie, you gotta draw me something.”\n“Sure, Buck,” Steve says, and lets their fingers tangle. His fingers feels so good under Bucky’s fingertips, shivery-fine. Bucky wants to kiss them, him. His pretty baby. “Soon as we’re done here, anything you want.”\n“Sweet and pretty,” Bucky says, awed. He feels like he’s forgotten, somehow, what a jackpot he’d won. Steve Rogers, Bucky Barnes’s fella. The hell’d he ever do, to get a guy like this. He tugs at Steve’s hand, serious now. Bucky has to let him know while he can still talk, while his words aren’t all stuck up behind his teeth, in the brambles of his brain. “Prettiest goddamn guy. You’re a fucking doll, look at that face. I’m serious. Even better than you look, and you look so good.”\n“Oh, here we go,” Steve says, but he’s flushing pink, just like a rose, a sunrise.\n“Perfect skin, you’re a peach. Eyes? Bluer than blue, lashes for miles. Bluest eyes. Pretty. Gorgeous. God, you’re swell. And lord a’mighty, your mouth.” Bucky untangles his hand to trace it. So soft. And it parts for him, lets him push down on that petal-soft pink lower lip. So good. “So good,” he croons. “Sonnets. Poetry. Take ‘em as written. I got no words, I just—damn, baby. Got a kiss for me, Steve? I heard kisses are better even’n smiles for anything that ails ya.”\n“Buck,” Steve says, those gold lashes wide, and yeah, that’s his dollbaby, heating up, he knows, Bucky knows that hot blue look. When’d he see it last? Too long ago. “Settle down, you gotta let Tony work.”\n“Just one taste, let me taste. You rationed, sugar?” Bucky lets his voice drop low as he leans up. Something in his shoulder twinges, sparking shivers that don’t feel so great, but now Steve’s leaning in. Bucky lays back, encouraged. Licks his own lips and watches Steve’s eyes on him.\n“Yeah, saving all my sugar for my best guy,” Steve rasps. “Buck, we’re not—ease up, Bucky. Tony, what the hell was in that mix you gave him? I wasn’t like this!”\n“You were definitely lazier. And less verbose. Huh. Maybe it’s the higher dosage making the difference, or adrenaline—”\n“Your best guy, huh, must be a helluva fella,” Bucky says hopefully, and grins like a dope, a total smack to the skull, when Steve stops talking at the other side of him and looks back down at Bucky and says:\n“You’re damn right, you are. Best guy I know, Buck.”\nGod, Steve, he’s so—Steve, earnest and real and good and true, and Steve thinks Bucky’s the best, and Bucky’s his guy, his fella. Distantly Bucky knows he doesn’t deserve this, doesn’t deserve Steve, but Steve’s here anyway and Bucky’s over the moon, he can’t handle it, he needs—\nIt’s been so long since he felt like this. They’ve been kissing a little for a few weeks now. And it’s good, it’s careful and precise and better than anything Bucky thought was left in the world for him. He can barely let himself have it, most days. Steve deserves better, Bucky deserves worse, it’s all so tangled in his head. Steve’s been so steady, so patient, but Bucky’s just felt... buried. Pressed like there’s a damn mountain on his chest, all the things he’s done stacked up like medieval torture, turning everything flat.\nHe doesn’t feel any of that now. Everything that hurts feels far away, and he feels light, airy. Like champagne stolen in France, he’s got bubbles in his veins, tickling and sweet. He could dance now, take Steve dancing. In Paris, in New York. Anywhere, how great is that? Kiss Steve drunk in the middle of the street. He wants to kiss Steve now, when he’s feeling like this. Good, golden. Wants to feel Steve everywhere, all over, wants Steve to feel him.\n“Steve, Stevie, just one kiss, baby,” he begs, pouting and batting his own lashes, whining when Steve just cuffs the side of his head gently. He reaches out, hand grabbing at air. “Steeeve, come on, some nurse you are. I gotta have just one kiss, I’m dying, you’re killing me, so far away.”\n“Just keep him still,” someone laughs, and Bucky says, beaming, “Yeah, keep me still, Steve, come on.”\nSteve smiles crookedly, leans in with a hand on Bucky’s chest.\n“One kiss, and then you’ll behave?”\n“I’ll be so good,” Bucky lies earnestly. And success. Steve settles his glorious, glorious ass on the side of the table and leans in. Speaking of sonnets that need to be written, Bucky will get right on that. Later. Right now—\nSteve’s nuzzling him, nose against Bucky’s, mouth just barely parted against his. Press of lips, Bucky’s hand in Steve’s hair, it’s so sweet, it’s better than sugar, better than anything Bucky’s tasted since the war ended and the Soldier began.\n“Baby,” Bucky says, in between hot, barely-wet kisses. “Oh, baby, oh.” Messy, ragged gulps of breath between kisses. He’s only got one hand to work with, the other pinned and weird, aching distantly, but one hand’s all he needs, he remembers. He rakes his nails through the fine, damp hair at the back of Steve’s neck, digging in just this side of too-hard. Steve moans into him, open-mouthed and shocked. That’s money, take that to the bank. God, that’s good.\n“Yeah, let me hear you,” Bucky says dreamily, and bites at Steve’s mouth, drinks in the tiny sounds Steve’s making, little ohs and sighs and hitches of breath. Gives them back in hums and moans of his own. “So sweet, god, I told you, your mouth—you make me feel so good. You feel good, Stevie? Want you to feel good.”\n“Okay, I feel compelled to point out that this is considerably more than one kiss and I am also right here.”\n“I’m here, you’re here, Steve’s here,” Bucky agrees, and Steve’s basically climbed on the table, plastered to Bucky’s right side. Easy as anything to grab a handful of that ass and knead it. Holy grail of butts, all his. “Mmm, Steve’s right here.”\n“Bucky, you said you’d behave,” Steve mumbles into the side of Bucky’s throat, but he’s pushing his ass back into Bucky’s hand. “Forgot how much you talked when we—oh. Oh.”\n“Yeah,” Bucky says fondly, hand down Steve’s shorts. Smooth warm skin, curve of padded muscle, god, he wants his teeth in it. He slides one finger just at the top of the crease, and rubs, thinks about pressing open-mouthed kisses there, sliding down. He wants, he wants—he kisses Steve’s mouth open, strokes his tongue in deep and swirls it around Steve’s. “Mmm, mmm, babydoll, wanna do this to you everywhere,” he pulls back to say, in case Steve had missed the message. He rubs his hand further down Steve’s ass. “Remember? Kiss you open. Get you wet. Love that.”\n“Holy shit,” someone mutters.\n“Fuck,” Steve bites out, high and breathy, pressing his forehead to Bucky’s. Is there anything Bucky likes more than Steve swearing? Probably, but it’s still up there. ‘Fuck’ sounds good in Steve’s wet mouth. And there’s a salute Steve’s sporting in his trousers, just for Bucky, nudging against Bucky’s hip. Bucky’s proud for a moment, hotly dazedly proud that he can do this, to this man, but then—bupkis.\n“Steve,” protests Bucky, mightily injured at the sudden lack of Steve beneath his fingers and lips. “Stevie, how could you do me like this? Kiss a man that way and then leave him hanging, that’s cold. That’s cold, doll.”\n“We’re not alone, Bucky!” Steve hisses, wet-cat face. “And you’re drunk. High. Something!” He settles in the chair by the table, hands in his lap. Gorgeous, all mussed and flushed. Bucky tries to sit up and it hurts but that doesn’t matter, Steve’s right there, hard and ready to be straddled, for Bucky’s mouth to bloom kiss-shaped bruises on his throat and shoulders and thighs.\n“Just feeling good, got me hot, Steve. Come back, come back,” he croons, opens and closes his hand, reaching for him, stretching. But Steve’s face looks—“Dollface? Steve—” He struggles up.\n“Hey, hey, Capsicle, keep your boytoy under control! Delicate work, here! Mini nuclear reactor! With considerable amount of nasty goddamned traps set around it!”\n“But—”\n“Hey, do whatever you want, I won’t be looking. I’ll be saving our lives by the skin of my teeth over here. You just keep his shoulders on the damn table.” There’s a saw buzzing, and Bucky glances over to see exposed bone, wires. Metal. They did that to him, he’s not human, he’s— Bucky looks up at the ceiling and pants, suddenly terrified he’ll feel it again. Cold. He’ll be cold.\n“Steve, Steve don’t leave me,” Bucky pleads, and Steve’s suddenly close again.\n“I won’t, I’m here,” Steve says, and fuck, that’s a kiss, that’s fierce, that’s—Buck feels it down to his boots, the sole and soul of him. Hot. Warm. “Bucky, Bucky.” Kisses down his jawline, to the base of his throat. Bucky’s heart beating for him, banging away at his chest like it wants to get out, get to Steve where it belongs. “You’re fine, we’re fine, I got you, whatever you want, Bucks, I love you, I got you,” words mouthed into his skin, against his temple. \nBucky’s stopped shaking so much, now. Steve’s here. The kisses slow down, strung out like syrup, until finally Steve pulls back to look at him, damp hair flopping in his face, eyebrows pulled together and mouth crooked down.\n“With me now?”\n“Yeah. You got me,” Bucky says, and believes it. Feels it in his bones, exposed or not. Steve wouldn’t lie to him. Steve loves him. He’s here. Wants to be here. “C’mere. Come back, get up here with me.” But Steve’s got his constipated face on, ugh.\n“Just. You’re buzzing hard, Buck. I don’t want you to do anything you don’t want, okay? Or for you to be. Embarrassed. Later.”\n“Ain’t nothing you could do with me I’d be embarrassed of, Steve,” Bucky says, indignant, trying to sit up against before he remembers to lay back and be still. “And I want you. Anything with you. I just forgot we could feel this good.” He makes his eyes real big and bites his lower lip and hopes. “Help me remember, Steve?”\nAnd Steve—maybe some of this juice buzzing through Bucky gives off a contact high, because Steve just melts, face dissolving from worry into something softer, adoring and sweet. Makes Bucky’s toes curl.\n“Okay. Okay, but. Just kissing, until you sober up,” Steve says then, in his firmest command voice, the little twerp. He cups Bucky’s cheek and looks him dead in the eye. “Hand to yourself, mister.”\n“Scout’s honor,” Bucky says sweetly, and proceeds to start kissing the ever-loving hell out of Steve’s hand, laughing around Steve’s fingers when Steve squeaks and swears.\nSteve’s skin tastes so good. Always did, still does. Clean sweat, the salty taste bursting in Bucky’s mouth, and it’s so easy to lose himself in tracing the swirl of fingerprints with his tongue, bite at Steve’s thumb, kiss it better. Tries three, then four fingers, and loves the stretch of it in his mouth, the weight on his tongue. Not Steve’s cock, but ‘s nice.\nSteve’s saying his name, over and over, and there’s the slick sound of Bucky’s mouth, and the thud thud thud of his own heartbeat in his ears.\nAnd then, the sound of a clunk, and lightness—the arm’s off. It’s off, they did it, no one died, and Steve’s face is desperate and gorgeously contorted. His free fist’s clenched in the sheets by Bucky’s head, and he’s hunched over, looking at Bucky like Bucky did something miraculous, when he’s just giving Steve’s hand a suckjob to tide them over.\nSteve looks blown, though, eyes dark and breath ragged. Bucky knows that face, knows that shocked, wide-eyed look means Steve’s about to lose it. He always looks so surprised by his own pleasure, each time. How’d Bucky forget that?\n“You look so pretty when you’re about to come for me,” he says dreamily, rubbing Steve’s spit-slick fingers over his lips. Kisses the fine skin of Steve’s wrist, open mouthed. Just kisses. Just kisses, he’s being good. “Feels good. How long’s it been? Too long, god, too long for me and you. I want it, want you in me, on me.”\n“Bucky,” Steve says, voice strangled and rasping, eyes huge. Beautiful.\nThere’s a clanking noise, and then Bucky jerks, full-body, as something staticky and electric goes through his left side. Hurts, but he doesn’t care, it’s fine. Fading fast, and the fingers—his left hand, his new fingers—flex easy.\n“Annnnnd we’re done! I’m just gonna—” Bucky turns to see Tony’s back, heading fast for the door. “Find—a shower. Pepper. Something. Great bedside manner, Cap, you’re a natural.” The man tosses off a salute before slamming the door behind him. \nBucky realizes that a) this means they’re alone, and b) he has two hands now. He sets to pulling Steve on top of him. Shoves Steve’s shorts down, gives his exposed cock a sloppy, sassy salute of his own because hey there, Captain. Steve’s panting as he stares at Bucky, open mouthed, hips moving restlessly. So pretty, so pretty, goddamn.\n“Just you and me now,” he husks, and wraps Steve’s spit-slick hand around his own cock, gives him a couple strokes to get him going. “Come on, baby, come on, gimme it, I wanna see it, come all over me, I want it—”\n“Fuck,” Steve grits out, then he’s slamming his mouth down on Bucky’s. There’s nothing but wet sounds: kissing, Steve’s wet hand moving, Steve’s desperate little whines into Bucky’s mouth and then he’s pulling away, again.\n“Wait, Bucky,” he pants. “I can’t, you’re not—”\n“Steeeeve,” Bucky complains, and latches on to Steve’s back, holding him in place. He knows what Steve likes, hand on the back of his neck with Bucky’s nails digging in, hard, then soft. Other hand at the small of his back, urging him down. His new arm is strong, too. Softer, though, the edges smoother. He can touch Steve with it.\n“You didn’t want this before,” Steve gasps, and his face twists between slack with pleasure and frowning with worry. “Not like this. Why—why now, is it just the drugs—Bucky, I don’t want you to do anything you don’t want, god, Buck. Hold off a second, can’t you?”\n“I want it, ‘s not the drugs. Just you and me,” Bucky assures him fervently, rolling his hips up and laughing, smugly delighted, when Steve’s eyes unfocus slightly.\nBucky thinks he must be coming down a little—the ache in his shoulder is bothering him more. And his own erection feels much, much more important than it had minutes previously, back when it was just a pleasant awareness of something new. Something else he’d forgotten he could do, and feel, and have.\nBut Steve’s sitting back on his heels, shaking his head and breathing out in long, careful breaths.\nBucky feels panicked, jittered. He can’t—he can’t lose this now, not when he can’t be sure he’ll have it later, be able to let himself have it. “Don’t go,” he pleads again, and sucks in breaths. “Steve, please. I just wanna feel good with you. Don’t you want it?”\n“Buck, you know I do.” He takes Bucky’s new hand slowly, and kisses the palm. Bucky lets him, watches with wide eyes. The new hand. His hand. He can feel it. “You’re the definition of temptation, you know that? But I’d rather never have sex again than hurt you. I’d go full castrato first.” His smile wobbles a bit. “You don’t want me singing soprano, do you?”\n“Don’t you dare.” It’s a joke. Gotta be a joke, but no, Bucky knows Steve, knows that face, knows that stubborn set of jaw, that streak of self-sacrifice and righteousness. The fucker might actually mean it.\n“So you gotta tell me,” Steve presses on, big earnest eyes, leaning his soft cheek against Bucky’s palm. “You need anything: sex, no sex, sex in public, sex in a nurse get-up, whatever. I’m here for you. Anything. But why now? Why not before? I can’t do anything until I know, Bucky.”\n“Fine, god,” Bucky huffs, but he’s trying, he’s trying to think of the words that will make it okay. Make Steve realize why it’s okay. “It’s just, my head’s so loud, usually, and—busy. I dunno. You get into trouble. And I could hurt you. Other people could hurt you. All I can think about.” Steve kisses his new hand again, softly, and Bucky closes his eyes, it’s so nice. “And besides. Feeling good, it’s not for me anymore. But for right now it’s—it’s okay, isn’t it? For right now?”\n“Bucky,” Steve says thickly, and kisses up Bucky’s arm until he’s kissing the snarled mess of scars and then the side of his neck, and then across his face. He kisses Bucky, again and again, until Bucky opens his eyes. “You deserve to feel good. You do. All the time. Any time.”\n“‘f you say so, Stevie,” Bucky says dubiously. He makes a low, startled sound of happiness when Steve really settles in between Bucky’s thighs. He takes his shirt off, tosses it somewhere, then presses his perfect hot skin to Bucky’s cold patchwork body. Bucky immediately takes the opportunity to wrap his limbs around him so he can’t get away.\n“I do say so. And you said something about liking my mouth, earlier, right?” Steve says, and bites Bucky’s throat just right, just like Bucky likes, wet and stinging and soft all at once. Then he moves down and tugs at a nipple with his teeth.\n“So much. Love it,” Bucky agrees immediately. “Best goddamn mouth in the history of mouths.”\n“All yours,” Steve says, looking up at Bucky with his wet red mouth and gold lashes and blue eyes. Primary, patriotic. Beautiful. “Wherever you want, whenever you want, Buck. Just ask.”\n“Put your mouth on my mouth,” Bucky says immediately. “You can suck me later, I just wanna keep you like this for now.” Safe, wrapped in Bucky’s arms. With him, on top of him, everywhere. “Come in our pants, like when we were kids, drunk on Dad’s whiskey. Get fancy later.” He pauses, unsure for a moment, because Steve’s gone quiet, is just panting and nuzzling. “Is that okay?”\n“Really, really okay,” Steve says, raising his head. He kisses Bucky, hard, smacking their noses together, teeth clashing. He’s beaming all over his stupid, flushed face. “You remember that? Our first time?”\n“Yeah. You were lighter. Looked like a damn dream, up there.” Bucky puts his hands on Steve’s hips, thumbs the hipbones, and pulls him down. “Shove up a little? Lemme see you now. God, you’re a bombshell. The curves on you these days. Better rack than any broad, I swear. Hey!” he laughs, when Steve scowls jokingly and tweaks one of Bucky’s nipples. Bucky retaliates by leaning up—better abs, now, he can just sit up and bite back. “Ah, and then you made that same face. Just like that. Like you can’t believe what you’re feeling, it’s just. So. Good. So good, baby, you like that?”\nSteve’s letting him set the pace, letting Bucky get his hands on each cheek and pull Steve down onto him, a rocking, rolling rhythm. Like a dance.\n“Yeah,” Steve pants. “Yeah, yes, Bucky, Buck. Yes.”\n“Gonna take you dancing,” Bucky breathes, staring up at Steve’s stupid, sweet, pole-axed face. “Don’t let me forget, gonna take you—ahh, baby, baby, that’s it, you close, baby?”\n“Been close since you kissed me,” Steve admits, breathing hard. “It’s been—been a long time, Bucky.”\n“For me too, doll,” Bucky says, suspecting his face is just as dopey as Steve’s, but who cares. “Been saving my sugar for you, too.” He snickers in between thrusts, breathy and happy. “And my syrup.”\n“Bucky,” Steve laughs, looking disgusted and delighted. “Gonna give it to me?”\nBucky wants to sass something about pancakes and sausage, but Steve’s got himself braced now, a hand on Bucky’s shoulder, and he’s pushing down just right. Like the world’s best lapdance, like he’s got the person he loves most in the world grinding down on him, making high, breathy noises and each grind of his hips is so good—Bucky can’t speak, can only pull Steve in and clutch at him as he comes, and Steve chokes out his name and comes too, just like before, with his teeth in Bucky’s shoulder.\nSomehow, when he can think again, Bucky finds them slumped together on the Hulk and Hawkeye patterned sheets. Steve’s propped on his elbows, staring down at him with that shocked, awestruck look Bucky loves so much.\n“I can’t believe that just happened,” he says wonderingly, then slowly lowers himself to kiss the corner of Bucky’s mouth. “What am I saying, of course I can. It’s you.” He kisses Bucky again, slower now, with lots of nuzzling and sighs. “Not sure that was the best idea, but. God. God, Bucky, what you do to me. Love to see you smile. Love you.”\n“Love you, too,” Bucky says dreamily, and wraps Steve in his arms—two of them, he’s got two now, and they’re both his. None of them Hydra, all his, and he can give Steve this now without feeling like Bucky’s embrace is smearing blood all over him.\n***\nBucky wakes up in their room, hours later. It’s daylight, and he’s warm. Warm everywhere. Even his new arm is warm, which means he really owes Stark a thank you. Even with Steve sleeping on top of it like he is now, the old arm would have had a cold inner core. Nothing but superficial heat.\nHe touches Steve’s hair with his free hand, and keeps it there even after Steve opens an eye.\n“Morning, beautiful,” Steve rasps, taking the other half of his face out of the pillow and smiling over at Bucky hopefully.\nBucky flexes his fingers beneath Steve’s body, then digs a finger into Steve’s armpit. He frees his arm while Steve’s squirming and yelping, then flicks him gently between the eyes.\n“You go blind after all that sinnin’ last night, Rogers?”\n“What, you’re the only one who can wax poetic?” Steve says, smile full-on silly now. “I can’t moon over my gorgeous guy a little, after a good night together?” He bites his lip, flicking his eyes away, then back. “You did have a good night, right?”\n“No nightmares,” Bucky agrees, then leans in to rub his nose against Steve’s. “Arm’s good.” He waits just long enough for Steve’s eyebrows to pull in slightly. “Great sex,” he finishes. “Good night.”\n“Jerk,” Steve sighs, and runs a hand over the curve of Bucky’s side.\n“Punk,” Bucky returns, but it’s been—he’s awake now, sober, and he hasn’t checked the perimeter, and he doesn’t have any weapons on him anywhere, and he doesn’t know what this new arm is capable of yet. He feels itchy. “Gotta get up.”\n“Okay,” Steve says peaceably, having watched Bucky leave the bed for these walkabouts before. Many times per night, even. He watches Bucky pull the knife from the slot behind the bedframe, stalk around the room sweeping for bugs—their room they sleep in is the only one that’s unwired from the mainframe of the Tower, even from Jarvis. No mechanics, no electronics but what’s necessary to set up the Faraday cage around them, nothing else but Bucky’s arm. Only way to reach them is to come yourself, or send a message with a robot.\nBucky thinks, suddenly, that was probably a lot of work to set up. Just to give a paranoid amnesiac brainwashed assassin a place he feels safe enough to sleep.\nHe’s gotta thank Stark. Tony. Whatever.\n“Hey, Bucky,” Steve says as Bucky’s pulling up his boxers over his calf and thigh holsters.“You know, you do. You do deserve to feel good.” Bucky freezes, one leg in, one leg out. “And you can ask me for anything, anything you want me to do to you. And you can do anything to me. With me. You don’t gotta ask me if you want to touch me, or kiss me, or—whatever. Anything at all. Permission granted, forever.”\n“Anything,” Bucky says slowly, because that’s—he’d worried, a little, when he woke up. That he wouldn’t be able to feel it again, that hot flush of want, not without chemical intervention. Except. “What if you’re wrong?”\n“Then I’ll tell you,” Steve says easily, like it is that easy. “And if you don’t want anything, that’s okay, too, Buck.”\nBucky pauses in picking which guns to keep and which to leave and returns to the bed for a thorough kiss that leaves both their heart-rates moderately increased. Bucky can hear his, and Steve’s. Can feel it in his throat, in the throb of his lips. \n“I want things,” Bucky says into the space between them, heart still hammering. Nothing hurts. It’s okay.\nSteve beams at him, keeps beaming as Bucky moves away, and somehow, illogically, Bucky feels confident, positive, certain Steve’s still beaming when Bucky retreats into the bathroom for quick ablutions and evacuations.\nSteve is indeed still beaming when Bucky re-emerges, hair wet and slicked back. He ties it back with an elastic and continues dressing. Mostly blacks and greys, because it’s more functional, more efficient, but Steve—he used to say he liked Bucky in blue. Makes your eyes glow, he’d said, slanting a grin up over his sketchpad. Like the dawn sky with the sun coming up. The sappy little shit.\nBucky puts on a navy shirt, then layers a black vest over it.\nHe waits to ask until he’s half-out the open window. “Hey, Steve.” He flicks a glance back, and meets Steve’s eyes. “What if I don’t want you to have to ask?”\n“Then we’ll work it out,” Steve says. He’s sitting in the morning sunshine, sheets puddled around his waist. His hair looks ridiculous. He looks happy. There’s a red mark on his neck, slowly fading. Bucky wants to get back in bed with him. “We’ve got time. Come get breakfast when you’re done?”\nBucky nods, and goes.\n***\nBucky pauses, taking in the situation. Sunday breakfast. Avengers, all present. Pancakes, bacon, potatoes, sausage, eggs, a variety of fruits on the table. Syrup. Ketchup. Various condiments and cutlery. All the body language and vital stats appear normal—unlikely to be imposters. All hands visible. Safe to approach.\nAdditional observation: Steve has a nurse’s cap perched on his blond head. Crisp and white, with a red cross on the front. Difficult to determine who is responsible for this, but he suspects Natasha, given how pleased she looks with herself. Regardless, Steve is wearing it with aplomb and without shame.\n“You don’t know what it was like,” Tony is saying, gesticulating vehemently with a piece of pineapple. “I thought—I thought Cap was a virgin! And then they had sex on top of me. Two of the hottest men in the world! While I was trying to defuse bombs!”\n“You thought he was a virgin?” Natasha says, amused, while Steve, faintly red, is protesting.\n“We weren’t on top of you! It was more, um. Adjacent. And you left before—um.” Bucky smirks at the blush spreading down Steve’s neck. “Anything. Ah—”\n“You think I’m hot?” Bucky contributes, because he still has Steve’s six. He drops down from the top of the fridge and everyone but Natasha and Clint jump. Bucky locks eyes with Steve.\n“Well, yeah! Murderously so, but still,” Tony says, after he stops choking on tropical fruit. He waves a hand up and down appreciatively in Bucky’s general direction. “And now you’ve got my tech on you, there’s an exponential increase in hotness. Not as hot as my girlfriend, obviously, literally or figuratively. But hey, speaking of firecrackers, how’s the arm? I didn’t get a chance to run specs. For some reason.”\n“It functions well outside combat,” Bucky says, not looking away from Steve, who’s tilted the cap to a jaunty angle and is waggling his eyebrows. “It’s a good arm.” He hesitates, then adds, “Thank you. Tony.”\nThere’s a long silence before Tony clears his throat and says, “You’re welcome.”\n“Hey, that’s a lot of syllables, Buck,” Clint says, sounding impressed. “Before coffee and everything.”\n“You have no idea how many syllables that man is capable of,” Tony hisses, but Bucky doesn’t have time for them. He wends his way around the table to steal the bacon from Steve’s plate.\n“Lookin’ good, doll,” he says between crunches.\n“I made you your own plate, jerk,” Steve complains, but he’s beaming up at Bucky. Bucky takes the plate, heaped with food, more maybe even that Bucky needs. He stands behind Steve to eat it, listening to the conversation resume around them. Then, eventually, he lets himself slide into the seat on Steve’s right. Steve always leaves a seat empty for him, but this is only the second time Bucky’s taken it. It’s only the fourth time Bucky’s done more than look in on the Sunday breakfast ritual.\n“Pass the syrup,” he murmurs, and enjoys the way Steve immediately starts coughing. He makes sure to let his fingers brush Steve’s as the pass-off is conducted. And to lick a stray droplet off his wrist after he’s finished dousing his plate. Steve’s eyes dilate and his fingers tighten on his fork to the point of bending it.\nConclusion: I’ve still got it, Bucky thinks smugly. \nHe keeps an eye on the room around them while he eats, one hand always free. Romanov and Barton are armed despite still being clad in sleepwear - both of them in pajamas inexplicably decorated with cartoon foxes. Wilson, Lewis, and Foster are unarmed and unlikely to present a threat. Banner is always a threat, armed or not, which is oddly comforting. And the Hulk is at least easily diverted. Stark has a random screwdriver he’s gesticulating with. Threat level high, despite current lack of suit. Jarvis is not engaging in conversation currently, but has assured Bucky already this afternoon that no dangerous subroutines have been added overnight and assisted Bucky with checking the external building for weaknesses.\nSteve, Bucky notices suddenly, has switched his fork from his right to his left hand. Bucky knows he’s perfectly dexterous with both, has been since he was a kid. Serum didn’t change that. Still, Steve prefers his right hand be dominant. Now it’s empty, sitting on the table in between them, palm up.\n“So the decoction was successful?” Thor inquires from across them, after obtaining a fifth helping of potatoes. Bucky waits for someone else to respond, but when no one does, gives a curt nod in the Norse God’s direction. “I am glad to hear so. The healing of great warriors fresh from battle can be a difficult thing. I myself have partaken, and the Warriors Three as well, that we might not be a danger to those serving us.”\n“Ohhh, I remember that,” Foster says, with a reminiscent tone, and Lewis chimes in with additional details. Bucky ignores the conversation in favor of shifting his fork to his right hand. He experimentally sets his empty left on the table by Steve’s. He doesn’t look at Steve.\nThe chatter around them is continuing.\n“Sounds like good stuff,” Clint is saying, leaning in interestedly around Natasha. “Hey, Bruce, maybe it'd help you, too.”\n“Oh hell, no,” Tony says. “We’re not having a high, horny Hulk in Manhattan. Who knows what he’d hump, huh? I’m not being responsible for the honor of Lady Liberty.”\nThe new prosthetic really is aesthetically pleasing. The inner adamantium plates are covered by a nanopolymer sheath. It’s soft and smooth. It conducts body heat well. Bucky can feel his pinky brush Steve’s. It’s warm. His cheeks are strangely warm, too. \nThe drugs had hampered Bucky’s situational awareness, dulled his senses. It’s harder to touch Steve now, in the light of day, sober, with his brain a snarl of instinct, embedded with danger like a mined field, but it’s also more real. Less like a dream, all soft-edged and intangible and hard to believe in.\nYou don’t have to ask, Steve had said, so Bucky doesn’t. He just takes Steve’s hand in his and laces their fingers together. He doesn’t breathe for a moment, vision graying slightly, sparkling with phosphenes like electricity, but nothing bad happens. Steve just squeezes his hand very, very slightly, and when Bucky flicks a glance at his face, he’s smiling at his pancakes. The nurse hat of his slips down slightly.\nThe Asgardian drugs had been helpful, Bucky concludes, but Steve—Steve’s better. He’s the best thing in Bucky’s entire world, always has been. And Bucky gets to touch him. It’s okay.\nIt’s a good morning to be alive, Bucky thinks, breathing deep, and steals a bite of Steve’s pancakes."
}