{
    "id": "19047949",
    "url": "https://archiveofourown.org/works/19047949?view_full_work=true",
    "author": [
        "sameuspegasus"
    ],
    "title": "Progress Report",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Spider-Man: Homecoming (2017)",
        "Spider-Man - All Media Types",
        "The Avengers (Marvel Movies)",
        "Marvel Cinematic Universe"
    ],
    "relationships": [
        "Peter Parker & Tony Stark"
    ],
    "characters": [
        "Peter Parker",
        "Tony Stark",
        "Happy Hogan",
        "Monica Warren",
        "Karen (Spider-Man: Homecoming)"
    ],
    "additional_tags": [
        "Interns & Internships",
        "Stark Industries",
        "Tony Stark Acting as Peter Parker's Parental Figure",
        "POV Outsider",
        "teacher pov",
        "poor Happy",
        "Smart Peter Parker",
        "Nerd Peter Parker",
        "Nerd Tony Stark",
        "Science Experiments",
        "BAMF Peter Parker",
        "Secret Identity",
        "Peter Parker Can't Keep Secrets",
        "Tony Stark Can't Keep Secrets",
        "BAMF Happy",
        "Identity Reveal"
    ],
    "language": "English",
    "series": "Part 2 of Glowy Green Slime",
    "published": "2019-06-01",
    "completed": "2019-06-09",
    "words": "10,984",
    "chapters": "2/2",
    "comments": "188",
    "kudos": "10,258",
    "bookmarks": "934",
    "hits": "98,856",
    "summary": "<p>Ms. Warren has some questions for Tony Stark regarding the exact nature of Peter's internship. She gets invited to the lab to see for herself.</p>\n<p>In which Peter Parker is surprisingly good in an emergency.</p>\n<p>Feat. many of our favourite tropes including BAMF Peter, BAMF Happy, Fire Exits Don't Exist, Everyone's Way Too Relaxed About This, Only Mostly Right etc.</p>",
    "notes": "<p>I would recommend reading Glowy Green Slime first for context. This was originally meant to be chapter two, but it got away from me, so I'm making it a separate fic in the same series. </p>\n<p>Almost everything in this fic has probably happened before because I took all my favourite tropes and shoved them all in. Variations on Field Trip to Stark Industries, Peter has Weirdly High Clearance, People Witnessing Tony Stark and Peter's Father-Son Relationship, Peter Makes Variations of Web Fluids, Peter Builds Robots, Peter is a Clever Cookie etc etc. </p>\n<p>I hope you like it.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>They say write about what you know - well, everything I know comes from TV. There is a lot of artistic license in this fic, especially in Chapter Two.</p>\n<p>Among the many things I know nothing about are:</p>\n<p>Artificial Intelligence<br>Computers<br>Electronic locking systems<br>Bombs<br>Bomb disposal<br>Air Vents<br>Sky Scrapers<br>Internships<br>Being a teacher<br>The US school system<br>How it feels to be in a building with a ticking time bomb<br>R&amp;D labs at major tech companies<br>Emergency Procedures<br>How to drive plot by making people unable to use fire escapes</p>\n<p>Explosion Rooms are a real thing but this is an inaccurate representation of them.<br>I did no research about bombs because I didn't want that showing up on my internet history.</p>\n<p>Who wants a field trip fic in this series?</p>",
    "text": "\nMidtown has been looking for a second Physics teacher all year, but it’s proving hard to find someone who is both qualified to teach physics to the high level demanded by Midtown, and good with young adults. In the meantime, Monica has been doing the work of two people. It’s been hard, and because her passion lies in teaching rather than in administration, it is the paperwork side of things that has taken the hit. Namely, the internship program. She just hasn’t had time to pay it as much attention as she should. She really should be more pro-active about keeping track of who is where and what they are doing, but the majority of students participating in internships are doing it outside of school hours and have already found placements. It’s hitting her now that she has no proof of any of the work these students claim to be doing and has no idea whether these internships are truly of any value. \n\n \n\nJudging by the video call she’s just witnessed between Peter Parker and Tony Stark, Peter Parker’s internship is highly questionable. From the sounds of things, Peter’s just messing about unsupervised in Tony Stark’s personal labs, doing things that are a lot too dangerous for a high school student to be anywhere near. \n\n \n\nShe spends her weekend going over the minimal paperwork she has for it. She hadn’t looked too closely when she’d received it, overjoyed that a student had managed to find his own placement, and not wanting to look a gift horse in the mouth. She’d ticked Peter off her list and returned to trying to find somewhere that would take Eugene Thompson. Nowhere had wanted to take him because his father had such a reputation for being, to put it politely, difficult to work with. Flash’s parents had been breathing down her neck, making demands of her, and she’d just thanked her lucky stars Peter had managed to land an internship at such a prestigious company and filed the paperwork.\n\n \n\nLooking at it now, the paperwork is woefully inadequate. There are no details of what Peter is doing, not even a department. There are no start and end dates or hours recorded. The job description is just “Intern”. Contact details are for one “H. Hogan, Asset Management”. She can’t even remember calling him to check any details. She’s been terribly, terribly lax, and it’s time to remedy that. \n\n \n\nOn Monday morning, Peter dashes into class right on the bell, with the wrong textbook. The whole class stirs from their Monday morning stupor to stare at him and whisper about Iron Man and the Stark Internship and how Peter actually knows Tony Stark and does stuff in his lab. Ned Leeds pokes him in the side and whispers loudly enough for Monica to hear from her desk, “Has the green stuff eaten the tower yet?”\n\n \n\n“Happy kicked it and it chased him,” Peter answers delightedly, “But we fixed it. Kind of.”\n\n \n\n“You have the best life,” Ned says enviously, “You should have filmed it, you could be a YouTube celebrity.”\n\n \n\n“I kind of did,” Peter says, “Only I can’t show it to anyone because of all the top secret stuff and Happy would be mad.”  \n\n \n\nAfter class, as Monica is clearing away her demonstration equipment and preparing for her next class, Peter approaches her desk.\n\n \n\n“Ms Warren?” He asks cautiously, “You - you know how you wanted to know more about my internship?”\n\n \n\n“Yes, Peter?” She asks briskly, “I’m afraid I’m going to need more details about the exact nature of what you’re doing, along with a progress report and a meeting with your supervisor, or I can’t allow you to continue the program.”\n\n \n\n“Mr Stark says you can come to the lab with me after school on Friday. You can’t come sooner because we have to do some… uh… maintenance.” He has the good grace to look mildly embarrassed. They both know what the maintenance is.\n\n \n\n“Oh,” Monica says in surprise. She hadn’t been expecting an invitation to Tony Stark’s lab. She’d thought he’d send some kind of underling to a meeting in her office, if he acknowledged her request for a meeting at all. The most she’d been hoping for was H. Hogan, Asset Management to drop by for half an hour. This feels like overkill somehow, like those companies that invite the auditors in when they’re being investigated for fraud. “I’ll see if I can clear my schedule.” She has a staff meeting on Friday afternoon, but Principal Morita will excuse her this once.\n\n \n\n“So you’ll come?” Peter asks awkwardly. “Only, all my stuff is there and it’s easier for you to come to the lab than to try to bring it to school.”\n\n \n\n“Yes, I’ll come,” she replies, “I look forward to seeing your project, Peter.”\n\n \n\nPeter’s eyes light up. “The labs are really cool, Ms. Warren! You’ll love them. I have to go, I have gym, but I’ll tell Mr Stark you’re coming, and then Friday I have Physics last anyway so you can just come with me when Happy picks me up.” With that, he dashes off to his next class, dodging incoming freshmen, waving from the door.\n\n \n\nMonica shifts Peter’s Chemistry textbook, which he’s managed to leave on her desk, to make room for her own notes. A piece of loose note-paper flutters out, covered in complex chemical equations written in Peter’s childish handwriting. Presumably what he’s been doing all class instead of paying attention. She glances through it quickly as she waits for her class to be seated, and, well, she knows it’s been a while since she’s done any chemistry beyond what she would need to cover a 9th grade General Science class, but it looks like a foreign language. \n\n \n\nFriday rolls around quickly. With so many classes to teach and papers to grade, and all the internships to follow up, and detention to run on Wednesday, and her brother’s birthday on Thursday, she doesn’t have a lot of time to think about the meeting with Tony Stark. Which is not to say she doesn’t think about it. Now that it’s been brought to her attention, it’s highly unusual for Stark Industries to take on interns at all, let alone high school interns, let alone high school interns that haven’t been put forward by the school. She hadn’t been notified of any internship opportunities at Stark Industries before Peter had got his, and usually if companies were looking for high schoolers, Midtown was the first place they looked. So it’s very odd on that level, even leaving aside the fact that he has personal contact with Tony Stark in a company with thousands and thousands of employees. And as for what Peter could possibly be doing that would result in a lab taken over by glowing green slime, she was at a complete loss.\n\n \n\n“Are you ready?” Peter asks her, once class is over and the rest of the students have stampeded out the door. \n\n \n\nMonica checks that her list of questions for Tony Stark is safely in her briefcase. “I’m ready.”\n\n \n\n“Happy’s outside,” Peter says, “He’s kind of grumpy, but he’s not really, he’s only pretending. He doesn’t like it when I’m late, though. He slides up the divider thing and pretends he’s not listening to me. I told him you were my teacher and to be nice to you.”\n\n \n\nPeter picks up his backpack. There are at least five enormous text books in it, straining the seams so one of the straps is ripping off with the weight, but he doesn’t seem to notice, so it can’t be as heavy as it looks. Monica walks beside him through the corridor, frowning her disapproval at the few people who jeer at him for hanging out with a teacher. \n\n \n\nHappy turns out to be a large man in a black suit and sunglasses, waiting beside a shiny black town car with tinted windows. “Any weapons?” He asks her gruffly as she approaches.\n\n \n\nMonica falters for words, taken aback.\n\n \n\nPeter, on the other hand, doesn’t seem to think this is an odd greeting. “Hey Happy! Of course she doesn’t have any weapons, she’s my physics teacher. Why would you even ask that? Ms. Warren, this is Happy, don’t mind him, he’s always like this.” \n\n \n\n“Please open your briefcase,” Happy instructs her, “It’s my job to ensure the safety and security of Stark Industries and its assets. You’ll be required to leave your briefcase with me, along with your phone and any cameras or recording devices you have with you. You must be with a Stark Industries employee at all times while in the building or any vehicles belonging to the company. You are not permitted to take notes. You are not permitted to touch anything without the express permission of Mr Stark. You are not permitted to open any doors, drawers or cupboards. You are not permitted to disclose any information to any type of media outlet, including posting it on the internet or social media. If you disclose any information to a competitive company, you will be prosecuted. If you are found in any part of the building you do not have permission to be in, you will be arrested for trespassing. If you damage anything deliberately or accidentally, you will be held liable. If you in any way threaten the safety or security of Tony Stark or Peter Parker, you will be removed from the building and prosecuted. Do you understand?”\n\n \n\nMonica nods dazedly, holding out her open briefcase for him to look in.\n\n \n\nPeter is staring at Happy, wide-eyed. “Woah, Happy, that’s the most I’ve ever heard you say! Do you say that to all the visitors? No-one’s ever come to the lab when I’ve been there before.”\n\n \n\n“Get in the car, kid,” Happy says impatiently. “OK, you’re good. Sign here.” Monica signs the clipboard he holds out for her. He nods for her to get in the car. Peter holds the door for her and follows her in. \n\n \n\n“Wow, that was intense, Ms. Warren!” Peter exclaims once they’re on the road. “I guess it’s because Mr. Stark isn’t here or something.” \n\n \n\nMonica takes that to mean he wasn’t given the same briefing when he first went to the lab, and doesn’t that raise some interesting questions?\n\n \n\n“Did you not have a security screening, Peter?” she asks.\n\n \n\nPeter pauses for a moment. “Happy said I couldn’t show my vlog to anyone, but then Mr Stark let me video him saying Hi to Aunt May, so I showed her that bit, but not any of the other stuff.”\n\n \n\nMonica doesn’t know how to respond to the fact that not only did Peter film a vlog featuring what seems to be a highly confidential department of Stark Industries, Tony Stark, the ultimate image of a man who doesn’t have time for children, had actively participated in it. \n\n \n\nWhen they reach the new Stark Industries building (this one separate to the new Avengers Compound upstate), Happy doesn’t pull the car up and allow them to step out as Monica had been expecting. Instead, he drives around the back and into an underground carpark, pulling into a space beside a silver Lamborghini. Monica gets out, taking great care to ensure her door doesn’t hit the paintwork of the sports car. Damaging Tony Stark’s brand new Lamborghini would be a bad way to start the interview. She hands her briefcase to Happy, trusting herself to remember all of the questions on the list she had made.\n\n \n\nThey make their way to an elevator that slides open as they approach. It has no buttons inside, just slides swiftly and silently upwards uninstructed.\n\n \n\nThey emerge into a lounge area filled with couches and a small kitchen area at one end. Peter drops his backpack on one of the couches and heads directly to the kitchenette. “Do you want a snack, Ms. Warren? Or a coffee or something? There’s cookies.”\n\n \n\nFaintly, Monica hears a female voice, much like the one in Peter’s phone, announcing, “Peter, Happy, and Monica Warren are waiting in the lounge for you,” and then, after a short pause, “She is Peter’s teacher, here to discuss his internship.”\n\n \n\nShe takes a glass of water and sits carefully on a couch under Happy’s watchful eye. Peter flops on the couch opposite, dropping crumbs from his cookie like he owns the place. “Are you sure you don’t want a cookie?” He mumbles through his mouthful. “Happy made them, they’re great.”\n\n \n\nMonica doesn’t take a cookie, feeling it would be somehow unprofessional to eat while discussing internships with Tony Stark. Instead, she perches stiffly on the sofa, trying not to notice Happy staring her down as though she’s a legitimate threat. The room is surprisingly plain, given Tony Stark’s well-known love of luxury. A bit disappointing, in fact. She’d hoped she’d get a chance to see the R&amp;D labs, full of equipment she can only dream of, and innovations she can’t even imagine. It seems a shame to come to Stark Industries and not even get a peek at what they do. Peter had seemed to think they would be going into the labs, but it seems he was mistaken. \n\n \n\n“Shall I go get him?” Peter asks, “He’s probably caught up in something.”\n\n \n\n“I’m sure he’ll be here soon,” Monica replies. She feels slightly unwell at the idea of disturbing Tony Stark in the middle of developing a new piece of tech. He’s famous for having a quick temper and sharp wit with people who get in his way. She doesn’t want Peter to be ripped to shreds by his hero for the simple crime of interrupting. While it’s annoying that Mr Stark isn’t ready for the interview, it is only what she was expecting.\n\n \n\n“I’ll go get him,” Peter says, jumping up and crossing the room to a door opposite the elevator.\n\n \n\n“Don’t run!” Happy shouts after him, but it does no good. Peter disappears at speed down the corridor.\n\n \n\nMonica is left to uncomfortably avoid eye contact with Happy.\n\n \n\nPeter doesn’t come back. \n\n \n\nMonica looks at her watch. She’s been sitting in the room for forty-five minutes. Peter has been gone for 30. She clears her throat and addresses Happy, who is still standing stone-faced beside the elevator. “I really must see Mr Stark today. It’s very important that we discuss Peter’s internship. Could you check their whereabouts?” She can feel the power balance tipping strongly in Tony Stark’s favour with every moment that passes.\n\n \n\nHappy not-very-subtly rolls his eyes and speaks into his watch. “Tony, the kid’s teacher wants to talk to you.”\n\n\n    \n\n\nHe must hear the reply in an earpiece, because he beckons for her to follow him out of the room. She stands, smoothing her skirt and reaching for her briefcase before she remembers she’d handed it over earlier. Happy leads her through the same door Peter had disappeared through and down a hallway past several closed doors. \n\n \n\nThe room Happy takes her to is a workshop, somehow less shiny and futuristic than she’d been expecting. It looks quite a lot look the workshop at school, in fact, but with more space and equipment in better condition. Black Sabbath blasts from invisible speakers. In the centre of the floor is a large workbench. Tony Stark and Peter are huddled beside it, heads bent over a small metallic object in Mr Stark’s hand. Peter’s fiddling with something on it with a pair of tweezers, frowning in concentration, while Stark points something out to him. \n\n \n\nHappy clears his throat loudly. No-one acknowledges him until Peter finishes whatever he’s doing and looks up in delight. “You’re fixed, Droney!” He says to the object, “Go and sit on Happy’s head.” Apparently, he’d noticed they were there despite his concentration.\n\n \n\nThe item in Tony Stark’s hand rises smoothly in the air, hovering for a second before smoothly flying over and settling on Happy’s head.\n\n \n\nHappy harrumphs quietly but otherwise pretends not to notice.\n\n \n\n“Ms. Warren!” Peter exclaims, like he’s just remembered why he came to the workshop, “I’m so sorry! I came to get Mr Stark, but then we started fixing Droney and I forgot. Mr Stark, this is my Physics teacher Ms. Warren. She’s in charge of the internship program and she wants to ask you some questions.”\n\n \n\n“Ms. Warren?” Mr Stark approaches her, holding his hand out to shake. He’s not at all what she’d been expecting. He’s wearing jeans and a t-shirt instead of a suit, and his ever-present sunglasses are nowhere to be seen. He’s smaller than he looks on TV and somehow less intimidating. But his chest is glowing through his shirt, and she can’t escape the knowledge that she’s talking to Iron Man.\n\n \n\n“Good afternoon, Mr Stark. I have some concerns regarding Peter’s Internship. I’d like an overview of Peter’s job here and a progress report for the project he’s working on, if you would,” Monica keeps her voice firm and professional. Tony Stark may be Iron Man, but he shouldn’t be treated any differently to any other internship supervisor (who is she kidding, she’s already treating him differently by coming to him rather than calling him in).The voice-operated drone nestled in Happy’s hair is very distracting, but she powers through it. “If what Peter’s doing here doesn’t fulfil the requirements of the internship program, his employment will have to either be terminated or change to satisfy the requirements.”\n\n \n\nShe can see the smile falling away from Peter’s face, his eyes going big and worried at the prospect of losing his Stark Internship. She keeps her eyes on Tony Stark. The look on Peter’s face would wear down the resolve of the most hard-hearted person in the world. She thinks about how Tony Stark had kept her waiting, and his reputation for doing whatever he wants whenever he wants. Her determination to make up for her inadequate work as internship coordinator hardens. “I also have concerns about the impact of this internship on Peter’s schoolwork, as well as some issues related to Health and Safety,” she continues, “I thought we could start with a run-down on what exactly Peter’s position here involves.” She feels naked doing this without her desk, and with nothing in her hands. Tony Stark is looking right through her. She revises her judgement that he’s less intimidating in real life. \n\n \n\n“Concerns about the impact of this on Peter’s schoolwork? What, the kid’s been falling asleep in class again? I’ve got an idea of how to fix that - try making your class more interesting. Peter’s learning a hell of a lot more here than he does at school. Actually using that brain of his and doing something practical instead of sitting in a classroom memorising answers,” Tony Stark says impatiently.\n\n \n\n Monica wants to defend following the curriculum and tell him that Midtown works at a very advanced level. She tries to make her lessons interesting, with demonstrations and practical activities and real-life applications, but they still have to cover the basics to create a solid foundation for higher learning, not to mention work at a pace suitable for the majority of the class. And then there are things like funding and class sizes and time constraints, as well as having to work with the available resources. She doesn’t, because it will only back up the argument that Peter is getting more benefit from this internship than from school, so it doesn’t matter that he’s neglecting his schoolwork.\n\n \n\n“Mr Stark!” Peter sounds alarmed, “Ms. Warren’s classes are totally interesting, she’s a really good teacher.”\n\n \n\nMonica would be flattered if he wasn’t so obviously lying. And if he hadn’t fallen asleep in her class twice.   \n\n \n\n“Peter helps me out,” Tony Stark says, “Watches me work and all that. He’s been doing a few projects of his own, too. Physics, mechanical engineering, electrical engineering, chemistry, programming, bio, math, all the fun stuff…”\n\n \n\nMonica tries not to gape at him. No wonder Peter’s been tired. Internships usually fit into one of those categories, sometimes do a project that intersects into two, but multiple projects in different fields is unheard of for a high school intern. Of course, they’re probably minor projects, nothing too time consuming or advanced, but still. “I’d like a progress update on his main project, and anything else he’s been working on, please.”\n\n \n\nTony Stark turns to Peter. “Take it away, Pete.”\n\n \n\n“Do - do you want to start in here, then?” Peter stammers awkwardly, “OK, well, this is the workshop. It’s where we build stuff. Like Droney. Come here, Droney.”\n\n \n\nThe drone Peter and Tony had been working on when she entered rises from atop Happy’s head and floats over to hover in front of Peter. \n\n \n\n“Droney’s a surveillance drone I made. He monitors stuff when I’m not here or can’t do it myself safely,” Peter starts, “We’ve just been fixing him because he got a bit damaged last week when my chemistry project got a bit out of hand - oh, no Ms. Warren, it’s okay, no one got hurt or anything, and it stopped, I think it ran out of fuel or something, I’m still working on that - anyway, I can send Droney in and he’ll get the data and report back to Karen. You know Karen, she’s my s… AI, you heard her in my phone.”\n\n \n\nMonica waits until Peter pauses for breath. She doesn’t like the sound of whatever Peter’s doing that requires a drone to be used because it’s too dangerous for him to do himself. “Why do you need to send a drone in, Peter?”\n\n \n\n“Oh, that’s just for when I’m trying something new, or for checking out something that’s hard to access quickly. See, this is a camera,” Peter points to a tiny lens that’s almost invisible. “That records a high def, 360 degree view of the area. This one’s a microphone for sound recording. There’s also a heat sensor, a radioactivity sensor, a multi-type gas detector, a sampling pipette, a composition probe and a pH probe. Do you want to see it in action? It’s really cool, Ms. Warren, you’ll like it.”\n\n \n\nPeter looks at her hopefully, like her nephew on his birthday when he’d asked if she wanted to play with his Iron Man figurine. In fairness, the drone is really cool. She badly wants to see how it works, but she’s trying hard not to let anything influence her impartial judgement on this internship. Not Peter’s enthusiasm, not how cool the drone is, not the way Happy is still watching her like she might attack at any minute and especially not how proud Tony Stark looks when Peter’s describing what he’s made. “A demonstration would be fantastic,” She tells him.\n\n \n\n“Droney, update me on Explosion Room B,” Peter instructs. As the drone flies off, Peter pulls his phone from his pocket. “Karen, show me the report from Droney.” He sets the phone on the workbench, screen up.\n\n \n\n“Hello Peter,” the phone replies in a calm female voice, “Droney is currently on route to Explosion room B. How was school?”\n\n \n\n“School was good. I got an A on my English assignment.”\n\n \n\n“I’m glad to hear that, Peter. I know you worked hard on that. Droney has entered Explosion Room B. Would you like me to display the data?”\n\n \n\n“Yes please, Karen. Can I have a visual scan first?”\n\n\n“Certainly, Peter.” The phone screen blinks, a small holograph appearing above it, slowly spinning to show the inside of a metal-lined room, empty except for a small flask in one corner and an enormous blob of a green, jelly-like substance that has expanded to fill most of the room and flow out the door. The door seems to have come off its hinges, an impressive feat in a room designed to absorb and contain energy blasts.\n\n \n\n“Would you like to listen to the sound recording?” Karen asks.\n\n \n\n“Yes,” Peter replies. A slow squelching, sucking noise comes through the speaker as the blob in the holograph wobbles and settles. “I changed my mind, Karen, don’t play the recording. Just show me all the data.”\n\n \n\nThe holographic view of the room zips out of sight, replaced by a screen with writing on it.\n\n \n\n“Are you okay Ms. Warren?” Peter looks at her through the holographic screen. \n\n \n\nMonica realises her mouth is hanging open. “Did you make this, Peter?” She has a Master’s degree in Applied Physics and she definitely wouldn’t be able to make something like this. Of course, this is more in the realm of robotics and computer engineering, not really her area of expertise, but still, it’s impressive.\n\n \n\n“I made Droney,” Peter says. “Mr Stark made the phone and Karen and helped with Droney. You can come back Droney, I’ve got what I need.”\n\n \n\n“Very impressive, Peter,” Monica says, “If you can show me your write up, I’ll make a record of what you’ve been doing for your internship file. This will look fantastic on a college application.”\n\n \n\nPeter’s face dims a little. Maybe she wasn’t enthusiastic enough. She really does think it’s amazing, she’s just so used to presenting a controlled, professional persona in front of her students that she no longer has the same freedom of expression that she once did.\n\n \n\n“I haven’t written a report for Droney,” Peter admits, “I mostly just made him because it was fun. But I have written work for some of the other stuff I’ve been doing…”\n\n \n\n“I think Peter wants to show you his other projects,” Mr. Stark interjects in a tone that suggests it’s in her best interest to let Peter show her what else he’s been working on. It reminds her forcibly of her brother insisting she look at the pictures her nephew had drawn.\n\n \n\n“Are you telling me that’s not your main project, Peter?” Monica asks in disbelief.\n\n \n\nPeter grins, a glowing, cheeky, genuine smile that he rarely displays at school. He’s different here, somehow. Maybe it’s because he’s in his element, doing what he excels at without all the restrictions of organised schooling. Maybe it’s that he finds what he’s talking about exciting and he doesn’t have to curb that the way he does in class. It could be the lack of social pressures and self-consciousness. Whatever it is, Peter is standing taller than he does at school. He even seems like he’s moving more gracefully as he leads them out of the workshop and into the neighbouring lab. \n\n \n\nThis lab is more like what she’d been expecting when she’d imagined a Stark Industries lab, although in her imagination it had been full of scientists and lab techs and assistants, all hard at work developing and testing new technology. In reality, the only people in it are herself, Tony Stark, Peter Parker and Happy. It’s not set up for more people either. She’s really in Tony Stark’s private lab, the legendary place where no one but Tony Stark, Pepper Potts, and a very select few others are permitted. Peter has a workstation in the corner. Karen greets him as he approaches, welcoming him back. \n\n \n\nAs Monica watches him prepare to show her his projects, it’s really hits her how special this is. Nobody just gets allowed in to Tony Stark’s private work area, especially not people he doesn’t know. But Peter’s got his own work station, and Mr Stark is letting her see it because he wants to keep Peter. Peter is important to him. He values Peter’s input enough to allow a lowly high school physics teacher into his inner sanctum. \n\n \n\n“I’ve got stuff written up for this one, Ms. Warren,” Peter says, handing over a notebook. \n\n \n\nMonica flicks through it, looking over pages and pages of calculations of speed and velocity and momentum and gravitational pull. There are huge numbers of pendulum calculations, along with various equations of rotation and energy usage. It’s far more advanced than what Peter’s class is currently studying. Some of it is theory she hadn’t learned until university. No wonder he spends most of his time in her class watching videos on his laptop. “When did you learn this, Peter?” she asks, “This is very impressive. Is there an application for it?”\n\n \n\n“I found a textbook in a dumpster last year,” Peter replies, which is not at all what Monica had been expecting him to say. “I wanted to figure out how Spider-Man does his stuff.”\n\n \n\n“Pete’s really into Spider-Man,” Tony Stark says teasingly. “Big fan. It’s embarrassing really.”\n\n \n\n“Spider-Man can lift a bus with his bare hands!” Peter defends himself, “He’s an awesome superhero.”\n\n \n\n“So this project is about Spider-Man?” Monica clarifies. She’s well aware that Peter’s really into Spider-Man. She’s lost count of how many times she’s caught him watching Spider-Man videos, and there had been a rumor going around a while back that Peter claimed to know him.\n\n \n\nTony Stark interjects, “Spider-Man runs into stuff a lot. Walls, streetlamps, buildings. Misses his landings and ends up in swimming pools.”\n\n\n“No, no he doesn’t,” Peter protests vehemently, “He hardly ever does that anymore.”\n\n \n\n“Whatever you say, kid,” Mr Stark smirks at the rise he’s got out of Peter. “Anyway, this stuff’s all going to be programmed into Karen when I upgrade the suit. Path mapping stuff, for picking the best way through the streets and knowing where to attach the webbing for the best swing and all that.”\n\n \n\nPeter freezes, his eyes going wide. “There’s going to be a new suit? And I’m helping program it?” Monica has never seen a student look this excited in her twenty year career as a teacher. “Omigod, Mr Stark, really? That’s awesome! I can’t believe you’re actually using my data for the new suit, this is the coolest thing ever! Can I tell Ned?”\n\n \n\n“No, you can’t tell Ned,” Mr Stark tells him, but he looks like he’s holding back a smile as he mutters to Happy, “He’s definitely going to tell him.”\n\n \n\nPeter is already pulling out his phone and texting someone.\n\n \n\nHappy glares at Monica. “That’s confidential. You can’t tell anyone that.”\n\n\n\n\n\n\nPeter is practically skipping as they make their way into the next lab. This one’s smaller, set up for chemistry, and faintly tinged with green. There is a small robot scrubbing the floor. At one end, the green substance Droney had shown them is flowing out of a doorway. \n\n \n\n“Ah, yes,” Monica remembers the her health and safety concerns, “Regarding the lab accident… could you explain the circumstances and the safety precautions and supervision in place at the time. I have concerns about a fifteen year-old performing dangerous experiments alone.”\n\n \n\n“Happy was here!” Peter protests, “and it would still have happened if Mr Stark was here.”\n\n \n\n“If a lab accident of this scale is expected to happen even with an expert performing the experiment, it shouldn’t be done,” Monica says severely.\n\n \n\n“But -” Peter starts.\n\n \n\nTony Stark cuts him off. “I’m starting to think you’ve never met Peter. You should be thanking me that this happened here and not in your school labs.”\n\n \n\nIn all honesty, Monica’s starting to think that too. \n\n \n\n“It wasn’t expected to happen! You don’t expect accidents!” Peter says defensively, “And there’s nothing I did that should have caused that. All I did was add extra salt. It’s not toxic or anything. Anyway, it’s not moving anymore, so that’s good.”\n\n\n“Peter’s working on fixing this. That’s actually what he’s going to be doing this afternoon,” Tony Stark tells her, waving aside Peter’s defense.\n\n \n\n“I can’t, I’m volunteering later,” Peter says meaningfully, “I don’t have time.”\n\n \n\n“Uh, yeah, you do. I’m sure Queens can survive without your volunteer work for one Friday night.”\n\n \n\nPeter looks like he’s going to answer back (Peter Parker, answering back to Tony Stark, maybe she really doesn’t know him), but Monica breaks in. “Volunteering, Peter? What is it that you’ve been doing? A letter of recommendation from the organisation will look great in college applications.”\n\n \n\nMr Stark answers for him. “Oh you know, helping old ladies with their groceries, giving people directions, that sort of thing.”\n\n \n\nPeter makes an indignant noise. “I do more than that.”\n\n \n\n“That’s very admirable, Peter,” Monica says. Not many of the boys she teaches would think of helping the elder community, let alone do it for no reward. “How often do you do it? I think you might be over-taxing yourself with volunteer work and an internship of this scale on top of school.”\n\n \n\n“I’m not over-taxing myself!” Peter insists. There’s a sceptical snort from Happy and a raised eyebrow from Mr Stark.\n\n \n\n“Are you gonna show of your project or what, Pete?” Tony Stark says.\n\n \n\n“Oh, right, my project. This is like, my main project. Just a sec.” Peter pulls his laptop from his bag, along with a thick notebook, placing them on the bench and turning on the computer. It whirrs, making a strange thumping noise as it starts up.\n\n \n\n“Jesus, where did you find that thing? You need an upgrade, stat,” Mr Stark comments.\n\n \n\n“Someone just threw it out, can you believe that?” Peter says, as his home screen loads. He clicks into a folder, bringing up a report. “This is just an outline, Ms Warren.”\n\n \n\nMonica moves closer to the screen to read what’s on it. \n\nHigh Strength Liquid Adhesive For Medical Triage, \n\nthe title reads. \n\n \n\n“So it’s like using superglue, only it can be applied from a distance and cover a bigger area,” Peter tells her. “So I can - I mean so someone can shoot it out of a w-an application device super quickly and help people a fast as possible. I’ve been trying to get a painkiller or a sedative in there as well, so people aren’t panicking and in pain while they wait for more help. Only I have to figure out how to make it not sticky to touch for, like the emergency services and stuff, and so it doesn’t stick the hurt people to stuff. Oh, and I need to make sure it won’t cause infections, and and won’t dissolve. I’ve made a ton of variations, but the last experiment had a few issues, so I’m working on that…”\n\n \n\nMonica scrolls through pages where Peter has repeated the experiment over and over with tiny tweaks and analysed the results.\n\n \n\n“This is confidential,” Happy reminds her, “If we see this stuff popping up anywhere, we know how it got leaked.”\n\n \n\nMonica looks up at Peter. “Where did you learn this?”\n\n \n\nPeter shrugs. “It’s pretty easy to figure out. I read some articles about it. Aunt May’s got access to the medical journal databases.”\n\n \n\nMonica makes a mental note to speak to Peter’s aunt and his chemistry teacher. This is not a high school project. This is masters level, minimum. She’d known that Peter was gifted. He always did well, even in a school full of gifted students. He was in academic decathlon and always got good grades, although his homework and attendance over the last year had been letting him down. But this is something else. \n\n \n\n“That’s not patented yet,” Tony Stark says, “but when it is…”\n\n \n\n“Hey, Mr Stark? Mr Stark!” Peter stiffens suddenly, alert. “I think maybe we should wrap this up so I can go do my volunteer work.”\n\n \n\n“You’re staying here and cleaning this up today, kid.” Tony Stark indicates the blob flowing out of what Monica assumes is Explosion Room B. “But I think we’re finished here.”\n\n \n\nPeter grabs his arm. “Is anyone else cold?” He asks, in a strangely urgent non sequitur. “I’ve got goosebumps.”\n\n \n\nTony Stark becomes suddenly serious. “Everyone stay here - that means you too, Pete - I’ll be back in a minute.” \n\n \n\n“I could come with you,” Peter starts.\n\n \n\n“Stay here, with Happy and your teacher,” Tony Stark says sternly.\n\n \n\n“What’s going on?” Monica asks, looking between them. “Is something wrong?”\n\n \n\n“Friday’s gone quiet,” Mr Stark replies, which means nothing to Monica, but seems to mean something to Happy, because he reaches for his gun. “It’s probably nothing, I’m just going to check things out real quick before Happy takes you home.” He’s fiddling with his watch, failing to hide his concern when when whatever he’s trying to do doesn’t work.\n\n \n\n“Don’t do anything stupid,” Tony Stark says as he departs, closing the door behind him.\n\n \n\nHappy moves to stand between Monica and Peter and the door. Monica looks at Peter, intending to comfort him if the suddenly tense atmosphere is making him nervous. Peter is crouching, like an athlete preparing himself. His cuffs are unbuttoned, showing flashes of metal at his wrists. “Don’t worry, Ms Warren,” he grins at her. “Everything’s going to be fine.”\n\n \n\nThen everything goes dark.\n\n\nFor a moment, no one moves. They just stand where they are in the dark, silently waiting. There’s a sense of wrongness - this is not just a power cut. The power doesn’t just fail in the Stark Industries building. Friday doesn’t go quiet. Monica doesn’t know what Friday is, but she knows from Tony Stark’s tone that something going wrong with Friday is very, very bad. \n\n \n\nThey can’t just stand there. The lights might be out, but their brains haven’t broken. There must be something they can do. “Is there a back-up generator?” Monica whispers. She’s not sure why she’s whispering, it just feels like she should. Why isn’t Happy doing anything? He’s clearly a security person as well as being an Asset Manager, whatever that is. He must know the protocol.\n\n \n\n“Shh,” hisses Peter, “I’m listening.”\n\n \n\nMonica’s listening too. She can’t hear anything but her own breathing. Wait - maybe that’s something. People talking, too far away to make out the words.\n\n \n\n“Oh, shit,” exclaims Peter. Monica whips around to look at where the sound came from. She still can’t see him. Her eyes aren’t adjusting like they should. “I mean, don’t worry Ms. Warren, everything’s gonna be fine!” There’s a tremor in his voice and a rising intonation which makes her stomach clench.\n\n \n\nThe room is almost completely pitch-black, the only light emitting from the faintly luminous slime leaking out of explosion room B. The lack of windows is starting to weigh on her. She can hear Peter moving across the room with perfect ease, as though the lights are still blazing.\n\n \n\n“Um,” Peter whispers in the same clearly audible voice he uses to talk to Ned during class, “Hey, Happy? Kind of a weird question, but do you know how to defuse a bomb?”\n\n \n\n“What?” Happy asks, alarmed.\n\n \n\nMonica’s heart gives a strange stutter, her chest feeling tight. She really, really, hopes Peter is just making casual conversation to pass the time until the lights come up. She doubts it.\n\n \n\n“What’s going on, kid? What did you hear?” Happy asks again.\n\n \n\n“There’s a guy doing a bad guy speech to Mr Stark,” Peter replies. How he knows that, Monica can’t fathom. She can hear the faint sound of a voice talking against the silence of the powered-down building, but there’s no way it’s humanly possible to make out the words. At her last check-up, she’d had perfect hearing, there’s no way Peter’s ears are that much better than hers. But then she remembers Happy talking to Tony Stark through his watch and hearing a reply in an invisible earpiece, and she realises Peter’s probably got a piece of tech helping him. He probably made it himself. At this point, after seeing the drone and the physics project and the liquid adhesive, she wouldn’t put it past him to have invented a hearing aid that enhances hearing beyond human ability. Or he’s got a similar two-way communication system to Happy, although why he would have that is a question she’s saving for a less stressful moment.\n\n \n\n“Did you say a bomb?” Monica asks. Her voice sounds much steadier than she feels. She’s always prided herself on being calm in a crisis.\n\n \n\n“Don’t worry, Ms. Warren! We’ve got this under control,” Peter says, with somewhat worrying confidence. He’s only betrayed by the tiny shake in his voice. He starts whispering to Happy again, as though she can’t hear him in the absolute quiet of the lab. Even the hum of the air conditioning has stopped. She hadn’t realised how noisy it was until it turned off. “I think he works in R&amp;D? He’s real mad at Ms Potts for not promoting him, and he came up here to steal an Iron Man suit to escape before the bomb goes off, only he thought Mr Stark wouldn’t be here because of how he’s meant to be upstate on Fridays.”\n\n \n\n“Don’t even think about going to help Tony, kid,” Happy growls, “He’s Iron Man, he’ll be fine. We need to get out of here and evacuate the building. Are we locked in?”\n\n \n\nMonica feels frozen in place, detached from reality. Things like this don’t happen in real life, do they? She’s a Physics teacher from Queens, she should be at a staff meeting.\n\n \n\n“Hey, Karen,” Peter says, still not as scared as he should be. “Are you there?”\n\n \n\n“Hello, Peter,” the smooth female voice of his phone - sorry, AI -  replies. It’s strangely comforting. At least something’s still working. The phone emits a soft blue glow, lighting Peter’s face. “As I am an independent system, and not part of Friday, I am currently functioning. However, at this time I have no access to Friday’s databases, and no ability to communicate with Friday. I also appear to be unable to communicate with devices that do not operate on the Karen system.”\n\n \n\n“So we can’t contact Mr Stark?” Peter asks. “Or call 911?”\n\n \n\n“I’m afraid not, Peter.”\n\n \n\n“And the floor is in lockdown?”\n\n \n\n“It appears so. A very sophisticated virus has infected Friday, engaging all the building lockdown systems. I withdrew and put up a series of firewalls before I could be infected, so I have no further information.”\n\n \n\n“Where’s the fire exit?” Monica asks. “Shouldn’t we pull the fire alarm?”\n\n \n\nPeter’s still for a moment, listening. “The bad guy just told Mr Stark the bomb will go off if anyone tries to open a fire exit. I mean, he could be lying, sometimes bad guys try to bluff their way out of stuff, but…”\n\n \n\nIt’s kind of horrifying that Peter sounds like he knows that from experience. Monica takes a breath, wiping her sweaty hands on her pants. If she gets out of this, she’s never going to complain about the Friday afternoon staff meeting again. The voices are getting louder down the hallway.\n\n \n\n“How long have we got, Peter?” Happy asks.\n\n \n\n“I don’t know,” Peter replies, “I mean, he’s talking a lot, but you know… hey, do you think Mr Stark needs some back up?”\n\n \n\n“He’s Iron Man, kid, I think he can handle one scientist without the help of a twelve-year-old,” Happy replies. It’s comforting how much faith Happy as in his employer, but at the same time, hiding in a chemistry lab, waiting for someone to save the day while thousands of people are in immediate mortal danger doesn’t sit well with Monica. There’s already a crushing sense of guilt wearing through her haze of fear. There must be something they can do.\n\n \n\n“But,” Peter starts to protest, but Happy cuts him off.\n\n \n\n“You’re gonna crawl through the vents,” he says, “Pepper’s office is on the floor below us. Go in and tell her Tony wants to know if she wants pineapple on her pizza. She’ll know what to do. Then you get the hell out. Evacuate with the rest of the staff and go home.”\n\n \n\n“But what about you? What about Ms Warren? I can’t just leave you guys here.”\n\n \n\n“Leave us, Peter,” Monica instructs him, “Evacuating the building is the best thing you can do.” Her voice sounds every bit as calm and firm as it does when she’s teaching, at odds with her racing mind and thumping heart. She fights the strange urge to laugh. If she gets out of here, the first thing she’s going to do is go and hug her nephew. Hold him tight and make sure he’s never, ever in a position where he has to crawl through vents in a building filled with explosives.\n\n \n\n“Do I look like a vent-crawling guy? Get going!” Happy urges. “Do you need a hand getting up there?”\n\n \n\n“No, I’m good,” Peter answers, before somehow launching himself onto one of the benchtops and reaching up to pull the grate off the vent in the ceiling. Monica can’t see exactly what happens in the darkness, just hears the clank of metal hitting the floor and sees the shadows of Peter’s legs disappearing inside the vent as he hoists himself up with the ease of an olympic gymnast. Coach Wilson did tell her that Peter’s performance in gym class had really come along this year, but she hadn’t understood how much. She’s fairly sure she wouldn’t be able to follow him into that vent even with Peter hauling her in from above and Happy pushing from below. She’s in quite good shape for a high-school Physics teacher, but she can’t do a single pull-up.\n\n \n\n“Don’t go looking for the bomb, Peter, I mean it,” Happy calls up to him.\n\n \n\nBut Peter’s already gone.\n\n \n\nDown the hallway, a shot reverberates around the room. Something crashes to the floor. Someone’s yelling, interspersed with brief statements from a quieter, goading voice. There’s something caught in Monica’s throat. She grips the bench top so hard her fingers hurt.\n\n \n\n“You good?” Happy asks.\n\n \n\nNo. No, she’s not good. There’s a bomb in the building, her student is crawling through the ventilation system, and she’s hiding in a chemistry lab filled with green slime while someone shoots at Iron Man 200 yards away. She is not good. \n\n \n\n“Would he?”\n\n \n\n“Would he what?”\n\n \n\n“Would he go looking for the bomb? Why would he do that?”\n\n \n\n“Kid’s got an overactive sense of responsibility,” Happy tells her, “Do you know anything about electronic locking systems?”\n\n \n\nShe doesn’t really know anything about electronic locking systems. She teaches kids about electricity in some of her classes, but that’s about what it is and how it’s produced, she’s not an electrical engineer. She knows basically how locks work though, so she can have a look. It beats standing around uselessly, listening to the fight down the hallway.\n\n \n\n She’s feeling her way across the lab to examine the door when Karen speaks from Happy’s pocket. “Peter has activated Homecoming Protocol,” the AI announces, “You may not decline this call.”\n\n \n\nHappy pulls up short, reaching into his coat pocket to pull out his phone, which is flashing red and vibrating violently. Monica doesn’t like where this is going.\n\n \n\n“What’s happening, Peter?” Happy barks.\n\n \n\nThere’s a rustling noise and some breathing. Then: “I swear I wasn’t looking for it, Happy.”\n\n \n\n“Jesus Christ,” Happy groans, “Where are you? Just back off and we’ll come up with plan B. Don’t touch it.”\n\n \n\nMonica sits down heavily on the floor and tries to breathe.\n\n \n\n“I-I don’t think I can do that Happy,” Peter’s voice is trembling, “It’s in the vent over Ms Potts’ office. There’s a timer.”\n\n \n\n“Deep breaths, kid,” Happy puts the phone on the bench, screen up like when Peter had demonstrated Droney. That seems like a million years ago now. “What’s on the timer?”\n\n \n\n“3 minutes 52,” Peter says. \n\n \n\n3 minutes. It’s not enough. Even if Iron Man wins his fight, busts through the ventilation system and flies it out of the building it’s not enough time. Even if Peter crawls back up to them, it’s not long enough. There’s no time to evacuate the building if he finds a different grate to climb out of. There’s not even a way for Monica to get a message to her brother, or tell her nephew she loves him. She clasps her shaking hands together and thinks of all the things she wants to say, like if she thinks them hard enough her family might hear.\n\n \n\n“Connecting to Droney,” Karen says, calmly as ever, because artificial intelligence doesn’t feel fear.\n\n \n\n“You’ve got this, Pete,” Happy says, “It’s just like any other piece of electronics.”\n\n\nThe hologram zips out of Happy’s phone, rotating above the bench, and even despite the situation, she can’t help but marvel at it. It’s a full scale, highly detailed 3D model, but it’s just made out of light. It seems like it should be impossible, but this is what Stark can create, and what Peter is learning to do. \n\n \n\n“Can you show me underneath, Peter?”\n\n \n\n“I feel like I shouldn’t move it. In movies it always goes off if you move it. Oh, man, I didn’t even bring a juice box.”\n\n \n\n“Why would you need a juice box?” Happy asks, “You know what, I don’t want to know. I need a better look at the detonator. Lift the whole thing up very, very carefully and get the drone under there. Try not to move any wires and if you feel any resistance put it back down immediately.”\n\n \n\n“On that old TV show Chuck from like, ten years ago, they disarmed a bomb with a juice box,” Peter says, with way too much levity for the situation he’s in. Monica can only assume talking about old TV shows helps him calm down. He takes a deep breath. “Come on, Peter. OK, lifting it up. Droney, get under there.”\n\n \n\nThe hologram changes to present a different view of the bomb, this one from underneath. It looks different to what she’s seen in movies, a series of metal chambers with a timer attached and very few access points.\n\n \n\n“There’s some kind of liquid in it, Happy,” Peter says, “I could hear it sloshing. He probably made it in the R&amp;D lab, I bet there’s a ton of explosive chemicals in there. If I had time I could get it there and analyse it, but we’ve got like, two and a half minutes. Should I get Droney to sample it?”\n\n \n\n“No, don’t mess with it, Pete. The bomb disposal unit can do that. All you have to do is disable the detonator, disconnect it, stabilise the chambers, and get as far away as possible.”\n\n \n\n“Copy that, 10-4,” Peter answers, “How do I disable the detonator?”\n\n \n\nHappy spins the hologram to look closely at the detonator. “See that thing that looks like a jar lid? That’s connected to a switch which will close when the timer goes off, causing a mini-explosion that will ignite the liquid explosives. You need to make sure the connection can’t close. Can you pull the timer away from the rest of it at all?”\n\n \n\nPeter’s hands appear in the hologram, delicately pulling the timer away from the metal chamber so it dangles from a series of colourful wires. “Now what?”\n\n \n\n“Now follow the wires to see which is connected to the switch that connects to the detonator.”\n\n \n\nPeter’s fingers gently trace the wires. “I think it’s the black one.”\n\n \n\n“You think?”\n\n \n\n“It’s definitely the black one.”\n\n \n\nHappy follows Peter’s fingers on the hologram. “OK, break the connection. Try to not jostle anything.”\n\n \n\nMaybe Peter’s got some kind of tool Monica can’t see on the video feed, but it looks like Peter simply pulls gently at the black wire and it breaks in two. That can’t be right, though. She’s done calculations on the tensile strength of wire and the amount of force needed to break it it far too high. The numbers on the timer blink out and Peter lets out a relieved whoop. “Yes! Now what?”\n\n \n\n“You’ve got the timer off, but the detonator is still functional,” Happy says, “We’re not out of the woods yet, kid. But you can take your time, now. So, you need to pull the jar lid off…”\n\n \n\n“Where’s Peter?”\n\n\nMonica jumps, suddenly aware that the sounds of the fight down the hallway have stopped. Tony Stark is standing in the doorway, dishevelled but uninjured, face barely visible in the glow of the hologram.\n\n \n\n“Oh, hey Mr Stark!” Peter exclaims, “Did you win?”\n\n \n\n“Didn’t even have to put on the suit, kid,” Tony Stark tells him, “Webbed him up with Spidey’s new shooter. Lordy, those things are fun.”\n\n \n\n“There’s new web shooters? That’s awesome, Mr Stark! Anyway, I can’t talk right now, I’m kind of in the middle of something.”\n\n \n\n“In the middle of what?” Mr Stark asks suspiciously, walking over to spin the floating image of the bomb. “You better not be doing what I think you’re doing.”\n\n \n\n“I just have to finish disarming this bomb and then tell Ms Potts you want to know if she wants pineapple on her pizza. I am freaking out, what should I say to her? Should I introduce myself or does she know who I am? No of course she doesn’t know who I am, that’s stupid. I’m pretty sure you don’t sit around at home talking about me.”\n\n \n\n“OK, back up to the disarming the bomb thing,” Tony Stark says, “Because I think I heard you say that, but I clearly remember telling you not to do anything stupid.”\n\n \n\n“I wasn’t looking for it!” Peter insists. Monica’s starting to think he’s protesting too much. And why does everyone assume Peter would look for a bomb? She’s taught him for several years and he’s never done anything at school to suggest he’d deliberately seek out a dangerous situation. “I just found it and then there wasn’t time to do anything else! OK, Happy, I’ve got the jar lid off. What now?”\n\n \n\n“We’re going to have a serious talk about this later, kid,” Tony Stark says firmly, “Careful now, Pete.”\n\n \n\nMonica watches as Happy talks Peter through disconnecting and removing the detonator. The hologram shuts off after he breaks the wire and pulls the detonator away from the main body of the bomb. There’s some rustling and a light thwap noise. “I’ve secured it to the wall,” Peter tells them. “Oh crap, now I have to interrupt Ms Potts’ meeting. She’s nice though, right? Not that scary.”\n\n \n\n“She knows who you are, I showed her the video of you pretending to be Thor,” Mr Stark tells him, “Just keep me on the line and get that detonator into an explosion room first.”\n\n \n\n“You showed her that? Mr Stark!”\n\n \n\nMonica can’t see Tony Stark’s face in the absence of light from the hologram, but she suspects he’s smirking. She hears the crunch of a metal grate being moved.\n\n \n\n“Wow,” whispers Peter, “It’s so weird, everyone’s just doing their jobs like nothing’s happened. Funny how people can not know what’s going on right over their heads.”\n\n \n\n“Hey you,” Tony Stark says, “Pete’s teacher. Come with me, we need to get the lights back on and Friday back in action. Hap, he’s in the workshop, keep an eye on him, would you.” He picks Happy’s phone off the bench and turns to go, clearly expecting her to follow. She stands up, going woozy for a second and grasping the bench for support. Everyone is entirely too relaxed considering there’s still a bomb in the building and a fifteen-year-old carrying around a disconnected detonator.\n\n \n\nTony Stark leads the way to a large room filled with computers. One whole wall is covered in screens, while rows and rows of computer hardware fills the rest of the space. It should be humming, but the power is out. “I’m afraid I won’t be much help,” Monica says, “I’m a physicist, not a computer engineer.” \n\n \n\n“Oh, you’re just here to hold the flashlight,” Mr Stark replies, and she mentally kicks herself. He’s Tony Stark, Iron Man and the head of innovation at Stark Industries. He’s a technological genius and a pioneer in the field of Artificial Intelligence. Clearly he’s not expecting her to fix his supercomputer.\n\n \n\n“Hey, Mr Stark?” Peter’s voice comes from Happy’s phone. “Can you tell this lady I need to speak to Ms Potts? Apparently she’s having a meeting with the Japanese ambassador and doesn’t have time to talk to an intern, and her PA wants to see my ID.”\n\n \n\n“Put me on speaker, kid,” Tony Stark says.\n\n \n\n“Mr Stark?” The PA asks hesitantly, “I’m afraid I can’t let anyone in to see Ms Potts without identification. It’s a safety precaution. She’s currently in a meeting with the Japanese ambassador, so if your intern comes back with ID in an hour, Ms Potts should be able to spare him five minutes.”\n\n \n\n“Peter doesn’t need ID,” Mr Stark informs her, “Let him in or you’re fired.”\n\n \n\n“I’m sorry, Mr Stark, the meeting with the ambassador is very important, she told me not to let you interrupt her.” \n\n \n\n“Peter, go past her.”\n\n \n\nMonica hears quick footsteps and the PA protesting while Peter calls apologies to her, and then a door opening.\n\n\n“What in the world is going on?” Pepper Potts sounds long-suffering. “I asked you not to let Tony interrupt.”\n\n \n\n“Oh, hi Ms Potts,” Peter says, quickly, “It’s nice to meet you! Oh, uh, Mr Stark wants to know if you want pineapple on your pizza?”\n\n \n\n“Tony told you to say that?”\n\n \n\n“Here, he’s on the phone.”\n\n \n\n“Hey, Pep. How’s the meeting going?” Tony Stark asks casually.\n\n \n\n“Is there a pineapple situation?” Pepper asks briskly. \n\n \n\n“The pineapple has been disabled but is still in the building,” Tony replies. “Friday’s down and we’re locked in my labs. The kid crawled through the vents. Oh, and there might be something going on with the fire exits, but the pineapple grower could be lying about that. He’s webbed up in my workshop.”\n\n \n\n“Are you alright?” Pepper asks, “Don’t lie to me.”\n\n \n\n“I’m fine, but someone in HR’s getting fired. The guy’s an employee. Hey, listen, keep the kid with you, ok? Make sure he doesn’t come back up here on a totally unnecessary rescue mission. Happy’s got the guy covered and the kid’s teacher is helping me get Friday back up. I’ll see you later.”\n\n \n\n“Ms Warren!” Peter exclaims, like he’s just remembered her, “Are you okay Ms Warren? Everything’s alright now. Mr Stark will look after you until I get back.”\n\n \n\nMonica feels herself choking up a little. “I’m okay, Peter.”\n\n \n\n“No, Peter,” Tony Stark says, “I need you to look after Pepper for me, okay? I need you to do that. Stay with her and make sure nothing happens to her, got it?”\n\n \n\n“Okay, Mr Stark.”\n\n \n\n“We’ve got dinner reservations for eight, make sure she makes it.”\n\n \n\nTony Stark ends the call, turning back to Monica. “Shine the light on that circuit box, would you? I need to be out of here and changed for dinner in like, an hour and a half, tops.”\n\n \n\n***\n\n \n\nTony Stark gets the power back on and the doors unlocked in less than twenty minutes. \n\n \n\nHe’s still frowning at a computer screen when Happy comes to take her home, but he says distractedly, “Do I need to sign something?”\n\n \n\n“What for?” Monica asks.\n\n \n\nHe looks up at her. “Peter’s internship.”\n\n \n\nOh. She’d nearly forgotten that was why she was here to begin with. “I think we’ll leave it for today. I’ll write up some notes on what he’s been doing.”\n\n \n\n“He’s a good kid. He needs this.”\n\n \n\n“Does he know?” She asks him.\n\n \n\n“Know what?” Tony Stark asks. He’s already turned back to the screen.\n\n \n\n“You’re not training him to work in the R&amp;D department, are you?”\n\n \n\nIron Man is a guy in a suit. It could be anyone. Nobody would know if it wasn’t Tony Stark in there. Tony Stark is in his late forties. That’s old, for a superhero. He’s saved the world again and again, for the last decade. He looks tired. But the world needs Iron Man, so there needs to be a guy in the suit. It can’t just be anyone in the suit, though. Iron Man needs nerves of steel. He needs to be fit and strong and brave. He needs to be good, and trustworthy, and selfless. He needs to be clever. And if necessary, he needs to be able to act without the suit.\n\n \n\n“Oh, he’ll be doing that too.”\n\n \n\n“You’re training him to be you.”\n\n \n\nTony Stark turns suddenly, looking her right in the eye. She has to fight not to take a step back. “I’m training him to be better than me.”\n\n \n\n“He’s fifteen! He shouldn’t be disarming bombs!”\n\n \n\n“Exactly. Imagine how badly that would have gone if Happy hadn’t been there. If he hadn’t had my tech.”\n\n \n\n“He wouldn’t have had to do it at all!”\n\n \n\nTony Stark raises his eyebrow. “Are we talking about the same person? The first I saw of Peter was a video of him stopping a bus crash by jumping in front of it in his pyjamas. He would have found a way to spend the afternoon disarming a bomb regardless.” \n\n \n\n“He did what?”\n\n \n\n“You know what? Forget I said anything.”\n\n \n\n“Did you say he deliberately jumped in front of a bus? Does his aunt know about this?”\n\n \n\n“See, what I’m really doing here is keeping the kid out of trouble. I tried stopping him, took the suit away and everything. It didn’t go so well. But if he learns how everything works and what his limits are, learns to use his powers properly, sticks close to the ground, that’s when he’ll be safest. And the more I can get him in here, doing science, the less likely he is to be off sticking himself to the sides of planes or climbing the Washington Monument or hitting pieces of alien tech with a hammer.”\n\n \n\n“I’m sorry, did you say he stuck himself to a plane? What do you mean powers? \n\n \n\n“Powers - you know, super strength, agility, crazy good senses, sudden gymnastics skills. Not the webs, though, he made those himself.”\n\n \n\n“You can’t tell anyone this,” Happy interrupts, “This is highly confidential.”\n\n \n\n“Peter’s the Spider-Man?” Monica thinks about the footage of Spider-Man desperately trying to hold a sinking ferry together, his body straining like he’s about to break apart. It’s wrong for a kid so young to be in that position.\n\n \n\n“We do our best to look after him,” Mr Stark says, “If this gets out, it will ruin his life. He’s a smart kid, he’s got a good future ahead of him.”\n\n \n\nThe \n\nif he survives\n\n hangs silently in the air as Tony Stark turns back to his screens. \n\n \n\nHappy takes her downstairs, ushering her back into the car she’d arrived in. He collects her phone and briefcase from the locker where they had been stored and hands them back to her before getting in to drive her home. She texts her brother immediately, telling him she’s coming round for the night.\n\n \n\nIn front of the building, hundreds of Stark Industries employees are gathered, along with emergency services. There’s a black, armoured vehicle and people in thick, kevlar suits. There’s an ambulance on standby and dozens of police. She spots Pepper Potts, speaking with a detective. Peter is standing beside her, vigilantly scanning the crowd. He looks calm and unharmed. Nobody looking at him would know he’d disabled a bomb less than an hour ago. He doesn’t look like he has superpowers. He looks more athletic than she remembers him being, and his shoulders are squarer than they are at school, but he’s still small. Still fifteen. A kid who should be playing in the marching band, or going to the movies with his friends.\n\n \n\nHappy shows his ID to a security guard to get through the roadblock and takes her home, waiting in the car while she collects some things, and then takes her to her brother’s. He’s not chatty, but he seems like a good guy. When he pulls up outside her brother’s apartment building, he turns to her. “Peter’s gonna be fine,” he says, “Our kid’s good under pressure. Resourceful. He did a good job today.”\n\n \n\nMonica goes upstairs and hugs her nephew tightly.\n\n \n\n***\n\n \n\nMonica’s back at school on Monday, like nothing’s happened. The official media line is that there was a bomb scare at Stark Industries. One disgruntled employee made a bomb threat and attempted to steal tech from the building. He was caught and arrested. Tony Stark was upstate at the Avengers Compound, as he always is on Fridays. No one was hurt. Nothing is mentioned about the very real bomb or the teenage boy who crawled through the vents and disarmed it. There are a few shots of Pepper, with Peter standing in the background, but he’s not identified. No mention is made of a high school physics teacher watching an asset manager talk her student through disabling a detonator.\n\n \n\n“So, who here knows how a pendulum works?” she asks the class, as Peter runs in two minutes after the bell, dropping into the seat beside Ned. “Yes, Flash?”\n\n \n\nShe looks at her class with different eyes, more appreciative of her students. An idea had struck her over the weekend, for a sort of applied physics club, teaching science skills for survival. She’ll need to take it to the Principal, sort out the details, but it should be good once she gets it going. Apparently Principal Morita had announced a new physics teacher at the meeting on Friday, so she should have time. She’ll keep up with the internship program, too. Pay closer attention from now on. Make sure no one looks too closely at Peter’s.\n\n \n\nPeter comes to her desk after class. “Hey Ms Warren. Are you alright? That was pretty scary on Friday, right?”\n\n \n\nHe’s the first person to ask her that. His eyes are big and earnest. She wants to wrap him in cotton wool and put him in a box where he won’t get hurt.\n\n \n\n“I’m alright. Are you? That must have been a very stressful situation for you.”\n\n \n\nPeter gives her a little grin. “It was kind of fun, actually. Like high-stakes robotics club.”\n\n \n\nThe concerning thing is that she believes him.  \n\n\n\n\n\nTHE END\n"
}