{
    "id": "19232359",
    "url": "https://archiveofourown.org/works/19232359?view_full_work=true",
    "author": [
        "Ark"
    ],
    "title": "bent to the very earth",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Good Omens (TV)",
        "Good Omens - Neil Gaiman & Terry Pratchett"
    ],
    "relationships": [
        "Aziraphale/Crowley (Good Omens)"
    ],
    "characters": [
        "Aziraphale (Good Omens)",
        "Crowley (Good Omens)"
    ],
    "additional_tags": [
        "First Time",
        "Smut",
        "Fluff",
        "Oral Sex",
        "Anal Sex",
        "Wall Sex",
        "Service Top Anthony J. Crowley",
        "Love Confessions"
    ],
    "language": "English",
    "series": "",
    "published": "2019-06-16",
    "completed": null,
    "words": "5,634",
    "chapters": "1/1",
    "comments": "435",
    "kudos": "12,248",
    "bookmarks": "2,374",
    "hits": "154,208",
    "summary": "<p><em>Use me, please,</em> Crowley had said, so Aziraphale takes him at his word.</p>",
    "notes": "<p>a lunch at the ritz to reserve, demonically good beta reader and cheerleader. </p>\n<p>—</p>\n<p>O baffled, balk'd, bent to the very earth,<br>Oppress'd with myself that I have dared to open my mouth<br>—Whitman</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>join me on <a href=\"https://twitter.com/et_ark\" rel=\"nofollow\">twitter</a> and on tumblr: <a href=\"https://et-in-arkadia.tumblr.com\" rel=\"nofollow\">http://et-in-arkadia.tumblr.com</a>, where the class will be studying michael sheen’s cheekbones this week.</p>",
    "text": "The timing’s right, if a bit abrupt.\nIt isn’t so strange for them, when you think about it that way. Shouldn’t be strange any way you think about it, really—there’s nothing more natural and instinctual for humans, She’d seen to that, and their bodies feel human enough. \nAziraphale watched the way Adam and Eve reached for each other, easy as anything. How there’d been no shame, no judgment, no embarrassed blush across their cheeks, there at the beginning of the world where it was just the two of them. Nothing else but the other.\nStill—somewhat surprising. And not. Somewhat unexpected, and not, how it happens:\nA night of drinking and discoursing and drinking like any other, and when several bottles are drained they go together to search for more in order to increase their chances of success. \nCrowley has the run of the cluttered kitchen in the flat above Aziraphale’s shop. He knows its cupboards just as well—fair half of the ingredients have been contributed by him over the years, spices fetched back from far-flung locales—so Aziraphale hardly minds as he opens and closes cabinets and yanks out drawers. There’s something reassuring about seeing Crowley so at home.\nAziraphale is annoyed with himself, when his thoughts are clear enough to focus on annoyance, that he forgot to do the shopping that day to restock. That’s until Crowley, after a not inconsiderable amount of time banging about, comes up with a dusty bottle of cooking wine wedged forgotten in the kitchen closet behind a vegetable spiralizer. \nCrowley emerges triumphant and smiling, brushing a cobweb from his hair, and Aziraphale watches as he gently transfers the small spider that’s fallen to his shoulder back to its silken thread, which he restores with a glance. \nWarmth rises in Aziraphale’s chest like a kettle set to boil. His cheeks feel warm, too, already flush with too much alcohol, and that’s probably why he goes over to Crowley and takes the bottle from his hands. Their fingers touch against glass in the transfer. Aziraphale barely glances at the undrinkable liquid. \nWhat he does is tsk, “Oh, my dear, this will never do,” and the miracle flows through his fingers and in an instant it’s something else.\n“Angel,” Crowley breathes then, sounding surprised first, then touched, then something like—something like reverent. As close to reverent as a demon can sidle.\nAziraphale looks down and realizes what he’s done. The bottle is now a vintage of red from a little town in northeast France they traveled through in 1912. During the terrible war that followed the town and all the fields around it had burned and burned and this vineyard never replanted. It was a wine that in passing, over dinner more than a hundred years ago, Crowley praised as the best he ever had. \nCrowley takes back the wine and sets it on the countertop with a careful click. One moment Aziraphale is observing him do that, and the next moment Aziraphale’s back collides with the closet door. Crowley has spun him around and pushed him against it quite firmly. \nThen Crowley is kissing him, hot and urgent and with an awful lot of clever tongue-work, and Aziraphale is surprised and isn’t. \nAziraphale kisses him back because that is what makes sense, kissing Crowley, why, the thought crosses his mind often enough—he just never had the sort of momentum that seems to fire up Crowley now. Crowley whose hands are shaking before they ball up as fists on Aziraphale’s lapels, Crowley who keeps kissing him and kissing him like otherwise he’ll drown.\nThey’ve long been building to this, Aziraphale knows, which is why he was never in any hurry. He supposes they have now arrived. The timing, in the post-apocalypse-that-wasn’t, is as good as any other. Perhaps it isn’t a bit abrupt at all.\nOnly when Crowley is drawing Aziraphale's lower lip between his sharp teeth does some sense intrude through the haze of intoxication and adrenaline. “Wait,” Aziraphale exclaims, his head thudding against the door as he pulls away. Crowley lets go of him at once and casts his gaze down at the floor, clearly gathering himself up for guilt and all manner of self-castigation. Aziraphale shakes his head. “We’re too drunk.”\n“Right,” says Crowley. \nAziraphale has never seen him look so unsure. Considering that Aziraphale has seen quite the variety of looks from him over more than two hundred thousand days, it’s a remarkable feat.\nAziraphale is extremely good at taking pity. He is also extremely good at trying new things. He is even better at savoring those that are sampled and found to be scrumptious. He decides to pursue all three of these actions at which he is accomplished. He fixes Crowley with a stare to keep him in place. His head is swimming, and it’s hard to know how to start. “I didn’t say—what I meant was—oh, bother.” With a concentrated burst of thought he disinebriates them both.\nCrowley blinks those inscrutable eyes. Newly sober, he rocks back on his feet but otherwise doesn’t move save to scratch his head, and—if Aziraphale weren’t watching, he’d not have believed it—to blush quite furiously. \n“I’m,” he starts, and now Aziraphale can taste his apology in the air. “Aziraphale—”\n“No, I am,” says Aziraphale, soft, and when he smiles Crowley falters. Crowley stands so quiet and still that Aziraphale aches with his friend’s uncertainty and the idea that he could be the cause of it. “You didn’t do anything wrong.”\n“Didn’t I,” says Crowley.\n“Is it wrong?” asks Aziraphale. “Are we wrong?” \nCrowley stares at him, struck speechless for once, then shakes his head at a nigh-on frantic speed. That can’t be good for his poor neck. \nAziraphale says, “Do you have bad intentions, my dear?”\nCrowley colors anew. “Wouldn’t say. Bad. Might say, impure.”\n“I’m an angel,” Aziraphale points out. “Nothing I do can be impure.”\n“Well,” says Crowley. He brightens a touch, spine unbending from its defensive slouch. “When you put it like that.”\nAziraphale considers him. Crowley is fair vibrating with pent-up energy and emotion, held back by fraying strings but held. If Aziraphale laughs it off and suggests they return to the den with their bottle of miraculous Azy-sur-Marne red, Crowley will laugh also, and readily agree. That’s why Aziraphale doesn’t laugh. Instead, Aziraphale says, almost stern, “Say you’ll remain my friend.”\nCrowley’s nature has more duality than he likes to put on, which is how he manages to look deeply offended and deeply adoring at the same time. He swallows hard. “Angel,” he says, “that’s the only thing I know how to be with any degree of success.” \n“Then don’t be an idiot,” says Aziraphale. He feels fond to an extent that threatens to overwhelm. “We’ve done everything else there is to do together, haven’t we?” \n“We have at that,” Crowley allows. It seems he doesn’t know what to do with his hands, what he’s allowed to let them do, where they’re wanted, so he jams them into his trouser pockets. “Just—just tell me. If you’ve ever—has the thought ever—would you have considered—”\n“Come here,” says Aziraphale, surprised to find he’s grown impatient. He reels Crowley back to him by his collar. “And kindly stop questioning.”\nCrowley does. Crowley takes the command to be quiet in a way he’s never followed any orders issued by powers that are higher than Aziraphale. He shuts his mouth, and the next time he opens it is against Aziraphale’s mouth, and he’s licking in like he means to memorize the shape of Aziraphale’s teeth. \nOh, that’s very good. That’s very good indeed. Crowley keeps crowding him toward the wall even though there’s nowhere else to go, as though he can’t get in close enough. Given permission, there’s no hesitation in his fine-boned fingers as he touches Aziraphale. He touches Aziraphale everywhere that’s polite: runs hands through his hair, pets the back of his neck, arcs over the curve of his shoulders, tickles the back of his elbows, smoothes down his forearms, circles fingers around his wrists like bracelets. \nWhen Crowley reaches for Aziraphale’s hand and takes it, while his lips prove warm on Aziraphale’s jaw, then at his ear, Crowley does nothing but hold on. \nIt’s Aziraphale, some moments into this hand-holding, who slides Crowley’s hand down, down, down, to press and then cup the hard growing length of Aziraphale’s cock.\nCrowley turns the sound he makes into a bite sunk not unkindly into Aziraphale’s neck. Then he raises his head and meets Aziraphale’s eyes as he strokes him through linen. \n“This all right?” Crowley asks. His voice is cracked, warped, like he’s speaking with great effort from a distance, like he’s calling for help from the bottom of a well.\nAziraphale smiles, for he’s found that it’s a good deal more than all right. “Yes.”\n“Can I—can I lose—can I get rid of—” Crowley gestures expansively between them with the hand not dedicated in service to Aziraphale’s cock. \nIt’s a leap they’re taking, but how else would they go along? They’ve covered the preliminary activities that humans call courting for thousands of years. Should Crowley take him to dinner first? Perhaps a movie? They attended the first play in human history together, sat side by side on the stone with the Acropolis looming overhead. They’ve dined on every continent, strolled beside every river—arm in arm, during eras when that was fashionable for friends—picnicked under the stars and upon stars far from here. What more need possibly be done?\n“Yes,” says Aziraphale. “So long as you swear to bring it all back eventually. I’ve had this tie since—”\n“Victoria’s jubilee,” Crowley says, although he slept through it. “I know.” \nThe bowtie he undoes like any man might, deft fingers loosening the knot. He unravels it with an expression on his face that suggests he’s wanted to get his hands on Aziraphale’s tie for longer than Aziraphale imagined. Then a blink of those impossible eyes and his expression fades into something more properly lascivious, and then there’s no tie or any fabric to separate them whatsoever.\nAziraphale is fascinated. Once he starts he can’t stop looking, his gaze raking Crowley from crown to toe. He’s always thought his amicable demon lovely—admired Crowley’s sharp edges and lanky lengths, so well-contrasted to Aziraphale’s own softness and compact build. Everything about Crowley seemed to sprawl, to take up as much space as possible and prove the pronounced narrowness of him a lie. \nAnd whenever Aziraphale was able to look at anything beyond his eyes—when Crowley showed him his eyes, there was little use in looking anywhere else—he had, of course, noted that nose with its darling hook, the expressive forehead, the surprisingly lush lips. \nNow he knows just how lush, and there’s much, much more of Crowley to take in beyond the eyes.\nHis limbs are well-turned, steely muscle underneath smooth skin, his whipcord strength coiled inward, but waiting to be sprung; his cock, fully hard, is a match for the rest of him, long and proud, strained toward Aziraphale; just past his hips, the pert swell of his ass, such a temptation on its own Aziraphale nearly asks him to turn in a circle and show it off, which he thinks Crowley would be only too happy to oblige; and his hips, oh, his hips, rough-hewn from marble, exceptional handles for Aziraphale to hold.\nHe holds. Gooseflesh breaks out on Crowley’s skin when Aziraphale is the first to reach. Crowley, unblinking, held, gazes at Aziraphale in turn—lips slightly parted, hands clenched at his sides as though still uncertain of how he’s allowed to touch, and how much. \nAziraphale has never dwelled overmuch on his own physical beauty, but seeing himself reflected in Crowley’s eyes tips him toward the sin of vanity. Because the look on Crowley’s face is stunned. Awed. Inconsolable, for half a breath, before that’s pushed away and Crowley says, “You’re perfect.”\n“Don’t tease,” says Aziraphale without heat. In any other venture he’d suspect Crowley of having mocking fun, yet there’s nothing but truth in his voice as he repeats, stubborn, “You’re perfect.”\n“Perfection is a state none of us are meant to achieve, nor should we try,” Aziraphale says around what he hopes is a rather fetching blush. This body given to him has served him faithfully, and he likes it well, all rolling hills where Crowley has crevices, the white-blond down of his hair creeping across his chest and the same pale gold at the base of his cock. His cock has been praised before, he’s been told its shape is impressive—it appears in a more relaxed state on quite some statues whose sculptors Aziraphale saw fit to indulge across the ages.\nHalf-hard from their kisses and Crowley’s linen-covered caress, it is here his friend’s eyes keep catching.\n“Aziraphale,” says Crowley. He looks ready to shake out of his skin as Aziraphale’s thumbs stroke the deep-cut lines that make their vee along his hips, or perhaps ready to shed his skin and become something new. “Nearly almost utterly perfect angel. Can I.”\nAziraphale grins at this address, at the query. That might mean any number of things, but as he watches the dart-quick way Crowley’s tongue steals out to wet his lips, to taste the air, irrepressibly snake-like, he has a guess. \n“Yes,” he says, since Crowley seems to keep needing to hear the word repeated from him. “As you like.”\nWhat Crowley likes is to fold to his knees. It’s done without even a hint of grace—it’s a collapse, a supplication. It occurs to Aziraphale that he’s never seen Crowley kneel for anything, neither Heaven nor Hell, but now he kneels in the in-between, in the space that is only theirs. \nHe keeps his head bent. He stays like that until Aziraphale reaches to touch his hair like a benediction. Then his yellow eyes come up blazing and ready.\nIt’s not surprising that Crowley, with his uncanny tongue, would be given over to using it. What is surprising is the way it feels: like he trails liquid electricity along Aziraphale’s skin, brings Aziraphale’s cock to full attention at the first kindling spark of it. By the time he’s slow-licked his way from root to tip, Aziraphale is breathing faster than he’d like to let on, his head dropped back against the door with a thunk that makes Crowley flicker a smile into his skin as he moves.\n“That’s, oh,” Aziraphale starts, stops, when after a full revolution of the Earth around the sun Crowley finally takes him into his mouth. “That’s.”\nWhat it is cannot be spoken yet, for there has never been anything like this.\nThat Crowley is highly skilled herein and anxious to demonstrate that fact might also be expected. He’s always enjoyed the heat of the spotlight, always loves it when a situation allows for his braggadocio to be confirmed. \nHe’s never precisely said to Aziraphale, I am an artful master in the pursuit of cocksucking, true, never out loud anyway. But once or twice or twelve thousand times with how he shaped syllables and rolled his tongue when they were so drunk Aziraphale wasn’t meant to remember it—now, that’s another story.\nSo Aziraphale stands—or rather leans loose-limbed against the kitchen closet’s door—unamazed by this newish knowledge. Then the thought crosses his mind that Crowley became excellently versed in cocksucking simply so that one day he might be able to swallow Aziraphale down with such ease and style. This idea astonishes even as Crowley’s hollowed cheeks make thinking a more difficult task to follow through.\nAziraphale, for his part, has had his cock sucked before, of course. He’ll try anything once, then gladly thrice, should it prove satisfying. \nHe’d grown curious over the millennia, dabbled here and there, peered into what each new century dreamed up. Humans are endlessly fascinating, endlessly inventive. He was careful not to grow attached to any passing partner, knew he could not keep them, nor they hold onto him, not when their delicate mortal lives slipped by so quickly. \nBut Crowley—well, Aziraphale is aware that when it comes to Crowley he’s grown rather attached. How could he not, with Crowley his only constant, Crowley there to smirk and leer and joke and squabble and plot and laugh and drink and talk and stroll with him arm-in-arm across the ages. \nCrowley on his knees with Aziraphale’s cock down his throat and a look in those serpentine eyes as though he’s quite prepared to remain like this and never find his feet again. \nAziraphale strokes his hair in encouragement, and oh, Crowley seems to like that very much, so Aziraphale, experimental, makes his hand a fist in those fire-tinged locks and lightly tugs. Crowley gives a choking sound that travels through Aziraphale’s cock and climbs the stairs all the way up to his brain, where it beats upon the gate. \nFor a moment they stare at each other. Then slowly, deliberately, Aziraphale pulls harder.\nCrowley moves back with a jerk of his head, his mouth coming free with the most obscene sound Aziraphale has heard since the Hellfire Club, and Aziraphale blinks, wonders if he misread. He does not often do so.\nHas not, in fact, for Crowley’s tongue wets his lips and he gazes up at Aziraphale and says quite clearly: “Use me.”\n“If you’re quite sure,” says Aziraphale, unwilling to pretend they don’t know what Crowley is asking for. His own continued interest can be observed by the unwavering length of his cock, which Crowley tilts up to tongue as though the momentary lack of contact between mouth and Aziraphale has proved unbearable.\n“Please,” says Crowley. “Please.”\nAziraphale nods. Easy enough to take Crowley by that pointed, stubborn chin, to tighten his hand until Crowley’s lips part in a delectable ‘O,’ and then Aziraphale is thrusting in at his own discretion. He runs his hand up, makes it a new fist in Crowley’s hair, a fist strict enough to keep him in place. He watches Crowley’s eyelashes flutter against his cheek as his cheek distends with Aziraphale’s cock. As Crowley calls on however many thousands of years of training to take him down without protest and with every indication of fierce, wanting welcome.\nUse me, please, Crowley had said, so Aziraphale takes him at his word. He thrusts into the wet heat of Crowley’s mouth, finding it more remarkable with every slide out, then in, the pleasure building in his belly but not restricted there—it courses through his blood and soaks into his bones. \nHis hand tightens in Crowley’s hair, unrelenting, and sometimes he pushes Crowley’s head down—not hard enough to truly hurt, but insistent, in command. Whenever he does that it elicits desperate suction and a frantic tongue on the underside of Aziraphale’s cock, silent encouragement beyond Crowley’s low, muffled moans. \nThe truth is that Aziraphale likes this a great deal. It works because it’s Crowley. He starts to think about how wonderful it is to finally have the means to make Crowley be quiet and concentrated for a length of time, to be able to control Crowley’s speed. \nHe thinks, then, of every time Crowley has let his leaden foot fall on the gas, just to annoy Aziraphale with a burst of velocity, every time Crowley has taunted him for some anachronism of dress or turn of phrase, every single second that he walked next to Aziraphale with an exaggerated flaunt of his hips. \nAziraphale lets six thousand years of frustration and slights guide his motion, the pain of them riding alongside the pleasure. Whenever he thinks he may be going too far, too hard, too fast, Crowley gazes up from his knees with an expression on his face that is the closest Aziraphale will ever see there to worship. \nHe comes thinking that, feeling it leave him like a burst of light, and it leaves him that much lighter. The sensation of unburdening is incredible, and the bliss of his release is heightened as Crowley’s eyes go wide and he drinks Aziraphale down so eagerly, so eager. \nWhen Aziraphale is finished and Crowley has swallowed his fill, he draws out, and Crowley presses his forehead to Aziraphale’s bare thigh. He breathes fast, face wet with grateful tears born of their exertion. Aziraphale strokes his hair again, gently this time, and asks, “Is that what you meant, my dear?”\nIt takes Crowley some time to speak, and when he does his voice rasps. “Thank you. Yes. Spot-on.” He looks up, the attempt to pull a cockier expression betrayed by the open, broken relief writ there. Even so, he tries to lighten the mood—to deflect from how his hands are shaking. “Always thought you’d have it in you.”\n“Did you now,” drawls Aziraphale, and Crowley must still be recovering because it takes him precisely 1.7 milliseconds longer for the suggestion of his own words and Aziraphale’s reply to register than it should. \n“Erm,” articulates Crowley. He’s still on his knees.\n“Do return at once,” Aziraphale says, and when he offers his hand Crowley takes it. Standing face to face, as though for a dance—Aziraphale supposes it is, of a kind—Crowley sways over him, tall again, and Aziraphale winds his arms around his neck. “There we are.”\nCrowley is hard against Aziraphale’s hip, hard to what must be far past the point of aching. Even so he keeps stock-still, except the thumb that he brings to trace the dash of Aziraphale’s cheekbone. “Shame we’re no longer filing reports with the home offices,” he says, trying once more for levity. “I’d like to read this one.”\nAziraphale purses his lips to hide his smile. Considers. He casts his eyes upward on cue, as though caught mid-filing. “Finally found a use for that foul, mouthy fiend, Crowley,” he dictates. “He sucks cock with aplomb, but I’ve yet to put him through his paces. If he fucks like he walks he shan’t last long. Advantage: Heaven.”\n“Aziraphale!” Crowley’s exclamation is halfway between shocked horror and chaotic glee. “You can’t—angel, you can’t go saying things like—how could you even—?”\n“You really must let me recommend a book or two,” Aziraphale says soothingly. Against him Crowley is trembling with sudden agitation. Perhaps he went too far.\nBut then Crowley meets his eye, dead-on, unwavering. “Well, do you intend to or not?”\n“What’s that, dear boy?”\n“Put me through my paces,” says Crowley. “See how long I last.”\nA delicious shiver of excitement tries to wend its way along Aziraphale’s spine. “I think that might please me very much,” he answers, after a caught-breath moment spent studying Crowley’s features, his eyes, his hips, his hands, his cock, and all around and back again. “Of course, you’ve done a fine job already.” \n“Not nearly fine enough,” says Crowley, almost at a growl, and Aziraphale finds himself backed against the closed door again. “Don’t you understand. I won’t ever have enough of you.”\n“That’s—oh—terribly sweet,” Aziraphale says, his “oh” arising when Crowley bends to lick and suck at the line of his neck. He grins with his eyes closed, imagining Crowley’s torment. “Yes, that’s awfully lovely of you to say. Positively tender-hearted.”\n“Not sweet,” Crowley hisses, lets himself be provoked. He nips at Aziraphale’s skin, insists, “Not lovely.” But as he slips a clever, hungry hand around to Aziraphale’s ass, which he squeezes, the game is up. If there is no beauty in his able fingers there is at least grace, as they are found to be miraculously slick and anointed with oil. “Not tender-hearted,” Crowley tries once more, his voice dropped lower than a hiss, even as his actions belie his words. He opens Aziraphale so carefully on his fingers that it is clear he is afraid that one or the other or both of them might break.\n“My darling,” exhales Aziraphale, when Crowley has two tapered fingers sunk inside of him. Aziraphale is, at this point, leaning into the door at a right angle, as though reclining against a pyramid. His legs are spread, giving Crowley room to work, but it’s not sustainable, and then he ponders—the inclination, surely, has long been there—\nIt is one of the precious times where they are aligned so well few words are needed, so ardent is their sympathy. Crowley seems to understand at once when Aziraphale lets an eyebrow climb in a question. His answering nod is fast enough, lightning-quick, his eyes of washed amber narrowing as he calculates.\nOf all the things they’ve affected together, the temptations and damnations and distractions and divine interventions, this is but a little miracle. \nStill it feels quite wondrous to Aziraphale as for the first time in his storied existence, he is lifted from the ground without the help of wings. Crowley picks him up easily, still pressed firm against the wall, one arm under Aziraphale’s ass and the other locked about his waist. He raises him high enough for Aziraphale to welcome Crowley between his thighs, for Aziraphale to hook his ankles snug behind Crowley’s back. \n“Oh, well done, really,” says Aziraphale, impressed, and a touch breathless even if he suggested the move with his eyes. He’s never been able to hover like this in human-shaped form, and he likes it as much as he likes Crowley’s dazed, hopeful smile, which he leans in to sample. Scrumptious. “Not too much, I hope?”\n“Light as a feather,” says Crowley. The curl of his smile shades more wicked as he resumes his interrupted attentions. Now he slides three fingers into Aziraphale, as expert in this as he’d proved to be with his mouth. (Practiced for the same reason? For now? wonders Aziraphale.) \nAziraphale hums approval and Crowley kisses the pulse that jumps at his neck. Sealed against the door, Aziraphale with his eyes open thinks about how never once did they consider moving from the kitchen to somewhere more comfortable. Somehow it’s right that they are here, that they are shoved together like this, the closet door creaking behind them. \nIt feels irresistibly, indulgently human at the same time they are aided by the arcane—this is who they are. And it appears that Crowley might be content to stand until sunrise, learning all the little sounds he can pry free from Aziraphale with his fingers’ tricks, but Aziraphale, electric with sensation, is losing patience. \n“It seems you desire for instruction,” Aziraphale says, suggestive as a whispered secret. He’s right: that’s the ticket, because Crowley bites down on his own lip until it turns white, and his body bearing them both up shudders with reaction.\n“Yes,” says Crowley. His ‘s’ is drawn out between his teeth, as he slips for a breath into an old-fashioned manner of speech that reveals how close he is to the edge. “Absolutely yes, let’s do that.” He gives Aziraphale back the word he’d so desired to hear when they began. “Tell me what you want, angel, and it’s yours.”\nAziraphale’s hands are unoccupied at the moment, so he lets them come to frame Crowley’s face. “Dear me, I thought it was already mine,” he says, and the expression on Crowley’s framed face shows him how a man can look happily ruined. “But what I want with what is mine is for you to fuck me—thoroughly enough to make up for all of the times you threw me against a wall and didn’t.”\nCrowley, now appearing quite destroyed, kisses Aziraphale helplessly as he lines himself up. He doesn’t need to be told twice—he thrusts in with a swivel of those hips that makes Aziraphale’s breath catch. But once inside him, for the first time in the uncountable stretch of days they’ve known each other, Crowley goes slow.\nIt isn’t—it’s not what Aziraphale expected, when he let his imagination drift and hold here. It’s not like anything or anyone he’s felt, because this is Crowley, and Crowley—\n—Crowley has adored him from the start, Aziraphale knows then. Crowley—\n—Crowley loves him, as no one has loved another before and will not again: for the entirety of existence, throughout the span of every age, loved even through a century of sleep, loved Aziraphale in his dreams. \nLoved him first and last, loved him enough to slip free the bonds of Hell and to no longer feel the loss of Heaven. Loved him enough to challenge the order of things, to challenge and change what order was, if it meant that Aziraphale would be restored to him. If it meant that he would one day be able to sit sprawled on a park bench beside Aziraphale, beside Aziraphale once more, on no other side but their own.\nThis and more Crowley tells him without words as he thrusts deep. Aziraphale, who can sense love, is so filled with it as to be incandescent. He’ll become a star and go supernova if Crowley keeps loving him like this. And Crowley won’t ever stop. He won’t ever, ever stop.\n“Don’t stop,” Aziraphale gasps aloud, as though they were any two humans caught up in the act of making love, but Crowley knows, Crowley watches the realization flood him. Still does Crowley respond as any human might, taking the admonition to heart, pulling back and thrusting in again, again, pinning Aziraphale to the wall, again, again, again. \nAziraphale cries out as Crowley lights him up from the inside, every drive delivered with only the purpose of pleasing him, of loving him, and Crowley touches their foreheads together as if that point of contact is all he needs. The restraint, the caution, are appreciated as thoughtful gestures, but really, enough of this:\n“Don’t be silly,” pants Aziraphale, vocalizing their silent conversation, “take me, you sorry, spectacular excuse for a demon, you have me now, make me yours as you are mine—you can’t hurt me, Crowley, you couldn’t if you tried, and you wouldn’t try, you wouldn’t—oh, ah, yes, dearheart, that’s better—yes, harder—ah—you can go faster, I’m with you, I’m here, I love you, I—”\nThe report to the home office right then would read—the demon Crowley displays remarkable endurance under strain, demonstrates an enviable resilience. More data is needed, much more, Aziraphale must keep testing him until the universe spins out before he’ll be ready to write up his conclusions.\nHe comes again with Crowley molding him into the wall, describing now in detail every single instance he’d wished to have Aziraphale like this. Crowley’s gone unfettered as requested, fucking him irresistibly far and fast. Aziraphale comes spreading heat between them, saying in response to this event only, “I do love you, I do,” over and over, since Crowley has begged to hear it again, again, again, again, again. \nAziraphale feels Crowley hurry to follow him, Crowley’s gasp, the pulse and spill of his cock that’s held so tightly inside Aziraphale he may have to stay there. Perhaps they’ll remain just like this until the end of days—which they’ll prevent once more—so that they might return to this state, joined at body and mind and mouth, pressed heart to heart.\nEventually they unwind themselves and Crowley lowers him back to Earth. He doesn’t let Aziraphale go far, chasing after kisses, tugging him back by the wrist for more. He wears an expression so brilliant he could ignite all of London, and so stunned that Aziraphale won’t stop smiling against his lips to see it. \n“I love you,” says Crowley then. “Aziraphale. I love you.” He declared it so in every motion that he took, every breath, but now he gives the words life. \n“Quite,” agrees Aziraphale in the understatement of sixty centuries, and kisses him. He’s curious what his own face must look like, if the exhilaration and the depth of discovered joy shine through. Then he decides it doesn’t matter. Crowley can sense his love now, just as he is newly aware of the dazzling heights of Crowley’s. He’s positive of it. He takes Crowley’s hand.\nHow odd to know someone better than your favorite novel, to know that one day they were bound to find their way here, and yet not understand how much they loved without revelation. Love is the only secret worth keeping and it is difficult to give away, so it must be done by degrees. Kisses are a prelude, and bodies help, and confessions sing it into being. \nShe had given them this, Aziraphale realizes then, given her creations this greatest of gifts, to be like her in this alone. For love could be wrought out of nothing and then be called the most powerful thing in the world. Crowley knows now that Aziraphale loves him in return like a storm, more boundlessly than the seas, clear-eyed as all the knowledge contained in the books in the shop beneath them and in every book. \n“You’re brooding, angel,” says Crowley. He brushes Aziraphale’s cheek with the back of his hand.\nAziraphale doesn’t disagree, precisely. “More like musing.”\n“Anything I can do about semantics?”\nAziraphale kisses him again. He is sure Crowley knows, but if he forgets, he’ll be here to tell him how they love. He’ll never be anywhere but here. He’s always been here. It was only a matter of timing.\nIn the end it isn’t strange for them at all. There began two in the garden, and two remain.\n“I’ll pour us some of that wine,” says Aziraphale, as if they’ve only just wandered into the kitchen, save that now Crowley’s fingers are bound up with his. “Be a dear and bring back my tie, won’t you?”"
}