{
    "id": "19253575",
    "url": "https://archiveofourown.org/works/19253575?view_full_work=true",
    "author": [
        "Kedreeva"
    ],
    "title": "If We've Got Nothing (We've Got Us)",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Good Omens (TV)"
    ],
    "relationships": [
        "Aziraphale/Crowley (Good Omens)",
        "Aziraphale & Crowley (Good Omens)"
    ],
    "characters": [
        "Aziraphale (Good Omens)",
        "Crowley (Good Omens)",
        "God (Good Omens)",
        "Gabriel (Good Omens)",
        "Michael (Good Omens)",
        "Beelzebub (Good Omens)",
        "Adam Young (Good Omens)"
    ],
    "additional_tags": [
        "Fluff",
        "Fluff and Angst",
        "at least a little angst anyway",
        "Happy Ending",
        "Wingfic",
        "Wings",
        "Asexual Character",
        "Asexuality",
        "Asexual Relationship",
        "POV God (Good Omens)",
        "through time",
        "Found Family",
        "Post-Canon",
        "Asexual Crowley (Good Omens)",
        "Asexual Aziraphale (Good Omens)",
        "Canon Continuation",
        "Post-Apocalypse"
    ],
    "language": "English",
    "series": "",
    "published": "2019-06-17",
    "completed": "2020-03-02",
    "words": "19,897",
    "chapters": "4/4",
    "comments": "1,674",
    "kudos": "15,129",
    "bookmarks": "3,851",
    "hits": "150,718",
    "summary": "<p>Two months after the failed apocalypse Aziraphale finds the first dark feather growing in his wings.</p>\n<p>A story about middle grounds, ineffable plans, and what happens when the world doesn't end.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p><a href=\"https://greenbergsays.tumblr.com\" rel=\"nofollow\">Greenberg</a> theorized once that where Crowley is the serpent of Eden, Aziraphale could have been the dove that brought the olive branch to Noah. The \"dove\" line is a nod to her. Opening lyrics are from \"Something I Need\" by One Republic.</p>",
    "text": "\n \n\n \n\nLast night I think I drank too much \n\n\n Call it our temporary crutch \n\n\n With broken words I tried to say \n\n\n Honey don’t you be afraid \n\n\n If we got nothing, we got us \n\n \n \n\n             She is alone. \n\n\n            Where there is nothing, she creates, and first of all is love. She fills every part of the infinite ether with it, and uses it to form the first living thing: Lucifer. As soon as he comes into being, he loves her, because love is the only other thing which exists. She gives him eyes that he may see her and wings that he may follow her, and he does. \n\n\n            She creates, because that is what she is made to do, and Lucifer loves her because that is what he is made to do. \n\n\n            In the ether she forges loyalty and trust and wonder. Kindness, compassion, and patience follow, with mercy and diligence not far behind. \n\n\n            Lucifer watches as she crafts another like him and invents language so that she may name them: Angel. This one she calls Michael. She invents family for them, and calls them Brothers, and they are so. To each of them she gives a piece of herself, so that they may create by her side. \n\n\n            With their love, she begins to forge the universe. \n\n \n \n            Aziraphale finds the first on a Tuesday, well over two months since he'd stood his ground before the head officers of both Heaven and Hell and refused to allow them to instigate the apocalypse. Over two months since Adam had gone back to his family and Aziraphale had gone back to his bookshop. Over two months since he had stepped into a bath full of holy water and sent the legions of Hell running with tucked tails over his simple request for a rubber duck.\n           Over two months since Crowley had walked into hellfire in his stead and come back unscathed, ready to take on whatever came next.\n           Whatever Aziraphale had  expected to come next, it was not... this.\n           A single, dark covert feather, nestled in the crook of his wing.\n           It is out of place among all of his pristine, white feathers, a dark mark on an otherwise pure canvas. He thinks perhaps it is a trick of the light, and finds himself stretching his wing open under the sunlight, where the feather looks no different, except perhaps it shines a little brighter.\n           He swallows down the apprehension clawing its way up from his belly, and plucks it out.\n           This won't, he knows, solve the problem, but for now, it will have to do. He's got a shop full of books downstairs to tend to, a lunch date with Crowley in a few hours, and a meeting to make with a scholar from halfway across the country, to determine if the parchment fragment the man had discovered is genuine.\n           He does not have time to worry about whether or not he is Falling, or to wonder what that will mean for his future.\n           Which does not stop him from doing so, even a little.\n \n  \n\n            She shows them how to Build. Delicately, she scoops up ether and moulds it gently into burning spheres to light the darkness. The first she crafts of sulfur so that it burns soft and blue, its molten core bleeding the way the first heart will. \n\n\n            She takes the glowing core of it to bend into a circlet, which she places over Lucifer until it becomes a part of him, like a brand. Though it cools, it still casts off a halo of red light around him, as though the star’s heart lives on. Its color burns into his core, marking him in crimson. \n\n\n            What is left of it after the star has lost its heart, she takes to make a second halo, this one for Michael. There is nothing solid about the shimmering blue crown. It casts light into all of Michael’s eyes and turns them blue. \n\n\n            When she has finished, there is nothing left of the very first star, but there is light yet in the universe. They help her to create more, each star with a heart and a halo, each with flares of light that reach into the dark and send bits of themselves out seeking contact. She gives Lucifer hands and cups them in her own to create the first planet. It is small and solid and spins on a wobbly axis. \n\n\n            Lucifer tethers it to the first star they had created together, and watches it spin and spin and orbit around the brightly-glowing object. “As if it loves the star,” Lucifer tells her. \n\n\n            The ache she feels for him then she knows will never leave her again. “It cannot be love without choice,” she tells him softly. \n\n\n            “Choice?” he asks. \n\n\n            She hasn’t invented free will yet. He loves her the way the planet orbits the star- because they are made to do so. \n\n\n            “You’ll see,” she says, already knowing what it will do to him to learn. \n\n \n \n           Aziraphale cleans the second sheath from a dark pinfeather three days later. It is another covert, this one on his left wing instead. He leaves it there for an entire hour before pulling it, as well. On some level he is aware that plucking them will not stop him from Falling; it won't even delay the inevitable. What it will do, is prevent him having to stare at the evidence all day, and perhaps more importantly, it will prevent Crowley from worrying.\n           One might argue the latter is also the lesser of the two reasons, but in Aziraphale's experience, when Crowley begins to worry, he begins to panic, and when he panics, he begins to just do things, like a dog that knows it is supposed to follow a command it does not understand. He misplaces the antichrist and makes plans to run away to other star systems and drives through hellfire in an antique car with only sheer will to keep death at bay. As they had just managed to save the world, Aziraphale certainly is not about to endanger it again by becoming the cause of Crowley's next bout of anxiety.\n           He hides the second feather with the first, and tries not to think too much about it.\n           After the second, the feathers just keep coming.\n           There are three more, and then seven, and then ten, within a week. One pristine, shimmering white secondary drops out, to be replaced by a blood feather that doesn't lighten as it grows to a pinfeather. He manages to avoid Crowley for two entire days, until it will no longer bleed when he plucks it. The missing space is obvious, and he finds himself hiding his wings as best as he can when they next see one another for breakfast.\n           It doesn't really help. Crowley is nothing if not observant, and more than a little justifiably paranoid, given their circumstances. \"What's going on there?\" he asks, as soon as Aziraphale takes a seat at the table.\n           \"Where?\" Aziraphale asks innocently, looking around.\n           \"Right there,\" Crowley says, pointing elaborately at the wings Aziraphale is trying to keep tucked tightly to his body. \"To your wing, right there. You're missing feathers. Get into a scuffle, have you?\"\n           \"Nothing like that,\" Aziraphale assures him, and it is even a little true. It is nothing at all like having gotten into a battle. It's much more like finding out he had chosen the wrong side of the battle, even though he had believed it was the right thing to do. Even though he still  believes he had done the right thing. Even though this might be the consequence. \"Just a bit of a moult, I expect.\"\n           Crowley eyes him suspiciously, as if he doesn't at all believe that lie, but he doesn't challenge the excuse. He turns back to his drink, and Aziraphale can hardly stand the silence. He wants so badly to ask for Crowley's attention, all the while knowing that it is a blessing he does not currently have it.\n           Or perhaps, he thinks glumly, it is a curse. Hard to tell these days.\n \n \n\n            She watches as Lucifer collects dust from the stars and pulls power from the ether and forms a creature not unlike himself. Lucifer names him Raphael, but she knows his true name, the one he will choose for himself when he is ready. \n\n\n            To this one she gives a heart. He will need it, to survive. It will break, over and over and over. She will break it herself, first. He will wish he didn't have it, and yet he will never let anyone take it away from him. He will give it away, in the end, and finally it will be safe. \n\n\n            To apologize for his heart, she invents imagination. She owes him that much after what she has done to him. \n\n\n            \"You're going to make me very proud, Crowley,\" she tells him. \n\n\n            She turns his wings the color of ether, so that he will remember where he's come from, even while knowing he must forget. She already regrets what must befall him in his journey. \n\n\n            He adores her, heart and soul. \n\n\n            He is the only angel who can truthfully say that. \n\n \n \n           After another week, Aziraphale fears he cannot keep hiding. There is only so long Crowley will let him not answer his phone, and he knows he's reached the limit when the locked door of his shop jingles cheerfully and swings wide for the only other person that has no need of a key. For a brief moment, Aziraphale considers hiding, but his potential hiding place are limited, and none of them would leave him any sort of dignity.\n           \"Angel...?\" comes Crowley's soft call, as though he were in a library instead of a bookstore. \"You in here?\"\n           \"Back here,\" Aziraphale answers, without leaving the aisle he's in. If he doesn't leave it, he may be able to prevent Crowley from his usual orbit, and possibly even hide his wings well enough Crowley won't notice.\n           Of course, his plan fails to take into account the fact that the act of hiding his wings from Crowley would be unusual enough to notice. On any normal day this inattention to detail might have mattered a great deal, but today, Crowley rounds the corner in an unusually dramatic manner and says: \"Where've you been? I've been calling all day.\"\n           Aziraphale blinks. He has not heard the phone. \"Erm, no service?\" he says hopefully. \"Your doing, perhaps?\"\n           Crowley gives him a dry look. \"Wouldn't be very smart of me, to ruin it if I needed to use it, now would it?\" he says, as though he has not done that exact thing dozens of times before. \"And haven't you got a landline anyway?\"\n           \"What do you want, Crowley?\" Aziraphale says with a touch of exasperation. He hopes that the answer is  something, because  nothing  has a lot more implications he doesn't have the ability to handle right now.\n           \"Nothing,\" Crowley tells him, and a muscle in Aziraphale's jaw jumps as he clenches it. \"I just- well, you're okay, aren't you? We've got to stick together now.\"\n           \"I'm fine,\" Aziraphale assures him. \"Did you need something else?\"\n           Hurt flickers over Crowley's features, almost too quickly for Aziraphale to clock, and he might not have noticed it at all, had he not been searching for any sign that Crowley suspects he is up to something. \"No,\" he says, retreating a step. Aziraphale sways forward, but keeps himself from following. \"I guess not.\"\n           \"Ah, Crowley?\" Aziraphale says, before Crowley can escape entirely. Crowley pauses, and Aziraphale sorts through all of the millions of things he wants to say to him, before finally settling upon: \"As long as you’re here, may I ask you something you won't like very much?\"\n           Crowley's brows rise, clearly not having expected such a question. Aziraphale can't blame him; he had not expected himself to say that, either, but he finds he would rather have this conversation than hurt Crowley. It is only a minor relief when Crowley makes a little motion with one hand to invite him to proceed, but Aziraphale somehow keeps from wringing his hands.\n           \"It's, erm, it's about... well, I'd like to know what happened when you Fell?\" Aziraphale's heart climbs up his throat when Crowley bristles, and he rushes to continue. \"N-Not about- well, you see, I- I was wondering about what happened to your...\" He trails off at the threshold of his last escape, knowing Crowley will guess his predicament if he continues. But if he is to prevent hurt feelings, he must finish what he started. \"To your wings...\"\n           Even through the dark glasses, Aziraphale sees Crowley's eyes shift to catch a glimpse of the wings Aziraphale is trying hard to keep hidden. Crowley's are tucked neatly behind him, pitch-dark and almost inconspicuous, despite their size. He does not answer quickly. In fact, he does not answer at all.\n           \"I'm sorry,\" Aziraphale finally says, surrendering. He doesn't want a fight. Not now.\n           \"Nothing happened to them,\" Crowley says, like it has been torn from him without permission. The soft sound of his feathers brushing against one another fills the room as he opens his sleek, black wings a little, just enough to emphasize his meaning. They look rougher than usual, with missing feathers in a few places and a vague sort of mottling along the lead edge that might only be a trick of the light. \"Feathers all came in black, next moult after the Fall.\"\n           \"Black?\" Aziraphale says, suddenly much more confused. He, obviously, had not associated with any demons immediately following the Fall. No one had. After all of the rebellious angels had been cast out of Heaven, no one had seen or heard from them for a very long time, and the next time they had, the demons had looked... different. Worse for wear, certainly, but in the same basic form as they take today, black wings and all.\n           Crowley nods. \"Been that way ever since.\" It sounds like part of the truth, at least.\n           Aziraphale's mind races. Black feathers. The ones he'd been plucking were darker than his own, but not black. He had assumed there was an interim stage, moulting darker with time or with deeds. \"Not grey, then?\"\n           Slowly, Crowley's wings close and he stares at Aziraphale as though he's just been socked in the gut, and he does his best to hide his wings now. Aziraphale thinks he really must have overstepped- Crowley never hides from him.\n           \"I'm sorry,\" he says again, only this time he manages to actually sound like he means it. \"I didn't mean-\"\n           \"Do you think it's possible to Fall upwards?\" The question is so out-of-the-blue that it startles Aziraphale, who can do nothing more than stare at Crowley as soon as he's asked it. Crowley, for his part, does a very good job avoiding eye contact.\n           \"Well, I- I think that's just called flying,\" Aziraphale says, unable to think of an intelligible answer. It's not a very fair question. Being cast out from Heaven is an extremely one-way ticket on a train Aziraphale has accepted he is riding. But, he realizes with a second start, Crowley isn't asking for Aziraphale's sake. Both of Crowley's wings have pink skin around the alulae, too. \"Why do you ask?\"\n           \"Curiosity,\" Crowley says, looking distinctly uncomfortable, which is an obvious lie, or at least mostly a lie. \"I just thought, you know, that if angels can Fall, shouldn't demons be able to un-Fall?\"\n           Aziraphale tries to follow his meaning. \"You mean, become angels again?\" He finds that as soon as the words are out of his mouth, they bring with them something he is certain he does not deserve: hope.\n           \"And why not?\" Crowley asks defensively, even though there is nothing to fight against. He looks very much as though he would like to slither out of his skin to escape the conversation he's started, but he forges ahead anyway. \"What's the point? What's the point of all of it, if you can't ever get better? Where's the reason to do good, if Hell's just going to punish you for it, and Heaven won't let you back no matter what? Doesn't make any sense!\"\n           \"Crowley,\" Aziraphale says, and he knows it sounds like an argument brewing, so he continues through the beginning of Crowley's half-formed rebuttal. \"I hope you're right.\"\n           \"-and... er... you what?\" Crowley stops to take a breath he doesn't need, and just stares at Aziraphale.\n           Aziraphale hesitates, holding onto the last vestiges of his former hope, the one where he does not want to worry Crowley. However, if he's guessed right, something is going on and they're both going to have to deal with it eventually. So, he loosens his wings, letting them sag open enough that his bare alulae and plucked secondaries are clearly visible, and Crowley's eyes can't seem to look anywhere else.\n           \"Your wings...\" Crowley breathes out, sounding every bit as damaged as Aziraphale had felt when Crowley had told him the bookstore burned down.\n           \"I think I'm... I think I'm  Falling,\" he says, the words so fragile he is afraid they might break as he says them. \"I think I have been, for a while now.\"\n           Crowley is still staring, and although Aziraphale has known Crowley for over six thousand years, he does not recognize the look in Crowley's slitted eyes. Aziraphale has seen pain and anger and upset and worry. He had seen - or thought he had seen - the full range of human emotions cross Crowley's features at one point or another, but Crowley is not a human and Aziraphale comes up short.\n           \"Why didn't you say something?\" Crowley manages, eyes finally ticking up to meet Aziraphale's. \"Why didn't you tell me?\"\n           \"You've done enough worrying for the both of us for months,\" Aziraphale says. \"And what could you have done about it, even if I had?\"\n           \"I could have made sure you weren't alone, for one,\" Crowley says, his wings drooping a little before they spread out halfway, and then flare into full view. Aziraphale can see missing feathers all over the insides of them, and two primaries gone from damaged skin. He'd plucked them, or cut them out, or clawed them out, by the looks of it, and Aziraphale can't understand  why.\n           \"Why wouldn't you want to- to un-Fall?\" he says, not sure what they should be calling it.\n           There's an expression he recognizes; offense. \"Well I didn't exactly mean to, now did I?\" Crowley asks. \"It was all that saving the world business that did it, I expect. Very un-demon-like of me.\" His face falls back into something unrecognizable, but Crowley's next words bring with them sharp relief and understanding. \"And apparently very un-angel-like of you.\"\n           Regret, Aziraphale thinks with a twinge behind his ribs. That is the emotion he had not recognized. It doesn't suit Crowley at all, and only serves to make Aziraphale wish to smite whatever had caused it. This is terribly inconvenient, as he suspects it is his fault.\n           \"What do we do now?\" he asks instead, small and more than a little frightened of the answer.\n           Crowley's wings fold, but not tightly. He has no reason to hide them anymore. \"We keep going,\" he says softly after a moment of thought and a shrug. \"Nothing else we  can do, really.\"\n \n  \n\n            She finds Crowley among the hundreds of stars she has created, his wings stirring stardust into clouds she will call nebula. He notices her light, and falls still, waiting. Love radiates from him. \n\n\n            \"I have something for you,\" she tells him. She produces a small object for him, and gives him hands that he might accept it. She likes hands. \n\n\n            \"What is it?\" he asks, staring in wonder. It is beautiful, small and shiny, with jagged edges on its sides. \n\n\n            \"A key,\" she says. She has not invented locks yet. This will go to something else. \n\n\n            \"What shall I do with it?\" he asks, turning all of his dozens of golden eyes to her. \n\n\n            \"Protect it,\" she instructs. \"It will take you where you want to go, someday.\" \n\n\n            \"Someday?\" he repeats. She has yet to invent time. She warms him with her amusement, and he asks no more questions. \n\n\n            Curiosity, she thinks. She will have to remember that. She will give that to the humans, when they are ready to be created. It will save them, someday. It will ruin them first, but it will save them in the end. \n\n \n \n            They do not, exactly, Rise or Fall.\n           Aziraphale has never appreciated the experience of a moult. The outcome, a brand new set of undamaged, clean feathers, cannot be argued with, but the process is always messy and itchy and  exhausting. As soon as he stops plucking, it seems that he drops feathers even faster, and their return in the form of soft, grey replacements leaves him utterly drained.\n           Normally, angels have no reason to sleep; it's a vaguely horrifying idea, just going unconscious like that and not knowing if they'll come back or not. Aziraphale tried it once, four centuries ago during his last moult, and had regretted it as soon as he'd woken. Four days had gone by, just like that. He could have gotten any number of things done. He could have read a book. Ghastly business, sleeping.\n           Still, he finds himself nodding off at his writing desk, and winds up at Crowley's flat a few minutes later, with no idea what he plans to do next.\n           \"I don't want to sleep alone,\" he says, and only realizes how that sounds after he's said it.\n           Crowley seems to understand anyway. He lets him in and shows him to a bedroom so immaculate as to look unused. \"Do you want me to wake you?\" is all he says.\n           Aziraphale hesitates, and then nods. \"Please.\"\n           When he wakes, Crowley is perched on the end of the bed, not paying him any attention but not leaving him alone, either, exactly as he had requested. Crowley's wings are more grey than black now, paler than Aziraphale's own but nowhere near white. He's got them open, limp to either side of him a little like a bird sunbathing in a particularly delightful sunbeam, except there is no sun, and Crowley is hardly a bird.\n           Perhaps most surprising of all, is that there is a book in Crowley's lap. Aziraphale has heard of dreams feeling real and, despite the fact that he knows angels and demons do not dream, he worries for a moment that he's in one.\n           \"Pigeons,\" Crowley says, only looking up when Aziraphale fails to answer because he has nothing at all to say. Crowley tips the book up so Aziraphale can see both covers, and it appears to be a bird identification book. Crowley lifts one wing and twists and turns it to its limits, just so he can look at it. Then, he splays it across Aziraphale, so that he can look, too. \"They're pigeon grey.\"\n           Aziraphale's heart goes soft and warm and he cannot help his smile. \"Pigeon grey,\" he repeats, so fondly. He  loves pigeons. \"They're very human birds,\" he tells Crowley as he struggles into a sitting position as well, facing Crowley at the end of the bed. Crowley's wing lifts only enough to allow him to move, before settling back on his lap as though on display. \"Humans called them rock doves and domesticated them ages and ages ago, because they loved them so. They believed that they were kind and beautiful and peaceful creatures. That they were perfect to live alongside.\"\n           Crowley smiles, the sort of smile Aziraphale would not mind getting lost in for a few days. \"Do you really think we're anything like that?\" he asks. \"We're a bit too rough around the edges, I think.\"\n           \"Even feral pigeons are well-loved by humans,\" Aziraphale says. He manages to stop looking at one part of Crowley in order to look at another, his fingers tracing down the line of a single, sleek primary toward the tip of Crowley's wing. \"There's always someone feeding flocks of them in parks and cities.\"\n           \"There's only two of us,\" Crowley says, eyes ticking to Aziraphale's silvery wings for only a moment. \"Hardly a flock.\"\n           Aziraphale chuckles and looks up so that he can watch Crowley's face when he says: \"They bond in pairs for life, you know. Pigeons, I mean.\"\n           Crowley holds very, very still, without breaking eye contact. \"Do they really?\" He obviously has not missed Aziraphale's meaning.\n           Aziraphale nods, barely a motion at all, and smiles uncertainly. \"I don't think we need a whole flock,\" he ventures tentatively. \"Do you?\"\n           Slowly, Crowley closes the book and sets it aside, his wing dragging over the covers between them to fold out of the way. He shakes his head and a small smile alights on his features like a wary bird. \"No, dove. I don't.\"\n \n \n             She catches him watching her newest inventions, before she has invented them. She still has not begun time, and it spreads out backwards and forwards and in circles all around them now. Space is crowded with pre-time, and they can see all of it and none of it. \n\n            \"They're beautiful,\" he tells her. She has not invented breathing yet, either, but he would be breathless if she had. His wings shiver. \"What are they called?\" \n\n\n            \"Humans,\" she tells him softly, so fondly it aches. \n\n\n            \"What are they for?\" he asks, riveted by their activities, their beginnings and their endings and everything in between. \n\n\n            She looks upon them. They will be her proudest creation. They will face so many hardships. \"I wish to test them,\" she says. \"I wish to know what they are made of.\" \n\n\n            \"You made them,\" he says. \"Don't you know what they are made of?\" \n\n            She  loves  him. \n\n            \"They will need your help, someday,\" she admits to him. She shouldn't, but he won't remember it- at least not the words. He will remember the intention, and it will nearly destroy him. Nearly. \n\n\n            They watch the humans together. She will invent them soon, and start time alongside of them, and Crowley will be swept along in the same river, only able to see the present. He won't remember their future or their past, but he will know the present. \n\n\n            \"Crowley,\" she says. He manages to tear some of his eyes away from the humans, and she knows she has made the correct decision. She is not sure she can make the wrong one, but she knows she can make ones she regrets. \"I have something for you again.\" \n\n\n            \"What is it?\" Crowley asks, all of his eyes upon her now. \n\n\n            \"A moment,\" she says. It is the least she can do, to give him one moment outside of time. He will not remember he has it, until he has need of it. He will not need it until Lucifer threatens to take all of time away from him. That is why she has come to him now. \"Lucifer will be cast down.\" \n\n\n            \"Why?\" The word is soft, merely curious. He cannot be alarmed- Hell has not been invented yet. Neither has down. He does not yet know what it means to be cast down. He trusts her implicitly not to hurt them, but he is curious. \n\n\n            \"He will refuse to obey me,\" she tells him. She observes the changes that come to his essence. He is confused. He does not know why anyone would disobey her, especially not Lucifer. She expects a million other questions, but not the one he gives her. \n\n\n            \"What do you ask of him?\" \n\n\n            She indicates the humans. \"I will ask him to love them more than he loves me. I will ask you, too.\" \n\n\n            She expects him to resist. Others will say yes or no. She will love them both, but she will cast down those who refuse to obey. Each side has a purpose, and each will need the other. She expects him to choose a side, too, but he does as he has always done, and asks her: \"Why?\" \n\n\n            \"Faith,\" she tells him. The humans will teach him the meaning of that word. \"You will see, later.\" \n\n\n            He doesn't understand later. Only now exists, and in the now he loves her more than he can fathom. She will cast him down, as well, but it will not be for disobeying orders. She will cast him down because that is where his path must begin, if he is to get to where he belongs in the end. He will not understand. He will have forgotten the ether before Time, or at least most of it. \n\n\n            He will want to stop loving her, and he will wish that it could kill him. For Crowley, she invents sacrifice, and he will never forgive her for it. \n\n\n            And she will love him, even then. \n\n \n \n            Their new, Earthly wings grow in, one feather at a time, until they wear matching soft greys, dark and light and patterned in ways no angel or demon's have ever been. They spend their days among the humans, where Aziraphale continues to not sell anyone any books, and Crowley continues to cause mischief he no longer needs to take any credit for, and they are, if not happy, at least content.\n           And at night, when the humans around their home are asleep and the world rests upon her laurels awaiting the break of day, Aziraphale can be found, more often than not, at Crowley's flat. Or at least, what  used to be Crowley's flat, but through virtue of shared occupation now belongs to them both. This arrangement is new and unusual and tentative, but unequivocally what both of them want. It is working so much better than their last arrangement, and that one hadn't gone  that badly, in the end.\n           They do not hear from either of their previous sides for a very long while, and when they do, it is not in the way to which they are accustomed. The first to arrive is an angel, who folds his wings to his body so tightly they look like a backpack, and he ducks his head and tells them almost without a sound that he thinks they did right, to stop the apocalypse. He asks to join them, and Aziraphale looks at Crowley until Crowley concedes that no, they cannot turn him away. There's another war coming, and they may as well collect as many as they can before then.\n           The angel, Hadriel, gets his first silver feather less than a month later, only days before the first demon arrives to join them, too.\n           \"Perhaps,\" Crowley tells Aziraphale that evening, after they have settled on the couch together, \"we’ll have a flock after all.\"\n           Aziraphale spreads one wing over Crowley's lap like a blanket, relaxing into the gentle feel of Crowley's fingers as he begins to preen Aziraphale's sleek, silvery feathers.\n           \"Wouldn't  that  be something,\" Aziraphale says, and he closes his eyes, and he smiles.\n \n  And if we only live once \n\n I wanna live with you \n\n \n \n\n            Just before Time begins, she crafts Eden in its sands and places the garden in the heart of Earth. She fills it with love and with innocence and with greenery. It will be safe, if they stay within the walls. She will leave angels to guard its gates. She will place a tree at its center. The humans will eat of its fruit Sunday, and her game will begin in earnest. \n\n\n            She crafts Heaven afterward. The humans will believe it came first. So will the angels. They will forget about the ether in every way that matters, save for the one with wings to match it. Even he will only remember when he is ready. Even he will only remember the bitter taste it leaves in his corporation's mortal mouth. \n\n\n            Lucifer finds her as she breathes life into Adam and then into Eve. He has been waiting for them nearly as long as she has. They both know what is coming. They have both watched it happen. \n\n\n            \"I cannot love them after having loved you,\" he tells her. She has invented sorrow just for him, and he will give it to the humans to spite her. \n\n\n            She casts him down, and the others who agree with him. \n\n\n            She does not craft Hell. Lucifer forges it from wrath and pride and pain. He carves it from the skin of the world and calls it his own. He wishes not to love her, but he does, only now he calls it hate, and wields it like a weapon. \n\n\n            She loves him, too. \n\n\n            She will love him until he destroys himself with a child of his own making, the way he wishes he could destroy her. \n\n\n            She will love him long after he is gone. \n\n \n  \n           \"What are we going to do with all of them?\" Aziraphale asks him one night over dinner. The term 'cook' applies very loosely to what Crowley has learned to do in the kitchen, but as far as Aziraphale is concerned, Crowley could make a peanut butter sandwich and Aziraphale would adore it.\n           Crowley looks up from his food, none of which he has so far touched, and seems a little confused. \"Who, the others like us?\"\n           \"Yes!\" Aziraphale says, a little bit louder and a touch more distressed. \"Two more showed up at my bookshop today.\"\n           It has been six months since Hadriel and Frejit – or Fred, as she has asked to be called – had arrived and settled nearby. Hadriel's wings are almost completely grey now, pale with dark bands along the edges. Curiously, Fred's had come in so dark-grey they are almost black, but with an iridescence unlike anything Aziraphale or Crowley has ever seen. She shines purple in the sunlight, where she spends a great deal of time.\n           \"You didn't seem to mind the idea before,\" Crowley points out so neutrally that it is definitely not.\n           Aziraphale purses his lips and makes a sound. \"A handful of traitors spread across London might not be noticed,\" he says carefully. \"But there's been twenty just last month. There's nearly a hundred of them. How are we going to protect them?\"\n           \"Protect  them?\" Crowley squawks a little incredulously, though Aziraphale can see amusement quirking the corner of his lips. \"They're angels and demons, dove. They're not children in need of guardians. They  are guardians.\"\n           \"A hundred angels and demons, even a  hundred  of them, don't stand a chance if Heaven or Hell decides to come for them.\" Aziraphale knows his worry is not unfounded. \"You and I might have been able to make a run for it, but this many can't. Our actions brought them here, which means we're  responsible for them, at least a little bit.\"\n           Crowley lets out a long-suffering sigh at the word  responsible, and sets his fork down on his plate so he can sprawl back in his chair unhindered. \"Our actions didn't bring them here. Our actions showed them they had a choice, but they made it themselves.\" Aziraphale continues to stare evenly at him until Crowley makes a noise of complaint. \"Fine, we're responsible for them. What do you want to do about it?\"\n           \"I don't know,\" Aziraphale says. It is a wretched admission. He has thought a great deal about this, tying himself in knots with worry, and has never come any closer to a solution. It was dangerous enough, the two of them rebelling and choosing to be on their own side in the first place, but Crowley had said there was a war coming, and they are by no means ready to lead an army.\n           Crowley's hand gently covering his snaps his attention back to the moment. He looks over, heart still hammering in his chest with worry, but Crowley's smile sets the world upright again, at least in part. \"We'll figure it out as we go. We always do.\"\n \n \n             Eden lays sprawling before her where she stands upon the Eastern gate. An angel stands beside her, looking out over the expanse. She can see his thousand eyes and his wings and his claws. She can see his Aspects, the ones after which she will model lions and elephants and otters, and they vie for space inside his mortal facade. He looks human, except for the single pair of wings folded loosely to his back. \n\n            \"All of it?\" he asks with trepidation. \n\n\n            \"Just the Eastern gate,\" she says. \n\n\n            A sword burns at his feet. He is the gentlest of the angels, or he wants to be, and she thinks that counts. His desire to be kind will be responsible for some of the worst atrocities humans will ever commit. He is a warrior, though he wishes he were not, and that is why she has offered him the sword, and why he must take it and be ruined. He will hold it for six days and on the seventh he will give it away because his heart tells him to. \n\n\n            She did not give this one a heart. He made it up, himself. He will use it to understand what he has done. He will use it to regret what he has done. \n\n\n            He will use it to do a different sort of falling than the last angel to have a heart. \n\n\n            She aches for him, but she will not change his path. \n\n\n            He must play the game, or all the rest of it will be for naught. \n\n\n            \"I will guard the gate,\" he finally says. He lifts the sword and tests its weight. It is a good sword. It will last to the end of the world. It will last beyond that. He sheaths it in ether, out of mortal sight. \"I will obey.\" \n\n\n            He has invented lying. He doesn't know it, yet. \n\n\n            \"Aziraphale,\" she says, before she goes. \"Treat him kindly, when he comes to you.\" That order, at least, he will obey. \n\n\n            It is the last time she will interfere with his path. \n\n \n \n            Once upon a time, Crowley could have wandered the globe and run into almost no one from either side. The demons, and even the angels, tended to work out of sight when possible, only appearing long enough to give a well-timed nudge. They made their moves on a cosmic time scale- ten years to steal a single soul from the other side. Most of them weren't  stationed on Earth, and so had the same attitude which human tourists tended to have; that is to say, they came in with no regard for the locals and no intention of actually interacting beyond a surface level.\n           Crowley, on the other hand, had been told  go up there and make some trouble, and he had been doing so for millennia since no one had bothered to tell him what  kind  of trouble or when he should  stop  making it. That is just the sort of management Hell has, and it has suited Crowley just fine. The longer he has spent among the humans, the more he has grown accustomed to them. The more he learns of them, the more he wants to learn of them.\n           And aside from Aziraphale, he had always thought that perhaps he is alone in that mindset. Demons like Hastur and Ligur never really seem interested in going above and beyond their duties. They come here, mess around with the humans, and leave again before they see any of the fallout. They leave before the most interesting parts can begin.\n           So it is that only a year ago, Crowley would have been surprised to see another demon, or to see an angel aside from Aziraphale.\n           Now, Hadriel is at the bookshop more days than not, reading under Aziraphale's watch and learning about humans. Now, Fred has opened a pet grooming salon only a few blocks away that happens to service a different sort of client's wings in the spacious basement. Now, when Crowley cruises around town in his Bentley, he passes at least a dozen pairs of silver wings that humans can't see.\n           Now, angels and demons that had avoided Earth at every opportunity are welcome nowhere else, and Crowley's normal haunting grounds have gotten crowded.\n           Unfortunately for him, while the newcomers had all had the same idea of leaving their home factions, it had been over six thousand years since they'd had to work together and  the same side  has begun to look a lot more like  separate but equal. Crowley knows how poorly that had gone for humans. If they are going to live among humans, they have to do better.\n           Which is how he finds himself pushing through the door of Fred's shop trailed by two very uncertain ex-angels. The door had been locked and the shop's hours spoke of closing times, but Crowley knows people are home even if the lights are not on. As if reading his thoughts, one of the angels summons Light, illuminating the empty shop. Crowley glances at her, but doesn't correct her before crossing to the door labeled  exit.\n           The stairs lead them downward and spit them out into a large, open area, not unlike the basement of a church. There are several long tables with folding chairs all about them, and Crowley counts eight heads before he is interrupted by one of the nearest saying:\n           \"Crowley? What are you doing here?\"\n           \"Came to check up on you lot,\" he says, stepping aside to make his small entourage clearly visible. \"Heard there was a meeting, but my invitation must have got lost in the post. Brought some friends.\"\n           This declaration does not sit well with the gathered, and they shift nervously from foot to foot, giving one another glances that ask what to do next. Fred steps forward, even though Crowley had not seen her in the crowd. She is very slight and holds herself as if she knows she will not be noticed unless she wants to be- and she is right. \"It's not that we don't want you here,\" she starts.\n           \"You just don't want  them  here?\" Crowley asks, with absolutely no amount of calm. It has precisely the cowing effect he had intended. \"Listen... I know you came here from different places, and I know there's bad blood between you. But you've made a choice, and it was a choice, and if you are going to live on a planet where I have to deal with you, then you're going to all get along  better.\" This feels an awful lot like talking to his plants.\n           \"It's not-\"\n           \"It is,\" Crowley interrupts, voice like steel, \"that easy. You never came from different places. You came from the same place, and someone  put you  in different places. It wasn't right of Her, but that's what happened. All you're doing is putting yourselves back in the same place.\"\n           \"Excuse me,\" says one of the angels from near the stairway. They all turn to look, and she clasps and unclasps her fingers nervously in front of her. \"We can leave, if we've intruded.\"\n           Fred's eyes catch on Crowley's on their way past, and then she's taking stock of the others in the room, who are all looking back as if waiting for an order, and Crowley realizes what's gone wrong, and it wasn't any of them. He softens, already knowing he's going to have to have a long talk with Aziraphale later tonight to apologize for thinking they needn't do anything to help.\n           \"Fred,\" he says quietly, and her attention snaps eagerly back to him with the sort of relief that comes from an unexpectedly-lifted burden. \"Having a choice is... well, it's terrifying. And the  only  way it gets less terrifying is to have someone else to turn to. We've all,\" he continues, gesturing broadly to the whole group, \"given up everything else to be here, and there's millions of angels and demons out there waiting for us to divide ourselves up into bites they can eat. We  have to stick together. It's the only way any of us make it. It's all of us or none of us, do you understand?\"\n           Fred's gaze drops a little, then swings back up to the two angels behind Crowley. \"What are your names?\" she says, gently.\n           \"Gadrael,\" says the angel that had spoken first. \"And this is Lozathis.\"\n           With one last glance at Crowley, Fred steps aside and sweeps one arm out to invite the two into the group. \"My name is Frejit, though folks call me Fred. Come on in. We'd be happy to have you. We're learning about human cooking again tonight. Vizith is going to teach us how to make  salads.\"\n           Crowley watches the collective tension in the room dissipate at having a course of action, and he allows himself a small smile. Maybe this will work out. Maybe they don't care what direction they go, as long as they have one. Maybe all they need is a little bit of guidance, after all.\n \n \n\n            She places the apple tree at the center of the garden, the heart of the world. In its boughs she places the ripened fruit of knowledge. When the humans have lived enough generations, they will call the apples Choice and say that the eating of the first apple gave them free will, but they will be wrong. Certain attributes have been welded into the genes of humanity- free will and curiosity at the top of the list. \n\n\n            What the apple will give them is much worse than free will. \n\n\n            Knowledge. \n\n\n            Without knowledge, there is no choice. \n\n\n            Adam and Eve stay in the garden because they know nothing of what is outside of it. They know nothing of pain or sadness or fear, because these things do not exist in Eden. She has bound these concepts under the bitter skin of crimson fruit and placed a warning beside the laden tree: Do not ask questions you do not want answered. \n\n\n            Later, but before they call the apples Choice, the humans will call the tree Pandora’s box. They will speak of a girl who let out all of the troubles into the world, and left but one thing trapped under the lid: Hope. \n\n\n            The humans will not know they speak of the same girl who ate the first apple, but She knows. \n\n\n            She watches the serpent of Eden slither from beneath the soil, sulfur still molten on his belly, to whisper temptation into Eve’s ear. She watches Eve tug the first worldly trouble from a bough and take it into herself, offering the second bite to Adam. She watches as they spend days plucking knowledge, good and bad, from the tree, until it is bare save for the one shining, juicy fruit that sits before the serpent where he lies coiled over a thick branch, watching too. \n\n\n            “Thank you,” Eve tells him, her fingers petting the soft bulge of muscle at the rear of his head. \n\n\n            “There’s one more,” he says. She is the first to touch him kindly. She will not be the last of her kin to do so. \n\n\n            “It’s for you.” She smiles, and takes Adam’s hand. They will leave the garden soon. There is life in her belly, bright and warm like a pinprick flame in the night. \n\n\n            Crowley watches them walk away and doesn’t move from where he is coiled. The apple hangs before him, waiting. He lies there until the sun goes down on the seventh Day, and he is still there when dawn arrives. The apple waits too, but there is a hole in the wall now, and the angel who had made it will soon do worse. She goes to Crowley then, and he does not acknowledge her arrival. \n\n\n            “Will you not partake of it?” she asks. It is the first question she has ever asked, and she is glad he is the one to receive it. \n\n\n            He doesn’t look at her. She knows he won’t, ever again. “I would be destroyed, if I did.” \n\n\n            “I wouldn’t destroy you,” she tells him. \n\n\n            “I know.” He stares in the direction of the Eastern gate, as though he can see what transgressions occur there even now. \n\n\n            She understands his meaning, then. \"You know which apple she has left you.\"\n\n\n            He doesn’t answer.\n\n\n            After a time, he empties Pandora’s box, swallowing Hope down whole, and heads for the East to meet an angel. \n\n \n \n            By the time a year passes, there are silver-winged angels and demons walking the streets that neither Crowley nor Aziraphale recognize. On a good night, a night where things have been quiet and the streets are empty and the world lulls itself to sleep, a night where they've eaten dinner together and Aziraphale is curled up on the couch with a book and there's soft music drifting from his stereo like a warm blanket, Crowley can sense them.\n           He can close his eyes and reach out and feel the hundreds of former angels and demons. He may not be able to count them, or tell exactly where they are, but the ethereal energy is nearly overwhelming. It is not love, exactly, but it permeates London these days, the same way evil used to after Crowley had caused the M25 to be built just right.\n           Vizith had fixed that.\n           Two months ago, at one of the wing-salon underground meetings, he had quietly gotten in front of the group and requested the aid necessary to discreetly fix the M25's path so it would no longer work to summon any kind of evil except the natural, mundane sort that came with all human roads. Four others had agreed to go with him and, according to what Crowley saw when he'd inspected it in secret after, they had done an almost artful job of miracling a small section of road back to where it should have gone before Crowley moved the markers.\n           \"I remembered your presentation,\" Vizith had told him later, after the next meeting. \"I thought, you know, that I could undo a little of the past for you. Not many chances for that.\"\n           \"No,\" Crowley had agreed. There aren't. Almost none, in fact. Mostly, if any of them want to right wrongs, it must be done by going forward rather than looking back. \"Thank you.\"\n           The meetings are not usually like that. Crowley sits in on many of them, and sometimes Aziraphale joins him, and a couple of times Aziraphale goes alone. The meetings often consist of the group – now so thoroughly mixed it is sometimes easy to forget they'd come from opposite sides – learning a skill or lesson from someone who feels confident enough to teach it. They teach themselves about humans, and about human objects, and about human customs.\n           They teach themselves about phones and computers, and about television. Aziraphale suffers an intense week where it seems everyone in the entire city has become obsessed with a new phone app that appears to be just tapping colored bricks, and no one wants to do anything else. It passes, as all new things do.\n           Aziraphale teaches them about food. Tuesday nights, one of the emptiest nights for most restaurants, Aziraphale takes a large group out to eat. They order almost everything on the menu, swap food around on plates so everyone can try anything they want, and there's always a ridiculous tip left because Crowley tells them they have to if they are going to cause a fuss.\n           Crowley teaches them about driving. Almost all of them get around by walking, or by taking the bus, but he maintains that they should all know  how to drive, even if they don't  use that knowledge. He takes them for rides in the Bentley, and they rent cars at the edge of town to practice where no one will be hurt. He teaches them about gauges and pedals and gas and oil, even though they don't really need the knowledge to drive themselves. They can use it to help the humans.\n           As they gather that evening at a local bar, Crowley overhears Gadrael admit that driving fast had felt like flying again. Trapped here, in bodies they cannot replace if they discorporate them, flying is out of the question. Mortal bodies are not meant for celestial travel. In the silence that follows Gadrael's admission, Aziraphale nudges Crowley and nods toward the group, just a little ways away, and the soft hand Fred lays over Gadrael's when she says: \"I think we all miss it.\"\n           Later, they learn about  gardens, which are very different from the Big Garden, very different from Eden. Window boxes with vegetables and flowers begin to pop up all over town. In the park, Aziraphale catches Crowley teaching a large group how to speak to plants, and two days later Crowley walks in on Aziraphale apologizing to Crowley's plants for what they've suffered.\n           \"They don't deserve to be treated like that any more than you did,\" Aziraphale tells him softly, wings up as if he expects a fight.\n           But Crowley looks between him and the plants like something is killing him, and then just nods, his jaw wired too tightly closed to speak. Without a word, Aziraphale closes the distance between them and pulls him into a fierce hug, wings folding around him almost entirely. Crowley holds on like he'll Fall all over again if he doesn't. Aziraphale had forgiven him once before, but he had forgiven him like a weapon. He had forgiven him like an argument, like a goodbye.\n           This is different.\n           This is something Crowley had never thought he needed, until it had been given words. He had never known forgiveness could heal instead of hurt.\n \n \n             Crowley meets Aziraphale atop the Eastern gate, and they watch the humans leave Eden with a flaming sword and the knowledge to choose sides. They have each given the humans a damning gift. They have each given the humans salvation. \n\n            Ten million angels and ten million demons start their countdowns in unison as Aziraphale lifts a wing over Crowley's head to protect him. The forces of Heaven and Hell begin to plan war as Crowley shares the warmth of his heart with one who should be his enemy. One will teach the other about love, and learn what it means to protect. The other will make both necessary. \n\n\n            They are something else already, though they won't realize it for millennia. The gap between the sides has already begun to close because their hearts reach for one another even now. \n\n\n            She wishes she could spare them the pains of their journey, but she cannot bear to take away their ending. They would hate her for it. \n\n\n            All she can do now is watch. \n\n\n            Her plan has at last been set in motion. \n\n \n \n            \"France,\" Hadriel suggests, moving a paper map into Aziraphale's line of sight. \"We'd have to learn the language, but it's close, and Paris is-\"\n           \"Beautiful,\" Aziraphale says, smiling as he looks over the map, finding where Hadriel has circled in red ink. \"You'd do well there, I think. It's a bit faster than here, but charming.\"\n           Hadriel looks a little nervously at the other four that had come to the meeting. Aziraphale had told them before that they did not need  permission  or  orders to go wherever they wanted, but old habits die hard, he supposes. London is getting too cramped for all of them; it feels as though it will soon be more supernatural beings than humans, though Aziraphale knows that can't be true. But they have to go somewhere, and if running it by Aziraphale first is the only way they will find their own paths in the world... well. Here he is.\n           \"Go ahead and say what you like,\" Aziraphale encourages gently.\n           \"We want to stay in touch,\" Ineria blurts, earning her looks from the others. She ducks her head, the bat atop it clinging a little more tightly. \"With you, and with Crowley.\"\n           \"You have the shop number,\" Aziraphale says, puzzled. \"You can call.\"\n           \"Yes but... well,\" another ex-demon, Ricket, jumps in. \"Crowley showed us how to use  mobile phones. We started a group chat, and we were hoping...\"\n           Aziraphale holds in a breath, counting to three. Crowley is going to hear it tonight. He'd almost certainly had a hand in creating group chats in general and definitely has had a hand in making sure this one got to him. Aziraphale had, for a very long time now, refused to own a  mobile telephone, much to Crowley's annoyance. They make a racket and are too bright and make him too easily accessible if he wants to escape.\n           But there are five hopeful faces awaiting his response, and he cannot bear to disappoint them after everything they had been through and everything they must yet face. It had taken him six thousand years to make the decisions they had made in less than one, and even five years hence, he would not wish the loneliness he and Crowley had been through upon anyone.\n           \"I shall see what I can do,\" Aziraphale tells them softly.\n           The group breaks out into huge smiles and excited chatter, and Aziraphale does not miss the way Ineria's hand seeks Hadriel's. It's likely he will end up with a mobile phone at some point but even if he doesn't, he suspects that they won't be as entirely alone as he first thought.\n           And that, he thinks, is something he doesn't mind being responsible for, even a bit.\n \n \n             The heart she had made works as intended. \n\n            Crowley wishes to use it to spite her, but finds it has been made soft in only the span of a wing crested over him atop a wall. He will never be the same for it, but he will learn not all change is bad. Not all falls have as harsh a landing as his first. \n\n\n            She spends more time than she should watching the heart an angel made for himself. He is not sure how to use it, and there is only one being like him from which to learn, and he does so slowly. She floods the lands and Aziraphale learns heartbreak from the way Crowley looks at the children. He watches the crucifixion and learns the bitterness of inevitability. He sits beside Crowley at a counter in Rome and learns what it is to want. He stands in the ruins of a church and learns what it is to love. \n\n\n            Perhaps most importantly, he learns who he is. \n\n\n            He uses his heart to love all of the amazing things humans do, from making intricate foods and tasty drinks to writing beautiful stories to making music and singing song and dancing dances. They are here and gone in what seems like an instant and they make every moment count, throwing themselves into art and love and invention. They reach for the stars and dive to the seafloor and when they realize they cannot fly, they make themselves wings and do it anyway. They tame animals as companions and form vast communities and Aziraphale learns to love them the way she had intended every angel to do. \n\n\n            When he realizes that they do not, he faces the choice he thought they’d all made before half of Heaven fell from Grace. \n\n\n            He finds himself having to choose between Heaven and humanity. \n\n\n            But he has befriended a fallen angel who knows something of rebellion, one who has spent most of his life wiggling around the rules and doing the blessings of an angel despite the risks. One who asks Aziraphale to run away to the stars they came from without knowing he cannot fly to them anymore. One that loves humanity more than even Aziraphale. \n\n\n            And at the last, when the angels order him to fight, Aziraphale understands that he has been waiting for so long to fall that he never realized he could leap. \n\n\n            He touches his fingers to the Earth, and follows his heart home. \n\n\n            She has never yet been prouder. \n\n \n \n            It's not obvious at first.\n           It's been ten years and the flow of angels and demons retreating to Earth has been slow but steady the entire time. Some of them are excited. Some of them are tired. Some of them have lost faith and know nowhere else to turn. Lucifer is gone and God hasn't answered anyone in a decade.\n           Crowley notices only because there is an ex-demon across the street from Aziraphale's bookshop.\n           They often come in groups and dissipate. They have spread around the world, one town at a time, insinuating themselves into human culture in quiet ways. The globe in Crowley's study lights up with the location of every single one of them if he asks it to. He tracks their movement. They're not everywhere, not yet, but they're working on it. They will be.\n           Aziraphale is still inside, closing up. He isn't here to see what Crowley sees.\n           They have learned to live among the humans well enough. There are still underground meetings at Fred's salon. Crowley has gone to them, and they're always learning mundane things- cooking, cleaning, how to make phone calls. They learn about pets one memorable session. Animals can, it turns out, sense them, and they don't like that at all.\n           A human approaches the ex-demon at the crosswalk.\n           Aziraphale will be out soon, Crowley thinks. They're supposed to go to dinner.\n           The elderly lady places her hand in the ex-demon's, and he checks the road both ways before leading her gently across, one silver wing arched protectively around her where she cannot see it. But Crowley can.\n           The door behind Crowley opens, and he feels Aziraphale's warm presence. He glances over his shoulder and smiles, nodding to the duo now safely on their side of the street.\n           \"Have you noticed?\" Crowley asks.\n           Aziraphale follows his line of sight and joins him in a soft smile. \"Getting on quite well, I think. You know,\" he adds, closing the distance between them to stand at Crowley's side, \"humans have got legends about guardian angels.\"\n           \"They're not all angels,\" Crowley says.\n           Aziraphale hums thoughtfully. \"Just guardians, then.\"\n           \"Guardians,\" he agrees, even though none of that is what he'd meant for Aziraphale to notice. He motions vaguely around his own head, where he ought to have a snake coiled up the same way many of the other demons have frogs or lizards or bats or bugs. \"Look at his Aspect.\"\n           Aziraphale looks, and seems uncertain what he is looking  for, and then his eyes widen and his posture straightens. \"Oh my,\" he says under his breath. \"It's atrophied quite a bit.\"\n           Crowley nods, not touching his own where it lays curled beneath his ear, merely an ink shadow on his skin. \"They're really living in their bodies now. Letting go of the past for real.\"\n           Almost reflexively, Crowley threads their fingers when Aziraphale takes his hand. They both wave to the Guardian, who smiles and waves back before heading the other way down the street, toward where an ex-angel waits outside of a restaurant's door. Crowley tugs on Aziraphale's hand to get his attention, and then nods in the opposite direction. \"We'll be late for our reservation.\"\n           They will talk about what they have seen, and what it means, over dinner. They will wonder how they missed it, because even though it isn't obvious, he thinks, it is  important that they are healing. All of them, little by little, together.\n \n \n             A lifetime ago, she had given Crowley a key. He uses it. He brings an immortal car to life and it takes him where he needs to go, exactly as she had promised. She had given him imagination, and he uses it now. The car survives, instilled with the will to protect its owner, and Crowley reaches his destination unscathed. He must watch it crumble after, her first gift to him. He must watch one more piece of himself break. \n\n            A lifetime ago, she had given Aziraphale a sword. In an act of kindness and unmitigated cruelty, he had given it to a human. His gift, a bid for their protection, had introduced them to war. Now, she watches as an innocent child uses the same sword to banish War, and in doing so returns something more than just a sword to Aziraphale. She has watched him for six thousand years struggle with his faith. She has watched him lose it. She has watched him look at Crowley and, using the heart he made for himself, learn to believe in something of his own. \n\n\n            There, at the end of all things, Aziraphale holds Crowley's heart in his hands. For as much as Crowley has taught him how to use his heart, he has taught Crowley what it means to love a single thing above all others, by choice rather than compulsion, and it has put them in danger for so long that Crowley has learned how to protect precious things. \n\n\n            Both love and protection are necessary now, as Aziraphale begs Crowley to do something. Both are necessary now, if they are to prevent themselves being torn away from one another forever. \n\n\n            But a lifetime ago, she had given Crowley a moment out of time, and he is not above breaking the universe for Aziraphale's sake. He would sacrifice anything for love, exactly as she had known he must. Time freezes at his command. Only for a moment, only for an eternity, only long enough for them to tell Lucifer's son what Lucifer had refused to hear; you are meant to love humanity. \n\n\n            Lucifer's light vanishes forever, and she mourns. \n\n\n            Adam comes to her that night, as he has never done before, as he was always meant to do, after. \n\n\n            \"I was made to destroy the world,\" he says quietly. \n\n\n            \"You were made to love, for Lucifer knew no other way to create a living thing,\" she tells him gently. \n\n\n            \"What should I do now?\" Adam asks. He is unafraid to gaze upon her Light. The world will be in excellent hands. \n\n\n            \"Love them,\" she says. \"More than anything else, love them. They will find their own way, with love to guide and protect them.\" \n\n            \"Why didn't  you  ?\" he asks, a little hotly. \"You could have stopped all this. Don't you love them?\" \n\n            \"I have loved them since before they began,\" she tells him. \"But if I had saved them, they would have learned nothing. They would need saving forever.\" \n\n\n            He thinks about that, and he doesn't argue. He asks what will happen tomorrow, and she smiles, and deals him a single playing card. It is the king of hearts. She kisses his cheek the way human mothers do, and tells him that she will always love him before she sends him home. \n\n\n            When he wakes he will not remember, and she will never forget. \n\n \n \n            They are sitting on a bench in the park, the way they have done thousands of times. Across the lane, ducks and swans paddle in the dark, still waters, chasing the peas and pellets tossed to them by visitors that hope to look inconspicuous. Two years ago, Lozathis had gotten legislation passed to ban bread in the parks, and Vizith had helped get candy machines installed that dispensed pelleted food in exchange for the coin it took to pay for more. There are more waterfowl than ever, and Crowley has never seen their feathers so glossy and full of life.\n           It's the little changes that matter the most.\n           They no longer know all of the Guardians that have spread across the world completely. There are a few in town with whom they have become friends, but far more often than not, Hadriel coordinates the newcomers. Fred passed her shop to new hands in order to travel, setting up meeting shops in other towns. They both still text. Aziraphale leaves his outdated mobile at their flat and answers through Crowley, because he can, and because even decades later he still isn't very fond of technology.\n           \"Six more showed up today,\" Crowley says quietly. Aziraphale looks at him. \"I was over to see Hadriel about the- well.\" He waves it off. He doesn't want to spoil the plans he is making to take Aziraphale traveling. \"They got there as I was leaving.\"\n           \"And?\" Aziraphale presses, already having guessed there is more to the story.\n           \"And, they didn't look great,\" Crowley says, looking away. In fact, they had looked nothing short of haggard, eyes drawn and haunted. Hell had never been a good place, not by any stretch of even Crowley's imagination, but it had never made anyone look like that. \"Something's going on.\"\n           \"What did they say when you asked?\" Aziraphale says, not bothering to pretend Crowley doesn't care enough to pry.\n           \"Hell's half empty, and people are afraid to leave,\" Crowley says, letting his heart twist over the words. \"Imagine being afraid to leave Hell.\"\n           Aziraphale touches his hand, and Crowley looks back. \"Were you?\"\n           \"Terrified,\" Crowley says, without hesitation. \"But I had nowhere to go and everything to lose. Hell would have come for me. No one's come for any of them, yet.\"\n           \"I don't think anyone will, now,\" Aziraphale says. \"I spoke with one of the newer angels, a few weeks ago. He said that Heaven is in the same position, half empty and full of fear. Oh, Crowley- shouldn't we go to help them?\"\n           Crowley recognizes that tone, and almost reflexively opens his sprawl to Aziraphale, spreading one silvery wing to arch protectively around him where only they can see it. He knows he cannot protect either of them from this. \"We can't. We've talked about this. They have to make their own choice, or it will just start all over again.\"\n           It's been over six thousand years, and Crowley thinks he's just beginning to understand the way the Almighty had felt at the beginning. He cannot make someone's choice for them, no matter how much he cares. He can give them opportunities, and he can help them once they've decided, but they have to be the ones to choose their path.\n           Aziraphale leans into the invitation, resting his head on Crowley's shoulder. It is rare for him to show so much affection in public, and Crowley wishes he could hide them both from view for real. \"If- If both sides are halfway gone, that means half of everyone is here,\" Aziraphale says slowly. \"Do you still think there will be another war?\"\n           \"I think we're in it,\" Crowley tells him. \"I didn't realize what  kind  of game we were playing, but I don't think we  stopped playing, not for a minute.\"\n           They watch a pair of Guardians stop at the dispenser and trade coin for food. A group of ducks come to eat from their hands, unafraid of them any longer. Aziraphale sighs, and Crowley leans into him a little in return.\n           \"It's not exactly what I expected, from a war,\" Aziraphale says quietly. \"But I guess Sandalphon was right after all. You can't have a war without War.\"\n \n \n             Six thousand years prior, Crowley had swallowed an apple and left the garden with Hope in his belly. He remembers how it tasted, still. He uses it, when the world doesn’t end, to offer his heart to the angel that already has both hands on it. \n\n            When the world carries on, he sits on a park bench and instead of asking Aziraphale to go, he asks him to stay. Aziraphale follows him onto the bus and takes his hand for the first time, linking their fingers. They stay like that until the bus stops. Crowley doesn’t let go, even then. He holds on until the door of his flat closes behind them. \n\n\n            They stand in the doorway for too long and she knows exactly which precipice of emotion they stand upon. She knows how the tension must break, and the things that they will do in the heartbeats that follow. There is no time left for them to run from it. Heaven and Hell will come for them soon and if they cannot fight together, they will be torn apart. \n\n\n            Crowley is supposed to kiss him, but he doesn’t. \n\n\n            They stand in the entryway, heart to heart, until Crowley tips his head down, his forehead coming to rest against Aziraphale’s. \n\n\n            “I’m… glad it’s you,” Aziraphale says, voice wobbly. “I’m glad I get to spend my last night with you.” \n\n\n            “Don’t say that,” Crowley begs him, lids closing over golden eyes. “We’ll find a way. We always do.” \n\n\n            “Not this time.” Aziraphale’s hands come up to rest at the base of Crowley’s throat, fingertips on his skin, and she thinks surely now. Surely this will be their moment. “I don’t know about Hell, but Heaven won’t let me get away with what we’ve done. Not unscathed. Maybe not even alive.” \n\n\n            “I’d take your place if I could,” Crowley swears, his own hands coming up to circle Aziraphale’s wrists. “I’d stand up to Gabriel for you. And Michael. I’d stand up to all of Heaven.” \n\n\n            She thinks it is merely sentiment when he says it, but she watches in wonder when they figure out how to do exactly that. She watches them spill themselves into one another in a way she had not expected, mingling their cores just enough to allow them to wear one another’s faces. Just enough for an angel to willingly face Hell, just enough for a demon to find his way back to Heaven. \n\n\n            Just enough for them to survive without the fight she had expected would be so necessary. It is the first time she has ever truly been surprised, the first act of real free will among the angels or the demons. It is the first step that they take on their own paths, and they take it together.\n\n\n            They are wretchedly clever creatures, she thinks, smiling down upon them as they sleep.\n\n\n            And by far her favorites. \n\n \n  \n           On the 50th anniversary of the day the world did not end, Aziraphale closes the bookshop indefinitely, and Crowley takes him to see all the kingdoms of the world. They aren't nearly the same as they were the last time Crowley had traveled so well, and there aren't many kings anymore, but Crowley thinks maybe that's not so bad. Kings weren't a very good idea in the first place.\n           They stop in locations both familiar and unknown, and almost everywhere they find a Guardian waiting for them. The Guardians have permeated human civilization, watching over them, protecting them from whatever remains of Heaven and Hell. It can't be much- just the last, dying remnants still clinging to old ideals. Traces of the past linger, in tattoos on faces and hands, in the flinch from a too-bright light, in the haughty use of pride, but they are ever-fading.\n           They visit an expansive community of Guardians in the south pacific. Humans have moved into the town the Guardians founded for themselves, and they call it a haven. It is safe, here. Crowley takes Aziraphale to a quiet little restaurant with the best food in town, and Aziraphale can hardly eat for wallowing in the sensation of love all around them.\n           \"Do you think they'll ever find out?\" Aziraphale asks him that night, when they are stretched out on the roof of their inn, staring up at stars they can no longer reach. \"About all of this? About us?\"\n           \"Maybe,\" Crowley says. He thinks that it's been over six thousand years and the humans still believe angels and demons are just myths, but it had taken Aziraphale most of that time to figure out Crowley loved him, and that hadn't even been a  secret. \"Maybe we'll tell them, ourselves, someday.\"\n           When they return from their travels, Adam finds them. He had only known the location of the bookshop, and had rented a flat nearby. He doesn't look a day over twenty five, despite that it's been decades, and they can both see the slender, bat-like wings he keeps just out of view from the humans. They take him to lunch at a diner so far out of the way no one cares about their business, and ask him what's happened.\n           \"They just came on overnight,\" Adam tells them, holding his wings out for inspection. \"I think it was just time.\"\n           \"Time for what?\" Crowley asks, cautious. They had done so well that it seems a shame to end it all here because Adam has changed his mind about the end of the world.\n           \"To stop being mortal,\" Adam says, the way a person might announce it is now time to get out of bed.\n           \"You think you've died,\" Aziraphale says, a little mystified. They had sort of expected it someday, with him having a mortal mother, but they had expected it would lengthen his life rather than shorten it.\n           \"Must have done,\" Adam agrees. \"Death never came back for me, though.\"\n           Crowley sits back in his chair with a small noise, impressed. \"What are you going to do now, then?\"\n           Adam looks down at his hands, folded on the table. \"I thought I might stay near you,\" he says, a little hopefully. \"We stopped the world from ending together, once, and... well, I've seen what you're doing to keep it going. I know what you're doing to Heaven and to Hell.\"\n           \"And what's that?\" Crowley asks.\n           \"Healing them,\" Adam says, looking up to meet his eyes. Crowley hasn't worn sunglasses in years. \"Bringing them together, the way I want to do for the humans. It just seems like we should work together, too.\"\n           Aziraphale reaches out one hand, palm up, and Adam unfolds his slender hands and places one of them in it. \"We stood at your side once before,\" Aziraphale tells him gently. \"I think I should like to do so again.\"\n           Adam smiles, and it is just as bright as when he was a child. The world had not dulled him at all during his time in it. \"Can I ask you something?\"\n           \"Anything,\" Aziraphale says. \"I may not have an answer, but you can always ask.\"\n           \"Do you think I did the right thing, letting them all be?\" Adam motions around them vaguely, encompassing all of human kind. \"I had the power to change a lot of things. To fix everything for them.\"\n           Aziraphale smiles and looks over at Crowley, who just gives a helpless little shake of his head. \"I think you did,\" Aziraphale tells Adam earnestly. \"It just didn't look how you expected fixing things to look.\n           \"You gave them a chance to make their own choices,\" Crowley adds. \"And we've given them the safety to do it. That seems right to me.\"\n \n \n\n            She had planned on most of it. She had known that they would come together in the beginning and that the serpent would stay near the angel until the end. She had known that they would put themselves between humanity and its destruction and that if they were brave and loyal and loved one another in any way one creature could love another that they would succeed. \n\n\n            She had known that they would come together afterward, and stay together. \n\n\n            She had known that others would follow in their footsteps. \n\n\n            She had seen how they would change the world. \n\n\n            What she had not seen was how they would change themselves. \n\n\n            When Aziraphale plucks the first grey feather from his wings, she very nearly ruins six thousand years of planning to stop him. When Crowley claws the gleaming grey primary from his wingtip, she must keep herself from appearing to him to tell him she had no hand in it. She would have left them as they were, dichotomous and ethereal. \n\n\n            But they had mixed essences and there are consequences for such an action. The ether-black of Crowley’s wings dull with white, and the flame-white of Aziraphale’s muddy with black. Both of their wings take on the qualities of Earthly creatures, to declare their loyalties to all who would look upon them. \n\n\n            Declaring them to be on their own side. \n\n\n            Although, she muses as the first angel arrives, perhaps not as much of their own side as they had expected. Certainly more of their own side than she had expected, when Hadriel’s wings begin to change grey on the sheer magic of belief that they should. Hadriel believes that he has chosen the pigeon-winged Guardians and their spinning blue marble, and so earns his own grey wings. \n\n\n            The plan, such as she had made it, does not stray far from the path she had set it upon. The new paths the players have chosen still follow alongside the old ones laid out for them before the beginning, heading inexorably toward the game’s end. \n\n\n            But as a certain ex-demon had once proclaimed, as long as they have to go, they will do so in style- and it is a style which suits them very much indeed. \n\n \n \n            She comes to them in the early evening, tapping timidly upon the door to their flat. Crowley and Aziraphale share a look over their dinner. In a hundred years, no one has come to their flat. New arrivals turn up at the bookstore, or at Hadriel's welcome center downtown, but never here. Never privately.\n           \"Crowley, no,\" Aziraphale says when Crowley starts to rise to answer it. \"It could be Gabriel, or Michael.\"\n           Crowley gives him a helpless look. \"It almost has to be,\" he says, because everyone else is here. Twenty million Guardians, give or take a few, have settled all over Earth. There is hardly anything left to protect the humans  from.\n           \"Then I should answer it,\" Aziraphale says, setting his napkin beside his plate as he rises as well.\n           \"Together,\" Crowley amends, and receives no protest.\n           It is not Gabriel, or Michael, or anyone that either of them even knows, though she is an angel. She folds her pristine white wings behind her back and doesn't look at them. \"Michael said I should come to join you, if I wanted,\" she tells them quietly.\n           \"Is that what you want?\" Crowley asks.\n           \"Yes,\" she agrees quickly. \"It's just- I didn't want to leave them alone.\" Her glance darts quickly between the two of them before dropping. \"I'm the last one.\"\n           \"The last angel?\" Aziraphale says, concerned. She nods, and he meets Crowley's worried eyes. They cannot possibly have collected  all of the others. \"And where is Michael now?\"\n           \"Heaven, still,\" she admits. \"With Gabriel. They're all that's left.\"\n           \"Oh dear,\" Aziraphale says. He pulls the door open wider, past Crowley's silent protest. \"Would you like to join us for dinner? You look as if you could use a place to rest, and we've just sat down, ourselves. Crowley makes a lovely ratatouille.\"\n           She finally braves a real glance up to find them both smiling. Aziraphale wonders if she's ever seen a genuine smile in her life, much less from one who had been a demon. Whether she has or not, she nods. \"Thank you,\" she tells them, straightening as if a weight has been lifted from her shoulders. \"I would like that very much.\"\n           They part so that she may pass between them, and Aziraphale catches Crowley's worried gaze. This is it, then. They've reached the end of a war they didn't have to fight, and come out unscathed and alive. They have made the impossible possible, together.\n           \"I'll set another plate,\" Crowley says, running a reassuring hand down Aziraphale's arm before releasing him. \"It's going to be okay.\"\n           Aziraphale nods and follows after him, trusting.\n \n \n             The game is nearly over and Heaven holds only two lonely angels, seated at a table. The deck of cards between them is arranged in a game humans call war. She has not spoken to either of them in a century. They have called for her every moment. \n\n            A chime sounds, and Michael and Gabriel look up in unison. Beelzebub steps from within a fiery doorway, patting down their smoking suit. The Archangels do not seem surprised, but Beelzebub does. Perhaps they expected a different reception. \n\n\n            \"Are you all that's left?\" they ask, peering around. \n\n\n            \"There's still two of us and only one of you,\" Gabriel tells them, though he makes no move to rise. He has never been afraid of demons. \n\n\n            \"I haven't come to fight.\" They hold their palms out, and look around again. \"There's no one left on my side either. They've all gone to join the Guardians on Earth.\" \n\n\n            A pained expression crosses Gabriel's face. \"I hate that. There should have been a war.\" \n\n\n            \"If it's any consolation, you've won at attrition,\" Beelzebub offers. \n\n\n            \"It's not,\" Gabriel says, and Beelzebub shrugs. It is the only consolation they have ever offered. \"You're going, too?\" \n\n\n            \"Seems... inevitable,\" Beelzebub says. They have always been heading toward this, all of them. It has taken some longer than others to realize it. \n\n\n            \"I think it was,\" Michael says, finally. \"I think she always wanted this. All of us on the same side by choice. She asked us to love them a long time ago. I don't think any of us realized what that would take.\" \n\n\n            \"Some of us did,\" Beelzebub says. \"Two of us did.\" \n\n\n            Gabriel rises. \"Well. I suppose that's it then. There's no reason to stay, if there's no one left to fight.\" \n\n\n            Though he glances at Michael, he doesn't ask Michael to come with him. He knows better. Instead, he ushers Beelzebub out, and they disappear. Michael sits at the table, staring at the abandoned cards. He begins to clear them, stacking the cards one by one in a neat pile, face down. There are 51 of them. He knows which one is missing. \n\n\n            \"I have never stopped loving you,\" Michael says to the empty room. \n\n\n            \"Love was never meant to end,\" she tells him gently. He looks upon her Light, and he nods a little, resigned. \"It was the first to exist and it will be the last.\" \n\n\n            \"Where will you go?\" he asks. \n\n\n            She lays her hands upon his temples and kisses his forehead, so proud of him. \"Where I have always been, Michael. Within all of you who choose to love me.\" \n\n\n            When Michael leaves, he closes the door to Heaven behind him, and with no one left to believe in it, it dissolves as if it had never existed. \n\n \n \n            \"Hell is empty and all the devils are here,\" Crowley mutters just loud enough to be heard by Aziraphale.\n           Aziraphale looks up as if he expects to see Shakespeare. His eyes land upon the two newcomers to the park instead. Gabriel, and... Beelzebub. They have arrived together and look uncomfortable in the sunlight as they approach Hadriel like tourists looking for directions from a stranger.\n           \"That  can't be a good sign,\" Aziraphale says, folding his book closed and setting it on the bench beside him. The last time they had seen those two together, they had been trying to end the world. Hadriel, bless him, had done phenomenally with all of the new arrivals so far, even Uriel and Sandalphon and Dagon, but Gabriel and Beelzebub are too much.\n           \"No,\" Crowley agrees, already on his feet. Gabriel spots them, and nudges Beelzebub, who looks up sharply. \"Come on, then. Better get whatever this is out of the way.\"\n           Aziraphale purses his lips and walks beside Crowley, both of them keeping their wings folded in the least threatening way possible. Hadriel seems relieved when he glances at where Gabriel and Beelzebub are staring, and sees backup. The newcomers trail to a stop a few feet away, enough distance between them to allow swords to be drawn.\n           \"Gabriel, Beelzebub,\" Crowley greets, a little too sweet to be sincere. \"What brings you to our neck of the woods?\"\n           \"It's a park,\" Beelzebub says, and continues before Crowley can explain what an idiom is. \"We've come to... join you.\" They say it as if it leaves a bad taste in their mouth. Aziraphale wonders how they can tell, given what else is in their mouth, but he doesn't say so aloud.\n           \"Because you want to, or because you have to?\" Crowley says. \"This only works if you want to.\"\n           Beelzebub spreads both of their wings and tips them down, so that Crowley can see the mottling of grey feathers coming in already. He looks up and meets their eyes. \"I have wanted to come here for a while,\" they say quietly. \"But I did have responsibilities to the others. I remember all the same things about before as you do.\"\n           \"That seems very unlikely,\" Crowley tells them, and Aziraphale can tell that something else is going on than just an argument about before their respective Falls.\n           \"Crowley,\" Aziraphale says gently, not quite a reprimand, and Crowley stands down immediately. Aziraphale steps forward and holds out his palms, an open gesture of peace. \"If you come here willingly, then we welcome you, Beelzebub.\"\n           \"Ba'al,\" they say, holding their palms out as well. \"It is good to have a home again.\"\n           Aziraphale turns to Gabriel. \"And you, Archangel?\"\n           Gabriel stares somewhat stubbornly at him. They were ranks and ranks apart in Heaven, and Aziraphale feels every one of them. But Gabriel's eyes slide over to Crowley, and something passes that Aziraphale doesn't entirely understand.\n           \"Just Gabriel, I think,\" Gabriel finally says, accepting his place on Earth.\n           Then he nods to something behind them, and Aziraphale turns to look in time to see Michael stepping from a glowing slit in the fabric of reality. It twinkles brightly for a moment after he is clear of it, and then winks out.\n           Everyone gathered lets out a breath, as if they had all been punched in the gut at exactly the same second. Aziraphale feels the raw wound where his connection to Heaven used to be, the silent darkness that floods in behind where its light used to sit. Truly, there is no one left to leave the light on. Heaven is gone and, if Crowley and Ba'al's reactions are anything to go by, Hell has ended as well.\n           Crowley recovers first, still breathing harder than usual. \"That's it, then.\" He glances to Michael, who is making his way over to them. \"That really is all of us.\"\n           \"No more Heaven, no more Hell,\" Gabriel says. \"You've gotten rid of them.\"\n           Aziraphale gives him as much sympathy as he can, given the circumstances. They have both lost something precious. \"No, I don't think so,\" he says quietly. \"I think that was always the plan. She wanted us to find each other on our own. She wanted us to come to them, and to protect them. Heaven and Hell were meant to be temporary.\"\n           \"You sound like Michael,\" Gabriel says, more than a little bitterly. He may take some convincing to be happy about his choice.\n           \"Then it sounds like Michael belongs here, too,\" Aziraphale says tartly. \"And he's welcome, if he wishes to actually help the humans.\"\n           \"She told us to love them,\" Crowley says, like a revelation, seemingly lost in thought. The words have the distance of describing an almost-forgotten dream, or quoting a book one barely remembers. \"More than we loved her.\"\n           Aziraphale glances over at him, worried about that tone of voice. \"Do you think that's what we're doing? Giving up our love for Her in order to love them?\"\n           Crowley smiles, the sort of smile that only comes from knowing one should not know a thing, and being justified in knowing it anyway. \"I think they're the same thing, loving Her and loving them. I think that we love Her  by  loving them. I think  that's what She intended.\"\n           Aziraphale reaches one wing out to brush against the edge of Crowley's, their greys mixing at the point of contact. Michael is walking toward them now, steady and sure and, if Aziraphale is honest, a little sadly. He cannot blame Michael for that. It is possibly the most difficult thing in the world, to leave behind something beloved, even if it is for something better.\n           \"You know, I think you're right,\" Aziraphale says, watching Michael approach.\n           As soon as Michael arrives, Crowley stiffens and Hadriel all but disappears behind them. Even Gabriel and Ba'al look uncertain of what will happen next. Aziraphale alone stands exactly as he had been, sure of himself. He had fooled Michael once before. He had seen fear in Michael's eyes. There is none now.\n           \"Michael,\" Aziraphale greets. It isn't warm. He's not sure he can be  warm to this particular angel. Michael had meant to kill Crowley, and even the distance of a hundred years from the act had not cooled Aziraphale's temper over it.\n           Michael nods to him, folding his hands in front of himself. \"Aziraphale.\" He looks at Gabriel and Ba'al, and at Hadriel standing a few feet away, and finally his gaze settles upon Crowley. \"Heaven is gone.\"\n           \"Hell, too,\" Crowley says, almost nonchalantly. Ba'al buzzes, but doesn't actually speak up about it. Everyone is watching Michael and Crowley, and Aziraphale wonders if any of the others know what's going on, exactly.\n           \"She should never have cast you down, Raphael,\" Michael says, and alarm bells begin to ring within Aziraphale. \"She should have known you'd take everything down with you.\"\n           Raphael.\n           Aziraphale turns to gawk at Crowley, but Crowley only stares levelly back at Michael, unflinching. \"She did know,\" Crowley says. \"That's why she did it. And it's Crowley, now. You know that.\"\n\n            Raphael? \n\n           Michael is not one for jokes, Aziraphale knows, and Crowley wouldn't joke with Michael, of all people, and that means that it is true. Aziraphale had known Raphael was cast down with Lucifer, but no one had heard from him since. Theories had abounded that he had perished in the Fall, or shortly after it, but apparently the rumors had been wrong. And if they are wrong, if Crowley had once been... Aziraphale looks from him to Michael. If it is true, then with Lucifer gone and the Almighty MIA, Michael and Crowley are the two oldest creatures alive at all. It suddenly makes a lot more sense, why Michael had retreated rather than stay to watch Crowley be destroyed.\n           Michael bends his head in acquiescence. \"An Earthly name.\"\n           \"That's the deal,\" Crowley says. \"Take it or leave.\"\n           For a long moment, Michael is silent. He studies Crowley, and then Aziraphale, who nearly squirms under the new pressures of the situation. Then Michael gives a soft huff through his nose, and holds out his hands, palms up. \"I came willingly,\" he says. \"We belong here, with them. We always did.\"\n           Crowley relaxes considerably. He glances over his shoulder, and beckons Hadriel over. \"Take them to the welcome center,\" he says gently. \"Get them set up nearby for now, until they decide where they want to go. They'll be your last.\"\n           Hadriel forces a smile, and then straightens up. \"Come along, then,\" he says to the three new arrivals. \"I'm sure we can find you someplace to call home.\"\n           Crowley and Aziraphale watch them go, Michael beside Hadriel, Gabriel beside Ba'al, until they are well out of earshot. As soon as they are, Aziraphale rounds upon Crowley, who looks like he knows exactly what is about to happen.\n           \"It's a long story,\" Crowley says at the same time as Aziraphale hisses: \"Raphael?\"\n           Crowley smiles, too fondly for the tension of the moment, and holds out his hand for Aziraphale's. \"I didn't begin to remember until recently,\" he explains carefully, almost fragile, and Aziraphale knows how much Crowley's past has always meant to him. \"But I will tell you all of it, if you give me time.\"\n           Time.\n           Aziraphale's heart catches in his throat at the idea. They  do have time now. They have all the time in the world that they saved, together. They have all the time they could ever want, and Aziraphale finds he is very much looking forward to spending it with Crowley.\n           \"You waited for me, once,\" Aziraphale says softly, placing his hand in Crowley's and twining their fingers together. \"I believe I can manage to do the same for you.\"\n           Crowley's smile speaks of relief and love and hope, and it is the most beautiful thing Aziraphale has ever seen. Then, with a bit of dramatic flair, Crowley presents the path before them with his free hand. \"Lunch?\" \n \n  \n\n            They have exceeded her every expectation. In the beginning they had loved because it was all they knew. Because they had been made for it. In the end, they have chosen love anyway. They have found the sacred in the mundane. \n\n\n            Her game, at last, has ended, and the next hand is theirs to deal. \n\n\n   \n\n \n\n There are these three things that endure: \n\n\n Faith, Hope, and Love, \n\n\n\n\n\n\n             He steps into the ether for only the second time in his life, this time with his wings out and his full power returned. Here he is weightless, barely contained within the idea of the form he should have. Since She had left it, this place has called to him, desperate for some way to fill an unfillable void. \n\n\n             Her tools lay where She had left them. He brushes careful fingers over each one, over love and devotion and patience. They are covered in stardust, long since abandoned, and he rubs his fingers together to feel the grit of it, feel the grainy atoms roll over his energy. \n\n\n             Before he had come, he had thought the universe might be sleeping without Her to tend to it, but as he wanders through the cosmos, he finds it alive. Star systems spread out at his behest, baring their maker’s mark. He places both hands in the echo of his father’s touch, presses until he can feel Her love beneath it. \n\n\n             There are other creations. \n\n\n             He sleeps cradled in nebulae painted into the void by Crowley’s brush and warms himself by Michael and Gabriel’s many glowing stars. Planets spin in intricate dances around him, ones marked by Ba’al and Uriel and Dagon. He finds the second star She had ever made, and cries at the love he feels within it as he cups it in both hands. \n\n             At the very limit of the universe he finds a massive creature made entirely of energy, sinuous and throwing off flares like a sun. It coils around his arm and hums and crackles and arches into his hand like an eager cat, and he thinks perhaps it might have been, once. It might have been any number of animals, its energy salvaged by Her to be crafted into something new and wondrous, set free here for the humans to find later, when they are ready.  He watches it go on its peaceful way, and thinks about the universe She has left to them, everything She had created and everything She had left behind. \n\n             There is work yet to be done. \n\n\n             He returns to her tools, and lifts the first; love. \n\n\n             It is warm and heavy and worn with use, and with it, he begins. \n\n \n \n            There exists, beneath a church long despoiled of sanctity, a room with a single table. It is a sturdy and round thing, flecked with the damage of years of use, its edges worn smooth from all the bellies that have sat against it. There are six today, seated in pairs and staring anxiously at one another. Two of them have been here before, but only once; only while looking for a place to bring the others.\n            A very long time ago, these six might have gathered together as associates, at least, if not friends, if not siblings. In a time much less long ago, they might have gathered together as enemies. Today they gather as allies, their wings not white, nor black, but as grey and varied as the pigeons that cover the church’s courtyard, waiting to be fed.\n            Today, these six need one another.\n            Today, the  world  needs them.\n            “What if we just… remade Heaven and Hell?” Ba’al asks, breaking the silence that has settled so uneasily among them after Crowley dared to voice the problem. “Can’t be that hard.”\n            “That does defeat the point a bit,” Aziraphale tells them. “Don’t you think?”\n            “It’s a little close to treading in her domain,” Michael says.\n            “Well they’ve got to have  somewhere  to go when they die,” Gabriel says, with a bit of a huff. He straightens his jacket and ruffles his slate-grey wings. They look good on him. They match his suit, or perhaps he had chosen the suit to match them. “Can’t have them just floating around in between.”\n            “And the paperwork’s a nightmare,” Dagon adds. “Can’t file anything until they have a final destination, and they’re all just sitting around in limbo now. I’ve half a mind to start a file and just call it limbo! Then they can all just stay there.”\n            “They can’t,” Gabriel argues, affronted. “They barely fit as it is. They’ve got to have somewhere to go.”\n            “We cannot go around creating new spaces, either,” Michael says firmly, pale grey wings opening a little for emphasis. Crowley traces his eyes over the soft, powder-blue patterns that have been dyed into the feathers. Someone has made use of the wing-tattoo parlors. “Lucifer tried, and look how that turned out.”\n            “He was angry,” Crowley says finally, hoping to halt the argument before it nattered off into pettiness. “If we did it - and that's a big if - if we did it, we’d be doing it carefully. We could plan it better.”\n            “But that won’t actually solve anything,” Aziraphale says quietly. Everyone looks at him and he shifts a bit uncomfortably before straightening up. He has been coming into his own as a leader lately. “The reason Heaven and Hell existed was because the humans needed to choose a side. Their choice decided where their soul would go once they died. But there are no sides now. There’s only us and them. Separating them up again just… it just seems like it would go against her plan.”\n            “So? What of it? She’s gone,” Ba’al sneers, very nearly covering up the ache in their voice. “And I doubt she’s coming back.”\n            “She’s still  here,” Aziraphale says stubbornly. “I can feel her, even if you can’t.”\n            “But she’s not  here  here, Aziraphale,” Crowley says gently, and Aziraphale deflates some. It’s been three months since she left them entirely to their own devices. Three months since they’d had the sort of terrifying freedom none of them know quite what to do with. “The way she- well, she can’t help us. Not the way we need. We have to figure this out ourselves, not count on her to save us.”\n            Silence falls again as they wallow in the truth.\n            They are on their own.\n            “Has anyone… seen Adam, lately?”\n \n \n\n             At first, he only copies. \n\n\n             He models worlds after those he finds, following their make. Soon, he makes changes to them as he goes. He sets a trio of planets spinning around a golden star, all of his own making entirely, only to watch them crash and crumble. But he learns. With every mistake, he learns. \n\n\n             He sculpts and he presses and pushes and slides his hands through the raw firmament She left behind. He creates things of his very own and then snuffs them out when they do not meet his expectations of them. He knows what he wants, can feel what it should be, and yet he cannot make it. \n\n\n             In desperation, he carves out spaces within spaces, as Heaven and Hell had been, but he only ends up filling them in again. They are not right. They are not what he needs. \n\n\n             He is frustrated. \n\n\n             He had been made for this. \n\n\n             The first and last time he had seen Her, She had told him that he was not made to destroy them, nor to save them, but to love them.\n\n\n           To guide them. \n\n\n             And it is in those words that he knows what must be done. \n\n \n \n            “We cannot just  destroy  human souls,” Aziraphale says hotly, as soon as Ba’al suggests it a while later.\n            “It wouldn’t be  destroying  them, exactly,” Ba’al says. They’ve come a long way in the department of imagination – all of them have – but they certainly haven’t come close to Crowley’s clarity in the matter. “We’d just be… dispersing them.”\n            “It’s not a bad idea, Aziraphale,” Crowley says, sliding into the argument before Aziraphale can get truly irate over it. “She made them up from firmament, they may as well go back to it.”\n            “That wasn’t her plan, and you know it,” Aziraphale says, voice icy with judgment.\n            Crowley pulls a bit of a face, not sure rescuing Ba’al is worth Aziraphale’s wrath, no matter if he actually agrees or not, but he's come this far he may as well keep digging. “Well, she’s not exactly going to tell us no, is she?” he asks. “If she wanted to have a say, maybe she should have stuck around.”\n            “Crowley...”\n            “I agree,” Michael says, surprising all of them. He keeps his hands folded upon the table, and even though it is round, he gives the impression of being at the head of it. “It’s not a bad idea. But I also agree we cannot use that as a first resort. Aziraphale is… correct. I don’t think she would want that.”\n            “Can’t we just- just, put them back in?” Gabriel asks, mashing his hands together like he is pushing two objects into one another. “The humans are good at making more of themselves. Why don’t we just… you know?”\n            Silence descends as they all stare at Gabriel. He stares back as blankly as ever, confident in his disdain and exasperation. Aziraphale clears his throat and shifts to sit up a little straighter again, looking uncertain that he completely understands.\n            “You want… to take all of the souls in limbo, everyone that’s ever been in Heaven or Hell… And put them back on Earth in new bodies?” he asks hesitantly. “As babies?”\n            “Yes,” Gabriel says. “That is exactly what I want, Aziraphale.”\n            “Everyone?” Crowley reiterates. “All the best and the worst, back down there together at once?”\n            “Yes,” Gabriel repeats. “More importantly, out of limbo. That is the goal, isn’t it?”\n            More silence prowls through the group, seizing voices and motions.\n            “It’ll buy some time,” Dagon admits quietly a few minutes later. “And it’ll solve the other problem, where we can’t create new souls either. The humans would start having babies again.”\n            “It won’t solve it forever,” Crowley points out. “We’ll still run out of souls eventually.”\n            “It would buy time to figure out something else but… would it even  work ?” Michael asks, brow furrowed. “Recycling human souls like that, letting them go back to Earth to go through it all again…?”\n            “Don’t see why not,” Dagon tells him. “It’d just be like… like recorporation, but for humans.”\n            “Reincarnation,” Aziraphale says faintly. They’d never done it before; humans only ever got the one chance to make their choices. If they could go back, do it all over again… “They already have a word for it. Reincarnation.”\n \n \n\n             The answer, he finds, is simple. \n\n\n             There is already a Garden. \n\n\n             She had crafted it for them before they existed and walled it in to protect them from the unknown. As had his ancestor before him, Adam steps foot in the lush garden of Eden for the first time. The gates have remained closed since the first humans left, but the garden has not faltered. Everywhere plants grow, of every make and size, and as he walks he is greeted by a multitude of animals. Many of them he recognizes. Some of them have long-since gone extinct elsewhere. A few, like the unicorn upon whose soft nose he lays a hand in greeting, he'd thought had never really existed.\n\n\n             And, at the very center, there stands a single apple tree, in full blossom. \n\n\n             This, he knows as he gazes upon it, is where they had begun. \n\n\n             This is where they belong. \n\n\n             This is where they have always belonged. \n\n\n             Four angels land nearby, two to either side of him. He glances first one way and then the other, and notes their pure white wings. These are the last true angels, left here to guard the gates of Eden. They had been barred from Heaven when their vigil began – so they would have no divided loyalty – and they have remained here ever since. \n\n\n             “You have guarded these gates for millennia,” he says gently. It is not a question, but a reminder. “It is time to stop.” \n\n\n             “We must guard the walls,” they say, a chorus of voices that number more than the bodies present. “As She ordered us to do.” \n\n\n             “She has left this world in different hands,” he tells them. “My hands. And it is time to take down the walls, and use the stone to build a path for them, instead.” \n\n\n             They stare, and he can hear the muted whispers of their minds as they speak to one another, but he gives them the courtesy of privacy. Their many wings fold as they reach a conclusion together. “She has left us?” \n\n\n             “But you are not alone,” Adam says, reaching out to them. They are warm, in the way that a voice is warm rather than a fire. “I would ask that you place your faith in me, now. I will send hope to you soon, and with it a new task.” \n\n\n             “A new task?” they ask, and he can feel their eagerness to obey, ingrained as it had been in all angels once. He will see it fade. They will know free will soon. \n\n\n             “Welcome them home,” he says. “When they are ready.” \n\n \n \n            For a while, their plan works. For a while, they put souls back into human bodies, and, for a while, the pressure eases in the spaces between reality and oblivion. At first the humans panic at the months there are no births, and further at the severely-lowered birth rate that follows, and they search for a cause within themselves. When they can find none, they turn to the world, and begin to try to fix it. They believe they will be extinguished if they do not. They learn and they grow and the world heals a little more every day. \n            But it is  only  for a while.\n            They are acutely aware that their plan to place old souls in new bodies is merely a bandage on a mortal wound. The number of souls is limited. Eventually, there can be only one end. Eventually, there will be no more souls to add to bodies. Eventually, all of the souls will be present on Earth.\n            Crowley does not give voice to the suspicion that that is the point.\n            Aziraphale does the math, counts the souls, and finds there are not nearly enough souls for them to have been unique through all of time. He does not say anything, either.\n            But neither of them are surprised to find Adam sitting inside the bookshop late one night, looking for all the world like the child he had been when they first met him. Aziraphale shakes out his umbrella, and Crowley locks the door, and Adam turns a page, waiting. It’s been well over a century since they last saw one another.\n            “Adam,” Aziraphale says, and Adam looks up as if noticing them for the first time.\n            “I’d forgotten about books,” Adam says, wonder in his voice. He sounds… different. The tone straightens both Guardian’s spines. “I suppose I’d forgotten about a lot of things.”\n            “Where have you been?” Aziraphale asks, holding out an arm to keep Crowley from going past him.\n            “Would you like to see?” Adam says brightly.\n            He doesn’t wait for an answer. Reality gives a sickening twist around them, and they pop out exactly as they had been but miles and miles from home. Crowley’s sense of location is so badly skewed he cannot tell  where, exactly, Adam has taken them, only that it is  far.\n            And that Death is here.\n            Crowley’s wings flare, taking up most of the space in the small home, but Death pays him no mind. It is watching a woman across the room, a human who is somehow braver than she is old, to be standing so calmly before the four of them without flinching. Aziraphale touches Crowley’s arm, and calm spreads through him. Perhaps this is not a fight. Perhaps Death is only here to take the human.\n            Adam steps forward and Death nods to him, nearly a bow, and then Adam stands before the woman. She gazes at him the way an old friend might, even though Crowley is certain they have never met. They can’t have; Adam has been gone from Earth since before her birth. But when she smiles, Adam smiles back, and Crowley thinks there is something familiar about the exchange.\n            “Are you ready?” Adam asks.\n            “I think I have been, for a while,” she says. Gently, she sets down the mug of tea she holds in both hands and straightens her clothing a bit, and then squares the shoulders of her time-bent frame.\n            Adam glances over to Aziraphale and Crowley, but not in a bid for reassurance. He wants them to watch. They both give small nods; they have come this far, they will watch what comes next. Crowley suspects he knows what it is; he and the others had decided they could not dissolve a soul, but that did not mean no one could. Aziraphale’s hand finds his and squeezes, and Crowley knows they are thinking the same thoughts. This is it. The beginning of an end. They had put it off as long as they could.\n            Shuffling closer, Adam places his hands feather-light to either side of the woman’s face. Her eyes slide closed and she leans forward at the same time as him, until their foreheads touch, just so. Crowley holds his breath, anticipating what comes next, but it doesn’t happen.\n            Behind her, slate-grey wings unfold instead.\n            Crowley’s eyes widen and next to him, Aziraphale tenses.\n            Adam pulls back first, and the woman’s eyes blink open.\n            No, Crowley thinks. Not a woman. A Guardian.\n            Adam has made a brand new Guardian, from the soul of a human who was ready for it.\n            And with a start, Crowley realizes he recognizes her now, with her mortal facade broken wide open.\n            Adam's hands fall away from her face as he steps back, still smiling. Then he twists a little, so that he may look upon Crowley and Aziraphale. “I trust,” he says quietly. “that you both remember the way to the Garden? I promised that I would send you with her.”\n            Crowley nods mutely as Aziraphale says: “Yes.”\n            “I’ve made a few changes,” Adam warns them. “But I think you’ll like it there.”\n            They had seen Adam make  a few changes  before but it had certainly not led them astray then, and it seems unlikely to lead them anywhere bad now. Aziraphale holds out a hand to the new Guardian. “Come along, Anathema. It's time to go home.”\n \n \n\n             Eden escapes the borders which once contained it, traveling out into the sands on the ghost of Adam and Eve’s trail. It spreads the way life is wont to do, slowly at first and then in great bursts as it learns. The arid soil surrenders to the growth, becomes richer and thicker with every plant that falls in Eden’s joyful conquest. The wall which once was built to contain and exclude has become a pale slice cut down the middle of it, a great stone river leading to its heart. \n\n\n             Walking atop that river travel three winged figures. \n\n\n             They have all traveled through the millennia of existence, one day at a time, their paths crossing as they went. They all had once traveled from Eden to Earth separately, and now they travel back, walking this new path one step at a time. This time they travel together, these two kinds of firsts, until they reach their destination. \n\n\n             Four angels meet them at the edge of the greenery. They appear to be cherubim, with four heads and four wings and a glowing halo around their body that casts off golden light. They appear to be cherubim, except that they no longer stand upon a wall to guard a gate, and their wings are grey, and their eyes are the exact shade of blue that once belonged to a young boy in Tadfield, England. \n\n\n             These are no longer cherubim. They are not quite Guardians, either. \n\n\n             These ones have sworn themselves to Adam, to guide his people home.\n\n\n             They welcome the trio not with swords, but with warm words and soothing tones and gentle, long-fingered hands. One of them takes the hand of the newest Guardian and leads her away from the stone path, out into the garden. It has been a long time since she left with Adam at her side, her belly full of life and the taste of an apple still sweet on her tongue.\n\n\n             The other guides recognize Aziraphale and Crowley and say nothing when they pass. It has been a long time for them, as well. Crowley offers his arm to Aziraphale as they walk, and Aziraphale takes it gladly. Together they stroll the garden, along the new path made of the old. The garden is bigger than either of them remember, but familiar in its make. \n\n\n             Eventually, they find themselves at the very heart of it. There, at the end of the path, they find an apple tree; the very same one which began their journey. It, too, is bigger than they remember, but just as familiar as the rest. Its thick boughs are laden with fruit, tempting and beautiful. There is no longer a warning sign.\n\n\n             Crowley reaches up, his long fingers sliding over ruby skin, and plucks one of the apples from its stem. He turns it in his hands, this way and that, and then smiles softly. “Hardly seems worth all the fuss, does it?” \n\n\n             “Rather,” Aziraphale agrees. “Do you suppose there’s more forbidden knowledge in these ones?” \n\n\n             “Not this time,” Crowley says. He cradles the apple in both hands like something precious. He has lain among the branches of this tree, eaten of its fruit before. He remembers the taste of Hope, and he knows this time it will taste sweeter yet. \n\n\n             “You don’t think?” Aziraphale asks. “What do you suppose it is, then?” \n\n\n             “Her love,” Crowley tells him, glancing up with a warm light in his golden eyes. “Faith, hope, and love. That’s what’s in the garden, angel. Adam, us, and the love she left growing here.” \n\n\n             “Do you think she always meant for us to come back, then?” Aziraphale asks, craning his head back to look up, up, up to the top of the tree outlined against the clear blue sky beyond. There are so many apples, and he knows in his heart it will always grow more; as many as it needs to, forever and ever. “All of us, on every side?” \n\n\n             “Maybe,” Crowley says. He holds out the apple to Aziraphale. “Or maybe she just… had faith in us. And hope.” \n\n\n             Aziraphale smiles as he accepts the fruit. “And love?” \n\n\n             “And love,” Crowley agrees with a soft smile. \n\n \n\nand the greatest of these is Love.\n\n- 1 Corinthians 13:13\n "
}