{
    "id": "19756399",
    "url": "https://archiveofourown.org/works/19756399?view_full_work=true",
    "author": [
        "Clouds (myheadinthecoudsnotcomingdown)"
    ],
    "title": "When Lila Gives You Lemons",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M"
    ],
    "fandoms": [
        "Miraculous Ladybug"
    ],
    "relationships": [
        "Adrien Agreste | Chat Noir/Marinette Dupain-Cheng | Ladybug"
    ],
    "characters": [
        "Marinette Dupain-Cheng | Ladybug",
        "Adrien Agreste | Chat Noir",
        "Lila Rossi",
        "Gabriel Agreste | Papillon | Hawk Moth",
        "Alya Césaire",
        "Nino Lahiffe",
        "Le Gorille | Adrien Agreste's Bodyguard",
        "Nathalie Sancoeur | Mayura"
    ],
    "additional_tags": [
        "smart heroes",
        "adrienette moments",
        "love square",
        "Identity Reveal",
        "Making The Best of a Bad Situation",
        "Gabriel Agreste's A+ Parenting",
        "smart marinette",
        "Smart Adrien",
        "Emotional Abuse",
        "Emotional Hurt/Comfort",
        "Fluff"
    ],
    "language": "English",
    "series": "",
    "published": "2019-07-10",
    "completed": "2021-07-28",
    "words": "24,997",
    "chapters": "16/16",
    "comments": "692",
    "kudos": "9,427",
    "bookmarks": "1,828",
    "hits": "112,656",
    "summary": "<p>Lila has made good on her promise to turn all of Marinette's friends against her and isolate her from Adrien. As a result, Marinette thinks she probably holds the record for near akumatizations. But has she found a way to turn even this situation to her advantage and use it to beat Hawkmoth?<br>After all, when Lila gives you lemons, you make lemonade.</p>\n<p>Master Fu has an idea on how our heroes should move forward, but neither Marinette nor Adrien likes it very much.</p>\n<p>The reveal and the aftermath</p>\n<p>Gabriel Agreste might be Hawkmoth, but more evidence is needed. The only question now is how to gather it.</p>\n<p>Time to set up the cameras.</p>\n<p>Important conversations and an akuma attack!</p>\n<p>Our heroes adjust and plan.</p>\n<p>Taking down Hawkmoth.</p>\n<p>The immediate aftermath of Hawkmoth's arrest.</p>\n<p>Adrien has to talk to the police about his father.</p>\n<p>Lila gets what's coming to her</p>\n<p>Epilogue</p>",
    "notes": "<p>Hey guys! Sorry I haven't updated this in literally forever. You can blame a combination of Thomas Astruc for mistreating my characters and My Hero Academia for becoming my most recent hyper-fixation. But! Apparently somebody popular on tumblr reblogged something of mine and the third chapter got like 50 likes within the past 24 hours, so I was, welp, I guess people still like this story, so... here you go! Comments and Kudos, kids, they save stories. <br>In other news, I created an outline! I don't know how many chapters it's gonna be, but I do know what's gonna happen. I'm not gonna tell you guys when I'll update because then I'll feel even more guilty if I fall off the face of the earth again, but I'm glad you're all as excited to read this story as I am to write it.</p>\n<p>So, I wasn't planning on publishing this chapter for another few days, but I've written a little bit ahead and am loving reading your reactions, so... yeah! You get it early! <br>Ok, disclaimer, I know nothing about the legal systems in France and I wasn't able to find much in 30 seconds of googling, so I just based some of these on laws where I live. Sorry if it's not completely accurate, but this is just a fic and we are not bound by the laws of reality here, so deal with it. Thank you!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>Happy New Years everyone! I went to a really cool fantasy theme park near my home last night and I even won a raffle for like the first time in my life. It was awesome, but cold. Really cold.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>Do you guys know how hard it is to come up with themed lemonade puns every chapter? I am not naturally good at puns and, unlike cat puns, there's not just a website you can go to and get unlimited puns. Every chapter, I kick myself for making that decision, but then sigh and realize that I still love my silly punny titles.</p>\n<p>Thanks for all the pun resources, guys! Y'all are amazing!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>Hey guys! I didn't disappear for months this time!<br>That being said, I thought I'd share <a rel=\"nofollow\"> my tumblr! </a></p>\n<p>This fic is not abandoned, it's just that I've largely fallen out of the fandom at this point, so I only work on it when I'm in an ml mood, which doesn't happen as often as it used to. I'm sorry for making everyone wait, and I'll do my best to finish this story before this most recent mood dissipates.</p>\n<p>Wow, look at that! I'm not dead!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_16_endnotes\">notes</a>.)\n</p>\n<p>This fic has been so fun to write. My life has completely changed since I started writing it. I hope you like the ending and I'm grateful for everyone who has stuck with this little story through inconsistent updates and me leaving the fandom. I knew that I didn't want to abandon this one, my first multi-chapter fic, and it feel so good to know that it is done. <br>Thank you for reading and have a wonderful time reading all the amazing stories out there in this fandom.</p>",
    "text": "Marinette ran out of the classroom holding back tears and sat on the dirty hall floor with her knees pulled into her chest. She looked at her watch, a fancy new digital one that showed the time down to the millisecond and rummaged in her school bag until she found the repurposed sketchbook and created a new entry.\nThen she waited.\nIt wasn’t long until she saw the familiar black butterfly. She wrote something else before closing her eyes and taking a deep breath. Enough practice had made it easy for her to slow her breathing and let her emotions fade. When Marinette opened her eyes again, the akuma was fluttering indecisively centimeters from her face. She swallowed her fear, then took another deep breath and exhaled, blowing the akuma away from her. The butterfly hesitated for another long second before it flew away down the hall.\nMarinette picked up her sketchbook again, writing one last thing before glancing at Tikki, who had left the girl’s bag in favor of her shoulder since there was no one else in the hall. The kwami was looking at her holder with a mixture of concern and pride. They both looked at the list in Marinette’s sketchbook, the neat lines and columns filling the page and nodded to each other. Marinette smiled.\nThey had enough.\nMiss Bustier had asked Marinette to leave class for “being a disturbance” or at least that was what Lila said Marinette had been doing when the teacher returned to the classroom with a stack of copies. Her class, her “friends”, had sided with the liar rather than seeing that Lila had clearly picked the fight, so it was Marinette who had to endure the punishment.  \nMarinette waited until the bell rang to go back into the classroom only to see that Lila had immediately glued herself to Adrien’s side. Ever since Lila had gotten the official Gabriel Agreste seal of approval to be Adrien’s friend, she had made good on her promise to make sure Marinette couldn’t get near the model. As far as Marinette knew, Lila still hadn’t had any luck in getting Adrien to believe her lies, but the boy couldn’t avoid her without getting in trouble with his father.\nAdrien caught Marinette’s eye and gave her a look, are you okay? Marinette responded by rolling her eyes and shrugged, not really, but whatever. They mostly communicated with looks these days, since that was all that Lila couldn’t manipulate. It had surprised Marinette how easy it was to read Adrien’s body language, even when they were across the room and he didn’t seem to have any problems reading hers. It was actually easier to communicate with him this way, since she didn’t have to worry about tripping over her words.\nHer seat in physics was near the front, right beside Alya. Mrs. Mendeleev asked a question that she didn’t know the answer to and Adrien’s hand shot up in front of her.\n“Fifteen meters per second.”\n“Correct Adrien”\nMarinette needed Adrien’s help for the next step in her plan. He was good at math, which Marinette decidedly was not, and he was one of the only people who knew that Lila was liar, which meant that he was one of the only people who Marinette could trust. Marinette hestitated a moment before texting her crush. She was getting better at not embarrassing herself around him, but it was still admittedly a work in progress.\n\nMarinette: You’re good at mathy stuff, right?\n\nSmooth Marinette, she thought, Great job not sounding like an idiot.\nAdrien shuffled in his seat, pulling his phone of his back pocket and tucking it under the desk as he read her text. He glanced back at Marinette in confusion, then started typing.\n\nAdrien: Yeah, why?\n\nThis was the difficult part. Her plan was dangerous and too tied up with her Ladybug side so Adrien might be in danger if he really knew what she was trying to do. She texted him her cover story instead.\n\nMarinette: I have this extra credit project in math, but it’s a little above my skill level and I’d really appreciate your help on it. \n\nThat sounded normal enough, right? Nothing earth shattering, nothing that suggested that Paris’s safety could hang in the balance. Just extra credit.\nAdrien once again had his phone under his desk and was typing.\n\nAdrien: Sure, if I can get away from Lila long enough. Meet me in the library after school?\n\nHe glanced back at her as she read his text, giving her a grimace before turning back to the front and pretending to pay attention to the teacher. Or maybe he wasn’t pretending, it was hard to tell.\nMarinette frowned. The library was too public. There was no guarantee that anyone listening wouldn’t be able to figure out what she was planning. She took a deep breath to work up her courage.\n\nMarinette: Actually, can we meet at my house?\n\nThe akuma attack that afternoon was actually a blessing, Adrien thought as he bounded up the stairs towards Marinette’s room. He had taken advantage of the standard after-attack chaos to text his bodyguard saying he was spending the afternoon doing homework with a friend. His father would assume he meant Lila and no one would think to check until that evening.\nMarinette was already waiting for him when he burst through though the trapdoor of her room.\n“Sorry I’m late,” Adrien puffed, “Akuma.”\n “Problem no! I mean, no problem,” Marinette seemed a little out of breath as well, “I-I just got back.”\nThey stood awkwardly for a moment before Adrien broke the silence, “So…extra credit?”\nMarinette jumped, “Yeah!” She ran over to her desk and Adrien pulled up a chair to sit next to her. She pulled out a sketch book and opened it to a messily drawn table. Adrien read the headers: offense, arrived, location. There were times written in the first two columns and then a location in Paris in the third. Adrien also noticed that some lines were crossed out while a few had notes scrawled in the margins.\n“Very impressive,” Adrien remarked honestly making Marinette blushed. “What are we going to do with it?”\n“Well,” Marinette hesitated, “I-I, uh, was wondering, well, if it’d be possible, but if it’s not then I guess it’s not a problem. Ugh! I’m such an idiot, this was a bad idea.” That last part was to herself. Adrien put his hands on her shoulders.\n“Don’t worry Marinette, I get it. It looks like you collected all this data yourself, so I’m guessing this is kind of a self-designed extra credit project?” Marinette looked relieved and nodded, “So if the teacher doesn’t have anything specific that he wants you to do, what do you want to find out from this data? I mean, you wouldn’t have gone through the trouble of collecting it if you didn’t have something in mind…”\nMarinette seemed to calm down a little at that and squared her shoulders. She looked at the list rather than at Adrien and took a deep breath, “I want to try and find a location. If… something…left around the time in the offense column and arrived at the written location at the time in the arrived column, can we find out where these things are coming from?” Marinette risked an insecure glance at Adrien, clearly unsure if this was even possible.\nFor his part, Adrien thought it was an odd choice for an extra credit project, but his mind had already taken a running start, “It should be, as long as we know about how fast these things travel,” he was starting to get excited and couldn’t keep a grin off his face, “You chose a really interesting project Marinette!” Adrien looked around, “You wouldn’t happen to have a map, would you? I think it’ll make things easier if we can visualize it.”\nMarinette tried jumping up out of her seat but ended up tangled up with the chair as it fell to the floor. “I’m ok!” She yelped, untangling herself from the chair and running to the corner of her room before Adrien could try to help her. She came back with a massive roll wrapped in cellophane. Adrien laughed as she unwrapped the map and spread it out on the floor.\n“You’re always prepared, aren’t you Marinette?” The girl gave him a shy smile before grabbing a sheet of stickers from one of the desk drawers and turning her attention back toward the map. Adrien was already putting books at each of the corners so it would lie flat.\n“I was thinking we could start by putting a sticker at each location I have written down, that will at least give us an idea of the general area we’re working with, right?”\nAdrien nodded, “Good idea. I’m assuming that we can ignore the locations you’ve crossed off on your list. Those are incomplete data, right?”\nMarinette nodded and handed Adrien a sheet of stickers. Adrien found it easy to work with her and it wasn’t long before they sat back to admire their handiwork. There were around thirty stickers spread out over Paris, although many seemed to be concentrated around their school. Adrien looked up the formulas he needed on his phone and they got to work on their calculations.\nBy the time that Adrien had explained the basic math to Marinette, she was feeling more confident and was starting to lose herself in the flow of the project. Adrien watched her plug the numbers into the formula he’d shown her and grinned as she started muttering to herself, oblivious to everything besides the problem in front of her.\n“…so, if I was at the Eiffel Tower… that 11:35…and factoring in how fast the average akuma flies…”\nAdrien felt his smile melt. Akumas? He took a closer look at the list in Marinette’s sketchbook. Sure enough, the writing in the margins were names of various akumas that he and Ladybug had fought in the last few months. How was she collecting this data?\nMarinette had finished her calculation by this point and was watching Adrien in concern.\n“Adrien, are you ok? What’s wrong?”\n“You’re trying to find Hawkmoth.”\nAdrien felt numb. Marinette went pale and her mouth worked as she tried to come up with something to say.\n“I know it’s dangerous. That’s why I didn’t want to tell you what I was doing…I didn’t want you involved any more than necessary.”\nAdrien laughed to himself. Too bad Marinette didn’t know how deeply Chat Noir was already involved in the fight against Hawkmoth. If anything, he was more concerned with how deeply this involved Marinette. After all, she didn’t have superpowers to protect her like he did.\n“So…” Adrien was still trying to wrap his head around the situation, “This list, you’ve been keeping track of the akumas?”\n“Potential akumas,” Marinette corrected, “I payed attention to situations around me that had the potential for strong emotions and then stuck around to see if a villain appeared. The crossed-out lines mean that no akuma ever showed up, even though there was strong negative emotion.”\n“And the lines without a name written by them?”\nMarinette froze and Adrien waited. Finally, she screwed her eyes closed and:\n“Those were ones that came after me.”\nAdrien’s stomach dropped and he felt his ears start to ring. There were dozens of unlabeled entries. What was going on with Marinette?\n“It’s Lila,” Marinette refused to look him in the eye, “I didn’t saw anything because, well, you’ve got enough problems with her without adding mine to the mix and I didn’t want you to worry, and I know that it’s best for her lies to just self-destruct because I really wasn’t getting anywhere trying to call her out, but she threatened me in the bathroom and said she’d turn all my friends against me and I thought that if I stopped trying to call her out, then she wouldn’t be able to do anything, but that didn’t work and I’m pretty sure Alya hates me now, not to mention the rest of the class, and she’s always hanging off you even though it’s obvious that you hate it and…”\n“Whoa Marinette, slow down! Did you just say that she threatened you?”\nSometime while she’d been taking, Marinette had crossed her arms in front of her chest and had started to look very small. “I’m sorry, I shouldn’t have told you that. I don’t want you to worry.”\n“Well too bad, Marinette, I’m your friend, that means it’s my job to worry about you. I didn’t know that things with Lila had gotten so bad.”\nMarinette shrugged, “If I can find Hawkmoth, it’s all worth it. I’ve gotten really good at breathing exercises so I can calm down quickly, and if Lila’s going to make my life miserable anyway, I may as well make the best of it.”\nAdrien stared at her with wide eyes, “You’re amazing Marinette.”\nShe blushed again before a determined glint appeared in her eyes and she smiled, “Let’s find ourselves a terrorist.”\nThey worked in silence the rest of the time, Marinette occasionally calling Adrien over to check her calculations. It was almost time for Adrien leave when they finally finished.\n“Ok, so, just so you know, these data points are far from exact. After all, we don’t know how long after the initial stimulus Hawkmoth sends the Akuma, so all we really have is a search radius of where Hawkmoth’s lair might be, not a solid address, but it’s a solid start.”\nOn the map, they had charted out the akumas paths and had colored in the search radius that they had calculated. Marinette gasped and Adrien had to fight down the bile rising in his throat.\nIn the middle of their search radius, highlighted in red marker, was the Agreste mansion.\n\n“We need to tell Ladybug.” Adrien said numbly. He was purposely \n\nnot\n\n thinking about how bad this looked. Ladybug had suspected his father of being Hawkmoth before, but hadn’t given him any reason why. Could she have been right? Could the Collector have just been a red herring to throw them off the scent? Adrien pushed those thoughts from his mind, he could freak out later when he was alone with Plagg. \n\n\nMarinette nodded and began rolling up the map, “I’ve learned a few tricks from Alya, so I should be able to track down Ladybug and give her this. For now, I think this should stay between us and the heroes. Who knows what Hawkmoth would do if he knew we were doing this.”\n\n\nAdrien nodded. He wasn’t worried about himself, he had superpowers, but he didn’t want Marinette getting hurt when she was only trying to help. He stood up and gathered his bag, which had been lying forgotten in the corner of the room, “So, um, I guess I’ll see you tomorrow?”\n\n\nMarinette startled from where she’d apparently been lost in her own thoughts as well, “uh, yeah. School. Tomorrow. Sure.”\n\n\nAs Adrien left, he wondered how he was ever going to face his father.\n\n\nDinner that night was awkward. At least, more awkward than it normally was. Adrien just couldn’t unsee the myriad of butterfly symbols strategically placed throughout the house. He’d written it off as a coincidence before, but now? Now he wasn’t so sure. \n\n\n“Remember you have a photoshoot during your afternoon classes tomorrow, then a chinese lesson after fencing practice. Your father expects you to reach an advanced level by the end of the month.”\n\n\n“Yes Natalie.” Did Natalie know? Was she involved somehow?\n\n\n“Are you feeling well, Adrien? You’ve been playing with your food for the past five minutes.”\n\n\nAdrien set down his fork, “um... I’m fine, I guess it’s just kind of been a long day and I’m not really that hungry?” He looked up at Natalie, who was scowling slightly.\n\n\n“If you’re not sick, you need to finish your food Adrien. Your nutritionist would have a heart attack if you’re not getting enough calories, not to mention the legal issues.”\n\n\nAdrien nodded and forced down another few bites of food. Wonderful, yet another way he was failing to live up to expectations. And wasn’t it telling that it was the nutritionist that would care, not Father or Natalie?\n\n\nThe rest of the meal passed in silence. Adrien finished his food and got up to go back to his room when the door opened. \n\n\n“Hello Adrien.”\n\n\n“Hello Father.”\n\n\nWhy? Normally, Adrien would have been ecstatic to have his father come to dinner, even if it was just at the end, but after the revelations of the afternoon, it was all he could do to act natural. Of all the days for his father to talk to him, why did it have to be today?\n\n\n“I was informed that you disappeared this afternoon. Do you have any explanation why?”\n\n\nAdrien’s mouth went dry and his stomach sunk, “I told my bodyguard that I went over to a friend’s for homework.”\n\n\nGabriel’s glare hardened, “Ms. Rossi said she hasn’t seen you since before the akuma attack.”\n\n\nAdrien didn’t know what to say. He’d actually checked? “Lila's not my only friend.”\n\n\n“She’s the only one I have approved of.” Gabriel turned to leave, “You are grounded for the next week. If I hear of you going over ‘to a friend’s house’ again, you’ll be staying home from school for a week. Do you understand?”\n\n\n“Yes Father.”\n\n\n“Good. Sleep well, Adrien.”\n\n\nToday sucked.\n\n\n“Just because your house is in the search radius does not automatically mean your father is Hawkmoth. Just ‘cause the man’s a dick doesn’t mean he’s a supervillain.”\n\n\n“But he might be. Just think, Plagg, is there anyone else that Ladybug has suspected? I didn’t want to believe her then, but Ladybug doesn’t do things like that without a good reason. And if Father is Hawkmoth then that means that Natalie is probably Mayura and oh my god, is Gorilla involved? I don’t know what I’m gonna do! I’m living in the same house as a supervillain!”\n\n\nPlagg bopped Adrien lightly on the nose, “Stop that. This whole mathy science thing isn’t exact, especially since your girlfriend was just writing down things as she went.”\n\n\n“She’s not my girlfriend,” Adrien muttered, but he was freaking out anymore. \n\n\nPlagg smiled, “Whatever you say, lover boy.” Adrien glared at him, but since when had Plagg let that stop him, “Besides, even if your dad \n\nis\n\n Hawkmoth, that wouldn’t be a recent development, meaning that you’ve been living under the same roof as the supervillain for almost a year now. The only difference is that now you \n\nknow\n\n.”\n\n\nAdrien sighed, “I have no idea if that was supposed to be comforting or ominous.”\n\n\n“I try.”\n\n\nAdrien looked out his window at the moon, “It’s getting late, let’s go.”\n\n\nPlagg swallowed the piece of cheese he was holding and let himself be sucked into the ring. Tonight was going to be interesting.\n\n\nLadybug was already waiting for him with a rolled up map slung across her back when Chat arrived at the Eiffel Tower for patrol. \n\n\n“Hey Kitty, we need to talk.”\n\n\nHe already knew what this was about, but he knew he wasn’t supposed to, “What? Has M\nilady finally realized that I’m the cat’s meow?”\n\n\nShe smiled sadly, “Not tonight, Chat. Do you remember Marinette Dupain-Cheng?”\n\n\n“That’s the bakery girl, right?”\n\n\nLadybug nodded, “Well, she tracked me down today. Apparently she’s been tracking akumas and she and Adrien Agreste compiled the data earlier today and, well...maybe it’s better if I show you the map. \n\n\nShe stretched it out on the support beam between them and Chat studied it for a minute. Somehow it looked different than it had this afternoon. It seemed more important somehow, like it was telling him that this was his fault and his responsibility. It was probably because he was transformed, or maybe because he’d actually seen his father that day. After a few minutes, he looked up at his partner.\n\n\n“We’ve suspected Gabriel Agreste of being Hawkmoth before.”\n\n\n“I know,” she hugged herself, “And I know it sounds paranoid to think he might have akumatized himself to cover his tracks, but what if he did? What if we’ve really known who he was for months and just couldn’t see it?”\n\n\nChat rolled up the map and handed it back to Ladybug, “Why did we suspect him the first time? I don’t think you ever told me.”\n\n\n“It was because of guardian stuff.” Chat raised an eyebrow, and Ladybug sighed, “I couldn’t tell you then because you didn’t know about the guardian yet. I’d only just found out and Tikki only took me to him because she had to. Gabriel Agreste had a book. A spellbook entirely on the miraculous and their properties written in a code known \n\nonly\n\n to the guardians.”\n\n\nChat’s eyes widened as he remembered. He’d gotten pulled from school because of that book. \n\n\n“Master Fu told me that the spellbook was lost at the same time as the Butterfly and Peacock miraculouses. He said that since all three were lost together, it was likely that whoever found the book, also found the miraculous.”\n\n\nChat nodded as he processed everything, “That...makes a lot of sense. So, if he has this book and he lives right where the akumas seem to be coming from, then…”\n\n\nLadybug nodded, “Then the evidence is piling up and there’s a strong possibility that Gabriel Agreste really is Hawkmoth.”\n\n\nChat looked out over the city, “That’s a good thing, right? I mean, now that we know who he is, we might actually be able to stop him.”\n\n\n“I guess,” she fiddled with her yoyo, “It’s just, where do we go from here? Right now all we’ve got are coincidences and conjectures and that’s not nearly enough to go in guns blazing. Besides that, he’s got a son. I don’t want Adrien getting caught in the crossfire.”\n\n\nChat’s heart warmed in spite of the conversation. His lady cared! But she raised a valid point.\n\n\n“Maybe we should talk to Master Fu about this. Even if he doesn’t have any advice, it’s still probably something he should know.”\n\n\n“You’re right. Would you like to do it this time, Kitty?”\n\n\nChat shook his head, “It’s probably safer for you to. You already know where he lives and I’m grounded, so it’ll be harder to sneak away.” Not to mention the danger if his father realized what was going on and followed him. \n\n\n“What’d you do kitty, push all the mugs off the table?”\n\n\nChat smiled, “Something like that.”\n\n\n“Well, I’ll talk to him tomorrow then. Goodnight kitty.” She threw her yoyo and swung off into the night. Chat stood watching her disappear for a few minutes, reluctant to go back to the place he called home. \n\n\n“Goodnight Milady.”\n\nThings were kind of awkward between Marinette and Adrien the next day. Marinette felt like the glances they shared were  heavier  somehow, now that they had this huge secret they shared. She wished she could be just a little happier about it. They knew who Hawkmoth might be, or at least where to look for him if it didn’t end up being Gabriel Agreste, she had already told Chat Noir and was going to tell the guardian. Her plan had worked, everything was looking up, and enduring Lila’s bullying had been worth it. Then why did she feel so down?\nShe looked over at Adrien, who was trying, and failing, to dodge out of the way as Lila kissed him on the cheek. Oh. right. Adrien knew that his dad might be Hawkmoth. Marinette tried to imagine her own father as a supervillain and shuddered. It had been bad enough when her dad had been akumatized, she didn’t want to think about how she would feel if he was pulling the strings of his own free will. Adrien must be feeling even worse than she was right now. \n“Hey girl! We’re going to that new place downtown that Lila recommended for lunch. Do you want to come with us?” Alya asked. \nMarinette looked up from where she was gathering her books and saw Alya, Nino, with Lila hanging off Adrien’s arm right beside them. Lila was glaring daggers at Marinette, but whether Lila was daring her to say yes or no, Marinette didn’t know and at this point honestly didn’t care. She needed to talk to Fu anyway. \nMarinette shot Adrien an apologetic glance, “Sorry guys, not today, I already have plans during lunch.”\nAlya looked like she was about to say something else, but Lila beat her to it, “Oh, Marinette! I didn’t know you didn’t like that place! We were so looking forward to you coming with us! Unless, of course, there’s some  other  reason you don’t want to come…” Lila gave the most horrendous fake pout Marinette had ever seen and she grit her teeth.\n“No Lila, the reason I’m not coming is because I legitimately have things I need to do today. It has nothing to do with you or with the restaurant.” \nMarinette saw Adrien glancing around and it took her a moment to realize that he was looking for an akuma. She took a deep breath and finished putting her books away, “Have fun guys, I’ll see you this afternoon.”\nLila glared at Marinette suspiciously as she left. Something was going on between Marinette and  her  Adrien and she needed to put a stop to it.\n“Hello Marinette, I’ll be with you in just a moment.” Master Fu finished ringing out his current customer and waved to him as he left. \n“To what do I owe the pleasure Marinette? I did not believe there was an akuma today.”\n“No, I don’t need another Miraculous. It’s actually, um, can we go in the back?”\nFu nodded and led Marinette into the back room of the shop. She unrolled the map that she’d run home to get and let him look at it. \n“I’ve been tracking akumas for a few months now, both those that have targeted me and those that have targeted others, and yesterday, I used this map to create a search radius. I know that we already crossed Gabriel Agreste off the list and that Hawkmoth could be anyone within this area, it’s just…what if we were wrong?”\nFu silently studied the map for a moment, “I see, this is concerning. Have you already spoken to Chat Noir about this?”\nMarinette nodded, “Yes, he came to the same conclusion as I did: that The Collector might have been a red herring designed to throw us off the trail. But Master, we might have another problem if Gabriel Agreste really is Hawkmoth.”\n“And what is that, Marinette?”\nMarinette bit her lip, “Well, I’m not very good at math, I can pass classes, but barely, and so I asked one of my classmates for help with the calculations and…” she took a deep breath, “the classmate I asked was Adrien Agreste. He knows his dad might be Hawkmoth and what if he tells him? I want to be able to trust Adrien, but this is  huge  and Gabriel is his  Father  ! I can’t expect him to work against his own dad, even if it  is  for the good of Paris!”\nFu got a pensive look on his face and was silent for a few minutes. Marinette was beginning to worry that she’d said something wrong when he finally spoke again. \n“I think,” Master Fu said slowly, “That it is time for you and Chat Noir to reveal your identities.” \nMarinette looked at the guardian like he’d grown a second head, “What? Why now in the middle of everything? It’s not any safer now than it ever has been, in fact it might be  more  dangerous now that we have a lead on Hawkmoth’s identity. Wouldn’t it be better to wait until we’ve beaten him? ”\n“You will understand in time. For now what you need to know is that now more than ever you and Chat Noir need to be truly united and able to support one another both in and out of the masks. You were always meant to be Yin and Yang, but I was afraid of what might happen if you revealed your identities, especially with Hawkmoth’s powers on the loose.”\nMarinette processed this information, “Can I think about it?” \nFu nodded, “Of course, I will reach out to Chat Noir and discuss this with him as well. Goodbye Marinette.”\nShe nodded and left the massage parlor, too lost in her thoughts to say anything.\nThe rest of the school day passed quickly and Marinette was too busy worrying about whether or not she should reveal her identity to Chat to even think about Lila. Or she was too busy, at least until Lila cornered her in the locker room after everyone else had left. \n“What’s going on between you and Adrien?”\nMarinette’s eyes widened. Could Lila know that they had tracked down Hawkmoth? That would be bad, Lila had been willingly akumatized before. She might be more likely to tip the villain off than Adrien was. Marinette quickly schooled her expression into one of passive indifference. \n“Nothing’s going on, Lila, you’ve made sure of that.”\nLila smiled at the praise but leaned closer to Marinette, “Yeah right, Marinette. I’ve seen the looks you two share in class. But,” she leaned back, “I don’t know what is going on between you and Adrien, and honestly I don’t really care, just put a stop to it, or I will destroy you. Remember this, Marinette, Adrien is  mine. ”\n“Adrien, your Chinese tutor got sick at the last minute and sent a substitute.” Natalie said as she opened the door to his room, stoic as ever.\nAdrien perked up. Of course, there was a chance that this was just a normal substitute, but with what he and Ladybug talked about last night, Adrien wouldn’t bet on that. \n“Hello, Adrien.” Master Fu smiled, “It’s nice to see you again. I wish it was under better circumstances.”\n“Work hard Adrien, I want to hear good things from your regular tutor when he gets back.” And with that, Natalie left. Adrien bowed to the Guardian. \n“Hello Master Fu,” he said, “I’m assuming you’re here because of what Marinette Dupain-Cheng and I discovered about Hawkmoth’s identity.”\n“That’s part of it, yes, but not the main reason why I’ve come.”\n“What could possibly be more important than the fact that my own father might be Hawkmoth?” Adrien said bitterly.\n“The time is right for you and Ladybug to reveal your identities to one another.” Fu waited for Adrien’s reaction.\n“No.”\nFu’s eyes widened, “I thought you would be happy. Have you not wanted to know the girl behind the mask for quite some time now?”\nAdrien didn’t look at Fu, instead focusing all his attention on scratching Plagg behind the ears, “That was before…” he scowled, “before I realized I was living under the same roof as the biggest villain in Paris and  didn’t notice. ”\n“Adrien…”\n“No! I can’t tell her who I am now! What would she even think of me? I’m not even worthy to be a hero!”\n“Stop that!” Plagg scratched at Adrein’s hand and he stared at his kwami in shock, “Don’t go getting it into your head that you aren’t worthy to be Chat Noir because  you are!  If your dad is Hawkmoth that’s on  him  not on you. And  you  need someone to be there for you and keep you from going into a self-blame spiral.”\nAdrien sighed, “That’s what I’ve got you for Plagg.”\nPlagg rolled his eyes, “Yeah, I’m glad you’ve finally figured out how amazing I am, but you’re going to need more than some stinky old cat god to get you through this. It’s why you even have a partner in the first place, so you don’t have to do all the hard stuff alone.”\n“But,” Adrien was quiet, “isn’t that selfish? Isn’t it wrong to need help when it’s my own fault I’m in this situation in the first place?”\nPlagg growled while Fu’s eyes filled with compassion, “It’s not your fault that Hawkmoth is active.” Adrien opened his mouth to protest, but Fu held up a hand to stop him, “And even if it  was,  it would still not be selfish to ask for help. The holders of the ladybug and black cat miraculouses are supposed to be there for each other through thick and thin, yin and yang. There is no shame in needing support from your other half.”\nAdrien hesitated and Plagg flew up to look his holder in the eye, “You don’t have to do this alone, Adrien, trust us. We’re all here for you. We care about you, and so does Ladybug.”\nAdrien sighed, “Ok, I’ll trust you.” He looked back to Master Fu, “I’ll talk to her tonight. I really hope you know what you’re doing.”\nFu nodded, “Good luck, Chat Noir. Now, I believe I was supposed to be teaching you something about the Chinese language, was I not?”\nMeanwhile, Marinette was having a breakdown.\nTikki tried to keep up as Marinette paced back and forth in her room, talking so quickly that Tikki could really only make out every third sentence, but what she could understand didn’t sound good for her holder’s mental health. \n“Why now? What if he hates me? What if he just sees clumsy Marinette and decides I’m not fit to be ladybug? What if he tries to take my earrings and by ladybug himself? Oh no! What if he tries to flirt with me as a civilian too? What if he’s jealous of Adrien and tries to hurt him? Then we’ll never have three kids and a hamster!”\n“Marinette, calm down!” Tikki interrupted, but Marinette didn’t seem to hear her\n“How is this going to affect our partnership? What if we can’t trust each other anymore? What if he’s mad at me for lying to him to keep my secret identity? What if this ruins everything?!”\n“Marinette!” Tikki flew in front of Marinette’s face, forcing her to stop pacing, “You’re catastrophizing again! Chat isn’t going to be mad at you, and he’s not going to hate you. You trust Chat, right?”\nMarinette nodded with wide eyes.\n“And you know that neither of you are perfect, right?”\nShe nodded again.\n“So what is there to worry about? Yeah, knowing each other’s identities will probably change your dynamic, but it will bring you closer, not drive you further apart!”\nMarinette sighed and let Tikki land in her cupped hands, “You’re right Tikki. Chat and I have been through a lot together and we’ve gotten through it. This won’t be any different.”\nTikki giggled, “And you’ll be able to see each other outside of akuma attacks.”\nMarinette smiled and rolled her eyes, “I’m gonna go insane from all the puns.” She sighed, “Tikki, are you  sure  this is the right time? We have so much going on now that we have a lead on Hawkmoth. What if Master Fu is wrong and this is just too much too soon?”\n“I think Master Fu is making the right call, Marinette. You’ll understand soon.”\nMarinette looked at her kwami suspiciously, “That’s what Master Fu said, too…”\nTikki smiled, “Maybe that’s because it’s true!”\nMarinette returned the smile, “Or maybe it’s because both of you are trying to sound wiser than you really are.”\nThe tension broke as they both dissolved into giggles. Yeah, a reveal would change things, but they’d get through it. They always did.\n\nWhen Ladybug arrived for patrol, Chat Noir was already waiting for her, dangling his feet off the edge of the Eiffel tower and looking out over the lights of Paris. \n\n\nShe landed next to him and sat down, “Hey.”\n\n\n“Hey.”\n\n\nThey just sat in silence for a few minutes, neither of them looking at the other. Ladybug bit her lip. Should she say something? Master Fu had said revealing their identities was for the best but did it have to be so \n\nawkward?\n\n\n\nChat broke the silence, but still refused to look at Ladybug, “So… Master Fu talked to you too?”\n\n\n“Yeah.”\n\n\n“Um...do you wanna?”\n\n\n“No. I mean, not really, but I can see it’s probably for the best. Leap of faith and all that. Right?”\n\n\n“Yeah,” Chat chuckled bitterly, “I’m kinda in the same boat.” \n\n\n“Really?” Ladybug looked at him in shock, “I thought you always wanted to know who I was.”\n\n\n“That was before… well, you’ll understand soon.”\n\n\nLadybug groaned, “I’m getting really sick of people telling me that. First Master Fu, then Tikki, now you! I just want to understand \n\nnow!\n\n Is that too much to ask?”\n\n\nChat laughed and Ladybug smiled, the awkward tension still there, but a little more bearable than it had been a few minutes ago. \n\n\n“Well,” Chat got up and stretched, “If we’re going to get this over with, we should probably go someplace a little more private than a national icon.”\n\n\nLadybug nodded, “Yeah, there’s a pretty secluded rooftop over in the thirteenth arrondissement, if you want to go there.”\n\n\n“Lead the way, Milady.”\n\n\nIt didn’t take them long to reach their destination, despite stopping and waving to a few different groups that had been walking around Paris in the night. They each did a lap around the roof, looking for any eavesdroppers or cameras that could cause problems. \n\n\nOnce they were certain that they wouldn’t be seen, Ladybug turned to Chat, “So, on three I guess?” \n\n\n“Yeah, sure.” Ladybug noticed him nervously playing with his ring and her eyes narrowed. \n\n\n“Are you sure you’re ready for this?” \n\n\nHe sighed, “No, but waiting isn’t helping either.”\n\n\n“Ok, yeah.”\n\n\n“Just,” Chat hesitated, “promise me that you won’t think any less of me once you know who I am?”\n\n\nLadybug’s face softened, “Oh kitty, I doubt I could ever think any less of you, unless you were, like, Chloe under the mask or something.”\n\n\nChat snickered, “That would be \n\nridiculous, utterly ridiculous!”\n\n\n\n“I don’t know whether to be impressed or horrified that you’re so good at that.”\n\n\n“I’ve had a lot of experience...you’ll understand.”\n\n\n“Seriously? Stop saying that!”\n\n\nChat laughed before sobering. Ladybug took a deep breath, “On three?”\n\n\nChat nodded.\n\n\n“One, two, three!”\n\n\n“Spots off!”\n\n\n“Claws in!”\n\n\nAs the sparkles faded, Marinette looked at Adrien, who was standing in front of her nervously, “Oh”\n\n\n“Yeah…”\n\n\n“Well,” she said slowly, “I understand now…”\n\n\nAdrien lost it and started laughing, “That’s all you can say? And of course \n\nyou\n\n would be Ladybug! Who else would think to turn a horrible situation around and track down Hawkmoth. You’re so creative, Marinette!” He frowned, “I’m not even good enough to be your friend, let alone your partner. I couldn’t even tell that my own father was a terrorist.”\n\n\nMarinette crossed her arms and glared at Adrien, “\n\nMight \n\nbe a terrorist and don’t talk about my friend that way!” Adrien looked around then looked at Marinette in confusion, “I’m talking about \n\nyou\n\n, you dork.” Adrien’s eyes widened, “You are just as amazing as I am, maybe even more so, the way that you put up with your fame even though it annoys you, your capability to be silly and calm me down when things get tough. Even your stupid puns! Adrien, we might have different strengths but that’s the way it’s supposed to be. Yin and Yang, right?” \n\n\nAdrien drew a shaky breath and blinked away tears, “Right.” He smiled hesitantly, “You and me against the world?”\n\n\nMarinette took his hand and looked her kitty in the eye, “You and me against the world.”\n\n\nMarinette thought that things would be hugely different at school the next day, and she didn’t know whether to be relieved or disappointed that nothing much had changed. She was still being isolated at every turn and none of her friends could see how they were being manipulated to exclude her and even start hating her. She was pretty sure Alya had been about to invite her to lunch again when Lila swooped in and whispered something in the reporter’s ear. Alya had gotten a disappointed look on her face when she glanced at Marinette, but then had walked away without saying anything. Marinette had eaten lunch alone. Again. \n\n\nMeanwhile, Adrien was still being held prisoner by Lila. Every time he tried to come talk to Marinette or even just go someplace on his own, Lila was there, hanging off his arm and fake laughing in that high-pitched way that made Marinette cringe. Lila was being even more physical than usual today, probably to counteract whatever she \n\nthought\n\n was going on between Marinette and Adrien. Adrien gave Marinette a helpless look as he walked into the classroom with Lila, Alya, and Nino after lunch, \n\nI’m sorry.\n\n\n\nShe shook her head and smiled, \n\nIt’s ok, it’s not your fault.\n\n\n\nAt least now she knew why it was so easy to read Adrien’s body language. Alya had posted a theory once that Ladybug and Chat Noir were telepathic because of how easily they understood one another, even in the midst of battle. Marinette chuckled to herself, she was pretty sure she would literally die of embarrassment if Adrien could hear her thoughts. No, they’ve just had \n\na lot \n\nof practice. \n\n\nAdrien grimaced slightly as Lila kissed him on the cheek, then pulled a face and stuck his tongue out at Marinette when no one was looking. She giggled quietly behind her hand. \n\nGood luck, Lila\n\n, she thought, \n\nno one’s ever taking my silly kitty away from me. \n\n\n\nThey would get through this. Marinette knew they would. They were Ladybug and Chat Noir, Marinette Dupan-Cheng and Adrien Agreste, yin and yang, and they would always be there for each other. They would get through this, no matter what happens, because \n\nthat’s what they do.\n\n That’s what they’ve always done, and Marinette didn’t see any reason for them to stop now. \n\n\nMarinette tuned out Miss Bustier as she started to drone on about sixteenth century literature and pulled out her phone. There had been something on her mind ever since she and Adrien had finished their map. The look in his eyes when he had realized that his dad might be Hawkmoth wasn’t something Marinette ever wanted to see again. Even worse, the hurt and guilt she heard when he talked after they’d revealed their identities the night before. Marinette hoped they were wrong about Gabriel, if only so that Adrien didn’t have to deal with those feelings ever again.\n\n\nIf Gabriel Agreste was Hawkmoth, Marinette wanted to get Adrien out of that house as soon as possible. Having two warring miraculous holders under the same roof was a recipe for disaster, especially when one was willing to tear Paris apart to get what he wanted. And if and when Gabriel gets arrested...Marinette didn’t want her kitty to be sent away. She knew that Adrien wasn’t thinking about that, he would be willing to do whatever it took to put Hawkmoth behind bars, even if it meant risking his own happiness, but Marinette didn’t want to lose him. \n\n\n\nEmancipation laws in Paris\n\n\n\nMarinette skimmed through the results of her search, clicking on various links and reading the various laws on child rights. She felt her heart sink as her brain put together what she could understand out of the legal jargon. Proof of financial means wasn’t a problem, even if he stopped modeling for his father, Adrien had his savings and other companies would jump to have him as a model. Even a secure place to live wouldn’t be difficult, since he would always be welcome at her place or even Nino’s. What was a problem was the age. \n\n\n\n16\n\n\n\nShe briefly considered waiting to capture Hawkmoth until Adrien could legally emancipate himself before tossing the idea out the window. Even if it was the only option, Adrien would never agree to it. Paris had already suffered enough, and it was their job as heroes to save it as soon as possible. It was why they had been chosen. \n\n\nMarinette resisted the urge to groan in frustration and hit her head against the desk. Either would draw far too much attention when she was supposed to be listening to the lecture. She looked hard at the back of Adrien’s head in front of her. What was she supposed to do? She was supposed to protect Paris, but she also had to protect her partner. Ugh. Why did life have to be so hard?\n\n\nShe half listened to the lecture for a few minutes, doodling in the margins of her notebook and jotting down a few things that sounded important, all while her mind continued to work on the real problem. How could she make sure Adrien would be safe and taken care of, even if Gabriel was arrested?\n\n\nShe paused and chewed her lip as an idea occurred to her. She glanced one last time at the back of Adrien’s head before unlocking her phone again and opening up a new search.\n\n\n\nFoster laws in France \n\n\n“What if we set up cameras?”\nMarinette was pinching herself and trying not to imagine Marinette-of-a-week-ago’s reaction to  the Adrien Agreste  laying on her bed, repeatedly throwing a ball of yarn up in the air like it was no big deal. \n“Um… I mean, that could work, but doesn’t your dad’s place already have security cameras?”\nAdrien paused, then started throwing his yarn ball again, “I mean, yeah, that’s how I got the idea. He apparently has one in his office and that’s how he knew I stole the spell book, but it’s not like I have access to any of them. Also, I’m assuming he doesn’t have cameras anywhere that he’d transform, because my bodyguard is probably one of the biggest hero fanboys I’ve ever met outside of Alya, and I’m going to assume for my sanity that he probably doesn’t know.”\n“Ok, so we’d need to get cameras and set them up in places your dad wouldn’t notice and make sure we have access to the feed. We should probably also check with the police force to see if we need warrants for any of this… we don’t want to go through all this and then not have our evidence be admissible in court.”\nAdrien propped himself up on his elbow and looked down at her, “I hadn’t even thought about that. They’re not going to tell him, are they?”\nMarinette shrugged and started erasing a line that wasn’t quite where she wanted it, “I mean, if we explain, then they shouldn’t. There’s also the possibility that they might not even ask who exactly we’re investigating. They tend to give us pretty much free reign to do what we need to, most of the time.”\nAdrien hummed in agreement and layed back down, “I wish it was easier to just see if he or Natalie ever disappear during akuma attacks. If I actually saw Father more than once a month, I’d just know and then we wouldn’t have to do this whole stupid song and dance routine to find out if he’s a supervillain.”\n“It’s his fault for being a bad father, Adrien, not yours.”\n“I  know  that, it’s just,” he groaned, “it just doesn’t feel like it sometimes.”\n“Marinette! Your father just made a batch of cinnamon rolls, do you want any?” Sabine poked her head into Marinette’s room and both kids looked at her with wide eyes, “Oh…”\n“What is it Sabine, what’s wrong… oh.” Tom’s head joined Sabine’s, “Adrien, I didn’t know you were here...wait, how did you get in? You would’ve had to come past us to get up here.”\nMarinette and Adrien both glanced at the skylight, then looked at each other in panic, trying to come up with any reasonable explanation. It wasn’t like they could just say,  oh, Adrien is just Chat Noir and he sneaked out of his father’s house because he might be Hawkmoth and keeps him locked up so that he never sees any of his friends and he came in through the roof because honestly neither of us remembered that was weird for anyone who wasn’t a superhero. \nUnfortunately, that brief glance was enough for Marinette’s parents, “You do know you could have come in through the front door...right?” Sabine said hesitantly. \nTom nodded in agreement, “We don’t mind Marinette’s friends coming over, you don’t have to sneak around.”\nMarinette thought quickly, “Adrien doesn’t want his dad to know he’s here,” she blurted out. “His dad’s really strict and doesn’t  let him out of the house. And since he’s kinda famous, if he came in through the front door, then his fans would see him and they’d tweet about it and...” she trailed off as her parents looked at Adrien sympathetically.  \n“It’s really no trouble,” Adrien said quickly, “I have a climbing wall in my room and stuff so I’m used to high places.” Her parents didn’t look convinced. “It’s fun?” He added hesitantly.\n“O-ok? Well, um,” Sabine looked at Tom, who nodded, “if you’re going to be coming in through the roof then we need to know when you’re here and the trap door stays  unlocked.  Do you hear me?” \nBoth kids’ faces erupted into identical shades of scarlet.\n“Mamman!” Marinette yelled as she buried her face in her hands, “It’s not like that!”\nAdrien just opened and closed his mouth, unable to come up with a single word in his defense.\nSabine smiled mischievously, “Well, then, can I get you kids some cinnamon rolls?” \nShe and Tom chuckled as they went back downstairs, they were going to have so much fun teasing Marinette about this.\n“So, you want a warrant to place cameras in places you think Hawkmoth might be?”\nLadybug and Chat Noir looked at each other and nodded. Officer Raincomprix hummed, “Well, that shouldn’t be a problem. You  are  superheroes, and that gives you a certain measure of authority. I think…” He ruffled through some files in the cabinet by his desk, “Ah, here it is! Yes, when you two first came on the scene, lawmakers were concerned about how you were going to interact with law enforcement, and the mayor decided it was best to not even bother. According to this law, you two have carte blanche to do whatever is necessary to find Hawkmoth and bring him to justice. It seems a little excessive to me, but those are the Mayor’s orders. You being superheroes is enough of a warrant, apparently, just keep us informed and let us know when it’s time to arrest the scumbag.”\n“So, we don’t need to tell you where we’re putting up cameras, just that we’re putting them up?”\nOfficer Raincomprix nodded, “That’s right. Honestly, I’m just glad you two have a solid lead to find the guy. I’m excited for this nightmare to finally be over.”\nLadybug nodded, “Us too. Thanks for your help!”\nThe heroes left the police station and vaulted up to the rooftops, running along until they reached their favorite spot on the Eiffel tower. \n“Well,” Chat said, “that was easy.”\n“Yeah…” Ladybug played with her yoyo, “Although I’m kinda uncomfortable with just how much power they gave us. I mean, what if Volpina had actually convinced Paris she was a superhero? What would  she  have done? And they didn’t even tell us!”\nChat thought for a moment, “Volpina probably wouldn’t have used it to find Hawkmoth, which is the condition of the law in the first place. But, yeah, on the one hand I agree with you that it’s too much power for two random kids in masks, but on the other, I’m happy that they trust us so much, and it really does make this whole situation a lot easier. So...I’m torn, but I guess it doesn’t really matter. The mayor gave us this freedom for a reason, we may as well use it.”\nLadybug sighed, “I guess you’re right…”\nChat smiled, “Of course I am, Bugaboo! So now that we know we aren’t breaking any laws, how are we going to do this? Natalie tracks my purchases, so it’s probably better if you’re the one to actually buy the cameras, but I can probably pay for them.”\n“What’s the difference between paying and actually buying them yourself?”\nChat rubbed the back of his neck, “Well, I’ve got a decent cash fund that Natalie doesn’t know about, I’ve been taking a little bit out of my modeling paychecks for years to build it up. I normally use it to buy Plagg’s cheese, but this is a worthy cause too.”\n“Kitty...I can’t ask you to do that…that’s  your  money…”\n“Well, right now, it’s kinda more like Plagg’s money, and we can consider this payback for all the times he left cheese crumbs in my sock drawer!”\nLadybug rolled her eyes, “Kitty…”\nChat folded his arms and gave her a grin, “Too late! I’m paying. I’ll bring the cash by sometime when I can sneak out.”\nLadybug sighed, knowing that nothing was going to change his mind now, “Fine, where are we going to put the cameras.”\n“The mansion.”\nLadybug shot Chat a glare, only to be met with a mischievous grin. He kept smiling, but held up his hands in mock surrender, “Kidding! But no, we should definitely put one in Father’s office, and maybe in the kitchen too, I doubt he gets food for his kwami, but Natalie probably gets enough food for the two.”\n“Good idea...and we’ll need to make sure we don’t get caught putting them up.”\n“Easy, we’ll just have Plagg and Tikki do it for us!”\n“Oh really?” Ladybug put her hands on her hips, “And how are you going to explain to your bodyguard randomly floating cameras?”\n“Ah,” Chat thought for a moment, “Hmm...I’m pretty sure that Gorilla would show me the camera feeds for the house if I asked. As long as I only do it once, it shouldn’t be too suspicious. Then I can figure out where there are blindspots and we can use those so Plagg and Tikki won’t be seen flying with our cameras!”\n“...and I think it’d be interesting to know more about what goes into protecting me, you know?”\nAdrien shifted awkwardly as his bodyguard glared at him. Or maybe it wasn’t so much of a glare as an appraising look and Adrien was just imagining it because the gorilla always looked angry. Either way, there was a long moment of silence in which Adrien was sure that his plan wouldn’t work and they’d have to come up with another way to find the camera's blindspots before his bodyguard grunted and started down the hall. When Adrien didn’t follow, the gorilla turned to look at him and jerked his head, indicating for him to follow and Adrien scrambled to catch up. \nWhen they reached the control room, there was a wall of monitors, each showing different rooms of the mansion. The gorilla sat in the chair and started scanning the camera feeds with well practiced eyes as Adrien stood behind him and looked at each camera feed critically, memorizing what was shown and comparing it with the mental maps he had of the mansion. Adrien smiled, it would be pretty easy for Plagg and Tikki to avoid any cameras with this information. Most of the time, as long as they stayed close to the walls, they’d be fine. \nAdrien’s eyebrows knit together as he scanned over the camera feeds again, “Isn’t there a camera in Father’s office?”\nThe gorilla looked at him and shook his head before turning back to the monitors. Adrien did the same, but wasn’t really seeing the feeds. \n“So there aren’t any other cameras in the house that aren’t shown here?” \nThe gorilla shook his head again and Adrien frowned. There  was a camera in that office, his father had used it to prove that Adrien had stolen the spellbook.\nSo why didn’t the gorilla have access to it?\n\nMarinette hardly glanced up from her literature homework when she heard Chat Noir fall through her skylight. \n\n\n“Ugh! Why do we have to transform to visit your girlfriend? It’s so much work!”\n\n\n“She’s not my girlfriend, Plagg.” Adrien groaned. Marinette kept her eyes on her book in an attempt to hide her blush and tried to ignore the way her heart dropped. Adrien had too much to worry about right now to throw her crush into the mix. \n\n\n“Whatever, just give me my cheese.” Adrien threw a chunk of camembert toward his kwami, who caught it and went to sit with Tikki on the shelf. Adrien himself sprawled on the chaise. \n\n\n“Sorry about him, I’m pretty sure he’s a gremlin disguised as a cat. He literally exists to make my life miserable.”\n\n\n“Not a problem, Adrien, he \n\nis\n\n the embodiment to destruction.”\n\n\n“The destruction of my sanity.”\n\n\nMarinette giggled, “So, is there a reason for this visit, or did you just miss me?”\n\n\nAdrien smiled, “Always, Milady.” He sat up, “But I actually do have something for you.” He pulled a thick envelope from his back pocket and handed it to her with a bow and a flourish, “Cash for cameras, Milady.”\n\n\nMarinette took the envelope and her eyes widened when she saw how much was inside, “Adrien! This is way too much!”\n\n\n“Payback for Plagg being a gremlin, remember?” He insisted, “And besides, I needed to make sure you had enough to get ones that have audio and can automatically stream to your computer. It’d be too risky to have to physically retrieve the camera every time we want to look at the feed.”\n\n\nMarinette pouted but put the envelope in her purse, “I guess you have a point kitty. I’m just not used to handling this much money.” She took a deep breath, “Mamman and Papa said dinner would be ready soon. Would you like any?”\n\n\nAdrien perked up, “Are you sure it’s alright?”\n\n\nMarinette giggled and booped him on the nose, “Of course I’m sure! Like Mamman and Papa said, you’re always welcome here. Besides, I’m pretty sure they show love through food. You just have to promise not to get in a pun war with Papa.”\n\n \n\nAdrien’s eyes twinkled, “No promises.”\n\n\n“And these will automatically stream to my computer?”\n\n\nThe salesperson nodded, “Yep, you’ll just need to follow the instructions in the handbook before placing the cameras. You do need to be careful about battery life if you’re trying to do time lapses, though. The battery will only last about three weeks before you need to charge it.”\n\n\nMarinette nodded, there were akumas every few days, so three weeks should be more than enough time to get what they needed.\n\n\n“Why did you say you wanted these again? You’re not trying to spy on the boy you like, are you?” The salesperson teased.\n\n\nMarinette blushed and flailed her arms, “No bae! I mean, no way! The boy I like’s a model anyway, so I have more than enough pictures of him…” She trailed off, realizing she wasn’t helping her case at all, “I’m a designer, so I need good quality cameras to make videos of my designs and show that they’re wearable and comfortable.”\n\n\nThe salesperson laughed and rang her up, “Don’t worry, I was just giving you a hard time. Good luck with your designing, I hope it goes well!”\n\n\nMarinette nodded and thought of their plan, “I hope so too.”\n\n\nIt was after sunset when Ladybug knocked on Adrien’s window. He hurried to let her in and she transformed as she landed on the floor. \n\n\n“Hey kitty.” Marinette said shyly.\n\n\nAdrien blushed. He went to her room all the time, why was it such a big deal that she was in his room. Oh no, Ladybug was in his room!\n\n\n“U-uh, h-hi Milady.” Adrien suddenly realized he was in his pajamas and he tried to discreetly pull at the hem of his shorts to make the longer, “Fancy seeing you here.”\n\n\nThey were interrupted by Plagg’s laughter, “Oh my goodness! You two are so awkward! I’m gonna fall out of the air laughing!”\n\n\n“Plagg!” Tikki flew out of Marinette’s purse and hit Plagg over the head, “I’m sorry, all these milenia and he still hasn’t learned \n\nmanners!”\n\n\n\n“Manners are boring, sugarcube!” Plagg whined. \n\n\nMarinette rolled her eyes and went to sit on the couch. For the first time, Adrien noticed that she was carrying a plain black backpack. She slung it off her shoulder and opened it. \n\n\n“So, I was able to buy five cameras. They have both visual and audio and I already took the liberty of setting them up so they’ll sync the feed to my computer. I figured we should use mine because if Natalie tracks your purchases, she probably tracks your computer usage too, right?” Adrien nodded, “So yeah, now you can just tell us where the blindspots are and we can have Plagg and Tikki set these up!”\n\n\nPlagg groaned, “You’re making me work? At this time of night? This is animal cruelty!”\n\n\nTikki hit him over the head again, “Shut up and stop being such a lazy bum, Plagg!”\n\n\nAdrien described where the blind spots were before handing the kwamis four of the cameras, “Put on in Father’s office, one in his room, one in Natalie’s room, and the last will go in the kitchen. We’ll keep the fifth camera in reserve, just in case we think of another location or one breaks.”\n\n\nThe kwamis nodded and took two cameras each. Adrien cracked open his door and the two flew out. They went to the kitchen first, since that would probably be the easiest camera to place. They stayed close to the walls and out of sight from both humans and cameras. Plagg took one of Tikki’s cameras, letting her have both hands free to screw the camera into the wall. From where it was, there was an excellent view of the pantry, so they should be able to see any floating food from snacking kwamis. \n\n\nTikki took back her other camera and the two flew to Natalie’s room. Plagg nodded to Tikki, who concentrated and phased through the wall. It took concentration to phase an object with her, so they tried not to do it often, but they couldn’t wait for Natalie to open the door and risk her seeing them. She placed the camera in the corner where there were enough shadows to hide it and it had a good view of the room before phasing back out of the room. \n\n\nPlagg handed her one of the remaining cameras so they both had one, then they flew to Gabriel’s room. This time it was Plagg’s turn to phase through the wall and fix the camera. He ended up setting it half-hidden behind a fake tree, since there wouldn’t be enough shadows to hid it on the ceiling. He froze when he heard the door open and Gabriel walked in. \n\n\nGabriel simply walked past Plagg’s hiding place and strode over to the closet, taking off his garish tie. Plagg shuddered and phased through the wall behind him to meet back up with Tikki. He didn’t need to see \n\nthat.\n\n\n\nFinally, it was time to place the camera in Gabriel’s office. Thankfully, he was in his room, so they wouldn’t have to worry about running into him, but the kwami’s were still nervous. They knew there were cameras in this room, but Adrien hadn’t been able to see the feed and so hadn’t been able to figure out the blindspots. He thought he remembered that the feed didn’t show the ceiling, but there was no way to know if there were other cameras that did. \n\n\nTikki let her power course through her, giving her just a little more luck before the two phased into the office and flew near the ceiling. The portrait of Adrien’s mother seemed to watch them conspiratorially, as if asking them what they were doing. They hurried and mounted the camera in one of the corners, making sure it was in the shadow of the decorative moulding the lined the room, then flew straight back to Adrien’s room.\n\n\n“Did everything go alright?” Adrien asked nervously. \n\n\nTikki nodded, “No one saw us and all the cameras are hidden and secure.”\n\n\nAdrien and Marinette sighed in relief. \n\n\n“So, I guess now’s the hard part.” Marinette said, “Now we have to wait.”\n\n\n“Adrien,” Natalie looked back at him in the rearview mirror from the front passenger seat, “You’ve been texting that bakery girl more often.”\n\n\nAdrien froze, “Marinette?” He asked. Natalie nodded. \n\n\nAdrien’s mind was whirling. He knew Father and Natalie were monitoring his computer, but they had spyware on his phone too? He’d have to tell Marinette to be careful what they said over text. They’d probably have to do all Hawkmoth communication over their miraculous phones from now on, not that they’d ever texted about that much anyway.\n\n\n“Your father is concerned. We want to make sure you have...\n\npositive\n\n influences. Why have you been texting this girl?”\n\n\nAdrien swallowed, “I just think she’s really nice. She’s one of my friends and a really talented designer.” He added the last part hoping that it might convince his father. He waited with baited breath as Natalie’s expression soured.\n\n\n“There are a lot of nice people in the world Adrien, and most are simply pretending because they want something from you. This girl is probably planning on using you to further her own goals in the fasion industry.”\n\n\nAdrien’s heart sunk, what could he say to convince her?\n\n\n“Marinette isn’t like that! I’ve known her for a while now and she’s really nice to everyone, even people like Mr. Ramier who can’t give her anything back. She’s smart and strong and confident. She always stands up for herself and others and her friends are the most important thing in the world to her…”\n\n\nHe trailed off when he noticed Natalie’s expression had softened, “Adrien, be honest with me. Do you \n\nlike\n\n this girl?”\n\n\nAdriend hesitated. He’d always loved Ladybug, but he’d always insisted Marinette was just a friend. Of course he \n\nliked\n\n her, but she didn’t feel the same way. At the same time, would telling Natalie mean he was allowed to keep texting Marinette, or would she think she was some gold digger who was trying to sink her claws in him? He took another look at Natalie’s expression and took a deep breath.\n\n\n“Yeah, I think I do.”\n\n\nNatalie nodded and turned back to her tablet, signaling that the conversation was over. Adrien let out the breath he’d been holding and looked out the window. It wasn’t necessarily approval, but Adrien decided that Natalie ignoring the issue was the best he could hope for. \n\n\nIt had been a few days since they set up the cameras, and almost a week since the last akuma attack and both Marinette and Adrien were getting frustrated by the lack of progress. Sure, they were noticing patterns in Gabriel’s behavior, but none of them were directly related to Hawkmoth. Currently, the two were munching on chocolate chip cookies that Marinette’s parents had insisted they eat and working on literature homework while half watching the camera feeds.\n\n\nMarinette watched as Natalie put her arms around Gabriel like she always seemed to do when he was stressed. \n\n\n“Is your dad dating Natalie?” She asked suddenly. \n\n\nAdrien shrugged, “he insists it isn’t like that, but I think they should just get together already. It’s not like Mother is coming back anytime soon. I mean, she’s been missing long enough that she’s been legally declared dead, so…”\n\n\nMarinette looked at him, “It doesn’t bother you?” \n\n\nAdrien tilted his head slightly, “What, Mother being gone or Father moving on?” \n\n\nMarinette bit her lip, “I don’t know? Either, Both.”\n\n\nAdrien thought about that for a minute, “Well, I miss her, and it still hurts sometimes, but I guess I’ve kinda moved on?” His eyes widened. “Oh my goodness that sounds so bad, like it was a bad breakup instead of one of my parents disappearing.” \n\n\nHe dragged both hands down his face, then looked at Marinette again, “I’ve mourned her, I guess. That sounds a little bit better.” he exhaled heavily, “I don’t mind father moving on. In fact, I think it’d probably be good for him. Healthy. I can tell he still misses mom, but I mean, he shouldn’t be miserable forever. I don’t think mom would want that anyway… I think she’d want him to be happy, even if she couldn’t be there for him.” \n\n\nThey sit in silence for a little while, reading the book Miss Bustier had assigned, but still mulling over the conversation in their minds. \n\n\nSuddenly, Adrien’s eyes widened, “Oh no. what if he’s trying to bring her back?” \n\n\n“What?” Marinette’s eyebrows furrowed in confusion, “What do you mean bring her back?”\n\n\nAdrien looked at her earnestly, “If my father is hawkmoth, why does he want our miraculous so bad? I mean, he’s never mentioned world domination or anything like that before, but you said if our miraculous are combined, the wearer can make a wish, right?”\n\n\n“Yeah…”\n\n\n“So what if he’s going to wish mom was still alive?”  \n\n\nMarinette’s eyes widened and she nodded numbly, “That...would make a lot of sense.” \n\n\n“I know, right?”Adrien jumped up, “Of course he’d want to bring Mom back!” \n\n\nMarinette looked at him hesitantly, “But...Adrien...it’s not that simple, the wish comes with a price, you can’t get something for nothing and to bring back a human life…” \n\n\nAdrien sat down heavily on the chaise as the implication hit him, “A life would have to be taken. My dad is planning murder.”\n\n\nMarinette wanted to lie. She wanted to say that maybe his father didn’t know the cost, but the truth was that if he’d somehow learned about the wish, he definitely knew what that wish would cost. She sat down beside him and put her arm around his shoulders, “If it’s really him, then, yeah, probably.” She sighed, “We could just be chasing shadows, but if he is Hawkmoth, it wouldn’t be the first time he’s killed someone. People have died during akuma attacks before.” \n\n\nAdrien swallowed, “If it wasn’t for your cure, Hawkmoth would probably be one of the most dangerous mass murderers in history… didn’t they estimate that Siren alone killed over half of Paris?”\n\n\nMarinette nodded, “Hawkmoth isn’t afraid to manipulate or even kill to get what he wants. It’s also safe to say that even if we were to try to reason with him, he’s too far gone to listen.”\n\n\nAdrien drew a shaky breath, “We have to catch him.”\n\n\nMarinette held him a little tighter, “We will kitty, I promise.”\n\n\nLila put on her best doe eyes as she pulled out her phone to show Alya the pictures, “Isn’t it just terrible Alya! The famous designer Jules Bisset incorporates a hidden signature into his work and has for decades. I can’t believe that Marinette would stoop so low as to steal another designer’s idea!”\n\n\nAlya was practically vibrating in fury, “And then she got after Chloe for doing the same thing she did herself! I can’t believe that girl! She was just trying to impress Mr. Agreste to get to Adrien!”\n\n\nLila hid her smirk under a look of fake pity, “I’m so sorry, Alya. It’s so terrible when people disappoint you.”\n\n\nShe discreetly looked around the classroom and reveled in the outraged looks of her classmates. She’d made sure to have this conversation when everyone \n\nbut\n\n Marinette and Adrien were around to listen in, knowing that Alya wasn’t capable of being quiet, especially when her emotions got the better of her. After this, Marinette’s reputation would be hanging by a thread and she wouldn’t have any choice but to stay away from Adrien. \n\n\nRight on cue, Marinette walked in the door, followed by Adrien. He’d taken to waiting for her by the front doors the last few days, a fact that annoyed Lila to no end, but worked well for her plan today. Afterall, what better way to show that Marinette was stealing design ideas to get closer to Adrien than to let her walk into class with the boy. \n\n\n“I can’t believe you!” Alya yelled, “How are you not ashamed of yourself?”\n\n\nMarinette’s eyes widened in shock and confusion while Adrien immediately glared at Lila, “What did you do?” He said through gritted teeth. \n\n\n“I just told them how Marinette stole the idea of signing her work from another designer,” Lila said innocently, “Why are you mad at me for telling the truth?”\n\n\n“I can’t believe you were so mad at Chloe for stealing your hat design when you were stealing ideas all along!” Alya seethed. \n\n\n“Yeah, not cool dude.” Nino shook his head. \n\n\n“I-I didn’t!” Marinette stuttered out, “I swear, I’ve been inspired by other designers, but I’ve never \n\nstolen \n\nfrom them!”\n\n\nAdrien clenched his fists, “A lot of designers sign their work! That’s like saying everyone who’s ever designed with lace stole it from the guy who did it first!”\n\n\n“Settle down, class,” Miss Bustier said as she walked in, “did everyone do the reading last night?”\n\n\nAdrien was in the front row, so he couldn’t see it, but he could practically \n\nfeel\n\n all the glares and hatred directed at Marinette for the next hour. He hated it! How could these idiots not realize how amazing Marinette was? How were they falling hook, line, and sinker for an obvious liar. It just wasn’t fair! How dare they treat Marinette like that?\n\n\nAs soon as class was over, Marinette walked calmly out of the room for break. Adrien followed her to an empty classroom a few hallways over. He closed the door behind them and went to hug her. \n\n\n“Are you ok?”\n\n\nShe nodded, “I’m used to it by now.”\n\n\nAdrien saw red, “You shouldn’t have to be \n\nused to it\n\n!” he yelled. He decreased his volume when Marinette flinched, “It’s just you’re amazing and no one gets to treat my lady like this. You don’t deserve any of this!”\n\n\nMarinette got a scared look on her face and Adrien looked behind him, only to rear back when he saw the purple butterfly. He shoved Marinette away, mind racing as he considered if it was possible to somehow destroy the butterfly before it reached her, but to his surprise, the butterfly didn’t change course, instead continuing it’s flight directly toward him.\n\n\n“Adrien, it’s going for you! You need to calm down!”\n\n\nAdrein was hyperventilating. Was he really about to be akumatized?\n\n\n“Trust me, Kitty! Take a deep breath in with me, then out. In, out!”\n\n\nAdrien followed her voice on instinct, letting her guide him through a breathing exercise as the akuma stopped advancing, then slowly started fluttering away. As soon as it was gone, Adrien collapsed as soon as it was gone and Marinette ran to him and threw her arms around him. \n\n\n“Hey, kitty,” She said softly as she wiped a few tears from his cheeks, “It’s gonna be ok. You did it.”\n\n\nThey sat there for a few minutes until a loud alarm sounded, “Akuma Alert. Akuma Alert. Please evacuate the building. Ladybug and Chat Noir are expected to resolve the situation shortly.”\n\n\n“Guess that’s our cue, kitty.” Marinette gave him a small smile and he nodded and transformed. \n\n\nHonestly, he didn’t know how Marinette had been doing this for months. He didn’t want to fight an akuma right now. \n\n\n//\n\n\nAlya was already filming when Ladybug and Chat Noir arrived, “Hey lady bloggers! It seems like Hawkmoth is really scraping the bottom of the barrel with this one. It appears that this akuma \n\nreally\n\n wants to tie everyone’s shoelaces together.”\n\n\n“Be careful, Alya!” Chat Noir said with a strained smile, “We wouldn’t want you to \n\ntrip us up!\n\n”\n\n\nLadybug rolled her eyes, “Seriously, Chat? Shouldn’t you be more worried about how we’re going to \n\ntie this up?\n\n”\n\n\nChat gasped in delight, “Milady! I thought you were too straight-laced\n\n for puns!\n\n”\n\n\n“Ladybug, Chat Noir! I am Lacey! Give me your miraculouses or I will tie your shoelaces together!”\n\n\nBoth heroes looked down at their feet, then back at the akuma.\n\n\n“Yeah,” Chat said slowly, “I think you’re gonna need to find a different threat.”\n\n\nLadybug giggled, “Silly kitty!”\n\n\nHe raised his hands in surrender, “Hey, I’m not the one who forgot neither of us have shoelaces!”\n\n\n“Enough!” Lacey shot a series of shoe laces at them like whips, but the heroes just dodged out of the way. \n\n\n“The akuma’s in her shoelaces?” Chat asked.\n\n\nLadybug shrugged, “Probably, but it’ll be difficult to get close enough to destroy them without getting grabbed.”\n\n\nHe smiled at her, “Then I guess I better \n\naglet \n\nyou take care of it!”\n\n\nLadybug groaned and dodged another attack from the akuma’s shoelaces before throwing her yoyo in the air, “Lucky Charm!”\n\n\nA roll of fly tape dropped into her hands and she looked around. She grabbed one end of the tape and threw the main roll to Chat.\n\n\n“Kitty! Pretend you’re chasing a laser pointer!”\n\n\n“Hey!” Chat cried indignantly, but started running around at random, pulling out more and more of the tape as he did so. Every time Lacey tried to catch him in her shoelaces, he’d dodge at the last minute and the laces would get caught on the tape. Within minutes, the shoelaces were nothing more than a tangled mess. \n\n\n“Well, I guess you’re all \n\ntied up\n\n.” Chat smirked at Ladybug, who smiled and rolled her eyes. “Cataclysm!” The shoelaces dissolved away into nothing and ladybug caught the butterfly as it tried to fly away.\n\n\n“No more evil doing for you, little akuma!” She smiled and waved, “Bye bye, little butterfly!”\n\n\nChat smiled widely at her and held out a fist, “Pound it!”\n\n\n“Ladybug! Chat Noir!” Alya yelled, “Would you mind answering a few questions?”\n\n\nChat bristled, but Ladybug just placed a hand on his shoulder, “Sure, we still have a few minutes before we change back.”\n\n\n“Ok!” Alya held her phone out in front of her,.“So it seemed like you two were super in sync today! Is there any reason for that?”\n\n\nLadybug and Chat looked at each other. The real reason was because they’d finally revealed their identities, but they couldn’t say that. \n\n\n“Well, let’s just say we’ve been getting to know each other better lately.” Chat wiggled his eyebrows suggestively and Ladybug cuffed him over the head as he laughed. \n\n\nAlya’s eyes took on a wicked gleam, “Does this mean that LadyNoir is closer to being a reality?”\n\n\nLadybug sighed, “I’m not going to say it’s never going to happen, but for right now, our focus is on finding Hawkmoth and bringing him to justice. Now if you’ll excuse us, it’s time for us to leave.”\n\n\nShe grabbed Chat by the hand, who looked like he was over the moon, and they both vaulted away. Alya turned her camera around so her viewers could see her face, “There you have it guys!” She said with a wide smile, “You heard it here first! Ladybug is totally open to a relationship with Chat Noir. Here’s hoping they catch Hawkmoth soon so they can \n\nget together already!\n\n This is the Ladyblogger, signing off!”\n\n\nAdrien snuck out the night of the akuma attack and made his way to Marinettes. He peeked into her room to make sure her parents weren’t there before dropping down onto the bed and detransforming. He shot a quick text to Tom that he’d arrived and jumped off her bed, landing in a crouch on the floor below. \n\n\nMarinette shook her head, “You know, not every movement needs to be a production.”\n\n\nAdrien smiled, “But it’s so much more \n\nfun\n\n that way, princess!”\n\n\nMarinette sighed, but smiled, “So are you ready to look at the camera feeds from this morning?”\n\n\nHe looked at her, “You haven’t already looked at them?”\n\n\nShe shook her head and played with her hands, refusing to meet his eyes, “I wanted to wait for you. You know, just in case…”\n\n\nHe exhaled slowly, “Yeah. I get it. Let’s just get this over with. It’s the not knowing that’s killing me.”\n\n\nMarinette nodded and pulled up the camera feeds, “The akuma showed up around 10:00, so we should go back about a half hour? See what happens?”\n\n\nShe synced it up and started playing the videos at double speed from about 9:30 that morning. She slowed them down to normal speed when she saw Gabriel enter his office at about 9:40. Instead of sitting down at his desk to design, he went to stand in front of the large portrait of Adrein’s mother. \n\n\n“That’s where the safe with the spell book was, right?” Marinette asked. Adrein nodded. \n\n\nGabriel pressed a few panels in the painting, activating a hidden elevator beneath his feet. Marinette looked to Adrien, who simply held up his hands, “Hey, don’t look at me, I had no idea that was there!” \n\n\nThe floor closed again as soon as Gabriel was gone and they waited. According to the video live-streamed to the ladyblog, Marinette had finally cleansed the Akuma around 10:45, so they played the video at double speed until a few minutes before then. At 10:50, Gabriel finally reappeared in his office. He loosened his tie slightly and sat down heavily at his desk with his head in his hands. \n\n\nNatalie came in almost immediately and looked at him softly, “It didn’t work?” \n\n\n“You already know it didn’t work!” Gabriel snapped. “It never works.” \n\n\nNatalie went to stand behind him and put her arms around his chest, leaning her head on his shoulder, “You just need to keep trying, Gabriel. Someday Ladybug and Chat Noir will slip up and that’s when you’ll get them. You’re smart and capable and motivated by love, so it’s only a matter of time before you get the miraculous.” She smiled slightly and tightened her hug, “I believe in you.”\n\n\nGabriel sighed and leaned his head over to rest on Natalie’s, “Thank you, Natalie, I don’t know what I would do without you.”\n\n\nThe two stayed there for a few minutes before Natalie left and Gabriel got back to designing. Marinette reached over to pause the video feed, then looked at Adrien, who was staring numbly at the screen. \n\n\n“My own father tried to akumatized me.”\n\n\n“Adrien…” Marinette said softly. He turned to look at her desperately. \n\n\n“My own father, Marinette! He was willing to \n\nuse\n\n me and turn me, \n\nhis own son\n\n, into a villain!” He stood to pace around the room. “Do you realize how messed up that is? At least before, I could say that he didn’t know he was hurting me because he didn’t know I was Chat Noir, but today he tried to akumatize me \n\nknowing\n\n that I was his son. That’s not even counting all the times I’ve been actively targeted by akumas or even the times I was collateral damage. He \n\nknows\n\n what he’s doing is hurting people, he knows it’s hurting \n\nme\n\n and he’s still doing it!” Adrien paused, and looked at Marinette, “Do you think he even cares about me at all?”\n\n\nMarinette opened and closed her mouth a few times. What was she supposed to say in this situation?\n\n\n“I don’t know, Adrien,” She said tearfully. “I want to say that he’s your father, so of course he loves you, but...I’m sorry. I just don’t know.”\n\n\nAdrien ran his hands through his hair, “Would you mind watching for akumas?”\n\n\nMarinette nodded and moved to the chaise, allowing Adrien to sit down beside her and rest his head in her lap. She played with his hair and kept watch as he cried. At one point her parents had poked their heads in, but Marinette had simply shaken her head and they left quickly. It was pretty late by the time that Adrien wiped the tears off this face and transformed, promising to talk to her tomorrow. \n\n\nMarinette walked down to the kitchen, where her parents were busy cleaning up. When Sabine saw her, she threw open her arms and Marinette ran to her, crying in her mother’s arms. \n\n\n“Is Adrien already gone, sweetie?” She asked softly.\n\n\nMarinette nodded into her mother’s chest. \n\n\n“Did he say what he was upset about?” Tom asked, “Is there any way we can help?”\n\n\nMarinette took a deep breath, “Adrien’s father isn’t a good dad. He only sees Adrien about once a month and those times are usually just to scold him. It sucks and it’s part of the reason he sneaks out and comes here. Lately though… it's been getting worse, I think. If something happens...well, I don’t know, but if things keep going the way they are Adrien might not be safe at home anymore.”\n\n\nMarinette’s parents looked at each other silently for a long minute, then led Marinette over to the kitchen table, where they all sat down. \n\n\nTom placed his hand over Marinette’s, “What would you like us to do, sweetie?”\n\n\n“I,” She hesitated, was she asking too much? “I’d like to register our family in the foster system. We don’t have to really do anything, if you don’t want to, but I want to make sure that Adrien has a safe place to go if he ever needs it. Does that make sense?”\n\n\nTom and Sabine shared a look before nodding. Sabine hugged her daughter, “Adrien is always welcome here. You’re a really good friend to him, Marinette.”\n\n\nTom nodded, “We’re really proud of you, sweetie.”\n\n\nMarinette sniffed as she started to cry, “Thanks. You guys are amazing.”\n\n\nTom smiled, “Well, now that that’s decided, how about I make us some hot chocolate?”\n\n\nMarinette laughed and nodded. Adrien would be ok. \n\n\nShe would make sure of it. \n\n\nAdrien had decided it was impossible to get a good night’s sleep the night after you cried your guts out. Or maybe it was just impossible to get a good night’s sleep the night after finding out your father was a supervillain who had knowingly tried to emotionally manipulate you and unknowingly tried to kill you. Either way, Adrien was fighting off a headache and had enough cover up under his eyes that he could practically feel it caking. \n\n\n“Yo, dude, you ok?” Nino laid a hand on his shoulder, but Adrien just grunted tiredly in response. He wasn’t sure he trusted words right now. \n\n\n“Oh Adrien!” Lila clung to his arm and placed the back of her hand against his forehead. “Are you sick? Maybe you should take the day off! I’d be happy to bring you your homework.”\n\n\nAdrien hardly bothered to conceal his disgust as he pushed her away, “I”m fine, \n\nLila\n\n, I just didn’t sleep well last night.”\n\n\nShe pouted, “I'm just trying to help.”\n\n\nAdrien sighed and rolled his eyes, “Well you can start by trusting me when I tell you I’m fine.”\n\n\nLila glared at him for a moment before smiling, “Of course, silly me! Well, I hope you get feeling better.”\n\n\n“Alright class, settle down!” Miss Bustier stood up in front of the class and Lila slunk off to her seat in the back row. Adrien stared at the board, but wasn’t really absorbing anything until Marinette came rushing through the door five minutes later and placed a coffee and croissant in front of him before stumbling into her own seat. Nino raised an eyebrow at him, but Adrien just shrugged and gave Marinette a half-hearted smile, which she returned with a deadpan glare, \n\nyou don’t have to pretend you’re alright, you know.\n\n\n\nHe let his smile fall as he turned back around and bit into the croissant. Definitely not as good as having a father who actually loved you, but Adrien figured it would have to do. He felt his phone buzz in his pocket and glanced at it under the table when Bustier turned to write something on the board. \n\n\nMarinette\n: Don’t worry about it. I’ll send you my notes later. \n\n\nAdrien nodded absently, knowing Marinette would be able to see the gesture, and allowed himself to space off. If Miss Bustier ever called on him to answer a question, he didn’t know, but he couldn’t really bring himself to care anyway.\n\n\nHe still wasn’t listening as he packed up his bag to go to lunch, at least until he heard Lila’s obnoxiously loud whisper, “Yeah, he texted me that Marinette was calling him all night asking for updates for something she submitted to Gabriel. I mean, I understand being anxious, I’ve struggled with an anxiety disorder for years, but I’m just saying her timing could be a bit better. \n\n\nAdrien grit his teeth as he could practically \n\nfeel\n\n Marinette freeze behind him. He took a deep breath. Now was \n\nnot\n\n the time to be akumatized. \n\nNow was not the time to be akumatized\n\n. \n\n\nMarinette rushed past him, obviously pretending she hadn’t heard, even though she definitely had. Everyone had, judidng by the glares her classmates gave her as she ran. Adrien simply sighed and glared at Lila before rolling his eyes and following Marinette out the door. Maybe if she went to the bakery, she would bring him something back? He almost wished they could just arrest his father already so he could go where he wanted for lunch and finally ask Lila to leave him alone. \n\n\nAdrien’s eyes widened and he stopped in his tracks. If he and Marinette arrested his father...Hawkmoth wouldn’t be around to akumatize Lila. Plus, he, as the son of a supervillain, wouldn’t have any reputation left to protect by keeping silent any longer. Basically, once his father was in prison, there was literally nothing keeping him from exposing her and saving Marinette. \n\n\nFor the first time since he’d seen the video yesterday, Adrien smiled sincerely. It \n\nwas \n\nhis job as Chat Noir to protect Ladybug, wasn’t it?\n\n\nMarinette rubbed her eyes as she flipped through the new camera feeds. She’d suspected that Adriend wouldn’t be able to sleep well, but she hadn’t been expecting him to text her after school telling her that he and plagg had moved around the cameras in the middle of the night. Plagg had explored the secret entrance and discovered that there were actually two lairs, so of the five total cameras they had, Adrien had decided to put two in each lair and leave the one they’d already placed in Gabriel’s office.\n\n\nOne lair was just dark, she and Adrien didn’t know if it was even in use, but as much as she adjusted the quality of the second lair’s feed hoping the image would change, it never did. Emilie Agreste could have passed for snow white, complete with glass coffin, and Marinette was debating what she was going to say to Adrien. She hadn’t wanted them to be right about that part. \n\n\nShe looked up at her skylight, normally Adrien would have come over by now, right? Had something happened? Had Gabriel discovered what was going on?\n\n\n“Marinette!” Tikki flew into her face. “Stop panicking! Just text Adrien and ask him if he’s ok! You can even call if you need to hear his voice.”\n\n\nMarinette took a deep breath, “You’re right Tikki,” she took out her phone, “I can just Ahhh!” she dropped her phone in shock as the skylight opened and Adrien dropped down.\n\n\n“Sorry Marinette!” Adrien looked slightly panicked. “I didn’t mean to scare you!”\n\n\nMarinette blinked a few times and shook her head, “It’s no grig beal, I mean it’s no big deal!” She sighed. “You were just later than usual and I was about to call you because I was panicking because I didn’t know if your father found out or if I was going to have to come rescue you and then we wouldn’t…”\n\n\nAdrien gripped her shoulders to steady her, “I’m ok, Marinette! I’m sorry I’m late, I was just...working on a project.” \n\n\nMarinette looked at him suspiciously, but he just gave his best innocent smile. \n\n\n“Alright then,” she rolled her eyes, “keep your secrets.” She fiddled with her mouse for a long moment. “Umm...Adrien, about those camera feeds...”\n\n\nAdrien sighed, “You mean my mother just lying there in a glass coffin? Yeah, Plagg already told me.”\n\n\nMarinette gave a quiet breath of relief. She wouldn’t have to be the bearer of even more bad news, “I’m sorry.”\n\n\nAdrein shrugged, “We figured it was a possibility. I just...I wish I knew how she got there, you know? Maybe it was something to do with the miraculous in the first place, or maybe she really did just get sick like Father said, but we won’t know until he’s behind bars. Speaking of which, we need to figure out how we’re gonna take him down, Milady.”\n\n\nMarinette nodded, “Yeah, I’ve been thinking about a few potential strategies, it’s just that…”\n\n\nAdrien tilted his head slightly, “That what?”\n\n\nMarinette sighed, “It’s just that we need to decide if we’re going to be including any other miraculous holders in the plan.”\n\n\nAdrien frowned, “Well Chloe’s out, this plan needs to actually be kept a secret, but why wouldn’t we include Carapace and Rena Rouge.”\n\n\nMarinette groaned and hit her head against the desk, “It’s complicated.”\n\n\nAdrien snorted unsympathetically, “Our life’s complicated Bugaboo, try again.”\n\n\n“Renarougeandcarapacearealyaandnino.” She grumbled. \n\n\nAdrein raised an eyebrow at her, “Sorry, Bugaboo. Didn’t quite catch all that.”\n\n\nShe took a deep breath, “Nino and Alya are Carapace and Rena Rouge.”\n\n\nAdrien’s eyes widened for a moment as he took that info in, then he scowled, “Those jerks! You trust them with miraculouses, but they won’t even have your back when Lila is obviously trying to sabotage you?”\n\n\nMarinette shook her head, “They don’t know that I’m the one that gave them their miraculous. As far as they know, they’ve never given Ladybug and Chat Noir any reason to distrust them.”\n\n\n“Doesn’t mean they couldn’t at least try to fact check what Lila says.” Adrien grumbled. “I don’t think we use them, Milady. If we can’t trust them to have our backs as civilians how can we trust them to have our backs as heroes?” He took in her unsure expression. “You don’t agree?”\n\n\nMarinette bit her lip, “I do! It’s just...I really don’t know if we can do it without them.”\n\n\nAdrien thought for a moment, “We could always try to find new holders?”\n\n\nMarinette groaned, “But then we’d have to take the time to train them and there’s the potential that Alya and Nino would be akumatized over the whole thing, which is a disaster I’d really like to avoid if we can. Alya and Nino trust Ladybug and Chat, plus they already know how to use their powers.” Marinette huffed. “And if we include them, we can use the Ladyblog to our advantage.”\n\n\nAdrien gestured for her to continue and she took a deep breath, “We’ll be the ones taking the miraculous as soon as Hawkmoth and Mayura are unmasked. If we’re not careful, it could come down to our word against theirs that they really were supervillains. But if we were to give Alya access to the camera feeds…”\n\n\nAdrien smiled, “Then she could live stream the whole fight and there wouldn’t be any doubt. You really are so amazing, Marinette.”\n\n\nMarinette blushed  and looked away, “Oh, shut up.”\n\n\nAdrien smirked, “Why should I Bugaboo? You’re the \n\ncat’s meow.\n\n”\n\n\nMarinette rolled her eyes, “So should I pick up the fox and turtle tomorrow so we have them ready.”\n\n\nAdrien pouted, “I don’t have to like it, do I?”\n\n\nMarinette giggled and tapped his nose, “No, silly kitty, but you do need to be able to work with them. If not, we’ll never pull off what I have in mind.”\n\n\n“Oh?” Adrien’s eyes lit up. “And what exactly is that?”\n\n\nAdrien and Marinette ran to the janitor’s closet as soon as the akuma alert sounded. Thankfully the school was being evacuated, so they didn’t look suspicious for running off, but they would need to find Alya and Nino before they got too close to the akuma. \n\n\nThey transformed quickly and Chat paused with his hand on the door handle. \n\n\n“Kitty?” Ladybug put a hand on his shoulder. “What’s wrong?”\n\n\nChat let out a long breath, “It’s just...nothing’s going to be the same after today.”\n\n\n“I know.” Ladybug said softly. “But at least it’ll all be over, right?”\n\n\nChat nodded, “But I’m going to be alone.”\n\n\n“Look at me.” Ladybug said earnestly. “You are not going to be alone, Kitty. I will \n\nnever\n\n leave you, do you understand? You and me against the world, remember?”\n\n\nChat took a deep breath, “You and me against the world.”\n\n\nLadybug went up on her toes and kissed his cheek, “And don’t you forget it. Now let’s go fight a supervillain.”\n\n\nAlya dragged Nino along by the hand as they ran toward the akuma. It was a big, ugly thing with wrecking balls for hands that was wreaking havoc downtown, apparently content with destruction of property until Ladybug and Chat Noir showed up. She hadn’t bothered to start recording yet, since she couldn’t actually see the akuma, so she didn’t have to come up with an excuse to end the stream when Ladybug and Chat Noir landed in front of them with miraculous boxes in their hands. \n\n\n“Alya Cesaire, Nino Lahiffe, these are the miraculouses of the fox and turtle, which grant the power of illusion and protection. When the mission is complete, you will return the miraculous to us. Do you accept?”\n\n\n“As always, Ladydude!” \n\n\nAlya put the necklace on, “But I don’t really understand, this akuma seems pretty standard. Why do you need us?”\n\n\nLadybug glanced at Chat Noir, “Because we’re not going to be fighting the akuma.”\n\n\n“What…?”\n\n\n“Transform and we’ll explain on the way.” Chat said sharply. \n\n\n“Alright, no need to get your panties in a twist.” Alya replied, then leaned toward Nino,  “I wonder who put bees in his bonnet?”\n\n\nNino shrugged, put on his bracelet, and grinned as he and Wayzz did their little handshake, “Hey little dude! You ready?” Wayzz nodded. “Alright then, Shell on!”\n\n\n“Trixx, let’s pounce!”\n\n\n“Alright.” Chat said. “Follow us.”\n\n\nRena and Carapace followed Chat and Ladybug in the opposite direction of the Akuma until they stopped and crouched down on the roof of the Agreste mansion.\n\n\n“Umm, Ladydude?” Nino asked. “Why are we at Adrien’s place?”\n\n\nLadybug glanced at Chat, who nodded and turned away. There was just something so \n\noff\n\n about Chat today that Rena couldn’t put her finger on. \n\n\n“We recently discovered that Gabriel Agreste is Hawkmoth.” Ladybug said. “We need your help to bring him down.”\n\n\n“Adrien's pops? I knew he was evil, but…” \n\n\n“Does Adrien know?” Rena asked.\n\n\n“Adrien didn’t have anything to do with this!” Chat growled.\n\n\n“I didn’t say he did.” Rena said. “But if it’s his dad...does he know yet?”\n\n\nChat sighed, “Yeah, he knows. We put him someplace safe before we came and got you. Now can you two just shut up and listen to the plan?”\n\n\n“Chat..” Ladybug warned.\n\n\nChat huffed, “Fine, I’ll be civil.”\n\n\nRena and Carapace exchanged a glance. What was up with him?\n\n\nLadybug turned to them and smiled, “Here’s the plan. We don’t only need Rena Rouge the hero, we need Alya Cesaire the ladyblogger.” She handed Rena a slip of paper with a series of links. “Those are links to the camera feeds we have set up in Gabriel’s office and one of his lairs. Can you set it up so you can live-stream the footage to the Ladyblog on your command? You might be able to do it from your flute, but it’s probably better to do it from your civilian phone, since that’s more familiar. We don’t want any technical difficulties.”\n\n\nAlya nodded and detransformed. She typed in the links and started syncing them to the Ladyblog, “Do you want me to start streaming them right now?”\n\n\nChat shook his head, “We’ll tell you when to make each camera live. It’s possible to do them separately, right?”\n\n\nAlya nodded, “It’ll take me a minute or so to set up, since I’m not used to doing multiple live streams at a time, but don’t worry, I know what I’m doing.”\n\n\nLadyblog smiled, “You’re the best, Alya!”\n\n\nAlya smiled at the praise and worked for a few more minutes until she had everything set up, ignoring all the messages from people wondering why Ladybug and Chat Noir hadn’t shown up yet, “I should probably send out a message to my viewers real quick before I transform so they know to be watching. Would that alright?”\n\n\nChat shrugged, “You’re the expert.”\n\n\nAlya nodded and stood against a blank chimney so none of the heroes were in the shot and no one would be able to tell exactly where she was, “Hey peeps! The one and only ladyblogger here, live from Paris. I know you’re all wondering what’s going on, but just know that there’s going to be a very special live-stream in a few minutes, so stay tuned! Ladyblog out!”\n\n\nShe ended the video and transformed, keeping her civilian phone in a secret pocket beneath the tail of her costume, “There, now Paris is watching. What next?”\n\n\n“Make the streams from the lair live.” Ladybug said.\n\n\n“Not the office?” \n\n\nChat shook his head, “Not yet. I’ll give you a thumbs up when we’re ready for that one.”\n\n\nLadybug smirked as Alya typed the command to make the feeds live, “Alright, let’s go have a chat with Mayura.”\n\n\nNatalie refreshed her tablet one more time before striding over to Emilie’s painting. She had to warn Gabriel not to detransform, then they’d find a way to take care of those pesky cameras. They’d also have to find some way to punish the ladyblog for publishing that footage so something like this didn’t happen again. \n\n\nSuddenly, there was a crash and Ladybug crashed through the window of Gabriel’s office and knocked the tablet out of Natalie’s hand, “Not so fast, Mayura. Give us your miraculous!”\n\n\nLadybug threw the tablet to the ground and stomped on it so Natalie wouldn’t be able to tell when the office footage went live. Since Natalie didn’t know there was a camera in the office and Gabriel didn’t know there was a camera in the lair, the villains wouldn’t bother to hide their transformations. Or at least, that’s what Ladybug was counting on. \n\n\nThe other heroes landed in the office as Ladybug as Natalie stared each other down. Chat glanced at his partner before discreetly putting one hand behind his back and giving Rena the thumbs up to publish the office feed.\n\n\nNatalie glared at Ladybug, “You kids don’t know what you’re up against. He won’t stop, his reasons…”\n\n\n“Yeah, we know all about his \n\nreasons\n\n.” Chat hissed. “But as noble as he thinks they are, they still aren’t any excuse for terrorism. Now give us the peacock.”\n\n\nNatalie stared at them all coldly, “Dusuu, Spread my Feathers.”\n\n\nMayura charged Ladybug, but Chat stepped in front of her and grabbed Mayura by the arms, flipping her over his head. Ladybug tried to grab onto Mayura’s ankles with her yoyo, but Mayura flipped in midair to land behind her. Unfortunately for her, the fight was four on one and she was now backed against the wall. \n\n\nMayura glanced at the heroes before pulling a feather from her fan and clenching it in her fist. Dark magic bubbled around it as she blew, but Ladybug didn’t bother to see where it was headed before catching it in her yoyo and purifying it. \n\n\n“Oh come on dude.” Carapace laughed when Natalie looked surprised. “You didn’t really think we were going to let you make a sentimonster, did you?”\n\n\nMayura charged at him desperately, but Carapace simply aimed his shield at her face. She dodged the blow, which unfortunately left her wide open for Rena to hit her in the gut with her flute. Before Mayura could recover, Ladybug wrapped her in her yoyo string. \n\n\n“Chat, if you’d do the honors.”\n\n\n“Glady Milady.” Chat was deadly serious as he plucked the peacock from her shirt, and put it in his pocket, forcing her to detransform. “Rena, take Natalie outside. The police should be here by now. They’ll take care of her.”\n\n\nRena nodded and grabbed Natlie roughly by the arm as Ladybug let go of her. Natalie tried to put up a fight as she was dragged away, but she started coughing once she didn’t have the strength of her transformation to sustain her. \n\n\nChat and Ladybug walked up to the painting and Chat entered the code he’d memorized from the footage they’d gathered in the past few weeks. There was a mechanical whirring as the painting and part of the wall behind it  swung out, revealing a stairway winding upward to Hawkmoth’s upper lair. Carapace followed them as they tiptoed up the stairs until they reached a door at the top. \n\n\nAs Ladybug was about to open it, she glanced at Chat, “Are you gonna be ok?” \n\n\n“No.” Chat said tightly, “But I’m ready to fight. Like you said, this’ll all be over soon. And I’ll always have you, Milady.”\n\n\nLadybug smiled and nodded, pushing open the door. Hawkmoth was standing in a patch of light from the open window and the butterflies on the floor rustled their wings as the heroes stepped into the room. \n\n\n“What is it, Natalie?” Hawkmoth snapped, “Can’t you see I’m busy?” \n\n\n“I’m afraid your girlfriend’s kinda busy right now.” Chat said. As he predicted, that pissed Gabriel off and he whirled around to stare at the heroes with rage. Good. \n\n\n“Are you going to come quietly HawkDude or do we get the honor of punching you in the face?” Carapace asked. \n\n\nA butterfly outline appeared around his face, “Destructor! Change of plans, Ladybug and Chat Noir are here, so come to me \n\nnow!\n\n”\n\n\n“I guess that’s our answer.” \n\n\nHawkmoth growled and rushed at them with his sword-cane, so Chat ran forward to meet him, wielding his staff like a sword. Hawkmoth seemed to be a little more skilled than Chat was, but he also had to deal with Ladybug trying to trip him and Carapace throwing his shield at him. After a few minutes, as he sidestepped to dodge Ladybug’s yoyo, he stepped right into the path of Carapace’s shield, which knocked him to the ground. \n\n\nLadybug was about to tie him up when the wall exploded under the force of a wrecking ball, distracting the heroes long enough for Hawkmoth to get to his feet.\n\n\n“Don’t worry about this guy, dudes, I’ll take care of it.” Carapace yelled. “Shelter!”\n\n\nA large green sphere surrounded the akuma, who started beating it with it’s fists, causing it to shudder, but thankfully the shield held. Chat nodded at Carapace before turning back to Hawkmoth. Holding Shelter was going to take too much concentration for Carapace to help them now. \n\n\n“I think it’s about time we use a little luck, Milady.”\n\n\nLadybug nodded, “Lucky Charm!”\n\n\n“A blanket?” Chat asked. “Is that a sign that we should \n\nwrap things up?\n\n”\n\n\nLadybug smiled, “I think that’s the first time you’ve punned this entire fight.”\n\n\nChat stopped for a moment, then smiled, “Maybe it’s just because you’re so \n\ncomforting.”\n\n\n\n“Enough!” Hawkmoth yelled. “Ladybug, Chat Noir, give me your miraculous! Maybe if you surrender now, I’ll give them back after I’m through with them.”\n\n\n“Even if we believed you, which we don’t,” Chat said, “the price of bringing back the dead is too high. You \n\nknow\n\n that Hawkmoth. Just think for a moment, do you really believe your wife would be happy with what you’re doing? Emilie wouldn’t want you to kill someone just so she could live!”\n\n\n“You know nothing about her!” Hawkmoth growled. “Emilie and I talked about this when she started feeling the effects of the Peacock. This was \n\nalways\n\n the plan!”\n\n\nChat froze, “S-she \n\nknew\n\n?”\n\n\n“Chat! Watch out!”\n\n\nHawkmoth lunged, his sword pointed at Chat’s heart, but Ladybug leaped forward to take the blow, knocking Hawkmoth to the ground as she landed on top of him.\n\n\n“Ladybug!”\n\n\nLadybug rolled off Hawkmoth, his sword tangled harmlessly in the blanket, “Come on, Kitty, do your thing.” \n\n\nChat smiled, “Chataclysm!”\n\n\nHe touched a single finger to the floor and a large crack appeared before the floor beneath Hawkmoth collapsed, trapping him up to the waist. Chat rushed forward and punched him in the nose and was rearing back for another punch when Ladybug rushed forward and held him back, “It’s over, Chat.”\n\n\n“Not quite,” Hawkmoth growled as he tried to pry himself from the floor, but Ladybug just pinned his arms to his sides and plucked the brooch from beneath his chin. \n\n\n“No.” She said. “It’s over.”\n\n\n“Umm, dudes?” Carapace called. Chat and Ladybug turned to see large cracks appearing in the shield surrounding the akuma. “I think we’re out of time.”\n\n\nDestructor slammed his wrecking balls into the shield one last time as it shattered like glass. Chat looked between Ladybug and Gabriel, “You stay here and make sure he can’t get away, Milady. Carapace and I can take care of him.”\n\n\n“Oh, don’t forget about me!” Rena called out as she appeared at the top of the stairs. “Natalie is safely in custody, so I’m ready to fight!”\n\n\n“Good! Quick! Cast illusions of all of us so Destructor doesn’t know which ones are real!”\n\n\nRena played a few notes and the room was filled with duplicates as Destructor waved his arms around trying to destroy as many as he could. Ladybug caught Chat’s eye and glanced down toward the blanket that had fallen to the floor. Chat nodded and scooped up the blanket, flinging it in Destructor’s face. \n\n\n“Carapace! Use your shield to destroy the chain on his right wrecking ball, it’s a slightly different color than the rest of him!”\n\n\n“Will do Ladydude!” Carapace slammed his shield into the chain a few times until it snapped and the akuma came flying out.\n\n\n“I’ll hold onto Hawkmoth, Ladybug.” Rena ran over and grabbed Gabriel’s arms. “Your turn.”\n\n\nLadybug nodded and flung her yoyo, “Time to de-evilize!”\n\n\nDark magic bubbled around Destructor as Ladybug purified the akuma, revealing a little boy with a broken toy truck, “What? Ladybug?”\n\n\nThey were interrupted by a chorus of beeps. Carapace grabbed the blanket and tossed it to Ladybug, who immediately threw it in the air, “Miraculous Ladybug!”\n\n\nChat pulled Gabriel roughly to his feet as the floor repaired beneath him, “Come on, Gabriel, time to go.” \n\n\nThey all jumped out the large window of the lair and landed in front of Officer Roger who was waiting for them outside along with a fleet of police cars.  \n\n\n“Officer, this is…”\n\n\n“We know Ladybug, we were watching the stream.” Roger smiled. “We’ll take care of things from here. You four are about to detransform.”\n\n\nLadybug nodded gratefully as Roger handcuffed Gabriel and forced him into the car. Another round of beeps reminded them of how little time they had left and Chat led the way to the nearest alley. Carapace’s transformation fell as soon as they were out of sight. \n\n\n“That was crazy, dudes.” Nino said as he handed the bracelet back. “Not at all what I expected this morning.”\n\n\nAlya detransformed as well and paused before handing the necklace back, “Will we ever see you guys again?”\n\n\nChat and Ladybug looked at each other as their miraculous beeped again. \n\n\n“I’m sure we’ll run into each other eventually.” Chat said finally. \n\n\nAlya and Nino nodded as Chat and Ladybug jumped onto the rooftops and ran as fast as they could. They reached Marinette’s roof right as their transformations ran out. Marinette held open the sky light for Adrien, then dropped down after him. \n\n\nAs soon as she landed, Adrien wrapped his arms around her and started sobbing. \n\n\nEventually, there was a quiet knock on the trapdoor and Marinette’s parents slowly opened it, concern written on both their faces. Adrien hurriedly sat up so that he wasn’t sprawled all over their daughter like a heathen and wiped his eyes frantically, even though he knew it probably wouldn’t do any good. He’d probably look like a puffy tomato for the next few weeks. His publicist would probably kill him if there was any chance he would be on any magazine covers besides tabloids in the coming months. \n\n\n“We thought you two were probably up here.” Tom said softly. “I never thought I’d be grateful that a teenage boy developed a habit of sneaking into my daughter’s room, but here we are!”\n\n\nAdrien couldn’t help the wet snort that bubbled up at Tom’s lame attempt at humor, “With all due respect sir, I think you were more grateful to have someone new to eat all your leftover pastries.”\n\n\nTom gave a small chuckle, “Oh no! You caught me!”\n\n\n“We’re glad we can give you someplace to come, Adrien..” Sabine said seriously. “I take it you’ve already heard the news?”\n\n\nAdrein’s breath left him and Marinette squeezed his hand as she nodded, “Does anyone else know he’s here?”\n\n\n“We never told anyone about him coming over to see you.” Sabine replied. “So unless you two told your school friends, then no.”\n\n\nMarinette nodded thoughtfully, “Ok. We should probably let the police know where he is, though, so they don’t think he was kidnapped or a conspirator.” \n\n\nAdrien’s stomach sank. Talking to the police seemed so overwhelming, but he knew his lady was right. It was probably better to get it over with as soon as possible, before things started to feel more...real. Right now, everything just felt like a bad dream, like he’d wake up in Marinette’s arms on a random rooftop at any moment as she made fun of him for falling asleep on patrol again. But talking to the police about his father being Hawkmoth meant that these past few weeks had actually happened, and that his life really had crashed down around his ears. \n\n\nHe felt Marinette squeeze his hand again and he glanced up at her to see her looking at him with concern, “Would you rather wait? We can just tell them to come back another day once you’ve had time to process.”\n\n\nAdrien shook his head, “No, I just want this whole thing to be over.”\n\n\nSabine gave a determined nod, “Well, then, there’s no reason for you to talk to them on an empty stomach, is there?”\n\n\nTom nodded in agreement, “We’ll whip something up and then you can talk to those cops afterwards, ok?”\n\n\nAdrien felt more tears prickle at the sides of his eyes as he nodded gratefully. Tom and Sabine gave him soft smiles as they headed back down the stairs, leaving the trapdoor open as an invitation to follow when they were ready. Adrien was about to fall right back into Marinette’s arms when he realized that his breakdown had completely messed up the nicely made covers and his tears had left wet spots all over both the bedspread and Marinette and he grimaced with embarrassment. \n\n\n“Maybe we should go downstairs?” He suggested hesitantly. “I mean, we both went through...a lot...so maybe it’d be nice to have your parents around. They’re, uh…”\n\n\n“Good at lightening the mood?” Marinette smiled. “Maybe if you want, I might even hold back my groans when you and my dad start punning.”\n\n\nAdrein grinned slightly, “Awww, but your reactions are half the fun!”\n\n\n“I knew it!” Marinette put a hand on her forehead dramatically and leaned against his side. “Your only purpose in life is to annoy me!”\n\n\n“No.” Adrien stood, grabbing Marinette’s hand. “My purpose in life is to protect you, just like you protect me.”\n\n\nMarinette blushed and Adrien hesitated. Yeah, he’d declared his love for Ladybug plenty of times, but after everything, Marinette probably wasn’t in the mood for that kind of declaration and Adrien wasn’t even close to being in the right state of mind to make one. \n\n\nWhich meant it was time to crack another joke, “Plagg’s purpose in life is to annoy me.”\n\n\n“Hey!” The kwami flew out of his pocket and crossed his little arms in front of Adrien’s face. “My purpose in life is to enjoy all the wonderful cheeses you humans have to offer. Annoying you is just a nice little side bonus.”\n\n\nMarinette and Adrien laughed and finally got out of the bed. Marinette led him down the stairs to the living room, where to his surprise, the tv was playing the news. The volume was kept low so it wouldn’t bother the two while they were in Marinette’s room, but it was loud enough that Tom and Sabine could hear it from the kitchen. They were probably keeping it on as background noise so they could know everything that was happening with Hawkmoth. \n\n\n“...currently in custody. Other members of the staff are undergoing police interrogation to determine if they had anything to do with Agreste’s plots. Back to you, Nadja.”\n\n\n“Thank you. Don’t be bemused, it’s just the news! If you’re just tuning in, we’re discussing Hawkmoth’s identity and capture. Hawkmoth, Paris’s own resident supervillain who has been brainwashing citizens for over a year now and turning them into Akumas, was revealed today to be none other than Gabriel Agreste. The acclaimed fashion designer has been widely regarded as a recluse and a misanthrope, but I think I speak for all of Paris when I say that we never expected him to go this far. Ladybug and Chat Noir, together with Rena Rouge and Carapace, apprehended Agreste and his associate Natalie Sancour, A.K.A. Mayura, just over twenty minutes ago at the Agreste Mansion. Whereabouts of Mr. Agreste’s son, the famous model Adrien Agreste, are still unknown, as is Adrien’s involvement in the Hawkmoth terrorist plots that have plagued our city for the past year.”\n\n\nBeside him, Marinette was practically buzzing with anger, “Why are they acting like you had something to do with it?! If it wasn’t for you…”\n\n\nAdrien shut her up by resting his head on her shoulder and nuzzling into ther neck, “It’s fine Marinette. It’s a natural reaction and it’ll all get cleared up when we talk to the police later. I’ll be fine.”\n\n\nMarinette frowned at him for a long moment before sighing, “We can turn this off, you know. You don’t have to listen to it.”\n\n\nAdrien shook his head, “No, I want to know what people are saying about him. I...I have to know.”\n\n\nMarinette’s eyes glistened with understanding as she put an arm around his shoulders and pulled him in closer to her so that he was basically wrapped in a hug as they sat and watched the news replay the clips of his father transforming that they’d pulled from the ladyblog. It was still just as hard to watch it as he’d expected it to be, but watching it from Marinette’s arms felt almost safe. It was like he could handle anything with his lady beside him. Maybe that was what Master Fu had meant by them being Yin and Yang. \n\n\nThey left the TV on during dinner. Both Tom and Sabine had offered to turn it off, but in a way he couldn’t explain, Adrien felt like he \n\nhad \n\nto watch. Maybe he was just trying to punish himself again for not seeing his father’s villainy sooner, but it didn’t feel like that was quite right. It was almost like he would only be able to control the situation if he didn’t avoid it. \n\n\nAs expected, the media were digging into every interaction his father had had with the public over the past decade, even before his mother disappeared, and were wasting no time in vilifying him, Natalie, and even Adrien’s mother, even though she’d never been \n\ndirectly\n\n involved in Hawkmoth’s reign of terror. Apparently a few of the most intrepid reporters had already uncovered a few instances outside of Paris where the butterfly and the moth could have been active, almost all of which coincided with \n\nbusiness trips\n\n that the Agrestes had taken. \n\n\n“I can’t believe I didn’t notice.” Adrien said numbly. Normally, he’d be devouring the Dupain-Cheng’s cooking like it was life itself, but today he had found himself picking at the same piece of broccoli for a full five minutes. \n\n\n“Adrien…” Marinette said. “You can’t blame yourself for your father’s…”\n\n\n“It wasn’t just my father, princess.” Adrien said, finally giving up and just putting his fork back on his plate. “In all the memories I have of my mother, she was \n\nkind.\n\n Maybe that was just because I was comparing her to Father, but at least Mom was around. I don’t know if I didn’t see it because I just didn’t know what was going on or if I \n\ndid\n\n see it, but then because she went missing, I didn’t want to think bad about her and created this idealized version of her in my head!”\n\n\nHe hadn’t realized just how agitated he’d gotten until Marinette grabbed his hand tightly, giving him an apparently much needed anchor point. He took a deep breath to steady himself, “I just wish she’d been innocent too, you know?”\n\n\nSabine reached across the table and held his other hand while Tom patted Adrien’s shoulder, “It’s ok to grieve, son. Your parents had a responsibility to be the people you needed them to be, but instead…”\n\n\n“They neglected me.” Adrien finished. “Looking back now, I mean, it should have been obvious. Mom never stood up to Father and insisted I be allowed outside the house, or allowed to make friends, or even allowed to choose what I was going to wear! If she’d been as perfect as I remember her...well, I guess there’s no use in thinking about it, is there?”\n\n\n“Adrien,” Sabine and Tom shared a look, “there’s something we wanted to talk to you about. We don’t want you to be alone and…”\n\n\nShe was interrupted by a knock and everyone at the table shared a look before Adrien took a deep breath as he stood and answered the door. \n\n\n“Hello Officer Raincomprix.” Adrien gave a small, sad smile that didn’t reach even close to his eyes. “I heard you had a few questions for me.”\n\n\nOfficer Raincomprix walked in, followed by a detective that Adrien hadn’t ever interacted with except as Chat Noir. Adrein looked as the Dupain-Chengs hesitantly, but Sabine simply smiled at him softly and led the group into the living room, “It’s sweet of you to show up so Adrein has a familiar face, Officer Raincomprix. This is going to be hard enough on him without having to confide in strangers, you know? Can I get you anything? Cookies? Coffee?”\n\n\n“That won’t be necessary.” The detective said quickly. He looked between Adrien and the Dupain-Chengs, “Adrein, would you prefer...this family to be here during the interrogation, or would you prefer to do it with just us? It’s up to you.”\n\n\n“Wait, interrogation?!” Tom asked incredulously. “You can’t seriously be thinking of treating a \n\nchild\n\n like a criminal, can you?!”\n\n\n“It’s ok. My father \n\nwas\n\n a supervillain after all.” Something about having the police here was oddly calming, not in a peaceful sort of way, but more like Adrein was able to focus now that he had a task to accomplish. Maybe it was that that he was so used to interacting with law enforcement as a superhero...or maybe it was just that the anticipation and anxiety of waiting for this conversation had been worse than he’d been letting himself admit, especially since he’d known this would happen since he and Marinette had first looked at that map. “If it’s all the same to you, I’d like the Dupain-Chengs to stay. They’re more like parents to me than my Father ever was.”\n\n\nTom wiped tears from his eyes while Sabine looked at him proudly and Marinette squeezed his hand from where she sat beside him on the couch. Adrein took a deep breath and turned to face the detectives, “So, what would you like to know?”\n\n\nThe detective took a small notebook from his pocket and flipped it open, “First off, did you know that your father was Hawkmoth.”\n\n\n“Yes.”\n\n\nMarinette’s parents gasped and the detective’s eyes widened, “C-could you repeat that?”\n\n\nAdrein squeezed Marinette’s hand for comfort, “I didn’t know from the beginning, but Marinette and I figured out his identity a few weeks ago by tracking the akumas that were targeting her. We took our suspicions to Ladybug and Chat Noir, who confirmed them and took them down.”\n\n\nThe adults stared at the two in shock for a long moment before Officer Raincomprix cleared his throat, “Well, I guess we have you to thank for today’s good news, then. Marinette, how did you track the akumas?”\n\n\nMarinette nodded frantically and jumped up, running to her room. There was a series of concerning crashes from upstairs before she ran back into the room with her repurposed sketchbook in one hand and their map in the other. The map ended up catching on the end table as she ran, which sent her sprawling on the floor. Adrien winced and stood to help her up, but true to form, she simply jumped right back to her feet and spread the map out on the coffee table for everyone to see before opening up her sketchbook to the tables she’d created and handing it to the detective. \n\n\n“Things at school...haven’t been great.” Marinette started. \n\n\n“Marinette…” Sabine said softly, but Marinette just plowed on, avoiding her parents’ eyes.\n\n\n“I was able to calm down quickly enough to not get akumatized, but after the first few, I started keeping track of them, hoping that I could get enough data to be able to track down Hawkmoth, since things didn’t seem to be getting better anyway.” She explained. “I did that for a while, and when I finally felt like I had enough, I recruited Adrein to help me, since I wasn’t confident in being able to do the calculations myself.”\n\n\n“That’s when we made that map.” Adrien took over. “Which...wasn’t fun. Or I mean, it was fun! Until we saw the final results. When we showed it to the heroes, they asked us not to tell anyone else because they didn’t want Hawkmoth to retaliate against us for trying to find him, \n\nespecially\n\n if we were correct.”\n\n\n“So what you’re saying is that you were unaware of Hawkmoth’s true identity until a few weeks ago?” Officer Raincomprix asked. “And once you \n\ndid\n\n know, you immediately took that information to the heroes?”\n\n\nBoth Marinette and Adrein nodded, “I also didn’t know about Natalie’s involvement, but that was pretty obvious once we figured out Father. The only real surprise was Mom.”\n\n\nThe police shared a look before Officer Raincomprix cleared his throat awkwardly, “About your mother…”\n\n\nAdrien gripped Marinette’s hand so tightly that he’d be worried about hurting her if she wasn’t a superhero, “Ladybug and Chat Noir already told me about the set up in the basement. Do you know if she’ll ever recover?”\n\n\nOfficer Raincomprix shook his head sadly, “The contraption that was keeping her alive was obviously powered by some kind of magic connected to Hawkmoth’s miraculous, so once that was taken away…”\n\n\nAdrien felt a wave of cold dread and guilt wash over him, “S-she’s dead?”\n\n\n“Not yet.” The detective said. “But after so long being kept alive through magical means...the doctors said that her body is rejecting traditional life support. There’s not much they can do.”\n\n\nAdrien drew in a shaky gasp of breath, “Oh...Okay.”\n\n\n“Okay?” Officer Raincomprix looked at him in disbelief. “Your mother is dying, Adrien, you’re  allowed to say a little more than just okay!”\n\n\nSabine silenced him with a cold glare, “Officer, if you are going to shame this boy after what has already been an emotionally devastating day, then you are more than free to leave.”\n\n\n“That won’t be necessary.” The detective held up his hands placatingly. “We would like to continue, if that’s alright?”\n\n\nAdrien nodded, “What next?”\n\n\nThey spent the next hour asking Adrien all sorts of questions about his father and Natalie’s behavior and would have probably spent longer if it weren’t for the fact that it quickly became apparent that Adrien wasn’t the expert they’d been expecting. They had seemed shocked to hear just how little he saw of his father and that even Natalie had only interacted with him enough to give him his schedule and make sure he obeyed his father’s orders. By the time they were wrapping things up, the two were looking at him with a lot more pity than suspicion, and Adrien couldn’t decide if that was better or worse. At least Marinette understood.\n\n\n“Well,” the detective shuffled through his notebook one final time to make sure there weren’t any questions he’d missed, “I believe that’s all the questions we had for you, but there is still one issue that needs to be addressed.”\n\n\n“Which is?” Tom asked protectively.\n\n\nThe detective sighed, “Adrien’s living situation. Due to their status as supervillains and their obvious flight risk, Gabriel Agreste and Natalie Sancour have been denied bail. Now, we have already talked to the elder Mr. Agreste’s lawyers and, according to his will, if anything were to happen to him, Ms. Sancour would receive sole custody of Adrien. As that is obviously not a possibility in this case, it leaves us at a bit of a loss. Adrien’s bodyguard has expressed a desire to take him in, but due to his financial connections with Gabriel Agreste, the state wants to be absolutely certain he had nothing to do with Hawkmoth’s reign of terror before transferring Adrien into his care, which may not happen until the case is concluded with could take months.”\n\n\n“So...you’re saying I don’t have anywhere to go?” Adrien had been expecting this. He knew that arresting his father would lead to him losing everything, but he still had had a duty to save Paris. It wasn’t that big of a sacrifice, all things considered. \n\n\n“We’re not just throwing you out on the streets, Adrien.” Officer Raincomprix said kindly. “But, unfortunately, it does mean that you’ll have to be transferred into the foster care system as soon as possible. We can’t just let a fourteen year old crash on his friends’ couches for months or years at a time.”\n\n\nAdrien nodded numbly, “I understand.”\n\n\n“What if one of his friends was already qualified to foster him?” Sabine asked with a smile.\n\n\nMarinette giggled as Adrien turned and looked at her with wide eyes, “R-really?”\n\n\nSabine nodded, “Marinette came to us weeks ago and told us things weren’t going great at home. We assumed that she meant the neglect not...well, anyway, we’re just waiting on the final approval to become official foster parents and we would be more than happy to take him in, either until his bodyguard receives permission to foster him or until he can emancipate himself.”\n\n\nAdrien held his breath as the detective thought for a long moment, until finally he sighed and looked at him, “Adrien, do you feel safe here?”\n\n\nAdrien nodded frantically, “Yes!” He grinned sheepishly and rubbed the back of his neck. “I mean...Marinette’s my best friend and, well, I \n\ndid\n\n come here first thing as soon as the news broke about my father, so...I’d like to stay here, if the Dupain-Chengs are willing to have me.”\n\n\n“Of course we’re willing to have you son!” Tom clapped him on the back. “It’s the least we can do for our daughter’s best friend!”\n\n\nThe detective nodded, “I’ll put the word in with family services and see if we can rush that final approval then. Until that comes through, Adrien, you’re more than welcome to stay here, just so long as we can check in with you periodically to make sure you’re safe.”\n\n\nHe nodded and the Dupain-Chengs walked the police to the door, leaving Adrien alone with Marinette on the couch. As soon as they were out of sight, his composure fell and Adrien found himself gathering Marinette in his arms and nuzzling into her shoulder like a touch-starved cat, “You really asked your parents to foster me? I...it’s too much!”\n\n\nMarinette chuckled and started running her fingers through her hair, “We’re partners, Kitty. I wasn’t about to leave you to fend for yourself just so we could arrest your father!”\n\n\nAdrein grinned, “I guess you’re still taking care of me even after Hawkmoth is gone, huh, Milady?”\n\n\nMarinette smiled and ruffled his hair, “Always.”\n\n\nSaying that returning to school had been rough would be putting it lightly. Having been a model his whole life, Adrien was used to being the center of attention, but that attention had mostly been positive. He was used to people being in love with him, he was used to people telling him he was such a sweet boy, he was used to people thinking he was perfect. \n\n\nHe wasn’t used to pity. \n\n\nMarinette stayed by his side like an attack dog, or an attack bug rather, despite the rumors that Lila had been spreading about her \n\ntaking advantage of him in his vulnerable state.\n\n He wasn’t really expecting any of their friends to come to her defense, but there had been a small part of him hoping that Nino and Alya would finally see the truth. The only upside of everyone in his life betraying him was that it had made it clear who he could \n\ntruly\n\n rely on: the Dupain-Chengs. \n\n\nAfter weeks of sneaking into Marinette’s room, the transition to living in the same house wasn’t nearly as difficult as he’d been expecting. Sure, the house was smaller, but there weren’t constant schedules and suffocating expectations and for the first time in his life, he was actually living somewhere that felt like \n\nhome.\n\n The Gorilla had been by a few times already and Tom had insisted that he come to dinner at least once a week and was basically starting to pull him in as a member of the family, which was sweet. It was nice to have people behind him and people that he could stand behind. It made what he was about to do a lot easier. \n\n\nAdrien had gone over all his drafts last night to make sure everything was ready for today and Marinette had raised her eyebrows at his suspiciously when she saw him take out his phone for the upteenth time that day, but he’d simply smiled in a way that said, \n\ntrust me,\n\n and turned his attention back to Mrs. Mendaleive after pressing \n\npost\n\n for the final time about twenty minutes before lunch. The teachers let his distraction slide today because of everything, but everyone else had been too busy with class to check their notifications, just like he wanted. \n\n\nBy the time the bell rang and everyone filtered into the halls, Adrien’s official social media account had hundreds of thousands of notifications and it was too late for anyone to make him take it back or sweep it under the rug. He put a hand around Marinette’s waist and led her toward the lunchroom, “Hey, let’s eat here today?”\n\n\nShe narrowed her eyes, “What’s up with you? You’ve been acting weird all day.”\n\n\n“I just wanted to switch things up.” Adrien blinked innocently. “Is a cat not allowed to learn new tricks?”\n\n\n“Well, yes.” Marinette rolled her eyes. “But do you really expect me to believe…”\n\n\n“Lila!” Alya said. “You’re trending!”\n\n\nAdrien grinned as Marinette froze, “What did you do?”\n\n\n“You made sure I was taken care of after my dad was arrested.” Adrien kissed the back of her hand softly. “I’m just returning the favor. Just sit back and watch the show.”\n\n\nMarinette gave him one last suspicious glance before pulling out her phone, gasping as she scrolled through his page and saw what he’d been working on for the past few weeks. Around them, people were whispering and looking over at Lila, who looked pale as she read through all of her own lies laid out for the world to see. \n\n\nThe first post was the most dramatic, obviously, since he needed to catch everyone’s attention:\n\n\n\nMany people have wondered why I haven’t made an official statement in the time since my father’s arrest. To tell you the truth, I have known for longer than the public has and am very grateful to Ladybug and Chat Noir for working closely with me and supporting me in this difficult time. I am safe and am currently staying with a \n\ntrue\n\n friend, but have been taking some personal time away from the public eye to deal with everything. \n\n\n\n\nNow that my father is no longer holding the threat of mass destruction over Paris’ head, I am free to speak about something this entire situation has made very clear. As someone who has grown up in the public eye, I have always had to be cautious about people taking advantage of my fame, and after I learned of my father’s true identity, I learned that one of my \n\n“friends” \n\nwas not only living up to that expectation, but actually assisting my father in his goals. \n\n\n\n\nI do not know if she was doing it intentionally or not, but if we really want to move on from Hawkmoth’s reign of terror, I think you all deserve to know the truth about Lila Rossi. \n\n\n\nMarinette’s eyes were wide as she looked up at him, “I mean, we both know it’s true, but you really accused her of working with Hawkmoth?”\n\n\n“I did more than just accuse her.” Adrien smiled. “I exposed how Father tried to use her to control me and I reached out to each of the akumas she caused and got screenshots of their side of the story, and even included a few statements from Chat Noir.”\n\n\nMarinette blinked slowly, “Wow…”\n\n\n“But that’s not even the best part.” Adrien continued. “I talked to Jagged Stone, and he put me in contact with most of the celebrities Lila claimed to know. I got screenshots of those conversations too. It’s all out in the open and now that Father’s in jail and the butterfly is safe, she can’t even get akumatized to try and cover it up.”\n\n\n“She’s not coming back from this…” Marinette said softly.\n\n\n“No.” Adrien whispered back. “No, she’s not.”\n\n\nThey stood back to watch as Lila’s web of lies finally, \n\nfinally\n\n unraveled around her. Adrien held Marinette a little closer. He knew her well enough to know that she was still nervous. Lila was a master at manipulation. What if she managed to turn it around like she always had and blamed it on Marinette? She didn’t have anything to worry about, though, Adrien had made sure of it. If people didn’t take his word for it, they’d take the word of Jagged Stone, Clara Nightingale, and Prince Ali. There was just too much evidence for them to deny at his point. Marinette had helped him get out from under his father’s thumb, so he wasn’t leaving anything to chance when it came to getting them both out from under Lila’s. \n\n\n“I can’t believe you!” Alya’s voice echoed across the lunch room. “Was everything you ever said a lie?”\n\n\n“You can’t seriously believe all that!” Lila’s eyes were full of large tears as she looked around, trying to find some sort of sympathy. “Adrien is just trying to carry on his father’s legacy of causing pain! He probably thought I was a good target because everyone loves me, but I’d never hurt anyone or lie to them like that! You have to believe me!”\n\n\nMarinette tensed beside him and before he could hold her back, she was striding across the room, “Are you kidding me right now?!”\n\n\nLila glared at her, “Marinette. You had something to do with this, didn’t you? Are you thinking that Gabriel will help with your non-existent fashion career if you do his bidding until he gets out of prison or something?”\n\n\nMarinette scowled for a second and almost walked away until she realized that there was no reason for her to hold back anymore. No one was going to get akumatized today or ever again. She glanced toward Adrien and he probably should have held her back, but whatever she had in mind, Lila deserved it, so instead he just shrugged and gestured for her to continue. She gave him a small smirk before whipping around and giving Lila a long-deserved black eye. \n\n\n“I’m done with you, Lila.” Marinette huffed. “And so is Adrien. We weren’t the ones working with Hawkmoth and both the police and the heroes can confirm that, but you? You just got lucky that no one could expose you with you getting akumatized and wrecking the city. Good luck with karma.”\n\n\nShe shook out her hand and turned back toward Adrien, “I needed that. Can we go home?”\n\n\nAdrien nodded, smiling, “I’m sure your parents won’t be too mad about us missing afternoon classes.” He took her hand and whispered, “Especially since we’ve been missing less classes recently.”\n\n\nShe giggled and they started walking away when Alya called out to them, “Marinette! Wait!”\n\n\nMarinette froze and Adrien squeezed her hand, “You don’t have to do this, you know. I can tell her to go away.”\n\n\nInstead of saying anything, she just shook her head sharply and turned around, gripping Adrien’s hand a little tighter. She held her head high as she stared Alya down and he was reminded of why he fell in love with her in the first place. His lady was always so brave. \n\n\n“I had no idea Lila was lying about all that!” Alya insisted. “I can’t believe she would do something like that! We’re good, right?”\n\n\nAdrien stepped forward and almost hissed at her, but Marinette beat him too it, “No. We’re not. You really hurt me, Alya and after all that, I just...I’m sorry. I can’t trust you anymore.”\n\n\n“But I…” Alya looked genuinely confused and Adrien couldn’t believe it. “It wasn’t my fault! Lila lied! What did you want me to do!”\n\n\n“Trust me.” Marinette said simply. “Or if you couldn’t do that, you could have at least fact-checked what Lila said like Adrien did. You run the Ladyblog Alya. You could have reached out to Ladybug at any time or even used that reputation to reach out to any of the other celebrities she claimed to know. You could have \n\ngoogled it.\n\n But you didn’t. You shoved me aside and saw me as the villain when it wasn’t true, all for some girl you’d barely met. I’m sorry, Alya, I know you’re a good person, but you did nothing.” Marinette sounded like she was holding back tears and Adrien squeezed her hand a little tighter, “And this time, evil prevailed. I’m sorry.”\n\n\nAlya opened and closed her mouth a few times, but Adrien didn’t wait for her to finish gaping at them before leading Marinette away and out the door. His lady was strong, but he knew how important Alya had been to her and how much it hurt when she’d turned her back on them, and he knew how much it took for Marinette to stand up to her like that, “I’m proud of you.” \n\n\nMarinette sniffled, “I just wish…”\n\n\nAdrein sighed, “I know.”\n\n\nMarinette smiled sadly, “Do you think Papa would be willing to spare some chocolate croissants? I kinda need the sugar right now.”\n\n\n“Probably.” Adrien smiled back. “But the real question is if your mom will make us hot chocolate to pair with them.”\n\n\nShe chuckled softly, then trailed off, “Thank you.”\n\n\nAdrien nudged her with his shoulder, “What else are partners for?”\n\n\nAdrien held his head up high as they left the courtroom, stubbornly ignoring both the cameras shoved in their faces and the questions that were thrown at him from every direction from the crowd of reporters on the stairs. Marinette’s grip was light, but steady on his arm, her presence more than enough to steady him, just like always. Her parents followed behind them, followed by the gorilla and the combined force of all three of them giving intimidating glares to every single reporter in attendance was just barely enough to let them get to the car without saying anything besides \n\nno comment. \n\nAs soon as the doors were finally shut and they were driving away, both Adrien and Marinette sighed in relief. \n\n\nAdrien slumped over and put his head in Marinette’s lap. She immediately giggled and started carding through his hair with her fingers like she’d done a million times. It was comforting to have \n\nsomething\n\n remain the same, because so much had changed in the past few months. For one, he’d finally learned who Ladybug was, but he’d also learned who his father was, and so had the world. At first, Gabriel had tried fighting the charges, pulling out all the stops and hiring the best lawyers who were willing to take his case, but Adrien knew he was only fighting so hard so that he could get out and try to steal the miraculous a final time. \n\n\nBut then Emille’s life support had failed and she’d passed away quietly in her sleep. Gabriel had stopped fighting after that. \n\n\nAdrien hadn’t ever gone to visit him in prison, which was only fair considering how little he’d seen his father when things were good, so the trial was the first time he’d even seen him since he’d had to arrest his own father for terrorism. Adrien had been expecting it to be painful, but things had changed for him too. The Dupain-Chengs had fostered him for the almost two months it took to get the Gorilla cleared of all conspiracy charges, and they had spent that entire time teaching him what a family \n\nshould\n\n look like. They had dinner together. When Adrien had a question, he could go to Tom and he was always willing to listen or offer advice, or even just joke and laugh with him until they both felt a little better. It was everything that Adrien had always wanted.\n\n\nHe had been terrified when the Gorilla had been officially approved for custody. Sure, he knew that his old bodyguard cared about him and would take care of him, but he’d always held him at arm’s distance while the Dupain-Chengs wouldn’t accept anything less than a bearhug and Adrien wasn’t sure he could go back to that. Good thing he didn’t have to. \n\n\nIt turned out that now that they didn’t have the barriers of \n\nprofessionality\n\n between them, Adrien didn’t have anything to worry about. Sure, the Gorilla was quieter than the Dupain-Chengs were and sometimes he didn’t quite know exactly what Adrien needed, but he was there and he was trying\n\n,\n\n which was more than his father had ever done. The Gorilla had even gotten Tom’s number at one point and Adrien was 90% sure he occasionally texted to ask about parenting strategies. Even when he wasn’t perfect, the amount of work he was putting in to make sure Adrien was happy was...Adrien hadn’t ever experienced anything like it. Even Natalie ahd only put effort into his schedule and not into \n\nhim.\n\n He felt more spoiled now than he ever had when he’d been living in a giant mansion. \n\n\nAnother change was the therapy. Tom and Sabine had offered it without any judgement and even if he couldn’t talk freely about being Chat Noir, his civilian identity had still been involved in Hawkmoth’s arrest, so they’d been able to at least scratch the surface of that guilt and most days, it seemed to be helping. Sure, he knew that it would take years to really feel \n\nok\n\n again, but on the nights when he and Marinette ran across the rooftops to remind Paris that they were still there and still protecting them, Adrien couldn’t shake the feeling that everything was going to be ok as long as he had her by his side as the yin to his yang. It was just them against the world, the perfect team, just like always. \n\n\nAdrien barely held back a purr as Marinette scratched behind his ear and he shuffled so that he could look up at her, “Princess?”\n\n\nMarinette smiled, still playing with his hair, “Yeah, Kitty?”\n\n\nAdrien bit his lip, “Now that everything with my father is over...uh...would you like to go out for ice cream sometime? Maybe go to Andre? See if our colors match?”\n\n\nMarinette gasped slightly and Adrien almost had time to panic before she broke out into the sweet, confident smile that had stolen his heart in the first place, “Sure, I’d love that.”\n\n\nShe leaned down and pressed a soft kiss to his hair and a low purr rumbled in Adrien’s chest as he sat up and started holding her hand. He squeezed it a bit tighter as he looked out the window at the streets of Paris, “We did it. We kept Paris safe.”\n\n\nMarinette nodded, “We did. Pound it?”\n\n\nAdrien looked over and saw her grinning, holding out her free hand in a fist. A matching smile spread across his face as he nodded and held up his own free hand, “Pound it.”\n"
}