{
    "id": "19874908",
    "url": "https://archiveofourown.org/works/19874908?view_full_work=true",
    "author": [
        "thehoyden"
    ],
    "title": "You, Soft and Only",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Multi"
    ],
    "fandoms": [
        "Good Omens (TV)",
        "Good Omens - Neil Gaiman & Terry Pratchett"
    ],
    "relationships": [
        "Aziraphale/Crowley (Good Omens)"
    ],
    "characters": [],
    "additional_tags": [
        "Undercover as a Couple",
        "more traipsing through history",
        "Possessive Behavior",
        "not a single degree of chill from either of them"
    ],
    "language": "English",
    "series": "",
    "published": "2019-07-19",
    "completed": null,
    "words": "9,400",
    "chapters": "1/1",
    "comments": "1,066",
    "kudos": "29,582",
    "bookmarks": "6,928",
    "hits": "287,737",
    "summary": "<p>He hadn’t expected a sudden lapful of angel. </p>\n<p>“Very sorry about this,” Aziraphale said, and kissed him.</p>",
    "notes": "<p>This doesn't get written without Merelyn, Twentysomething, Leupagus, and Waldorph cheering me on, or at least, not written so quickly! Many thanks to some fine new GO friends on Discord chat, in particular Reserve, who read parts of this and provided lovely feedback. And I'd be nowhere without Lynnmonster and her ability to turn around a beta so quickly. And finally, I mangled a Princess Bride quote for my own purposes, mostly because I thought it was too funny not to include. Title is from The Cure's Just Like Heaven, because that's where I am at as a human being.</p>\n<p>I remain wretchedly behind on answering comments; apparently I can either write or I can answer comments, and I keep choosing to move full steam ahead. I do read and cherish every one of them, and hope you will understand the delay. ❤</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>You can find me on twitter <a href=\"https://twitter.com/hoydenistic\" rel=\"nofollow\">@hoydenistic</a>, and on tumblr <a href=\"https://thehoyden.tumblr.com\" rel=\"nofollow\">@thehoyden</a>!</p>\n<p>Please also check out this amazing fanart by Valerie_sparkle: <a href=\"https://twitter.com/Valerie_Sparkle/status/1157067719482728448?s=20\" rel=\"nofollow\">here</a> and <a href=\"https://twitter.com/Valerie_Sparkle/status/1157428026059251713?s=20\" rel=\"nofollow\">here</a>!</p>",
    "text": "\n\n\nAziraphale actually surprised the Hell out of him, the first time. It was way back in dusty Mesopotamia, and they had been sharing a jug of something alcoholic—not great, but the best available. It was, Crowley remembered, a string of very hot days, and he was idly thinking about curling up somewhere dark and quiet in serpent form and having a nap. \nThat he was eyeing the hem of Aziraphale’s robe for this purpose was neither here nor there. \nIn any case—they were minding their own business in a public house, drinking steadily but not immoderately, when a man walked in. \nThe mortal reeked of Heaven’s favor, which made Crowley want to sneeze, except he’d never gotten the hang of sneezing. And Aziraphale—\nAziraphale looked very much as though he’d like to crawl under the hem of Crowley’s robe and just not come out. \n“Trouble?” Crowley murmured solicitously. \n”No,” Aziraphale lied poorly.\nCrowley took a close look at the man in question, the kind of close look only an angel or a demon could take. He snorted. “That was a fire that didn’t need any kindling.”\n“I have my orders,” Aziraphale said with a pinched look on his face. \n“And they’re coming this way,” Crowley said dryly. \nAziraphale’s expression turned desperate, and all right—even then, Crowley had been weak to the slightest suggestion that he might in some way give Aziraphale what he needed. \nStill—he hadn’t expected a sudden lapful of angel. \n“Very sorry about this,” Aziraphale said, and kissed him.\nCrowley had kissed before; out of idle curiosity, for the most part. He tempted humans to lust when he had to, but he preferred not to be personally involved in any of the fallout. To be perfectly honest, humans mostly lusted all by themselves, no demonic assistance necessary, and when it came right down to it, he couldn’t see what was wrong with using their bodies as they were made. It was all right there in the design, wasn’t it?\nAnd speaking of design, Aziraphale’s lips were soft and plush and so very sweet.\nSo, too, was his bottom, which Crowley had grabbed reflexively to steady him when he swung himself into Crowley’s lap. Crowley didn’t exactly mean to help himself to a little exploratory squeeze, but he did get a little caught up in the moment.\nAziraphale squeaked in surprise, but he didn’t remove himself from Crowley’s embrace. Instead, he stopped kissing Crowley long enough to murmur in his ear, “Is he still there?”\n“Still there,” Crowley confirmed, and pressed a kiss to the curve of Aziraphale’s jaw. “My, my, angel, he looks ever so disappointed. What did you do?”\n“I’m not giving you that kind of information,” Aziraphale said primly.\n“Suit yourself,” Crowley said, who honestly didn’t care about the specifics of Aziraphale’s orders, except when they directly opposed his own. He flicked his still-a-bit-forked tongue at Aziraphale’s earlobe, and Aziraphale shuddered deliciously in his arms. “Shall I rescue you?”\n“Don’t you think that’s overstating it?”\n“Oh, I don’t think I am,” Crowley said, and then nibbled a bit at the underside of Aziraphale’s jaw. “An attachment like that—why, anyone might think he’d had a taste of divine ecstasy.”\nAziraphale went still in his arms, and Crowley smiled against his throat. “Made it a bit too spicy, didn’t you. And now he wants a second helping, hm?”\n“I didn’t mean to,” Aziraphale muttered, a touch sulky.\nCrowley looked over Aziraphale’s shoulder at the man, who was starting to look a little murderous for Crowley’s taste. “Well, angel, there’s a shortage of perfect bottoms in this world. It would be a shame if he discorporated yours.”\n“He wouldn’t,” Aziraphale said immediately, and then went charmingly pink in the cheeks. “Perfect?”\nThat was when the man started to make his advance toward their table, and Crowley said, “Come on, up, time to go!” because yes, that was a knife.\nAziraphale scrambled off his lap. “Do something!”\n“I am,” Crowley said. He grabbed Aziraphale’s hand and tugged him out the back, and they ran through several alleys and a few courtyards.\nThey stopped when Crowley judged them safe enough, and Aziraphale panted for breath. “All the powers at your disposal, and your plan was to run away?” he said, incredulous.\n“Worked, didn’t it?” Crowley said. “Flashier stuff draws the wrong kind of attention, and I got the impression you wanted to avoid that.”\nAziraphale patted his hair ineffectually. “Oh. Well. Yes, actually.”\n“I mean you’d hardly have climbed into my lap otherwise,” Crowley said.\n“Quite right,” Aziraphale said, and what a magnificently terrible liar he was.\nCrowley scratched the back of his head. “Well. See you around, I suppose?”\n“Where are you going?” Aziraphale said, sounding delightfully put out.\n“I’m not giving you that kind of information,” Crowley parroted back to him.\nAziraphale’s beautiful lips curved into a genuine pout that was definitely not at all angelic. “Fine,” he bit out.\n“Going to bid me farewell?” Crowley asked, leaning down a bit and cocking one eyebrow suggestively.\nAziraphale glared at him. “Try not to get stepped on by a mule.”\n“Cold, angel,” Crowley said. Let Aziraphale see you almost get discorporated in serpent form once and he never let you forget it.\n“I suppose I’m grateful for the assistance,” Aziraphale said, and then he kissed Crowley on the cheek, as people did in this land when taking their leave.\n“Later, then,” Crowley said, and sauntered away without looking back. He might have even whistled a bit—poorly, though, because he was a demon, after all.\n\n\n\n\nIn Rome, they ran into each other at the same orgy. \n“What are you doing here?” Aziraphale asked under his breath. \n“Same thing as you, I’d wager,” Crowley said, equally low. \n“I very much doubt that,” Aziraphale sniffed. \n“It’s work, angel,” Crowley said. “I’m certainly not here for my own enjoyment.”\nAziraphale’s expression melted into commiseration. “It is all a bit much, isn’t it?”\nThey surveyed the scene around them. Aziraphale had a gift for understatement. \nCrowley took a large swallow of wine from his goblet. “You know the most annoying part?”\n“The snails are under seasoned,” Aziraphale said with a glum sigh. \n“No—well, yes,” Crowley said. “But I meant—you’re just here to do your bloody job and people won’t leave you alone.”\nThere were already plenty of people eyeing them speculatively, and Aziraphale could be gullible but he wasn’t an idiot. \n“It is inconvenient,” he allowed cautiously. \n“Be much easier to do what we came here to do if they all thought we were spoken for, wouldn’t it?”\nAziraphale narrowed his eyes. “What did you have in mind?”\nCrowley nodded at a wide reclining couch that was miraculously unoccupied and not overly close to any of the proceedings going on around them. “We take up residence there, and get—comfortable.”\nAziraphale took one last look around the room, before evidently deciding to make the best of a shitty situation. “Deal,” he said. \nThere were servant boys to fetch refreshments; Aziraphale sent them off with a very specific list of requests. Crowley just asked for an entire jug of wine. \n“How shall we...” Aziraphale trailed off, looking at the couch. \n“Get comfortable, angel,” Crowley said. “And then I’ll do the same.”\nAziraphale sat down, back ramrod straight, and Crowley sighed.\n“Lie back,” he coaxed.\n“I don’t want to take up all the room,” Aziraphale said, his nose wrinkled in concern. \n“Don’t worry about it. Just relax.”\nAziraphale finally reclined against the cushions on his side, still propped upright enough to eat and drink comfortably.\nCrowley pressed close behind him, and draped himself over Aziraphale as though he still wore a serpent's skin, twined around Aziraphale’s soft body in a way that should convey to onlookers that the angel was decidedly Not Available. \n“Are you comfortable?” Aziraphale asked in a whisper. \n“Oh, exceedingly,” Crowley said. \nThe servants returned with snacks for Aziraphale and the promised jug of wine. He had no idea what Aziraphale was here to do, but he evidently wasn’t in any hurry. He picked at cheese, pheasant, goose liver, and caviar-stuffed shellfish, and helped Crowley make considerable inroads on the wine. Crowley stole bites of the roasted peacock, which was an incredibly stupid bird that he was only too happy to eat.\nThe orgy—progressed, and there was still no sign of the man Crowley was to tempt, although he had his suspicions that any guest at a party like this didn’t need all that much tempting, but apparently it was a political thing. Wretchedly boring, Crowley thought. \nHe didn’t like the way that trio across the way was looking at Aziraphale, all hungry and covetous. Crowley approved of coveting in general, but in this specific case, he didn’t care for it one bit. \nThe worst part was: that trio could definitely make things very annoying for them both if they propositioned Aziraphale and he declined. “Angel,” he murmured in Aziraphale’s ear. “You see those men, off to your right?”\n“Yes,” Aziraphale said, equally quietly. And then, very calmly, he said, “I’d be much obliged if you could slip your hand under my toga, if that’s not too much of an imposition.”\n“Not at all,” Crowley said in kind, and without breaking eye contact with the prospective interlopers, he worked his way under the voluminous folds of cloth to Aziraphale’s tunic, to where his cock would be if he cared to manifest such a thing—\n“Aren’t you full of surprises,” Crowley said admiringly. \nAziraphale’s cheeks went pink. “It’s the fashion.”\n“Oh, indeed,” Crowley said. He was sporting one himself. “How good of an actor are you?” \n“I’m an angel, I’m not made to deceive,” Aziraphale had the nerve to say, as if he didn’t whenever it suited him.\n“Lucky for you, I am,” Crowley said. “Just—close your eyes and sigh a bit, will you?”\nThe toga covered a multitude of sins, including Crowley moving his hand in a very distinctive way without actually touching Aziraphale.\nAziraphale’s eyes were obediently closed, and he sighed softly, like he did when some food or drink particularly delighted him.\nIt was very distracting, and it wasn’t long before Crowley’s very fashionable cock took notice. It didn’t help that Aziraphale was shifting against him, and he ought to have known the angel’s plump bottom was going to continue to vex him.\n“You know,” Aziraphale murmured, after another soft roll of his hips—he had to be feeling the effect he was having on Crowley— “I do enjoy a spot of this from time to time.”\n“With who?” Crowley demanded without thinking, and then winced.\nAziraphale’s eyes opened, and he tilted his head back toward Crowley. “Myself, dear.”\nCrowley’s hand slipped, and—oh. Aziraphale was apparently not indifferent.\n“Isn’t onanism a sin?” Crowley asked.\n“It can hardly be said that I’m being wasteful—this body wasn’t intended to make new life, after all.”\nIt was a solid point. A solid point that involved him imagining Aziraphale in the pale morning light, flushed and gasping.\nHe happened to look up just then, and oh Hell—there was the fellow he was meant to tempt.\n“Oh!” Aziraphale gasped, and Crowley was about to apologize for where his hand was still resting when Aziraphale said, “My dear, so sorry, but that’s the man that I’m supposed to—”\nCrowley narrowed his eyes. “Wait. That man over there? The one with the limp?”\n“The emperor’s uncle Claudius, yes.”\n“Wait, what are you supposed to get him to do?”\n“If you must know,” Aziraphale said, “he’s to become emperor and usher in a new era of judicial law and public works.”\n“Huh,” Crowley said.\n“Well, what are you supposed to do?”\n“Convince him to conspire with the Praetorian Guard and various senators to assassinate his nephew and take the throne.”\n“Oh,” Aziraphale said, wide-eyed.\n“Suppose we ought to just get this over with. Want me to wave him over?”\n“While we’re like this?” Aziraphale looked flushed.\n“Nothing to be ashamed of,” Crowley said. “I’m the envy of the room right now, angel.” And he was—he could feel the eyes on them, and though there were more explicit acts currently happening and infinitely more nudity elsewhere at the party, he wouldn’t trade places with anyone, not for anything. “Unless you think you’d be too distracted.”\n“I can do my job,” Aziraphale protested.\n“Are you sssure?” Crowley said. “Be glad to—help you out. If you like.”\nAziraphale looked at him, and oh, his lips were pink and Crowley just wanted a taste—\n“Honorable countrymen,” came a mild voice, and they looked to see Claudius standing in front of them.\nIt was the first time Crowley was cockblocked, and he couldn’t say he cared for it, not one bit.\n\n\n\n\nCrowley was glad to be out of the Black Knight’s armor, which was heavy, uncomfortable, and made him smell bad. Much better to be in a wealthy noblewoman’s dress, especially when one’s assignment was to infiltrate a nunnery.\nIt looked pretty good on him, if he did say so himself. Slinky, the belt placed just so around his hips.\nThe abbess greeted him in the courtyard, and exclaimed her pleasure at the tithings he brought, and invited him to stay in prayerful contemplation as long as he wished.\n“So generous,” Crowley murmured, and allowed himself to be shown to his room. He didn’t miss all manner of nuns watching his hips sway as he went.\nHe had a short nap, because traveling annoyed him and horses annoyed him more, and when he woke, he decided to explore the nunnery. He kept well away from the consecrated grounds of the chapel; the abbess would not expect him to attend services, on account of his professed desire for solitary prayer and, more to the point, all the coins she would discover in the tithings he brought.\nIn a beautiful room with large, stained glass windows, he was surprised to find Aziraphale, commending a few novices on their work with illuminated manuscripts.\n“Absolutely beautiful, Sister Eleanor,” Aziraphale said warmly. In the warm golden light of the afternoon, the undyed wool of his habit looked softer and more luxurious than it was probably supposed to be. The soft leather belt around his waist was simple enough, but the way it cinched the cloth left little to the imagination where his bosom was concerned.\nIf Crowley had been there just to inflame some novice nuns’ ardor, he might have turned around and gone home, because clearly Aziraphale had that all very well in hand, whether he knew it or not.\nAziraphale looked up, and Crowley waggled the fingers of one hand in hello. Aziraphale’s expression went from surprise, to bafflement, made a stop at annoyance, and then landed on something soft and warm that made the novice nuns think very strongly about sketching the beatific curve of Aziraphale’s lips in the margins of their manuscripts.\n“My lady,” Aziraphale said. Then he turned his attention back to the novices. “Keep up the good work—I’ll be back momentarily.” He followed Crowley out into the hallway before he whispered, “What are you doing here?”\nCrowley shrugged one shoulder. “You know, the usual.”\nAziraphale heaved an irritated sigh. “Could you do it elsewhere? I’m very fond of these ladies and their illuminations are becoming ever so good, and the abbess is quite a collector of manuscripts.”\n“Oh, relax,” Crowley said. “I’m not here to ruffle your nest. I’m just here about a book.”\nAziraphale looked taken aback. “A book?” He peered at Crowley. “Pardon me, my dear, but I didn’t know you had any interest—of course you’re welcome to stay. Is there something in particular you’re interested in?” His expression grew exponentially more delighted. “Would you like a recommendation?”\nCrowley was definitely of the school of work smarter, not harder. The sooner he had what he came for, the better. He looked around to make sure no one was in earshot. “I’m looking for the Gospel of Mary Magdalene.”\nAziraphale blinked. “Oh,” he said regretfully. “I’m so sorry, my dear, but we don’t have a copy, here—I wish that we did, because I’d ever so much like to read it.”\n“I’m sure it’s not in the scriptorium,” Crowley said. “Dangerous work like that, likely to be kept somewhere a bit more secure, don’t you think?”\nThey looked at each other for a long moment. “I’m not helping you steal a book,” Aziraphale said firmly.\n“Who said anything about stealing?” Crowley said soothingly. “I just want to read it, and maybe have some other people read it. You said yourself you’re desperate to get your hands on it. The original copy will stay right here in the nunnery, safe and sound.”\nAziraphale looked extremely dubious, and then sighed. “Fine,” he said. “Tonight, after the evening prayer—we’ll go search for it.”\n“Oh Sister Aziraphale, I do so look forward to it,” Crowley purred.\nAziraphale pinched the bridge of his nose and sighed again. And as Crowley was about to turn and walk away, Aziraphale said, “Lovely dress, by the by — although that embroidery is a bit on the nose, isn’t it?”\nCrowley waved a hand down at the enormous embroidered snake on the front of his gown. “What, this?”\nAziraphale snorted, and strolled back to the scriptorium.\nLater that night, Aziraphale came to collect him, and they went to steal— “Borrow,” Aziraphale insisted— a very special text.\nIt was precisely where Crowley would have hidden it, if he were an abbess with a now-uncanonical text that encouraged women to ask questions and not take men’s bullshit lying down. Aziraphale took it out of its hidey-hole with careful, reverent hands, and Crowley led the way back to the scriptorium.\n“Can you make a copy?” Crowley asked.\nAziraphale puffed himself up. “Can I make a copy—my dear, who do you think taught everyone here?”\n“Excellent,” Crowley said, “Chop chop, angel. Sooner you’re finished, the sooner I’m out of your wimple.”\nAziraphale pursed his lips, but sat down at what was undoubtedly his table, and readied parchment and ink. “I should like to read it first,” he said. “Part of my process. You understand.”\nCrowley did, in as much as he knew exactly how greedy his angel could be. But he found himself saying, “Read it aloud? These eyes of mine don’t mix well with the written word.”\nIn the candlelight, Aziraphale’s expression softened, and he said, “Oh my dear, of course.”\nFor a string of nights, Aziraphale worked by candlelight, and Crowley watched him lay ink to the page, the most exquisite illuminations coming to life under his hands. They were most definitely not supposed to be in the scriptorium after evening prayer, but though they tensed when they heard a noise, it was usually just the nunnery cats on their nightly rounds.\nAnd then one night, there were definitively footsteps, and Crowley and Aziraphale looked at each other in alarm.\n“Hide it!” Crowley hissed.\n“The ink’s still wet, it’ll be ruined!” Aziraphale hissed back, looking frantic.\nCrowley was so close to being able to walk out with what he’d came here for, and he thought fast. “Right,” he said, and pulled Aziraphale up to standing, to another table between Aziraphale’s and the door to the scriptorium. Then he pushed Aziraphale to sit on the edge, stepped between his legs, and kissed him.\nThe footsteps slowed, and Aziraphale’s mouth opened underneath his, and Crowley couldn’t resist deepening the kiss. Aziraphale was even softer like this, and suddenly Crowley knew exactly how those novices felt, when they wanted to bury their face in Sister Aziraphale’s bosom and never leave.\nThere was a gasp, and not from Aziraphale, who was making little sounds of pleasure into Crowley’s mouth. Move on, little nun, Crowley wanted to say, and then he realized abruptly why they were not.\nWell. Far be it from Crowley to deny a virgin a little show that would play behind their eyes every night after evening prayer. He grabbed Aziraphale’s habit and hitched it up until he could get his hand underneath.\n“We need to keep up the distraction,” Crowley whispered in Aziraphale’s ear. “Make it good, angel.”\n“You make it good,” Aziraphale retorted automatically under his breath, and then Crowley moved his hand to touch him at the juncture of his thighs.\nAnd fool him twice—Aziraphale was again making an effort, and what a lovely one.\nHe had thought to do just as he had in Rome—simulate, without touching Aziraphale at all. But he was warm and already wet under Crowley’s fingers, and there was no mistaking the buck of his hips up into Crowley’s touch.\nAnd then Crowley heard it — the footsteps started again, lightly, as their voyeur snuck away. Aziraphale heard it too, and they kissed until the coast seemed to be quite clear. Then Aziraphale broke for breath he didn’t technically need, but it was quite flattering to Crowley’s pride.\nHe was still holding Aziraphale intimately, thumb resting against a very sensitive spot. He cleared his throat. “You, erm, still go in for a spot of this? I could—if you want—”\n“This is all your fault,” Aziraphale moaned in his ear, and grabbed Crowley’s wrist to press his hand closer.\n“My fault?” Crowley said. “One of us likes to collect books and it’s not me.”\nAziraphale kissed him again, and it wasn’t exactly nice, but it was very, very good, and he writhed under Crowley’s fingers. He touched him softly at first, just getting the lay of the land, and then he set about making Aziraphale sing his praises.\nAziraphale gasped, and sighed, and trembled, bracing himself with one arm on the table while he wrapped the other around Crowley’s shoulders, and he was a vision, and Crowley was going to make him glorious. He pressed two fingers inside and Aziraphale wailed, and all Crowley could do was ride Aziraphale’s thigh, chasing his own pleasure even as he brought the angel his. It felt so good, why weren’t the nuns doing this all the time—\nAziraphale made a helpless noise, and then he clenched tight around Crowley’s fingers, and that did it, that was just what Crowley needed, to know that he’d brought Aziraphale not low, but the very highest. He ground against Aziraphale’s thigh and rode the waves of his own pleasure out.\nThey both gasped for breath, and Crowley was truthfully thinking about maybe something to drink before a second round, one that would hopefully involve him sticking his head under Aziraphale’s habit. But Aziraphale just made a half-hearted attempt at straightening his clothing, and then coughed delicately.\n“I can probably finish tonight,” he said, looking in the direction of the nearly completed manuscript.\n“Oh,” Crowley said. He was honestly disappointed, but they both had a job to do, after all.\nIn the end, it didn’t work out quite as Crowley had hoped—he’d really wanted to spread the heresy much more widely, because people could and should ask questions. But Aziraphale’s beautiful illuminated manuscript fell into covetous hands, and what a waste, really. Crowley could report it as a mild success, which would have to do.\nHe did not report that he’d driven an angel of the Lord to blaspheme in his ear, but he thought about it. Quite a lot. All right, constantly.\n\n\n\n\nIt didn’t happen every time they met, but they did come to a tacit understanding that if a distraction was required, they were both extremely prepared to do what was necessary. \nCrowley tried not to dwell on it, but he was prepared to do more than that, if only Aziraphale would give him a definitive sign.\nIt wasn’t exactly what he was looking for, but when they found themselves faced with extended assignments in Florence, with a deeply paranoid family in power, Aziraphale made him an offer that practically qualified as a temptation. \n“We could go as husband and wife,” he suggested, looking extremely pleased with himself. \nCrowley stared at him in disbelief. “What.”\n“I need to get close to the lady’s circle to fulfill my orders, and you require some extended time with the lord’s brother, do you not?”\nCrowley sighed, because his assignment wasn’t a one and done—it was just like Hell to order him to tempt a family and influence the selection of the next Pope, like Crowley could just snap his fingers. “Yes,” he said. And then, because his streak of self-sabotage asserted itself at the worst times, he said, “Not worried Upstairs is going to check in?”\n“There’s a mandatory staff retreat,” Aziraphale said. “I’m the only one exempted, on account of my duties here.”\nCrowley winced. “Bet you’re glad of that.”\n“Of course I am. I take joy in continuing to serve as the Almighty made me,” Aziraphale said, butter wouldn’t melt in his mouth. \nCrowley folded, of course—that was inevitable. Soon after, they were in a carriage on the way to Florence. Aziraphale was in so many blessed layers that Crowley actually laughed when he tried to find space next to Aziraphale on the carriage bench.\n“Like traveling with a meringue,” he said as they wrangled the incredible poof of Aziraphale’s skirts. \n“I have standards,” Aziraphale said, but he was laughing, too. “Oh, do you think there will be meringue in Florence?”\n“I’m sure of it,” Crowley said, and there would be, even if Crowley had to start a new trend. \nThey’d taken a large shortcut, but still had a day’s carriage ride ahead of them. The cream and gold brocade of Aziraphale’s gown caught the sunlight, as did his hair, fastened up in a complicated arrangement of braids as was the style for married women. \n“You’re staring,” Aziraphale said. “Is it my bosom? Did I do it wrong?”\n“Your bosom is fine,” Crowley croaked. And then, because he was clearly an idiot who enjoyed suffering, he looked away and said, “You look beautiful.”\n“Oh,” Aziraphale said softly, surprised but pleased. “I hoped—I hoped it might meet with your approval. That we might look like we belong together.”\n“We do,” Crowley said, and he wanted it so very much. “Very complementary.”\nAnother few miles passed, and Crowley kept touching the wedding bands in his pocket. Finally he decided that he needed to get over himself. It was for their disguise, after all. “I have something for you, angel,” he mustered the courage to say.\n“Is it a snack?” Aziraphale asked, brightening at the prospect. “I am feeling a bit peckish.”\n“Not a snack,” Crowley said. He took Aziraphale’s ring out of his pocket. “If you’re going to be Signora Crowley, after all.”\nAziraphale’s mouth—was that cosmetics, or had it always been that pink?—was open in what appeared to be shock.\nCrowley still held the ring out. “I mean. If you want it. If you’d like another design, of course I can—”\nAziraphale thrust out his left hand, just as square and sturdy as ever, but trembling slightly. “Don’t change a thing,” he said. “I believe it’s traditional for you to—”\nCrowley took his hand and carefully slid the ring on his finger. It knew better than to not fit absolutely perfectly.\nAziraphale stared down at the ring on his finger. “It’s lovely,” he said. “Where did you get it?”\nCrowley shrugged. “Can’t recall,” he said, his throat dry. Under no circumstances was he going to share how long he’d fussed over the design, how many times he’d made and re-made the ring, until it was perfect.\n“I didn’t even think about rings,” Aziraphale said, and he looked shamefaced. “Shall I—would you like—”\n“I have one,” Crowley said. He pulled it out of his pocket, and it felt like he was showing his hand far too much. He should have just let Aziraphale miracle him one into being.\n“So elegant,” Aziraphale sighed. “May I?”\nHe gave Aziraphale the ring, who nearly dropped it, and then had a bit of trouble fitting it over Crowley’s knuckle until Crowley hissed at the ring to behave itself, damn it. Finally it was in place, and rather than letting Aziraphale withdraw, Crowley took his hand again.\n“Isn’t there—” Aziraphale stopped, and delicately cleared his throat. “Isn’t there something you’ve forgotten?”\nCrowley looked down at the golden serpent coiled around Aziraphale’s finger. “We can have a wedding banquet for the two of us when we get to Florence?”\n“No,” Aziraphale said. “I mean, yes, that would be lovely, but. There’s another tradition.”\nCrowley racked his brain, because four thousand years was a lot of wedding traditions, and some of them were distinctly better than others. “Which one, angel?”\nAziraphale wetted his lips. “I believe it is customary to kiss the bride.”\n“Oh,” Crowley said. “Well, if it’s tradition.” He put his hands on Aziraphale’s waist, and tugged him closer, the damnable poof of his skirts essentially necessitating hauling Aziraphale into his lap.\nAziraphale wound his arms around Crowley’s neck. “Very. Exceedingly traditional. Can’t have a wedding without it nowadays, I’m afraid.”\n“Devil’s in the details,” Crowley said, lips hovering against Aziraphale’s.\n“Do let’s not bring him into it,” Aziraphale said, and kissed him.\n\n\n\n\nFlorence was two months of wedded bliss.\nPeople spoke of the honeymoon period, but Crowley wasn’t sure that applied to two supernatural beings who had known each other since the creation of the earth. And their marriage was, after all, purely in service of their respective duties.\nIt was very difficult to remember that, in the moment.\nThey took possession of some fashionable apartments in a fashionable part of the city, and after that, it wasn’t too much terrible trouble to arrange for an introduction to the family in question. The job itself wasn’t difficult—mostly it was listening, and asking a few leading questions, and whispering in someone’s ear the right thing at the right time.\nCrowley was very good at it; he’d had, after all, a lot of practice.\nAziraphale didn’t say exactly what he was up to, but Crowley inferred it was something to do with fertility.\n“Delicate work,” Aziraphale said, when asked how it was going. “You have to—” he fluttered his fingers— “and well, you can’t quite take your eyes off it, or you have to start over. Requires patience and focus, that’s all.”\nWhatever it was, it seemed to be progressing. So the work didn’t appear to be an issue for either of them.\nIt was just everything else.\nTechnically they should have had servants, but the first night in Florence, Aziraphale looked over his shoulder, and said, “My dear, would you mind?”\nCrowley preferred to miracle himself in and out of outfits, but he knew the gist of removing clothing by hand. It in no way prepared him for the experience of taking off Aziraphale’s clothing, piece by piece. But he worked his way through it, slow and methodical—untie this bit here, loosen those laces, unpin this part—and Aziraphale’s skin was revealed to him, bit by bit.\nStrange, that they’d never done this before.\nWhen Aziraphale was down to his camicia, Crowley cleared his throat. “Right, then,” he said, and then looked awkwardly at the bed. “I know you’re not much for sleeping, but—”\n“What’s the saying? When in Rome?” Aziraphale asked.\n“Close enough,” Crowley said, and then before he could think better of it, “Let me take your hair down?”\n“I had a girl put it up before we left,” Aziraphale said, frowning slightly. “I’m not sure I could reproduce the effort.”\n“I can,” Crowley said immediately. And then, again, aware that he was begging: “Let me?”\nAziraphale nodded his assent. Crowley touched his coiffure gently, reverently, and then began to pull out hairpins. He remembered days of sewing hair into place to secure it—it was practical and went in and out of use—but he remembered, too, days of pulling pins from his own hair, always finding more than he remembered putting in.\nWhen he let the braids tumble down Aziraphale’s shoulders and back, the sound Aziraphale made—such a noise of pure pleasure, and all at Crowley’s hands. And when he undid the braids and began to brush Aziraphale’s hair out, it reminded him of something—\nWings, he realized. It reminded him of grooming each other’s wings, back in the early days, when they’d realized they had no one but each other and were still trying to find their footing in this world. Aziraphale sat on a bench in front of him, eyes closed, and Crowley pulled the brush through his hair in a hypnotic rhythm. When it seemed like Aziraphale might actually fall asleep on the bench, Crowley put his hair in one loose plait, which was his own preference for sleeping in when his hair was long.\nAziraphale then changed into a less voluminous camicia for sleeping, the fabric finer and more sheer than what he’d worn under his dress. Crowley attempted to avoid looking as he changed into his own sleepwear, but it was difficult.\nOnce settled together in bed, Crowley said, “You don’t have to sleep, if you don’t want to. I don’t mind if you read.”\n“Perhaps tomorrow night,” Aziraphale said, and snuffed out the bedside candle.\nThe silence in the room felt stifling. Crowley stared up at the ceiling, wondering how he was supposed to sleep now.\nFinally, Aziraphale said quietly, “My dear?”\n“Hmm?”\n“Isn’t there another tradition?”\n“Loads of them, angel,” Crowley said, trying to buy himself some time for his higher brain functions to re-engage.\nAziraphale touched Crowley’s hand softly, and bless it, he was not subtle. “You know the one I mean. I know the humans go on about it, but do you reckon virginity is all that important on one’s wedding night?”\n“It’s not a real thing,” Crowley said. “Just some bollocks some men made up. Virginity is whatever you want it to be.” He turned his head to look at Aziraphale. “What did you have in mind?”\n“Well. I was just thinking—we’ve never—not like this, I mean.”\nThey hadn’t, actually. He could remember every time he’d ever kissed Aziraphale, every time he’d ever driven Aziraphale to shake apart in his arms, every time he’d gasped in Aziraphale’s ear and come. They’d all of them been hurried, and desperate, and tinged with fear of being caught by humans or Heaven or Hell.\nThey’d never had a bed before.\n“May I?” Crowley asked, and the light from the moon was so bright as it streamed in the room, turning Aziraphale’s hair to a shock of pale silver.\n“Please,” Aziraphale breathed.\nThey reached for each other, and kissed as though they’d never done it before, slow and careful and so tender Crowley could barely stand it. And then it wasn’t enough, and Aziraphale was urging Crowley to lie on top of him, the gossamer fabric of his camicia the only thing between them. He kissed Aziraphale’s neck just the way Aziraphale liked, and finally touched the curves of his frankly magnificent bosom.\n“Ooh,” Aziraphale sighed, when Crowley tugged the neckline of the camicia out of his way, so that he could put his lips to Aziraphale’s skin, and kiss and lick and suck and worship him properly.\n“Could spend days here,” Crowley murmured against Aziraphale’s breast, flicking out his tongue against the nipple.\n“I need—” Aziraphale said, and pushed his hips up, and Crowley touched him, just there, the blessed camicia still in the way, and Aziraphale moaned and said, “My dear, oh please, I need—”\n“I know,” Crowley said, and though he wanted to vanish the camicia into the ether, he settled for pulling the hem up, and settled himself again in the cradle of Aziraphale’s thighs, pressed against the warm, wet center of him.\n“Oh good, not stingy at all,” Aziraphale had the nerve to say as he wrapped one hand around Crowley.\n“Stingy!” Crowley protested, letting Aziraphale guide him inside. “When exactly have I ever left you unsatisfied?” \n“Let me think,” Aziraphale said. He was so blessedly tight around Crowley, who paused to look anxiously at his expression.\nApparently, he needn’t have worried, because Aziraphale looked like he was having a very good moment indeed. There was a soft smile on his lips, and then he said, “Well, wasn’t there that time in Barcelona—”\n“Oh, I’m sorry, should I have let them discorporate you rather than letting you find your pleasure a third time—”\n“You could make it up to me,” Aziraphale suggested, just a tiny bit coy.\n“Make it up to you,” Crowley muttered, outraged, and began to move his hips in a dance humans figured out way back when, and maybe it was instinctive, or maybe it was that he knew he had to keep making Aziraphale moan like that and didn’t want to stop, not for anything. He only paused to work a hand between them, to touch Aziraphale as his pace grew more frantic and less steady, and Aziraphale practically shrieked and clutched at his shoulders, and Crowley pressed in, in, in, and Aziraphale went tight around him, and—\n“My darling,” Aziraphale breathed in his ear like a secret, and Crowley groaned and shuddered and spilled deep within him.\nCrowley stayed in him until he softened, arms wound around Aziraphale, holding him close, because there was no need to do otherwise. He could just keep Aziraphale all wrapped up, and let that whispered darling reverberate through him.\nWhen they separated, it was only to get comfortable and curl up close again. Aziraphale put his hand on the back of Crowley’s neck and stroked his nape with gentle fingers, until Crowley melted into sleep.\n\n\n\n\nCrowley woke with this face mashed into Aziraphale’s thigh. Aziraphale was sitting up against the headboard, a book in hand. His hair was an unmitigated disaster.\nWhy, it was almost as though he’d been tumbled but well the night before.\n“I can feel you smirking,” Aziraphale said dryly.\n“Who’s smirking?” Crowley mumbled. He rubbed his face into Aziraphale’s thigh, where his camicia was still a bit rucked up.\n“One might almost think you have something to be proud of.”\n“You tell me, angel,” Crowley said, and lifted the hem of the camicia to stick his head underneath.\nIt was, Crowley felt, an excellent way to start the day. \nAziraphale sat at the vanity bench for him after, and Crowley painstakingly dressed his hair. It had been awhile, but his fingers still remembered the intricacies of various braids, and he had a stupid, fanciful moment when he was done—if he changed his form to a small snake, he could twine himself in his lady’s hair and they could stay together the whole day that way.\n“Crowley?” Aziraphale inquired, meeting his startled glance in the mirror. “Is something wrong?”\n“Nothing,” Crowley said, and slid another hairpin in for want of anything else better to do.\nAs it turned out, it was the start of a daily routine. He woke, gave Aziraphale a good seeing-to, then put up Aziraphale’s hair and helped him dress. They wandered the city and saw what humans wrought with their own hands and free will: art and food and music, and all of it was wonderful. They stopped in at the family palazzo to do the bare minimum of work, before returning home. And then the next day, they did it all over again.\nHeads turned to watch Aziraphale as he passed; his pale blonde hair was so on trend that any number of artists asked Crowley whether his lady would be interested in sitting for a portrait. Noblemen elbowed Crowley and congratulated him on such a beautiful wife. Various others made offers and then wisely and immediately reconsidered them.\nNot having to hide was heady and thrilling; he bought Aziraphale jewelry, a dress, a camicia so fine it was practically transparent, and Aziraphale laughed and said, “My dear, I don’t need so much!”\n“I can take the melon tart back,” Crowley offered.\n“Let’s not be hasty,” Aziraphale said primly.\nThere was a perfect day, when the family held a banquet in a courtyard and there was food that was definitely skirting the edge of sumptuary laws—one of Crowley’s better ideas, if he did say so himself—and through it all, Aziraphale remained by his side. They drank wine and listened to musicians play into the evening, and when Aziraphale pulled him up to standing and said they needed to return home, merriment and laughing suggestions followed them out. They wandered slowly through the city streets, Aziraphale clinging to Crowley’s arm because his shoes were ridiculous and also, he was still a bit drunk. They stopped in the plaza near their home, and ate little tarts with meringue — “Italian meringue,” Aziraphale sighed happily, like that was supposed to mean something to Crowley — and Crowley kissed it from the corner of his lips.\nAnd then it all ended quite abruptly when they came home one day, and there was a letter in the dead center of Aziraphale’s vanity.\nCrowley felt his insides clench when Aziraphale picked it up. Burn it, he wanted to say, burn it, unread, but he knew Aziraphale would never.\nAziraphale’s hands shook as he broke the seal made of literal stardust, and then he took one deep breath and opened it.\nCrowley watched anxiously, and Aziraphale went worryingly pale as he read.\n“What’s it say?” Crowley asked, when he could take the suspense no more.\n“I’m to go to London,” he said, which wouldn’t be concerning if he wasn’t so clearly terrified.\nCrowley had no orders yet. “Then we’ll pack up and go,” he said soothingly, approaching Aziraphale carefully as one might a spooked horse.\n“No!” Aziraphale said immediately. He looked like he was about to cry. “I—I’m afraid I have to go on ahead. Alone.”\n“Alone?” Crowley repeated faintly.\nAziraphale bit his lip and nodded. And then he flung his arms around Crowley’s neck. “Stay safe,” he whispered urgently. “Oh my dear, stay safe.”\n“Safe—angel, hold on, just tell me—”\n“I can’t,” Aziraphale said, and Crowley felt hot tears drip on to his neck.\nAnd that was it, wasn’t it? Aziraphale wasn’t his, not really—he was Heaven’s, in all the ways that really counted.\nCrowley pressed a kiss to Aziraphale’s temple and murmured, “Stay safe, yourself. Not a feather out of place, you hear me? I’ll follow you soon, if I can.”\nHe didn’t want to let go, but soon Aziraphale pulled back. “Crowley,” he said, and he looked as heartsick as Crowley felt, and Crowley couldn’t stand it. He kissed Aziraphale for what would be the last time for a good long while, and then Aziraphale left.\nCrowley stared unseeing after him. And then he laid down in their marriage bed alone, and wept.\nThe honeymoon, it seemed, was well and truly over.\n\n\n\n\nWhen he finally arrived in London after a lengthy detour to Spain, everything was different.\nSuddenly, Aziraphale wanted discreet locations for meeting. Gone were the days of using any flimsy pretext to touch one another; Aziraphale didn’t exactly shy away from him, but nor did he touch him even casually.\nThere was no sign of Aziraphale’s wedding ring. Crowley carried his in his pocket.\nBut some of Aziraphale was better than no Aziraphale at all; once he’d persuaded Aziraphale into formalizing their Arrangement, he thought something more might come of it. But no—Aziraphale continued to hold him at arm’s length, which only made Crowley that much more desperate.\nHe couldn’t say he covered himself with dignity in the following centuries. He paid humans to keep a weather eye on Aziraphale; not that Crowley could do much in the face of the wrath of Heaven, should Aziraphale incur it as he seemed so desperately afraid, but it made him feel better to do what he could. That, in fact, was how he traced Aziraphale from London to the Bastille, and oh, he shouldn’t want to save Aziraphale so much, but one look at Aziraphale’s pleased expression, one look at Aziraphale in his fancy clothes, and he knew he was a lost cause.\nBut they didn’t talk about Florence, not even obliquely, until they encountered one another by chance at a soiree during the Regency.\nCrowley was wearing widow’s weeds and what he thought was a very fetching netted half-veil; it appealed to him to make everyone around him uncomfortable as they contemplated mortality, and also jealous, because he looked very good. He was also getting so much judgement from everyone around him; a person in mourning was customarily not out socially. Not bad work for just standing around at a party.\nHe was making conversation with a young lady who distinctly did not want to be at the ball. He turned their lemonade to something a great deal more alcoholic, because it seemed the only way for both of them to cope. And then he looked over her shoulder and saw Aziraphale, who brightened to see him.\n“Miss Mowbray,” Crowley said. “May I introduce Mr. Fell?”\nThey exchanged courtesies, and Aziraphale stood there, twisting his hands somewhat awkwardly. \n“How are you acquainted with one another?” Miss Mowbray asked, obviously dying for something to cut the tension between them.\n“Mr. Fell was very close to my late husband,” Crowley said, and smiled just a little meanly.\nAziraphale’s expression crumpled.\n“You must miss him,” Miss Mowbray said quietly.\nAnd then Crowley didn’t have it in him to be any more cruel. “Every day,” he said softly. “So much.”\nAziraphale’s eyes welled up.\n“We were so happy,” Crowley said, wistfulness and yearning suffusing him in equal measure.\n“They were,” Aziraphale said hoarsely, so plainly affected that Crowley felt like a heel for thinking he hadn’t cared, that Crowley was the only one who had suffered in the wake of their separation.\n“Please excuse us,” Crowley said to Miss Mowbray, and took Aziraphale’s arm and led him out onto the balcony, to a dark corner where they could talk, unobserved.\nAziraphale got himself together enough to say, “You’re wearing your ring.”\n“I’m quite devoted to the memory,” Crowley said, entirely honest.\nAziraphale looked like he might cry again.\nCrowley couldn’t stand it. “Hush,” he said, and wiped away a tear from Aziraphale’s cheek with his gloved thumb. “I don’t blame you.”\n“I blame me,” Aziraphale said.\n“Don’t,” Crowley said. “For my sake. If that means something to you.”\n“Of course it does,” Aziraphale said, and gave him a watery smile. “My dear, for whom else do you imagine I would—”\n“No one,” Crowley said with sudden ferocity. “Tell me there’s no one else.”\n“There was never anyone else,” Aziraphale said. “There won’t ever be. Didn’t we promise?”\n“We promised,” Crowley said, and he felt something unfurl inside him.\nIt felt like hope.\n“Kiss me once before I go,” Crowley said.\n“We shouldn’t,” Aziraphale said. “My dear, you can’t imagine what kind of trouble we could find ourselves in, not to mention the human scandal—”\n“Let them talk,” Crowley said, and he meant all of them. “What are they going to do to me? I’m already Fallen.”\n“Forgive me, my dear, but I’ve no wish to find out,” Aziraphale said. He took Crowley’s left hand in his and bowed over it, pressing a kiss to the wedding band.\nCrowley watched him go again, and he didn’t like it any better than Florence, and yet.\nHe left the party with a certain lightness to his step, but not before he’d spiked the punch bowl liberally.\n\n\n\n\nWhat was Will’s line? The course of true love never did run smooth. In their case, there was a bit of a hiccup over Crowley wanting to lay in a store of holy water to defend them if needed, and then a very public row where Crowley said a number of things he did not mean, and he thought Aziraphale did too. \nStrangely, it turned out you could love someone and still want to drop them in the drink.\nCrowley went around the next day to apologize, only to overhear two young men outside the shop gossiping, looking in the window as they did so.\n“But he’s the most splendid dancer!” one of said, giggling. “Everyone wonders—you know.”\n“When they might get a chance?” the other asked archly.\n“Freddie said he did, and it was marvelous.”\nCrowley dropped the bouquet of flowers in the street, and then went home to take an exceedingly sulky nap.\nIt lasted almost eighty years. When he woke up, he was a little embarrassed to realize that he’d slept so long, and also that those young men were probably looking at another young man in the shop and not talking about Aziraphale, who couldn’t dance at all. That could have changed in the last eighty years, he supposed. He felt a bit ashamed of the whole thing—Aziraphale would no more be untrue than he would Fall.\nHe might have gone a bit overboard in making it up to Aziraphale. Walking into a church was a bit of a statement, and the soles of his feet burned for three years after. But for the shy, pleased looks from Aziraphale in the car on the way back to the shop? Completely worth it.\nAnd Crowley didn’t stop there. They were spending more time together again, at dinners and films and walks in the park, and Aziraphale was still cautious, but he was more easily persuaded to spend time together socially. And after one film in particular, Crowley went out the next day and bought a leather jacket, a white t-shirt, and a motorcycle, and roared up to the front of the bookshop.\nAziraphale came out, most likely to tell him off for making all the racket—look, revving the engine was fun—and then stopped in the door to the shop, mouth open.\n“Hey angel,” Crowley said, still straddling the bike. “Fancy a ride?”\n“On that?” Aziraphale asked. His tone was incredulous, but his expression put Crowley in mind of one he’d made in Florence quite a lot. It said, oh yes please, only persuade me.\n“Well, only if you want to,” Crowley said, making a show of being extremely casual. “It is a little dangerous, so you’d have to climb on behind me and hold on tight.”\nAziraphale actually fussed with his hair. “Well, I suppose if you’ve come all this way.”\nCrowley patted the seat behind him and let his thighs spread a little wider.\nAnd that was how he ended up with Aziraphale clutching him so tightly and shrieking in his ear. Not quite the way he wanted it, mind, but still pretty good.\n“You’ll discorporate us both!” Aziraphale yelped as Crowley took a turn very quickly.\n“Relax!” Crowley shouted back. “Live a little, angel!”\nAnd most astonishingly, Aziraphale did. He all but melted into Crowley, his cheek pressed against Crowley’s shoulder. They stopped at one of those restaurants that Crowley would never be able to find again by himself, but that Aziraphale somehow knew about. The food was delicious, and Aziraphale was just a touch flirtatious, and that treacherous beat of hope pounded away in Crowley’s chest.\nAfter dinner, Crowley said, “Lift home? I won’t be cross if you’d rather a taxi.”\nAnd Aziraphale wetted his lips, and said, “Let’s take the long way.”\nThe memory of that evening, the warm night wind in his hair and Aziraphale holding him close—maybe the course of true love didn’t run smooth, but that didn’t mean there weren’t parts of it that were awfully good.\n\n\n\n\nThe world was about to end, and Aziraphale was gone. \nCrowley sat in a bar, and said to no one, “I thought we’d have more time.”\nAnd wasn’t that the cruelest turn of them all? They’d had all the time in the world, right until it had run out. He’d stockpiled holy water with Aziraphale’s help, trying to prepare for a day when he might persuade Aziraphale to his side. \nNot Heaven’s, and certainly never Hell’s. Just his own. Their own. \n“I thought we’d get back there, someday,” he said brokenly, and downed the rest of his drink before calling for another. \nAnd then, miraculously, there was Aziraphale: not gone forever, merely discorporated, and nattering on to him about Tadfield of all things. Crowley was so full of emotion, like when he’d seized Aziraphale in a kiss on VE Day in Trafalgar Square, and he felt like that sea of humanity did back then—relief and shock and blinding joy. \nAziraphale had finally chosen their side. Crowley was not going to disappoint him.\n\n\n\n\nIt was so risky. \n“What if it doesn’t work?” Crowley demanded. “I thought they destroyed you today—yesterday?—my point is, I didn’t save this world so I could live without you in it.” \nAziraphale looked infuriatingly calm. Then again, it was his idea. “It will work. Agnes said it would, and she was never wrong, my dear. Not once.”\nCrowley paced in front of him. “But what if—“\n“My darling,” Aziraphale interrupted. “If you won’t trust her, will you trust me? I know this is what we’re meant to do.”\n“How can you be sure?”\n“I didn’t save this world so I could live without you in it.”\n“Technically neither of us did the saving,” Crowley said.\nAziraphale gave him a look that managed to be both annoyed and extremely tender. “It will work. Now, come here.” He put his arms around Crowley. “Stay safe,” he whispered, as he’d done hundreds of years before.\n“Not a feather out of place,” Crowley reminded him, holding him tight. “And I’m not just saying that because they’re my feathers, mind.”\nAziraphale tipped his head up for a kiss, and Crowley obliged him, putting every last desperate ounce of passion and frustrated longing into it.\nAnd then Crowley was looking up at his own face, and it was time to go.\n\n\n\n\nThey toasted the world with champagne, and Aziraphale was positively giddy.\nCrowley smiled at him helplessly, and poured them more champagne, and they talked and talked and talked like it was the old days when a century might pass between meetings, and they had so much to catch up on.\nDiners changed around them, and they ordered an obscene number of desserts, and that was about when Crowley realized how much Aziraphale was fidgeting.\n“You all right there, love?” Crowley asked. It almost came out smooth. Fine, his voice cracked on the last bit.\nAziraphale stared at him, looking all kinds of flustered. And then he dug something out of his pocket and held it out in his closed fist.\nCrowley gamely held out his hand, and Aziraphale dropped something into it.\nIt was Aziraphale’s wedding ring, the golden serpent twined around just as bright as it had been, so long ago.\nBefore he could even open his mouth to ask what on earth, Aziraphale said abruptly, “Put it back on me.”\nCrowley tried to make his mouth form words, but only ended up with a few incoherent noises, and then he was seizing Aziraphale’s hand and sliding the ring back on, and oh—oh no, he was actually crying.\nSo was Aziraphale, but he was smiling through his tears. “I don’t suppose you—”\n“Right here,” Crowley said, taking his ring out of his pocket. “It’s always been right here. Just in case.”\nAziraphale slid it on to Crowley’s finger. Unlike the last time, it didn’t give them any grief. There wasn’t any left to give.\nThey held each other’s hands, and just as they were leaning in for a kiss, Crowley found himself blurting out, “I bought you a cottage.”\n“Sorry?” Aziraphale said, eyebrows going up.\n“We don’t have to live there. Could just use it for a holiday, if you like,” Crowley babbled on. “Or a honeymoon. Unless you’d rather—we could go back to Florence?”\n“I’m sure the cottage will be perfect,” Aziraphale said, and then kissed him, right in front of all the humans, and presumably, the Almighty Herself.\n“I put lots of books in it,” Crowley assured him.\nAziraphale gave him that heart-meltingly soft smile. “Will it have you in it?”\n“Yes?”\n“Then that’s enough for me,” Aziraphale said, and kissed him again, and again, and again, until Crowley pulled him up to standing, and somebody miraculously paid the bill, and they stumbled out into the world, together.\n\n\n"
}