{
    "id": "20021302",
    "url": "https://archiveofourown.org/works/20021302?view_full_work=true",
    "author": [
        "newamsterdam"
    ],
    "title": "the meaning of the ritual",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù"
    ],
    "relationships": [
        "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
    ],
    "characters": [
        "Wei Ying | Wei Wuxian",
        "Lan Zhan | Lan Wangji",
        "Jiang Cheng | Jiang Wanyin"
    ],
    "additional_tags": [
        "Explicit Sexual Content",
        "Blindfolds",
        "Light Bondage",
        "Ritual Sex",
        "Alternate Universe - Canon Divergence",
        "Let Lan Wangji Fuck the Yiling Patriarch 2k19",
        "First Time Blow Jobs",
        "Anal Sex",
        "Porn with Feelings"
    ],
    "language": "English",
    "series": "Part 1 of everyone lives (but at what cost)",
    "published": "2019-07-29",
    "completed": null,
    "words": "8,241",
    "chapters": "1/1",
    "comments": "248",
    "kudos": "13,666",
    "bookmarks": "2,019",
    "hits": "145,011",
    "summary": "<p>“Lan Zhan… wants to bed me?”</p>\n<p>The hand on his chest is shaking, slightly. “Mn.”</p>\n<p>“Oh,” Wei Wuxian breaths out. </p>\n<p>There’s something— something <i>powerful</i>, about that. Lan Wangji wants to bed him. Lan Wangji wants to sleep with him. Lan Wangji wants to touch him, and kiss him. The immovable, implacable Second Master of Lan, with a face and principles both carved from jade, <i>wants</i> him.</p>\n<p>“Is this a fantasy of yours?” Wei Wuxian asks. “Forcing all the demonic energy out of me with your—” </p>\n<p>Lan Wangji claps a hand over his mouth. “Silence, now.”</p>\n<p>When the entire cultivation world turns against the Yiling Patriarch, Wei Wuxian makes a risky gamble— he'll agree to participate in an ancient ritual for cleansing the spirit, so that his character can no longer be called into question. The catch? He has no idea who his partner for the ritual will be.</p>",
    "notes": "<p>minor canon divergence: wen ning didn't die in the prison camp, although he was severely injured. wei wuxian still set up camp in yiling with the wen survivors, but as of this moment jin zixuan and jiang yanli are alive, and wei wuxian's mental state isn't as far gone as it would've been if wen ning had died and been brought back.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>hello i love wangxian i hope you love wangxian too</p>\n<p><a href=\"https://twitter.com/newamsterdame\" rel=\"nofollow\">twitter</a> | <a href=\"https://newamsterdame.tumblr.com/\" rel=\"nofollow\">tumblr</a></p>",
    "text": "“You’re not even going to give me a hint?” Wei Wuxian has his head against the table, his arms splayed so that his long sleeves drape over the sides. “Come on, who is it?”\nJiang Cheng, primly seated in a chair pulled out from the table, one leg crossed over the other, scoffs. “You think they’d let me pick? They barely agreed to this in the first place.”\nWei Wuxian hums. He might’ve guessed that. He still doesn’t know whether he expected Jiang Cheng to stand beside him; all he knows is that he’s grateful his brother did. He’s not sure what would’ve happened if he’d had to take on the burden of protecting the remnants of the Wen clan by himself.\n“It’s not like there are very many options,” he says. “Unmarried cultivators who’ve never taken to bed with anyone, willing to lie with the Yiling Patriarch?” His laughter echoes through the room.\nJiang Cheng wrinkles his nose. “It’s the willing part you have to worry about. You were never as good at flirting as you thought you were, even before you became the cultivation world’s boogie man.” \nWei Wuxian clicks his tongue against the roof of his mouth. “No need to be jealous, Jiang Cheng. I’m sure as Sect Leader, you’ll find a partner soon enough.”\nHis brother rolls his eyes, kicking Wei Wuxian with one leg under the table. “It’s not me we should be worried about. Or have you forgotten how serious this is? The entire cultivation world is ready to tear you apart, for standing between them and the Wen clan, for having this power of demonic cultivation! Can you be serious?” \nThis finally sobers him. He blinks his dark eyes, feels the heavy emptiness in his chest and the buzzing distraction of his mind. Jiang Cheng can’t know just how serious this is, how much the use of demonic cultivation is truly affecting him. If he did know, what would he do? Would he still stand by Wei Wuxian? \n“I am serious,” he says softly. “It was my suggestion, wasn’t it? If I complete the ritual, the other clans will have nothing to fear. At least, nothing they can act on without appearing like hypocrites.”\n“Yeah,” Jiang Cheng agrees, with a sigh. “But leaving the choice up to them wouldn’t have been my preference.”\nIdly, Wei Wuxian considers who it might be. The Sunshot Campaign had decimated the ranks of young cultivators, but that affected the men more than the women. As a result, there’s been a flurry of marriages over the last couple of months, Jiang Yanli’s included. Wei Wuxian can’t imagine that the leaders of the cultivation world would be so depraved as to suggest his shijie as a possible candidate, but in any case he’s glad the option’s off the table. \n“Wen Qing is unwed,” Wei Wuxian considers. “That might be a way of punishing us both.”\nJiang Cheng huffs a breath. “They’d never trust a Wen. It’d be too easy for the two of you to lie, and say you’d done it when you hadn’t.”\nWei Wuxian offers him a crooked smile. “I think they’re all overestimating how well she thinks of me, to think that Wen Qing would lie for me.” \nEven as he says it, he knows it isn’t true. Wen Qing had come to him for help, and together they’d saved Wen Ning when he was on the brink of death. Wei Wuxian had rescued the rest of the Wen clan, and is now standing with them, asserting their right to live in peace. He’s even gotten Yunmeng Jiang to stand with them, against all expectations. \n“No,” Jiang Cheng mutters, still thinking. “It has to be someone no one will question. Someone who’s integrity is beyond reproach. Someone who’s righteous light can combat even…” He raises a brow, indicating Wei Wuxian’s dark robes, Chenqing at his waist. \nWei Wuxian barks a harsh laugh. “Not many people so pure, especially not after the war!” \nJiang Cheng reaches forward, lays a strong hand against Wei Wuxian’s shoulder. “They won’t— it won’t be anyone who would hurt you. That would be against the whole point. So, don’t worry. You have to make it through this. It’s the only way to keep you safe, and get the target off your back.” \nMaybe Jiang Cheng sensed the tenor of panic in Wei Wuxian’s laughter. Now, he places a hand over his brother’s and sighs deeply.\n“You don’t need to apologize, Jiang Cheng. I know you did this for me. And it was my idea. I knew what I was getting myself into.” \nIt’s an ancient right, one used to purify the soul and strengthen the core. A form of dual cultivation that draws out all darkness and resentful energy, and replaces it with something stronger and less erratic.\nWei Wuxian doesn’t think it will work the same way for him, not when he’s missing a golden core and has been steeped in resentful energy for so long. But maybe it’ll alleviate some of the echoing, frantic voices building in the back of his mind. Maybe it’ll help him clear his head. Maybe, it’ll stop him from falling into the abyss that haunts his dreams. \nHe takes a deep breath. “One purified Yiling Patriarch, coming up.” \n—\nHe didn’t get a good look at the chamber before the blindfold was slipped over his eyes. Pure black silk, he can’t see anything through it. The last time he’d worn such a thing, he’d been out in nature. He could feel the earth beneath his boots, hear the wind whistling through the trees. There had been other senses to help him along, the least of which wasn’t his ability to sense malevolent corpses and resentful energy. \nThe surface he’s sitting on now is smooth, cool like stone. The chamber is utterly silent. His hands are folded neatly in front of him, his legs dangling over the ceremonial dais. He wears a loose, simple robe of dark gray. All other garments had been removed before entering.\nFor all that he jokes about experience, for all that he teases Jiang Cheng for his lack of charm, Wei Wuxian’s never done this before. He never imagined a first time with such high stakes, with so little control.\nDespite the coolness of the chamber, a bead of sweat drips down his face.\nA door opens and then shuts on the other side of the room. The sudden noise startles him, and Wei Wuxian looks up, following the sound. Quiet, even footsteps pad across the floor. \nThey’re here. \nWei Wuxian clenches his hands, but they’re shaking. There are so many risks, here. What if the chosen cultivator discovers Wei Wuxian’s missing golden core? What if they reveal that weakness to the entire world, leaving Wei Wuxian and the Wens and Yunmeng Jiang vulnerable? What if they take advantage of Wei Wuxian’s state to see him brought low, weak and humiliated? What if—\nLarge, cold hands grip both of his, bringing them together in a firm clasp. The touch is comforting, solid. Wei Wuxian lets out a hollow sob of relief.\nThe person leans forward, and Wei Wuxian feels smooth hair brush against his cheeks, his clavicle. Then, he loses track of all else when a pair of perfect lips presses against his own. \nAh. How could he have ever thought this person would hurt him? They kiss with such fervor, but all the while they stroke Wei Wuxian’s hands, like they want to comfort him. The kiss steals Wei Wuxian’s breath, but it also stops him from thinking. Light-headed, his worries seem far away. \nThe person pulls back for a moment, only to lean in and kiss Wei Wuxian again. \nFinally, his mind and memories catch up to the physical sensations. Wei Wuxian knows this kiss. This is the only person who’s ever kissed him.\nBreathless, he asks, “I know you.”\nFor a moment, there’s only silence. Then, “Mn.”\nHis heart thunders in his chest. “Lan Zhan?”\n“Mn.”\nBefore he can help it, laughter bubbles out of him. His whole chest shakes with it. But really, who would have thought! The purest of them all, the most righteous— Hanguang-Jun himself, being pushed into this role! Perhaps they thought no one else was strong enough to not be taken in by Wei Wuxian’s wickedness. Perhaps they never intended to sacrifice a maiden to the task. But— Lan Wangji! Honestly, how dare they ask something so base of him? \n“Wei Ying.” Lan Wangji’s hands move up to Wei Wuxian’s shoulders, holding him firmly. “Are you nervous.”\nIf Wei Wuxian could see him, there might be an indication of question in the slight bow of Lan Wangji’s head, the just-barely-visible tilt of his brows. Now, all he has to go on is Lan Wangji’s even-toned, melodious voice, and the feel of his hands against Wei Wuxian’s body, only the thin robe separating them.\nHe shudders.\n“Wei Ying.”\nWei Wuxian shakes him off, crosses his arms over his chest. “Why does everyone keep asking me that? I’m the one who adapted the ritual for this purpose, I’m the one who suggested it! It’s not some great burden, is it? To bed someone in order to be deemed pure and acceptable, again?”\nHe knows they’re all scared of him. The sidelong glances and whispers had started as soon as he’d returned from the Burial Mounds. The more he did, the more he killed and terrified during the Sunshot Campaign, the more distant even his own allies became. And then he’d seen what they’d done to Wen Ning, and his mind had nearly shattered with rage. If Wen Ning had been dead, he doesn’t know what he would've done. \nHis breathing is ragged, his mind far away, when Lan Wangji begins to gently stroke his hair back from the crown of his head. He follows the path of Wei Wuxian’s skull, down to the base of his neck, and his musician's fingers are so skilled that Wei Wuxian groans with a relief he hasn’t felt in months, perhaps years. \nHe wants to lean forward into this touch, sees no reason to hold himself back. Lan Wangji might look down on his methods of cultivation, might have preferred to imprison Wei Wuxian in seclusion until he found a way to purify himself. But Lan Wangji isn’t cruel. He isn’t harsh, or violent. Wei Wuxian can trust him. \n“How’d they ever get you to agree to this,” Wei Wuxian wonders aloud.\n“Ridiculous,” Lan Wangji murmurs, and maybe it’s wishful thinking, but Wei Wuxian imagines his lips turning up just slightly, almost fond.\n—\nLan Wangji moves to secure his wrists, and Wei Wuxian panics. He can’t see, can only feel a cool touch, and suddenly he’s back in the Burial Mounds. Streams of resentful energy had held him down, then, cold enough to blacken skin but somehow still burning. He’d screamed and thrashed, but there’d been no getting away from it, and without a golden core he had no power, no means of fighting back. The energy surrounded him, drowned him, forcing its way into his mouth and down his throat—\n“Wei Ying,” Lan Wangji says, and there’s a mournful tone to his normally melodious voice. He’s secured Wei Wuxian’s hands to either side of the dais with lengths of silk, but now he’s gently rubbing his fingers over Wei Wuxian’s wrists, soothing him.\nThe touch is cool, not freezing. Warmth gathers in his skin, not a burning sensation, but a gentle comfort. \nWei Wuxian takes in a deep breath, then releases it as slowly as he can. He can feel Lan Wangji’s shadow on him, can imagine those golden eyes taking in every inch of him— his long, loose hair; his open robe, revealing the scars across his chest, some surgical and some won in battle, along with the Wen brand; his legs, still hanging over the dais, trembling.\n“Lan Zhan,” Wei Wuxian moans, when he feels Lan Wangji’s careful hands trail the length of his arms, down to his chest, then his stomach.\n“Mn?”\n“You’re so distracting,” Wei Wuxian complains, trying for a laugh. And indeed, every time Wei Wuxian’s mind tries to take him back to a dark place, Lan Wangji’s touch is there to ground him, to remind him where he is. It feels… good. Wei Wuxian likes it when Lan Wangji touches him. \n“Wei Ying has something else to focus on?” Lan Wangji asks, bland and straight-faced as ever.\nWei Wuxian chokes another laugh. “That’s not what I meant—” \nOh. That’s Lan Wangji’s tongue, in his mouth. Lan Wangji’s strong hands circling his wrists. If he’s this close, if Wei Wuxian can feel his clothed chest brushed against his own bare one, then Lan Wangji must have climbed onto the dais. He’s crouched over him, holding him down, and kissing into his mouth, licking into him, biting his lips—\n“Ah— ah— Lan Zhan!” Wei Wuxian gasps for breath when Lan Wangji pulls away, his chest heaving.\n“Mn?” Lan Wangji asks, and is it Wei Wuxian’s imagination, or is he also struggling for air? Wei Wuxian can feel Lan Wangji’s breath ghosting over his face, before he pulls back.\n“Who— who knew you’d be so good at this?” Really, despite being number two on the list of eligible young masters, Lan Wangji shouldn’t be so skilled! Or maybe it isn’t skill, but the sheer force of him, overwhelming and grounding all at once. Wei Wuxian doesn’t know how to kiss like that! He can’t even use any leverage to press back into the kisses, and probably feels like sucking on a fish. How disgraceful!\nOr maybe it doesn’t matter. He was the fourth-ranked young master, once upon a time, but even then he’d never given much thought to marriage. He wasn’t like Shijie or Jiang Cheng. He has no responsibility to continue a dynasty or forge political connections through marriage. The entire thought of romance has always been far away for him, outside of the fun of teasing pretty girls or admiring others’ looks from afar. \nHe’d never managed to keep his distance from Lan Wangji, though. From the first, everything about Lan Zhan had drawn him in and refused to let him go.\n“Wei Ying,” Lan Wangji says suddenly, seriously. One of his hands rests lightly on Wei Wuxian’s bare chest, making him shudder.\n“What’s that,” Wei Wuxian teases, “Do you like saying my name, so much?” \nLan Wangji must shake his head, because loose strands of his hair brush across Wei Wuxian’s skin, tickling him. \n“Is this what you want,” Lan Wangji says. The words come slow and deliberate, like stones being placed on a scale to measure the weight of gold. Each one is careful and precise, their meaning perfectly clear. \nFor some reason, Wei Wuxian is trembling. He wants to tease Lan Wangji some more, wants to come up with some cute, deflecting excuse. Instead, he blurts out, “I have to.”\nLan Wangji’s hand clenches slightly, where it’s braced against Wei Wuxian’s back. “Wei Wuxian… does not follow rules.”\nWei Wuxian laughs, his voice shaking, “I do so! At least, when they suit me, or I want to, or they’re not keeping me from doing something important! It’s just that Gusu has too many! No one could follow them all!”\nA stupid thing to say to one of the Twin Jades of Lan. But then, haven’t so many of Wei Wuxian’s choices up until now been stupid?\n“Wei Wuxian… does not follow rules simply to follow them,” Lan Wangji amends. There’s a deep quality to his voice, something that Wei Wuxian might categorize as awe or respect under different circumstances. But there’s no way Lan Wangji admires him for his rule-breaking. That’s utterly insane. \n“I don’t,” Wei Wuxian agrees. “But this— I made my decision, before I came. If I don’t let this happen, the other sects will keep looking at Yunmeng Jiang as a threat. They’ll keep coming after the Wens. I can’t keep them all safe, not just by fighting them back by myself. I need to release the tension. Until they all get back on their feet.”\nLan Wangji hums a low note, an indication that he’s listening intently. \nWei Wuxian can feel his heart beating up against his chest, like it’s struggling to be held in Lan Wangji’s palm.\n“How’d you even get roped into this, Lan Zhan,” Wei Wuxian babbles. “Did Gusu Lan take pity on me, and send a righteous cultivator that no one could disagree with?”\n“No,” Lan Wangji says simply.\n“No?”\n“No,” Lan Wangji says again. “I chose.”\nLightning strikes him through the chest, as though the sensation is being directed through Lan Wangji’s hand where it meets his skin. Lan Wangji wants to sleep with him? Even though he’s a demonic cultivator, a rule-breaker, a man? How could that possibly be?\nExcept that Lan Wangji isn’t, cannot be, a liar. He does not waste words. So, if he’s said so, it must be true.\n“Lan Zhan… wants to bed me?”\nThe hand on his chest is shaking, slightly. “Mn.”\n“Oh,” Wei Wuxian breaths out. \nThere’s something— something powerful, about that. Lan Wangji wants to bed him. Lan Wangji wants to sleep with him. Lan Wangji wants to touch him, and kiss him. The immovable, implacable Second Master of Lan, with a face and principles both carved from jade, wants him.\n“Is this a fantasy of yours?” Wei Wuxian asks. “Forcing all the demonic energy out of me with your—” \nLan Wangji claps a hand over his mouth. “Silence, now.”\n—\nIt really is very hard to keep silent when he can feel Lan Wangji’s breath against his groin, ghosting across his cock. In his wildest dreams and filthiest imaginings, he would never dare think of so defiling Lan Wangji.\nIt’s really unfair that he doesn’t get to see it.\nLan Wangji must be kneeling on the dais, his strong hands resting on Wei Wuxian’s legs just under his knees. He strokes along Wei Wuxian’s skin in a rhythmic pattern, so calming that Wei Wuxian’s head falls back, and all he can focus on is the anticipation. Lan Wangji is breathing lightly against him, his touches as soft as crane’s feathers on the wind. But he won’t touch Wei Wuxian in the way he craves.\n“Lan Zhan,” he whines. “If you’re not going to touch me, kiss me again. I’m bored.”\nLan Wangji must turn his head, because his lips press insistently against the soft skin of Wei Wuxian’s inner thigh. \nWei Wuxian’s legs shake as those kisses trail upwards, his muscles clenching in anticipation. No one… no one has ever touched him like this. No one has ever treated his body as something precious, something sacred. No one has ever given him affection in this most potent, intimate form. \n“Lan Zhan…” He doesn’t know what he’s about to say, but his voice shakes and then cuts off as Lan Wangji kisses the tip of his hardening cock. “Ah!”\nLan Wangji’s lips are against his cock, his hand still against Wei Wuxian’s thigh. And now his lips are moving, caressing, licking ever so lightly at his skin, teasing him. Wei Wuxian’s entire mind narrows in on that sensation, everything else blocked out, not seeing or hearing anything. It’s just the cool, soft touch of Lan Wangji, of Lan Zhan, against his flushed skin. \n“You,” he groans out, “You can’t—” \nThis is a purity ritual. It’s meant to cleanse him, make him whole and acceptable once more. But instead, it’s only pulling out his most depraved desires. He wants to see Lan Wangji’s lips against his cock. He wants to— wants to— \n“I can’t,” he says, thoughts going fuzzy as Lan Wangji reaches upwards, stroking over his balls experimentally, reverently. “Not to you, I can’t—” \nThe touches stop. Cool air blows against his exposed skin as Lan Wangji steps away from him. \nNo. That wasn’t what he wanted. “Lan Zhan!”\n“Wei Ying,” Lan Wangji says, and his voice is close, he hasn’t moved very far away at all. “You said you didn’t want me to…”\n“No,” Wei Wuxian insists, head shaking madly back and forth. “It’s not that I don’t want it— want you! I do, but I can’t! You’re— I’m—”\nA cool hand, perfect as white jade, brushes his hair back from his brow. “What is it?”\nHe chuckles out a nervous laugh, all his arrogance and artifice stripped away. “It’s shameful, Lan Zhan.”\nThe hand keeps brushing through his hair, so gentle it’s painful to consider. “Tell me.”\n“If you— if you keep touching me, like you were— then I’m going to come.” He hiccups out another laugh, his mind fighting between the intense heat the image stokes in him, and the shame of spilling out over Lan Wangji’s perfect hands, his peerless face. \nHe’d always meant demonic cultivation to be his own tool, his way of protecting others. He was never supposed to drag anyone else down with him! \nA long silence stretches between them, but Lan Wangji never stops gently stroking his face, his hair. \nFinally: “You can.”\n“What?” His eyes widen behind the blindfold, but all he sees is darkness. \n“You can release,” Lan Wangji says, as prim and reserved as ever. “And again, when it is time.”\nHe really can’t keep talking like that, not in his deep, calm voice. It’s as clear as the springs running through Gusu’s mountains, as unwavering as the Lan clan’s pure white banners hung from the railings. \n“Lan Zhan,” Wei Wuxian whines. “You’re so confident. But you’ve never done this before, either. How can you be so sure you’ll make me come twice?”\nLan Wangji huffs out a breath, close to Wei Wuxian’s ear. Then, if the flutter of fabric against Wei Wuxian’s skin is anything to go by, he shifts down the dais once more to resume his former position. \n“Oh,” Wei Wuxian says, “Don’t take that as a challenge—”\nIt’s too late. Lan Wangji’s lips are against his cock again, his fingers gently tapping against Wei Wuxian’s skin like he’s plucking his guqin’s strings. \nBefore, it was just closed-mouth kisses, but now Lan Wangji is licking lightly against his skin, his breath like a cool burst of air, his motions so even and controlled.\nWei Wuxian lets his head fall back, his arms stretched above his head and his spine curling as he raises his hips. If it’s shameful, so be it. \nWhen was he last so aware of his body? For months, it’s been a constant struggle to drown out the voices in his head, to keep his mind in the present. But now, this moment is stretching into eternity, and all he has to be aware of is himself, and Lan Wangji touching him. When did he last feel so good?\n“Ah, ah—” The noises slip unbidden from his lips, and his entire body tensing and relaxing at intervals, rolling into the rhythm of Lan Wangji’s mouth on him.\nLan Wangji hums around him, taking him into his mouth, and fuck, even that is melodic. He isn’t swallowing him down entirely, just licking over his tip and then a bit deeper, but it’s still so good that Wei Wuxian never wants it to end.\nHow must Lan Wangji look, right now? Is his hair still perfectly in place, or have dark strands come loose over his white robes? Are his lips stretched painfully, made red by the attention they’ve given Wei Wuxian?\nThe image of Lan Wangji— perfect in white and blue, but with his lips red and wet— sends Wei Wuxian jolting up against the dais. His open robe slips from his shoulders, and he gasps for air. \n“Lan Zhan— Lan Zhan—”\nLan Wangji only hums again, then continues to lick at his cock even as Wei Wuxian begins to come. \nHe can’t control it, can’t see it, only feels that Lan Wangji pulls off of him, feels his come spilling over his thighs. His breathing is ragged, his vision white even behind the length of black silk. \n“Wei Ying.” Lan Wangji is beside him, again, brushing a cool cloth over his forehead and cheeks. \n“Second Master Lan is so diligent,” Wei Wuxian says, when his words finally return to him. Still, he leans into the touch of the cloth, strains to feel Lan Wangji’s fingertips through it.\nLan Wangji hums neutrally, and Wei Wuxian thinks that perhaps the blindfold is a kindness. He doesn’t have to see whatever expression is on Lan Wangji’s face, and search for meaning there. Because he’s said this is his choice, but what does that really mean? That of all the options, Lan Wangji chose to take on this burden himself? Is he so righteous, so noble, that he’d sacrifice this intimacy, meant for another, to save Wei Wuxian?\nHe doesn’t want to look at Lan Wangji right now and see only duty and resignation on his face. And he knows that isn’t fair to Lan Wangji, not when Wei Wuxian proposed this entire thing out of a sense of duty, out of a desperation to spare the Wen clan and alleviate the burdens of Lotus Pier. This is his only chance to remain in the cultivation world without giving up cultivation entirely, without revealing what he’s lost. \nBut how can he do this to Lan Wangji? \n“What will Gusu Lan think?” \n“Mn?” Lan Wangji questions, his hands stilling in their rhythmic motions.\nDid he say that aloud? What is wrong with him? \n“Gusu Lan did not bid me to come here,” Lan Wangji says slowly, answering the question that Wei Wuxian doesn’t dare repeat.\n“They didn’t try to stop you?” Wei Wuxian has to know. \n“My sect does not dictate my choices,” Lan Wangji says carefully, with surety. \n“You go to sleep at nine and wake at five!” Wei Wuxian yells, hysterical. “Every day, without fail!”\nLan Wangji’s hand rests lightly on his shoulder, now bare. It’s too much, but Wei Wuxian also never wants it to stop. \n“Because I choose to,” Lan Wangji says simply. \nHe doesn’t understand Lan Wangji. He wishes he didn’t understand himself so well, and what he’s selfishly feeling in this moment.\n“Wei Ying,” Lan Wangji breathes out, either relieved or frustrated. \nWei Wuxian closes his eyes behind the black silk, lets his head fall back. “I won’t stop you,” he says.\n— \nLan Wangji has many admirable qualities. Those days they’d spent together in Gusu Lan’s library pavilion, Wei Wuxian had learned about Lan Wangji’s virtues, and how different the two of them truly are. Case in point? Lan Wangji has endless reserves of patience, his fortitude deep and inexhaustible. Wei Wuxian, on the other hand, is mercurial and easily bored, always ready to be blown in a new direction by the wind. \nWei Wuxian’s body is relaxed from that first orgasm, his muscles uncoiled and loose for the first time in ages. But his mind is as active as ever, running in different directions when he hears Lan Wangji unscrewing the cap of a lacquered wood container. \n“What’s that?” he asks, suspicious.\nThe scent that fills the air is like rose water, light on the senses but unmistakable. The Wen women who live in Yiling have no use for perfumes, and Jiang Yanli has always favored creams scented with lotuses, and now peonies. Rose water is something new, not associated with any specific person. \n“To ease the way,” Lan Wangji says.\n“Oh?” Wei Wuxian can’t help but laugh. “That’s a bit vulgar, isn’t it, Lan Zhan? Did you research this? How are you so well-prepared— oh!” \nHe can’t help but yelp, when Lan Wangji brushes up his legs, and then circles his rim with cool fingers coated in smooth oil. \nWei Wuxian is no stranger to these things, in theory. He’s looked at all sorts of illicit materials, mostly supplied by Nie Huaisang. He’s even seen cut-sleeve works, is familiar with men sitting atop one another’s laps, or taking each other in hand or mouth. But despite all that theoretical, almost voyeuristic knowledge, there is still something startling about Lan Wangji reaching inside of him.\n“Wei Ying,” Lan Wangji murmurs, voice like water gentling flowing over stone. “Relax.”\nWei Wuxian wonders if Lan Wangji would be able to relax, if Wei Wuxian reached inside of him and stretched him open. That’s another scenario he shouldn’t dare imagine, and yet—\nLan Wangji presses one finger inside of him, holding it shallowly inside of Wei Wuxian’s heat, waiting for the tension in his muscles to ease. Wei Wuxian knows exactly what Lan Wangji’s hands look like, his long and elegant figures skipping across a guqin’s string, his grip white-knuckled on Bichen’s hilt in battle. His hands are beautiful and skilled, and right now he is using them to ease his way inside of Wei Wuxian. \n“Lan Zhan,” Wei Wuxian says on an exhale, his chuckle lost in his deep sigh of relief, of fondness. \nLan Wangji hums, and presses deeper inside of him. The intrusion is uncomfortable, unnatural. But Lan Wangji is patient, his touches soft but sure. He works his way around the inside of Wei Wuxian’s rim, pressing against the soft heat of him. Wei Wuxian breathes in and out with the motions, inhaling with each moment of pressure and exhaling when it releases. \n“Mn,” Lan Wangji hums approvingly. His other hand brushes soothingly up and down Wei Wuxian’s side, from under his ribs to the jut of his hip. \nThe only problem with Lan Wangji, Wei Wuxian thinks in between breaths, is that he isn’t much for talking. There’s nothing for Wei Wuxian to focus on or be distracted by, and so all he can do is imagine the press of beautiful, elegant fingers inside of him.\n“I wish I could see you,” he murmurs carelessly. It’s been awhile, since he’s seen Lan Wangji in person. “I’m always stealing looks at you, but now, when you’re right here for me to look at, I can’t see you.”\nNormally, he’d keep a tighter rein on his tongue. Or perhaps he wouldn’t, but the words would be meant to tease Lan Wangji and get a rise out of him. Now, his words are painfully honest.\n“You,” Lan Wangji begins, his fingers stilling inside Wei Wuxian.\n“People say that to you a lot, don’t they?” Wei Wuxian asks. “You, the most beautiful Young Master. It’s the truth. I just want to know— what do you look like— when you’re doing such things to me?”\nLan Wangji’s efforts inside of him do not cease. Even with Wei Wuxian saying such things, he’s focused on the task at hand. He’s silent, in the face of Wei Wuxian’s words.\n“This is why I need to see you!” Wei Wuxian complains. “I can’t tell what you’re thinking, when I can’t see your face! Are you blushing, Lan Zhan? Or do people say this to you so much that it doesn’t matter, at all?”\nMaybe it’s the orgasm making him loose, or the strange security that being with Lan Wangji gives him. For the first time in months, or longer, he isn’t looking over his shoulder for an immediate threat. Despite the sometimes-painful clench of his muscles against intrusion, he’s more relaxed than he can remember being. Lan Wangji’s touch is soothing, and it feels so good.\nBut then, it’s gone.\n“Lan Zhan?” Wei Wuxian tries to lift himself up, but cool hands— one slick— come up against his wrists where they’re bound above him. \nLan Wangji yanks at the restraints, releasing one entirely. He pulls Wei Wuxian’s hand forward, pressing it against his own cheek.\n“Oh,” Wei Wuxian says, dumbfounded. “Lan Zhan, you’re warm.”\nWei Wuxian can’t see him, but he can feel him. His cheeks are flushed, and they must be red. How does the soft blush look against Lan Wangji’s porcelain skin? White has always been Lan Wangji’s color, and red Wei Wuxian’s. Is Wei Wuxian leaving his mark, painting Lan Wangji’s skin in his own way?\nLan Wangji leaves Wei Wuxian’s hand pressed against his face for three heartbeats, then pulls it away and reties it above Wei Wuxian’s head. \n“Oh,” Wei Wuxian says, disappointed this time. “But Lan Zhan, I want to touch you—”\n“The ritual has rules,” Lan Wangji says.\n“Whatever happened to choosing?” Wei Wuxian teases.\nFingers brush over his bound wrists, then lightly over his lips. “I chose.”\nThe implication sends a jolt through Wei Wuxian. Lan Wangji likes having him trussed up like this? It probably makes him easier to deal with, but the tone of Lan Wangji’s voice suggested something else. There was a darkness to it, like the sharpest edge of good alcohol.\n“You like this,” Wei Wuxian says, half a question. “Lan Zhan— Lan Er Ge, do you like having me at your mercy?”\n“Shameless,” Lan Wangji murmurs.\n“Which one of us has the other tied up and naked, hm? Am I the only shameless one?”\nOnly silence answers him, and Wei Wuxian strains to hear what else is happening. The brush of fabric, soft footsteps around the dais. A hand brushes lightly over his half-hard cock, making Wei Wuxian gasp for breath.\n“Hey,” he whines. “No warning?”\nWarmth presses against him, all along one side. An arm is draped across his waist, and the drape of long hair tickles his cheek and neck. \nRealizing what must now be true, Wei Wuxian’s mind can’t even comprehend the image that would be his to behold if only his eyes weren’t covered.\n“Lan Zhan,” Wei Wuxian whispers, “Are you naked, beside me?”\nThe arm around his waist tightens, but Lan Wangji does not answer.\n“Are you embarrassed?” Wei Wuxian whispers. “You don’t have to be. I’ve seen you naked before, after all, and there is nothing for you to be—”\nWei Wuxian cuts himself off, suddenly embarrassed himself. His own body is littered with scars, strikes from a whip and from an operation, branded by the Wen’s seal. He’s never quite regained the weight he lost in the Burial Mounds. When he’d emerged, he was thin and gaunt, his eyes haunted and shadowed. He hasn’t eaten properly in months, spending his time meditating and trying to keep a hold on the resentful energy that is now his only weapon. \nWhat does Lan Wangji see, when he gazes at Wei Wuxian’s body? Is it enticing, or pitiful?\nWei Wuxian turns as much as he can, pressing his face into Lan Wangji’s neck and breathing in the clear scent of sandalwood. He shakes his head, trying to rid it of useless thoughts. \n“Lan Zhan should get something out of this, too,” he says, pressing as close as he can. His movements are mostly restricted, but when he shifts his legs his thigh presses against Lan Wangji, hard and wanting.\n“Wei Ying,” Lan Wangji says, half censure and half curse.\nWei Wuxian can’t help but smile. “That will make things easier, won’t it? When I first suggested this, I imagined a maiden would have to use tools to complete the ritual. The old scrolls I found, they were mostly about women cultivators who’d gone down the wrong path. I wonder if that was true, or if it was just a way to force those women to marry into gentry clans. What do you think, Lan Zhan?”\nThe ancient rite had described cleansing the body of resentful energy by way of a type of dual cultivation. By joining with a righteous cultivator, and having their spiritual energy enter you along with joining with them physically, one could be cleansed of resentful energy.\nWei Wuxian doesn’t actually expect that to work. He doubts that any of those rogue cultivators had lost their golden cores, their very ability to call on spiritual power. He doesn’t want to give up this new path he’s walking. But he wants to be a part of his family’s lives, and it would be wonderful to not be so damn lonely, all of the time.\nThe idea of joining with Lan Wangji so intimately is enticing in a way that has nothing to do with the ritual. Has he always been drawn in by Lan Wangji this way, since the beginning? It feels like it. Even knowing he annoyed Lan Wangji, or imagining that Lan Wangji hated him, Wei Wuxian still wanted to be closer. \n“I really am selfish,” he mumbles, pressing into the comforting heat and surety of Lan Wangji’s body. \nGentle hands run down his sides, coming to rest against his hips. “Wei Ying is… strong. Selfless.”\nWei Wuxian chokes on a laugh, shaking his head. He tries to help everyone he can, but where has that gotten him? Has his playing the hero actually helped anyone? Or has it just continually put targets on those he loves most?\n“How will the cultivation world ever forgive you for this,” Wei Wuxian wonders.\nWei Wuxian feels Lan Wangji’s sigh in the breath against his face. Then, hands are clenched over his own where they’re held above his head. Lips are pressing against his, insistent and sure.\nWei Wuxian sighs into the kiss, opens his lips and lets Lan Wangji brush his tongue across his teeth, over the roof of his mouth. He can feel the weight of Lan Wangji’s body pressing down on him, his hardness apparent, his skin flushed, his breathing shallow. \nHe doesn’t know whether he’d prefer to have all of Lan Wangji’s strength and conviction unleashed on him, or whether he’d want Lan Wangji trussed up like he himself is now, laid out at Wei Wuxian’s mercy. Both thoughts send jolts of electricity through him, have him tilting his head upwards and moaning into Lan Wangji’s kisses.\nIt’s just as intense, as incredible, as that first kiss was on Phoenix Mountain. Or perhaps it’s better, because now he knows who it is who’s holding him so tightly, who’s panting against his mouth and pressing closer to him until their legs are tangled. \nLan Wangji was his first everything, wasn’t he? His first kiss, unknown, but also the first person to catch his eye and never let him go. The only person who’d dare challenge him openly since he became the Yiling Patriarch, but in a way that speaks of concern rather than condemnation and fear. \n“Wei Ying,” Lan Wangji says, and no matter how many times Wei Wuxian hears it the sound of his name on Lan Wangji’s tongue will always be something special, something sacred. “You’re ready?”\nLan Wangji had taken his time preparing him, and Wei Wuxian is loose and open and wanting. He nods against the crook of Lan Wangji’s neck, then mumbles, “Yes, Lan Zhan. I’m ready.”\nLan Wangji releases his hands to guide himself inside of Wei Wuxian. Despite everything, Wei Wuxian holds his breath in anticipation, the muscles of his legs tightening just before the intrusion breaches him. \n“Breathe, Wei Ying,” Lan Wangji murmurs gentle, running a hand down the curve of his spine. \nThe pressure, the presence, of Lan Wangji inside of him is overwhelming. He can’t think, can’t focus, can only feel Lan Wangji’s hardness filling up the space inside of him, impossible to ignore. Wei Wuxian breathes raggedly through his teeth, his bound hands scrambling to grasp at nothing.\n“Ah— ah— ah—” \nLan Wangji continues to stroke up and down his back, to kiss him, to bite down lightly on his tongue. Somehow that helps, the moment’s spark of pain centering his thoughts and allowing him to relax enough to adjust around Lan Wangji’s considerable length.\nNothing is within his control. He can’t see, can barely move, can do nothing but feel.\nBut strong arms hold him tight, and he knows with surety that they will see him through this. He’s safe, no matter what.\n“Lan Zhan, Lan Zhan, Lan Zhan,” he babbles, fingers curling. He wishes he could hold onto Lan Wangji in return.\n“Alright,” Lan Wangji asks, voice close against his ear.\nWei Wuxian nods. “Keep— keep going.”\nLan Wangji nods, and Wei Wuxian can feel the brush of hair against his cheeks. \nThe first thrust inside of him is impossible to explain. His sensation spirals out in all directions as his mind tries to understand the feel of something— someone— moving inside of him. All he can do is let his head fall back and breathe through it. \nLan Wangji begins moving in earnest, and it’s strange but not entirely unpleasant once Wei Wuxian grows accustomed to it. Like sitting in a boat on Yunmeng’s lakes and letting the currents push him to and fro, he wills himself to move in time with Lan Wangji’s motions. Lan Wangji presses his hands against Wei Wuxian’s hips, and Wei Wuxian feels them press into him like a brand. He wonders if Lan Wangji is strong enough to bruise him unintentionally. He hopes that he is.\nThe rhythm is almost musical, but every time it begins to steady Lan Wangji lets out a ragged breath and pushes in deeper, harder. “Wei Ying,” he murmurs, “I cannot hold back.”\nWei Wuxian thinks he might shatter entirely if Lan Wangji stops, so he just nods. “Don’t, don’t,” he encourages. “Keep moving, Lan Zhan.”\nLan Wangji breathes out a sigh of relief, and then he’s moving so powerfully that Wei Wuxian is half raised off the dais. From this angle, he can wrap his legs around Lan Wangji’s waist, and that allows him to hold onto him somehow as Lan Wangji pounds into him. \n“How does it feel, for you,” Wei Wuxian babbles. “You’re so big, Lan Zhan, I never imagined— it feels strange, but good—”\nLan Wangji’s movements are no longer so controlled, one large thrust followed by a series of shallow ones, keeping Wei Wuxian from predicting anything. He clenches around Lan Wangji, and then Lan Wangji lifts his hips up and—\n“Oh,” Wei Wuxian cries out, stunned. “Oh, oh. Whatever that was— again. Lan Zhan, again.”\nLan Wangji barely needs the encouragement. He proceeds to press into that spot with all the force he can muster, until Wei Wuxian is practically sobbing out his name. \nWei Wuxian is climbing higher and higher, his arousal pulling him up to the sky, the clouds. He floats in that space, cool air around him and Lan Wangji hot inside of him, and he knows that the instant he comes back to himself he will plummet downwards again. \nHow many times has he fallen, in his life? Will this be any different?\nYes, a small voice inside of him insists. It will be different, because there’s someone holding on to him. There will be someone to catch him when he falls. \nHe laughs out breathily, tears in the corners of his eyes, dripping down past the blindfold. Lan Zhan will catch him, won’t he? It doesn’t matter that he can’t think, that all he can do is feel lightning rushing through his veins and his body heating up like it’s being warmed over burning coals. It doesn’t matter, it doesn’t matter, because even if he shatters Lan Wangji will diligently collect all of his pieces. \n“Lan Zhan,” Wei Ying cries out. “I love you, Lan Zhan. Thank you.”\nHe’s surrounded by an incredible, clear warmth. He wonders if that’s Lan Wangji’s spiritual energy, suffusing him from the inside out. Then he can’t think at all, because Lan Wangji is letting out a ragged moan that goes straight to his cock. Wei Wuxian sucks in a breath and clenches down, and then Lan Wangji is coming inside of him. Spiritual energy pours into him, along with the warm wetness of Lan Wangji’s release.\nIt isn’t fair, not at all. He didn’t even get to see Lan Wangji’s face when he came! \nImagining it is something, though. And Lan Wangji is still moving inside of him, and Wei Wuxian is rocking into the motion, and Lan Wangji is reaching up to clasp Wei Wuxian’s hands. \n“Oh, oh,” Wei Wuxian moans out, hips rising to rub up against Lan Wangji, giving him just the extra bit of friction he needs. He presses up against Lan Wangji as he comes, his head spinning and Lan Wangji clasping his hands so tightly it’s as though he’ll never let go.\n“Don’t let me go,” Wei Wuxian says, his voice gurgling like ripples through water. He lets his head fall back, and sensation claims him entirely.\n—\nHe comes back to himself slowly, the whiteness of the room overwhelming him. It’s only when he realizes that he can see again that he jolts up to a seated position and immediately regrets it. But it’s fine, it’s fine, he needs to see—\n“Wei Ying.” Lan Zhan stands to one side of the dais, his inner white robe bound carelessly at his waist, a soft white cloth in his hands. “Don’t move,” he says, brows furrowing with disapproval.\nWei Wuxian nods dumbly and lowers himself back down. It’s fine, because he can still see Lan Wangji from this angle. He’s beautiful, his pale skin still flushed with color, his hair disheveled and his forehead ribbon missing. \nLan Wangji rubs the cloth over Wei Wuxian’s stomach, between his thighs. It’s a little humiliating, to be so thoroughly taken care of, but it also feels good, and safe. Nevertheless, he squirms when Lan Wangji cleans between his legs, and then inside of his hole.\n“Lan Zhan, you don’t need to—”\nLan Wangji silences him with a look. He lifts his chin and says, “My duty.”\nThe satisfied smile that’s been playing on Wei Wuxian’s lips immediately falls away. Ah, of course. All of this was about duty, wasn’t it? And whatever Wei Wuxian had imagined in the throes of it, whatever he had said—\nOh. Oh no. He’d said such a thing, to Lan Wangji, and now Lan Wangji is likely mortifyingly embarrassed on his behalf. \nOf course, he tries to laugh it off. “So diligent,” he comments, ruefully. His eyes feel hot.\nLan Wangji reaches up, unties Wei Wuxian’s wrists and massages the skin there gently. “You pulled too hard,” he comments. \n“Sorry,” Wei Wuxian says, in a small voice. That doesn’t quite make sense, because Lan Wangji is likely only worried for him. “Sorry, Lan Zhan. You’ve done so much for me, and now I’ve put you in this position—”\nLan Wangji looks down on him, his eyebrows delicately arched. “Position?”\nWei Wuxian laughs, and it turns into a sob. He really is completely undone by orgasm, isn’t he? It’s a good thing he never intends to have sex again, if it isn’t with Lan Wangji. And since there are no more rituals to complete, that just means he’ll never—\nStrong hands land on his shoulders, shaking him. “Wei Ying.”\nWei Wuxian forces a smile, looks up. “Lan Zhan.”\nLan Wangji lets out a little sigh of frustration, like he can’t stand what he’s read on Wei Wuxian’s face. “Only one,” he says.\n“What?” Wei Wuxian questions.\n“Disciples of Gusu Lan,” Lan Wangji explains, “Only have one partner. For life.”\nWei Wuxian swallows, unsure of whether he’s about to laugh or cry. “And?”\n“A rule I choose to follow,” Lan Wangji continues. “Wei Ying, I chose you.”\n“Oh,” Wei Wuxian says, though his mind won’t quite believe it. Lan Wangji wants him, as his only partner, for life? How could he? \nLan Wangji shakes his head. “On Phoenix Mountain. I kissed you.”\n“Because you wanted to bed me?” Wei Wuxian asks dumbly.\nLan Wangji shakes his head, leans down and presses a firm kiss to Wei Wuxian’s brow. “Because I love you, Wei Ying.”\nHe bursts into laughter, but it’s happy and not at all mocking. “You do?”\nLan Wangji cups Wei Wuxian’s face in his hands. “I told you, I chose you.”\n“Lan Zhan really is beautiful,” Wei Wuxian babbles, pressing forward to lean against Lan Wangji’s chest, only a single layer of clothing between them. “I love you.”\nThere are so many things he has to tell Lan Wangji, things that he might have already guessed. The ritual had been one of spiritual power, and surely Lan Wangji had recognized that Wei Wuxian couldn’t take any into his body, has no golden core to hold onto it. \nBut Lan Wangji is sure, and steady. If Wei Wuxian explains, if he lets himself fall into Lan Wangji’s arms, won’t he catch him? Won’t he be there for Wei Wuxian to rely upon?\n“Thank you,” Wei Wuxian says again, face pressed against Lan Wangji’s neck. “I had to do this, to keep them safe, but— but I can’t imagine it being anyone but you, Lan Zhan.”\n“I could not let anyone else…” Lan Wangji trails off, cheeks red. He rests a hand against the crown of Wei Wuxian’s head. “Then I will keep you safe, Wei Ying.”\nIt’s a promise Wei Wuxian can believe. He presses into Lan Wangji’s hold, wraps his arms around the surest thing in his life. If Lan Wangji is beside him, he can take on the entire cultivation world again. Or, even more fraught, he can try and fit himself back into the world he wants to be a part of. \n“Next time,” Wei Wuxian murmurs, “I want to see your face when you come.”\nLan Wangji’s grip on him tightens, and Wei Wuxian can feel his smile when says, “Shameless.”"
}