{
    "id": "20396401",
    "url": "https://archiveofourown.org/works/20396401?view_full_work=true",
    "author": [
        "Blue_Glass"
    ],
    "title": "The Home Invasion",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "Spider-Man - All Media Types",
        "Spider-Man (Tom Holland Movies)",
        "Marvel Cinematic Universe",
        "The Avengers (Marvel Movies)",
        "The Avengers (Marvel) - All Media Types",
        "Spider-Man: Homecoming (2017)"
    ],
    "relationships": [
        "Harley Keener/Peter Parker",
        "Harley Keener & Peter Parker & Morgan Stark (Marvel Cinematic Universe)",
        "Harley Keener & Peter Parker & Tony Stark",
        "Peter Parker & Tony Stark",
        "Peter Parker & Avengers Team",
        "Michelle Jones & Ned Leeds & Peter Parker",
        "Ned Leeds & Peter Parker",
        "Pepper Potts/Tony Stark"
    ],
    "characters": [
        "Peter Parker",
        "Tony Stark",
        "Pepper Potts",
        "Harley Keener",
        "Ned Leeds",
        "Michelle Jones",
        "Happy Hogan",
        "Steve Rogers",
        "Natasha Romanov (Marvel)",
        "Thor (Marvel)",
        "Bruce Banner",
        "James \"Bucky\" Barnes",
        "Morgan Stark (Marvel Cinematic Universe)",
        "Clint Barton",
        "Mr. Harrington",
        "Flash Thompson",
        "the AcaDec Team"
    ],
    "additional_tags": [
        "Field Trip",
        "Peter Parker's Field Trip to Stark Industries",
        "Or not",
        "Peter Parker is Tony Stark's Biological Child",
        "Peter Stark - Freeform",
        "Iron-Dad",
        "Spider-son",
        "Everyone Loves Peter Parker",
        "Precious Peter Parker",
        "BAMF Peter Parker",
        "but really",
        "Peter Parker is a Mess",
        "and",
        "Peter Parker is a Little Shit",
        "Harley Keener is a little shit",
        "Protective Harley Keener",
        "The Avengers are a Mess",
        "Team as Family",
        "Post-Avengers: Endgame (Movie)",
        "Canon Divergence - Avengers: Endgame (Movie)",
        "some amount of creative liberty",
        "Everyone Is Alive",
        "Stark Tower",
        "Peter Parker Is Petty",
        "Flash is a dick",
        "and everyone knows it",
        "Might add more tags later"
    ],
    "language": "English",
    "series": "",
    "published": "2019-08-26",
    "completed": "2020-05-26",
    "words": "13,203",
    "chapters": "10/10",
    "comments": "361",
    "kudos": "10,349",
    "bookmarks": "1,397",
    "hits": "175,293",
    "summary": "<p>Peter Stark, more commonly known as Peter Parker, just missed out on the secret Academic Decathlon field trip because he had miscounted his days absent from school. Well at least he gets to stay home for the day right? What happens next is purely coincidence, but really Peter should have expected this to happen.</p>\n<p>Home is where your, extremely large extended family lives. Also dinner.</p>\n<p>And so it begins.</p>\n<p>Welcome to the shooting range.</p>",
    "notes": "<p>So after consuming way to much of this trope, I figured what the hell. This is another addition to the Peter Parker's disastrous field trip trope.</p>\n<p>So I managed to get this out quicker than I thought. Hope y'all like it. I love avengers fluff so here is just a bit more domestic fluff.<br>Thanks to SamThySoul for the beta, because even though English is my first language, I still suck at it.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Keep them comments coming and I'll try to keep them chapters coming.</p>\n<p>Thanks again to SamThySoul because I am a human wreck. <br>This one has a little less dialogue but I hope y'all still enjoy.<br>(*^ 0 ^*)</p>\n<p>Here we go again. Hope this lives up to the cliffhanger I left it on.<br>Featuring Natasha and her scheme to embarrass Peter.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>Thanks for all of your lovely comments! Please keep sending them my way.</p>\n<p>Hey guys!<br>Its been awhile I know. Uni has had me absolutely smashed but here we are.<br>Hope y'all have as much fun reading this chapter as I had writing it!</p>\n<p>Regular chapters? Who would have thought.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>Thanks for all of the lovely comments on the last chapter. Please keep sending them my way!</p>\n<p>Hello lovelies! Here is another humble chapter!<br>Hope you all enjoy.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">more notes</a>.)\n</p>\n<p>Lets be real. Uni is reaching the pointy end at the moment and I've got several essays and exams to attend to. I love this story and will definitely be continuing it to the end but it might take a minute so that I can pass all my subjects. If you don't hear from me for a while, I haven't died I'm just studying my little ass off.<br>I love all the comments that I've gotten so far and I hope you keep sending them my way.</p>\n<p>Hey guys! I'm back!<br>I had an idea at the start of this chapter then the writing took on a life of it's own.<br>Hope y'all enjoy!</p>\n<p>*Warning for slight description of a panic attack*</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">more notes</a>.)\n</p>\n<p>Love the comments and kudos &lt;3<br>Please keep sending them my way!</p>\n<p>Soooooooo..... It's been awhile.<br>Sorry about the lack of regular update the holiday season has been real heavy.<br>Here's another chapter to hopefully make up for my tardiness.</p>\n<p>WOW! I'm still alive!</p>\n<p>Here for all the very patient people is the final chapter in this field trip fic!</p>\n<p>I do hope you all enjoy as much as I enjoyed writing this over my thesis.</p>",
    "text": "Peter could swear some days that he was the living embodiment of bad luck. He had thought that he had kept track of his absences but apparently not so, as Mr. Harrington had just informed him.\n10 MINS EARLIER\n\"Now that practice is over for the day, it's time for a bit of good news,\" Mr. Harrington announced. Heads swivelled as the teens scattered around the room tuned into their teachers vice. \n\"Due to the teams spectacular performance at nationals-\" the teacher was cut off as cheers went up around the room.\n\"AS I was saying, \"Mr. Harrington stressed when the cheers died down, \"due to the teams performance at nationals, we as representatives of Midtown, have been invited on an exclusive tour with one of the world largest companies. Now, in the spirit of a bit of fun, the school has decided to keep you on your toes and keep the destination a secret. I can however let you know that it will be undertaken in two weeks to today.\"\nThe news that they wouldn't be told where they were going was met with exasperated sighs and shaking heads. Students curing the faculty for what now seemed the billionth time, nothing was ever straightforward. \n\"Now, now. I know your all going to love it when we get there, and if I'm being honest with you, even I am excited for this trip. It truly isn't something you get the chance to do every day,\" Harrington placated. \"Alright, grab a form on your way out, and I expect it back to me at practice next week. Mr. Parker, hang back please, I need to speak with you for a second.\"\nStudents around the room packed up and headed for the door, Mr, Harrington ensuring that each collected their form. Peter bit his lip, nerves on end as he stuffed his textbooks into his bag. This couldn't be good. Every time Harrington glanced at him, it was with this pinched look. The teen said a reluctant goodbye to Ned, as his friend shuffled out the door and into the corridor. After the room had cleared, Peter sidled up to where his teacher now sat at the front of the room.\n\"You wanted to speak with me sir?\" Peter asked, attempting to avoid direct eye contact. \nNow it was Mr. Harrington's turn to sigh, \"You know Peter, you're one of the best kids I have. Honestly in my opinion you should already be at college rather than stuck around here. But just because you probably already know the content doesn't give you an excuse to skip school.\" \nShit, Peter thought, he thought that he had kept track of his missed days. Was he going to be kicked off the team? \nHarrington continued, oblivious to Peter's internal panic, \"I know what the team means to you, it's a place that you can actually extend yourself. It's the reason why I keep you on the team, but you can expect that there wouldn't be any consequences. I'm sorry Peter, but the school has decided that as punishment you won't be attending the field trip with the rest of the team. On the day of the field trip you won't be required to attend school as the faculty has decided to use one departmentally mandated teacher planning days. I really an sorry Pete.\"\nPeter felt as if he had been slapped in the face, although the little voice in the back of his head whispered that it could have been much worse. He managed a jerky nod and turned away from the teachers desk.\nAnd so this is how Peter finds himself wandering down the now empty school halls cursing his bad luck and his apparent lack of attendance. One blessing though that he wasn't required to school his face at school the day of the field trip. Peter can just imagine that Flash would have given him before the team would have left for their mystery tour. Looking up from his feet, the teen caught sight of Ned and MJ hovering at the schools entrance, obviously waiting for him.\n\"What's with the long face nerd?\" MJ questioned, taking in the utterly dejected look that had overtaken Peter's face. Ned looked up from his phone and nodded as if seconding MJ's question.\nPeter sighed, \"I can't go on the field trip, missed to many days of school apparently.\"\nNed grimaced, \"That's shit man, I thought you were keeping an eye on that?\"\n\" So did I Ned,\" Peter replied, \"so did I, apparently not well enough though.\" The three moved from the entrance, heading down the stairs and onto the street.\n\"Well Parker, if there's one thing to be glad of at least, it's one less day of listening to Flash's crap,\n\"MJ quipped in an obvious attempt to make him feel better. \"It's probably going to be shit anyway, capitalism and all that.\"\n\"MJ's right Peter, in fact I'm almost jealous,\" was Ned's follow on, giving the other teen a supportive pat on the back, \"I'll see you tomorrow man.\"\n\"Yeah, see you tomorrow,\" he said throwing a small wave after his best friend as Ned made his way to where his parents car was waiting.\n\"Later Loser,\" MJ called as she turned and made her way down the street to the bus stand.\n\"By MJ.\"\nPeter turned in the opposite direction, down the street, wandering around the corner to where a black Audi was waiting idle. The teen breathed a sigh of relief as he slipped into the Audi's back seat, dropping his bag next to his feet. Peter looked up to see Happy giving him a look in the rear-view mirror.\n\"Long day Kid?\"\nPeter sighed again, \"You could say that. Apparently I've got to many absences to go on the AcaDec field trip, the upside though is that I get to spend the day at home rather than at school.\"\nHappy smiled at that, \"Your dad will be happy to have you for the day at the very least. Maybe you can keep Tony out of trouble for the, I be grateful, your mum would be to.\"\nPeter snorted. Everybody knew that Peter had his dad wrapped around his pinkie finger, not even Pepper herself could rival Peter in Tony-herding.\n\"When's the trip supposed t be anyway Kid?\"\n\"Two weeks from today.\" That made Happy smile even brighter.\n\"Sounds like it won't just be Tony you'll be keeping out of trouble then, that's the week that Keener is supposed to be up.\"\nThat made Peter smile. In the despair of missing out on the field trip, it had totally blanked the teens mind that his boyfriend would be in New York. Peter and Happy spent the rest of the ride to Stark Tower in silence, with Happy's focus on the road and Peter's day dreaming about Harley. Peter was glad that his dad had re-bought the tower after the threat of Thanos had been dealt with. It was much closer to his school than the now destroyed compound upstate. Also the fact that he and Harley shared a room was another perk of the tower. It had been two years since the return after the Blip, two years since the two of them had met. They had been going strong, even over the occasional long distance, ever since. Before Peter realised, Happy was pulling into the drop bay in front of Stark Tower.\n\"Thanks Happy! I'll see you tomorrow,\" Peter said, collecting his bag and exiting onto the sidewalk.\n\"I'll see you tomorrow Kid.\" \nHappy pulled away from the curb to go to whatever job was next on the list. Peter looked up at the glistening windows of Stark Tower, taking a moment to appreciate the beautiful piece of architecture. He took pride in it, has was after all, a Stark.\nAs the elevator doors opened, Peter found his arms full and a mop of brown hair pressed into his midsection.\n\"Petey!\" Morgan exclaimed.\nPeter ruffled his little sister's hair, \"Hey Morgan, how are you doing? This is awfully friendly for a Thursday afternoon.\"\nMorgan tilted her face back to pout at Peter, arms still wrapped around him. The teen took the look to mean: 'What? Can't I be happy to see my brother?'. His expression dissolved into a smile. Peter picked Morgan up and sat her on his hip. She dissolved into giggles as Peter did so and the two made their way into the living area, both with grins stretched across their faces. On the TV was the latest episode of animated Transformers and there was the sounds of Steve pottering about in the kitchen. The kitchen, living and dining room were deliberately open plan so that the adults could monitor the kids from anywhere in the space. \nPeter spied Clint asleep on the couch with Nate tucked under arm, also asleep. Lila and Cooper were riveted to the TV, not paying Peter and Morgan any mind. \n\"Hey Steve!\" Peter called as he dumped Morgan on the couch next to the other kids. After doing so he moved back to the entrance way to dump is shoes in the literal shoe mountain that had already been left there.\nSteve turned from where he was monitoring a large pot sat on the stove top, \"Hey Pete, how was school today?\"\nThe teen meandered over to the kitchen bench, plopping into the one of the stools that had already been pulled out from the bench. \"You know what? Not too bad. The only vaguely shitty thing that happened today was that I got news that I can't go on some secret ass field trip for AcaDec. Happy remined me that it's the week that Harls is up though, so no skin off there. Everything was as per usual, classes are still boring and lunch is still the best part of the day.\"\nSteve offered him a little smile, \"That's good at least Peter.\"\nThe elder moved to the fridge, pulling out one of the many pre-made meals and sticking it in the microwave. \"Although I have to ask, why can't you go on the field trip? What's the reason?\"\nCurse Steve and his responsible adult response, Peter thought, \"Apparently to many days missed, and before you get to it, don't give me that - 'Peter, what have I told you' - look. I'll probably get enough of that later from Mum.\"\nAt that Steve gave a little huff and shook his head good naturedly. He returned to the microwave to grab the food as the bell went off. The elder slid it across the bench to Peter along with a fork. The teen then promptly inhaled the offered food, super metabolisms could really be a pain.\n\"I'll tell Mum and Dad at dinner. Do you know where the others are at the moment, there's usually more people hanging around at this time of the afternoon?\" \n\"Bucky and Tasha were here a second ago, they said something about a match so I expect they're on one of the training floors. Your dad is probably where he usually is if Pepper hasn't dragged him off to some meeting. I honestly don't know where Bruce is, you'd have to ask FRIDAY, and you know were here when Thor left for New Asgard this morning. Anyone else, the same as Bruce, no idea.\"Peter could have just asked FRIDAY on the way up but this was part of the ritual afternoon banter with Steve, they had settled on this routine a while ago and it had stuck. Peter jumps up, depositing his dishes in the sink and giving the elder a quick thanks. He ruffled Morgan's hair on his way past and headed down the private stairs a few floors until he reached his personal lab. He grimaced as he walked in, the lab was a mess.\n\"Well then, I'd better clean this up, don't want to start another fire.\"\nPeter had a habit, read a bad habit, of letting the mess pile up in his lab until there wasn't a clear table top left in sight not to mention the various things that littered the floor. Whether it was chemicals, tools, papers or other bits and pieces from projects, they just seemed to accumulate. Leaving his bag, which he had honestly forgotten was still on his back, at the door, Peter set about cleaning the mess back into its rightful place. What felt like only an hour later FRIDAY's voice interrupted his cleaning haze.\n\"Peter, Steve would like to let you know that dinner is ready and to grab Boss on your way up.\"The teen looked out the window to see the last light of the setting sun and the lights of New York illuminating the evening. \"Sure FRI,\" Peter replied, \"I'll be done in a second.\" He replaced the chemicals in his hands to their allocated places in the bright yellow chemical cupboard and shuffled out of the lab. Peter made his way up the stair to the next floor where his dad's lab was located. \nMusic hit his enhanced sense like a tidal wave when FRIDAY opened the door for him. Tony was sitting at a bench hunched over a magnifier, absorbed in fiddling with some fine piece of wiring. A certainly bad, but definitely entertaining idea crept into Peter's mind. The teen walked up the wall, and then onto the ceiling. He then scuttled, as quietly as possible, across the roof until he was just above his dad. Reaching down, Peter ran his fingers through Tony's hair. \nTony reacted like he'd been shot with a taser, giving a shriek and a jolt before whipping around, only to find empty air behind him. \nPeter couldn't help but let out a bark of laughter at his father's reaction. Tony's head turned upwards to find his spider child attached to the ceiling and the tension that had jumped into his shoulders melted away.\n\"Jesus kid, you are going to you old man a heart attack,\" Tony sighed.\n\"If your heart was going to give out that easy,\" Peter quipped, \"it would have happened years ago. Plus it would be shame if you missed dinner.\"\nThat made Tony snort, \"Your probably right about that kiddo. But you know FRI could have told me that dinner was ready.\"\nPeter gave Tony a critical look, one eyebrow raised for good measure.\n\"Okay, okay. I'm coming,\" Tony mumbled, \"you're getting more and more like Pepper every day.\"\nTony switched off the light attached to the magnifier as Peter detached from the ceiling. The father-son duo made their way to the common room where there was a buzz of activity as people took their seats around the table and food was set out. Morgan, who was sat next to Pepper, looked at Peter expectantly, patting the other seat next to her. Peter sat down next to Morgan and Tony sat on the other side of Peter, sandwiching the two kids between their parents. The last dish was sat on the table and suddenly it was a free-for-all as people filled their plates. Down the table Peter could hear the Barton's discussing the events that had occurred during Lila and Copper's day. Across from the Starks, Natasha, Steve, Bucky and Sam were already engaged in a deep conversation discussing the difference between surviving and actually living, what brought this up Peter really didn't want to know. The voices then blended into some kind of mish-mash soundscape, it was honestly a little overwhelming. A hand on Peter's back anchored him and the teen looked up to see Tony giving him a concerned look.\n\"You alright Pete? Pep asked you a question.\"\nPeter gave his dad a little nod to the first question, now a little more grounded, he turned to look at his mum as signal to re-ask the question.\n\"How was your day Peter? Anything special?\" Pepper asked.\nPeter answered like any typical teenager would in having to give the daily report, short and sweet, \"Yeah, okay. I'm missing out on the AcaDec field trip though.\"\nAs Peter served himself a plate of pasta Tony followed up on Peters statement, genuine concern in his voice, \"Why would you miss out on the field trip kiddo? You love field trips.\"\n\"To many missed days.\"\nUnderstanding crossed the faces of both Pepper and Tony. Peter's senses were hard at times to live with, meaning that the teen would occasionally have major cases of sensory overload even though there were preventative measures in place. On the occasions that it happened the two had decided it would be best for Peter to stay home from school to prevent further stimulation, giving the boy a chance to recover.\n\"That's pretty shit but I suppose we should have seen it coming,\" was the response from Tony. That earned him a glare from Steve across the table, but his dad just shrugged it off.\n\"Do you have to go to school that day Petey?\" Morgan asked, mouth full of food and eyes hopeful.Peter smiled and finished the bite in his own mouth before saying, \"Nope, so you're going to be stuck with me aaaall day.\"\nMorgan let out a little whoop, wrapping Peter in a quick hug before returning to her food. With that news out of the way, the conversation flowed freely for the rest of dinner. Soon the meal was over and Natasha, Clint and Bruce began collecting dishes as it was their round on cleaning up duty, meaning that Peter was free to go on patrol a little early. As the teen moved towards his room to change into his suit Pepper yelled after him.\n\"Remember to be back by twelve, it’s a school night!\"\n\"Yes mum!\" he called back over his shoulder.\nAfter getting changed, the teen opened his window, crawled onto the side of the building and closed it behind him. For a second Peter enjoyed the view of New York, still bustling even though the sun had set. Then he swung off to do his part in protecting the city that never slept.\nThe next few weeks passed in relative peace for Peter. The day after the field trip announcement Flash had overheard the trio of Peter, Ned and MJ discussing that Peter was in fact not going. So the majority of Flash’s insults from that moment on revolved around this fact. Nobody, including Peter, payed any attention to Flash’s accusations though. Honestly people were more interested in Flash’s apparent obsession with Peter and anything the other boy was or wasn’t doing. Unfortunately for Peter, his super hearing meant that he heard people, who though that they were out of hearing range, discussing whether Flash just wanted to fuck Peter or not.\nApart from the regulars of school he had stopped a slew of robberies while on patrol. He had talked down a jumper, a teenage girl (and to be honest that experience had rattled him more than the teen would like to admit). Peter had then taken the girl to a late night diner, where over coffee, he had walked through her problems with her. Layla, as he learned her name was, had ended up in tears, but had a smile on her face by the time the two left the diner. Peter then walked her home and left her his phone number – in case she ever needed to talk again. When he told his family of this encounter, he had been wrapped in hugs and they whispered soft ‘well done’s that only he could hear. He had also saved an old ladies cat who had tried to climb the side of an apartment building and as a consequence gotten stuck. \nThe weekend before the field trip that was not to be, Harley arrived in all his swanky southern glory. Peter had driven to the airport to pick up his boyfriend and the two of them picked up right where they had left off. That meant impromptu make out sessions in Peter’s lab, cuddles on the couch during movie night and Peter ending patrols at regular times so as to fall asleep in Harley’s arms. Peter’s appreciation for FRIDAY grew even stronger when she had locked to door to the bedroom so as to prevent his dad walking in on Peter riding Harley on the very first night. The other adults in the tower just rolled their eyes when they found the teens making out in random places. The kids squealed in disgust at the public displays of affection, only for Harley to lecture them on that fact that they wouldn’t feel that way when they found a significant other of their own. This Lila and Morgan denied vehemently but made Cooper blush from the tips of his ears. Harley had also taken to dropping off and pick up Peter from school to have quick catch ups with both Ned and MJ.\nSo on the day that Peter would have otherwise been on the field trip, the teen wakes up late, head resting on Harley’s outstretched arm, a warm and contented feeling thrumming in his chest. Peter checked the clock sitting on the bedside table, 9:30. The teen extracted himself from the bed, Harley groaning a little at the loss of Peter from his arms. Peter knew with his whole being that his boyfriend was not a morning person, but he felt the need to get up and get moving. On his way to the kitchen Peter pulled a worn sweater over his head to ward off the slight chill of the air. When the teen reached the kitchen first order of business was to fix coffee. Nat was sitting at the bench sipping on her own coffee, with the TV in the background had the food network on indicating that the rest of the kids were at school. \nPeter, now with his own coffee, sat down next to Nat giving the former spy a nod. The two sat there listening to the TV for awhile before Nat spoke up.\n“How about a training day? Surely you can spare a little time for your old Aunt Nat rather than holed up with your boy.”\nThat made Peter’s ears turn pink. “I’m sure Harley wouldn’t mind having the lab to himself for the day,” the teen replied after recollecting himself. Nat was smirking at him.\n“You know he is always welcome to join us. I wouldn’t mind giving him some self-defence moves to practice.”\n“After the last time you tried to teach him ‘self-defence’ I’m not sure he’d be keen to take up that offer, Harley complained about sore muscles for the next week.”\nThat made Nat’s smirk broaden into a smile, “The offer still stands.”\nThey sat there finishing their coffee. Peter knew that Nat’s offer to teach Harley came from a place of genuine care and concern. The former spy had quickly become attached to all the kids that visited or lived at the Tower, though if asked she would deny it. Nat, now finished with her coffee, put her mug in the dish washer, moving towards the elevator.\n“The public room. Ten minutes.”\nPeter nodded in acknowledgement, downing the rest of his own coffee. He headed back to his room to change into sweats that were comfortable enough to train in. As he pottered around, Harley groaned from the bed, “Peteeee, what are you doing? It’s to early.”\n“Nothing, I’m going to train with Nat for awhile. You can join if you want,” the smile obvious in his voice. Harley just groaned again and flipped Peter the bird. This only served to force a bark of laughter out of the teen. Now dressed, he leaned over the bed to place a quick kiss on his boyfriend’s messy bedhead and left Harley to his sleep. Peter passed back through the living room on his way to the elevator. Tony was now standing in the kitchen, hovering over the coffee machine, waiting while a new pot was brewing. Peter watched as his dad as he waited for the elevator. The older man was obviously tired, not having noticed Peter wandering through the room. He did wish Tony would sleep more often, but Peter was well aware of how easy it was to get fixated on a project and feel the need to work it until it was done.\nThe elevator arrived and he politely asked FRIDAY to take him to the public training room, floor 73. The elevator arrives and when Peter steps out Nat is already stretching on the sparing mats. The public training room was Peter’s favourite. It took up the space of three floors with a ridiculously high ceiling. One of the walls was taken up by an advanced rock-climbing wall. The ceiling itself was covered in an obstacle course Peter had helped Tony design, and was made to help him train as Spider-Man. (The fact that it was designed for someone with sticky hands didn’t stop others using it, but that was mainly Clint. Peter had had to install web shooters into FRIDAYs systems to catch the archer when he inevitably fell off). The two walls that flanked the rock wall were floor to ceiling, re-enforced windows. The far wall held the elevators and the viewing box where tours or UN officials could watch the team train. The floor held a boxing ring, sparing mats, various exercise machines and gymnasium equipment including a beam, double bar and trampoline. \nPeter takes to the mats and begins his stretching routine. When both Nat and Peter finished stretching five minutes later, they moved to face each other. The two began to move through a routine that they had choreographed earlier that month. \nA punch to the shoulder.\nBlock.\nThree quick punches to the abdomen.\nDuck.\nLeg sweep.\nRoll backwards.\nTwo steps to the right.\nBlock.\nElbow to the face.\nBack kick.\nThey continued until the routine came to an end. Now sufficiently warmed up they began to free spar, pulling punches because although Peter would be fine, his strength could seriously injure Nat if they weren’t careful. The two traded blows at lightening speed, sweat beading on both of their brows. Faintly Peter registered the ding of the main elevators, a tour group must have arrived to watch. \nWhen he managed to pin Nat, he waited for her to tap out before moving off. He looked up to view the tour group that had arrived earlier during their sparring match.\nPeter’s jaw dropped as he took in the sight of his AcaDec team and Mr. Harrington standing on the other side of the glass viewing box, looking just as shocked as he felt.\nPeter feels as if he could melt into the sparring mats he's standing on, never to be seen again, that would be absolutely fantastic. He can see Ned waving at him frantically through the glass and MJ next to Ned, with a knowing smirk on her face. They were the only two who weren't gapping, even the tour guide was wide eyed. The teen suddenly felt a wave of anxiousness roll over him. They were ALL staring at him.\nHe feels Nat's slender hand settle on his shoulder, \"Do you know these twerps Peter? Because they seem to know you.\"\nPeter drew in a shaky breath, \"Unfortunately. Seems as though that secret field trip destination was to here. Jesus.\"\n\"Well at least you're not missing out on anything actually interesting.\"\n\"Sure,\" he quipped, \"but now my AcaDec team is literally touring my home, it’s a home invasion, and to make things even more unexplainable, they just watched major nerd Peter Parker pin the Black Widow in a fight. You might as well just kill me now Nat.\"\n\"I don't think so Peter,\" Nat replied, voice smug. Her tone lead him to diver his attention from his shocked classmates to the scheming look on the spy's face. \n\"Nat. Whatever plan you're forming in that devious brain of yours, please, please don't,\" Peter practically begged, knowing the consequences that face had brought about in the past, but it was too late. Nat's hand had left his shoulder and she was making her way across the floor to the viewing box. This movement spurred both Peter and the tour guide into action. Peter darting after the former spy in some attempt to stop her while the tour guide, speaking in unheard words, tried to somewhat control the tour group who had broken from their shock into mild chaos. Nat reached the door to the box, opening it, stepping inside and instantly undermining the poor tour guide's authority by commanding the room into silence.\n\"Well good morning everyone, we weren't expecting an audience but I hope that you enjoyed watching our sparring session. Miss tour guide, I don't believe we've met before, what's your name?\" Damn Nat was smooth, instantly into a personable person that was perfect for a profession none other than a tour guide.\n\"Ah- S-Sarah, ma'am,\" the tour guide stuttered, cheeks blushing so bright they matched her red hair. Peter face palmed from where he was standing in the doorway. Nat was out to embarrass him by commandeering his AcaDec teams tour. The eyes of the other teens in the room were shifting between him and Nat unsure who to focus on. \n\"Well Sarah, it's a pleasure to meet you, I was wondering if Peter and I would be able to hijack your tour for a while. You see this is actually Peter's Academic Decathlon team, isn't it Peter?\" Nat turned to him, expectant look in her face.\nAll Peter could do was nod along with Nat's statement, inwardly cursing the spy. She's evil incarnate, the last thing Peter wanted to do was join the field trip that he hadn't been allowed on in the first place. Looking at his classmates, Ned looked absolutely ecstatic, he knew that Peter had an 'internship' at Stark Tower as Peter had brought him to the Tower a couple of times and he of course knew about Spider-Man. MJ was wholly focused on Nat and Peter knew that she was absolutely beside herself, Nat was MJ's hero. Neither of his friends knew about why he was actually at the Tower though. They didn't know who he really is. Everyone else, including Mr. Harrington, looked baffled and then his gaze fell on Flash who was glaring at him, anger and annoyance clear on the other boys face.\n\"That's okay with me ma'am,\" Sarah managed after a second, \"we were going to visit the Hall of Hero's next, although I'm sure it won't be nearly as interesting now that we've met an Avenger in the flesh.\"\n\"Well we don't want to disappoint the kiddo's, what if I were to show you around the Avenger's floors as well, give the tour that edge?\" The spy followed smoothly.\nSarah appeared gobsmacked but answered in approval. Nat then pushed Peter towards where Ned and MJ were standing, then taking total control of the tour. She began to give a short speech about the training room.\n\"Oh My God Peter,\" Ned whispered, \"you know the Black Widow? Your internship is awesome!\"\nThe teen just sighed, \"Yeah Ned. Awesome.\"\n\"And you get to spar with the Black Widow to? I know you know Tony Stark as well. Do you know any other Avengers? Have you met Bruce Banner? Do you get to work with Bruce Banner? Oh My God,\" Ned rambled.\nThankfully MJ decided to step in, \"If you don't shut up Peter won't be able to answer any of your questions. We're moving on anyway Nerd.\"\nTrue to MJ's word the tour group was moving closer towards the elevators, Nat still going on about the features of the training room. Mr. Harrington gestured to Peter to step aside for a second. As the rest of the class moved on the teen walked up to his teacher, shoulders hunched.\n\"Peter, I must say that I wasn't expecting to see you today. Mind filling me in on why and how you are here?\" Mr. Harrington spoke kindly, but there was still an obvious tone of reprimand in his voice.\n\"Well sir, you said that I had the day off so I asked my boss if I could spend my day working on my internship here.\" Peter honestly didn't expect this answer to go over well.\n\"Peter I have heard the rumours about your internship. Other than being here at this very moment, do you have any documents to prove the validity of this internship because you really should have registered this with the school.\"\nAt that moment Peter breathed a sigh of relief, thanking the gods that his mum was so organised. \"Yes sir. FRIDAY?\"\n\"Yes Peter?\" the A.I. replied, startling the teacher who was obviously unused to the omnipresent assistant.\n\"Would you mind pulling up the documents with the details of my internship on them, this is my teacher and he wants to check them. Could you please also register the internship formally with my school?\" He asked politely.\n\"Certainly Peter,\" she replied pulling up holographic copies for Mr. Harrington to view, \"would you like me to inform the Boss Lady about registering the internship with your school?\"\n\"That would be amazing FRI, thank you.\"\n\"My pleasure Peter.\"\nWhen Mr. Harrington finished looking at the documents with astonishment, Peter flicked them away and the documents dissolved into the air.\n\"Well Peter,\" Mr. Harrington began, \"there certainly seems enough evidence to prove your internship, but I have to ask. How on earth did you manage to get a Stark Industries internship, these positions were like gold even when I was in college.\"\nPeter just shrugged, \"Just luck I guess. Somebody high up must have taken a liking to a robot I entered into a competition. But if that's all okay, maybe we should get going, they seem to be waiting for us.\"\n\"So they are,\" the teacher replied and both of them moved to where the AcaDec team was waiting in front of the elevator. Teens and adults alike then piled into the, thankfully, large elevator.\nAs the doors closed Nat announced, still in her tour guide persona, \"Seeing as how you've seen the public training room, how would you all like to visit the private training rooms as well? There might even be a chance to meet another Avenger.\"\nThe elevator filled with cheers and Nat pressed the button that would take them to the firing range.\nNobody on the face of the earth would enjoy being stuck in an elevator with a large group of excited teens, but Peter, Peter loathed it. Reason one: he was on his way to be utterly embarrassed by his family. Reason two: super senses and elevators full of loud, excited teens should not mix. Reason three: the spot that he had been pushed into in the elevator was right next to Flash, and there was no escape. Since Peter and Nat had joined the tour group, Flash had been throwing him scathing glares. Peter was surprised that the other teen hadn't jumped him yet.\nAs the elevator starts to move, Flash leaned into Peter's space and hissed in his ear, \"What the fuck Parker?\"\nPeter didn't even think about giving Flash a response, he just rolled his eyes and turned his back on the bully. Standing so close, Peter could feel the waves of annoyance rolling off Flash. He didn't owe the other boy any kind of explanation.\n\"Fuck you Penis Parker. Is this some kind of joke? Did you bankrupt yourself paying off the Black Widow to act like she knows you so you can what? Look cool? What a freak.\"\nPeter had to bite his lip not to snap back. MJ reached over, putting a hand on Peter's shoulder, shaking her head a little. She was right. No matter how much Peter wanted to tell Flash how much of dick he is, it would only inspire the bully to become more creative in his insults. Thankfully the floor that held the firing range was only a few above the public gym and as soon as Flash had finished his insults, the elevator came to a stop. The doors opened and before the students came piling out, Nat held up her hand to bring the rowdiness under control. \n\"Right, welcome to the firing range. Before we hop out I want you to understand that on this floor there are firearms and live munitions. I assume that you all signed a waver before this trip?\" Nat asked and looked to Mr. Harrington who nodded in confirmation. \"Awesome. Just don't touch any of the weaponry and we'll be fine. If someone is using the range, stay in the marked safety zone. Come on now kiddies.\"\nNat exited the elevator, the gaggle of students following. They entered into the safety zone that over looked the range and Peter groaned as he noticed who was currently occupying the room.\nClint was engaged in an apparently avid, one sided conversation about the merits of bow and arrow over guns with an extremely sceptical looking Bucky Barnes. Clint had yet to notice the group of fairly loud teens, which meant that the man had his hearing aids turned off. Bucky on the other hand was looking at them smile on his face and one eyebrow raised so high it was practically disappearing into his hairline. Clint, to engaged in his one sided discussion, missed Bucky's change of demeaner and Nat crept up behind him, running a finger down the man's spine. The archer practically jumped out of his skin, spinning round so quickly he would have lost his balance if not for Bucky steadying him. Nat and the teens erupted into laughter. Clint scowled, reaching up to turn on his aids.\n\"It's not nice to sneak up on deaf people Nat. You're teaching these random kids bad manners,\" the man crowed, face still scowling but tone playful.\n\"Anywhere outside the common room is free game Clint, honestly I'm actually not sure how you're still alive,\" Nat shot back. Peter rolled his eyes, both of them had the combined mental age of a five year old. \"Anyway idiot, want to give these kids a demo. This is Peter's Academic Decathlon team, they walked in on Peter and I sparring so we hijacked their tour to actually show them the cool parts of the tower. Right Peter?\"\nBoth Clint and Bucky's eyes went from Nat to him and the teen let out a pained sigh, \"I suppose?\"\n\"Pete! I didn't see you there, you're so short, just like your dad!\" Clint exclaimed, causing the three avengers to giggle at their little inside joke.\n\"You're an ass Clint,\" Peter rebutted.\n\"And I know it, but just for you I'll give these kids a lesson in just how cool the bow and arrow is.\"\n\"Then why don't I show them that guns are far more effective?\" Bucky interjected.\n\"You are so on.\"\nApparently the AcaDec team was now the mediator and judge for the weapons argument between the two ex-assassins. Peter, uninterested in their feud, ran his eyes over his classmates. Charles and Abe seemed to be caught up in the discussion on which weapon would be more effective and the amount of skill required to use each. Betty's eyes seemed fixed to Bucky's metal arm, probably mentally dissecting it. Peter had seen her researching various prosthetics for a class project earlier that week. Ned had abandoned Peter and MJ to get as close to the two avengers as possible. MJ looked as if she could care less, but there was a glint of amusement in her eyes. The rest, including Flash, were waiting in anticipation as Clint picked up his bow.\nClint hit the button on the wall that started the range's combat simulation. The flavour of the month was Chitauri. Holograms of Chitauri materialised and Clint drew his arrow, loosing it into the head of the closest alien. The hologram fell and the teens cheered. Clint continued, each arrow finding its mark. When the simulation ended, the archer turned and bowed to the over excited teens who were clapping and cheering.\n\"And that's how you do it!\" Clint cried. Bucky just rolled his eyes and grabbed one of the guns that were mounted on the wall, staring his own simulation without a word. Peter could just feel that Buck was going to show off. The ex-assassin dispatched the Chitauri with one bullet each while executing a series of rolls and tumbles.\nWhen Bucky finished the class was left slack jawed for the second time that day.\n\"Now kids, who was better?\" Bucky asked, mouth set in a smirk. It took a second for the students to regain their composure but the consensus was indicated by the shouts of \"You!\" and \"Winter Soldier!\". Clint scowled, to which Bucky stuck out his tongue at the archer.\n\"How about Peter? Shouldn't he be included in this competition as well?\" Nat suggested and Peter, on impulse, punched her lightly on the shoulder. \n\"Now why would I be included?\" He whined.\n\"You can test out the new web-shooters that you've been working on for Spider-Man?\" \nPeter didn't even need to look at his team mates to feel their shocked reaction.\nClint stepped forward and clapped his hand on the teens shoulder, \"What a fantastic idea Nat! Come on!\"\nThe ex-assassin steered Peter into the shooting zone, where he pressed the mentioned web-shooters into the teens hands. Peter figured that there would be less of a fuss if he just competed in their stupid competition. He slipped the web-shooters onto his wrists with another sigh. \nBucky pressed the start button for him. The hologram Chitauri swarmed towards him, catching Peter in the moment.\nThe teen thwipped out webs, stopping the holograms in their tracks. He deliberately tries to throw some shots in the beginning, but FRIDAY the mastermind behind the simulation must have noticed and double down the holographs attack, forcing Peter to take the simulation more seriously. When the final Chitauri was downed, the teen let out a breath he hadn't realised he'd been holding. Peter slid the web-shooters off his wrists, mentally commenting on changes that would make them more efficient.\nPeter turned to face the class and the other avengers. Nat, Clint and Bucky had proud smiles on their faces. The AcaDec team were once again slack jawed.\nPeter was really starting to hate that look.\n\"You know what? These need a bit of work, I might leave you guys here.\"\nPeter thought that it was a rather smooth method of exit. He'd made enough of a show already. School tomorrow was going to be a minefield of questions as it is, he didn't need Nat dragging him into any further messes. The lab would be safe. Surely. \nThe teen slipped the web-shooters off his wrists, tucking them into the pocket of his shorts as he headed towards the elevators. \"Nat, make sure that you let them go on time. As exciting as meeting avengers is, I'm sure they all have lives to get back to.\"\nThe AcaDec team, Mr. Harrington and Sarah all appeared to all still be in some degree of shock. Bucky seemed to understand Peter's want for a strategic withdrawal, giving the teen a small smile and a nod of the head. Next to Bucky, Clint was pouting. Likely because both Peter and Bucky had shown him up, voiding his arguments in favour of classical weapons. That particular argument was likely to make a resurgence at dinner time.\nPeter didn't even bother looking at Nat, the ex-assassin was most likely to be wearing a look of victory, favouring a direct route to the elevator. He whispered a quick \"I'll see you tomorrow\" to MJ and Ned as he passed.\nHalfway down the hallway he almost believed that he would get away with the quick exit.\n\"You're going to your lab aren't you?\" Curse Nat. Stupid Fieldtrip. Peter turned on his heel and levelled a look of utter suffering at Nat. That just made her smile wider. \"I thought that these kids were supposed to be some sort of nerds? I'm sure that taking a look at the lab would be very educational.\"\n\"No way.\" Peter was putting his foot down. The lab was sacred space, it would be a disaster if the team trampled in to find vials of web-fluid and other such things. Also Harley was more than likely in the lab and he want to see a double team of Nat and his boyfriend trying to embarrass him.\n\"Why not Peter? I'm sure that they'd love it!\" Nat exclaimed, accompanied by the slow nods of the AcaDec team. \n\"Because I said Nat.\"\n\"That's a pretty weak argument. I don't see why not.\"\n\"Just because Nat. Just because.\"\n\" I could go over your head for permission.\"\nPeter gasped, stalking back to stand before her, \"You wouldn't.\"\n\"I would. FRIDAY -\" \n\"FINE!\" Peter announced before Nat could get any further.\n\"That wasn't so hard.\"\n\"Just know that I hate you.\"\n\"I know you do,\" Nat replied before whispering under her breath, just loud enough for Peter's enhanced hearing to pick up, \"I heard what the brat said to you in the elevator. You should show off a little more sometimes, it would shut him up.\"\nPeter just sighed at that. He knew that Nat did have the best intentions at heart but that didn't mean he wanted to deck her for real, any less. He could deal with Flash himself. Turning from Nat, Peter addressed the tour group.\n\"Just know that I'm not doing this out of the goodness of my heart, but because Nat has forced my hand and I'd be doing it anyway. There are going to be some non-negotiable rules and if you break them there will be severe consequences. Nod if you understand.\"\nThe AcaDec team seemed to snap out of their shocked daze after realising they were being addressed, nodded vigorously. Even Flash was too dazed to put up a fight. Mr. Harrington and Sarah nodded as well, although noticeably less vigorously than the students.\nPeter continued, \"You will not touch ANYthing in the lab no matter how enticing it is to do so. You will direct any questions to me, you do not have the authority to ask questions to any of the A.I.'s. If I don't like your question I won't answer it, plain and simple. Be respectful. Everything you will see or hear will be confidential and as such if it leaks I will know who to kill.\"\nPeter tried not to enjoy the vaguely horrified looks his classmates shot him. Without another word, the teen made his way to the elevator. The others followed him like a gaggle of ducklings, while Bucky and Clint remained in the shooting range. When FRIDAY brought the elevator up, he loaded the students on first followed by Sarah and Mr. Harrington, then Nat and himself at the front.\n\"FRIDAY, would you please take us up to my lab?\" the teen asked nicely, FRI hadn't warranted the harsh tone he had previously been using.\nBless her A.I. soul, FRIDAY replied with, \"Are you sure Peter?\"\n\"Yeah FRI, thanks for checking though.\"\n\"Would you like to let Harley know that you're on your way?\"\n\"Please. Thank you FRI.\"\n\"Not a problem Peter,\" kindness tinging the A.I.'s voice.\nThe elevator began moving upwards smoothly. His lab was quite a few floors above the training floors and so the elevator stewed in a quiet awkwardness as they moved to the lab. Internally Peter was talking himself down from panic. It would be one of the first times that people outside of S.I. or the Avengers would be stepping into his lab. He reasoned that he should get used to some attention such as this, as his high school graduation was impending. After he graduated the plan was to reveal that Peter was in fact Tony Stark's son and heir to Stark Industries. When that happened the amount of people who would scrutinise him would be much larger than his AcaDec team. This could be like, a practice run. But no matter how he framed the situation, it was still terrifying.\nWhen the doors of the elevator opened to reveal Peter's lab, it drew audible gasps from the group. The teen couldn't decide whether that was a good sign or not. The lab was about as much of a mess as it usually was, Peter hadn't gotten around to tidying it this week. Peter had several wheelie whiteboards scattered about the lab, all filled to the brim with chemical formulas and calculations, and occasionally a reminder to eat written in his mum's careful letters. The case that usually contained his suit was wide open and the red and blue suit itself was spread across a nearby table, interface cable plugged into the wall allowing Karen directly onto the main server with FRIDAY. Peter spied Harley on the other side of the motorcycle he was currently fixing. The motorcycle itself was by the windows, allowing Harley to use the natural light. Tools were spread haphazardly around his boyfriend who had obviously forgotten about the tool box a few feet away from him. \nThere were a few beakers under the fume hood and other, safer, chemical concoctions littered the benches surrounding the fume hood. The other tables held small robotics projects that were in various stages of completion. The corner near the stairs held a well-used leather couch strewn with blankets and pillows. In front of the couch the hologram display was on full show, information and data floating through the air in electric blue.\nAs the group stepped out of the elevator, Nat moved to the couch to make herself comfortable. The teens followed him, eyes darting across the lab trying to take everything in. Mr. Harrington seemed to be on the same page as his students. Sarah, seemed a little more comfortable and Peter attributed this to the fact that the lady probably took regular tours through the intern lab and other lower level labs. Although Peter had to admit that the intern lab is like hell on earth with ridiculously unorganised it is, at least he had a system.\nHe turned, taking a page out of his dad's book, arms wide and gesturing to the space around him. \"Welcome to the lab.\"\nPeter watched as Flash's face turned stormy and as Peter had predicted, the other boy blew up.\n\"What the actual FUCK Parker! I can't believe this shit. I don't know how you did this, who's dick did you have to suck to even get in the fucking building, let alone up here!\" Flash raged stepping forwards into Peter's space in an open act of aggression. Peter just grimaced as Flash continued. \"And even I have to admit, that somehow getting the Black Widow in on your little lie is a master stroke but this is all too much. You've been peddling this lie of an internship for years now, even before the blip! But you made a mistake you know? There's no way that you're an intern because we went through the intern's lab before we 'coincidently' met up with you. Why don't you just fess up before this gets any more embarrassing?!\"\nThe shouting left Peter's sensitive ears ringing. He, more than ever, wanted to punch Flash in his smug face. How dare he accuse Peter of, what, sexual favours to get into the building? That was just foul. Then accusing him of using Nat? That women was like his aunt! In no world would he even dream about doing such a thing. The class was watching on. Some of their faces indicated that on some level, they agreed with what Flash had just screamed in Peter's face. Others, including Ned and MJ, looked like they wanted to beat Flash into the ground with a baseball bat.\nSarah's face was scrunched up in disgust and if it was possible, Mr. Harrington would have smoke billowing out his nostrils in anger. But before anybody could make a move in the stunned silence, a warm hand settled on Peter's shoulder.\nHarley's voice came out calm and controlled, \"Excuse me, but who do you think you are? Spouting such accusations is warrant to remove you from the building.\" \nPeter had never been more grateful to Harley than in that moment. He could tell that his boyfriend was barely containing himself. But as Pepper had once told them: 'People are looking for a reaction when they poke you. If you don't give them that pleasure, your chances of winning an argument go through the roof'. \nFlash seemed to cowl at Harley's presence, obviously not having noticed the other boy when the class had been taking in the sight of the lab. His fear was well earned too. Harley was a six foot wall of lean muscle, towering over the other boy, eyes hard and cold.\n\"I think the question is, who are you? You another flunky Penis Parker convinced to go along with his lie? Why don't you back up buddy?\" Flash managed, though clearly not as confident as his earlier accusations. Good, Peter thought.\n\"Uncooperative as well,\" Harley muttered. Harley then turned to Peter, \"You okay Petey? I couldn't let this ass keep accusing you of such bullshit.\"\nA soft smile worked its way onto the teens face, \"Yeah Harls, I'm okay. He's just being more of a dick than usual.\"\n\"Than usual?\"\n\"Remember when I told you that there was a resident asshole of the school? Well that would be Flash.\"\nHarley rounded on Flash. \"Well then. This isn't the first time you've bothered Peter then. Why don't you give it a break Flash,\" Harley practically sneered into the other boys face. \"You've overstepped.\" \nHarley was now in Flash's space forcing the shorter teen to take a step backwards.\nMr. Harrington took that as his cue to stop in,\" I would agree with you, Mr.?\"\n\"Keener,\" Harley replied, \"Harley Keener.\"\n\"Yes, I would agree with Mr. Keener. Eugene, you have overstepped. These accusations are extremely serious and unfounded.\"\nPeter was quite frankly shocked that Mr. Harrington had stepped in. Never in the past had the man stepped in to defend Peter from Flash's near constant bullying.\n\"This is extremely uncalled for and breaches both our schools morals and rules. As such there will be consequences. Firstly I think it best to contact your parents and remove you from this field trip. Later punishment will come from the schools offices tomorrow,\" Mr. Harrington stated.\n\"That seems acceptable,\" Harley followed, \"Your tour guide will take you both down to the front reception where you can contact the school and Eugene's parents. FRIDAY, can you please see that they make it there.\"\n\"Certainly Harley,\" FRIDAY replied and reopened the elevator doors. Mr. Harrington steered a volatile Flash towards the elevator, with Sarah following behind them. The AcaDec team just watched as their teacher and fellow classmate disappeared.\nHarley let out a groan and scrubbed his hands through his hair. \"God Pete, I could have decked that kid for the way he talked to ya'. What a spoilt brat. He obviously gets away with that shit to often if he's willing to do something like that in front of a teacher.\"\n\"You don't know the half of it,\" Peter sighed.\n\"At least he's gone now,\" Nat called from the couch, \"and for my part I'm sorry Pete. Not even I could have predicted that he would be such an ass.\"\n\"Peace at last\" Peter hummed, \"Well now that Flash has departed us, welcome to the lab once again.\"\nAbe held his arm up, obviously unsure whether he could ask a question or not. \"Yeah, what's up Abe? You don't have to raise your arm,\" Peter told the other boy.\n\"Is this really your lab? I don't mean any offence but it is super fancy and like, massive,\" Abe asked tentatively.\nPeter smiled. He knew that Abe wasn't one of Flash's lackeys. \"It sure is. I'm sharing it with Harley at the moment, while he's on vacation, but most of the stuff you see are things I'm working on. Feel free to have a look around.\"\n\"And I know you introduced yourself earlier Mr. Keener, but who are you exactly?\" MJ asked as Peter finished speaking. Peter just chuckled. He knew that MJ wanted to make sure the boy that had defended Peter was actually a friend to Peter. He knew that she was watching out for him, she just didn't know how close Peter and Harley actually were.\nAt that the cold look melted off Harley's face, replaced with a grin. The taller boy sidled up to Peter wrapping an arm around the teens shoulders. Peter, naturally wrapped an arm around his boyfriends hips.\n \n\"Ahhh,\" Harley drawled, \"You must be MJ, which would make that Ned next to you.\" Harley smirked as the duo's eyes widened. \"Peter's told me heaps about the both of you. And to answer your question, I'm sort of like a lab assistant. I'm here on vacation visiting my very cute boyfriend.\"\nWith that Harley leaned down and planted a quick kiss on the top of Peter's head. Peter groaned, flush with embarrassment. His boyfriend was such a sap.\n\"Boyfriend?\" MJ followed up, shock evident in he usually steady voice.\nPeals of laughter rang out from Nat's position, \"Yep. They're such saps too. I'm surprised that they were able to hide it from Tony for the first few months. His face when he found out was priceless. Clint took a photo and framed it. It's up on the wall in the living room.\"\nPeter just rolled his eyes, \"Yeah MJ. This is Harley. My boyfriend.\"\nMJ just nodded. Ned next to her looked as if he'd had an aneurism. The rest of the AcaDec team were awkwardly looking anywhere but the couple.\n\"Right!\" Harley declared, breaking the tension, \"Aren't any of you curious? Go. Explore the lab. But hands to yourselves if you want to keep them!\"\nSlowly the team dispersed, while Ned and MJ hung back obviously wanting to speak to Peter. Before anyone got the chance to speak though, a scream sounded from the stairwell.\nThe scream was followed by a yell, that was clearly Tony, \"HARLEY KEENER!\"\nHarley broke out in fits of giggles and Peter just sighed.\nApparently if one thing was going to go wrong for Peter today, then everything was. Harley pulled Peter between himself and the stairwell while his AcaDec team probably got whiplash from how quickly their heads turned to the shout. His boyfriend's giggles were not giving Peter confidence as he listened to the muffled cursing and heavy footfalls coming down the stairs.\nWhen his dad finally reached the lab, Peter had to slap a hand over his mouth to stop himself bursting into laughter.\nThere was Tony Stark, Iron Man, drenched and covered head to toe in red and gold glitter. The look on his dad's face was a mix of furious and wet puppy.\nOccurrences such as this weren't uncommon during Harley's visits to the tower. Harley himself always claimed innocence, but anyone with half a brain knew better. This trip alone has seen Bruce's hand super glued to his favourite tea cup. Steve had been sent on a scavenger hunt to find his shield that had 'mysteriously' disappeared one morning after breakfast. Only for the snarky clues to lead him back to his bedroom where the shield was sitting under his bed (It hadn't been there earlier, Steve had checked). Most interestingly, 'someone', had given the kids a can of red bull each. Cooper, who was piled under school work at the time, found the energy to complete all of it in one sitting. But the other younger kids, Morgan, Lila and Nathaniel, had been bouncing off the walls for hours afterwards, leaving the common areas a mess. Thank god for FRIDAY, who had locked the kids out of the labs and other more dangerous areas of the tower.\nThis information was unknown to the teens that made up the Midtown Academic Decathlon team, but they didn't need to know to find the Tony Stark, covered head to toe in glitter, hilarious. The teens erupted into laughter leaving Tony looking scandalised that a bunch of unknown teens found his predicament funny.\nThis didn't last long however, as Tony spotted his son and the offending prankster. Tony stomped over and without a word, latched his arms around Harley, trapping Peter between them. Peter and Harley screeched in protest as Tony's hug covered the two of them in glitter as well.\nAs Tony released them from the glitter hug, Peter groaned, \"Did you have to cover me in glitter as well?\"\n\"I'm sorry. I thought that you and Harley were partners in crime. That's what you told me yesterday,\" his dad retorted with a playful snort.\nBefore Peter could reply Harley spoke up, \"Yep, and this was Peter's idea by the way.\"\nTony just rolled his eyes, \"I know that's a lie Keener. You know how I know?\" He paused for dramatic effect before continuing in mocking tone, \"Because we're connected.\"\nThat caused the three of them to dissolve into hysterics. In the background Nat just shook her head.\nThe initial comedy of seeing a grumpy Tony Stark covered in glitter was beginning to wear off on the other occupants of the lab. And of course, Ned being Ned, was so caught up in fanboying that he didn't realise his thoughts were actually being verbalised.\n\"Oh My God! Is that Tony Stark? Like the actual Tony Stark? This day is actually insane. First we get to meet THE Black Widow, the Hawkeye and the Winter Soldier, and now the actual Tony Stark is standing in front of us. Covered. In. Glitter.\"\nNed's comment pulled Tony from his laughter to actually take in the random teens standing in front of him. He was faced with several, not so fresh-faced teens, who's eyes were locked on him with gleams of hero worship.\n\"Ahhh… Pete? Who are these random beings that have invaded your lab?\"\nPeter took a deep breath to stifle his laughter and leaned on his boyfriend, \"You know how there was supposed to be a field trip today?\"\nRealisation dawned on Tony's face, \"So this would be your AcaDec team then? Hello Pete's AcaDec team. How did you manage to make it into Peter's lab? He doesn't let people in here real often.\"\nMJ shoved her way to the front of the group and made an uncomfortable amount of eye contact with Tony before answering in the most bored voice Peter had ever heard, \"I think that question would be better directed at the Black Widow.\"\n\"Thanks, ugh…?\"\n\"MJ.\"\n\"So you're MJ. Makes sense. Thanks MJ.\" Tony turned to Nat who was still sitting on the couch, but who now had her phone out taking photos of the glitter coverd Tony, \"So Nat?\"\n\"I thought Peter ought to show off all his assets, so I might or might not have blackmailed him to let them up here after hijacking their tour.\"\n\"Very wise Nat,\" Tony nodded, \"Very wise indeed. So kiddo's, what has our resident spider duo shown you?\"\n\"Spider duo?\" Abe asked. Now it was Tony's turn to panic.\n\"Ah did I say spider duo? What I meant was resident spider. Yep. Resident spider.\"\nMJ fixed them all with a long-suffering look and sighed, \"No. You meant spider duo. Seeing as Peter's Spider-man and all.\"\nThat statement left more than one jaw on the ground.\nA wave of utter panic overcame Peter. He tried to breath but air seemed to only come in short bursts. His heart was beating loudly in his ears. The lights to bright overhead. The thought that he had been found out cycled through his head in some kind of demonic loop.\nAfter what felt like an eternity and only a second the air started to come back. A hand he identified as Harley's was rubbing his back and the soft voice of his dad replaced his heart beat.\nPeter turned and buried his face in his boyfriend' chest. He'd had a minor panic attack in front of his classmates.\nSeeing that Peter had recovered slightly, Tony left his son to Harley and turned to face the worried looking teens. Despite the glitter, Tony could still be incredibly intimidating, and it helped that a murderous Black Widow was now standing next to him.\n\"Right. Serious time.\" The teens expressions switched from worried to terrified like lightening and MJ had a pained look on her face.\n\"I'm so sorry,\" MJ started but Tony help up a hand to stop her.\n\"I know that you didn't mean to. Peter's told me a bit about you MJ and from what I've heard you're a good friend so I'm going to let it slide this once. But only this once. Am I understood?\"\n\"Yes sir.\"\n\"Now. The fact that Peter is Spider-man is still highly confidential. While he does plan on revealing his identity to the public in future, this is not that moment. I recognise this as a mistake of my own as well. However, as this is confidential information and I have access to everyone who knows it, if this is leaked, the person responsible will easily be found. To attend this tour in the first place you all signed Non-Disclosure Agreements that should cover this information. If Peter's identity is revealed before he chooses to do so Stark Industries Legal Division will bury you in a mountain of law suits so large you won't get to the top. So no talking about this to anybody. Not your best friend. Not your parents. Not even your damn pets. Am I understood?\"\n\"Yes sir,\" the teens replied gravely. They were smart enough to understand the threat.\nPeter looked at them. As the threat settled, they were now looking at Peter, their gazes all awed. MJ had a sorry written on her face. Ned looked supportive. He hadn't expected to do this today, not for another few months at least. But plans never seem to work out the way he wanted them too.\nSlowly he pulled away from Harley, giving his boyfriend a thankful smile.\nWell if plans weren't going to work out then this could be what he told himself earlier. A little confidence worked its way into his system.\nPeter moved and stood next to his dad. This would be his practice run.\nTony gave him a look of concern, asking without words if he was okay. The teen nodded. Drawing a deep breath Peter addressed his classmates.\n\"I'm sorry about that. Caught a little off guard is all. Yes, I am Spider-man and yeah that's pretty cool. But, and I apologise for this, I'm going to use you all as a practice run for both announcing that I'm Spider-man and something else.\" Peter paused and shot a small smile at his dad, whose eyes went wide with realisation. He continued on, gesturing to Tony, \"I'd like to introduce you to someone. This is Tony Stark. My Dad.\"\nThe elevator chose that moment to return Mr. Harrington and Sarah to the lab. Both of the adults caught the tail end of Peter's speech, but had missed the downright hilarious scenes that had occurred since they had taken their leave to contact Flash's parents. So, they continued the days trend of shock and awe, with gaping mouths and bulging eyes indicating their shock. \nFor what Peter suspects is FRIDAY's attempt at humour, the elevator closed on the two adults shocked faces before reopening.\nHis AcaDec team were still in their state of shock from when MJ had revealed his currently secret superhero identity. Of the bunch MJ was unsurprisingly the least fazed and Peter had half the mind to interrogate her later. Who knows how many secrets she was privy to. While his other friend, Ned, looked like he was about to faint. But there wasn't a negative face in reaction to the surprising news he had just given them.\nSurprisingly the first words to break the silence were from Abe. \"Well Flash has signed his death warrant.\"\nThis statement caused Peter to burst into laughter and soon enough the rest of the room followed, the tension breaking. Tony was the only one not in on the apparent joke and just stood there thoroughly confused.\nWhen everyone managed to calm down, Peter felt a huge sense of relief. It felt good to have at least a weight of the secrets off of his shoulders, especially with people he considered friends. Harley's arm wrapped around his shoulders supportively and he could feel the proud aura radiating off of his boyfriend.\nSarah, the only Stark Industries employee, was looking between Peter and Tony realisation clear on her face, \"How has no one put this together? When you look at it, it's so obvious.\"\n\"Honestly, I have no idea. It's not like dad's discrete,\" Peter replied.\n\"Wha- what do you mean not discrete? I'm plenty discrete!\" Tony cried, fake hurt plastered on his face.\nPeter just rolled his eyes, \"You picked me up from school the other day in a bright red and gold convertible.\"\n\"Ah,\" He exclaimed and had the decency to look abashed. Everyone else just laughed.\n\"But wait! What was the Stark Internship then?\" Ned broke through the laughter, the dots still trying to connect in his head, \"I knew about Spider-man but I thought that you said you did actually have a real internship though?\"\n\"I was just going home Ned.\"\n\"Home?\"\n\"I live here Ned. Well not right here, but about three floors above us.\"\n\"Oh My God. Wait. If Mr. Stark is your dad then you're a Stark too. Peter Stark. And you live in the Avengers Tower. Holy Shit.\" Peter laughed again as his friend verbally processed the news.\nAn alarm rang out from Sarah's direction and she fumbled for the phone in her pocket. As she pulled it out, the guide let out a sigh.\n\"It's lunch time.\" She looked to Peter as if he was now the boss or something, but he supposed he had taken over her tour.\n\"Why don't y'all head off then? Peter and I can join you after lunch if you want?\" Harley offered from beside him.\nSarah nodded, \"That would be great.\" The addressing everyone else, \"If we want to finish the rest of the tour it's time for lunch, so if we could please head back to the elevator I'll take you down to the Stark Industries cafeteria.\"\nShe then began the difficult task of herding the teens onto the elevator. Mr. Harrington wasn't much help either as he was still getting over the fact that he had both Spider-man and a Stark in his class. Eventually though they were ushered into the elevator, leaving Nat, Harley, Peter and Tony alone in the lab.\n\"Well that went well Pete,\" said Nat, smug look plastered on her face, \"I'm not sure what you're worried about.\"Peter just glared at the spy.\n\"You did a great job Pete,\" his dad followed, \"I'm proud of you. How are you feeling about it?\"\n\"Surprisingly calm, and to be honest, it's kind of good to tell people.\"\n\"They took it really well, although I'm really glad that that Flash kid was gone before you decided to tell them. We might have had to call security ,\" Harley commented.\n\"Flash?\" Tony questioned, as the boy had been removed from the lab before he had entered the lab covered in glitter.\nPeter sighed, \"Just the schools resident ass.\"\n\"Who apparently has it out for Pete,\" Harley followed up, knowing that Peter wouldn't divulge the extent of the situation to his dad without some prompting.\nTony shot a concerned look at his son, \"We're going to talk about this later. But first I'm going to take a shower because this glitter is in places glitter should never be. All of you head up to lunch and Nat?\"\n\"Yes?\" she acknowledged, smug look still on her face. \n\"Please try not to embarrass Pete anymore today. I just know that you're the mastermind behind all of this.\"\nWith that the glitter covered genius shuffled back to the stairs and headed up in pursuit of a shower. Pete and Harley followed with Nat in the rear, as they made their way to lunch.\nThankfully for Peter, lunch was a quiet affair. Most of the Tower’s residents dropped by to pick up a sandwich from the plate Cap had left out on the kitchen bench. Peter and Harley grabbed their share before sitting on the couch to watch whatever midday TV had to offer. Tony had stomped off to the shower with the lounge rooms cleaning bot following him, trying in vain to hoover up a trail of glitter.\nAfter a fairly lack lustre episode of Cup Cake Wars, Harley and Peter dropped their dishes in the sink and headed towards the elevator.\n“You know that we don’t actually have to go meet up with your class Pete?”\nPeter really did love this boy, “I know, I know. To be honest I don’t really want to tag along on their tour, but I do want to talk to MJ. The sooner I get it over with the better.”\n“Do you want back up?”\nPeter just laughed at that, MJ was hardly villain of the week, “No, it’s fine. Although I do want to talk to her away from the others, think you could distract them for a sec?”\n“Consider it done,” Harley said, wrapping an arm around Peter’s shoulders as they stepped into the elevator.\nThankfully FRIDAY already knew where they needed to be and the elevator sped off without a word. The A.I. was truly a blessing. \nAfter a minute the doors opened onto one of the lower lab levels, mostly filled with tired looking scientists and engineers sequestered behind computer arrays. Most of the tables visible were covered in paperwork rather than experiments and takeaway coffee cups that had yet to be thrown away. Towards the back of the room, stood Peter’s class watching a little drone scuttling across a clear bench. Sarah, who was facing their direction gave a little wave but didn’t disturb the employee giving the drone demonstration.\nWalking across the room, Harley unwrapped his arm and gave Peter a pat on the back and an encouraging smile. He then joined Sarah in watching the demo. \nSwallowing a little bit of anxiety, Peter tapped MJ on the shoulder. When she turned, mouth open and ready to speak he gave her a small shake of the head and pointed to one of the closer hallways. MJ nodded and quietly followed Peter to the hallway he indicated.\nThe two of them stood there for a second in silence, both seemingly unwilling to start the conversation. What Peter found strange was that MJ seemed unwilling to look him in the eyes.\n“I’m so, so sorry.”\nPeter would have barely heard it without his super senses.\nThe louder, “I’m so sorry Peter.”\n“I know MJ, it doesn’t mean it’s alright though.” \n“I know I-“, Peter held up a hand stopping her mid-sentence.\n“It wasn’t your secret to reveal and it hurts that you did anyway. I mean, you know how I feel about it and you know I told you in confidence. It’s not just something that I like to just show around, and I trusted you, I trusted you not to go around telling people.”\nPeter could feel tears, pricking in the corners of his eyes. It really had trusted MJ. They’d been friends for years now.\nIt took a minute before MJ replied, “I now Peter and it was shit of me but-“\n“But WHAT MJ?”, Peter said, in a tone that was probably more harsh than warranted.\nShe looked up, finally making eye contact, “ I want them to know how good you are Peter. You’ve saved their lives on more than one occasion and they don’t even know it’s you. You’re so kind and selfless and none of them recognise it!” Peter softened, “It still doesn’t make it right MJ.”\n“I know. I know I shouldn’t have but I did. I just hope that you can forgive me .”\nThey now both had tears slipping down their cheeks. As much as MJ’s betrayal had hurt, she did care about him. He really did want to forgive her but he needed to make sure she understood what it meant to him.\n“MJ. I can tell that you’re sorry but it can’t happen again. Just. Don’t tell anyone else. It’s my secret and honestly I don’t care what they think of me. They’re just my classmates, not my friends or my family and you know recognition is not why I became Spider-Man.”\nMJ nodded in agreement wiping tears from her eyes. \nPeter opened his arms and pulled his friend into a hug. It took MJ a second to respond but eventually she returned the hug. The two of them stood there, tears rolling from their eyes and hugging. \nUnfortunately the hallway they had chosen was also home to the restrooms. One of the scientists turned into the hallway, giving the teens a strange look as he walked past and into the restrooms. MJ let out a watery laugh.\n“Maybe we should head back to the tour?” Peter suggested. She nodded and they returned to where the other teens were now taking turns piloting the drone.\nSurprisingly after that, Peter enjoyed the tour. It took him to places that he hadn’t even considered visiting before. Without Flash there, the teens were all so much more relaxed as well. Ned was still pestering Peter about being a Stark, the other boy was super keen to stay over at the Tower much to Peter’s amusement. The day ended with him and Harley waving goodbye to the class from the foyer and a promise to Sarah to drop in on her tours more in the future.\n \n-------- Approximately a month later, the day after Peter’s Birthday ---------\n \nFlash plopped down onto the couch, munching on a bag of chips. His parents were out for the weekend. Again. Which was both great and shit at the same time. Great because he could get away without studying but shit because this was the third weekend in a row that he had been alone. He had a marathon of TV planned to distract him from the fact of his missing parents.\nSwitching on the TV, he had left it on the news. And there, on the TV, was Peter Parker. Flash sneered and went to change the channel. But before he could, in big bold writing the news announced ‘Secret Child: Peter Parker Stark’. Which in turn left Flash choking on the chips he had previously been enjoying."
}