{
    "id": "20467451",
    "url": "https://archiveofourown.org/works/20467451?view_full_work=true",
    "author": [
        "Kedreeva"
    ],
    "title": "Getting a Wiggle On",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Other"
    ],
    "fandoms": [
        "Good Omens (TV)"
    ],
    "relationships": [
        "Aziraphale/Crowley (Good Omens)"
    ],
    "characters": [
        "Aziraphale (Good Omens)",
        "Crowley (Good Omens)"
    ],
    "additional_tags": [
        "Fluff",
        "Humor",
        "Snakes",
        "Kid Fic",
        "Sort Of",
        "does it count as kid fic if the kids are snakes but so is one of the parents?",
        "Accidental Baby Acquisition",
        "Asexual Character",
        "Asexual Relationship",
        "Love Confessions"
    ],
    "language": "English",
    "series": "Part 1 of Original Wiggleverse",
    "published": "2019-08-31",
    "completed": "2019-08-31",
    "words": "7,293",
    "chapters": "2/2",
    "comments": "740",
    "kudos": "9,502",
    "bookmarks": "1,845",
    "hits": "62,486",
    "summary": "<p>Crowley's prank to leave Aziraphale with fake eggs to babysit does not go remotely as planned.</p>",
    "notes": "<p>I finally gave in and wrote the fic to go with <a href=\"https://kedreeva.tumblr.com/post/185958148478\" rel=\"nofollow\">this post</a>. So, this one's for you, <a href=\"https://ineffable-bastard-crowley.tumblr.com\" rel=\"nofollow\">ineffable-bastard-crowley</a></p>\n<p>There's also a <a href=\"https://northeasternwind.tumblr.com/post/190727970573\" rel=\"nofollow\">really cute comic</a> you should absolutely check out. It pre-dates this story but is only related because it spawned from the same origin post, but the water bottle and kibble bowl absolutely sent me.</p>\n<p>Now available translated to <a href=\"https://archiveofourown.org/works/23158207\" rel=\"nofollow\">русский</a>!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>If you enjoyed this, I'd love to hear from you! Thank you for reading!</p>\n<p>Edit: This is a sandbox 'verse! If you want to write about their adventures after this story, please do! I have started a collection called \"Wiggleverse\" and it already has at least one more story in it!</p>",
    "text": " \n            The door of the bookshop jingled, just loudly enough to draw Aziraphale out of the story he’d been reading. His brow scrunched when he heard no further greeting, which was out of the ordinary, as the door had been locked and the only one capable of getting through it was Crowley, and Crowley never entered quietly. Not, Aziraphale thought, unless he was up to something that he did not want Aziraphale to see.\n            “Crowley?” he called, closing the book and setting it on the edge of his desk. He tipped his chair back a little, but Crowley was not in his line of sight between the entrance and his seat, so he clambered up and went looking. “Are you alright?”\n            “Just fine, angel!”\n            Aziraphale scowled. Crowley was heading for the back room. Or close to the back room, which was notable enough. Aziraphale crossed the shop, weaving around shelves and piles of books – he’d been cleaning, when he accidentally opened a book and sat down with it, which was how it normally went any time he tried to organize the shop – and caught sight of Crowley’s form disappearing into the back room, sure enough. He followed after, a little annoyed at being ignored and sneaked past, and stopped in the doorway, eyes widening.\n            “What on Earth…?” he asked, staring at the glass aquarium Crowley was clearing space for on one of the small tables. “Crowley, what’ve you done?”\n            “They’re babies,” Crowley said. “Or, well, they’re not babies yet. They’re… pre-babies. Eggs,” he said, finally catching the word by the tail. “Can you watch them?”\n            “Watch them?” Aziraphale said incredulously, not any less confused about what exactly was going on than he’d been when he walked in. “Why are they in an aquarium? Crowley, where did you-”\n            “They’re mine,” Crowley told him, as if that cleared up anything.\n            “Yours?” Aziraphale squawked. “Like-”\n            “Well not- I didn’t lay them, I just-” he said quickly, although his tone left Aziraphale with more than a few doubts about that. “Look, I have to go, I’ll be back in a few days, just-”\n            “Crowley, you can’t-!”\n            “You’re gonna do great,” Crowley assured him, hands on his shoulders just so he could rotate them in a circle and be the one closest to the door. “I’ll be back in a few days. Babies,” he added, and then he was heading for the exit before Aziraphale could get in another word about it.\n            With a sigh, Aziraphale turned around to see the five little white spheres sitting innocuously in the bottom of the little aquarium. There was a bit of sand to cushion them, and perhaps to keep them from rolling, but nothing else- not even a lid. Well, that wouldn’t do, Aziraphale thought. Crowley had obviously been unprepared for… whatever was going on. He supposed he would find out in a few days.\n            In the meantime, he had pre-babies to take care of, and he was going to do a better job of it than it appeared Crowley was capable of doing. And he just wouldn’t give them back until he had an explanation.\n \n \n            The first thing Aziraphale did was call the local pet shop to ask what they knew about taking care of snake eggs. Aziraphale was reasonably certain that they were snake eggs, given that they looked nothing like chicken eggs, which was his first suspicion. He had not wanted to even touch them until he knew if that was okay, so he waited patiently for someone on the other end to pick up and, when they did, said:\n            “I’m very sorry to trouble you, but a friend of mine has asked me to watch over his pet snake’s eggs. Is there… anything in particular I should know? He had to leave in quite a hurry and did not have time to explain anything to me.”\n            The woman on the other end made the sort of noise that said this was the last question she’d expected to answer today, and said: “Well, they should be fine in the incubator, but do you know if they’re going to hatch soon?”\n            “Hatch?” Aziraphale said, baffled. Obviously he had known they were eggs, and that they needed caring for, and that Crowley would expect them to be intact upon his return, but he had not had time to consider that the main function of eggs was to stop being eggs and start being something a bit more wiggly. “How would I tell?”\n            “I can’t help you there,” she said, and she sounded sorry enough about it that Aziraphale took no offense. “But maybe you can search online?”\n            “Rather,” he said, a bit disappointed and so flustered by the idea of the eggs hatching that he hung up without even saying goodbye.\n            He wrung his hands for a moment, and then straightened up and marched back to the aquarium to peer inside. Incubator. This was definitely not an incubator, but when he steeled himself and reached inside to run a gentle finger over one of the eggs, he found it warm. He jerked back like he’d been burned, even though the shell had only been mildly warm.\n            “Maybe you don’t need an incubator,” he told the eggs, peering down at them over the rim of the aquarium. “Crowley’s never followed any other rule, I don’t see why he should start now. I wonder if… well, I suppose we’ll see, shan’t we?”\n            He stayed for a little longer, watching, and then pulled himself together. The library was still open for a few hours yet, and if he was lucky, they would have a book on how to care for baby snakes, should the eggs actually hatch. If they didn’t, then Aziraphale would know a little more about the world, but if they did, he would be prepared.\n \n \n            Aziraphale leaned against the shop door, fumbling for the handle, and after a second of spectacular failure, just flicked a finger to send it swinging wide open for him. He shuffled sideways through it, mindful of the bulky cage in his hands, and managed to get inside without toppling or breaking anything. The shop door swung closed of its own accord behind him and locked shut to leave him to his business.\n            Carefully, he lowered the new aquarium to the surface of his desk, letting the last corner clunk down as he slid his fingers free. It was bigger than the one Crowley had bought, though not by much, but importantly it had a lid and doors on the side that opened and locked as needed. The pet store employee had been less than impressed with his knowledge of snakes, but upon finding out that he was attempting to aid a friend and money was no issue, she had loaded Aziraphle down with a lot of care items.\n            So it was that he found himself spending the rest of the night cobbling together his first attempt at a snake habitat. There were sticks and plants and substrate that smelled of rich, damp earth, even though Aziraphale thought the bag he’d miracled away had said something about coconuts. Half the bedding was softer, some kind of moss he had been instructed to keep humid, which accounted for the spray bottle he found in one of the bags.\n            Of course, he set the whole thing up and then remembered he had been explicitly instructed to apply the heat tape to the bottom of the enclosure first, and spent a while trying to figure out how to do that without tipping the whole thing on its side. Eventually he just miracled it on, after remembering he did not have to follow human conventions of chronological order for tasks, and decided it was time for a break.\n            He puttered around the shop for a few minutes, but after enough false starts, he decided he couldn’t avoid the back room forever, and he went to check on the eggs. They hadn’t changed, and he didn’t know what he expected them to do, exactly, but he felt a little better to see them still in egg form with no disturbances to the sand around them. Gently, he brushed a finger over one of them and felt its warmth. He left his finger there a second longer than he had before, barely a touch at all, and tried to imagine what was inside.\n            “He doesn’t seem like the sort to keep eggs he just found,” Aziraphale said softly to the eggs. “Especially since you don’t seem to need anything from him. You’re getting along just fine without me, after all.”\n            He sighed, throwing a glance out the door. Of course, no one was going to come investigating him anymore. Heaven had left them alone for a couple of years now, and although Hell still came around – which was, he assumed, what this business with Crowley taking off was about – it was never for him, and they never showed their faces at the bookshop. At least, not since Aziraphale had smited the first one of them on sight. He hadn’t meant to, but the demon had startled him at a rather inopportune time.\n            He turned back to the eggs, which unsurprisingly had not moved at all. “But if he didn’t find you, that doesn’t leave a lot of options. I admit, I’m a little afraid he’s stolen you from someone. I don’t know what I’ll say if they come here asking. I’m a terrible liar, you know. Your-”\n            Realizing what he’d been about to say, he hesitated. On the one hand, if Crowley had stolen them from someone, there was a chance that they could go away again, and it would be unfair of him to say your father. On the other hand, he didn’t want the eggs to feel as though they had no one, and Crowley was the closest thing to a parent they had at the moment, except perhaps for Aziraphale himself, despite that he was only supposed to be babysitting.\n            “Well, your father’s a much better liar,” he told them a bit secretively. “At least for a while, until he starts to feel bad about it. He has a good heart, you see. It’s… he doesn’t like to hear that, so we’ll keep it just our secret, shall we?”\n            There was, predictably, no response from any of the five little globes. Aziraphale sighed, and tried not to feel too silly for talking to eggs. They probably couldn’t hear him. Probably.\n \n \n            Somewhere, buried in the depths of the bookshop, Aziraphale found a printed photo of Crowley. Upon the advent of handheld cameras, Aziraphale had purchased one and spent three rolls of film learning how to use it. He’d developed them himself in a dark workshop after befriending the young man who ran it, and almost none of the pictures had been worthwhile, which was disappointing but not unexpected.\n            There had been, however, a couple photos that had turned out… well, rather perfect, actually. Three of them, to be precise, and Aziraphale had not taken a single one of them. One of them – and although it had gone missing, he suspected he knew where it went – was of himself, turning to smile when Crowley had called out his name. Another was of the bookshop, from 1888, a photo which Aziraphale had since had enlarged, framed, and placed on his wall in his bedroom.\n            The last was the one in his hands, of Crowley smiling almost gently, the camera held up in one hand to take a picture of himself. Aziraphale was given to understand this sort of photo was popular now. He had kept the original print tucked away inside of one of his favorite books, safe and sound, and it was the only photograph he had of Crowley, since he had promptly given up photography as a very human endeavor.\n            He replaced the photo in the book, and walked a few streets down to the print shop, where he paid for two copies of the photo. The young man at the counter gave him a bit of a strange look, but he handled the photo with care and the copies were, if not the most amazing copies ever, functional enough for Aziraphale’s needs. He paid for both, and a roll of clear tape, and proceeded home in good spirits.\n            At the library, Aziraphale had been reading on a computer about baby animals for the past two days and had learned a great deal about them. For example, many humans were convinced that baby humans could hear things while in the womb, most notably the heartbeat of the parent carrying them. Birds, upon hatching, imprinted upon whatever moving creature happened to be caring for them (a tangent which had led Aziraphale off course for nearly an hour as he waded through hundreds of adorable photos of baby birds following after animals that were Most Definitely Not Birds). Reptiles, it seemed, were fairly self-sufficient after hatching, but given that these particular ones were likely not… not entirely reptilian in nature, Aziraphale did not want to take any chances.\n            So it was that he found himself taping one of the photos of Crowley into the inside of the new aquarium, and the other into the inside of the incubating aquarium, just in case.\n            “You should know who your father is,” he told them kindly as he smoothed the last bit of tape into place. “He’ll be back in a couple more days, I’m sure, but I worry that you’ll arrive before then. After all, if you weren’t going to, he might as well have just left you at his place, don’t you agree?”\n            They could not, he knew, agree, but he also knew that he was right. Crowley would never have brought them here if they were just supposed to stay eggs. They could stay eggs anywhere. He could have hidden them anywhere he liked, and it seemed as though they’d have been just as fine. So, Aziraphale reasoned, they must be near to hatching.\n            Gently and a bit fretfully, he reached into the aquarium and brushed a fingertip over one of the eggs. It was still warm to the touch, and gave back just the tiniest, faintest glow of energy, sensed only by his own essence. It lit up red and blue, and Aziraphale smiled.\n            “Well,” he said quietly, leaving his finger there and hoping that the tiny life against it could feel him in return. “Perhaps you’re not so regular at all.”\n \n \n            After that, Aziraphale made a point of touching the eggs more often. They were warm and responded in colors and sensations scraped across his essence more than a little clumsily, like feeling the thoughts of a colt as it shuddered through its first steps. He spoke to them softly, telling them that they would hatch into light and love, telling them that they had a place in the world when they were ready, telling them that they were safe.\n            And, almost as a matter of course, he found himself telling them about Crowley.\n            “Your father saved the world once, you know,” he said softly one evening, when the book he’d been reading them was finished.\n            The book was a bright, gaudy thing, made for very small human children, but it had had a picture of a snake on the front, and the insides contained praise for snakes rather than fear, and so Aziraphale had brought it home. He could not tell if they had enjoyed it or not, but it made him feel a little better to be doing something for them rather than letting them just sit here alone in his back room.\n            “He wasn’t supposed to, you see,” Aziraphale continued, thinking back a few years with a small smile. “We’d been here for quite some time, and I think he expected to be here quite some time yet when they brought him the antichrist. That’s Adam, you know, although he’s much less of an antichrist and much more of a teenager these days. More dramatic, but less world-ending.”\n            “Crowley came right to me, after he’d delivered Adam – well, not Delivered delivered, you see, just handed him over to the nuns – to try to come up with a plan to save the world. Even back then he’d wanted to, and it was me that had needed convincing. Quite silly of me, looking back. I’d thought the angels were… well, I was mistaken, at any rate.”\n            “He wasn’t, though, your father,” Aziraphale continued. “He tried to save the world right up until he thought he couldn’t, and then-”\n            Aziraphale swallowed the next words, not sure how to say and then he tried to save me when his throat wouldn’t open. Crowley had saved him, though not because Crowley had fought anyone or begged him to stay or go or even because he did what he was supposed to do. He had saved Aziraphale because he had spent six thousand years making sure Aziraphale knew that they weren’t so different, in the end.\n            “When he didn’t know what else to do and was out of cards anyway, he helped everyone else,” Aziraphale finally admitted. “He got us into the airbase and he stood at Adam’s side to the end, and he stood at my side after that. He stopped time, you know. That’s very clever of him. Powerful, too. I don’t know anyone else that can do that.”\n            He quieted then, tracing over the feelings that arose when he spoke of Crowley kindly. He wasn’t allowed to, most of the time. Crowley would cut him off if he started, shoving the words away like he didn’t want them, couldn’t stand them, and Aziraphale could hardly blame him. He suspected those sorts of things were salt in a long-open wound kept raw by Crowley’s own hand.\n            Aziraphale had never found the words to tell Crowley that he didn’t have to be good enough for Heaven to be a good person. At least, not in a way Crowley would hear. So Aziraphale bottled it up until it became too much to contain, which was certainly too much for Crowley to handle, and they went round and round through the centuries.\n            Gently, he laid a cheek on the rim of the aquarium, staring down at the five little spheres of white. Even without touching them, he could feel the pulse of life beneath their shells now. They must be close to hatching.\n            “I would tell him, if I could, but he doesn’t like when I tell him such things,” Aziraphale said, barely a whisper, almost a conspiracy. “So perhaps it can be our little secret.”\n            He smiled at that. It felt good to tell someone, while still feeling safe that Crowley, himself, would not catch wind of it. He didn’t expect Crowley would like to hear anything so soft. He could barely tolerate being called kind- Aziraphale had no idea what it would do to him if he were to find out he was loved.\n            With a sigh, Aziraphale reached in to brush a finger gently over each egg in turn. “I do love him,” he said, not a little wistfully. “More than is probably appropriate, and certainly more than he’d tolerate, I know. But I do. As long as we’re sharing secrets. And now I think it’s your bedtime.”\n            He was not sure if eggs had a bedtime, or if baby snakes did, but he had decided that a firm set of rules was a good place to try to start, just in case, so he stood up and pushed his chair against the table and turned off the lights on his way out the door.\n \n \n            On the fifth day, everything happened at once.\n            Aziraphale came to check on the eggs in the morning after breakfast, and found three of them with small openings in their soft shells. With a gasp, he’d gone to turn on the heat in their new cage and then settled in beside them to watch them struggle their way into the world. It took much longer than he expected, with each baby spilling into the sand amid goo.\n            All five of them made it out, and Aziraphale let them rest for a few minutes each before he reached in to scoop them up, pat them dry, and place them into the freshly-misted moss. Almost as soon as they were in, they burrowed around until just the tips of their snouts showed, and they looked up at him with familiar yellow eyes.\n            Well, three of them did. He had counted four babies that could have been Crowley in miniature – which raised more questions than Aziraphale really wanted to ask – except that one of them had sky-blue eyes instead of Crowley’s yellow. And then there was the fifth child, who looked as though it didn’t belong in the family, all white instead of black, with blue eyes and only the red belly to give it away as a sibling, and that certainly didn’t help Aziraphale find any answers.\n            He supposed it didn’t matter. He would be able to ask Crowley every single question he had when Crowley returned, and until then, regardless of how they looked, all the babies would need his care and love.\n            “Welcome to the world, little ones,” he greeted to all five little noses as soon as the fifth had resurfaced. “I suppose you’re going to need names. I do hope Crowley comes home soon. He really should be the one to name all of you.” One of them cocked its head, frighteningly reminiscent of the way Crowley did when considering an explanation Aziraphale was giving, and then slithered up out of the moss. Aziraphale quickly held up one hand to prevent it from flopping out over the open door of the enclosure, and it shot up to coil around his thumb, hardly bigger than it, and fell still, yellow eyes on his.\n            “Oh,” Aziraphale said softly. “Well, hello there.”\n            He realized, with a little start, that he must be warm, which must feel good to the chill scales of the little one, still a bit cool from hatching. He curled his other hand around his thumb, but no matter which way he rotated his thumb, the little one held his head so that he could see Aziraphale, and Aziraphale realized that the little one was a he at the same time he felt the tiny spark of adoration zinging along his thumb.\n            “Oh, I see,” he murmured, affection blooming in his own chest in response. “Yes, that’s alright. I didn’t lie when I told you that you would be born into love. You’ve gotten here, now, and a very good job it was. You ought to have a rest now though. I expect you’re tired. I won’t let anything happen to you.”\n            The hatchling stared up at him for a moment longer, and then his coils loosened and he slithered down into Aziraphale’s cupped palm and fell so still that Aziraphale worried for a moment that he’d stopped breathing. But sure enough, the red of his belly moved minutely as he breathed in, and Aziraphale relaxed. With his newly-vacated hand, he closed the door to the enclosure on the rest of the sleeping babies, and crossed the bookshop to sit down at his desk.\n            He won’t get much done like this, he thought, but perhaps some things were worth putting off for a little bit of love. He hummed quietly to himself in thought, and then smiled as something occurred to him.\n            “Well, if he wanted to name all of you, perhaps he ought to have been here,” he said softly. “I think I shall call you Anthony Junior. At least you’ll know what the J. stands for.”\n            And with that, he settled in to wait for Anthony to wake again.\n \n            Crowley drove an entire block before he had to pull over to laugh until tears leaked from his eyes. He had spent his morning acquiring a package of ping-pong balls and filling them with a goop that very closely resembled the weight and consistency of egg innards. He didn’t have to be terribly accurate- there was very little chance that Aziraphale knew anything about eggs in their raw form. Cooked, sure, but to hatch? Well, even a hard-boiled egg was different.\n            He’d eventually gotten home and sat near the phone for a while, thinking that of course Aziraphale would realize that they weren’t real eggs, and call him to scold him, and perhaps they could go to dinner, but the phone – both of them – remained curiously silent. He fiddled with the idea of calling to ask after the eggs, but decided he would need to see how long it took Aziraphale to notice something so obvious. Of course, had Crowley considered how long it had taken the angel to realize a few other things, he mightn’t have bothered, but Crowley wasn’t in the considering-his-actions business, particularly not in the consequences of department.\n            So he’d waited a little longer, and then had a bit of a nap, and left the flat with enough time to go cause a bit of trouble before one day turned to the next. Aziraphale would notice eventually, and if he didn’t reach the landline, he’d call Crowley’s mobile. The way Crowley saw it, the longer it went on, the better it would be when Aziraphale realized the truth.\n            That was worth a bit of waiting, in Crowley’s eyes.\n\n\n \n            Unfortunately for Crowley, patience was a virtue, not a vice.\n            Over the next two days, he nearly visited the shop four times, even pulling up to the curb once before he remembered he was supposed to be off doing something worth dropping a bunch of potential babies in Aziraphale’s lap. If there had been such a thing as a neighborhood watch around Aziraphale’s bookshop, and if they could have done so at all, they would surely have pegged Crowley as a person of interest, but thankfully there was no one watching him make a fool of himself forgetting his own prank.\n            By day three, Crowley called the shop just to hear Aziraphale’s voice, worried that perhaps he’d broken him, which was the only explanation that he could come up with for why Aziraphale had not called him first. He’d hung up, of course, the moment Aziraphale answered, and then nearly called back to apologize and managed to hang up a second time before he’d finished dialing.\n            By the fourth day, Crowley had become convinced that Aziraphale was not going to notice at all, and that he would have to explain his prank in detail, which was not nearly as fun as letting it play out, and so Crowley began to avoid the shop as though he hadn’t been already. He took a trip across town and ordered a lunch he didn’t eat and drank a bit too much wine and came up with half a dozen explanations he couldn’t use.\n            By the time he made it back to his flat, surprisingly in one piece, he had decided that he would go over in the morning and just take the eggs back and pretend it never happened. Aziraphale would ask him questions but if he managed to snake around an explanation, he could avoid it entirely and Aziraphale would let it drop before even half a decade had passed. It was a good plan, a solid plan, and one he absolutely was going to implement at the first opportunity.\n            Morning of the fifth day came and went, and sometime around dinner Crowley finally parked outside the bookshop and stared at the door as if Aziraphale might have noticed him drive up and come out to greet him. He did not, and the shop was closed, with the blinds drawn tight, and Crowley let himself in anyway, as quietly as possible. Maybe Aziraphale was lost in the stacks of books, or upstairs doing whatever it was he did upstairs, and Crowley could just grab the tank and go.\n            Of course, nothing in Crowley’s life was that easy, and he found Aziraphale asleep at his desk, across from a table with a large, beautifully decorated enclosure that looked like a little slice of heaven for any snake that chose to call it home. Crowley smiled softly around his guilt over trying to prank Aziraphale. Of course he would have done his best to make sure nothing went wrong. Of course he would.\n            With a sigh, Crowley managed to keep his hands to himself and travel past Aziraphale and into the back room, hoping that the aquarium would be where he’d left it. Sure enough, it sat a little askew on the desk, with a picture of himself taped to the inside of it and-\n            -and no eggs.\n            Well, no ping-pong balls, Crowley corrected. They were not – and had never been – actual eggs. But whatever they were, they were gone, the sand disturbed like Aziraphale had run his fingers through it.\n            Crowley snorted, as realization dawned. Just enough of a bastard indeed. Of course Aziraphale had probably noticed that they weren’t real almost immediately. Crowley had meant him to, and Aziraphale was clever, and Crowley would never get tired of that. Aziraphale must have realized what Crowley had done, and what Crowley expected of him, and decided to see how long Crowley would last.\n            Well, five days wasn’t bad. Wasn’t great, but it wasn’t bad.\n            He didn’t understand the photo, though he recognized it as one of the first he’d ever taken. He’d taken it as a joke, after stealing Aziraphale’s shiny new camera for a bit. He’d snapped another one of the bookshop, and one of Aziraphale that was tucked away safely in his flat in the same vault as the holy water had been. It used to live in his bedroom, in the closet in a book that no one would ever actually read and more likely belonged on a coffee table than put away in the dark. It was the sort of book that Aziraphale would never open, which meant that Aziraphale would never realize Crowley had taken his photo home.\n            A little amused, he popped back out to the main shop and meandered over to Aziraphale’s side. It was strange, the way he lay slumped over the desk, his hands in an awkward position, as though he clasped something between them. Crowley was loathe to wake him. Anything that could make Aziraphale sleep had to be exhausting. Maybe he’d been as wound up as Crowley, waiting to see who broke first.\n            Gently, Crowley reached over and drew one finger down the side of Aziraphale’s hand, hoping the light pressure would rouse him without startling him. Aziraphale made a small noise and scrunched his body, as if trying to turn into a ball, and Crowley chuckled.\n            “Aziraphale,” he said softly, almost sing-song.\n            A low hiss echoed across his senses, followed by sibilant whispers from behind him. Crowley hackled, turning, but there was nothing there. He swallowed, hands dropping to where they could be ready to fight, ready to snap his magic to his command as he began to scan the shop. The hiss continued, fragile, and within it, Crowley heard a word.\n            Father.\n            “Oh, you’ve come back,” Aziraphale said from behind him, and Crowley jumped, a spit of fire leaping from his hand and disappearing as it went. Aziraphale stared with wide eyes, his clasped hands moving close to his chest protectively. “What’s all that about? You didn’t come back here still being chased, did you? Crowley-”\n            “Ssshhh!” Crowley hissed, straining to hear. The hiss had quieted at the sound of Aziraphale’s voice, and Crowley gave a low hiss, himself. “Something here.”\n            Aziraphale gave him a strange look, still blinking sleepily. “Five somethings, I expect,” he said and then yawned as he held up his hands and opened them.\n            Inside lay a tiny black ribbon that gave a little wiggle and looked up at Crowley with golden eyes. Crowley’s blood ran cold even before he heard that word again.\n\n            Father!\n\n            “Oh no,” Crowley said taking a step back as the hissing began again. “Oh, angel, what have you done?”\n            Aziraphale gave him a stern look, the exact look Crowley had expected to receive after realizing Aziraphale had gotten the prank and would be waiting for him, but for a completely unexpected reason. “Well, it wasn’t very responsible of you, just abandoning them here when they were about to hatch, but I figured that whatever you’d done, or whatever you had to do, it must be very important to have to run off like that. I couldn’t just let them roam about, and you didn’t exactly leave me with proper accommodations so I-”\n            “Angel!” Crowley interrupted, voice high and stressed. “They were toys! They were-” he made a motion, like hitting a ping pong ball with a paddle, “just toys, just- they- you- how’d they- where- five?”\n            “Toys?” Aziraphale echoed, looking as confused as Crowley felt at the moment. “You cannot treat living things as toys. They deserve care and- and love.”\n            “No!” Crowley exclaimed, desperate to explain despite the fact that all words seemed to have abandoned him. “I bought them! They were just- just balls, Aziraphale!”\n            “Balls?” Aziraphale repeated, sounding a bit offended.\n            “Ping pong balls!” Crowley managed, gesturing at the vague idea of what he had done. “I thought- I figured you’d figure it out and we’d have a laugh, and you went and hatched a whole snake out of them!”\n            “Five,” Aziraphale said again, and Crowley’s blood pressure threatened to leave him for Heaven’s heights. “They’re just over there, Crowley, and you’re frightening them.”\n            Crowley followed the line of his gesture and his gaze landed upon four little faces staring out from the innards of the enclosure he’d passed and thought was empty. Crowley let out a breath like he’d been punched, not ready to take any of this in properly. “You’re kidding.”\n            “I wouldn’t,” Aziraphale said, finally getting to his feet. “They only just hatched. Anthony here was cold and friendly, and I must have fallen asleep.”\n            “Anthony,” Crowley said faintly. His vision swam a little, and he leaned back against the desk to steady himself.\n            “Anthony Junior,” Aziraphale told him, in the tone of voice that said there was no point in arguing. “I thought you’d be expecting them, but apparently there’s been a bit of a miscommunication.”\n            “Miscommunication,” Crowley croaked, looking down at where Aziraphale very gently held one of the little babies. It still stared up at him and he could feel the adoration pouring off of it. He hadn’t meant to be a father. He’d barely scraped by being a godfather!\n            Aziraphale took pity on him then. “Crowley, it’s going to be okay,” he said gently. “What if I make us a spot of tea, and we can figure out what to do next? Here.”\n            Crowley opened his hands automatically when Aziraphale made to hand him the baby – Anthony Junior, his mind supplied – and before Crowley knew it, there was a noodle in his hands and Aziraphale had disappeared. The little ribbon stared up at him, and then began to weave itself around one of his thumbs. Crowley hardly dared breathe.\n\n            Father?\n\n            Letting out a shaky breath, Crowley nodded and then quickly added: “Yeah. I guess I am. It’s my fault you’re here, anyway.”\n            Anthony Junior stared up at him curiously for a long few seconds, tiny purple tongue flickering in and out. Thank you, he said finally.\n            “Don’t say that,” Crowley said softly. “That’s good manners, for starters.”\n            Azirafather says manners are important.\n            “He would,” Crowley said, glancing to where Aziraphale had disappeared. “I suppose he’s told you a lot of things he shouldn’t.”\n\n            Like secrets?\n\n            Crowley’s interest piqued. “D’he teach you that word?” he asked. “He tell you any good ones?”\n            Golden eyes studied him carefully, with understanding far beyond the mere day he’d been alive, and Crowley figured that had to be the result of a good deal of angelic influence. There was a reason Aziraphale had chosen to work in the garden instead of taking the nanny position and it had everything to do with his affinity for and knowledge of very tiny humans- or rather, his lack thereof. Aziraphale’s thoughts on the matter tended to run the same line as those who liked dogs, but the sort that got to go home with someone else after a bit of interaction.\n            He said you are a good liar.\n            Crowley snorted, a mix of proud and wounded. He was, although he had not expected Aziraphale to recognize it, nor tell it to… well, anyone else. And he had been a good enough liar that Aziraphale had believed new life right into existence despite every aspect of physics he’d had to ignore to make it possible.\n            “And what elssse?” Crowley asked, letting his hiss draw out. It didn’t matter in front of Junior.\n\n            That you are clever and powerful.\n\n            A protest rose in Crowley’s throat, but neither of those things were inherently good, necessarily- at least, not the way Aziraphale usually meant it when he tried to compliment Crowley. He let it slide. “We both are,” he said instead. “But that’s not a secret, you know. All of Heaven and Hell know that one.”\n            He loves you.\n            Crowley froze. “What?”\n            He loves you, Junior repeated, obviously having no concept of a rhetorical question yet. More than is probably appropriate. That’s what he said.\n            “Crowley?” came Aziraphale’s voice from behind him.\n            Crowley jumped like he’d been zapped, glad that Junior had a tight grip on his thumb and could not be flung across the room, and turned to face Aziraphale. There were two cups of tea in his hands, one of them held a little closer to Crowley than the other, and a vaguely concerned look on his face. Crowley gulped for air, trying to find words and coming up even shorter than earlier.\n            “Are you alright, dear? I believe the humans would say you look as though you’ve seen a ghost.” He took another step forward, and Crowley stumbled a step back, mind whirring so fast it felt empty.\n            He’d known, of course, or he’d hoped anyway, but- but surely Aziraphale would have told him. If he was willing to tell any snake at all, it should have been him. He hadn’t been subtle in his own feelings. He hadn’t come close to subtle. He lived in a completely separate universe from subtle, short of saying the words themselves. He’d just never thought...\n            “You love me?” he asked, and immediately regretted it. He’d meant to be so much more eloquent. He’d meant to not ask at all.\n            Aziraphale froze. “I-” he said, eyes wide, and then he fell silent. The teacups in his hands rattled as he jolted a little, and he moved to set them on the desktop. He very carefully did not turn back around to face Crowley. “I didn’t think they would remember that. I didn’t know you’d understand them if they did. I hope that this doesn’t- that is, I don’t expect that you… nothing has to change, you know. I’ve-”\n            “It could.”\n            Aziraphale straightened a little and did look at him then, every line of his body speaking of careful hope. “It could what?”\n            “Change,” Crowley said, breathless and a little more fragile than he liked. “If we wanted.”\n            For a very long moment, all Aziraphale did was stare at him, until Crowley wondered if he’d even heard and he was about to repeat himself when Aziraphale said finally: “Do you?”\n            Crowley let out a breath he hadn’t realized he’d been holding. In answer, he lifted Junior up to view. “We’re changing a lot of other things.”\n            “Crowley,” Aziraphale said, in a tone that warned he should definitely be taking this more seriously, even though Crowley felt very much like laughing a bit hysterically. He’d spent six thousand years taking this seriously, just to have one prank unravel it.\n            “Of course I do, angel,” Crowley told him, edging up on that breaking point anyway. “D’you think I’d ask just anyone to run off to the stars with me? Avert the apocalypse? Overthrow Hell’s plans? We changed everything for this. Of course I want to.”\n            He took back the distance he’d ceded earlier, and then some, until he stood close enough that he could touch if either of them dared. Junior held tight around his thumb, and Aziraphale held very, very still, eyes searching Crowley’s for something Crowley couldn’t guess but probably had in scads. Crowley let out a shaky breath.\n            “Of course I love you, too,” he said, just loud enough to cross the space between them.\n            Us too, Junior piped up. Tell him!\n            Crowley made a small, pained noise and looked down at the string of noodle on his thumb. “And apparently the kids love you, too. Can’t blame them, you did sort of invent them.”\n            “And whose fault is that?” Aziraphale said, relaxing a little as the tension broke and seeped away again. Crowley’s heart lightened a little. Maybe change didn’t mean giving up what came before. They could still be them.\n            “How was I supposed to know you wouldn’t check!” Crowley shot back, no heat at all in his smile. “You really thought I’d just bring you eggs? And I told you they weren’t mine, so why do they look like me?”\n            Pink touched Aziraphale’s cheeks as he raised his chin, trying to look more dignified than Crowley was sure his answer would be. “Well. They don’t all look like you.”\n            “Oh?” said Crowley, turning away to glance over at the enclosure. “Picked a few other looks, have you?”\n            He moved away then, crossing over to peek inside. The whispery clamor from earlier picked up, and he heard his name – or at least his new title, and wasn’t that going to take some getting used to – amidst the sound. It took him just a moment to find the four little snouts poking up from the moss. Three black, one white, and Crowley couldn’t help but smile broadly when he saw a familiar shade of             blue staring back at him from two sets of eyes.\n            “Oh, I don’t think we can blame Junior for telling on you,” Crowley said, turning back around to find Aziraphale had followed him over. “Not with that lot looking like that.”\n            Aziraphale did not look repentant, though the pink stayed on his cheeks. “It’s not like I planned it that way, but… it’s nice, I think, now that it’s done. I haven’t named them, you know. Except for Anthony.”\n            “Why not?” Crowley asked, raising a curious brow.\n            “Well,” Aziraphale said, not quite looking at him. “They’ve only just hatched, and I thought… since they’re your children after all, that you should get to name them.”\n            Children.\n            Crowley looked down to his hands then, to the tiny curl of black looped around his thumb and the wide, yellow eyes staring back up at him, trusting.\n            If anyone had asked him his opinion on the matter a week ago, he could have said it never crossed his mind. Demons didn’t havechildren, and humans lived far too short of lives to bear actually taking any of them in. However, Crowley could feel the tiny curl of divinity in the spark of Junior’s life, and knew that each of the five little hatchlings would be around a very long time indeed.\n            It could be worth falling a little bit in love with them.\n            “Maybe,” he said slowly, “we could name them together? You did have a hand in making them, you know.”\n            Aziraphale’s answering smile was bright and warm. “I think I would like that. I think I would like that very much.”"
}