{
    "id": "20598215",
    "url": "https://archiveofourown.org/works/20598215?view_full_work=true",
    "author": [
        "orphan_account"
    ],
    "title": "perfected by trial",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "天官赐福 - 墨香铜臭 | Tiān Guān Cì Fú - Mòxiāng Tóngxiù"
    ],
    "relationships": [
        "Huā Chéng/Xiè Lián"
    ],
    "characters": [
        "Huā Chéng",
        "Xiè Lián"
    ],
    "additional_tags": [
        "First Time",
        "Two 800-Year-Old Virgins"
    ],
    "language": "English",
    "series": "",
    "published": "2019-09-11",
    "completed": null,
    "words": "8,552",
    "chapters": "1/1",
    "comments": "218",
    "kudos": "18,445",
    "bookmarks": "2,594",
    "hits": "143,277",
    "summary": "<p>Hua Cheng has wanted Dianxia for so long he doesn’t know how to survive knowing that Dianxia is his at long last. Worse still, Dianxia doesn’t seem to have any interest in consummating their relationship, leaving Hua Cheng in the midst of his greatest trial yet: keeping his lust from consuming them whole.</p>\n<p>But a gem cannot be polished without friction, nor a man perfected without trials - and after everything, Hua Cheng will not let this trial be the one that defeats him.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>thanks to rosa, for everything.</p>\n<p>hit me up on <a href=\"https://twitter.com/silvercistern\" rel=\"nofollow\">twitter</a> if you love hualian, tgcf, or me talking about awkward first times.</p>\n<p>@earlgreyhaught drew some <a href=\"https://twitter.com/earlgreyhaught/status/1300641958348623872?s=20\" rel=\"nofollow\">art</a> of the bath scene. check it out!</p>\n<p>yu drew some <a href=\"https://twitter.com/yu101298/status/1358151827011719168?s=21\" rel=\"nofollow\">art</a> of the bath scene as well as the final scene. it’s incredible!</p>",
    "text": "Hua Cheng is good at a near infinite number of things. Swordplay, sculpture, farming, and high-level governance all fall under his purview of mastered skills. But what he is best at, above all things, requires little action at all.\nHua Cheng is very good at waiting.\nOf course that was before.\n“Oh no, I dropped it,” Dianxia huffs, mostly to himself, but Hua Cheng’s ears are sharp. The fallen brush rolls across the floor and under a set of shelves. Why does the temple even have those shelves if they were just going to cause trouble?\n“Allow me. Gege needn’t bother himself with—”\nBut it’s too late. Dianxia has lifted himself from his seat, nearly skipped across the polished floor of Quiandeng Temple, then lowered himself to his hands and knees, digging underneath the shelves for the rogue brush.\nThe view is exquisite. Enough to send Hua Cheng flying back to Mount Tonglu and the Thousand God Cavern to carve yet another statue. But why do that when the real thing is here smiling constantly and being so simultaneously adorable and stunningly powerful that it’s making Hua Cheng wonder if he is quite as good at waiting as he thought.\nThere is a room in Paradise Manor filled with pornography. Exclusively cutsleeve. And though Hua Cheng has never used it for something as pedestrian as masturbation, he has been studying it thoroughly for hundreds of years. There is no end to the scenarios he can imagine for himself and the aggressively chaste object of his affections. He could probably draw his own pornography to great success at this point despite the fact the he is, unbeknownst to his chaotic subjects, the heavens, the mortal world, and even perhaps Dianxia himself…\n…also a virgin.\nThe thought brings him no shame. He has been waiting for his beloved all of these long, long years. But now his beloved is here. Sleeping in his bed. Making him breakfast. Smiling that blissful smile when he calls out “San Lang, look at this!” and inadvertently knocks down a shelf full of incense burners. His flower crowned martial god of misfortune.\n“There wasn’t any dust under there at all, San Lang.” Dianxia rises to his feet with smooth grace. “Do your subjects clean the temple? I should thank them.”\n“That rabble? They’re not to be trusted with such a task. I make certain its clean for Gege.” And with that, he releases a storm of butterflies that swarm to all corners of the room, dusting with their little wings. A few of them are as errant as Hua Cheng’s thoughts, and they hover around Dianxia’s face, tickling him with their attentions. He snaps his fingers and calls them back, though one very rebellious one stays, the shine from its crystalline silver wings setting off a glow in Dianxia’s wide eyes. He holds up his finger and the butterfly lands, and this closeness, even through such an avatar, floods Hua Cheng’s entire being with a warmth that shouldn’t exist in his ghostly body.\nHe watches as Dianxia crosses the room, butterfly on his finger, smile on his face. He stands before him and touches his finger to the vambrace on Hua Cheng’s wrist.\n“I think this one got a little lost.”\nThere is a soft pause that floats between them. Dianxia glances to the right, then at Hua Cheng, then to the left, then at Hua Cheng again. He looks to the floor, and when he looks up, his entire body is rising, arms wrapped around Hua Cheng’s shoulders, kissing him softly.\nIn his heart, Hua Cheng still does not know how to handle himself when he is given such a gift, but he kisses back hungrily, pulling Dianxia by the waist so that their bodies are flush together. Dianxia squirms, then pulls away a little to murmur, “San Lang,” into Hua Cheng’s mouth and he is utterly lost, chasing after those lips as though they were the only thing tethering him to existence.\nThey are, really.\nThey kiss for a long time in the quiet corner of the temple, until Dianxia is pushed against the wall and Hua Cheng is nearly devouring him. Finally Dianxia’s movements slow, and with great difficulty Hua Cheng separates their mouths, tipping their foreheads together.\n“San Lang.” Dianxia is breathless, almost giddy, with lips red and puffy from Hua Cheng’s kisses, “San Lang do you want to ha—”\nHis mouth clamps shut, trapping what he was intending to say. Then, when Hua Cheng tips his head questioningly, different words pour out.\n“Dinner! Do you want to have dinner! It’s time to eat. I could make you something, or we could go into Ghost City! Some of the stalls have been making food that’s good to eat and they’re clean too.”\n“Whatever Gege wants,” Hua Cheng says, and takes a step back.\n \nA Supreme Demon King can manage the content of his dreams with complete control. In fact, Hua Cheng does not need to sleep at all, but there is little in his afterlife more delightful than waking to Dianxia’s head buried in his chest and his arms wrapped around his waist, clinging to him with ferocious strength. In order to experience it fully, he must be asleep, so he sleeps with a few sentinel butterflies and Yin Yu guarding Ghost City.\nHis dreams are montages, fragments of the moments with Dianxia that he most treasures. Some of them are horrifying, some are beautiful, some are mundane, but all of them are his. But this night, after the day in the temple and the dinner in town, his dream does not follow the pattern it is supposed to.\nWhite shoulders are what he sees first. White strong shoulders with an erotic curve to them that he fixates on. This has never happened before, this is not a memory he is reliving, but he cannot bear to wake himself up as Dianxia’s robes fall all the way off of those shoulders and land on the ground in a heap. He’s in nothing but his underwear, and they are soaking wet, leaving little to the imagination.\n“San Lang,” he turns only his head to say. Hua Cheng stares helplessly at the sculpted lines of Dianxia’s back, the curve of his ass, the muscles of his thighs.\n“Do you want to have dinner?” he asks.\n“Yes,” Hua Cheng croaks.   \nDianxia is just turning around when Hua Cheng jolts awake, disturbing the real Dianxia, who was asleep on his chest.\n“San Lang?” he asks, voice sticky with sleep.\n“Everything’s fine, Gege. Go back to sleep.”\nCompliant, Dianxia does.\nStaring down at the tent in the sheets, Hua Cheng does not. \n \nHua Cheng is significantly worse at waiting than he once thought.\nDaily, Dianxia bathes in the sprawling temple pool, as though bathing was one of the few luxuries that he deeply missed during his time wandering the earth, impoverished and alone. He is too embarrassed for company though, so Hua Cheng waits in the main hall, drawing little scribbles in the margins of his writing practice. Yin Yu attends Dianxia, bringing him freshly laundered robes, towels, soaps, and whatever other toiletries such a simple god might require.\nAppreciate and respect Yin Yu though he might, Hua Cheng finds this nearly insufferable. He places himself as close to the entryway to the pool as possible, until he is lounging against it, steadily tapping his foot. Dianxia wants his privacy, and of course, as in all things, Dianxia will have what he desires, but must that privacy be shared with another man?\nFifteen minutes in to his foot tapping wait, Hua Cheng realizes he is losing a bit of the composure he prides himself on, and he searches for the cause.\nThe cause is not Yin Yu. The cause is not Yin Yu watching water cascade through that lush hair and down Danxia’s perfect body. The cause is not another man, a man with whom Dianxia is quite familiar, seeing him relaxed and happy and naked.\nNot really, anyway.\nThe cause is Hua Cheng’s own desperate hunger.\nDianxia is chaste. So much so that he stabbed himself with a sword to avoid corruption. And physical intimacy with a demon king is probably as corrupted as he can possibly get. Hua Cheng is ready and willing to provide that corruption, but only if asked. Dianxia likes to please those around him, and Hua Cheng has certainly noticed that he likes to please him. But that can’t be the reason they consummate their relationship. Dianxia must want it himself.\nJust as he peels himself away from the wall, the soft footfalls of bare feet echo down the hall. He makes to turn around to greet Dianxia, but warm arms wrap around his waist from behind and beat him to it.\nDianxia is wearing nothing but a light inner robe, and Hua Cheng can feel the heat from his damp skin. He can also feel him smiling against his shoulder as he takes a deep breath of contentment.\nHua Cheng aches with want and love, the feelings so tangled up with each other they’re impossible to differentiate.\nMoving his arms, Dianxia turns his body so they’re facing each other, then lifts his hand up to caress Hua Cheng’s face. Hua Cheng leans his cheek into his hand and closes his eye.\n“Next time you should…” Dianxia murmurs, almost inaudibly.\n“Next time I should what?” Hua Cheng turns his face in Dianxia’s hand and kisses his palm.\n“O-oh. Ah! Take a bath! Before, or uh... after! It’s a lovely bath, you would definitely enjoy it! And Yin Yu brought this soap that smells wonderful!”\n“I have no need for baths, but I’m glad Gege enjoyed himself.”\n \nGege continues to enjoy himself. Paradise Manor and Quiandeng Temple are full of small items and details that Hua Cheng hoped would someday delight him and when they do, Hua Cheng is filled with a bone deep sense of pleasure and fulfillment. This, coupled with the fact that Dianxia has taken to expressing his happiness with stolen kisses he immediately comes up with excuses for, has led to a state of almost constant torment.\nHua Cheng wants to feel their bodies twined together, taking and giving pleasure with abandon, but he will not ask. He will not ask. Such a one as himself cannot even dream of asking.\nBut they are lying on the small table in the temple’s kitchen. It is too narrow for Hua Cheng’s legs and they dangle, but it doesn’t matter, because Dianxia is fully on top of him, kissing him hungrily. This situation developed simply because Hua Cheng stole a bite of Dianxia’s Heavenly Revolutions congee before it was served to him, and said it was delicious. Then, half scolding him, half flattered, Dianxia pressed him back against the table and kissed him soundly.\nAs though a kiss from him could ever be a punishment.\nHua Cheng sat on the table, then Dianxia climbed into his lap, then they fell backwards into the unserved bowl of congee. It’s in Hua Cheng’s hair, sticking to the pearl in his braid, but it can harden and stick there permanently as far as he’s concerned.\n“San Lang…” Dianxia kisses his name into his neck. His lips are soft and full and could probably bring Hua Cheng back to life if he wanted such a thing. He tips his head, thirsty for more, as his hands slide down from their neutral position at Dianxia’s waist, further and further until he’s wildly bypassed the rules he set for himself. Dianxia’s ass is as perfect as the rest of him, firm and round with a little bit of bounce, and when Dianxia realizes what Hua Cheng is doing he presses his forehead into Hua Cheng’s cheek and exhales a shaky, “Oh.”\nIt’s not the first time Hua Cheng has felt Dianxia’s erection, but it is the first time Dianxia hasn’t immediately pulled away. Unable to control his own hands, Hua Cheng presses Dianxia’s hips into him while thrusting up into the friction.\nThe sound this pulls from Dianxia is something that Hua Cheng will cherish for as long as he exists.\nThe sound that follows, much less so.\n“Chengzhu, Your Highness, I deeply apologize, but the stove is on fire!”\n \nYin Yu wears a mask, therefore cannot make eye contact. However, in the days that follow the kitchen incident, even his mask seems to be looking anywhere but at Hua Cheng. This would be a mild annoyance, but hardly a difficulty. What proves to be a trial, however, is Dianxia’s extreme discomfort whenever Hua Cheng’s retainer is present. He expresses this discomfort by being exceedingly kind and trying to start unnecessary conversations that he does not know how to finish. Yin Yu respectfully participates, but the resulting stilted exchanges make Hua Cheng’s teeth hurt.\nIn an effort to give Dianxia some peace, he sends Yin Yu to the heavens to convince Quan Yizhen to stop putting gold bars in the Puji Shrine again. It is not a kind assignment, but Hua Cheng has never been a benevolent ruler. \nThat leaves Dianxia to bathe alone. Which is certainly not dangerous, as he is more than capable. But as he walks down the hall, arms laden with bath supplies, Hua Cheng has to turn his back, and once more lean against the entryway so he doesn’t follow him. He taps his foot slowly, and searches for the lazy nonchalance that has carried him easily through the past eight hundred years of celibacy.\nIt is difficult to find. Images of the single time he has seen Dianxia mostly naked, of his dream of the same, flutter through his mind and his foot tapping increases in speed.\n“San Lang!” Dianxia’s voice carries down the hall and the tapping stops.\n“Yes Gege?” Hua Cheng calls back, several steps down the hall already.\n“I think I dropped the soap walking in here. Is it there?”\nHua Cheng looks down and at his feet is the reddish chunk of soap. He picks it up and tosses it once into the air.\n“It is.”\n“Would you bring it here?”\nWith such long legs, it is easy to make the distance short without seeming to hurry. Hua Cheng does not take his time. Rounding the entrance, he slows to a leisurely pace so as not to appear too eager, but his attempt at dignity is lost because as soon as he enters the room Ruoye immediately wraps around the top half of his head, covering his eyes.\n“Thank you, San Lang!” There is a splash, and then the sound of bare wet feet on tile. The steps come closer and closer then a hand wraps around both the soap and Hua Cheng’s fingers. Hua Cheng can feel the intense heat from Dianxia’s body even more than usual, and he has to make a concerted effort to keep his hand from shaking.\n“Of course, Gege. San Lang is happy to be useful.”\nThere are wet hands on his forearm, and then a soft kiss on his cheek. Dianxia has kissed his cheek probably dozens of times, but he has never been naked while doing so. Hua Cheng wants nothing more than to crush their bodies together and become one on the floor of the bathhouse but Dianxia has not asked and he deserves so much more than fucking like animals on the nearest flat surface.\nPulling away, Dianxia pads back to the bathing pool, lightly splashing as he enters the water. He talks, something about Shi Qingxuan, but the nonexistent blood is rushing too quickly in Hua Cheng’s head and it is a struggle for him to pay attention. It is only after Dianxia has gone strangely quiet that he gains control over himself, noting the noises of frustration that his beloved is making.\n“Gege?”\nSounding even more frustrated, Dianxia responds, “It’s nothing.”\n“It’s clearly not nothing. Allow me to help.”\nThere is a pause, then a sigh. “My hair is snarled around the tie. It won’t come loose.”\nHua Cheng takes a step towards the pool.\n“Be careful!” Dianxia splashes, “You’ll fall in!”\n“I built this building myself, I’m familiar with its dimensions. I won’t fall, Gege.”\nAnd he doesn’t, kneeling at the very edge of the tile, reaching out for Dianxia’s head which is right where he expects it to be.\n“Just cut it.” Dianxia sounds pained. “Don’t bother yourself.”\nIn a matter of seconds the snarl is loosened, the tie is unfastened, and Dianxia’s long hair is freed. His hands come up to scratch his scalp and bump into Hua Cheng’s hand, then he locks his fingers through Hua Cheng’s and squeezes.\n“San Lang,” he says after a very long pause.\n“Yes?” Hua Cheng squeezes his fingers back.\n“Would you… that is to say… if you want… no it’s… ah…”\n“Gege tell me.”\nDianxia takes a deep breath, as though he’s steeling to say something dreadful, but his voice when he finally speaks is soft and vulnerable.\n“Would you wash my hair?”\nHua Cheng nearly falls in the pool.\n“Nothing would please me more,” he eventually says, pulling himself together.\nDianxia squeezes his hand again and Hua Cheng can hear his quiet relieved sigh. It’s a precious sound, and Hua Cheng wants to catch it with his lips. To tell him that there is not a single thing on this earth that he would not do if Dianxia asked. But instead he lets go of Dianxia’s hand and stands, removing his boots and vambraces by hand. It would be an easy thing to just wave them away, but he needs to do something to keep from spontaneously combusting.\n“Does Yin Yu wash your hair?” he jokes, rolling up his pant legs. It is not a very good joke, because if the answer is yes, Hua Cheng will turn Yin Yu into a pile of ash, but Dianxia laughs.\n“I would never think to ask him.”\nHua Cheng’s heart crows with pride as he lowers himself to the edge of the pool, feet in the water up to the backs of his knees. It is hot, almost to the point of unpleasantness, and Dianxia’s skin must be a deep rose by now.\n“What should I wash it with?” he asks, waving his empty hands. Dianxia hands him a small bottle, all while standing out of reach. Then he takes a deep breath and steps in backwards between Hua Cheng’s legs.\nThe soft naked skin of his arms touches the insides of Hua Cheng’s calves and it is all he can do to keep from diving into the bath fully clothed. Instead he sharply sits down the bottle and with both hands, drags Dianxia’s hair away from his shoulders. His fingers linger on his clavicles, sliding slowly over the skin stretched over bone and Dianxia’s light gasp fills the room.\n“Why does Gege want his hair washed today?” Hua Cheng makes a show of moving stray hairs off of Dianxia’s shoulders, but in reality there is nothing there, just his fingertips against soft skin. “You do a fine job on your own.”\n“I… I…” Dianxia stammers as Hua Cheng’s fingernails slide down his bare back. There is no excuse for such an action, but Hua Cheng has never needed an excuse to do anything. “I thought San Lang would be good at it.”\nHua Cheng smiles wickedly. “I’ve only ever washed my own hair. Gege will have to tell me if I’m doing it incorrectly.”\nDianxia is about to say something, but his words fall to aborted sounds when Hua Cheng buries his fingertips in his thick hair, nails scraping against his scalp. Hua Cheng wants to see, and in reality he could simply let a butterfly loose in the room and see everything. But Dianxia wishes to stay hidden, and Dianxia’s wishes will be obeyed.\nHe massages Dianxia’s scalp, feeling him lean further and further into the space between his legs, his back pressed to the inside of Hua Cheng’s thighs. Hua Cheng can feel his ribs expand and contract with his steadily increasing breaths. The want is so relentlessly present, so exquisitely painful that Hua Cheng has to remove his hands and grab onto the edge of the bath.\n“San Lang?” Dianxia begins to turn and comes dangerously close to a part of Hua Cheng’s anatomy that he’d rather him not be aware of at the moment. Hua Cheng grasps him by the shoulder and turns him straight ahead, while reaching for the small bottle, which he uncorks. The scent of jasmine fills the air, light and delicate, as Hua Cheng pours what seems to be liquified soap into his palm.\n“Lean back and wet your hair,” he says softly and Dianxia obeys dutifully. Hua Cheng wants to see him, hair a halo floating on the water, but all he can see is Ruoye, who is extremely boring.\nWhen Dianxia is upright again, Hua Cheng works the soap through his hair, piling the long ends on the top of his head and burying his fingers into his scalp. Dianxia has leaned back completely in the crook of his legs, certainly aware of Hua Cheng’s affliction at this point. But he doesn’t seem to care, as the air is full of his soft sighs and moans. The scent of jasmine is ubiquitous and Hua Cheng is never going to be able to smell it again without getting hard.\nHis control is holding on by a thread, so he pulls his hands from Dianxia’s hair and tells him to lean back and rinse. He returns his hands to the side of the pool, squeezing tightly, mentally reciting the names of the gods in the heavens in an effort to calm down.\nWith a heavy splash, Dianxia stands upright unexpectedly and hoists himself out of the pool to sit at Hua Cheng’s side. And not for a single second can Hua Cheng forget that he is naked. Water dripping from his body is soaking Hua Cheng’s clothes.\nBefore he can react to the hands grasping his collar, Dianxia is kissing him. At first it is tentative, soft lips gently sliding against Hua Cheng’s own. Hua Cheng anchors his hands to the side of the pool in a desperate effort to keep from taking Dianxia right there on the floor. But Dianxia’s soft kisses grow in fervor and he moves from kneeling at Hua Cheng’s side to sitting on Hua Cheng’s lap.\nThere is a sharp crack as the tiles shatter underneath Hua Cheng’s fingers.\nThe restraint the situation requires allows Hua Cheng to do little other than sit helplessly and be kissed out of his mind. He is so hard, and Dianxia is too, his cock rubbing against Hua Cheng’s soaked tunic, feeling like there is nothing between them. Dianxia is relaxed from the bath. Opening him would be painless, he could take Hua Cheng easily for the first time. There is ceremonial oil in the temple proper. He could lay him down on the alter and worship him the way he deserves to be worshipped.\nHua Cheng raises his hand, touching Dianxia’s lower back, then sliding down to cup his ass.\nAnd then, unexpectedly, Dianxia stiffens and pulls away.\nHe clamors to his feet, skittering around the tile, probably redressing, all the while speaking nonsense.\n“San Lang I’m sorry but I have to— well, the heavens you see. Ling Wen… there’s a problem and I have to go now, and I’m sorry your clothes are all wet I’ll buy you new ones! I’m sorry I have to go. Ruoye, come!”\nVision rapidly returns, just in time for Hua Cheng to see Dianxia’s retreating figure leaving the bathing pool and then ascending to the heavens.\nWith a blink of his eye, Hua Cheng’s clothes are dried and his boots and vambraces are back on.\nHe sits by the temple pool for a long time.\n \nThough he likely knows more about Dianxia than anyone in existence, Hua Cheng does not know everything there is to know about him. He will never know all there is to know about him because Dianxia is beautifully complex and grows and changes every day. But in this area especially, he admittedly knows very little. Dianxia has no past sexual history to uncover. He doesn’t even have any past handholding to uncover. Every single thing the two of them do together is the first time for them both. And Hua Cheng is confident, he has no doubt that if they were to come together it would be more than spectacular, but getting to that point confounds him.\nDianxia’s spiritual power when he was human relied on abstinence. What would happen if he forsakes that abstinence now that he’s a god? Certainly Hua Cheng has enough spiritual power for the two of them, but to strip Dianxia of his power now that he is finally free from those cursed shackles would be a travesty.\nIf it were anything else, Hua Cheng would bring it up. They would talk about it and come to a resolution. But Hua Cheng is unworthy to even look at Dianxia. To ask that he give himself to him, especially when that has the possibility of wrecking Dianxia’s standing, and especially when Dianxia continually pulls away from intense physical intimacy would be madness. He will not ask under these circumstances. He will not push. He will adore him at whatever distance Dianxia requires.\nSo Hua Cheng resolves to keep his hands to himself.\n \nDianxia returns from the heavens that night. He does not say what happened, if in fact anything did happen, but he does wrap himself around Hua Cheng immediately. Hua Cheng holds him close, guiding him onto the futon where they can lie side by side in each other’s arms. Dianxia plays with his braid for a few moments until reaching up to kiss him. Hua Cheng returns the kiss chastely. They kiss back and forth, innocently, for several minutes until Dianxia pulls away, a confused look on his face.\n“Is everything alright, San Lang?”\n“Everything is fine, Gege,” Hua Cheng lies. \n“Alright then,” Dianxia sighs into his neck, curls up, and falls asleep in his arms.\n \nTheir kiss in the morning is usually long and lingering, but Hua Cheng cuts it short, getting out of bed as soon as possible. Left alone on the bed, Dianxia is sprawled out looking especially fuckable and it is hard enough to leave him during normal circumstances, let alone now. Hua Cheng wants to press him into the bed until they can’t tell their bodies apart. But this is something he cannot do, so he leaves, claiming business in Ghost City, when in reality he goes to see the one person who can always make his problems seems mild in comparison.\n“What are you doing here?” Black Water asks over a mouthful of some unknown and very questionable meat.\nHua Cheng begins to answer and then realizes halfway through opening his mouth that he hasn’t thought through an excuse and he is too distracted to come up with one.\n“Look if you need a break from that eager lover of yours, why not go find some upstart to fight? Start shit in the heavens again. Leave me to eat in peace.”\n“I don’t need a break,” Hua Cheng denies.\nBlack Water wipes his mouth daintily with a napkin. “Look I don’t care, so why are you lying to me?”\nOpening up to the only other Supreme who isn’t batshit crazy was not Hua Cheng’s plan.\n“Why would I tell you the truth?”\nBlack Water shrugs and starts eating again, “Well, maybe tell him the truth then?”\n \nHua Cheng returns to Ghost City to find Dianxia sitting crosslegged on the alter in Quiandeng Temple, answering prayers. He doesn’t hear Hua Cheng approach at first, so Hua Cheng is given a moment to watch his unguarded expressions. Some of the prayers make him laugh, some of them leave him thoughtful, and some of them make him very unhappy. Hua Cheng is struck again by Dianxia’s deep well of compassion that seems to never run dry.\nWhen Dianxia finally notices him, he is all smiles, hopping off the alter to run across the room and throw himself into Hua Cheng’s arms.\n“Was San Lang’s errand successful today?”\n“Successful enough.” He pulls out a tiny white flower and puts it in Dianxia’s hair. “How are the prayers?”\n“There were several very upsetting ones. I am going to try my best to help, but as a martial god, I can’t heal the sick particularly well.”\nHua Cheng lifts his chin, “Some things are just meant to happen, Gege. But if San Lang can help in any way…”\nRising onto his toes, Dianxia kisses him, wrapping his arms around his neck. It is an urgent kiss, hungry for more, but Hua Cheng very unhappily leaves him wanting, only responding in a cursory way, his hands still and unmoving at his waist.\n“San Lang,” Dianxia pulls away. His eyes are concerned and it’s painful to see but Hua Cheng has no other option. “Are you alright?”\n“I’m fine, Gege,” Hua Cheng lies, placing a kiss on Dianxia’s forehead.\nThat seems to appease him and he steps back, turning towards the alter again. “There are a lot of prayers, and some of them are for both of us. Would you like to listen to them together?”\n“Of course.”\nThat night, as Dianxia sleeps, Hua Cheng watches him, brushing the hair off his face and gently kissing his eyelids, whispering words of love and adoration.\n“I’m sorry this one is not better at waiting, Dianxia.”\nHe does not sleep at all that night.\n \nLeaving bed before dawn, Hua Cheng presses a lingering kiss on Dianxia’s forehead. He would leave a note, but it would be indecipherable, so instead he places a small pile of water chestnuts on the bedside table, assuming Dianxia will understand.\nHe does not want to go, but the pent-up energy from holding back is boiling under his skin and needs to be let out in some physical way. Helping the farmers in Puji Village has always been diverting, and he joins them once again in his teenage form, barefoot and planting rice. They are happy to see him, and ask after his wife. The sun is intense on his neck and face, but he bears it as a sort of penance. A few times Dianxia calls out to him in the communication array, but he doesn’t answer.\nAfter the planting is done, he tends to the shrine, though there is little that requires tending as the local villagers and even those from other towns have begun to fervently worship Dianxia. It is a strange feeling, no longer being the last believer. He is proud, so proud, that Dianxia has returned to the glory he deserves, but it is strange not to be alone. Hua Cheng would never claim not to be a jealous man, and more than a small part of him wants Dianxia all for himself.\nThat’s just the problem. He wants, wants much more than he deserves.\nThe door to the shrine slams open revealing Dianxia. He looks angry, and the sight is breathtaking. \n“San Lang, something is wrong, and you… you are going to tell me what it is!”\n“Look at that thing!” the villagers cry from outside. “Are those living skeletons?” \n\n“It must be safe if Daozhang rode in on it.” \n\n\n“No A-Yao don’t touch it!” \n\n“Gege brought the sedan chair I see.”\n“I tried the dice in Paradise Manor and I ended up in the middle of the ocean. And I can’t draw distance shortening arrays very well. So this was all that’s left. The villagers won’t mind it. Why weren’t you answering in the communication array?”\n\n“A-Yao do not climb in that thing!” \n\n“I’m sorry I made Gege worry. I was just blowing off some steam.”\nAnger bleeds to hurt on Dianxia’s face. Hua Cheng has experienced many kinds of suffering in his long existence, but never before has he been the one to hurt his beloved.\n“Steam? Why? You haven’t…” Dianxia bites his lip and looks down, humiliated, another terrible emotion that Hua Cheng has caused, “you haven’t touched me the way you usually do for days. Has San Lang grown tired of—”\n“No!” his voice rattles the shrine to its foundation. “That will never happen.”\n“Then what?” Dianxia boldly raises his chin, sounding very much like the crown prince that he is. “If something is wrong, allow me to help you. You are my precious someone. I refuse to have you suffer alone.”\nThe words precious someone lodge themselves in Hua Cheng’s heart and fill him with so much happiness he can almost forget that he has done something so unforgivable as to hurt the one he loves.\n“Administering the city has taken its toll lately—”\n“You are lying,” Dianxia says softly. “San Lang please, you don’t have to lie to me.”\nBored of the sedan chair, the villagers are now surrounding the shrine, listening in on their conversation. Taking Dianxia by the waist, Hua Cheng pulls dice out of thin air, rolls them in front of the door, then at the sight of two sixes steps through into their bedroom at Quiandeng Temple.\n \nQuiandeng Temple is beautiful, and the few worshippers who come to Ghost City themselves are struck by its radiance. But the most beautiful room in the temple is not open to the public. It is the place where Dianxia sleeps. The bed is enormous, covered with pillows and silks in pure white and golden thread. The walls are painted with beautiful murals of Dianxia’s life. Sheer fabrics hang from the ceiling shot through with night pearls and diamonds, effusing the entire room with a soft glow.\nHua Cheng is not certain why he brought them here, other than it would be private. His composure is completely shattered and his normal habit of thinking twelve steps ahead is gone.\nDianxia turns at his side until they’re facing each other. He raises his hand, brushing the loose hair out of Hua Cheng’s face, and as he does Hua Cheng shifts into his true form.\n“Tell me, San Lang,” Dianxia holds his cheek so that they’re making eye contact. “No matter what it is, I won’t be upset.”\nHua Cheng laughs a little. “How can you be so certain?”\n“Because San Lang would never do anything to upset me. Well, except ignore me on the communication array. And try to die for me. Please don’t do either of those things again.”\n“I can only promise the one.” Hua Cheng smiles wryly.\n“You’re changing the subject.” Dianxia strokes his hair. “Why won’t you touch me? Don’t you want me anymore?”\nHe’s backed into a corner. There’s nothing he can do to get out of it, so he just exhales and the words collapse to the floor in a heap.\n“It’s not a question of not wanting. I want… too much. More than I deserve, more than Dianxia can give.”\nDropping his hand, Dianxia turns and takes a few steps around the room then looks at him, face earnest. “Deserve? San Lang there is no one in the world more deserving of anything he wants than you. Whatever you want from me, I’ll freely give it!”\nHua Cheng grits his teeth. “Do you even know what you’re offering?”\nIn the hazy light from the night pearls, Dianxia’s blush is beautiful. “I’m not a child. Haven’t you noticed? I’ve been trying to get San Lang’s attentions. But… it’s… I’ve never done these things before. I don’t know how…”\n“But,” Hua Cheng says, “Gege runs off or changes the subject.”\n“You know so much about me,” Dianxia takes a step forward, “but you couldn’t tell that I was just embarrassed? Or did you just not want to believe, so you could maintain this illusion that San Lang is somehow less than me?”\nThe words hit Hua Cheng in the stomach, but that’s not everything. “But… your cultivation. Your spiritual powers.”\n“My spiritual powers depend on my worshippers. Once many knew I was abstinent and would lose faith if I ceased to be so. Now? The only worshipper who knows I cultivated an abstinent life is you, and I don’t think you’ll change your mind about me if I’m no longer a virgin.”\n“Oh,” Hua Cheng exhales.\nDianxia’s chest is rising and falling rapidly, worked up over their conversation. His eyes are bright and flashing, full of deep conviction when he speaks.\n“San Lang, allow me to be as plain as possible. I want you to fuck me until I cannot walk.”\nHua Cheng staggers backward and catches himself only by sitting on the bed.\nThe blush on Dianxia’s face has deepened. “I leave myself in your care.”\nThere is a long pause where they simply stare at each other across the bedroom. Dianxia looks somehow triumphant and completely vulnerable at the same time, blushing all the way to the tips of his ears.\nHua Cheng laughs. Startled, Dianxia gives him a look, but in two steps, Hua Cheng has him wrapped in his arms, and leans down to whisper in his ear, “I leave myself in your care as well.” He pulls away slightly so he’s looking down at Dianxia’s face. “I’ve never done these things before either, Gege.”\n“O-oh,” Dianxia seems shocked, but he doesn’t get a long time to hold that expression, because Hua Cheng is kissing him with all the passion he’s withheld for the past few days. Dianxia wraps his arms around his neck and pulls him closer, and they stagger backwards, falling into the futon in the corner of the room.\n“So after you dropped that brush and we were kissing,” Hua Cheng kisses his neck, “you wanted to ask me to do this?”\n“E-En.”\nHua Cheng chuckles, spreading apart the collar of Dianxia’s clothing to kiss down his chest. “And on the kitchen table, did you want that to go farther?”\nDianxia nods, then gasps when Hua Cheng sucks a mark into his collarbone.\n“Did you want me to join you in the bath?” He steps back, then pulls Dianxia to his feet. He looks disheveled already, robes in disarray, marks scattered across his neck and clavicle. \n“Yes.” Dianxia’s chest heaves. “I wanted that very much. I almost pulled you in.”\nHua Cheng kisses him again.\n“I’ve only ever wanted Gege,” he murmurs into Dianxia’s ear, “and if I can have him, my greed will be legendary.”\nDianxia shudders as Hua Cheng works to loosen his sash.\n“I’ve never… worldly pleasures were something I was accustomed to avoiding. But I have wanted you so badly that I’ve already broken my vow many times.”\nAt the thought of Dianxia touching himself with Hua Cheng’s name on his lips, Hua Cheng’s hands fumble. “Gege if you had just told me, I would have eased your suffering.”\n“If you would have asked,” Dianxia laughs lightly as the sash is undone and his robes fall open and unto the floor, leaving him covered only by his underobe. He reaches up and undoes Hua Cheng’s cape, letting it flutter to the floor, then pulls his tunic over his head. They battle to remove each other’s clothing until they’re standing shirtless in their underwear in the middle of the room.\nDianxia’s face blossoms with color again and nearly naked as he is, Hua Cheng can see the pink that stains his face is covering his chest and shoulders as well. Before he can softly touch, Dianxia surges forward and wraps his arms around him, their bare skin touching.\n“I don’t understand,” Dianxia murmurs into his shoulder, “your skin is never cold when we’re like this.”\nHua Cheng kisses him, walking him backwards towards the bed. The back of Dianxia’s legs touch the edge and he falls across the sheets, sprawled out invitingly, blush still thick on his face. And Hua Cheng may not be the only worshipper any longer, but he is the only worshipper who can worship like this.\nHe lowers himself to his knees and hooks his fingers in the band of Dianxia’s underwear. It would take just a single action to slide them down his legs, but Hua Cheng is paralyzed. He has dreamed of this, longed for it for so many years. Now he can hardly believe it’s about to happen. Hardly believe himself deserving.\nDianxia props himself up on his elbows. His lips are swollen and he’s covered in marks. Marks that Hua Cheng put there. “I want San Lang to touch me.”\nWorshipfully, Hua Cheng lowers Dianxia’s underwear until his hard cock pops free. He focuses on sliding the material down his legs, giving himself a moment to stay calm. And then he looks.\nIt’s perfection, and Hua Cheng slowly reaches out to touch it, lightly running his fingertips across the weeping head. Then he leans forward and kisses it, feeling the heat against his cold lips. The more he touches it, the less he can stop until he is licking long stripes from the base to the head, pulling delicious sounds from Dianxia’s mouth.\n“San Lang… what are you doing?” Dianxia pants, eyes and mouth wide. And he must know, he can’t not know, but just in case he doesn’t… \n“I’m going to take you into my mouth until you come, Dianxia.”\nAnd before he can protest, Hua Cheng does. No amount of wishing will make him skilled at this, but luck is another matter entirely. But lucky though he is, that does not prevent him from choking once when he tries to take him deeper, or grazing his teeth where they do not belong. He stares in fascination as Dianxia watches him, hand covering his face in embarrassment, eyes peeking out through his fingers. Hua Cheng remembers the muffled moans from the Land of the Tenders, but they were nothing compared to the sounds Dianxia is making now. His hips occasionally thrust upwards, as though he cannot control himself, and Hua Cheng wants him to let himself go completely. To fuck into his face until he finds his completion. But Dianxia is too polite, and holds himself back until the very last.\n“San Lang, San Lang, San Lang, San Lang,” he chants as his body stiffens and he spills his essence into Hua Cheng’s mouth. He collapses backward on the bed as Hua Cheng swallows. Looking down at him, Dianxia looks thoroughly debauched, his hair in disarray, his skin red, his eyes filled with tears, and his cock, still hard, dripping on his stomach.\n“How do you feel, Dianxia?” Hua Cheng climbs onto the bed and lies on his side next to the disheveled crown prince.\n“Let me.” Dianxia reaches feebly for Hua Cheng’s underwear, too embarrassed to answer.\n“Ah. No.” Hua Cheng catches his hand. “I believe there was something specific that Dianxia wanted…”\nIt should not be possible for Dianxia to get any redder, but the impossible occurs.\nHua Cheng kisses him, long and slow, knowing full well that Dianxia can taste himself in his mouth. “Dianxia must forgive me for my… preparations,” Hua Cheng murmurs before he rolls over, reaches into a cabinet next to the bed, and pulls out a vial of oil. “But I thought just in case someday he wanted this…”\nHe opens the oil and pours it liberally over three of his fingers, while Dianxia’s eyes grow truly enormous. “Does Dianxia know what I’m going to do?”\n“Yes…” Dianxia lays his forearm across his eyes to hide himself, “but that doesn’t change the fact that it… it…”\n“San Lang can stop if Dianxia wishes.” Hua Cheng lies on his side again, spreading Dianxia’s legs apart and caressing the top of his thigh.\n“No,” Dianxia chokes, “I want it! Just…”\n“Am I the only person Dianxia get embarrassed in front of? He doesn’t seem to mind much of anyone else. Of course, if anyone else did this,” Hua Cheng caresses Dianxia’s ass, then gently presses a finger in between his cheeks. “I’d be displeased.”\nDianxia does not make a sound, but his face looks pained.\nHua Cheng leans forward to kiss the shell of Dianxia’s ear. “I know you can easily ignore the pain, but this is not supposed to hurt, so if it does Dianxia must tell me.”\n“How does San Lang know of all this if he’s never done it before?” Dianxia asks instead of answering, still hiding himself behind his arm.\n“Careful study, but Dianxia did not answer my question.”\n“It feels eh… uncomfortable. But it doesn’t hurt. But how… can this be pleasurable to you?”\nHua Cheng smiles.\n“Dianxia, if you could see yourself, you’d know. Actually,” he snaps his finger and from his vambraces on the floor pour hundreds of butterflies that assemble themselves overhead into a reflective surface. With his free hand, he catches Dianxia’s wrist and pulls his arm down.\n“Look at you,” he murmurs. “Look at the mess you’ve made of your hair. Look at the marks I’ve put on your body. Look at how red you are. Look at the tears in your eyes. Look at the little puddle of cum on your stomach.”\nHe inserts another finger and Dianxia’s breath stutters, but he keeps looking at the mirror.\n“Dianxia is resplendent, worthy to be worshipped at all times, but especially now.”\nHis love exhales raggedly, trembling underneath the hand that’s holding him down. Hua Cheng knows that if he truly wanted to, he could throw Hua Cheng through the wall and the thought makes his cock twitch.\nHe slowly works Dianxia open, scissoring his fingers, then adding a third, all while whispering in his ear.\n“Dianxia has waited so long to experience pleasure. And I am not worthy to be given such an honor, but I will please him until dawn if he so demands.”\nAs he pulls away, he uses his thumb to brush away the tears that have gathered at the corners of Dianxia’s eyes. Then he presses their foreheads together.\n“What does Dianxia want of me?” he asks softly, closing his eye.\nDianxia raises his hand to touch Hua Cheng’s cheek. He smiles wide enough to bring sunlight into the softly glowing room.\n“San Lang, I have never wanted anything more.”\nHua Cheng loses all sense of self restraint.\nWith a quick roll, he is covering Dianxia’s body with his own, biting his neck and shoulders with complete abandon. He feels work-rough hands slide down his sides and grasp his underwear, and then they are ripped in half and thrown across the room. And for the first time, they are completely skin to skin. Hua Cheng has waited eight hundred years believing that this was something he could never have, that he was not worthy of, and now, Dianxia’s skin is touching his.\nHe doesn’t have to breathe, but he’s panting, head bowed, resting on Dianxia’s chest.\nHands grasp and lift his face, and Dianxia is there, looking at him with a soft smile, then pulling him in for a deep kiss. “We have forever, San Lang,” he says against his lips.\nBut Hua Cheng cannot possibly wait any longer.\nHe slides his arms down Dianxia’s body, hooking them behind his knees and lifting his ass off the bed. Dianxia’s foot dangles next to his head, so he turns and kisses his ankle, earning him a gasp that he files away for future reference. He slides his body more securely in between Dianxia’s legs, letting go of one of them so he can guide himself inside. He slicks himself up with the oil lying on the bed, then he freezes, overwhelmed.\nHe’s never done this before. Dianxia deserves incredible and Hua Cheng for once cannot guarantee that he’ll receive that experience.\nEverything grinds to a halt, and the two of them lie there in the hazy light, panting heavily.\nThen.\n“San Lang.”\nDianxia voice is regal as he grabs Hua Cheng by the hair and pulls, long and hard.\n“I asked you to fuck me.”\n“As Dianxia wishes.” Hua Cheng breaks into a grin and pushes himself inside.\nHe is so hot.\nAnd so tight.\nAnd so incredibly soft.\nHua Cheng’s arms tremble as he looks down to see Dianxia staring back up at him, mouth open panting desperately, eyes beseeching. He pulls back, and with the movement, Dianxia bites his lip. Hua Cheng wants to be gentle, but his thrust forward is desperate and harder than he intends. But Dianxia’s eyes rolls back in his head and he throws his head back into the pillow, the cords in his neck tight. Hua Cheng reaches for his hands and presses them down into the bed as he pulls back and thrusts again, causing Dianxia to cry out.\n“PLEASE!”\nHua Cheng’s self-control evaporates, and he does what Dianxia has been asking all along. He gathers both his wrists with one hand, pins them down into the bed, and he begins to fuck him within an inch of his life. This is his first time, but he has studied, and he is very, very lucky, and the inferno of Dianxia’s body is making him strive to be better than he ever thought possible.\n“Is this what you wanted,” he murmurs into Dianxia’s ear while he slams into him.\n“E-en.” Fat tears run down Dianxia’s cheeks, and his voice is hoarse from wailing.\n“Do you want to come?” he asks, very much on the verge himself.\n“Please,” he sobs, “please, San Lang.”\nWith his free hand, Hua Cheng takes Dianxia’s cock and begins stroking it in time with his thrusts. The reaction this elicits is gratifying in the extreme. Dianxia squirms, then arches his back, then begins to thrust into Hua Cheng’s hand while he is getting fucked. Hua Cheng kisses his neck, his chest, and he feels Dianxia’s body tighten beneath him, driving him closer and closer to his own completion. He can barely hold himself up anymore the waves of pleasure are too strong. And then—\n“SAN LANG!” Dianxia cries, pulled taut beneath him. Hua Cheng feels the heat spurt between their bodies, then he is coming, pulling Dianxia as close to him as possible, burying himself and his essence deep inside. Dianxia clings back just as tightly, his heavy pants echoing in Hua Cheng’s ear, his every muscle trembling.\nStill joined together, they collapse. Hua Cheng’s mind is blissfully blank, but he’s clearheaded enough to roll to the side, pulling out. Dianxia clings to him, burying his head in his chest and covering it in soft kisses. Hua Cheng kisses the top of his head and strokes his hair.\nAn indeterminate amount of time passes until…\n“Is Gege satisfied?” Hua Cheng asks lazily. Dianxia’s sweat is cooling between their bodies, and the soft light of the room accents the dozens of marks on his neck and shoulders and the fingerprint bruises on his back.\nDianxia lifts his head. His face is full of smiles as he sweetly replies, “No.”\nHua Cheng swallows, confounded for a moment, all his deepest fears rushing to the forefront of his mind, before Dianxia continues.\n“I think I can still walk.”"
}