{
    "id": "20648324",
    "url": "https://archiveofourown.org/works/20648324?view_full_work=true",
    "author": [
        "aloneintherain"
    ],
    "title": "lessons in tea making",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Avatar: The Last Airbender"
    ],
    "relationships": [
        "The Gaang & Zuko (Avatar)",
        "Iroh & Zuko (Avatar)"
    ],
    "characters": [
        "Zuko (Avatar)",
        "Iroh (Avatar)",
        "Aang (Avatar)",
        "Sokka (Avatar)",
        "Katara (Avatar)",
        "Zuko's Crew (Avatar)",
        "Yue (Avatar)"
    ],
    "additional_tags": [
        "tea boat AU",
        "Ozai (Avatar) Being a Terrible Parent",
        "Alternate Universe - Canon Divergence",
        "Role Reversal",
        "the gaang keeps kidnapping zuko",
        "AU: Zuko joins the gaang early",
        "Hurt/Comfort",
        "Humor",
        "Platonic Cuddling",
        "Tea Server Zuko",
        "Abandoned Work - Unfinished and Discontinued"
    ],
    "language": "English",
    "series": "",
    "published": "2019-09-15",
    "completed": "2024-06-13",
    "words": "40,584",
    "chapters": "2/2",
    "comments": "1,234",
    "kudos": "20,895",
    "bookmarks": "7,147",
    "hits": "217,438",
    "summary": "<p>AU where Zuko realises early into his banishment that Ozai is an abusive bastard who sent him on a wild goose chase. Iroh turns their decommissioned warship into a floating tea shop, and Zuko settles down as a tea server onboard the Jasmine Dragon.</p>\n<p>And then, years later, the Avatar emerges from the iceberg.</p>\n<p>And then Aang decides that he wants Zuko, the first good firebender he’s met this century, to be his firebending teacher - even though Zuko wants nothing to do with him.</p>\n<p>Based on <a href=\"https://captainkirkk.tumblr.com/post/184055844267/logo-comics-captainkirkk-au-where-zuko\" rel=\"nofollow\">this tumblr post</a>.</p>\n<p>(Please note: This fic is technically unfinished/abandoned, but contains end notes with my original plans to wrap-up the fic)</p>",
    "notes": "<p>This started off as a post on tumblr that spiralled out of control. So many people have contributed to the making of this fic--from helping to flesh out this universe, to helping fund it, to supporting me through the long process of writing this beast, to being a beta reader. Can you believe this thing was originally going to be ~15k? Final word count is closer to 45k.</p>\n<p>Thank you to everyone who has been involved along the way. This fic wouldn’t exist without every one of you x</p>\n<p>Edit: Now <a href=\"https://ficbook.net/readfic/9347357\" rel=\"nofollow\">translated into Russian</a>.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>I want to start by saying a HUGE thank you to everyone for your ongoing support with this fic. I’ve been blown away by the love this fic received both on ao3 and on tumblr. The atla fandom is such a welcoming and fun space and I love you all a lot xx</p>\n<p>Now for the hard part: I have to admit that this fic got ahead of me. I originally intended to make this a full series rewrite, but the plot grew out of control and it’s been almost 5 years of me trying to wrangle it with limited success. It’s time to finally admit defeat. I considered leaving this fic uncompleted, but the consensus on my tumblr seemed to be that people wanted to see the rest of my unfinished draft. So here it is! Half of Book 2 is done and there’s some very brief scenes of what was going to be Book 3 at the end of this chapter. <b>Please note that this chapter is unfinished/technically my wip and so has missing scenes and plot holes.</b> There won’t be a chapter 3 like I’d originally intended, but I’ve included some of my notes/ideas at the end. There’s also some old posts on my tumblr under the ‘tea boat au’ if you want to live in this universe for a little longer.</p>\n<p>If anyone would like to write for this universe or pick up chapter 3 in my stead, please feel free! I’m more than happy for people to play in the space.</p>\n<p>Thanks again for all your love xx happy reading</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Thanks again to everyone for being so wonderful and for sticking around for so long</p>\n<p>Come chat with me at captainkirkk.tumblr.com</p>\n<p>Fire Lord Zuko and Chief Yue being world leader!BFFs is everything to me. Chief Arnook seems very healthy and competent in canon and the Northern Water Tribe still has a while to go before Yue can become chief, but - one day.</p>\n<p>You can support me on tumblr at <a href=\"https://captainkirkk.tumblr.com/\" rel=\"nofollow\">captainkirkk</a></p>\n<p>Thank you for reading!</p>",
    "text": "Zuko was confrontational, once. He trained himself out of it--learned to bite his tongue at war meetings and the dinner-table, in front of snide customers and rude vendors who refused to sell to gold-eyed strangers.\nBut, sometimes, everything builds inside him. An alarming number of Fire Nation warships have been sighted lately, and the weather is still cold, which makes him miss the humidity of Caldera City, which makes him feel twisted-up inside because the thought of returning to the Fire Nation makes him sick--\nIt’s almost a relief when he hears the bitten-off scream. He follows the sound into a back alley, and finds a group of three--and an elderly merchant guarding his purse.\nThe bald man eyes him up and down. Zuko has been a tea server for almost three years, and he dresses like one, too. He’s not worth robbing.\n“Fuck off, kid.”\nZuko pulls a knife out of his waistband, the pearl hilt flashing in the moonlight. “Leave him alone.”\nThey laugh, a rough sound that echoes down the alleyway. The merchant looks like he’s going to cry. He looks older than Uncle.\nZuko readjusts his hold on the knife, warming it just enough for the metal to flash gold. They stop laughing, then.\nThey rush him, and he kicks out, a ribbon of yellow fire following the arch of his foot, pushing them back. He dispatches one, and then two, and then whirls on the third. The man spits, “Ash-maker,” and Zuko jumps off the wall and knocks him out with the hilt of his knife.\nThe men are sprawled, unconscious, around him. The merchant had slipped away during the fight.\nZuko stashes his knife away. He’s bruised, he can feel it. Before he goes to breakfast tomorrow, he’ll have to check to make sure everything is covered by his clothes, or else he’ll have to deal with the crew’s fussing.\nAnd then someone says, “You’re a firebender.”\nZuko turns. In the mouth of the alleyway is a boy. He’s small and brightly coloured, like a bird that’s flown too far South.\nZuko is awkward when customers bring their children onto the Jasmine Dragon, which only makes the crew laugh at him and Iroh grin into his tea. He has no idea how to make this kid go away without scaring him.\nBut he will scare him, if he has to.\nMost people see the Jasmine Dragon with its kitschy second-hand furniture and hand-painted signs and understand that it is both Fire Nation and harmless. That’s not always the case, though. Some people can’t fit the words firebender and innocent together.\nIf this kid goes running through the dark marketplace screaming his head off about a firebender, they’ll get run out of port. Again. And Uncle always looks so sad when they have to escape from angry mobs …\nBut the boy just bounces closer. And smiles. At Zuko. “I told Katara and Sokka that good firebenders existed!”\nThe boy steps into a patch of moonlight, and Zuko sees his big eyes, his orange and yellow robes, the blue arrow tattooed on his forehead.\nZuko knows that symbol, those colours. Before Uncle had fished him out of his fixated depression, he had spent weeks hunched over century-old scrolls, staring at illustrations of long-dead Air Nomads.\n“I’m looking for a firebending teacher,” says the airbender. He’s so young and earnest. Zuko is going to throw up on his shoes. “Will you teach me?”\n“You’re an airbender,” Zuko says.\nThe boy cocks his head to the side. “Yeah?”\n“And you need a--”\n“Oh.” The boy laughs. “Yeah, I’m the Avatar!”\nZuko pushes past the kid--the Avatar--and sprints through the port, shoving desperately through the crowd as he goes. The airbender calls after him, “Where are you going? Hey! Wait!”\nBut Zuko’s lungs are too tight and his vision is beginning to tunnel. He runs up the plank of the Jasmine Dragon and through the familiar corridors, tearing past the baffled crew.\nWhen he’s safe in his locked room, Zuko topples over, landing on his knees. He doesn’t have the Air Nomad scrolls anymore. Uncle convinced him to return them to the Air Temples where they belonged--not just because it was the right thing to do, but also to stop him from being tempted to keep searching for the Avatar. He doesn’t need the scrolls, though. He knows what he saw. He knows.\nHe had abandoned his hunt for the Avatar three years ago.\nBut it seems that the Avatar had found him anyway.\n \n \n \n \n \nUncle knocks on the door. “Zuko? Are you alright? Jee said he saw you return from the markets in quite a state.”\nZuko buries his face in his knees. It had been some time since he had had such a violent panic attack, and now he just feels weak. Drained of all his energy.\n“Nephew? Please open the door.”\n“Go away, Uncle.”\n“Are you hurt? If you’re hurt--”\n“I’m not hurt!” Zuko’s voice cracks. He closes his eyes, shoves his face in his knees. “Go away.”\nThere’s silence. Then: “It’s just me, Zuko. I want to see if you’re alright. Please don’t push me away again.”\nZuko will never be able to refuse Uncle, not after everything he has done for him. Not after Zuko decided all those years ago that, if he didn’t want to keep living for his father or his people or even himself, then he would keep living for Uncle.\nHe gets up on shaky legs and unlocks the door.\nUncle looks at him with those keen eyes and pulls him into a hug. Zuko sinks into it.\n“Uncle,” he chokes out, “I saw him.”\n“Who?”\n“The Avatar. I used my firebending when I wasn’t supposed to and this boy with airbending tattoos ...”\nHe can feel his throat closing up again.\nUncle closes the door. He guides him to the low table, his hand never leaving Zuko’s back.\n“Do you want to chase after him?” Uncle asks.\n“No. I gave that up years ago. I don’t want to go back to--” My father. “--the palace. The Jasmine Dragon is my home now.” A thought occurs to him, then. Though Uncle has always seemed so happy running this floating tea shop, entertaining customers below his social status, he has always been very aware that Uncle’s main reason for staying was because Zuko couldn’t return to the Fire Nation. “Do you want to go home, Uncle?”\nUncle brushes hair out of Zuko’s face. “The Jasmine Dragon isn’t just your home, nephew.”\nZuko nods, because he’s run out of words and his eyes have grown heavy. When Uncle gets up and leaves the room, he knows he’s only going to fetch them tea, but Zuko wants to latch onto his sleeve, anyway.\n \n \n \n \n \nSokka stares at Aang, the world’s last hope, the Fire Nation’s greatest threat, the nuisance Katara rescued just to make his life infinitely more difficult.\n“Aang,” he says, “the goal is to stay away from firebenders.”\n“But I need to learn firebending sometime!” Aang protests. “And when are we going to find another good firebender? You said it yourself: the entire Fire Nation is against me. How am I going to find a teacher if we avoid all firebenders?”\n“He does need a firebending teacher,” Katara says. Sokka sends her a betrayed glare, and she raises her hands defensively. “I didn’t say we should trust this one.”\nAang drops onto the log beside her, puppy eyes on full display. “But Katara!”\n“We don’t know if he really is good, Aang. You said you saw him take down a group of thieves, but that doesn’t mean he’d be willing to work with the Avatar, against his own people.”\n“He didn’t try and fight me,” Aang tries.\n“Yeah, he ran away when he realised who you were,” Sokka says. “That definitely screams ‘make me your firebending teacher.’”\nAang wilts. “But ...”\nKatara pats him on the shoulder. “We’ll keep an eye out for more good firebenders, okay? We’ll find you a teacher, Aang. Don’t worry.”\nSokka scoffs, crossing his arms. A good firebender. As if.\n \n \n \n \n \nIroh usually holds crew-wide meetings in the mess hall. It’s the largest room on the Jasmine Dragon, and the place where everyone naturally congregates. So when Iroh calls a handful of them into the control room, Jee immediately knows there’s a problem. A teenage-shaped problem.\nIt’s a tight fit with half a dozen adults, but they manage, waiting patiently to hear what happened to the Jasmine Dragon’s youngest crewman.\n“Thank you all for coming,” Iroh begins. “I thought it was best to debrief you all as soon as possible. This has shaken Zuko up a great deal.”\n“Is he okay?” Chef says. “I didn’t see him at breakfast. He didn’t get into another brawl, did he?”\n“Zuko is resting,” Iroh says, which only makes everyone look more alarmed. The kid is all action; he hates staying still. Iroh waits a beat, then announces, “My nephew found the Avatar last night.”\n“I thought he abandoned that,” Jee says, wide-eyed. “It’s a fool’s errand. He couldn’t actually have ...”\n“Perhaps I should rephrase. The Avatar found Zuko.”\n“Oh,” Jee says. “Oh, fuck.”\n“Is he okay?” Chef asks again. Chiyo looks ready to shove her way out of the control room and track Zuko down. As the ship’s designated medic, it’s an expression she wears fairly often.\n“Everyone, please calm down,” Iroh says. “It sounds as if my nephew and the Avatar only bumped into each other. And it sounds as if the Avatar is even younger than Zuko.”\nJee grimaces. “Sir, I know you want to see Zuko make friends his own age, but really. The Avatar?”\nIroh doesn’t look at them. His gaze is focused on the bay outside, the water rippling green-blue beneath the morning sun. “No, of course not, Jee. Of course not ...”\nThe crew exchange glances. That tone of voice does not bode well for them--or for Zuko.\n \n \n \n \n \nThat morning, Zuko pours tea like he did when they first opened the Jasmine Dragon, when he was an inexperienced thirteen year old who had spent his entire life being served, not serving others.\nHe knocks over a cup and spills tea across one of the new tablecloths Uncle commissioned from Kyoshi island. Thankfully, the customer at that table is an older woman that seems endeared by Zuko. Or maybe she’s just too busy flirting with Iroh to care. For once, Zuko is too exhausted to be grossed out.\nHe takes the tablecloth down to the laundry room. Chiyo is there, and she laughs when she sees the tea-stained cloth.\n“Did Daichi try and do a trick with the teapot? Don’t follow his lead, kid. You’ll never impress any girls or boys by accidentally spilling tea down yourself.”\nZuko glares down at the ruined tablecloth. Uncle had seemed so excited when they had picked them up last month.\nShe throws a pillowcase at him, and ignores his angry splutters. “We’re playing cards on deck tonight. You had better be there.”\n“You can’t organise a game night every time you’re low on funds,” Zuko says. “We know you cheat. No one’s going to bet against you.”\n“I have no idea what you’re talking about.”\nZuko opens his mouth to tell her off, but then Daichi bursts in, apron still on, holding up a still-steaming bowl. “Zuko, Chef made fire flakes!”\nZuko squints at him. “Chef only makes fire flakes on special occasions.”\nDaichi lowers the bowl. “It’s, uh. My birthday?”\n“That was last month. We had a party. You got drunk and tried to tip me overboard.”\nDaichi exchanges panicked looks with Chiyo. Zuko sighs. They must know about last night. About the brightly-coloured boy who barely comes up to Zuko’s shoulder. About the Avatar, seeking him out three years into his banishment. News travels fast on the Jasmine Dragon.\nZuko snatches the bowl of fire flakes out of Daichi’s hands. They’re extra crispy, just how he likes it.\nHe doesn’t like their fussing--but he appreciates it, anyway.\n \n \n \n \n \n“If Kyoshi Island is neutral territory,” Aang begins, “then you must get lots of neutral ships passing through here. Ships from other nations, even.”\nSokka knows exactly where Aang is going with this. He tries to kick Aang, but he’s too tightly bound, and he only manages to jerk his leg to the side, more a twitch than a proper attack. “Aang, quit talking about that firebender!”\nThe very-scary-looking-but-still-a-girl warrior glares down at him. “Firebender?”\n“Yeah,” Aang says, oblivious to the menace in her voice. “He’s about Sokka’s age, though he’s a little taller--”\n“The more I hear about this guy, the more I hate him,” Sokka says.\n“--and he has long black hair, and a big scar on his face, and he saves people from dangerous thieves!” Aang smiles at them, far too happy for someone bound and held at fan-point by a bunch of girls. “He’s a good firebender.”\nGood firebender. No matter how many times Sokka hears that, it doesn’t sound any less ridiculous. Firebenders aren’t good.\nThe girl-warrior brightens. “Oh! You must mean Zuko.”\n“You’ve met him?” Aang asks.\n“Sure,” she says, looking far less menacing now that she’s talking about Zuko, the firebender, and not their apparent trespassing. “He serves the best tea I’ve ever tasted. He stopped by only a month ago. His uncle had commissioned a bunch of tablecloths from a local artist. Such a lovely family.”\n“The nice firebender has a nice firebending uncle,” Aang says gleefully.\n“Are you sure this is the same guy?” Katara asks on the other side of the totem pole.\nThe girl-warrior gestures at one side of her face. “Huge scar? Long braid tied with a yellow ribbon? Gold eyes?”\n“That’s him!” Aang says.\n“There is,” Sokka says through his teeth, “no such thing as a good firebender. This guy is conning all of you.”\nThe girl-warriors are back to looking scary again. They brandish their fans at him. Delicate objects should not look so dangerous.\n“His name is Zuko,” says the girl-warrior, “and he’s our friend.”\nAang beams up at them. “I want him to be my friend too. He’s going to be my firebending master, after all!”\n“Firebending master--?”\nAang flips out of his restraints, landing neatly on top of the totem pole. “I’m the Avatar!”\nThe girls let them go fairly quickly, after that. Sokka rubs at his wrists and glares at Aang, who is too busy soaking up the island’s combined admiration to notice.\n \n \n \n \n \n“This is very good tea,” Katara says. She’s not just making small talk; the tea really is amazing. Maybe the best she’s ever had, even if it does taste as though it has been steeped for too long. “It tastes almost exotic ...”\n“A good friend of mine delivers it regularly,” Bumi says. “It’s the best tea in the world.”\nAang perks up. Sokka is already glaring across the table, like he can predict the next words out of his mouth.\n“The Kyoshi Warriors also mentioned a very good tea they get delivered regularly,” Aang says. “You wouldn’t happen to know a good firebender called Zuko, would you?”\n“Why, of course. He’s a good lad. Bit surly, but he’s a teenager, what can you do?”\nKatara puts her cup down. “You’ve met Aang’s firebender, too?”\n“Katara,” Sokka hisses, “he’s not Aang’s firebender--”\n“Yes, of course!” Bumi says. “I think of him like my very awkward, very grumpy nephew.”\n“Even though he’s a firebender,” Aang says, casting a smug glance at Sokka.\nBumi looks baffled. “All firebenders aren’t evil, you know.”\n“All firebenders aren’t evil,” Aang echoes. “See, Sokka!”\nSokka eyes Bumi, idly dipping lettuce leaves into his tea. “Right. I’ll take his word for it.”\n \n \n \n \n \n“If Bumi knows and trusts Zuko,” Aang says, “then I do too. I’ve decided: I want him as my firebending teacher. No one else.”\n“Have you two even had, like, a conversation?” Sokka says, scratching his arm. The feel of creeping crystals lingers on his skin. “You said he ran away when he saw you. Why do you keep forgetting that part?”\n“I can be very persuasive,” Aang says, smiling the smile of a twelve year old who knows exactly how cute he is. Sokka knew those puppy eyes were on purpose.\n“We have had two different people confirm that this Zuko character is okay,” Katara says. “I still don’t trust him completely, but if we find him again, we should at least try and talk to him.”\nSokka glares at his traitorous sister, scratching his elbow harder. “Fine! Fine. We’ll talk to the firebender.”\nAang cheers, leaping into the air.\n“But only if we run into him again! It’s a big world. What are the chances that you’ll meet the same person twice?”\n \n \n \n \n \n“Hey, look,” Sokka says, pointing. “Tea!”\nThe angular ship stands out against the humble fishing boats docked around it. Not just because of its size, but because of the hand-painted banners hanging over the side. One reads, “WELCOME.” Another simply says, “TEA.”\nSokka leads Katara up the gangplank. Mismatched tables are set up across the deck and lanterns are strung up, softening the sharp accents of the ship. It’s a windy day. Sokka wonders how the lanterns stay lit.\nThis floating tea-shop seems safe; most of the tables are full, and the ship is decorated with kitschy furniture and hand-painted signs. And no place that smells this good can be dangerous.\n“Shouldn’t we wait for Aang before stopping somewhere?” Katara asks.\nSokka waves her off. “He’ll find us eventually. He’s probably off having another mini-adventure. In the meantime, we deserve tea.”\nA teenager in a tea-stained apron approaches them. His hair is braided down his back and tied with a canary-yellow ribbon. Sokka tries not to stare at the nasty scar burnt into one half of his face.\nThere’s something familiar about him, but Sokka can’t pinpoint what, exactly. Surely he would remember such a brutal scar stamped across such a pretty face. Surely his nose would remember smelling such amazing tea.\nThe teenager raises a hand in greeting. “Hello, Zuko here. I’ll be your server for today. Would you like to be seated or would you like to continue browsing?”\nKatara gasps. Sokka elbows her in the side. It isn’t as if she’s never seen a nasty scar before--people in their tribe have plenty of intense-looking scars from the Fire Nation raids. She should know better than to be rude about it.\n“We’ll keep browsing, thanks,” Sokka says, and steers Katara towards the display of various teas.\nKatara is still staring at the boy. For once in his life, Sokka hopes it’s because he’s an attractive boy and not because of the burn.\nSokka studies the teas laid out on the embroidered tablecloth. The design is familiar, too. It almost reminds him of the green-blue designs on Kyoshi Island.\nHe picks up a ceramic pot full of orange-red tea and sniffs at it. It smells spicy and almost burnt, like curry simmering over a campfire.\n“That’s a special Jasmine Dragon blend,” Zuko says, coming up behind them. “It’s my favourite. Would you like to try some?”\nThe tea server brews them a small sample with quick efficiency. Sokka sips at it. It’s even spicier than it smells, and twice as good. Better than any of the watery tea Sokka has sampled in other towns. Strange, though. Who wants their tea to have a kick to it?\nSokka looks at the tea server again. He’s unnaturally pale for someone who works on the deck of a ship all day, directly under the sun. And at this angle, his eyes seem almost gold.\nSokka blinks. It isn’t the angle. On closer inspection, his eyes are, very clearly, gold.\nWho has gold eyes?\nAnd his accent. It’s subdued and barely there, like a rock worn smooth by time, but he doesn’t sound like an Earth Kingdom native, or speak like he’s from the Water Tribe. Aang has an alien lilt to his words that the tea server is missing, but there’s still something there--a faint, foreign inflection ...\n“Wait,” Sokka says, “wait, wait, wait.”\n“I’m very sorry about this,” Katara says to Zuko.\nZuko blinks at her. “About what?”\n“The big red ship,” Sokka says, gesturing at the seemingly harmless tea shop. “The foreign features. The weird spicy tea. You’re Fire Nation!”\nZuko stares at him flatly. “And what about it?”\n“The Fire Nation is evil!”\nZuko’s polite expression vanishes. “We’re just selling tea, we’re not doing anything wrong. We have nothing to do with the war.”\nSokka scowls. “Everyone in the Fire Nation is the same. This whole thing is probably a trap to lure us into a false sense of security!”\nZuko scowls back. His scowl is better than Sokka’s. It’s probably because of the scar. Or maybe people in the Fire Nation just train their kids to master the act of looking angry. “A trap? How could you say that? We’re minding our business and trying to make a living, just like everyone else.”\nSokka points at him. “That’s what someone setting up a trap would say.”\nKatara puts a hand on his shoulder. “Sokka, calm down. Don’t you realise who this is?”\nSokka pulls out his boomerang, brandishing it under the tea server’s nose. “I know exactly who he is, Katara. He’s Fire Nation, and I don’t trust him. Why didn’t he just tell us he was Fire Nation in the first place, if he’s so innocent?”\n“Because of how you’re acting right now,” Zuko says. “And besides, it’s not like we were hiding. The Jasmine dragon is run out of a decommissioned warship.”\n“He’s right, Sokka,” Katara says. “And remember what the Kyoshi Warriors and King Bumi said about Zuko? He’s good. They vouched for him. And so did Aang.”\nThe pieces fit together in Sokka’s head. This isn’t just a rogue Fire Nation citizen, this is the mythical nice firebender.\n“You’re Aang’s firebending teacher,” Sokka realises.\nZuko takes a step back. “Excuse me?”\n“I’m sticking with my trap theory,” Sokka says stubbornly. “This could all be some big plan to take advantage of Aang’s kind nature. Everyone knows the Air Nomads were super forgiving and nice.”\nZuko looks like he’s going to throw up.\n“Look, I can see Aang from here. Why don’t we just ask him?” Katara leans over the side of the ship, waving her hand in the air. “Aang, over here!”\nThere’s a rush of air, and then Aang is perched on the railing, a bag of fruit slung over his shoulder. He opens his mouth. Then closes it. Immediately, he zeroes-in on Zuko.\n“It’s you!” Aang jumps off the railing and bounces closer. “Hello! I didn’t think I’d ever see you again. Is this your tea shop? Can you teach me firebending?”\n“It’s you,” Zuko says.\n“Aang, stay back,” Sokka says, holding his boomerang like a sword. “This is probably one big ploy so he could capture the Avatar.”\nZuko laughs. The sound comes up rough and---sad, almost.\n“No. No, I wouldn’t--” Zuko shakes his head. “Get off our ship.”\nAnother server comes up behind Zuko, eyes narrowed. “Are you okay, Zuko? Are we fighting these guys?”\n“There’s no fighting on the Jasmine Dragon,” Zuko insists.\nThe crewman nods. “Okay, fine. Are we escorting them off the Jasmine Dragon and then fighting them?”\nThin steam wafts out of Zuko’s mouth. It doesn’t look like an intimidation tactic--if anything, he looks like a metal teapot screaming on the stove, spiralling past boiling-point.\n“No,” Zuko says through his teeth. “They’re leaving. We’re staying.”\n“I’m getting Iroh,” says the crewman, before disappearing below deck.\nAang inches a bit closer. Sokka had been worried about Aang’s safety, but in that moment, it looked as though Zuko was the one in danger of being kidnapped. Not Aang.\n“Wait,” Aang says, “please. I’m looking for a firebending teacher and--”\nThe crewman returns with a kindly old man in tow. Iroh touches Zuko’s shoulder and says softly, “Nephew, is everything okay?”\nZuko huffs out another breath of steam. “I don’t want them here, Uncle.”\nIroh claps his hands together. “Alright, then. I’m afraid I’m going to have to ask you three to please leave.”\n“But,” Aang says.\nIroh hands out little wrapped bags that smell delicious and then bustles them off deck, down the gangplank, and into the marketplace proper, all with a smile and an unflappable grace, like he is escorting them home, not manhandling them away from his nephew.\n“Thank you for frequenting the Jasmine Dragon,” Iroh says. “I hope to see you again soon!”\n“Didn’t you just kick us out?” Katara asks, dazed.\nAang has already unwrapped his bag. “Oh, there’s biscuits in here!”\nWith a wave goodbye and wish for them to have a great day, Iroh disappears back up the gangplank. Customers are quickly shooed off and the gangplank is lifted, and the Jasmine Dragon is streaming out of port less than an hour after the Avatar had stepped foot on deck.\n \n \n \n \n \n“I’m not hungry, Uncle.”\n“Perhaps some more tea, then.”\nZuko sighs and nods, allowing Iroh to fill his teacup back up. Although Iroh is worried about Zuko, he’s glad that this has happened now, after he has spent three years gently parenting Zuko. If the Avatar had bounced onto their deck when Zuko was still twisted up from Ozai’s violence, then his nephew would have had a very different reaction.\nThe spirits truly are working in their favour. This is a stroke of fate. He knows it.\nIroh allows silence to settle over the room. He considers strong-arming Zuko into a round of Pai Sho, but decides against it. If Zuko wants to finish his tea, disappear into his bedroom, and immerse himself in theatre scrolls, then Iroh will let him.\n“I don’t want to chase after the Avatar,” Zuko says abruptly.\nIroh sips his tea. “I know.”\n“I don’t want this to destroy the life we’ve worked so hard to build.”\nAnd Iroh is proud of him for that. He’s glad that Zuko could lay down the wild chase Ozai had sent him on and embrace a more humble life. Zuko learned how to live for himself and not the approval of a man who would never be satisfied.\nBut he has known for some time that this run-down ship and the company of a dozen adults isn’t what Zuko needs.\nIroh lays his hand over Zuko’s. “You deserve more, nephew.”\nIt’s a testament to their years on the Jasmine Dragon that Zuko doesn’t jerk his hand away. “More? What else is there? The palace? Uncle, you don’t think we should go back there, do you? My father …”\n“No, no. Of course not. But beyond this ship. Beyond the war. Don’t you deserve more out of life, Zuko?”\nZuko stares blankly at him. He clearly doesn’t understand what Iroh is saying. He never had regarded himself very highly. Even now, after years in Iroh’s care, he still doesn’t think he deserves any extra kindness the world has to offer.\nZuko isn’t ready for what Iroh has to say.\nIroh puts down his tea. “Never mind, nephew. I heard you purchased another theatre scroll from the markets yesterday. Why don’t you tell me about it?”\n \n \n \n \n \n \n \n“I don’t know what you saw in that guy,” Sokka fumes. “He seemed like a real jerk to me!”\n“You were a jerk to him first,” Katara says.\n“Are you taking the firebender’s side? I thought you were my sister.”\n“Stop being so dramatic.”\n“Sokka,” Aang whines. “Come on. He’s a firebender. A good firebender! And he’s our age!”\nSokka shoves another biscuit into his mouth. They taste amazing--soft like melting butter, with a kick like cinnamon to them--and that just makes him angrier. “We should focus on getting to the North Pole.”\n“But Zuko is right there,” Aang says. “When are we going to get another chance like this? Katara?”\nKatara bites her lip. “He seems like he doesn’t want to be around us though, let alone teach you firebending.”\n“We have to at least try!”\n“How?” Sokka asks. “You saw how he reacted to you. If we go onboard the Jasmine Dragon, his uncle will just smile and carry us off again. Seriously, how is that old man so strong …”\n“I have an idea,” Aang says, “but I don’t think he’ll like it.”\n \n \n \n \n \n \n \nIt’s a warm day. Zuko is standing on deck, soaking in Agni’s rays and tending to the steady stream of customers. It’s the kind of day that soothes his anxieties, reminds him why he enjoys this life so much.\nA shadow falls over the ship, as though a cloud has passed in front of the sun. A few people gasp. Daichi holds up a broom like it’s a weapon. And then Zuko is caught around the waist and hoisted into the air.\nHe thrashes and tries to twist out of the hold, but they dive sharply left, and he’s thrown back against the thing carrying him.\nHe can hear shouting from the ship. The figures on board, waving their arms frantically and trying to call up to him, grow smaller and smaller as he rises into the air. His anger is replaced by fear.\nAnd then he’s dropped into a saddle. The Avatar lands beside him.\n“Hi, Zuko,” Aang says, as though he hadn’t just snatched him off the Jasmine Dragon, like a lion-hawk scooping up a baby buffalo-sheep. “Welcome aboard!”\nKatara, on the other side of the saddle, waves awkwardly at him. Sokka just glares.\nZuko scrambles for the edge of the saddle. No one makes a move to stop him. When he peers over the side, he sees why: the ground is a very, very long way down, his ship a dot in the shrunken port. He’s stuck.\n“Did,” Zuko says, “did you just kidnap me?”\n“I wouldn’t call it kidnapping,” Aang says. “More like very strongly insisted you come with us.”\nZuko stares at the sheepish airbender perched on the head of the sky bison--two beings he had, until very recently, thought were extinct. Then he looks to the Water Tribe siblings, one passingly polite and the other not looking at him. Then he peeks over the edge of the saddle again.\n“I’ve been kidnapped,” Zuko says, staring at the barely visible spot of colour that was the Jasmine Dragon. He feels numb. “By a child.”\n“It’s not kidnapping!”\n“Aang,” Katara says gently, “it’s definitely kidnapping.”\n“And you’re okay with this?” Zuko asks, narrowing his eyes at her.\nShe smiles at him. That sugary-sweet smile reminds him, alarmingly, of Azula.\nZuko sits back down, arms crossed. The rest of the flight passes in uncomfortable silence.\n \n \n \n \n \n \n \nWhen the sky bison lands in a patchy clearing, Zuko leaps over the edge of the saddle, rolling on impact, and runs for the treeline. Aang zips in front of him.\nZuko ducks and sprints in the other direction. Aang jumps in front of him again.\n“Please don’t make me fight you,” Aang says, hands up.\nZuko throws a fireball at him. Aang flips into the air easily.\n“Hey,” Aang says brightly. “Do you think this counts as a firebending lesson?”\n“No,” Zuko says, aiming his next fireball at Aang’s feet.\nTheir fight can’t even be called a fight. It’s like trying to win against the wind, if the wind had a habit of smiling and complimenting his bending while the wind’s friends looked on, snickering.\nEventually, Zuko resigns himself to waiting them out. He sits on the far side of the campsite, far enough away to avoid conversation, close enough that Aang isn’t tempted to scoot closer to him.\nThis, he thinks, would be easier if the Avatar wasn’t a friendly preteen and over a head shorter than him. This would be easier if Zuko was the kind of Fire Prince Ozai had wanted him to be. He might have gotten away, then. But then, Aang might not have survived the encounter.\nSokka disappears into the trees to scope out the area or collect firewood or take a leak. Zuko doesn’t know. Aang unloads the sky bison and then spends some time patting the beast down. Zuko tries not to stare. Or feel jealous. No matter how soft the sky bison’s fur looks, or how cute those little happy sounds he makes as Aang pets him are.\nKatara is unpacking their food and meager cooking supplies. Zuko settles more firmly against the tree trunk. He likes watching people cook. He spends as much time with Chef as he does with Jee, up in the control room, learning the local topography.\nBut then, Chef always seems to have a much easier time than Katara.\n \n \n \n \n \n \nKatara is struggling to light her very sad looking pile of pine-needles and damp wood. She’s a waterbender, she should be able to pull the moisture out of a patch of forest debris, but no matter how much she tries, the pile stays stubbornly damp. And her fire stays stubbornly unlit.\nAang is watching off to the right. He had offered to help earlier, but she had snapped at him and insisted she could do this. But she can’t. And now she’s tempted to just give up and let them all go hungry for the night.\nShe has almost forgotten about their firebending captive until he crouches down beside her, making her jump.\n“Here,” he says, knocking her hands away. “I’ll do it.”\nHe rearranges the stack of loose wood and pine-needles so that it is more structured. Then he blows a flame into the centre. It’s the most delicate display of firebending she has ever seen. If she hadn’t been paying attention, she might have thought he was an airbender, blowing on an ember to spark a flame.\nAside from the one-sided fight with Aang when he had tried to escape, he hasn’t attacked them. He is clearly a capable firebender, but there he sits, gently stoking the fire, looking calm and wind-ruffled, an apron still tied around his waist.\nKatara starts preparing dinner. She doesn’t have the time or supplies for anything more than a plain stew. Sokka returns sometime later, glaring weakly at Zuko, and plants himself on the other side of the fire.\nOnce the fire isn’t in danger of going out, Zuko stands and hovers awkwardly in the middle of the camp. Sokka ignores him, but Aang stares intently, like the world’s most powerful guard dog, so Zuko just sighs and sinks back down again.\n“Can I help?” he asks her.\nKatara blinks. “Pardon?”\nZuko gestures to the vegetables resting in her lap, and repeats, “Can I help?”\nShe eyes him warily. “Can you even cook?”\n“Of course I can cook,” Zuko says. “Everyone can cook, can’t they?”\n“You’re a teenage boy.”\n“And?”\nSokka snickers on the other side of the campfire. He’s sharpening a short tree branch, supposedly to intimidate Zuko.\nKatara points the ladle threateningly at Sokka. “If you say cooking is women's work, I swear ...”\n“Well, who cooked in the tribe?” Sokka says. “Not the men. We hunt, you cook. It’s just nature, Katara.”\nZuko squints at Sokka. “What are you talking about?”\n“There are roles women do,” Sokka says slowly, like he thinks Zuko is particularly dense, “like cooking and cleaning, and there are things men do, like hunting and protecting.”\nZuko turns to Katara, eyebrows raised. “Is he serious?”\n“Unfortunately,” Katara says, resigned.\n“Women are more than capable of hunting and fighting,” Zuko says. “If you spoke like that in the Fire Nation, someone would set you on fire.”\nZuko stares down at the beginnings of dinner. From the increasingly sour expression on his face, Katara can tell Sokka’s words are getting to him. Though if that is because he’s offended or baffled she isn’t sure.\nNo one speaks after that. Zuko silently takes over most of the cooking, and Katara lets him, simply because she isn’t sure how to stop him.\nOnce stew is cooked and served, they settle back down. The sun has begun to set, casting their campsite in shades of pink. The blazing fire keeps them all warm.\nSokka shoves a spoonful of stew into his mouth and moans. “Katara, you’re fired. Zuko, you’re our chef from now on.”\nKatara is too busy eating to be offended. “It is good. Thank you, Zuko.”\n“Good? It’s brilliant!”\n“Glad you think so,” Zuko says, putting his empty bowl aside, “because you’re helping me clean up.”\nSokka squawks but he isn’t fast enough to dive out of the way. Zuko snags him by the back of his shirt and hauls him in the direction of the river.\n“Aang, grab the rest of the dishes,” Zuko says.\n“But--” Aang starts.\n“Dishes!”\nAang follows along obediently, arms full of dishes. And suddenly, Katara is alone in front of a roaring fire with only Momo and Appa, the sound of Sokka, Aang and Zuko’s bickering growing quieter.\nShe isn’t sure if she is ready to think about good firebenders, but in that moment, she decides she likes Zuko after all.\n \n \n \n \n \nNight falls and the Water Tribe siblings curl into their sleeping bags to go to sleep. Aang sits down next to Zuko, ready to take first watch.\nThey might seem like they’re just kids, whining about chores and making jokes at each other’s expense, but Zuko shouldn’t forget that this is the Avatar and his companions. They were successful in snatching him off the deck of his home, after all. They’re smart enough to watch him through the night.\nAnd the Avatar is, it seems, smart enough to cheat at cards.\nZuko squints down at the cards stacked on the forest floor. “You’re definitely cheating.”\nThe Avatar blinks up at him, all innocent big eyes. “I’m not. How could you say that?”\nAang’s next hand is just as impossibly good as every one of his previous turns has been. Zuko throws his cards at him, stomps to the other side of the campsite, and slouches against the trunk of a tree.\nAcross the campfire, Aang pouts at him. Zuko pointedly ignores him.\nIt takes less than an hour before Aang grows bored and dozes off. Zuko lingers for a few moments to make sure he’s deeply asleep, but the sight of the Avatar--curled in on himself, so small and isolated on the grass, a strange orange-yellow huddle that has no place in the world--unnerves him too much. He gently steps around the sleeping teenagers and slips out of the clearing into the trees, heading towards the nearest port.\n \n \n \n \n \nZuko returns to the ship just after midnight. Uncle and Chef are on deck, playing Pai Sho under the stars.\nChef stands up abruptly. Uncle just smiles, far calmer than Chef.\n“Nephew,” Uncle says, eyeing Zuko for fresh injuries, “how was your evening out?”\n“It wasn’t an ‘evening out’, Uncle. I was kidnapped by the Avatar and his friends. It was …”\nHe doesn’t have the words. He’s still shaken up inside, because he had given the Avatar up as a fool’s errand years ago; because even now that he knows the Avatar is real, returning to the Fire Palace is the last thing he wants to do; because every time he gets close to the war, Zuko feels like his insides have twisted into knots.\nBecause the Avatar had seemed so normal, brushing down Appa and cheating at cards and laughing at Sokka, elbow-deep in the river, scrubbing dishes. Just a kid.\n“A journey of a thousand miles begins with a single step,” Uncle says.\n“What?” Zuko says.\n“You need a bath, nephew,” Uncle says. “Go and freshen up. Chef and I will bring you tea and something warm to eat.”\n \n \n \n \n \n \nZuko doesn’t like serving customers that are his own age. He doesn’t like the way they talk to him--like how the older women talk to Uncle.\nIt’s almost a relief when the girl who had been fiddling with his sleeve and asking inane questions about his work schedule and restaurant-preferences looks over his shoulder and shrieks. “What is that?”\nZuko turns. It’s the sky bison, Appa, descending quickly towards them, the Avatar balanced on his head.\nZuko untangles himself from her grip and dashes back to the samples table. He pulls the tablecloth back and grabs his dao blades.\nAang jumps off Appa and dives onto the deck. Zuko rolls to the side. With an arc of his swords, he sweeps Aang’s feet out from under him and twists him around. Aang pushes up with a burst of air before he can faceplant into the floor.\nAang reaches out, tries to grab the front of his shirt. Zuko catches his wrists between the flat sides of his blades and twists, sending them both tumbling. Zuko rolls. Aang pushes off the ground and backflips over his head, landing directly behind Zuko.\n“Love the swords!” Aang says, before grabbing him around the waist and propelling them both ten feet into the air.\nZuko is dumped into the saddle. He peeks over the edge. If he jumped from this height, he’d break both his legs, if not his back.\nHe sighs and sheathes his blades. When he looks up, the Water Tribe siblings are staring at him, almost the same way the young customer had been looking at him earlier.\n“Marry me,” Sokka says.\n“Um,” Zuko says.\n“That was really cool!” Aang smiles as if he hadn’t just kidnapped Zuko for the second time that week. “I didn’t know you could fight like that. Why didn’t you just firebend?”\n“It scares away customers,” Zuko grumbles.\n“And swords don’t?” Katara asks. Zuko glares at her.\nSokka inches across the saddle and gently touches the sheathed weapons. Zuko jerks them away.\n“Teach me,” Sokka demands.\n“Hey!” Aang says. “You can’t just pinch my sifu like that. I called dibs on him first.”\n“He can be your firebending master. I need him to teach me how to use those swords. Did you see that? He was all--” Sokka whips around, approximating Zuko’s fighting style. He wobbles and almost topples over the side of the saddle. Zuko grabs his tunic and yanks him back down.\n“I’m not teaching any of you,” Zuko says. “Not firebending. Not sword-fighting. Nothing.”\n“You taught Sokka how to be responsible,” Katara says.\n“He already should be responsible! ‘Women’s work’? Honestly.”\nSokka crosses his arms and looks away, pouting. Zuko suspects the only reason he isn’t arguing is because he is still holding out hope that Zuko will teach him how to fight with swords.\n \n \n \n \n \n“Zuko?”\nZuko looks up from the dishes. “Hm?”\n“Why did you leave the Fire Nation?”\nZuko stiffens. He doesn’t look at Katara, just stares down at his hands, buried beneath the ice-cold water, going red with the cold.\n“Katara,” Sokka scolds, “don’t interrogate the guy! He just offered to wash our dishes for us.”\n“And I’m grateful for that,” Katara says. “But come on, Sokka. Why haven’t we seen any other nice firebenders?”\n“Uh, because the Fire Nation is full of evil jerkbenders?”\n“And aren’t you the least bit curious about why Zuko is different?”\nSokka drops his voice, though Zuko can still hear him clearly. “It’s. You know. His scar.”\n“He can still hear you,” Zuko says loudly. His hands are starting to go numb. He warms them, creating a swarm of bubbles and a hiss of steam beneath the water. “It’s …”\n“You don’t have to tell us,” Aang interjects, jumping off Appa to join them by the river. “Katara, I thought you were coming around to Zuko?”\n“I am,” Katara says, “but we have to be careful. You’re the world’s last hope, Aang. We have to protect you.”\n“You don’t--” Aang begins.\n“No,” Sokka says. “She’s right.”\nZuko drops back on his heels, shaking his hands and warming them, creating another burst of steam. He keeps his eyes on the riverbank beneath him, muddying the knees of his pants, rather than at the others.\n“Do you know what happens to a fire when it gets fed too much fuel? It grows and grows until it gets out of control, and then only a skilled firebender can extinguish it.”\n“Is this a firebending lesson?” Aang asks. “Should I be taking notes?”\n“No, it’s not--” Zuko cuts himself off. “I just mean that people can be like that, too. In the Fire Nation, people can become obsessed with lighting fires, especially when they’re young and still learning what it means to hold a flame. It can destroy homes. Entire towns, sometimes. And that fire-hunger can consume a person, just as it can consume everything around them.”\n“Of course there are a bunch of baby arsonists running around the Fire Nation,” Sokka says. He yelps when Katara elbows him in the side. “What? It makes sense.”\n“Fire-hunger doesn’t just affect kids,” Zuko says. “Or individuals. The Fire Nation has been fed too much violence and fear for too long. It’s become infected with a kind of fire-hunger, a kind that won’t stop until it’s burnt up the rest of the world. That’s why I’m not trying to go back to the Fire Nation. Going back there would be like laying down on the fire pit and letting the flames take me.”\nThere’s a long, ringing silence. Then Sokka says, “Spirits, that’s dark.”\nZuko shoves his hands back into the river. This time, he doesn’t fight the stinging cold. “Yeah, I know. “\n \n \n \n \n \nZuko returns to the boat angrier than when he had left. His anger has no direction--he should be furious with Aang, Katara and Sokka, but even he can see that they’re just being pulled along by destiny. Aang didn’t ask to be the Avatar. Katara and Sokka didn’t ask for the war to come down so heavily on their village, for the war to ravage their culture and lives. Zuko didn’t ask to be--\nWhen Jee asks if he wants to join them for dinner, Zuko shouts at him to leave and slams the door in his face, something he hasn’t done since he was thirteen.\nUncle comes to his room shortly after with two bowls and an armful of fresh candles. He chatters on about the Pai Sho games Zuko had missed that afternoon. The crew knew better than to bet against Uncle, so the only thing Uncle had won were bragging rights.\nAfter dinner, they meditate side-by-side using the candles. While Uncle is setting up the candles, stacking them in evenly spaced rows like the servants used to do, he says, almost casually, “You know, Zuko, a change is as good as a rest.”\n“A proverb? Now, Uncle?”\n“Just something to think about,” Uncle says, soothing down the back of Zuko’s hair, the way Mother used do all those years ago, before returning to his seat on the other side of the table.\n \n \n \n \n \nThe next time a shadow falls over the ship while Zuko is standing on the deck, vulnerable to an aerial assault, he twirls on his heel and shoots a funnel of fire into the air. It’s almost instinctual, at this point.\nAang shrieks and dodges, spinning higher into the air.\n“Zuko,” Iroh admonishes from where he is refreshing the samples, “no combative bending around the customers.”\n“Sorry, Uncle. I forgot my swords.”\nAang dives for him again. Zuko rolls out of the way, because he knows from experience that once Aang gets his hands on him, it’s all over.\n“Stay still,” Aang shouts.\nZuko throws an empty teacup at him, and then another, and then brandishes the empty teapot like a weapon. “Back off.”\n“Zuko!” Iroh calls again. “Stop destroying the china.”\nAang dives again. Zuko swipes at him with the teapot, feeling half-crazed. His family has a history of questionable mental health, after all. Maybe this will be the thing that makes him snap.\nZuko is so busy concentrating on Aang that he doesn’t notice the Water Tribe siblings. A boomerang hits him on the back of the head, knocking him over. The teapot goes skittering across the deck.\nZuko pushes up onto his knees, ears ringing. Aang grabs him around the waist while he’s still disoriented.\nWhen Zuko’s head stops aching, he finds himself on Appa’s saddle, a frustratingly familiar place. He’s going to start waking up in a cold sweat at night, thinking he’s back here.\nZuko leans over the edge of the saddle. They’re too high up for Zuko to jump, but low enough that he can see Uncle waving up at him.\n“We’ll be at the next town over!” Uncle yells up at him. “Have fun, nephew! Be safe!”\nZuko sighs and waves back. He’ll see Uncle again soon enough, he supposes.\n \n \n \n \n \nIt’s an uncommonly cold night. Sokka and Katara are already half-inside their sleeping bags. Aang seems unbothered, even dressed in thin cotton as he is. Zuko, however, dressed in his equally thin tunic and apron, isn’t so unaffected.\nZuko eyes the fur-lined sleeping bags the siblings are huddled inside. “You don’t happen to have a spare, do you?”\n“Nope,” Sokka says, smug. “Sorry.”\n“Do you want my jacket?” Katara asks.\nZuko shakes his head. “It’s alright. You keep it.”\nZuko closes his eyes and focuses his energy inward, towards his core, just as Uncle had taught him. He carefully brings his inner flame to a simmer. Warmth spreads through his body. He relaxes, exhaling steam.\nWhen he opens his eyes again, all three teenagers are staring at him.\n“What?” Zuko says.\n“I’ve never seen firebending like that before,” Aang says. “Can you teach me?”\nZuko almost says, “Sure” before he remembers who he is, who Aang is. “You’re an airbender,” he says instead. “You already know how to keep yourself warm.”\nSokka leans into Zuko’s personal space, putting a hand on his unscarred cheek. He makes a content noise in the back of his throat. “You don’t normally radiate this much heat.”\n“I don’t normally need to,” Zuko says, shoving Sokka away. “It’s just a way firebenders can keep warm.”\nSokka inches closer, until he’s able to leech off the heat Zuko is emitting like a furnace. It doesn’t take long before Katara is pressing in on his other side.\n“We have a campfire,” Zuko protests, sitting stiffly between them.\nSokka waves him off. They’re so close that he almost smacks Zuko in the face. “You’re warmer. And more comfortable.”\n“It’s cold,” Katara says, even though she’s in a sleeping bag and jacket designed to withstand temperatures at the South Pole.\nIt doesn’t take long for Aang to grow jealous. He throws himself over the smoking embers of their fire and into Zuko’s lap. The force tips them over.\nSprawled out into the dirt, beneath the bony weight of three teenagers, he just sighs and wonders what Uncle is doing. The crew doesn’t look for him when he’s kidnapped by the Avatar, not anymore. Just trusts that he will return home on his own. Is it music night? He hopes he’s missing music night.\n“You’re right,” Aang says into Zuko’s chest. “He is warm.”\nZuko stares up at the sky, heavy with stars. He doesn’t have a downy sleeping bag like Katara and Sokka, and he misses his room on the Jasmine Dragon, and he still sometimes misses the silky softness of his childhood bed, even though he had been too young and spoiled to appreciate the opulence of the palace--but this, laying in the dirt with three laughing kids draped on top of him, is nice in a way he can’t articulate.\nZuko meant to slip away in the night, but he ends up falling asleep and waking at daybreak, still squashed between the three kids.\nHe cooks them breakfast. As soon as Aang volunteers to help Katara with the dishes, Sokka grabs Zuko by the elbow and drags him into a neighbouring clearing.\nSokka shoves a blunt sword into his chest. “Okay, sifu. Teach me.”\nZuko examines the sword. The hilt is rough wood, and the blade is chipped and uneven. He supposes this is another way he’s been spoiled; he’s used to the very best weapons, the very best masters. The sword bought from a coastal Earth Kingdom port on a teenager’s budget is almost laughable.\nZuko grimaces. “Don’t call me sifu. And this sword is terrible.”\n“What, you can’t make it work?”\nSokka makes it sound like a dare. Zuko readjusts his hold on the sword, testing its uneven weight, the span of its reach.\n“No, I can. It just sucks.”\nSokka drops into a low, unsteady stance, matching sword in hand. “Them’s fighting words, tea-boy.”\nZuko stares at him flatly. “Tea-boy?”\nSokka lunges at him, sword arched high above his head, and Zuko has to roll out of the way to avoid being beheaded.\n \n \n \n \n \nSokka is sprawled on the ground, panting heavily. Zuko sits primly beside him, fiddling with the cheap blade. Maybe he could melt it slightly, and then mold the weakened metal into place …\n“If you hate the Fire Nation so much,” Sokka says, squinting, sweat dripping into his eyes, “then why don’t you join us and help fight them?”\n“Seriously?” Zuko asks.\n“We just bonded. I’m allowed to ask intense questions without it seeming like an interrogation.”\nZuko grimaces, tracing lines into the dirt with the sword. “I don’t want to fight. I just want to stay as far away from the war and the Fire Nation as I can, and serve tea in peace.”\n“The Fire Nation is spreading, though,” Sokka says. “They’re all around us. So is the war. You can’t stick your head in the sand and pretend it’s not there.”\n“I’ve tried fighting,” Zuko says, without saying who he was fighting, or how, or why. “I tried more than once. It didn’t work. I can’t risk losing everything again.”\nThey sit in silence, Sokka still panting, Zuko curled in on himself. Through the trees, they can hear the sound of splashing as Aang and Katara try to clumsily waterbend through trial-and-error.\nAnd then Sokka sits up, shaking himself, readjusting his grip on his sword. “I feel like I almost beat you that last time. Come on, tea-boy. Let’s go for round two.”\n \n \n \n \n \n“We were thinking about sending out a search party,” Daichi says when Zuko returns home, sometime after lunch.\nZuko exchanges his dirty apron for a fresh one and refastens the ribbon in his hair. “No, you weren’t.”\n“Nah,” Daichi says, ruffling his hair as he passes, undoing the work Zuko just did. “We knew you’d come home, sooner or later. Did you have fun at least?”\n“Daichi, I got kidnapped.”\n“That’s not a no!”\nZuko grabs a notepad, dodges Daichi’s grabby arms, and goes to welcome a group of customers that just stumbled on board, ignoring Daichi cackling behind him.\n \n \n \n \n \nThe customers have all left. Zuko is packing away the tea sets, gently wrapping them in fabric so they don’t crack on their journey to the next town.\nBy the railings, Uncle is watching the marketplace. Zuko almost forgets he’s there. Then, without warning, Iroh very loudly says, “It’s so nice here.”\nZuko inspects his favourite dragon-print teapot for chips. “I suppose?”\n“But I’m sure,” Uncle goes on, voice growing louder, “that RIVERMOUTH, the town we are GOING TO NEXT, will be just as nice. Yes, RIVERMOUTH is a lovely place.”\nZuko puts the teapot down carefully. “Uncle, Rivermouth is a dump.”\nUncle ignores him. “RIVERMOUTH is so quaint. Yes, our NEXT LOCATION, RIVERMOUTH, will be a good change of pace.”\nZuko grimaces and turns to Jee and Daichi, who are busy packing away the tables. “I think Uncle has sunstroke again.”\n \n \n \n \n \nThey grab him during a rare afternoon off. Zuko is browsing the markets, looking for a gift for Chef’s upcoming birthday, when the people around him start shouting and running in the opposite direction, and then Zuko is airborne.\nZuko sprawls, eagle-spread, in the saddle, staring at the blue sky above him.\n“How did you even know I was going to be in Rivermouth?” Zuko wonders. “We made port barely an hour ago.”\nSokka preens. “We’re just that good.”\nZuko suspects that the entire universe is conspiring against him.\n \n \n \n \n \n“Here,” Zuko says, after they had landed and he had made sure everyone helped unpack and cook lunch. He opens up his bag and pulls out the black-sheathed katana.\nJee had called him paranoid for carrying weapons everywhere. Chiyo said it was smart, with a tone that suggested she was surprised that Zuko was capable of self-defence. Uncle had just sipped at his tea, smiling. Saying nothing.\nSokka takes the katana with obvious awe, examining the fine script engraved on the hilt. “I noticed it sticking out of your bag, but I thought … I mean, you didn’t even try and fight Aang with it.”\n“It’s for you,” Zuko says.\nSokka stares at him. “What?”\nZuko shrugs. “If you’re going to keep fighting, you’re going to need to defend yourself. You’re skilled with the boomerang, but you need something more close-range, and those swords you bought for us to practice with are going to break the first time you go up against a firebender.”\nSokka is still staring at him. “But--why? I thought you didn’t want to fight.”\nThey’re all staring at him now. Zuko scowls and starts collecting everyone’s dirty dishes. It’s not his turn to wash up, but he needs something to do right now, just so he can get away from Sokka’s soft, wide-eyed stare.\n“I don’t, but that doesn’t mean I want you to get killed. And I have a job. I have a steady income, and plenty saved up. I don’t spend my money on much.”\nThe odd scroll when a new story catches his eye, and gifts for the crew’s birthday, and trinkets he thinks Uncle will like, but that’s it. He doesn’t work for the money. He works because the Jasmine Dragon makes Uncle happy, and provides them with funds that didn’t come out of the royal stipend, and because he needs something to do with his hands or else he’ll go crazy.\nAnd it had been keeping him up at night. Those faulty swords with uneven blades, the only weapon Sokka had aside from a boomerang. Katara didn’t even know how to waterbend, yet. If they were separated from Aang, then …\n“Zuko,” Sokka says, voice low. “Thank you.”\nZuko stands up, dishes in hand. “Yeah. Whatever. Don’t mention it.” And then he disappears through the trees, dishes in hand, to find the closest river. It isn’t until he’s scrubbed everything clean that he realises he should be focused on escaping and making it back to the Jasmine Dragon, not washing up for his kidnappers.\nHe lays the clean dishes down on a patch of grass, hoping the others will find them when they come looking for him, and then sets out towards Rivermouth.\n \n \n \n \n \nThe next time they grab him, Zuko doesn’t even see them. He’s arguing with Daichi, because the other tea server had let the tea steep for too long. Mid-sentence, Daichi swears and jumps back, and then small hands are wrapping around his waist and Zuko is being hoisted into the air.\nZuko is still holding the teapot. When Aang sets him down in the saddle, he realises just how gentle Aang had been; he hadn’t spilled any of the tea.\nSokka snatches the teapot out of his hands without saying hello, and takes a swig directly from it. “It’s good even cold.”\nKatara grabs it next, taking a sip before passing it on to Aang.\n“It is good,” Katara agrees. “Why don’t you make it for us?”\n“It’s not good. Daichi steeped it for too long,” Zuko says, plucking the teapot out of Sokka’s hands when it circles back to him.\nSokka tries to grab it again, but Zuko rolls to the other side of the saddle and raises one leg, ready to kick Sokka away.\n“It still tastes amazing,” Sokka says, making grabby-hands for the teapot. “Come on, you live on a tea boat! You’re spoiled.”\nZuko stares at them flatly. He peeks over the edge of the saddle to make sure they are flying above open water and not a town, and then throws the teapot over the side with as much force as he can manage.\nSokka wilts. “Is this because--”\n“Yes, it’s because you keep kidnapping me!”\n \n \n \n \n \n“Damnit, Aang,” Sokka says, when Zuko is next dropped into the saddle. “I said to grab him when he was holding tea!”\n“Put him back,” Katara suggests. “We can try again in an hour.”\n“Two kidnappings in two days,” Zuko says flatly, “because you like our tea.”\nHe almost suggests that they just come to the Jasmine Dragon like regular customers, but it probably isn’t a smart idea to invite his kidnappers onto his ship.\n“It is very good tea.” Aang looks as though he’s seriously considering letting Zuko go back to his shift on the Jasmine Dragon, just so they can snatch him up later when he has an armful of tea.\nZuko scoops Momo up and muffles a scream into his soft back. Momo doesn’t even seem to mind. He just starts combing through the pockets of Zuko’s apron, looking for food.\n \n \n \n \n \nThe next day, sometime after the lunchtime rush, Uncle pushes a packed lunch and three bags of biscuits into his hands.\n“Do you want me to deliver this to someone, Uncle?”\n“It’s for you to share,” Iroh says, eyes twinkling.\n“But my break isn’t for another hour--” The rest of Zuko’s sentence is cut off as he is yanked off the deck and into the sky, and then dropped into Appa’s saddle.\n“Hi, Zuko,” Katara says brightly.\nSokka sniffs, peering at the bundle in Zuko’s hands. “What’ve you got there?”\nZuko sighs and unwraps the biscuits. “I brought snacks?”\n \n \n \n \n \nZuko doesn’t realise he’s humming until he looks up from his dinner to see everyone staring at him. He flushes, ducking his head.\n“What a lovely melody, nephew,” Uncle says, breaking the awkward silence. “Where did you learn it?”\nThe tune, lilting and soft like a crooning voice on the wind, had been stuck in his head for days. It had come from Aang. When he sang for others, it was loud, bubbling with laughter, but sometimes, when they were flying for long stretches of time, when Aang was caught up in his own thoughts and didn’t realise he had an audience, he would sing these gentle songs. Delicate and thoughtful, a long-forgotten melody almost lost to time.\nZuko clears his throat, avoiding their eyes. “I’m not sure. I must have picked it up at port.”\nThe crew goes back to their dinners. No one suggests Zuko sing at the next music night, thankfully. No one says anything to him at all. It’s feels like they’re carefully not looking at him, though he catches Daichi’s gaze briefly. His fellow tea server winks at him, before being dragged back into his conversation with Kenzu, their engineer.\nZuko plays with his stew. There’s a lump in his throat, and his face is still flushed, but it’s not a bad feeling. Not at all.\nWhen he looks up again, Uncle is smiling at him.\n“You’re happier these days, nephew. I’m glad to see it.”\n“I don’t know what you’re talking about,” Zuko says, and shoves a spoonful of stew into his mouth to hide his smile.\n \n \n \n \n \nUncle is playing Pai Sho with a handful of crew members, and Zuko is looking over the Jasmine Dragon’s current course with Jee, mapping the places they’ve been over the past few weeks, where they should dock in the future. It’s just a coincidence that their future route brings them closer to the Northern Water Tribe. This is their normal seasonal route. Really.\nThey all go quiet when a shadow falls over the Jasmine Dragon.\nNo one moves as they’re docked by a warship twice their size. Jee nudges him, and says, “Zuko, do you want to check if Chef is--”\n“No,” Zuko says, ignoring everyone’s eyes on him. “I want to hear what they have to say.”\nIn the past, he’s ducked below deck when they run into warships. He didn’t like the way they addressed him, Prince Zuko, with a curled smirk, full of both respect and scorn. Before, he never cared what message they were relaying.\nHe cares now.\nThe lieutenant unfurls a wanted posted. Aang’s face stares back at him. “The hunt for the Avatar has been given prime importance. All information regarding the Avatar must be reported directly to Admiral Zhao.”\n“Zhao has been promoted?” Uncle says, not even bothering to look up from his game of Pai Sho. “Well, good for him.”\nZuko only vaguely remembers Zhao. He does, however, vividly remember Aang, pleading with Zuko to teach him firebending, the way Azula would plead with him to play soldiers when they were very little. He remembers washing dishes side-by-side. Aang, falling asleep on his shoulder on cold nights. Aang, bright and small and twelve.\n“I have nothing,” Zuko says, eyes on the floor, “to report to Admiral Zhao.”\n“If you don’t mind,” Jee says, stepping in front of Zuko, “please get off our ship.”\n“Admiral Zhao is not allowing ships in or out of this area.”\n“Get,” Jee says very firmly, “off our ship.”\nWith a final scrutinising glance at Zuko, the soldiers leave. Jee tries to catch him by the shoulder, say something that might be encouraging or scolding, but Zuko shakes him off and disappears below deck, making a beeline for his room.\n \n \n \n \n \nThey’re not his friends.\nAang is the eye of the storm, and Katara and Sokka have sworn to stay by his side, and Zuko should stay far, far away from them.\nBut he remembers empty palace corridors, and the nobles and servants with their faces turned away, carefully not seeing him, and the choked silence after Ozai had burnt a lesson onto his face in front of the entire court.\nHe could pretend not to see, too. It would be easy. It would be safe.\nAt dusk, Uncle brings him dinner.\n“It’s still early,” Zuko says. They don’t normally eat until well after the sun has set.\n“Yes,” Uncle says, “it is.”\nUncle stares at him. Zuko feels like he’s missing something. He looks down at his noodles, feels sick at the idea of eating them, feels worse at the thought of just sitting here in silence.\nIroh heads for the door. Zuko says, “You’re not staying?”\n“No, not tonight. A watched pot never boils, after all.” Uncle smile, slipping out the door. “Goodnight, nephew. You should sleep in tomorrow. You deserve it.”\nUncle leaves. Zuko stares at the door for a long moment, and then he gets up and fishes his theatre mask out from under his scrolls.\n \n \n \n \n \nZuko wakes up to a hazy forest ceiling and tree roots digging into his back. His head aches. He must have been knocked out.\nHe pushes himself up, and almost topples back down again. He squeezes his eyes shut. When he opens them again, stomach in his mouth and the world still spinning, he sees Aang. He’s curled on a branch high above, like a brightly-coloured bird roosting in the treetops.\n“You remind me of my friend, Kuzon,” Aang says. “If we met in different circumstances, do you think we would be friends?”\nI thought we already were, Zuko doesn’t say.\n“All this time,” Aang goes on, “you’ve been so against joining us. I thought you were scared. I would understand that. I’m afraid a lot of the time, too. Air Nomads don’t believe in violence, but this is war, and I’m the Avatar, and everyone seems to expect me to use violence to fix things.\n“But you’re good at fighting and you don’t shy away from violence. You know how terrible the war is, but you don’t do anything about it. Why is that?” Aang looks down at him. Even sitting so high above him, huddled in on himself, Aang’s stare pierces right through him. “What are you so afraid of, Zuko?”\n“I told you,” Zuko says, voice hoarse. “I don’t want to be involved in the war. I tried that once, a long time ago. It didn’t do anything.”\n“But you wouldn’t be alone.” The pleading tone is back. Zuko is almost glad; the coldness in Aang’s voice had frightened him. “You would have me, and Katara, and Sokka. You wouldn’t even have to fight the Fire Nation much! You’d just have to teach me firebending.”\n“And paint a giant target on my back.”\n“Zuko,” Aang begins.\n“No!” That sour fear helps Zuko push himself to his feet. He paces around the forest floor. “I just want to live with Uncle, selling tea and living far away from the war. Why does it have to me? Why can’t you find some other firebender to teach you?”\n“I can’t,” Aang says. “I know it’s supposed to be you. I don’t know why, but--there’s something deep inside me that keeps gravitating towards you.”\nZuko picks his mask up. He wants to hide his face. His scar. He wants to go home.\n“I’m not who you think I am, Aang.”\n“I can’t keep chasing after you,” Aang says. “I can’t keep wasting time.”\n\nWasting time.\n\nZuko puts the mask on. When he turns on his heels and disappears through the trees without looking back, Aang doesn’t stop him.\n \n \n \n \n \nA shadow falls over the Jasmine Dragon. Zuko calmly puts down the teapot and steps onto the railing. Aang picks him up and carries him to Appa’s back.\nThe siblings don’t smile at him in welcome. Behind the reins, Aang looks like he did that night, perched in the trees, too small and too bright to be real.\n“Aang told us that you saved him,” Katara begins.\n“Thank you, by the way,” Aang says. “I don’t know if I ever said that, but I was really scared and alone and then you saved me so … thank you.”\n“Don’t thank me,” Zuko says.\nKatara frowns at him. “You broke into a heavily guarded Fire Nation fortress, risking both your life and your identity, to save Aang’s life. Why?”\nZuko hunches against the saddle, hands wrapped around his ankles. He can’t explain it to her. He barely understands it himself. Every time he tries to rationalise it in his mind, his thoughts tip sideways, like waves churned up in a storm.\n“I didn’t want the Fire Nation to kill Aang.”\n“They weren’t going to kill me.” Aang sounds small. He sounds twelve. “They said they were going to keep me chained up for the rest of my life. Not alive enough to escape, but not ill enough to die and be reborn.”\nThat would be hell for any person. But for an airbender, that lonely, sedentary existence would be--unimaginable.\n“I didn’t want them to do that, either,” Zuko says, even though he knows it’s not that easy. “That’s why I rescued you.”\n“They’ve been trying to capture him this entire time,” Katara says, eyes blazing. She hasn’t thought of him as the enemy in weeks, but he feels like he’s starting from the beginning all over again. He hadn’t realised her patience was a finite thing. “They’re going to keep trying to capture him and they won’t stop. And we can’t run from them forever.”\n“Fighting in the war and helping an innocent kid are two very different things.”\n“No,” Sokka says, not sounding angry like Katara, just sounding tired. Older. “It’s not. Not when it’s Aang. You know that. It’s why you refused to teach him firebending, right?”\nZuko throws his hands up. “I saved Aang! Why are you all so upset at me?”\nKatara’s anger cracks. Her next breath is a sob, and she puts a hand over her mouth to stifle it. “He could have died. He could have disappeared forever and we might never have seen him again. We wouldn’t have even realised what had happened to him. And that could happen again. Zhao is still out there.”\n“We can’t keep wasting time,” Sokka says, flat, all emotion stamped out of his voice. “Are you going to help Aang? We need to know.”\nZuko thinks about taking off his apron and flying away from the Jasmine dragon; of spending months hiding from the Fire Nation without knowing if he would ever return to Uncle; of Father finding out what he’s done and sending Azula to bring him back to the palace so he can teach him another life lesson.\nIt’s hard to breath, suddenly.\n“No,” Zuko chokes out, throat closing off. “I’m not.”\nHe won’t give up the Jasmine Dragon. He won’t abandon Uncle. They’ll have to find another firebender.\n“Okay,” Sokka says. “Okay.”\nAnd that’s it.\n \n \n \n \n \nThe festival reminds them of Zuko. They smell the Jasmine Dragon in the foreign spices and smoke in the air. They hear Zuko in the music, something slow and jazzy Zuko had hummed when tending to their campfire.\nBut it isn’t the same. The smoke isn’t undercut with the salty ocean breeze. The music is too perfect, the singer a clear-voiced young woman, rather than one of Zuko’s throaty, wavering tunes. The not-quite familiarity only makes Aang miss Zuko more.\nThey don’t spend long there, though. Soon enough, Aang messes up and they’re rescued by an ex-Fire Nation soldier.\n“Jeong Jeong was a Fire Nation general,” Chey says, the campfire casting his face in shadows. “He’s the only person to leave the army and live. I’m the second, but you don’t get to be a legend for that.”\n“Yeah,” Sokka says, shrugging, “we’ve met Fire Nation deserters before. They’re okay people. Bit touchy sometimes, but great at cooking.”\nChey falters. “But you can’t have. People don’t just leave the Fire Nation. Well--they do. I did. But most people don’t. They can’t.”\nSokka shrugs again. “Well, everyone on the Jasmine Dragon did.”\n“Maybe you’ve heard of them?” Katara says.\n“Yeah! There’s our friend, Zuko …” Aang trails off, all his energy leaving him at once. “I want him to be my friend, anyway. I wanted him to teach me how to firebend, but he’s been super reluctant to have anything to do with the war. Is everyone who left the Fire Nation that scared of their own people?”\nChey stares at them, mouth open. “Did you say Zuko?”\n“Yeah, do you know him? He was travelling with his Uncle Iroh. They run a tea shop.”\n“A tea shop,” Chey echoes, strangled.\nSokka points sternly at Aang. “We’re heading to the Northern Water Tribe in the morning. We don’t have time to moon over any firebenders. Including this Jeong Jeong guy.”\n“We gave Zuko a chance,” Katara agrees. “For weeks and weeks. We can’t do that again. We have to keep moving.”\nAang’s shoulders slump. “Yeah, you’re right.”\n“But wait,” Chey says, hands up. “Wait. Zuko? As in--Zuko?”\n“Yes, the tea server Zuko,” Sokka says. “Does everyone know him? The Jasmine Dragon really does get around, huh?”\n“But,” Chey says, looking as though he’s been struck around the face. “Tea server? You’re sure?”\n“Best in the world,” Sokka says, and then stands, stretching. “Come on, guys. We need to head out before someone wanders out of town and stumbles upon Appa. The Northern Water Tribe waits for no man!”\n \n \n \n \n \nIt’s music night, but Zuko isn’t playing the tsungi horn, even though Daichi had tried to pester him into it. If Uncle hadn’t kept sighing about missing him at dinner and being so alone on such a big ship (even though he talks with the crew more regularly than Zuko), he would still be secluded in his room.\nIroh’s singing is low and soothing. Zuko’s eyes drift to the stars. There are no clouds tonight, though he keeps expecting to see a dark figure moving through the sky, blotting out the stars as it barrels towards the Jasmine Dragon, a determined Avatar balanced on his head.\nBut there’s no sign of Appa. He hasn’t seen any of them in over a week, since they scooped him up just to yell at him.\nOne song ends and the next begins. The four seasons. One of Iroh’s favourites.\nHe could fall asleep here, surrounded by the soft humming of the crew. He almost always dozed off during music nights when he was younger.\nHis eyes slip close. And then, Jee says, “Ship approaching.”\nZuko jerks upright. Across the black water, advancing quickly, is a Fire Nation warship. Taller and sleeker and more powerful than the Jasmine Dragon.\nNo one moves, but the music stops. The silence rings right through him.\n“We’re docked. There’s no way we can avoid it,” Jee says. Then, he turns to Zuko. “You should get inside.”\nIt’s what Zuko would have done a month ago, what he’s been doing for years. But now, the idea of slipping below deck, sitting in his room while everyone deals with whatever problem is sailing towards them ...\n“No,” Zuko says. “I won’t leave you to deal with this alone.”\n“It’s not your responsibility,” Jee says. “I’m the Captain. Your Uncle and I can deal with whoever is on that ship just fine.”\nZuko doesn’t want it to be his responsibility. When he had only been on the Jasmine Dragon, it had been easy to bury himself in tea and theatre scrolls and music nights. When he only saw customers, who treated him like an anonymous tea server, or the crew, who treated him like a little brother, or Uncle, who just wanted him to be happy.\nBut then he had been scooped up by a twelve year old Avatar and a pair of Water Tribe siblings, so far from their homes, just like him. Kids burning up with passion. Who knew exactly what had to be done and didn’t shy away from it.\nZuko pulls his loose hair up into a high ponytail. Not a topknot, but Fire Nation enough.\n“We meet whoever it is head on,” Zuko says. “I have no reason to hide. I’m not doing anything wrong.”\nJee looks like he wants to argue, but then Iroh says, “Stay by my side, nephew.”\n \n \n \n \n \n“Admiral Zhao,” Iroh says, “welcome aboard! You’re just in time for music night. Come, join us.”\nZhao’s lip curls. The crew all pretend not to notice his disdain or the threat of the armoured soldiers at his back. Chef is still lightly strumming the banjo. But Zuko sits, stiff and very obvious, beside Iroh.\n“I’m afraid I have more pressing matters to deal with,” Zhao says. “Not that I would expect you to concern yourself with such things, Prince Iroh. You look very busy.”\nIroh smiles through the insult. “Not as busy as you, it seems. What brings you aboard our ship on such a fine evening?”\nZhao waves a lazy hand, and a soldier unfurls an official order. His brother’s signature is a full stop at the bottom of the scroll.\n“Under Fire Lord Ozai’s authority, I am seizing your crew. We’re launching an invasion against the Northern Water Tribe, where we will finally defeat them and capture the Avatar in one fell swoop.” He eyes Zuko, then. Iroh’s smile gets a little more brittle, though he doesn’t let the tension show. Don’t tip your hand, don’t let them know how deeply you care. “Since no one else has been chasing after him. Tell me, Prince Zuko, did you forget your father’s orders, or did you already give up?”\nLowly, Zuko says, “I didn’t forget.”\n“Hm,” Zhao says. “Well, I’m afraid it’s too late. After this week, I’ll have the Avatar. You’ve already made do in the Earth Kingdom for three years. I’m sure you’ll be able to make a life there easily.”\nSome of the crew look like they’re going to start throwing punches soon, so Iroh interjects, “I’m afraid you came here for no reason. The crew are here of their own volition. They were discharged from the military three years ago. They’re under my employment as private hires. You can’t recruit civilians now, can you?”\n“Discharged,” Zhao repeats through his teeth. “And you have the paperwork for this?”\n“Of course.” Iroh nods to Jee, who heads to the control room to find the appropriate paperwork. Technically, Jee is not the Captain of this vessel. The Jasmine Dragon is legally a shop, not a warship, and so requires no Captain; but they all know their duties onboard, regardless.\nIn the silence of Jee’s departure, Zuko says, “How are you planning on capturing the Avatar, Admiral? The last I heard the Avatar was rescued from your stronghold by a spirit.”\nZhao looks sharply at Zuko. Don’t tip your hand, Iroh thinks at his nephew.\n“And how do you know this?”\nZuko shrugs. “Word travels fast, especially at ports.”\nZhao scowls, glare still fixed on Zuko. Iroh cannot help but wonder what he has heard about him. What Ozai might have told Zhao about him.\n“Nevermind that. I am accruing an armada to attack the Northern Water Tribe head-on. They won’t stand a chance.”\nZuko blinks up at Zhao, as innocent and politely curious as he is with the wealthy customers who tip well. “And the spirits? What if one rescues the Avatar again? The Avatar is the bridge between worlds. He could summon one to his aid again.”\nZhao’s smile is sudden and twisted-up. “I’m going to deal with the spirits ahead of time. The Water Tribe are stupid enough to have spirits in a physical form right in the middle of their city--or so my sources say. As soon as we break through the walls, it’ll be simple to kill them and leave the waterbenders defenceless.”\nIroh’s placid court-face slips. “You can’t. Spirits don’t work that way. The Fire Nation needs them to keep the balance of the world, just as the Water Tribe does.”\n“It doesn’t concern you,” Zhao says. “Just keep running your tea shop, Prince Iroh.”\nJee comes back with the papers, then. Zhao looks them over with a deepening scowl. It takes everything Iroh has not to strike down the man where he stands, before he can sail out to the Northern Water Tribe and do irreparable damage to the world.\nZuko puts a hand on his elbow, just out of view of Zhao’s scowl. His nephew looks at him, something especially bright in his eyes. The Avatar is there, Iroh remembers. Zuko’s friends.\nDon’t tip your hand, Zuko’s eyes say. Iroh has taught him well.\nZhao shoves the papers at Jee. “So this isn’t classified as a military vessel, anymore. A tea shop. Really, Prince Iroh? You would let your nephew pull you down to his level?”\n“Will that be all?” Zuko asks in the even, professional voice he uses on customers.\n“Yes,” Zhao says, casting a last scathing look at the Jasmine Dragon. “That’s all.”\nZuko smiles, and it doesn’t reach his eyes. “Thank you for stopping by. We hope to see you again soon. Have a great day.”\n“You should reconsider this farce, Prince Iroh,” Zhao says. “Don’t forget what I said in my letters. My offer to join me still stands, if you change your mind.”\nZhao barges past Jee and heads back to his own ship. Zuko’s polite smile stays fixed to his face until the ship has begun to sail away. Iroh thinks, yet again, that the Jasmine Dragon has taught his nephew how to be a good ruler more efficiently than Ozai ever did. If Zuko can deal with Zhao like that, he can deal with any number of nobles with dead-end ideas and backward insults.\nOnce the ship is shrinking in the distance, Iroh puts a hand on Zuko’s shoulder.\n“Are you alright, nephew?”\nZuko’s hands clench into fists. He’s still staring at Zhao’s warship, disappearing into the black night, off to collect more souls before he makes the journey to the Northern Water Tribe.\n“I have an idea,” Zuko says, “but I’m worried you’re going to stop me.”\nIroh is worried about the opposite; that he will give in to his nephew’s plan, because Zuko is sixteen years old and looks happier as a tea server than he ever did as a prince.\nBut because the war is plummeting into a death spin, and the Avatar is twelve years old and needs the right people by his side, and Zuko needs to embrace his royal birthright--because Zhao just confessed to a plot to kill spirits, Iroh just smiles, and says, “Tell me how I can help.”\n \n \n \n \n \n“I’m worried,” Jee says.\n“I’m almost an adult.”\n“No,” Jee says, “you’re not. I don’t think a man can understand how young he is until he gets old.”\n“You sound like Uncle,” Zuko accuses.\n“I don’t know why Iroh isn’t stopping you from doing this,” Jee says, pacing angrily up and down the kitchen, “but I know someone has to. You’re getting very close to something you said you wanted no part in when you abandoned your mission.”\nZuko looks down at his soup. “I know.”\n“Then why? You said you wanted a quiet life away from the war.”\n“I do,” Zuko says, and that’s the truth. “But ...”\n“You haven’t decided to regain your honour again, have you?” Chef asks, already busy cleaning the rice for their breakfast. “Because your father had no idea of your worth. You shouldn’t listen to anything he ever said--”\n“No, it’s not that.”\nZuko stirs his soup, trying to find the right words for the too-big feeling unfurling in his chest. Chef doesn’t scold him for playing with his food. That, more than anything, tells Zuko how serious this is.\n“People always say,” he begins, “Someone should do something. They’ve been saying it for years, now. I’ve been saying it, too. Everytime I see another ruined village or hear about people who have lost loved ones to the war, I think someone should do something about that. But if we’ve all been saying it, then nothing is actually getting done, is it?\n“I think the world expects that ‘someone’ to be Aang. But he’s twelve. And if the whole world sits back and watches a kid flounder under everyone’s expectations, then they’re only making everything worse. They’re a part of the problem.”\n“Zuko,” Jee says.\n“And besides, we’ve been in the Earth Kingdom for over three years, now. These people--I feel close to them in a way I never thought I would. Responsible, almost. I know I don’t owe anyone anything, and I don’t want to go back to the Fire Nation, or join any sort of rebellion, or leave Uncle, but ...” Zuko stops. Pulls on his hair, still tied up in a ponytail. “But I can’t just sit back and watch bad things happen. Not when it’s the Fire Nation in the wrong.\n“And if I can do something, even if it’s just something small like this … then I have to, don’t I?”\nThe kitchen swells with silence. Zuko pushes his soup away. His stomach is too tied up to eat, even if Chef might nag him.\nBut when he looks up, Chef and Jee are just staring at him. Zuko can’t read their expressions.\n“It’s easy to forget sometimes, but ...” Chef begins.\nJee nods. “He really is royalty.”\nZuko jerks out of his seat, scowling. “No, I’m not. Not anymore. I’m not doing this to go back to the Fire Nation. I’m just--I’m going to go help my friends, and then I’m coming right back here again.”\n“Friends,” Jee says to Chef.\n“He’s finally growing up,” Chef says, and they both laugh when Zuko, red-faced, starts shouting at them.\n \n \n \n \n \n“I must apologise about my lack of manners the other night,” Iroh says, pouring two cups of tea. A standard, bland blend. Iroh will not waste good tea on this man. “It has been so long since I was at court.”\nZhao doesn’t quite manage to hide his smirk behind his teacup. “A man of your caliber is squandered on that ship, Prince Iroh.”\nIroh sighs. “Yes, you made me realise that last night.”\n“So have you reconsidered my offer?”\nIroh sips at his tea, pretending to gather his thoughts. He struggles not to grimace--both at the taste and at his words. “Yes, I accept. It will be an honour to serve as your general.”\n“And what of your nephew?” Zhao says. “Unfortunately, an untrained boy like Prince Zuko has no place on my ship.”\nThat untrained boy already has made his way onto Zhao’s ship. That boy who looked so pale and grim, dressed in an adult’s armour so he can sneak into a city under siege. Iroh’s heart hurts for him, even if he’s so unbelievably proud.\n“He’s sixteen, he needs to learn how to live on his own,” Iroh says. “The Jasmine Dragon has sailed into warmer waters. The crew will keep an eye on him.”\n“Of course,” Zhao says, almost gently. “It is better for him to be out of the way. Safer. I’m sure the crew will take good care of him.”\nHe’ll have to send a messenger hawk off to Jee, to remind them to keep someone on constant-guard for assassins. There is no prince onboard to target, but that doesn’t mean the rest of the crew won’t be hurt if Zhao sends someone after them.\n“For now, though.” Iroh lifts his teacup into the air. “To the Fire Nation.”\nZhao holds his tea up. “To victory!”\n \n \n \n \n \n“You’re going into the lion’s den, nephew,” Uncle says, slipping through the door silently. “You can’t be caught by anyone other than a friend.”\n“I know that,” Zuko snaps. “Don’t you think I know that?”\n“I’m sorry.”\n“No.” Zuko turns, then. He had grown used to seeing Uncle in comfortable green and browns. Seeing him in a red cloak fine enough for a retired General is strange. Uncle looks so stiff and washed out. And scared. “I’m sorry, Uncle. You just wanted to sell tea and live peacefully, and now, because of me, you’ve been dragged back into the war.”\nUncle cups his face. Zuko can’t help but lean into it, eyes falling shut.\n“All I wanted was to live happily with you, Zuko. I never wanted your father to stop you from living your own life. But now you’re standing up for what you believe in, you’re making strong friends, you’re carving out a path for yourself--and I couldn’t be prouder.”\n“I don’t want to be involved in the war,” Zuko admits, voice small, “but I don’t want my friends to be hurt either. And … and I want the war to end.”\nZuko closes his eyes, enjoying the simple warmth of Uncle’s touch, the safety he felt next to him.\n“I need to help the Avatar, don’t I?”\n“You don’t need to do anything, my nephew. This is your life. Only you can choose how to live it.”\n“I thought I had already chosen,” Zuko says.\n“We get more than one chance to make decisions in life.”\nZuko draws back with a sigh. “Right.”\n“I’m sorry for nagging you. I only worry. Ever since I lost my son ...”\n“You don’t have to say it.”\n“I think of you as my own.”\nZuko shudders and leans his full weight into Uncle, who envelops him into a tight hug. They stand there, holding on to each other, all of their unsaid words tangible in the air.\nZuko forces himself to pull away. “We’ll meet again, Uncle.”\nHe climbs into the rowboat and begins to lower himself down to the dark ocean.\n“Remember your breath of fire,” Uncle says quickly, leaning over the edge to watch his descent. “It could save your life out there.”\n“I will.”\n“And put your hood up! Keep your ears warm.”\n“I’ll be fine,” Zuko calls up to him.\nThe rowboat lands with a soft splash. Zuko picks up the oars and steadies himself, pushes his thoughts away from the warm safety of his uncle and onto the dangerous journey ahead of him.\n \n \n \n \n \nIn a stroke of rare luck, Zuko finds a pack of seal-turtles diving through a tunnel in the ice. He follows them into the near-black ocean. The water is cold enough to burn. Even with his inner fire simmering in his chest, his limbs go numb. He swims as far as he can manage, comes up for air, and then forces himself to continue on.\nHe finally reaches the city. It’s bigger and grander than he was expecting--not because he still believes the lies he was told as a child about the Fire Nation’s superiority, but because he has never been around so much snow. Who knew you could do so much with it?\nHow is he supposed to find Aang, Katara and Sokka in such a large city, hyper-vigilant with the Fire Nation at their gates? He’ll be spotted. And killed.\nThe thought slides out of his head a moment later. He doesn’t think much of anything, after that. His feet lead him through empty streets, winding further and further up, until he comes to a round wooden door.\nHe climbs inside and almost chokes on the warm air. An island of grass and vegetation surrounds a koi pond. Seated by the water is a white-haired teenager he doesn’t recognise, Katara, and a faintly-glowing Aang.\n“He’ll be fine so long as we don’t move his body,” Katara tells the other girl. “That’s his way over to the spirit world.”\n“Maybe we should get some help?”\nKatara smiles. “No. He’s my friend. I’m perfectly capable of protecting him.”\n“The anmarda will be gunning for him specifically,” Zuko says loudly. The girls whirl around. “Katara, I know you’re upset with me, but please, you don’t know what Zhao is capable of. We have to get Aang somewhere safe.”\nThe other girl looks ready to bolt for the door. The Jasmine Dragon has been driven out of port by mobs, before. But here, there’s nowhere to go. No crew at his back. And he doubts he would survive any mob formed in the middle of the Northern Water Tribe.\n“It’s okay,” Katara says, hand out, almost as though she’s ready to grab the girl if she runs. “He’s my friend, too. Yue, this is Zuko. Zuko, this is Princess Yue.”\nZuko bows, lower than he would if he was still a prince. “I’m sorry for frightening you. I know a firebender is the last thing you want to see right now, but I come with news.”\nYue doesn’t come any closer, but she also doesn’t run off and alert the guards. That’s alright. Zuko wasn’t expecting a warm reception. Not everyone is as stupidly friendly as Aang, Katara, and Sokka.\n“If you’re here to warn us that the Fire Nation is planning an attack,” Katara says dryly, “then you’re a little too late.”\nZuko glances around the oasis. It’s so open, so undefended. It would be ravaged by the Fire Nation, another casualty in this siege.\n“No,” Zuko says. “It’s worse than that. It’s Zhao--he’s planning on killing the spirits.”\n \n \n \n \n \n“They’re not going to believe us,” Sokka points out.\nThey’re gathered in a circle on the grass, where they can still see Aang’s eerily glowing form. When Yue had left to fetch him, Zuko had half-expected Sokka to storm through the wooden door with his katana drawn.\nBut instead, Sokka had barrelled into the oasis and swept Zuko into a hug.\n“They’ll believe us,” Katara says. “It’s Zuko they won’t believe.”\n“Yeah, they’ll probably drown him.”\n“Thanks,” Zuko says.\nSokka shrugs. “What do you want me to tell you, buddy? Not everyone understands the nuances of the world like we do.”\n“This coming from the guy that wanted to fight me the second he realised the Jasmine Dragon was run by firebenders.”\n“People change!”\nZuko smiles. He can’t help it. He’s in the middle of the Northern Water Tribe while it’s under siege, after years of staying as far away from active combat as he could--and yet he’s happier than he has been in weeks. Even though his body is still frozen through, his breath of life and the warm oasis air the only things keeping hypothermia from setting in. Even though a strange princess is sitting across from him, staring at him as though he’s a foreign species.\nHe had missed his friends. Their easy banter. The way they effortlessly made him feel included, like he belonged. He missed them.\nHe just wants them to be safe.\nWhen he starts thinking that they should just grab Aang and make a run for it before Zhao gets the jump on them, Aang jerks awakes with a shout. “Zuko!”\nAang stumbles to his feet and spins around to face them. Katara tackles him in a hug. He leans into her embrace, smiling over her shoulder at them. “Hi there, Zuko.”\nBut Aang hadn’t been facing him when he said his name. Could he hear them in the spirit world?\nSokka must have had the same thought. “How did you …?”\nAang shrugs. “Just had a feeling Zuko would be here.”\nSokka and Zuko exchange baffled glances.\n“Spirit magic gives me a headache,” Sokka says.\nZuko shakes his head. They don’t have time for this. “Aang, Zhao is coming to kill the spirits. Spirit. I don’t know, but--we have to stop him.”\nAang blanches, looking back at the calm pond. “He can’t do that. It’ll throw the entire world out of balance.”\n“Uncle tried to tell him that, but he didn’t listen. He only cares about furthering the might of the Fire Nation.” Zuko can’t keep the bitterness out of his voice. Maybe the years at sea, surrounded by war-affected Earth Kingdom natives, has skewed his perception of his homeland.\nWhen Zuko looks across the grass, he finds Yue staring back at him.\n“You’re far from home,” she says softly. “Don’t you miss the Fire Nation?”\n“No.” Zuko pauses. The grass under his knees blurs. He can almost hear the sound of turtleducks splashing in the royal pond, feel the sweet humidity of the air. “Yes. I don’t know.”\nMaybe Zuko does still love his country, his patriotism buried deep beneath the old fear, but he does not love the people that lead it. He does not love what fire hunger has done to them.\n“You’re conflicted.”\n“I loved my home and my people, but I didn’t love the way they made me feel or the pain I was forced to bear because of duty.”\nYue keeps starting at him with her unnaturally blue eyes. “I understand. I love my people, but sometimes, I think ....”\nYue looks away, towards Sokka, and startles when she finds them all staring at her and Zuko. She reflexively straightens and smoothes out her skirt. Zuko would blush if his blood was circulating normally.\n“Sorry to interrupt this, uh, weird bonding,” Sokka says awkwardly, “but we were just wondering how to move the spirit-fish.”\n“We’re not going to alert the Chief to Zhao’s plans?” Zuko asks.\nAang shakes his head. “It would slow us down, and I’m the Avatar. It’s my responsibility to protect the spirit world.”\nZuko stands up, his legs aching, and examines the koi caught in an endless loop. “Do you have a bowl? Or, uh. A bucket?”\nNot the most sacred of containers, but as long as the spirits were safe, did they care about how dignified their rescue was?\n“No,” Katara says, climbing to her feet, “but you do have a waterbender.”\n \n \n \n \n \nThey climb onto Appa with the koi fish suspended above them, still swimming in perfect circles inside Katara’s bubble.\nZuko tries to convince them to fly as far away from the invading fleet as they can, but Yue refuses. She won’t leave her people to die at the Fire Nation’s hands while she escapes to safety.\n“You won’t have any people left if Zhao gets his hand on the spirits,” Zuko snaps, but Yue sits tall and unflinching under his stare. “You’re being stupid about this.”\n“I’m a princess,” Yue says simply. “I won’t run from my people.”\nThe rest of them are benders or experienced warriors. Yue can’t do anything against the Fire Nation--and yet she’ll stand against it. She won’t run away and save herself.\n“The Fire Nation will kill you,” Zuko says. “They’d enjoy it, too.”\n“Zuko,” Sokka snaps.\nYue holds up a hand. “It’s okay, Sokka. He’s just as stressed as we are.”\nSokka backs down, but keeps his glare aimed at Zuko.\n“It’s not just my sense of duty,” Yue continues. “I don’t know why, but I get this feeling that we have to stay close. Inside the city limits, at least. It’s like something deep inside me just … knows.”\n“Me, too,” Aang says.\n“Like your body is leading you forward even though your mind doesn’t know why or where?” Zuko says.\nYue nods. “Exactly like that. Do you feel it, too?”\n“No, but I felt something similar earlier, when I was looking for Aang. I didn’t know where you all were or how to navigate the city, but somehow, I found the oasis almost immediately.”\nSokka throws his hands into the air. “Great, more spooky magic! Am I the only one that hasn’t had a weird spiritual experience? Katara?”\n“I have no idea what they’re talking about,” Katara says, “but I trust them. We’ll stay somewhere nearby.”\n“Fine,” Sokka says, “but we’re going somewhere defensible. Or at least somewhere where Zhao won’t be able to corner us.”\n \n \n \n \n \nHovering at the top of her city, beneath the rays of the full moon, Yue witnesses the true violence of the Fire Nation. She sees the dark stain of their tanks against the snow and the fury of their fire, great bursts that push her people back and decimate their buildings.\nIt lights a vast anger inside her. An alien emotion. There’s something else waking up inside her, rising like a sea-beast swimming slowly towards the surface, its body so great that it disturbs the ocean around it.\nThis is wrong, Yue thinks, as she watches the Fire Nation break through their inner walls.\nThis is wrong. As she hears her people’s screams, the smell of soot overwhelming the familiar brine of her home.\nThis is wrong. As the sun sets and the firebender’s attacks glow brighter in the falling darkness.\nThis can’t happen. As Zhao begins the trek towards them on rhino-back, a pack of soldiers behind him, ready to help him bring down the sky bison.\n\nThis can’t be allowed to happen.\n\nZuko shifts beside her. When she looks at him, she sees her fear reflected back at her. He’s a firebender, but even he’s frightened of the Fire Nation.\nIt would frighten her too, if her people had become so lost. Would she do something to stop them, like Zuko is?\nBut then, she has always felt voiceless. Her people are peaceful, but sometimes their decisions aren’t always right, and she feels more like an object that belongs to them than a person born to protect them. Even now, she has been relegated to the side, forced to watch her city fall.\n\nThis is wrong.\n\nThey are her people, and she has always been their’s, and no outsiders can come and hurt them.\n“Uh, guys?” Sokka asks. “One of the spirit-fish is glowing.”\nYue doesn’t look away from the city, sprawled beneath them.\n“Aang, did you do that?” Katara asks.\n“No, I don’t know what’s going on. It is a full moon, though. Does the moon spirit always glow during full moons?”\n“I don’t know.” Sokka touches Yue’s shoulder. She doesn’t move. “Yue? Yue--hey, what’s wrong with your eyes?”\nYue stands. They are a very long way up, but the distance feels like nothing to her. She is used to hanging suspended above the ground.\n“Sokka, don’t touch her,” Aang warns.\n“But this isn’t normal! She shouldn’t glow, she’s not the Avatar. Yue, sit back down. We can fix this. We can help you.”\nYue’s friends sound as though they are a great distance away. She manages to pull away, breach through the surface of her mind, long enough to say, “I have to protect my people, Sokka. This is what I was born to do. I won’t sit by idly ever again.”\nYue steps onto the edge of Appa’s saddle. Her friends shout at her, but she has already slipped beneath the veil of power again. She has become them and they do not waste time on mortals’ words.\nHands tear at the back of their dress, try to pull them away from the edge, but they do not move. Cannot be moved by anyone else’s will.\nYue steps into the open air. They do not fall. They float, and all at once they are more complete and more full of rage than they have ever been.\n \n \n \n \n \nThey watch from the safety of Appa’s saddle as Yue hovers above her city. Except--it’s not Yue. Not entirely. Not just her.\nHer skirt has taken on a strange sheen, like wet ice glowing under moonlight. She is haloed in light. Her hair seems longer, wilder, caught in the wind, even though the night air is exceptionally still.\nSokka’s face has cracked open. He hangs over the edge of the saddle, hands outstretched. Katara holds onto the back of his shirt in case he does something stupid like jump after her.\nThe fighting below them slows. Waterbenders and firebenders stop and stare, mesmerized at the woman suspended above them. The Water Tribe falls to their knees in worship. Some firebenders crumple too, in fear or sheer disbelief. Yue passes by these people without a second glance.\nBut to the firebenders that do not kneel, she sweeps a hand through the air. The fabric of reality splinters open at her command, and those left standing are brought down, spasming in pain. Alive, but in that moment, wishing for death.\nSome run. Some stay, frozen. Those that stand and try and fight, those that keep lashing fire against the melting hide of her city--those, Yue kills.\nZhao stares up at her, unmoving and defiant, still clasping the knife he would have used to kill the moon spirit. With a flick of her wrist, Yue separates his soul from his body, and his corpse lands with a thump in the snow.\nWhen she reaches the outer wall, she doesn’t need to keep fighting. She stands, a protector, the last barrier between the fleet and the Northern Water Tribe, and waits. The ocean rises up to help her sister and pushes the ships further out. The ships don’t try to fight.\nOr rather--that’s not quite true. Soldiers scramble on deck, but they can’t launch an attack at her. Their capataults will not light. Their fists will not spark. The Moon Spirit is the sister of Agni, a being made in his reflection. Firebenders rely on the refracted sunlight beaming off the moon, just as everyone else does. And he will not let them raise a hand to her.\nShe waits, as the foot-soldiers scramble out of the city and into rowboats. As they sail quickly out to their warships. When the soldiers have either fled or been killed, she calls to her sister. The ocean surges up once more and the ships are pushed far away from the Water Tribe in a great wave.\nWhen they are gone, the Moon Spirit recedes, leaving only Yue, the girl, to collapse back onto the snow.\n \n \n \n \n \nThey land Appa near the outer-wall. Sokka almost breaks his ankle jumping off the saddle and onto unstable snow, but he doesn’t pause, just sprints until he’s by Yue’s side.\nAang and Katara stay on top of Appa, bracketing Zuko. He shivers between them, stupidly grateful for the warmth and the silent protection they offer.\nChief Arnook and a healer are bent over Yue. Sokka speaks quickly with them. Then sags.\nHe cups his hands to his mouth, and calls, “She’s okay.”\nKatara sighs with relief. Aang looks like he’s going to start crying.\n“That should’ve been me,” he says. “I’m the Avatar. It’s my job to protect people and deal with spirits.”\n“You can’t do everything yourself,” Zuko says. “You’re a kid, Aang. You’re a person. You need to let people help you, okay?”\nKatara knocks her feet against Zuko’s. “What a change of heart you’ve had, Zuko. You were fighting us for so long and then suddenly we leave you alone, and you come running after us?”\nZuko is too cold to blush, but he ducks his head, anyway. “I was worried about you. If you hadn’t known what Zhao was planning, the Fire Nation would’ve killed the spirits, and then what would the world have done?”\n“Thank you, Zuko,” Aang says.\n“Don’t mention it,” Zuko says. “Really. Please stop mentioning it.”\nSokka is talking very quickly with the chief. They can’t hear what he’s saying, but they keep looking back at them. The Fire Nation threat might have been dealt with, but there’s still a very real possibility that Zuko is going to get shoved down an icy ravine.\n“I’ll vouch for you,” Aang says, standing. “Katara--”\n“I’ll stay on guard duty,” Katara says, patting Zuko’s arm.\nAfter a lot of quick talking and several promises that Zuko stays with the Avatar and friends at all times, they don’t throw him into the black ocean or lock him in a cell. Zuko makes sure to stick close to his friends, anyway.\nKatara leads them back to the little room they’ve been staying in. Sokka trails along behind them, still in shock.\nInside, they start piling furs into the middle of the room. When Katara shoves him into the middle of the nest, Zuko goes. He’s quiet as they pile in around him, pushing in as close as they can.\n“Why did you come?” Sokka asks, breaking the silence. He’s got an arm slung over Katara, his hand grasping Zuko’s jacket.\n“I heard what Zhao was planning and I--” Zuko swallows, closing his eyes. Aang presses in a little closer, his nose digging into Zuko’s ribs. “I couldn’t let that happen. I couldn’t just bury my head in the sand, the way I’ve been doing for three years.”\nSokka huffs. “Took you long enough.”\n“Welcome to the family, Sifu Zuko,” Aang says.\nZuko closes his eyes, his throat tight and burning, and says, “Thanks for having me.”\n \n \n \n \n \nIn the morning, they visit Yue. His friends crowd around the door, but Zuko hangs back. Aside from Uncle and King Bumi, Yue was the first royal he had spoken to in three years. She was his age, and so determined to help her people that she had given herself to the moon spirit without knowing if she would ever come back.\nHe doesn’t know her, though. Not the way Katara and Aang and Sokka know her. But she rattles him.\nBut then a healer slips out of Yue’s room and says, “She wants to speak with the firebender.”\n“What?” Zuko says.\n“Princess Yue wants to speak to you alone,” says the healer again. “Don’t keep her waiting.”\nYue’s bedroom is three times as large as the room they’d stayed in last night, with a roaring fire keeping it comfortably warm. Under a mound of furs, Yue looks fragile and wane. Though, if Zuko squints, he can still see a faint flicker of unnatural light in her eyes, as though she were lit from within.\nHe bows and settles by her bedside, trying not to fidget. “How are you?” he asks awkwardly.\n“I’m well,” she says. “The healers say I just need to rest. Spirit encounters drain a lot of energy.”\n“That wasn’t just an encounter.”\nShe smiles, a quick acknowledgement of her power, and then asks, “And how are you? It mustn’t be easy being in the North Pole. I’m sure you’ve found both the temperature and the people rather cold.”\n“I didn’t come here expecting to be comfortable. I came here to help my friends.”\n“Not many people would do the same.” She pauses, studying him carefully. “I heard that Master Pakku vouched for you, too. I hadn’t realised you were acquainted.”\nZuko blinks. “I’ve met plenty of people from the Southern Water Tribe--but not the Northern one.”\n“He didn’t explain how he knew you, but Master Pakku is a highly respected waterbender, so my father took his word for it.” Yue keeps staring at him with those too-bright eyes. “Something tells me you’re not just an ordinary firebender, though.”\nZuko stiffens. “I don’t know what you’re talking about.”\nYue hums, looking away. “Well, you’ve inspired me. You came here to stand up for what you believed in, not what your people said was right. I decided to do the same.\n“I spoke with my father this morning and I stood up for what I believed in. I don’t know if he’s just humouring me right now, while I’m so drained and he’s so shaken from what occurred, but I think he listened. And even if he didn’t, I’m not going to back down.”\nZuko furrows his eyebrows. “What do you mean?”\n“In the Northern Water Tribe, women don’t have much power. I was in an arranged marriage before everything happened. My husband would have been chief. But I won’t sit quietly as people speak for me. Not anymore.\n“It helps that people saw that I can turn into the moon spirit, I suppose. They’re not going to underestimate me again.”\n“Be careful,” Zuko says, a lump in his throat. “I stood up to my father, too. More than once. It didn’t end well.”\nYue’s eyes flick to his scar. Zuko nods, and she claps a hand over her mouth.\nThe words come tumbling out. “I spent years trying to change his mind about me. It wasn’t until I realised that I would never be the son he wanted, that I didn’t want to be the kind of person he would be proud of, that I was finally happy.”\nZuko tugs on his braid. After everything that has happened, his ribbon has managed to survive.\n“I don’t like talking about it,” Zuko goes on, “but if you’re going to stand up against the traditions of your people, you should know. It can be dangerous.”\n“Thank you for telling me, but my father is the chief. He’s a good man. I’m sure he wouldn’t--”\nZuko’s mouth feels glued shut. He unsticks his tongue, and says, “My father is the Fire Lord.”\n“What?” Yue says.\n“I thought he wouldn’t do anything either, until--until he did. The last time I stood up to my father, I was banished.”\nYue sits up, furs falling into her lap, and pulls Zuko into a tight hug. When she draws away, her eyes are wet. “I’m sorry. I’m sorry that happened to you, Prince Zuko. I hope the Avatar defeats the Fire Lord so you can go home safely.”\n“I already have a home,” Zuko says, “and it’s not the Fire Palace.”\nHe feels more tired than he has felt in a long while, even after a full night’s sleep sandwiched between his friends. Suddenly, he desperately misses Iroh and his humble, warm bedroom and the kitchen, manned by Chef, who was always there to listen and scold him for being stupid and coax his secrets out of him with cinnamon biscuits.\nHe’s never been away from the Jasmine Dragon for longer than a few days before. The idea of leaving with the Avatar, never knowing when he’ll see Uncle again, when he can let his guard down and relax--it burns him right through.\nHe needs to see Uncle.\n“Zuko?” Yue prompts, gentle. “Are you alright?”\nZuko has run out of words. He nods tightly, and she takes his hand. Her fingers are small and soft between his. It’s strange to think that this is the hand that stopped a battle the night before.\n“You’re okay, now,” she says, and there’s something especially soothing about her voice. He believes every word she says. The Water Tribe is crazy if they can’t see that she would make an amazing leader. “You were so brave, coming to help us. You saved a lot of people’s lives. You might have saved the entire world--if the Fire Nation had taken the spirits and the Avatar, the war might have been lost.” Yue squeezes his hand. “I suppose I should call you Prince Zuko, though, shouldn’t I?”\n“I’m not a prince,” Zuko says. “Not anymore. And my friends don’t know yet. I’m not ready for them to know.”\n“I won’t tell them.”\nHe laughs, and it sounds wet and weak. “Thanks, Yue. You’ll make an amazing leader someday.”\nYue ducks her head. He thinks, for a moment, that he’s upset her, but when she looks back up again, she’s smiling, shy but proud, and the light in her eyes is even brighter. “I will make a great chief,” she says, voice strong. “And you will, too.”\nThe smile drops off Zuko’s face. “What? No. No.”\n“When the war is over, you must get in contact with us. We need to create some kind of trade agreement between our nations. The Northern Water Tribe has been too isolated for too long.”\n“Yue,” Zuko hisses, “I was banished, remember? I’ll never be--I don’t want to be--”\n“I thought the same thing, before yesterday.” She drops his hand, shooting him one last wane smile, before gesturing for the door. “Can you send Sokka in, please? I need to speak with him.”\n \n \n \n \n \nThat afternoon, Appa is packed with fresh supplies. Yue is strong enough to meet them out on the courtyard, standing tall by her father’s side.\nMaster Pakku is there, too. Katara and Aang’s waterbending teacher. The man who vouched for him.\n“I’ve decided to go to the South Pole,” Pakku says to Katara. “Some other benders and healers want to join me. It’s time we helped rebuild our sister tribe.”\n“What about Aang?” Katara says. “He still needs to learn waterbending.”\n“Well,” Pakku says, “then he better get used to calling you Master Katara.”\nKatara smiles, bright and proud, and Zuko remembers the girl who practiced for hours by the river, lifting wobbly water-bubbles into the air, tripping over her own clumsy stances but getting back up again, every time. He’s proud of her, too. He can’t wait to spar with her.\n“Aang has two masters, now,” Katara says, nudging Zuko.\nZuko rolls his eyes. “Wait until he starts calling you ‘Sifu Katara’ every other day, then we’ll see if you’re still smiling about it.”\n“You’ve decided to become the Avatar’s firebending master, then?” Pakku asks, eyeing Zuko.\nZuko looks away. “I guess so.”\n“There is no guess,” Pakku says sharply. “There is only do or do not.”\nPakku sounds like Uncle--if Uncle didn’t care for tea and fine foods, and was far stricter. Zuko purses his lips together. “Princess Yue says you vouched for me last night. Why is that? We’ve never met before today.”\n“I’ve had tea with your uncle before,” Pakku says, as if it’s that simple. “He’s a wonderful Pai Sho player.”\n“Your family really does know everybody,” Katara says, laughing.\nZuko winces. “You have no idea.”\nAfter a final round of goodbyes, they climb onto Appa. Aside from the night before, in the middle of the siege, Zuko thinks this is the first time he has willingly climbed onto Appa.\n“Sokka,” Katara says quietly, “what about Yue?”\nSokka takes a deep, pained breath. “My place is with you and Aang and Zuko,” he says, subdued. “And her place is here. That’s all.”\nZuko doesn’t know if he’s ready to throw himself into life as Aang’s firebending teacher immediately. He needs to see Uncle, and sleep in his own futon, and spend an afternoon serving tea and reading theatre scrolls, just to get the image of the ravaged city and red corpses lying in the snow out of his head.\nBut--he feels like he could join them. Like he will. Like every single frustrating time they kidnapped him was just a lead up to the inevitable.\nAppa takes off with a jolt. The Arctic winds burn their eyes, and they huddle together at the back of the saddle, Zuko pressed between Katara and Sokka, breathing wisps of steam, keeping them all warm.\nThey fly until they see green land--and then they keep flying.\nAgni’s touch grows stronger and sweeter the longer they fly, but Zuko still feels strangely unmoored, his stomach in knots. This feeling–it reminds him of sailing out of Fire Nation waters for the first time, knowing he may never return.\n“We should land soon,” Aang says.\nZuko curls up tighter in his borrowed parka, huddled between Katara and Sokka. “We need to keep going.”\nAang frowns. “We’ve been in the air all day. It’ll be good to rest.”\n“We can rest when we’re safe.”\n“Zuko,” Katara says.\nZuko shoves away from the siblings and crawls to the other side of the saddle, suddenly feeling claustrophobic. “You don’t understand. The Fire Nation would have seen me during the siege. They’d know that I…” He swallows hard. “What about Uncle? What if they got caught up in the attack and they need help? What if–”\n“Zuko,” Kata says again, softer this time.\nZuko exhales. He concentrates on heating the air between his palms. There’s no pot between his hands, but the act of boiling tea, of pretending to boil tea, calms him. He imagines water bubbling away, the aroma of tea leaves, the murmur of customers out on the sun-baked deck.\nSlowly, the black sea retreats from his lungs and it becomes easier to breathe.\n“We’ll keep going,” Aang decides.\nZuko lowers his still-warm hands. “Thank you.”\nNo one speaks after Zuko’s outbursts, but when Katara and Sokka wriggle over to his side of the saddle, he opens his arms and lets them huddle close.\n \n \n \n \nThe Jasmine Dragon is hard to spot in the near-dusk, docked in a small, unpopulated bay. Zuko’s eyesight has been half-ruined ever since the Agni Kai. He never would have found it. But just before sunset, Appa makes a low and hungry moan and tips to the left.\n“You and me both, dude,” Sokka mumbles against Zuko’s arm.\n“I think he can smell something,” Aang says. He pauses, and then he and Zuko both blurt: “Tea leaves!”\nAang lets Appa steer them towards the Jasmine Dragon on scent alone. They land in the middle of the deck to the excited shouts of the crew.\nZuko throws himself up and over the saddle, landing with a roll. He sprints across the deck. The crew try to grab at him, yank him into a hug, but Zuko dodges and keeps running.\nHe crashes into Iroh and almost sends them both tumbling overboard.\nUncle latches onto the back of Zuko’s parka and holds him tight. Zuko presses his face into Uncle’s shoulder, hiding his own tears and taking in the smell of smoke and jasmine.\nThey hold each other for a long moment before Uncle finds the breath to ask: “What happened?”\n“I think I met the moon spirit.” Uncle pulls back to look at Zuko’s face. Zuko shrugs back at him. “The moon spirit possessed the princess. It was… kind of a blur.”\nUncle laughs. “You never do things by halves, nephew. I’m just glad you came back to me.”\n“Always, Uncle.”\n“And your friends?” Uncle asks, peering over Zuko’s shoulder. “Are the young kidnappers well?”\n“Hi, Uncle!” Aang calls. “Can we get some more red bean buns? And maybe some green tea?” Appa bellows and nudges Aang with his nose. “Oh, and I think Appa would like some treats too, if you have them.”\nZuko stares balefully at Uncle. “You’ve fed my kidnappers bison?”\n“I have no idea what you mean, nephew,” Uncle says to Zuko, and then very obviously winks at Aang.\nIroh bustles below deck to make tea. Chef pulls Zuko in a hug, sweeping him clear off his feet, and then insists they all sit while he makes them a warm meal.\nWhile they eat, Sokka talks about their plans to fly deeper into Earth Kingdom territory in search of Aang’s earthbending teacher. As Sokka speaks, the black ocean rises up and over Zuko’s head again. He hunches over his tea, sucking in the smell of jasmine, and tries to ride it out.\nEvery time Zuko thinks the waves are retreating, he remembers that he will have to leave the Jasmine Dragon again and the sucking tide pulls him back under again.\n“I can’t,” Zuko manages, interrupting Sokka.\nThe conversation stops. All eyes are on him, even Chef’s. Zuko focuses on the scorches and stains on the benchtop. Many of them were left by Zuko’s first disastrous attempts at cooking as a half-blind Fire Prince.\nZuko scratches at a scorch-mark with his thumb, not looking at his friends. “I’m staying on the Jasmine Dragon.”\nThe kitchen swells with silence. Aang is frozen with honeyed pear halfway to his mouth. Honey drips onto his tunic.\nKatara stands abruptly, chair screeching. She looks like she’s going to water-whip him. Aang fumbles for her sleeve but she shrugs him off.\n“You snuck into the Northern Water Tribe when it was under siege to warn us about Zhao,” Katara says through her teeth. “You’re involved now, Zuko. You can’t keep pretending the war isn’t happening after–”\n“That’s not what I’m saying! I don’t want to stay behind permanently. It’s just– I’m not ready to leave the Jasmine Dragon. And I doubt having a firebender tagging along when you’re trekking through the Earth Kingdom and interviewing earthbenders will be all that helpful.”\nKatara makes a face and opens her mouth, ready to argue with him. Iroh cuts her off. “My nephew has a point. It will be good for you to learn the elements in order, young Avatar. You already have air, and now a tentative grip on water. Next, you will learn earthbending, and then you can come back for my nephew. He’ll teach you the final element.”\nHis friends exchange unsure looks. Zuko purses his lips, if only to contain the apology bubbling up his throat. This has been so much, and Zuko’s heart is only so strong, and he wants to stay with his uncle for as long as he possibly can.\n“The next time you kidnap me,” Zuko says, “I won’t fight it. I just need more time to say goodbye.”\nSokka strokes his chin. “Hm, it would be fun to kidnap you again.”\nAang perks up. “But you will teach me firebending? After I start learning earthbending?”\nZuko steps away from Uncle and bows. Not the bow of a Fire Prince. The bow of a tea server.\n“Avatar Aang,” he says in the formal cadence he hasn’t used since he was at court, “I promise that I will be your fire-master when you return to me.”\nAang throws himself over the benchtop and drags Zuko into a twirling hug. “Sifu Hotman!” he cries, and Zuko wonders, not for the first time, what exactly he’s gotten himself into.\n \n \n \n \n \nThey wave down at the Jasmine Dragon until the small figures on deck, waving back at them, are too small to be seen. They keep staring at the small dot that is the Jasmine Dragon until it disappears into the horizon.\n“I know he was only with us properly for a few days,” Katara says, “but it feels weird not having him here.”\n“I’m going to miss him,” Aang says.\nSokka groans, throwing his head back. “Why did we let our cook and portable heat-pack stay behind? Aang, turn around. We need to go and kidnap him again.”\n“We agreed we were going to wait until I found an earthbending teacher first.”\n“But it’s cold up here without Zuko!”\nKatara smacks him over the head. “You’re going to miss him just as much as we are. Admit it.”\n“Yeah, I’ll miss his cooking. Now Aang and I have to go back to eating your mush–” Katara dives for him. Sokka shrieks and scrambles away. “I also miss having someone normal around.”\n“I’m normal,” Aang says.\n“No, Aang,” Katara says, managing to sound gentle even as she hooks an elbow around Sokka’s neck and starts to choke him out, “you’re really not.”\n \n \n \nZuko stares up at the cloudless sky. Appa has long since melted into the distance, but he can’t bring himself to move.\nUncle gives him some time to sulk, and then comes and presses an apron into his hands. Zuko shoves down his hurt, his uncertainty, his strange sense of longing, and gets back to work.\n \n \n \n \nAang pivots on his heel, attempting to find Katara and Sokka through the twisting trees. A flash of crimson makes him freeze. He fights his way through the soupy marsh and finds himself in an open clearing.\nIn the middle of the clearing, perfectly serene, sits his fire-bending master.\nAang approaches hesitantly. “Zuko?”\nZuko doesn’t look up at him. The skirts of his robe are haloed around him in a near-perfect circle. The robes are fine crimson silk with gold embroidery, far nicer than anything Zuko has worn before. More expensive than a tea server could afford.\nZuko has always seemed afraid of the Fire Nation. Whenever they mention it, his breathing quickens and he shrinks in on himself, as though trying to make himself smaller. And yet this Zuko, wearing crimson robes and a gold five-pronged hairpiece, holding a beautiful teapot between his palms, looks utterly peaceful.\nA girl’s laughter rings through the trees. Aang whirls around. Another apparition–a young girl with milk-white eyes–flits through the trees and calls him away from the ethereal sight in the clearing.\n \n \n \n \n \n“First a tea server that wants nothing to do with us,” Sokka says, “and now a blind noble that wants nothing to do with us. You really know how to pick your bending masters, huh, Aang?”\n“Does it have to be her?” Katara asks. “There are plenty of benders in the Earth Kingdom. Can’t we just find someone else?”\nAang shakes his head. “It has to be her. I saw her in the forest.”\n“Well, you might need to think of more options,” Sokka says, “because she might not come with us.”\n“We could kidnap her,” Aang suggests. “It worked with Zuko.”\nThere’s a moment of silence as they contemplate that.\n“Something tells me that Toph wouldn’t go along with it like Zuko did,” Katara says eventually.\nAang wilts. “You’re probably right.”\nSokka pats him on the shoulder. “It’s okay, buddy. We can always kidnap Zuko next time we see him.”\n \n \n \n \n \nIt’s easy to forget that Toph, who clicked with the group as easily as Zuko had, had never actually met Zuko.\nAt dinner, Sokka had remarked, off-hand, that he missed Zuko’s cooking. Katara had snapped back that she missed having someone around who didn’t take her for granted and actually pulled their weight. Sokka took offense, because he had been “been doing plenty around here and following Zuko’s lead”, which made Toph slam down her bowl of lukewarm soup.\n“Alright,” she says, “someone needs to tell me who this Zuko guy is.”\n“He’s my firebending teacher,” Aang says from where he had been hovering on the fringes of the sibling’s argument.\n“Oh, yeah? Then where is he?”\nSokka winces. “He’s… still working through his issues. We’re going to kidnap him once Aang has the earthbending basics down.”\nToph perks up. “Kidnap him?”\n“Well, he gave us permission this time.”\n“This time? You guys have been going around kidnapping people?”\n“No!” Aang says quickly. “Only Zuko.”\nToph cackles and throws her arms into the air, spilling some ofher soup onto Sokka. “And here I was thinking you guys were boring!”\nAang winces and tries to defend himself. “He was the first good firebender I had met since before the war, and something told me he needed to be my teacher. Just like with you.”\n“Plus,” Sokka cuts in, “he cooks like an absolute champion. And he lives on a floating tea shop, so he’s literally a professional at brewing tea.”\nKatara nods. “He doesn’t complain about chores. And he appreciates women.”\n“I value women!” Katara’s soup twists in its bowl, like a snake considering striking, and Sokka quickly adds, “Now I do. I’ve gotten better. I have!”\n“So, wait,” Toph says, before the siblings can start bickering again, “is this guy your firebending teacher? Because he sounds more likely to take out a restraining order on you all, not join you.”\n“He only wanted to press charges at the beginning,” Katara says, like that makes that any better. Toph wonders if, had she turned down their offer to run away with them, they would have kidnapped her. Probably not. Toph would have kicked their asses if they’d tried.“But he warmed up to us,” Sokka says, and then laughs. “Get it, warmed up to us? Because he’s a firebender?” He holds up a hand for Aang to high-five, which he does, but probably just out of pity.\nKatara ignores him. “He joined us in the Northern Water Tribe, even though he knew it was under siege by the Fire Nation. He might still be hesitant to join us full-time, but it’s not an easy thing to fight against your own people.”\n“We’re going to go pick him up soon,” Sokka says. “Now that we have you. Hey, Aang, you have all three of your bending teachers!”\nAang and Sokka do a little dance around the fire, with Aang wearing Momo like a chittering hat, and Katara laughs. They all seem happier talking about this strange firebender than they have in days.\n \n \n \n \nZuko spends the weeks after the siege at the North Pole slowly saying goodbye to the Jasmine Dragon.\nHe thinks he loves the repurposed warship with its rusted edges and cramped rooms more than he ever loved the Fire Palace. When he was thirteen years old and still feverish with pain, he thought this ship was his own personal hell, something he simply had to withstand before he could win back his honour. Now, the Jasmine Dragon is his home.\nHe spends time with each of the crew. He willingly helps out in the laundry room and the engine rooms more than he ever has before, and ignores the ribbing that earns him. He spends his evenings bent over Earth Kingdom maps, reacquainting himself with the inland geography, rather than just the ports. And when his eyes are dry and his heart is pounding, he slips into the kitchens and finds Chef. If he was going to get underfoot, Chef used to say when Zuko was thirteen and lured to the kitchens by the smell of cinnamon, then he might as well learn something useful.\nThe meals that Chef cooks now–that, Zuko realises, he’s been cooking since Zuko was first kidnapped by Aang–have been simple. Easy. Something filling any hungry teenager could make with simple, cost-effective ingredients and a campfire.\nHe spends more time with Uncle, too.\n“I’m going to miss the Jasmine Dragon,” Zuko admits one evening, tea steeping between his heated palms. “I’m going to miss…”\nUncle reaches across the table to grasp Zuko’s wrist, squeezing it gently. “From what I have heard of your friends, you will be in good company. I will miss you dearly, but I take comfort in the knowledge that you will have them to keep you steady and remind you to eat.”\nZuko huffs, blowing his fringe out of his eyes. “I do more cooking than the rest of them!”\n“Would you cook as often and as well for yourself, as you do for your friends?” Uncle laughs at Zuko’s expression. “They are good for you, nephew. And we will always be here to welcome you home. After.”\nZuko tries not to dwell over what stands between his friends and after.\n \n \n \n \nA shadow falls over the Jasmine Dragon. Zuko whirls around, wielding his broom like a sword, his fight or flight instinct kicking in before his conscious mind has even recognised the danger.\n“Oh, so soon?” Iroh asks. “But music night is tonight!”\nAppa is flying low above them. Aang is behind the reins. Sokka and Katara wave at him from over the side of the saddle. An unfamiliar blot of green sits behind them, hovering at Aang to fly lower.\nIroh disappears below deck while the rest of the crew says goodbye to Zuko.\n“We’ll miss your Tsungi Horn playing,” Daichi tells him solemnly. “If you see your dad, kick him in the nuts for us.”\nZuko splutters. “What?”\nAppa loops around the ship. He only stops when he’s almost on top of them. Aang’s newly acquired earthbender, who looks even smaller than Aang himself, hangs over the side of the saddle. She’s small and fine-boned like a doll and wearing a truly menacing smile.\nThe deck rocks underfoot. Zuko stumbles, dropping the broom. A wave crests the side of the ship, and Zuko has a moment to send up an apology to uncle for dying on him, before the wave skims the surface of the deck and encircles his waist. Zuko’s feet leave the ship. He yelps, scrambling for purchase, unable to keep himself from being thrown up into the air.\nHe lands on Appa’s saddle, sopping wet. He blinks dazedly at his friends and their new member, leaning into Sokka and cackling.\n“You’ve gotten better,” Zuko says, blinking sea-water out of his eyes.\nKatara smiles sweetly, and it’s the same look Azula used to shoot him before setting his tunic on fire. “Thank you.”\nThe earthbender snorts. “I would have done anything to see those early kidnapping attempts.”\n“Hey,” Sokka says, “my story-telling was pretty good, wasn’t it?”\n“It was,” she agrees, before turning that feral smile on Zuko. “Did you really flail that much?”\nZuko wrings water out of his braid, scowling. “No.”\n“Yes,” Katara says.\n“Yes!” Aang agrees from behind the reins. “Hi, Zuko! I wanted to be the one to kidnap you, but Katara said it was her turn since I did it last time.”\n“If you’re on dry land next, I’m totally doing the kidnapping,” the earthbender tells him.\nZuko sighs. “There won’t be a next time.”\nThe earthbender shrugs, unbothered. “That’s what you think.”\nWhat a horribly ominous statement.\nZuko agreed a while back that he would go willingly when the Avatar and his friends needed him. He’s had weeks to come to terms with his decisions. Weeks of Iroh’s proud, secretive smile and proverbs and last-minute firebending lessons, so he remembers everything he needs to pass onto Aang. He’d been worried that his panic would rise up like the ocean and smother him when it was time to leave the Jasmine Dragon, but he feels bright and steady as the midday sun. Looking around at the faces of his friends, he can’t remember why he was ever afraid of loving them.\n“NEPHEW!”\nZuko gasps. “I didn’t say goodbye to Uncle!”\nAang circles back around and flies lower. Katara lowers him back down to his ship using the same arm of water, drenching Zuko further. As soon as he’s in arms reach, Iroh crushes him to his chest.\n“I’m so proud of you, Prince Zuko,” Iroh murmurs, quiet enough that only Zuko will hear. It is the first time Iroh has called him ‘prince’ in a very long time. Years. Hearing it now is a shock, waking him up. “Please be safe and come back to me in one piece.”\n“I will,” Zuko says, and means it. He won’t force Iroh to grieve another son.\nThe crew have gathered to see him off. Zuko quietly puts up with them passing him around, giving hugs and thumps on the arm and hair ruffles, though he scowls the whole time and tries valiantly to pretend he’s not blushing.\nIroh hands him his things: his bag, packed weeks ago; his dao swords, polished and tucked into their scabbards; a heavy bag of food from Chef; and a slightly smaller bag full of tea.\nThis time, it’s Zuko that pulls Iroh into a hug. His chest aches. He doesn’t want to leave this ship, the one that has become a home to him, but staying here feels too much like running away. And his friends need him.\nZuko pulls away. If his breathing has gone shaky and Iroh’s eyes are red-rimmed, no one comments on it.\n“I’ll see you soon,” Zuko says, because he can’t bring himself to say goodbye.\nAs Katara heaves him back to Appa, Zuko waves to everyone on the Jasmine Dragon. They stand on the deck, seeing him off, until Appa flies too high and they lose sight of each other.\n“Is that bread I smell?” the earthbender says loudly, inching across the saddle to get to Zuko and the fresh bakery smell. When she’s within reaching distance, she touches his arm, trying to untangle him from the food, and then stops. “You’re warm. Really warm.”\nZuko gapes at her. “It took Sokka weeks to figure that out. We only just met!”\n“Warm,” says the earthbender again, and curls up against Zuko’s shoulder.\n \n \n \n \nThe earthbender’s name is Toph. She’s blind and twelve and more powerful than most earthbenders Zuko has met before.\nZuko likes her immediately.\n \n \n \n \n“Sugar queen,” Toph says into the best damn curry she’s ever tasted in her life, “you’re fired.”\n“That’s what I said!” Sokka says, already on his second serving.\n“If you didn’t like my food,” Katara huffs, “then you didn’t have to eat it.”\n“It’s not that we didn’t like it,” Sokka backpedals, “it’s just that Zuko is very talented. He works on a tea boat! A professional fancy tea boat! Of course he’s going to have some culinary talents.”\nZuko grimaces. “I don’t know if you could call the Jasmine Dragon professional or fancy. It’s run out of decommissioned warship.”\nToph lowers her spoon. “Wait. You sell tea out of an old Fire Nation warship? What the fuck. How did you manage to swing that? Did you steal it?”\n“Uh,” Zuko says.\n“They’re Fire Nation, remember?” Aang pipes up.\nToph waves him off. “Yeah, I know, but it’s still a warship. Are you ex-military, firefly?”\n“Uh,” Zuko says again. “No, but everyone else on the Jasmine Dragon used to be in the army. Like my Uncle. They, uh, discharged themselves a couple of years ago. The war...”\n“You don’t have to go into it,” Katara says softly, laying a hand on Zuko’s knee. Toph can’t blame her for the casual contact; she always thought she disliked being touched before she joined up with this band of misfits and met their firebender. Touching him feels like laying out on a sun-warmed rock on a cool winter day.\n“Thanks,” Zuko says, equally soft.\n \n \n \n \nZuko sidles up to Toph midway through Aang’s training. “Are you okay? I saw you fighting with Katara earlier.”\nToph ignores him. Her arms are crossed, legs shoulder-width apart, focused entirely on Aang’s clumsy bending.\nZuko wishes that Uncle were here. He’d know what to say. “You know, it took me a really long time to be able to make small talk with customers in the Earth Kingdom. I’ve never, uh, been great with small talk in general. I’m still not…”\n“Yeah,” Toph cuts in, “you’re blowing me away with your conversation skills.”\nZuko runs a hand through his hair, his fringe dry with dust. “It took a long time for me to get over the cultural difference, I mean. I’d never even seen people who weren’t Fire Nation before I—um. Left it.” He barges past that fumble quickly. “It took me a while to learn how to speak a different language as a tea server. And isn’t that what you’re doing with us?”\nToph snorts. “You trying to say I should start speaking Katara’s language? I understand her just fine, bus boy.”\nAang twirls several fist-sized rocks into the air with a flourish. Toph stomps her foot. The rocks clutter to the ground and Aang’s eyes go wide.\n“Airbending, twinkle toes!”\nAang looks like a kicked badger-dog. “Sorry, Sifu Toph. It’s a habit.”\n“Too bad! More boulder laps.”\nAang groans and heaves the boulder back onto his shoulders. He takes off at a fast run around the makeshift training area.\nToph scowls, turning to face Zuko full-on. “Look, sparky, I don’t need another lecture about knowing my place and pulling my weight or whatever. Especially not from someone that spent months being kidnapped by these idiots. One of us didn’t need to be abducted into helping the Avatar and it wasn’t you.”\nZuko winces. She’s not wrong. He’s never willingly made a change like she has. It took being banished for him to see Ozai for who he really was. Not even burning half his face off in front of the entire court did that.\nAnd even then, it took almost-daily kidnappings for him to befriend the Avatar. Toph, at twelve, is braver than he’s ever been.\nZuko wets his lips, following Aang’s unsteady progress with his eyes. “When the Jasmine Dragon first opened, I was terrible at regular chores. I burnt the tea and soaked the deck when I tried to mop it and turned everyone’s under-things pink when it was my turn to do laundry. Even though I liked the work.”\n“You’re not going to make me suddenly like cleaning dishes.”\n“You belong here,” Zuko tells her just as Uncle had told him years ago, when he was young and easily frustrated and still made foul-tasting tea. “That means you do what the rest of us do. Teach Aang. Tease Sokka. And yeah, wash dishes. It’s not about doing things because someone says you should, it’s about doing things because they’re the right thing to do. Because it makes someone else’s life a little easier.”\nToph goes quiet, though she’s still scowling. It had taken Zuko years to truly understand what Uncle had been saying to him all along, and even now, half of Uncle’s proverbs still fly over his head.\n“You’re not going to guilt me into helping with the cooking,” she says at least.\n“Not trying to guilt you into anything,” Zuko says, stepping away. “Just giving some advice. Uncle says it’s a server’s job to be good at gossip and advice, as well as brewing a good cup of tea.”\nThat actually earns him a laugh. “You’re good at gossiping?”\nZuko grimaces. “No. Not really.” He has no idea how Uncle does it so effortlessly with so many different people, a Pai Sho table between them and the world’s current events on their lips. “But if you listen to someone doing it for long enough, you start to pick up the basics.”\nHe pulls out a small bundle of biscuits cooked over the campfire and throws them at her. Another thing he learnt from Uncle: treats go a long way.\n“You don’t have to do anything you don’t want to,” Zuko says, “but think about what I said, okay? Properly being a part of something can feel pretty amazing.”\nAang spots Toph eating biscuits and shouts, “Can I have some too?”\nToph shoves them all into her mouth. With a spray of crumbs, she yells back, “Keep going, arrow-head! You have another twenty laps to go!”\nZuko’s laugh doesn’t manage to cover up Aang’s groan.\n \n \n \nAang is normally the first person asleep in the evenings. That was previously Zuko, since Katara and Sokka are Water Tribe. Even if Sokka is a non-bender, he is still a descendent of the moon spirit, and the night affects him, though not as strongly as it affects Katara.\nBut now, all of Aang’s boundless energy is going towards training with all three of his teachers. He only recently grasped earthbending--a mammoth task, according to Toph--and is now learning firebending basics.\nZuko has conferred with Katara and Toph more than once. They need to keep Aang’s lessons separate. They don’t have the luxury of time, so they can’t space them out further, give Aang a longer break between, but they can keep an eye on him and make sure their conflicting bending styles aren’t slipping through. Not in a way that’s detrimental to Aang, anyway.\nMaybe it will be good for him. The four elements are more interconnected than people realise. Aang is the bridge between them, and his bending style would have always become a mash of the four elements. And maybe, because he is being taught by three different masters in such close proximity, the four bending arts will come together to make something even stronger. Maybe that will make something beautiful.\n \n \n \n \n \nAang, splayed out on the dry ground, hoping the spirit world will do him this one solid and let him melt through the veil between worlds so he could be incorporeal for a while.\n“She’s a little rough,” Katara says, “but you were the one who was so insistent on making her your earthbending teacher.”\n“It wasn’t me! Well. It was me. But it was the spirits guiding me to her.” Aang closes his eyes, his lids appearing deep red where the sun pierces through them. He’s too sore to raise his arm over his face to block it. “They’ve been guiding me all along. Even with you and Sokka and Zuko. And now with Toph … I just didn’t expect this to be so hard.” He laughs weakly. “And I was so excited to finally have three masters to teach me.”\n“Aang,” Sokka interrupts.\nAang peers up at him. “What?”\nSokka brandishes his sword and gestures for Aang to get to his feet. “All four masters. Come on, pupil Aang, up you get. We’re wasting daylight.”\n“Sokka, I’m the Avatar. I don’t need to learn how to use a sword.”\n“Aw, but I feel so left out. I want to kick you around, too!”\n\n“Sokka no.”\n\n \n \n \n \n“There’s no time for mini-vacations,” Sokka says, looking as stern as any teenager standing in a chorus of goffers can.\n“Sokka’s not wrong,” Zuko says, a phrase that feels fundamentally wrong coming out of his mouth--not because Sokka is usually wrong when it comes to planning, but because of the smug look that takes over Sokka’s face when he says it. Katara looks like she’s going to water-whip Sokka, but then thinks better of it.\nAang wilts, lowering his flute. “I’m learning the elements as fast as I can. I practise hard every day with Toph, Katara, and Zuko. I have three masters now. I’ve been training my arrow off!”\n“What’s wrong with having a little fun in our down time?” Katara sounds just like Uncle. Not for the first time that week, homesickness threatens to drag Zuko under.\nToph nudges him in the side, and Zuko musters up a small smile for her. She huffs. He doesn’t know how she reads him so well, especially being blind. Maybe it’s because she’s blind. He doesn’t mind it, though. She might snore and eat the last of the leftovers (something he’s familiar with, after living on the Jasmine Dragon), and fight with him about hogging Aang, but. She’s family now.\nThe others don’t notice their silent exchange.\n“Even if you do master all of the elements,” Sokka says, “then what? It’s not like we have a map of the Fire Nation. Should we just head West until we reach the Fire Lord’s house? And then knock?”\n“Um,” Zuko says. Everyone turns to him. “I know where the Fire Lord’s house is.” He shakes his head. The word ‘house’ feels wrong in his mouth, just like the word ‘home’ used to. “Palace,” he amends. “I know where the Fire Palace is.”\nBecause I lived there for thirteen years, he doesn’t say.\nSokka smacks himself in the forehead. “Of course! We have a walking encyclopedia of Fire Nation knowledge. Sorry, Zuko. I forget you’re Fire Nation on account of the whole ‘you’re not evil’ thing.”\nZuko never forgets. He’s hyper aware of the sun’s position, its strong rays beating down on the arid desert. The blandness of Earth Kingdom. The wrongness of green and brown in place of red and black.\nThe Jasmine Dragon is the homing beacon his heart wants to return to. He only visits the Fire Palace when he’s asleep.\n“Could you make a map?” Sokka asks. “Or provide us with Fire Nation intelligence?”\n“Zuko, providing intelligence? No way,” Toph says, and then laughs when he whirls on her, offended. “Come on, Sokka basically dangled the joke in front of me. I had to.”\n“I could probably draw a rough map,” Zuko says, still glaring at Toph, “but I don’t know how useful it’ll be. It’s been years since I was in the Fire Nation so my knowledge isn’t current.”\nZuko might have spent years being drilled on geography by strict tutors, but he hasn’t had any reason to look at a Fire Nation map since he was banished.\nSokka looks much more relaxed. “It’s something, at least. I knew picking you up was a good idea.”\n“You wanted to clobber him with your boomerang when we first met,” Katara corrects.\nSokka weaves through the goffer tunnels and throws his arms around Zuko. He instinctively hugs back, even if only to keep them both from toppling over into the dirt. “That was before I knew him! I appreciate him now. Our cooking, fire-lighting, map-creating, intelligence-having firebender.”\n“Sokka, get off me or I’m not drawing you anything.”\nSokka jumps away from Zuko. “Right. I’ll just … I’ll fetch us some paper.”\nAfter Zuko starts outlining the draft of a map and Aang spends some more time playing with the goffers, they go to Katara’s mini-vacation: a very disappointing natural ice spring. And there, they meet a professor, who tells them about a very sketchy sounding library in the middle of the desert. Zuko is quietly excited by the thought of ancient theater scrolls.\n“Zuko said he doesn’t have current information,” Sokka says, perched eagerly on the edge of Appa’s saddle as they circle the desert.\n“And an ancient library will?” Toph throws back.\nSokka points at her. “Okay, no, but Zuko is a tea server. He isn’t going to know about the important stuff, like palace schematics or naval bases. Right, Zuko?”\nZuko, who learnt about all of those things as the Crown Prince to the Fire Nation, swallows, throat suddenly dry. He musters up a smile that doesn’t feel right on his face. “Right.”\n \n \n \n \nThe library begins to collapse around them. Sokka and Aang sprint in the other direction, while Katara pulls him behind a shadow aisle to hide. Zuko watches his friends go, and realises that, even though he left the safety of the Jasmine Dragon, he’s still not sure if this war is worth fighting if it means his friends lay down their lives.\nHe doesn’t say that, though.\nWhen they remerge in the desert, barely escaping being trapped underground with a vengeful spirit for the rest of their lives, they find Toph collapsed on her knees. Just Toph.\n“We did it!” Sokka says, tackling Katara in a hug. “There’s a solar eclipse coming. The Fire Nation’s in trouble now.”\n“That’s what you were after?” Zuko snaps, whirling on them. His heart still feels like it’s going to crawl out of his mouth. “A worthless eclipse?”\nSokka pulls away from Katara. “But firebenders can’t bend during an eclipse. They’ll be defenseless. If we attack on that day, then--”\n“The royal family are as paranoid as they are crazy,” Zuko says, feeling hollow. “You don’t think the Fire Nation doesn’t know that our bending can be switched off? That’s the one day they’ll be expecting an attack. They’ll have Fire Sages tracking the movement of the stars in preparation of the eclipse. That …” He sinks to the ground. It still feels like the sand underneath him is shifting, falling, the library burying even deeper into the earth far below them. “That’s nothing, Sokka.”\nSokka stares at him, scroll tucked to his chest. “But … But that’s all we have. If we don’t--”\nAnd then Aang asks, in a very small voice, “Where’s Appa?”\n \n \n \n \nThey almost die in the desert. Toph and Aang become despondent in the wake of Appa’s disappearance. Sokka becomes desperate for something after his last-ditch effort to form a plan was struck down so quickly by Zuko.\nKatara swings between looking lost and fiercely determined. One night, as they lay down to sleep she inches close to him, the way she might if it was a cold night and the others were using him as a heat source.\nHer eyes are wet. “Thank you,” she whispers, reaching for his hand.\nZuko blinks. “Why are you thanking me? I’m just as lost as you are.”\n“But you’re here. You’re a firebender, I know you’re not going to go mad with heat-stroke like the others. If you hadn’t agreed to join us, I would have had to look after the others by myself, and I ...”\n“You’d do an amazing job,” Zuko says.\n“Maybe,” she allows, sniffling. “But the thought still scares me.”\nZuko grips her hand. He doesn’t admit that the idea of them being all alone out here, without him, scares him too.\n \n \n \n \nAfter they’re denied entry to Ba Sing Se, they pick up three refugees and an old friend.\n“Look at you,” Suki says, pulling Zuko into a hug. “You’re out and about, making friends and fighting in the war. Who’d have thought?”\nZuko squirms out of her grip, face warm. “You sound like Uncle.”\n“How is Iroh?” she asks. “Is he the one that set you up with this lot? He’s been meaning to find you more friends, you know. More than just the Kyoshi Warriors, anyway.”\nZuko looks over her shoulder. Aang is carefully not looking at them. “Uncle is fine. He wasn’t the one that introduced me to Aang. He did that himself. Forcefully.”\nSuki blinks. “What?”\n“They kidnapped him,” Toph interjects, grinning. “Like, multiple times. Scooped him off his little tea boat and soared away, like a hawk-sparrow snatching up a baby mouse-bat.”\nSuki bursts out laughing. “You guys kidnapped him?”\n“Hey,” Aang defends. “I needed a firebending teacher, and he kept running away!”\nZuko sighs. “They wouldn’t take no for an answer.”\n“Oh, no,” Suki says, though she’s still fighting not to laugh. “You’re not being held against your will, are you, Zuko? Do I need to rescue you from the Avatar?”\n“I joined them on my own this time,” Zuko says. “They wore me down.”\nToph elbows him. “No, I kidnapped him.”\n“I let you kidnap me!”\nThe three refugees are standing off to the side, watching them and clearly very confused. “The Avatar kidnaps people?”\nThey look at Zuko worryingly. “You’re a firebender?”\n“He’s a good firebender,” Sokka says.\n“He has the Avatar seal of approval,” Aang says. “He’s my firebending teacher. He’s a good guy. And he makes great tea!”\nAfter the sandbenders tell them Appa was taken to Ba Sing Se, after Aang slips beneath the angry thrall of the Avatar State, after a long trip where they encounter Suki and refugee couple who seem wary of Zuko but eventually warm up to him, they make it to Ba Sing Se.\nThe Fire Nation beats them there.\n \n \n \nZuko stays at the back of the group. He knows that in green and brown, hair braided simply down his back, he passes easily as an Earth Kingdom native. But sometimes, if he ventures too close to people who have seen firebenders–fought firebenders–they’ll see the gold flash of his eyes and know who he is. What he is. And here, in the Earth Kingdom capital, with the Jasmine Dragon so far away, his identity has the potential to ruin them.\nGeneral Sung smiles sunnily at them. “I assure you, the Fire Nation cannot penetrate Ba Sing Se. Many have tried to break through it, but none have succeeded.”\n“What about the Dragon of the West?” Toph asks. “He got in.”\nZuko is suddenly very interested in his sand-covered boots. So dusty. The leather is almost yellow from days of walking. So fascinating.\nGeneral Sung clears his throat. “Yes, but he was quickly expunged.”\nThey watch as an elite team of earthbenders are swifty taken down. From this distance, they don’t see who subdues them so quickly and efficiently, but it leaves Zuko feeling cold all over and General Sung desperate enough to accept Aang’s offer of help.\nThey meet the defeated earthbenders in the healers’ room. There are no visible wounds, though all of them are immobile. Their limp, unharmed forms, most of them conscious but groaning and twitching faintly, itches at the back of Zuko’s mind.\nKatara kneels beside an earthbender, her hands glowing blue. “His chi is blocked… Who did this to you?”\n“Two girls ambushed us,” says the earthbender. “One of us hit me with a bunch of quick jabs, and suddenly I couldn’t earthbend and I could barely move. And then she cartwheeled away.”\nA chi-bender. A cartwheeling chi-bender.\nTy Lee would hate the brutality of the drill, such an ugly and large eyesore. And he can’t remember her ever being interested in or motivated in the war. She cared about greater ideals.\nLike friendship.\nZuko stumbles back, throat tight. There’s nowhere to run. He’s at the very top of Ba Sing Se’s impenetrable wall and below him, closer than she has been in years, is his sister. Has she come to drag him home?\nHe never should have left the Jasmine Dragon, he thinks, one hand knotted in his hair. He never should have dreamed that he could be anything more than a tea server, or that the world could be anything more than what it already is.\n“It must be Ty Lee.” Katara’s voice sounds very far away. “She doesn’t look dangerous, but she knows the human body and its weak points. It’s like she takes you down from the inside.”\nShe used to practice on him sometimes. She wasn’t as talented when they were very small. It only worked sometimes and it would hurt rather than feel numb like it was supposed to, but she would always apologise and weave flowers in his hair to make it up to him, and–and–\nZuko can’t breathe.\n“Oh, oh, oh!” Sokka says, jumping in place. “What you just said: that’s how we’re going to take down the drill. The same way Ty Lee took down all these big earthbenders.”\nToph touches his elbow. “Zuko, are you alright?”\nGeneral Sung wrings his hands together, glancing between them. “Is your friend alright?”\n“I’m fine,” Zuko manages, eyes squeezed shut. “I just… need to sit down.”\nGeneral Sung escorts him to a nearby storage room, empty save for dusty boxes. Toph stays long enough for him to wrestle control of his breathing. She takes his hand, squeezing his fingers, and promises to be back as soon as she can.\nHis thoughts come flooding back when she leaves, overwhelming him. He holds on for as long as he can. He runs through Uncle’s breathing exercises and steady mantras–I am safe; I am loved; I am far away from him–but every time he opens his eyes and sees a cramped cupboard instead of the Jasmine Dragon’s familiar walls, his calm slips away.\nTime passes in a strange and unknowable haze. When his friends return, Zuko feels numb and far-away from his body. He flinches when hands reach for him, but the familiar murmur of voices and faces brings him back to himself and, with a gasp, he shuffles closer and lets them hold him.\n \n \n \n \nHis friends are watching him. They had seen how calm he had been at the Northern Water Tribe with an armada beating down their door. And somehow now, suddenly, he falls apart.\nToph is a steady lump by his side. She pokes him in the cheek whenever he starts to drift away again. “Sparky, you need to calm down or your heart is going to beat right out of your chest, and then we’ll have to find someone else to cook for us.”\n“I can cook,” Katara says, indignant.\nToph huffs. “Barely.”\n“Okay, okay,” Aang says, getting in between them. “I think we’re all just a little concerned about what happened earlier. Panic attacks don’t always have to have a cause, but it looked like something set you off, Zuko. Can you tell us what happened? So we don’t accidentally hurt you in the future?”\n“It wasn’t any of you,” Zuko says, fidgeting in place. “I just… thought I recognised someone.”\n“Ty Lee?” Katara guesses. “Have you run into her before? Her chi-blocks are no joke, especially for benders.”\nZuko fiddles with his sleeves. He wants to get up and make tea, but the apartment is still empty. If they were going to stay here, he would have to go to the markets and stock up.\nThree sets of eyes peer curiously at him. Toph’s gaze has settled on his left knee, but he can tell she’s listening intently, even if she’s lounging against him and picking at her nails.\nHe hasn’t willingly told anyone who he was since he gave up on capturing the Avatar. Sometimes, people would squint and cock their heads like they were trying to recall where they had seen him before, but he always had Iroh and the rest of the crew to lie for him.\nBut these are his friends. He trusts them.\nZuko shoves his hands under his thighs to stop them from shaking. “I knew Ty Lee from before… before. I know Mai and Azula, too.”\nThey hadn’t told him that Mai and Azula were there, but they had to be. Ty Lee wouldn’t be on that drill for anyone other than Azula, and if she had been recruited into the mission then Mai would have joined them.\n“Before you left the Fire Nation,” Sokka says.\nKatara looks like she wants to shuffle closer but is worried about crowding him. “They didn’t hurt you, did they?”\nZuko laughs, an unkind sound. How does he answer that? “No. Not really. We were ...” Not friends. Not properly, the way they might have been without Azula’s influence. “Azula is–she’s–she’s–”\n“It’s okay, Zuko,” Katara says gently. “Take your time.”\nAzula has been tasked with taking Aang down, since the Avatar has proven to be more than a spirit tale, and Zuko has shown he is not up to the task. She’s fourteen and that feels impossibly young, but then again, she’s older than Zuko was.\nAzula isn’t going away. And if he doesn’t tell his friends who he is, then she will.\nHe inhales and says in a rush, before he can lose his nerve, “Azula is my sister.”\nAang blinks. Katara’s face tightens with something like confusion, something like disgust. Sokka’s mouth falls open.\n“Okay,” Toph says, “I didn’t see that one coming.” There’s a pause. “Get it? Because I’m blind?”\nZuko laughs and covers his face with both hands.\n“Hang on, when you say sister–” Sokka waves his hands at Katara. “--you mean sister -sister?”\n“Yes,” Zuko says.\n“As in you’re related? Biologically. To her.”\n“That’s how that works, yeah.”\n“The evil psychopathic princess is your sister?”\n“As we’ve established. Yes.”\n“So, then...” Katar presses her fingers to her mouth, as though she’s scared of her own words. “Fire Lord Ozai is...”\n“Your father,” Aang finishes.\nZuko blows out a breath. There it is. “Yes.”\n“And you didn’t think to mention that before?” Sokka demands.\n“I don’t like thinking about it.” Zuko stands. He suddenly has too much energy. He paces in a loose circle around the room. “And what would I have even said, anyway? ‘Hi, I’m Zuko. I’ll be your tea server this evening, and oh, also I’m the Fire Lord’s firstborn son. Would you like Ginseng or Jasmine tea?’”\n“Well,” Sokka splutters, “that would have made us leave you alone, at least.”\n“Would it have?” Zuko asks, glancing at Aang.\nAang shrugs. “Probably not. I wouldn’t have cared that much.”\n“I would have cared,” Sokka says, pushing to his feet. He wavers in the middle of the room, vibrating with tension, setting off all of Zuko’s worn instincts. Sokka scrubs a hand through his hair. “Spirits. The Northern Water Tribe would have drowned you if they had found out.”\n“If you’re a prince, then that explains all the fancy-pants dishes you can make,” Toph says. “Good work getting out, by the way. Nobility sucks.”\n“Not nobility,” Sokka says, “Royalty! What the fuck, Zuko?”\n“Sokka,” Katara says, “calm down.”\n“Me? Why are the rest of you so calm!?”\n“I’m not.” Katara’s face is placid, but her eyes--her eyes are burning. Zuko shivers and takes a few steps back. “But I realise that freaking out about this isn’t going to actually help. Zuko is our friend, even if he lied to us–”\n“It wasn’t lying,” Zuko interrupts. “I just–I–I’ve been trying for three years to escape my father. I’ve been trying to forget the fact that I was once a prince. I didn’t tell you, because that’s not who I want to be anymore.”\n“He’s telling the truth,” Toph says.\n“Of course I’m telling the truth! I never lied to you about who I am, just who I was. I don’t like thinking about my past.” He swallows, keeping his eyes on the ground. “If you guys decide that you don’t want me around anymore, then fine. You can drop me back at the Jasmine Dragon when we find Appa and leave Ba Sing Se.”\nAll the energy leaves Sokka at once. “Of course I don’t want that. None of us do. Right, guys?”\n“You’re one of us,” Aang says firmly.\n“It doesn’t change who you are,” Toph agrees. “I don’t even know what the big deal is. People are just people, regardless of who their parents are. And sometimes we’re born to the wrong people, and we have to leave to become who we’re supposed to be.”\nThey all look at her. Zuko feels warm deep inside his chest, his fire-core has been stoked by her words. Toph flushes pink. “I can feel you all staring! Stop it. This is supposed to be about Zuko.”\n“That was really lovely, Toph,” Aang says.\n“Fuck off, twinkle-toes.”\n \n \n \n \nSokka finds him outside, sitting at the edge of their courtyard and staring up at the sky. Nights like these remind him of calm nights on the ocean with the moon glaring down at them, illuminating the miles of nothingness on either side of the Jasmine Dragon. It reminds him of Yue. It reminds him of late-night summer festivals with Lu Ten and Azula when they were small.\n“I don’t want to talk,” Zuko says, not looking away from the half-moon .\nSokka drops down next to him. “I didn’t come to talk.”\n“Right,” Zuko says doubtfully.\n“What you said today–it’s a lot. I get it.”\n“No, you don’t.”\n“Okay, no, I don’t,” Sokka allows. “I have no idea what it’d be like to have the Fire Lord as a father, but I get that I won’t get it. And I get that you probably need space right now.”\nZuko squints at him. “You’re really bad at this.”\nSokka ignores that. “I’ve been thinking,” he goes on. Zuko braces himself. Here it comes, he thinks. The realisation that Zuko isn’t worth the risk. “What if we delayed the invasion?”\nIt takes Zuko a moment to process that. “Are you still going on about the eclipse? Sokka, I told you that it won’t work–”\n“I know,” Sokka interrupts, “but what if we waited? They’re expecting an invasion during the eclipse, so their defenses will be up. And then once their powers come back, they’ll let their guard down again. That’s when we strike.”\n“You want,” Zuko says slowly, trying to understand the full scope of Sokka’s studidly, “to attack the Fire Nation capital when they’re at their full power?”\n“Yes,” Sokka says.\n“Do you realise how dumb you sound?”\n“Exactly! It’s so dumb they’ll never see it coming.”\n \n \n \n \nAfter talking with Sokka, Zuko manages to fall asleep for about an hour. He’s woken at dawn, sweaty and disoriented in a way he never is at daybreak. Years-old memories are burnt into his eyelids. Every time he blinks, he sees his mother turning away from him, his father looming over him, his sister laughing at his warped face\nHe washes and throws his hair up into a ponytail, too tired to even bother braiding it. He shuffles into the kitchen and begins brewing tea. For once, the rest of the friends are awake before him. Even Sokka. Zuko wonders if they even slept.\n“Wait.” Sokka is squinting at the map of the Fire Palace Zuko drew for him. He’s still not sure how accurate it is. Memories become distorted with time, after all. “If Zuko is a prince, why am I trying to work out how to sneak inside the palace? Can’t you just stroll up to the front door? You lived there. It’s your house.”\nZuko hands Toph a mug of tea. “They’d arrest me if I tried.”\nAang accepts his own tea with a sunny smile. “It’s not because you’re associated with us, is it? I know it probably doesn’t look great that you’re friends with the Avatar…”\n“No, it’s because I’m not legally allowed in the Fire Nation. I was banished.”\n\n“Banished?” \n\n“Cool,” Toph says.\n“Toph.” Katara scowls at her, even as she accepts her own mug of tea from Zuko. “It’s not cool, it’s awful. Zuko, what happened?”\n“If you go to the Fire Palace, I’m not coming with you,” Zuko tells Sokka, ignoring Katara’s question.\nSokka purses his lips. “You’re the only person that knows their way around. The Fire Nation has the home-advantage and we need you there to level the playing field as much as possible.”\n“We’ll be with you the entire time,” Aang reassures him.\nZuko shakes his head. “I was foolish enough to think I was safe in the Fire Palace before. Even after my father burned me, I still thought everything would be okay if I just worked harder and tried to prove to my father that I was a dutiful son. But Uncle taught me better. I’m free and I’m never going back.”\nThe room is quiet. Toph has stopped smiling, and Sokka is frozen, tea halfway to his lips.\n“What?” Zuko says.\n“Burned you,” Aang says, something almost fearful in his voice. “You said your father burned you.”\nKatara puts her tea down. Her eyes are wide. “Zuko, where did you get your scar?”\nZuko’s first instinct is to lie or deflect. But he’s told them this much already. Is there any point to trying to avoid things now? It’s almost freeing, he supposes, to get everything out into the open.\n“It’s not your fault,” Iroh has told him, over and over again, enough times that Zuko finally started to believe him. “You have no reason to be ashamed.”\nZuko cups his tea between his palms, letting the warmth ground him. He’s never had to say this out loud before, and finds the story coming to him in fits and starts. “I fought in an Agni Kai. I–there was this general. I had convinced Uncle to let me sit in on a War Council meeting, and he was talking about sacrificing a battalion of young recruits. I was just a kid and didn’t know about how terrible war can really be. I could barely understand what I was hearing. I spoke up against him.\n“That was seen as an act of disrespect, so. Agni Kai.”\n“Fire duel,” Aang translates for the rest of them.\nZuko nods jerkily. “Right. I assumed it would be against the General. He was the one I had spoken out against. But it had been in the Fire Lord’s council room.”\n“Oh no,” Katara murmurs.\n“When the time came, and I turned around and saw my father standing opposite me, I did what any loyal son would do: I got on my knees and begged for his forgiveness. I loved him. I couldn’t fight him. And in his eyes, that made me a coward. So he ...” Zuko gestures to his face. To the grotesque scar.\nSokka swears, jerking back and accidentally knocking his cup. Tea spills down his front and across the table. Sokka dives for the map of the palace and there’s a mad scramble as they all try to rescue the parchment before it can be too heavily stained by tea.\nWhen the table is cleared and the tea mopped up, they return to the table in muted silence.\n“I’m sorry that happened to you,” Katara begins, “And I’m sorry for pushing you as hard as we did when we first met. You had a good reason for never wanting to get involved with the Fire Nation again.”\nZuko shakes his head, no. “You were right. I couldn’t have kept pretending that the war didn’t exist. I live in this world. I have to face it.”\n \n \n \nZuko pulls himself out of bed well before dawn. He only managed an hour or two of sleep before he was woken by nightmares, and he can’t take it anymore. The unfamiliar bed. The strange room. He’s used to sleeping on a ship or on the ground or on Appa. He was a prince once, but sleeping in a house unnerves him.\nOr maybe it’s the knowledge that he was so close to Azula just a few days ago, or that his friends now know who he is. They took the news better than he had expected, but just the act of telling them, of saying it all loud, had ripped open an old wound he hadn’t realised could still bleed.\nZuko puts on a brown tunic and plaits his hair in an Earth Kingdom style, then he slips out the window.\nThe wealth in the upper ring sets him on edge, so he heads down to the middle ring and then keeps going down to the lower tings.\nHe’s surprised by the lower ring, then surprised by his own surprise. Maybe he’d tricked himself into thinking that the Fire Nation were the only source of evil in the world.\nHe ducks into a tea house mid-morning. The empty store is dim and smells of mildew, nothing like the Jasmine Dragon, but it’s quiet and out of the way.\n“I haven’t seen you around here before,” says the merchant, Pao. He pours Zuko a fresh cup of tea.\n“My friends and I arrived yesterday,” Zuko says awkwardly. He’s used to being on the other side of this interaction, a reverse kind of cultural shock he hadn’t expected. After his banishment, he was a former prince unaccustomed to serving others. And now, he’s a tea server who’s forgotten what it’s like to be served.\nHe takes a sip of his tea and then spits it out.\nPao jumps back. “What’s wrong?”\n“This tea is nothing but hot leaf juice!”\nPao blinks at him. “Well, yes. That’s what all tea is.”\nZuko gapes at him. “How could you say that?”\nPao looks like he’s going to throw Zuko out even though he’s the only paying customer in the store, until Zuko starts talking about how tea is supposed to be brewed.\n“You were a tea server?” Pao asks, a keen look in his eye. “Where?”\n“All over,” Zuko says, glaring down at the cooling cup of leaf water. “The Jasmine Dragon never stopped traveling, I guess.”\n“The Jasmine Dragon?”\nZuko blinks. “You’ve heard of it?”\nPao looks like he’s about to faint. “One of my customers mentions the Jasmine Dragon at least once a week. I always wanted to give the owner a talking to, considering how much of my business he’s driven away, just because my tea isn’t like the tea they serve on the Jasmine Dragon. Although...”\nPao studies him. Zuko feels like he’s being sized up for a meal.\n“You’re new to the city, yes?” Pao says. “How about we help each other out?”\n \n \n \n“What do you mean you got a job?”\n“Now, Katara,” Sokka says calmly. “A man needs his independence. Zuko should be free to fill his days however he likes.” Sokka pauses. “How much does this job pay, anyway?”\n“Not much,” Zuko says, shrugging. “Less than I got on the Jasmine Dragon. It’s in the lower ring, so I’m not expecting much.”\n“Why the lower ring?” Aang asks. “We’ve all had your tea. And your cooking. You could open up your own place in the upper ring and be a hit.”\n“And we’d be rich!” Sokka says.\nZuko looks down at his hands, fiddling with the apron in his lap. It’s not the same kind as the ones they wore on the Jasmine Dragon, but it feels familiar nonetheless.\n“I don’t want to stand out,” Zuko says in a soft voice. “I don’t want the attention. Ba Sing Se is … it’s ...”\nWhen Zuko looks up, his friends are looking at him with gentle expressions and it just reminds him they all witnessed his breakdown the day before. It makes him feel strange. Both relieved and twisted-up all at once. Because they know the truth now and don’t care, but--they still know and that’s more than he knows how to deal with.\n“Any money is going to be helpful when we get moving again,” Sokka says, purposely casual. “It’s not like you’d be much help here anyway. We only need so many hands to put up posters and the Earth King still hasn’t gotten back to us.”\n“Maybe you can ask around about Appa,” Aang says.\nZuko rests a hand on Aang’s shoulder. “I’ll do my best,” he promises.\n \n \n \n \n((The gaang have enough of waiting and decide to infiltrate the Earth Palace))\n \n \n“The palace will be packed,” Katara says. “We can sneak in with the crowd.”\n“Won’t work,” Toph says, throwing herself on the mound of pillows.\n“Why not?”\n“Well, no offense to you simple country folk, but a real society crowd would spot you a mile away. You’ve got no manners.”\nKatara puts her hands on her hips. “Excuse me? I’ve got no manners? You’re not exactly Lady Fancy-Fingers.”\n“I learned proper society behaviour and I chose to leave it. You never learned anything. And frankly, it’s a little too late.”\nSokka sits up. “But you learned it! You could teach us.”\nSokka and Aang wrap themselves in blankets, and put on their snobbiest expressions. It doesn’t fool Toph for a moment, even before they bow at the same time, smash their heads together, and almost knock each other out.\nZuko chooses that moment to return from the kitchen with a tray full of tea and biscuits. He ignores Sokka and Aang’s groaning, and kneels down beside the expanse of pillows.\nHis posture is prim and straight-backed, his movements graceful without being too slow. There’s an effortless air to his movements, Toph realises. It’s always been there. It’s in his bending, in his tea brewing, in the way he moves about the world. She’s always felt it, but she’s never been as aware of it as she is now.\n“Now, there’s the man we need,” Toph says, sitting up. “You commoners couldn’t even pass as bus-boys–and okay, maybe Katara could get in if she was wearing fancy clothes and didn’t speak too much–but Zuko, on the other hand…”\nZuko squirms under everyone’s sudden attention. “What did I miss?”\nKatara gasps. “Of course! You’re royalty. You would know how to talk to nobles, especially the Earth King.”\n“I don’t like the sound of that,” Zuko says. “What are you plotting?”\nToph slaps him on the back. “Buck up, Sir Prissy Pants. We have a party to infiltrate.”\n \n \n \n \n \nKatara does Toph’s make-up and helps twist her hair into an elaborate up-do. Katara must be more observant than Toph thought, as it only takes her a few tries to apply the make-up (correctly, if Zuko’s comments are anything to go by). Zuko helps Katara pin her hair in place and fix the hair piece. They all have different hair textures, different cultural upbringings, but Katara has known how to braid since she was a little girl, and Zuko has been living nomadically around the Earth Kingdom for years and has picked up a few styles himself.\nEven with two larger bodies bent over her, fussing with her face and hair, it doesn’t remind her of the servants at the Bei Fong household, the ones who helped her dress every morning and evening, because her parents didn’t believe a blind girl was competent enough to do anything for herself. Katara and Zuko bicker as they work, and they never once ignore her or treat her like a doll to be moved and adjusted. They ask how everything feels. They are careful, but not especially gentle or practiced.\nWhen they’re done, Zuko ducks out so Toph can get changed. Into a dress. The Earth King had better be worth this.\nWhen she’s done, Zuko comes back, and he and Katara stand back, looking at her. The hair, the make-up, the dress–it all feels like a mask, as it always has. But not one she wears to satisfy her parents. This time, it’s a disguise. A weapon. It almost makes the feel of silk and pinchy-hair pieces worth it.\n“You look beautiful, Toph,” Katara says.\n“You look like a very pretty, very normal noble,” Zuko says. “It’s weird. I mean, you’re always pretty, but you always look like Toph. Now you look like someone else.”\n“Zuko,” Katara scolds.\n“What? She doesn’t look like herself. Isn’t that the whole point of this?”\nKatara whacks him on the arm. Toph ducks behind her fan, feeling warm and seen and validated all at once. It’s a strange, squirmy feeling. Like eating a big meal after being hungry all day. Like being able to lay out in the morning sun after a very cold night.\n“Okay,” Toph says, when she feels less like the demure child she’s pretending to be. “Zuko’s turn.”\n \n \n \n \nKatara slips into the living room. Sokka and Aang are sitting by the pillows playing a game, but they look up when she clears her throat.\n“May I introduce the young Lord and Lady Bei Fong,” Katara announces.\n“Don’t make us sound married!” Toph shouts from the other room.\n“I meant like siblings!”\n“Oh, carry on then.”\n“May I introduce,” Katara tries again, “the young Lord and Lady Bei Fong, the respected and annoying siblings.”\nShe pulls the door open. Toph and Zuko are poised in the doorway, dressed in matching robes of sage green and white. Toph is half-hidden behind her fan, curled demurely around Zuko’s supporting arm. Zuko stands tall and graceful as a young sapling, an arm behind his back, his chin held high. Half of his hair is piled atop of his head, held in place with a jade hair pin, while the rest flows loosely down his back.\nThey really do look like siblings, Katara thinks. Toph doesn’t act like a noblewoman normally. She slouches, and burps, and cackles whenever Aang faceplants after a hard day of bending.\nZuko doesn't act like a prince, either. He attends to their meals and drinks, and completes chores with the casual diligence of a server. He ducks his head and shrinks into himself, avoiding attention wherever he can.\nThey were both born and escaped high-society and still hold scars–physically or emotionally–from their childhood.\nZuko looks from Katara to the shocked faces of Sokka and Aang, that worried look back on his face. “Do you think this will work?”\n“Oh, yeah,” Katara says. “It’ll work.”\n \n \n \n((They arrive at the ball only to realise they need an invitation.))\n \n“What now?” Zuko hisses.\n“Calm down, firefly,” Toph whispers back. “I can feel how hard your heart is beating. It’s going to be okay. Just think: what would you do if you were at home?”\n“The Jasmine Dragon is my home.”\n“You know what I mean.”\n“I don’t know,” Zuko says, resisting the urge to run through his hair and ruin Katara’s hard work. “Wait until someone realised I was missing and hope my dad didn’t hit me too hard when he found out?”\nToph pauses for a moment. “I can’t wait until twinkle-toes Avatar States your dad into the sun.” Zuko laughs breathlessly at her side. “Well, you know what I’d do? This.”\nToph breaks away from the crowd, wandering almost aimlessly until she bumps into a nobleman. She stumbles back, eyes wide. “Oh! I’m sorry.”\nThe nobleman blinks down at Toph, registering her milky eyes, staring at a point over his shoulder. “That’s quite alright. What are you doing here all by yourself?”\nZuko takes that as his queue to rush over. “Toph! Don’t wander off like that.”\nToph latches onto his sleeve and actually sniffles like she’s going to cry. “I’m sorry. I just thought you were mad at me for losing our invitations… Now we won’t be able to find mother and father.”\nZuko grew up with a manipulative little sister. It’s been a long time since he was on this side of it, but he still remembers how to play his part.\n“It’s okay,” Zuko says, trying to sound soothing. “Mother and father will notice we’re not at the party… eventually ...”\nTears well in Toph’s eyes. “You’ll get in trouble. You always get in trouble! It’s my fault—”\n“Toph, it’s okay.”\n“No, it’s not.”\nZuko turns to the stunned nobleman. He gathers Toph to his chest, trying to look as young and bewildered as he can. “Please, sir. Can you help us get into the party? My sister lost our invitations.”\n“I’m sorry,” Toph cries into his chest, muffled. Zuko shushes her, rubbing circles into her back.\nThe nobleman offers Zuko a handkerchief, which he takes and uses to fuss over Toph, making sure not to smudge her makeup.\n“I’d be honoured. You don’t see such devoted big brothers these days.”\nZuko pauses. He thinks about Azula at the walls of Ba Sing Se, closer than she’s been in years. He stopped writing to her after his first year of banishment. He told himself he didn’t regret it.\nHe’d told himself a lot of things.\nToph makes up for his sudden silence. “Thank you, sir. I’m lucky to have Lee to look after me.”\nThe nobleman, Long Feng, turns out to be the Cultural Minister to the king. He also isn’t content to let them go when they enter the party.\nWhile Zuko pretends to scan the crowd for their parents, Toph manages to buy them time. Long Feng asks about Zuko’s scar, and Toph barely misses a beat before launching into a story about how their carriage was attacked one day when they were outside of Ba Sing Se, and Zuko leapt in front of a bandit to defend her. It makes his ears burn.\nHer fake saccharine voice and the shit-eating grin she flashes him whenever Long Feng turns away makes him homesick for someone he hadn’t thought he’d miss.\nWhen Long Feng is pulled into a conversation with another noble, they take the opportunity to sneak away. They find Aang, Sokka and Katara posing as waitstaff.\nKatara glares sharply at them before she realises who they are.\n“That bad, huh?” Zuko asks.\n“If another person calls me sweetheart,” Katara hisses back, “I’m going to bend this champagne down their throats.”\nSokka pretends to offer Zuko a crab puff. “How’s it going?”\n“The guy who escorted us in won’t let us out of his sight.”\nThey scan the crowd, but suddenly there’s no sight of Long Feng. There is, however, Joo Dee, who looks panicked beneath her plastic smile.\nAang reveals himself to be the Avatar. He comes so close to talking to the Earth King—until the Dai Lee escort them out of the party. Long Feng, the man that escorted them into the party, turns out to be more than just a Cultural Minister.\nMaybe he didn’t buy Toph’s story after all.\nTonight wasn’t a complete waste, however. They find out that the king is a figurehead for the Dai Li and they might never be allowed to talk to him.\nBut they can’t do anything with this information or else they risk getting thrown out of Ba Sing Se and losing their only head in tracking down Appa.\n \n \n \nThey double-down on trying to find Appa. Or, at least, Aang does. It’s easy to get distracted in this big city with so many winding streets. There are so many things to do and see. So many side-adventures to get caught up in.\nZuko, for his part, enjoys the city during the day. He tells Aang he’s keeping an ear to the ground for information, but he loses himself in the sweet monotony of tea serving. He’s offered a position in the Upper Ring, but he turns it down. The last thing he wants to do is mingle with nobility again, even as a tea server.\nSometimes, when there is a steady stream of customers and his mind is calm, the way it always is when his hands are busy brewing tea, he thinks he could have been happy here. If he was born a tea server instead of a prince, he could have built a life for himself and been content.\nHe tries to shove that thought deep down when he’s around his friends. If he had been born a tea server, just another anonymous face in Ba Sing Se, then his friends would be by themselves, and the thought of anything happening to them scares him almost as much as the thought of never getting to see the Jasmine Dragon again.\nBut at night when the nightmares are close, he unearths that thought and holds it close. He imagines Uncle getting to run a real tea shop in Ba Sing Se. He deserves something big and beautiful, more than just a converted warship.\nDespite his dreaming, this city is not perfect. They’re no closer to finding Appa, and Zuko can’t forget the things he sees in the Lower Ring, on his way to and from Pao’s Tea House. The poverty. The displaced victims of war. The crime. The people who have no way of fighting back.\nEver since meeting Aang, Zuko has lost his ability to ignore the world around him. He has to do something.\n \n \n \n \n((Enter Blue Spirit stage left))\n \n \n“You’re a good fighter. Weird mask, though.”\nZuko sheathes his dao blades and bends down to check the prone figures. They’re just unconscious. No serious wounds.\nJet scoffs when Zuko checks the men’s pulses. “Bleeding-heart vigilante, huh? Don’t bother with them. They got what they deserve.”\n“How old are you?” Zuko tries not to talk when he’s the Blue Spirit, but he’ll be fine. This city is so vast. He doubts he will run into the other boy again.\n“Almost seventeen.”\nHis age, then. He thought so. “You’re too old to believe that the world is made up of black and white.”\nJet bristles. “I’m not a child. I’ve been through more than you can imagine.”\n“Are you sure? You don’t know who I am.” Zuko takes a step back, just in case Jet gives in to his reckless anger and attacks him. Just because he snuck out tonight, itching to do something, doesn’t mean he enjoys violence. “The world isn’t made up of monsters and their victims. Most people aren’t entirely good or evil. It’s all about choices, the kind you make every day. Sure, lots of people don’t choose to change, but if you kill them, you’re robbing them of their chance to grow and become something else.”\nJet’s face is twisted up in a scowl. “Some people don’t deserve the chance to try again. You can’t forget the things some people have done.”\n“Sure,” Zuko says. “The Fire Lord doesn’t deserve a second chance. But how do you know that these people are beyond redemption? You couldn’t.”\nZuko leaves quickly after that.\nHe slips into his bedroom soundlessly. He tucks his mask and black clothes out of sight, and collapses onto his futon, groaning. Why had he said all of that? To a stranger? He’s turning into Uncle.\n \n \n \n \n“Why do you do this?” Jet asks one night.\nZuko wets his lips. “Because no one else will. Because these people deserve it, and I feel like I can’t help in any other way. Because it’s the right thing to do.”\n“You know,” Jet says, “if we teamed up, we could get a lot more stuff done. Start making a difference around here. I’m a Freedom Fighter. My friends are too, but they don’t want to do anything.”\n“I’m not any kind of Freedom Fighter,” Zuko says. “I just help people when they need it.”\nJet turns away. “How very righteous of you.”\n \n \n \n \n“We’re not going to find him,” Aang says in a voice so quiet and dead that Zuko almost doesn’t realise it’s coming from him.\n“Of course we’re going to find him,” Katara soothes.\nToph thumps Aang on the shoulder. He sways with the impact, but otherwise doesn’t react. “We’re not going to let them run us out of the city. We’ll find him.”\nZuko knows how a realisation can crack the soul in two. When he finally recognised his father’s abuse for what it was, only the desperate efforts of Uncle and the crew had saved him from sinking into despair.\n“Aang,” Zuko cuts in, firm. “We’re going to find him.”\nAang nods, too tired to argue.\nThey inch closer to Aang, huddling around him in solidarity. Between refills of tea, Zuko disappears into the kitchen. He casts one last look at his friends, heart aching, and quietly slips out the window with his mask tucked under one arm.\n \n \n \n \nIt’s not hard to find and corner a Dai Lee agent. Zuko has been peripherally aware of them for some time, but he’d always tried to stay away.\nHe’s done playing it safe.\nHe’d thought the Dai Lee agent wouldn’t crack as easily as this one had. Maybe the mask unnerved him. Maybe it’s the dual blades. Maybe it’s the thin layer of rainbow fire flickering on the blades like a mirage, pressed close to the agent’s neck. Whatever it is, it gives him the first proper lead they’ve had since Appa went missing.\nThe maze-like tunnels are dimly lit and smell damp. Lake water and rot and, he realised as he moves deeper underground, the distinct smell of animal fur.\nZuko hears chanting behind closed doors but pushes on. His mission tonight is rescuing the final member of their group.\nThe sight of Appa in chains hurts more than he was expecting it to. Zuko has never been imprisoned and the thought of being cut off from Agni’s light horrifies him. It must be just as bad for Appa, a sky bison, chained deep beneath the earth.\nWhen he closes the door behind him, Appa keens loudly and bucks in the chains, straining to reach him.\nZuko hushes him, slipping off his mask. “You have to be quiet. It’s okay, I’ll get you out of here.”\nAs soon as Zuko is close enough, Appa licks him with enough force to lift him off his feet. Zuko can’t help but laugh. He’s drenched in slobber and there’s a deranged cult of earthbenders behind him, but he missed Appa. Missed those rumbling noises he makes, the feel of his fur under his palms, the way he pushed into Zuko’s hands when he pet him. Zuko leans in and presses their foreheads together and fights back the hot, tight feeling in his throat.\nWhen he’s sure he’s not going to start trying, he steps back and clears his throat. “Let’s get those chains off you and then we can go home.”\n \n \n \nThe Dai Lee try to stop them, but Appa is like a bulldozer, flying up and over–or just through–any attacks. And then they’re soaring up into the air, passing over weathered roofs and sloping buildings. Ba Sing Se is spread out in all directions beneath them, bathed in the soft light of dawn.\nZuko reached Lake Lagai by scaling rooftops, so he’s not too certain how to reach from the air. But Appa barely seems to need any guidance. He beelines for the Upper Ring, flying straight home to Aang.\nThey land in the street in front of their house. Dust billows up around Appa. There’s a sudden shriek from inside the house, following by the stampede of feet.\nThe front door is thrown open. Toph and Katara are open-mouthed in the doorway, Aang standing white-faced behind them.\nZuko raises a hand. “Hey, guys. I found Appa.”\nAang barrels down the stairs and launches himself at Appa. He’s crying freely, taking great big gulps between sobs. Appa groans loudly, almost a wail, and shoves into Aang, nosing against every inch of him as if inspecting him for injuries.\nKatara and Toph tumble down the steps. A sleep-rumpled Sokka follows shortly after, rubbing at his eyes blearily.\n“Zuko,” Sokka says, awed. “What the fuck?”\n“What?” Zuko says. “Isn’t the whole point of coming to Ba Sing Se to find Appa?”\nZuko jumps off Appa. Katara immediately swoops him into a hug. Toph thumps him on the shoulder, beaming. “You’re unbelievable, Sparky.”\nWhen Aang has composed himself, he throws himself at Zuko. He stands rigidly, unsure what to do with an armful of sobbing Avatar.\n“Now that we have Appa,” Toph says some time later, “the Earth Kingdom can’t hold him over us.” She cracks her knuckles, grinning. “Let’s go bag ourselves an Earth King.”\n“How?” Katara says. “We didn’t even manage to talk to him when we were inside the palace.”\nSokka’s grin sends shivers down Zuko’s back. “We do what we did with Zuko.”\n“Kidnap him over and over again until he gives up and stops fighting it?”\nAang peaks out from Appa’s fur. His blotchy face is drenched with tears. “Kidnapping you was the best thing we ever did.”\nAt the sight of Aang’s puffy face, all Zuko’s bravado drains out of him. He thinks he was ruined the first time he saw that brightly-coloured boy in the moonlit alleyway all those months ago. “Okay.”\n \n \n \nZuko steals into Kuei’s room a few hours before dawn. The Earth King is in bed, cocooned in silk sheets and snoring like an earthquake. Bosco is awake. He blinks lazily as Zuko tiptoes towards the bed.\nWhen Zuko shakes Kuei awake, he squints muzzily at Zuko and then screams. Zuko clamps a hand over his mouth.\n“Quiet,” Zuko whispers. “I’m not here to hurt you.”\nKuei eyes him up and down with obvious doubt. Zuko broke into the king’s chambers in the middle of the night, dressed in dark colours, dao swords strapped to his back, and now he’s smothering Kuei with his palm.\nAang was a much friendlier kidnapper than Zuko.\nZuko slowly pulls his hand back. “I’m sorry for scaring you. I want to show you something.” Kuei’s gaze flicks to his blades. “It’s not a weapon.”\n“Can’t this wait until morning?” Kuei asks. “People are not allowed in the king’s chambers aside from servants and...”\nZuko would bet Kuei was about to say Long Feng. He knows what it’s like to realise that the people close to you can’t be trusted. Kuei is a grown man, but he wonders if he felt anything like Zuko did, thirteen years old and freshly scarred and fumbling through every interaction, trying to reorientate after his life had been turned upside down.\n“Long Feng has been keeping a lot from you,” Zuko says. “And not just about the war. You’re the Earth King, but you’ve never even stepped out of your palace. You’ve never seen your people or walked amongst them.”\nKuei settles himself against the headboard, nose turned up. “And I should believe what you tell me instead?”\n“No. You should believe what your eyes tell you.”\nZuko steps away from Kuei. He opens up the balcony doors. The cool morning breeze blows through his hair and catches on his ribbon.\n“Your Majesty,” Zuko says, holding out his hand, “how about we take a little field trip?”\n \n \n \n \nIn the end, it’s Bosco that helps convince Kuei to go with him. The bear likes him. Zuko doesn’t know why or how this happened and would honestly rather the just-a-bear stay far away from him. But when the bear nuzzles into Zuko’s palm, his fur is warm and soft like Appa, and it makes Kuei think he’s trustworthy. So maybe cuddling the cute abomination is worth it.\nZuko half-carries Kuei as they scale down the palace. It’s clumsy work. Kuei is much heavier and taller than Zuko and he shrieks at every leap.\nIt takes over an hour for them to get to the lower ring. As soon as they move into the city proper, Kuei–dressed in drab brown robes Zuko had borrowed from his manager at the tea shop–looks at everything and everyone with wonder. In the upper ring, he’d seemed so pleased by the empty streets and beautiful buildings. He’d been full of wonder at the sight of the filling streets in the middle ring.\nHis expression sours the closer they get to the wall.\nHe takes in the thin alleyways, shapeless bodies moving in the dim light. The stench of sweat. The thin, patchy roofs and cramped houses. The children, crouched in the dirt, watching Kuei with dark, distrustful eyes. “This… this is...”\n“This is your city,” Zuko says. “These are your people.”\nKuei only recently learnt about the war. He hasn’t seen the stretches of ash and scorched earth where towns once stood. He hasn’t seen crowds of skinny war orphans beg at ports, or widowers wailing in the street, or veterans learning how to live with newfound disabilities.\nA part of him hates Kuei for that. He’s spent most of his life sheltered in his palace while his people were being ravaged by war.\nHe watches Kuei stumble around his city’s slums in helpless circles, slack-jawed with horror as he sees the truth of poverty for the very first time. Zuko stays close enough to offer protection, but otherwise lets him take it all in silence.\nWhen Kuei begins to look less overwhelmed (and after Zuko has had to steer him away from three would-be muggers), he turns to Zuko and says, “I thought it was just the war that Long Fen was lying about. How could I not know how my people were suffering?”\nZuko thinks for a moment. “When you’re being fed beautiful lies,” Zuko begins, choosing his words carefully, “you want to believe them. It’s easier that way. Denial is better than admitting that your people are in the wrong. That you’re in the wrong.”\n“I didn’t know,” Kuei says, and he sounds so young.\n“You know now.” Kuei just looks lost again. Zuko takes him by the elbow, resisting the urge to shake him, and says, “You’re their king. They need you. Are you going to stick your head back in the sand?”\nKuei looks at him with wide eyes. “Who are you?”\n“What?”\n“I’ve never met anyone like you before. The Avatar showed me the Dai Lee, but it’s his job to maintain peace. But this field trip has nothing to do with the Avatar.”\n“You should know that your people are suffering.”\n“Yes,” Kuei agrees, “but how did you know that I needed to see it? Who even are you?”\n“I was lied to for a long time too,” Zuko admits, fixing his eyes on a shuttered window further down the alleyway. Light spills out around the cracks. “Even after I started seeing the truth, I made excuses and ignored the truth of the war, because I was frightened of what might happen to me if I got involved. It took a while, but my friends helped me see the truth. While I was ignoring the war, good people were suffering, and they would continue to suffer until someone stood up and did something.”\nKuei considers him for a long moment. “You’d make a good advisor. You wouldn’t happen to be looking for a job, would you?”\nZuko grimaces. “I really don’t think you’d want to hire me.”\n“Are you sure?” Zuko stays silent, glaring stonily at the thin slat of light emerging from the window. Muffled laughter drifts through the window panel. Kuei sighs. “It’s a shame I can’t hire someone to be king for me.”\nFirst, Princess Yue. Now, King Kuei. Is this going to be an ongoing theme? Is Zuko going to be collecting repressed royalty the more he travels with Aang?\nThen again, the most repressed royal is Azula and he has no idea how to start with her.\n \n \n \n \n((Everyone wants to run off in different directions just like in canon. Zuko convinces Sokka AND Katara to go meet up with the Southern Water Tribe. Aang decides to stay in the Earth Kingdom with him rather than hunt down the Guru, as he’s not as desperate to master the Avatar State since he’s closer to mastering all 4 elements now that he has 3 bending masters.))\n((Instead of Katara spotting Zuko in the Upper Ring like in canon, it’s Jet that someone finds out the Blue Spirit’s identity and tracks him down.))\n \nWhen Zuko enters the tea shop to tell Pao he’ll be leaving Ba Sing Se in the near future, he finds Jet lounging at one of the low tables, two empty cups and a teapot in front of him. “I haven’t seen you in a while, Blue.”\n“I’ve been busy,” Zuko says, sliding into the bench opposite him.\n“Busy? With the Avatar?”\nZuko winces. “I didn’t know that you knew them. Honestly, I didn’t think it was any of your business.”\nJet turns away, examining the tea shop. He’s still angry, but his anger isn’t focused on Zuko. It’s just an ever-present thing. Directionless. An old wound that never closed, a constant irritation of the soul.\n“I would’ve thought you’d go somewhere more upscale,” Jet says. “This place is a fucking dump.”\nIt is, so Zuko doesn’t argue, though he is glad Pao is out of ear-shot. The Jasmine Dragon was run out of a small, rusted war ship, the only home a banished prince could afford, but it still hurt when people turned their nose up at it.\nZuko picks up the teapot and pours tea for both of them. “I don’t like the Upper Ring. Everything is so clean and bright, and it feels like everyone is watching you.”\n“I’d love to see it,” Jet admits, though Zuko can’t imagine him rubbing shoulders with nobles--not without throwing their own tea in their face, losing it at the clear wealth disparity. “Though I’d probably go mad up there. It’s not what either of us are used to, right?”\nJet is extending this branch, this shared experience. It’s the closest he’ll ever come to apologising.\nAnd Zuko can’t even relate. Not properly.\nZuko lowers the teapot, carefully thinking over his answer. He hasn’t ever lied to Jet, but he did withhold information. He’s still withholding information. But maybe if he let just a little bit slip through, a hint of who he was …\n“I grew up somewhere like that, actually,” Zuko says. “By the time I was--forced to leave, I hated it. It wasn’t exactly a kind environment.”\nJet draws back a little, frowning. “I wouldn’t say living in the slums, having to fight for every scrap you could get, was a ‘kind environment’ either.”\n“That’s true. I never had to live like that, but ...” Zuko shrugs, helpless. How can he describe the violence of royalty? The careful, controlled life of a prince, the knife-edge he walked, constantly in danger of falling, of failing, of catching the full attention of his father, even if that was what he had craved for so long. “That life would’ve killed me, in the end.”\nJet laughs. It’s not a kind sound, but then, his laughter never is. “It figures that you used to be some fancy noble. I should’ve realised.”\n“What?”\n“You’re so--” Jet waves a hand at him.\n“You just gestured to all of me.”\n“Exactly. Weird accent, fine features. That straight way you sit. The more-noble-than-thou air you carry around when you’re the Blue Spirit. Wouldn’t expect a dainty nobleman to have such a mean right hook, though.”\n“I’m not a nobleman. Not anymore.” Not ever. But saying he was once a prince would only make Jet hate him.\n“No,” Jet says evenly, and he almost looks thrilled. It’s the same way he used to look at Zuko before he found out he knew the Avatar. “You’re not. Hey, my friends are getting lunch just across from here. You should join us.”\n“Your freedom fighter friends?”\nJet’s scowls, just for a moment, before it’s gone. “They’ve given up the Freedom Fighter life. For a ‘fresh chance.’ Whatever that means.”\nIn that moment, shoulders hunched and glaring at nothing, Jet reminds Zuko starkly of himself a few weeks into his banishment, Iroh’s words ringing in his ears, trying to convince himself that his father wanted him to come back, that his banishment wasn’t a life sentence.\n“Starting over can be overwhelming,” Zuko says, careful to make his voice soft without sounding condescending. “But you shouldn’t pass up the chance to build a new life. You deserve to be happy. Even if you don’t feel like you can be happy here after your old life was--so much more, even if it was also so much worse--you should still try. You deserve that chance.”\nJet stares at him for a long minute, scowling, looking like he so desperately wants to shake off Zuko’s words, but then he blows out a rough breath. “Fuck, you sound just like Smellerbee.”\nI sound like my uncle, Zuko thinks, feeling strangely warm at the thought.\n“Maybe if everyone is telling you the same advice, you should listen.”\nJet rolls his eyes and stands up. “Yeah, maybe. Are you coming to lunch, or not?”\n“Let me just tell Pao.”\nHe tells the tea merchant he’s heading off with friends now. He’s disappointed to see his best tea server leave for the day, but waves him off without a fight.\nZuko picks up his abandoned tea as he goes and follows Jet out of the door and into the street. Jet is waiting for him. He can see a pair of teenagers dressed strangely, like echoes of Jet, loitering outside the cheap noodle shop down the street. They must be Jet’s friends.\nZuko takes a sip of his tea. Almost spits it out again. It’s so cold.\nWithout thinking about it, Zuko heats the cup between his palms, the way he has warmed a hundred drinks and pots and meals, because his friends have a tendency to get distracted and forget to finish their food and drinks before they cool. Sometimes, Zuko thinks they’ve become too spoilt with a firebender around. After all, Aang can bend fire now, too, but everyone insists that Zuko does it better. Even Aang.\nHe takes another sip. The tea is hot, almost boiling, steam curling into his face like a caress.\nThe tea is knocked out of his hand, and a hook is held at his throat.\nJet’s face is very close, eyes burning. “You’re a firebender.”\n“Wait. I can explain.” Zuko reaches out instinctively, but Jet bats his hands away roughly with the flat side of his hooks.\n“Explain about how you’ve been lying to me? Tricking me? What are you doing here?”\nHe’s gotten too comfortable. He’s always known that Ba Sing Se is dangerous, but after the adrenaline-rush of finding and saving Appa and digging the King Earth out of a well of lies, he’d started slipping.\n“No trick,” Zuko says slowly. “I’m in the city with my friends. We’re trying to stop the war.”\nJet scoffs. “Yeah. Like I’m going to believe that.”\n“I’m with the Avatar. I’m teaching him firebending. Really, Jet--”\nJet steps back. “You know Aang? And Katara and Sokka? They’re here?”\n“You know them?” Zuko echoes.\n \n((They’re attacked by the Dai Lee))\n \nJet tries to twist out of the hold, but the Dai Lee wrenches his arm back. He chokes, goes down hard.\n“King Kuei knows the truth about the Dai Lee,” Zuko says, thrashing against the iron fingers digging into his wrists. “I’m friends with the Avatar. They’ll get us out of here--”\nA new voice answers. “The Avatar?”\nZuko stops. Forgets how to breeze.\n“Let go of me,” Jet shouts, looking past Zuko’s captors. “He’s the firebender. I haven’t done anything wrong!”\nThis is what it had felt like when Aang had found him in that dark alleyway all those months ago. It’s the sharp tug of an arm around his stomach as he’s hoisted into the air, the weightlessness of being snatched up. It’s looking down at the sinking Jasmine Dragon and knowing the fall would kill him if he struggled.\nAzula looks down her nose at Jet. Her hair is longer than he remembers and she’s lost some of her baby fat, though not all of it, and she looks strange in Earth Kingdom colours but–it’s her.\n“Azula,” he rasps, throat tight, “what are you doing here?”\nHe should have known that she wouldn’t give up after his friends stopped the drill outside Ba Sing Se. If Azula wants something, she doesn’t stop until she gets it, no matter the price.\nAzula’s voice is low and smooth and hits him right between the ribs. “I’m here to fix all of your mistakes, Zuzu. Do you think I don’t know what you’ve been up to? Turning on the Fire Nation, helping the Avatar… I always knew you were a coward, but I hadn’t realised you were a traitor too.”\nZuko swallows hard. “I’m doing this for the good of Fire Nation.”\nAzula laughs. “You’ve spent too long with Uncle if you’ve actually started believing his lies.”\n“His lies?” Zuko pushes back against the Dai Lee and tries to stand as tall as he can under Azula’s heavy gaze. “Azula, we grew up with nothing but lies. Have you seen what the Fire Nation has really been doing? There’s no honour in this war. We’re not spreading our culture. We’re destroying the rest of the world and ourselves in the process.”\nAzula almost looks disappointed in him. She brushes hair out of her face, and tells the Dai Lee, “I’ll deal with them later. Put them somewhere they won’t be a bother.”\nThe ground opens up. Zuko is shoved down into the hole and tumbles down a long tunnel, feeling like the earth is swallowing him whole. He’s vaguely aware of Jet shrieking as he’s thrown in after him.\n \n \n \n \nIn the glowing catacombs, Zuko huddles against one wall, legs drawn close to his chest. He focuses on keeping his breathing even and tries to stop shaking.\nHe should have convinced his friends to abandon Ba Sing Se the moment he realised Azula was behind the drill. And now Aang and Toph are somewhere in the city, alone, unaware that Azula has infiltrated Ba Sing Se’s walls.\nIt’s been three years since he saw Azula. She’s been alone in the palace, bearing the full brunt of their father’s expectations. Zuko doesn’t know what kind of person she has become.\nMaybe she’ll take him back to the Fire Nation. His banishment is still in place, but maybe she’ll capture Aang, and bring them both back to the Homeland, drag them in front of Ozai, and then--\nA pebble, no bigger than his finger, bounces off his arm. It stings.\nZuko looks up. Jet glares at him from the other side of the cave, holding up another rock. “You’re freaking out. You need to calm down.”\nZuko shakes his head, because--because--\n((Zuko has a panic attack. Jet gives in and helps him through it. He says he did it because he didn’t want Zuko to get spooked and firebend in the enclosed space, but Zuko admits some things about his past trauma and he can tell Jet is no longer as hostile towards him.))\n \n \n \n \nAang topples onto the beach, panting and wild-eyed. Katara almost shoves Sokka into the waves in her haste to get to him.\n“This can’t be good news,” Sokka mutters, following her.\n“There are Kyoshi Warriors at the Earth Palace,” Aang says. “Except–except they’re not.”\n“Aang, slow down,” Katara says, rubbing a hand over his back. He’s trembling faintly.\nAang shakes his head. “No, you don’t understand. I recognised them. And I swear they’re the same Fire Nation girls that fought with Azula.”\nKatara and Sokka exchange wide-eyed glances. It hadn’t escaped Sokka’s notice that Aang was alone.\n“Aang,” Sokka says, heart in his throat, “where are Toph and Zuko?”\n \n((Aang and the siblings run into Toph on the way into Ba sing Se. They’re all super worried about Zuko considering what he’s told them about his family and how badly he’d freaked out when they first ran into Azula at the drill.\nThey also run into Smellerbee and Longshot, also looking for Jet. Katara is Not Thrilled to learn that Jet is in the city too but they decide to all work together to find their boys. They eventually end up finding them - only to also run into Azula.))\n \n“It’s not too late for you,” Azula says.\n“I’m not helping you capture the Avatar,” Zuko says, hands balled into fists at this side. His palms feel red-hot, flames lingering beneath his skin. “And I don’t want to go back to the Fire Nation. Why would I?”\n“No.” Azula shakes her head. She’s carefully not looking at him, as though Zuko is beyond her notice. “I mean you should leave now while I’m feeling merciful and will still allow it.”\n“I won’t abandon my friends--”\n“Your stupid little friends are already lost. The Dai Lee will subdue them soon, if they haven’t killed them outright.” Azula waves a hand in the air lazily, cutting off Zuko’s protests. “Yes, yes, I’ll put in a good word for you. Maybe they’ll be spared if they comply. But there is no reason for you to join them. Uncle is still out there somewhere, is he not? He’s already lost one son. Would you really force him to lose another one?”\n \n((Zuko thinks about leaving and returning to the Jasmine Dragon. He’s homesick and misses Uncle and the crew SO bad, misses that simple but happy life as a tea server desperately. But ultimately he decides that he could not abandon his friends and realises that his previous life is now lost to him, the way his life as a prince had been lost to him so long ago. Zuko fights Azula and is eventually joined by the rest of the gang (+ Jet, Smellerbee and Longshot) and the Dai Lee. Aang still gets hit with lightning. Jet, Smellerbee and Longshot hold off everyone long enough for the gaang to escape with Aang))\n \n \n \n \nBelow are some snippets I had written for what was going to be my final chapter covering Book 3:\n \n \nZuko hasn’t worn all-red in years.\nOn the Jasmine Dragon, Zuko’s wardrobe consisted mostly of browns and yellows and muted greens. The clothes he’d taken from the Fire Nation Palace were too small for him now and not suited for a tea server. And it was difficult to procure red clothing in the Earth Kingdom. Zuko didn’t mind. The Jasmine Dragon was quite obviously a Fire Nation vessel, but customers reacted more favorably when he was dressed in neutral colours.\nHe runs his hands over his cropped red tunic. He’d stolen it from the clothesline of a coastal villager, so of course the quality would be nothing like his royal robes. But it still feels…\nHe snaps a hooded capelet to throw on over his tunic. It wasn’t the elaborate gold finishings he had grown used to as a prince, but the simple yellow thread, stitched with swirls and spikes that reminded him of the flame on the Fire Nation flag, made him feel strangely homesick.\n“Calm down, sparky,” Toph says. “I think you look great.”\nZuko tugs at his high-waisted pants, looser and darker than his tunic. “Thank–oh. Very funny.”\nKatara rolls her eyes. “Well, I have functioning eyes and I think you look great, Zuko.”\n“Very Fire Nation-y,” Sokka says with a thumbs up. Zuko examined his friends. Aside from Toph’s green hair-band and Katara’s necklace, the group also looked perfectly Fire Nation. It was almost eerie.\nThey wander into town to replace their foreign accessories. Zuko’s yellow ribbon had been lost in Ba Sing Se, so he found one in a similar canary-yellow shade and tied his hair back in a high ponytail.\nWhen he turns back around, Aang is standing in front of him holding several identical beaded bracelets. He holds one out to Zuko, looking almost shy. “Sokka sometimes likes to joke that we should all get matching jackets, but I saw these and thought… You don’t have to take it if you don’t like jewelry–”\nZuko ties the bracelet around his wrist. There’s only a dozen glass beads on the thread, and he twists them around idly. “There’s plenty of space on the bracelet for more beads. Maybe one day we can add other colours for the other nations.”\nAang swoops in to hug him tightly. Zuko squirms in his hold. He’s just grateful that Aang didn’t sweep them both off the ground and up into the air, like he normally does when he hugs his friends. Such a clear display of airbending in a Fire Nation market would not end well.\nEvery so often, Zuko catches Aang looking down at the bracelets on everyone’s wrists and smiling to himself. He silently decides to never take the bracelet off.\n \n \n \n \n“Are you going to stop him?” Toph asks.\nThey watch, several steps back, as Aang nods to a bewildered man. “Flameo, hotman.”\n“Um,” the man says “hello? I guess?”\n“Hotman,” Aang says to a passing woman. “Little hotman,” he says to the child waddling behind her.\n“Eventually,” Zuko tells Toph. “Let him embarrass himself for a little longer. A bit of humility is good for the spirit, as my uncle likes to say.”\nToph smirks. “I knew there was a reason I liked you.”\n \n \n \n \n \n“I’m going to kill you,” Sokka tells Aang. “I know you’re the world’s last hope and all that good stuff, but--I’m going to kill you. You’ve left me no choice.”\n“Sokka, calm down,” Katara says.\n“A school,” Sokka says. “We’re in enemy territory and he went and enrolled in a school, Katar!”\nZuko hands him a bowl of broth. Sokka sips at it, still glaring at Aang. “There are worse things he could have done,” Zuko says.\n“And it’d be more suspicious if he suddenly disappeared,” Katara agrees.\n“How are you two on board with this? Aren’t you supposed to be the rational ones?”\n“Katara, rational?” Zuko says, at the same time that Katara says, “Zuko’s not rational.”\nThey frown at each other. Off to the side, dangling a wiggling cave-hopper at Momo, Toph snickers.\n“I can be rational,” Katara says.\n“So can I,” Zuko says.\n“You’re both disasters that have very passing moments of common sense,” Toph says.\n“None of us have common sense, clearly!” Sokka waves a hand at Aang, spilling broth down his pant leg. He’s so annoyed he doesn’t seem to notice.\n“Sokka, come on,” Aang tries. “Every minute I’m in that classroom, I’m learning new things about the Fire Nation. I already have a picture of Fire Lord Ozai!”\nZuko hasn’t seen his father in years, and there were no photos of him onboard the Jasmine Dragon, even though paintings of the Fire Lord were customary in many Fire Nation dwellings. He thinks Iroh had seen how uncomfortable Zuko had been with his father’s painting glaring down from him. Maybe it had made Iroh uncomfortable too.\nAang holds up a second picture. “And here’s one I made out of noodles!”\nZuko bursts out laughing, a violent sound almost like a sneeze. Ozai’s noodle-face frowns down at him. He chokes on his next wheeze.\nToph thumps him on the back roughly. “You good, buddy?”\n“Oh sorry, Zuko.” Aang lowers the pictures. “I forgot. It must be super weird to see your dad made out of noodles.”\nZuko waves him off. “It’s fine, Aang. I kind of like it.”\n“It’s impressive, I’ll give you that,” Sokka says. “But I still think this whole thing is too dangerous.”\nAang looks off to the side. “I guess we’ll never find out about the secret river, then. It goes right to the Fire Lord’s palace. We were supposed to learn about it in class tomorrow.”\nSokka turns to Zuko, who frowns at Aang. “There’s no secret river.”\n“That you know of! Maybe it’s so secret that they didn’t tell you.”\n“So secret that they wouldn’t tell the Crown Prince, but they would tell a group of schoolkids in an outlying coastal village?”\nSokka looks disappointed at the lack of convenient secret rivers, but remains stern. “There’s no point in going to school, Aang. We have our disguises. We have Zuko to tell us everything we need to know about Fire Nation culture. There’s no point wasting time and risking our covers just so you can make noodle art about an evil war criminal. No offense, Zuko.”\n“None taken,” Zuko says.\nAang’s shoulders hunch around his ears. “I’m finally interacting with kids my own age. I know you guys are close to my age too, but--I’m doing it in a normal way. And they’re normal Fire Nation kids! I’m getting to see the side of our enemy I haven’t been able to in one hundred years. They’re people, too.”\n“Humanising the enemy isn’t always a good thing,” Sokka argues.\n“Too late for that, Sokka,” Toph says, poking Zuko in the ribs.\n“Toph is right,” Katara says. “We’re never going to look at the Fire Nation the same way after seeing the Jasmine Dragon and meeting Zuko. And what about when the war is over? Zuko will go back to being a Fire Nation prince, but he won’t stop being our friend.”\nZuko grimaces. It’s weird to think of “going back” to being royalty, of slipping back into his role as prince after years of relaxing into his role as a tea server. “Let’s not get too far ahead of ourselves.”\n“So you both agree with me!” Aang says.\n“No, I still think this is crazy,” Toph says. “Why do we need to learn about the Fire Nation when we have Zuko?”\nZuko shifts under their gazes. As uncomfortable as he feels, he can’t get Katara’s words out of his head. When this is over, when he is no longer banished and Ozai is no longer an immediate threat to his well being, would he go home to the Fire Palace? Was that even home to him anymore? “I don’t know everything about the Fire Nation. It’s been three years since I was here. And even before that, I was the prince. I don’t know what it’s like in these villages. I don’t know what the rest of the country thinks and feels about--everything. I don’t know what our children are being taught in schools.”\nMaybe, if he knew a little bit more about how his people functioned outside of the Court, he could understand them better. Understand this war. Understand himself.\n“I can’t just go around asking these questions,” Zuko goes on. “It would be too suspicious, but Aang is in the perfect position to learn how the Fire Nation operates from the inside.”\nSokka sighs. “Fine. Fine! We’ll stay a few days, just to make Zuko and Aang feel better.”\nAang jumps into the air, hands up. “Flameo, hotman!”\n \n \n \n \n((Aang convinces them to throw a dance party))\n \n“I can’t believe you’re going along with this, too,” Sokka grumbles, trailing behind Zuko as he lights the candles scattered around the cave. “You’re supposed to be Mr. Cautious, and I’ve heard you whine about music night on the Jasmine Dragon. But you want to help throw a dance party in a cave when we’re fugitives?”\nToph cackles. She’s leaning against a recently erected stone pillar. Zuko just hopes the kids are as unfamiliar with the other forms of bending as he had been at that age, because the cave has clearly been modified with earthbending.\n“Mr. Cautious? You mean the guy who ran around Ba Sing Se in a tacky theatre mask?”\n“It wasn’t tacky!”\n“The mask was kind of cool,” Sokka agrees reluctantly. “But you were so against coming to the Fire Nation. Why are you suddenly all for this?”\nZuko shrugs. “I grew up in the Fire Nation, remember? I know how stifling the lessons can be, how little you learn about the arts and self-expression and just enjoying yourself. If Aang can help these kids unwind for a night, kind of like the Jasmine Dragon helped me unwind, then I think it’ll be worth the risk.”\nAang floats to their side of the cave. The accompanying gush of air almost blows out the candles Zuko had been lighting. “Zuko’s right. They deserve a night to cut loose! We’re trying to restore balance to the world. That means helping the Fire Nation, too.”\nSokka groans. “Fine. I agree that the Fire Nation needs an overhaul, and I’m all for less murder and more dancing. I just don’t like that we’re doing this in the middle of an enemy nation when we’re still at war.”\nAang laughs, the way he often does when Sokka is this stressed, because he secretly thrives on chaos. He steals a hug from Zuko, snags a cup of tea, and then scampers off to check in with Katara.\n“If we don’t all die horrible before the war ends,” Sokka says, looking tired again, the way he often does these days, “then you can throw all the dance parties you want. You can throw one right in the middle of the capital and I’ll be dancing in the streets beside you.”\n“I’m not throwing any dance parties, Sokka.”\n“Just you wait. Aang is definitely going to bully you and your uncle into it.”\nZuko grimaces, knowing he’s right.\n \n \n \n \nThe sun slips behind the moon at midday. A shiver runs up Zuko’s spine, and the warmth inside him, the fire on a constant low-simmer behind his sternum, goes dark. He fumbles at his robes. His heart beats against his hand, alive and scared, but he still feels like a part of him has been snuffed out.\nWhen he looks up, he finds everyone watching him.\n“Try and bend,” Sokka says.\nZuko tries to draw a flame in his cupped hands. Nothing. He stands, performs a basic kata, one he has been able to do since he was nine years old. Nothing. Even his breath of life doesn’t warm him.\n“It really does take your bending!” Sokka says. “Also, Zuko, buddy, I never realised it before, but those bending forms look kind of dumb. It looks good when you’re flinging fire everywhere, but otherwise--”\nZuko sits back down, scowling. Suddenly feeling cold, he shuffles closer to Toph. She smirks at him, but thankfully, no one comments on the clear real reversal of their situation: the firebender seeking warmth from another person.\n“What does it feel like?” Katara asks.\n“Like my internal flame has gone out. Like I’m cold and empty and totally powerless.” Zuko makes a face. “Is this what you guys always feel like?”\n“Hey,” Toph says from under his arm, “earthbender here. Earthbender who can totally kick your ass.”\n“Sorry,” Zuko mumbles. The chill is making him feel achy and tired, like he’s running a fever. He shivers and curls even closer to Toph. She’s radiating heat. He thinks he understands why everyone always shuffles close to him on cold nights.\nKatara gets up and sits on his other side, sandwiching him between them. She puts a hand on his forehead. “You always run as hot as a camp oven, but now you feel so cold…”\nSokka scowls. “If the Fire Nation hadn’t prepared so well, this would’ve been the perfect attack. Look at Zuko! The Fire Nation is totally powerless. If only they could stay like that for a while.”\n“For forever,” Toph says.\nSokka thinks for a moment. “We can’t take down the sun, right? Although…”\n“Sokka!” Katara says. “That’s what Zhao tried.”\n“I know that! I wasn’t serious. I just think it’d be really helpful if all the evil firebenders magically lost their bending forever.”\nAang stands up so quickly he wobbles and almost falls back down again, clearly not unaffected by the eclipse. Zuko wonders if he would have been as affected before he stoked his inner flame and learnt how to firebend.\n“Zuko,” Aang says, eyes so wide they’re almost manic, “that’s it.”\n \n((Field trip to the spirit realm))\n \n \n \n \nTwenty-four hours have passed since the eclipse and their journey to the spirit realm.\nThree years have passed since Zuko first spoke out against an act of violence against his own people and, in reward, was scarred so deeply that for centuries to come people would see his portraits and recognise him for the rough, red skin warping one side of his face.\nThree years after Ozai cast him out and told him not to come back unless he had the Avatar in tow, Aang bursts into the throne room where Fire Lord Ozai is holding court. He is flanked by his bending masters.\n“Fire Lord Ozai,” Aang begins, but stops when Zuko places a hand on his shoulder.\n“Fire Lord Ozai,” Zuko says without bowing, without flinching “you told me to bring you the Avatar, and like a good son, I have done so.” He smiles. “I hope this pleases you.”\nHe doesn’t have time to enjoy this moment; twin jets of lightning come at him at once. Aang takes Azula’s, and Zuko catches Ozai’s.\nHe won’t let Ozai hurt him or his friends ever again.\n \n \n \n \n \n \nMy plans for this fic:\n \n \n "
}