{
    "id": "20711507",
    "url": "https://archiveofourown.org/works/20711507?view_full_work=true",
    "author": [
        "senlinyu"
    ],
    "title": "Anthology",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "F/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Hermione Granger/Draco Malfoy"
    ],
    "characters": [
        "Harry Potter",
        "Ron Weasley",
        "Blaise Zabini",
        "Hermione Granger",
        "Draco Malfoy",
        "Narcissa Black Malfoy"
    ],
    "additional_tags": [
        "Tumblr Ask Box Fic",
        "Tumblr Prompt",
        "Ficlet Collection",
        "Angst",
        "Fluff and Humor",
        "Banter",
        "Sharing a Room",
        "one bed",
        "Trapped In Elevator",
        "Jealous Draco Malfoy",
        "Powerful Hermione Granger",
        "Courtship",
        "Courting Rituals",
        "Political Rivals",
        "Blackmail",
        "PTSD",
        "Secret Relationship",
        "social smoking",
        "Arachnophobia",
        "Unplanned Pregnancy",
        "Memory Alteration",
        "Alternate Universe - Non-Magical",
        "Alternate Universe - College/University",
        "Established Relationship",
        "Demon Draco Malfoy",
        "Demon Sex",
        "Wing Kink",
        "Fluff",
        "Domestic Fluff"
    ],
    "language": "English",
    "series": "Part 2 of Tumblr Prompts",
    "published": "2019-09-20",
    "completed": "2023-07-17",
    "words": "35,183",
    "chapters": "29/29",
    "comments": "1,466",
    "kudos": "11,420",
    "bookmarks": "1,047",
    "hits": "349,617",
    "summary": "<p>Assorted prompted ficlets of varying lengths. All Dramione.<br>Ratings and any relevant warnings are listed in the chapter summary of the particular ficlet.</p>\n<p>Prompt: “He set fire to the world around him but never let a flame touch her.”<br>Category: Angst<br>Rating: T<br>Warnings: Implied coercion.</p>\n<p>Prompt: “But how can you walk away from something and still come back to it.” Neil Gaiman<br>Category: Comedy, Fluff<br>Rating: M<br>Warnings: references to torture, alcohol abuse.</p>\n<p>Prompt: Draco refers to Hermione as “his witch.” <br>Rating: T<br>Category: Fluff<br>Warnings: None.</p>\n<p>Prompt: Old and bickering dramione.<br>Category: Fluff<br>Rating: T<br>Warnings: None.</p>\n<p>Prompt: “I said get rid of it.”<br>Rating: T<br>Warnings: None</p>\n<p>Prompt: One bed. <br>Rating: T<br>Category: Rom-com<br>Warnings: None.</p>\n<p>Prompt: Harry and Draco trapped in an elevator afterDraco and Hermione’s relationship has become public.<br>Rating: T<br>Warnings: Some language.</p>\n<p>Prompt: Jealous Draco<br>Rating: M<br>Category: Rom-com<br>Warnings: none</p>\n<p>Prompt: Draco not understanding muggle customs (including holiday specific ones)<br>Rating: T<br>Category: Fluff<br>Warnings: None.</p>\n<p>Prompt: When did you know?\" \"When did I know what, Mudblood?\" \"That you were in love with me?\" Or Hermione's plan to humiliate Malfoy -- and get some justifiable payback for the years of torment -- backfires when her taunts work a little too well and convince said ferret that he just might be in love with her. Genre: surprise me<br>Rating: T<br>Category: Crack, humour. <br>Warnings: None.</p>\n<p>Prompt: Draco blackmails Hermione.<br>Rating: M<br>Category: angst, political enemies<br>Warnings: Blackmail, references to sexual situations.</p>\n<p>Prompt from the-static-him: A Draco x Hermione prompt: Meet me in the stairwell in a second for a glass of gin. (From the song ‘Nobody Else Will Be There’ by The National)<br>Triggers: PTSD.</p>\n<p>Prompt: Hermione standing on a table waiting for Draco to kill a spider for her. (I couldn’t imagine Hermione being afraid of spiders, so I reversed the prompt).</p>\n<p>Trigger warnings: spiders</p>\n<p>Prompt: Accidental pregnancy<br>Rating: T<br>Warnings: none</p>\n<p>Prompt: Tabula Rasa<br>Rating: T<br>Trigger warning: no-HEA</p>\n<p>Prompt: “No, no, no, stay with me. Don’t close your eyes.”<br>Category: rom-com, fluff<br>Rating: T<br>TW: None</p>\n<p>Birthday Ficlet for one of the Facebook group’s founding members.<br>Rating: T<br>Art by <a href=\"https://klawdee890.tumblr.com/\" rel=\"nofollow\">Klawdee</a>.</p>\n<p>Prompt: I still think about you when I can’t sleep. <br>Rating: T<br>Warning: none<br>Trope: fluff, angst, breakup/makeup vignette.</p>\n<p>Ficlet based on art by Nikita Jobson<br>Rating: T<br>Genre: romance<br>Tropes: pining Draco, drunk Hermione</p>\n<p>Collaborative art and fic piece with Avendell.</p>\n<p>Draco’s fortieth birthday ficlet.</p>\n<p>Prompt: Dramione University Students AU.<br>Tropes: College, American AU, Non-magical, grade competition.<br>Warnings: none.</p>\n<p>A scene inspired by one of my all time favourite shows, White Collar. </p>\n<p>Rated: T</p>\n<p>TW: None.</p>\n<p>Birthday ficlet for theheavycrown, my prime enabler in all things creature. </p>\n<p>Demon!Draco.<br>Rated: M<br>Tropes: demons, soft monsterfucking, angst, wings.<br>TW: is it major character death if the character is now undead?</p>\n<p>A thank you drabble for thenooblifer for producing the Manacled audiobook. She wanted Manacled Draco eating doughnuts, and I threw in Aurore too.</p>\n<p>Rating: G<br>Fluff, no trigger warnings.</p>\n<p>Drabble for ectoheart for dramione-izing a favorite photo of mine.<br>Tropes: established relationship, fluff.<br>Rated: M</p>\n<p>Prompt: Hermione in glasses</p>\n<p>Tags: Post-war, Ministry coworkers</p>\n<p>Tropes: angst, St Mungo's, Healer Hermione, Azkaban Prisoner Draco, dementors, soul damage.<br>Triggers: N/A</p>",
    "notes": "<p>Quick and dirty beta-work by Jamethiel.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Check out <a href=\"https://the-static-hum.tumblr.com/post/188072843097/meet-me-in-the-stairwell-in-a-second-for-a-glass\" rel=\"nofollow\">the absolutely gorgeous piece of art </a>that the-static-hum created after I filled her prompt.</p>\n<p>This work is based and inspired entirely by Nikita Jobson’s beautiful, beautiful Dramione art. One of my favourite pieces of all time. </p>\n<p>Piece <a href=\"https://nikitajobson.tumblr.com/post/190260459391/whatever-you-want-granger\" rel=\"nofollow\">here</a>.<br>Ficlet originally posted <a href=\"https://senlinyu.tumblr.com/post/617376107687297024/nikitajobson-whatever-you-want-granger-i\" rel=\"nofollow\">here</a>.</p>\n<p>Art by Avendell, visit her on <a href=\"https://avendell.tumblr.com/\" rel=\"nofollow\"> tumblr</a> and <a href=\"https://instagram.com/avendellart?igshid=kcyancmjg1tr\" rel=\"nofollow\"> instagram</a>.</p>\n<p>University students AU Dramione.<br>Possibly worth noting: I went to a weird college and this ficlet is based on a thing that happened there. So if you’re reading this thinking, wtf kind of university experience is this? I hard agree. 🤣</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_24_endnotes\">notes</a>.)\n</p>\n<p>Art by <a href=\"https://instagram.com/avendellart\" rel=\"nofollow\">Avendell.</a></p>\n<p>Art by ectoheart find her on <a href=\"https://www.instagram.com/ectoheart.art/\" rel=\"nofollow\"> instagram</a> and <a href=\"https://ectoheart.tumblr.com\" rel=\"nofollow\">tumblr</a></p>\n<p>Written for SimplifiedEmotions, who's been actively manipulating me into joining her Hermione in glasses agenda.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_27_endnotes\">more notes</a>.)\n</p>\n<p>The idea of Draco needing to be 'overexposed' to Hermione in order to function at work was inspired by <a href=\"https://www.fanfiction.net/s/4711871/5/The-Nymph-Hunt\" rel=\"nofollow\">The Nymph Hunt </a> by AkashaTheKitty, one of my all time favourite stories.</p>\n<p><a href=\"https://twitter.com/SenLinYuWrites/status/1562005300877467650?s=20&amp;t=LMiCRtoUYjZ1XWoCHA0YoQ\" rel=\"nofollow\">Original post</a> on twitter.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_28_endnotes\">more notes</a>.)\n</p>\n<p>\n<a href=\"https://www.instagram.com/p/Chpbdw_KTc7/\" rel=\"nofollow\">\n<strong>Illustration by Oukyn</strong>\n</a>\n</p>\n<p>This was originally a twitter ficlet that I abandoned because it got too long for a thread, so it got left sitting in my docs for almost eight months until I decided to share it on tumblr/twitter during the great ao3 outage.</p>\n<p>Open ended, pining Draco, theomione, Dramione (vaguely), Tragic Theo.</p>",
    "text": "She looked lovely, standing at the balcony, staring out at the city scattered beneath her feet. \nHer brown hair caught in the wind and revealed her pale, bare shoulders, as pale as the hands gripping the railing, and the bare feet peeking out from beneath the sheer white shift she wore.He could see the narrow nip of her waist, the gentle flare of her hips, and her thin tapering legs.\nThe wind blew more constantly, and her hair whipped forward, covering her face. \nShe didn’t move. \nShe might be cold.\nHe slipped his cloak off his shoulders and approached her, dropping it over her shoulders and gently brushing back the curls obscuring her eyes. \nShe still didn’t move.\n“What’s on your mind?” \nShe was silent for several seconds. “Many things.”\nHis fingers curled into a slow fist when she failed to say anything else. “Such as?”\nThere was a longer silence, and he watched her knuckles turn white. Her body began to shake minutely. \n“I was calculating how many seconds it would take me to hit the ground if I jumped off the balcony. How many people are dead because of me. How many will die if I stay alive. And how many you’ll kill if I died now,” she finally said in a forced, automatic voice.\nA curdling sensation swept through his gut. His lip curled into a snarl as he gripped her shoulder and forced her to turn and face him. \n“I’ll kill them all if you die.”\nHer lovely brown eyes were flat as she looked up at his face and nodded slowly. “That was my conclusion.”\n“Good,” he said in clipped voice. \nHe let go of her and stalked back inside. \nOnce he was alone, he wrenched open a drawer in his closet and pulled out an old photo of her. Her eyes were bright and dancing, and he watched as she wrapped her arms around Potter and Weasley, threw back her head, and laughed. \nHe could almost hear it, although she hadn’t laughed for years now. \nShe feigned it—polite chuckles in response to his jokes or the jokes of his friends. Her eyes always stayed flat. The light in them didn’t dance; the corners didn’t crinkle. She never gripped her chest or gasped as though she couldn’t breathe from it.\nShe was never happy.\nNothing he gave her was ever enough. \nHe’d set fire to the world around him, but never let a flame touch her. \nHe hadn’t calculated that her unbearable sense of empathy meant she’d feel it all anyway. \nAll roads lead to Rome. \nDraco had read the line in a book as a child, hadn’t had the faintest idea what it meant, and been too nervous to ask his father. \nFor as long as he could remember, everyone told him he was smart. His mother. His father. His grandparents. The parents of other children.\nHe was Draco Malfoy. He was smart. He was going to break hearts. \nThose were the pillars upon which he built his identity. \nHe tried very hard throughout his life to only do things that would ensure people would continue thinking he was smart. He didn’t ask questions when he felt like he was probably supposed to know the answer. He didn’t try to do things if he wasn’t sure if he could succeed at them. \nHe cheated—which might have been rather unfair of him, but if he was smart enough to get away with it, didn’t that just highlight the point?\nYet, somehow, life had really not gone nearly as well as he’d hoped. \nFor one thing, being Draco Malfoy had become disgraceful. For another, he’d spent his entire formal education at Hogwarts being soundly trounced academically by a Muggle-born. And finally, and most recently, said Muggle-born was was in the process of stomping his heart into pieces.\nAll roads might have led to Rome once, but in Draco’s life and experience they all led to bushy-haired, bossy-voiced, know-it-all, swot extraordinaire Hermione Granger. \nNo matter which choice he made, or which aspect of his identity he had tried to lean into, Granger’s irritatingly large eyes somehow appeared in the horizon of his life and proceeded to bowl him over. \nHe was never the smart one when she was in the room. Not ever. Not even remotely. Granger just oozed brilliance out of her pores. Any accomplishment Draco had ever managed, Granger had probably done it two or three years prior and without training. \nHe was Draco Malfoy and, as Malfoys do, he’d gone and become a Death Eater, thinking that the world would be a much more delightful place if over-accomplished Mudbloods stopped mucking it up for him. \nSomehow that road had also led to Granger: in his drawing room, screaming while his aunt tortured her. As he’d stood frozen in horror, it dawned on him that a world without over-accomplished Mudbloods wasn’t a world in which he was any better, it was just a world with a lower ceiling.\nSo he’d turned on his heel and walked away from the entire ideology of it. He’d thought a one hundred and eighty degree turn would send him in a direction in which Granger would never cross paths with him again.\nAnd yet… \nDraco wasn’t sure if his world was just that small, or Granger somehow loomed incredibly large, or possibly she did something to disrupt physics or gravity that constantly put her into whatever path he took. \nThey’d ended up on the same charity board, which he’d told himself would be fine given that it was a large charity and he was not really an active member aside from writing numerous cheques for them. But then somehow he’d been dragged into hosting a charity gala, which had resulted in his having to plan the said gala with Granger. \nDraco had told himself it was fine as he was dragged rapidly down yet another road involving Granger’s extremely large, bright eyes, and thoughtfully pursed lips. He’d swerve at the last moment or perform a Wronski Feint or something, and the road would go around Granger. \nHe reminded himself of it the entire evening while he downed glass after glass of champagne, and danced holding her in his arms, and repeatedly drowned in her aggravatingly enormous eyes.\nIt was fine, until it wasn’t fine any more.\nIt turned out, in retrospect, that Draco had drunk too many glasses of champagne while telling himself that it really was going to be the last time he interacted with Granger. As they stood in the empty ballroom, Granger kicked off her shoes and pulled out the pins keeping her hair in place while helping the house-elves clean up. Her eyes kept getting larger and closer, and when she looked up at him and made a joke about the melting ice sculpture, Draco forgot about swerving. \nHe kissed her. \nHe kissed her and she kissed him back, and they kept kissing and made it all the way up the staircase and down the hall into his room. He’d pulled her dress off and tangled his hands in her bushy hair; drank in the moans that dripped from her clever mouth; and nibbled and nipped and kissed her brilliant skin; and watched her enormous eyes grow dark. \nWhen he came inside her, and then fell asleep kissing her and holding her in his arms, he decided that maybe all roads were supposed to lead to Granger. Maybe that was the point. \nExcept she was gone when he woke the next morning; and he’d been lying in bed for ten hours now, trying to re-evaluate his entire existence once again. \nHis road had led to Granger, but now that he’d reached her, she’d gone, gathered her things, and left without a word to anyone, not even the house-elves.\nHe took a despairing drag from the cigarette dangling between his fingers.\nNow that there was no doe-eyed Granger on his horizon, he wasn’t sure what direction he was supposed to go in. Since the age of eleven there had always been two directions—towards Granger or away from Granger, and they’d always ended up being the same direction in the end. \nNow it felt as though the needle in his compass was left spinning wildly, and he didn’t know anymore which direction was towards her or away from her or anything else about the nature of the universe.\nTherefore, he had decided not to get out of bed until he died. \nHe theorised that if he smoked and drank aggressively enough he could probably cut his estimated life-span in half, which meant only forty or fifty years of mourning.\nHis mother came and tried to force him to come down for lunch and he flatly refused. \nHe drank firewhiskey all afternoon and when he was on the verge of passing out or maybe dying from alcohol poisoning, Granger materialised in his bedroom. \n“Myyyy god,” he slurred and sat up to glare at her. “How is it my life always ends up fucked by you?”\nShe folded her arms and stood glaring at him. \nDraco threw his hands in the air. “It doesn’t matter what I do, or don’t do. It’s always you. Every time I walk away, I always end up coming back to you from a different angle. I can’t even peaceably die in my own bed.”\nDraco pressed a hand against his heart and fell back into the pillows. “What have I ever done to you to deserve this—?” He blinked and then said, “Aside from the obvious.”\nGranger still wasn’t saying anything, which was fortunate because Draco had a lot to say.\n“You’ve ruined my life. Obliterated my identity. I’m never the smartest, and now it’s not even impressive to be pure-blooded anymore—and I was getting over it, but—but why? Why did you have to break my heart?”\nHe glared at her again, still gripping his wounded chest. \nShe sighed and tucked several curls behind her ears. “Draco—I had to catch a portkey this morning. I’m positive I told you.”\nDraco blinked and stared up at the ceiling. Now that she mentioned it, he did recall her breathily murmuring something about not being able to stay while he was busy kissing along her throat and divesting her of the dress she’d been wearing. \nSomething about Sweden. \n“Oh…” he said slowly. “Right.”\n\nShe stood glaring at him with her hands on her hips, drawn up to her fully unintimidating height of barely more than five feet. Her eyes were flashing, and her hair appeared to have begun moving of its own volition. There were small sparks emitting from several particularly angry looking curls. \n\n\n“Being senior undersecretary to the Minister doesn’t give you permission to remove an Unspeakable from their department and assign them as a personal bodyguard for your vacation to Santorini. This is a blatant abuse of power, and you will go and tell the Minister that aurors will be a perfectly acceptable security detail”—her voice grew deadly—“unless you want to find out exactly what it is that I do in the Department of Mysteries.”\n\n\nShe smacked a piece of parchment down on his desk and turned on her heel. \n\n\nDraco watched Hermione strut angrily out of his office and the door slam with a resounding bang. \n\n\nHe leaned back with a resigned sigh and eyed the smoldering piece of paper. \n\n\nApparently he wouldn’t be proposing to her this weekend either. \n\n\nHe twirled his wand in his fingers and stared thoughtfully at the ceiling, trying to think of a new means of prying his witch out of her beloved laboratory for a few days without tipping her off.\n\nHermione stared down at the milk toast the house-elves had placed before her. \n“Darling—“\nHer husband looked over his newspaper at her, his eyes glittering. “Yes, my light?”\nIt was difficult to say whose voice dripped with more saccharine sarcasm. \nHermione studied him for several seconds in silence before her lips curved into a razor-edged smile and she speared a piece of soggy bread with her fork.\n“I just wanted to say how relieved I am that you aren’t being petulant because I said you shouldn’t participate in the Quidditch game this weekend.”\nDraco folded his paper and laid it aside. His silver hair matched his glittering grey eyes. “Of course not,  Dearest. After all, I am ‘old’ and ‘not nearly as fit as I like to think I am.’ It brought to mind that I haven’t cared for you in your old age as attentively as I should. Given that you are nearly a year older than I, I realised some proactive measures were in order.”\nHermione nodded slowly. “Now that I think about it, my jaw has been bothering me.”\nConcern suddenly flashed in Draco’s eyes. \nA thin smile graced Hermione’s face. “I think it’s probably for the best that I avoid  any  rigorous oral activities for the next several months, don’t you?”\n\n“I said get rid of it, or move it,” Hermione said in a cold voice. \n\n\n“But—”\n\n\n“I said no, and I meant no. Choose a different floor, or I’ll change my mind about it completely.”\n\n\n“Why?”\n\n\nShe whirled on him. “Oh I don’t know, maybe because I don’t want to have a sex \n\ndungeon\n\n!” \n\n\nDraco sighed with resignation and rubbed his forehead. “Would the fourth floor be acceptable?”\n\n\nHermione nodded and turned primly back to her paperwork. “That’s fine. I just don’t want it in the dungeons.”\n\n\n“No.”\n\n\n“We’ll take it,” Granger said promptly, ramming her extremely pointy elbow into his ribs. \n\n\n“We will not,” he muttered as he doubled over and struggled against wheezing. \n\n\n“Ignore him.” Granger was smiling brightly at the concierge and handing over a credit card while her stiletto heel drove agonisingly into his foot. \n\n\n“There are other hotels,” he said, trying not to hobble as he chased her down a long hallway. “Hundreds. This city is massive. It’s not like this is the only hotel.”\n\n\n“Shut up, Malfoy,” she said coldly as she reached the door and slotted the hotel key in. The lock beeped and turned green. As she gripped the knob, Draco’s hand closed over hers, his heart was pounding heavily in his chest. \n\n\n“Granger—“ he said in a weak voice, struggling to find the right words. “I cannot share a bed with you.”\n\n\nHer eyes narrowed dangerously. “I’m not trekking around an unfamiliar city at one o’clock in the morning to find another hotel. I’m tired. I have had an exceptionally long day putting up with you. I am sleeping here. If you want to go find another hotel on your own, be my guest. Now. Get. Out. Of. My. Way.”\n\n\nBlood was roaring his ears as she pushed the door open and stepped in, flicking the switch by the door and kicking her shoes off in the same movement. \n\n\nShe gave a breathy sigh of relief that coiled through his gut and sent a flush of heat across his chest as he followed her into the room and let the door shut behind him. \n\n\nShe peeled off her slick raincoat and hung it in the closet and dropped her bag onto the dresser. \n\n\nDraco’s eyes were locked on the bed. It wasn’t the smallest bed, but it looked small when his mind was filled with the thought that it would be Granger lying beside him, close enough to easily reach out towards, and she apparently had no objections whatsoever to such an arrangement. \n\n\nThe collar on his shirt was soaked and felt stifling. He reached up, loosened his tie, and undid the top several buttons.\n\n\nHe allowed his gaze to travel away from the bed back to Granger. \n\n\nHer hands were sliding up her leg and under the hem of her sheath dress. Draco tried not to choke audibly.\n\n\nWas she unhooking her stocking? Did she wear stockings with a garter belt? He wasn’t sure if he had the fortitude to know that particular detail about her. \n\n\nDraco felt as though he were on the verge of a heart attack as his eyes followed her pale hands as they slid along her inner-thigh. \n\n\nMerlin…\n\n\nMorgana…\n\n\nCirce…\n\n\nHer hands slipped out from under the hem of her dress. Her wand was gripped in her right hand. \n\n\nShe straightened and, with a quick flick, shrank the chair, desk, and mini-fridge. She levitated them up into her hand and then lined them neatly along the top of the dresser. \n\n\nShe waved her wand again and extended the room by an additional ten feet and then proceeded to conjure a second bed complete with duvet and several pillows. \n\n\nShe pivoted on her heel and leveled him with a scathing glare before she added an enormous privacy curtain. \n\n \n“Potter.”\n“Malfoy.”\nHarry pressed a button on the lift and then stepped back, leaning back against the wall and folding his arms loosely as he stared at the pointy-faced prat his best friend had just announced she was dating.\nMalfoy’s eyes were locked on the lift doors. His expression was cool and indifferent, but as Harry studied him,  he noticed that the corners of Malfoy’s eyes were tense and the fingers of his left hand twitched as though he were fighting the urge to reach for his wand. \nHarry cleared his throat and watched Malfoy’s entire body go rigid for a split-second. He started to open his mouth. \n\n Hermione will murder you if you mess with him. \n\nHe shut his mouth resignedly and wished the lift would hurry up. \nInstead, there was a grinding sound, and the lift abruptly came to a halt. \nMalfoy let out a disbelieving breath and stepped forward, jamming his thumb repeatedly against the buttons. The lift buttons illuminated but nothing happened.\nMalfoy banged against doors and swore under his breath. He tilted his head back and rolled his jaw so that it popped audibly before turning to look at Harry. \n“Well,” was all Malfoy said before leaning back against the opposite wall and loosely folding his arms, mirroring Harry’s stance. \nHe’s got his wand in an arm holster, Harry realised. \nAfter several deafening minutes of silence Malfoy snorted. \n“I’m not going to fight you, Potter. If you’re going to pummel me in the lift, you’ll have to make the first move. Just get it over with.” His teeth were bared, and he had the same nasty sneer on his face that he’d worn at school. \nHarry’s eyebrows shot up. “I’m not going to attack you. Hermione will murder me if I mess with her personal life.”\nMalfoy didn’t relax one bit. “Right,” he said in a tone thick with disbelief. “The lift just happened to break with you and I in here.”\nHarry shrugged. “Well. I’ve been here the whole time. So—wasn’t me.”\nMalfoy’s eyes rolled briefly, and he turned and stared stonily at the doors. \nThe silence dragged until Harry couldn’t take any more. \n“How’s working in the Wizengamot?”\nMalfoy’s jaw twitched. “We really don’t need to talk, Potter.”\nThere were several more minutes of silence. \n“So—you and Hermione,” Harry said, stuffing his hands into his pockets and finding a snitch he’d forgotten about. “I can’t say I ever expected that.”\n“I imagine not.” Malfoy didn’t look away from the doors. \nHarry pulled the snitch out of his pocket and started tossing it and catching it. He eyed Malfoy. “You do actually care about her, right? This isn’t some plan your dad hatched up to make your family look better by using her, is it?”\nMalfoy’s lip twitched and curled upward. “Yes, Potter, I’m using her, and I’m going to tell you all about it in a Ministry lift, and I chose her because there aren’t any less obvious Muggleborns to date.”\nHarry’s eyes narrowed. “Why not? She was the Muggleborn you always said you hoped would die first. It’s hard not to think this is just a different way to hurt her—since it’s not  fashionable  to want her dead anymore.”\nMalfoy’s jaw twitched and the tension around his eyes got more obvious. “Right”—his voice was stiff—“because if I hurt her, it would assuredly make my family look better.”\nHarry caught the snitch and gripped it. “It could be either one. Either way Hermione is the one who ends up hurt.”\nMalfoy was silent for a second, and then he turned his head to look at Harry. His grey eyes were shuttered and cold. “So what now? Is this the part where you threaten me with Azkaban or grievous bodily harm? Order me to stay away from Granger or else? Do tell.”\nHarry stared at him. “Why do you still call her Granger?”\nMalfoy twitched and looked away. “Habit.”\n“Why do you like her?” Harry wasn’t trying to come across as though he were interrogating Malfoy, but he couldn’t help himself. \nMalfoy wasn’t even trying to hide his irritation. “Why do you like her?”\nHarry blinked and tried to think of a way to explain Hermione. \n“She’s—Hermione,” he finally said. He stuck his chin out. “She’s my best friend.”\n“That’s why I like her too,” Malfoy said in mocking voice. “Although I could live without the latter point.”\nHarry glared at Malfoy. “She doesn’t seem like your type.”\nMalfoy raised an eyebrow. “My type? And what type is that precisely?”\n“Someone who can’t form a thought on their own.” He raised his eyebrows. “You’ve always liked the stupid people who’d follow you around and do whatever you told them. You weren’t ever friends with anyone you thought was your equal, only people who let you feel like you were better than them.” Harry was no longer trying to hide his dislike. “So—yeah, Hermione doesn’t really seem like your type.”\nMalfoy sneered at him. “Difficult as it may be for you to imagine, Potter, some of us are capable of evolving beyond our eleven year old selves.” \nHis hands had curled into fists, and he looked as though he were on the verge of trying to deck Harry. “What do you expect me to say? It’s not as though it’s convenient. Did you think I planned it? I’ve barely gotten my life back together, and now I’ve got another thing that everyone’s waiting for me to fuck up.”\nMalfoy slammed his fist against the doors and stood, radiating rage. \nHarry’s mouth twisted and he rolled his eyes. “So why are you publicly dating her then?”\nMalfoy’s hand slid down the door, and his shoulders slumped. \n“I don’t know how to stay away from her—and I didn’t want her to think I was hiding her, that I didn’t want to be seen with her. This way—when it goes south, the way everyone expects it to, it’ll be my life fucked by it.” \nHarry raised his eyebrows again and tossed the snitch into the air again. “Sounds weirdly noble of you.”\nMalfoy snorted but he didn’t say anything in response. \nHarry leaned his head back against the wall.\n“Hermione goes all in on things,” he said after a minute. “She never bails, no matter how bad things get or what it costs her. She doesn’t care whether anyone will appreciate it. She always does what she thinks is right. If she thinks someone needs her, she doesn’t know how to say no to them.” His chest tightened. “I—I took advantage of that a lot—in school. I was so focused on what was happening to me that I never bothered to see how much I was asking from her without even noticing. Especially during the war.” \nHarry gripped the snitch in his fist until the bones in his palm hurt. “I don’t want to see that happen to her again.”\nMalfoy nodded slowly, still staring intently as the doors. “Let me know—if she’s hurting because of me.”\nHarry was tempted to retort that if Malfoy hurt Hermione, Harry wouldn’t be letting him know as a favour, but he bit his tongue. Malfoy sounded half-despairing. \nThe lift suddenly jerked, descended a few more feet, and the doors slid smoothly open.\nMalfoy glanced at Harry out of the corner of his eye before straightening and walking rapidly out without a backwards glance. \nHarry followed him slowly and watched him enter the Magical Creatures Department. \nHermione was standing by a receptionist desk with an enormous armful of scrolls and an overstuffed satchel hanging heavily from her shoulder. There was an anxious expression on her face as she spoke rapidly to the receptionist. \nMalfoy’s walk slowed to a saunter. “I hope you aren’t bringing all of that with you to lunch,” he drawled. \nHermione looked over. Her expression cleared and her eyes lit up. “Draco—I got caught in meetings and thought I might have missed you.”\nMalfoy slid her bag off her shoulder and up onto his own and started taking all the scrolls. “Lift got jammed on the way down.”\nHermione’s eyebrows furrowed. “That’s odd. They’re levitational, they shouldn’t be able to get stuck.”\n“Charmwork may be old. Did you still want to check out the new cafe in Diagon, or were you in the mood for something else?” \nThey were heading back towards the lifts, and Harry stepped back to avoid several elderly witches returning from lunch. \nHermione and Malfoy passed him without a glance and entered the lift. As the doors slid shut, Harry watched her slip her hand into Malfoy’s and lean her head against his shoulder. The tense, defensive expression on Malfoy’s face had disappeared. As he stared down at the top of Hermione’s head, his face appeared unguarded for the first time in years. Then the doors shut entirely, and the couple disappeared from view.\n“Did it work?” \nHarry looked over as Ron appeared. “What?”\n“Trapping Malfoy in the lift with you. Jennings in maintenance owed me a favour. When I saw you get on, I legged it down the stairs. Figured half an hour was long enough for you to tell him to fuck off and leave Hermione alone.”\nHarry rolled his eyes. “You think I was going to hex him in a Ministry lift?” \nRon shrugged cheerfully. “Or throttle him. That’s what I’d do.”\nHarry shook his head. “Hermione could castrate me ten different ways if I messed with her boyfriend. If he’s not afraid to date her, I doubt there’s much I can threaten him with.”\nRon was eyeing him with disgust. “You didn’t do a thing, did you?”\nHarry stuffed his hands into his pockets and stared at the closed doors of the lift. “I really didn’t need to. She’s got him whipped.”\n\n“What are you—-umph!”\n\n\nHe hummed against her lips as he backed her across the room and against the wall. His hands slid down and gathered her skirts up around her hips, his fingers skimming along her bare skin.\n\n\nHis other hand dug into her hair, pulling apart the carefully pinned curls and destroying the delicate, sparkling netting that had made her chignon shimmer mesmerisingly. He tugged her head back and pulled away from her lips in order to trail his mouth along her temple, pressing light kisses across her cheekbones, brushing off the carefully applied fairy wings which had made her look ethereal.\n\n\n“What’s—?”\n\n\nHe silenced her again with his mouth. His tongue slipped between her lips as he pinned her more firmly against the wall. His fingers pressing between her legs until he felt her shudder as a soft moan escaped her. \n\n\nHe drew his lips back and nuzzled his nose against hers, pressing their foreheads together as he stroked lightly between her legs. Her hips bucked into his touch.\n\n\nHis fingers untangled from her hair. He pulled at her neckline until the fabric tore away and left her pale shoulder bare. He dipped his head and bit down on the curve of her shoulder until she gave a breathy whimper. He removed his teeth and traced his tongue over the reddening mark to soothe it. \n\n\n“I need you…” he whispered huskily as his fingers captured the edge of her knickers. \n\n\nShe gave a quiet moan but then suddenly stiffened. She stayed frozen for a moment before slapping his hand sharply away. “You—dragged me away from a conversation with the Supreme Mugwump just because you wanted to have sex?”\n\n\nDraco blinked. \n\n\nWhen she put it like that, it sounded unreasonable. \n\n\n“Well—you see—“ he started.\n\n\nShe shoved him violently away and stared down at herself in horror before looking back up at him. \n\n\n“You are unbelievable.” Her voice was shaking with indignation. “You have mocked me for months, saying that I don’t have a strategic bone in my body; that if I understood a thing about politics I’d know that the real decisions aren’t made in meetings.” Her eyes were beginning to glow. \n\n“You said if I wanted the bill passed that this—this—!” She was nearly spitting. “This party was what I needed to attend! You dolled me up to look like some vapid fairy, had me buy a dress that cost more than three months rent for my flat, and forced me to spend five hours in a very busy day having my hair and makeup done! And then you dragged me away and ruined it all in less than twenty minutes—while I was in the middle of a conversation with the Supreme Mugwump—because you wanted to have sex?!”\n\nShe was nearly shrieking with outrage. \n\n\nDraco reached up and loosened his cravat, trying to calm her with the very compelling explanation he had. “There were people looking at you.”\n\n\nShe stared at him. \n\n\n“Inappropriately,” he added, in order to help her further understand the context. \n\n\nShe looked as though she were on the verge of strangling him. \n\n\nHe cleared his throat and steepled his hands, pressing the fingertips firmly together. “I think you’re right. You should let your hard work speak for itself. These kinds of events are for people who aren’t willing to do things by their own effort.”\n\n\nShe threw both stilettos heels at his head before stalking across the room onto the veranda and apparating with a deafening boom.\n\nDraco stared in confusion as Hermione abruptly stood up from their table at the cafe and turned around slowly. Her eyes were narrowed as they scanned the surrounding area.\nHis hand reached surreptitiously for his wand as he tried to determine what had set her off. There didn’t seem to be anything suspicious that he could see.\n\nThe old woman counting change? Was the pigeon nearby demonstrating unusual amounts of intelligence? Were there any beetles with unusual markings?\n\n\nHis heartbeat quickened and he started to stand.\n\n\nHermione’s face broke into a relieved smile and she scurried over to a—flower box?\n\n\nShe leaned over and rapped her knuckles on it twice before straightening and returning to their table and continuing to eat as though nothing had happened.\n\n\nDraco stared at her for several seconds before he finally spoke. “What were you doing?”\n\n\nShe looked up and blinked slowly as she finished chewing her salad.\n\n\n“Doing?”\n\n\nDraco’s eyebrows furrowed. “When you jumped up and went and hit the flower box.”\n\n\n“Oh!” Understanding dawned in her eyes. “I was knocking on wood so I wouldn’t jinx us.”\n\n\nDraco stared at her in bafflement.\n\n\nShe waved her hand dismissively. “It’s a Muggle thing.”\n\n\nDraco raised an eyebrow. “Jinxing yourself?”\n\nShe shrugged a shoulder as she speared a piece of chicken. “I said we’d still be dating in a year and could visit your mother’s palazzo then. In order to keep from tempting fate there’s an old Muggle apotropaic tradition of knocking on wood.”\n\nDraco quirked an eyebrow and snorted. “You don’t even believe in Divination, a formally recognised field of magic, but you stood up in the middle of lunch in order to go tap on a flower box. And now you expect that will keep us from breaking up?”\n\n\nHermione slowly raised an eyebrow of her own. “Would you rather I hadn’t?” she asked in a pointed tone of voice.\n\n\nDraco straightened. “No! No. I didn’t say that. In fact,” he threw his napkin onto the table, “now that I think about it, I should go knock on it too.”\n\n“Oh god!”\n\nThere was a frantic shuffling and slamming of closing books and then Hermione dove under the table and pulled Harry’s cloak of invisibility over herself.\n\n\nA moment later, Malfoy came nonchalantly around the corner and then froze. His ferret-y face screwed up with disappointment as he stared at Harry and Ron.\n\n\nThere was a pretentious bouquet of orchids in his hands, with a flock of tiny golden birds flying around it, softly chirping a love ballad.\n\n\n“Potter. Weasley. Zabini said he saw Granger studying here.”\n\n\nHarry and Ron stared at each other and then back at Malfoy with confusion.\n\n\n“Bathroom,” Ron said.\n\n\n“Ancient Runes,” Harry said at the same time.\n\n\nThey both winced and glared at each other.\n\n\nMalfoy sneered. “She has Ancient Runes on Tuesday afternoons with Hufflepuff, Potter.”\n\n\nHarry nodded awkwardly wondering how Malfoy knew that. “Oh right. I have no idea where she is. You could try the prefects bath.”\n\n\nMalfoy’s cheeks flushed bright pink and a slight choking sound escaped his throat. “If you see her, tell her I’m looking for her.” \n\n\nHe turned on his heel and hurried away.\n\n\nHarry waited until Malfoy’s footsteps had faded before he reached under the table and tugged at his cloak. Hermione’s bushy head emerged, followed by the rest of her.\n\n\n“Honestly Harry, Ancient Runes on a Sunday evening?” She crawled out and back into her chair.\n\n\n“What did you do to Malfoy? Did you love potion him?” Ron was staring incredulously at her as she primly pulled her books back out of her bag.\n\n\nHermione shot a scathing glare at Ron. ”No. What kind of person do you think I am?”\n\n\nShe sniffed. “I might as well tell you. I had rounds with him two weeks ago. He was being an utter arse as usual. I thought if I used a bit of reverse psychology on him, maybe it would make him shut up. I told him that his constant antagonism towards me probably stemmed from repressed sexual fascination.” She buried her face in her hands and snorted loudly. “I forgot about how utterly bizarre and antiquated purebloods are.”\n\n\n“Oi!” Ron said indignantly.\n\n\nHermione lifted her head, scowled, and started furiously marking up spelling errors on Harry’s essay.\n\n\n “I thought it worked. He avoided me like the plague for a week and every time he saw me his face would turn red. But then—“ her voice jumped, “when we had rounds on Thursday night, he told me that I was right and he’d written and informed his parents of his intention to formally court me so we can get married following graduation.”\n\n\n“Bloody hell.” Ron was staring at Hermione in stunned admiration. His shoulders started shaking with laughter.\n\n\n“I told him no, but apparently it’s traditional for a witch to be resistant, as a test of a wizard’s sincerity.” \n\n\nShe scoffed and began tearing Harry’s sentence structures apart. “I thought I’d put him off by seeming over-eager, so when he showed up yesterday, I acted like I was actually taking him seriously, and he snogged me!”\n\n\n“What?” Ron abruptly stopped laughing.\n\n\nHermione continued without acknowledging Ron. “I slapped him. Then he accused me of repressed sexual fascination!”\n\n\nShe added a comma so violently that it tore the parchment. She laid her quill down and curled her hands into fists, drawing a deep breath as though trying to calm herself. “So—I’m employing a strategic retreat—until I figure out what to do.”\n\n\nHarry shook his head. “Only you, Hermione.”\n\n\nRon leaned forward, his eyes suspicious. “Do you have any repressed sexual fascination with Malfoy?”\n\n“What do you want?”\nDraco quirked an eyebrow and leaned back in his chair. “Want?”\nShe scowled at him and pulled an envelope out of her bag, throwing it venomously down on his desk. The force caused the flap to open, and several pictures slid out.\nThey featured Granger’s extremely recognizable face involved in a scene that would, even conservatively, be termed an orgy.\nShe wasn’t engaged in anything illegal, but the very existence of the photos was career-ruining in a culture as fastidiously conservative as the British Ministry of Magic.\nDraco only glanced at them for a few moments before looking back up at her.\nHer cheeks were stained scarlet as she glared at him. “I assumed this envelope was from you—given that you’re the only one who continues to see the need to interfere and try to destroy everything I do.” Her voice was shaking and slightly choked. Her teeth were bared, and she looked nearly feral. “So—obviously: you. What do you want?”\nDraco leaned back and gave her a hard smile. “Now, now, Granger, think of how much weaker an opponent you’d be if I hadn’t been here all these years, going to all the trouble of bringing all your legislative loopholes and vulnerabilities to your attention.”\nHis smile grew razor-sharp, and he laced his fingers together, resting his chin on the knuckles. “I must admit I was beginning to question whether I’d ever manage to knock you low enough that you’d finally come crawling into my office. However, even Muggles know the higher the climb, the longer the fall. It just goes to show that none of us are perfect—not even you.”\nHis eyes peeled away from her, and he reached down to pick up one of the photos. He stared at it for several seconds while Granger seethed.\n“Since we’re here—alone—I have to ask,” he finally said without looking away from the photo. “What on earth possessed you to do something this idiotic?” He glanced up at her. “You’ve had your eyes on the Minister’s seat since before you graduated. You had to have known this kind of—indulgence had the potential to destroy all your dreams in a manner both permanent and spectacular.”\nHe tsked and shook his head before flashing one of the photos at her. She immediately averted her eyes.\nGranger’s cheeks were stained red but the rest of her face was steadily growing whiter and whiter.\nHer mouth worked soundlessly for a moment before she swallowed visibly. “It wasn’t my idea,” she finally said in a strained voice.\nDraco snorted. He was tempted to roll his eyes and assure her that that much abundantly obvious, but instead he waited to hear her try to explain it.\n“It was—it was—” She looked as though she were on the verge of fainting in front of him. “He—he said I treated my job like it mattered more than our relationship. That I—always based my decisions on it, rather than him. It was—it was supposed to—“ her throat bobbed, “to spice things up. I didn’t know it was going to be—like that. He promised it was very discreet.”\nDraco snorted again and glanced at the date on the back of the photo. “Anything Pucey knows about does not fall anywhere in the realm of discreet. You should have asked me,” he leered over the photo at her. “I could recommend several places that take the privacy of their clientele seriously—if this is your kind of thing.”\nHis eyes slid over her, and then flicked back to the photos on his desk.\nHer chest was heaving sharply. “What do you want, Malfoy?”\nHe cocked his head slowly to the side, laying the photo down and tracing his fingertips lightly over it. “Come now, Granger, put that oversized brain of yours to work. What do you think I want?”\nA decade earlier and she probably would have cried. Granger used to cry about things. When she was angry, or overwhelmed, or happy, or sad, she cried.\nShe appeared to have rooted out the habit at some point, although not—he noted, some of her other ones. Her fingernails had been bitten to the quick, and she stared at him with her lower lip caught between her teeth.\n“I won’t withdraw the bill,” she said after a moment. Her voice almost a whisper but nearly vibrating with determination. “I don’t care what you threaten to do with those. You can ruin me.”\nDraco snorted and rolled his eyes. “Good gracious, Granger, you still have all the subtlety of a beater bat. How exactly would forcing you to withdraw your beloved house-elf protections bill benefit me?”\n“I don’t know.” She’d begin shaking with rage. “How have any of your attempts to block my legislation benefited you? At this point I just assume you exist to try getting in my way.”\n“I didn’t say a word in opposition to the WRA,” he said, raising an eyebrow pointedly. “It was legislatively flawless. I believe I even sent you a congratulatory note on your excellent work.”\nShe looked angry enough to spit at him.\nDraco shrugged and gathered up the photos again, flipping through them slowly. He paused at one and stared at it for several seconds before turning it so she could see. “This is a lovely shot of you. You have better tits than I would have credited you with.”\nShe twitched and her jaw started trembling. “Just—tell me what you want. You have infinitely more money than I do, unless you just want to ruin me financially. Do want me to remove my name as a sponsor of the bill? Are you expecting me to withdraw from politics altogether?” The trembling appeared to have spread from her jaw into the rest of her body, she was swaying like a broken tree branch. “Just tell me what it is; I’m sick of trying to guess what you’re doing.”\nDraco looked down and slid the photos neatly back into the envelope. “As it happens, Granger…” he said her name slowly. “There are several things I’m interested in.”\nShe stared at him for a moment, and then her eyes widened and she looked as though she were on the verge of screaming or bolting.\nHe chuckled under his breath and tapped the sharp corner of the envelope on his desk. “You do have a filthy mind, even if a sex club wasn’t to your... tastes. No, despite how surprisingly lovely your tits are, I didn’t send this because I wanted a turn as well.”\nShe didn’t relax in the slightest.\nDraco leaned back and stared coolly across his desk at her. “I want you to add my name as one of the sponsors for your house-elf protections legislation, and I want you to include me on whatever your next campaign is. I want to be consulted, I want to be a co-sponsor. I want a seat at the highly exclusive little table of do-gooders, and you will be the one to get it for me and ensure that I stay there. And—“ he gave her a slow smile, “you’ll owe me favour, which I will call in someday whenever I happen to feel like it, and you will do it whatever it is that I ask.”\nHe straightened as he watched her reaction carefully. “In exchange, I will ensure that these photos never again see the light of day.”\nGranger stood frozen for several seconds. Her expression was masked but there was confusion behind the obvious strain in her eyes.\n“I won’t do anything illegal,” she said in a tight voice.\nDraco rolled his eyes. “It will be an entirely legal favour.”\n“Fine,” she finally said in a voice that only had a hint of tremour underlying it. “I want a blood oath.”\nWhen it was done, Granger gripped the vial in her hands as she backed away from him towards the door.\nDraco stepped back over to his desk and caught up the envelope, flashing her a final grin. “Did you want these as a keepsake?”\nShe shot him a look of pure loathing as she disappeared through the door.\nThe smile dropped from his face the instant she was gone. Draco slid the envelope into his robes, withdrew his wand, and cast a quick disillusionment on himself before stepping out of his office. He moved slowly in order to make as little a visual disturbance as possible.\nAt the first hallway, he turned and walked quietly down it until he stood outside an innocuous, and difficult to notice broom closet.\nHe pressed his ear to the door and listened to rapid, hyperventilating sobs for a few seconds before stepping back and pulling the envelope out of his pocket. He slid a photo up just enough to verify the date on the back once more.\nJust days before her very public breakup with Adrian Pucey.\nHe tapped the envelope against his fingers for a moment before heading up towards the Ministry floo.\n \n“Zabini.”\nBlaise cracked an eye open and found Malfoy staring down at him with an icy expression on his face.\nHe blinked, pushed off the naked witch draped over him, and sat up. He hadn’t seen Malfoy in years and hadn’t expected to wake and find him in his bedroom.\n“Why the fuck are you blackmailing Granger?”\nBlaise rubbed his eyes and gave the pretentious wanker a droll smirk. “Easy target. Easy money. Mother’s training.” He shrugged as he stood up. “How did you find out?”\nMalfoy’s lip curled. “She assumed this was from me. Did it not occur to you she’d have trouble paying you off if she didn’t even know who sent them.”\nBlaise yawned and pulled on a robe. “I fancied leaving her to stew and panic about how bad it’d be before moving in for the kill. She must be frantic if she went straight to you. It’s convenient you came by; you deal with her all the time. How much would you say she’s worth?”\nHe eyed Malfoy while he stretched his shoulders. “I’m thinking installments rather than a lump sum. She’ll probably be good for a few years at least.” His pulled a velvet cord on the wall to call for a late breakfast and coffee. “I couldn’t believe my luck when Pucey brought her through the door. I think she must have sedated herself, she went with it for less than an hour, then panicked and bolted.” He nodded towards the envelope in Malfoy’s hand. “Stayed long enough though.”\nMalfoy was staring at him expressionless. “I want to buy all of them.”\nBlaise froze as he stared at his old schoolmate.\nMalfoy was politically weaker than Granger, but financially he was a larger fish by several orders of magnitude.\nBlaise hadn’t considered seeking out a third party for the photos. Granger was beloved by nearly all, with the very notable exception of Malfoy, who had an inexplicable vested interest in attempting to subvert or fuck her over with any political machinations he could scheme up.\nHe grinned at Malfoy. “How much is finally ruining her worth to you?”\nIt turned out, it was worth more than three times Blaise’s annual income.\nMalfoy held the cheque lazily between his thumb and index finger and stared at Blaise with glittering eyes. “This sum is conditional, Zabini. I want a list of everyone there that night.”\nBlaise started to open his mouth and deny keeping records, but Malfoy leveled him with a cold glare. “I’m certain you have one. The last thing I need is to have her claiming it was polyjuice. I want to know exactly who the corroborating—participants are.”\nBlaise shrugged and retrieved it from his logbook. As he held out the list of names and extended his hand for the cheque, Malfoy held it back.\n“I also want an Unbreakable Vow. I don’t want to worry someone that else is going to fuck up my chess pieces once I have them in place. I want a Vow from you that I have all the photographs and any other evidence and that all the particulars of this little business arrangement will die with you.”\nBlaise’s throat tightened as he noticed the burning intensity in Malfoy’s eyes. The man was deranged in his vendetta against Granger. Then he looked at the figure on the cheque.\n“Fine.”\n \n \nDraco stopped at Gringotts in the evening after the day’s work. He sat silently beside the goblin as the cart raced into the depths of the bank, beyond the Malfoy family vault, to a smaller private vault.\nDraco unlocked the door, stepped inside, and closed it with the attending goblin waiting outside.\nHe pulled the file with all of Blaise’s pictures out of his robes, along with the envelope that Granger had brought him.\nHis jaw tensed as he stared at them. His hands shook slightly and the photos abruptly burst into flames.\nHe dropped them on the ground.\nHe walked over to all the boxes of mind-bogglingly detailed analysis of several hundred legislative documents. He dragged a finger along them as he wandered through to the far wall.\nA small postcard was pinned to the wall.\n“Men of sense often learn from their enemies. It is from their foes, not their friends, that cities learn the lesson of building high walls and ships of war.”\nHe stared at it for several seconds, and then sighed, and turned around. The room was burning, the fire consuming the photos had spread to the boxes.\nHe watched the fire.\nFeuding with Granger legislatively had honed her into a lethal political weapon far more rapidly than any advisor could have hoped to.\nAdvise Granger about weaknesses as a friend, and she had a habit of dismissing it and assuming the best about others; come at her as an opponent and she‘d strategise, strengthen her position, and then coldly outmanoeuvre them.\nDraco had thought she was nearly untouchable until that morning. He ground his teeth together. Her personal life would be the one area that she’d remain vulnerable.\nObliviating Pucey had been by far the most satisfying aspect of the day. Draco had thought he wasn’t a killer, but he very seriously reconsidered it when he’d had a wand leveled at Pucey’s face.\nDraco walked slowly around the burning boxes towards the door of the vault.\nHe paused by the door and stared at a newspaper clipping on the wall.\nIt had faded after nearly a decade.\n1998. Granger was standing in the witness stand, testifying on Draco’s behalf during the post-war trial. If Draco had been found guilty, he’d be up for release in three weeks.\n\nHermione Granger Wants To Save The World.\n\nHe stared at the picture and nearly reached out to touch it.\nBecoming her political rival has been accidental. She’d gone straight to the Ministry after school and begun her magical rights campaign with righteous fury and no training. Her team had been equally oblivious to political pitfalls.\nDraco had not been, but no one listened to him.\nSo—he wrote an editorial pointing out all the potential risks of Granger’s legislation until she withdrew and reworked it. Draco kept publicly harassing her until it was ironclad.\nIt became a bizarre type of political chess. He unapologetically hounded her over her political vulnerabilities and she rapidly learned to protect herself, and spot her own legislative weaknesses without him.\nDraco was tired of feuding with her.\nHe hadn’t fully appreciated that she’d see their rivalry as personal or malicious until she appeared his office. He considered there to be a vast difference between being politically at odds with someone and actually wanting to ruin their life.\nNot for Granger. For her everything she did was morally rooted.\nHe sighed as he pulled the vault door open and stepped out.\nSomeday—he should probably admit he’d fallen for her.\nOne would think, what with magic having been around for several thousand years, basic illumination wouldn’t be so hard to come by in the Wizarding world, but there wasn’t even a bit of candlelight in the service hall.\nIt was pitch black, and I realised, after my shins had collided with a fourth wooden packing crate, that my wand was in my bag in the main hall where the banquet was still going on.\nI cursed under my breath while leaning over to rub my leg. I should just go back out. It was absurd to be sneaking around like a teenager in an unlit hallway, trying to find someone who probably wasn’t even there.\nI straightened and sighed. I was about to turn back when a burnished red light glowed briefly in the darkness before disappearing.\nI swallowed and released a low breath. “Malfoy.”\nThe butt of his cigarette glowed again, longer, bright enough to illuminate his eyes.\n“Granger.”\nThe way he pronounced my name curled and wafted through the air like the smoke. I could hear the cigarette in the corner of his mouth.\nIt made his drawl more overt. More caressing.\nHe’d always liked to toy with words with that poisonous tongue of his; experimenting with the inferred meaning of a particular form of emphasis.\nWhy say what he meant when he could imply it a dozen different ways without the inconvenience of real commitment?\nLike the rest of us, he lived his post-war life on a short leash. His was the shortest but most luxurious lead that the Ministry kept constantly under its heel.\nHis constraints had caused him to make the unspoken a type of art form.\nI envied the ability as often as it annoyed me. I wished sometimes that I could keep from saying what I meant.\nI have never been coy. I am “sincere.”\n“I thought you’d quit smoking,” I finally said.\nThe cigarette glowed again.\nI made my way gingerly towards the light\n“I am exclusively a social smoker these days.” He’d pulled the fag from his mouth. His words were crisp again.\nI extended my hand, trying not to run into anything or trip over him as I kept moving towards his voice.\nA hand slipped under mine, as though he were escorting me onto a dance floor. His fingers drew me forward and downwards onto the rickety service stair he was seated on.\nThe stairs were narrow and could barely accommodate the width of both our hips. As I settled in beside him, the cigarette glowed again, just long enough to illuminate his profile.\nI watched until it faded and then glanced away. “How does this qualify as social smoking?”\nA pause. I heard him breathe.\n“You’re here.”\nHe shifted slightly so that my hip bone stopped digging into him.\n“There are about five hundred people on the other side of that wall,” he said after a moment.\nI snorted and angled myself towards him in the darkness. “The wall being imperative. You aren’t attending a party if you spend the entire time sitting in a dusty service passage smoking.”\n“Ah…” his tone was light. “But only if you’re operating with a Grangerless presupposition. I’m not. Your interference is presumed therefore my eventual appearance is inevitable. I’m smoking preemptively.”\nI folded my hands and sighed. “It will get easier—eventually.”\nHe chuckled. There were several seconds of silence before he spoke again. “You keep saying that.”\n“It’s what everyone keeps telling me.”\nI reached out, trying to find him in the darkness. My fingertips grazed his robes, and I let them trail down his arm until I found his left hand.\nI hesitated a moment before I slipped the cigarette out from between his fingers and brought it up to my lips.\nMy hands were shaking, and my throat caught nervously as I took a long, slow drag.\nI closed my eyes and exhaled heavily.\nI reached out and found his hand again, resting on his knee. I slowly laid my palm against the back of it. My fingertips traced lightly over his knuckles as I stared into the darkness.\nIt felt natural to sit there with him. It had become a habit, maybe even a tradition. I’m not entirely certain where the line of distinction is drawn between the two.\nWe fell into it over the years.\nI was the one who’d brought cigarettes the first time.\nAt some point over the years, the strange unspoken interlude between us had became the point of every event. The darkened silence and his hand under mine until my hands stopped shaking, and I could go back out to the room with the blindingly bright lights beating down and the constant camera flashes.\nBefore I left, I always said, “You should make an appearance, just for a few minutes. It’ll be noticed if you don’t.”\nHe never replied, but he’d show up just long enough to be photographed.\nThat was all that happened until the next event. \nSomehow, without exchanging a word, we always found each other in the dark.\nHe could rarely leave his manor. Visitors required Ministry approval and all applications and visits were public record, as were his correspondence and his floo calls. They called it government transparency.\nI don’t know how he’d managed to get hold of cigarettes.\nI brought my hand up to my lips and took another long drag.\nNo matter how many Ministry events I’d attended, they never felt natural. It was like re-agitating a wound and inserting needles. Every year I’m angrier and more on edge until I wonder if I might just shatter under the unrelenting spotlight.\nSmoking with Malfoy for a few minutes had become the only thing that got me through.\nMy hands were trembling less when I brought the cigarette to my lips for another drag. I caught sight of his face. He was watching me carefully.\n“That bad?”\nI shook my head, averting my eyes. “It—it was fine.”\n“You know…” his voice was hushed. He leaned closer until I could feel his chest against my shoulder. His breath stirred my hair and I could hear the smirk in his voice. “—they have potions—”\nI elbowed him away while rolling my eyes. “I can’t consume alcohol if I take Calming Draught or anti-anxiety potions. It’s like hanging a sign over my head announcing that I have ‘trauma’.” My throat tightened and my hand gripped his briefly. “Everyone’s watching out there…”\nMy hand shook again. I forced my voice to relax. “Besides—I promised someone a drink if he showed up.”\nI quickly brought the cigarette back to my lips.\nMalfoy shifted closer. His long fingers slid up to cradle the base of my skull, and he drew our faces together.\nI stiffened until I made out the unlit cigarette dangling from his mouth.\nHe touched the tip of it against mine and paused.\nI inhaled slowly and watched his narrow features illuminate. Our faces were only inches away from each other. His eyes were dark and glittering in the dim glow. \nThe reddish light caught in his pale hair.\nHis hand slid away, and he sat back, taking a quick drag.\n“You could have used your wand,” I said when my heart stopped pounding.\n“I’ve always wanted to try that. You’re the only one I know who smokes.”\n“I don’t.” I put the remains of my cigarette on the step as I lifted my heel and bore down. “Normally—I don’t.”\nHis cigarette glowed as he lit another and slipped it between my fingers without a word.\nMy right hand found him in the darkness. I ran my fingers over his knuckles lightly, tapping them as though they were an instrument, and the movement drew the darkness and quiet more tightly around us.\nAfter another minute, my hand finally stilled against his.\nHe shifted, and I could hear the sound of sloshing liquid.\n“About that drink. I brought firewhiskey—but when I was moving the boxes off this staircase, I found something new.” His voice was conspiratorial. “I believe it’s Muggle. It tastes like alcoholic pinecones.”\nI was never sure if he was being serious or just trying to amuse me when he said things like that.\nI snorted. “Gin? It’s made from Juniper berries.”\nHe was silent for a moment. “Ah. That explains it.”\nI gave a low laugh. As I was bringing my cigarette back to my lips, we were suddenly illuminated, and I could see him clearly for the first time.\nThe first time.\nWe’d always stayed in the dark. We’d smoke and drink and then I’d leave without a wand ever being lit. I didn’t know why he was suddenly changing things.\nI stared at him like a startled deer.\nHis cigarette was dangling from his lips, and his hair was tousled. He was dressed to the nines in that casual, effortless way of someone who wore their clothes rather than being worn by them. It was a distinction that I never felt as though I’d managed.\nThere was nothing about him to indicate why he was there rather than in the next room with everyone else. I’d assumed nerves or rage like me—but as I stared at him, I didn’t see any of it.\nHis eyes were glittering as he slipped his wand into my limp fingers and reached into his robes, pulling out a set of tumblers.\nHe lifted up the gin bottle beside him. “Look, it even has a hat.”\nHe deftly poured two fingers into a glass and handed it off.\nI stubbed out my cigarette and took the tumbler while he was pouring a glass for himself.\nHe smirked and toasted me with a lazy salute. “To all you war heroes, cheers to your bravery.”\nHe plucked his cigarette from the corner of his mouth and knocked back the drink, his eyes never leaving mine.\nThis wasn’t what I’d come for. The comfort of darkness was a place to loosen my armour and breathe without fearing anyone was watching to catch sight of my vulnerabilities and old scars.\nNow there was light—like sunlight beating down on an exposed nerve, and the illusion had faded away.\nI was sitting in a filthy service passage, smoking to ward off a panic attack, sitting beside someone that I hadn’t publicly spoken to in a decade.\nIn a matter of minutes, I would reappear at the celebratory banquet. I had to be seen taking measured sips of wine and consuming dessert in a manner that gave no indication of any type of eating disorder. I had to sit with my hands in my lap and laugh on cue while refraining from picking at my fingernails.\nThen I would go home and find out from the morning paper whether I was deemed stable and coping or not.\nI brought the tumbler to my lips and took a small sip.\nMalfoy studied me carefully. “You prefer firewhiskey?”\nI glanced down. “Combining alcohol with tobacco increases the risk of throat cancer.”\n“Right…”\nI took another slow sip of gin. Alcoholic pinecones. The corner of my mouth quirked. The comedic absurdity was as glaring as the light.\nI wished I’d asked for firewhiskey. I could use some courage, even false courage.\nThe solace was a mistake indulge in. I could see that now, as I sat in the wandlight.\nI set the tumbler on the steps by my feet and stood, returning his wand. “I should go back out before I’m missed.”\nHe didn’t say a word. His eyes had contracted into indolent silver.\nI inhaled slowly until my lungs ached as I stared down at him. “You should make an appearance, just for a few minutes. It’ll be noticed if you don’t.”\nHe nodded slowly. He looked so outwardly collected. There was a part of me that wanted to reach out muss him up a bit, lace my fingers into the hair at the base of his head and light a cigarette against his lips.\n“Goodbye, Malfoy.”\nI looked at him a moment longer, then turned and went back the way I’d come.\nThe wandlight vanished before I was a dozen feet away.\nI found the wall and slid my hand along it, trying to remember the location of all the crates I’d run into earlier.\nThe roar of the hall got louder when I neared the door I’d left ajar when I slipped out. The chattering. People were happy. People were mourning. At that point, almost everyone was drunk, except the reporters who stayed sober and alert in order to pick up any and all potential gossip.\nMy fingers grazed the knob, and I stood hesitating, trying to brace myself for what I was about to be re-immersed in.\nEach additional year of adulthood made me a little more enraged on behalf of myself and all the other students. We were children. Every year, I’m more staggered by how young we all were.\nHow was it ever seen as natural for us to be the ones fighting the war? That families had sent their children back to Hogwarts while the Carrows were there. That everyone kept their heads down when the  Muggle-Born Registration Act was put in place.\nAs an adult, it staggers me more, how natural it seemed at the time for the war to fall on our shoulders.\nA generation of paper war heroes.\nTypecast into our roles at Sorting and now watched daily for signs of wear and tear.\nThe majority of the Wizarding world wasn’t willing to lift a finger to fight the war, but they’re all too eager to diagnose us with trauma from the comfort of their armchairs.\nMy hands were threatening to shake again, and I clenched them into fists for a moment before I reached to open the door.\nIt was stuck. Lodged. I glanced up and saw the dim outline of a hand, pressed against it.\nMalfoy had materialised behind me. I’d barely turned before his chest pressed against mine. His hand slid down the door to my shoulder, and his fingers cradled the base of my head. There were no cigarettes between us as his face drew closer.\n“Hermione—”\nI didn’t know what it meant when he said my name like that. What inference or implication was intended.\nMy eyes widened as my breath caught in my throat. “What—?”\nHis lips brushed against mine.\nThen he waited.\nIt was an unspoken question.\nMy heart was pounding in my chest and my fingers were trembling as I reached out and drew him closer.\n \n\nHe doesn’t appear when she walks through the door. He isn’t in the library or his study either. \n\n\n“Draco?”\n\n\n“Up—here.” His voice wafts down the stairs with an indefinable quality Hermione cannot quite put her finger on. \n\n\nShe ascends the stairs slowly, wand drawn, until she comes to his room. The door is slightly ajar. \n\n\nShe hesitates for a moment. The odds currently stand evenly split. She’ll either push it open to find him waiting for her, decoratively garbed in chocolate, or discover him held at wand-point by vengeful Death Eaters. \n\n\nIt’s almost impossible to ever predict anything when it comes to Draco Malfoy. \n\n\nShe draws a deep breath and flicks her wand, swinging the door open. \n\n\nHe is not naked. \n\n\nOr held hostage. \n\n\nInstead she finds him standing casually upon a precariously small side table in the middle of the room. \n\n\n“Ah, you’re here,” he says as though his current location is normal. \n\n\nShe stares at him for several moments in silence. “What are you doing?”\n\n\nHe quirks an aristocratic eyebrow and looks down his nose at her. “I do live here, last I checked. I believe the deed for this house lists me as it’s possessor. I can stand wherever I want.”\n\n\nHermione sighs and glances around the room. “Where is it?”\n\n\n“Where’s what?”\n\n\nHermione raises an eyebrow of her own. “The spider. Where is it?”\n\n\n“What spider? There’s no spider. Is a man unable to stand on his own side table—“\n\n\nHermione rolls her eyes and casts a point-me charm, while Draco waxes eloquent on individual rights and freedom, parroting all of Hermione’s favourite talking points from the many occasions when she’s lectured him.\n\n\nThere is a cardinal spider lurking beneath the bookshelf. \n\n\n“Draco, it’s nothing,” she says as she kneels down and reaches under, gently catching it. “They’re entirely harmless.”\n\n\n“It’s enormous.” Draco sounds as though he’s being strangled to death. \n\n\nHermione stands up, and the spider scurries rapidly around her hand as she turns to face Draco again.\n\n\n“Oh fuck! Please don’t do that again. Kill it. For god’s sake, it’s a spider, you’re supposed to kill them. Why do you always have to let them climb on you?” He buries his face in his hands, and the side table wobbles dangerously. \n\n\n“I don’t always let them climb on me. This kind is harmless.” She flicks her wand, and the spider levitates through the air as she sends it out the open window and into a nearby tree. \n\n\n“All gone and nobody died.” She closes the window and looks up at him again. “Still exercising your right to stand on the side table, or will you come down now?”\n\n“My mother is speaking to me again.”\nNothing.\nHe cleared his throat. “She sent a note yesterday asking how I was.”\nHermione was still staring absent-mindedly out of the window. \n“I wrote back—and she asked if I’d come to dinner this Tuesday.”\nStill nothing. \n“I intend to decline unless she extends the invitation to you as well.”\nThe hollow at the base of her throat dipped, and she looked at him suddenly. “You should go.”\nHe stared at her. “Really?\nShe nodded. “Yes. You should go. They’re your parents.”\nHis eyebrows furrowed. “Right. They’ve also refused to speak to me since I informed them that we’re dating. Which seems like a pertinent issue.”\nShe studied at him. The tines of her fork tapped lightly at the edge of her plate. “Where—where do you see us in a year or so?”\nDraco shifted uncomfortably at the change of subject. Hermione had very specific ideas about the pace of relationships; they should progress with grave intentionality. He’d only just managed to convince her to let him have a drawer in her flat. \n“I don’t know. If it keeps going well, maybe l’ll have two drawers by then.”\nShe didn’t appear to notice the joke. She gave a short nod and looked down at the peas on her plate as her fork chased them from one side to the other. \n“Is everything alright at work?” He eyed her carefully, trying to pin down exactly what seemed off about her. She nodded without meeting his eyes. \nShe was bothered about something, but as far as he could tell, it didn’t seem directed specifically towards him. \nWas he forgetting an important date? Not her birthday. They’d been “officially” in a relationship for one month and three weeks and two days. Prior to that, they’d dated for five months and some odd days, which he didn’t think was traditionally celebrated. No major events in November for either of them insofar as he was aware. \nShe didn’t generally make him guess if he’d done something to upset her. He’d been an excellent boyfriend lately—if he did say so himself. He hadn’t even done anything to get back at Weasley for turning him into a giant canary at the excruciatingly uncomfortable ‘Weasley Dinner’ that he’d attended with Hermione last Friday evening.\nShe was still chasing her peas around her plate. \n“What’s wrong?”\nHer fork stilled, but she didn’t look at him immediately. The tip of her tongue darted out, and she wetted her lips before looking up. \n“I—“ she started, then she froze, her mouth still ajar. She swallowed and set her fork down before squaring her shoulders. \nShe was going to break up with him, he realised with shriveling horror. \nNo wonder she thought he should go have dinner with his parents. \nShe didn’t want him anymore. He had too much to make up for, and their relationship was interfering with and creating too many difficulties throughout her life. \nHe felt his throat close as the blood drained from his head. \n“I’m—pregnant.”\n“What?” The question escaped him before he’d even processed that he was forming words. He felt as though he’d been bracing himself to be stabbed in the heart then instead been clocked in the head. His entire mind came to a screeching halt. “What?”\n“I’m pregnant.” Her brown eyes met his bewildered gaze for a moment before she looked back down at her plate. “I found out earlier today.” \nDraco abruptly had approximately five hundred thousand questions.\nPregnant? How was she pregnant? She was definitely, borderline religiously, taking contraceptive potions. \nDraco had never thought about fatherhood beyond the abstract conclusion that he was not planning to be interested in it for a good long time. \nHermione was pregnant. \nHe stared at her dazedly.  “H-h-How?” \nHermione pressed her lips together. “Contraceptive potion has an efficacy of about ninety-nine point two percent. Which means there’s still a point eight percent chance of getting pregnant. So if there are a hundred witches using it for a year, there can still be the possibility of a pregnancy occurring.”\n“And that’s you…” he said slowly. \nHer nostrils flared as she inhaled. “That’s me.” The base of her throat dipped and she looked down at her lap and was silent for several seconds. “I don’t know what I’m going to do yet. They gave me a prescription for a potion.”\nDraco swallowed and resisted the urge to reach out and drain his wine glass. Despite his daze, he had a very clear sense that he’d never be able to take back whatever he said next.\nAs petrified as he was at the very concept of fatherhood, he was even more terrified that he was going to misstep and break the very fragile trust he had managed to build between them.  \nHe opened his mouth and then closed it again. He wanted to loosen his collar, but her eyes were wide and locked on him. She sat carefully watching him. \nShe reminded him of a frightened wild rabbit. When he was growing up, there had been hundreds of them on the estate. They’d freeze and watch him with their dark eyes, barely moving, ready to sprint away and vanish in an instant if threatened.\nHe inhaled and leaned forward, extending his hand. Her hands were in her lap, so he rested his fingers on the table near her. \nHer dark, intelligent eyes grew wider as they darted between his hand and his face. \nHe exhaled slowly. \nHe’d already been done for long before he’d managed to get her to agree to even have a drink with him. Just a drink had required weeks of deliberation on her part. \nShe’d had a very long list of rules and requirements specifically engineered to keep their relationship’s progress slow, and it had worked aggravatingly well during the initial few months. \nThings had accelerated somewhat when they’d agreed to tell people that they were in a relationship. Draco’s parents had been incensed, and his father had threatened to disown him. The Weasleys and Potter has been about as pleased as one would expect and were unveiled in their displeasure and skepticism. \nThe first month had not been pleasant. However, the upside of Hermione refusing to speak to Potter and Weasley for being “complete idiots” and Draco openly toeing the line of becoming a blood traitor and following in the footsteps of his aunt Andromeda, was that their social life was largely non-existent. \nWhich—now as he thought about it, probably had something to do with the situation at hand. \n“What are you thinking of doing?” he asked. \nShe sucked her lower lip into her mouth, and he could see the tips of her teeth gnawing at it. \nShe always had a plan for things. Post-war, the life of Hermione Granger was meticulously plotted out. \nHer colour-coded calendar had evenings marked for company, for projects, for reading. They were currently having lunch on the one lunch break each week that she was available to have lunch with him. She volunteered during three out of her five of them, and another day was marked and reserved for maintaining collegial relationships with friends and coworkers. \nShe had a one year plan, a five year plan, a ten year plan. Possibly others. \nShe always knew exactly what to do. \n“I don’t know. I feel like I should just know what I should do—but I don’t—“ She drew a sharp breath. “We—“ her voice wavered and faded. \nThe corners of her mouth twitched, and her eyes moved away from his face. She was quiet for a moment. He watched her shoulders tense, and her whole body appeared to contract. \nShe was going to keep the pregnancy. He was almost positive. She wouldn’t have been so uncertain if she was instinctively leaning towards termination. She probably would have already picked up the potion. \nShe was going to keep it, and she knew that the choice would annihilate half her plans and most of her calendar, and obliterate her intention of having their relationship indefinitely progress at the temperate speed of a sloth. \nHer fingertips appeared at the edge of the table and slowly turned white as she gripped it.\n“I don’t know what I’m going to do yet—but—“she swallowed visibly, and her voice become tight and businesslike,”—obviously this wasn’t in either of our plans. Our relationship is very new, and we don’t have any idea of what could have happened in the long run if things hadn’t been derailed like this. I wanted you to know about the pregnancy, but I don’t expect or want you to think that this makes you obligated or committed in any way.”\nDraco’s hand twitched. “What?”\nHer eyes flashed with stubborn determination. “I’m perfectly capable of having a child on my own—if I decide to. I don’t want you—staying involved with me because you have some antiquated sense of obligation and believe that you have to make honest witch of me now. I just—“ her voice wobbled as she inhaled, “I would rather know right off if you don’t want to be involved—it would—be easier for me if we could conclude things amicably in that case.”\nDraco stood up abruptly, walked around the table, and then stole a chair from a nearby table. He sat and took her by the shoulders, turning her so that he could look into her eyes. \n“Hermione—“ he said, his hands running down her tense arms. \n“Hermione…” he said again, his hands reaching up and shaking somewhat as he captured her face. His fingertips traced her cheekbones and along her jaw.\n“Hermione, I am in love with you,” he finally said. “I was in love with you before anyone knew we were dating. I was in love with you before we slept together. I was already pretty nearly in love with you before you agreed to get a drink with me. If you keep this pregnancy, I will still be in love with you. Whatever you do—for the rest of your life—I’m in for. Wherever you are—and whatever you’re doing, that’s the only place I want to be. Alright?”\nTabula rasa. Those are the terms. \nGet out of Azkaban, work at her insipid house-elf charity for a year, and pretend they’ve never met before. \nIt’s weird, but anything is better than sitting in Azkaban for a second year. \nIt’s like a fresh start. \nThe concept is tantalising.\nHe refrains from rolling his eyes as he agrees to the terms. “I’d love to act like I’ve never seen her before.”\n“The terms will be magically binding. Violate them, and you will return to fill the additional year of your sentence,” the weevil-faced lawyer says. \nDraco glances at his mother who sits eagerly beside him and is nodding her encouragement. \n“Fine. I’m legally bound act like I don’t know her. Sounds ideal. Where do I sign?”\nHe doesn’t know why the clause even exists in the agreement. Three weeks on the job and he hasn’t even laid eyes on her. \nThe day he arrives, he’s shuffled off into a cramped office in the basement, and, after they try giving him a variety of different tasks, he ends up being assigned to write thank you letters. \nIt’s his entire job. \nExcellent penmanship is apparently the only usable skill that he possesses. \nHe assumes at first that it will be easy. He’ll come in late, leave early, and spend a matter of minutes charming a couple dozen notes tops. \n“Dear Bootlicker, Thank you terribly much for your generous donation of 500 galleons. I’m thrilled there was literally nothing else you could conceive of to do with your money. It will assuredly be used by yours truly to improve the lives of the sentient abominations called house-elves. Sincerely, love and kisses, the Wizarding world’s favourite buck-toothed harridan, Hermione Granger.”\nNo. It’s not easy. Granger has elaborate requirements for all the thank you letters that she doesn’t even bother to personally write. \nHe has to go through the society papers and Granger’s detailed personal calendar to make references to the donor’s last meeting with her. He’s expected to ask about children and grandchildren by name and discuss the inner-workings of the charity as well as to relate anecdotes about all the sad little elves the donor’s money saves. \nWithin a few weeks, he’s maintaining a full-fledged correspondence between the most bizarre assortment of Wizarding folk, a centaur, two vampires, and an alleged forest troll. A correspondence that he is maintaining as Granger, whom he hasn’t laid eyes on in years. \nSupposedly she looks over all his letters before signing them and sending them off, but Draco doubts it. After weeks there, he still hasn’t so much as caught sight of her bushy head. \nHe torn between a sense of outrage and admiration over what a slick ship she runs. Poor dear little Hermione, the Wizarding world’s darling, has an entire legion of Yes-men at her beck and call, doing all the work she’s allegedly achieving with her chipper can-do attitude. \nHe doesn’t think she even shows up in her office most days. If she does, she never slips so much as a toe past the fourth floor where her office sits. \nGranger has a matronly personal assistant the size of a mountain named Charlotte. The woman is like the female version of Crabbe and Goyle simultaneously. Draco is convinced she must be at least a quarter troll. She glares at Draco whenever “passing on messages” and makes clear to Draco that she’d gladly snap his spine if Granger ever gave her the go-ahead. \nDraco accepts his “job” with his head down. He just has to endure it a year and then he’s free. Maybe once he’s not at risk of returning to Azkaban, he can expose what a fraud Granger and her charity are. \nHe finally sees Granger after two months.\nShe’s walking by with her assistant when he’s standing in the hallway, taking a break from his cramped office’s inadequate air flow. \nGranger catches sight of him all the way down the hallway and without hesitating, bolts down the hallway to him. \n“Hi, I’m so sorry. You’ve been here for over a month, and I haven’t said hi.” She’s beaming at him as she takes hold of his hand and shakes enthusiastically. Her assistant comes thundering down the hall after her. “I’ve been admiring your penmanship for weeks. I’m Hermione Granger, and you must be Draco Malfoy. I’m so pleased we could have you on the team here.”\nDraco stared at her blankly while she pumps his hand up and down. \nTabula rasa. \nEveryone at the charity knows who he is, even though they make a show of not. There are loud comments about the kinds of people who would become Death Eaters. The receptionist pretends to be unable to recall his name or that he has a job there. Draco is obliged to go through the full sign-in process every morning as though he’s a visitor. \nHowever, Granger has no idea who he is. It’s not an act. There is not even a flicker of recognition in her eyes as she grins up at him. \nHe’s imagined their fake “meeting” a dozen different ways, but this iteration isn’t one that’s ever occurred to him. \n“Granger,” he says as she continues wringing his hand. Charlotte is ten feet away, her footsteps shaking the hall, and her eyes are threatening a slow and painful death. “It’s been a—pleasure?”\n“Miss Granger, you have a meeting with Gibbling to review charity finances in five minutes,” Charlotte says as she reaches Granger, trying to tear her away from Draco.\n“I do?” Granger’s hand slips out of Draco’s, and she looks chastened, as though she’s been slapped. “I didn’t remember—“\n“I apologise, ma’am,” the assistant says smoothly, inserting herself between Granger and Draco. “It slipped my mind, I only just remembered he sent a note this morning. I’m sure it will only take a few minutes.”\nGranger is craning her neck to look back at Draco as she’s being herded away. She side-steps her assistant and cuts back. \n“It was nice meeting you, Draco. I’m having a little party at my flat this Saturday with some of my friends. Would you want to come by? It’s the least I can do after being so rude.”\n“I…” Draco glances back and forth between Granger’s hopeful face and the venomous expression of Charlotte behind her, who is shaking her head warningly. “—don’t think I can make it?”\n“Oh. Well, I’m sure we’ll see each other again.”\nDraco watches Granger trot off with her assistant in tow feeling incredibly confused about what’s going on. \nHe feels like if anyone were going to tell him, they would have already done so. He’s legally bound to play along with whatever this ridiculous farce is. \nHis mother has to know, but her lips are apparently sealed on the matter. \n“You’re out of Azkaban, darling. Focus on that and leave everything else alone.”\nHe wants to, but he can’t help but try to figure it out. Why doesn’t Granger remember him? It feels like he’s been personally and exclusively excised from her life, and he hasn’t the foggiest idea why he was the only one singled out. \nGranger still knows his mother. She's still an active participant post-war rebuilding and gives speeches from time to time about things like the Battle of Hogwarts. \nShe isn’t the type to fuck with her memory based on anything and everything Draco knows about her. If she were, he doesn’t know why she’d choose to forget him. And if she did choose to forget him, he doesn’t know why her weird melange of employees and friends would let her hire him. \nIt feels personal, and he can’t bring himself to leave it alone. Is there anything else she doesn’t remember? \nWhen he isn’t ghost-writing her correspondence, he starts going through the newspapers and her old calendars trying to pinpoint exactly when Granger may have forgotten his existence.\nHe thinks it happened about six months after he was imprisoned in Azkaban following the war. Granger’s exhaustively detailed calendars start immediately after that, and her public appearances were sporadic and odd up until then.\nHe starts hanging around in hallways when he thinks he might run into her. Her assistant is always a few steps behind her, glaring at Draco as though she knows why he’s there and inventing meetings and events in order to get Granger away from him. \nHe’s been there four months and has barely spoken to her for more than ten minutes in the entire time. \nHe’s in the middle of writing a sarcastically cordial letter to Romanian vampire when his office door cracks open and Granger sneaks into his office. \nHe looks at her as she drops into the chair across from his desk and lets out a heavy sigh of relief. \nDraco eyes the door, waiting for Charlotte to burst in like a raging erumpant. \nGranger notices where his gaze is directed. “Don’t worry. I sent Lotte on an errand. We have at least fifteen minutes before she comes looking for me.”\nDraco looks back to Granger. He doesn’t know what to make of her. \nThis version of Granger is weirdly cheerful, like all her prickly defensiveness has been smoothed away. She still looks frightful, as though she suffers a phobia of hair potion, she’s still bizarre and obsessed with things like saving house-elves and everything else in the world. But he feels like she’s an entirely different person around him.\nMaybe he’d just never known her without her claws out. \nGranger shifts and looks slightly uncomfortable. “She’s very protective of me. I—I lose track of things sometimes.”\nDraco just nods, not really sure how anyone who keeps records of their daily activities as exhaustively as Granger does could possibly be accused of losing track of things. \nShe glances around his office. “Why on earth did they put you in here? This room looks like a storage closet.”\nDraco refrains from telling her that it literally is a storage closet and the absolute furthest room from her office. He measured one day, just to confirm it to himself.\n“I’m not picky,” he lies. “It’s more comfortable than Azkaban.”\nHer mouth purses. “That’s hardly a commendation. I’ll have you moved upstairs. I’m sure we still have a few extra offices. Somewhere with a window and plants! My friend, Neville, is a genius with plants. Once we’ve moved you, I can get a few.”\nShe pokes around in his office for a few more minutes, interrogating him about how he likes his job and how his “co-workers” are treating him. Draco lies his way through her questioning until she stands up looking at him thoughtfully. \nThe next day, Charlotte appears looking enraged while he’s at the front desk filling out the visitor sheet for the hundredth time. \n“Miss Granger wants your office moved to the fourth floor,” she says, looking as though someone has force-fed her a lemon.\nDraco’s new office is two doors down from Granger’s. He has an entire wall of windows. \nGranger pops in relentlessly, bringing him plants and knitted tea-cosy, and “Lotte” looks more and more as though she wants to throttle him. \nGranger takes to sneaking into his office whenever Lotte is out running errands. Which seems to occur suspiciously often.\nDraco is certain that Granger’s aware that there is something odd going on. Her eyes are sly and calculating. She knows she’s being “handled”, and that it involves endless attempts by all her employees to keep her as far away from Draco as possible, which makes her obstinately seek him out all the more.\nAt first Draco tries to ignore her, but she is his boss. He feels obligated to talk to her whenever she shows up. \nEventually they talk about all the letters he’s writing on her behalf. She looks down at her lap and spends several seconds straightening her skirt. \n“You must think it’s odd that I don’t keep up with the donors personally,” she says, looking up at him. \n“Not at all,” he lies. “I’m sure it’s common for charities of this size. I’m happy my handwriting can be of some use.”\n“I used to—“ she says, her voice somewhat halting. “But—“ her head jerks slightly, “my—my memory can be rather—that’s why I keep so many notes in my calendars, to keep track.”\n \nHer expression is visibly strained, her beaming effusiveness gone. \n“You’re a very busy person,” he says, eyeing her carefully. \nShe gives a stiff little nod and her eyebrows furrow. “I think—I used to remember things better. Now, if I don’t have someone to remind me about things… sometimes”—her head jerks—“I forget details.”\n“It’s probably just stress.”\n“Maybe,” she sounds unconvinced. \nShe has all the traditional symptoms of someone who’s been extensively and powerfully obliviated. Absent-mindedness. She’s chronically forgetful, Draco realises over time. \nCharlotte does invent appointments to get Granger away from Draco, but almost as many reminders are for real events that Hermione forgets she’s headed to. On several occasions, Draco finds her standing alone in the hallway, trying to remember which door is her office. \nShe’s still smart. Still blisteringly smart, but it’s like watching a bird with its pinions clipped. It’s clear she’s intended to be airborne, but someone has hobbled her. \nIt’s painful to witness, and it’s made worse by the fact that she’s clearly aware of it. \nThe memory loss somehow seems to centre around Draco, which he cannot understand. If someone malicious were to go and wipe something from her memory, her best friend’s school rival is not the person Draco would pick. \nObliviation is self-protective. The mind will not consider the idea of tampering or let her realise her memories are incomplete. Whenever a conversation strays anywhere near their shared past, her attention abruptly, almost violently pivots to a different topic.\nHowever, despite how obstinately her memory keeps her from suspecting any past acquaintance with Draco, she can’t seem to stay away from him. As though she can instinctively tell he’s a missing piece.\nOne day she tells him about a potion idea she has, and it’s almost brilliant except she’s clearly forgotten a brewing idiosyncrasy of a key ingredient. She realises she’s missed something and just comes to a rambling halt in the middle of her explanation, a drawn, embarrassed expression sweeping across her face. \n“Never mind. I think—I should...maybe it will work out if I write it down—“ she looks down and her cheeks are stained scarlet. \n“Sting slime needs to simmer for six hours uncovered,” he says. “Unless you want the potion to result in weightlessness.”\nShe stares at him for a moment and then her face breaks into a smile. “Yes! Six hours of simmering. That’s when you leave it under the full moon and gather fresh asphodel.” She sighs with relief and presses a hand against her head. “That’s what I was missing. I thought—thank you, Draco. I thought—I thought maybe I’d gotten it all wrong again.”\nHer exuberance causes Draco’s entire body to grow warm and a weird bubbling sensation in his stomach. \nHe avoids her eyes. “I haven’t brewed much since leaving prison, but everything else sounded correct. If you want to send it on to a potions journal, I can look it over if you ever write it all out.”\nHer eyes are shining, and she beams at him. “That would be so helpful. My friends didn’t really care much for potions class. I’m so glad I found you.”\nShe skips slightly as she leaves his office which causes his entire face to twitch repeatedly as he witnesses it. \nGranger spends increasing amounts of time in his office, and Draco doesn’t—well, he doesn’t exactly mind. \nShe’s infinitely better company than dementors, he tells himself.\nShe incredibly interested in him, in a way that he has no idea how to handle. She wants to know what he’ll do once his contract with the charity is over, and he finds himself trying to come up with ideas to share with her that don’t don’t merely involve him indolently frittering away his time on his family’s properties.\nIt isn’t as though he’s not allowed to be friends with her. The terms of his contract simply require him to give no indication of any prior acquaintance with her. \nThey can be friends, he tells himself when she invites herself into his office to have lunch with him. \nGood friends even, he reasons, when she invites him to her flat for dinner one evening.\nThere’s nothing in the contract that restricts them from being more than friends. He’s certain of it. He’s checked and rechecked. \nHermione is perched on the arm of his desk chair.\nTheir faces are getting slowly closer and closer until he can feel her nervous breathing. She has the most beautiful eyes. Her hair falls forward as his nose brushes against her. \nHis hand ventures up until his fingertips trace along her cheek. \nShe smiles. Her eyes smile and the corner of her mouth curves faintly up as she dips her head lower. \nTheir lips are almost touching when the door bursts open and Charlotte storms across the room. \n“Miss Granger is supposed to be at a board meeting,” she says as she rushes Hermione away. \nDraco has barely gotten his heart rate back down to a steady pace when Charlotte returns in a state of seething rage. She grips him by the robes and physically drags him from the building.\n“You’re contagiously ill. Bed-ridden. I don’t want to see you set foot in this building for a month,” she says, glowering at him. “Stay away from her, you Death Eater bastard.” \nDraco goes home sulkily. His mother is in France visiting a cousin and he has nothing to do but lie about indolently drinking. \nThe attempted separation goes as well as Draco expects. Charlotte may be obsessively loyal to Hermione, but she clearly didn’t think through what sending Draco home sick would result in. \nHermione shows up at Malfoy Manor through the floo after three days. Draco has to bolt through the manor and dives into bed mere seconds before she comes trotting into his bedroom, carrying a basket packed with soup and potions. \nShe fusses over him for several minutes while he lies and pretends to be languishing. Finally she sits down, looking endearingly awkward, and starts updating him on the various going ons at the charity. \nAs the minutes tick by, Draco can’t help but develop a sense of unease. There’s something off about her.\nHer eyes begin darting around. She speaks faster and faster.  Her hand rises up and touches her throat before twitching up to her temple. Her head jerks. \nIt finally dawns on Draco why she doesn’t remember him. \nShe breaks off mid-sentence, her eyes darting around wildly.\n“Draco—have I—have I—been here before?” \nDraco sits up instantly and reaches for her, trying to keep his voice steady. “Hermione. Hermione, look at me. Focus on me. You were telling me about the elves that came to you yesterday. Don’t look around. Focus on the elves. Let's get you back to the office. I’m feeling better. Let’s get out of here.”\nShe doesn’t seem to hear him. \nShe glances up and catches sight of the chandelier hanging from the ceiling. A whimpering gasp escapes her, and she falls backwards off her chair. \nDraco lunges, but she stumbles to her feet and skitters away from him. \nHer head starts jerking violently. \n“We didn’t! We didn’t—“ \nHer voice breaks off with a sob.\nHer face is turning white, and her eyes lock on his. Her voice drops into a ragged, pleading whisper that pulls up memories that Draco has tried to bury in depths of his mind. “Please… Malfoy... Malfoy…please—” \nHer head jerks. “We didn’t! We found it—” \nShe starts screaming at the top of her lungs.\nIt’s one endless scream that vibrates and tears the air apart. Draco doesn’t know what to do. Hermione keeps screaming until her whole body starts shaking violently. \nHer voice abruptly cuts off, and she drops to the ground. \nDraco has to leap to catch her. \nHe’s shaking with panic and seething with rage as he carries her downstairs and through the floo to St Mungo’s. \nHe nearly decks Potter when he and Weasley come bolting down the hallway into the Janus Thickey Ward. \nDraco wants to murder them both. “You couldn’t have bothered to explain that the reason she doesn’t remember me is because you obliviated her entire memory of Malfoy Manor?”\nThey just shove him out of the way as they rush into her room and leave him waiting outside.\nPotter is the first one to re-emerge, more than an hour later. He stands staring at Draco for a minute. “She’ll—she should be fine,” he says in a dull voice. “The mind-healers will just have to reseal the memories.”\nDraco glares at him. He’s still shaking. He doesn’t think he’s stopped shaking the entire time. “Why didn’t anyone just tell me why she didn’t remember me? Why the fuck did you obliviate her at all? Do know what you’ve done to her mind?” \nPotter’s expression turns deadly. “Do I know what I’ve done to her? Why do you think it happened, Malfoy? Did it never cross your mind that there might be long term consequences for telling your insane aunt that Hermione was Muggle-born.” \nPotter’s face starts turning white with rage. “If you want to know whose fault this is—try looking in a fucking mirror.”\nDraco stares at Potter in blank horror. \n“Did you think people just get over torture? Since the war, St Mungo’s has discovered there’s an entire spectrum of brain damage that the cruciatus can cause, prior to reaching the point of insanity. Your aunt didn’t torture Hermione to insanity, but just—barely. We thought she was fine. The first couple months afterward—she seemed fine. She started having neurological issues a few months after the war. When she got them checked here at St Mungo’s, they found out the cruciatus had fried parts of her brain. That’s—apparently that’s how it works.” \nPotter pulls off his glasses and wipes them. He refuses to look at Draco. “The only way they could contain it was by walling off the damage with magic, by using targeted obliviation. So—that’s what we did. It was just coincidental that she forgot entirely about you. I guess, for her, you were just as much a part of it as your Aunt.”\nDraco stares at Potter and doesn’t know what emotions he’s experiencing. A lot. An entire maelstrom. More emotions than he knew he had. More than he ever wanted to feel.\n“Why—Why did you let her hire me?” he finally forces himself to ask. \nPotter’s face hardens. “That—was your mum’s meddling. Your release was conditional on your ability to secure a job. To the surprise of no one, no one wanted to hire you.” He scoffs and looks down, his voice becomes mocking. “She’ll do anything to protect her son. She’d heard Hermione didn’t remember you, so she went to her with a whole sob story about her poor son who’d been forced to take the Dark Mark before he was an adult and now he was rotting in Azkaban because no one would give him a chance.” \nPotter stares bitterly at him. “Hermione can never say no to a lost cause.” He gives an empty laugh. “We couldn’t explain to her why she shouldn’t without endangering her. We thought if you and your mother were both magically gagged, and Hermione was kept away from you, that it would be doable. But of course she noticed how lonely you were and decided to take you under her wing.”\nPotter exhales slowly and swallows. “Stay away from her, Malfoy.” His voice wobbles slightly. “The healers say you and your house are her main triggers. If you hang around her, she will inevitably relapse again. Every time they have to re-obliviate her, it’s going to carve away a little more of her mind and memories. If there’s even a shred of anything decent about you, stay away from her.”\nDraco manages to nod once before turning and walking unsteadily away. \nWhen he’s home, he floo-calls his mother and yells at her until his throat gives out. \nHe packs a bag and gets a cheap room in Diagon Alley. It smells and there’s noise from the bar below, but it’s not screaming. There are no chandeliers. \nHe returns to “work” after a month and is informed that his office has been moved back into the basement. He doesn’t even blink at the news. \nHe resumes corresponding with Hermione’s growing donor list. \nHe doesn’t see her again. \nCharlotte no longer bothers with passing on messages personally in order to communicate her utter loathing of him. She doesn’t ever leave Hermione’s side.\nDraco only has to work at the charity for two more months. He puts up a calendar and X’s off each day. \nHe’s walking back from his lunch break two weeks later when he catches sight of Hermione’s bushy hair all the way down the hall. He ducks quickly into a nearby closet and waits until he’s certain she’s gone. \nHe nearly crashes into her as he steps back out. \nHer eyes are bright and she’s slightly breathless from running. Charlotte is thundering down the hall after her. \nHermione beams up at him as she sticks out her hand. “Hi! Hi, I’m so so sorry. You’ve been here for months and I haven’t even said hello. I’m Hermione Granger, and you must be Draco Malfoy. I’m so pleased we could have you on the team here.”\nDraco stares down at her. \nThere is not even a flicker of recognition in her eyes as she smiles up at him. \nHis throat tightens until it's like being strangled to death. His heart is beating itself to death inside his chest. \nA second year in Azkaban would have been infinitely less painful than this. \nHe sneers down at the proffered hand. “If you don’t mind, I just washed my hands. I don’t want filth like you sliming them up.”\n \n“Have I ever told you about your eyes?”\nThere was a long sigh.\n“Yes. Several times now.”\n“They’re so brown… Chocolate with honey. Pure amber in the sunlight. They light up as though they have stars in them when you’re happy.” Draco gave a long deep sigh. “I love them. Adore them, really. I would kill a man for your eyes.”\n“Yes. You mentioned that earlier when I came to get you from the bar.”\n“And your hair—“ he caught hold of a lamp post with one hand and proceeded to swing around and around it. “I used to think it was hideous. Like a doxy nest. Sometimes”—his voice dropped into a stage whisper so loud it bounced off the buildings—“I think it’s sentient.”\nHe twirled around the lamp post again before straightening unsteadily.\n“But your hair has grown on me too. Pucey made a comment about it last week, and I hexed that bastard so hard his descendants will have boils.” He sneered for a moment before his expression transformed into a smug smile.\n“Teach that fucking tosser to say a word about my girlfriend.” He gave a deep bow from the waist and nearly face-planted into the pavement.\nHermione caught him by his scarf and straightened him, gripping him by the waist.\n“Yes. I’m sure you felt very chivalrous.” Her voice was dry.\nHe nodded heavily, wrapping his arm tightly around her shoulders and drawing himself up. “I am a gentleman.”\nThere was a pause.\n“I try—to be a gentleman.” His voice wobbled.\nShe looked up sharply and found him staring down at her, his eyes were large and luminous, and beginning to swim. His jaw was trembling.\n“God—Granger—“ his voice cracked, “I’m so sorry for everything I did at school—how I treated you—I know you’ll probably never be able to forgive me—“\nShe cut him off abruptly. “What do you think of my ears?”\nHe blinked, looking confused and sidetracked. “Your—ears?”\n“Yes. What do you think of them?” She walked him rapidly down the street while speaking. “I wonder if maybe they’re a bit too big.”\n“No! Your ears are perfect. Like—little pink seashells. But…” his voice was loudly conspiratorial, “my favourite thing about you,” he was getting louder with every word as they turned the corner, “despite how much I love your eyes and ears, are the little noises you make when I lick your cu—“\nShe clamped her hand firmly over his mouth and held it there until his jaw stopped moving. She glared at him as she pulled her hand away.\n“Will you keep quiet, you imbecile?” Her face was visibly scarlet even in the moonlight.\n“Rude,” he muttered under his breath. “Rude. Rude.”\nHe pulled away from her sulkily, walking over to a wall and proceeding to slide down it and sit on the damp pavement, his eyes closing.\nHermione groaned and shook him, trying to pull him to his feet. “No, no, no stay with me. Don’t close your eyes.“\n“Leave me alone, witch. I’m taken,” he said. His voice was deeply slurred and he slumped down further.\nHermione started to reach into her jacket but paused and glanced over her shoulder. A matronly woman was peering disapprovingly at them through the curtains of her house. Hermione withdrew her hand with a sigh.\n“Come on.” She grunted and nearly fell backwards as she dragged him up off the ground.\nHis head lolled forward and he leaned heavily against her, nearly folding her over as she stumbled down the street past three more townhouses and then laboriously dragged him up the steps to the front door.\n“Here we are.” Her voice was breathless as she dug out a key and they fell through the doorway.\nShe lay panting for several seconds and then rolled him out of the way and kicked the door closed before drawing her wand. She flicked it and carefully levitated his limp body up the stairs and into the bedroom. Pulling back the comforter, she dropped him down onto the bed, pulled off his shoes, slipped his tie off, and tucked him carefully in.\nShe went to the bathroom to brush her teeth and change into pyjamas before crawling in beside him, curling up against his shoulder. His arm immediately shifted and wrapped around her.\nShe lifted her head, resting her hand on his chest as she kissed him chastely on the lips.\nDraco’s eyes instantly popped open and he withdrew his arm with a jerk, nearly toppling off the bed.\nHermione sat up and watched as he quickly sat up, snatching up his pillow and holding it against his chest as he stood. He glanced around the bedroom and hurried over to the rug on the far side. He looked up and down the floor and finally dropped the pillow in one corner and proceeded to lie down there, bunching the pillow under his head and closing his eyes.\nHermione stared at him for several seconds before finally speaking. “Draco… what are you doing? Come back to bed. Aren’t you going to sleep with me?”\nHis eyes opened and he looked at her blearily from across the room. He shook his head so firmly his shoulders swung with each movement. “No. I’m sure you’re a very nice person, but I have a girlfriend. I’m not fucking it up. Not for anyone.”\nHe closed his eyes again and went to sleep.\n\n  \n\nThe bed shifted and Hermione felt Draco jerk awake, his arm tightening around her waist for an instant before he froze and relaxed. He buried his face in her hair, pulling her closer.\nThere was a pause, and she thought he might stay, but after a minute his hand slid away, and she felt the bed shift when he got up silently and vanished from the room.\nShe was still awake when the room grew slightly colder and he reappeared half an hour later, slipping carefully back into bed. She turned her head and he froze, his silver eyes staring guiltily at her.\n“Did I wake you?”\nShe shook her head as she rolled over, pulling him back under to bedding and burrowing against his chest. The porcelain of his prosthetic was almost ice-cold from the night air. She breathed in against his robes. He smelled like the forest and the sea.\nNo Dark Magic.\n“Are we safe?” she asked.\nHe pulled her possessively closer, his arms entwining around her back, and her head tucked under his chin. “We’re safe.”\nThere was a pause.\n“I just wanted to check.” His voice was subdued.\nShe nodded against his chest and wrapped her arms around him, breathing slowly. “We’re safe.”\nShe tilted her head back and rested her fingertips on his face. The silver of his eyes caught the dim light of their room as he looked at her. His skin was cool to touch, it had probably been freezing to apparate around the island to check the wards.\nShe pressed her palm against his cheek to warm him and shifted up, closing her eyes as her lips met his. She kissed him slowly, and then once more as her fingers ran through his hair.\n“We’re safe,” she said again, her mouth brushing against his. Then she pulled him closer still.\n“I still think about you when I can’t sleep,” Draco said, staring wistfully at Hermione’s slender back as she pointedly ignored him, digging further into a drawer of files in the dusty records room where he’d risked approaching her.\n\nShe froze for several seconds before turning her head enough to glare over her shoulder at him. Her face was screwed up with disgust. “Ew.”\n\n\nHe stared at her blankly for a moment before choking.\n\n\n“No! Not like that. I mean—“ he felt heat staining his cheeks “—maybe sometimes like that—“\n\n\nShe rolled her eyes and turned back to the filing cabinet.\n\n\n“I mean—I think about you. About the things we used to talk about. When you took me to the Muggle museums, going ice skating, visiting the aquarium, that cramped bookshop in Paris…”\n\n\nShe turned sharply, her arms full of files. Her face expressed a deep, arctic loathing that chilled him to his bones. “Yes. It was fun, our secret relationship that you were so careful to restrict to Muggle world where no one would see us. I’m glad to hear you enjoyed it so much.”\n\n\nShe marched past him, her sensible oxford heels clicking sharply with each step.\n\n\nHis stomach clenched despairingly as he turned and trailed after her. “It wasn’t like that, Hermione.”\n\n\n“It was exactly like that,” she said, her voice acidic.\n\n\n“It wasn’t.”\n\n\nShe stopped and stared at him, her eyes burning and dangerous. “Do you think I’m stupid, Draco?” She raised an eyebrow. “We’ve known each other for what, sixteen years? At any point during that time have I given you reason to believe my judgement is impaired and my sense of reason questionable?”\n\n\nShe stepped towards him, and Draco’s heart rate shot up until the blood was roaring in his ears. She was right there, close enough to touch for the first time in weeks.\n\n\n“Please tell me.” She flashed an insincere smile. “I really want to know.”\n\n\nDraco swallowed thickly and decided it was a good day to die. “Well, there was one time.”\n\n\nHermione’s expression grew murderous.\n\n\nHe raised his eyebrows. “You dated an ex-felon for several months and didn’t seem to think it was going to have any repercussions on your Ministry career if people knew.”\n\n\nShe stared at him, her face turning white.\n\n\n“Don’t. You. Dare!” Her voice was forceful and enraged. “Don’t you dare try to pretend you were doing it for me. I didn’t ask you to protect me. I don’t need anyone to protect me. I didn’t want to hide it! Don’t you dare try to twist it and pretend you were doing it as a favour to me.” Her chest jerked as though she were fighting back tears.\n\n\n“I swear to god, that’s why.” He reached towards her, and she recoiled, evading his touch.\n\n\nHer eyes were swimming, but her expression was venomous. “Right, now you’re here to lure me back into this relationship that was so harmful for me because, what? You care so much about my reputation but can’t help yourself?” Her face twisted into an eerily familiar sneer. “Go find yourself a stupider witch, Malfoy. I’m too busy with my incredibly important reputation and Ministry career to have time to listen you try to spin your way out of this and make it my fault.”\n\n\nShe pivoted and started walking rapidly away.\n\n\nDraco stood staring after her, his heart dropping. He should have just stayed away. All he’d managed to do was make it worse.\n\n\nHe should just go. Go away and leave her alone the way she’d made it abundantly clear that she wanted him to.\n\n\n“Hermione…” He was following her again as though she were a siren.\n\n\nHer footsteps sped up.\n\n\nHe clenched his jaw and walked faster. He caught up with her as she turned the corner, catching her by the shoulder.\n\n\n“Don’t touch me.” She looked to be a split-second from kicking him in the shins.\n\n\nHe gripped her more tightly, leaning towards her longingly, his mouth dry. “Wait. Just let me explain once and I’ll never bother you again, you have my word, I’ll even make a vow if you want.”\n\n\nShe stared at him, her expression glacial. Several people in the hall glanced towards them and Draco instantly withdrew his hand and straightened.\n\n\nHermione’s eyes flashed with hurt. Draco swallowed and averted his eyes.\n\n\n“I wasn’t going to ask you out,” he said, staring over her shoulder at a potted plant. “I never intended to. I assumed I’d get over it. But when you asked me, well,” he gave a pained smile, “I’m a spoiled only-child who’s always been selfish, of course I said yes. I assumed we wouldn’t last long and it’d be fine to let it run its course. I thought as long as I didn’t do anything to fuck up your life, I wouldn’t be doing any harm. I didn’t realise you’d think I was trying to keep you hidden as though you were some kind of indiscretion on my part. I am sorry. I should have said no from the beginning.” He swallowed and almost reached out at touched her.\n\n\nHe curled his hand into a fist. “I’m not here to try to get you back, I just wanted you to know it wasn’t you. It was never you. You were perfect. I’m sorry you thought it was. I’m sorry I’d already fucked over my future before I fell for you.” He inhaled and stepped back. “I wish you all the best, Granger. You deserve it.”\n\n\nHe nodded shortly and moved past her, feeling like he was going to be sick.\n\n\nHe never wanted to be honest with anyone ever again. He’d rather be crucio’d. Or by shot by one of those wooden and metal Muggle things. Muskets, he thought they were called.\n\n\nHe needed a drink. Fuck. He’d prefer a coma.\n\n\nNow he had to walk all the way of goddamned Ministry pretending he hadn’t just ripped his heart out and left it with a witch who didn’t even want it.\n\n\nThe pounding rush in his ears was beginning to transform into a migraine.\n\n\n“Draco Malfoy, stop right where you are!” Hermione’s voice cut through the suffocating fog in his head like the crack of a whip.\n\n\nHe froze and turned reluctantly to face her.\n\n\nHer files no longer in her arms. They were laying in a pile in the middle of the floor. She was walking towards him, her face pale.\n\n\nThere were a number of people staring openly now. Draco swallowed.\n\n\nShe inhaled jerkily as she got close. “You—“ she started, her voice unsteady. “You are the biggest idiot I have ever met, and that’s really saying something considering how many idiots I know.”\n\n\nOh joy. He was going to be verbally masticated by her in a public hallway. Top off their breakup. This day could not get worse.\n\n\nShe stood in front of him, hands on her hips, her eyes burning with indignation. “I have never cared about what wagging tongues had to say about me, and I don’t have any intention of starting to care now.”\n\n\nBefore Draco could finish processing the statement, she took hold of his robes, jerked him forcefully forward, and kissed him right in the middle of the Ministry.\n\n \n\nDraco felt a chill in the pit of his stomach. She was humming.\nThat was always an unfortunate sign.\nTo anyone passing it might seem cheerful, but to those who knew Hermione Granger intimately, humming was a warning. Draco immediately moved closer as they reached the street corner, casting a discrete tracing charm on her coat before taking her hand.\nShe looked up at him, her dark eyes alight. “I’m going to leave the Ministry.”\nDraco stared down at her, arching an eyebrow. “Are you?”\nShe nodded and raised her hand, gesturing forward into the distance. “Yes. I’ve been thinking about it for a while now. I need to stop thinking and just do it. I’m not going to make the difference I want if I just stay where I am now. I need to travel and see things for myself rather than always reading about them.”\nDraco tucked her hand securely in the crook of his arm, resting his fingers on top of hers.\n“I thought you liked reading,” he said, his voice dry.\nShe laughed and rolled her eyes. “I do, but there are certain things you can’t get from books. The theory isn’t enough for some things; I need to experience them.”\n“Ah.” Draco nodded, but his tone had become muted.\nHermione nodded resolutely to herself, expression steely and determined. “I’m really going to do it. I’m going to quit. I think it’s important that I do. I’ll travel, maybe for years.”\nDraco’s stomach plummeted.\n“Harry and Ron can’t assume I’ll always be right here to bail them out. I think it’s time.”\nThere was a hollow, throbbing sensation spreading steadily throughout his chest, but he forced a pained smile. “I’m sure you’ll enjoy it.”\nShe smiled brightly accompanied by a quick enthusiastic nod. “I will.”\nShe gave another hum and apparated without warning.\nThe first time Draco arrived at Number Twelve Grimmauld Place, while Hermione was getting her coat, Potter pulled him aside.\nDraco braced himself for threats of dismemberment, but Potter just said, “Don’t let Hermione get drunk.”\nDraco assumed it was some kind of protective warning, that Potter suspected Draco would try to take advantage of her if she were vulnerable and intoxicated.\nDraco had no intention of ever cutting any corners. He barely paid attention to the warning and eventually forgot about it entirely after the first few months until an attentive waiter kept their wine glasses full for several hours straight. Hermione gave a loud and abrupt peal of laughter in response to an only mildly humorous joke and it occurred to Draco that she might have had a bit more to drink than usual.\nHowever, she seemed fine. Her speech was unslurred; her eyes attentive and bright, brighter than usual perhaps. Her hands moved more emphatically when she spoke, but she didn’t seem drunk.\nUntil they were leaving.\nShe gave a little happy hum and apparated without any warning.\nDraco had barely managed to grab hold of her sleeve and nearly splinched himself when they reappeared in an animal shelter. He’d stood by, nauseous and bewildered, as Hermione hurried over and began removing cats from their cages, stuffing them inside her coat.\nBy the time Draco managed to get her home, they were both holding cats, covered in scratches, and Hermione was crying and kissing a resistant tomcat while talking about how animals just needed someone to love them.\nPotter wore the piercing expression of a disappointed parent as he held the door open and Draco dragged her inside.\nWhen Draco had her safely in bed with all her new cats, he tried to explain. Potter snorted and said, “At least she didn’t jump you to Northern Ireland. Ron lost his elbow once chasing her.”\nPotter pulled him into the kitchen to help heal the nastier scratches\n”I probably should have mentioned. Hermione doesn’t really have impulse control when she’s drunk,” Potter said as he dabbed stinging antiseptic along the side of Draco’s neck.\nDraco glared as he clenched his teeth. “It would have been helpful if you had.”\nPotter gave a thin smile and spelled the cut closed. “To be fair, I didn’t think you two would last long enough that it mattered.”\nDraco looked away.\n“Cats are pretty minor, relatively speaking,” Potter said as he poured the stinging liquid across the back of Draco’s hand. “One time, she disappeared so long, Ron and I reported her missing. McGonagall found her in Hogwarts, having an argument with the house-elves. Another time, she robbed Borgin and Burke’s because she wanted to know how a cursed amulet worked. There was also—“ he winced, “—one time she apparated into Downing Street to scold the Prime Minister about a policy decision she didn’t like. It was a mess. Worst birthday I ever had.”\n“You and Weasley are both unbelievable,” Draco said, rolling his eyes and standing to leave.\n“Just watch out, when she hums, that’s usually the only sign she’s about to apparate.”\nThey reappeared in the Kensington Gardens. Draco was gripping Hermione’s hand, stomach roiling violently from the abrupt disapparition as he tried to regain his bearings. He discovered that his cashmere scarf and three buttons on his shirt did not appear to have survived the journey.\nIt was raining there. A light drizzle misting down on them as they stood in the dark and empty park.\nWithout releasing her hand, he studied Hermione, trying to determine what she might do next. Slipping her wand away from her would be ideal, but Potter and Weasley had several horror stories about the potential consequences of trying to relieve her of her wand. Drunk Hermione was apparently uninhibited and creative in her choice of defensive hexes.\nShe simply stood glancing around.\n“This is one of my favourite places,” she finally said. ”My dad and I used to come here on Sundays. He used to travel, you know.”\nDraco hadn’t known.\nHer parents were in Australia, and it was, he had learned, not something she liked to talk about.\n“Itchy feet, my mum always said.” The corner of her mouth curved into a wistful smile, and her eyes were far away as though she wasn’t seeing the empty park but something distant and lost in the past. The misting rain was catching in her hair and lashes, and she looked almost ethereal, so effortlessly lovely that Draco couldn’t have turned from her if he’d wanted to.\n“When we came here, he always told me stories about all the places he’d been. We had a map at home, marking all the cities he’d visited. I always thought I’d travel after school. Even when I went to Hogwarts, I still planned to have a gap year so I could see the world before I settled down with a job, but—“ she looked down, “I needed an extra year to graduate, and by then, financially things weren’t exactly—\nShe stopped.\n“It wasn’t in the cards anymore,” she finally said.\n“I’m sorry.”\n“It’s fine,” she said, but she looked down. “It wasn’t the most important thing.”\nHer shoulders squared, and she flashed him a brilliant smile. “I get to do it now. It might even be better. I think it could be, doing it when I’m older.”\nShe tilted her head to the side, eyebrows furrowing. “I never told anyone about traveling. Harry and Ron weren’t really interested when I mentioned it back in school. I’m not sure what everyone will think.”\nDraco forced a smile. “I’m sure they’ll be fine. Even if they aren’t, you shouldn’t hold yourself back.”\nBut he looked away as he said it. His chest felt constricted and hollow at the same time. He squeezed her hand where it was still tucked around his arm and exhaled slowly, trying to ignore the corrosive sense of despair spreading across his chest.\nHe shouldn’t be surprised. He really shouldn’t. This was the way she was.\nFull of plans and ideas for the future, and Draco never felt he had a place in any of them.\nShe always accounted for Potter and Weasley’s feelings, considered the disapproval of Molly Weasley, and the potential professional consequences or fallout when spinning her castles in the air.\nBut Draco wasn’t included.\nWhatever impulsive plans she happened to be enraptured by, Draco was never factored into them. Not after six months together. Not after a year.\nNot after two.\nIn all the infinite futures she envisioned and told him about, he was a non-element.\nAs he stood, trying to absorb it, her hand slipped free from his. Before he could reach out, she’d walked a few steps further along the path alone.\nHe stared wistfully after her. The rain was steadily seeping through his clothing.\n“When?” he finally asked.\nShe stopped and was quiet for a moment before turning back, gnawing thoughtfully on her lip. “Soon. I want to go as soon as I can. I don’t want to keep waiting. I’ll just keep finding reasons to put it off.”\nDraco nodded, wondering if he was at least part of that. Maybe there’d been a test at some point he’d unknowingly failed, some threshold he’d never reached.\nIf he could figure out what it was, he might be able to fix it. If he could pinpoint the ways in which he wasn’t enough. Perhaps she would have gone sooner, but she’d waited because of him.\nA two-year delay, and now she’d made her ruling: the world had more to offer than Draco Malfoy did.\nHe could hardly argue with that.\nShe was turning away again, eyes dreamy and alight. The rain was falling faster now, hard enough to hear in the quiet of the park.\n“Well,” he forced his voice to stay light. “I suppose I have to let you go then.”\nShe stopped mid-stride and her head jerked as she turned sharply back to stare at him. Her eyes had gone wide.\nDraco raised an eyebrow. “What?”\nShe was silent. Then, after a moment, she inhaled and looked down at her hands, seeming to be at a loss for words for several seconds. “Oh. It’s — it’s just — I thought — I thought you’d want to come with me.”\nDraco’s heart skipped a beat and then several more as he stared at her.\n“Me?” He finally managed to say.\nShe was fidgeting with the buttons on her coat. “Yes.”\n”You didn’t—mention me,” Draco said.\nHermione looked up.\n“I — I just assumed. You always — come. You’re always interested in what I’m doing, so I thought —” She looked down again and exhaled. “Sorry. Of course, you don’t want to. That would be a lot — to leave. I wasn’t even thinking. It was — “ she shook her head sharply and bit her lip, “Sorry. Here I am talking about traveling for years, and you don’t even — Sorry —“\nDraco stepped forward, closing the space between them. His hand slid against the side of her neck, slipping beneath her damp hair, fingers curling around the juncture of her neck and shoulder to draw her closer as he stared at her. The droplets of rain had caught in her lashes, glittering like constellations to framed her eyes.\n“Of course I’ll go with you,” he said quickly, heart pounding out of his chest. “I’ll go anywhere in the world with you if you want me to.”\n“Are you sure? You don’t—“\n“Anywhere. Anything,” he said as he pulled her into his arms.\nThey were standing so close their faces nearly touched. His fingers brushed against the column of her throat until he found the quick, nervous flutter of her pulse where it was hidden beneath her jaw, racing at a tempo that matched his heartbeat.\nHe could scarcely breathe because he was drowning in her. He dipped his head forward. Her lips against his were like a firestorm, searing enough to burn straight to his soul.\nHe inhaled against her lips and pulled her closer, kissing her again. “Whatever you want, Granger.”\n\n\n\nThe warlock is saying something important.\nDraco is sure it’s important even if he can’t be bothered to pay attention. There’s a pause.\nLong enough to make Draco realise it’s his cue. His heart jumps and he inhales.\n“Yes,” he says, and immediately the oath he just made takes hold, pulsing through his veins.\nHe probably should be paying attention to what’s being said. It would be the sensible thing to do when using immutable magic involving his soul. He knows that—logically.\nHowever, Hermione is standing in front of him and it’s impossible to pay attention to anything else. Her smile is wide and her eyes are crinkled up into crescents, the sparkling brown just barely visible as she beams at him. Her fingers are entwined with his, squeezing his hands tighter and tighter.\nDraco’s so overwhelmed currently, he’s afraid if he does anything but look at her, he’ll start weeping like a fool.\nThe warlock begins speaking again but Draco can’t tear his eyes from Hermione.\nShe’s radiant. He knew she’d be beautiful, but he hadn’t been prepared for how stunning she’d be in bridal white. The sight of her at the end of the aisle left him unable to breathe.\nHer skin is gilded by the deepening hues of evening sunlight. Her hair is resplendent and untamed, barely contained by the veil that frames her. There’s a small peony pinned above her left temple.\nThere’d been talk of Sleekeazy’s treatment. Neat curls for the wedding photos, perhaps an elegant updo. Ginny had been full of ideas and there have been dozens of practice stylings devoted to taming Hermione’s hair. Unfortunately, Draco accidentally knocked the potion out a window the night before, and even though Ginny could have sworn she’d had two bottles, no one could find them, and all the nearby beauty apothecaries were completely sold out.\nAn astonishing series of coincidences if there ever was one.\nThere’d been absolutely no choice but leave Hermione’s hair alone and natural for the wedding.\nThe warlock stops speaking and there’s another pause.\n“Yes,” Hermione says, lifting her chin. Her magic flares through her fingertips against his skin. Subtle golden tendrils that lace between their fingers. Her eyes widen incrementally as she stares up at him, he can see the emotions brimming in them.\nHe glances down to watch the binding magic wrap itself around their wrists.\nThe enchantments in their wedding vows have to be subtle. It’s necessary when there are Muggles in attendance.\nWendell and Monica Wilkins are sitting one row from the front, close enough that it seems they could be family. Hermione met them during her annual holidays in Australia several years earlier and they’ve grown very close. She is, they often tell people, the daughter they never had.\nIt’s a very small wedding that the Wilkins have travelled from Australia to attend. Intimate friends and adopted family only.\nThe row for parents was expected to remain empty. Hermione Granger is legally orphaned, and Draco expects to be disowned by the end of the day.\nPerhaps not.\nDespite his parents’ cold refusal to acknowledge the relationship or the engagement, and the silence in response to the wedding invitation, Narcissa is present. She arrived just as the music began. It was the first time Draco had seen her in months. There was no time for him to do anything but take her arm and escort her in.\nHer posture is rigid and her expression a cool mask, but her eyes shine and she blinks rapidly as she sits watching.\nIt’s not a society wedding. His mother’s presence makes Draco more aware of that. It hasn’t been planned down to the embroidery on the napkins. Most of the details revolved around accommodating the Wilkins, and discussing how to perform the necessary ceremonies without the magic being obvious.\nHermione wanted her parents to be at her wedding infinitely more than she cared about venues, or chinaware, or the shade of the fairy lights in the trees.\nPeople have always been the only part that mattered to her.\n“…then I declare you bonded for life,” says the warlock, tapping his wand against Draco and Hermione’s conjoined hands. The tendrils from their vows weave around their fingers and wrists, entwining with each other.\nDraco watches as they swirl around one final time before wrapping about their ring fingers and setting into wedding bands. As the bands form, they’re intended to kiss.\nDraco looks up and realises he’d never asked Hermione how she wanted their wedding kiss.\nProbably something restrained. She’s never been much for overt displays of affection, she prefers subtle intimacy. He doesn’t want to look like some kind of entitled bastard acting as if he owns her because she married him.\nHe dips his head to meet her lips chastely, but she takes a quick step forward. Her lips capture his in a fiery and possessive kiss. She is as unrestrained as the dawn.\nGryffindor. She always had to be first and best. Of course she beat him to their first kiss.\nThere’s a part of him that wants to laugh as he meets her lips, cradling her face in his hands as the magic of their marriage bond floods through them.\nChrist, he worships her.\nHis arms wrap around her waist and he kisses her hungrily, lifting her off the ground. She slides her arms around his neck and there’s nothing else that matters. He could stay in that moment until the galaxies burn out.\nShe draws back just enough to breathe, pressing their foreheads together, still holding him. She smiles as she catches her breath against his lips.\n“I’m going to love you for eternity,” she whispers to him.\nAs he stares up at her, he realises there are tears blurring in his eyes. He keeps holding her, unable to let go or set her down. The evening light has faded to dusk and the stars begin to emerge in the night sky, but as Draco stands looking at her, he could swear she’s a sunrise in his arms, as bright and glorious as the dawn.\nThe music has started again. They were supposed to have already turned and presented themselves to the witnesses. There’s a recessional, a reception, dancing. Cake, probably.\nDraco doesn’t particularly care about any of it. The only part that matters has happened; he’s holding his wife.\nHermione’s in no more a rush than he is. She dips her head and her lips meet his again, slowly. The kiss is so deeply ardent he can feel the burn of their souls on his lips.\nIf anything is able to last an eternity, it would be the way she loves.\n \n“You’re so old now.”\nDraco blinked into his morning tea before looking up to glare at the place where his wife, the light of his life, sat across the table from him.\n“Granger.”\nShe looked up at him, her gaze innocent. “Do you think you’ll turn grey first, or just go white?”\nDraco set his teacup down into its saucer with an audible click. “I’m forty.”\nShe gave an assenting hum and bit into her toast. Left in peace, he lifted his cup back up to sip his tea.\n“You could go bald.”\nHe choked and nearly dropped his teacup onto his eggs.\n“I’m forty,” he growled the words. “I have no intention of balding or greying anytime soon.”\nShe raised an eyebrow. “Wasn’t your maternal grandfather bald?”\nHis jaw twitched as he gave a begrudging nod of admission and suppressed the urge to reach up and feel his hairline.\nHermione was lazily stirring her tea. “Male pattern baldness comes from the maternal side.”\nDraco set his newspaper down. “Is there something you want?”\nShe shook her head. “I‘m just thinking aloud.”\nDraco turned back to his paper, but couldn’t do a damn thing but wonder what had inspired the line of thought. Was his hairline receding? He was certain he would have noticed while dressing that morning, but now he suddenly doubted everything.\nHis grandfather Cygnus had been bald...\nAll the words on his paper seemed to say “Bald. Bald. Bald.”\nHe set his paper down with a snap and stood without a word, stalking from the room.\nHis hair looked the same. He studied his reflection in the hallway mirror carefully, trying to check his hairline from all angles.\nA peal of laughter floated down the hallway. He looked over to find Hermione gripping the doorframe and shaking with semi-suppressed laughter.\nHe glowered as she came towards him. “You are a cruel witch. You can’t throw male pattern baldness in a man’s face on his birthday. You’re already forty. I would never say a word about—“\nHer eyes widened incrementally.\nDraco’s jaw hung ajar for a split-second. “About—about anything. Because there’s nothing I could comment on. You’re ageless.”\nHer eyes were dancing with amusement. “Right. Well, that’s only because you’re a better liar. Your mother is going to spoil you all day, someone needs to be a little bit mean to keep you from getting pretentious again.”\nDraco snorted and rolled his eyes as she reached him and straightened his collar in a manner that appeared demure but was fundamentally possessive. “You could just be a sweet wife for a day. We could try it—as an experiment.”\nShe leaned closer until her breath fanned against his throat. “I’m not sure I can manage a whole day.” Her voice dropped low and sultry. “I’ll be sweet tonight.”\nA shiver crept down his spine and he bit his lip. “Well, I suppose an evening is a start.”\nThe corner of her mouth curved upwards, and her eyes crinkled into a familiar, happy pattern. ”It’s possible I’ll grow docile with age.”\nDraco scoffed and eyed her. “Unlikely. I intend to be stuck with you this way. What would I even do with a compliant spouse?”\nShe grinned. “One of those mysteries we’ll never solve.” She brushed his hair back with her fingertips before kissing him. “Happy birthday, Draco.“\n“Granger, I’ve got a bone to pick with you.”\nA cold, unwelcome voice interrupted Hermione while she was in the middle of typing in a citation link that was three lines long. She pointedly refused to turn until she finished typing in the string of numbers and hit enter.\nA paywall filled the screen.\nShe sighed and with an inward curse of exasperation, shifted in her chair to deal with the unwelcome distraction on her hands.\nDraco Malfoy was standing behind her, scowling.\n“What do you want, Malfoy?”\nHe raised his right hand to show a thick stack of papers gripped in his hand. “The study guide you wrote. The answer to twenty is wrong.”\nHermione’s shoulders stiffened, but she kept her expression impassive as she tried to remember what question twenty even was.\nProfessor Snape had emailed the class a study guide with well-over three hundred broadly-phrased questions that “might” appear on the final exam. Hermione had spent a night filling out the study guide questions with exhaustively detailed answers, quotes, and references. She’d emailed a copy to the private study group she participated in, hoping to encourage the other members to share theirs as well so everyone could compare notes and develop even more comprehensive answers.\nInstead, no one else in the study group bothered to write any answers for the study guide at all; and, to add insult to injury, someone whom Hermione intended to murder once she discovered their identity, had forwarded it to the entire class. Everywhere she went, she’d hear her fellow freshman classmates quizzing each other and reciting her answers verbatim.\nShe stared up at Draco Malfoy, who was notably not a member of said study group, standing with her painstakingly compiled study-guide gripped in his unworthy hands.\n“What’s wrong with the answer?” she asked.\nMalfoy glanced derisively down at the papers in his hand and turned his wrist to show her an extensively annotated and highlighted copy of her answer. There was a large section that had been slashed through with a red pen. “This whole section here, it completely leaves out Bourne’s commentary. Are you trying to sabotage the entire class by sending everyone shit answers?”\nHermione’s chest tightened and heat rose on her cheeks.\nMalfoy stepped closer, and he leaned over her, smirking.\n“Is that your plan then?” He quirked a pale eyebrow. “Think you’ll be the one to get Snape’s coveted A+ on your paper if you get the rest of the class to fail the final?”\nHermione’s hand itched to slap him across the face or possibly deck him right there in the library.\nSnape’s required freshman class was renown at their school for its tendency to destroy GPA. Everything hung on the final exam and paper. There were more than a few stories of students losing their merit scholarships and having to leave the school because of it. Snape never gave more than one perfect grade on final papers per year, and rumor had that it had been more than four years since anyone had achieved it.\nMalfoy had announced during orientation week that he was going to be the one to earn it and it seemed that everyone believed he would.\nDraco Malfoy was one of those people that everyone seemed to know about. It was impossible to go anywhere without hearing stories about him. According to the aggressive rumor-mill at the school, he’d gotten a perfect SAT score and been inundated with acceptance letters and full-ride scholarships from prestigious universities across the country, but had decided to attend a “less known” school because his mother was close friends with the president and agreed with school’s academic philosophy.\nHe’d been dubbed, practically from arrival, as the class “genius” and had an entire flock of freshman and non-freshman girls angling to get their Mrs degree in Malfoy.\nHermione thought he was a pretentious asshole.\nShe was most definitely going to kill whomever it was who had allowed him to get his hands on her study-guide.\nShe gave a cold smile. “Gosh. You caught me, Malfoy. I put wrong answers on the study-guide and hoped nobody in our entire class would notice.” She folded her arms. “The reason I didn’t include anything from Bourne is because Snape said he’s wrong and the only reason his textbook was required reading was to highlight what idiots some people are. If you want to add Bourne’s commentary to your answer, be my guest. In fact,” she leaned forward, extending her hand, “I have a better idea, why don’t you give me my study-guide back, and write your own answers.”\nHe smirked and straightened, sliding her study guide back into his satchel. “Everyone knows I’m going to be the one whose paper gets a perfect grade from Snape. I have to say though, it’s fun to see you trying.”\nHermione refused to rise to his baiting. “Anything else? By all means, feel free to spread a rumor that my study guide's rigged. Maybe then people will do their own homework.”\nHe cocked his head. “So you admit you’re angling for the A+.”\nShe rolled her eyes and sat back. “I’m a pretty sure everyone is trying to get it. This isn’t exactly a school with a class culture of only aspiring for passing grades.”\nMalfoy moved slightly closer, edging into her personal space and looming over her in a way that made her want to kick him in the shins or, ideally, a bit higher.\n“But you actually think you can do it, don’t you?” He flashed another smirk. “Care to bet on that?”\n“Care to leave me alone and bother someone else?” Hermione said in a deadpan tone.\nHis smirk widened into a grin and he glanced across the library where a group of his friends were all watching them. “Well, I should clarify, there are already bets that I’ll get it, but I’ll make a personal wager with you. Think you can beat me? Tell me what you want. I’m open to anything.”\nHis eyes slid down, away from her face.\nHermione folded her arms again and glared at him. “I don’t want anything from you, Malfoy, and you’re not getting a thing from me. Fuck off, I’m working on a paper.”\nShe turned back to her computer and watched his silhouette linger in the reflection of her laptop screen for several seconds.\nFinally, he laughed. “Thanks for the notes, Granger. I look forward to beating you.”\nHe turned and sauntered off.\nSnape’s approach to finals was unconventional even for the school. The week before the final exam, each student had a private, twenty-minute meeting with him in which they had to defend their paper. At the end of the meeting, he would tell the student what grade they’d receive on the paper, and then, before the final exam, he’d announce to the class if any students had earned an A+.\nTo Hermione’s irritation, Malfoy’s scheduled meeting with Snape was forty minutes before hers. The hallway outside his office door was lined with students sitting silently and reviewing their papers and notes.\nThe office door swung open and Malfoy emerged, his face aglow with smug triumph.\nThe hallway broke out in whispers.\n“You got it?” Nott asked right out.\nMalfoy grinned. “Perfect grade. First one in five years he said.”\nHermione stiffened where she was sitting as whispers of admiration and congratulations swept down the hallway.\nPadma Patil was sitting next to Hermione and rested a hand briefly on her shoulder.\nMalfoy’s attention zeroed in and he walked over, stopping in front of Hermione.\n“Tough luck, Granger. Maybe in another life. I’m sure you’ll at least get an A.” He started to turn and then paused as though he were just remembering something. “A lot of us are going to be celebrating tonight, you should come—unless you want people to think you’re a sore loser.”\nHermione stared up at him with a flat expression until he finally turned with a shrug and walked away.\nWhen she emerged from her meeting, she didn’t say a word to the other students waiting in the hallway. She went to her dorm and started studying for the rest of her finals.\nThe final exam for Snape’s class started at an ungodly hour in the morning and the room was blessedly silent as students trickled in and took their seats. Hermione sat reviewing her notes in a corner where no one was likely to jostle her.\nThe silence was broken when Malfoy entered the room noisily with his friends at his heels and they settled into seats towards the front of the room.\nFive minutes before the exam was scheduled to begin, Snape strode into the room and up to the whiteboard. He snatched up a marker and started writing grading percentage brackets. When he finished he added a colon beside each bracket and began adding numbers: number of papers that had failed, the number that had barely passed, moving up towards the 100% that sat at the top of the board.\nHis hand hovered next to it, and then he suddenly turned and stared at the room, his expression unreadable.\n“This semester has a notable distinction,” he said after a moment’s silence. “For the first time in the years I’ve been teaching at this college, I have had two students who merited a perfect grade on the semester’s final paper.”\nHushed gasps swept across the room and students turned to look at Malfoy, whose smirking grin had frozen on his face.\n“Next semester, anyone who hasn’t failed my class will be assigned to read Mr Malfoy and Miss Granger’s papers, and perhaps then the rest of you will begin to understand what I mean when I say I expect and will accept nothing less than excellence in this class.”\nMalfoy’s platinum head slowly swiveled to so he could stare across the room where Hermione was sitting, an impassive expression on her face.\nShe didn’t look in his direction.\nHe kept staring at her until someone shoved a copy of the exam at him.\nTwo hours later, after turning in her copy of the final exam, Hermione packed her bag, bobbing her head at a few whispered congratulations, and hurried out of the classroom, heading for the library.\n“Granger!”\nShe froze and turned, rolling her eyes.\nMalfoy was jogging after her, notably without his usual posse around him.\nShe stood waiting until he caught up with her.\nHe stopped a foot away from her and looked her up and down from head to toe as though he were reconsidering something. “Well, you’re full of surprises, aren’t you?”\nHermione folded her arms. “Not really.”\nHe looked up and met her eyes, flashing a grin. He cocked his head slightly to the side. “I guess this means we should study together.”\nHermione gave a thin, false smile. “I already have a study group, we’re not accepting new members.”\nHis grin turned roguish and his voice dropped suggestively as he shifted closer. “It could just be the two of us. You’re heading to the library now, aren’t you?”\nHer expression turned cold and she stepped quickly back. ”I’m going to study alone.”\nShe turned on her heel and started walking away.\n“You can’t avoid me forever, Granger!”\n“You’ll be surprised,” she said, glaring over her shoulder at him.\nHe was still standing where she’d left him, staring after her, that irritating, over-confident grin still on his face.\nHe raised an eyebrow. “Care to bet on that?”\n \n“I won’t do it, Potter. I don’t care how many years of friendship or mutual antagonism you attempt to invoke, the answer is no.”\nMalfoy flung the door of his study open and stalked over to his desk, dropping into a chair and folding his arms as he glared at Harry. “Fuck off. I said I would get you in, I did so. You get no further aid from me.”\nHarry shut the door, rubbing the back of his head. “I get that it’s not ideal, Malfoy—“\nMalfoy gave a loud, disgusted snort to indicate of “not ideal” was putting it much too mildly.\n“We need this contact, and she’s taken a fancy to you. I’m not saying actually do anything with her, I’m just saying maintain contact, flirt a bit; see if she’ll tell you something.”\nMalfoy’s grey eyes were glaring daggers at Harry.\n“I am married.” He waved his left hand demonstratively to highlight the wedding band, his expression contemptuous. “In case you’ve somehow forgotten. I’m not getting drinks, maintaining contact, or flirting with some lonely woman because your department is incapable of incriminating a smuggling ring with their own personnel.”\nHarry sighed. “I’ll make sure she knows this is my idea and that you don’t even want to do it.”\nMalfoy stood up, looking murderous. “You will not breathe a word about this to my wife.” His voice was quiet and deadly. “Get out of my house before I have you thrown out.”\nHarry folded his arms and refused to budge. “If I explain, I’m sure Hermione will understand—“\n“Understand what?” A curious voice came from behind Harry.\nMalfoy blanched and Harry whirled to see Hermione poking her head through the doorway.\n“The portraits said you two were fighting.”\n“It’s nothing. Potter’s leaving,” Malfoy said, his tone pointed.\n“Hermione,” Harry said quickly, “Malfoy’s been helping us try to break into the smuggling ring I told you about last week. There’s a Veela involved who noticed him and asked him to have a drink with her tonight.”\nHermione’s eyes widened with surprise.\n“But I’m not doing it. I told him as much, and now he’s leaving.” Malfoy’s voice was cold fury and right next to Harry’s ear.\nHermione’s mouth twitched, and her eyes grew round and shiny. She clamped both hands over her mouth as she kept looking between Malfoy and Harry. After a moment her shoulders started shaking visibly.\n“Hermione...” Malfoy reached towards her. “I’m not going to do it.”\nHermione shook her head wordlessly and backed up, her shoulders shaking harder.\n“Darling, please don’t be upset...” Malfoy sounded like a wounded animal. \nHermione’s hands dropped away from her mouth and she proceeded to howl with laughter.\nHarry and Malfoy stared at each other with confusion before looking back to Hermione.\n“You’re—“ she stared at Harry, gasping for breath, “—you’re expecting him—to flirt?”\nShe slid down the wall, giggling hysterically, tears leaking from her eyes.\n“Harry—have you—have you seen him when he tries to flirt?” She was wiping her eyes and wheezing with laughter.\nHarry’s head swiveled and he stared thoughtfully at Malfoy. “That’s a fair point.”\nMalfoy’s mouth was opening and closing like a fish. “I—“ he spluttered, “I can flirt!”\nIt’s the moonless nights when he comes.\nThe bed creaks and Hermione feels the mattress shift. When she opens her eyes, darkness like a black hole looms over her. Impossibly long fingers slide possessively around her shoulders, pulling her close, lips finding hers, as he slowly bleeds into view. His pale skin and hair barely visible in the dim light.\nShe wraps her arms around him, pulling him desperately close and kissing across his face. “Draco… Draco… I didn’t know if you’d come again.”\nHe feels so close to human. Almost. Everywhere she touches him, he feels almost human. His fingers are almost human but too long. His features still almost the same but the angles are sharper now, harder. His eyes are still silver, but now there’s a luminous glow behind them and the sclera surrounding them is black. Everything about him whispers, “other.”\nHe wraps his arms tightly around her and lies there for several minutes just holding her. She runs her fingers across his shoulders, trying to feel him, to memorise the weight of his body resting against hers and what it feels like when he grips her close against his chest, so she can replay it on all the nights when he isn’t there.\nHe breathes in against her hair, and his hands begin roaming across her body, gripping her closer, dragging her tight against him so that she wraps her legs around his hips, pulling his mouth against hers.\nThere’s a bitter aftertaste to his kisses, like ash on her tongue.\nShe draws back, running her fingertips across the sharp angle of his cheekbone before tracing up an elongating ear.\nHis silver eyes stare down at her in the darkness, the irises are tinged blood red.\nThere’s a pang in her chest as she realizes that the expression in his eyes isn’t the same. There’s something missing now in the way he looks at her.\nHe looks away. Preoccupied with ripping her slip out of the way so that it no longer obstructs his view. She reaches out and tilts his face up so that their eyes meet again.\n“Do you remember me, Draco?” she asks after a long silence. “Do you remember why you come here?”\nHe goes rigid, staring at her, then a growl vibrates through him, starting low in his chest and the rising up until she feels the burn of his breath on her face as he grips her crushingly close. He buries his face against her shoulder and she feels his fangs drag across her skin in a way that sends a shiver racing down her spine.\n“Mine.”\nShe gives a laugh and presses their faces together. “Yes. You married me, once upon a time.”\nShe kisses him again as he pulls away the shredded remains of her slip until she’s bare beneath him. He slithers down her body, serpentine and possessive. Running his fingers across every inch of her. Following it with his tongue and his teeth. She moans at his touch, gripping his shoulders, twisting her legs around him, raking her fingernails across his shoulders as she shatters, feeling them score across his skin.\n\nRemember me. Remember that I touched you. Carry the marks with you when you go. \n\nWhen he pushes into her, he pauses and his shoulders twist. With a long groan, his wings emerge and unfurl, black enough to swallow the night sky. The deadly claws on the arc of the wings are only inches above her face. She’s used to it now, but she still experiences a stabbing jolt of fear every time she watches it happen. His wings flare out when she tenses around him and tangles her arms and legs with his.\nHis shoulders tremble when her fingers trail near his wings. She brushes her fingers lightly against the base and he gives a rasping moan as his body jerks.\nThe rest of the world can fade away. He’s all she sees and that’s more than enough.\n“Hermione,” he says, nuzzling her afterwards when they’re lying side by side. He’s folded his wings possessively around her, they’re warm and soft against her bare skin. Her legs are tangled with his and he’s cradling her face in his hands, staring at her, studying her.\n“Yes?” she says.\n“Are you alright?”\nShe rests a hand on his cheek, her fingers resting on the sharpening angle of his cheekbone for a moment before her hand slides back to run through his hair. There’s a ridge under his hair just past his hairline. She traces her fingers over it.\nHe’s growing horns.\nShe wonders if they’ll be visible by the next time he comes.\n“Of course I’m alright. You came back,” she says.\nThey talk for the rest of the night. With every passing hour, Hermione watches the humanness slowly bleed back into him. She tells him about her research, about her theories. He doesn’t tell her what he does when he’s away. He doesn’t want her to know, although she has her guesses. He reminisces about her, what he remembers of them.\n“You called me a cockroach,” he says.\nHer eyes crinkle in the corners as she notices his mannerisms returning, his left eyebrow is quirked up and the corner of his mouth is pulling in a vague smirk.\n“Well,” she says, “you were—back then.”\nThey only have until dawn. He’ll vanish as the sun rises.\nShe knows that there are parts of him that are fading away. Every month, each time he manages to slip between dimensions and return to her, there’s less of him. Fewer of those infinite facets that she’s memorised. The ones that remain when he returns are sharpened. On the inside and outside, he is becoming more of who he is.\nThat’s why he’s there.\nShe curls closer, pressing her face against his chest, listening for a heart that’s ceased to beat. He wraps his arms around her, hands running up and down her back, unrestrainedly territorial, wings tightening protectively around her. She wonders what kind of hell he’d bring down if anyone ever tried to take her from him.\nPersonal vice defines what a demon’s nature is. It is the key to who they are and what they become. \nDraco was always sinfully possessive.\nHe will always come back for what is his.\nAnd she’ll always be waiting for him.\n\n\n\nA sticky face featuring two large grey eyes watched carefully as Draco took a bite and placed his fried confection back onto the plate.\n“Father?”\nDraco glanced up, doughnut halfway to his mouth again. “Yes?”\nAurore licked her lips and shifted forward incrementally, her eyes fastened on the doughnut in his hand. “I think it’s nicest when we share treats.”\nDraco froze, staring at her with his own grey eyes. He slowly quirked an eyebrow, studying the crumbs and traces of icing smeared across her chin. “How many doughnuts have you had today?”\n“Five,” was the prompt reply.\nDraco raised his chin, cocking his head to the side. “And how many am I having?”\nAurore inhaled and leaned a little closer. “One.”\n“So who exactly would be sharing? Are we sharing, or am I sharing?”\nAurore glanced down, looking abashed and subsiding into a resigned silence.\nDraco took another bite of his doughnut and Aurore watched him, her eyes wide with longing. He met her gaze pointedly as he chewed and swallowed.\nAurore gave a long, wistful sigh, slumping back in her chair, legs kicking restlessly.\nDraco glanced away, staring out the window. His jaw twitched.\nAfter a moment he scoffed under his breath and dropped his head, giving a long sigh.\n”Don’t tell your mother.” He dropped his doughnut back onto his plate and shoved the remaining three-quarters across the table towards his daughter’s eager and sticky fingers.\n\n\n\n\n“Draco...”\n\n\n“Mmm”\n\n\n“Stop staring at my knickers.”\n\n\nDraco blinked and tore his eyes away, glancing at the blank page in front of him before looking up, lashes demurely lowered. “I was brainstorming.”\n\n\nHermione snorted and slipped her wand into her hair before tugging her shirt down in an attempt at modesty. “Right. What insights did my arse provide?”\n\n\nDraco closed his journal and laid his quill aside before rolling over, his hand slithering towards her. “I have a theory that orgasms increase concentration,” he said, leering. “I think we should experiment and find out.” \n\n\nHer eyes were dancing. “Really?”\n\n\n“Mm.” He started at her knee and began kissing up her thigh. “Start with one, then observe productivity levels. On progressing days, we’ll see how multiple orgasms affect things.”\n\n\nHis fingers were trailing down her inner thighs. \n\n\n“Sounds comprehensive,” she said. She sounded like she was attempting sarcasm, but the breathless quality undercut it. \n\n\n“Very,” he said, settling between her legs.\n\n\nHermione should have seen it coming. Really. Well, perhaps that was exactly the problem with becoming chronically nearsighted, she was incapable of seeing it coming. \n\n\nAfter all, her vision didn’t fade away overnight. When things in the distance were blurry, she’d just assumed they blurred for everyone. It wasn’t as if she spent much time staring into the distance anyway. \n\n\nShe was Hermione Granger, she preferred close at hand, immediate problems. \n\n\nIt wasn’t until the jokes about how literally she took the phrase “nose stuck in a book” seemed to happen almost incessantly and Harry noted she squinted almost as much as he did when he’d misplaced his glasses, that the thought even occurred to her.\n\n\nShe held out her hand. \n\n\n“Harry, give me your glasses.”\n\n\nA tried and true friend, he took them off and handed them over without a word. She slid them onto her face, hooking them behind her ears, and then blinked.\n\n\n“Oh my god,” she said in astonishment as she discovered that the world came in a much higher resolution than she’d been aware. There were details everywhere that she’d been completely oblivious to. The titles of the books were legible and not just blurs of gilding along the spine. “I think I might need to see an optician”\n\n\nShe had more than just needed to see one. She was suffering from severely deteriorating eyesight. Apparently the flashes and explosions during the war had not done her pupils any favours, and Hermione had been so busy that she’d failed to take any interventionary steps until the nearsightedness was quite severe. But fortunately, magical opticians were quite good at their jobs and in short order, she had a pair of round lens spectacles especially bespelled to protect her eyesight and prevent any further decline as long as she wore them consistently.\n\n\n“We match,” Harry said, looking like a proud father as Hermione stared at her suddenly glaringly detailed reflection in a mirror. Good lord, why didn’t anyone tell her that her curls had that many flyaways.\n\n\nHarry patted her head. “I always thought that of the three of us, you should be the one with glasses.”\n\n\n“It makes you look even scarier, I think,” Ron said, glancing up from a quidditch recap in the newspaper. \n\n\n“I think she looks cute,” Ginny called from the kitchen. \n\n\n“Scary-cute,” Harry said brightly as if he’d just invented a solution for world peace. \n\n\nHermione rolled her eyes at them all. “They’re just glasses. I doubt anyone will even notice.”\n\n\nShe was right, most people didn’t notice. A few coworkers commented that they suited her. There were a few comments that she looked like a librarian, but for the most part, Hermione Granger in glasses was regarded more as inevitability than ground-breaking. \n\n\nShe discovered within a matter of hours that being nearsighted had done favours to several of her colleagues. It had smoothed wrinkles, blurred skin discolouration, hidden greasy hair, and concealed a great deal of dandruff. \n\n\nAll in all, Hermione wasn’t convinced she liked seeing the world with quite so much clarity. \n\n\nJust past noon, the department heads started assembling for the review meeting, a weekly event that Hermione ran as head of her Department.\n\n\nThe last person to arrive, as usual, was Malfoy. \n\n\nMalfoy had always treated Hermione’s Ministry position as if it were a personal attack that the universe had cobbled together just to offend him.\n\n\nHermione wasn’t his superior, but given the way he behaved, a person would think she was. The Ministry hierarchy was convoluted, but they had relatively equal positions, just within different departments. Hermione’s job was to make sure all the departments were adhering to Ministry rules and regulations, reviewing their work and ensuring that they hadn’t forgotten to dot any i’s before sending drafts up the chain of command. \n\n\nBut given that Hermione was the one holding the rubber stamp of approval, Malfoy acted like Hermione was his manager, and he hated it. He made a scene every time he arrived, bringing an entire tea service or lunch for everyone, making comments about how ‘some people’ never knew how to take a break. He always sat directly across from her at the far end of the table so that he could stare judgmentally at her the entire time, asking more questions than anyone else.\n\n\nAnd he always arrived late. \n\n\nToday, as he sauntered through the door, Hermione glanced up, then she blinked and did a double take, shocked by the unwanted revelation that Draco Malfoy, the proverbial thorn in her side, was horrifyingly attractive. Enough so that she found her mouth hanging open as she took in the newly detailed sight of him.\n\n\nHer lack of farsightedness had spared her the knowledge that at some point in the last several years Draco Malfoy had grown into himself and then some. Given that they never came within a few feet of each other, she had been blessedly ignorant of just how handsome he was. He had sharp, angular cheekbones, and his dark eyes and lashes made his grey eyes stand out starkly against his pale skin. He also had the cleanest, shiniest hair of anyone in the room with nary a speck of dandruff to be seen, his nails were all neatly manicured, and his robes excruciatingly well-tailored. \n\n\nHe stared back at Hermione with his own expression of surprise but seemed to recover himself first.\n\n\n“I think the fuck not,” he said, and without further explanation, pivoted and walked straight back out of the meeting room.\n\n\nThe entire room stared after him, but Hermione had had more than enough. She didn’t care how handsome he’d been this whole time. She’d been putting up with his attitude for months, and she was not going to overlook it a day longer. \n\n\nShe mumbled a word of excuse and then charged through the doorway after him.\n\n\n“Malfoy!” She burst into his office over the protests of his secretary.\n\n\nMalfoy started with such surprise he appeared to leave the floor.\n\n\n“What is your problem?” She stood glaring at him, her hands on both hips.\n\n\nHe looked away from her and swallowed so visibly that his Adam’s Apple bobbed. “I can’t do this. I’ll send an assistant or someone else in the department, but I won’t be attending any more meetings.”\n\n\nShe scoffed and kicked the door shut behind her with a bang. “Oh grow up. Really. You can’t put up with having to work with me once a week. Could you be more of a child?”\n\n\nShe advanced on him, trying to be as threatening as possible, but rather than retreat or counter, Malfoy just stood there, blushing profusely, and staring at her like a deer caught in the headlights of a car.\n\n\nShe stopped short and stared at him, her eyebrows furrowing in confusion.\n\n\n“Malfoy…?” she started with assurance but then her voice trailed off in bewilderment.\n\n\n“Y-yes?” he stammered, which was very unlike him, and it made the tendons in his throat stand out and Hermione had no idea why, but she found it incredibly attractive and sent a warm flush through her. \n\n\nHad he always looked this way and she’d just missed it? \n\n\nShe blinked, determined to ignore how he looked. It didn’t matter. He was still annoying, and finding him attractive didn’t change that. \n\n\nShe cleared her throat and tried to get straight to the point. “Why can’t you attend any more meetings?” \n\n\nA beat, because Malfoy appeared half distracted.\n\n\n“I’m busy,” he said, not even trying to lie convincingly.\n\n\n“Oh don’t give me that,” she said, stepping even closer. “You’ve been an overdramatic arse since the first day you came to a meeting. You always arrive late, and sit as far away as possible, ask me questions that you already know the answers to, and now suddenly you can’t attend anymore. Why? Tell me, or I’ll file a report with HR and you can tell them instead.”\n\n\nHe glanced away. “I can’t keep looking at you. It distracts me too much.”\n\n\n“What is that supposed to mean?\"\n\n\nHe retreated, apparently intuiting the way she suddenly wanted to hex him. \n\n\n“The glasses,” he swallowed visibly, “they’re a hard limit.”\n\n\nShe stood there in bewilderment.\n\n\nHe was still avoiding looking directly at her and seemed to mostly be talking to himself. “I know myself, and if you sit glaring at me for an hour straight in glasses, I’m not going to be able to think straight. It’s physically impossible.”\n\n\nShe snorted, not even trying to hide how offended she felt, how dare he imply there was anything unprofessional about her. “When do I glare at you?”\n\n\nHe finally looked at her again and gave an incredulous laugh. “Oh come off it, Granger, you always glare at me. I sit across from you and you look at everyone else like this —” he batted his lashes and widened his eyes so much that he looked like a baby deer, “– but whenever I say anything, you look over and your entire face goes —” he narrowed his eyes exaggeratedly until they were nearly slits, causing his lips to purse. \n\n\nHermione’s mouth dropped open with indignation. \n\n\nThen he waved her off. “And you know what, I didn’t even mind it. Some —” his voice seemed to crack just slightly, “– might even argue there’s a certain appeal to getting glared at by you. But I’m at my limit. No thank you. You can glare at my assistant moving forward.”\n\n\nHermione rolled her eyes. \n\n\n“I wasn’t glaring at you, you great pillock. I’m nearsighted.” \nShe gestured at the glasses. “I just found out last week. If my eyes were narrowed when you were talking, it's because I was trying to see you. I was squinting. You sit all the way at the far end of the table, I had to narrow my eyes to make out your expressions. I don’t just – glare at people! For heavens sake.”\n\n\nNow Malfoy looked to be a mix of shocked and devastated. Like a child who’d just found out that Santa Claus wasn’t real.\n\n\n“This whole time,” his voice was plaintive,  “you’ve been narrowing your eyes at me like that because you couldn’t see?”\n\n\nHermione felt her face grow warm. “I’ve been busy. I wasn’t paying much attention to my vision as long as I could read.”\n\n\nMalfoy’s mouth opened and closed several times and he appeared to be in the middle of an internal crisis, which gave Hermione time to process a few things herself. She blinked several times.\n\n\nDraco Malfoy couldn’t think straight when she glared at him?\n\n\n“Malfoy,” she cocked her head to the side, her heartbeat quickening as she studied him, “what exactly does my ‘glaring’ do to you?”\n\n\nHe turned a spectacular shade of red. “N-nothing.” \n\n\n“Really?” she said slowly. “So this inability to think straight isn’t due to anything specific?”\n\n\nMalfoy’s expression became suddenly cagey, and his eyes grew incredibly shifty in a way she probably wouldn’t have been able to make out without her glasses on. He scuttled away from her, getting behind his desk and seating himself and putting on a great show of grabbing a large ostrich quill. \n\n\n“I’m quite busy right now,” he proclaimed in a voice of great dignity.\n\n\n“You are not.” Hermione advanced slowly on his desk.\n\n\n “Really, Granger. Can we talk about this later?” His voice seemed to climb a full octave with each sentence and he was assiduously avoiding eye-contact.\n\n\nHermione leaned against his desk, still observing him with scientific degree of appraisal. “And this effect I have, you fear it will be worse now that I have these glasses?” \n\n\nShe reached up and adjusted them, still watching Malfoy carefully. He glanced up just in time to see her set them just a little more securely on the bridge of her nose and emitted a sort of strangled sound before averting his gaze again and rapidly devoting himself to signing documents as if the fate of the Wizarding world relied upon it.\n\n\nHermione watched, enjoying all the newly discovered angles of his face, wondering idly if he’d moan if she were to trail her fingertips along them. She’d never taken the time to consider Draco Malfoy in a sexual way, given that he’d just been a talking blur at the far end of a table for the last several months, but it would seem that the line between frustration and sexual frustration was drawn at being able to appreciate his cheekbones.  \n\n\nShe sat, biding her time and enjoying the view until he ran out of things to pretend he needed to sign. \n\n\nFinally, he looked up at her in resignation.\n\n\nShe drew a deep breath, and folded her arms. “You know, our departments have to meet, you can’t just stop attending meetings.”\n\n\nHe swallowed. “I’m sure my assistant is more than able —”\n\n\n“I don’t want to glare at your assistant,” she said, brushing him off with the wave of her hand. “I only like glaring at you.”\n\n\nMalfoy made a sort of incredulous whimper in the back of his throat. \n\n\nShe hummed. “It's not going to do either of any good to ignore this problem, and as your colleague it is in my best interest to help you.\"\n\n\nHe was staring at her with visible skepticism.\n\n\nShe tapped her chin thoughtfully. \"If focus is a concern, we are going to have to do something about that. I think chronic overexposure would probably do the trick.”\n\n\n“I’m sorry,” he’d grabbed the collar of his robes and tugged at them as if he were being strangled. “What?”\n\n\nHermione straightened, brushing the wrinkles from her skirt and then leaned towards him. “If you become immune to being around me, then an hour or so getting glared at in a Department Meeting will barely affect you. Would it?”\n\n\nHe started to speak but then his mouth snapped shut and he swallowed. “Exactly how would I be getting exposed to you?\" \n\n\nShe tilted her head to the side and pursed her lips. \"Well, we could just work in more proximity, but I think that would take up a lot of our time. I think there are more efficient forms of overexposure,\" she stared straight at his mouth as she said this. \"Don't you?\"\n\n\nHis tongue darted out to wet his lips and he exhaled. \"And this — is something you’re volunteering to do?” \n\n\n“It’s the responsible thing to do, as your colleague.” Her heart was a firestorm drumbeat of anticipation inside her chest. She had never propositioned a coworker before, but somehow suddenly being able to see the world in perfect clarity had also provided her with an unexpected quantity of self-confidence. She leaned in towards him, her hands braced on the back of his chair. “If you think about it. Logically.”\n\n\nMalfoy drew a deep breath and she suddenly felt the need to send up a fervent prayer that she hadn't just entirely misunderstood things because she would probably die of embarrassment if he turned her down.\n\n\n“Well, when you put it like that, we have no choice.” He leaned intentionally forwards, bringing their faces closer, his eyes locked on her lips. Just breathing sent a shiver of anticipation straight through Hermione.\n\n\n“None at all,” she said, her voice almost a whisper.\n\n\nHe kissed her. \n\n\nTheir lips meeting sparked like magic in her veins. His mouth was warm against hers, and when she didn’t draw back but instead parted her lips, he leaned closer. His fingers found her face, trailing across her cheek and then curling around her jaw to draw her in, draw her closer, kiss her deeper. \n\n\nHermione may have only just realised that she was attracted to Malfoy, but she’d never been one to shy away from throwing herself in headfirst when the situation required it. And she also wasn’t one to shy away from an exhilarating experience as long as it didn’t involve flying.\n\n\nShe reached out and ran a hand through his hair, fingernails grazing across his skin and he did indeed moan. Low as if it were dragged from him, and the sound vibrated through her, sending a thrill along her nerves that made her toes curl and her body move nearer to his. He tangled a hand in her hair at the base of her skull, tight enough to make her gasp, and when she did, he kissed her deeper and they might have gone on kissing except the clock chimed loudly, which reminded both of them that Hermione was supposed to have been running a department meeting just then.\n\n\nThey both drew back, breathing heavily.\n\n\nMalfoy’s cheeks were stained pink, and he looked edible with his hair mussed and his lips reddened and his grey eyes dark. He stared straight back at her, chest heaving, scanning her own face as if he were reading her thoughts and it made her blush so much that her glasses fogged up and she had to pull them off and wipe at the lenses with the edge of her cardigan. \n\n\nShe awkwardly straightened them and gave a little cough as she slid them back onto her face. “Well, do you feel overexposed now?”\n\n\nHe shook his head, still watching her. “No. I think I’d need considerably more exposure before I’m anywhere near that threshold.”\n\n\nShe nodded and cleared her throat, trying to continue the charade she’d started. “True.” It was her voice climbing octaves now. “And we want to be scientific, so really, we’ll need to do it repeatedly in order to have a meaningful sample size. Perhaps over an extended period of time. Do you have plans for this evening?”\n\n\n“None that I can’t cancel,” he said, watching her through his lashes. “You know I take my job here very seriously.”\n\n\nThat was probably the most absurd lie either of them had made yet.\n\n\n“Right.” She straightened, trying to regain her composure because she did still have a meeting to get back to and she couldn’t walk back in while distracted by thoughts of what she wanted to do to Draco Malfoy that evening. Even though that was the only thing she currently wanted to think about. \n\n\nShe cleared her throat. “I can make an excuse for you for today’s meeting, but we should aim for business as usual by next week.”\n\n\nMalfoy stood, apparently having used up all his blushes during their earlier confrontation and now he looked aggravatingly smug. \n\n\n“You realise,” he said slowly in that low drawl of his, “that will require a significant amount of exposure. I'd probably need your near constant presence during the next seven days.”\n\n\nHis words were  drenched with suggestion.\n\n\n“Yes, well,” She was blushing all the way down her neck as she tried to sidle towards the door, struggling regain her composure and get back into a work headspace. “I’ve always been a hard worker, and I’d never try to set anyone up for failure. So… we’ll see what needs to be done.” \n\n\nHe was following her, and not looking at all like he intended to let her get back to her meeting.\n\n\n“I really need to go,\" she said, trying to run for it, but he caught her wrist with a sly smirk.\n\n\n“Hold on, you can't leave yet. I need a little more exposure to get me through the rest of the day,” he said, his voice as dark and sinful as chocolate as he drew her back and lowered his head to kiss her again. \n\nMalfoy’s hair was cropped against his skull when they brought him from Azkaban to St Mungo’s.\nHermione almost didn’t recognise him, just skin and bones, and none of that pale white-blond hair. She remembered the flashing lights, the healers and aurors scurrying through the halls.\n\nDay of his release — Not conscious — How long? — Vitals unstable — How long did the Dementor have him?\n\nThe words bled together, the clamour went on.\nAfter two months, he was still unconscious. It didn’t take all of his soul, she was told. There was a possibility he might wake, but they put him in permanent spell damage.\nAn extra room added to Janus Thickey for the unusual case.\nHe just lay there, bone thin, grey eyes staring blindly at the ceiling. Never moving.\nUnaware, unresponsive, said his file, palliative care necessary.\nHe filled out again. Round the clock hospital care could do that. Eventually the hollows in his cheeks faded and color returned and he looked like Draco Malfoy. He stayed that way, as if encased in amber, frozen in a moment.\nOnly his hair changed, growing.\nShe thought about cutting it. When it reached his shoulders, she told herself she would. If it tangled or matted it would create discomfort, but she felt unsettled by the idea of looming over him with scissors. Most care used spells, but hair was finicky.\nShe didn’t want to give him another Azkaban hack job.\nShe’d do it when he started looking like his father; it would be more than enough reason.\nInstead his long hair accentuated the ways he didn’t look like his father. His features were not so sharp, his mouth flatter, sadder.\nIt made her realise that Draco Malfoy was not just a replica of his father.\nHe was someone else, and his life was slipping by like sand in an hourglass. She didn’t even know if he knew.\nShe started talking to him, not on purpose, it happened eventually, just narration at first, but after so many circular discussions with Lockhart, it was novel to have someone who didn’t interrupt or walk away when she talked about the books she read, her friends, and her research on mind-healing, while she set him up in a chair, combed his hair and enchanted a view.\nShe knew he didn’t really listen.\nWhen his hair reached his elbows she knew she needed to do something. She combed it, but couldn’t bring herself to cut it. It was the only thing about him that reflected the passage of time.\nShe hesitated and then set the scissors down, lacing her fingers through carefully, she braided it down his back, pulling it away from his eyes and tying it off with her hairband.\nShe stepped around and studied him, and then pulled out a mirror, holding it so that he could see his reflection, their faces side-by-side.\n“See?” she said. “You aren’t your father.”\nHis hand twitched, long fingers curling, and she watched his eyes move as if trying to focus.\nHer voice caught in her throat. “Malfoy?”\nThat was all she could say before all the monitors went off, the room filling with sounds and colors. Healers came flooding into the room, and Hermione barely got a word out before he was whisked away.\nBecause if he was responsive that meant his soul was intact, and if his soul was intact it meant he would recover, and if he could recover then that meant he no longer belonged in the Janus Thickey Ward for Permanent Spell Damage.\nHe was gone.\nJust like that.\nBy the end of the day, the room was cleared, cleaned, and waiting for the next long term resident to occupy it.\nHermione resolved not to visit him, even though the miraculous recovery was all the hospital talked about for several days. It was not as if she’d had anything to do with it. Assuming he’d recovered as much as everyone was saying, he wouldn’t be pleased if she showed up acting like they were friends because she’d been his palliative care healer. He probably had no idea at all. He’d be horrified.\nShe had tea with Lockhart and accepted bubblegum wrappers from the Longbottoms, and looked through her mind healing books again, because surely if a sliver of a soul was enough to bring a person back, then a whole lifetime of memories could be restored somehow. Somehow.\n“He wants to see you,” a very irritated wizard announced, making her jump.\n“What? Who?”\n“The Malfoy boy. Says he wants to see ‘his healer’ which should me, but it’s apparently not me. And if it’s not me, it should be Jorkins, who is a legend here at St Mungo’s, but it’s not him either. ‘Granger’, he says, he wants to see ‘Granger’.” The healer puffed out a breath.\nHermione’s heart was in her throat. “Me? Why?”\nThe healer just waved a hand. “He’s a toff. We do as he says, we get a new wing in the hospital as thanks.” He glanced at the walls and then emphatically at her. “We really could use a new wing.”\nHermione gulped and followed him.\nThe healer glanced at her. “So, how’d you do it?”\nShe stared. “Do what?”\n“To bring him back.”\nShe choked at that. “I didn’t — I just cared for him.”\nThe healer stopped short, an odd look on his face. “Don’t you know how it works with souls?”\n“My specialty is mind-healing.”\n“They don’t come back. The souls. Not after dementors. They could in theory, but they don’t. They unravel completely after a few years.”\n“Then why did Malfoy come back?”\nThe healer shrugged. “They always say it’s the bastards who never die. Ask him.”\nMalfoy was waiting for her.\nShe was so used to his eyes being blank and unresponsive, it was startling to find him staring at her the moment she entered.\n“Granger,” his voice was faint. Relieved.\nIt’s then she knew that he recognised her, knew her, was aware of the things she’d talked about to him.\nOh god.\n“Hi,” she said nervously. “They said you wanted me.”\n“I do.”\nA shiver ran down her spine. His hair was still braided with her hair tie.\n“I thought you’d visit eventually,” he said, studying her. “You didn’t.”\n“I was told you’d be unaware of my care.”\n“I was aware.”\n“Always?” she asked faintly.\nHe nodded.\n“How did you come back?” she asked.\nHe looked down. “I didn’t mean to. I meant to fade. I thought I was just another Malfoy, an iteration played over and over, and what would it matter if there was one less? I didn’t know how to do anything but make the same mistakes as my ancestors. To follow their path. But then you of all people were there. I could watch you, listen to you talk. You talk quite a lot. You were fixing your mistakes rather than assuming you’d make them again. I lingered, wanting to know if you could. But I thought, I’m nothing but a reflection of my father, that’s all anyone will ever see in me. But not you.”\nHermione’s heart was pounding.\nHe exhaled and stared at her, eyes burning. “I had came back to show you, you were right.”\n\nAlmost everyone said that Theodore Nott marrying Hermione Granger was unexpected but not surprising. Theo had always been academically insufferable, and Granger was infamously so. The relationship could have almost been called inevitable.\n\n\nEveryone had stories about the absurdly saccharine workplace romance that unfolded. Coworkers by coincidence, they both showed up for a cancelled meeting, the waiting led to a shared project, and from there a whirlwind relationship. \n\n\nThey were engaged within a year. \n\n\nA beautiful couple, a perfect match. Despite Theo possessing the near fatal flaw of having been in Slytherin, he compensated for any suspicion held by Granger’s friends by having a tragic life story practically from the moment of conception. A mother who’d died horribly young, and a monster of a father who’d always considered his son a bitter disappointment. \n\n\nTheo had never taken the Dark Mark, he’d played no part in the war. He was self-deprecating and funny, and knew how to make people like him because he cared about people liking him. The kind of man who was perfectly happy to become ‘Hermione Granger’s husband,’ unlike the previous boyfriends who always wanted her bright but not ‘too bright’. \n\n\nDraco was happy for Theo. In a very detached and uninvolved way. He wasn’t such a cunt that he would resent his best friend for finding love, even if it was with a person he habitually went out of his way to avoid. \n\n\nGranger was, after all, a menace with a vicious protective streak, and a known right hook. Draco, in fact, knew it personally. No one was ever going to hurt Theo again, she would make sure of it. \n\n\nTheo, for his part, had spent his entire life looking for someone who’d let him love them completely. Someone to give his heart and soul to. His adoration for Granger was nauseating, an ocean of unplumbed depths. \n\n\nThe stars seemed to align for them, every piece falling into place to create a perfect match: Two positively revolting swots joined in matrimonial bliss, happy as could be.\n\n\nNo one asked Draco if he wanted to be in excruciating proximity to the entire affair, and yet he somehow was. He helped Theo plan his proposal, and then had to listen to Theo practise his speech over and over without wincing, and then illuminate over five hundred fairy lights, cue a quartet, and then fling a garden’s worth of rose petals into the air, before apparating silently away. \n\n\nHe was the best man. He planned Theo’s stag night. Slapped him across the face when he started hyperventilating, kept the rings from getting lost, and signed as witness to the union. \n\n\nWhen it was done and they were off on their honeymoon, he left the reception, and went to Greece for six months in order to detox from the entire revolting affair.\n\n\nWhen he finally forced himself to go back, he coddled himself by ignoring most of their invitations, and only accepted the ones where he could arrive late and leave early and barely speak to the hosts. \n\n\nEventually Theo stopped bothering him.\n\n\nAfter all, it was bad enough to hear how revoltingly happy they were together without seeing them.\n\n\n Malfoys were emotionally repressed on principle. His father used to say that falling in love was something only poor people did. \n\n\nIf Draco had to witness Granger making cow eyes at Theo, he would suffer indigestion, and his mother had always said he was constitutionally delicate.\n\n\nHe didn’t particularly like company anyway, and Theo’s friends were mostly Granger’s friends, which was not a circle Draco ever felt comfortable in. \n\n\nHis uninvolvement was going swimmingly until he received a short, informal note in shaky writing. \n\n\n\n‘I need to see you. Please come. Theo.’ \n\n\n\nDraco had always been better at refusing formal invitations than personal ones. What the fuck would Theo suddenly want? After all these years?\n\n\nHe tried to ignore it, but the vagueness ate at him, niggling at his curiosity until he gritted his teeth and apparated to Nott manor.\n\n\nInstead of an elf, or a butler at least answering the door it was Granger herself who opened it. \n\n\n“Malfoy, you’ve finally come. Theo will be so relieved.”\n\n\nHe swallowed hard. \n\n\nIt had been a few years since he’d seen her in person. Wasn’t she supposed to be blissfully married? Weren’t happy people supposed to glow or something?\n\n\nShe’d been glowing at the wedding. Draco remembered all clearly the way her face had lit up when all the lights illuminated and music started, and Theo, despite Draco’s repeated warnings, was on his knees reciting a poem he’d written for her. \n\n\nDraco had nearly died from second hand embarrassment. \n\n\nThe memory of how happy she’d looked while Theo compared her to the moon in iambic pentameter before hundreds of people, had been seared irrevocably into his skull. It would probably still haunt when he was a ghost.\n\n\nShe was not glowing at all now. She looked sad, and tired.\n\n\n“Granger,” he said, even though he was excruciatingly aware that she was married. \n\n\nHe expected her to correct him out of habit, and then he’d retort that she would always be Granger to him, and then they would exchange empty banter and it would pass as conversation, but instead she just said, “Theo’s upstairs,” and led the way. \n\n\nDraco expected to be led to a study, or a horrible mad scientist type lab designed for two, but instead it was a dark bedroom.\n\n\nDraco baulked at the doorway, and Granger went in. He could hear the hushed murmur of voices and then she came back. \n\n\n“He’s awake and having a good day, call if you need anything.” Then she left him there. \n\n\nDraco  watched her vanish back down the stairs before setting his jaw and entering the room. Theo was pale as a sheet, propped up with pillows, his face lit up at the sight of Draco. \n\n\n“You did come, you old bastard.”\n\n\n“Yes,” Draco said awkwardly. “Is Granger finally poisoning you for your family fortune?” \n\n\nHe’d prefer to avoid greetings or comments about how long it had been, or asking what was wrong. It was clear that something was incredibly wrong. Theo was thin and greyish, everything about him faded, not at all the picture of health Draco had assumed he would be. \n\n\nThat he was\n\n supposed\n\n to be. \n\n\nTheo gave a wan smile. “I wouldn’t blame her, but no. My mother, you might not remember, it was a maladiction that killed her. Apparently I inherited it. Another thing my father didn’t manage to beat out of me.” \n\n\nDraco’s chest clenched. “Theo, I’m—”\n\n\nTheo shook his head. “It’s fine. I’ve—worked through it. Mostly. There are stages to grief apparently. That’s what the books say. I’ve moved through denial, anger, bargaining and depression. It’s not entirely a linear process but I’m mostly at the acceptance point now. Figured we should say goodbye.”\n\n\nDraco just stared at him. “You can’t be serious. You invited me here for goodbyes? Fuck off. You can’t just give up like that. You’re married. You have a wife, you can’t die and leave—“\n\n\n“If there was a fucking cure, Hermione would have found it,” Theo cut him off, his usually soft voice hardening in a defensive way that startled Draco. “We’ve looked. We’ve tried everything. You’d know that, if you’d ever come around. She’s been trying for years. Admitting she couldn’t—she tried so hard.”\n\n\nDraco felt like he’d been struck. “I—I’m sorry. Of course you did. I’ve been away. Busy. I have responsibilities.”\n\n\nTheo rolled his eyes, shaking his head. “It’s alright, I know now why you didn’t.” \n\n\nTheo sat up slowly. His body seemed shrunken, like a breath of wind could carry him away. “That’s why I needed to see you. I wanted to apologise. I’m sorry for not realising it sooner. I should have. Looking back—it’s so obvious.”\n\n\nDraco forced a laugh. He had no idea what Theo was talking about but he was really not enjoying the conversation.\n\n\n“Realising what? What’s obvious?”\n\n\n“That you’re in love with Hermione.” \n\n\nDraco’s entire body went stiff, something inside him crumbled and died as his heart stopped completely. His voice failed him the first several times he tried to speak. He looked away, clearing his throat repeatedly.  \n\n\n“I have no idea what you’re talking about. You sound mad.” He fidgeted with the potions on Theo’s bedside table, peering at them. “What kind of potions does Granger have you on?”\n\n\nTheo slumped back, his eyes fluttering closed, his eyelids looked almost bruised with exhaustion. “I think back a lot. Mostly the years since the war, once my father was gone and things were getting better. I was remembering how much time we used to spend together. You were doing community service for probation, that elves thing Hermione founded. And I was going from one bad relationship to the next like some sad puppy.” He opened his eyes. “I was remembering how whenever I told you about anyone I dated, you always used to sneer and said they weren’t good enough for me, and gave the worst relationship advice ever. You Sabotaged me.”\n\n\n“You had terrible taste,” Draco retorted, still sorting through the potions and still not liking at all the direction the conversation was going in. “It was a mercy on my part.”\n\n\n“When I told you about Hermione, that I ran into her, and I asked you what you thought, do you remember what you said?”\n\n\n“I can’t say I do,” Draco lied. \n\n\n“You said I’d never be good enough for her. Then the next week, you came around again, and I remember you looked terrible and I assumed you’d had another fight with your parents, and you told me if I was serious, I should get a job at the Ministry, mentioned the rumour she’d had a time-turner at school. She was the only person you gave useful relationship advice about. Looking back, I don’t think it would have happened without you. Any of it.”\n\n\n“Theo—“ Draco shifted awkwardly, having run out of potions to look at, “—it was just a joke, You can’t assume things like that. Granger? Really? Of anyone I could have feelings for. Your wife?” He exhaled raggedly. “Have you forgotten our history? Unlike you, I \n\nwas\n\n a Death Eater. I was in the war. Even before then, I was awful, and they brought her to the manor and I—“\n\n\nHe’s rambling, he knew he was rambling. He needed to fucking shut up.\n\n\n “I would never have been able to—“ His voice failed and there was a stone lodged in the bottom of his throat and he just stood there trying to keep from smashing everything within reach. \n\n\nHe needed a drink. \n\n\nHe threw a hand up, suddenly angry and turned on Theo, glaring. “It was just a fucking joke. I don’t even remember it.”\n\n\nTheo simply nodded. “You were right though. I wasn’t good enough for her.”\n\n\nDraco scoffed at that, turning away, inspecting the view. “I’m sure you did just fine. I always heard that you two were revoltingly happy. People said you were like some storybook couple. You two were good for each other—that’s really all that—“ \n\n\nHe was stammering again.\n\n\nHe cut himself off. “You were happy together. Everyone said you made her happy. And I don’t do happiness, it gives me a rash.”\n\n\n“Shut up,” Theo’s voice sharpened. “Fuck. I forgot how much you talk when you’re lying.”\n\n\nHe gave a heavy sigh. “You wanted us together, didn’t you? You engineered it.”\n\n\nDraco gave a long suffering sigh. “Theo, you’re a moron. Just because you claim to be dying doesn’t mean I’m going to put up with a conspiracy theory that I’m in love with your wife.”\n\n\n“Fuck off. You were my only friend, and you were the only reason I didn’t accidentally sabotage the relationship. All the times I would have rushed things, you stopped me. You were the reason why I managed to pull off all my harebrain romantic schemes. You made it work. And somehow I ended up married with the friends and family I always wanted, that you knew I wanted, and where the fuck did you go? Where have you been since then? Not here, that's for sure.” \n\n\nDraco glanced out the window. “You wanted a new start, Theo. It was all you talked about once your father was in Azkaban. I was the past. Once you were married, you didn’t need me anymore. I was a hindrance.”\n\n\n“You manipulated me,” Theo said, looking unreasonably infuriated for someone who’d gotten to marry the love of his life. “You self-loathing fuck. You thought you had it all worked out, had everything puppet-mastered. You nudged me right into her path to love her for you. Pushed us together so you would be alone the way you’ve convinced yourself you deserve to be.” He sounded winded. “Fuck. I’d punch you if I had the strength. And the thing I’m the most pissed off about, is that I was so enamoured, I didn’t notice. I thought it all worked perfectly that time because it was meant to.”\n\n\nIf Theo was expecting a confession he was going to be terribly disappointed.\n\n\n“Maybe it did. I don’t know what you expect me to say about any of this. Even if any of that were true, what does it matter?”\n\n\n“It matters,” Theo said. \n\n\nDraco rolled his eyes. \n\n\n“It matters because you have to take care of her when I’m gone.”\n\n\nDraco’s heart stalled for a second time, but he recovered faster. “I’m sure you can get everything arranged in advance so she’ll be fine.”\n\n\n“That’s what I’m doing right now. I can’t ask her friends to do this. They love her, but they don’t understand how to care for her. She takes care of everyone, but she doesn’t remember to take care of herself. She needs someone to be selfish for her, who will do whatever it takes to put her first. I can’t be your proxy anymore, it has to be you now.”\n\n\nDraco’s neatly manicured nails were biting into his palm, he didn’t even know when his fists had clenched. “Theo…”\n\n\n“I have spent so much time worrying about her, feeling like I can’t go because who’d be here to make sure she was alright. I’ve considered everyone, and when I got to you, I brushed you off at first, because you used to talk about how you couldn’t stand her. But eventually I wondered, why did you do so much to bring us together? If you really hated her so much. You always knew what she’d like. You figured things out about her that it took me ages to piece together. And you’re actually a rather shit liar, now that I’ve been thinking about it, if you’d really hated her, you would have been a lot nastier than you were.”\n\n\n“I still don’t see the point in this conversation,” Draco said in a bored tone. “Granger can take care of herself. Especially with your fortune.”\n\n\nTheo exhaled, like he was too tired now to fight anymore. “You are missing the point on purpose and we both know it.”\n\n\nDraco did not know any such thing, still it was difficult to keep looking at Theo and he turned away. \n\n\n“You did a good job at it. I’ll admit, you are the manipulative person I have ever known, if I weren’t dying, I probably would have never known. But now it’s my turn to be manipulative.”\n\n\n“Well a good rule of thumb is not to tell the person you’re trying to manipulate that you’re doing it,” Draco said in a dry voice, turning to face him. \n\n\nTheo was holding up his wand and had a wry smile on his face. “Fair enough. But I do have one final piece of leverage.”\n\n\nComprehension slowly dawned on him. “Theo, don’t you—“\n\n\n“Draco Malfoy, it is my dying wish that you care for my wife when I am gone. Support her in her grief, and help her find joy in her future. Be there for her once I can’t be. Help her find herself again. Do you accept?” \n\n\nDeath Wishes were magic out of old grimoires. The kind that only insufferable people like Theo Nott would know how to perform. \n\n\nUsually they were curses pronounced as the person died, but a rare iteration was rather like an Unbreakable Vow. If Draco refused, Theo would not pass on after death but instead linger as a ghost, attempting to fulfil the wish himself. If Draco accepted and then broke his word, Theo would come back from the afterlife and haunt him. \n\n\nBullshit all around either way. \n\n\nTheo’s wand pulsed with magic, waiting for Draco’s answer. \n\n\nDraco stood glaring at him. “I hate you.”\n\n\nTheo glared right back. “If you weren’t such a self-sabotaging, self-loathing moron I wouldn’t have to do this. You think I want you hanging around my wife? I don’t. But being your proxy was also a shit realisation, consider this my way of getting even. You will make Hermione happy and you will get over your self-hatred and do it yourself this time or I will haunt you and I will make sure Hermione knows exactly why it is that I’m doing it. Do you accept?”\n\n\nThe magic was humming louder, growing brighter, and Theo was beginning to turn translucent as though the power was draining the remaining life from him. \n\n\n“Fine. Yes! I accept.”\n\n\nThe magic flared out and flew across the room, striking Draco and fading into him. He clutched at his chest but the light had gone. \n\n\nHe looked up. \n\n\n“Fuck you, you manipulative bastard,” Draco finally said, his heart was pounding.\n\n\nTheo just gave another wry smile. “You know, that’s exactly what I wanted to say when you walked in.” He sank back into bed, looking winded. “I’m glad you came to see me. I was starting to worry you wouldn’t and I was going to have to come up with a whole extra scheme. You saved me a lot of trouble. All worth it for Hermione though, right?”\n\n\nDraco turned without another word and headed toward the door, desperate to be gone, even though he could feel Theo’s wish like a brand inside his soul, waiting to come alive.\n\n\n“You should go see Hermione,” Theo’s voice followed him, already threatening to haunt him. “You know, she admitted once to fancying you a bit back when you were volunteering at the charity. She’d planned to ask you out, but you never came around after your probation was over.”\n"
}