{
    "id": "20729933",
    "url": "https://archiveofourown.org/works/20729933?view_full_work=true",
    "author": [
        "AyzuLK"
    ],
    "title": "Schrödinger's cat",
    "rating": "Mature",
    "archive_warnings": [
        "Rape/Non-Con",
        "Underage",
        "Graphic Depictions Of Violence"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Midoriya Izuku/Todoroki Shouto",
        "Aizawa Shouta | Eraserhead & Midoriya Izuku",
        "Aizawa Shouta | Eraserhead & Shinsou Hitoshi",
        "Bakugou Katsuki & Midoriya Izuku",
        "Midoriya Inko & Yagi Toshinori | All Might",
        "Midoriya Inko & Midoriya Izuku",
        "Tsukauchi Naomasa & Yagi Toshinori | All Might",
        "Class 1-A & Midoriya Izuku",
        "Bakugou Katsuki/Kirishima Eijirou",
        "Aizawa Shouta | Eraserhead & Kayama Nemuri | Midnight & Yamada Hizashi | Present Mic",
        "Kayama Nemuri & Izuku Midoriya",
        "Aizawa Shouta | Eraserhead & Shirakumo Oboro",
        "Midoriya Izuku & Nedzu",
        "Midoriya Izuku & Shinsou Hitoshi"
    ],
    "characters": [],
    "additional_tags": [
        "Midoriya Izuku Has a Quirk",
        "Midoriya Izuku Does Not Have One for All Quirk",
        "Midoriya Izuku Does Not Go to U.A. High School",
        "not in the beggining",
        "Telekinesis",
        "Todoroki Enji | Endeavor's Bad Parenting",
        "Dadzawa",
        "Parental Aizawa Shouta | Eraserhead",
        "Parental Yagi Toshinori | All Might",
        "tododeku - Freeform",
        "Post-Traumatic Stress Disorder - PTSD",
        "Psychological Trauma",
        "Serious Injuries",
        "Alternate Universe - Canon Divergence"
    ],
    "language": "English",
    "series": "",
    "published": "2019-10-05",
    "completed": "2019-10-05",
    "words": "31,506",
    "chapters": "6/6",
    "comments": "864",
    "kudos": "15,755",
    "bookmarks": "4,969",
    "hits": "194,133",
    "summary": "<p>The cat is in the closed box, with a 50% chance of being alive and a 50% chance of being dead. According to the principle of uncertainty in quantum physics, he is alive and dead until someone opens the box.<br>Izuku doesn't want to open the box.<br>OR<br>Izuku didn’t return home after school. Two months later he was found roaming a deserted road with white hair, psychogenic amnesia and a quirk out of control.<br>Nothing is the same after that.</p>\n<p>At first, Tokoyami didn't know exactly what to think about Izuku Midoriya.</p>",
    "notes": "<p>This is a translation of my own fanfic, O Gato de Schrödinger.<br>As warnings there are mentions os peadofilia and sexual abuse, panic attacks, torture and violence, as well as some spoilers from the manga, including the spin-off Illegals.<br>Also some grammar errors, that I hope you can help me with.</p>\n<p>My tumblr: https://aeronocacto.tumblr.com/</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>I accidentaly deleted this chapter :(<br>So here we go again!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>As you can see, events are passed very quickly when Izuku has no direct involvement, because it is written from his perspective of the situation.<br>And about Bakugou, don't worry, they'll soon make up on their own way.<br>See you in the next chapter.<br>That due to my anxiety will be soon</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>No art in this one :(<br>I couldn't resist using the “can I ask you a question?”<br>Just one more chapter and then the epilogue. The next one was one of the hardest to write, but also one of the most important dialogues for me.<br>See ya!</p>\n<p>Warnings in this chapter: The abuse Izuku suffered is told in this chapter, although there is nothing explicit or detailed, just mentioned, read carefully if there are triggers. There are mentions of paedophilia, child abuse (physical, psychological and sexual), captivity and trauma. For those who want to skip these parts of the conversation, there is a summary of the most important points in the final notes.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>- Izuku tells how his kidnapper had a mind control quirk, but this one didn't work on everyone. The greater the stubbornness of people the more easily the effects were broken. This happened to Izuku and also to Inko. Remember the man she said that she had seen? He tried to use his quirk on her so she wouldn't go after Izuku. </p>\n<p>-Izuku was held captive for a long time and eventually, his kidnapper brought Inko. Inko went out of mind control to help Izuku, but she couldn't fight him and was going to be killed. Izuku's quirk awoke to save Inko, but she was very close to him and was caught in the attack. His quirk killed her by accident. That was the trauma that made him forget.</p>\n<p>-Aizawa learns that All Might and Naomasa always suspected that Inko was no longer alive after a conversation with Nighteye. All Might tells how he met Izuku before and that after the attack in which he saved Bakugou he went after Izuku to talk, but did not find him anymore, as he had already been taken by the abductor on his return home. He felt guilty and so did everything to find him and in the process he and Inko became friends.</p>\n<p>-Aizawa learns all about the kidnapper, how he had done this before with other kids and how he was a guy whom nothing was suspected.</p>\n<p>-Aizawa helps Izuku start dealing with the trauma.</p>\n<p>PS: Yes, Schrodinger's cat has always been Inko, that why in the cover it's green. Izuku didn't know if Inko was dead or alive, until he opened the 'box'.</p>\n<p>Art from Clara, again!</p>\n<p>Next time, Epilogue and we'll have a little extra chapter with Tokoyami, about Izuku's quirk.<br>Thank you so much for all the comments, art and feedback. I'm really happy that you guys liked it.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>And that's it.<br>The art of this chapter is also Clara's.<br>I only have one thing to say at the end, as I wrote this I imagined the things I wanted to hear that would have helped me, but I wasn't sure if I could get it right. It is impossible to put yourself in other people's exact shoes because each one carries their pain differently. When I showed the conversation between Izuku and Aizawa to my wonderful friend Milly, she approved and said: “Aizawa basically used Scott McCall's psychology, that of the anchor, remember? Izuku is not alone in this, it is good that he knows it. He's so afraid of his quirk and it must be so refreshing to feel that he can have an anchor for everything he's going through. Not as something to stick you in place and keep you from moving on, but as something to keep you from drifting and getting lost. ”</p>\n<p>And I think that defines everything I need to say.</p>\n<p>Stay well and I hope you enjoyed this tour with me.<br>We'll have just a little extra soon. It'll pass before and after the epilogue, it is about Izuku's quirk. Just a fluffy funny thing with my favourite bird boy, Tokoyami. Remember when Izuku said that he was helping him?</p>\n<p>And here is the litte extra that I talked about.<br>Just some fluffy and more about Izuku's quirk and, of course, our bird boy.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>Aizawa walking with his two white haired children following him like ducklings, in company of our mama cat, Mochi, who is also a amazing babysitter for sad children.<br>A concept.<br>Also: Legacy, as a monster cat, following Todoroki around with Izuku like a lovesick puppy, because he is so warm. </p>\n<p>Thank you so much for all the amazing feedback. This means a lot for me. :)<br>I'll leave you with my tumblr if you wanna follow my content: https://aeronocacto.tumblr.com/<br>And if you enjoyed the art, here is the page of the artist: https://crazyclarabr.tumblr.com</p>\n<p>Edit: Now we have art in this chapter too</p>\n<p>The cover was made by Clara (https://crazyclarabr.tumblr.com), as well as the art that appear in the chapters.</p>\n<p>About Izuku's quirk: I got her initial idea after reading the wonderful fanfic Stygian Fire by LadyGreenFrisbe. Although they are different (in Stygian fire it's a fire quirk) I loved the concept of his quirk having a mind of its own and needing fuel, and I incorporated that here. The rest have some similarities to a certain quirk of a certain character, which you will notice later. And of course, laws of thermodynamics.</p>\n<p>Now, counting the inspiration that made me write this: I watched again The Lovely Bones and wondered what would have happened if Susie Salmon had managed to escape her killer. This movie always makes me sad, for all she could have been. Izuku is Susie who escaped, but will have to take what happened to him forever..</p>\n<p>Anyway, I hope you like the premise. Tell me what you think!</p>",
    "text": "               \n\n\"Nothing's over yet, the cat is still in there.\"\n\n\n- Emily St. John Mandel, The Singer's Gun\n\n \nHis awakening was abrupt, his breath coming out in a great gulp of air, like a man escaping from the depths and finally finding the oxygen he needed.\nHis awakening was not painless either. His hands were the main source of agony: crooked and bloody, arms so thin it took seconds to realize that they were his own.\nThe weirdest thing, though, was the weight inside his chest. Something that seemed to inflate like a balloon, taking space and his breath away, devouring him inside out.\nHe sat reluctantly, more pain present with each movement, his eyes burning terribly with the light between the trees, his ears beeping at the sounds around him. Minutes passed before he could focus, watery, confused eyes peering around, only to lose his breath again.\nRocks and fallen logs floated around him as far as he could see in the forest.\nIzuku hugged his crushed hands to his chest, his eyes wide. The pain in his chest getting worse, burning and suffocating him.\nHis eyes rolled in their sockets and everything was gone again.\n \n.................................................. ........................\nMemory is one of the most complex processes to be performed by the human brain. At all times we are acquiring, storing and retrieving information, aided by our senses, fundamental in the process of assimilation and invocation of what we have learned.\nIzuku had always been fascinated by this process, something important when doing his analysis. He knew about the areas of the brain responsible for the storage, the process of building mental palaces and, of course, factors that hinder or block this operation.\nAnd so he immediately understood what the hero was telling him. He had understood at the moment he had woken up in the forest, confused and with objects floating around him.\nBetween examinations and visits by heroes and detectives aside, he had discovered that he had been missing for two months. A few days ago, someone had reported him roaming a deserted road in another city, and took him to the nearest police station.\nHis last memory had been of returning from school after Bakugou tossed his notebook out the window, after that he only remembered waking up in the woods, alone, and how he had walked for hours until he had found a road. And now, apparently, he had a quirk. It was something he had always dreamed of having.\nHe had a quirk, a more powerful version of what his mother had.\nIzuku glanced at his hands in his lap, feeling the silent hero's eyes analyzing him from the chair beside the bed. He ignored him, focusing on the wrong angle of his fingers, even healed, and the strangely darkened nails. Scars were covering every inch he could see of the crooked fingers. He had not observed what else was wrong, but it was impossible not to realize that when he could not close his own hands.\n \"A hidden quirk can be wakened by specific triggers or, in certain cases, extreme trauma.\"\n He swallowed the bile. There was no enthusiasm for this new development. Just something dark, a heaviness in his chest whenever his breath came out of control and some object floated in the room. The mere sight of his quirk made him gag.\n \"Maybe.\" He thought as he looked up to watch the patient man from the corner of his eye. \"This is why they sent the hero who can erase quirks to talk to me.\"\n In another situation, he would have been enthusiastic about this meeting. It seemed he couldn't feel it anymore. There was nothing but that balloon in his chest.\n \"No severe head trauma has been reported.\"\n Psychogenic amnesia then. Caused by trauma. As his quirk. A quirk like his mother's, but more powerful. Powerful enough to throw doctors at the wall during a panic attack, shake walls, float objects, and destroy windows. Powerful enough for Eraserhead to be there.\n \"Can I see my mom now?\"\n The man's expression changed, his face growing uncomfortable.\n \"Izuku!!\"\n Like a trigger, Izuku felt his hands shake, his breathing increasing its pace. The weight inside expanded like a balloon, squeezing his lungs, keeping him from breathing.\n The IV bag exploded and within seconds red eyes were staring at him, strong hands gripping his arms as someone entered the room. Izuku felt suddenly cold, a chill that made his body tremble and his eyes closed without strength. A cold that would not be gone in a long time.\n Maybe it was really a good idea to have Eraserhead there.\n\n\n\n.................................................. \nThe disappearance was first reported by Inko Midoriya when her son didn't return home after engaging in a clumsy rescue in a villain attack.\n She had gone to the police station and talked about a strange conversation with an unknown man who had come to her house, but as much as she tried she couldn't remember his face or the content of the conversation, which she felt had some involvement with her son.\n They didn't immediately believe her, ignoring her certainty that no, her son would never run away from home, even after he had done what he had done. He wouldn't be hiding at a friend's house, she was sure of that. Suggestions that perhaps he had committed suicide were thrown without care, no one allowing her to pass past the front desk of the station in her hysterical state.\n An ugly part of Izuku, bitter and aware of the injustices that existed in this world, thought that part of all reluctance to see the case as a real affair had been that he was a teenager without a quirk: ordinary people used to disappear between the fingers of the system easily.\n They ignored the strength Inko Midoriya could have to protect her son; after all, Izuku had inherited his stubbornness from somewhere. In a week Inko had created a case after careful research watered by despair, and she had found similar disappearances in recent months. Inko had had to take strange streets and dark alleys and talked with suspicious and dangerous people until she had discovered a pattern that finally caught the attention of the authorities.\n There was a mobilization of the public and the media until the situation finally fell in the ears of someone doing their job right and the search and investigation began. For some reason, even All Might had been involved in the situation, being one of those who pledged to help with the search, which further increased the media coverage, people trying to understand why the number one hero was so invested in the search of a missing boy without a quirk.\nAfter weeks of going to the police station every day to get involved in the search with Detective Naomasa, one day Inko didn't show up. Her apartment was found overturned, with signs of struggle, the door wide open.\nInko Midoriya was not found.\nThree days later Izuku was spotted on the deserted road.\n \n.................................................. ...\nA stranger was staring at him from the other side of the mirror. A cadaverous face, too pale, making his freckles more apparent. His eyes looked strange, wide and dull. His mouth was in a perpetual straight line. He raised its corners slightly and the result came out strange and fake.\nHe couldn't recognize that person.\nStrangest of all, though, was what he avoided looking the most: his white hair. The term Marie Antoinette Syndrome was whispered among doctors. White hair, blackened nails.\nMemory loss, a forced quirk and now this. Three signs caused by extreme trauma. Something so intense that he had purposely buried so deep inside his mind he couldn't reach it at all.\nSomething that involved his crooked hands and the scars on his body that even with the doctors' quirks weren’t completely gone. It included awakening bloodstained in a forest after months, so thin that even after days at the hospital he could still count his ribs, feel the sharp angles of his body.\nA noise of something breaking and he saw his crooked image in the fractured mirror.\n\"Midoriya. Is everything okay over there?\"\nHe touched the glass, ignoring the pain as he cut his finger into the sharp bulge, his eyes fixed on the blood dripping on the porcelain sink. He held his breath at the image, his eyes following the falling drops.\n\n\"Blood splattered on dark walls. Screams.\"\n\n\"Shit!\"\nA close curse made him turn his head, one hand holding his wrist firmly but strangely gentle.\nHe frowned, seeing the hospital washroom door broken open. The hero looked at his hand with an unreadable expression. Very close. The balloon expanded again, his breathing ragged and his body shaking.\nSomething in his expression made the man immediately release his hand and step back, his eyes red and his hair floating.\n\"I won't hurt you. Let's see this cut.\"\nAfter that he no longer let him close the door.\n \n.................................................. ...........\nIn his dreams, there was always water. He could hear the splatters hitting the ceiling wood as he stared at the front door. The rotting wood, with grubs crawling on the surface, gave off a strong odour that made his eyes water.\nOn the other side, he could hear screams, distinct and known, uninterrupted. The cold shook his bones as he covered his ears and closed his eyes tightly.\n\"Izuku!! Open the door!\"\nHe never opened the door.\n \n.................................................. ...........\n \nIzuku knew it was logical for him to be under the guard of some hero. His mother was still missing, no one could get in touch with his father, no suspects had been arrested, and the case was still in progress. It also made sense that this hero was Eraserhead, the only one who could control his monstrous quirk, which seemed so in tune with his emotions, which made it so much more dangerous.\nStill, he felt like a burden. He wanted to go home, open the door and see his mom in the kitchen preparing Katsudon, watching him softly as he chattered about his day.\nThis apartment was unknown, with its empty walls and spacious surroundings due to the absence of the furniture that filled the Midoriya residence. There was a smell of coffee drenched in the curtains, instant food in the cupboards, and energy drinks in the fridge. A cat came to greet them at the door, meowing demandingly and sniffing him suspiciously. It was like being on an alien planet.\nStill, he couldn't complain about anything, not only because of the strange apathy that had struck him since awakening in the hospital, but also because clearly the hero, who was as uncomfortable as he was to share his space with a strange child, was trying so hard.\nEraserhead emptied the office and had the trouble of putting a bed, a dresser, and a study desk in the corner. The hero let him know that he had passed by his house and picked up some things that he would need, even though the place was still considered a crime scene and was closed.\nHis clothes were in the drawers, and his analysis notebooks were stacked on the table along with some new, coloured pens. He looked at the man standing in the doorway, his eyes following him as he studied the room. He seemed very sensitive to give him his space after what had happened in the bathroom, approaching him like a wounded animal, his hands always showing, and his posture relaxed.\n\"I thought you would want the notebooks. In addition, it was dangerous to leave this kind of information unprotected.\"\n\"Did you read it?\"\nEraserhead nodded, petting the cat in his arms. Izuku reluctantly touched the notebooks. Number 13 was missing, of course. It was gone with him. Those notebooks had always been such an important part of himself.\nHe opened one and felt a bitter taste in his mouth, his eyes unfocused.\n\"That's good analysis. Your goal is the hero's course?\"\nThe word made him hold his breath. Izuku closed the notebook, trying to control the balloon's expansion in his chest.\n\"No.\"\nHe answered softly, placing a pen that had begun to float back in place.\nIt was something everyone was right about after all.\nIzuku could never be a hero.\n \n.................................................. ...............\nThe first night Aizawa opened the door softly to check on his new housemate, only to see him awake and sitting on the bed, his back against the headboard and his eyes steady on the door, open and red.\nAizawa saw him catch his breath when he spotted him and tried to relax his body to look less like a threat.\n\"It's two in the morning, why are you still awake?\"\nGreen eyes followed his every move, his expression focused, but an obvious fear in every shudder.\n\"The monsters appear at night, Eraserhead.\"\nAizawa felt his stomach tighten at what it implied and squeezed the doorknob he held tightly for a few seconds to control himself. He picked up Mochi from his feet and put her in the bed with the boy. Immediately she went to the tense and rigid shape, small and huddled on the headboard and sat on his legs, rubbing and purring like there was no tomorrow.\nHe left the room.\nThat night none of them slept at all.\n \n.................................................. ..................................\n\n\"Damaged.\"\n\nA whispered word he heard before the door closed in his face. He sat on the bench in the aisle, his legs hanging high. Mochi was in his arms. In recent days the cat had become a strange source of comfort, and Aizawa had not objected when asked to bring her during his quirk's registration. The man must have known he was going to need her.\nHe looked at the glass wall, the parted curtain showing where his current guardian was talking to the expert.\n It was a little rude to talk about his quirk without him, but he didn't want to know about it anyway. It was ironic how he, who had always been fascinated by quirks, felt like vomiting just thinking about his own.\n He hugged the cat more, trying to catch some of her warmth. It seems cold was a reboot. This explained hypothermia whenever he lost control.\n He stared at the men, his eyes going to their lips, catching the words curiously.\n \"Broken\"\n \"Dangerous\"\n \"Trauma\"\n \"Fear of his own quirk.\"\n He frowned, his white hair falling into his eyes. White like Mochi's, who was staring at him with blue eyes. After the test room was destroyed, the balloon in his chest seemed calm. He could feel it there, but there was no expansion.\nIt needs fuel to expand. It needs heat. His father's fire, his mother's attraction. Telekinesis that needs heat to generate energy. His heat or whatever it was around.\n He closed his eyes, sticking his face into the white fur.\n They were wrong. It wasn't the quirk that was broken, it was him.\n \n.....................................\n On the return from the quirk expert, Aizawa stopped at the supermarket and filled a cart with protein bars and shakes and another with warm clothes.\n Izuku had to eat every two hours and keep up his daily calories, which he reluctantly did.\nIn a few days, he began to look less like a walking skeleton.\nStill, he was always cold.\n \n...................................\nHe dreamed of his mother. He didn't see her, but he knew she was there. He could feel her behind him, hear her voice, but she was gone when he turned. They both tried to hug each other, but they never could do it.\nShe disappeared behind that door.\n \n...............................................\nNo one said anything about the investigations, something about wanting to preserve it.\nIzuku was nothing if not stubborn, especially with the disappearance of his mother. She had fought for him, he would fight for her.\nHe was living in a hero's house, where many heroes passed by. The information was there, with the right questions. He took advantage that he couldn't be left unattended, not with a destructive quirk and no control over it. Each time he went to the police station with Aizawa he learned something new. Like the disappearances before them: 8 teenagers, same age or younger, mostly without a quirk. Except for him, everyone else was a person who wouldn't have been missed. No family, no ties, no considered role in society. If not for his mother, he might have been like one of them.\nAnd he was sure it was the same person. His mother had disturbed the pattern. He just didn't understand what was different about him for take this risk and take someone who would be missed.\n\"Naomasa asked me to control you, it's illegal to break into a policeman's office.\"\nIzuku felt his body tense, looking out of the corner of his eye from where he was sitting on the floor playing with Mochi. The man looked calm, reading some papers at the table while drinking coffee.\n\"If you want to know something, it's easier to ask me, don't you think?\"\nThe voice was sarcastic. He looked up in surprise, his eyes blinking confused, suspicious.\n\"Would you tell me the truth?\"\n\"If you don't know it yet, I don't usually lie.\"\n\"Why?\"\n\"Lying is tiring.\"\n\"No, why would you tell me?\"\nAizawa sighed and looked him in the eye. His expression was sincere. Izuku felt something strange to realize how familiar his hairstyle was.\n\"Because it's your life and your mother. You are the most interested. And I'd rather you not messing up trying to figure things out for yourself, problem child.\"\nHe had been taken by surprise. Lately, he had acquired complete distrust in adults, but Aizawa had so far done nothing but help him and give him space. Even about his quirk: as soon as they had arrived home, he had sat down and told him everything that had been discussed and given him the option of counselling when he was ready. Even though Izuku knew he would never be: he didn't want anything to do with his quirk.\nAizawa wasn't loving like his mother, far from it. Still, there was something about him that reminded him so much of her.\n\n“He cares.”\n\nHe looked at the man, struggling to make eye contact, something previously impossible since he had awakened. His lips curved slightly in an attempt of a smile. His mouth hurt from it, but he was still sure he had seen the softest dark eyes when the hero smiled back.\nFrom that moment on he stopped flinching whenever Aizawa approached him.\n \n.................................................. ..............................\nIzuku couldn't move in most of his dreams.\nA paralysis took over his body, a weight on his back. Sometimes he was huddled, arms around his chest holding him in place. A giant shadow that wouldn't let him escape.\nWorst of all was the voice. The voice never fell silent, always at his ear, speaking even when he couldn't understand it.\n\"No one will come, no one cares. Only I care about you, only I love you. You just need to love me back, Izuku. When you disappear, I'll be the one who will remember your voice. Let me hear your voice.\"\nSometimes he didn’t want to understand it.\n \n.................................................. .................................................. .......\nThere were bad days and worse days, but nights always fall into just one category. Sleeping never seemed like a good option, not when the rotted door waited for him, the screams and the pleas for mercy behind it, blood running down the floor and taking shape, trying to pull him inside.\nLately, he could feel hands pulling him, touching him, keeping him from breathing, stealing any heat he had, like his quirk usually did.\nHe often woke up to things shaking in the room, objects floating, and hypothermic, Aizawa staring at him with tired red eyes. Neither had rest anymore. Izuku knew that soon he would have to return to patrol, had heard him talk to someone on the phone, but the hero didn’t know what to do with Izuku.\nIzuku felt like a burden, with his broken quirk that took any heat out of him. He knew nothing but the constant cold. As if it had been long dead.\nMaybe he was.\n“Stop it.”\nA cup of steaming chocolate was deposited in front of him. His nose wrinkled at the smell, the heat making the terrible cold subside. Izuku lifted his head from the tabletop and looked at his guardian with giant eyes. The stern expression seemed to break a little, a smile almost coming out and he felt his hand in his hair, ruffling the sweaty strands. The fact that Izuku didn't flinch away seemed to surprise both of them for a few seconds and he curled more tightly around the sheet, the tremors slowly fading. Mochi was in his lap, oblivious to everything around her.\nHe freed his hands from the cocoon of sheets and took the hot mug closer. Aizawa walked down the hall with a trash bag and came back with the things he had broken by accident.\n“I’m sorry.”\nThe man rolled his eyes placing the bag near the door.\n“Did you break it on purpose?”\n“No, but-”\n“No 'but', it was an accident. No one learns control that easy, especially with a quirk like that.”\n“Broken?”\nHe tried to contain the bitterness in his voice, but it must have failed. He felt Aizawa's eyes on the back of his neck. He could almost see his expression, 'It's too early for that, I need coffee.'\n“Powerful. Late quirks are always more powerful and harder to control. I shouldn't have to say that, you are the expert.”\n“I'm not.”\nHe muttered and could admit that his voice sounded like a child with a tantrum at the moment. His face warmed with embarrassment when he heard a coughed-out laugh from the hero.\n“We need to replace some things.”\n“I’m sorry.”\n“I already said that you don’t have to apologize for it.”\n“But I need to!”\nHis loud voice surprised him. Izuku had been nothing if not docile for the past few weeks. Almost apathetic. Broken.\n\"I broke into your house, your life. I heard about the patrols, you can't work with me here and people are getting hurt because of me! You made a room just for me and I destroy it every night! I saw the cracks in the wall, what if one day I tear down the building!? What if pulling my heat is not enough ?!”\nThe man standing in front of him looked at him seriously. Mochi meowed in his lap, trying to reach his face. The balloon was in his chest, hitting the walls of his ribcage, expanding with each breath.\n“You just need control.”\n\"I don't want control, I don't want this quirk! I WANT IT GONE!”\nThe cup exploded in his hand, shards of china and scorching chocolate scattering on the table and in his hands. Mochi jumped in time to escape it but he saw Aizawa shrink from the scalding liquid, a flying shard slashing his cheek.\nHe focused on the red eyes in shock, cold steam rising from his mouth with the sudden decrease in temperature in his body.\n Aizawa sighed, blinking for a few seconds, his hair falling down.\n “Come here-”\n He quickly denied, rising and knocking the chair over, leaving a long space between them. Aizawa's expression became a little hurt.\n \"I won't hurt you.\"\n It was not him that Izuku was afraid of at the moment, but of himself.\n They had to lock him up somewhere with suppressants where he couldn't hurt anyone else.\n He hugged himself, his eyes focusing on the chocolate stains on his pyjamas. They reminded him of other red spots. He could almost glimpse the blood dripping on pale legs. And a voice, a voice close, very close, talking and talking.\n He put his hands to his ears and closed his eyes tightly. He felt something take over his chest, but it wasn't the balloon. The balloon at the moment seemed to be controlled by Aizawa. It was something different, something he had not felt in a long time.\n He realized that he had not cried once since waking up in the hospital.\n “I want my mom.”\n Aizawa pulled him close, slowly. Izuku allowed it.\n Maybe he was safer always near Aizawa.\n Aizawa wasn't going to hurt him, let anyone hurt him, or allow him to hurt anyone.\n He was the only safe person in his life at the moment.\n\n\n\n.................................................. ....................\n That same day they returned to the specialist for a prescription for suppressants.\nIzuku felt that he could finally breathe better after that.\n \n.................................................. ....................\n “This is Kayama. She'll keep an eye on you today.”\n Izuku looked at the woman at the door from behind Aizawa. He didn't mind looking like a child with the strength he held in the man’s shirt at the moment, his eyes studying her warily. Nemuri Kayama looked quite different from the Midnight heroine, with her button-down shirt, geeky glasses and a cat on her shoulders. Her smile was almost maternal, staring at him that way.\n He looked at Aizawa, who at the moment seemed quite stressed about having to patrol, and reluctantly let go of his clothing, greeting the woman with a bow. His mom didn't raise a rude boy.\n “Hi, Izuku! This is Sushi!”\n She pointed at the cat, who stared at him with interest. Izuku smiled shyly and felt Aizawa relax more beside her.\n While the adults talked, Aizawa explaining about the suppressants and giving some unnecessary instructions, Izuku sat with the cats on the floor.\nHe was a smart boy, he didn't need to read his file at the hospital or case to know what had happened to him, even if the word couldn't come out of his lips. He tried to drown it out of his mind as much as he could, but his dreams would not let him escape it, the scenes escaping the cracks in his mind whenever there was a trigger, hands on his body, destroying him wherever they went.\nThe signs were there, the terror near adult men quite evident. That's why Aizawa had brought Kayama-san, not Yamada, who was his best friend.\nIzuku was right about being able to trust Aizawa.\n \n.................................................. ...........\nKayama was fun. She looked nothing like his mother, but there was something motherly about her. They watched a movie and she let him chatter about his evidence board in the bedroom. There was something in her eyes that was familiar. A weird camaraderie.\nIzuku wondered who had hurt her too.\n“He likes you a lot.”\nHe looked at her curiously and the woman smiled at seeing something in his expression, the two sitting on the couch with the cats, a new episode beginning.\n\"Shota.\"\nIzuku felt his face heat up, his eyes on Mochi.\n\"Do you think so?\"\nHe whispered. Kayama laughed and squeezed his cheek.\n\"He only talks about you. He may look tough, but deep down he has a soft heart. Just look at him with those Bambi's eyes and he would do anything for you.”.\nShe winked at him and he blushed even more.\nIt was not as cold as usual.\nHe woke up sleeping on the couch, covered with cats and sheets and with the voices of Kayama and Aizawa nearby. He felt a kiss on his head and went back to sleep.\nHe didn't dream about the door that night.\n \n.................................................. ...\nIn the months that followed, Izuku managed to finish the rest of the school year in online courses. Aizawa had said it would be a good distraction, but he didn't expect Izuku to end it so quickly. During that time, the school had gone out of his mind. It felt like another, distant life.\nThat Izuku no longer existed, and he knew almost nothing about this other in his place now.\nHe felt a little bad for refusing when Mitsuki and Masaru went to the police station and spoke to Naomasa, asking to see him. The news of his disappearance and being found seemed a hit in the media for months, but soon the news died out and people forgot about the case.\nHis situation was still uncertain, and the police seemed in a dead end over his mom’s case. It was frustrating to know that the solution might be in his head, but he couldn't get what he wanted from there.\nMeanwhile, he was still under Aizawa's responsibility. And so the man had sat down and given him options about what he wanted to do about his education. Old Izuku would have clung to the situation, he always loved to learn, especially knowing Aizawa was teaching at his old dream high school. Now he had a powerful quirk, if he could get control over it, he could be a hero.\nThis new Izuku was just tired and didn't want anything to do with his quirk. He could live on suppressants, but after he had crossed the line and been hospitalized for taking too much of it, he was being controlled. This Izuku was afraid of people and crowds, of men and noise. And when he was afraid things tended to get destroyed around him. It was unwise to leave him around children.\nAn option would be home-schooling, but Aizawa worked all day and Izuku trusted no one else but Kayama, and she also had to work.\nThe solution came from an unusual place.\n“Nedzu? The principal of U.A.?”\n\"I showed him some of your analysis. He seemed keen to be your tutor.”\nIzuku didn't know what to think about it.\n\"Isn't he busy?\"\n\"Nedzu does what he wants.\"\nHe smiled a little at his guardian's frustrated voice.\n\"But he's a genius and he's willing. It's an opportunity many would want, for years he has not caught an apprentice.”\nSomething from old Izuku came up with that. A hunger for information that he thought he had lost forever.\n\"Am I going to have to go to U.A?\"\nAizawa nodded with an apologetic expression.\n\"But you won't have contact with other students and teachers if you don't want to. There is a special room for you, you’ll pass the day with him, have lunch with me or Kayama and come home. No need to make the decision now, the semester does not start yet for a few months. Just think about it.”\nIn a few months, his mother could have returned and would think of something else.\nIf all went well, he would not have to make that decision.\n\"There is one more thing.\"\nHe looked at the other with the firmness of his voice.\n\"I know you'll hate it, but you'll have to learn to control your quirk.\"\nHe began to deny quickly, hugging more Mochi to his chest.\n\"Izuku, I'm sorry, but it's the safest for everyone.\"\n\"The suppressants-\"\n“-are not meant to be used constantly. I will not allow you to destroy your body like this. I will not negotiate that. I will train you myself, with my quirk it’s ideal.”\nIzuku knew he had no choice.\nStill, he spent a week without looking at his guardian's face.\n \n.................................................. ....................\nIt was always the same door, sometimes it seemed closer, sometimes farther away.\nThe screams were incessant, he could make out his own voice, but he could hear his mom too. She was there, behind that door.\n Only if he could open it.\n Only if he had the courage.\n \n.................................................. .....................\n To illustrate the quantum principle of uncertainty and how it affects the universe, an Austrian physicist named Erwin Rudolf Josef Alexander Schrödinger conceived the so-called Schrödinger's paradox.\n It consists essentially in a thought-experiment where a cat is trapped inside a box. In it, there is also a radioactive element, a Geiger counter, a flask of poisonous gas, and a small device with a hammer. Such device is connected to the Geiger counter so that when the counter detects radiation, the hammer is released and it breaks the flask, killing the cat.\n However, this event does not necessarily happen: in fact, there is only a 50% chance that the radioactive element decays, releasing radiation. That means that there is a probability of 50% that the flask is not broken, hence that the cat is alive. But what happens inside the box is unknown to everyone who sits outside: this is why the cat is considered both dead and alive at the same time. The two realities coexist, but when the box is opened, they collide and collapse into either one of them.\nIzuku did not want to open the box.\n \n.................................................. ......................\nWriting about his quirk was a necessity. There was no escape from it: Aizawa wouldn't allow it, and Izuku really didn't want to hurt anyone if the suppressants were taken from him.\nHis quirk was strange, a mixture of his father and mom, but combined in a wrong way. It converted heat into energy that was used to move things. The problem was that there was no power off button, it was always catching heat, so Izuku's body was always cold. When there was no source of heat it consumed his fat, devouring him from the inside out and therefore he needed to eat 4 times more than he used to. It was like having a caged animal inside his chest that needed to be fed. His body was struggling to survive, so it would never grow larger than what it was at that moment and also explained why he was so skeletal when they have found him.\nHe knew now that there was a reason why this quirk had been suppressed for years, an attempt by his body to protect itself. Now it was active without a power off button. Izuku was always packed with three coats, the heater was never turned off, and the cabinets and refrigerator always had protein bars for him to consume the calories needed, especially after his training had begun.\nIzuku had felt terrible about it for all the costs, but Aizawa reassured him that all expenses were being paid by Nedzu and that the principal had enough money for it. The hero seemed really invested in it and he tried not to be suspicious but rather grateful.\nStill, a voice in his head found all this unnecessary. His quirk would always be broken. Always needing fuel, devouring everything around it and releasing destructive energy in tune with his most turbulent emotions.\nHe always wanted a quirk and now what he wanted most was that he didn't have one. He wanted to feel warm again.\nHe wished there was a button to turn off the monster inside his chest.\nSo the day Izuku met Shoto would be forever stored in his mind.\n \n.................................................. ....\nThey had gone out to buy lamps. Since realizing his fear of the dark, Aizawa had filled his room with lamps. The light and warmth emanating from them was a relief, but there were always loses when he had a nightmare and one of them exploded.\nHe was also making the effort to walk in public despite his fear of people. He no longer felt ashamed of the way he clung to the hero's arm or clothes, hiding behind him whenever he could. The sense of security came first, and Aizawa was the safest person in his world.\nThe man scowled whenever anyone looked too hard at him, but Izuku couldn't blame them. Not when he wore cold-weather clothes, clung to his guardian like a lost child and looked a little sickly. Or maybe they were recognizing him from the posters of months ago, trying to assimilate the image of the missing boy with this weirder version of him.\nMore than once someone tried to ask him what had happened, the media not having had access to the details of his 'rescue' and much less about his time in captivity. There was much speculation about why someone would capture a child without a quirk. Aizawa could block the questions with a look.\nIzuku was beginning to think he really loved Aizawa. It was hard not to be fond of someone who did everything he had done for a troubled and unknown child.\nThey were almost at the end of the shopping when things went wrong.\nAn attack by a villain took place outside the market and when Aizawa saw that no hero had appeared he had to intercede.\nIzuku tried to be brave about this. The man would be just outside, and he would be safe inside. He had his suppressants in his bag, and it would be quick. Aizawa was always fast, so reluctantly he told him to stay inside, safe near the counter.\nThey could not know that more villains would appear.\nThe screams became deafening, people rushing into the market, pushing him closer to the shelves. He could hear explosions outside when someone grabbed his arm pulling him somewhere. Maybe it was just someone trying to help him, but at that moment all he felt was more panic. The balloon expanded in his chest and the hand disappeared from his arm, the person being thrown far off the shelves.\nSomeone tried to hold him from behind and he shouted until they released him, things exploding around the place.\nHe heard shouts as they moved away from him and between his unfocused eyes, he could see the shapes around him, closing in. Voices, one near his ear speaking his name softly, holding his wrist as he hurt him, made him bleed.\nNo way out. Vulnerable. No way out.\n\n\"Help me, please. Anyone. I need help.\"\n\nThe balloon took up his entire rib cage, the surrounding temperature drastically dropping.\nThe glass door exploded.\n\"I told you to get away from him!\"\nIzuku had not realized that the low temperature around him was not caused by his quirk. The scream made him open the eyes he had closed, finding himself huddled on the floor with his hands in his hair. He looked up and all he saw was white. Ice. A barrier had formed between where he was and the people, forcing them away.\nIn front of him was someone, some distance away not to scare him, but close enough if needed them. His focus, however, was not on that. It was in the heat that they emanated. Even with ice around them, he could feel it.\nThe hungry quirk in his chest struggled like a caged animal at the feel of fuel so close.\n“It's okay.”\nThe stranger approached slowly, both of them pouring cold steam from their mouths. Between the strands of hair and half-open eyes, he watched the other. He was a teenager like him, with strange two-colour hair, as well as the eyes that watched him warily.\nIzuku tried to control his breathing, recoiling around himself more, trying to suppress the monster inside his chest. A hand moved reluctantly and touched his shoulder before he could stop it.\nThe moment the warm skin touched his, the balloon in his chest attacked like an animal spotting a prey.\nA whole side of the stranger caught on fire.\n\n\"Nothing is real until it is observed.\"\n\n\n- John Gribbin, In Search of Schrodinger's Cat: Quantum Physics and Reality\n\nIt was like starving for years and finally feel satiated. Even as the flames went out, he felt the balloon finally quiet in his chest for the first time since it had awakened. The sensation was so pleasant that he sighed in relief. The hand tried to let go of his shoulder, but he didn't allow it, gripping the other boy's wrist in his crooked fingers, a sound of stress coming out from his throat.\nHe opened his eyes and saw the stranger's alarmed and now somewhat hostile expression. He dropped the hand and cringed to himself, his voice barely audible.\n\"I'm sorry.\"\n\"What did you do? How did you activate my quirk?\"\nHe flinched more harshly.\n\" I.I don't know. My quirk ... the suppressants!\"\nHe had totally forgotten about it in his panic. He looked around for the bag, but could barely move.\nHe heard an exasperated sigh above him and the stranger pulled away from him.\n\"No, please.\"\nHis eyes closed in fear. He didn't want to be alone.\nSomething touched his hand and he opened his eyes again. The syringe with the suppressant was extended toward him. He looked at the stranger. His face no longer seemed hostile but utterly blank, expressionless.\nIzuku felt even more embarrassed for what he had done, even though it was not intentional.\n\"Thank you.\"\nHe tried to take the syringe and nearly dropped it. His crooked fingers trembled even more than usual at the moment. The other pulled the syringe back and sat on the floor.\n\"Tell me how to help.\"\nIzuku almost cried with gratitude, but he was too exhausted to do it.\nIzuku guided the stranger in the steps, applying the needle to the muscle in his arm. Some things that he hadn't noticed that were floating fell to the floor and he heard people muttering in relief from the other side of the barrier.\n\n\"So much for a normal trip to the market.\"\n\nHe sniffled shamefully, and the other boy widened his eyes slightly, looking around, seemingly wanting to be anywhere but there in that moment.\n\"Don't cry-\"\nHe started to sob uncontrollably.\n\"I want Aizawa.\"\nAizawa could make things better. He always did.\n\"Don't cry, please.\"\nOne awkward hand reluctantly started patting his head. The heat in it made Izuku move closer without realizing it. They both ignored that and Izuku almost laughed at how uncomfortable the guy looked trying to console him. The other boy seemed to have more problems with social skills than him, and that in itself was absurd.\nPeople started yelling from the other side asking if they were all right and Izuku cringed fearfully. Maybe later he would feel embarrassed to be almost throwing himself upon a stranger, but in that moment the stranger was warm and could create a barrier between him and the crowd.\nHe covered his face with his hands trying to control his breathing, his head almost touching the other's boy chest and his voice a mere frantic whisper.\n\"Don't let them in, please. Don't let them come closer.\"\nA reluctant hand touched his back, assuring him.\n\"I won't let anyone approach if you don't want to.\"\n\"Izuku!\"\nThe familiar scream from the other side of the barrier made him rise so fast that only the other's agility prevented him from banging his head on his chin.\n\"Aizawa? Aizawa!\"\n\"Shooooto! What the hell are you doing?!\"\nAn even hotter source of heat burned on the other side but Izuku ignored that in favour of the urgency of seeing his guardian. The other boy stood in front of him almost protectively, especially when the ice melted easily.\nHe saw Endeavor's burning form in his eternal scowl coming through the hole in the ice barrier, but his eyes immediately shifted to Aizawa pushing the other indignant hero from the way.\nThe boy pushed him farther back, ice forming on his arm for seconds until the red eyes stared at him.\nIzuku tried to look at his guardian behind the broad back in front of him but his head didn't even reach the boy's shoulder.\n\"Who are you?\"\nAizawa deactivated his quirk and analyzed the other teenager from top to bottom.\n\"The guardian of the problem child behind you. If you could allow me-?\"\nThe last sentence was clearly sarcastic, yet the boy finally let him pass.\nHe would not be ashamed to admit that he threw himself on Aizawa without any hesitation. His quirk seemed upset: it didn't want to move away from the heat source it had already become accustomed to.\nExhaustion immediately overwhelmed him, but Aizawa caught him easily and lifted him off the ground. He stuck his face in the hero's scarf and was finally was able to relax fully.\n\"Thank you for taking care of him. What's your name?\"\nAizawa's voice this time sounded sincere.\n\"Shoto Todoroki.\"\n\"Shoto Todoroki. Thank you.\"\nIzuku lifted his face from Aizawa's chest as he felt the fire nearby, watching Endeavor pass them by, the stormy expression meeting his eyes for a few seconds. His heat wasn't comforting like Shoto's. The quirk on his chest didn't seem interested.\nIzuku glanced over his guardian's shoulder, past the immediately departing people. Heterochromatic eyes met his own, seeming to ignore the number two hero in front of him with his booming voice.\nIzuku smiled shyly. The other boy's expression didn't change at all, but for some reason, he knew he had smiled back.\n....................................... ..\nThey received a visit from Naomasa two days after the incident.\nIzuku didn't trust the detective, not for some personal reason, but because the presence of the man in the house that he thought was his safety zone made him anxious.\nThey still had no news about his mom. Some people were talking about stopping the investigations, but Naomasa had not allowed it, even if the staff in the case had shrunk dramatically. He hadn't said anything, but Izuku knew they were waiting for Izuku to remember something. However, as much as he forced his memory, all he remembered was leaving school and waking up in the woods. He didn't even remember the villain attack and All Might saving Bakugou and him. According to Naomasa that same day, before that, he had had another encounter with the same villain and had been saved by a hero, but he didn't remember that either.\nIt was frustrating.\n\"It's all right, you don't have to force yourself like that.\"\n\"But my mom-\"\nThe man smiled, exchanging a look with Aizawa standing near the couch.\n\"Let us take care of it. We have some good heroes in the case, including All Might.\"\nHe stared at him firmly at that, as if trying to get a message across. Izuku just looked at him confused, exchanging a look with his guardian, who shrugged.\n\"One more thing, we heard from your father.\"\nIzuku tensed, wondering why he had left it for last. The man's expression was professional, but there was some pity in his eyes. Aizawa touched his shoulder and Izuku noticed that he had held his breath.\nIzuku didn't even know what to feel about this issue, not when he had learned that during his disappearance his father hadn't called once.\n\"Izuku, your father disappeared years ago. The government of Japan drowned out the news and I am not at liberty to clarify the whole situation to you, his work was confidential, even for me. Something high in the government.\"\nIzuku was confused, taking a few seconds to understand what he meant.\n\"Is he-?\"\nHe paused, trying to organize his thoughts and not feel bad for not feeling too much about it. He didn't even know the man.\n\"But what about the checks he sent to us for years?\"\n\"Ah yes. He had left an account and instructions for the employer, so that even if something happened to him, you and your mother would be financially safe.\"\nIzuku felt guilty. For years he believed that his father had left because of him, for not wanting a son like him. He had never said this to his mom, but the thought had always been on his mind since the first time a boy at school had said that to him. The feel of abandonment has always been there.\nAnd now he found that the man had done everything for his wife and son not to be left helpless. He hadn't come because he didn't care, but because he was dead.\n\"Oh.\"\nAizawa sat beside him, Mochi climbing into his lap. The adults were silent, letting him assimilate the situation, waiting for his reaction, if he would lose control again.\n\"Did mom know?\"\nNaomasa looked at him more sympathetically and nodded.\n\"I think she wanted to protect you from it. As from everything else.\"\n\"Makes sense.\"\nHe muttered, looking at Mochi in his lap. He waited for the balloon in his chest to expand, but there was nothing there.\nA certain melancholy, as if receiving the death of a distant acquaintance.\nIn his mind, without realizing it, his father had been dead for years.\n....................................... ..\nSomeone knocked on the door. Hard thuds that echoed in his head, moss and larvae falling with each impact.\nIzuku shrank back against the wall, feeling a weight on his wrist, but it was too dark to see what it was. There was nothing but dread and the door.\nInside his chest his quirk expanded and expanded until it ripped his ribcage open, a white mass that passed through his bones, crushing and pulling, destroying everything along the way.\nUntil there was nothing in his chest but a big void.\nHe felt a kiss on his head from behind and heard his mother's voice soft.\n\"I won't let them hurt you anymore.\"\n.................................................. ....\nIzuku had been training in U.A for some time, but had not talked to Principal Nedzu yet. In the meantime, he had met several teachers, but mainly Cementoss, who was responsible for rebuilding the area he destroyed with his quirk in the area they used. Power Loader was also involved, as the hero had offered to create equipment to help him with his quirk. He had seen from afar some students who attended the campus even on vacation, especially senior students or support students coming to use the labs.\nThe training was not as terrible as it had been in the beginning, at least he didn't panic whenever he used his quirk anymore. They had also discovered that when his quirk really got out of control even Aizawa had a hard time turning it off before he developed hypothermia. In these situations, he had to use suppressants and spend the rest of the day in the medical ward. Recovery Girl had seen his face more than anyone else's that year.\nIn the two weeks before the entrance exams began, the campus became more crowded. Aizawa, who had to participate in the exam planning, had to spend the day there, consequently with Izuku, who preferred to stay close to his guardian as much as possible. Perhaps it was the fact that the man could erase his quirk or that he was already hopelessly attached, but it was common to see him walking after the hero like a duckling behind his mother. If Aizawa wasn't available, he was with Kayama and he had even started to get closer to Yamada, especially noting that Present Mic was as childish as he was, so it was difficult to fit him into the category of adult enough to be afraid of.\nAnd that's how he had met Yagi Toshinori.\nThe first time he had seen him he looked strangely familiar, as if there was a name on the tip of his tongue that he couldn't get out. The man had startled him a little by staring at him unblinking for a long time from where he sat next to Aizawa in the nearly empty canteen. He had only stopped when Aizawa glanced deadly at him.\nIt took a few days for him to approach, and Izuku, intimidated by his height, had hid behind Kayama in the corridor.\n\"It's alright Zuko, this is Yagi. He is a teacher here.\"\nIzuku had looked at the man from behind her, waving shyly. Yagi smiled softly with an odd expression on his face, especially when Kayama tried to hold back a laugh, making him blush and cough. Izuku's eyes widened when he saw blood.\n\"Are you ok?! Of course not. We need Recovery Girl! Kayama, why are you laughing?!\"\n\"It's fine, young Midoriya.\"\nYagi laughed in amusement, wiping his mouth with a handkerchief.\n\"It's something that happens often, nothing to worry about.\"\nIzuku was worried. Now even more.\nYagi became, after that, a constant presence.\nThe feeling that he had known him before was always there, but he tried not to focus on that too much.\n.................................................\nIzuku saw Shoto for the second time in U.A. It was the day that he was going to talk to Nedzu, to settle his educational situation once and for all. It was also the day the recommended children were doing the interviews and demonstrations. He was sitting on a bench outside waiting for Aizawa when he felt a familiar heat. When he turned, he saw him standing a few steps away, hands in his pocket and staring at Izuku with the same expressionless face as before.\nIzuku saw behind him other teenagers leaving the building, the selection was probably over.\nThe two boys were still looking at each other and Izuku smiled faintly, trying to ignore the balloon in his chest that seemed to have awakened, floating excitedly, trying to reach what had apparently become his favourite source of heat.\n\"You're Izuku Midoriya, the missing boy.\"\nHis smile died when he heard that. He turned his head to his feet dangling from the seat. Someone seemed to have done their research after the last time. He couldn't really blame him for that.\n\"I'm not missing anymore.\"\nIzuku muttered under his breath, but the other one seemed to have heard it. He felt him hesitate before deciding to come over and sit beside him.\n\"Yeah. I realized.\"\nIzuku felt his lip curl slightly. The silence was strange. He shifted his feet slightly, wrinkling his nose when he saw that the other boy could rest his own on the floor without a problem.\n\"I haven't read anything about you being a hero's son, but that explains the widespread disclosure of the case. Although the tabloids pointed to All Might because he was so involved. I believed it myself, but I see that it was not the case.\"\nIt made him pause, staring confused at the other, his mouth opening slightly.\n\"Hero's son?\"\nTodoroki looked up at him, his forehead slightly furrowed. As if he had the right to be confused after saying something like that\n\"Eraserhead. He said that he was your father.\"\nIzuku tried to hold back the laugh but failed. The other boy looked at him a bit insulted. He lifted his hands in defense, trying to swallow more laughter.\n\"Sorry. Aizawa is not my father, he is my guardian. He's taking care of me until-\"\nThe laughter died as he remembered the situation and he turned his head down again. The other boy shuffled his feet on the cement, his expensive shoes looking weird next to his ketchup-stained sneakers.\n\"Oh. Your mother. They didn't find her yet then.\"\nIzuku nodded, wanting the other to stop the subject altogether.\n\"I-\"\nTodoroki paused suddenly and looked at him from the corner of his eye. He wanted to ask something, analyzing his expression like a terrible puzzle.\n\"Go on.\"\nHe didn't need to say it twice.\n\"They said that you didn't have a quirk, but that day-\"\nAlways the tough questions.\n\"Invisible, forced quirk. I was a late bloomer.\"\nHis voice came out harsh. Todoroki frowned slightly.\n\"Am I annoying you?\"\n\"No.\"\n\n\"A little bit.\"\n\nHeterochromatic eyes stared at him with the same puzzled face: \"You're weird, Midoriya.\"\n\"Thanks\"\n\"You're welcome.\"\n\n\"And here comes a sincere answer ignoring my sarcastic tone. Now I feel bad.\"\n\nIzuku sighed.\nIt was hard to be annoyed with someone who seemed not to do things out of malice but for a lack of social skills.\n\"You're weird too.\"\nTodoroki blinked, staring at him with the same blank expression as before.\nHis mouth quivered, but he didn't smile, his eyes staring at Izuku so intently that he felt his face flush.\nIn his chest his quirk was even more insistent, wanting to get closer.\n\"I think-\"\n\"Shoto!!\"\nTodoroki's expression closed off and he didn't have to turn to see that Endeavor was around. He could feel the heat from afar. He glanced over his shoulder and saw the hero by the door, looking their way with a terrible face. As always.\n\"Who burned his breakfast?\"\nHe covered his mouth as he realized that he had spoken it aloud. He was spending too much time with Kayama. He glanced reluctantly at Todoroki who had begun to rise and saw him make a strange expression, his face twitching between disbelief and something else. It was the most expressive he'd seen him since they'd met him.\nHe recovered quickly, but it had been too late. Izuku chuckled, noticing the other's lip trembling slightly in an almost smile.\nTodoroki nodded, walking so slowly to his father that he was sure he was doing it on purpose.\nWhen Aizawa arrived to take him to Nedzu, Izuku was still smiling.\n..................................................................... ..\nNedzu was a peculiar creature. If Izuku had met him before, he would have been prepared for defeat. There was no denying him anything, in five minutes of conversation without realizing he had already accepted the terms and was looking forward to the sessions to come.\nHe also made him nervous, there was something in his small eyes that was familiar to him, that made him feel exposed. When Aizawa left the room in the middle of the conversation to answer a call, he almost got up and went after him.\nNedzu was looking across the table at him, a cup of tea served and an analytical look, even though the smile was pleasant.\n\"Midoriya, I have a request to make.\"\nHe looked at him warily, but nodded anyway.\n\"I know you did the mandatory sessions while still in the hospital, but I would indicate seeking a therapist as soon as possible and not just because of your quirk. Aizawa agrees with me.\"\nIzuku clenched his trembling hands at his knee, staring at the door.\n\"You don't have to look at me like that, we won't force you to go. People have taken your autonomy more than once, we won't do that too.\"\nHe cringed a little at the phrase. Nedzu have read his file then. In retrospect, it should have been obvious.\n\"Things like that tend to stick with you, you can push and bury it as much as you want, but it will came back to disrupt your life. Asking for help is no shame, on the contrary, it takes courage.\"\n\"I don't even remember what happened.\"\nNedzu agreed, taking a sip of tea.\n\"No, but you can feel it.\"\nHe bit his lip and looked away. It was hard to escape the truth, the sensations. It was what kept him awake at night, which tormented him in his nightmares. Hands and voices, the feeling that he would never be clean again, that he would never be safe.\n\"I can't lie and say I know exactly what you are going through. Each one knows the weight they carry on their backs and our captivity situations were different in many ways. I don't know if you know about it, but it's no secret how I went through some difficulties at the hands of humans.\"\nHe pointed to the scar on his face with his paw.\n\"I know, though, what it's like to be in a vulnerable situation and wait for someone to come, but in the end to have be your own hero.\"\nIzuku felt the balloon expand, the cup in his hand cracked and he controlled his breath. His voice came out in a more empty and distant tone.\n\"I'm no hero. I will never be one.\"\nNedzu nodded, eyes understanding. Now he realized where he could see the resemblance. He saw a similar expression when he looked in the mirror.\n\"Maybe yes, maybe not, but you're a survivor. Just think about it.\"\n.........................................................................\nIzuku left the room with a reading list and a lot to think about.\nAizawa looked at him trying to contain a laugh and he frowned at that.\nBeing in U.A during the holidays was one thing, during the semester was another. Just thinking about the crowd of students made him anxious and panicky. Especially knowing that one of those students would be Bakugou, no doubt. Izuku didn't want to see his old childhood \"friend\". Not with an uncontrolled quirk, directly tied to his emotions and that could bring down a building in minutes.\nHe sighed, putting the sheet of paper away and hugging himself. Aizawa put a hand on his shoulders and he looked up, seeing the other's expression almost apologetic.\n\"It's gonna be okay.\"\nIzuku wanted to believe it.\n................................................ ..\nIzuku dreamed of the door, as always.\nThe rotting wood and fetid odour it emanated was already familiar, as was the noisy wooden floor, the sound of rain above and the dark place, the only light coming from somewhere on the ceiling.\nThere was something different about the dream this time, though. He was lying in front of the door, unable to move. His hands were in front of him, his fingers crooked and distorted, crushed and bloody. His wide eyes stared at feet walking around him, circling him, but he couldn't look up and see who it was. He could only see his hands and the door. An object fell in front of him and his breath caught when he saw it was a bloodstained hammer.\nHe sobbed softly, watching the feet disappear behind him, one hand touching his hair in a firm grip, forcing him to look at the door. A breath in his ear, muttering something he couldn't understand, like a sinister mantra.\nThe door moved. Something wanting to get out. He heard screams.\n\"IZUKU!\"\n................................................ ..\nWhen he woke up his bedroom window had exploded, the chaos of broken glass floating around the room. His breathing stopped as he noticed he was also floating above the bed, almost reaching the ceiling.\nKayama stood in the doorway, clutching the threshold, her feet rising from the floor and calling out his name, trying to reach him. He blinked in a daze and heard a stressed meow. Mochi stared at him from above the cabinet, a syringe of suppressant in her mouth. He raised his arms and the cat leapt to his chest.\nIzuku applied the suppressant in desperation.\n\"Izuku, wait!\"\nHe didn't think about the distance he was to the floor.\n.................................................\n\"A concussion.\"\nRecovery Girl didn't seem happy to see him early in the morning, but there was nothing to be done.\n\"It could be worse, at least I didn't break my neck.\"\nThe heroine looked unimpressed and he closed his mouth. She sighed and shook her head.\n\"Shota-Kun is being a terrible influence.\"\n\"Don't tell me that, Zuku trained the cat to bring in the suppressants.\"\nIzuku smiled slightly at that, Kayama, after the fright, was trying not to laugh as she remembered the situation. Apparently, it was funny to wake up and see things floating around the house.\nHis quirk was weird.\n\"You're weird, Midoriya.\"\n......................................................... ...\nIzuku had already started sessions with Nedzu when the U.A semester finally began.\nSince he wasn't really a student, he didn't have to wear a uniform, and Aizawa didn't comment when he saw Izuku wrapped in a coat that was clearly his, big enough that he had to roll up the sleeves for his fingertips to appear. He needed some comfort, even if he wasn't leaving his office until Aizawa picked him up, the campus would still be very noisy, and it would be the day he'd spent the longest time away from Aizawa since they'd met.\nHe wrapped himself in a yellow scarf Kayama had given to him and threw the hood over his head, hiding his flashy white hair. He checked the suppressants and all the daily protein bars he had to carry, his reading material, and the exercises he'd done at home.\nHe nodded, taking a deep breath as Aizawa waited patiently at the door.\nHe put the heavy pack on his back and walked as confidently as he could, but before going over the threshold a hand stopped him. He swallowed and looked up suspiciously.\nAizawa rolled his eyes and turned him around, opening his backpack and pulling Mochi out of it.\n\"No cats allowed inside the school, Izuku.\"\n\"But-\"\n\"No buts.\"\nHe stared at him, eyes wide and begging. Aizawa sighed and dropped the cat into his arms.\n\"You're going to talk with Nedzu about that.\"\nHe nodded quickly, Mochi looked pleased now that she was out of the backpack. Aizawa grunted while he was closing the door.\n\"Get that smug look off your face. You remind me a lot of another idiot. He once found a stray cat and brought him to school every day, he wanted to give the poor thing human food too. If it wasn't for me to feed the cat he would have made it sick. If Nemuri hadn't fallen in love with the cat he would have hidden it in his bag until the end of the semester.\"\nIzuku looked interested. Usually, Aizawa wasn't so talkative in the morning. Or in general.\n\"Sushi?\"\nHis guardian nodded, opening the car door, before checking his pack for bars protein and suppressants.\n\"And your friend?\"\nAizawa pressed the steering wheel, silent for a few seconds before starting the car.\n\"His name was Shirakumo.\"\n\n\"Was.\"\n\nIzuku didn't ask anymore. The two went quietly to U.A.\n.............................................\nIzuku was already two weeks into term when the inevitable happened and he bumped into someone he didn't want to see. Until that moment he had managed to avoid contact with the students, studying with Nedzu, taking lunch with Aizawa, Kayama, Yamada and sometimes even Yagi, although always when Kayama was around.\nThe most exciting thing that had happened was to see All Might walking on campus through the window. Who knew there was still a bit of the old fanboy inside him?\nIzuku was still training in one of the free zones when Aizawa released the class, both returning home at night, where the man would patrol and he would stay with Kayama or Yamada, never alone, especially after the last incident with his telekinesis.\nIt was a busy routine, but he was getting used to it.\nAnd like every time that things were going well in his life, something had to go wrong.\nHe bumped into Bakugou.\nIn retrospect, leaving the safety of his classroom had been a terrible idea. Mochi had left and they were in class time, so he felt safe enough to look for her. Then he found the students' graduation plates and tried to find All Might's, getting terribly suspicious when he noticed the missing space. The sign had been removed and, by the condition of the wall, it had been recently done.\nIt was a mystery and Izuku was distracted by it or he would have noticed the heat getting closer.\n\"Deku?!\"\nThe name chilled him in place, and he looked slowly to the side where he met red eyes in a very 'Bakugou' expression which involved anger, confusion and the promise of explosions.\nIzuku knew that well. He knew the feel of those explosions on his exposed skin and the sharp tongue distilling every insecurity of his. Until that moment he wasn't sure why he had avoided seeing Bakugou so much, or when he had become Bakugou and not Kacchan in his mind. Years and years of abuse, but it had been something he'd clung to. Maybe because he was his first friend, or because, in his own way, Bakugou was the only one who really saw him. The fact that the strongest boy he knew seemed to see him as competition enough to try to make him give up was almost a compliment and Izuku had clung to it.\n\n\"Maybe one day I'll have Kacchan back. As a friend or as a rival. As an equal.\"\n\nIt was an illusion of an older Izuku. The Izuku who wanted to be a hero.\nThe Izuku who still was a good person.\n\n\"He left me behind.\"\n\nThe ugly thoughts inside his mind finally gained a voice.\n\n\"If you had waited for me, if you were with me as you promised when you were my Kacchan, I would not be what I am now.\"\n\nInside his chest, his quirk expanded, awakening.\n\n\"I saved you. Where were you when I needed to be saved back?\"\n\nIt was an ugly and unfair thought, just one more thing that he had unlocked and couldn't lock back.\n\"Deku.\"\nThe repetition of the name this time was almost uncertain, the red eyes seeing something different than before. Izuku wanted to laugh, laugh or cry. Bakugou was talking and talking now.\nAngry eyes and clasped hands, for him it was always a fight. He was getting closer and closer, still talking, but Izuku couldn't understand any of it, not when covered behind the ugly voice in his mind, and the furious quirk in his chest, howling for liberation.\n\"Damn you! Why won't you say anything?\"\nHe frowned, trying to reach whatever fear he felt, nervousness, something common between them.\nAnything but that ugly feeling that burned in his chest.\n\"Where is Aunt Inko? The old hag is crazy of worry, you bastard! Have you been here all the time? Do you find it funny?\"\nIzuku closed his eyes and clenched his jaw, trying to breathe, focus, soothe the balloon in his chest, the monster inside that wanted to destroy things.\nA hand gripped his wrist and he opened his eyes, staring at the red ones.\n\"Bakugou.\"\nJust one name, but that seemed to destabilize the other so much that it would be funny in another situation.\n\"Let me go. Now.\"\nHe owed Aizawa not to lose control, he had to get out of there.\nBakugou gritted his teeth and he knew what would come before he even raised his hand. \"What's going on here? Hey! Bakugou? Who is that?\"\nA blast near his face, his quirk sucking the heat even before it got too close. His vision clouded and he let the balloon expand in his chest, the plate glass exploding in the hallway.\nThings went bad pretty fast from there.\n.................................\nLater Izuku would learn that it all ended very quickly, even though it seemed like an eternity when it happened. He remembered sounds and things breaking, screams all around. The clearest though was when he noticed the known heat, followed by an abrupt temperature drop. There was an ice barrier in front of him and someone holding him while he struggled like a lunatic.\n\"- doriya! Izuku!\"\nAs fast as he had lost control the balloon calmed in his chest. His eyes focused and he saw frightened students. Bakugou fell to the floor from where he was against the wall, held by his quirk. One of the students ran and tried to help him up, being pushed away.\nHe looked up and met Todoroki's eyes, his hands holding him by the waist from behind, an older student standing in front of the others children like a protective barrier. Against him.\nBecause Izuku was dangerous. Izuku was the villain.\nHe tried to say something, but his throat was closed. He let his body go slack and docile, his weight being secured from behind and preventing him from falling.\n\"You are so cold, Midoriya.\"\nHe turned in Todoroki's grip, closing his eyes and sticking his face into the other's boy chest, trying to find the known heat to escape the eyes of the others.\n\"Midoriya?\"\n\"Is he okay?\"\nSomeone asked hesitantly, footsteps approaching. He shrank closer to Todoroki, wrapping his arms around him. To his surprise he hugged him back, stepping back and bringing him along.\n\"He doesn't like people on him. Stay away.\"\n\"Dude, he's kind of clinging to you.\"\nYeah, but Todoroki wasn't like the others. His quirk was calm in his chest, controlled even without suppressants. He was as safe as Aizawa at the moment, the heat feeding his quirk, the cold preventing it from attacking. Todoroki was the probably the closest anything would ever come to an off button.\nIt was a bit funny.\n\"Why are you chuckling?\"\nTodoroki's voice sounded confused, exasperated. Izuku gave a little laugh and then the first sob came out.\n\"I want Aizawa.\"\nIzuku burst into sobs, ignoring the voices around, focusing only on the strange comfort coming from the other boy. He felt Todoroki running his hands awkwardly in his back, both of them sitting on the floor near the wall. He moved closer to him without realizing it, hiding his eyes from the destruction around him.\n\"Iida went to call Aizawa-sensei.\"\nA female voice warned. He glanced from where he was still on Todoroki's lap and saw a girl with a ponytail. She had sat on the floor nearby, but not so close that it bothered him. He saw that others did the same thing looking worriedly at him. He raised his head a little as he saw a boy with a rock face with something known in his arms.\n\"Mochi.\"\nHe whispered and the cat jumped out of the stranger's arms, coming to him and climbing into his chest.\n\"Koda can communicate with animals, he said she was looking for you.\"\nThe girl spoke gently. Izuku sank his face into the white fur, the purr comforting him immensely.\nPerhaps later he would be mortified by the situation. He was in Todoroki's lap, absurdly afraid to step back and lose control again, sobbing in front of strangers like there was no tomorrow.\nAt that moment he just closed his eyes and drifted.\nWhen he was aware of his surroundings again, he was on a familiar couch in the staff room, huddled against a body, feeling a warm hand on his shoulders. He blinked, hearing low voices and smelling coffee.\nThe sensation of cold and heat made him wake up at once, his eyes following glossy shoes and long legs in a uniform, rising until he met a familiar face.\nHe stared stunned at the other boy, who was looking back at him in the same blank expression as usual.\n\"Todoroki?\"\n\"Midoriya.\"\nHe blinked again, the other still looking at him. Todoroki's expression was terribly similar to Mochi's.\n\"Why are you here?\"\nThe other raised an eyebrow.\n\"I study here, Midoriya.\"\n\"I think he's asking why you are both cuddling on the couch right now.\"\nHe looked ahead and saw Kayama give him a wink before going back to her computer.\"\n\"Oh.\"\nTodoroki nodded in understanding.\n\"You attacked Bakugou and almost destroyed the building-\"\nIzuku cringed at that, yeah, he remembered that part.\n\"Then you clung to me and wouldn't let me go, even when Aizawa-sensei arrived. For some reason, he seemed upset about it.\"\nKayama hid a laugh in a cough, still typing.\n\"So I had to come with you as things started to explode when I tried to leave. Sensei said he'd come for you when you woke up.\"\nIzuku was mortified.\nHe wanted to disappear from there, maybe leave the country and change his name would be ideal.\nHe released the other quickly, ignoring his quirk that didn't want to be far from the heat. That behaviour was a little worrying.\n\"I'm sorry, I-\"\nTodoroki stretched like a cat, his bones cracking, and Izuku felt even worse at the slight discomfort of his position.\n\"I think I can go now, I'll let Sensei know that you're up.\"\nHe didn't realize what he was doing until he grabbed the other's wrist quickly. They looked at each other and his eyes widened while he blushed terribly.\nTodoroki looked at him questioningly and Izuku released his wrist.\n\"Sorry, my quirk likes you.\"\n\n\"Kill me.\"\n\nYamada stood in the doorway, a smoothie straw halfway to his mouth, staring at the intriguing scene happening there.\nTodoroki frowned slightly, his face turned like Mochi when she found something curious.\n\"Your quirk likes me. What do you mean by that?\"\n\"It thinks that you're hot.\"\nIzuku's eyes widened again. Yamada gasped and Kayama patted his back, a terrible smile on her face.\n\"No, not quite that! It's the heat, my quirk likes your heat! That's why it reacts like that. Oh sorry.\"\nIzuku looked out the window, wondering if he could jump to get out of the situation. Todoroki blinked repeatedly and then nodded seriously.\n\"It activated mine that day. Makes sense.\"\n\n\"Does it?\"\n\n\"I'm curious, Midoriya.\"\nIzuku was too.\n\"Can you give me your number, Midoriya?\"\nKayama dropped something behind him. Todoroki still stared at him impassively.\nIzuku's brain took a while to restart.\n\"Oh! T.to talk about the quirk. Right, sure.\"\nTodoroki nodded again, his face serious. His eyes sparkling with puzzlement, he muttered something under his breath about theories and pulled his cell phone out of his pocket and handed it over to put his number. Izuku was lucky that Todoroki was so weird and didn't run off the roller coaster that was that conversation.\nWhen he finally let the other go Izuku wanted the floor to open and swallow him, sticking his face into the couch with a growl that resembled a suffering animal.\n\" 'My quirk likes you.' Smooth, Zuko!\"\n\"But it's true!\"\n\"Oh my god! Was that why Shota was in such a bad mood?\"\n\"You should have seen his face when he came in with them, the hurt and the rejection because Zuko was clinging to Todoroki and didn't want him.\"\nThese two were terrible people and Izuku didn't want to know about them anymore. Mochi jumped on the couch and he hugged her.\n\"Oh, don't look so down, little listener! You even exchanged numbers.\"\nKayama pretended to wipe a tear: \"Our baby is growing up, Zashi.\"\n\"I know! It seems like yesterday that he was just a little baby clinging to Shota's shirt.\"\n\"Zuko, don't make that face. You should have seen him staring at you while you're sleeping. I've never seen anyone so focused on anything, it was a little scary. Lucky for him Aizawa didn't see it or would have hung him with his scarf.\"\nIzuku preferred to ignore them, he had bigger problems. And as if reading his thoughts Aizawa entered the room at that moment, his expression blank except for a frown of concern on his forehead. Izuku looked at him over the couch but couldn't hold his gaze, shifting it to his own feet. The situation hit him like a rock in the face. He had attacked Bakugou and destroyed school property, even after all the control Aizawa had been trying to put on him. Izuku had just proved that he was dangerous.\n\"I'm sorry.\"\nAizawa sat beside him and the other two had stopped laughing. He felt his guardian's hand on his face, lifting his head up and preventing him from looking away. Izuku grabbed his wrists but didn't try to escape. Aizawa still had the same blank expression.\n\"What happened?\"\n\"Bakugou-\"\nAizawa pursed his lips, his expression turning sour.\n\"I already talked to him, I want your version of things.\"\n\"I-\"\nIzuku didn't know what to say. Aizawa waited, trying to keep his patience.\n\"We have met before. We have problems. He confronted me and didn't let me back down. I lost control.\"\nIt was as succinct and truthful as it could be. From the man's expression, his version had not been so different from Bakugou's.\n\"You didn't use suppressants.\"\n\"Todoroki helped me. My quirk likes him.\"\nAizawa's eyebrow twitched and he heard a laugh behind them. He didn't know why they were laughing, it was the truth.\n\"Does it now? Interesting.\"\nIzuku nodded.\n\"Heat acts as fuel, cold prevents it from getting out of control. In that day my quirk activated his too.\nIt's weird\".\n\"Yeah. Weird.\"\nWeird was Aizawa's look at the moment.\nThe man released his face and sighed, running a hand over his tired eyes.\nIzuku felt even worse. He didn't want to worry Aizawa like that.\n\"Aizawa, the things I destroyed-\"\n\"Don't worry about it. Cementoss and Nedzu have taken care of it. And don't look at me like that, you lost control. It was bad, but not as bad as it could have been.\"\nIzuku frowned and the man pinched his nose tightly.\n\"Problem child, stop it.\"\n\"But-\"\n\"Do you have any idea how oddly strong your quirk is? The control you had to destroy just a few things and throw Bakugou away is already a victory.\"\nHe tried to strangle Bakugou on the wall too, but if he didn't tell it, sure thing Izuku wouldn't either.\n\"But I shouldn't have left.\"\n\"You are not a prisoner here, Zuko.\"\nKayama looked at him softly.\n\"You can go out on campus if you want, just know what you can handle and talk to one of us first if possible. The only person who created the no-leave rule was you.\"\n\"Just a warning that my students now seem very interested.\"\nAizawa said it as if it were something terribly inconvenient. Izuku didn't know what to think, but spending more time with Todoroki didn't seemed like a bad thing.\nHe looked at the phone in his hands and almost smiled.\nAt least one good thing happened from this mess.\n............................................................................\n\nS.Todoroki: \nDoes your quirk acts as something with its own mind?\n\n\nIzuku: \nYeah, especially when it requires fuel.\n\nTalking to Todoroki in person and by message was not much different. There was the same strangeness, the way he understood everything to the letter, unaware of sarcasm and with a tendency to be extremely sincere, which in some situations resembled being rude.\nHe soon realized that his initial analysis was true: Todoroki was socially unfit.\nStill, there was something nice about talking to someone like that. When you understood Todoroki it was impossible not to like him. Yeah, he was resentful, socially strange and stubborn, but he was also kind, selfless and truly curious. His tendency to throw himself into conspiracy theories was something the he and old Izuku would have much in common, and often Izuku found himself smiling reading his messages, even if they were about such an unpleasant subject as his quirk.\nJust because he had learned he needed to know and control his quirk, it didn't mean he liked it. There were days when the balloon in his chest gave him the same gagging sensations as the first time.\nS.Todoroki: I give up, Midoriya. Your quirk makes no sense at all.\nS.Todoroki: There's a boy in my class with a quirk who is a living shadow, maybe you should talk to him.\n\nIzuku: \nReally?\n\nS.Todoroki: Yes, he has a crow head. Is anyone like this in your family? Maybe you are cousins? Maybe your quirk will take shape too.\n\nIzuku: \nTodoroki? Are you kidding me?\n\n\nS.Todoroki: \nNo? Why would I do that?\n\nIzuku laughed softly, Mochi dozing in his belly, both lying on the couch.\n\nIzuku: \nAnd you say my quirk is weird.\n\nS.Todoroki: You didn't answer me.\n\nIzuku: \nOmg, no, there's no one bird-headed in my family.\n\n\nIzuku sent a picture.\n\n\nS.Todoroki: \nWhat is that?\n\n\nIzuku: \nA meme?\n\nS.Todoroki : ?\n\nIzuku: \n???\n\n\nIzuku: \nDon't worry Todoroki, I'll teach you.\n\n\nIzuku: \nI will undo this injustice.\n\n\nS.Todoroki: \nYou're weird, Midoriya.\n\n\nIzuku: \nIs that bad?\n\nHe watched him type something for a long time and felt strangely anxious about it.\n\nS.Todoroki : \nI don't think so.\n\n\nIzuku: \nI should be offended by the delay.\n\n\nS.Todoroki: \n:)\n\n\"Why are you smiling at your phone, problem child?\"\n\"It's nothing!\"\n...................................................\nIzuku watched his cell phone vibrate during lunch, still tucked into the staff room like a fugitive, Aizawa taking a nap in his sleeping bag in the corner.\n\nS.Todoroki: \n?\n\n\nIzuku: \nWhat?\n\n\nS.Todoroki: \nSensei talked to me.\n\n\nS.Todoroki: \nAbout participating in your training?\n\nIzuku choked on his food.\n\"Aizawa?! What?\"\nThe man scowled at him for disturbing his nap, already well aware of the matter.\n\"You said your quirk likes him, I was curious.\"\n................................. ..\nIn the days that followed Todoroki became part of his routine.\n..................................\nThat day Izuku felt restless. His quirk seemed more troublesome than usual and Nedzu cancelled some lessons because he was making things float by accident. When it was like this, he always stuck to Aizawa, but it wasn't an option with him off-campus.\nKayama withstood his humour with mastery, used to Aizawa bad days after years too.\nOver the hours the feeling just got worse and Izuku found himself having a sudden crisis, the windows cracking as he sobbed his heart out. In the end, he had to use a suppressant when things started to break in the room, no one being able to calm him down.\nIt was a good thing they used the suppressant because minutes later they learned of the attack on USJ.\n.............................. ..\nIzuku was there when they got him out of the ambulance and could only see blood. He didn't remember much after that, having suffered a strong dissociation. The image of his guardian overlaid on another he didn't understand, blood dripping and a form on the floor crooked like a broken rag doll.\nWhen he came to his surroundings, he was sitting on the floor in front of the operating room. No one could get him out of there after that. Kayama, Yamada, even Nedzu had tried, but he remained seated in one place, hugging his knees and staring at the door. The suppressant was still in effect, which was fortunate, therefore he didn't feel Todoroki approaching.\nThe other sat quietly beside him and he saw that he looked dirty but fine. No injuries. Todoroki shoved two cereal bars into his hand, and he realized with some distance that they probably have brought Todoroki there for that. It wasn't a good idea for Izuku not to eat, or his quirk was going to start devouring him.\nHe stared at the bars doing nothing, his eyes returning to the door.\nA warm hand touched his. He glanced sideways and Todoroki stared at him steadily. It was a look that said if he didn't act soon he would knock him down and make him eat.\nIzuku started to eat after that.\nIn the end, he pulled him close, saying something that he ignored, his eyes on the red lights above the door.\nHe didn't even notice when he left, feeling only then the absence of heat.\n....................................................\nAizawa was there, like a bandaged mummy, but alive.\nThey stared at each other for long seconds. Izuku wondered how he was seeing him, dirty and red-eyed, as similar as it was months ago.\nRecovery Girl said something to Kayama but he ignored them as he had ignored everyone who had tried to get him out of the door in the last few hours or prevent him from following the stretcher when they took him to his room, where he sat back facing the door until someone let him in.\nIzuku was afraid to turn his back and never see Aizawa again, as he had not seen his mother again.\nThe man nodded slightly and Izuku approached the bed, fitting into the free space and lying there.\nOnly then could he breathe properly again.\n..............................\nIn the end, what drove him off on campus was not his curiosity, but the need to be around Aizawa since the incident.\nThe man was too stubborn to stand still and wherever he went Izuku would go, so when he insisted he could teach, Izuku looked at Nedzu who sighed but nodded in agreement.\nHe couldn't blame people for watching as they passed in the corridor. Aizawa looked like a mummy, and Izuku was a strange child without uniform, wearing a huge coat, clinging to an adult's shirt and making things float wherever he went.\nHis quirk looked as restless as he was, but at least not in a destructive way at the moment. It was common now for things to float when he was feeling anxious.\nIzuku bowed his head and tried to control himself, to ignore the sensation so many glances made him feel.\nWhen they finally reached the room and Aizawa kicked the door open, he almost gave up when he saw everyone looking at him.\n\"Deku?!\"\nBakugou started to rise from his chair, but one look from Aizawa and he reluctantly sat back down.\nIzuku ignored him, blatantly hiding behind his guardian.\n\"Hn, Sensei?\"\n\"Yaoyorozu?\"\n\"Good to see you're all right, but shouldn't you be resting, Sensei?\"\n\"Yeah! And who is this?\"\n\"Ashido, sit. I'll explain soon. And this is Midoriya.\"\nTodoroki met his eyes and pointed to a chair beside him. Izuku looked at his hand holding Aizawa's shirt and then at the chair, and back again a few times.\nAizawa sighed and looked down at him.\n\"Yes, go. Or I won't be able to teach with you over me.\"\nHis face flushed and he heard some chuckles.\nHe released Aizawa reluctantly and went to sit with Todoroki, near the same ponytail girl who had spoken before. She smiled curiously in his direction.\nTodoroki pulled his chair closer and he saw some of the students turn their heads trying to get a better look of them, until Aizawa caught everyone's attention forward.\nIzuku approached Todoroki like a cat toward the heat.\nHis quirk in his chest finally calm.\n \n \n\n “There are all kinds of addicts, I think. We all have pain. And we are all looking for ways to make the pain go away. ” \n\n\n - Sherman Alexie, The Absolutely True Diary of a Part-Time Indian \n\n \nTodoroki became a common face during Izuku's training. \nAizawa made it count as an extracurricular activity, but  the truth was that Endeavor had not been happy about his son having to train after class, because this would make him unable to train with him at home. Nedzu spoke to the hero, who eventually had to agree with him. \nIzuku was right, Nedzu was good into getting what he wanted. \nTodoroki seemed especially happy to do something that had irritated his father and yet freed him from the training that he clearly did not want to attend.\nThe funny thing was that Todoroki wasn't exactly helpful in the training. \nThey had tested why Izuku's quirk was fixed with Todoroki's, but nothing was conclusive besides that his quirk was weird. Evenmore, Todoroki refused to use his fire to test anything and the insistence only drove him away for a few days and lead to him not answering Izuku's messages. So apart from when he activated his quirk by accident, Todoroki didn't really do much but participate in the warm-up, unleash bizarre theories about Izuku's quirk, and act as a weight when Aizawa made Izuku lift him in the air.\nAizawa let him stay for perhaps the same reason as Todoroki: to annoy Endeavor. He didn't seem to be much of a fan of the other hero. Or maybe it was because the other teenager's company was an incentive for Izuku to socialize.\nIzuku would have laughed in his face if he had no control, because the thought that Todoroki would help him socialize was hilarious.\nIzuku, however, had nothing to complain about it. He was very fond of Todoroki's company, even when he insisted on trying to make combo attacks with him, as if Izuku would one day need it.\n\"I'm not training to the heroes class, you know that right?\"\nThey walked across the nearly empty campus, Aizawa falling behind to pack up and talk to Power Loader about something they couldn't know.\n\"Then why are you doing this?\"\nIzuku wrinkled his nose.\n\"Because if I can't control it, I could destroy everything. This  thing  is broken.\"\nTodoroki looked at him sideways, a curious expression on his face.\n\"Do you hate your quirk or are you afraid of it?\"\nIzuku didn't answer, turning his face away and looking at the lights of the main building, or he would call the only friend of his age a hypocrite on his face.\n\"Izuku-\"\n\"Deku.\"\nThey both turned at the same time, seeing Bakugou leaning against the wall of the building. Waiting for him, even though the class had ended two hours ago.\nIzuku expected to be defensive but he was too tired. Days avoiding Bakugou did that to you.\n\"Bakugou.\"\n\"Half-and-half, what are you doing here?\"\n\"He is with me. What do you want ?\"\nBakugou took a deep breath. When he lifted his head, his expression was the most neutral Izuku had seen in years. Or ever.\n\"Can we talk?\"\nMaybe it's the fact that Bakugou didn't ask for anything, he just demanded what he thought he was entitled to. This was something new. \nOr maybe because Izuku felt that he needed it too, this talk.\n\"Fine.\"\n………….\nTodoroki coming along was nothing new, Izuku knew he wouldn't leave him alone with Bakugou. And really, he didn't mind talking in front of him. Bakugou complained, but when Izuku shrugged he couldn't do anything about it.\nThe three of them sat on the floor in front of the main building, leaning against the wall and near the shadows, so that they would see when Aizawa came.\nIzuku felt calm, his quirk sated and his bones tired. His mind was clear, unlike the last time they had seen each other. Todoroki sat beside him, the comforting warmth helping him, as always. \nBakugou looked at him in the same neutral way as before. He wondered who finally had gotten into his head that screaming would give him nothing in this situation. \nLike this, he could see more clearly the differences from the boy he had seen months ago. This Bakugou looked tired. There were dark circles below his eyes, which also looked different, older. \n\"What happened, Deku?\"\nIzuku looked at him, his face turned slightly, still silent. Bakugou clenched his jaw, but his voice was almost calm.\n\"You're gone. Your mother was crazy trying to find you, she disappears and you show up, different with that hair and  a quirk .\"\nIzuku sighed, his eyes focusing on his crooked hands.\n\"I don't know.\"\n\"YOU-\"\nBakugou took a deep breath, seeming to regain control.\n\"You don't know.\"\nHe looked disbelieving. Incredulous. Izuku bit his cheek inside and looked at Todoroki, who was also looking at him with mild curiosity.\n\"The last thing I remember is getting my notebook from where you threw it.\"\nThey both stiffened at that, but Izuku ignored them, fiddling with dark nails.\n\"I went through the school gates and everything goes dark after that. I woke up in the woods, not knowing how I got there and with this ...  quirk  out of control. I walked for a while until I got help. They said that ... hum, it was too traumatic and so I just-\"\nHe gestured with his hands, unsure of how to finish, but they seemed to understand nonetheless. He noticed them watching his hair and then his shaking hands. Todoroki took one of them and squeezed it lightly.\nIzuku didn't care. It seemed like a natural thing to do. His voice was soft, a tone of sudden understanding.\n\"You said your quirk was forced to appear, so that's why.\"\nTodoroki was more perceptive than people credited him for. Izuku nodded, his eyes focused on their hands.\n\"You don't remember.\"\nBakugou's tone had an unknown emotion, but he didn't look up to see what was it.\n\"The villain's attack? All Might?\"\nHe shook his head.\nThe three were silent for a few seconds when he noticed the same strange voice in Bakugou.\n\"Deku ... Izuku. Look at me.\"\nHe looked up at that, surprised. Bakugou's eyes were tormented. There was some humidity there that left him dumbfounded and silent. He hasn't seen him cry in years. Or call him by his name, for that matter. \n\"I was the last person who saw you before you disappeared. Two corners to your house, that's where I left you behind. You never came home.\"\nIzuku understood there that Bakugou felt responsible for what had happened. The same way that he had blamed him during their fight. After cooling his head he felt terrible about it.\nBakugou was just a boy.\nAn arrogant boy with a powerful quirk and skills, but just a boy. What could have he done differently? Would it have changed anything? \nIzuku was just sure he didn't want what had happened to him to anyone, much less Bakugou.\n\"There was no way you could-\"\n \"Shut up!\"\nHe closed his mouth, watching the other sniffle. He no longer felt angry with Bakugou. He only felt pity for such a big burden at his back, but he knew him well enough to know he wouldn't appreciate it, so just fell silent.\n………… ..\nWhen Aizawa arrived the three were still silent.\nHe looked at them, assessing the situation. Bakugou with red eyes, Todoroki looking solemn while holding Izuku's hand in comfort.\nHe sighed and took them home.\n…………………\nThe next day Izuku accepted Nedzu's offer and hesitantly began to seek therapy.\nHe wanted to make sure that no ugly thoughts like before would take shape. He would not let what happened to change him more than it already had done.\n……………… ...\nThe date of the sports festival came fast and in the days until then Todoroki seemed more and more strange. His messages were vague and he threw himself into practice with ferocity, willing to win the competition at all costs.  Izuku couldn't understand what was happening but tried to encourage him positively. \nHe also noticed pretty fast that there was something extremely wrong about Todoroki's home situation and his relationship with his family, especially his father.\nHe didn't understand much about fathers, never having one, but he liked to think that Aizawa-\n“Better not even think about it. Nope, I'm not going there. ”\nIzuku had a terrible habit of clinging to people. \nHe was even getting closer to the rest of Aizawa's class lately, since it was common to see him with Todoroki and they knew there was something strange about his volatile relationship with Bakugou. Izuku no longer had lunch alone or with the teachers, that was a fact.\nWhen the festival arrived Aizawa was still bandaged and the investigation about Izuku's mom had stopped temporarily. All police forces were heavily invested in the attacks of vigilante Stain who had already killed 17 heroes and left more than 20 crippled. The therapy had not helped him remember anything, but he was trying to be patient, even though the nightmares were becoming more and more brutal, in a strange mix between Aizawa's body after USJ and the door.\nSo it was to be expected that on the day of the festival Izuku would be restless and evasive, to the point that Aizawa almost left him at home. Armed with a syringe of suppressants, something he had hardly used in recent weeks, Mochi and Sushi, he climbed into the cabin with Aizawa and Yamada and prepared to watch what was coming.\nEarly on he realized that yes, he had good reason to be worried about Todoroki.\nIn the break after the second test, he took courage and went down to the stadium.\n…………………………………………………………………\n\"There is nothing wrong with wanting to win.\"\nIzuku felt frustrated, but it was the first time that his frustration with Todoroki had no built-in amusement, just annoyance and worry.\n\"I didn't say it, but the fight hasn't started yet and you already have hypothermia. Yeah, I'm not blind, I recognize the signals too well from experience.\"\nTodoroki stopped where he was walking in front of him with purposeful large strides. Izuku tried not to feel hurt by it as he lift his chin and planted himself in the other path.\n\"That's none of your business, Midoriya\"\nHis voice was as icy as his quirk, the hostile look was on him from above and Izuku felt terrible.\n\"I'm sorry for being an idiot and worrying about my friend.\"\n“I didn't come to U.A to make friends, Midoriya. Don't get in my way.\"\nThe phrase hit him almost physically and he took a step back.\nIzuku bit his lip and tried to control his tears. Todoroki's expression twisted, he opened his mouth to speak, but Izuku just shook his head. He had been through this several times. He knew that story well. He would not be like old Izuku in this, he would not run after an one-sided friendship.\nThis thought made him angry. He didn't know if with Todoroki or himself. \n\"Fuck you, then.\"\n\n \"Bakugou is really a bad influence.\" \n\nHe turned to leave before his quirk could lose control. A warm hand gripped his wrist and stopped him. He looked down at the hand and up at Todoroki, who released him slowly, his face almost panicked.\n\"I ... Midoriya. Wait. I'm sorry.\"\n\"What, Todoroki?\"\nHe was feeling totally defensive right now. \nTodoroki sighed tiredly, leaning back against the wall and rubbing his face.\n “I don't know how to do this.\"\n\"Do what?\"\n\"Deal with people, be a friend, but ... I don't want you to leave.\"\nIzuku felt the anger dissipate at once, leaning against the wall in front of him.\n\"Me neither.\"\nThey were both a mess. Todoroki stared at him through his fingers, his eyes on his, his expression seeming to ponder something until it became resolute.\n\"Midoriya, have you ever heard about quirk marriages?\"\n…………………………………………………………………\nAt least his quirk had good taste. Izuku now knew why it hated Endeavor so much. Izuku touched the suppressant in his pocket, wondering if it was worth using it now, because surely he felt something expanding in his chest.\n\"That's why I have to win the festival without using his quirk. I have to prove that I don't need him to be a hero.\"\nAnd the situation just got more complicated. Izuku knew he wasn't the best person to advise on trauma, he couldn't even verbalize what he was sure had happened to him because just thinking about the word made him want to rip his skin off. But Izuku knew about quirks and especially about their negative effects. He knew that what Todoroki was doing could render him disabled one day if nothing worse happened by then. Unlike his broken quirk, Todoroki's was complete, perfectly balanced. He was purposely incapacitating himself.\n\"Shoto.\"\nThe name came out easily, without formalities. They were past that.\nThe other looked at him, his face still stormy after throwing his demons out.\n\"I understand where you came from, but don't you think the effect is quite the opposite? You're letting him further dictate your life when you  incapacitated yourself because of him.\"\nShoto's expression closed even more and Izuku spoke faster.\n\"You're hurting yourself-\"\n\"I won't use his quirk, Midoriya. This is final. I won't do what he wants.\"\n\"But that's the problem, isn't it? The quirk is not-\"\n\"Don't be a hypocrite, not you, who hates your quirk. I thought you would understand that-\"\n\"Let me talk!\"\nHe stamped his foot, the tunnel trembling slightly above them, dust falling on their heads. Izuku took a deep breath, closing his eyes. At least this time Todoroki was silent, waiting for him to recover.\n\"This is different.\"\nHe opened his eyes and stared at the other boy firmly.\n\"I don't want to be a hero, I can't be one. Never. You do. You will probably be able to graduate using only your ice. But one day there will come a situation, out of school, in real life, where you’ll have a choice, where using your quirk completely will be the difference between saving someone or not. This is a weight you will have to carry, Shoto, someone's life-\"\n\n “Blood on the walls. Cold and silence. A still body, crooked as a broken toy. ” \n\n\"Izuku?\"\nHe shook his head, putting his hand over his mouth to prevent the sudden urge to vomit. Shoto touched his shoulder, his expression less guarded now, his eyes searching his face.\n\"I don't want you to carry that weight, Shoto. Don't let your dad take it from you.\"\nThe other's expression looked conflicted, but the stubbornness was clear there.\nBefore he could say anything else they heard clapping in the stands, Kayama's voice announcing that the next round was about to begin.\n \"I gotta go.\"\nShoto stared at him in conflict, staring down the hall and his possibly very pale face.\n\"I'll take you to Sensei.\"\n\"No, go. I will be fine. Think about what I said, all right? This conversation is not over.\"\nOnly when the other one came out of the tunnel did he realize that they were not alone, the other known source of heat was very close. Izuku turned around feeling annoyed.\n\"Bakugou, hearing something intimate from someone else without permission is terrible.\"\nThe other came out from behind the wall, a petulant expression on his face, but he knew him well enough to know that he was shaken.\n\n \"Good\" \n\n\"If you don't leave soon you will lose your turn.\"\n\"Fuck you, Deku.\"\nHe showed the middle finger in response when the other walked away. Maybe he was around Bakugou too much lately. \n\"I'm rooting for Shoto! I hope he'll kick your ass!\"\nHe almost laughed when he heard the explosion and the outraged scream.\n\"WHAT DID YOU SAY?\"\nHe left quickly before he returned.\n…………………………………………… ...\nWhen Shoto threw an iceberg that covered half the arena he sighed and went back down from the cabin.\n………………………………………………\nHe felt it even before he saw him. \nEndeavor had a very particular heat that made his quirk stir in a bad way.\nHe saw them in the hallway, Endeavor's body looking huge compared to Shoto's. The man raged, his fists clenched and his face flaming. \nIn his mind came the same image, but a much smaller Shoto. A child, vulnerable. Unable to defend himself.\n\n\"Unable to do anything to stop his mother from getting hurt.\"\n\nIzuku hoped to lose control there, but the effect was the opposite, as if it were the first time he and his quirk had come to terms with something. \nIt was the first time he had felt totally in control.\nHe felt the balloon in his chest expand, the sensation of Endeavor's unpleasant heat coming. Izuku took that sensation to himself and just pulled, the balloon expanding until it opened, filling every part of his body, making the energy flow to his fingertips, vibrating with anticipation. It was a new sensation, not to feel suffocated by his own quirk.\nHe would keep Endeavor's astonished face forever as the flames suddenly vanished from his face. He saw him try to light up them again but Izuku kept pulling. \nShoto saw him, his eyes were wide, lips trembling in almost a smile. Izuku winked and beckoned him away, his eyes on the back of the hero who seemed to be trying to figure out what was going on with his own quirk, probably looking for Aizawa nearby.\nShoto stepped aside and Izuku, with the greatest satisfaction he had ever felt using his quirk so far, let the energy flow through his body and pushed.\nEndeavor almost flew out of the tunnel, falling into the arena.\nThe two boys looked at each other, both wide-eyed. Izuku knew he was in trouble, Aizawa would know who had done it on the spot, yet he couldn't regret it.\nNot when he heard Shoto's laughter for the first time.\n……………………………………………… ..\nThey gave a longer break to the final battle. Izuku walked with Shoto to the room where he would prepare for the fight against Bakugou. He knew there was not much to do for the other to change his mind, just as he knew that with only half quirk Shoto would never beat Bakugou.\n\"I know what you're thinking.\"\nHe looked at the other curiously.\n\"I didn't know that you could read minds, Shoto.\"\n\"You don't understand. His power-\"\n\"You keep saying that, that it's his power. I'll tell you something, my quirk loves your quirk, but hates Endeavor's.\"\nShoto turned his face slightly, his brow furrowed, reminding him again of Mochi. Izuku stopped at the door and looked inside, seeing Bakugou muttering something on the table, purposely ignoring them.\n\"I mean, it's your power. It's your quirk. And you will be a hero with it and fuck Endeavor, this has nothing to do with him if you don't want to.\"\nShoto's face at that moment was something he wanted to keep forever. An expression of disbelief, as if he'd told him the secret about time travel.\nHe couldn't explain then why he tiptoed and kissed Todoroki’s check quickly.\n\"Good luck, Shoto.\"\nIzuku walked down the hall and turned the corner without looking back, only when he no longer saw him he widened his eyes in disbelief and started to panic.\n\"What the hell was that?\"\n…………………………… ..\nWhen the stadium burned down, Izuku forgot his mortification.\nHis quirk moved in his chest, reaching the heat that was everywhere. Satisfied and happy.\nIzuku focused on Shoto's smile below, Bakugou's excited face, and also felt strangely satiated.\nShoto won the festival.\n………………………………………\nIzuku couldn't stay and celebrate with Shoto. In the middle of the ceremony, Aizawa received word of what had happened to Ingenium and they went home early to see him in the hospital. The two had studied at U.A at the same time and were old friends.\nIzuku managed to talk to the wounded hero briefly, but it was enough to see, not for the first time, how often bad things happened to good people.\n…………………………………………\nAfter the festival things were similar but different at the same time, like everything else in Izuku's life.\nEverything had changed a little, something that seemed minimal, but it was like trying to navigate in a once-known terrain when someone moved everything 5 cm away. It sounds small, but it makes you stumble all the time.\nThe main change, however, was his relationship with Shoto, and not just because they now corresponded each other with their first name. There was something else that he couldn't quite understand but he knew that it wasn't bad. Not bad at all.\nHe was almost beginning to think that the heat in his chest when he saw Shoto was not just because of his quirk.\nShoto also looked at him differently, but it was Shoto, he was never sure what was going on in that head of his.\n\"So are you going to do your internship with Endeavor?\"\nThe other shrugged.\n\"I can't lie and say he's not the best. If I want to understand my quirk, this is where I have to go.\"\nIzuku didn't like the idea but understood his reasons. A little bit. \n\"Good luck then. The internship is in Hosu, right? Where Stain's last attacks took place.\"\nHis chest tightened a little at that and he felt Shoto push his shoulder into his where they sat stretching. Aizawa told them to go ahead and warm up, apparently, he would bring in a new student to train with them.\n\"You don't need to worry about me.\"\nHe huffed briefly.\n\"I always worry about you, It is what friends do. \"\nFor some reason, he thought he saw Shoto blush slightly at this.\n\"Izuku, may I ask you a question?\"\nHe stretched out touching his toes, feeling the pleasurable clicks on his back\n\"You already did it.\"\nIzuku could almost feel Shoto's annoyance from afar and smiled.\n\"Two questions?\"\n\"You just did it.\"\nHe stretched one leg forward, bending the other and throwing his body aside. He was glad to see that he now had some muscle. It was so hard to keep fit with a quirk like his.\n\"Three questions.\"\nIzuku smiled, stretching his other leg and throwing himself on the other side.\n\"You already have.\"\n\"When?\"\n\"Just now\"\nThe push he received was deserved, but no less painful. They scrambled inelegantly, his quirk almost purring contentedly with their proximity. In the end, Shoto immobilized him shamefully fast, sitting on his waist and holding his arms crossed in front of him.\nIzuku was momentarily worried, waiting to panic over the position, something that happened often, even when was Aizawa fighting him. It was hard to get away from the terrible feeling that being like this always caused.\nThis time there was nothing but the excitement of his quirk and action-flushed faces. They both breathed fast and he felt his face hurt from smiling so wide. Months ago he couldn't think that this would be possible.\nShoto looked at him with a much smaller smile, but it was there. He saw him lean slightly, his face turned in curiosity.\n\"Why did you kiss me?\"\nSo that was the question. His face flushed widely and he tried to deflect it, but it was difficult with Shoto looking at him like that.\n\"For good luck?\"\nHe moaned at his own awkward response, but Shoto didn't look annoyed, just even more curious. Thoughtful. He watched him frown, pondering something before he nodded resolutely.\n\"Is that so? In this case-\"\nShoto lowered his head so fast that he couldn't prepare himself. The kiss hit the corner of his mouth and Shoto nearly hurt his nose from their clumsiness. Still, his heart pounded, eyes darting between Shoto's eyes and mouth quickly as he pulled back to see his reaction. \nShoto's eyes softened. Izuku saw him move almost in slow motion, ready to lower his head again, but a very angry voice interrupted the moment.\n\"It wasn't this kind of warm-up that I was talking about.\"\nAizawa's scarf took Shoto off him faster than Izuku ever saw him use it. \nIzuku covered his face with his hands, feeling his cheeks in flames. He turned and cringed, peering at his guardian through his fingers. Aizawa still had Shoto strapped to his scarf, his hair floating. Beside him was a familiar face from the festival. The tired eyes and messy hair, as well as the strange smile, reminded him terribly of Aizawa.\n\"This is Hitoshi Shinsou, he will train with us from today.\"\nAizawa dropped Shoto to the ground higher than he deserved it, but Izuku chose not to say anything.\n………………………………………………\n\"Hey, Izuku.\"\nShoto frowned, staring where Hitoshi was running around the area and Aizawa sitting under a tree, whose eyes were more alert than usual during these sessions.\n\"Hmm?\"\n\"That sounds a little absurd, but hear me out. Shinsou and Sensei. Don't you think they look a lot alike?\"\n\"Shoto-\"\n\"Do you think he's sensei's secret son? That makes you brothers, right?\"\nIzuku let out a small laugh. Shoto was really something.\n………………………………………….\n\n “Do you think you can run away from me? There is nothing more to you than me now. You deserve a lesson for that. ” \n\nSometimes Izuku could remember the feeling clearly, especially after waking up from a nightmare. The heavy object coming against his hands, the impossibility of moving and running away from the pain as the bones seemed to pulverize under the hammer.\nHis hands were such an important part of him, before. With them, he wrote his analyzes and draw detailed hero sketches. It was his great pride, the only thing he thought he did right in life. Now? He couldn't even hold a pen to write without feeling pain. The therapy helped, but there was only so much that even Recovery Girl could do. By the time when he arrived at the hospital, he had been lucky to have nothing amputated.\nHe looked down at his ruined fingers and sighed, giving up on holding the chopsticks. \nHe swung his feet on the table outside the building, green eyes searching for Shoto who must have already left for the break. Shinsou had stolen Mochi and was taking a nap, lying sprawled on the bench, his too long legs sticking out at the end.\nHe was a peculiar fellow, Shinsou. His quirk also gave him a bad feeling but Izuku refrained from saying anything. God knew he was already self-conscious enough with all the things he heard about it in his life and Izuku felt that the problem was not Shinsou's quirk itself, but some association his fractured mind was trying to make. What's more, Izuku really liked Shinsou, something about how he looked so much like Aizawa. Or maybe Izuku just became close to the most traumatized and socially inept people, it must be a gift.\n\"Sensei is talking to him.\"\nAnd talking about socially inept people. \nHe looked up at the familiar voice and Bakugou was already sitting at the table and taking off his bento. Izuku looked at him curiously, because it was rare to see him alone. He always had a squad behind him, although these, unlike the ones he remembered at school, were really good people. It was funny to see how the most enthusiastic students in the class had adopted the class Grinch.\n\"Who?\"\n\"Half-and-half.\"\n\"Shoto?\"\nHe looked at him as if to say 'who else?'\nIzuku blinked even more curiously. Bakugou helping him. Go figures. Kirishima and the others were really making progress.\nHe looked out of the corner of his eye at his old childhood friend eating and ignoring him. Shinsou opened one eye and stared at him questioningly. Izuku just shrugged.\n\n  “To be fair, he's changed. My disappearance really messed with him. ” \n\nThey never got back to the subject, but he noticed how he usually spent a long time staring at his hair or his scars. Like now, Bakugou was staring at his trembling hands as he tried to pick up a chopstick again.\nHe also noticed the way he moved around him, especially when his hyper-excited class ended up making Izuku too anxious or he was getting nervous around a teacher when he was with Bakugo's class.\nBakugou has always been intelligent and intuitive, beneath all his brash attitude. Izuku knew he had done his research and had a sense of what had happened to him.\n\"What is the thing between you and the half-and-half?\"\nThe question seemed disinterested, but Izuku felt the blood rise on his face. Immediately he began to play with his own fingers and heard a suspicious laugh coming from the form lying on the bench.\n\"My quirk likes his heat.\"\nBakugou stopped the curry near his mouth and stared at him incredulously. And then he gave what looked suspiciously like a laugh, his sarcastic voice quite evident.\n\"What are you? A  damn cat?\"\nIzuku became even more mortified, his mouth opening and closing for a reply.\nHe didn't have one.\n.................................................. ...............\nThings were going well for Izuku. He had new friends, a better relationship with his quirk, and he had Aizawa. Izuku also had Shoto, which was something else, maybe his best friend, but the term didn't seem enough anymore.\nHe wasn't totally happy, not without his mother around, not with the nightmares. It was like blinking and suddenly everything around disappeared and he was facing the door. Izuku sometimes woke up at night not knowing if all the good things were just a dream, \nStill, he was getting better, he was healing.\nAnd like everything in his life, whenever it started to come into balance, that was when something terrible was going to happen.\n………………………………………….\nMaybe there was some law about his life, Izuku thought, which ordered that when something went wrong, it would go as badly as possible and in every way possible.\nThat night in Hosu would be in many people's nightmares for a long time, it was one such example of disasters followed, with Noumus attacking and Stain on the loose, wounded heroes and an uncontrolled quirk out.\nFor Izuku it all started when he decided to take the train alone between the prefectures. Aizawa was on patrol and Kayama, who was about to come to stay with him, was called in at the last minute. Izuku offered the option of staying at home, but Aizawa denied that. He would return home and bring him to the agency. His guardian seemed uneasy about something and didn't want Izuku to be alone. \nBy agreement, he convinced him not to return just to pick him up, since the train from his house to the agency had only two stations and Izuku was feeling particularly brave that day. He was already on campus by himself, had gone to the market without panicking, and at that time the train was almost always vacant. Besides, by this point, he was confident that he could defend himself if attacked. Izuku couldn't hide forever. \nHe could do it.\nAnd in the beginning, everything went well. The train was almost empty, no one came to talk to him. He sat in the backseat, his red hood up high covering his white hair and headphones on, Mochi was quite safe sleeping inside his coat.\nWhen the train passed Hosu, that was when it all went wrong. Izuku felt it before turning to the window. The heat, even at this distance, made his quirk uneasy. He rose from his seat and looked out, his eyes widening at the sight of chaos in the city.\nHe felt the impact on one of the wagons, causing people to fall to the ground and scream. The train stopped and he heard a shrill and terrifying sound. Something broke into his wagon and Izuku hugged Mochi safely, seeing a giant creature pass through the metal easily, coming toward the people who cringed in terror.\nIzuku didn't really have to think. He felt the sensation of his quirk take over his body, almost as a survival mechanism, the energy covering his fingertips and up his arms. Izuku pulled, hearing the ominous crack of bone breaking as the monster strained forcibly before being thrown by the glass of the train falling below the tracks.\nHe ignored the whispers around, people staring at him warily as they saw him stopping the monster in a matter of seconds. Izuku felt the chill on his body, but the heat that came from burning Hosu didn't let him feel that way for long.\nHe looked down, still appalled by the scenery.\n\n \"Oh no, Shoto.\" \n\nHe pulled out the phone and sent messages in a row, but they were not seen.\nIzuku might not be able to throw all his blame on luck, it helped that he had a tendency to make stupid decisions. For those who didn't want to be a hero, he liked to get into someone else's problems quite often.\nThe safest thing for him really would be to stay on the train with the passengers, where heroes were beginning to arrive to take people to safety.\nIzuku jumped from the window to the tracks, using his quirk to momentarily float and cushion the fall.\n He ran toward the chaos.\n...............................................\nIzuku was no hero. He could never be one.\nIt was what he repeated to himself whenever he interfered with an attack within Hosu. He just wanted to find Shoto, saving people was just a consequence.\nEven with all the fire around him, he was starting to feel cold. He had never used his quirk so continuously and he was sure that what he was doing at the moment could be a crime of vigilance, but when people shouted for help he had to intervene.\n\n “No one came for you. No one heard you. You screamed and screamed and no one came. ” \n\nHe gritted his teeth and pulled, a Noumu toward him and then pushing it  away on the wall of a building. He entered the crowd when he saw the heroes looking for who had done this. He could feel a metallic taste in his mouth, a pain in his abdomen for using so much energy without a replacement.\nTrying to use his quirk in small doses so as not to lose control and do more damage than help needed more energy than he could imagine, and he felt the balloon in his chest expand and move unsatisfied. It was hard to breathe like this.\nHe felt suffocated and moved from the crowd to the sidewalk, running in the direction his cell phone was pointing at Endeavor's agency. Someone pulled his bag in despair, things falling out of it. Mochi jumped out of his arms and ran away. He gave chase toward her. \nThat's when he ran into Stain and Tensei's brother.\n.................................................. ...........................\nIzuku: Shoto? \nIzuku: I'm in Hosu.\nIzuku: Let me know if you're alright.\nIzuku:   I'm worried. \n\n Izuku sent his location. \n\n.................................................. .....\nAizawa watched the news about Hosu on the agency television, where he had returned to wait for his boy, who should have arrived some time ago.\nThe image of the train standing on the tracks assured him that something had happened.\nHe took the phone from his pocket to call, already heading for the door.\nThat's when he saw the message with the location.\n..................................................\nGetting in between the danger and someone else was as familiar as breathing, and it wasn't even the first time someone he was trying to help refused it.\nIida was a person he didn't know well, they had talked a few times, but he had not seen him as a person who would do something like that. \n\n \"Pain does that to people, you know it more than anyone else.\" \n\n\"This doesn't concern you! Go, Midoriya!\"\nHe smiled because it was all so familiar. Stain had been looking at him curiously since he'd entered the alley, in his civilian clothes and short stature.\n\"Your brother will want you to come home, Iida. Don't worry, I asked for help.\"\nStain laughed and Izuku stood better in front of the two fallen ones.\n\"The attitude of a hero, to get involved even when your life is at risk.\"\nIzuku tried not to cringe at that, his eyes hardening.\n\"I'm not a hero.\"\nHe clenched his hands into fists and braced himself, eyeing all the blades on the vigilante's body. That was totally out of his league.\n\"And yet you behave better than these fake ones-\"\nIzuku threw the vigilante hard against the wall, pulling him and throwing him against the other.\n\"I hate monologues.\"\nA knife came toward him and the chaos began.\n.................................................. .....\nAs the known heat approached, his feelings were contradictory. He was glad he was no longer alone, terrified that Shoto would be in danger and his quirk moved excitedly in his chest, already reaching for its favourite heat source.\nIzuku swallowed the blood in his mouth, unwilling to risk letting the vigilante paralyze him.\n The flames engulfed the alley, making a barrier between Izuku and danger, as the first time they'd seen each other.\n\"Couldn't you be more specific, Izuku?\"\n...................................................\nMaybe they could have won, all three of them together. Even though Izuku was trying hard not to lose control all the time, already at his limit. Shoto must have known that as he stood often in front of him and took the attacks.\n\"I said that one day we might need the combos.\"\nIzuku refused to answer it. They could win. They had understood Stain's quirk, help was coming, they just had to stop him from hurting anyone else.\nIt was so close.\nUntil Izuku was paralyzed.\n\"Izuku!\"\n\"Midoriya!\"\nHe fell like a broken doll to the floor, unable to move. His quirk pounded furiously in his chest, the feeling of energy was still there, but he couldn't focus on anything. \n Shoto called for him and Izuku watched him try to reach him and defend himself at the same time.\nThe small control he still had seemed even smaller, the metal of the dumpster twisting close, the ground cracking beneath his body. His quirk was twisting in desperation, wanting freedom and to protect.\nShoto calling his name, getting hurt, trying to protect him.\n\n \"Your mother calling your name, getting hurt, trying to protect you.\" \n\nWhile he was paralyzed, unable to do anything but watch.\n\n “Vulnerable, without power, without choice.  ” \n\nAnd suddenly he was no longer there. His eyes glazed over the scene, the alley fading. It was all just that door. The door, rotten and bloodstained. The door that only exuded death and pain.\n\n \"Izuku! Run! Get away from here!\" \n\nHe was so close that he could touch it. Hear the sentences behind it clearly. The screams for his name. \nHis screams.\n\n “How will the cat be when you open the door? Dead or alive?\" \n\nIzuku touched the ruined doorknob and opened it.\n.................................................. .........................\n\n \"Who killed the Schrodinger's cat?\" \n\n.................................................. ..............................\nAizawa arrived in the chaos just in time to see Iida save Todoroki from being impaled.\n Just in time to hear his boy scream. \nA scream from deep in his chest, tormented and terrified, that should never get out of anyone's mouth, even more of a child.\nThe surrounding walls trembled, the cars on the street set off alarms, and the posts twisted toward them. The energy was so strong that they were thrown back, his scarf holding his students before they could go any further. \nHis body went suddenly cold as if all the heat around them was sucked. He looked at Izuku and saw a strange shape around him, almost transparent if not for the high density, circling around his child and moving with fury.\nIt was the first time that Todoroki's ridiculous notion of Izuku's quirk resembling Tokoyami's made any sense.\nHe quickly checked Todoroki and Iida, noting blood. His students were injured. They got injured and he wasn't there to help. Izuku was injured and he was not there, he had arrived late again.\nMore heroes arrived at the scene, some going to Stain, others going to his boy.\n\"Don't hurt him!\"\nEndeavor's fire was gone. Aizawa caught a glimpse of Izuku's face and he saw something he had not seen before. Izuku's eyes were all white, just the sclera showing. His face went towards the hero and Endeavor was thrown against the wall.\n\"Eraserhead? Can you stop his quirk?\"\nHis red eyes focused on Izuku and he saw the shape recede, only to grow again. It was like trying to reach a switch with fingertips that always came back in place. He blinked and shook his head frustrated.\n\"It's taking too long, it's the first time I've seen him like this. I need suppressants.\"\nHe felt his feet come off the ground and gripped the fire escape. Inside the alley, things and people floated around, the buildings nearby shaking.\n\"This is insane! What the hell is this quirk?\"\nFaster than they could predict a flying Noumu slashed and came toward Izuku. Before they could do anything the dense whitish mass attacked and the Noumu was on the ground. They heard the sound of cracking bones and the screams of the creature, but the power didn't diminish, sinking the noumu deeper and deeper until he saw blood gushing through the floor. It was violent and brutal and Aizawa had never seen Izuku like this.\n\"Mochi.\"\nTodoroki's breathless voice made him look down and he saw his cat floating on his feet, a syringe in her mouth. Before he could do anything to stop him, Todoroki caught her and using his quirk to stay on the ground he drove into the centre of chaos.\n\"Todoroki! Don't!\"\n\"Shoto! What are you doing?!\"\nAizawa finally understood what Izuku meant when he said that his quirk liked Todoroki. Maybe it was the ice barriers he made around, but the moment he got close enough they managed to touch the ground, things falling into the alley. The form receded, wrapping both of them peacefully like a blanket until it suddenly vanished.\nHe ran to the two boys, Todoroki holding Izuku against his chest on his knees on the floor, the syringe still stuck in his arm. He knelt beside them and touched the kid's unconscious face.\n\"Hypothermia.\"\nTodoroki nodded and Aizawa noticed that he was holding Izuku to one side, trying to warm him up. They had to go to the hospital quickly, the three boys were badly injured.\n\"Can you carry him? Try to raise his temperature until we reach the hospital.\"\n\"Yeah. Sensei?\"\nHe looked at the boy's haunted eyes, it was something he had never seen before. Todoroki always had his expression too controlled for a child.\n\"He said that he remembered everything.\"\n.................................................. .................\nThe next morning the boys were stable. Stain had been arrested, the situation in Hosu was controlled.\nWhen the nurse came into the room to check on the still-unconscious patients, one of the beds was empty.\nIzuku Midoriya had disappeared.\n\n\n“There are wounds that never show on the body that are deeper and more hurtful than anything that bleeds.”\n\n\n\n\n― Laurell K. Hamilton, Mistral's Kiss\n\n\n \n\nYears later Aizawa would still not be sure how Izuku got to that place in the state he was in. \n\n\nAccording to the tracks they followed to find him, he took the train and probably still walked a long time until he reached his destiny. Luckily for them, a child walking alone drew enough attention. With Ragdoll's help, they were able to find him still in that very day.\n\n \n\nAll Might found him first and soon Aizawa was there. He glanced at the number one hero standing on the edge of the clearing, unmoving and showing the most serious face he had seen on him since the attack on USJ.\n\n \n\nIzuku was curled up on a little ball, sitting on a tree trunk and hugging his knees tightly. Around the clearing, some rocks and logs floated smoothly. Even from all way there, Aizawa could still hear his muffled sobs and all he wanted to do was go there, shake him for escaping the hospital, but most of all check out if he was hurt.\n\n \n\n\"Is he alone?\"\n\n \n\nRagdoll looked around, her face turned slightly as her eyes went down.\n\n \n\n\"There is an empty underground space with an entrance to the surface. It's a hiding place occupying much of the clearing.\"\n\n \n\nShe paused and frowned.\n\n \n\n\"There is no one alive but-\"\n\n \n\nShe stopped and looked at him meaningfully.\n\n \n\nThey had probably found where he was at the time he was missing then. It was the same forest he had woken up in, where they looked for clues without finding anything. If only someone had brought Ragdoll from the start.\n\n \n\nWith the sound of footsteps, he looked back and saw Naomasa with a few more cops that were helping with the search. Aizawa rubbed a hand over his eyes and entered the clearing, the others falling behind. \n\n\nEven if he hadn't raised his head, he knew Izuku had noticed him. His quirk never let out a heat source nearby. When he got close enough he saw that near the trunk where he stood was an entrance, once hidden by a carpet of leaves and grass. A wooden door, rotted by rain and weather. He looked at the two heroes and pointed to the door.\n\n \n\nAizawa knelt in front of the curled up child, noting the tremors that passed through his body. Naomasa who was heading for the door looked at him and threw a coat. He laid the warm fabric on Izuku, rubbing his arms and sitting beside him on the trunk, waiting.\n\n \n\nSome men came in through the door, and even from there he could smell a strong odour.\n\n \n\nHe felt a cold hand and looked down, seeing Izuku's profile staring at his feet. The boy leaned against his side and Aizawa wrapped his arms around him, resting his head on the white hair, Izuku's cold face pressed against his chest.\n\n \n\n\"Izuku? Talk to me, please.\"\n\n \n\nHe heard him let out the air softly, before his voice, small and shaking, could be heard.\n\n \n\n\"He had a mind-controlling quirk, it worked only with suggestions. He thought it worked for everyone, but I realized that it depended on how stubborn the person was. You could fight it off, eventually.\"\n\n \n\nAizawa squeezed him a little more and looked over his head at Naomasa, that was intent on their conversation.\n\n \n\n\"That's how he got the other boys.  He could spend weeks watching them, analyzing them. He said what they wanted to hear and made them like him. No one was going to miss them, but I had my mom. It was a risk, but he really wanted me. I think the game was getting boring for him. He said-\"\n\n \n\nIzuku paused, his voice now in a disinterested tone that reminded him too much of when he began living with Aizawa. That terrible apathy that had completely disappeared in recent months.\n\n \n\n\"He stopped me at the corner of my house and came to talk to me. I woke up down here. After I learned that he spoke to mom, he tried to make her forget about me with his quirk, but it didn't work. He thought it would be easy, he said that no one wanted a quirkless child,  that she was just going to need an excuse.\"\n\n \n\nAizawa closed his eyes tightly trying to control himself.\n\n \n\n\"He was wrong, your mother made hell on earth for you, Izuku.\"\n\n \n\n\"I know it. He said I was more work than it was worth, I was drawing a lot of attention. Hiding the evidence was ideal, but he didn't want to give up, he liked the game too much. I was a challenge. Even so, having to force me to do things made him eventually angry, he wanted me to obey, but his quirk didn't work right on me, I could break the effect very fast. I was too stubborn.\"\n\n \n\n\n\"Of course he was.\" \n\nAizawa didn't know anyone more stubborn than Izuku. He was a survivor, stubbornness for a long time was the only weapon he had in his life.\n\n \n\n\"He always came at night.\"\n\n \n\n\n\"The monsters appear at night, Eraserhead.\"\n\n\n \n\n“There was no way out, the door never opened. I almost got out once, but then -\"\n\n \n\nIzuku opened his hands in his lap, the fingers shaking. Unfortunately, Aizawa understood immediately. The bastard had done it with the kid's (Aizawa's kid) hands for trying to escape. He put him in conditioning with the damn quirk, but Izuku broke the control and so he resorted to it. And knowing how stubborn and clever Izuku was, he didn't even want to think about what else had happened.\n\n \n\n\"He brought my mom with him one night.\"\n\n \n\nAizawa heard the sound of trees falling around, but kept his eyes on the boy beside him, hugging him closer. Even now it was hard to get his quirk off, to press the broken switch that always wanted to go back in place.\n\n \n\n\"Izuku-\"\n\n \n\nIt was as if he didn't hear him anymore, his voice faster and faster to the point that he could barely understand what he was saying now.\n\n \n\n\"He always said that if I tried something he would go after her. That way he could make me do what he wanted easier, convince me to not try to run away. If I did something wrong she would pay. I think ... I think mom tricked him, made it easy for him to bring her on purpose to find me.\"\n\n \n\nAizawa could see it clearly, only from the little he knew of Inko Midoriya through Naomasa. After all the things that woman had done to find her son, she could easily do something crazy like this. She wouldn’t miss a chance to find her son.\n\n \n\n \"He thought his quirk had worked on her, but the moment she saw me, she attacked him. It all happened so fast ... She just wanted to stop him from getting close to me. But he was so big and so ... full of anger. I couldn't do anything to help. And mom ... he was going to kill mom. I remember... I remember feeling something snap.\"\n\n \n\nHe pointed to his own chest.\n\n \n\n\"On here. Something expanded and expanded and\n\n I couldn't breathe\n\n. Everything went white. He screamed \n\nand screamed \n\nand the sound of things \n\nbreaking and cracking and snapping\n\n. I didn't realize right away what had happened, that it was my quirk, \n\nI just wanted him to stop hurting my mom\n\n.\"\n\n \n\nA log exploded in the clearing, splinters going in various directions. He activated his quirk and his scarf surrounded them like a shield. With Izuku’s quirk off stones and logs fell to the ground. His body softened beside Aizawa, exhausted.\n\n \n\n\"Izuku, you defended her. Your quirk defended both of you.\"\n\n \n\nHe saw him flinch and realized that the worst was yet to come. Izuku's body trembled even more, the moment he blinked he saw the ground began to crack around them and activated his quirk immediately, his eyes burning in the process. They couldn't risk a suppressant with the dose he'd taken at the hospital.\n\n \n\n“I think I blacked out, for a long time. Maybe even more than a day.\"\n\n \n\nHe saw him cover his face with his hands, his voice muffled and shaking. \n\n \n\n“When I woke up I saw him on the floor. Bent and broken, like \n\na cockroach\n\n, smashed against the wall. There was so much ... so much \n\nblood\n\n and mom \n\n... my mom\n\n was near the door. I called and called for her, but \n\nshe wouldn't answer me\n\n. She wouldn't \n\nmove\n\n. \n\nShe wasn't breathing\n\n. Her eyes were open but she couldn't see me. And \n\nher neck\n\n ... and I got it. She was too close to me at the time, trying to reach me. To \n\nhelp me\n\n.\"\n\n \n\nHe heard Naomasa curse lowly where he was, getting the same conclusion as him. \n\n \n\n\n\"Oh, Izuku.\"\n\n\n \n\nAizawa couldn't take it anymore and blinked his eyes. He heard some voices exclaim in fright as the door was torn open and thrown away into the clearing, slamming into the tree trunks, twisting and tearing into the air. When the last piece fell Izuku's quirk finally calmed down, becoming placid. The sudden silence was almost deafening.\n\n \n\nNow he understood why he hated his quirk so much, why he hated himself so much. He understood why he had pushed it so much into his own mind. \n\n\nWhen he spoke again, his voice was broken, his hands gripping his own hair in despair.\n\n \n\n\"I killed my mom with my quirk.\"\n\n \n\n.................................................. .....................................\n\n \n\n\n\"Who killed Schrodinger's cat?\"\n\n\n \n\n\n\"It was you who opened the box.\"\n\n\n \n\n.................................................. ............................\n\n \n\nAizawa removed the child hands from his hair with difficulty, gripping thin wrists before Izuku could hurt himself more. With one free hand, he pulled his face up gently and met his eyes with conviction.\n\n \n\n\"You didn't want to do that. Nothing was in your control, \n\nit wasn't your fault.\n\n Izuku, it was an accident.\"\n\n \n\nThe boy shook his head in denial and collapsed into sobs. A cry that was too painful to hear. \n\n \n\n\"It was an accident, Izuku. Are you listening to me? It was an accident.\"\n\n \n\nAizawa pressed his face into white hair and swayed him soothingly for a long time, repeating it until he felt Izuku's breath more evenly. The exhaustion of the last few days had finally reached the boy and his body melted in the hug as he reached unconscious. \n\n \n\nNaomasa approached, his expression sombre.\n\n \n\n\"Inko?\"\n\n \n\n\"We found her. We found them both.\"\n\n \n\nAizawa bit his lip, trying to control the turmoil he felt at the moment. His voice left with an accusatory tone.\n\n \n\n\"You don't look so surprised.\"\n\n \n\nThe man sighed and sat beside him on the trunk. He ignored how exhausted he looked.\n\n \n\n\"About his quirk? Yes, I am surprised. About the mother not being alive? Not so much.\"\n\n \n\nNaomasa looked into the hiding place, where more of his men entered.\n\n \n\n\"When I caught this case, Inko Midoriya made an impression on me, even in the short time I was with her. If this woman were alive, there was \n\nnothing in the world \n\nthat would prevent her from being with her son. To someone who looked so peaceful, she was a force of nature. So yes, I knew she wasn't alive anymore. Yagi was also of the same impression as me, he knew her well during this period. He spoke with an old acquaintance to confirm her condition. Since Yagi and Inko had sort of a connection, he convinced him to look into his future to find if they would meet again.\"\n\n \n\n\n “Nighteye”\n\n\n \n\nHe kept that fact for later, hugging Izuku close.\n\n \n\n\"Why didn't you say anything?\"\n\n \n\n\"Aizawa ... Do you think that in the state this child was in when he arrived, that he would have accepted it? Deep down he knew the truth too, but he couldn't accept it. There was a reason for him to just remember it now, when he is no longer alone to bear the impact. He is a bright kid.\"\n\n \n\nHe felt the anger go away and deflated in exhaustion.\n\n \n\n\"That's why you didn't force him to remember. You're giving him time.\"\n\n \n\nThe man sighed and nodded, reluctantly touching his shoulder. They both looked at the boy. Aizawa noticed now that only in those two days did he look much thinner. A whole day without eating with a quirk like his was dangerous.\n\n \n\n\"You can take him home. We'll take care of everything else.\"\n\n \n\nAll Might approached the two of them, looking out of place in his colourful clothes in the terrible scene.\n\n \n\n\"I'll escort you.\"\n\n \n\n.................................................. ....................................\n\n \n\nAizawa refused to give Izuku to All Might, he wanted to keep him as close as possible.\n\n \n\nThe hero had been silent. Aizawa didn't know exactly what was his involvement was in the case and was curious to find out, especially with the new information he had about Inko Midoriya. \n\n\nFrom the beginning, the hero seemed too invested in the situation, beyond what was professional and Aizawa noticed the way he looked at Izuku in U.A.\n\n \n\n\"Yagi-San.\"\n\n \n\nThe quiet voice made them both look at Izuku, his half-lidded green eyes were staring at All Might. Aizawa's eyes widened but All Might didn't seem surprised that the boy knew his real identity.\n\n \n\n\"Hello, Young Midoriya.\"\n\n \n\n\"Hi.\"\n\n \n\nAizawa smiled slightly when he heard his shy voice. The kid was really a fanboy.\n\n \n\n\"You found me.\"\n\n \n\nAll Might looked sad.\n\n \n\n\"A little too late, but yes. I'm sorry, my boy.\"\n\n \n\nThe child didn't answer, leaning his face against Aizawa's chest.\n\n \n\n Aizawa looked at All Might in question.\n\n \n\n“That day earlier, Young Midoriya and I had a terrible encounter. Twice. He eventually discovered my secret and I said something that was far from the truth for him, but when I went to try to remedy my mistake I didn't find him anymore.\"\n\n \n\nThe man clenched his fist, his expression haunted.\n\n \n\n\"If only I had gotten rid of the reporters earlier.\"\n\n \n\n\"It's not your fault.\"\n\n \n\nIzuku's voice was tired and they both looked down again, his eyes were closed.\n\n \n\n\"All Might and Bakugou are stupid.\"\n\n \n\nAll Might chuckled in surprise. Aizawa knew that being fully aware Izuku wouldn't say that. He was too polite to do so.\n\n \n\nHe frowned in curiosity.\n\n \n\n\"What did you tell him?\"\n\n \n\nAll Might look down with embarrassment, his expression tormented.\n\n \n\n\"Something that was not my right and far from the truth. Young Midoriya?\"\n\n \n\n\"Hmm?\"\n\n \n\n\"You can be a hero.\"\n\n \n\nIzuku tensed in his arms and opened his eyes.\n\n \n\n\"I can not.\"\n\n \n\n\"Of course, you can-\"\n\n \n\nHe shook his head. Eyes unfocused, face contorted in sadness, and Aizawa squeezed him a little tighter.\n\n \n\n\"I'm a villain.\"\n\n \n\nHe said it with such conviction as if it were the absolute truth, something too obvious that they must already know.\n\n \n\nAizawa would refute immediately, but All Might stepped in before he could do it.\n\n \n\n\"This isn't true! Who told you this nonsense?\"\n\n \n\n\"I killed my mother.\"\n\n \n\nAll Might looked at him in surprise. Aizawa sighed, knowing that he would have to repeat this a lot for his problem child.\n\n \n\n\"Izuku, it was an accident. Your quirk tried to save you, protect you. If not for that you would both be dead. So no, you are not a villain. I won't let you blame yourself for surviving.\"\n\n \n\n\"As Eraserhead said.\"\n\n \n\nAll Might pointed at him and he rolled his eyes. Izuku continued to stare at him with quivering lips.\n\n \n\n\"Heroes, Young Midoriya, are humans too. They bleed, they make mistakes and difficult decisions. You may not officially want to become a hero, and that's fine. You can be anything that you want to be, but in my eyes and I know that in Eraserhead's eyes here, young Iida and Todoroki, you are already a hero. You have no idea how much you inspired me to be a better person. You are my hero, young Midoriya.\"\n\n \n\n\n\"Hum, he can make a good speech.\"\n\n\n \n\nHe looked at the other appreciatively. All Might cough in embarrassment, blood dripping from the corner of his mouth.\n\n \n\n\"Anyway, there's something characteristic of every hero, young Midoriya. Do you know what is it?\"\n\n \n\nIzuku denied, his eyes adorably wide throughout the hero's impassioned speech.\n\n \n\n\"Get in trouble for problems that don't concern them. And from what I've heard about you, it's something you do quite often.\"\n\n \n\n\"Too often\" \n\n \n\nAizawa grunted. Izuku didn't answer that, he just leaned his head back against his guardian's chest and closed his eyes.\n\n \n\nAizawa sighed and looked at the other hero.\n\n \n\n\"Thank you for that.\"\n\n \n\nAll Might smiled, his face embarrassed.\n\n \n\n\"My pleasure.\"\n\n \n\n.................................................. .................\n\n \n\nEven with the body in an advanced state of decomposition, it was not difficult to find his identity, but digging into its history was far from easy. For someone with so much offence, his record was clean, probably the result of his quirk that let him get rid of his crimes.\n\n \n\nHe lived in a good neighbourhood and was well recognized in the community, paid his fees, and had the same work in a library for the last twenty years. A perfect citizen during the day, a paedophile, rapist, kidnapper and killer at night. In addition to the nine victims, including Izuku, more crimes have been attributed to him over the years now that they have discovered the true pattern. The things they'd found on his hard drive would give him nightmares for years and Aizawa was glad for not being the one responsible for having to check it all out.\n\n \n\nAs he passed through the hideout, watching the horrible photos and videos of his boy, finding the dirty bed and the bookcase, he thought about the hell Izuku had lived there, in a prison disguised as a home, made just for him as he was watched for weeks on the streets by a monster lurking without anyone noticing.\n\n \n\nIt was there that someone almost completely broke one of the brightest people he had ever met. If not for Inko Midoriya, no one would have even gone after Izuku. He would just be someone who disappeared and would never be found, dead when a monster got tired of him, making room for one more victim.\n\n \n\nAizawa didn't like to think about that. To think that he would never have met Izuku, seen him with Mochi and his coloured lamps, hiding in his sleeping bag, laughing with his students or grabbing the sleeve of his shirt when walking with him on the street. Never having met Izuku seemed impossible and outrageous, even in the dire circumstances with which he had entered his life.\n\n \n\nAizawa was grateful that Inko had fought so hard for her son. Until her last breath, she kept fighting for him.\n\n \n\nNow it was his turn to take over. \n\n \n\n\"Eraser, do you wanna take anything from this hell hole? \"\n\n \n\nAizawa held up the burned-out notebook, number 13 written in the flawless handwriting Izuku had before his hands became too ruined to the point where he had to relearn how to write.\n\n \n\n\"Just this one.\"\n\n\n.....................................................................................\n\n \n\n\nOne month later\n\n\n \n\n“So he visits Izuku to take a nap with him?”\n\n \n\nAizawa shrugged, not understanding what the problem was. Nemuri rolled her eyes, seeing the two teenagers dozing on the couch. Izuku was sprawled on top of Todoroki, both of them serving as a pillow for the cats.\n\n \n\n\"I mean, it's cute, but it's not a hobby of normal teens, Shota.\"\n\n \n\nAizawa thought sleeping was a normal and safe pastime. And Izuku seemed calmer when the other boy was around. Even a month after the whole incident with Stain, Izuku had not yet fully returned to U.A. There were more bad days than good ones lately.\n\n \n\n\"I don't like seeing Izuku like this.\"\n\n \n\nHe looked at Nemuri who was looking at the two boys with a sad expression.\n\n \n\n\" I would even be content with him angry, breaking things. It would be normal, but he just accepts everything so quietly.\"\n\n \n\nHe understood her well. Izuku tried so hard that it was painful to watch. And as much as he tried to talk to him about it, the boy just acted like everything was fine.\n\n \n\n\"He still blames himself for what happened to his mother. He's too stubborn to change his mind, but he  knows that if he says it I would tell him that it was not his fault, so he keeps quiet.\" \n\n \n\n\"So he just pretends to accept it?\"\n\n \n\nThe two adults look at the boy on the couch, trapped in their own thoughts.\n\n \n\n\"He looks a lot like you.\"\n\n \n\nAizawa opened his mouth to deny but fell silent. Maybe that was the real problem, wasn't it?\n\n \n\n\"I don't think this is a good thing, Nemuri.\"\n\n \n\nHe felt an elbow in his belly.\n\n \n\n\"Shut up, you're wonderful. Things will work out. \"\n\n \n\nThings were going to work out, but as usually happens in life, it tends to get worse before it gets better.\n\n \n\nAizawa woke up that night to the sound of things breaking and objects floating. It was like going back to the beginning, just when he brought him home, and Aizawa was really afraid that he couldn't get him out of this, that they would be trapped in that cycle forever.\n\n \n\nHe cleaned it up and put the broken things in the trash bag, taking the time to catch some air and breathe. He felt as if he could suffocate at any moment. \n\n\nWhat if he was doing everything wrong? If he was only making the situation worse? Aizawa never felt good about people, sometimes he didn't even feel good as a hero, which he thought was the only decent thing he ever did in his life. \n\n\nIf he were really good, he would have avoided so much.\n\n\nIf he were good he wouldn't have lost so many people.\n\n \n\nWhere was the hero Eraserhead when monsters took children and ruined them, destroyed them so deeply that they started to hate themselves?\n\n \n\nHe felt like spiralling into these thoughts, with no way out.\n\n \n\n\"Are you alright?\"\n\n \n\nHe looked up, the trash bag still in hand and the lid of the trash bin open. He didn't know how long he had been like this, or how long Izuku had been there staring at him, hugging himself, even with a heavy coat over his pyjamas.\n\n \n\nHe sighed and threw the trash in place, trying to organize his thoughts. In the end, he chose to be honest.\n\n \n\n\"I think my head went to a bad place.\"\n\n \n\nIzuku nodded as if that made perfect sense. And it really should do for him.\n\n \n\nAizawa sat on the front steps of the building and tapped on his side in invitation. Izuku hesitated only a few seconds before sitting beside him, leaning his body closer for warmth. Aizawa put his arm around the child's shoulders and stared out into the night, at the empty sidewalk, except for the cats passing by into the alleys.\n\n \n\n\"I'm sorry.\"\n\n \n\nHe looked down and saw Izuku fidgeting with his fingers, something he did whenever he got nervous.\n\n \n\n\"I know I'm being difficult.\"\n\n \n\n“You did nothing wrong, Izuku.\"\n\n \n\n\"I know but-\"\n\n \n\n\"You think you did.\"\n\n \n\nThe boy fell silent but did not deny it.\n\n \n\n\"Earlier Nemuri told me that you look like me.\"\n\n \n\nIzuku frowned at him with a speculative expression.\n\n \n\n\"I also tend to blame myself for things that are beyond my control. In fact, I was doing it right now, looking at that dump. So I know that as much as I tell you the truth, that it was not your fault what happened, you will keep blaming yourself. Thinking about what you could have done differently. Am I right?\n\n \n\nIzuku swallowed, his voice coming out in a choked tone.\n\n \n\n\"Yeah.\"\n\n \n\n\"But you have to know two things: First, what that monster did to you, nothing of that  was your fault. I will never, under any circumstances, accept that you blame yourself for it. Second, your mother was a spectacular person, Izuku. She fought for you, and now you are here. That was all she wanted. She would do everything for you and she wouldn’t blame you for what happened.\"\n\n \n\nAizawa saw the streetlights flicker and fired his quirk, feeling his eyes sting. Izuku's voice came out with the only true emotion he'd ever heard from him in a long time: anger.\n\n \n\n\"How can you know that? You don't-\"\n\n \n\n\"Because you did exactly what she wanted you to do: you survived. You left there, walked for hours and found help. And then you got up, made friends, went to school, fell in love and is here, alive. You did everything right, Izuku. And if it's up to me, you'll keep doing it. How could your mother hate something that allowed you to stay alive?\"\n\n \n\nHe watched him wipe his face, sniffling quietly, unsure of how to respond. But that's okay for him. Izuku's quirk now seemed controlled. He at least looked more alive now, less like a stringless doll. \n\n \n\nAfter a long time he saw more tears leak from him, but this time he didn't wipe them away, looking at Aizawa in a way that broke his heart, his voice trembling and childlike.\n\n \n\n\"I miss her so much.\"\n\n \n\n\"I know.\"\n\n \n\n“I… I don't want to let what happen to define who I am forever, but it's \n\nso\n\n hard. I don't want to hate my quirk, hate \n\nmyself\n\n, but I don't know what to do. I think all the time that it would have been better if I didn't wake up, but I don't want to think like that anymore.\"\n\n \n\nAizawa let out his breath slowly. He never imagined how hard it would be to hear it coming out of a child's mouth, especially one he already considered his own.\n\n \n\n\"You are not well.\"\n\n \n\n\"No, I'm not.\"\n\n \n\n\"This is the first step to solving a problem. Admit that it exists, right?\"\n\n \n\nIzuku nodded quickly, rubbing his eyes in vain. Aizawa held his face in his hands, wiping his tears with his scarf carefully.\n\n \n\n\"It's good to know then that you're not alone, that you have help to go through this. I'm here, as well as Nemuri, Todoroki, and that blond idiot hero number one, who for some reason I'll never understand, you like so much.\"\n\n \n\nIzuku smiled slightly and he felt victorious for this.\n\n \n\n\"Even my students, that little shits, and the strange creature who is Nedzu. All of them, here for you. I honestly think it was a bad deal to get so many weird people, but now, unfortunately, there is no return.\"\n\n \n\nThis time Izuku managed a quiet laugh and Aizawa's lip quivered, but he held his blank expression. \n\n\nHe felt Izuku lean back against him, both of them silent. He saw him frown, certainly analyzing the conversation and tried not to smile at this.\n\n \n\n\"Do you-\"\n\n \n\nIzuku paused and he waited patiently for him to arrange his thoughts. When he finally spoke his voice was quiet, almost a whisper.\n\n \n\n\"Do you think one day I'll stop going there? I close my eyes and always go back to that place. As if I could never really leave.\"\n\n \n\nAizawa closed his eyes and sighed.\n\n \n\n“I wonder it sometimes too, when I return to my bad place. I can't tell you that won't happen again, Izuku, as much as I want it, but there's one thing I can guarantee you.\"\n\n \n\n\"What is it?\"\n\n \n\n\"That when you go there, I'll bring you back. You will never be alone again.\"\n\n \n\nHe felt his arms around him, his head on his belly as he hugged him tightly. The muffled voice in his shirt came out in a wet but fervent whisper.\n\n \n\n\"Thank you, Shota. For everything. For not giving up on me.\"\n\n \n\nThe name made him smile slightly.\n\n \n\n\"Any time, Izuku.\"\n\n \n\nThe two went up after a few minutes. They made some tea and turned on the television in some stupid movie until they slept right there on the couch. The next morning when he got up, his neck was aching from his sleeping position. He saw him sitting on the living room floor, lifting Mochi with his quirk gently.\n\n \n\nTrying. \n\n \n\nAnd that was all he could ask for.\n\n \n\nAizawa was sure that they would be all right, then.\n\n\n\n\n\n\n \n \n\n “Trauma is personal. It does not disappear if it is not validated. When it is ignored or invalidated the silent screams continue internally heard only by the one held captive. When someone enters the pain and hears the screams healing can begin.” \n\n \n\n ― Danielle Bernock, Emerging With Wings: A True Story of Lies, Pain, And The LOVE that Heals \n\n \n\nMonths Later\n\n\"What the fuck did you say, Deku ?!  I saw you spinning the bottle with your quirk!\"\n\"I didn't! I'm not a cheater!\" \nIzuku had totally done it, but Bakugou would thank him for that latter, he was sure of it. \nOr maybe not, but he should thank him. \nTodoroki stared at the bottle in the centre with concentration, still trying to understand the principle of the game in vain, but participating anyway, because Izuku was there.\n\"I said playing truth and dare with Bakugou was a bad idea.\"\nIzuku waved his hand toward Jirou for silence, his eyes fixed on Bakugou. It was like challenging a wild animal.\n\"It's just a kiss, Bakugou. Of course, you can always give up the challenge if it's too much for you.\"\n\"Fuck you, Deku! I'm going to kiss the shit hair because I'm not a coward!\"\nPoor Kirishima just looked around with a flushed expression, trying not to be strangled as Bakugou tugged at his shirt, both of them ignoring Kaminari between the two, who didn't know whether to laugh or runway from there.\nIzuku wondered if he was seeing a kiss or a punch between mouths. It was hard to say. Kirishima made a startled sound, but grabbed Bakugou's shirt anyway and pulled him even closer.\nThe others around shouted in disarray. Izuku ignored his own red face with the scene. If he had known they were so eager he would have cheated on the game before. Maybe Bakugou would be less stressed, God knew he needed something good with all the mess that has happened in his life lately.\nHe patted himself in the back for it:  \"Let him never say I'm not a good friend.\" \nEven Kaminari looked red now. Or maybe it was because they were practically on top of him.\n\"Really? In front of my salad? This is getting very explicit.\"\n\"I didn't say you needed to use your tongue, Bakugou.\"\nBakugou dropped the still dizzy Kirishima on the floor and put his finger on Izuku's face, his voice terribly serious, even with his hair a mess and the red colour of his face at the moment.\n\"I'm perfect at everything, Deku.\"\n\"You shouldn't play this kind of indecent game in the dorms! It goes against everything that should be done in a prestigious place-\"\n\"Oh, mom Iida has arrived, the fun is over.\"\nMina threw her hands, everyone starting to disperse, apologizing to Iida.\nAizawa appeared at the door, looking around suspiciously, his eyes pausing on Bakugou and Kirishima.\n“I don't know what happened before I arrived, but I don't want to know either. Izuku, time to go home.\"\n\"Oh no. Don't go!\"\n“The nerd lives on campus, just across two buildings, stop the fucking drama, round face.\nShoto stood with Izuku without speaking, his hand holding his. Aizawa put his head back on the door and measured him up and down, but said nothing. Shoto was good at ignoring when his guardian showed his distaste for their 'excessive attachment' on occasion.\nIzuku was glad to know that Aizawa recognized lost causes.\nThe three left the dormitory toward their apartment. It was a situation that started just weeks ago. When the dormitories were set up for student safety after the Bakugou situation, the teachers also moved and Izuku, of course, had to tag along.\nIt was a good thing, Izuku no longer needed babysitters. When Aizawa had to patrol he could sleep in the dormitory with class A, even though \"the talk\" he had received about the rules he had to follow because of Shoto was something he wanted to forget. Just remembering it already made him feel mortified.\nWhile the cause of the dormitories being built was a bad circumstance that he didn't even like to think about - having people he considered his own in danger was never good for his control, the ensuing camp attack and Bakugo's kidnapping wasn't a very fun week for anyone who had to deal with Izuku - the final situation in all was good. \nHe had everything and everyone he needed close.\nHe felt safe.\n..................................................\nIzuku's room was bigger than before, but not so much. It was crowded with books, notebooks and a computer because writing with his hands was still a challenge. It still had its coloured lamps, Mochi's bed next to his and a glass window, making the place always clear. \nOn his side table was a picture of himself and his mom, alongside others with Aizawa, Mochi, Shoto, Shinsou, the teachers, Nedzu, and the Bakugous, and even the whole class A.\n He was making fond memories, as his mother wanted him to do.\nShoto went straight to his bed and threw himself there. He was another common point in the environment. Shoto was always there.\nIzuku laid beside him, staring at the fluorescent stars stuck into the ceiling. Shinsou had painted a cat in the corner with coloured paint and he could see other doodles from other students who had decided to help him paint his room days ago. They had done a terrible job at it, but he loved it anyway.\nIzuku sighed and leaned closer to Shoto, his quirk on his chest moving satisfied with their proximity. A warm hand touched his and he closed his eyes.\n“Nedzu said that if I want I can enter to the hero course with a recommendation next year.\"\nHe felt Shoto move and opened his eyes, finding him staring at him sideways.\n\"Really?\"\nHe nodded, smiling slightly in amusement.\n\"I'll have to start in the first year, probably. If I accept, you will be my senpai.\"\n\"And are you going to accept it?\"\nHe sighed, looking back at the ceiling. And that was the big question.\n\"Maybe yes, maybe no.\"\nShoto didn't insist, just nodded as if his indecision made perfect sense. Although deep down he knew he would probably accept it. He didn't think he was a hero, but maybe one day he could be one.\n\"I know what you're thinking.\"\n\"I already said you're not a telepath, Shoto.\"\nThe other ignored his joke, sitting on the bed and bringing him along, hands on his face.\n\"You are a hero.\"\n\"I'm n-\"\n\"You are always getting into other's business, Izuku. Just keep quiet and accept it, you're a hero to me\"\nIzuku scowled but didn't refute it. His quirk swayed happily in his chest, the warmth coming from Shoto was always comforting, but looking at his face this close was even more so, especially when he smiled. Shoto had such a beautiful smile. \n\"I don't think it's just my quirk who likes you.\"\nShoto looked at him curiously.\n\"I like you very much, Shoto. My quirk has good taste.\"\nShoto's lip quivered into a small smile, but he kept his voice flat.\n\"That's good, or I'd feel fooled by these last months.\"\n\"You're a good napping partner. We're like two elders, living the best of life, one nap at time.\"\nHearing his laugh was so rare, but it always made his heart lighter.\nShoto's face approached his softly, his hands touching his cheeks tenderly. A light kiss that made him sigh. He stared at him intently, his eyes very close, the same small smile as ever.\n\"For good luck.\"\nIzuku felt light, very light. His quirk expanding in his chest, but there was no shortness of breath or pain, just lightness. He pulled Shoto for another kiss, this time long and deep, feeling his hands running through his hair.\nHe heard a meow near his face and frowned. Shoto withdrew his mouth quickly with an anxious voice.\n\"Hum, Izuku?\"\nIzuku opened his eyes and saw Mochi floating indignantly beside him, notebooks and lamps already reaching the ceiling. Shoto gripped his hands tightly, his legs rising off the floor. Izuku sprang to his feet and held him, both looking alarmed.\n\"Oh gosh. I think I was too happy. Has Uraraka ever been through this?\"\nShoto stared at him in disbelief and he couldn't hold back anymore, laughing freely at his expression. He pulled him closer, his body still floating in the air and kissed him again.\n\"It seems like love can make you float, Shoto.\"\n\"Izuku!\"\nHe looked toward the door and saw Aizawa inside his sleeping bag, floating and looking really unimpressed.\n\"Do you mind?\"\nHe burst out laughing again.\nHe could get used to that kind of happiness. \n\n\n\n.................................................. ....................\nIzuku descended the stairs two steps at a time, the laundry basket floating behind him. He could smell Katsudon, a nostalgia pounding in his chest. Aizawa had finally returned. And he brought food.\n\"Someone is excited.\"\n\"Yagi-san!\"\nHe smiled as he saw the giant man sitting at the dining table, a cup of tea in front of him as Aizawa opened the food package.\n\"Young Midoriya. I decided to pay a visit.\"\nHe smiled excitedly, but before he could run to the man, Aizawa cut him off.\n\"Dirty laundry in the laundry first. And go wash your hands. \"\nHe pouted, but obeyed anyway, listening intently to the conversation in the other room in the process. Something about Mirio and the last case of his internship, which had caused a stir in recent weeks and made Aizawa stay away for a long time. There was someone in the hospital that he needed to see about an uncontrolled quirk. That sure brought memories.\nIzuku knew Mirio, not only because he was the older student who protected the others from him when he lost control that first time that he saw Bakugou, but because of his connection with Yagi. \nMonths after the situation in the clearing the hero had made him a proposal, which he had refused. There wasn't much surprise from the hero for his refusal, but he said he wouldn't forgive himself if he didn't try. \nIzuku was flattered that he had confided in him, found him capable, but he didn't regret the refusal. Mirio had been a good choice in his eyes. It helped that the older student visited them quite often. He enjoyed trying to cheer up Izuku if he noticed him down for whatever reason.\nMirio was essentially a good person. Maybe that's why even Aizawa liked him.\nHe came back almost running and heard a laugh from Yagi at that. He gave the skinny body a quick hug and received a pat on the head in return. Aizawa rolled his eyes at them, but Izuku knew that he was smiling. A little. Perhaps.\nHe was smiling inside, he was sure. \n\"After dinner, we have something to talk about.\"\n\"Hum? About what?\"\n\"Someone else who might will be living in this house soon.\"\nHe stared at his guardian curiously, but also cautiously. He looked at Yagi in consideration and noticed him turn red.\n\"No, your Gremlin, it's not him. Her name is Eri.\"\nAizawa sighed and sat at the table.\n\"Problem child.\"\n.................................................. ....................\nWhen Izuku found out about Eri's situation, everything she went through, a sense of camaraderie hit him deeply. Eri, whose uncontrolled quirk on awakening had caused her father to cease to exist, who had been so hurt and used by others until she was rescued. Eri who hated and feared her quirk so much that she firmly believed it was a curse.\nIzuku knew there wasn't much that wasn't going to do for her. Aizawa must have known that too, the man knew Izuku more than anyone.\nIt only took five seconds when he saw her. His quirk expanded in his chest in curiosity and affection, pulling a breeze on her face where she was hidden behind Mirio, clutching at his pant leg. It was not unlike what Izuku used to do with Aizawa in the beginning.\nWell, he still did it sometimes. \nBig, cautious red eyes stared at him and he smiled, kneeling to show her Mochi in his arms. She looked at Mirio and then at Aizawa until she finally got up the courage. The small, curious hand lifted slowly, sinking into the white fur, eyes widening at the purring vibration.\nShe looked at Izuku and there was a strange understanding between the two.\nIzuku never imagined it was possible to love someone so fast and so easy.\n.................................................. .....................\nFrom there he could see the fireflies on campus, among the trees that covered the walkway. From afar there was the dormitory entrance and the main building. \nUsually, in this position, he could send Morse code messages with the flashlight to the other students in the Class A dorm, especially Shoto. Occasionally he exchanged curses with Bakugou like this, but if Iida saw them doing it he felt very guilty, so he avoided it nowadays.\nIzuku shifted better on the blanket, his back against the roof, Mochi on his lap. Inside his chest, his quirk pulsated happily. \nWithout all the previously negativity related to her, he could better understand the feeling now that he was not trying to choke it at all costs. He hadn't been able to recreate what Aizawa had said he saw after he fought Stain yet, but with Tokoyami's help, he could already see it. Expanding inside his chest like a balloon, opening to leak through his pores, taking shape around him, whitish and warm, surrounding him like a blanket. \nLike his mom's hugs.\n\n \"I won't let them hurt you anymore.\" \n\nHe touched his chest and smiled. Maybe his quirk wasn't broken after all. They just needed each other to live. \n\"What are you doing up there, Problem child?\"\nIzuku looked down and saw Aizawa with his head out the window, looking at him in exasperation.\n\"It's a beautiful night.\"\nThe man rolled his eyes and mumbled something, but soon he had his legs out the window, easily climbing to the roof with him.\n\"What are you thinking about with that face?\"\nHe laughed at the suspicious question, but it was fair. Izuku had no good track record in making good decisions.\n\"My quirk.\"\n\"Hmm.\"\nThe man looked at him with interest, lying tired beside him. Eri must have been sleeping. Since Mochi was here with him, today must have been a good night for her. The cat always seemed to know when the little girl needed her, just as she always knew with Izuku. It was common for Mochi to bring him to Eri.\nThe first nights had been hard. He remembered that his had been, too. Luckily, Eri, like him, had a group of people for her. She would be fine. She had Aizawa, Aizawa always made things better.\nIzuku opened the blanket and settle some at his legs, receiving a satisfied sigh.\n\"And?\"\n\"Maybe it's not exactly like Dark Shadow, but similar. In parts.\"\n\"That doesn't answer much. Your quirk makes no sense.\"\nIzuku pouted. He moved closer and received a pat on the head.\n\"Problem child. With his problem quirk. Who is my problem now.\"\n\"Good thing erasers are good for erasing problems.\"\nHe received a painful pinch in his nose over this one, but he regretted nothing. Aizawa put his hands behind his head and observed with interest the pillows and sheets, lamps, and plush toys scattered on the roof.\n\"Hmm. So this is where you and Eri hide.\"\n\"She likes to see the fireflies.\"\nAizawa rolled her eyes at his defensive tone.\n\"And playing on the roof is very safe.\"\n\"You know that my quirk levitates things right? Just to confirm. With your age and everything-\"\nAizawa tried to grab his nose again but he hid his face with a laugh.\n\"Cheeky little thing. Maybe I should separate you and my students, you're gaining attitude with all the bad influence. \"\n\"You love us.\"\nHe saw him roll his eyes, but there was no denial there. One arm pulled him closer.\nMochi, napping on his chest, didn't even stir.\nHe felt safe, satiated as his quirk. Light, warm and satisfied.\nIzuku no longer dreamed about the door.\n \n\n\n\n \n\n\n\n \n\n \"It's about the journey - mine and yours - and the lives we can touch, the legacy we can leave and the world we can change for the better.\" -Tony Dungy \n\n \nAt first, Tokoyami didn't know exactly what to think about Izuku Midoriya.\nAt first glance, he looked like a strange creature, which coming from him just proved how true that was. He didn't say that just because he was a contradiction: with some childish behaviour, but with very old doe eyes. Or even for the strange relationship that he had with some of his colleagues and even Aizawa-Sensei.\nNo, the reason was the reaction he produced in Dark Shadow.\nFrom the first time he had seen Midoriya, the creature that was his quirk had been alert and that made him wary. There was curiosity coming from the shadowed beast and he even detected some fear.\nLooking at Midoriya, who looked so fragile, it was hard to understand the feeling. Even when the others commented on the destruction he had caused against Bakugou, Tokoyami still couldn't understand the reason for these strange feelings the other boy generated in the creature that had him as his host.\nThat was until Aizawa-Sensei came to talk to him one afternoon, a month after the internship.\n\"So, it is like Dark Shadow. \"\nThe man nodded, his expression looking even more tired as he led him across campus to a practice area. He had been wary of the offer and request at first. Even when his class had wrapped itself around the strange creature that was Midoriya, he had kept his distance. But now curiosity spoke louder.\n“Well, it is definitely sentient.”\nWhen they reached the entrance he saw Midoriya. Todoroki was there, which was not a surprise as the two always seemed to be together. Bakugou being there too, however, was a surprise.\nDark Shadow stepped out and looked toward the other boy, torn between confusion and curiosity.\nThe teacher paused and turned before they entered, staring at him seriously.\n\"Tokoyami, first of all, you need to know that Izuku's relationship with his quirk is very complicated.\"\nTokoyami could understand the feeling. If the situation was like his own, he'd had trouble with his quirk, too, until he had made peace with it, even though the occasional loss of control still fueled his nightmares.\n“Only recently has he agreed to train again with it, but the situation is still delicate. I count on you to help him.”\nHe was taken aback by the sincerity in the hero's voice. His chest tightened with a strange feeling. It was ... peculiar to feel important that way.\n\"I'll do my best.\"\n\"That's all I ask.\"\n………………………………… ..\nThat day Tokoyami understood some things about Midoriya.\nThe first one was that he was right in his assumption, Izuku Midoriya was a strange creature. Even though he was less debilitated than when he first saw him, he still looked fragile beside the others. Like Tokoyami himself, his quirk also prevented him from developing in stature further, but what in himself was offset by his dark appearance, in Midoriya the effect was the opposite. He looked harmless and defenceless.\nUntil his quirk kicks in.\nThat was the second fact about Midoriya: he was dangerous. It was like watching a calm lake in the surface that carried inside destructive creatures with apocalyptic forces. The potential for destruction was something they had in common, the fact that they carried something monstrous within themselves, being the guards who held the destruction, was something that brought them camaraderie.\nWhen he realized this, his decision was already made.\n…………………………………………… ..\nDark Shadow was still cautious, but curiosity seemed to have gained in him as well.\nHe watched as the beast seemed to sniff around the other boy sitting on the grass, embarrassingly accepting Midoriya's affection on his head.\nTokoyami coughed in embarrassment.\n“How does your quirk feel like?”\n\"It's like a balloon.\"\nMidoriya blushed at the childish example and looked at Aizawa-Sensei. The man motioned for him to continue.\n“A balloon, expanding in my ribcage. At first, it was suffocating, I couldn't breathe. It was like a panic attack. ”\nHe pondered that. There was some familiarity.\n\"Not anymore?\"\n\"Not always. When I feel calm, the balloon opens instead of expanding. What's inside escapes through my body and I can feel it coming out of me. I ... I can't explain the sensation well, but it feels warm. ”\nDark Shadow came back to him and he touched the beast head absently. \n\n “Definitely familiar, but still different.” \n\n“Sensei said there was a white mass, right? Do you remember the feeling? ”\n“I don't remember anything when it happened. Do you think you can help me? ”\nTokoyami studied the other, with his big and hopeful doe eyes staring at him.\n\"I don't know how similar our situations are, but we can try.\"\nMidoriya smiled. \nThey both purposely ignored the weights floating behind them.\n……………………………………………\nIn the months that followed the two created a pattern.\nWeekly they trained together after school at least once. Not a bad deal, as it helped him as well, and it was also interesting to see Midoriya's progress. At first, it was impossible not to notice how he didn't trust his quirk at all, and when he knew the reason he could not blame him for it, but eventually, he tentatively gave himself over to his power.\nThe first major breakthrough they made was what Midoriya titled, childishly in his view, as 'blanket'. A whitish layer appeared around his body, which he could spread across the floor and even other people. It was hot to the touch and they found it very hard to penetrate.\n“It's a protective barrier.”\nAizawa-Sensei concluded and Tokoyami noticed Midoriya's expression becoming distant. When he nodded his smile was tinged with melancholy.\n\"Let's continue. Do you think you can expand it? ”\n…………………………………………\nThey made the second big progress weeks later. With the exams for the provisional licence and latter the internships, Tokoyami had failed to go to some of the practices, so it was a surprise when he got there and saw the whitish mass around Midoriya, coming out of his chest and circling him in motion.\nDark Shadow left without his permission and for a moment he thought they might have a clash, but his beast just looked curious.\nTentatively, the shadow approached Midoriya and they saw the whitish mass extend, touching his quirk gently before receding, curling around Midoriya.\nTokoyami felt a warmth seize him momentarily at the touch, but it was not an unpleasant sensation at all.\nMidoriya seemed quite pleased with himself.\nDark Shadow rubbed his shoulder and he heard the whisper of the beast as he was still staring at the white mass.\n\"Warm.\"\n……………………………………………… ..\nSomehow over the days more and more class A students began to break into their training trying to help.\nMidoriya didn't seem to mind it, smiling shyly at their greetings.\n……………………………………………… ..\n\"-And maybe the telekinesis comes from her and not from me.\"\n\"Her?\"\nMidoriya paused in his endless mumbling and his face flushed, looking at Todoroki who had asked the question.\nHis green eyes widened as if only then had he realized what he had said.\n\"Ah yes. I think I keep thinking about my quirk as a 'she' for a  while. It seems ... right? ”\nIt was not such a difficult concept to understand or so absurd. He was nobody to judge that.\nAizawa-Sensei patted the other boy's head with a slight smile on his face.\nDefinitely progress.\n\"Do you think you can shape it...her?\"\n\"Hmm?\"\n\"Like Dark Shadow, except it always had a shape, but it doesn't hurt to try.\"\n…………………………………………………………………………… ..\nFor some reason, when Midoriya finally managed to shape the white mass a week later, Bakugou had choked on a laugh. Midoriya puffed out his cheeks and threw him away into the air.\nMidoriya had shaped the white mass into a cat.\nA giant  monster  cat, with whitish eyes and shifting white fur made of pure energy. Which would be scary if it wasn't rubbing himself into Midoriya like that and liking his face as if there was no tomorrow. \nAizawa-Sensei crossed his arms, an interesting reaction, as if he was holding himself to not go over and hug Midoriya. And the cat too, probably. \nAshido and Kaminari didn't hold back as much and they were clinging to the smaller boy in seconds, rubbing his hair and calling him their \"precious.\"\n \"Okay. Let's try again.\"\n…………………………………………………………… ..\nTokoyami felt Bakugou stiffen at his side and even Aizawa-Sensei held his breath.\nBehind Midoriya the form became a humanoid body, a white shadow with a small, feminine silhouette. Her arms encircled Midoriya's shoulders from behind, floating on his back like a protective angel. He opened his eyes and turned his face back.\n His expression was a mixture of joy and such sadness that he almost looked away.\n\"Hi, mom.\"\n…………………………………………………………\n“So, as far as we know, my quirk can change her shape the way I want it, which is pretty cool and useful. The more fuel I have, the bigger she can get and also denser. The denser, the more protection she gives to me. Her weakness is definitely cold and my control over her involves my emotions. ”\n\"Not forgetting telekinesis with almost apocalyptic potential.\" \nTodoroki mentioned, his chin settled on Midoriya's head where they were sitting together at the table, watching as he wrote in the notebook with trembling fingers.\nBakugou rolled his eyes and pulled his notebook away roughly, writing what he needed himself. Tokoyami wondered if this was his way of being kind. It was a strange concept to think about.\nThey all were at the tables under the trees. Usually, he was always looking for a quiet place at the break, but somehow it was hard to say no to Midoriya when he asked for something. It did help that Dark Shadow seemed to be calmer around him, or more specifically, his quirk.\nAt that very moment the whitish mass, again in the shape of a cat, was rubbing against the shadowy beast.\nHow embarrassing.\n“It can detect heat as well and steal heat from other sources. I think that's it? ”\nKaminari raised his hand, even though the question was rhetorical.\n“No one will comment on how Izuku has a Patronus as a quirk? Or that Dark Shadow has a crush now? ”\nEveryone started talking at the same time.\n……………………………………………………… ...\nIt was Christmas. \nUsually, Tokoyami didn't get involved in such festivities, but it wasn't all bad at the moment.\nMidoriya was sitting on the floor with Eri on his lap, both admiring the gift Tokoyami had given to her. Every little girl, after all, needs a giant sword to defend themselves.\nTokoyami was very proud of his choice of gift. The sword went to someone  worthy.  \n“I went downtown today, to register my quirk officially.”\nTokoyami looked at the other with curiosity. Midoriya smiled toward him, looking more relaxed even though his eyes were still so old. Todoroki was dozing off near them, with Eri patting his head softly. It was a bit admirably how his colleague could nap at any place.\n“Tokoyami-Kun, I appreciate everything you did for me. You helped me so much.”\nThat same sensation took over his chest. It was good to be of help to someone. After all, he wanted to be a hero.\n“You're welcome, Midoriya. I am always ready to help a fellow guard to understand the beasts he carries inside. ”\nMidoriya chuckled at that and Tokoyami smiled pleased.\n\"If you'll allow me to ask, what name did you give her?\"\nMidoriya's smile grew more melancholic, his eyes shifting to Eri who was watching them curiously. The little girl smiled at him softly. \n\"Legacy. Her name is legacy. ”\nTokoyami nodded solemnly. Knowing Midoriya's story he could understand the depth of this name.\nIt was an admirable choice, as Inko Midoriya had been a admirable woman, no doubt.\n\"And I will become a hero with her.\"\nTokoyami had no doubt about that either.\n \n\n\n"
}