{
    "id": "20825921",
    "url": "https://archiveofourown.org/works/20825921?view_full_work=true",
    "author": [
        "carolinaa"
    ],
    "title": "mouth shut (eyes down)",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Aizawa Shouta | Eraserhead & Midoriya Izuku"
    ],
    "characters": [
        "Midoriya Izuku",
        "Aizawa Shouta | Eraserhead",
        "Todoroki Shouto",
        "Midoriya Inko"
    ],
    "additional_tags": [
        "Bullying",
        "Emotional Hurt/Comfort",
        "Trust Issues",
        "first year",
        "Implied/Referenced Child Abuse",
        "Angst",
        "Canon-Typical Violence",
        "Childhood Trauma",
        "Podfic Available"
    ],
    "language": "English",
    "series": "",
    "published": "2019-09-30",
    "completed": null,
    "words": "5,823",
    "chapters": "1/1",
    "comments": "353",
    "kudos": "25,722",
    "bookmarks": "5,079",
    "hits": "187,892",
    "summary": "<p>Teachers and Izuku don't mesh well. If Izuku speaks up, he gets in trouble. If Izuku gets picked on, he gets in trouble. If Izuku lets his guard down for one second, he gets in trouble.</p>\n<p>Izuku isn't stupid. He knows UA isn't going to be any different.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>i'm on tumblr @officialratprince ! thank you for reading, i'm so amazed by how this fic has taken off. i love you and have a safe day.</p>",
    "text": "Teachers lie. \nIzuku learns this lesson a few weeks into his first year of school. His teacher (well-meaning, but a liar) brings in someone from the school leadership to talk some gooey feel-good words about how bullying won’t be tolerated, and how it’s important to be nice to each other.\nIzuku is nothing but nice to people in his class--and when he  isn’t , it’s an accident and he tries to fix it. He volunteers to pass out whiteboards when it’s time to practice writing (even though Kacchan and his friends always trip him as he walks past), and he even shares his crayons (even though the others always snap them right as they’re handing them back to him, laughing behind their hands as he gets teary-eyed). \n“If you feel like someone’s not treating you nicely, ask them to stop first, and then find a teacher. We’ll take care of it,” his teacher promises the class.\nIzuku feels  everyone’s eyes on him. They’re staring, because they know that Izuku’s the one who got blasted ten yards across the playground yesterday, and who shook and cried even as he got to his feet, only for it to happen a second, third, fourth time (before Kacchan got bored). \nBut Izuku is desperate to make just one new friend. He thinks (misguidedly) that maybe if a teacher reminds everyone to just be  nice to him, maybe someone will finally sit with Izuku at lunch.\nIzuku goes up to his teacher after class has let out and tugs on her sleeve and says, “I need to tell you something.”\nShe puts her hands on her knees and leans down to be eye-level with Izuku. “What is it, Midoriya?”\nHe whispers, “Sometimes the other kids aren’t...nice to me.”\nShe watches him, and Izuku watches her face meld into concern. (He realizes, even at six years old, that it doesn’t look exactly real.) “Like who? Can you give me an example?”\nIzuku grips the straps of his backpack and ducks his head to the floor. His voice is so quiet that she chides him to speak up and repeat himself, but the second attempt is still almost inaudible. “Um, like Kacchan. Sometimes. Yesterday he kept using his quirk on me and he does it to some of the other kids too.”\n“Did you ask him to stop?” she asks.\nIzuku frowns, but he doesn’t dare look up at her. “Yes. He never listens.”\n“I’ll talk to him about it tomorrow,” she says. (Lie.) “His quirk is so powerful, it might be an accident that he uses it, so maybe we could try to be a little more patient with him. He can’t control it very well.” (Lie.) “I appreciate you speaking up, but I’m sure it won’t be a problem for much longer.” (Lie.)\n“Okay,” Izuku says, because he doesn’t recognize those lies yet. He has an idea that things aren’t going to go exactly  well , but he believes to some extent that his teacher’s just somehow missed the teasing that Izuku is the target of. He believes that she has some power to do something about this. \n“I’ll see you tomorrow,” she says. Smiles.\n“See you,” Izuku says, and then weaves through the school to take the back exit in hopes of avoiding Kacchan on the way home. (He isn’t successful.) \n \nThe next day at recess, Kacchan towers over Izuku and corners him against the wall of the school. Kacchan says, with explosions popping out of his hands, “I heard you  tattled. What did you think was gonna happen? Even the teachers know you’re useless. They agree with me.”\n“I didn’t,” Izuku insists, too late. “I didn’t say anything.”\n“Teacher called my mom,” Kacchan says. He sneers, and blasts Izuku backwards. “You can’t even  lie good.”\nIzuku knows that this is all in plain sight of the classroom window. He turns his head, trying to seek out his teacher, hoping that she’s seen something. \nHe makes eye contact with her. And then she looks away, pretending like she’d never seen him at all as she returns to her computer. \n \nTeachers don’t believe him.\nIn fourth grade Izuku turns in a short project about what he wants to do when he grows up, and his teacher looks at the title of the paper and the corners of his mouth visibly turn up in an incredulous smile. “Midoriya,” he says, “I asked for you to put real thought into this.”\n“I did,” Izuku insists, his heart sinking. He looks at the project, which is a paper combined with a small collage of photos and drawings and newspaper clippings, which he’d poured his heart and soul into for two weeks. \n“I can’t give you a good grade if you aren’t going to take this seriously,” his teacher says. He hasn’t even  looked at the plan Izuku had laid out for becoming a hero even without a quirk--it’s like the teacher doesn’t care at all. “It just seems like you think this is a joke.”\nIzuku’s vision is getting watery. The teacher might as well be holding Izuku’s entire heart in his hands, considering the effort that Izuku had put in to making his life plan plausible to an outside observer. “Sensei, I promise I don’t! I t-tried my best and--”\n“Deku’s crying again,” says a classmate, and everyone turns to look at him. The first classmate laughs, harsh and loud--and almost everyone joins her.\nIzuku sees Kacchan zero in on the assignment that Izuku had just handed in. “Deku, are you still trying to say you’re going to be a  hero when you grow up?”\n“I--” Izuku blinks rapidly, and tries to sit up straighter to stand up to him. “I  am gonna be a hero.”\nHis classmates only laugh louder at him. Izuku looks to his teacher, pleading, but his teacher looks like he’s on the verge of laughter too.\n“Midoriya, it doesn’t hurt to be realistic,” is all his teacher says. Izuku stares at his desk and watches tears splash onto it.\n \nTeachers don’t like Izuku.\nHe realizes this in middle school (maybe a little late on that realization, but Izuku had held onto optimism of being proved wrong for a bit too long). He doesn’t know what else he can do to redeem himself for his quirklessness. He does every assignment on time and he does extra credit and he raises his hand in class (he raises his hand in class until he gets too much attention from his classmates and the teacher starts glaring at him whenever he wants to speak up). \nThey  hate him, as a rule. Parent-teacher conferences prove this, year after year, and finally in middle school, Izuku stops pretending to himself that it’s ever going to get better.\nThat year, a teacher says, “He just gets in too many fights, Mrs. Midoriya. I’ve never had a student who provokes others so easily. Midoriya is a real problem child in our classroom.”\nAnother says, “His  incessant mumbling is a distraction to the other students. It’s unfair to the others that he cannot seem to keep his mouth shut.”\nYet another says, “He would get along better with his peers if he could get his head out of the clouds for just one day. It just seems as if he doesn’t care enough to pay attention to the reality of his situation.”\nIzuku watches the floor, and tries not to cry as his mother keeps shooting him confused glances. \nOn the way home, he doesn’t talk much. Inko tries to get him to explain himself, to help her understand why the picture the teachers have painted is so different from what she’s seen of him. Izuku has become quieter the past few years; he doesn’t tell  anyone what he goes through on a day-to-day basis (no one would do anything about it anyway), so he supposes he can’t be upset with his mom for not defending him better against the teachers.\n“You have got to stop fighting, Izuku,” Inko finally says. \n“Okay,” Izuku says, tired, forehead pressed to the window. His stomach hurts. “Sorry.”\nThe car is silent after that.\n \nSo, basically, teachers and Izuku don't mix. \nUpon starting at UA, Izuku had come armed with his knowledge of school--ready for anything. And UA is so much  better  than school has ever been before. He has friends, now, for one. Izuku has people to sit with at lunch, and a buffer of two or three people whenever Kacchan walks by, and people listen when Izuku goes off on fifteen-minute tangents (even if they're about something stupid).\nWhen he’s walking through the halls, he isn’t scared (usually) that someone’s going to shove him down, and he isn’t scared (usually) that someone’s going to throw his backpack into the mud, and he isn’t scared (usually) that Kacchan’s going to sauté him like an onion at any given moment.\nBut Izuku still doesn’t trust teachers as far as he can spit. (Even All Might, who  seems  to like Izuku, is probably still capable of laughing in Izuku’s face if Izuku ever tried to tell him about the years of torment he experienced at the hands of his classmates. Teachers just don’t do anything about that sort of thing.)\nIt doesn’t matter that Midnight pinches his cheek when he pulls off a good art portfolio first semester, telling him she’s proud of his work (she wouldn’t knock Kacchan out if he leaped at Izuku in the middle of the hallway). It doesn’t matter that Present Mic doesn’t shut Izuku up when Izuku gets carried away asking about Present Mic’s quirk after class (Present Mic will turn on him in a second if Izuku starts mumbling in class too much). Teachers at UA are better about at least  pretending to care, but Izuku doesn’t trust them. He can’t.\nThe teacher who gets the brunt of Izuku’s distrust is Aizawa, if only because he’s the one they spend the most time with.\nAizawa doesn’t dole out much praise to anyone. But nobody else in the class gets glared at as much as Izuku, he’s pretty sure. And nobody else in the class gets the nickname  problem child, and Izuku is painfully aware of this.\nIzuku is good at internalizing. He’s been dealing with it for a long time, after all. He can almost pretend that an annoyed glance from Aizawa doesn’t hurt Izuku any worse than the broken finger he’s statistically likely to be sporting.\n \nThe distrust carries deep into his first year. \n'Distrust' is a bit harsh, really. Izuku has seen the way that Aizawa had leaped into battle for them and gotten his face smashed in just to protect Tsuyu at USJ. As far as Izuku’s aware, Aizawa has always answered his phone when someone in the class has needed him--even when it was just an anxious Koda trying to prep for the sports festival.\nSo, it’s not exactly  distrust. Izuku can’t think of the right word. \nEither way, there’s a reason why he’s shaking right now, standing in front of Aizawa. \n“Do you want to explain yourself?” Aizawa asks, his voice quiet, dangerous. It’s just him and Izuku in the classroom--the other kid is long gone. “I just want to understand.”\n(Teachers lie.)\nIzuku doesn’t say a word.\n“You know that it’s unacceptable to fight your fellow students,” Aizawa says, “so I figure that you have a reason to explain your actions.”\n(Teachers don’t believe him.)\nIzuku wipes at his bloody nose with the back of his ruined sleeve. There’s already a small puddle of blood on the classroom floor.\n“You’re a problem kid, but usually not without reason,” Aizawa says. It seems like a ploy, to make Izuku feel like Aizawa cares about him specifically. \n(Teachers don’t like him.)\n“Midoriya, tell me what happened.” Aizawa isn’t asking, anymore. He’s commanding. \n“He was--the upperclassman was pushing him around,” Izuku says to the spatter of blood on the tiles. “Nobody else was going to do anything.”\nHe doesn’t need to look up to know that Aizawa’s lip is curling in displeasure. “Any teacher would have intervened on your behalf.”\n(Teachers don’t intervene.)\n“I was the only one there.” Izuku hunches his shoulders. “Is he going to get in trouble?”\n“The upperclassman? Yes, there will be--”\n“No, the--the kid from the business course.” \nAizawa pauses at that, like he hadn’t thought Izuku would care about that kid (as if Izuku hadn’t  been that kid for most of his life). He says a slow, confused, “No.”\nIzuku lets out a relieved breath. He wipes his nose again. He’s going to have to look out for the business course kid again, because Izuku’s pretty sure this isn’t the first occurrence, but that’s fine. If it’s just Izuku and the upperclassman in trouble, Izuku can deal with that.\n“Go see Recovery Girl,” Aizawa finally sighs, when it’s clear that Izuku won’t be offering any more explanation. “And don’t let this happen again.”\n \nIt’s kind of harsh, but Izuku’s the only student who seems to know the truth of the situation. He watches Tsuyu say confidently that  Aizawa  can help. He watches Yaoyorozu casually express her confidence that  Aizawa will know what to do. \n(Maybe that’s true, for students who are likeable and good. Izuku is neither of these things.)\nThere are a lot of things that Izuku would bring to Aizawa’s attention, if he knew Aizawa would do something about it. Izuku would tell him that the upperclassman he’d gotten into a fight with still picks on non-hero-course first-years sometimes. He would tell Aizawa that sometimes Uraraka comes to school so hungry that she’s nauseous even  before they start training. \nIf he knew Aizawa would do something, he would tell Aizawa that Endeavor is the biggest piece of shit alive.\nBut Aizawa  wouldn’t do anything, especially against the Number Two Hero, if Izuku was the one who told him. It hurts, but that’s just the reality--and Izuku doesn’t want to see Todoroki hurt like that, for Todoroki to have his fledgling trust crushed like that. So nobody says anything about the issue at all.\n“Aizawa won’t do anything,” Izuku says. His hand skates over the gauze wrapped around Todoroki’s forearm, which will be hidden by Todoroki’s jacket, but the nasty burn on Todoroki’s neck is going to be harder to hide. \nTodoroki looks like he wants to trust Izuku. “You think?”\n“Yeah,” Izuku nods. He swallows the lump in his throat. “Teachers turn a blind eye to this kind of thing, usually. You don’t need to worry.”\n“Okay,” Todoroki says. He pulls his coat back on. Even though he hasn’t seemed exactly  nervous  thus far, because Todoroki doesn’t do that, there’s something more relaxed about him now. (Izuku wishes he could be similarly reassured. He hates seeing Todoroki show up to school like this.) \nIzuku walks with Todoroki to class. They sit and chat with friends and nobody notices Todoroki’s haggard appearance (or maybe they just don’t want to say anything).\nWhen Aizawa asks Todoroki to stay and talk to him after class for a moment, Izuku  knows he sees the burn on Todoroki’s neck. Trying to keep one ear on the conversation going on, Izuku packs his things up very slowly.\n“If there’s something you need to talk to me about,” Aizawa says pointedly, “I’m always here to listen.”\n(Teachers lie.)\n“This was a training accident. My fault,” Todoroki says, his voice betraying nothing. “But thank you.”\n“Hmm,” Aizawa says. “Recovery Girl may have some salve for it, anyway. I’ll write you a note.”\n“I already put something on it,” Todoroki says. Izuku sees him look wistfully at the door, as if he wants to be anywhere else. “Thank you for your concern.”\nTodoroki is dismissed, and Izuku tries to take off after him, but Aizawa puts out an arm to stop Izuku in his tracks. \n“If there was something going on,” Aizawa says, in a lower voice, “you would tell me?”\n(Teachers don’t believe him.)\nIzuku wants to tell Aizawa. He’s been told  many times that it’s important to tell an adult if someone’s in danger--but it never does any good for Izuku, or for anyone that Izuku drags down with him. \n“Yes,” he lies. “Of course!”\n \nIzuku isn’t sure how long he’s been followed, but he’s two blocks from UA one morning when he happens to glance over his shoulder and sees someone pursuing him. It’s definitely the same person that’d sat across from Izuku on the train, because he’s wearing a weirdly light jacket for this time of year, and he’s staring right at Izuku.\nIzuku holds eye contact a little while too long to be casual. When he turns to hurry on his way to school, he hears footsteps pick up behind him, feels the person tailing him closely enough to almost step on Izuku’s heels.\nIt’s a crowded street. Izuku, in his UA uniform, isn’t going to get attacked in the middle of this crowd. (Is he?)\nHow long has someone been following him? Izuku’s been so wrapped up in daydreams about his upcoming internship that he hadn’t been paying attention at all. Does he know where Izuku lives? Is he targeting Izuku specifically?\nIzuku makes it into the gates of the school without getting murdered. His pursuer blends into the customary mob of reporters in front of the gate, and Izuku can’t see him when he looks over his shoulder.\n \nIzuku is followed again the next day. He knows this, because he’s late and has to take a later train, and the man’s waiting for him at the train station. He sits across from Izuku and stares at him the whole ride, and Izuku squirms and keeps his eyes trained on his phone and desperately tries to think of what to do.\nWhat would he do if someone else was being followed? Izuku knows that if  Uraraka was the one being tailed to school, he’d insist on getting a group to walk with her, or he’d tell her to tell a teacher, or he’d go to the police. \n(Teachers don’t believe him.)\nIzuku doesn’t know what he’d do if he told Aizawa, only to have Aizawa tell him he was saying it for attention--only to have Aizawa look at him with contempt and tell Izuku to stop daydreaming and focus on internship prep. \nThe train begins to slow to a stop. Izuku’s thumb hovers over Aizawa’s contact information in his phone, because he  should tell Aizawa. He should at least let Aizawa know that Izuku is going to be late for first period.\nThe man following Izuku puts a hand on Izuku’s shoulder as they leave the train station, and Izuku jumps. He clicks his phone off and braces for what’s to come. \n“Midoriya, right?” the man asks. “I’m  such a fan. Could you give me your autograph?”\nIzuku’s being steered towards an alleyway. He squeaks, “Uh, sure?” even as he digs in his heels and tries to stay out on the street. \nThe man wraps his arm tighter around Izuku’s shoulders, and laughs like he and Izuku are good friends. That’s why nobody even glances at them as Izuku’s pushed into the alley, and out of sight of passerby.\n“Great,” the man says, smiling widely. He pulls a photo out of his pocket, and shoves it in Izuku’s direction. “Could you sign that? I really just need your name.”\nSomething about the phrasing makes Izuku uncomfortable. It’s why Izuku breaks the man’s hold around his shoulders, and stutter-steps backwards, and says, “Actually, I’m sorry, I’m--late for s-school and I should--”\n“Just a quick signature,” the man insists, and then slams a hand into the wall so that Izuku’s boxed in, his exit blocked. “For my kids.”\nIzuku takes the photo, hands shaky, and the man’s newly-free hand goes to a  knife at his side.\n“Who do I make it out to?” Izuku asks, his voice almost inaudible because he can’t breathe. He wonders if he’d get yelled at if he broke just one of his fingers to escape this situation. (He probably would.)\nHis phone buzzes a few times in his pocket, incoming texts that are most likely from Kirishima or Uraraka. (He’s officially late for homeroom.)\n“Just your name is fine,” the man says. He leans closer, crowding Izuku against the wall even further. His hand closes around the handle of his knife. “Write it already.”\nLooking closer, the photo isn’t even of Izuku at the sports festival. It’s a shot taken of Izuku boarding the bus with a few of his classmates, taken from a distance. \n(Izuku hasn’t taken the bus for a few weeks. This photo is from before the sports festival.)\nIzuku’s  scared. That’s why, when the man makes a sudden move (maybe just shifting his balance, maybe just adjusting his angle), Izuku flinches and flicks his finger and blasts the guy across the alley into the opposing wall. \nThe man hits the wall, slides to the ground, and snarls, “You  shit,” as he scrambles back to his feet. Izuku, reeling from the pain in his hand, bolts, but is caught around the waist and hauled backwards, thrown bodily into some trash cans. \n“Just fucking  write your name,” the man snarls, “that’s  all you had to do.”\nIzuku rolls, gets to his feet, sheds his backpack. The man is standing in front of his only exit, now brandishing his knife and approaching again. \nIzuku shoves the photo into his pocket. (If anything, it’ll give him evidence that he’s not lying when he inevitably has to tell someone about about this encounter.) “Excuse me, I need to g-get to class,” Izuku says. \nThe man swipes with his knife, and Izuku leaps backwards. The man swipes  again, and Izuku trips over a fallen trashcan and slams into the ground elbows-first and swallows his cry of pain as he stares up at his attacker, can only stare as the man swipes a third time and carves a sharp line across Izuku’s chest before Izuku can recover or block.  Stupid, to get tripped like this, but Izuku can’t focus on that  .  \nIt’s just a graze. It means that the man is close. Izuku kicks out and channels his quirk through the top of his foot and sends the man flying sky-high. \nIzuku clenches his teeth around a scream as his foot and shin both fracture in a few places, but he doesn’t have time to wallow. He staggers to his feet and runs for the end of the alley.\nThere’s a massive  thump  behind him as the man hits the ground, and a  crack as a few of his ribs break on impact.\nIzuku stumbles out of the alley into the way of pedestrians, and hears a shocked scream. He grabs the first person he can reach, and asks, “Could you call the police?”\nThe woman stares at him. \n“Please don’t be worried, I’m fine! I just need to make a report,” Izuku asks. He’s feeling dizzy, and his leg is threatening to give out. “I need…”\n“Kid, you’re  bleeding!” she exclaims, her face pale. People are beginning to gather, chattering anxiously. “Sit down!”\n“It’s okay!” Izuku insists. Smiles. “But please, could you call the police?”\nShe pulls her phone out, but she’s still staring at him in horror. Before he can reassure her again, Izuku’s knee buckles, and he hits the pavement hard. He’s out cold before anyone can do anything else to help him.\n \nIzuku...loves morphine.\nIt’s not often that he’s given it, because if he uses it every time he’s in pain then he’ll develop a dangerous tolerance before even graduating, but Izuku wakes up from a deep, comfortable sleep and blinks groggy eyes at the blank ceiling of the medical wing and feels painkillers making his whole body feel fluid and heavy and warm. He has to admit that it’s preferable to feeling...whatever injury he’s sustained this time.\nWhy is he here again?\nHe turns his head, and sees Aizawa sitting there. Izuku starts, sitting up fast enough that his head swims and he thinks he’s going to throw up.\nAizawa doesn’t lecture him right away. He’s almost somber. “How are you feeling?” he asks Izuku quietly. \nIzuku wonders what day it is. He wonders where All Might is. He wonders where  Recovery Girl  is, because it’s just Izuku and Aizawa; the rest of the room is silent and sterile and empty.\n“I feel fine,” he tells Aizawa, then looks down to his lap. His broken finger is splinted, and down at the end of the bed, he sees that his foot is encased in a boot. When Aizawa doesn’t say anything else, Izuku dares to ask, “Am I in trouble?”\nAizawa huffs a laugh, almost inaudible. It’s more of a sharp exhale than anything else. “How about you tell me what happened, and then we’ll decide.”\nIzuku takes a deep breath. His chest aches, and he finally processes that the mass of white on his chest isn’t a shirt--he’s wrapped very thoroughly in bandages, with some rust-colored stains beginning to soak through. It appears that he’d been more-than-grazed by that knife attack.\nThat’s probably why he’s at the school medical wing and not in an actual hospital. It means it was such an emergency that they’d called the closest medical professional they could find.\nHe hopes someone told his mom.\n“He--he’s been following me,” Izuku says. He clenches his uninjured fist, trying to keep himself grounded. “Today’s just the day he decided to escalate.”\n“How long?” Aizawa asks.\n“Just a couple days!” Izuku reassures, but he winces as he remembers, “Well, actually it turns out, for a couple weeks? But I didn’t notice him until...what day is it?”\n“Thursday morning,” Aizawa says.\n“Um, I didn’t realize until...three days ago.” \n“And you didn’t think it was important to mention to anyone?” Aizawa asks, incredulous. \n(Teachers don’t believe him.)\n“I promise I’m not making this up!” Izuku insists, tears clouding his vision. He twists, trying to find where his jacket’s gone, but his torso explodes in pain and he doubles over, gasping. Aizawa sits up, leans forward to pat his back with surprising gentleness, while Izuku breathes out, “I’m not--lying, I  promise, there’s a photo he gave me that’s in my jacket--”\n“I believe you,” Aizawa tells him. \n(Teachers lie.)\n Izuku gets over his brief flash of pain, and sinks back under the soft waves of his painkillers. “He---he tried to get me to give him an autograph. But I’m pretty sure he has some kind of quirk that would use my autograph to do--something, so I didn’t want to give it to him? But then I wasn’t sure if I was being  paranoid, and when I tried to leave he--he attacked me and I promise  I wasn’t trying to fight him.”\n“Breathe, kid.” Aizawa doesn’t remove his hand from Izuku’s back. “What photo did he give you?”\n“It’s in my jacket,” Izuku says again, gesturing uselessly because he has no idea where his clothes have gone. He’s just shivering in a thin hospital gown right now.\nAizawa stands, knees popping, and he crosses the room to a pile of discarded, bloodstained clothing that vaguely resembles Izuku’s uniform. Aizawa picks through the clothes until he unearths the jacket, and then he pulls the crumpled photograph out and examines it.\n“When was this taken?” Aizawa asks, even more seriously than he’d sounded before.\n“I think--a couple weeks ago?” Izuku says. “But he didn’t really follow me closely until a few days ago. That’s when I noticed him.”\n“You noticed him  before the day he attacked you?” Aizawa asks, and slowly turns to face Izuku again.\nIzuku, terrified, nods.\n“So I’ll ask  again, why didn’t you say a  thing to anyone?” \n(Teachers don’t intervene.)\nIzuku...hates morphine. Because while sober Izuku would die before blurting out an answer to that question,  high Izuku has no problem saying, “I didn’t think it would change anything.”\n“Sorry?” Aizawa says, deadly still.\nIzuku’s face flushes red. His heart skips a beat in his panic. “I didn’t think anyone would do anything! It’s not anybody’s fault--it’s  my fault--but I figured I’d just deal with it on my own and it’d be fine!”\n“You--?” Aizawa says, torn between angry and baffled. “You thought that you’d be ignored if you told a teacher that your life was in danger?”\nIzuku squints, not sure if the question is rhetorical. “...Yes?”\nAizawa stares.\nIzuku feels the fatal urge to explain himself, and he’s too woozy to stop the words coming out of his mouth. “Nobody would have believed me anyway. I know you don’t like me already because I’m the problem kid and I figured I could just deal with it by myself.”\nAizawa doesn’t respond to that. He looks like someone’s just tipped him over the edge of a tall cliff and the horror hasn’t set in yet--he’s still working through shock. \nRecovery Girl enters the room then, armed with candies that she shoves at both Izuku and Aizawa. If she notices the tense atmosphere in the room, she ignores it. “You’re awake! Eraserhead, get out of the way so I can check some vitals.”\nAizawa moves out of the way without protest. When Izuku glances after him again a few minutes later, Aizawa is gone.\n \nStudents lie.\nAizawa has had so many students lie to his face  this year alone  that he’s about to institute a Lie Jar so that he can make some pocket change whenever a kid looks him dead in the eye and spits a falsehood his way. They lie about why their homework isn’t done, they lie about why their friends are absent from class, they lie about where they got the sickening bruises that clearly aren’t the result of school-sponsored combat training.\nAizawa understands. He understands better than his students give him credit for. He’d been in their place about fifteen years ago (HAS IT REALLY BEEN THAT LONG, says the shrill voice of his husband in his head), and Aizawa’s aware of the fact that he lied to  his teachers, too. It’s a time-honored UA tradition. \nPlus Ultra.\nThere are distinct memories in his head of him staring at the ground and saying, “It’s fine,” to a teacher’s concerned question about his sleeping habits. Or of him mumbling, “I just forgot,” when Recovery Girl asked exactly  why  he hasn’t eaten in a few days. Or of him saying, “I sparred with a friend after school yesterday,” when another teacher asked where the hell he’d gotten so beat up. \nSo of course Aizawa knows that Kirishima’s dozing off in class for a reason (even though Kirishima’s quick to tell him that he keeps accidentally playing video games too late, sorry!). Aizawa knows that Uraraka’s getting more nauseous and faint in class lately for a reason (even though Uraraka chirps that she’s just so forgetful about breakfast, it won’t happen again). \nAizawa knows that Todoroki shows up to class favoring his ribs and startling at the slightest contact for a  reason  (even though Todoroki says it was a  training accident, my fault). \nStudents lie. \nAizawa doesn’t want to call them out on this directly. But, he’s careful to mentally note when students lie, and how often, and why, and for who. \nWhich is why he’s blindsided by the truth when Midoriya, fresh out of a villain attack, says plainly,  “I know you don’t like me already. I’m the problem kid and I figured I could just deal with it by myself.” \nAizawa’s been shooed out of the room before he can even  begin to think of a response to that. He slumps against the wall outside Recovery Girl’s medical wing and squints at the floor for twenty minutes before he realizes he’s neglected his duty as a teacher, which is to be honest with his students. \nThis is a deep-seated issue with Midoriya, it appears. A big enough problem that Midoriya, as a first-year student, didn’t tell a soul that someone had targeted him. And yet Aizawa hadn’t even noticed until his student had almost been murdered in cold blood.\n“You can come back in,” Recovery Girl says, poking her head out into the hallway. “You have some explaining to do, mister.”\nAizawa gets up without protest, and shuffles into the ward, and drops back into the seat next to Midoriya’s bed. \nMidoriya isn’t asleep. He’s curled up on his side, but his eyes are open and glassy and he’s watching Aizawa closely. (Tracking Aizawa’s facial expressions carefully, Aizawa realizes. Aizawa’s never been great at having the correct facial expressions but he’s going to try anyway for this kid.)\n“Tell me if I’m wrong,” Aizawa says, “but it seems that you’ve had teachers in the past abuse your trust.”\nMidoriya, thankfully, doesn’t start crying again. But the defeated laugh that he gives instead isn’t much better. “I guess.”\n“Is there something there that you want to talk about?” Aizawa asks. \nMidoriya blinks. The glazed-over, detached look in his eyes doesn’t dissipate--it seems to get worse. Maybe a new dose of pain meds is kicking in. “Not really. It’s kind of stupid and I don’t want you to have to listen to all that.”\n“Midoriya,” Aizawa says firmly (Midoriya tenses up, but Aizawa ignores this for  both their sakes). “I’m asking because I care.”\nMidoriya  almost  rolls his eyes--Aizawa can see it. Aizawa sees it, and recognizes it as Midoriya saying,  you’re lying.  (He’s seen this exact expression on Midoriya before, and he  shouldn’t have dismissed it the first time.)\n“I care,” Aizawa says again. “You’re a diligent student, and you’ve never given me reason not to enjoy having you in class. Do you understand?”\nMidoriya mumbles something like,  problem child. \nAizawa takes a measured breath, and then exhales slowly. “I didn’t realize that that nickname affected you so strongly. I didn’t mean any harm by it, but I apologize anyway. Do you think you’re the only student who causes me premature greying?”\nMidoriya squints.\n“You aren’t,” Aizawa answers for him. “I need you to tell me when you’re in danger. Understand?”\nMidoriya says, sleepy, “Teachers don’t care when I’m in danger.”\n“Well, I  do. Don’t make generalizations like that,” Aizawa says. He slowly reaches out and ruffles Midoriya’s wild hair, and he’s quietly pleased when Midoriya doesn’t shrink away from him, instead cracks into the beginnings of a smile. It’s only the first step on a long road, but it’s a start. “Do you want company until your classmates get here?”\n“No, it’s okay,” Midoriya mumbles, face shuttering again.\n(Students lie.)\n“I’ll ask again,” Aizawa says. “Want me to stay?”\n“If you want,” Midoriya says, just hopeful enough to hit Aizawa right where he’s soft. “I wouldn’t mind.”"
}