{
    "id": "20946113",
    "url": "https://archiveofourown.org/works/20946113?view_full_work=true",
    "author": [
        "SketchyNebula"
    ],
    "title": "Stark Jr.",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [],
    "fandoms": [
        "The Avengers (Marvel Movies)",
        "Marvel Cinematic Universe",
        "Iron Man (Movies)",
        "Spider-Man - All Media Types",
        "Spider-Man (Tom Holland Movies)"
    ],
    "relationships": [],
    "characters": [
        "Tony Stark",
        "Peter Parker",
        "Flash Thompson",
        "Ned Leeds"
    ],
    "additional_tags": [
        "Field Trip",
        "Precious Peter Parker",
        "Peter Parker Needs a Hug",
        "Tony Stark Acting as Peter Parker's Parental Figure",
        "Civil War Team Iron Man",
        "Peter Parker's Field Trip to Stark Industries",
        "I'm doing one of these too because",
        "You know I want to be included and stuff",
        "also",
        "fuck flash",
        "Flash Thompson Bullies Peter Parker",
        "Bully Flash Thompson",
        "Flash Thompson Being A Jerk",
        "Peter Parker is a Mess"
    ],
    "language": "English",
    "series": "",
    "published": "2019-10-08",
    "completed": "2019-11-16",
    "words": "27,631",
    "chapters": "6/6",
    "comments": "409",
    "kudos": "20,275",
    "bookmarks": "3,905",
    "hits": "230,210",
    "summary": "<p>Peter Parker has just accepted that his peers will never believe in his Internship. Really, lately he has just been trying his best to keep his life in balance between all his daily responsibilities that tug at him for his attention, but then his class comes to his place of work without him knowing about it.<br>Peter should never underestimate his 'parker luck'.</p>\n<p>A.k.a I threw my hand in this ring because I love this trope</p>",
    "notes": "<p>So sorry for the wait guys, but this chapter was a monster to write and edit!</p>",
    "text": "\nStark Jr., Chapter 1:\n\n\nPeter’s face pulled into a grimace as motor oil splashed on his tongue. The taste wasn’t really all that bad. It wasn’t bad until he realized exactly what had just entered his mouth. His lips went lopsided at the thought, eyes squinting in disgust.\n\n\nTony's laugh in the background made Peter’s head swivel, snapping to the corner of the room where Tony was now standing by the refrigerator. A blush crept onto Peter’s cheeks as Tony shook his head. \n\n\n“You gotta learn to put your tongue back in your face kid,” Tony said, walking over to him with a water bottle. Peter, who was half under the hood of a car, pulled one hand up to grab the drink. \n\n\n“It happens when I concentrate on something, I can’t exactly concentrate on it- that too, I mean…” Tony waved his hand at the kid, \n\n\n“Hey, I’ve licked my fair share of fluids-,”\n\n\nPeter jerked his hand away from the car, “Ewewewew-,” \n\n\nTony rolled his eyes, “Not like that kid,” Peter’s hands flailed to his ears, dropping the water bottle. A small smile perked at the corner of his lips as he ‘blocked out the sound’, his eyes closed tight. \n\n\nHe hunched down as Tony tried loosely whacking at the back of his head. Peter ducked, peeking through his shut eyes only to catch Tony sticking his tongue out at him before turning away to grab the files off his desk. Tony fell into one of the office chairs before he used his leg to push off the desk, rolling back over to Peter. The momentum caused him to gently bump into Peter’s side as he hunched over the papers.\n\n\n“This what you got for me today?”\n\n\n“Yup, I would have put it on the other side of your desk like normal but...” Peter glanced at the other side of the desk, where a small egg-shaped robot was nestled down. “He kept turning on and pushing everything off so…” Peter said pulling away from the car’s engine so he could peek over Tony’s shoulder to see which file he was looking at first. \n\n\n“Good picks. Nice work kid,” Tony clapped his shoulder and a smile broke out across Peter’s face, barely contained by him biting his lip. “And you’ll get that robot to do what it’s supposed to eventually, besides it’s kind of fun having a robot with a bit of rebellion in its systems anyway.”\n\n\n“Like Dumm-E?”\n\n\n“Yeah, the adrenaline rush of wondering if the smoothie he handed me has lighter fluid in it or not should be good for me or something.” Peter laughed and Tony smiled, his eyes soft before he blinked. The moment was over and he was standing up with a sigh, “well, love to stick around but-,”\n\n\nPeter frowned but waved him off all the same, “Go do whatever boring old grown up thing you have to do,” Tony snorted at Peter shaking his head. \n\n\n“Watch it, I can and will drag you to the meetings like the last time-,”\n\n\n“Promise?” Peter said, and Tony rolled his eyes before walking to the door with the files tucked under his arm.\n\n\n“I’ll get back to you on these,” He gestured to the files with his free arm, “-tomorrow.”\n\n\nPeter shrugged his hands up in a surrender motion. “Hey, it’s not me who has to deal with the head interns’ griping.”\n\n\n“And it’s not me either,” Tony said, head tilted to look over the hood of the car in order to see Peter “And we both know they don’t gripe all that much,”\n\n\n“Yeah but there's five of them so it’s like, low gripe level x 5” Peter gently pushed the office chair with his foot, rolling so that neither of them were obscured. \n\n\n“I thought you just said you don’t have to listen to their griping” Tony’s eyebrow rose and Peter shrugged again.\n\n\n“Hey how about I gripe to you, that way we all just have to suffer.” Peter smiled and Tony shook his head in a long-suffering way,\n\n\n“Communism doesn’t work kid,” Peter snorted and Tony smiled before he nodded to the clock on his desk.\n\n\n“Eye on the time kid, Happy's taking you home soon,”\n\n\n“You know I'm fine with taking the subway-,”\n\n\n“Yeah well, I’m not.” \n\n\nPeter rolled his eyes as Tony turned to move out the door, waving over his shoulder to Peter who absently spun left and right on his office chair while watching Tony go. \n\n\nPeter’s shoulders fell, the rooms silence echoing that he was alone. He absently glanced back to the car engine. His hand went to roll the screwdriver around the tool-table for a moment before he suddenly bent down, scooping the water bottle off the floor and standing up. He snagged his backpack off the desk, juggling the water bottle back and forth between his hands as he moved to the door. \n\n\nHe took three steps away from the room before he backpedalled, grabbing his badge out of his coat pocket and dangling it from its lanyard. He waved it loosely in front of the door pad and it beeped, the green light turning to red to signify it locking. \n\n\n“You think Dr. Stark would get tired of you leaving his lab-office door open.” Peter turned around, feet stumbling almost tipping himself. He steadied his stance looking up to see a blonde woman in a lab coat. \n\n\n“Maggie, what are you doing on this level?” Peter smiled as the other walked up to him and, with a flourish, handed him a manilla folder. \n\n\nPeter sighed, “You know,” Peter started as he grabbed the file, “It would be a lot better for me if you got these to me in the morning like the others-,”\n\n\nMaggie closed her eyes and straightened her spine, pointing one finger up as if she was about to give some long forgotten, sagely piece of advice, “I don’t start my work here until 12:00 due to my college schedule.” she cracked one eye open with a smirk, “Besides you should use your high school time to do, you know, actually important stuff like this.” \n\n\nPeter blushed, holding the folder to his chest and frowning, “High-school stuff is important,” He said and she bobbed her head left to right as if weighting his point in her head,\n\n\n“Yes, I supposed to random not genius kids. It is, however, not important for you Stark Jr.” She ruffled his hair a little before continuing down the hallway, pausing halfway she turned around again. “Oh! And if you can get that done by tomorrow?”\n\n\nPeter groaned, “A rush job? And you got it to me late!?” She shrugged unapologetically before she turned the corner out of Peter’s view. \n\n\nPeter shook his head before looking down at the thicker file in his hand. He cracked the file open with two fingers, peering in to see what ‘needed’ attention from the lower interns’ projects. Then the sound of someone clearing their throat pulled him away. \n\n\nHe whirled around, hands snapping the folder shut only to see a figure standing at the other end of the hallway.\n\n\nHappy was tapping his foot, eyes unamused and glaring over his sunglasses.\n\n\nPeter’s face heated up as Happy tapped his non-existent wrist-watch. \n\n\n“R-right I’m coming.” He stuffed his lanyard into his backpack throwing the file and water bottle in with it. \n\n\nThey walked to the priority garage, Peter trailing behind Happy, his head lowered with a pink tinge to his cheeks.\n\n\nPeter tried to be faster at getting in the car than usual but Happy still grumbled as he pulled away from the parking space.\n\n\nAs the car pulled out of the garage, the sound of rain hitting the glass made Peter’s eyes lock on the window. The sound made Peter smile, his hand finding a button on his door to crack the window open a little. \n\n\nHappy sighed angrily and Peter turned back to him. \n\n\n“Hey! How can you seriously not like the smell of rain?!” He exclaimed and Happy glanced at him in the rearview mirror. \n\n\n“When it ruins expensive leather seats.” \n\n\nPeter slumped in his seat.\n\n\nThat was fair. \n\n\nStark Jr. \n\n\nPeter’s tongue peeked out of his lips as he switched between writing notes and looking through the file he was given. \n\n\nHe didn’t really need the notes but their notes were graded at the end of the chapter so he had to put something down since he didn’t know what the teacher did or didn’t know. \n\n\nWhen the notes were done and they were given the homework, Peter breezed through it before turning back to his folder. \n\n\n\nWhen the bell rang Ned attached himself to Peter’s side as soon as their paths crossed in the hallway. Their shoulders bumped as they walked to the decathlon room. \n\n\n“So what's going on with the internship?” Ned asked immediately and Peter blushed as he pushed the file down into his backpack.\n\n\n“Well the patent office is taking my web-bandage and running with it,” Peter said rubbing the back of his neck and Ned rolled his eyes knowing the tell-tale signs of Peters soul-crushing humidity.\n\n\n“Yeah, and how awesome is it! Is everyone tripping over themselves to get one?”\n\n\nPeter bit his lip shrugging and Ned punched him lightly on the arm, \n\n\n“Dude!” \n\n\n“Well,” Peter sighed, “It just passed human trials, and got FDA approved so it’s going to be hitting the market soon. Hospitals and emergency responders are putting in pre-orders I guess it’s actually a good-,”\n\n\n“Dude, of course, it’s good I-,”\n\n\nPeter and Ned were both shoved into the lockers as the Flash shoved by them, a mocking “oops,” bled with sarcasm as he walked into the decathlon room before them.\n\n\nNed glared after Flash and Peter’s lips pinched together.\n\n\n“You okay?” He asked Ned and Ned nodded giving him a tight smile as the both of them walked into the club room.\n\n\nTeenagers were scattered around the room, talking with books and packets out. Peter walked with Ned to sit nearer to the outside of the group.\n\n\n“So working on anything new?” Ned asked quieter than before, leaning in and Peter opened his mouth only for the teacher to stand up and begin speaking.\n\n\n“Okay!” The teacher said, shouting over the discussion and laughter of the kids. “Let’s start with paired practice and then we’ll practice altogether, pair up and quiz one another. Remember to jump around subjects guys! Don’t quiz on just one thing,” \n\n\nNed and Peter turned to one another unzipping their backpacks.\n\n\n“Well, Mr. Stark-,” \n\n\n“You lying again Penis?” Flash said, kicking Peters bag while his hand was still in it making Peter flinch. \n\n\n“Back off Flash!” Ned said and Peter grimaced as Flash’s eyes glared at the other, \n\n\n“Oh? I’m sorry, did you say something Dead?” He asked, putting emphasis on the word dead as he glared at the other. Ned moved to stand up. \n\n\n“Boys!” The teacher sighed out, “Sit down, separate!”\n\n\nNed sat and Flash stomped away to the other side of the room.\n\n\nPeter shook his head as Ned gave him the ‘spider-man?’ look.\n\n\nThe rest of the meeting went without too many problems, Flash merely giving them aggressive looks from the other side of the room. Soon they were all packing up again, parents texting kids that they were here but before they could file out the teacher turned to all of them one last time.\n\n\n“Alright everyone attention!” The teacher said over the ruckus of kids, “Now because of our win this year the school board is giving all of you a field trip to a location that will be revealed tomorrow-,” The excited gasps and whispers around the room picked up in waves as the teacher continued talking, “Now you have to, and I repeat: have to, get this permission slip signed and in by tomorrow If you want to go, as well as a few non-disclosure agreements! Now Remember these non-disclosure agreements are serious business and when you sign it means-,”\n\n\n“Ah man!” Ned said, “I have a dentist appointment tomorrow, I guess I’m gonna have to stop by the school.” Peter laughed a little and Ned continued, “Eh, either way, this is still so cool! Where do you think we’re going if they’re making us sign NDA’s!” Ned asked excitedly and Peter smiled tilting his head.\n\n\n“We’re probably going somewhere that does kind of normal tours but getting a cooler more in-depth tour,” Peter said, and Ned fist-pumped, \n\n\n“Yeah?!” \n\n\nPeter nodded, “Yeah! like at Si, our normal tours don’t need NDA’s but every so often we give a tour to college groups and stuff that requires NDA’s and those tours are always the coolest ones we have.”\n\n\n“Mr. Parker-,” Peter looked up at the teacher who was now looking at him, eyes peering over his glasses, lips pinched a little thin. “Do you have a moment after this?”\n\n\nPeter’s eyes were wide and he glanced to Ned who shrugged before motioning that he’d be right outside.\n\n\nPeter swallowed, “Uh, yeah.” \n\n\n\nThe other kids were already filing out, Flash throwing a smirk to Peter before Peter was alone with the teacher. \n\n\n“Mr. Parker, I’m sorry to say that, you’re not going to be allowed to attend the club field trip.” Something sank in Peter’s gut and he frowned.\n\n\n“Why?”\n\n\nThe teacher sighed, “Your attendance to the club is spotty and the board had made rules about which members were allowed to attend to keep kids from joining the club last second in order to go on the trip-,”\n\n\n“But I was the one that won the winning point in the finals this year I-,”\n\n\n“I know that Mr. Parker but it’s not up to me.”\n\n\n“But all my attendance stuff was for my Internship-,”\n\n\n“Mr. Parker!” The teacher said over top him, suddenly angry. “I can’t speak for what you say outside of my classroom but I’d appreciate it if you would refrain from lying to my face. Understood!” Peter swallowed again, before nodding, “You’re not allowed to go.” The teacher said finally, as he took off his glasses placing them on his desk. \n\n\n“I’m sorry Mr. Parker.”\n\n\nPeter’s legs walked him out of the room without him really noticing and Ned frowned at him.\n\n\n“Hey? What's up?” Ned asked and Peter just shook his head.\n\n\n“I- I can’t go on the trip.”\n\n\nNed’s eyes widened his mouth open for a second before any words came out, “What! Why!”\n\n\nPeter frowned.\n\n\n“Apparently my attendance is ‘spotty’,” Ned frowned,\n\n\n“Well but that was because-,”\n\n\n“They don’t believe me.” Ned was silent and Peter sighed. \n\n\n“Well-,” Ned said tripping over himself, “We could, I mean May and my mom might let us stay home that day then and we can build that helicarrier model or something together-,”\n\n\n“Ned-.” Peter began but Ned kept going, “We could put star wars on the tv and just go for it-,”\n\n\n“Ned, don’t,” Peter said and Ned’s mouth closed.\n\n\n“I saw how excited you were about the trip.” Peter said and Ned frowned, “I’m not going to make you miss it.” Ned opened his mouth again and Peter shook his head, “You deserve to have fun, look, I’ll just keep working on my robot or something.”\n\n\nNed slowly smiled again, before hugging Peter.\n\n\n“You’re the BEST dude!” Peter smiled before Ned pulled back, “So did you just say the word ‘robot’?” Peter smiled as Ned leaned in an eyebrow quirked. \n\n\n“In fact. I did.”\n\n\nStark Jr.\n\n\n“But the fact he wants you working on it in *his* lab, dude that's so cool!” Ned was basically jumping up and down and Peter laughed as he pushed the front doors of the school open.\n\n\n“It really is! But the past week he has been swamped with these meetings you know-,”\n\n\n“Accords Stuff,” Peter and Ned said it in unison both of their voices dismayed in different measures. \n\n\n“I know it sucks cause I wanna come over again dude!” Peter snorted and Ned smiled at him, “C’mon! I mean, it's in his lab so either way, you can say you’re working on a robot with Tony Stark.” \n\n\nPeter nodded his head slightly, a shoulder raising to meet his cheek as he rolled his head to lean on it, “yeah but that’s not really *it* you know I guess I just-,”\n\n\n“Miss him?”\n\n\nPeter sighed before he slumped to sit on the driest area of the stair steps in front of the school, “I don't know. I guess.” His shoulders fell and he pulled at his backpack straps. \n\n\n“Hey Peter,” Ned began gently, “you know its okay to be-,”\n\n\n“I know,” Peter said before Ned could finish, “I mean I just- I've had so many tries at this whole father-figure thing and-,” he trailed off and Ned's face fell. He opened his mouth only for a horn to sound off.\n\n\n“Agh- my mom’s here already, I gotta go dude, but we’ll talk later?” Peter smiled nodding to the other.\n\n\n“Yeah see you. I’ll just work on the last of that problem that Maggie gave me till Happy gets here.” Ned nodded with a smile waving as he walked to his mom’s car. \n\n\nPeter slung his backpack on his lap so he could pull out his stuff. A half-chewed pencil was dug out of the bottom of his bag and he cracked open his work. His tongue stuck out as he peered over the pages in the file. One hand holding it open, the other balancing the notebook he was scribbling in on his knee. He was sprawled out shaking one of his legs while hunching. He flicked a pencil back and forth in his hand as he worked over the problem in his head. \n\n\n“Penis!” \n\n\nPeter’s stomach fell, his arms falling to rest in his lap as he straightened up, pulling his legs back from their sprawled out position. \n\n\nHe turned his head to see Flash, approaching him. With a sigh, Peter closed the file and his notebook as Flash marched up to him.\n\n\n“You forging fake stuff now Penis?” \n\n\nPeter’s eyes squinted in confusion. “Forging- what!”\n\n\nFlash suddenly grabbed the file making Peter’s heart spike with fear. \n\n\n“Flash put that down!” Peter yelled standing up and Flash pushed him back down with a hand. Peter’s muscles were taught, every flex had his super strength begging to be let out.\n\n\n“What? You worried I'm gonna ruin your fake internship file.” Flash waved it around, a couple of papers threatening to fall out. \n\n\nPeter’s face fell as he saw the stark industries standard stamp on the front of the file. Flash growled, Peter just staring at him for a couple of seconds. He tossed the file to the ground where it landed in a puddle. \n\n\n“No!” Peter yelled and Flash snorted, “You know, maybe my dad can make an ‘attendance rule’ that gets you off the team-,” Peter’s head snapped up and Flash shoved him to the ground. “We do a lot better without you anyway,” The sound of wet footsteps echoed away from Peter.\n\n\nPeter cracked an eye open, mud soaking into his clothes. He scooped the file up and it drooped down with water and dirt. Peter felt his heartbeat stall in his chest. His hands frozen, clutching the documents in his hands.\n\n\nMaggie was typically really chill, he told himself, sucking in his breath in a painful sounding way that almost made him choke, maybe she wouldn’t care that the file was trashed. He tried to manage a steadier exhale. I mean it wasn’t like she had to give it to any higher-ups or anything Peter *was* the higher up she gave it too and the problem he was working on was basically solved in his notebook- but he always gives the file back with his assessment-,\n\n\n“Hey!”\n\n\nPeter’s head whipped up to see Happy running towards him, his mind only then caught up to the fact that his body had started to almost violently shiver, his clothes soaked with mud. \n\n\n“Kid are you-,”\n\n\n“I’m fine,” Peter said abruptly, his legs forcing him to stand up. His hands quickly isolated the muddy file into an empty pocket in his backpack. “Just- I just tripped coming down the stairs.” His voice was higher than normal, one of his arms going to wrap around his chest trying to stop the shaking. \n\n\n“Yeah well,” Happy began, his lips pinched together, “be careful kid. Tony will have my head if you get hurt during one of my watches.”\n\n\nPeter gave a short, aborted chuckle before Happy was gripping his upper arm and helping him to the car, soaking mud into the leather of the seat. \n\n\nPeter sat silently trying to keep a monitor on his breathing, body still slightly shaking. \n\n\nHe was trying so hard not to have a massive freak out but the closer they got to SI the more Peter’s anxiety tried to pull him down into panic mode. His spider-sense was going haywire in response to his panic. \n\n\nHis elbows and knees were burning, apparently scraped when he was pushed.\n\n\nHe kept staring at the file in the bag on his lap, his panic building and ebbing sporadically. \n\n\nWhen he got out of the car Peter stumbled, shivering into an elevator. Happy didn’t have time to say or do anything before FRIDAY had whisked him away. \n\n\nPeter felt the mud against his skin. His enhanced senses making the grainy, dirty feeling even worse.\n\n\nPeter’s mind was reeling as he stepped out of the elevator on the master floor, his body automatically heading to the bathroom.\n\n\nMaggie wouldn’t be mad at him for this right? Peter’s solved worse problems and besides, it needed to be retyped anyway.\n\n\nDespite all of this though Peter’s heart kept spiking with sudden panic.\n\n\n“That doesn’t matter,” Peter said to himself because he knew it wasn’t about Maggie's reaction.\n\n\n‘I was irresponsible enough to let the file get trashed.’ Peter thought to himself hands still shaking as he pulled his hoodie off, ‘If it had been anything other than an unfinished report-,’\n\n\nHe threw his backpack on the sink counter.\n\n\nIf the file had been anything else, Peter didn’t know what he would do. \n\n\nMr. Stark was trusting him with a lot, everyone was trusting him with a lot. With the spider-man suit, with his position at the company, with their life's work and at the end of the day, on the streets of New York, with their lives.\n\n\n“Great power, Peter, great power,” Peter mumbled to himself his brain still not shutting off as he stepped out of the shower.\n\n\nHe stared at the backpack in front of him as he pulled a change of clothes out from under the sink, “Friday?” Peter began, “Can I, like, get a new copy this or something?” Peter asked putting down the folded clothing and pulling the file up and out of his backpack. He held it up to show one of the cameras. \n\n\n“Those are report files so, unfortunately, no Mr. Parker,” Peter felt his chest constrict again as FRIDAY continued, “the content is completely unique to whoever gave them to you, they won't be submitted into the system until they are finished. You could copy them but at this point the stains would also be copied with the pages-,”\n\n\n“That’s okay Friday, thank you,”\n\n\n“Of course Mr. Parker.”\n\n\nPeter pulled the jeans and shirt on before tucking the file under his arm.\n\n\nHere we go.\n\n\nOne elevator ride later Peter was looking at Maggie as she jotted things down, standing at a desk in the lab section. \n\n\n“What’s up Stark Jr.” She said, eyes not leaving the page she was writing on.\n\n\n“Uh.” Peter, didn’t know what to say.\n\n\nThen suddenly he was saying everything all at once.\n\n\n“Well-it’s finished- the file was kinda- well but I have the calculations and everything here- then again the file is still kind of important to-,”\n\n\n“Woah there,” Maggie said, looking up to him and putting her pen down, “what’s wrong?”\n\n\nPeter swallowed before wordlessly untucking the file from under his arm and holding it out to her.\n\n\nShe looked at it for a second, and then started laughing.\n\n\n“W-What? Is this mud!” She said in between chuckles, Peter’s face heated up and he shrugged.\n\n\n“I- uh, tripped.” \n\n\nMaggie’s laughter slowly ebbed off and then she was looking at Peter with her eyebrows scrunched.\n\n\n“You? Trip?” She asked huffing a little, “Jr. I watched you catch thirty falling test-tubes like you were in some cartoon just last week and you're telling me your reflexes actually allowed you to trip and, like fall?” \n\n\nPeter opened and closed his mouth a couple of times before Maggie was speaking again.\n\n\n“What happened to the folder Peter? You know I won't be mad at you, heaven knows I lose stuff all the time-,”\n\n\n“I didn’t lose it!” Peter said over the top of her because, god, that would be so much worse. The idea that anyone would have been able to find it if Peter lost a folder-,”\n\n\n“Then why did you lie about why it’s covered in mud?”\n\n\nThere was silence for a moment because all Peter could think of was the truth and-,\n\n\n“Peter?”\n\n\n“I-,” Peter started and he needed to say something and, “I was pushed It wasn’t-,”\n\n\n“What!” Maggie said throwing the folder on the table and grabbing Peter’s wrist. “Are you okay?!”\n\n\nPeter nodded and Maggie glared, “Who pushed you what-,”\n\n\n“It’s not a big deal- It’s high school.” Peter began and Maggie just looked even more murderous. \n\n\n“Oh.” she said coldly, “I know all about high school.”\n\n\nPeter swallowed and she grabbed his shoulders looking him in the eye.\n\n\n“If anyone is bullying you Peter-,”\n\n\n“I don’t think that-,”\n\n\n“\n\nPeter\n\n.” Maggie said his name with a dangerous edge, “If you don’t tell Dr. Stark yourself, I will find a way to contact him and tell him myself, I don’t do bullies okay?”\n\n\nPeter nodded. \n\n\nIf only his school felt that way.\n\n\nStark Jr., Chapter 2:\n\n\nNed’s dentist appointment meant that Peter was mostly alone today. What with M.J. having an almost opposite schedule than him. \n\n\nWhich in turn meant that Peter was on high alert. Utilizing his spider-sense to do his best in avoiding Flash at all costs.\n\n\nWhen Flash got Peter alone, well, it wasn’t a situation that was ever good.\n\n\nPeter was actually managing to do it.\n\n\nHe almost knocked over a bookshelf in the library when he skidded around a corner and he basically battle rolled into a classroom where a very perplexed teacher stood staring at him, but It was going well. \n\n\nUp until he was walking to his classroom early from lunch. \n\n\nFlash usually focused on him, for whatever reason, but in some ways, Peter prefered that because at least he could deal with it.\n\n\nAt least when Flash made fun of him, he had a good support system.\n\n\nAnd was Tony Stark’s personal intern.\n\n\nOh- and he was spider-man.\n\n\nSo while the bullying hurt in the moment, it wasn’t like he was hurting beyond the moment.\n\n\nFlash would say a biting comment and Peter would deflate.\n\n\nIt would hurt and he would go to SI and then home. Things would be fine again until the next time Flash took whatever made him so mean, out on Peter. \n\n\nHe was not like some poor kid who might go home at night and wonder whether or not Flash was right on some level. \n\n\nBecause Peter might be upset that Flash hated him but he didn’t think Flash hating him reflected on his character at all.\n\n\nFlash had pantsed a kid.\n\n\nLike, another, not-Peter, kid.\n\n\nPantsing someone by itself was the kind of immature assholery that Flash would do, but he had pantsed the kid with the prosthetic leg, making the fabric tangle around the prosthetic and make the ankle joint get stuck.\n\n\n“Hey!” Peter shouted in his ‘business’ voice which made Flash and one of his crony's jump before turning to see him. \n\n\nThe fear left their eyes as they saw Peter which was almost funny if Peter wasn’t so irrationally angry right now.\n\n\nBecause who does this kind of thing!\n\n\nWhy did they even do this kind of thing!\n\n\nWith a quick movement (and a little spider-reflex help) Peter had caught the kid before he fell, swiftly pulled his pants back up and had gently pushed him in the opposite way of this mess.\n\n\n“Is Penis Parker volunteering for-,”\n\n\n“What is your problem!” Peter shouted and Flash looked startled, “are you kidding me! It’s one thing for you to go around harassing me but you go around doing shit like this-,” \n\n\nFlash’s face pulled into one of rage and before Peter knew what was even happening his spider sense had him reacting.\n\n\nFlash moved to punch him but before he could Peter instinctively blocked the punch, throwing one of his own.\n\n\nPeter’s eyes were wide, still holding back Flash’s fist, his own still hovering in the air as Flash held his face with his other hand. \n\n\nPeter choked a little pulling back all at once.\n\n\nFlash suddenly made an outraged noise, lashing out and Peter only flinched as Flash tackled him to the ground before starting to punch him.\n\n\nThe splitting pain of two punches connecting burst in his entire body before Flash was being dragged off Peter, his friends were pulling him away. \n\n\nPeter cracked an eye open, the light suddenly way too much for his super-senses.\n\n\n“What’s going on here!?” Peter was being pulled up and only just managed to process the face of a teacher he’s never seen before.\n\n\n“He-,” Peter couldn’t hear whatever else Flash had said because his ears were too busy suddenly tuning in to everything happening on the block. \n\n\nCar horns honking, people shouting and laughing and crying. Everything flooded in all at once and Peter could only wince at the unbearable ringing in his ears, as he was being pulled in some direction. \n\n\nHe was sat down in a chair, that Peter dully recognized as the waiting chairs outside the principles office. \n\n\nPeter’s face was bruising over, the air stinging it. He knew it would be gone by tonight though. \n\n\n“I punched him,” Peter whispered to himself, choking on the words, as the ringing was settling enough to allow him to hear his own thoughts finally. \n\n\n“I punched him.” Because that’s what happened, and Peter hadn’t even realized it until it happened and wasn’t that terrifying?\n\n\nThe idea that Peter couldn’t even control himself now?\n\n\nHe has super strength, what if he had killed Flash with that punch, for god sakes Peter catches cars on the weekly!\n\n\nIt happened and Peter hadn’t even realized it until it was all over.\n\n\n“Mr. Parker?”\n\n\nA stern voice had Peter turning to see Flash and his cronies walking out of the Principles office. Flash threw Peter a smirk and Peter grimaced at the fact he was holding a towel to his bleeding face.\n\n\nPeter stood, his nerves still buzzing and his spider-sense dull and static in the back of his head.\n\n\nPeter sat in the chair across from the principle and the other man inhaled tiredly before sighing.\n\n\n“Mr.Parker? We couldn’t get a-hold of your aunt?” He asked and Peter blinked at him before letting out a long, eloquent, “um”\n\n\n“She’s probably at work right now-,”\n\n\nThe Principle nodded at him, “Well, Flash’s Parents have been informed and they're rightfully outraged Mr. Parker.” \n\n\nPeter swallowed nodding his head.\n\n\n“I don’t know what all this is about, all this lying and now fighting-,”\n\n\n“L-lying.” Peter asked, his voice monotone and lifeless.\n\n\n“Telling everyone you have an ‘Internship’ at Stark Industries? Forging Dr. Starks signature on the emergency paperwork at the beginning of this year. Peter!”\n\n\nPeter was silent, his eyes staring at the wallpaper over his Principles shoulder.\n\n\nTony had signed that because he and May agreed that should anything happen to Peter, Tony should be the first to know.\n\n\nHe had the resources to keep people quiet if something comes up in any medical tests or if Spider-Man happened to need any medical aid.\n\n\nTony had actually argued for signing those papers.\n\n\nMay had spent weeks hashing out feelings of inadequacy and jealousy with Tony before he could give Peter the finished form.\n\n\n“Things must be rough for you since your uncle died Peter,”\n\n\nAnd wasn’t that just great! Because that's the last thing Peter needed to hear about now.\n\n\nHaving Ben’s name used as some cheap tactic for a teacher to ‘understand where he’s coming from’.\n\n\nOr, you know what! More likely than not they’re using his name, the man that basically raised Peter in place of his own father, who was a solid rock after having lost his own brother because Peter needed him to be, they’re using his name as a guilt trip, a ‘stop doing (blank) because it makes more work for us’.\n\n\nNone of them, any of them! Knew the half of all of this!\n\n\n“But you’re going down a road of delinquency at this rate! Peter, you’re a bright kid and one day you might actually be good enough to work at Stark Industries-,”\n\n\nYeah, all day on weekends, and after school on weekdays till midnight. \n\n\n“I believe you can pull this together still, but I’m going to have to suspend you for the next week.”\n\n\nPeter’s mouth was suddenly dry.\n\n\n“Susp-suspend?” Peter asked and the principle was silent.\n\n\n“a voicemail has been sent to your Aunt and-,”\n\n\nPeter tuned out, numbness overtaking him. Soon his body automatically pulled up from the chair he shook the principles hand before he left the room.\n\n\nWhat the fuck did he do now?\n\n\nStark Jr.\n\n\nHappy hadn’t rolled up the privacy shield during the ride home. Eyes glancing at Peter in the rear-view every so often.\n\n\nMaybe it was because Peter didn’t greet him today. Maybe it was because Peter hadn’t been talking at all since the principal's office.\n\n\nWhatever the cause, Happy was looking at him every so often and it took Peter half-way into the ride to realize.\n\n\n“This isn’t the way to the tower?” Peter asked more than said, and Happy grunted.\n\n\nPeter looked outside his window nervously because maybe Mr. Stark already heard about his suspension, and maybe he was going to stop letting Peter come by or work in the labs or be spider-,\n\n\nHappy pulled into a space in front of a small local ice cream parlour.\n\n\nPeter slumped as Happy got out and Peter was too dumb-struck to do anything but sit where he was.\n\n\nHappy returned handing Peter an ice cream cone with a generous amount of chocolate and vanilla ice cream, holding a strawberry one himself.\n\n\nHe got into the driver’s seat again.\n\n\n“What’s up kid?”\n\n\nPeter could only watch the ice cream drip down the side of the cone for a moment before his brain seemed to catch up with the proceeding events. He pulled the ice cream up, licking the side to catch the drip before looking to Happy again,\n\n\n“Uh, I just- bad day at school.”\n\n\nHappy grunted, giving him a ‘yeah I figured that part’ look in the mirror.\n\n\n“Um just, some guys in my class I- you know?” \n\n\nHappy’s eyes darkened at that.\n\n\n“Yeah, I do. Do I need to tell Stark-,”\n\n\n“No!” Peter nearly shouted, throwing his body forward a little before clearing his throat and slumping back into his seat. \n\n\n“It’s fine, they probably won't ever do it again-,”\n\n\n“Your face okay?”\n\n\nIt was like Peter’s brain jolted.\n\n\nThe sudden realization that, yeah he got punched a couple of times and, yeah he’s going to have a bruise for the rest of the day at least just catching up.\n\n\n“Uh, yeah-Spidey, powers. It doesn’t even hurt.”\n\n\nWhich was a half-lie because it hurt but it wouldn't last for long, or at least as long as it would for other people.\n\n\nHappy seemed unconvinced but with a  lick of his ice cream started pulling out of the parking spot.\n\n\nPeter’s eyes looked down at the ice cream in his grip, the swirl kind that he had excitedly talked about at length to Happy during their first month as driver and drivee.\n\n\nPeter smiled.\n\n\n“Happy?” Peter said, eyes looking up just in time to see and hear him give a grunt, “thanks.”\n\n\nStark jr.\n\n\nPeter’s first thought when getting into the lab was that, hey, people had their own stuff to do. This was a high paced working environment and they won't have time to really ask questions about the bruise on his face.\n\n\nPeter had miscalculated so bad.\n\n\nHappy dropped him off at the front and immediately, upon entering the building the head receptionist was grilling him.\n\n\nFrank has been the head for thirty years and had the kind of ‘no-nonsense’ attitude you had to have to be someone working the front of Stark Industries.\n\n\nHe was a kind of brash man but Peter made sure to give him a cheery wave every day as he passed by. \n\n\nWhen Peter turned to give him a cheery wave before he entered the elevator, Frank was not at his desk and, in fact, was directly behind Peter with a glare that could kill. \n\n\n“What happened to your face son?” Frank said in a gruff and angry tone of voice that had Peter’s hand freezing mid-air, heart racing.\n\n\n“Uh,” Peter stuttered out, mouth dry, pulling his hand down from a wave to gently press against his cheek. \n\n\n“If it happened on the property then we’re calling the cops no one should be assaulting-,”\n\n\n“No! Just- High School you know?” Peter said his voice cracking in a way that made the blush on his face turn two shades darker.\n\n\nFrank's lips pinched together, his eyebrows furrowing and Peter bit his lip.\n\n\nAt least Frank wasn’t mad at him. \n\n\nAt least, he didn’t think Frank was mad at him?\n\n\nFrank grunted, looking even sourer if that was possible. Peter was saved as the elevator had decided to show up and Peter gave a quick and friendly goodbye to Frank before stepping in.\n\n\nIt only got worse from there. \n\n\nPeter had almost reached his floor when someone else got in the elevator with him.\n\n\nDr. Slind.\n\n\nShe was often found over-caffeinated and yelling about something in the neuroscience section of SI innovation.\n\n\nShe also was one of the first scientists that Peter met, unfortunately, he met her after he corrected some of her calculations and she hunted him down like a bloodhound. \n\n\nFortunately for him, she was more interested then angry at the time, though Peter was a lot more careful on whose work files he looked at after that. \n\n\n“What happened to your face?” She pointedly asked, stepping into the elevator. \n\n\nPlay dumb Parker.\n\n\n“What face?”\n\n\nNOT THAT DUMB!\n\n\nDr. Slind thankfully started laughing. Hard, like snorting, crying, out of breath laughter.\n\n\nPeter’s blush heated back up and Dr. Slind braced herself on the hand bar. The elevator hit her floor first and paused, FRIDAY holding it as she took a couple of deep breaths to calm down.\n\n\n“That was great kid!” Dr. Slind said as she walked out of the elevator, “But really whoever hit you needs to be arrested we don’t-,”\n\n\n“It’s not- It’s just High-School stuff no one-,”\n\n\n“What?” Dr. Slind’s eyes narrowed her face pinching with irritation.\n\n\nPeter swallowed and FRIDAY took the moment to close the elevator doors, whisking Peter up to the top floor and away from the rest of whatever that conversation was going to be.\n\n\nNothing good most likely.\n\n\nPeter almost sighed when the elevator hit his floor with no more interruptions. He headed down the hall immediately so he could sort through the, more than likely, small mountain of files on his/Mr. Stark’s/his because Mr. Stark doesn't really use it ever so it’s kinda his-, office.\n\n\nAs soon as he got in the room he slumped down into the leather chair and looked at the files on his desk.\n\n\nIt was funny how not 6 months earlier he was too nervous to even touch this chair but now Peter even had it set to his height.\n\n\nIt also had a little Peter sized grove in it due to Peter’s questionable posture.\n\n\nPeter reached for the first file when he a knock happened on the office door. \n\n\nPeter’s eyebrow quirked in interest because, well, people don’t normally interrupt him? \n\n\nHe can count on one hand how many times someone knocked on the office door and most of the time it was Peper. \n\n\nPepper was at some meeting in Hong Kong, wasn’t she? \n\n\nOh! Peter still needed to send her the picture he got on last nights patrol of the tiniest dog he’d ever seen!\n\n\n“Kid?” \n\n\nPeter looked up to see Randy, a janitor that Peter saw around a lot. After running into him in the halls once (quite literally, Peter almost sent them both toppling down) he’d taken to talking off Randy’s ear between workloads when Mr. Stark was gone. \n\n\nPeter realized he still hadn’t said anything.\n\n\n“Ah- Oh! Randy!? What's up?” \n\n\nRandy pulled away from standing in the doorway. \n\n\n“Well, Frank told me you had quite the shiner and that you said something about bullies-,”\n\n\n“I’m not being-,” well, that’s a lie. Because Peter is being bullied. Peter can’t just outright lie! “I mean- I never said a bully gave it to me I-,”\n\n\nRandy gave him an unimpressed look and Peter swallowed. \n\n\n“Kid everyone’s worried, Harriet’s been stomping around- and Frank’s just about one second from popping and just hunting down Dr. Stark down himself.”\n\n\n“Wh- Dr. Slind always stomps around! And- I- why would Frank tell Da-Dr. Stark?”\n\n\nRandy gave Peter a look and Peter flushed a little. Was his clinginess that noticeable? \n\n\nHe didn’t want it to be, and Mr. Stark noticed a lot more than normal people... \n\n\n“Jr. this isn’t something to take lightly.  Not just for you, though I sure wished you’d do something for yourself kid.” Randy sighed, “If whoever gave that to you is allowed to keep running around like that their not going to learn consequences. They don’t learn that and then well, lack of responsibility ruins lives-,” Peter swallowed hard at that, “that’s all I wanted to say, sorry for interrupting your work son, let’s hope now that we’ve talked about it Frank and Harriet can settle a little. Seriously though Jr. tell. Your. Dad.”\n\n\nRandy said before turning to leave the office.\n\n\nPeter froze his heart sputtering at that.\n\n\nHe just called Tony his dad!\n\n\nLike, actually.\n\n\nLike, that was a serious conversation and not just a casual funny thing- Randy thinks Tony’s his dad.\n\n\nDid other people think that Tony’s his dad? \n\n\nPeter thought the whole ‘Stark Jr.’ thing was a joke?\n\n\nWasn’t it?\n\n\nPeter looked down to his desk covered in files.\n\n\nHe was not going to be able to focus after all this was he?\n\n\nStark Jr. \n\n\nPeter dragged himself home that night, having slugged through the files. He was certain that he had to read one file six times before he actually managed to process the first paragraph. \n\n\nThere’s just a lot on his mind.\n\n\nHis load only added to when he realized he’d have to confront May about the suspension at home.\n\n\nThat wasn’t going to be fun.\n\n\nAt all.\n\n\nHe was right, but it ended up being uncomfortable and unpleasant for an entirely different reason than he had first suspected.\n\n\nWhen he got home May was waiting for him on the couch. She had some leftover pizza on the coffee table for him and was looking at him almost curiously.\n\n\nWhich made sense because it was almost midnight now and Peter’s face had long since healed from the fight. \n\n\n“I got the strangest voicemail from the school today,” she said her voice tighter than her smile and Peter slumped down, his eyes connecting with the floor in an attempt to protect himself from her reaction.\n\n\n“Peter?” Her voice was a little harder now and Peter almost couldn’t stand it.\n\n\nHe could never stand her disappointment. \n\n\nShe was all he had left. \n\n\nIf she was disappointed then that was it for him. \n\n\n“I- I got in a fight today at school- and got suspended-,” Peter’s voice was choked up, his eyes burning as he blinked back tears. \n\n\n“Peter! What happened are you alright!” May shouted, her hands suddenly tipping his face up to look at it. Her eyes were filled with concern, raking up and down his face.\n\n\n“I-I’m fine,” He said pulling back, away from her hands, “Crazy healing remember?”\n\n\n“But that means you did get hurt doesn’t it!” She said suddenly mad and Peter’s eyes were wide as he started opening and closing his mouth.\n\n\n“Uh- e-yeah? I guess-,”\n\n\n“Ugh! I can’t believe this!” She stomped her foot and Peter flinched a little, shoulders sagging.\n\n\nShe was angry which made sense, Peter was so mad at himself. \n\n\nHe had actually fought against-,\n\n\n“I’m calling the school! I can’t believe that they’d suspend you from protecting yourself it’s ridiculous!”\n\n\nPeter’s train of thought rolled into a ditch as May angrily got out her phone.\n\n\n“Wh-Wait! No, it’s fine I deserved the suspension I-,”\n\n\n“So you started the fight?” May asked looking up from her phone with her eyebrow arched and Peter felt something in his throat stick.\n\n\n“No! Of course not! I-,”\n\n\n“Then it was self-defence and they can’t-,”\n\n\n“May please-,”\n\n\n“No! This is the last straw you never-,”\n\n\n“That’s not the point!”\n\n\nMay froze as Peter shouted over her. \n\n\n“I-,” Peter took a deep breath, “I threw a punch and that’s unacceptable. I have super strength- hell, I’m spider-man. I can’t just do something like that I could literally kill anyone if I-,”\n\n\nPeter looked to see May’s eyes melting into a look of pity that made shame boil in his gut, “May,” he groaned.\n\n\n“It’s not your fault Peter.”\n\n\n“It doesn’t matter. I don’t want to fight this okay, can I just- go to SI instead of school? I could get my robot done before-,”\n\n\nMay waved her hand dismissively. \n\n\n“Do whatever,” May said looking him in the eyes with a very familiar, soft look. “I trust you, but Peter, you know you can let us deal with some of this stuff? you don’t always have to-,”\n\n\n“Thanks, May, I appreciate it.” He said before she could say anything else. Wanting to get out before the Pity-Peter-Parade actually started and they were both crying on the couch reminiscent of all those long nights after Uncle Ben’s death.\n\n\nHe grabbed the box of pizza as he pulled himself up the stairs, missing the last concerned look that May threw his way. \n\n\nStark Jr., Chapter 3:\n\n\nIt was announced that Midtown High’s Decathlon team was taking a field trip to SI!\n\n\nWhich was awesome for them, and for Ned, but it soooo sucked for Peter.\n\n\nNed had fervently tried texting Peter about it as soon as he found out- okay he started texting Peter about it about 10 minutes after his mom had signed his permission slip that night, but all that matters is he did remember to try to warn Peter about it.\n\n\nThat doesn’t even matter because there was no answer, Ned could only assume that Peter had gotten his phone smashed in some superhero thing again. \n\n\nI mean Tony always replaced the phone right after (usually with some new, never before seen model and wasn’t that absolutely fucking epic!) but Tony wasn’t here or whatever right now.\n\n\nPeter and Tony really needed to settle down and sort out their mutual father-son feelings before they both silently suffer to death.\n\n\nNed had seen the same look in Tony’s eyes that he’d seen in Peter’s that wistful look that made Ned want to hit them both.\n\n\nBut Ned didn’t hit either of them because they would only get embarrassed about the situation and maybe would stop talking to one another which would be the exact opposite of what they needed.\n\n\nNed swears that one day he’s just going to lock them in a room until they sort out their mutual want of a family themselves.\n\n\nUntil then, Ned needed to just be there for Peter.\n\n\nOr something, he’s just really winging this whole thing. It’s not like having a superhero best friend came with a pamphlet or instructions or anything. He’s mostly just going off of the comic books he used to read (still reads but no one but Peter needs to know that) and those all have some kind of loyalty- power of friendship kind of deal going on.\n\n\nSo- Ned can only assume that if it’s this major of a troupe that it should be something, like, good or whatever.\n\n\nAnd he’s trying really hard. That part should matter the most.\n\n\nBut gosh darn it! Peter really wasn’t kidding with the ‘Parker-Luck’ stuff!\n\n\nNed was staring up at the skyscraper with the same awe as the rest of his class, the experience was only slightly dampened by his attempts to text Peter- discreetly text Peter, and, when that was failing him, May.\n\n\nBut May was probably too busy working-,\n\n\nNed didn’t have anyone else’s number that would be able to contact or warn Peter.\n\n\nSo, he’s done all he can do, and with one last text merely reading ‘Well, I tried man.’ he was settling in to watch Peter suffer from the sidelines.\n\n\nM.J. already had her sketchbook out. He doubted she even thought for one second that Peter could have gotten out of this mess, or maybe hadn’t even really cared enough to want to help him out of this mess.\n\n\nOr maybe she just thought this was funny.\n\n\nIt was so hard to read her…\n\n\nNed had been ushered into the lobby with the rest of the class by their teacher who was checking and re-checking the attendance with military precision because: “I’m not losing any of you kids in this death trap of a building” \n\n\nThey were suddenly waved over by a girl with a messy black bun and a lab coat. \n\n\nShe was out of breath and looking like she ran there, which maybe she had, Ned didn’t know her life.\n\n\n“Hello!” She finally said, clearing her throat, “You guys Midtown High?” Their teacher breathlessly said yes and the girl continued, “Cool. I’m Maggie. I’m going to be your guide for today.”\n\n\nMaggie?\n\n\nWasn’t that the intern girl that Peter was helping a lot lately?\n\n\nOr- No, well that’s, like, a common name or something right?\n\n\nPeter did say that Interns usually gave the SI tours and Maggie’s an Intern but- Nah, Peter’s luck isn’t really that bad right?\n\n\nRight?!\n\n\n“Everyone needs a badge and an activity folder,” \n\n\nAs all the badges were handed out a kid raised his hand.\n\n\n“Excuse me? Why is your badge green and the ones we’re getting clear?” \n\n\nMaggie smiled at the girl and held up her badge a little higher so everyone could see it.\n\n\n“Excellent question! My badge is green because I’m an Intern here. The clear badges go to visitors and allows them to tag along to all the places of their highest badge holder in the group. You then have yellow badges which is for janitors, secretaries ect, but don’t underestimate a yellow badge- you can get a lot of places with a yellow badge. Then there’s green badges, which is for college Interns and students or apprentices. Then scientists and researchers get a blue badge and head scientists get an Orange badge. \n\n\nAll the SI facilities have different badge systems, I’m pretty sure P.R. has a purple badge and that their highest one is green, but at the tippy top of all SI facilities regardless of what they do is the gold badge. It’s held by Tony Stark and other people of high importance that need to be able to access everything at all times in every building.”\n\n\nFlash’s hand shot up, and Ned’s face pinched as Flash sent a pointed, self-satisfied smirk his way.\n\n\nNed so, so wanted this! Which sucked for Peter because Ned knew that Peter wasn’t going to enjoy any of what was about to happen when he found out about it, but Ned could not be more ready for Flash to get what’s coming to him.\n\n\nEspecially after getting Peter suspended.\n\n\n“Is there any high school Interns?” Flash asked and the entire class sighed, eyes rolling and kids crossing their arms in irritation.\n\n\n“Uh- No, Dr. Stark only accepts college students for Internships-,”\n\n\nNed slumped a little at that, but before Flash could start gloating Maggie continued.\n\n\n“Well. There is Stark Jr. whose technically Tony Starks ‘personal intern,’” she put quotes around that, “but really- and remember your NDA’s, the kid is basically going to inherit the company when Pepper and Tony go off to Gutalampour together or something.” Maggie shrugged at their stunned faces, “kid’s like 15 but he’s a super genius so- you all should get ready for a new age of Stark Industry.”\n\n\nThe class started whispering fervently at that and Ned rolled his eyes.\n\n\nIt’s not like Ned hadn’t figured all that out already, even if Peter seemed very oblivious to just how much Tony Stark and Pepper Potts were grooming him to take the company. \n\n\nNot that there was much grooming to be done really.\n\n\n“Who do you think Stark Jr. is-,”\n\n\n“Probably some illegitimate kid Stark-,”\n\n\n“He’s probably hot, c’mon, genius and inheriting a multi billion-dollar company. He has to be hot-,”\n\n\nReally, all this is funny actually.\n\n\nNed’s found that ever since he’s been the only one ‘in the know’ about Peter’s, real, whole life, he’s been the only one in the know about a lot of cool stuff.\n\n\nWhat supervillains are up to. \n\n\nWho superheroes are behind the mask.\n\n\nSI industry secrets and meetings and gossip.\n\n\nNed was watching the rest of the class whisper about a classmate they’ve isolated and teased, and honestly, Ned figured that he’s allowed to be smug right now. \n\n\nNed turned to look at Flash, whose eyes were squinted a little, intensely looking at Maggie. Ned followed Flash’s gaze to a folder Maggie had tucked under her arm. \n\n\nA really oddly stained and dirty folder…\n\n\nStark Jr.\n\n\nPeter was exhausted. \n\n\nIt seemed like not having highschool for the past week had encouraged everyone to double up his workload, but honestly.\n\n\nPeter was really happy.\n\n\nHe was basically living at the tower right now, never mind the ‘only staying over on weekends’ rule anymore, but in his defence, he had gotten a lot of stuff done in all that time.\n\n\nWith Pepper and Tony both dealing with stuff out of reach, Peter was the next go-to for most of SI.\n\n\nEven a couple of board members had decided that Peter was their best fill in (considering they had requested his presence in the board meeting Tony and Pepper weren’t able to attend).\n\n\nPeter had gotten a couple of projects off the ground and into production and finally had the marketing team making good memes for the new stark phone.\n\n\nHe had met with finance and accounting and had fixed some of their ledgers to save them almost a 100 million.\n\n\nPeter was pretty content about the last week.\n\n\nWell, he was content about almost everything- except the, you know, one thing he actually wanted to do…\n\n\nTony and Pepper were supposed to be back soon, which was great.\n\n\nPepper had shot him a text for dinner plans when she got back and he always loved talking with Pepper.\n\n\nShe was a fine dining expert and he always watched in fascination as she picked out ‘perfect food combinations’, considering Peter’s idea of a good food combination was pizza and ranch dressing. \n\n\nPeter couldn’t wait to see them again but, he hadn’t gotten the chance to even sit down with his robot in the last week. Let alone finally work it out and have it finished.\n\n\nHe wanted to show Da-Dr. Stark the finished product when he got back.\n\n\nRight when he got back and not a moment after-,\n\n\n“Hey, Peter!” Maggie shouted from behind him out of breath and running, “Sorry- I’m just so very late for escorting a high-school tour. I drew the short straw this week- I just wanted to ask for your notes on my file?” Peter was already looking through his backpack as she kept talking, “I want to work on my final report while the children are pulling each other's hair at lunch-,”\n\n\nPeter tore the page out with the notes for her file, handing it to her with a flourish and a smile.\n\n\n“Thanks!” She was off again as soon as he handed her the page,\n\n\n“No- uh problem…” he said watching her disappear into an elevator. \n\n\nWhen Peter got to the lab the little guy was still sitting on the same spot of Tony’s desk that he was at the beginning of the week.\n\n\nPeter nervously pulled up the little guy’s schematics biting his lip.\n\n\nHe was going to have to turn it on at some point today, but maybe If he carefully went over the code and schematics first he can minimize any of the previous- uh, issues…\n\n\nStark Jr. Chapter 4:\n\n\nRhodey had opened the lab door to find Peter tangled in a bunch of wires, Queen blaring over the speakers, which was honestly just another one of those things that made Rhodey wonder if Tony was just joking when he said Peter wasn’t his kid.\n\n\nEither way, Rhodey couldn’t help but laugh as Peter tried to sort out the mess he was in, tongue sticking out and hands tugging at one knot.\n\n\n“Hey, mind if I ask what happened?”\n\n\n“Rhodey!-“ Peter said in a startled yelp whipping around only to almost fall over as the wires around his legs pinched them together.\n\n\nHis super-spider balance the only thing keeping him from toppling.\n\n\nRhodey smiled as Peter’s face darkened into a blush and Rhodey walked over, grabbing the wires closest to the ground, lifting up and collecting the wires in a bunch as he went. He plunked the wires down on the desk next to Peter’s pet-robot.\n\n\n“Gah- thanks!,” Peter tried to turn back to the robot but Rhodey gripped his upper arm. \n\n\n“Ah ah ah! Nope, Fri says it’s feeding time-,”\n\n\n“What! I haven’t been here for that long!”\n\n\n“If you don’t remember Mr. Parker, Yesterday I allowed you to skip your lunch alert if you took two extra today, this is one of those extra meal times.”\n\n\n“Friday!” Peter groaned and Rhodey frowned, Peter was in the tower for lunch yesterday? On a school day? Peter was looking at the robot again and Rhodey decided he’d work on one thing at a time, filing that away for later he placed his hand on Peter’s shoulder.\n\n\n“Hey kid, what’s up?”\n\n\n“Oh, noth-,”\n\n\n“If you say ‘nothing’ then I’m going to give you a Tony Style lecture on sharing emotions with the class and-,”\n\n\n“Alright alright!” Peter said, throwing his hands up in a surrender motion, his eyebrows raising to his hairline before a hand went to rub at the back of his neck. “I just wanted to finish the robot before Da-Dr. Stark got here and I haven't been able to work on it- like- at all this week,”\n\n\nPeter trailed off, and Rhodey’s eyes scanned over the egg-shaped robot on the desk. Peter ran his hand through his hair, eyes running over the ball of wires in front of him, and Rhodey’s lips thinned, his eyebrows scrunching a little at the kid.\n\n\nBecause this was really unlike Peter. Not the whole ‘getting into random tight spots,’ thing, that seemed to happen to a lot, much to Rhodey and Tony and- okay well, everyone’s dismay.\n\n\nBut, Peter usually was really calm and collected when things went wrong experiment wise. When it came to science and the company the kid was just the ultimate professional. \n\n\nWhen it came to Tony, feelings and other people well, that's when the kid seemed to go into stuttering mess territory.\n\n\n“Kid, this really just about the robot?” Rhodey asked because he knew there was an issue, what that issue was he didn’t immediately know, and in his experience, it was more likely than not bound to baffle him. \n\n\nStark men were emotionally constipated, self-deprecating nightmares. \n\n\n“Yes? Kinda?” Rhodey raised an eyebrow at him because Peter knew that he couldn’t lie. He couldn’t lie to the point that if everyone at his school wasn’t so mind-bogglingly dumb he would have been found out as Spider-Man day one. \n\n\nPeter puffed out a breath.\n\n\n“I mean, I just really want to show him it when it’s done and… I don’t know.”\n\n\n“You know you don’t have to prove yourself to him kid right? He knows your capable?” Tony knew that he was more than capable. Rhodey’s seen Tony’s will and the kid runs the place anytime that Pep and Tony aren’t. It’s really been helping Pepper and Tony actually have lives instead of just work and at-home work. “Besides I bet he’d like helping you out on building it or whatever. Father-son bonding time.”\n\n\n“No!” Peter said his hands reaching out before they jerked back up to his head grabbing at his hair, “I mean! ughhh,” \n\n\nRhodey’s eyes widened in surprise, “Okay.” Rhodey said slowly, “Share with the class kid. What’s up?”\n\n\n“Don’t you think it’s weird? Like, am I going to far with the father-figure thing?” \n\n\nRhodey had to hold back a snort because honestly, that wasn’t going to help right now.\n\n\nTony and Peter were both holding back in a relationship they mutually wanted more than anything. Tony wants to nurture Peter with every fatherly bone in his body and Peter desperately wants a parental figure in his life that can keep pace and make Peter feel normal in his capabilities. \n\n\nThey both are doubting whether the other wants what they do.\n\n\nWhat a pair.\n\n\nLike father, like son I guess.\n\n\n“What do you mean kid?” Rhodey asked anyway and Peter shrugged. \n\n\n“I don’t feel incapable or anything- not anymore I just!” Peter huffed, “I don’t know, he’s not my dad shouldn’t I just make the robot by myself- why should- am I taking to many liberties in like, hanging out with him?” Peter finally said, his voice slowly evening out.\n\n\nRhodey frowned. \n\n\n“Hey kid? Put your stuff up. Let’s go get lunch and we can have one of our famous talks.” \n\n\nStark Jr.\n\n\nMaggie had been scrambling around a lot lately.\n\n\nShe had a double major, and this internship and a job and a mother she needed to care for.\n\n\nThings had been- \n\n\nThings had been a lot lately.\n\n\nSo she got tour duty. Guess she wasn’t there when the Interns drew straws, which was a sure-fire way to have the crap job shirked onto you, which was just great.\n\n\nAll well, she would at least get to work on her stuff during the lunch break.\n\n\nThe kids were currently walking around the lower level’s touristy museum area, which had a lot of displays about past innovations and science.\n\n\nMaggie kept her eye cursorily on the kids, but their teacher seemed to be tracking them very intensely. \n\n\nMaggie had her stark-tablet open, looking over a couple of school papers she had on there. She was kind of editing/kind of just staring at the screen while daydreaming. The mud on the file under her arm was coming off in gritty chalk-like streaks against her lab coat and she brushed it off.\n\n\nWhich made her think of Stark Jr.\n\n\nThat made her frown.\n\n\nThat poor kid didn’t deserve the torment of high-school. No teenager really did, but Peter especially. \n\n\nMaggie couldn’t help but think of her little sister with that, and that made her sigh and tuck her Stark-Tablet under her arm.\n\n\nIt never hurts less.\n\n\nMaybe the pain is less present these days, but it never hurts any less than before.\n\n\n“Ms. Maggie! What’s that!”\n\n\nMaggie looked up to see a kid pointing at the super adhesion spray wall-display.\n\n\nOne of Stark Jr.’s designs, which meant that Dr. Stark was more than willing to put it on blast in his museum. \n\n\n“Ah, yes, that’s a special spray that is basically cheap super-cement. It’s being used for emergency situations, bridge collapses and earthquakes, to temporarily repair and reinforce buildings.”\n\n\n“Really! It looks just like silly-string!” Maggie smiled a little, at the comment.\n\n\n“Yeah, it does.” She said with a slight jerk of her head.\n\n\n“Why do some of the inventions have long lists of names by them and others have just one?” \n\n\nMaggie looked to the teenage boy who asked, seeing him picking at a sticker some tourists must have stuck over one of the names at the bottom of the display. \n\n\n“Oh, well here at Stark Industries we usually have several teams of scientists working on one project, however, Stark Jr. has made a lot of projects by himself and contributed a lot to many of SI’s most successful innovations. The only person that ever help’s Jr. is Dr. Stark otherwise he’s helping the rest of us- hold on,” \n\n\nMaggie looked around a moment before gesturing at the single name under the spray-cement invention she was just talking about. \n\n\n‘P.B.P-Stark’\n\n\n“That one’s one of Stark Jr.’s personal projects, I think Dr. Stark- No that’s not one he helped on hold on,” Maggie turned around again a small gaggle of children behind her.\n\n\n“Ah!” She pointed to the nano-bite system that just got patented a few months ago.\n\n\n‘P.B.P-Stark &amp; A. Stark’\n\n\nThere was some whispering behind her at the names. \n\n\n“Definitely an Illegitimate kid then?”\n\n\n“Didn’t she say he was a high-schooler, do you think he’s single-,”\n\n\n“I’m going to look up that name, do you think there would be pictures of him on one of the fan-,”\n\n\n“Holy heck, his name’s under the Spider-Man web shooter patent-,”\n\n\nMaggie smiled at the gossiping behind her. \n\n\nShe could only take at least a little refuge in the fact that Peter would never have to deal with asshole teenagers in SI.\n\n\nStark Jr.\n\n\nPeter had what could only amount to a small mountain of food in front of him, from several, if not all the different food joints in the cafeteria room. \n\n\nSI was worse than airport security, with the scanners and constant building checks. At the end of all of the building planning, it was just decided that it was a lot easier to just put some food places in the building instead of having to go all the way through exit security then entrance security for brakes or food.\n\n\nOf course, the SI science building had over 20,000 workers so the food places got a good amount of business from 20,000 scientists coming in for (now mandatory) lunch with a dinner or breakfast thrown in there some days. \n\n\n\nThey had a Mcdonalds, Taco Bell and the like, but a couple of small family places managed to grab a place in the cafeteria too, usually, because Tony or Pepper had tried and really liked them and wanted them closer to work.\n\n\nThe places were usually run by one family member for the entire day.\n\n\nThis business opportunity was soon extended to Mr. Delmar around the third time Peter went on a quick swing by to get lunch and Tony had taken a bite from his sandwich. \n\n\nMr. Delmar now refuses to take Peter’s money for his sandwiches because, as Mr. Delmar says, “If it wasn’t for you I wouldn’t be in an SI building making triple what I do on a typical day, you helped me put my daughter through college Peter,”\n\n\nPeter, however, knew he could put away a lot more than what Mr. Delmar could afford in sandwiches. So soon, every day, he was grabbing a free sandwich from Mr. Delmar’s set up in SI, then scoping out a few of the other places. \n\n\n\nThere was a family business that looked to be just a bakery that happened to double as an ice cream shop. One cinnamon bun later Peter was in love. There was a family-owned Mexican place, and one of the only coffee shops left that didn’t have anything to do with Starbucks. This was only just the beginning of the options SI had for non-corporate food in the cafeteria.\n\n\nPeter decided he loved these places each in turn and he usually found one food that they did better than any other place Peter had tried. \n\n\nBefore Peter knew it, they too had taken notice of him.\n\n\nMaybe it had something to do with the fact that he could eat a, probably, literal ton of food. It was also taken note that Tony Stark personally paid for it every time. So Peter had the money and the stomach to give them a lot of sudden business, and with Tony’s own close eye on Peter, they have the chance to have the Tony Stark take note of them too. \n\n\nAfter last year, when Tony basically bought out a restaurant for a week to cater for Peter’s birthday, it was decided that Peter's business was important to a lot of small-time food joints. \n\n\nRhodey had gotten the food, buying a few of his favourites from every place, but Tony, as always, had paid for it.\n\n\nAn arrangement that Peter had spent a couple of months fighting only to give in when Tony had pointed out that with his super-metabolism he really needed to be eating more than he could afford.\n\n\nSo Tony pays for his food now, and every day Peter walks into the cafeteria and immediately has several vendors beckoning him over to try their new foods or telling him when they got new shipments of his favourite things. \n\n\n“Hey Peter!” Lily shouted from over her counter to where Peter was making his way through the mountain of food.\n\n\nPeter’s head snapped over to her and Rhodey smiled as Lily held up a fresh tray of Nutella cinnamon Panini’s. A gentle, knowing smile on her face.\n\n\nPeter gasped, standing up, his chair squeaking loudly on the floor as he darted over to Lily who was smiling bright, a laugh barely contained as Peter ran over, taking a Panini and taking a huge bite, groaning in pleasure as he did so. \n\n\n“Here, take the tray and go sit back down,” Lily said, tucking some of her hair behind her ear, She handed him the tray as Peter nodded, his cheeks puffed out, mouth filled with Panini.\n\n\n“‘Ow ‘uch?” he asked, mouth full. Lily smacked him on his arm lightly. \n\n\n“Chew your food.” She said, “you just bought us out of cinnamon buns and I know you're coming back for ice cream at the end of all of that, so you can just have the Paninis. They’re the first batch of the day and I know you like them fresh!”\n\n\nPeter swallowed, a little  frown on his face, “I can pay I’m-,”\n\n\nLily shook her head, “You can’t fight me on this Stark Jr.” Peter smiled as she gently pushed him back toward Rhodey.\n\n\n“Thank you!” He said before darting back to his place sitting in front of Rhodey. \n\n\nHe tucked in, focused on the Panini’s and Rhodey laughed as Peter looked back up with cream-cheese frosting on his face. \n\n\n“Okay, Mr. Black Hole Stomach, What’s up with you and Tony?”\n\n\nPeter paused in his eating, swallowing his mouthful before his hand started tapping on the edge of the table.\n\n\n“Well, I just, I don’t want him or anyone thinking I’m like… wanting something that I can’t have or?”\n\n\nRhodey sighed, “kid look, Tony really cares about you,”\n\n\n“I know that-,”\n\n\n“No, I don’t think you do, because Tony has so many dad jokes he’s been holding back on because he doesn’t want to ‘go too far’, either.” Peter frowned, and Rhodey pushed the cases of chilli-fries his way. “Tony and you- You both are family. In everything but blood kid and everyone knows that. Tony’s not going to pull back on you ever.”\n\n\nPeter shoved a fork-full of the loaded up fries in his mouth and Rhodey smiled as the chilli got on his chin.\n\n\n“Kid. You're a mess.” Rhodey said shaking his head and Peter blushed, picking up one of the napkins. “You should talk to him more. Communicate y’know. About your feelings on these things-,” Rhodey trailed off for a moment because this was something he thinks Peter needs to hear about.\n\n\nTony’s never going to come forward with it and Peter’s never going to ask.\n\n\nRhodey could wait for them to come to ‘situational climax’ and finally talk- or, he could help it along a little.\n\n\n“Hey, wanna know a secret that’s not really a secret?”\n\n\nPeter’s eyebrow rose up eyes glancing away before darting back, “uh, yeeees?”\n\n\n“Tony’s been looking over legal guardianship papers with SI-legal lately.” \n\n\nPeter’s eyes widened, “is he thinking of like taking in a kid!?” Rhodey’s mouth hung open for a minute before he started laughing at the ridiculousness of that.\n\n\nBecause of course Peter would say that.\n\n\n“Yes, kid. He is, he’s thinking about broaching the topic of guardianship with a certain brown-haired, genius kid that runs have his company behind his back.”\n\n\nPeter sputtered, dropping several napkins on the ground before jerking down to pick them up.\n\n\n“Uh- re-really?” Rhodey hears him ask from his place basically hiding under the table.\n\n\n“Yes really,” Rhodey laughed, Tony was giving every excuse about it, saying that it was so the board couldn’t really do or say anything about him giving Peter the company, that he wanted to make sure if Spider-Man stuff came with legal issues Peter would have a Legal Guardian™  with him, but mostly, it was all just because Tony needed to be there for Peter.\n\n\nIf something happened, ever, he wanted to be there.\n\n\nPeter smiled pulling back up into his seat and Rhodey watched as he took a large bite out of a pizza slice.\n\n\n“Thanks Rhodey, I’ll- I’ll talk to him about it when he gets back tonight. Oh! Isn’t Pepper getting back tonight too!”\n\n\nRhodey nodded, “she’s actually back now, she got back this morning but has been running around the different buildings, sounds like the meeting in Hong Kong took a slight political turn and well, she can tell you more about that than I can.”\n\n\n“Cool! She said we could go to dinner sometime soon, and I want to show her some pinching I did this week with the Ledgers in accounting-,”\n\n\nRhodey frowned.\n\n\n“That reminds me kid,” Rhodey began, “what have you been doing at the tower? Don’t you have school?”\n\n\nPeter’s face went a little pale and he slumped down in his seat again not completely making eye contact.\n\n\n“Kid.” Rhodey said slowly and Peter groaned.\n\n\n“I-,” Peter stared before hunkering down, hiding behind the table a little.\n\n\n“I got suspended from school-,”\n\n\n“What!” Rhodey yelled because Peter Parker, nicest kid ever, got suspended, “what for?”\n\n\nPeter swallowed, “fighting.” He stated, his voice cracking a little at the end there.\n\n\n“What?” Rhodey asked more confused than anything, because honestly, Peter Parker had a hard time with fighting when he was actually facing supervillains, much preferring to outsmart and web them up rather than throw punches and kicks.\n\n\nNot that that meant he didn’t have to throw punches and kicks all the time anyway but, Peter didn’t like violence he wouldn’t just fight someone. \n\n\n“You were fighting?” Rhodey asked him sceptically and Peter shrugged.\n\n\n“Well there’s this kid at school with a prosthetic leg and Fl-another kid was messing with him and then- I…”\n\n\n“So you were defending someone then.” Which made a lot more sense but Rhodey knew Peter wasn’t telling him everything. \n\n\nPeter twisted his fingers in his pockets.\n\n\n“Well, he- I just- I just reacted.” \n\n\nRhodey’s eyes darkened at what that implied.\n\n\n“Reacted to what?”\n\n\n“He uh, went to punch me and-,”\n\n\n“What!” Rhodey shouted, standing quickly which made his chair make a horrible screeching sound. Getting a look from the other people in the cafeteria, Rhodey took a deep breath, slowly sitting back into his chair. “so, he went to punch you?” He asked in a much quieter voice. \n\n\n“Well, I don’t know- It just happened! Suddenly I was holding his fist and he was holding his face-I-I punched him…” Peter said and Rhodey sighed.\n\n\nHe knew all about that.\n\n\nHe wished it wasn’t a kid he had to talk to about it but he got it.\n\n\nBattle Instinct, training, it was hard to shake- well, you weren’t supposed to shake it. That was kind of the point of combat training.\n\n\nIngraining a response into someone so hard that under the worst, most mind stopping stressor, you still reacted the way you’re supposed to.\n\n\nIn the heat of battle that saves your life.\n\n\nIn a high-school hallway, it gets you suspended.\n\n\n“Peter, you didn’t do anything wrong.” Rhodey started, \n\n\n“I punched him and I hadn’t even realized-,”\n\n\n“Peter,” Rhodey shook his head, “he went to punch you first you were defending yourself.” Peter shook his head.\n\n\n“I shouldn’t- No, I can’t afford to do that. I’m Spider-Man,” Peter whispered the last bit, leaning closer to Rhodey, “I could hurt someone so badly- If I had put even a little of my super-strength behind it-,”\n\n\nRhodey shook his head. “But you didn’t, You can’t be scared of your powers this way Peter. They’re your powers.” \n\n\nPeter closed his mouth, hunching down.\n\n\n“I know,” he squeaked and Rhodey clapped a hand on his back.\n\n\n“We can get you some training if that would help? I’m sure Charles Xavier would be willing to have you hop around with some of the mutant kids in his school.”\n\n\nPeter laughed a little, his smile lifting up at the corners again, “he keeps bringing up that I don’t need to have the X gene to go to the academy.”\n\n\nRhodey laughed, “oh man, I don’t know how you do it kid!”\n\n\nPeter quirked up an eyebrow, “do what?” \n\n\nManage to make everyone like you in the span of one or two meetings without even trying.\n\n\nRhodey thought to himself, he shook his head. “Never mind kid. Anyway, what about the other guy? He suspended too?”\n\n\n“No,” Peter said in a flippant and lax manner that was so contrasted to Peter’s previous intensity that it almost gave Rhodey whiplash. Peter pulled the last piece of the pizza out of the container.\n\n\n“What- do you mean no?” Rhodey started his voice a little choked at the dismissive tone Peter had and Peter shrugged.\n\n\n“No one caught him doing it, and they didn’t ask me my side of things. Not that I think that that ever helps, he probably just made up a story of what happened or something.” Peter said bitterly before shrugging, “It’s fine. whatever.” \n\n\n“That’s not fine Peter,” Rhodey said his voice dark.\n\n\n‘Not that I think that that ever helps,’\n\n\nDid that imply what Rhodey was hoping it didn’t?\n\n\nTony was going to throw a fit- Pepper was going to throw a- Hell! Rhodey was throwing a fit right now if only mentally!\n\n\nRhodey’s eyes laser-focused onto Peter his eyebrows scrunching together.\n\n\n“Kid, are you being bullied?” Rhodey asked seriously and Peter swallowed.\n\n\n“It’s not like they can do any-,”\n\n\n“Kid!” Rhodey said over the top of him because that was all he had to know, “why didn’t you tell anyone we-,”\n\n\n“It’s fine I have it handled-,”\n\n\n“You got suspended Peter, wrongfully so too!”\n\n\n“No- Yes, well I don’t think-,”\n\n\n“Peter! Please,” Rhodey said and Peter’s mouth snapped shut. “You realize I’m going to have to tell Tony about this right?”\n\n\n“No please! I can handle this myself! You know Tony! He will absolutely flip! Out!”\n\n\nRhodey groaned as Peter gave him the watery puppy dog eyes of death.\n\n\nThe kid was right too. \n\n\nTony would probably wreck the entire school system if he found out about Peter being bullied.\n\n\n“Fine kid, but I’m telling Pepper-,” Peter opened his mouth but Rhodey ploughed on before he could say anything, “and there’s nothing that can convince me differently.” Peter’s mouth snapped shut and Rhodey stood up.\n\n\nSpeaking of Pepper...\n\n\n“How about you get food mountain up to the Lab and work on you little bot up there? Here’s hoping it doesn't start throwing food at you when you turn it on though”\n\n\nPeter threw him a smile, sighing helplessly “yea!” He said, standing, “Sure thing, I’ll grab a couple to-go bags or something-” \n\n\nRhodey nodded at Peter, as Peter started gathering the food up. \n\n\nStark Jr.\n\n\nMaggie was leading the kids through the smaller labs on the lowest floor. \n\n\nWhich was fine, it’s just these labs were usually set aside for low-level scientist and all the Interns and Maggie was determined NOT to throw dirty looks at her co-workers at least not while on the job that she was already mad about getting stuck with.\n\n\nBesides she knew exactly who volunteered her in her absence and she will be throwing hands with him later. \n\n\nAnyway, the Interns were scrambling around the way that SI interns do, and Maggie was pointing out any particularly cool inventions that were behind the glass of the wall windows.\n\n\n“What is that!” One kid yelled over Maggie’s explanation of one of the other inventions. The teacher hissed at the kid not to interrupt but Maggie just waved her hand dismissively. Stopping and turning to gesture at what the kid was looking at.\n\n\n“Don’t worry about it! That one is a really distracting invention.”\n\n\nAnd, by Jove, it was.\n\n\nIt was a ten-foot-tall Lazer looking thing.\n\n\nIf Doctor Doofenshmirtz was here he’d be calling it an Inator and ranting to Perry the Platypus.\n\n\nUnfortunately, it wasn’t very interesting past that.\n\n\n“That’s basically a giant super microscope. The point of it is to eventually observe RNA and DNA and maybe even get to a point where we could edit it manually with tools. Wiping out Human susceptibility for certain genetic mutations or diseases.”\n\n\n“Whoa,” The kids started whispering and Maggie was suddenly struck with the sudden memory of, oh yeah, this is a nerd school isn’t it?\n\n\nSo, I guess to them that would be pretty cool-,\n\n\n“Do you think that the consequences of Gene Editing is inhumane?” A girl asked in a monotone voice, her hand not stopping from whatever she was drawing in the sketchbook in her arms.\n\n\nThere’s a really smart, tough question if Maggies ever heard one.\n\n\n“Well, it’s hard to say. On one hand, helping the quality of life for humans always sounds great on paper but it does have the consequences of making us ask and answer the question ‘what needs to be fixed’ when we talk about genetics. I think that we just have to hope that by the time science has gotten to that point we will have the answer.”\n\n\nThe girl squinted her eyes at Maggie, which made Maggie extremely uncomfortable before she gave a single approving curt nod Maggies way.\n\n\n“Okay! Well-,” Maggie said turning back to continue their trek through the labs.\n\n\n“Hey, Maggie!” Maggie sighed as a familiar voice of a man she was going to throw hands with later sounded behind her.\n\n\n“Jerry not now.” Maggie said, “I’m working!”\n\n\n“I know, I just want to know if you know where Stark Jr. is? I need his input on-,”\n\n\n“Look, Jerry,” Maggie hissed out rounding on him and sticking her finger into his chest. “You know how busy Jr is, you can’t just tell him to come down and look at your project! Submit a report file to his desk like everyone else!”\n\n\nShe turned around to the tense forms of the kids behind her. She took a deep breath before turning back to Jerry who was looking at her with wide eyes hands up in a surrender motion.\n\n\n“Everyone in this place wants Stark Jr.’s input do what everyone else does.” She said a little calmer this time as she gestured the kids forward, pointedly ignoring Jerry.\n\n\n“Okay everyone let’s get moving again, keep together- remember not to touch anything.” She led the kids into an almost empty lab that was cleared for tours.\n\n\nA kid near the back nervously raised her hand. \n\n\n“Yes?” Maggie asked, shooting her a little smile trying to dissipate the tension in the room.\n\n\n“Does uh, ‘Stark Jr.’ help interns out a lot?” \n\n\nMaggie nodded, turning to the cabinets on the far left of the room, she opened the top one to pull out several boxes.\n\n\n“He helps out everyone. Him, Pepper Potts and Tony Stark all tag team to keep this place running. He helps out in everything from the labs here, to SI Legal. We all know Stark Jr. but because of that he’s extremely busy, honestly I’m surprised that Dr. Stark allows him to keep going to public school,” Maggie shook her head, “It’s a waste of his time- no offence to you guys. I went to public school myself.”\n\n\nThere were frantic, excited whispers and she turned around precariously balancing the three large boxes.\n\n\n“Wait he goes to public school like here in new york?”\n\n\nMaggie nodded walking over to the tables set up in the room and putting the three boxes down.\n\n\n“Yupperooni,”\n\n\nThe whispering picked up more and then the real question Maggie knew they all really wanted to ask was finally spoken.\n\n\n“Do you know which school it is?” \n\n\nMaggie shook her head, “Remember your NDA’s that’s classified stuff kids.” \n\n\n“But you do know then!” another kid asked and Maggie shrugged.\n\n\n“I’ve heard the name in passing, the kid doesn’t talk about school a lot in house, I don’t even really remember it guys I-,”\n\n\n“Okay kids settled down!” The teacher finally spoke up sternly. “If she says she can’t answer you she can’t answer.”\n\n\nThe kids all deflated a little a few mumbling under their breath.\n\n\n“Well.” Maggie started with a sigh, weighing it in her head. “I suppose I could tell you the gist of the school name or something? It’s not like I remember it all that well.” She mumbled the last bit more to herself and the kids perked right up scrambling with a chorus of different versions of “yes” and “thank you” pouring out of the group.\n\n\n“Okay. Well, It was something like M-somthing -Engineering or whatever. Like M-something Science and something school of whatever.” \n\n\nThe group got really quiet, and Maggie looked up to see the stunned and unsure looks on their faces.\n\n\nA girl in the back popped some bubble gum and Maggie looked up to see that girl from before looking really weirdly smug.\n\n\n“Midtown School of Science and Technology?” She said with a quirked eyebrow and Maggie looked at her stunned because, yeah?\n\n\n“Exactly that actually how do you-,”\n\n\n“Holy FUCK he goes to OUR SCHOOL?” \n\n\nWait what? What school was she giving a tour?\n\n\nThe room was a ruckus and the teacher looked a little pale but was otherwise trying to restore some semblance of order to the room. \n\n\n“Kid’s settle down!” slowly the excitement tuned down from shouting to excited whispers.\n\n\nMaggie’s eyes darted around the room, sweeping over each kid with a slightly aggressive glare because they might be kids that knew Peter, and Peter definitely went through a lot of hell at his school.\n\n\nThey might have just watched or laughed when Peter got bullied or worse. \n\n\nMaggie didn’t know all that went down and Peter didn’t talk about or complain when bad things happen to him. He seemed especially content to stay quiet about the bullying and Maggie gripped the edge of one of the tables, her knuckles turning white with rage.\n\n\nShe was mad.\n\n\nShe was mad and she could not take it out on these kids because some of them might be little shits but some of them might be good kids, and you can’t just get mad at a group of people like that.\n\n\nShe glared the hardest at the teacher though, because Peter has come to the tower with bruises and the school definitely hasn’t done anything about that. \n\n\nIt was first and foremost the staff's job to handle that kind of stuff and they are failing over and over again the same way Maggie’s sister got failed by all the staff and all the students at her school.\n\n\nKid’s are little shits some times but adults are fucking evil.\n\n\nMaggie swore in that moment to herself. She didn’t care what she had to do to get Stark and Pott’s attention, she was going to let them know about the shit going down in their kid’s school whether or not Peter wants it or not. \n\n\n“Okay, kids!” She said clapping her hands together, her voice tense. “We’re going to do a bit of a competition here! You are going to build robots only using the stuff,” She shook one of the boxes a little, “-in these boxes. One of the other Intern’s here will come in and judge the final product and then the winner will get a coupon for a free dessert in the lunch cafeteria-,”\n\n\nThere were more excited whispers at that, but the kid's conversations were still very much focused on the previous conversation.\n\n\nStark Jr.\n\n\nPepper was so glad to be home. Even through the never-ending conversations with ten pushy old men in suits Pepper still hadn’t been able to actually solve the problem that the Hong-Kong branch was facing, with all the riots and what not it was starting to put SI in a political stretch and Pepper didn’t know what they were going to do.\n\n\nOf course, now that she was home she was probably going to be able to do a better job of handling it. \n\n\nThe head’s always feel like they need your hand on attention but attending meeting after meeting for a week isn’t actually solving the problem it’s just having a lot of different flavours of coffee in one day.\n\n\nPepper had just sat down, typing the password in her office desktop so she could transfer the files from her travel laptop there. \n\n\nShe was rubbing at her forehead, hoping to forgo the stress headache this time, her eyes ran over one of the notifications at the bottom of her screen and she smiled seeing the new emails she got from Peter.\n\n\nShe opened one, giving a little “awwww,” At the dog there. \n\n\nThe good boy was a Shepherd Dog whose tongue was lolling out of his face, tail thumping against the trash can he was sitting on. \n\n\nPeter snapped pictures of the dogs he saw while out as Spider-Man, making sure to personally show Pepper pictures of dog’s he found with funny haircuts or weird names that he just ‘had to tell her’. \n\n\nIt started after a conversation with Pepper over breakfast when Peter brought up a dog he saw while stopping a mugger and Pepper had gasped asking him if he got a picture.\n\n\nThe answer was ‘no’ but Peter has never missed a dog picture since then.\n\n\nThere was a knock on her door-, which made the stress headache close back into her head and she sighed.\n\n\n“Come in.”\n\n\nShe half expected Tony to burst in with something ridiculous but to Pepper’s surprise, it was actually Rhodey who was sporting a tense and serious expression.\n\n\nPepper’s eyebrow rose and she sent a searching look his way.\n\n\n“Rhodey? Is something wrong?” She asked because the last time they had had one of their one on one talks, it was about Tony possibly doing something to get himself killed-\n\n\n“It’s about Peter,”\n\n\nAnd now Pepper was really worried, because Rhodey was sporting the look he had when he needs to talk to Pepper about ‘Tony’s doing something self-destructive and maybe stupid,’ \n\n\nPeter was a lot like Tony in ways that made Pepper both extremely proud and utterly exhausted.\n\n\n“What? what’s wrong?” Pepper said a little breathless and Rhodey sighed.\n\n\n“The kid’s being bullied,” Rhodey said shortly and, that, that’s just- not right. “We had a talk over lunch- he’s been here all week because he got suspended.” \n\n\nPepper’s eyes darkened, her eyes glaring into the air, “What?”\n\n\n“He was defending a fellow student and the other kid just kind of blamed Peter for the whole thing and the kid’s blaming himself for it too-,”\n\n\nPepper waved her hand in the air because she’d prefer to hear it from Peter. Right now she felt that she needed to deal with the school board and maybe call a couple of their lawyers.\n\n\n“I’ll take care of it.”\n\n\nAnd she would, she’d find a way to take care of the situation, because it was unacceptable that Peter was being bullied.\n\n\nWhat was the staff at that school even doing? Suspending a kid without knowing about the situation. \n\n\nPeter was just as self-sacrificing and self-deprecating as Tony was, and Pepper knew that if given the chance he’d suffer in silence the same way Tony was prepared to die alone back during the palladium situation.\n\n\nPepper was exhausted, what school did Peter even go to? \n\n\nStark Jr. \n\n\nNed was glaring at Flash. The intern from before, Jerry, he’d been the one to judge the robot’s and had decided that Flash was the winner. It didn’t matter that even their teacher knew that Kim’s robot was honestly the best design out of all of them, but Jerry had insisted. \n\n\nNow everyone was wishing that Kim had been the one to win because now Flash wouldn’t shut up.\n\n\n“Maybe Tony Stark will notice my robot and I’ll get an actual Internship-,” Flash was smirking straight at Ned but Ned only shook his head in annoyance. The voices of the other kids on the trip were steadily whispering behind them as they walked.\n\n\n“-who do you think Stark Jr. is,”\n\n\n“Maybe we have a class with him or something-,”\n\n\n“Do you think he’s on this trip or-,”\n\n\n“Of course he’s not on this trip! That’s like taking a tour of your own home-,”\n\n\nNed shook his head a little in amusement because, oh yeah, that was a thing.\n\n\nThe kids were trying to sort out who could possibly get this much attention from SI.\n\n\nHonestly, Ned wondered how kids so smart could be so dumb about this kind of stuff.\n\n\n“Hey Dead, if you think my design was great with a bunch of crap in a box how do you think it would look with actual materials.” The students standing nearby glared at Flash, trying to pointedly turn back to their conversations. “Maybe Tony Stark will-,”\n\n\n“Actually the entire point of the exercise was to show that a great design doesn’t need fancy stuff to work. Having expensive metals doesn’t matter if your design is bad.” Maggie said, a tight smile on her face as she gave a stern look to, surprisingly, the teacher who was completely absorbed with the roaster, making sure all the kids were in the group together.\n\n\n“I may remind all of you,” She said, turning from flash and speaking a little louder for the rest of the room to hear. “We have a strict no-bullying policy while your all on SI property, remember the waivers you signed.”\n\n\nNed pretended to cough, leaning into his hand to hide a smile. \n\n\nFlash glared at him gritting his teeth.\n\n\nStark Jr.\n\n\nMaggie, kept her eye on that kid, Dash or whatever, while leading the group to their next stop on the tour.\n\n\n“The Hero’s Vault.” She said gesturing out into the room. The kid’s oohed and ahhed appropriately as they all filed into the room. “These are displays of the weapons and armour of heroes, you might recognize a few names.”\n\n\n“Is that the Widowbites!”\n\n\n“Wow, the Iron Man armour!”\n\n\n“Is this Spider-Man’s suit!”\n\n\nMaggie smiled as the kid’s dispersed into the room. She turned to look at the teacher who was still going over the roaster religiously.\n\n\nWhat originally seemed like a responsible adult who was making sure his kids didn’t wander off, was suddenly a really incompetent person that couldn’t see ten feet away from the paper he was holding.\n\n\nMaggie cleared her throat a little standing next to the teacher who was still looking from the roaster, up then back down to the roaster again, matching names with faces.\n\n\n“Uh, sir?” The teacher looked up making eye contact with Maggie.\n\n\n“Yes?”\n\n\n“Don’t you think,” Maggie started, her smile shaking as her voice badly hid her anger, “That maybe you should be watching your kids?”\n\n\n“I am,” He said like Maggie was dumb, gesturing to the roaster and Maggie grit her teeth.\n\n\n“No, like actually watch the kids. Like how their interacting and what there doing and saying to one another. Maybe you could go up and ask a kid what they like about one of those displays or just- something?” \n\n\nThe teacher started to glare at Maggie and Maggie tensed up, “Are you criticising how I run a classroom?”\n\n\nAbsolutely yeah. Maggie wanted to say.\n\n\n“Of course not,” Maggie said instead. “I just think that maybe the kids could benefit from talking to their teacher a little more one on one you know,” \n\n\nAnd maybe putting you directly in the crossfires could make you see what’s right in front of your face.\n\n\nThat part was left unsaid however and Maggie suddenly felt really tired as the teacher turned to her.\n\n\n“I don’t tell you how to do your job,”\n\n\nWhich is something no one who actually does a good job at their job has to say.\n\n\n“You’re right.” Maggie said with a smile that made her feel like she was back in retail all over again. “I don’t know how it’s like as a teacher, I'll just go answer any of the questions the kids might have,”\n\n\nLike a teacher…\n\n\nMaggie moved away from the conversation because there really was no getting through to someone who didn’t want to hear criticism.\n\n\nI bet he thinks he’s such a great teacher. Maggie thought to herself and really, don’t they always.\n\n\nMaggie pulled away from him, mentally running through how satisfied she was going to be when Ms. Potts and Dr. Stark rampage on Peter’s school.\n\n\nShe could only imagine the amount of zero’s on that lawsuit.\n\n\n“Isn’t that Stark Jr.’s name!” A kid yelled.\n\n\nMaggie turned to see a small group of kids huddled around a Spider-Man suit model.\n\n\nThat guy was a really popular hero, Maggie would give him that.\n\n\nShe wouldn’t have picked spandex if you asked her though.\n\n\n“It is in fact.” The kid’s heads whipped around to see her as she walked up. “All models have plaques next to them with the names of people who helped build these devices you see. SI is all about giving credit to the deserving minds.” Maggie said, and was pretty glad of said fact too because now that she knew exactly who these kids are- well, she was going to be turning her gushing on Peter up to 11, “Jr. specifically works on all Spider-Man’s tech directly. He’s kinda Spidey’s go-to engineer. Spidey only trusts him to work on his stuff, well actually the only other person who works on his stuff is Dr. Stark himself. They’ll work on the suit and Spidey-Gear together sometimes though. Stark Jr. stays hold-up in Dr. Starks Personal Labs like he doesn’t have his own.” Maggie gave a small fake laugh like she was saying something casual, “You know he has his own floor in the tower, you’d think he’d use it.” The wide, awed eyes of the kids was a sweet taste in her mouth but she knew she wouldn’t be satisfied until Peter himself was the one getting those looks from them directly, “and If you take a look at the Iron Man armour you’ll see that some of the newer suit models have Stark Jr.’s name next to it.”\n\n\nThe kids ran over to the Iron Man Armour display cases and Maggie smiled before turning to see that kid who won the robot thing, pouting.\n\n\n“Hey what’s your name kid?” She asked,\n\n\n“... Flash Thompson?”\n\n\nMaggie filed that name away for later. \n\n\n“Why don’t you go look at the Iron Man Armour with the other kids?” Flash glared at her before slowly pulling away from the wall he was leaning on and joining the group of kids near the Iron Man Armour. \n\n\n“Does Stark Jr. ever pilot any of the suits!?” One of the kids shouted/asked her and Maggie smiled,\n\n\n“Of course he doesn’t” Flash hissed out making Maggie’s smile fall. \n\n\n“Well,” Maggie began over the top of him, “Actually Jr.’s piloted it before but he doesn't do it regularly. You need to know how it feels to work something like that to actually improve its design”\n\n\n“That’s so cool!”\n\n\n“Does ‘Shuri’ mean who I think it does,” One of the kids asked gesturing breathlessly at the name on one of the newer Widow Bite model plaques.\n\n\n“If you think it’s the Princess of Wakanda than yes, you’d be right.” The kids started murmuring excitedly again and Maggie smiled, “Stark Jr. and her work together a lot on projects, they’re like best friends and are terrors when they run through the building, making synthetic lava and shouting vine references at one another.” Maggie’s eyes went wide, looking into the distance as if she was recalling a traumatic event that she had tried to deeply repress in the back of her psyche. \n\n\nReally she was just thinking about the time Shuri and Peter tried to genetically recreate Tribbles, and had actually, unfortunately for everyone, succeeded. \n\n\n“See that’s what geniuses do, they don’t sit in their room’s making lego sets,”\n\n\nFlash was talking to that tubby kid again and Maggie tried to hold back a glare. She glanced over to the teacher who was still counting over his kids. \n\n\n\nHow thick could one person be?\n\n\n“Actually,” Maggie said turning her head back to the kids, “Stark Jr. and Dr. Stark use legos in the planning of a lot of things. Legos are pretty useful for tons of STEM stuff,”\n\n\nMaggie looked down at her watch with that. She smiled to herself a little when she saw the time. The exhaustion weighing down on her again.\n\n\nLunchtime.\n\n\nStark Jr.\n\n\nThey were all filing into the cafeteria. The room had people in it, It wasn’t, like, overly busy but it was, you know, lunchtime. \n\n\nEven with the kind of standard amount of people, a lot of the restaurants in the cafeteria seemed to be scrambling to make and pack up food.\n\n\nFlash looked to see Maggie kind of glancing over it, her hands thumbing through the file she’s been carrying the entire day. \n\n\nThe one covered in mud.\n\n\nFlash frowned at that.\n\n\nOne of his classmates spoke up, “Why does everyone look so busy?”\n\n\nMaggie glanced around but before she could say anything one of the workers were walking by carrying a large amount of food bags.\n\n\n“Oh, Stark Jr. just ordered lunch, he can pack away tons I swear!” She said with a little laugh at the end, rolling her eyes in a fond way.\n\n\nWhat was that even about anyway?\n\n\nEven someone whose work was being made harder by the guy was fondly referring to him. \n\n\nCome on!\n\n\nIt was like Peter Parker all over again, but at least Penis was just a loser. This Stark Jr. guy was actually cool, and then it comes out they go to school with him!\n\n\nFlash can’t get a break can he!\n\n\nMaybe life would cut him some slack and make that Stark Jr. guy fat. I mean look at all that food he just ordered.\n\n\n“Okay, everyone! Go sit wherever you want but we all need to meet at the doors by 1:30 okay!”\n\n\nFlash stomped away to get in line at some sandwich place he’s never heard of before, “-yeah and Peter’s gonna be so wigged out that we were just walking around floors below him this entire time.” Flash growled a little turning to see Dead and M.J. talking- er Dead chattering at M,J. who was ignoring him and drawing in her sketchbook. \n\n\n“Are you kidding me? You’re still covering for his lies how pathetic can you get!” Flash shouted only for the guy behind the counter to give a stern, “Hey!” \n\n\nFlash stomped off immediately, not even bothering to get food as he plunked down at a table, slumping in one of the chairs. \n\n\n“Okay, but Stark Jr. is obviously a super-genius too, like he’s our age and working on all this SI stuff with doctors, people with multiple PHDs and he not only keeps up but corrects them!”\n\n\nFlash slumped even further into his seat as his peers talked about some random kid they didn’t even know the identity of…\n\n\nMaybe that was the appeal.\n\n\nFlash glowered down at his table. \n\n\nNone of this was going the way he hoped it would.\n\n\nSince Peter was gone Flash was supposed to be the smartest in the room and he was supposed to get the attention.\n\n\nBe the man of the hour, or whatever.\n\n\nNow even though he made sure Parker wasn’t going to be on this trip, someone else completely different came in and stole the spotlight without Flash even having a chance.\n\n\nFlashes eyes looked up to see the tour guide Maggie a little ways across the room with a salad in front of her. \n\n\nShe was looking at the muddy folder intensely and writing something up.\n\n\nIt rained a lot this week…\n\n\nIt looked a lot like that one that Penis had at school the other day though, but it couldn’t be because Penis Parker did not actually have an Internship here.\n\n\nBefore Flash even really knew what he was doing he was up and walking up to Maggie. \n\n\nShe looked up at him and her face was tight with an unreadable expression. \n\n\nFlash swallowed.\n\n\n“What happened to that folder?” He asked and Maggie looked surprised, eyes going down to the folder and back up to him a couple of times before she shrugged.\n\n\n“A little incident happened to the guy I gave it too.” Now her eyes were dangerously narrowed at him. “You know, I couldn’t help but notice that you have a habit of picking on your peers-,”\n\n\nFlash’s face darkened and he was halfway turned before Maggie ploughed on, “You know my sister committed suicide in high school.” Flash froze, his adam’s apple bobbing as he swallowed. “She was fourteen. This group of girls at her school were making life a living hell for her, taking her stuff, making fun of her. They locked her out of the locker room without her clothes once... It all ended one night and it could have been prevented by- so many people. Anyone. Me…” Maggie trailed off before her eyes were boring into Flash again. “I don’t do bullies any more kid, and you have to know that you’re never gonna be seen as the good guy when you make the people around you miserable. Even if it’s just one kid.”\n\n\nMaggie shut her folder turning her full attention to a loose piece of notebook paper that looked like it was hastily torn out of a book.\n\n\nFlash’s legs were a little shaky as he walked back to his table.\n\n\nEveryone was standing around the door by around 1:30 just like Maggie said, after a headcount and then a double check by their teacher Maggie was leading them up to the testing labs.\n\n\n“Now, this, is where the action happens,” Maggie said, spreading her arms out a little to gesture to the floor they were on.\n\n\nAll the walls looked ultra-reinforced as they went, and they even saw a small explosion in one of the rooms they walked by,\n\n\n“Don’t worry kids,” Maggie said a little nervously, “I’m sure that was what was supposed to happen.” Meaning that that probably wasn’t supposed to happen at all.\n\n\nThe class was whispering at all the cool stuff when suddenly screaming and unholy screeching was heard down the hall. \n\n\nA robot that looked like a spider was barrelling down the hallway at full speed, knocking over tables and dragging things down as it went.\n\n\nBehind that robot was Peter Parker, screaming “Stop! Wait!” at the top of his lungs and running after it.\n\n\nStark Jr. Chapter 5:\n\n\nFlash’s eyes were wide. His fists shaking by his side as Peter tackled the robot pushing a button on its side to shut it down. He tumbled forward a few times with his inertia, rolling before shaking his head, hair wildly settling sticking up and poofy. Peter looked up, his eyes wide and owlish as his eyes focused to see Maggie standing right in front of him.\n\n\nHis clothes were dishevelled and the robot sat in his lap all eight limbs tucked away into the sides of the body to give an egg-shaped appearance.\n\n\n“Stark Jr? What are you doing here?” Maggie asked, her voice more amused than anything as she gave a little smirk at the agent of chaos in front of her.\n\n\nFlash felt like he’d been slapped.\n\n\nThe kid that had been screwing him over all day was the same kid that had been screwing him his entire life. \n\n\nFlash growled as Peter nervously laughed, his hand going to rub the back of his neck.\n\n\n“Well I was hoping that if I tested this little guy down here it would minimize the damage, I was partially right but now we’re going to need a new door on testing room S.”\n\n\n“Hi Peter,” Ned said from the back of the class, his voice barely containing a laugh.\n\n\n“Hi Ned,” Peter said back automatically before freezing. \n\n\nHead slowly turning to take in the rest of the class.\n\n\n“Wh-Wh-Wh,”\n\n\nBecause of course, he wouldn’t know. Of course, it would just be a freak accident that would line up perfectly to make perfect Peter Parker look fucking perfect! \n\n\nHe wasn’t trying to look good, he just did. All the time. Doing everything!\n\n\n“Yeah, the class is taking a tour at SI, didn’t you get any of our texts?” M.J. said in a monotone voice. \n\n\n“No!” Peter said, his voice octaves higher than normal. “Da-Dr. Stark hasn’t replaced my phone yet I-,”\n\n\nIt was like the whole situation slapped Flash in the face all at once because before he had realized what had happened, he had stormed over and with an outraged cry had socked Penis in the face.\n\n\nPeter was now fully crouched on the floor, his robot just under him as he cradled his nose and mouth, blood dripping on the floor.\n\n\nThere were gasps and screams behind him but before Flash could do anything else he was being yanked back his arms being restrained behind him. \n\n\nStark Jr.\n\n\nWell, that hurt!\n\n\nIt was almost as bad as that one time he accidentally stuck one of his webs to the blade of a helicopter while swinging and got launched into the side of a skyscraper face first.\n\n\nPeter’s eyes were watering out of control, tears rolling down his face involuntarily, but really Peter’s felt worse. \n\n\nHis nose was dripping blood, definitely broken, well… broken for now. With the adrenaline running in his veins his super-healing is probably on overdrive.\n\n\nThere was blood dripping down onto his shirt and pants, dotting the fabric with streaks of blood. \n\n\nWhich made Peter’s mind go back to every other time he was covered in blood. A high pitched ringing in his ears, his breath heavying before he snapped out of it, a loud yell of his name breaking through the fuzz and making his eyes shoot up. \n\n\n“Peter!” Peter looked up as Maggie grabbed the sides of his arms, pulling him from his crouched position. She took his robot, which he was still clutching to his chest. She placed it on a nearby table. Her eyes were wide and angry. \n\n\nSome scientist jogged up from somewhere outside of Peter’s vision with a towel. Peter cringed at the shock of pain that happened as Maggie pressed the towel to his face pinching a little making Peter breathe through his mouth.\n\n\nHis breath coming out slower than before thankfully.\n\n\nThe other scientist hovered- and Peter recognised her, her name was- Like, Janis or something.\n\n\nHis eyes were slowly drawn back to the crowd of his classmates where Happy was holding Flash’s arms behind his back restraining him against a wall. \n\n\n“-on my fucking watch too, are you kidding me!” Peter's brain seemed to finally tune back in to hear the end of Happy’s rant. Peter licked his lips trying to bring some moisture back into his mouth.\n\n\n“Uh- Happy,” Peter started, voice a little nasally and hoarse as he breathed through his mouth.\n\n\nJanis- if that is her name- gently guided the towel from Maggie's grip to his own. Peter thanked her, discreetly looking at her badge which had the name ‘Janine’ on it and honestly how was Peter supposed to remember that?\n\n\n“Friday!” Happy yelled, in a stern and angry voice that made Peter flinch, F.R.I.D.A.Y responded before Happy said anything else. \n\n\nPeter was embarrassed at his reaction, his reaction to Flash of all people getting physical with him. It’s not like Flash didn’t do that every other week these days.\n\n\nHis panic was decidedly not necessary. \n\n\n“Mr. Stark has been informed of Peter’s condition due to protocol: Baby Monitor. I have also informed Mrs. Potts who is coming down with Mr. Rhodes now.”\n\n\nOkay. \n\n\nNow, now, is the time for panic.\n\n\n“No!” Peter yelped- er, shouted manly, uh, shouting- as he instantly dropped the towel on the floor. His nose had stopped bleeding anyway. “Wait! It’s fine I’m fine-,” Maggie was nearly holding Peter to her chest as she glared at Flash and Peter couldn’t quite get out of her hold as she growled.\n\n\n“It is so very not fine Jr.” She said and Peter turned back to see the wide, awed eyes of his classmates. \n\n\n“Mr- Parker?” His teacher asked more than said, his breathless voice hitching on the name.\n\n\nPeter felt bad suddenly because he didn’t know. None of them knew and honestly, Peter didn’t know what he would think if some kid he never heard of started saying he personally knew Tony Stark.\n\n\n“No it’s actually fine you don’t understand-,”\n\n\nBecause they would be destroyed. Pepper and Tony would have that murderous look and-,\n\n\n“PETER!” The chorus of voices had Peter hunkering down a little as Pepper, Tony and Rhodey shouted his name.\n\n\nTony looked very frazzled, his eyes wide, button-up untucked as he was still in his suit from just getting back from a business trip.\n\n\nTony marched over while Pepper started making phone calls, her eyes dark as she did so. \n\n\nThe Murderous Look\n™.\n\n\n Tony gripped the sides of Peter’s face pulling him out of Maggies hold and into his own, Maggie relented almost immediately standing away with Janice- Janine whatever. \n\n\n“YOUR FACE!”\n\n\n“My face.” Peter said with a sigh, slumping down because what else was he supposed to do?\n\n\nTony was going to be mad but Peter would just have to say he tripped or something and they will all just get back to-,\n\n\n“What! Happened! To it!” Tony yelled and Happy pulled Flash away from the wall.\n\n\n“This kid punched him.” Happy stated and Tony’s eyes were full of fire.\n\n\nPeter’s eyes were wide, and Peter briefly made eye contact with Flash who looked mad.\n\n\nSo mad, and pale.\n\n\nHe was shaking a little too and Peter swallowed.\n\n\n“Why- You know what! I don’t even care! Get him out- Get them all out of my tower right now I’m not-,”\n\n\n“Dr. Stark-,” Peter started ready to defend Flash. \n\n\nDefend him after everything because he didn’t look like the kid who marched around terrorizing the school anymore, he just looked like one of the scared people Peter promised himself, promised Ben, he would save.\n\n\n“Tony.” Pepper said carefully and Tony turned to look at her and Rhodey. Pepper looked to Rhodey nodding at Tony.\n\n\nRhodey nodded back at her and Peter groaned.\n\n\n“GUYS!,” He shouted over top them but they just kept going-,\n\n\n“Peter got suspended at school this week because he was defending a kid in a fight,”\n\n\nAnd there it is.\n\n\nPeter frowned because what could he come up with for that one?\n\n\nHe couldn’t imply Rhodey was lying at all so he had to-,\n\n\n“What.” Tony’s voice was dead and Pepper continued on.\n\n\n“Frank and a couple of others have been trying to contact us because of the bruises on his face from the fight. I just got back so I didn’t see any of their messages till today.”\n\n\nOh. God.\n\n\nThere was no coming back from this anymore. No lying or redirecting to get them to rethink anything that they currently do.\n\n\n“Guys! It’s fine I can handle-,”\n\n\nPeter tried to reassure them or something.\n\n\nBecause Peter could handle Flash, he handled The Vulture and Mysterio, he handled criminals on a daily basis and an entire mega-corporation the rest of the time.\n\n\nA high school bully doesn’t bother him…\n\n\nUntil.\n\n\nUntil it did.\n\n\nUntil Flash got him suspended, until he got Peter kicked off of a field trip he was excited for- which ended up just being a tour of his own home but that wasn’t the point.\n\n\n“That kid-,” Maggie said over the top of Peter, pointing to Flash as she spoke, “Has been talking shit all day and with the interest he took in it, I’m pretty sure he’s the reason this file is covered in mud-,”\n\n\nAnd look, there’s Maggie with the File under her arm.\n\n\nThe one that’s ruined because of Peter being dumb enough to-\n\n\n“Mud?” Happy asked and Peter felt his heart sink as Happy ploughed on, “Is he the reason you were shivering in a mud puddle out in the front of the school?”\n\n\nPeter almost didn’t want to look at Tony’s face. \n\n\nSo he didn’t.\n\n\nHe just looked at the ground and waited.\n\n\n“What.” Tony’s voice choked a little on the word.\n\n\nTony, choked on his words.\n\n\nThe man that Peter’s seen skirt around journalists and corporate big wigs with his conversations and always get what he wants out of it.\n\n\nTony wasn’t okay and suddenly Peter felt his ground tilting.\n\n\n“It’s fine! Guys! Really he’s just- look I’ve been dealing with it I-,”\n\n\nBecause he has. \n\n\nAnd Tony shouldn’t be distressed- Peter shouldn’t be making Tony’s eyes look like he’s seen everything he loved die and come back again-,\n\n\n“How long?” Tony asked, forcing Peter to look him in the eyes by tilting his head up. \n\n\n“It’s not-,”\n\n\n“How long!” Peter swallowed eyes looking away from Tony’s distraught gaze.\n\n\nThere was no lying here, no redirection anymore.\n\n\n“Uh… since like middle school I-,”\n\n\n-can handle it?\n\n\nCan ignore it for four years and not talk about it with anyone ever?\n\n\n“Oh, you people are not going to get out of this with your jobs I’ll make sure of that-,” Pepper started and Peter shook his head pulling out of Tony’s grasp.\n\n\n“No!” He said looking at Pepper. That was the last thing he wanted. They shouldn’t get ruined for one mistake and it was Peter who decided to let it happen-, “I’m dealing with it I-,”\n\n\n“YOU’RE NOT DEALING WITH IT PETER!” Peter flinched at Tony’s yell and Tony took a deep breath pinching the bridge of his nose.\n\n\n“You- we’re not doing this anymore.”\n\n\nSomething sank in Peter’s stomach-, was Tony telling him no more Internship- No more Spider-,\n\n\n“No more high-school! We’re not doing this anymore,”\n\n\n“Tony-,” Pepper started, a little half-heartedly. Peter knew she agreed with Tony on some level. About whatever was going to happen and Peter was not okay with that if any of those plans involved murder!\n\n\nTony shook his head.\n\n\n“I knew! I knew how bad high-school is for geniuses!” Peter would have blushed normally at the declaration. That Da-Dr. Stark had called him a genius, but all Peter did is turn to look at the slightly terrified faces of the people behind him. Tony marched pass him suddenly, making his way to the teacher and glaring into his eyes with fury.\n\n\n“You don’t even know how screwed you are.” Tony said darkly before taking a deep breath and turning around. \n\n\n“Peter,” He said and Peter looked up at him, “You’ll like MIT, good dorms great science,” Tony said walking towards the elevators again. Peter’s brain halted with that. “ we can get you out with a Doctorate before your 20 if you go with a more accelerated route-,”\n\n\nEverything clicked at once and Peter almost choked himself on his inhale. \n\n\n“What! Dr.Stark, I-,”\n\n\n“You’ll love it kid.” Peter almost ran after him but the elevator doors had swiftly shut.\n\n\nPeter turned around eyes wide and flickering around as his brain tried to make sense of his own reality. \n\n\n“You’ll all be escorted out of the building by Happy,” Pepper said gesturing to Happy before turning with Maggie who was suddenly by Peter’s side again. “Let's get you down to Dr. Cho.” Peter sputtered a little but was quickly ushered into the elevator. Maggie and Pepper flanking him. His head craned one last time to try and see what was going on with his class before the elevator doors closed behind him.\n\n\n“So, am I going to have to ask you who that kid was?” Pepper asked him and Peter grimaced.\n\n\nYes, they can ask. Peter couldn’t bring himself to tell them though, because Peter was the one who decided to let Flash keep fixated on him.\n\n\nPeter didn’t fight back or tell teachers and Flash took the invitation that Peter gave him.\n\n\nIt’s not like Spider-Man can actually get hurt by some teenage kid-,\n\n\n‘But Peter Parker can.’\n\n\n Something in the back of his mind echoed that thought and Peter shook his head.\n\n\n“I don’t want him to get in trouble I-,”\n\n\n“Peter.” Maggie started before Peter could finish. Peter was just about done with people talking over him for the day. “that kind of thing is what he should be worrying about, not you, if he’s going around doing stuff like this than it sounds like he doesn’t care about getting himself in trouble as much as you seem to care about getting him in trouble.”\n\n\nPeter swallowed but provided no other words and Maggie sighed. “Flash Thompson. I was leading their group today,” And yeah. She was, wasn’t she. Pepper suddenly was all over her phone again.\n\n\n“Please,” Peter nearly whined making Pepper look up only to melt a little at his puppy dog eyes being turned on her, “I- I don’t want to sue them or- ruin anyone's lives or jobs I-,”\n\n\nCouldn’t do that. \n\n\nNot when they all have lives.\n\n\nThey might have wronged Peter in some way or another but Flash was good to his friends and most of his teachers had families and-,\n\n\nFlash was a kid still!\n\n\nPepper sighed, “I know you don’t” she stated more to herself than to him. \n\n\nThe elevator doors opened and Dr. Cho was standing to greet them.\n\n\n“Friday told me you were heading my way. What happened?” It was short and to the point, but with the amount of time Peter’s been on her table bleeding out from some gun-shot wound or a random alien blast burn all down his side that was to be expected.\n\n\nPeter untucked himself from the elevator, the blood on his shirt and pants made Dr. Cho sigh before she started prodding around his nose.\n\n\n“We can’t let teachers just do this kind of thing though Peter,” Pepper said, “We’ll have to tell the school board what's been happening, people will be fired but- I promise you that I won't do anything other than the standard stuff okay?”\n\n\nPeter sighed, he was lucky to have talked her down to that he supposed. He nodded and Pepper looked to Maggie, “thank you for your help, if you could come give me a rundown of what happened on the tour with that kid and then what happened to Peter-,”\n\n\n“You have no idea how happy I’d be to do that,” Maggie said with a sigh, and Pepper led her back to the elevator.\n\n\nAs soon as they were out of earshot Dr. Cho sighed.\n\n\n“Welp, super-healing screwed us. Your nose healed wrong so I’m gonna have to re-break and re-set this.”\n\n\nPeter grimaced.\n\n\nWell, he’s had worse.\n\n\nRight?\n\n\nStark Jr.\n\n\nTony just got back, almost literally having just stepped into the building when F.R.I.D.A.Y had spoken up with an alert.\n\n\n“The protocol: Baby Monitor, has just been activated Sir.”\n\n\nAnd wasn’t that an adrenaline rush that shot straight to his heart?\n\n\n“Where’s Peter?” He was off centre, his voice coming out heavier than normal but god damn it this was his kid, “is he okay?”\n\n\n“Nothing fatal,” F.R.I.D.A.Y stated instantly, trying to reassure her creator. “Peter has just been injured, he is on the ‘any good invention blows up at least once’ level of the tower.\n\n\nTony had swept to an elevator immediately.\n\n\nPeter got hurt in the experiment testing area?\n\n\nFri said it wasn’t fatal but that still left so many options.\n\n\nHe could be in pain still.\n\n\nHe could be crushed under a building without help because Tony was stupid enough to-\n\n\nNo.\n\n\nWe can’t focus on that, it never helps.\n\n\nTony has the kid close, he’s doing the right thing and keeping an eye on him.\n\n\nHe needs to make sure Peter’s okay.\n\n\nAnd he does. \n\n\nPeter’s standing when Tony steps off the elevator which at first is a relief.\n\n\nThere’s a bunch of people standing behind him- a tour group or whatever- and that robot.\n\n\nMaybe the robot did something to get Peter hurt- and then he saw it.\n\n\nBlood on Peter’s hands and on a towel and on the floor.\n\n\n“PETER!” He shouted and his eyes barely flickered to Pepper and Rhodey who were also just suddenly there too.\n\n\nWhy would F.R.I.D.A.Y grab Pep for this? Unless-, No.\n\n\nPeter first.\n\n\nTony stormed up, his heart flipping in his chest as Peter turned, blood down his face and nose crooked.\n\n\nHe hit it- \n\n\nOr someone hit him- \n\n\nWhich Tony cannot handle right now! Not right now.\n\n\nHe wants to reassure the kid do something but he is so very scared and all he can do is grab Peter’s face to make sure he’s still there.\n\n\nAnd then he just says it-,\n\n\n“YOUR FACE!”\n\n\nPeter’s face was pinched, which just made the mess there look worse. The purpling around his nose and the corner of his right eye only made Tony’s instincts- (not instincts he’s not a dad-,) flare up.\n\n\n“My face.” Peter said slumping with that, that-, big-eyed, sad resigned face.\n\n\nThat face he makes where he thinks- no- knows that something awful is going to happen to him and he just lets. It.\n\n\nBecause Peter’s too good, too nice to care about his own happiness and reputation when god forbid someone elses is as stake.\n\n\n“What! Happened! To it!” Tony tried not to yell, but he was just so scared and Peter was not going to be allowed to just get hurt without Tony and a team of doctors behind him at all times- then some shuffling and a grunt made Tony look up to see Happy pull some kid away from the wall, still restraining him. \n\n\n“This kid punched him.” Happy stated and Tony suddenly wished that someone was restraining him, because he wasn’t going to kill a kid.\n\n\nBecause Peter would never forgive Tony for killing a kid-\n\n\nBut Tony wasn’t even sure his brain had processed what was said beyond the rage, because he couldn’t fathom why!\n\n\nWho would want to hurt Peter!\n\n\nWhy!\n\n\nThe kid would die for even his worst enemies, he never held grudges. He always got back up, and if there’s even a chance- no even if there is no fucking way, if it’s impossible to save someone he will still try and he’ll do it too! He’ll succeed!\n\n\nHe’s the only superhero Tony believes in and he manages it inside the mask and out-\n\n\n“Why-,” and for a second he wants an answer, he wants to know- and then he sees Peter’s face, he sees the blood and he doesn’t want the answer anymore. It doesn’t matter, because someone. Hurt. His. Kid. “You know what! I don’t even care! Get him out-“ he looks to the other kids in whatever tour group this is and his anger is only stoked because- they could have stopped this, someone should have kept his kid safe! He'll ruin, all of them for being there and not-, “Get them all out of my tower right now I’m not-,” \n\n\n-doing anything he’d.\n\n\nHe’d. \n\n\nAnd then Peter would never forgive Tony for ruining the kid's life on behalf of him.\n\n\n“Tony.” Pepper said carefully and Tony turned to look at her and Rhodey. They exchanged a look.\n\n\nSomething that was almost exclusively saved for Tony’s mishaps was now suddenly on Peter.\n\n\nAnd Tony was sick to his stomach because Peter didn’t deserve to pick up any of his mannerisms- Peter didn’t deserve such a shitty mentor-,”\n\n\n“GUYS! It’s-,”\n\n\nPeter started and Tony wanted to know, wanted to sweep Peter up and hear him like Tony’s own father never did- \n\n\nNever even looked at Tony-,\n\n\n“Peter got suspended at school this week because he was defending a kid in a fight,”\n\n\nThen.\n\n\nNothing.\n\n\nStatic.\n\n\nTony’s entire life had been spent with his brain in flurries. Ideas and science yanking around and clicking connections even when he slept. \n\n\nThe only times Tony’s brain had ever been quiet were four times.\n\n\nOnce when Tony had flown into the rip in space to launch the nuclear missile out of the way.\n\n\nAgain when, for that split second, Tony thought Pepper was dead during the whole Extrimus situation.\n\n\nWhen Rhodey was in that explosion in the dumbest civil war ever.\n\n\nAnd then, when Steven slammed his shield into Tony’s chest in Siberia. \n\n\n“What.” Tony’s voice left him before his mind caught up.\n\n\n“Frank and a couple of others have been trying to contact us because of the bruises on his face from the fight.”\n\n\nBruises?\n\n\n“I just got back so I didn’t see any of their messages till today.”\n\n\nBecause they were both gone and Peter had no one to go to and of course that’s when a kid decided to start bullying him-,\n\n\n“Guys! It’s fine I can handle-,”\n\n\n“That kid-,” The tour guide Intern said her face outraged and Tony mentally filed her away for a raise or something later, pointing to the kid she continued to speak, “Has been talking shit all day and with the interest he took in it, I’m pretty sure he’s the reason this file is covered in mud-,”\n\n\nMud?\n\n\n“Mud?” Happy said right as Tony thought it, and Peter groaned as Happy’s expression morphed into his very, not happy face. “Is he the reason you were shivering in a mud puddle out in the front of the school?”\n\n\nTony choked on his own spit as he turned to Peter.\n\n\nThe very mental image of Peter shivering in a puddle of mud made Tony sick to his stomach.\n\n\n“What.” Tony’s voice came out by itself.\n\n\n“It’s fine! Guys! Really he’s just- look I’ve been dealing with it I-,”\n\n\nAnd then something clicked in Tony’s brain.\n\n\n‘I have been dealing with it,’ \n\n\nNot ‘i’ll deal with it,”\n\n\nOngoing and past tense. \n\n\n“How long?” Tony asked pushing Peter to look him in the eyes because that seemed like the only real thing right now.\n\n\nAnd Peter wasn’t mad.\n\n\nHis eyes held no hurt or remorse or anger.\n\n\nHe thought that it was just fine that all this was happening and it wasn’t!\n\n\n“It’s not-,”\n\n\n“How long!” Tony said because Peter was going to defend his own bully, in his own god damn house and Tony wasn’t having that. \n\n\nNot today, not ever, would Peter feel unsafe in his own home!\n\n\nPeter swallowed eyes looking away from Tony.\n\n\n“Uh… since like middle school I-,”\n\n\n“Oh, you people are not going to get out of this with your jobs I’ll make sure of that-,” Pepper started and Peter shook his head pulling out of Tony’s grasp.\n\n\n“No!” He said looking at Pepper, “I’m dealing with it I-,”\n\n\n“YOU’RE NOT DEALING WITH IT PETER!” Peter flinched and Tony almost flinched too just watching it, because Tony was the one that made him flinch.\n\n\nHe needed to calm down.\n\n\nHe needed to be calm right now.\n\n\n“You- we’re not doing this anymore.”\n\n\nBecause Tony knew, he had told May that they should get Peter into something else- something more advanced than high school- Tony didn’t care if it was MIT some community college or a random gifted and talented program-\n\n\nWell, actually he did care-\n\n\nHe cared so goddamn much because Peter deserved everything.\n\n\nHe would give up his own life for a stranger in a heartbeat and Tony could never see anyone being as kind and good as Peter Parker ever again.\n\n\n“No more high-school! We’re not doing this anymore,”\n\n\nMay had just told him ‘Peter needed to feel normal,’ and then Tony dropped it in a conversation with Pepper because for some reason Pepper can make the same point Tony was but get May to agree where Tony gets told to ‘get out of my house’ 60% of the time.\n\n\nBut Pepper just shrugged saying it was up to her and Peter.\n\n\n“Tony-,” Pepper started, a little half-heartedly and Tony shook his head. \n\n\nBecause this isn’t up to them anymore.\n\n\nBecause Peter’s getting hurt.\n\n\n“I knew! I knew how bad high-school is for geniuses!” He said, looking Pepper in the eye and her face melted into the look. That sad look she gives him sometimes that drives him crazy! He turned around. Eye locking on the teacher- the first person who should have stopped his kid from getting punched, and he moved, watching the teachers eyes dawn with horror as he went-.\n\n\nIt wasn’t enough.\n\n\n“You don’t even know how screwed you are.” Tony said before taking a deep breath and turning around. \n\n\n“Peter,” He said and Peter looked up at him again.\n\n\nPeter would never forgive him for just making the school take responsibility. In Peter’s world he was always the biggest person in the room, the most responsible. Anything anyone did bad was his fault because he ‘has a responsibility’.\n\n\nTony can’t fix the system by suing them or forcing them to do what he wants, not without pissing off Peter in the process.\n\n\nSo he’ll do something equally as effective with less kicking and screaming, hopefully.\n\n\nHe’ll remove Peter from the situation.\n\n\n“You’ll like MIT, good dorms great science,” Tony said as he turned around, mind made up. He’d call the dean right now actually, the man owes Tony too many favours now anyway. He started walking towards the elevators, “ we can get you out with a Doctorate before your 20 if you go with a more accelerated route-,”\n\n\nAnd Peter would crush it. Peter would cruise through the accelerated route like he was on a highway- and if by some chance he didn’t, \n\n\nTony would be there to help him anytime that road got too bumpy to drive.\n\n\nHe’s been there for Peter, he’d be the support to him in a way that Tony never had as a kid.\n\n\n“What! Dr.Stark, I-,”\n\n\n“You’ll love it kid.” He said, because Peter would. He loves science and the college students are more interested in what you do rather than their own egos.\n\n\nAnd MIT would throw anyone out who punched another student on campus.\n\n\nStark Jr.\n\n\n“But MIT is too far away! What about you! What about Spider-Man,” Peter said from his spot on Ned’s bed. “We were going to go to college together and I was going to bother you by playing queen at 4am when I’m patching myself up from patrol,”\n\n\nNed was on the floor, the pieces of a new lego set strewn around the both of them.\n\n\n“Dude, I’m legit happy for you. You should go. It’s MIT, that’s a highbrow college and Tony Stark just got you in for free and at 16-,”\n\n\n“I know!” Peter said his head going in his hands, “It’s great- He’s great! He always is it’s just- I- Everything in my life is so bizarre! The spider-stuff, I never even had a normal family I just- high-school was the one, I don’t know? Average thing I have?”\n\n\n“Peter… I hate to break it to you but even without the Spider stuff your still a genius- I just don’t think you ever could be normal.”\n\n\n“I know.” Peter said, his voice low and sad as he fitted another finished lego part to the main piece, Ned bit his lip.\n\n\n“Why don’t you just tell Tony about- all that?” Ned asked and Peter shook his head.\n\n\n“He’s so gung-ho about this- I just, I don’t want us to get in a fight or argue,”\n\n\n“Peter,” Ned said putting the Lego pieces he had down. “Arguing is, like, good, it’s a way you make sure you don’t make the people in your life miserable on accident.”\n\n\nPeter shrugged before looking back to Ned, “Do you think Rhodey actually meant it when he said Tony actually thought of me- like- kinda like a son?”\n\n\nNed smirked, “you know he has your name hyphenated on all the credit plaques right?”\n\n\n“What!” Peter yelped and Ned laughed.\n\n\n“Yea- P.B.P hyphen Stark,” Ned said and Peter blushed, “you know the class was googling you in the middle of the tour- nothing popped up because yeah but,”\n\n\n“Ugh! The class!” Peter whined, “do you think they’ll tell anyone what they saw-, you know, about me?”\n\n\n“They signed SI NDA’s! They’d have to be actually stupid to something like that Pete,”\n\n\nLittle did they know, their entire school is actually stupid. \n\n\nStark Jr., Chapter 6: \n\n\nOn Monday there were a lot of people hanging outside the school. Just a ton, all camping out right outside the property line so that they couldn’t be removed by the school.\n\n\nPaparazzi, news outlets, along with internet bloggers and even just normal people who wanted to get a peek at Peter, were all crowded around the outside of the school. \n\n\nIt was a mess.\n\n\nPeter had woken up on Sunday morning to see his name on news outlets and internet sites alike. Which was, disorienting, almost surreal, right before it was really, really scary-, like life-ending scary.\n\n\nSomeone broke their NDA, which had Peter on the phone with Ned, basically having a panic attack before May, with a stern face and scared eyes, had made him hang up the phone and turn everything off.\n\n\nTv off, phones off and unplugged, May and him had a sit-in, no contact Sunday where they just talked and ate and cried. Ignoring every knock on the door and keeping all the lights off.\n\n\nBecause what were they going to do about this? Peter wasn’t okay with being a celebrity!\n\n\nHe wasn’t good at social contact period. What was he going to do now that everyone was suddenly looking at him, interested in his life in ways that no one but May and maybe Ned had ever been interested in?\n\n\nSpider-Man didn’t have people banging on his door trying to get an interview or something, he couldn’t have that. \n\n\nPeter Parker did now though. \n\n\nThe nobody Peter Parker that he had spent countless hours a day keeping out of the spotlight. The secret identity wasn’t just for the people he loved, it was also for him too.\n\n\nMonday swung around faster than Peter wanted, and he and May had made tense conversation over breakfast. \n\n\n“Do you want to stay home-,”\n\n\n“I can’t stay at home.”\n\n\nThe last thing he wanted was to be trapped by them, trapped because of all this.\n\n\nHe had to leave his home, business as usual. It was the first time he’d be back at school in a week and, of course, all of this happened right before that. \n\n\nPeter decided to leave for school via his bedroom window, which felt just ridiculous and awful. He didn’t go out the window except to keep his secret identity down-low, but, here he is. Normal, nerdy Peter Parker had to leave out of his window now because he wasn’t normal anymore. \n\n\nNot to anyone outside at least. \n\n\nHe managed to kind of skirt around the people outside their front door, though he did notice that a few of the crowd had already trickled off... \n\n\nHe took the back way to school, deciding that it didn’t really matter that he was already late for first period considering everything happening at the moment. \n\n\nAs he managed to get closer to the school his eyes widened to see the crowds outside the front doors and- well what was he supposed to do?\n\n\nNinja in through some skylight? That would just lead to more questions.\n\n\nSo, he walked through the front doors.\n\n\nThey weren’t grabbing him at least, but there were crowding around him and shouting.\n\n\nFlashing camera lights and people screaming his name, and questions, and...\n\n\nPeter’s breath was coming out in short, sharp puffs as he walked past them and into the building- and did it just get worse?\n\n\nIt was silent.\n\n\nThe sounds of breathing and shouting and screaming were all muffled behind the school doors- well, as muffled as anything is with his spider senses anyway.\n\n\nThe silence though.\n\n\nIt was broken by intense stares, the feeling of eyes pin-pricking his neck and making his spidey-sense ring out on high alert.\n\n\nEvery student and teacher seemed to be staring at him. \n\n\nPeter’s eyes swept the hallway, his lips pinching together and swallowing hard as the kids seemed to have an unbreakable gaze on him.\n\n\n“Peter?”\n\n\nPeter looked to the left to see a nervous freshman looking at him, the one with the prosthetic leg that he saved last week.\n\n\n“I wanted to say thanks for saving me from Flash, I should have stuck up for you or something but-,”\n\n\nPeter waved his hand at the kid eyes still glancing over to the other people in the hall who were unnervingly silent.\n\n\n“It’s not like anyone here would have listened to either of us, not with Flash. I’m glad you kept yourself safe.”\n\n\nThe kid seemed to relax a little at that and right at that moment Ned and M.J. were pushing through the crowds of frozen children in the hallways.\n\n\nM.J. hissing out a, “Don’t you people have classes or something?” in a dark voice.\n\n\nThey walked over to his side, pressing him in between the two of them before gently chatting over him. Trying to make some buffer or shield around him from all the eyes. \n\n\nIt was like a spell had been broken. \n\n\nAs soon as Ned and M.J. had glued themselves to his sides the kids started moving, people putting things in their locker closed them and everyone standing started slowly dispersing. \n\n\nHis first class was with Ned, but after that, he didn’t have any other classes with him until after lunch, and he had missed first period...\n\n\nPeter wasn’t going to be able to focus and it didn’t seem like that was an issue because no one else could either. \n\n\nHis chemistry class was just the teacher asking him questions about SI and Tony Stark and Peter had caught several people with their phones out, recording or taking pictures of him and-,\n\n\nPeter was just, really tired.\n\n\n“- and how does Mr. Stark-,”\n\n\n“His title is Doctor actually.” Peter corrected, his voice monotone as some other kid took the opportunity to snap another photo of him right as the bell rang.\n\n\nThe teacher had yelled a thank you or something at Peter but Peter just ignored him as he slung his bag over his shoulder, walking out of the room.\n\n\nNed and M.J. seemed to simultaneously appear and re-stick themselves to his sides as he walked through the halls.\n\n\n“People love you-,” MJ. told him, fiddling with her phone. “Your approval rating is basically 100%, you’re very photogenic.” Peter huffed at that but Ned spoke up over it.\n\n\n“You’re like trending dude! People love your shirt today they think it’s adorable-,” Peter looked down to see what he was wearing which was just some jeans and a T-shirt that said ‘Lettuce the taste of sadness’ Peter sighed. \n\n\nIt was a pretty good shirt. \n\n\n“-and the person who leaked the info seemed to be a fan-,” M.J. started but Peter just shook his head.\n\n\n“I don’t care,” Peter said, and he meant it, even if only a little. \n\n\nThe teachers that, just last week, were telling him off for being lazy and defending Flash’s actions were now sucking up to him with a nervous air about them. \n\n\nPeter was fending off people that never even talked to him- hell, he’d never even seen some of the kid’s that were approaching him.\n\n\nNed and M.J. had flanked Peter to their normal lunch table, sitting on either side of Peter. \n\n\nM.J. turned up her glaring level to def con 5 as she stared down the few people who attempted to sit with them. \n\n\nOf course, everyone had their phones out and Peter was only half distracted by M.J. and Ned trying to feed him.\n\n\n“-begs the question is Mr. Parker going to be the next head of SI?” someone was watching a news report on their phone and Peter let his head rest on the table in front of him.\n\n\nSomeone’s camera shutter went off. \n\n\nRight then the sun was blocked out by the shadow of someone that was standing directly in front of Peter. They nervously cleared their throat, and Peter had half a mind to just ignore them but slowly he relented. Pulling his head back up to see the teacher tasked with supervising their lunch group nervously rubbing his hands together in front of him.\n\n\n“Uh- Mr. Parker- you’re being called down to the office…” he said.\n\n\nIf the principal wants to apologize to Peter or anything, Peter’s leaving.\n\n\nHe’s just walking out of the building and never coming back-, Peter stood up, huffing a little and he smiled at Ned who immediately was reaching to grab his own stuff. \n\n\n“No guys- it’s fine. I’ll be back anyway.” Peter said with a shrug and M.J. looked at him like he was an idiot. \n\n\nWhich means she probably already figured out what was happening and why he was being called to the office. \n\n\nPeter left out the double doors to the empty hallways and almost sighed in relief at there being no eyes.\n\n\nNo eyes on him no low voices whispering about him- at least not immediately around him.\n\n\nHe could still hear the loud voices and chatting of all the people camped out in front of the building, even from here.\n\n\nHe had started walking, dipping around classroom doors and trying not to let anyone see him. \n\n\nIt wasn’t like that routine wasn’t old hat to him by now. He sneaks around the school all the time, whether because of bullies or super-hero duties. He’d like to think he’s pretty good at it.\n\n\nNot letting any teachers in the hall see him, and taking different routes when he saw kids loitering in the halls or heading to the bathroom.\n\n\n\nHe had almost gotten to the office, the doors right in front of him, when a voice called out behind him.\n\n\n“Penis!” Peter froze, turning to see Flash behind him, the boys fists shaking at his sides and eyes intense. \n\n\nPeter knew that look.\n\n\nHe knew that look from five years of dealing with it. \n\n\nHe knew that look since seventh grade when Flash had given it to him in the middle of Algebra when Peter had corrected him.\n\n\nHe didn’t care anymore though.\n\n\nIt didn’t scare him. Flash didn’t scare him like he used to.\n\n\nBetween falling skyscrapers and super-villains Flash just wasn’t an impressive threat anymore.\n\n\nPeter’s eyes narrowed at the other, not knowing where this situation was going-, well, scratch that.\n\n\nHe knew.\n\n\nHe just didn’t want to believe it-, to believe that after everything Flash could be so stupid.\n\n\n“Flash? What are you-,”\n\n\n“You. Me. Right now!” Peter flinched at the idea of that, of beating up some regular kid, but mostly he was just mad.\n\n\nHis apathy bled away slowly into anger. \n\n\nPeter was so mad, really actually pissed because after everything Flash still wanted to fight.\n\n\n He still wanted to hurt people, hurt Peter, even though he’d utterly screwed himself over by doing that.\n\n\n“You’re still doing this?” Peter said, his voice hard and upset. \n\n\nHe was upset. He was upset at and for Flash because he didn’t understand this kid!\n\n\n“Do you know how badly Tony and Pepper what your head on a stick!?” Peter shouted more than asked, “I can’t protect you forever!”\n\n\nFlash flinched back as Peter yelled and Peter’s stomach dropped.\n\n\nFlash clenched his fists, his head hanging low, and Peter felt all the anger flood out of his body suddenly as he saw the tears streaming down Flash’s face.\n\n\nPeter felt nothing.\n\n\nHe didn’t feel bad for Flash, though he thought he probably should-, a hero would.\n\n\nSpider-Man would, probably.\n\n\nSpider-Man’s not here right now though.\n\n\nThis is Peter, and his problems, and he felt nothing for the kid who had given him his first concussion. \n\n\nStole his lunch every day for an entire month, even though Peter saw him eating his own lunch right before it. \n\n\nStole his clothes and phone in gym once and made Peter walk the school naked to call his aunt in the office.\n\n\n“why you!” He said, his voice breaking down to more of a whine, and Peter only stared at him.\n\n\n“Why do you get everything!” He said between hitched breaths and Peter almost wanted to answer him.\n\n\nTell him that he doesn’t beat up kids.\n\n\nHe does his homework and works hard at understanding every theory and concept presented to him.\n\n\nHe gets his job at SI because his reaction to getting superpowers, and being stronger than some people, was to use them for good and help the people around him as best he can.\n\n\nHe kept his job at SI and rose as high as he did because he will work 50 hour weeks and keep his grades up and be Spider-Man and ignore Flash and everyone who hates him while doing it.\n\n\nPeter had almost opened his mouth.\n\n\nAlmost did something he would have kicked himself for later but was stopped as the principal burst out of the office, looking dishevelled and scared, “Mr- what’s- what?” The principal looked from Peter to Flash but before he could say anything Tony walked out from behind him. \n\n\n“There you are Pete, c’mon let’s hit that ice-cream place Happy swears by-,” Tony paused for a second at seeing Flash, he frowned eyes glaring.\n\n\n“What’s going on?” He asked, eyes hard. \n\n\n“He was apologizing,” Peter said, the words coming out as he glanced from Tony’s heated look to Flash’s broken one.\n\n\nTony glared between the two of them before he slowly walked up to Flash, “Hey.” He started eyes hard. “don’t breathe near my kid. Ever.” He said, before turning back around.\n\n\n“What are you even doing here Da-Dr. Stark?” Peter asked, suddenly keen on the excuse to ignore Flash.\n\n\n“I’m here to pick you up Peter,” Peter looked over to the Principle who was still shaking, sweat dripping down his brow and Peter got the impression that Tony did a lot more than just ask to pick up Peter. \n\n\n“I got you a placement for MIT, you need to pick your courses, in the meantime, I want you ‘homeschooled’,” Tony put air quotes up before he was leading Peter down the hall.\n\n\n“Dr. Stark-,” \n\n\nTony sighed, “you know you don’t have to call me that-, I can’t have you here anymore Peter, for more than one reason.” He spared a glance at flash before they were heading towards the back doors of the building. Tony discreetly checking around him to make sure they weren’t being followed.\n\n\n“I don’t know who outed you but Pepper is working on it-, at least PR doesn’t need to do much, the public love you.”\n\n\nPeter blushed and ducked down lower than normal when they got to the car. Tony had pulled up to the back doors, and there was no one visibly around but Peter wasn’t naive enough to think that all the bushes weren’t occupied, by someone or something with a camera.\n\n\nAnd wasn’t that just great! \n\n\nBeing stressed about being alone, because he might not actually ever get to be alone. Who knows if he’ll ever feel like he isn’t being watched ever again!\n\n\nPeter swallows hard as Tony peels away from the school, top down, making all the people at the doors run after the car for a bare fraction of a second when they pass by.\n\n\n“I was looking at the stuff you’d written up in the lab for your little spider buddy, you don’t normally do this much theory before your own projects.” Tony looked at him just over his sunglasses and Peter shrugged.\n\n\n“Uh, you know just having some difficulty with the personality you know- AI but not really…” Tony nodded, “I was thinking you and I could work on that for the next week before MIT, you know ‘homeschooling’,” Tony rolled his eyes a little at the words. \n\n\nPeter felt helpless when Tony mentioned ‘MIT’.\n\n\nPeter felt helpless when Tony and Flash were talking.\n\n\nPeter had been feeling helpless a lot lately.\n\n\n“I think it’s pretty much good- sometimes you like a robot with a little attitude, what are you calling it? You still haven’t told anyone”\n\n\nPeter slumped a little in his seat, shifting awkwardly at that.\n\n\n“Uh-” he croaked out before clearing his throat. “I’m uh- officially?”\n\n\nTony quirked an eyebrow at him and Peter coughed again.\n\n\n“SP//DR”\n\n\n“Spider? That's it?”\n\n\n“No like- S.P. and then two forward slashes, D.R.”\n\n\nTony paused before bellowing out a laugh, and Peter sunk down further into his seat.\n\n\n“That’s great kid! You’re my favourite! Okay! Let’s look over S.P double slash Drrr later okay,”\n\n\nTony brake checks when he parks outside the ice-cream shop making Peter’s heart jump a little even though he knew Tony did this all the time. \n\n\nMay was always right to be unsure of allowing Tony to drive Peter anywhere, but Peter kept it on the down-low.\n\n\nHe hesitated to get out of the car for a second, watching as Tony got out and started walking before his brain fully processed it, so he had to do a little jog to catch up to Tony who was already at the door. \n\n\nThe inside of the shop had warm pinks and tans on basically everything, all the chairs cushioned like marshmallows and an older woman refilling one of the ice cream containers under the display.\n\n\n“Oh, just a minute!” She said sweetly before throwing the empty ice cream container away and walking up to the counter. “What can I get you two?”\n\n\n“The biggest, whatever, you have of the chocolate and vanilla swirl and then a pistachio cone.”\n\n\nThe lady nodded with a smile ringing it up before making it and Peter watched as Tony discreetly put two hundred dollar bills in the tip jar. \n\n\n“You know kid, I’m actually glad that we got here, not to the ice cream shop- I’m not that bad a driver no matter what May says, but to this moment. You’ve been ready to move on from the little leagues for years and I can’t wait until I can actually call you by some fancy title when I introduce you instead of- you know- Here’s my intern.”\n\n\nPeter ached a little at that because he did too. \n\n\nHe was basically one more boring class away from clawing his way out of high school himself. The antsy feeling he had all day. This keen awareness that he was wasting his time in that building when he could be working on something that could help millions of people.\n\n\nHe was there though, every day. \n\n\nStraight A’s and a 4.5 GPA.\n\n\nGetting knocked around by people who didn’t care about him while it was ignored by people who couldn’t care about him. Not with so many other students to pay attention too as well.\n\n\nPeter was handed a really large cone of ice cream and his eyes would have widened if he wasn’t used to Tony baiting him with giant tubs of ice cream by now. \n\n\nTony ushered them back to the car, which didn’t help Peter’s anxiety now that he was trying not to drip on the car that probably was worth more than anything he owned and then some- well, except those nice suits Da-Dr. Stark had forced him to get after he dragged Peter to a board meeting covered in grease and wearing a shirt that said ‘Stand back I’m doing science.’\n\n\nPeter was pretty sure Dr. Stark was going to pass out with how hard he was laughing by the time he had realized. \n\n\nPeter wants to broach the MIT subject.\n\n\nHe does, he really does.\n\n\nHe keeps glancing at Tony but his voice doesn’t seem to be working.\n\n\nSo he works on the ice cream, doing his best not to drip and watching as Tony kind of absentmindedly ate his own.\n\n\nTony’s thoughts were far away from the car. \n\n\nPeter was sitting twisting the paper cover for the cone in his lap, the only thing left.\n\n\nWhen they pull up to SI Peter just follows along to the elevator before Tony was talking rapid-fire. \n\n\n“So kid, I want you to know that- You’re a really good person. Like ridiculously so, and that I trust you and your decision-making skills a lot,” Peter opened his mouth before closing it again abruptly. \n\n\nWould Tony trust him enough to not send him to a college a state over?\n\n\n“I want you to feel like you have a say in all this,” Peter swallowed, opening his mouth again-,\n\n\n“Da-,” when the elevator tinged.\n\n\nTony and Peter stepped out Peter was immediately startled to see Aunt May sitting on the couch in the living room. \n\n\n“Peter! You’re covered in chocolate!” Peter’s hands and face were indeed very sticky and Aunt May gave him a glare as she walked over to the kitchen area to run a paper towel under some water and walk back over to start roughly cleaning his face. \n\n\n“May-,” Peter groaned and Da-Dr. Stark, laughed. \n\n\n“Okay, now that the evidence of our little detour has been destroyed we-,” Tony looked at May who gave him a look back, “Should move to the couch for a little- discussion of sorts.”\n\n\nPeter felt the air in his lungs as he sharply inhales.\n\n\n“A- discussion?”\n\n\n“Sit, just sit!” May said waving him to the couch while she went to throw away the paper towel.\n\n\n“Okay kid, so- I’ve I’ll have you know that this decision wasn’t a new development at all.” Tony began as May sat down too.\n\n\n“Decision?” Peter sighed out.\n\n\nAnother decision, made for him…\n\n\n“So, how would you like- and this wasn’t a spur of the moment decision, I’ve wanted this for you for a while and I know you’ll do great no matter what- to allow me to become your legal guardian and for you to become the heir of the company?” \n\n\nPeter was dizzy.\n\n\nThat wasn’t at all what he’d been expecting, though his brain backtracked to the conversation he had with Rhodey and-, and it still felt like his brain was just rattled around in his head at the words.\n\n\n“What?” He squeaked out because that was what all the tabloids had been asking and Peter had thought it had been a ridiculous concept that Tony would want Peter to- but here they were.\n\n\n“Really- I- I don’t know what to say I-,”\n\n\nBecause that was everything he’d ever dreamed as a kid and he had it and-,\n\n\n“I’m- I can’t,”\n\n\n“I think you broke my nephew.” May said unimpressed, “Couldn’t have cushioned it better huh?” and Tony gave a sheepish smile back to her, and she rolled her eyes.\n\n\n“You’ll start your training in an official capacity once you come back from MIT-,” suddenly Peter’s heart sunk back down, going from elated to tense in a second. “Nothing you haven’t already been doing though- I’m sure the board will start calling you a lot more now that they have an excuse.”\n\n\nPeter grimaced a little at that and Tony patted him on the back solemnly.\n\n\nPeter’s head was racing, this was a lot- so many things- so many emotions and Peter just\n\n\n“I- wait,” He croaked out. He couldn’t just sit there anymore. \n\n\nHe couldn’t just be helpless.\n\n\n“What’s wrong kid?” Tony asked and May gave Peter a concerned, sympathetic look.\n\n\n“I just- I can’t go to MIT.” Peter said and Tony’s eyebrows scrunched.\n\n\n“What do you mean you-,”\n\n\n“I just- Spider-man and Ned! I can’t just leave my only friends here!”\n\n\n“New-York will survive without you for a few years and you can always skype your friends every night”\n\n\n“That’s not the same as seeing them-,”\n\n\n“I can fly you back every weekend you want, you know I-,”\n\n\n“No I-,”\n\n\n“I thought you said you liked flying?”\n\n\n“It’s not just about that!” Peter said finally and Tony quieted down.\n\n\n“I just, I feel like a freak- all the time. With the Spider stuff and- me- being… myself.” Peter sighed. “I just want to be as normal a teenager I can, and not some super-genius college student trying to navigate a campus instead of a- a permit and a car...”\n\n\nMay nodded along with his explanation, and Tony sighed.\n\n\n“Well, I can’t have you in a highschool not after everything that’s happened,” Peter shook his head but Tony continued, “It’s not even about MIT kid, it’s literally a risk factor and you could get a lot more than bullying now that people know your worth something to me. I don’t think my grey hairs could take it if you were kidnapped kid- Spider-Man or no-,”\n\n\n“He could do online high-school or,” May started and Tony snapped his fingers pointing at May as he suddenly got an idea, “I need to call the Dean again.”\n\n\nEpilogue:\n\n\n“How’re your online classes going?” Ned asked as Peter jumped on his bed, SP//DR crawling up the curtains of the window behind him.\n\n\n“Great! My Molecular Biology teacher is skyping me next week to talk about publishing a theory I had and-,”\n\n\n“Most people just say ‘Fine’ and let the conversation die.” M.J. said from a chair across the room, nose firmly in a book. \n\n\nPeter blushed, opening his mouth to respond only for a knock on the door to sound out.\n\n\n“Hey kiddo, you should get your suit, Pepper wants you at the PR meeting and-, well if it isn’t your little groupies, hello Peter’s weedy little friends.” \n\n\n“They’re here to spend the night- I can do the meeting though, they can hang in here-,”\n\n\n“You sure kid? I’m sure Pepper can-,”\n\n\n“Nah, I’ll get my suit on and everything, see you dad,”\n\n\n“Peter Parker in a suit. I gotta see this,” M.J. said dryly.\n\n\n“Parker-Stark,” Tony corrected before turning back to Peter, “If you're sure kid,” Tony did a mock bow and left the room.\n\n\n“Dude, have I ever said how bizarre and awesome your life is!” Ned said, clambering up from his spot in front of their lego Tardis.\n\n\n“Every day,” Peter sighed, “I gotta get dressed I’ll be back in a few hours-,” Ned waved at him dismissively.\n\n\n“Hey, we got the whole weekend.” Peter smiled as he rushed to his wardrobe pulling one of the many black suits out, each shirt, coat tie and pants already paired up together because Tony doesn’t trust him to not totally miss-pair his clothes. \n\n\n“Bye!” Peter rushed out of his room starting the trek down the hall and into the elevator.\n\n\n“Friday where are-,” as the elevator doors opened on another floor, a voice got his attention immediately\n\n\n“Stark Jr!” Maggie said, half-tilt running into the elevator and Peter smiled.\n\n\n“Maggie, what level are you going too?” Peter asked the other, who, with a flourish, handed him a manilla folder. \n\n\n“Another late file,” Peter said blandly as he grabbed the papers from her.\n\n\nMaggie closed her eyes and straightened her spine, pointing one finger up in a mock look of someone about to give some long forgotten, sagely speech “I don’t start my work here until 12:00 due to my college schedule.” she cracked one eye open with a smirk\n\n\nPeter smiled, he loved his family.\n"
}