{
    "id": "21086960",
    "url": "https://archiveofourown.org/works/21086960?view_full_work=true",
    "author": [
        "Haicrescendo"
    ],
    "title": "All The Gentle Creatures",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Avatar: The Last Airbender"
    ],
    "relationships": [
        "Iroh & Zuko (Avatar)"
    ],
    "characters": [
        "Zuko (Avatar)",
        "Iroh (Avatar)",
        "Aang (Avatar)",
        "Katara (Avatar)",
        "Sokka (Avatar)",
        "Toph Beifong"
    ],
    "additional_tags": [
        "unfriendly childhood trauma",
        "Ozai is a terrible father",
        "cute woodland creatures",
        "zuko is a gentle hearted kid who loves animals",
        "but he is also awkward as shit",
        "life changing field trips",
        "zuko’s emotional constipation",
        "childhood anecdotes as nightmare fuel",
        "someone please give this child a hug",
        "Good Lord",
        "there’s lots of bad language my naughty children"
    ],
    "language": "English",
    "series": "",
    "published": "2019-10-19",
    "completed": null,
    "words": "9,991",
    "chapters": "1/1",
    "comments": "636",
    "kudos": "20,640",
    "bookmarks": "5,038",
    "hits": "126,054",
    "summary": "<p>It’s said that you can tell a lot about a person by how they treat animals. Zuko may be loud and stubborn and sharp but all the woodland creatures love him.</p>",
    "notes": "<p>I’m going to be honest here, I haven’t written anything at all in over a year. I’d like to say that it’s because life got busy but that would be a lie. The stressy and depressy got to me and I hadn’t been anywhere near inspired enough to write anything for the longest time.</p>\n<p>And then by the time I got my mojo back, I was so rusty that everything I wrote felt like garbage.</p>\n<p>And then I rediscovered my love for Avatar, and shit got real. Just so y’all know, this is affectionately by its working title, Snow White!Zuko.</p>\n<p>Also, THANK YOU TO WINTERKILL FOR BEING AMAZING AND GASSING ME UP. I would not have finished this if it wasn’t for you. ILU BITCH.</p>",
    "text": "Zuko is not okay.\n \nHe’s given up on even trying. He submits to the medic’s flustering over changing his bandages twice a day and applying a healing salve to try and save his eye. He does as Uncle bids and  takes it easy , whatever that means. Being boring is what taking it easy means and Zuko doesn’t even care. He sleeps. Well, kind of. He lays in bed on his back and stares at the ceiling until tears start slipping from his good eye and then he has to find a dark place on the ship to hide for a few hours until he can breathe again or the sun comes up, whichever comes first.\n \nAnd he meditates.\n \nHe meditates  badly. \n \nHe’s the—- used to be, the prince of the Fire Nation, he grew up meditating with a candle even before he ever bent flame. There’s absolutely no reason for the flickering flames to make his heart race and stutter, and then he can’t tell whether he’s actually feeling pain on the side of his face or he’s just remembering.\n \nDao’s salves are borderline legendary but they only do so much.\n \nAzula would laugh herself sick if she knew that Zuko had managed the impossible: a firebender afraid of flames.\n \nHe sets his jaw and glares at the row of candles in front of him.\n \nThe ship is metal and full of firebenders— if anything happened, someone would be able to take care of it, he knows.  Uncle  would take care of it. But anyone knowing about this makes him want to throw himself over the side of the Wani, and Zuko’s horribly grateful that he’s still too injured to be cleared for practice. How’s he ever going to be able to bend again if he’s going to be a scared little baby?\n \nHow’s he going to capture the Avatar if he doesn’t have the one thing he’s kind of got going for him?\n \nHow’s he gonna be able to get Father to forgive him if seeing the flickering candlelight match his breath is enough to make him freeze up like a kangaroo-deer in the light of a lantern? \n \nZuko can’t see a way out of this.\n \nHe can barely fucking see.\n \nHe jumps when he feels something nudge his hand, and Zuko cracks open his good eye to see Suzu, the ship’s newly procured rat-catching pygmy-puma, staring at him. He shakes his head at her.\n \n“Go away,” he grumbles. She’s had kittens recently and none of them have been able to find where she’s stowed them. The crew’s already been taking bets on who’s going to see the first one.\n \nShe meows at him.\n \n“Go away!” This time Zuko shouts and the candle’s flames shoot upwards and without warning, his body tenses and he flinches, hard, and snuffs the flames with a cut of his hand. Suzu runs with a high pitched meow, frightened and fluffed up, and Zuko slumps over to press his forehead into the metal floor. “Damnit. Damnit!”\n \nThere are only two on this ship who even kind of like him, and Zuko’s just run off half of them.\n \nHe’s mad, then, furious, and then all the rage drains out to leave him feeling empty and cold and shivering on the floor of his quarters.\n \nHe can’t breathe.\n \nZuko doesn’t know how long he stays there shaking.\n \nThere’s a knock on his door and Zuko groans.\n \n“ What ?” He means to snap but it comes out weakly, and Uncle pokes his head in. There’re wrinkles in his forehead and he doesn’t look happy, standing there and watching him. Zuko’s stomach twists.\n \nHe could be home right now, if it wasn’t for him.\n \nIt wasn’t bad enough that Zuko had to ruin his own life, he had to take Uncle down with him.\n \n“Are you alright, Prince Zuko?”\n \nUncle knows damn well that he’s not alright, and steps through the threshold and approaches. He kneels down next to Zuko and squeezes his shoulder, and Zuko’s so  tired  that he can’t even fight it. He shuts his eye,  hard, and curls in on himself.\n \n“Oh, nephew.” Uncle’s voice is so damn sad. “What happened?”\n \n“I scared Suzu,” Zuko whispers into the floor and wishes he could sink into it, through the ship, and all the way down to the bottom of the sea. “I was trying to meditate and I can’t do it, and then I yelled at her and she  ran away .” To his shame, he can feel telltale heat building up behind his eyes and he clenches them tighter. “She hates me.”\n \nUncle Iroh holds his shoulders in his hands and works Zuko up off of the floor until he’s sitting up against the side of his bed. \n \n“Tell me what the problem is.”\n \nWhere isn’t the problem? Zuko’s entire existence is a fucking problem.\n \nThe words are there but they won’t come out. Uncle sits in front of him on his haunches as if he can sense them, and waits patiently. How long is he gonna wait?\n \n“...I don’t think I can bend anymore.” \n \nEventually he chokes the words out and they sound even stupider coming out of his mouth than they did in his head. Uncle tilts his head.\n \n“Why would you think that?” He asks. Zuko turns his face away and thinks the shame is going to eat him alive.\n \n“I’m afraid.” He whispers. “Fire used to feel…” Not safe, because no flame is a safe one. But it used to feel comfortable and now all he can feel is pain. “Good.” Fire used to feel good, and now it doesn’t. It used to feel like a part of him and now it doesn’t. \n \nZuko is the worst.\n \nUncle’s face falls and Zuko feels even worse. He’s disappointed him. It’s not a surprise, he thinks. He’s always been kind of a disappointment.\n \n“Oh,  Zuko ,” he breathes, and that’s not disappointment in his voice but definitely pain. “Of course you would feel that way.”\n \nAzula wouldn’t.\n \nUncle looks at the candles, frowns, and turns away from them.\n \n“Those won’t do you much good until you feel more confident in your breath,” he says, which is a way nicer way to say ‘til you quit being a scaredy cat baby’ than Zuko would have. “I have a better idea.” Uncle settles himself more comfortably on the floor and spreads his hands in front of him. A tiny flame blooms in the middle of them.\n \nZuko goes very still.\n \n“Perhaps you will feel safer if you meditate on my fire. We’ll do it together. This is  my  fire” Uncle gives an exaggerated breath and the fire in his hands grows, then shrinks on his next inhale, “And I will  not  use it to hurt you.” And Zuko believes him.\n \nHe should feel embarrassed at the way Uncle  Iroh leans back and makes a show of closing his eyes, his hands loose and relaxed in front of him. Zuko watches his flame grow and shrink, grow and shrink, and matches his breath until they’re breathing in sync and he feels less like he’s going to crawl out of his skin. It’s never out of Uncle’s control and eventually Zuko allows his eye to close, trusting that he wouldn’t allow it to get away from him.\n \nHe startles when there’s a nudge at his hand, and Zuko peeks his eye open to see Suzu standing near him. Her green eyes are so big but she doesn’t look scared. Uncle’s eyes are still stubbornly shut but there’s a tiny smile tilting his lips up. Zuko reaches out and rubs behind her ears. \n \n“I’m sorry I yelled at you,” he mumbles to her, “I didn’t mean it.”\n \nShe chirps at him and then flounces out of the room, and Zuko gets back to his business of trying not to be terrified out of his mind...and then there’s something bigger and more solid than a little wet nose in his palm.\n \nZuko looks down just in time to see Suzu plop down something tiny and furry and spotted into his hand. Her kitten is so, so little but it’s eyes are open and blue like babies’ always are, and its tiny paws make little biscuits in his palm. Zuko gives up on meditating entirely and Uncle quits pretending he’s not paying attention, because that’s about the cutest thing that either of them have ever seen.\n \n“....I think you win the pot, Prince Zuko.”\n \nZuko has no idea how much is in the pot but he’s sure it doesn’t compare to what he feels right now. His heart twists and he knows that even if the Avatar suddenly appeared in front of him right this minute, he wouldn’t be able to move out of this very spot.\n \nSuzu looks pleased with herself and nudges his leg with her foot. She leaves again and returns with another kitten, a little black one this time to go with the calico, and that one too she brings to him. She does it one more time and then puts herself full in Zuko’s lap.\n \nZuko stares down the little pile of cats in his lap and tries to remember how to breathe.\n \n“Why did she bring them to me?” He asks eventually. \n \n“Animals can sense a good heart,” Uncle tells him firmly, “and yours is very kind and very gentle. Suzu knows that her kittens will be safe with you.”\n \n“I don’t  want  a kind heart,” he mumbles contrarily, “I  want  to go home.” He doesn’t mean for the words to ring so true but they do, and both Uncle’s silence and the red that starts to rim his eyes is telling. “Uncle, I want to  go home .”\n \nZuko doesn’t remember the last time he was held (or the last time that somebody wanted to hold him) but suddenly Uncle Iroh’s very, very close and wrapping his arms around him and pulling him to his chest. He’s careful not to smush any of Zuko’s company and it should feel caging but Zuko feels safe for the first time in what feels like forever, really safe, and if he cries, no one’s going to say anything.\n \n \n \nAang wouldn’t have known if not for the blueberries, and if not for the blueberries, he wouldn’t have kept watching.\n \nThe bulk of Appa’s diet needs to be grass and leaves and roughage, like hay, for him to stay healthy, but fresh produce is a welcome treat that both a bison and his boy can enjoy, despite how Sokka complains that too many vegetables would sap away his manliness like a rainstorm to a fire. Nevertheless, Aang tries to keep something fresh on hand for snacks and trying times, and he still laughs a little to himself at the momentary pause in Katara’s face when he offers her a slice of apple, because  she  still hasn’t gotten used to having accessible fresh food that hasn’t been preserved for months beforehand in salt and oil.\n \nThings have been weird since Zuko decided to teach him firebending. Of course it’s a little hard to trust him after all they’ve been through, but Aang wants to be able to rely on him and thinks that he can. Zuko’s a lot of things but he’s kind of a bad liar, whether that’s when he’s trying to lie about being a good guy or lying about being a bad one. Aang doesn’t need Toph’s lie detecting to know that Zuko is here wholeheartedly and not just because he doesn’t have another choice. They haven’t talked about it, because Zuko can also be relied upon to be testy and prickly at the best of times and Aang doesn’t want to push his luck  that  much, but they know enough to know that Zuko had the opportunity to have everything he always said he wanted fall into his lap, and he said no.\n \nYou don’t throw everything away for nothing, and maybe Katara’s right and Aang’s trust is misplaced, but he thinks that Zuko’s here for the long haul.\n \nBut, anyway. \n \nBlueberries.\n \nIt’s just after breakfast that Aang approaches Appa with a handful of blueberries, and Appa snuffles at his hand with gusto...and then turns away as if disappointed.\n \n“What the…?” Aang mumbles and stares at his bison. “What’s wrong, buddy? Are you sick?” \n \nHe doesn’t look sick; his color’s fine and his eyes are bright and his tongue is its normal pink, but Appa’s never turned down a snack in his life. Aang eyes him with concern and offers the blueberries again. This time they get eaten but slowly, like Appa’s doing him a favor. \n \nAnd Aang forgets about it for a few hours, until he’s done with earthbending with Toph and drags his aching bones back to camp…\n \nAnd then stops.\n \nZuko’s sitting near Appa. That’s not unusual, Aang realizes, he does that a lot actually, but then Appa turns his head and nudges the span of Zuko’s broad shoulders insistently, like a demand. Aang’s first instinct is to reveal himself and stop whatever irritated reaction might come from Zuko because he doesn’t like being messed with, and then he squashes that instinct down because Zuko’s entire face just  softens  like Aang’s never seen it before. He didn’t even think that Zuko could even make a face like that. Even the side with the scar looks less angry, and it doesn’t look out of place that Zuko reaches out and gives Appa a scratch on the head, telling him to  just wait a minute, hold on, be patient . \n \nAs if Zuko’s ever been patient before in his life.\n \nBut that’s not really true either, Aang amends. He’s not as easygoing of a teacher as Katara but he’s more patient than he could be in the wake of teaching firebending. Aang can’t help it, there’s still something really scary about fire that he hasn’t managed to shake and he’s sure that Zuko knows it. He’s not an easy teacher, but he tries to be a fair one.\n \nZuko gets to his feet and goes to his bag, set away from the rest of their stuff like it’s a metaphor for his tenuous place in their group, and rummages through it. Appa gets even more excited and even stomps his feet a little when the banished prince pulls out a bright, fresh orange, slips a knife out of nowhere and cuts it into sections as he walks back to the bison. He nibbles on a segment himself and offers another to Appa, who takes it with  way  more than enthusiasm than he did with Aang’s blueberries.\n \nAang nearly gives himself away with an unintentional snort of laughter that could ruin everything. It’s a relief to know that Appa’s not sick, just spoiled. Nobody on the planet would ever believe who’s doing the spoiling, though, and Aang plans on keeping that to himself as best he can for as long as he can. There’s little enough peace in the world as a whole and you’d have to be stupid not to know just how little real pleasure there is in Zuko’s life. \n \nAang will let him keep it.\n \n—-\n \nAfter that, though, he finds himself watching more. It never seemed off that Zuko would keep himself away from everyone else, seemed normal for the circumstances, but the more Aang watches the more he realizes that Zuko isn’t the only one doing it. He doesn’t try overly hard to insert himself into their interactions but it’s not like they ever really invite him in, either.\n \nKatara’s outright hostile, despite the undeniable difference in the Zuko they have now and the one they thought they knew before, Sokka’s indifferent except for when it comes to who’s in charge of making dinner that night, and Toph...well, Toph’s the exception to everyone else.\n \nToph’s the only one who didn’t really have a bad experience with Zuko before getting to know him, and it shows in all her interactions with him. She bosses him mercilessly and Zuko just...takes it? He grumbles and mutters unflattering things under his breath but whatever she bids him, he does, and now that he thinks about it Aang realizes that he  has  seen that very soft expression before, just to a lesser extent, because it shows up when Zuko looks at Toph sometimes too.\n \nAnd then he remembers that Zuko’s got a little sister. A crazy little sister, but that doesn’t change that he’s a big brother just like Sokka, and maybe he kind of likes being bossed around without the threat of murder behind it.\n \nOr maybe Zuko’s just given up entirely, Aang’s not totally sure.\n \nIt’s not like he doesn’t pull his weight, either. He does his share of the cooking (maybe more than his share, because no one wants to rely on Sokka or Toph for food at the risk of dying)  and cleaning, he packs his own things neatly, he trains Aang in firebending and he never, ever loses control of his flames the way he did that one disastrous time that ended in Toph’s burnt feet. He brushes Appa even though even Aang doesn’t even like doing a full brush because the fur blowback is  unreal , and just generally makes himself pretty easy to forget about.\n \nBeing willing to brush Appa should have been a dang hint?\n \nBut Aang can’t forget about him now. He didn’t even want to in the first place! It just kind of...happened? It was easy, he eventually admits to himself as he chews on a bite of vegetable stew, because in truth, Aang had never really thought that Zuko was that bad of a guy. Not a  nice  guy and definitely a dangerous one, but he couldn’t be put to the same level as Zhao had been, or Azula, or...or lots of people. So it had been easy to let him in when they’d needed something from him, because they needed him and he was there and convenient and was willing to be forgettable?\n \nIt’s an uncomfortable thought and Aang is not cool with it, and he tells himself that he’s going to stop forgetting about Zuko because he goes out of his way to make it easy to do. It’s not fair and it’s not right, and when it comes down to it, Aang actually  likes  him. \n \nSo he’s going to watch out for him— not for him to turn around and do something diabolical like Katara swears he’s gonna, but watch out for him in general, and maybe if Aang does better at this whole Avatar thing, they can maybe be  real  friends the way he wants to be.\n \n—-\n \nIt takes Aang a decent amount of time to fall into a deep sleep— it comes with the whole airbending, being able to feel every dang breeze thing, so before that happens, everything wakes him up. He’s been sleeping really well lately but that evening, he jerks awake with a start because  there’s a noise . A shuffling sound and a muffled swear like somebody kicked a rock, and Aang tries to figure out without waking up too much what’s going on. Katara’s out, Toph sleeps like a dead man, and Sokka’s right next to Aang, passed out. So it’s gotta be Zuko.\n \nTrying not to move too much, Aang tries his best to do a sleeping flop over to his other side, cracking an eye open just enough to see into the night. \n \nThe fire’s burnt down to embers, but Aang knows it can be started back up or extinguished entirely if need be, and that little bit of light lets him see Zuko stagger in from wherever he’s been sleeping (not with the rest of them, who sleep close to each other for warmth and camaraderie and safety, never ever too close to them). He looks  awful  in a way he never looks during the daytime. Exhausted and worn out and...sad. He looks really upset, and Aang almost sits up and tries to comfort him, but stops at the last second.\n \nNot just because he’s curious, but because he’s sure that it might make Zuko sadder.\n \nSo he stays still and watches the firebender walk past them to where Appa sleeps, looking almost like a boulder himself and snoring in the evening quiet.\n \n“Hi, Appa,” Zuko whisper mumbles and doesn’t so much sit down as he drops to the ground and leans back, almost disappearing into Appa’s white fur and curling up to make himself look smaller. He does that sometimes too, especially at night before they all start turning in for bed. “It’s okay, it’s fine,” he says when Appa twitches and peeks an eye open and starts to make a rumble at him, “I’m okay. I’m okay.”\n \nZuko is not okay.\n \nIt takes him  forever  to fall asleep and Aang knows this because he can’t even think of passing out at least until Zuko does, but when he wakes it’s just before sunrise and he’s the first one up. Firebenders rise with the sun, he remembers, but sometimes Zuko’s been up before then, too.\n \nSometimes, it’s like he never went to bed in the first place.\n \nAang has every intention of going back to sleep and getting the last bits he can before a sunrise meditation, but before he does, he can’t help taking a long, full look at the scene he pretended not to see last night.\n \nZuko’s there still, fully curled into Appa’s side, but even when he sleeps he looks ready to defend himself. Appa doesn’t look worried about it, though, and Aang wonders how many times it’s happened before, how many times they all slept through it. He looks at the dark smudge of sleep deprivation under Zuko’s good eye, and the way he doesn’t sprawl like a prince should but holds himself tense and small and wary. \n \nDoes he always do that, or is it a new thing? \n \nDid he always do that, or did somebody do it to him?\n \nAang wants to know and doesn’t, because you can’t take something like that back once it’s out in the universe. \n \nAppa’s asleep and Aang doesn’t want to wake him, but he can’t resist a whispered, “Thanks, buddy,” in his direction. \n \nAang can’t help paying attention, now, and he’s determined to do better. He’s going to do better, for everybody’s sake.\n \n \n \nKatara’s just waiting for Zuko to fuck up.\n \nShe doesn’t trust him as far as she can throw him, and she never will because she trusted him before and look at where that got her? Second chances can pay off sometimes but third chances are for people who don’t mind freezing to death, and Katara’s come too far for that.\n \nShe’s been outvoted, though, and Aang  does  need a teacher. Katara would have chosen anyone else. Literally anyone else short of his crazy sister or the Fire Lord himself, but Zuko comes third in that ranking. All she sees when she looks at him is the embodiment of the Fire Nation all nicely wrapped up in one scarred up, grouchy asshole of a firebender; they took Aang’s people away, they took people’s freedom away, they took  Mom  away, and she'll never ever forgive him for that.\n \nAt least he knows well enough to keep far away from her. He’s not that stupid; if he sets one foot out of line or puts her or her family in danger, they both know who’s going to come for him.\n \nShe can’t for the life of her figure out why Aang actually seems to like him. Toph’s one thing, she was never around for his Avatar hunting phase but of all people, Aang should know better. It’s like he’s forgotten how long and how far they ran from Zuko, like he’s forgotten how scared Katara has been for him and his safety.\n \nIf he dies, that’s it. No more airbenders, ever, and no more Aang.\n \nShe doesn’t know how it happened and she hates it.\n \nAt least the pampered prince has some life skills, she has to admit. He cooks well enough and he hasn’t tried to poison them yet (not that Katara hasn’t been checking, because she  has  ) and he doesn’t complain about doing the dishes after or make snide comments about how it’s women’s work. In fact, the first time in a while that Sokka has said something smart mouthed about it, Zuko boggled at him and mumbled something under his breath about  marines  and  set him on fire  before walking away as if to not catch sexism. That was the single, solitary thing that worked in his favor, and the only thing after his firebending and willingness to teach Aang  that kept her from pushing him off the edge of the Air Temple late at night.\n \nHe’s started sleeping closer lately, though, and Katara’s not sure how she feels about it.\n \nHe’d started in a room several levels down but recently migrated to one somewhat closer on the same floor as the rest of them. Not that she’s ever seen him sleep, ever.\n \nShe’d have to care about him to try and do that.\n \nKatara’s not sure either what he does with his time when he’s not training Aang. Aang’s got the attention span of a goldfish-pus, and Katara learned right away when she was training him in water that the hours and hours and hours she wanted to put in each day were just not going to happen. No way is Zuko going to get more than three out of him at a stretch and they start at sunrise, so she’s got no idea where he goes the rest of the time. She probably should, if she wants to make sure he’s not going to turn around  again  and screw them over.\n \n Again .\n \nIf he does, it’ll be the very last time.\n \n“Hey Katara, where’s Sparky?” Toph asks and pokes at Katara with an insistent bump of rock under her feet.\n \n“Don’t know, don’t care,” is all Katara can tell her. If she wants him, she can track him down herself. Though why she’d want to is a complete mystery, especially after Zuko burned her feet. She’d nearly killed him then, except that a friend had been in need of healing and she’d needed to focus on Toph and not murder. \n \n“He’s been gone a while,”\n \n“Maybe he got lost,” Katara replies, purposefully sweet and cheery, “Maybe he’ll stay lost.”\n \nToph shakes her head but doesn’t reply, instead looking toward the horizon with a blind, blank stare like she knows  exactly  where Zuko is and she’s not telling. Well, joke’s on her because Katara never asked and she doesn’t want to know.\n \nShe sort of really hopes that he never comes back.\n \nKatara’s not that lucky, though, because Zuko  does  come back.\n \nHe also comes back covered in blood, scar starker than usual against an unnaturally pale, ghost white face, and a lump in his shirt that he cradles in both of his hands.\n \n“What in the—“ Katara starts and Zuko ignores Sokka’s indignant squawk, marching right up to her with a look of determination on his face. He’d better, not for a  second , even dream of asking her to heal him. He’d better not. Whatever he got into was his own business and he can get himself out.\n \nHer face twists in a frown, but Zuko keeps coming. When he reaches her, though, he reaches into his shirt and thrusts both hands out at her.\n \nKatara freezes.\n \n“Please,” he rasps, voice little more than a low whisper, “I need your help.”\n \nWhat he holds out to her at first only looks like a lump of fur and feathers held together with blood but as she looks, Katara realizes that it’s a baby hawk-weasel, eyes closed in what’s undoubtedly pain, breathing hard and heavy. \n \nNot unlike the banished prince of the Fire Nation.\n \n“I know you hate me, and that’s fine, you can keep hating me. It’s fine,” he keeps going, “But I know you have a heart. Please don’t let it die.”\n \nZuko looks like he’s about to start  crying . \n \nKatara’s dreamed about what that might look like and she’s disappointed in how little satisfaction she feels from it. She’s grateful that Aang’s in the middle of earthbending practice right now; he doesn’t need to see this.\n \n“Why should I?” She asks just to twist the knife, just to see what he does. The animal held between two shaking hands gives a weak little shiver and a wheeze. Katara can’t imagine that it’ll make it, no matter what she does. It might be kinder just to make it quick.\n \n“Because it didn’t do anything,” Zuko whispers, finally. “All it tried to do was exist.” He sways a bit on his feet, probably from blood loss. “If you can’t, that’s fine. I know it— I know it might be hopeless.”\n \nZuko looks fucking hopeless right now, and Katara makes up her mind.\n \n“Sit down before you fall down and let me see,” she snaps and takes the hawk-weasel from him, bending water out of her pouch and using it to examine her unexpected patient. Its energy channels are ripped to shreds and Katara’s not sure how much she can do, but she repairs as much as she can. She’s only been trained to work on humans but she’s surprised to find that they’re not that different; chi follows the same basic paths regardless of species, and she does the best she can.\n \nKatara’s not sure how long it takes but she’s vaguely aware of Zuko sitting very, very close, his breathing heavy and ragged, watching her...warily? Hopefully?\n \nIt doesn’t matter. \n \nKatara doesn’t dare go too deep while she works but she feels him move further away, running up his pant leg and using some of the water from a bucket to rinse some of the blood off of his skin to reveal a deep, nasty cut that already looks furious in the meat of his thigh. He’s been bleeding from it for a while.\n \nMaybe he’ll pass out.\n \nZuko does not pass out but he does try and make himself look halfway presentable before coming back to her, just in time for Katara to sigh and wipe at her face, suddenly worn out and not just from the healing process.\n \n“Were you able to help?” He asks very, very quietly, and Katara sighs and gestures for him to hold out his hands.\n \n“See for yourself,” she says, and sets the hawk-weasel into his waiting palms. Katara’s always heard that animals can tell bad people from good ones, but that can’t be quite right because the tiny creature only sighs tiredly and nibbles on his thumb, way too softly to do any damage.\n \nAnd Zuko’s face goes absolutely slack with relief. He brings his hands up to his chest to tuck the animal into the juncture of his neck and shoulder, more gently than Katara’s ever seen him do anything. She didn’t even know that he knew how.\n \n“It’ll need a lot of food and rest before it’s ready to go free and it still might not make it. So don’t be surprised.” Katara needs a nap before she deals with anyone else’s nonsense today. She doesn’t even have room in her right now for animosity.\n \nIt’s also just starting to dawn on her that she  did this . No one had ever walked her through something like this and she did it without help, all by herself! If Katara hadn’t been so exhausted, she might have cheered about it. As it is, she just rubs her temples and slumps a little where she sits.\n \n“ Thank you .” \n \nKatara’s never heard Zuko talk to anyone like that and when she looks to him, the naked relief and gratitude on his face are so sincere that they make her stomach twist in discomfort.\n \n“Anyone would,” she huffs eventually. She can’t handle his sincerity, not when everything inside her demands he be the villain. Nevertheless, it doesn’t stop her from flopping onto her bedroll to take a power nap ( anyone  wakes her up for any reason and they might have to die) and when she wakes up, it’s nearly sundown.\n \nHer friends have let her sleep longer than she thought they would, and someone else cooked dinner. When Katara comes to the fire, Zuko still sits as far away from her as he can get while still being socially acceptable, but his hands are full, and the hawk-weasel looks way more alive and perky than she expected it to. Aang of course thinks it’s precious, and even Sokka can’t resist feeding it tiny scraps of salted meat, even if that means he has to get closer to Zuko to do it.\n \nThe prince in question doesn’t make a scene about what she did, nor does he even bring it up, but his eyes look softer than she’s ever seen them. When the hawk-weasel tries to scamper up to his shoulder to tug at a lock of dark hair, he almost laughs as he brings it back down to his lap. It yawns hugely and curls up in the palms of his hands, and Zuko looks like he can’t even dream of moving to disturb it. He just sits there very, very still, eventually moving one hand to stroke soft, easy lines over the little animal’s back.\n \nWhen he looks like that, Katara can almost forget who he is.\n \n-\n \nLater, when Katara’s had long enough to think about it, she pulls him aside and takes care of the cut on his thigh.\n \nIt’s not because she likes or cares about him. It’s not as if she cares if that’s what kills him in the end. Aang needs a firebending teacher, and Zuko can’t do that if he’s dead or crippled.\n \nShe can’t resist telling him this, and Zuko nods. Of all of them, he knows. It’s not like it’s the first time he’s heard it. It’s not as if she’s even the first person to say it.\n \nBut he sure as hell won’t know that Katara remembers how gentle and quiet his hands can be when he has something to take care of, and that Aang’s needs aren’t the only reason she does it.\n \n \n \nIt’s not fair, Sokka thinks, that Zuko got hit with the talent stick from both ends. It shouldn’t be allowed that he can bend  and  use swords. Sokka’s worked his butt off to get where he is and sometimes the inferiority complex is smothering and heavy but luckily, Zuko makes himself an easy target.\n \nIt’s not like Sokka wants to kill him (that’s Katara’s gig and he’ll let her keep it) but it’s so damn easy to roast Zuko that it hurts. It’s so easy it’s like he leaves the opportunities out on purpose just to give Sokka a chance to get some hits in, and it might be insulting but he’s not gonna turn it down. It’d be more insulting if Sokka didn’t take the chances to make fun of him, as obvious as they are, even if Aang pouts at him and even Toph, every so often, implies he needs to chill.\n \nWhatever, Sokka thinks. Zuko’s a big boy, he can take it. This is what he gets for being a dick for so long.\n \nSokka has no chill.\n \n What does have chill, however, is the Western Air Temple at night. So much chill.  Freaky  amounts of chill, considering how close they’re not to the poles, but Aang just said something wishy-washy and Air Nomad-y about how it’s because of the height and low air pressure and how’s basically like being on top of a mountain even though they’re not  on top of a mountain. Well, Sokka doesn’t know shit about mountains but it seemed like it made sense to Toph because she nodded about it, but it doesn’t change the fact that it gets ridiculously cold at night.\n \nNot nighttime-in-the-desert bad, but still not great. \n \nIt’s one thing when you live in the South Pole and expect your existence to be a cold one and quite another to look down and see  green  and  forests  and there you are, freezing your ass off. It’s not fair. It should at least be snowing, like things are supposed to when it’s cold.\n \nEvery bit of it sucks.\n \nJust for good measure, Sokka gives Aang a misdirected scowl. Just because airbenders can regulate their body temperature to adjust to high altitudes doesn’t mean that the rest of them have it easy. At least he and Katara are used to being cold.\n \nPoor Toph ends up latching onto to just about anyone in reach and if she touches Sokka with those cold-ass feet  one more time , he doesn’t know what he’s gonna do. Nothin’ nice, that’s for sure.\n \nNo matter how many times Sokka says it, though, Toph keeps poking her dirty, frigid toes against his leg and Sokka keeps doing nothing about it.\n \nIt’s a normal night, as far as things go.\n \nThere’s Aang giving gross goo-goo eyes to his sister, there’s his sister giving the complete and total opposite of goo-goo eyes to Zuko, there’s Zuko trying really hard to not look at anybody, and then there’s Toph. Toph, who’s too far away from Sokka to touch him with her feet but in perfect range to touch Zuko with them instead.\n \nShe full on sticks her whole foot up his pant leg to touch his calf, and what happens next is simultaneous.\n \nZuko shivers and yelps on instinct and Toph goes so still that Sokka thinks she might have died by proxy.\n \n“ Holy shit ,” are the first words out of her mouth, and Katara doesn’t even have time to say something sassy about profanity before Toph is leaning closer to press herself up against the firebender entirely like she’ll never be warm again and he’s the most expensive space heater ever created, “You’re so warm!” She cuddles right the fuck up to him, shoving herself under his arm so he’s got no choice but to drape around her shoulders.\n \nIt’s the most hilarious and awkward thing that Sokka’s ever seen, and he’s spent the last few months watching the bridge to the spirit world moon over his baby sister.\n \nZuko’s an uncomfortable, horrified statue for a good thirty seconds before he looks down at Toph stubbornly nestled up against him and the lines around in his forehead get a little less tense, and without saying a word he takes in a big breath and then exhales with calm, steady control— Sokka flinches on instinct but then realizes that no flames come out of him. Instead all he breathes out is warm, dry heat that fills their little section of temple and chases out the chill.\n \nSokka...did not know that firebenders could do that. Most firebending he’s seen has been sharp and aggressive and strong— he’s never seen it used gently or usefully outside of starting the campfire every night.\n \n“I’m keeping this,” Toph says to the lot of them. She doesn’t give Zuko any sort of choice in the matter and he looks like he’s already accepted being a ‘this’. That’s fine. Everything is fine except that they’re clearly on some other planet where tiny earthbenders call dibs on grouchy princes. \n \n“That’s so cool!” Aang chimes in, even though he can regulate his temperature better than any of them and has  no room to talk , “Can you teach me to do that, Sifu Hotman?”\n \nAll of Sokka’s roasting and he’s never gotten that glorious, glorious face that means that Zuko is praying for his own death.\n \nAang is  diabolical. \n \nNevertheless, he mumbles a cranky  maybe when you get your basics down  which isn’t necessarily a yes but also isn’t a no and somehow still manages to imply  never , but it's enough to get Aang off the subject and back to eating, so Sokka sees is as a win. Toph sticks to him like glue, probably because she’s naturally attracted to anything others find irritating and touching Zuko is a huge, massive no-no.\n \nExcept that he doesn’t really look mad about it.\n \nAwkward, yeah, because he’s about the most awkward dude Sokka’s ever met in his life, but he doesn’t really look mad. Resigned, maybe? Accepting of his fate? That doesn’t seem right. Zuko’s a lot of things, but he’s not great at accepting much of anything.\n \nIf Sokka was going to put an actual name to the look on the guy’s face, he’d have to say he kind of looks...happy? Maybe? As happy as somebody like him can get? Sokka doesn’t know what happy looks like on Zuko; he’s never seen it. He doesn’t seem to have a problem with Toph getting up close and personal with him (maybe because he knows she can’t actually see his awkward face?) and he doesn’t seem to mind the touch, either.\n \nToph bumps him roughly and Sokka knows she didn’t get him hard enough to warrant the swing to the side his body makes, and on his return he bumps her back but so softly that Toph’s hair doesn’t even move. Katara looks like she wants to throw up or swallow her own tongue but Toph grins toothily at him like he’s just told her an excellent joke.\n \nThat’s a dangerous face.\n \nThat’s the moment that Sokka knows, for real, that they’re not getting rid of Zuko.\n \n-\n \nSokka didn’t even know that Zuko owned a jacket but there he is. Looking like a kind of normal human being? In a jacket.\n \nA firebender wearing a jacket.\n \nExistence is weird as shit.\n \nHe’s even got the hood up like he doesn’t know how to keep himself and everybody else warm even with the chilly breeze that whips through the temple at night. Like everything else it’s color coded for convenience, deep crimson with a russet colored ruff around the edge of the hood and...a tail?\n \nSokka knows the Fire Nation is weird but he’s pretty sure that even they don’t do that.\n \nIt’s kind of a familiar tail, though.\n \nSokka narrows his eyes and looks closer and he realizes that it should be a familiar tail because it’s attached to an odd lump going around the back of Zuko’s head, and there’s something really, really weird about seeing someone like Zuko (in a jacket!!) with the tail of a lemur poking out of his hood to curl over his forehead like he’s decided to do something new with his hair.\n \n“Hey, uh...you know you’ve got something on your head, right?”\n \nZuko glares at him like he thinks he’s dumb as shit.\n \nWith jerky hands he pushes the side of his hood away from his neck to reveal Momo’s sleeping face, perfectly happy to be cuddling up with the prince of the Jerk Nation. \n \n“He was  cold .” Gold eyes narrow defensively and Zuko draws himself up like he’s waiting for Sokka to throw a punch or just start laughing. Sokka doesn’t laugh at him, though, because even though it looks like Zuko’s itching for a fight his fingers end up tucked into his collar to scratch Momo under the chin. The lemur doesn’t even bother opening his eyes.\n \nSokka puts his hands up and shrugs.\n \nHe knows when he’s beat.\n \n“Hey, man, calm down,” he says flippantly, “Nothin’ to get all huffy about.”\n \nBecause it feels like a shock that Zuko knows how to be kind but...maybe it shouldn’t be.\n \n \n \nWhat nobody seems to get about Sparky is that he’s scared out of his mind, like, all the time.\n \nLiterally all the time, because Toph can read heartbeats and Zuko’s baseline is several tics higher than everyone else at their most freaked out, and at the slightest hitch he starts doing this breathing thing like that’s the only thing keeping him from flying completely off the handle, and Zuko does that  all the time .\n \nIt’s not a firebender thing, Toph knows, because Uncle’s heart didn’t do that. Uncle’s heart stayed calm and steady and resolute like normal people’s should when they’re relatively calm. But Zuko’s thrums rabbit-mouse quick at its normal.\n \nToph understands that seeing folk are blind in their own ways, and maybe it’s because they can see with their eyes that they can’t see that Zuko, as strong and apparently terrifying (???) as he is, is on the verge of a nervous breakdown at any given point in time.\n \nHow can she be afraid of him when she knows that?\n \nSparky’s not scary, he’s  scared , and Toph’s an asshole but she’s not a fucking predator.\n \nShe doubles up on bullying Sokka because it’s good for him and she doubles up on bullying Zuko too but  with love , because the goal is not to just keep him alive so Aang can learn firebending. Nah, man, that’s Katara’s goal.\n \nToph wants to domesticate him and see if maybe he can eventually learn how to calm down. \n \nUncle talked so much about this guy that didn’t seem to line up with what Toph first saw but the more time she spends with him, the more she gets it. He said that his nephew was brave and kindhearted and gentle and  loyal  and the more Toph messes with him and keeps her feet tuned to him, she knows that it’s true.\n \nAnd if she’s going to be honest, if they can beat the Fire Lord and Azula, Zuko’s probably going to end up on that throne and they could all really use somebody who’s not murder-y and power hungry in charge of the Fire Nation. She reckons that by keeping Zuko safe and sane she’s securing the future for the rest of them, in a future where they win.\n \nSo really,  it’s kind of like Toph’s doing her own part in looking after the good of the world. Like an investment.\n \nAlso because Zuko’s stressy, anxious existence is like a natural attention getter for her, like the equivalent of somebody constantly throwing their arms up and screaming  look at me!!  The difference of course is that Zuko’s not screaming for her attention. Most of the time he doesn’t seem like he wants anybody’s attention but good grief, the dude needs looking after before his heart gives out just keeping him alive.\n \nThat’s what Katara and Sokka and even Aang don’t seem to understand. That, banished or not, Zuko is still a prince. The  only  prince of a very dangerous, volatile nation and if they win and the fire nation survives it, every single person will be looking to Zuko to see what he’ll do. Sokka’s the son of a chief but he’s not the only option they’ve got. Rulers in the Earth Kingdom get voted in. Toph doesn’t know how Air Nomads picked their boss but she assumes it’s based in airbending and wisdom levels.\n \nIf they win, Zuko is the  only  person the people will accept as Fire Lord.\n \nOzai done fucked up is what he did, she thinks. A perfectly good heir to the Fire Nation and look at it, it’s got anxiety.\n \nIf her friends were smart, they’d quit trying to mess him up.\n \nIf Uncle were here, Toph feels like that would help.\n \nBut Uncle’s not here and Toph’s got more to worry about than a neurotic firebender, but sometimes it feels like he’s the only one she can make an impact on.\n \n-\n \n“What’s that?” Toph knows well not to sneak up on Zuko after the first and only time she did it so she announces herself with stomping footsteps during the day and always with her voice when it’s dark.\n \nThe play they went to go see was a damn mess and a half. \n \nLike, okay, it definitely wasn’t a flattering portrayal by anybody’s standards (Toph’s not bellyaching about hers but let’s be real, the play was still garbage) but it wasn’t, like, world ending. Katara and Aang are acting  weird  and she found Zuko on the beach with a...crab trap?\n \nToph can hear scuttling inside the trap and...squeaking?\n \nAt her approach, Zuko shifts towards her and fiddles with the lid. It’s stuck but he doesn’t want to break it, and Toph helps him out with a flick of her toes.\n \n“Thanks.” He reaches in and pushes aside what sounds like crabs snapping for his fingers and pulls out something little that squeaks and squirms in his hands. Toph hasn’t a clue what it is. It’s gotta show on her face because he keeps talking. “It’s a turtle-pus.” He gestures for her to hold out her hands and when Toph does, he sets into her hands something soft and squishy with a shell, with little tentacles and things that stick to her hands. “They like the crabs so you always get one or two in the trap when you pull it.”\n \n“Can you eat ‘em?” Toph asks and Zuko shakes his head.\n \n“Nah. Well, I guess you could if you were desperate. They’re not poisonous but they taste bad. I used to run for the traps…” Zuko trails off and Toph gives him a demanding poke to continue. So many of his childhood stories are nightmare fuel and she wants to hear a happy one for once. “Well, I always wanted to get there first because if I did, I could let them go back in the ocean before Azula got there. Otherwise…” he stops and clenches his jaw and starts doing some deep breathing.\n \nSo much for a happy story.\n \nToph focuses on the weird feeling of suckers on her hands and she shakes her palms to get it loose. Zuko snorts a little and removes it, popping off the tentacles one by one like a damn expert, and plops it back in the ocean with a soft splash.\n \nToph has no idea how anyone can feel safe in the water but there must be something about it, because every single one of them has taken a dip at some point since they got to Ember Island. It scares the hell out of Toph, though. She’s never felt blinder than when she’s found herself in the water.\n \n“You just let ‘em go, huh?”\n \nZuko shrugs and rolls up his pant legs to dig his toes in wet sand, piles up tiny mountains around his feet. Toph helps, not with her bending but with her hands, packing it down tight around his ankles. Every so often he swishes the crabs around in the water to make sure they don’t dry out. Toph’s not sure why it matters since they’re going to eat them anyway, but it matters enough to Zuko.\n \n“Why wouldn’t I?” He replies. “It didn’t do anything to me. Just doing what turtle-puses do. It can’t help wanting what turtle-puses want. You know?” \n \nToph doesn’t know but she thinks that she might have a better idea now.\n \n“And what do you want?”\n \nThey sit in silence for a good ten minutes. Even so, without fail, Zuko makes sure to splash their dinner. Toph even helps once or twice.\n \n“I want to keep my people safe,” he answers finally. “I want to keep the rest of the world safe from my father. ...I want Uncle to forgive me for being what I am.” What he doesn’t say is  failure  or  worthless  or  traitor  but it all comes out in the low and bitter way he talks. People talk a whole awful lot about how much the Fire Nation hates, but Toph knows that there’s probably nothing Zuko hates more than himself.\n \n“If he’s as cool as he sounds, I think he probably already has,” Toph isn’t naturally sympathetic  but she can’t let him go down the road he’s on right now. Self loathing is a river and Zuko may be a good swimmer but even he might drown. “I think he just wants you to be happy.”\n \nToph doesn’t really know what Uncle wants but she remembers the old guy she had tea with and the love and pride in his voice when he talked about his nephew. There wasn’t a chance in hell that he wouldn’t forgive him.\n \n“I don’t know if I ever said anything about it, but I met him once. Before this whole thing was a thing.” \n \nZuko goes very still. His toes don’t even crack the sand she’s piled up on them.\n \n“He talked you up. Talked about how proud he was and how much he cared about you. That sort of stuff. He brews a mean ginger and jasmine.” This could be a really bad idea. Uncle is a sore spot and when a firebender gets poked, shit can get hot. But instead of exploding, Zuko gives a full body flinch instead, and Toph tugs his legs down deeper into the sand. She squishes it up to his knees and he lets her. “I don’t think somebody like that could ever really let you go. Maybe you made him sad, but sometimes that’s just what happens when you love someone. He gives a crap about you. He gives a whole lot of craps, and maybe you didn’t do things the way he wanted you to but you got there in the end.” Zuko can’t reach the waterline without undigging himself to swish the crabs so Toph does it for him. “You’re here because you chose it and that’s fucking important.”\n \nShe will not ruin the heir to a country.\n \nMaybe she can’t dive into the water after him but she can sure as hell throw out a hand and pull him out. Zuko fiddles with the latch on the crab trap.\n \n“...do you think the others would be mad if I let dinner go?”\n \nToph thinks wistfully about the crab dinner she thought she was going to have and then lets the thought go.\n \n“We knew Aang wasn’t gonna eat ‘em anyway,” Toph grumbles. “Not like there isn’t already food at the house.” They can eat crabs when Sokka feels like catching them himself. “Just let them go. Feels mean to let them sit anyway after they waited all this time.” She bends the latch open and hears Zuko rattle the crabs out of the trap and shoo them back into the ocean. If they’re smart, they’ll stay away from any more traps.\n \nIf they’re not, they’ll eat them tomorrow.\n \n \n \nZuko’s hours away from his coronation and he’s scared to death.\n \nThey’ve waited as long as they dared while Zuko was recovering and Uncle held down the fort as regent but it’s finally time. Zuko’s whole body still hurts from Azula’s lightning despite regular healing sessions with Katara and he’s not looking forward to the mess he’s responsible for sorting out with the rest of the world, but he knows that, even if he didn’t start it, it’s his mess now.\n \nThe world is watching.\n \nHe sits on the floor in his old quarters because the idea of setting foot in his father’s old throne room makes him want to throw up. Zuko stares at the unlit candle in front of him but doesn’t light it.\n \nHe’s not afraid of fire anymore.\n \n“Are you doing alright, Prince Zuko?”\n \nNot a prince for long. Zuko thinks, and beckons Uncle in from where he’s peering at him from the doorway. It’s happened so many times by now that he can’t remember when it started. He used to hate it, but now it makes him want to smile. \n \n“Come in, please.” Absently, Zuko rubs his chest with his fingertips. It’s tightly bandaged and the medics keep trying to dope him up for pain, but Zuko’s refused all of it. If he’s going to deal to deal with his father’s council of dickheads, he’s going to do it with a clear head.\n \n“Are you starting a meditation?” Uncle asks and settles down on the other side of Zuko’s candle. “Can a nostalgic old man join you?”\n \nZuko does smile, then, and pushes the candle out of the way.\n \n“If you’re feeling so nostalgic, we could do it the old fashioned way,” he offers with an opening and closing motion of his hands. “It always did have a funny way of making me feel better.” It’s strange to be so open about his feelings but Zuko feels like he’s been hollowed out by his experiences and refilled but not necessarily in a bad way. Sometimes, he’s found, what you end up with can be better than what you started with.\n \nUncle’s smile goes big and wide and sentimental and he opens his hands in his lap, allowing a tiny flame to bloom in his palms.\n \nZuko has never done it like this with anyone else and he never will. He’s not little and scared and frightened of fire anymore but that doesn’t mean it doesn’t feel good to be able to trust in someone else’s flames. Most firebenders would rather die than give someone else that control but it gives Zuko so much undeniable comfort.\n \nPrince or no, banished or no, future Fire Lord or not, this is the only person he knows who’s never hurt him.\n \nIt’s only when his eyes are closed that he feels like he can finally speak.\n \n“I don’t think I can do this.”\n \n“You can, my nephew. Think of all that you’ve done on your way to get here.” Uncle Iroh stubbornly keeps his eyes closed even though Zuko opens his to scowl at him. “It is a difficult, unyielding road that you’ve taken, and it is also the best road. You will do well, but you don’t have to do it alone.” Zuko closes his eyes again because he thinks that if he keeps looking, he’s going to start crying.\n \n“How, though? How are you so sure I’ll be a good Fire Lord?”\n \nThere’s a sudden weight on his knee and Zuko looks down. One of the palace pygmy-pumas has her front paws on his leg and chirps when he gives her his attention. Ozai always hated having them around and Azula went out of her way to try and remove them all in the most horrendous ways she could think of, but word got out that Zuko likes them and all of a sudden, he can’t turn a corner without being followed by something furry. An orange kitten peeks around her and clambers up immediately into Zuko’s lap, and he adjusts his hands to make room for both of them.\n \nUncle’s watching again, and when Zuko meets his eyes he nods downwards into his lap.\n \n“Because of that. Because you’re good, and loyal, and  stubborn , with a kind and gentle heart.”\n \nThe world has tried its best to crush it out of him and failed, over and over again. Zuko’s not ashamed of it and he’s trying his best not to find shame in love and care. He  loves  Uncle with everything he has and spent too damn long refusing to acknowledge it. He won’t keep doing it.\n \n“Thank you for everything you’ve done for me,” Zuko whispers, “I know it’s been a hard road for you too.” He remembers being horrible and bratty and pigheaded and in so much  constant pain  and how Uncle never, ever left him. The only times they separated, Zuko had been the one to leave.\n \n“Oh,  Zuko .” No honorifics, no epithets. Just his name. Uncle’s eyes are big and shiny and Zuko is immediately horrified, but he smiles hugely even though he looks like he’s definitely gonna cry. “That’s what you’re supposed to do for your children.”\n \nAnd Zuko can’t help it now, he leans forward and buries his face in his hands to try and hide his tears. He sobs helplessly into his palms and, just like years ago, Uncle’s careful of his guests when he reaches across the space to pull him close.\n \n "
}