{
    "id": "21280649",
    "url": "https://archiveofourown.org/works/21280649?view_full_work=true",
    "author": [
        "pupeez4eva"
    ],
    "title": "Shattered Dreams",
    "rating": "Not Rated",
    "archive_warnings": [
        "Major Character Death"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù"
    ],
    "relationships": [
        "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian",
        "Jiang Cheng | Jiang Wanyin & Wei Ying | Wei Wuxian",
        "Jiang Yanli & Wei Ying | Wei Wuxian"
    ],
    "characters": [
        "Wei Ying | Wei Wuxian",
        "Jiang Yanli",
        "Jiang Cheng | Jiang Wanyin",
        "Lan Zhan | Lan Wangji",
        "Lan Yuan | Lan Sizhui",
        "Lan Jingyi"
    ],
    "additional_tags": [
        "Time Travel",
        "Angst",
        "lots and lots of angst",
        "Character death but it's WWX so he is coming back",
        "WWX time travels back to the Nightless City",
        "And doesn't let JYL take the blow for him",
        "Post-Canon",
        "Angst with a Happy Ending",
        "And then just lots of fluff and WangXian and Yunmeng sib feels to make up for all the angst"
    ],
    "language": "English",
    "series": "",
    "published": "2019-11-02",
    "completed": "2019-11-18",
    "words": "8,561",
    "chapters": "3/3",
    "comments": "469",
    "kudos": "14,673",
    "bookmarks": "2,829",
    "hits": "150,908",
    "summary": "<p>Wei Wuxian knew this scene all too well, and he knew what would come next — the flash of a blade, Jiang Yanli’s blood staining the Earth, her body dropping to the floor. He thought, <em>‘Lan Zhan, I’m sorry,’</em> and he held her in place as she reached forward to push him out of the way.</p>\n<p>This time, Shijie wouldn’t die.</p>",
    "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>Yeah, someone needs to get me away from my laptop, because now that I've started, I can't seem to stop writing for this fandom.</p>\n<p>And also this MDZS has so much angst potential. I usually stay the hell away from writing angst because I really struggle with it, but like...I get my laptop out and these characters practically write themselves haha</p>\n<p>Anyway, this was painful to write, but I guess WWX would've died anyway, and in a way more painful way...but he just really misses his husband, and wants to go back to their happy, domestic life, and I'm 100% going to be reuniting them next chapter.</p>\n<p>(Also, in case there's any confusion, WWX is the only one who has time traveled here, not LWJ too).</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Okay, so I ended up splitting this into an extra chapter because I have no self control. So the next chapter will have more Wangxian fluff, Wei Wuxian finding out what happened after his death, and, because there was no way I wasn't including this, a Yunmeng sibs reunion! </p>\n<p>The next chapter will also explain what happened to the Wens (not a happy outcome, unfortunately, but I really couldn't find a way to get around this considering the point in the timeline they were at), and how Sizhui survived.</p>\n<p>Also - if anyone's wondering why Wei Wuxian hasn't really thought about JYL much, I plan to go over that more in the next chapter, but basically, he's kind of blocked it all out because he's genuinely terrified of even starting to believe that she could be alive, only to have his hopes crushed. So right now, he's not thinking about it, because he genuinely can't process that something like that could be real. </p>\n<p>Anyway, hope you enjoyed this chapter! Basically just heaps of Wangxian feels to make up for the pain of the last chapter. Hopefully I get get the next part out soon - I'd like to do it by this weekend, but I do have my last exam coming up, so let's see how that goes haha.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>And it's done! Sorry for the delay on this chapter guys, I was really struggling with the beginning. Like, I knew exactly what I wanted from their reunions, I just didn't know how to connect those scenes. This chapter ended up being way longer than the other ones anyway, so hopefully that made up for it</p>\n<p>A few endnotes:</p>\n<p>1) I really condensed the canon amount of time between Mo Manor and Dafan Mountain...I'm pretty sure WWX took a few days to get there canonically? But I literally could not find a way to fill up that time, nor a reason for why WWX would delay telling LWJ the truth for so long. But I really wanted his meeting with JC + the revelation of Shijie's survival to happen before he had his full convo with LWJ. So. The time between those two was a lot shorter, but it doesn't really affect the story much so meh</p>\n<p>2) JC notices that it's WWX - or at least hopes that it might be WWX - because, since he and JYL both knew their brother was in love with LWJ, JC is a lot more aware of LWJ, and knows about his feelings for WWX. He also knows how much LWJ loves WWX, and how he hasn't moved on even after thirteen years because a) like JYL said, they were all grieving for the same person, and didn't exactly have many people who could understand that and b) I headcanon JYL and LWJ actually getting quite close after WWX's death, and JYL realises that LWJ returned her brother's feelings, and she's obviously going to be telling JC all about that. So JC immediately saw this guy clinging to LWJ, and LWJ casually wrapping an arm around his waist and holding him tenderly, and instantly goes, \"huh, this is sus...\"</p>\n<p>3) Someone asked about the Stygian Tiger Seal in the last chapter and hahaha...I kind of forgot all about that...but hey I mostly wrote this fic because I just wanted a bunch of really fluffy character reunions, so let's just ignore what happened to it for now, okay? xD </p>\n<p>Thank you so much for reading this story, and all you're lovely comments! I definitely wasn't expecting this much attention for this story, and I appreciate all of you guys so much! I'll definitely be writing more for this fandom in the future, so keep an eye out!</p>",
    "text": "He wasn’t quite sure what had happened. He knew he shouldn’t be here. He should be at home, in the Jingshi waiting for his husband to come back with their breakfast. They’d eat together, Wei Wuxian chattering away while Lan Wangji listened quietly, and then maybe stop by and visit their rabbits before they each went to teach their respective classes. He’d spend some time with A-Yuan and Jingyi, and then meet his husband again after. They’d spend their time together, have dinner, have their every day, and curl up beside each other at night, warm and comforted in each other’s presence, ready for the next day to begin.\n\nYears after marrying Lan Wangji, Wei Wuxian was still amazed by the extent of what his husband felt for him. That he’d waited so many years, mourned him, but lived his life in a way he’d imagined Wei Wuxian would be proud of.\n\nWei Wuxian loved that man, cherished him beyond all else, and could hardly believe how lucky he was that Lan Wangji was his.\n\nHe wanted to be home, in his husband’s presence, in his husband’s arms, but he wasn’t. Instead, he was here, in the cold, dark streets of his nightmares, in a city that was supposed to be nightless but where the last ounces of light had bled from his life; where crowds of people screamed for his death, where corpses ripped and attacked at his command, and where his sister was cradled in their brother’s arms.\n\nHis sister, his beautiful Shijie, the one that he hadn’t seen since that awful day. Selfless, kind Shijie, who never should have died, who deserved to live a long, happy life with the son he’d rendered motherless, and the brother who truly deserved her.\n\nShijie was alive, Shijie was murmuring, pleading, and he raised Chenqing like he had all those years ago, made the corpses to stop attacking, did what Shijie asked just like he always would, and he thought, ‘This is a nightmare.’ This was something that had haunted his dreams for years, sent him spiralling into desperate wheezes and sobs as he woke up at night, with Lan Wangji’s comforting embrace the only thing keeping him grounded.\n\nYears in the future, even after Lan Wangji had provided him with hope for salvation, even after he’d managed to carve out a sense of happiness and belonging that he never again thought he’d have after his sister had sacrificed herself for someone who didn’t deserve her devotion…the pain that Jiang Yanli’s death had caused him, the regret, the frustration, the guilt, had never left him. It would never leave him, not when he knew that his sister was gone forever, and it was his actions that had led to her death.\n\n‘This is a nightmare,’ he thought again, even though he knew that wasn’t true. The ground was too hard, the air too stifling. Jiang Yanli looked too real for her to be a figment of his imagination, blood staining her dress from the gash in her back, hair falling over Jiang Cheng’s lap, face an expression of kindness despite her pain. There was the sound of thundering footsteps, panting breaths, angry screams, yells of terror; they were all too loud, closing in, smothering him.\n\nPeople were dying, Shijie was dying, but Shijie was in their brother’s arms, Shijie was warm, Shijie was alive, Shijie had died, her blood staining the Earth, and —\n\n— this is a dream, Lan Zhan, Lan Zhan, wake me up —\n\nThere was the sound of a blade, a yell of rage, Jiang Yanli’s panicked face, and he knew this all too well, had seen this too many times. Wei Wuxian knew this scene all too well, and he knew what would come next — the flash of a blade, Jiang Yanli’s blood staining the Earth, her body dropping to the floor. He thought, ‘Lan Zhan, I’m sorry,’ and he held her in place as she reached forward to push him out of the way.\n\nThis time, Shijie wouldn’t die.\n\n‘This is a dream,’ he thought, but it didn’t matter, because even in the darkest depths of his nightmares, he wouldn’t stand by and let his sister die. He felt the cold blade cut into him, and sharp, agonising pain, and oh, wasn’t this the part where he was supposed to wake up?\n\nIt hurt. Everything hurt. He could hear someone screaming, but it all sounded so distant. Dreams weren’t supposed to hurt this way, were they?\n\nPain, agonising pain encompassing him, something wet staining his clothes, dripping to the floor — blood, his blood, and oh, oh, this wasn’t a dream was it?\n\n“A-Xian,” someone was sobbing. Shijie, he thought. Shijie was crying. He tried to open his eyes, and it took him a few tries for it to work. Jiang Yanli was staring at him, eyes wide in horror, and Jiang Cheng was next to her, his face bleached white.\n\nYears ago, Wei Wuxian had knelt on this very ground, his world falling apart around him as his beloved sister lay dead. He’d lost her, and he’d lost his brother as their relationship shattered beyond repair with Jiang Yanli’s last breath; and he’d screamed, and he’d put the pieces of the Stygian Tiger Seal together, and he’d killed thousands, and Jiang Yanli was still gone.\n\nYears later, and he was somehow back in this moment; not in the Jingshi, not with his husband and the life they had built for themselves, but on a dark street, surrounded by all those who hated him, and dying in his sister’s stead.\n\nThis wasn’t a dream. This was real. And Jiang Yanli was crying, clutching desperately to him and sobbing for him to stay awake, “Please A-Xian, do this for your sister, please don’t leave me — ” but she was alive. She was alive.\n\n“Wei Wuxian,” Jiang Cheng choked, “You idiot, you — just wait, I’m going to, I’ll — all of you bastards get the fuck away from him — A-Jie, A-Jie, put pressure on the wound, Wei Wuxian, you can’t — ”\n\nHe was drowning. The sound around him was growing distant, the world closing in. His brother and sister were still clinging to him, and he thought, confused, ‘Jiang Cheng hates me. Jiang Cheng…why is he…?’\n\nA thump on the ground next to him, the soft rustle of robes. Wei Wuxian wanted to ignore it, wanted to close his eyes and drift off, wanted to wake up in his husbands arms, but also wanted this to be real, because Shijie should live. Jin Ling needed his mum, Jiang Cheng needed his sister. This world needed Jiang Yanli.\n\nBut something urged him to open his eyes, and he forced them open, barely managing small slivers. There was a figure dressed in white, a familiar face staring down at him with gold eyes he loved so much. His expression was one of horror.\n\n‘Lan Zhan,’ he thought. He wanted to reach out, take that face into his hands, wipe that expression off his face. Lan Zhan shouldn’t look that way. Lan Wangji had morned for far too many years, and Wei Wuxian had promised himself that he would never allow his husband to feel hurt or heartbreak again, that he would make him happy for the rest of their lives.\n\nLan Wangji was staring at with with agony on his face, and Wei Wuxian realised that he had broken that promise. Because in choosing to save his sister, Wei Wuxian had condemned Lan Wangji to another thirteen years of heartbreak.\n\n‘I’m sorry,’ he thought. He wanted his husband to hold him close in his protective embrace, make him feel warm, and comforted and loved like he always did. He wanted to hold Lan Wangji until the pain was just a figment of the past, and his husband was happy and content, and loved, oh so loved, because it was what Lan Wangji deserved.\n\nHe could feel life slipping away from him. He didn’t feel much pain anymore, and and he thought that this is almost nice compared to his first death, where there had been no comfort, only pain, and blood, and bone, and ripping and tearing until there was nothing of him left but a shattered soul and a broken legacy.\n\nStill, he reached for Lan Wangji, because if he was condemning his husband to years of pain and mourning — perhaps more, because what if things were different this time, what if he never came back, what if Lan Wangji was alone forever — then Wei Wuxian wanted him to know this at least.\n\nHe barely managed to raise his hand before it dropped back beside him. He settled for focusing on Lan Wangji, struggling to keep his eyes opened, and summoned a weak smile.\n\n“Lan Zhan,” he murmured, feeling himself drift off. “Love you…”\n\nHe could see Lan Wangji’s eyes widen, and felt his own drift shut. Jiang Yanli’s sobs, Jiang Cheng’s yells, Lan Wangji’s anguish — it all drifted away and for a moment, Wei Wuxian was warm, and comforted, and wrapped in his husband’s comforting embrace, and then it was all gone.\n\n“He’s dead! The Yiling Patriarch is dead!”\n\n“Wei Wuxian is dead!” \n\n“The demon has been slayed!”\n\nCheers rose up around them, as Jiang Yanli wailed, as Jiang Cheng howled and pleaded for a brother who could no longer hear him, and as Lan Wangji stood still, Wei Wuxian’s last words, words he had longed to hear for so many years and that now sounded more like a curse, still reverberated through his mind.\nHe woke up to a familiar scene, lying in a familiar array, with a person who should be long dead kicking him in the gut. \nFor a moment he just blinked at the ceiling, feeling disoriented. How had he got here? Where was his husband, where — \n\nWhat’s the last thing you remember?\n\nBeing at home, waiting for his husband to come back with breakfast, ready to start their usual morning routine.\n\nNo, not quite.\n\nCold ground, thundering footsteps, heavy air suffocating him, pain, oh God, the pain — and arms around him, holding him tightly, arms belonging to the people he loved. A familiar pair of gold eyes, watching him in horror an anguish.\n\nLan Zhan. Oh God, Lan Zhan. \n\nWei Wuxian sat up suddenly, eyes wide in panic, his last memories rushing back to him. He remembered the altered events of the Nightless City, and dying in his sibling's arms as his beloved husband watched on. Oh God, Lan Zhan would be so worried. He — he had to go and find him, he had to explain.\nExplain what? Well, for a start, what had happened. How he’d time traveled, how he’d died…oh, what did it matter, as long as he found Lan Wangji and told him everything. They’d figure it out later. He just needed to find Lan Wangji, because him being here, freshly resurrected in Mo Xuanyu’s body, meant that Lan Wangji was currently in his thirteen year mourning period. Wei Wuxian wouldn’t make his husband suffer through that for any longer than necessary.\nMo Xuanyu’s cousin left him after a string of mocking comments and jeers, and Wei Wuxian immediately jumped to his feet, determined not to waste any time.\nThings played out more or less the same as he remembered them. He walked into the Mo household, saw Sizhui and Jingyi — and God, A-Yuan, his A-Yuan, was okay. Wei Wuxian hadn’t processed what him dying earlier would have meant for the boy until this moment, but he was so relieved to see him alive and well — and helped the juniors fight off the corpses and the hand. He maintained the lunatic facade for the time being (even though he had no intention to hide for much longer) because it was fun to see the reactions of the Juniors, and he still had some time until Lan Wangji showed up. Might as well have some fun in the meantime.\nHe tried not to dwell too much on what had happened prior to his resurrection. The memories of his altered death were still a mess of confusion, fear and panic, and he really didn’t want to think about it too much. And besides, it had been a far more peaceful death than his first one; a quick strike to chest rather than the agonising pain of bones snapping and skin being ripped off, of feeling corpses tear into his muscles and organs.\nAnd this time, maybe — just maybe — \n(He couldn’t bring himself to think it. That maybe, just maybe, his beloved sister was still alive. The thought of having his hopes crushed was too painful to bear).\nWhen Lan Wangji finally did show up, Wei Wuxian was more than ready for it. The last time he’d seen his husband was still branded in his mind. He remembered the agony on the other man’s face, the vision more clear than the fading sobs and pleas from his siblings that had grown more and more distant as he’d lost consciousness. It made something twist in his gut, and oh, he never wanted to see that sort of pain on his husband’s face ever again.\nIt didn’t help that even now, thirteen years later, Lan Wangji was still clearly in mourning. Most people would have missed it, but Wei Wuxian was adept at reading the man after years of marriage, and he could see the way he carried his grief with him constantly. It wasn’t fair. Lan Wangji never should have had to suffer through any of that, and Wei Wuxian hated that there was nothing he could have done to save him this pain.\nIn the end, it didn’t matter either way. Wei Wuxian would never have been able to sit by and let his sister take that hit for him. He’d just have to make sure Lan Wangji knew just love loved and adored he really was.\nTo his credit, he did briefly think breaking the news gently — but his husband just looked so sad, and so beautiful, and perfect, and, oh God, Wei Wuxian missed him so much, and before he really processed what he was doing, he was running forward and throwing his arms around Lan Wangji.\nLan Wangji instantly went stiff, and Wei Wuxian could hear a loud yelp of outrage that he was fairly certain had come from Jingyi. He ignored all of this and buried in deeper, breathing in the scent of sandalwood.\nLan Wangji reached forward to push him away, and Wei Wuxian pouted. He just wanted to cuddle with his husband - was that too much to ask?\n…Probably. Lan Wangji — and everyone else for that matter — currently thought he was a lunatic, and he probably wasn’t helping matters by assaulting the other man right now.\nHe pulled away and gave Lan Wangji the brightest smile he could muster; the smile he had given him on their wedding day, the smile he had given him on the night they’d first met. \nLan Wangji didn’t look angry or annoyed by the sudden assault, but then, it was Lan Zhan. The man had a lot of patience, unless someone tried to hurt or insult Wei Wuxian or his family. Wei Wuxian briefly considered blurting out the whole truth — that he was a time traveler from the future, who had changed the course of the events leading to his original death by dying earlier, and, oh yes, he was also married to the most perfect, amazing man in the whole universe, yes Hanguang-Jun, that’s you — but then decided that it might all seem a bit far fetched.\nSmiling again, this time something softer and sweeter, he reached out to lay a hand on Lan Wangji’s arm. Then, before the man could push him away again — Lan Wangji wasn’t exactly a fan of strangers touching him, and as much as Wei Wuxian loved teasing his husband, he was probably really pushing it by this point — he started humming a very familiar tune.\nLan Wangji stilled, his eyes growing wide in shock. Wei Wuxian continued humming, and let his hands drift lower, taking both of Lan Wangji’s hands in his own.\nBy the time he stopped, Lan Wangji was trembling. His gold eyes were wide in shock, and he mouthed the words, Wei Ying, seemingly unable to speak.\nHe nodded, smiling. “It’s me.”\nHe knew it had to be a lot to process, but Wei Wuxian had lived through the misunderstandings and miscommunication, and lived through nights where Lan Wangji would wake up from nightmares,  searching for him, desperate to see that Wei Wuxian was still alive and safe beside him. Wei Wuxian would never let his husband go through another moment of pain while he could do something about it.\nWell, he’d never been one to hold back. He opened his mouth, and familiar words poured out. After all, what could be more perfect than the words he’d spoken the first time he had confessed to the man in front of him? \n“You’re really great. I like you. Or in other words, I fancy you I love you. I want you, I can’t leave you, I whatever you. I want to night hunt with you every night. I want to sleep with you every day. I don’t want anyone but you — it can’t be anyone but you.”\nThe words poured out as they had that day so long ago. That day was now lost to a time that no longer existed, but Wei Wuxian would make sure that Lan Wangji still heard these words. \nIf Lan Wangji had been shocked before, he seemed downright dazed now. He was shaking, his eyes glossed over with unshed tears, a choked mantra of “Wei Ying,” leaving his lips over and over. \nWei Wuxian lifted Lan Wangji’s hands, and placed a soft kiss to his knuckles. He lifted his head, meeting Lan Wangji’s eyes, taking in the sight of his husband. He let go of his hands, and Lan Wangji let out a muffled sound of protest. Wei Wuxian let out a small laugh, and instead reached out to cup Lan Wangji’s face, a tender smile on his face. He could feel tears stinging his own eyes, moved by his husband’s emotions as he always had been.\n“Could you leave us alone for a bit?” Wei Wuxian called out to the Juniors, who had yet to say anything. If he’d turned around, he would have seen that the reason for this was because they looked completely stunned, but his eyes didn’t move from his husband’s face.\n“Hey!” Lan Jingyi snapped, shaking off his shock somewhat, “you can’t just — ”\n“Go,” Lan Wangji said, firmly, and Jingyi fell silent. Wei Wuxian shot an amused glance behind him, in time to see the red-faced juniors shuffling off, their gazes glued to the floor.\nAhh, it was good to see those two. Jingyi and his A-Yuan, both part of his family. He’d make it up to them later.\nMuch later, he decided, as Lan Wangji tugged him back around in a frantic movement. He was soon once again face-to-face with his husband, and the longing and desperation and hope in Lan Wangji’s eyes was almost more than he could bear.\n“It’s me, Lan Zhan,” he whispered. “And I’m so, so sorry for leaving you. I promise I’ll never leave again, okay? I love you.”\n“Wei Ying,” Lan Wangji said, his voice still trembling. “I — love Wei Ying too, love Wei Ying so much, I — I — ” Seemingly incapable of words at the moment, Lan Wangji instead settled for reaching forward, cupping Wei Wuxian’s face between his hands, and pulling him in for a kiss.\nIt was hesitant at first, and Wei Wuxian knew that Lan Wangji was holding back, afraid to dare hope that this was truly happening, only to have his hopes crushed again. Wei Wuxian deepened the kiss, burying deeper into his husband’s arms, and Lan Wangji’s worries seemed to ease immediately. He clutched onto Wei Wuxian, desperate, warm, comforting, familiar, and oh, Wei Wuxian never wanted to lose this. No matter what happened, Lan Zhan would always be his home.\nThey broke away at last. Wei Wuxian saw the unrepressed awe in Lan Wangji’s eyes, and felt another wave of affection for the man in front of him. He knew this had to be a lot to take in. The Lan Wangji of his own time had at least had enough time to process Wei Wuxian’s return before they’d revealed their feelings for each other. \nThis time, Lan Wangji had been hit with everything at once. Wei Wuxian could still see a hint of uncertainty in his husband’s eyes; Lan Wangji was so happy, but Wei Wuxian also knew that, after thirteen years of grief and pain, Lan Wangji was terrified that this would all be ripped away from him again.\nWei Wuxian regretted a lot in his life, even if he tried his best to focus on the present and not dwell in the past. Being unable to prevent the pain Lan Wangji had endured for all those years would always be one of them. He was just grateful that this time, Lan Wangji had not been forced to remember words of anger and disgust that Wei Wuxian had spat at him through a mad delirium, and instead had the knowledge that the one he loved returned his feelings.\nWei Wuxian was back now, and he would prove to Lan Wangji that none of this would ever go away. He had the rest of their lives to do it.\n“I love you,” he told Lan Wangji again, and the arms around him tightened in response. “I love you so much and — I have a lot to tell you.”\nWei Wuxian had intended to tell Lan Wangji everything. He had no reason to hide the truth from his husband, and no desire to do so. He was, however, exhausted, and Lan Wangji could clearly see that. Wei Wuxian didn’t remember being this drained the first time he had been brought back to life, but he’d also been far too preoccupied with escaping and ensuing that no one found out who he was. His return this time had included a desperate urge to find his husband, and an emotional confession. He wanted nothing more to curl up in a large, comfortable bed, with Lan Wangji’s arms wrapped around him.\nThe truth could wait a bit longer, he supposed. They would be wasting a lot less time with needless misunderstandings and miscommunication, so he supposed they could spare a few extra hours for some much needed alone time.\nLan Wangji booked rooms at a nearby inn for them, while the Juniors continued to avoid all eye contact. Wei Wuxian found it kind of adorable. And though Wei Wuxian would’ve loved to have their everyday — just how many days had they missed in the last thirteen years?! — Lan Wangji had gently told him to get some rest, and Wei Wuxian had pouted and complied. After all, they had the rest of their lives to make up for it. And Wei Wuxian would make sure they made up for it.\nBut then he remembered that there were other important things they really should be doing. The Goddess Statue for instance — because if Jin Ling still ended up there, then Wei Wuxian needed to be there too in order to help his nephew.\nSo as much as he would really like to head home to the Jingshi straight away and spend the rest of the day in the throes of passion with his husband (and he’d make sure they didn’t leave that bed until the sun had set and the next day had begun), they still had things to do. \nStill, he definitely needed to tell Lan Wangji everything. He just didn’t want it to be now, when he knew they would be on the move soon. This would take time, and he wanted to be able to sit down and take as much time as he needed to explain everything.\n“Lan Zhan,” he said, as they prepared to leave later that day, “I have so much to tell you. Just…maybe tonight. It’s a lot.” Oh God, it was a lot. Though he was pretty sure if anyone could handle all those revelations it was Lan Wangji. “Do you trust me?”\n“Always,” Lan Wangji said immediately, and Wei Wuxian flushed. \n“Wei Ying,” Lan Wangji called out suddenly, as they were about to leave the room. “Lan Sizhui — ”\n“He’s A-Yuan, isn’t he?” \nLan Wangji stared.\nWei Wuxian smiled. “A parent always knows!” That, and he had lived through a whole other timeline, but he’d tell his husband about all of that soon enough.\nThey walked out, Wei Wuxian’s arm still entangled in Lan Wangji’s, and both Jingyi and Sizhui looked away, their faces bright red.\n…\nThey soon found themselves dealing with a familiar scene on Dafan Mountain, with Jin Ling and Jiang Cheng standing across from them. Wei Wuxian could feel his heart beating rapidly. His memories of how this had gone the first time were still vivid, and though he wasn’t alone this time, the memory of being struck with the full realisation of how much his brother had changed still resonated with him.\nHe moved instinctively closer to Lan Wangji, who instantly placed a comforting arm around him.\nJiang Cheng was staring at him, his eyes darting between Lan Wangji and Wei Wuxian, taking in their close proximity, the way that Wei Wuxian clung to him, the way that Lan Wangji returned it with a tender arm around his waist.\nWei Wuxian watched as his brother swallowed, his Adam’s apple bobbing. Without removing his gaze from the two of them, he said, “Jin Ling, go. See if you can find some good prey.”\n“But Uncle — ”\n“Now!”\n“You two can go too,” Lan Wangji told Jingyi and Sizhui, who were gazing warily at the Sect Leader. The two hesitated, but then Sizhui nodded and grasped Jingyi’s arm, pulling him along. \nWhen the children were gone, Wei Wuxian turned back to Jiang Cheng nervously. In his own timeline, their relationship had improved immensely in that Jiang Cheng was no longer actively trying to kill him. Beyond that though, they hadn’t even come close to recreating the brotherhood they had lost. It hurt a lot, a constant twisting, bitter ache that was made worse every time he saw his brother, but there wasn’t much he could do about it. There was simply too much that had happened between them; too many secrets, too many broken promises, too much pain and loss. And maybe they could have tried to rebuild something from the ashes of their old bond, but Wei Wuxian was too full of self-doubt and regret, and Jiang Cheng too full of bitterness and hurt.\nThey were brothers but they were also strangers, and those were just two things that just wouldn't co-exist. Wei Wuxian had managed to maintain an uneasy truce with the man he had once called a brother, but that had been all he could ever hope for.\nWith a wave of exhaustion and regret, he realised that now, he didn’t even have that. He would have to start again with Jiang Cheng, and deal with all that bitterness and hatred until they could somehow find the solution that let them both accept each others’ existences, yet allowed for nothing else.\nAnd yet, Lan Wangji did not appear particularly hostile or unwelcoming as he returned Jiang Cheng’s stare, nor did Jiang Cheng seem particularly angry. In fact, he seemed almost hopeful.\nAnother moment passed, and the silence seemed to grow stifling.\n“You two appear awfully close,” Jiang Cheng said at last, his eyes glued to Lan Wangji’s arm around his waist. “The esteemed Hanguang-Jun, allowing such…intimate contact? Is this a new lover, perhaps?”\n“Mn.”\nJiang Cheng nodded, swallowing heavily. He shifted his gaze, meeting Wei Wuxian’s, and all of a sudden he seemed very vulnerable.\n“…Wei Wuxian?”\nWei Wuxian stiffened, and forced himself to stand still. \n‘You’ve already dealt with this once,’ he reminded himself. ‘Just get it over with.’ He braced himself for the familiar anger, bitterness and hatred, as he heard hurried footsteps coming towards him.\n“Wei Wuxian?! Is that you?”\nHe opened his eyes, feeling his heart racing, and met his brother’s gaze head on.\n‘I don’t want to do this again.’ He hated being faced with the reminders of a brotherhood he would never get back, even if it was more than what he deserved for the pain he had caused.\n\n‘Just get it over with. Acting like a coward won’t change anything.’ \n\n“Jiang Cheng,” he said quietly. “I — ”\nAnd then Jiang Cheng was hugging him, squeezing him close and shaking, and Wei Wuxian could only stand still, utterly dumbstruck.\nJiang Cheng pulled back, and Wei Wuxian could see tears in his brother’s eyes.\n“What, you’re not even going to hug back?” Jiang Cheng demanded, quickly running a hand over his eyes. “You — idiot, making me wait all these years, and now you can’t even…”\n“I…” Wei Wuxian’s voice shook, and he could barely voice his thoughts aloud, or understand what was happening. Jiang Cheng was supposed to hate him. Jiang Cheng would never hug him, because he had ruined Jiang Cheng’s life, he had torn apart his family, he’d broken his promise. “I…how’d you know it was me?” \nJiang Cheng snorted. “As if Lan Wangji would ever hold anyone else that way. A-Jie and I both know he’s never moved on after you. And then he confirmed that you and he were together — and besides, I always...had a feeling that you would come back someday. It's you, you're far too annoying to just stay dead - ”\nThe rest of Jiang Cheng’s words seemed to bleed away, and all Wei Wuxian could hear was, “A-jie and I both know.” \n\nA-jie and I…\n\n\nA-jie…\n\n\nShijie.\n\n“Shijie,” he whispered, and his voice sounded weak to his own ears. If he’d been paying more attention, he would have noticed that Jiang Cheng was no longer talking, and that both he and Lan Wangji were staring at him in concern. His mind was elsewhere though, drawn to the image of a tiny young woman dressed in purple, who had died in her brother’s arms, in a pool of her own blood.\n\n‘Shijie dying, her blood dripping on the cold floor, Jiang Cheng staring at him with hatred in his eyes as Shijie lay dead in his arms. Shijie with a blade through her, Shijie covered in blood, Shijie dead, dead…’\n\n\n‘But that’s not what happened is it?’\n\n\n‘Shijie died.’\n\n\n‘No.’\n\n\n‘Shijie…tried to push me out of the way. I stopped her.’\n\n\n‘Yes.’\n\n\n‘I…stopped her. I died.’\n\n\n‘Shijie lived. Shijie cried, Shijie pleaded, Shijie watched her A-Xian die, but Shijie lived, Shijie lived, lived lived — ’ \n\n“Wei Wuxian!”\n“Wei Ying!”\nThere were arms around him, and it took Wei Wuxian a moment to realise that they were Lan Wangji’s, holding him close and keeping him upright. He was shaking all over, his eyes wide, and his face very pale. Jiang Cheng was gripping his arm, his eyes wide in concern.\n“Shiije,” Wei Wuxian said, his voice almost a whimper as he voiced the question he had been trying to block out from the moment he’d woken up. “Shijie…is alive?”\nBecause he had wanted so hard to believe it, but even the thought had terrified him. If he gave in and allowed himself to hope and dream of a world where Jiang Yanli had survived, and it all turned out to be a cruel mistake, then he didn’t think he could survive the fallout. He knew that he had taken the blow, sparing Jiang Yanli the cold welcome of death, but he hadn’t allowed himself to believe that the universe was kind enough to grant him this.\n“Of course she’s alive,” Jiang Cheng said, sounding confused. \n“Shijie’s alive,” Wei Wuxian repeated, needing the reassurance. “She’s alive, she’s okay, Shijie — ” \nHis eyes stung with unshed tears. Lan Wangji tugged him closer, and pressed a soft kiss to the top of his head. \nJiang Cheng snorted. “A-jie’s going to love this.” He turned to Lan Wangji. “If the two of you are getting married, you'd better ask permission first.”\n“We’ll just elope,” Wei Wuxian said, his voice wobbling. “I just want to be with him.”\nLan Wangji turned to him, eyes wide in shock, and Wei Wuxian just really wanted to kiss him. He was so happy right now, he felt like he could just float away. \n“Come to Lotus Pier with me,” Jiang Cheng said, his words almost desperate. “You’ll be safe there, I promise.”\nWei Wuxian shook his head. He had longed to hear those words from his brother for so long, and did want to go back so badly. But right now, he could feel his husband’s comforting presence next to him, and was acutely aware of the pain Lan Wangji had suffered because of his death.\nThirteen years of mourning, and Wei Wuxian wouldn’t let him suffer any longer. The two of them were going home.\n“I’ll come by and visit,” he told Jiang Cheng. “But I need to go with Lan Zhan first.”\n“It’s not safe,” Jiang Cheng argued. “If you go back to Gusu, and someone finds out who you are — it isn’t safe. Please, just — ”\n“I’ll be okay. Lan Zhan will take care of me. But — he needs to go back now. And I need to go with him.”\nHe expected Jiang Cheng to be angry with him, but his brother mostly just looked tired and very concerned. He nodded slowly after a moment, and turned to Lan Wangji. “Fine. Please send word when the two of you return to Cloud Recesses, and let me know when it will be safe for my sister and I to visit. We will be discreet, but we’ve been waiting too, and — and neither of us want to wait any longer.”\nWei Wuxian trembled. “Jiang Cheng.”\nJiang Cheng sighed. “Idiot. Look after yourself, okay? Don’t drive Lan Wangji too crazy.”\nWei Wuxian lurched forward, pulling his brother into a hug. Jiang Cheng returned it immediately, and the two held each other close for a long while.\nWei Wuxian eventually pulled away, wiping his eyes with the back of his hand. It was a futile effort, and did nothing to hide the tears that stained his cheeks. “I’ll see you soon, okay?”\n“You’d better.”\nWei Wuxian turned to Lan Wangji, who returned his gaze with a look so warm and tender that it made Wei Wuxian want to hold him close and never let go. “Okay Lan Zhan,” he said, smiling, “take me back to Gusu now.”\n…\nOf course, things didn’t always go to plan, and it was shortly after that that he remembered the events of his original timeline, and thought, ‘Oh right, Jin Ling, Sizhui and Jingyi are supposed to be fighting that Goddess Statue right now, aren’t they?’ \nA quick look around proved that the Juniors were all gone, so he, Lan Wangji and Jiang Cheng had headed off after them.\nThe ensuing fight had at least given him the chance to play that familiar tune — meeting Lan Wangji’s gaze with a cheeky smile as he did so — to release Wen Ning from his confines. He momentarily wondered if he was pushing it too much as he turned to his brother, but Jiang Cheng mostly just looked confused and wary by Wen Ning’s presence. \nThere were still other cultivators around, so as much as Wei Wuxian wanted to remove the needles from his friend’s head, this wasn’t the time or place. He made sure Wen Ning had gotten far away though. He would deal with it as soon as possible.\nWhen they had eventually parted ways again, Jiang Cheng had reminded him yet again that he and Jiang Yanli would come to visit soon, and Wei Wuxian had felt his heart squeeze tightly at the thought. The hope that he and his brother could actually have their relationship restored, and that his sister could be alive and well again still seemed so far away, and he knew that he’d need to see her for him to truly be able to believe it.\nStill — Lan Wangji had confirmed that it was true, and he would never lie to him. Wei Wuxian clung to that thought.\nLater that evening, Lan Wangji booked rooms for them at the closet inn they could find, so that they could rest before they continued onwards to Gusu. As they lay in each others arms, Wei Wuxian listened as Lan Wangji told him about what had happened after his death.\nHis chest felt heavy as he listened to what had happened to the Wen Remnants. It seemed they weren’t nearly as fortunate as his sister had been; his death at the Nightless City had changed nothing about their own fates, and they had perished just as they had in his original timeline.\nLan Wangji had tried to speak on their behalf, desperate to do at least this much for the love he had failed to protect. But there was little he could do in the face of the Nie, Lan and Jin sects, who all called for the Wen’s deaths now that the Yiling Patriarch was gone. \nThis time, the Jiang Sect had not participated in the siege. Jiang Cheng had even attempted to to prevent the siege, out of respect for his dead brother. But the Jiang Sect was still weak after the losses they had suffered, and even wracked with grief and guilt after his brother’s death, he was still only wiling to go so far for those he still blamed for the destruction of his Sect.\nWei Wuxian wasn’t surprised. He knew his brother, and he knew that Jiang Cheng had a Sect to look out for. Wei Wuxian had never expected or hoped that he would abandon all of that to help the Wens. And ultimately, he doubted how much it would have helped by that point. Both the larger and smaller sects, most likely fuelled onwards by the Jins, had wanted to destroy any remnants of the Wens or the Yiling Patriarch. \n“How did A-Yuan survive?” he asked. In his original time, he’d tucked the boy away in the safest hiding place he could find, and had prayed that he would somehow survive. This time, with him dying earlier, there had been no opportunity for that.\n“I went to the Burial Mounds, during the Siege,” Lan Wangji told him. “I wanted to help…but there were too many people. There was no way to help them.”\nWei Wuxian pressed closer, smiling softly. Of course his amazing husband would have tried to help.\n“I found A-Yuan, hiding behind a nearby tree. No one had seen him. They were not expecting a child to be there.”\nNo, of course not. They had gone there expecting an army, and had made do with a small group of the sick, elderly and weak. But a child? No one would have expected to find a child there.\n“You saved him,” Wei Wuxian said. “You took him back with you?” \nLan Wangji nodded. “No one saw. They were all preoccupied.”\nThough Lan Wangji’s face remained blank, and his voice even, Wei Wuxian could hear the anger there. He swallowed back his own pain, the memory of the family he had built for himself back in the Burial Mounds still bringing a sharp, stabbing hurt.\n“I am sorry.”\nWei Wuxian blinked. “What for?”\n“I could not do more.”\nWei Wuxian shook his head. He reached out, cupping Lan Wangji’s face in his hands. “Lan Zhan, you’ve already done so much. You’re really amazing, you know that? You saved A-Yuan and you…” He shook his head. “I really like you so much. I love you.”\nLan Wangji’s gaze softened and he leaned forward, pressing a kiss to Wei Wuxian’s forehead. “Mn. Love Wei Ying too.”\nWei Wuxian smiled and snuggled closer. Lan Wangji’s arms tightened around him, and he closed his eyes, feeling content.\n“Wei Ying.”\n“Mm. I’m so happy right now, Lan Zhan. Hug me tighter, okay?”\n“Wei Ying — your confession…”\n“Haha, I know I was being shameless, but you know me! I just had to speak my mind…” And there was no way he was going to let their first confession to each other be lost to a time that no longer existed.\n“I did not react appropriately.”\n“Hmm?” Wei Wuxian tugged himself away slightly so that he could peer at Lan Wangji’s face, frowning in confusion. “What do you mean? You kissed me, of course you did!”\nLan Wangji shook his head. He stood up suddenly, ignoring Wei Wuxian’s protests, and knelt in front of him.\n“Lan Zhan! Come back to bed, I’m cold,” Wei Wuxian complained, pouting.\nLan Wangji ignored him, and instead simply took his hands in his own, and met his eyes with a soft gaze of his own. The sight of it made Wei Wuxian’s words catch in his throat; even after years or marriage, his husband had never failed to take his breath away.\n“What you said — I…I too like you. Fancy you. Love you. Want you, cannot leave you…” Lan Wangji’s voice trembled, and Wei Wuxian could feel his own breath pick up, could feel tears stinging his eyes. “Don’t want anyone but you…cannot be anyone but you…”\nWei Wuxian nodded shakily, and leaned forward until their foreheads were touching. “I know, Er-gege.”\nLan Wangji pulled him into his arms and held him close, and Wei Wuxian allowed him to do so. He closed his eyes, basking in their closeness, and the warmth of the man in front of him. God, he loved him so much. \nThere was so much they still had to do. Jin Guangyao was still alive and scheming, the truth of Nie Mingjue’s death had not been revealed, Wen Ning was still out there somewhere…but they would deal with all of that soon. Right now, Wei Wuxian just wanted to relax into the comfort of Lan Wangji’s embrace, and remind himself that he was here, and that Lan Wangji would never be alone again.\nHe did need to tell him about everything that had happened though. They could deal with the rest later, but he owed it to Lan Wangji to tell him what had happened, and what he had already changed.\n“There are a lot of things I need to tell you, Er-gege,” Wei Wuxian told him. “A lot of crazy things, and I’m going to need you to trust that what I’m saying is true.”\n“Will always trust Wei Ying.”\nWei Wuxian ducked his head slightly. “Lan Zhan! You need to watch that mouth of yours, my heart is too weak to take this.” He took a deep breath. “Okay. So — what would you say if I told you we were actually married? And that I’d lived through all of this once, and…”\nLan Wangji watched him, his gaze displaying openness and trust that only a few people would have been able to see. \nWei Wuxian smiled, and told him everything. \n…\nHe’d barely had time to resettle back into the Cloud Recesses — his identity still a carefully concealed secret, even though Wei Wuxian and Lan Wangji had both agreed to tell A-Yuan soon. Without the crippling fever that had struck him during his childhood in the previous timeline, A-Yuan still remembered enough about his original family, and his time with his Xian-gege, and Wei Wuxian longed to tell his son who he was — before Jiang Cheng and Jiang Yanli had stopped by for a visit, unable to stay away any longer.\nThey had been discrete with their arrival, not wanting to draw too much attention to who they were visiting, or have people question why the Leader of the Jiang Sect and the mother of the Lanling heir were visiting a supposed lunatic who had been kicked out of the Jin Sect.\nWei Wuxian took one look at Jiang Yanli and promptly burst into tears.\n“Idiot, why are you crying?!” Jiang Cheng demanded. “We’re the ones who have been mourning you!”\n“Shijie!” Wei Wuxian sobbed, throwing himself forward at her. She immediately caught him in a tight embrace, and Wei Wuxian vaguely realised that he was now only slightly taller than her. It didn’t bother him as much as he would have thought. It reminded him of a time when they’d been very young, and his big sister had still been taller than both he and their brother.\nHe knew his tears were soaking her dress, but he couldn’t bring himself to pull away. She didn’t seem ready to let go anytime soon either, pressing him close and murmuring, “A-Xian, oh A-Xian…” over and over.\n“Oh sure, just forget about me,” Jiang Cheng grumbled. “I’m just standing right here.”\nWei Wuxian pulled away slightly, wiping his eyes, and smiling shakily. “That’s right. You are right here.” After everything they’d been through, after any hope of getting his brother back had seemed impossible, Jiang Cheng was here. He was happy to see Wei Wuxian alive. He wanted him to be alive.\nThe thought sent Wei Wuxian into another round of near-hysterical sobs, and Jiang Cheng looked slightly panicked. Wei Wuxian didn’t care. He flung himself forward, wrapping his arms around Jiang Cheng, who, despite letting out a series of loud protests, didn’t actually seem that eager to escape.\nAfter a brief moment, his brother simply huffed and returned the hug. If he wrapped his arms around Wei Wuxian a little too tightly, and if he could feel something wet on his shoulder, well, Wei Wuxian could refrain from teasing his brother this time. He felt another pair of arms wrap around them, and a glance to the side revealed Jiang Yanli, staring at them as if they were the most precious things she had ever seen.\nHe had his family back. His brother, his sister, his son, the love of his life. They were all here together, and despite the uncertainties and the struggles that the future would surely bring, the thought was one of the most comforting things Wei Wuxian had ever felt.\nStill, he could put aside what was to come, but even with his usual attempts not to dwell on the past, he couldn’t ignore the pain that he had caused before his death. His sister deserved better than that. He had caused Jiang Yanli immeasurable grief and anguish by taking her husband from her and leaving her child fatherless, and as if taking a blow that hadn’t even been meant for her would ever make up for that.\n“Shijie,” he said, “I’m so sorry…”\n“Oh A-Xian.” She reached up to cup his cheek. “You’re alive now, and that’s what matters.”\nHe shook his head. “No. I — I’ve hurt you so much. I don’t deserve this…you should hate me. What I did to you and Jin Ling — I killed your husband…”\nJiang Yanli swallowed, and there was pain in her eyes. “Yes. A-Xuan’s death…it hurt. It still hurts. But I could never hate you A-Xian. How could I ever feel anything but love for my XianXian?”\nHe was still shaking his head, protests pouring from his lips. He didn’t deserve this, didn’t deserve Shijie’s kindness, her understanding. He’d torn apart her family, she should hate him…\n“A-Xian. I know you. I know there has to be more to it.” Her lips trembled. “I know there were things that my husband’s sect was hiding. Things that just didn’t add up…something happened, didn’t it? They told us that you had attacked him, that you'd killed him, unprovoked, in cold blood, but I know that didn’t happen. If nothing else, I know that you would never hurt me that way. A-Xian, I know.” \n“Jin Ling — ”\n“Knows that his father was a brave, amazing man who loved his family,” Jiang Yanli said, cutting off his protests. “And he may be upset with you, because as much as I’d want to, I can’t stop what he hears from those around him. But from me, and from A-Cheng, he knows that his Uncle was kind, and selfless, and loved his brother and sister. And though we may not know exactly what happened that day, he never would have intentionally set out to hurt our family.”\nWei Wuxian trembled. He could feel the tears rolling down his cheeks, and the urge to cry was so strong. He was afraid that if he kept going now, he would never stop.\nHe had missed her so much. \n“Just stop being an idiot, and worry about yourself for once,” Jiang Cheng told him. “You died. You — you made us watch you die. I should break your legs for that.”\n“Shijie won’t let you.”\n“Stop hiding behind A-jie! I mean it! Put us through anything like that again, and I’ll make you sorry!”\n“I won’t go and die again,” Wei Wuxian said, pouting slightly. “I wouldn’t leave Lan Zhan again.”\nJiang Cheng groaned and Jiang Yanli giggled softly.\n“I’m glad,” she said, smiling. “Second Master Lan loves you a lot A-Xian.”\n“You sound like you know Lan Zhan well, Shijie,” Wei Wuxian said, confused. He didn’t think they’d ever met officially. \n“You loved him,” his sister told him, and yes, he’d told Lan Zhan that in front of all of them, hadn’t he? Right before he died. “And he loved you. He understood our grief…not many people did.” She looked sad. Wei Wuxian swallowed, feeling a pang of guilt at the thought of what he’d put his loved ones through.\nJiang Cheng sighed. “Stop making that face. Just don’t do it again.”\nWei Wuxian smiled shakily. “Aww, is A-Cheng worried about me?” \n“Who’s worried about you! And don’t call me A-Cheng!”\n“Shijie! Jiang Cheng’s being mean to me!”\nJiang Yanli laughed. “How old are you, A-Xian?”\nWei Wuxian grinned. “XianXian is three!”\n“I think three is too old, don’t you? One sounds better.”\nWei Wuxian ducked his head slightly. “If that’s what Shijie wants.” \nJiang Cheng shook his head. “God, you never change, do you?” he asked, though his voice was fond. \nWei Wuxian leaned back, taking in the sight of both his siblings, alive, well, and standing by his side. He knew that there was still a long way to go. There were still so many things they needed to deal with, and he was still unsure how much he wanted to tell them about exactly what had happened to him.\nBut he was here now, and the people that he loved were with him. Soon, Jiang Yanli and Jiang Cheng would head off, but the promise of their return would remain with him. Soon, he would be able to tell his son the truth, and see shock fade to desperate hope, as Sizhui pulled him close and murmured, “Xian-gege,” over and over. Soon, he would return to his husband, and bask in the warmth of that familiar golden gaze, and his comforting, loving embrace. \nWei Wuxian was happy, and hopeful, and this time, he would make sure that his family were safe."
}