{
    "id": "21383983",
    "url": "https://archiveofourown.org/works/21383983?view_full_work=true",
    "author": [
        "Haicrescendo"
    ],
    "title": "To Take Pride",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Avatar: The Last Airbender"
    ],
    "relationships": [
        "Iroh & Zuko (Avatar)",
        "The Gaang & Zuko (Avatar)"
    ],
    "characters": [
        "Zuko (Avatar)",
        "Iroh (Avatar)",
        "Sokka (Avatar)",
        "Aang (Avatar)",
        "Katara (Avatar)"
    ],
    "additional_tags": [
        "casually beautiful zuko",
        "oops it’s definitely child abuse",
        "zuko is Not Fucking Around",
        "appa is consistently dirty and zuko is salty as hell about it",
        "HOW COULD YOU LET HIM GET LIKE THIS???",
        "a rage-filled manifesto as written by zuko",
        "real talk tho appa is like the dirty harriet of sky bison",
        "the crew is ride or die",
        "abide by the rules of hospitality or perish",
        "oops the author can’t help adding fiber arts to everything",
        "zuko is bigger and SO IS HIS PAIN",
        "so is his voice",
        "uncle takes looking after his kid SUPER SERIOUSLY",
        "childhood nightmare fuel",
        "zuko can never remember that his alias is li",
        "and consequently never answers to it",
        "its a beautiful day on the jasmine dragon and you are a horrible son",
        "Alternate Universe - Canon Divergence",
        "uncle just wants his precious child to MAKE SOME GODDAMN FRIENDS",
        "hand waving canon because fuck it",
        "zuko has no chill",
        "and is fully prepared to throw hands"
    ],
    "language": "English",
    "series": "Part 2 of What We’re Given",
    "published": "2019-11-10",
    "completed": null,
    "words": "6,679",
    "chapters": "1/1",
    "comments": "339",
    "kudos": "15,545",
    "bookmarks": "999",
    "hits": "110,721",
    "summary": "<p>It’s a beautiful day on the Jasmine Dragon, the sun is shining, and Zuko has a Bad Feeling about it.</p>\n<p>Or,</p>\n<p>Zuko’s casual treason is interrupted by the Avatar, who is a child and a Pain In The Ass.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": " \n \nThe Kyoshi market isn’t massive, but it’s bustling and filled with stalls and vendors and carts. Aang might have been overwhelmed if not for Katara and her shopping list. He doesn’t even really wanna be shopping, but Katara had  asked  and Aang couldn’t really refuse her even if he’d rather be trying to ride the elephant koi instead.\n \n“This is a good price on— Aang?” Katara turns and asks when he doesn’t answer.\n \nAang’s staring at a stall run by an old woman. She’s selling all manner of knitted goods: socks, hats, sweaters all in shades of creamy white and light brown.\n \n“You like, young man?” she asks. “This is the best mink-alpaca you can buy.” Aang steps forward and picks up a hat in his hands, rubs the fiber between his fingers, squeezes. His expression is unreadable and that more than anything else has Katara wary.\n \n“Where did you get this?!” he demands, “Where?”\n \n“Now, now, don’t be bossy,” the woman tells him, “It’s not a secret. I buy every few months from a young gentleman; their floating tea shop docks at the port every so often. He’s a noisy thing but his fiber supply is impeccable; spins and knits like a dream.” She frowns. “Are you gonna buy that hat?”\n \nThey don’t buy the hat, but Katara watches how Aang’s eyes don’t leave her stall until they’re completely out of sight. It’s only then that she asks, \n \n“What was that?”\n \n“...That  wasn’t mink-alpaca,” he says quietly. “It was sky bison fur. I’d know it anywhere. At the temples, all the monks would have to take turns to brush the bison and sometimes the nuns would knit it up. It looked and felt just like that.” Pleading grey eyes lock onto her. “I know we’ve got places to be, but I need to find that tea shop she was talking about. If there are bison…”\n \nThen there might be more Air Nomads. Katara follows his train of thought, and isn’t sure she likes where it goes. \n \n“Aang, it’s been a really long time, though. What if you’re wrong?”\n \nShe doesn’t want this to be what breaks his heart again. Not after the temple.\n \nBut she also can’t tell him no.\n \n“I think we need to ask that lady a few more questions about that floating tea shop.”\n\n\n\n \nIt’s a beautiful day, the sun is shining, and Zuko has a Bad Feeling about it.\n \nHe’s got bad feelings a lot of the time and tries to be less shouty about them than he used to be; it tends to scare customers. They’ve got a solid base of people in most of the local ports that know what he’s like and won’t get run off but newcomers… well, if Zuko scares off too many newcomers, then it’s back to more proverbs and soothing tea with Uncle.\n \nWell, he’d be lying if he said that tea hadn’t grown on him, but not the quiet blends that he ends up with when Uncle thinks he needs a time out. \n \nIf Zuko’s going to drink leaf juice, it’s going to have some flavor, damnit.\n \n“Sir?”\n \nCrap, his face. Zuko fixes his expression to a marginally less surly one and scowls at Lieutenant Jee watching him from behind the counter.\n \n“It’s probably nothing,” is what Zuko was going to say, except that there’s suddenly a loud  thump  that reverberates through the Jasmine Dragon, and then Zuko’s flying out of the shop to see who  dares  to try and fire on them—\n \nAnd stops.\n \nThat’s a bison.\n \nNot that it’s super unusual to see a bison these days, not for him, but Zuko hasn’t planned on going back to the sanctuary for a few more days, since he received the all-clear hawk from Min yesterday, but he’s not used to seeing one off the island. And this one is…\n \n Different .\n \nIt’s bigger, and Zuko can pick out subtle differences in the shape of the tail and the brown arrow markings down the animal’s back, but it’s still  definitely  a sky bison.\n \nA sky bison that  knows how to fly , considering the saddle and the people perched atop it. A kid wearing orange and yellow slides down to approach him but Zuko walks right past him to the bison. He doesn’t think twice about pulling an orange out of his pocket and offering it to the animal, using the opportunity to check its teeth and general health.\n \n“Hey!” The girl still in the saddle calls down to him, “What are you doing?”\n \nZuko raises an eyebrow.\n \n“Giving him a treat so he’ll let me check his feet.”\n \n“Why would you—“\n \nZuko picks up one of the six large feet without hesitation and peers closely at the pads, checks between toes, pulls out a few burrs; he scowls.\n \n“He’s dirty.”\n \nThe boy looks like Zuko’s just dumped a bucket of water on him.\n \n“He’s not dirty!”\n \n“He’s dirty,” Zuko insists and runs his hands through white fur to make a point; they catch in tangles. The boy in blue barks a startled laugh like he can’t help himself. “Who are you, anyway? How did you find—“ \n \n Spirits, Zuko,   use your brain . \n \nYellow and orange, bald,  blue arrow tattoos.  \n \nZuko feels the color drain out of his face, and he stares, frozen and cold, back at the Western Air Temple and seeing all the small bodies piled up against the wall. They’d been wearing yellow, too.\n \nAir Nomad child.\n \n“I can find anything!” The boy brags, not noticing how Zuko’s turned into a statue. “I’m the Avatar, after all!”\n \nZuko feels like he’s drowning. He can’t breathe, he can’t think, all he can do is—\n \n“ Uncle !” He hollers at the top of his lungs and stomps his way back into the Jasmine Dragon, past the customers, all the way to the back of the shop where he can collapse on a floor cushion and bury his face in it. “Please go outside and— and—“\n \nAnd do something. Anything. Deal with it so Zuko doesn’t have to, because he had genuinely thought that he was over this. He’d given up his death mission, accepted that he could never go home. Accepted that home wasn’t what he’d thought it was.\n \nAnd now here was the Avatar, right on his doorstep, and Zuko cannot handle it.\n \n \n\n\n\nToday is not going the way that Sokka had thought it would go. He thought that this would be a quick, in-and-out, sorry-for-your-trouble kind of trip, but thanks to Aang and his need to follow every butterfly, and Katara insisting on indulging that need, here they are.\n \nThe tall, grouchy-looking kid with his dark hair tied up, and the  nasty fucking scar had stormed away roaring for his uncle and hadn’t been seen since.\n \nThe uncle, on the other hand, is giving Sokka a  vibe .\n \nHe doesn’t look like anybody special. Short, kinda stout and portly, mellow expression, and had brewed them a hell of a tea. Sokka doesn’t know what’s in it but he  swears  that he can taste something that reminds him of the South Pole.\n \n“Salt.”\n \nSokka jumps.\n \n“What?”\n \n“You were staring into your teacup as if it held the secrets to the universe. The secret is salt. Just a bit with the cloudberries.” The old man speaks carefully and Sokka narrows his eyes. He smiles. “It’s been a while, but I recognize the look of children from the poles.”\n \nSokka takes an appreciative sip.\n \n“How did you know?” Katara asks, leaning forward.\n \n“Blue clothing, dark skin and hair. The Southern tribe, I presume? And I couldn’t miss your wolftail, young man.”\n \n Nobody  recognizes Sokka’s wolftail. Ever.\n \n“Who was that kid?” Aang asks. “He looked a little...tense?”\n \nThat’s one way to put it.  That kid  had looked freaked out of his mind. He’d come out looking ready for a fight but the minute he’d put eyes on Aang, he bailed.\n \n“My nephew.” The uncle doesn’t name his nephew. He doesn’t name himself, either.\n \n“This is uh, a pretty interesting place to sell tea, huh?”\n \n“It is, isn’t it?”\n \nMan, the Water Tribes make a proper damn boat, with wood and sails and— Sokka stills. Uncle takes a sip of his own subtly salty tea.\n \n“This is a Fire Nation ship.”\n \n“It is, isn't it?”\n \n“...You’re Fire Nation?”\n \nAang spits out some tea, and Katara looks like she’s going to be sick, but Mr. Uncle looks...pleased? Or smug, Sokka can’t tell. The point is that he knows immediately that he’s  right . Who the hell else would have gold eyes like that? And now that Sokka’s looking, most of the staff look like they could be Fire Nation too. Salty and sea-soaked, possibly military...and definitely here. \n \nThey’re also  definitely watching how the conversation unfolds, despite the presence of customers. Customers who don’t seem at all uncomfortable with the fact that this is definitely a Fire Nation ship, despite the amazing tea. Guh.\n \n“One can be many things,” Mr. Uncle goes on, “One can be one thing, depending on your perspective. What is your perspective, young tribesman?”\n \n“I’m looking for a bison!” Aang pipes up, ignores the slap Sokka gives to his own forehead.\n \n“I believe that you have a bison. You received a complimentary inspection of your bison by my nephew.”\n \nSneaky old teamaker.\n \n“He’s looking for  other  bison,” Katara interjects like she can make this make sense, which she  can’t,  “We were at the market, and there was a lady selling clothes of sky bison fur. Aang was—  we  were hoping that you’d know where we could find them. She mentioned your nephew and…well, if there are more sky bison, maybe there are more Air Nomads too. If there are, we have to find them!”\n \nSokka’s not sure what does it, but Mr. Uncle’s face goes serious and sad, and for a moment all he does is stare into his teacup. Aang looks like he’s going to start talking again, but Sokka digs an elbow into his side. \n \nWait. Listen. Don’t say anything you can’t take back.\n \n“I’m sorry,” the man says, “I am but a simple teamaker. Certainly, if I knew any Air Nomads, I would send you to them.”\n \nAnd that...doesn’t say he hasn’t  seen  any, Sokka notices. Which, remembering what they’d seen at the last temple, might be for the best. \n \n“Can your nephew help us, then?”\n \nGolden eyes close in an almost flinch. Not quite, but nearly, and then a hand comes down to touch his shoulder, startling all of them but Mr. Uncle.\n \n“There are no more Air Nomads,” Angry Nephew says quietly. He looks rumpled and stressed and he needs to retie his hair, but he’s noticeably calmer than he was before. “Trust me, I’ve checked. All but...all but the Southern Temple. There are no more Air Nomads. Only bison. Sorry that we couldn’t be more helpful. Good luck on your mission.”\n \nAnd that’s about the most polite way that Sokka’s ever been told to get the hell out, and he knows for a fact that it’s way too polite to get through Aang’s hard head.\n \n“But are you  sure ?”\n \nAnd Angry Nephew flinches just like Mr. Uncle. Clenches his fists. Releases.\n \nSokka tries really, really hard not to stare at his face.\n \n“Yes,” he growls, “I’m sure. I’ve checked. No nomads. Only bison. Now,  please , be on your way.”\n \n“Nephew—“\n \n“ No ,” Angry Nephew says. Sokka has got to get an actual name for the guy before that moniker sticks. “No. I can’t. No.”\n \n“Very well,” Mr. Uncle replies gently. “You don’t have to.” \n \nAngry Nephew stomps back off, and Mr. Uncle turns to them and bows.\n \n“Chatting with you has been a delight,” he says. And then  winks . “If I were you, I would remain wherever you’re camped for another night. The sunsets around here are lovely.” \n \nAnd that’s an even more polite dismissal than the first, and one that they have no excuse not to listen to. Mr. Uncle doesn’t charge them for the cloudberry tea and even waves to them as they climb up on Appa.\n \n“Well, that was a waste of time,” Katara mumbles at him. \n \nSokka shakes his head, “I’m not sure that it was?”\n \n \n“They’re gone, Prince Zuko.”\n \n“I know.”\n \nZuko managed to finish his shift without yelling too much or scalding everyone’s leaves, but it was a near miss. Uncle finds him facedown on top of his bed, face buried in his pillow. He feels, more than sees, Uncle sit down, the mattress shifting under him, feels a hand brush the top of his head, carding gently through his hair. It’s gotten long since he’d cut it that first time, when they’d made the decision to decommission the  Wani . He hasn’t cut it since.\n \n“Are you going to help them?”\n \nUncle’s so good at finding exactly the right questions that Zuko doesn’t want to think about.\n \n“I can’t help them, you know that. They’re looking for  people,  and I...I can’t give him that.” Zuko turns his head and peers out of his self-inflicted smothering. “I’m the  enemy  .  Our people  did that.”\n \n“But you are not the enemy. You didn’t do it.”\n \nZuko doesn’t know how to explain that it doesn’t matter, that he knows full well that he’s a hundred years too late but it still doesn’t matter. He still feels the shame of it that it happened at all. Uncle calls it responsibility and says that it’s a good thing. Jee calls it self-flagellation, and that it’s a pain in the ass. All Zuko knows is that it  sucks. \n \n“And besides, they know we’re Fire Nation.”\n \n“Lots of people know we’re Fire Nation.”\n \n“Okay, but most of those people aren’t the  spirits-damned Avatar  . Who’s like...ten. Fire and steel, Uncle, he’s a  kid. ” Zuko feels sick all over again. He hasn’t thought about the Avatar in almost three years, but even before he’d cast the mission aside and given up on ever going home, he’d pictured the Avatar to be an old man, crafty and masterful and wise. Definitely not a child.\n \nAnd that means that, if he ever sees him again, he cannot ever tell him about the temples. \n \nEver.\n \n“All the more reason to consider it. You may not be able to give him his people back,” Uncle continues, “But maybe you could show him the island.”\n \nThe island that half their crew takes care of, keeping the bison fed and in good health and making sure the new calves (new, precious, absolutely adorable calves) are being parented well. They haven’t had many bottle babies, but sometimes it’s still necessary, and luckily they haven’t had the need in several seasons, but that’s what Min’s messenger hawk correspondence is for.\n \nZuko returns to smothering himself.\n \n“Besides,” Uncle continues, “Wouldn’t it be nice to get a closer look at the Avatar’s bison? He looked awfully healthy. Bigger than the ones at the island?”\n \n“He was  dirty,  and you know it,” Zuko grumbles. “Don’t pretend like he wasn’t. It’s like they don’t think that brushes exist.”\n \n“Then, perhaps, maybe the boy would appreciate some guidance on proper care, to keep him from getting so dirty. It’s a difficult life on the road.”\n \n“You’re not cute, Uncle,” Zuko grumbles. Iroh chuckles and continues to smooth down dark hair. Zuko’d given up years ago on pretending that he didn’t find the gesture comforting.\n \n“Maybe you could even see him fly.”\n \nAnd that’s a thought. \n \nFor some reason, none of the wild bison fly. None of them know whether it’s because they were never taught, or whether it was frightened out of them generations ago, or if...if there’s something wrong with them. All the information they’d been able to find had said that sky bison were the first airbenders, and everyone knew that they could fly. But Mochi couldn’t fly and the newest babies, Daifuku and Karaage and Omurice, couldn’t fly. Not a single bit.\n \nMaybe if Zuko could  see  it, it would help.\n \n“Ugh.”\n \nHe’d been got again and the slippery old dragon knew it, too.\n \nBut it didn’t mean that Zuko was happy about it.\n \n \nIt’s a beautiful morning, the sun is shining, and Sokka has a Bad Feeling about it.\n \nHe trudges out of the tent and knows exactly where his bad feeling came from, because there’s Angry Nephew with a bag over his shoulder, running a wooden brush through Appa’s thick, white fur.\n \n“Oh spirits, Mr. Uncle was  right .” He doesn’t speak loudly but his voice carries anyway, because Angry Nephew gives an irritable twitch and turns his way. His hair is braided up the sides and tied up in the back to get it out of his face, and he’s dressed in rusty browns that border suspiciously close to red.\n \n“Please don’t call him that.”\n \n“Gladly,” Sokka tells him, “Once you give me a name for him. For you, too, because in the nature of honesty, I’ve been calling you Angry Nephew in my head since the second I met you.” Angry Nephew glares and pinches the bridge of his nose like that’s enough to ward off the headache Sokka’s giving him.\n \nSokka knows for a fact that it won’t work; he’s talented like that.\n \n“You can call me Li,” he says finally, “As for Uncle…” he sighs, “Oh, whatever. Just call him Uncle. He’ll love it.”\n \nWhich is not entirely surprising, but Sokka’ll take it; he doesn’t have any uncles anyway.\n \n“So, uh, Li, what exactly are you doing here?” Li has to be a made up name, too. Who the hell names their kid Li?\n \nLi shifts his bag and scowls at the sky. Maybe that’s the only expression his face knows how to make? Sokka tries really hard not to look at the scar. It’s  gnarly  . He also tries very hard not to think about how something like that happens to a  Fire Nation kid .\n \n“Hey, it’s you!” Aang bounces out of his tent, perky and annoying, and Sokka relishes in poking his thumb towards Li with a smirk.\n \n“Apparently his name is Li.”\n \nIt’s  got to be a lie. Nobody twitches like that at the sound of their own name.\n \n“What are you doing here, Li?”\n \n“If you don’t have anywhere you need to be immediately, and you have a few days to spare, I thought I could show you the bison.”\n \nAaaaaand there Aang goes after another butterfly. Sokka can see it all over his face, and there Katara goes after him. Fuck it, he’s not fighting it. It’s not like they have anything important to do or anything, like finding Aang, and his sister, a waterbending teacher. No big whoop, time to chase some butterflies.\n \n“Under  one  condition,” Li continues firmly. Sokka’s not sure the guy has ever had any fun in his life. “I want to see your bison fly.”\n \nA huge smile takes over Aang’s whole face.\n \n“See him fly? I think we can do better than that.”\n \n-\n \nZuko doesn’t know if he likes flying. It’s fascinating but also slightly horrifying because how does something  that huge  manage to get off the ground? But also because for all the years that he’s cared for the bison they were able to rescue from the temples, he’s never seen them so much as lift off an inch. He’s also  positive that the Water Tribe boy is laughing at him, practically lounging in the saddle while Zuko clings (definitely not desperately) to the sides and tries not to die.\n \nThis is some precarious bullshit and cannot possibly be safe.\n \nZuko  never  thought that he’d miss being on a boat but here they are.\n \nThe Avatar’s sky bison is named Appa, and Zuko spends the first twenty minutes of the trip anxiously pulling out the loose fur that he can reach, twisting the tufts of white in his hands out of habit, to keep it suitable for carding and, later, spinning. \n \n“You’re a good boy,” Zuko mumbles nervously to him, “Please don’t drop us.”\n \nSokka is  definitely  laughing at him, but Appa  is a good boy, and doesn’t drop them.\n \nEventually the uneventful flight settles him and Zuko allows himself to relax against the back of the saddle. Aang’s up front and flying, steering by way of reins on Appa’s horns, which leaves Zuko with the two Water Tribe children. \n \n“So, uh, Fire Nation, huh?” Sokka asks to break the silence, and catches Katara’s elbow in his ribs for his trouble.\n \n“ Sokka  !” She hisses, “Don't be  rude —“\n \n“It’s fine,” Zuko interrupts even though his face says clearly that it’s not fine at all, “It’s— it’s fine. It’s the truth. But we’re banished.”\n \n“Which means…?”\n \nZuko shrugs, scrubs a hand across his face.\n \n“Banished, exiled, whatever you want to call it. I had a...disagreement with someone powerful, and I paid for it.” It’s an old hurt but it’s still sore and soft, and Zuko tries to keep it to himself. He manages to keep his hand off his scar. “I understand that you likely have a bad impression of my people, but you have nothing to fear from me and my crew. We’re just trying to make a living.”\n \n“Is that why you were selling bison fur?” Aang asks.\n \n“It’s easy to spin, and it’s easy to knit. It doesn’t shrink when you wash it, it resists water, and it’s warm,” Zuko lists off his fingers, “And currently, I have a monopoly on the market.” Which doesn’t mean anything, really, because he has no intention of trying to cheat people with his prices. It’s supplementary income to help the tea shop. And it’s not like they don’t have plenty of fiber to spare. “Start heading south here,” he tells the airbender up front, “You'll want to go towards the island that’s ringed by the reef. You can’t miss it, but don’t go down until I give the okay.”\n \nIt wouldn’t do for them to get shot out of the sky before he’s got the chance to remind his crew that they’re friendlies.\n \nThey get within sight of the watchtowers, and Zuko wraps his hands around his mouth to carry the sound and  howls , once, twice, then waits until an answering call is heard. He nods.\n \n“Okay, we’re good to land,” he says. “Visitors are not, uh, common.” \n \nTo say the least, he thinks, and definitely not coming from the sky. He directs Aang where to land Appa and the moment those six feet hit the ground he’s the first to scramble out of the saddle and bound over to where Min’s already come down from the tower. \n \n“We weren’t expecting you for a few more days yet, sir,” the man says and isn’t covert about staring behind Zuko to eye their visitors. “Is that…?”\n \nZuko nods once.\n \n“The Avatar,” he replies shortly, “And the Avatar’s bison. They wanted to see the island.” Well, Aang and Katara wanted to see the island. Sokka just made smart remarks and roasted Zuko about his flight anxiety. “How’s everything here?”\n \n“Nothing of note, sir,” which was definitely written in Min’s last missive.\n \nZuko nods sharply and turns back towards their visitors, returns to them. \n \n“The bison are this way,” he says, and leads them to a massive cleared field that’s surrounded entirely by thick forest. In the distance, there’s a large wooden stable. “We try and keep everyone together most of the time, since that’s what they’re used to,” he tells Aang, who’s staring, wide-eyed, like he’s never seen anything like this in his life, “Of course, there’s a secondary stable across the island for anyone who needs quarantine or medical, or for any precarious bottle babies who can’t be introduced back into the herd yet.”\n \n“ Wow  ,” Aang breathes, “This is ...wow  . ”\n \n“How did you even get them all here?” Katara asks and watches Zuko perch himself easily atop the tall fence. “This cannot have been a short trip. Did you just ride on one and the rest followed?”\n \nSomething shifts in Zuko’s expression and he very slowly shakes his head.\n \n“No, uh,” he mumbles without making eye contact, “They can’t, uh, they can’t fly.”\n \nAang gapes in shock.\n \n“But they’re  sky bison !”\n \n“Tell me about it,” Zuko grumbles. “But they don’t, and they can’t. I brought you here in the hopes that Appa could help them. As to your question,” he nods to Katara, “It’s not as complicated as you’d think. They’re excellent swimmers and take a long time to tire. All we did was keep someone that they would follow on the ship and let the rest follow, while we towed a raft for when they would wear out or for the babies. Hold on.”\n \nFrom atop his spot on the fence, Zuko lets out a high whistle, and almost immediately there’s a thundering from a distance and without more warning than that there’s a herd of sky bison trying their level best to knock him off.  With love. \n \n“Hey, hey, settle down,” he tells Karaage, “It hasn’t been that long. Pushy monsters.” \n \nHe gives in to their determined and aggressive affection, and obligingly slides down to the ground where he’s better able to pat noses, scratch ears and horns, and accept slobbery kisses.\n \n“They’re friendly,” he tells Aang. The kid looks like if he doesn’t get to pet any of them, he might actually die. “Just don’t let them step on you.”\n \nEven Sokka, who’s been determined all day to not enjoy himself, ends up softening under the sheer amount of wholesomeness happening here.\n \n“That’s Udon,” Zuko gestures to the bison licking Aang on the head, “ Yes  , Mochi, I see you. Yes, you are a good girl,  now please stop eating my hair .” He scritches her ears. “Mochi was the first one I found. Well, I guess maybe she found me.”\n \nHe goes quiet and considering, rubs his hands to the skin in Mochi’s thick, furry ruff.\n \nAnd then Aang decides to open his mouth. \n \n“Hey, Li, what’d you do to get exiled?”\n \nZuko freezes.\n \nSokka and Katara go very, very still. They don’t know the landmine that just got walked on but the look on the other boy’s face says that it’s  bad.  And there’s Aang, still innocently petting Udon as if he hadn’t just asked the rudest fucking question that Zuko’s ever heard in his life. He’s stunned speechless for a good thirty seconds, and then suddenly but not unexpectedly he’s overcome with a wave of fury so potent he nearly starts steaming where he stands.\n \n“What the  fuck  makes you think you’re entitled to something like that?!” Zuko spits and recoils back away from the bison like he’s been struck, all the way to where his spine hits the fence. He slips through and keeps going, backing away so as to not  burn anyone by accident  . He very easily feels like he could, lightheaded with rage and  pain  . “How  dare  you?”\n \n”I— I didn’t mean—,” Aang stammers. Clearly he doesn’t know where he’s misstepped, but he’s not  stupid , but Zuko doesn’t want to hear it.\n \nHe says so.\n \n“I don’t want to hear it from someone who slept for a hundred years while the world fell apart,” he snarls, “I don’t want to hear it from somebody who can just  fly away  from all his problems. The rest of us can’t.”\n \nEven the ones who could fly away...didn’t.\n \nZuko digs his nails hard into his palms and  does not spit fire but it’s a near miss. His hands twinge but it’s not enough to override the pain that that single question brought on, like inviting someone to dinner and being robbed at swordpoint instead.\n \nHe has to get out of here. \n \n“I have to go.”\n \nAnd Zuko turns and bolts towards the second bison stable.\n \nAang, face pale and guilty and shocked, makes a move to go after him, but Sokka grabs his shoulder and holds.\n \n“Yeah, I don’t think so,” he says softly, “That’s probably a really bad idea.”\n \n“What the hell did you do to him?” Min snaps on his approach, eyeing Zuko’s hasty retreat and then focusing a hard look on their visitors. “Seriously?” He shifts his gaze from Katara, shaken but guiltless to Sokka, frustrated and equally innocent, to Aang. “He took a huge risk bringing you here and that’s what you pull?”\n \n“I don’t even know what I pulled!” Aang protests, “I just asked a question!” He chews on his lip. “I didn’t mean to make him mad.”\n \n“Next time, kid, just fucking deck him one; it’ll hurt him less,” Min grumbles and rubs at his forehead. “Ugh. What a mess.” He looks up. “What did you think he meant when he said he was exiled? That this is some fun little field trip while he waits to not be grounded anymore, like a little kid who stole cookies? This thing is  permanent , and it’s not something he needs badgered about. And if he won’t say it, I will: if you’re going to be disrespectful, you can leave. We won’t have it here.”\n \nSokka doesn’t say what he’s thinking, which is a solid protest of  but he   is   a kid . Li can’t be much older than he is, and Sokka can’t imagine being told that he’s not allowed to go home. He’s only now realizing what that means.\n \n“What do you mean, risk?” Katara asks. Min waves his hands at her.\n \n“Don’t worry about it. The point is that you are guests of our hospitality, and guests are polite.  He  has worked way too fucking hard to get this island to where it is, and  we  have worked way too fucking hard on keeping that kid off a ledge, and  none of us  will see him messed with.” That was outright threatening and Sokka swallows hard. Where the hell did these guys even come from? Sure as hell are  not  friendly neighborhood Fire Nation civilians. \n \nMin’s eyes are sharp, and he gives a tight smile.\n \n“Just be happy that I’m not Teruko,” he says, like that means anything, but all of them are suddenly grateful that whoever this Teruko is, she’s not here.\n \n“Can I...can I go say sorry?” Aang asks in a small voice. \n \nMin sighs, rubs his temples, lets out a deep exhale. Softens.\n \n“Later,” he says finally. “He’s not gonna be ready to hear it yet. Let’s see if we can’t find somebody to groom your dirty bison.”\n \n“Appa’s  not dirty !”\n \n \nZuko doesn’t want to go back out and see them again. \n \nHe knows that it’s shameful and childish to still be here nursing his injured pride (and heart, always his fucking  heart , every time) but he can’t make himself go back out and pretend to be normal. How can he, when all he wants to do is scream at the top of his lungs and burn something to the ground?\n \nHe’s not safe around anybody when he gets like this.\n \nUncle always says (and  Mom  always said, and that makes everything so much worse) that it’s okay to be angry and feel whatever he needed to feel, as long as he knew when to walk away before he hurt someone who didn‘t deserve it. \n \nSo he walked away, but he still hurts.\n \nZuko slumps forward and buries his face in soft, white baby bison fur. Omurice is the littlest calf on the island, and still spends most of her time with her mother, but it’s important that they get acclimated to being handled gently and often before they get too big. She doesn’t protest to this in the slightest, leaning into where his fingers are determined to find all her good itchy spots and occasionally slipping her bits of rolled oats and diced potato-choke.\n \nHe’s embarrassed at his outburst. Uncle would have been able to get his point across without  shouting  all the time. Uncle would have been able to take the hit without flying off the handle.\n \nUncle’s not here, and Zuko is a poor fucking substitute.\n \nHe hears footsteps behind him, suddenly, and can’t lift his head to see who it is. He doesn’t want to know and he doesn’t want anyone to see him like this.\n \n“Sir?”\n \n...Shit. Okay.\n \n“You trust too easily,” Zuko says without looking away from Omurice. She lips at his hands and rumbles at him. “You don’t know anything about me, or Uncle, or— or anything. For all you know, I could be a murderer, or I could be working for the Fire Lord, and here you are falling right into my hands. Have you even  thought about that? Are you stupid?”\n \n“I mean,” Katara pipes up, “You’d have to be a  really  good actor if that was the game you’re playing. So detailed, even organizing a bison sanctuary  just  to sell your diabolical plan? That’s some real dedication.”\n \nZuko can hear the smile in her voice without even seeing her, and he snaps his head up to glare at her, just in time to see Aang drop to a perfect 90° bow, hands properly but awkwardly shaping the flame.\n \n“I’m  so sorry,” the boy trips over himself to apologize, “I didn’t mean to be rude or make you mad. Sometimes I just...say stuff and I don’t think about it. Monk Gyatso always said that I was good at finding the perfect thing that didn’t want to be poked. I guess he was right. I’m really, really sorry.” \n \nThe Avatar is not only contrite but  sincere  . Zuko has heard a lot of false apologies in his life (Azula. Zhao. The vendors in the markets who pretend not to have wares to sell to him and his crew because of what’s written constantly on his  face  . His  father,  right before he puts Zuko on the ground, because if Zuko were  better  he wouldn’t need quite so much correction) but not a lot of real ones, and he’s not entirely sure what he’s expected to do with it. \n \n“Uh…thank you?”\n \nMin hides a laugh behind a cough and a grin behind his hand; Zuko glares at him.\n \n“You don’t have to  thank me ,” Aang says, frowning like Zuko’s said the wrong thing, as usual. “All you have to do is accept it or not. If you don’t, I’ll understand.”\n \n...That is not Zuko’s experience of how apologies work, but okay.\n \n“...I accept,” he mumbles eventually, tries to soothe his own nervous hands, right before he’s tackled by the Avatar in a tight, unexpected hug. He definitely doesn’t squeak in surprise, and he definitely doesn’t enjoy it. Hugs are only normal when they come from  Uncle , otherwise they’re weird as hell. Zuko very, very awkwardly pats Aang on the back and extracts himself out of his grip, scrubbing his hands through his hair and looking pointedly anywhere else. \n \n“If it makes you feel validated,” Sokka tells him, “Min got Teruko to take a brush to Appa, and she might still be shouting about it.”\n \nZuko snorts.\n \n“I  told you he was dirty.”\n \n“He’s not dirty!” Aang protests, “He’s...vintage! That’s a thing, right?”\n \nZuko stares. Sokka stares. Katara stares. Min doubles over on himself and laughs until he cries.\n \n  \nAppa is so happy to socialize with other bison that Aang stands by the fence and openly sobs a little. He’s such a good boy and so gentle with the baby calves, grooming them with soft licks and nudges, rubbing up on all the members of the herd that greet him, which is all of them. \n \nAt first, they seem almost afraid of him, like they know somehow that he’s different from them, but it’s not long before they’re communing and rumbling around, just like the bison at the temples used to. For a moment, Aang feels almost like he could be home, except that home had Monk Gyatso and the other kids and fruit pies and the island has Sokka and Katara and Li. Not substitutes, he thinks, but still good. \n \nLi’s watching their interactions too. He’d been tense at first, like he hadn’t been sure that they’d get along, but relaxed quickly upon the realization that this was a peaceful meeting.\n \n“Do you think that Appa can teach them?” He asks. Aang furrows his brows and mulls it over.\n \n“Maybe? Bison get taught to fly and bend the air by their moms when they’re little,” he says, “I know Appa’s not their mom, but he still might be able to.” Aang waves to Appa, big and wide. “Hey Appa! Yip-yip!”\n \nWith an obliging rumble, Appa lifts himself off the ground with a rustle of wind and a gentle slap of his massive paddle tail. The other bison stare, unmoving, like statues. Appa floats over to Mochi, nuzzles her on the ear, and grumbles in her direction. He moves his legs like he’s about to start swimming.\n \nAnd then Mochi slaps her tail harder than necessary and floats, just the tiniest bit, off the ground.\n \nAang’s so happy he bursts into immediate, startled tears, and Li…\n \nLi rubs furiously at his eyes and complains about dust making his throat hurt and his eyes water, because it’s  definitely dust and not tears making it hard for him to breathe. \n \nNo one calls him out on it.\n \n \nAll Zuko has in him when Aang and the others drop him back off at the Jasmine Dragon is a gruff goodbye, and he steadfastly doesn’t watch the bison slowly turn into a little white dot against the sky before disappearing entirely. He sits on the deck and lets himself breathe, letting the rocking of the waves and the ritual noises of the night watch soothe him into something like calm.\n \n“Did you have fun, Prince Zuko?”\n \nZuko doesn’t even open his eyes.\n \n“You don’t have to keep calling me that,” he points out. “Just Zuko, or nephew is fine. I’m a pretty sad excuse for a prince these days.”\n \nUncle settles himself down next to him, and tilts his head up to watch the stars. \n \n“Oh, I don’t know,” he replies. Zuko really doesn’t have to open his eyes to know that Uncle is grinning at him. “I think that being brave, and forthright, and doing the right things even when they’re not the easy things are all things that good princes should aspire to be. The strongest dragon—“\n \n“Allows trespassers, for he does not fear them,” Zuko finishes and opens his eyes solely to roll them. “You and your proverbs.”\n \nHe’ll go to the grave before he admits it, but he kind of  likes  Uncle’s proverbs. Not because they in any way make sense, and they’re annoying as hell, but they’re  Uncle . Annoying but in a good way, just like the man himself.\n \n“We groomed the Avatar’s bison,” he says absently. “Got about four bags worth. Teruko said she was going to start the carding process as soon as it was done washing, spin it, and send it over.”\n \n“And what are you going to do with it?” Uncle asks, genuinely curious. Zuko’s not an amazing spinner, but he’s as proficient in the processing as anyone else involved should be expected to be. He’s way better at using the fiber once it’s been spun, primarily because he has no idea how to relax and constantly needs something to do with his hands. Knitting has been an unexpectedly good outlet for him.\n \nZuko shrugs.\n \n“Who knows? I’m not sure how much of a market there is on—“ and here he snorts conspiratorially, delighting in the joke, “Dirty bison fur.”\n \n“Please tell me you didn’t tell the Avatar that.”\n \n“Of course I didn’t; it’s  definitely  the best mink-alpaca money can buy.”\n \nUncle Iroh laughs and laughs and laughs, and Zuko lets the edges of his lips tilt up in a quiet, secretive smile, pleased with himself. They sit on the deck together underneath the stars, listening to the soft little crashes of water against the side of the boat and the constant whirring of machinery, until the moon rises high above them, and Zuko allows himself to be shuffled off to bed.\n\n\n\n\n"
}