{
    "id": "21380770",
    "url": "https://archiveofourown.org/works/21380770?view_full_work=true",
    "author": [
        "AMournfulHowlInTheNight"
    ],
    "title": "A Helping Hand in the Dark",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Midoriya Izuku & Sensei | All For One"
    ],
    "characters": [
        "Midoriya Izuku",
        "Sensei | All For One",
        "Yagi Toshinori | All Might"
    ],
    "additional_tags": [
        "Alternate Universe - Canon Divergence"
    ],
    "language": "English",
    "series": "",
    "published": "2019-11-10",
    "completed": "2019-12-14",
    "words": "30,892",
    "chapters": "10/10",
    "comments": "973",
    "kudos": "8,938",
    "bookmarks": "2,905",
    "hits": "122,265",
    "summary": "<p>A month into possession of One For All and the whispers started, creeping up on Izuku as he slept.</p>\n<p>Izuku didn't know where they were coming from, but he was going to find out.</p>\n<p>Even if it had unintended side effects.</p>\n<p>Two shadows felled the woods. Did anyone hear a sound?</p>\n<p>Apprehensive of Quirks and testing.</p>\n<p>Nuance and application. More and less damage than brute strength.</p>\n<p>With every success there’s a failure.</p>\n<p>The exertion of force by means of a lever.</p>\n<p>For the treasonous.</p>\n<p>One can't game the system without installing the game and system first.</p>\n<p>The death of the party.</p>\n<p>Unexpected help from unexpected places.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>I’m not technically back yet, but I am moving faster than expected.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Still ahead of schedule.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>My net’s not going to hold out posting this.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>The most glaring typo for last chapter should be sorted. Slightly more reliable internet now.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>Full steam ahead!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>Still speeding along.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>Only two chapters to go!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>This is a persistent migraine, but only one left!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">notes</a>.)\n</p>\n<p>And it's finally done. This might get some mopping up after migraines have passed.</p>\n<p>My little project for my holiday. This will be a short one.</p>\n<p> <br>If anyone wants to have a gab at what else we do, please check out our blog: https://davidschmellingart.blogspot.com/2021/01/howl-joined-food-for-crows-team.html</p>",
    "text": "A month ago, One For All was a Quirk like any other. A month later, One For All was the Quirk that was driving Izuku crazy in his sleep. Constant whispers in darkness, the occasional sob, an endless muttering that wouldn’t stop. It never had the decency of being consistent either, with each sound new and freshly grating on Izuku’s increasingly frayed nerves. Izuku couldn’t sleep with the noise coming from the Quirk in his head that wouldn’t or couldn’t be quiet. It was an endless, underlying buzz that followed him to sleep. Never outside of sleep though. Only when he closed his eyes did it creep up on him.\nNot that Izuku regretted taking All Might’s offer. It wasn’t a chance he would have received from anywhere else. No one else cared enough to acknowledge Izuku’s dream let alone help him act on it. No one apart from All Might. It was Izuku’s responsibility to take this Quirk and iron out the flaws. He was going to make this work, even if the side effects were unpleasant. But still, that didn’t mean he couldn’t ask for help.\nSo Izuku did the only thing he could and told All Might about the rush of whispers and sounds. And, All Might reacted about as well as expected.\n“You’re hearing voices?!” All Might peered at Izuku from shadowed eyes. “Can’t say that ever happened to me.” Said a lot coming from someone who had the Quirk for consecutive decades.\n“Did... anything ever happen to you?” Izuku queried. There was always the slight possibility that Izuku was losing his mind. But hearing voices lined up suspiciously well with his acquisition of One For All. If Izuku was going to lose his marbles, then it certainly picked a convenient time to rear its ugly head. \n“I saw some shades once,” All Might shrugged, still pale faced. “But I never heard anything.” Shades? As in people shades?\n“Shades... So, someone or something might be in the Quirk?” A Quirk that was passed down to nine people. Something had clearly been left behind in the transfer. “It’s a stockpiling Quirk, right?” At least that’s what Izuku made of it. A Quirk passed down a line of successors. A Quirk so old it might have picked up a few quirks of its own along the way.\n“I dunno.” All Might scratched his chin. “I saw shades and my master seemed to think people survived within the Quirk somehow.” His face darkened. “I... never really had the chance to ask her about it, to tell you the truth.” Izuku wanted to ask why, but something about All Might’s taut expression suggested that now maybe wasn’t the best time. Not when All Might had just found out his old Quirk was screaming at his new student in while he slept.\n“Do you know why she thought that?” Izuku instead asked with a careful sidestep, feeling the dull ache of fatigue in his bones. The sooner they could figure it out the better. UA was going to be a disaster if Izuku couldn’t get his sleep together class started in earnest. \n“I’m guessing she at least saw the same shades I did. Maybe more.” All Might shrugged, his face pinched. “Either way, my deepest apologises, young Midoriya. I had no idea it was capable of being so disruptive.” All Might frowned. “Apart from the obvious strain,” Izuku saw All Might verbally backspace. Yeah, blowing people’s limbs off did come under “disruptive” as a behavioural description. An extremely downplayed one, but a description none the less.\n“It has to be coming from somewhere within the Quirk,” Izuku hummed. “I wonder if there’s some way of checking.” Some way of plumbing the depths of One For All and finding a mute option so he could sleep without the Quirk ringing in his metaphorical ears.\nAll Might frowned. “This isn’t really my area of expertise. I haven’t ever really had problems with One For All before.” Izuku really doubted All Might would be the way he was without some inherent grasp of the Quirk’s functions. It made sense that he, perhaps, had skipped over some of its less pleasant aspects. \nIt was clear as day that Izuku was no natural with the Quirk. There was no intuition to guide him on why a transferable Quirk would be screaming at him while he slept. Unfortunately enough, there was also no academic or scientific information as to why that was happening either. All Might had hid One For All well, as had all of his predecessors. There wasn’t anything online specifically to address this sort of problem, but maybe people with other types of Quirks had similar problems.\n“I can try looking online, I guess.” Izuku nodded to All Might. Almost everything about anything was online. There had to be something about digging through a Quirk on the internet. Probability was on Izuku’s side about there being at least a tiny indication to point him in the right direction.\nAll Might, who seemed to be imploding from a wince, eventually spoke. “I can... ask my old teacher a thing or two about these strange sounds... I haven’t spoken to him a while, but maybe he knows something from my master.” There was less hesitation and more what sounded like All Might about to engage on a cross country sprint to his expedited demise.\n“Oh no, you don’t have to-”\n“-Yes, I do, young Midoriya. I gave you a Quirk that’s preventing your healthy sleeping habits from occurring and now I too have to make an effort to correct it.” All Might clapped Izuku on the back and Izuku felt a surge of warmth.\nIt was a nice feeling.\nAt least until he remembered that he’d likely be perusing the Quirk Help subforum and held in a whimper. It was going to be a nightmare to filter the nuggets of gold from the surrounding material.\n \nIt was the same old dream. The same old nightmare. So real. Too real. There he lay, what was left of his face pressed into a pool of his own blood. The pool where All Might left him to drown the first time around. All Might hovering above him for the final blow. It was nothing new, but still, All For One shuddered. He couldn’t sob. There wasn’t enough left of him for that to be possible. And he waited for the end to come... except... it hadn’t. It was late.\nAll Might paused as though he’d been slapped with the pause button of the dream’s universal remote. His frozen form wobbled, wavered and faded away in a curl of shadows. In his place stepped a far smaller shadow, striding ever closer with no distinct features that All For One could pinpoint. A faceless, shadowy mass with none of All Might’s heft. “What now?” All For One muttered, dragging himself upwards with a battered body that was only a death away and resurrection from the reality outside of the dream. Not too far away considering the pain had never faded. It would never fade, even if he were to spontaneously regenerate tomorrow. Too much had been lost.\n“It worked? Is it you?” A voice whispered with a shrill ending. Was it a whisper? Or was it strain? Like the shadow was speaking from a stretching distance beyond the memories that created All Might.\nAll For One froze. That was... new. None of his dreams normally spoke, let alone spoke directly to him. It was rare to hear the voices of others. Some had faded with time. Others came and went on particular days. Others he’d never heard in the first place and likely would never have the opportunity of hearing in their lifetimes. All of them were ghosts. “Is what me?”\n“Are you the source of the noise?” The voice asked, its owner growing closer and finally, standing next to All For One’s kneeling form and it gasped before All For One could respond. “Oh... I... I didn’t realise that this is why...” Almost like All For One’s condition had upset the imaginary being. A shadow that didn’t exist. The shadow that didn’t exist had feelings. Or at least was extremely good at pretending it had feelings.\n“It seems my nightmares have progressed into full blown insanity. I’m hearing voices. I suppose I can finally add that to the resume,” All For One snarked at his newly acquired hallucination. More damage that All Might had done. He doubted there was a working cure for foaming at the mouth insanity. If there was one so reliable, he’d have used it on All Might years ago. Insanity was all that could be said of All Might’s behaviour. All Might who staggered towards him, taking no heed of his trailing organs. A true zealot. Skills to backup what Nana Shimura lacked.\n“But I heard you first!” The voice exclaimed. “I’ve been looking for why I couldn’t sleep. I looked online and people said meditation can help with Quirks that do weird things in their heads. I had to search Quirk Help on an image board and that was as enlightening as it was disturbing. I really don’t know how people make a hobby of reading that board with how many graphic accidents they talk about. It’s interesting, but I think mum would have a heart attack if she ever walked past with the page open, but the analysis is top notch.” Words spilled from the figure and if All For One’s vision wasn’t flicking between normal function and complete blindness due to the dream, he would’ve have obliged it with a double take. It was unusual in its level of detail.\nWith no forthcoming response it hesitated. “Ah, sorry. I’m excited. I wasn’t expecting this to work so soon.” It... a young boy perhaps? He. His hallucination was a male. “And I went searching and I found you here.” The voice sharpened, taking on tone and pitch. Voice filling out, All For One had a a better idea of the faceless, featureless shadow.\nHis mysterious shadow was a young, male child. All For One felt the world laugh at him. Of all of the hallucinations to experience, it was arguably one that hurt more than dying.\n“I find it somewhat odd that a hallucination purports to have heard anything or read anything online,” All For One sighed back.\n“I’m not a hallucination!” The boy snapped back with more glee than irritation. “I’m real!” Wasn’t that what all hallucinations said? Just another nightmare. Just another passing torment. “I can prove it!” Well, they normally didn’t purport to have evidence of their existence, but All For One was at the point of his life where anything was theoretically possible.\nThe shadow lunged forward, grabbing All For One by the arm and with a great effort (perfectly equivalent to that of a teenager on the smaller side) he was dragged to his feet. Still dripping blood, All For One could feel the figure next to him. Textureless, but with mass and heat. Form and mass without feature. How eerie.\nAll For One practically slumped into the shadow, the agony of the past no less real with its presence. But the shadow was wonderfully warm in the way his nightmares weren’t any he felt it pat him on the shoulder with its free hand. “My other nightmares feel real as well,” All For One muttered. Perhaps it was because the memory of death was so acute, but All For One could feel every shattered bone as though it had happened only yesterday.\n“This isn’t real, though,” the boy said quietly. Ah, there it was. An admission.\nAll For One felt an uncharacteristic surge of pity for the shadow. Was this what happened when his dreams took on lives on their own? They tried to help, only to become trapped in their own form of horror? “Of course it’s not real now,” All For One explained, senselessly to the faceless boy, “but that’s doesn’t make what happened in the past any less real.” Or traumatic. Or life altering.\nImmediately, All For One felt the boy stiffen under his arms. “This is a memory?”\n“Yes,” All For One confirmed. Because why not? It was unlikely to be the Quirk of another. His Quirk along had long deterred unwanted tourists from his mind. This boy had come from somewhere within and All For One’s stomach churned at the possibility. There was an extremely short list of possibilities and that only furthered his misery. “It doesn’t change anything.”\n“Yes it does!” The boy shouted in... relief. Why on earth was he relieved? “Because it’s a dream of a memory,” the boy excitedly explained and All For One, with the tried and true excuse of sleep deprivation behind him, stared blankly at his imaginary companion. \n“Meaning?” It was a reprieve, at the very least. A reprieve from his own suffering. His own arrogance. He wasn’t the only one who paid the price for his miscalculation, but at least it was something.\n“If this is a dream... all you have to do is wake up.” The shadow bounced and All For One tracked it up and down.\n“If only it was that easy.” All For One shook his bloody head, feeling it drip and splatter on the shadow who wasn’t the least bit bothered or taken aback. He’d already tried to wake up and not once had it worked. Just because he knew it wasn’t real didn’t mean the damaged part of his brain had made and acted upon the same realisation. He was trapped inside his own head for as long as the nightmare persisted.\n“But it is that easy. You might not have tried it yet,” the voice insisted, to All For One’s indignation. Of course he’d tried - with absolutely no success. “Here, let me try.” Try? \n“Try what?”\n“This.” There was a beaming smile and without warning, All For One was pinched on the arm by the ghost and snapped to awareness. \nSnapped to awareness in a world where his vision was filtered by infrared. Snapped to awareness in a world where he could still feel those phantom fingertips plucking at his skin. All For One ran his own hand over his wrist and shoulder but the sensations remained.\n“Sensei?” The doctor bustled over and All For One was... at a loss. This was a truly new experience, for the first time in years. \nThere was something in his head.\n“Doctor, I don’t suppose we’ve had any visitors since I’ve been occupied?” All For One couldn’t bring himself to add any sort of tone to his voice. While slightly better, the aching fatigue remained.\nThe doctor frantically shook his head, his head darting around as through glancing over his shoulder. “No, Sensei. Why do you ask?”\n“No particular reason. I had an odd dream and I wondered...”\nHe wondered why the distraught boy in the dream felt so real. How it woke him up. Why it could hear him. Why the boy was in his head in the first place.\nEventually, the doctor left and All For One dozed yet again. Infrared blinked off and his dizzying concoction of Quirks aligned in such a manner that his brain slowed in preparation for slumber.\nThen he slipped into glorious nothingness. All For One could only feel the residual heat from a boy who wasn't real and an odd sense of loss.\nHe doubted he would see him again. Good things never tended to last.\n \nIzuku bolted upright in bed in the wee hours of the morning and suppressed a shout of joy. It worked! It really was One For All causing a racket! He wasn’t losing his mind! Sweet vindication. Over what, Izuku wasn’t sure, but maybe it was his lack of confidence with an entirely different Quirk to the norm. Maybe it was that he seemed to have found a solution in the first place and beat the odds. Many in Quirk Help weren’t that lucky and paid the price for it in the long run.\nThe forums were clear that some people had similar problems, but not the same problem. Whatever they heard was usually related to some facet of their Quirk which had crystallised in a material form. That material form made itself known and the parties could negotiate whether in or outside of their head. Their Quirks were, after all, extensions of themselves. To meditate was to enter a space where they could address their disobedient manifestation of the Quirk. That was great for people who had always owned their Quirk.\nOne For All was different. One For All was the stockpiled energy (and potentially more?) of numerous wielders of the Quirk. One baton holder in a long line of relay runners, all sprinting down the track before the baton was handed off to another. Except this baton wasn’t an inanimate object, but each person left a piece of their power in the Quirk as it changed hands. Izuku was but one in the long line of runners. The Quirk was his now, but it hadn’t always been his which left the problem of Quirk History.\nWith no family to question, Izuku would have to grill the Quirk itself, which was a step beyond what anyone else in Quirk Help had experienced. It was seemingly beyond what anyone else who had ever held One For All had experienced and now the task had fallen to Izuku to somehow document these strange properties. All he had to do was probe the Quirk and hopefully answers would follow. \nHow that could possibly happen was beyond anything Izuku had ever seen, but some Quirks defied existence within statistics. Enough for Quirks like One For All to be deemed urban legends, because Quirks that could move from person to person weren’t meant to exist in the broader population. But One For All still existed, which meant it didn’t follow the standard rules. It made Izuku wonder if other Quirks with similar transferable properties could exist. If One For All beat the statistical cudgel, then maybe another Quirk like it had survived too.\nBut...\nBut even without One For All’s context, it did raise other searing questions that were eating away at Izuku who had a renewed sense of confidence.\nWho was the shadow apart from the other shadowy man?\nWho was the man in the pool of blood?\nAnd why was he in One For All?\nWhy did he think he was dreaming?\nWhy was there so much blood?\nWhy couldn’t Izuku feel any of it?\nWhy was the shadow reliving a past trauma inside the Quirk?\nWas he a ghost?\nA memory?\nA fragment of the Quirk itself?\nIzuku had absolutely no idea.\nBut he was about to find out.\nAnother night, another nightmare in regulation fashion. Plastered to the concrete, waiting for the end to come yet again. All Might rearing back to plant a final fist into All For One’s skull and All For One lay paralysed, waiting for impact. Boring if not for the flourishing reemergence of the PTSD symptoms. Right on time as well.\nThen All Might exploded into a puff of whispy black smoke and All For One’s symptoms vanished with it.\n“This must have been really traumatic,” the boy’s voice remarked and his shadow stepped into view. “It’s the same dream over and over again. No variation. Same event. Same timing. Same everything. Scary.”\nAll For One blinked. “You’re not real,” he whispered. It was a fluke the first time. Or so had been the perhaps error ridden assumption. One point of data was hardly enough to plot a trend. Two appearances though? Tiptoeing into territory where his senility was all but guaranteed. Not even the Quirk he had for this exact purpose was helping.\n“If I’m not real then you’re not real either,” the boy observed and All For One grimaced. What to do when the hallucination believed they were the one having the hallucination? Not much at all. It was every bit convinced that All For One was a hallucination as he was convinced the shadow was a hallucination.\n“Let’s pretend, for the time being, that both of us are real.” They could pretend that All For One wasn’t currently pelting on a steep decline towards neurological deterioration. His longevity Quirk had served him well all these decades, but not everything could last forever.\nThe shadow inclined his head. “I guess? Okay.” Then it perked up. “Hi. I’m... Izuku Midoriya and I’m trying to learn how to use my Quirk so it doesn’t break half the bones in my body. I worked out how to use it only recently, so it’s been... hard?” \nIzuku Midoriya. It called itself Izuku. Izuku who had a Quirk that was killing him. All For One felt what was left of his memory heart implode, shatter and fall to the floor. In reality, a fragile Quirkless child. In the dream, a fragile child with a Quirk that was capable of obliterating him. It was a sign. Even as a phantasm the poor child’s life was anything but perfect.\nAnd he hesitated, because associating with one’s hallucinations was poor practice in general. It was ill advised to fracture the barrier between reality and fiction. It would only widen. Cracks that would spread until the barrier entirely broke and what was left behind was a dizzying mix of the real and imagined. Not that it mattered. “Izuku” was here to stay with or without All For One’s consent.\nIt was telling that what he imagined was a child who would never meet or speak to him during the child’s lifespan. The best All For One could hope for was empty words at the boy’s grave. At least that much was risk free.\nYet he spoke anyway, for a chance of things that never came to be and would never come to be in his lifetime. An opportunity that reality would never provide without a price he wasn’t willing to pay.\n“I’m Hisashi,” All For One offered. There was another title he could’ve used, as if he had any right to it at this point in time. At this point he was little more than a financial sponsor to an unknown and disadvantaged child he was never going to meet.\n“Oh wow, that’s a coincidence.” The boy bounced. “Hisashi is my dad’s name!”\nAll For One struggled down a body shaking sob and nodded in a manner that did nothing to help his tremors, even while the boy dragged him to his feet.\n \nHisashi, as he called himself, was even more of a wreck than the first time Izuku had visited One For All. Even with his attacker dissipated, there was no smooth relief or joy, but an overwhelming sense of agony that permeated the whole vision. Hisashi, whoever he was, manifestation of the (a? A part? The whole thing?) Quirk, was utterly miserable. Miserable in a manner which immediately explained the sense of enduring shrieks that kept Izuku awake at night. This was not a happy Quirk component. Even Quirk Help, as full of wildly divergent trolls as it was, would agree with this elementary fact. This wasn’t normal, but then again, One For All itself wasn’t normal either.\nThe Quirk itself easily had to be over a century old. Maybe even two or three centuries if each holder made it to fifty or sixty and if they also received the Quirk as teenagers. All Might alone had the Quirk for at least thirty years or more (provided he’d also received it as a teenager) and that could be used as a rough benchmark for the age of the Quirk. Two to three centuries meant a lot of time for memories, both the good and the bad. One For All sounded like it’d been through a lot more of the bad than the good if Hisashi’s banshee wails were any indication. Especially the very very bad. The sort of horror that caused nightmares even for a dream locked deep within a Quirk.\nScientists said stress could change the DNA of human beings. Could those changes in DNA alter the composition of a Quirk as well? Did One For All contain its own genetic memory? It contained a form of memory and for that memory to be reliving its own death was... if Izuku was honest about it, it was confronting. There were stories buried deep within One For All that even All Might didn’t know about. Didn’t know about and didn’t want to know about if something terrible had also befallen his predecessor. But what could Izuku do? Hisashi had been maimed decades ago, quite possibly and there was nothing he could do to change past events. Nothing to stop the root of the memories. Nothing to stop the Quirk’s agony. It’d have to be something more contemporary.\nEven if Izuku couldn’t change the past, maybe he could help in the future? Hisashi had been at enough of a loss the first time around for Izuku to sleep peacefully. That seemed to be a sign that something was working. Could further decoy tactics derail the Quirk’s pattern in reliving the past? The Quirk Help subform certainly had no idea if anything could help a traumatised fragment of their own psyche, let alone the traumatised fragment of numerous psyches belonging to other people. But that didn’t mean he couldn’t try.\n“So!” Izuku began and hoped for the best. He didn’t have much else than hope at the moment. Quirk counselling wasn’t an exact science, let alone counselling a Quirk that originated and flourished in an entirely different person.\nIzuku didn’t know people, but he did know Quirks.\n \n“So!” The boy holding him by the shoulders bounced again. “Quirks. Do you know why mine is breaking my bones?” All For One wasn’t sure what floored him more. The fact that “Izuku” hadn’t also disappeared into the ether in the first place or that fact that he was discussing a Quirk. A Quirk which the real Izuku didn’t have and if he did have it, All For One was sure he’d have heard about it far sooner than the nearly fifteen years that had passed. He of all people should have known... but there were mistakes made evident from his past that he was by no means perfect in determining who did and didn’t have a Quirk. The bitter memory of that catastrophe was still taking a much savoured opportunity to beat him senseless every night.\n“As much experience as I have with Quirks, mind reading isn’t among my existing skillset.” Nor was much else. Centuries on and All For One himself could hardly handle the aggressive and unpredictable nature of modern Quirks. With more recoil, more side effects and more risk than ever, the modern Quirks had sped ahead in an arms race All For One hadn’t realised he was in until it was far too late. He could only imagine what would’ve happened if he did give the real Izuku one of those modern Quirks with that fragile body of his that took after his father. There wouldn’t have been anything left of the child. His little form would’ve crumpled like a piece of aluminium foil beneath a hydraulic press. There wouldn’t have been anything left to bury.\n“Oh, sorry. I draw from a stockpile of energy and I’m having trouble with control. Instead of being able to draw out a small amount, the whole amount pours out and-”\n“-And shatters your bones,” All For One whispered, his head bowed. Unpredictable. Uncontrollable. Aggressive. A modern Quirk indeed. Izuku’s shadowy counterpart who had a Quirk that sounded suspiciously similar to One For All. At this point it was less of a sign and more of a cry for help that All For One was stubbornly trying to ignore. All For One couldn’t be that person for Izuku. There was no help he could offer that wouldn’t result in condemnation.\n“Yes!” The boy exclaimed. “I’ve tried to ask for help, but the only other person I know with the same type of Quirk as mine never really had the same problem.” And therefore had no idea how to help someone who was carrying the same level of energy as a nuclear bomb. All For One didn’t even bother to hold in the sigh. It was a death sentence for anyone let alone someone with Izuku’s qualities.\n“Talentless hack,” he uttered. How did people live their lives with no comprehension of how an extension of their own body worked?\n“Oh no no, it’s just he...” The boy seemed to fumble, as if the struggle was more with finding the words than any perceived insults. “I think his body handled it a lot better than mine. I have a birth defect and I’m not exactly... regular per say.” A birth defect? That didn’t line up with what he’d been told about Izuku by his mother and the doctor. Then again, this wasn’t exactly real. There was some deviation to be expected from the latest of his mental tortures. Perhaps his brain, in the midst of its damage, was trying something new. Like dreaming of a child with a debilitating genetic abnormality that most certainly hadn’t originated from the mother. How quaint.\n“Yes, that does pose a difficult problem,” All For One sympathetically offered to hallucination. Their shared defect of being superseded in a new world, whether it was real or not.\nBoth he and Izuku’s shadow were struck down by the same teething issue. How to manage a Quirk that wasn’t designed for the body it occupied? The boy was drawing from an energy store. Instead of only drawing out what he could physically handle, the full extent of the Quirk was manifesting behind his control, as newer Quirks tended to do. But first, the nuance.\n“Where does the energy manifest when you draw it out?” Warm. Izuku’s shadow was still wonderfully warm. All For One could feel his phantom pains recede the longer he held onto the boy. Was the real Izuku this warm? Or was it a trick of the dream? The real Izuku had to be warmer.\n“Well, normally I focus it to where I need it, but...” The boy shrugged. “It only showed up recently.” All For One had no doubt that little Izuku would’ve been thrilled to sprout a Quirk from nowhere, but the information embedded in that comment was what he needed.\n“I think I see the problem.” It was a simple problem for All For One at least. “Your conceptualisation of the Quirk is incorrect.” The Quirk was already a monster. What it needed was a set of reigns, not encouragement. A swift belt to the snout every time it was disobedient.\nMeanwhile, beyond his thoughts, the enthusiasm he received from the shadow was painful. As though countless opportunities for a positive word here and there had been unceremoniously dropped at the shadow’s feet and abandoned. Again, All For One heard a ghostly cry and bit down on his lip. He couldn’t help. Not the real one. Izuku’s mother would have to be the one to support him. \n“Imagine a needle. If you focus all of that energy to one, single point, like your arms, all the energy will snap the needle tip as you apply force,” All For One explained, leaning more deeply into the shadow. He spread out an arm. “But instead imagine that instead of a needle, you spread it over a wider area, like your entire body and you apply less force...”\nAnd the boy leapt into the air, taking All For One’s arm with him. For a brief moment they made contact and All For One’s entire side radiated with heat. “Of course! If I spread it over a larger area, logically it won’t be so concentrated to one point! And if it’s less of a flood then I should be able to better judge how much I’m drawing from the reserve!”\n“Very good, yes. But if the Quirk is that damaging then precautions must be taken.” Damage akin to turning one’s entire body into a fine mist. But the shadow had to know this already. Another reason this couldn’t be real. The boy would be too dead to correct it after experiencing first time usage. Small children didn’t survive the total collapse of their organs.\n“What sort of precautions?” Academic or neglected? All For One hoped for the former, but suspected the latter from the boy’s cheerful obliviousness. Obliviousness that only came from isolation from the world around him. Was the real Izuku lonely? Did his lack of a Quirk hammer at his arms and legs as much as this vision of him who did have a bone crushing Quirk?\nAll For One instead shrugged with his chest aching. “Oh you know. The usual.” For a criminal at least, but anyone using Quirks without permission was a criminal by default. Provided they were caught. Izuku in the real world didn’t have the private property on which to practice with a Quirk, but better to be in Mustafaru than an area further away from watchful eyes where All For One’s power had dwindled.\n“I really... don’t know what the usual is... I’m sorry.” Not that he had anything to be sorry for in the first place. Details he couldn’t have known if All For One’s brain was attempting its best to anchor the hallucination to reality.\n“When you practice, pick a nice and deserted part of a wooded area where the pro heroes can’t see or hear you. Keep some method of contacting others with you in the event of an emergency. Remember, you too are subject to the laws of physics.” And nothing else if All For One had his way and even those laws had a murky grey area he was keen to exploit. “Every action has an equal and opposite reaction. Every force you exert will in turn recoil back on you whether it’s a firearm or a Quirk. Ensure that you minimise recoil, even if you lose power in the process.” Cringing, All For One added, “and try not to rip any limbs off. Those aren’t easily replaced.” Perhaps for the Noumu in progress it wasn’t, but thinking of Izuku and the Noumu in the same sentence left All For One unsettled. Hadn’t that brat Bakugou always called Izuku a doll?\nAll For One twitched and bared his teeth.\n“So the harder I hit the more it’ll hurt me?” Came from the boy in a barely audible mumble, as if he’d forgotten All For One was present. The boy’s hand twitched wildly, as if it was itching to be anywhere else and doing anything else. “Hmmm, so I need to only draw a small amount and then spread it all over me. Doing that simultaneously is going to take a lot of coordination and multitasking. That means I’ll have to land direct hits without the added force for longer range pressure blasts. But if I don’t risk killing anyone with close range blows, then direct attacks are less of a concern. For now, I’m limited to close quarters combat until I have the stamina to use ranged pressure blasts without breaking my arms and legs...” \nAll For One stared. Izuku’s shadow trailed off into an extremely competent costs and benefits analysis ranging from injury to himself to the prospective possibility levelling of any nearby locations. All For One would be lying if he said he wasn’t impressed, even if it was a figment of his imagination.\n“This is so helpful! Thank you!”\nAnd it hugged him. With an exuberant and unplanned glee, it latched on with both arms around his waist and All For One, without a thought, hugged back feeling the heat saturate his aching limbs.\nIt was a pleasant, if disconcerting, dream. \n \nThere was a tree and there was Izuku. Out in the woods, with no one for kilometres around to hear a tree fall in the woods nor a teenager causing that tree to fall in the woods. Or, in the event there was a accident, half the forest fall in the woods. No one would hear a sound. Hopefully.\nIzuku, who was under the advice of a figment of his Quirk’s imagination. The tree, the unhappy candidate for Izuku’s experimentation.\nIzuku who called for One For All.\nWho felt it spread.\nWho, for the first time, could feel the flow and ease off on its rushing strength.\nWho stepped forwards with far less speed than usual, but with more control.\nKnuckles extended, the bark buckled inwards.\nThere was a tree and there was Izuku.\nThe tree had a dent in its bark and Izuku’s knuckles, while slightly grazed, were unbroken. They didn’t ache, but they did slightly smart. But they weren’t broken. None of him was broken!\nIt was a success! Sure, he’d need way more practice to do it consistently, but his bones hadn’t exploded like fireworks. He wasn’t limited to only one blow anymore, even if it was weakened. There were options. There was potential. He could increase the thresholds. How else could One For All be used? There was so much more to learn. \nHisashi and All Might were going to be thrilled.\nEven by current standards, tonight’s dream was unusual. All Might didn’t even have a chance to commence his beat down before Izuku skidded through him in a blaze of darkness. Glorious. Blinding. All For One’s knight in shining armour.\n“It’s orientation tomorrow!” Izuku called, nearly collecting All For One while he stumbled to a halt.\n“It’s Sunday, tomorrow. Isn’t it?” Did schools even operate one a Sunday? It’d been a while, especially considering the circumstances, he really should have known school hours. How irresponsible of him.\n“UA’s orientation is tomorrow,” Izuku confirmed and All For One’s lips twisted. UA. Of course. How many people had they maimed with this year’s entry exams?\n“UA? I’m appalled they even let you attempt entry with such a ridiculous Quirk,” All For One frowned. Standard procedure for UA. They would use and abuse Recovery Girl’s Quirk even at the expense of the student. Her Quirk promoted natural healing, not perfect healing. He’d know. They’d extensively checked after all and hit a dead end. How many defects was she leaving in her student’s uncorrected bones? How many organs weren’t truly regenerating? How many lies was she telling to her colleagues and the student body? Nearly as many as All For One was telling to himself in the shadow’s presence.\n“Well... They didn’t seem to care too much about that in all honesty.” Izuku’s shadow shrugged, scratched his head and All For One violently rolled his eyes. Oh, he had eyes now? Fascinating. Was it a regression of his state inside the dream?\n“Of course they didn’t care. UA’s under the impression that Quirks fix everything.” The irony that he was the one having to say it didn’t escape him. In fact, it only made him more irritated... with something that wasn’t real in the first place. Or was it? His hallucination was created with his own knowledge and the details the shadow provided were so thoroughly unsurprising that All For One suspected bias. “What happens at orientation?” Apart from being introduced to the next generation of government lackeys and celebrity wannabes. Izuku would be thrilled by the experience and what made him happy made All For One happy... to an extent. Students had already died under UA’s tender guidance. Tender in that their hands off teaching practices resulted in more deaths than could ever be admitted for fear of a lawyerless class action by parents.\n“I guess the class meets our homeroom teacher. I hope they’re better than my elementary and middle school homeroom teachers.” All For One caught it. Uncertainty, suspicion, excitement, apprehension and... fear. Was it the way the shadow rocked uneasily? Trickles of hesitation of that dotted the conversation, speaking a old and familiar language in the ears of a veteran of the trade.\nThere was always something, wasn’t there? “What was wrong with your old teachers?” Incompetence? Bullying? Ineptitude? Fifteen years was a lot of time for a lot of profoundly foolish and downright idiotic behaviour. Though All For One was sure there’d be a comeback for the “stresses of teaching” (as though running a criminal empire for numerous centuries wasn’t and All For One had never been so involuntarily incompetent). (Tomura was a scapegoat, not a vanity project and he’d deny it to the death if anyone ever asked.)\nIzuku didn’t need to say much. In fact, he got a whole sentence out before All For One felt his blood pressure skyrocket. “Suspected Quirklessness” barely left Izuku’s mouth before All For One was hissing, only inches away. \n“Names and locations.” Bigots. Harassed by bigots. An entry too idiotic to make the list. All For One wasn’t fanciful enough to not see the crossover between reality and fiction in this instance. The real Izuku wouldn’t have any reprieve in a poor district like Mustafar. Protected by UA and numerous pro hero agencies? Certainly. (To what extent? A traitorous voice whispered.) Affected by the trappings of ordinary human decency? Hardly. What were these uneducated chimpanzees doing? Using the boy’s suffering as galvanisation for the talentless sods that would never amount anything in their worthless, pathetic, short lived eek of an existence?\nWho was he kidding? Of course they did.\nAnd Izuku... smiled? Did he see a smile through a brief parting in the mists? “Thank you. That means a lot to me.”\n“I would like to hope others have expressed similar sentiments,” All For One pointedly commented. Because if they hadn’t...\n“Not really... Kacchan always used to call me “useless”, like a doll and... no one ever really corrected him.” Izuku’s feet shifted nervously and All For One felt a blood pressure he shouldn’t have rising ever upwards.\n“Really. Including your mother?” Was this why Inko’s messages were so lacking in detail? Was it sorry, Hisashi, Izuku was being beaten black and blue but it builds character because he’s Quirkless and should get used to it sooner rather than later? So help him, if that’s what it was...\n“She knew they weren’t being... pleasant to me,” Izuku meekly answered. “She saw the bruises and scrapes.” She knew... did she...\n“Bruises and scrapes,” All For One repeated and saw Izuku take a step back and regretted his repetition only slightly.\n“Y-yes.”\n“Izuku.” Oh, he knew he was coaxing, but his little dream, in whatever part of his head he occupied, never had the temperament to do what must be done without a little confidence. “If “Kacchan” ever calls you “Deku” again... be a dear and break his arms for me.”\nAnd Izuku froze like an adorable rabbit in the headlights. “Isn’t that a bit overboard?” Not really. A broken arm could be repaired. In comparison to being used in a live and full scale version of Operation, it was a remarkably lenient option. The doctor was overflowing with work, but maybe Tomura would be amicable to a small chore...\n“Of course not. If I was able to intervene, I’d have shattered both of his arms and repositioned them to a more... suitable locale on his body.” Also lenient, but his shadow was a skittish one. \nBut such was the normal parental response to bullies, was it not? Even his brother had been worthy of that response, not that All For One ever told him it was him. (In that instance it was better that accidents simply happened, even if it scored him twice as many suspicious glances within the week. Someone had to do it. It wasn’t like his little brother did a terrible lot of self defending.)\n“Um, I think I’d get in trouble for doing that.” Oh, what a sweet, naive shadow. He was only in trouble if he got caught.\n“Ahem. Might I suggest a “training accident” with your newly found Quirk? Perhaps an “incident” in a hallway with no witnesses? Or a convenient ambush between classes?” All For One offered with the delicacy of a five star waiter offering the latest showings from the specialty menu. “I’m sure I can think of other options to suit your needs.” \nInstead of an answer, All For One felt the arms once more reach in for a hug. “Thank you for being so nice to me. I really... wasn’t expecting anything like this at all.”\nIf All For One wasn’t already incandescent and steadily proceeding along the colour scale, he perhaps would’ve been slightly more gentle when he hugged back. Instead he clamped on like a sloth would a tree.\n \nIt didn’t take a rocket surgeon to know there was some serious beef between Bakugou and Midoriya. Shouta was twenty minutes into the ownership of his soon to be culled class and Bakugou’s frothing at the mouth while he spluttered and sprayed in Midoriya’s direction wasn’t a subtly missed detail. Not that Midoriya seemed to care? Well, he winced when he noticed, but he wasn’t dwelling on it. Smart kid. Shouta would’ve figured him to be a more skittish sort, but Midoriya’s healthy disregard for the loud menace to Shouta’s sleep was admirable.\nPetty grudges weren’t worth wasting time on with how much work they had as students of UA. They could put in a hundred and ten percent in every day and it still wasn’t going to be enough to handle UA’s workload. It was irrational to carry on with childhood feuds, especially when this one was so lopsided. Midoriya didn’t care. He was leading by example here. If Bakugou didn’t shape up, he’d be shipped out like the rest of the zero potentials. Scream about unfairness just as much as them too.\nShame life’s not fair. If these kids didn’t work that out quick, they were goners.\n \nAll Izuku had to do was throw the ball. With some spin he could make it go faster and further. As Hisashi said, and All Might agreed, not everything was about the strength of the Quirk, but the application and technique. Strength alone wouldn’t be enough to deal with most villains or rescues when a single missed punch could flatten a building or bring a tilting tower to its knees. It was all about nuance.\nRearing back, Izuku lined up his throw, One For All bubbling to the surface.\nThen it disappeared.\nIzuku’s gaze immediately shot to Eraserhead. “You didn’t have to do that,” shot out from Izuku, as he flashed back to Hisashi’s similar concerns. It was uncalled for when Eraserhead couldn’t know that much about the Quirks of the class. His data was outdated. Hisashi on the other hand was frighteningly up to date.\n“I saw what your Quirk did in the entry exam,” Eraserhead stated. \n“The entry exam where a girl was about to be crushed to death without a single exam proctor in sight?” Izuku shot back. Hisashi could be somewhat... pedantic (and aggressive), but that didn’t mean his points were necessarily bad. The exam didn’t test prospective students so much as mentally torture untrained civilian children for... reasons? Both Hisashi and Izuku had scratched their heads over that one and the idea of the exam progressively lost points for intelligence the more they dwelled on the concept. Did they think inexperienced teenagers weren’t going to panic? Weren’t going to loose powers they couldn’t control while the adrenaline pumped? Hisashi was right in calling the idea unwise (in a great many more colourful and kinetic words). They were asking for something bad to happen.\nEraserhead continued to stare, but his hair dropped. “You make a good point.” Oh, he was sorta reasonable. That was nice.\nThen, right on time, Kacchan chose to explode. “Why the fuck are you wasting time on that Deku for?”\n“Kacchan, if you keep calling me that something bad will happen.” Izuku smiled fondly, Hisashi’s prompt suggestion coming to mind. He might be a figment of One For All’s imagination, but he was already more concerned than most of the adults Izuku had met. Even if he wasn’t real in the same way Kacchan was, he was worth more than him. Izuku didn’t quite rank Hisashi as highly as All Might, but he was rapidly approaching it as a font of Quirk wisdom himself, even if it was tempered by keen misanthropy. \n“The fuck are you smiling for, you fucking nerd?”\nBakugou swung.\n \nShouta watched in slow motion.\nBakugou’s Quirk stalled in activation while he lunged.\nMidoriya’s Quirk... wasn’t on in the first place. But he raised a hand to defend himself, the other still clutching the ball.\nHe unwound his Capture Device and shot it towards the pair.\nToo late.\nMidoriya had already hooked Bakugou by the arm and lashed out with a foot.\nBakugou sailed over Shouta’s Capture Device, between a narrow gap in the folds.\nSNAP.\nShouta winced, heard Bakugou’s scream and the class’ collective gasp. Saw the buckled angle of Bakugou’s leading arm. Saw Midoriya retract and take a step back with a wince. \nShouta snapped his Capture Device back to him and rushed off to Bakugou’s position in the dirt.\n“I warned you that something bad would happen, Kacchan. You can’t run around attacking everyone you don’t like,” Midoriya said in careful, measured (practised?) words, as if he’d spoken them thousands of times before. As if they’d needed to be said thousands of times before. That was interesting. Bakugou had been violent with his Quirk before getting to UA. That wasn’t in the kid’s paperwork. \nIt also wasn’t in the paperwork that Midoriya was stone cold when snapping people like twigs. That was going in his file too, the smiling assassin.\n“WHAT THE FUCK IS WRONG WITH YOU, YOU FUCKING DEKU!?” Bakugou roared, even while he was stiff as a board.\n“Just remember, Kacchan. One day it won’t be me. And one day, they’ll break a lot more than your arm.” Midoriya took another step back, the ball still clutched in his hand. “Sensei, I think Kacchan needs Recovery Girl.”\nShouta took a look at the pink-white protruding from Bakugou’s flesh. Midoriya had a point there as well.\nSilence hung, even as he called for Recovery Girl.\nNot even a day in and 1-A was already a nightmare.\n \nToshinori shot a glance at Eraserhead. Eraserhead didn’t even look at him.\n“Keeping an eye on the new batch, All Might?” Eraserhead sounded like his soul had left his body. With no luggage and sprinting naked down the street while shrieking violently.\n“Erm, yes. I must say, it was most...” Toshinori tasted the words. “Most unexpected.” It wasn’t exactly a lie. Young Midoriya had told him about the mysterious and shadowy “Hisashi” who lived with his shadowy killer (gee, whoever could that be?) within One For All. Hisashi whose dim, seething view of the better part of humanity left Toshinori strongly questioning One For All’s oral history.\nHisashi was not a happy Quirk component. His life advice was suffused with the sort of vindictive savagery that Toshinori had come to expect from the likes of the mocking All For One and his toying with others. Hisashi, fragment of One For All who deplored UA’s teaching practices, who deplored young Midoriya’s previous teachers, classmates and everyone else who’d ever mistreated the boy. At some level, it made sense that the Quirk would begrudge those who had harmed the vessel, but to manifest so abruptly? Toshinori had a sinking sensation at the troubles in Midoriya’s past for the Quirk to start speaking.\nEven the mental image of anything close to All For One, in reality or otherwise, made Toshinori’s skin crawl.\n“You mean Midoriya snapping Bakugou’s bone through his skin.” Eraserhead grinned mirthlessly. \nToshinori cringed. That had to be Hisashi’s influence. Young Midoriya had always been a quiet, compassionate and contemplative boy. Not that he wasn’t now. Now, with the Quirk’s encouragement, young Midoriya had a flowchart for dispute resolution and self-esteem. A flowchart which had been extensively (somehow) tested by the Quirk who gifted it to him. Unfortunately for young Bakugou, Hisashi’s flowchart tended to end in grievously bodily harm for those who attacked with malicious intent (as was still legal without Quirk involvement, much to Toshinori’s surprise). Seeing young Bakugou’s behaviour though...\n“I’m more concerned with young Bakugou’s behaviour. Why did he attempt to use his Quirk on young Midoriya?” Toshinori posited and Eraserhead’s eyes narrowed.\n“I was wondering that myself.” But still passed everyone, Toshinori mentally added. “Something isn’t adding up with Bakugou. Passed middle school with flying colours, has not a single rescue point and not a single mention of his violent behaviour in his school reports.”\nToshinori’s own eyes narrowed even further than usual while in his muscle form. “Young Midoriya made clear this was a recurrent problem.”\n“Kid’s a flat out bully if we extrapolate Midoriya’s behaviour,” Eraserhead’s mirthless grin was inching wider and Toshinori saw a cat stalking a particularly fat canary. “And here he is at UA carrying on where he left off from middle school.” On second thoughts... Eraserhead had passed Bakugou along with the rest of the class. Eraserhead wasn’t stalking the canary. He was hiding the feathers and slinking off with a fuller stomach.\n“I take it there will be discussions about UA’s zero tolerance approach to bullying and harassing behaviours?” Toshinori almost nervously proposed. (Had there ever been any discussion about UA’s anti-bullying policies?)\n“UA doesn’t have an anti-bullying policy, since they think adversity builds character.” The maniacal grimace was growing. “But I do.” Eraserhead was nothing but gleaming teeth.\nToshinori had the distinct impression that the expected expulsion he had come to talk to Eraserhead about was peanuts compared to his newly instated anti-bullying policies. He clearly still had a great deal to learn about teaching.\n \nAll For One could feel a spring in his step. The source wasn’t identifiable and didn’t come from the usual source in his dreams. Not that he could tell at least. Even though the period had been short, All For One’s nightly terrors had become a nightly reprieve from the quiet or simpering of his usual abode.\nThe doctor was bemused, All For One was sure, to see him spring from his seat with new vigour and snatch a bottle of wine from a dusty cabinet.\n“Should you be drinking that, Sensei?” The doctor’s voice wafted over.\n“It’s a special occasion,” All For One granted and poured himself a full glass.\nNo, he wasn’t meant to drink. Yes, of course it interfered with his Quirk. And no, he wasn’t tipping out the drink and putting the bottle away.\nThere was a happy occasion out there somewhere and he was drinking to it, brain damage be damned.\nAll For One was waiting, like always, but All Might never appeared. Not even the customary fade in signifying the memory on the move. Instead Izuku came sliding to a halt in a trail of darkness without a hint of uncomfortable or traumatic recollections of past failures. As though the memory hadn’t even loaded, so to speak.\n“Hisashi!” Izuku called.\n“Izuku. You seem awfully keen.” Something had happened. All For One knew that tone of voice. Well, he thought he did. Izuku was walking the tightrope and hovering between mortified and elated as the two nominated destinations. Sounded like All For One’s standard Tuesday. How excellent.\n“IbrokeKacchan’sarmduringatesttoday,” rushed from Izuku. All For One captured and lingered on every sweet, bountiful word and the astounding prospective imagery that clung at is edges.\n“You did?” All For One felt his previous sense of unexplained glee swell once more. Was this why he’d felt compelled to celebrate? The success of his ghost? “Good boy!” All For One lunged and dragged a squirming Izuku into a one armed grip. “How bad was the break?”\n“Erm... the bone... went through the skin?” Uncertain? Why was the poor thing uncertain? What a momentous spit in the face of the brat. The image sharpened into a class Quirk test gone spectacularly right. Bakugou got only a fraction of what he deserved.\n“And the teachers?” The teachers were a haze. Who did the boy even have for teachers?\n“Eraserhead is my homeroom teacher. He’s okay.” There was an unspoken “so far” in there that didn’t escape All For One. (Eraserhead as a teacher though... There was an unusual mental image. The bounty hunter teaching the newest crop of pro heroes.) “He tried to stop my Quirk from breaking my bones.” All For One blinked. Then he blinked a second time. Responsible teaching? From the bounty hunter? There was no way that was real. Abiding by a duty of care was about as foreign to UA as the concept of not using child soldiers was to the Japanese government.\n“A UA teacher attempting to prevent a maiming between students? Say it isn’t so.” Was Eraserhead not on board with UA’s typical policy of ignoring Quirk related injuries? Maybe he wasn’t part of that clique. An underground hero that was more bounty hunter than symbol of anything, All For One could at least respect the man’s work ethic in achieving outcomes (instead of peddling aspirations like a certain Symbol of Peace).\n“Yeah, I thought it was odd, but apparently it’s a personal dislike. I wonder what happened.” Izuku was earnest enough for All For One to hesitate.\nAll For One could have told him that Eraserhead’s classmate had been buried beneath a building due to one of All For One’s own experiments, but... that wasn’t going to make Izuku happy. To the contrary, All For One could imagine All Might’s instantaneous materialisation to pulverise him back into the dirt. Followed by curb stomping with prejudice. \nSo All For One, with the subtlety of a brick to the face, changed the topic.\n“I don’t know. How did the test go? Did you make any friends?”\nIt was for the best that Izuku, fictional or not, knew precisely as much about Shirakumo as everyone else did.\n“Yes! I came fourth, because it was starting to hurt a bit, but I met Uraraka and Ida!” Izuku exclaimed. Fourth wasn’t too bad for a delicate form. It certainly would’ve been worse if he was throwing the full power of his Quirk around without restraint. “They’re really nice!” All For One had his doubts. He’d seen enough pro hero students to know that expectations of nicety were fanciful at best.\n“Nothing like your old classmates?” All For One raised an eyebrow and Izuku shook his head.\n“No no no. They were very understanding about... what happened to Bakugou. Once I told them that I had problems with my Quirk, Aoyama started crying on me. I think they understood.” Bright, cheerful and not terribly deterred by Bakugou’s happy misfortune.\nNow All For One had to do was keep it that way.\n \nThere only had to be a slight change in the class plan. So minor Shouta doubted the kids with older siblings who’d been through UA’s curriculum would notice unless it was spelt out to them. All Might, thankfully, was on board with the plan, even if he was slightly bemused about a detail change (but All Might always seemed slightly bemused, so who really knows what he was thinking?). \nThat was fine. Shouta did like a good logical ruse. Needless to say, he was shocked when he found that All Might liked a good logical ruse himself if it provided the right sort of outcome. The things you learnt about about people when you did the job a little bit differently. Maybe Shouta had been going about this the wrong way.\n \n“The task this time around,” Toshinori dramatically announced, “is a hostage rescue!” The class knew there was the tang of wrongness in the air. The slight movement of the grass. A reverberation from the concrete. The faintest breath of air extra whispering in the space. Like prey sensing the hungry stalkings of an apex predator, the class twitched. Young Bakugou in particular was throwing glances over his shoulder as though the air would take physical form and pounce. Poor kid. He had absolutely no idea.\nToshinori took a step to his left. The class gasped. Toshinori’s permanent grin inched upwards.\n“Hi kids!” Eraserhead’s eyes burned and his wide toothy smile was anything but friendly. “Ready for today’s practical?” Eraserhead certainly was, and all of the intense and reckless endangerment of life that was sure to follow. Of course, once Eraserhead realised his new plan’s workload, Toshinori wasn’t sure he was going to last.\nEveryone apart from Midoriya, Todoroki, Ida and Bakugou gulped.\n \nShouta was looking for a tell. All he needed was a repeat performance from Bakugou and he had what he needed to convince the principal for additional resources. But it was risky. Bakugou immediately started the exercise on the ground floor while Ida guarded Shouta.\n“My apologies, sensei!” Ida babbled and Shouta snorted.\n“Focus on the exercise.” Shouta snuggled into his unzipped sleeping bag. At least All Might was taking care of the educational debrief. \nShouta’s peace and quiet lasted precisely thirty seconds before a nearby “window” (newly formed in the concrete) exploded in a cloud of dust. Uraraka came flying in with a ballistic trajectory, a long cable and Midoriya only a second behind. Her hand forming a familiar seal. \nHuh, Midoriya as a solo breach team. He was getting better. And Uraraka wasn’t throwing up yet. Quick learners.\n“Halt!” Ida cried, angling for his family’s signature kick. Not that it was going to do much. Not when he’d moved directly into range of Uraraka’s grapple, courtesy of Midoriya’s extended foot snagging around his other ankle in a smart judo toss. \n“Got you!” Uraraka planted all five fingers on Ida as he flew...\n“Nice one, Uraraka!” Midoriya sounded happy enough, but like Shouta, he was watching the door. “Almost got you, sensei!” That anchor Uraraka had was a nice touch and it definitely wasn’t part of the gear’s original design. (Why it took so long for it be added when the biggest risk of Uraraka’s Quirk was falling to one’s death was anyone’s guess. He’d recommend some sort of parachute, glider or jet pack at the end of this assessment.)\nAnnnd nope. Ida was out. Or close to being out. Without his weight to guide his Quirk, Uraraka was able to manhandle him along the ceiling and back out the window where he helplessly bobbed along. Shouta only had a second to think about how the landing was going to go before the actual door exploded inwards.\n“DEKU!”\nIt was showtime.\n \nKacchan was... almost distressingly predictable. Izuku, fully empowered with his Full Cowl (as much as he could without snapping anything), corralled Kacchan like a sheepdog, wearing at him with every dodge and every explosion Kacchan shot at him. Dancing around him, nipping and swatting at him with as few fingers as he could manage. Landing a direct hit on Kacchan with One For All was risky. Not when the Quirk didn’t like Kacchan. A normal punch might become a finisher with or without intent. All Might was clear about that. One For All was being temperamental and Izuku wasn’t to make it worse.\nThen it happened after an exasperated scream of rage.\n“Oi, fucking Deku! Eat this!”\nThe gauntlet was lifted. Izuku could see the trigger. A container... for Kacchan’s explosive sweat. With a nozzle that was pointing at them.\nNononono. Kacchan was being stupid! Kacchan was going to hit Eraserhead in an attempt to hit Izuku.\nEraserhead was already standing, but it was too late. Neither had been expecting the support item. Izuku wasn’t going to make it. Eraserhead-sensei wasn’t going to make it. Kacchan had the gauntlet pointing at them. The gauntlet that sensei couldn’t cancel because it wasn’t a Quirk. The gauntlet that was accruing all of Kacchan’s sweat. The gauntlet that was going to blow away half the room.\nAnd he was pointing it directly at them.\nPulled by unseen strings of urgency, Izuku ran, he slid and he reached. \nOne For All happily obliged with an all too familiar giddy glee.\n \n \n“Oi, fucking Deku! Eat this!”\nHe was free of the sleeping bag, had the Capture Device unravelling. His eyes narrowed and focused.\nShouta again watched in slow motion. Bakugou, pulling the pin on his gauntlet.\nToo late.\nToo late for Shouta to cancel the Quirk, because it was a support item, not the Quirk itself. His Capture Device wouldn’t make it in time either.\nToo late for Shouta to realise the depths of Bakugou’s obsession.\nToo late to cancel Midoriya’s Quirk, because to do so was certain death for the kid. Certain death for Midoriya and the end of Shouta’s career in one way or another.\nBakugou was too late to halt the inevitable, because Midoriya rejected both outcomes.\nMidoriya slid beneath Bakugou’s outstretched arm at unforeseen speed. Zen, calm, his face blank and empty of emotion. From his fingers, a jet of thrashing black energy emerged. It streaked behind him.\nMidoriya was clear, well and truly at Bakugou’s back. The jet black whip was not.\nBakugou fired at the exact moment Midoriya’s trailing blaze of black curled his shoulder and wrenched it away. Moving with the recoil, helping it along.\n BOOM. SNAP.\nIt went wide, singeing the tips of Shouta’s hair as he rolled away and blowing away a chunk of the structure. If it had been a person...\nBakugou screamed. He flew. He slammed skidding backwards along the ground where the Quirk had hooked him. Shouta could see pink-white yet again, but what was his Quirk and what was Midoriya’s whip? He’d have to watch the sight footage to make a judgement of the whip’s acceleration before its impact.\nThe whip retracted and Midoriya hopped backwards away from the writhing blond on the floor. Midoriya flexed his hand, wincing as he did so.\nShouta had the strangest sense of déjà vu.\nBut he had his evidence.\nBakugou had tried to grievously wound Midoriya at best and kill him at worst. And almost taken out Shouta in the process.\nAnd Bakugou was here. At UA. With the entirety of Japan watching their newest crop flourish under the tender administrations of the school. Flourish was a subjective word, clearly. Right now it was more of a case of the class being trapped in a merrily burning building that the teaching staff were frantically trying to evacuate before the illegal fireworks store in the basement exploded.\nThe school board was going to be chuffed.\n“Alright, that’s enough. This practical is over for you four. Midoriya and Uraraka win on account of the disables.” Disable was too nice a word to describe what Midoriya had done, but in light of the circumstances, Shouta was going to cut Midoriya some slack.\n“Acknowledged. Recovery Girl has been contacted,” All Might called back through the radio, audibly disturbed.  Not to worry, All Might, Shouta thought with a shiver. The rest of class is going to be just as disturbed as you are.\nAt least the rest of the class could use it as a learning experience. Bakugou was too thick and Midoriya was too experienced, but everyone else could pick up some pointers.\n \nToshinori didn’t even wince when Bakugou’s arm and shoulder socket disintegrated under the force of his own recoil and the assistance of One For All. They had Recovery Girl on speed dial for this exact reason. The team selection had been rigged at Eraserhead’s request. Was it a one off? Was it a repeating behaviour? They had to know for the safety of the other students and the teachers. Class 1-B had been instructed to stamp out similar Bakugouish behaviour. Vlad King’s outraged protests were nothing compared to Eraserhead’s resolute new policy. (At least the principal was happy with the suggestion. Something something building parent confidence something. Toshinori hadn’t really been paying all that much attention. But it sounded good at a student management level. Safety first!)\nWhile they had preferred this not be the only outcome of Bakugou’s practical, it was ultimately the expected outcome. Young Bakugou had met his teachers’ expectations in the least conductive manner to maintaining the good grades he held from middle school. If his behaviour couldn’t be improved, then he would be expelled. Eraserhead already had that absolute discretion, but there was a lick of doubt shrouding Bakugou. As if the entirety of his story was concealed behind a curtain that was yet to be pulled back. If there were circumstances beyond Bakugou’s control, an expulsion would be unfair. At the same time, he couldn’t be allowed to assault others because of his deficiencies. It was unfortunate, but not surprising.\nNo, Bakugou wasn’t the surprise here. It was the explosion of black tentacles from young Midoriya which had gleefully torn Bakugou’s arm from its socket that was the surprise. Or was it? Hisashi also hadn’t been something Toshinori had expected young Midoriya to locate within the depths of One For All. One For All which had depths and secrets and a misanthropic mind of its own. One For All which contained more than one Quirk, just like All For One.\nOne For All was no longer a beacon of All For One’s defeat. It was free to seek a new path because of Toshinori’s actions. No more All For One should have been the retirement of One For All, but Toshinori had kept it here. Kept it alive, where now it lashed out on behalf of a host who was too shy to truly defend himself, but had no issue diving between others in the face of danger. \nAnd One For All, or “Hisashi” as it called itself, was not happy. It wasn’t happy with UA. It wasn’t happy with young Midoriya’s previous teachers. It wasn’t happy with his mother. And it certainly happy with the rest of society either. In fact, Hisashi wasn’t so much “upset” as he was homicidal with unexpressed rage which Toshinori was quietly thankful that he had never discovered. All For One was dead, but the nearby city didn’t have to be obliterated with him.\nYoung Midoriya’s recounting of Hisashi’s advice left Toshinori with little doubt about young Bakugou’s future encounters with young Midoriya. The Quirk was on the warpath. Young Bakugou was a clueless and unfortunate lamb who stumbled into the path of One For All’s latent malice. One For All which was now capable of independent action. Young Midoriya did his best, but his best wasn’t going to be good enough (and nor was anyone else’s) to shield Bakugou with a Quirk so ancient, with so many accumulated tricks of its trade. One For All was on young Midoriya’s side and no one else.\nAll For One might be dead, but did it matter when the Quirk he’d created was exhibiting his flavour of behaviour in a new host? Nana had always had the romantic notion that they would all once again meet within the Quirk after death...\nBut...\nBut did that include the Quirk’s creators?\nDid it include the First? \nMore importantly, did it include the shadow of All For One?\nToshinori had the feeling that he’d made a terrible mistake. All he could do was wait for the Sports Festival, so Gran Torino could see for himself what One For All had become in the hands of its new owner. Nothing else was going to persuade him to intervene. Not after Toshinori’s years of avoiding the old man like the plague.\nBut... even for that sensation, Toshinori couldn’t imagine Mirio Togata lasting five seconds with “Hisashi”. Perhaps it was for the best Izuku was given the Quirk, where he could bring out its best even while it attempted to chew on society’s metaphorical sofas.\n \nAll For One knocked down another drink. He really shouldn’t, not with his delicate health (and his Quirk which distinctly did not like alcohol), but today also had the feeling of an incredible day. Perhaps, a world away in the recesses of his mind, his hallucination was enjoying another beatific school day, bludgeoning Bakugou and making friends. All For One could only hope so.\n“Sensei, you’re in... a good mood,” Tomura commented in an uncertain manner.\n“So I am,” All For One agreed and heard the doctor drop something behind him.\nTomura made a noise of mild distress and All For One practically sighed down another glass of wine in contentment. He was going to sleep extremely well tonight and what was more important than the little things in life?\nIt also didn’t escape him that Tomura’s noise of distress likely originated from the fact that he’d never heard this particular tone of voice in the years he had known him...\nAnd that took the ever so slightest edge off his mood, because if Tomura hadn’t heard it before... then Izuku likely wouldn’t ever hear it in his lifespan.\n“You have tentacles,” All For One repeatedly dumbly. Tentacles. “Why tentacles?” Not that All For One was in a place to judge. Since the... incident with All Might, tentacles were now a longstanding part of his arsenal. Minimal recoil, enhanced applications when leveraging problematic obstacles resistant to shock impacts. All For One certainly wasn’t going to complain about tentacles. Tentacles were excellent precision tools at almost any range. Grapples, grabs, throws, pulls, slices, piercing damage... yes... tentacles as a genre were a handy feature of any Quirk. All For One quite liked tentacles. They were very traditional.\nBut tentacles comprised of black energy that obeyed no known laws of physics? There had been a One For All wielder with a similar Quirk, but they were more like delicate threads than the heavy set form that dusted Bakugou’s shoulder socket. (Again. Bakugou had always been slow one in All For One’s eyes, but this was remarkably short sighted. Why attack someone who had already successfully maimed you without a Quirk, when they could now use a Quirk?) If that Quirk had received a healthy dose of Trigger, All For One could trick himself into seeing a link between that old Quirk and Izuku’s description. But the odds of that were... extremely slim.\n“I don’t know! I wanted to pull Kacchan away from Eraserhead-sensei and I had tentacles! Isn’t it cool? Another Quirk!” Izuku exclaimed, his hands waving wildly as he talked about how his whip has dismantled a classmate. Bakugou who... tried to murder three classmates and a teacher. The urge to send Tomura on a fetch quest was rising. At this point, Bakugou’s most recent attempt was only a cherry on top. There was plenty of prior offences that were reason enough for a gentle suggestion.\n“But you said your Quirk is a power stockpile...” This didn’t make any sense. Stockpile Quirks did not mystically sprout new Quirks. But Izuku was a flight of fancy. A dream. Dreams didn’t have to make sense. There was more to this than some erratic hallucination... Except All For One didn’t have erratic hallucinations. He had perfectly regular hallucinations (thank you very much). His hallucinations were entirely Quirk accurate... apart from this one. Apart from Izuku himself. But if Izuku’s Quirk is accurate...\nIntent. Izuku manifested intent and the Quirk manifested due to the intent. Like he’d selected it from a stockpile of more than energy. Like the Quirk knew it had more than raw power. Almost...\nAlmost like All For One... All For One with its stockpile.\nAll For One with a stockpile that didn’t exist until it acquired enough resources to become a stockpile. All For One... which had another... unfortunate hallmark that had done quite the number on All For One’s social life.\n“Izuku,” All For One delicately inquired. “Have you always liked Quirks?”\nFor a moment, the shadows parted and All For One was stuck by Izuku’s beaming features, his green, woolly hair waving in an invisible breeze. A first glance in over a decade imprinted itself in his mind.\n“I’ve always liked Quirks. I keep notebooks of Quirks. Any and all Quirks.” Izuku features were almost maniacal with a type of sedateness reserved for the most fastidious hobbies. How many times had All For One seen that same expression before in the mirror?\n\nThump. Thump. Thump.\n\n“Are they your Quirks?”\n\nThump. Thump. Thump. \n\n“Oh no... Kacchan thinks it’s creepy, but I like...” Izuku waved a delicate hand of his own. “I like window shopping. They might not be mine, but I take notes for usage, improvements, weaknesses. You know.” Just in case, All For One added for Izuku’s sake. He doesn’t know. He. Doesn’t. Know. “You... you don’t think that’s creepy, do you?” Anxiety radiated from the newly cloaked shadow.\nAll For One smiled serenely. “I think it’s adorable. You can never have too many tentacles.”\nIzuku’s relieved sigh shouldn’t have made him feel relieved... but... there were details... that were missing... at the edge of his mind, if only he could reach through and snatch them.\nIn the meantime, at least he could still latch onto Izuku who still felt so very very real.\n \nKatsuki didn’t know what the fuck was going on. He’d expected the principal, but this was worse. Infinitely worse. The principal was some rat faced bureaucrat, but this... Fuck. Why were they looking at him like that? Why... why was he looking at him like that? It... was like he’d swapped places with fucking Deku.\n“I’m very disappointed in you, young Bakugou.” He didn’t even need to fucking yell. There was no amusement, no smile, no fucking cheer. Nothing but flat faced disappointment. “Repeatedly singling out and attacking a fellow student? Endangering a teacher in a live fire exercise? Endangering your fellow students who were on the other side of the building? What were you thinking? Why provoke someone who can snap you like a twig?” (Deku couldn’t... but he already had, hadn’t he?) His hands were clasped and he stared over them. “This cannot continue.”\nKatsuki wanted to argue, but some reptilian part of his brain which wanted him to keep breathing told him to shut his mouth. He was the strongest, damnit! The best! How the fuck did the weak Deku have a fucking Quirk like that? Deku fucking looking down on him. Fucking thinking he’s better than him.\nInstead, Katsuki nodded, his teeth biting his tongue, his body rigid, staring directly ahead.\n“You’re familiar with baseball, young Bakugou?”\nKatsuki silently nodded again.\n“Three strikes, Bakugou. You’re already on thin ice. First strike, attacking a fellow student out of some entitled desire to know about his Quirk?”\nKatsuki trembled. Deku didn’t have a Quirk. How the fuck could he have one? \nBecause he can do a lot more than break bones if he uses it on you, a traitorous, reptilian voice whispered. You won’t exist. A splat. And your explosions won’t do shit to fucking tentacles that can slap you from three city blocks away. And you keep egging him on, wanting to see it. He’s not the same anymore.\n“His Quirk is none of your business. Villains don’t care about your Quirk and neither do we. Life’s not fair and neither is this institution.” There was a click at the end of that sentence that Katsuki felt in his bones. “Strike two. You almost killed the same student, a teacher and two other students who were following the rules of the practical.” He shouldn’t have that hiss to his voice. It was unnatural. It wasn’t right. “Strike three and you’re out. One more incident. One more derogatory word. A. Single. Solitary. Outburst. And I will personally see to your expulsion. You will never use your Quirk in public or against another person outside of our exact instruction again or I will personally see to you having the smallest cell the government has on offer.” He leaned back and Katsuki didn’t doubt a single word of it. “I hope I’m clear.”\nKatsuki wasn’t crying. He wasn’t. There was something in his fucking eye.\n“Yes, All Might.”\n“Good. Eraserhead wants a word with you as well.”\nEraserhead’s lips parted like a fucking shark’s. Fucking great.\n \n“I feel terrible,” Toshinori confessed.\nEraserhead snorted. “Don’t. He almost killed four people. His middle school and parents spent too long babying bad behaviour.” To a frightening degree, nonetheless. Young Midoriya had almost died... for what? Why throw everything away for a petty, one sided grudge? Didn’t he want to be a hero? The boy’s rationalisation for why he was here was inconsistent at best and nonsense at worst.\nEraserhead was still entirely right, and Toshinori felt his own face frown while nodding, but... \n“It doesn’t feel right?” Eraserhead smirked. “Whether it feels right or not is irrelevant. Either he’ll kill someone or he’ll attract the attention of the wrong sort of villain and they’ll kill him. Best we intervene now before the Sports Festival. We could have barred him from practicals, but we need some carrot and stick.” In Toshinori’s opinion, the carrot was being used as a stick.\nEraserhead was giving Bakugou rope... enough rope that with a single slip he’d hang himself, leaving neither of them with the complicated explanatory paperwork. Another, far more menacing logical ruse. Toshinori offered the expulsion and Eraserhead provided the rescue if only Bakugou could swallow his pride.\n“Did I have to be the bad cop?” Toshinori sighed. Being the bad cop wasn’t pleasant.\n“Bakugou needs to learn that there are no good cops and bad cops, only the consequences of his actions.” Eraserhead’s teacup was set down with a rattle.\nToshinori really couldn’t disagree with that, could he? Maybe that’s why it felt so awful.\nThat was besides the point now. Not when the USJ’s training exercises were rapidly approaching and the smug aura gracing Eraserhead was almost too much to handle.\n \nIt was meant to be easy. Sensei said All Might would be here with the brats. They would kill All Might and then all of the pro heroes would go away. There’d be no more of this bullshit where people were walking around like nothing bad would ever happen to them. It was always All Might. All Might who told them that everything was okay. It was always All Might...\nAt least until it wasn’t.\n \nKurogiri was expecting their suitably frightening appearance to be enough of a distraction for Thirteen and the children while they waited for All Might. Eraserhead could be handled with enough numbers. They’d seperate the children th-\nSLAP.\nA black tentacle collected his face with the approximate force of a freight truck. After that, an exploding blond drop kicked him from the opposing direction and sent him crashing to the ground while screaming profanity. Immediately following was a glacier which sandwiched one half of the hired help into the other as Tomura Shigaraki was pulled clear by the Noumu.\nAnd Kurogiri was starting to rethink this plan entirely.\nEspecially when the engine legged boy sprinting away from them was already outside of the main exit.\nWhy hadn’t they been warned?\nNo one said one of the children had long range tentacles.\n \nThat green haired brat ruined everything. Kurogiri got one shot like some sort of scrub. Worthless. It was him and Noumu now and the least they could do before they bolted was kill some of the brats. Killing All Might didn’t matter if they wiped the rest of the trash mobs that turned up. Fucking fleeing mobs. Always pulling more trash because of weak crowd control.\n“Think you’re so great, huh? Think you’re so strong? Let’s see how you handle Noumu’s Shock Absorption. Noumu, get the green kid!”\nTomura gestured and the Noumu... merely looked at the brat... at least until Eraserhead surfed in on a tentacle and kicked it in the face. \n \nThere were times where Izuku was prepared to admit that he was wrong and watching Eraserhead’s kick and Quirk do precisely squat to “Noumu” were not among them. He had to be quick. He had to be... nuanced...\nThe white haired guy said Shock Absorption. Not Shock Nullification. All Izuku had to do... was not “shock” the black entity they’d brought with them. He just had to... gently point it in another direction and persuade it to leave. That was all. It wasn’t that different to Bakugou’s grenade shot.\nAll he was doing was offering a helping hand. Sensei would be okay with that, right?\nOne For All purred with such fervent agreement that Izuku raised an eyebrow even as the ribbons of black were ejected at supersonic speed. And Izuku’s mind drifted off into a carefully and pointed blankness.\n \nIf Tomura listened as closely as someone who was about to be decapitated by explosions could... he could hear the faintest bars of music firing up in the USJ. He was just imagining it. He had to be.\nNo one could take Noumu on in a direct fight. Not even All Might and Tomura was certain of that, but the green haired boy wasn’t even trying that as he rocked from side to side. Black tentacles flooded from the kid’s hands (like Sensei, a voice whispered). They anchored themselves to the Noumu’s wrists and ankles like a puppeteer’s strings while it clawed at Eraserhead. The Noumu had no way of reaching the green haired brat or Eraserhead and had no way to follow either with the black lengths pushing them apart.\nThe kid began to rock, side to side. Backwards and forwards. His momentum building. The Noumu was building momentum as well, in an involuntary game of tug of war. It thrashed, it wrenched, but it couldn’t be freed. Then slowly, but surely, they were circling each other at increasing speeds. Even if Tomura wasn’t having to dodge alternating waves of ice and explosions aimed at his face, he couldn’t approach the kid from the gusts of dust and debris.\nFaster and faster they spun... \nThen, only one of the them was still standing. \nNoumu’s feet left the ground. Hovering upwards, then levelling out as he began his new life as the brat’s improvised flail. Twirling around faster and faster.\nThe green kid’s posture changed from the gentle steps of a ballroom dancer to the posture and footwork of an Olympic hammer thrower going for gold. Shouts of terror from the hired help let Tomura know that not everyone escaped the raging wind that was speeding towards the main entrance.\nTomura was forced to sprint backwards when the blur distorted into a roaring tornado. Why... why... Oh shit. Centrifugal force. Yeah, there were Gs being pulled there, but it wasn’t exactly a “shock” to be absorbed. Because... All Might.. didn’t work like that... because they weren’t expecting someone with a brain. Or tentacles.\n“Shit.”\nTomura ducked.\n \nMidoriya’s footwork stepped in a movement suggestive of incoming release.\nShouta ducked.\nBOOM.\nThere was a howl of wind and a sonic boom which flattened a nearby villain with electricity sparks blazing off him.\nShouta, strictly speaking, didn’t see the “Noumu” hurtle through the USJ’s main entrance. But he did see the gaping hole in the wall it left behind. The sonic boom hurtled after the atmospheric interference that guided its path, wily snickering as it shot past the faces of any poor bastards following the road. Shouta could only hope Ida was well and truly clear.\n“YOU CHEATER!” The white haired manchild howled.\n“I wouldn’t do that if I was you,” Bakugou wheezed from behind the manchild’s shoulder, holding onto his own freshly healed shoulder with what might have been a pain related grimace.\n“Or what?” The manchild lunged for Bakugou, Shouta’s eyes following his every step.\nCRACK.\nHis eyes were following the manchild. Not the black whip of energy which split into four segments.\nFour segments off which the manchild was now hanging, like a pig on a spit, his eyes wide and staring. His hands, an arm and a shoulder. Mr Manchild wasn’t going to be attempting to murder children again anytime soon. \nThe whip retracted.\nManchild hit the ground with a wet and red SPLAT.\n1-A collectively winced. Apart from Midoriya, who was as serene as the last time he’d maimed someone. Kid was either ice cold or, like All Might previously suggested, was attempting to restrain his frothing at the mouth, furniture inhaling, menace to society.\n“Told you so,” Bakugou’s unusually somber voice broke the silence. \nLuckily for Manchild, the purple mist bailed him out before Midoriya made it to him a second time.\nShouta eyed the various pools of blood, limbs and groaning villains strewn about the room. 1-A were a... unique bunch, but they were his unique bunch. They just needed to tone it down a little before they developed a reputation.\nThrough the hole in the wall, Shouta spotted another silhouette.\n“I AM HERE!”\n“Great timing, All Might. How good are you with frostbite injuries?” Thirteen’s uncertain voice was paired with a shaky hand that point in the vague direction of Todoroki’s glacier.\nShouta coughed and swallowed an unbecoming sound. Thank god he wasn’t the only one who had to deal with the paperwork.\nTHUMP.\nMidoriya slumped to the ground, out cold.\nEh, it could’ve been worse. For everyone involved. Shouta wasn’t expecting the manchild to walk away from the whip.\n \nAll For One’s afternoon glass of wine was interrupted by a an unidentifiable rain of liquid and a groan of pain. That didn’t sound good.\n“How did it go?” All For One enjoyed the sensation of swirling liquid in his glass. At this point, All For One wasn’t expecting much from either side. Best not to get his hopes up. As such, his approach to Tomura was much the same as his approach to the occasional soap opera that would invade regular television hours. It was too inconvenient to change, but hopefully had an entertaining episode somewhere in the serial.\n“Some... green haired brat... shot me with his tentacles... All Might wasn’t there...” Tomura wheezed.\nAll For One froze. “Tentacles?” It couldn’t be. No. There was no way.\n“It was like a black energy whip, Sensei,” Kurogiri’s voice advised. “The boy ejected Noumu from the premises as though he was participating in an athletics event. He then speared Tomura Shigaraki with the sharpened end points of the tentacles. The rest of the help were annihilated by the rest of the class and Eraserhead.”\nA green haired boy. With a black energy whip that functioned as tentacles.\nWho impaled Tomura.\nWho slapped around a Noumu designed to expunge All Might from reality.\nFaintly, in a dream-like state, All For One whispered to his unaware audience. “Was his name Izuku Midoriya?”\nHe could hear Kurogiri frown. “... Yes, Sensei... how did you know?”\nAll For One smiled against his will. His brain screamed. “It sounds like something he would do.”\nHe’s real!\nIzuku Midoriya was real.\nIzuku Midoriya was real... and had his Quirk.\nAll For One laughed, fully aware of the doctor scampering off behind him and Tomura’s confused gurgle of pain.\nDetective Tsukauchi was remarkably understanding for a detective who’d just been informed that a teenage boy in his first year of hero school had slapped a grown man sixty or so klicks down the road (and nearly taken out a farmhouse in the process).\n“How… exactly did he manage this?” The detective asked, slowly and carefully like his intonation might change the answer.\n“Leverage.” Eraserhead was as concise as ever.\n“Leverage.”\n“Leverage,” Toshinori agreed.\n“How much leverage?”\n“Hammer throw leverage.”\n“He smashed the world record for the Olympic gold a few times over, All Might. You can’t seriously expect us to think a hammer throw alone went that far.” Tsukauchi tapped his notepad.\n“Force equals mass times acceleration, detective. I didn’t even see the perp when Midoriya let go.” Eraserhead was the sort of casual that invoked suspicion in everyone who looked at him. Including Toshinori, who could only boggle at the replay footage retrieved from the facility’s cameras. One For All needed a muzzle before it savaged the nearest petty criminal.\n“Right.” Tsukauchi closed his notebook, with an expression that conveyed I don’t believe you for a second, but there’s twenty other people backing you up and we don’t think we’d win if we went to court. “Well, if you could let your student know to be more careful in future, it would be greatly appreciated.”\n“He already knows, but he’s a student in his first term of hero school, detective. Are you suggesting he should be practising illegally to better hone his skills?” Toshinori watched Eraserhead with awe.\n“No no no, I wouldn’t dream of it. I understand that he’s only a new student…”\n“But?” The silent then why are you prompting him to do better when there’s no way he can do better filled the silence and Toshinori took a moment to appreciate the technique.\n“Never mind. I’m sure you all have it well in hand with the lack of injuries.”\n“We do,” Eraserhead confirmed with a grin.\n“That will be all. Thank you for your cooperation, gentlemen.” Tsukauchi bowed.\n“Happy to help, detective!” Toshinori boomed and saw Eraserhead wince. If only he knew… Oh well, all in good time.\n \nAll Might didn’t get the opportunity to pulverise All For One. The nuisance’s hulking figure immediately deteriorated and was replaced by a new and improved feature of All For One’s restless psyche. One that happened to be very real. All For One dove on Izuku the moment he appeared in their shadowy dreamscape.\n“Wow, that was quick!”\nAll For One crammed down his enthusiasm.\n“How was school?” He enunciated with the control of excited kindergartner.\n“Erm… not great.”\nAnd All For One’s face fell.\n \nToday was the day. The day where All For One could perceive for himself exactly what the Very Real Izuku’s Quirk could do in the real world. Should it have been joyous? He wasn’t sure after reading UA’s report and reviewing the footage from the USJ. Izuku’s real world applications were… inventive and… visionary in a manner that left the good doctor weeping puddles onto the floor.\nWhat good was Shock Absorption when Sir Isaac Newton’s laws of physics were the deadliest application of a bludgeon in the known universe? Truly, it’d be back to the drawing board if they were to counter not All Might, but a small child who’d be granted an honorary doctorate in Applied Physics within the next month of publication if the video ever went public. It wasn’t often you got to see a teenager give the universe a helping hand in beating another person nearly to death with themselves, but Izuku was clearly doing his best to expand the category.\nAll For One had the itching permanent paranoia of a savvying individual thrust into the throes of parenthood. It was this feeling that almost had All For One writhing in his chair like he’d been accosted by a nest of unusually large fire ants. It was the first task of the Sports Festival and All For One knew it wasn’t going to be anywhere near as smooth as the organisers would like to assume. Izuku was involved and nothing involving him was in any way simple.\nIzuku’s nonchalant jog towards one of the death machines designed to splatter him into the dirt was perceived by many commentators as foolish. All For One, who was now one Noumu less, knew when to brace himself. The moment Izuku’s hand extended, All For One had a prescient feeling of someone stop him before it even happened.\nIzuku was there, then he and the robot towering over him was not.\nThe robot’s amour was present. Then it was not. Nor were both arms. Nor were the arms of the robot standing next to it. All three disappeared.\nBOOM.\nThen the two robots collapsed inwards and Izuku was nowhere to be seen.\n“Holy crap! Cameras, eyes to the sky!”\nThere was Izuku, sailing through the air, armour plating tucked precariously under one arm. Every now and then, as he descended, his whip would touch the ground and he’d vault skywards once more. The rest of the class wasn’t even in the camera’s field of view.\nThere was a gorge, not that All For One would have noticed if the camera hadn’t briefly panned back to the stragglers before refocusing on Izuku. Izuku hopped it with a tentacle.\n“Ohhhhh, we’re coming up to the minefield folks! How will Midoriya handle it now that can’t land his vault? He’s making this look too easy! Someone stop him!” Present Mic screamed and All For One winced. Fat chance of that happening. If Izuku retaliated they’d be wiping them off the walls.\nBut, how would Izuku land… oh… unless… he wasn’t… intending to land.\nAll For One knuckles turned white.\nOn the approach, Izuku shot up almost vertically, the armour plate positioned beneath his feet. A net of black spewed from his hands, burrowing into the ground. Landmines rolled together like a tumbleweed and massed…\nIzuku was falling.\nFalling.\nThen he piledrived his plate into them.\nBOOM.\nThe view went white.\n“Where’s Midoriya folks!?”\nAll For One didn’t need the camera’s focus to resolve before a telltale chain of BOOMs moving away from the microphone spelt out Izuku’s plan in dreadful detail.\nBlasting along from mine to mine, his tentacles steering his makeshift sled along as pitched up and down, Izuku practically skated along the field and into the tunnel.\nThe king of explosions had lost his crown, beaten by leverage and a plate of metal. All For One savoured his mental image of Bakugou's impotent reaction.\n \nSensei didn’t laugh. Well, he rarely laughed and not in the unhinged way he was now. Tomura didn’t want to use the word disturbed, but what covered it? Creeped out? Weirded out? Spooked? Unnerved? All of them at once?\nSensei was fucking disturbing. Laughing at a kid who was rocket jumping to victory? What? The kid was insane, not funny. Was he even worried about the fall damage or the recoil from the landing? But Sensei knew this kid and even Kurogiri didn’t know this kid. This kid who popped out of the ground and threw Noumu into next week. Midoriya was disturbing too.\nDisturbing because he didn’t seem to care about what he was doing. His face a mask of concentration, his Quirk a bloated mass of congealed nightmares. The Cavalry Battle wasn’t going well for non-team Midoriya.\nThey brought guns and knives to a trip fight. Midoriya’s high speed repositioning of the mount was more pantshitingly terrifying, even as someone watching, than it was impressive. The pink haired one would reach out a hand… then Midoriya would blink away and smash them back to the ground with prejudice.\nLeaping around the arena. Tripping, snatching, harassing… Midoriya wasn’t out to dismount anyone, but he didn’t need to when a well placed single thread sent Todoroki’s entire team bouncing along the ground in a mad scramble to find their feet. He didn’t need to grab any headbands with that fucking shadow sneaking in and out of the chaos without a sound. Or that girl with the goggles who had… something… that was shooting… something else that was burrowing into the ground and exploding at random intervals.\nThe Ida family member tried to rush Midoriya and ended up shrieking from within a tangled spider’s web that Midoriya was surveying with interest. The camera zoomed in enough for Tomura to see that Midoriya commented on whatever… and to show, in great detail, the shadow yanking back on the web, before it fired Ida into his team like a bowling ball.\nNo, Team Midoriya didn’t need to dismount shit. All they did was drop some tripwire and let the laws of the universe curbstomp the other teams with big dick DPS and crowd controls.\nWho the hell is Izuku Midoriya? And why was the USJ the first Tomura had heard about him?\n \nAll For One wasn’t sure what was more entertaining. Watching Bakugou’s new career as a flail or listening to Tomura’s mumbled, half intelligible commentary.\n“That kid must have all of his points in DEX for a move like that…”\nIt was almost a disappointment when the timer ran down and poor Izuku staggered under the combined weight of the amassed headbands. Success was clearly weighing him down at this point and his relief at their removal was palpable.\nNot only had they come first, but they thrashed the opposition so soundly that an intermission occurred to allow all of his victims to be attended to by Recovery Girl. Truly an inspiration for all parts of the industry. That is how it was done. None of this namby pamby giving people warning. You had to wipe out the competition quickly and decisively.\nNot that Izuku’s year mates had learnt this rule as they agonised through their own mediocre tournament rounds. The suffering he endured for just a whiff of competent capabilities.\n“He’s a savage, Sensei.” Tomura muttered with a scratching sound, which would have been out of context had he not still been talking to himself well after the second round had ended. “How the hell are we meant to get around that?”\n“Good question, Tomura. In order to deal with All Might, you must first deal with the bulwarks shielding him from his death.” Like the five foot teenage boy who was firing the equivalent of anti-materiel rounds into his fellow year mates. If that’s what he was doing to them, All For One shuddered to think at his plan for Tomura to encounter All Might. Only pieces of Tomura would make it to the encounter at this rate.\nAll those years of effort foiled by a trigger happy teenager who whipped first and asked questions later. Oh well. It was Izuku. If anyone was going to foil it, at least it was him. Anyone else, at this point, would’ve been flat out embarrassing at a professional level.\nAll For One imagined the expression of wow, beaten by your own son on All Might’s face and resolved to take his secret with him to the grave.\nHe would have continued to dwell on the intricacies of such abject humiliation, but Izuku’s round began… and with a sharp yank All For One found himself dragged inwards… to a familiar realm.\n \nIzuku was walking towards the edge of the arena. Step by step. Inch by inch. He refused to lose like this! All Might told him to tell people that he was here and that’s what he was going to do! Izuku stared into the darkness, his feet still marching, and a familiar patch of shadows stared back.\n\nHisashi!\n\n \nIzuku was surrounded by shadows. All For One barged through them without a thought.\n“Get lost!” He barked and backhanded them as he passed. Irrelevant shades!\nHe wasn’t fast enough.\nHe saw part of Izuku’s finger buckle and snap into an awkward position, felt a snarl form and his strides lengthen into a sprint.\n“Izuku!”\nAnd All For One reached out and snatched at Izuku’s grasping hand. And his vision… shifted.\n \n“Is that it?” The green haired boy cooly asked, holding up his damaged hand. With a rushing hiss of… flesh rearranging itself, Hitoshi paled as the boy’s bones danced around into an undamaged mass. “Is that really all you can do?” What the hell? Wasn't his Quirk the tentacles?\n“What are you going to do about it?” Hitoshi snapped. Why hadn’t Brainwashing worked? What the hell was going on here?\n“Oh, I’m going to very politely ask you to leave the arena. That’s what I'll do.” Brainwashing went out.\nIt didn’t stick.\n“Oh, is that what that pathetic effort was? Your Quirk? How weak. The boy strode forward with a swagger. “I’m asking you to leave the arena. I’ll count to ten… and if you haven’t left by then… I’ll have to provide you a helping hand out of the arena.”\nHitoshi heard the boy’s frosty voice count.\nOne.\nTwo.\nThree.\nHis feet were moving without the rest of him. The rest was trapped within the beating of his heart which clawed and clenched at his ribcage like they were bars in a prison.\nFour.\nFive.\nSix.\nHe wasn’t going to make it. He wasn’t fit enough. His breath too short. His sprint too anaemic.\nSeven.\nEight.\nMidoriya’s tentacles were unravelling, bordered by an unholy red gleam that crackled along its growing length.\nNine.\nHitoshi threw himself.\nTen.\nCRACK.\nHitoshi saw arena where his feet had left flex into dust, heard the sonic boom and sighed with relief even as he ploughed into the ground beyond.\n“Very good,” Midoriya’s voice barely carried about the crowd. Calm, controlled, fearless. “But if you want to play with the big boys, you’re going to need more than a one trick Quirk. Perhaps some fitness first?”\nMidoriya smiled, a wide, toothy, menacing skull like grimace of an expression and Hitoshi felt a crushing weight that caressed him into unconsciousness.\n \nIzuku wasn’t sure how he’d been expecting the final round to go. After that weird moment where he blacked out and… Hisashi(?) trash talked Shinsou into forfeiting, the rest of it went pretty smoothly. Hisashi had been aiming to miss… and if he hadn’t, Izuku would be having words with him.\nOh well, at least Izuku hadn’t reacted as badly to it as All Might did. He looked like he’d seen a ghost sashay out from behind the nearest garbage can and moon him. He gaped wordlessly and Izuku patted him on the shoulder. They’d have to talk about it later when All Might felt better.\nBut was he expecting it to be harder? Sure, but he was also expecting Endeavor to be a lot more… erm… threatening when the man had marched up to him to extend his congratulations on Izuku’s precision whip work.\n“Shouto could aspire to the level of diversity you’ve managed with your Quirk!”\nSuffice to say, Todoroki’s follow up commentary on Endeavor’s behaviour was enlightening. And creepy. Very very creepy.\nBut Todoroki didn’t seem the least bit deterred until Izuku hijacked his ice to create a super happy fun slide. All Izuku had to do was lead with his whips in the right direction and Todoroki’s Quirk, slowly freezing him to death as it was, would jump from edge it edge. It behaved more like electricity than it did ice, grounding itself to nearby objects as it chased him.\nIt was going to freeze him to death. Izuku told him as much. But Todoroki had spite on the mind and all Izuku had to do was keep at it and-\n“ENOUGH.” Todoroki exploded into bonfire flames that made a beeline directly for Izuku.\nWhipping out a hand, Izuku blindly hurled his tentacles through the heart of the inferno and felt the acknowledgement of his energy strands. Then he yanked.\nTodoroki was deposited outside the arena by a slide of his own making and lay there panting at the sky. Hopefully he had something to think about. Even with both sides of his Quirk, there was no guarantee of winning with a bad match up or a poorly used Quirk. Izuku had warned him. He couldn’t afford to be holding back, not after the League of Villains had already targeted them once. It wasn’t safe.\nIzuku gave Kacchan substantially less warning. Kacchan was Kacchan and… well… explosions didn’t work on energy constructs, as Izuku had worked out in the second task.\nSo Izuku, as gently as he could, nudged Kacchan from the back during an extremely large blast that rocked the stadium. The recoil only helped to skip Kacchan like a stone from the arena and slam him into the side wall… where he slid down like a bug on a windscreen.\nIzuku sighed. Kacchan came away with that with only minor bruising and no broken bones. It was a success!\nOh… and he’d come first, that was nice too.\nBut the podium finish was subdued. Kacchan spent the whole time staring downwards without a word and Todoroki’s face was a mask of some deeper contemplation. Izuku managed to stretch out a pained grin, even while his legs were already running towards discussing One For All’s behaviour with All Might.\nThey were too busy for an awards ceremony! But still, Izuku tried to smile. It would’ve been terrible if he didn’t at least make an effort.\n \nAll For One didn’t know what to say…\nHe’d been Izuku.\nIzuku had been him.\nIzuku was a limitless void into which All For One stepped… with every single one of his own Quirks for him and Izuku to command with a whisper of intent. Every single stacked Quirk more than eager to release and set about its purpose and all All For One could do was hold on for dear life.\nHitoshi Shinsou had almost died. Inches from oblivion. If he hadn’t leaped from the arena and All For One had been forced to act more directly, they would needed a mop and a concrete sander to remove the stain left behind…\nIt was uncontrolled. It was wild. It was exhilarating.\nIt was not All For One’s Quirk.\nThere was no strain. No effort. No thought. Only an instant rush of some greater power leaping to attention, filled with rage and hate.\nAnd Izuku had to be warned, because if Izuku wasn’t dealing with All For One in any form he knew it in… then what was he dealing with?\nAnd why did Izuku assume All For One was his Quirk instead of a head bound anomaly?\n“What happened?” All For One and Izuku were in the decidedly more mutual part of their dream space. The passing dizziness of All For One’s inadvertent hijacking was still wafting about, making his head fuzzy.\n“I have a theory.” Izuku rocked back and forth. “I think… I think One For All not only has the shades of the previous wielders, but their Quirks too. You said the whip isn’t your Quirk, so it must be one of theirs.”\nIce. Ice water. And All For One was standing under it while it belted down.\n“One For All?” All For One repeated. “This… is One For All?” If he had a real head, it’d be spinning. Izuku… had… One For All… All Might… had given.. Izuku… One For All?\n\nWhywhywhywhywhywhywhywhy?\n\nIzuku nodded obliviously, vigourously. “Well, yeah, I shouldn’t have expected you to know everything.” It was extremely humbling that Izuku did somehow expect All For One to know everything in the first place. “That’s what the Quirk is called. All Might gave it to me, but he said his teacher saw shades in the Quirk. And if there’s echoes of people in the Quirk…”\nAll For One inhaled. Deep, steadying and completely imaginary. Then he breathed out. “Then why not their Quirks?” It made sense. What were the odds of the Stockpile Quirk snapshotting the genetic and mental imprint of its holder but not capturing the Quirk? Astronomically low, because if the Quirks caught a person at a genetic level, then of course it’d capture the Quirk. But… didn’t that mean-\n“Exactly. You’re one of the shades, the original, right?” Expectant, trusting… Izuku couldn’t know. All Might… didn’t tell Izuku about… All For One… All For One who was a part of One For All. A founding block in a madhouse of lunatics and now he was part of the asylum. Sharing a house with all.. of… his.. victims…\nAll For One froze.\nHe sensed rather than saw Izuku’s face change. Excitement melting away to open mouthed horror. “ Sorry! I’m sorry! I didn’t realise. You didn’t… you didn’t know you were in here, did you?”\nAll For One silently shook his head. No. At no point had All For One contemplated that One For All was more than a simple energy store. “No, but it makes sense….” Because his brother didn’t have a Quirk… which meant the Quirk his brother had transferred in reality…\nIn reality it was All For One. He was passing along his own brother’s ghost down along a line of people who wanted to expunge his own brother from reality.\nOne had almost succeeded.\nIzuku patted him on the shoulder and All For One leaned in to the heat… of his very real son in whose head he was currently residing. What even was the heat? Izuku felt it too. Why was it so warm?\n“But how is this Quirk even real? There’s nine wielders, total right?” Izuku hummed to himself.\n“Ten,” All For One automatically corrected. “I have to be included now.” All For One knew it was coming. It had to be coming.\n“What’s your Quirk then?” An innocent question. But Pandora’s curiosity had opened the box and released all manner of horrors into the world, hadn’t it? All For One could only hold onto hope now, because if Izuku heard this from another source…\n“I can give and take Quirks,” All For One said simply. “I gave a Stockpile to my brother. Only I didn’t expect it to stockpile me as well. One For All’s ability to transfer itself comes from me.” It was a relief to have it out there in the open. But how would Izuku react? Shame. Disgust? Horror? Could be any selection of them and more really.\nA second. Two. Three.\nThen-\nIzuku stared. “How many Quirks do you have and what are they?”\nAll For One really shouldn’t have worried.\nIzuku was a fellow window shopper himself.\n \nSorahiko stared between the video and Toshinori.\n“Toshi…” He began slowly.\n“Don’t ask, because I don’t know,” Toshi groaned with his head in his hands.\nMidoriya had more than one Quirk. Midoriya had tentacles. But Midoriya was meant to be Quirkless, so why the hell did he have tentacles?\n“Are you absolutely positive he…” The video cut to Midoriya stalking towards another boy in a matter so reminiscent of All For One that Sorahiko had to pinch himself to make sure it wasn’t some PTSD infused hallucination. “What the hell does his family have then?”\n“Fire Breathing and Telekinesis,” Toshi mumbled from under an arm. That seemed extremely improbable with these circumstances.\n“So then how the hell did he pull out tentacles and do…” Sorahiko’s mind went blank. “That.” How did someone even describe that? How did the kid ape All For One so well that All For One came back from the dead, packed his bags and went back to living in trees? Yeah, Toshi wouldn’t take that well, even coming from him. Midoriya hadn’t done anything wrong. That didn’t make him any less frightening.\n“It’s One For All. It has shades in. As far as “Hisashi” is concerned, it can somehow access the Quirks of the previous wielders in addition to other Quirks floating around it.” Toshi sounded as terrible as Sorahiko felt.\n“Previous Quirks? What previous Quirks?” Sorahirko repeated dumbly. “Hisashi? Who the hell is Hisashi?”\n“The Quirk,” Toshi groaned. “Hisashi is the Quirk and from what young Midoriya says, even it doesn’t know what’s happening. First time it’s had anything that could contact it before.” One For All was sapient? When the hell did that happen?\n“One For All’s name… inside the Quirk… is Hisashi….”\nToshi nodded. “ErmandAllForOneisintheretooprobably,” Toshi blasted out with the grace of the Hindenburg.\n“Your successor is possessed by the ghost of All For One,” Sorahiko repeated and felt a vein throb. All For One who couldn't even die properly. All For One... thank god... hadn't know One For All could do that when he was alive. \"Why Midoriya?\"\n\"He looked inside the Quirk and found one of the shades,\" Toshi was muttering, refusing to look at him.\n\"And when he stared into the abyss, the abyss stared back and All For One's ghost popped out and said hi?\" Sorahiko meant to be sardonic.\nThen Toshi quaintly nodded and there was silence. All For One was dead, but he wasn't dead. The Noumu were linked to someone who could give multiple Quirks but was that All For One or someone else? Why the hell was this so complicated? Why couldn't the murdering bastard just stay dead like a normal person?\n“Sir rang as well,” Toshi was broaching so hesitantly that Sorahiko had the impression that Toshi was addressing an alligator and not his former teacher.\n“And? What did that good for nothing have to say for himself?” Sir Nighteye. Crazed fanboy who thought he had the right to tell old timers like Sorahiko and Toshi how One For All should work. Jumped up little upstart had no idea about the significance of One For All. The Quirk was there to stomp down trash like All For One and, by all accounts, it had already done that job. It wasn’t up to some ignorant twerp to lecture Toshi in particular about suitable One For All candidates. Sorahiko already had that job, thanks.\n“He still thinks Mirio Togata should have received One For All.”\nOne second.\n…\nTwo seconds.\n…\nThree seconds.\n…\nSorahiko erupted into a belly laugh. “Really? He thinks that Mirio Togata, a fool of a boy if there was ever one, can handle the ghost of All For One?” As if. All For One would’ve compelled the boy to strangle himself in his sleep. At least All For One’s more malevolent run off was helping Midoriya rather than hindering him. If that wasn't the case, Sorahiko would've been making emergency arrangements to get the hell out of the country. “And what did you say to him about it?”\nToshi weakly grinned. “Told him that Mirio Togata didn’t win the Sports Festival in his first year.”\nWinning was putting it mildly. Midoriya hadn’t so much won as made the rest of the participants reconsider entering in the first place.\n“Ohandhe’spickedyouforhisinternship,” Toshi blurted out in a rush.\nIt took Sorahiko a moment to interpret the sentence.\n“Ah, hell.”\n \nIda was going to do something irresponsible. Hisashi spotted it first.\n“Izuku, if someone did that to my brother, the term stain would not be used in any metaphorical sense once I got ahold of them and nor would anyone talk me out of it. You have a serial killer running around killing and maiming people. Of course Ida feels a responsibility to bring him in.” Hisashi might have sounded like a raving lunatic to the rest of Japan who didn’t like to admit that serial killers were a problem, but it made perfect sense to Izuku.\n“I should go with him then,” Izuku suggested, because making sure Ida wasn’t going it alone was the responsible thing to do.\nHisashi seemed to… flicker. Then he settled. “Not to worry.” Then he paused, and made a pained noise. “I’m here, after all.” Poor Hisashi. A ghost who didn’t even realise he was a ghost. Izuku would have to take care of him, otherwise he was also prone to bouts of irresponsibility from his own descriptions.\nNot that any of that impressed Gran Torino. “Midoriya. Why are we in Hosu?”\n“To prevent Ida from capturing Stain, sensei,” Izuku succinctly answered. Ida was angry. Not controlled, not calm and definitely not thinking about what he was trying to do. No way would a calm Ida go chasing after a serial killer for something as petulant as revenge.\n“We aren’t leaving this to the other mountains of pro heroes in the area because…?” Gran Torino trailed off and Izuku beamed at him.\n“Because they’re the bait, sensei.”\nAnd all Izuku had to do was pounce when Stain made his move.\n \nSensei was sleeping. He was doing that a lot lately. He’d given Tomura a handful of Noumu, rolled over and gone back to sleep. Sensei didn’t care about Stain or his placement in the newspapers. Sensei thought Stain was a waste of oxygen. (So does Midoriya, that treacherous voice whispered. He agrees with a lot of what Sensei does, but doesn’t like killing people, does he? Midoriya who speaks to Sensei. Midoriya who knows Sensei. Midoriya who thinks you can do better. Midoriya. Midoriya. Midoriya.)\nTomura was going to hunt Stain down… with a little bit of help, sure. But he’d show Sensei and Midoriya that he was a better class of criminal and not some PKing scrub who went after the low hanging fruit. He’d show them all.\n“Kurogiri, follow the pro heroes patrol routes. Stain’s a rogue, so he needs to ambush his target. Let’s gank him while he’s not looking.”\nTomura bared his teeth. It was showtime.\n \nThere were odd reports on police radio. Odd… creatures… roaming around the rooftops.\n“Noumu!” Midoriya exclaimed without an ounce of hesitation. “Shigaraki must be here somewhere.”\n“League of Villains Shigaraki? The hell is he doing here?” Sorahiko scratched his head.\n“He’s after Stain,” Midoriya answered without a flick of doubt.\n“How do you-”\n“-Because he told me when he tried to kidnap me!” Midoriya called and was already gone, bolting up to the roofs on sleek strands of black.\n“Why the hell was he trying to kidnap you?” Sorahiko huffed, hot on the boy’s heels. Damn he’s fast!\n“Because I maimed him at the USJ!”\nHuh. Yeah. That sounded about right. Villains having their teeth crunched in did tend to attract their attention. They always thought that the moment a pro hero broke their arm and shoved it up their left nostril that they’d found some sort of kindred spirit.\nSorahiko knew about Midoriya’s real kindred spirits and Shigaraki was going to be lucky if those spirits didn’t break all of his bones and find some way to shove them up his nostrils backwards.\n \nTomura squinted downwards. Three people in an alleyway. Native. The younger Ida. And Stain. Tomura’s lips pulled back, Kurogiri’s Warp Gate opening beside him. “Force Stain up to the roofs,” he ordered and the attack commenced, the Noumu slipping to the alley below.\n“Tomura Shigaraki… are you not going yourself?” Kurogiri was hesitating. Tomura had no idea why Kurogiri was being such a scrub over the party leadership. It’s not like Tomura could kick him for asking questions. How the hell was he meant to get back to the bar if he did? You didn't kick your home warp. Ever. It was too useful.\n“I’m still injured,” but Tomura’s gaze was fixed on the scuffle below. “But maybe I can make Stain’s job harder. Open a gate near the pro and the kid.”\n \nNative was going to die. Ida was going to die. They were both paralysed. They were going to die.\nThen three stacked pieces of meat fell from the sky and Stain was sent flying backwards.\nA haze of purple appeared beside them and a figure casually stepped through and giggled.\n“Shigaraki!” Ida called, still helpless on the ground.\n“No need to panic, Ida.” Only the faintest part of Shigaraki’s face was visible, but what was there was almost demonic. “I’m here to help.”\nNative trembled like a leaf in a typhoon.\n \nStain was forced to climb. Those animals were making him climb. One of them had wings and kept buffeting him back when he tried to slide in a blade. He hadn’t even been able to land a single blow on them. They kept their distance and hurled, toss and lashed anytime he tried to get back to street level.\nDodging. Ducking. Weaving. Didn’t matter. All he did was climb higher and higher upwards.\nOn the roof now and he was exposed. This was Shigaraki’s work. But where the hell was Shigaraki? He’d lost sight of the filth in the alleyway a while ago. He’d have to deal with these three before he could deal with the fake hero trash below.\nWith any luck, none of the fake pros were patrolling the tops of the skyscrapers.\nThen something gentle tugged at his ankle and Stain realised he’d made a terrible mistake.\n \nStain was dragged from his rooftop with a girlish squeal of terror. Familiar black threads had hooked him and were retreating. A green haired boy was bounding from roof to roof and a man in yellow right beside him, Stain slapping into cold hard concrete behind him.\nMidoriya was here! Sensei was right. Then again, Midoriya had probably told Sensei since Sensei said they often spoke to each other. Midoriya who was helping a classmate. Sensei who shrugged and said “well it’s really none of my business” and went back to sleep. (Sensei was sleeping a lot lately. The doctor and Kurogiri were worried… but Sensei seemed more peaceful.)\n“You, fly ahead of Midoriya!” Tomura barked at the winged Noumu and it dipped through Kurogiri’s portal with a snarl.\n \nStain couldn’t recover. If he didn’t adjust with each impact, the black goo holding him was going to strangle him. Thrashing like it was alive, trying to loop itself around his throat as a tentacled noose. Stain sliced, cut, stabbed and corkscrewed and it did nothing. No blood to paralyse with. No pain to break its grip. And he was dragged.\n\nThump.\n\n\nThump.\n\n\nThump.\n\nAlong Hosu’s rooftops by some brat with tentacles. One tile, TV antenna and satellite dish at a time.\nBut he was going to hold on. It was his resolve. He wasn’t going down like this, no, he refused!\n \n“Is he out cold?” Tomura heard a higher pitched voice call.\n“Not yet!” Answered an older one. Midoriya’s teacher?\nWho cares? They didn’t have all night. “Noumu, get him!”\n \n“SKREEE!”\nIzuku ducked.\nTalons whizzed past his face and he heard a grunt from behind along with his tendrils going taut and straining. Straining. Izuku was being pulled backwards.\n“Midoriya! Let go, it has Stain!”\nAnd Izuku did, hearing a dull scream echo into the distance.\nStain was gone.\n \nMidoriya did a number on Stain. He was turning purple when the Noumu finally caught him. Now here he was, back in his precious alley, a Noumu holding each limb outstretched and Tomura standing on the fourth with a crunch. \nStain had licked some blood (from the winged Noumu, it was bleeding wasn't it?) and that did a grand total of shit all as far as Tomura could see. It was still flying just fine.\n“You said that I didn’t have an ideal,” Tomura spat at Stain who glared back indifferently.\n“You don’t. You’re like a child breaking things because they upset you.” Stain jerked his head towards Tomura. “Your ideals are nothing.”\n“But that’s the thing I wanted to tell you!” Tomura hissed. “I don’t need an ideal. I don’t need to be a slave to the thoughts of other people and society. I don’t have to care about what they think or what you think.” Tomura smirked and saw the apprehension creep onto Stain’s face. “Worked it out have we?”\n“Worked out that you’re just another piece of criminal filth gumming up the cogs of society?” Stain heaved.\n“Eh, why not?” Because what did ideology matter… when the greatest purveyors of it were fake themselves? “Noumu.” Tomura took a moment to savour the little ticks and twists that flashed along Stain’s face. “Pull.”\nWith a wet snapping noise, Stain was no more.\n“That was messy.” Kurogiri was swaying slightly as he looked at what remained of Stain. “Get a grip, Kurogiri. We need to make a delivery to Midoriya.”\nKurogiri dully nodded and they warped away.\nWhat a good night. He'd tell Sensei when he woke up.\n \n“Shigaraki,” Midoriya nodded.\n“Midoriya,” Shigaraki nodded back. “These are yours.” With a wave of his hand, Ida and Native were dumped onto the ground at Midoriya’s feet in a splash of purple. “Try not to lose them next time,” Shigaraki sneered.\n“Alright,” Midoriya replied with a raised eyebrow.\n“Thanks,” Shigaraki said shortly and disappeared.\nMidoriya immediately dived to the floor. “Are you two okay?” He was already ripping off strips of fabric from somewhere to staunch the bleeding. \"I wasn't fast enough! I'm so sorry!\"\n“We’re okay, Midoriya… but… why did Shigaraki save us?” Ida groaned.\nMidoriya blinked. “He did what?”\nSorahiko stared between Midoriya, the pocket of air Shigaraki had occupied and the two still alive individuals at their feet.\n“Midoriya. What the hell was that?” Why was the boss of the League of Villains thanking Midoriya for anything?\n“I have absolutely no idea.”\nFrom the four dumbfounded expressions each exchanging glances, only one person knew what happened and he warped the hell out of there as soon as he was done. The paperwork for this mess was going to trail out his apartment and into the one across the road.\nSorahiko was going to strangle Shigaraki next time he saw him.\n“You, with your teachers permission, preemptively attacked a villain with your Quirk.”\n“No, I didn’t.”\n“Yes, you did.”\n“No, I didn’t.\n“Ye-”\n“No. I was saving an unknown figure from the three men chasing him. Then he stabbed my Quirk, then I defended myself,” Midoriya said shortly. “We were there for a training exercise since two of my other classmates were there for internships of their own. You’ve had those documents for long enough to read them. What do you expect people to do when some maniac with a knife attacks them?” Sorahiko did his best to stop his jaw from sagging.\n“But you’re a student!” Yeah, that student line wasn’t going to cut it here. With Shigaraki onboard, they’d kick Midoriya out of one job and straight into another unregulated form of the same position. Not much of a threat when the criminal sector was actively hiring. Sorahiko didn’t know what the hell was going on, but the crime rate was skyrocketing even with Toshi still holding on. Villains were mobilising, but no one could work out why or even how they were so well resourced.\nThey could rule Shigaraki out. He didn’t give two shits about what every other criminal was doing around Japan and wasn’t providing resources.\n“And you’re the police. Why weren’t you coordinating with the heroes on patrol to herd and capture Stain? How many people did he have to kill before you developed the slightest competence required for your chosen field?” Something was off about what Midoriya was saying. It wasn’t that he was wrong. No, he was absolutely correct about the lies the police were trying to feed him.\nNo. It was the fact that it felt and sounded like All For One had barged into the National Diet, announced himself Prime Minister and started an inquiry titled An Investigation into the Core Competencies and Quality of National Policing and Pro Hero Behaviour under Section 34(a) of the Regulation to Promote Proper Quirk Usage. It only gave Sorahiko some small measure of relief that the chief of police looked as put out by Midoriya’s responses as Sorahiko did thinking about Prime Minister All For One running Parliamentary machinery.\n“A man was killed!” The chief had clearly given up and was resorting to the policing favourite of scream at someone until they agree with you. Oh, the poor bastard.\n“I really don’t have time for your lack of professionalism. If you want to discuss the matter of your Department’s misconduct further, my lawyers will be in touch.” Lawyers. When the hell did Midoriya get lawyers as in the plural?\n“You can’t do this!” Ah yes. Panic. There was a familiar feeling associated with speaking to Midoriya. Not being the receiving end was a nice change.\n“Of course I can. I haven’t broken any laws. It’s up to you to prove wrong doing. Should the public become aware that you know of Stain’s past as the serial killer Stendhal and still failed to act… well… there’s nothing I can do to help you.” Even god wasn’t going to save this Department from the wrath of Midoriya’s lawyers.\nIf Midoriya had lawyers anything like him, they’d be mopping the police prosecutor off the ceremonial coat of arms following the evisceration. This is not a case the police would win. Not when Midoriya’s PR team (where did he even get one of those from?) had already publicised the assault, the complete lack of a police response and the small, niggling detail that UA students and a pro hero had been rescued by a supervillain.\n“I’ll see you at the appeal then, chief,” All For One’s younger clone smirked, all teeth, all intimidation. “Sensei?”\n“Yeah, yeah, I’m coming.”\nOnce they were safely out of earshot, Sorahiko turned to Midoriya. “You don’t really have a PR team, do you?”\nMidoriya’s earlier demeanour was discarded like a poorly performing race horse.\n“No way! I can’t afford that, sensei!” The boy laughed. “Not with all the money for the lawyers!”\nSorahiko stared. Oh god, surely not?\n“That was a joke, sensei.” Sorahiko heaved a sigh of relief. Small favour right there. Midoriya with a team of hardcore lawyers. Was there anything worse? “No, someone heard something from someone else and they passed it along and then someone else posted about it on the chans. A mainstream journalist who reports on the chans posted and then had it confirmed by a police source.”\nBlinking, Sorahiko stewed for a few moments on what Midoriya just said. “Are you saying that Shigaraki leaked what happened to the media?” Shigaraki was the only person who really knew what was happening. But why would he… how would he benefit from that information? What was he playing at?\n“I think so. Him or someone who knows him? I dunno.” A normal teenage response filled with uncertainty. Occasionally and only occasionally mind, did Sorahiko see why Midoriya had been picked for One For All. Beyond his obvious expertise in having criminals fill their pants which also an important quality for the job.\n“And what does he get out of that?” Sorahiko stroked his chin.\n“Street credibility. He killed Stain, who he called a fake. Might be good enough as far as Shigaraki’s concerned, since he thought Stain got far too much attention for being the same as every other psychopathic criminal.” Made sense. Midoriya’s frown of concentration exposed the amount of effort and bullshit he’d put in to avoid police retaliation.\n“One last thing.” It was bugging Sorahiko more than he wanted to admit. “How did you know about Stain’s past as a… differently named serial killer?”\nMidoriya nodded, like an excited puppy. “I looked for vigilantes with paralysing Quirks and it was a really short list. Only one on it.”\n“That’ll do it,” Sorahiko gruffly agreed.\nIt was just like Midoriya to go sniffing around after someone’s Quirk. Kid needed restraints before he slipped his leash and bit someone in the attempt to goggle at their Quirk.\n \nThe arms braced by weights that weren’t as fucking huge as the other weights he’d seen. Because of De-Midoriya’s fucking leverage, All Might’s handicap wasn’t as big as the rest of the teachers. All that did was fuck with Katsuki’s portion of the exam. Midoriya and his fucking leverage.\nAll Might grinned.\nKatsuki almost filled his pants (not that anyone was ever going to know about it).\n“Is there any reason,” Katsuki growled through gritted teeth. “That we’re paired up?”\nMidoriya shrugged. “The tests are about teamwork. Maybe they’re setting us up to fail?”\nYeah, that had Eraserhead written all over it. Smug bastard was hunting for a way to kick Katsuki out and Katsuki wasn’t going to stand for this shit.\nYeah, his previous teachers put him on a pedestal and now the system was doing its best to kick Katsuki off it. That didn’t mean he was going to take shit from some arsehole who was playing mind games with his students. This wasn’t the fucking military and he wasn’t their fucking drill sergeant. There was no way of kicking his shit in, so Katsuki was going to do it the only way he knew how - by passing with flying colours and giving him the finger as he cleared the exit.\nYeah, he was gonna fuck some shit up, even if he had to do it with Midoriya.\n“Oi Midoriya, your tentacles. How fucking long are they?” Long as fuck as a general rule, but was that gonna be long enough? Midoriya’s Quirk was fucking weirder and creepier than Midoriya himself and that was saying a lot.\n“Few city blocks. Why?” Midoriya scratched his head. Fucking city blocks? What drug was his fucking Quirk(s) on? (He saw that fucking regeneration and no one was telling him any shit about it being a trick of the light. All Might fucking cringed too while watching it. Fuck that noise.)\nKatsuki cracked his knuckles. “You ever watched WWE?” If Midoriya had it was going to make this more bearable than having to explain the finer points of a German suplex or a lariat.\n“Yes,” Midoriya said with the dawning expression of a reality gaming prick that knew all about leverage. “Wrestling ring?”\n“Fucking wrestling ring,” Katsuki grunted back.\nMaybe this would work out after all. Midoriya knew his shit, as much as it repulsed Katsuki.\nNow all they had to do was prove they could do it without killing each other and they were fucking set.\n \nToshinori had a bad feeling when he saw the black mountain of tentacles seal him into a vaguely rectangular shape with his students.\nHe had an even worse feeling when young Bakugou immediately rubberbanded off one in a straight line to the next black link in Midoriya’s ring.\nBecause that’s what it was - a wrestling ring.\nAll Might kept up his cheesy smile and grinned at his students.\nToshinori was regretting not taking that warm bath last night.\n“Come get some!” Bakugou screamed and hurtled at Toshinori, his hands firing wildly.\nThe whole time the ring of black was quivering slightly, the only reminder that it was attached to a living being.\nYeah, Toshinori really should’ve had that bath.\n \nShouta watched the replay with a raised eyebrow.\n“They stealth suplexed you. How?” Stealth suplex. There was a phrase Shouta hadn’t ever been expecting to use his in teaching career.\n“I was watching for young Bakugou, not young Midoriya,” All Might shrugged. “It’s extremely difficult to keep track of so many threads with the light source constantly changing.”\nVision issues, huh? Shouta could respect spotting issues. “Bakugou followed the rules?”\n“He played to the rules perfectly. No friendly fire, no insults, no aggressive behaviour as soon as they’d laid out me long enough for them to flee to the entrance.” All Might pumped a fist. “Full marks!”\nShouta jotted a few points into his notebook. Bakugou was getting somewhere. There’s a relief. If Shouta ever had to deal with Bakugou’s mother again, he was taking backup. If Midoriya’s Quirk needed a muzzle, then Bakugou’s mother needed Alcatraz to keep her away from the Earth’s polite general population. Her getting married and procreating was already too dangerous a concept for the population of Japan. Didn't take a genius to work out why her son was one screaming match away from a nervous breakdown.\n“Any reason why Midoriya wasn’t doing more with his Quirk?” Restrained wasn’t a term Shouta would usually apply to Midoriya on his best days.\n“Quirk troubles,” All Might replied. “It was being unusually temperamental so he volunteered himself as support to Bakugou’s lead.”\n“For as insane as his Quirk is, Midoriya’s a responsible kid at heart.” Responsible for the avalanche of paperwork Nedzu had to deal with after him and his supervisor belted Stain into next week.\nBut, eh, Shouta couldn’t complain. Wasn’t every day you got to see a master of leverage use it on the police. Some called it blackmail, but he knew it (like all wise people did) as the careful leveraging of Japan’s legal system.\n \nIt’s amazing how you don't know you needed a day off school until you finally had one. Izuku hadn’t been to the newly renovated bookstore at the mall yet. Hisashi had some recommended historical reading that wasn’t… strictly speaking… considered historical for legal reasons, but suggested it anyway. Apparently, while the series hadn’t got off the ground as history books, they’d made it as an old school urban fantasy series.\n“He… cheated the censor by selling it as a work of fiction?” Izuku queried, feeling like an idiot for having to ask.\nHisashi snorted. “It’s not like the censor cared. He took one look at it, said it was too ridiculous to possibly be real and sent it off for approval.”\n“I’m not saying I don’t believe you… but…” Izuku was struggling with the concept of an individual being that indifferent about their job. “How did no one else notice?”\n“None of them spoke English, which I assume didn’t help when the censor had to read an English language book and could only identify all of about twenty words which sounded suitably fantasy like.” Hisashi shrugged and slapped Izuku on the back. “The lesson here is to never assume that your country’s bureaucrats have more than a single communal brain cell that’s loaned between departments for years at a time.”\nA censor that had people who didn’t speak English reviewing English books. Yeah, Izuku could see why Hisashi had lapsed into bouts of maniacal laughter while trying and (failing) to explain why a history book was being sold in the urban fantasy section. Izuku was more stunned that Hisashi had somehow managed to divine secrets from the censor’s office. It was like being led into the Cave of Wonders and escaping with the djinni’s lamp.\nSo there Izuku was, in a somewhat shady bookstore, hunting down a full collection of the fantasy series All For You. Izuku still wasn’t sure exactly what it was about, but Hisashi’s nudging pushes and the promises of tales from the past were enough of a siren’s lure.\n“Yo, Midoriya,” a ragged voice hissed and Izuku craned his head.\nIzuku squinted for a moment then brightened. “Oh! Hi Shigaraki. How are you?”\nShigaraki’s hooded head bobbed agreeably. Seemed to be made of thicker material than the rags Izuku had seen him wearing last time as well. “Doing pretty well. Yourself?”\n“Been better. I can’t find this book series. Have you heard of a book series called All For You?” Izuku craned his head. Where on earth could it be? It wasn’t an unpopular series and there’d been a lot of reprints (all of which the censors had clearly ignored as well).\nInclining his head, Shigaraki gazed at Izuku with an expression close to reproach. “It was a book series? I thought the game came first.”\nBlinking, Izuku glanced over his shoulder. “A game? They made a game from it?” Huh, maybe’s that why Hisashi was laughing.\n“A game, an anime, a live action series, a radio play, a stage show and an opera,” Shigaraki droned. “But all of these came after the MMO,” he added.\nAt this point, Izuku was beyond resisting. “What was the game about?”\n“Superheroes fighting off an oppressive government regime. You could play as the vigilantes or the government.” Shigaraki's chapped lips perked up. “Vigilantes have the best storyline.”\n“Wait, it’s still around?” Izuku did a double take. How old was this game?\n“Still booming. I’m max level if you want a carry,” Shigaraki offered and Izuku had the impression that this was the closest Shigaraki could come to saying “friends?”.\n“Sure, guess I can play since it appears I’ll be ordering online.” Izuku hadn’t played a video game before in his life, let alone one based off a lost slice of history. But it was the year of new experiences from what Hisashi was saying. If it kept Shigaraki busy, why not play?\n“Sounds good.” Shigaraki then sidled up to Izuku. “Also, there’s a line of people who want your head on a platter,” he murmured. “Heard about it from some of Sensei’s contacts who’ve been keeping ears to the ground. We pissed off a lot of Stain’s wannabe supporters.”\nFrozen, Izuku faced a distressingly close Shigaraki. “Do you know who and when?”\n“Some group of noobs called the Meta Liberation Army. Their guild is shit tier with no achievements to its name. Can’t find anything on them apart from them being part of some giant conspiracy cult with their members in a lot of high ranking places.” Shigaraki absentmindedly scratched his ear. “Sensei said they’re an old group with new leadership. Bunch of nutjobs who go around killing anyone they can’t liberate.”\nOh. That was… interesting. “Erm. Liberate how?”\n“Liberate from their common fucking sense from what I’ve read. All they do is run around killing people who don’t use their Quirk like a monkey with a stick. If all of them are big shots, why the hell don’t they lobby the government for deregulation like every other cult of corporate weirdos?”\nFamiliarity in the wording buzzed in Izuku’s brain and Izuku bounced. “You’ve been reading Atkin’s Guide to Government!” Shigaraki followed up on Izuku’s book recommendations! Hisashi was going to be thrilled.\n“Yeah, yeah. Wasn’t too bad once I got past that shit about something originating from an origin point in four different languages.”\nSympathy filled Izuku in the same way water fill unsealed roof spaces. “Yeah, that wasn’t the best chapter I’ve ever read…” To the contrary, Izuku needed several flowcharts to read the concept even without understanding it.\n“Might get the second volume while I’m here,” he muttered under his breath. Then he passed Izuku a slip of paper. “I’ll text you if I hear anything else.”\nThen two very different people went their separate ways, with Izuku checking All For You’s class section on his phone as he left.\nShigaraki really wasn’t that bad compared to other supervillain’s he’d read about. If it was a toss up of Shigaraki and Muscular, Moonfish, the guy who was burning people alive and that crazy girl who ran around stabbing everyone, Izuku could safely say he was more comfortable with Shigaraki.\nAt least Shigaraki gave people plenty of warning before he killed them and, beyond cleaning up his social skills, it was the most Izuku could ask for at this point in time.\nWell, that and working out which class would best suit his play style… Seemed like the prestige class All For One that Izuku liked the best was gated behind a ridiculous legendary quest. Ah well, Shigaraki would know more about it anyway.\n“Midoriya,” Uraraka’s uncertain voice entered reality. “Who was that?”\n“Someone I play games with sometimes.”\nTomura Shigaraki wasn’t an idiot. Sensei was supportive, but not much help when his newfound narcolepsy meant he spent more time sleeping than he did awake. At least the doctor said Sensei seemed happy about it even if Tomura could hear the quiet grinding of the doctor’s teeth with every call. There weren’t a lot of options for competent advice in the matter of supervillainy, as Tomura had discovered while playing All For You with Midoriya.\n“I dunno, Shigaraki,” Midoriya’s voice hauntingly floated through the headset (a younger, more casual Sensei, almost). “I don’t think there are that many supervillains around who do follow any sort of system or strategy. The biggest problem with organised crime in Japan is that it mostly isn’t organised. We can nail one or two people who know each other, but without evidence for conspiracy charges, it makes it really hard to get people involved in the organisation of the crime.”\nTomura hummed to himself as he mopped up some cop in PVP. Shitty ranged builds. That meta was trash ever since the game came out. Like a rifle was gonna do shit to his evaporation build. Midoriya’s dark haired avatar next to him was violently rifling through another decapitated PC’s pockets.\n“So if you were a cult of morons who thought your troglodyte ancestor was some sort of saint in spite of being a total scrub, when would you attack someone?” Tomura couldn’t hear Sensei. Muted himself just before he dozed off? Meh. Sensei didn’t have to waste his time on a dead guild.\n“Me personally?” Tomura heard Midoriya murmur. “I wouldn’t do anything personally. I’d hire villains with an already established reputation and have them work as mercenaries. If the Meta Liberation Army is as established as you say then sure, they do have a lot of resources.” The MLA had more money than god from the threads Tomura could spot. A lot of big name CEOs, politicians and more loser PUGs than Heroes United could recruit on a good day. There wasn’t a lot on their numbers, but they had more than enough money to buy a raid team or twenty.\nMidoriya’s character lifted out a piddling handgun, pointed it at a Support in carbon fibre and Tomura watched the maxed PC’s health bar drain in three GCDs flat. Shit that was broken. “Anyway,” he continued, “they might have the money, but they also have more to lose if they’re linked to any attacks. The moment the police find out that it’s a full blown treason attempt they’ll block access to any bank accounts linked to the members. If they really are an army, then they’ll need more than goodwill to fend off the pro heroes and other villains there to make a name of themselves. No money, no Meta Liberation Army,” Midoriya's avatar nodded agreeably.\nMidoriya was good like that, better than Sensei even. Sensei wanted Tomura to find the answers for himself, but he didn’t even know where to begin in farming noobs with NPC assistance. Not only was it doable, but Midoriya seemed to think that the NPCs could cripple the MLA’s ability to buy consumables. If Tomura could link the attack to the MLA then… Tomura grinned. They’d have an army until the money ran out and they were ripe for the nuking.\n“Well, on a lighter note, I almost have enough blood coins for All For One,” Midoriya’s character emoted a sigh. “I get the feeling the developers really didn’t want people to ever earn this class.”\nIn all fairness to the devs, they probably didn’t expect some scrub five minutes into playing a video game for the first time in his life to spend nine hours finding the best way to cross class spec his talent tree into skill growth levels. Then them to spend another twenty hours abusing event items to buff the already stacked skill growth by another seventy five percent. Then, they sure as hell wouldn’t have expected him to use the shittiest grey weapon you got at the start of the game to max out skill growth in each tree because it didn’t have an internal cooldown. If they didn’t banhammer Midoriya for exploits, they were sure as fuck going to nerf the Dingy Handgun as soon he he got the prestige class. At this point they may as well ditch the original name and call it Jack of All Trades for the maxed out ability ranks. Midoriya didn’t need thirty years to grind when he simplified it down into a week long leisurely rolling around the map one handed with mouse macros and drinking tea.\n“Another couple of days,” Tomura agreed with a wild smirk.\nSomewhere, out there in the dank depths of a basement level office, a developer was crying his eyes out. Personally, Tomura was gonna relish that image after the Celestial Alignment Drake was added to the cash store instead of in-game. Every. Single. Dripping. Tear. Oh yes. Those bastards were going to be the ones paying this time, without their precision little Legendary quest stalling the meta. They were going to have to go back to the drawing board to pulling something new out their arses. Next patch was going to be awesome.\n“Oh, well. I’m going to bed. Thanks for helping. Shigaraki. Night!” Midorya’s character waved, a few hundred k of gear glinting with enough enchantments to passively blow a mob’s head off.\n“No problem. Have a good night, Midoriya.” And they both logged off for the night.\nWell, Midoriya logged off for the night. Tomura left one game and entered another, pushing his way back into the bar where Kurogiri was sneering unpleasantly at a lipstick mark on a glass.\n“Kurogiri, I have an idea for what to do about the MLA,” Tomura nodded.\nKurogiri winced, but Tomura didn’t have to care about it. Not like Sensei was going to be addressing any complaints for the next eight hours.\nTime to see if bottleneck farming worked the same way IRL as it did in game.\n“But I need to borrow a Noumu first… is the doctor around?”\n“Yes, as a matter of fact, I am,” the doctor’s voice oozed along the internet.\n“Great.”\nNow all he need was a crowbar, some paint and a stencil and they were good to go…\n \nIt was meant to be an easy job. Get into the apartment, kill the kid and leave. His mother was functionally Quirkless and the kid was saved from Stain by the punk from the League of Villains. Their contact never said that the kid’s death had to be quick, only that he had to die. There was nothing about what was to be done with the delicious flesh.\nIt was easy enough to get in, since the front door had been left unlocked. He wouldn’t have to focus on work for very long then-\nThen.\nNothing at all-\nMoonfish felt only the briefest caress of his face, then.\nNothing.\n \nThey said it was it was any easy job. Get to the cute boy, kill the cute boy and after that… well… anything went really. Himiko was sure Izuku Midoriya was going to be a cutie. A cutie nerd with good grades and a soft face.\nHe’d look so much better with a hole or seven in him, then she could be closer to him, then she could be him!\nAnd aw, how kind? He even left the door open for them. He was going to be special. Himiko knew he was going to be special.\nHe was going to be-\nMoonfish in front of her exploded in a spray of red, and sent Himoko stumbling and sliding in a sea of intoxicating red. The smell wasn't like anything she'd inhaled before!\n“Hello, MLA filth,” a white haired man leered from within the shadows of the door. “Would you like to come in?”\nThere wasn’t a speck or droplet of the red on him. Not that Himiko would’ve been able to tell without closer inspection, with him wrapped in dark clothes.\n“Who are you?” She panted, eyes refusing to focus on the figure who refused to leave the dark.\nSo much blood! Dizzy! Enticing. It was everywhere? Who was he-\n \nDabi watched the carnage from afar. Spinner, Twice and Muscular stood with him, the collective posture slowly morphing from bored indifference to wonder as it began to rain blood from the top of the building. Mustard lurked further away, but with his gas he wasn’t worth much more than delaying any pro heroes who turned up to interfere with the job. Muscular had been circling in an antsy manner. Then the rain poured.\nIn the distance of the landing, a chainsaw was aggressively revving.\nOne by one, bodies dropped from the building.\nMoonfish was a puddle filled with teeth that splattered messily on impact.\nToga was missing both her arms when she crashed into the pavement. She wasn’t getting back up again with that neck angle, either.\nThere was the windup of a chainsaw humming through and Compress’s mask with head still attached whistled through the air towards him in a ballistic trajectory. Dabi dived sideways to evade it. Twice wasn’t so lucky and squealed, it bouncing solidly off his shoulder and he fell to the ground with it in a heap.\nMagne, who was standing behind Compress wasn’t faring any better. First her hands fell, severed at the wrist, then the rest followed in a neat pile at the base of the building, tumbling through the air and bouncing on handrails as they fell.\nMustard who was part of the exit team vanished in a black mist Dabi only caught from the corner of his eye. Dabi heard a screech of terror and a wet splat, as if somebody fell from a great distance, out of sight in the nearby alley.\nDabi’s hands were yet to leave his pockets.\nThat was the League of Villains, boss, huh? The team’s employer told them Shigaraki was immature and lacked planning skills. The Shigaraki their employers mentioned wouldn’t have baited a bottleneck and trapped all of them in it to be mowed down by Shigaraki and whatever the hell that thing with the chainsaws was. They weren’t being paid enough to deal with this shit.\n“Well, that wasn’t in the instructional pamphlet,” Twice remarked in a cheerful voice. Dabi stared at him. “I propose we stay here and see what happens next,” he suggested, before his voice sharply went up an octave. “No, you idiot, we need to run the hell away!”\nTwice was gone, sprinting away into the darkness. He wouldn’t get far, not with the warper floating around.\n“Coward,” Muscular grunted. “I wouldn’t run awa-”\nPOOF.\nMuscular disappeared in a haze of black.\nOnly then did Dabi’s hands leave his pockets and he erupted into flames. Lucky last. The League had a warper and so long as he couldn’t touch Dabi, then he wasn’t going to do whatever the hell happened to Mustard to him. Dabi took a few careful steps backwards and raised his hands.\nThis was fine. It didn't matter if the rest were dead. It was only work.This was meant to be an easy job. Their contact hadn’t told them shit about the League doing guard duty. This wasn’t worth the money or the risk. Even if they weren’t here, the pros would show up to deal with Shigaraki painting an apartment building red so he could take the risk.\nDabi waved a hand and watched the blue flames shoot up the insulation of the apartment building. Luckily the cladding was enough of a death trap that it’d do the job for him. If the kid died in the blaze, then he’d get paid anyway and not have to deal with sharing the reward for the job.\nAnd he did the sensible thing and ran for his life, even as he heard Shigaraki snap a command and sneakers thump into the ground behind him.\n \n“Kurogiri, get the Midoriyas out!” Tomura snarled, over his shoulder, then he thought for a moment. “And get everyone else out as well or Midoriya will be pissed.” And PK him into next year, in an entirely literal manner.\nVaulting from the balcony, he landed on the ground below with only the slightest buckling of his knees (he could worry about that later). He could feel the heat on his back as he sprinted after the fire user. Blue, burning, enough to incinerate the drowsy woman and her son who were asleep in the apartment further down. Swapping the numbers was enough to fool this group of idiots who didn’t do their research before kicking in the first door with a number on it, but the fire didn’t give a shit about Tomura’s careful planning.\nTomura so glad he’d taken the time to change the numbers on the doors. Fucking idiots burning a building down. What kind of noobsauce raid team sent up a beacon to call every single piece of trash in the raid to them? Maybe before he met Midoriya he’d have been stupid enough to do the same, but now skipping trash mobs was his way of life. You only spent time on the rares that dropped the BiS loot… Unless it was the arsehole who set Midoriya’s building on fire, then you kicked their shit on principle.\n \nAnother easy night. Izuku’s babbling filled the otherwise stale air.\n“Grinding for the blood coins is going really well. Only a few more and I’ll have enough to buy the quest item,” Izuku was vibrating with excitement. Then Izuku would be the first to have ever held the All For One in All For You… all because the developers had left in the talent stacking allowances designed to let All For One function correctly in game to begin with. All For One could hear his brother’s ghost laugh at him from the shadows.\n“I’m not sure how well-”\nIzuku disappeared.\nEvaporating into thin air in a haze of black gas.\nGone. This hadn’t happened before. Where was he? Did someone wake him up?\nAll For One shot to awareness leaning forward and an overwhelming taste of coppery air immediately slammed into his tongue.\nMovement behind him, two sets of feet staggering under a third dead weight.\n“Careful, you idiot! You’re going to drop him! We don’t even know how bad those are yet.” Tomura hissed.\n“My apologies, Tomura Shigaraki.” And Kurogiri. Then who was the third?\nAll For One could taste blood and burning… someone was burning. Infrared snapped on and a figure smaller than the others glowed brightly. “Tomura?” He was overwhelmed with the stench of people that was a tangible presence in the room. Tomura who must have smelled more like a slaughterhouse than a gamer who left the house once a month.\n“Hi, Sensei, there was a bit of an incident,” and All For One could make out Tomura nervously scratching the back of his head even through the casual tone of voice. “Can you do something to help heal Midoriya’s burns before he dies from infection?”\nIf All For One still had eyes, he would have stared.\nIzuku here. Izuku injured. Izuku who disappeared from One For All!\n“Bring him here!” He ordered and felt Izuku obligingly be dropped into his lap, distinctly lacking the wet slurry that clung to Tomura. All For One’s hands immediately rested on the side of Izuku’s face as the Quirks flowed and the flesh mended. Izuku could handle these with ease, thankfully, because if he wasn't able… “What happened?”\n“The MLA torched his apartment, Sensei,” Kurogiri bowed and All For One felt a well of energy writhe its way through him.\nAll For One’s metaphoric eyes narrowed to slits. “And how did you know about it?” Tomura who never took the initiative… Tomura who somehow knew before he even did.\n“We didn’t,” Tomura said bluntly and All For One heard a fluid drip off him and hit the floor. “We busted into the abandoned apartment on the same level as him and swapped the door numbers. We camped their spawn, Sensei.” And the universe righted itself in a glorious sigh of relief.\n“You spawn camped the Meta Liberation Army’s murder attempt,” All For One repeated, wondering how much of their camping tactics in All For You had escaped into the real world. If it was anything like the game, it’d explain Tomura’s… unique “smell”.\n“Yeah, but not well enough. One of them got away, but I can find him later.” Not if All For One got to him first. “Crazy bastards,” Tomura grunted. “None of this blood is mine, who knows what diseases these people have either,” he added with the air of an individual dragged kicking and screaming to first aid classes. Except All For One had never forced Tomura to any first aid classes... Had Izuku?\nOf all the times though… why did he not know about this? He knew about every other harebrained assassination attempt and scheme in the past… In the past when he hadn’t spent most of his free time resting and surfing along the upper edges of Izuku’s sensory perceptions. In the past when he didn’t spend his days looking for new and exciting ways to make Eraserhead’s forehead vein grow that little bit bigger.\nWhile his thoughts wandered and Izuku shifted restlessly in his arms, he heard it… an escape.\n“And where do you think you’re going, Tomura?” His head was still spinning, even as he clutched and slowly funnelled Regeneration Quirks into his scorched child, but he could still feel Tomura carefully inching away. Tomura who was going to do what exactly?\n“A shower and change of clothes, Sensei.” That was remarkably blasé for Tomura. “Then I’m going to go set their fucking building on fire and see how they like it,” Tomura called, then fairly threw himself through Kurogiri’s warp without once looking behind him or waiting for a reply. (Of all the times for him to develop some independence.)\nAnd Tomura disappeared, leaving All For One alone with a speedily healing Izuku… and what was sure to be the entirety of the Top 100 including All Might as soon as they realised he was missing and Tomura was involved.\nThat was fine. In fact, it was preferable. If All Might was amicable, All For One would personally see to it that he received an invitation for the planned event.\nAll For One grinned.\nIt was a nice relaxing night. At that moment, Toshinori would later with hindsight realise that he’d jinxed himself.\nToshinori didn’t have time to shift into his muscle form before the room changed in a rush of black and he was unceremoniously dumped into an even dimmer room than his bathroom. He winced at the wet noise he made when he hit the ground and dragged himself to his feet.\n“All Might,” a familiar voice snarled… without any follow up attack. Huh. That was new. “We have something to discuss.” All For One was remarkably living sounding for someone who was meant to be dead.\nToshinori adjusted his bath towel and attempted not to think about his limit for the day being well and truly up. “Could you have waited until I had clothes on?” And until One For All was back in business for the day? Both of those would have been extremely convenient.\n“I think this is more important,” All For One insisted and Toshinori squinted into the darkness. No sneak attack? Was the old dog learning new tricks?\nThere he was, propped up in his seat but… but… with him…\n“Young Midoriya!” Oh nononono, when had the bastard worked it out? How the hell-\n“-If you’re this excited now I can’t wait to see how you react when you find out that the Meta Liberation Army set his apartment complex on fire while he was asleep,” All For One’s steely tones cut through Toshinori’s panic. Cut through his panic with another helping of it, and what felt like his legs being cut out from under him. But there was still young Midoriya, calmly swaddled in a blanket while clinging to an overstuffed teddie. It only would have been more picturesque if a thumb was jammed into his mouth.\nWhat fire? Where? Why was young Midoriya here and now of all places? When Toshinori inhaled deeply, he could indeed smell the remnants of smoke. So... All For One had perhaps saved someone? Unthinkable.\nToshinori had been warped to the Twilight Zone and didn’t even have a pair of pants to save himself with.\n“Destro’s Meta Liberation Army?” Toshinori instead asked, feeling an extremely uncomfortable breeze rush past him. “The hell did they come from?” Well, Toshinori honestly doubted it was Shigaraki. The man was practically giving a Feat of Strength to Midoriya in the name of friendship. The complete opposite of setting someone’s house on fire.\n“They’ve popped out from the collective societal spawning pool of degenerates, inadequacy and irrelevance,” All For One hissed back. “You’re aware that Tomura and Izuku are friends, yes?” Is that why All For One has young Midoriya? Shigaraki had palmed him off here after the fire?\nToshinori nodded in response to the question. Friends with Toshinori’s blessing, because so long as they were beating the crap outta people in All For You, Shigaraki wasn’t doing it in the real world. Could he have told the police? Sure, but prison these days wasn’t doing much in the rehabilitation department. If Shigaraki did anything that wasn’t communally minded, he was getting an expedited trip to the slammer. “Yeah, so what? Since when have you been on first name terms with young Midoriya?” Barking back, there was the faintest twinge of tension.\nAll For One stood, still holding young Midoriya, and it wasn’t a pretty sight. Talk about not being able to save face. There was nothing left to save at this point. Young Midoriya was carefully deposited, still snoozing, into the chair, his teddie readjusted and All For One stepped past Toshinori without a single hint of aggression.\n\nCreepy.\n\n“This way,” All For One gestured and gaping, Toshinori trotted after him, bare feet slapping the ground and his towel struggling to escape off him as they went.\n“I was expecting a more extravagant murder attempt,” Toshinori confessed, self consciously hoisting up his towel.\n“And I was expecting my son’s teacher to be a shameless user and complete fraud, but here we are,” All For One shot back.\nToshinori’s brain dwelled on the word son.\nThen it hurled itself to All For One and One For All.\nIt bounced to Hisashi and his arsenal of Quirks.\nTo Black Whip, to the Regenerations not accounted for in the other wielders, to Hisashi’s feral, savaging, misanthropic behaviour that was worthy of All For One…\nFinally, the two endpoints connected at the same time a chilly breeze blasted through his flagging towel.\n“You’re Hisashi Midoriya,” Toshinori stated to All For One’s still retreating back. Hisashi sounded like a raging misanthrope… because he was the original raging misanthrope.\n“Yes, I am,” Hisashi Midoriya, the spirit of One For All agreed and young Midoriya’s father agreed.\n“Now what?” Toshinori wanted collapse back onto the floor. How the hell was this going to work? Did young Midoriya even know for himself?\n“Now, Toshinori Yagi,” Hisashi Midoriya murmured, “I put the fear of me back into them.” Then he smiled, the sort that hounded Toshinori in nightmares of Nana’s death. “Would you like to assist? All Might has a responsibility to protect the community, correct? The responsibility to offer those in need a helping hand in the dark?”\nThis? This was familiar. This was All For One, every bit the monster Toshinori himself had killed years ago.\nAnd now? Now all of that rage, malice and spite was pointing at someone else. Another criminal who'd wronged the man's son and all Toshinori wanted to do was crawl back into that warm bathtub.\nIt didn’t matter how this ended. There was no way in hell Toshinori was ever attending another parent teacher meeting with All For One alone if an apology maiming of his successor’s attackers was his way of saying sorry.\nJust like the feral guard dog that snapped and snarled at Katsuki Bakugou with every practical...\nWith a single name, it made a terrifying amount of sense.\n \nEverything was going according to plan… until it wasn’t. Rikiya Yotsubashi was finishing up his paperwork for today and by all accounts, the entirety of the day was proceeding smoothly. All he had to do was wait for confirmation that the League of Villains boss and his pet hero had been disposed off and Rikiya could move on to his bottle of grange with a celebratory tipple.\nCRASH.\nWindows of the skyscrape buckled in, Rikya ducked. A heavy object hurtled through the air, slamming into him and knocking him from his seat. Blinking downwards, he observed.\nRed. Blood red. But not his blood.\nHe stared at the object… and the glassy eyes of Mr Compress stared straight back into his own.\nThe raid wasn’t a success, after all. Pity, he’d have to shelve the grange for later.\n“You’re Redestro, yeah?” A rasping voice guttered across the room.\n“Tomura Shigaraki, I presume?” Redestro sighed. How uncivilised. A head? Really?\n“Yeah, you’ve got like three seconds before that head explodes,” presumably Shigaraki responded without answering the spoken question.\nRikiya hurled the cadaver and ran.\nBOOM.\nAnd he flew, skipping the whole way down the corridor, smashing into the wall at the end.\nNow? Now he was upset.\n \nThey stepped back into the building even as the aftershocks ravaged its structure. Right where Redestro was meant to corner his way into sight in not too long. Tomura bounced a bottle filled with liquid in his hands, clicking his lighter rhythmically.\nTomura didn’t think he’d seen a more girly run from a man in his entire life. This was Redestro, the big bad head of the MLA? Useless bastard couldn’t even handle a head full of C4 going off. Fucking useless. The further he ran the more fun this was going to be for Tomura, even if he was still soaking wet from the impromptu shower (and from what Kurogiri said, All Might wasn't doing any better). That didn’t matter when Redestro was going to be just as history as the original Destro.\nTomura didn’t need any fancy shit to torch a building. Yeah, Sensei had Noumu who could light shit up, but he also had a Noumu to open cans for him. No, this needed a more personal touch. Tomura delicately re-shouldered a bag of soon to be burning molotov cocktails and gestured at Kurogiri.\n“You checked the floor plans?” This building didn’t matter. All of the company’s data were held on offsite servers they used to plan their noobsauce little raids on, so everything in this place was fair game for the construction of the all new and highly temporary All Might Symbol. It was only going to last a few hours, but a few hours was all Tomura was going to need for this little schooling project. All he needed for the heroes to march in and investigate an arson.\n“Yes, Tomura Shigaraki,” Kurogiri nodded. “Must we be so overt about this?” Not that Kurogiri wanted to go along with it, but even Sensei hadn’t disputed Tomura’s planned bonfire.\nTomura hurled a cocktail over his shoulder and watched flames crawl along the wall. “He tried to kill Midoriya, Kurogiri,” Tomura grunted. “What sort of criminals are we if we don’t torch his building in return?”\n“Poor criminals?” Kurogiri’s uncertain voice answered above the crackles. “Was us taking down Stain not already in that category?”\n“Stain?” Tomura hurled back his head and cackled. Stain, eh? That irrelevant has-been? “Nah, Kurogiri, that was taking out the competition.” Not that the local serial killer ever really was competition. No, Stain breathing the same oxygen as Tomura was offensive enough, let alone sharing press coverage.\n“It was?” Not that Kurogiri ever knew the deeper reasoning for the plan, not when Sensei spent so much time sleeping off whatever was wrong with him. There was no one to clarify ideas with when Sensei wasn’t present and that worked just fine for Tomura. He had his own contribution to make before Sensei stepped in and did his part.\n“Yeah, what else did you think it was?” Kurogiri would’ve thought it was a petulant reaction and maybe in a different universe, a different timeline, that might’ve been true. But that wasn't this one.\nA groan echoed from the approaching corridor, like some zombie world boss spawning to wreck shit for the first time after server reset.\nTomura lit his molotov and, as the mass of black staggered into view, hurled it and dived into Kurogiri’s warp. He heard the faintest echoes of a scream of rage as he began to kite the huge prick down the building, one fiery blast at a time. There wasn’t any need to take a hit, not when IRL didn’t have a Dingy Handgun to exploit despite Sensei’s best efforts.\nIn the end, it was just like Midoriya had said when they had tea that day. In a world without villains, there were no heroes.\nAnd who said Tomura had to wait for the heroes to mop up all the villains?\n \nThe lunatic had dropped a burning building on him! Without a moment’s pause, he dragged himself from the rubble.\n“Ha! That’s not going to work on me,” Redestro snarled. Shigaraki wasn’t even using his Quirk, but hurling molotov cocktails. Was he so ashamed of his Quirk that he wasn’t even going to try to use it? Oh how the unenlightened flailed in their chains of restriction. The head of the League of Villains and even then it wasn’t enough to free him from society’s expectations. “Do you really think the heroes will save you now? Do you think anyone can save you?” No one could escape the full might of the Meta Liberation. They would be liberated or they would be removed from the fabric of their new society.\n“Oh, a threat. How quaint, but you see… Tomura wasn’t intending to kill you,” a deep resonating voice pleasantly explained and Redestro paused. That voice… “Tomura's mission was to ensure that we had the correct view count, wasn’t it Tomura? So we can leave an acceptable impression for the behavioural standards of this country.”\nThere was a dry cough. “Yeah, Sensei. I boosted up the viewer count for our IRL stream with the collapse. Mainly so Midoriya can watch it later. To cheer him up since he lost all of his merch.”\n“That was very thoughtful of you, Tomura.” All For One’s previously unknown voice remained perfectly cordial. “And in the spirit of Izuku’s recovery, it would be terribly remiss of me if I didn’t… also extend my own toast to his recovery.” A small chuckle. “I’ve been wanting to see how this combination worked for a while.”\nRedestro was on his feet.\nToo slow.\nToo late.\nAll For One’s hand was already extended.\nHis arm bulged, warped, then-\n- BOOMBOOMBOOMBOOMBOOM-\nRedestro lost count of the buildings he levelled as he tumbled through the air. The wind ripped at his face and eyes even through his Quirk.\nCRASH.\nWith one final casualty of a fast food outlet, he hit the asphalt of the carpark with a sharp pain and rolled to a halt in a blur of agony. Was All For One going to follow him? Or did he have time to regroup and summon reinforcements? All For One wasn’t meant to be here! Why would he care if some brat was eradicated? What did posting this to the internet serve to do? All For One had no remaining reputation...\n“Wow, you know the old bastard’s still got it if he can punt you from end of the city to the other,” a majestic and entirely all too familiar voice exclaimed.\n“All Might.”\nRedestro gazed upwards at All Might’s shadowed face and broad, almost etched in permanent grin. “Fear not, citizen, for I am here. All you need to do is surrender quietly and you won’t be harmed.”\nAll Might who taught Midoriya’s class at UA. All Might… who should have been in a feud with All For One. The blood left Redestro’s face.\nHe braced.\nAll Might twitched.\n-BOOMBOOMBOOMBOOMBOOM.\n \n \nToshinori was trying not to think about it.\nNot Redestro.\nNot the line of buildings he owned that were being levelled with every impact.\nNot the way he was being belted between the two of them back and forth with volleys and backhands and topspin.\nNot the fact that he’d been repeatedly told not to get up, but did so anyway.\nNot the way his arrogance had turned into shrieks of terror and attempts to flee.\nNot the way he’d erupted into flames when Shigaraki slammed a molotov into his Quirk covered face on the previous landing at All For One’s feet.\nNot the way Kurogiri had portal looped him in a vertical loop to enhance his travel speed and subsequent damage.\nNot the way All For One forced Toshinori to redirect all of his blows back into the leader of the MLA for fear that bystanders would be taken out by a human bullet.\nAnd he certainly wasn’t trying to think about how his feud with All For One led to a game of live tennis where the ball was another breathing human being. Except this time, attacking each other wasn’t the name of the game. Not really. All For One wasn’t even really aiming for Toshinori this time. Because…\nNope.\nHe wasn’t thinking about it.\nEver.\nHe also wasn’t going to think about the satisfaction he felt when, finally, Redestro hit the pavement for the last time and All For One wrapped his hands around the bastard’s throat.\n“You know what, Yotsubashi?” Redestro’s Quirk abruptly blinked away and a thin man was left dangling in the giant’s grasp. “I think your organisation is going to need a different name, since none of you are going to have Quirks left to liberate.”\nAll For One vanished, leaving what was left of the HQ of the MLA to merrily burn throughout the night while Toshinori wheezed for air.\n“Toshi,” Gran Torino roared, “what the hell happened?”\n“All For One happened,” Toshinori groaned, diving behind a convenient hedge and allowing his muscle form to melt away.\n“And?” Gran Torino yelled. “Why the hell was he here of all places?” Why didn’t he kill you? That was the real question.\n“He was giving us a helping hand with the local villain population.” Eagerly and gleefully so…\nUntil there’d be no villains left for young Midoriya to catch.\n\"What the hell are you talking about?\"\nToshinori didn't have the heart to tell him or the swarm of heroes who arrived to comb the still burning rubble.\n \n“Hisashi?” Izuku whispered groggily, smelling ash and soot hover about the air. This wasn’t normal for One For All. One For All also… wasn’t generally positioned in a bedroom either. Nor were its nonexistent pillows so comfortable. No, this was a real room and not a dream.\n“Yes, Izuku?” Hisashi’s voice answered from over Izuku’s shoulder. Except the problem was that Hisashi only existed in the dream.\n“Where am I?”\n“Where I live.” Or did he only exist in the dream?\nIzuku took a moment to parse where I live until it formed meaning to accompany the words themselves. “Where you live? You’re living?” Hisashi was alive? How did that even work?\n“See for yourself.”\nIzuku craned his head and came face to… person. From the mouth to the lower jaw it was normal enough, but nothing could hide the spray of scar tissue that made up the rest of Hisashi’s face. Nor did it change that fact that when he reached over to touch Hisashi’s arm that a familiar heat radiated. He was alive, but living had a different meaning attached to it.\n“What happened to you?” Izuku murmured, shoving aside his location related questions. Hisashi was real!\n“I picked a fight with All Might and lost,” Hisashi shrugged. “There’s nothing quite as humiliating as being beaten to death with a Quirk you yourself created.” What? Why would Hisashi pick a fight with All Might? All Might hadn’t hurt anyone. But... hadn't All Might been injured by a nemesis of his own...?\nIzuku gawked at Hisashi.“You made One For All?” All Might hadn’t really mentioned much about the Quirk’s origins. There was a really strained expression on his face that always made Izuku delay asking the question. In hindsight, maybe Izuku should have been more aggressive with his questioning.\n“A gift for my brother,” Hisashi nodded, patting Izuku on the shoulder, with an almost blistering warmth. “From All For One came One For All.”\n“All For One?” Izuku dully repeated. A Quirk stealing vigilante, who was ancient, who had a Quirk called All For One… Like the exact plot from All For You… with the prestige class of All For One. “You’re All For One?”\n“All For One is a title,” Hisashi dismissed, waving a hand. “A bulwark for centuries of criminality.”\n“Oh…” All For One… who was left maimed by All Might. All For One who never stopped having problems with the government. All For One whose lore involved... rebellion against the government. That all made sense... But there was still something missing there…\n“But I think you of all people have the right to my full name.” A full name that by all accounts didn’t technically exist anymore if the lore of All For You was correct. All For One had changed his name.\nFeeling numb, Izuku nodded and continued to stare at his Quirk.\n“My name is Hisashi Midoriya. I’m pleased to finally meet you again in the flesh, Izuku.”\nHisashi Midoriya… who had a son called Izuku.\nOne second.\nTwo seconds.\nThree seconds.\nAnd together it all clicked. Hisashi the Quirk made sense with the simple addition of a word. Hisashi the person was now the mystery. \n“Oh, so that’s why you kept telling me to break Kacchan’s arm!\" \nHisashi’s only response was a winning grin that stretched from non-existent ear to ear. \nBut if Hisashi was Izuku's old man... then Izuku could ask as many questions as he liked and Hisashi wouldn't be able to escape answering them.\nAnd Izuku beamed straight back.\nIzuku didn't really know who Hisashi Midoriya was... but now he can find out."
}