{
    "id": "21517714",
    "url": "https://archiveofourown.org/works/21517714?view_full_work=true",
    "author": [
        "LadyKenz347"
    ],
    "title": "The Troublesome Thing About Time",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Hermione Granger/Draco Malfoy"
    ],
    "characters": [
        "Hermione Granger",
        "Harry Potter",
        "Draco Malfoy",
        "Theo Nott",
        "Future Draco Malfoy"
    ],
    "additional_tags": [
        "Co-workers",
        "Time Travel",
        "Smut",
        "Fluff",
        "Little bit of angst",
        "secret pining",
        "Two Dracos!",
        "Not REALLY infidelity... but if you're very sensitive to the topic maybe not for you",
        "Gray area",
        "Forced co-habitation",
        "Auror Draco",
        "Snarky Cinnamon Bun Draco",
        "Irritable Granger",
        "Infidelity",
        "Older Man/Younger Woman"
    ],
    "language": "English",
    "series": "",
    "published": "2020-11-22",
    "completed": "2020-11-22",
    "words": "38,914",
    "chapters": "9/9",
    "comments": "1,068",
    "kudos": "10,082",
    "bookmarks": "2,910",
    "hits": "194,441",
    "summary": "<p>Hermione was sick of adventure. She'd had her fair share, and taking a seat at the desk in the back of the DLME was all she could have dreamed of -- until it wasn't.</p>\n<p>One day Hermione is summoned to the bowels of the Ministry where she is met by the lead Unspeakable who has a rather odd situation that needs to be dealt with.</p>\n<p>Draco Malfoy has just arrived from twenty years in the future and insists on speaking to his wife, Hermione Granger.</p>\n<p>The only problem is that the Draco Malfoy she knows is still the snarky, button-pushing boy upstairs--and not the man in front of her now.</p>",
    "notes": "<p>\n<a href=\"https://www.wattpad.com/story/233591444-fic-d%E1%BB%8Bch-dramione-the-troublesome-thing-about\" rel=\"nofollow\">Vietnamese Translation</a>\n</p>\n<p>Ahhh, it seems LK has a heart. All your lovely reviews today telling me that I'm killing and torturing you by having you wait have paid off! Enjoy, sweet friends.</p>",
    "text": "\nA/N: Here we are again, friends! I’m super excited (and nervous) to share this fic with you! It’s written in its entirety just working on edits. You can expect updates a few times a week until it’s complete! \n\n \nxXx\n \n\nTHE TROUBLESOME THING ABOUT TIME\n\n \nxXx\n \nDropping her quill, and earning a few unwelcome ink splats, Hermione cradled her throbbing wrist, flexing it as she sat back in her chair. Her body ached, and no amount of pain potions or hot baths could soothe the unending weariness that had settled deep in her bones. \n \nAs she watched the bustle of the Department of Magical Law Enforcement, she couldn’t help but think that at some point in her life, she might have veered left, when she was meant to go right. She was Hermione bloody Granger for crying out loud, destined for great things from a young age, ready to set the world ablaze with her brilliance; yet here she sat with a cramp in her wrist and a scowl on her face. \n \n“Wotcher, Hermione,” Harry beamed, his hair tousled and his glasses crooked as he lurked outside her cube.\n \nShe couldn’t help but bristle, sitting up straight in her chair and pinning him with a pointed stare. “Harry.”\n \n“How’s your morning?” His insatiable grin was impossible to ignore and Hermione let out a long breath as she turned her attention to her friend. \n \n“Perfectly mundane, as per usual. And you? You seem rather…” Hermione’s brow puckered as she studied him. “ Breathless.” \n \n“Hah! We just got done doing a major raid down in South London. Found crates of Dragon Eggs tucked into some seedy little shop in the Muggle part of town. It was wild. Turned out to be an all-out wand fight by the end and there are now a handful of sleazy criminals in holding cells and a dozen dragon eggs on their way to Romania.”  \n \nJealousy twisted in Hermione’s stomach as she forced a tight smile over her features. “That’s brilliant, Harry.” \n \nIt’s not that she wasn’t happy for him—no, that wasn’t the case at all. After all, they’d been through during the war, she just hadn’t thought it was in her best interest to sign up for a life of catching the bad guys. She’d already done her share, after all. And so she took the path less traveled, she’d joined the DLME as a Special Case Investigator. \n \nIt was a very fancy way of saying that she did research.  A lot  of research. It came with certain perks: access to the Ministry Archives and her nights and weekends free. But it lacked a certain level of excitement that now, after four years, she could admit she missed about her youth. \n \n“Potter!” Malfoy’s voice interrupted the moment as he strode up to her cube in all his smug indifference, tossing a Gryffindor scarf at Harry’s head. “You forgot this on my desk. Next time, I’m changing it to the proper colours and charming it stuck to your thick neck.  Granger ,” he crooned wickedly, leaning his bum on the edge of her desk. “You’re looking positively…” \n \n“Don’t finish that sentence,” Hermione warned, poking her wand into his hip to rid him from her space. “Don’t you have more important things to do?” \n \nMalfoy snorted, turning to rest one hand on her parchments and the other on the back of her chair. Caging her in, he leered down at her, his lips tugging up in a familiar smug smirk. “More important than riling you up on a Monday afternoon? Never.” \n \nBeing the daughter of dentists, she could appreciate the way his pristine white teeth gleamed beneath his smirk, but she still desperately wanted to clip his perfectly chiseled jaw with her fist. In the spirit of moving on, however—and in the interest of not being fired—she refrained. \n \n“Why do you love to irritate me so?” she purred, poking him again with the tip of her wand, this time sending a small jolt of magic into his leg. He yelped, backing away from her with a pointed glare.\n \nLaughter boomed past Harry’s lips as he clamped a hand on Malfoy’s shoulder and tugged him away. “Let’s go, partner. We’ve got a shite ton of reports to fill out before Robards has our arses.” After a few steps, Harry turned, delight still etched in his features. “Dinner, Hermione?” \n \n“Only if that twit you call a partner isn’t coming!” she called back absently, waving a hand at them as they retreated to the Auror Department.\n \nxXx\n \nEyeing the cramped booth at the back of the Leaky, Hermione wished she could say she was surprised to see the blond sitting next to her brunette best friend. \n“Oh, you came. So glad you could make it… again.” \n \n“Looking good, Granger.” A smooth, familiar voice drawled from behind her and she jumped as Theo Nott swatted her playfully on the bum. Sending her his most charming smile, he slid in next to Harry, pressing a quick kiss to his cheek as his hand came down to rest on her friend’s thigh. \n \n“Hi, Theo.” Hermione fell into the seat next to Malfoy, grumbling under her breath as the blond turned towards her, a wicked grin forming on his face as one arm stretched out behind her. “ Malfoy .” \n \n“Miss me, love?” Hermione’s rolled her tilted her head at the wizard to her right, finding his handsome face all too close for her liking. He was a prat, sure, but a handsome prat nonetheless, and being in such close proximity was dangerous for her well-being. His tongue darted out to wet his bottom lip, before he trapped it between his teeth, letting his gaze rove lazily over her features. \n \n“You’re incorrigible and why I tolerate you remains to be seen.” Hermione reached to grab a menu, her shoulder brushing his chest as he scooted infinitesimally closer to her, his palm finding her thigh. \n \nReturning to her upright position, now with Malfoy nearly sitting on her lap, she unfolded the menu. “Draco Malfoy, so help me, if you do not remove your hand from my leg, I will remove the bones from it myself.”\n \nMalfoy barked out a wild laugh and extricated himself from her space. “Oh, I just love it when you’re feisty, Granger.” Draining the last of his firewhisky, he lifted a finger towards the barkeep, motioning for another for the table. “First round’s on me, boys.” \n \nGroaning, she buried her face in the pages of the menu she’d memorized years ago. Merlin save her from Draco Malfoy.\n \nxXx\n \nHermione yawned, stretching her arms high above her head as she shimmied the sleep from her bones. It had been foolish to stay out so late on a weeknight, but she’d found that being in the presence of the unadulterated, sickening, sweet love of NottPott—as she’d so cleverly dubbed them—with a strong side of Malfoy required alcohol. And once she'd started, it had been far too difficult to stop. \n \nOver the years, she’d found that he was far more tolerable after the sated buzz of alcohol clouded her inhibitions. He was almost… funny, in a dry, careless kind of way that she was only fond of after at least two firewhiskys. There had even been one incident—after an almost illegal amount of alcohol on her twenty-first birthday—when she’d found herself pressed up against a wall in the Leaky Cauldron on the way back from the loo with Draco Malfoy’s tongue in her mouth.\n \nShe'd forgotten most of that night, truth be told, but one didn’t forget a kiss like that. The memory of his rough, almost desperate touch as his hands roamed her body, gripping the flesh of her arse as he pressed his knee between her thighs and crushed his lips to hers, lingered in the back of her mind. \n \n“Granger!” a booming voice commanded, breaking her reverie. \n \nHermione blinked, drawing herself from the sordid memory and swiveling towards her department head.\n \n“Yes, Sir?” \n \nShe was greeted by the top of Peterson’s shiny, bald head as he shuffled through a stack of parchments, offering her the smallest semblance of attention. “Sanders is requesting you down in the D.o.M— stat .” \n \n“Sanders? D.o.—”\n \nPeterson sighed, finally sparing her a glance over his handful of files. “Cicely Sanders? She’s the department head for the Unsp—”\n \n“Unspeakables, I know,” she interrupted, rising to her feet with a knitted brow. “But why on earth would they want to speak to me?” \n \nWith a long, exaggerated sigh, Peterson returned his attention to his paperwork. “Perhaps you don’t understand the general idea behind Unspeakables, Granger, but they tend to keep their cards fairly close to the vest. In other words, she didn’t tell me jack shite.”\n \nPeterson walked on, dropping a few files on her colleague's desk as he made his way back into his office, and Hermione couldn’t help but gawk. She couldn’t think of a single reason for the Department of Mysteries to seek her out. \n \nxXx\n \nHer heels clacked across the black marble leading to the entrance of the Department of Mysteries. Torches lined the walls, flickering in a bluish tint as she approached the looming door at the end of the long hall. \n \nFlashes of memories from the night she’d spent here fifth year seared behind her lids, and the phantom pain of a curse long since healed seared her side. The thrumming of her heart was nearing a frantic level, and she could feel her palms slicken as she nervously wrung them together. \n \nThere was a small part of her that wondered if the D.o.M had heard of her and wanted to offer her a job. Although, that seemed unlikely considering her resume consisted of little more than an impressive list of educational credentials and accolades followed by a few years of sitting behind a research desk. \n \nPausing before the grand doors, she steadied her breath and lifted her fist to rap against the handleless door, but before her knuckles could brush the surface, the doors swung open. She sucked in a startled gasp, before quickly recovering, adjusting her skirt and tilting her chin high. \n \nThere was a decrepit looking woman behind a tall desk, deep lines etched on her face, and age spots staining her fair skin. Her hazy glasses sat low on the bridge of her nose and she didn’t even bother to look up from whatever she was so intently perusing on her desk. \n \nAfter several long beats of silence, Hermione’s mouth fell open to introducing herself, but she was quieted by the receptionist who had chosen that exact moment to speak. \n \n“Missus Granger, I presume.” \n \nClearing her throat, Hermione gave a brisk nod. “Yes. I’m here to see—”\n \n“Unspeakable Sanders,” she interrupted, her voice croaking. Hermione fought the glare that threatened to overtake her features. “Take a seat. She’ll be out shortly.” \n \nHuffing out an indignant little breath, she crossed the foyer and sat primly in one of the four chairs of the department proper. \n \nShe waited for what felt like close to half an hour, her annoyance devolving to ire when a door finally swung open. \n \nUnspeakable Sanders was no stranger to the Ministry. She was the face of the department, and while her work was secretive in nature, she was always seen out and about in various departments. \n \nHonestly, the witch was hard to miss. She was stunning: tall and statuesque with deep chocolate toned skin and high cheekbones. Not only was she a credit to her profession, and an absolute powerhouse in the Wizengamot, but she was also a beautiful and poised woman. Simply put: she was everything Hermione was not. \n \n“Miss Granger,” Unspeakable Sanders beamed, her bright smile gleaming in contrast to her ebony skin. “Welcome to the Department of Mysteries. Although, rumor has it this isn’t your first time.” A perfectly arched brow lifted high on her forehead, paired with a conspiratorial smile. \n \n“Unspeakable Sanders,” Hermione greeted formally, rising to shake the woman’s hand. \n \n“Oh, please,” she smiled, waving her long fingers flippantly through the air, “call me Cicely. Now, I bet you’re wondering why we’ve summoned you to the bellows of the Ministry on this fine Tuesday.” \n \nCicely turned, her robes sweeping away from her body in a grand way as she gestured for Hermione to follow along. \n \n“You could say that.” \n \nThey stopped just before the entrance leading into the room of doors that Hermione knew waited for them just beyond and Cicely shook her head in a fluster. “Oh, I’ve nearly forgotten. Before you can enter and be debriefed on the case we’ve called you down for, I’ll need you to make a solemn vow of confidentiality. We don’t go so far as to make Unbreakable Vows down here, so no worries there! However, it will render you speechless should you try to reveal confidential information without proper authorization.” \n \nWhen it took Hermione a moment to mull it over, Cicely tacked on a quick, “Standard protocol and I will have to insist that you take it as we can’t really progress in this case without you, I’m afraid.” \n \nHer gaze flitted over to the looming door. While the prospect of sworn secrecy was a bit much to grasp with nothing to go on, she was desperate to know what secrets lay beyond the door. Despite her internal debate, curiosity won out in the end as she extended her wand arm to the department head, each of them wrapping their fingers around the other's forearms. \n \n“Hermione Granger, do you so solemnly swear that the details, both explicit and implied, of this case, will be treated with the utmost confidentiality?”\n \n“I do.”\n \n“Do you swear to keep any information procured from your time in the Department of Ministries private from anyone outside of the those immediately relevant to the case and those who have been given proper clearance?”\n \n“I do.” \n \n“Do you understand that this vow is a binding magical contract and severing it will result in a trial to determine guilt with possible sentencing to Azkaban?”\n \nHermione gulped. She  hadn’t  been given that small shard of information, but in for a sickle, in for a galleon, she mused. “I do.” \n \nWisps of ethereal, silvery magic twined around their hands and forearms. She could feel the magic binding to her own, and, just as suddenly as it had appeared, it vanished. Cicely smiled brightly back at her. \n \n“Thank you, Hermione. Now—” They entered with little fanfare as she followed Cicely inside and down the narrow hall flanked on either side by closed doors. “What do you know about Time Magic?” \n \nA deep blush stained her cheeks and Hermione’s eyes rounded. She could almost feel the weight of the time turner she’d carried all those years ago on her chest. “A little.” \n \nThey kept up a brisk pace as the doors rotated quickly around the room, stopping in front of one with the rune for time carved into the stone. “Don’t be coy, Miss Granger! We know all about you dabbling with time during your third year. We also know the implications of your blatant disregard for time law regarding the outcome of not only Sirius Black but…what was that bird's name?”\n \nHeat licked up the sides of her throat as Hermione squeaked, “Buckbeak.” \n \n“Ah, yes! That naughty little hippogriff. Well, don’t fret about all that now. We can hardly hold you accountable now for the blatant disregard for time law as you were a minor. Your headmaster on the other hand…” With a cluck of her tongue, Cicely approached the Time Room and the door swung swiftly open. \n \nHermione had been here before; although it had looked slightly different after the battle had run its course. The walls were still fixed with magical time devices of every shape and size, and the light still glittered throughout the room, entrancing her as she walked through the narrow passageway. \n \n“Back in the 1800s, the Department of Mysteries studied Time Travel for upwards of nine years. During that time, one Unspeakable, Eloise Mintumble, caused a chain of catastrophic events. Have you heard of her?”\n \nHermione nodded absently, her gaze transfixed on a glowing jar near the far side of the room. \n \n“Well, Eloise Mintumble traveled back in time to the 1400s. She was trapped there for no less than  five  days, and when she returned, her body rapidly aged in the process. Dozens of her ancestors ceased to exist, simply vanishing and become unborn. The entire thing was a mess and the statutes of time laws have been heavily guarded ever since.” \n \nCicely paused, allowing Hermione due time to take in the grandeur of the room. “We still study magical artifacts and how time affects magical beings and the like—but the use of time travel has been banned from even this department. We’ve no idea what implications something as small as a sneeze in the past or future could have on the present.” \n \nA door appeared, tucked in the side of the room and opened without preamble. Cicely’s cool touch rested on Hermione’s arm, garnering her attention as she smiled kindly and gestured for her to enter. \n \n“This is all terribly fascinating,” Hermione said earnestly. “I’ve just no idea what any of this has to do with me.” \n \nThe next room was far colder, lined with a giant trench similar to the one in the Death Chamber that Hermione had seen some years prior. In the middle loomed a giant, crude archway, golden magic dusting down towards the stone floor. \n \n“What on Morgana’s green earth  is  that?” Hermione blanched, stepping forward as the pull of magic thrummed in the air all around them. The magic was old and powerful, running deep into the walls and floor. \n \n“This,” she paused, letting out a long breath, “is a Tempus Motus. In layman’s terms, it’s how Unspeakable Mintumble was able to travel through time. There are a few portals throughout the world, and this one is probably the newest, built and forged under Minister Gambol in the 1400s.” \n \n“This…” Hermione’s brow puckered as she struggled to make sense of the overwhelming information being laid out plainly before her. “This is how one time travels?”\n \n“It is.Though as I said, the use of it has been banned for centuries.” Cicely’s tone turned serious as she gestured towards the other door in the room. Hermione had a hard time tearing her gaze from the grand archway but begrudgingly followed her guide. “Which is why you can imagine our surprise when yesterday afternoon this man fell through.” \n \nHermione turned, shifting her attention to the final room. It was by far the least exciting of them all: devoid of much furniture or any of the interesting accouterments the other rooms had boasted. Instead, it held two simple metal chairs and a single large window in a nondescript holding room. \n \nInside sat the same prat from the night before, his hands laid plainly on the table, and Hermione huffed out an annoyed breath. “That’s Draco Malfoy. He works in the Auror Department. He probably snuck his way in here and poked around the wrong room…” \n \nCicely rounded on her, her eyes flashing as she studied Hermione’s face. “Impossible—Auror Malfoy wouldn’t be able to sneak into these rooms.” \n \n“We did,” Hermione challenged, her head canting to the side as the excitement in her belly extinguished. “And we did it as kids. Draco Malfoy can get into all sorts of trouble if left unattended.” \n \nBut then…she’d been with Malfoy last night at the pub. So, unless he’d somehow stumbled in here drunk off his arse, someone had their story wrong. \n \n“Take a closer look, Hermione.” Cecily stepped aside as Hermione approached the charmed glass. \n \nThere was no doubt he was Draco Malfoy; that much was painfully obvious. But, upon closer inspection, however, she noticed a few subtle differences. His hair was a little longer, pushed back instead of cropped tight. Rather than the clean shave he sported just the night before, a thin layer of stubble peppered his jaw. Creased around the same silver eyes, she saw wrinkles that she had never noticed before—that hadn’t  existed  before. \n \n“You mean to tell me, thatDraco Malfoy fell through this  Tempus Motus  last night from...  when exactly? The future?” Hermione quipped haughtily, disbelief coloring her tone. \n \n“Indeed.” \n \n“And how does this all affect me? I may have dabbled in it, but I’ve never really studied time travel or anything of the sort.” \n \nCecily’s gaze darkened and she reached for the door into the holding cell. “Auror Malfoy won’t speak to anyone but you. He’s insisted upon it, actually. He’s agreed to comply with the laws to the best of his ability, and cooperate with our investigation into how and why he’s here, as well as how to get him back—but not before he speaks with you.”\n \nHermione’s head whipped back to study the man through the glass once more. “He asked for  me?  Did he say why?”\n \nUnspeakable Sanders straightened her spine, and tucked her chin into her chest, peering up at Hermione with a serious stare. “Head on in, Miss Granger. Everything said in this chamber is recorded so no need for notes. Just see what he needs from you so we can continue our investigation.” \n \nThe door slid open and Hermione sucked in a harsh breath before stepping over the threshold. Her arms crossed tersely across her chest. When he lifted his head, he didn’t miss the sagging of his shoulders, nor the relief that flooded his features. \n \n“Thank, Merlin. There you are!” \n \nHer brow puckered as she crossed the room; up close, the discrepancies in his age were far more prominent. Some of his hair was no longer the blond of his youth, but shimmered in a silvery-white near his temples. There was a nasty scar across the side of his neck that disappeared into his collar. The most arresting discrepancy of all, however, sat proudly on the third finger of his left hand—a wedding band. \n \n“ Malfoy ?”\n \n“How are you, love? Surprised to see me?” His lips quirked up in that familiar smirk she knew all too well and his brows lifted as he reached towards her. With a start, she flinched away from the friendly gesture and stared at him seriously. “ Ah , I was worried about this. Say, what’s the date?”\n \n“It’s the twelfth of September, 2003. Where are you from?” \n \nMalfoy’s grin widened and he carded a hand through his silvery strands. “Don’t you mean  when , love?” Her brow pinched and he chuckled under his breath. “2023.”\n \nAn incredulous little noise burst past her lips. “That’s impossible. You’re from twenty years in the future?” \n \n“I am.” \n \n“And what on earth do you want with me? I have work I could be doing, you know. How is it twenty years later and you’re still going out of your way to infuriate me?”\n \nMalfoy’s chin dropped to his chest and he laughed mirthlessly. “You’re always saying shite like that, you know? The last time you were so cross with me, was because I’d forgotten to feed the cat. You actually accused me of starving him just to annoy you.” \n \nHermione pulse thundered deep within her ears and she felt the blood slowly drain from her cheeks. “Cat?” \n \n“Yes, you insisted on adopting the ratty little thing and I was powerless to stop you.” Malfoy peeked up through his long lashes, a lopsided smile pulling at the corner of his mouth. \n \n“Draco Malfoy, speak plainly this instant,” she breathed, her hands coming down to brace herself on the back of the metal chair opposite him.\n \n“Where I’m from, you’re Hermione Granger-Malfoy and have been for nearly two decades.” \n \nKnees buckling, Hermione steadied herself on the chair as she sucked in short, desperate breaths. \n \n“ I’m your husband, Hermione. ”\n \nxXx\n\nA/N: Hope you enjoyed this first installment! I'll be back in a few days with another for you. \n\n\nAlpha Love: MCal\n\n\nBeta Babe: DreamsofDramione\n\n \n\nMake sure you're following both of their author pages! They have so much amazing work coming up and I can't waiiiit for you all to read it. \n\n\nYour thoughts are always appreciated! \n\n\n “I’m your husband, Hermione.”  \n\n \nThe words were plain enough, laid out simply for her to grasp and mull over; yet, it was the most ridiculous thing she’d ever heard. \n \nOne breath. \n \nTwo. \n \nA chuckle bubbled past Hermione’s lips, escalating into a roaring guffaw as she clutched to the stitch forming in her side and fell into her seat. After a few minutes, her laughter quieted and through her watery gaze, she found that Draco was far from amused, his jaw clenched and eyes narrowed contemptuously. \n \n“Are you quite done, love? This is serious.” \n \n“Oh, stop it, Malfoy!” Hermione deadpanned, her laughter ceasing without warning as she rolled her eyes and drummed her fingers on the table. “What is this? A prank? How did you get them to allow the Department of bloody Mysteries to play along—or,” she paused, peering over her shoulder, “is the prank on them, too?”\n \n“It’s not a prank, Hermione.” \n \nHermione’s skin bristled; it was such a strange sensation to hear her given name roll off his tongue as if it belonged there—as if he said it every day. She gulped, her spine straightening infinitesimally. “You don’t call me that.” \n \n“ Yes , I do. And I call you things much more familiar than that, I assure you.” There was a flash behind gaze and Hermione felt a blush stretch up to the tips of her ears. \n \nWith an indelicate little snort, Hermione leaned back in her chair and crossed her legs as she leveled him with a pointed stare. “Okay, future Draco Malfoy. How can I help you?” \n \nThere was a prodding at the front of her mind that felt unfamiliar but surprisingly gentle, and when her gaze lifted to Malfoy’s, she could see the intent etched in his eyes. Her eyes fluttered for the briefest moment and she could  feel  him in the confines of her mind, brushing against her like a curious kitten, before they snapped open and his voice flooded her consciousness. \n \n Oh, stop it with your panicking. I need to get out of here and it’s of the utmost importance that you help me.  Hermione raised a skeptical brow, but he continued.  You can just think. I’ll hear you, love. \n \n For starters, stop calling me that.  She shifted in her seat as her head canted to the side.  Secondly, I’m not helping you with anything, Malfoy. Oh! And third, I can’t believe you’ve been a legilimens this entire time. It’s wholly unethical and I should report you to— \n \n “  We were traveling and I fell through a Tempus Motus in Greece. It spit me out here and I’ve no idea why or how.” His lips quirked up in a barely visible smirk.  Lies. Don’t worry, darling. I’ve got a plan, I just need you to play along. \n \nThe door behind her opened and Cecily stepped through, leaning against the charmed glass and crossing her arms seriously over her chest. “All caught up, Miss Granger?” \n \n Showtime. At that, Draco retreated from her mind and turned to face the newcomer with a narrowed, almost accusing glare. \n \n“So,  Auror  Malfoy—” Cecily’s voice dripped with suspicion. “As you’ve said, you fell through a Tempus Motus. Do you know anything about how time travel works?” \n \n“Never dabbled with it.” Malfoy sat back, smug indifference plain on his features. “Just an ol’ humdrum Auror these days.” \n \nHermione couldn’t tear her eyes away, there was something so bloody different about him. He was still confident, erring on the side of arrogant, but it was of a quieter sort. \n \n“As much as I do want to believe that, I’ll tell you right now that one does not fall through a Tempus Motus without great intent and some pretty serious wand work. I can go into the adjacent room and walk right under it and nothing would happen. So, there are some holes in your story, I’m afraid.” \n \nClucking his tongue, Malfoy shrugged. “Not sure what to tell you,  Cecily .” His tongue was laden with contempt as his mouth curled around her name. Hermione wondered if maybe they didn’t know each other in the future. “But maybe it’s something for your Unspeakables to jump on. Don’t want people stumbling through time on accident like this. In the meantime, I demand to be released into my wife’s care—”\n \nHermione huffed and turned towards Cecily. “I’m not his wife.”\n \n“Oh, but love, you are.” \n \nRage twinged her vision, her jaw clamping shut as she forced a breath through clenched teeth. “I assure you, Malfoy, I am not.” \n \n“ Noooo,  I assure  you , Mrs. Malfoy, that you are.” \n \n“You two are behaving like children!” Cecily admonished, pushing away from the wall to rest her palms on the metal table. “I’ll be honest, I don’t give a shite if you’re married or not. Mister Malfoy, you are not being released from the Department of Mysteries under any circumstances. You are going to go back through that portal before you cause any more damage to the future timeline.” \n \n“Oh, Bollocks—”\n \nHermione interjected. “Let’s say by some strange twist of fate you and I are actually meant to end up together. I know about that now and I’ll be looking for things, clues. That might change the entire fabric of what happens next. You shouldn’t be here.” \n \nRising to her feet, Hermione stared down at the strange version of Malfoy, her shoulders sagging as she saw defeat painted over his features. There was that prodding again, this time more insistent, and Hermione’s brow puckered as Malfoy’s voice filled her mind once more.  I have to be here. I need you to trust me. \n \nIntuition flared hot in her belly and her heartbeat picked up furiously as Malfoy rubbed his palms over his face and let out an exaggerated groan. \n \n“Well, it seems you two brilliant ladies have found me out.” Reaching into his pocket he procured a small, wooden box and laid it on the table. “Just so you know, in the future, you two aren’t quite so chummy. And it’s nothing on you, Hermione.” \n \nAnxiety twisted in her chest as he lifted the lid of the small box. Neither of them paid any attention to his earlier statement as they tried to peer inside. It was…a salt shaker. Hermione scoffed, a sneer pulling at her lip.\n \n“Don’t worry, Cecily—I’ll be back.” Malfoy made meaningful eye contact with Hermione, before throwing her a sly wink and brushing his fingers against the salt shaker, disappearing in a pucker of magic. \n \nWith an audible huff, Hermione’s jaw fell open, her eyes rounding at the now empty seat. Cecily seemed far less impressed, mumbling expletives under her breath as she waved her wand at the far wall, revealing a door which promptly burst open. \n \n“What the hell?” A woman about Hermione’s age with a thick accent exclaimed, entering the room with two men hot on her heels. \n \nPinching the bridge of her nose, Cecily bared her teeth. “Are you telling me you didn’t pat him down? He’s an illegal time traveler and Death Eater.” \n \n“ Reformed  Death Eater,” Hermione interjected, but upon earning the curious stare of the four Unspeakables in the room, she shrank back, pulling a face. “I’m just saying, he was acquitted because he was acting under extreme duress and mostly as a minor.” \n \n“Miss Granger.” Cecily’s friendly disposition faded fast and her nostrils flared as she struggled to manage long even breaths. “You’ll have to excuse our team as we hunt for your… husband.” \n \n“He’s not—”\n \nHermione was silenced with a dismissive wave from the lead Unspeakable. “That’s neither here nor there. You may return to your day and we will most certainly be in touch.” \n \nTurning for the door, Hermione’s hand froze over the handle as Cicely called out to her once more, her voice tight and frigid. “Miss Granger?”\n \nHermione hummed in response, a chill shooting down her spine. \n \n“If you have any contact with Auror Malfoy, I expect you to get in touch with this department  immediately.  I’m sure you’re well aware of the gravity of this situation, and the issues that may arise if timelines are disturbed.”\n \nHer throat tightened and Hermione gave a stiff nod. “Of course, Unspeakable Sanders. If I hear anything at all, I’ll be in touch.” \n \nShe wasn’t even sure if she was lying.\n \nHermione stepped over the threshold, prepared to see the Tempus Motus yet again, but instead, she blinked into awareness on the lift. Startling at the familiar surroundings, she was completely unaware as to how she managed her way here at all. \n \nThe lift gates opened—to the appropriate floor, might she add—and with a worried brow, Hermione made her way through the department and towards her cube. What on earth had just happened—and more importantly, had she imagined the entire thing?\n \nShe’d spent enough time in the Department of Mysteries to know that there were strange and terrible magicks at work in the belly of the Ministry, but by no stretch of her imagination did she foresee finding a time-traveling Malfoy demanding her attention. \n \n“Granger,” a familiar, slow drawl crooned. “How are you feeling today? Need this?”\n \nHermione turned, ready to snap at Malfoy in her normal greeting, but he unceremoniously tossed a small vial in her direction. Her reflexes were still slow to wake, even though it was now nearing lunch, and the vial bounced off her chest and onto the floor. Baring her teeth and muttering under her breath, Hermione scooped it up and stared at it closely.\n \n“Poison?”\n \n“Ah, come now, Granger.” He grinned, entering her cube and leaning casually against her desk. “I’m a Slytherin. If I’d wanted you poisoned, I would have chosen something far more clever than this. It’s Pepper Up, you twit. Feeling alright this morning? I’ve never seen anyone quite so sloshed on Butterbeers.” \n \nHermione pulled the stopper out of the vial and sniffed it a few times to be sure before downing the potion and feeling some welcome relief spread across her skull. “Thank you, Malfoy. That was oddly kind of you, but you know full well I was not drinking Butterbeer.” \n \n“I know.” His finger slid under her arm, poking her in the ribs and she batted wildly at him, even managing a kick in his general direction before he scooted from the cube. His bright smile gleamed at her as he retreated backward, his hands shoved in his trousers and the flutter of a flirtatious wink. “You’re just so fun to mess with, Granger. Of all the things I’ve outgrown, I wonder if I’ll ever outgrow riling you up.” \n \n“I can assure you,” Hermione muttered under her breath, “you never do.” \n \nxXx\n \nStretching the stiffness from her neck, Hermione rested back in her chair, noticing that the department was now mostly empty. Only a few over-zealous overachievers such as herself remained, and even they seemed to be packing up for the night. \n \nHarry peeked over the edge of her cube, chin resting on his forearms as he grinned. “Heading out, Hermione?” \n \nShe took a final look at her desk, at all the work she had fit into the ten-hour day, and yet, nothing felt accomplished. Loosening a breath, she gave him a lopsided smile and rose to her feet. “Guess so.” \n \nWith a flick of her wand, her desk straightened itself up the way she liked it: parchments rolled, lining up in the corner, and her inkpot refilled. \n \n“Say,” Harry mused, helping her with her robes and then leading her through the department, “I heard you had a clandestine meeting down in the Department of Mysteries today.” \n \n“Merlin, nothing around here stays quiet, does it?” Hermione rolled her eyes, thinking about how utterly ridiculous this morning had been—and more importantly, if there was a chance she might be seeing the future Draco Malfoy again. \n \n“Can you say what it was about?” he whispered as they slid behind a few straggling Ministry employees on the lift. “Must be  something to call in the Brightest Witch of Her Age.” \n \nHermione groaned loudly as he nudged her with his elbow, his lips curling in a wicked grin. She wasn’t even sure what idiot started using that title, or how it became so widespread, but she did know she abhorred it. \n \nHer mouth fell open, ready to explain it was really nothing at all… but, nothing came. Harry stared at her as though her tongue had turned to a snake and was currently hissing in Parseltongue as she stood there gaping at him. Clamping her jaw shut, she huffed and then went to start again, but a similar phenomenon occurred as her words failed her. \n \n“I—I can’t,” she managed, skirting around the issue as her brows knit closely together. \n \n“Ahhh, I have been under a similar oath, my friend.” The lift stopped abruptly in the Atrium and the gate slid open, the few people filtering out towards the Floos. “We call it a Cat’s-Got-Your-Tongue Oath. Annoying isn’t it?”\n \nLips pursing tightly, Hermione nodded once. She’d made the vow, so she shouldn’t be surprised; but she found that being censored was not something she was at all fond of. \n \n“Want to come by for dinner? Theo’s cooking and you know you’re always welcome at ours.” \n \nA genuine smile pulled at her lips and she leaned in to kiss him sweetly on the cheek. “You’re far too good a friend, Harry. I’m exhausted though, next time?” \n \n“Of course. Night, Hermione.” \n \n“Night,” she breathed, watching her friend disappear through the grate. She turned, staring at the massive entrance to the grandest building in Wizarding London. \n \nThere’d been a time when this was all she had dreamed of. \n \nNow, she couldn’t bloody well figure out why she hadn’t thought to dream up more. \n \nxXx\n \nHermione didn’t go home right away. She made her way to the Leaky and snagged an empty barstool near the end, eating supper and nursing a pint of beer as she made small talk with Hannah behind the bar. \n \nWhen she could no longer put off the inevitable task of heading back to her empty flat, she made her way to the Apparition point up the road. She lived in a nice little district of London that was popular with young wizards and witches alike. There were a few places nearby that she could frequent and Diagon and Wizarding London were just a snap of magic away. \n \nSomething felt off about the air tonight, though, and Hermione had a distinct feeling that she was being watched. Surreptitiously, she retrieved her wand as she approached her building, burrowing under the confines of her cloak to fight off the Autumn chill. \n \nThere was a flash of a shadow off to her left, and as someone stepped from the darkness, Hermione whipped around, wand drawn and light pulsing from its tip as it revealed none other than Cicely Sanders. \n \nThe woman’s high cheekbones no longer made her look statuesque; no, in the harshness of the street light, they cast hard shadows over her face. Hermione’s wand hand held strong, unwavering even as Cicely’s perfectly manicured brow inched towards her hairline.\n \n“Miss Granger, I’ll ask you to lower your wand, please.”  \n \nHermione breathed out a sigh of relief as two somewhat familiar Aurors flanked Unspeakable Sanders. “Merlin, did you need to lurk in the shadows like that? I might’ve hexed you.” \n \n“My apologies. We were just double-checking to make sure that Auror Malfoy wasn’t accompanying you home, or spotted near your flat.” The streetlight flickered overhead and Hermione couldn’t help the ill-feeling that twisted in her belly. “For your protection, I assure you.” \n \n“Right.” Hermione’s lips folded in as she lowered her wand to her side. “Well, I’m sorry to disappoint you, Unspeakable Sanders, but I spent the rest of the afternoon in my cube, my supervisor can attest to that. Then I was escorted out by Auror Potter and stopped at the Leaky for dinner, Hannah can corroborate that if you pop over. And now, you see, you’ve found me here.” \n \n“I find only guilty parties feel the need to list their alibis before asked, Miss Granger.” Cicely’s lips pursed unpleasantly, deep wrinkles lining her mouth. \n \n“Am I being accused of something?”\n \nCicely’s stern disposition faded and she smiled falsely at Hermione. “Of course not. And, even if I wanted to, I’m an Unspeakable so that’s unfortunately out of my jurisdiction. Would you mind if I came up to your flat for a few moments? We’ve been out here a while and I fear the chill of the evening is getting to me.” \n \nWordlessly, Hermione cast a heating charm over the pair of them and canted her head to the side in a silent challenge. “Speak plainly, Unspeakable Sanders. It’s been a long day and I’m eager to get some rest.” \n \n“I’d like to be permitted to check your apartment for traces of Draco Malfoy. As you said, you weren’t here, nor did you have contact with him, but he may have breached your wards and be lying in wait for you now.” \n \n“I highly doubt anyone has breached my wards, ma’am. And if he is a snake in the grass up there, I’ll be sure to get ahold of the authorities right away. I do thank you for your concern, and as previously stated, I will inform you if I have any contact with him.” Hermione’s patience was growing thin. There was not a snowball’s chance in hell that this woman was setting foot in her flat. \n \n“I have to insist—” Cicely began and Hermione interjected with a quiet hiss. \n \n“You forget I work for the Department of Magical Law Enforcement. I took the same entrance exams and passed the same practical and theoretical law standards as every Auror and Investigator in my department—did better than them all, too. You’ve no right to enter my property without a warrant from the Wizengamot and a hell of a lot of due cause.” \n \nCicely’s dark eyes flashed, widening fractionally before narrowing in Hermione’s direction. “As you wish, Miss Granger. This is Auror Haverfield and Auror Jacobs.”\n \n“Miss,” they replied in unison, bobbing their heads politely. \n \n“They’ll be taking shifts over you and your home. Haverfield, you’ll take first watch.” Cicely vanquished the warming charm, fussing with her scarf as she turned down the sidewalk. \n \n“ First watch ?” Hermione huffed. “I thought you said I wasn’t being accused of anything!”\n \nCicely froze misstep, twisting at her waist to meet Hermione’s disapproving glare. “You’re not, Miss Granger.  Not yet.  The Aurors will be placed here for your protection and the protection of our very precarious future. Draco Malfoy is a criminal at large: Undesirable No. 1 as of this afternoon. Unfortunately, due to the nature of his crimes, we aren’t able to publicly hunt him. But I assure you, I am doing everything in my power to bring him into custody before irreparable damage has been done to our timeline. I urge you to take this matter seriously and comply with the Department of Mysteries as well as the Ministry itself. Time Law is a  very  serious matter.” \n \nHermione’s chest heaved, deep, enraged breaths pushing past as her lips. “Have a safe evening, Unspeakable Sanders.”\n \n“You as well, Miss Granger. I’ll be in touch with that warrant from the Wizengamot presently.” Cicely nodded, then resumed her march down the pavement, her collar tugged high over her neck and her posh wool coat snug around her trim waist. \n \nWell, that settled that. Hermione loathed Cicely Sanders. \n \nxXx\n \nHermione paused outside her door, her wand drawn to manage the intricate unlocking charms. Her wards hadn’t been breached, of that she was certain. There would have been an unmistakable tingle across her skin if someone had done anything from jimmied a window to bust her door in.\n \nBut, that didn’t stop her from being absolutely certain that the future version of Draco Malfoy was inside. Call it intuition or logical deduction, but there was no doubt left in her mind. \n \nHermione stepped over the threshold, locking it swiftly with her wand behind her and then sweeping her hand through the air as the lights dimmed on. \n \nHer eyes narrowed at the man at the end of  her  couch, drinking  her  Firewhisky and sitting in all his smug tenacity. He had  her  book laid out in his lap and  her  cat curled up next to him. Dropping her bag on the counter and shrugging from her jacket, she stood tersely. \n \nFinally, after an annoyingly long minute, Malfoy’s crinkled gaze lifted to meet hers, his stubbled jaw tilting to one side. “Oh, darling! You’re home.” \n \nxXx\n\n\n\n\n\nA/N: I am speechless by the wonderful reception of this story! Thank you all so much! This was one of my Nano Projects and it makes my muse purr to know you all are so excited for the story, too! \n\n\n\n\n\n\nI would love to know your guys thoughts on the story so far and hope you’re ready for some answers in the upcoming chapters!\n\n \n\nAlpha Love: MCal\n\n\nBeta Babe: DreamsofDramione\n\n \n“Oh, honey.  You’re home .” Malfoy's signature smirk seemed to stretch wider as Hermione made her way into her sitting room, taking a prim and proper seat. \n \nShe levyied an arched brow at Malfoy, his smug posture setting her teeth on edge. “Unspeakable Sanders was outside waiting for me; she almost came up to check the flat for you. What would you have done then?” \n \nMalfoy snorted, snapping the book on his lap shut and leaning towards her. “You forget how well I know you, Granger. There’s no way in hell you’re letting that woman in your flat because I know you can sense she’s bad news—” he paused, tilting his head to one side as he shrugged. “Which she is, by the way.”\n \n“How’d you get in here?”\n \n“Portkey.” \n \nHermione’s features flattened in severe disapproval. “Right. And  how  did you obtain a Portkey to  my  flat?”\n \n“You’re my wife. We still live here—some of the time at least.” \n \n“We live in this little flat… together?” \n \nMalfoy chuckled, his eyes sparkling at her. “As married couples often do. I wanted someplace bigger and you insisted we didn’t need the space.” \n \n“So I won?” Hermoine smiled, her brow flickering up in a challenge. \n \n“We compromised. We kept the tiny, useless flat and bought a summer home in France. Although—using the term ‘home’ does it injustice—it’s quite grand,” Malfoy mused, seemingly to himself. \n \nMassaging the thrumming of a soon-to-be migraine away from her temples, Hermione begged the universe for patience. “Why don’t you start from the beginning. And for real this time.” \n \nMalfoy’s features turned somber as he finished the rest of his firewhisky with a wince. “You don’t drink cheap liquor in the future, a habit you should consider adopting sooner rather than later.” Pausing, Malfoy dragged a tired hand over his face and settled into his seat. “Right, so I’m from the future.” \n \n“As you’ve mentioned, Malfoy,\" she sighed, her patience quickly running thin. \"It’s the rest of it I’m curious about.” \n \nClearing his throat, Malfoy poured two drinks and pushed one across the table towards her. “It’s a bit strange for me—seeing you like this.” \n \n“Young?” Hermione quipped, eyes rolling as she sipped from her tumbler. \n \n“ Healthy .” \n \nSnapping her gaze to his, Hermione swallowed the knot of anxiety that’d settled in her throat. Grey eyes bored into hers; the serious set to his brow and his clenched jaw caused her to pause. “I’m—I’m sick?”\n \n“Cursed, actually. That’s why I’m here. Strange timing of it all, if you ask me. There you were, about to announce your candidacy to unseat the current Minister for Magic, and then—” Malfoy let out a long breath, rubbing his hand over his stubbled cheek. “Everything went to hell.” \n \n“ Minister for Magic?”  Awe was heavy on her tongue as she listened in rapture.  Her?  Running for Minister for Magic? \n \n“I mean, I’m biased—I’m your husband—but you’re a shoo-in, love. But this curse...you’re getting worse. We've no idea what you’ve been hit with or how it was administered since you fell ill during dinner with Theo and Harry—”\n \n“NottPott is still together?” Hermione asked hopefully, leaning forward absently. Somewhere along the line, she must have begun to believe this wild narrative.\n \nBarking a laugh, Malfoy nodded. He fussed with his wedding band, twirling it around his third finger as he stared at her; she was entranced by the simple gesture. “Married eighteen years last spring, one year longer than us.”\n \n“We—as in,  you and I —have been married for seventeen years. And we haven’t murdered each other?”\n \nMalfoy laughed again, a strange but delightful deep belly laugh she couldn’t remember hearing before. “We’ve gotten close a few times, but we’re both still kicking for the time being.” \n \nHermione’s brow furrowed and she toed off her pumps, curling her feet under like a cat as she sipped from her drink. “Do we love each other? Or is this some marriage of convenience situation?” \n \nA slow grin stretched across his lips as his eyes studied her rug, spinning his ring another time. “No, we love each other—very much.” \n \n“Seems impossible.” \n \n“It’s not.” His shoulders lifted in a shrug as let go of a long, drawn out breath.\n \nThe firewhisky settled some of her nerves and she studied at him for a long minute. He was stupidly attractive now at twenty-three, but Merlin, give him another two decades and the man was stunning. \n \n“Where did we get married?” \n \n“A vineyard in southern France.\" His gaze flickered, lost in a memory. \"You left your curls wild the way I like and your dress was the most stunning thing you’ve ever worn; it showed off the freckles on your shoulders and the little birthmark on your neck that I love so much.” \n \nUnfamiliar emotions coursed within her; he spoke about her as if she were the sun, like his whole world revolved around her. \n \n“How do I like my tea?” \n \n“Splash of milk before work; milk and a teaspoon of honey when you’re at tea with friends.” \n \n“Favorite book?” \n \n“Muggle or magic?”\n \n“Mug—”\n \n“ Pride and Prejudice  ,” he interrupted, smirking at her. \"For magic? You’ll say  Hogwarts: a History  but it’s not, it’s just the book you’ve read the most. Your favorite is  Muggleborns: A Comprehensive History . I bought it for you for Christmas our first year together and you loved it so much; you still keep it in your nightstand.”\n \nShe gulped, her gaze intent on him as she felt this magnetic pull between them. \n \n“Where did we first kiss?”\n \nAnother smirk. “The Leaky on your twenty-first birthday. Then it took a few years for you to give me a real chance. We kissed for the second time on our first date. I took us to the Malfoy summer home in France; we had a picnic.” He paused a moment, lips curling as remembered. “You got  way  too drunk off the wine and climbed on my lap and snogged me breathless.” \n \n“ Malfoy!”  she admonished, the tips of her ears burning hot with embarrassment. \n \nHis bright laughter chased any shame away and she found herself smiling too; she rather liked this version of Malfoy. \n \n“It’s true.” He shrugged, chuckling to himself. “I can answer just about any question you throw at me, love. You sleep on your side and you snore when you’re exhausted; at Christmas you like to spend the evening curled up in my arms reading The Night Before Christmas aloud and drinking hot chocolate with a candy cane melting inside; when you’re cross you call me Malfoy and like to bring up the  one time  that I got pissed drunk with the boys at their bachelor party and a girl wrote their Floo number on my arm even though everyone can attest that I did nothing inappropriate.” \n \nA twist of surprising jealousy coiled hot in her belly. “Well, if you got close enough to another woman that she could write something on you, then you were clearly already in the wrong.” \n \n“Merlin.” Malfoy paused, pinching the bridge of his nose. “Here we go again.” \n \nHer lips betrayed her, quirking up in a small smile as she rose to her feet and set the tumbler down. \n \n“Where’re you going?” His eyes narrowed as she walked from the room. \n \n“I’m going to change. Then we’ll figure out exactly what you need so you can get back to this strange alternate reality where we don’t loathe each other.” \n \nxXx\n \n“So, symptoms of the curse include weakness, pain, grogginess? Malfoy, it doesn’t exactly sound like a curse…”\n \n“I think I’d know if my wife’s been cursed,” Malfoy deadpanned. “When you say it like that—yeah, it doesn’t sound so bad. Like the Black Cat Flu or some shite, but it’s not. You’re not you—you’re gone. And I’m not just gonna sit by and watch you fade away from me.” \n \nHis tone softened her and she tucked her legs under her as she considered what he was saying. “I’ll check the Ministry Archives and the Library. We’ll find something.” \n \n“Well, there’s a reason I’m here in this time specifically. If memory serves me correct, my mother has just liquidated the Black family vaults. She forfeited the dark artifacts to the Ministry, sold the paintings to various museums around the world, and taken the family jewels to the Manor.” \n \nHermione’s brows knitted tightly as she listened, cradling her whisky as the clock inched towards midnight. \n \n“My grandmother, Druella Black, told me about a necklace when I was a kid. I’ve seen it. It's silver with an ornate black opal the size of my fucking fist.” His fingers tightened into a knot and he lifted his hand in example. “It’s been in the Black heritage for centuries and it syphons the curse from the wearer, holding it until it’s destroyed. Curses were a lot more popular back in the days of old magic when disputes were settled by wand fire and loved ones were often targeted.” Malfoy’s hand came back to massage the nape of his neck, his plain white t-shirt riding up on his bicep as he sighed. “That necklace will save you. I know it.” \n \n“Your plan has too many variables, Malfoy. You may have seriously altered the future timeline already, I’d almost guarantee it really. I might not even be cursed. Hell, we might not be married.” \n \nShaking his head, Malfoy ran his fingers through his overgrown locks and her attention caught on the silvery tendrils near his temple. “I can’t believe that. We’ll find a way to each other. There’s no other option.” \n \nHermione sighed. She didn’t want to believe him, it’d be easier not to, but he spoke with such conviction that she found herself delving deeper. “Why can’t you get the jewels from your mother in your timeline?” \n \nMalfoy shifted awkwardly in his seat. “Mother passed away some years ago, now. I took a few heirlooms, but you’re not one for such ostentatious pieces. What in the fuck are you going to do with a tiara?” He chuckled darkly. “I took pieces for future generations and donated the rest. I’ve spent the last few weeks tracking them down, but it’s not yielded anything and I can’t wait any longer. I'll get the necklace and travel back through the Tempus Motus .”\n \nClucking her tongue, Hermoine regarded him seriously. “I just don’t know how I can help.” \n \n“I need to get to the Manor.” \n \n“Brilliant.” Hermione snorted, giving him a pointed stare. “As stated, you and I are not exactly chummy, Malfoy. You don’t invite me over for tea with your Mother or anything of the sort.” \n \nA knowing smile pulled at his cheeks as he reached between his thigh and the corner of the sofa, lifting a heavy envelope from it’s home and shaking it at her. \n \n“What’s that?”\n \n“This,” Malfoy paused, eyeing the elegant script inscribed on the cover, “is your invitation to the Malfoy Annual Charity Gala.”\n \n“I’m not going to that,” Hermione gaped. “I assure you that invitation is for show only. Pureblood society would have kittens if I showed up on their estate.” \n \n“First, Mother adored you. Second, you  love  this event! It’s your favorite of the year. You’ve organized it the last five years.”\n \nHermione felt a tingle at her temples as he talked about her—though, it wasn’t really her at all. It was some strange version of her that existed only in his mind. “You’re doing it again.” Her lips pulled into a tight pout. “You’re talking about me like you know me, and you  don’t . At least not who I am right now. I don’t plan fancy parties and I don’t know your mother and I’m not going to some stupid party to play these games of yours.”\n \nShe couldn’t listen to any more of this, jumping to her feet, she stomped towards her room. However, as always, she’d underestimated Malfoy’s quickness. He was off his feet and gripping her elbow before she could cross the threshold. \n \n“Just stop, Malfoy.” Tears welled in her eyes as the onslaught of new information settled painfully in her chest. She was dying somewhere and this man loved her, loved her enough to cross decades and criminalize himself to save her life. “This has been the longest, most preposterous day of my life.” \n \n“I know, love—”\n \n“ Stop! Stop calling me that! You’re Malfoy and I’m Granger and you flirt with me just to get a rise out of me and nothing else.” \n \nThere was a beat of silence as his fingers tightened on the tops of his arms and when she dared to sneak a glance up at him, his eyes were dark, intense, brimming with unexpected emotion. The lines near the corners of his eyes were new, etched deeper with concern. \n \n“Okay,” he conceded quietly. “I know this is a lot for you and I’m pushing it. You hate when I push. I just—I  do  know you, some version of you, at least. It’s hard to sit across from you and pretend that you’re not my wife.\" He paused to card a hand through his tousled hair. \"But I’ll try. I just desperately need your help because the woman I’ve been in love with for thirty years is dying right now. And whether or not you believe that to be you, it’s someone. Please, Granger?” \n \nThey were so close, close enough to feel the rise and fall of their chests meeting and pushing against each other as she stared up at him. His eyes drifted to her lips and against her own volition, her own gaze did the same. Dipping his mouth towards her, Hermione startled and jumped from his grip. \n \nThey stared at each other, a chasm now between them as she focused on her breathing. “There’s a guest room over there—which I guess you already know,\" Hermione said quickly. \"Get some sleep.” \n \nShe turned then, disappearing into her bedroom and hiding under her covers until dreams of a life she may never have took over her consciousness. \n \nxXx\n \nHermione’s eyes snapped open to the sounds and smells of sizzling bacon wafting through her flat. It was impossible to tell which emotion was layered on top: rage that stranger-Malfoy had helped himself to her kitchen, or ire that, despite her best efforts, her stomach churned with hunger. \n \nWith a soft growl, she threw her legs over the side of the mattress and grabbed her robe from the end of the bed. Padding from her bedroom, she stopped abruptly at the sight in her kitchen. \n \nShe was caught off guard by the vision of him casually standing shirtless over the stove. Different than she would’ve imagined—not that she’d spent much time doing such things, of course not—but, well he was still lean, just a little less defined... thicker,  bulkier.  A nasty scar crawled over his shoulder and up his neck, silver and puckered and almost  angry. \n \n“Morning, lo—” Malfoy paused mid-word, the endearment dying on his tongue. “ Hermione,\" he amended. \"Breakfast?”\n \n“Malfoy,” she quipped, her tone short. “Shirt?”\n \nHe turned, flirtatious smirk fixed perfectly on his face. Against her own volition, her gaze fluttered down to his abdomen, studying the smattering of smaller scars littered over his torso, the dusting of pale hair across his chest and under his belly button. She gulped. \n \n\"What happened to your shoulder?\" she queried, resting on the wall near the kitchen without entering it. \n \nMalfoy's face screwed to one side as he tried to peek at the marring on his skin. \"Oh! Merlin, that was a while ago now. Fight down in Knockturn turned nasty—spent almost a week at St. Mungo’s.\" His lips quirked in thought. \"It's when you first told me you loved me, actually. Merlin, you were so worried. You sat by my bedside the entire time, even took off work. Then one night, as I was drifting off, you whispered it like a secret you didn't want to let go of yet.\" \n \nThe thrumming of her heart picked up its pace, frantically beating against her ribs as she listened in strange rapture. \n \n“I made you a cuppa.” Twisting his wand through the air, a teacup lifted and settled on the counter between them, followed by the teapot which poured a perfectly steeped cup of coffee, milk next. “You’ll be leaving for work soon, I assume? G’on and get ready. I’ll have some breakfast ready for you before you leave.” \n \nAn exasperated huff pushed past her lips and she marched into her small kitchen with a gaping jaw. “You should get ready, too. Then you can head in with me and we’ll get you back to your time.” \n \n“I’m not going anywhere without that necklace. So, please give up on that ridiculous notion so we can move forward with the plan. I’ve already sent in your RSVP to the event this weekend. So, as far as a plan goes—”\n \n“ MALFOY!” \n \n“—try to secure a date with the current Draco. He’ll pick you up, unless I’m more of a sod than I remember, and when he arrives, we’ll stun him and I’ll go in his— my — place.” \n \nHermione was sure the blood had drained from her cheeks, her eyes wild and round as she stared at the elder Malfoy with a bewildered edge to her gaze. “You’re fucking crazy, Malfoy. Get ready! You’re going back—”\n \n“ I’m not!”  Malfoy snapped, dropping the spatula on the pan with a loud clang and turning to her, his cheeks flushed pink with rage. “What don’t you understand? I’m not going back without that necklace. I’m  not  losing you. Cecily Sanders and her dirty fucking hands are all over this. I’ve been investigating her arse for years. There’s no way in hell I’m marching back through that arch without knowing that both current and future versions of you are safe from her corrupt little fingers.” \n \nThe familiar name sobered her, and she stepped back as her brows furrowed. “Cecily? What does she have to do with any of this?”\n \n“Granger—” Malfoy snorted, picking up his spatula and turning back for the stove. “She’s the current Minister for Magic—the one you’re trying to unseat.” \n \nxXx\n \n\nA/N: Thank you again for all your lovely reviews, kudos, favorites and overall response to the story. You guys make my day :D\n\n \n\nTo my American friends celebrating tomorrow, Happy Thanksgiving!\n\n \n\nWould love to know what you think! \n\n \n\nAlpha Love: MCal\n\n\nBeta Babe: DreamsofDramione\n\n“You’re saying that Cecily Sanders is the  current  Minister for Magic?” Hermione supposed it seemed likely enough, manipulation appeared to ooze from the woman’s pores. \n \n“Yeah.” Malfoy nodded, poking the sizzling bacon around the pan. “I’m pretty certain she’s been tampering with Time Law for decades, though I’ve not been able to prove it just yet. And she wasn’t happy when you let her know you’d be running for Minister. It’s all too coincidental,” he said, circling his spatula in the air like a wand. \n \n“Well, that complicates things,” Hermione muttered from the side of her mouth, turning back for her bedroom. \n \nWhile dressing for the day, a plan formulated. As soon as she was able, she’d quickly escape to the Ministry library. Unspeakable Sanders had mentioned something about another time traveler, Mintumble or something, but surely, there had been other, more successful exploits. \n \nTucking her blouse into her trousers, she reached for her briefcase and reentered the main room, scanning for Malfoy but coming up short. Her heart sank, eyes blowing wide at the cup of steaming tea with milk next to crispy, almost burnt, bacon, sunny side up eggs, and a muffin. It was the exact meal she made for herself every Sunday when time leant itself to such luxuries as breakfast. And he’d known it. \n \n“Malfoy?” There was a nervous edge to her voice as she craned her neck towards the guest room, desperate for confirmation he hadn’t disappeared \n \nShe nearly groaned in relief as he emerged, still shirtless, but with a jumper in hand and a smile on his face. “You bellowed, my dear?”\n \nUnder her breath, she mumbled a soft,  “Prat,” as she nicked a slice of bacon and bit into it. “Why are you getting dressed?” she asked around the bacon working its way down her throat while he tugged the fabric over his head.\n \nWith a gaping grin, his brows inched towards his forehead. “If you’d rather I remain shirtless—” \n \nHe moved to yank the jumper back over his shoulders, but she cried out, waving her hands wildly. “Absolutely not!” Pulling an incredulous face, she finished her bacon and reached for the muffin, ignoring the smug smirk coming from the blond still looming in her doorway. “I meant only, did you decide to wise up and accompany me to the Ministry and back to your own time?” \n \n“Quite the opposite, darling. I need to pop into Gringotts to make sure the vaults have been properly emptied. I’ll see if they have an archive of what went where, seeing as this isn’t considered an actual dark artifact, it might still be in—”\n \n“Malfoy!” Waving her hands through the air, Hermione choked out an indignant little noise. “Are you fucking mad? You can’t waltz into Gringotts—”\n \n“Like hell, I can’t! I’ve got my wand. I  am Draco Malfoy after all. Those vaults are mine—”\n \n“You’re not going to Gringotts,. You’re currently Undesirable No. 1—”\n \n“ That’s hippogriff shite,”  Malfoy deadpanned, reaching over to pluck the muffin from her hand and slice his teeth through the crust. “Cicely is exaggerating. How on earth are they going to go about spreading that Draco Malfoy—current Auror and partner of the Chosen One—is  Undesirable No. 1?” he mocked, his lips pulling into a cocky pout. \n \nWith an audible pop, her jaw unhinged, hanging uselessly as she gaped at him. \n \n“See, love? I’m more than this roguishly handsome exterior, I keep trying to tell you.” He tossed her a sly wink as he swallowed  her  muffin and turned on his heel. \n \nWith a wild yelp, she scurried around the counter and planted herself between him and the door just as he reached for the handle. His lips curled into a smirk and he took a small step forward until his chest was brushing against hers. \n \n“I guess Gringotts can wait.” \n \nA slow realization dawned on her as his tongue darted out to wet his bottom lip and his free hand curled around her hip. She snorted and swatted at his hand with a scowl. “You’re married.” \n \n“ To you.  And you would understand, I’m quite sure of it.” \n \nWith a withering roll of her eyes, she pressed her palms into his chest and backed him up a few paces, but he surprised her by bringing her with him, pressing her against the short stretch of wall next to the door. Before she could think of a proper protest, his knee was sliding between her thighs, and both hands were placed firmly on either side of her head as he loomed over, his breath fanning over her lips. \n \nInhaling a shaky breath, her gaze lifted to his. A fevered blush bloomed on her chest, crawling up her neck as her breaths turned slow and deliberate. When he pressed farther in, the muscle of his thigh touching her where she hadn’t been touched in, admittedly, far too long, she couldn’t help the way she arched into it. \n \nWith all the force of the Hogwarts Express, reason returned, earning a few long blinks as she cleared her throat and pressed him away again. “Speaking as the current Hermione Granger, I will tell you that, at any age, I would not approve of my husband sleeping with other women—whether she is another version of me or not.” \n \nHis lips pulled up in a smirk and he gave a hollow laugh as he backed away. “Whatever you say, dear. Now,” he paused, clapping his hands and rubbing his palms together, “there is the matter of Gringotts and, unfortunately, I must insist I go.” \n \n“How many different ways can I say  no?”  \n \nHis smirk stretched into a grin and he shrugged. “Well, however many it is, I can say it in at least two more ways than you. I’m fluent in French  and  Spanish and you can barely work your way around a menu when we are at the country house.” \n \nA flurry of rage overtook her and she gesticulated her hands wildly through the air. “Enough of that! Enough talking about future me! If what you say is true, then I will discover all your awful habits for myself when the time comes. I don’t want to hear about anything else.” Ignoring the obnoxious rolling of his eyes, she began again, “Now, you’re not leaving this flat. Give me today, alright? I have some ideas and I want to dig into the Archives. If it all proves fruitless, we will  discuss  getting you to Gringotts.” \n \n“What am I supposed to do here all day?” Though the man was nearing his mid-forties, his voice took on all the whiny tones of a petulant child. \n \n“I don’t care. Read, twiddle your thumbs, think of plans that don’t involve me going to the Manor after stunning the current Draco Malfoy and having an imposter twenty years his senior attend in his stead?” \n \nWith another roll of his grey eyes, Malfoy finally retreated into the flat, crossing the space until he was flopping down on her favorite chair. “I did plan on glamouring myself, you know. I’m not so stupid as to try and waltz into the Manor having gotten this much better looking.” \n \nHer gaze shot to his, narrowing when it landed on his smug, lopsided little smile. “I’ll come home at lunch. Do you want anything?”\n \nWith a loud groan, he kicked up his heels on the coffee table and folded his hands neatly behind his neck. “Turkey on rye, if you can manage it, love. Would you mind maybe popping by Diagon for an extra set of clothes for me?  Cecily ,” he spoke the name contemptuously, “stole my luggage.” \n \nIt was barely seven-thirty in the morning, and Hermione could already feel the all too familiar thrumming of a headache forming as she made her way through the Floo. \n \nxXx\n \n\n Squeak. Squeak. Squeeeak. \n\n \nRocking back in forth in her flat, uncomfortable chair, Hermione couldn’t tear her eyes from Malfoy’s arse. It had absolutely nothing to do with enjoying the view—although, one could presumably argue that she did—but she was trying to figure out what size he wore. \n \n“Are you checking out Malfoy’s arse?” Harry’s voice in her ear startled her and she batted wildly over her shoulder. \n \nTurning swiftly, Hermione picked up her quill and began scribbling nonsense on the report in front of her, grimacing when she realized she’d now have to begin again. “Morning, Harry.”  A thought dawned on her and she swiveled again, “Say, what size pants do you wear?”\n \n“Thirty or thirty-two waist, why?” \n \nHermione rocked back in her chair, her eyes locking again on Malfoy’s bum, as he leaned across her colleague’s desk. “And him?” she asked, jerking her chin. “What size do you think he is?”\n \n“ What ? Hermione, are you daft?” \n \nShe turned, eyes narrowing. “Answer the question, Potter.” \n \n“His skinny arse is probably a twenty-eight.” Harry scoffed, leaning on the edge of her desk, picking up a caramel candy from her dish and unwrapping it with his teeth. “Why do you suddenly care about Malfoy’s waistline?” \n \nHeat rushed to her cheeks. “I don’t. I just find that I’m…fascinated by the discrepancies between men’s and women’s trousers.” \n \nWith a loud snort, Harry popped the candy in his mouth. “ Right.  What are you doing for lunch?” \n \nShe was making an utter fool of herself. Groaning, she rushed to her feet and piled up the parchments on her desk. “I don’t know. I—I need to go. I have to get the Archives and look something up for this case. I’ll see you later, okay?” \n \nHer feet carried her quickly towards the lift, and as soon as the grate doors closed, she sank down into a crouch and buried her face in her knees.\n \nxXx\n \nThe weight of Auror Jacobs stare bored into the side of her cheek as she pulled another tome from the stacks and added it to the buckling pile hovering next to her. Well, if Cecily insisted on having her followed under the thinly veiled excuse of protection, said protection could watch her read. How scintillating. \n \nQuite satisfied with the books she’d collected, Hermione turned for a table in the back. Jacobs followed, standing just far enough away to give her a false sense of privacy, but close enough that it only took one-pointed stare over her shoulder to notice the reach of Cecily Sanders’ power. \n \nSurely the Head of the Department of Mysteries could not have enough clout to order twenty-four-hour protection over Hermione. There was no due cause, she was in no way a threat, nor had the suspect at large threatened her—so why on earth was Cecily so paranoid?\n \nAs she flipped through the first book,  Mishaps and Misfortunes in Time Travel: A Cautionary Tale , she found herself only idly scanning the pages. The book was more of a recollection of stories from those who had managed short jaunts, such as what she’d done in her third year and their accounts of what had happened after. They amounted to little more than children’s stories.\n \nSnapping the cover shut, Hermione gently pushed it to the side to check out from the Archives. The second book was by a D.K. Rumage and was aptly titled,  The Rumage Theory of Time.  \n \nIt wasn’t a terribly long book and upon cracking its spine, the photos on the pages burst to life. Intricate drawings and graphs detailed his theory. Rumage, having traveled through time himself, believed that time did not only exist on a linear plane, always driving forward, but that due to the meddling of time, there were multiple simultaneous realities. \n \nForgetting where she was entirely, Hermione toed off her pumps and curled in on herself like a cat, tucking the book into her lap. \n \n\nTime, in all its troublesome complexities, does not simply exist in the reality that we are currently aware of. From the point of travel, a new ripple effect begins. The present splits into a shifted but ultimately parallel timeline. \n\n \n\nThe traveler would then return to an unaltered timeline, allowing the altered reality to continue on in its own plane.\n\n \n\nIt can be argued that the multiverse is actually infinite, as realities have now been split time and again. \n\n \n\nThose who study the art of Divination will tell you that regardless of the journey, our souls eventually end up where they are meant to. We can not change the ultimate ending, only the means of which we arrive. Skeptics believe that each reality is its own separate and unique universe with different outcomes and consequences. \n\n \n\nTraveling between Multi-verses is, at this time, unsustainable. Therefore, we have no way of studying this phenomenon. All we can deduce is that by messing with the timelines, we are causing massive and permanent changes to the future; whether there is only one, or infinite. \n\n \nSitting back, Hermione gnawed on her lip and tried to make sense of the obscure subject and what that could mean for her. In theory, by Draco traveling back at all, he had already caused a splice in the timeline, creating a new and parallel reality. He would be attempting to then travel forward to his own time, thus exiting their reality altogether and leaving a blank slate for her own future. One where she quite possibly didn’t marry Malfoy—no weddings in the countryside or hot cocoa on Christmas. \n \nEven thinking it made her stomach pang. She didn’t know why it bothered her so much that she might lose something she never really had. Adding that book to the stack, Hermione stared at the other five and loosened a long sigh. A sense of hopelessness settled over her, it didn’t matter what she read in these pages, the future had already been compromised. \n \nxXx\n \nDiagon was bustling. Witches and wizards in a hurry to complete their lunchtime errands bumped into her until she was scowling and tripping into the deli, quite nearly colliding with the dingy tile until two sure hands found her waist, helping to right her stance. \n \n“Wotcher, Granger.” \n \nHer hurried gaze focused on the smug smirk of one, young, Draco Malfoy. Instinctively, her brows furrowed and she frowned back at him. “Thanks, Malfoy.” \n \nThere was a strange tension hovering around her. After all, she’d now seen Draco with his shirt off and knew just where the start of his blond curls began under his belly button. It felt like a strange intrusion of privacy. \n \n“How’s your day going? Didn’t see you at your desk,” Malfoy said pleasantly, gesturing for her to take the place in line before him. \n \n Had he been looking for her at her desk?  “I had some research to tend to in the Archives, so I’ve been down there most of the morning.”\n \n“Right, right.” Malfoy’s hand came up, resting on the back of his neck as he squinted and peered at the ceiling. “Your owl arrived, by the way.”\n \nHermione hadn’t sent any owls. “Owl?” \n \n“Your RSVP for the party this weekend.” Hermione’s features flattened, making a mental note to berate the elder Malfoy for his meddling upon her return home. The line shifted forward, and they both moved along with it. “I’m glad you decided to come for once, is all. It’s such an extravagant event, and I’ll admit a little pretentious, so I can see why you never have. But if you wanted, just so you aren’t, you know, showing up alone or anything… well, we could always—” \n \n“NEXT!” the irritable clerk shouted in Hermione’s face. Shooting her a fatal glare, Hermione stepped forward, ignoring the riotous nerves in her belly at the revelation that Draco Malfoy had been about to ask her to attend the party  with  him. \n \n“I’ll just have a chef’s salad and a turkey on rye with crisps please.” \n \n“Make it two turkey on ryes,” Malfoy interjected, stepping forward to slip a banknote across the counter which the clerk promptly snatched up. \n \n“Why did you do that?” Hermione flustered, her shoulders bristling. \n \nShrugging, Malfoy replaced his money clip inside his robes and his hand settled low on her back, ushering her to the end of the counter. “No one’s ever paid for your lunch before?” he snorted. “Co-workers and even  friends  do it—often. If I’m mistaken, please do tell Potter he can stop letting me buy lunch anytime now. I’ll need to pick up a second job soon.” \n \nThere it was—that dry humour that always made her smile, even when she didn’t want to. “I didn’t realize we were friends is all, Malfoy.” \n \nHis grey eyes shot up to hers and there was a split second, a breath, that felt heavy and important, before he blinked himself back into the moment and his hand fell away. “Well, I’ve had my tongue in your mouth, Granger. Friends seems like a safe place to start.” \n \nWith a loud groan, she swatted at his flat tummy with the back of her hand and grabbed her paper bag off the counter. “Thank you for lunch.” \n \n“Anytime Granger. And that offer extends to all sorts of meals, lunch…dinner…hell,  even breakfast. ” He waggled his eyebrows and she couldn’t help but laugh as they slid through the deli patrons and towards the front door. \n \nHer eyes landed on her own private security looming outside and she cursed under her breath as she realized she still needed to somehow purchase men’s clothing without raising suspicion from her ever-watchful eye. An idea bloomed and with a start, she grabbed onto Malfoy’s arm. “Can you do me another favour?”\n \nHe seemed to genuinely consider it before shrugging and nodding his assent. “I suppose so. You’ll owe me one though. It’s never like a Slytherin to give without getting.” \n \n“Whatever, Malfoy,” she said, waving a dismissive hand in his direction. “I need you to distract Auror Jacobs for me. I need to sneak out of here.”\n \n“On the run from the law? You  know I’m an Auror, right? Can’t be seen aiding and abetting a criminal.” \n \n“Would you just do it?” she deadpanned. “I need to get out of this building without him seeing me. It can’t be that difficult.Talk to him about your many hobbies of spending money and watching Quidditch.” \n \n“For needing a favour, you’re acting like quite the tyrant. But, I’m in a good mood today, so you’re on.” He began retreating backward, keeping his gaze on her and fluttering one eye closed in a wink. “But you owe me!” \n \n“Wait! What size pants do you wear?” Her cheeks burned, but when his smirk widened and amusement crinkled his eyes, she couldn’t bite back the answering smile. \n \n“Twenty-eight around the waist. Buying me something to wear around your flat in the morning?” His brow lifted in a mischevious dare as he grinned back at her. Without another word spoken between them, Malfoy was out the door, clapping Jacobs on the shoulder and walking wide around him to steal his attention. \n \nHermione darted for the door. Ducking behind a rather large bloke, ignoring the way he leered down at her, she turned sharply once the cool air nipped at her cheeks. \n \nOnce she was a block away, she managed a quick peek back and saw Malfoy still chatting happily with her security, glancing only once in her direction before returning to his conversation. The flutter in her belly still hadn’t quieted, and against her better judgment, Hermione couldn’t help but ponder a reality where they might end up together. \n \nxXx\n \n\nA/N: You all continue to just blow me away with your lovely response to this story. Thank you for all the wonderful reviews, kudos, and favorites. They mean so much to me!\n\n \n\nI’ll be back in a few days with another update!\n\n \n\nAlpha and Beta thanks to the wonderful MCal and DreamsofDramione!\n\n\nCHAPTER WARNING: This chapter touches on the topic of infertility. \n\n \nAs Malfoy demolished his lunch, Hermione couldn’t help but stare at him with a renewed fascination. The similarities were striking to be sure, but they were nothing compared to their differences. \n \nThe Malfoy she knew, while smug in his own self-righteousness, still seemed unsure. The man before her now was more confident, having the power of knowledge secured in his grasp. He was self-assured, secure in their relationship, and in her. And as she spent more time in his company, she realized that in some way, he did  know  her... at least some version of her. \n \n“Did you have a good morning, love?”. \n \nBlinking away her wandering thoughts, she brought her attention back to the present. “I did. I was able to spend most of it in the Archives and brought back a few books for you to go over.” \n \nAs she pulled them from her bag, Draco snorted and tossed the rest of his sandwich back on its wrapping. “Granger, I don’t  need to do any research. I’ve read every book on time travel while sitting by your bedside twenty years from now. I managed to get here, didn’t I?”\n \nWith a swift inhale she collected her rage, cataloged it and started again. “This book, here,” she paused, grabbing the one documenting Mimtumble’s time travel and the Unborn. “Eloise Mimtumble—she traveled back  four hundred years , where she lived for five days. When she returned, her entire timeline had been compromised! Dozens of people disappeared.” \n \nDraco shrugged, swallowing another bite. “Propaganda.” \n \nWith a pop, her jaw fell open and she gaped back at him. “How can you say that? You could be erasing people from existence by even being here. You might save my life and in doing so damn a generation of magical beings.” \n \nRolling his head towards her, he snorted loudly. “That reference,  that story  , is from the 1800s. After that information got out, time jumping for any duration was outlawed. But you see, there’s no further information about these  unborn  . They just ceased to exist, yeah? Well, all record of them ever existing  before  the incident vanished as well. Suspicious, eh?” \n \nCuriosity piqued, Hermione sat back with heavily knitted brows, listening in rapture. \n \n“The Department of Mysteries, and furthermore the Ministry of Magic as a whole, has been corrupt for far longer than our lifetime. People who have control of time travel,  fuck with time travel . I’d bet our last galleon that Sanders has gone both forward and back to secure her own climb to the top. And how do they continue to do this? They outlaw it for the general public and keep it hidden in the deepest, darkest corners of the DoM.” \n \nPausing, he raked a hand through his hair before clasping his fingers together between his knees and leaning towards her. “Now, you’re too smart to trust research that is  this  antiquated, especially when far newer documentation exists. Such as this—” Grabbing the small tome from the middle, he tossed it unceremoniously on the table between them.  Mishaps and Misfortunes in Time Travel: A Cautionary Tale . \n \n“People are still learning, still traveling; and the present timeline,  my  timeline remains unaltered until  I  alter it. When I go back, you and I will exist on two separate but parallel planes.” He held this palms out, one hovering two inches above the other. “Both moving forward to the same destination.” \n \nDisbelief painted over her features as she stared back at the sodding little prick who was upheaving her entire existence. “How can you be so flippant about my future? You’ll return, make the change you need to, but  my  reality has been compromised! Who’s to say we even end up together in this timeline? Don’t you care about that?”\n \nWith a loud scoff, he leaned back, folding his arms behind his head as he stared back at her. “Listen, you can make it sound as horrible as you want, but you’d do the same for me, and yes, this timeline may not follow the same order of events. You might have a grander wedding or get rid of this flat. Might spend a little less time at the office and more in bed with me. Hell, you might even have kids, but—”\n \nThat small wisp of information slammed into her, and he must have been able to tell by the blood draining from her cheeks because he paused mid-sentence, eyes widening. “We—we never had kids?”\n \nFraught, haunting silence stretched between them, heavy and pulsing as her heart thundered in her chest. She’d always wanted kids—not now, surely, or even soon—but  someday . A reality where that never came to fruition hurt more than she could have possibly imagined. \n \n“That timeline won’t exist for you and you can make whatever changes you want. Nothing is written in stone.” His tone was softer now, soothing the inevitable ache in her heart.\n \n“Tell me.” \n \n“You said you didn’t want to know—”\n \n“Draco,” she pleaded, fingers curling into the thick fabric of her trousers. “Please just tell me.” Everything hung on a taut line of suspension and she  couldn’t breathe.  \n \n“No. We never had kids.”  The words settled heavily on her heart, a picture of her life barren, without children solidifying in her mind.\n \nHer gaze watered as the racket of emotions inched up her throat. “Why? Did you not want them?” \n \nPulling a face, his hand moved up to massage the back of his neck. “I did…once. But, we soon realized that we didn’t need children to make our life full. We have each other. We travel and explore, work our arses off but most importantly,” he paused purposefully, silently imploring her to listen before continuing, “we love each other very much.” \n \nSmoothing her palms flat against her thighs, she loosened a shaky breath. “I…I don’t understand. If you want kids, and  I  want kids, what happened? We just…changed our minds?” \n \nThe muscles in his throat tightened, his jaw clenching. After what felt like an eternity, he lifted his gaze to hers and her stomach twisted painfully at the tears lining his red-rimmed eyes. “Are you sure you want to know?”\n \nOne breath. Two.  Three. “Yes.” \n \nSurprising her entirely, he was then on his feet, skirting around the coffee table just to sit on its edge right in front of her. A weak smile graced his lips as his hands reached out for her, curling around the back of her knees while his thumbs trailed back and forth. \n \n“It was Bellatrix. Prolonged use of the Crutiatis can have unknown consequences. We found out about two years into our marriage that we wouldn’t be able to have biological children.” His fingers tightened gently and she felt something in her harden before splicing away. \n \n“It’s m-me?” she stuttered. “There’s something wrong with me?”\n \n“ Absolutely-fucking-not  . There is  nothing  wrong with you, love. You aren’t defective, there’s nothing that needs to be fixed. It didn’t work out for us, but we have a wonderful life. And if  you  want kids, you can. There were options to be explored, but we were so heartbroken…  so devastated , that we weren’t ready. When the topic came around again—” Draco paused, seemingly chewing on his next thought, “it wasn’t the right time. But you’re young, and if it’s what you want, you can still make it happen.” \n \nTears began striping their way down her cheeks as she wrestled with the idea that not only was she  not  a mother, but that she and Draco had survived this horrible time in their lives  together.  \n \nWarm hands cradled her jaw, tugging her gaze up to his and she was rendered speechless by the devotion in his eyes—the pure, all-consuming love. \n \n“It’s important for you to know that we’re not living a life of want and what-ifs. We don’t wander around pining after things we didn’t get. We’re happy and we’re the best aunt and uncle around. We give the most obnoxious gifts and when we sit for Theo and Potter’s kids, we load them full of sugar and let them fly their brooms wherever they want. I got more than I could have dreamed of when you decided to marry me—”\n \n“But  you wanted kids. And you didn’t get to have them because of me... ” Her brows furrowed and, suddenly struck with the gravity of these revelations, she hopped to her feet, wiping frantically at the tears still staining her cheeks. “I should go. I have work.” \n \nFixing a mask that she wore so well back on her features, she smoothed her clothes and turned for the door. Before she made it even two steps, Draco’s fingers were curling around her slender wrist, dragging her back into his arms. She should have fought it, shouldn’t have latched onto the comfort he was offering, but she did—she didn’t even try to pretend otherwise.\n \nHis arms banded around her, one hand cradling the back of her neck as she buried her face in his chest. Gentle, soothing words and coos surrounded her. “I wanted  you.  I know you don’t believe me, and that this entire thing is fucking strange, but I  do  love you, Hermione. I love you when you’re forty-something and I love you when you’re twenty-four. I’ve loved you longer than I care to admit and have no intention of stopping anytime soon. And as long as you and I are together, that’s all that matters. Everything else will work itself out.”\n \nHermione pulled back a fraction so she could see him, waterlogged lashes stuck together as she blinked. “Somehow, I believe you. Even if it’s all utterly fucking ridiculous.” She choked out a laugh, dragging the back of her hand across her tear ridden cheek. “For what it’s worth, you would’ve been a good father, I think.” \n \nHis brow twitched, a ghost of a smirk playing on the edge of his lips as he gave a weak laugh. Pushing the curls from her forehead, he stared at her as though everything revolved around her. She’d never had anyone look at her quite like that. “You would have been the best mum, Hermione. But instead, I get you all to myself. Sometimes you even let us sleep until half eight on the weekends.” \n \nA watery laugh slipped past her lips and she made to pull away, but his hold tightened. His gaze darkening for a moment before drifting to her lips and stealing her breath. It’d be easy— too easy —to close the short distance between their lips and steal more of him. \n \n“I’ll see you tonight,” she breathed, eyes fluttering shut for a fraction of a second, before coming to her senses. \n \nWith a long, resigned sigh, his hands trailed up to the tops of her arms, squeezing gently before releasing her and stepping back. “Have a good afternoon, love.” \n \nShe disappeared in a flare of green flames with a sinking, ill-feeling forming in her gut. \n \nxXx\n \n“Miss Granger!” Cicely’s bright voice, dripping with false camaraderie, caused her to jump, ink splattering across her third attempt of the report. Glowering at the mess now littering her once pristine parchment, she cursed under her breath before turning towards the culprit. \n \n“Unspeakable Sanders.” \n \n“Just checking in!” Her bright white smile gleaned against her dark skin and Hermione bristled as she entered her small workspace and began poking at the items on her desk. \n \nDesperate for a false sense of equal footing, Hermione pushed her squeaking chair back and rose to stand. “On anything particular?”\n \nPlucking a small pewter otter from a stack of parchments, Cecily took a long moment to inspect it before dropping it with a loud thud back where it’d sat. “Not unless there’s something you want to tell me, Miss Granger.” Her smile impossibly widened but it was chilling the way it didn’t touch her eyes; they remained black and fathomless—cold. \n \nAsk Hermione seventy two hours ago if she would have an ally in Draco Malfoy or Cecily Sanders, there would have been absolutely no question whatsoever. But mere hours changed everything, and the surge of protectiveness she felt for the blond stowed away in her flat steeled. “Nothing comes to mind.” Hermione shrugged and kept her intent glare tight on the woman across from her. \n \nTucking her chin into her chest, Cecily chuckled darkly and rose tall, now towering over Hermione by several inches. There was a sense of superiority rippling through the air as she stared down her perfectly straight nose that sent a long shiver bubbling over her skin. Every instinct in her body screamed at her, clawing at her belly to bloody  do something— but what?\n \nCecily’s lips parted, ready to weave more thinly veiled threats, but they were both startled by Harry slamming his palm against the top of her cubicle. “Hermione! Drinks?” Quickly sensing the tension, his gaze darted from Cecily back to her. Behind him, Malfoy appeared, shrugging on a thick gray coat, inspecting the scene with a keen eye. \n \n“I’d love a drink!” Eyes glittering at the salvation of the two wizards, Hermione quickly swished her wand in the general direction of her desk. The parchments neatly stacked themselves and hid away in her drawers, the locks clicking into place as she grabbed her own cloak. “Unspeakable Sanders—” She nodded politely. “Always a pleasure.” \n \nIn a frenzy of wild curls and robes, she stormed past Harry and Draco, ignoring the many strange looks she was garnering. She didn’t take a proper breath until she was behind the safety of the grates, and when she did, she sucked them in greedily. \n \nxXx\n \nAnother pint was delivered at the behest of Draco, and with a long, suffering sort of sigh, she relented and lifted it to her lips. She ought to be getting back to the  other  Draco, the one that was bound to be pissy that she was later than she’d intended. \n \nBut  this  Draco seemed intent to steal her company as long as she’d allow it, his arm slung lazily across the back of the booth and his body angled towards her. Theo and Harry sat across from them, pretzeled around each other in a casual lover’s embrace. \n \nFor some time now, she’d tried to bring up the situation without  bringing up the situation,  and after many failed efforts of getting around the aptly dubbed ‘cats-got-your-tongue’ curse, she finally managed to phrase it properly. \n \n“Can I ask you guys a question?” she began in an almost conspiratorial tone, leaning forward. All three men nodded. “What kind of power does the Department of Mysteries hold? Do they, say, trump the DMLE?”\n \nHarry pulled a face, canting his head back and forth a few times. “Well, I’m not sure how to answer that. It’s not they are higher in any sort of hierarchy, but, I mean, it’s the nature of their work to take precedence. We would probably apprehend the person in question, but they would seize most of the evidence.”\n \nWith an indignant snort, Hermione choked on her ale and slammed it back down on the knotted table between them. “ Why ?”\n \nThe three men shared a skeptical little look, brows furrowed in silent conversation, but it was the blond to her left to speak. “Why  wouldn’t  they? Let’s say there’s an artifact causing a false sense of, I don’t know, euphoria or love. Unspeakables study those, so they would immediately go into their custody for dissection. The DMLE would then corroborate with the DoM and bring it to those fine solicitors like Theo here.” \n \nBehind his dewey glass, Theo grinned and tipped its edge in her direction. “I’m curious about your sudden infatuation with the DoM, Granger. Something you care to share?” \n \nHer jaw fell open, the thought dying on her tongue before quickly mashing her lips together in a furious pout. Harry guffawed and reached his arm behind Theo’s shoulders. “She’s under oath, love; can’t talk about it with the likes of us.”\n \nGlaring at her friend for a long moment, Hermione finally thought of another question that seemed innocuous enough. “So, who oversees the Department of Mysteries? Surely they don’t just have this vast, limitless power.”\n \n“Unspeakable Sanders oversees the DoM,” Harry responded with a shrug. \n \n“Right. But  who  oversees  her? ”\n \n“Granger, it’s the Department of Mysteries .” Draco paused to take a long swig of his whisky. “No one knows what’s going on down there. That’s kind of the point.” \n \n“That’s kind of the problem! No one should have access to every department, able to move around unseen and unchecked. Has anyone ever considered there might be some level of corruption down there? They have access to things the rest of Wizarding society couldn’t dream of and they do so without anyone knowing the difference.” \n \nHarry and Draco shared a long, meaningful look and they both tilted in towards her with a worried brow. “Hermione, if there’s something we need to know…”\n \nWith a soft growl, Hermione pushed the curls from her forehead and tilted her face towards the dim light hanging overhead. “I can’t bloody  say  anything. I’m just—I’m just frustrated is all.” \n \nIn the strangest gesture of affection, Draco’s hand came to rest on her shoulder, his thumb rubbing small, soothing circles. With half her pint left, Hermione rushed to her feet and grabbed her cloak, ignoring the soft thud of his hand on the seat she’d just occupied. Blinking frantically, she shoved her hands in her pockets in search of galleons. “I really ought to go, anyway. What do I owe you for the drinks?” \n \n“Nothing at all.” Theo gave a weak, lopsided smile that Hermione gratefully accepted and mouthed a silent thank you, before turning and rushing from the pub. \n \nThe brittle October air flooded her lungs and Hermione paused in the soft drizzle to calm her racketing nerves. She was sinking deeper into an impossible situation, unable to climb her way out or, hell, even ask for some bloody help. The more she began to understand and even believe the motives of the future Draco Malfoy, the closer the one in the present seemed to press in. He was everywhere, all the time. Brushing his hand against her back and staring at her as though she was… important to him. \n \nThe soft, ever-present London mist glistened on her cheeks, and it was all too easy to pretend that it was the cause for her wet lashes. Behind her, the door opened and promptly closed, and without turning, she knew who it was. In her peripheral, shrugging on his coat and bringing his wand up above them, was none other than her would-be-future-husband. \n \n“Walk you home, Granger?” His voice was low, the words almost muffled like he was speaking from the corner of his mouth, and Hermione couldn’t help the dry chuckle that bubbled forth when she thought of the other Malfoy in her home right now who did quite the same thing. \n \n“What? You think I need two Auror chaperones?” Jerking her head over her shoulder, Malfoy’s gaze followed, finding Auror Haverfield standing there with an abashed grimace. \n \nA low hiss sounded from her right. “Merlin, Granger. What kind of mess have you gotten yourself into?” \n \n“If only you knew, Malfoy.” She laughed dryly, mostly to herself. \n \nWith a disapproving hum, he turned back towards the Auror lurking in the shadows. “Haverfield, how long are you on duty tonight?” \n \n“Til, morning.” \n \n“G’on and take a quick break and you can meet us back at Miss Granger’s flat. I’ll escort her home.” Malfoy spoke with a firm authority that left little room for debate, and before Haverfield was able to produce a proper thought, a hand was placed at the curve of her lower back, guiding her down the street. Once they were out of earshot, he spoke again, “Care to tell me what in the world has landed you round the clock Auror protection?” He paused for a moment, his fingers finding the crook of her elbow and slowing her step. “If… if you’re in some kind of trouble or danger—”\n \n“I’m okay,” she rushed, meeting his intent gaze and studying this familiar version of Malfoy in close proximity. His eyes were dark in the ambient light of the street, fewer wrinkles, no wisps of silver near his hairline, but it was the way he  looked  at her. Had he always? Was she just now noticing? “I promise. Just a silly precaution that I can’t get rid of.” \n \nAfter a long swallow, Malfoy’s lips lifted in a half-hearted smirk, before guiding her forward again. “Ready for the party this weekend?”\n \nGroaning loudly, Hermione took a step closer to him, until their shoulders were brushing and she was safe from the now steady rain. “I’m still considering not going. I don’t do well at those types of things. It’s all schmoozing and beautiful people and champagne from places I can’t pronounce.” \n \nWith a loud bark of laughter, they rounded the corner onto her street. “You’re underestimating how very Slytherin I think you can be, Granger. And I’ll be disappointed if you don’t come—” There was a pause as a whole riot of pixies seemed to break loose in her belly, a warm blushing rising to the apples of her cheeks. Malfoy stuttered, grasping at words until they finally formed a weak excuse. “I’m looking forward to having another friendly face in the crowd.” \n \nHer teeth cut into the flesh of her lower lip so hard she actually winced and feared she might’ve drawn blood. “Well, with purpose like that, how could I  ever  decide to stay home on my very comfortable sofa with a good book. Why, I’ll rush to Madame Malkin’s first thing so I can buy some gaudy dress and put on uncomfortable heels and—”\n \n“Would you want to come with me?” he blurted, interrupting her incoherent rambling. “Not that you have to, or should feel obligated. I don’t normally bring anyone, so you won’t be putting me out. But, I’ll have a seat next to the wonder boys and I can pronounce all the champagnes, so it could be kind of fun.” \n \nIndecision clawed at her insides, swelling until she was positive her lungs were going to burst from the inside out. “Like a date?” she finally managed through impossibly tight vocal chords, her eyes widening into saucers as she stared ahead, seeing nothing. \n \nHe paused and idly she recognized the stoop to her flat, lifting her attention to the dim light coming from her sitting-room window. \n \n“It wouldn’t have to be. We could go as friends, or if that’s still too familiar, colleagues who work in adjacent departments.” There was a mischievous cadence to his words and her gaze shot back to his, finding it playful, fighting a grin.\n \n“I just, well—” She shifted, face screwing up on one side. “I haven’t been on a date in quite some time. And… are you sure you even  want  to go with me? It’s me and it’s  you  and that comes with a fair bit of baggage.” \n \nSomething flashed behind his squinted stare, and before she could think more of it, he was taking a step away from her. “Think about it.” He shrugged. “No pressure. Do you want me to walk you up?”\n \nShaking her head, Hermione mourned the sudden loss of his warmth and her lips pursed. “I’ll see you tomorrow at work?” \n \n“See you.” His umbrella charm fell away and with a quick turn, he was gone, a small wisp of magic remaining in his stead, before drifting off into the wind. \n \nThe rain smattered against her cheeks, turning her curls soggy. Ignoring everything that had just happened, she quickly jogged up the stairs towards her flat. \n \nIt wasn’t that she didn’t want to go with Malfoy; the honest truth of it was that she desperately  did.  But she’d no way of knowing which Malfoy she was seemingly falling for. The real one, who pestered her relentlessly and couldn’t go a day without inserting himself in her path, or the one behind that door, who so clearly loved her beyond reason. \n \nWith an exhausted sigh, she unlocked the door and slid through the smallest opening possible. Most of the lights were off except the small lamp by the end of the couch that he seemed to favour. As if drawn to him, her gaze quickly settled on Malfoy; much like the first night she’d found him, he had one ankle slung over his knee, a book resting in the hollow that now existed between his thighs, and a tumbler of her firewhisky resting in his hand. \n \n“Hullo, darling. Couldn’t Floo that you’d be home  hours  late?” He didn’t look at her, didn’t so much as have an ounce of inflection in his tone as he licked the pad of his thumb and turned the page. \n \nRolling her eyes, she shrugged off her wet cloak and slung it across the counter. In a few purposeful strides, she found herself falling onto the cushion directly next to him, her knees curled up, just barely resting against his thigh. \n \nStill, his gaze didn’t waver. Narrowing her glare, she stared at the side of his face, watching as the corner of his mouth twitched for a fraction of a moment before he steeled it back into place. \n \n“Something you needed, love?” He brought his drink to his lips. As soon as he’d taken his demure little sip, she quickly nicked it from his grasp and settled deeper into the couch. \n \nChuckling dryly, Draco must have decided that this impudent gesture deserved his attention, and promptly closed the book on his lap, shifting to face her, amusement etched in every line of his face. “You’re acting odd.”\n \n“Your wife doesn’t normally sit next to you on the sofa?” \n \n“ She  does, but as you seem so fond of reminding me,  you  are not  her .” There was a softness behind his expression that she hadn’t expected, and it quite nearly stole her breath away as she sipped from the glass cradled in her hands. \n \n“I guess I can be for a few minutes,” she said with a small rise and fall of her shoulders. “It’s been quite a day.”\n \nDraco moved again. This time his hand came up to detangle her legs and he tossed them across his lap. With a swift tug, he pulled her impossibly closer, her bum now pressed against him while his hand rested casually on her thigh. Her eyes widened as a daring grin crept across his lips.  “Do you want to tell me about this day of yours?”\n \n“Is this something we do?  Cuddle?”  Her lips moved disdainfully around the word and the man next to her rumbled with a throaty laugh, his fingers tightening for the briefest moment on the thick of her thigh. \n \n“I don’t consider this cuddling. Although, we sometimes partake in such salacious activities, I suppose. This is just me being affectionate and asking you about your day.”\n \nStudying him for a long moment, the truth finally spilled, unbidden, from her lips. “You asked me out. Well, younger you, that is.” \n \n“ I did? ” Draco pulled a surprised face, chuckling under his breath, before stealing the drink back for his own. “Atta boy, Malfoy.” \n \n“Is that surprising to you?”\n \n“A little, I guess. I didn’t get the nerve for a while yet. I played a long, slow game, wooing you over many, many pints. Merlin, the number of Potter’s reports that I had to do just so  he would ask you for drinks, so I could then gate crash is deplorable.” \n \nA smile cracked on her lips and a warm flush spread across her cheeks. “ You did what ? That’s what the current Malfoy is doing, then?”\n \n“I presume so,” he said after swallowing another long pull of whisky. “But looks like I found some bollocks I didn’t know I had. I hope you said yes.” \n \nShame coloured her features and she stared down at her fingers, winding them together in her lap. “I didn’t. It’s so complicated… I didn’t say no, either. I didn’t say anything.” \n \nThere was a moment of quiet between them, and with a flick of his wrist, their glass was refilled and offered to her. “He’ll understand. He’s waited this long, love.” Her stomach folded in on itself and she felt a strange longing twisting in her belly. Soft fingers found her chin, tilting her face back up to his. “You can talk to me, you know. I know you better than most; I can practically  hear  you overthinking.” \n \n“I wish I knew what it was. Maybe I’m starting to feel something for him—for you—but it’s too murky. What if a part of me is just falling in love with this life that you keep telling me we have—a life I’ll never have. I’ll admit, there’s always been this strange… chemistry between you and I. Mostly it’s volatile but sometimes it’s not. You’re different in twenty years than you are now.  Now,  you’re still snarky and combative and  impossible  and—” \n \nSoft lips silenced her, slanting over her mouth and pressing again and again until she lost all reasonable thought. Her wide, startled eyes fluttered closed of their own volition and, surprising them both, she responded. A soft, contented noise passing from her lips to his as her fingers curled in the thin cotton of his shirt. \n \nDespite the chasm of time that distanced their lives, she knew these lips already. She’d kissed them until she was dizzy and breathless, pressed against the wall at the Leaky. And possibly even more so, he intimately knew hers. The kiss wasn’t one of nervous new lovers still exploring, but instead, that of a seasoned traveler, revisiting their favourite place with a reverence she couldn’t fathom. \n \nPillowing her lips, he gently dragged her full bottom lip between his own, earning another soft hum as she arched into his touch. The hand on her thigh flexed, inching up towards her bum. \n \nHe was everywhere, leaning her back, and settling between her thighs; the hand on her bum drifted back towards her knee and hitched it higher, and she gasped when she felt his thick erection press into her core. Not wasting a breath as they parted, he trailed his lips down her jaw, finding and sucking gently on a spot on her neck that made her cry out and cling to his thick shoulders. \n \nA confident palm skimmed up her shirt, delicately tracing the curve of her breast, before filling his palm with her. With a start, she realized that her own hands remained limp and useless. Quickly, she set forth to make amends, exploring the scar crawling up his neck, the thick strips of muscle on his back.\n \n Merlin,  she wanted him. \n \nMaybe she always had. \n \nBut now, here, in this dark little flat that they’d someday call home with the rain pelting against her windows,  she wanted him.  \n \nWith all the force of a wayward bludger, reason returned and her hands stilled. Sensing the shift in her, he froze, hands ceasing their tracks and tongue retreating back between his lips. Pushing up on his hands, he caged her in, eyes darting nervously over her face as she panted away the desire boiling in her veins. \n \nBlinking up at him several times, she finally mustered the courage to speak. “We should—I mean,  I  should go to bed. Yes. Yes, that’s what I need to do.”  \n \nThe space between his brows crinkled for a hair of a breath and he quickly masked it with a slow smirk. “Okay,” he said simply, crawling off her and back into the safety of his corner of the couch. “Rest well, Granger.”\n \nHermione couldn’t move. She laid there for close to a minute as she stared up at the dated ceiling of her flat, wondering why in the hell she’d just stopped herself from quite possibly the best shag of her life. \n \n“Aren’t you going to sleep?” \n \n“Oh. Right.  Sleep .” Finally dragging her body off the couch, she righted her clothes and turned for her room, managing only a single look back at the blond on her sofa, sitting exactly as he had been when she’d walked in half an hour ago. “Is it hard not sleeping next to someone after you’ve done it for twenty years?”\n \nA wry smile cracked on his lips but he didn’t look at her. “Yes.” \n \n“I suppose you could sleep in there.  Sleep ,” she repeated for her own good just as much as his. “If you wanted. If it would help, I mean.” \n \nHis gaze slid slowly from the pages of his book to her, fidgeting with a button on her blouse and gnawing on her lip. \n \n“I might take you up on that, Granger. Get some sleep.” \n \nRetreating to the confines of her bedroom, she instinctively reached for the raggedy shirt she’d slept in the night before, but paused, eyeing it warily. Instead, before she could think better of it, she pulled open her first drawer and selected a nightgown that barely kissed the middle of her thighs and exchanged her clothing for it. \n \nSliding into bed, she stared at the ceiling for hours, before finally she was dragged under, dreaming of wet kisses and wandering touches, completely unaware when the bed dipped next to her. \n \nxXx\n \n\nA/N: Whoop whoop! A smooch and a cuddle!! \n\n \n\nThank you, as always for your response and reviews. It gets me so excited to write! \n\n\nEndless love to Mcal and DreamsofDramoine for their Alpha/Beta love. \n\n \n\nIf you want to chat, I’m on Tumblr under the same penname and I also have a podcast with Frumpologist! We talk all things fandom and if you have questions you want on the air, find us as Wine, Wands, and Waffling on Tumblr, Twitter, and Facebook. \n\n\n\n\n\n\nCHAPTER WARNING: The following scene could possibly be viewed as as INFIDELITY. As noted in the story tags, it really depends how you look at it. If this is triggering to you, or not something you are interested in, please take that into consideration.\n\n \nMost mornings the gentle buzzing of her wand or the soft rays of early morning light streaking through her curtains woke Hermione. But not this morning. No, on this particular morning, while dreaming of the Giant Squid wrapping its long tentacles around her and dragging her under the surface of the Black Lake, she woke with a thin sheen of sweat covering her body, and a too warm arm draped over her middle. Her cheek was pressed against a bare chest, her palm splayed wide on a smattering of scars over his heart. \n \nA gasp slipped from her lips, and driven by instinct alone, she attempted to detangle herself, moving the leg that was draped dangerously across his. Before she made it an inch, his hands tightened around her, one snaking behind her knee and pulling her impossibly closer until the supple curves of her body were pressed hard against him. \n \n“Going somewhere, love?” he asked around a yawn, curling around her until their limbs were pretzeled. The hand on her knee slid up her thigh and continued to the dip of her waist, barely skimming the side of her breast, before finding her curls and burying his fingers there. \n \nThere was a reasonable thought somewhere in her brain, surely there had to be; but when his nose brushed against hers, his lips ghosting around hers, it shriveled and died wherever it had been stowed away. \n \nTightening his fingers in her curls, he lightly tugged her head back until she was staring up at him,  him  who was still sleepy eyed and grinning, while  she  was positively mortified in the thin little slip she’d brazenly decided to wear, feeling the pulsing warmth of his erection pressing into her hip. \n \n“Draco—” His name lilted quietly in the air, breathy and  begging,  but he didn’t move. Even as her hips rolled against his and her hands moved to thread in the hair at the nape of his neck, he remained still. \n \nThe sun broke over the horizon, flooding her room with the hazy orange glow of sunrise and with it, her gaze snapped up to his, meeting his dark, hungry stare with one of her own. Without ever having made a conscious decision, her lips were crushing against his, back arching as his hands slid over every inch of her body they could reach. \n \nWith a surprisingly pleasing roughness, he palmed her breasts through the thin cotton of her nightie, causing the strap to slip over her shoulder as he moved his mouth from hers and began laving wet, open mouthed kisses along her bare shoulder. His touch never stopped exploring— stopped worshipping— and under his reverent, skillful fingers, she lost herself, head falling back as he sucked on a spot just under her jaw that made her cry out. \n \nThe tips of his fingers dug into the thick flesh of her arse as he grinned against the thin skin of her neck. “You forget, love,” he paused, dragging his tongue up her neck and finding her earlobe with his teeth. \n \nA shiver rippled across her flesh, wakening every hair follicle on her body as her skin tingled and tightened. “ I know you . I know you like it when I do this—” The tip of his tongue dragged up the shell of her ear. “And this—” The hand not groping her tugged her hair lightly and she moaned at the onslaught of sensation coursing through her body. “And even if you won’t admit it right now, I know you like this…” \n \nRucking up the hem of her nightie, a flat palm came down hard on her arse, the hard slap earning a sharp inhale and  fuck,  she  did like it. Her hips answered for her by bucking into him again and a low, throaty chuckle rumbled against her neck. \n \nIn a swift push, she was flat on her back, his knee pressing against her aching sex as she wantonly pushed against him, a vain attempt to crush her body into his. Lips trailing down her chest, pausing only briefly to pull the top of her slip down and wrap around her nipple, he began to crawl his way down her body. She squirmed with anticipation and anxiety, terrified of anything  else  when… well, it’d just been so very long since anything like this had happened. \n \nHe moved quickly, purposefully , sliding her knickers off and tossing them over his shoulder. With another practiced move, his face was between her thighs, hitching a leg over his bare shoulder and she twisted away the rush of cool air on her bare sex, stopped only by one hand curling around her leg and pulling her hip flat against the mattress. \n \nA loud, strangled gasp tore from her throat, her hands rushing down to tangle in his hair when the tip of his tongue ran along her seam, flicking her clit once, before thrusting the thick muscle inside her. Her back arched off the mattress and Draco quickly took advantage of the new angle by burying his face deeper. \n \nBucking against his face, she was sure that the humiliation would settle in later at the least opportune time. His tongue slid up to her clit, lips closing around the aching bud as two fingers quickly pushed inside her drenched folds, curling and finding a spot inside that made her moan again and again. He didn’t stop, didn’t let up, his tongue, fingers, and lips working in perfect rhythm until she was overcome, cresting and falling and fucking  flying  as wave after wave of undulating pleasure washed over. \n \nThe final vestiges of her orgasm faded away, and her body sank uselessly into the mattress, gathering her wits as she prepared to feel his cock at her entrance, but it never came. Instead, he flopped on the bed next to her and stared at her with a wide, amused grin. \n \nPanic crashed over her when she realized, with her breast still hanging out and thighs parted, that they were not about to have sex. “What? What did I do?” Her eyes widened as she fussed with her nightie, covering herself in a watery attempt at modesty. \n \nDraco barked out a laugh, his hand curling around the nape of her neck and dragging her in for a quick but firm kiss. When he pulled back, he stared down at her with a bewildered expression. “Why on Earth would you think you did anything?”\n \n“Well,” she said, a hot blush blooming on her cheeks, “um, I thought you might want to…  you know .”\n \n“Oh, I do .” His eyes crinkled in playful mischief and he kissed her once more, before rolling from the bed. In the brief moment of silence, she couldn’t help but appreciate all of his long, hard lines, and when he turned, and she caught sight of the bulge in his sleep trousers, she gasped. “And we will. But, you’ll be late for work, and I’ve got time.” \n \nHer jaw unhinged, hanging agape like a buffoon as he sauntered to the front room. There was a soft rummaging noise and he called back to her, as if the events that had just happened were the most commonplace thing in the world. “Love! Where’d you put those clothes for me? I’ll get a pot of tea started if you want to shower before work!”\n \nSnapping her mouth shut, Hermione rolled back on the mattress, staring up at the hideous hanging light over her bed completely confounded.  What on earth had she just done? \n \nxXx\n \nThe morning stretched on with no end in sight. One report blurred into the next, and stacks of parchment piled high in the outbox on her desk. As the minutes dragged into hours, Hermione tried, in vain, to keep her mind off the man still holed up in her apartment. Every time her mind drifted back to the early hours of the morning, a warm blush blossomed on her skin and a riot of nerves twisted in her belly. \n \nHe’d been annoyingly right; he  did  know her. Her gaze went hazy, the feather of her quill running along the underside of her chin as she stared at absolutely nothing in particular, lost in the memory of the toe-curling orgasm—\n \n“Hermione?” \n \nHer reverie was snapped by the familiar intrusion of her dear friend, and she blinked herself back into the moment, eyes landing on Harry and Malfoy. With a start, she stared wide eyed and horrified at the blond smirking down at her. One hand came up, massaging the thick of his neck, and Hermione couldn’t help but lock onto the simple movement with a gaping jaw. She now knew those hands, knew the way they felt digging into her hip and curling inside her. \n \n“Merlin, you had sex— didn’t you ?” Her gaze shot to Harry, grinning as he closed his cloak around him. \n \nStuttering and floundering, she didn’t miss the way the corner of Malfoy’s eyes tightened for a fraction of a second, before the synapses between her brain and tongue finally began responding. She steeled her glare at her friend. “I did  not  have sex, to be clear.  And  if I had, could you not announce it to the whole bloody department.” \n \n“You look like you’ve had sex,” Harry said with a shrug, gesturing at her face with a single finger. “You always get all moonfaced. Lunch?” Her face felt too hot all of a sudden, and she rushed to her feet, before her ridiculous friend could find a way to humiliate her further. \n \n“You’re buying.” Throwing her cloak over her arm and tucking a curl behind her ear, she came around her cubicle and finally met Malfoy’s keen eye. “Coming, Malfoy?”\n \nThe corner of his mouth quirked and he shook his head. “Not this time. My mother demands my attention for lunch. If I don’t look at the bloody table linens, then surely the entire event will come crumbling down.” \n \n“Oh.” Disappointment sat heavy on her tongue and Harry’s brow knitted as he stared at the interaction. “I hope you have fun.”\n \nFolding his full, perfect lips in on themselves, Malfoy turned for the Floos, and unbidden, Hermione called out to him, “Malfoy!” When he paused his step and turned, her heart fluttered to life and she couldn’t  breathe.  “You know the question you asked me last night? The one you said I should think on?” \n \n“Yeah?” One pale brow rose above the other and there was the slightest flash in his silver eyes.\n \nWith a tilt to her chin and one hard swallow, she squared her shoulders and gave the answer she should have last night. “Yes.” \n \nShe swore the apples of his cheeks pinked as his smirk widened to a grin. “Brilliant, Granger. Looking forward to it.” \n \nWith a final flirtatious wink, he was gone, leaving her fighting a smile as she turned towards her wide eyed, amused friend. “Shut it, Potter.” Their laughter followed them through the lifts as Harry poked and prodded her about her soon-to-be date. \n \nxXx\n \nThe plates were cleared. The bill was paid. Now all that was left was staring at her dopey eyed friend who, for the life of him, couldn’t stop talking about the fact that Hermione Granger was going on a date with none other than Draco Malfoy himself. \n \n“Would you knock it off?” Hermione glowered over her water glass as they prepared to leave. “Your goofy grin is grating my nerves.” \n \n“I just—don’t get me wrong, I’m keen on it. Would sure make dinner plans a lot easier. But what changed? You couldn’t stand the bloke a week ago.” \n \nWith a hot blush staining her cheeks, she shoved away from the table and grabbed her cloak. “That’s not  entirely  true. And besides, I can barely stand him now. I just—” Words failed her. Merlin, it would make her life so much easier if she could just tell Harry what was going on. “I’m seeing him in a different light, is all.” \n \n“What are you going to wear?” he asked, eyebrows waggling excitedly as they pushed the door to the cafe open only to be met with frigid autumn gusts. \n \nWith a loud groan, realization slammed into her. Bollocks it all, she still needed a dress. “Shite. A dress… I don’t suppose I could wear the one I wore in May?”\n \n“No,” Harry deadpanned, his bright eyes dulling in disappointment. “Let’s stop at the robes shop around the corner. Work can piss off a while longer. If Malfoy’s not there, I shouldn’t have to be either.”\n \n“Fine. But we need to hurry. I can’t stay late tonight.” She blushed and bit back a smile as the vivid memories of the morning rushed back to her. \n \n“You should wear plum… oh! Or maybe silver!” \n \nHer lip curled disdainfully as she stared ahead, dreading every step that brought her closer to the robes shop.\n \n“You better be nice, Hermione. If you aren’t, I’ll let you walk into that party in something truly horrendous—like  yellow.  It’s just not your color, I don’t care how much you like it.” \n \nxXx\n \nHarry appeared in the floor-length mirror behind her, grinning like a fool. “He’s gonna lose his fucking mind.” \n \n“Harry! It’s not—you’re making a bigger deal out of it than it is. It’s one night. It’s not like—” All of a sudden, her heart felt heavy, thudding sluggish in her hollow chest. She turned once in the mirror, inspecting the scooping back of the crimson silk, her voice dropping low. “It’s not like we’re getting married.” \n \n“Are you okay, Hermione? You seem…  off lately.” \n \nSmoothing the cool fabric down her stomach, she gave herself a final appraising once over and decided that this was the one. With a weak smile and a nod, she answered her friend that she was indeed okay before disappearing behind the curtain of the changing room. \n \nThe dress was lovely, and probably too expensive, but as it slid over her curves and pooled at her feet, she found she cared very little about the cost, and much more about what either Draco would think of her in it.  Or out of it.  Another furious blush blossomed as she hurried to dress, eager to return to work and her mind-numbing research. \n \nWith the gown slung over an arm and her work clothes back in place, Hermione exited to the main floor of the shoppe only to stop dead in her tracks, eyes blowing wide at Malfoy standing next to her friend, chatting easily. \n \nWhen his gaze landed on hers, his lips pulled into a familiar smirk and she felt her stomach flop. \n \n“Hermione! Look who I saw passing by,” Harry said, jerking his chin towards his partner. “How was lunch, mate?” \n \nWith a start, he tore his gaze from Hermione. “Lunch? It was… good. Lunch was good. Hi, love.” \n \n Love.  Suspicion washed over her as she narrowed her gaze surreptitiously. Even Harry seemed to notice, cocking his head back once and pulling a face. \n \n“I didn’t expect you back so soon. Hell, I thought you’d be out the rest of the day. Your mum didn’t end up needing you?” \n \nMalfoy’s face pinched to one side, his hand rising to rest on his scarred neck, the other flailing about as he struggled to articulate an actual sentence. But then, her gaze caught again on the long expanse of his neck. \n \n Scarred.  \n \nAs in the scrawling, nasty scar that he received  after  he and alternate-Hermione began dating. The very one that she supposedly worried and fretted over, sitting at his bedside, before finally confessing her love for the stupid prat. The scar that the younger Malfoy, the one who was presumably still at tea with his mother, did  not have. \n \n“My mum… right. Well, she finished early with me.” Pausing, Malfoy appeared to consider his next words carefully, and finally, with a grand gesticulation, seemed to have his  aha!  moment. “But! She’s sent me on a rather important errand. One that I shouldn’t put off. So, you’ll have to excuse me.” \n \nFolding his lips into a flat line, Malfoy turned to leave the quaint little shop and Hermione snagged his elbow, before he made it a single step, dragging him a few paces away. “Are you bloody kidding me?” she hissed, gaze darting over her shoulder and smiling too brightly at her friend. “What in the hell are you thinking? There’s an Auror right outside.”\n \nWith a loud, watery snort, the little prat actually rolled his eyes. He’d glamoured his face and hair, although the cut wasn’t exactly right, but the etching of time near the corners of eyes was missing. “No, there’s not. I confounded that poor twit when Potter called me in. I don’t know why you’ve not been doing that so far.”\n \n“Because—” she stopped. The realization that he was right and she  should  have been confounding him pushed her shoulders down and she let out a blunt huff. “You’re an idiot.”\n \nAt that, he had the audacity to guffaw in her face, and she was no longer responsible for her actions when she punched him  hard  in the shoulder. Served him right. \n \n“Now, I have to go. I’m sure you understand, Granger.” His palm met the curve of her arse in a sharp  slap,  and she yelped at the sting, before turning to glower at his back. He paused briefly at the register, whispering something to the giggling little witch behind the counter, before disappearing through the front door. \n \n“Hermione—” Harry started, his voice low and cautious, like if he spoke too fast she might spook and run away—or hex him. \n \n“I can’t do this now, Harry. That stupid, rotten, no good—” \n \n“Hermione Granger! Tell me what’s going and  now!”  \n \n “I can’t!  Remember? I’m sorry, Harry. You’re a talented Auror, you’ll just have to figure it out for yourself. Will you tell Peterson that I couldn’t come back in today? Blame it on a stomach bug or something, but I do have to go.” She pushed past him, shoving the dress at the still blushing witch and mumbling that she’d be back for it later. \n \n“Oh, but Miss!” The tinkling sound of the girl’s voice caused her hackles to raise and she paused briefly with her hand hovering over the door knob. Malfoy could already be inside bloody Gringotts by now. “Mister Malfoy asked that I charge the gown to his personal account. It’s been paid in full.” \n \nThe slow curling of the witch’s smile as she waved her dainty little wand through the air, sending her new gown into a garment bag, made Hermione quite sure that she should hex this dingbat to spit slugs for the next twelve hours. “How thoughtful of Mister Malfoy. Please have it sent to my home. Mister Potter will tell you the address.” She turned to Harry then, mouthing a silent apology, before tearing onto the street corner and frantically hunting for that familiar shade of blond. \n \nShe had to assume he’d not already been to Gringotts, he seemed to still be in too much of a hurry. Shoving through the throngs of people rushing about on their lunch break, she couldn’t help but growl unintelligibly and rue the day that she ever met that pesky little ferret. Stupidly in love her arse. If they did somehow end up contractually bound together in matrimony, surely she would have killed him before he reached his mid-forties. He was far too infuriating. \n \nThe crowd parted and  finally  the looming doors of Gringotts came into view. A loud, relieved breath passed her lips, and just as she began marching for its entrance, a hand shot out of the alley and dragged her back into the shadows. \n \n“Miss me?” Malfoy’s face was too close, his smirking mouth hovering over hers, and if she focused hard enough, she could feel the soft pattering of his heart against hers. \n \nWrinkling her nose as if she’d just smelled sewage, she shoved him back and away. “You are in so much trouble! Why on Earth did you leave the flat? If Cec—”\n \n“Cecily Sanders can suck a knob. I’m not worried about that little string bean witch any more than I am a pygmy puff. In fact, I have half a mind to march into the Auror office now and open up an investigation on her myself—if I weren’t presently occupied.” \n \n“ Presently occupied? ” she mocked, crossing her arms tersely over her chest. “What in the hell is so important that you’re risking getting caught?”\n \n“I told you, love. I need to get Gringotts and make sure that the necklace was indeed released into the care of Narcissa Malfoy and not shipped off to Andromeda or some obscure trinket obsessed relative. It’ll be in their records of what went where. Although, I’m quite positive it’s at the Manor. Then, I will get  to  the Manor…”\n \nInhaling sharply through her teeth, she clenched her eyelids and massaged the bridge of her nose, feeling the familiar thrum of a headache creeping up on her. “Malfoy. You  can not  go to the Manor. You shouldn’t even be roaming about. If younger Malfoy sees you—”\n \n“He won’t. Stop worrying! Come with me to Gringotts and then I’ll go home with you and we can do more of what we did this morning, eh?” Hermione growled and slapped him in the chest, ignoring the obnoxious waggling of his brows and moving quickly for the mouth of the alley. \n \n“Merlin, you’re bloody annoying. Let’s go so we can get back.” She paused, halting her step and narrowing her gaze back at him once more. “ And not for sex!  That’s not at all what I meant, so don’t even think about it. You’re not leaving that flat again—” \n \nSuddenly, he was behind her, warm, rigid planes of muscle pressed hard against her rear, his fingers curling around her hips, and she gasped as he pulled her back into him. “You might have to tie me to the bedpost to get me to stay, love.” His lips brushed against that particularly sensitive spot on her neck and her skin prickled under his attention. “And I’ll admit, it’s usually you who likes to be hitched up.”\n \n “Ack! ” Shooing him away, she couldn’t help but laugh, a blush staining her cheeks as he followed her out into the street. \n \nxXx\n \nGringotts was bustling; a long line of patrons stretched nearly to the door and every teller was working at a painstakingly slow, leisurely pace. They’d be here forever, and the longer this version of Draco Malfoy was in public, the more anxiety ridden she was bound to get. He, however, seemed unfazed, meandering to the back of the line and whistling to himself. \n \n“I’m so glad you’re having such a lovely outing,  dear.” Contemptuous was quite possibly the best way to describe her particular brand of venom today, and when she was met with a bright smile, she nearly bat bogey hexed him on the spot. \n \n“Well, I’ve been kept prisoner for the better part of a week in the least favorite of our properties and I’m just happy to be out enjoying the day with my wife.” Her eyes snapped down to the wedding ring on his finger and she gasped, snatching his hand and trying to yank it off.  “What on Earth, witch?!”  \n \nThe fray caused a few wandering stares as he closed his hand into a fist, but she didn’t relent, instead pulling hard on his fingers as he wrenched away from her. \n \nWith a defeated grunt, she gave up, hands falling heavy at her sides. “You’re not married, you prat!” \n \n“You’re paranoid, Granger!” His eyes blew wide and round as he clucked his tongue and stared at her with stern disappointment. “Pull yourself together! It’s you who’ll get me caught if you don’t act at least a fraction less fucking high-strung. Now shush, my teller is coming.”\n \n“Mister Malfoy! I’m so sorry, I didn’t see you there!” A goblin who stood just under waist high appeared, his skin a peculiar shade of green and his black eyes appraising the situation too keenly for her liking. “Please, I’ll escort you to a private room.” \n \n“Thank you, Griszul. Miss Granger will be accompanying me; that is, if she can promise to behave.” Both the goblin and the insufferable git to her left stared at her with arched brows, as if bloody waiting for her to actually say she was going to behave. She stared pointedly back at Malfoy who swallowed a chuckle and nodded at the banker to proceed. \n \nThey were quickly escorted into a small private room, decorated with high back chairs and a velvet settee in the corner. Griszul took his place behind the desk, folding his long, knotted fingers together and canting his chin in their direction. “Mister Malfoy, your wand?”\n \n“Oh, shite. Yes, of course.” Malfoy quickly set it on the desk, watching as the Goblin tested it for validity, before gesturing that he could take it back. “Right. The Black family vaults, I need itemized records of where the pieces were sent. Dark artifacts are inconsequential; in particular, I’m looking for a necklace.” \n \nThe goblin’s wiry, overgrown brows furrowed and his stare flickered back and forth between them for a long minute. “That’s all, Mister Malfoy?”\n \n“That’ll be it.”\n \nWith a soft hum—that almost sounded like a growl—Griszul hopped from his seat and disappeared behind a door on the back wall. \n \n“He’s suspicious.” Hermione’s lips pursed into a tight pout and she straightened in her seat, a vain attempt to feel taller. \n \nDraco hummed, his eyes narrowed and fingers steepled under his chin. He said nothing, letting the uncomfortable silence stretch on like a cord pulled too tight, begging to be plucked. \n \nMere minutes later, the door re-opened and Hermione jumped in her seat, wiping the sweat from her palms on her trousers. \n \n“The ledger you requested, Mister Malfoy.” With a snap of his fingers, a scroll materialized on the table in front of them. \n \n“Thank y—”\n \n“I assume you’ve arranged some other exit from the bank today, Mister Malfoy?” A knowing brow quirked in their direction and  fuck  if Hermione couldn’t hear her own heartbeat rattling in her chest. \n \n“Do I need another exit, Griszul?” Draco stood, lifting the parchment and shoving it in his robes. \n \n“I’d suggest it, Sir. As you and your mother are now in the lobby waiting to be seen.” The goblin’s voice was tight, almost an annoyed drawl that Draco met with a soft chuckle. \n \n“Timing was never my strong suit. For your discretion, Griszul.” Tossing a small satchel of galleons on the table, he quickly reached into a pocket and pulled out a silk handkerchief. “I’ll see you at the flat, love.” \n \n\n “Wait!”  \n\n \nHis finger brushed a small jewelry box, and with a soft pucker and a snap, he was gone. Why on fucking Earth would he not let her Portkey as well? The ridiculous little shite. \n \nBaring her teeth in an uncomfortable, awkward grimace, Hermione rose to her feet. \n \n“Good day, Miss Granger.” \n \n“Mister… erm, Griszul. Don’t suppose you have a back door for me to sneak out of? Perhaps a dragon who needs rescuing? That’s my specialty…” She laughed weakly, flinching when all he did was glare back at her, his lip curling in disdain. \n \nWith a resigned sigh, she turned to leave, giving a silent prayer that the Malfoys were not on the other side of the door. A question pushed past her lips before she had the forethought to think better of it. “Why’d you help him—Draco, that is, if you knew?”\n \n“It’s his vault.” His features were void of even a trace of interest. \n \n“Right. Well, thank you.” \n \nCreaking the door open, she sighed in relief when there was no platinum blond hair in her immediate line of sight. But, as she snuck from the smallest sliver of an opening possible, the voice she’d dreaded to hear sounded from her left. \n \n“Granger?”\n \nWith a loud shriek, she nearly toppled over, stopping only when two hands caught her. The same hands, more or less, that had brought her to orgasm several hours earlier and the same lips she’d kissed swollen in her bed.  Bollocks.  \n \n“Hi, Malfoy.” She stared up at the bewildered young Malfoy, gulping as she righted herself. “I bet you’re surprised to see me here.” \n \nChuckling softly, his hands fell away from her arms and for the first time, she noticed the unfairly beautiful women over his shoulder. Jealousy roiled in her stomach at the arch of her aristocratic brow and pristine robes. Hermione was all wild hair and sweaty appendages as she panted in the face of London’s most eligible bloody bachelor. \n \n“Mother, this is Hermione Granger, officially.” \n \n“Miss Granger.” Missus Malfoy tilted her head, a pleasant smile adorning her perfect face. “I hear you’re accompanying my son to the gala this weekend—”\n \n\n “Mother…”  \n\n \n“What?” His mother’s palm came down flat on her chest as she feigned surprise. “You’ve talked about nothing else all afternoon and I’m not even allowed to bring it up?”\n \n “Mother!”  Draco hissed over his shoulder, his cheeks staining a bright pink. \n \nBiting back a giggle, Hermione nodded. “Yes, I’m excited. I just bought a dress actually.” Well,  they  just bought her a dress.  \n \n“So, out of sheer curiosity, why are you here?”\n \n “Me?  Oh—” A dry, awkward chuckle flitted through the air and she pulled on a curl. “Just... financial matters, you understand.” \n \n“With Griszul?” Malfoy’s brow arched and she felt an uncomfortable twisting in her belly.\n \n“Erm, yes.” \n \nDraco cocked his head to the side and she could feel the palpable tension press in around her. “With the private banker for the Sacred Twenty-Eight?”  Fucking, brilliant.  \n \n“Yes.” With a firm swallow, she said nothing else, silently imploring the universe to give her a bloody break already.\n \n “Right.  Well, we better off. We need to tend to our donation for the event tomorrow. I’ll pick you up at seven?” \n \n“Looking forward to that, Malf—er, Draco. Mrs. Draco,  I mean Mrs. Malfoy!” \n \nNow Narcissa Malfoy was all out grinning, a completely strange phenomenon that Hermione was not sure ever existed before this moment. She dipped her head in a goodbye and Hermione curtseyed— fucking curtseyed,  before promptly disappearing, praying to be swallowed into the void. \n\n\n\n\n\nxXx\n\n \n\nA/N: This chapter is coming to you a bit early because LK is having a rotten, horrible, bad, no-good kinda day. WAH! Only a few chapters left, which I know seems bizarre because we’ve got a lot of ground left to cover, but I promise all shall be dealt with! \n\n \nBig thanks to my beta, DreamsofDramoine; she worked tirelessly on this heap and finished beta’ing the other day! I have all the remaining chapters back!   WOOHOO!   Just have to edit and I’ll work on getting them posted over the next few days. I’m sorry, to those who would like a schedule so they know when to check! It will most definitely be up in its entirety before Wednesday! \n \n\nI know we had some sheisty gray area stuff going down, and our poor sweet BB Draco lost out on something special…  but I hope you’ll trust me to see you through until the end! I don’t necessarily like to give it to them too easy, yeah? \n\n \n\nI like to call it the “Spank and Soothe” ™ lol It’s gonna sting, but I’ll make it better ;) \n\n \n\nOkay, longest AN in the history of AN’s. Mcal is a dream for her alpha work and I love you all!\n\n \n\nThanks for all your feedback! It makes my day to hear from you! \n\n \n\nLK\n\nSure, maybe she was being a little dramatic. But  her husband  had left her to fend for herself trapped in Gringotts with an irritable goblin and not one, but  two curious Malfoys ready to pounce outside.\n \nOh, and then it’d started pouring before she could get an umbrella charm up and soaked her through and through. So, when she arrived back at  her  flat, curls heavy and sodden, clothes clinging to her body, she was ready to fight. She kicked the door open and marched over the threshold only to freeze, mouth agape at the scene before her. \n \nThere, on her sofa, in the same spot he seemed so fond of occupying, was the older Draco Malfoy. And  there , in her favorite armchair, the one she loved to curl up in on lazy Sunday afternoons, was Harry-bleeding-Potter, his emerald eyes in near slits and his lips pulled into a disapproving frown. \n \n“Darling! You’re—”\n \nAll of her ire returned tenfold and she glared at the blond prat grinning from across the room. “Shove it, Malfoy! You’re in enough trouble.” Shrugging her cloak off and depositing it on her kitchen counter, she slowly made her way into the room. Unfazed by the idiot who’d left her high and dry, all her attention locked onto her friend. “Harry, I’m not sure what he’s told you, but—” \n \n“Oh,” Harry said, voice dripping with condescension.  “He’s  told me enough.  He’s  not under oath you see. Never had the chance when he tripped through a fucking Tempus Motus and Merlin’s fuck, Hermione do you know how much trouble you’re going to be in? You’re harboring a fugitive!” \n \nWith a loud, obnoxious groan, Malfoy tipped his face to the ceiling and suddenly, all eyes were on him. “You guys are seriously buying into Cecily’s power trip too much. She’s annoying—and Potter, I highly recommend you look into that time-hopping business, because I can guarantee you that witch has been dabbling in some illegal time travel to secure her own future—but you are very much overestimating her reach. Time travel is illegal, yes, but I cannot be prosecuted in this time. I most certainly can when I return, but I don’t plan on being caught, now do I?”\n \n“And how is it, Malfoy, that you know so much about Unspeakable Sanders and the consequences of time travel?” Harry’s voice took on a new, genuinely curious, quality. \n \nSnorting, Malfoy leveled Harry with a flat stare. “I’m an  Auror,  you twit. And listen, I don’t mean Cecily’s completely harmless, she  did  curse my wife,” he paused to gesture to Hermione, still soggy and glowering, “but, her power is perceived, mostly by herself.”\n \n“So you’ve now altered  your timeline? How do you know what you’re going back to?” \n \n“No, Potter. I  will  alter the timeline when I return. Think about when you and Granger dabbled third year—”\n \n“Hey!” Harry shouted. “How do you know about that?”\n \nWith a long sigh, Malfoy’s features flattened  “I… am… married… to… Hermione.  Merlin, you two are slow on the pick-up. Now listen, from the moment you returned to a previous time, the timeline spliced. When the two of you ‘disappeared’ after setting things right, you didn’t  actually  disappear; time is not circular, you didn’t go right back to that moment in an endless loop. Those two versions of you continued on in the timeline that would have been. My being here won’t affect my time until I return, but yours will. You have a real chance to put Cecily’s reign to an end, which means Hermione will not be cursed at all. She’ll be protected in both lines.”\n \n “Draco…”  Hermione’s heart pained as she took a step into the room. Her shoes squelched against the hardwood and she felt tears well in her eyes. Things were whirlpooling, now affecting her friends and her life and she felt fucking exhausted. “We can’t mess with time like this. This is… it’s too much. I need out.” \n \nMerlin, it hurt, like a blunt knife shoved in her belly, twisting until she felt her breath leave her painfully. \n \n“That’s not your call anymore, Hermione.” Harry pinched the bridge of his nose before giving her a placating little smile. “I don’t want you dead in any reality. How can I help, Malfoy?” \n \n“First, get the Aurors off Hermione’s arse.” Harry nodded in agreement, waving his hand as if it’d be no problem at all. Producing a small photograph, Malfoy tossed it on the table between them. “This is what I need. It’s at the Manor, most likely in the heirloom room on the second floor of the west wing. You will  not  have access to it during the party, that should be obvious. I need to get to the Manor in my younger self’s stead.” \n \nRed twinged her vision and she sliced her hands in the air, magic sparking off the tips of her fingers, causing the lights to flicker. “You are  not stunning my date and impersonating him! We’ll just have to figure out some other way since I seem to be the only person here with any common sense. I’ll get up there.” At that moment, something steeled and fortified inside of her. “I promise, okay?”\n \nShe shared a meaningful look with Malfoy, both of them smiling weakly before she disappeared to change, returning and curling up on the cushion next to her possible future husband as the three of them churned over an ill-formed plan to steal a Black family heirloom from Malfoy Manor. \n \nxXx\n \nThere was a delightful hiss as the hot water rained over her, finally washing away the chill from being caught in the rain earlier. Steam billowed around her,  swallowing her thoughts as her mind drifted to wandering touches. Her neck craned, letting the jets hit that spot that made her keen. \n \nMemories of the morning and being wrapped around Malfoy in her sheets flooded her mind, and then with a happy smile, she remembered the bumbling wizard from Gringotts. In the last few days, she’d gone and fallen for the git, much to her own surprise. \n \nThe harsh scrape of metal against metal as the shower curtain was pulled back probably ought to have startled her, but it didn’t.\n \nInstead, a knowing smile graced her lips as she turned, lips seeking his without a single word spoken. Large hands molded to her waist, traveling down to her bum and filling his palms with the thick of her. \n \nUnder his guidance, they were turned, her back pressed against the cool tile as the spray slapped against his shoulders and their bodies crushed against each other.  Fuck.  She wanted him. Forever. The thought of ever being parted from him physically twisted her heart and she clung tighter to him, letting their slick bodies slide easily against each other as their kiss—impossibly—deepened. \n \nShe ached for him, arching into him as his fingers traced the crease under her bum and teased her sex. Mouth leaving hers, his kiss traveled to her breasts, sucking her nipple between his lips, while one hand toyed with the other. Merlin, had she ever felt this fucking wanton before? She was out of her body and positively lost under his touch. Squirming and whining, her fingers threaded through his soaked blond locks and she pulled him back up to her. \n \n“You’re married,” she breathed. “And I’m fully aware— hnunghhh —” she stuttered as two fingers slipped inside her, pumping slowly until she felt knees buckle. “That… well, that we’ve crossed some lines here already. But, you’ve a wife, and—”\n \nThere was a soft protesting rumble in the back of his throat as he pulled back, hand stilling as he stared at her with a flat expression. “Hermione Granger, if the you in twenty years could go back and fuck the younger version of me, I guarantee you’d do it. You think you’re someone different than her, but you’re not. Not to me. And trust me, you’d indulge.” \n \nHer gaze flickered between his blown pupils and she gnawed on her lip for a moment before deciding that not only would she shag the younger Malfoy if given the opportunity, but she would also make sure to forgive her husband in the future for doing the same. That had to count for something, right?\n \n“Okay,” she breathed, rolling her hips on his fingers and fuck it all, but he smirked before claiming her mouth. One hand slid easily over her slippery skin, stopping to roll her nipple. A soft growl rumbled against her skin and his fingers, sadly, slipped from inside her. Both rough hands then trailed around the curve of her spine, grabbing her arse and lifting her so that her ankles could lock around his lower back. \n \nWith more care and skill than Hermione could ever pray to possess, he carried them from the shower. In a few long strides, she was trapped under his body as they fell on top of her duvet. \n \nThe tip of his cock teased her entrance as their still slick bodies slipped easily against each other, soaking the duvet. Their lips parted only when he began inching inside of her, sinking so slowly that she could feel each push of his hips. Her eyes rolled back as she arched off the bed, wanting  more-more-more even as he hilted himself inside her. \n \n“Draco,” she managed between broken breaths, nails digging into the thick muscles of his back. \n \nHis face buried in the crook of her neck, droplets of water dripping from his hair hit her cheek as he sucked on the tender spot just  there  and then pulled out only to slam into her again in a single thrust. Muffling her cry with the rough skin of his neck, where the scar mangled his porcelain complexion, she lost herself. \n \nOne hand slid down the gentle curve of her thigh, finding the crook of her knee and bringing it higher so he could hit that spot that made her fucking  keen.  Writhing underneath him, she let him do it  all,  each thrust and roll of his hips bringing her closer, closer, closer still. \n \nWhen she felt nearly boneless, he pulled back onto his haunches, his cock still buried inside her as he seated her bum on his lap and began driving into her with a renewed vigor, his thumb easily finding her thrumming clit. \n \n“Dr-Draco—” Her voice cracked as she crested, every last muscle tensing as a powerful orgasm flooded her body. \n \n“That’s it, love,” he managed through labored breaths, falling back over her and finding her ear through her wild mane of her curls.  “I love you.”  \n \nHer heart fissured in the best way, quaking and shaking, and as all her limbs wrapped around him, she didn’t— couldn’t— stop the confession from slipping past her lips. “I love you, too.” \n \nxXx\n \n“You’re beautiful.” \n \nFingers stilling over a teardrop earring, Hermione caught sight of Draco behind her. He was wearing denims and a Hufflepuff t-shirt she’d bought for him at the store the other day just to annoy him. “You’re just saying that.” \n \n“No. I’m really not.” A throaty laugh rumbled through the air as he came up behind her and nuzzled his nose into her cheek. “I’ve half a mind not to let you leave in such a gown.” \n \nBiting back a smile, Hermione finished her fussing and smoothed the cool silk of her dress against her skin. “First of all, you bought it. Second, if you did that, how would I get the necklace you are so sure is going to save my life, hmm?” \n \n“Alas, my plan is foiled…” His lips brushed against her shoulders, fingers tracing the subtle curve of her hip. “However, if I’d known the dress looked  this  good on you, I’d never have bought it for you to wear with another man.” \n \n “Not  another man. You. Just a better-looking version of you.” \n \n“I would take offense to that, witch, except that I already know I’m far better looking now.” \n \nHer chin tucked into her chest and she let out a dry laugh, mind wandering to the night ahead whilst unable to stop herself from replaying the night before. “I’m nervous.” \n \n“It’s just us. And I know that doesn’t mean much to you yet, but we’re good together. Better than good. Just cut the poor sod some slack when he inevitably puts his foot in his mouth, yeah?”\n \n“Somehow, I’ve got to get away from him and through that massive house. I have no idea how I’m going to do it…” She’d been so overly confident the day before, so sure that nothing would stand in her way when she put her mind to something. But now, in a dress made for a witch with far more confidence, and a tremble in her limbs, she wondered how on Earth she was going to pull it off. \n \n“Ask him to take you there.” Draco shrugged. \n \nRolling her eyes, Hermione snorted and leaned back against his broad chest. “Brilliant. Say, Malfoy, mind showing me up to where you keep your precious family heirlooms? I want to steal one.  And  you forget, I can’t say anything to him. Not even if I wanted to.” \n \n“Why?”\n \n“What do you mean  why?  That stupid oath! I can’t say anything to anyone who’s not directly involved in the…” Her voice drifted away, brows furrowing as pieces began clicking to place. \n \n“There she is! Brightest witch and all that.” Draco grinned, swatting her encouragingly on the bottom. \n \n“Draco! I can tell you! Or rather,  him . It’s still you! Oh, you’re brilliant!” She turned, eyes bright and grinning. \n \n“As I often try to tell you, you just never listen.” \n \nA knock rapped on the door and Hermione squealed—she actually squealed. Pressing her painted lips to his cheeks, she rushed for the front room and smoothed her dress one final time. With a long, fortifying exhale, she opened the door and her breath hitched at the sight of the man waiting for her. \n \nTall and lean, hair neatly styled, his face was turned down to his shoes. His robes fit him  perfectly , made for him and him alone with crisp black lines and a perfectly knotted tie. In his hands was a bouquet of calla lilies and a genuine grin curved her lips. \n \n“Hi, Malfoy.” \n \nAt that, his chin lifted, gaze traveling along the subtle curves of her body until finally resting on her face. Sucking in a cracked breath, he smirked. But it wasn’t the one she was used to, there was no smugness, no thinly veiled insult waiting—he was nervous. \n \n“Granger,” he said with a gulp, proferring the white flowers to her. “You’re beautiful.” \n \nThe simple words lanced through her, breathing new life into her lungs. Suddenly, she could see it: a life with him that was full of bickering and jabs but also nights filled with quiet and good books, traveling and exploring and learning. \n \nThere was a strange inevitability to it all. As if the last decade, all the moving pieces—bad and good—were guiding them together. And even if the roadblocks changed, they were still driving forward, towards each other. \n \n“Thank you. You don’t clean up so bad yourself.” \n \n“Ready for tonight? I was thinking we’d Floo into the study and have a celebratory drink first if that’s alright by you.” Shoving his hands deep in his trouser pockets, there was a serious set to his mouth that felt off. \n \n“Celebratory?”\n \n“Yeah, Granger.” A lopsided smile pulled at the corner of his lips. “You’re finally giving me a chance.”\n \nA furious blush stained her cheeks as she bit back a smile. “I can’t do this if you’re going to be like,” she paused to wave in his general direction, “that all night. Can’t you just make fun of my hair or my swottiness or something? Break the ice?”\n \nA chuckle rumbled from deep in his chest and his smirk widened. “You could always start. You haven’t called me a prat or git at all, you’re equally to blame.” \n \nRolling her eyes, she stepped aside so that he could enter, muttering a low, “Prat.”. But he didn’t pass her, instead, he paused and stepped into her until her back was pressed against the door and their noses were nearly bumping. \n \n“What if we broke the ice a different way?”\n \n“O-oh?” Heat billowed off him, warming her until she was nearly fucking panting. Cradling her cheek, he gently tilted her face, his thumb dragging along the sharp line of her jaw. His silver gaze darkened, moving from her parted lips to her eyes, a silent question crinkling the corner of his eyes. \n \n“You never told me if this was a date or if I was just escorting you. And I’d really planned to play it by ear—but, Merlin, that dress on you.” \n \nAnxiety swelled and crashed in her chest and the hand that was resting on the doorknob tightened, the free one coming up to rest on his chest. “I suppose it could be a date… if you wanted. Although, I’ve been told I’m not very good at dates so maybe—”\n \nHe swallowed her rambling, pillowing her lips with his impossibly soft kiss. Inhaling sharply through his nose, he took another step, his body pressing hard into her. And she couldn’t help but smile against his lips. It was tender— tentative,  like at any moment he was waiting for a hex or a punch, both of which he’d received from her on various occasions over the past decade. \n \nTheir lips parted and he stepped away as if nothing had happened. Eyes wide, Hermione steadied herself with a breath before swallowing. “That is certainly one way to break the ice, Malfoy.” \n \n“I’ve got all sorts of tricks up my sleeve, Granger. Potter said he handled your pesky little Auror problem?”\n \n“Yep. Sorry if you were wanting to see Jacobs or Haverfield in a tux—it’s just me tonight.”\n \n“You’ll have to do, I suppose.” With a sly wink, he retreated as she caught her lip between her teeth and stifled a laugh. \n \n“Let me grab my things, I’ll be just a moment and we can go.” \n \nCrossing the small room, she slid into a crack in her bedroom door and nearly barked out a laugh at the glowering Malfoy laying on her bed. “He’s lucky I don’t hex him. Kissing my wife…” \n \n“You’re insufferable, truly. However, you’re not a bad kisser at twenty-three.” His lip curled into a sneer and she chuckled to herself as she gathered her wrap and clutch, safely stowing her wand inside. “Any advice on how to tell him that I’ve been stowing away his older self in my flat for a week or that I need to steal his family heirlooms?”\n \n“I’d lead with that.” He winked as she waved and said a quiet goodbye, returning to her much younger date in the other room. \n \nShe paused, studying the tense hold to his shoulders as he studied the knick-knacks on her mantle. “Ready?”\n \nTurning, his lips curled in a lopsided smile and he nodded. “As I’ll ever be.”\n \nxXx\n \n\nA/N: As always, thank you for reading!! And to my wonderful Alpha and Beta, MCal and DreamsofDramione, you both are angels and I send you all the heart eye emojis. \n\n\n\n\n\n\n\nA tremor crawled through her muscles, causing her shoulders to shake violently as she stared wide-eyed at Draco Malfoy. He seemed fully at ease, idly swirling the firewhisky in his crystal tumblr. His study was poshly decorated, almost modern in a way.\n \n“Are you sure you’re okay? If it’s because I kissed you—”\n \n “No!”  She all but shouted, then quickly slinked back into the sofa in shame. “No, I liked that. That was—nice.” Flinching away from her anticlimactic word choice, she noticed Draco begin silently chuckling across from her. “It was  very nice.” \n \nThe silence stretched on and on as she stared at random points of interest around his study. “You said you normally don’t bring anyone to these types of events.” \n \n“Merlin, no.” He barked out a laugh as he finished his drink. “It’d be an absolute nightmare. If I were to bring someone to these things, the press—and my mother—get all sorts of ideas.” \n \n“What sort of ideas?”\n \n“That I’m serious about them.” He shrugged, rising to his feet and making his way towards the small wet bar. \n \nA smile stretched across her painted lips. “So, you don’t mind if they think you’re serious about me?” \n \nHis shoulders tightened and he took a long moment, faced away, before he finally returned, decanter in hand so he could top off her drink. Clearing his throat, he took his seat again, this time with a serious expression as he stared back at her. “No, I don’t mind if they think I’m serious about you.” \n \nAll of a sudden, her throat felt too tight and her skin too hot. He was taking a risk by bringing her, one that she hadn’t fully understood, and she had secrets— big secrets. Secrets like she’d slept with someone else—or rather him—in the wee hours that very morning. \n \n“Why?” she managed, swallowing too much firewhisky immediately after.\n \nHis gaze tightened, fighting back a smile from behind the rim of his glass. “You’d have made an alright Slytherin, Granger, but a far superior Ravenclaw. Surely, you can surmise the rest.”\n \nGaze falling to her lap, Hermione tried her best to steel her nerves. “Draco, I should tell you something—”\n \n“No.” \n \nShe scoffed. “What do you mean  no?” \n \n“I mean, don’t tell me right now. If you still want to tell me, tell me later.” \n \nThat was a dangerous offer, one that allotted her too much time to chicken out and revel in his company. “It’s important and something you should know before we continue on and people think you’re serious about me…”\n \n“I know everything I need to know about you. I wouldn’t have asked you here if I wasn’t sure.” He rose swiftly from his seat, depositing his glass on the end table and closing the button on his jacket. Offering her his palm, Hermione stared at it for far too long. She should tell him. There was no question. But instead, her jaw snapped shut and she laid her fingers in his. \n \nThey spoke quietly as they moved through the halls of the Manor, finally emerging on a landing looking down on a grand entry. Her breath caught as they stood at the top of the wide staircase leading into the foyer. Clusters of guests lingered outside the ballroom where the constant thrumming of idle chatter lilted through the air. \n \n“Nervous, Granger?” A warm palm came down on the curve of her spine, and she chanced a look in his direction, catching the end of an encouraging smile as he readied himself for the party below. \n \n“Yes.” \n \n“It’s not so bad  and there’s a lot of alcohol.”\n \nOffering his elbow, Hermione couldn’t help but chuckle to herself as she wound her arm through his. “You know, as awful as you were in school, part of me hoped you were going to ask me to the Yule Ball. So, this is all a very strange teenage fantasy of mine come to life.” \n \nTheir steps synced as they descended the stairs, his gaze snapping to hers. “You wanted  me  to ask  you?” \n \n“You don’t have to sound so shocked, Malfoy. You were a right an utter arse, but you were pretty fit. I don’t think there was a single girl in the school who wasn’t secretly hoping you’d ask them. And  still,  you chose Pug-faced Parkinson.” Rolling her eyes, she bit back a smile, enjoying the gaping look on her date’s face. \n \nA few bright flashes from the cameras waiting at the foot of the stairs stole their attention, and with a quiet cough, she fixed a bright smile on her face. Malfoy followed her lead. They paused there a minute as the press took their photograph until finally, he leaned in, his breath tickling a wayward curl. \n \n“I thought you were the prettiest girl at Hogwarts that night,” he whispered, “and every night after. Once I locked that brooding oaf, Krum, in a broom closet so he couldn’t make it to the library to see you.” \n \nA blush bloomed on her cheeks and she laughed quietly as Malfoy led her through the throngs of reporters and into the ballroom. \n \nxXx\n \nDinner was delicious, the pudding, too. Their champagne flutes were never empty and she spent the night nearly doubled over in laughter, wiping happy tears from the corner of her eyes as Theo and Malfoy attempted to best each other with the most embarrassing secrets. During which, she’d learned that Theo Nott had actually lost his virginity to Milicent Bulstrode, and Harry immediately said that it was no wonder he never again returned to women. She also learned that Draco Malfoy had kissed—with tongue—Blaise Zabini on a dare. \n \nAt some point, Draco’s hand had come to rest on the back of her chair, his thumb rubbing soft circles on her shoulder blade. It was innocuous enough, barely noticeable if not looking for it. But the simple gesture was something the older Draco had done along her thigh and she was reminded with a jolt why she was here. \n \nA shadow fell over the table and every set of eyes snapped to the newcomer, Cecily Sanders, dressed to kill in a formal black gown and crimson lips. Her eyes danced with fire as she fixed her gaze on Hermione. \n \n“Good evening, Unspeakable Sanders,” Malfoy said politely, rising to his feet alongside Theo. Hermione and Harry remained seated, both glaring back at the beautiful witch in question. \n \nFor a splinter of a second, Cecily’s gaze flickered to Draco. “Auror Malfoy. This year’s event is even more grand than the last. Your mother has outdone herself.” \n \n“As she always strives to do.” \n \n“I was wondering if I might have a moment with Miss Granger?” Cecily’s black stare returned to Hermione and her stomach lurched.\n \n“I’ll be right back,” Hermione said quietly, turning towards Draco with a polite nod. \n \nFollowing Cecily a few paces away, Hermione tried to silence her rioting nerves. There was something about the hard edge of her glare; they were both playing the same game but Hermione had the ill feeling that Cecily Sanders had more pieces than she did. \n \n“Unspeakable Sa—”\n \n“Save your well rehearsed lies for someone else, Miss Granger.” The Unspeakable’s lips curled in a disdainful sneer and a fresh surge of rage bloomed to life in Hermione’s chest. “I know what you’re doing here. I know what you’re after and that you’ve finagled your way out of your Auror protection.” \n \nA loud, indignant scoff pushed past Hermione’s lips and she rolled her eyes. “Bullshite, Sanders. Protection? We both know full and well that’s not what they were doing.” Taking a hard step into her, Hermione fixed a hard cut to her eyes. “I’m here with my date to enjoy a lovely party. If you have a problem with that—”\n \n“Oh, I’ve got a big fucking problem with that. You see, it’s all too coincidental that with the situation being what it is that you’ve decided to strike up a romantic relationship with the one person who might be able to save your sorry arse.” \n \nCecily knew. Malfoy was right. \n \n“Sorry, Unspeakable Sanders, I don’t know what you’re referring to. My sorry arse is just fine for the time being. I’d be far more concerned with your own.” \n \nFull lips parted, ready to spit out another nasty retort when a gentle hand brushed her arm and Malfoy came to stand at her side. “Care to dance?” \n \nStartled from the moment, Hermione offered him a weak smile as they turned for the dance floor.\n \n“Miss Granger!” Cecily shouted at her back. Blood boiling, Hermione turned, lips pursed into a tight line. “It would be a grave error to think just because you’ve dismissed your protection detail that the Department of Ministries is not taking extra special care in your case.” \n \nWith a tight throat and a sharp inhale, Hermione forced a smile on her face. “Noted.”  \n \nHer mind wandered, replaying the conversation as she was led through a thick crowd of people. Before she knew it, she was pulled into a formal waltz, falling quickly in step with him. It took all her strength to focus on this moment, which deserved all her attention. Because while a future Hermione might live on with her husband,  this  Hermione still needed hers. His palm burned through the crimson silk of her dress and after a moment, she was tugged a step closer, his lips tugging into a smirk as he stared down at her. \n \n“This is awfully close for a gentleman,” she breathed, ignoring the thundering of her heart in her ribcage. \n \n“You’ll find I’ll play hard and loose with the term. For instance, I can most certainly lead you through a proper waltz  but  I have absolutely no control of my left hand.” As he spoke, his fingers dipped to the curve of her bum, seeming to search for something as his brows furrowed. “My, my, Granger. If I’m not mistaken, you aren’t wearing any knickers. Cheeky little witch.” \n \nHer jaw fell open, eyes rounding at his crass—albeit, true—statement. “Don’t get any ideas, Malfoy. This material doesn’t go well with knickers.” \n \n“Oh, I’ve got all sorts of ideas, love. But zero expectations, so don’t worry about that.” Despite what was said, his gaze darkened and his mouth drifted dangerously close. Over his shoulder, Hermione’s gaze caught on Cecily, standing at the fringe of the dance floor with a murderous glare and a champagne flute at her lips. \n \n“Can we get some air?” she managed, her chest suddenly far too tight. Her gaze flickered nervously over her date’s shoulder, landing on Harry, who said nothing, instead folding his lips into a tight smile. He rose from his seat, closing the buttons on his jacket as he nodded to a few well placed Aurors around the room. \n \n“Sure.” When she returned her attention to her date, she found his brows furrowed and a serious set to his mouth. Hands dropping away, he quickly escorted her from the ballroom. With each step, her nerves heightened, painful bursts fluttering to life in her chest as dozens of eyes followed them from the room. \n \nBut her attention was elsewhere, tracking Cecily Sanders being approached by Harry and two other Aurors. She couldn’t hear what Harry said, but she knew well enough when Cecily’s eyes widened to saucers and her jaw dropped. Their gazes locked a final time, Hermione dipping her chin quickly at the Unspeakable before being ushered gently from the room. Harry bought her the most coveted commodity: time.\n \nThe cold air nipped at her skin on the back veranda, sobering her, and for a quiet moment, she took in the sprawling gardens, peppered with tiny golden lights under a clear night sky. Truth set heavy and ugly and  painful  on her chest, and she sucked in a stunted breath as she tried to make sense of it. \n \nAbsently, she rubbed at the prickled gooseflesh spreading on her arms, lost in the haze of her own thoughts. A thick jacket was draped over her shoulders, a warm breath following, ghosting across her neck. \n \n“Did I do something? You know I was just being a prat earlier…” \n \nA soft chuckle slipped past her lips and she tugged the front of his jacket closed. “You’re  always  a prat.” \n \nAppearing in the side of her vision, hands shoved in his trouser pockets and gaze locked forward, he spoke quietly,  seriously  . “After all these years, I’m still utterly intimidated by you, Granger. And sometimes, when intimidated, I slip into the kid I was. I—” he paused, inhaling sharply through his nose. “I hope you know that’s not  really  who I am.” \n \nThoughts of the man he’d become and the hard times he’d shelter her from floated across her mind and a small smile graced her lips. “Funny enough, I do. But that’s not why I’m—”\n \n“Draco, dear?” \n \nHer words drifted away in the night air as Narcissa Malfoy appeared in the giant door frame behind them, calling for her son. An ache settled deep in her gut and she dipped her chin towards his mother with a tight smile. \n \n“One moment,” he mumbled from the corner of his mouth, retreating and leaving his jacket still wrapped around her shoulders. \n \nMerlin, the moment stretched on, quiet rumblings finding her ears until finally, Draco groaned and trudged back towards his date. “My mother requires my assistance inside. Do you want to—”\n \n“I’ll wait here,” she rushed, guilt climbing up her throat disguised as bile that threatened to betray her. This was it.  Third floor of the west wing and back.  \n \n“Okay. I’ll be back as quick as I can.” \n \nLips pulling into a thin smile, she tucked her chin into her chest to hide the tears welling in the corner of her eyes. “Don’t rush.” \n \nHe crossed the room, disappearing into the crowd with a final smirk over his shoulder. \n \nAs soon as he was out of sight, she buried her guilt and pulled the photo from her clutch, staring at it intently for a long moment. A small voice, growing louder by the minute, implored her to wait for him, to just tell him what was happening but—she couldn’t. \n \nTwisting her wand just so at the photo, she cast her spell in a low whisper.  “Avenseguim.” The image folded in on itself, making a small airplane and twirling in front of her face for a moment. “Discreetly, if you don’t mind.” Bobbing up and down in an almost nod, the airplane zipped down the few stairs and followed a cobbled path hugging the back of the house. \n \nShe followed its steady flight for several minutes, its wings happily curling in the evening breeze as it tracked forward. Her paranoia, however, screamed with each click of her heels against the stones. Somehow, she’d gotten herself so caught up in this mess of time travel that she’d lost sight of the very obvious issue at hand, which was that she was robbing the Malfoys. Hugging Draco’s coat tighter around her, she spied a smaller veranda near what she assumed was the western wing of the house. Nearly there. \n \nThe small plane hovered over the glass panes on the door, much smaller and far less grand than the ones on the back of the foyer. Its nose bumped into the surface several times, before taking a large loop up and around, poking her hard in the back. \n \n“Ouch! I get it, alright! I’m going…” Knowing better, she tried the handle, finding it dutifully locked. Pointing her wand at it next and ignoring the ever-persistent plane ramming her shoulder, she steadied her voice with a long breath.  “Alohomora.”  \n \nFrowning, she found the handle still locked and tried one more time.  “Alohomora.”  \n \nA loud  crack  from her left sounded and two house elves in smart little tuxedos with brightly colored bow ties appeared, eyes wide as they stared at one of their guests trying to break into their house. They didn’t say a word, not even as Hermione’s hand shot out for them and she cried into the darkness when they simply Disapparated.\n \n“Fuck,” she hissed, turning in a flurry, looking for the way she’d come. Of course, she  should  have known better, but she’d gone and followed a bleeding paper airplane on her quest without taking any wards or locking charms into consideration. Bugger it all. \n \nA quieter  pop  pierced the air, and with it, her heart plummeted. She froze, shoulders rising up to her ears as she awaited a hex… or worse. \n \n“Granger?”  Worse, then.  \n \nA tremble began in her chest, quaking through her limbs violently. She couldn’t move.  Couldn’t breathe. \n \n“Granger?” he repeated, his voice lower and laced with worry. \n \nKnees buckling, she turned, tears welling in her eyes as she stared back at him, jacket-less, hands shoved in his pockets. “Don’t hate me,” she breathed. \n \n“Why on earth would I hate you? Did you get turned around or—”\n \n“I need your help, Draco.” Clenching her eyes shut, she steeled herself for the rest of it. “And you very well  might  hate me after.” \n \nThe corners of his eyes crinkled, the silver darkening as he took a step towards her. Another hard poke from the airplane and she could almost  hear  it groaning at her ineptitude, before zooming past her and prodding at the door again. \n \n“What’s that?” \n \n“I don’t know where to start,” she chuckled, tucking a curl behind her ear and kicking at the stones at her feet. “It’s all such a mess.” Voice cracking, she felt a familiar sting in her chest. \n \nHe snorted, clearly becoming agitated at the encounter as he gestured wildly at her. “Maybe at the beginning? For fucks sake, it can’t be that bad—can it?” \n \nWith a final hard swallow, she tipped her chin up to him and locked her gaze onto his. “Last week, I was called to the Department of Mysteries. Unspeakable Sanders swore me to an oath of confidentiality, so I haven’t been able to speak to it about anyone outside the case.” For the first time in days, her tongue and teeth moved freely, the truth falling past her lips. \n \n“That’s why you have Aurors following you? So, what changed? Why can you suddenly speak about it now?”\n \n“Yes, that’s why I have Aurors following me around. And, nothing changed, except that I realized I could have told  you  all along.” A thin, slick coat of sweat covered her palms as a  whooshing  filled her ears. \n \n“Me?” Another step towards her and she could feel the tension thick around them. \n \n“You see, funny enough, someone fell through the Tempus Motus in the Time Room. I was called down because the man that came through was from twenty years in the future and demanded to speak to me before anyone else.”\n \n“…Okay?” Confusion was still plainly painted over his features and he was suddenly close enough that she could see the flecks of blue peppered in his grey eyes, the dim light casting a hazy golden glow on one side of his face. \n \n“The man that came through claimed to be my husband, twenty years from now at least. He was— is  —you. The future version of you fell through time and you did so to get this—” Flicking her wand at the persistent little airplane still crashing against the windowpane, she summoned it back to her side.  “Finite.”  \n \nWith trembling fingers, she peeled open its folds and presented it to him. There was a long, tenuous moment of silence as he studied it.\n \n“In the future, at least that version of it, I’ve been cursed. I—well, I’m dying, and apparently you weren’t exactly keen on that happening. So, you came back for me, for this necklace, rather. It’s supposed to—”\n \n“I know what it does, Granger.” His voice was tight, strained to the point it sounded painful. “So, this alternate version of me is where exactly?”\n \n“At my flat. He…  you  have been, mostly, since the day you arrived—not that you’re very pleasant about it.” \n \n“We’re married? How’re you sure it’s even really me?” His voice carried a trace of awe, or maybe it was disbelief, but his eyes still hadn’t lifted from the photograph. \n \nA dry laugh filled the air as her eyes widened. “Trust me, I’m sure and yes. Married almost seventeen years, it seems. We seem happy, from what you say. We have a house in the French countryside and I’ve just announced my bid for Minister of Magic, which is why Cecily Sanders has seen fit to curse me, the stupid bint. And, you know how I like my breakfast on the weekends and how I take my tea. You’re still driving me crazy, even two decades later, which doesn’t surprise me in the slightest…” A tear streaked from the corner of her eye and she sucked in a watery breath, desperate for him to hear it all and fall as madly in love with the idea of  them  as she had. “We’re in love.” \n \nThe taut muscles of his neck flexed as he swallowed, his eyes finally flicking up and locking on hers. He remained painfully quiet, studying her for long, immeasurable moments. Finally, when she felt her chest was going to actually burst, he turned on his heel and easily turned the door handle that had given her so much trouble, holding it open and gesturing for her to step through. \n \nBreathing a deep sigh of relief, she followed suit, entering the west wing and following him on a quiet trek through several halls, finally pausing at a pair of double doors with intricate runes engraved on the surface. With a knitted brow and a downward turn to his mouth, he pushed them open. \n \nUpon entering, her breath caught at the sheer number of items in the vast room: case after case of beautiful jewelry, magical artifacts, and statues. Hermione moved farther into the room, though Draco remained near the door, hands clasped in front of him. Approaching a few mannequins standing tall against the far wall, her jaw fell open as she studied the stunning vintage robes, delicate threading woven in complicated patterns. \n \nNext to those sat a table of tiaras, each one encrusted with gems of every size, shape, and color. Then she saw a case of books so old they must have been handed down for generations and generations, after that was an array of medieval weapons and wands. \n \n“This is all so incredible,” she breathed, brows lifting as she made a small turn in the room. \n \n“You don’t seem at all shocked that we end up together.” He was still…  strained.  The lilt of his voice didn’t sit well with her and a whole coven of pixies erupted in her belly. \n \n“I was. I didn’t believe it, honestly.” A half-smile graced her lips as she happened upon rows of rings behind a glass enclosure. Idly, she tried to pick out the one Malfoy gave her, her eyes catching on a large, clear diamond near the back nestled in a bed of rubies. “But, you’re very convincing,” she mumbled from the corner of her mouth, turning her back on the jewelry and smiling fondly at him. “The things you’ve told me about the life we have, I hardly think you’d make them up.” \n \nThe weight of his gaze seared into her, a fevered flush crawling up her neck and staining her cheeks. “It’s a bit odd that you know me so intimately,” he confessed. “It’s a little hard to believe any of this at all.” Moving towards the far wall, he pulled open a drawer and lifted the black opal from its resting place, holding it out to her as if it were nothing more than a dime-store necklace. \n \n“Are you sure?” Her mouth ran dry as she crossed the room to him, studying the giant gem up close. \n \nHe huffed and pushed it at her. “If you need it that badly, it’s yours. At least it was given freely.” \n \n“Thank you, Malfoy,” she said earnestly, her shoulders sagging as she took it from him and stowed it safely in her bag. “You are making yourself very happy right now.” She laughed easily, but found his presence still tight and unsure. \n \n“Do you call him Draco?” His gaze fluttered between her eyes, taking in every small detail, seeming to catalog it. \n \nShe gulped. “Sometimes, when I’m not annoyed with him, which I usually am.” \n \n“What does he call you?”\n \nA happy smile fought to break free. “Usually, you call me love, though I fought you on it for a good few days. When you’re being cheeky it’s darling. Sometimes it’s still Granger and, even more rare than that, Hermione.”\n \nPeering at her through half-lidded lashes, his lips twitched in a barely-there smirk, before falling into a displeased turn again. “Has he kissed you?”\n \nThere it was, that sinking pit in her stomach, twisting and gnawing at her insides until she felt she might vomit it all out onto their shoes. “Draco—” \n \nShe turned, waving him off, but his hand shot out and wrapped around her slender wrist, halting her.  “You  don’t call me Draco. Has he? It’s just a question, Granger. A pretty easy one in the grand scheme of you almost robbing me of my grandmothers necklace tonight.” There was an angry edge to his voice that at one time felt familiar, a lifetime ago when he was still an angry kid, but it’d been so long since she heard it that she recoiled from him entirely. \n \n“Merlin,  Malfoy.  Can you lay off a bit?” \n \nAn exaggerated snort escaped him and he moved too fast, cutting into her route and causing her to halt. “He kissed you! The fucking prat…” There was a disgusted twist to his features before realization seemed to slam into him. “Did you fuck him?”\n \nHermione’s head cocked back, hand twitching to slap or hex him, before tightening into a hard fist instead. \n \nThe blood drained from his face, lips parting in utter disbelief as he fell back two steps. “You actually slept with him— with me?” \n \nAngry tears crept over the rim of her eyes and she batted furiously at them, trying to wipe them from existence. “It’s not—it’s not like that. It’s not like it’s just anyone, it’s you!”\n \n“Yeah!” he shouted, regaining his stature and sneering at her. “That’s the fucking point, Granger! You fucked me, without me knowing. You’ve now already had that experience, so let’s say that this grand life that was awaiting us still panned out—you took something from us! From me! How would you feel if I already knew you intimately? Already seen you naked? It’s a violation of  my  privacy!” Draco paused, running an agitated hand through his hair. “Your little play-husband? He’s going back to his wife, and you? Well, you’ve got one very pissed off Malfoy who can barely stand to look at you right now.” \n \nEach word gashed into her heart, leaving it bleeding and broken as she tried to form words with a trembling jaw and soaked cheeks. “Draco, it’s not—”\n \n “Is that why you came with me tonight?” His voice was acidic, face pinched in revulsion. “It had nothing to do with me, or any future that we might have together, did it? Merlin, I thought you might actually fucking liked me!” Hands slicing through the air, he marched over to the looming fireplace and grabbed the bag of Floo powder off the mantle. “Go, Granger.” \n \n“Draco, I  do  like you! I know it sounds crazy, but I love—”\n \n“Don’t you dare fucking say that. You don’t know me. You know some time-traveling version of me that will now never happen anyway, so go back to him. Take your jewelry, take whatever you want, just fucking go.” He didn’t wait for her. Dropping the bag back where it’d sat, he stormed from the room, the doors slamming shut in his wake. \n \nxXx\n \nStepping through her Floo, a sullen drag to her features and mascara stained cheeks, her eyes drifted towards the empty spot on the couch. After kicking off her heels, she made a weary trudge to her bedroom. On her bed, Draco was dozing, a book spread open on his chest and his lips barely parted. \n \nShe crossed the room and perched in her fancy dress on the edge of the bed. He’d be leaving soon. This strange, silver-haired husband of hers that she’d gotten to borrow for a week. It was still him, the Draco from moments before that yelled at her until his face was pink, but the one very big difference was that the one in her bed already knew that he was in love with her. \n \nSure, Malfoy might fancy her currently, but he didn’t love her, not even close. Clicking open her clutch, she withdrew the necklace that this man had traveled through space and time for and rested it gently on his chest. Her fingers lingered, splayed against him. \n \nBlinking awake, he squinted back at her, smiling groggily until he noticed her tear-stained cheeks and waterlogged lashes. “Love? What happened?” Pushing up, his hand caught hers and he startled, feeling the cool temperature of the necklace under his fingers. “You got it?”\n \n“Yeah. I got it.” \n \nHis brows furrowed, one hand coming up to cradle her cheek and she couldn’t help but press into the gentle touch, her breath stuttering as she struggled to steady it. “What’s wrong then?”\n \nLifting her teary gaze to his, she tried her best to smile, but instead, her lips fell into a trembling frown. “I lost you.” \n \nxXx\n \n\n A/N: AH! We are almost at the end! I can’t believe it and I want to shout it into the universe how thankful I am that you’ve all enjoyed this story! I wish it was longer so I could write more of it haha but alas, Zaddy Malfoy has a wife to return to so this story must sadly draw to a close. I will get the next chapter ASAP! I promise not to keep you waiting! \n\n \n\n As always thanks to MCal and DreamsofDramione! Extra special shout to MCal who took a second pass at a chunk I added to this last minute. Please forgive any errors, I change stuff after my lovely beta picks at it so all the remaining misplaced comma’s and poor uses of “it’s” are mine.  \n\n \n\n Be back soon! LK \n\n\n\n\n\nWaking, still wrapped in fine silk with a warm hard body curled around her, Hermione flinched away from the memories crashing behind her clenched lids: visceral visions of how she’d totally and utterly fucked things up the night before. \n \nDraco shifted behind her, his hand curling around her waist and face nuzzling into the curls splayed over the pillow. She chuckled and turned in his arms, peeking up at him through puffy eyelids. \n \n“Doesn’t my hair bother you?”\n \n“Yes,” he said around a yawn, tightening his hold on her. “But, it’s become almost another person in our relationship, and I find that in order to be next to you, I must tolerate  it.”  \n \nA surprising laugh pushed past her lips and she batted as his chest, pulling herself from his arms to sit on the edge of the bed. But again, a heavy weight settled on her shoulders and she felt her very soul sag. \n \n“It’s going to be okay, love. He’ll get over it.” Draco moved behind her, resting his forehead on her exposed shoulders. Since she’d explained the volatile situation the night before, he’d been careful of how he touched her. Holding her as she cried herself to sleep, but never kissing her, not even a single straying touch, and for that, she was thankful. \n \nWhat she’d had with him was special, something she would never forget, but it was over. Especially if she wanted to patch things up with the only Malfoy she was about to have left. \n \n\n Left.  \n\n \nHunching under the weight of a tangible pain, her gut twisted and her chest tightened until her breath was only coming in tight wheezes. \n \nHe was going to leave her. \n \nSoon.\n \n“I’m going to shower,” she croaked, quickly rushing for the bathroom and pressing the door shut, resting her forehead against it as she sucked in greedy lungfuls of air. From the other side, she could hear a muffled groan followed by footsteps leading out of the bedroom and her heart splintered, a piece of it going with him. \n \nxXx\n \nFreshly showered, Hermione stared at herself in the foggy mirror. Splotchy pink cheeks and sodden curls stared back at her. Long gone was the pretty, done up witch from the night before.\n \nAfter drying her hair and applying minimal makeup to ready herself for the day ahead, she left the bathroom. Slipping into a comfortable pair of denims and her favorite jumper, she exited to the front room, finding Draco at the window, handing a treat to an owl before it quickly flew off into the late Sunday morning light. \n \n“Did something arrive?” \n \nHe turned, eyes misty and a weak smirk on his lips. Shaking his head, he rose to stand, and she noticed that he’d changed into the same outfit he’d worn when he’d arrived. “No, sending something off.” \n \n“Are you—” Her throat closed, unable to speak the words into existence. Tears pricked the back of her eyes and she supposed she ought to just get used to being a tear-stained wreck for the foreseeable future. \n \nLips quirking in that way only his could, he held his arms out for her. “It’s time, love.” \n \nBut her feet were rooted to the floor and she fought to keep from sobbing as she buried her face in her hands. “It’s—it’s too soon. You could stay the day and leave tomorrow. I could take you to the Ministry myself and make sure you get back—”\n \n“Oh, love,” he crooned, crossing the room to band his thick arms around her. Pressing his lips into her hair, she felt her tears stain his shirt. “It’ll be alright. Don’t worry about me. Although, I admit, I’m going to miss you. I forgot how tenacious and fiery you were before—you still are, by the way, just not always at me.” A throaty laugh rumbled from his chest and into hers as she buried her face deeper, sucking in the familiar scent of him. \n \n“I don’t want to lose you,” she cried, breaths broken and ugly as she wrapped her arms around him. “You’re such a stupid prat. You come back here and make me fall in love with you and then just… then just…  leave.” \n \n“I was never meant to stay, love.” His lips brushed her temple before he rested his chin on the top of her curls. “Besides, you’ve got stuff to do. You’ve got a man to win back, a corrupt Unspeakable to put into Azkaban, and I—well, I’ve got a wife who needs me. And I very much need her.” \n \nCradling her cheeks between his palms, he tilted her face up to his, studying her with a deep reverence. She brought her hands up to wrap around his forearms and felt the static of their magic flare to life. Gasping, her eyes locked on his. \n \n“We do that sometimes when we have to part. Our magic doesn’t like it when we’re separated—it can always tell when we say goodbye.”\n \n“I don’t know how to be without you,” she confessed, lashes fluttering shut as fresh tears tracked new courses down her cheeks. \n \nA soft snicker chased his breath as he kissed her forehead and then the tip of her nose. “You don’t have to, Hermione. Take some solace that in two decades, and for as many decades as we’re allowed after that, I love you exponentially more. This isn’t the end, love, it’s the very beginning.” \n \n“I love you, Draco,” she breathed, reaching up for his face and pressing a soft kiss against the corner of his mouth. As she pulled away, he turned, catching her lips and deepening what she’d started, winding his arms around her waist, breathing hope into her lungs. \n \nTheir lips moved frantically against each other, saying goodbye with press after press, tears coating their lips. Sucking in a sharp breath, they parted, foreheads resting together as she watched a few wayward tears stripe down his cheeks. “You know, after I heard what an absolute git I was last night, I promised myself not to cross any more lines. But maybe he’ll give me this last one.” He smirked, pressing a final, lingering kiss to her lips and she couldn’t help but sob as he backed away, her fingers slipping from his chest. \n \nAn endless ache built in her chest as he made his way to his cloak on the back of the chair. “What if Cecily arrests you?” \n \nSnorting, he closed his cloak around him and gave her a wink. “I’ve a Portkey and a letter telling her to fuck off that I plan to leave on her desk. It’s Sunday, no one will be there and I’ll be landing right next to the Tempus Motus. Perks of being married to Hermione Granger and best mates with Harry-bleeding-Potter.”\n \nSmiling weakly through a trembling jaw, she wrapped her arms around herself and nodded. “I’ll miss you.” \n \n“Go find me, love. I’m not that far away.” He paused, breath catching as his eyes rimmed with tears yet again. “I’ll miss you too, more than you could possibly know.” Reaching into his pocket, he pulled out a small handkerchief and grinned at her.  “Love you, Granger.” \n \n“I love you, Malfoy.” \n \nBrushing his finger against the knick-knack, he was tugged away, leaving behind only a soft pucker of magic and a hollow feeling in her chest. \n \nYesterday, she had two Draco Malfoys. Today, she had none.\n \nxXx\n \nShe wallowed a good bit, as was her prerogative she surmised. It’d been a truly terrible twenty-four hours and a good bit of pure, unadulterated self-loathing seemed just the cure. Before she knew it, the sun began to dip below the horizon, signaling the end of the day, and with a hazy sort of recollection, she realized that she’d not yet eaten. \n \nPulling herself up from the center of the bed where she’d curled in on herself for the afternoon, she found her limbs heavy and useless, weighing her down. Slipping on her boots, she stepped into the Floo, calling for Number Twelve Grimmauld Place as the green flames stole her away. \n \nxXx\n \nIf the looks on Harry and Theo’s faces were anything to go by, then she looked like absolute shite. \n \n“Fucking hell, Hermione.” Harry rushed to her side, wrapping an arm around her and guiding her to the sofa. “You look like—”\n \n“Yes, Harry.” She held up her palm, quieting him before he put his foot in his mouth. “I know.”\n \n“You okay, Granger?” The simple use of her surname brought forth a fresh round of humiliating tears and, after kicking off her boots, she curled her legs up under her and tucked herself into Harry’s side. \n \n“No.” \n \n“And you still can’t talk about it?” Harry pressed, brows tugging together. “I assume it has to do with one or two Malfoys.”\n \nShe tried, but her lips froze as tears welled in her eyes and she finally just collapsed further into his arms. \n \nThe boys shared a look; Harry pulled a soft throw over her legs and Theo disappeared into the kitchen, returning with a pint of chocolate ice cream and a glass of red wine, which he offered with a sad smile. \n \nAfter demolishing the pint of ice cream—and the rest of their bottle of wine—Hermione fell asleep, waking only slightly when Theo leaned down to kiss Harry goodnight, offering to bring her up to their guest room, which her friend declined. She drifted back off to the constant thrumming of Harry’s heartbeat and the soft roar of the fireplace.\n \nWhen she woke, it was nearly ten o’clock at night. Harry was still knocked out, head fallen back and lips parted as his snores filled the room. She chuckled and shook him gently awake; she should have known better, he woke in full Auror mode, wand trained on the door as he mashed his crooked glasses on his face.\n \n“Merlin, Harry, it’s just me.” A dry laugh fell from her lips as she shook her head. “I’m going to go…”\n \n“What? No. Stay! We’re happy to have you—”\n \n“No, I need to go. First, I’m starving and second, you should go up and be with Theo. I’ll be alright. Might take tomorrow off though. See you Tuesday?” \n \nHarry stared down at her, still wary as he blinked the sleep from his eyes, but he eventually nodded. He wrapped her in a hug before waving goodbye outside Grimmauld. \n \nAfter purchasing an unhealthy amount of Chinese takeaway, Hermione found a secluded corner and Apparated just down the street from her flat. The walk sobered her, cold air biting at her cheeks and she felt a sad sort of resignation settle into her bones. \n \nHermione Granger had never been one to believe in the art of Divination, but staring up at the inky black sky peppered with stars, she had to allow herself some small bit of hope that Draco was right, that they were inevitable. \n \nClimbing the rickety stairs, she fumbled for her wand, eyes finally lifting and catching on the blond leaning against her door. Every fibre of her being began to tremble as she made her way down the hall, the heavy thudding of her footsteps finally drawing his attention. \n \nStopping just a few paces in front of him, she sucked in a shaky breath and smiled tightly. “Malfoy?”\n \nThere was a definite air of annoyance about him, a pull to his brow and a hard edge in his silver eyes that Hermione was far too familiar with. “Granger. Got a minute?”\n \n“Sure,” she squeaked, suddenly far too aware of how she must look, wrinkly clothes and swollen lids. Trying her best to quell the shaking of her hand as she unlocked the door, she gestured for him to enter and then set the food on the counter, stomach-lurching as she thought of the sesame chicken buried inside. \n \n“Anyone else here?” Malfoy asked, voice tight as he stood tall and rigid near the door. \n \nClearing her throat, she pulled her curls up on the crown of her head, a vain attempt not to look such a fright, and shook her head. “Um, no. No, he went back this morning.” \n \n“I suppose that’s why you look you’ve been crying all day? Sad your boyfriend left?” His tone had that nasty jeering quality that she hated and her nose wrinkled at the sound of it. \n \nMassaging the throbbing in her temples—from wine too early in the day or Malfoy’s petulant little temper, she wasn’t sure—she closed her eyes and let out a long breath. “I’m sad for lots of reasons today, Malfoy. Honestly, I haven’t eaten and I’m exhausted, so maybe you could just drag me a bit later in the week?” \n \nThere was a long beat of silence and finally Malfoy stepped forward, pulling a folded letter from his robes and holding it up in the air. “Have you read this?”\n \nSlowly, she pulled up to look at the missive pinched between his fingers, his eyes scrutinizing her every move. “How would I know? I don’t know what it is.”\n \n“Did you tell  him  to write it?” There was an edge accusation in his tone and it made her bristle. \n \n “I don’t know what it is,” she repeated slowly, eyes narrowing. “But no, I didn’t tell anyone to write anything that I can recall. If it’s something for work, maybe I did last week? I don’t know—”\n \n“It’s from me. Well, me in twenty years, it would seem.” He took a few more pointed steps forward, dropping the folded parchment in front of her.  Her  parchment, the lovely heavyweight stock that she was so fond of it with a slight pearly sheen to it. Dragging her finger across the neat scrawl, her lips quirked in a sad smile. “G’on—read it.” \n \nStaring at it for a long moment, as if expecting it to somehow transform into a howler that Malfoy wrote just to scream at her some more, she finally found the nerve to pull it open. Tears slipped through her lashes as she read. \n \n\n Morning Malfoy, \n\n \n\n Bet you’re curious as to why you’re receiving a note in your own penmanship, eh mate? Well, by now you know it’s me—or well, you. I realize that I’ve made some errors in all this, but while I do (kind of) regret shagging your future wife, I also know the women you’ve been shagging in recent years, so I find that my sympathy is rather thin.  \n\n \n\n Currently, our witch is heartbroken. Not only is she losing me, but she’s quite certain she’s lost you as well. And for that, I simply can not stand. She is, for lack of a less kitschy term, your soulmate and losing her over something as ridiculous as this would be a grave error. \n\n \n Maybe not for you—at least not yet—but she’s everything, mate. She’s the sun and the moon and all the bleeding stars. She changes you and challenges you and   loves you   more unconditionally than we ever thought possible, or deserve, if I’m being honest. So you see, I had to come back to save her.   \n \n\n I was losing her, watching her wither and forget me. And you know all too well how stubborn we are, I couldn’t let that happen. \n\n \n\n When I arrived back here, I was on a mission. I just wanted to get this bleeding necklace and get back to my wife. But, as always, Hermione Granger happened. I forgot how much I adored her when she still hated every breath I took, although some days she still does. I forgot how she looked before life had thrown us some of the hard shite.  \n\n \n\n Listen, I know she’s meant to be yours, but once—she was mine. I was twenty-three and pining for the girl I was sure I’d ruined all my chances with. I was desperate for moments of her time, so much so that I was also doing Potter’s reports just so I’d get to sit with her for a pint, knowing I was in for a night of scowling and innocent little insults. I’d walk by her desk half a dozen times a day, hoping she’d look up from her work, but also, strangely okay if she didn’t, just so I could stare an extra minute. So you see, we are not so different you and I. \n\n \n\n There are things you inevitably won’t get to experience organically now, and for that I am sorry. But, even so, I hope you take her to the Chateau in France and let her crawl in your lap and snog you after a bit too much wine. The first time you make love to her, hell, try and show me up, kid. You’ve got a lot more flight time left in your broom than I do.  \n\n \n\n And learn from some of my mistakes—yeah? Take her on a proper honeymoon, even if she fights you, and Merlin, let the woman adopt however many cats she wants. (I assure you, the witch can hold a grudge for years to come, and she never stops finding new and creative ways of reminding you of all the cats she never got to take home.) And, when you find out you can’t have kids, don’t let her give up. The witch was meant to be a mother and she’d be a hell of a good one.  \n\n \n\n Lastly, don’t take it slow and don’t fuck this up, Malfoy. You’ve loved her far too long to let her go now. If you want to blame someone, blame me for being the charming son-of-a-bitch we’ve been all our lives and wanting to remember my wife as she was.  \n\n \n\n It’s the truly troublesome thing about time… the more you use of it, the more you want. And in any reality, any timeline, any universe: I want more time with Hermione Granger-Malfoy. Until no other options exist, I’ll keep fighting. I hope you do, too. She’s worth it.  \n\n \n \n\n P.S. And just in case your keen Slytherin eye is still unsure if it’s really you: first you’re a git, and second, that pot of Amortentia sixth year smelled like the fresh grass of a Quidditch pitch, new heavy parchment, and cinnamon. Take care.  \n\n \nSwallowing through an impossibly tight throat, Hermione raised her misty gaze to him. He was no longer scowling, his gray eyes almost pained as he stared back at her, his lips pulled down. \n \n“Granger, I can’t speak for any other me than the one I am today. However, I do know it’s fucking weird that you slept with me, but I haven’t slept with you. I think it’s insane that you accepted my invitation with intent to rob me of my family’s ancient magical artifacts, and I think you’re positively mental if you don’t realize that I’ve been mad over you for years.” \n \nThe world stopped, time ceasing to exist in the moment that followed. Her heart, which had been thudding uselessly all day, quickened, beating to a new, frantic rhythm. \n \n“So, yeah. I’m pretty fucking pissed, but if that letter says anything about who you and I are, and who we’re meant to be, then it seems we’ll probably be pissed at each other a fair amount. Which, I’m perfectly able to handle if you are.” \n \nA watery laugh burst past her lips and she covered her face with her hands, shaking her head in pure and utter disbelief, before dropping her palms back into her lap. “You’re insane if you want to be involved with me. I’m an absolute wreck and I’m really quite stubborn and almost always right—”\n \nWith unsurprising quickness, his hands caught her damp cheeks between his palms, in a moment so painstakingly similar to that morning. Staring up at him, she found fewer wrinkles, his hair more blond than silver, but the same gray eyes, sparkling with mischief and adoration. Tracking his thumbs over her cheekbones, he studied the curves of her face as if she were the only thing tethering him to the planet. “Want to give this thing between us a shot, Granger?”\n \nBefore she’d nodded once, his lips were on hers, kissing her slowly, tentatively, learning her still. His hand moved to cradle the back of her head, tugging her hard into him before suddenly letting her go. \n \nPanting and blinking back at him, she scoffed out an indignant little noise. “That’s it?” \n \nRolling his eyes, he shrugged from his cloak and tossed it over the counter, then began pulling small white containers from the brown paper bag. “You said you were hungry, you twit. I’m not going to ravish you on an empty stomach. Merlin’s sack, did you buy all this for yourself?” A mocking brow lifted high on his forehead and she swatted at him before stealing back her food. \n \n“None for you if you’re going to be cheeky, Malfoy.” Sticking out her tongue in the most immature way possible, she turned for her silverware drawer only to stutter to a stop as he rushed up behind her and wrapped his arms around her middle, a familiar chuckle tickling her curls. “So, there  will be ravishing?”\n \nHis teeth brushed against the thin skin of her neck as he grinned, a laugh rumbling through him. “ Oh.  There will be many,  many  ravishings. I’ve got to show that old sod up, don’t I?”\n \nBiting down on her lip, she turned in his arms, staring up at him with a challenging smirk. “That’ll be hard to do, Malfoy. You’ve learned quite a bit about what I like in the next twenty years, topping it might take a  lot  of practice.” \n \nMasking his features into a playful glower, he plucked the container of food from her hand, tossing it unceremoniously onto the counter. Quicker than she thought possible, he slung her over his shoulder and marched across her flat. \n \n“ Malfoy! ” Her giggles chased away all memories of her tears as he swatted at her bum and carried her towards the bedroom. \n \n“You’ve brought this upon yourself, witch. Your ravishing has been moved up to now since I’ve  so  much to learn. It seems it’d be best if we start right away.” \n \nFalling back on the duvet, laughing as Draco crawled over her and captured her mouth in a slow kiss, she reckoned that dinner had waited this long. Surely, it could wait a bit longer. \n \nxXx\n \nBlinking into the bright sunlight of early morning, she once again felt a familiar arm draped along her middle. Half-eaten cartons of Chinese takeaway still sat open on her end table, picked through after the first bout between the sheets and stowed there before Draco had disappeared between her thighs with a smug smirk. \n \nStirring behind her, she felt his palm close around her bare breast and his erection press against her bum. Throughout the night, they’d found each other again and again in the darkness, sleeping only in short spurts. While she was happy to report he had nothing to prove to anyone and very little to learn, he didn’t seem to feel the same way, desperate to flood her body with as many orgasms as possible before the sun rose. \n \nWiggling her bum against his lap, she rested back into him with a loud yawn. “It’s Monday,” she mused, chuckling as his lips trailed up the long column of her exposed throat. “I’d already decided to Floo in sick, but you’re going to be late.” \n \nShifting her onto her back, he quickly crawled on top of her, settling between her thighs. The tip of his cock kissed her already slick folds and her lips parted, sucking in a sharp breath as he inched inside her. “I was thinking of doing the same,” he managed gruffly, sighing in relief when he was buried fully inside her. “I’m far too busy to be bothered with work on a day like today.”\n \nWith a grin, she pulled his mouth to hers, tongues tangling and brushing as he pumped languidly inside her. He seemed to be in no rush at all, his hands slowly mapping out new explorations over every curve and dip in her body. \n \n“Do you think we’ll ever get tired of this? Even in twenty years?” he panted, rolling his hips with his cock still deep inside her and seating her on his lap. \n \nCurls fell in a thick canopy around them as his palm skimmed up her belly and he massaged her breast. Low pleasured cries slipped over her tongue as she rocked her hips back and forth in sporadic bursts, the first twinges of an orgasm flaring to life deep in her sex. The hand toying with her nipple slipped down, rubbing his thumb over her swollen clit until she toppled over the edge, nails cutting into the sinewy muscle of his chest. With a low grunt, he picked up a frantic pace, thrusting into her until he was spent, hips stilling as she fell in a heap on top of him. \n \n“To answer your question, no.” She grinned, drunk on euphoria and new love. “No, I don’t think we’ll ever get tired of this.” \n \nxXx\n \nAfter sending off their owls, stating they simply couldn’t make it in for work today, Hermione found herself seated on her counter, dressed in only his haphazardly buttoned oxford and a pair of knickers. Her face was pulled into a tight grimace as she watched him destroy  another  round of toast, but she held her tongue as he grumbled to himself, sure he’d figure it out  this  time. \n \n“There is something wrong with this contraption—” A scowl formed on his handsome features as he stood in only a pair of trousers that hung low on his hips. \n \nHe turned, two charred slices of toast on a plate, and she couldn’t help the laugh that bubbled forth. “If it’s any consolation, you figure it out eventually.” \n \n“Maybe I’ll just hire house elves, forego this entire ridiculous learning curve?” But upon her narrowed glare, he relented, dropping his offering into the sink and settling himself between her bare thighs. “Or I’ll just run out and grab some proper breakfast.” \n \n“That’s better.” She chuckled as his palms slid up her thighs, halting only when an angry rapping sounded at her door. \n \nSharing a curious look, Malfoy extricated himself. Sauntering towards the door, he peered through the peephole and barked out a sharp laugh. He didn’t wait for Hermione to even inquire who was there, wrenching the door open and propping his palm against its surface. \n \n“Hello, Unspeakable Sanders,” he drawled, his voice oozing charm. \n \n“Auror Malfoy,” she deadpanned, no longer awaiting an invitation as she marched into her flat. To Cecily’s credit, she seemed unfazed by finding the two of them half-dressed and surrounded by the smell of burnt toast on a Monday at half ten. “Miss Granger.” \n \nFor the first time in Hermione’s memory, Unspeakable Sanders looked dreadful, hair askew and clothes wrinkled.\n \n“Hello, Cecily. How was your weekend?” Hermione beamed, knowing full well that the woman was held in holding and interrogated after being escorted from Malfoy Manor. \n \nThere was an angry flare behind the Unspeakable’s eyes.  “Clearly,  not well  .  I’ve been detained and when I was released your awful friend informed that the situation from last week has resolved itself and you’ve been…  cleared  of all suspicion—though not by me.” \n \n“All’s well that ends well, I suppose.” Hermione shrugged, eyes flitting to the blond gripping his wand behind Cecily Sanders’ shoulder. \n \nRunning her tongue over her perfectly straight teeth, their intruder’s gaze tightened. “So it would seem. I’m here just to make sure you understand that any connection you’ve had with the DoM is now severed, you’re not to step foot into the department unless summoned, and you should remember that what happens within its walls remains confidential in nature.” \n \nThere was the lingering trace of a threat in her tone and Hermione’s hackles rose; hopping down from the counter, she crossed her arms tersely in front of her. “We’ll see about that, Miss Sanders. You see, my job is to do nothing  but  research. Research I do believe my dear friend has already begun in the Auror department. I would surely hate to uncover anything unsavory but I’m positive that is a non-issue altogether. Now, if you’ll excuse me, I should be getting back to bed.” \n \nWith a dismissive wave of her hand, the door swung open, shaking as it slammed against the wall. Growling unintelligibly under her breath, Cecily exited, shooting Draco a warning glare before the door promptly closed behind her. \n \n“I don’t think that’s the last we’ll see of her,” Draco mumbled, stowing his wand in his trousers. \n \nWith a long huff, she crossed the kitchen and wrapped her arms around his trim waist, smiling brightly back at him. “Unfortunately, neither do I, but her massive ego can wait another day. There was something about breakfast and bed and what was the last part—” \n \n“Ravishings.” \n \nA bright peal of laughter bubbled past her lips as his finger dug in her side and he nuzzled his stubble against her jaw. “Ah, yes. More of that.” \n \nPulling back, he stared at her in that way that stole the breath from her lungs, his fingers finding a stray curl and tucking it safely behind her ear. “More of everything.” \n \nxXx\n \n\nEPILOGUE\n\n \nxXx\n \n“My bride and I wanted to say a quick moment of thanks to our friends and family who gathered here today.” Draco beamed in the golden light of dusk, the sun just dipping below the rolling emerald hills of the Malfoy estate in southern France. Grinning down at his wife, he tugged her neatly into his side. She’d worn her curls wild, the way he liked, and her dress was elegant yet simple, created just for her. On the third finger of her left hand sat a beautiful, clear diamond surrounded by a cluster of rubies, and next to that, a thin wedding band, brand new and never worn before an hour ago.\n \n“My  wife  and I have not had a love story that most people would call classically romantic. Things started a little…  tumultuous.” Around them, their few dozen guests snickered as Hermione jabbed her elbow in her new husband’s ribs. “But, as much as I hate to give credit to anyone other than myself, I have to admit that a fair bit of fate was involved in this. I have always felt this draw to her, this inevitability that I couldn’t fight even if I’d wanted to. And trust me, I tried—hence the bullying and subsequently broken nose.” He paused, letting more laughter lilt through the air as he turned to stare at his new bride. “I tend to avoid sappy public declarations of love, but for you I will endeavor to do so at every opportunity—I love you, and I’ll spend all the rest of my days proving it to you.”\n \nCatching her lips in a kiss, their guests erupted into riotous applause and he swiftly pulled into her an intimate dance as the music swelled around them. From the moment her eyes had opened that morning, it had been the most magical day of her life, far surpassing the day she got her Hogwarts letter or even her wand. \n \nSomehow, through all the mess they’d trudged through already and would undoubtedly still fight, they were here—eyes filled with stars and love and promises for the future. \n \n“Sorry to interrupt,” Harry piped up, him and Theo saddling up next to them on the dance floor. \n \n“It’s okay if you want to twirl my wife around the dance floor, Potter, but as much as I love you Theo, I’m afraid I’ll have to decline a turn with you. You’re an awful dancer.” \n \nSwatting at her husband, she turned back to her friend with a curious brow. “What is it, Harry?”\n \n“A wedding present.” He grinned, reaching into his robes and pulling out an envelope with an official Ministry seal on it. “I would’ve given it to you even sooner but it was just finalized yesterday when she was safely locked into Azkaban. It seems, for now, you’re future is safe from the likes of former Unspeakable, Cecily Sanders.” \n \nWith an eagerness that surprised her, she ripped the envelope open, gaze falling on the angry moving mugshot of Cecily Sanders. “Wh-what happened?”\n \n“Malfoy—er,  older  Malfoy—was right. Cecily has been tampering with time for years. It took us a few months to complete our investigation and bring it before the Wizengamot, but it’s done now. She’s locked up for the foreseeable future.” \n \nTears welled in her eyes as she remembered the last six months and the paranoia that had accompanied them. She’d been constantly on the lookout for a well-aimed curse at her back or a brilliant flash of green that would end it all before she knew what happened. Barreling into her friend, she whispered her thanks, again and again, breaking away only when he began wheezing for air. \n \nDraco shook his hand and thanked him as well, before stealing his wife back into his arms. “Well, I suppose that’s that.” \n \nThe brightest grin she could ever remember wearing gleaned in the evening light and she laughed. “That’s that! Now what?”\n \nHis lips brushed against her temple and he pulled her closer into his chest. “Whatever we like, I suppose. We’ve got time.” \n \n “Time,” she repeated. “Sounds good to me.” \n \nxXx\n \n\nA/N: The biggest hugest loudest of thanks to you my lovely readers for following me on this time travel adventure. I had so much fun writing it and even more fun sharing it with you. \n\n \n\nIt wouldn’t be possible with my Alpha and Beta’s MCal and DreamsofDramione and I’ll cover them in kisses at first opportunity. \n\n \n\nWould love to know your thoughts and can’t wait to see you for another story hopefully soon! \n\n \n\nUntil next time, \n\n \n\nLK\n"
}