{
    "id": "21689197",
    "url": "https://archiveofourown.org/works/21689197?view_full_work=true",
    "author": [
        "quick_cat_tl"
    ],
    "title": "S5E18 - A Single Pale (Chinese) Rose - Full HD",
    "rating": "Not Rated",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "人渣反派自救系统 - 墨香铜臭 | The Scum Villain's Self-Saving System - Mòxiāng Tóngxiù"
    ],
    "relationships": [
        "Luo Binghe/Shen Yuan | Shen Qingqiu"
    ],
    "characters": [],
    "additional_tags": [
        "Fluff and Angst",
        "Dream Invasion",
        "Shen Yuan Reveal",
        "Binghe POV",
        "Binghe is very soft for his husbands trust me on this"
    ],
    "language": "English",
    "series": "",
    "published": "2019-12-06",
    "completed": null,
    "words": "5,225",
    "chapters": "1/1",
    "comments": "188",
    "kudos": "8,204",
    "bookmarks": "1,561",
    "hits": "44,028",
    "summary": "<p>Shizun had jumped and gotten hit by a spell, it seemed; he had fallen right there, to Binghe’s arms like a maiden. Binghe researched the spell used, what it did, how to counter it; it ended up being a simple “trapped in a dream” kind of spell, nothing worrisome, nothing lethal, so Binghe prepared himself to save his dear Shizun. </p>\n<p>. . .</p>\n<p>Luo Binghe will have to go through his husband's mind, memories and feelings. Who knows what he will find out?!</p>",
    "notes": "<p>have y'all seen steven universe? if you have, this is just a single pale rose but bingqiu, and if you haven't, I highly recommend it! <br>thank you for clicking, hope you enjoy!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>My twitter is @Anielka-Ela hmu!! <br>Thank you for reading!!</p>",
    "text": "The worst part of all the attacks that are constantly upon Luo Binghe, is how Shizun always protects him, even to this day. Ever since childhood, Shizun was always Binghe’s defense against all hurt and pain, be it emotional and physical.\nWhen he was younger, Binghe couldn’t fathom anything better than his beloved teacher proving his love like that, but now, as an adult and as a husband, the idea of Shizun being hurt because of his own ineptitude was… Agonizing, to say the least.\nShizun shouldn’t have to be hurt in his stead.\nThis last one was a low-level demon who thought himself above the rules established by Lord Luo Binghe; he was dealt with accordingly, but that still didn’t wake up Shizun. He remained gracefully, peacefully asleep, to everyone’s horror.\nShizun had jumped and gotten hit by a spell, it seemed; he had fallen right there, to Binghe’s arms like a maiden. Binghe researched the spell used, what it did, how to counter it; it ended up being a simple “trapped in a dream” kind of spell, nothing worrisome, nothing lethal, so Binghe prepared himself to save his dear Shizun.\nEasier said than done; Binghe would have to enter Shizun’s mind, go to the farthest point and drag him back to a conscious state, he’d see much more than a regular dream would allow him, and all this without Shizun’s clear consent, a terrible violation of Shizun’s priced privacy. All things considered, Binghe was the most appropriate person for the job, who better to see your deepest secrets that your husband? But Shizun rarely spoke of the past, rarely spoke of himself. Binghe was curious and that made it all worse; he wanted to see, wanted to know, and now he had chance and excuse.\nEven so, he had to do it: he lay down beside Shen Qingqiu and let himself be placed in the right place to start.\n \n(LEVEL 1)\n \nBinghe opened his eyes and found himself inside their shared house, the sound of the wind blowing through the bamboo as it always was. It was all pretty and neat and functional, as Shizun’s mind would obviously be.\nAt the desk, there was Shizun, working, but he raised his head when he saw him.\n“Binghe, there you are! This teacher had been wondering where you’d run off to.”\n“This disciple… Is here now, shizun.” He said vaguely. He was sure this wasn’t the right Shizun but didn’t know how to ask how to get to the next level. In someone else’s mind, he might have just barged in and demanded, but this was Shizun, so he couldn’t, wouldn’t do something so impolite.\n“That’s very good, yes, Binghe is here, so all will be well now. All will be fixed; such is the power of the protagonist.” The shizun sitting at the desk covered his face with his fan but his eyes were smiling.\n“The protagonist, Shizun?” Shizun ignored his question.\n“Yes, yes, my little white lotus, but you need to keep moving. The door is right there.” He pointed with the now-closed fan; Binghe bowed in thanks and walked through a door that had mysteriously appeared, he smiled to himself: “little white lotus”, was that how shizun thought of him?\n \n(LEVEL 2)\n \nThis particular shizun was doing something completely bizarre: he was yelling at a mirror.\nWell, not a mirror, but a wall. Or a window? Binghe wasn’t very sure what it was, but it was shiny and noisy and rude.\n“What do you mean I can’t say anything about my sister?!”\n“If you do so, 50 points will be added to the “Healthy Relationship” chart, but the protagonist will lose 120 coolness points.”\n“That difference is insane! What about my parents? Can’t I mention them?”\n“If you do so, 50 points will be added to the “Healthy Relationship” chart, but the protagonist will lose 160 coolness points.”\n“Why is that even more, oh my god!” Shizun threw his hands in the air as he spoke up. “You overpriced costumer service wanna-be, I hate you!”\n\nHate? \n\n“We’re sorry to hear that, do you want to search for possible updates?”\n“No!” Shizun threw his hands over the window as if to quiet it. “No, no, no! We’re fine like this! We’re good!” As he said so, he turned around and saw his disciple. “Ah, Binghe, I wasn’t expecting you here…”\n“What is that?” He pointed with a finger.\n“I cannot tell you,” Shizun said quickly.\n“Why not?”\n“Any mention of the system will result in immediate termination of the contract.” The window chimed in. Now closer, Binghe could see that, as it spoke, words appeared on it.\n“Yes, that.” Shizun sighed as he brought fingers to his nose bridge. “’ Immediate termination of the contract’,” he mocked the thing’s voice. “Had I less to lose, I would not doubt any longer, but now, after the wedding, and, well, the relationship, and we’re doing so well…” He, to Binghe’s surprise, grabbed a lock of his precious hair and started twirling it nervously; it was one of the most emotional responses he’d ever elicited in his Shizun (outside of their bed, of course, but those weren’t as new as this one). “Binghe,” Shizun spoke up suddenly, bringing his attention back. “There are so many things I want to tell you, about myself, about my life, why I did and do certain things, but I cannot. It is not allowed. How I wished…” He trailed off.\nBinghe stared at this Shizun. He spoke less formally and with no fears, he was much more straightforward than what Binghe was used to. He knew this was, in some part, his own Shizun, and couldn’t help but wonder, how would life be if his Shizun was like this all the time? How much closer would they be?\nShizun brought a palm to Binghe’s cheek and rubbed gently with his thumb.\n“But even in these conditions, Binghe, never doubt my feelings for you. How deeply I care, how strong is my love, all these things will not change.”\nBinghe was struck by the intensity behind those words, feeling some tears pool around his eyes. Hearing his beloved husband speak so freely, so sweetly… This spell was really a blessing in disguise.\n“Ah, there you go again…” Shizun smiled and pinched his cheek, earning a chuckle from his disciple. “Cry, cry, cry, you’re always crying; sometimes I wonder how you never dehydrate.”\n“Plus 20 coolness points for the protagonist.” The window (the System?) informed; Shizun rolled his eyes, the expression looking foreign in his beautiful face.\n“I hate that thing; it gives me such headaches… Don’t worry, Binghe, I’ll deal with this, you carry on. Next door’s over there.” He pointed to a side, where another door had just appeared.\n“Many thanks to Shizun.”\n“Aiya, how terrible, after all we’ve been through, won’t you call me husband? I really do like it.” His Shizun cocked his head with a mischievous grin.\n“Anything husband wants.” Binghe smiled back as Shen Qingqiu returned to his fight with the window.\n \n(LEVEL 3)\n \n Binghe found himself in a burnt down Qing Jing Peak, their little bamboo house in ruins, the grass brittle and dry. Up ahead he could see Shizun and…\nHimself.\nShizun and Luo Binghe in a place that he’d never seen before, but in his nightmares.\nThe voice from the system that bullied Shizun in the former level spoke again, startling himself and Shen Qingqiu.\n“Greetings. While the penalty is in progress, the system’s other functions cannot be accessed. Hoping for your understanding and wishing you the best of luck.”\n\nPunishment? Punishment for what?\n\nShizun cried out for him. Or, the other him.\n“Luo Binghe!” It warmed Binghe’s heart that, in the face of danger, his husband called out for him. The other one of himself called back.\n“Shen Qingqiu?”\nThat voice… Why was it so familiar? Despite being his, there were differences, and he was sure he’d heard it before…\nWhile he thought about it, the two people far from him started speaking. Their voices were too low for Binghe to hear, so he walked closer.\nHe got near enough to hear his other self call:\n“Come here.” Shizun did the opposite; he turned around and raced away. It reminded Binghe of the time when Shizun would run when he’d just returned. He could also remember how easily he could catch up with Shizun.\n“Why are you running?” The other Binghe asked gently, as he caught Shizun. “I keep feeling as if… it seems like there’s something different about you. You’re really Shen Qingqiu?”\nThe questions threw Binghe off his rhythm. Why shouldn’t he be? Was there any other Shizun?\nHis blood seemed to freeze as he remembered their meeting with the murderous, trashy version of himself.\nHe could see, still clear as day, his husband’s terror, how he had shaken under the other’s hands. He could hear the other one’s voice as he mocked Shizun for liking pain.\nPain… From the last time they met?\nCould this be…\nIn that instant, the other Luo Binghe took his Shizun’s hand a ripped his arm off.\nShizun didn’t scream but Binghe did.\n“Shizun!” He ran towards them, and as he did, he could hear his Shizun’s scared gasps.\n“Don’t, don’t…” He cried softly as the other Luo Binghe spoke again.\n“It’s not as if this is my first time doing something like this. How is Shizun still so unaccustomed to it? Then, let’s do it a few more times until you slowly get used to it. How about that?”\nHe ripped off Shizun’s leg too.\nThis time, Shizun did scream, and the sound was the most horrifying thing he had ever heard.\nThe System’s cold, lifeless voice came from above them.\n“The punishment has finished.”\nThe scene seemed to re-set itself: Shizun was standing, unharmed.\n“Luo Binghe!” He cried again, just like he had done just a few moments before. Binghe resumed his running. The scene seemed to go faster this time, or perhaps that was just Binghe’s feeling of impotence. That bastard was hurting Shizun!\nHe got just in time to see the other Binghe rip Shizun’s arm again.\nCloser now, he could hear the confused gasp his Shizun gave after losing his limb. Binghe took the opportunity of the bastard’s distraction to steal Xin Mo from his waist and bury it in his chest in one fluid movement.\nThe other Binghe went down easy, much easier than Binghe would have thought. He didn’t even move.\nHe kneeled beside Shizun as he gasped and mewled in pain.\n“Don’t, don’t…” He mumbled again, but this time he wasn’t interrupted, and he could hear Shizun’s full thoughts. “Don’t do this with his face…”\nHow was it that Shizun didn’t ask for the pain to stop, but for the aggressor to not be Luo Binghe? \n“Shizun,” he called as softly as he could. “It’s alright, he’s stopped, he will not hurt you anymore.”\nShizun’s eyes went to him, big and dark. His cheeks were drenched with tears and flushed red. He looked like this when Binghe took his time in their lovemaking too, but there was nothing alluring about it at the moment; Binghe could only see fear and pain in him.\n“B-Binghe?”\nBinghe poured energy into him, to slow the blood flow and lessen the pain. Gods, he couldn’t even begin to think the amount of pain Shizun must be in…\n“Yes, Shizun, your Binghe is here.”\n“Binghe…” Shizun whimpered again. “Please- Please don’t-“\n“The punishment has finished.” The System said, and the scene re-set again. Binghe was still on the floor and Shizun was on his feet again, calling out to his aggressor. He was on his way to wreck the other Luo Binghe, destroy him completely as many times as he could, before catching sight of a door on his right.\nRight… This was not real.\nIt was a memory or a nightmare, but there was nothing Binghe could realistically do to stop it. He steeled his nerves; he had to keep moving and finish what he’d started; to protect Shizun he had to…\nHad to…\nIgnore the screams of agony of his most important person.\n“The punishment has finished.”\nThe scene reset itself and Binghe walked through the door.\nHe’d ask about this later.\n \n(LEVEL 4)\n \nIf the last level had been bad, this was officially the worst.\nIt was all exactly as he remembered: the scent of blood and heated rock, the breeze blowing away some of the fire sparks that might hurt his skin, the darkness of the scene…\nThe last time he’d been here he was but a child, and Shizun threw him into the Abyss.\nHe would have remained frozen in his spot had it not been, again, for Shizun.\nHe was kneeling at the very edge as if looking down, were he not covering his face with his hands. He was shaking, his whole body trembling from sobs.\nSobs?\n“Shizun?” He walked his way, mindful of the cliff. He really didn’t want to get close but Shizun was right there. He had to get him away. “Shizun…”\nHe crouched next to him, keeping his body leveled and turned from the Abyss. He put a hand on Shizun’s back and it shook with his teacher’s movement. The cries that left him were heart-wrenching. They came from deep and left him breathless, gasping painfully. Binghe rubbed softly.\n“Shizun, the edge…”\nShizun raised his head and looked at him, not even bothering to clean his face. It was such a different picture to the usual elegant, aloof master, but it wasn’t one Binghe wanted to keep seeing. He curled his arm protectively along Shizun’s torso and pulled to take him away from the precipice.\nShizun squirmed in his arms.\n“No, no,” he clawed in the direction of the dangerous edge, his voice rough with pain. “No, he’s in there, I have to-“\nBinghe froze again.\n‘He?’\nDid he mean Binghe?\n“I should have- I couldn’t-“ Shizun mumbled, still fighting. Binghe tightened his grip. Even as an illusion, it’d do them no good if Shizun fell down too.\n“Shizun, it’s dangerous, let’s-“ get away from the edge, was what Binghe would say but it only furthered Shizun’s panic.\n“I know! I know! It’s so dangerous! There’s Ghost-Headed Spiders and Hell Dogs, and, and-“ He was panting again, his words becoming dangerously breathless.\n“Alright, Shizun, alright, we will not move, breathe…” He released his arms a little bit, but Shizun wasn’t listening, he just kept talking.\n“How could I? He’s- He’s just a kid! I just- I threw him down there!”\n“Shizun,” Binghe rubbed between his shoulder blades worryingly. “Shizun, breathe. He will be fine, he will survive.”\nHe had, after all. He had lived through the worst that hellish place had to offer, fought his way out of a number of situations, learned so much in so little time, moved only by the desire to see Shizun again.  \nIf any version of Luo Binghe was down there, he’d definitely make it back to their master.\n“I know he will survive!” Shizun yelled in his ear, startling Binghe again. He knew? “It still doesn’t make it right! He didn’t deserve it! He’s just a kid! When he returns-“ He stilled suddenly. Binghe was extremely worried right now. Being an illusion, shouldn’t mind-Shizun be more level headed? Less worried about real events?\n“He’ll kill me,” Shizun mumbled.\n“What? Who?”\n“Binghe, when he returns, oh god,” Shizun answered, and Binghe blinked. What? “Oh god, he’ll kill me, I ruined it, I ruined it all, god, no, please, no…”\n“Shizun-“  \nKill him? Why would-\nBinghe thought of the other Luo Binghe ripping Shizun’s extremities, and Shizun running away from him when he first had returned.\nIt seemed his fears weren’t entirely unfounded.\n“Binghe, please, I’m sorry, I’m sorry, I shouldn’t have- I should- oh, god…” He resumed his weeping with fat tears, digging his nails into his forehead as he covered his face. Tiny ‘I’m sorry’s left his lips in small gasps.\nBinghe couldn’t do anything more than stay and try to process what he’d just heard.\nThis place was memories and thoughts mixed together, this scene was probably not what happened, there was no chance of him breaking down like that, ever, but what Shizun felt or feels regarding… the incident. \nThere was… a lot of guilt. Binghe thought he knew his master, his husband, but apparently, his knowledge was barely the tip of the iceberg.\nHe heard a ping, like a little bell, above them.\nThe System-Window was back.\n“Congratulations! You have successfully completed the important mission ‘Beginning of the Legend: Luo Binghe’s Fall and Rebirth.’ Rewarding Protagonist’s Coolness level 10,000.”\nBinghe went through the words methodically, slowly; the System had wanted Binghe to fall? No, how to explain it? The system-\n“But also due to special circumstances, there is a newly calculated score: Luo Binghe’s Heartbreak level. Because the heartbreak value is too high, the protagonist's coolness is cleared to 0. Please continue your efforts!”\n‘Your efforts,’ it said and he understood.\nThe System-spirit had made Shen Qingqiu throw him. \nHis husband was a kind, caring person, who was controlled by a System to stop him from speaking his mind and revealing more than a handful of things.\nWas that why Shizun always seemed so vague? He could recall every single time Shizun had said something he couldn’t quite understand, simply saving it in his heart; had that been Shen Qingqiu’s way of telling him things?\nHe could picture Shen Qingqiu’s eyes before he fell into the Abyss: colder than he’d ever seen them, fine jade sharp enough to cut through glass, or through his heart.\nHe remembered words, too:\n\n“This master doesn’t want to kill you.” \n\nHe hadn’t fully believed them, then. Shizun had seemed so cruel; but hadn’t he been the cruel one?\nHis question of Shizun’s intentions, at the time, made sense to him, but in retrospective, it would be like an emotional string being pulled too harshly. His Shizun, being forced to go against his own disciple, one he favored (Binghe wasn’t stupid, he knew his years with Shizun were especially good), it must have broken his heart.\nShizun’s voice brought him from his train of thought.\n“Go scram,” he garbled along with some tears. “Fucker System, fucking scram!” He raised his head to scream angrily at the window. “You were supposed to help him!”\nThe System-spirit was supposed to? Well, it didn’t do a very good job, Binghe had-\nHe had-\nHe had been in terrible danger, again and again, and he had come up safe and sound.\nHadn’t Shizun said it too? When he promised to protect him? Nothing could harm Luo Binghe. Ever.\nIt was the System’s doing then, but Shizun had to earn it with those points, whatever they were. And he had won them and lost them with such little care from the spirit…\nShizun was always doing whatever he could do for him… He just never knew how much.\n“It’s not fair,” Shizun muttered, sounding far from his usual, royal self. His tone was childish, pouty even. “It’s not fair, I worked so hard to- It’s not- You can’t-“ He whined.\nBinghe felt love for Shizun invade him. Poor Shizun, trying so hard to help, it was always like this. The world was not a terribly kind place; you could only hope to make it better.\nMake it better… Oh, Binghe should keep moving too.\nHe still wasn’t at the bottom of Shizun’s mind, he could feel there was more. But where was the door?\nThe Abyss made a rumbling noise and Binghe shivered. He had loathed the fall….\nOh. Oh.\nHe’d have to jump again.\nFalling as a child, he was confused and scared. He had not known many things he now did. Now he had explanations, ways to defend himself, and the love of a husband.\nHis husband, his Shizun, who was willing to go ahead and love him, to follow the instruction of a cruel spirit to protect him, who managed to overcome his own fear when Binghe couldn’t even see the truth in front of him.\nHe wanted to cry, hold his husband close and tell him again and again ‘Shizun, this disciple was wrong, this husband was wrong!’\nHe pressed a kiss to Shen Qingqiu’s temple and let go of him in favor of leaning into the Abyss. It didn’t look like such a big fall from here… He probably could even land on his feet.\nA pair of hands grabbed his tunic, and he turned his head.\n“Binghe?” Shizun was holding on to him, big eyes still wet.\n“Shizun, this disciple needs to finish some errands.”\n“Don’t jump.” Shizun ignored him. “Don’t do it.”\nOh, this was going to hurt.\n“This one apologizes, but this Luo Binghe needs to finish the errand.” He still needed to save Shizun. And then he’d pamper his dear, dear husband in every way he could.\nBinghe rid himself of Shizun’s hands as he smiled at him. ‘All will be well’, he wanted to say.  It didn’t seem Shizun thought so; he was mumbling as he tried to reach back to him.\n“Binghe, no, no, listen to me, don’t jump, don’t go, please, do not-“\n“I’ll see you soon, Shizun.”\nBinghe jumped.\nThe air around him didn’t hide Shizun’s raw scream of his name.\n \n(LEVEL FIVE)\n \nHe fell into his very own Qing Jing Peak, the sun shining, the sweet smell of the summer breeze filled his senses. It was like a painting of his childhood, a dream…\nHe could hear someone talking inside of Shizun’s house! Time to go inside, then.\nHe walked leisurely, he was pretty deep into Shizun’s mind, he could tell. The jump had been an extraordinary feat, he had saved lots of time.\nHe was glad he’d done it.\nHe knocked on the door.\n“Shizun?” No one answered. Guess he’d let himself inside… “Shizun, I’m coming in…”\nHe opened to see his Shizun standing in the middle of the living room, walking around like he did when he was stressed and he allowed himself to express it.\n“Fuck, fuck, fuck, fuck….” He was mumbling. Binghe stared wide-eyed; he’d never heard Shizun curse so openly… Of course, he’d made Shizun gasp some during the nights they lay together, but this was… Interesting! And new!\nIt was incredibly funny to him how much Shizun cursed inside his mind. He’d love to convince him of doing so on the outside too…\n“Fuuuuck me, fuck thiiiis…” Shizun groaned and Binghe squealed. Shizun turned to him and he held his breath, biting his lip to hide his smile.\n“What the actual fuck is wrong with these people?” Shizun asked, his voice distraught.\n“Shizun?” He cocked his head.\n“Can you believe this absolute bastard? That Shen QingQiu, that-! Can you believe the amount of child and domestic abuse they allow? My god, don’t even get me started with the human rights violations! If there were someone who’d only- God! That little sheep! No wonder he- But by God, that man is a monster!” He shook his finger at Binghe.\n“That man…”\n“He’s not even worth calling a man! He’s an animal, he’s a-“ he snapped his fingers until he found a word he liked and snarled it. “A beast.” Binghe suddenly remembered his childhood, when Shizun still hadn’t liked him very much, how he used to be called ‘little beast’.\n“Yes,” Shizun kept talking, mostly to himself it seemed. “Yes, that beast, that horrible, horrible teacher, at least he’s gone now!”\n“Shen QingQiu is gone?”\n“And good riddance to him! But don’t you worry, I got this! It can’t be that hard, can it? It’s just transmigration, totally normal, super fucking okay. I just have to… to…” He whined. “Change fate.”\nHe sat down slowly and Binghe followed suit.\n“Ugh, can you believe this? I just got myself in soooo much trouble, fuuuuuck.” Shizun leaned down to press his forehead against the table but perked up suddenly. “At least I’m healthy now!”\n“Shizun… wasn’t healthy?” To Binghe’s surprise, Shizun slapped his arm playfully.\n“Who’s your Shizun? I’m like, a year older than you, fuck off!” He laughed and Binghe was as charmed as he was confused. “Though… I guess I am Shizun now… Luo Binghe’s Shizun… The good Shizun, of course! Oh, I‘m so excited,” he gushed at Binghe, giggling. “I bet he’s the fucking cutest shit. He’s gotta be, right?”\n“I don’t think so…” Binghe had never thought himself a cute kid. He looked unruly and half-starved. Only after spending years in Shizun’s care had he looked half decent.\n“Oh, don’t you dare bad-mouth my little white sheep.” Shizun threatened with a finger. “Luo Binghe is yet to become a Black Wolf Demon King of Terror and Seduction, and I will not stand- No, this Shen Yuan will not stand for such mistreatment where it is not yet due!”  \n“Black… what?”\n“And hopefully never! Can you imagine a less psychotic Luo Binghe?” Shizun, Shen Yuan, not-Shen-QingQiu, leaned in smiling. “A Binghe who doesn’t want to murder everyone? One who can choose and love a single woman, or at least reduce his three-hundred-beauties harem to double digits? I honestly can’t believe I get to fix all of Airplane Shooting Towards the Sky’s mistakes! Take that, shitty author!” He punched the air victoriously and cackled, while Binghe had to take a moment to go through all he had just heard.\n“Shen Yuan?” He called and the man looked at him.\n“Yeah?”\n“You are Shen QinQiu?”\n“From today on, yes. No more Shen Yuan. It’s over, it’s done, finito. I am Shizun, now. And I’ll do my job. I promise you.” He looked into Binghe’s eyes so earnestly, so sweetly. Binghe couldn’t help but melt like butter on a pan. “I will take care of Binghe.”\n“I will trust Shizun, then.” Binghe smiled back, touched by this man’s, his husband’s love. All these discoveries… They were driving him crazy; he’d need more than a moment of quiet to work through all he’d learned, but he was happy.\n“Oh, is that door for you?” The new Shen QinQiu asked, eyeing behind Binghe. He turned and indeed, his next-door was there.\n“Mn. I’ll take my leave.” As Binghe closed the door behind him, he heard Yue Qing Yuan’s voice, worriedly asking his “dear Xiao Jiu” how he felt.\nIf only he knew.\n \n(LEVEL SIX)\n \nThis was a far as he could be, Binghe felt it as soon as he entered. The most stable place, and the strangest. This was as back as he would see, memories-wise.\nThis was a white room that beeped. The smell was clean but it burned his nose, and the noise was just as harsh on his ears. For a moment, he feared it was the System-Spirit again, but the boxes around the place seemed different from the floating window. They looked heavy and dense, and they were connected like vines to a figure sitting up in a bed.\nBinghe stared at him; he was a young man he had never seen, lithe and frail-looking, incredibly pale with big shadows under his eyes. His short hair complemented the unhealthy look; Binghe felt uncomfortable at the thought of being connected to the boxes like he was.\nHe walked towards him, wondering who this person was to his Shizun.\n“Forgive this one but, who are you?” The young man seemed amused by the question.\n“Shen Yuan,” the man stared up at him, having to tilt his head back quite a bit.\n“Shen Yuan.” Like… Shizun’s last memory. The other one had said he was unhealthy and this… This certainly was it. “You’re Luo Binghe.” He carried on. “Why are you here?”\n“Shizun was hit by a spell. I need to pull him back.”\n“Mn, makes sense.” He nodded, seriously. “Binghe is very nice to do this.”\n“Shizun is this one’s husband. There is nothing this Luo Binghe will not do for him.”\n“I really lucked out.” Shen Yuan sighed, then coughed. Binghe could hear his lungs trashing and his throat constricting; it was a horrible sound that got him in alert. Shen Yuan waved his tenseness away. “I’m fine, I’m fine, just- This happens a lot.” He breathed a couple of times. “I suppose Binghe has questions.”\nBinghe nodded.\n“Shen Yuan is this person.” He waved at him and the bed-ridden man nodded. “And Shen Yuan is Shen QingQiu, my Shizun, and husband.” Another nod. “How?”\n“I am- I have never been very healthy, not like you cultivators with your qi and your flying swords and shit.” He began. “So, I read, and when I died, I ended up taking Shen QingQiu’s body.”\n“Shen Yuan died?”\n“Yeah.” He propped his head. “Nasty business, minus two out of ten, would not recommend. And I have experience with that.”\n“You… are Shizun. You have those memories.”\n“Duh,” the man smirked. “I am the basest part of him. Have you ever read psychology?”\n“I- This one does not-“\n“Oh, right, xianxia and all that stuff. I think you’d like it. Anyway, I’m at the deepest part of his subconscious, so like, I guess you could say I’m the real him, somehow. The one who knows everything.” As he said the last word, he moved his fingers like doing magic tricks. “I think you can wake him, us, now. You’ve rattled enough chains, we’re all up.”\n“You’re all up,” Binghe repeated, unsure.\n“Yep. We were all asleep, and you’ve come to wake us up. Now that you’ve done it, the mission is over, you know how it is. You’ve finished the nerve-wracking mission, yay!” He said nasally, mocking someone’s voice. “Congratulations, congratulations, congratulations! Important things must be said three times!”\n“That’s the System-spirit.”\n“You can just call it ‘the System’, or absolute-jerk-bastard-IT-guy’s-nightmare. We’ll find that super funny.”\n“Alright, then. I’ll take my leave?”\n“Sure.” Binghe stared at the figure dismissing him. He could barely believe his eyes. This was Shizun, in some way. How painful…\n“Oi, I can sense your guilt from here. It’s not your fault, it’s no one’s fault. Just… Go back, okay? He’ll be waking up soon, and we’d rather you be there. We always like it when you’re there.”\nBinghe nodded softly, feeling tears pool in his eyes.\n“Aiyah, crying again…” Shen Yuan, Shizun, sighed with a smile. “Whatever will I do with you?”\nBinghe smiled at him as the dream fell to dust around him.\n \n(LEVEL ZERO)\n \nBinghe opened his eyes slowly, feeling Shizun next to him on their bed. Back at the bamboo house, with the sweet sound of the wind through the leaves.\nShizun groaned softly, finally awoken.\n“Binghe?” He called.\n“Shizun,” Binghe called back, his voice thick with feeling.\n“What happened?” Shizun spoke through a yawn, forgetful of his mysterious persona when sleep still clung to him. “I had the strangest dream… Are you crying?”\nBinghe sniffled as an answer. Shen Yuan, Shen QingQiu, Shizun, was back.\nHusband turned to him in a second, raising his hand to Binghe’s cheek to wipe away the tears.\n“Aiyah,” he said softly. “Whatever will I do with you?”\nBinghe smiled as he leaned in and hid his face in Shizun’s chest.  "
}