{
    "id": "21828028",
    "url": "https://archiveofourown.org/works/21828028?view_full_work=true",
    "author": [
        "itsmylifekay"
    ],
    "title": "it’s okay",
    "rating": "Not Rated",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "9-1-1 (TV)"
    ],
    "relationships": [
        "Evan \"Buck\" Buckley/Eddie Diaz"
    ],
    "characters": [
        "Evan \"Buck\" Buckley",
        "Eddie Diaz (9-1-1)",
        "Bobby Nash",
        "Howie \"Chimney\" Han",
        "Henrietta \"Hen\" Wilson",
        "Christopher Diaz (9-1-1)"
    ],
    "additional_tags": [
        "Angst",
        "Hurt/Comfort",
        "Buck needs a hug",
        "Injury",
        "Dissociation"
    ],
    "language": "English",
    "series": "",
    "published": "2019-12-17",
    "completed": null,
    "words": "11,087",
    "chapters": "1/1",
    "comments": "157",
    "kudos": "8,202",
    "bookmarks": "1,475",
    "hits": "85,184",
    "summary": "<p>Finally back with the team, Buck isn’t going to let anything tear him away again. He has to prove his place, his part in the family, even if that means smiling through the pain.</p>\n<p>Or, Buck gets hurt on a call and doesn’t tell anyone.</p>",
    "notes": "<p>All of this Christmas sugar in the tag, have some angst to wash it down.</p>",
    "text": "The mirror is just starting to fog, steam creeping out from above the shower door and sticking to its surface, slowly obscuring the dull eyes that stare back at him. Buck pulls in a slow breath, watches as his ribs expand, tug at the stitches there and send little sparks of pain shooting through him. His skin is a burst of color—midnight purples, hazy violets, all smeared together like a giant black hole right there on his side. It’s beautiful, in the way that pain sometimes is.\nWhen the hot water hits his stitches, he can’t help the sharp hiss that escapes him, stares up at the ceiling and lets the ache crash over him like a wave, lets it pull him under so he can open his eyes in the cool, sharp darkness of what’s underneath. He sucks in another breath and imagines the burn of saltwater in his lungs. Imagines thousands of pounds bearing down on him, leg screaming, body pinned.\nTrapped.\nHe slams an open palm against the shower wall, lets the cool tile ground him as his chest heaves. C’mon, Buckley. Get it together. He shakes his head, feels water drip down his face, across his lips, and reaches for the soap because there’s nothing else he can do. He has to keep it together. He can’t fall apart. Not again. He’s already run out of second chances.\nSo he showers. He forces himself through the motions and the pain then steps out into a foggy bathroom and looks back in the mirror. He can hardly see himself anymore and, honestly, he doesn’t want to, looks quickly away from his blurry reflection, throws on a patch of gauze and some comfortable clothes and crawls into bed. The night stretches long and unending before him.\n--\n(Two Days Earlier- Wednesday)\n“Buck, Eddie, get inside and see if you can find anyone. We’ve got at least two people unaccounted for on the third floor.”\nBuck doesn’t need to be told twice, hauls himself up onto the ladder and begins his ascent to the third story window they’ve deemed most promising, adrenaline thrumming through his veins. It’s his first major fire since being let back on the team and it feels like a milestone, feels like he’s finally made it, like he’s got a chance to prove to himself and everyone else what he’s been saying all along—that he’s ready. That he can do this.\nHe smashes through the window and clears away all the glass, feels Eddie like a solid, unmoving presence at his back as he climbs into the building and stares out into the growing flames and billowing smoke. They’ve got another team working to vent the roof and most of the building is already evacuated, the clock ticking as the walls seem to groan around them, fire licking at the ceiling overhead.\n“Let’s start checking the rooms,” Eddie shouts over the roar of the fire.\nBuck nods and they start forward. They kick down doors and shout into heat and smoke and at first they get no response, just the sound of the fire and their own breaths echoed back in their masks. In the third office, they find a body. Eddie crouches to check for pulse but shakes his head, gives one last look at what once had been a vibrant life then pushes on. There might be someone still clinging to hope, might still be someone they can save.\nThey make it all the way around the floor and find nothing else. There’s sweat dripping down his face, into his eyes, and the heat is almost unbearable even through his turnout gear. He knows they need to leave soon, and he nods to Eddie who grabs at his radio, asks Bobby if they’ve got any more news on survivors.\nThere’s still one unaccounted for, but the fire is getting too dangerous to have responders in the building.\n“I want you guys out of there. We might be able to try again once the fire’s under control.”\nBuck clenches his jaw. If a survivor was hiding somewhere now, they wouldn’t be alive by the time they came back later. There’s one place left that they haven’t tried and he knows it’s a long shot, knows that Bobby had declared it off limits and too dangerous for their initial search.\nBut he goes anyway, ignores Eddie’s shout behind him and pushes on, slams through the door to the staircase and shouts up into the spiraling cement.\n“Hello! Can anyone hear me?”\nThere’s only the roaring and whistling of the fire behind and below him and Buck swallows, feels his heart drop.\nThen a shoe lands at his feet. A light pink high heel that definitely hadn’t been there before.\n“Hello!” he shouts.\nHe runs up the first flight of stairs, ears straining for an answer. He hears Eddie’s boots not far behind and almost lets out a whoop of excitement when he spots her, a middle aged woman slumped against the stairs, staring up at them with wide, panicked eyes.\n“Hello ma’am,” he says, trying to sound as calm as possible. “We’re with LAFD and we’re going to get you out of here.”\nBuck crouches beside her while Eddie radios Bobby, only has a moment to register Bobby’s frantic shout of Get out of there immediately before he hears something groan and snap overhead.\nBurning debris drops onto the stairs above them and Buck scoops the lady over his shoulders, takes off behind Eddie like a bat out of hell. The ladder truck is now the light at the end of a hazy, burning tunnel.\nThey’re almost there when another groan overhead has Buck grinding to a halt, just barely jumping out of the way in time for some of the ceiling to give way and send fresh plumes of smoke billowing down into the hallway. He gestures to Eddie on the other side of the debris, motions for him to take the woman since there’s no way he can climb over that with her still across his shoulders.\nThey transfer her carefully and Buck grins at Eddie’s tense expression.\n“I’ll be right behind you.”\nThey both know Eddie can’t linger, not with the civilian exposed to the heat and smoke of the fire. So Eddie runs and Buck watches him for just a moment, allows himself that small second of reprieve before hauling himself over the smoking planks and carpeting. He can see Eddie at the window, handing the woman over to someone else waiting on the outside, and he’ll blame that distraction and his own lack of discipline for what happens next.\nAnother bit of ceiling falls directly on his back and he’s not prepared, hits the floor hard enough that a grunt of air is forced from his lungs. It feels like he’s been tackled by a linebacker, but when he hauls himself back up he sees it was part of a beam, swung down like a pendulum and fortunate enough to have missed his head. But also unlucky enough to have hit him at all.\nHis back aches, but there’s a sharper pain in his side that’s harder to ignore. With the woman taken care of, Eddie turns and catches Buck’s eyes, worry plane on his features even through the mask and smoke. Buck forces himself to jog, gets to the window and gives Eddie a clap on the shoulder while his side screams with every movement.\nThe rest of the call passes in a strangely focused blur of moments, bright kaleidoscope pieces all running together.\nThe get down off the truck. Bobby gives him a rundown on following orders. Then, he squeezes his shoulder, nods to where the woman is getting loaded into an ambulance and rushed away.\n“They think she’s going to make it.”\nHen asks if he’s okay and he waves her off. There’s so much adrenaline running through his veins and he’s done it. He’s saved someone. He’s back. He can’t risk all that for some small injury. Surely it’s not bad enough to be concerned, if he’s walking and talking and no one has noticed blood seeping through his clothes.\n(A small, smarter part of his brain whispers that that’s not enough, but is quickly silenced.)\nThe fire is eventually smothered into smoke and quiet smoldering. The heat and noise and flickering light disappears, replaced by the flashing of emergency vehicles and the ever-present drone of first responders crawling across the site like worker bees.\nHe helps when he can, gets back on the truck when he’s told, and by the time they make it back to the firehouse it’s an hour past the end of his shift and he’s more than ready to go home. His back and side ache and he knows, he knows, he’s at least a little hurt. Probably hurt enough to be benched for a few days.\nBut he can’t take it. He can’t.\nHe—\nHe’ll only be benched if someone knows.\nSo he takes off his turnout gear and leaves on his shirt, biting back sounds and keeping his face carefully blank as his body screams at him to stop. He gets dressed. He waves goodbye to everyone else and gets in his car.\nHe goes home.\nBy the time he stumbles through the door, both his shirts are soaked through with blood and he knows even before he strips them off that he’s not going to like what he finds underneath. He has the first aid kit ready on the bathroom counter, sterile wipes, needle, and thread staring back at him like a horrible taunt.\n\nFirst chance back and this is what you’ve got?\n\n\nHow many times are you going to mess it up, Buckley?\n\n\nYou’re out of chances.\n\n\nThey’re going to be so disappointed when they find out. \n\nWell they’re never going to find out.\nHe sews himself back together and cleans himself off as best he can, collapses onto his bed and doesn’t even bother getting beneath the covers before sleep takes him, dark and cold and empty as the sea, where the crackling heat of fire can never reach.\n--\n(Present- Sunday)\nHe shows up for his shift with a fire burning in his gut. He’d made it this far, made it through that first major call, through his first shift back two days later. Now he’s got twenty-four hours to pretend he’s fine. Twenty-four hours to paste on a smile and hide the crooked line of stitches on his side, to hide the bruising that surrounds it like a collapsing star, to hide the purple creeping just above the back collar of his shirt.\nThat, at least, he’s not so afraid so show. A little bruising here and there isn’t uncommon in their line of work and so long as no one questions how far down it goes, how nasty and dark it looks at its center…\nHe’ll be fine.\nHe is fine.\nAnd he’s got a whole twenty-four hours to prove it.\nThe first challenge comes by way of Bobby, walking up to him with a little crease between his brows.\n“Hey, saw you needed your turnout jacket sent in for some repairs. When did that happen?”\nBuck smiles, shrugs. “Probably that last fire, debris falling all over the place, had to run for a bit at the end with that woman across my shoulders… Something must’ve caught it, tore.”\n“You didn’t feel anything? It didn’t all the way through?”\n“Nope,” he grins a little wider, holds out his arms. “Not a scratch. Maybe I’ve finally run out of all that bad luck.”\nBobby shakes his head, but there’s a small smile creeping in at the corners of his mouth. “Alright, well let’s not push it.”\nAnd honestly, Buck agrees. He’s already determined to be as careful as possible for the next month. He’s worked too hard to lose it all now.\nHe’d fought and nearly lost everything. Like hell was he going to go through that again. Like hell was he going to waste it.\nSo he keeps his head down, goes out on calls and tries to play it safe, looks a bit more before he leaps. Thankfully, there’s no more burning buildings to run into, just a couple trapped in an elevator, a few traffic accidents, and a father convinced his daughter was dying when she just had a bad case of the flu.\nThen suddenly he’s eighteen hours in and staring at himself in the bathroom mirror, face pale as he bites the inside of his cheek. There are a few beads of sweat on his forehead and pads of dirtied gauze in a bag in his pocket.\nThe door swings open and he splashes water on his face, tries to look natural as he grins and squints through one eye at whoever walked in.\nIt’s Eddie, because of course it is, and Buck forces himself to stand a little straighter, to make sure his veneer is shining even more brightly than usual.\n“Hey, man.”\n“Hey.” Eddie chuckles and steps closer, meets Buck’s eyes in the mirror. “Having trouble staying awake?”\n“Yeah,” Buck sighs, then grins and turns to look at Eddie head on. “Think there’s any coffee left in the kitchen?”\nEddie shakes his head. “I think you need a napmore than you need caffeine.”\nAnd god isn’t that the truth. He wants nothing more than to crawl into bed and sleep for a week. But he can’t. Can’t let his guard down. Can’t give anyone any reason to suspect something’s wrong.\nSo he laughs, and bumps Eddie’s shoulder, and walks out the door before those kind hazel eyes can flay him any deeper.\nIt’s a small mercy that they don’t get any crazy calls before the end of his shift. A full twenty-four hours without anything earth shattering. It feels like a miracle and Buck is ready to kiss whatever deity he has to when he hears someone let out a low whistle in the locker room behind him and his stomach drops.\n“Damn, Buck, what happened to your back?”\nHe sees Eddie freeze out of the corner of his eye and makes sure to keep his motions calm and fluid, pulls on his jacket so the collar obscures the faint traces of bruising creeping up his spine.\n“Probably a piece of ceiling. Looks pretty cool, right?”\nChim lifts a brow. “If by cool you mean incredibly painful.”\nSomething cold drips down Buck’s throat, settles sour and thick in his stomach. He forces a laugh. “Nah man, I'm fine. Didn’t even notice until I saw it in the mirror a couple days ago.”\nChim doesn’t look convinced and he can see Eddie creeping closer, looking worried and frustrated in equal parts. It feels like the walls are closing in. Feels like everything is slipping through his fingers.\nHe can’t do it again. He can’t.\n“Well I’ll see you guys later, yeah?”\nHe shuts his locker and walks away, doesn’t stop until he’s in his car and half way home. Until it finally feels like he can breathe again.\nHe dreams of salt water and deafening explosions, wakes up on a choked scream with blood on his shirt. He sits with his head between his knees, rocks back and forth and tries to hold himself together. I’m okay.\nHe has to be.\n--\nHe wakes up the next morning to a text from Eddie. His eyes are red and he knows the dark circles have only gotten worse. His throat is sore and his side throbs with every beat of his heart, makes him groan when he sits up and throws his legs over the side of the bed. Everything is stiff and painful and he knows he’s been pushing it, even taking it easy at work is still too much, but he can’t ask for time off because then they’ll be questions and he can’t answer them. Can’t risk it. Can’t—\nHe unlocks his phone and opens the message from Eddie, feels a strange twist in his chest at the invitation to come over and have dinner with them in the evening. Normally, he would say yes without a second thought. Normally, he wasn’t trying to hide something from his best friend.\nHe swallows and replies, decides not going would be more suspicious than whatever Eddie might try and ask while he’s over. Besides, seeing Christopher will be medicine in and of itself. Seeing the little guy always managed to brighten his day, no matter what else was going on in his life.\nIt doesn’t make it any easier when he’s standing at the door, covered in a t-shirt and dark button up with a collar, wondering if he’s made the right choice. A part of him still wants to turn and run, wants to curl up in a ball and hide all the soft, vulnerable parts of himself until it finally feels like he’s not shaking apart.\nHe thinks of everything he has to lose. His job. His life. His family.\nBecause as much as they may love him now, he knows how this story goes. Time is a slow and merciless killer and maybe they would stay in touch for the first month or two, then it would be less and less, until finally it was only the occasional phone call or message promising a meet up that would never come. Buck knows he’s not enough to make someone stick around. And he’s definitely not enough to have someone coming back.\nHe needs this job as much as he needs his family because it is his family. It’s what keeps them together.\nAnd as much as Buck feels himself drawn to the warmth of the house before him, as much as he wants to hold Christopher and see Eddie smile in that soft, secret way he has when he thinks no one’s looking, he’s very aware that these boys hold the keys to his heart. That if anyone would make him crack open and spill out across the floor it’s them.\nHis heart beats louder in his chest.\nBut he’s fine. He’s fine.\nHe knocks on the door.\nHe hears Christopher shout from inside and the faint clacking of his crutches against the hardwood. The door opens moments later and he has a big smile already on his face that’s only a little forced, becomes genuine the moment he kneels down and has Christopher crashing into his chest, arms wrapping around his neck in a hug. The pain is nothing compared to the pure joy that radiates through him.\n“Hey, buddy.”\n“Hey, Buck.”\nHe looks up and sees Eddie watching him quietly. Him, not them, and Buck immediately feels the need to perform.\n“So,” he asks, giving Chris a mischievous smile. “What’s the plan for tonight? Games? Movies? Making a mess of your dad’s kitchen?”\nChris laughs and Buck tickles his sides, gives him one last squeeze before standing up.\n“We don’t really have a plan,” Eddie says. “I ordered some food that should be here soon. Otherwise, it’s whatever the two of you want to do.”\nBuck looks back down at Chris and puts a hand on his head, hair soft beneath his palm. “Hear that? Whatever we want.”\n“Pillow fort!” Christopher crows, already hurrying to the living room. “And ice cream!” comes around the corner just a few moments later.\nEddie lets out a laugh. “At least he’s easy to please.”\n“The kid has good taste.” Buck grins in agreement.\nEddie looks at him for a beat, eyes full of something Buck can’t quite place. “Yeah, he does.”\nIt feels like he’s saying something different and Buck swallows, shifts on his feet and tries not to glance down at Eddie’s lips, or his chest, or the outline of his strong arms in the Henley he’s wearing. He fails miserably at all of those things and when he meets Eddie’s eyes again he finds that they’re warm and unbearably fond, crinkling at the corners with quiet laughter.\nA flush colors his cheeks at getting caught, but he’s saved by the ringing of the doorbell. He makes his escape into the living room while Eddie grabs the food. In no time at all, they’ve got a bunch of pillows and blankets stacked and draped around the room, forcing Buck and Eddie to hutch over as they eat Thai food from some place a few streets over.\nThey end up playing a few card games then putting an animal documentary on Netflix, Christopher curious to learn about real life lions after the CGI versions Disney had given him in theaters. It’s a great night and honestly just what Buck needed. It feels like a reminder of what he’s fighting for and with Chris asleep against his side and Eddie’s leg a warm weight against his own, he can’t think of a single place he’d rather be.\nWhen the documentary ends, Eddie quietly stands and starts taking down the fort, giving Buck enough room to stand with Christopher in his arms. His stitches pull a bit and he can’t quite cover the wince—if the way Eddie’s mouth pulls into a frown is any indication, but he soldiers on, readjusts Chris and carries him all the way into his room despite the uncomfortable pressure it puts on his bruising.\nEddie steps up to give Chris a kiss goodnight and Buck disappears into the hall and back into the living room, starts cleaning up the rest of the mess in the hopes that he can do most of the bending and lifting before Eddie is there to watch him struggle through it. He’s only partially successful and he’s thankfully hidden behind the closet door when he puts a few blankets away and grimaces at the way his stitches pull, hears Eddie coming closer and quickly schools his features.\n“You don’t have to help clean, Buck.”\n“You tell me that every time.” Buck steps back so Eddie can shove a few more blankets into the higher shelves. “It hasn’t stopped me yet.”\nEddie just sighs and puts a hand on his shoulder, looks him in the eye in a way that has Buck going a bit fuzzy at the edges.\n“Thank you. For everything.”\nAnd yeah, Buck thinks, definitely worth it. Even though he’s sore all over and most likely bleeding again, he wouldn’t change it for the world, not when Eddie is looking at him like that, so warm and soft and open. He lets that feeling carry him all the way home, clings to it as he cleans himself up and stares at himself in the mirror, wonders what tomorrow will bring.\n--\nAnother shift goes by, and another, and Buck is keeping his head above water. He’s still sore, and his stiches are healing slow and crooked, but he’s okay. He’s okay despite the dark circles under his eyes and the paleness of his skin. Despite the few pounds he’s dropped in the last couple weeks.\nHe looks a bit sick, if he’s honest and a few people have noticed.\nDidn’t sleep well last night, he says.\nJust tired, he says.\nJust a cold, he says.\nHe throws excuse after excuse and lets out a sigh of relief when each one sticks. There had been a few more comments about the bruising on his back, but even those have faded as he continued to shrug each one off and as the deep purple faded from a hazy blue to a sickly green. Now it’s mostly comments about him not being in the gym, or not eating as much at meals. He chalks them both up to the mysterious cold/fatigue that’s been hanging around and privately reassures himself that he’s doing the right thing. The gym would be pushing it too much. And the food… he’s just not that hungry.\nHe’ll put the weight back on when he’s healed up, isn’t too worried about it so long as he can still do his job, which he can. He’s long since learned to push through pain.\nHe’s a few hours into a Tuesday shift when everything goes to shit and that’s probably not why he’s expecting it. It’s a Tuesday. Nothing ever happens on Tuesdays. But there’s a building burning and they’re rushing to the scene, sirens blaring and a residential home going up in smoke.\nNormally, a call to a fire in a residential home on a weekday wouldn’t be too much of a crisis. Property damage? Sure. But residents would be out at school or work. This home, however, is apparently host to a group of homeschool kids who are all scattered and trapped throughout the house by age group. Some of them are already out, standing around their teacher with wide eyes as fire licks at the roof.\nBobby gives out orders and Buck is on the move, running through the house and grabbing kid after kid, rushing them through the smoky hallways to Hen and Chim waiting just outside. Eddie is searching the basement as Buck finishes clearing the first floor and thunders up the stairs to the second, knocking on doors and shouting LAFD. The second floor is a mess of fire and smoke and there’s no way he can get anyone back down the stairs before the fire is more under control. He radios down to Bobby and prays there’s somewhere to get a ladder.\nHe’s told there are at least five kids upstairs, between ten and thirteen, and he finds all of them huddled together in the bathroom while flames roar just outside the door. They scream when he first rushes in and he’s immediately trying to calm them, rooting in the cabinets for towels to hold over their faces and radioing Bobby for retrieval.\n“The bathroom window is too small. We’ll have to try a different route.”\n“Do you have a clear path anywhere?”\nBuck steps back out into the hallway and looks around, pushes open the door to the next room and finds it mostly in tact and with a large window facing the front yard.\n“Next room looks good, Bobby. Can you get a ladder up to me?”\nHe waves from the window and gets a thumbs-up from Bobby, opens the window and pushes out the screen while the truck gets pulled into position. Then he goes back for the kids.\nThey stare at him as shocked and soot-faced as before, and he knows he’s running out of time, always running out of time. He grabs the first kid and runs, passes them through the window into Bobby’s waiting arms and goes back for the next and the next. His side is screaming and he swallows down a grunt of pain as he picks up the next one, has to bite back a scream when the kid panics as he’s being passed through the window and flails, kicks Buck in the side in a way he’s sure has fresh blood staining his shirt.\nThe last kid is passed out when he gets there, whether from shock or smoke inhalation, and Buck remembers the determined look on the girl’s face as she’d insisted the others go first because she was oldest and it was her responsibility to make sure they were safe. He picks her up as carefully as he can and runs, gets her to the window where Eddie is now positioned and waiting.\nAs soon as she’s out of his arms, he’s radioing down to Bobby.\n“Last one out, but she’s unconscious.”\n“I’ll have Hen waiting.”\nThe response does something to calm his nerves and there’s nothing for him to do but follow Eddie down, maneuvering himself out the window and using each step down as a chance to fortify himself, push the pain down so no one else can see it.\nEddie meets him at the bottom, his own face smudged with ash and sweat but somehow managing to look worried about what he finds on Buck’s.\n“You okay, man?”\n“Yeah,” Buck pants, pulling off his mask. “I’m fine. You?”\n“Yeah, I’m good.” He stares at Buck for another moment, only turning away when Bobby calls their names and tasks them with hose duty now that everyone’s been evacuated from the house.\nHauling and maneuvering the heavy lines ruins whatever was left of his stitches and it feels like a fire is burning just beneath his skin as the minutes tick by, the pain dissolving to a prickling buzz throughout his entire body. By the time he collapses in the truck, it feels like he can hardly think straight, just tries to focus on taking deep, even breaths and stopping his hands from shaking.\nIt hurts so bad. \nFeels like the lingering agony of physical therapy after his leg.\nFeels like the bone-deep exhaustion of wandering the streets after the tsunami.\nFeels like he’s about to be swallowed up again, about to lose his tenuous grip on everything and everyone he’s fought so hard to get back to. He digs his fingers in and holds on.\nHe’s okay.\nHe forces himself through the motions of the rest of his shift, has to patch himself up in the bathroom as best he can, shower smoke and ash and blood from his skin then cover it all up and come back out smiling. Because he has to be perfect.\nHe has to prove that he’s where he’s supposed to be.\nHe watches TV and helps some guy who’s got his dick stuck in a vacuum. Sits through dinner and forces himself to swallow food that he doesn’t want to eat.\nHe’s okay.\nBut Chim and Hen keep exchanging glances and Bobby is watching him out of the corner of his eye and Eddie is hovering and they just won’t let it go. As soon as his shift ends he’s off like a rocket, bolting to the locker room before anyone can stop him. Of course, that means Bobby is already there waiting.\nHe gives Buck one long, hard look and lifts a brow. “You want to tell me what’s going on?”\nBuck shrugs, makes his way past to his locker. “Nothing. I’m fine.”\n“Buck.” His voice is a warning just as much as the hand on his shoulder.\nBuck takes a deep breath, forces a smile as he turns back around. “I’m just tired, okay? It’s been a long couple weeks and that call today took a lot out of me. But I’m fine.”\nBobby still doesn’t look convinced, is looking at Buck like he’s one small push away from breaking. Is looking at him like he was that day at the hospital, after the blood clots. It makes something go tight in Buck’s chest, makes his whole world tip a little bit sideways and his ears ring like the rising scream of a bell.\n“If you need a day off…”\n“No.” He shakes his head, stuffs his things into his bag and turns away to hide the way his hands are shaking as he unbuttons his shirt. He throws his jacket on a little too quickly and sucks in a breath at the way pain shoots through his side. “I’m fine.”\n“Alright. Call me if you need anything, okay?”\nBuck hears the words but they don’t really register. He’s too focused on getting out. There’s a sucking weight in his chest and he feels like he’s losing his grip, breaths coming short and tight as he gets into his car and works his way through traffic. His eyes burn and his throat clicks, but he holds it together. Holds it together until he’s pushing through his door, locking it and collapsing against the solid wood, letting it hold him as he falls apart.\nHe lets the tears come, lets them burn at the corners of his eyes and clog up his throat until he’s sobbing, loud and ugly because everything hurts and he can’t do anything about it, can’t seem to stop the universe from tearing everything away.\nHe’s not sure how long he sits there, but long enough that when he finally stands he feels a little lightheaded, floaty in the way you do after a really long cry. The sky is darkening outside the windows and he makes his way slowly up the stairs and into the bathroom, strips off his shirt and just sits on the toilet lid, uncaring and unfeeling of the ragged tear in his chest as he stares down at the tile floor.\nHe’s so tired. All he wants is to crawl into bed.\nA single drop of blood snakes its way down his chest and he watches as it soaks into his waistband, lifts up shaky hands and wonders when he became such a mess.\nIt’s okay.\nHe thinks it like a mantra, clenches and unclenches his hands until the trembling stops then carefully sews himself back together, covers the ragged line with another piece of gauze and a whole lot of denial. The bruising is a little harder to ignore, fading but still a wash of glaring color against his otherwise pale skin. He refuses to look at himself in the mirror as he walks by.\nHe leaves his shirt and jacket lying on the floor and opens the bathroom door with one thought in mind: sleep. Possibly shitty and un-restful sleep, but a brief escape from the pain nonetheless.\nHe’s not expecting Eddie to be standing there on the other side, arms across his chest and a hard glint in his eye that immediately dissolves into concern as he catches sight of Buck.\n“What in the—hey!”\nEddie calls out and plants a hand on the bathroom door, stopping Buck from slamming it closed again.\nBuck tries to push it shut, but he’s tired and in pain and honestly no match for all of Eddie’s well meaning determination. He watches as if outside his own body, arms crossed over his chest as his last form of defense, as Eddie shoulders his way inside, waits for whatever yelling is sure to follow.\nBut he doesn’t get yelling. Instead, he gets Eddie stepping closer, lifting one gentle hand that doesn’t even touch his skin.\n“Buck, what is this?” His voice sounds so soft and small that Buck has to turn away, can’t face whatever’s in Eddie’s eyes that’s making him sound that way.\n“It’s nothing,” he says. “I’m fine.”\nEddie makes a frustrated sound. “It’s obviously something. When did you get hurt?”\nEddie reaches out and this time he does touch him, wraps one hand around Buck’s wrist and pulls his arm away, holds it to the side as he does the same to the other, his palms warm and grounding as he keeps Buck open and exposed, takes in the bruising on his side, the pad of gauze taped hastily just beneath his pec.\nBuck’s breaths come quicker and he backs away until he hits the counter, can only stare unseeingly at the shower as Eddie presses right up against him, lets go of one wrist to gently remove the gauze on his chest.\nEddie sucks in a breath at what he sees, fingers skimming the outline of the wound. “Oh, Buck.”\nAnd Buck feels tears pricking at his eyes again, feels everything bubbling up and threatening to spill over, threatening to leave him a sobbing mess on the floor when he can’t—he can’t. \nHe shakes his head and tries to worm away, is stopped by Eddie’s firm weight pressing him into the counter.\n“Buck, please. Talk to me.” The fingers at his chest skim up to his neck, then slide back and cup his jaw, the sweep of Eddie’s thumb coaxing Buck to turn and face him. “When did this happen?”\nBuck just shakes his head again, tries to blink back tears and restarts his mantra. It’s okay.\n\nIt’s okay.\n\nEddie sighs and drops Buck’s other wrist in favor of holding his waist, coaxing him to the side so he can sit him down on the toilet seat. Then that same hand is in Buck’s hair, gently scratching at his scalp, guiding Buck’s forehead to rest at the soft, warm fabric just above his stomach.\n“It looks too old to be from today,” Eddie says. His fingers briefly skim over the top of Buck’s spine, then trace further down, following the line of bruising that goes from just above his shoulders, across one shoulder blade, and to the center of his back. “You told Chim this was from the fire two weeks ago. You also brushed it off like it was nothing. This isn’t nothing, Buck.”\nBut Eddie doesn’t understand, doesn’t understand that it has to be nothing, because if it’s something then… Well, then Buck is nothing, stripped of everything that makes him who he is.\nMakes everything he fought for was a waste.\nHe crosses his arms loosely over his stomach, hands clenching and unclenching at his sides. It’s not enough to hold him together but god is he going to try.\n“I’m fine.”\nIt’s muffled in the fabric of Eddie’s shirt, but it’s obvious the other man hears him with the way he sighs and holds Buck that little bit tighter.\n“It’s okay not to be fine, you know.”\nBuck lets those words die in the air between them, takes a deep breath and sits up just enough to look Eddie in the eyes. “Please don't tell Bobby.” Eddie’s face goes through an interesting range of emotions but Buck pushes on. “I’ve got a couple days before my next shift and I promise I’ll take it easy. I’ll be fine. So please, you can’t tell him. I—”\nThe words stick in his throat and his eyes burn. It’s all wrong. Eddie shouldn’t be here. He shouldn’t—Buck just needs five minutes to get himself cleaned up. Then he can prove it. He can prove he’s fine and promise Eddie whatever he needs to get him to believe it.\nHe stands up suddenly, dislodging Eddie’s hands and pushing past him to get to the sink. The first aid kid is still sitting on the counter and he opens it quickly, pulls out a fresh pad of gauze and some tape and resolutely doesn’t look up at his reflection in the mirror. He’s fine. He’s fine.\n\nIt’s okay.\n\nEddie steps up behind him and he shudders at the sudden warmth all along his back, wants nothing more than to lean into it and let Eddie take some of his weight. He doesn’t realize his hands are shaking until Eddie’s fingers trace carefully down his forearms, skate over his wrists and slot gently between Buck’s own.\n“I’ve got you, Buck. You’re okay.”\nBuck glances up to meet Eddie’s eyes in the mirror and it’s a mistake. Because it’s his own eyes that grab him and don’t let go, blue and lifeless, ringed with red and weighted down by ever deepening purple. He’s so tired.\nGod, he’s a mess.\nThe gauze and tape drop to the counter and a sob escapes his throat, leaves him breathless as Eddie wraps their arms around his chest, one set of hands on his shoulder and another just beneath the ragged stitches at his side. He holds Buck tight, keeps him from shaking apart as the tears keep coming, as the next wave crashes over his head.\nHe’s not okay, he’s so far from okay, because for as long as he can remember the ground hasn’t felt solid beneath his feet. His life, his family, keeps slipping through his grasp. He told Bobby he’s a fighter, and he is, god he’s been fighting his whole life it feels like. But he just—he just keeps fucking it up.\n\nAlways a disappointment.\n\nHis tears stop as a numbness washes over him. He looks at his reflection, takes in the puffy eyes and flushed cheeks, the wetness clinging to his lashes, as if from somewhere far away. When Eddie shifts behind him, Buck feels it like an echo against his skin, stares into nothing and lets Eddie turn him, lets himself be lifted up onto the counter.\nA warm palm cups his cheek.\n“Buck?”\nThere’s a ringing in his ears again, low but persistent.\n“Evan?”\nHis breath hitches and Eddie rubs a gentle circle against his cheek.\n“I need you to come back. I don’t know where you are right now, but I need you here. With me. Can you do that?”\nBuck pulls in another shuddering breath, wants to scream no, wants to shake his head and pull Eddie closer and drown in the darkness of his own mind and Eddie’s warm arms. But it’s like the connection between his brain and the rest of his body is broken, leaves him sitting there like a shell while worry creases deeper and deeper into Eddie’s brow.\nThe hand on his cheek drops, lands at the junction of his neck and shoulder and squeezes just tight enough to start breaking through the fog. Heat. Pressure. Then another hand presses against his side, rubs up and down a few times before slipping around to his back and pulling him in. His forehead hits somewhere along Eddie’s collarbone and the next breath he takes leaves him dizzy.\nEddie is safe and solid and warm and Buck turns his head to burrow further in, is quietly pleased when Eddie steps closer and lets Buck nuzzle into the side of his neck. Eddie’s skin is perfect against Buck’s forehead, the collar of his shirt an interesting texture against the corner of his mouth.\nHe breathes in, and out, feels the damp heat of his own breath gather in the fabric.\nEddie’s hand runs up and down his back, the other holding the back of Buck’s head.\nFinally, Buck feels life return to his extremities. He curls weak fingers in the fabric of Eddie’s shirt and decides that even if he doesn’t deserve it, even if he doesn’t get to have this family, he can allow himself to pretend for just this moment… before it all gets ripped away again.\n“That’s it, Buck,” Eddie says, voice jarring in the quiet. “You’re doing great. Can you hear me?”\nBuck nods and feels Eddie let out a breath.\n“Okay, you’re okay. I’ve got you.” He rubs his hand a bit quicker up and down Buck’s back, forces little pinpricks to spread out along his skin. He does the same to his arms, his hands, coaxes Buck to sit up and rubs at the flat plane of his sternum too.\nWhen Buck finally looks up to meet his eyes, he’s not prepared for how wrecked Eddie looks, how clearly worry is written on his face.\n“Buck,” he says quietly. “I need you to tell me what happened. I'm not mad. But I need to know so I can help you.” The pads of his fingers ghost over the bruises at his side. “When did this happen?”\nBuck sniffs, wipes at his face with the back of a hand and shakes his head. The words still don’t want to come.\n“Buck—” Eddie starts, and the tone of his voice is enough to make Buck want to sink through the floor. Frustration.\nDisappointment.\nHe shuts his eyes and tries to swallow past the lump in his throat, keeps shaking his head as if that’ll somehow solve all of this.\n“Okay,” Eddie says. “It’s okay. I went too fast. I’m sorry.” He takes one of Buck’s hands and loosely tangles their fingers, gives Buck something else to focus on as he asks, “Did it happen the same time you hurt your back?”\nBuck nods and Eddie gives his hand an encouraging squeeze.\n“Was it during the office fire?”\nBuck nods again.\n“That was two weeks ago.” Eddie doesn’t sound surprised exactly, just sad. Worried. “Did you tell anyone?” No. “Did you go to the hospital?” No.\nEddie deflates in front of him and Buck can practically see the why hanging off the other man’s lips. Instead, Eddie gives him a soft smile that doesn’t quite reach his eyes.\n“Can I take a look at it?”\nAfter a moment’s hesitation, Buck nods, sits quiet and still while Eddie pokes at the redone stitches and presses gently at the bruising on his back and sides. The gauze and tape get picked up from where they’d been knocked to the side and Eddie covers the wound, steps back when he’s done and holds one hand out to help Buck slide down from the counter.\n“Let’s go lay down, okay?”\nBefore long they’re both stretched out beneath the covers, Buck half on top of Eddie with his face pressed into the other man’s throat. Eddie is warm and solid beneath him and Buck focuses on the rhythm of his breaths, tries to match them. Eventually, his tears dry up, leave him feeling boneless and tired as he settles back into himself. His fingers twitch against Eddie’s chest and he feels shame wash over him like an immense, sucking wave. His entire body tingles with it. He’s drug back out to cold, choppy waters, unsure if he can keep himself afloat. But he has to. Somehow, he has to. He’s already caused enough damage.\n“I’m sorry,” he says, voice hoarse and cracking.  \n“Don’t apologize,” Eddie murmurs. “Not unless you can tell me what it’s for.”\nBuck shuts his eyes tightly, takes a moment to let those words wash over him because honestly whatisn’t it for? He figures there’s one answer in particular Eddie’s looking for.\n“I lied,” Buck says softly.\nEddie hums, strokes a gentle hand up Buck’s back. “You did,” he says. “But I don’t think that’s what you were apologizing for.”\nBuck swallows. “I got hurt again.”\n“Yeah, you did. But accidents happen, you don’t have to apologize for that.”\nThey lay in silence, Buck processing, mind racing. He doesn’t know what Eddie wants him to say, doesn't know the right answer. There’s so much that he has to be sorry for and he’s already said the things he knows have upset Eddie in the past.\nFinally, Buck pulls in a shaky breath, releases it on a whisper. “I failed.”\nThe truth of it settles heavy and constricting in his chest. The words taste bitter on his tongue and his ears burn. Hearing it aloud makes it so much more real.\nEddie starts to speak but Buck shakes his head, hauls himself up so he can wrap his arms around his legs and stare at his knees. He misses Eddie’s warmth immediately but forces that thought aside. He doesn’t deserve it.\n“I tried so hard and—and I still… I can’t do it again, Eddie. I can’t.”\nEddie sits up beside him, but doesn’t try to touch. “Can’t what?”\n“Can’t lose my job. Lose everything,” he says. “You guys are all I have and I can’t—I don’t know what I’d do if—” He chokes on a sob then pulls in a shaky breath.\n“Buck, what are you talking about?” Eddie’s voice is slow, calm, but Buck can still pick up the undercurrent of tension running through each word. “No one is going to take your job. You might have to take a couple weeks off, but that’s it.”\nBuck stares into nothing, tries to push back the fresh round of tears that won’t do anything but make Eddie worry more, whispers, “Nothing’s ever going to change.”\n“I thought you didn’t want things to change?” Eddie asks softly. “What’s going on, Buck?”\nBuck sucks in a shaky breath and wipes at his eyes. “Nothing’s ever going to change because I still mess everything up.”\nAnd god, it hurts how much it’s true. Hurts that no matter how far he’s run or how hard he’s worked, he can’t seem to escape it.\n“Buck, c’mon man,” Eddie says, still careful, like he thinks Buck might break. “You have to know that’s not true.”\n“Isn’t it?” Buck asks, finally turning to look Eddie in the eye. “I was a mess before you met me. Buck 1.0 sucked.”\nEddie opens his mouth to say something, but Buck plows on, needs to get it all out.\n“And yeah, sure, maybe Buck 2.0 is better, but Abby still left. I still wasn’t good enough for her. And god, I was such an ass to you that first day.” He shakes his head. “I thought maybe I was doing better, moving forward, then the explosion happened and I was taken off the team and… I was so lost, Eddie. And I did something stupid and almost lost all of you because of it, but I was so desperate and I—I’ve already messed it up again.”\n“You didn’t mess anything up,” Eddie says, reaching out to cover one of Buck’s hands with his own. “And we’re all here to support you. We just want you to be safe.”\nBuck looks away, feels tears pricking his eyes again.\nEddie’s hand tightens. “Buck. You’ve been through a lot, everyone will understand.”\nOh, they’ll understand all right. They’ll understand that Bobby was right and he had no business being back. They’ll understand that he nearly ruined everything with that stupid lawsuit for nothing. They’ll understand that he’s nothing but a liability, not worth keeping around.\nJust one disappointment after the next.\nHe pulls in a shuddering breath and wipes at his eyes, dislodging Eddie’s hand in the process. “Yeah, you’re right. Guess you’re all used to it by now.”\n“What’s that supposed to mean?”\n“It means this,” Buck says, gesturing to his side. “Isn’t exactly going to be a surprise. Just another disappointment.”\n“Buck, no.” Eddie reaches out and puts a hand on Buck’s knee, leans forward until he’s back in his field of vision. “Is that what you’re so afraid of? Disappointing us? Because I promise that thought hadn’t even crossed my mind.”\nAnother tear slips out of the corner of his eye and Buck stares up at the ceiling, tries to blink the rest away. Now isn’t the time to let a few kind words break him down.\n“You are the furthest thing from a disappointment,” Eddie says. “You’re brave and kind and smart and funny. You’re so good with Christopher and you give everything you have to your job, to being a hero. You’re the best friend I’ve ever had and I know I speak for everyone when I say that you are loved.” He reaches out and puts a gentle hand on Buck’s cheek, coaxes him to meet his eyes and Buck feels himself crumble at the fierce emotions he finds there.\n“And you are not a disappointment,” he says, giving Buck a gentle shake. “So you get that thought out of your head right now, you hear me?”\nTears are running freely down his face, messy streaks on his skin, and he wonders how he has any left at all. His breath hitches and he tries to look away, but Eddie holds him firm, looks right in his eyes and says it again.\n“You’re not a disappointment.”\nHe shifts closer on the bed and pulls Buck down into the crook of his neck, lets him cry into the warm skin there. And god, Buck wants to believe him so bad, wants to wrap himself in those words like a blanket, like a shield, and forget everything else.\nBut his side is still aching and all he can think about is how he has to call Bobby tomorrow and admit what he’s done. He can already hear the resigned sigh, the unspoken I told you so. It makes him cry a little harder, cling to Eddie as the other man leans them back and gets them situated beneath the covers.\nEddie holds him tightly, hands gentle on his skin, rubbing patterns that Buck is too tired to trace. He keeps saying things, too. We love you. We’re so proud of how far you’ve come. You’re a good man.\nThey sweep in and out of Buck’s mind, washing like cool water over the burning ache of shame that’s buried so far down he doesn’t think he’ll ever be able to touch its root. Always a disappointment. \nHe’s not sure which voice to believe.\nHe falls asleep with his face pressed to Eddie’s throat, body heavy and detached, like he’s already in a dream.\n--\nBuck wakes up the next morning and has all of five seconds of blissful peace before everything comes rushing back. Eddie’s pressed up against his back, one arm thrown over his waist, and it tightens as soon as Buck shifts, as if he’s afraid Buck is going to run away. As if Buck has anywhere else to go.\n“Hey,” Eddie says, voice not nearly as sleep-rough as it should be.\nBuck swallows, tries to clear some of the scratchiness from his throat. “Hey.”\nThey lay like that for a few more minutes, Buck slowly taking stock, going over the night before. He’s never been ashamed of crying, but having a complete meltdown in front of Eddie…if it weren’t for the other man’s iron grip around his waist, he might just sink right into the floor and disappear. And now that the cat’s out of the bag, he knows he needs to call Bobby. Which means more disappointment, some scolding, and getting taken off duty for a few weeks at best, getting permanently sidelined, maybe even fired, at worst.\n“You’re thinking too hard.” Eddie squeezes Buck a little tighter then props himself up on an elbow. “We’ll take everything one step at a time. Together. You aren’t alone, Buck.”\nBuck doesn’t have the heart to correct him. He pushes himself up and rubs at his eyes, no doubt still red and puffy from the night before.\n“I’m gonna go take a shower,” he mumbles, standing up and noting that Eddie had taken off both their shoes at some point in the night. The door shuts behind him and he sighs, tries to let the warm water wash everything away.\nHe’s barely shut off the water when there’s a brief knock on the door, followed by it opening a crack.\n“Can I come in?”\n“Didn’t stop you last night,” Buck grumbles, cinching his towel a little tighter around his hips.\nEddie sighs but comes in anyway, sets some clothes on the counter then gestures for Buck to come closer. “Let me take a look at your stitches.”\nSeeing no way around it, Buck acquiesces, leans up against the counter and tires to ignore the heat of Eddie’s hands on his skin, the weight of his gaze. Now would be an incredibly inappropriate time to pop a boner. Nothing like confessing your feelings for your best friend after spending the night getting snot on his shoulder.\nIt doesn’t take long before he’s patched up to Eddie’s satisfaction and dressed in clean sweats and a t-shirt, sitting on the couch and staring at his phone while Eddie scrounges in the kitchen.\n“You want some eggs?”\n“I can make my own breakfast,” Buck calls back. He’s got Bobby’s contact on the screen, but he’s nowhere near ready to press that call button.\nHe hears a sigh and looks up to see Eddie walking towards him. “I know you can, Buck. I was asking if you wanted some, because I’m making some for myself and it wouldn’t be any problem to throw a few more in the pan. Especially since they’re your eggs to begin with.”\nBuck huffs and quickly locks his phone when Eddie comes to sit down beside him, obviously not quick enough by the way Eddie sighs again and knocks Buck’s knee with his own.\n“You don’t need to be so worried. Bobby’s a good guy, you know that.”\n“Yeah and he was right.” Buck runs a hand across his face. “I didn’t deserve to be back in the team and he knew that, but I just—”  \n“Hey, no,” Eddie cuts him off. “Bobby kept you off duty out of concern for your safety and his own personal feelings about you. You were on blood thinners and he’d seen you nearly die a few times too many as it was.”\n“And you think this is going to help that?” Buck asks, voice rising. “He’s going to realize it was a mistake bringing me back. Who knows how long he’ll want to bench me this time.”\n“Probably two or three weeks, Buck. And we’ll all be waiting for you to come back.”\nBuck shakes his head. “You don’tget it. This job is my life. My whole entire life. When the rest of you guys go home, there’s someone waiting. And—and you have kids, partners, families. A purpose. But without this job, I— I don’t have anything. I can’t mess it up again. I can’t.”\nEddie’s eyes go wide, realization dawning on every inch of his face. “Buck, no.” He shifts on the couch to face Buck fully, puts a hand on his shoulder, thumb pressing hot and firm against his skin. “You are so much more than this job. And us, your family, we’re going to be here no matter what.”\nHe looks so earnest, so sure, that Buck doesn't have the heart to point out how he’s wrong, to remind him how easily families break apart. All it takes is a little too much stress, a little too much distance. He’s familiar with the process, doesn’t really care to relive it.\nHe stands up and Eddie’s hand falls back to his side.\n“I’m going to call Bobby.”  \nHe doesn't look back as he takes the stairs two at a time, locks himself in the bathroom and presses the call button like ripping off a bandaid. Better to get it over with.\nBobby picks up on the second ring.\n“Hello?”\n“Hey, Bobby. It’s me. Is now a good time?”\n“Sure, Buck, of course.” There’s a rustling sound, noises and soft voices, and then quiet, like he’s stepped into a separate room. “Is everything okay?”\n“Yeah, I uh—I just need to ask for some time off.”\nThere’s a pause and Buck can picture the concerned confusion on Bobby’s face.\n“Time off? For how long?”\n“Guess that’s up to you and the doctors,” Buck says. “However long it takes for a few stitches to heal.”\n“Stiches. You’re hurt?”\n“Yeah, I mean. I’m fine. Just, a little banged up.”\n“What happened? Are you at the hospital?”\n“No. No, I’m at home.”\n“Did you go to the hospital?”\n“No? I’m fine, Bobby. Honestly. If I was going to bleed out, I would’ve done it by now.”\nThere’s a long, long pause and Buck wants to smack himself at the slip. Not exactly how he’d planned this conversation to go. He’d been hoping to ease into things, maybe even avoid certain parts all together. But Bobby knows him too well for that.\n“It was the call a couple weeks ago wasn’t it? When you ripped your coat.”\n“Yeah. Bobby, I—”\n“And you haven’t been to the hospital?”\n“No, but I—”\n“I’m coming over right now and we’re getting you checked over. You’re still on blood thinners, Buck.”\n“I know,” he says. “I know. But I promise you, I’m fine. Eddie checked me over last night and you know if he’d found anything he would’ve drug me to the ER himself.”\n“Is he still there?”\n“Is he—yeah? I mean, he’s downstairs, but what…”\n“Put him on the phone please.”\n“Bobby…” Buck says, only a little embarrassed that it comes out sounding like a whine.\n“Buck. I can call him myself. It’s up to you.”\nBuck huffs and swings open the bathroom door, is only slightly surprised to find Eddie on the other side for the second time in as many days.\nHe hands him the phone with a muttered, “Bobby wants to talk to you” then crawls back into bed and pulls up the covers, decides he might as well get a head start on his future plans.\nHe listens as Eddie talks, voice low and steady, answering questions and filling Bobby in on what happened, the state of Buck’s back and side, and the fact that he’d worked for two weeks with the injury hidden beneath his clothes.\nThere’s a tug on his blanket and Eddie pulls back one corner, sits on the edge of the mattress and puts the phone on speaker.\n“Buck? You there, kid?”\nBuck doesn’t bother moving, just says “Yeah” into the covers and presses his eyes shut, prepares for the blow.\n“I’m sorry.”\n\nI’m sorry, but we can’t have someone so reckless on the team.\n\n\nI’m sorry, but you’re just not ready.\n\n\nI’m sorry, but you’re done.\n\n“I’m sorry if my concern for you made you feel like you had to hide this. I want you to be safe, but I also want you to be happy and I’m not going to force you to quit a job you love just because I’m uncomfortable with the possibility of you getting hurt.”\nBuck’s eyes pinched tight, brow furrowed, not really able to process everything he’s hearing, because this sounds too much like forgiveness, too much like another second chance.\n“So yes, you’re going to be off duty for a few weeks while you heal, but I’m not going to stand in your way of coming back. I want you here, with us. We all do.”\nHe blinks up at Eddie, takes in the other man’s encouraging smile. “I—what?” He sits up, picks up the phone and holds it closer just in case he’s hearing wrong. “So you’re not… you’re not mad?”\n“No, I’m not mad. I’m worried, and a little upset that you didn’t tell anyone, but I think we all saw something was wrong. We just didn’t want to push. I’m glad Eddie finally did, sounds like you needed it.”\nBuck huffs out a laugh and glances over at Eddie as sweet, heady relief washes through him, meets warm brown eyes and feels a little more tension slip from his shoulders. “Yeah, I think I did.”\nThe rest of the phone call passes in a blur and Buck is left sitting in the middle of his bed, covers tangled around his waist and staring down at his phone, dark and silent in his lap.\nEddie’s hand squeezes his shoulder. “You ready to come have breakfast now?”\nBuck nods, doesn’t question it when Eddie’s hand drops down to grab his own, helps tug him off the bed then just doesn’t let go, leads him down the stairs and into the kitchen before pressing him up against one of the counters.\n“You ready to start believing we want you around?”\nBuck cracks a smile, feels a thousand pounds lighter as everything sinks in. He’s not losing his job. Bobby isn’t mad at him, doesn’t think he’s a failure. Eddie is still here, watching him patiently with a fond smile on his face.\n\nIt’s okay.\n\n“Keep looking at me like that and I just might.”\nEddie laughs and Buck feels himself flush, can’t help but wonder at the way Eddie’s eyes briefly flick down to his mouth before coming back up to meet his eyes.\n“I don’t think I know how else to look at you, querido. So I guess you’d better start believing.”\nHe gives Buck’s hand a final squeeze then steps away, turns back to the stove and starts cracking eggs into a bowl. Buck can only stare at his back, dumbfounded, watching the shifting of his muscles beneath his t-shirt and wondering how things have taken such a turn.\nLast night, he had been so caught up in his fears and the failures of his past that he’d almost let them overtake him, pull him under until he couldn’t see the light. But Eddie dragged him back to the surface, held him there even when Buck tried to push him away. And now, the older man is humming in his kitchen, dressed in a pair of Buck’s sweats that are dragging slightly on the floor.\nIt makes him feel so full he could burst, like if he opened his mouth he’d yell with all the sudden relief and happiness bubbling up inside. He still feels a little shaky, a little tired, and he knows the next few weeks are going to be rough, that the darkness and fears are going to come back and try to pull him under.\nBut for now, he’s okay.\nIt’s okay.\n\nIt’s okay.\n\n--\nOne week later and he’s sitting on Eddie’s couch, Christopher curled up to his side and snoring softly. They’ve just come back from dinner at Bobby’s, everyone there who didn’t have a shift, and Christopher is tuckered out. It felt amazing to be surrounded by his friends, to have them smile and joke and tell him to come back quickly, that they miss him. It felt like belonging, in a way he hardly ever feels outside the firehouse.\nHe’s still buzzing with it, and the feeling only grows when Eddie puts an arm around his shoulders, makes his whole body light up as they press together from shoulder to thigh.\nAnd when Eddie goes to put Christopher to bed once the show is over, meets Buck in the hallway and looks at him the way he had in Buck’s kitchen, the way he had a few weeks ago in this exact spot, Buck takes a step closer, lets Eddie grab his hips and reel him in.\n“You believing it yet?”\nBuck’s eyes flutter, a little lost in the heat of Eddie pressed all up along his front. “Hm?”\n“That we want you around,” Eddie says, one hand sneaking up under the fabric of Buck’s shirt. “That we want you here.” He leans up and presses a gentle kiss to Buck’s temple. “Because I do. Don’t know what I’d do without you, Buck.” \nBuck shudders at the words and lets his eyes slip shut, hands grabbing at Eddie’s biceps and pulling him closer, until those strong arms wrap around him and hold him close. It feels safe and warm and solid, like the ground has finally stopped shifting beneath his feet.\nEddie’s lips are warm against his cheek, beneath his jaw, and Buck stays motionless beneath them, soaks up each touch like a promise and tucks them away for later. When his eyes finally open, Eddie is already looking back at him. His thumb brushes over Buck’s bottom lip.\n“You okay?”\n“Yeah,” he breathes. “Yeah, I’m okay.”\n\nHe’s perfect.\n\n--\n "
}