{
    "id": "21881491",
    "url": "https://archiveofourown.org/works/21881491?view_full_work=true",
    "author": [
        "yeolinski"
    ],
    "title": "Marital Claims",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù",
        "Mo Dao Zu Shi",
        "魔道祖师 | Módào Zǔshī (Cartoon)"
    ],
    "relationships": [
        "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian"
    ],
    "characters": [],
    "additional_tags": [
        "Alternate Universe - Lawyers",
        "Established Relationship",
        "Marriage",
        "Married Life",
        "Accidental Marriage",
        "the juniors are interns",
        "nobody believes they're married basically",
        "Tags Are Hard"
    ],
    "language": "English",
    "series": "",
    "published": "2019-12-21",
    "completed": null,
    "words": "5,786",
    "chapters": "1/1",
    "comments": "529",
    "kudos": "20,303",
    "bookmarks": "3,816",
    "hits": "112,395",
    "summary": "<p>Nobody seemed to believe that they’re married, so they just went with the flow. For years.</p>",
    "notes": "<p>Ravie, I hope you like this, even though it's probably not exactly what you asked for...? :&gt; </p>\n<p>*this is un-beta'ed.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>💕uwu would love to hear any comments! </p>\n<p>If you wanna find me, I'm right <a href=\"https://twitter.com/yeolinski\" rel=\"nofollow\">here on twitter </a> uwu (tho I'm in other fandoms now too so, yeah!)</p>",
    "text": "They decide to tell everybody. \nThere’s no real reason to hide it, and they’re in the perfect age for marriage anyway, so neither of them makes a huge fuss about it. \nIt’s not a big deal.\nHe and Lan Wangji were working on a case together. One of those that really stays with you. Family of an abusive father was suing for insurance money from estranged children, because they weren’t a part of his life in the last couple of years. They hired lawyers from Beijing, and the entire thing was highly publicized because one of them was an online celebrity. They had to pull all-nighters for nearly a week with the amount of material they had to go through to find loopholes — and that sort of thing  bonds people. Even if they were at each other’s throats before, they had to put all their differences aside to work together… and somehow, it turned out they weren’t all that different after all. \nIt just sort of happened. And that sort of stuff was important to Lan Wangji, and Wei Wuxian agreed to give it a go; worst case scenario they’d get a clean divorce and each will keep the other’s assets. \nJiang Cheng is the first person they talk to, monday morning, after the papers come back from court, signed and sealed.\n“We got drunk last Saturday after winning the case — Lan Wangji is sort of wild when he’s drunk, who would’ve thought? So, we started to make out, and man, all I’m thinking is how good we are at this and how good he is with his tongue, and how big his dick is - and it’s huge dude, it’s the Eiffel Tower of dicks — no, the  Burj Khalifa  of dicks —” \n“Wei Ying,” Lan Wangji nudges, urging him to cut to the chase. \n“Yeah, I’m getting there, calm down, So we decided to get married, and this big guy—” He shoves a thumb back at Lan Wangji’s large chest; “— agrees. So we drive to one of those really sleazy marriage parlors downtown, and get married. And apparently, they’re legit. We got a certificate and everything.”\nJiang Cheng has his face in his hand, and his elbow on the counter, and he looks like he’s been bored with the story before Wei Wuxian even started talking. \n“So?”\n“So what?” \n“Where’s the punchline?” \n“What punchline, dude? I’m telling you I got married.” \nJiang Cheng looks between him and Lan Wangji, and seems like he’s generally done with the idea of Wei Wuxian existing; “Right.” He rolls his eyes, straightens, and collects his files to go back to his desk. \nWei Wuxian looks back to Lan Wangji, and Lan Wangji shrugs. \nMonday morning isn’t Jiang Cheng’s brightest hour, so they leave it be. \nThe next person they talk to is Lan Xichen, at lunch.\nWei Wuxian can tell that Lan Wangji is a bit nervous, so he does the talking for the both of him. \nHe’s at his desk, having his morning coffee, and he actually listens intently, which is already a huge improvement — and for propriety's sake, Wei Wuxian edits out the bit about how big Lan Wangji’s dick is, since it’s his brother, and all. He’s the senior managing partner in their office, and most of the cases go through him, but despite the menacing position, he’s an exceptionally easy person to talk with. \n“I’ve never been included in the office prankings before.” He says, when he realizes that Wei Wuxian finished talking, almost as if he, too, was waiting for a punchline. “This is kind of fun and exciting. Do want me to make an announcement to the rest of the crew later on, to make it seem more real…?” \n“No, we were kind of hoping to tell people on her own...” Wei Wuxian scratches his head. \n“Ge, this isn’t a prank—”  Lan Wangji is about to explain, but the phone rings, and Lan Xichen picks it up promptly. \nThey both look at each other, before Lan Wangji sighs, and says, much more quietly; “I’ll talk to him later.”\n“We said we should do it together, though.” \nLan Xichen puts his call on hold; “I really need to go through some documents with an associate, but don’t worry,” He winks at them; “I’m totally on board with this  marriage .” \nThey sort of file out of the room, a bit discouraged, and before Lan Wangji closes the door, his brother calls out for him, and says; “I’m really happy you’re finally making friends in the office.”\nLan Wangji nods sort of absently and closes the door. \nAnd thing is — nobody else believes them. Nobody in the office, nobody in Wei Wuxian’s circle of friends. \nWen Ning looks a bit insulted that Wei Wuxian would joke around with him like that. Wen Qing asks Lan Wangji why is he going along with Wei Wuxian’s bullshit. Nie Huaisung bursts into laughter. \nEven Yanli is oddly dismissive.\nShe sort of thinks it’s a joke, and when Wei Wuxian explains it isn’t, she holds onto his hand and says; “I’m sorry. This is my fault, isn’t it? I’ve been going on and on about how married life would suit you, Xian-xian. But you don’t have to feel pressured. You can do it on your own time. I don’t need you to bring fake boyfriends for my approval, okay?” \nAnd that’s it. \nThing is — they’re not in a rush. They have time. \nThey take things slow. And the entire thing is sort of under a huge question mark for both of them. They got married while drunk, so obviously this isn’t the ideal and who knows, maybe a few months from now, they’ll get bored with each other. \n \n.\n\n\n\nTheir law firm is among the busiest, and work is hectic; especially for junior associates, like the both of them. Most of the time they’re not working on the same cases, too. It’s hard to find time for a relationship in all of that, so it takes them a while to figure themselves out. \nThings they like, things they tolerate, things that are off the table. What makes the other shudder, like that sweet spot behind Lan Wangji’s ear. Or what turns the other on, like when Wei Wuxian wears Lan Wangji’s oversized shirt, because he forgot to bring a change of clothes, and came to his place straight from the office. \nSome things are more difficult for them; it’s hard to get used to the presence of another person in your life, and it’s hard to digest that it’s going to be there long term. But sometimes it’s too easy, because they  click together.\nIt always feels — new. Exciting and thrilling and toe-curling. It feels  right . And Wei Wuxian can’t picture himself doing anything else — or anybody else, that is — but this. \nThere’s also a bunch of bonuses that come along with it; Lan Wangji’s libido is much more active than anybody else Wei Wuxian was with, and that’s exactly up his alley. Plus, sneaking out for a quickie in the stairway during lunch, or a blowjob in the bathroom when the office is out for drinks. \nThe way Wei Wuxian sees it, doing it behind people’s backs tops regular sex (although sex with Lan Wangji is in no way regular, not in human terms, anyway), and as loving husband, Lan Wangji supports this theory (though, he never said it out loud, but seems to commit to it in practice). \nIn may, almost a year into their marriage, they finally find a good flat, close to the office, with enough space for them both, and the coziest master bedroom that has large windows that overlook the city. It’s perfect, and they’re both a little done with the migration between their apartments. So they buy it. \nBy that time, the popular opinion among their colleagues and friends is that Lan Wangji lost a bet to Wei Wuxian, and because he’s such an honorable young man, he keeps up to his word, even if it’s been over a year, and that Wei Wuxian,  that rascal , enjoys the running gag. \nThere’s actually an ongoing bet between the secretaries; every monday morning, they come up to ask Lan Wangji something casual, something that would confirm that he’s still married — and every single week, he politely declines the blind dates and group hook-ups, with the excuse of his marriage. \nEven them moving in together doesn’t raise question marks. People just assume it’s a coincidence that they’re both moving into a new apartment during the same time and that they had somehow decided to use it for their little joke. Har-har.\nJiang Yanli can’t come to their house warming party, because of the weather’s bad, and her flights have been canceled. Jiang Cheng is an absolute shit and cancels last minute because of a booty call. Nie Huaisang also cancels (Wei Wuxian is kind of sure that Jiang Cheng told him he has to buy an expensive housewarming present and the guy just couldn’t take the pressure). Wen Qing and Wen Ning are at their uncle’s funeral for the week.\nThe only one that does come over is Lan Xichen — he’s the one guest Lan Wangji invited, and when he comes over, he’s thrilled to see Wei Wuxian there. \n“You should also get a congratulation! I heard you got a new flat, as well.”\n“Well, actually,” Wei Wuxian starts saying, but then looks at Lan Wangji who snorts and shakes his head at him, placing a hand over his nape, reassuringly, and Wei Wuxian’s shoulders slump.\nHe’s right. It wouldn’t fucking matter, because nobody believes them at this point. \nHe’s sort of convinced that even if he’d bring any of those people over, and literally show them Lan Wangji’s closet which is next to his closet or point at any of Lan Wangji’s stuff, they’d say something frustrating, like; “Oh, Lan Wangji has something just like that!”\nThat night, after a vigorous apartment  christening , Wei Wuxian sits between Lan Wangji’s legs, as they lean back, enjoying the view, in their new shared apartment, on their new shared bed.  Wei Wuxian runs his finger in circles on his thighs, but somehow, he’s still able to tell there’s something wrong. \n“Are you upset none of your friends came to the housewarming…?” \n“Well, not really? It wasn’t anything official. Not an actual party. There will be other opportunities for them to come visit the house? Besides, we kinda had an awesome housewarming party ourselves, here.” He moves his hips a little, giving Lan Wangji’s crotch a nice reminder of that. \nHe chuckles in reply, nosing behind his ear. \n“I’m just frustrated…? Literally nobody knows that we’re married. The other day I overheard the new tech guy saying that you must hate my guts or something, for putting you through our ‘bet’ for as long as I did.” \n“I still have no idea where they’d get that ridiculous notion.” \nWei Wuxian hums, but then leans his head down, until it hits Lan Wangji’s chest, and he can look up to see his face; “Aren’t you upset about this? Your  brother doesn’t know that you’re married. He thinks I was here because we’re good friends. He deserves to know you were about to fuck me in the bathtub before he said he’ll drop by. I mean, not the specifics of it, obviously, but like — the fact that this is potentially what will be happening in your apartment from this day forth.” \nLan Wangji snorts, toying with fingers for a moment before interlacing them with his own. \n“I kind of like it.” He says, lifting his hand up and kissing the back of it.\n“What?” \n“The fact that we’re a secret. Not because of the thrill — but more for the fact that we get to keep this just for us. It’s something that belongs to the two of us, and isn’t shared with nobody else. Nobody gets to pry on it, and nobody judges it.”\n“That’s stupidly romantic, you know that?” Wei Wuxian leans up so he could pepper some kisses on his face. “I really love that.”\nLan Wangji hums, and captures his cheeks so he could have one proper, deep kiss.\n“I love you.” Wei Wuxian adds, when they part.\n“I love you, too.” Lan Wangji rubs their noses together, and Wei Wuxian adores that. \nThey’re not really handsy during the day, and Wei Wuxian is okay with that. Being professional and appropriate is important to Lan Wangji, he enjoys the respect and reputation of his peers and colleagues and wouldn’t want to mar it. Right now he’s known as a bit too stern and cold, so if they just started making out at work, everybody’s heads will probably explode. \nThey don’t know that at home, he’s a huge softie, and he likes cuddling and doing super sweet gestures, and it makes up for every single bad thing that had  ever happened to Wei Wuxian. \nWei Wuxian draws back suddenly; “Hey, you know where we didn’t have sex yet? The laundry room. Specifically, on top of the laundry machine. While it’s working. And I have  a lot of dirty laundry.”  \n“Patience,” Lan Wangji says, amused with him, his hands crawling over his waist. “We have all the time in the world.” \n \n.\n \nIn the autumn right before their third year of marriage, they get interns. \nThey’re both had been promoted senior associates, the company was expanding, and needed new blood. \nThis batch of interns was actually the weirdest one yet, because it was mostly family. Two of Lan Wangji’s distant cousins, who would flock around Lan Wangji like he’s mother hen. And Jin Ling, Yanli’s son. It was Wei Wuxian that convinced Lan Xichen to take him in (despite Jiang Cheng’s efforts). He finished university over a year ago, but was just sitting on his ass and partying with his friends until dawn. Yanli was worried for his future, and frankly, Wei Wuxian knew he just needed a push. \nWei Wuxian used to be his favorite uncle back when he was a kiddo, but nowadays, when easy money and carefree attitudes mattered most, it was Jiang Cheng, who always had a buck to spare. Which is exactly why Jiang Cheng didn’t want Jin Ling working there; at work, Jiang Cheng is a ruthless son of a bitch, that would literally throw sand into an opponent’s eyes to win a case. It also what made him a great lawyer; but probably the shittiest senior associate to work under, because his intern demands were extremely high. Last year, 3 of the 4 interns he got quit before the end of the internship. \nSo despite the fact that among the seniors, Wei Wuxian was the youngest, and only got his seniorship during spring — Jiang Cheng pushed the duty on him, saying he’s got too many cases to deal with brats. \nThat’s how Wei Wuxian and Lan Wangji got stuck with babysitting.\nThis was sort of the perfect timing for it, too. Because they were sort of, maybe, just a tiny bit exploring the possibility of  maybe having kids.\nWei Wuxian didn’t feel ready, frankly, and when Lan Wangji first started talking about it, a few months back,  he suggested they should get bunnies first. Or a cat. You know, fluffier, smaller things, that you can’t really fuck up psychologically because of your own fucked up childhood. \nAnd Lan Wangji didn’t want to push him.\nSo now they have 5 bunnies. \nAnd zero kids. \nBut handling the interns hadn’t been that horrible. In fact, it kind of turned Wei Wuxian on, how patient Lan Wangji can be with them. He can explain the same thing even seven times, each time just a tiny bit differently so that it can be understood. Wei Wuxian thinks they’ve learned more under his wing than they did back in law school.\nThey’re all sent to do their errands and tasks for the day, when Wei Wuxian sits on Lan Wangji’s table; “You’re good at this. At this parenting thing.” \nLan Wangji is just collecting files into a pile and gives him a long look. “This isn’t exactly parenting.” \n“Yes, but they’re all sort of struck in awe in front of you; both out of fear and adoration. It’s fascinating.” \nHe snorts and lands a kiss on his nose. “It’s you they adore. I heard them say you’re  cool .” \n“Why do you have to make it sound like it’s some sort of an insult?” He wraps his hands around his neck, half-laughing. “I’m always cool.” \n“I think you’re hot.” \n“Lan Wangji, are you making a pass at me?”\n“Why are you making it sound so scandalous?” He gives him a kiss on the lips, which Wei Wuxian is more than willing to reciprocate  — but it’s cut off by the sound of the door opening, a loud gasp, and the door slamming closed. \nWei Wuxian doesn’t even get a good looking at him — so he has no idea who it is, just that it’s definitely one of the interns. \nHe turns back to Lan Wangji, who gives him one more peck on the lips before going back to sorting some files. \n“Aren’t you — um — somebody just walked in?” \nLan Wangji lifts his gaze up and gives him a long look. \n“They saw us. Making out.” Wei Wuxian explains.\n“We’ve been married for almost 3 years now.” He deadpans. “Frankly, you’re a bit of an exhibitionist, I’m surprised that this happened only now.” \n“Ouch.” Wei Wuxian laughs, cringing because he knows it’s true. “Yeah, but... this is sort of… against the rules. Or something?” \n“It’s not. I checked. There’s no clause in the company’s guidelines that’s against employees dating or being married, as long as there’s no misconduct. And the person who entered should’ve knocked.” \nThey never actually had anybody really walk in on them. Wei Wuxian always thought that Lan Wangji wouldn’t want that, but they weren’t exactly being deliberately careful or anything. He never actually considered that he wouldn’t care, if it did happen. They also never had people who were actively in and out of their rooms, constantly following their every move, either.\n“I was under the impression you liked this being a secret.” \nHe considers that for a moment, then says; “When it comes to you I don’t want to force anything. Things just happen. I got used to it by now. Besides, I don’t mind if others know about our marriage.”\n“So — this is fine?” \nHe sighs, and draws him closer by the hand for another quick kiss; “Yes, this is fine.” \n\n\n\n.\n \nWei Wuxian sort of forgets all about it, until after lunch.\nLan Sizhui is finished with all his tasks way before the others. \nHe’s definitely one of the more capable of the interns, and isn’t afraid to work hard to earn his spot at the firm. Wei Wuxian tries his very best not to have favorites among the interns — but he did notice that Lan Wangji has been doting on him more than on the others, and he understands why. He’s exactly how he’d picture a younger Lan Wangji, perhaps a bit friendlier — which is why he’s so exceptionally fond of him.\nWei Wuxian dismisses him to go finish the research on the case he’s been working with Lan Wangji, but he lingers.\nHe looks up from the papers Sizhui handed him; “Is there something else?” \nHe swallows thickly, before finally blurting out; “Did you and Lan Wangji have a fight?”\nWei Wuxian rubs his head. He’s about to say ‘no’, but Sizhui continues before he can; “Because —” He pauses as if he needs a moment to collect himself; “We’re totally cool with it. I mean — it’s not like it’s a big deal. You really shouldn’t worry about us. We won’t tell anybody else.” \n“We?” Wei Wuxian snorts. Well, it’s to be expected. They’re all fresh of college and this is probably the most exciting thing that happened on their job. All they have to do is file paper work and research boring topics, and here are two of their managers, making out.\n“I promised not to tell.” He looks down. “Whose the one who walked in. It wasn’t me, but I made everybody swear that they won’t tell anybody.”  \n“That’s fine. You don’t have to do that. You can literally scream it on top of your lungs right in the middle of office.” He goes back to his papers; “Who knows, maybe they’ll believe it, if it comes from you.” He adds, though more to himself. \n“So — you are? Fighting, I mean.” \n“We’re not fighting. I mean, unless it’s a slang for—” Sizhui colors immediately. “Why would you think we had a fight?” \n“Before lunch, when we settled to go over the paperwork, you two seemed — contrary.” \n“Oh… that.” Wei Wuxian snorts, and waves his hand; “We have our professional differences.” He admits; “We’re lawyers, dude. If we agreed on everything and didn’t stand on our ground about it, then we’d be out of jobs. It’s natural.” \nHe looks immediately relieved. \n“You really shouldn’t worry about that, okay? And that goes for all of you — this isn’t a big deal. We’re not going to hold it against you — any of you.” He ruffles his hair. “You can go home earlier because you finished all your tasks, and we’re hella proud of you.”\n“Okay.” He nods, and takes his leave, clearly cheered up. \n \n.\n \nWei Wuxian kind of considers that the end of it, except it totally isn’t. \nOn monday, just like every other Monday, one of the secretaries makes her way to Lan Wangji when he’s not at his room, but in the shared space of the office, and asks him - very loudly - what he did over the weekend. When he says not much, she asks him if he had a hot date. \nThey actually did have a date; well, kinda. They reserved a place in the new restaurant that was opened down the street from their apartment, but they ended up not going, because Lan Wangji did that thing when he wears a black button-up and folds his sleeves. Gets Wei Wuxian going every single time. It’s just that he’s always wearing white or baby blue shirt to work — so when it’s black, it always shakes Wei Wuxian to the core. \nThen they ordered thai and watched re-runs of some crappy sci-fi show. Perfect date night.\nAnd Lan Wangji is about to answer her that he did have a hot date, with his husband, because that’s usually what he answers all the time, but before he can, Ouyang Zizhen, the one intern that wasn’t related to anybody in the office, speaks just as loudly; “Should you be asking this of your senior and superior? Lan Wangji didn’t finish his PhD in law to get asked about his love life at work.” \nThe secretary furrows his eyebrows, and Zizhen hugs his paper to himself. They’re roughly around the same age, but he does come off as exceptionally rude and condescending, even though Wei Wuxian considered him quite the meek type; “This sort of talk is unprofessional at work, and we have enough work to tend to.” He adds. \nLan Wangji nods absently, and goes back to reviewing the paper he was reviewing before. \nLater, during lunch in the cafeteria, Lan Xichen says that he’d love it if Lan Wangji would be less-work oriented, and maybe start a family, and Lan Jingyi tells him to “Stop being so nosy.” and “If you want a bunch of wailing, pooping babies, you can have your own and leave Lan Wangji out of it.” \nNeedless to say Lan Xichen takes it well, beacon of grace and manners, but he does get a weird tick in his eye.  \nWei Wuxian doesn’t think much about it, until he’s going over some case files with the interns before he’s about to dismiss them, and Jiang Cheng comes along, without knocking, and drops a huge pile of paper on Wei Wuxian’s desk. \n“I need those by tomorrow, and I’m swamped.” \n“I literally saw you playing angry birds at your desk this morning. You could’ve started on those then.” Wei Wuxian scolds, rummaging through the files. It’ll take him all night. He could potentially give this to the interns — he knows they’re probably exhausted as it is. And technically this is a case he’s been working with Jiang Cheng and kind of neglected since he started babysitting the interns.\n“You know that’s a part of my morning ritual.” Jiang Cheng says; “If I don’t kill some piggies, I won’t be able to do well in court.” \nWei Wuxian gives him a long look; “No, you do that because you drink your coffee while playing, and you have to poop by 9, because that’s when the hearings start. And playing while drinking coffee is before-you-poop ritual.” \nLan Jingyi sniggers, and Jiang Cheng sharply turns to him, which makes him straighten and pretend he didn’t even blink. \nJiang Cheng clears his throat. “Yeah, well, you’re adopted.” Is his brilliant comeback. Always hits right on the spot. \nWei Wuxian takes a long inhale; “Fine. Just go. We still need to go over some of the research.” \n“Uncle, is there nobody else that can do this instead of Uncle Wei Wuxian?” \n“Jin Ling, I told you not to refer to me as uncle at work.” Jiang Cheng reminds. “Here, I’m your superior.” \n“Yes — but still. Uncle Wei might have stuff he needs to do later, at home.” Jin Ling insists. “Stuff that you’re clearly not going to do.”\nJiang Cheng furrows his eyebrows; “What sort of stuff?” \n“All sorts of stuff! You can’t just land paperwork on somebody like that. And I know you’re definitely not busy after work, and it is  your paperwork.” \n“That’s alright, Jin Ling.” Wei Wuxian says, trying to settle down the dispute. “I’ve handled worse.”\n“I can be busy, too.” Jiang Cheng raises his voice slightly. “I do all sort of stuff at home. I have a life, too, you know?” \n“Uncle,  please , you’re so single you thought barebacking is a kind of sport.” \n“Isn’t it —?” He turns to Wei Wuxian to ask this, who shakes his head slowly, cringing that his nephew knows the term while his step-brother doesn’t. “What is it then? What else do you do with a bare back?”\n“Okay, how about we all just calm down—” Wei Wuxian raises his hands. \n“Point is you’re being totally inconsiderate toward Uncle Wei —” \n“Jin Ling—” \n“-- because he’s dating someone and you’re not, and you and everybody in the office are complete assholes about it, too, and —” \n“Who the hell is he dating?” \n“Lan Wangji!” Jin Ling explodes. Yeah, he was never one to keep a secret, anyway. Not that it was a secret. \n“Jin Ling!” Sizhui scolds, and Jin Ling settles finally, giving Wei Wuxian a long apologetic look. \n“Oh man, for a second there.” Jiang Cheng snorts;  “Stop fooling around with the interns — and teach them how to do some…  lawyering .” \n“Yes, that’s exactly what I’ll teach them. Lawyering. Because that’s a word.” \nJiang Cheng stops at the door, then bursts into laughter, shaking his head, before going out of the door. \nWei Wuxian rolls his eyes, but when he turns back to the interns, they are all sitting there, quite clearly upset. Jin Ling looks furious. \n“Okay, what is going on?” \nThey all start speaking over each other. \n“Everybody in this office are a bunch of cumbuckets, that’s what!” Lan Jingyi jumps up.\n“Why are you letting them step over you? This is clearly homophobic behaviour!” Ouyang Zizhen continues. \n“I checked — and there’s no rule against couples at work. I went through all the guidelines, so if you’re keeping this secret because of that there’s no reason to worry about it!” Lan Sizhui helps. \n“I’m going to tell mom that Uncle is being a total cunt about this, you just wait —” \n“Okay, enough!” He holds his hand up, and they all quiet down. “Jin Ling, your mom knows — I’ve told her many, many times. She thinks I’m just trying to reassure her that I’m not lonely — or something along the lines. And we know about the rules thing,” He turns to Sizhui briefly before moving to Jingyi; “And you can’t talk like that to your superiors. At least not to their face, okay? Lan Xichen was about to have an aneurysm in the cafeteria.” \n“Well, but they are.” Jingyi insists. \nFinally he turns to Zizhen; “Look, you guys. Me and Lan Wangji aren’t trying to hide ourselves and nor are we letting people step on us. They’re not trying to bully us. They just — don’t seem to realize that this is real.”\n“So you’re — hooked up? Officially?”  \nWei Wuxian snorts; “Oh, we’re hooked up, alright. We’ve been married for three years, now.”  Wei Wuxian shows them his ring finger, right on the inside of the finger — there’s a tiny tattoo of a blue-ish white cloud, along with Lan Wangji and Wei Wuxian initials, and the day they they got married in roman numerals. You can’t really see it, unless you’re looking for it, and it’s small and concealed, but it means the world to him. \nLan Wangji has the same — except his is in a red circle. \nIt seemed more fitting than a ring. A ring can be lost — and Wei Wuxian totally lost the ring Lan Wangji bought him that day they got drunk. Lan Wangji was kind of upset about it too, so Wei Wuxian suggested getting a tattoo, instead. Because a tattoo is forever. And Lan Wangji agreed.\nAll four of the interns look like this is the best thing to happen since pumpkin pie was invented. \n“And guys, we’re perfectly fine the way we are right now. We love our job, and we keep our private lives —  well , private. So just focus on your work and don’t let it bother you.” \nThey all nod absently, wide-eyed and dazzled expressions on their faces, but sit back and let Wei Wuxian finish what they started. \n\n\n\n.\n \nNext week already goes awry when Lan Wangji texts him that he got assigned with an external case. It’s a municipality contract, and he won’t be at the office as much. \nWithout Lan Wangji ordering them around, the interns have too much free time on their hands. \nWei Wuxian prefers not to give them needless tasks, either, and Lan Sizhui already wordlessly brings him his coffee, just how he likes it, so he can’t even send them out to get coffee. \nMostly, they’re just scratching their balls and playing PUBG on their phones while he’s trying to work. \nOn tuesday, there’s a large bouquet of flowers in the trash, and when Wei Wuxian makes note of it, Jin Ling hides it with his body, hands crossed on his chest. \nThere’s another bouquet the next day, but Jingyi claims it was from Sizhui, and that an older office lady wanted to get into his pants. Wei Wuxian doubts that, but lets it go.\nThey’re all huddling up together in corners, serious faces and wild hand gestures, and whenever Wei Wuxian asks what’s going on, there’s always a new excuse. \nOn thursday, Jingyi and Zizhuan are sitting in Wei Wuxian’s office in the midst of what seems to be a serious chocolate binge, when he comes in, mouths stuffed. He’s forced to send them home because they have stomach aches.\nWhen friday finally comes around, he and Lan Wangji are sitting in his room, having lunch together, for what seems to be the first time in a week, when he notices that Lan Wangji keeps looking at his watch and his phone, as if he’s waiting for a call or a text.\nWhen he lifts his head up to meet his eyes again, he finally says; “Delivery companies are incompetant.”\n“What are you having delivered?” \n“Flowers.” \n“To whom?” \n“To you.” \nWei Wuxian smiles; “Is this because our anniversary is coming up…? You know I hate flowers.” \n“I know.” He says; “But the point is that they had a big chocolate bunny between the flowers.” \n“Ah, yes. Speaking to me through my stomach, you’re truly the man of my dreams.” Wei Wuxian grins. “I’ve also prepared you a gift. But you’ll get to unwrap it on the day of the anniversary. In bed.” \nLan Wangji looks slightly perked up about that, but then he glances at his phone again, and looks troubled; “I’ve been wrapped up in this case — so I’m barely home. So I’ve been trying to send you gifts for a week now. But you haven’t gotten any of them, otherwise you would’ve said something. I even sent a whole chocolate-bunny bouquet the other day.” Lan Wangji stops talking, because they hear some loud noises from outside. \nBut Wei Wuxian bursts into a short laughter, and covers his face with one of his hands, leaning his head back onto his chair; “And let me guess, you didn’t sign your name on any of these.” \n“Yes, they were anonymous — but because of the bunny, I thought you’d be able to tell— ” There’s the sound of furniture moving, and a few gasps, so Lan Wangji furrows his eyebrows, wondering what’s happening outside. The door of Wei Wuxian’s office is closed, so there’s not much to see.  \n“I would’ve — but I never got any of that. The interns must have thought somebody that isn’t you  is sending me flowers and chocolates. They’re — all… weirdly pressed about the two of us. The other day I saw Jin Ling giving Jiang Cheng a whole lecture about accepting homosexuallity into his heart and —” \nThere’s mild chatter from outside again, but Lan Wangji can’t take it anymore, and stands up to see what’s the rackus all about. \nWei Wuxian follows him, naturally curious. \nRight outside there’s a delivery guy, looking worse for wear. Lan Jingyi is on the floor, holding onto his legs. Lan Sizhui and Jin Ling are coming up right behind him, but halt when they see Wei Wuxian and Lan Wangji at the door, both red from running. \nOuyang Zizhen attempts, albeit futilely, to hide the delivery guy, by starfishing in front of him. \nThe common office space is filled with curious faces, and all the secretaries went out of the break room to see what’s happening. \nWei Wuxian plucks out the chocolate bunny out of the flower bouquet the delivery guy was holding (some of the flowers were all rumpled and broken), and starts unwrapping it; “Nothing to see here! Just marriage-related business!” he says loudly before turning to Lan Wangji and announcing; “Is now a good time to mention that I’ve totally changed my mind about having kids?”"
}