{
    "id": "22011667",
    "url": "https://archiveofourown.org/works/22011667?view_full_work=true",
    "author": [
        "JaggedCliffs"
    ],
    "title": "Perfection is Overrated",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Avatar: The Last Airbender"
    ],
    "relationships": [],
    "characters": [
        "Zuko (Avatar)",
        "Iroh (Avatar)",
        "The Gaang (Avatar)"
    ],
    "additional_tags": [
        "Recovery",
        "Healing",
        "Implied/Referenced Abuse",
        "Assassination Attempt(s)",
        "Trauma",
        "Zuko (Avatar)-centric",
        "Zuko is an Awkward Turtleduck",
        "Original Character(s)",
        "Minor Original Character(s)",
        "Learning to be a good ruler",
        "Zuko bringing about an era of peace and kindness"
    ],
    "language": "English",
    "series": "Part 4 of Avatar Ficlets",
    "published": "2019-12-29",
    "completed": null,
    "words": "6,334",
    "chapters": "1/1",
    "comments": "498",
    "kudos": "17,852",
    "bookmarks": "4,488",
    "hits": "113,860",
    "summary": "<p>For his first thirteen years, Zuko was raised in a palace. And yet somehow, it's the three years outside the Fire Nation that seem to count more – at least to the palace staff, who act like he's been raised by fox-wolves.</p>\n<p>At first, this only annoys Zuko.</p>\n<p>Until he begins to think that the Fire Nation needs more than a formerly-banished prince.</p>",
    "notes": "<p>This fic is non-canon to the comics. I know the ending of the show implies that Iroh just stayed in Ba Sing Se as soon as he retook it for the Earth Kingdom, but I've sort of changed that here. And also homophobia doesn't exist in the A:tLA-verse because I said so. </p>\n<p>When I started writing this fic about a year ago, I thought I could get it out in a few months, tops. Then my first version needed major re-writing because it was too rambling and had no solid theme. Then my <i>second</i> version needed major re-writing because it was still too long and needed a tighter theme. Now here we are, and thanks to my wonderful beta-reader <a href=\"https://archiveofourown.org/users/Otterskin/pseuds/Otterskin\" rel=\"nofollow\">Otterskin</a>, I've hopefully managed to accomplish both and wrangle this fic into something better! </p>\n<p>(Writing fic from the perspective of a character who is canonically very bad at discerning other people's emotions and intentions, when the premise of my fic relies on discerning other people's emotions and intentions, was maybe not my best idea.)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "Zuko had grown up in a palace. For his first thirteen years, he had servants to cater to him and tutors to teach him proper court behaviour. He had access to the best clothes, foods, and goods that the Fire Nation and colonies had to offer. He had been treated like the royalty he was – at least by the servants, since his father made it clear early on to his tutors, his firebending masters, the court at large, and even visiting nobles that Zuko was continually out of favour.\nBut Zuko had still been raised as a prince, with all the court manners, training, and expectations that came with being royalty.\nFrom the way the palace staff act now that he's Fire Lord, Zuko figures he may as well have been raised by fox-wolves.\n \n. . .\n \nHe has a hundred different things to do today. A hundred, much, much more important things to do: send notices to the front to stop the war, figure out which ministers to hire, figure out which generals to fire, plan economic reforms, plan educational reforms, make sure the troops are actually retreating rather than starting any skirmishes...\nAnd have his coronation.\nAnd yet, before he can have his coronation, he has to be made “presentable.” Zuko hadn't thought it was necessary, he looks fine. But Uncle had insisted that Zuko look his best, and it is tradition, Nephew.\nFor Zuko to be made “presentable”, first all the servants that Azula had banished needed to be found. When that failed miserably, Zuko had to find ones who weren't plotting to overthrow or murder him. Well, actually Toph, Sokka, and Uncle found servants who weren't interested in overthrowing or murdering him, because Zuko was too busy trying to end a war and being yelled at by Katara to stay in bed and heal.\nZuko's sure that Aang isn't being forced through the same “presentable” ordeal. Unfortunately, Zuko doesn't think that argument will hold water with Uncle, nor with Zuko's two brand new, Uncle-recommended personal aides who are all but forcing him into the salon to begin his “presentable” routine.\nAs soon as Zuko walks through the door, the various attendants drop into deep bows, eyes glued to the floor. They do not move until, resigned, Zuko takes his place on the stool in the middle of the room. The tailors flock to his sides, the manicurist gingerly takes his right hand, the pedicurist kneels awkwardly at his feet, and the last two attendants mercifully leave him alone to prepare the water for his hair.\nZuko closes his eyes, and tries not to grit his teeth. He doesn't have time for this. He doesn't know if the troops are obeying him, or if there are still Ozai loyalists in the city, or if–\n“What have you been doing with your nails!”\nZuko's eyes fly open. The manicurist is gaping down at Zuko's hand as if Zuko's nails have been ripped bloody from their beds. The others have frozen, and there seems to be a collective intake of breath from every corner of the room. A second later, the manicurist goes white, drops Zuko's hand, and plunges into full kowtow, stammering out, “Not that – I deeply apologize, Your Majesty, you wouldn't – whatever you choose to do with your nails–”\n“No, uh, don't worry, it's fine,” Zuko tells him, more embarrassed than anything else. He hadn't thought it was that big a deal, and besides, his nails had been worse off the first time he returned to the Fire Nation – more ragged and uneven, a couple of them cracked. Hoping to coax the man out his bow, Zuko answers, “It's just from my time in the Earth Kingdom, and doing chores with my friends. Probably climbing up that cliff too,” he adds, remembering scrambling up the rocks on Ember Island as he chased after Aang.\nThe manicurist finally raises his head, coming to his knees. Giving the man what he hopes is a reassuring look, Zuko says, “Just...do what you can with them. They don't need to be perfect.”\nThe man only stares at him blankly. Zuko worries that maybe he shouldn't have mentioned his friends when one of those friends happens to be the Avatar. Should he have Toph question these attendants again?\nBut then the manicurist blinks and nods before returning to Zuko's nails with a file, a brush, and a determined expression.\nIt's not even five minutes later when one of the tailors comes to an abrupt halt.\nIrritated, Zuko looks down to where the head tailor is frowning at his chest, her tape only half-unrolled.\n“Yes?” he asks, doing his best to sound polite and aloof, rather than annoyed.\n“Your Majesty, far be it from me to judge, but...” The tailor's lips purse, and she looks up at him, then back at his midsection.\nHis midsection, and her hands pressed against his still-prominent ribs.\n“But you seem rather underweight,” she finishes. “When you were accompanying the Avatar and his companions–”\n“No, no, that wasn't Aang's fault, or my friends'.” Zuko won't give them any reason to resent Aang if he can help it. “They all split their food evenly with me. That's from months before I joined them, when I...when things were difficult. With the Earth Kingdom. I mean, in the Earth Kingdom.” He tries to avoid outright mentioning that time he was declared a traitor.\nThe head tailor frowns. Hesitantly, she asks, “Was General Iroh not able to provide adequately for you? Because the General doesn't look – he seems sufficiently well-fed–”\nAnger flares, and before he can think, Zuko snaps, “It wasn't Uncle's fault! First, we were on a raft in the middle of the ocean for three weeks with no food! And after that, we were on the run, neither of us had any food or money, and we didn't know how to hunt...” Zuko realizes that instead of defending Uncle, he's managed to make them both seem incompetent. “Besides, I was worse off when I left him for a couple weeks, and...” Oh great, now he's managed to make himself look stupid. “And Uncle did what he could for me,” he ends rather lamely.\nAfter a few seconds, the tailor says, “I see.” She looks at Zuko in what he thinks is mild worry. The pedicurist is sneaking a peek up at him through her bangs, and the rest attendants are probably ogling him at this point.\n“We were better off in Ba Sing Se. With jobs,” Zuko says stiffly, hoping to salvage some dignity from this conversation.\n“I see,” the tailor repeats, now taken aback. Zuko's pretty sure one of the other tailors gasped.\nThere's a painful silence. It remains painful even after the tailors resume their work. Thankfully, they only need a few more minutes to confirm his measurements against the ones from a few months ago, when Zuko first came back. Once they're finished, Zuko leaves the stool and sinks against the edge of the extravagant tub – carefully, so as to not aggravate his new scar – where his hair is going to be given the royal treatment. The manicurist and pedicurist follow him.\nThis time, it takes less than two minutes.\n“Prince – Fire Lord – Your Majesty,” one of hairdressers stutters out. Zuko twists his neck so he can see her with his good eye, and she bites her lip. “I'm sorry, but...it's just...” She shares a glance with her partner, then looks back down with fear, her eyes settling on the ground rather than Zuko's face. “I don't know if we can – usually, there are several treatments beforehand, to get the quality needed for a coronation ceremony, and your hair...”\nZuko closes his eyes. He breathes in. He breathes out. He opens his eyes to two petrified faces. “It's fine,” he says, in a voice that only mildly sounds like he's strangling a scream. “I understand. Do whatever you would normally do.”\nHe looks at the pedicurist and adds, “You too.” In case there's something less-than-royal about his feet as well.\nShe lets out a squeak and bobs her head up and down.\nIt takes another few seconds for the attendants to start moving again. He hears a little sigh from one of them, but can't tell if it's from relief, or if it's simply a silent comment on Zuko's appearance.\nZuko fixes his eyes on the ceiling, studiously avoiding the attendant's faces, and wishes Toph was here to sink him into the ground.\n \n. . .\n \nAfter being banished, Zuko learned to sleep pretty much anywhere – his ship's futon, the side of the road, a patch of grass, even the cramped little cupboard that looked like a sheet of panelling on Zhao's ship which Uncle had found so Zuko could sleep without fear of discovery.\nEvidently, “anywhere” doesn't extend to his new bed.\nIt's not his father's bed – Zuko's thinking of having that one burned – but the palace governance hadn't believed Zuko's old bed appropriate for the Fire Lord, especially as it had been Zuko's bed since he was just the second prince's first-born. They'd ordered a new one made posthaste: a decadent monstrosity that puts his old bed to shame.\nThe pillows feel like they're suffocating him, the sheets like they're strangling him, and the mattress like it's drowning him. It doesn't even hold a sense of familiarity like his old bed did. When he'd first returned to the Fire Nation and tried to sleep on a bed that he'd had for thirteen years but was suddenly too soft, he had tossed and turned and told himself this was home, this was what he'd fought for, this was what he wanted. This new bed, on the other hand, is just...empty.\nAbout a week after the bed was deposited in his chambers, Zuko gives into the impulse that he'd denied himself every night when he'd first come home. Grabbing the least offensive pillow and the lightest blanket, Zuko slips out of his Fire-Lord-appropriate bed and curls up on a rug on the floor.\nIt reminds him of the Western Air Temple, of the courtyard on Ember Island where he and his friends dragged their sleeping bags, of his and Uncle's little apartment in Ba Sing Se, even of his tiny stupid room on his tiny stupid ship.\nHe sleeps better on the ground than he ever had on that hideously soft bed.\nIn the morning, he's very careful to put everything back the way it was. For an extra touch, he ruffles the covers to make them seem slept in.\nHe tells himself it's only for one night. But of course, that's a lie.\nHe informs his personal servants that, like all firebenders, he rises at dawn, so he can wake himself in the morning. In fact, he'd rather not be disturbed at night unless it's for an absolute emergency.\nHe reasons that, at the very least, if any assassins come after him in the middle of the night, they'll probably go for the bed rather than the lump on the floor.\nZuko doesn't make it to his first midnight assassin.\nOnly few weeks after relocating to the rug, he's startled awake by the door bursting open. Three servants, all of whom fall to full kowtow after stepping foot in the room, yell at the ground that the Avatar has just arrived and he requests Zuko's presence immediately–\nThat's as far as they get before one of the servants raises his head and spots Zuko on the floor. Zuko, sitting up with his sheet rumpled around him, can only watch in resignation as the man's eyes grow wide, his hands fly up to his face, and he gasps out, “Fire Lord Zuko!” like he's discovered Zuko's mauled and mangled corpse.\nThe other servants break off mid-shout. Their heads shoot up as the two guards by the door rush in, hands and spears at the ready. As one, their eyes follow the servant's horrified gaze, and find Zuko.\nThe silence is heavier than Appa. Probably heavier than several Appas.\n“Um,” Zuko says.\nAll five servants and guards leap into action. A guard starts canvassing the room, one servant rushes halfway out the door, and the rest dash to Zuko's side.\n“Are you injured, Your Majesty?”\n“Shall we call more security?”\n“Are you sick, Your Majesty? Should I get the physicians?”\n“I can send for someone now–”\n“Here, lean on me, Your Majesty–”\n“No, stop–” Zuko ducks the hands reaching for him, turns the duck into a roll, and handsprings away to land on his feet halfway across the room. “I'm fine, I'm fine,” he tells them. “The bed...it's just...well I'm used to sleeping in rougher places...a lot rougher places...”\nHe manages to explain that he'd like his bed less soft. From the looks on their faces, he might as well have announced that he'd like to strangle several turtle-ducklings with his bare hands.\nConsidering his father, maybe the second request would sound more reasonable.\nBefore they can ask any more questions, Zuko yanks on a robe and swiftly makes his exit. No one actually told him where Aang is, but Zuko isn't going back in there for directions.\nAll in all, he thinks he would have preferred an assassin.\n \n. . .\n \nHe's walking down the hall with his personal aides, Chieko and Huang, when he stubs his toe and lets out a couple of the more common swears he'd heard bandied about his ship. Back then, Uncle had tried to keep the swearing to a minimum around Zuko, but it was a small boat, and the crew had been taken from the dregs of the navy. Between that and Zuko's temper, Uncle soon gave up and simply told Zuko to avoid repeating what he'd heard. That had failed quickly too.\nCompared to the sailors' customary swears, the ones Zuko uses now are fairly tame.\nAide Huang still stares at him like Zuko just insulted his entire ancestry. Aide Chieko gives him an appalled look that reminds him strongly of Mom or Uncle, before she abruptly seems to remember she's staring at the Fire Lord and not one of her own children and settles on a disapproving frown.\nZuko sputters something about the navy, captaining a ship for three years, and of course everyone knows sailors tend to swear a lot, and...so...yeah...\nHuang's aghast expression melds into something softer, which almost sets Zuko's nerves at ease. Almost, that is, until horror creeps across Chieko's face in a way that makes Zuko feel like he's committed a horrible mistake.\nZuko pretends not to notice them ducking their heads together and whispering when they think his back is turned.\nShould he have told them he knows sailors' swears? Should he be using different swears, for nobility? Or, no, wait, do royalty not swear at all? He was still too young for people to be swearing around him before he was banished, and he can't remember what his tutors said on the subject.\nHe should really ask Uncle. Or Mai. Or both. He'll ask both.\n \n. . .\n \nAs always, the palanquin bearers are insistent.\nThis time, Zuko has had enough.\n“I survived in the Earth Kingdom as an ancestors-damned fugitive, I think I can stroll down the street without a palanquin,” he all but yells at the bearers. He just wants to walk over to Mai's residence (it's untoward for her to live in the palace unless they're married), and then go into Caldera City proper, since sometimes the palace feels more stifling than his tiny ship was.\nThe palanquin will only make him feel suffocated. He thinks he will suffocate if he has to ride in it one more time. Because every time he rides in it...he doesn't like the feeling of literally being carried on other people's shoulders. It was normal to him growing up, but now, it makes every formal outing from the palace grating instead of relaxing.\nExcept maybe he shouldn't have been so loud, as not only are the palanquin bearers staring at him, but so is half his contingent of personal guards. And a couple of passing palace staff.\n“I'm sorry,” Zuko sighs, since he knows better than to shout at servants for doing their job. Especially a job he doesn't believe they should be doing in the first place. “Today, I will be content walking.”\nHe turns and strides past them, his guards hastily following. He's still close enough to hear the bearers muttering, catching the words, “what was that that,” “really say 'I'm sorry'?” and “damned fugitive?”\nWith a sick, sinking feeling in his stomach, Zuko realizes he should stop reminding people that he was declared a traitor to the Fire Nation. Twice.\n \n. . .\n \nHe wakes in the middle of the night.\n(He's not on the floor tonight – his monstrous, Fire-Lord-appropriate bed had been swapped with the one he'd had as a prince, and he's been making an effort to sleep in it most nights to please the staff.)\nHe's not sure why he's awake until there's something – a sound, a rush of air, the barest movement of shadow against shadow – and Zuko is rolling to the side a second before a jian swishes through the air and hits his pillow.\nFeather fill the air, bursting into flame as Zuko attacks. He springs off the bed, the feathers' firelight flickering and dying while he spins and dodges the sword, catching the attacker behind the knee with his heel–\nIt doesn't occur to Zuko that he should have called for the guards until two of them are already in the room, subduing the assassin before they can rise.\n“Traitor!” the assassin shouts as another two guards come to take her away. “Betrayer! Dirt-lover!”\nThey always shout things like that. Just like always, the assassin will be taken to the prison, where they will be questioned, given a trial, and then likely imprisoned for the rest of their days.\nIt's the fourth assassination attempt in five months. Zuko thinks he should be used to it by now.\nHe doesn't realize he's left his room until there's a guard in front of him, blocking his path.“Your Majesty, are you sure it's wise to leave?” Guard Liling asks.\n“I just need to...” Zuko doesn't know how to finish that sentence, beyond the burning need to not be here. So he wanders past her, down the corridor, vaguely aware of Guards Liling and Mistuo following at his heels.\nHe isn't sure where he wants to go, but he ends up in the kitchens, so he figures he'll make the best of it.\nThere's only a few people milling about at this hour. Zuko drifts past them to find a kettle. It's not until he's heating up the water, one hand absentmindedly on the kettle's side, that there's a gasp and the unfortunately familiar sound of people dropping to the floor, begging his leave for the mess, they weren't prepared, if His Majesty would like to–\nZuko runs his free hand down his face and waves at them to rise, don't worry, please just keep...doing whatever it is they were doing.\nHe needs to find tea leaves. And a pot. By the time he does, the water is boiling. Guard Liling's hand is on the kettle in Zuko's place. Which is good, because Zuko forgot about it when he went to find leaves.\nHe sets out measuring tea leaves, muttering Uncle's instructions about water-to-leaf ratios under his breath. Going through the motions reminds him of working in Ba Sing Se with Uncle – days he never thought he'd miss. He can't tell if it's soothing or not, but it's familiar in a way that assassination attempts shouldn't be.\nCup in hand, Zuko sinks to the ground there in the kitchen, in his sleepwear and robe, both of which are askew from the fight. He knows it's not “Fire-Lord-appropriate.” He can't muster up the energy for “Fire-Lord-appropriate.”\nAt some point, he looks up to find the kitchen staff watching him.\n“I'm sorry about the mess,” he says, and means it. “Do you want some tea?” he offers as an apology. He doesn't need the whole pot. He doesn't even need the cup. He just wanted to make it.\nThey probably don't need tea either, but they must think he's ordering them to drink, because they sit, politely, and Zuko pours until the pot is empty. Even his guards get a cup, standing at attention just behind Zuko.\nTheir little circle is as tense as a bowstring until one of the servants, an older woman with a nervous face, ventures, “Did you learn tea-making from your uncle, Your Majesty?”\n“Yes. Sort of.” Zuko frowns. “Mostly. It was at our job in Ba Sing Se.”\nThe servants around him startle, and there's a creak of armour as Guard Mitsuo moves suddenly. “Oh, that was real,” one of the servants says under his breath, a young man who is immediately and fearfully shushed by the young woman beside him. They both turn smiles on Zuko, wide and anxious.\nZuko just racks his mind for when he mentioned his job – and oh, his coronation day. It seems the rumour mill is alive and well in the palace.\nThis incident probably won't take long to spread, then.\nBreathing in the smell of tea, the faint scent reminding him of Uncle and only sharpening the ache in his chest, Zuko can't bring himself to care.\n \n. . .\n \nHe makes a mistake at a reception. His mind blanks, and he can't remember the proper title and greeting for a minor noble recently possessed of land, living on one of the outer islands. For some reason, all he can recall is a Ba Sing Se greeting between peasant and noble – and from the peasant side no less, which of course he can't do.\nSo he does nothing.\nAide Huang steps in immediately to cover for him, somehow correcting Zuko's blunder without drawing attention to it, before successfully distracting the noble and his affronted look with a charming comment.\nNeither Aide Huang nor Aide Chieko seem that bothered by Zuko's mistake as they lead him to the next knot of nobles. It's small. It's stupid. It shouldn't matter.\nBut it does.\nIt's the first time Zuko has screwed up like this in front of someone who isn't a servant, attendant, aide, or guard.\n Azula wouldn't have made the same mistake, Zuko thinks, trying not to let his embarrassment show.\n Give her three years in her asylum and see how many political niceties she remembers, a snide voice in his head thinks back.\nHe shuts that one up.\nHe knows he should listen to the first.\nBecause if he's comparing himself to Azula, he might not be the only one, despite her being only half-sane these days.\nHe knows he can't be the banished, traitor, raised-by-fox-wolves prince if he hopes to remain Fire Lord. Half the nobles barely tolerate him as it is, just for ending the war. To remain Fire Lord, he has to be perfect.\nExcept...he can't be.\nHe can read up on all the little diplomatic, courtly details that he either forgot or never learned. And he will. He can brush up on proper etiquette, memorize every single noble and governor and the rules for interacting with each of them. And he will.\nBut he can't stop reacting like he wasn't banished, like he wasn't a traitor or a refugee without a copper piece to his name.\nHe's not sure he wants to.\n \n. . .\n \n“...I just don't know if I can do it, Uncle,” Zuko says, pacing the little tea room that Zuko hazily remembers Uncle frequented after he returned from the siege of Ba Sing Se. “I mean, you were trained for this your whole life. Father didn't even plan on me being Fire Lord when I was actually first in line.”\n“I think you've done a fine job so far, Nephew,” Uncle says calmly, sipping the last of his tea from where he kneels at the little table. Zuko has only managed half a cup. “Even in my little shop, I hear patrons praise your wise rule.”\n“Maybe in the Earth Kingdom they do,” Zuko mutters, though he highly doubts Uncle heard anything of the sort. Someone likely once said they were happy they weren't at war anymore, and Uncle decided that was a close enough stretch to the truth.\n“You don't think the Fire Nation appreciates your decisions?”\n“I think the Fire Nation would appreciate a ruler who's competent. A ruler who remembers how to act like royalty! Father was probably teaching Azula political intrigue while I had to break into our own strongholds for information! Azula was rolling about in the newest line of tank while we were begging on the street! Uncle, if the nobles could choose–”\nThere's a noise outside the room. In an instant Zuko's at the door, hands at the ready, mind running through escape routes and the location of the nearest guards. Zuko flings open the door–\nIt's Tomi, one of Zuko's personal servants, wide-eyed and carrying a tray with a teapot and cups.\nDid he hear? The walls in this room are thin. And Zuko had been shouting.\nTomi kneels, face spirit-white, balancing the tray in front of him like a ward. “I-I'm so sorry, Your Majesty, b-but General Iroh requested another–”\nYeah, he'd definitely heard.\n“I understand,” Zuko sighs, wondering how long it will take these new revelations to circulate among the palace staff. He takes the tray from Tomi before gesturing for him to rise. Relief floods Tomi's face, like Zuko was going to yell at him, or fire him. Perhaps literally. “Thank-you for the tea.”\nUtter bafflement replaces the relief on Tomi's face. Zuko is too tired to figure out why.\nOne-handed, Zuko shuts the door. He deposits the tray next to the empty teapot and sinks down opposite Uncle. Dropping his head into his hands, Zuko digs his fingers into his scalp, pulling some of his hair loose from his topknot. He had set the flame crown aside earlier, so at least he doesn't need to worry about it falling out.\n“What am I going to do, Uncle?” His voice sounds small. “I don't think I can be the right sort of Fire Lord. I'm not...I'm just not good enough.”\n“Zuko.” Uncle reaches over, and puts his hand on Zuko's shoulder. “Every time I come here, I see a very determined, competent – yes, competent, don't make that face – and caring young man holding together a nation that, less than a year ago, was driven to conquer the world. If the nobles could choose, then yes, some would choose Ozai or Azula, and the war. But others, and not just the nobles, would choose you. You, and the peace you helped achieved.” Uncle smiles. “Never forget, you have your friends abroad to rely on, along with people here. And I– ” Uncle's smile falters for a moment, “–I will be here for you as much as I can.”\nThe warmth growing in Zuko's chest falters as well.\nZuko knows why Uncle can't stay here to help him. If Uncle stayed, both the Fire Nation and the Earth Kingdom would see Zuko as a puppet. It would mean the Fire Nation would never take Zuko seriously as a ruler and leader in his own right, believing him only Uncle's owl-catspaw. And as for the Earth Kingdom...\nUncle spent most of his adult life warring against the Earth Kingdom, leading from the front lines while Azulon led from the throne. If they thought Uncle was the true power behind the Fire Nation throne, half the Earth Kingdom would probably want to restart the war just on principle.\nZuko knows it's for the best if Uncle appears to be nothing more than a now-harmless old man running a tea shop, far away from the Fire Nation.\nThat doesn't make the separation any easier.\nAt least Uncle decided to increase his visits from once every two months to once every six weeks after the third assassination attempt.\nUncle removes his hand from Zuko's shoulder, and begins pouring tea from the new pot. “You need not do this alone, Nephew. And if you are lost, perhaps you should think on what type of Fire Lord you want to be, and what type of Fire Lord this nation needs.”\nZuko's heart sinks. “So you're saying what I want isn't what the Fire Nation needs?”\nUncle raises his eyebrows. “Oh no, not at all. I'm saying what you want to be, and what you need to be, may not be altogether as separate as some of our old traditions and attitudes may suggest.” Uncle pushes a cup of the new tea over to join Zuko's first cup, and takes a sip of his own. “Now,” he says, before Zuko can parse through his advice, “you wanted discuss how to best placate the governing house on Kirachu Island?”\n \n. . .\n \n“Your new bed is less soft, as requested, Your Majesty,” Aide Chieko declares as the four large servants who had moved the bed into room depart, heads bowed. Zuko's princely bed is gone, replaced by one that is Fire-Lord-appropriate-enough.\n“Thank-you.” Zuko is grateful, though he's still surreptitiously kneading the bed behind his back to test if the “less soft” is true.\nHe stops when, instead of leaving with the servants, Chieko says, “Your Majesty, I...”\nHer voice is hesitant. Chieko has never been hesitant.\n Zuko turns his full attention to her. “Yes, Aide Chieko?”\nChieko seems undecided for a moment, then carefully says, “My sister...when she came back from the front, she mentioned the same thing – that her bed was too soft. She said sometimes she didn't even have a bedroll to sleep on, during the war. Her husband was worried when she started sleeping on the floor.”\n Aside from some off-hand comments about her children, this is the most personal information Chieko has ever offered about her family. Zuko isn't sure how to respond, or what words she's looking for. “It's hard to adjust,” he settles on. “After...everything.”\nChieko nods. “She said something similar.”\n And Zuko wishes he was more suited to these kinds of conversations, because Chieko deserves someone who could set her mind at ease with the right words – like the kind Uncle would give, or Aang, or Katara. But all she has is Zuko. And the best Zuko can come up with, before the silence drags on too long, is, “Your sister...is she doing better now?”\n“As better as she can be. You probably know about that more than I do, Fire Lord Zuko.” A sad smile flits across her lips. “She's glad to be back home.” Chieko bows, much lower than required for this situation, as she leaves him for the night.\n \n. . .\n \nWith a guilty shuffle into the salon, Zuko presents his nails to Manicurist Kaori. Zuko had ended up hiring him and the other attendants from his pre-coronation preparation, mostly because once banished attendants had been found, they were reportedly quite reluctant to return to the palace. That had turned out to be a consistent sentiment among the banished servants and staff, and Zuko had decided to leave them be.\nHe knows that Attendants Ai and Hanan are having an easier time with his hair, especially now that it's grown quite a bit. Pedicurist Nuo doesn't have any complaints about his feet. And Manicurist Kaori...well, at least Kaori has stopped making distressed noises whenever Zuko comes to him. And Kaori's expressions are no longer appalled, but resigned.\nBesides, it's not like he needs to say anything about Zuko's – once again chipped and ragged – nails.\nZuko doesn't know how to explain that this time, he had to follow the assassin to the roof, even if it meant scaling the walls, and his nails need to stay short anyway to better practice with his swords–\nVoice quiet and abashed, Zuko just says, “Sorry. For making this harder.”\nKaori's eyes flicker from Zuko's nails to his face. His thinned lips unfurl into a grin as he takes out a file. “It's no trouble, Your Majesty. I would be out of the job if you stopped climbing up walls.”\nZuko thinks that might be a joke. Jokes are good.\nJokes mean that it's okay.\n \n. . .\n \nWhen Head Representative Chao of the palanquin bearers and a contingent of official bearers kneel before the throne (a new throne, like the one before Sozin's time, not the terrifying fire curtain one that's haunted too many of Zuko's nightmares), Zuko is worried that Chao is sick. He's pale, sweating, and looks like he might pass out right there on the throne room floor. Thankfully, it doesn't appear contagious, because none of the other bearers seem under the weather.\nZuko waits for Head Representative Chao and the rest of the men to rise before speaking. He begins announcing that he will phase out palanquins within a year...and that's as far as he gets, for Chao all but flattens himself against the floor and wails that whatever his men have done wrong to displease His Majesty, he apologizes, he takes full responsibility, please, punish him instead, his men have families, he's sure they can fix whatever is the matter, he knows His Majesty has been displeased with their performance for months–\nFinally shaking himself from his shock, Zuko interrupts. “Please, I'm not unhappy with your service. I simply do not enjoy riding in palanquins.” He scans the faces of the other bearers to see if they share Chao's distress, but they all look taken aback.\n “Then how can we ensure the palanquins are to your enjoyment, Your Majesty? I promise we can fix whatever you dislike,” Chao says, and Zuko recognizes the man's frantic desperation. He's felt it often enough, after all.\nHe doesn't want to know what his father or sister did when they disliked their palanquin-bearers' performance.\nZuko stands from the throne and walks toward Chao, who cringes. Zuko gently takes his hand, and pulls him to his feet. Chao seems confused, but Zuko does his best to look kind and nonthreatening – he knows it's difficult with the scar.\n“It's okay,” Zuko says.\nHe thinks he hears a “Told you,” muttered between the bearers, but can't tell from which man.\n At least this means Zuko can get to his second purpose for this meeting. To Chao, Zuko asks, “Can you and your men drive komodo-rhino carriages?”\n \n. . .\n \nIt takes Zuko a while longer to figure it out. He knows he's not good at these things. More than once, Azula has called him as dumb as a dead mouse-gerbil. Toph has said more kindly that, for a sighted person, he can be really blind.\nIt doesn't click when one of the tailor's apprentices, in the middle of fitting Zuko for a new robe, shyly informs him that she overheard Uncle Iroh telling the kitchen staff that he'd like Zuko to eat more. Nor when three of his regular servants ask about his “job” in Ba Sing Se, listening attentively as Zuko stumbles through a bare-bones explanation.\nZuko thinks something might be different when, one evening, as he's sitting at his desk with his face pressed into the wood and fingers digging into his scalp, Tomi walks in carrying his usual pot of tea. Zuko bolts upright, Tomi's eyes widen–\n– And Tomi smiles.\nTomi smiles, sympathetically, warmly, and brings Zuko's tea forward. “Perhaps you would like to take a break, Your Majesty? Or work on something else?” he says, kindly, not mockingly, not snidely. Not the way Azula would say it, or the way Zuko's tutors would when he was little and struggling.\nZuko starts noticing it more and more – the smiling. Smiling from servants, staff, attendants – and the not slimy-type smiles he sees from lords and ladies who he knows are working with Ozai-supporters, but he can't prove it. No, these are good smiles.\nHe's had more assassination attempts in eleven months than Ozai's reign and Azulon's last five years combined. And yet every single member of the palace staff seems...happy.\nStill, it's not until his friends drop by for the summer solstice celebration, and Sokka makes a comment about how it “feels so different here now,” that it finally hits Zuko.\nIt does feel different.\nServants haven't flinched when he's spoken to them in over half a year. Attendants began steadily meeting his eyes months ago. Staff members haven't dropped into bows when he's entered a room unexpectedly for weeks. Aide Chieko showed him some paintings of her children last month, and a week ago Aide Huang chattered quite floridly about his upcoming anniversary with his husband.\nThe whole palace feels better.\nZuko can't remember it feeling like this before. Not when Ozai was in power, nor when Azulon was still alive.\nHe's not even sure if servants were allowed to speak to royalty without good reason, or without being spoken to first. Or get away with not bowing when he entered a room. Or ask questions.\nZuko thinks it's well past time that changed.\n \n. . .\n \nIt's just over a year after the end of the war and, among the new hires in the staff, Zuko vaguely recognizes a few faces. He asks Head of Staff Qi where the new personnel came from. He doesn't think it comes off as casually as he intended, because she gives him a wink and one of the smiles that all the servants seem to have now, and lets him know that some of the old staff – the ones dismissed by Azula or who fled in the aftermath – have elected to come back.\n \n. . .\n \nWhen Zuko spoke of an era of peace and kindness, he didn't realize he needed to bring it into the Fire Nation palace itself.\n \n. . .\n \nZuko can't be perfect. He's never been perfect. He's only a banished, traitor, former-refugee, might-as-well-be-raised-by-fox-wolves Fire Lord.\nAnd maybe that's exactly what he needs to be."
}