{
    "id": "22094254",
    "url": "https://archiveofourown.org/works/22094254?view_full_work=true",
    "author": [
        "Ariaste"
    ],
    "title": "Besieged",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "陈情令 | The Untamed (TV)",
        "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù"
    ],
    "relationships": [
        "Lan Zhan | Lan Wangji/Wei Ying | Wei Wuxian",
        "Jin Ling | Jin Rulan/Lan Yuan | Lan Sizhui"
    ],
    "characters": [
        "Lan Zhan | Lan Wangji",
        "Wei Ying | Wei Wuxian",
        "Lan Yuan | Lan Sizhui",
        "Jin Ling | Jin Rulan"
    ],
    "additional_tags": [
        "companion fic",
        "not quite a sequel",
        "all the bits that Jin Ling missed",
        "WWX POV",
        "wei wuxian's avuncular powers",
        "Teenage Drama",
        "Humor",
        "let's interrogate LWJ's trauma",
        "Feelings",
        "Fluff",
        "WWX believes children are the future",
        "who DOES Sizhui take after?",
        "answer: Zewu-jun",
        "wangxian are so extremely married",
        "you thought you'd seen Married before",
        "this is maximum Married",
        "WangXian's Weird Flirting",
        "WWX's hunger for family"
    ],
    "language": "English",
    "series": "Part 2 of A Civil Combpaign",
    "published": "2020-01-03",
    "completed": null,
    "words": "11,370",
    "chapters": "1/1",
    "comments": "638",
    "kudos": "11,314",
    "bookmarks": "1,772",
    "hits": "70,654",
    "summary": "<p>\n<i>“Mn,” says Lan Zhan out of the blue one night. He has been playing guqin on the other side of the room without speaking for two hours, and Wei Wuxian has been noodling with some new ideas for talismans for nearly as long--one of those easy, quiet evenings of companionable silence, until Lan Zhan has thrown this enormous tantrum out of nowhere.</i>\n</p>\n<p> </p>\n<p> </p>\n<p>---</p>\n<p>(A companion fic to \"A Civil Combpaign\". Read that one first.)</p>",
    "notes": "<p>Jin Ling is an extremely unreliable narrator, actually, and he missed a LOT of what went on behind the scenes in \"A Civil Combpaign\". This fic fills in some gaps!</p>\n<p> </p>\n<p> <i>\"You don’t pay back your parents. You can’t. The debt you owe them gets collected by your children, who hand it down in turn. It’s a sort of entailment. Or if you don’t have children of the body, it’s left as a debt to your common humanity. [. . .] The family economy evades calculation in the gross planetary product. It’s the only deal I know where, when you give more than you get, you aren’t bankrupted -- but rather, vastly enriched.\"</i><br>--Lois McMaster Bujold, <u>A Civil Campaign</u></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Thank you for reading! Come chat with me!<br>twitter: @_alexrowland (where I am writing some good good original fantasy novels)<br>tumblr: @ariaste (where I am shitposting constantly)</p>",
    "text": "“Mn,” says Lan Zhan out of the blue one night. He has been playing guqin on the other side of the room without speaking for two hours, and Wei Wuxian has been noodling with some new ideas for talismans for nearly as long--one of those easy, quiet evenings of companionable silence, until Lan Zhan has thrown this enormous tantrum out of nowhere.\nWei Wuxian looks up in surprise. “What’s wrong?”\nLan Zhan is frowning, gazing down at the strings of his guqin. “A-Yuan is seventeen.”\nWei Wuxian doesn’t want to think about it. A-Yuan is, in fact, nearly eighteen. He does not mention this, just waves a hand dismissively. “It’s fine, we’ll just cut off his legs and then he’ll be little forever. Don’t worry about it.\"\n“Mn,” says Lan Zhan.\nThis is a problem which Wei Wuxian cannot solve, either for himself or for Lan Zhan, so he returns to his talisman, commenting only, “He’s a nice Lan boy, I’m sure he isn’t getting up to any more unseemly mischief on night hunts than you were at his age, despite my best efforts at the time.”\n“Mn,” says Lan Zhan.\n“He doesn’t even have a crush on anybody, so far as I can tell.” Wei Wuxian shakes the end of his brush like a scolding finger. “You work the children too hard. No free time for looking at other people their age. A-Yuan will grow up stunted and repressed if he doesn’t have a couple good heartbreaks when he’s young.”\n“Mn,” says Lan Zhan, plucking out a begrudging tune on the guqin.\n“It’s fine,” Wei Wuxian says. “It’s not like he’s going to be grown-up and married next week.”\n\n\n\n*\n\n\n\nNext week, Jin Ling shows up on the doorstep of Cloud Recesses in full panoply, with an entourage that includes Jiang Cheng at his shoulder, and says, “It’s about Lan Sizhui,” and it’s all Wei Wuxian can do not to crow with laughter. Jin Ling is a child. An infant. He has a pimple on his chin. He is going through a particularly gawky growth spurt and he looks like someone dressed an awkward baby horse in fantastically extravagant Jin robes. How in the world he convinced Jiang Cheng to come along on this mission is honestly beyond Wei Wuxian, but he needs no further explanation.\n“Is this what I think it is?” he can’t help saying, and he feels Lan Zhan beside him go stiff and outraged. \nWhen he storms off, Wei Wuxian lingers only long enough to smooth things over with Jin Ling and Jiang Cheng, and then to throw in a single parting tease so things aren’t too smooth, and then he runs after his husband.\nWei Wuxian is breathless with laughter when he catches up. “Okay, I know what I said last week--”\n“That boy,” Lan Zhan says.\n“I know. He’s like twelve.”\n“Sixteen.”\n“Basically the same as twelve. Who thinks of getting married at twelve? Who convinces their Uncle Jiang to come all the way from Lotus Pier for that? You know this wasn’t his idea. Jin Ling looked far too proud of himself.”\nLan Zhan stops striding forward and turns to face Wei Wuxian so sharply that Wei Wuxian almost runs into him. “What should we do?”\n“Wait for A-Yuan, for one,” Wei Wuxian says. “And in the meantime, you seem mad, so we should go back to the Jingshi and you should take it out on me, please.”\nLan Zhan pauses for only a heartbeat, then seizes him by the wrist in a bruising grip and and hauls him along.\nThe ferocity of the sex is matched only by the ferocity of the snuggling afterward, Lan Zhan wrapped around him with all his limbs like an octopus, as if he could take Wei Wuxian into his chest and hold him there.\n“Good boy, good boy,” Wei Wuxian croons to him, petting his arm with two fingers because that’s the only part of his body he is currently being allowed to move. Lan Zhan is still holding his hands and wrists, pinning him to immobility. “Less angry now?”\n“Not angry,” Lan Zhan mumbles against the back of his neck.\n“Seem a bit angry,” Wei Wuxian says philosophically.\nAfter a long moment, Lan Zhan says quietly, “No.”\nWei Wuxian tugs his arm to indicate he is not being held snugly enough, and Lan Zhan obligingly tightens all his limbs until it’s more like being held by a python than an octopus. “What, then? A filthy rich sect leader not good enough for our little A-Yuan?”\n“Of course he isn’t,” Lan Zhan says with a prim sniff.\n“That’s my nephew you’re talking about,” Wei Wuxian says. He’s getting drowsy, all warm and loose in the joints and well-loved like this. “He’s a twit, but he’s the only twit I’ve got.” He pokes Lan Zhan’s arm. “Why not-angry?”\n Lan Zhan doesn’t answer, only holds him even tighter, and Wei Wuxian feels suddenly very awake. \n“Lan Zhan,” he says, trying and failing to squirm around to face him. “A-Zhan. What’s the matter? Sad? Scared?”\n“Mn.”\n“Why? Why, why?”\n“Jiangs,” Lan Zhan says darkly. And then, with some effort: “Taking someone from me. Again.”\nWei Wuxian’s heart breaks in his chest and he uses all his strength to break out of Lan Zhan’s grip, purely so he can turn and engulf him in hugs. “I will throw them out myself,” he says, rubbing his face against Lan Zhan’s hair. “I will go now. I will chase them away. I will get the bunnies to nibble their feet off. Nephews don’t need feet, not really. Brothers definitely don’t.”\n“It is foolish.”\n“Who, me? Foolish? I’ve never been foolish a day in my life. You take that back.”\n“No. Me,” Lan Zhan says.\nWei Wuxian pushes himself up on his elbows to look at him. “You aren’t.”\n“I am. It is foolish to feel--this--about something that is so different than… before.”\nWei Wuxian puts his ear to Lan Zhan’s chest to listen to his heartbeat as he sometimes does when Lan Zhan is having trouble with his feelings like this. He cannot divine anything from it--what does a sad heartbeat sound like, and how is it different from an angry one, or a scared one? \n\"Also angry, though,\" Lan Zhan says, a minute later. The vibration of his voice through his chest rumbles against Wei Wuxian’s cheek. \"Jiangs.\"\n\"What's wrong with Jiangs?\"\n\"Wei Ying,\" he says, with a note of incredulity. \"They hurt you.\"\n\"What, when? Jiang Cheng on the cliff? That was sixteen years ago, let's forget about it.\"\n\"Never.\"\nWei Wuxian sighs. Marriage, he supposes, is about compromise.\n\"Jin Rulan too,\" Lan Zhan adds. \"He stabbed you.\"\nWei Wuxian scoffs. \"Little kitten stab. I've gotten worse just stubbing my toe. He's a baby.\"\n\"He should apologize.\"\n\"I don't need infants to apologize to me.\"\n\"I do,\" Lan Zhan mutters. \"To me.\"\nWei Wuxian kisses him right over his heart. \"Do you think A-Yuan likes him? I really can’t tell.\" The problem is that that kid likes everybody, opens his whole heart to the world. He’d let a kindly stranger he’d known for five minutes call him A-Yuan. That is, as far as Wei Wuxian can tell, roughly how long it took Wen Ning to get the privilege. \n\"Does not matter. I will not allow it.\"\n\"What, really?\" Wei Wuxian lifts his head again. \"What if he wants to?” \nLan Zhan has set his jaw in a stubborn way that makes Wei Wuxian's heart melt. \"It is forbidden to marry Jiangs in the Cloud Recesses,\" he says, which is an attempt so good that Wei Wuxian laughs until he's blue in the face. \n\"Aren't I as much of a Jiang as Jin Ling is?\" he says, wiping tears from his eyes. \"I'm sure your uncle would be delighted to institute such a law immediately. Make it retroactive, why not!\"\nLan Zhan bites him on the arm in retribution. \"I need no rule,\" he says. \"That boy can marry A-Yuan over my dead body.\"\n\"So forceful, Hanguang-jun!\" Wei Wuxian says. \"What if A-Yuan wants to elope with him?\"\n\"A-Yuan is a good boy,\" Lan Zhan says, but he sounds a little uncertain. Then, decisively: \"I will lock him up here in the Jingshi.\"\n\"You never lock me up in the Jingshi,\" Wei Wuxian says, pouting.\n\"I will lock you up together.\"\n\"It's going to make our everyday a bit inconvenient,\" Wei Wuxian says thoughtfully. \"We’ll have to make do with silent quickies while he's in the bath.\"\nLan Zhan frowns for a long moment. \"I will think of something.\"\n\"You could just let him get married if he decides he wants to.”\n\"He is welcome to marry anyone he wants, except that boy.\"\nWei Wuxian hums and flops his whole weight on top of Lan Zhan like a human blanket, lets himself be squeezed tight while Lan Zhan frets himself to sleep.\n \n*\n\n\n\nWei Wuxian has witnessed many embarrassing disasters in his life, but this one is certainly amongst the top ten.\nWhile he’s still laughing helplessly over the mental image of his brother giving their nephew advice about wooing people (which apparently consisted entirely of “combs good”), said nephew makes a valiant effort at an honorable retreat from the field, and said brother throws his hands in the air and storms off in the opposite direction. Lan Zhan and A-Yuan drag each other into the library, the nearest ostensibly-private space, to debrief. \nWei Wuxian follows them--A-Yuan is startled and confused, and Lan Zhan is stormy and territorial, and as cute as the lock-you-both-up-in-the-Jingshi scheme had been, Wei Wuxian thinks it would be less fun in practice: A-Yuan needs to be allowed to run free with the bunnies, and Wei Wuxian only really wants to be locked up in the Jingshi if it is for a sex thing.\n\"What just happened?\" A-Yuan says desperately. \"Why did he--oh gods, I didn't even know he--oh, why did he say it in front of everyone--\"\nLan Zhan, seeing that A-Yuan is apparently in no danger of running off with that boy, relaxes a thousand degrees, by Wei Wuxian's estimation, which means he's only about three thousand degrees away from comfortable. \"You need not ever see him again,\" Lan Zhan says. \"We will tell him to leave.\"\n\"He's my friend!\" A-Yuan wails. \"Is he in love with me? I didn't even know!\"\n\"Hm,\" says Wei Wuxian. They'd been so fixed on thinking of A-Yuan that he hadn't thought of where Jin Ling might be coming from. \"Do you think he might be? Not counting his mother, he comes from a long and noble line of morons. Could you have missed any other signs besides the comb?\"\nLan Zhan's stress levels ratchet back up before Wei Wuxian's very eyes.\n“Combs,” says A-Yuan miserably. “Two. The first one was--too much. I told him it was too much, he agreed it was too much--he was going to take it back and throw it away. And then he gave me--that silver one? I wore it last week, do you remember?”\n“Vaguely,” says Wei Wuxian. “What was the one that was too much made of?”\n“Um,” says A-Yuan. “Gold?” \nLan Zhan makes a murder noise in his throat.\n“He said it was because he respected me as a cultivator! I thought he was being friendly.\" His voice cracks on tears. \"I suppose we aren't friends anymore after this, are we.”\n“Let’s not be hasty,” says Wei Wuxian, who is beginning to find all this drama and despair contagious. It’s giving him hives, watching all this elegant Lan despondency. They do not need him for this. What they need is for him to be the sensible one right now. Come to that, Jin Ling is hiding somewhere and probably in desperate need of a sensible one of his own. A-Yuan and Lan Zhan have each other; Jin Ling has… no one, and Wei Wuxian cannot let that happen. \nSo he says, “How about both of you stay here and read some nice calming books, and I’ll go see if I can figure out what on earth Jin Ling thought he was doing.”\n\n\n\n*\n\n\n\nSome nonsense, as it turns out. \nWei Wuxian comes back into the library an hour or so later, feeling thoughtful and not wholly sure of what he’s just heard and seen. \n“Well?” Lan Zhan says immediately. He is sitting exactly where Wei Wuxian left him--on a cushion, back straight, hands on his knees. A-Yuan is still pacing. \n“Not to worry, everyone,” Wei Wuxian says. “No harm done, no hearts broken.”\n“He’s not offended?” A-Yuan asks. He’s bitten his thumbnail to shreds, and his forehead is all knotted up with worry.\n“Not at all. He’s embarrassed, of course, but he’s handling it quite well.”\n“No hearts broken, you say. Why not?” Lan Zhan asks suddenly.\n“Um,” says Wei Wuxian, who hadn’t really planned on telling them details like that. “Seems he got it into his little fool head that A-Yuan would be a good political match for him, that’s all.”\nLan Zhan’s stress ratchets up another thousand degrees. Wei Wuxian mentally sighs to himself.\n“I… Oh,” says A-Yuan, confused and quiet. “Should we--I mean, I can see where he’s coming from--”\n“Hey,” Wei Wuxian says sharply, because he likes his husband not being dead of an apoplexy. “You can do better. Don’t worry about him.”\n“Will it--we’re supposed to be allies with Lanling Jin, do you think this will ruin--” \n“No,” Wei Wuxian says firmly. “It won’t ruin anything. Listen, your other father is too good to say it, so I will: You’re forbidden from marrying someone just for the politics. In fact, I hear it is forbidden in the Cloud Recesses to marry anybody unless you have ridiculous, frivolous reasons to do so, like being wildly in love with them and not being able to live a day without them.”\n“That’s not a rule,” Lan Zhan says crisply, because he has to. “But… it might be recommended.”\nA-Yuan chews his lip and looks down. “He’s not angry with me? You’re sure?”\n“Very sure,” says Wei Wuxian. “It’ll just be a bit weird for a little while, but that’s to be expected. And anyway, if he’s an asshole about it, you probably don’t want to be friends with him anyway.”\n\n\n\n*\n\n\n\n“Did you mean it?” Lan Zhan says that night, once more wrapped firmly around Wei Wuxian’s entire body, though his grip isn’t nearly as suffocating as it had been before. It helps that there aren’t any Jiangs in his house anymore, Wei Wuxian thinks.\n“Mean what? I say a lot of things.”\n“Forbidding A-Yuan from marrying for politics.”\n“I absolutely meant it,” Wei Wuxian says firmly. He turns to face Lan Zhan and looks him dead in the eye. “And moreover… Lan Wangji, Hanguang-jun, hear this oath: I, Wei Wuxian, swear to you that I will never encourage Lan Sizhui to marry anybody unless I am absolutely certain that they love him. You hear me? Certain.”\n“Certain,” Lan Zhan echoes. “I hear you.”\nQuiet and intense, Wei Wuxian says: “If we get to have this, then so does he.” It is a foundation that the world is built on, as much as their youthful oaths to defend the weak and live without regrets, and just as important. A-Yuan has been loved to bits his whole life as far as Wei Wuxian can tell, and he’s not about to let that trend stop anytime soon. “He gets this too, and not a whit less than this.”\nLan Zhan releases his breath and nods, and pushes closer so his face is buried in Wei Wuxian’s hair.\nWei Wuxian pets him and murmurs soft nonsense to him, but in the innermost depths of his mind… he wonders. He just wonders, a little, if everything Jin Ling told him was true and accurate, and he wonders what exactly was said in that letter that he gave A-Yuan, and he resolves to watch, and to keep wondering.\n\n\n\n*\n\n\n\nHe doesn’t have to wonder about the letter for long, because A-Yuan brings it the next day, puts it down silently in front of him, and sits back with his hands in his lap and his back very straight. In this moment, and often in other moments, he takes so much after Lan Zhan that it makes Wei Wuxian’s heart sting in a complicated way--on one hand, the throb of joy as he recognizes the influence of the person he loves so fiercely, like the faint echo of a favorite song. On the other hand, a thread of regret--he’ll never know A-Yuan like Lan Zhan does. He missed too much. The boy’s nearly grown, closer to eighteen than seventeen, and probably long past the days when he could have inherited anything from Wei Wuxian except what shows in little flashes here and there. No, he’s Lan to his bones now, and Wei Wuxian can’t bring himself to feel more sorrow over it than that single thread.\nAll of A-Yuan’s capacity for Lan Zhan’s poise and reserve is being exercised to the fullest today. He must be feeling very off-balance, still, if he is so strongly modeling himself on a projection of calm and stability. It is the same thing that Lan Zhan does when he is uncomfortable, and it’s no more true for Lan Zhan than it is for A-Yuan in this moment. \nWei Wuxian wonders, and feels a little shy and awkward for wondering, why A-Yuan bothered coming to him, rather than to Lan Zhan.\nHe opens the letter, reads it. It seems normal. It’s written in a neat hand with no evidence of tremor, in clean, clear language. More restrained and mature than Wei Wuxian would have given Jin Ling credit for--he’s a little impressed. “What’s wrong with it?” \nA-Yuan silently points to one edge of the paper. Wei Wuxian has to hold it up to the light and squint to see the words--he might have missed them entirely if A-Yuan hadn’t pointed them out.\n\nI hope we’re still friends.\n\nAh, damn. There’s some feelings involved after all. A little heartbreak, at least, a very little one. Wei Wuxian had thought he’d spotted something, but he’s so acclimated to reading Lan Zhan’s emotions from the subtlest, smallest signs that Jin Ling’s were a fireworks display by comparison. Wei Wuxian had been left with no impression other than big and bright and loud.  \nWei Wuxian wonders, suddenly, what Jiang Cheng said to him after they’d left. Probably shouted and scolded the boy, if Wei Wuxian were to place a wager on it, probably made him feel… No. No, the kid would be making himself feel bad all on his own. A, anything Jiang Cheng could say wouldn’t even scratch the surface. Wei Wuxian knows that feeling too well. \nDamn, the kid really needs an uncle around. Perhaps Wei Wuxian could go visit him, just to check and see how he's doing. \nTo A-Yuan, he says, \"Good that he wants to be friends, isn’t it?” \n“Yes, but…” A-Yuan still looks unhappy.\n“Oi.” Wei Wuxian snaps his fingers at him. He does not know why A-Yuan came to him instead of Lan Zhan, but he can deduce that it’s because A-Yuan thinks he will do or say something that Lan Zhan won’t. He is, therefore, determined to do it or say it, whatever it is. He’ll just throw himself at the problem and it will resolve itself. “Be less of a Lan right now. Tell me what you want so I can go ransack the world to find it.”\nA-Yuan puts his face in his hands. “I don’t know. I’m confused.”\n“Why? Be friends with him  or not. It’s not spoiling anything.”\n“I keep… thinking about it.”\n“About…?”\n“About how I didn’t,” A-Yuan says slowly, “actually say no to him.” He winces and gives Wei Wuxian big puppy eyes. “Don’t tell Hanguang-jun? I know he’s unhappy about it.”\nInteresting. Extremely interesting. That explains why he’s here, then--he wants advice, and he doesn’t want to upset Lan Zhan. “You want to marry Jin Ling?” \n“I don’t know. I don’t… not want to marry him.”\n“Do you like him?”\n“I don’t know.”\nWei Wuxian loves two people more than anyone else in all the world, and right now he wants to strangle the one that’s in front of him. Lans! Get them to make a decision and they’ll make the shit out of it; before that, they tangle themselves up in rules and the nonsense in their heads. “Better figure it out, then. Get more information. Hunt it down like a fierce corpse.”\nWhich is very good advice, Wei Wuxian thinks, and he is so proud of it that he decides to take it for himself as well.\nHe leans forward and pats A-Yuan’s hand. The only other thing he knows how to do is to tease, pushing someone out of their worry until they laugh or smack him or both. So he says: “The bookshop in Caiyi Town will sell you pornography if you need ideas. Let me know if you need help making covers for them.”\nA-Yuan abruptly changes his allegiance to whom he takes after when he says, without missing a beat: “All your fake covers look like garbage.” \nIt’s one of those little occasional flashes of Wei Wuxian himself, and once again it makes his heart catch in his chest with surprised glee. Wei Wuxian knows this song, though--he scolds him roundly for impertinence, threatens to plant him in a hole in the ground again until A-Yuan’s melancholy breaks on a laugh and he runs out of the room, Wei Wuxian close on his heels and shaking his finger and calling him all the rude names that mean I love you.\n\n\n\n*\n\n\n\nWei Wuxian mulls over the decision as to whether or not this whole situation is any of his business, decides that it definitely is his business (most things in this world are), mentally rolls up his sleeves, and starts playing the game.\nHe’s not even entirely sure which game he’s playing, or whose side he’s on, or what his goal is--even after he visits Jin Ling and gets him all drunk and adorable. Once Jin Ling falls over asleep, Wei Wuxian rolls him up in a blanket like a giant dumpling and leaves him to sleep on the floor.\nHe watches. He waits. He is thrilled and fascinated when Sizhui gets a letter from Jin Ling, and the part of his heart that is reserved solely for his A-Yuan is sharply comforted to see his son’s tension and worry slump out of him all at once, replaced by the simple joy and relief of knowing that he hasn’t lost a friend. Wei Wuxian had words of advice for Jin Ling, but he doesn’t think that Sizhui needs any more--he’s a hard worker, determined, and besides that he is a Lan: He loves Jin Ling as friends at the very least, and Wei Wuxian has never known a Lan to change their mind when it comes to that sort of thing.\nSizhui has dinner with them in the Jingshi that night, the day the letter comes, and he chatters about it the entire time with a very un-Lannish effusiveness, despite Lan Zhan’s pointed reminders that it is forbidden to speak during meals. Sizhui shows Wei Wuxian the flawed illumination talisman that Jin Ling has sent along, interrogates him about them until Wei Wuxian’s head aches, and runs off to write a letter in response instead of lingering until dusk fades, as he usually does.\nWei Wuxian watches him go with an aching fondness, a bouncing trail of dark hair and white robes and ribbon like a moth fluttering through the gathering dark, and then he turns to Lan Zhan. “That kid’s pretty cute.”\n“Yes.”\n“Lan Zhan did a good job raising him.”\nLan Zhan’s expression is soft and pleased. “When he came to me, he was good already. I did very little.”\nWei Wuxian leans back on his hands and stretches out his leg to poke Lan Zhan’s ankle with his toes. “Jin Ling’s not the last suitor we’re going to see, you know.”\n“To be expected,” Lan Zhan says, rueful. “We cannot cut off A-Yuan’s legs to keep him little forever.”\n“No,” Wei Wuxian agrees with a sigh. But… This little game he’s playing with himself is getting more interesting by the day. He’s kept quiet about his investment in it so far, knowing that it will only make Lan Zhan stressed, but playing a game all on his own is boring. Lan Zhan is his favorite person to play games with. So he says, speculative, “Hey. Hey, Lan-er-gege. Wanna make a bet?”\nLan Zhan quirks an eyebrow at him, stacking the bowls of dinner onto the tray for the servants to remove.\n“I bet,” Wei Wuxian says, slow and dramatic, “that we haven’t seen the last of Jin Ling, either.”\nLan Zhan’s expression tightens.\n“No, no, hear me out,” Wei Wuxian says.\n“No,” Lan Zhan says. “I will not make wagers on my son’s personal life.”\n“That’s a very uncharitable way of looking at it,” Wei Wuxian says primly. “We’re not wagering on A-Yuan at all. We’re just wagering on… Jin Ling trying a new tactic. Just for fun. Let’s say I win five talents if he comes back.”\n“And if he doesn’t come back?”\n“Then you can celebrate by tearing off my clothes and having your wicked way with my helpless body,” Wei Wuxian purrs, running his toes up the Lan Zhan’s shin. \nLan Zhan’s fingers wrap around his ankle--not pushing him away, just holding him, like he’d hold Wei Wuxian’s wrists to pin him. “I can do that anyway.”\n“And I can take five talents from you whenever I like too,” Wei Wuxian retorts. “That’s why it’s harmless fun.” He flutters his eyelashes. “Unless Hanguang-jun wants me to earn my pocket money tonight?”\nHanguang-jun did want him to earn his pocket money, as it turned out.\n\n\n\n*\n\n\n\nNothing happens for a few weeks, but Wei Wuxian keeps thinking about Sizhui, and about the inevitable horde of suitors who will inevitably descend upon the Cloud Recesses--boys, girls, whoever gets around to spotting Sizhui and thinking, as Jin Ling did, what a fine partner he’d make for them. Jin Ling wasn’t wrong when he said that Sizhui would be a good political match for him. He’d be a good match for anyone--so far, it’s looking pretty damn likely that Sizhui’s going to be the heir to the whole sect, unless Zewu-jun comes out of seclusion and produces an heir of his own.\nBut Wei Wuxian knows Lans. He knows the Twin Jades, specifically. He knows the odds of that happening, and it puts a soft, tender ache in his heart. No--it’ll be Sizhui, in all likelihood.\nWei Wuxian thinks about Jin Ling, too. For all his bluster and teenage arrogance, he’s a good kid. Wei Wuxian can see so much of Shijie in him now that he knows him a little better. He has all the best parts of her: her protectiveness, her fierce caring, her warmth like spring sunshine.\nWei Wuxian thinks, and thinks, and thinks, and bides his time, waiting for the game to progress until his turn comes around again, and in the meantime he models some Lan discipline himself and gathers knowledge like sheaves of wheat. Quietly, so that no one notices, he starts taking inventory.\nHe starts with the Jin sect, just out of curiosity. He maps out Jin Ling’s pedigree through six generations, uses cunning and wiles to compile a fairly comprehensive dossier of the Jin assets and territories. He does the same thing for a handful of the other sects too, picking a few of their heirs and running simulations in his head about how it might play out if one of them were to come courting.\nHe does it for the Lan sect too, as if he is an outsider, just to see how much information he can gather on them. For example, based on a few soil tests and local gossip, he’s fairly sure there’s silver in the hills around Qian’s Spring, one of Gusu’s minor villages, near the border to Jin Ling’s territories. \nThese sort of bits of trivia may be useful in marriage negotiations one day, and they are intriguing now. It’s an interesting thought experiment, and he’s fairly certain that the heaps of facts that he gathers about the clans still only scratch the surface of what Jin Guangyao had likely known, but Wei Wuxian is only a hobbyist. He is not looking to become matchmaker to the clans. He has A-Yuan, and he has his nephew, and he will see them both marry well, even if he has to break a sweat to do it.\n\n\n\n* \n\n\n\nAnd then one morning Wei Wuxian wakes up, naked and delightfully sore from the previous night and early this morning, to a frantic knocking at his front door and a plaintive little voice calling for him.\nIn his bleary, barely-conscious state, he thinks it’s A-Yuan at first, but--no, A-Yuan doesn’t knock like that.\n“Whozit?” he calls.\n“Jin Ling!”\nInteresting. Very, very, very interesting. Wei Wuxian pushes himself up, blinking and squinting at the door, and ponders to himself that he probably just won five talents off Lan Zhan. \nHe lets Jin Ling in.\nWei Wuxian is terribly fond of his nephew, but he has little patience in the mornings, and if Jin Ling has come all this way just to have a teenage meltdown at eight o’clock in the fucking morning, then he can damn well go have it somewhere else and leave Wei Wuxian to sleep.\nAnd then Jin Ling, his little nephew, all of sixteen and at once so alarmingly grown-up and so fucking young, still a child, chokes out, “Uncle,” and Wei Wuxian’s heart stops dead in his chest from both astonishment and from the particular aching longing for family that he has carried with him his whole life. \nIn that instant, with that one word and all unknowing, Jin Ling gains his unquestioning allegiance. He will do anything this child asks of him. He will ransack the country for him. In the heartbeat of space between that word and the next thing Jin Ling says, Wei Wuxian rearranges his heart so there’s a piece of it that is reserved just for Jin Ling, and he adds a third name to the list of his favorite people in all the world.\nAnd then Jin Ling says, “Please. I love him.”\nWei Wuxian feels a burst of light in his chest, a sizzling firework of fierce joy and triumph and delight and overwhelming fondness, and in the wake of that, a sharp and visceral nostalgia for what it was like to be sixteen and so hopelessly in love that it left him more lost and bewildered than even the depths of the Burial Mounds ever did.\nThere is no way to explain this to Jin Ling. Their perspectives are too different--they don’t share a language in which they can even begin to talk about it yet. Perhaps in another sixteen years, he’ll be able to speak of this. \nFor now, all he can say is: “Well then. That changes things, doesn’t it?”\n\n\n\n*\n\n\n\nAn hour later, he is dressed and has listened to his nephew wax lyrical and despairing. In every note Wei Wuxian has heard the echo of his younger self, has heard Jin Ling singing a refrain that rings absolutely, devastatingly true and calls up ache after ache in Wei Wuxian’s own heart, all the tender old spots, little yearnings that had all blurred together and faded over time until he’d forgotten them like worn old clothes folded in the bottom of a trunk. Jin Ling, his hands over his eyes for propriety and no knowledge of what he’s doing as he speaks, unpicks the stitches of Wei Wuxian’s every carefully mended tear, every scrap of camouflaging embroidery, every patch sewn on to cover the threadbare soul at the core of him, repaired slowly by love and time.\nThat’s the thing about children, Wei Wuxian is discovering. Sometimes, unwittingly, they say things that shake you to your foundations, and you can’t tell them what kind of profound effect they’re having on you even while you’re rearranging your heart for them. Wei Wuxian’s hurts and tender spots are ancient history; Jin Ling’s are immediate and present. They take precedence right now. \nAll the love in his heart is taken up today, split between Lan Zhan and A-Yuan and A-Ling. He spares a brief moment of apprehension to wonder whether he’s going to be able to juggle three aspects of love without hurting any of them. \nHe is still playing his game, of course. There is no option notto play it, to refuse to take anyone’s side at all, because that would hurt at least one of them, and possibly all of them. He loves them too much to forsake them on this, so now it only remains to be seen whether the Yiling Patriarch is clever enough to play all four sides deftly enough that everyone comes out a winner.\n\n\n\n*\n\n\n\nLan Zhan is scared.\nWei Wuxian is sitting across the table from his husband in the Lan administrative offices with his nephew vibrating at his side while they wait for Sizhui to arrive, and his husband is scared.\nWei Wuxian knew with a calm and level certainty that he would be. He led with flirting and teasing because Lan Zhan knows what to do with that. It is familiar and comfortable and it says to him, Wei Wuxian hopes, This is normal, there is nothing to fear, I am yours and you are mine. Be at ease.\n“Wei Ying,” Lan Zhan says, and to Jin Ling it probably sounds angry--to a younger Wei Wuxian, it would sound angry too. \nThe Wei Wuxian of today hears fear, hears uncertainty, hears What are you doing? and I don’t know what to think and I feel like I’m in danger of losing someone I love. For all of Wei Wuxian’s threadbare little heart, Lan Zhan’s is worse off. Nobody knows that about him. Nobody knows to handle it gently. He’s lost his mother and Wei Wuxian to death, he’s lost his brother to seclusion and heartbreak, and now he thinks he’s losing his son, the only thing which brought him any joy in a decade and a half of grief.\n“Lan Zhan,” he murmurs, meeting his beloved’s eyes steadily. He is projecting confidence and calm assurance as hard as he can.\nThey have a whole conversation in that shared look, as they have had hundreds of times before. At the heart of every one of those conversations is just the call and response: Do you trust me? Yes, with my life.\nSo the only thing that Lan Zhan asks is: “Certain?” An echo of the oath that Wei Wuxian swore, weeks ago.\nWei Wuxian nods slowly, not breaking eye contact, and he sees the bravest man he has ever known steel himself to be brave again, setting aside his fear, and Wei Wuxian thinks of himself at Jin Ling’s age and marvels to think that there was a time when he couldn’t feel the incandescent brilliance of this love echoing back through the years from this moment. \n\n\n\n*\n\n\n\nHe leaves the children to their own devices. The game board has been set, and opening gambits have been made. Now they pause to regroup and review their positions.\nLan Zhan is waiting for him in the hallway just outside the office when he exits. Without exchanging a word or looking at each other or touching, they go back to the Jingshi, and Lan Zhan sets aside his sword and pushes Wei Wuxian into bed and wraps python-like around him, fingertips digging into Wei Wuxian’s flesh and his face pushing close against Wei Wuxian’s neck.\nWei Wuxian pets his hair, and they simply lie like that for a time.\n“I’m yours,” he whispers. It’s the middle of the morning and the sun is bright--the words don’t have quite the same power as they do when whispered into the dark. “I’m here, and I’m all yours.”\n“You took his side,” Lan Zhan says. He is not injured or hurt. He does not feel betrayed; Wei Wuxian would know. Frustrated, though, yes--and uncomfortable, off-balance. He does not feel secure.\n“The only other side to take was A-Yuan’s, and… A-Yuan has you,” he murmurs back. “A-Yuan has had you all his life. He doesn’t need me right now--he needs you.”\n“Not true.”\n“Thing is,” he continues, more delicately, “I’m not sure that A-Ling has ever had someone on his side. I wanted him to know what that was like. He deserves to have someone.”\n“Jiang Wanyin. Jin Guangyao. Many people have been on his side.”\n“Mm, they pulled him onto their sides. Don’t know that any of them took his.” Wei Wuxian pulls off Lan Zhan’s hair ornament so he can rub his face against the top of his head. “Forgive him. He’s young. He reminds me of me--same kind of idiot.”\n“Mn.” \n“Same kind of stupid over a beautiful and unattainable piece of Lan perfection,” Wei Wuxian says wryly. “You people don’t make it easy on us, you know.”\nLan Zhan huffs against his neck. “Am attained. Was attained from the beginning.”\n“From when? Which moment?”\n“The first.”\n“Liar,” Wei Wuxian retorts, brimming with fondness. “First moment, you ignored me and silenced me. Second moment, you kicked my ass, silenced me, and tattled on me to your brother and Lan Qiren. Third moment was, uh...”\n“First moment,” Lan Zhan insists. “Thought the boy at the gate was too pretty. Distracting mouth.”\nWei Wuxian cannot speak for several seconds. “Oh my god, stop talking.”\n“Mn,” agrees Lan Zhan.\n“No! No, keep going. Tell me everything you thought about my mouth.”\n“It talked too much. Looked too soft. Thought it should be shut up. Thought about how.”\n“Lan Zhaaan,” he sings, squirming with delight and tugging at Lan Zhan’s hair. “Shameless!” \nHe’s expecting a sharp nip of teeth at his neck, but Lan Zhan only nods a little and hugs him tighter. Still other business to resolve first, then, that’s what that means. “Is it okay? Do you forgive me? For being Jin Ling’s uncle in this, instead of Lan Zhan’s husband?”\n“Yes,” Lan Zhan says. Then, begrudgingly, “He is very young.”\n“Younger than A-Yuan, even.”\n“I don’t have to like him,” Lan Zhan says stubbornly. “He hurt Wei Ying.”\nWei Wuxian flops dramatically into the pillows. “Oh, woe! I am so feeble that even a toddler with a paring knife can overcome me! Oh, what shall I do in this cruel and horrible world? Have I no protector?”\nLan Zhan pushes himself up on his elbows to watch this show. He’s feigning sternness now, but Wei Wuxian can see the quirk of amusement hiding just at the corner of his mouth.\n“I shall lie here all helpless,” Wei Wuxian says, tossing his head back and forth theatrically. “I shall hope that no infants with toothpicks cross my path! Even worse, I will pray with all my heart that no evil man happens upon me, oh woe, else I will surely fall victim to his monstrous appetites. I, a delicate flower who--Lan Zhan, hurry up, this is turning me on--who is defenseless and fragile! Oh woe, I hope that no vile man of insatiable lusts sets his wicked eyes upon my tender, frail self and decides to ravish me--Lan Zhan, please, I’m running out of synonyms--” \nLan Zhan kisses him. “Distracting mouth,” he says between kisses. “Shutting you up.”\n“Oh nooo,” Wei Wuxian croons back, winding his arms around Lan Zhan’s neck. “Oh no, I’ve been captured. Oh woe.”\n\n\n\n*\n\n\n\nWei Wuxian has made a tactical error. His tactical error was in assuming that a single afternoon of vigorous and spectacular sex would be enough to distract Lan Zhan from this little ordeal that he is blowing so dramatically out of proportion. \nHe realizes his error at the same moment that he spots, from across the courtyard, Lan Zhan striding towards the library with Sizhui red-faced and anxious at his heels, tugging at his sleeve to get him to stop. Lan Zhan shakes him off, takes Sizhui by the upper arm, and steers him along, as thunderous as Wei Wuxian has ever seen him. \n“Ah fuck,” Wei Wuxian mutters under his breath, and trots after them, already wondering where Jin Ling is.\nHe sets one foot in the library when Lan Zhan whirls on him and says, “Your rake of a nephew took liberties with my son.”\n“Stop it,” Sizhui says, yanking Lan Zhan by the shoulder to face him again. Damn, little A-Yuan has gotten tall, Wei Wuxian notices. When did that happen? He’s as tall as Wei Wuxian is now, and he’s right up in Lan Zhan’s face, absolutely fearless. His dark eyes, usually so soft and sweet, are flashing with anger. “Father, stop.”\n“I will throw that boy out,” Lan Zhan says, icy. \n“You will do no such thing,” Sizhui says. “If you throw him out, I’m going with him.”\nInteresting. Wei Wuxian carefully does not cheer. He clears his throat. “When you say took liberties…”\n“I was kissing him on the back porch of the guest house,” Sizhui snaps. “I was kissing him. It was my idea, I wanted to, I asked, I convinced him. If anyone was taking liberties, it was me.”\n“Inappropriate behavior,” Lan Zhan snarls.\n“Hypocrite,” Sizhui shoots back.\nLan Zhan huffs and turns away, his jaw clenched. Sizhui glares at his back, then turns to Wei Wuxian with that same righteous anger, ready to fight him too if Wei Wuxian gives him the slightest reason to do so. \nWei Wuxian has from time to time seen little firefly-flashes of Sizhui taking after him, but in this moment, Sizhui has set aside all his Lan and is pure, burning Wei: There is someone who is being treated unfairly, and Sizhui is going to stand up for him--even with all his feelings set aside, the mere fact that no one else in the room is defending Jin Ling would be enough of a reason for Sizhui to do so.\nWei Wuxian wants to hug him, wants to cheer him on, wants to beam with pride, and he realizes suddenly exactly how Lan Zhan feels. He looks at this Sizhui--Wei Sizhui--and feels every fiber of his body resonate with a pressing sense of recognition: My child. Mine. If the glimpses of Lan Zhan’s influence on the boy strike Wei Wuxian like the strains of a favorite song heard across a long distance, then this reflection of himself is…  He has no words. He can only smile so hard his face hurts, and step quickly forward to squeeze Sizhui’s hand and upper arm and whisper in his ear the words that he would have killed to hear when he was Sizhui’s age: “Yes. Fight for him. Good.”\nSizhui pulls back and blinks at him, the rage flickering out just long enough for a hesitant smile to spark through his eyes--where did he come by that particular strain of sweetness? Wei Wuxian cannot figure that one out. It’s not Lan Zhan, and it’s not himself. \nBut then Lan Zhan is turning back for another round of the fight, and Sizhui is turning to meet him, his hand slipping out of Wei Wuxian’s, and while Wei Wuxian doesn’t really mind receiving the occasional light stabbing from close family members, he is nevertheless not so suicidal that he’s about to get in the middle of this.\nAnd besides, Jin Ling has been left alone, again, with no one on his side. The thought makes Wei Wuxian’s heart colder now than it ever has before.\nHe edges towards the door and scampers out, hearing only Lan Zhan spit something under his breath that sounds outright bitchy, and Sizhui say immediately in response, “Don’t you dare talk about him like that!”\nThat’s enough to make Wei Wuxian’s hurrying steps pause briefly, and to bring a thoughtful smile to his face. A very interesting development. Part of him wants to stay and watch Lan Zhan’s immovable object meet once more the unstoppable force of Wei-styled teenage rebellion, but Sizhui seems to be holding his own, and Wei Wuxian needs to make sure that Jin Ling isn’t bleeding to death somewhere, or preparing to throw himself into a river. Not that a river would do much--he’s Jiang Cheng’s nephew too, and nobody who spends more than a summer in Lotus Pier gets out of learning how to swim. \nStill, Wei Wuxian could appreciate the poetics of the gesture. If Jin Ling wants to ritually throw himself in a river, Wei Wuxian will allow it, and then he’ll fish the boy out and rub him dry with towels until he’s all mussed and tousled and grouchy.\n\n\n\n*\n\n\n\nAfter ensuring that his nephew is neither wet and bedraggled nor bleeding to death nor in danger of running off to become a rogue cultivator before his best uncle can solve his problems for him, Wei Wuxian returns to the Jingshi for dinner, thinking about the sneakiest way to break into the administrative offices for a last look at the ledgers. He expects to find Lan Zhan still in a towering rage or at least a dark sulk, and he has all his debate points and arguments and distracting flirtations prepared, but he’s still yards away from the door when he hears the low, mournful notes of the guqin and realizes that he has to change his strategy again. No matter. He is flexible.\nHe opens the door and says, “Oh, food! I’m starving!” as if he doesn’t notice Lan Zhan being dramatically wistful in the corner. Dramatic wistfulness is the Lan specialty and does not require praise, validation, or encouragement any more than the sunrise does, or the changing of the seasons, or gravity. “Lan Zhan, come eat! Did you wait for me? So sweet, so thoughtful.” He sits with his back towards Lan Zhan, shovels food into both their bowls and picks up his chopsticks. “Ah, I did a lot of work today! So did you, Lan Zhan, you must be hungry too.” \nLan Zhan gets up in silence and joins him at the table. \nWei Wuxian shovels food into his mouth. Lan Zhan only picks at his, eating nothing, and finally Wei Wuxian pushes his empty bowl away and sighs. “How’d it go with A-Yuan?”\nLan Zhan sighs.\n“That good, eh?” Wei Wuxian eyes him, pouring them both tea. “Did you lose?”\n“I am a bad father,” Lan Zhan says.\nWei Wuxian can’t help but snort into his teacup. Lan Zhan gives him an aggrieved look. “Did A-Yuan tell you that or did you come up with it all on your own?”\nThe aggrieved look turns offended. “He is too polite to say such a thing.”\n“Huh. Wonder where he got those pretty manners from, then,” Wei Wuxian murmurs, sipping tea. “It’s a mystery. Would a bad father have taught him so well?”\n“Wei Ying,” Lan Zhan says, frowning.\n“You seem like a pretty great father to me,” Wei Wuxian says with a shrug. “I’d let you raise more of my kids.” Lan Zhan blinks at him, the equivalent of dropping his jaw on the floor, and Wei Wuxian smirks. “What? I would. You wanna have more kids, A-Zhan? Don’t answer right now--let’s finish up with current business first, get this one married off.” He adds, innocently, “Main benefit to consider, though: The more kids we have, the fewer of them will be able to marry Jiangs. Limited supply, you know. And it’s just statistically unlikely.”\n“Wei Ying,” Lan Zhan says. His ears are red. Wei Wuxian is going to end up with six more kids. Maybe more. Enough to start a competitive archery team. Enough to start their own sect. \nWei Wuxian sighs, sets down his teacup, and takes Lan Zhan’s hands. “I have bad news for you. I’m pretty sure A-Yuan is going to marry that boy. I have worse news for you: Since you’re not a bad father, you’re going to end up finding a way to live with it.”\n“He hurt Wei Ying,” Lan Zhan mutters. “He’s taking my son away--”\n“A-Yuan is, currently, the Lan heir,” Wei Wuxian says, finally losing a bit of his patience. “He’s not going anywhere, except to Lanling, and I daresay that’s only going to be part time--he’s going to have to come back here for heir business, and because he loves you and he loves Gusu. Besides that, you can write to him. You can visit him. We can go live in Lanling if it’s hurting you so much to think of being apart from him.”\nLan Zhan blinks, as if he had not thought of that possibility. \n“Us and our army of children,” Wei Wuxian adds with relish. “You want to talk about shameless behavior? We’ll shamelessly take advantage of Jin hospitality. We’ll take up all their guest rooms and eat all their food and drink all their--well, I’ll drink all their wine, you can drink all their tea. A-Ling will have to let us stay with him; it would be scandalous to turn away his in-laws. We’re going to have fun with him. Do me a favor--if you start liking him a little bit, don’t let him know. Keep glaring at him for a few more years, it’ll keep him on his toes.”\n“Mn,” says Lan Zhan, whose ears had reddened again at the mention of an army of children. \nWei Wuxian sips his tea, leisurely lines up his coup de grace, and says casually, “Not to mention the last thing.”\n“What thing,” Lan Zhan says.\n“Well. You know. One sect heir marrying another sect heir?” Wei Wuxian says pointedly. “They’ll have to come up with heirs of their own, one way or another. Y’know. Our grandchildren.”\nLan Zhan goes absolutely blank. \nWei Wuxian finishes his tea, humming to himself. He clears the dishes from the table and leaves the tray by the porch steps for the servants to collect. He lights a few candles, takes out the disciples’ essays for grading.\nLan Zhan does not speak, move, or blink, as far as Wei Wuxian can tell, for a solid hour. At last he draws a huge breath and says, “What.”\n“Better hope that none of them have little paring knives, though.” Wei Wuxian doesn’t look up from grading. “Your poor helpless husband, attacked with many teeny, teeny stabs. Woe. Woe.”\nLan Zhan doesn’t speak or move again until Wei Wuxian has finished with grading. He blows out the candles, packs away the essays, pulls an unresisting Lan Zhan to his feet, and bundles him into bed.\nHe leans over Lan Zhan, lying flat on his back and staring gobsmacked at the ceiling, and snaps his fingers in front of Lan Zhan’s face. “Hey. Want to have some more sex? I want to go get some fresh air before bed, but I’ll help you fall asleep first if you want.”\n“Grandchildren,” Lan Zhan says, as if it is a word he has never heard before and is trying to wrap his head around the concept and his tongue around the pronunciation.\n“Natural risk of having kids,” Wei Wuxian says reasonably. “But let’s not talk about them when I’m trying to chat you up. Sex? Yes, no?”\nOf course the answer is yes--the answer has, so far, always and emphatically been yes. Lan Zhan visibly shakes off his stunned haze, pulls Wei Wuxian down by his collar, kisses him. He’s in an unusual mood, all pliant and yielding, and Wei Wuxian honestly can’t blame him--it’s been a very long day. He smiles into Lan Zhan’s mouth and enjoys the opportunity to unwind him slowly, first from his robes and ribbon and then from his restraint. He keeps most of his own clothing on, only undoing enough that he can get some bare skin against Lan Zhan’s. It’s easy, unhurried, and uncomplicated--he gets between Lan Zhan’s perfect thighs and takes them both in hand, biting softly at all the places Lan Zhan likes best and murmuring nonsense against the hinge of his jaw until Lan Zhan is shuddering beneath him, squirming and clutching at Wei Wuxian’s shoulder-blades. Wei Wuxian never increases the lazy rhythm of his hand, instead driving Lan Zhan over the edge with adoring words in his ear, and wet open-mouthed kisses on his neck. Wei Wuxian follows him, gasping his laughter into Lan Zhan’s hair. They’ve barely broken a sweat. \nWei Wuxian sits back on his heels, robes hanging loose around him, and surveys the glory laid out before him, grinning. He swipes his hand through the mess on Lan Zhan’s stomach--not horrible, since they already went three rounds today--and wipes it down his own bare chest. “There,” he says, satisfied. “Now if anyone catches me while I’m out on my walk, they’ll know I’m yours.” \nHe dips to kiss Lan Zhan’s perfect white-jade hipbone while his husband mumbles, halfheartedly, “Shameless. Disgusting.”\nWei Wuxian bites him in the soft place just above the hipbone, a spot he knows is ticklish, and Lan Zhan jumps, shoving at his shoulder. Wei Wuxian, giggling, rolls out of bed and ties up his clothes again. “Go to sleep,” he says. “I’ll be here when you wake up.”\n\n\n\n*\n\n\n\nHe is there when Lan Zhan wakes up, barely. He slips back in with the first faint grey light of dawn, throws his clothes into a pile on the floor, and wriggles into bed and around Lan Zhan.\nLan Zhan wakes, minutes later, and Wei Wuxian yawns hugely and murmurs, “You stole all the blankets last night, I’m cold,” just in case Lan Zhan notices that he’s not as cozy as he should be if he’d been there all night. He cracks an eye open, slides a hand over Lan Zhan’s thigh under the covers, and says slyly, “Do the honorable thing. Take responsibility and warm me up.”\nLan Zhan’s unusual mood has passed with the night--Wei Wuxian is comprehensively warmed up.\nIn the afterglow, still sticky and sweaty and drunk on each other, Wei Wuxian laughs and says, a little delirious, “Marry me again. Marry me seven more times.”\n“No,” says Lan Zhan, untangling himself from Wei Wuxian and tucking the blankets snugly around him. “Eight more.”\n“Nine.”\n“Every day.”\n“Deal. I do love negotiating with you, gege.”\nWhen Lan Zhan is done with the blankets, he sits on the edge of the bed, facing him. “Wei Ying,” he says, in a different tone.\nWei Wuxian eyes him over the edge of the blanket, which he has been swaddled in up to his nose. “Worried about today?” Lan Zhan shrugs, which is a huge improvement from yesterday. “Resigned?” A nod. “Not yet happy about it?” \nLan Zhan says nothing for a moment. At last: “I will be happy if A-Yuan is happy,” he says stoically, and Wei Wuxian has to flail himself free from the blankets and sit up to kiss him.\n“Good boy, good boy,” he says. “I will try to make it easy for you today. I will flirt with you the entire time. The children will hate it.”\n“Mn,” says Lan Zhan.\n“I’ll use my sex voice,” Wei Wuxian says. “I’ll bat my eyes at you and you’ll think about me naked in your bed, and then I’ll kick the kids out of your office so we can fuck on your desk.”\nLan Zhan considers this solemnly, as if it is a matter of serious political import, and nods. “Yes.”\nWei Wuxian plants a smacking kiss on his cheek, flings himself back into the pillows, and rolls onto his side. “Good! Back to sleep. See you later.”\n\n\n\n*\n\n\n\nThat afternoon, after all the negotiations and the post-negotiations sex, Wei Wuxian swaggers out of Lan Zhan’s office with a last tug on his robes to straighten them. He is practically whistling. He has a new enormous hickey, high enough on his neck that there’s really no chance of hiding it. Lan Zhan hadn’t even pretended to be ashamed when he’d seen his work, the territorial bastard.\nWei Wuxian tucks his thumbs into his belt and saunters towards the kitchens. He is pleased with himself, with his husband, with his nephew, with his son, with the world in general. He needs a snack and then everything will be perfect.\nHe swings himself around the doorpost into the kitchen and nearly runs face-first into Sizhui.\n“A-ah, hello,” says Sizhui. He has a bag in his arms and a very innocent look on his face. “I didn’t expect to see you so soon. I thought… uh... ”\n“That I’d be occupied? Why? What are you doing?” Wei Wuxian asks. He’s seen enough teenage sneaking in his life to be immediately curious--he was once an expert on teenage sneaking. Quick as a snake, he snatches the bag from Sizhui and looks inside. It’s full of a few days’ rations, the sort they send with the night-hunting parties. “Where are you going?”\n“There was a report,” Sizhui says immediately. “Just outside Caiyi Town. A fierce corpse. I’m going to go take care of it. Not a big deal.”\nHe’s lying and it’s adorable and Wei Wuxian, despite his warm benevolence towards the whole world right now, is too good of a father to let him get away with it--how is Sizhui supposed to learn to lie better if he doesn’t get any practice at being called out for it?\n“You’re taking rations for a night hunt that you could finish and return from before suppertime?”\n“Thou shalt show prudence and good sense, and thereby avert the worst of misfortune,” Sizhui quotes earnestly. Lan precept #2032, Wei Wuxian thinks. Somewhere in the 2030s, anyway.\n“Right,” Wei Wuxian says, widening his eyes and matching Sizhui’s earnest tone. “Such a disciplined and righteous young man! Truly an exemplar for all young cultivators! Not even engaged for five minutes and already running away from your fiance to protect the local townsfolk from danger. No, no, this cannot be.” Wei Wuxian shakes his finger. “If it’s such a minor problem, a single fierce corpse, you should let someone else take care of it. Today is for celebrating.”\n“Ah. Uh,” says Sizhui. \n“You should stay right here,” Wei Wuxian says, smiling. “And not go out.”\n“I. Really want to take care of this myself.” Yes, he definitely needs more practice at lying--already his mask is slipping and Wei Wuxian can see a note of scrambling panic setting in.\nWei Wuxian slaps a hand to his heart. “Such a brave and upstanding son I have! Truly the heavens have blessed me! In that case, you must go,” Wei Wuxian says, nodding, and just when Sizhui relaxes and smiles again, he adds, “And I will come with you. And we’ll get several others. Hanguang-jun, too! He’s been cooped up here too long, he could do with a little fun.” Wei Wuxian doesn’t know exactly why Sizhui wants to go out, but he can guess--so much teenage sneaking, Wei Wuxian knows from personal experience, is motivated by a keen desire to get the hell away from the loved ones who would otherwise obstruct you from attaining your end goals. “We’ll make a big outing of it. Lots of people.”\n“Uh,” says Sizhui, alarmed. “Really not necessary.”\nWei Wuxian gives him an aggrieved look. “You aren’t trying to hoard all the valor and glory for yourself, are you?”\n“No!” Sizhui cries. “No, of course not. I--uh--it’s just a single corpse, that’s all. We don’t need--so many people--certainly not Hanguang-jun, definitely not… him. Or you. Stay here! You should stay here. With him. And everyone else. I’ll take care of it. Not for valor or glory, just--service to the townsfolk.” He nods. “We owe them protection. Very important.”\n“But Sizhui,” Wei Wuxian says, reproachful. “What about that precept you just quoted about prudence and good sense? Surely it’s better to take a team with you, even if you don’t think you’ll need them.”\n“Ahaha,” says Sizhui. “Ha. Right. Of course. I will... be meeting up with Wen Ning.”\nWei Wuxian peeks in the bag again, counts the rations. “Two nights’ supplies, for one person,” he muses, then lets himself light up. He is mentally rubbing his hands together with glee. “Or one night’s supplies for two people!”\nSizhui goes a little pink, but he doesn’t break eye contact. Wei Wuxian is so proud of him that he is not going to go easy on him in the slightest. “That’s how math works, yes,” he says. He’s rallied now, and he’s doing a fantastic job keeping his composure.\n“Sass,” Wei Wuxian says. “Cheek. Also, Wen Ning doesn’t eat. Why take rations at all? There’s lots of inns in Caiyi Town, no? If it’s too late to come home, you could just…” He smirks. “Get a room.”\n“Maybe there won’t be any rooms available,” Sizhui says immediately--it’s a prepared story, that’s what it is. That’s why he has all the answers at hand.\n“Maybe you don’t want to be found, if someone notices you’re missing, and you think the inns would be the first place they’d look,” Wei Wuxian counters. He’s dropping his innocent earnestness. “Hm?” \n“Mn,” says Sizhui. Trying to model Lan Zhan, but that’s not the right tactic for this situation. Ah, he is still young. He will learn. Lan Zhan can be himself so successfully because no one dares question him. It’s all smoke and mirrors--no one notices when he’s afraid, and no one even really notices that he’s a huge bitch, even when he is being ice fucking cold to their faces. Sizhui is trying to use that poker face to bluff his way past embarrassment, but it’d work much better if he went on the offensive and tried to turn embarrassment back on Wei Wuxian.\n“You know…” Wei Wuxian says, tapping his chin thoughtfully with one finger. “It’s strange.”\n“Strange?” says Sizhui, blinking like an innocent bunny.\n“Strange that you’d leave Jin Ling here. He’s a good cultivator. He could handle a fierce corpse, surely.” Wei Wuxian shoots him a sly glance. “After all that work I did to soothe Lan Zhan’s ruffled feathers, you’re not… having second thoughts, are you? Maybe you don’t want to marry that boy?”\nHe is watching Sizhui very carefully, so he has the singular delight of watching the Lan in him go to war against the Wei. The Wei, being more nimble and adaptable, wins out, to Wei Wuxian’s glee, and Sizhui rises immediately to the bait. “I do want to marry him, I’m going to marry him, nobody can stop me from marrying him--”\n“Great, good,” Wei Wuxian says.\n“--and he says won’t kiss me in the Cloud Recesses ever again because he thinks that Hanguang-jun can smell lewd thoughts on a person from a mile away--”\n“True, but only mine,” Wei Wuxian says placidly.\n“So I’m taking him out of Cloud Recesses and we won’t be back until tomorrow, so there,” Sizhui finishes, and steps around him towards the door.\n“Nice comb,” Wei Wuxian says, catching a glittering eyeful of it as Sizhui passes. It is a nice comb--the part of his brain that always calculates things in bags of turnips (or food for a starving sect, or seeds that won’t thrive in thin, rocky soil, or scant handfuls of medicinal herbs to treat coughs that won’t go away, the result of ashy, poisonous air) estimates the comb’s value as, roughly, eyewatering. It blazes against Sizhui’s hair like a little sun. \n“Thank you,” Sizhui says. “I like it too.”\nWei Wuxian catches his sleeve. “Take more rations.”\nSizhui turns back, a little frown between his eyebrows. “What?” \n“Take more rations. Take a few days.”\n“I can’t leave for that long,” Sizhui says, slow and cautious. “Hanguang-jun will notice.”\n“I’ll cover for you,” Wei Wuxian says, as if it is the simplest thing in the world, because it is.\nAll the Wei pride drops off of Sizhui abruptly. He stares at Wei Wuxian, wide eyed. “What, really?” \nWei Wuxian pouts. “I’m insulted that you’d think I wouldn’t. What else do you want from me? Practical advice on how to smuggle in alcohol? I don’t have advice about that, I just get Lan Zhan to carry it for me in broad daylight, and then he hides it under the floorboards in the Jingshi for me, and fetches it out for me, and pours it for me. I am useless to you in this regard. What else? You hate my cooking, and apparently my fake covers for pornography are garbage, so--” \nSizhui hurls himself at Wei Wuxian, laughing, and hugs him around the neck. \nWei Wuxian creaks a protest. “Strong.”\nSizhui only hugs him tighter. After a moment, he says, “I didn’t say thank you yet.”\nWei Wuxian splutters. “How dare you. I have done nothing. I refuse. This is nonsense.” He braces himself with all his strength, because he knows where this is going and it’s awful. This is the sort of soft, earnest tone that a Lan uses right before they tell you that they wrote a love song about you when you were teenagers together, or that they are your long-lost son that you assumed had died years ago. This is unforgivable sincerity and Wei Wuxian is going to have to endure it again even though it makes him squirm with agony.\n“You did more than anybody else,” Sizhui says, pulling back enough to look at him with those shy, adoring eyes. “I was watching you. You comforted me and Hanguang-jun, and you were there for Jin Ling. You did so much.”\nWei Wuxian splutters again. “Spying on me, eh? Impertinent boy. Who gave you permission to pay any attention, eh? Did I tell you to do that? Who ever said that was fine?” He points a finger in Sizhui’s face. “You’re supposed to take everything I do for granted, you hear? And then I’ll sigh about my thankless child, and nobly endure! That's the way it works!”\nSizhui’s eyes are sparkling now and he’s fighting back a smile. “You’re doing such a good job nobly enduring right now.”\n“Cheek!” Wei Wuxian shouts at him.\n“Thank you for looking after A-Ling,” Sizhui yells back. He’s grinning outright now, horrible thing. “I love you very much and I’m glad he had you!”\nWei Wuxian, swearing between his teeth, seizes a nearby dishtowel and tries to whap him about the head with it as Sizhui, giggling the whole time, ducks and weaves and--damn it, when did he get to be this good of a cultivator? Wei Wuxian can’t land a hit on him. He steps back, hands on his hips, glaring at his terrible child to cover up all the wretchedly embarrassing soft, glowy feelings in his chest. “Who taught you to say things like that? Eh? Who’d you get that from?” He snaps the dishtowel at that wretched child again, but Sizhui only laughs and dances out of his reach. “Bah. Get the hell out of here!” He points in the general direction of the gates. “Take your fiance and don’t let me see your faces again for two days!”\n“Or what,” says Sizhui, doing that precious little head-tilt that looks so politely inquisitive, except right now Wei Wuxian knows it is being used for backchat. “You’ll plant us in the turnip fields?” \nWei Wuxian feints another attack with the dishcloth. “You--!” Sizhui squeaks, laughs, and gives Wei Wuxian the sunniest grin as he ducks out the door."
}