{
    "id": "22258702",
    "url": "https://archiveofourown.org/works/22258702?view_full_work=true",
    "author": [
        "DancingInTheStorm"
    ],
    "title": "those hardest to love need it most",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Aizawa Shouta | Eraserhead & Midoriya Izuku"
    ],
    "characters": [
        "Midoriya Izuku",
        "Bakugou Katsuki",
        "Aizawa Shouta | Eraserhead",
        "Nedzu (My Hero Academia)"
    ],
    "additional_tags": [
        "In which Aizawa gets a good long look at Midoriya’s middle school",
        "in which Nedzu razes the school offscreen",
        "In which Aizawa and Midoriya talk. A lot.",
        "rated for heavy discussion topics"
    ],
    "language": "English",
    "series": "Part 1 of DancingInTheStorm’s BNHA fics",
    "published": "2020-01-14",
    "completed": null,
    "words": "8,205",
    "chapters": "1/1",
    "comments": "577",
    "kudos": "24,492",
    "bookmarks": "6,207",
    "hits": "191,153",
    "summary": "<p>Shouta gripped the phone tight enough to make the phone case groan. “So it’s true. Midoriya was Quirkless.”</p>\n<p>“Until soon before the entrance exam,” Nedzu confirmed. “That’s not relevant now, though, because—“</p>\n<p>“Relevant?” Shouta hissed. “Midoriya is barely functional, socially. He doesn’t trust any adult. He thinks the whole world hates him. He apologizes for everything except breaking the law, and I’m sure I can trace every single one of those things back to his Quirklessness. You call that irrelevant?”</p>\n<p> </p>\n<p>Aizawa visits Aldera Junior High and finds out some disturbing truths.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Tumblr: <a href=\"https://www.tumblr.com/blog/awake-my-oceans\" rel=\"nofollow\">awake-my-oceans </a></p>",
    "text": "Filtered, yellow light lit the principle’s office of Aldera Junior High. Shouta sat safe in the cold shadow of the back corner and waited, half-asleep, half-coiled. \nHe was here on school—and state—business. UA protected its students from media mongering as a matter of course, a a service backed by the government as an equal matter of course. Everyone knew the damage one scandalizing interview could cause to hero careers and UA’s reputation alike, and that was something both school and state took seriously. \nOne such interview had taken place over the past week. An old Aldera classmate of Izuku Midoriya had somehow got ahold of the press and released such scandalizing details as accusations of Quirklessness and cheating. Hence, Shouta’s presence.\nHe had already visited this principal once before, soon after Bakugo and Midoriya’s enrollment at UA processed. He had laid out UA’s strict policy of preventing interviews from former classmates, and laid out the legal consequences of failing to enforce the policy among the students. \nOnce was usually enough, in his experience. The principals were dazzled by the promise of a UA student from their junior high, and eager to promise strict policy compliance. The promises tended to stick, half because of the threat of legal action and half because no principal wanted to be the one to endanger their star student’s prospects.\nThis school had been different. The awed look in all the staff’s eyes had been nothing new, but the undercurrent—hungry and satisfied whenever Bakugo was mentioned, uncomfortable wherever Midoriya came up—flaunted red flags. The difference between the two boys was evident once Shouta met them. Bakugo was a classic example of a favored student, all skill and arrogance. Midoriya, though. Midoriya was a timid wreck of determination. \nIt could be nerves, Shouta had thought initially, but no. The boy startled whenever he was praised, and hid his face at the mildest compliment. This was a child unused to care. It might have been his Quirk, Shouta thought. Midoriya clearly had little practice with it before entering UA, and people might have shunned him for his poor Quirk control. It might have been an awkward personality. It might have been anything, but Shouta remembered the looks of masked dismay on the Aldera staff’s faces when informed that Midoriya ranked seventh in UA’s entrance exam. \nSomething was wrong at this school, and he was going to get to the bottom of it.\nThe secretary finished her phone call, nested the phone back in its receiver, and cleared her throat. “The principal will see you now, Aizawa-san.”\nShouta flowed to his feet, extending stiff muscles. People’s first reactions to UA representatives were telling, and accordingly, Shouta wanted the reaction to happen in front of him, not behind closed doors. He had therefore failed to mention his job posting, or the reason for his visit, and had been made to wait well over half an hour for this appointment as a result. \n“If you will follow me,” the secretary said, holding open a side door. He followed, taking in the wall hangings as he passed. Art projects. Certificates. One plaque read honored graduates. Bakugo’s name was last on the plaque, shiny with newness. Midoriya’s name was nowhere to be found. \nInteresting.\nThe secretary opened the door, bowed, and left. Shouta walked in, feet padding on worn carpeting. \nHe saw the moment Principal Himura recognized him as the UA representative that had visited Aldera once before, soon after Bakugo and Midoriya’s acceptance into UA. Faint horror filled the man’s eyes, quickly hidden. \n“Welcome, Aizawa-san, was it? Sit down, sit down. You should have informed my staff who you were, and I would not have kept you waiting.”\nThe faint horror was understandable, Shouta thought, sitting. The hidden note of unease, though—that was something to keep an eye on. \n“I am sure a man such as yourself has many pressing appointments,” Himura was saying, settling into his seat with a grunt. “Tell me how I can be of assistance.”\nThat was a polite overstatement, Shouta thought with grim amusement. He knew full well that his appearance leaned more toward “lazy, underdressed man” than “overbusy government official,” even if both were true. He leaned forward. \n“I’m here on official business about Izuku Midoriya,” he said, and—there. A flash of fear and contempt in Himura’s eyes. The lack of Midoriya’s name on the plaque was no oversight, then. \nHe filed the information away.\nHe had wondered and observed, previously. Now he knew. This was not a building Midoriya was welcome in.\nHe settled further into the chair.\n“I am here to inform you that a student of yours, Yasuda Yin, broke the nondisclosure policy surrounding Midoriya Izuku. I am here to address that error.”\nHimura relaxed. That wasn’t the accusation the man had been expecting. “I apologize profusely,” Himura said, crossing his legs and leaning back in his chair, “but the school cannot monitor what every student says at every moment of the day.”\n“Of course not,” Shouta agreed, watching the man relax further. “But you are expected to take appropriate action afterward,” he added, words snapping shut like a trap. Himura flinched. “I think you fail to understand the national threat Yasuda has caused.”\nHimura was sitting upright, now, face paling. “Please explain.”\n“The government substantially backs UA’s funding and reputation,” Shouta drawled. “Surely, you know this. Problems at UA are therefore problems of state.”\nHimura nodded, cautious.\n“UA’s media presence has been negative the past four months,” Shouta continued. “The attack at the USJ, the kidnapping of your former student by the League of Villains, the media criticism of both events. The government won’t allow another hit at UA. That includes scandalizing interviews of one of our first year students. Do you understand your position?” \nHimura nodded, slow.\nReluctant? Hard to tell. Maybe.\n“You are responsible for containing a major threat to public confidence of UA, and by extension, the government,” Shouta stressed. “I cannot overstate your role.”\nHimura was still slow to respond. It could be shock, it could be anything, but Shouta wondered, slumping down further in his chair—the picture of indifference.\n“If I may be frank,” Himura said at length. \nShouta waved a lazy hand, watching keenly. “Please do.”\n“The public image of UA shouldn’t be entrusted to a boy such as Midoriya Izuku,” Himura said. “The boy is a cheat and a liar.”\nAh. \nThere it was. \nShouta closed his eyes to mask his fury.\n“The child is Quirkless,” Himura continued, unaware or unafraid of the slow simmer of anger building in Shouta. “He’s clever, I’ll give you that. I don’t know how he faked a Quirk, but I can tell you he most assuredly did.”\n“Why didn’t you inform UA of this fact?” Shouta asked tonelessly. \n“I did,” Himura said, voice near-distressed. “I did, but the school contacted me almost immediately to say that—“ the man’s voice dropped “—All Might himself endorsed Midoriya’s claim of a Quirk.”\nThat caught Shouta’s attention. Anyone with eyes knew All Might was closely tied to Midoriya Izuku, but this was confirmation that the relationship started well before school was in session. Good to know.\n“I would never claim that the Symbol of Peace intentionally lied,” Himura went on, “but I can state with confidence that Midoriya was utterly Quirkless throughout middle school. Furthermore, he was always causing trouble, disrupting class and disturbing his classmates. He doesn’t deserve a place at UA.”\nMidoriya, Aizawa knew, was quiet in class—almost to a fault—unless he got excited, at which point he would do nothing more harmful than mumble to himself. Disruptive? A disturbance? Problem Child had many flaws, but those occurred almost solely because of his self-destructive streak. It had nothing to do with any classroom management issues. And the boy certainly, painfully had a Quirk. It was hard to miss.\nThere were many types of lava. Some types exploded, creating a deadly splash zone. Hizashi had a explosive-lava temper.\nSome types of lava were slow and steady, creeping along with no particular rush until they encompassed entire fields. Shouta had a creeping-lava temper, and the heat was lapping at his shoes. \n“Midoriya,” he started, low and slow, “has every place at UA. He is an analyst and a strategist, and your own star student, Bakugo Katsuki, would not have got off Kamino without him.”\nThat was the reason he had not expelled the lot of them, ultimately. Had they broken the law? Yes. Had they broken his trust? Yes. Could All Might have successfully got Bakugo out of Kamino Ward alone? Arguably, no. \nIt was the role of a hero to save people who needed saving. \n“And regardless of what you think of him,” Shouta said, standing, “who are you to tell a child he is no hero?”\nHimura flinched, a full body thing. \n“Heroes come in many forms, professional and personal,” Shouta spat. “Who are you to tell a child he is not one?”\n“That’s enough,” Himura snapped, standing to face Shouta. “I know who you are, Eraserhead. You tell UA children they aren’t heroes every year.”\n“I tell them,” Shouto said, stepping forward, “they are not capable of surviving on the field. I never tell them they don’t deserve to be a hero. Heroes die. That’s why I expel the ones that will fail. I don’t tell a child he is worthless because he has no Quirk.”\nHe drew a breath, drew all his suspicions together, and regretted every moment he had viewed Midoriya as Bakugo’s rival instead of Bakugo’s victim. “And I have never. Ever. Taught one child he ought to mock another child on the basis of Quirklessness.”\nHimura stilled, sat. Shouta loomed. “I’ve worked with Bakugo and Midoriya for months, now. I see how Bakugo thinks he’s entitled to hurt anyone, so long as it gets him his goal. I see how Midoriya thinks he’s entitled to nothing, not even basic decency. You did your students no favors. You crippled them both, just because you thought Quirkless meant worthless.”\nHimura wouldn’t meet his eyes. Shouta’s assumptions were right, then.\nThe thought brought no relief. \n“By the way,” Shouta said, stepping back, “this has no bearing on Midoriya’s worth as a person, despite your prejudiced opinion, but Midoriya has a Quirk, one of the strongest I’ve ever seen. I suspect he didn’t use it because he ran the risk of blowing himself up every time he touched it.”\nHimura flinched.\n“Right,” Shouta said briskly. Lava poured out of him, swamping the entirety of Aldera Junior High. “I’ll be running a formal investigation on the former abuse of one UA student, Midoriya Izuku. I expect your full cooperation, unless you want your school shut down for obstruction of justice.”\nNothing from Himura. \n“I’ll start with video footage of every classroom Midoriya was in, cross-referenced with every school incident report.”\n“Surely a man such as yourself doesn’t have the time to check so many hours of video,” the man said weakly. “Allow me to offer myself as an assistant—“\n“No.” Shouta wondered how the man thought he would get away with such a blatant attempt to mask data. “And before we use up more of my precious time, allow me to inform you that I know the signs of edited footage in my sleep. Don’t attempt anything, or I’ll have you in jail.”\nHimura nodded, and went back to not meeting his eyes.\n“If you excuse me, I have some calls to make.” He strode out of the room, leaned against the wall, and speed dialed Nedzu.\nNedzu answered on the fourth ring. “Aizawa. What a pleasant surprise, I—“\n“I have a new school for you to rake across the coals for ethical misconduct,” Shouta cut in. \n“Excellent,” Nedzu breathed, delighted. “Which school?”\n“Aldera Junior High. Bakugo and Midoriya’s middle school.”\nA pause. “Oh.” The glee faded from Nedzu’s voice, replaced with grim understanding. Shouta could almost hear the puzzle pieces clicking together in the principal’s mind. “I see. This is about Midoriya’s Quirklessness?”\nShouta gripped the phone tight enough to make the phone case groan. “So it’s true. He was Quirkless.”\n“Until soon before the entrance exam,” Nedzu confirmed. “That’s not relevant now, though, because—“\n“Relevant?” Shouta hissed. “Midoriya is barely functional, socially. He doesn’t trust any adult. He thinks the whole world hates him. He apologizes for everything except breaking the law, and I’m sure I can trace every single one of those things back to his Quirklessness. You call that irrelevant? I needed to know this, Nedzu.”\n“I didn’t want to bias your judgement,” came the far more meek reply.\nShouta narrowed his eyes and felt his Quirk activate out of pure temper. “You think I would dismiss Midoriya because his Quirk came in late?”\nNedzu sighed. “Yes.” He hurried his words before Shouta could get a furious word in edgewise. “You would see a near-Quirkless child as a liability on the battlefield, and dismiss him to keep him and others safe. He would be worth no less as a person to you, but you might think him worthless as a hero.”\nThe words had the bitter sting of half-truth. Shouta would have high expectations for a Quirkless hero, for the Quirkless started with the field leveled against them and needed strength of mind and will to cope. Still, he wouldn’t have rejected one out of hand. “I’m his teacher,” Shouta hissed. “He has merit, so I do everything I can to help him. I can’t help him if I don’t know these things.”\n“Would he have merit if he were Quirkless?” Nedzu said, soft and gentle. Never in Shouta’s life had he more wished to kick the principal’s face in. \n“Midoriya Izuku is smart enough and kind enough to make it as a hero, Quirk notwithstanding,” he bit out. “You should know that, after I kept him in my class when his Quirk was such a liability. You should have let me judge the matter for myself.”\n“I see that now,” Nedzu said, almost apologetic. “Forgive me. What did the school do to Midoriya?”\n“You’re sidetracking me,” Shouta said, low and furious. “Don’t.”\n“I’m making amends,” Nedzu corrected. “I thought to treat Midoriya like any other student to show we did not discriminate against him, but I see now that this approach hurt more than helped. Allow me to right this wrong.”\n“We’ll be talking about this later,” Shouta threatened, then allowed himself to lean against the wall. “The principal looked down on Midoriya. Called him a cheat and a liar, got jumpy whenever I mentioned Midoriya’s accomplishments, included Bakugo but not Midoriya on a plaque commemorating past students. I suspect there’s much more going on under the surface. I need a permit.”\n“You have it,” Nedzu said. “Give me a half hour. Do you want me to arrange for Yamada to run your homeroom?”\nShouta turned the prospect over in his mind. It was a good suggestion, but he hated the idea of leaving his class, even for something as important as this and he needed to confront Midoriya over this sooner or later. “No. I’ll take care of it.”\n“Alright,” Nedzu said, tone darkening. “I’ll review the school’s conduct while you’re in class. This will be a joint investigation with me.”\nShouta wanted to spit out something cutting, but forced the words back. Nedzu had far more experience than he at the legal process of bringing down a corrupt organization. “Fine,” he said, and hung up.\n \n\nHe had taken his lunch break to talk with Principal Himura. By the time he got back, his students would be halfway through math with Ectoplasm. Meanwhile, Shouta was going to take a deep dive into Midoriya’s files. He already had done so at the beginning of the year, but things might come into a new light, now.\nNedzu was waiting for him at the gate, holding a thick folder of information. Shouta took it wordlessly and nodded, simmering down his anger into something cooler, deadlier. “Thank you.”\nNedzu nodded back, a feral shadow in his eyes. “I did some research into the state of Quirkless people today. I fear I am dangerously out of touch with such information, given our school focuses on the upper ranks of Quirked children.” He paused. “If Midoriya is anything like average, he would have been told to kill himself an average of two point seven times a month.”\nShouta’s grip on the folder tightened. “Understood.” And he did. Midoriya had a destructive streak almost as wide and deep as his desire to help people. The boy was willing to shatter his arm in the Quirk evaluation test—when Shouta told him this was not an acceptable risk, Midoriya had looked blank and desperate, not the slightest bit of relief in his eyes. \nThat blank look haunted Shouta as Midoriya refused to run from villains at the USJ, as Midoriya broke, re-broke his arm and each individual finger during the Sports Festival, as Midoriya crippled himself in the training camp attack, as Midoriya threw himself into the looming disaster that was Kamino Ward. \n“Is he suicidal?” he asked Nedzu, because Nedzu would know, and this was important.\nNedzu shook his head. “Suicidal people think people are better off if they’re dead. Midoriya thinks he should help people, even if it kills him. There’s a difference.” \nEven if it kills him. There were many reasons Shouta expelled students—lack of seriousness, lack of skill, lack of wisdom. All things that would kill them in the field. He had never had a student so ready to die, before. That changed things. \n“I need to talk to Midoriya,” he said, brushing past Nedzu. “Now.”\n \n\n“Midoriya,” he said, standing in the doorway. Everyone turned to look at him. “Come with me, please.”\n“Why are you in trouble this time?” Kaminari mumbled to Midoriya, who shrugged back in helpless confusion. \nThe words rang in Shouta’s ears. Why are you in trouble? Midoriya wasn’t in trouble, but Midoriya had a lot of trouble. Midoriya’s trouble came because he was so deep in the trouble caused by others.\nMidoriya walked up to Shouta, textbooks in arms. So the boy expected to be gone the rest of lecture. Correct, although probably not for the reasons Midoriya expected. \nShouta shut the door, turned to Midoriya. “You aren’t in trouble,” he said. Midoriya nodded, with a look in his eye that said he didn’t believe Shouta in the slightest.\nShouta led Midoriya down the hall, down the stairs, down to his office on the first floor. Midoriya trailed behind, looking confused but resigned.\nShouta unlocked his door and opened it for Midoriya. Midoriya glanced at him, glanced back away, and walked though the doorway.\nThere was two chairs in the room. One of them was plush and school-issued. The other was a foldout. Shouta took the foldout and gestured Midoriya to sit. The boy did, settling lightly, poised to flee. \n“An old classmate of yours tried to release a damaging interview about you,” Shouta said. Midoriya startled. This hadn’t been what the boy was expecting. \nSo quick to assume he was here to be hurt. Shouta knew that, had known that for months, but knowing the barest glimmer behind why Midoriya thought that way was painful.\n“The classmate claimed you cheated your way into UA,” Shouta continued, watching the boy’s fidgeting freeze in place. “You didn’t. Nedzu is far too clever to allow in someone who cheated their way through.”\nMidoriya nodded, clenching his fists. \n“Appropriate agencies are making sure the interview never makes it to air,” Shouta said. “However, it brought some interesting points to my attention.”\nMidoriya took a breath, looked down, looked away.\n“Midoriya,” Shouta said, using his gentlest voice, the one he used to coax kittens out of cardboard boxes, “were you really Quirkless, in middle school?”\nSomething in Midoriya shut down. Stiffness gave way to limp despair, and the spark in Midoriya gave way to dull acceptance, tempered only by the faintest sparkle of determination.\nThis wasn’t Midoriya, UA student, Shouta realized. This was a glimpse into Midoriya’s dark past. This was Midoriya, middle schooler, kept ever so carefully at bay. Until now.\n“Midoriya,” he said, trying to catch the boy’s attention even as his heart sank. Here, Midoriya utterly, unexpectedly vulnerable, the damage was clear. Here was not a brave hero-to-be, but a child, broken. A child, lost.\n“Midoriya,” he repeated, and this time, Midoriya looked up.\n“Are you going to expel me?” he asked, voice tiny.\nAnd Shouta hesitated. Not for long, because Midoriya was the type with unexpected reserves of strength, the type to power through insurmountable odds, but he hesitated.\nHe hesitated, because damage this deep was costly. A hero had to be able to trust adults, and a hero had to be able to trust themself. Currently, Midoriya trusted no one. Currently, Midoriya was halfway to suicidal.\nHe believed Midoriya could work past it; Midoriya had already made great strides, giant strides, since the beginning of the school year. Shouta has faith Midoriya could, would, keep moving. But if he didn’t, Aizawa would have to expel him, or face his conscience when Midoryia died young and alone in the field. \nMidoriya’s face was crumpling at his lack of a reply. Shouta reached for words that were honest. After everything, Midoriya deserved no less.\n“I don’t think you’ll be expelled,” he said. Midoriya looked up at him through tears. “Let me be clear. Your former lack of a Quirk doesn’t disqualify you. Use your head. I fight essentially Quirkless. I wouldn’t turn away a student who did the same.”\nMidoriya was full-on crying now, suppressed little hiccups shaking his chest. \n“Where I might expel you is the damage you took from being Quirkless,” Shouta went on more reluctantly. “You have to learn to trust the adults, Midoriya. I understand why you don’t. People treated you in ways they never should have. But if you can’t learn to trust adults when they make rules to keep you safe, then you won’t survive being a hero, and I cannot allow that.”\nMidoriya sucked in a breath, struggled to regain control, and fell apart worse than before. Shouta abandoned his folding chair and knelt at Midoriya’s feet, taking Midoriya’s limp hand. “Midoriya. Look at me.”\nMidoriya did, slowly and soggily. “Sensei,” he whispered, sounding broken. “I want to be a hero.”\n“I want that for you too, Midoriya,” Shouta said gently. “Please let me help you.”\nMidoriya shuddered, a violent, full-body, head-to-toe tremble that nearly shattered the carefully brave look on Midoriya’s face. \nShouta waited.\nAnd waited. \n“Okay,” Midoriya said, and dissolved back into tears. \nHe clung to Shouta’s hand, crushing the bones in Shouta’s hand together, and sobbed. Eventually, words formed. “Do—do you think I could have really been a hero without a Quirk?” \nShouta considered Midoriya’s charisma, his overflowing determination, his strategic brilliance that got everyone both in and out of Kamino untouched. “Yes, if you remembered to slow down enough to stop destroying yourself.”\nMidoriya hiccuped out a broken burst of laughter. “That’s what you say already.”\n“That’s my point,” Aizawa murmured. “Problem Child, will you—“\nHe froze. “Midoriya,” he said slowly, “do you think I call you Problem Child because I hate you?”\nSilence. \nThat was answer enough. \nShouta groaned, ran a hand though his hair with his spare hand. “Midoriya. Look at me. This is important.”\nHesitantly, but with a vulnerable sort of confidence he had never seen on Midoriya before, the boy looked up. \n“Midoriya,” Shouta said, gripping Midoriya’s hand, “I call you Problem Child because you cause me a lot of problems, not because you yourself are a problem.”\nMidoriya risked a shaky grin. “Same thing, right?”\nShouta wanted to explode, just once, at Midoriya’s former teachers. Little wonder this child didn’t trust him. “No,” he said firmly. “Midoriya, you are not a burden or a problem. You are a child.”\nMidoriya laughed a little incredulously, then sobered, then blinked, then finally began to process the words. “Oh,” he said, faintly, distantly.\n“I want to help you, not hurt you,” Shouta said with fierce quietness. “Please let me help.”\nMidoriya let out a long breath. “How?”\nNow, Shouta walked carefully. Midoriya was open to him, but still poised to flee—not out of distrust, but ingrained habit. “What would you like to tell me?” he asked. “It’s up to you.”\nMidoriya gulped back another round of what looked like tears. “Can you tell me what you want to know so you can—can help me?” He tasted the words like exotic fruit he wasn’t certain he liked yet.\n“Tell me about your Quirk,” Shouta said, because it all seemed to start there. “I know it came in impossibly late, and that you registered it as “Superpower,’ and that it hurts you if you use too much at once, and that’s about it.” Put that way, he knew frighteningly little about Midoriya’s Quirk.\nMidoriya hesitated, visibly torn.\n“You don’t have to tell me right now,” Shouta said. “You don’t have to tell me ever. But I could help you much more if I knew what I was dealing with.”\nMidoriya took a deep breath. “It’s my Quirk.”\nOf course. Trust wasn’t born in a few minutes, not for an abused child. “I understand,” he said, withdrawing. “You don’t have to tell me anything.”\n“No,” Midoriya said, firm in a flare of confidence. “That’s not it. It’s my Quirk. I can tell you if I want to.”\n“Yes,” Shouta said, confused but hoping.\n“I want to,” Midoriya whispered. “It’s—hard. To carry it. I need to talk to All Might.”\nBlinking at this non-sequitur, it took Shouta a moment to catch up as Midoriya stood, apparently ready to talk to All Might right this instant. “Wait,” he said. Slow down, Problem Child, he almost said, stopping himself at the last second. \nMidoriya turned to face Shouta, rubbing away tear tracks from his cheeks with his sleeve. “Yes?”\n“I’m investigating Aldera Junior High for Quirk discrimination and abuse of power. Is there anything you want me to look for?”\nThe question was an open invitation to tell Shouta what had happened in middle school. Midoriya hesitated. “It wasn’t really Quirk discrimination—“ he said, twisting his fingers into his uniform.\n“It was,” Shouta cut in. “Discriminating against someone for not having a Quirk is just as harmful as discriminating against someone for having a certain kind of Quirk.”\nFrom the watery look on Midoriya’s face, he hadn’t heard this before. Shouta gritted his teeth and resolved to press the full extent of charges to Aldera Junior High.\nHe hoped for Midoriya to confide in him, but he forgot to account for Midoriya’s mile-wide protective streak. Midoriya’s face firmed into some kind of resolve. “Thank you, Sensei,” he said. “Really. But I’d rather you didn’t get anyone in trouble.”\nShouta tasted bitter disappointment for only a moment before he realized its source. “This is about Bakugo,” he said, less a guess and more a confirmation. \nMidoriya flinched. “He was just—young. Everyone kept telling him that it was okay to do the things he did, because he was going to be a strong hero one day, and because, because I was—“ He sucked in a breath. “—Quirkless,” he breathed. \n“And that will be taken into account,” Shouta promised, heart sinking at Midoriya’s words. A system that let future heroes run unchecked while stepping on anyone weaker was toxic to everyone involved. “Midoriya, you understand why I have to press charges?”\n“So no one else gets hurt,” Midoriya mumbled. “But—“ He looked helplessly up at Shouta. \n“Bakugo was a child raised in a toxic system,” Shouta said quietly. “I’ll see what I can do.” This seemed to comfort Midoriya, although perhaps it shouldn’t. If Bakugo had done something serious, Shouta couldn’t in good faith ignore it.\n“I’ll talk with you again later. Midoriya, you can come to me when you have concerns. It won’t be a bother. That’s my job.”\n“Okay,” Midoriya said, an edge of doubtful incredulity still lining his voice. \n“I mean it,” Shouta said. “Those aren’t empty words. Are you ready to get back to class?”\n“Actually,” Midoriya said, cautious in the new trustspace between them, “I need to talk to All Might. It’s important.”\n“All Might is busy teaching heroics to 1B, which is also important,” Shouta said. “Is it an emergency?”\nMidoriya shook his head. “It can wait, I guess,” he mumbled.\n“Good. Talk to him after class gets out.” All Might sometimes grated on his nerves, but Shouta was just realizing the miracle it was that Midoriya trusted any adult with his secrets. If Midoriya needed to talk this one out with All Might, the man would be more than happy to do so. \n“Does All Might know you were Quirkless?” he asked, turning away from Midoriya to allow his student some semblance of privacy after such an emotionally wringing discussion. \n“Yeah,” Midoriya said, and there was another flare of anger in Shouta’s chest. All Might should have known enough to think to tell Aizawa that. But All Might, for all his strength, was still new to teaching and genuinely might not have thought Aizawa needed to know. \nCurse the man.\nThe bell rang for class change. “I should go,” Midoriya said, the words half a question.\n“If you think you’re ready to do people,” Shouta said. Midoriya nodded, wiping away the last of his tears and walking slowly out the door, apparently lost in thought.\nRight. \nShouta kept the gentleness on his face until the door shut. Then, he ripped open Midoriya’s file.\nIncident report. Incident report. Midoriya hurt himself, said one. Midoriya hurt himself again, said another. There were inches of these. \nShouta flipped to Midoriya’s registration paperwork. At the top was a photo of Midoriya, smiling shakily. Below was school information—high grades, faint praise from teacher recommendations, a startling lack of extracurricular activities. Midoriya was smart, unliked, and isolated, Shouta had thought when first reviewing the file. Now, the memory came back full force.\nHow could he have been so stupid as to overlook this? It was clear on second glance that something was wrong. Teachers were never unhappy their student made it into UA. \nHe knew the answer. Cold weight settled in his stomach, shame curdling deep.\nHe had overlooked the facts because he had been planning to expel Midoriya the first day of class. The teacher comments had only backed up his assumption that Midoriya was not ready for UA. \nStupid. So, so stupid, and his student had been paying the price for his arrogance for months now. He should have been helping Midoriya all this time, but no. \nHis pocket buzzed. He yanked his phone out, and checked the screen.\nIt was Nedzu, emailing the necessary permits and paperwork to investigate Aldera Junior High. \nGood.\nHe scanned the email. The staff were quite eager to oblige the principal of UA, Nedzu had written. Of course, I didn’t tell them who I was investigating.\nA small, hot part of Shouta was glad that Nedzu was on this case. Nedzu had a vindictive streak, and it came out when he was angry. The principal hadn’t bothered with force to get the information; he had cheerfully asked for it, and the staff gave it gladly, not knowing they had probably just ended their careers in so doing. \nI have taken the liberty of scanning some of the most alarming videos, cross-referenced with any incident report where Midoriya was blamed, Nedzu continued. The videos are attached.\nThe email ended there. No conclusion, no wrap up. Just those words, burning their way out of the screen.\nHe scrolled down to the attached video footage. Clicked Clip #1. Clicked play.\nAn group of children beat down Midoriya to the point of collapse in the hallway. A teacher walked past. Glanced at the participants. Kept walking. \nClip #2. A blond boy—Bakugo—threw charred papers in a fountain while other children pinned Midoriya against the wall, laughing. \nClip #3. Children clustered around a desk, scattering as Midoriya walked in the room. Walked to the desk. Looked at the words scribbled on it and sat down mechanically. \nShouta hit pause on Clip #4 as it loaded. \nIt was clear already, from less than five minutes of footage, that Aldera Junior High had no welcome for a child born without a Quirk. Why should Midoriya think UA would be any different? Of course Midoryia felt welcome now, now that he had a golden Quirk. But deep down he would think he wasn’t worthy of the admiration of his classmates, of the basic humanity of his teachers. The moment he learned Shouta knew he had been Quirkless, he expected to be expelled. \nThis went deeper than fury, deeper than rage. Shouta was supposed to protect his students. Now, to find out Midoriya had suffered institutionalized abuse and expected more of the same from Shouta?\nIt was time to put an end to this.\nIt was time to talk to Bakugo Katsuki.\n\n\n\n“You’re here to talk with me about Midoriya,” he told Bakugo after reviewing all 124 clips. He settled into his foldout chair, scarf poised for action.\n“I didn’t do anything to him in training, I knew the fucking nerd could handle an all-out attack—“\n“This isn’t about training,” Shouta cut in. “This is about middle school.”\nBakugo’s face twisted, and the boy glanced away. “Alright. You gonna expel me, or what?”\nThis was the second time he had been asked that, today. “I don’t know,” he said, for the second time that day. “That depends.”\n“Depends on what?” Bakugo asked, voice half-ragged.\n“It depends on you.” Shouta leaned forward, discarding his exhaustion. “Are you aware what you did to Midoriya?”\n“I fucking hurt him, that’s what,” Bakugo snarled. “I know. I burned him. I see the scars in training, sometimes.”\n“No,” Aizawa said. \nBakugo glanced up, eyes burning with angry shame. “What?”\n“You didn’t burn him,” Shouta said. “You broke him.” He didn’t say he won’t trust me, because that was the fault of Midoriya’s teachers, not the fault of Bakugo. He didn’t say you were the reason he was bullied at school, because he had seen the other children hurt Midoriya, sometimes worse than Bakugo did. \nHe did say you broke him. “I don’t know what you have against the Quirkless,” he spelled out, “but Midoriya has never held anything against you. He has always considered you his friend. He learned to expect abuse from society, from teachers, from classmates. But you were the one who taught him to expect abuse from friends.”\nHe watched the words take. Bakugo sank in on himself, quiet. \n“If you can’t expect kindness from your friends,” Shouta murmured, “you can’t expect it from anyone. You broke Midoriya’s heart, and that is the strongest part of him.”\nBakugo flinched. \n“Fortunately for you, Bakugo Katsuki, hearts are like bones. They can heal. Midoriya has done quite a bit of healing, hasn’t he?”\nBakugo jerked out a stiff nod.\n“But like bones,” Shouta went on, “continually breaking something makes it more fragile. Break it too many times, and, well—“\nHe stood up. “Midoriya Izuku has some of the most potential as a villain that I’ve seen in any student,” he said, with blunt force. “He has the charisma, and he has the brilliance, and he has the strong reason to turn his back on society. Do you understand what I am saying?”\nBakugo looked down. “He wouldn’t. You don’t understand how fucking badly Deku wanted to be a hero.”\n“And you,” Shouta said, level, “don’t understand how many villains wanted to be heroes before society told them they couldn’t. You don’t understand how little it can take for an abused child to snap. I know. I’ve seen it. Rest assured, the fact Midoriya is no villain is fully his decision. You were the one pushing him toward villainy.”\nHe paused to temper his cold rage. “Heroes stop villains,” he said, deadly quiet. “They don’t create them. Do you understand?”\n“Yes,” Bakugo bit out. “I understand.”\n“Then you are on extreme probation,” Shouta said, sinking back into his chair. “If you could not understand the extent of your actions, you would be out. At my word, you can still be out—not just out of UA, but out of every hero program in the country. Do you know why I let you stay?”\nBakugo, finally, looked up. “No,” he said.\n“Then you are beginning to understand what you have done,” Shouta said. “First, you are not expelled because you were a child told that your actions were right.” He paused. “That is not enough to excuse you. You should have known better. Second, you are not expelled because I have seen you work to change. That is still not enough to excuse you, because you have irrevocably harmed another child. That is what villains do, not heroes.”\nBakugo nodded, tense.\n“Third. Midoriya asked me to not expel you.”\nBakugo let out a bitter little laugh. “Of course he did.”\n“Justice demands you be expelled immediately. Mercy asks you be given one more chance. There’s no mercy in the hero industry.”\nBakugo sunk back in on himself.\n“There is mercy in Midoriya, though, and that is something I refuse to crush out of him.” Shouta leaned forward. “Do you understand? You are here not because you deserve it, but because I will not let you hurt Midoriya in this final way so long as you do not touch a hair on his head.”\nBakugo was still, and hunched, and silent. \n“Do you understand?” Shouta pressed.\n“I understand,” Bakugo croaked.\n“Good. I need to talk with Nedzu about the terms of your probation. At the very least, you are not going to be using your Quirk anywhere near Midoriya for the next several months.”\n“Understood.”\n“Good.”\n\n\n\nHe talked to Nedzu next. \nNedzu was already halfway through drafting an formal itinerary of offenses when Shouta walked in. He had to give it to the principle—Nedzu did nothing by half measures. \n“Shouta,” Nedzu said. “How was your talk with Midoriya?” There was only the slightest hint of irritation in his voice; Shouta had deliberately positioned his time with Midoriya well away from Nedzu’s many cameras in the building. Nedzu lived and died off information.\n“Midoriya is as well off as I expected,” Shouta said. “There’s a lot of damage, but there’s a lot of determination to get better. I think he’ll make it.”\nNedzu’s tail twitched. “And?”\n“And the rest was private,” Shouta said evenly. “Ask me about Bakugo.”\nNedzu sighed. “Yes, Bakugo. He has a history of bullying. I’ve drafted the expulsion forms for you.”\n“Keep them on file. Don’t give them to me yet.”\nNedzu shuddered all over—the principal’s version of a shock response. “You aren’t expelling him?”\n“Yet,” Shouta said, briefly questioning himself.\n“I have made it a policy,” Nedzu said, slow and careful, “to make every decision as if I have to justify it to the press five years from now. The past few months have shown the wisdom of this approach. Tell me your reasoning.”\n“Bakugo was a kid in a broken system,” Shouta said, quiet. “Teachers failed to discipline him, implicitly telling him his actions were acceptable. He hasn’t demonstrated overt intent to harm Midoriya since the battle trials. And Midoriya asked me to give him another chance.”\nHe took a deep breath. “I’m furious with him. And I’m furious with myself for not noticing before this was spelled out to me. But I work with kids who have potential, and Bakugo has shown potential to be a decent person toward Midoriya.”\n“Decision approved,” Nedzu said, voice slightly strained. “I confess I am torn on how to handle Bakugo. Part of me thinks UA should try to reform him so he puts good instead of bad into the world. Another part of me thinks abusers shouldn’t be given second chances, but I am well aware of my bias.”\nShouta thought of the people who ran Nedzu through increasingly painful abuse in the name of science. “It’s well-founded bias,” he murmured. “I’ll keep it in mind. For now, Bakugo gets one chance, then he’s out. I told him as much.”\n“As I said, I approve,” Nedzu said. “I choose to place my faith in humanity, not brutality. I also choose to make contingency plans for brutality. Tell me the moment Bakugo does anything, and I will launch those plans.”\nShouta nodded.\n“Meanwhile, I would like to speak to the boy on UA’s zero-tolerance approach to bullying,” Nedzu said. “He wouldn’t have passed the entrance exams should we have known of his past. Send him to my office whenever is convenient.”\n“Now is convenient,” Shouta said, rising. “I’ll fetch him.”\n \n\n\nA week later, and Bakugo was in mandatory anger management classes, and out of all hero training classes for two months. A week later, and Midoriya was in school-sponsored therapy and talking almost daily with All Might.\nA week later, and Midoriya was hanging back at the end of class, waving away his friends.\n“Midoriya,” Shouta said. The boy was nervous, standing on first one foot, then the other. Was it the prospective audience? “Come to my office, please.”\nMidoriya shot him a relieved glance. “Yes, sensei.”\nOne five-minute walk later, and Shouta shut the door on both of them. “Alright, Midoriya. What do you want to talk about?”\nIt was the first time Midoriya had come to him, ever. \nThis was new. This was delicate. This was important.\n“You asked about my Quirk,” Midoriya said, breathing in shakily. “A week ago, you—you asked.”\n“Yes,” Shouta said, sitting down carefully in his foldout chair. “I did.”\n“My Quirk,” Midoriya said, combining hesitance and boldness quite efficiently, “is called One for All.” \nMidoriya paused, then words came rushing out of him like a breath held too long. “One for All is a power stockpile Quirk that is passed from one person to the next, building strength as it goes. All Might had it before me. The Quirk was created to counter All for One, and—“\nShouta felt his world dip into ice water. “Stop. Midoriya, stop.”\nMidoriya stopped. \n“All Might gave you a Quirk to fight the man that destroyed Kamino Ward at a thought?” he clarified, slow anger rising.\n“Well, he thought All for One was dead when he gave One for All to me, so he didn’t really tell me until later, but then All for One—“ Midoriya caught himself in his babbling. “It’s not as bad as it sounds,” he offered meekly. \nNo, it was worse. Yagi was getting dangerously close to grooming a child to run a suicide mission. If it wasn’t for Yagi’s clear love for Midoriya, Shouta would assume as much. \n“Why did you accept the Quirk?” he asked, shifting topics to delay his anger. \nMidoriya’s face went blank with non-comprehension, and he fiddled with his fingers. To a formerly Quirkless child, perhaps the answer was too obvious to warrant such a question.\n“Why did you want a Quirk?” he asked instead, since a great deal hinged on the answer. Was it repressed bitterness at being a social outcast? Was it the burning desire to be a hero? He could honestly see either one in Midoriya.\nMidoriya’s face cleared, but only a little. He still thought the answer was overly obvious. “I want to save people, sensei,” Midoriya said, his nervous fidgets stilling. “I’m going to help people with or without a Quirk, but with All Might’s power—with my power—I can do so much more.” Midoriya looked up, eyes burning. “I’m going to be the next symbol, and I’m going to make sure people feel they can always be saved. Even the villains. Even the Quirkless kids. Everyone deserves to be saved.”\nEvery once in a while, Shouta would catch glimpses of his students as pro heroes.\nThis was one of those moments. Midoriya’s back was straight, his words sincere, and the room hummed with the sort of electric energy Shouta had learned to expect from Midoriya’s Quirk. More than that, the room shone incandescent with Midoriya’s determination.\n“And you expect to accomplish this how?” he asked.\nMidoriya nodded, again a slightly skittish high schooler. “With you, sensei.” There was real trust in his words, fragile but present. “You said you wanted to help me, and I realized I couldn’t do this without help.”\n“Why are you telling me this, Midoriya?” he asked, shaken with the weight of the revelations. “You wouldn’t tell me that you broke your arm, a few weeks ago.”\nAnd—there. A hunch of the shoulders, a huddle inwards, and Shouta was faced again with the surface-level middle schooler Midoriya had been. “Because you listened,” Midoriya mumbled, “and because you believed me. I didn’t—I didn’t know teachers did that,” Midoriya said through halting words. “But you do.”\nAldera Junior High was going to burn.\n“I’ll always listen,” he promised, leaning his weight forward. “Midoriya, teachers have a duty of care toward all their students, and I chose you as my student the first day, when I didn’t expel you. Do you remember what I said?”\n“That I have potential,” Midoriya whispered.\n“You do,” Shouta said. “Do you remember why you lost my trust?”\nMidoriya startled at the non-sequitur. “Because I went to get Kacchan out of Kamino Ward,” he said.\n“Because you didn’t trust the adults to handle it,” Shouta corrected. “So you went to a place you weren’t ready for, and nearly got killed for it.”\nMidoriya blinked up at him, slow comprehension dawning. “You want to keep us safe by expelling us,” he said.\nAizawa sighed, sharp. “Yes.” And Nedzu let him, because Nedzu was aware how fragile a moral line UA walked between raising heroes and raising child soldiers. \n“Midoriya,” he said, “if I had known how hard it was for you to trust your teachers, I could have helped you sooner. I need you to trust me, or I can’t keep you safe.”\n“I’m not used to being safe,” Midoriya said bluntly. “I’m used to helping people. Aren’t heroes people who put themselves in danger to help others?”\nAnd here—here was the crux of the issue. “Heroes put themselves in reasonable danger to save lives,” Shouta corrected. “It is rarely wise for heroes to throw their lives away to defend someone. The amount of people they could save if they stayed alive is too high.”\nHe watched Midoriya struggle with that. \n“This is something we cover your second year,” Shouta said, the words dragging out, “but given your class’s exposure to high-risk villain attacks, I think we need to move it up. Listen, Midoriya. It is never worth it to die without good reason.”\nHe thought of the final video clip Nedzu had sent him, the one that made him nearly expel Bakugo on principle alone. If you wanna be a hero that badly, there's a quick way to do it. Believe that you'll be born with a Quirk in your next life and take a last chance dive off the roof!\n“Your life matters,” Shouta breathed, realizing the child before him probably hadn’t heard the words from anyone but his mother before. “Midoriya, if you die to save a person, someone is still dead. That’s still a less than optimal outcome.”\nMidoriya shuddered, shook his head, closed his eyes. “But people are worth saving.”\n“So are you,” Shouta said, trying to gentle his fury. “So are you, Midoriya.”\nHe let the boy process this, Midoriya’s eyes flickering back and forth as his ever so clever brain tried to accommodate the words into his worldview. Clearly, it would take time.\nAizawa would make time.\nRight now, what Midoriya seemed to need was time to process. “That’s enough for today,” he said gently. “Thank you for telling me about your Quirk. It will help me help you.”\nMidoriya nodded, still lost in thought.\nSo Shouta collected up his things, promised Midoriya that he could always come to him, and went to scathe Yagi for not telling him about One for All to begin with.\n\n\n\n“Hey, Bakugo, Midoryia,” Ashido called out, tipping back dangerously far in her chair. “Did you hear they’re closing Aldera Junior High? Wasn’t that where you guys went to school?”\nShouta watched as Midoriya fidgeted, the boy nervous but quietly pleased. “I heard,” Midoriya said, but offered nothing more.\n“Gah, you’re no fun,” Ashido said, groaning in despair. “I want gossip! Horror stories! Tell me something interesting, Bakugo.”\n“The place was a wreck,” Bakugo said. “People had no fucking respect for anyone.”\n“Yikes,” Kirishima said. “It must have been pretty bad.”\n“Good thing it’s closing,” Uraraka said, with a quick glance at Midoriya. “You okay, Deku?”\nMidoriya smiled, starting shy and getting stronger. “Never better.”\nShouta kicked the podium with his boot, catching everyone’s attention. They all turned to look at him.\n“Three seconds to quiet down,” he said. “Better. Now let’s get on with training you all to be decent heroes.”"
}