{
    "id": "22429246",
    "url": "https://archiveofourown.org/works/22429246?view_full_work=true",
    "author": [
        "Ark"
    ],
    "title": "home is nowhere, therefore you",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "The Witcher (TV)",
        "Wiedźmin | The Witcher Series - Andrzej Sapkowski"
    ],
    "relationships": [
        "Geralt z Rivii | Geralt of Rivia/Jaskier | Dandelion"
    ],
    "characters": [
        "Geralt z Rivii | Geralt of Rivia",
        "Jaskier | Dandelion"
    ],
    "additional_tags": [
        "Adventure",
        "Fairy Tales",
        "Love Confessions",
        "Angst",
        "Humor",
        "Sex",
        "Smut",
        "Geralt's Canonically Giant Cock",
        "Topping from the Bottom",
        "Bottoming from the Top",
        "Rimming",
        "Oral Sex",
        "Anal Sex",
        "Just Generally a Lot of Sex Here Folks",
        "Geralt Uses His Words"
    ],
    "language": "English",
    "series": "",
    "published": "2020-01-27",
    "completed": "2020-01-30",
    "words": "18,134",
    "chapters": "2/2",
    "comments": "809",
    "kudos": "17,676",
    "bookmarks": "3,805",
    "hits": "212,770",
    "summary": "<p>\"Right, well,\" Jaskier says, when he halts before Geralt. Up close, he looks much more nervous. There is sweat on his brow and his collar is damp with it, and his teeth keep catching on his lower lip. \"True love's kiss. There's—ah—there's nothing to it.\" And he bends, the utter imbecile, and kisses Geralt full on the mouth.</p>",
    "notes": "<p>Many thanks to you lovelies on tumblr, Twitter, and ao3, and to Henry Cavill's commitment to the bit. Title from the Reginald Shepherd poem \"<a href=\"https://www.poetryfoundation.org/poems/49268/you-therefore\" rel=\"nofollow\">you, therefore.</a>\" <br> </p>\n<p> <em>and you fall from the sky<br>with several flowers, words spill from your mouth<br>in waves, your lips taste like the sea, salt-sweet (trees<br>and seas have flown away, I call it<br>loving you): home is nowhere, therefore you,<br>a kind of dwell and welcome, song after all,<br>and free of any eden we can name<br></em></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>And we're back! Thanks so much to everyone who has commented, liked, and reblogged/retweeted this story. I love you and the horse you rode in on.</p>\n<p>I'm on <a href=\"https://et-in-arkadia.tumblr.com\" rel=\"nofollow\">tumblr</a>, theoretically on <a href=\"https://twitter.com/et_ark\" rel=\"nofollow\">twitter</a>, and am spending a lot of time thinking about chamomile these days. I also think that you're great.</p>",
    "text": "All through the night, Jaskier plays on.\nHe plays every song he's ever written, and every song he knows, and songs that he makes up on the spot—Geralt can tell, though the bravado of the bard's performance wavers but a little. \nHe plays until the skin is flayed from his fingertips, and then, when he must put down his borrowed lute with shaking, bleeding hands, he sings until his voice breaks. He sings broken-voiced, rasping melodically, until the sun comes up. As the sun rises he is on his knees but still making music, beating out a rhythm on the underside of a golden bowl with his palms.\nThe cold-eyed fairy queen cannot say that Jaskier failed in his side of the compact. Geralt watches as at last she nods, and the pressure in his chest lessens. Fairies are bound to their word. Jaskier is free to leave this wretched hill. Jaskier is free.\n\"You are talented, for a human,\" says the queen. \"Stay among us and you will live a thousand years.\"\nSomehow, Jaskier makes it back to his feet. Somehow, he sweeps his courtliest of bows. \"My lady, I am undeserving of such an honor. Only permit me to sing of your beauty when I return to the realms of men.\"\nSometimes, Jaskier isn't stupid. She smiles at that—the first smile they've seen from her throughout this unfortunate chain of events. \"Very well.\" She slides a ruby ring worth a castle and a half from her long, slender finger. \"Take this with my compliments and go, bard.\"\nJaskier does not move. It seems to Geralt that no one in the gold-hued fairy ballroom moves then. Geralt, who is lashed down by the most powerful magic he's ever encountered, does not have the luxury of moving. \nJaskier's eyes flick in his direction, and Geralt tries to blink with frantic urgency: Go—go—go, his eyelashes shout. Fairies may be bound to their word, but they are fickle, and hate to lose. Jaskier only has the slimmest window of opportunity to depart before some loophole in his bargain is called to light, and he, too, is trapped without hope of escape.\n\"Your pardon, gracious queen,\" Jaskier says. By the way he perspires, Geralt can tell that they're both fucked. If Geralt could groan, he'd groan. \"I believe the agreement was that I might have the pick of your treasures to carry off, if I could please you with my little musics until dawn.\"\nShe narrows her eyes. Fuck. \"Don't be a fool, boy. This ring will bring you fame and fortune beyond your wildest dreams.\"\n\"Be that—be that as it may,\" Jaskier says, and squares his shoulders, \"I'm afraid I really have my heart quite set on—that.\" He points, his hand only a little unsteady, and indicates the low wooden footstool upon which Geralt is miserably crouched for the foreseeable future. Gasps from the watching, glittering court of riveted fairies. \n\"Impossible,\" snaps the queen, and now Geralt can see the anger in her eyes. \"The Witcher knew the conditions when he so callously helped loose its former occupant. I grow tired of bartering with you both.\"\nIt's true that Geralt was warned of the price in advance. He and Jaskier had succeeded in helping the duke's son from captivity—in a twist of events, with the aid of the duke's son's fairy paramour—and seen the young couple flee to safety. All that quelled the queen's fury, and prevented her from bringing down the hill's tunnels on their heads, was Geralt's offer to take the prisoner's place, and Jaskier's to play until sunrise. \nIt's true that Geralt had known what would bind him, but somewhat less true that he knew just how formidable the magics would be. He's done a mental calculus, and altered his initial estimate of being able to break the spell of his own accord in a few months of concentration to several dozen years of concentration. \nIt's not, perhaps, his best or smartest decision, but he made it, and there's little use in grinding his teeth. There’s no other way out for him, and he’s borne far worse. All that he will be unable to bear is if Jaskier wastes his own chance to leave. So Geralt keeps blinking at him to go, to fucking just go already. \n\"Many apologies, madam,\" says Jaskier, bowing elaborately again, \"but I really must insist upon the footstool. That is the treasure I ask of you.\"\nThe queen narrows her eyes and clenches her fist, and in the distance the ground rumbles as a tunnel hastens to collapse in on itself. She smiles through blindingly white teeth at Jaskier. Her teeth are pointed and sharp. \n\"As you wish. It cannot, of course, be taken while occupied. You are aware of how it binds. Try, if you like, but know that if you fail, the way back to the realm of men will be closed to your forever. Either way, our contract is void, for I never agreed to relinquish the Witcher.\"\nGeralt cannot yell or properly thrash, but he strains against the magic hard enough that he succeeds in toppling over the footstool, and him upon it. He lands heavily on his shoulder, and is fast righted by a pair of fairy guards. Surely Jaskier, the fool, will register Geralt's rebuttal in this action. Surely even Jaskier will receive the message.\nJaskier looks back at the queen, and the message bounces right off of his thick skull. \"I accept these terms,\" he says. \nWhen he pivots toward Geralt, he should look more afraid than he does, Geralt thinks—Jaskier, the clod, is following his own dreamy bullshit into doom. Jaskier strides across the polished marble floor with a sure step. Every gaze in the fairy court is locked on him, while Geralt is trying to glare him into not being a confounded idiot. It doesn't work.\n\"Right, well,\" Jaskier says, when he halts before Geralt. Up close, he looks much more nervous. There is sweat on his brow and his collar is damp with it, and his teeth keep catching on his lower lip. \"True love's kiss. There's—ah—there's nothing to it.\" And he bends, the utter imbecile, and kisses Geralt full on the mouth. \nHeat surges through Geralt, steals his breath away. Warms magic-numbed limbs all at once. His hand, shocked into finding it has a free range of motion, shoots up and grasps Jaskier's doublet at the throat. Geralt yanks him closer. Jaskier's eyes go wide, but he goes. He puts his bloodied hands on Geralt's shoulders and slips his tongue into Geralt's mouth, the cheeky bastard, and Geralt closes his eyes because they're bathed in blinding white light. He hears fucking bells.\nThe light fades and the bells stop clanging, and Geralt stands up. Jaskier is red-cheeked, but makes a smart decision for once and falls back behind Geralt's shoulder as they turn to face the outraged queen.\n\"What sorcery is this?\" she demands.\n\"Only your own,\" says Geralt shortly. \"We'll be going now. Your majesty.\" The briefest glance back. \"Jaskier.\"\n\"Fair lady, I will spread word of your beneficence far and wide—\" Jaskier starts. The queen summons a noxious ball of red light and hurtles it toward them. Geralt knocks him sideways before it can hit. Jaskier makes a grab for the footstool, tucks it under his arm, turns to the stunned crowd and says, \"Erm—thank you—you've been a most attentive audience—\" and then they're headed for the tunnel passageway at a dead run. \n\"Go!\" Geralt snarls at him, and this time, Jaskier actually listens, dashing ahead as Geralt turns to deal with the first of the guards sent after them. They're dispatched easily enough, but more of their fellows are poised for action, armed with bows and wicked little poisoned arrows. \nGeralt traces the Sign of Quen in the air, and not a moment too soon—a rain of arrows bounces off of the protective barrier. It won't hold them off for long; he's as good as dead here at the mouth of the tunnel. With a final look back at the fairy court in uproar, he plunges into the darkness of the twisted passageway to the surface they'd traversed what feels like years ago. Knowing how time works in the realm of the fairy, it's all too possible that it has been years. Possibly centuries. \nThe path is steep, rocky, and uneven, and already he can hear the rumbling of the ground as it quakes under the queen's will. Geralt rounds a bend at speed and all but collides with Jaskier, who is waiting there instead of running, but he hasn't the breath to chastise him. \nTogether they scramble toward the distant light, dodging stalactites that fall like spears, and boulders that hurtle down at speed. The whole tunnel threatens to collapse, and sometimes does, with Geralt only just managing to get them another few feet with bursts from the Sign of Aard. He can't keep this up for long, though, the next rock-fall is sure to—\nA torch suddenly blazes ahead, and the ground stills. The duke's son, wielding the torch, is gesturing at them wildly, while the fairy beside him has her hands braced to the wall of the tunnel, face contorted with effort.\n\"Hurry!\" she calls. \"I can't hold against her magic for long!\"\nThey hurry. Staggering, panting, and with a worrying sort of wheeze from Jaskier, they all stumble free of the tunnel and out into the blessed open air just as the entire hill seems to convulse and fold in on itself. Where the entrance to the tunnel had stood is naught but green grass and a slope of pretty blue flowers bending in the wind. \nEveryone sits down. Jaskier lies down. A good while later, the fairy says, \"I'm sorry about my mother. She has a bit of a temper.\"\n\"A bit,\" allows Geralt.\n\"We were sure we'd seen the last of you,\" says the duke's son. \"My darling insisted that we wait, and I'm glad of it. How did you escape?\"\n\"Interesting story,\" says Jaskier. He's stretched out on the grass, eyes closed, hands folded on his breast. \"Look for the ballad in two to three weeks' time. It’ll be making the rounds at all of the best taverns.\"\n\"How can we thank you?\" asks the duke's son. \n\"Pay him what you have,\" says the fairy, her pointed chin inclined toward Geralt. \"Your father is not like to hold up any agreement he has with the Witcher, when you return with me in tow.\"\n\"Now, sweetheart, you know that isn't true—\"\nBut they all know that it is true enough. Wordlessly the duke's son hands Geralt the heavy purse from his belt. The fairy goes to Jaskier's side, then kneels beside him. Jaskier struggles to sit up. She shakes her head.\n\"You must have been very brave,\" she says to him, and gently lays her hands over his. \"I've seen few musicians succeed in playing until sunrise, fairy or no.\" While they watch, the ruined, still-bleeding mangle of Jaskier's fingertips knits slowly back together. The pain must have been agonizing, the healing yet more so, but Jaskier lies quiet and still until his hands are whole again. \n\"My thanks, gracious lady,\" Jaskier says, and this time the admiring words have no hollowness in them. \nA smattering of farewells, and then the couple is walking to the main road, arm in arm. They do not look back.\nGeralt and Jaskier sit in the grass. Jaskier mutilates a number of blue flowers, ripping petals off one by one, scattering them to the breeze. \nAt last, Jaskier says, \"I could eat,\" and Geralt starts breathing again. The riot in his chest quiets. Momentarily.\n\"As could I,\" says Geralt.\n\"I could really, really drink,\" says Jaskier.\n\"As could I,\" says Geralt.\n\"Let's get away from this place,\" says Jaskier, \"and not come back.\"\n\"Wisdom at last,\" says Geralt. But he's smiling a little to take the bite from the words. Not that Jaskier is looking at him. \nThey find Roach where they left her, and mollify her with carrots from the saddle-bag. Geralt swings onto her back. Then he holds out a hand, and lifts Jaskier up behind him. It's an easily-done maneuver they mastered years ago, have executed countless times. This is the only time that Jasker hesitates before his arm steals around Geralt to hold on. Under his other arm, the wooden footstool is tucked.\nRoach carries them far away, fast as she's able.\nThey break for camp at sunset, setting up quietly. Jaskier collects kindling for the fire while Geralt rustles up some rabbits. Then Geralt cleans the rabbits while Jaskier clears the ground and lays the stones for a fire-pit. Then Geralt lays the logs and kindling and starts the fire while Jaskier dresses the rabbits with herbs and digs out the liquor. \nThey've done this so often that it's like a dance, each taking their parts without complaint. Jaskier used to complain, about tasks that got dirt under his nails, or guts on his best jacket, but that was a long time ago. Neither of them say anything until the meat is well-roasted, and then speech is in regards to logistics:\n\"Please pass over the salt-bag,\" says Jaskier.\n\"Here,\" says Geralt.\n\"More vodka?\" asks Jaskier. \n\"Yes,\" says Geralt. \nThey're both cradling their second tin cup of spirits when Jaskier lifts something from behind him into the flickering light. He turns the footstool from side to side. \"Think it will burn?\"\n\"It's wood,\" says Geralt. \n\"Good,\" says Jaskier. He pitches it into the fire, which crackles with welcome. They watch as the flames slowly crawl over the stool's intricate carvings, then catch.\nGeralt clears his throat. This has gone on long enough. He's a Witcher. He shouldn't be so hesitant on uneven ground. Uneven ground—uncertainty—is his forte. Perhaps it's the certainty that's hobbling him. \"Listen, Jaskier—\"\n\"Don't worry,\" Jaskier says. He drains his cup and reaches for the demijohn for a refill. \"I'll be gone in the morning. Drink up, Geralt, and go to sleep, and soon enough this will all seem like an unfortunate dream.\"\nGeralt feels it at first like a direct hit, hard enough to crush the air from his lungs. If he were standing, he'd have staggered sideways, or doubled up. He flinches from the bright flash of pain. It's raw, and terrible, and like nothing he's ever felt before—like nothing anyone expects him to be able to feel. \nHis first instinct is to close himself best he can, so long his default. What else did he expect, save that this would of course be rejected, called a mistake? Unfortunate. But he knows Jaskier well enough to hear the catch in his voice, and his eyes are quick enough to see something like agony flit across Jaskier's face before he masks it.\nSo Geralt blinks at him. \"Why?\"\n\"I never intended you to know,\" says Jaskier. \"When people try and love you, you leave them behind. For their own safety, you say. I didn't want to be left behind, and I won't be. So I'll go of my own accord, thank you very much.\"\nGeralt looks at the fire. The footstool is coming apart, burning merrily. He looks at the empty tin in his hand and sets it down. He looks at Jaskier. He blinks, again, because it's true enough, what Jaskier says, but that's only the half of it this time.\n\"But I had to try and free you, and I'm not sorry that it worked,\" Jaskier is saying. \"Or else we'd still both be under that hill. And I hope you know I'm going to get a truly epic ballad from this. I know a crowd-pleaser when I'm mentally composing it, and—\"\n\"Jaskier,\" says Geralt.\nJaskier waves his hand. \"I'll change the names.\"\nGeralt is in a dark and twisted tunnel, with stalactites slicing their way towards him. He can stay still and safe and say nothing, and in the morning Jasker will be gone. Yet up ahead there is light.\n\"Jaskier,\" Geralt says again. \"You know a thousand folktales.\"\n\"At low estimate,\" Jaskier agrees. \"When I was at Oxenfurt studying, why, I—\"\n\"True love's kiss,\" says Geralt. The riot in his chest has become a battle, threatens to break out into war. \"Cannot come from one alone.\"\nJaskier looks up at him, then away. He pokes at the fire with a stick. \"Stories, Geralt. Hogwash.\"\n\"You were just in a fucking fairy-tale,\" Geralt says, losing patience. \"With fucking fairies. You fucking idiot.\"\nJaskier smiles. \"You're trying to make me feel better. I appreciate it. It's very kind. Unexpected, some might think, but I'm the first to say that you contain multitudes. I always say—\"\n\"True love's kiss,\" growls Geralt. People tell him—Jaskier tells him—to use his words, and then they never fucking listen. Words are proving useless. He moves, then, crowding into Jaskier's space, pushing him down, crawling over him. \"Cannot come from one alone.\"\nJaskier puts up his hands, as though to deflect a blow that never lands. Geralt cinches fingers around Jaskier's wrists and presses them back into the earth. He kisses Jaskier's shock-parted lips. Then he noses Jaskier's chin up, and kisses the delicate skin of his throat. Then back to Jaskier's mouth, which is waiting for him this time. \nJaskier kisses him back with more focus than Geralt has ever seen him exert—even when Jaskier was playing until his fingers flayed, playing for his life, he wasn't so intent. Jaskier licks into Geralt's mouth, his tongue eager to find Geralt's teeth. Teeth, those are Jaskier's teeth, closing hard on Geralt's lower lip, refusing to let go, not until Geralt's tongue pushes against Jaskier's tongue, thrusts into Jaskier's mouth like he wants to thrust into—\n\"Fuck,\" Jaskier pants, breaking away for air. Geralt lets go of his wrists. \"Oh, fuck, Geralt.\" \nGeralt raises his eyebrows hopefully. \"You want to?\"\n\"Yes, I fucking want to, fuck you. Just—give me a moment here. Gods. Fuck.\" Jaskier presses on Geralt's immovable shoulders, and Geralt obliges him by sitting back on his haunches. \nHe doesn't want to: Jaskier's taste is in his mouth, headier than their drink, and Geralt’s cock is astonishingly invested after what amounts to a single kiss, maybe two if he's counting how Jaskier kissed him back. He wants to follow the inferno in his head and heart and blood, bury himself in Jaskier for relief and work the rest of it out later. He wants to fuck Jaskier like he's wanted to fuck Jaskier since—since always, when it was never worth the risk of losing, in the exchange, everything else that Jaskier was. Annoying, and flighty, and chatty, and distracting, and stubborn, and tenacious, and loyal, and clever, and witty, and fun, and adoring—\n\"Hold on,\" Jaskier says. He sits up to face Geralt, rakes a hand back through his hair. His lips are kiss-stung. Geralt did that, and now that he’s begun, he needs to do so again. \"You’re saying. You’re saying, that is. You’re saying—you—love me?\"\n\"I was also surprised,\" says Geralt.\nJaskier’s face does something complicated—twists up in half a smile, half a wince. \"I’m in an extremely delicate state right now, Witcher,\" he says, and the half-smile flattens. \"If you’re fucking with me, having a go—please, not about this.\"\n\"Sorry,\" says Geralt, and means it. \"I didn’t mean for it to sound like that. I’m not—not good at this. Not good at recognizing—love. Wouldn’t have known what to call it. I—\" he grits out the words. \"—care about what happens to you. I’d die before I’d let anything—I was going to stay under that hill, glad enough, if you got out.\" He watches Jaskier for reaction. \"Does that count?\"\n\"Yeah,\" says Jaskier. \"Yeah, we can work with that.\" His voice is husky with overuse, barely above a whisper now. \"You aren’t fucking with me?\"\n\"No,\" says Geralt.\n\"Are you bewitched? Enchanted? Ensorcelled?\" Jaskier’s expression darkens as he considers it. \"This is the queen’s revenge, isn’t it? She put a spell on you to fuck with us both.\"\nGeralt pauses, and he double-checks, for both their sakes, but there is no foreign aura of power to be found. He knew there would not be. \"No.\"\n\"That’s exactly what you would say if you were ensorcelled,\" says Jaskier.\n\"Jaskier,\" says Geralt. \nJaskier shakes his head. \"You’re too calm. You’re too calm about this. True love’s fucking kiss. You don’t even like me.\"\nThe fire snaps as the rest of the footstool is consumed. Jaskier is painted in a wash of orange and gold.\n\"You know that isn’t true,\" says Geralt quietly.\n\"I know,\" says Jaskier. \"Apologies. Old self-deprecation habits of self-preservation have a tendency to linger.\"\n\"I’m not calm,\" Geralt says. \"This is how I sound. My heart is racing.\" He reaches for Jaskier’s hand, and, finding no resistance, touches two of Jaskier’s fingers to the pulse-point on his neck.\n\"Melitele’s tits,\" Jaskier breathes. For a long moment they both feel the wild thud of Geralt's heart in his breast. Then Jaskier slips his hand from Geralt’s grasp but doesn’t go far—he brushes the back of his fingers across Geralt’s cheek. \nThe soft touch goes through Geralt like lightning, nearly undoes him. He doesn’t know what to do. He’s been with nervous, unsure lovers, but Jaskier isn’t that. He’s been with brash, overbearing lovers, but Jaskier isn’t that. He’s never been with someone who—Geralt closes his eyes, and when he opens them, Jaskier is watching him without blinking.\n\"Do you want me, Geralt?\" Jaskier asks.\n\"Yes,\" says Geralt. \n\"Did you just figure that one out today as well?\"\n\"No,\" says Geralt.\nSurprise before it can be buried. \"Why didn’t you say someth—no, nevermind, I retract that. Why didn’t you do something, you perfectly oversized bastard?\" Jaskier narrows his eyes. \"Don’t—do not try and say you didn’t know that I was—amenable.\"\nGeralt doesn’t try. \"I knew that you were.\"\n\"Well!\"\nGeralt rests his hands in the grass for grounding. \"What you said,\" he manages at last. \"People try and care for me, and I leave them behind. Or they leave me. I didn't—I didn't want to change how we are.\" Didn't want to lose you, someone more deft with words and emotions might say. Geralt presses his lips together.\nJaskier studies Geralt's face, and Geralt would like to think that he understands: the bard became adept at reading what was underneath Geralt's spoken statements years ago. But Jaskier is also Jaskier, and he won't let Geralt off the hook so easily.\n\"And you decided, in your infinite wisdom, that I'd fall in love with you after a casual fuck?\" Jaskier is kneeling, but Geralt can feel how much he wants to put his hands on his hips.\nGeralt isn't exactly known for backing down either. \"Fell in love with me without one,\" he points out.\n\"Oh, you absolute—\" Jaskier launches himself at Geralt. His propulsion isn't enough to push Geralt down, not without Geralt's acquiescence, but Geralt ends up with a lapful of Jaskier, which is a mutually desirable result. Jaskier straddles Geralt's thighs, shoves his hand deep into Geralt's hair, gets a fistful, and pulls hard. Geralt's chin comes up. His eyes flash, he hopes, with encouragement. \n\"Fuck you,\" Jaskier says heatedly, and he kisses Geralt. It's not an angry kiss, not quite, but a kiss born of years of frustration, a kiss that plunders Geralt's mouth and leaves him aching. Geralt wraps his arms around Jaskier, learning the weight of him in his lap, trying to push away the lurking fear that he will have to unlearn it.\nJaskier pulls back at last, blue eyes dark as he considers Geralt. \n\"If you like,\" Geralt says.\nJaskier's jaw works, but his voice appears to have finally failed him. After some time he rasps, \"If I like,\" mostly to himself. \"If I like.\" He kisses Geralt again, gentler than before, careful about it, tongue stroking Geralt's with slow consideration, the way Jaskier samples a fine wine. Geralt shifts in place, so that Jaskier can feel just how hard Geralt's cock is under such ministrations, and just how much cock there is on offer. Jaskier gives a little gasp into Geralt's mouth, and he rolls his hips in a most promising fashion.\nThen Jaskier says against Geralt's lips, \"I think that we should wait.\"\nGeralt's overheated brain takes too much time to process the sentence. His blood is elsewhere. \"What.\"\n\"Your face,\" Jaskier says, tilting back. He's grinning. \"You should see your face.\"\n\"Jaskier.\" \n\"No, I'm quite serious. Stop frowning. You know I can't bear to be the cause of frowning. I don't mean a long engagement. I just—tell me you still feel the same way tomorrow. Tell me in daylight that you're not ensorcelled, that true love's kiss is real, and I'll show you my entire repertoire in bed. It's as vast and varied as my song catalogue, Geralt.\"\n\"I am not ensorcelled,\" Geralt says, now so painfully hard it's all he can do to push the reply past his teeth, so given over is his entire being to the need to rut. \n\"The morning. Tell me then.\" Jaskier gets to his feet. Keeping still as he does so is one of the more difficult trials Geralt has faced. Mutations were simple compared to this. \n\"You're punishing me,\" Geralt realizes. \"I deserve it.\"\nJaskier laughs. \"Spare us both the martyr routine. I didn't say we couldn't do anything.\" Geralt looks up at him, brow furrowed, and Jaskier offers his hand. They walk to the far side of the fire, where their bedrolls are spread. Then Jaskier lies down, and draws Geralt in beside him. \nWithout speaking, they're pulled together like lodestones, kissing lips, and necks, and ears, then lips again, kissing for so long with no other impetus that Geralt's confused body is more aroused than it's ever been, confused because there is no promise of release and relief.\n\"Never thought I’d see you look out of your element,\" Jaskier murmurs. He thumbs the wet line of Geralt’s mouth. It doesn’t sound judgmental; it sounds wondering, and is spoken softly. \"Hasn’t anyone wanted to just—just touch you, and touch you, and…\" He’s putting word to deed, hands stroking under Geralt’s shirt, tracing lattice-works of scars, breezing over quick-peaked nipples, learning every hard-earned cut of Geralt’s abdomen. \"...touch you some more.\"\nGeralt’s not unused to being touched intimately, of course—but touching as a brief precursor to fucking, which is generally the goal. People have complimented Geralt’s body, admired it, enjoyed it—many people, in fact—but no one’s fingers have waxed rhapsodic over a scarred-over wound to his ribs. No one’s hands have trembled, with nerves and excitement, like Jaskier’s do, simply to explore another inch of him. Geralt shakes his head.\n\"Fools, they,\" Jaskier says, scowling at Geralt’s past lovers, then fast brightening. \"The better for me, since this is all that I want to do with my life.\"\nGeralt smiles above the racket of his pulse. \"False. You want to win the bardic competition at Gulet two years in a row, which has never been done. You want Valdo Marx to grovel for compositional advice at your feet. You want to compose an immortal tri-part epic to be performed at the arena in—\"\n\"Geralt,\" says Jaskier, expression serious now, though his lit-up eyes belie a deeper, happier emotion that may well be joy. \"You know me too well. Allow me to return the favor.\" \nJaskier’s exploring touch seeks lower, and he finds the fastenings on Geralt’s breeches, which he undoes one-handed. Then his hand dips below the waistline, and those devastatingly practiced fingers wrap around Geralt's cock. Well, as much of Geralt's cock as they can manage.\n\"And this is all that I intend to worship now,\" Jaskier says, fervent, as he strokes once from base to tip, \"may the Gods forgive me.\"\nGeralt would laugh if his throat wasn't caught on a groan. Luckily, Jaskier seems more than content to do the talking for them both. His grip is firm and sure, just loose enough at the wrist to make every upward pull a breathtaking event. \nThey lie on their sides, facing each other, eyes locked, and though they're both still clothed, and this act is rudimentary by most standards, Jaskier's enthusiasm, and the fact that it's Jaskier here with him, makes Geralt feel naked and exposed. It's hardly unpleasant, but it's new and rather overwhelming, and before long Geralt is all but panting under Jaskier's hand.\n\"When I say that I know you,\" Jaskier is saying, \"I've heard you do this. In the dark. In the still of the night when you thought I was asleep. How I longed to join you.\" His hand tightens, but does not speed. Geralt does not whimper. \"Some would assume you'd handle yourself roughly. Jerk this magnificent cock hard and quick. But that isn't what you like. Is it.\" Geralt reaches for him in turn, palms the growing swell of Jaskier’s cock through cloth, but Jaskier bats him away, clearly enjoying having the stage. His strokes have perfect rhythm. \"You like it hard, yes, but thorough, and slow. You like to be teased, don't you, brought up right to the edge and left there. I'm right, aren't I,\" Jaskier says, demonstrating this technique. \"I know you.\"\n\"Jaskier,\" Geralt says. He won't beg. Not yet. \"Let me touch you.\"\n\"The sight of you is all I need at the moment,\" Jaskier says, and fuck if that doesn't somehow send yet more blood to Geralt's achingly hard cock. \"And your voice. Tell me, Geralt. Did you ever think about me when you took your cock in hand?\"\n\"Yes,\" says Geralt. What good would suppressing such a truth do now, when speaking it makes Jaskier's eyes flash, and his teeth close over his plush lower lip?\n\"My hand?\"\n\"Yes.\"\n\"My mouth?\"\n\"Yes. Fuck.\"\n\"My ass?\"\n\"Yes.\"\n\"My cock?\"\n\"Fuck, yes, Jaskier, I'm close—\"\n\"Not quite yet. This is far too much fun. You won't come until I tell you that you can.\"\nGeralt growls low, and tosses his head, his body aflame with need, his skin tight with holding back. He nods, somehow.\n\"I've thought about you,\" Jaskier goes on pleasantly, his hand quickening a little, his pressure increasing, \"since the day I met you. At first, granted, it was because of the way you looked. I'm terribly shallow, as I'm sure you are aware. This body of yours. Sweet Melitele. I wanted you to tear me apart. I'd have bent over for you if you'd so much as batted an eyelash to indicate it. Your face isn't awful to look at either. I saw you sitting in that tavern, and I thought—they call that man a killer, and I'll let him butcher me. Happily. I thought—I might get a song out of you, and maybe, if I was lucky, a fuck that I'd not soon forget, since I wouldn't be able to walk for a week thereafter.\" \nJaskier's sly hand slows once more, and Geralt nearly bites off his tongue at the double onslaught of tormenting stroke and the flow of the bard's words. Jaskier says, \"Then you had to go on and be you. Noble, and self-sacrificing, and good, kind to small children and animals—what an exquisite cliche you are. Smart, too, aren't you, though you don't like to let on just how much. Gives you the element of surprise. Strong and brave and righteous—there's never been anyone like you and you know it. That's why you survived so many trials that no one else ever passed through. You're special, Geralt, and you were right—I didn't need a casual fuck to fall in love with you. That happened all on its own because I kept scrambling to follow after you, and at some point you let me catch up. I'm in love with you because I know you.\"\n\"Please—\" It's never been like this. No one has touched him like this, named him like this. He thrums like an instrument come alive under Jaskier's hands. Geralt has the perfectly disconcerting thought that he is being played by a master and too late discovered a better use for his body than fighting. He would be content to stay just like this and learn all the new noises Jaskier can coax from him—only he needs—he needs so badly to—\n\"Yes,\" Jaskier says, leaning in so that his mouth presses Geralt's. \"Come for me now.\"\nJaskier's fist gives an exceptionally tight upstroke, and Geralt thrusts into it and gives over, all of his tightly-held control snapping with Jaskier's permission. His cock spills and spills, liquid heat on his stomach and painting Jaskier's fingers, which keep their hold on him, coaxing yet more from his now-slick cock. \nGeralt groans, the ecstatic surge of his release rocking him forward to catch Jaskier in a kiss, a kiss made messy with teeth and tongues that doesn't stop, and doesn't stop, even when Jaskier lets go and eases his hand free of Geralt's phenomenally ruined breeches. Then Jaskier does stop kissing him, but only because he brings his fingers to his mouth and licks Geralt's seed from one with a long, sensuous lick, mischievous eyes watching Geralt's eyes as he does so.\n\"Fuck,\" says Geralt.\n\"Mm.\" Jaskier smiles, licks clean another finger. \"Tomorrow.\"\n\"Please,\" Geralt says, since that had worked so nicely, \"let me touch—\"\nOnce more, Jaskier moves his reaching hand away. \"Told you,\" he says, and now Geralt can see the pink flush on his cheeks in the glow of the fire's coals. \"All I needed was the sight of you. I'm—good.\"\n\"Fuck,\" Geralt says again. Jaskier doesn't stop him when he reaches instead to comb his fingers back through Jaskier's hair. He curls his hand at the base of Jaskier's neck and tugs him into a kiss that he hopes speaks volumes about how that felt, since Geralt's tongue is still attempting to wrap around the right words. He employs his tongue otherwise, and Jaskier seems happy to wind himself in Geralt's limbs, kissing lazily as the exertion of the whole mad adventure catches up with them.\nFinally, Jaskier pillows his head on Geralt's arm, throws both an arm and a leg across Geralt's body, and settles in. \"Can you sleep like this?\"\n\"Easily,\" says Geralt. He thinks now—with the dying fire beside them, the heat of satisfaction making them heavy and hazy, and such closeness—now would be the time to speak, to whisper what is so difficult for him to say—yet no longer impossible. He has long struggled to recognize love, but now he knows its face. Its face is turned toward him, blue eyes closed. Perhaps Jaskier is asleep already. Geralt will wait until the morning, and prove that this is real, as he intends to demonstrate all the other ways that he is not ensorcelled. So he only presses a kiss into Jaskier's hair. \"Gladly.\"\nAnd since Geralt does not like to lie, and as a rule, tries not to—he is fast asleep.\nHe awakens only once, in the dead of night, eyes flying open to assess his status. It's an old habit, deeply ingrained, and Geralt quickly takes stock. The warmth along one side of his body comes from Jaskier. Jaskier is beside him. \nGeralt remembers all, and smiles, though no one else is awake to see it. Jaskier's head is still on Geralt's outstretched arm, but he has turned away at some point in the night. Instead his back is flush to Geralt's side. Geralt rolls carefully over to fit in behind him. He curls his body around Jaskier's, and his other arm around Jaskier, a distantly aware part of him noting how well they lock together. Jaskier gives a sleepy murmur of contentment and burrows closer. Geralt's breath stirs the soft hair at the nape of Jaskier's neck. He closes his eyes. \nGeralt wakes up cold.\nIt is before dawn, and the fire has gone out. The morning sky is grey and dark. He is alone.\nHe clamps down on panic, but he's on his feet with his sword in his hand before he's aware of deciding to stand. He sheathes the sword. Reasons that Jaskier has gone to relieve himself and doesn't need to be greeted by a blade. Reasons this for several moments. But the woods are quiet—grey, and dark, and still.\n\"Jaskier!\" \nNothing.\n\"Jaskier!\" Geralt is shouting now, panic struggling in his grip. If this is one of the bard's pranks, he'll surely hear Geralt's tone of voice and stop hiding. He'll come out right now.\n\"Jaskier!\" \nJaskier could be injured. He could have gotten up in the night, gone into the treeline for a piss, fallen, and hurt himself. He could be unconscious. He could have been attacked by an animal, maimed. He could have been attacked by a monster, and—\n\"Jaskier!\" \nGeralt searches in a circle a mile-round from their campsite. He finds nothing save startled, wary rabbits. Thankfully, he also finds no blood, no limbs, no garish fabric torn to pieces. He finds nothing.\nHe trudges back toward the camp, hacking at tall plants and curling vines with his sword. They don't deserve his wrath, but Geralt is in no mood to spare them. The rabbits wisely keep away.\n\nDon't worry. I'll be gone in the morning.\n\nGeralt sits down hard on a rotted log as the words come back. The sun is up now, hot overhead, but he feels plunged into ice—numb, and sick, and sinking. \nJaskier left him after all. That shouldn't be surprising. That was, in fact, the most logical, understandable explanation. He awoke to find himself wrapped up in the Butcher of Blaviken and thought better of it. Anyone would. Or he'd left like he said he would, for both his and Geralt's sakes, left of his own accord before Geralt could leave him behind.\nEven if Geralt had no intention of ever doing so again.\nThe sword thuds to the grass and Geralt puts his head in his hands. He breathes through it, and then he recalls the way Jaskier's face had looked with his hand on Geralt's cock, and how Jaskier's voice had sounded saying I'm in love with you because I know you. And the part of him that knows Jaskier—that loves Jaskier—knows that Jaskier would not leave. Not after what they'd shared. Not after what the morning promised. His heart knows.\nGeralt is a master tracker, and Jaskier is incapable of blazing a trail without theatrical stomping about, and there's no sign of him. There are no tracks whatsoever, in fact, save the heavy tread of Geralt's boots. That's alarming, and Geralt's intuition is rising from a whisper to a scream about it, but he pushes away his reaction. Worry will do nothing but drive him to make a mistake. Instead he goes to Roach for confirmation.\nHe finds her chewing on her feed-bag in the copse of trees they'd tied her in the night before. Her saddle is nearby, and there, still lashed to one saddle-bag, is Jaskier's lute. \nGeralt crouches beside it, opens the travel-case. The instrument's wood is sun-warmed, and the strings sing sweetly when Geralt runs his finger across them. Surely Jaskier must now appear to tell him off and tell Geralt to take his ungainly paws off of the true love of his life. \nBut Jaskier does not appear. And Jaskier would not leave his lute behind of his own volition. Not even if he was stealing away after realizing he’d made a terrible mistake in loving Geralt. He'd come for the lute, first and last.\nGeralt closes the case, grabs the saddle, and returns to his horse. \"Did you see what took him?\" he asks Roach, as he does up buckles. She stomps her foot, ears pinned back. \"Yeah. I've a good idea. I don't like them either.\" \nRoach gazes at him reproachfully. It's Jaskier who sneaks her sugar-cubes when he thinks Geralt isn't watching.\nHe strokes her nose as he adjusts her bridle. \"It's all right. We'll get him back.\"\nGeralt tells himself the same as he goes to bury the ashes of the fire, pack their supplies and—his jaw tightens—roll up the bedding. If he thinks too much about the feeling of Jaskier against him, how Jaskier's mouth tastes, he'll lose control, go berserk and help exactly no one in the process. Instead he draws upon all his long years of training to make his body work without his mind. \nThis is how people think Witchers function—divorced from emotion, hollow shells that kill hated things for coin. His mouth is set in a scowl that only wavers a fraction when he sees what he missed when he woke up in near-darkness: there, near where Jaskier had lain, is a clutch of tiny blue flowers. Geralt rips them from the earth and stuffs the lot into the pouch on his belt.\n\"Son of a fucking fairy bitch,\" he says, kicking a stone lining the fire-pit so hard that it shatters against its fellows. \nIt's good to have confirmation, and that gives him an idea of where to go if his first attempt fails. But the fear he's trying so hard not to feel snakes up his spine. Fairies can sometimes be bargained with—when you have something that they want. They are renowned for refusing to return what they take. \nThis time, they have what Geralt wants, and he has nothing to offer in exchange. And—of this he has no doubt—they are not in a bargaining mood.\nRoach moves fast with only Geralt astride, and they make it back to the blasted hill while the sun is still high. Geralt is driven to speed. Fairies aren't known for torturing their captives, at least in the human sense, so Geralt assures himself that Jaskier is not suffering as such. \nBut as Jaskier has heard often enough in legend—that he now, hopefully, believes to be true—if he should eat or drink anything given to him in the fairy realm, there is nothing Geralt will be able to do to retrieve him. Geralt wouldn't put it past the fairies to hold him down and pour wine into his mouth, laughing their high fluted laughter as Jaskier splutters and kicks and curses the day he met Geralt—\nFocus. Geralt faces the hill. He traces most of the Signs that he knows into the air, and draws the rest of them on the ground, to no avail save scorched earth and scattered explosions. He tries riddles and their answers, incantations for discovery and unlocking, even sings a song purported to attract fairies. Jaskier would laugh himself sick. But Jaskier is under the hill. \nGeralt addresses the open air, demands to be seen. Then he asks, plaintive. Offers anything in exchange. Offers himself. The wind stirs the flowers, unbothered.\nHe knows when he's beaten, and time is too dear. Breathing hard and somewhat singed, he climbs back into the saddle. The main road is open and well-kept, and Roach needs no urging to race along it. They reach the high gates of the duke's manse, where Geralt is told in no uncertain terms to fuck off by a squadron of guardsmen.\nHe doesn't have time to fight his way in, get in trouble for slicing up someone important, and be tossed into a dungeon while Jaskier, hungry and thirsty, finds fairy sustenance increasingly tempting. So Geralt smiles at them with teeth, turns Roach around, and rides to the other side of the manse. \nThe walls are high, and mostly sheer, but there are crags enough in the rock to gain scant hand and footholds. He makes it up and over on the second attempt, and manages not to break both legs on the drop down.\nScaling the keep is a good bit easier, and he lets himself in through an open window. He apologizes to the startled servant who watches him enter before he knocks the man unconscious and drags him into an empty room. Then he sets out to search the other rooms, of which there are far too many for any one family, duke or no. \nHe spends too long prowling corridors, dodging servants and guards and well-coiffed members of the household. A growing sense of desperation is reaching its height when he finally finds her alone in an airy room all the way at the top of the dwelling.\nShe is sitting by a bronze mirror, dressed in a fine human gown, gazing at her reflection. Her citron-colored hair has been bound up in the current style, and hides her distinct ears from sight. She can see Geralt come in behind her, and her eyes go round.\n\"Please don't scream,\" Geralt says. \"I'm having a bad day as is.\"\nShe doesn't scream. She tilts her head, curious. That's one thing to be said for fairies: they don't scare easily. \"Why are you here, Witcher? Surely you know that I was right, and the duke will pay you nothing for his son’s return.\"\n\"I need to get back into the hill, and the entrance is gone,\" Geralt says. \"Tell me there is another way in.\"\n\"You're mad,\" she says with a laugh. \"You barely escaped with your skin intact. You can't possibly want to go back. The riches aren't what you think they are. They'll vanish as soon as you bring them into daylight.\"\n\"This isn't about coin,\" Geralt snarls. He palms the flowers from his pouch and throws them to the stone before her. \"They took my friend. The bard. Jaskier. Tell me how to get in.\"\n\"Oh.\" She bends and picks up the flowers, touching the petals with a dainty fingertip. \"I'm sorry, but you must forget about him. There's no other door, and if it has been barred to you, you cannot find it again. Your friend is already lost to this world.\"\n\"No.\" Geralt sways on his feet, the adrenaline that has kept him going starting to falter. He feels every ache, every scrape, his ankle, twisted in the fall from the gate. He stalks forward despite the pain. \"No. I don’t accept that.\"\nShe doesn't shrink away. Up close, he can see that her eyes are red-rimmed from crying. Geralt takes a half-step back. He hasn't the time for it, but— \"Have they hurt you here?\"\n\"Not as such.\" She turns her face from him. \"I knew it would not be easy, trying to live in this realm, but I love him so very much. I was certain I could endure it. And I can. But they—the humans—they hate me. All save Nolan. They hide from me, and curse me behind my back, and sneer when I enter the room. His father is apoplectic, has forbidden us to wed. Nolan pleads the case, but that takes him away from me. So I sit trapped in this room. I think they gave it to me—\" she indicates the wide wall of windows with a wry tip of her pointed chin—\"hoping that I would change my mind and fly away.\"\n\"But you won't, will you,\" says Geralt, examining her proud, unbent carriage. \"You—what is your name? You never said.\"\nShe blinks, as though the question is unexpected, as though no one has paid her any such courtesy since her arrival. \"You would say it like—Phira.\"\n\"Phira,\" Geralt says. He sinks to one knee beside her chair. \"I know something of living amongst those who are afraid of me, and would cast me out. It is hard, but not impossible to bear, when you find someone who—\" he ducks his head, steadies his breath, then meets her eyes. \"The bard. Jaskier. I—love him. He loves me—freed me with a kiss, as you did Nolan. I can't leave him behind. He is all that I have. If there's no other way in, I'll dig up the hill with my hands.\"\nPhira stares at him, struck silent. She says nothing, and Geralt, every muscle protesting, drags himself back to his feet. He feels crushed under an enormous weight that is increasing exponentially. \nThis was the best hope, but he's hasn't exhausted his resources. He hasn't. He just needs more time. He knows Jaskier will try his best to resist food and water and wine, but for how long? How long do they have? The day is slipping through his fingers too quickly. He starts for the door.\n\"Wait.\"\nGeralt waits. He turns back, and her human garments have been cast aside. She wears the short, bare-armed tunic of fairy-kind, her closed wings glimmering in the light. \n\"I will help you,\" Phira says. \"I can open the way.\"\nGeralt almost goes to his knees again, this time in gratitude. Hope swells threateningly in his belly. He tries to tamp it down. \"Why?\"\n\"You and your bard were only in my kingdom to rescue Nolan, who had stumbled into it foolishly, then more foolishly fell in love with me,\" she points out. \"And—true love’s kiss is rare. Once, my people revered it.\" She holds up a hand as Geralt starts toward her. \"I cannot do more than open the path to him. If I go back there it will be worse for you both. It's me that my mother is truly angry with, and she will not relinquish me again. As you said, Witcher—I cannot leave my beloved behind.\"\n\"I understand,\" Geralt says. \"Thank you. This aid is more than enough.\"\n\"Rest a moment,\" Phira says. \"Your ankle is broken. I will mend it, and we will go.\"\nGeralt hesitates, but relents into sitting long enough for Phira's healing magics to take. \"Again, thank you. It would've been tricky to get back over the wall like this.\" A thought occurs to him and he frowns. \"Can you ride? It's a long way to the hill.\"\nShe coughs politely, and Geralt looks up from where he'd been examining his foot. She is unfurling voluminous wings like an iridescent cloak. They twitch into blurred motion.\n\"No,\" Phira says, smiling. \"It isn't.\"\nOf all of the many and varied ways that Geralt has travelled through his long years, this is the most interesting. After assuring Geralt that she was far stronger than she looked—then proving it—Phira carries him soaring through the air. \nWith her arms locked under Geralt's armpits and his feet dangling into the abyss, it's not the most comfortable trip he's taken, but it's hardly the worst. And the view is unparalleled. \nThey fly high to avoid being sighted by the guards or travelers on the road. The road stretches out like a golden ribbon into the distance, while plots of farmland appear as so many patches on a vast quilt. If he were not in such haste, Geralt would ask her to fly them still further. There is so much to see from above that he will never see again. \nBut she was right. By wing, the hill is not far, and soon they are landing neatly in one of the circles that Geralt burned into the grass. Phira strides back and forth along the base of the hill, then finally sits down facing the slope. Geralt tries not to gnash his teeth with impatience.\n\"I'll need to concentrate,\" she says. \"They've hidden it well, even to my sight.\"\nConcentrating, as it turns out, takes a good long while. Geralt sharpens and polishes his swords and three daggers while he waits, trying not to think about the grains of time trickling away for Jaskier under the earth. Pacing is of no help either. Geralt doesn't do well with inactivity, and he prowls around behind her, pulling up blue flowers by the root and refusing to feel badly about it.\nHe hears a sigh. Phira says, \"Witcher.\"\nGeralt glances over, sword at the ready, to watch the grass curl back on the side of the hill. Then the earth falls away, and a tunnel snakes down into darkness.\n\"You gorgeous fucking fairy,\" Geralt says, grinning wide. \nShe grins back, though her expression shows strain. \"Go. It should stay open as long as I will it, but I won't be able to hold it forever. Eventually I'll be forced to conclude that your efforts failed.\"\nGeralt shrugs. \"There'll be no use in waiting, then,\" he says, switching his grip on the sword. \"If I can't bring him back, I won't be leaving, one way or another.\"\n\"Witcher—\"\n\"Phira!\"\nThey both whip their heads to the sound of horses galloping from the road. Phira's beloved, accompanied by several guardsmen, all mounted, are making enough noise to raise the dead and at the same time killing any chance Geralt had of sneaking in unannounced. He curses a vicious streak, then narrows his eyes—one of the guards is leading Roach on a rope behind him. Roach looks about as pissed off as Geralt feels.\n\"Go,\" Phira hisses. \"I'll handle Nolan.\"\n\"If they've touched my horse—\" \n\"Go. This is your chance, Witcher. I won't be able to give you another.\"\nWith a final glare behind him, and a nod for the fairy, Geralt goes.\nHis eyes see well enough in the dark, and the way back down is uneventful, especially considering the trip he and Jaskier had taken to the top. The ground beneath Geralt's feet is quiet, and there isn't so much as a tremble in the sharp stalactites overhead. Impossible to believe that the escape with Jaskier had been only the day before; it feels as though it happened in another world entirely. \nGeralt had first entered the realm of the fairy on a mission to find the duke's missing son, who'd last been seen wandering by the hill. Jaskier insisted on coming with him, trailing along even when Geralt would not acquiesce, until Geralt acquiesced, telling himself that while the bard was a liability, he might prove useful after all—fairies were a fickle bunch, but they were partial to music. \nAt the time, Geralt did not let himself consider that he gave in to Jaskier because he enjoyed his company, and he especially enjoyed the way Jaskier's eyes lit up when Geralt agreed.\nThey'd found the fairy court in chaos. Nolan had been bound to the footstool that was now kindling for his trespass. He'd also fallen head over heels in love at first sight with the fairy princess Phira, and she with him. When Geralt and Jaskier arrived, Phira was challenging her mother, begging for Nolan's freedom, to no avail. The Queen insisted humans were weak and faithless, and Nolan an unfit match. Finally, Phira defied the whole shocked court by kissing Nolan, and breaking the spell—true love's kiss, impossible to fake. The queen flew into a rage. That was when Geralt and Jaskier's arrival was noticed, and they’d sprung into action to help the couple escape. The rest was history. \nNow the Geralt who walks steadily toward the golden glow ahead is a different man. True love's kiss. Impossible to fake. Everything is different. The sound of a lute being strummed to a melancholy crescendo reaches his ears, and his heart squeezes in his chest. He'd know Jaskier's saddest, self-pitying, wallowing-in-misery chords anywhere. He wants to break into a run.\nBut Geralt enters the court slowly, with swords sheathed, and the sheath in his hands. His hands are raised over his head. A good thing, for he's met by a dozen fairy archers with bows drawn tight and arrows notched, who seem like they haven't forgotten about his use of the Sign of Quen.\nThe queen is sat on her throne, looking equally unenthusiastic about Geralt’s approach. Next to the throne—Jaskier, perched on another Gods-be-damned footstool, head sunk to his breast and playing forlornly. Spread before him is a lavish meal—roast duck, creamy potatoes, wedges of cheese, crusty bread, succulent fruits that glisten gem-like—all of Jaskier's favorites, in fact, along with what looks suspiciously like his favorite red wine, next to a tall clear glass of water. The lot of it appears blessedly untouched; Jaskier is, it would seem, doing his best not to glance up at all.\nBut he looks up at the commotion, and when his eyes meet Geralt's—well, it was worth it, even if this is over before it starts, even if Geralt's next breath finishes with a fairy arrow through his throat. Jaskier doesn't cry out, just stares steadily back at Geralt as though Geralt is the finest sight he's ever seen and ever hopes to see. As though Geralt is the beginning and the end, and nothing else could possibly matter in the in-between. \nGeralt knows, because that's how he's staring at Jaskier. Jaskier smiles a little, then, and his eyes fill with tears, and he blinks to clear them. A tear slips down his cheek. He plays a discordant note, which Geralt takes as the admonishment that it is. Jaskier thinks that he's a fool for coming after him, which Geralt most definitely is. \n\"Witcher,\" says the queen. \"This is unexpected. How did you get here?\"\n\"I'm unarmed,\" says Geralt instead of answering the question. He lays down his swords. \"I only wish to speak. I will not raise a hand against any fairy.\" He'll say nothing of the multitude of daggers and other weapons tucked away on his person, or how his entire body is a weapon too well-honed.\n\"Speak, then. You are interrupting my concert.\"\n\"Let the bard go,\" Geralt says. \"He won his freedom fairly. It was only I who broke the bargain I struck with you to take the young man's place. Let him go, and let me keep my bond.\"\n\"Geralt, no,\" Jaskier snaps. He pivots to the queen. \"Your majesty, pay him no mind. He's quite mad, you see. Thinks he's a wolf most of the time. Won't give you anything but trouble, believe me.\"\n\"I think not,\" the queen says to Geralt. \"You are not half so entertaining. I like his little songs. That’s why I decided to keep him after all.\"\n\"She likes my little songs,\" Jaskier says. His gaze, shifted back to Geralt, is imploring, and also resolved. \"You must go back now, Witcher.\"\nGeralt shakes his head. Then he bows it. He humbles himself before the queen. \"If you'll not release him, then grant me leave to stay here also. I'll swear my swords to your service, and do your bidding.\"\n\"Geralt, don’t be more of a fucking idiot than usual—\"\n\"Silence,\" thunders the queen, and Jaskier closes his mouth and looks away, as though he cannot bear to see Geralt any longer. \"I have no use for you, Geralt of Rivia. You hunt my kind for sport, and you reek of death. Leave before you provoke your own.\"\n\"Not for sport,\" Geralt says. \"Never for sport.\" \nBut she isn't listening, and Jaskier isn't looking at him. Geralt's mouth is dry. His heart pounds. He sees no way out for them, no way to remain. It's possible that he could fight through this. Paint the walls with fairy blood, massacre innocents who will only be following orders to stop him—an invading monster. He could drag Jaskier out through screaming and slaughter and back up into the light—but that is not who he wants to be, and that is not someone that Jaskier will care for on the other side of it. \nGeralt tries to make himself look smaller, no mean feat. He cannot choose violence, so he must choose its obverse, which is hope. \"Please,\" he says. \"Your majesty. Allow me then to say goodbye.\"\nHer heart must not be made of stone after all, for after a moment the queen nods, and Geralt approaches. This close, she looks quite like Phira, and he can imagine that she has smiled like Phira also, without malice. He bows low. Turns to Jaskier. Jaskier puts down the lute and leaps from his seat. At least there is no curse upon the footstool this time.\nYet the result is the same. Geralt goes to him. Jaskier flings his arms around Geralt's neck, and then they're kissing, hard and desperate. \nGeralt tastes salt from the tears streaming down Jaskier's cheeks. His cheeks are wet from what must be Jaskier’s tears also. He puts his arms around Jaskier and pulls him in tight, as close as he can, then tighter still. Jaskier seems preoccupied with keeping his tongue in Geralt's mouth, the cheeky bastard.\nGeralt pulls back the bare space of an inch. His forehead presses Jaskier's. His eyes search Jaskier's. \n\"I love you,\" Geralt says. \"I'm sorry. I'll find a way back, Jaskier.\"\nBreathless, Jaskier surges up to kiss him once more, then breaks away with a sob. \"Geralt, I’ll—\"\n\"Mother. This has gone on long enough. Stop toying with them.\" \nGeralt spins, still holding onto Jaskier, to see Phira standing at the mouth of the cavern. Beside her, pale but determined and clutching her hand, is Nolan. \n\"Their kind does not live a fraction of the time that we do,\" Phira says. \"It can make them frightened and cruel, but to others, time is precious, and they use it well. They love true. This game of yours affects them greatly.\"\n\"Phira,\" says the queen, starting up out of her throne, then thinking better of it. \n\"Your quarrel is with me,\" Phira says. \"I would have it settled. The new bargain is this: let them go, and we will stay.\" \nThe queen's gaze flicks from one face to the next. \"Trickery. Your would-be bridegroom fled once, and he will do so again. Humans are inconstant.\" Geralt thinks that's rather rich coming from a fairy, but he'll swallow his own tongue rather than speak now.\n\"My lady,\" says Nolan. He steps forward and bows, still keeping hold of Phira's hand. \"I beg that you forgive us for what is past. I was mistaken. Phira cannot live happily in my world, which is less enlightened than your own. I would live, instead, in hers.\"\nThe boy has balls, Geralt will give him that. It's a gutsy wager—have the queen refuse them and prove her kingdom to be less refined than humanity's, and see her daughter leave once more—or risk losing face by trusting in the word of the one who made off with her daughter in the first place. She frowns, and that's when Nolan drops Phira's hand and sprints a mad dash in their direction.\n\"The fuck,\" says Geralt, reaching for a sword that isn’t there.\n\"Quick,\" says Jaskier. He slips through Geralt's grasp, ducks down, and snatches a grape off the vine on the plate set before them. He tosses it to Nolan, who catches it with a look of deepest gratitude. \nFast as anything, the grape is in his mouth and swallowed. Phira calls his name and runs to him, and then they're kissing and crying all at once, which appears to be in the air.\nSomeone in the watching swarm of fairies claps, and soon a wave of applause is washing over the spectators. The queen sighs and rubs her forehead. There's little use in denying the couple now, not with the whole fairy-court cheering, Phira returned, and Nolan binding himself to the realm in no uncertain terms. She casts her withering—and no doubt exhausted—stare in their direction. \n\"Go,\" says the queen, \"before I decide to keep the bard to play at my daughter's wedding.\" \nPhira crosses over to them, and Geralt takes her hand. \n\"Thank you,\" says Geralt, earnest as he's ever been.\n\"I was going to say the same, Witcher,\" Phira says, and smiles. \"I do not think we will meet again. But you will not be forgotten here.\"\n\"Nor you, above,\" Jaskier puts in. He kisses her hand when it is offered. \"This ballad is going to change lives. It'll be on demand in every tavern, first at every festival—'The Fairy-Maid and True Love's Kiss.' I'm going to start an epidemic of kissing, and a fashion for footstools—\"\n\"Jaskier,\" says Geralt.\n\"Yes, yes, we're going. This has all been quite exciting! Goodbye!\" And if they don't make their exit at a dead run this time, they're walking fast. \nThey start running as soon as they hit the tunnel, by silent accord, and do not pause again until they're out in the light. The sun is setting when they burst from the hill. Roach is tied to a nearby tree and appears deeply unamused. \nGeralt and Jaskier, however, are collapsed in the grass, rolling with hysterical laughter. This means of escape was so unlooked for and so wondrous that it seems impossible to catch their breath.\nGeralt heaves air into his lungs. \"Fuck. I thought we were well and truly fucked.\"\n\"You're not supposed to say that,\" Jaskier gasps out. \"You're supposed to always have a plan.\"\n\"The plan was,\" says Geralt, rolling toward Jaskier, and then onto him, \"to do everything I could to come back for you, and not stop until I succeeded.\"\n\"Ugh,\" says Jaskier. But he's grinning. \"That's so nonspecific. That would've taken you forever.\"\n\"Yeah,\" Geralt agrees. \"It would have.\" \nHe kisses Jaskier until they're both panting for breath again. Jaskier lifts his hands and cups Geralt's face. His smile is tinged wicked now.\n\"Love me, do you?\" Jaskier bats his eyelashes.\n\"Hmm,\" says Geralt. \"That was said under extreme duress.\"\n\"Geralt of Rivia, I swear—\"\n\"I do,\" Geralt says. He swallows past his fear of losing what he has now—the present is all that should count, since it is so very changeable. They could both be torn to pieces tomorrow, and what would he have to say for today? \"I do love you.\"\n\"Well,\" says Jaskier. His eyes are shining. \"What are you going to do about it?\"\nThey crash through the door of the room in the first inn that will take their coin. Geralt closes the door by hauling Jaskier against it. Jaskier is kissing him, and tugging at Geralt’s garments, and scrabbling at his own, all at once, which is commendable multi-tasking. \nGeralt helps by seizing Jaskier’s doublet at the collar and ripping it open clean to the navel. For a moment he’s worried he’ll be chided, though the fabric is stained and frayed—it was likely sewn by a terribly expensive tailor Jaskier had waited years to have an appointment with—but Jaskier only tips his head back and laughs with delight. \n\"If you knew how long I’ve wanted you to do that,\" Jaskier says. \nGeralt is heartened. He thinks through Jaskier’s more romantic ballads, tries not to flinch over the lyrics. \"What else is it that you want?\" Geralt asks, sucking a greedy mark into Jaskier’s neck. He bends and scoops Jaskier into his arms, then wheels around and carries him to the bed. \"Am I guessing right?\"\n\"Oh, fuck,\" says Jaskier, his feet kicking happily in the air. \"You’re certainly not wrong.\"\nAt the bed, Geralt sets him back down to finish divesting them of their clothing. He can finally gaze his fill on Jaskier instead of stealing glances in the bath—all of that soft, smooth skin, the chest with its downy hair, his slim hips, arms strong from countless hours of strumming. His legs are well-muscled from years of chasing after Geralt and Roach, his chestnut hair, wild with Geralt's grasping, frames those ridiculously blue eyes above prominent cheekbones. His expressive lips part as he looks at Geralt, and his cock—his cock is a proud hard curve that lends credence to a lifetime of cockiness.\nGeralt's own bodily reaction must speak volumes, but Jaskier, for once, doesn't even preen. He's staring at Geralt's cock like the adventures with his hand the night before didn't quite prepare him for the size of it sans encumbering layers. Geralt shifts his weight, suddenly unsure—he's experienced a full gamut of reactions—and that's when Jaskier falls to his knees. There's no finesse in the movement, just a full-on drop; the impact sounds painful, but Jaskier doesn't pause. He licks up the length of Geralt's cock, tongue hot and wet, then tries to fit as much of it into his mouth as he can. He whimpers when Geralt's cock hits the back of his throat and he's barely made it halfway.\n\"Jaskier,\" murmurs Geralt, for once without any annoyance whatsoever in his voice.\nJaskier pulls off a good while later. \"Not just now. Whatever it is couldn't possibly matter,\" he says. \"I'm venerating my God.\"\nHe moves to swallow Geralt's cock again, but Geralt, laughing, lifts him off his knees and throws him down onto the bed. Geralt has an idea that Jaskier appreciates being flung about by his strength, an instinct fast confirmed when Jaskier gasps upon hitting the mattress. Geralt climbs over onto him, tonguing at his flat nipples and ignoring Jaskier's increasingly frantic tugs on his hair. \nBut he glances up to find Jaskier watching him, eyes enormous, and Geralt reluctantly lets a nipple slip from between his teeth. \"What?\"\n\"I want you to wreck me,\" Jaskier says, breathing fast. \"I want you to absolutely destroy me.\"\n\"I think we should wait,\" says Geralt.\nJaskier's flummoxed expression is as though Geralt has taken up his lute and smashed it against the wall. Geralt lifts his eyebrows and doesn't try to hide his smile.\n\"Your face,\" Geralt says. \"You should see your face.\"\n\"I deserved that, I suppose,\" Jaskier says, wrapping his legs around Geralt to reel him in. \"But you so could've been ensorcelled.\" \nGeralt has nothing whatsoever to say to that, so he leans down to kiss the last of it from Jaskier's mouth. Then he disentangles himself—also reluctantly—and retrieves the pack with his healing supplies from where it was dropped by the door. There's a vial of oil he's used for such purposes, even if the names and faces of all who came before are a distant blur as Jaskier waits for him.\n\"Turn over,\" Geralt says. It would be preposterous to suggest that his hands are unsteady. \"Hands and knees.\"\n\"Yes sir,\" Jaskier says, hastening to follow an order for the first time in their association. \"Witcher sir. You know, I like this side of you. Tell you what, you can tell me what to do in bed, and I'll—oh holy fucking Mother Goddess. Geralt.\"\nGeralt, who has been kissing down Jaskier's spine, chooses to simply keep going. He licks over Jaskier's hole to see if that meets with Jaskier's approval, and when Jaskier makes another extraordinary sort of noise after cursing through the pantheon, he proceeds with greater intent. \nHe licks up on side and down the other, swirls and flicks his tongue against Jaskier's hole while Jaskier exclaims about it. He opens Jaskier with his mouth first, pushing inside with his tongue and sucking on his rim, then eases in a finger to work alongside his tongue. \nGeralt is extremely good at every activity he's taken the time to study and practice, and he knows hererin is no exception. His finger, then fingers, fast learn just how to set Jaskier off, and his tongue keeps flick-flick-flicking, and he won't slow down, not for one moment, not until Jaskier shakes apart and comes just from this. \nJaskier cranes his neck around to try and get a clear view. \"Geralt. Wait. Fuck. I—fuck, that's so fucking good, you can't—just hang on. I want to come with you—\"\n\"You'll come again,\" promises Geralt, and he twists his fingers.\nThe night before in the woods, he hadn't been able to touch Jaskier, not like this, hadn't been able to make him come in the way he wanted to. Not like this. Now, he can watch Jaskier's face change as it happens, learn the cadence of his sighs, see every muscle seize and then be soothed by full-bodied release. His fingers are in the vise-tight grip of Jaskier's ass as Jaskier pushes back for more, and the feel of it sends all of Geralt's blood directly to his cock. He pulls them free as soon as Jaskier's hips stop twitching and his cock stops spilling. \nGeralt reaches blindly for the oil, slicks his cock. He can't afford to lose control, not now, no matter what Jaskier asked him to do—but he's clinging to control by the skin of his teeth. He pours more oil on his fingers and slides them back into Jaskier. \n\"Yes.\" Jaskier has his face pressed to the bed, still riding out aftershocks. \"In me. In me.\"\n\"I should—\"\n\"Now, Geralt.\" Jaskier lifts his head, and tosses it, eyes brightly burning and brokering no arguments. \"And don't you stop. Don't you dare stop.\"\nSo Geralt takes his cock in hand, lines himself up, and presses inside. Jaskier is incredibly tight, even with the help of fingers and tongue, even as he's all but dripping with oil. He's as incredibly enthusiastic, refusing to be passive as Geralt fucks into him. Jaskier bears down and rocks back, and he moans as he takes more of Geralt's cock, but Geralt knows Jaskier's voice, and that's pleasure, not pain. Geralt keeps going.\nGeralt should be going slow as he can, but even he doesn't have such reserves of self-control, and Jaskier had said wreck me and don't you dare stop, so he doesn't. He thrusts further in, hard and sure and relentless, and when he moves back it's to find a better angle to drive in deeper. \nHe has Jaskier's hips in his hands, holding him in place, and this time, instead of thrusting, he tugs Jaskier's hips toward him, pulls Jaskier, inch by inch, further down on his cock.\n\"Fuck, I—fuck—\"\n\"Jaskier—?\"\n\"Don't you fucking stop.\" Jaskier is covered with a fine sheen of sweat. \"Fuck me like you mean it or I'll assume that you don't.\" \nGeralt sees in shades of red, and then his vision goes hazy, and it's possible—nay, probable—that he loses control entirely. The last of his restraint frays as he buries the whole of his cock, the whole of himself, in Jaskier; Jaskier holds all of him; and it feels so fucking good that he pulls out to thrust back in and do it again. And again, and again, and again, and again, again, again, again. The bed groans with their momentum, but Jaskier’s groan is louder.\nHe fucks Jaskier hard as Jaskier's asked for, not a punishment but an affirmation, and through it all, Jaskier is with him, moving with him in tandem, taking everything, asking for more with body and mouth. \nGeralt fucks him harder than he's ever fucked, and still Jaskier's sob of a laugh is punched from his lungs and he says, \"Geralt, you're holding out on me, go faster,\" and Geralt does. \nThen Jaskier gets his hands on the carved bed frame. He pushes himself up and rides back on Geralt's cock, and then it doesn't matter if Geralt's self-control is non-existent, because Jaskier is in control. Jaskier sets their pace, and that means that they slow down all at once, a change in speed that makes Geralt's head spin and his body keen. \nHe wraps his arms around Jaskier, pulls him to his chest; Jaskier turns his head and tilts up and then they're kissing, wet and messy and meaning it, and then Jaskier's hips move in an almost torturously decadent roll. Geralt hears You like to be teased, don't you, brought up right to the edge, but Jaskier can't be saying that because he's still kissing Geralt, still pushing Geralt to the precipice. I know you, Geralt hears. \nHe gets his hand on Jaskier's cock, which is hard again as promised, and he makes a fist around it and strokes in the way he can guess Jasker favors: firm, quick, wonderfully indulgent, with a bit of a flourish. Jaskier cries out in Geralt's arms, and then he twists to kiss Geralt again, and he rocks down on Geralt's cock, and he says, \"I love you, I love you,\" and he comes all over himself and Geralt's abetting hand, and Geralt comes with him. \nWhere Geralt had seen red, he sees white, the world blanking out to all but the tight heat of Jaskier's body welcoming him. He thrusts in deep as he can and fills Jaskier with his seed, not stopping even then, but staying in him, keeping hard for them both through preternatural will. It's a giving over unlike anything Geralt has felt until it happens—never has he been so well-matched, never before has he been so thoroughly mastered, never before has he trusted or wanted like this. \nNever has he been trusted or wanted like this.\nThe cresting wave of pleasure, propulsive as it is, is almost secondary to the knowledge that he has put himself inside of Jaskier, and now, no matter where the path takes them, or how quickly their strange lives might end, Geralt has found that he belongs there. Belongs here, with Jaskier sliding free of his cock at last but only so that he can turn in Geralt's arms and kiss him properly. \nThen Jaskier flops back against the mattress, and once more drags Geralt with him. They lie in a tangled sprawl of limbs, lungs working harder than when they'd burst out of the tunnel in the hill. After a stretch of truly extraordinary silence, Jaskier stirs to awareness beside him.\n\"I—\" Jaskier starts. Stops. \"That was—\"\n\"Mmm,\" Geralt agrees. \n\"I—\" Jaskier tries again. \"Is it always like that for you? I've speculated, of course, once or twice, that you'd have the stamina and skill of a fertility deity, you know, in the stories I tell myself to fall asleep to at night, harmless fantasies, really, but I—\"\n\"No,\" Geralt tells him. \"It isn't. It hasn’t been. Like that.\" On his third try his body obeys his command and his head turns to face Jaskier. \"That was the both of us together.\"\n\"Oh.\" Jaskier's expression softens, his brow losing its furrow, and with great effort he manages to lay his hand on Geralt's shoulder. \"That's lovely to hear. Yes.\"\n\"Mmm,\" Geralt agrees.\n\"For a man of few words,\" Jaskier says, \"you know just what to say.\"\nGeralt pats his hand. Sweet silence returns. His eyes want to close, but Geralt forces them open. The last time he closed his eyes beside Jaskier he awoke without him. Even if that threat seems unlikely to return, there could easily be another. \nJaskier dozes, and Geralt watches over him. It's a miracle Jaskier was awake as long as he was. First he played his fingers to the bone until sunrise, then he spent an evening sorting out this whole love and cocks business with Geralt, then he was stolen away by the fairies, then it seemed likely that he would be trapped in fairy-land and separated from Geralt just when it was getting good. Then they’d gotten to leave against the odds, and then it had gotten really good. Then he'd had Geralt fuck his brains out and fucked Geralt's brains out in return, and really—the sleep is well-earned. Geralt lets him rest.\nWhen Jaskier blinks back to him at last, he smiles a slow, secret smile at Geralt that has the disconcerting effect of making Geralt's stomach flip. Jaskier wrinkles his nose. \"We should bathe. I, at least, should bathe. I am truly disgusting right now. You're not yet on notice, by virtue of extreme attractiveness. It offsets the filth and the dried come.\"\n\"Wait a while,\" Geralt suggests. \"I'm going to fuck you again first.\"\n\"Right now?\"\n\"Right now,\" says Geralt. \n\"I'm going to die here,\" Jaskier says, cheerful about it. \"I leave all my worldly possessions to Roach.\"\n\"She's had her eye on that lute for a while,\" Geralt says, climbing back over him, and touching his tongue to the bud of Jaskier's ear, \"and I bet—\"\n\"Geralt, I swear on Melitele's shapely ankles that if you say anything about that horse being a better lyricist than me, I will not suck your cock for at minimum three days.\"\nGeralt shuts his mouth. He puts it to better use, kissing the pout from Jaskier's lips. \"Wouldn’t dream of saying anything like that.\"\n\"You would, if it wasn't for the fact that I am a wildly accomplished cock-sucker. Anyway, your face said it.\" \n\"Sorry,\" says Geralt. \"I'll make it up to you.\"\nHe does. Twice.\nGeralt doesn’t sleep that night. He has no complaints, however. The bed is packed with sweet-smelling straw, they are clean after an indulgent time in the bath, Jaskier is wrapped naked around him, and he can’t remember the last time he felt so unburdened. It’s possible he hasn’t. \nThere are burdens still. For one, he remains reluctant to close his eyes, lest Jaskier be gone when he opens them. But that worry is founded, considering what they came through, and he knows that as he becomes accustomed to this it must lessen.\nThat he will become accustomed to it, he has little doubt. Jaskier has a life of his own, pursuits that do not involve Geralt (even if they often revolve around heralding Geralt’s exploits), but long ago they learned their paths were destined to run together. Geralt used to tell himself he was resigned to it, but now he knows he will count the days until they meet again. Now it will be far more frequent, and entirely on purpose, and for greater lengths of time, and Jaskier will sleep in his arms like this.\nShould Jaskier wish to stay with him for a time, Geralt will not deny him. The danger that Geralt faces is ever-present, but that is what he does, and Jaskier knows the peril of him better than anyone—Jaskier is his chronicler. \nCertainly there will be a new vein of worry to be mined, whenever Jaskier is at risk. Geralt will think I love him and I belong in him, and he will fight monsters monstrously should Jaskier be in the balance. But the truth is he has thought as much, and acted in such a way, for quite a while, even if he could not recognize it. It will not be so different now, save that the rewards for saving Jaskier are all the greater. \nHe could not keep Jaskier preventatively safe, and it would be a fool’s errand to try. The bard has the same wandering feet as Geralt, and a need for story, and a sense of wonderment at all that is new and unknown, that far eclipses Geralt’s. Jaskier could not be shut up in a house somewhere, waiting for Geralt to return. He’d resent it, and get into somehow greater trouble indoors, as he always did. No, counterintuitive as it seems, the safest place for Jaskier is at Geralt’s side. Perhaps it is he who should ask Jaskier if he would like to stay a while and travel with him.\nIn the morning, Geralt is still awake. The sunlight brings out copper highlights in Jaskier’s hair. When he rouses, Geralt reaches to brush back Jaskier’s disheveled locks to better see what shade of blue the light paints his eyes.\n\"You’ll have to sleep eventually, you know,\" Jaskier says, instead of \"good morning.\" His mouth is a smug curl of a smile. \"I need you in peak physical condition.\"\n\"Do you,\" says Geralt.\n\"I’ve the whole day planned out for us, and two-thirds of it is horizontal. Let’s sleep for a few more hours. Then I’ll let you in on my agenda.\"\n\"You could tell me now,\" Geralt suggests. \"Witchers require little rest.\"\n\"Well, my Witcher needs some, and he should trust me on that,\" Jaskier says. \"Go to sleep, Geralt.\"\n\"But I—\"\n\"I’ll be here,\" says Jaskier, soft. He presses a kiss to Geralt’s shoulder. \"I promise you, I’ll be here. They’d need a team of harnessed kikimores to drag me from this bed, and even then I’d put up a fight.\"\n\"All right,\" says Geralt, still cautious. \"If you say so—\"\n\"I do,\" says Jaskier. \"And if you close your eyes right now, I’ll wake you up with my mouth.\"\nGeralt closes his eyes. Sleep comes swiftly to leaden lids. When he opens his eyes again, Jaskier is still there with him. To be more precise, Jaskier is beneath the quilt, between Geralt’s legs, and his mouth is full.\nGeralt could definitely get used to this.\nThe inn kicks them out at noon, but they have more than gotten their coin’s worth. They share a hearty lunch at a raucous tavern in town, and there is nothing too different about it from any other lunch they’ve passed together—save that once, Geralt lets his boot touch Jaskier’s heel beneath the table, and Jaskier smiles for him his secret smile.\nWhen Geralt returns to their table with two frothing pints of ale, he has found a way to breach the topic he considered in the small hours of the night.\n\"There’s tales of a leshy in the forest south of Ina,\" Geralt says. He watches as Jaskier dips his finger in the beer’s foam and licks it off, for no other conceivable reason than to drive Geralt mad and drive him to ravish Jaskier in the middle of the packed room, which wouldn’t be the strangest thing they’ve done. Geralt glares at Jaskier’s finger so that he doesn’t lean across the table to lick it also. \"Nasty piece of work, to hear the barkeep tell of it.\"\nJaskier’s eyes light up. \"They’re supposed to be dreadfully clever, and frightfully challenging to bring down,\" he says. \"Those poor villagers. You really should go and help, Geralt.\"\n\"If it’s half as bad as the man purports, it seems there’ll be a story there to tell,\" says Geralt, around a calming swig of ale. \"If you’d like to join me.\"\nThe ride to Ina would take three weeks, or far more, if they are walking side by side, and leaving Roach in peace.\n\"A proposal that intrigues,\" Jaskier says. He also takes a casual sip of ale, though the expression on his face suggests that he’ll now be the one to ravish Geralt on the table, crowd or no. \"As long as I won’t be too much in the way?\"\n\"I’ll find some use for you,\" Geralt says.\n\"I do have my uses,\" Jaskier hums. \"Why, just this morning, I woke you up just like I said I would. Else you might be still abed.\"\n\"That was commendable,\" says Geralt.\n\"Thank you,\" says Jaskier. \"To the leshy, then?\"\n\"We’ll leave tomorrow,\" Geralt says. Tension he hadn’t known he was carrying in his shoulders relaxes all at once to have it settled.\n\"Oh?\" says Jaskier. \"Not today?\"\n\"Today is planned,\" Geralt says. \"Though I have yet to hear the agenda.\"\n\"That’s right,\" says Jaskier. \"Rude of me. I'll fill you in. It starts with a swim by the lake, there's an infamous grotto—\"\nMuch later, when they have set up camp under the stars—the night at the inn was worth any price, but coin is dear if they’re to make it all the way to Ina—and they are undressing for what is not the first time that day, or the third time, Jaskier laughs.\n\"I’m a sight,\" Jaskier says. By firelight, and with his sharp eyes, Geralt can see the bruises dug into Jaskier’s hips, and those that climb his inner thighs, and the redness of his knees, and the markings on his neck. \nGeralt feels a twinge of guilt, made worse by the mingling of pride and desire that he has caused such blossoming on Jaskier’s skin. \"Sorry,\" he says. \"I’ll be more careful.\"\n\"You’ll be no such thing. I’d go about naked to show these off if I could.\"\nGeralt pulls Jaskier down atop him on the bedroll. \"If you went about naked, we’d never get anywhere.\"\nJaskier kisses him back with all eagerness and the extended participation of his tongue, but his cheeks are a touch pink. \n\"The, erm,\" Jaskier says, \"the spirit is very willing, but the flesh is weak. I’ll need a little time before I can take that cock of yours again. Though believe me, every moment without it is the greater torment.\"\nThis decides Geralt on a course of action already considerably dwelled upon. \"I’d take you, then.\"\nJaskier’s flesh is made less weak at the suggestion. His eyes turn bright, and his hands find purchase in Geralt’s hair. \"So you weren’t joking.\"\n\"I don’t joke,\" says Geralt, which is itself a joke, \"not about this, anyway. I want you to fuck me.\"\n\"Let’s pause just a moment. Say that again.\"\nGeralt rolls his eyes; Jaskier now has his eyes screwed shut, the way he does when he is trying to pluck a new melody out of thin air. It’s exceptionally annoying. But Geralt has grown fast indulgent. \"I want you to fuck me,\" he repeats, patient, and before Jaskier can ask, adds, \"Jaskier.\"\nJaskier sighs. \"If I put that as the chorus in the song about you, will you be terribly upset?\"\nGeralt almost smiles. \"Which song is that?\"\n\"The Witcher and True Love’s Kiss. The follow-up to the Fairy-Maid. It’s nearly finished.\" \n\"Jaskier—\"\n\"Okay, all right, not for the chorus. That line I’ll keep just for us. No more teasing, I’m awful, I know—I’m just trying to lighten the mood, or I’ll hyperventilate. To answer more succinctly, yes, Geralt, Witcher of my heart, I want to fuck you also, so it’s nice that we’re in agreement. I want to fuck you so badly there’s a few anonymous ballads on the subject circling the brothels that absolutely cannot be traced back to me. There I go again, I’m babbling, aren’t I? To the point—how do you best like to be fucked?\"\n\"I don’t,\" says Geralt, too late realizing his clumsy phrasing when Jaskier frowns, eyes dimming. Geralt is nervous, an emotion nearly as hard for him to identify as love, and nerves are making his mouth feel thick with sawdust. \"I mean. I haven’t. No. I mean, of course I’ve had—things—\" he shapes an obscene gesture with one hand, which Jaskier hopefully interprets. He’s had fingers inside him plenty, and tongues, and carved phalluses of varied sizes, any manner of creative objects of man’s inventiveness. Geralt has been around a long time, and had many lovers. \"—but not. You know. With a living person.\" No. Fuck. Fuck. \"That came out wrong.\"\n\"A little,\" Jaskier allows. But the worry is gone from his brow, and his expression is one of such tenderness warring with incredulous that his features seem volatile, ever-shifting. \"It’s perfectly all right,\" he says, the tenderness fast winning out, and he touches Geralt’s cheek with gentle fingers. \"Is there any reason why?\"\nA long, painful pause while Geralt tries to sort out what to say. Then, \"Too exposed,\" he says shortly. \"Couldn’t trust.\" Excellent, he’s gone mostly monosyllabic. He blows air out through his nose in frustration.\n\"You trust me.\" It’s not said in the form of a question, so Geralt doesn’t need to answer any more directly than to meet Jaskier’s eyes steady on as he uses a fingertip to trace the line of Geralt’s jaw. The air is heavy now between them, and Geralt sees the moment Jaskier decides it’s safe to move forward and tries to bring them back to their usual level. \"I have to say, in all my imaginings, I never had ‘deflower Geralt’ set down as a possibility and I’m ashamed I didn’t think broadly enough. I’ve thought about you in every other conceivable scenario.\"\nGeralt snorts, glad to hurry past confessional mode. \"There’s nothing to deflower. I told you, I’ve had plenty of—\"\n\"Shh, shh.\" Jaskier lays a finger over his lips. \"Let a man realize his hidden dreams a moment. That waking life can be better than any dream.\"\nGeralt rolls his eyes once more, but rather than be annoyed at the placing of Jaskier’s finger, he considers its potential. He parts his lips and takes Jaskier’s finger into his mouth, swirls his tongue around it, and it rewarded with Jaskier’s cock going instantly hard against his thigh. \n\"Oh, fuck,\" says Jaskier with appreciation, sliding a second finger into Geralt’s mouth beside the first. His tone drops, the full richness of his tenor emerging. \"Get them nice and wet,\" Jaskier says. \"I’m going to open you up slowly.\"\nGeralt makes a noise halfway between protest and profound arousal, but he does as Jaskier says. He sucks on Jaskier’s fingers until they are as slick as his mouth can make them. Then Jaskier slides them free and reaches down between Geralt’s legs. \n\"We’ll start with one,\" Jaskier says, and pushes one finger expertly into him. Geralt exhales. Good. No hesitancy, no lingering weirdness from Geralt’s disclosure, only obvious skill that Jaskier clearly takes no small amount of pride in. \"But that won’t be enough for you for long, will it?\"\nGeralt shakes his head. Jaskier leans forward to kiss him, and his finger works deeper. \"You’re beautiful like this, you know,\" Jaskier says, whispers it into Geralt’s ear like a secret. \"That is. You always are. So fucking beautiful, but—\"\n\"Shut up,\" grumbles Geralt.\n\"—but taking my finger—oh, you want another, do you? Aren’t we eager?—this is a good look on you. Yes. And when I press right here, just so, you’ll look even better.\"\n\"Fuck,\" says Geralt, sparks of pure pleasure igniting at the base of his spine and journeying the length of his body. He makes a small sound of loss he’s never made before when Jaskier moves his fingers back out. \n\"Where’s that oil?\" Jaskier reaches for the nearest pack, tugs it close, and rummages about, distracted by Geralt watching underneath him. Geralt takes the opportunity to wrap his hand around Jaskier’s cock, already so hard for him, and Jaskier thrusts into his fist on reflex. \n\"Kindly desist,\" Jaskier says. \"If you don’t think it’s difficult enough to keep it together under these conditions—\"\n\"You’re doing fine,\" says Geralt, the sides of his mouth twitching up.\n\"Fine,\" echoes Jaskier. \"Fine, he says. Just exactly the descriptive word every lover wants to hear applied to their efforts. I’ll show you fine.\" He locates the green blown-glass bottle and starts to work free the cork with his teeth.\n\"Do you think we got enough?\" Geralt asks dryly. The bottle, procured that day from the town’s apothecary, looks sized more for cooking than for medicinal—or other—application.\n\"No,\" says Jaskier, pouring a generous amount into his cupped palm. \"This’ll last us a week, if that.\"\nThe easy way he speaks about their imminent life of traveling and fucking is what makes Geralt’s cock fully hard—that, and Jaskier doing as promised and opening him with painstaking slowness and care. \nPart of Geralt wants to gruffly snap out some line about Jaskier getting on with it, about how he’s hardly liable to be hurt or mind discomfort, but he bites on his own tongue to keep it back. Jaskier looks so happy that it’s disconcerting for Geralt to know he is the cause, but the glow of flushed contentment suits him well. Geralt holds his tongue, save to give over low groans when Jaskier’s fingers light him up.\nThis sensation does take some getting used to. It's been a good long while. Years. He hasn’t bedded many men since his path first crossed with Jaskier’s, a realization that probably needs more analysis than Geralt is like to give at the moment. Some adventurous women will touch him like this, but the approach is generally different—a single finger slid in to better tease or provoke his response. Jaskier puts so much energy and finesse into preparing him that he acts as though it were the main event. \nThe thought crosses Geralt's mind that they might spend long, lazy hours at the fireside like this after a trying day, exploring and unlocking each other. He shivers, gooseflesh rising on his arms, and not only because Jaskier has bent to take Geralt's nipple into his warm mouth.\nJaskier notices the shiver, raises his head. \"All right, love?\"\nThe enormity of what Geralt feels then shouldn't be possible for a Witcher. \"Yes,\" he says, which seems inadequate. \"Yeah. It's good.\" Use your words, Geralt. \"It's really good.\"\n\"Shall I—\"\n\"I wish you would,\" says Geralt.\nJaskier nods, crooks his fingers once more to hear Geralt’s lust-laden inhale, then slips them free. \"Apologies in advance,\" he says, spreading more oil along his cock. \"I'm going to need to talk my way through this in order to survive. If I keep it to myself I'll implode.\" He guides Geralt's legs further apart and moves to settle over him. His cock is heavy and slick against Geralt's stomach.\n\"What do you ever not talk your way through?\" Geralt wants to know.\n\"Geralt, only you would bait a man about to stick his cock—\" but there isn't any sticking, for Jaskier enters Geralt then, and the motion is smooth and slow. \nBeing filled like this is odd at first, hard, heated flesh where he hasn’t felt it before, but Jaskier stretched him well, and there's no pain beneath the fast-growing pleasure of it. Experimentally, Geralt lifts his hips to what he expects will be a better, deeper angle for them both, and Jaskier slides further into him with a muffled curse.\n\"Gods,\" Jaskier says, trying a firmer thrust. Geralt's toes curl. \"You feel—you feel. You feel.\"\nGeralt puts up an eyebrow, then turns his head as Jaskier's lips descend to kiss his neck. \"At a loss for words, famous poet? I was promised narration.\"\n\"Oh, fuck you very much. Ha—fuck, you're tight. You feel—\" Jaskier's inside him now to the hilt, his voice hitched, ecstatic. \"—you feel even better than my songs postulated, and I took considerable liberties. I'm removing them from the brothel circuit.\"\n\"Hmm,\" says Geralt. He won’t admit it, but Jaskier's tactic of talking through it for survival seems prudent, lest Geralt lose his mind entirely and devolve into mindless pleas for more. \"Will there be a revised song?\"\n\"You bet this mythic ass,\" says Jaskier, \"that I am never pulling out from.\"\nGeralt laughs, but the sound dies as Jaskier's lips find his, and then they're kissing, and something changes. The light-hearted humor fades from their faces. Jaskier has his eyes open as he kisses Geralt, as he rocks into Geralt, and he's looking at Geralt as though he contains everything necessary for life and breath. \nThe kiss gets hungrier, and Jaskier thrusts harder. It's like he can taste how the reaction goes through Geralt when he drives in just right, and then he only fucks him just like that, glorious pace and reach, every thrust bringing butterflies to wing about in Geralt's belly and seeming to bring the stars down closer to them. \nHe wraps his legs around Jaskier's ass to urge him on, to tell him how this feels, because he can't speak, they can't stop kissing. Jaskier isn't even touching his cock—his hands are in Geralt's hair, stroking his cheek, running over the breadth of his arms, restless, as though trying to memorize all of him at once—but Geralt is fast aware that he could come from this alone, just from Jaskier existing in him.\nGeralt is more than a hundred years old, and there is little that he has not seen, done, tried, tasted, witnessed. The worst cruelties and greatest capacities of men and women and monsters were all exposed to him long ago. \nYet he has never done this. There were times when he was tempted, almost to the point where he considered letting down his defenses, but in the end his caution and all too intimate relationship with the harsh realities of human nature won out. \nIt was too vulnerable a position to place himself in, even if his partner seemed lusty and harmless enough. Geralt has lived this long by not taking anyone or anything at face value, and his suspicions are usually confirmed.\nBut Jaskier—Jaskier he knows. Jaskier he has known for years and years, shared triumphs and horrors with, shared drink and conversation long into the night, so many nights. Jaskier likes attention, and praise, and strawberry jam, and he is far more fearless than anyone just meeting him would account. Time and again he's proved willing to die beside Geralt, or to die for Geralt, or to try and stay in the realm of fairies so that Geralt might leave and live. Jaskier is by turns selfish, and ingenious, and indulgent, and too generous; like most men Geralt has met, a mess of complications and contradictions; but his heart is kind, and that is rare enough. And his heart has been Geralt's to have for years and years, Geralt knows. Geralt thinks: I'm in love with you because I know you.\nSo this act, which had until recently seemed quite impossible for Geralt to share, is now a bold new horizon. He is learning how to allow someone else to have him. How to give over his tight-fisted hold on the reins of control. How to give himself. How to let Jaskier become a part of him, even fleetingly, and with it the knowledge that he is no longer alone. Loneliness was a choice that Geralt made, not something put upon him for what he is, he is made to understand. So he chooses otherwise.\nIf they die on the road tomorrow, torn apart by men or monsters—or if that happens next week, or in a year, or twenty—Geralt would not ask for more than what he has now, to be loved and in love, more than any Witcher is meant to have. He'll ask for nothing else save to keep this, as long as he is able, and to die with it, too. \n\"Geralt,\" Jaskier says, halting their kiss, but not his thrusts, \"I'm close. I'm so fucking close. Stop musing about the vagaries of navigating the romantic experience and come with me, damn you.\"\n\"Sorry,\" breathes Geralt, blinking.\n\"I notice you don't deny it,\" says Jaskier, speaking now against Geralt's cheek. \"But am I right about the rest? Can you come with me?\"\n\"Yes,\" Geralt says. \"I've been trying not to.\"\n\"Why the fuck ever for?\"\nGeralt doesn't quite know the answer to that himself. He opens his mouth, hears words emerge. \"I want you to stay.\"\n\"I'm here,\" Jaskier says, with a splendid push of his hips for emphasis. \"Try getting rid of me.\"\n\"Tried that for a while,\" Geralt says, body tight-twisting with pleasure as they move together, as the veil between them and between elation thins. \"Didn't work.\"\n\"You—\" Jaskier's expression is thrilled and annoyed and amused all at once, and focused, too, exceptionally so, the thrust of his cock unceasing, aimed true, \"—you unmitigated dick, I'm going to make you come on my cock this moment. I'm not exerting any extra effort—\"\n\"Hmm,\" says Geralt, so that he doesn't plead, doesn't moan. \"Weird punishment.\" \nJaskier snaps his hips, his sneaky, wily hips, fucks him right there, and it's too much, too much; Geralt throws his head back and arcs up with his whole body straining, every treacherous muscle working in collusion with Jaskier. He can feel the build of it, his cock already leaking, skin slick, so ready, so ready—\n—and Jaskier stops, right there, panting, buried in Geralt but unmoving, refuses to give them both the friction that they need. Geralt's mouth falls open, and he thinks he growls, but Jaskier still won't move, and they're so close to the edge that Geralt can smell their seed, the promise of it, his cock twitching but unable to come.\n\"Jaskier, for fuck's sake,\" he bites out. And then, fuck it all, he pleads. It’s worked before. \"Please—\"\n\"Ah-ha, so you can play nice. What is it you’d like, Geralt?\"\n\"Fuck me.\" Fuck me, let me come, let me feel you spill deep, I haven't ever felt that. \"Fuck me. Come inside. Please.\"\n\"Ask a stupid question, get an answer I'll never be able to stop hearing in my head on a loop,\" Jaskier mutters, but, thank anything that might still be holy in this wretched world, he starts to move again. \nIntemperate, urgent thrusts that feel too fucking good after leaving Geralt hanging. Geralt exclaims in a voice that's new and comes hard enough that all the stars fall down around him, streaking silver past his eyes. The euphoria of it shakes him head to toe, his cock spurts between them, the greater proof, and that's what seems to tip Jaskier over. \nHe says Geralt's name at a yearning pitch, like a song about to be sung, and then he's pulsing into him, filling Geralt up. The silky warmth of him is at Geralt's core, and it stays there even after Jaskier, kissing Geralt's mouth in amazement, draws his cock back out.\nJaskier collapses on his back next to Geralt, breathing like he's run at least two circuits of the way to fairy-land and back. \"How was that, Witcher? How about that?\"\n\"Fine,\" says Geralt.\n\"I hate you,\" says Jaskier, swatting at his bicep. \"So much.\"\n\"No,\" says Geralt, all too satisfied. \"You don't. True love's kiss is impossible to fake.\"\n\"Yeah, well, maybe it got confused.\" But Jaskier belies his words by curling in on Geralt, chin on Geralt's chest so he can see his face. That's when Geralt can see the lurking anxiety and uncertainty on Jaskier's. \"Geralt. Really?\"\n\"That was…\" Geralt stops teasing. He searches through his vocabulary. Discards smart remarks, and snarks, and deflections. He's left with few enough words after eliminating those, but Jaskier has more than earned it. \n\"Perfect,\" Geralt says at last, and Jaskier looks the way he will the day he wins the bardic competition at Gulet two years in a row, which has never been done. Geralt will be there to watch it happen, and he'll be reminded of this moment. But neither of them know it yet. Geralt gathers Jaskier against him, and says, more appropriately rumbled, \"If you quote me in a song I'll deny ever saying that.\"\n\"Deny saying what?\" says Jaskier, eyes round, as though he has never known an instant of guile.\n\"Exactly,\" says Geralt. Jaskier yawns, worn out from his exertions, and seems content to put his head down on Geralt's shoulder and lie quietly. It is Geralt's mind that still boils over, Geralt's mind racing across the improbabilities they have come through. \n\"Jaskier,\" he says, before Jaskier can fall asleep. \"A thing I meant to ask you. When we were in the fairy realm. How did you know what Nolan was after, when he ran toward us? I thought he’d lost his senses. But you acted before anyone could stop him.\"\n\"It was what I would have done,\" says Jaskier. He doesn't raise his head. His voice is soft near Geralt's ear. \"It's what I was planning to do, if the queen had agreed to let you stay and tried to make me go.\"\n\"Hmm,\" says Geralt, because he has no words left at all then. His arm tightens around Jaskier.\n\"Of course, I would've gone for the cheese myself,\" Jaskier says. \"But the grape seemed more expedient under the circumstances.\"\n\"I love you,\" says Geralt.\n\"And I, you.\" Jaskier's lips brush his ear. \"Go to sleep, Geralt, or I swear to Melitele I'll sing you a ballad as a lullaby, and then you'll be sorry.\"\n\"The new song?\"\n\"Which? I'm bursting with musical possibilities at the moment. Do you mean the Fairy-Maid, or the one that will shock and arouse brothels continent-wide—\"\n\"No. The other one. About the Witcher, and true love's kiss.\"\n\"Aren't we self-referential. That one isn't finished yet.\"\n\"How does it end?\" asks Geralt.\n\"Oh.\" Now Jaskier raises his head. Geralt can see his smile in the dark, as Jaskier moves to bring their mouths together. Far off, Geralt thinks that he hears fucking bells. \"They live happily ever after.\""
}