{
    "id": "2264937",
    "url": "https://archiveofourown.org/works/2264937?view_full_work=true",
    "author": [
        "starknjarvis"
    ],
    "title": "Rule of Three",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Multi"
    ],
    "fandoms": [
        "The Avengers (Marvel Movies)"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Darcy Lewis/Steve Rogers",
        "James \"Bucky\" Barnes/Steve Rogers",
        "background Pepper Potts/ Tony Stark",
        "background Natasha Romanov/Clint Barton",
        "James \"Bucky\" Barnes/Darcy Lewis",
        "Darcy Lewis/Steve Rogers"
    ],
    "characters": [
        "James \"Bucky\" Barnes",
        "Steve Rogers",
        "Darcy Lewis"
    ],
    "additional_tags": [
        "soulmate!AU",
        "Polyamory",
        "the course of love never did run smooth though",
        "Darcy Lewis takes on the Big Apple",
        "Darcy POV",
        "Threesome",
        "First Time"
    ],
    "language": "English",
    "series": "",
    "published": "2014-09-06",
    "completed": null,
    "words": "22,010",
    "chapters": "1/1",
    "comments": "157",
    "kudos": "9,297",
    "bookmarks": "2,402",
    "hits": "136,187",
    "summary": "<p>Darcy has imagined her soulmates a million times. Her plan for their first meeting is to punch them in the face with all her might. Her first soulmark-- “Well, at least she’s got a nice rack”-- has been plaguing her since she was born, fueling every self-conscious fear she had ever had. The second, which had only appeared a few years back, is equally as insulting. At least at that point she was a little too focused on the aliens streaming from the sky to really concern herself about whatever jerk she was destined to connect with. Who needs soulmates anyway?</p>\n<p>She just didn’t expect “You've got to be kidding me” to be such a hunk.</p>",
    "notes": "",
    "text": "When Tony Stark extended an invitation for Darcy to move into Stark Tower with Thor and Jane, Darcy’s response had been two simple words: “hell” and “yes.”\nIt wasn’t just because she loved Jane (though she did, as well as Jane’s big, muscly soulmate) or because she’d get to be living with superheroes (which she’d already learned could be more trouble than it was worth). The truth was, Stark Tower was the most modern building in the world and she was being offered rent-free housing in the culture capital of America. Since her planned career with SHIELD fell through when it turned out they were secretly a neo-Nazi terrorist organization, New York was as good a place as any to decide her future.\nShe landed at JFK at seven o’clock on a humid July night. By the time she wrestled her bags into a cab and arrived at Stark Tower, it was nearing nine. Jane had offered to have Stark send a car for her, but Darcy had been determined to make the move on her own. She was an official adult moving to a big city with a diploma in her hand, and so was perfectly capable of handling this.\n(She ignored the fact that her hair was frizzy and she had bags under her eyes and she was kind of on the verge of overwhelmed tears. She was totally handling this.)\nStark Tower was all glass and metal, a far cry from her adobe abode in the desert. The disembodied voice of JARVIS, who Jane had warned her about, met her in the elevator. “Good evening, Miss Lewis. Would you like to go to your floor now?”\nDarcy’s growling stomach answered for her. “Does this place have a kitchen? Specifically a kitchen I can raid without getting my face Hulk-smashed?”\n“There’s a communal kitchen in the penthouse,” JARVIS told her. “You are free to help yourself to anything you might find there.”\n“I love you,” she said, resting her head against the stainless steel interior of the elevator.\nThe AI sounded distinctly amused. “It is a pleasure to meet you as well, Miss Lewis.”\nWhen the door opened again, Darcy pushed her bags out onto the floor and then followed her nose to the kitchen. There was the smell of garlic and tomatoes in the air, and she was nearly drooling. Maybe Stark had a personal chef that cooked authentic Italian all day. Those peanuts on the plane hadn’t been enough to make up for the fact that she had missed breakfast.\nThe communal floor included a giant living room with a proportionately enormous flat-screen television on the wall. Every game console from the original Nintendo to some system that she had never even seen before seemed to be strewn on the carpet, and controllers snaked across the floor to the collection of leather couches.\nFrom the entrance, Darcy had assumed the whole Tower would have the kind of plastic-on-the-furniture oh-God-Darcy-stop-touching-things aesthetic her grandparents' house had, but this area looked thoroughly lived in.\nWhen Darcy entered the kitchen, she found a blonde man at the stove, his back turned to her as he stirred the contents of the pan in front of him.\nWith a relieved sigh, she plopped herself down at the counter. Sitting for the violent cab ride had caused more stress than it had soothed, so it felt wonderful to get off her feet.\n\"I will give you eight dollars and my firstborn if you let me have some of that,\" Darcy declared.\nThe man dropped the wooden spoon in his hand and whirled around. \"You've got to be kidding me,\" he said, eyes narrowed and voice harsh. His front was just as good a view as his back. Even if Darcy hadn't done her research on the Tower's occupants, she would have been able to recognize the chiseled jaw and blue eyes of Captain America anywhere.\n\"What? I'm hungry,\" Darcy said, and then his words processed. \"No fucking way.\"\n----\nNot everyone had a soulmark, either because not everyone had a soulmate or because the forces that be liked to fuck with a few people specifically.\nLittle girls dreamed of meeting their soulmate. Countless Disney princesses had found their true loves through the line of black words that had appeared on their body containing the first sentence they'd hear their soulmate say. Most girls were thrilled to have a soulmark.\nMost girls weren't soulmates with complete assholes.\nThe script on the back of Darcy's neck--\"Well, at least she's got a nice rack\"-- had been haunting her since she was born. Her tits had popped into existence when she turned twelve and hit puberty. Like the stares for the words alone she got weren't bad enough.\nDoes Darcy have a curvy body that she's grown to embrace? Hell yes. Does she want to punch every person who spends more time looking at her breasts than her eyes? Also yes.\nA few months after she turned 22, another line of text had appeared, this time on her thigh. \"You have got to be kidding me.\" Clearly Darcy had hit the soulmate jackpot. Maybe it was karma for something terrible she had done in a past life. Nothing else could explain getting not just one, but two, jerks as her soulmates.\nJane and other friends had tried to come up with scenarios where her destiny could be anything but fucked up, but Darcy knew better.\nShe just wasn't meant for love.\n----\nMovements controlled and angry, the man turned off the stove and then looked back at her. \"Who are you?\"\nDarcy crossed her arms and raised her eyebrows at Captain America. \"Your soulmate, apparently. Am I right?\"\nSlowly, he nodded.\nLeaning back in her chair, she continued, \"So that means I get to ask you what I've been wanting to ask for years. Why exactly makes you so pissed off about me?\"\nFinally looking sheepish, he said, \"I... Look, I think we got off on the wrong foot. I'm Steve Rogers.\" He held out his hand.\nShe eyed him from her seat, and then leaned across the counter to shake it. \"Darcy Lewis.\"\n\"Thor's Darcy?\"\nHuffing out a laugh, she said, \"I'm my own woman, but yeah, that Darcy.\"\n\"Is it true you tazed him?\"\n\"Did Jane tell you that? She promised not to poison your minds before I got here.\"\nSteve shook his head. His smile was really sweet, when he deigned to show it. \"Thor was bragging about you. He'll be so excited you're here.\"\n\"Better batten down the hatches, then,\" Darcy said. \"I've seen what he's like when he gets excited. Things get destroyed. Occasionally my things.\"\n\"Nowadays they're usually Tony's things,\" Steve replied. He leaned with one hip against the counter. Darcy was pretty sure jeans and a plain t-shirt weren't supposed to be that attractive, and her heart skipped a best as a smirk took over his face. \"Tony's stuff gets broken a lot. There's nothing quite as fun as destroying something he calls indestructible.\"\nMaybe this guy wasn't so bad after all.\n\"Sounds like my kind of party,\" Darcy said. \"You know, assuming he's not going to go Iron Man on my ass.\"\n\"I think he likes the excuse to build new things,\" Steve admitted.\nDarcy stretched, reaching her arms above her head. Steve's eyes followed the movement and she suppressed a smirk. She still had it. Still, she wouldn't have guessed that Captain America would ever have that heated look in his eyes because of her.\nInternally, she slammed on the brakes and replayed the last few minutes. \"Holy fuck, I'm soulmates with Captain America.\"\nHis expression fell stony again. \"Look, ma'am, I'm sorry to do this, but this--we--can't go anywhere.\"\nDarcy had been waiting for this since she had seen their mark. \"Not that I was exactly dragging you to the nearest chapel, but care to explain? I thought people from your decade were all about soulmates. I mean, it sounded like you had an issue with me before I even walked in. Also, ma'am?\"\nHe pushed away from the counter and ran a hand through his blonde hair. \"I'm already in a committed relationship, and that's never going to change. I don't know what went wrong, but there must have been a glitch, something about the ice. I have two soulmarks, and the other one is my one.\"\nDarcy took a second to process that, and then sighed heavily. \"Your soulmate,\" she said. \"He wouldn't happen to be kind of an asshole, would he?\"\n----\nInstead of eating homemade pasta or moving her stuff into her new state-of-the-art suite, Darcy was leaning on the wall just inside the floor Steve shared with his soulmate, Bucky.\nBucky Barnes. The Winter Soldier.\nJane had delicately warned Darcy to keep her distance from the man. He had overcome his brainwashing assassin ways months ago, but that apparently wasn't the type of thing a magic wand--or true love's kiss--could fix.\nThere was a mirror attached to a shoe rack across the entrance hall, and Darcy grimaced at her reflection. Of course she had to meet her soulmates with frizzy hair and cozy (read: shlubby) traveling clothes.\nAfter nearly a half hour of waiting, Steve emerged with another man in tow. Though they had similar builds, Barnes's darker skin and hair made him an interesting contrast. The metal hand glinting at the end of his sweatshirt sleeve caught her attention for a second before her gaze returned to the guarded look on his face.\nShe took a step forward and promptly stumbled over her duffle bag. Steading herself on the wall before she hit the ground entirely, Darcy took a second to compose herself. When she looked up, she saw both men watching her with a combination of amusement and concern. \"Jesus fucking Christ,\" she said.\nBucky shook his head, a smirk tugging at his lips. \"Well, at least she's got a nice rack.\"\nSteve burst out laughing. Reaching out and slapping a hand across Bucky's chest, he said, \"Well now I know how she knew you were a jerk.\"\nBucky frowned and then looked up at Darcy quickly. \"Tell me that's not...\"\nShe turned around, lifting her hair so he could see the words scribbled on her neck. \"Yep.\"\n\"Fuck,\" he said.\nDarcy sighed. \"Tell me about it. Actually, just go back in time and apologize to tiny Darcy. She was the one who had to adjust to it.\"\n\"People were mean to you?\" Steve asked, the humor disappearing from his face.\n\"Hitting puberty early gets you called a slut anyway. Having the mark to prove that it's all your soulmate's going to see doesn't do much to deter the name-calling.\" Bucky looked like she'd punched him in the stomach, so she shook her head and smiled. \"Whatever. I'm over it. I mean, come on-- I do have a great rack.\"\n\"I'm sorry,\" Bucky said.\nDarcy waved a hand to dismiss his apology. \"Don't worry about it.\"\nBucky was frowning. His blue eyes were intense and focused on her, but despite Jane's warnings, Darcy wasn't afraid. He looked...lost. \"That's not all I.... I mean, if we are, you know, I would never have--\"\n\"Look, I just came here to meet you. Steve thought it would be weird to put off until morning. But, I've had a long day, and dancing awkwardly around this thing isn't really how I wanted to spend my night. Steve told me you two are exclusive-- it's not like you guys owe me anything.\" She shrugged. \"I've got to unpack.\"\n\"You don't have to leave yet,\" Steve said.\n\"It's fine.\" Darcy shouldered her bag. JARVIS, bless his heart, opened up the elevator door behind her. \"I'll see you guys later, okay? We can pretend like this never happened.\"\n\"Darcy...\"\nDarcy stepped into the elevator. It took all of her willpower not to turn and look at them again.\n----\nSummer in New York City was nowhere near the temperatures the Southwest reached, but the combination of humid air and overwhelming sounds and smells meant that Darcy was still relieved to finally get inside somewhere.\nIn celebration of Darcy's big move, Jane was taking her out to brunch at one of the city's many small cafés. With a mimosa in hand and a stack of blueberry pancakes in front of her, Darcy would have been well on her way to forgetting last night ever happened if Jane ever decided to give it a rest.\n\"It just doesn't seem right.\"\n\"You're right,\" Darcy said loudly. \"Needs more syrup.\"\nJane ignored her. \"I just can't believe that you'd be destined for two people who are already taken. By each other.\"\n\"You know, maybe the soulmark thing isn't the end-all-be-all. There are all those theories about why they happen at all. Maybe mine were just glitches,\" Darcy said. \"Pass me the powdered sugar.\"\nJane handed the glass container across the table and then slumped back in her seat. \"I can't believe Bucky was 'nice rack' guy. Maybe you're better off without them.\"\n\"Mhm,\" Darcy said around a mouthful of pancakes.\n\"Maybe you can sleep with them just the once though?\"\nDarcy nearly choked. \"Jane!\"\n\"What?\" Jane asked. \"You've got to admit they're hot. And if you ever see them together.... They're caught in each other's gravitational pulls. They're so in sync that it's almost creepy.\"\n\"You're supposed to be swooning over life as Thor's live-in woman, not fantasizing about threesomes,\" Darcy chided. \"And I may have many, many dirty thoughts about those two, they made it clear that they want nothing to do with me.\"\n\"But--\"\n\"Just drop it, Jane. Please?\"\n\"Fine,\" Jane said, shaking her head. \"You know, maybe it's better this way. They're nice guys but not exactly...stable. I've heard Bucky say maybe ten words since I've known him. If you run into him when he's not expecting it, he's like a stray dog.\"\n\"I thought you had a soft spot for strays,\" Darcy pointed out.\nJane shrugged. \"Thor was a bit different. He may have been kicked out of Asgard, but he was still a prince. He was still in control of himself, if not the situation. Bucky, though-- he'd bite your hand without even thinking twice about it.\"\n\"He didn't seem malicious,\" Darcy said.\n\"He wouldn't hurt you out of malice. It's out of fear. They're working on getting him ready for fieldwork, but Thor said he's not sure Bucky will ever trust the team to have his back.\"\n\"That's sad,\" Darcy said, thinking back to the distant man she'd met the night before.\n\"It's a mess, but they're dealing with it. I just hope this whole thing doesn't ruin New York for you. I'm really glad to have you here.\"\nDarcy pursed her lips and kissed the air a few times. \"Because I'm your favorite and you don't know what you'd do without me?\"\n\"Pretty much,\" Jane said, kicking her lightly under the table.\n\"Love you too, boss.\"\n\"Speaking of, do you know what you're going to do up here?\" Jane asked.\nWincing, Darcy said, \"The job hunt can wait until I get my feet under me. Can we please talk about something else?\"\nAnd Jane, being the best friend a girl could have, changed the subject.\n----\nThe last time Darcy had visited a city this big, she was in London seducing her intern and saving the world. Navigating New York was an entirely different ball game.\nDuring the Battle of New York, Grand Central had been nearly entirely destroyed, but over the past few years, renovations had been in full swing. Standing at the top of the steps, Darcy could barely believe that it had ever been wrecked in the first place. Sure, the iconic clock in the middle of the constellation-strewn entrance was a bit shinier than it should have been, but the bustle of the city didn't seem to have slowed in the slightest.\nDarcy knew this because everyone kept bumping into her. \"Oh my God, jerks, just give me a second to breathe,\" she muttered. Apparently New Yorkers had no sympathy for people just trying to get a good look at their local landmarks.\nAfter finally getting a non-blurry photo of the station, Darcy headed over to a map on the wall to decide where she should go first. After brunch the day before, she had spent the day cooped up in the Tower decorating her room and sulking, but she was prepared to spend today exploring and learning the pavement. Just because she’d finally met her soulmates and they were already deeply in love didn’t mean that Darcy couldn’t enjoy the city. Hell, even the fact that she had no clue what she was going to do here other than be an uncomfortable addition to the Tower wasn’t going to be enough to stop her.\nNew York had better look out. Darcy Lewis was in town.\n----\nHer feet hurt. Her calves hurt. Her shoulders hurt. Her brain hurt.\n\"Fuck this city,\" she said vehemently as she entered the communal floor.\nThe TV in the living room was on and displaying, if Darcy wasn't mistaken, Mario Kart 64. Two men were sitting on the couch, controllers in hand and shoulders hunched as they veered through Rainbow Road's many obstacles.\nAs she watched, Toad zipped past the finish line, and the black man dropped his controller and raised his arms triumphantly. \"Suck it, Stark.\"\n\"You cheated, Wilson,\" the other man--Tony Stark-- said.\n\"I've just got skills,\" the other man replied. He glanced over his shoulder at Darcy. \"Tony's a sore loser.\"\nDarcy dropped her purse on the floor by the elevator and strode over to the couches. \"No man's ego can survive a Mario Kart whooping,\" she said. \"Hi, I'm Darcy. Jane's friend.\"\n\"You know who I am,\" Tony said with a lazy, two-fingered salute.\n\"Sam Wilson,\" the other man said. \"I've heard a lot about you.\"\nOf course. Falcon and Captain America were best friends. “Oh,” she said.\n“You look like someone who’s been chewed up and spit out by the city,” Sam continued.\nDarcy winced. “That obvious?”\n“You don’t have to be in New York long to be able to identify the frazzled look of a newcomer,” he said.\nTony nodded. “Let me guess. Delayed subway?”\n“More like closed for construction,” Darcy said, running a distracted hand through her hair and wincing when she brushed against a drop of sweat. “I had to walk. A lot.\"\nSam nodded sympathetically. “Wanna come blue-turtleshell Tony with me?”\n“Yes please,” Darcy said, toeing off her flats and sitting down on the couch, sighing when her blistered feet finally left the ground.\n\"Hey, not fair,\" Tony protested, though his eyes were already back on the screen.\nSam handed Darcy a controller and she rolled her shoulders. “Let’s do this.”\n----\nOver the course of the next hour, Darcy learned that Tony was indeed a sore loser, Sam could switch between friendly banter to swearing a blue streak in mere seconds, and Darcy’s position as Mario Kart champion of Culver University’s political science department was not enough to earn her an easy victory in Stark Tower.\nBlistered feet forgotten, she laughed as she rammed Sam’s Toad with her Bowser, causing him to veer off the track into the water. “Bet you wish you had your fancy wings now, don’t you?” Darcy said as she shot toward the finish line. “Back in first, baby,” Darcy said, dropping her controller and doing some impromptu cabbage patch dance moves. “You guys want to go best, what, thirty out of fifty?”\nTony, who had crossed the finish line just after her, slumped back on the couch. “I quit.”\n\"I didn't know Tony knew those words.”\nDarcy stilled. They had only met two nights earlier, but Darcy felt like Steve's voice was etched in her bones.\n\"Your girl is ruthless,\" Tony whined. There was a beat of awkward silence before he added, \"What, was I supposed to pretend that news wasn't all over the Tower this week?\"\nDarcy shifted on the couch so she could see all three men at once. \"First of all, you must not have listened to all the news or you'd know I'm not his girl. Secondly, don't talk about me like I'm not here. Lastly, ruthlessness is the only course of action when it comes to Mario Kart. It's kill or be killed. Don't pretend like you weren't playing just as dirty.\"\n\"You covered my eyes last round so I'd fall off a cliff,\" Sam pointed out.\n\"Kill or be killed,\" she repeated firmly.\n\"You wanna take my place, Steve? You're just as bad as she is,\" Tony said, standing up. His suit was crumpled and his hair was mussed from the way he kept pulling at it every time he lost.\n\"I'm not the one who kept talking about replacing all the game consoles with Stark prototypes,\" Darcy pointed out. \"At least I don't decide to get rid of something completely just because I lose.\" She looked back at Steve, who was standing awkwardly by the kitchen counter. \"What do you say, Steve? Wanna join? Unlike some billionaires I could name, I'm not a sore loser.\"\nHe held her gaze for a long moment, and then nodded. \"I could play.\"\n\"Good luck,\" Tony said, patting Steve on the shoulder as he left the room.\nMeanwhile, Sam scooted over to the other end of the couch and leaned against the armrest. \"I'm assigning myself to the cheer squad for this one,\" Sam said, nudging Steve with a foot as he took the seat between them.\n\"Rude,\" Darcy said, trying to ignore the fact that Steve was sitting with one leg against hers. Yeah, okay, so she got some butterflies when she caught a whiff of his scent, and the heat of his body sent her butterflies a little lower, but he'd already made his decision. “I thought we were buddies, Sam.”\n“We are. That’s why I’m cheering for you,” he said.\nSteve shook his head. “Still pissed about dodgeball?”\n“You and Bucky are never allowed to team up together ever again,” Sam said. “Never.”\nDarcy very firmly did not let herself think about what it’d be like have Bucky and Steve team up on her. God, was everyone this horny for their soulmates or was it just her luck to get paired with the two hottest men alive?\n“Man, I was bruised for weeks!”\n“So, are we playing or what? Fair warning, Steve; soulmate or not, I’m going to kick your patriotic ass.”\nSteve’s responding smirk was a sight to behold. “Bring it on, short stuff.”\n“Resorting to name-calling already? That’s a sign of fear,” Darcy said as they picked their characters. “I’d say I’ll go easy on you, but that’s a lie.”\nPlaying with Sam and Tony had been a fun way to get to know her new roommates, but she hadn’t really been concerned about them liking her. To be honest, Darcy had shared living spaces with more frenemies than actual friends during her life, so finding out that the Avengers were fun guys was just an unexpected bonus.\nPlaying with Steve, though, gave Darcy a chance to see the man behind the stars and stripes. Nothing broke the ice like some good old-fashioned virtual brutality. When he wasn’t glaring disapprovingly at her for existing, he was actually pretty great. From the moment his words had appeared on her skin, she had been prepared to hate him, and their encounter the other night hadn't done much to change her mind. The truth was, though, his gentle ribbing paired with a genuine good nature made him impossible to dislike.\n\"Shouldn't you be all about fair play?\" she demanded after he hit her with a shrinking lightning bolt just before she went over the edge of a jump, leaving her to careen into the abyss below.\nSteve chuckled. \"Where's the fun in that?\"\nDarcy couldn't suppress a grin.\nOnce they had played enough rounds that Darcy's fingers hurt, they moved into the kitchen, still laughing.\n\"I told you she fought dirty,\" Sam told Steve. He and Darcy sat at the kitchen table while Steve reheated the pasta sauce that had gone uneaten the other night.\n\"I didn't even know that cheat existed,\" Steve said, shaking his head. \"You'll have to teach it to me sometime, Darce.\"\nShe shrugged. \"Can do, Cap,\" she told him as he got to work preparing to boil the spaghetti.\n“So, Darcy, did tearing up the virtual streets help you get over the mean streets of NYC?” Sam asked, leaning back in his chair. There was something about Sam Wilson that made her want to talk to him. Jane had mentioned he used to be a shrink or something, but Darcy thought it was more to do with his open smile and playful eyes. He was cute, too-- if she wasn't already been soulmarked by his best friend, she'd probably make a move. Maybe once the tension had died down a bit and everyone involved got used to the fact that, soulmarks or not, Darcy was single for the forseeable future. It takes some skill to be rejected twice within the first three hours in a new city, but Darcy apparently had a gift.\n\"God, could I have had a worse first 48 hours in New York?\" she wondered. At the reminder of her day, Darcy’s blistered feet let out a painful throb. \"I mean, I know the city's supposed to be tough, but damn.\"\n“Just because the subway was closed?\"\nShe flopped her head dramatically onto the wooden table. “I think I walked like two miles just inside subway stations alone before I realized what was happening. Why aren’t they air-conditioned? What’s wrong with this city?”\n“Sorry I asked,” Sam said with a laugh.\n“Even walking here is so different from home. Everyone was just moving so fast everywhere. Look at me. Do I look like I’m built for speed? No, I’m built for Netflix marathons. Also, it kind of smells in this city,” Darcy continued, gaining momentum. \"Some assholes cat-called me even though I'm positive I looked frazzled and pissed off. My shirt's not even low-cut today! Honestly, what is wrong with guys? There's more to me than a set of breasts.\" She turned her head in her arms and shot a bitter glance toward Steve.\nThe super-soldier was pouring pasta into the boiling water, but the tips of his ears were red.\nDarcy wasn't afraid to speak her mind, but she wasn't an asshole either. Steve obviously wanted to move past her first encounter with him and Bucky, so she just put her head back down and continued, \"Also, this city makes my hair get frizzy. Humidity can bite me.\"\n\"Sounds rough,\" Sam said, patting her head.\nSensing a sympathetic soul, Darcy slumped further onto the table. Taking the hint, Sam continued petting her hair.\n\"Lady Darcy!\"\nToo content to move, she called back, \"Thor!\"\nShe heard the scrape of a chair as he sat down at the table beside her. \"Jane said that you had arrived the other night! Apologies for not being able to greet you earlier! There has been much business to attend to in Asgard.\"\n\"'S cool,\" Darcy replied, voice slightly muffled against the table. \"I made new friends.\"\nThor chuckled. She loved when he laughed-- for being a badass god of thunder, he was such a genuine sweetheart. \"I see you have wrangled the Falcon into your ever-growing group of loyal comrades.\"\n\"Sam's nice and gives good head rubs,\" Darcy explained. She was feeling looser inside now that she had people around her. Her day alone yesterday had involved more crying than she’d ever admit, and she had started to wonder if she was cut out for city life. Clearly not everyone in the Tower was going to make snap judgments based off her soulmarks.\n\"Those are indeed fine qualities for a friend,\" Thor said.\n“She also likes whooping my ass at Mario Kart,” Sam added.\n“Darcy may be small, but she has the spirit of a true warrior,” Thor agreed, patting her on the back.\nSam finally pulled his hand away, so Darcy sat up reluctantly. Her disappointment was short-lived because Steve was immediately setting a plate of pasta in front of her. It smelled even more delicious up close than it had the other night. Darcy hadn’t had anything besides boxed pasta in years, but this spaghetti looked homemade.\n\"I take it back,\" she said, picking up her fork. \"I could get used to this city.\"\n----\nDarcy Lewis had never been a fan of the dark.\nAs a kid, a dragon-shaped nightlight and her favorite stuffed animal-- a small Piglet she had gotten from Disneyworld--had kept the shadows away. Her fears then had been of clowns lurking in the darkness or bugs skittering across her ceiling, but she had gotten accustomed to having to live without her safety nets in college.\nNowadays, her nightmares were more concrete. There were some fears that even Piglet couldn't help ward off.\nWhen the clock hit three and she was no closer to sleep, Darcy slipped on some sweatpants and took the elevator down to the gym. This was her life now. She lived in a building where an entire floor had been turned into a gym. Jane had told her about the state-of-the-art facility, but she hadn't had the chance to check it out yet.\nJARVIS kindly kept the lights dim as she made her way to the lower level, but when the elevator doors opened to the gym, she was nearly blinded by the bright fluorescents inside. Blinking against the glare, it took her a moment to register that the gym wasn't empty.\nBucky Barnes was on a treadmill on one side of the room. Unlike in most gyms, the equipment here all faced toward the center of the room, so he noticed her as soon as she stepped into the room. His feet were pounding on the treadmill's belt at an alarming speed. Darcy knew that treadmills had settings over six miles per hour, but she hadn't realized anyone actually used them.\nCautiously, she raised a hand in greeting and received a nod in return. Apparently he wasn't in a talkative mood and, frankly, neither was Darcy. Exhaustion made her tongue feel leaden even though frantic energy was buzzing under skin.\nAs she'd hoped, the gym had a stack of yoga mats against one wall. Taking one, she tucked it under her arm and returned to the open space in the center of the room. Beginning to slow her breathing, Darcy unrolled the mat and stepped on the end. She could see Bucky in her peripheral vision, but she forced herself to ignore him and center herself.\nShe started with a sun salutation, ignoring the irony of the fact that sunrise wasn't for another six hours. The rhythm of Bucky's running distracted her from the movements, and she wondered if he was watching her. It took her a few repetitions, but eventually she was able to block out the ambient noise and light of the gym and focus entirely on her body.\nThough she was far from the best yogi in the world, she held each position as well as she could, reminding herself to keep her breathing slow and deep. The stress of the last few days combined with her extended jaunt around the city had left her with stiff joints and tight muscles.\nOnce she hit her stride, she flowed between motions, stretching and strengthening her limbs and core.\nMore than thirty minutes later, she finally let herself stretch out and just lay on the yoga mat. The workout took energy, and her thighs were shaking slightly, but her mind was calmer.\nWhen she stood up, ready to head back to bed, she stopped in her tracks when she saw Bucky watching her. He was off the treadmill, stretching beside it with a towel draped over his neck. His hair was in a short ponytail, but it didn't do much to make him look less intimidating. The metal arm wasn't even her hang-up; it was that normal people just weren't built like he was. Darcy knew she had curves and lips that drew people's attention, but Bucky and Steve had been crafted to perfection.\nStill, she rolled up the yoga mat, adjusted her glasses, and then cocked her hip as she stared back. \"Yeah?\"\nHe stood up straighter. \"Nothing.\"\n\"Whatever,\" Darcy said, shaking her head and moving to return the yoga mat to the pile.\n\"Drop it in the chute,\" Bucky said.\nShe glanced back at him. \"Excuse me?\"\n\"The mat. They get disinfected after every use. Everything small enough to fit in that chute does,\" he said, nodding at a metal door in the wall.\n“Of course they do,” Darcy replied, changing course. She shoved the mat into the chute and let the metal close with a bang. The noise was loud in the silent gym.\n“Isn’t yoga supposed to be calming?”\nDarcy turned around to raise her eyebrows at him. “Hm, I don’t know what could possibly have put me in a bad mood. Well? Go ahead. Aren't you going to make a comment about me being too busty for yoga? Or maybe just that you enjoyed the view?”\nHe crossed his arms. “I was trying to help.”\nTaking a deep breath, Darcy said, “Thanks, but I don’t need your help.” She started for the door, wondering how she was ever going to sleep after this, but his next words stopped her in her tracks.\n“I’m sorry.”\nHer sigh was so heavy that it felt like her entire body was deflating. “Don’t worry about it,” she said, turning back to face him. “I get it. You already have your soulmate, and me showing up here was the last thing you wanted. Honestly, I wasn’t exactly hoping to end up stuck in a building with you two.” She crossed her arms, trying to keep eye contact though it was one of the harder things she’d done. Rejection and disappointment never got any easier. “I’ve told myself for years that something like this had to happen. You don’t get words like mine and a happily ever after.”\n“Maybe I was a bit harsh, but I just got Steve back, and I’m not letting anyone take him away from me, no matter what the marks say.” He was a solidly built and physically imposing ex-assassin, but it was the distrust in his eyes that made Darcy’s stomach twist.\n“You don’t even know me!” Darcy snapped. “Just because I have a ‘great rack’ doesn’t mean that I’m a home wrecker! God, what, do you think I’d handcuff myself to you guys just because of some dumb words? Newsflash, cowboy— I don’t need a soulmate to manage, not now, not ever. What’d I prefer is not to have my exciting move to New York made awful by you two dwelling on the soulmarks none of us even put much stake in.” She was just so tired, and words kept pouring out. “I can handle rejection. I mean, come on, we don’t even know each other. It’s not like this is breaking my heart. But having you two look at me like I’m trying to sabotage your lives isn’t exactly making me feel at home.”\nBucky looked at the door like he was considering running away (and she honestly wouldn’t have blamed him), but then he looked back at her. “I think maybe we got off on the wrong foot. Do you like hot chocolate?”\nSeriously? Darcy huffed out a laugh, grateful it didn’t come out as a sob. “Sure. Who doesn’t like hot chocolate?”\n----\nThat’s how Darcy found herself back in the communal kitchen, this time with Bucky pouring ingredients into a saucepan on the stove while Darcy sat at the counter and watched. He went through the movements like they were a ritual, and Darcy felt herself regaining some of the calmness from her yoga routine.\nShe leaned her elbows on the counter, considering him. Finally, she said, “My, uh, grandma used to make hot chocolate like that. If she had lived long enough to see packet hot chocolate, I think she might have started a protest.”\n“People who settle for that powder shit haven’t ever had it done the right way,” Bucky said, stirring the mix with a wooden spoon. There was a beat of silence, less awkward than the last, before he added, “I used to make this for Steve when he couldn’t sleep. Back when we lived in Brooklyn.”\n“I guess it’s just a sweeter variation of the 'warm milk’ prescription. You’ve been looking out for him forever, haven’t you?” she said softly.\n“We look out for each other,” Bucky corrected. “Making some hot chocolate was the least I could do to repay him.\"\n“Did it help?”\nBucky shrugged as he poured the hot chocolate into two mugs. In the dim lighting, it was hard to make out the difference between his metal arm and the other. “Sometimes. Sometimes he just needed to be able to talk about why he couldn’t sleep.” He set the mug in front of her and gestured for her to take the floor.\nDarcy’s hands wrapped around the mug, but she didn’t look away from Bucky’s eyes. “Why?”\n“You remind me of him.”\n“Of Steve?”\nBucky nodded. “Back when he was just a skinny kid from Brooklyn with a mouth he couldn’t back up and a chip on his shoulder the size of the Bronx.\"\nSomehow, she thought it was a compliment. His expression when she said so confirmed her feeling. She took a sip of the hot chocolate and felt the last of her tension seep out of her shoulders. \"This is amazing. I may just have to stop using the packets if I can bully you into making this for me.\"\n\"I'm up a lot of nights. Just come find me,\" Bucky said, drinking from his own mug.\nDarcy's lips quirked to the side in thought. \"At the risk of making you run away, you do realize you've had a pretty quick change of heart here, right?\"\n\"Like I said, you remind me of Steve. And if things were different and somehow it was you and me together blocking out Steve, I hate the idea of him being left to fend for himself just because I already had someone.\"\nDarcy took another drink. \"I told you that I don't need you guys. I can handle this on my own.\"\n\"I know. But could you use a friend?\"\nShoulders slumping, Darcy nodded. \"Yeah, I could use one or two of those.\"\nBucky's smile changed his whole face, giving Darcy a glimpse of what he must have looked like before the war, back when it was just him and Steve against the world. \"Well, Darcy Lewis, this might just not be a disaster.\"\nRolling her eyes, she pointed out, \"Don't jinx us. We've got enough standing in the way as it is.\"\nHe just laughed. \"I'm not sure if you've heard, but Steve and I like a challenge.\"\nSmile growing, she said, \"Then you've picked the right girl.\"\n----\n\n how did the interview go? i'm in the area-- would you like to meet for lunch? \n\n\n  LUNCH YES PLEASE. SOMEWHERE WITH ALCOHOL.  \n\n\"Steeeeve,\" Darcy whined, collapsing in the chair across from him. Between the span of his shoulders and blonde hair, he was easy to spot in a crowded restaurant. The cafe was nothing more than a hole-in-the-wall down in the West Village, and the tables were so tightly packed that she had to push past some people to even make it across the room.\n\"I'm guessing the interview didn't go well,\" Steve said, looking up from the menu.\n\"He didn't even take me seriously!\" Darcy said. Even after their Mario Kart bonding session, things hadn't been completely smooth with Steve. Still, she needed someone to rant to, and he was the one who'd invited her out. \"He zoned out after the first five minutes. It was like talking to a zombie. A zombie whose eyes were permanently focused about a foot too low.\" She sighed gustily. \"I was totally qualified for this one.\"\n\"There'll be other interviews,\" Steve assured her.\nShe shrugged. \"Eventually. How do people even move to this city without Tony Stark covering their rent?\"\nSteve laughed. \"For starters, most people don't move straight to Midtown. Bucky and I used to have a place down in Sheepshead Bay. Manhattan wasn't even an option.\"\n\"I bet everything was a lot cheaper back then,\" Darcy said.\n\"That's the magic of inflation,\" he said. \"I nearly had a heart attack the first time I ordered a coffee here.\"\nDarcy laughed.\nA waitress stopped by to get their orders. Darcy ordered an extra of whatever Steve had picked, since she hadn't even glanced at the menu, and their highest-proof beer.\n\"Even then, though, you couldn't buy anything if you didn't have two pennies to rub together,\" Steve said once the waitress had left. \"Having money will always be more of a shock than spending money will ever be.\"\n\"What's the average salary for an Avenger?\" Darcy asked. \"Also, is anyone looking for a sidekick?\"\n\"No one wants to pay the people who spend half their time accidentally destroying Manhattan,\" Steve pointed out. \"All my money comes from military backpay. Tony's lawyers were absolute sharks about getting me everything I had earned.\" When Darcy sighed again, he added, \"You know, you don't really need to worry about this right now. It's not like Tony is going to kick you out of the Tower.\"\n\"I'm honestly not sure why I got invited in the first place,\" Darcy admitted. \"I mean, not to look a gift horse in the mouth, but I don't exactly contribute to the initiative.\"\n\"I think Jane made it a condition if she was going to move in, and Thor backed her up,\" Steve said.\nThe waitress dropped off Darcy's beer, and she immediately took a long draught from it. \"Sounds like my entire initiation into the superhero world,\" she admitted. \"Jane just drags me along for the ride even though I don't actually contribute anything. Except Pop-Tarts. I'm actually good at keeping us stocked in those.\"\n\"It's not about contributing,\" Steve said. \"The Tower is supposed to be a home. I invited Sam in before he even agreed to work with the team.\"\nDarcy hummed. \"To be honest, I expected you and Bucky to ask me to move out. You know, after everything.\"\n\"We wouldn't do that,\" Steve said.\nFrustrated by his calmness, she said, \"You said the Tower's supposed to be like your home. You shouldn't have to be uncomfortable there.\"\n\"I wouldn't have invited you to lunch if you made me uncomfortable,\" Steve pointed out. \"Maybe we didn't get off to the best start, but you're a good person. I'd like for us to be friends. Just--\"\n\"Not anything else. Don't worry, I had the same conversation with Bucky,\" Darcy said.\nSteve shrugged. \"Bucky and I are a bit protective of each other,\" he explained. \"We were separated for decades, but we're getting another chance here. Neither of us is going to let that go. We've fought too hard to find it.\"\n\"Honestly? I just moved to New York City. I'd much rather focus on not bombing interviews and not tripping on the sidewalk than trying to deal with not one, but two soulmates,\" Darcy admitted. \"Still, I can't guarantee that I won't use our status as soulmates to get free food from you and other citizens of New York. Do you guys get an Avengers discount?\"\nLaughing, Steve said, \"People occasionally offer free food, but I think most people figure that Tony can pay for anything we'd want. They're right, in a way. He offered to give me an AmEx, but I wouldn't let him.\"\nDarcy huffed, blowing a stray piece of hair away from her face. \"Well, if I needed any evidence that you're just as nice as the propaganda says, I guess I just got it.\"\n\"I really just like watching Tony gape like a fish when I pull out my wallet when we're out together,\" Steve confided with a smirk. The Mario Kart had been the first sign, but this sealed the deal. Steve Rogers was definitely Darcy's kind of person.\n----\nDarcy was in her pajamas flipping through channels lazily when someone plopped onto the couch beside her. She jolted, startled, as her head snapped over to look at Bucky. Like her, he was dressed casually in a plaid shirt and jeans that could have come from any closet in America. Actually, Darcy wasn't entirely convinced that he hadn't stolen the shirt from Steve, who had worn something similar the other day to the Central Park Zoo.\n\"Has anyone suggested that we put a bell on you?\" she grumbled, mentally ordering her heartbeat to stop freaking out.\nBucky let out a low chuckle. \"Daily. I've had to stop visiting Tony in his workshop because he kept dropping flammable and/or sharp things every time I walked in.\"\n\"I can see why that might make him upset.\" Darcy glanced down at the clock on the DVD player. It was just before six on a Saturday morning, and the rest of the Tower had been happily asleep when Darcy had woken up at five, unable to relax again. \"What are you doing up this early?\"\nHe shrugged, so she didn't press the subject.\n\"Want to watch Say Yes to the Dress with me? That's the only thing worth watching that's on this early.\"\n\"What's that?\" he asked, settling further onto the couch.\nShe rearranged herself so she could use his right arm as a pillow. It was her go-to position if she was watching TV with her friends, especially when they looked like they could use some comfort, but she hesitated when he froze upon contact. She was just about to sit back up when he relaxed under her. Smiling to herself, she cuddled up closer and began explaining the show to him.\n----\nAfter that, Darcy started spending more and more time with Steve and Bucky. Steve, who was embracing all of the culture and technology available in the new century, invited her to tag along when he went to obscure shops in Chinatown for what an Internet thread claimed were the best soup dumplings in the city or to see a new exhibit about Pac-Man at the MoMA.\nBucky, in the meantime, always seemed to know when she was sulking around the Tower. He was equally able to provide a raunchy joke to distract her or a shoulder to cry on, and seemed to know instinctively what she'd need.\nAfter a few weeks, Darcy never went a day without seeing at least one of them, but it didn't take her long to notice that the three of them never spent time alone together.\nShe was on the roof sunbathing with Sam when she finally brought it up. \"Do you think Steve and Bucky won't hang out with me at the same time because they're afraid of me?\"\nSam snorted, and then rolled his head to the side and lifted his sunglasses so he could look at her.\n\"Not like the I'm-a-Doombot way,\" Darcy said. \"In the 'I can't watch my boyfriend talk to that skank' way.\"\n\"You're not a skank, Darcy.\"\n\"You're not answering the question.\"\nDarcy loved spending time with Sam. He was effortlessly friendly and had the required sass to keep her engaged. Darcy didn't make friends easily. Acquaintances? Absolutely. She walk into any bar back on campus and have people to chat with. As for people she could really trust? The list wasn't quite as long, and nearly all of them lived in the Tower.\nSam wasn't intimidated. \"Don't you think it's something you should ask them about?\"\n\"I just need to know whether I'm doing the right thing here, being their friend,\" Darcy said, propping herself up on an elbow so she could look at him. He was dressed in a pair of star-spangled swim shorts and nothing else. Darcy imagined that he took great pride in wearing them around Steve. \"If I'm being an accidental home-wrecker, I want to know.\"\n\"Look, I'm not going to tell you what to do here, even though I think you'd missing out if you stopped talking to either of them. But you at least need to trust their judgement. Steve may be a reckless idiot and Bucky may be more messed up than the rest of us combined, but they're smart, determined guys. If they want to be your friends, it's because they're choosing to be.\"\nDarcy laid back on her chair. After a moment, she said, \"Does Tony pay you anything for being a live-in shrink? Also, do you think he'd give me a job if I become your apprentice?\"\n\"He doesn't, and I don't think you're cut out for psychology. Pepper likes to take me out and buy me things in thanks for keeping you all sane, though, which I guess is basically the same thing.\"\n\"I was wondering how you had Fendi sunglasses.\"\nHe shrugged. \"I earned 'em.\"\n----\n\"We're friends, right?\" Darcy asked impatiently the next day.\nSteve froze with a sushi roll halfway to his mouth. \"Um, yes?\"\nOkay, so maybe it hadn't had much of a segue, but it had taken Darcy that long to blurt it out. \"You're not in trouble. You can keep eating,\" she pointed out.\nCautiously, he did so, sticking the whole piece of sushi in his mouth.\n\"I was just wondering why you never want to hang out with me around Bucky. Are you worried I'm going to, like, try to start a threesome?\"\nSteve choked on his mouthful of rice and fish. He held up a hand as he coughed, making Darcy hold off on her next point until he could breathe again. \"What?\" he asked after a solid minute.\nDarcy rolled her eyes. \"I'm not dumb. We've been hanging out for weeks, but I never even see you both to in the same room for long, unless it's movie night or something.\" She hesitated, jaw dropping. \"Oh god, did you guys break up?\"\n\"No, we didn't break up,\" Steve said, taking a drink of water when his voice came out hoarse. \"Buck and I are fine.\"\nDarcy spun her straw slowly in her glass, keeping her eyes on the swirling ice cubes. \"Just not around me?\"\nSteve's mortification at her initial question seemed to fade when he caught her tone. \"It was Bucky's idea,\" Steve said.\nThat didn't exactly help. She had thought she and Bucky were close these days.\n\"Not like that,\" Steve said immediately. Darcy needed to work on her neutral face. Natasha could probably give great lessons. \"He didn't think it was...kind for us to make you spend time with both of us.\"\n\"Yeah, that totally sounds like something he'd say,\" Darcy said sarcastically, jerking the straw with enough force to nearly tip over the glass.\nSteve shrugged. \"His phrasing was closer to 'making her watch us together would be a dick move,' but that was the gist.\" Darcy frowned, considering that logic, but Steve continued without prompting, \"I've really enjoyed getting to know you. I get now why you're one of my soulmates. I think Bucky thinks the same thing.\"\n\"So you're trying to keep your distance from me?\" Darcy confirmed.\n\"That's not it at all, Darcy. It's just that we like you too much to throw our relationship in your face,\" Steve said. In his enthusiasm to explain the situation, his sushi was left abandoned to the side. \"Bucky and I aren't very public with our relationship. In Brooklyn we could only be us in our apartment, and we only had to be more secretive in the army. It's easy for us to keep it all behind closed doors.\"\nHer own troubles forgotten, Darcy said, \"That's bullshit. You shouldn't have to hide. You know the team isn't going to judge you.\"\n\"I know. Well, I've learned. None of our team is afraid to say what they think,\" Steve said, smiling slightly. \"But I'm still used to having Bucky all to myself. I'm not used to sharing, even when it just comes to being with him around other people.”\n“You guys just seem to really love each other. I don’t want you to not feel like you can spend time with him because I’m around. I’m not even talking about the kissing or whatever. But shouldn't he be here exploring the city with you?”\n“He’s not really a fan of all the culinary joys this century has to offer. He also, well, sometimes he has trouble with big crowds or tight spaces. I've had fun trying new stuff with you,” Steve said, but he looked thoughtful. “But if you really are okay with hanging out with both of us, maybe we can all do something else.”\nDarcy nodded. “That’s all I want. You guys have been really great. It’s not your fault that we've got matching soulmarks. I’m not going to be some asshole who holds the fact that you two are happy together against you.”\nSteve smiled at her, affection warming his eyes. “You’re really something, you know that, Darcy?”\nGrinning back, she speared a piece of his sushi and dropped it onto her own plate. “So they say.”\nHe stole one of her pieces in retaliation, so Darcy knew they were back to normal.\n——\nDarcy was in her underwear, flipping through the slim pickings in her closet, when JARVIS spoke up from the room's speakers. \"Miss Lewis?\"\nStartled, Darcy whirled around. \"Holy shit, JARVIS, are you watching me change?\"\nWhen the AI spoke again, he sounded exasperated, but amused. \"Miss Lewis, despite the affection we share, I am not actually a human being. I derive no pleasure in seeing you in your skivvies.\"\n\"Why do you even have a camera in here?\" Darcy asked. \"Please tell me Tony doesn't stream all this somewhere. If I'm going to strip for an audience, I'm damn well getting paid.\"\n\"No one has access to the visual or audio feeds from any of the private rooms in the Tower, nor are they recorded anywhere,\" JARVIS assured her. \"They're in place in case of emergencies. If you would like to have my presence removed from the room...\"\n\"'Course not, JARVIS. You're like a sassy British roommate. I'm taking your word on the 'no recording' thing, okay? Don't let me down.\"\n\"Perish the thought.\"\nDarcy laughed. \"So what's up? Or did you just want to chat?\"\n\"Miss Potts has invited you to meet her for brunch, if you're amendable,\" JARVIS said. \"She offered to meet you in the lobby in ten minutes.\"\n\"Wait, Miss Potts as in Pepper Potts?\" Darcy had only met the Stark Industries CEO in passing and had been suitably awed. \"And you're only giving me ten minutes to get ready?\"\nIn college, Darcy had become an expert at rolling out of bed five minutes before class and managing to look presentable, but what was acceptable at an 8am International Relations class was completely different than what brunch with one of Forbe's Most Influential People entailed.\nWhen Darcy finally fell out of the lobby elevator, she was wearing a ruffled silk top that hopefully drew attention away from her slightly dusty black jeans and black sneakers. Her hair had been scooped back in a high ponytail, and her makeup was reduced to two swipes of eyeliner and a swirl of red lipstick.\nPepper was waiting by the elevator and smiled when she saw Darcy. Rather than the powerful white pantsuit she had been wearing when Darcy had first glimpsed her, Pepper was in a tasteful green scoopneck paired with a dove-gray pencil skirt. Though her matching blazer was slung casually over her arm and her smile was gentle, Darcy was glad she hadn't given up and stumbled out in the worn-out Anberlin concert shirt that had been her original plan for the day. \"Hi, Darcy. Sorry for the short notice on this,\" Pepper said, coming forward and shaking Darcy's hand.\n\"No problem,\" Darcy said. \"Brunch is my favorite meal of the day. Well, one of them.\"\n\"One of the things I love about this city is the brunch,\" Pepper said as she led Darcy out of the building. Rather than stepping into a private car, Pepper set off down the street on foot. Darcy practically had to jog to keep up with Pepper's long strides. \"How do you like the city so far? You've been here, how long, a month now?\"\n\"Five weeks,\" Darcy said.\nBy the time they got to the hole-in-the-wall diner that Pepper had picked, Darcy had gone from distant admiration to solid girl-crush zone on Pepper Potts.\nWas there some rule that everyone involved with the Avengers had to be both genuinely fun and completely gorgeous?\nThe diner was small and cramped, but mirrors on all sides made the room seem bigger than it was. The menu was simple, but everything that was out on tables already looked delicious. \"Do you have any favorite brunch spots yet? I'm always looking for new places,\" Pepper asked after they'd ordered.\n\"I'm still figuring out the best places to go in the city,\" Darcy admitted. \"Steve and I try to go to at least one or two new places a week.\"\nPepper nodded. \"Tony mentioned that you'd been getting Steve out of the Tower.\"\nFrowning, Darcy said, \"You sound surprised.\"\n\"I've talked to Steve a few times, but he's hard to get to know. Tony said that before you moved in, Steve barely ever left the Tower at all.\"\n\"That doesn't make sense. He loves exploring the city.\"\n\"Maybe he likes exploring the city with someone,\" Pepper pointed out gently. \"Bucky wasn't in any state to be that person, and it's taken Steve a while to see the team as his friends as well as soldiers he has to protect.\" Pepper shrugged. \"I've never been in any situation like he's gone through, but I know that it can be hard to keep personal and professional relationships separate. God knows I had a hard enough time with Tony, even before our roles switched.\"\nDarcy couldn't repress a smirk at that. \"That might just be a Tony problem,\" she pointed out. \"I don't think he'd know professionalism if it bit him in the ass.\"\n\"Fair enough,\" Pepper conceded. \"And I don't think that Steve's trouble comes from any sense of propriety. He's a soldier from Brooklyn, not a frail old businessman. But what he is is a guy who's lost everything.\"\nDarcy's expression fell. \"Yeah.\"\n\"When Tony got back from Afghanistan, it took him a long time to open up to anyone. It wasn't just because he wanted to keep Iron Man a secret, though that was part of it. The first person who saw him beyond a boozy weapons tycoon died helping Tony escape. You don't go through something like that and come out the other side eager to open up to people.\"\nBucky may have been back, but Darcy had grown up hearing stories of Captain America and his Howling Commandos. Sure, his blonde, blue-eyed proganda had been a bit outdated for a liberal like Darcy, but no one got through school without learning World War II history. Bucky and Steve were alive, but everyone else they'd known and loved was long gone. Darcy wasn't blind. She'd spent enough time with each of them to see that they weren't always as happy as they seemed. Steve in particular was prone to smiling when he should have been crying, and it broke Darcy up inside to see it. It infuriated her that Steve had to live in a world where everyone knew his story and what he had lost. \"I get that,\" Darcy said. \"But I'm not really sure it's something we should discuss behind his back.\"\n\"And by 'we' you mean 'me,'\" Pepper interpreted. Darcy flushed slightly but didn't apologize. \"You're right.\"\nPepper paused as the waitress came by to set their plates in front of them. Once they were alone again, she repeated, \"You're right. I'm not saying this because I'm trying to pry into his personal life. I brought it up because I want to offer you a job.\"\nDarcy nearly dropped her fork. \"What?\"\n\"A job. Do you know how hard it is to find people who can get along with that pack of superheroes? I'm dating one of them and even I can barely spend three consecutive hours on the communal floors. But with SHIELD's collapse, Stark Industries is funding and managing every part of the team that doesn't actually have to do with saving the world.\"\n\"Really?\"\nPepper smirked. \"Who did you think did it? Natasha probably could, but that's not her kind of position. Steve and Bucky are too busy being Steve and Bucky. Bruce doesn't have the patience; Thor knows how to rule, not how to manage a PR disaster on Earth; Clint has less desire than Natasha to be a team leader; Tony would rather tinker in his workshop that make the big decisions. That's why he made me CEO of Stark Industries, and that's why I want to make you the Avengers' PR manager.\"\nDarcy was still stunned. \"You want to give me a job? A paying job?\"\n\"Stark Industries doesn't have unpaid positions. We want the best employees and are willing to pay to have them. But we can discuss your salary once you've considered the offer.\"\n\"You want to pay me just because I can play nice with the team?\"\n\"I've seen your resume, thanks to Jane, and you have just about the best references anyone could ask for. You have a background in Political Science and have the proven ability to handle situations beyond the norm. If you could handle being among the first people to come in contact with alien life, you can handle anything. So what do you think? Are you interested?\"\nDarcy's grin had been growing steadily as Pepper talked, and finally she reached out her hand to shake Pepper's. \"Count me in.\"\n——\nDarcy had had a great day. Steve and Bucky had shown her around Coney Island, regaling her with stories specifically designed to embarrass the other. The boardwalk and beach were crowded, but even the people who didn't recognize them gave the two superheroes space. It was hard to shove around someone whose shoulders were the size of a trashcan lid. Darcy wiggled herself firmly between them to take advantage of their bubble of easy walking.\nBucky had been uncomfortable when they arrived at the beach. His metal arm had whirred as it constantly readjusted itself, and his eyes darted around as though every person in the crowd was a threat.\nSteve had noticed--of course Steve had noticed-- but he wasn't much better. Darcy had noticed early on that Steve's tension levels usually matched Bucky's. When Bucky was feeling vulnerable and seeing everything as a potential threat, Steve became that much more eager to protect him.\nWhen the discomfort had ratcheted higher over the next few minutes rather than settling, Darcy had wiggled between them and reached down to grab a hand on either side of her. Steve delicately took her offered hand, but Bucky held on immediately.\nShe grinned when she felt some of the tension snap loose, and she continued her mission to distract them by dragging them toward Coney's small amusement park.\nThe roller coaster had been temporarily out of commission, much to Bucky's dismay, but they all squeezed into a ferris wheel carriage. The combined weight of Steve and Bucky in the front seat and Darcy in the back made the whole thing tilt ominously, but Bucky had assured her that it was supposed to be unbalanced. As she had sat in the back, alternating between clutching the sides with all of her strength and laughing her head off, she looked at the two of them and wondered how she had gotten so lucky as to find them.\nThough Darcy had been to beaches before, mostly for spring break getaways, Coney Island was more of a tourist attraction than any other she had been to. The smell of hot dogs, pretzels and brine had filled the air, and Darcy had felt content.\nAll in all, Darcy had ended the day with a tired smile on her face and a sunburn on her shoulders, sandwiched between Steve and Bucky for the long subway ride back to Stark Tower.\nUnfortunately, that happy exhaustion hadn't lasted long into the night.\nShe bolted awake, a cold sweat making her pajamas stick uncomfortably to her skin. \"Fuck,\" she grumbled, pulling her hair off her shoulders and twisting it to the side. At this point, she knew the drill. There was no way she was falling back to sleep without moving around a bit first.\nAfter running a damp washcloth quickly over her face and torso to get rid of the uncomfortable sensation of sweat, she trudged to the elevator. In general, she ended up in their the communal kitchen or living room on nights like these, though she rarely ran into anyone. No matter what kind of dreams she was having, Darcy wasn't going to wake anyone up just to keep her company, but if they already happened to be around...\nHer shoulders slumped in relief when she saw the TV flickering in the living room when the elevator doors opened.\nShe made a beeline for the couch. Though she didn't have her glasses on, Natasha and Bucky were easy to identify. They were sitting together in the middle, her head on his shoulder and his hand in her hair. \"Darcy,\" Bucky greeted, looking back at her.\nWith her usual spot taken, Darcy mumbled hello and then sprawled herself across their laps. It wasn't the most comfortable position, but it put her head right under Natasha's free hands.\nOn cue, Natasha's fingers drifted over the loose strands. \"Hello, Darcy,\" she said. Natasha was initially one of the more intimidating Avengers, but as soon as Darcy had seen her pelting peanuts at Clint, Darcy had decided to become her friend. She got the impression that Natasha humored her more than anything else, but the other woman's dry humor and expert application of emoticons made her the perfect person to text with updates from around the city.\nDarcy grunted in response.\n\"Not even monosyllabic,\" Natasha murmured. \"I'm surprised you made it out this far without hurting yourself. JARVIS, she didn't run into anything, did she?\"\n\"I had to open a few doors rather rapidly, but she is entirely uninjured,\" JARVIS's soothing voice replied.\nDarcy grumbled something that could have been \"Love you, JARVIS,\" or \"Fuck you, JARVIS.\" Even she wasn't entirely sure.\n\"Hush,\" Natasha said, petting her hair.\n\"We need to stop meeting like this, Darce,\" Bucky muttered. His metal hand rested on the back of her thigh, surprisingly warm even through her cotton pajama pants. \"Nice pajamas, by the way.\"\nDarcy murmured in agreement. They were nice. The s'more pattern and flowing script proclaiming 'You make me melt' had drawn her to them, but their coziness had sealed the deal. She felt herself drifting off. With Natasha and Bucky at her back--literally-- she was as safe as she could ever be.\n\"This happens a lot?\" Natasha was asking, but Darcy didn't hear Bucky's answer.\nWhen she woke up, she was still on the couch, but had a pillow under her head and a blanket over her body. Natasha was gone, but Bucky's metal hand was drawing idle patterns on her leg.\nStretching, she opened her eyes. To her surprise, the clock on the TV indicated that she'd been asleep for at least four hours. No wonder Natasha had left. It was still dark in the Tower, and the TV had been turned to a muted cooking show.\n\"Sleeping Beauty awakens,\" Bucky murmured as she twisted so she was on her back and could glance down at him. He was relaxed against the back of the couch, hand resting easy on her leg.\nDarcy yawned, stretching her arms up as high as she can. Settling back down, she said, \"If anyone gets that name in this place, it's Steve. First of all, he's the one who slept for decades. Secondly, he could pull off the Princess Aurora look best out of all of us. Like, Steve in drag would be awesome.\" She was never very eloquent after just waking up, but she thought she got her point across.\nBucky hummed in agreement.\nShe glanced at the clock again. \"Shouldn't you sleep?\"\n\"I did.\"\nDarcy looked at him skeptically, since he obviously hadn't moved an inch.\n\"I used to be a sniper,\" Bucky pointed out. \"I've slept in worse places than a hundred-thousand dollar couch with a dame draped over me.\" He paused, fingers resuming their idle pattern on her legs. \"You ever gonna tell me what this is all about?\"\n\"Didn't realize I was supposed to,\" Darcy replied, looking at the ceiling.\nThere was another pause. \"You don't have to. But you can.\"\n\"Just because we're 'soulmates' doesn't mean you have to deal with all my... whatever.\"\n\"This isn't a soulmate thing. It's a you and me thing. And you've been up most nights the last month-- I'm a bit worried.\"\n\"Aw, you do care,\" Darcy said, giving him a teasing smile.\n\"I do.\" His expression was solemn.\nDarcy's smile dimmed. \"It's not like my nightmares are anything to write home about. And you're up a lot too.\"\n\"I nap,\" Bucky said. \"That's just how I sleep best. Look, Darce, I'm not trying to dig up your weak spots here. I just need to know you're okay.\"\nDarcy was surprised to notice he looked pained. He didn't have many friends, she realized. All of them probably lived in this building, which meant all but one were on the front lines of battles every week. There, he could protect them. Here? It was just his concern against her stubborn pride.\nDarcy felt the fight melt out of her. \"I have nightmares,\" she said softly. Shaking her head, she added, \"But they're dumb, especially compared to what you and Steve--\"\n\"Pain isn't a competition,\" Bucky cut her off firmly.\n\"Okay,\" she said, taking it at face value. \"Well, it's just.... It's hard to sleep when I know what's out there. There are so many things that I don't stand a chance against.\" As she spoke, her voice sped up. Bucky never stopped stroking her leg. \"Every time I close my eyes I see that warship coming through a giant fucking rip in the fabric of the sky. I see that giant robot burning a New Mexico to the ground and almost taking us with it. When I started my internship with Jane, my biggest worry was that I wasn't going to have enough credits to graduate on time. Now it's hard to worry about jobs and things when there's a whole universe out there that's far far too big for me to ever understand. I've never been a control freak, but I thought I had some influence on my life.\" She shook her head. \"Every time I start thinking about the future, about who I want in my life and what I want to be doing, all I can think about is that none of that will matter when darkness consumes the whole fucking planet.\"\nBy the time she finished talking, she was almost panting. She pulled her legs off of him and sat up instead, tucking her legs under her. She ran a shaky hand through her loose hair and laughed. “Wow, that was really melodramatic. Sorry.”\n“None of us is going to let something happen to you,” Bucky told her.\nDarcy shook her head. “You guys save the world on the regular. My dumb nightmares aren’t a big deal.”\n“They’re real enough to stop you from sleeping,” he pointed out. He tilted his head and added, “Come here.”\nDarcy slid across the couch so she could tuck herself into her usual position against his arm. His metal arm drew her into a firm hug, and she let herself close her eyes and breathe in his scent. At some point, the combination of soap, gun oil, and citrus he always smelled like had become comforting.\nHe didn't point out that her fears were ridiculous, or even that worrying couldn't solve them anyway. All he said was, \"How can I help?\"\n\"This works,\" she said. His arms helped her feel grounded. It felt less like the world was on the verge of destruction-- instead, it felt like she was safe. \"Thanks.\"\n\"Any time you need it,\" he said.\nDarcy had learned young not to rely on people. Her dad had physically avoided the house, and between the wine and soap operas, her mom didn't have time for Darcy's troubles. Honestly, she no longer wanted her parents' help. She had learned young how to do and take what she wanted, since no one was going to do it for her. Fuck society's standards. Darcy Lewis did what she wanted, how she wanted.\nJane was the first person that Darcy had really trusted to have her back, but even they spent most of their time talking about Jane's experiments and Jane's intergalactic romance.\nNow, though, Darcy felt utterly convinced that Bucky meant what he said, that he was planning on having her back from here on out, no matter. The strength of her acceptance of his affection was alarming, but another slow breath in his arms was enough to quiet that.\n\"Right back at you,\" she murmured against his skin.\n----\nThe tension around the table was palpable. A thrum of distrust hummed with every moment of eye contact, charging the air. It was close to midnight on a Wednesday night, and Darcy knew she had to be downstairs in her office by nine the next day, but she wasn’t backing down until this was settled.\nKeeping her breathing steady and her voice casual, she placed two cards on the table. Clint slid two more her way, and she calmly added those to her hand.\n“Why can’t we just play Blackjack?” Tony complained loudly, breaking the tense atmosphere.\n“Because you count cards,” Darcy said sternly. “You all count cards. I wouldn’t trust a single one of you. Don’t give me those faces. Clint, you’re not as dumb as you act. And Steve, seriously? You told me you memorized an entire map of HYDRA bases by glancing at it for ten seconds. You wouldn’t even have to do it on purpose.” She tossed a chip into the pile at the center. “Raise.” Shaking her head, she added, “Even poker is a bit of a stretch with this crowd. Is there anything you guys aren’t great at?”\nTo be fair, Natasha and Clint had been split up, as well as Bucky and Steve. It was strange seeing them all at the table not sitting next to their usual partners, but Tony had refused to let them stay together. Darcy wasn’t entirely sure that Clint and Natasha weren’t still cheating somehow, but she wasn’t able to figure out how.\n“At least we’re not playing Spoons,” Clint pointed out, matching her bet. “That shit can get violent.”\n“We’re not that bad,” Tony said.\n“One time Natasha almost took my eye out lunging over me to get a spoon,” Bruce pointed out. He’d bowed out a few rounds in and taken up a position as spectator. Thor and Jane were still in Asgard, Pepper was working overseas, and Sam was visiting home, so it was down to the multi-billionaire, the pair of professional assassins, the pair of enhanced soldiers…and Darcy. “We’re not allowed to play Spoons any more after that.”\n“You nearly threw her out a window,” Steve reminded Bruce lightly, matching the bet as well.\n“Plus, Pepper has a policy against things that tend to unleash the Hulk. Go figure,” Tony commented, sliding a pair of chips into the center. “Raise.”\n“We could make it more interesting by betting with real money,” Natasha said, dropping her cards face-down and waving for Bucky to go.\n“I only just started getting a salary last week,” Darcy said, “so fuck that noise. Plastic chips all the way.” She glanced at Tony with wide, innocent eyes. “Unless, of course, someone wanted to buy me in.”\nTony raised his eyebrows and opened his mouth, but was cut off by a sudden siren blaring and bright red lights flashing around the room.\n“…Or not?” Darcy amended, looking around in alarm.\nThe rest of the table, meanwhile, had jumped to their feet. “Cut it out, JARVIS,” Tony said. “What’s the situation?”\n“There seem to be some sort of slime creatures attacking Harlem. Initial reports indicate they came from Central Park,” JARVIS said, silencing the alarm but keeping the emergency lights flashing. “The slime appears to erode metal, and can be used as an asphyxiating weapon.”\n“Strangled by slime,” Clint said. “What a lame way to die.”\n“Suit up, everyone,” Steve said. “Meet at the Quinjet in five. Tony, fly ahead and recon the situation. Darcy…stay here.”\nThe team ran from the room immediately, leaving Darcy sitting alone with a pile of chips and a stack of cards strewn across the table. She was left reeling from the change in pace, still wondering if her straight could have won that hand.\nShe stayed sitting there for a while until she heard the distant sound of the Quinjet taking off from two floors above her. “JARVIS?” she asked, shuffling her cards idly. She waited, not sure if JARVIS still bothered to access the Tower’s feeds while there was a fight to go to.\n“Yes, Miss Lewis?” JARVIS answered immediately, though he sounded a bit distracted.\n“Just…can you get me a live feed of the action?” she requested.\n“Of course, Miss Lewis,” JARVIS said, and a holographic view of a poorly-lit Manhattan street corner appeared against the dark window across from her. “They’ll be okay,” he added. “They’ve dealt with far worse on even less notice.”\nDarcy shrugged. “I know. I’m just…you know, figuring out how to spin this later. As their new PR Manager, and all, it seems like the thing to do.” It was, actually, a good idea, though she hadn’t considered it from that angle until the words had fallen from her mouth.\n“Of course, Miss Lewis.”\n----\nWatching Thor fight with the Avengers in Manhattan and in subsequent battles had been difficult enough for Darcy to sit through. At least then, though, the only person on the team she had been emotionally invested in had been the least vulnerable.\nNow, though, three out of the six she had to watch were only human, and two of the others were her best friends. The slime monsters should have seemed ridiculous. They looked more like giant slugs than the type of intimidating enemies that the Chitauri and Dark Elves had appeared.\nWhile the creatures were slow and heavy, though, they were also inexorable as they moved north into the Bronx. The camera footage was shaky and almost exclusively shadowed Tony, but she got enough glimpses of other people to see that it wasn’t as easy a cleanup as expected. Tony couldn’t touch down, since he’d learned quickly that the slime was just as acidic to his armor as it was to cars, but he shot repulsor blasts at everything he could. Though Bucky’s guns and arm were at risk, he stayed in the fight, using his other arm and the rest of his body to take down the creatures. Steve’s shield was indestructible, at least, and though Clint’s arrowheads were metal, the shafts were plastic and pierced through the slime with ease.\nThe Hulk and Natasha seemed to be having a great time pummeling their way through the monsters, neither having to worry about their weapons of choice—primarily their own bodies—getting damaged by the slime.\nThe neighborhood had been quickly evacuated by the NYPD, letting the Avengers focus on the fight rather than keeping civilians out of harm’s way.\nJARVIS checked in with Darcy with occasional updates, but the Avengers made it a point to never open their communications to anyone out of the field, so Darcy had to imagine most of the details. The tide started to turn about thirty minutes in when Steve found a weak spot on the back of the creatures’ heads.\nTony was taking care of one of the last creatures when the camera suddenly jerked sideways to show Natasha scratching wildly at her face, a glob of blue slime covering her nose and mouth. Darcy gasped, watching uselessly as Clint raced toward her before he got stuck in an unexpected slime puddle. He jerked his feet angrily, trying to dislodge himself. Tony was flying toward Natasha, even though his armor would be no help, but then Bucky appeared at her side. His movements were sharp and efficient as he tore the slime away from her face one-handed.\nClint made it to them just as Natasha sucked in her first gulp of air. Bucky let Clint steady Natasha as he turned back to the creatures. Darcy only caught a glimpse of his expression, but it was enough to chill her to the bone. Gone was the Bucky who had playfully taken nearly all of Steve’s poker chips. Gone was the man who had held her close while she talked about her nightmares. What she was seeing now was the Winter Soldier.\nThe remaining ten minutes of the fight were swift and brutal. It wasn’t the easiest thing to watch, but as long as everyone got safely home, she didn’t care.\nWhen JARVIS told her that the Quinjet had landed, she raced upstairs to meet them in the hangar. They looked worse for wear. Natasha still had streaks of blue on her face and neck, Bruce looked like he’d rolled around in the slime, Steve had a glob of it hanging from his hair, and Tony’s armored leg looked more like an old, corrugated car than brand-new Stark tech. It was the blank look in Bucky’s eyes that worried her the most, though.\n“Are you guys okay?” she asked.\n“Miss Lewis, do not make contact until they have been to the decontamination shower,” JARVIS said.\nDarcy paused mid-step toward Bucky. “It’s not poisonous, right?” she confirmed.\n“The full effects are not known. That’s why the decontamination process is vital,” JARVIS explained.\nDarcy wasn’t listening to the AI, though. She was paying attention to how Steve kept glancing at Bucky, who wasn’t looking at anyone. Everyone else was some shade of exhausted, but Bucky was entirely blank. Even worse, Steve looked scared.\n“That decontamination shower will make everyone safe again, right?” Darcy asked.\n“Yes, they should be completely free of all effects once—Miss Lewis, don’t…”\nDarcy crossed the room and drew Bucky into a tight hug. “Heya, Buck,” she greeted, ignoring the way the handles of his various weapons pressed uncomfortably against her torso.\nThere was an aborted movement from Steve beside them when Bucky shifted in her grasp, but Bucky just rested a hand on the back of her head. “Hey, Darce.” He started to relax in her arms, and she felt him sigh.\n“Well now you can just join everyone else in the decontamination shower,” JARVIS said snippily.\nDarcy stifled a giggle against Bucky’s vest.\n“Come on, Lewis,” Tony said, armor clanking as he walked past her. “Stop making my AI nervous.\"\nThe decontamination shower was not, as the phrase implied, one of Stark Tower’s many multi-angled water showers. It was a series of rooms that only got more uncomfortable as they progressed forward. By the end, Darcy’s clothes had been confiscated for observation and further cleaning, a robot had doused her in orange gel and scrubbed her entire body, and about ten gallons of water had been poured over her head. The drying room was a bit more fun, since warm air just blew gently all over her.\nBy the time she was wrapped in a fluffy red robe and emerging from the other side into the Tower proper, Darcy was cleaner than she’d been in her whole life. The other Avengers had gone through at the same time through their own individual corridors (other than Steve and Bucky, who had apparently gone through together), and were gathered in the living room. It should have been amusing to see the team of superheroes dressed in plush robes of various colors, but Darcy was just glad to see them all where they belonged.\nBruce was asleep in his usual armchair with Tony sprawled over his lap, Natasha and Clint were cuddling on the loveseat, and Bucky and Steve were on the couch. There was still some tension in their shoulders, and a few inches of space remained between them. Bucky’s eyes were no longer blank, but were instead shamed, and Steve didn’t seem to have a clue what to do. Darcy, however, didn’t hesitate. When she plopped onto the couch between Steve and Bucky, they both curled into her slightly at the same time.\nShe put an arm around each of them, letting herself take a moment of appreciate the fact that they were both alive and there with her.\nThey had become so important to her, each in their own way, and if just giving them an excuse to relax helped them helped at all, she’d sit here all night. Honestly, she didn’t know what she’d do without them.\nShe loved them both too much to even imagine it.\nHer brain skidded to a halt, repeating that last thought. Well, fuck.\n----\nEven once Jane finally got back from Asgard the next week, it still was difficult to drag her away from the tower for a much needed girls' night. Once Darcy had given up on subtle hints and declared that she needed margaritas ASAP, Jane had gotten on board.\nBack in New Mexico, where margaritas flowed like water, Darcy and Jane had bonded over many a glass. Even scientists needed to cut loose occasionally, and Darcy loved seeing Jane let her hair down.\nSometimes they went to clubs, but for the most part they just found a secluded bar and drank until they were in a state of constantly either giggling or crying.\n\"Asgardian mead is so much stronger than this,\" Jane said, though her slightly glazed expression indicated that the tequila was still doing the job. \"And it tastes like apples. Not...\"\n\"Like lighter fluid?\" Darcy suggested, sipping her margarita. They were on their third glass each, and Darcy could feel the warmth in her nose and ears. The stuff they served here was strong, but it was happy hour until midnight and Darcy was planning to take full advantage.\n\"Yeah,\" Jane said.\nDarcy frowned, peering over the rim of her glasses. \"You're not planning on moving to Asgard, are you? Because you only just dragged me to New York, and I only just got a full-time job.\"\n“How’s that going, by the way?”\n“I’m learning the importance of keeping professional feelings out of my personal life, at least. God, I could have punched Tony the other day for that comment he made on CNN, but once we got home, he was just my roommate, you know? The job itself is interesting. I’m meeting all sorts of politicians and reporters, and working for Pepper is just, wow.”\n“Sounds like you really like it.”\nDarcy narrowed her eyes. “That’s still doesn’t mean you get to move to Asgard.”\nShaking her head, Jane said, \"I wouldn’t. I mean, the science over there is just...whoa, and there are so many years of culture and history for me to study--\"\n\"But...?\" Darcy prompted before Jane could start on another 'I heart Asgard' spiel.\n\"But Earth's my home, and now it's Thor's too. He's not just here so he can be with me, you know. He's made a real connection with the people here.\"\n\"He's a hard guy not to love,\" Darcy agreed. \"Steve and Bucky say that he's their favorite.\"\nJane narrowed her eyes, and Darcy quickly shook her head, nearly upending her margarita. \"Ew please, you know I don't love-love Thor. He's muscly goodness, but we're just warrior brethren or whatever.\"\n\"No,\" Jane said, \"I just realized why you needed a girls' night.\"\n\"What do you mean?\"\n\"I mean that I know what your voice gets like when you're crushing on someone and too drunk to hide it! Darce, you practically had hearts coming out of your eyes when you mentioned Steve and Bucky.\"\nDarcy let her head drop to the table, letting it thunk harder than she intended. \"Please don't tell me I'm that obvious.\"\n\"I thought you guys had decided not to date!\" Jane continued without soothing Darcy's worry.\n\"We did,\" Darcy grumbled. She moved her head to the side so she could look up at Jane through crooked glasses. \"My brain said no but my heart said yes, Jane. My heart's a son of a bitch.\"\nJane nodded sympathetically.\nShe sat back up, taking a moment to steady herself when the room started spinning, and then said, \"What's wrong with me, Jane?\"\n\"You have a crush on your own soulmates. I don't see how it's a bad thing.\"\n\"Because I promised them I wouldn't try to come between them! Or try to start a threesome!\" Darcy sighed, pouting. \"Why would I ever promise to not start a threesome?\"\n\"They are really hot,\" Jane agreed, sipping her drink lazily. \"I bet they look great together...\"\n\"Hey, those are my-- well, their own men you're talking about! Besides, it's not just about Steve's Dorito shoulders or Bucky's cleft chin I want to lick or the combined power of their blue eyes! They're just so.... Bucky has come so far just since I met him, Steve is working so hard to help Bucky, and all I want to do is help them help each other. And also drink Bucky's hot chocolate and snuggle them on the couch and make them do more dorky touristy stuff. Jane, I've never just connected with anyone like this before, especially not this quickly. It’s like they're…”\n“Your soulmates?” Jane suggested.\n\"Yeah,\" Darcy said, shoulders slumping.\n\"So what's the plan here? Show them why three is better than two?\"\nDarcy shook her head. \"They couldn't have been more clear that they're not interested if they had literally gotten it tattooed on their beautiful faces. I'm just going to pine until I get over it.\" When Jane looked ready to protest, Darcy added, \"Look, I've had enough assholes get on my case about friend-zoning them-- I'm not going to do that to my guys.\"\n\"You might be pining for a while,\" Jane pointed out.\nWith a shrug, Darcy leaned across the table to click her glass against Jane's. \"Thus, four-dollar margaritas.\"\n----\nThere was part of Darcy that loved the idea of being a cultured metropolitan citizen. New York was full of jazz concerts, art galleries, and independent theaters. She had no excuse not to get out and explore the city's art scene.\nOther than the fact if she had to stare at one more painting, she was going to scream.\n\"Look at his use of chiaroscuro,\" Steve was saying, gesturing enthusiastically at the large painting as he talked. \"Guido Reni's early years were really characterized by the style. Look how dynamic it is.\"\nDarcy, who was leaning against Bucky on the bench in the center of the room, nodded when Steve looked back at them. \"Yeah,\" she attempted. \"Really...dynamic.\"\n\"Weren't we just looking at this one?\" Bucky muttered.\nDarcy frowned, looking at the painting again. \"Uh, the other one was smaller, I think.\"\n\"Because I wouldn't put it past Steve to make us walk in circles around the same two rooms to see how long it took us to notice,\" Bucky said.\nConsidering that, Darcy looked around the room they were in a bit more closely. Every room in the Met had high ceilings and a similar aesthetic, with mild variations in how hideous the painted babies looked. Darcy shook her head. \"Nah, I'd have remembered that,\" she said, pointing to a painting of a naked man pinned to a tree by a dozen arrows.\n\"Thanks for coming with us,\" Bucky said. \"It's good to have someone sane nearby.\"\n\"You guys are good people.\" If she had thought that she got along well with Steve and Bucky individually, it was nothing compared to how easily she got along with both of them. They moved like two stars in orbit, reacting to each other without a second thought. Having a conversation with them was never boring, and Darcy looked forward to every minute she got to spend with them. She rarely connected with people so quickly, especially after such a tense beginning, but she couldn't imagine navigating New York without them.\nShe chuckled softly. \"Am I a heathen though for thinking this is boring?\"\nShe felt Bucky shrug. \"Then I guess we're both heathens.\"\nSteve turned around just in time to watch Bucky groan and let his head flop down to rest on top of hers. He crossed his arms. How could someone with biceps like that be such an adorable nerd? \"Are you two giving up?\"\nBucky gave him a lazy thumbs-up, and Darcy put on her best guilty expression. She was wearing her favorite red lipstick today, so she was sure the pout was one of her personal best.\n\"We've only been here for three hours,\" Steve pointed out. Darcy felt bad for a beat before Steve smirked. \"You lasted longer than I expected.\"\n\"You are such a punk,\" Bucky said, sitting up. \"Did you even want to come here?\"\n\"'Course I did,\" Steve said. \"I could happily live at the Met. I just didn't think you two would agree to come.\"\nBucky shook his head. \"Why do we put up with you?\"\n\"Because you love me,\" Steve said with a bright grin.\nBucky crossed the large, empty room and kissed Steve, turning it from a simple peck to something hot and enthusiastic within seconds. They had known each other their whole lives, but they never seemed tired of touching each other.\nDarcy watched idly until Steve let out a breathy moan that made her immediately flushed. She averted her gaze as she stood up. \"Quit macking on each other,\" she said, glancing toward the door to make sure no one was headed their way. Steve had told her that he and Bucky were possessive of what they had, and she knew he wouldn't be comfortable with spectators.\nShe wondered where she figured into that now.\nThey pulled apart, but neither looked remotely ashamed.\n\"Honestly, you guys are like teenagers,\" she said with a laugh.\n\"We're young at heart,\" Bucky said, smirking. He still had an arm wrapped around Steve.\n\"And older than my grandpa in years,\" she pointed out, smirking.\nBucky raised his eyebrows. \"You're the one who can't stop staring, doll.\"\n\"I... What?\"\nSteve nudged him with a sharp elbow, but Bucky just shrugged. \"Come on, Steve, it's not exactly a secret.\"\nDarcy crossed her arms, feeling exposed in the cold halls of the museum.\n\"You're being an asshole about it,\" Steve said firmly. \"This wasn't how we agreed to do this.\"\nOh God. It was an intervention. A 'please-stop-drooling-over-us-vention.'\n\"C'mon, we've got to all be on the same page here,\" Bucky protested. \"Right?\"\nDarcy's fingers started tapping rapidly against her arm, nails hitting her skin in contained blows. \"Don't do this,\" she requested. Darcy Lewis had never been afraid of words, but at that moment, she'd rather lose her hearing than listen to them reject her once again.\n\"But Darce--\"\nShe cut Steve off. \"I just want things to stay the way they are, okay? You guys...\" She had to pause to make sure she wasn't tearing up in the middle of the Metropolitan Museum. \"You guys are my best friends. I don't want to lose that.\"\nThey both looked stricken. Bucky held up his hands, taking a step closer to her but visibly restraining himself. \"Whoa, Darcy, it's okay.\" He glanced at Steve and then continued, \"We just thought it was worth talking about. It doesn't have to change anything.\"\nDarcy swallowed. \"You really think we can talk about it and be just the same again after?\"\n\"We won't bring it up again,\" Steve said. \"I promise.\" He moved closer and, after a moment of hesitation, drew Darcy into a hug.\nShe clutched his wide shoulders, sighing in relief. She had wondered if even acknowledging the elephant in the room was going to shatter what they'd built, but Steve's arms were as steady as ever.\n----\nThere had been a few days of awkwardness between her and the two super-soldiers. They were keeping their distance from her, which was the opposite of what she had wanted, but she couldn't blame them.\nIt was her fault, after all. Darcy couldn't keep the damn hearts out of her eyes, and Steve and Bucky were freaked out. She had sworn up and down when they'd first spoken that she valued their decision over the words on her ribs.\nThe worst of it was, she did. She couldn't have given less of a fuck about destiny. But no amount of trying could stop her from loving them.\nShe could prove that she could feel the way she did and still just be their friend. To show that, she was on a hunt for the best cannoli in the city.\nThese days, you couldn't turn around in New York without running into at least one hipster who was a complete snob about some obscure food. Darcy had tried out the bar scene downtown a few times, but she had stopped after hearing for the dozenth time how the beer on tap was so inferior to the stout that some friend brewed on his own roof.\nHearing Steve and Bucky talk about the food they missed from back in their youths, though, made Darcy ache for them. Steve liked to point how much more convenient and varied everything was in the twenty-first century, but he looked wistful when he and Bucky chatted about the cannoli they used to have back in their Brooklyn.\nOne of their neighbors had been an elderly woman who had immigrated from Sicily with her husband and five children. Once her husband had died and her kids all moved out, she had given Steve and Bucky cannoli in exchange for them helping her maintain the apartment. To hear them talk, you would think that Giulia had made the filling with gold dust.\nShe had combed the internet for help on her mission, and the search had led her to a small bakery on Staten Island. According to the whispers online, the food was perfection, even if the location left much to be desired. After taking the ferry over, she had wondered whether it would be worth the effort, but when the bell chimed over her head when she walked inside the bakery, she knew she'd made the right choice.\nTo say the shop was small would have been an understatement. She knew square footage in New York wasn't cheap, but this place was as small as some closets in the Southwest. One display of desserts sat underneath a counter, and an ancient-looking cash register sat on top. The food looked amazing, though Darcy didn't know much about Italian desserts.\nThere was a young woman behind the counter filling out a crossword puzzle book who looked up when Darcy cleared her throat. Her nametag said Ilaria, and her hazel eyes were edged in thick dark liner.\n\"I'd like to buy some cannolis,\" Darcy said when Ilaria didn't prompt her.\n\"Cannoli.\" The woman looked unimpressed.\n\"Uh, yes?\"\n\"It's 'cannoli,' not 'cannolis.' The 'i' is plural in Italian,\" Ilaria explained, not putting down her book.\nIrritated now, Darcy said, \"I'm looking to buy some cannoli, but it needs to be the best goddamn cannoli in the city. These are apology treats, and they need to be perfect. That sound like something you can do?\"\nThe woman nodded. \"My nonna makes the best in the world. How many do you need?\"\nDarcy made a quick calculation. The number had to be adjusted for Steve and Bucky, and then quadrupled to have a chance to feed the rest of the team. \"Four dozen.\"\nRaising her eyebrows, Ilaria set down her book and pen. \"We should be able to whip something up. Are you doing an event?\"\n\"No, I just live with some people who really love to eat.\" She perked up. \"You guys don't offer an Avengers discount by chance, do you?\"\n----\nIf Darcy had realized how much good will she could get just from mentioning that she was in with the Avengers, she'd have started namedropping ages ago.\nNot only was she laden down with four dozen fresh cannoli, the chef-- Ilaria's nonna-- had lived in Italy during WWII, and had loved hearing stories about Captain America and his team. The old woman was so delighted when Darcy showed them a selfie of her, Bucky, and Steve that she added a bag of complimentary cookies to Darcy's order.\nNow that she had her prize in hand, the ferry felt less stifling than it had on the way over. She was walking toward the subway that would take her back to the Tower, enjoying the sunshine, when she heard a scream.\nShe whirled around to find the source, but her attention was quickly redirected to the flock of what looked like people overhead. One swooped down toward the street, and Darcy quickly reassessed her assumption.\nThey were robots.\nThe one directly overhead fired off some sort of energy blast into a nearby building, causing glass and debris to rain down onto the streets.\nAs with most disasters she’d been in (and how had she reached a point in her life where there were plural of them?), the people around Darcy were screaming and running without any clear plan of action. The robot didn’t seem to have any specific plan other than mayhem, but it seemed perfectly capable of it. From the sound of distant explosions, Darcy figured that the rest of the city was under attack as well.\nShe needed to get out of sight. While everyone else ran away, Darcy pressed her back against the side of a stoop, crouching to stay out of the robot’s crosshairs. There was no point in running if there was nowhere to run to.\nShe peeked over the top of the stoop. The robot was shooting things indiscriminately: cars, buildings, sidewalks, so there was nowhere to run. Debris had already resulted in several people injured just from the blur Darcy could see.\nShe had never been so outclassed in her life. All she had on her side was a scuffed purse and a slightly wrinkled bag of Italian pastries. Then again, that might have been enough.\nFumbling with her purse, trying not to drop anything despite her shaking hands, Darcy managed to grab her phone from where it'd settled at the bottom. She was flicking through the options to get to Steve's number, but another scream from nearby stopped her with her finger hovering over the screen.\nNew York was under attack by who knew how many robots. The Avengers had inevitably already been called into the fight. None of them could rush down here to save her without sacrificing countless other people.\nThor would come anyway, she was sure of that. He was one of the team's biggest hitters, though, and getting downtown would shave the amount of time he could spend fighting.\nHer first instinct, though, had been to call Steve or Bucky. These days, when the chips were down, they were the people she thought of.\nSlowly, she put her phone back in her purse. She wanted to pretend it was an act of bravery, an attempt to sacrifice herself to save the city. But what stayed her finger was one question: would they even come for her?\nThere was an explosion overhead, knocking her out of her indecision. With a scream, she curled herself up on the ground, arms wrapped over her head. A piece of stone clipped her back, and she felt something sharp slice down her forearm.\nOnce the rubble had settled around her, Darcy slowly sat up. Her bags had been smothered, but there were only a few pieces of stone and plaster covering her. Her heart was pounding, she was covered in dust, and there was something warm and sticky on her left arm. She didn't let herself look down at it. Instead, her gaze settled on a metal pipe that had landed beside her. It was slightly longer than a baseball bat and just thin enough that she'd able to wrap both hands around it.\nDarcy didn't have any backup, but she wasn't going to die hiding. She had once tazed a thunder god-- this robot wasn't going to scare her now.\nLeaving her ruined bags behind, Darcy scrambled to her feet and picked up the pipe. The weight made the pain in her left arm throb, but she ignored it. The robot was already a few yards past her, but she jogged to catch up to it.\n\"Hey, asshole,\" Darcy called, voice harsh from breathing in dust. \"Do you know how much money I spent on those freaking cannoli?\"\nThe robot spun to face her, and she swung the pipe as hard as she could at its face. It connected with a loud clang, and the reverberation nearly made her drop the pipe. She had left a nice dent in the robot's head, though, and her satisfaction outweighed the pain.\nThe robot lifted its arm to point its off-brand repulsor at her face, so she swung her makeshift bat at its hand, managing to knock it sideways just enough that the burst of energy flew past her head.\nBefore she had time to react, the robot backhanded her with its other arm, sending her tumbling across the street. The concrete scraped the side of her leg as she came to a stop, and she gritted her teeth to hold in a scream.\nPushing her hair out of her face, she moved to get back on her feet when she saw the robot bearing down on her, hand aimed at her head. Her weapon had fallen out of her grasp at some point, and she was left with nothing but grit and stubbornness.\nDarcy had been in life-threatening situations before, but she had never stared death in the face quite this close before.\nFunny. Darcy had imagined herself dying in so many ways since Thor had crash-landed on Earth. She had thought that pretty much every variation had been covered in some nightmare or other.\nBut she had never really imagined that she would die alone.\nDarcy tried to push herself to her feet anyway, though she had no time to run, but her injured arm collapsed underneath her, sending her back into the pavement. She could hear the repulsor beam heating up, and she closed her eyes.\nThere was a soft thud, a hiss of sparks, and then a loud crash. Darcy glanced over, still wincing in anticipation, and found the robot collapsed on the ground in front of her. The light in its eyes dimmed as she watched, leaving it looking like a broken toy.\n“Darcy?”\nShe coughed and looked up to find Bucky jogging toward her, shouldering a rifle as he went. He was dressed in his usual black battle gear, with his silver arm on display and rows of knife and gun holsters scattered around his torso and legs, but the look on his face was pure vulnerability. He knelt beside her, hands hovering over her, not quite touching, as he scanned her body for injuries. “Are you okay?”\nWith his help, Darcy managed to sit up. “I’m alive,” she said, voice hoarse. “That’s better than I thought I’d be right now.”\nBucky looked shaken. “It was close.”\n“I’m okay,” she assured him, and then looked down to assess the damage. Her arm was covered in dust and blood, and her left leg was partially scraped raw. With the immediate threat gone, her entire body throbbed to remind her that everything hurt. “I could use a doctor, though.” Suddenly, his presence really clicked with her, and she frowned at him. “Shouldn’t you be off saving the city?”\n“Tony was figuring out a way to remotely shut them all down, so it shouldn’t be long now. JARVIS told us that your signal was down here, so I left Steve to lead the crew and had Thor drop me off nearby on his way to help out near the Freedom Tower.\"\n“They didn’t need your help?”\nBucky brushed a strand of hair away from her face with a gloved hand. “I had to make sure you were safe. When your phone signal went out, JARVIS lost track of you. I was worried I wouldn’t make it in time.” He glanced over at the bent pipe lying nearby. “Looks like you were taking care of yourself all right. Next time, though, do me a favor and try running until we get here. Leave this sort of thing to the professionals.”\n“I didn’t think you were coming,” Darcy said defensively, and wanted to take back the words immediately when she saw Bucky’s expression. It was like she had punched him in the stomach and then shot Old Yeller.\n“Of course I was coming,” Bucky said. “I will always come for you.\"\nDarcy smiled like she had known that all along. “Right. No man left behind.”\nBucky’s expression didn’t change. “Because I can’t imagine this century without you.”\nIf she felt surprised by his declaration, it was nothing compared to being suddenly swept into his arms and kissed thoroughly. Her mouth was coated in dust and she couldn’t move her left arm, but her heart leapt into action like it was the best kiss she’d ever had. What really overwhelmed her was not how passionate his lips were on hers, but how gentle his arms were around her. Like she was something to be cherished. She closed her eyes, enjoying the embrace and kiss. If every near-death experience could end like this, maybe she wouldn’t be so terrified of them.\nWhen he pulled back, she looked at the dust she had tracked through his hair and the unbearable tenderness in his eyes. She really hoped this wasn’t a panic-induced hallucination. “I…. But you….”\nHis cheeks were a bit red, which was an interesting contrast to all of the weapons. “Sorry. I know you’re not interested, but God, Darce, we almost lost you. I just….”\n“Not interested?” Darcy repeated incredulously. “You think I’m not interested?”\n“You said you didn’t even want to talk about it,” Bucky pointed out.\n“Yeah, but—,\" she said, trying to make an annoyed gesture, but she nearly bit her tongue when the movement jostled her arm.\nBucky’s embarrassment turned back to concern. “We need to get you to a doctor.” He gathered her up in his arms like she weighed nothing, careful not to bump against her injuries. He pressed a dry kiss to her forehead. “We’ll talk about this later.”\n——\nWith SHIELD medical gone with the rest of the organization, Tony kept a staff of doctors on call for the Tower so none of them had to go to hospitals. Not only did it make them all more comfortable, but local hospitals didn’t have to try to figure out how to wrangle a half-dozen superheroes. Darcy had hated hospitals since she was a kid visiting an aunt in an isolated cancer ward, so she didn’t complain about the special treatment. Bruce, as official Avenger-doctor liaison, had kicked the rest of the team out of the room while Darcy was being patched up. They had all wanted to make sure she was all right, since she was the only serious injury their group had suffered during the fight, but their hovering had been driving the doctors crazy. Jane in particular had been completely panicked, and only Thor’s hand on her back had managed to get her out of the room.\nAs much as she appreciated the quiet with them gone, it left her with nothing to distract her from the doctor stitching up her arm. Having her leg cleaned had been brutal enough, but now she was just tired and wanted it to be over.\n“I change my mind,” she declared. “Knock me out.”\nBruce smiled gently, his hand resting on her uninjured arm. “It’ll only take a few more minutes. Do you need more local anesthetic?”\nShe shook her head, careful not to move her arm as the doctor worked. “I can’t feel it. I just can’t watch anymore.” Even as she said that, she looked back down. The doctor’s work was meticulous, but she could have happily lived her life without seeing her inner flesh.\n“Then look at me,” Bruce said. She met his eyes, though they were slightly obscured by his glasses. He was fresh off a Hulk transformation, which left him looking tired and quiet. “I’m glad you’re okay,” he told her. “Everyone was really worried.”\n“Yeah, I didn’t realize they'd all be so upset,” she admitted.\n“There was almost a fistfight over who was going to get to go find you. I think Sam would have won if Steve hadn’t made the executive decision. Even though Bucky got to you as fast as he could, Steve still looked pretty furious when they were talking about it on the way back.\"\nDarcy flinched. Maybe Bucky had told Steve about their kiss.\nBruce continued, “The Avengers are big fans of Darcy Lewis, you know. Don't know what we'd do without our PR manager. Even JARVIS seemed concerned.\"\nDarcy grinned up at the ceiling. \"Aw, JARVIS, were you worried about me?\"\n\"I do not 'worry,' Miss Lewis,\" JARVIS replied, \"but the Tower would be emptier without your presence. Literally speaking, of course.\"\n\"Love you too, JARVIS,\" she said.\n\"All done,\" the doctor said, beginning to pack up his tools. Darcy risked another glance at her arm. The stitches had been done mostly internally, but the line of the wound was still obvious. \"Just keep everything clean and let me know if you have any problems.\"\n\"Thanks, doc,\" she said. \"And thanks, Bruce. For staying with me.\"\nBruce gave her a conspiratorial grin as they headed for the door. \"You were probably the easiest patient we've ever had. I've never met a group of people so adverse to having life-threatening injuries tended to than this team.\"\nOnce she got back to her floor, Darcy made a beeline for her bed. Part of her expected to not be able to sleep, since it was mid-afternoon and she had just had to fight off a giant robot, but she was out as soon as her head hit the pillow.\n----\nWhen Darcy woke up, it was the next morning. She bolted out of bed when she saw the clock, wincing when her arm twinged, but JARVIS interrupted her mad rush toward her closet. \"Good morning, Miss Lewis. Miss Potts requested that I tell you that you have been instructed to take the day off.\"\nDarcy shook her head. \"It's only my second week. I can do it,\" he said.\n\"I believe her exact words were, 'If Darcy shows up at the office today, I'm calling in Steve to carry her straight back home.' So, it may be best to heed her advice.\"\nDarcy heaved a sigh and changed her trajectory, pulling sweatpants and a cozy shirt from her drawers rather than selecting a suit from her closet. \"Sounds like she doesn't take this stuff lightly.\" She changed lazily as she talked.\n\"You were injured,\" JARVIS pointed out. \"Besides, Miss Potts is used to dealing with Sir, who only responds to creative threats.\"\n\"Doesn't mean she wouldn't follow through with it, though,\" Darcy notes.\n\"Indeed.\"\nShe paused on her way to her door. \"Where are Steve and Bucky?\" she asked.\n\"On their floor,\" JARVIS replied. \"None of their locks are engaged.\"\n\"Thanks!\"\n----\nWhen she exited the elevator, she found Steve and Bucky in their kitchen, cooking breakfast together. Bucky seemed to be on French toast-duty while Steve monitored a large skillet of bacon.\nUnlike the modernity of the communal floor or the cluttered rooms that Thor and Jane inhabited, Steve and Bucky's floor was one of the homiest places she'd been in so far in the city. Everything was up-to-date, with none of the forties styles or technologies that she had half-expected, but it was more welcoming than the state-of-the-art decorations in the areas Tony controlled.\nInstead of a kitchen table, the stove was located on an island surrounded by a counter with a half-dozen tall, sturdy chairs. She figured that to survive the two genetically-enhanced soldiers, everything needed to be built solidly.\nThey both looked over at her when she entered, but didn't seem fazed by the intrusion. \"Hey, Darce. How are you feeling?\" Steve asked.\nShe shrugged, suddenly self-conscious of the fact that short-sleeved shirt left her arm was on display. \"I'm okay,\" she said, walking over to the kitchen. \"Thanks to Bucky.\"\n\"Good,\" Steve said firmly.\nDarcy hesitated at the edge of the kitchen, watching them work in tandem. They didn't bump elbows at all, despite working at the same stove, and both seemed relaxed and happy.\n\"Hope you're hungry,\" Bucky said, moving a slice of French toast to a plate already stacked high.\n\"Definitely,\" she said. \"Can I help?\"\nBucky shook his head. \"Your job is to sit there and look pretty,\" he said, gesturing to the counter in front of them.\nShe laughed. \"I don't think 'pretty' is really the look I'm rocking today.\" She hoisted herself onto the tall stool across from them, the counter keeping her away from the popping oil. On this chair, she was able to look them in the eyes. \"Is this how you guys feel all the time?\" she asked, swiveling in the chair to survey the apartment.\n\"It took me a while to get used to it,\" Steve said. \"With the serum, I jumped about eight inches in one day. I can't even tell you how many lights and doorways I hit my head on the first few months.\"\n\"Yeah, but I bet it was a lot easier to push your way through crowds when you could just see over everyone's heads,\" she pointed out.\n\"And it was easier to me to find him in crowds,\" Bucky added. \"Before, he would just get swept away. Luckily, all I had to do was follow the sounds of the fight he'd inevitably get caught up in.\"\nSteve rolled his eyes. \"Don't let him fool you. He always jumped right in too.\"\n\"Yeah, to save you!\"\nDarcy laughed, but she couldn’t get rid of the nagging tension in her shoulders. Surely they wouldn’t be acting so casual if Bucky had told Steve about the kiss. What would happen when he found out?\nOnce the French toast and bacon were piled high on each plate, Steve and Bucky took a seat on either side of Darcy, making her feel short once again. “Why don’t you guys have a kitchen table?” she asked as she poured maple syrup over her plate.\n“We never had one growing up, so it just feels too formal,” Bucky explained. “The only reason we’re not just eating on the couch now is because syrup is a bitch to clean up. On that note, I can’t believe you just poured it all over the bacon. You really are a heathen.”\nDarcy smirked and picked up a syrup-soaked piece of bacon. “Syrup makes everything taste better. Don’t hate.” She happily took a bite. “God, I’m hungry. I haven’t eaten since before the...incident yesterday.\"\nEven without mentioning the robot by name, the easy atmosphere grew tense at her words. “I’m glad you’re okay,” Steve told her softly.\nBucky, meanwhile, shook his head. “She shouldn’t have gotten as hurt as she did. God, Darce, what were you even doing that far downtown?”\nShe turned to raise her eyebrows at Bucky. Her cozy spot sitting between them suddenly felt a bit like a trap. “First of all, I’m pretty sure it’s not a crime for me to leave the Tower. Second, I was in Staten Island and the Financial District in the middle of the afternoon. Even if we’d known there was going to be a freaking robot invasion, I wasn’t in an unsafe part of town.”\n“That’s not what he meant,” Steve said. “Also, Staten Island? That’s just bad taste.”\nDarcy rolled her eyes. “Trust me, I’ll avoid that ferry as much as I can. I was kind of checking out this bakery down there for you guys, though. Best cannolis in America, apparently. Or ‘cannoli,’ whatever.\"\nA grin spread over Steve’s face. “You bought us cannoli?”\n“Well, I was planning on eating some too. The box got smashed by that dumb robot, so we can all be disappointed.”\nSteve looked over her head at Bucky. “She went all the way to Staten Island to buy us cannoli. You were right.”\n“Right about what?” Darcy asked, frowning.\n“I think we need to actually have that talk we didn’t have at the Met,” Steve said.\nDarcy gulped and set down the fork that was halfway to her mouth. “Okay.”\n“And you say I have bad timing,” Bucky said.\n“So I guess Bucky told you about…”\n“The kiss?” Steve confirmed. “Yeah, he did.”\nHis expression was hard to read. “And…?”\n“And I was mad at him.” Darcy flinched, but Steve kept talking, “You had said you wanted things to stay the way they were, and he ignored that. When he said that you weren’t upset, though, I realized maybe we hadn’t been clear about how we felt. Darce, in case you didn’t notice, we’re both pretty much in love with you.”\n“But you said you weren’t looking for someone else!”\n“That doesn’t mean we didn’t find them,” Bucky said.\nSteve nodded. “Bucky and I are still, well, me and Bucky. We always will be. We’d just like you to be there with us.”\nDarcy tried to wrap her brain around that. “Romantically,” she confirmed.\n“And sexually,” Bucky added. “If you’re up for it.\"\n“You’re sure?” she asked, moving her head back and forth to look at both of them.\n“Yes,” Steve said.\n“You’re not trying to talk us out of it, are you?” Bucky asked.\n“Nope,” Darcy said. “Just wanted to make sure I was allowed to do this.” She slid a hand to the back of Steve’s neck and tugged him toward her. He followed her direction easily, blue eyes flickering closed as their lips pressed together. It was a sweet, chaste kiss, more of an introduction than a seduction, but Darcy still parted beaming. “Just to even the score.”\n“Knowing Bucky, I’m guessing your kiss with him was much less tame,” Steve pointed out before capturing her lips again. This time, he moved with purpose, leaving her clutching at the back of his neck and panting. His lips were thinner than Bucky’s, but just as satisfying. Though she knew he wasn’t as innocent as propaganda made him out to be, his tongue was downright sinful. A hand ran through her hair, and she moaned when she realized it belonged to Bucky. With Steve in front of her and Bucky behind her, she was already starting to get swept away by the sensations.\nSteve moved his attention to her neck. She tilted her head and leaned into him so much that she nearly fell off the stool. “Oof,” she said as Steve steadied her. He kept one hand on her upper thigh to keep her balanced, and it was nearly as distracting as Bucky’s hand playing with her hair. “That was…. Okay, so how do your old-timey sensibilities fit in here? Do we have to wait to have sex or can we head to the bedroom right now?”\n“Your arm has ten stitches and your leg is covered in bandages,” Steve pointed out.\n“…Is that a no?”\nA slow smile tugged at the corner of Steve’s mouth. “It just means we need to be careful. Left arm and left leg, right?”\nDarcy nodded and then yelped when Steve scooped her off the stool into his arms. Once she got over her surprise, she burst out laughing, slinging her right arm over his wide shoulders as he walked her into the bedroom.\nThe most notable feature of the room was the bed, which was at least king-sized and covered in soft pillows. The dark blue comforter looked equally lush and cozy though it was, to her surprise, strewn haphazardly across the length of the bed. When Steve set her down on top, she asked, \"What happened to soldiers who make their beds crisp enough to bounce a coin off of?\"\nSteve raised his eyebrows. \"Our bed never stays made for long anyway,\" he told her before leaning down to kiss her. She was stretched out on the bed, and he held himself up easily over her.\n\"As much as I'm enjoying the show, I'm feeling a bit left out,\" Bucky said. The bed dipped as he sat down beside them.\nDarcy looked over at him as Steve moved his attention to her neck and collarbone. \"Well, you're looking pretty overdressed. Maybe you could work on taking that all off?\"\nBucky took the challenge to heart. He stripped efficiently, but his gaze stayed locked on her and made her heartbeat pick up. He was scarred around his silver arm, but her gaze lingered more on the definition of his abs. There was a black line of text across one pec, and Darcy squinted to read it. When she was able to make it out, she huffed out a sigh. \"Jesus fucking Christ,\" she said with feeling.\n\"What?\" Steve asked, moving from where he was sucking a hickey onto the base of her neck.\n\"Not you, you keep doing what you're doing,\" Darcy told Steve before looking back at Bucky. \"Please tell me those weren't my first words.\"\nHe followed her gaze to his chest and then laughed. \"They were. You turned out even more fiery than expected,\" he said.\nShe ran her hand from Steve's neck to her hair and asked, \"I didn't even think about it. Steve, what were mine to you?\"\nSteve chuckled against her skin before he and Bucky answered together, \"I will give you eight dollars and my firstborn if you let me have some of that.\"\n\"Fuck,\" Darcy said, letting her fall back on her pillow. \"I'm an idiot.\"\n\"If you are, you're not the only one,\" Steve said.\nShe frowned when he sat back, but was satisfied when he used the space to pull off his shirt. He twisted sideways, showing her the soulmark that ran up his ribs. \"So, what, do you like being beaten to a pulp or something?\" she read, tracing the text with a finger. Steve's shivered slightly at her touch.\n\"And his answer was, 'I didn't ask for your help,'\" Bucky said, coming over to the bed. He was stripped down to his boxers. Putting a foot on the bed, he showed her the line of text that circled his ankle.\n\"So what I'm hearing here is that the 'nice rack' thing wasn't exactly out of the norm for you,\" Darcy said. She tested out running a finger around Bucky's ankle to see if he had the same response Steve did. She was disappointed when he didn't shudder, but his expression grew satisfactorily more heated.\nBucky nodded. \"I'm still sorry about it. Besides, Steve rejecting you off-hand wasn't unusual either. Luckily, he wises up if you stick around and nag him long enough.\"\nDarcy sat up so she could brush her lips across Steve's again. He was still kneeling over her thighs, a leg on either side of her. \"Is that what I did? Nagged you until you caved?\"\nSteve looked slightly dazed as he glanced down at her lips. \"Something like that,\" he said.\n\"What about you?\" she asked Bucky. \"You just like having someone who needs taking care of?\"\nShe was teasing, but he answered seriously. \"Nah. I need someone who's willing to fight off a giant robot with a pipe. Now come over here.\"\nWithout dislodging Steve from her lap, Darcy turned so she could kiss Bucky. Their first kiss had been desperate, fueled by adrenaline and relief. Now, Bucky took his time, the slide of his lips and the drag of his tongue making her light-headed. Steve ran his hands up and down her sides, alternating between light, teasing pressure and firm groping. After a few minutes, Steve grabbed the hem of her shirt and lifted it up, breaking her kiss with Bucky for a brief moment to pull it all the way off.\nTaking immediate advantage of the new skin on display, Bucky gently nudged her shoulders until she was lying back on the bed, and then knelt beside her and kissed down her chest.\nMeanwhile Steve, apparently on a mission to remove all her clothing, had shifted down her body to slide down her loose yoga pants. She tilted her head so she could glance down the length of her body, with Bucky's hands and lips roaming her torso while Steve removed her pants and tossed them from the bed. Catching her gaze, Steve said, \"You good?\"\nShe nodded and then let her head fall back onto the comforter. \"So good,\" she said.\nOver the course of the next several hours, Darcy learned some very useful lessons. First of all, with super-soldier serum in the mix, ladies weren't the only people capable of multiple orgasms. Secondly, Steve could hold his breath for more than five minutes, and Bucky could nearly do the same. Third, when Steve was the center of attention, he blushed from head to navel, but never hesitated in requesting what he wanted.\nBy the end, Darcy felt like she'd been hit by a truck. Two trucks. Two sexy, sexy trucks.\n\"You're rambling,\" Bucky muttered against her skin. He was laying diagonally across the bed, head resting on her stomach.\n\"I think you guys broke my higher brain functions,\" Darcy said with a pleased smile.\nSteve, who was wrapped tight around her right side with a hand in Bucky's hair, pressed a kiss to her temple. “That’s a good thing, right?”\n“Such a good thing,” Darcy agreed. “But, if you guys don’t mind, I’m going to fall asleep now, okay? I’m kind of worn out.”\nShe felt Bucky nod against her stomach. “We’ll be here when you wake up,” he said.\nSo, with Steve on one side and Bucky on the other, Darcy sighed deeply and closed her eyes.\n-----\nThe next press announcement Darcy wrote was the first to include her by name. The short article in People was simply titled: Meant to Be.\nDarcy, Steve, and Bucky knew that that was just a PR spin. The truth was, in the end, they had chosen each other. It was that bond that Darcy trusted, not the words written on her skin. She may not have believed in fate, but she believed in Steve Rogers and Bucky Barnes."
}