{
    "id": "2272167",
    "url": "https://archiveofourown.org/works/2272167?view_full_work=true",
    "author": [
        "theroguesgambit"
    ],
    "title": "(not so) Pure Imagination",
    "rating": "Explicit",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski",
        "minor background relationships - Relationship"
    ],
    "characters": [
        "Derek Hale",
        "Stiles Stilinski",
        "Vernon Boyd",
        "Erica Reyes",
        "Scott McCall",
        "The McCall Pack"
    ],
    "additional_tags": [
        "Shared fantasies",
        "slight dubcon themes",
        "Anonymous Sex",
        "with feelings!",
        "Angst",
        "Alternate Universe",
        "but still mostly canon",
        "Emotional Hurt/Comfort",
        "Insecurity",
        "Pining"
    ],
    "language": "English",
    "series": "Part 1 of Object and a Dream",
    "published": "2014-09-08",
    "completed": "2014-11-09",
    "words": "33,184",
    "chapters": "11/11",
    "comments": "1,057",
    "kudos": "18,505",
    "bookmarks": "5,334",
    "hits": "246,334",
    "summary": "<p>\"There is a world where whenever someone fantasizes about you, you can physically feel it, but you have no idea who is thinking it about you.\"</p>\n<p>Stiles knows it's wrong, but he's been Fantasizing about Derek and he can't bring himself to stop. Derek doesn't know who's taken an interest in him, but he's enjoying it way more than he probably should.</p>\n<p>warnings for self-harm in this chapter.</p>",
    "notes": "<p>Thanks to everyone who's already encouraged and supported me on this drabble series over on <a href=\"https://halekingsourwolf.tumblr.com\" rel=\"nofollow\">Tumblr</a>.</p>\n<p>The original prompt comes from the wonderful <a href=\"https://sterekismydrugofchoice.tumblr.com\" rel=\"nofollow\">sterekismydrugofchoice</a>.</p>\n<p>Read the <a href=\"http://ficbook.net/readfic/2833554\" rel=\"nofollow\">Russian Translation</a> by Risu-kii</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>The first word Helen Keller understood was \"water,\" which is why shower sex after teaching Derek the tapping system might be an inappropriate reference.</p>\n<p>This chapter's a little rough guys, sorry. The version I had up on Tumblr was a mess... hopefully I cleaned it up enough now. Let me know what you think. &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>And that's the end of the main arc, darlings! More side stories in the same universe might be on the way at some point, so keep your eyes open. </p>\n<p>Thank you so much for all your feedback, your patience and encouragement. I hope you enjoyed this last piece. &lt;3</p>\n<p> <a href=\"https://halekingsourwolf.tumblr.com\" rel=\"nofollow\">Come find me on Tumblr</a></p>\n<p><strong>ON WRITING IN THIS VERSE</strong><br>If you want to write a story based on the concept of shared Fantasies, be it a Teen Wolf fic, Sterek fic, or something from another fandom entirely, please do!! Just list this story as an inspiration (on AO3 you can select an option saying your work was inspired by another piece when you're posting), and maybe drop me a line to let me know so I can check out your work!</p>",
    "text": "\nI\n\nThe feeling slips over him three, sometimes four times a day now. Lying in bed, usually well after he’s gone to sleep, he’ll find himself being dragged back toward consciousness by slow, sliding touches across his skin. It’s not that bad at night. It’s… fuck, it’s a wet dream. Of course it’s not bad. The pressure of another body pressing against him, warm lips dancing across his neck and chest.\nThis isn’t a new thing, for him. Fantasies have been doted on Derek since he was old enough to understand what they were - stray sparks of them shooting through him in grocery stores, on the street, even in classes back in high school. He’d only known that Paige was interested him in the first place because the Fantasy he’d started experiencing after meeting her had carried the distinctive rosin-and-brass scent of the practice room.\nDerek knows perfectly what he looks like, and he’s gotten used to being an Object. At this point it’s more of a hassle, honestly, than anything. But in the past few years they had always been quick, passing things, fleeting flashes of heat, here and gone just as quickly in the bustling, distracted way of big city life. Since moving back to Beacon Hills, though, things have intensified. Derek has no idea whose interest he’s caught, but clearly small towns make for big imaginations.\nThe midnight Fantasies are almost always slow, deliberate things, hot and heavy kissing that goes on for minutes at a time, hands that trace teasingly over the lines and angles of his body, leaving him writhing for friction he won’t find.\nThe flashes don’t just happen at night, though. Sometimes in the morning - in the shower, Derek thinks, if the wet slide of the phantom body against him is anything to go by. In the mornings it tends to be quicker, rougher, and Derek has started scheduling his morning runs for an hour later than he used to, ever since the time he’d found himself sinking down against a tree in the middle of the preserve, trembling at the sensation of a hot mouth sliding over his cock. A passing dog walker had looked scandalized, then sympathetic, tutting about a lack of consideration.\nThe thing is, Derek should be scandalized too. There aren’t exactly laws against the policing of Fantasies - there had been riots about 30 years back when the subject had first been raised, talk of Big Brother and mind police and other things that had gotten the subject dropped before it had even been seriously considered - but it’s a common courtesy in most circles to cut off your Fantasies before they get too intense. Only the very young, the people who haven’t had much experience with being an Object firsthand, allow themselves to fall into drawn out daydreams like the ones Derek is experiencing.\nHe should probably be annoyed. It’s inconsiderate, is what it is.\nHe finds himself looking forward to them, instead.\nOf course, there are times that they’re incredibly inconvenient. The ones he can’t anticipate, can’t plan ahead for. The ones that take place in the middle of the day when he’s out grocery shopping or training with the pack or, god forbid, near Peter. Whoever has fixated on him clearly has an easily wandering mind.\nAnd the Fantasies during the day tend to be the most intense.\nA body pressed flush against him, his own hands gripping wrists that twist and writhe without any true intent to escape. Biting kisses, his own lips bruising with the pressure as they rake across a long plain of exposed flesh. Naked cocks grind slickly together, setting the body against him shuddering. He frees one hand just to have it grasp at his hair, tug sharply. There are sounds vibrating out of that throat, but Derek can’t hear them. He wants to. Wants to hear what he’s doing. He wants that voice screaming his name…\nStiles drops the pen he’d been fiddling with and the clatter knocks Derek straight out of the Fantasy. He pushes himself too hard from his place against the wall, and Scott stops to stare at him. He’d been explaining the territory lines he’d recently drawn out with another pack from Beacon County when the Fantasy hit. Stiles looks up from the map he’s been staring at intently, Erica and Boyd glancing up from their place on the couch. The entire group is suddenly staring at Derek. He feels himself flush, hand going reflexively to his mouth as though to wipe away evidence of a kiss that never happened.\nErica catches on first, leering, and Derek’s best warning glare doesn’t do a thing to stop her from grinning wide and announcing “ooh, look who’s lost himself in a Fantasy. Most of us know how to shrug those off, Derek. Unless you were enjoying it?”\nMost everyone just rolls their eyes. Stiles, possibly the least experienced at all of them in this area - he constantly complains about how unfair it is that he has to know just how little interest he generates - flushes and looks away.\nDerek just scowls at the lot of them, turns on his heel, and stalks into the kitchen.\nAs soon as he’s out of sight, he can’t help pressing his forehead against the refrigerator and reliving the last few seconds of the Fantasy. The taste of that neck against his tongue, long fingers gripping in his hair, urging him on as their sweat-slicked bodies ground together.\nIn the living room, Stiles flushes, dropping the pen again.\n\nII\n\nStiles can’t think straight for the rest of the day. The unexpected sensation of Derek’s mouth – because there was no doubt it had been Derek’s mouth, the phantom touch lining up too well with his own Fantasy from minutes earlier – on Stiles’ throat, the hot flash of pure want leaving him reeling for the rest of the meeting.\nHe’d gone tense when Derek had come back into the room, watching him out of the corner of his eye and waiting for some kind of acknowledgement, because Derek had Fantasized about him, that must mean something, right? But Derek had just offered a warning scowl to the group at large, and Scott had cleared his throat, drawing everyone’s focus back to the treaty with the pack from Beacon Heights.\nAnd Stiles didn’t hear a word of it.\nHe’s never exactly… been an Object of a Fantasy before. Not really. Sure, there’s been the occasional hot flash or a phantom sensation of having his ass pinched (not fun, especially when he’s out at the supermarket, surrounded by people three times his age). But that’s all quick stuff, fleeting, easily ignored. He’d never realized how intense it would be to have someone focus all their attention and desire on you, that the feel of the mouth on him would be so realistic he’d have to touch his neck, searching for saliva and bruising.\nEventually he finds himself staring openly at Derek, earns an exasperated eye roll for his trouble. It isn’t until everything’s wrapped up, though, when Derek passes him by and pauses just long enough to mutter “you go to high school. Have you seriously never seen someone act as an Object before?” that Stiles realizes that Derek hadn’t been Fantasizing about him, not really.\nOr at least… he didn’t realize he had been.\nThat night, Stiles lies in bed staring at the ceiling, his fingers drifting over his bare abdomen. At this point, any other night, he’d be imagining Derek’s fingers on him. Imagining sliding his tongue along Derek’s perfect abs. Teasing himself slowly, dreaming of everything he’d never get to have. But tonight…\nIt’s not like Stiles hasn’t been to Sex Ed. He’d sat through the lectures on Fantasies, Objects, and proper etiquette regarding boundaries on imagination: “Of course, you’ll probably find yourself having healthy urges at this age, but it’s encouraged that you dote your fantasies upon fictional characters – not the actors that portray them – or constructs of your own imagination.”\nBut… how seriously did people take those rules, anyway? People talked about being Objects all the time, it was a source of pride around school. People like Jackson bragged constantly about how many times a day they felt a Fantasy creeping over them. Just yesterday, Stiles would’ve killed (or at least maimed) to be able to claim he’d been the Object of someone’s Fantasy. It was a compliment.\nAnd besides, how could he be expected to get off imagining anything else when he had Derek showing up all the time, muscled and brooding and bitingly sarcastic, pushing Stiles up against walls whenever he thought he needed to emphasize a point?\nSo yeah, Stiles had broken the unwritten rules. He’d Fantasized. He’d indulged in it. But after today, after seeing Derek flush-cheeked and embarrassed in the middle of a pack meeting, after feeling the heat of it himself (he didn’t know how none of the werewolves had picked up on it: the sudden flush, the uncontrollable burst of arousal. Thank god for Scott’s one-track mind and the other betas’ general dismissive attitude toward anything Stiles-related. They must’ve gotten that from their Alpha).\nAfter knowing what it felt like, what he was really doing…\nHe drops his hand back to his side, and drifts into a miserable slumber.\n.-\nDerek wakes up slowly, drowsy and confused when his clock reads 12:08… and there’s no sensation of hands on him. A few (weeks’ worth of) dreams and he’s been conditioned to wake up in the middle of the night expecting them.\nIt’s pathetic. He should be grateful for the reprieve.\nHe lies awake for a long time, staring at the ceiling, too restless to fall back to sleep.\n.-\nNothing comes in the morning either and Derek finds himself prowling the loft, snarling and restless, until Erica sweetly suggests he do something to work off his pent up energy. He shoves her out the door, suggesting she run fast so she doesn’t miss homeroom.\nHe doesn’t notice his keys are gone until he hears the Camaro screaming out of the lot a minute later. He can’t focus enough to be mad at her.\nIt’s fine. It’s good that the Fantasies aren’t coming. Maybe the Dreamer has found some other poor soul to fixate on.\nDerek stalks outside and spends the whole morning running himself to exhaustion.\n.-\nThree days without more than the barest flash of a Fantasy, and all of his betas are on edge. Erica’s been prowling around the loft, scowling in a way it takes Derek too long to realize reminds him of himself. Isaac has started spending all his time (what little he hadn’t been, already) at Scott’s, and Boyd… Boyd had paused on his way out the door this morning, put a hand on Derek’s shoulder and said: “I don’t know what’s wrong but whatever it is, fix it.”\nIt’s all so stupid, and that’s what finally decides things for Derek. It’s stupid that he’s getting so worked up over something so intangible. That he’s wasting time waiting for someone he doesn’t even know to have a Fantasy about him. It’s pathetic. He’s gotten too dependent on this mystery Dreamer for satisfaction. Maybe it’s been a while, but he can still do this on his own.\nWhich is how he finds himself sinking back onto his mattress at 10:30 on a Thursday morning, sliding his eyes shut and trailing a hand down his stomach.\nAt first he doesn’t picture much of anything. Constructed characters have never held much appeal for him – he doesn’t have the imagination to make them lifelike enough to satisfy him – and he’d been conditioned for obvious reasons not to imagine anyone real. So he lets his mind drift, focuses on the sensation as he plays fingers along his nipples, ducks a hand under his boxer briefs to trail over his half-hard length.\nIt’s not enough.\n\n…Soft lips trailing along his collar. His own mouth dipping to bite, rough, against a pebbled nipple. A lithe body arching into the touch, grinding just so—\n\nDerek jerks himself out of it, breathing hard, face flushed.\nHe’d slipped into a Fantasy without meaning to. Damn it.\nThen again… Derek hadn’t actually been picturing anyone. The lithe body, the soft lips, they’re more or less the traits of his former Dreamer, but Derek has no idea who that is. He doesn’t have a name, a face. It’s like a constructed character, really: an imaginary figure that only exists to give Derek pleasure. You can’t actually Fantasize about someone you don’t know, right?\nSo really, it’s the ideal solution for a less creative mind.\nSatisfied with his own loophole, he slides his eyes shut again and allows himself to sink back into the Fantasy of his Dreamer.\n.-\nStiles starts violently, nearly falling out of his chair.\n\nA hot mouth kisses across his chest, teeth dragging playfully over one nipple before dipping lower. Strong hands pin him in place as his body writhes and squirms against the biting kisses, the wicked tongue. His fingers bury themselves in tufts of short, thick hair, tugging, urging the head down lower, leading those sweet lips where he really needs them to go…\n\nA distant snicker drags him back to reality, and Stiles swallows down a wrecked whimper even as the math classroom swims back into focus. The whole class is staring, Scott managing to look worried, sympathetic, and slightly disturbed at the same time.\nAt the back of his mind, the Fantasy’s shifting - a body pressed up against his bare back, muscled arms wrapping around him and holding him close as a rock hard heat grinds slowly into his—\nThere’s a rushing in his ears and his next breath comes out too loud. His vision slides out of focus, hands fisting against the edges of his desk and he almost thinks screw it and slides his eyes shut again because he knows that body, damn it. He’s stolen glances at it enough times during the wolves’ training, he’s imagined it doing exactly this more than once and it’s Derek, Derek’s Fantasizing about him, and he can’t—\n“Mr. Stilinski,” his teacher says with the slightly put upon tone of one wondering why she’d ever decided to take up teaching high schoolers. “You’re excused for as long as necessary. Please make your way to the nurse’s office.”\nStiles doesn’t have to be told twice, bolting out of his seat and moving as quickly as he can manage with the sensation of Derek’s cock grinding into his ass. Even as he shoves his way out into the hall he hears Jackson scoffing: “No way someone’s that hot for Stilinski. It’s probably just something he ate.“\nStiles has no intention of going to the nurse’s office, manages to get as far as the bathroom. He falls against the wall, pressing his cheek against the cool tiles, shivers breaking out over his skin as a hot mouth moves over his nape, biting into his shoulder, the sweat-slick body pounding a fast rhythm into his ass and it’s real, it’s so much more real than any of his own fantasies, clearly coming from someone with actual life experience and not just a vivid imagination to back him up.\nHe collapses against the sink, biting into his own arm to keep from shouting, free hand going to his pants, taking three tries to work the button loose he’s shaking so damn hard. He hardly needs the stimulation, the Fantasy enough, the thought of Derek more than enough, and a few seconds later he’s shuddering, whimpering and spent, alone in the cold bathroom.\n\nIII\n\n\n\nLong legs grip his thighs, grinding against him in a sharp, desperate rhythm.\n\nIt’s like something has broken loose inside of Derek.\n\nHands fisting into his hair, taut forearms caging his face as his mouth is assaulted with hungry, bruising kisses.\n\nNow that he’s torn down that barrier in his own mind, found himself an Object worth fantasizing about, he can’t make himself stop. Long fingers are gripping his nape, a lithe body surging against him as he washes the morning’s dishes. Those same fingers trace down his thighs, soft, slow kisses peppering his throat so sweetly as he tries (and fails) to focus on reading, and a brutal workout just leaves him thinking about corded muscle undulating under his hands, body sweat-slick and desperate.\nChrist, he needs to get laid.\nSometimes he thinks the sensations might not all be coming from him. Sometimes the hands slip over him unexpectedly, hot breath against his ear seeming too real. But after three days without having been dragged into a Fantasy, Derek can’t imagine his Dreamer so suddenly becoming interested again. It’s too big a coincidence. It’s just his imagination running out of control.\nOf course, it’s right when Boyd and Erica get back from school that the full Fantasy hits him.\nHe nearly crumples from the force of it, the hot body against his front, one hand braced against what feels like cool tile and the other wrapped around a tremoring abdomen, his rock-hard cock grinding into a sweet, tight ass. His mouth tingling with the force of too-real phantom pressure as he feels himself pressing biting kisses into an arching neck. His hand slides up to catch at the throat, pressing just enough to feel the way the breaths shudder, the desperate moans being torn out of the man in front of him.\nErica’s grabbing her bag from where she’d just dropped it by the door, snatching something else from the table – keys, Derek realizes later, his keys – and announcing that she doesn’t need this, she’ll be gone for the rest of the afternoon. Boyd’s faces morphs into something a little more sympathetic but he’s backing up too, and Derek can’t bring himself to care because long fingers have reached back to grip his hair, body twisting and dragging his mouth into a frantic kiss. His hand has found itself on a hot, throbbing cock. Not his own, his own still grinding out a desperate rhythm into the other man’s ass, and Derek is collapsing against the table, the hard wood splintering under his grip. It’s been so long. It’s been too long.\nHe’s missed this.\nThere’s no doubt in his mind that it’s the same Dreamer. The feel of the body is the same, fitting so perfectly against him. The way the fingers tangle into his hair, the softness of those lips and the length of the neck…\nHe shouldn’t have missed it. He should have been relieved when it was gone. He’d just been completely embarrassed in front of his Betas, and he can’t even think about it because he’s too lost in sensation like a desperate, needy… teenager.\nThe mouth is pressed against his cheek, kissing out a strange, sloppy rhythm that it takes Derek too long to realize is a word, a two syllable word that could be anything but Derek knows, he knows it’s his name. He feels himself mouth something back, feels his own lips shift to drag it into the other man’s jaw. A two syllable word. The Dreamer’s name. He can’t for the life of him tell what it is. \nHe collapses onto his bed with come cooling across his belly, and lies there for a long time after the Fantasy’s over. It takes him too long to realize that it was an echo of the same daydream Derek had conjured up that morning.\nWhich means that the Dreamer had felt it. Derek had Fantasized, had inflicted that Fantasy on another person without permission, without even knowing who they were.\nAnd apparently they had loved it enough to Fantasize it straight back at the first opportunity.\nFuck, what had he dragged himself into?\n.-\nOver the next day, Derek waits for his Dreamer to approach him about it. They know who he is, after all. They know Derek had Fantasized about them. It’s practically an invitation to approach him.\nAnd how will he respond if they do? Should he berate them for invading his privacy like that? Should he admit (it’s so obvious) that he’d enjoyed it? Should he just haul them up against the nearest hard surface and act out some of those Fantasies in reality?\nEvery time someone’s eyes fall on him on the street, Derek wonders if it’s the Dreamer. He spends two hours at the Laundromat buzzing with tension, breath catching until black spots enter his vision when someone finally approaches him with a look of intent… only to be asked politely to move; he’s leaning against their dryer.\nHe feels flickers of Fantasies throughout the day, but they’re vague, quick, half-formed things; nothing with the overwhelming intensity of yesterday. He can’t be sure if they’re coming from the same Dreamer or someone else entirely. By the time he gets back to the loft he’s aching from holding himself so stiffly, from constantly being on alert for a real or imaginary bombardment.\nHe aches for those hands to be on him again.\n…He wonders if he maybe has serious emotional problems, and scoffs because of course he does, that’s hardly news.\nThat doesn’t make him want it any less.\nAnd his Dreamer doesn’t seem to mind either, if yesterday’s response to Derek’s Fantasy is any indication. Maybe he’s depraved, but he’s not the only one.\nDerek’s eyes drift to the nearest clock. It’s barely after noon. He has hours yet before Erica and Boyd will be home.\nBefore he’s consciously decided anything, he finds himself sliding down onto his mattress, letting his hands and mind wander.\n.-\nStiles hadn’t meant to Fantasize again, he hadn’t. He’d fully planned to come out of that bathroom yesterday with his dignity (somewhat… partially?) intact, and never think about it again.\nBut the daydreams had kept sweeping over him for the rest of the day – less intense than the first one, definitely, but still distracting, still… entrancing. Still Derek. Sudden, rough grinds and soft kisses and more, sensations Stiles has never experienced, never even imagined experiencing…\nHis resolve had lasted until the second he’d gotten home from school. And then he’d been scrambling for his bedroom, falling straight back into the Fantasy Derek had thrown them both into that morning, adding a few of his own twists to it, thrumming with a thrill of actually knowing what Derek wanted. What Derek thought of when he thought about sex.\nThis was what nature had crafted the Fantasies for, society told them. To strengthen the bonds between lovers, to make sex and relationships better, stronger, through shared Fantasies and an intimate understanding your partners’ deepest desires. And now Stiles had been on the receiving end of an actual Fantasy. Derek’s Fantasy. He’d gotten a glimpse of what Derek wanted, and he was the furthest thing from disappointed he could hardly stand it.\nIt was wrong. It was so wrong to encourage this, Stiles knew that. If he had any self control at all, any decency… but in the end it hadn’t mattered. It hadn’t mattered how many times he reminded himself that this wasn’t fair, that Derek had no idea who he was sharing Fantasies with, that he’d probably be completely horrified if he actually knew…\nStiles had gotten off hard to the Fantasy of Derek pounding into his ass and jerking him off in the school bathroom, and spent the next twenty-one hours (no, he wasn’t counting) silently freaking out and hating himself, scared shitless because what if Derek hadn’t liked it? It seemed suddenly so much more important that Derek had liked it.\n…And what if Derek had realized who he was? It had happened unintentionally, but right at the edge of his climax he’d imagined Derek gasping Stiles’ name into his throat. You couldn’t hear things in Fantasies, everyone knew that, but what if Derek had felt Stiles’ name being pushed from his tongue? What if he’d recognized the shape of it in his mouth? What if he was sitting in his loft right now, silently hating Stiles, embarrassed that he’d ever gotten off to the thought of him even if he hadn’t known who he was getting off to, and—\n\nHe’s perched on someone’s lap, groins rocking slowly together, pressed flush against a solid mass of heat and pinned at the hips by powerful hands.\n\nHis plastic fork slips from his hands. The rest of the lunch table glances over. After a few seconds of trying to school his reaction, his next breath shudders out with a needy whine, and Jackson’s expression morphs from a mild, faintly confused scowl to full-on outrage.\n“Again? Seriously? Who the hell would want you that bad?”\n\nDerek’s holding his hips still, rolling steadily up against him. Their foreheads are pressed together, hot breaths gasping fast across his cheeks…\n\nStiles shoves himself up from the table even as Scott snaps something back at Jackson, Lydia rolling her eyes, Allison smacking his shoulder. He makes it to the bathroom, sinks down against the partition in the stall, and allows himself to slide into the sensation.\nTries to ignore the voice in his head echoing Jackson’s words, his own reminding him that no one does want him. Not really.\nFor a few beautiful minutes he squeezes his eyes shut, focuses on the sensation of Derek’s body all over him, and just lets himself pretend it’s real.\nHe can’t begin to explain how this has happened. Just five days since Stiles had shuddered to completion alone in a bathroom stall during luch, and his entire life seems to have spiraled into a Fantasy. Because this can’t be real. This can’t actually be real.\n...But whatever it is, he sure as hell isn't giving it up.\n\nPhantom hands trail up his sides, teasing across his ribs.\n\nStiles bites down on a grin and lets his eyes flutter for the barest second, enjoying the sensation.\nBut he’s in math class again, fuck. What is it about ten in the morning that gets Derek all hot and bothered? Sighing, he slides his eyes closed and imagines his index finger tapping over Derek’s lips.\n\nWait.\n\n.-\n\nFive days earlier…\n\nAfter lunch, Stiles can’t stop thinking about it. How is he expected to stop thinking about it, seriously? Is there a way to make imagining Derek’s hands all over him – and not just his hands, not just his hands at all – a full time job? Or an internship, maybe, because he might not be getting paid but he’s definitely getting some valuable life experience out of these Fantasies.\nHe tries to keep his mind quiet throughout the rest of the school day, makes a serious effort to stay attentive to the class discussions. But focus has never been his forte, and he’s used to Fantasizing in class now. He’s kind of made an art of it, honestly, getting himself hot enough to keep things interesting, without letting it show.\n(Scott's made faces at him more than once, but the other betas seem happy - or desperate - to ignore the desire wafting off him in waves whenever a class discussion gets particularly dull.)\nBut that was all back when Derek had been more of a theoretical factor than a real one, back when it had been idle daydreams instead of an actual person that’s responding to him, wanting him back. It’s more than he can handle while he’s in a room with 30 other students and a grim looking teacher, and they’re reading The Awakening of all things, which is exactly the opposite of helpful.\nAnd now every time his mind drifts to the roll of Derek’s hips, the hot, wet slide of their mouths, he finds his body tingling with a thrill of an echoing touch. As though every thought he has about Derek is making Derek think about him right back.\nAnd that sends a whole new kind of thrill through Stiles, because this back and forth, this sending and receiving, is possibly the greatest concept in the history of the Fantasy.\n\nA spark of heat as their hips grind together.\n\nJust that and Stiles pulls himself back from the Fantasy. His tongue flicks over his lips as he waits for-\n\nA pair of hands gripping his thighs, tugging him closer.\n\nAnd that’s it, just a flash before Derek's Fantasy fades out as well. A slow grin slides over Stiles’ lips.\nBetter than sexting.\n(Not that he’d know from experience, but still.)\nBefore now they had always taken turns: indulging in one person’s Fantasy to completion, the Object just taking whatever the Dreamer doled out. But now they’re trading back and forth. Now they’re sharing in one Fantasy, driving it forward together. Now…\n…Now really isn’t the time.\nHe drops his head down to the desk with an audible thump, and tries to think of a way to tell Derek yes, god yes, but not right now.\n.-\nIt doesn’t occur to Stiles until he crashes into his (thankfully empty) house and presses a kiss into Derek’s waiting jaw that Derek’s going to figure out pretty damn soon that Stiles is a high school student. The timing of the Fantasies… even if he didn’t have his betas coming home after school around this time every day as a reminder, it hasn’t been that long since Derek had been in school too. He probably remembers the schedule.\nAnd what will Derek do when he realizes? Will he care? Will he start wondering about the high school students he actually knows, piecing it together?\nAnd… shit, the betas are a whole other issue too, aren't they? If they come home to Derek's loft the same time Stiles is finally free...\nStiles leans back against his closed front door, squeezing his eyes shut, and prays that Boyd and Erica actually have social lives or bunnies to chase in the preserve or something because Stiles has been waiting for this all day, pointedly not thinking about anything concerning this or Derek or sex (through three whole classes) and he doesn’t know what kinds of things his starved mind will let loose with if he ends up getting Fantasy cock-blocked by a couple of leather wearing were-teens.\nBut only a few seconds pass before Derek answers back: Stiles’ mouth still against his jaw, a hand coming up to clutch at Stiles’ nape, massaging into his scalp and coaxing him on.\nStiles savors the flash of sensation and drops his head forward against the tugging grip, kisses sliding across Derek's stubbled jaw…\n…the hand on his nape just this edge of controlling, guiding him to a hungry mouth. Stiles pushes himself off the door as Derek’s tongue sweeps into his mouth, the other hand coming to rest on his hip, fingers clenching just slightly in rhythm with the movements of his mouth…\n…And Stiles’ hands are sliding up under Derek's shirt (he decides at the last second that they’re still dressed, because he’s not in his room yet and he’ll probably just collapse halfway up the stairs if he feels Derek’s naked body grinding against him), fingers digging into the small of his back.\nDerek leans in at the press of Stiles’ fingers, and Stiles will never cease to be impressed by the sensation in these Fantasies because he can feel the heat radiating off Derek’s skin, feels Derek moan into his mouth, the vibration of it against their pressed-close chests…\nAnd Stiles makes it to his room, kicking his door shut, hands fumbling with his jeans as…\n\n…He fumbles with Derek’s jeans…\n\n…the button catching…\n…the button sliding smoothly open and his hand ducking inside to palm at Derek’s cock…\n…His bare cock, Derek's mind informs him and isn’t Derek the impatient one, not imagining himself any briefs for Stiles to work through. …Unless maybe that’s just normal for him. Maybe he doesn’t wear any in reality.\nStiles whimpers at the thought, sinking against his wall and palming himself hard.\nOh god, a wall. They should absolutely be imagining wall sex right now.\n\nHe stumbles backward, dragging Derek with him…\n\n.-\n\nCurrent\n\nFive days of this, and they’ve developed a finely honed system. Whenever one of them wants to start a shared Fantasy, they’ll prompt with something small – a hand running down an arm or a side – that won’t get their Object in too much trouble if they’re busy or in public. Which is good, because Stiles has already had enough in-class embarrassment for about three lifetimes and he’s not sure what he’d do if he suddenly felt Derek’s mouth on his cock while sitting down to dinner with his dad.\nIf the Object is busy they could just ignore the prompt, but that gets Stiles’ insecurities going like nothing else – why wouldn’t Derek respond? Is he sick of him? Did Stiles step over some line in the last Fantasy and offend him horribly? - so Stiles eventually came up with a basic method of communication he’s actually pretty proud of. A system of simple taps to explain when the other will be free to engage. After all, preparation, planning, and communication are essential to the success of these sorts of things.\n(Whatever ‘this sort of thing’ is.)\nIt had taken a few days (and a ridiculous amount of stress) to get Derek to understand what the taps meant, though. It was beyond ridiculous that he had the guy's number programmed into his phone and went by his loft twice a week for pack meetings, but had to resort to clumsy touches to communicate an idea when he was playing the role of the Dreamer. There were points when Stiles had just thought about writing Derek a note and mailing it to him, explaining his idea. But then Derek would probably smell Stiles on the envelope and come over and rip Stiles' throat out with his teeth. Or possibly something slightly more creative, but almost definitely just as violent.\nSo Fantasy communication it was, and it had definitely sucked. But Stiles was the pack’s planner for a reason, and he’d finally worked it out in the end.\n.-\n\nLast Saturday night… or Sunday morning.\n\nAt promptly midnight, Stiles sets his plan into motion.\nHe squeezes his eyes shut and pictures himself spread out across Derek’s naked body, rocking into him, kissing him fast and dirty. Not exactly playing by their new rules of a casual start to a Fantasy, but this isn't exactly a casual situation. So Stiles spends a few seconds indulging in the frantic, wild kiss, before pulling back and tapping Derek’s lips once with his finger. Just one time, one tap, and he breaks free from the Fantasy.\nAnd then he spends the next hour distracting himself with too-loud music and the internet, ignoring Derek’s attempts to respond. There are two of them, fast and harsh and reeking of frustration before he seemingly gives up. And then finally, what feels like a dozen hours later instead of one, Stiles’ clock finally clicks past 12:59 and then…\n\nHe slides his knee between Derek’s thighs, pressing his shoulders back onto the mattress, scouring his mouth with a hungry tongue. It's so fucking good, feels like the start of something amazing and then… he pulls back groaning, momentarily loathing his own plan as he taps twice at Derek’s gasping lips.\n\nHe forces himself to stop, hoping maybe Derek will catch on. One tap the first time, and he'd come back at one o'clock. Two taps now, so that must mean...\nDerek doesn't catch on. Stiles paces his room restlessly, takes a long, cold shower as Derek arches into him impatiently, as Derek grabs him by the nape and flips them until Stiles is on his back instead, as Derek growls against his neck, taps a frankly ridiculous number of times against Stiles’ mouth, proving he still has absolutely no clue what Stiles is trying to tell him… and then the Fantasies stop.\nStiles stays in the shower for the better part of the hour, shivering away his erection but not his desire, and wondering vaguely if Derek even has a clock anywhere near his bed. If these attempts are going to generate anything at all besides an incredibly pissed off, confused werewolf.\nBut Stiles isn’t one to give up on a plan once he’s started, and at 2:00 sharp he’s curled up beside Derek, both of them clothed this time, and pressing tender, apologetic kisses into his neck. Caressing soothing hands through his hair, doing all the work because it seems supremely unfair to imagine Derek responding when he's most likely completely pissed at Stiles.\nMaybe the middle of the night hadn’t been the ideal time to try and teach Derek something.\nWhen he drags himself from the Fantasy this time, leaving three slow, caressing taps against Derek’s lips, he doesn’t get any response.\nHe spends the next hour curled up on his side, waiting for 3:00, scrolling mindlessly through Tumblr and trying to convince himself that he hasn’t completely screwed everything up. He knows a few things about Derek by this point, and not a single one of them points toward patience. He’s straightforward, he gets frustrated quickly, and he doesn’t like mind games.\nStiles might have just accidentally transformed himself from a fun diversion to an annoyance. Or worse.\nDerek might hate him. Derek probably hates him.\nTaps, what a stupid system. He should have drawn the time on Derek's palm, or actually learned sign language (does Derek know sign language?) or licked the numbers onto his chest, or...\nStiles tries to console himself with the knowledge that Derek doesn’t know it’s Stiles he hates, but it’s cold comfort when all the time he’s been spending with Derek lately has been as his faceless Dreamer.\nMaybe it’s just sex, but it feels like more than that. He feels closer to Derek now than maybe he ever has as Stiles, and if he loses this… Fuck, he hadn’t realized he was in so deep. It was just daydreams, just sex. When had he fallen this hard?\nHe squeezes his eyes shut and focuses on his breathing, and completely misses the clock on the screen ticking to 2:59 and then 3:00 and then—\nDerek’s cupping his face with one hand, the other gently smoothing over his bare hip. His breath hits Stiles’ cheek in a way that sends a full-body shudder through him, and then he’s nosing his way across Stiles’ jaw, gentle and searching, like he’s trying to scent Stiles through the Fantasy. He draws back, then presses his lips to Stiles’ gently, tentatively, like he’s not sure of himself. And that tentative touch, so unlike anything he’s seen from Derek as Stiles, leaves him aching to tug the other man close. To wrap him in a reassuring grip, deepen the kiss, just go over to his loft and talk to him for real but he can’t, can’t for so many reasons, most notably because this is Derek’s Fantasy, this is his moment, and Stiles owes him at least that after the crap he’s put him through tonight.\nAnd then the touch of Derek’s hand leaves his skin and his mouth draws back and Stiles whimpers at the loss.\n\nAnd Derek’s fingers tap deliberately – one, two, three, four – against his lips.\n\nFour times. Four o'clock. Derek gets it.\nThere aren’t tears of joy in Stiles’ eyes. There are absolutely no profoundly inappropriate Helen Keller references running through his head.\nHe does throw his hands up above his head, whooping victoriously, tapping three frantic fingers against Derek’s lips because like hell is he going to wait another hour to continue this. It's three o'clock and Derek understands the system. And Derek doesn't hate him. And when he presses Derek against the tile of his shower stall, steam and water running down their skin in rivulets as he rocks their bodies together, pressing elated kisses all over his neck and throat… well, that’s not an inappropriate reference at all. It's just because he’d been deprived of a hot shower earlier.\nThe worst days are the ones where Fantasies don’t feel like enough.\nNine days into their arrangement, Stiles almost tells Derek.\n—\nThe sensation of a hand sliding down his shoulder catches Derek so off-guard he actually twists in a futile search for its source. No one’s there of course, his loft having emptied out twenty minutes ago, and he squeezes his eyes shut as the now-familiar sensation of phantom fingers continue to shiver over his skin. They trail down his nape, an attempt at a soothing motion that only works to rile him further.\n\n“Are you really so content with destroying every remnant of our family?”\n\nHe grits his teeth against the memory of Peter’s words, against the feeling of long fingers tracing down his spine.\n\n“It was Scott’s call, and I stand by it.”\n\n\n“Scott is an idealistic child. And you’re letting him hand away our territory, territory it took generations to establish, for convenience?”\n\n\n“What matters is that the territory is protected. Be it by us or Scott, or Satomi’s pack.”\n\n“It’s ours to protect.”\n\n“There aren’t enough of us left to guard it all.”\n\n\n“And whose fault is that, Derek?”\n\nDerek’s fist slams into the cement wall and comes away bleeding heavily.\nHe hasn’t responded to his Dreamer’s advances but they, uncharacteristically, don’t retreat. Instead a pair of lips joins the fingers, pressing a lingering kiss into the taut tendons of his neck.\nHe lifts his fist again, falters.\nThe pack had cleared out pretty fast, standing around Derek in a show of solidarity until Peter had stalked out, before scattering quickly themselves.  Erica had looked like she’d wanted to stay, but Boyd had just offered Derek a silent nod before taking her elbow and leading her away. Isaac had sensed the emotions roiling under Derek’s calm surface and had bolted for the door before anyone, while Scott had caught Derek’s eyes and nodded something that might have been thanks, or might have been an apology, before following him. Stiles had actually paused beside Derek, lifting a hand like he’d wanted to pat him on the shoulder, before averting his eyes and continuing on out without a word.\nAnd Derek hadn’t found the voice to ask any of them to stay.\nDerek still hasn’t responded to the Dreamer, but maybe he’s projecting something unconsciously because they’re still here, a long arm looping around Derek’s waist now, the heat of a lithe body pressing in behind him as the kisses continue, soft and unhurried, down the lines of his nape to his shoulder.\nPeter’s voice is still echoing in his mind, as invasive as always, cutting and cold and painfully accurate.\n“Scott prevented a pack war,” Derek had pointed out. And he had. The Beacon Heights pack had been around for years, building up members quietly, and wouldn’t surrender the land easily.\n\n“He showed weakness, and proved us even weaker. The Hales held all of Beacon County before the fire. That withered bitch sensed our weakness, that’s why she moved in. And you proved her right by letting another Alpha give away our land without so much as a consultation. You’re the last Hale Alpha, Derek, and you’re destroying us.”\n\nAnd then there had been Peter’s parting jibe, tossed out low from the hallway without so much as a glance behind him: “So your libido continues to be more important than your pack?”\nHis betas had understood, even if the others hadn’t. Derek had been distracted lately, apparently enough so that even Peter had noticed. He’d been devoting too much time to this, to glorified daydreams with a faceless stranger.\nMaybe Peter was right. He had responsibilities to his family, to their legacy.\nAnd he was failing at every turn.\nHis fist hits the wall again, hard enough to block out the sensation of soothing fingers running down his sides. When his hand falls from the shattered wall the wrist hangs limp, broken. There’s a sick satisfaction that comes from the pain, and he twists the limb, a snarl tearing out of him at the raw agony shooting in spikes up his arm.\nHe squeezes his eyes shut, savoring the distraction of knitting bone. It doesn’t last, though. The soft kisses continue, and Derek spins to lean back against the cracked wall, pressing his palm against the Dreamer’s mouth.\nStop. This has to stop.\nHe can’t have this right now. He can’t have comfort. Not with Peter’s voice in his head taunting him for his distraction, the familiar ache of failure crawling all over his skin.\nThe idea that these Fantasies might be weakening him, keeping him from protecting his territory the way he should…\nAnother kiss, right at the side of his jaw, and Derek presses his fingers against the Dreamer’s mouth a second time, urgently.\nThis is their system. Fingers to the lips mean stop, mean not now, and it’s a rule that’s never been ignored by either of them since it had been painstakingly established several days before.\nBut this time the Dreamer doesn’t retreat. A hand trails down his cheek, the body pressing close in front of him now, a thumb smoothing little circles below his collar, right over his heart.\nThis is so far outside their rules, and Derek should feel angry, betrayed, but he can’t help the way his body is starting to relax into the caresses and he doesn’t deserve it, damn it.\nBut if the Dreamer’s so damn insistent on not letting him be…\nHe squeezes his eyes shut and the lithe body is slamming into him hard, nails biting into his shoulders, dragging down his back hard enough to draw blood. Teeth sink into his skin, biting a punishing bruise into his shoulder. Then he’s being spun, slammed face first into the cement wall, the body pinning him in place, as strong as him, stronger, as angry teeth bite into his nape. It’s not a love bite. It’s savage, violent.\n\nHe pulls back from the Fantasy, breathing harshly.\nAnd there’s no response from the Dreamer.\nHe swallows back his disappointment, a bitter thrill spiking through him at having finally gotten the stubborn stranger to give up.\nThey’d just wanted someone pretty to fuck. A face off the street, most likely. It’s about time they learned that they’d signed up for a disaster.\nBut a few seconds later a tentative hand is trailing down his cheek again. A gentle kiss brushing the edge of his hairline.\nDerek snarls, angry at his own relief, and slams his nearly healed wrist back into the wall.\nThey should give up on him. He needs them to give up on him. They don’t know anything about him, and he’s getting too invested in this. Too invested in a relationship that isn’t even real, taking away time that he should be using to train his betas, reestablish his pack.\nHe can’t.\n\nHe makes the body press him down to the cold floor, the soft grip on his cheek going violent as stubs of nails dig into his skin, the pressure forcing Derek’s head to the side and baring his throat for the teeth to sink into. Fierce, angry, aggressive... But what he deserves. The free hand goes behind him, brutal fingers going to push into him dry, harsh and burning and—\n\n\n—Derek’s Fantasy is interrupted as the hands soften suddenly, trembling as they smooth apologetically across his skin, as the bites stop, gentle lips shushing instead against his ear. The hard floor is gone, a soft bed in its place, and—\n\n\n—Derek fights it, draws his Fantasy self up to sitting, beats away the gentle hands and drags the Dreamer into a bruising kiss, makes them bite his lip hard enough to draw blood and—\n\n\n—he’s caught up in a fierce, trembling hug, lips sliding to brush his jaw, breathing out silent assurances, and—\n\nDerek’s cheeks are wet. He’s slumping slowly down against the wall, sharp breaths shuddering out as his wrist finishes healing for the second time in as many minutes.\nHe makes one more halfhearted attempt to fight free from the Dreamer’s grip, but Fantasies are nothing if not honest, and instead he’s clutching back just as fiercely, arms wrapping around the lithe body—\n\n—that continues to hold him and whisper soothing nothings into his skin.\n\nDerek forces his eyes open, his vision blurred, and drags himself across the open floor to collapse on his bed.\nA warm body huddles next to him, fingers brushing through his hair and soft kisses ghosting across his temple until he falls asleep.\n—\nStiles makes it all the way the loft before he second guesses himself. His chest is aching, body trembling with the need to wrap Derek in his arms for real, to just tell him that Peter’s a dick and there’s nothing wrong with trusting other people, trusting Scott.\nTrusting Stiles.\nHe should have said it before he’d left the first time, but his own nerves and Derek’s tense stance had gotten the better of him. If he’d had any idea how shattered Derek felt inside, he wouldn’t have let anything stop him.\nPeter’s nothing but poison for all of them, but Stiles hadn’t realized how deeply his words bleed into Derek’s psyche until Derek had tried using Stiles as a vessel to punish himself. Derek always seemed to shrug Peter off, treat him like an annoyance… but Stiles should have known better. Peter’s still family. He’s the last remaining member of the Hale pack to stand in judgment against Derek, a living reminder of the fire that Derek perceives to be his ultimate failure.\nThere’s no way that couldn’t get under his skin, at least a little. After all, there’s a reason Derek hasn’t thrown Peter to the curb permanently, and that same reason is why Peter can cut Derek so easily when he chooses to. He knows exactly which buttons to push.\nStiles makes it to the loft where he knows Derek is finally sleeping, exhausted by his own self loathing,\nAnd spends half an hour idling in the quiet lot.\nApparently the Jeep’s engine is loud enough to wake a sleeping werewolf, though, because Stiles’ phone ends up buzzing just as he’s deciding to go upstairs. Or maybe leave. Or maybe sit there for another half an hour.\n\nCome up if you’re coming.\nCaught. No chance to run now. So Stiles makes his way into the building and up the stairs. His feet drag, gut twisting sickly the entire way.\nHas Derek put it together yet? That the Dreamer appeared to comfort him when only the pack knew he needed it? That the Dreamer disappeared only for Stiles to show up in his place?\nBut when he steps into the loft and Derek looks up from the couch – a little pale, hair soft and sleep ruffled – there’s no surprise, no new understanding in his eyes.\nOf course not. Stiles is probably the last person Derek imagines when he thinks of sex, much less comfort.\nHe doesn’t have it in him to feel too resentful about that, though. He’s too focused on Derek, on the bitter taste of phantom blood in his mouth. On the feeling of his own fingers being forced so brutally across Derek’s skin. On the way Derek had shuddered and clutched at Stiles, frantic and lonely and … and now he just looks so tired.\n“Did you forget something?”\nStiles spots dried blood flaking across the skin of Derek’s knuckles, and wants to kiss them so badly the feeling nearly chokes him.\nHe clears his throat, drags his gaze back upward to find Derek watching him expectantly.\n“Peter’s a dick,” he offers with a shrug.\nDerek’s brows slowly rise.\n“You could have said that in a text.” It’s an easy answer, just at the edge of teasing. Some of the tension goes out of Stiles, and he lets his lips curl.\n“Oh, like you ever answer texts. Do you even know how to read them?”\nHe crosses the room as he talks, fights every urge to fall onto Derek’s lap where he knows they’ll fit together so goddamn perfectly. Still on edge from the brutality of Derek’s Fantasies, wanting the gentle reassurance of skin on skin. But that’s not Stiles’ place, not out here in reality, so he goes instead to the opposite end of the couch. Derek follows his movement, body tensing a little at Stiles’ approach, eyes narrowing disapprovingly as he perches on the arm, but just responds with:\n“I sent you a text just now. Literally two minutes ago.”\n“Yeah, after I already got here. Maybe if you didn’t spend all your time acting like a caveman I wouldn’t have felt the need to drive all the way over here for a face to face.” Which is a boldfaced lie, sure, but Derek doesn’t know how much of a lie it is. Doesn’t know how much Stiles had needed to see him, needed the reassurance that he’s all in one piece, that Peter’s stupid jibes hadn’t broken something irreparable.\nDerek’s lips actually twitch at that. He looks down, hands clenching, going tense like he isn’t quite sure what to do with them.\nHe’s so awkward in reality, Stiles realizes. Awkward isn’t a word he ever would have used to describe Derek before they’d started Fantasizing together, back when he’d thought all the tension and hard looks were what Derek was really feeling, all the way through.\nBut now that he’s gotten glimpses of what Derek’s really like with his walls stripped away, the disconnect between what he wants to do and how he actually acts is painfully obvious.\nLike right now. The last thing Derek wants is to be alone, but he still glances back up at Stiles with a cool look and says:\n“Well, now you said what you drove here to say, so…”\n“So,” Stiles cuts in, sliding off the arm and onto the couch cushion. “I clearly wasted a bunch of gas for nothing. You might as well entertain me and make the trip worth it.”\n“Entertain you?”\nLike Derek’s never even heard of fun. Stiles happens to know that Derek and fun go together intimately.\n…Though that’s probably not a track Derek wants to get on with Stiles tonight. So he just rolls his eyes, kicking his shoes off pointedly.\n“Come on, Derek. We forced you to buy a TV and I’m pretty much two hundred percent positive you never get any use out of it. Let’s justify that monthly Netflix bill.”\n“…You signed me up for Netflix?” He says it like it’s a foreign word. Stiles doesn’t even have to feign his wince.\n“Dude. If you have a TV you need Netflix. Welcome, once again, to the modern world. Come on, it doesn’t even have to be fun. We can watch some painfully boring documentary if that’ll make you happy.”\nDerek shoots him a sarcastic smirk, but goes obediently to retrieve the remote (and has to track down batteries to put in it, dear god. Stiles had mostly been kidding about Derek never touching the TV).\nIt isn’t anything like the Fantasies – Stiles and Derek sitting at opposite ends of the couch, Stiles constantly itching to get closer. But despite that it’s actually… nice. Bickering over each other’s viewing choices before agreeing, surprisingly quickly, on Firefly. And Stiles sees the tension draining out of Derek’s shoulders as the night goes on, as he adjusts to the simple presence of another body sharing his air. He wonders if Derek even knows how to just be around people when there’s not a life-threatening mission at hand, if he ever actually does anything like this with his betas. Judging by the lack of batteries in the remote, probably not.\nHe resolves to bring up the idea of pack bonding nights to Scott. Maybe going out for pizza, a movie night, a barbecue. That needs to have been a thing like a year ago.\nAnd Stiles is going to spend a lot more Fantasy time just hugging Derek.\nThe guy obviously needs it even more than the sex.\nThe tone of the Fantasies doesn’t exactly change after that. Derek still finds himself panting into his mattress late at night, groin hitching against hips that fit too well into the shape of his palms, mouthing wetly against a neck that stretches and groans silent encouragement, body surging back against him rough and frantic with need until they both tumble over that edge into toe-curling bliss…\nBut there are new little additions to their routine as well, the way the body will curl up next to him afterward, long fingers trailing through his hair and soft, unheated kisses brushing his temple until he dozes off.\nThere are the moments of unexpected warmth that flood over him throughout the day – strong arms and a warm body suddenly against him in a way that should feel stifling but somehow manages to leach all the tension right out of him.\nIt happens at the most random moments, with no way to prepare for it – while he’s out running, doing chores, eating dinner – and Derek realizes quickly that it isn’t a prelude to anything, not some new type of foreplay, when he tries to reciprocate with a kiss and finds a pair of fingers brushing his lips, holding him off. So, just a hug then. Just… comfort.\nHe’s not sure what to make of it, this new development in their… not relationship, because to have a relationship he’d have to have even the slightest idea who he’s having the relationship with.\nAnd the fact that he doesn’t is starting to affect him in ways it hadn’t when it was just sex between them.\n.-\nThey’re out in the preserve for some afternoon training, Scott and the betas running through exercises, Lydia working on what looks like some math research that goes well above and beyond the school curriculum, and Stiles playing idly with his phone.\nDerek’s more or less idling on the sidelines, supervising, when the now familiar sensation sweeps over him. He doesn’t even realize he’s reacting until Scott’s puzzled “Derek?” cuts through his fuzzy haze, and he looks up to see all the wolves paused, still in battle stances, watching him.\nScott’s brows are furrowed, his nostrils flaring like he’s trying to sniff out a mystery, and Erica is wrinkling her nose, saying: “I know, right? He’s been doing that all week, it’s disgusting.”\nAnd Stiles is glancing between them all with slightly too-wide eyes, asking “What’s he doing?” and before Derek can scowl his beta into silence she’s rolling her eyes, explaining: “This warm, fuzzy pheromone thing wafting off him. Trust me, be glad you can’t smell it. If it wasn’t Derek I’d think he was seriously crushing on someone.”\nWhich makes Derek’s heart uptick a little, maybe, because even though he definitely doesn’t have a crush (“crush” doesn’t even begin to describe what’s going on here) it somehow still seems to hit too close to the truth for comfort.\nAnd maybe he’s actually been training his betas too well, because the wolves all do a double-take, and then Erica’s bursting into a judging cackle while Isaac’s eyes go to the ground fast, and Boyd seems more or less resigned. And Stiles – as sharp as always – takes in their reactions, his brows shooting up, the smallest hint of a smirk touching his lips.\nDerek rolls his eyes pointedly at him and sends the others back to their exercises. And refuses to think about the way all the tension had gone out of his shoulders the second those phantom arms slipped around him.\n.-\n\nThey’re splayed out atop a soft, quilted comforter, bodies rocking together and lips dragging in slow, needy kisses. The Dreamer’s knees are hitched over Derek’s elbows, and there’s no way to deny that the Fantasies are changing at this point because last week Derek would have been pounding into him, chasing his release. But now their hands are clasped as they roll together, achingly gentle, the tug and flutter of Derek’s heart only half-due to the slide of their bodies.\n\n\nHe moves his mouth from the Dreamer’s soft, swollen lips, dragging his nose along the line of his jaw and aching at the lack of scent there. He trails a hand up the muscles of his arm to brace against his shoulder, and whimpers because he doesn’t know the shade of that skin, or that soft hair, or those eyes.\n\n\nThis might be the best thing he’s ever had; he feels safe and cared for in a way he hasn’t in years, and he doesn’t even have an image to go along with the person giving this to him.\n\n\n“Who are you?” he finds himself breathing against that long throat, wishing his Dreamer could hear him, wishing he could answer.\n\n.-\nHe refuses to let the mystery of it become an obsession. Peter’s jibes are still ringing in his mind days later, and he’s devoting his attention determinedly to his pack, to establishing ground rules for peaceful relations with Satomi and her betas in Beacon Heights.\n…He might also be focusing on other things so intently because the question of his Dreamer’s identity is starting to become a serious problem.\nBecause it’s been a long time since it was just sex between them, and that’s not just on Derek’s end. Any normal person would have given up after Derek’s breakdown. They would have decided he had too much baggage and moved on to an easier Object. They certainly wouldn’t have started caressing him soothingly after sex, wouldn’t be wasting time sending out unnecessary hugs three times a day.\nBut if the Dreamer actually cares for him, wants more than just Fantasies… why the hell haven’t they approached him by now? They know he’s interested. God it’s almost pathetic how obvious his interest is. How longing his touches and kisses have become.\nIs there a reason they can’t find him in reality? Is it someone from New York, maybe, belatedly showing interest? Are they in prison, having seen him in passing during one of his visits to the Sheriff’s station? Confined to a hospital bed, too sick to come find him? Christ, are they married?\nThe possessive surge that flares through Derek at that last thought should be enough to show him he’s in too deep. Should be enough to make him back down.\nThere’s no real relationship here. Just Fantasies. He doesn’t have the right to be jealous.\nHe squeezes his eyes shut and before he knows it, he finds himself clutching his Dreamer close, arms wrapped bruisingly around his waist, clasping his nape, breathing “where are you? Come find me” pointlessly against his ear.\n.-\nStiles arrives at his loft without warning, meandering straight past Derek and flopping on his couch with such a casual air Derek doesn’t even think to stop him, just watching him blankly from the doorway as he settles in.\nHe doesn’t look panicked. There isn’t some new disaster bringing him here, some enemy to research or battle to dive into, so…\nWhy is he here? It’s a Friday night. Don’t teenagers have things they like to do on Friday nights? Boyd and Erica do; they’ve both been gone for hours.\nStiles flashes him an easy smile, but Derek picks up a hint of nerves in his tone, in his shifting hands, as he announces: “Your beta hijacked my best friend for the night. Again. I figure you owe me some entertainment.”\nLike he thinks there’s a chance Derek might just kick him out. And maybe it’s the worry itself that stops him from doing just that. …Or maybe the fact that he’d been planning on spending the next few hours just staring at the ceiling, wallowing in his growing misery.\nMaybe a distraction could keep him from that much, at least.\nSo Derek slides the door shut, crossing the room in slow steps to hover at the other edge of the couch.\n“How is it my fault what Isaac does with his free time?”\nStiles just rolls his eyes.\n“Your beta, dude. You bite the guy, you’re his keeper. I don’t make the rules. Now sit. I hope you’ve got cash on you ‘cause I already ordered pizzas and they should be here in ten. And I’m feeling like tonight’s a Marvel night, what do you think? Iron Man or Avengers?”\n.-\nIt’s strangely comfortable: sitting together on the couch, eating increasingly cold pizza and snarking his way through action movies with Stiles. He can’t deny that the teen’s a decent distraction, that his cutting jokes and rambling comparisons to the comic universe manage to keep Derek’s mind from slipping into dark places for the next several hours.\nBut when Stiles is gone and Derek finally falls into bed, he realizes he hasn’t felt the Dreamer’s touch once since he’d sent out his own hug that afternoon.\nHad that crossed some kind of line? Had he finally seemed too desperate? Had something in his touch given away how much this situation is killing him, how much it would destroy him to lose it?\nHe spends the rest of the night staring at the ceiling, breathing around a sharp ache in his chest.\nIt’s eight PM on a Wednesday, five days after their impromptu, Derek’s-panicked-Fantasy-hug-inspired movie night, and Stiles and Derek are sprawled across Derek’s couch, boxes of takeout in hand, watching Serenity on Derek’s big screen. Apparently the film had come out shortly post-fire (post Derek allowing himself anything fun ever) so he’d managed to completely miss out on the franchise’s conclusion.\nWhich is obviously completely unacceptable.\nStiles had come over here in the first place with the excuse of updating the pack’s bestiary, which had kept the pair of them busy long enough that they’d decided to order dinner. And then it had just been a hop and a skip of logic to decide that they couldn’t research while eating – “Do you seriously want to risk getting all kinds of drippy sauces all over these thousand year old books, dude?” And after that it had only taken about a minute and a half for Stiles to declare silent eating just plain awkward (“especially with those serial killer brows of yours, Derek. We need some background noise pronto or I’m gonna start hearing the Jaws theme every time you take a bite”). And somehow along the way, their research session had transformed (completely unintentionally, Stiles will go to the grave swearing that) into movie time.\nAnd the thing is, it had been easy.\nGod, had it been easy: Derek letting Stiles into the loft with hardly an eye roll, shrugging and going along with Stiles’ suggestions with a minimum amount of obligatory grumbling. The disapproval that had flickered into his expression when Stiles perched on the couch’s armrest had been more habitual at this point than heated, and sliding off had given Stiles a chance to settle right down next to Derek, so… not really much of a loss there.\nIt’s practically a date. It could be a date so easily. If Stiles just shifts his weight a little to the right to lean into him, if he just decides “screw it all” and leans six inches over to press their lips together. It would definitely be a date then. It would be amazing.\nBecause Derek would know once Stiles kissed him. He’d have to, right?\nAnd then he probably wouldn’t even bother breaking the kiss, would just twist them until their bodies were pressed together, until Stiles was pinned under his hot, heavy weight and Derek’s tongue fucked into his mouth, and just took what he wanted the way he had so many times in their Fantasies…\nThe barest tremor shudders through Derek, chopsticks drooping in suddenly boneless fingers. His breath hitches, his head shaking… And then he’s spinning to look at Stiles, eyes a little bit wide, pupils dilated with want…\nAnd Stiles has never really seen this, alright? He’s imagined it, what Derek would look like all hot and wanting, but he’s never seen it for real. He loses a second or two taking in the bobbing of Derek’s throat as he swallows, the way his dark lashes flutter over darker eyes as he focuses in on Stiles.\n…Focuses in on Stiles, who’s just been Fantasizing about Derek pinning him to this very couch, kissing him breathless.\nHe’s at a loss for words, at a loss for a reaction. Everything’s about to change all because of Stiles’ stupid, wandering brain and he’s nowhere near ready for it, and…\nAnd then Derek’s lips tilt, a familiar mocking smirk, and those intense eyes are rolling, and Derek’s announcing “Are you seriously one of those people?”\nHe’s being way too casual about this. He should be punching Stiles or jumping him or demanding answers or… something. But his expression’s so relaxed that Stiles can’t bring himself to respond with anything but a hitched “huh?”\n“You’re going to stare at me through the whole movie to see my reactions? I swear to god, Stiles, if you start asking me how much I like every scene or telegraphing the jokes before they happen…”\nIt takes everything Stiles has not to just jaw-drop right there. Because… seriously? He’d slipped into a Fantasy right next to his Object. He’d been picturing Derek pinning him to these very cushions, while he wore these very clothes, and still… nothing? Is he seriously that far under Derek’s radar?\nHe forces a grin that feels brittle on his lips, and settles back to stare at the patchwork ship shooting through empty space.\n“Yeah, no, sorry. Just, you know me, get excited about my favorite movie moments.”\nDerek watches him for a few seconds longer, but if he’s picked up on the shift in the evening’s tone he doesn’t comment on it.\nBecause he’s apparently the most fucking oblivious guy ever.\nThen he turns and resettles as well, a bare inch of charged air separating their elbows.\n“You know, that’s probably why Scott refuses to watch Star Wars with you.”\n“Good point, I’ll try to control myself.”\nDerek glances at him again, and Stiles doesn’t look back.\nIt’s stupid to be jealous. God, he’s being jealous of himself. But he can’t help feeling like he’s losing a battle against this better version of himself – a silent version, a less annoying version. Their bodies are exactly the same – Fantasies being nothing if not honest – but while Derek’s hands tremble with want every time he touches the Dreamer, he barely looks at Stiles at all.\nThere’s a few seconds of tense silence while the brash captain and his doomed from the start love interest banter cheekily onscreen. And when it’s finally broken, it’s by the ghost of a phantom finger against his lips.\n\nWait.\n\nStiles stares at the screen, forcing himself not to react.\nAt least Derek likes him enough not to kick him out halfway through a movie for sexytimes.\nHe guesses that’s probably about the best he could hope for.\n.-\n“What the hell happened?”\nIt’s a stupid question, but it’s all Stiles can come up with when Boyd and Isaac come stumbling through the door, Derek’s slumped, shuddering body between them. Derek looks barely conscious, head lolling, eyes completely unfocused. His shirt’s torn so badly it should start looking for a new career as a pile of rags, and when they lower Derek onto his couch (more blood stains, he’s gonna love that) and Isaac just shreds the fabric off of him, Stiles can see four long tears – claw marks – stretching from his upper chest to his belly.\nHis gut lurches for about half a dozen different reasons, rooted and staring while Boyd reappears, holding a wet washcloth and towels, and unceremoniously drops them into Stiles’ hands.\n“It’s beta claws, he’ll be fine in a bit.” And then to Isaac. “We should get back.”\nIsaac nods and then they’re out the door again, and Stiles is moving on unsteady legs to the couch Derek’s bleeding all over.\nThings had been too quiet, too peaceful, for the past week or so. Stiles should have known something like this was coming.\nAn hour ago, Peter had attacked a pair of teenage betas from Satomi’s pack when they’d decided to go get pizza in land designated McCall-Hale territory. He’d been itching to start something since the blowout with Derek last week, and jumped on the first petty excuse to attack.\nThings had gone to hell from there, Satomi’s pack reportedly preparing to retaliate. Derek and the others had gone to try and calm things down. Apparently it hadn’t gone well.\n“Told you you should’ve brought me along, idiot. You’re not exactly great with the words.”\nOr the fighting, apparently.\nStiles’ hands are shaking as he touches the cloth to the space between two wounds, trying to get a better handle on the damage. And if Derek were anything other than completely out of it Stiles probably would’ve lost his arm. As it is Derek just flinches and bats weakly at Stiles’ hand. A pitiful whimper drags from his throat, and before Stiles thinks about it he’s leaning in and shushing against Derek’s ear, fingers trailing through his hair the way he has a dozen times before.\n…The way he never actually has. Not as himself. Not in reality.\nToo late, he catches himself and starts to pull his hand back. But Derek’s relaxing into the contact, features smoothing out as he nuzzles up into Stiles’ hand.\nFuck.\nStiles stares down, a little breathless, hypnotized by Derek’s barely parted lips, the fluttering movement of his eyes shifting behind heavy lids, and cards his fingers through Derek’s hair again.\nThe little sigh that falls from Derek’s mouth this time definitely isn’t pain, and it stabs at the writhing emotions in Stiles’ chest as much as it sets his dick throbbing.\nThere’s a fluttering in Stiles’ mind: phantom fingers trailing down his cheek, a soft kiss, and Stiles realizes that Derek’s reaching out to him right now, barely conscious as he is, delirious with pain and blood loss. And still wanting him.\nHe shouldn’t be doing this. This situation’s already screwed up on so many levels; he absolutely shouldn’t be blurring the lines even more. If anything he should retreat, walk to another room, give Derek comfort in the way he’s asking for it.\nOr just ignore it, go back to cleaning the wounds. Be responsible about this.\nBut he can’t stop himself from trailing his fingers down Derek’s scalp, feeling the soft, dark tendrils with his actual hand, drinking in the little, happy murmurs his Fantasies can’t ever provide for him. Another shudder runs through Derek, his expression going tight and pained, and Stiles is leaning in and pressing a kiss to Derek’s temple, savoring the way his body totally relaxes at the contact, unconsciously trusting Stiles… or the Dreamer, or both.\nHe lets his lips linger, breathing in deeply, memorizing Derek’s scent – his shampoo, his sweat – for all the times he won’t have it.\n“You’re ok, Derek. You’re gonna be ok. I’ve got you.”\nDerek’s head angles, his nostrils flaring as it twists across the bloody cushion. His eyes are darting fast under fluttering lids, and all at once their lips are almost brushing. Stiles could kiss him right now. He’s leaning up for it, practically asking for it. His breath is ghosting over Stiles’ lips and it would take practically nothing, a little dip, a tiny surrender to gravity and he would be tasting Derek. Feeling those lips, that scratch of stubble for real. Maybe Derek would wake up and kiss him back. Maybe he could have this, really have this…\nThere’s a shift of movement in the corner of his vision, and Stiles shoots backward to find Boyd in the doorway, watching with solemn eyes.\n“I was…” Fuck, there’s no good explanation. No excuse. Distraction it is, then: “Why aren’t you helping the others?”\n“Fight’s done,” Boyd answers, succinct as ever, his tone revealing nothing. “Scott and Satomi are talking it out.”\nDerek’s shifting again, hand drifting clumsily, restlessly, until it catches Stiles’ sleeve.\nAt the same time a hand caresses his nape, the other thumbing little circles into his waist, their bodies pressing flush together as Derek’s stubble-rough cheek drags along his. Breaths whisper across his ear, making him shiver. \n“Who’re you?” The words trip out of Derek’s mouth in time with the phantom breathing, and Stiles jerks away, pushing himself to his feet. His body’s vibrating with want, with frustration. Derek has breathed against his ear like that a hundred times. Has he always been asking that? Always begging to know the identity of his Dreamer?\nHe doesn’t linger on the question because Boyd’s brows are shooting up and crap, crap, why did Derek have to pick betas more observant than he is? Boyd knows. And Stiles still feels Derek’s fingers trailing, slow and longing, over his skin, and he wants to shake him awake, wants to kiss him and shout “It’s me, you moron!” in his face, and there’s no way that’ll go well.\nAnd Boyd knows. Boyd knows.\nStiles can’t even look at him.\n“Ok, great, well. You’re back now and he’s your alpha and all so you look after him. I’ll just, uh…” He’s gathering up his stuff – backpack, maps, his copy of the treaty - in shaking hands, and Derek lets out a plaintive sound like he can feel Stiles’ panic and then he’s shoving past Boyd, out into the hall, darting down the stairs and making a break for his Jeep.\n.-\nDerek doesn’t show up to rip his throat out in the middle of the night. That’s probably good, all things considered.\nHe doesn’t reach out to the Dreamer either, and Stiles can’t decide if he’s upset or relieved. He doesn’t know what he’d do right now if he felt Derek’s fingers on him.\nHe already feels like he’s shaking apart.\n.-\nIt still amazes Stiles that someone built like a boulder, composed of several hundred pounds of solid muscle, could move silently enough to catch him completely off-guard. But then, if he couldn’t, there wouldn’t have been any problem at all yesterday, would there?\nStiles steels himself before looking up, and Boyd’s just looking across the lunch table at him with the same unreadable expression he’d worn yesterday.\nNone of the rest of the pack is in sight, which is just… weird, to be honest. He wonders if Boyd had warned them away. He wonders if everyone knows now. Boyd doesn’t seem the type to gossip, but…\n“How’s Derek?” he asks to break up his own screaming thoughts, and winces because yeah, way to look totally obsessed with the guy. Boyd probably already thinks Stiles is some kind of creepy stalker-type. Oh god, he’s probably here to threaten Stiles for getting all up in his alpha’s business or something.\nBut Boyd just shrugs.\n“Cuts were deep, but he’s an alpha. He was healed by this morning.”\nAnd then it’s back to silent staring. Stiles pokes at the Mush of the Day on his tray for a few seconds, feeling like he’s crawling out of his skin, before announcing, “Great. Well, this has been fun, but—“\n“Thing about werewolves,” Boyd cuts in, quiet and commanding in a way Stiles has never heard anyone else quite pull off, “thing I’ve noticed, anyway, is how different our senses are from other people.”\nStiles blinks at him. Of all the places he’d thought this would be going…\n“Yeah. See better, hear better, I know.” He didn’t exactly need a lesson on wolf superpowers. He’d helped Scott test them all out after he’d been bitten, after all. But Boyd just rolls his eyes.\n“Right there. Thinking like a human.”\nStiles’ jaw tightens.\n“Ok, maybe because I am one? And do you have a point, because last I checked this was lunch, not Werewolves 101.”\nBoyd pauses for another few thoughtful seconds, but Stiles knows better than to try and leave again. Fingers shift and lace together, Boyd leaning heavily over the table as his voice dips lower.\n“Yeah, wolves see better, hear better, all that. But scent, that’s the big one. With us a person’s scent’s as much who they are as their face. Heartbeat’s as important as their voice. Give a human the shape of something and they can pretty much figure out what it is. With wolves though, the way we work, way we’re programmed to think, we need smell as much as sight, more than touch.”\nStiles heart flutters, and Boyd’s brows go up pointedly. This is probably the most he’s ever heard Boyd speak on one topic, and he gets where he’s going with this, he does. But he can’t figure out what he’s supposed to say back. And amazingly, Boyd keeps on going.\n“Erica complains about it a lot. How now that she’s got people Fantasizing about her all the time, she can’t even tell who they are. Says it’s not fair, Fantasies should come with people's scents.” He shrugs like he didn’t even notice the way Stiles had flinched at the word ‘fantasy.’\nStiles’ throat feels dry.\n“Doesn’t bother you though?”\nAnd Boyd’s lips twitch. He glances down at his hands.\n“I know it’s probably Erica.”\nWhich isn’t exactly news, but neither of them really talk about it. …Crap, are he and Boyd bonding now? Is that what this is?\nStiles drags in a slow breath, glancing around the wide room. None of the other wolves are in sight. Boyd would probably hear them coming.\n…Or smell them. Whatever.\n“So,” he murmurs, “you’re saying I shouldn’t be offended that a certain someone’s being even denser than usual.”\nBoyd shrugs.\n“Feel whatever you want. Just figured you should know how things are. Probably even worse for him than the rest of us; brain’s been wired that way his whole life.”\nStiles knows enough about wolves and scenting, has felt Derek’s nose dragging futily against his skin in Fantasies enough times to know Boyd’s probably right on point about that. He stabs at a bit of what looks like it might have once been broccoli, and it slides right back off his fork.\n“You could’ve helped him out then, told him who I am.”\n“Helped you out, you mean?” Boyd sounds skeptical, and Stiles grimaces.\n“Don’t really think it would be much of a favor.”\nThere’s a short pause, and then Boyd’s pushing himself back to his feet.\n“Think what you want. All I can say, he’s happier than I’ve ever seen him.”\n“Probably shouldn’t ruin his fantasy for him then, huh?”\nThere’s a quiet sigh and then Stiles is alone at the table, stabbing listlessly at his tray.\n\nHis chest is burning, aching, an agony of too deep claws and slowly knitting flesh. Ribs scream on every exhale; his skull aches dully, dizzyingly. And his Dreamer’s lips brush his temple, long fingers smoothing through his hair.\n\n\nA familiar scent, faint and spicy and safe, soothes him as much as the touch and he turns into it, moving feebily, head spinning with the slight motion.\n\n\nA voice whispers, soft and grounding and sure: “You’re ok, Derek. You’re gonna be ok. I’ve got you.”\n\n.-\nDerek groans against his Dreamer’s skin. Against his pillow. Against the maddening sensation of not enough, never been enough but overwhelming at the same time.\nSometimes he wishes he could just walk away from this. Be done with it. Wash his hands clean and move on because this, these stolen moments that aren’t really moments, this intangible connection that’s slowly taking over his life… it’s driving him insane. He gets lost in it, in the longing for it, in the wondering about it, until he can’t think about anything else.\nIt’s the not knowing that’s the worst part. He aches to open his eyes and see his Dreamer’s body under him. To know the sight of his skin, the scent of it.\nThe body shifts and Derek rolls with a phantom push, splaying out on his back and writhing against empty air as a familiar, plush mouth (his obsession’s mouth, a stranger’s mouth) kisses down his chest, unknowingly tracing the trail of his recently healed flesh.\nHe needs to give this up. He really needs to.\n\nHe grabs his Dreamer and drags him upward, pulling him into another breathless kiss.\n\n.-\nBoyd’s sitting on the couch when Derek drags himself, bleary-eyed, out onto the main floor too late the next morning.\n“Late night, boss?”\nThere’s no doubt that his betas had heard him, had been hearing him for days now. They’ve given up ducking out of the loft when it happens – it happens too often – and Derek’s too caught up in it all to really care.\nBesides, it’s not like he hasn’t noticed the two of them going at it, so they have no place to talk about sex scents or noises.\nDerek just grunts in response, going for the coffee, and fully expects it to be left at that. But Boyd surprises him, hitting a few more keys before setting down the laptop with a quiet sigh.\n“Been going on a while.”\nDerek’s fingers clench on his mug. He shifts along the counter, side-eyeing his beta.\n“It a problem?”\nHe’d expect this from Erica, maybe even from Isaac, but there’s a reason he’s always been most comfortable around Boyd. They have a silent understanding of… well, silence.\nExcept apparently not today.\nBoyd shrugs.\n“No problem.” He’s still looking at his screen like they’re not even talking. It helps a little. If he’s going to have a conversation with one of his charges about his own screwed up sex life, at least Boyd’s letting them get through it without eye contact. “Wouldn’t be a problem if you had someone around for real either. So you know.”\nIt echoes Derek’s own thoughts too closely. His loneliness, his increasing need for more than fast Fantasies and empty arms afterward. His hands start to clench, and he sets down the mug before it shatters.\n“Ok.\" Maintaining an air of calm he really doesn't feel. \"Good to know.”\nFor a few seconds Derek thinks maybe he’s done. Maybe he’s managed to escape this twisted heart-to-heart only slightly scathed. But Boyd seems strangely determined to keep this going, jumping to a new topic with an air of pointed casualness: “Stiles was over a few times last week.”\nJust that, and then he goes quiet again. Derek forgets his own no eye contact rule, turning to examine his beta because, honestly, where the hell had that come from?\n“Yeah.” His voice comes out too biting, too defensive, but he can’t make it stop. “Isaac’s taking up Scott’s free time. Stiles apparently can’t survive without human contact for too long, and that’s somehow my problem.”\nBoyd hums noncommittally at that. His eyes are determinedly fixed on his laptop so attempting a glare would accomplish absolutely nothing. Derek does it anyway, because he’s starting to catch where Boyd’s going with this, and it’s taking everything Derek has not to snarl at him instead.\nIs Boyd actually so bothered by Derek’s Fantasies, does he find them so utterly pathetic, that he’s trying to distract him with Stiles?\nDerek doesn’t want to be distracted. He doesn’t want to be pitied. He doesn’t want to come off as so sad and hopeless that his least interfering beta feels the need to pep talk him into getting a new playmate.\nGod, he just wants the Dreamer. The way he feels safe and wanted in those intangible arms. The way it feels like the realest, most caring relationship he’s ever had, even if he doesn’t actually have anything.\n…He just wants it to be real.\n.-\nDerek wouldn’t be able to explain the first thing they discuss at that night’s pack meeting. He’s been distracted all day, wrapped up in Boyd’s words and Peter’s lingering accusations and too many questions that don’t seem likely to ever find answers.\nStiles is there, because everyone’s there… Or at least, Derek would assume everyone’s there. Once the meeting starts he finds it strangely impossible to focus on anything but Stiles.\nOn the way he moves around the loft like he has a right to it, going to cabinets and finding what he’s looking for on the first try, flopping onto the left edge of the couch like it’s unquestionably his spot because… because it is his spot, isn’t it? And how had that happened?\nHe keeps glancing at Derek too, Derek catching too-long looks at the corner of his vision. Stiles is catching him too most likely (honestly, that's probably why Stiles is paying him any attention in the first place), until they finally find themselves staring at the same time, eye to eye. Before Derek can think of an excuse that sounds better than “I’m just trying to figure out when you became such a fixture in my life that even my betas are noticing, and what the hell that means” Stiles is quirking his lips apologetically.\n“Sorry, just… last time I saw you, your chest was kind of hamburger. It’s good to see you not, y’know, totally shredded.”\n“…You were there?”\nStiles’ brows hike up, his scent going sharp with sudden nerves. ...His familiar scent.\n\nA familiar scent, faint and spicy and safe.\n\nHow had Derek not noticed before?\nStiles' eyes slide to the other end of the couch, the part that still smells too much like blood, no matter how long Derek spent scrubbing it out.\n“Yeah, I was on ‘holding down the fort’ duty. Or holding down the loft duty, whatever,”\n\nLips on his temple.\n\n…But no, that had been the Dreamer… or maybe just a dream.\nFuck… everything from that day is messed up in his head. Muddled, confused.\n“When I woke up Boyd was here.”\nStiles still looks nervous, licking his lips quickly, heartbeat and scent spiking in tandem.\n“Yeah, I uh… I ducked out when he got back. You know me, with blood and guts and stuff.”\nDerek knows. And he knows that Stiles always stays anyway, for as long as he’s needed. And, more recently, sometimes even when he’s not.\nIt’s been years since Derek’s been close to someone outside the comfortable hierarchy of a pack. A person who isn’t bound to him out of blood or wolf bonds. He's not really sure how to go about it anymore. But maybe accepting that Stiles has become something to him - more than an ally, a friend, almost? - wouldn’t be completely terrible. If his conversation with Boyd is anything to go by, maybe he really does need it.\n“Thank you.” The words feel rough, unpolished, clumsy on his tongue. But Stiles smiles anyway, ducking his head as his scent goes soft and warm, so Derek figures he’s done something right.\nHe sees Boyd watching them from his place by the stairs, and rolls his eyes. He doesn’t need his beta watching over him like a nervous mother on her child's first playdate.\nHe can act like a civilized human being.\nIt’s not like it has to mean anything.\n.-\n\nThey wake up tangled together Sunday morning – Derek mouthing lazily across his Dreamer’s pale throat. He noses along the skin as the neck arches, a soft, fond hum dragging from it. The vibrations and low, contented sounds urging him on.\n\n\nThe body rocks backward: a long, lithe expanse of back pressing warm into Derek's rumbling chest, into his half-hard heat, rubbing a slow-burn friction as he kisses and licks from the nape to the hairline.\n\n\nHis Dreamer's already prepped and loose and ready the way he could only be in a Fantasy, and a hand’s reaching back to grab Derek’s hip, to guide him in, to help him sink into that incredible, tight heat with a groan.\n\n\nPerfect. This body’s perfect for him. Nothing’s ever felt, nothing could ever feel…\n\nHe whines, twisting onto his elbows, face buried in his pillow and one hand going around his aching cock as he rises up and slides again into that arching body, bottoming out against those slim hips, that tight ass. And then Derek’s pushing harder, hips snapping in sharply as his tongue laps up the spicy sweat starting to bead along his Dreamer’s nape, breathing deep and whimpering wild and needy as his lungs fill up with themthemthem.\n\nHis hands slide to grip his Dreamer’s wrists where they splay out above his head, grasping, white-knuckled, at the sheets. A hitched, breathless moan drags out with every snap, and the Dreamer’s legs are scrambling wider against the mattress, letting him sink in deeper.\n\n\nDerek can hardly think now, the sensations overwhelming as he fists his Dreamer’s dark hair in one hand, tugging his neck to the side and biting into his pale skin just to hear the startled sound, the hint of a laugh, the way it bleeds into a moan as he sucks slow bruises into it, tongue tracing the path of his moles up to his jaw.\n\n\n“Come on.” It comes out low and challenging and breathless, the free hand going back to grab Derek’s nape—\n\n—And wait, it’s wrong, this is wrong, that’s not how this works—\n—And it’s so goddamn good, having something to look at, watching that pale skin purple and bruise so prettily under his sucking mouth, to hear the faint grunts and needy sounds and whimpered encouragements… and to smell his partner, heady and spicy and familiar…\nHe comes so hard the world whites out, Stiles’ name a broken gasp into his mattress.\nFor a few seconds he slumps down against the sheets and his own quickly cooling come, a sleepy high slipping over him, leaving him loose and relaxed and so content…\nAnd then he’s scrambling off the bed, tense and sick and stumbling back in horror as though getting away from the scene of the crime could keep it from having happened.\nStiles. He’d imagined Stiles.\nHe’d assaulted Stiles.\nDerek had forced a Fantasy on him, an incredibly vivid, invasive Fantasy. He’d pinned him, bitten him, fucked him without his consent. Imagined his scent and skin and voice, imagined him wanting it, reacting to it, encouraging it.\n\nA phantom hand brushes, tentative, across his thigh—\n\n\n—And Derek smacks it away, pressing a panicked palm against his Dreamer’s mouth.\n\nHe can’t even think about his Dreamer right now. How he’d abandoned him halfway through sex to picture someone else. As though he isn't good enough, when he's all Derek wants.\nHow much of that Fantasy had been directed at his Dreamer and how much at Stiles? How many of the reactions had been real, fed back to him from the Dreamer, and how many had he made up himself, forced Stiles to act out?\nHe can’t remember.\nHow much of the time had he been picturing pale skin in front of him? How long had that scent been in his mind, in the air… that damn scent that had gotten into his head when he’d been hurt and confused, gotten under his skin, started muddling up everything?\nHe can’t remember.\nThey have similar body types, Stiles and the Dreamer. Lithe, long-fingered, about Derek’s height. How much of that had been consensual? How much with his Dreamer? Had any of it been?\nHe can’t remember.\nHe turns away and squeezes his eyes shut. Doesn’t throw up, but it’s a near thing. He’d forced Stiles. It might not be illegal, but that doesn’t make it any less wrong. There are fucking pamphlets warning against this.\n…Does Stiles know? Does Stiles realize who the Dreamer had been? Had he recognized the shape of Derek’s body against his skin?\nOf course he does. How could he not? How could you look at someone every day and not know them when they’re pressed up against you?\n…Or maybe he hadn’t. That would almost make it worse. The idea that Derek would be able to get away with it, if he wanted. The idea of having to tell him.\nThe hollow reminder hits him that Stiles has barely any experience with Fantasies. Derek’s heard him complain about it enough times, still remembers the way he’d stared at Derek that time during the pack meeting weeks ago, wide-eyed and curious and embarrassed. And now Derek had… he’d…\nWhat the hell had he been thinking?\nHe finds himself holding his phone, staring down at it dully. He should call Stiles. See if he’s alright. Apologize. Explain.\nTry to explain. How the hell can he explain in a way that will make any kind of sense? That won’t make him seem completely horrible?\n(No excuses there. He is completely horrible.)\nHe’d been longing for a scent and a visual to tie in with his Fantasies. Stiles’ scent had been on his mind so he’d pictured that, Stiles’ body was similar enough to the Dreamer’s to act as a visual model. He hadn’t realized what he was doing. Hadn’t actually wanted Stiles at all.\nHe hadn’t.\nHe wants the Dreamer.\n…Does that make this better or worse?\n.-\nIn the end he proves himself a coward.\nHe drops the phone, drags some clothes on, and forces himself out of his room on shaky legs.\nHe finds Erica painting her nails, grimacing at the overpowering acetone scent (“pain for beauty, boss-man”) and tells her to go spend a few hours with Stiles. He tries to make it sound important, official - “I have a feeling Satomi’s pack might try for payback again and I want our weak links covered.”\nThe two of them are close, the closest any of Derek’s betas are to Stiles, anyway. If he’s upset, having her around might be a comfort.\nMore of a comfort than Derek would be, anyway.\nHe watches Erica go with hollow eyes, resolving to stay as far from Stiles as possible until the last of these confused impulses fade.\nWhatever that had been, he won’t let that happen again.\n.-\nStiles rolls onto his back, a dizzy grin lighting his face, his fingers tracing over the phantom marks he can still feel all along his throat.\nWhat he wouldn’t give to have those bruises there for real.\nWhat he wouldn’t give to have Derek here next to him, pressing soothing kisses into the hot marks.\nHe’d thought the Fantasies had been good before (and fuck yes they’d been good before) but there’d been a whole different energy to Derek today. Before now, his mouth had always moved a little tentatively across his skin. Slow, dragging, longing. Like something was missing, like he was searching for it even as he’d shuddered to completion.\nToday he’d felt more alive, though, more… present, biting and licking and moving like he was really there with Stiles. Like everything was laid out before him and he was just taking it. Wanted it. Wanted whatever Stiles could give him.\nIt had been… there aren’t words. Words have officially been fucked out of Stiles’ head. He twists restlessly in his sweat and come-stained sheets, aching to reach out to Derek again. Wondering if it would be too obvious if he just decides to show up at the loft at nine in the morning. Maybe make breakfast with Derek, maybe spend the whole damn lazy Sunday together, watching movies and snarking in that softer, playful way they've been falling into, and maybe-accidentally falling asleep curled up against Derek's shoulder the way he had so many times in their Fantasies.\nMaybe just decide fuck it all, lean in and kiss Derek right there over breakfast. Maybe end up back in bed and get to experience all this for real.\nMaybe just let go of his fears and doubts and take a chance at everything he's been so desperately wanting, everything he knows Derek wants too.\n…No.\nNot yet. He’s not feeling brave enough yet.\nBut this morning isn't the only thing that has Stiles grinning like an idiot. Derek had been different last night too: following Stiles with soft, thoughtful eyes. Thanking him. Boyd had said that he's happier now, and Stiles feels like he’s finally getting a taste of that.\nAnd he’s starting to think the risk might be worth the reward.\nStiles’ blissful, lazy morning is interrupted when window slides open and Erica drops inside. She eyes him with a sideways look and a snort that’s enough to remind him he’s lying on his bed completely naked, with only a come-soaked sheet protecting what little dignity he has. He shouts (read: squeaks indignantly) and flails for her to turn around, until he realizes the movement’s just making the sheet ride lower.\n“Ok, what the hell? Is creeping on people’s private moments a general werewolf thing or a Hale pack specialty?”\nHe’s thinking about Boyd, slinking into lofts when he shouldn’t be and silently appearing at lunch tables for unwanted pep talks, but then his mind drags up an image of Derek dropping into the room, finding Stiles naked and waiting, and his body starts going hot and flushed for a whole other reason.\nErica’s lips curl.\n“You’re seriously overestimating yourself if you think you’ve got anything to impress me, Stilinski.”\nWhich… no, no. Do werewolves have to smell every emotion, really?\n“That wasn’t for you.”\n“Sure,” she says it like she means anything but, like the idea of anyone being in her presence and thinking about someone else is ridiculous. And, ok, objectively it kind of is. It hits Stiles suddenly that he’s on his bed, naked, with a ridiculously hot girl standing over him, and he’s still only thinking about Derek. Which… god, not like he hadn’t known he’s fallen heart-first for the guy but he’d have thought there’d be some kind of interest there.\nGuess you don’t know how far gone you are until you’ve been tempted. Or… not tempted. He's not even a little bit tempted.\nCrap, he really is in love. Like, really in love. This isn’t just a crush or a fling or a fantasy. It’s Derek or nothing for him.\nThe idea leaves him flushed again, thrumming with nerves and a silly grin that won’t stop trying to fight free, and Erica’s rolling her eyes, dropping down onto his desk chair and pulling a bottle of dark nail polish from her jacket.\n“Single boys,” she mutters, despairingly, to the bottle. And then: “Is this seriously how you spend your weekends? Lounging in bed with yourself? I’d feel sorry for you all if you didn’t smell so damn happy.”\nYou all. You all. She’d said something like that before, about Derek smelling happy (disgustingly happy), and Boyd had said the same thing a few days ago at school. Derek’s happy. Stiles is making Derek happy. It’s not like this is news, what with the way Derek keeps coming back to him, clinging to him, seeking him out in all his darkest moments, but somehow it still feels like news. Outside confirmation. Even if Derek’s feelings are just for the Dreamer and not Stiles, part of Stiles is the Dreamer. He still has a right to be proud.\nAnd he’s feeling too warm and pleased after this morning’s round – totally instigated by Derek, by the way, Stiles had woken up to warm arms and lazy, nuzzling kisses, and he’s pretty sure every morning for the rest of his life is going to be a disappointment after that – to feel too bitter about Derek only wanting part of the package.\nHe drags the sheet more securely around his waist, nesting it into an only semi-indecent bundle around himself as he sits up. It looks like Erica only has to paint one hand – the other’s already been coated in dark polish. Which is… weird, right? She wouldn’t just decide to go running out halfway through her nail routine to sit here in Stiles’ room, would she?\n“What are you doing here, anyway?”\n“What, you mean if I’m not trying to get all up on that?” She gestures vaguely toward him without looking, and Stiles is well on his way to feeling indignant again for indignance’s sake when she continues blithely, “Not-quite-fearless leader sent me. He seemed seriously worried about your scrawny human ass and wanted me to check in on you.”\nWhich sends all his other feelings flitting to the background because a) the betas’ relentless slew of nicknames for Derek are freaking adorable, as is the sort of pinched grimace-slash-badly hidden smile Derek gets when he hears them use words like ‘boss’ and ‘leader’ b) Derek’s worried about him. Derek really, genuinely cares enough about Stiles to be worried, and c) if Derek is worried then, crap, that means there’s something for him to be worried about.\nHis heart’s still stuck on the second point though, fluttering out a little, victorious jig that feels way too much like a silent “fuck you” to the Dreamer. …The Dreamer who’s him.\nYeah, so Stiles might have one or two irrational jealousy issues going on. Might have been a little more bitter than he was letting on. He can’t bring himself to care though, because right now Derek's worried about him.\nHe clears his throat, hopes whatever tightness comes out in it sounds like concern, not sheer giddiness.\n“Derek was worried?”\n“Yeah, he was all weird-tense, kind of jittery. Said something about Satomi’s pack and sent me to watch over you.”\nBeing naked suddenly feels like a much bigger issue.\n“So Satomi’s pack threatened me?”\nBecause that would be well and far into the not cool spectrum. Much less cool than they’ve all seemed so far. Honestly, going after the vulnerable human sounds more like a Peter move than a Satomi one.\n“I don’t think so? It sounded more his Alpha-sense was tingling or whatever. He just wanted you looked after in case.” A huffed sigh. She lifts her wet nails to examine them in the morning light. “As though I don’t have better things to do with my day.”\nStiles would sympathize, he really would. But he’s too busy being caught between rolling his eyes and wanting to smother Derek with tiny kisses for playing the overprotective alpha role so predictably.\nFor him, though.\nHe might just let himself go enough to brush an excited kiss over Derek's mouth--\n\n--And is rewarded with a quick, impatient \"wait\" for his troubles.\n\nHe gives in and rolls his eyes.\nErica sighs again, and Stiles finds himself grinning.\n“Hey, I mean, if there’s a threat you know what would be a lot safer than my bedroom?”\nMaybe he’ll be able to have his Sunday breakfast with Derek after all.\n.-\nThe problem with feigning a crisis, it turns out, is that the pack reacts as though there’s actually a crisis. Derek would probably be proud if he weren’t too busy feeling in equal parts numb, nervous, and unbearably guilty.\nBy ten o’clock word has gotten from Erica to the rest of the pack to be on alert, and not an hour later Derek has a loft full of armed and tense teenagers waiting for an attack Derek can’t bring himself to say is unlikely to ever happen.\nIt’s selfish – making his pack suspicious of Satomi’s, fueling tensions for his own personal gain. He’s as bad as Peter. He should just come clean. Obviously he should come clean. It’s the decent thing to do.\nBut the second Stiles steps into the loft, catching Derek’s eyes and giving him a small, sincere smile, he feels the confession catch inside him all over again. He can’t admit to his lie without admitting why he’d told it, why he’d actually been worried about Stiles. And just thinking about having that conversation…\n“Hey big bad wolves, ready for an old fashioned high noon showdown?”\nStiles doesn’t seem any worse for the wear, certainly doesn’t seem wary of Derek. Derek watches him, tries to pick out subtle cracks in his demeanor. But if anything he seems brighter underneath, biting down on little grins when everyone’s attention turns elsewhere. Derek can’t begin to make sense of it. Does he not realize what happened?\n...Is he ok with it?\nNo. No, Derek's not giving himself that easy an out. He doesn't deserve that.\n“We’re not having any kind of showdown,” he says, eyes falling away as Stiles looks back to him, grinning.\n“Ok, so we’re still in the wagon-circling phase. That’s cool too.”\nErica’s disappeared to a corner with Boyd, Isaac’s relaxing against the breakfast counter along with Scott and Allison. Even Jackson’s there, with Lydia at his side (or more realistically, him at hers). Stiles is hovering somewhere in the middle of it all now, edging closer to Derek as they keep up their back and forth. His scent is spiking through the room and Derek huffs out his next breath too hard, irrationally angry with the air for carrying that scent back to him. He falls back a step.\n“You don’t all need to be here.”\nStiles’ smile slips a little, but it’s Scott of all people who answers:\n“You’ve said that like fourteen times already, and we’re not going anywhere. Pack stays together in a crisis. We’re stronger together.”\n...Scott calling them pack. No matter how much time he's spent with Derek's betas lately, training with them and relaxing around them, and facing more than one threat to the town with them, he's never just come out and admitted to feeling like they were all pack before. At any other time it might have been enough to send Derek reeling. Now it feels like a slowly crushing weight.\nPack. Scott would never have said that if he knew what Derek had done. That he’d made an Object of his friend, Fantasized without even really wanting him. Using him as a cheap substitute for the person he actually wants and can’t have.\nIt hadn’t been a slip, hadn’t been a flash the way you could shrug off and forgive. He’d let it go on, lost himself in it, and worked them both to completion before letting Stiles go. And all because he’d been frustrated, lonely.\nAnd… Christ, it had been good. Had left him aching, boneless. Stiles’ taste, Stiles’ skin, how their bodies had fit together in a way he craved, a way only the Dreamer had ever come close to matching. Fuck, the feel of Stiles against him… it might have even been better than… no. No, he’s not thinking about that. He can’t let himself start to think like that.\nIt's not fair to anyone.\n“There's not a threat,\" he says, voice sharp, biting. \"Nothing’s… I don’t know if anything’s even happening.” Now on top of everything else, he’s feeling flustered. Losing control of the group, feeling the pack’s eyes resting on him, narrowing, searching. “Checking in on Stiles, it was just a precaution, there’s no reason to be…”\n“Hey,” It’s Stiles who cuts in, soft and reasonable and from so damn close that Derek has to look back at him, wondering how he’d cleared all that space between them. “If nothing happens, nothing happens. We’ll just spend the day watching bad movies and pack bonding, ok? No big deal.”\nIn the background, Jackson grumbles out some protest about how spending more time with this group of losers actually is a big deal, but Stiles is looking at him so soft and hopeful that his heart clenches. Maybe the best thing for Stiles would be a day with the pack. To relax, to feel safe. Derek owes him at least that comfort.\n“Fine,” he grits, and Stiles grins.\nThere’s an odd little flutter across his skin – the Dreamer’s arms, there fast and gone before Derek can relax into it or push them away again. He still doesn’t know what to do about the Dreamer, can still hardly bring himself to think about it.\nIt feels, as irrational as it might be, as though he’d cheated this morning. Even though he doesn’t know the first thing about the Dreamer, if they’re dating anyone, if they’re married, if they even begin to view what he and Derek share as any sort of relationship… Derek does. He probably has for a while, now. Maybe even since that first night after the fight with Peter. That first time he’d shown his true self, the first time he’d been comforted and soothed to sleep in those intangible arms.\nNothing else can even hope to come close to that, no matter how good Stiles smells or how perfectly their bodies fit together (if it even had been their bodies fitting so well. He still can’t remember how much of the Fantasy had been with Stiles. How far he'd gone in assaulting him, how much he’d betrayed the Dreamer).\nDerek’s in love with someone he’s never seen, someone who’s probably in another state or locked up somewhere or...\n…Or doesn’t want him. He can’t bring himself to truly believe that, not in the face of those spontaneous hugs and long nights spent caressing Derek to sleep. But there are only so many excuses he can give for the Dreamer not reaching out for him after all this time.\nUnable, or unwilling.\nAnd Derek’s in love with them anyway.\n“Hey,” Stiles says softly as – things decided - the rest of the group starts to turn their attention elsewhere. “You ok?”\nHis whole body has gone tense... and he can’t deal with this right now. With Stiles worrying about him, trying to comfort him. His guilty conscience strangles his voice as he grits “Fine. Stay here, eat whatever, do whatever. I’ll patrol the borders.”\nAnd before Stiles can protest – because he’s Stiles, and if there’s one single sure thing about him, it’s that he’ll argue against any instruction, even if it’s exactly what he’d just wanted in the first place – he grabs his jacket and ducks out of the loft.\n.-\nSo Stiles gets his lazy Sunday at the loft – even digs up the ingredients to make some rough approximation of pancakes – but all of it without Derek, who’s been mostly MIA since his freakout this morning.\nAt two he comes back long enough to check in, to confer quietly with Erica, Isaac, and Boyd, before slipping out again. He doesn’t meet Stiles’ eyes once, but to be fair it looks like he’s trying not to look at anyone or anything. All the wolves seem on edge, actually, and Scott admits in an undertone that Derek is sending out a constant buzz of tension in a way that’s part smell and part pack instinct. That his body’s screaming out like nails on a really squeaky chalkboard every time he’s nearby.\nAnd it’s not just the pack he’s ducking out to avoid, either. About half an hour after he leaves the first time, Stiles slides his eyes shut and lets his hand drift soothingly down Derek’s nape, pressing a soft kiss against his temple the way that never fails to uncoil his too-tense muscles.\nStiles’ lips barely touch him before a hand's being pressed over his mouth, shaking a little even in the Fantasy. And that’s it, no tapped out time to resume things later, nothing.\nHe tries not to let it frustrate him, tries again after Derek ducks out the second time, just a tentative touch to his shoulder--\n\n--and feels his lips almost bruise with the force Derek presses him back with.\n\nAnd the day had started off so well.\nHe slumps back against the wall with a thump.\n“How the hell is this pack protection thing supposed to work if the whole pack isn’t here?”\nThe room goes silent as the group turns to him. Boyd casts him a knowing look and Stiles flushes faintly, but then Jackson interrupts the tension with a snort.\n“Don’t get your panties bunched, Stilinski. There’s enough of us here to protect you.”\nWhich is so ridiculously not the point.\nDerek’s upset, and he’s freezing everyone out. Not just Stiles, not just the pack, but his Dreamer too. He must be seriously freaked about Satomi… except if he had anything tangible to be freaked about, he’d be warning the pack, right? Letting them prepare themselves?\nStiles wants to dive right back into a Fantasy, kiss comforts and questions into Derek’s skin until he finally finds out what has him so worked up. But Derek’s asked him to stop, and Stiles is only willing to ignore that request if he’s sure it’ll ultimately help Derek. Right now he doesn’t have the first clue what Derek wants.\nOnly Stiles’ new hyper-awareness of Boyd allows him to notice the beta shifting to the door. Stiles shoots him a grateful look that he returns as a longsuffering nod, and then he’s out the door after Derek.\nAt least he won’t be alone with whatever’s hurting him.\n.-\n“I’m fine here alone,” he mutters as Boyd sidles up next to him on the empty street corner. The younger man doesn’t react, just falls into step with him. Derek doesn’t even feign doing a border run, and Boyd doesn’t call him on it.\nThey wander the streets for three hours in silence.\nMaybe Derek doesn’t deserve the small comfort of company, but he can’t bring himself to push it away.\n.-\nBy that evening, the group seems satisfied that Derek’s phantom threat won’t be rearing its head this weekend. He’s received half a dozen texts informing him the pack’s all heading out – “trying to salvage at least a shred of this weekend”, Erica’s message had read – and finally feels safe going back to his loft.\nHe realizes his mistake the second he opens the door.\n“It’s a Peter thing, isn’t it?”\nStiles is still there, heart beating out steady and even, sitting cross-legged on his corner of the couch with half a dozen pizza boxes spread out in front of him.\n“Last time you got all freaked and tense like this it was a Peter thing.”\nOf course Stiles is still here. Stiles is always here, inviting himself in, making himself comfortable in other people’s lives whether they want him or not.\nDerek considers leaving again. Just walking right back out.\nHe slides the door shut behind him and leans back slowly against it.\n“It’s not a Peter thing.”\nStiles cocks his head, eyes narrowing.\n“Ok. Well, it’s not a Satomi thing because there’s been no sign of violence anywhere in town, none of the pack has smelled them nearby, and because if they were coming even you would have come up with a better plan than ‘have the pack all huddle together while I go on suicide runs.’”\nStiles has always been smart. Too smart. Derek doesn’t know how to begin hiding from him. He slides his eyes shut to try and escape, and all it does is make the world that much darker.\n“You should go.”\nStiles shifts slowly, sliding to his feet. His scent moves with him, sharp and spicy and soothing. It smells like a kiss on his temple, like long fingers soothing through his hair.\nIt smells like a betrayal to the Dreamer: the way his hands itch to feel Stiles’ skin, feel something real after all these weeks of empty arms.\nHe can't let himself think about Stiles that way. Can't even begin to imagine it.\n“Hey,” Stiles voice comes out soft, like he’s soothing something savage. He is, he just doesn’t know it. “Derek, we don’t even have to talk about it, ok? Let’s just eat some cold pizza, watch some TV. If you liked Firefly you’ll probably really love—”\n“I Fantasized about you.”\nHis eyes are still closed when he says it, when it tears out of him the way it’s been trying and trying not to all day. So he doesn’t catch Stiles’ expression, just a sudden uptick of a heartbeat, the way his scent sharpens with nerves.\nA long hiss of air ending in a quiet “…fuck.”\n\n.-Monday-.\n\nThe glowing numbers read 12:08.\nThe ceiling’s white above him, spidery cracks bleeding into spidery shadows, creeping across in the shifting moonlight. He’s lain like this enough times, knows the shapes they make across the ceiling early and late in the night, and all the times in between. There’s a complex story woven out in those shadows of branches, bleeding into the cracks. If he looks at just the right moment, it looks almost like someone’s standing right outside, waiting to be let in.\nThe quilted blue bedspread is soft under his restless fingers. He twists, sighs, recites as many digits to pi as he can before faltering, mentally lists off the known varieties of wolfsbane and their effects, plots out a rough outline to the paper that’s due a few days from now: an historical overview of the use of Fantasies as an information gathering device in times of war. Finstock will appreciate it… or he won’t. Whatever.\nThe beside clock clicks to 12:09.\nAnd Stiles isn’t thinking about Derek.\n.-Sunday-.\n“I Fantasized about you.”\nIt takes too long for the words to work their way through Stiles’ brain – a brain that fights at every turn to reject them.\nBecause… Derek knows. Derek knows.\nAnd that’s just… “Fuck.”\nThat’s not how this was supposed to go. Derek figuring it out on his own, hating Stiles for it. Because he obviously hates Stiles now. Is too horrified, too disgusted, to even be in the same room as him. Why else would he have spent the whole day freaking out like he has been, avoiding the loft, avoiding Stiles’ eyes?\nStiles has imagined this moment a dozen different ways: coming to the loft and confessing to Derek, or Derek having a moment of realization (however unlikely that seemed) and coming to him. Boyd letting something slip or Stiles, far more likely, letting something slip, or Stiles just deciding fuck it, grabbing him and kissing him until he couldn’t possibly miss the connection anymore… But however his hopeful daydreams had started, they’d always ended the same way: Derek being happy, taking hold of Stiles and kissing him breathless.\nNot looking at him like he is now: pale, horrified, the words slipping past his lips like they’re being gutted out of him.\n“I Fantasized about you,” he says again, slowly, as though he’s not quite sure Stiles had heard him the first time. His eyes are dropping to the ground, his head ducked like he’s scared (Derek. Scared.) or ashamed. And Stiles realizes with an odd little shock that time is still moving outside the stalled out space in his head, and he still hasn’t reacted. He needs to, needs to get on top of this, apologize. And he needs to not rush forward, not wrap Derek into a hug, no matter how much his instincts are screaming for him to, no matter how much he knows Derek secretly loves being held and cuddled and soothed.\nBecause that’s privileged information, and Derek never would’ve shared it with Stiles if he’d known. What the hell’s wrong with him? He should be apologizing.\nInstead, standing stock still, what slips out is a single, dry “yeah.”\nIt’s pathetic, a cop out. Why isn’t his stupid mouth working now when he actually needs it? He needs to explain, god, he needs to tell Derek what this means to him, all the thoughts that have been bubbling up in his head and these feelings writhing in his chest. He manages to get his mouth open – a confession’s on its way out any second, just wait – but Derek’s head shoots back up, brows furrowing, face paling even more as he rasps out: “You knew?”\n…And that was definitely supposed to be Stiles’ line.\n“Well… yeah.”\nHad Derek thought they’d both been in the dark, here, somehow? That Stiles had started off these Fantasies without even knowing who he was directing them at?\nIf anything, Derek goes even paler. He’s floundering, awkward, obviously completely out of his element (and why is that so endearing? It seriously shouldn’t be. Stiles obviously has emotional issues that need to be discussed at great length with a therapist). But he doesn’t look like he wants to eviscerate Stiles and have his entrails for dinner or anything. That’s encouraging, and Stiles tries to focus on being grateful for that, because the other option is thinking about how Derek looks like he’s going to be sick, and Stiles is pretty sure he’ll start crying if he thinks too hard about that.\nHe’s not about to start crying. He’ll hold on to that much of his dignity, at least.\nDerek’s eyes slide shut, and Stiles has to fight the urge to kiss him – his lips, his temple – to soothe his fingers through Derek’s hair. It’s almost a compulsion at this point, an instinct he barely knows how to check. He sees Derek hurting, and he wants to call up a Fantasy to make him feel better.\nBut that’s not ok now. Derek’s projecting all kinds of “not ok” vibes. He’s been screaming “not ok” all day; Stiles just hasn’t known why until now.\n“I’m sorry,” he murmurs, and he is (but god he’s not). “Derek, I… fuck, I should’ve said something earlier, I should’ve stopped—“\nDerek makes a fast, aborted motion – like he wants to move toward Stiles and checks himself.\n“Stiles, it isn’t your fault.” He sounds wrecked, horrified. Guilty.\nAnd Stiles thinks maybe it starts to hit him then, a wild little flutter beginning somewhere deep in his chest as Derek, hands clenching, continues: “I should have stopped. I didn’t think about what I was doing until it was over, but that’s no excuse. I just… you’ve been around so much lately, and your scent was in the loft. When I was hurt you were there, and I think some part of me latched onto that. So I—“\n“You Fantasized about me,” Stiles cuts in, a little awed. And for the first time, he actually hears it. Not the words he was afraid of Derek saying, not what he’d expected him to say. “You Fantasized about me.”\nDerek’s looking at him probably the same way Stiles had just been looking at Derek, like he’s not sure he’s been paying attention, or he thinks he might just be a complete idiot. But that’s ok because they’re both idiots and Derek had Fantasized about him anyway.\nDerek hasn’t figured anything out. He doesn’t know who the Dreamer is, and he’d still decided he wants Stiles. This morning had been about him. Had been Derek picturing him. And it’d been the best damn Fantasy they’d ever had.\nSuck on that, Dreamer.\n.-Monday-.\nBy four AM he’s given up on sleep entirely, burying himself in Wikipedia articles. They manage to distract him until dawn light’s creeping through his window, until it’s late enough to be distracted by school instead.\nAnd then he focuses on homework, on research, spends time fiercely with Scott until his friend starts to side-eye him… and none of it’s enough.\nLuckily, when his mind wanders it has more important places to go than to Fantasies. The memory of that last conversation – Derek’s eyes, Derek’s words – is enough to deter any urges.\n.-Sunday-.\nHe realizes he’s grinning now, probably looks like a crazy person. Almost feels sorry for Derek, who has absolutely no clue why Stiles’ mood has changed so drastically, why he’s biting his lip and fighting back a giddy laugh… Because he’s been so fucking jealous of himself, as stupid as that is, and now he doesn’t have to be. Now Derek wants him, really wants him. And he can tell Derek, and they can both have this in the flesh and be happy. And, god, he needs to kiss Derek now, for real, get his mouth on him so Derek can finally understand and everything will be good, amazing, real…\nHe’s up against Derek before he even thinks about it, leaning in to get his mouth on him…\nBut Derek flinches away at the last second, gripping Stiles’ arm and pressing at his chest, not pushing him away but not letting him closer.\n“No.”\nNo? Seriously? How about ‘no way in hell should they be stopping right now’?\nBecause they could be kissing, ok? They should be kissing, and they should never stop kissing, unless they’re doing other, more interesting things with their mouths, and maybe Stiles sounds a little plaintive as he lifts a hand to catch Derek’s wrist, thumb tracing along the edge of his palm, but he can’t help it. This feels like the most vivid Fantasy he’s ever had, like it might shatter away any second, and Derek’s just standing there, holding him back, telling him no?\n“But you want me.”\nHe needs this. After weeks of thinking he’s not good enough, he just needs Derek to be happy with him, not wincing and avoiding his eyes and disentangling himself from Stiles’ grip like it hurts to touch him.\n“I’m sorry,” he says again, and it sounds so sincere, and that just makes it worse. Derek doesn’t do sincere, not with Stiles. They snark and they bite, and underneath it all is this comfortable rapport that defines their whole relationship. He insults Derek, Derek insults him. That’s how he knows they’re ok.\nBut now Derek’s treating him like he’ll break and he doesn’t know what to do with that. How to reassure him, how to make this ok.\nSo he lets Derek move him, lets him step out of Stiles’ space, and echoes dully: “You’re sorry.”\n“I didn’t mean for it to happen. Stiles, I don’t…”\nDerek falters again, shoulders tense and, god, Stiles could shake him. He’s still doing that pointless guilt tripping thing, as though there isn’t already enough weight on his shoulders. Why does he constantly feel the need to add more?\n“It’s ok, though,” Stiles tries, weak and wrong-footed. He’s never felt less prepared to talk about anything in his life, but he needs to. Derek needs to stop feeling guilty. It’s all or nothing time and fuck, that’s terrifying. “I’m… Derek, I’m ok with it. I mean, if anyone would be ok with it it’d be me. I’m—“\n“You shouldn’t be,” Derek cuts in. “I’m not.”\nWhich stalls Stiles again, leaves his gut twisting sickly.\nHe’s never let himself feel really bad about this, not the way he probably should have. Derek’s been too into it, giving back as much as he’s taken. But there’s no denying that Derek thinks doing this is wrong. So what the hell does Derek think of him? Of the Dreamer? He wants him, yeah, but does he like him? Does he respect him?\nCan Stiles stop thinking in the third person about himself before he completely loses his grip on reality?\n“I…I don’t…” He starts fast and stutters to a halt, not sure where to go and feeling his chest, his throat, start to close up thickly. “Come on, Derek, if someone wanted you like that… If someone Fantasized about you, would you be ok with it?”\nBecause that’s all he’s holding on to now: that Derek’s seemed ok with it. He needs Derek to have been ok with it.\nDerek’s lips are thinning out. He’s glaring at the far wall like his gaze might burn a hole in it and let him bolt. Escape this conversation.\n“…It depends on who did it.”\nIt’s not a flirtation, definitely not an invitation. But Stiles’ tongue flicks out, lips dry, and he can’t fight the masochistic urge to ask:\n“And if it was me?”\nDerek’s eyes slide to him and away again.\n“You don’t want me, Stiles. You just wanted someone to want you.”\nIt hits Stiles hard enough to have him flinching. His fists are clenched white at his sides, and he’s not even sure who he’s angry at. Derek, with his stupid, thick-headed obliviousness and those soft, sincere eyes, or himself for screwing this moment up so badly.\n“You have no idea what I’m feeling.”\n“I know exactly what it’s like to be a teenager and to think you’re wanted. How it can become the most important thing in the world, blind you to what’s really—“\n“So explain that Fantasy, Derek.” His voice is thick, eyes hot with building tears, his fists shaking at his sides… and he’d promised himself he wouldn’t cry but he can’t help it. This is all going wrong, worse than he’d ever imagined, because even in his worst fears of being rejected at least he hadn’t broken down like a sobbing child in front of Derek. At least he hadn’t begged. “Explain how it was that good, how we fit together that well, if you don’t want me. How you even reached out to me at all. It was… you can’t fake that, ok, so just—“\n“Sometimes a Fantasy is just a fantasy, Stiles.” Derek’s voice comes out dry, dull, brooking no argument. “You’ll understand when you’ve had more experience.”\nIt’s a slap in the face, a reminder that Derek looks at Stiles and just sees a stupid, inexperienced kid. Stiles thinks he probably knows Derek as well as anyone can at this point… and Derek still doesn’t see him at all.\nHe’s not even surprised to find himself laughing, fast and bitter.\n“Of course. Right. I mean, why the hell would you want me, huh? You’d probably go for someone quieter, less annoying. Someone who stays out of your face, who you could use for a quick fuck and ditch whenever you don’t want them.”\nStiles versus the Dreamer, and the Dreamer wins out. Of course it does. He’s always known it would. It’s all the parts of Stiles that Derek wants, without any messy, annoying bits crowding in.\nDerek lets out a sharp breath, jaw clenching, frustrated.\n“Stiles…”\nIt’s nothing but blatant pettiness that has Stiles gripping Derek’s neck and kissing him hard, cutting off his words and licking in, fast and thorough. Derek’s breath punches out as Stiles’ chest surges up against his, his eyes going distant, head bobbing in a little, aborted motion to chase lips that aren’t there.\nAnd then Stiles is pulling back, leaving Derek a little bit dazed and a lot wounded as he snaps: \"Fuck you, Derek. I’m not a child. And I’m not the one who can’t decide what he wants.”\n.-Wednesday-.\nThe loft feels strangely empty.\nIt’s stupid to feel this way after only a couple of days. To feel this way at all, honestly. His betas are still around as much as they’ve ever been, Peter’s around more often than Derek could ever want him, and it’s not like he’s ever needed more than that before.\n…Except somehow along the way, Stiles has started fitting himself into Derek’s life – filling up the empty spaces with his presence and energy and noise. Derek hadn’t even noticed it happening, too caught up in other distractions to realize how much he’d started craving Stiles’ company in the moments when his world gets too quiet and his thoughts get too loud.\nHe can still feel Stiles’ fierce kiss in his mouth. The way his whole body had burned with the phantom contact, with the urge to just forget all his convictions and shove Stiles back against the nearest hard surface and kiss him for real.\nBut he couldn’t. It wouldn’t be fair to Stiles, to the Dreamer, to anyone.\n\n“I’m not the one who can’t decide what he wants.”\n\nThat’s why all this had started, hadn’t it? Because Derek had tried to think of the Dreamer, and had wanted Stiles instead.\n…Wanted a visual, wanted a scent. Not wanted Stiles.\nChrist, who is he kidding?\nBut he cares about the Dreamer, as intangible as they are. And he firmly believes that Stiles only wants to be wanted, wants a second chance at the sensations he’d experienced in the Fantasy. He’d never had that before; it only makes sense that he’d latch onto the first real Fantasy he’d experienced, that he’d try to build it into something more significant than it was.\nIt has nothing to do with Derek. Stiles had never thought of Derek before Sunday morning, after all.\nHe tries to distract himself with the television, finds himself scrolling restlessly through Netflix options until he wants to hurl his remote at the screen. He goes out for a run instead.\n.-\nLate at night on a Wednesday, Stiles feels the first, tentative touch. Fingers brushing over his arm, the ghost of a breath against his cheek. \nDerek reaching out to the Dreamer. Stiles doesn’t know if he should be pleased or insulted it’s taken three days for Derek’s attention to be drawn back here.\nHe lies still for too long, letting the mouth trail along his throat. Small licks and dragging teeth, warm hands settling on his sides, thumbs trailing across his bare ribs and—\n\nHe pushes Derek away, shoving a hand against his lips.\n\nThe phantom touches vanish.\nHis pillow’s damp when he finally drifts to sleep.\n.-\nDerek can’t blame the Dreamer for freezing him out. How many times had they reached out to Derek on Sunday, only to have Derek push them away? And then he’d been distracted, spent three confused, wretched days before he’d worked up the courage to try reaching out again. There’s only so much even the most patient person could take before they decide to move to an easier Object.\nAnd Derek can’t forget that, whoever they are, they’ve still made no effort to find him. To reach out in the real world, to turn this into something more than illicit rendezvous in their own minds. Who’s to say they ever wanted anything more?\nSometimes a Fantasy is just a fantasy, after all.\nMaybe it’s time to try taking his own advice.\n.-\n“I’m just saying, you seem weirdly quiet this week, dude.”\nScott’s sitting in Stiles’ desk chair, leaning forward, hands clasped, while Stiles stares dully at the cracks in his ceiling. He hasn’t bothered to move since Scott had let himself in. In hindsight maybe that’s a little telling, but it’s hard to bring himself to care.\nHe lets out a long breath.\n“You know how after you and Allison broke up, you guys always said Fantasies got you back together?”\nHe senses more than he sees Scott shifting, worried vibes bleeding off him as he lets out a tentative: “Yeah. She said she wanted to keep her distance, but I knew she kept thinking about me the whole time she was in France. Probably wouldn’t have been brave enough to go talk to her otherwise. And they helped her remember I was still the same person, werewolf or not.”\nStiles nods, lets his eyes slide shut. Wonders if it would be out of line to demand a few pints of ice cream and a movie marathon for a breakup of a relationship that never really existed. Wonders if he’ll be able to watch Marvel at all anymore without thinking of Derek’s reactions to the films.\n…Oh god. Derek’s killed Firefly for him, hasn’t he?\n“Well, no offense to your whole epic love story, but Fantasies suck.”\nThere’s another short pause and then Scott’s moving, flopping down onto the bed next to him.\n“So this is about that whole secret Fantasy admirer thing. Did you figure out who it is?”\nScott only knows as much about this as anyone does – that Stiles has run out of class a few times because of Fantasies. He hasn’t pushed Stiles for more, beyond a few good natured jibes, and Stiles had never been more grateful for his friend’s distractible nature. Now he’s wondering if maybe Scott had just been waiting for him to bring it up first.\nHe shrugs, eyes still closed. It’s safer there, behind dark lids. The cracks in the ceiling paint are starting to seem too much like a metaphor for his life.\n“Doesn’t matter now,” he answers dully. “It’s done.”\nA slow breath.\n“Is that a good thing? Or…”\nHis shoulders twitch again, and Scott trails off.\nThere’s a flutter across his skin – across town, Derek thinking about the Dreamer for a second before cutting it off. It’s been happening all day, since the aborted attempt late last night. He knows Derek’s not doing this on purpose, not trying to reach out to Stiles – it’s just flutters of touch, over too quickly to be intentional – but it’s slowly driving Stiles insane, fueling his misery with a reminder of exactly what Derek doesn’t want from him.\nHe forces his eyes back open.\n“If Allison had ever Fantasized about you, and you didn’t know it was Allison, would you be mad at her?”\nHe turns his head slowly, finds Scott staring at him, incredulous.\n“If it was Allison, how would I not know it was Allison?”\nStiles’ question exactly. He sighs, gaze drifting.\n“Ok, then say it was… Isaac. Say Isaac Fantasized about you.” Except, that’s not the right comparison either, is it? “I mean… no, scratch that. Say someone Fantasized about you, and you were into it, and it was someone you knew, but you didn’t know it was them. And I know it’s not ok to Fantasize about people without permission, but like… would you be mad at them?”\nScott’s still staring at him, like he’s trying to piece it all together. And Stiles has just handed him a few fairly major pieces and maybe this was a terrible idea, but Stiles is going slowly crazy here, and if he can’t confide in Scott then who can he confide in?\nAfter a few beats, Scott slowly pushes himself up to sitting.\n“Dude. Has Isaac been Fantasizing about you?”\n“What? No. And might I add, ew?” Ok, maybe not ‘ew’ but… yeah, definitely ew. “Isaac and I aren’t on each others’ radars like that, man. Trust me.”\n“So…” Scott’s brows scrunch up thoughtfully. His lips quirk. “Oh, wow, is it Jackson? Is that why he’s been such a dick about the whole thing? Because that actually—“\nStiles grimaces, tongue going out.\n“Oh god, wow. No, please don’t, and I officially retract my ‘ew’ about Isaac. This conversation has moved to places I never want to think about again, and I’m kind of afraid of your brain right now, buddy, so let’s just—“\n“Hey,” Scott catches his arm and Stiles cuts off, glancing back to find Scott watching him, earnest and soft and sincere. “Look, just… seriously, though? Love doesn’t happen the same way for everyone. And the whole Fantasy thing’s such a grey area, that’s why everyone has such a hard time making laws around it. Some people might’ve thought me and Allison using Fantasies to get a read on each other when we were broken up was creepy; we thought it was romantic.” He smiles, a little embarrassed and a lot happy, and Stiles has never been so jealous of him. “So just… don’t get weighed down in what’s right or wrong or whatever, ok? There’s just what you and this Dreamer person are comfortable with. That’s all that matters. I mean, who cares how you guys started out, if you end up finding each other and making each other happy?”\nWhich would kind of be amazing advice, if Derek actually wanted him.\n.-\n“Ok, you’re reaching whole new levels of not having a life right now, Derek. I wouldn’t bother saying anything but, you being my alpha and all, I’m pretty sure it reflects badly on me if you go totally off the rails.”\nDerek doesn’t bother looking up from his latest set of pushups – one handed, foot tucked behind an ankle just to mix things up – as Erica breezes into the room and pauses to stare at him. There’s no point in stopping. He can tell without looking that Erica’s got one hand on her hip, lips pursed and brow arched skeptically. She’s got a total of one judging expression, and to be honest she doesn’t need another.\nBut then…\n“Shouldn’t you be at school?”\nA quiet snort.\n“School ended two hours ago, boss man. And you woke me up an hour early this morning with your stupid workout noises, and I get the feeling you haven’t stopped since.”\nHe pushes himself back up to his knees, squinting past Erica to find the sun starting to go low in the sky. He’d started some time before dawn. Thinks he’d probably stopped for water at some point – there’s an empty glass sitting on the table.\n…So, maybe moving on and moving forward hasn’t been going as smoothly as Derek had hoped.\nErica settles down onto the couch in front of him, legs crossing under her and head tilting curiously. Past her cool expression Derek can pick out honest worry, and it irks him to know he’s the cause of it.\n“You seriously have no clue what time it is?”\nHonestly, he hasn’t bothered to keep track. It hasn’t seemed to matter. All he knows is that he couldn’t sleep last night, that every time his mind had started drifting – to the Dreamer, to Stiles, to the complicated mess of things he hadn’t realized he needed until he lost them – he’d pushed it away and pushed himself harder.\nHe hasn’t hit his limit yet.\nAfter the fire, he used to work himself to exhaustion, pushing hard for hours until Laura forced him to stop, eat, and rest. And if she wasn’t around, until he just collapsed, too exhausted for the nightmares to find him.\n…Or for his half-conscious, lonely, twisted mind to seek out Kate, the woman he’d been so sure he’d loved. He still feels sick at the thought of it, of the shameless Fantasies he’d doted on her while she plotted his family’s deaths. The way he’d still sought her out from time to time even afterward, missing her… or who he’d thought she’d been.\nStray flashes are to be expected after any breakup; that’s common knowledge – the mind reaching out to the other out of habit. …But most relationships don’t end in mass murder.\nExhaustion had been the only way to block out the noises in his head, to make sure his treacherous thoughts didn’t betray him.\nAs an alpha, with more strength and stamina than he’d ever had as a beta, he’s never managed to reach his breaking point. But judging by the expression on Erica’s face – and the way the whole room’s starting to go fuzzy behind her – he’s getting close.\n“Hey,” she sounds softer, suddenly, than he’s ever heard her: concern clear in her expression and not just hidden under layers of too-cool indifference. “You don’t need to push yourself this hard. I know your territory’s been threatened and that’s probably got your alpha senses slamming into overdrive, but we’re handling it. We’ve been handling it. What we can’t handle is our alpha working himself to death trying to prove how tough he is.”\n“Erica.” For the first time, Derek notices Boyd standing by the doorway, backpack still slung over one shoulder, brows creased in a searching frown. “Let him be.”\nUsually, a word from Boyd is enough to pull Erica off whatever track she’s barreling down, but this time it just seems to rile her. She shoots smoothly to her feet, scowling as Derek pushes his way up as well, nearly tripping over the open air when his vision darkens at the sudden movement.\nYeah, he’s definitely approaching his limit, alright. At least he won’t have to worry about slipping into a Fantasy before he passes out. He isn’t sure who his mind would reach for, and there isn’t a safe option.\nMeanwhile, the concern in Erica’s eyes is bleeding into indignance, frustration, and Derek really hasn’t been paying attention for the past few days if he hasn’t sensed this coming.\n“No. Look, whatever the hell you’re brooding about, fix it. You’re not some lone wolf, Derek. You can’t disappear on us like this. So whatever shit’s going on with you that apparently Boyd knows about but I’m not good enough to be let in on…” She pauses, tossing her hair, aiming a scowl Boyd’s way. “Whatever. I don’t care. But get your shit together, Derek. I mean it.”\n.-\nDerek forces down some food and crashes for six straight hours. When he wakes up he’s restless, anxious, itching for a run.\n“Get your shit together, Derek.”\nHe groans, scrubbing his tired face with one hand.\nWhatever else is going on in his life, whatever messes he’s creating, whatever he can or can’t salvage, he owes it to the Dreamer, to give them one more chance. God knows he’s pushed them away enough times.\nSo once more, and then he’ll stop dwelling on it. It’s time to really move forward, one way or the other.\n\nHe reaches out, a tentative thumb tracing across that sharp jaw—\n\n\nAnd gets smacked away, hard and fast and angry.\n\nNo hand to the lips, not so much as a “wait.” Just knocked away, dismissed. Done. Derek lets out a shuddering breath, forces his eyes back open.\nIt’s fine, he reminds himself. He’s been through much worse than this.\nHe sits up slowly, ignoring the hollow ache in his chest. He’d wanted an answer, and he’d gotten one. Now he just has to figure out something different to focus on, some way to keep his attention from going back to—\n\nThe Dreamer’s slamming into him, shoving him back against a hard surface as their mouths slot together, harsh and desperate and punishing.\n\n\nDerek groans into the bruising contact, taking it, taking whatever he’s offered because he’s wanted this so badly, he’s missed it so—\n\n\nThere are hands twisting in his hair, wrenching hard. Hands batting at his chest, angry and shoving before dragging him closer. Teeth bite at his lips and a knee hitches up along his thigh, the Dreamer practically climbing him with the frantic need to be closer—\n\n\nAnd Derek’s dragging him in, hands sliding up his back, clutching at his nape, still barely able to believe this is happening, that he has this again after days of floundering without it—\n\n\n…Their chests are flush together, and he feels the Dreamer’s breaths hitching. Feels dampness against his lips, on his cheek as he trails his stubble along that smooth jaw.\n\n\nThe Dreamer jerks at him, tugging him fiercely closer, but Derek freezes.\n\nThe Dreamer’s crying.\n\nThere’s a vibration of protest, the Dreamer shoving impatiently at his shoulder, teeth latching onto his neck and sucking hard, angry kisses into his skin… and the Dreamer’s crying. Derek doesn’t need to see them, to smell the salt tears, to know—\n\n\nAn instant later he’s holding the Dreamer carefully, cradling the slighter body against him.\n\n\nThe Dreamer lashes out again, gasping harshly into his collar, a flurry of fists with no leverage and no force behind them—\n\n\nAnd Derek holds them close, shushing against their ear, kissing into their neck, waiting all the time for an angry press to the mouth to dismiss him. It never comes.\n\n\nThey’re not against the wall (door?) anymore, curling together in a nest of warm bed and soft sheets. The Dreamer clutching at him as frantically as they’ve just been pushing him away. Lips moving restlessly against his shoulder, murmuring soundless words he can’t hope to make out between hitching breaths.\n\nAnd Derek just keeps holding them, hands smoothing down their spine, nose trailing along that long neck and wishing he could breathe in their scent. But all he can pick up are the echoes of the pack floating around the loft: his betas, Scott, Allison. Stiles.\nHe stops scenting, huffing his breath out before his thoughts can betray him again. He can deal with not having a scent, an image, a voice. He can take whatever the Dreamer’s willing to give him, as long as they let him stay.\n.-\nStiles wakes up the next morning to tear-streaked cheeks and the memory of Derek’s arms around him, and tries to convince himself it’s good enough. That he’s lucky Derek wants any part of him.\n\nHe reaches out and Derek’s there with him instantly, kissing him slow and deep, and it’s so good he can almost forget all the things he isn’t getting.\n\nIt can be enough. He can give Derek what he needs.\nLike Scott had said, love works differently for everyone. So maybe this is just how it works for him and Derek. As long as he can just keep his distance in reality, keep it all separated in his head, he’ll be fine.\n.-\nOf course, Friday night Scott finally gets around to organizing a pack night, and the whole thing’s absolute hell. Leave it to Scott to finally listen to Stiles the one time he really shouldn’t have.\nIt’s at Derek’s loft, and Stiles would have just refused to go, but Scott has enough pieces of the puzzle now to put things together if Stiles starts protesting too much. And no matter how much Stiles loves Scott, he knows enough about his hero complex to be sure he’d go to Derek to try and fix things, and that would be a whole new kind of nightmare.\nSo he goes, and does his best to act like it’s not killing him.\nThere’s absolutely zero chance that any of this had been cleared with Derek ahead of time, because he looks miserable – lurking in corners, avoiding everyone, and generally doing a less angry, more depressed imitation of himself from last year. Even his facial hair looks sad – an unkempt, scruffy mess that leaves Stiles wanting to cross the room and wrap Derek up in his arms so badly they physically ache in their emptiness.\nDerek’s avoiding looking at Stiles as much as Stiles is staring at him, and it’s a wonder that everyone in the room doesn’t know they’ve been not-quite fucking; that their misery is all projecting at, coalescing around each other. But Derek’s always been kind of the “lurk in dark corners” guy, and he’s probably not acting that different than usual if you’re not looking too hard for the changes.\nAnd Stiles is a master of smiling while he’s falling apart inside.\nBesides, the others are all distracted, having fun. Music and food and gossip, and Stiles thinks maybe some of them start dancing at some point. Maybe he’s even dragged out to join them. But at the end of the night all he can remember is the way Derek had caught his arm once in passing and breathed “I miss you” soft enough that Stiles almost thinks he’d imagined it.\nHe’d tugged away fast, eyes averted, sure Derek could smell the salt stinging in his eyes.\n.-\nStiles gets home, almost breaks a toe kicking his car tire in frustration, and hobbles into his room to collapse on his bed.\nBoyd’s already waiting there, hovering against the far wall by the window.\n“You know, another thing about wolves. Pack’s important to us. Loyalty’s important to us.”\nStiles rolls onto his back slowly, staring. What is his life, seriously, that he’s not even surprised to find werewolves hovering around in his bedroom, waiting to hand out zen life lessons?\n“If I was already with Erica and someone else came along and was into me, I wouldn’t let myself even think about being with them, even if they were as hot and smart and funny as she is.”\nBoyd grimaces a little as he talks, like imagining anyone being as good for him as Erica is a totally baffling concept. Stiles lets out a tired sigh.\n“That’s great for Erica, dude. Glad you guys are happy.”\nBoyd just looks at him, eyes dark and judging in the shadowed room, as though he thinks Stiles is willfully missing his point. And maybe he is, but he’s had a crap week. He figures he’s entitled to be a little bit snarky about other people’s happiness.\nWhen Boyd doesn’t go on, Stiles rolls his eyes.\n“So you’re saying Derek’s so into Dreamer me that he won’t let himself think about being with me me. That maybe he would if he knew we were the same person. That I should, what, just jump in, risk everything on the off chance that he’d ever see me that way at all?”\n\n“Sometimes a Fantasy is just a fantasy.”\n\n\n“I miss you.”\n\nThe cracks in the ceiling are dark in the dim light.\n“I tried, ok? He just doesn’t want to hear it.”\nGranted, he hadn’t tried all that hard. Hadn’t said the words, just stood there letting Derek jump to his own conclusions. And judging by the look in Boyd’s eyes, he knows it too. “Look, how the hell am I supposed to know if he’d actually want me? How do I know this isn’t the best it gets?”\nLast weekend the choice had been taken from him. The moment had been thrown at him without warning, without a second to prepare or decide. What the Dreamer has with Derek right now is good, fuck, it’s good. Even if it’s making Stiles miserable.\nSo how the hell is he supposed to risk giving that up, risk having nothing at all?\nThere’s a shuffle in the shadows as Boyd moves back to the window, blocking out the faint light.\n“Hey, I’m just sharing a story. But has this last week felt good to you?”\nAnd he’s gone a heartbeat later, leaving Stiles alone with heavy thoughts and the weight of possibility.\n.-\nMaybe it’s inevitable that it happens tonight, the echo of Stiles’ skin fresh on Derek’s palm, his scent lingering in the loft: sad and longing, stinging with unshed tears. The way his body had moved when Erica had dragged him out to dance with the others – too-long limbs and restless energy, and way more captivating than it had any right to be.\nSo maybe it’s inevitable that when Derek falls into bed that night, his mind goes – a fast press of bodies – to Stiles instead of the Dreamer.\nJust a second of contact before he’s pulling back, cursing. Pushing himself out of bed, already fumbling for his phone to send out an apology…\nWhen a pair of fingers brush his lips. Soft, fond: wait.\n…What.\nStiles is staring at his phone before he even really acknowledges thinking about it.\nDerek’s name stares back up at him, black and judging in the shadowed room.\nAll the times Stiles has thought about just calling Derek: while they fumbled through communication in Fantasies, when the pressure of wearing two faces and not knowing how much was real had gotten to be too much… And now here Stiles sits, the echo of Boyd’s parting words in the air, and typing out a simple message has never felt so impossible.\n\n“Has this last week felt good to you?”\n\nSeriously, what kind of a question is that?\nThis past month has been kind of the most amazing experience in Stiles’ life. Reaching out to Derek and having him reach back, seeing Derek fight a smile and flush when Erica called him out on his “crush.” Sitting with Derek in the loft, watching movies, a hair’s breadth from leaning into him, from burying himself against all that muscled warmth for real…\nHas this last week been good?\nSunday through Wednesday, Stiles had felt dead inside. Empty, lost, the whole world a shadow around him. Had spent hours on end wondering where he’d gone wrong, and how he could go right, how he could make the shattered pieces inside of him fit back into some semblance of a person.\nOn Wednesday Derek had reached out to him, and Stiles had realized it was still possible to feel worse, because he knew all Derek had wanted was the Dreamer. He’d said point blank that Stiles should let it go, what they’d shared hadn’t been real.\nAnd on Thursday night Stiles had wanted nothing more than to hurt Derek, to hurt him like Stiles was hurting, for not seeing what was right in front of him, not wanting Stiles, not seeing how damn perfect they could be together if he just let himself accept it, let them be happy…\nAnd then Derek had had to go and care. Had felt the Dreamer’s misery and had stopped kissing back, stopped letting their bodies rock together and had just held him, soothed him, like he was wanted. Loved.\nStiles has never felt so amazing and so miserable in his life. Trust him and Derek to totally screw up falling in love, huh?\n…And then there had been tonight.\n\nUnshaved and mussed, eyes tired and red from too long not sleeping. Lurking in corners and avoiding Stiles’ gaze, looking haunted, like something’s been tearing at him all week.\n\n\nA hand shooting out to grip his wrist, a faint, urgent plea:\n\n\n“I miss you.”\n\nIf Stiles’ lies are making his own life hell, that’s one thing. That’s his choice. But this isn’t just about him.\n\nSleep-thick and longing, as clumsy hands catch at his sleeve: “who’re you?”\n\nThis is hurting Derek too, damn it. Boyd had come all the way out here because Derek’s been hurting. Longing for the Dreamer, missing Stiles. Stiles has been dragging Derek into the Fantasies, keeping all the facts from him, pulling away and blaming Derek for things that aren’t Derek’s fault.\nAll at once a hot body’s pressing into him, all muscle and power and comfort, fitting against him so perfectly he never wants to be anywhere else. It’s there for just a heartbeat, just long enough to drag a muffled whimper from Stiles’ throat and leave a wanting, aching heart in its wake.\nNo, these stolen moments aren’t enough. They’ll never be enough for either of them. It’s not fair to Derek… and, no, it’s not fair to Stiles, either. He can’t keep living this lie.\nHe fights the urge to kiss Derek back, to just fall into the Fantasy. To take and have and feel good again, to forget his misery and the need to decide for a little while longer.\nInstead, he chokes down an aching whimper and brushes his fingers across Derek’s lips: wait. \nHe has to do this now, before he loses his nerve. He slides out of the Fantasy, scrambling for his phone again.\n.-\n\nStiles.\n\nStiles’ dark hair, his mole dotted skin, his long limbs tangled against Derek’s body in that fast spark of Fantasy before he’d pulled back.\nIt had been Stiles. He knows he’d reached out to Stiles. He’s sure of it.\nAnd Stiles had told him to wait, touched his mouth. Used a signal only Derek and the Dreamer had any right to know about. Stiles had brushed his fingers so gently, so fondly, so casually over Derek’s lips, like he’d done it a hundred times before.\nStiles has to be the Dreamer.\nThe Dreamer is Stiles.\nDerek loses himself for too long in that one, circling thought, two pieces of a puzzle that shouldn’t ever fit together but somehow… somehow it makes too much sense, suddenly.\n\n“If someone wanted you like that… if someone Fantasized about you, would you be ok with it?”\n\nChrist, it had almost been a confession.\nBut then… no. No, that doesn’t… If Stiles is the Dreamer… if he’d been right here this whole time, looking Derek in the eye, in arms’ reach…\nDerek has to be wrong. Has to be mistaken. If the Dreamer had been here all this time and hadn’t told Derek…\nWhat’s that even supposed to mean?\nThe phone, still in Derek’s hand, buzzes to life, startling him so badly he nearly crushes it. And then he’s staring down at the too-bright screen and all he sees until it goes dark again is Stiles’ name. Stiles, texting him in the middle of the night, moments after he’d felt Stiles’ fingers (possibly Stiles’ fingers, he can’t bring himself to quite accept it yet) brushing his lips.\nHe shakes himself, activating the phone again, finally taking in the new message.\n\nWe need to talk\nThat’s all. They need to talk.\nTalk could mean anything. Talk could mean a new threat for the pack to take care of, a new creature Stiles wants to research for the bestiary he’s been putting together. Could mean something about last Sunday, about the way they’ve been avoiding each other since, or the way Derek had reached out tonight at the pack gathering and grabbed his arm, hardly thinking about it, and murmured “I miss you.”\nTalk doesn’t have to mean that Stiles is the Dreamer.\nThe Dreamer’s never bothered to talk to him before.\nThe screen goes dark again, then lights up on its own, buzzing out fast and painfully loud in the still loft as several messages flood in so fast Derek doesn’t know how Stiles even managed to type them.\n\n Can I come over? Tomorrow?\nplease?\nI have to just\nI won’t be weird. I promise. I just… we need to talk and it needs to be in person and it needs to be reallyreally soon ok?\nDerek stares down at the line of texts for what feels like a few seconds, a few fluttering heartbeats.\nSo, not about the bestiary, then.\nHe feels his breaths shuddering out fast, checks an instinct to reach out to the Dreamer, to find comfort in those sure arms wrapping around him.\nCan Stiles actually be the Dreamer? Stiles?\nDerek’s never so much as considered that it could be one of the pack. One of the people he sees day in and day out. Works with, fights alongside.\n\n…Stiles?\n\nBecause Stiles has always been beautiful in a way Derek knew better than to acknowledge – the lithe body, long fingers, big amber eyes and that mouth, soft and full and so capable of driving Derek crazy with a well chosen word. If Derek had let himself think about it, and there’s always been a hundred reasons not to let himself think about it, Stiles is his type in every way that matters. There’s a reason his mind had gone to him last weekend, why dragging their bodies together had left him sated in a way he can’t ever remember being.\nBut if the Dreamer is Stiles… how is Derek even supposed to broach that topic? How do you look someone in the eye and ask if you’ve actually been in some kind of relationship for the past several weeks without realizing it?\n…And if they have been? If Derek isn’t reading this totally wrong, if he hadn’t just been confused when he’d reached out tonight, or misinterpreted Stiles’ reaction… if the Dreamer is actually Stiles, then why the hell hasn’t he said anything? Why has he let things go on like this? Kept Derek in the dark? Kept everything in Fantasies when Derek has been right here waiting for him?\nThere have always been three options: can’t find him, can’t get to him, or don’t want to.\nThe phone buzzes to life again, loud and angry in his palm.\n\n Fuck Derek, you said you knew how to text\nThe frustration pushes Derek to respond in a way pleading hadn’t, punches him out of his shocked stillness. Whatever’s going on, whatever Stiles is thinking or wants or doesn’t, sitting here panicking about it won’t do a thing to change it.\nHis whole body feels strange, distant, shaky, as he flicks his thumb over two simple letters.\n\nok\nAnd drops the phone, slumping back down onto the bed and staring at nothing at all.\n.-\nHe feels too shaky to lie still, to rest on the bed he’s imagined himself on with the Dreamer too many times. Eventually he ends up pacing the loft, padding silently across the wood floor in idle, twisting spirals that share the shape of his dizzy thoughts.\nHe drifts past the couch they’d sat on together, eating takeout and watching action movies. That he’d bled on, barely conscious, while Stiles watched over him.\n\n“You’re ok, Derek. You’re gonna be ok. I’ve got you.”\n\nPast the table with the splintered wood in the shape of his clenched hand, where he’d first realized the Dreamer could share in his Fantasies.\nThe spot where he’d stood last weekend, telling Stiles he’d Fantasized about him. Where Stiles had stood, looking broken and fierce, when Derek had said it didn’t mean anything.\nHe thinks about going for a run, knows it will do nothing to quiet his thoughts. Doesn’t trust his feet not to lead him straight to Stiles.\nAnd he can’t. He’s not prepared. His head is too full.\nHe ends up in the shower, the white noise of the water drowning out his thoughts until it goes too cold to stand in anymore, and then he’s back in his room, staring at his clothes for too long – he’s going to see Stiles in the morning, his Dreamer, he’s going to see his Dreamer in the morning – until he pushes past the ridiculous nerves (it’s Stiles, Stiles has seen him a thousand times, it hardly matters what he wears) and ends up in a pair of dark jeans and a formfitting black tee, finds himself sliding his old leather jacket on like a shield until he reminds himself that he’s not dressing for battle, that the kinds of cuts Stiles might inflict when he gets here aren’t ones that can be dulled by leather.\nHe drops the jacket, stripping the shirt as well and finding his favorite soft red Henley instead. It’s cool out, he tells himself, and the shirt’s warm. That’s why.\nAnd then he’s out of his room again, pacing restlessly until dawn light starts to creep over the loft.\n.-\nBoyd finds him almost an hour later, still pacing, feet moving listlessly across the open space as though the motions, retracing his steps, will help him piece it all together. Will help him understand what this is, what Stiles wants.\nWhat Derek should say when he gets here.\nBoyd doesn’t say anything, just crosses his arms and watches Derek with patient eyes until he falters, looking up. Another piece slotting into place.\n\n“Stiles was over a few times last week.”\n\n\n“Wouldn’t be a problem if you had someone over for real.”\n\n“…You knew.”\nThe beta’s brows go up slowly, understanding flickering in his dark eyes. It’s as good as an admission.\n“You mad?”\nDerek thinks he probably should be. Anger, he understands. But these aren’t enemies, keeping secrets to kill him. And these soft, longing feelings that have been filling up his chest lately…\nHe lets out a slow breath, eyes sliding as he tries, and fails, to summon the familiar emotion.\n“He’s coming over,” he mutters finally, without venom. Sounding shakier, more on edge, than an alpha has any right to at the prospect of a lanky human coming to visit. “Just… take Erica and get out for a while.”\nIsaac’s already at Scott’s, and whatever this is, whatever Stiles is coming to say, Derek doesn’t need witnesses to it.\nBoyd agrees easily, taking a step back before pausing.\n“Don’t be too hard on him. He’s scared.”\nHe’s scared? As though he hasn’t held all the power here? Hasn’t been keeping secrets, making Derek fall for him and then sit here wondering if he’s wanted at all?\nCan’t find him, can’t get to him, or doesn’t want to.\nHe juts his chin in a quick, tight nod, and Boyd is disappearing up the spiral stairs, reappearing two minutes later with a scowling, sleep-ruffled Erica.\n“I hope whatever the hell’s going on, it’s worth interrupting my beauty sleep.”\n“You don’t need it,” Boyd says easily, which makes Erica stop glaring at Derek long enough to flash him a surprisingly shy smile.\nDerek looks away, heart clenching at the ease of the whole exchange, the soft looks they share only with each other, their fingers threaded carelessly together.\nIt’s stupid, and soft, and probably more than he deserves but he wants that. He’s wanted to have that with the Dreamer for so long. Just wanted them to find him.\nWhen he looks back, Boyd’s looking at him like he’s second guessing his decision to leave. It might have something to do with the new scar Derek’s digging into the wood table.\nDerek lets go, claws retracting.\n“I know,” he grits tightly. “Go easy on him.”\nAt least someone seems to think he has any control in this situation. That he’s not hopelessly caught up in it, prey to Stiles’ whims, to whatever he’s willing to offer. Derek will probably take anything at this point. He’s so far gone, and he doesn’t even know how he got here.\nBoyd shakes his head a little, while Erica glances between them curiously.\n“No, just… Happy’s not as hard to get as you think. Just let yourself have it.”\nAnd then he’s tugging on Erica’s hand, pulling her toward the door – “Wait, wait, is this about Derek’s whole gross Fantasy crush thing? Boyd, are we getting sexiled right now?” – while Derek blinks after, his nerves startled out of him.\nLet yourself have it.\nLike it’s that easy.\n.-\nStiles has probably changed outfits about twelve times before he finally forces himself to stop. Taken three showers – oh god, smell’s important to a werewolf, smell’s the most important thing, what if he uses too much body wash and Derek’s grossed out and just turns him down flat out, or gets too close and starts sneezing or – and completely emptied his closet all over his bed, hating absolutely everything in his life.\nHis dad had poked his head in and Stiles had blurted out something about spring cleaning, which that of course his dad hadn’t bought for a second. He’d let it go, though, probably figuring that with all the crap Stiles got up to, getting buried alive by his overwhelming collection of flannel would probably be one of the more pleasant ways to go. He waves Stiles off and heads to work, and Stiles ends up looking… like himself.\nWhich, whatever. That’s kind of the whole point of this conversation anyway, isn’t it? “Hey Derek, so you’ve wanted to know who your Dreamer is, right? Well, it’s just boring, skinny old me in my stupid print tees and frayed jeans and flannel and…” Oh god, what is he thinking? Is he seriously doing this?\nHis heart’s pounding too-fast, his breathing uneven, and—\n\nDerek’s breath is against his mouth suddenly, strangely shaky as their foreheads press together.\n\nStiles groans, clutching instinctively at Derek’s nape as their mouths dip together in a slow, steadying kiss.\nStiles probably shouldn’t indulge in this, shouldn’t let Derek do this right before Stiles goes over there and announces who he really is, but he needs it. It’s like Derek had known that he needs it. He lets go, slumps back onto his lumpy, flannel-covered bed, dragging Derek down with him, fisting into his hair and kissing deeply into Derek’s mouth, savoring it, trying to imprint the memory of the sensation against his skin while he still can.\nNot that he’ll be allowed to use the memory if Derek rejects him.\n…This could be their last kiss.\n\nHe rocks up into it, into the long, hard line of Derek’s body while Derek presses down and kisses just as desperately, a hand sliding down Stiles’ waist and setting his skin shivering. \n\n\nAnd then Derek’s easing up suddenly, pulling back and peppering a few strange, kitten soft kisses against his cheek and neck before stilling entirely.\n\n\nStiles lies still, eyes closed, soaking in the odd, quiet stillness until he can’t take it anymore. Then he’s reaching out, pulling Derek back toward him, and Derek lets himself be led, lets Stiles guide them into a deep, quiet kiss before pulling back again.\n\n\nAnd then his finger is on Stiles’ abdomen, tracing out a strange, wave-like pattern across his skin.\n\nHe pauses again, and Stiles almost wonders if this is a different Dreamer somehow. Because, even though he’s picturing Derek – lips wet, hair mussed from the tug of Stiles’ hands – all this pausing, these idle movements, don’t feel like Derek at all. Derek only ever moves with intent, driving toward some goal. That goal’s usually pushing them both closer to the edge, but now…\n\nDerek’s hand pauses, and he ducks down to kiss Stiles, strangely tentative. Then he’s pulling back again, finger moving, tracing out two quick, intersecting lines like a cross against Stiles’ chest.\n\n\nStiles is ready for the next kiss when it comes, and leans up into it, already bored with the new game, just wanting Derek’s mouth on him. Wanting his possibly-goodbye kiss long and dirty and not interrupted by whatever the hell fascination Derek’s developed with Stiles’ ribcage.\n\n\nWhen Derek pulls back a third time, he traces one long, deliberate line from Stiles’ breastbone to his belly button before leaning in again, not kissing Stiles this time, just breathing something soundless against Stiles’ cheek.\n\n\nHe cards a hand back into Derek’s hair, and Derek’s finger traces the same path it had before over again – breast bone to belly – before dragging toward Stiles’ left hip in a sort of L shape.\n\n…An L shape. Huh. Derek’s tracing letters into his skin.\n\n Derek’s breath dances against Stiles’ ear, his whole body still strangely tense and unsure as he kisses against Stiles’ neck and traces his next shape: a long, vertical line with three prongs coming off it, top, middle, and bottom.\n\nE\n\nBefore Stiles can even try to process, Derek’s mouth is on his again: licking in deep and dominating, short-circuiting Stiles’ brain so badly he almost misses the wavy line again, an echo of the first motion Derek had traced out. A long, drifting, snaking motion Stiles can identify easily as an S now that he’s feeling for it.\n\n\nSo S, then a cross, then a line, L, E S\n\n\nS t…\n\nStiles jerks so violently he falls off the bed, and he doesn’t know what he’d done in the Fantasy but Derek’s gone suddenly, and Stiles is left crouching on the floor, still panting, heart pounding, skin crawling with the echo of Derek’s hand. Those letters traced into his skin.\nHis own name.\nAnd then he’s scrambling for his keys before he can second guess himself, tripping down the stairs to the Jeep.\n.-\nDerek’s sitting on the couch when Stiles barrels into the loft, elbows on his knees, hands clasped, looking strangely vulnerable.\nHe’s not meeting Stiles’ eyes, gaze locked on his own white knuckles while Stiles stalls by the door, contemplating leaving it open for a fast exit, and deciding he’s not quite that much of a coward.\n“I was going to tell you.” It blurts out fast and clumsy, sounding too much like an excuse. “This morning, I mean. That’s why I was coming here.”\nDerek nods a little, head still ducked.\n“I figured. Your texts sounded… I just thought it would be easier that way, to let you know I knew.”\nStiles drags in a small breath – remember, keep breathing – managing one step forward before he’s freezing again. Part of him wants to bolt for the door, part of him wants to drop onto Derek’s lap and forget talking altogether, forget explanations and apologies and just kiss him until things are ok again.\n“A lot of things are easier in Fantasies,” he murmurs, and Derek finally looks up a little.\nHe’s trying so hard to school his expression, to play the big bad, invulnerable alpha, but his gaze can’t quite land on Stiles, sliding away like what he sees scares him, like it’s too hard to look. Stiles stands his ground, and resolutely doesn’t start crying.\n“I never understood,” Derek starts, low and gruff, after a too-long silence, “why the Dreamer wouldn’t just come to me. They knew who I was, knew I was in… interested.” His eyes squeeze shut over the uncharacteristic stumble. “If they weren’t finding me it was because they couldn’t or because they didn’t want to.” His eyes flick back open, and he’s finally found his alpha zen, it seems, because they’re cold and unreadable as they finally lock onto Stiles. “So I guess I know the answer now.”\nShit, no nono, that’s hurt in Derek’s eyes, in his tense tone, shielded by that blank wall, and Stiles can’t let that happen, can’t let Derek think—\nHe’s crossing the room without thinking about it, falling to his knees between Derek’s spread legs.\n“No, dude. Derek, that’s not…” His hand goes to Derek’s knee, falling again without touching. “That’s… I mean, yes, I didn’t want to, but not because I didn’t want to, I just—”\n“You were scared,” Derek cuts in, lips twisting in a quick grimace of a smile doesn’t reach his eyes. He’s looking away, whole head turned to the side to avoid looking at Stiles, and Stiles is trying to find words, wishing he’d planned this out better, made that bullet point list he’d spent half the night thinking about making but had been too jittery to get around to, when Derek’s jaw goes tight and he grits out “Did you kiss me?”\nStiles flinches because… what? And yes, obviously, and a lot more than that. But Derek inclines his head toward the far edge of the couch, mutters:\n“When I was wounded. I remember, I think… did you?”\nHis voice breaks a little, that small hint of vulnerability that means he’s breaking apart inside. And Stiles is moving without thinking about it, his hand lifting, pausing for a heartbeat when Derek flinches.\n“I just… like this.”\nHe reaches forward again, moving half on instinct to card his fingers through Derek’s hair. And Derek doesn’t move away this time, his eyes sliding shut as he sinks, trembling, into the sensation. Stiles’ lips brush his temple, and a sound drags out of Derek like he’s wounded.\n“Shh, it’s ok. It’s ok, Derek, I’m here. God, I…”\nHe kisses him again, soothing at the creases around Derek’s tightly closed eye. Barely thinking about the what he's doing, just wanting to make it better.\nAnd Derek’s still making noises – little, needy, half choked sounds – and his head’s turning, stubble grazing Stiles’ cheek as he nuzzles at Stiles’ skin, breathing in deeply.\n“God, it is you,” Derek breathes, like he still hadn’t been sure until that moment. “I can’t…”\nAnd then he’s pulling back, somehow getting to his feet and slipping around Stiles, moving to the other side of the couch like the armrest could offer some kind of protection.\nAll the vulnerability is gone from his tone as he spits out:\n“What do you want out of this, Stiles?”\nIt’s cold and wounded, and he’s drawing back in on himself and it hurts, it hurts when Stiles has seen those walls breaking down, felt Derek fall apart against him, trusting him, opening himself up and laying everything bare… and Stiles’ insides are twisting sickly, his mouth dry, his whole body tremoring with the need to comfort or run or just have Derek look at him like he doesn’t loathe his whole existence, and all at once the space between them isn’t enough. He’s pushing himself back to his feet too, stumbling away, the air too heavy, his own words choking in his throat as they come up in a sick, bitter rush.\n“At first I just… wanted you. You’re hot and I wanted you, and it felt good, and I wasn’t really thinking about it and what any of it meant.” Derek’s jaw is clenched so hard Stiles wonders that it hasn’t snapped, and he’s looking as though all his worst suspicions had just been proven true.\nStiles feels like he’s shaking out of his skin, wonders how this could go any worse. Wonders if he shouldn’t have just stayed home today and let his mountain of flannel swallow him.\n“Until that day in the pack meeting,” he goes on, the words tripping out now, fast and clumsy on his tongue. “And I realized what a dick move it was… what it was really like to have someone dote a Fantasy on you…”\nThinking about that day, remembering, it’s all too much with the feelings so close to the surface like this, and Stiles’ hand is gripping tight in Derek’s hair, their naked bodies grinding together as a hot mouth bites hungry kisses across Stiles’ throat.\nAcross the room, Derek’s eyes shoot up, dark and wild, and Derek’s hand is gripping his other wrist, holding him still as he writhes with desperate intent, not to escape – never escape – but get closer.\nA frantic noise tears from Stiles’ throat, and Derek drifts forward a few steps and doesn’t even seem to notice.\nThe flash of Fantasy fades – an echo of Stiles’ first Fantasy, the first time he’d ever been an Object, you don’t forget an experience like that – and Derek seems to slowly come back to himself. His gaze drags from Stiles’ neck to his eyes, and then away altogether, visibly shaken. Stiles’ eyes slide shut.\n“And it wasn’t fair,” he continues flatly. “I was gonna stop after that. I planned on stopping, but then you reached out and wanted me… the Dreamer—“\n“You,” Derek cuts in, firmly, and Stiles’ eyes fly back open. Derek’s finally looking at him, like he’s never seen him, like he’s hungry for him. That should be good, flattering, but it just cuts in painfully.\n“…Do you even actually want me?”\nDerek seems startled by the question, brows drawing together, eyes flitting all along Stiles before he lets out a sharp, bitter huff of air. His hands clench at his sides, shoulders rolling down, tense, and Stiles has seen Derek walk into a battle against a half dozen alphas looking more confident than he does right now.\n“I… Stiles, you’re all I’ve wanted for weeks. All I think about.” Another breath before it drags out, breaking with a force of effort: “I love you.”\nThe words hover, vibrating in the air like they’re shocked at their own existence.\nOr maybe that's just Stiles, because Derek's looking at him now, soft and strangely vulnerable, murmuring \"You had to know that.\"\nIt’s everything Stiles had wanted to hear, and he flinches back, feeling sick, fighting to shake the words off his skin. They’re not for him, not meant for him.\n“You love the Dreamer. That’s like… loving a mask. It’s not really me.”\nDerek wants some… fantasy. And now he thinks he should want Stiles, is trying to want Stiles. Oh god, the first romantic “I love you” Stiles has ever heard, and it’s out of pity.\nDerek’s shaking his head slowly, moving forward.  His confession, or maybe Stiles’ own panicked reaction, has done something to him, pulling the insecurities right out of him.\n“Of course it’s you.”\nStiles is shaking his head, fast and frantic, and Derek’s crossing the space between them in slow steps, a look of surprised understanding dawning on his face. And Stiles can’t move away, his breaths going sharp and too loud and he loves Derek, he loves Derek and he could probably have him right now because he thinks he’s supposed to want Stiles back.\n“It’s not me,” he breathes out, fast and shaky. “You’ve never wanted me.”\nHe’s just another in a long line of people who’ve manipulated Derek to get what they want out of him. And now Derek’s touching him, gripping his elbow as he tries to stumble back again, looking at him so softly.\n“Stiles, you… you don’t understand. You can’t lie to someone in a Fantasy.” Stiles knows that, everyone knows that, but apparently there’s something Stiles isn’t getting because Derek growls, low and frustrated, his grip going tight on Stiles’ arm. “You’re laid bare in them. I… Kate never Fantasized about me.”\nStiles twitches at the name, and Derek’s hand clenches again, before gentling. “I was too young to understand what that meant, that… anything she tried to do with me in a Fantasy would’ve given away what she was. You can’t put on a show in a Fantasy. Can’t be someone you’re not.”\nStiles swallows thickly, and Derek’s free hand lifts, brushes just barely along the edge of Stiles’ jaw.\n“That doesn’t mean—“\n“You showed me exactly who you are in the Fantasies. The way you’ve been there for me. That’s not something I… you’ve been there.” He pauses, blinking at Stiles wonderingly. “And you challenge me,” Bodies surging together. Arms twisting against Derek’s grip. “And your mouth…” Kissing wetly down Derek’s abs. Breathing soundlessly into his throat, “…never stops moving.”\nIt takes Stiles too long to realize Derek’s finger is actually brushing his lip, out here in reality. That Stiles is letting out faint, whimpering noises as the Fantasy flashes roll over him. Derek’s lips are curling just slightly, his eyes locked on Stiles, drinking him in. They’re longing eyes, a wolf's eyes, and Stiles has imagined Derek like this, looking at him hungrily, lovingly, with those dark, heavy eyes he’d glimpsed for a few seconds once during a movie night. But now that he’s seeing it for real, seeing Derek want him, let himself want him, he can’t believe he’d ever thought he could settle for his imagination.\n“Yeah,” he murmurs a little late, a little breathless. “I’ve been told it’s a character flaw. By you, I think. Like a hundred times.”\nDerek doesn’t even try to argue that point, lips twitching fondly as his thumb trails away from Stiles’ mouth.\n“Everything the Dreamer is, you are. I should’ve known it was you.”\nStiles’ hand has found its tentative way to Derek’s hip, fingering the hem of his soft sweater.\n“I didn’t exactly make it easy for you to look. I just…”\nDidn’t want to lose you, didn’t know why you’d want me.\nIt hangs in the air, unsaid, but Derek seems to hear it anyway. His hand catches Stiles’ chin, tugging up until their eyes meet.\n“This isn’t anything new, Stiles. These past few weeks, when you started just showing up here…” He shakes his head, glancing away. “My head’s too loud sometimes, there’s too much… and the world’s too quiet.”\nStiles swallows, hand going tight in the soft fabric. His tone aims for casual, fails miserably.\n\"So you’re saying you secretly like my rambling.\"\nHe doesn’t really believe it until Derek looks back, and the look in his eyes is as honest as any Fantasy.\n\"I didn’t know who you were until last night, and I’ve missed you, missed Stiles, all week.” Which has Stiles’ heart starting in on a frantic little flutter-dance even before Derek leans in, pressing his lips against Stiles’ ear the way he’s done so many times in their Fantasies. “I would have loved the Dreamer, whoever it was.”\nBecause wolves are loyal above all things. Because Stiles had been laid bare in the Fantasies. Because they had opened Stiles up, opened them both up, in a way they hadn’t managed after over a year in reality. Derek had fallen in love with the pure essence of him, and for the first time Stiles really lets himself feel it. He is the Dreamer, and Derek loves him.\nDerek smiles small against him, breathing in his scent and trailing a hand down his spine.\n\"But I’m glad it’s you.”\nAnd that’s it. That's all Stiles needed to hear, and he’s dragging Derek into a frantic kiss before his brain checks itself.\nDerek laughs against his ear and then he’s gripping Stiles’ nape, turning his head and kissing him. For real. With their mouths. It’s familiar and strange, and Stiles falls into it, fast and desperate, clutching at Derek and losing himself in the frantic slide of their mouths, the stubble that burns so sweetly, that’s going to leave marks. God, he’s going to have marks now, not just fast-fading, Fantasy stings. He's going to have real, physical proof.\nIt's going to stay.\nThe thought’s enough to leave him breathless too soon, and he’s pulling back, resting their foreheads together and grinning stupidly.\n“Taste,” he notes, “that’s new. Mint’s maybe a little cliché, but ten out of ten for effort.” And then… “Oh wait, crap, wait, what do I taste like? I took like three showers but I—“\nDerek cuts him off with a huffed laugh and a quick, patient kiss.\n“You taste fine, Stiles. You taste like caffeine and… coke?”\nStiles shrugs, indescribably relieved even though ‘fine’ isn’t exactly glowing praise.\n“Couldn’t sleep last night.” He watches his hands trail down Derek’s sides, savoring the sight as much as the sensation of soft fabric and hard muscle underneath. “But I mean, if you don’t like soda I could go borrow some mouthwash? Or maybe—“\n“I’m starting to regret this,” Derek murmurs, his nose trailing shamelessly along Stiles’ hairline.\nThe words don't bite like they might have two minutes ago. Stiles smirks.\n“Oh yeah, big guy? We could just go back to Fantasies if you—“ Derek growls, actually growls, clutching at Stiles’ sides possessively. And Stiles is pretty sure he’s in love with that sound. “Well, you want my scent, you’ll have to put up with my rambling. Two for one deal.”\nAnd then, because he’s just realized that he hasn’t said it yet, not when Derek could hear it, not whispered against his skin and moaned into his mouth in the heat of a Fantasy, he breathes “And I love you too. Obviously. I fought off your Dreamer for you and everything.”\nDerek’s tongue licks out against his neck, and Stiles shudders.\n“You’re an idiot.”\n“But your idiot,” Stiles tosses back lightly, then freezes. “Wait, I’m your idiot, right? That’s what this whole…”\nDerek leans back, meeting his eyes, searching for something and smiling, small and satisfied, by whatever he finds.\n“You’re my idiot. If I’m yours.”\nIt’s kind of amazing, Derek smiling at him. Soft and open, the way Stiles has felt him be as the Dreamer but never had a chance to see. Stiles isn’t going to say it’s breathtaking but… yeah, ok, maybe it is a little hard to draw in air suddenly.\n“Obviously,” Stiles repeats, a little awed, holding Derek’s gaze until Derek ducks his head, huffing.\nHe kisses Derek’s temple, smiling as Derek leans into it. And then his arms are wrapping around Derek, and Derek’s clutching him back, and it’s a hug and it’s stupid that it leaves him feeling all fluttery like this, but he’s grinning and not even trying to fight it as Derek noses across his throat, breathing deep.\nAfter way too long spent just breathing against each other, Stiles grins against his cheek and leans back.\n“So, how do we do this whole ‘getting to bed’ thing in reality? Because I can’t just think us there now and that’s al—“\nHe cuts off, laughing, as Derek grips his hips, hoisting him upward. Stiles wraps his legs around Derek’s waist, new and familiar, and loops his arms loosely around his shoulders.\n“Mm,” he sighs and kisses him softly, savoring the taste of his mouth, the scent of his shampoo. Who said humans can’t appreciate the lesser senses? “This’ll do.”\n.-\nThey’re twisted together on the couch, a barely touched pizza open on the low table, the Hulk howling about something or other in the background while Stiles kisses his way down Derek’s bare chest.\nIt’s been an entire, amazing day of this. Sex – such good sex, real, actual, live and in person sex, and can Stiles just say god yes because Fantasies, as real as they are, have got nothing on this – interrupted by brief stints of pretending to be actual human beings who wear clothes and eat food, before one of their minds drifts to a flash of a Fantasy and then they’re on top of each other again.\nDerek’s stretched out beneath him, shirt hiked up and hand gripping in Stiles’ hair. Breathing in harsh, voiceless gasps that Stiles knows he can turn into real moans, just give him a minute. Now that he’s heard the noises Derek makes during sex he doesn’t think he’ll ever be satisfied with silence.\nHe’s just working Derek’s jeans loose, aching to taste him again, when Derek’s moving suddenly, scrambling to sit upright, to work his shirt back down. And before Stiles can say more than “What the hell…o“ the loft door’s sliding open.\nScott freezes in the doorway, Isaac a step behind him. Actually it looks like the whole pack’s crowded together in the hall, and the expressions on their faces show pretty clearly that Derek’s little scramble had done absolutely zilch do hide what they’ve been up to.\n“Wait.”\n“You guys…”\n“Finally.” Everyone stops to stare at Lydia, who glances up from her phone long enough to roll her eyes. “What? Derek started ‘smelling happy’ right around the same time Stiles started ducking out of class all the time with his little Fantasy problem. Did no one else make that connection?”\nDerek’s eyes flit to Stiles, and Stiles just shrugs, lips quirking.\n“You did have kind of weird habit of starting things up during math.”\n“Which you will no longer be doing,” Lydia cuts in evenly. “Do I send Jackson into fits and interrupt your wolf training or whatever?”\nAt the back of the group Jackson goes red, muttering something about how he can handle a Fantasy without causing a scene.\nEveryone’s crowding casually into the loft while he and Derek sit there, mussed and sex-flushed and… “Um, guys. Love you and all but why are you here?”\nScott’s busy looking embarrassedly at anywhere but them, and Erica – dressed in flannel pajama bottoms, Stiles notes – jumps in.\n“Pack meeting? Every Saturday night, right?”\n“We had a pack meeting yesterday,” Derek replies flatly, and Erica, the picture of innocence, blinks her wide, dark eyes at him.\n“That was a pack party. …Wait, did you really not tell me to drag everyone here for a pack meeting?” And she flashes another grin and flounces to the stairs, presumably for a change of clothes.\nDerek casts Boyd a sharp look. He just shrugs back.\n“That’s not enough pizza for everyone,” Isaac notes, drifting over, and Scott seems to have distracted himself from the disturbing notion of his best friend having sex with the sight of Ed Norton onscreen.\n“Awesome, the good Hulk!”\nAllison leans into Scott’s shoulder, casting an apologetic shrug their way, and Boyd’s tugging the door closed, and it’s suddenly, frustratingly apparent that they’re not getting rid of the pack at least until the movie’s over.\nStiles casts a wary glance at Derek, not sure where they stand now, how they should act in front of a pack that can’t seem to care less.\nDerek holds his gaze for a long moment before he rolls his eyes, reaching across the couch and tugging Stiles toward him. Stiles shifts easily until their bodies are settled against each other, fitting perfectly. So comfortably, like they’ve been doing this for weeks.\nAnd then Derek’s sighing against his ear, lifting his hand, brushing a finger across Stiles’ lips.\n\nWait.\n"
}