{
    "id": "23112499",
    "url": "https://archiveofourown.org/works/23112499?view_full_work=true",
    "author": [
        "QueenOfAllCorgis"
    ],
    "title": "Comply",
    "rating": "Explicit",
    "archive_warnings": [
        "Rape/Non-Con"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "The Witcher (TV)",
        "Wiedźmin | The Witcher - All Media Types"
    ],
    "relationships": [
        "Geralt z Rivii | Geralt of Rivia/Jaskier | Dandelion",
        "Jaskier | Dandelion/Other(s)"
    ],
    "characters": [
        "Geralt z Rivii | Geralt of Rivia",
        "Jaskier | Dandelion",
        "Yennefer z Vengerbergu | Yennefer of Vengerberg",
        "Cirilla Fiona Elen Riannon"
    ],
    "additional_tags": [
        "cursed!Jaskier",
        "obedience curse",
        "noncon",
        "Jaskier | Dandelion Has a Past",
        "Jaskier | Dandelion Whump"
    ],
    "language": "English",
    "series": "",
    "published": "2020-03-12",
    "completed": "2020-10-24",
    "words": "38,283",
    "chapters": "22/22",
    "comments": "2,587",
    "kudos": "18,791",
    "bookmarks": "3,400",
    "hits": "236,735",
    "summary": "<p>“This drink, the mage made it. It is going to make you a good boy,” she brushed back his hair, too long nails trailing along his cheek. “But you cannot tell anyone. You cannot tell a soul about this drink or this spell. You don’t talk about it. You keep it secret.”</p>\n<p> </p>\n<p>Julian opened his mouth to ask more and was hit by a pain he had never experienced. The boy cried out in pain and doubled over, arm wrapping around his screaming middle. His mother shushed him and pet at him until he was able to catch his breath.</p>\n<p> </p>\n<p>“See what happens to naughty little boys who don’t listen?” Her voice was sharp. “I told you not to say anything.”</p>\n<p>--</p>\n<p>Jaskier was cursed with obedience as a child and has mostly learned to get by without others knowing. Geralt is not most people.</p>\n<p>Y'all. </p>\n<p>This chapter has been a LOT to write! </p>\n<p>I'm a special education teacher and just restarted school so my life was super crazy THEN I found out that I'm pregnant with my first child which while super exciting means I'm soooooooo tired. </p>\n<p>Excuses aside, I really wanted to do this chapter justice. I wrote it like fifty times and this time I realized that this is how I wanted this story to end. </p>\n<p>I am so, so grateful for y'all support and love throughout this story. I loved writing it! Thank you again!</p>",
    "notes": "<p>My first foray into Witcher fic! I just finished the series and read this prompt and had no choice but to go for it.</p>\n<p>I hope everyone is doing okay during this crazy time!! Stay safe!</p>\n<p>Chapter Warnings! </p>\n<p>Sexual abuse</p>\n<p>I've started posting this on tumblr too if you want to read it there :) </p>\n<p>thequeenofallcorgis.tumblr.com</p>\n<p>Also posted on my Tumblr: https://thequeenofallcorgis.tumblr.com/</p>\n<p>I was planning on making the mountain scene rough but then I decided to make it soul crushing. It's in the next chapter and I'm already so sorry.</p>\n<p>Aw man, here we go. </p>\n<p>Lots of dumb decisions are made by dumb people and lots of hearts are broken. </p>\n<p>Please don't hate me.</p>\n<p>WARNING! Fleeting thoughts of suicide. Please don't read if it will upset you.</p>\n<p>Oh man, oh man guys.</p>\n<p>Oi, so sorry this took me so long to get out! I am moving into a new position at work with a TON of new responsibility and duties and I've been frantically trying to train for it before the school year starts (or doesn't? but we don't know and that is another stressor)</p>\n<p>REGARDLESS, I can't tell you how appreciative I am for your comments and beautiful words. Honestly, it makes my day every time I read them! </p>\n<p>Here's the chapter I'm sure you've been waiting for, Geralt and Jaskier finally sit down and talk.</p>\n<p>Awwww man y'all, strap in. Things are about to get CRAZY.</p>\n<p>Shorter chapter but I'm happy with it! Things are finally looking up! </p>\n<p>I'm expecting a few more chapters out of this story. Look forward to happy things! (finally!)</p>",
    "text": "\nJulian was seven years old when he learned that he wasn’t good enough. \n\n \n\nHe was an excitable child, one who loathed sitting still for too long. His lessons and parties he was expected to attend were horrible. Just minutes in and he was squirming and then he would find some way to entertain himself, often to the disappointment of his stone faced parents.\n\n \n\n“Sit still!”\n\n \n\n“Stop talking!”\n\n \n\n“Stop that!”\n\n \n\n“Gods, can’t you just be good?”\n\n \n\nAnd he wanted to be good. Julian wanted to be the son his parents were proud of, like the perfect little children who followed their noble parents like ghosts. He tried, he really \n\ntried\n\n, but he just couldn’t do it. \n\n \n\nSo, when he mother came into his room with a cup he had sat up as perfectly straight as he could. She gave him a blank, exhausted smile, and he focused on his back being ramrod straight and his hands being clasped in his lap.\n\n \n\n“Julian,” she sat down on the edge of his bed. His mother was beautiful, all graceful gowns and sparkling jewels. “You know that the King is coming for a visit next week.”\n\n \n\n“Yes mother,” he nodded. Of course he knew. The entire house had been a buzz with energy as they got ready, Julian earning a few slaps to the back of the head as he got in the way of the staff. \n\n \n\nShe pursed her lips. “And I know that you want to be a good boy, make us proud yes?”\n\n \n\nJulian nodded quickly. “Yes mother.”\n\n \n\nHis mother looked at the cup for a long moment before holding it out. “Then drink this darling.”\n\n \n\nAnd he did.\n\n \n\nThe drink itself was vile. It was strangely warm and thick, tasting of the greens his governess had to basically force down his throat. Still, Julian drank all of it and beamed at his mother when he handed it back. \n\n \n\nShe watched him carefully, drumming her nails on the glass. “I...touch your nose Julian.”\n\n \n\nWithout even thinking, without even questioning why, his hand moved on its own and his finger lightly tapped his nose. Julian frowned in confusion, unable to move his finger away. “Mother?”\n\n \n\n“See? Now you are going to be such a good boy,” she grinned. “Stop touching your nose.”\n\n \n\nHis hand fell away and he blinked at her.\n\n \n\n“This drink, the mage made it. It is going to make you a good boy,” she brushed back his hair, too long nails trailing along his cheek. “But you cannot tell anyone. You cannot tell a soul about this drink or this spell. You don’t talk about it. You keep it secret.”\n\n \n\nJulian opened his mouth to ask more and was hit by a pain he had never experienced. The boy cried out in pain and doubled over, arm wrapping around his screaming middle. His mother shushed him and pet at him until he was able to catch his breath.\n\n \n\n“See what happens to naughty little boys who don’t listen?” Her voice was sharp. “I told you not to say anything.”\n\n \n\nHe sobbed and gasped, trembling on the bed. “I’ll be good.”\n\n \n\n“I know darling,” she shushed. “You’ll have to be.”\n\n \n\nAnd he was. His parents got many compliments at how well behaved their son was. He impressed everyone with his polite conversation and his perfect manners. He was good...but clearly he hadn’t been good enough before.\n\n \n\n--\n\n \n\nJulian was nine when he learned what a curse really was. \n\n \n\nSome of the other boys, older ones who were the sons of some of the staff members, invited him to play. Not willing to say a word to his mother knowing she would tell him not to, he followed them eagerly. \n\n \n\nThe boys smirked at each other, one had his arm looped around Julian’s shoulder as they walked. “Just around here little lord.”\n\n \n\n“What is it?” Julian asked excitedly. \n\n \n\n“You’ll see!” The boy sang and steered him behind the stables. \n\n \n\nThey went behind the stables to see a mewling bunch of kittens, still with their eyes closed. Julian gasped with delight and crouched down, cooing at them. \n\n \n\n“Cute right?” The boy smiled, patting him on the back. “Just precious. Haven’t done anything wrong, you know? Like we didn’t do anything wrong but you still told your mother that we took the cakes from the kitchen.”\n\n \n\nThe atmosphere grew frosty and Julian blinked up at him. “What?”\n\n \n\n“You did, didn’t you?” The boy’s eyes narrowed. \n\n \n\n“I didn’t want to! I-” and the pain burned through him, choking off the words. \n\n \n\n“Am cursed?” The boy cocked his head to the side. “I heard something about that. So, if I asked you to kill those kittens would you? Would you break their tiny necks one by one?”\n\n \n\nNo.\n\n \n\nNo.\n\n \n\nPlease.\n\n \n\nJulian was breathless with fear. The boy just watched him, a smile stretching across his face. “Do it. Kill them.”\n\n \n\nAnd his hands moved. For a moment, Julian tried to resist. He tried to hold back despite the agony shooting up his arm. It felt like his bones were being compressed into powder, like his skin was being peeled off. The pain made him cry out as his arm involuntarily jerked towards the mewling kittens. \n\n \n\n“Stop,” the boy laughed. “Fucking freak of nature.”\n\n \n\nThe boy spat on him and left with his group, all laughing loudly. Julian kneeled by the kittens, still quietly sleeping on, and burst into tears. He pressed his hands into his aching chest and desperately heaved for breath. \n\n \n\nA moment more and he would have felt the snap of fragile bones under his fingers.\n\n \n\nHe would have ended lives.\n\n \n\nAnd there was nothing he could have done to prevent it. \n\n \n\n--\n\n \n\nJulian was seventeen when he learned how to hate. \n\n \n\nLike always he was standing quietly by his mother’s spot. She had told him earlier to wait until someone asked for a dance. Of course, she had probably forgotten about him by his sixth goblet of wine. \n\n \n\nSo he was left, watching the ball and trying not to fall asleep out of sheer boredom.\n\n \n\n“And you must be Julian, future Viscount de Lettenhove,” a sweet musical voice interrupted his rambling thoughts. He blinked and whipped his head to the side to see a truly beautiful woman. She was tall and blonde with sparkling green eyes and a silver gown, tight in all the right places.\n\n \n\nThe Countess de Stael.\n\n \n\n“My lady,” he dipped his head. \n\n \n\n“Come, dance with me,” and his feet were suddenly unstuck. He stumbled forward and took her hand, leading her to the dance floor. \n\n \n\n“Why are you hiding over there? Clearly your mother can’t be the best conversationalist?” She giggled, nodding towards his mother who was swaying in her seat. A faint flush colored his cheeks and he shook his head. \n\n \n\n“No,” he shrugged.\n\n \n\nThe Countess raised her eyebrows. “You are a mystery Julian. None of these girls caught your fancy? Tell me.”\n\n \n\nHe could have groaned if the words weren’t already spilling out of his mouth. “No my lady.”\n\n \n\n“Really? Not one?” The Countess smiled. “And here I would think you would be a prize. A pretty young nobleman from a good family. I’ve also heard...spin me Julian.”\n\n \n\nDread settled in his stomach as his arm lifted and she was spun around.\n\n \n\nThis was how it always went. Someone always found out. Someone always used it to their advantage whether that be for a cheap laugh or a favor. \n\n \n\n“Oh! How fun!” The Countess laughed. “I knew you would be a delight. Go to my chambers and wait for me.”\n\n \n\nShe pressed a kiss to his cheek and smiled as his feet carried him towards the door. Desperate, he turned to try and catch his mother’s eye but she was too busy giggling in some lord’s lap that was not his father.\n\n \n\nIt was far too long before the Countess came to her room, chuckling at the sight of him waiting. “Such a good pet.”\n\n \n\n“Surely you could get anyone at that party,” he mumbled, deeply uncomfortable. \n\n \n\n“I could but you are the only one who can’t say no. The only one who will do \n\nexactly\n\n what I want,” with a few quick movements of her hands her dress came undone and fell to the ground around her ankles. Julian quickly looked away, blush burning in his cheeks. “None of that shyness now. Come here.”\n\n \n\nShe beckoned him with a finger and his leaden feet stumbled towards her. \n\n \n\n“Please me,” the Countess grinned and spread her legs.\n\n \n\nIt felt like an eternity before he was allowed to rest, breathing hard with an aching jaw. The Countess stretched like a cat and sighed, idly twisted her fingers in his hair.\n\n \n\n“You are a fast learner,” she said dreamily. \n\n \n\nHe wanted to curse at her, scream and rant and \n\nhurt\n\n, but she had commanded him to please her. Clearly that wouldn’t be pleasing. \n\n \n\n“Can I go?” He whispered.\n\n \n\n“I’ve heard you were quite the singer, sing me a song,” she ignored his question and closed her eyes as his song drifted around them. Singing had always been something Julian loved, something he had treasured and she was using it. It felt foul and wrong in his mouth. \n\n \n\n“Oh lovely,” the Countess sighed. “You need to sing of me though. Sing about my beauty and about my charm.  I want everyone to know.”\n\n \n\nSo the songs continued.\n\n \n\nThe words spilled out despite him not even thinking of them. He sang of her golden hair and her sweet kisses. He sang of her kind heart and beautiful eyes. He sang and he sang and he sang until his voice was hoarse. \n\n \n\n“Such a perfect boy,” the Countess cupped his cheek and kissed him gently. “No go. I’m tired.”\n\n \n\nThe curse didn’t even need to move his feet. He jumped up entirely on his own. Julian practically ran from the chambers, pushing past the party goers who had stayed out far too late. It only took a few turns before he found himself outside his mother’s room and rage overwhelmed him. \n\n \n\n“Make it stop!” He ground out, ignoring the agony as he burst in. “I need it to stop!”\n\n \n\nHis mother blinked at him, halfway through taking off her ruined makeup. The nameless lord snored on her bed but Julian didn’t even glance at him.\n\n \n\n“Whatever do you mean?”\n\n \n\n“This...this...it is hurting me,” Julian choked out. The shame and fear from the past few hours overwhelming him. “I’ve tried. I’ve tried to be everything you want and you still hurt me.”\n\n \n\n“Hurt you? I \n\nsaved\n\n you. You are going to be in a good marriage, be a good and loyal husband, and rule your lands to the best of your ability,” she huffed and turned towards the mirror. “I made you the man you are.”\n\n \n\nWhat man?\n\n \n\nThe man who stood by his mother like a dog?\n\n \n\nThe man who was afraid to talk to anyone else?\n\n \n\nThe man who performed like a puppet for someone else’s pleasure?\n\n \n\n“I don’t want this,” he whispered. \n\n \n\n“It isn’t about what you want,” his mother rolled her eyes. “Now go-”\n\n \n\nJulian quickly covered his ears, blocking out whatever she was going to say next. His mother’s eyes narrowed but he didn’t pay her any mind. Before she could say another word he spun around and sprinted from the room. \n\n \n\nHe had always been told to stay within the castle. To stay safe, to stay away from others. Now he was being told to just \n\ngo.\n\n It didn’t matter what else she had intended to say. The curse only heard that word.\n\n \n\nGo.\n\n \n\nSo he went. \n\n \n\nJulian ran and ran until he couldn’t run anymore. He ran until the lights from the castle dimmed in the distance and there were more trees than houses. He ran until his boots blistered his feet and his clothes were soaked with sweat.\n\n \n\nHe was free. \n\n \n\nHe was free from the rumors and whispers going around Kerack. He was free from people experimenting with this curse they had heard of. He was free from living a life that wasn’t his own. \n\n \n\nHe was going to be who he wanted.\n\n \n\nHe was going to be someone new. \n\n\n\n\n\nWhen Julian arrived at Oxenfurt he was starving, wearing threadbare clothes, and full of hope.\n\n \n\nThe university loomed over him, looking more imposing than any castle he had ever seen. The stares he got from students and professors alike as he walked into the building made him feel small but he persisted. \n\n \n\n“Can I...help you?” A woman asked, immaculately dressed and sitting behind a huge desk. \n\n \n\n“Yes! I am going to enroll,” he beamed at her and she raised her sculpted eyebrows. \n\n \n\n“You are, are you?” She chuckled. \n\n \n\nThat was when Julian realized that everyone was staring at him. He wanted to shrink down, never having to be able to fight for himself, but he refused. “I am.”\n\n \n\n“Can you pay the enrollment fee?” She asked and he winced. When he had run he had run with nothing. The few pieces of jewelry he had traded for food and lodging on the journey. “Or do you have a staff member to sponsor you?”\n\n \n\nJulian glanced around the room, heart sinking as some of the people started laughing. He was a joke, a laughing stock here. Those hopes he had were about to be dashed and he was going to be thrown out. \n\n \n\n“I...I have talent,” he sputtered, getting a few more laughs in response. “I do! I can sing and I am a fast learner. I promise if you...if you let me enroll I will bring so much to this university. I will do everything you ask of me.”\n\n \n\n“Alright boy,” the woman seemed annoyed now. “You need to go.”\n\n \n\n“Sing for us boy,” a tall spindly man called out. The woman was clearly seconds away from having him thrown out but the curse was faster. He started to sing, a melody that he had learned a long time ago from one of the governesses his mother had fired as soon as her husband’s eyes wandered. \n\n \n\nThe foyer grew quiet and people stared. \n\n \n\n“I’ll vouch for him. Talent and confidence will get you far,” the man said simply. “Come along boy.”\n\n \n\nJulian grinned, feeling a bit smug as he pushed past the stunned onlookers. The man walked with long strides, never slowing down to let Julian catch up. He had to practically jog to stay with him. \n\n \n\n“What is your name?” The man asked.\n\n \n\nJulian hesitated. He had wanted so badly to leave everything behind. He wanted to become someone new, someone he wanted to be and not the person everyone else wanted him to be.\n\n \n\n“Jaskier,” he said simply and the man raised his eyebrows. \n\n \n\n“No family name?”\n\n \n\n“Not anymore,” he shook his head and the man nodded. \n\n \n\n“Well Jaskier, I am Professor Valdo Marx,” the man’s chin lifted a bit. “I am a voice professor here and you have potential. Do you know how to play a lute? A drum? A flute?”\n\n \n\n“No,” Jaskier shook his head.\n\n \n\n“We will change that.”\n\n \n\nAnd he did. Jaskier worked from dawn until far after the sun went down. He studied music theory, the classics, the instruments. He did everything in his power to become the best bard he could possibly be.\n\n \n\n“You are still a bit slow on that part,” Valdo said softly, brow furrowed. “Practice your lute until you get it right, even if you fingers bleed.”\n\n \n\nIt took hours but he managed to get the tricky melody down, even with the blood making the strings slippery. Valdo looked a bit surprised when he returned. The song was perfect but the obvious pain soured it. \n\n \n\n“Jaskier,” he said but the student kept playing. “Jaskier, that is enough.”\n\n \n\n“I can’t,” the boy ground out, tears flashing in his eyes. \n\n \n\nSomething passed over Valdo’s face. “Jaskier, stop.”\n\n \n\nHe barely managed to grab the lute with bloodied hands as it slipped through his fingers. Jaskier gasped, holding his hands to his chest and closing his eyes tight. Pain radiated through his fingertips and he almost fought back when Valdo took them in his hand.\n\n \n\n“Either you are the most dedicated student I have ever met or I just figured out what you are running from,” the professor hummed and studied his fingers. “I’m going to ask you a question and you are going to tell me the truth. Nod if you understand.”\n\n \n\nJaskier’s head snapped up and down. \n\n \n\nThe professor pursed his lips. “Are you here at this University because you want to be?”\n\n \n\n“Yes,” this time it wasn’t the curse talking, it was all him. “I want this more than anything. I made this choice completely.”\n\n \n\nValdo looked relieved at that. He stood up and went to a nearby cabinet, rooting around until he found a few bandages and salves. Without a word he got to work cleaning and wrapping up his hurt fingers, patting his hand when he finished.\n\n \n\n“Please don’t say anything,” Jaskier whispered. \n\n \n\n“I won’t,” Valdo shrugged. “Your secret is safe with me. I won’t...command you to do anything either. I swear it.”\n\n \n\nHis shoulders slumped in relief and he let out a trembling breath. “Thank you.”\n\n \n\nValdo gave him a lingering look and nodded. “I like you Jaskier. You are immensely talented and have great potential. I can imagine you as a professor here yourself.”\n\n \n\nNo one had ever expected more from him than being what they wanted. No one had ever thought he had any kind of potential before, that he could be more. \n\n \n\n“A professor?”\n\n \n\n“Sure,” Valdo gave him a slightly crooked smile. “Can’t you imagine it? The great Jaskier inspiring generations of musicians.”\n\n \n\nJaskier let out a laugh. “I suppose.”\n\n \n\nThe look Valdo gave him warmed him to his very core. He had a friend here, someone who actually respected who he was. He had someone who treated him like a person and let him make his own path.\n\n \n\nValdo was his mentor.\n\n \n\nValdo was his biggest supporter. \n\n \n\nValdo was his best friend.\n\n \n\nValdo became his lover. \n\n \n\nIt happened nearly a year after he arrived at the University. The older man helped him with his studies, never dissuading him from taking an incredibly intense course load. Night time study sessions led to gentle touches and kisses which evolved into more. \n\n \n\n“Are you sure you want this?” Valdo asked nervously, hovering over him on the bed. “You can say no. You can refuse this.”\n\n \n\nJaskier wanted to cry at that. \n\n \n\nHe hadn’t been able to say no before.\n\n \n\n“I want it,” his heart pounded but he didn’t regret it one bit. \n\n \n\nIt was the first time he had been truly happy, really truly happy. He was in University, encouraged to study his passion. He was in a relationship with a supportive, wonderful man. He was allowed to be himself. \n\n \n\nIt was all he wanted. \n\n \n\nJaskier graduated with honors and was granted a professorship. His talent was well known and students flocked to his class, drinking in every word he said. It was wonderful and perfect, everything he had dreamed of while he was trapped.\n\n \n\nThen it changed.\n\n \n\nAn annual showcase of the university was scheduled. Nobility would be coming to admire art, music, and other talents perfected by students and staff. A feast would be held and Valdo had been the main performer for years. \n\n \n\nNot this time.\n\n \n\nThe chancellor announced that Jaskier would be the one to headline the feast. Students and staff rushed to congratulate him, and he beamed at them. It felt almost like he was on a cloud, like no one could touch him.\n\n \n\nThen he saw Valdo’s face.\n\n \n\nMaybe he had been a bit naive thinking that his lover would be thrilled. This was Valdo’s event, one that people traveled to hear him for. The older man’s lips were set in a thin line and he refused to speak to Jaskier for hours. \n\n \n\n“I didn’t ask for it Val,” he tried when they were in their chambers. “I didn’t.”\n\n \n\n“I know,” he sounded even more bitter. \n\n \n\n“I’m sorry,” his heart was cracking in his chest. “I’ll play your songs! I’ll credit you!”\n\n \n\n“Don’t play at the feast,” Valdo said sharply, eyes flashing and Jaskier’s breath caught in his throat. In their years together he had \n\nnever\n\n commanded him to do anything. “Don’t play a single note, don’t sing a single song.”\n\n \n\n“Valdo,” he choked out. \n\n \n\n“You’ll still go but you won’t play,” dark eyes flashed. \n\n \n\nJaskier felt like something inside of him was being crushed. “You said you wouldn’t, you swore.”\n\n \n\nThis wasn’t the man he had thought he would spend his life with. This wasn’t the kind, generous man who helped him realize that he was worth more than the words someone said to him. This wasn’t the person he thought he loved. \n\n \n\n“And I thought you would be grateful!” Valdo exploded. “I thought that you would be grateful that I helped you all this time! I taught you, I \n\nsaved \n\nyou. Where would you be if I wasn’t there to take you in?”\n\n \n\n“Val-”\n\n \n\n“And then you take what is mine? You embarrass me?” Valdo strode forward and grabbed a handful of his hair, snarling when he started struggling. “Stop moving.”\n\n \n\nThen he was as still as a statue.\n\n \n\n“Do you know what is going to happen? They see you, a pretty stupid little thing, and they think you’re going to be what everyone wants. A king might even see you and then you’ll be a court bard. Imagine the prestige! I deserve that.”\n\n \n\nJaskier grit his teeth together, wanting to talk but that would mean he would have to move his mouth. \n\n \n\n“And look at you,” Valdo sneered. “You are nothing more than a puppet. You’ll never be a true artist, just what someone made you. Move.”\n\n \n\nJaskier jerked away. “No one made me, I did that myself.”\n\n \n\n“Really?” Valdo laughed. \n\n \n\n“What did you think was going to happen? Did you think I was going to be your grateful kept boy? Someone who just followed you around and stared at you adoringly?” Jaskier knew tears were sliding down his cheeks. “Was all of this a lie?”\n\n \n\n“We both got what we wanted out of this relationship. You got to go to university and I got you,” Valdo narrowed his eyes. “But you will not take this from me.”\n\n \n\nJaskier couldn’t hear anymore. He spun on his heel and practically fled, feeling like he would dissolve into dust any moment. It took a few minutes of stumbling through the halls before he curled up at the base of the stairs, sobbing. \n\n \n\nHow stupid could he have been?\n\n \n\nHe had been so desperate that he had ignored all the signs. He had accepted the smallest bit of kindness, of decency, and thought it was love. Of course Valdo would have no use for him if he started surpassing him. Of course Valdo would throw him aside the moment he was a threat to his position.\n\n \n\nHe didn’t have a choice in playing at the feast. \n\n \n\nPeople booed as hissed as he just stood there, unable to play a single sound. The nobles looked disappointed but Valdo was there with his own lute, strumming and singing away. Jaskier was left with a doublet stained in thrown food and shame deep in his chest.\n\n \n\n“Oh Jaskier?” Valdo laughed when someone mentioned him. “He’s nothing more than a talentless wastrel. Now I, I can sing songs about all of your greatest triumphs.”\n\n \n\nThe night ended with Valdo getting a place in court and Jaskier disgraced. \n\n \n\nHe didn’t even go back to his chambers and change. Instead, he simply took his lute and started walking. The betrayal and heartbreak felt so similar to all those years ago, a pain that he didn’t honestly think he could survive.\n\n \n\nBut he did.\n\n \n\nJaskier let out a shriek as soon as he was beyond the university’s gate, startling a woman and her child. The anger and fury twisted in his gut painfully but it filled him with something else. Determination.\n\n \n\nHe wasn’t going to roll over and die. \n\n \n\nHe wasn’t going to let those who hurt him win. \n\n \n\nValdo might have a place in court but he would be known far and wide. He would go on the most amazing adventures and see the most amazing things. His songs would be sung across the continent and Valdo would have to hear his lyrics, knowing that he had succeeded despite him.\n\n \n\nHe would travel. Maybe to Ellander, maybe Mount Carbon, maybe even to Gulet.\n\n \n\nSo, with tears drying on his cheeks he started strumming his lute and walking east. \n\nThe tavern was filthy.\n \nIt smelled of beer and spoiled food but there was a warm fire and the innkeeper poured him a mug of ale. Life on the road had been both tough and incredibly freeing. Jaskier got to see things that he had only dreamed of and didn’t have to stay in one place long enough for anyone to find out about the curse.\n \nStill, things did happen.\n \n“Abort yourself!” A drunk shouted as he strummed on his lute. Before he could even comprehend how the hell he was supposed to do that his legs started jerking backwards, bread pelting him. He started stammering out a reply when another drunk shouted at him to stop.\n \nThe drunk most likely meant to stop singing but the curse didn’t know that.\n \n“Oi! Oi! Fuck off!” He snapped, still fending off the flying rolls. “I’m so glad I could bring you all together like this! It’s unbelievable.”\n \nGrumbling, but a bit relieved that the curse had been stopped before anything…strange could happen, Jaskier put down his lute and gathered up what food he could. He was in the middle of trying to pick out the cleanest roll when he glanced up and saw the man sitting in the corner.\n \nOh yes.\n \nOf course Jaskier had heard of Witchers. He had heard of their stoic heroism and monstrous mutations. This man didn’t look particularly monstrous but he did look tough. A strong, quiet man who could maybe offer him protection? Absolutely.\n \nTheir first conversation was awkward.\n \nThe Witcher was a man of few words, something Jaskier celebrated internally. Then the Witcher got to his feet and tried slipping out of the tavern. Desperate, Jaskier called out his name and the peasants turned to stare.\n \nHe was going to follow this Witcher.\n \nHe was going to be safe.\n \nJaskier grabbed his things as quickly as he could and just managed to get out of the tavern to see Geralt of Rivia leading his horse away. The bard sprinted to his side, breathless, and spouted off some nonsense about hunting the devil.\n \n“Go away,” Geralt rumbled and hope dashed in Jaskier’s chest.\n \nHis feet started moving backwards but he fought. He ignored the ache that started in forcing his legs forward and grinned through it. “Maybe as silent backup! I heard you back there and maybe adventures would make better stories.”\n \nHis rambling got a bit mindless as the pain increased. Jaskier’s legs screamed and he went on and on about how the Witcher smelled and how he could help him by being his barker. There were even a few times that he stumbled a bit but he forced them to step forward.\n \nThen Geralt stopped.\n \n“Come here,” the Witcher crooked a finger at him.\n \nInstantly the pain was gone. Jaskier swayed a bit on his feet as the changed direction instantly. A smile spread across his face in relief as he stepped forward.\n \nThe punch came out of nowhere. It knocked the breath out of Jaskier so fast he was a bit afraid for a moment that it could never come back. He fell to the ground and wheezed in a few breaths, clutching his stomach.\n \nIt wasn’t the Witcher’s full strength, he knew that, and maybe it should have been a warning but he got to his feet quickly.\n \nGeralt never told him to stop following him.\n \nSo he didn’t.\n \nIt was clear that Geralt was annoyed but he was doing a good job at ignoring Jaskier’s talk. The bard had found that the more he talked the less time others had to speak and tell him to do something. It was a bit difficult to tell someone to do something when they just talked, talked, talked, talked.\n \nThe next gruff command came a few hours later when he tried to reach a hand up to touch the horse.\n \n“Don’t touch Roach.”\n \nJaskier scowled as his hand jerked back as if burned. That wasn’t really fair. The horse, unlike her owner, seemed sweet.\n \nHe had to prove his worth, make it worth Geralt keeping him around. There wasn’t much he could offer besides his songs. Jaskier knew that songs praising the Witcher could be more valuable than gold if heard by the right people. Jobs would come flooding in if they knew that Geralt, while surly and gruff,  was a hero to the people.\n \nHe had thought fighting a devil could be the best possible song to do that.\n \nHe was wrong.\n \nThe ambush happened so fast that Jaskier couldn’t prepare himself for it. He was out cold when the metal ball struck him in the head and woke up tied back to back with Geralt in a cave.\n \nHe could tell the moment the Witcher woke up by the growls and sudden struggling. Jaskier had been awake long enough that the initial panic subsided and now he was just a bit…bored to be honest. “This is the part where we escape.”\n \n“This is the part where they kill us!” Geralt snarled and something froze in Jaskier’s chest.\n \nHe was halfway through asking who they were when it was answered in the form of a boot to the side of his head. Jaskier let out a gasp as his brain seemed to rattle around in his head, the Elder Speech barely meeting his ears.\n \n“Human shut up,” the elf ground out and to his surprise the next words out of Jaskeir’s mouth were in Elder.\n \nHuh, interesting.\n \nThe curse was being literal today wasn’t it?\n \n“Leave off!” Geralt snapped and the curse lifted, freeing his tongue.\n \nFury flooded through Jaskier when the elf continued to strum his lute roughly. What if he broke a string? What if he cracked the wood? He could never afford a new one.\n \n“Leave him be, he’s just a bard,” Geralt’s voice was a rumble on his back and Jaskier felt his breath catching in his throat. Maybe this Witcher could be on his side.\n \nThen the male elf slammed his lute over his knee and broke the neck in two. \n \nThe lute had belonged to Valdo. That in of itself wasn’t reason to really care for it. In fact, most things that reminded him of Valdo made something sick and dark twist in his stomach. No, he wanted to play songs on it that were continentally known. He wanted Valdo to know that the songs being played were being played on his lute. That he could have never done the same.\n \nAnd now that petty bit of revenge was gone.\n \nJaskier could cry. He felt tears burning in his eyes but he was not going to be the captive who wept over a broken lute.\n \nSo, he shouted. He snarled out insults and laughed when Geralt headbutted her.\n \nThe Filavandrel came in and things changed. The would be king sounded so broken and tired, standing up for his people when Geralt told him to let the bard go. That command, though not directed as Jaskier, made something flutter in his chest.\n \nThe story Filavandrel told was heartbreaking and familiar in a terrible way. He understood what it was to not have a choice, for his life to be out of his control. The elves had been used for their magic and then thrown aside. He had been used before and thrown aside as well. He knew what it was to be fed up.\n \nStill, that didn’t mean he appreciated Geralt offering them up to be killed.\n \nInstead of Elvish steel slicing through his throat it sliced through the ropes at their arms. Geralt was on his feet in a moment, following the angry female elf to where their belongings were held. A slender hand appeared in front of Jaskier and he looked up to see Filavandrel offering him a way up.\n \nAfter a moment of hesitation, he took the elf’s hand and let him pull him to his feet. The elf king’s brow furrowed when their hands met and he let out a soft whistle.\n \n“We don’t often see curses this old,” he whispered and Jaskier’s blood ran cold.\n \n“I…” the curse burning warningly under his skin. “I don’t know what you’re talking about.”\n \nFilavandrel raised his eyebrows and glanced at Geralt. “He doesn’t know?”\n \nJaskier shook his head.\n \n“And you can’t speak about it? Do you want me to inform the Witcher?” Jaskier shook his head wildly at that. The less people who knew the better. Who knows what Geralt could do? Filavandrel’s eyes softened and he looked sad. “Then I will not. Trust must be hard for you to come by, I hope you find it.”\n \nGeralt approached him, holding out his ruined lute but Jaskier was too relieved to really be upset. “I don’t know much about…this but I’m guessing it can’t be fixed.”\n \n“I guess we don’t have to scavenge for firewood tonight,” he tried to make it sound lighthearted but everyone winced around him.\n \nFilavandrel held up a hand. “Let me…one moment.”\n \nHe slipped out of the cave, leaving them both. An awkward silence followed as Geralt strapped on his swords and sheathed what seemed like a hundred knives into various places. Filavandrel came back, a truly beautiful lute in his hands and held it up as an offering.\n \n“To replace the one you lost,” he said softly.\n \nJaskier took it, in awe of the stunning instrument. He let his fingers dance across the strings for a bit and grinned at the clear notes that came out. “Thank you.”\n \n“There isn’t enough music in the world. It seems wrong to take away beauty in such a time of war,” the elvish king gave him a smile. “I wish you two well.”\n \n“Thank you,” Geralt’s voice was soft and Jaskier picked out a little tune. He started walking towards the opening, glancing back at Jaskier. “Come on.”\n \nHis feet moved without his knowledge and Filavandrel looked at him sadly. “You should trust him bard. When you’ve seen as much evil as I have you learn to easily find the good.”\n \nThe elf king’s whisper was nearly lost to him as he walked on, unable to stop walking. Jaskier turned a bit and gave them a small wave as they left the cave, squinting in the too bright sun.\n \nHe could maybe trust Geralt. He could hint his way so the Witcher figured out the curse as he was unable to tell him right out. But…everyone who had ever known about the curse had used it to their advantage. He had been hurt too many times to trust that this practical stranger would do the right thing.\n \n“Are you going to play that the entire way?” Geralt grumbled and Jaskier blinked, not knowing that he had been strumming his lute.\n \nHe did a particularly quick little tune, grinning when Geralt actually looked impressed for half a heartbeat. “Yes I am.”\n \nMaybe he could trust him but not today.\nIt wasn’t long after the disastrous banquet when she found him again.\n \nJaskier was playing at a small tavern, laughing as he played a particularly bawdy tune and drinking in the way the audience stomped and cheered. Geralt sulked in the corner as always and drained his mug of ale.\n \nThen, a few armed guards came in and Jaskier’s heart fell. He recognized the sigil on their chest, the three doves, and his fingers tripped over themselves. The guards caught sight of him and the leaders, a tall man with a particularly nasty scar across his chin, walked up.\n \n“You bard,” he snapped. “Tell me, are you Julian Pankratz?”\n \n“Yes,” he whispered.\n \n“The Countess de Stael wishes to see you, come with me,” he didn’t even wait, didn’t have to, before he turned and walked towards the door.\n \nJaskier had enough thought in him to dart to Geralt’s side, grabbing his bag as he ignored the building ache in his chest. The Witcher gave him a strange look. “Friends of yours?”\n \n“Something like that,” Jaskier ground out and turned to follow.\n \n“Are you leaving then?” Geralt rumbled.\n \n“Yeah…see you Geralt,” he couldn’t even give a proper goodbye as his feet forced him further and further away.\n \nBy the time he got out of the tavern he was sick to his stomach and clutching his lute to his chest. The guard raised his eyebrows but they didn’t say anything, just led him to a waiting carriage.\n \n“Julian!” The Countess beamed at him as he climbed in, leaning forward to press cool lips to his cheek. “Sit, sit. Oh, I’m just so glad you are here.”\n \nHe grit his teeth as he sat next to her.\n \n“It’s been…oh…years since we saw each other last,” she was still just as lovely. If he hadn’t known about the poisonous evil inside of her he would have been entranced by her beauty. “I’ve heard all about your travels. Gone to Oxenfurt and become a bard? Your mother is just devastated.”\n \nGood.\n \n“Honestly, she is just ashamed,” the Countess opened an extravagant fan and fanned herself a bit. “She has been telling everyone you died.”\n \n“Then why are you here?”\n \nThe Countess’s lips quirked a bit at that. “Because I’ve heard other stories as well, my little birds have been tittering away. I’ve heard you shacked up with a professor, the scandal of it all. Tell me, what did he do to you?”\n \nJaskier felt his cheeks burn. “He taught me how to sing and play the lute.”\n \n“That’s not what I meant,” the Countess smiled cruelly. “I’m aware of all the learning you’ve done of the Liberal Arts. What did he teach you in the art of pleasure? Tell me.”\n \nHe couldn’t keep his eyes on her as his tongue loosened and words spewed forth. He tried to choke the words back but it seemed to just amuse the Countess more how hard he struggled against the words. He talked about how Valdo taught him how to best please him and how he had done it so willingly, wanting nothing more than to make the older man happy.\n \n“And then he left you?” The Countess gave him a little mocking pout. “Tell me how you felt.”\n \n“Broken,” he whispered, and she patted his hand.\n \n“But now, you are with a Witcher,” the Countess looked impressed. “And you’re singing all his praises. Tell me dear, does he fuck you as powerfully as he fights?”\n \nJaskier clenched his hands into fists. “He hasn’t touched me.”\n \n“Now, now,” the Countess’s eyes narrowed. “Don’t lie to me.”\n \n“I can’t lie to you!” He snapped, jerking away from her claw like hands. “I can’t!”\n \nThe Countess tapped her chin thoughtfully. “You can’t…he really hasn’t? He doesn’t know about your gift?”\n \n“Gift?” Jaskier rolled his eyes. “A curse.”\n \n“Oh sweet thing,” the Countess shook her head. “It’s not a curse. You will never know the feeling of disappointment that you let someone down because, you can’t. If you were smart you would just let yourself become whatever others want you to be. Empty that pretty little head of yours and just…do what others tell you to. You could be the best Viscount in your land’s history, a perfect pet for your professor or my little toy. You don’t even have to think about it…you just are.”\n \n“That isn’t living,” Jaskier felt short of breath.\n \nThe Countess gave him a sad smile and patted his cheek. Then she leaned back and gathered up her skirts. “Lucky for you, you don’t have to worry about that darling. Now, show me what the professor taught you to do with your clever fingers.”\n \nLife at the Countess’s manor was torturous.\n \nJaskier didn’t even know how long he had been trapped there. Sometimes it was easier just to shut off and let the curse do its thing. He would blink awake and be in the middle of doing something, horrified that he had lost that time. It was solely his willpower that kept him from falling into that blank space.\n \nThen…the novelty of having a willing pet at her beck and call wore off. He was asked less and less to sing for her. He didn’t have to worry about the humiliation of sitting at her feet in front of others. He no longer was called into her bed.\n \n“I think it is time for us to part ways,” the Countess sighed as she rested on his chest.\n \n“Have another man to torture?”\n \n“Aren’t you funny,” her too sharp nails bit into his chest. “No my dear, I’m to be married and can’t exactly have my own personal whore hanging around.”\n \nJaskier bit the inside of his cheek to avoid snapping back a response.\n \n“But, it would be devastating to have you just go and forget our tryst,” she sat up and smiled at him. “Tell others that I was the muse and beauty of your world. Always want me back.”\n \n“Of course,” he sighed, trying to hold on to the relief he was feeling.\n \n“And, love me. Love me so deeply you will never love another,” his heart seemed to stutter to a stop as horror overwhelmed him. She would curse him that cruelly?\n \nBut…Jaskier felt nothing.\n \nHe didn’t feel anything but disgust and hatred when he looked at her which was surprising. Could the curse not impact love? Was that still something he could have some control over?\n \nThat alone made him feel a bit hopeful.\n \n“Now go.”\n \nAnd once again Jaskier found himself wandering through the roads and woods. He felt a bit light, knowing that there was something that someone couldn’t take from him. Love was his and his alone. Where he couldn’t control anything else…that was something he had.\n \nSo he sang. He sang all the bar songs he knew, not caring who heard. One drunk heard him singing Toss a Coin and loudly informed him that said Witcher was just out of town. With a spring in his step, Jaskier made his way to the river.\n \nJaskier was in the middle of singing a dirty little tune when he heard splashing. Much to his surprise, he saw a familiar head of white hair and a grin spread across his face. “Geralt! What’s it been? Months? Years? What is time anyway?”\n \nHonestly, he didn’t know how long he had spent in that hell.\n \n“I heard you were in town,” he grinned and Geralt glared at him over his shoulder.\n \n“Are you following me you scamp?” He sounded especially annoyed. “I mean, I’m flattered and everything but you really should think of getting a hobby one of these days.”\n \nJaskier laughed and took a long drink of his flask, watching as the Witcher threw his net and cursed loudly. “Want some? ‘How are you doing?’ I hear you ask.”\n \n“I didn’t.”\n \n“Well, the Countess de Stael, my muse and beauty of this world, has left me. Again. Rather coldly and unexpectedly I might add,” part of Jaskier questioned why he even spoke about it but it came up like particularly acidic word vomit. “I fear I shall die a brokenhearted man.”\n \nMaybe the sarcasm didn’t come through.\n \n“Or a hungry one at the very least, unless someone fancies sharing a fish with an old friend?” His stomach growled as he looked hopefully at the net. Then Geralt started walking away and Jaskier narrowed his eyes, annoyed. “Oh, are we not using ‘friend’? Yeah, sure, let’s give it another decade.”\n \nStill, he didn’t turn.\n \n“Geralt, you’re fantastic at a great many things, but clearly fishing is not one of them,” Jaskier fell into his old habit of talking, talking, talking. “Have you caught anything today? What are you fishing for exactly? Is it cod? Carp? Pike? Bream?...I’m just listing off fish that I know. Zander? Is that a fish?”\n \n“I’m not fishing.”\n \nFinally.\n \n“I can’t sleep.”\n \n“Right…good,” Jaskier frowned. “Well, that makes sense. Insomuch that it…doesn’t. What’s going on Geralt? Talk to me?”\n \nWhat was he doing? Why was he staying around a man who clearly didn’t want him to be there?\n \nMaybe it was because the Witcher looked so desperate and sad. Geralt took in a deep breath and looked up at him, dark circles looming under his yellow eyes.\n \n“A djinn.”\n \nJaskier blinked. “A what?\n \n“I’m looking for a djinn.”\n \n“For a dj…for a djinn? A dj…like a genie? The floaty fellas with the bad tempers and the banned magic? That kind of genie?” He put a hand on his hip. That was ridiculous.\n \n“Yes, it’ll grant me wishes,” Geralt grumbled and Jaskier laughed. Geralt stood up, eyes flashed as he waved his arms. “It’s in this lake somewhere and I can’t fucking sleep!”\n \nMaybe it wasn’t so funny when he seemed so desperate.\n \nGeralt started stalking off and Jaskier hurried after him. “I don’t mean to play priest’s ear or anything but has it occurred to you that maybe we’re merely rubbing salve on a tumor? Not exactly addressing the root cause of the problem?”\n \n“Hm?”\n \nGods, Geralt was frustrating.\n \n“I mean…maybe…just maybe this whole sleepless-ness thing has got something to do with what the druid Mousesack said to you in Cintra? You know, the Law of Surprise?” Maybe it was a bit personal but Jaskier hadn’t had a real conversation with someone in ages. “Destiny? Being unable to escape that child that belongs to you, et cetera, et cetera?”\n \nGeralt barely gave him a look before throwing his net. “No. It’s not that.”\n \n“Yeah…you’re probably right,” Jaskier sighed. “But what if you’re not?”\n \nThe look Geralt gave him could have stricken anyone else stiff with fear but maybe he was immune to the Witcher look.\n \n“You know, the Countess de Stael once said to me that destiny is just the embodiment of the soul’s desire to grow,” of course she had meant him being destined to be hers.\n \n“Did you sing to her before you left?”\n \n“I did actually, and she…why, what are you implying?” He frowned at Geralt who shot him a look. Wait…what? “Oh! We are so having this conversation. Come on Geralt, tell me. Be honest. How’s my singing?”\n \nMaybe it was petty but singing was his.\n \nIt was something he had done on his own and it was him.\n \nWhat the hell was Geralt saying?\n \n“It’s like ordering a pie and finding it has no filling,” Geralt mumbled and Jaskier felt like he had been slapped. He actually took a few stumbling steps back and gaped.\n \n“You, need a nap!” He gasped out. “I mean, are you trying to hurt my feelings Geralt? It’s down-downright indecorous of you, if I’m completely honest and- wow…wow, what is that?”\n \nThe rant was distracted by the filthy pot Geralt pulled out of the net.\n \n“It’s a wizard’s seal. The djinn-“\n \nJaskier snatched it out of his hands. There wasn’t such thing as a djinn but he could at least get Geralt to apologize for his uncalled for comment. “Take it back about my fillingless pie! Take it back and you’ll get your djinny djinn djinn!”\n \nThe tug of war that ensued was childish but…damnit Jaskier was hurt.\n \n“Let go,” the command tingled in his fingers but Jaskier fought it.\n \n“No! No! Let go, you horse’s arse,” then there was a pop and he held part of the jar in his hand…nothing following. Jaskier shook the jar and shrugged. “That was a bit of an anticlimax.”\n \nThe world went darker and the wind picked up, making everything in Jaskier’s blood run cold. What was this? Magic crackled around them and a kind of hope he had never experienced flashed through him.\n \nA djinn.\n \nA wish granter.\n \nOh, did he have a wish.\n \nDesperate, Jaskier started walking towards the river. “Djinn, I have freed thee, and as of this day I am thy lord. Firstly…firstly…”\n \nThe words were trapped in his throat. I wish to have the curse of obedience lifted. He swore to himself. Of course, he couldn’t say it, he had been commanded not to.\n \nThat was hardly fair.\n \nWell, there were a few more wishes he had.\n \n“Firstly, may Valdo Marx, troubadour of Cidaris, be struck down with apoplexy and die,” a bit harsh but the ass deserved much worse.\n \n“Secondly, the Countess de Stael, must welcome me back with glee, open arms and very little clothing,” ugh, the words were hardly his own. Maybe with luck she would embarrass herself by strutting around her court naked. That would be a laugh.\n \n“Thirdly-“\n \n“Jaskier,” a strong hand pulled on the back of his doublet. “Stop!”\n \nThe words died in his mouth and he struggled. How dare Geralt take this from him?\n \n“There are only three wishes,” he growled.\n \n“Oh, come on,” Jaskier sighed. He deserved this. “You always say you want nothing from life. How was I to know you wanted three wishes all to yourself?”\n \n“I just want you to give me some damn peace!” He shouted and Jaskier threw the pot on the floor, he couldn’t say another word.\n \nThen there was nothing but pain.\nAll he could feel was agony.\n \nAll he could taste was blood.\n \nAll he could see was the world warping around him.\n \nHe had always thought that the curse would kill him but he had hoped that it wouldn’t be so unbearably painful. It felt like something was clawing away at the inside of his throat, desperate to get out. His own hands would scrabble at his throat until Geralt pulled them away.\n \n“Jaskier? Jaskier, what’s wrong?” The Witcher sounded…concerned? That couldn’t be right. He tried to say something but blood bubbled over his lips instead. “Jaskier, talk to me.”\n \n“H’rts,” he managed to grind out, spitting out the mouthful of blood.\n \n“Alright..okay…let’s find you a healer…” Geralt seemed to be talking to himself as he practically carried him towards Roach. “There’s a camp nearby.”\n \nWhen he tried to hoist him onto Roach the bard let out a garbled scream, twisting in his grip. Geralt’s instructions not to touch Roach all those months ago still held firm. Just approaching the horse left him in pain, something he didn’t need in addition to the pain he was already suffering from.\n \n“What are you doing? Get on the fucking horse.”\n \nAt that command he managed to scramble halfway up before Geralt practically shoved him up the rest of the way. The pain rocketed up and he barely managed to stay conscious as Geralt went off into a gallop, one hand holding onto Jaskier’s bloody doublet to keep him on.\n \n“Doctor! Is there a doctor here?”\n \nEverything was coming much too fast. One moment he was on the horse, the next moment he was being yanked off, and the next he was swaying on the bed in a medical tent.\n \nThe elf healer knelt in front of him, sharp eyes locking on the growing mass at his throat as his fingers danced across it. “Most extraordinary…”\n \n“Can you fix it?”\n \n“Two curses? I’m afraid that is out of my expertise,” the elf straightened up, looking troubled.\n \n“Two? It was one djinn,” Geralt growled and Jaskier felt everything come to a screeching halt. Just telling him to be quiet wouldn’t cause this. But…the curse plus the spell from the djinn put everything into overdrive. Two cruses warring against each other would kill him.\n \n“Ger’lt,” he choked out, hands scrabbling at the Witcher.\n \n“Maybe I’m wrong but I…this man is under two curses. They need to be lifted or the magic will overwhelm him…at least one needs to be lifted,” the elf shifted nervously. “There is a witch, a sorceress, in a town nearby. She’s…she might be able to help him but be wary.”\n \nGeralt didn’t even wait for him to finish talking, just grabbed Jaskier by the back of his doublet and threw him back onto Roach. The ride to the town came to him in flashes, blackness tinging the edges of his vision.\n \nHe saw the castle.\n \nHe saw the naked man?\n \nHe saw the witch circling Geralt like he was prey.\n \nHe saw her violet eyes coming close and then…nothing.\n \nWhen Jaskier finally woke it felt like he was clawing his way out of heavy syrup. He blinked slowly, forcing himself up onto his elbows and saw the slender form of a woman sitting on the edge of the bed. At first he was confused, then horrified. It wouldn’t be the first time he had let his mind wander when someone commanded him to…\n \n“Did we…I mean…did I…” then she turned and his blood turned to ice. The mage seemed more like an animal as she crawled across the bed towards him, dark symbols standing out on her pale stomach. He scrambled to his feet, holding his hands out in front of him. “Now I’m sure I didn’t butter that biscuit! Now I am so sorry but I just remembered I left my….caaaaaat….on the…stove. I really must be going.”\n \nHe frantically grabbed his boots, still stumbling away from her.\n \n“You can express your deepest desires and you can be on your way,” her voice was like honey but it didn’t make him feel any calmer.\n \n“Well my deepest desires are currently satisfied thank you!” He squeaked out. Then, a strong force pressed against him and shoved him against the wall. The air rushed out of Jaskier in a gasp as he suddenly found himself unable to move.\n \n“How’s your throat?” It didn’t sound like she really cared all that much how his throat was doing. “Perhaps you should try some scales. Sing.”\n \nThe curse made the words bubble shakily from his throat. He hated how she just stalked closer and he couldn’t do anything else but sing. Then something sharp slid between his legs and she commanded him to stop singing with a soft word.\n \n“If you want to keep this, you can make a damn wish,” her voice came out low and dark. “Or I can just tell you to and you’ll do it.”\n \nJaskier tried his best not to startle, mindful of the knife, but blinked in surprise. A sly smile quirked at the edges of the mage’s lips.\n \n“Oh, I know about your little problem. If you make your wish and I get the djinn’s power, I can break it. No more doing what people tell you. You just need to make the wish.”\n \nIt wasn’t the first time someone promised him freedom with pretty words. He had been lied to before but…the knife at his crotch was a bit of an encouraging factor.\n \nShe turned and he fell to the ground with a heavy thud. “Make your wish! Do it now!”\n \nIt was like the words were being ripped from him. “I…I-I don’t know! I wish really badly to leave this place forever!”\n \nThe mage sucked in a few breaths before she began chanting in a strange language. The candles flickered and the fabric on the bed whipped around in the suddenly strong wind. Something dark and evil drifted up the wall before taking shape. Then the walls began to shake and he knew it was time to get out.\n \nJaskier got to his feet and ran as fast as he could to the door, the witch’s chanting echoing after him.\n \nHe managed to stumble outside when he saw a familiar head of white hair. “Oh! Geralt! Thank the gods! I might live to see another day, we need to go.”\n \n“Jaskier, you’re okay,” did he detect a hint of fondness in the Witcher’s voice?\n \n“Well I’m glad you hear that you give a monkey about it!”\n \n“Don’t jump to conclusions.”\n \nJaskier stumbled over his next words, grinding his teeth a bit.\n \n“What happened?”\n \n“Well, I was having a rather lovely dream which then turned into a nightmare. There were naked women in both parts, the first one was loving, tender, very generous. The second, significantly more terrifying.”\n \n“Tell me about the second one,” Geralt grumbled and Jaskier sighed in relief, that at least allowed him to conclude his story.\n \n“Well, black hair, devilish eyes, was painting an amphora on her abdomen. You know…the usual,” he came to a stop when Geralt paused, yellow eyes widening.\n \n“She wants to be the vessel.”\n \n“What? You know this woman?” Jaskier huffed, not imagining that this mage would be anything good. “Of course you do.”\n \n“She wants to become more powerful.”\n \nThere was a small thrill of hope. What the witch had said about breaking the curse…could she with enough power? If they let her become overwhelmed by this djinn could she give him his life back?\n \n“But she’ll die.”\n \nJaskier groaned internally. “Well, let’s pray for her on our way out of town!”\n \nInstead of walking with him like he had hoped Geralt started towards the house. Without a second thought, Jaskier grumbled and sprinted after him. “Are you perhaps SHORT OF A MARBLE?”\n \nThe elf took his arm and spouted off some poetic nonsense, prompting Geralt to shrug him off.\n \n“No, no, no, no, no,” Jaskier jumped in front of him again. “Don’t tell me this is the time you actually care about someone other than yourself! Leave the very sexy but insane witch to her inevitable demise!”\n \nGeralt fixed him with a long stare. “She saved your life Jaskier. I can’t let her die. Stay here.”\n \nThe Witcher pushed past him again but his feet stayed rooted to the ground. Jaskier rolled his eyes and met the gaze of the elf healer, raising his eyebrows.\n \n“Would you like me to tell you that you can move?” The elf asked kindly.\n \n“That would be superb.”\n \n“Then…move freely as you wish,” he shook off his feet, the heavy leaden feeling going away. “I am Chireadan.”\n \n“Wonderful,” Jaskier took a few steps backwards, squinting up at the high windows. His nerves were too frayed to even worry that the elf clearly knew about his curse. The building groaned as magic tore through it and then, to Jaskier’s absolute horror, the stones crumbled.\n \nNo.\n \nNo.\n \nHe couldn’t breathe.\n \nThe walls crumbled around, crashing to the ground with an almighty rumble. No one could survive that, not even a Witcher. Jaskier’s knees felt weak as he slid to them, chest aching.\n \nEveryone he knew died, in one way or another. Either they met a horrible end or the person he thought he knew was gone. The sweet, loving mother he had was gone and replaced by a cold, vindictive thing. Valdo, someone he had wanted to spend his life with, had become a complete monster.\n \nGeralt wasn’t supposed to be a part of his life. He was supposed to be someone to maybe help him stay safe, someone to inspire songs. Well…he supposed that this could be a song but a song he never wanted to write.\n \n“I think they are more than alive,” Chireadan walked up to him with a smirk, nodding towards a window.\n \n“Bullocks!” Jaskier blurted out, staggering to his feet. He hurried to the window to see the Witcher engaged in…activity with the witch.\n \nHe had just gone through the most harrowing experience of his life. He had been on the cusp of death, saved only by the quick thinking of Geralt. And now…now he wanted to fuck the mage who had just held a knife to his dick? Didn’t even want to see if he was okay?\n \nWell, rude.\n \nJaskier plopped onto a rock, glaring at the sand. The elf mage tried to give him an awkward goodbye but the bard was too angry to even respond. Soon, he was left alone stewing in his own thoughts.\n \nMaybe he was being overdramatic but…he had hoped that he mattered enough to someone for them to care about.\n \nNo one had ever really cared before.\n \nHe guessed still no one did.\n \nIt was a stupidly long time before Geralt came walking out with the mage preening at his side. Furious, he jumped to his feet and stormed over. “Are you quite done getting your rocks off then?”\n \n“Jaskier,” Geralt’s tone was so similar to earlier. “This is Yennefer.”\n \n“Oh, we’ve met. She shook hands with my cock,” he glared at her and the mage’s smirk widened. “Are you ready to go?”\n \n“Is he your keeper Geralt?” Yennefer’s voice shook with laughter.\n \n“No…we’ve been traveling together and I am very ready to go to a tavern and drink away the memories of this horrible day,” he snapped.\n \n“My, my,” Yennefer tutted. “How terrible it is to be saved. This is where I bid you farewell then Geralt, bard.”\n \n“Yes, yes, bye! Have a safe trip!” Jaskier waved his hand dismissively.\n \nThe mage rolled his eyes and waved her hand, creating a swirling portal next to them. She stood on her tiptoes to press a quick kiss to Geralt’s lips, eyes alight with mischief. Then she turned to Jaskier. “I certainly hope you can find help with that curse bard. No one should suffer from the shackles you have been forced into.”\n \nJaskier’s jaw dropped as she stepped through the portal with a flourish of her dress. Then it closed and they were left in silence.\n \n“What curse?”\n“What curse is she talking about Jaskier?” Geralt asked and the bard gaped at him, mouth opening and closing like a fish.\n \n“I…I-“ The pain flared warningly in his chest.\n \nSomething dangerous crossed Geralt’s face and he took a step forward, making Jaskier scramble backwards. “You tell me. I will not be fooled by some cursed monster.”\n \n“I’m not a monster,” Jaskier spat out, gritting his teeth against the command.\n \n“Then tell me about your curse,” Geralt’s eyes flashed and Jaskier shook his head.\n \nNo.\n \nHe wouldn’t.\n \nHe couldn’t let anyone else have that power over him.\n \nThe pain shot up, tearing through his chest. It clawed its way up his throat, burning like acid. He could taste the bitter metal of blood and warmth burned under his nose as blood dribbled out. The furious look in Geralt’s eyes turned to confused concern.\n \n“Jaskier?”\n \nHe fell backwards onto his back, coughing as the pain became unbearable. The words were on the tip of his tongue, fighting desperately to come out but he refused.\n \n“Jaskier! Tell me what’s wrong!”\n \nThat was it.\n \nHe had to tell.\n \nSo, he opened his mouth to tell Geralt everything and to his surprise felt nothing but agony. His body twisted, seized on the dirt, as he gagged on the pain. Gods, the curse would kill him.\n \n“S-s-stop,” he choked out, tears streaming down his cheeks. “I…don’t make me.”\n \nGeralt hovered nearby. “Jaskier, what is wrong?”\n \n“T-t-tell m-me I don’t have to. Tell me to stop.”\n \n“Stop,” Geralt said quickly. “Stop Jaskier, you don’t have to tell me.”\n \nAnd the pain was gone so quickly he was left dizzy. He lay on his back, gulping in huge breaths of air as the pain left him feeling empty and wrung out. What had happened? Geralt’s command to tell him about the curse should have let him talk about it. Instead it had made everything worse.\n \n“Obedience curses are old and tricky,” Geralt rumbled. “You can’t break commands that the caster of the curse put on you. I’m guessing they told you not to say anything.”\n \nHe couldn’t answer.\n \n“Ah…okay then,” Geralt sat in the dirt next to him, scrubbing his hand through his dirty hair. Slowly, Jaskier forced himself to a sitting position and used his already ruined shirt to wipe his bloody face. They sat for a moment in silence, Jaskier’s anxiety ramping up.\n \n“Say something,” he murmured.\n \n“I’m trying to think of something to ask that won’t trigger…that again,” Geralt pursed his lips. “I don’t know much about those kinds of curses…just what was written in some of the old texts. I know that they aren’t allowed so whoever did this to you has broken every law set forth by the brotherhood.”\n \n“She didn’t care,” there was a tingle in his chest as a warning.\n \nGeralt was quiet for a long moment. “The djinn’s curse shouldn’t have done that to you…but two curses acting out at once would. I’m sorry.”\n \n“You didn’t know,” Jaskier whispered.\n \n“You couldn’t tell me,” Geralt sighed.\n \n“You don’t…don’t have to feel guilty. I’ll just go then…once I get my legs under me,” he closed his eyes. Jaskier waited for the sound of Geralt walking away but that sound never came. He cracked an eye open to find the Witcher staring at him. “What?”\n \n“I’m not going to leave…not unless you want me to,” Geralt’s brow furrowed. “Do you know how easy it is to take advantage of someone in your state.”\n \n“Oh, I’m very aware,” the bitterness in his voice made Geralt go quiet.\n \nThe Witcher’s hand raised, as if to rest on his arm and then fell to his side again. “I can try and help you. Maybe we can figure out how to break this curse.”\n \n“You think I haven’t tried? You think I haven’t scoured the Continent for a cure?” Jaskier glared at him.\n \nGeralt sucked in a short breath and furrowed his brows again before getting to his feet. “I say we should go.”\n \n“What?”\n \n“That’s not a command is it? We should go. I’m sure the next town has a contract,” Geralt quirked his head to the side. “So…I think we should go.”\n \nJaskier struggled to his feet, staring blankly at Geralt. “Make me do it.”\n \n“What?” Geralt frowned.\n \n“You can make me, do it,” the bard’s hands clenched into fists.\n \nGeralt stared him down. “I won’t. I won’t make you do anything you don’t want. You can come with me if you want or we can part ways here.”\n \nA rush of relief almost made him faint, his body swaying. It was a silly request he made, a test to see if Geralt would maybe take advantage. “You promise you won’t tell me to do something?”\n \n“I swear it,” Geralt’s voice was steady and calm, his eyes warm amber.\n \nJaskier blinked a few times. Gods, he wanted to trust someone, anyone…but Valdo had promised not to say anything either. It always sounded good and honest, the promise not to command, but the urge to have control always won out.\n \n“Who cast the curse on you?”\n \n“Can’t tell you.”\n \n“Why did they do it?”\n \n“Can’t tell you.”\n \n“How long have you had it?”\n \n“Can’t tell you.”\n \n“Hmm.”\n \nThere was another long silence before Geralt got to his feet and offered a hand. Jaskier stared at it and the Witcher let out a huff. “Do I have to make you take it?”\n \nA small smile lifted the corners of his mouth as he accepted Geralt’s hand, gasping when he was practically lifted to his feet.\n \n“We should go.”\n \nIt wasn’t a command.\n \n“Let’s go.”\n \n--\n \nThings were strange after the knowledge of the curse was common knowledge.\n \nGeralt questioned every mage, healer, and herbalist about breaking obedience curses but no one knew anything. It was old, forbidden magic and caused incredible discomfort just talking about it. They left without any information and pitying gazes following them.\n \nStill, Geralt was determined to find something out, questioning people with an almost manic energy.\n \nAnd…it was okay. There wasn’t the crippling fear that he would use the curse to hurt him. There wasn’t any reason to really trust Geralt other than his gut and he was putting a lot of faith in that. It seemed Geralt understood that and took that heavy responsibility very seriously.\n \nOf course, it didn’t go perfectly.\n \nThey had a rather simple contract for a few drowners. Easy enough, Jaskier had seen the Witcher fight a thousand of them. He had written enough songs about the smell of acrid water and the wet claws of death straining towards him.\n \nSo, he perched himself on a rock with his lute right by a pond and strummed away.\n \n“I’ll be right back,” Geralt growled as he finished oiling his sword, pulling his shoulders back and glaring deeper into the swamp. “Don’t move.”\n \nThe command took over faster than he expected and Jaskier was rooted to the rock. He couldn’t even open his mouth to call back Geralt as he stalked away and was instead left. Jaskier internally rolled his eyes, resigning himself to just wait until the Witcher returned and realized his mistake.\n \nIt took forever and Jaskier feared he would honestly die of boredom. He couldn’t even strum at his lute, instead having it lie frozen in his hands.\n \nGods, how long had it been?\n \nMinutes?\n \nHours?\n \nDecades?\n \nCentu-\n \nSomething crashed into his back and Jaskier didn’t even have time to be surprised before the cold water swallowed him up. He couldn’t kick or grab anything. He couldn’t gulp in any air. He just tumbled into the water like a rock and sank like one too.\n \nWhatever had shoved him into the water was clawing at his doublet, shrieks muffled by the water. Jaskier’s lungs screamed and his body burned with the desperate desire to move but he just couldn’t.\n \nThen the thing was gone and he was left in terrible, terrible silence.  \n \nA strong hand gripped the back of his doublet and hoisted him out of the water, struggling a bit with his awkward positioning.\n \n“Damnit Jaskier! Move!” And his limbs went limp before he dissolved into coughs. A dead drowner lay nearby and Geralt’s yellow eyes hovered over him.\n \n“You told me not to move!” He choked out.\n \n“I did,” guilt was a strange look on the Witcher’s face. “Are you alright?”\n \n“No I’m not alright!” Jaskier shrieked and a faint smile quirked at Geralt’s lips. “I almost drowned!”\n \n“You’re alright,” Geralt patted him on the shoulder. “Just…take a few deep breaths if you want or don’t.”\n \n“Don’t tell me what to do,” Jaskier grumbled, shaking water out of his boots. “That’s what got me into this bloody mess.”\n \nGeralt made a huffing noise and Jaskier realized he was laughing. The bard stared at him, aghast. The Witcher shook his head. “I’m sorry. It’s not funny.”\n \n“It’s not! Watch what you say!” Jaskier waved a finger in his face. “It’s the little things! Don’t say things like…’hold your breath’ or ‘hit the hay’ or…’go fuck yourself!’”\n \n“Have you been told that before?” Geralt looked horrified.\n \n“I’ve been told a lot of things,” Jaskier huffed, crossing his arms. “But…no…not exactly that.”\n \n“I find that hard to believe.”\n \n“Oh ha, ha,” Jaskier rolled his eyes.\n \n“I am sorry you know, that wasn’t intentional,” Geralt did look a bit guilty at that. “I thought you could fight it…I mean I know it’s painful but if it was your life on the line?”\n \n“I was surprised! It takes a huge amount of focus and concentration. Didn’t have a lot of that when I was shoved into freezing water,” Jaskier grumbled. “You owe me.”\n \n“Sure, sure.”\n \nThe Witcher waited patiently for him to get his wits together and listened to him complain the entire way back to the inn about how cold he was. It was almost like he was ignoring him, the ass! Jaskier was practically seething by the time they returned.\n \n“I’m going to the room,” he snapped before stomping up the stairs to the room he was sharing with Geralt.\n \nFirst, even before he changed into dry clothes, he grabbed one of Geralt’s clean shirts (it only seemed fair) and carefully cleaned and dried his lute. Only when the instrument was shining and put up to dry did he relax slightly.\n \nA knock startled him. “No Geralt! I’m not done being mad!”\n \n“Um…I’m not him?” A girl’s voice startled him and he opened the door to see two young maids and a pot of boiling water. “A bath sir? The…gentleman downstairs paid for it and specified that it was only to be brought in if you wanted it. We were not to tell you that you had to.”\n \nJaskier blinked at them.\n \nSo…the Witcher really did feel guilty.\n \nHe would be stupid not to take advantage of this.\n \nJaskier luxuriated in the steaming bath, breathing in the oils and bath salts that he had picked out. With each breath he relaxed more and more.\n \nGeralt had come back to save him. He was the one who chose to follow a Witcher, he had to know that danger would come to him. Still, danger had come and Geralt had saved him. He wasn’t in danger around him.\n \nMaybe that’s why he was so angry. It was normal to be angry when faced with an unfamiliar emotion, lashing out instead of trying to figure it out. It was trust. He trusted Geralt and knew that he wouldn’t intentionally hurt him.\n \nThat certainly wasn’t familiar.\n \nBy the time he got down the stairs, freshly bathed and in clean clothes, he could see that Geralt was waiting at a back table with two mugs of ale. The Witcher didn’t say anything, just pushed the mug in front of him.\n \n“I’ve decided in my heart of hearts to forgive you,” Jaskier sat down and took a swig. “Don’t do it again.”\n \n“Wouldn’t dream of it.”\nJaskier wasn’t a stupid man.\n \nHe knew people, he knew the damage they could do and the pain they could cause. At this point in his life he knew the worst that people were capable of. It was a point of sick pride that he could look at a person and tell what they would command him to do in case they found out about the curse.\n \nThe busty barmaid behind the counter? Pay twice the cost for the ale.\n\n \n\nThe stablehand who eyed Roach. Give me the horse.\n\n \n\nThe drunkard in the tavern who grabbed at him…well, he didn’t have to imagine that one.\n \n“Come here love,” he slurred out and Jaskier’s feet moved on their own. “Sit in my lap and do that little dance again.”\n \n“Jaskier don’t go to him,” Geralt growled out from where he was lingering nearby. Then the Witcher turned to the man and glowered, making him shrink back. “You go home.”\n \nThe man slunk out and Jaskier gave Geralt a small smile before continuing his performance. The Witcher settled back down and watched him carefully, looking out for another sketchy individual who could take advantage.\n \nIt was nice, feeling protected for the first time ever.   \n \nBut it still put him on edge. Jaskier wasn’t…quite sure what Geralt wanted. How could helping him serve him? That was all people wanted by the way, something for themselves. Once they found out that he couldn’t refuse they would start thinking of how it would help them.\n \nGeralt hadn’t cashed in, so to speak. He hadn’t commanded Jaskier to do anything but the bard knew it would come. It always did.\n \n“Why do you insist on sharing a room?” Jaskier blurted as they climbed the stairs, pockets heavier with coin and stomach’s full.\n \n“Cheaper.”\n \nJaskier raised an eyebrow at the grunt. “We have the coin for it. Maybe then you can take one of those lovely ladies upstairs. You know, the ones who had their corsets so tight their tits were practically at their chins?”\n \nGeralt rolled his eyes and walked into the room, barely holding the door open long enough for Jaskier to slip through.\n \n“It doesn’t matter the man, mutations or not, everyone needs release every so often,” Jaskier rambled. “Especially if you are constantly swinging that huge sword around which is a overcompensation if I’ve ever seen one.”\n \n“Do you want me to take a whore?” Geralt asked, sitting on the bed and taking his boots off.\n \n“Well…I’m just saying you don’t have much of a chance with me in here. Unless…don’t you dare bring a lady back if I’m in here. I am a light sleeper on the best of days and I don’t need to hear you grunting away.”\n \n“That’s all I do then?” Geralt’s eyes sparkled. “Tell me then, what should I do?”\n \nIt was clearly meant to be a jest but the curse didn’t exactly recognize sarcasm.\n \n“You do what they tell you to do,” the words tumbled out. “You touch them right and make them writhe with pleasure. You lose yourself and just follow directions and-“\n \n“Stop Jaskier,” Geralt seemed to recognize what he had said and his face went stony.\n \nJaskier’s mouth clicked shut and he pressed a hand to it, eyes wide. “I’m sorry.”\n \n“It’s not your fault,” Geralt huffed and looked down for a moment. “Has…have people taken advantage of you in that way?”\n \n“Well, I didn’t exactly say no,” Jaskier tried to joke but it fell unbelievably flat. “It’s fine. It’s in the past.”\n \n“Who?”\n \n“Geralt…”\n \n“Who commanded you to do that?”\n \nJaskier hesitated but Geralt’s command never came. He would allow Jaskier to keep this to himself if he wanted. “The Countess de Stael was the first…when I was sixteen. I think she was spoiled and bored with courtly life and wanted something to play with.”\n \n“You told me about her, about how she was your greatest love,” Geralt’s brow furrowed.\n \n“Not my words unfortunately,” Jaskier grumbled and there was a long silence. Finally, the bard gave Geralt a teasing smile. “Why? Are you going to go defend my honor? Slay the beast for taking my virtue?”\n \n“Yes.”\n \nSilence again.\n \n“Oh,” Jaskier blinked, unsure of what to say.\n \n“I would very much like to separate her head from her body but only if you want it to,” Geralt shrugged. “Maybe not today or tomorrow but…someday I would like her to pay for her sins.”\n \nJaskier was oddly…touched.\n \n“I’ll let you know if I ever want her murdered,” Jaskier mumbled.\n \n“Not murdered. I don’t murder monsters, I slay them,” Geralt’s eyes flashed and for a moment Jaskier could see the animal that so many people were convinced he was.\n \nJaskier sighed and sat down on his bed, stretching his legs out. “I could make a list you know; of monsters you should consider slaying.”\n \nGeralt grimaced at that. Another awkward silence followed where Jaskier tapped the tips of his boots together, just wanting to fill the silence with something.\n \n“You asked why I get us a room together?” Geralt spoke up. “It’s because I imagine all the ways you can get hurt. Anyone can go to your room and you wouldn’t be able to do anything. You nearly died once because I stupidly told you to do something. I don’t want it to happen again because I wasn’t there to tell you to stop.”\n \nSomething warm blossomed in Jaskier’s chest.\n \n“No one has ever tried to help before,” he whispered. “They either use it or they ignore it until…they use it.”\n \n“I can’t promise that I’ll never slip up again but…I couldn’t do that,” Geralt shook his head.\n \nJaskier kicked off his boots and tried to ignore the way his heart pounded in his chest. The survivor in him tried desperately to think of how this could be a lie, a way to get him to let his guard down, but hope burned bright.\n \nMaybe he found someone he could trust. Maybe he didn’t have to worry about being hurt anymore.\n \n“Thank you,” he whispered.\n \n“Don’t tha- I mean, you don’t have to thank me for being decent,” Geralt shrugged lightly and started laying his weapons out on the table next to him.\n \n“I haven’t met many decent people, I think it is something to be appreciative for,” Jaskier smiled, watching carefully as Geralt ducked his head slightly.\n \n“Just go to sleep,” the Witcher snapped, dropping his dagger with a clatter on the table.\n \nJaskier grinned and plopped down on the uncomfortable mattress before falling into the most restful sleep he had ever had.\nThe shrieks of the harpies were deafening.\n \nJaskier pressed his back against the slightly damp rock wall, eyes following the arch of Geralt’s sword as it sliced off one of the harpy’s wings. The creature fell into a crumpled heap, barely getting a garbled scream out before Geralt skewered it through the chest.\n \nTwo more of the monsters swooped down at Geralt and Jaskier let his gaze drop to the corpses already littering the ground. The wings were the only pretty thing about them, the iridescent feathers glimmering in the sun.\n \nWhat if he got one of the feathers?\n \nWouldn’t that look wonderful in his hat as he sang the epic of Geralt’s battle against the harpies?\n \nHe inched forward to the nearest corpse, trying to ignore the way its face grimaced up at him. His fingers brushed against the feather closest to him when filthy, ragged talons wrapped around his wrist. Jaskier was hardly able to gasp out a sound of pain before he was spun around to face a snarling harpy.\n \nThe creature before him was hideous, too sharp teeth barely fitting in its mouth as it hissed. Grey skin pulled in a terrible way as it tightened its hold on him.\n \n“It steals what does not belong to it,” the harpy hissed out, words slurred and hoarse. “It takes what it does not own.”\n \nThankfully, Jaskier had enough sense to reach to his belt and unsheathe the dagger Geralt had insisted he wear. Unfortunately, he should have taken Geralt up on the lessons he had offered because the harpy grabbed his other wrist and dug in talons deeply.\n \n“Fuck off!” Jaskier snapped, voice high. “Geralt!”\n \n“Stupid, stupid, stupid,” the thing clicked, breath vile. “It kills me? That is a laugh! Go, do it. Kill this one.”\n \nAnd a strength he didn’t know he had over came him. His arm pushed against the talons, heart pounding so hard and adrenaline rushing so that he couldn’t feel the talons push in deeper or blood running down.\n \nThe harpy managed to look surprised for a second as he slipped past its hold and slammed the blade into its feathered chest. It scratched at him a few times, shrieking as he continued to stab at it until the blood made his hands slip and the blade fell from his hands.\n \nWings spread out, gargling on its own blood, the harpy fell back and spasmed a few times before lying perfectly still. Jaskier stumbled back, suddenly feeling weightless without the curse steering him.\n \nSuddenly, the blood on his hands felt too hot and too tacky. His breathing sped up but he couldn’t get enough air in, head growing fuzzy. Jaskier felt his legs give out and he fell into the blood soaked grass. The knife glinted next to him and an intense wave of nausea overwhelmed him.\n \nHe was still gagging on his own vomit when a strong hand twisted in the back of his doublet, heaving him to his feet. Jaskier weakly struggled for a moment before he realized it wasn’t a monster grabbing him but Geralt, frowning at him.\n \n“Where?” He growled out, eyes still black with the potions.\n \nJaskier blinked at him, tears obscuring his vision.\n \n“Where were you injured?” Geralt fixed him with an intense stare, looking him over.\n \n“I…I killed it,” he squeaked out.\n \nGeralt grunted and practically carried him off the battlefield. If he wasn’t so rattled he might have been embarrassed at how the Witcher plopped him next to Roach. He might have even been embarrassed when he threw up again as Geralt brought over a twisted, monstrous harpy head to tie to the saddle.\n \nNot a word was spoken as they trekked away from the nest, Geralt leading them to a clearing. The Witcher pulled down his bag and motioned for Jaskier to take a seat against a large oak tree. Jaskier didn’t need to be told twice and slumped against the bark, holding his arm against his chest.\n \n“Can I see?” He could tell that Geralt was going out of his way to not make a command.\n \nJaskier’s eyes flicked up but he allowed Geralt to take his wounded arm, surprised at the gentle touch. The harpy’s talons had torn into his arm quite deeply, it was still bleeding but had slowed down a bit. The Witcher worked silently and quickly, cleansing the wound and wrapping it in several layers of soft bandages.\n \n“Can you wiggle your fingers for me?” Geralt finally mumbled, nodding as Jaskier made a little wave. “Just a flesh wound. You’ll heal.”\n \nHis arm felt heavy as he wrapped his good hand around the bandages. “I killed it.”\n \n“You said,” Geralt fixed him with a sharp look.\n \n“It told me to kill it,” he whispered and Geralt paused for a moment before pulling a vial out of the bag. “It…challenged me I guess but…I didn’t think that monsters, things could command me. I thought it was just humans.”\n \n“Should have figured that out when I told you what to do,” Geralt made an attempt to joke but neither of them smiled.\n \n“It happened once before,” Jaskier blurted out, knees pulling up to his chest. “When I was a boy…some children took me to a pile of newborn kittens. They had found out about the curse and told me to kill them…the wring their necks.”\n \nGeralt froze completely, eyes fixing on him. The black was fading back to their usual yellow.\n \n“They stopped me before I did but…I was always so scared that someone could make me do that. I fought against it but every time I give in…I can’t hold back forever. And this time I didn’t even hesitate, I didn’t even think about it,” his voice cracked. “And if that thing could control me, who couldn’t?”\n \n“Jaskier-“\n \n“And what else could someone make me do?” Jaskier knew he was getting a bit hysterical. “Steal for them? Kill for them? How am I any better than those monsters you hunt? When would you be told to hunt me?”\n \n“I wouldn’t.”\n \n“I would want you to! I would! If someone makes me into a thing, I want you to,” Jaskier leaned forward and grabbed at Geralt’s armor. “I’ve lost myself before, lost months and didn’t know what was happening. What if that happens and I have taken someone’s life? How does that make me different from those things?”\n \n“Because you are good,” Geralt grumbled, crouching down in front of him. “You are good and this curse doesn’t take that from you.”\n \n“I’m so fucking tired of fighting it,” Jaskier choked, tears finally spilling over. He pressed his hands into his face and shuddered. “It’s never going to end.”\n \nThere weren’t any placating words or false hope. Geralt just sighed heavily and sat down next to him, armor clanking. “So, what do you want me to do?”\n \nJaskier just shook his head, scrubbing at his face with little thought to how blotchy and red it might be. “I don’t know.”\n \n“Because I would rather not kill you, seems like a waste of good when there is so little around,” Geralt’s voice was deep and warm. “And I’ve seen many, many, many monsters. You are not one of them.”\n \nJaskier sniffed. “I don’t feel that way sometimes.”\n \nThere was a heavy sigh at his side. “I understand that all to well. That’s why I want to find you a cure. One of us shouldn’t be burdened with a life someone else chose for us.”\n \nThat was enough to make Jaskier look up and lock eyes with Geralt, relieved that they were back to their normal yellow. “What if it is never broken?”\n \n“Then I suppose I can stay to make sure you never turn into this monster you are so afraid of,” Geralt shrugged. “That is, if you want me to stay.”\n \n“I do,” Jaskier nodded furiously. “I really do.”\n \n“Then I will.”\n \nJaskier felt himself relax at that.\n\n“Can you fight it?” Geralt asked as they made their way through a seemingly never ending field. \n\n \n\nJaskier glanced up from the daisy chain he had been making, fingers flying over the stems as he stood down to gather a few more flowers. “The daisies?”\n\n \n\n“Yes,” Geralt rolled his eyes so hard Jaskier wondered if he was at risk for straining them. “That is exactly what I meant. Can you fight the flowers?”\n\n \n\n“I’m sensing sarcasm from you Geralt and I must say that it is not your best look,” Jaskier sniffed and tied another daisy to his chain. \n\n \n\nThe faintest smile quirked at the witcher’s lips. “I meant, can you fight your curse?”\n\n \n\n“Kind of,” Jaskier shrugged. “I try but the pain gets worse until I comply or until the commander takes it back.”\n\n \n\n“How far have you gone?”\n\n \n\nA faint shiver ran up Jaskier’s spine and he sucked in a deep breath. “It’s easier not to fight.”\n\n \n\nGeralt hummed, eyes narrowing slightly. He seemed deep in thought for a moment before climbing off Roach, halting Jaskier with a hand to his chest. “Maybe it just takes practice, like swordsmanship. Have you tried that?”\n\n \n\n“No.”\n\n \n\n“We could you know...practice?” Geralt had his awkwardly twisted face on that he normally wore when they spoke about the curse.\n\n \n\n“Flex my disobedience muscles?” Jaskier teased, not wanting to give away how anxious the thought made him. \n\n \n\nOf course Geralt saw right through that mask but he waited until Jaskier’s shoulders relaxed and he sighed heavily. The walk continued then but with a strange new silence. The bard was deep in thought, trying to push beyond the fear and anxiety.\n\n \n\n“I can try,” he finally mumbled but Geralt’s keen ears caught it easily.\n\n \n\nIt wasn’t brought up against until they had made camp in a small thicket of woods. Jaskier was quite proud of the fire he had built and Geralt had two rather juicy rabbits roasting away. It was comfortable, it was nice.\n\n \n\n“Alright,” Geralt stood up, wiping his hands clean on his trousers (something Jaskier despised). “Let’s practice.”\n\n \n\n“While our dinner cooks?” Jaskier whined. \n\n \n\nGeralt let out a grunt and moved to stand in front of him. “Don’t make excuses.”\n\n \n\nWith a grumble, Jaskier stood as well and wrung his hands a bit. The anxiety and nerves were spiking and his muscles tensed, ready to flee at the first sign of danger. “Can...can I ask you something though?”\n\n \n\nGeralt hummed. \n\n \n\n“Can you not...make me cause myself pain? Like, don’t tell me to put my hand in the fire or break my own fingers,” the idea of being made to ruin his fingers, to not be able to play his lute was sickening. \n\n \n\n“I wouldn’t,” Geralt’s head jerked and a frown pulled at his lips. \n\n \n\n“Alright then,” Jaskier hopped a bit on his feet, sucking in a quick breath. “Let’s do this.”\n\n \n\nThe witcher studied him, amber eyes tracing over his frame before speaking. “Jaskier, stand on one foot.”\n\n \n\nWithout a thought, his left leg lifted and he scowled. “Sorry! Sorry, I didn’t think.”\n\n \n\n“It’s fine,” he watched carefully as Jaskier forced his foot back onto the ground. \n\n \n\nInstantly a deep ache settled in his bones, starting at his foot and then spreading up to his thigh. Jaskier felt his forehead break out into a sweat and his leg started shaking, desperately trying to follow the command and spring up.\n\n \n\nNo.\n\n \n\nHe had to try.\n\n \n\nA groan was torn from deep in his chest as the pain increased but Jaskier just sucked in a breath. Geralt watched him carefully, face carefully blank. The pain grew until it felt like his muscles were going to wrench themselves from the bone and tears gathered. \n\n \n\nHis leg lifted and the pain vanished, leaving him panting.\n\n \n\n“Relax your leg,” Geralt growled out and Jaskier relaxed, bracing his hands on his knees. His body trembled and his leg burned a bit. “Now lift your arm up.”\n\n \n\nThis time Jaskier was somewhat more prepared. His arm trembled a bit but he made sure to strain against it, keeping it tight against his body. The pain grew faster this time and his fingers began to spasm. \n\n \n\nA choked cry burst from his lips and he gagged a bit on the pain. Hot, thick liquid burned at his nose and blood started dripping down his lip. Something changed in Geralt’s eyes, something close to concern flashing across them. The pain was \n\nagonizing\n\n, so terrible that his vision blurred and his stomach rolled. \n\n \n\n“Stop,” Geralt said sharply and with the sudden release Jaskier stumbled backwards, feeling faint.\n\n \n\n“Why’d you stop?” His words came out slurred and Jaskier shook his head, trying to clear it of the fuzziness. \n\n \n\nThe witcher stared at him before stepping closer, lifting one large hand to lightly wipe under his eye. For a moment, Jaskier was embarrassed at the thought of Geralt wiping his tears away until he saw the red smear. \n\n \n\n“You started crying blood,” Geralt frowned at the blood and Jaskier scrubbed at his face, smearing it. \n\n \n\n“Oh.”\n\n \n\nThere was no more practice that night. Jaskier crept off to a nearby stream to scrub at his face until it burned, watching the red flow away. He crept back to find that Geralt had his dinner prepared and ready. \n\n \n\nThey ate in silence.\n\n \n\n“I’ve never gone that far before,” Jaskier whispered. “I bet I can do more if I tried.”\n\n \n\n“Absolutely not,” Geralt shook his head.\n\n \n\nJaskier frowned at him, ignoring the faint flare of pain when he turned his neck. “Why? I was doing it!”\n\n \n\n“And I’m sure you would have continued to do so until your head exploded,” Geralt glared into the fire. “We’ll find another way.”\n\n \n\n“That would have been...messy,” Jaskier scrunched up his nose. \n\n \n\n“I thought it would work...that you just needed to fight through it,” Geralt’s lips pursed together. “I didn’t think it could kill you. I didn’t realize how powerful it was. We’ll find another way.”\n\n \n\nJaskier stared at the flickering flames, chest feeling equally as warm. No one, \n\nno one\n\n, had ever tried to help him like this before. His mother and the countess used the curse for their own selfish gain. Valdo told him all kinds of sweet lies but kept it in his back pocket in case he needed to use it. \n\n \n\nNot Geralt.\n\n \n\nThere were plenty of times the curse probably could have made his life easier. He could see it in the way Geralt’s jaw tightened as he rambled on and on, fighting the urge to tell him to stop talking. He could see it in the way Geralt’s eyes followed him while he performed; ready to step in if any drunk patron called out a command. \n\n \n\nIt was strange...being treated with respect. \n\n \n\nIt was strange to be treated like a person first and not an object. \n\n \n\nMaybe it was a touch of insanity but Jaskier knew that now was the time. He held his breath for a moment before turning to Geralt and leaning in close, nervously watching the confusion flicked across Geralt’s face.\n\n \n\n“Please don’t punch me,” he whispered before pressing their lips together. \n\n \n\nGeralt didn’t move, didn’t even seem to breathe for the few seconds Jaskier kissed him. The bard pulled back, heat burning at the back of his neck. His heart raced painfully in his chest and he stared down at his hands, waiting for the inevitable explosion. \n\n \n\n“You don’t have to do that,” Geralt’s voice was incredibly soft, gentle even. \n\n \n\n“What?”\n\n \n\n“You don’t...owe me that. You don’t need to pay for protection or...” Geralt reached up to rub his neck. “I don’t expect that from you.”\n\n \n\n“It wasn’t payment,” Jaskier bit back, embarrassed and overwhelmed. “It wasn’t! I don’t know...I just wanted to. I wanted to...”\n\n \n\nSilence again. \n\n \n\n“Oh,” Geralt finally let out.\n\n \n\n“And I know that you don’t feel the same and that is understandable,” Jaskier rambled. \n\n \n\nGeralt lifted a hand and lightly tapped his fingers on his lips. “I don’t understand why you would feel that way at all. I’m not someone worth...that.”\n\n \n\nThe fire crackled loudly as a log shifted, sparks floating up into the night air. Jaskier watched them flicker out and tightened his hands together, feeling the slight ache in his fingers. \n\n \n\n“You are,” he muttered. “You’re...you’re good. You’re a good person.”\n\n \n\nHe could tell that Geralt recognized the words at the way he ducked his head a bit. “Jaskier, when you said I don’t feel the same...how do you feel?”\n\n \n\nJaskier sucked a breath in through his teeth. “I feel safe with you, more than I ever have with anyone else.”\n\n \n\n“Any decent person would have done that,” Geralt mumbled.\n\n \n\n“No they wouldn’t,” Jaskier shook his head. “I...I feel different with you and I can’t expect you to feel-”\n\n \n\n“I do,” Geralt interrupted, leaving Jaskier gaping at him for a moment. “I do Jaskier.”\n\n \n\n“Oh,” he whispered. \n\n \n\n“And I worry that I said something or did something to compel-”\n\n \n\n“No,” Jaskier shook his head. “You didn’t. I promise.”\n\n \n\nGeralt’s entire body relaxed at that and he nodded. “Good.”\n\n \n\n“Yeah? Good?” Jaskier couldn’t help the silly grin that spread across his face. \n\n \n\n“It’s good,” his heart jumped at the faint smile Geralt gave him.\n\n\nJaskier would have given anything to have missed the look on Geralt’s face when he spotted the witch. \n\n \n\nHe had been in the middle of admiring the truly impressive women sitting in front of him, teasingly flirting with them to try and get some sort of reaction. Usually, this would result in Geralt rolling his eyes but the witcher’s attention seemed to be stolen by something else. \n\n \n\nThose yellow eyes widened, his mouth went slightly slack, and his posture went perfectly straight. Dreading what he would see, Jaskier followed his line of sight to the beautiful dark haired mage at the entrance of the pub. \n\n \n\nHe shouldn’t be heartbroken. He really shouldn’t be. He and Geralt had never truly said what this...relationship was. They knew there was an attraction there, there was a trust there, but that was all that had been established. Jaskier never uttered the longing words out loud and seeing the look Geralt fixed on Yennefer the words shriveled to dust in his mouth.\n\n \n\nWhat did a few kisses mean when Geralt looked at her like \n\nthat\n\n? \n\n \n\nHonestly, he did this to himself. Jaskier knew that feelings led to disappointment. He had gotten too attached and that had never led to anything good in the past. \n\n \n\nStill, it didn’t mean he had to be polite to her. \n\n \n\n“Oh,” he huffed out, shaking his head. “Oh no, no, no, no, no. Thank you so much. It’s been very nice. Thank you for the wine and the pies, but as the man said we really can’t get involved. Geralt, shall we?”\n\n \n\n“I’m in.”\n\n \n\nThose two words made something crack in his chest, shards cutting deep.\n\n \n\nEven as he walked up to the start of the hunt he felt the sharp pain everytime he inhaled. Those shards dug in deeper as he watched Geralt’s eyes flick around, clearly looking for something (someone). \n\n \n\nThen the witch herself strode up to them, elegant coat swirling around her ankles. A sly smile quirked at her lips. “How is it that I’ve walked this earth for decades without coming across a witcher, and then the first one I meet I can’t get rid of?”\n\n \n\nJaskier glowered at her and Geralt cocked his head slightly. \n\n \n\n“I’d say something strange is afoot but then again witchers are bound to run into monsters eventually,” Jaskier spat out and Yennefer smirked, violet eyes sliding to him.\n\n \n\n“Jaskier,” her voice was oily. “How is the curse?”\n\n \n\n“Just amazing Yennefer, thank you for asking,” he ground his teeth together. \n\n \n\nAnd Geralt said nothing. \n\n \n\nThe anger simmered into a flame and he stormed off, not wanting to see that viper sink her fangs any deeper into Geralt. As petty as it was he did feel a small swell of satisfaction as she sauntered over to the cartoonish storybook knight and pet at his face. \n\n \n\nPart of him wanted to go over and talk about how vile Yennefer was, tell him how evil she was but...who was he to say that? Could he really blame Geralt for turning attentions towards the beautiful, powerful sorceress? What did he have to offer? He was a cursed bard and that wasn’t about to change anytime soon. \n\n \n\nHe had nothing to offer and she had everything. \n\n \n\nIt wasn’t fair. \n\n \n\nBut when had anything ever been fair to him?\n\n \n\nJaskier was still in a foul mood as they set out on their trek. He should have been inspired by the beautiful scenery or the thrill of the hunt but everything was too much. The dwarves were too loud and crass, the Reavers were too foul, the stupid knight was too dramatic (which was a lot coming from him) and Yennefer was too...\n\n \n\nUgh.\n\n \n\n“You worry if you blink you won’t be able to see her again,” Borch said to Geralt, voice teasing, and Jaskier quickened his step a bit. “You love her.”\n\n \n\nOh.\n\n \n\nNo, no, no.\n\n \n\nEven his heart was silent as he awaited Geralt’s reply. “Or, the danger here isn’t the dragon.”\n\n \n\n“That is why I brought you here Geralt of Rivia, nothing scares you.” Borch laughed lightly. \n\n \n\n“Then you don’t know Yennefer of Vengerberg.”\n\n \n\nJaskier scowled and dropped further behind, shifting his bag onto his back. Borch’s two guards, Téa and Véa, overtook him and glanced back. Their eyes were dark and calculating and Jaskier found himself shrinking at their gaze.\n\n \n\n“Keep up cursed boy,” Téa said softly and he would have frozen in place if his feet didn’t instantly speed up. Fear gripped at his heart but the Zerrikanian’s lips lifted in what could be considered a smile. \n\n \n\n“How did you find out?” He sputtered when he was close enough, nervously glancing about to make sure that no one else was around. \n\n \n\nVéa nodded towards Borch. “He knew so we knew.”\n\n \n\n“Ah...and...”\n\n \n\n“And that is all, nothing more will come of that knowledge,” Téa said simply. \n\n \n\nJaskier pursed his lips together, the familiar desire to run and protect himself was strong, but then he glanced at Geralt. He should go over and tell Geralt, he should express how uneasy he felt but...would Geralt even care?\n\n \n\nWould he abandon this hunt for Jaskier when Yennefer was here?\n\n \n\nSo, Jaskier kept his mouth shut and followed Téa and Véa. \n\n \n\nOf course, when they got closer to the group Jaskier’s nervous tick came into play. He started rambling, talking about anything and everything, but the two women were just as deep conversationalists as Geralt was. \n\n \n\nPart of him appreciated it, he got out nervous energy by talking, but he was also overwhelmed by his anxiety. \n\n \n\n“A cactus if she’s really into it,” he twisted his hands into the strap of his bag. “Ladies! You look famished. Allow me to wander aimlessly into this thicket and retrieve for you, uh...a tasty afternoon treat!”\n\n \n\nThat got Téa and Véa’s attention. The two warriors turned to him and Véa raised an elegant eyebrow as he stumbled into the brush. He heard them sigh and continue down the path but he was too far in at this point. \n\n \n\nMainly, he just wanted to get away from everyone else.\n\n \n\nHe could feel Geralt’s stare against the back of his neck, and ignored it. A flare of frustration flickered in his chest and Jaskier grit his teeth. He could do this. He wasn’t entirely helpless.\n\n \n\nThen, as he was picking at possibly edible berry he heard a soft whimper. \n\n \n\nTwo huge eyes peered nervously up at him through the grass and Jaskier’s heart just melted. The clearly terrified creature and he locked eyes and he smiled slightly.\n\n \n\n“There’s something back here! Sort of looks like a faun!” He called out, glancing back at the crowd watching him. He then turned back to the creature and smiled again. “Hello there. Hello little fellow. Aw, aren’t you just the cutest...”\n\n \n\nThen it made a deeper sound and stood up, skeletal body towering over Jaskier as it opened a fanged mouth.\n\n \n\n“Most terrifying thing I’ve ever seen in my entire life. Right, run away, run away! Geralt!” He tripped over his own feet a bit as he scrambled back to the group. Out of the corner of his eye he could see Geralt stiffen, grab at his sword and then pause. \n\n \n\n“It’s a hirikka,” Geralt sounded almost bored but he still moved his body to slightly shield Jaskier behind him. “It’s probably starving, sheathe your weapons.”\n\n \n\nThen, the caricature of a knight strode forward and hacked the poor creature to bits.\n\n \n\nJaskier sucked in a breath, staring at the emaciated body as it slumped to the ground. Eryk kept slashing at the hirikka and he heard Yennefer let out a small sound of disgust next to him. \n\n \n\n“For kingdom and glory!” He shrieked and Yennefer darted ahead.\n\n \n\n“Sir Eryk!” She had made her voice high and needy. “You could have been killed.”\n\n \n\nGeralt scoffed. “If we’d fed it, it would have gone away.”\n\n \n\nThe rest of the day was spent in silence as Eryk took the head of the hirikka and carried it like a trophy. Jaskier ignored the glazed over eyes and stayed as close to Geralt as he could, ignoring the fact that he was angry at him.\n\n \n\nWhen they got to their campsite for the night, Eryk shoved the head onto a spike with a terrible squelching sound. The knight turned to smirk at the rest of them, focusing on Jaskier’s clearly horrified expression. \n\n \n\n“Bard, you shouldn’t feel any sympathy for the beast,” he said loudly, getting the attention from a few others as they set up camp. “They have no control over their base instincts. These creatures act without thought and that is why we are superior. We can make those choices.”\n\n \n\nJaskier pursed his lips. “We can also make the choice not to kill starving creatures just looking for scraps.”\n\n \n\n“You wouldn’t understand,” Eryk huffed and turned to Yennefer. “You don’t have a beloved to protect.”\n\n \n\nYennefer didn’t look amused in the least, violet eyes cold and flinty. She didn’t lift a finger to help the knight as he clearly struggled setting up a fire and put the creature’s corpse onto a spit. The meat itself smelt foul as it crackled on the flames but everyone avoided him completely. \n\n \n\n“Knights never waste a kill,” Eryk scoffed as he ate the meat right from his blade. \n\n \n\nThere was no way this moron had killed anything more than a deer, Jaskier thought. It was obvious that the other members of the party were equally as annoyed with the man as he was. His pencil scratched against the paper as he wrote own a few words that had popped into his head.\n\n \n\n\nThen the foolish knight\n\n\n\n\nCame upon a fight\n\n\n\n\nHe answered the call\n\n\n\n\nTo fight a child’s doll.\n\n\n \n\n\nThe doll nearly won\n\n\n\n\nThe battle nearly done\n\n\n\n\nAs the knight’s perfect hair\n\n\n\n\nFlew about without a care...\n\n\n \n\nHe lightly tapped at the paper, brow furrowed in thought. Jaskier was so focused on the words that he didn’t notice Yennefer’s flirtatious comments but he did notice Geralt’s response. \n\n \n\n\nPoison flowed from the whore’s lips\n\n\n\n\nClaws came from her fingertips\n\n\n\n\nShe was a-\n\n\n \n\n“Careful,” Geralt’s growling voice interrupted his thoughts and he glanced up. Boholt smirked at him, biting into the grey meat. \n\n \n\n“Oh? The witcher wants to play knight?” The man teased and Jaskier couldn’t help but smile at the image of Geralt in the stupid finery and pompous hair.\n\n \n\n“No. She’s plenty capable of killing you herself,” Geralt stared into the flames. \n\n \n\nAnd she was. Jaskier had seen a glimpse of her power and knew how destructive it was. Killing that stupid man would be as easy as crushing an ant. This damsel in distress act she was putting on apparently fooled Sir Eryk but Jaskier knew better.\n\n \n\nA grumbling sound broke the tense atmosphere and Eryk squirmed. “Oh dear...I’m afraid I must take my leave. Lady Yennefer, may I escort you to your tent?”\n\n \n\n“Would you be joining me?” She batted her eyelashes.\n\n \n\n“Um...my lady I would...” He doubled over slightly and Jaskier grinned. “...never degrade your honor in that way.”\n\n \n\n“I hate to break it to you but that ship has sailed, wrecked and sunk to the bottom of the ocean,” Jaskier snarked, fully expecting the light tap on his arm from Geralt. The knight tried to stay for half a second more before scurrying away, crouched over and groaning. \n\n \n\nJaskier almost felt bad for laughing when they found the body the next morning. \n\n \n\nIt was rather a rough way to go, throat slit as you shit out your insides, but Yennefer stormed away like the murderer had personally offended her. She seethed by their bags, eyes narrow and jaw tight. \n\n \n\n“Terribly sorry about your gallant knight,” Jaskier couldn’t help but poke at the wound and infuriated violet eyes snapped to him. \n\n \n\n“I can tell you are so sorry,” she snarled. “I can tell that you are just heartbroken so let me help you. Go and-”\n\n \n\n“Yen,” Geralt snapped, sounding furious. “Enough.”\n\n \n\nThe mage glared but looked away, the magic of the command fizzling out. She just huffed and strode ahead, barely waiting for the rest of the party to gather up all their things. Jaskier fell into step with Geralt, glancing up at him. \n\n \n\n“I wouldn’t antagonize her if I were you,” he grumbled.\n\n \n\n“\n\nI’m \n\nnot doing anything,” Jaskier argued but Geralt just huffed and continued ahead. \n\n \n\nThe walk towards the shorter path was done in a tense silence. People questioned who killed the knight, Geralt and Yennefer vanished for a bit, and the building suspicion of each other became almost too much to handle.\n\n \n\nEven the environment around them seemed to change. The beautiful, serene woods and fields were replaced by jagged black rocks. Jaskier felt a chill in the air and shivered, pulling his jacket tighter around him.\n\n \n\nThen they got to the mouth of a cave and it opened onto the single most horrifying path Jaskier had ever seen. A path of likely rotted planks were halfway in the rocks, curving along the cliff. It didn’t even look wide enough for him to put a whole foot on it. \n\n \n\n“We should turn back,” Geralt, ever the voice of reason, said.\n\n \n\n“No!” Yennefer gasped\n\n \n\nThe dwarves started along the path, laughing and joking. Jaskier took one look over the dizzying edge and felt his breath catch in his throat. He even tried to convince Yennefer to go first but the mage pushed his arm, sighing.\n\n \n\n“Come on!” Yarpen shouted and his feet jerked a bit in response.\n\n \n\nGreat.\n\n \n\nWonderful.\n\n \n\nBut...Geralt wasn’t correcting the command. Usually he would instantly reverse the command but not a word came from his lips. Jaskier would have been furious had the command not forced him past his fear and onto the path.\n\n \n\nThe wood groaned and splintered under their feet but only one crumbled under his weight. Jaskier tried to calm his pounding heart and locked his eyes ahead of him. Just one step at a time, just focus on one step at a time. \n\n \n\nJust when he thought that they might get through this insane experience alive the boards broke.\n\n \n\nThere was a scream and a gasp as Borch and his guards fell into the chasm, only held up by Geralt’s quick thinking. Jaskier took a nervous step forward, mind racing. “Geralt!”\n\n \n\n“Get back!” The witcher barked and he felt his body move backwards. Gods, was he going to have to watch Geralt fall to his death? The wood groaned and cracked below Geralt’s foot. Jaskier felt everything in him go icy.\n\n \n\nBorch gave Geralt the smallest smile and let go, almost instantly getting engulfed by the mist. Just a heartbeat later Téa and Véa did the same and vanished. Jaskier’s hand flew up to cover his mouth as it felt like the breath had been stolen from his lungs. \n\n \n\nGeralt turned carefully to lean against the rock wall, heartbreak clear on his face. For a long moment nothing was said but then Yennefer leaned forward and placed a hand on his shoulder.\n\n \n\n“We have to keep going,” he could barely hear her voice against the screaming wind. \n\n \n\nGeralt got to his feet, eyes hauntingly empty. Legs feeling weak, Jaskier took a step forward to try and say something but Yennefer shook her head. “You should continue forward.”\n\n \n\nIt wasn’t a command but Jaskier went anyway.\n\n \n\nThe Witcher didn’t say a word as they finally crossed the wretched path. He didn’t speak as they set up their camp. He just sat on a boulder on the side of their site and stared into the chasm in front of them. \n\n \n\n“You should talk to him,” Yennefer sounded softer than he had ever heard her. She nodded towards Geralt’s broad back. \n\n \n\n“I’m sure he would prefer you to do that,” Jaskier mumbled, turning his attention back towards the bedroll he had been setting up. \n\n \n\nYennefer let out a sigh. “He needs you Jaskier, not me. I don’t want to...I don’t want to command it but you should.”\n\n \n\n“Fine,” Jaskier stood up and brushed his pants off. “But only because you admitted that you think I would do better.”\n\n \n\nIt was a bit nerve wracking to walk to Geralt like that. In their whole time together Geralt had been the one protecting him. He had never seen the witcher look so fragile and it scared him. He had to push aside the insecurities that had been swirling in his mind and sat carefully next to Geralt.\n\n \n\n“You did your best,” he whispered after a few moments in silence. “There’s nothing else you could have done.”\n\n \n\nStill Geralt didn’t even acknowledge him.\n\n \n\n“Look, why don’t we leave tomorrow?” He tried, throat feeling tight. “That is...if you give me another chance to prove myself a...worthy travel companion.”\n\n \n\nThe laugh came out a bit bitter. \n\n \n\n“We could head to the coast. Go away for a while. Sounds like something Borch would say, doesn’t it?” He offered a smile but Geralt’s body stiffened. “Life is too short. Do what pleases you...while you can.”\n\n \n\n“Composing your next song?” It wasn’t what he expected Geralt to say but the words hit hard.\n\n \n\n“No. I’m just, uhh...just trying to work out what pleases me,” Jaskier sighed. “What...what would please you?”\n\n \n\n“Jaskier...”\n\n \n\nThe bard felt his eyes burn with tears and swallowed convulsively. “Because I...don’t want to be the fool again.”\n\n \n\nThey both knew what he meant. He didn’t want to be the thing cast aside when the curse became too much or when something else came along. Geralt scowled at that, looking down at his feet but didn’t say anything. \n\n \n\nHe couldn’t say anything more. Jaskier blinked back tears and stood up, walking to his tent. Maybe he was acting like a complete fool. There was no reason for a bard to walk into almost certain death. He could have just waited at that tavern for any survivor or written a ballad of the lost. \n\n \n\nInstead, he remained by Geralt’s side. \n\n \n\nHe was the fool who would remain by his side no matter what. \n\n \n\nBut for now, he had to sleep. They were hunting a dragon in the morning.\n\n\nGeralt didn’t believe in sleeping in. \n\n \n\nThere were so many times that Jaskier was forced sleepily to his feet to start the day before the sun even started peeking over the horizon. He was used to walking the first hour half awake until his brain finally decided to wake up. \n\n \n\nWhich was why it was so disorientating for him to wake up to the sun shining on his face and the smell of a burnt out fire stinging his nose.\n\n \n\nJaskier squinted into the sun, noting that it was actually far above him, and frowned. It was then he realized that the camp was eerily quiet and pushed himself to a sitting position.\n\n \n\nThe entire bloody camp was empty. There wasn’t a soul around. No one was cooking or sharpening weapons or talking too loud. There simply was \n\nno one\n\n. When the confusion began to dissipate anger was left in its wake. \n\n \n\nSo, Geralt and the others just left him? What if...what if a bear had happened upon him or...it was just irresponsible! \n\n \n\nAngrily, he grabbed his belongings and messily rolled up his bedroll. The path was obvious from the trampled grass and he started a jog, cursing the whole time. Honestly, he wouldn’t be much of a help if there was an epic battle to the death but he was a part of the party damn it! He deserved to be there to share in the glory. \n\n \n\nRelief flooded through him when he happened across the line of dwarves. “Oh! Phew! What did I miss?”\n\n \n\nThere wasn’t any snide remark, something he expected from the dwarves by now. Instead they let out pained groans and strained against something.\n\n \n\n“Are we...queueing for something? What’s going on?” He squinted forward and his heart absolutely stopped. A body lay partially obscured by the rock ahead of them. There had been a battle and clearly there had been some casualties. \n\n \n\nJaskier sprinted ahead, bags hitting his leg as he ran. The body turned into bodies and he slowed down to carefully look at each one. “Oh fuck, what happened?”\n\n \n\nThen he turned to see two ghosts behind him, “Oh gosh! Oh, bloody hell! What the fuck are you during here?”\n\n \n\nTéa and Véa did not look so amused. \n\n \n\nThey snapped into attention, swords drawn, as the dwarves raced up. Yarpin threw his blade on the floor and cursed loudly. “Well that’s fuckin’ shite! We missed a whole mother lode of fun.”\n\n \n\n\nSome fun.\n\n Jaskier thought as he looked at the bodies around them.\n\n \n\nBorch walked up, looking nothing like the splattered corpse Jaskier had imagined him being. “Ask no questions, and in return I offer you these to take to the king.”\n\n \n\nBloodied dragon teeth shone in the sun. Yarpin didn’t take long to convince to take the offering, motioning for his fellow dwarves to follow him back down the path. Borch stepped back and watched them go before turning to Jaskier. \n\n \n\n“I’m sure you are wondering where your witcher is,” he raised his eyebrows. “Follow me and listen.”\n\n \n\nJaskier followed the strange trio down a small path and caught sight of a familiar silver head of hair. A weight was lifted off his chest when he saw that Geralt seemed completely unharmed. As they walked Borch told him what had happened, explaining the egg and the battle that had occurred for it. \n\n \n\nYennefer stood nearby but went to sit next to Geralt as they approached. She had a sadness about her, a heaviness that rested on her shoulders. Jaskier sat on a boulder, feeling suddenly nervous as Borch spoke. \n\n \n\n“I can see why Geralt didn’t want to lose you,” Borch nodded at Yennefer but those clever eyes narrowed. \n\n \n\n“What does that mean?”\n\n \n\nThere was an uncomfortable moment where they all just stared at each other before Geralt spoke up. “In Rinde. The djinn.”\n\n \n\nWait...\n\n \n\nWhat?\n\n \n\n“That’s why we can’t escape each other,” Yennefer said softly and Jaskier felt his heart drop. Geralt had made a wish for her. He had. “Why I feel this way inside.”\n\n \n\n“No.”\n\n \n\n“It’s not because of anything real...or true,” Jaskier could see her crumbling, see that powerful facade falling apart. He knew that feeling all too well, not knowing what was real or not. “You made a wish. It’s magic.”\n\n \n\n“It’s real Yen,” Geralt said and Jaskier felt himself gasp, feeling suddenly hollow. \n\n \n\n“How could we ever know?” Yennefer stood up and took a few steps, locking her eyes with Jaskier for a moment. “Disregard for other’s freedom has become quite your trademark.”\n\n \n\nJaskier remained perfectly still. \n\n \n\n“I made that wish to save your life!” Geralt seemed agitated.\n\n \n\n“I didn’t need your help!” She shouted and Geralt leapt up, eyes blazing. \n\n \n\n“Like fuck you didn’t!” He snarled. “And you, you flit about like a tornado, wrecking havoc and for what? So you can have a baby? A child is no way to boost your fragile ego Yen.”\n\n \n\nIt was too much. Geralt was always quick to use weapons even when those weapons were words.\n\n \n\n“I’ll take advice from you about children as soon as you take responsibility for the one you bound to you and abandoned!” \n\n \n\nThen Borch decided to step in and try to soothe the fire he started. “That’s enough. I’m going to save you a lot of hurt with a little pain now. The sorceress will never regain her womb and though you didn’t want to lose her Geralt, you will.”\n\n \n\nYennefer took a trembling breath in. “He already has.” She walked up the rocky ledge, giving Jaskier a look of pure heartbreak before walking past him. \n\n \n\n“You wanted to show me what I was missing? There she goes,” Geralt said softly, eyes following Yennefer until she created a portal and vanished into a sparkling swirl of light.\n\n \n\n“What you’re missing is still out there, your legacy, your destiny. I know it and you know it,” the old man followed the same path Yennefer had gone up, nodding at Jaskier as he went. \n\n \n\nGeralt turned to face out into the chasm, back perfectly straight and tight with tension. He looked like he would shatter into a million pieces if he was touched and Jaskier crept forward, wary.\n\n \n\n“Phew, what a day!” He let out a nervous chuckle, hands wringing together. “I imagine you’re probably-”\n\n \n\n“Damn it Jaskier!” Geralt had spoken to him harshly before but never with this level of anger. The words felt like an actual slap to the face and he winced. “Why is it whenever I find myself in a pile of shit these days, it’s you shoveling it!”\n\n \n\n“Well, that’s not fair.”\n\n \n\n“The child surprise, the djinn, the curse, all of it! I have so much more to worry about than trying to break an unbreakable curse,” Geralt’s eyes blazed with fury. “If life could give me one blessing, it would be to take you off my hands.”\n\n \n\nJaskier was almost grateful that Geralt turned away, not wanting him to see the tears that had built up in his eyes. \n\n \n\n“You don’t mean that.”\n\n \n\nThe witcher stiffened. “I do. I can’t keep watching over you like a toddler, not when I have real problems I need to focus on. Some things just...just can’t be fixed Jaskier.”\n\n \n\nA few tears slipped down his cheeks, burning a path as they went. “Right then...I’ll just go get the story from the others.”\n\n \n\nBut he still didn’t move, feet feeling leaden. \n\n \n\n“Go then.”\n\n \n\nHe didn’t even try to fight the command, feet dragging as he walked away from the cliffside. His chest felt like a vise was tightening around it and any moment it would burst. Jaskier didn’t even focus on the path, just mindlessly wandered on. He didn’t know where he would end up. He didn’t care. \n\n \n\nThis would happen. It was destined to. \n\n \n\nJust like Geralt was destined to find his child surprise, he was destined to lose anything he had even the most tremulous grasp on. \n\n \n\nHis family, the countess, Valdo and now...Geralt. \n\n \n\nYennefer was right. Disregarding other’s freedoms when it suited him certainly was Geralt’s trademark. \n\n \n\nHe had been stupid to think that maybe this time would be different. He was stupid to hope that Geralt could find the answer to his curse. He was stupid to think that someone could give a damn about him. \n\n \n\nWhere would he go now?\n\n \n\nThere had been rumors that the countess’s husband had died of a rather mysterious illness. The thought of her finding him again sent chills down his spine and he decided to avoid that region all together.\n\n \n\nOxenfurt might be willing to take him back. Enough time had passed from his humiliating performance that they might accept him as a junior lecturer. But then Valdo might be there and he honestly didn’t know if he could survive that.\n\n \n\nThere was one more place to go...one place that could take him in. \n\n \n\nJaskier knew he could continue his travels but the idea made his stomach twist. Geralt wasn’t around to protect him from others who would be willing to exploit the curse. The unknown was too much of a risk and he didn’t know if he would be able to make it much further. \n\n \n\nSo, he started for Lettenhove.\n\n \n\nHe hadn’t been home for years but it looked just the same. The shining towers and polished steel of the guards hiding the rot that was within. The guards, dressed in their finery, eyed him suspiciously as he approached the bridge. \n\n \n\n“Halt!” He scowled as his feet stopped in their tracks. “What business do you have with the Viscountess?”\n\n \n\n“No Viscount?” Jaskier cocked his head to the side a bit. \n\n \n\nThe guards looked at each other and frowned. “The Viscount died years ago.”\n\n \n\nHe was too exhausted to even feel a pang of grief for the man who had fathered him. The only times the man ever spoke to him as a child was to insult him or to slur something drunkenly at him as he tried to hide away. \n\n \n\n“Then I suppose I am the next Viscount. Please let me mother, the lady of the house, know that I am back,” he lifted his chin but they continued to stare at him. “I’m Julian Alfred Pankratz...the Viscount de Lettenhove?”\n\n \n\n“Lord Julian is dead.”\n\n \n\n“Except I very much am not and I am incredibly tired,” Jaskier sighed. “Let me see the Viscountess and she’ll explain.”\n\n \n\nIt was obvious that they didn’t quite believe him but weren’t willing to risk it if it was true. With a grumbled “follow us” Jaskier was led into the castle. Not much had changed. His mother still clearly liked showing off what riches they had, she always was obsessed with appearances. In fact he felt out of place. His clothes were dirty and ripped in places. His boots were scuffed. His face was streaked with dirt. He was nothing like the shining art around him. \n\n \n\nHe should run.\n\n \n\nJaskier remembered the hell he had lived in here. He should just turn on his heel and run along the bridge like he had all those years ago. \n\n \n\nBut where had that gotten him?\n\n \n\nIf he stayed here he would live a cushy life as a lord with a wife by his side. He wouldn’t want for anything. He wouldn’t be hurt again. \n\n \n\nThe wait for his mother was long and boring. No one wanted to make eye contact with him and no one spoke a word so he just rocked lightly on his feet until the doors opened. \n\n \n\nHis mother had aged, that was obvious, but she still had the same graceful beauty he remembered. Her brow furrowed and her painted mouth dropped open when she saw him. For a long moment they just stared at each other. \n\n \n\n“Hello mother,” he said softly and that seemed to snap her out of her daze. \n\n \n\n“Julian! My Julian!” She gasped, took a step forward and paused. “Come here, come to your mother.”\n\n \n\nIt was obviously a challenge to see if the curse was still active and a wide smile spread across her face when he walked up the steps towards her. \n\n \n\n“Oh my dear!” She jumped forward to hug him but he could tell she was trying to avoid touching his clothes. “My darling boy! You have no idea how lonely it has been since your dear father passed.”\n\n \n\n“I’m sure.”\n\n \n\n“And now, now you are the Viscount!” She pulled away and gave him a blinding smile. “And you’ve come home to care for your people!” \n\n \n\n“Of course.”\n\n \n\nHer eyes went a little dark and calculating and her smile went sharp. “Don’t you run away again Julian.”\n\n \n\nThe command sizzled through him. “Where would I go mother?”\n\n\nCourt life was just as he remembered. \n\n \n\nJaskier woke up late, stared at the velvet hangings above his bed before his mother’s command pulled him from the too soft sheets. Mechanically, he dressed in his glamorous robes (nothing like what he wore before) and left his room.\n\n \n\n\nAlways come for breakfast in the dining hall.\n\n\n \n\nMaybe he had gotten accustomed to life on the road but the huge assortment of foods made him a little ill. Jaskier was used to chewing on a piece of jerky as he walked beside Roach, not eating rich pastries and egg dishes. \n\n \n\nHis mother gave him a luminescent smile and tilted his face a bit so he could kiss her on the cheek before taking a seat next to her. \n\n \n\nIt was so easy just to do what people told him. \n\n \n\nIn the weeks following his return every day started the same. Sometimes there would be some pompous visiting lord or lady that his mother was entertaining but Jaskier just ignored them. It was always the same anyway.\n\n \n\n“Lord Julian,” the older lord, cheeks already red with wine even though it was far too early to be drinking. “I have heard that you were recently traveling.”\n\n \n\n“I was,” Jaskier mumbled, not looking up. “I wanted to see how my people were thriving so I could help them even more during my time as Viscount. I was immature and not ready before, now I am.”\n\n \n\nHis mother’s words flowed so easily from his lips. \n\n \n\nThe lord’s daughter watched him carefully, large doe eyes growing even wider. She seemed to hesitate for a moment before blurting out. “I heard that you are the bard Jaskier who traveled with the Butcher of Blaviken!” \n\n \n\n“Lorelei!” The lord snapped, eyes narrowed at his daughter. \n\n \n\nBeside him, his mother stiffened and whipped her head around. Jaskier just smiled at her. “That would be something, wouldn’t it? What stories I would have to tell.”\n\n \n\n“Let’s not talk about such things,” his mother spoke up, sharp smile on full display. “It’s not proper to talk about monsters at the table. Understood Julian?”\n\n \n\n“Of course mother,” he smiled and shot the girl a wink. \n\n \n\nThe rest of the day went by like any other. He spent it wandering the gardens, leafing through books, or strumming at his lute. Court life was \n\nboring\n\n and \n\ntedious\n\n but it was expected and it was safe. \n\n \n\nHe was in the middle of composing a new tune when his mother burst into his room, eyes narrowed and body tense. Jaskier glanced up at her and raised his eyebrows, fingers still lightly dancing across the strings. \n\n \n\n“Mother,” he nodded. \n\n \n\n“Do you have any idea the damage you’ve done to this family name?” She snarled. “When you left I had no choice but to tell others that you were dead! The idea that you were some...some...begger playing in taverns was humiliating!”\n\n \n\n“I’m so terribly sorry that my life has been such an inconvenience for you.”\n\n \n\nShe let out a harsh breath. “I prayed for a boy when I was with child and...I must have done something to upset the gods because they gave me \n\nyou\n\n. Have I not given you everything you wanted?”\n\n \n\nJaskier sat up straight, fingers tightening on his lute. “You \n\ncursed \n\nme! You took everything away from me!”\n\n \n\nHer eyes were icy. “I saw the path you were heading down and diverted you from it! I saved you.”\n\n \n\nFury rushed through him and Jaskier jumped to his feet. “You fucking psychotic bitch, you really think you helped me?”\n\n \n\n“Don’t talk to me like that!”\n\n \n\nHis mouth snapped shut and Jaskier scowled. \n\n \n\nFor a moment, he allowed himself to relish in the way she seemed so frazzled before she straightened up and brushed a few stray hairs back. “Why would you come back then? Just to torment me?”\n\n \n\n“Of fu-” he doubled over as pain ratcheted through him, groaning slightly. After a few shaky breaths he managed to get himself back under control. “It turns out the world you kept me from was cruel...especially for someone who’s freedom and choice you took from them.”\n\n \n\nHis mother’s lips pursed together. “If you are going to be here then you are going to be what this house needs.”\n\n \n\n“A puppet?”\n\n \n\n“If that is what is needed,” her sneer was ugly. “Lettenhove needs a leader. You will be the Viscount that it needs. You will marry the girl I decree is worthy. You will do what I tell you to.”\n\n \n\nJaskier glared. “I haven’t had a choice before, good to see some things are consistent.”\n\n \n\n“You will not brood around this castle. You will attend to official matters with the professionalism your title demands. You...you won’t distract yourself with silly wastes of time!” His heart jumped but she continued. “You will not touch this...this toy of yours or write any more pointless songs. I won’t have my child and my name associated with someone who is nothing more than a whore who sings.”\n\n \n\n“You can’t,” he breathed as his fingers went numb and his lute clattered to the floor. \n\n \n\nHis mother’s eyes followed the instrument as it fell and she sighed. “I don’t know why you make me do these things Julian. A mother must be strict though. In time you’ll learn to appreciate what I’ve done for you.”\n\n \n\nJaskier stared at the lute, heart in his throat. “Did you ever love me mother?”\n\n \n\n“Oh darling,” his mother sighed and knelt by him, taking his face in her hands. “You’re my son. I have no choice but to love you.”\n\n \n\nIce flowed through his veins as he realized what a terrible choice he had made. He had thrown himself at the mercy of a madwoman for what? Because he didn’t want to feel lonely? Because he was more terrified of other options or the unknown?\n\n \n\nHe didn’t even realize he was crying until his mother wiped at his cheeks, cooing softly. “It’ll be alright sweetheart. I can help, let mummy help. You won’t even miss it. You won’t want to play that silly little thing at all.”\n\n \n\nThe sting of the heartbreak lessened until it was a dull pain deep inside. Jaskier managed to take in a few shaky breaths before blinking tearfully at her. “The curse you decided I needed so badly will be the death of me. You killed me mother.”\n\n \n\nShe really did look heartbroken at that, flinching as tears flooded her own eyes. “Don’t say that kind of thing, it’s evil.”\n\n \n\nHe wanted to rant and scream at her, shake her until sense sank in through the layers of makeup and reached her brain. His mother smiled at him tearfully and kissed his forehead. \n\n \n\n“Get some rest. We are having a party tomorrow, lots of visiting lords and ladies. You’ll be at your most charming, alright? Your future wife could be there.”\n\n \n\nShe left the room with a flurry of her skirts and Jaskier was left feeling hollow. Mechanically, he felt himself stand and start preparing for bed. As his body moved he let his mind wander, fading slightly from what was happening.\n\n \n\nWhat life was he hoping for?\n\n \n\nIt would never be his, it would never fully belong to him. \n\n \n\nIt didn’t matter if he was here, letting his mind slowly rot away, or out in the world where any number of horrible things could happen. He was dying anyway, fading into nothing. \n\n \n\nMaybe he should quicken the inevitable. \n\n \n\nJaskier’s heart rate picked up, a cold sweat breaking out. If he ended this sorry excuse for a life he wouldn’t give anyone the chance to hurt him. He would stop the cycle and finally, finally be free. That would be his \n\nfinal\n\n choice that he could make on his own. \n\n \n\nBut...he couldn’t.\n\n \n\nPerhaps he was a bit of a coward, too afraid to take that final step, but he couldn’t do it. There was a small, barely flickering spark of hope in him that the curse could be broken. If he surrendered then he would never know the feeling of true freedom. \n\n \n\nSo no, he would stay.\n\n \n\nHe just hoped that there would be something left of him. \n\n \n\n--*--\n\n \n\nThe party was in full swing and Jaskier wanted nothing more than to go back to bed. His clothes were itchy and the jewelry his mother insisted on was heavy around his wrists and neck. There were so many people coming up to him that his face ached from the constant smiling he was doing.\n\n \n\n\nAct pleasant.\n\n\n \n\n\nSpeak highly of the family. \n\n\n \n\n\nOnly say pretty things.\n\n\n \n\nSo he talked about the weather and horses and sailing. He smiled at empty headed nobles and nodded enthusiastically along with their benign conversations. It was utterly \n\nexhausting.\n\n\n \n\n“Oh! There you are Julian!” His mother’s high voice would have made him wince but he had well trained that reaction away. “Let me introduce you to someone!”\n\n \n\nHe turned, false smile on full display to greet whatever lord or lady his mother insisted on meeting. He expected a portly older man, cheeks red with wine, or a greying lady who clearly did not smile much.\n\n \n\nInstead he met amethyst eyes.\n\n \n\n“This is Yennefer of Vengerberg!” His mother introduced, her wave of an arm spilled a bit of wine. “Can you believe it Julian? A mage! She is looking for a new house to serve and happens to be in Lettenhove for this party!”\n\n \n\n“How lucky,” he said simply, eyes locked on her. \n\n \n\nClearly his mother was thrilled by his focus on her, eyeing the two of them with glee. “Invite her to dance Julian.”\n\n \n\nYennefer raised an eyebrow as Jaskier instantly held out a hand. “Would you care to join me for a dance my lady?”\n\n \n\n“I would be delighted,” Yennefer took his hand and he led her to the dance floor, wanting nothing more than to run as far away from this place as possible. \n\n \n\nThey fell easily into the dance, the smile his mother commanded still on his lips, and Yennefer studied him. It was almost a relief when she finally spoke. “You don’t look so good Jaskier.”\n\n \n\nJust hearing his chosen name made something crack in his chest but his mother’s words slipped through his lips. “I’m not sure what you mean.”\n\n \n\n“I thought nobility would suit you but it really doesn’t,” her eyes were soft and sad. “It took me a long, long time to find you. I can’t say I was expecting you like this.”\n\n \n\nWhatever reason Yennefer had for coming didn’t seem to be malicious. Jaskier realized that maybe, just maybe, this could be the help he needed. He would just have to outsmart the curse. \n\n \n\n“Like this? Why Yennefer, I am just fantastic,” it felt strange to try and wrestle his mother’s words into something else. “I’m here with my mother and it is just...wonderful.”\n\n \n\nThankfully, Yennefer was smart. Her eyes narrowed slightly and her head cocked to the side as he moved her across the dance floor. “Those aren’t your words, are they?”\n\n \n\n“Of course,” he gave her a blinding smile and understanding crossed her face. \n\n \n\n“Am I correct in assuming that your mother is the one who cursed you?” When he didn’t answer, she nodded. “A parent should uplift their child, give them a better life than the one you had.”\n\n \n\n“Mother is only doing what is best for me,” his teeth hurt from how hard he was grinding them together. \n\n \n\nYennefer nodded sadly. “My father sold me for next to nothing to a stranger. I think we are more alike than I first thought.”\n\n \n\nJaskier nodded, knowing her couldn’t talk about \n\nsuch things\n\n. “May I ask why you are in Lettenhove Yennefer?”\n\n \n\nThey moved slightly to the edge of the dance floor, avoiding the drunken couples that spun around. Many of them were staring, not wanting to miss seeing the famous Yennefer dancing with their Viscount. \n\n \n\n“I came looking for you,” the first hint of a smile quirked at her lips. “While you’ve been galavanting off here with your fellow nobles a lot has happened. I had things...put in perspective. Honestly, I came here because I thought Geralt might be with you.”\n\n \n\nJust the mention of Geralt made something unpleasant settle in his stomach. “I’m afraid not.”\n\n \n\n“No? You had a lover’s spat then?” She asked and he quickly spun her in retaliation. “Oh come now Jaskier. I...I will admit I became a foolish school girl with a crush around him. The djinn’s wish clouded my thoughts and his too. Love can’t be created through magic though, not true love anyway.”\n\n \n\nThe music slowed and so did their dance. Jaskier had many questions but the words vanished the moment they reached his tongue. Yennefer gave him a smile and squeezed both of his hands. \n\n \n\n“I can tell that whatever words you speak will not belong to you so let me speak instead. You are a prisoner here Jaskier. Maybe you thought that this would be the least place for you but that is not the case,” her eyes went sharp, piercing through him. “And I need you. Geralt needs you. I was saved from a prison once by magic and I will do the same for you.”\n\n \n\nJaskier could hardly breathe. “I’m...I’m not sure I understand my lady.”\n\n \n\nA faint flicker of irritation crossed her face at his phrasing but he knew he couldn’t fight the curse with his mother’s watchful eye on him. Apparently she understood as well, glancing towards the Viscountess before leaning in and whispering into his ear. \n\n \n\n“I might be able to break this curse.” \n\n\n“Alright,” Yennefer straightened up on the bed, eyes flicking across the book while she held up one elegant finger. “Have you gotten into a bath, poured in salt, and then thought about the curse?”\n\n \n\n“That’s going to break it? That just sounds like a lovely evening to be honest,” Jaskier huffed, head dangling over the foot of the bed as he repeatedly kicked a pillow. “We really must be scraping the bottom of the barrel.”\n\n \n\n“It’s not my fault the other’s didn’t work,” the mage shrugged. “I had high hopes for the mirror.”\n\n \n\n“Commanding myself through a mirror sounded just too good to be true,” Jaskier sighed. \n\n \n\nAfter the party Yennefer hardly left his side. His mother had been \n\nthrilled\n\n that a sorcerous of such renown was in the castle, especially that she showed such an interest in her son. Best yet his mother stopped her hovering and they were mostly left to themselves.\n\n \n\nWith that time Yennefer pulled out all her books on curses and raided the castle’s libraries for anything that could be helpful. At first, they were both filled with hope and excitement but several painful spells and disgusting potions later with no broken curse, they were getting a bit lackluster. \n\n \n\n“Oh! What about...no, that’s about preventing curses. A bit late for that I suppose,” she mumbled, tapping at her chin. \n\n \n\n“Oh bite me.”\n\n \n\nThey sat in silence for another few moments before Yennefer snapped the book shut and tossed it into the growing pile of books they deemed failures. She groaned and lay down next to him, frowning up at the velvet hangings. \n\n \n\n“I thought you knew how to break it,” Jaskier grumbled and a grimace passed over Yennefer’s face.\n\n \n\n“I thought I did too. These curses and old, ancient in fact. The fact that your mother was able to find someone to cast it is incredible in itself,” she moved her foot to stop his from hitting the pillow again. “These spells are cast with a dark intent and often need something similar to break them.”\n\n \n\n“Like what?”\n\n \n\nYennefer sat up and turned to face him, expression very serious. “I think you need to kill your mother.”\n\n \n\nIt was such a ridiculous idea that Jaskier burst into laughter right away. The peals of laughter made him curl up and he grinned up at her, sobering slightly when she didn’t even smile. \n\n \n\n“What?”\n\n \n\n“I think you need to kill your mother,” Yennefer said it slowly. “It wouldn’t be a terrible loss.”\n\n \n\n“I can’t do that!” Jaskier shook his head. \n\n \n\nThe idea of killing his mother was horrifying. He would wake up in a cold sweat dreaming about killing the harpy, he couldn’t kill a \n\nperson\n\n. She might be a monster but his mother was still his mother. Whatever evils she had bestowed upon him she had done in some twisted idea of helping him. \n\n \n\nYennefer huffed. “I’m sure you can. It wouldn’t be that hard.”\n\n \n\n“No! I mean, I couldn’t kill her! She’s my mother!” Jaskier sputtered, sitting up quickly. \n\n \n\nThe mage pouted a bit and tapped at his cheek. “You’re adorable. She’s a blight of this earth and should be taken off of it. The world would be a better place. Think about it Jaskier, you have two choices. You can live here, slowly losing your mind until you’re just a pile of meat-”\n\n \n\n“Gross.”\n\n \n\n“-controlled by your sorry excuse for a mother, or you can be free. I feel like that isn’t such a hard decision,” Yennefer gave him a small smile. “I would help.”\n\n \n\nJaskier sucked in a short breath and stared at his hands. “Is there any other way?”\n\n \n\n“She was the original caster of the curse. You can’t ignore any of the commands from her, right? This was dark magic and needs to be broken the same way,” she patted his knee. “I won’t force you to. We could just leave this place and go find Geralt.”\n\n \n\n“I can’t leave,” he whispered, shaking his head. \n\n \n\nYennefer was silent for a bit. “Then it seems you have a choice to make.”\n\n \n\nHis chest felt tight and cold, each breath aching. Could he actually do this? Would it make him any better than her if he did? He couldn’t just decide what was best for someone, that wasn’t right.\n\n \n\nBut...with how many wrongs she had done to him...didn’t she deserve it?\n\n \n\nThere were evil people in the world, Jaskier had seen the worst of them, and he didn’t believe he was one of them. All he wanted was to be free, to be able to choose what he wanted. \n\n \n\nHe deserved to be happy. \n\n \n\n“How would you do it?” He whispered.\n\n \n\nYennefer pursed her lips. “I can’t do it, it has to be you. We could make it painless, a poison. It would be just like falling asleep.”\n\n \n\nEvil people deserved evil things to happen to them. \n\n \n\n“Alright.”\n\n \n\nYennefer spent the next few days working on the poison, chattering sweetly with the Viscountess at meals and pretending that nothing was wrong. Jaskier on the other hand was a nervous wreck. He always prided on himself for his use of words and acting but he felt like everyone knew what they were doing.\n\n \n\nThe serving girl who glanced a tad longer than he was comfortable with. The chamber boy who forgot to change his pillows. The gardener who smiled at him when he walked past. \n\n \n\nIt was a nerve wracking three days before Yennefer pressed a small vial into the palm of his hand. \n\n \n\n“It’ll be quick. Just like falling asleep.”\n\n \n\nDespite how tiny the vial was he felt like a rock in his pocket, weighing his whole being down. Jaskier’s entire being was incredibly aware of the death sitting practically in the palm of his hand. \n\n \n\nThere never was a good time, if there ever was a good time to murder someone. His mother, ever the vain entertainer, had multiple guests visiting and he was given a chance to slip the poison into her drink. \n\n \n\nThen, she told him to meet her in her chambers after dinner one evening. \n\n \n\nJaskier felt hollow as he walked up the stairs. Before, when he had killed the harpy, it had happened so quickly that he didn’t even think about it until it was done. Now, every second stretched for hours knowing what the end result would be.\n\n \n\n“Julian darling,” his mother smiled brightly as he walked in. She was removing her earrings and placing them in a crystal dish, humming as she started removing her finery. “Thank you for joining me.”\n\n \n\n\nLike I had a choice.\n\n\n \n\n“Why did you want to talk to me?” He asked, palms feeling sweaty. \n\n \n\n“I am so proud of you,” his mother strode forward and cupped his cheek. “You are falling into your role as a leader so effortlessly.”\n\n \n\nHe nodded faintly. \n\n \n\n“I can see such a beautiful future for you. You will be just. You will be adored by your people. You will marry Yennefer and create a future for this great land.”\n\n \n\nThe command to marry Yennefer was vague enough that the curse didn’t react. She never said when or where so this promise to \n\nsomeday\n\n marry her didn’t worry him.\n\n \n\nBut, you will be \n\njust\n\n.\n\n \n\nThat he could do. \n\n \n\n“Yes mother,” he smiled and she beamed, turning to her mirror to remove her hairpins. “Can I pour you a glass of wine? We can toast to that future.”\n\n \n\n“That would be lovely,” she nodded and turned her attention away from him. \n\n \n\nJaskier’s heart pounded as he approached the carafe of wine, trying his best not to spill as he poured a glass. With a quick glance to make sure she was still focused on the mirror, he dumped the vial into the glass. \n\n \n\nThis was justice for what she had done to him. \n\n \n\nIt was a strange, horrible version of the day he had left. Alone in the room with the person who had betrayed the most sacred trust and feeling helpless. This time he wouldn’t run. This time he would take control.\n\n \n\n“Here you are,” he fixed a smile on his face as he held it out.\n\n \n\nHis mother turned, a gentle smile on her face before it went a bit sad. “Oh Julian, sweet boy.”\n\n \n\nBut she didn’t take it. \n\n \n\nInstead she just glanced up to her eyes. \n\n \n\n“Why would you do this to your mother? The person who loves you so dearly?” His heart sank, leaving him feeling cold. “You would kill me?”\n\n \n\n“What? No!” He shook his head. \n\n \n\nWith a deep sigh his mother stood, tears building in her eyes. “I’m sorry for all the pain you caused yourself but this is not the way.”\n\n \n\nHis breath caught in his chest and anger flared through him. Pain he caused himself? She would never change, never. All the words he wished her could spit at her were trapped in his mind but it was obvious she saw the change. \n\n \n\n“I’m so sorry,” she whispered, choking a bit on a sob. “I did everything I could and raised a monster. Julian...Julian, drink the wine.”\n\n \n\nWithout thinking, Jaskier’s arm started moving before he had enough sense to stop himself. His arm started aching and trembling as he resisted the curse, panic racing through him. Some wine sloshed out of the side but his hand continued it’s path to his mouth.\n\n \n\nIn desperation, he slammed his hand down onto the side of the mirror and shattered the glass. His mother gasped and jumped back to avoid the spilling wine and shimmering shards of glass and he was left with nothing more than a jagged stem. \n\n \n\n“Julian, st-”\n\n \n\nBut he was faster. \n\n \n\nJaskier blinked and then his hand was coated in hot, wet blood. His mother blinked at him, surprise and shock on her face as she reached up to touch the wine stem that had been shoved through her throat. Her mouth opened and closed a few times before she slumped to the ground, blood spurting from the wound. \n\n \n\nA sob burst from his lips and he fell to his knees next to her, hands weakly grabbing at her arms. His mother grabbed onto him, frantic eyes overly bright as she gurgled blood. \n\n \n\n“I’m sorry, I’m sorry, I’m so sorry,” he sobbed as the light faded from her eyes and her grip on him lessened. \n\n \n\nThe moment her last breath left her lungs Jaskier was left numb. He fell back, pressed against the wall and shivered at the feeling of her blood on his hands. This would make a poem, wouldn’t it? His mother being forever silenced by a stab to her throat. What a song that would make. \n\n \n\nJaskier wasn’t sure how long he spent sitting on the floor before the door opened and Yennefer stepped in. The mage quickly shut the door behind her, sliding a lock into place, and looked over the scene.\n\n \n\n“This wasn’t what I had in mind,” she sighed. “How do you feel?”\n\n \n\nHe didn’t answer.\n\n \n\n“Jaskier,” Yennefer knelt in front of him, blocking his view of the body and getting blood on her skirts. “Do you feel different?”\n\n \n\n“Different? I killed my mother,” he choked.\n\n \n\n“I mean the curse,” she tilted his face up, studying his eyes closely. “Raise your hand.”\n\n \n\nHis hand rose. \n\n \n\n“Fuck,” she groaned but Jaskier stared at it in horror.\n\n \n\nIt didn’t work. He killed his mother and it didn’t work. He was still cursed. \n\n\nJaskier felt numb. \n\n \n\nVaguely, he was aware of Yennefer moving around the room. He could hear her boots tapping on the floor, he could smell her perfume as she walked past him, he could see her skirts swish around her legs.\n\n \n\nBut...all he could really focus on was the corpse in front of him. \n\n \n\nHis mother, his own mother, lay dead in front of him. He had killed her. He had looked into her eyes, the same blue as his, and stabbed her through the throat. Jaskier felt his chest hitch and barely had the sense to turn his head and vomit up his dinner. \n\n \n\n“None of that now,” Yennefer mumbled, grabbing his arm and hoisting him to his feet. “We need to go.”\n\n \n\n“What?” His tongue felt too big for his mouth, words slurring together. It was strange, turning his head and having the world move a bit too slowly for him to focus. \n\n \n\n“Jaskier,” Yennefer took his face in her hands, her nails biting into his cheeks slightly. “We cannot stay here. We have to go.”\n\n \n\n“Go where?” He could hear his voice going higher, hysteria rising. “Where the fuck can we go Yennefer? I’m...it’s still here. I can’t get rid of it. I can’t...oh Meletile I can’t.”\n\n \n\n“Jaskier,” her voice was warning but he was too far gone. \n\n \n\n“No! I’m going to be like this forever and I just fucking killed my...oh,” he groaned and squeezed his eyes shut. “Oh gods...I’m trapped. I can’t do this. End it Yennefer, just end it. I can’t do this any-”\n\n \n\nThe slap startled him into silence and he blinked at her. Her eyes were flinty and hard, glaring into his own until he sucked in a shaking breath. “That will not happen.”\n\n \n\nJaskier let out a sob, sagging forward and melting into Yennefer. He was slightly surprised when her arms wrapped around him. He sobbed, mourning the faint flicker of hope that had just been dashed away. \n\n \n\n“This is lovely and all but we need to go,” her voice was soft. “The last thing we need is for someone to come in and see your...choice in decorating.”\n\n \n\nHe gagged.\n\n \n\n“Regardless, we need to leave,” she stepped back and waved her hands in an intricate pattern. A shimmering portal opened to the side of the bed, casting shadows around the room. “You can have your meltdown when we are in a safe place.”\n\n \n\nShe motioned to the portal and he just stared at the shimmering colors. Stepping through the portal would mean something drastic. He wouldn’t be running from his past and hiding from it, he would be burying it and letting it burn. Lettenhove would be left without a ruler. There would be nothing tying him to his home.\n\n \n\nBut, was it ever his home? \n\n \n\nIt was the place where he lost his freedom. It was the place where people first took advantage. It was the place where he felt nothing but loneliness. It was the place where he learned that people will turn a blind eye to someone in pain if it meant that their lives wouldn’t be affected.\n\n \n\nLet it burn. \n\n \n\nJaskier stepped through the portal.\n\n \n\nIn the blink of an eye he was standing in a small room. There was a simple bed in the middle and a dresser to the side, the sounds of a rowdy tavern drifting up through the floorboards. Jaskier let out a long sigh and sat on the bed, burying his face in his hands. \n\n \n\nA cup of water was pressed into his hand and Yennefer sat next to him. “Don’t you want to know where we are?”\n\n \n\n“I really don’t fucking care,” Jaskier mumbled, sipping at the water.\n\n \n\nYennefer let out a huff. “Are you really going to act bitchy forever?”\n\n \n\n“Forgive me for having a bit of a crisis!” Jaskier snapped, glaring at her. \n\n \n\nShe hummed. “You are always having a bit of a crisis but we don’t have time for that now. I’ve killed many a person but-”\n\n \n\n“But I’m not like you!” He hissed and her expression went sad. \n\n \n\n“No, you’re not...but it happened and it happened for the best. She stopped being your mother the moment she cursed you, just like my father stopped being my father the moment he sold me,” he had never heard her voice so gentle and it only made his chest feel tighter. \n\n \n\nYennefer was right.\n\n \n\n“How can I move past that though? She cursed me when I was...far too young. She took everything from me. How can a mother torment a child with...what?” He blinked at the small smile on her face.\n\n \n\n“You can talk about the curse,” her eyes were bright. “Her commands are gone. Maybe the curse isn’t lifted yet but you’ve broken those shackles she forced upon you.”\n\n \n\n“Oh,” he stared at her before grinning wildly. “I guess we don’t have to get married then.”\n\n \n\n“What?” \n\n \n\nJaskier would be forever grateful for Yennefer in the days that followed. The inn she had brought them to was warm and comfortable with good food. He just slept, drifting farther away from the pain and fear from the past few months. \n\n \n\n“Where exactly are we?” He asked, taking a huge bite out of his bread one afternoon. In the few times he had peeked out the window or followed her down into the tavern he found that he didn’t recognize any of the banners or scenery. \n\n \n\n“I don’t even know if it has a name,” Yennefer shrugged. “But it is on the Gwenllech River, right at the base of the mountains.”\n\n \n\nJaskier thought over the maps he had studied in his past, trying to visualize where they were. He was sure he had heard about the Gwenllech River before...oh. Oh.\n\n \n\n“I am not going to Kaer Morhen,” he hissed. \n\n \n\n“Clever boy,” Yennefer teased, flicking a nut at him from her hand. “And yes we are. There are books there from before recorded time. If the answer to your cure exists, it is there.”\n\n \n\n“And who else will be wintering there?” Jaskier spat, scowling deeper when she didn’t answer right away. “So no, we aren’t going.”\n\n \n\nThe mage took in a few deep breaths, her brow furrowed as she clearly thought of something to say. “I’m going to give you a choice Jaskier. You can deal with a broken heart, climb that mountain, and get your best chance at breaking this curse; or you can spend the rest of your life at the mercy of people who think they are better than you.”\n\n \n\nJaskier’s mouth twisted into a scowl. “Doesn’t seem like much of a choice there.”\n\n \n\n“That’s the funny thing about choices really, they aren’t often an actual choice,” Yennefer sighed and they sat in silence for a long, long time. \n\n \n\n“I mean...there’s always the chance he won’t winter there, right?” He waited until she hummed in agreement. “And you really think the cure is up there?”\n\n \n\nYennefer’s brow furrowed and her mouth went a bit pinched as she tried to decide what to say. Finally, she just sighed. “I hope so.”\n\n \n\n“And the path there is difficult, yes? Why can’t we just...poof up there?” He waved his hand around a bit. \n\n \n\n“The younger witchers used to call it ‘The Killer Path’,” he couldn’t tell if she was joking but there was the shadow of a smile on her face. “The fortress is well guarded from magic so no ‘poofing’ for you. I could always command you to walk up it?”\n\n \n\n“You might just have to,” Jaskier groaned and flopped onto his back. \n\n\n“I’m not used to you being so quiet,” Yennefer remarked as they set up camp.\n\n \n\nCamp was a kind word for it. They were perched on a truly terrifying ledge, a tarp hung by a few nails into the cliff face as Yennefer’s magic was muted by the protection spells around the mountain. The wind blew hard, frigid and sharp, and Jaskier had a constant fear that he could just be blown right off. \n\n \n\n“I’m not quiet,” Jaskier mumbled around a mouthful of jerky. “I just don’t have much to say.”\n\n \n\n“And no music to play?” \n\n \n\nAt that question everything in Jaskier seemed to freeze. His lute was still lying on the floor of his room, abandoned when his mother made that cursed command. The very idea made his fingers twitch, suddenly desperate for the one thing that had soothed him. \n\n \n\n“Oh,” he breathed and Yennefer gave him a sad smile. \n\n \n\n“We can find you another one,” she leaned forward to add another stick to their tiny fire. It barely even sparked before practically turning to ash, blowing away into the frigid air. “Maybe one with some fancy designs, that seems your type.”\n\n \n\n“Or not,” Jaskier pursed his lips. “Maybe I don’t play again.”\n\n \n\n“Come now, where is that man who sang about every step, bite and shit we took?” Yennefer teased but went quiet when Jaskier didn’t even crack a smile. “Jaskier, music is a part of you.”\n\n \n\n“Is it? Or maybe in the past someone just told me to give it a try?” Jaskier spat. “I don’t remember all the commands, how could I? Maybe music isn’t me, it’s just what the curse decided for me. I don’t want that. I don’t want anything to do with that.”\n\n \n\nYennefer sat quietly before sliding her hand under Jaskier’s hand and squeezing. “Music for you is not because of the curse. We’ll get it broken and then you’ll see.”\n\n \n\nHe closed his eyes and leaned back against damp stone, eyes burning with suppressed tears. He didn’t want to hope, that had only led him to heartbreak in the past. He honestly didn’t think he could survive another setback like that.\n\n \n\n“You’ll see,” Yennefer said softly, almost like she had heard his thoughts.\n\n \n\nThe next morning they continued up the mountain, Jaskier’s heart pounding against his rib cage and his breath coming harder in the thin air. Small drifts of snow dusted the brambles around them and the path twisted around dizzyingly. They were moving more into a wooded area, finally getting a bit of a break from the wind. \n\n \n\nThey walked in silence for hours, moving through trees and around boulders. If Yennefer wasn’t guiding him Jaskier knew that he could never find his way through the woods. Part of him wondered if they were just going to walk in the quiet forever. Part of him didn’t mind that thought. \n\n \n\nThe fortress came up suddenly. One moment he was stepping around a large birch tree and the next he was looking up at a towering stone wall. It was aged clearly and showed signs of disrepair. Some of the stones were jutting out and some more had fallen to crumble around the base. \n\n \n\n“The gates are just around,” Yennefer waved him forward and they followed the wall until they were standing in front of large wooden gates. A snarling wolf’s head was cast in steel and glared out at them from the gate. \n\n \n\n“Now what?” Jaskier asked, not seeing any way to open the gates. \n\n \n\n“They know we’re here,” she perched herself on a nearby boulder and motioned for him to wait too. Jaskier just made a face and glared up at the wolf, tapping his foot impatiently. It felt like years before there was a loud cracking noise and then a terrible grinding as the door slowly swung open.  \n\n \n\nAnd standing, right between the doors was Geralt.\n\n \n\nFor a moment, Jaskier was frozen. His brain seemed to have just stopped at the sight of white hair and yellow eyes. Then, everything came back to life in a flurry of anger. He snarled at Geralt, relishing a bit in the way the Witcher flinched. \n\n \n\n“Of all the faces in all the worlds, yours is the last I want to see,” he snapped and Yennefer appeared at his side, gently touching his elbow. \n\n \n\n“I understand,” Geralt said softly. \n\n \n\n“And-”\n\n \n\n“We’re quite cold and tired,” Yennefer interrupted, shooting Jaskier a look. “Aren’t you going to invite us into your humble home?”\n\n \n\nGeralt hesitated, eyes flicking between the two of them before nodding and waving them in. The gates groaned as they closed behind them and crashed closed. Thankfully, Geralt didn’t say a word as he led them up narrow staircases and down halls. \n\n \n\nHe led them into a great room and Jaskier was surprised by it. He had expected Witchers to live in a drafty, bare cave where they slept on rocks and were surrounded by the bones of the animals they had hunted.\n\n \n\nMaybe that was bears...\n\n \n\nThe great room of Kaer Morhen had tall, elegant arches and sleek marble floors. It looked more like a palace than a fortress and was quite pleasant with the multiple fires roaring around them. Towering shelves of books lined the walls, huge dusty tomes that had probably not been opened in centuries. \n\n \n\n“Did you bring them in?” A rough voice called out and a man approached them. Grey hair was pulled back from a stern face and amber eyes studied them. \n\n \n\n“Vesemir, this is Yennefer of Vengerberg and Jaskier of-”\n\n \n\n“Nothing. Jaskier of nothing,” he butted in, shrinking back as those eyes fixed on him. \n\n \n\n“And you, Jaskier of nothing, you are the cursed bard Geralt told us about?” Vesemir asked. When Jaskier didn’t answer he continued. “Jump once.”\n\n \n\nFace burning with humiliation, Jaskier hopped and then shuffled his feet. Vesemir hummed thoughtfully and then nodded. He turned to a nearby table, grabbed a mug, and took a long swig of whatever was inside.\n\n \n\n“Geralt, show them to their rooms and let them settle in,” Vesemir directed. “The others will be coming in soon. Dinner will be served before sunset so decide if you want to eat then.”\n\n \n\nIt was an awkward walk down a hall before Geralt pointed to a door and said it was Yennefer’s. The mage stepped in but not before giving Jaskier a long, lingering look. As soon as the door shut, Jaskier hurried to the door next to it in the hope that it was his. \n\n \n\nThankfully it was. The room was warm and cozy with piles of furs stacked on the bed in preparation for winter. Jaskier felt the weight of his exhaustion suddenly settle on his shoulders. He turned to close the door but a hand stopped him.\n\n \n\n“Jaskier,” Geralt rasped. “I-”\n\n \n\n“I have nothing to say to you,” Jaskier said softly. “And I ask that you move your hand witcher.”\n\n \n\nGeralt pursed his lips and closed his eyes for a moment. “What I did was unforgivable. I was angry and hurt and...”\n\n \n\n“\n\nYou\n\n were angry and hurt? You had been strung along for months only to be cast aside for a pretty face? You started to trust and...and care for someone for them to toss you away like an old apple core?” Jaskier felt himself trembling. “You had your trust broken when you were commanded to go even though you were promised that it would never happen?”\n\n \n\n“I don’t know what to say,” Geralt finally mumbled. \n\n \n\n“You had plenty to say that day,” Jaskier hated that he felt tears building up in his eyes. \n\n \n\nGeralt looked down, hand tightening on the side of the door. “You got out safe though and met up with Yennefer though. I knew you would be safe.”\n\n \n\n“Safe? I went home Geralt, to Lettenhove,” amber eyes flicked up, widening in surprise. “And my dear mother was just delighted to have me back. It was divine, I didn’t even have to think. I didn’t have a choice. Yennefer was good enough to find me, she didn’t hide away.”\n\n \n\n“Jask-”\n\n \n\n“And she was the one who helped when my mother continued to strip everything from me. She gave me the poison to make sure that my mother couldn’t command me anymore,” tears slipped down his cheeks.\n\n \n\n“Oh Jaskier, you didn’t...”\n\n \n\n“No, I cut her throat instead. I murdered my mother and it didn’t even take away this blasted curse,” Jaskier rubbed at his face. “And if you had just...it’s fine. It’s in the past. I learned from the past, I learned not to trust you. Now, I’m going to ask you to kindly fuck off so I can take off my boots and take a nap.”\n\n \n\nGeralt looked crestfallen but allowed Jaskier to push the door closed, leaving him alone in the room. Jaskier stumbled backwards and sat on the bed, dropping his head into his hands and finally breaking down. \n\n\n\nthe cape fastened around his throat, cinching tight enough that he felt the jeweled clasp biting into his skin. in no time it would tear into his neck, shred the skin and spill his life out in flowing ruby rivers. \n\n\n \n\n\nit would cover his hands, spreading up his arms until he was coated, covered, soaked in it. \n\n\n \n\n\ndripping\n\n\n \n\n\ndripping\n\n\n \n\n\ndripping\n\n\n \n\n\nfrom his fingers, from the sleeves of his shirt, from his chin. puddling on the ground.\n\n\n \n\n\n“look at my handsome boy,” a smooth voice made him look up and his mother smiled at him. her greying teeth standing out against black decaying gums, framed by blistered lips. her fingers, skin split deep enough to show bone, traced along his cheek. “the picture of nobility.”\n\n\n \n\n\nwhere was his voice? \n\n\n \n\n\nstolen by the glass piercing his throat. \n\n\n \n\n\n“this couldn’t be enough for you?” she sighed, maggots crawling out of the rotted parts of her cheeks. “you couldn’t accept living in comfort?”\n\n\n \n\n\nhe choked around sticky blood.\n\n\n \n\n\n“julian,” those boney fingers ran along his face again, skin peeling off and falling. “why are you there? why would you leave your home?”\n\n\n \n\n\nbecause he was a prisoner there.\n\n\n \n\n\nbecause of yennefer’s hope.\n\n\n \n\n\nbecause of the promise of freedom.\n\n\n \n\n\nbecause of...\n\n\n \n\n\nno.\n\n\n \n\n\n“would you fight for it? even if it destroyed you?” her eyes were clouded with death. “is this truly any better?”\n\n\n \n\n\nthis time he pulled back from her touch and her eyes narrowed. she hissed, the sound coming from the holes in her cheeks where he could see clenched teeth. “i’m here you stupid boy. i won’t leave.”\n\n\n \n\n\nher hands tightened around his shredded throat and she started to pull, throwing the pieces behind her. he couldn’t even scream as she took him apart bit by bit. \n\n\n \n\nJaskier’s eyes snapped open and he gasped in a heavy breath, hands flying to his throat. He pressed into the skin, feeling it whole and unblemished under his touch. It was a dream, just a dream.\n\n \n\nHeart still pounding, he blinked up at the stone ceiling and let his head fall to the side. Huge blue eyes stared back at him and he let out a terribly unmanly shriek. \n\n \n\n“Who the \n\nfuck\n\n are you?” He held his blankets to his chest, scrambling back away from whatever was standing by the side of his bed. \n\n \n\nThe girl, and now he realized that it was a child, stared at him from behind a curtain of messy blonde hair. “You were crying in your sleep.”\n\n \n\n“That doesn’t answer my question!” His voice was high and frantic but he didn’t care.\n\n \n\n“I’m Ciri,” she blinked at him. “I’m training to be a Witcher here.”\n\n \n\n“Does part of your training include staring at people while they sleep? Bloody hell,” he leaned back against the headboard, still pressing a hand to his racing heart. A tiny smile quirked at her lips and she shook her head. \n\n \n\n“You must be Jaskier, the cursed bard,” there was a bit of awe to her voice. “Geralt can’t shut up about you.”\n\n \n\n“Is that so?” He couldn’t help the curiosity in his voice.\n\n \n\nCiri scrunched her nose up and nodded. “He’s annoying about it. What was your dream about?”\n\n \n\nMemories of hot blood washing onto his hands made him shiver. “I’d rather not talk about it sweet girl.”\n\n \n\n“I understand. I have dreams I don’t like to talk about either,” Ciri gave him a tiny smile. “Are you alright though?”\n\n \n\n“Yes...no...yes?” \n\n \n\n“Yeah, me too,” Ciri sighed. She stood by his side for a bit longer, eyes locked on him. “I don’t think you’re okay.”\n\n \n\n“Alright great Witcher,” he mumbled, crawling out of bed and grabbing his coat. “Now that you have so rudely woken me up-”\n\n \n\n“I wasn’t rude.”\n\n \n\n“I am going to take a walk,” he started to the door and she was right on his heels. “I was going to take a walk \n\nalone\n\n.”\n\n \n\nCiri scoffed, putting her hands on her hips. “I’m not following you. I’m going to run my course.”\n\n \n\nJaskier shrugged and walked out, stones cold against his bare feet. Ciri scampered off, reminding him of the cats that would stalk the castle when he was growing up. Outside, the sky was still dark but there was the faintest hint of pink at the horizon against the trees. \n\n \n\nThere was a bite in the air, just enough to make him shiver as he leaned against the wall of the balcony. He glanced around the sprawling grounds, noting the walls that had decayed and partially collapsed. Below him, Ciri scrambled up a wooden pole and jumped from platform to platform with grade.\n\n \n\n“Finally the bard emerges,” a loud, booming voice sounded far too loud in the morning air. The tall man it belonged to walked up to stand next to him, ignoring the way Jaskier’s body stiffened and how he leaned away. \n\n \n\n“And you are?” He frowned, taking in the almost permanent smirk on the man’s face, the amber in his eyes and the confident way he held himself. \n\n \n\n“Eskel,” instead of a handshake, the man clapped him on the shoulder. “And you are Jaskier, the cursed bard.”\n\n \n\nJaskier huffed at the name and squinted down to where Ciri raced through her course. “Yeah.”\n\n \n\n“Vesemir will help your witch find a cure,” the confidence in Eskel’s voice made Jaskier grit his teeth. “You can guarantee that.”\n\n \n\n“Forgive me for doubting but I’ve heard that before,” he mumbled. \n\n \n\n“Fair enough,” Eskel shrugged. \n\n \n\nThe sun crept over the trees, painting the sky with a brilliant smear of colors. Jaskier watched as the colors shifted, spreading and lighting up the world around them. It was truly beautiful, at odds with how ugly things could be on the surface.\n\n \n\n“Come on,” Eskel pulled at his sleeve until Jaskier followed him down a staircase to where Ciri was practicing. He curled his bare toes into the damp sand and shivered, the air easily chilling him due to the thin nightclothes he still had on.\n\n \n\n“What are you-”\n\n \n\n“Catch,” Jaskier let out a squeak, hands scrambling as Eskel tossed him a wooden practice sword. He managed to get a grip on it and scowled at Eskel. “Now, hold it like this.”\n\n \n\nIt was strange, having this Witcher move his hands so they were gripping the sword properly. After a few adjustments he was able to comfortably hold it, noticing that Ciri had sat herself on a platform and was watching carefully. \n\n \n\n“I’m assuming you have never had a proper sword lesson?” Eskel asked, picking up his own practice blade. \n\n \n\n“No,” Jaskier shook his head, remembering all the times he had refused Geralt’s offers to teach him. \n\n \n\nEskel hummed and moved his sword through the air lightly. “Well, if you are going to stay here in Kaer Morhen then you are going to have to do some work here. This is a training facility and we won’t have you sulking and helpless.”\n\n \n\nBefore he could say anything Eskel raised his sword over his head and started swinging. Jaskier frantically raised his own sword and felt the impact echoing through his arms and even making his teeth chatter. \n\n \n\n“Defending yourself is the first step. Most people start at attacking but I’ve always thought it was better to learn how not to have your head cleaved from your shoulders,” he sounded almost gleeful as he continued to swing and bash Jaskier’s sword. “Now, brace with your knees.”\n\n \n\nBy the time Eskel decided to stop his onslaught Jaskier’s arms shook with the strain. He was panting and his hair stuck to his forehead with sweat. “Can we stop?”\n\n \n\n“Imagine it’s your lute, play the sword like an instrument.”\n\n \n\n“I don’t play anymore,” Jaskier growled out, shoving back at Eskel when he did a sweeping stroke of the sword. The Witcher’s eyebrows raised and a faint smile quirked at his lips. \n\n \n\n“No? What kind of bard are you then?”\n\n \n\n“I suppose I’m not one anymore,” Jaskier felt the wood creak a bit under his tightening fingers. \n\n \n\nEskel turned and swung from the opposite side, barely giving Jaskier any time to respond but he managed to block it. “So then, what are you?”\n\n \n\nThe question made Jaskier pause long enough for Eskel’s sword to sweep under his legs and leave him falling to the ground in an undignified sprawl. He gasped, staring at the almost sunny sky as Eskel leaned over him.\n\n \n\n“What are you?” Those amber eyes sent a chill down his spine. \n\n \n\n“I...I’m...I’m cursed.”\n\n \n\n“Eh, that is something that happened to you. \n\nWhat\n\n are you?” \n\n \n\nHe swallowed, feeling his eyes burn as he stared at the rising sun. “I’m a...a coward, a murderer.”\n\n \n\nThere was a cause where all they could hear was the birds singing in the trees. Eskel tapped the wooden blade to his ribs. “That is what you have done. What are \n\nyou?”\n\n\n \n\n“I...I don’t know. Nothing, I’m not anything,” his voice came out as a whisper and Eskel cocked his head. “I’m whatever someone tells me to be.”\n\n \n\n“Hmm,” Eskel reached a hand down and easily pulled Jaskier to his feet. “Then, that seems like something you need to figure out.”\n\n \n\nHe swung the sword down and Jaskier just barely rolled out of the way. He scrambled to his feet, leaning over a bit as his aching muscles protested. The sword felt terribly heavy in his hand as he tried to make another block, gritting his teeth against the hit. \n\n \n\n“Could we...take a break?”\n\n \n\n“I’m sure the drowners and griffins going at you would let you take a break,” Eskel laughed and swung again. \n\n \n\nJaskier just focused on blocking. \n\nIt was really just a matter of time.\n \nJaskier felt his face twist into a grimace as Geralt walked up to them. Usually, he would have laughed at the powerful, huge man walking up to him with his shoulders curled in like a child about to get in trouble, but there was no humor in it.\n \nCiri’s clever eyes flicked up from their game of gwent and narrowed slightly. “What do you want?”\n \n“Just to talk to Jaskier,” the usual gruffness was gone, replaced by insecurity and a touch of fear.\n \n“I don’t think he wants to talk to you,” Ciri puffed her chest up a bit. A twinge of warmth flared through his chest and he couldn’t help but smile. It wasn’t often Jaskier had someone stick up for him.\n \nGeralt looked between them both, brow scrunching a bit as he clearly tried to figure out his next step. It was a bit like Ciri trying to decide her next move in gwent. He sucked in a breath, mouth working around words that he hadn’t thought of yet, and Jaskier decided to put him out of his misery.\n \n“It’s fine. Go practice your running or whatever,” he waved a hand at Ciri and the girl stomped off, arms crossed and a scowl on her face.\n \nA terrible, uncomfortable, awkward as hell silence fell over them. Jaskier busied himself with cleaning up the game, taking an extra long time to make sure the tiles were lined up. Out of the corner of his eye he saw that Geralt hovered for a moment before sinking into Ciri’s abandoned chair.\n \n“Eskel says you’re showing promise.”\n \n“No, he didn’t,” Jaskier grumbled, putting the lid on the box and finally settling back in his chair. Geralt looked old. He was old of course but he never showed it, not until now. There were lines that Jaskier didn’t remember, shadows that weren’t there before and a weight pressing down on him that seemed backbreaking.\n \n“No, he didn’t,” Geralt agreed, looking at his hands. “I gave him a good beating though, for ordering you around.”\n \nJaskier frowned. “Don’t do that.”\n \n“What? He knew about the curse and still ordered you. He-“\n \n“I don’t need your protecting anymore. Lots of good it did me before,” Jaskier spat and Geralt winced.\n \n“I didn’t know.”\n \nJaskier scoffed at that, eyes burning but he refused to blink and send the tears streaking down his cheeks. “You can keep telling yourself that, you can keep saying that you didn’t know, but you were the one who ordered me away.”\n \n“I’m not the one who told you to go back to Lettenhove!” Geralt snapped, his familiar temper raring up.\n \n“No, you didn’t. You just gave me a shred, a sliver, a fragment of peace and snatched it away. I have never known peace Geralt. I have never not been afraid to meet someone or be around people. I have never not been afraid of what people could do but you…you didn’t. You helped me, you protected me. You gave me peace,” now the tears were running. “And when we kissed-“\n \n“Jaskier,” Geralt sounded broken.\n \n“I have only kissed a handful of people with my consent…and you were the only one who treated me like a fucking person,” his voice cracked and he pressed a hand to his mouth, trembling.\n \nGeralt just stared, mouth slightly open as he tried to plan out what to say next. “What can I do? What can I do to fix this?”\n \n“Fix this?” Jaskier shook his head, scoffing. “There is no fixing it. You crushed it into dust when you told me to leave. You ground your heel into it and spat at it. There is nothing to fix.”\n \nAnother silence passed and Geralt nodded.\n \n“I missed your singing. I know I complained about it often but it was hard to sleep without you singing to yourself next to the fire,” Geralt mumbled, eyes sliding closed. “I realized my mistake almost instantly. I knew that what I felt for Yennefer was artificial but…with you I was frightened. I’ve never felt-“\n \n“Stop,” Jaskier barked. “You don’t treat someone you care for the way you treated me.”\n \nGeralt’s head bowed. It looked almost like he was praying, eyes clenched shut and shoulders sloped. “I things are broken…if they are really as damaged as you say…then we can’t repair what we had before. I understand that. Is there…is there a chance to start something new?”\n \n“What?”\n \n“To pretend what happened had never happened,” he looked up at him, eyes shining with desperation. “To erase it.”\n \n“I can’t just forget,” Jaskier shook his head. “I’m not the same person. Something in me…I slipped away in Lettenhove. I would just…be gone. Maybe it is like the legs of someone who is paralyzed…the muscles atrophy. I think something in me has atrophied.”\n \n“Then I will just have to know this new version of Jaskier,” Geralt said simply. “And maybe one day parts of you will grow back. Leaves die in the winter Jaskier, but they come back green and beautiful in the spring.”\n \n“Not if a wildfire ran through.”\n \nGeralt sighed and looked back at his hands. “Do you really think you are so broken? Do you really think you aren’t worthy of healing?”\n \n“I don’t know,” Jaskier shrugged, pulling a leg up to his chest.\n \nThere was a beat before Geralt leaned forward and dumped the gwent game onto the table. Jaskier barely got a protest out before the Witcher snatched up the cards and started rifling through them. He continued for a moment before holding a card out to Jaskier.\n \n“Clear weather?” Jaskier raised his eyebrows at the worn card.\n \n“This storm will pass Jaskier. With me or without, it will pass,” he pressed the card into his hand. “I want to help, I want to make up for the wrongs I’ve done. I know you can’t trust me or…regardless…if you want, let me try.”\n \nJaskier swallowed, looking down at the happy little village on the card.  “And what do I do with this?”\n \n“Return it to the deck when it has worked,” the smile Geralt gave was weak. “When the storm passes.”\n \nHe wanted to throw the card back into Geralt’s face, to scream at him and laugh at his feeble attempt at peacemaking. But…he was so tired of living in the eye of a hurricane. He was so tired of rain and sleet battering his body and crushing him.\n \nHe just wanted to feel free.\n \nHis fingers curled around the card. “It won’t be like before.”\n \n“I understand,” a flicker of hope sparked in Geralt’s eyes.\n \n“Then…I would very much appreciate your help in ending this curse,” Jaskier let out in a rush. “And we need to because you commanded me to hold onto this card you know? Until it was done.”\n \nGeralt blinked and then his mouth dropped a bit. “Shit, shit, Jaskier, I’m sorry. I’ll-“\n \n“Don’t take it back. I’ll keep it on me…at least until the storm passes,” he tucked the card into the pocket of his doublet.\n\n“This is fucking impossible,” Jaskier grumbled, squinting up at the towering book shelves. “There are too many and some aren’t even readable. I mean...is that one written on \n\nskin?\n\n”\n\n \n\n“Most likely,” Vesemir nodded and rolled his eyes at Jaskier’s disgusted expression. “But it might have the cure you’ve been looking for. Yennefer, where do you suggest we start?”\n\n \n\nThe mage hummed thoughtfully, fingers skimming along the spines of the books. Her face was blank but judging by the slight crease between her brows he could tell she was equally overwhelmed. \n\n \n\nHow could they find one thing in a seemingly infinite collection of words?\n\n \n\nVesemir started pulling books down and piling them into their arms, motioning towards the huge table in the center of the room. The stacks of books grew larger and larger and Jaskier’s hope grew slimmer and slimmer. \n\n \n\n“So...I’ll read this one on...Cures for Curses Involving Toad Bile...hopefully it’s not in there eh?” He gave them all a brittle smile. \n\n \n\nYennefer pursed her lips and sighed, pressing slim fingers against her temples. Most of the reading was done in silence, Lambert grumbling as bit as he flipped through the fragile pages. Jaskier understood, it had to be frustrating to think you were coming for the winter to recharge and instead get forced into a study session. \n\n \n\n“You can all go,” Jaskier mumbled, feeling his face heat up. “You don’t have to stay here and do this...”\n\n \n\nHe withered further when all eyes fixed on him. Vesemir frowned and cleared his throat. “I will tell you this exactly once bard, you were deeply wronged by a monster. We are the ones who hunt monsters.”\n\n \n\n“There’s nothing left to kill,” Jaskier wrapped his fingers around the edge of the book. \n\n \n\n“A curse is alive. That’s what you have to kill,” he said simply and Yennefer’s head snapped up. Her violet eyes narrowed in thought and she quickly started shuffling through the giant pile of books. Finally, she pulled out a heavy book, blew a layer of dust off it and started going through it. \n\n \n\n“What?”\n\n \n\n“Curses can come to life. That was what we were missing. After enough time it comes to life, you killed the caster but not the curse,” she leaned back, eyes alight with satisfaction. “And this might be the answer.”\n\n \n\nJaskier blinked, mind whirring. \n\n \n\nWas it that simple? \n\n \n\nCould it just be written in a few words across a page?\n\n \n\n“Is it toad bile?” He managed weakly. \n\n \n\nEskel snorted in laugher, earning a hard whack upside the head from Geralt. Based on the look on Yennefer’s face it wasn’t anything good. Jaskier’s heart rate picked up and he stared back until the mage let out a long breath. \n\n \n\n“You have to kill it,” she said softly. “And that means that you will have to be sent to it.”\n\n \n\n“Now what the hell does that even mean?” Jaskier snapped, now getting annoyed. \n\n \n\n“Magic lies in its own world. Those who can use it are able to tap into that world and pull it out. It’s like a tree, growing deeper and deeper roots the longer it is there,” Vesemir folded his hands on the table, face schooled into blankness. “You can kill it but it will be difficult, if even possible.”\n\n \n\n“You’re still now answering his question,” Geralt growled out. \n\n \n\n“I can send you to where magic is,” Yennefer said, brushing her hair behind her ear. “And you, not anyone else but you, have to find this curse and destroy it. It won’t want to give up the power it has been given and it will be manipulative, cunning even. You have to ignore that and slay it.”\n\n \n\nJaskier frowned, palms feeling sweaty. “It’s that easy?”\n\n \n\nThe grimace on Yennefer’s face made his stomach sink. “No. It’s not. Humans were not meant to be in that world. If you even get to the curse it could destroy you completely, shredding everything that you are.”\n\n \n\n“Oh,” he curled his fingers into a fist. “But...it’ll work?”\n\n \n\n“I don’t know,” Yennefer shook her head. \n\n \n\nSilence settled over the table and Jaskier stared blankly at the book laying on the table in front of him. He felt how tense his body was in how it ached and forced himself to relax.\n\n \n\n“Okay, let’s do it.”\n\n \n\n“Jaskier,” Geralt frowned deeply, leaning forward. “The risks are-”\n\n \n\n“I know the risks. I’ve lived with this curse long enough...I’m done Geralt. I’ll gladly risk my life if it means my freedom,” Geralt nodded, face falling a bit. “I’d rather die than spend the rest of my days like this.”\n\n \n\n“Always so dramatic,” Yennefer teased but it sounded weak. \n\n \n\nJaskier nodded and clapped his hands together. “Alright, how does this showdown work? I just...go to wherever and punch it a bit?”\n\n \n\n“If only it was that easy,” Yennefer finally cracked a smile. “No. We can only go when the barrier is at it’s thinnest, when the moon is full, and I will have to teach you how to manipulate the magic the best you can.”\n\n \n\n“Great, now I’m not putting all these books back. I got to prepare for my fight against the ultimate evil,” he stood and gave a little bow before walking to his room. \n\n \n\nAs soon as Jaskier closed the door behind him he sank to the floor. Nausea clawed at his throat and he shut his eyes tightly, pressing his forehead against his knees. Heavy, pained breaths were forced from his lungs and he finally let himself sob. \n\n \n\nWas he willing to do this?\n\n \n\nWas he willing to risk death or worse to just get rid of it?\n\n \n\nYes.\n\n \n\nHe would rather be dead than be trapped in this reality. \n\n \n\nIt took a few deep breaths, a few moments of collecting himself, but Jaskier managed to push himself up onto shaky legs and fell into bed. Although it was just mid afternoon he allowed himself to sleep, wanting to rest for just a moment. \n\n \n\nOf course Yennefer wouldn’t let him rest for long. \n\n \n\nShe woke him before dawn to help him practice using magic. Quickly, Jaskier learned that he was not the most talented magic user in the world. Not even close. It was like trying to catch a little fish only to have it wiggle out of his grip. \n\n \n\nPlus, her stories of the \n\nhorrible\n\n things that happened to her classmates who didn’t take it seriously made his stomach turn. \n\n \n\n“Eels?” He gasped out and Yennefer nodded sagely. \n\n \n\n“But that won’t happen to you. Not likely to happen to you anyway,” she took his hands in hers and held them in specific places. “So we are going to practice and lower the chances.”\n\n \n\nThis repeated day after day, interspersed with sword practice with the other Witchers. \n\n \n\nIt was exhausting, it was a bit discouraging, and it just made him aware of how close to danger he was. \n\n \n\nThe night before the full moon he was a bundle of nerves. Hot, painful fear twisted and churned in his gut, making him just stare at the stone ceiling in his room. \n\n \n\nTomorrow he was either going to be rid of this curse or he was going to be dead.  \n\n \n\nEither one sounded better than where he was now. \n\n \n\nA short, sharp knock made him wince, knowing exactly who it would be. He managed to take three more breaths before the knock came again and, with a grumble, got to his feet. He yanked the door open to reveal Geralt on the other side. \n\n \n\n“What?” \n\n \n\n“Are you sure you want to go through with this?” Geralt blurted out. “You don’t have to.”\n\n \n\n“I kind of do.”\n\n \n\n“No, I can...I can help you,” he had to have known it wasn’t the best argument as he wilted mid sentence. “I know I failed you in the past but I can do better.”\n\n \n\n“This isn’t about you Geralt,” Jaskier finally snapped, fingers clutching the door frame so tight his knuckles turned white. “Believe it or not. I can make this choice and I have. If it...if I die I want it to be known that I made the choice to end this miserable existence.”\n\n \n\n“So, it is a suicide then,” Geralt’s face went blank. \n\n \n\n“Either way...however it turns out, I’m making the choice to not live like this anymore,” he whispered and Geralt nodded, closing his eyes for a moment. “I can’t do it any longer.”\n\n \n\nGeralt let his head bow and let out a shaky breath. “Just...don’t accept death Jaskier. You’re stronger than you know.”\n\n \n\nWarmth bloomed in Jaskier’s chest and he smiled. This was the Geralt he wanted to remember. The gentle, strong man who cared so deeply for others that he put himself in harm’s way. This was the man who wanted to help and protect him. This was the man he had fallen in love with.\n\n \n\nSlowly, carefully, Jaksier stood on his tiptoes and pressed a gentle kiss to Geralt’s lips. They stood there for a long moment, lips pressed together before Jaskier stepped back. \n\n \n\n“I’m not accepting death. I’ve got to come back and give you that card,” he smiled. “And I’m going to do it under my own volition.”\n\n \n\nGeralt’s amber eyes shone in the dim light, a smile playing at his lips. \n\n \n\n“Good, Eskel is getting irritated that there isn’t a full deck to play with,” there was a brightness in his voice, something warm and light. “You’ll be careful then?”\n\n \n\n“Oh no Geralt, I’m planning on running in completely reckless,” Jaskier deadpanned. “This curse doesn’t have anything on me.”\n\n \n\nThat got an actual grin out of Geralt and he rolled his eyes. For a long moment they just stared at each other, expressions soft and unguarded. \n\n \n\n“I would very much like to kiss you again,” the Witcher whispered and Jaskier smiled, feeling his cheeks burn a bit. \n\n \n\n“Me as well but I have to get to bed. Big day tomorrow and all that,” he reached up to rest a hand on Geralt’s chest. “But save it for me when I get back, hm?”\n\n\n“What’s it going to be like?” Jaskier asked as Yennefer busied herself with the candles. He sat on a table, eating an apple and kicking his legs. Beside him, Geralt eyed the scene with barely concealed apprehension. \n\n \n\n“I don’t know, I’ve never been there,” she blew a lock of hair away from her face and lit another candle. \n\n \n\n“What?”\n\n \n\n“I have gotten glimpses and...it’s different every time,” Yennefer shrugged, moving the candle into another position before cocking her head and moving it back. “Alright, I think I’m ready.”\n\n \n\nJaskier hopped off the table and tossed the apple core out the window, raising his eyebrows at Vesemir’s scowl. His chest felt incredibly tight, palms sweaty and skin prickling. He tried to seem calm and collected, not wanting anyone else to see how nervous he was.\n\n \n\nHe wasn’t a fighter.\n\n \n\nHe wasn’t a warrior.\n\n \n\nHe wasn’t brave.\n\n \n\nBut, he was desperate to end this.\n\n \n\nYennefer took his hand and led him to the center of the circle of candles. She positioned him just so, brows furrowed and stepped back. “Alright, let’s begin.”\n\n \n\n“Wait,” Geralt jerked forward a bit. “Are you sure you want to do this?”\n\n \n\nThis was his chance to back out. This was his chance to make the choice to live with the curse but at least he would live. But, would living with this curse be living? \n\n \n\n“Yeah, I’m sure,” Jaskier rolled his shoulders back, hoping that by acting confident he could at least trick himself into feeling it. \n\n \n\nYennefer gave him a faint smile before lifting her hands. There was something sad in her gaze that sent a chill down his spine. The chanting, whispered curses made the candles flare and flicker, a wind picking up. \n\n \n\nFear gripped Jaskier and he fought the urge to run out of the circle. Instead, he stared at Geralt and focused all his attention on him. He let his gaze trace the strong form, drinking in the strength and hoping he could emulate a fraction of it. He locked eyes with him and smiled slightly, trying to comfort both of them. \n\n \n\nAnd then Yennefer’s chanting stopped.\n\n \n\nAnd...\n\n \n\nNothing.\n\n \n\nThe flames settled, the wind calmed, and complete silence fell over the room. \n\n \n\n“Yenn?” Geralt asked, brow furrowed. \n\n \n\n“I don’t know,” she hissed, scowling. “It was supposed to work. It-”\n\n \n\nJaskier blinked and everyone was gone.\n\n \n\nThe air itself felt different, heavy and thick, leaving him feeling out of breath. The chill of oncoming winter was gone and was replaced with a heat that was almost overwhelming. Jaskier stumbled a bit, nausea twisting in his gut. \n\n \n\nWas this what the magic realm was supposed to be?\n\n \n\nHe had an overwhelming sense of \n\nwrongness\n\n as he crept out of the room, swallowing back the fear that bubbled inside of him. Jaskier crept along the hall, trailing his hand on the wall as he went. \n\n \n\nIt only took a few moments before things changed. \n\n \n\nThe wall was damp but he ignored it until something moved under his fingers. Startled, he whipped his head around and fought back a shriek. The wall had changed from cold stone to something that looked like...flesh. It pulsated like it had a heartbeat of its own, shining with a horrible shining dampness. \n\n \n\nPanicked, Jaskier took a few steps back and hit the other wall. Instantly he was enveloped in warm flesh that pulled at his body. No matter how hard he tried to move away he was just pulled in deeper. \n\n \n\nWas this how it ended?\n\n \n\nDevoured by a fucking wall?\n\n \n\nAnd the wall closed over his face, taking his breath. \n\n \n\nIt didn’t last though. The back fell out from behind him and he fell into nothing, landing flat on his back. Jaskier gasped at the thick, hot air desperately. His body shuddered and tears sprung to his eyes. \n\n \n\nThe grass he lay in was a dark, muted purple and razor sharp where he placed his hands on. Painfully, Jaskier got to his feet with several cuts lining his hands and arms. Sweating and overwhelmed, he got to his feet and looked around the seemingly never ending field he was in. \n\n \n\n“Alright then!” He shouted into the nothingness, noting how his voice didn’t even seem to go beyond a hands length in front of him. “I’m here!”\n\n \n\nNothing.\n\n \n\n“Oh come on, you fucking torment me for most of my life and now you don’t want to show yourself? Do I have to fucking command you to do it?” Jaskier shouted, scowling. “I command you to-”\n\n \n\n“You don’t belong here,” a soft voice came from behind him and he spun around to see...himself. \n\n \n\n“You don’t belong here either,” he raised his chin, staring at the other version of himself. \n\n \n\nIt looked like him. The same clothing, the same posture, the same face. Then Jaskier really looked at the Curse, because that’s what it had to be. Its blue eyes were pupiless and dull, lacking the shine of a human. Black tendrils crept from under its collar, twisting and climbing up the throat and onto the cheeks. \n\n \n\nIt was a monster.\n\n \n\nThen it grinned, all teeth and mouth stretched horrifically wide. \n\n \n\n“I don’t belong here?” It cocked his head, going a bit too far to be natural. “\n\nI\n\n don’t? I was made here.”\n\n \n\nJaskier swallowed, ignoring the fear flowing through his veins. “Well...that’s all well and good and all but you need to go.”\n\n \n\n“I do?” \n\n \n\nHe nodded. “Yup.”\n\n \n\n“Why?”\n\n \n\n“Because you’re done ruining my life,” Jaskier snarled out, clenching his hands into fists. The cuts burned on his palms but he ignored it. \n\n \n\n“Ruining your life?” The thing blinked. “I’m ruining your life?”\n\n \n\nJaskier nodded and suddenly the Curse was in front of him. The air went even hotter, making sweat drip down his spine and causing his throat to burn with each breath. He stared up at it, meeting its dead gaze.\n\n \n\n“I want you out of me.”\n\n \n\nThe Curse tsked, pouting a bit. “Come now, I’m not ruining anything. I was created to help you.”\n\n \n\n“Fuck that,” Jaskier jumped forward, aiming to wring his hands around the thing’s neck but it was behind him holding him tight enough so he couldn’t move. Sharp nails dug into his scalp where it gripped his hair and Jaskier struggled. \n\n \n\n“Isn’t it easier when I am there? Isn’t it easier to just...go away and let me take control?” The thing hissed in his ear. “How am I hurting you when I am saving you from hurt?”\n\n \n\n“Don’t talk about that!”\n\n \n\n“And Geralt? The Witcher? You think he truly cares for you? You think that Yennefer knows you enough to call you a friend? They don’t know you my dear,” he pulled away hard enough that pain ripped through his scalp and the Curse had to grab him around the neck instead. “They know \n\nme\n\n. How much of you do you think is me? How many things about you are only here because I am?”\n\n \n\n“That’s not true,” Jaskier struggled, only able to look out onto the vast expanse of nothing in front of him.\n\n \n\n“Your music? Your personality?” The Curse asked. “All of it is because of me, because someone wanted to make you better. If you hadn’t fought against me you’d be a powerful lord, someone to fear.”\n\n \n\n“It isn’t what I want.”\n\n \n\n“No one cares what you want. They just want you to do what they want,” the thing’s nails dug into his throat deeper, blood welling around them. “And if I’m gone? What of you is left?”\n\n \n\nJaskier grit his teeth and arched his back. Geralt had always insisted he have a knife hidden in his boot, just in case. Hopefully this creature was enough of a mirror of himself to have that stay the same. \n\n \n\nHis sudden movement took the Curse by surprise and he managed to bend far enough back to wrap his fingers around the hilt of the knife. The thing hissed in pain as he hacked at its arm and he managed to shove past its grip, staggering away.\n\n \n\nThe creature was leaning forward, holding its arm where black blood dripped in sludgy clumps. It turned its sneer towards him. “You’ll die here.”\n\n \n\n“That’s fine.”\n\n \n\n“And I’ll be all that’s left,” it growled. “I’m sure Geralt will be \n\nso grateful\n\n to have you back. To have a good, obedient thing. I’ll be sure to keep him company.”\n\n \n\nAnger, not fear, licked at Jaskier’s ribs and he clutched the knife harder. If he died here...would that happen? Would it come back in his body and live his life? Would Geralt even know the difference?\n\n \n\n“Stop talking,” he snarled and the Curse’s mouth snapped shut. \n\n \n\nInteresting.\n\n \n\n“I see,” he felt giddy, chest tight and full. “I see what you are. You are nothing. You are a shadow, a puppet that thinks it is something worthy of respect. You aren’t.”\n\n \n\nThe Curse’s inhuman eyes narrowed and it started towards him. \n\n \n\n“Don’t fucking move,” it stopped. “You were forced upon a child, feeding on my fear and...you thought you won didn’t you? You thought you had taken over every part of me but you haven’t. I...\n\nI\n\n kept part of myself free from you. I did that myself. You couldn’t take that from me, no one could.”\n\n \n\nIt bared its teeth. \n\n \n\nJaskier stared at the blade in his hand, tracing the bloody lines that had dripped from his cut hands along the handle. The Curse still remained perfectly still, only its eyes following him as he stepped forward and pressed the knife into its hand. \n\n \n\n“End yourself. You aren’t worthy of me doing it for you,” the Curse’s eyes burned into him. “Because I’m not the killer, you are. End yourself.”\n\n \n\nIt blinked in surprise but the blade jerked up and carved a deep wound across its throat. \n\n \n\nSmoking, black sludge spilled over and burned the surrounding grass black. Jaskier quickly stepped back to avoid touching it as the Curse choked and gagged on its own blood. Still, it glared up at him as he hacked out darkness. \n\n \n\n“Don’t you ever come back, your time here is done,” Jaskier breathed and the thing shuddered once before flickering out of sight like a candle being blown out. \n\n \n\nAnd he was alone. \n\n \n\nJaskier could have fallen to his knees. For the first time in his memory, he was alone with himself. There wasn’t a presence lingering or a command hovering over him. He was alone, perfectly alone. A sob burst from his lips but he was grinning wide enough for his cheeks to hurt. He tilted his head forward and twisted his fingers in his hair, letting out a scream that went nowhere. \n\n \n\nHe tilted his head back and looked up into the sky, the terrible grey swirling sky. “I’m ready, I’m ready to go back.”\n\n \n\nAnd then he opened his eyes to meet Geralt’s amber ones. \n\n\nComing back to the waking world wasn’t so easy as just opening his eyes. \n\n \n\nHe managed to meet Geralt’s eyes for half a moment before everything tilted around him. Something must have shown on his face because Geralt jumped forward and grabbed him by the arms before his legs gave out. \n\n \n\nThe world tilted again and he started gagging, nausea climbing up his chest and throat. Thankfully, Geralt moved his head just in time so he could throw up the meager meal he had managed to choke down earlier. His entire body trembled and for a moment he panicked, he couldn’t \n\nbreathe\n\n.\n\n \n\n“Jaskier,” Geralt’s voice attempted to break through the haze that was engulfing him. “Just breathe, you’re safe. Just breathe.”\n\n \n\n“I can’t,” he gasped out, tears springing to his eyes as he wheezed. “I can’t! No!”\n\n \n\n“Just breathe,” Geralt took his chin and forced their eyes to meet. Frantically, he shook his head and pulled away from Geralt, dizziness overwhelming him. The ground was pulling him in. The ground was turning to flesh like the walls, oozing and seeping. \n\n \n\nThen he blinked again and it was gone. \n\n \n\n“Stay here with us,” Yennefer said softly, kneeling in front of him. When did he get on the floor? “You are here, what you’re seeing is just whispers of that place. It’s not real.”\n\n \n\nBut it felt real. The grey fog of the other realm drifted on his peripheral, sending almost constant chills up and down his spine. He gasped in a few breaths, blinking frantically to try and clear his vision. \n\n \n\nHe was finally able to focus, looking around to see everyone else staring at him. The Witchers held themselves at a distance, eyeing him warily and Yennefer looked worried. Even little Ciri was there with her too wide eyes and mouth agape. \n\n \n\n“Well...don’t just stare at me like I’m a circus animal,” Jaskier mumbled hoarsely, cheeks burning. Then he turned to look at Geralt who looked shocked. “What?”\n\n \n\n“You said no.”\n\n \n\nJaskier squinted, head pounding. “What?”\n\n \n\n“I told you to breathe and you said no,” Geralt said slowly. \n\n \n\nInstantly, every muscle in Jaskier’s body tensed. The pain would come, the agony of bones grinding and tearing and...nothing. \n\n \n\nThere was no pain. \n\n \n\n“It...it doesn’t mean anything,” he mumbled. “I didn’t hear you.”\n\n \n\n“Then-”\n\n \n\n“No!” Jaskier quickly covered his ears with his hands, chest aching from how hard his heart was beating. “Don’t! Don’t! Please don’t!”\n\n \n\nGeralt pulled back, frown on his face. “Why?”\n\n \n\n“Because...what if it didn’t work?”Jaskier hardly recognized his own voice with how small it was. “I went through all of this for nothing? I don’t know if I can handle that.”\n\n \n\nThere was absolute silence. \n\n \n\nThen Geralt knelt on the floor in front of him, gently taking his hands and pulling them away. He traced his thumbs along Jaskier’s knuckles and waited until he managed to get control of his breathing somewhat. \n\n \n\n“If it didn’t work, then we will keep looking until we find something that does,” Geralt squeezed his hands. \n\n \n\n“What if nothing can fix it?” \n\n \n\nGeralt swallowed and looked down at the floor before meeting his eyes again. “I won’t rest until we find it.”\n\n \n\nA trembling smile quirked Jaskier’s lips and he nodded, still clutching Geralt’s hands. “Okay.”\n\n \n\nThere was a pause as Geralt collected himself, brow furrowed a bit. He took in a deep breath. “Jaskier, stand up.”\n\n \n\nNothing.\n\n \n\nThere wasn’t the ache in his body, the screaming of his muscles and the cruel voice forcing him. There was nothing. Just quiet, empty peace. \n\n \n\nHe laughed.\n\n \n\nJaskier laughed until he felt sick with it, body shaking with it. Tears trickled down his cheeks and he wrapped his arms around his stomach. Geralt looked surprised but a wide grin spread across his face as well. Behind him, Yennefer laughed and clapped her hands. \n\n \n\nThen he was wrapped in strong arms and fell into the warmth. \n\n \n\n“It’s gone?” He finally gasped out. \n\n \n\n“Seems like it,” Geralt laughed, his breath tickling Jaskier’s hair. “You did it.”\n\n \n\n“You can’t have your bloody card back. I know I said I would but you told me to and I feel a bit rebellious now,” Jaskier leaned back, wiping at his eyes. \n\n \n\n“I expected nothing less.”\n\n \n\nJaskier felt almost dizzy. He wanted to try everything, he wanted to explore the limits of his own abilities. He wanted to have a fucking conversation where he didn’t have to worry about being told to do something. \n\n \n\nHe was going to have a life.\n\n \n\nHe was going to live \n\nhis \n\nlife. \n\n \n\nBut...the trip to the other realm had been exhausting and the stress of the whole event left him sagging further into Geralt’s arms. He blinked heavily, trying to capture the moment of his friend’s happy faces. \n\n \n\n“Come on, let’s get you to bed. You need a nap after your heroism,” Geralt’s tone was teasing but Jaskier just huffed.\n\n \n\n“Don’t tell me what to do.”\n\n\nNo.\n\n \n\nIt was such a little word. \n\n \n\nNo.\n\n \n\nJust two letters but he had never really understood the magnitude of it. It was something he had avoided for so long, the word not having any power for him. Jaskier knew he could say it over and over again but it wouldn’t matter. The curse took that control away from him.\n\n \n\nBut now...now that what he said mattered...it didn’t feel right.\n\n \n\nThe word itself felt wrong, like it was a promise that wouldn’t be fulfilled. Someone would say something to him that could be a command and his entire body would stiffen. The curse lingered just out of view, flaring up like a phantom limb. \n\n \n\n“No.”\n\n \n\nWas something broken in him? Normal people didn’t feel constant relief at their body actually doing what they wanted. Normal people didn’t fear that he would lose the control again. Normal people didn’t try to find the limit to their new freedom. \n\n \n\nIt started small. Jaskier refused foods when told to eat, he refused to go to practice with Eskel, he refused to play Gwent when asked. It was terrifying, the seconds that ticked by while he waited for the curse to kick in. \n\n \n\nIt never did.\n\n \n\nBut...would it?\n\n \n\nThat was what was truly terrifying. What if he got used to this freedom, learned to live without shackles, only to have it snatched away from him?\n\n \n\nJaskier supposed it was the exposure that would help. Maybe if he did it enough, refused enough commands, he would start losing that fear. He would start believing that he actually had the freedom he had been wishing for. \n\n \n\nBut this might have been a step further than he should have gone. \n\n \n\nHe could feel his thighs trembling where he knelt on either side of Geralt’s lap, hips moving in slow circles. Soft smiles and gentles kisses had turned to longing stares and teasing touches. It was inevitable it would end here, both of them on Geralt’s bed. \n\n \n\nAnd it felt good.\n\n \n\nIt felt amazing. \n\n \n\nThey had been so close to this before the mountain and the feeling hovered ever since. It burned and burned until now, until it turned into a fire that he couldn’t resist. Geralt’s large hands on his hips were so gentle, thumbs running on his hip bones in mesmerizing circles. \n\n \n\n“Jaskier,” Geralt broke the kiss, a small spark of pride flaring through his chest at how breathless he sounded. “Are you sure? You-”\n\n \n\nAnd Jaskier bit him on the side of the neck as he ground down on his lap, cutting the words off. \n\n \n\nHe couldn’t stand hearing Geralt gasp something out and then feel the pull of his body complying. Right now, this was his choice. He would be damned if it became anyone else’s. \n\n \n\nAnd he could pretend his hands weren’t trembling. \n\n \n\nAnd he could pretend his chest didn’t feel tight. \n\n \n\nThis was his choice, it was his choice to kiss and touch Geralt. He had...he had never done this with someone under his own power before. It was a bit overwhelming when he didn’t have the chance to slip away a bit. \n\n \n\nBut, it was hard to break a habit. \n\n \n\nJaskier could feel himself fading out a bit, his mind going a bit blank as they touched and he had to force himself back to the present. Panic crept up his throat a bit so he poured even more into the kiss. \n\n \n\nA gasp was forced out of him as Geralt quickly twisted them around and hovered over him, pressing his hips down into Jaskier’s. This was good, this felt nice. He looped his arms around Geralt’s neck and sighed.\n\n \n\nThen there was another slip.\n\n \n\nHe blinked and suddenly Geralt’s hand was in his pants. \n\n \n\nMaybe...\n\n \n\nMaybe this wasn’t right.\n\n \n\nMaybe this wasn’t how it was supposed to feel.\n\n \n\nIf he asked Geralt to stop, to let him breathe...would he? He could just ignore Jaskier and continue. No...no Geralt wouldn’t do that. \n\n \n\nBut, he might shush him and whisper \n\n“Hush, hush Jaskier. Let me make you feel good”\n\n and then the curse...of course that was when the curse would come back...it would strike and he wouldn’t be able to say no. He would lie there, heart breaking, as Geralt thought he was doing everything he could to make this moment perfect. \n\n \n\n“Jaskier?” Geralt’s voice in his ear made him flinch as he was brought aggressively back to the present. He blinked a few times to see amber eyes staring down at him. “Jaskier, are you with me?”\n\n \n\n“Mmhmm,” he nodded quickly. “Of course I am.”\n\n \n\nGeralt’s face remained perfectly still before he started moving off of Jaskier. Panicked, Jaskier tightened his hold on Geralt’s shirt and tried to pull him back.\n\n \n\nHe didn’t want to stop and talk about it.\n\n \n\nHe didn’t want Geralt to-\n\n \n\n“Hey, hey,” he blinked away tears, surprised that he was even crying. “What’s wrong?”\n\n \n\n“Nothing,” Jaskier fixed a bright smile on his face but it wasn’t fooling anyone. \n\n \n\n“Jaskier,” Geralt shifted to the side and sat up, frowning down at him. He just waited and then placed a hand on his arm, squeezing lightly. “Please.”\n\n \n\nTears started streaming down his cheeks and Jaskier sucked in a deep breath, desperately trying to keep himself from completely shattering. “I don’t know what’s wrong.”\n\n \n\n“Something upset you,” Geralt’s voice was terribly gentle and kind. \n\n \n\n“But I don’t know why!” Jaskier snapped. “I don’t know why I’m upset! This is something I want. I \n\nchose\n\n this! I want it!”\n\n \n\nGeralt’s hand felt like an anchor, holding him down and helping him from spinning out of control. “Jaskier, it’s alright.”\n\n \n\n“It isn’t! I’m not used to...this. I’m not used to being able to make a choice,” he let out a long, shaking breath. “Whenever I did...I would just hide. I would slip away and come back when it was done.”\n\n \n\n“Did I do anything to make you feel that way?” Geralt sounded hurt. \n\n \n\n“No, no, no,” Jaskier shook his head, looking up at him. “I promise you didn’t. I just was afraid that if I...if I said or did anything you would...the curse would come back.”\n\n \n\nGeralt let out a soft sound at that and shook his head. “Jaskier, it won’t.”\n\n \n\n“How do you know?” Jaskier choked out, wiping his eyes. “How would I? I don’t feel any different. I want to be close to you. I want to have sex and do all this but...then something in me is stuck.”\n\n \n\nA gentle hand reached up to card fingers through his curls. “There’s no time limit on this Jaskier. You’ve been imprisoned for so long, it will take time to learn how to leave free.”\n\n \n\n“That’s fucking stupid! I \n\nwant\n\n to and I can’t! How is that any better than the curse?” He spat out, rolling over so his back was facing Geralt. “When I talked to it, it said this would happen. It said that it wouldn’t really leave.”\n\n \n\n“...you spoke to it?”\n\n \n\nHe nodded miserably. “It said that it was part of me and obviously...obviously that’s true.”\n\n \n\nGeralt pulled on his shoulder until he flopped over, glaring up at the ceiling. “Jaskier, I need you to listen to me. You have experienced trauma far deeper than anyone ever should. You have seen the worst in this world and come out stronger. That leaves scars.”\n\n \n\n“Great.”\n\n \n\n“And scars heal,” Geralt continued. “The curse is gone, these feelings are not the curse returning. Your mind has been forced to accept it for so long it makes sense that it would...mourn is not the right word...but maybe?”\n\n \n\n“Are you saying I miss it?” Jaskier glared at him. \n\n \n\n“No, I’m not. I’m just saying that it is easy to get used to something. You wear chains for so long that it feels strange when you don’t,” Geralt gave him a tiny smile. “But those scars will heal. It will take time but eventually these feelings will fade. There might be days and times when it is so much more painful than others but there will be days when you might not even notice it. Trust me, trauma leaves a mark but those marks fade.”\n\n \n\nJaskier blinked away tears. “But...how long?”\n\n \n\n\nHow long will you wait for me? \n\nHe couldn’t say that out loud. \n\n \n\n“A day, a week, a year, a decade, a lifetime,” Geralt shrugged. “But I’ll be here as they heal. I’ll be here when you are ready.”\n\n \n\nJaskier nodded miserably. “How will I know?”\n\n \n\n“I’m not sure. You will though,” Geralt smiled. “And when you do, you won’t try to hide from it anymore.”\n\n \n\nWas that a possibility? Could he maybe live his life without slipping into that dark place, the only place where he felt safe? The idea struck fear in him, making his throat feel tight and his chest hitch. \n\n \n\n“This is stupid.”\n\n \n\n“This is healing. It doesn’t always make sense, it maybe isn’t comfortable but...that’s what it is,” Geralt laughed. “You set the pace and you do what feels right. If you don’t know what that is, feel it out and tell me when it goes too far.”\n\n \n\n“You’ll...you’ll stop?” Jaskier whispered, feeling his cheeks burn. \n\n \n\nGeralt’s eyes went soft and the movement of his fingers paused. He was quiet for a moment before sighing. “Jaskier, I would do whatever you asked of me.”\n\n \n\nHe nodded, not wanting to remark on the irony of that statement. Instead, he shifted closer to Geralt and closed his eyes. \n\n \n\nWhat did a healthy relationship feel like? \n\n \n\nHe could...maybe he could find out. \n\nIt wasn’t a market so much as a collection of things taken from unfortunate travelers that were lorded over by a vulture of a woman. \nThe little shack had enough holes in it to make the walls essentially useless against the icy winter winds. Piles of clothes were stacked in the corners, rusted weapons were crammed on another side, and then there was a pile of various things. \nEskel was bartering for a bag of dried...meat? The woman stared back at him with sharp eyes, not giving an inch. \nAt first it had seemed nice, leaving the fortress for just a bit. The tiny village was a bit down the mountain wasn’t anywhere anyone would ever want to live. It was where the farmers or travelers passed through to get supplies but nothing much else. Jaskier had hoped for a nice change of pace, instead he was in a dank shack filled with junk.\nWhile Eskel continued to argue prices Jaskier kicked aside some of the items, looking over them in a disinterested way. Mostly it was tarnished jewelry or chests. There was even a set of books that had been so water logged it was basically useless. \nThen something fell to the floor with a dissonant clang. \nThe lute was old and worn, the wood splintering a bit, but he couldn’t stop himself from leaning down and picking it up. It didn’t have the intricate carvings that his last one did or the well oiled strings. It felt strange in his hands, making him feel almost clumsy. \nPut it down.\nIt’s a piece of junk.\nJust let it go.\nBut then he thought about those long nights where he taught himself how to play. Just a child, hiding from his mother in a desperate attempt to have somethinganything belong to him and just him. \nEskel didn’t even blink when he approached the woman, just paying and accepting the price without question.\nHalfway back to the fortress he felt a bit silly. That money could have been spent on literally anything else, anything that could have been helpful. Instead he spent it on a piece of junk. \nJaskier’s fingers itched to just drop the lute, let it rot in the woods, but he couldn’t. \nHe did manage to keep it hidden in his cloak as they returned to the keep, scurrying past Ciri and Geralt. It felt like he was hiding a dirty little secret, not just an instrument he bought on a whim. \n“You are a piece of trash,” he mumbled at the lute when he placed it on his bed. It was a far cry from the sweet nothings he would whisper to his last one. “Honestly, better used as firewood.”\nWhere was his lute?\nThe one his mother made him leave behind.\nWas it gathering dust? Had it been smashed to bits? Was it just sitting there waiting for him to return?\nThat was rather silly...wasn’t it?\nThe lute itself was just wood and strings. It wasn’t anything magical. It wasn’t anything special.\nBut, it was the one thing he had. It was the thing that brought him freedom when he fled from his home. It was the thing that comforted him when he left Oxenfrut, heart broken. It was the thing that led him to approach Geralt, a song blooming in his heart. \nAlmost without his own permission, his fingers moved forward to drift along the strings. It was terribly out of tune and his fingers felt clumsy but a thrill ran through him.\n“I was worried I would never hear music from you again,” Geralt’s familiar grumble made Jaskier jump and whirl around, a hand pressed to his heart. \n“For someone so big you creep around like a fucking mouse!” Jaskier breathed, letting out a shaky laugh. \nGeralt’s mouth quirked up in a little smile. “I said your name twice.”\nA faint blush colored his cheeks and Jaskier shrugged a bit. “Ah...I was a bit lost in thought I suppose.”\nThere was a bit of a pause before Geralt stepped in and picked up the lute. He studied it carefully before handing it to him, eyebrow raised. “Was this an impulse purchase or are we going to be blessed with music at night.”\nJaskier laughed at that. “I can turn some of those stories Eskel and Lambert have told me about you into songs.”\nWith a laugh Geralt rolled his eyes. “Hits I’m sure.”\nThey shared a smile and warmth blossomed in Jaskier’s chest. “Do you think this is just something I can do again? Everything has changed...what if it isn’t the same?”\nGeralt took a moment to think, brows coming together in thought. “I don’t think it will be the same. I imagine the sky looks different in a cage versus being out in freedom. I think it will feel better, make you stronger. Don’t shy away from things that make you happy.”\nHe looked down at the lute in his hands and lightly strummed it, frowning when it was terribly out of tune. \n“It’s going to take a lot of work to make this thing playable,” Jaskier mumbled. \n“Luckily, you are stubborn.”\nIt did take time. Most of the day in fact. It was a pain to tune but Jaskier fell back into the familiar tightening and loosening of the strings. He got it halfway decent and let his fingers fall into position. \nThe music came as easy as breathing. The relief was such that he had tears spring to his eyes, fingers shaking a bit as he played through a few notes. It was a powerful thought that even while he was under the curse there was a part of him that was just him. Even better, that part of him had survived it all. \nThe curse hadn’t taken everything from him.\nHe was still there.\nWhen he went down to the main hall for supper his fingers were red and sore but he felt lighter than ever before. Geralt gave him a look, long and knowing with a small smile Jaskier liked to think was just for him. \nHe sat next to him and slid the gwent card over to Geralt.\nClear skies had returned once more."
}