{
    "id": "23365429",
    "url": "https://archiveofourown.org/works/23365429?view_full_work=true",
    "author": [
        "RedWritingHood"
    ],
    "title": "Your slightest look easily will unclose me",
    "rating": "Not Rated",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "陈情令 | The Untamed (TV)",
        "魔道祖师 - 墨香铜臭 | Módào Zǔshī - Mòxiāng Tóngxiù"
    ],
    "relationships": [
        "Jiang Cheng | Jiang Wanyin & Wei Ying | Wei Wuxian",
        "Jiang Cheng | Jiang Wanyin & Jin Ling | Jin Rulan",
        "Jiang Cheng | Jiang Wanyin & Jin Ling | Jin Rulan & Wei Ying | Wei Wuxian"
    ],
    "characters": [
        "Jiang Cheng | Jiang Wanyin",
        "Wei Ying | Wei Wuxian",
        "Jin Ling | Jin Rulan"
    ],
    "additional_tags": [
        "Angst",
        "Brotherly Love",
        "Emotional pain",
        "with a smidgen of",
        "Physical Pain",
        "jiang cheng feels a lot",
        "wei wuxian loves him and wants him to be happy",
        "Jiāng Chéng Needs A Hug",
        "But also",
        "Jiang Cheng Gets A Hug",
        "More than one actually",
        "jiang cheng loves jin ling",
        "jin ling is worried and for good reason",
        "jiang cheng is in heckin turmoil",
        "wei wuxian is lovely",
        "jiang cheng knows this even if he doesn't say it",
        "only happy endings for these boys",
        "Platonic Hanahaki",
        "kind of",
        "it's not actually hanahaki but it's close enough"
    ],
    "language": "English",
    "series": "",
    "published": "2020-03-29",
    "completed": null,
    "words": "9,253",
    "chapters": "1/1",
    "comments": "341",
    "kudos": "6,192",
    "bookmarks": "1,723",
    "hits": "38,124",
    "summary": "<p>\"The curse is meant to physically manifest the emotions of its victim.\"</p>\n<p>Jiang Cheng submits to the mortifying ordeal of being known.</p>",
    "notes": "<p>This was only supposed to be about 500 or 1000 words, what the heck happened</p>\n<p>Title is from \"somewhere I have never travelled, gladly beyond\" by E.E. Cummings.<br>Second half of the summary is inspired by Tim Kreider.</p>\n<p> </p>\n<p>\"We don’t give other people credit for the same interior complexity we take for granted in ourselves, the same capacity for holding contradictory feelings in balance, for complexly alloyed affections, for bottomless generosity of heart and petty, capricious malice. We can’t believe that anyone could be unkind to us and still be genuinely fond of us, although we do it all the time.</p>\n<p>Years ago a friend of mine had a dream about a staircase you could descend deep underground, in which you heard recordings of all the things anyone had ever said about you, both good and bad. The catch was, you had to pass through all the worst things people had said before you could get to the highest compliments at the very bottom. There is no way I would ever make it more than two and a half steps down such a staircase, but I understand its terrible logic: if we want the rewards of being loved we have to submit to the mortifying ordeal of being known.\"</p>",
    "text": "\"The curse is meant to physically manifest the emotions of its victim,\" the physician says. \"Positive emotions are generally manifested as flower petals that appear in your mouth. If they're negative, however...you'll receive lacerations or a rise in body temperature. The worse your turmoil, the worse the consequences. Otherwise, it's mostly harmless, and the effects should only last a week at most.\" Luli Mingzhu gives him a stern look. \"So please try to keep yourself under control during that time.\" Her expression reveals just what her opinion is on his ability to do that.\nJiang Cheng clenches his jaw, thinks: Ridiculous. What is the purpose of such a thing? To humiliate the recipient? What an idiotic idea. There are far more effective ways to ruin a life than to simply focus on their feelings.\nUseless.\n\"You're looking a little warm, Sect Leader,\" Luli Mingzhu says, unamused. \"Whatever you're thinking, stop it. Go find something relaxing to do. And please, don't make this more difficult than it has to be.\"\nJiang Cheng thins his lips, but gives her a curt nod. \nHow hard can it be, really, to keep his emotions in check?\n \n \nThere is a letter waiting for him in his study, and he knows who it's from the moment he lays his eyes on the writing.\nHe grits his teeth, the paper crinkling under the force of his grasp. The name is right there on the tip of his tongue, and it bleeds.\nHe feels it open up, feels the sting of it. Tastes the copper from the cut. Looks down to see it spreading onto the paper from his fingertips.\nHe thinks, bitter, Who are you, that you can do this to me? Who decided that you could live in me while all the same living without me?\nHis chest hurts. \nHe goes back to the infirmary to get bandages and salve, and silently blames Wei Wuxian for the blood on his clothes the entire time.\n \n \n\"Jiang Cheng!\" His brother's voice soars through the air on gilded wings, and even prepared for his arrival, Jiang Cheng still hasn't managed to prepare himself for him.\nHe stiffens, opens his mouth to bite out at him, only to abruptly snap it shut and turn his face away, his jaw clenched tight.\nThere are flower petals trapped behind his teeth.\nWei Wuxian appears at his side, pouting up at him like a disappointed child. \"What was that, Jiang Cheng? Not so much as a greeting for your favorite brother?\"\nJiang Cheng scoffs before he can stop himself, and almost chokes on more petals. He reflexively claps a hand over his mouth, feeling his expression contort.\n\"Jiang Cheng?\" Wei Wuxian asks, now sounding concerned. His hand is on Jiang Cheng's shoulder and he's looking up at him with worried eyes. \"What's going on? Are you okay?\"\nI'm fine, he wants to say. Wants to pretend like none of this is happening, like entire flowers aren't shedding their petals inside his mouth just from seeing Wei Wuxian's face. Like his heart isn't bleeding at the same time.\nSuddenly, a curse has never seemed more dangerous. \n\"Hey,\" Wei Wuxian calls, touching his cheek to get his attention. \"Tell me what's wrong. You know that whatever it is, I'll help. I've got you.\"\nSomething aches, and he thinks, I know.\n\nYou always have.\n\nPetals tickle the back of his throat, and he pulls away from his brother to spit them out. They stain the ground red where they lay.\nAfter a brief silence, Wei Wuxian says, \"Jiang Cheng... and I mean this from the bottom of my heart... what the hell.\"\n \n \n\"It's just a curse,\" he says, glaring.\n\"'Just a curse,'\" Wei Wuxian repeats. \"Curses kill people, Jiang Cheng. Just what kind of curse is this?\"\n\"A non-fatal one,\" he says shortly. \"It'll be gone within a week, so stop looking at me like that.\"\n\"Like what?\" Wei Wuxian asks. \"Like I'm worried for your life?\"\nA flower blooms, but he swallows it back, nearly wincing at the sensation. He crosses his arms. \"There's no reason to be upset,\" he says. \"At worst, it'll only be distracting. It won't last long enough to become a problem.\"\nWei Wuxian studies him for a moment. \"If you're sure,\" he says, eventually. \"Do you know who did it?\"\nJiang Cheng waves a hand dismissively. \"A demonic cultivator, relatively weak, not too bright. I encountered him during a nighthunt yesterday.\" Disgust wells in his stomach, where he knows from experience it will leave shallow bruises. \"He saw me and thought I was a demon. A demon.\"\n\"Well,\" Wei Wuxian starts, the beginnings of a teasing smile lifting his lips, \"you do tend to look fairly demonic when you're angry. You might even scare yourself if you happen to look in a mirror one day.\"\nHis glare darkens. \"Shut up.\"\nWei Wuxian laughs, reaching out to pat his arm. \"Just kidding, just kidding. No matter what face you make, you always look the most like an adorable didi to me.\"\nDespite himself, he feels a flush rise on his cheeks. \"Wei Wuxian,\" he says, sharp, flower petals spilling out onto the earth before he can think to stop them.\nWei Wuxian picks one up, brushing his thumb over the soft texture as he looks down curiously. \"Is it triggered by something?\"\n\"No,\" Jiang Cheng says.\n\"Huh.\" Wei Wuxian looks dubious, but accepts the answer without argument. He holds the little thing out to him. \"Now you're beautiful inside and out,\" he says, jokingly.\nHe doesn't know what emotion sinks into his chest, but it blooms inside his mouth and draws blood with its thorns. \"Idiot,\" he says, softer than he means to, and the taste of it stays with him for hours afterward.\n \n \nWhen he sees Jin Ling, he has to immediately leave the room. \nHe shuts himself away in his study and grabs the closest trash bin. Flower petals fall from his mouth like rain, fluttering down to become a bed of pinks and purples.\nHe wipes his mouth and thinks, This is going to be a problem.\n \n \nWei Wuxian is the first to find him hiding away. \n\"Jiang Cheng?\" he says, peeking into the room. \"Are you doing okay? No one's seen you for hours.\"\n\"I'm fine,\" he says without looking up, studiously focusing on the paperwork spread out in front of him.\nWei Wuxian slides inside, closing the door behind him. He moves to perch on the table, ignoring the glare Jiang Cheng sends his way. \"If you were really fine, you wouldn't be secluding yourself in your room for no reason.\" He waits for a response. Getting none, he adds, \"Jin Ling was worried about you.\"\nInstantly, Jiang Cheng is burdened by the familiar sensation of flowers filling his mouth. There's too many to swallow, so he leans over and spits them out into the basket.\nWei Wuxian peers down, his brows furrowing when he sees the contents layering the bottom. \"That's...a lot of flower petals.\"\n\"It's nothing,\" he dismisses.\n\"It's not,\" Wei Wuxian says. He taps the center of Jiang Cheng's forehead. \"Come on. Tell me what's really going on, didi.\"\nJiang Cheng pulls back, looking away. \"I'm older than you.\"\nWei Wuxian's lips quirk. \"Even if I'd woken up a hundred years from now, a thousand years from now,\" he says, \"you would still be my didi.\"\nHe stays quiet, his gaze lowered, jaw clenched. Petals flood his mouth, and he lets them.\n\"Jiang Cheng,\" Wei Wuxian says. \"Let me help.\" When there's no reply, his voice comes again, almost too softly to be heard. \"Please.\"\nJiang Cheng's hands curl into fists. His head comes up, mouth twisting, and through bared teeth, he says: \"This is your fault.\" Petals tumble down to the table with every word.\nWei Wuxian smiles, lifting Jiang Cheng's hands into his. \"Maybe,\" he agrees. \"But whether it's my fault, or yours, or even no one's fault at all...we'll handle it together.\"\n\"I hate you,\" he says. Blue hydrangeas fall from his lips and onto their clasped hands.\nWei Wuxian's smile becomes crooked. \"I know, didi. I know.\"\n \n \nWei Wuxian takes a seat across from him, resting his arms on the table. \"Do you know what causes the flowers?\"\nJiang Cheng hesitates, feeling himself tense up at the idea of Wei Wuxian--or anyone--knowing him in such a way.\nWei Wuxian catches the look on his face, and reminds him, \"You said I could help. Whatever you say, you can trust me with it. I won't tell anyone else unless you want me to.\"\nJiang Cheng would rather set himself on fire and stand in a pile of burning coals than tell more people that he has emotions other than bloodlust and fury. \nBut Wei Wuxian, for once, is right. And Jiang Cheng, if nothing else, has made himself into a man who does not go back on his word.\nSo he says, through gritted teeth, \"...feelings...\"\nWei Wuxian leans closer. \"What?\"\n\"The flowers are my feelings,\" he bites out.\nWei Wuxian stares at him, his mouth dropping open. Jiang Cheng feels himself grow red. \"Say something,\" he snaps, after too long in silence.\nWei Wuxian blinks, sitting back. \"The flowers are your feelings,\" he says. \"Really?\"\n\"I can break your legs right now,\" Jiang Cheng says.\nWei Wuxian holds up his hands. \"Sorry, sorry. I'm just making sure I heard you right. Do you know... which feelings?\"\nJiang Cheng would be perfectly happy not hearing the word feelings again for another fifty years. \"I do,\" he says, stiffly.\nHis brother waits. Jiang Cheng clenches his fists, but stays quiet.\nWei Wuxian says, \"Are they bad feelings? Do you actually go around wanting to break people's legs?\" He pauses. \"Or... is it me?\" His face does something that Jiang Cheng doesn't like, a light that he hadn't noticed dimming like a cloud concealing the sun. \"If that's it, then... I can leave. If I'm hurting you--\"\n\"That's not--\" Jiang Cheng says, and abruptly shuts his mouth.\n\"Then what is it?\" Wei Wuxian says, his voice almost pleading.\nHe glares down at his hands. He grits out, \"They're not. Bad.\" \n\"Oh,\" Wei Wuxian says, and after a moment, he has the gall to give a relieved smile. \"Well, if they're not bad, then at least you're not suffering too much, right?\"\nJiang Cheng shuts his eyes.\nAnd there it is: \"Wait,\" Wei Wuxian says, suddenly. \"So the flowers only appear when you have good feelings?\" \nAnother pause. \n\"So when I called your name and you didn't answer me-- when you couldn't answer me--\"\nJiang Cheng slaps a hand over his brother's mouth. \"Shut. Up.\"\nWei Wuxian gets a starry look in his eyes. He pulls the hand off his face and says, with emotion, \"Jiang Cheng.\" Then he stands up, rounds the table and gathers his much larger brother into his arms.\n\"Stop,\" Jiang Cheng says into his shoulder.\n\"Can't,\" Wei Wuxian says. There's a nearly inaudible shake in his voice. \"I love you too much.\"\nJiang Cheng thinks about bringing Zidian to life. He thinks about shoving Wei Wuxian away, or throwing him out of the room altogether.\nIn the end, he does none of that. \nInstead, he closes his eyes, turning his face into the warmth of his brother's embrace, and tries to ignore the flowers blooming in overwhelming bouquets and the stinging pain over his heart.\n \n \nAfterwards, he spits mouthful of petals into the basket, and Wei Wuxian looks at him with the softest eyes anyone has ever directed towards him.\nHe shoves a hand over them, saying, \"Don't.\"\n\"I can't help it,\" Wei Wuxian says, with a smile that feels far too warm against his palm. \"I really love you, Jiang Cheng.\" \n\"No,\" he says.\nWei Wuxian adds, in a tone that has no right sounding that delighted, \"And you love me.\"\n\"No.\"\n\"Yes,\" he says, and then sticks his tongue out.\nJiang Cheng recoils, his expression twisting in disgust. He wipes his hand on Wei Wuxian's robe, and glares when he doesn't even have the decency to look bothered by it.\n\"You love me,\" he says, again.\n\"I don't,\" Jiang Cheng says, but looks away instead of meeting his gaze. \"Shut up.\"\n\"Fine, fine,\" he says, still smiling. Then, quietly, sincerely, \"Thank you for telling me.\"\n\"Don't tell anyone,\" Jiang Cheng says, after a moment.\n\"I won't,\" Wei Wuxian promises. \"I wouldn't. Not without your permission.\"\n\"Good,\" he says, and busies himself brushing the rest of the petals into the bin. He clears his throat. \"Now. You said you wanted to help, so you can get started on the other half of my paperwork. Get working before I break both of your legs.\"\n\"But you love my legs,\" Wei Wuxian says, and then scrambles to his feet and out of the door, the sound of Zidian crackling to life behind him. \n \n \n\"Jin Ling's been waiting to see you,\" Wei Wuxian says when he next graces Jiang Cheng with his presence. \"He tried to act casual about it, but he's really worried. You still haven't talked to him yet?\"\nJiang Cheng's teeth clench on the petals that fill his mouth at the mere mention of his nephew. He turns his head to rid himself of them, catching the softness that enters Wei Wuxian's expression. He points a finger at him, sparks of purple lightning flickering around his ring. \"Not. One. Word.\"\nWei Wuxian holds his his hands. \"I wouldn't dare,\" he lies, a smile playing on his lips. He takes a seat, carelessly pushing aside the stack of papers that Jiang Cheng had finished alone. \"You need to tell him what's going on with you. He'll keep worrying about it until you do.\"\nJiang Cheng turns back to the last dregs of his work without so much as glancing at Wei Wuxian. \"No.\"\nHis brother frowns. \"Why not? He won't spread it around, you know that.\"\n\"No one else finds out,\" Jiang Cheng says, his voice coming out more curt than he intends. \n\"Jiang Cheng.\" Wei Wuxian waits patiently for him to finally look up, and then says, \"What are you so afraid of?\"\nHis entire body stiffens, and his eyes narrow into a glare, his lip curling back from his teeth as jerks to his feet. \"I am not afraid,\" he says, harshly.\nWei Wuxian tilts his head back to meet his unforgiving gaze. \"Then why are you keeping this from Jin Ling?\" When he gets no response aside from clenched fists, he says, \"He'll know you're avoiding him sooner or later. And then what? He'll think it's because of him. He's a sensitive child, as much as he prefers to act like he's not.\" After a moment, he adds, \"Prefers to act like you, in fact. And we both know that you're not nearly as unmoved as you like people to think.\"\n\"Ridiculous,\" Jiang Cheng says, crossing his arms.\nWei Wuxian looks pointedly at the bin halfway filled with the evidence of Jiang Cheng's unmoved nature. Or lack thereof.\nJiang Cheng looks away.\nWei Wuxian sighs. He gets up and puts his arm around Jiang Cheng's shoulders, leaning into him. The weight and warmth of his brother is both foreign and all too familiar, and he finds himself unable to pull away. \n\"What's wrong, Jiang Cheng?\" Wei Wuxian asks, sincerely. \nWhat's wrong? What's wrong is that the curse leaves him open. It leaves him vulnerable. He might as well have his ribcage pried apart to watch his brother's golden core glow within a bed of bone and lotus flowers.\nJiang Cheng is made up of his family and his home. That is what matters to him. That is the face of his heart. \nHe doesn't want to know what happens when someone else is allowed to see inside.\nPerhaps Wei Wuxian sees some of that in his expression, because he reaches up with his other hand to touch Jiang Cheng's cheek, turning his face until he reluctantly meets his brother's gaze. \"There is nothing in you,\" Wei Wuxian says, \"that can't be loved. You're a better man than you pretend to be, Jiang Cheng.\"\nHis jaw tightens with tension, and he rips himself from Wei Wuxian's hold, turning his back on his brother. \nHis fingers tremble. There is a wound that he thought long since closed which reopens and spills out into the space made by Wei Wuxian's voice.\nIt seems almost fitting that the damage should be echoed on his body.\nIt's deeper than any of his previous injuries caused by the curse, blood soaking into the fabric covering his chest, stinging lacerations winding around his back, his shoulders, his arms; all of it concealed only by the dark purple of his thick robes.\nThere are flowers in his mouth and thorns in his throat, and he struggles to breathe through the conflict.\n\"Hey.\" A gentle hand touches him, too light to exacerbate his wounds. \"Are you okay?\"\nHow can you ask me such a thing? he thinks, shutting his eyes. How can I possibly answer it? \n\nFor thirteen years, I searched for you, and for thirteen years, I needed nothing more from you except the knowledge that you were well and truly gone. And then when you finally return, you bring chaos in your wake, just as you always do.\n\n\nWei Wuxian, weren't you the one always leaning on me? When did that change? When did I begin to depend so entirely on your promise to stay by my side? \n\n\nWhen did I stop wishing for your persecution and just start wishing for you? When did I start wanting you to come home? I thought I was meant to hate you. I thought I was meant to banish you from my life, from all our lives, and then I find out that I was carrying you with me all along. \n\n\nIt is not your heart beating inside my chest but it's the closest thing to it. Who are you to bring me to life only for you to throw yours away? Who are you to stand there and speak words that I am no longer allowed to long for? Who are you to touch me with such guileless concern?\n\n\nWho are you, Wei Wuxian, that you still care for me after all I have done?\n\nHis brother takes his hand away, and he jolts, turning to chase it before he can think. He stops before he reveals more of himself than he already has, swiftly retreating from the act of reaching out.\nWei Wuxian, to his relief, isn't watching him. He stares down at the stray flower petals that adorn the floor, his brow furrowed. \"Sorry,\" he says, guilt coloring his voice. \"I shouldn't have pushed you.\"\nAnd with those simple words, once again, Wei Wuxian has disarmed him. \nJiang Cheng feels himself give in, feels his defenses crumble as easily as he built them up. \"It's not your fault,\" he says, unable to stay silent. It is a struggle, but he is done blaming his brother for things that he cannot control. \nTension leaves his shoulders, and he sighs. \"Get that look off your face. I'll tell him. Not right now, but... soon.\" He catches the hesitation in Wei Wuxian's expression, and repeats, \"I'll tell him. I promise.\"\n \n \nHe confronts his nephew in an empty room, not wanting witnesses to what is surely about to be one of the most mortifying conversations of his life.\nJin Ling shares up at him with cautious, curious eyes.\nJiang Cheng says, \"Jin Ling--\" and then can't speak for the petals pouring out of his mouth.\n\"Jiujiu,\" Jin Ling says, utterly horrified. \nJiang Cheng holds up one hand, pressing the back of the other to his mouth. \"Excuse me,\" he chokes out, flowers still falling, and walks--not flees--away.\nHe does not look back for fear of catching a glimpse of his nephew's worried expression and losing his ability to breathe.\n \n \nJiang Cheng has encountered a problem. \nHe wasn't lying to his brother when he said that he would tell Jin Ling about the curse, but matters have gotten... complicated.\nComplicated in the sense that every time Jiang Cheng sees his nephew's face, flowers bloom uncontrollably on his tongue and he can't speak without spilling his heart onto the floor beneath his feet.\nTalk to Jin Ling? Not only about the curse, but about anything? He's more likely to kill himself choking on a mouthful of godforsaken emotion petals before he can so much as get a word out.\nWhich is why he's here, shoving open the door to Wei Wuxian's room and unceremoniously moving to loom over his blissfully sleeping brother.\nHe says, without regulating the volume of his voice, \"Get up.\"\nWei Wuxian does not. Instead, he scrunches up his face the way that Jiang Cheng remembers from when they were younger. His brother was not, and never has been, an early riser.\nHe'd stumble out of bed only to attach himself to Jiang Cheng's side and hang off of him like a limpet; splayed over his back, chin hooked on his shoulder, mumbling complaints into the fabric covering his neck. \nThe memory is clear, but the warmth and the weight is something that he has long ago forgotten. \nWhen he reaches down to his brother, his fingers are tentative and feather-light. He is unaccustomed to gentleness, whether displayed towards him or from him. He is not sure he remembers how to be gentle anymore. He is not sure he remembers how to be kind.\nBut he knows that he does not want to hurt Wei Wuxian. Not again.\nAfter a moment of hesitation, he slowly rests his hand against Wei Wuxian's shoulder. Heat seeps into his palm, and he ducks his head down to say, quietly, \"Wei Wuxian. It's time to wake up.\"\nHis brother cracks open his eyes. His gaze travels up to Jiang Cheng, barely aware enough to know who he's looking at. \nWei Wuxian blinks, slowly, before his mouth tips into a dazed smile. \"Jiang Cheng,\" he murmurs, and reaches out.\nJiang Cheng feels himself leaning--helplessly, without thinking--towards his brother's touch.\nWei Wuxian's hand curls around his upper arm, and he only has enough time to realize the widening of Wei Wuxian's grin before he's abruptly yanked down and enfolded into waiting arms.\nIt's not the same as it was all those years ago; Wei Wuxian is smaller, thinner, more easily bruised than he has ever been before. It is not his body, and that fact only becomes more obvious in this moment.\nBut Jiang Cheng has only ever been held by three people in his entire life, and despite everything, Wei Wuxian still hugs him the same way that he always has. Tightly, with the whole of his being. Pressing closer until there is nothing but warmth where there used to be cold spaces.\nHe's bleeding again, but the wounds close up only seconds after they pull open, and the familiar taste of flowers blooms heavy on his tongue.\nWei Wuxian hums in his ear, burying his face into Jiang Cheng's hair. \"Too early. Sleep.\"\n\"I need to talk to you,\" Jiang Cheng says, petals slipping out onto the dark spread of his brother's hair. But he doesn't move away from the hand curled around the back of his neck, or the arm flung around his shoulders.\nWei Wuxian makes a small, displeased sound. \"Later.\"\n\"Not later,\" Jiang Cheng says, even as he rests his forehead against Wei Wuxian's collar. Even as he closes his eyes, allowing himself to relax as much as he dares. \"Now.\"\nWei Wuxian gives the tiniest shake of his head, pulling him impossibly closer, hooking one foot around Jiang Cheng's ankle. \"No. Sleep.\"\n\"Wei Wuxian,\" he says. His voice wants to come out softer than it should.\n\"Jiang Cheng.\" His brother's chest rises and falls, the steady exhale of his breath ruffling strands of his hair. \"One more hour.\"\nWords of refusal form swiftly, but before they can be spoken aloud, Wei Wuxian says, \"Please.\" \nJust that simple word and nothing else.\nWhich is low. How he is supposed to refuse now?\nHe closes his mouth, exhaling against his brother's neck. Wei Wuxian senses his defeat like a hound scenting blood, immediately relaxing back into his bed.\nAfter a moment, Jiang Cheng says, \"Let me up.\"\n\"Don't go,\" Wei Wuxian says, instantly, and his voice sounds almost urgent, as if he thinks Jiang Cheng will just ignore his request and push him aside. As if he even could, after everything. After Wei Wuxian built himself into Jiang Cheng's bones and made a home there.\n\"I have work,\" he says, but it's halfhearted at best, and he feels Wei Wuxian's head turn, feels his smile against his temple.\nHis brother doesn't bother to dignify him with a response.\n \n \nHe doesn't know when he falls asleep.\nHe dreams of blue skies and endless lakes that reach the horizon and grow rows of lotus flowers in their depths. Water laps at his waist, his robes heavy and weighted, closed lotus petals brushing his fingertips.\nFour voices call his name, and as he turns, two hands reach out to grasp his. One is soft and gentle while the other is strong and sure, and they both pull him towards the shore.\nThere, two more figures are waiting. One of them smiles at him. \"Jiang Cheng,\" he says, with warmth rolling out from his voice. \"Let's go home.\"\nHis mother only meets his gaze and says, simply, \"Come.\"\nSomething swells in his chest, something like desire, or yearning. He wants nothing more-- he could never want anything more.\nHis sister tugs at his hand, smiling. \"A-Cheng, you look happy.\"\nIs that what he is?\nWei Wuxian leans towards him, his eyes bright as stars. \"Are you glad to be with us?\"\nHe hears himself whisper, the words scraping his heart as they rise to his throat: \"Of course I am.\"\nHis brother hums, gaze tracing over his face. Without letting go of his hand, he reaches up and touches Jiang Cheng's cheek. He tells him, \"Don't cry, Jiang Cheng.\"\n\"I'm not,\" he says, but his eyes are hot and stinging.\nHis sister steps closer. \"Come home,\" she says, softly, and Jiang Cheng opens his eyes.\nHis chest hurts. \nWei Wuxian's heartbeat drums out a steady tattoo of sound beneath his ears. He listens. Listens, and cannot think. His mind is blank. His hands are cold.\nThere is an aching emptiness inside of him. It has been a long time since he last dreamed of such hopeful things; he doesn't know whether it's terribly kind or unspeakably cruel, that he does so now.\nFrom the feel of the flowers pressing against his teeth and the blood welling from his chest and palms, he thinks it might be both.\nHe closes his eyes again.\nThere is a hand cradling the back of his head. His crown had been removed sometime during his rest, and he can feel his brother's fingers buried gently in his hair. The other hand is flat against his back, sinking heat into his skin. His eyelashes cling together, the faint taste of salt on his lips. \nThe fabric underneath his cheek is wet. \nAnd it is not Wei Wuxian's hands, nor his chest, nor his heartbeat-- it is not Wei Wuxian's eyes or his voice-- but it is his brother, and it is more than Jiang Cheng ever expected--ever hoped--to regain.\n\"Jiang Cheng?\" Wei Wuxian says, softly. \"Are you okay?\"\nA drop of blood slips down his wrist. \"I'm fine,\" he says, his voice rough. \n\"...You were crying.\"\nHe breathes. The pain is fading, the cuts sealing themselves until the only evidence of them is the crimson staining his hands. He is left invariably empty. \nHe says, \"It doesn't matter. It was just a dream.\"\n \n \nMercifully, Wei Wuxian doesn't ask about it. Instead, when Jiang Cheng finally pushes himself up, his brother reaches out to frame his face in both hands and says, \"A-Cheng, smile for me.\"\nHe feels an automatic flare of irritation in his gut, overwhelming the hollowness there. He immediately slaps Wei Wuxian's hands away. \"Who would smile for you, idiot?\" he snaps.\nWei Wuxian pouts at him. \"Lan Zhan would...\"\nSomething twists in him, and he scoffs, \"Lan Wangji? Does he even know how to smile?\"\nWei Wuxian pokes him. \"Do you?\"\nJiang Cheng bats him away again. \"You know I do.\"\nWei Wuxian tucks his fingers into his palm, forgoing another attempt to reach out. \"I never see it anymore,\" he says, and something in his voice comes out a little too troubled for it to be a joke.\nJiang Cheng looks away, mouth tensing. \"Maybe you're just not funny.\"\n\"People don't just smile because something's funny,\" Wei Wuxian says, sitting up. \"They smile because they're happy.\"\n\"You don't,\" Jiang Cheng says, more curt than intended. \"You smile to hide the fact that you're not.\"\n\"Only sometimes,\" Wei Wuxian protests. \"And I'm usually called on it now, anyway. Lan Zhan does it, or A-Yuan, or Wen Ning... sometimes even Jin Ling. No one lets me hide anymore.\"\n\"Good,\" Jiang Cheng says, lips twisting. \"It's what you deserve.\" \nWei Wuxian grins. \"Jiang Cheng, that's either really nice of you or very rude. I'd wonder which, but since I know that you love me...\"\nJiang Cheng scowls. \"An opinion that I'm rethinking.\"\n\"No, you're not,\" his brother sings, and despite everything, is infuriatingly correct.\nJiang Cheng presses his lips together. There is a flower blooming on his tongue and he does not want Wei Wuxian to see it.\nThe man is already unbearably smug as it is.\nHis brother waits a moment for a response that doesn't come. His smile becomes something more subtle, more crooked, and he reaches down to pat Jiang Cheng's hand. He settles back on his bed, propping his head up with one hand. \"So,\" he says, conversationally, and Jiang Cheng is instantly on guard. He recognizes the sly undertone. That slyness has never boded well for him. \"I'm guessing you came here to talk about something? Unless you just wanted some light cuddling... were you feeling lonely, didi?\" He grins. \"Gege's always here for you, you know that.\"\nAs always, Wei Wuxian does not allow him time to wallow in his sorrows.\nJiang Cheng flushes, automatically moving to shove Wei Wuxian back into his bed, ignoring the audible oof that comes from him. \"I'm here about Jin Ling,\" he says, disliking that his brother so easily draws him back from the edge of melancholy, even after all this time.\nWei Wuxian perks up. \"Did you tell him? How did he react? You let him know that was why you were avoiding him, right?\"\n\"I didn't tell him,\" Jiang Cheng says.\nWei Wuxian blinks, frowns. \"You didn't? Why not?\"\nHe presses his lips together. Grits out, \"I can't.\"\nWei Wuxian furrows his brow. \"What do you mean, you can't? All you have to do is walk up to him, open your mouth and-- oh.\" His face does something, then; a flash of awareness, and then an unraveling into a wealth of exasperation and tenderness. \"Oh, Jiang Cheng.\"\n\"Don't,\" he warns. His face feels hot in a way that has nothing to do with the curse.\n\"You're hopeless,\" Wei Wuxian says, and puts his arms around Jiang Cheng in a tight hug.\n\"Stop,\" he says, refusing to give in to such baseless affection.\n\"No,\" Wei Wuxian says. \"I love you, and you're going to have to live with it.\"\nJiang Cheng huffs, mutters, \"Not if I kill you now.\"\n\"Even then,\" Wei Wuxian says, holding him tighter. \"I'll still love you even then.\"\nThe taste of honeysuckle floods his mouth, and Jiang Cheng's shoulders slump. \"You never know when to give up,\" he says, and he doesn't know whether it's meant as criticism or gratitude.\n \n \n\"Alright,\" Wei Wuxian says, once he pulls away. He looks him in the eye, his hands on Jiang Cheng's shoulders. \"Jin Ling still deserves to know, but I understand your concern. Leave this to gege.\"\n\"Those words from your lips have never ended well,\" Jiang Cheng says, wary.\n\"What are you worrying about?\" Wei Wuxian asks. \"Come on, it'll be fine. How could this possibly go wrong?\"\nJiang Cheng feels a chill. \"I'm going with you,\" he says, without thinking twice.\nWei Wuxian shakes his head. \"Remember what happened last time? All you did was look at his face and you filled half a basket with flower petals. You'll just freak him out.\"\nJiang Cheng clenches his teeth. As much as he hates to admit it, his brother is right. It's a bitter flavor, this helplessness, but he has no other choice. \"Fine,\" he says, grudgingly. He narrows his gaze, reaching up to grip Wei Wuxian's wrist. \"Don't mess up.\"\nWei Wuxian gives him a dazzling grin. \"Ye of so little faith,\" he says. \"I've got this. Trust me.\"\nJiang Cheng grimaces, then relinquishes with a sigh. Perhaps I should, he thinks.\nIt's only a conversation, after all. What's the worst that could happen?\n \n \nJin Ling bursts through the door of his study, falls onto his desk and bawls, \"Jiujiu, you're dying?!\"\n\"I'm what,\" Jiang Cheng says. Zidian crackles, electricity sparking in the air. Wei Wuxian nearly falls over the doorway in his haste to get through, and it is only by the barest thread of control that Jiang Cheng holds back from unleashing a handful of lightning straight at his face.\n\"It's a mistake!\" Wei Wuxian blurts, panicked.\n\"Why,\" Jiang Cheng grits out, low and dangerous, \"is my nephew under the impression that I am dying, Wei Wuxian?\"\n\"I didn't mean to!\" his brother says, quickly. \"I just told him that you had been cursed and that it was connected to your emotions and that it would... all be over within a week...\" he trails off. \nJiang Cheng breathes.\nHe does not use his electrified whip to strip the skin from Wei Wuxian's traitorous back. He does not wrap his hands around Wei Wuxian's far-too-fragile neck and squeeze. He does not grab Wei Wuxian and shake him until he finally starts to think with a little goddamn sense.\nHe looks at his nephew.\nJin Ling looks up at him with a confused, tear-streaked face. \"Jiujiu?\" he says. His voice cracks straight through the word and breaks it into pieces.\nJiang Cheng feels his heart constrict. It is not an unfamiliar sensation, when it comes to Jin Ling. He exhales, and allows Zidian's lightning to disperse into nothing. He can deal with Wei Wuxian later; right now, his nephew is his first priority. \nHe reaches down to pull Jin Ling to his feet and says, steadily, \"I am not dying. I am not planning to die. The curse isn't fatal, Wei Wuxian is just an idiot.\"\nJin Ling dashes a sleeve over his eyes. When he speaks, the words waver. \"Jiujiu, you're not lying to me, are you?\"\n\"Never. Not about this,\" Jiang Cheng says, seriously, and with more sincerity than a human voice can ever convey. \"I would sooner denounce my own sect and leave Yunmeng to become a demonic cultivator.\" \nMiraculously, Wei Wuxian ignores any compulsion to give a retort. Instead, he turns to their nephew and says, with clear apology in his eyes, \"Jin Ling, I'm sorry. I didn't think about how it would sound. I had no intention of causing you grief, but I was thoughtless enough for it to happen anyway. Can you ever forgive me?\"\nJin Ling sniffs, his eyes red, and he looks away from Wei Wuxian's earnest remorse. \"If... if jiujiu is really okay, then I guess it's fine...\"\n\"Good kid,\" Wei Wuxian says, with affection and gratitude, and envelops Jin Ling in a heartfelt embrace.\n\"Dajiu,\" Jin Ling complains, but noticeably leans in rather than trying to escape.\nJiang Cheng watches for a moment before he has to turn away. There are petals building up in his mouth and he can do nothing to stop them.\nHis brother hugs their nephew with a smile on his face and hands that cling as if afraid that he will disappear. Jiang Cheng does not want to see the way that Wei Wuxian closes his eyes, or the way that his smile becomes small and soft, or the way that he so very carefully does not wrinkle Jin Ling's robes under his grasp.\nHe does not want to see it, but it lingers there, in his mind. Wei Wuxian's care. \nIt has been a long time since Jiang Cheng deliberately thought of his brother's unabashed warmth towards others. Longer still since he was worthy of it. \nPerhaps he never was. Perhaps he never will be. But worthy or not, Wei Wuxian has not stopped treating him as if he is, and Jiang Cheng would be the worst sort of fool if he threw that away for the sake of either recompense or pride.\nHe wants his brother to care for him. \nIt's selfish, he knows it's selfish, but that's who Jiang Cheng is. He is a foolish, selfish person, and he wants Wei Wuxian to love him. \nHe says, rougher than he means to, \"That's enough, you're going to smother him.\"\nWei Wuxian squeezes Jin Ling tighter and sticks out his tongue. \"You're just jealous that I'm hugging someone else.\"\nJiang Cheng scoffs before he can stop himself. \"Are you five?\"\nWei Wuxian grins at him over the top of Jin Ling's head. \"Of course not,\" he declares, and brandishes three fingers towards him. \"Xianxian is three.\"\nJiang Cheng makes a loud, aggrieved sound in the back of his throat. \"Wei Wuxian. Stop being an idiot, that only works on ajie.\"\n\"Ah,\" Wei Wuxian says, on a punched-out gasp, and goes silent. \nHer memory hangs in the air, and the feeling of her name spoken thoughtlessly from his tongue sinks into his bones like a palpable weight.\nThe flavor of copper overpowers the floral taste that he had grown used to, but worse than that is the look on his brother's face; startled into openness, revealing something wretched and saddened underneath.\nJiang Cheng can't stand it. He has spent thirteen long years blaming Wei Wuxian for their sister's death, and the sight of his brother's pain is unbearable to him now. The thought of adding to it, of blaming him again, twists in his stomach and leaves him feeling almost sick.\nHe still remembers the slick, deliberate words that had slipped from Jin Guangyao's venomous tongue. \n\"You should understand one thing: that you're also responsible for Wei-gongzi's situation... heavily responsible.\"\nIf you had only stood with him back then, he thinks, and it resounds in him, just as bitter as the first time he thought it. \n\n\"After the Sunshot Campaign, the Lanling Jin Clan, the Qinghe Nie Clan and the Gusu Lan Clan were in competition for power, and all the great powers were divided. As for you, you'd just rebuilt Lotus Pier. There was even a dangerous and formidable Wei Wuxian behind you. Do you think the other clans liked seeing a young clan leader with such a powerful and unbeatable backing?\"\n\nHe remembers the smile on Jin Guangyao's face, and Wei Wuxian's lowered gaze, and the turmoil that he had felt.\nThat he still feels.\n\n\"Hence, Clan Leader Jiang, if your attitude towards your shixiong was a bit better, showing everyone that your bond was too strong to be broken, or even if you showed a little tolerance after what happened, and not given others a chance to spark discord... things wouldn't have become what they were.\"\n\nIn the end, it comes back to this: who is truly the one at fault, when Wei Wuxian was only trying to do the right thing?\nAlways, always trying to do the right thing. That is the core of Wei Wuxian's being. That is what Jiang Cheng lacks: the ability to know, doubtlessly and without question, what the right thing is; the fortitude to do what is necessary, and the heart to not regret it.\nWei Wuxian is mischievous, and reckless, and fearless to the point of becoming a danger to himself. He has no self-preservation. He rushes headlong into trouble with little regard for the consequences. He is the most infuriating person Jiang Cheng has ever known.\nHe is everything that Jiang Fengmian had wanted Jiang Cheng to be.\nWei Wuxian is infuriating, but he is righteous, and he is good. Those are qualities that Jiang Cheng will never be able to lay claim to. \n\"You're a better man than you pretend to be,\" his brother had told him, but Jiang Cheng does not pretend to be anything other than what he is. He is not like Wei Wuxian, whose soul outshines his golden core, who has bravery written into his bones, who has kindness drawn in every line of his body.\nThis is Jiang Cheng: a man who cannot dull the sharpness of his tongue. A child who watched everything he loved burn to ash, and blamed it on his brother. A failed son who could not satisfy either of his parents. A failed brother who could not protect even one of his siblings. A failed uncle who cannot tell his nephew that he loves him. \nAnd this is him, even now: a man who is still jealous. A man who is still angry. A man who is still failing, still grieving, still sad.\nBut he is no longer the kind of person who wants to see his brother in pain.\nHe finds the words and pushes them out.\n\"Wei Wuxian,\" he says, demanding and graceless, \"what are you looking like that for? Do you think I will take pity on you like ajie? Do you think I will coddle you like Lan Wangji? There's no reason for those eyes, so stop looking that way.\"\nWei Wuxian blinks in surprise, then gives a laugh that suits him far better than sorrow ever did. \"Ah, a-Cheng is right, of course. I shouldn't be marring my handsome face with a frown. What will Lan Zhan say if I come back with wrinkles? I'll end up looking like you.\"\n\"Hah?\" Jiang Cheng snaps. \"Is that how you talk as a guest of Lotus Pier? Do you address Zewu-jun similarly?\"\n\"How could I?\" Wei Wuxian protests. \"Zewu-jun is too nice. Unlike Jiang Cheng...\"\nBefore he has the chance to retort, Jin Ling pushes away from Wei Wuxian, his face red. After all of his years with Jiang Cheng, he is still unaccustomed to Wei Wuxian's particular brand of affection. \"Jiujiu is nice too,\" he insists. And then he immediately ruins it by adding, \"...Sometimes.\"\nJiang Cheng makes a mental note to give his traitorous little nephew extra training for the next few days.\n\"My mistake,\" Wei Wuxian says, smiling. \"Of course, Jiang Cheng is exceedingly kind. I only forgot for a moment. I remember now.\"\nJin Ling subsides, his expression embarrassed. He crosses his arms, unable to meet either one of his uncles' gazes. \"Don't forget again,\" he says, and surely the flowers have decided to grow within Jiang Cheng's chest as well as his mouth. Surely they have planted roots in his heart and lungs, surely every breath he takes in will come out in a rain of petals.\nHow else is he supposed to explain the way that he feels? His soul is a garden too large to be contained by his body.\nHe sways, reaching out to steady himself on his desk, and leans over to let out the flowers rapidly building up on his tongue.\n\"Jiujiu?\" he hears Jin Ling say, and the alarm in his voice is echoed by Wei Wuxian's exclamation of his name.\nA hand presses against his back, and he doesn't have have to look to know who it belongs to.\n\"Breathe,\" Wei Wuxian murmurs close to his ear. Jiang Cheng is aware of the warmth of his palm even through the weight of his robes.\nBy the time the petals have slowed, he's clutching the edge of his desk, panting. \nThe silence is only broken when Jin Ling says, doubtfully and a little frightened, \"You're sure he's not dying?\"\nWei Wuxian pats his brother's back, gently. \"That's what I'd like to know. Jiang Cheng?\"\n\"I'm fine,\" he says, belied by the breathlessness of his voice.\n\"I think it's time we visit that physician of yours,\" Wei Wuxian says.\nJiang Cheng stiffens, pulling away from his brother's touch. \"That's not necessary.\"\n\"Well,\" Wei Wuxian says, placing both hands on his hips, \"judging by your reaction just now, I'd say it's very necessary.\"\n\"You're hiding something,\" Jin Ling accuses, scowling up at him.\nJiang Cheng thinks of blood staining fabric, the taste of copper, the sensation of wounds opening up without the aid of a weapon.\nHe says, again: \"I'm fine.\"\nWei Wuxian looks at him, searching his face. After a long moment, his shoulders come down, and he sighs. \"Jiang Cheng... you're a terrible liar.\"\n \n \nJiang Cheng is all too aware of Wei Wuxian's silence.\nHis brother hasn't said a word since they left the infirmary. The few times he interrupted Luli Mingzhu had been to ask questions, only to fall quiet immediately afterwards. He had listened intently, had thanked the physician for her time, and had bowed politely before they took their leave.\nJiang Cheng won't admit to being unnerved, but the last time he'd seen Wei Wuxian this subdued was in the Guanyin Temple, as he endured the outburst of Jiang Cheng's anger and desperation.\nIt has been three years. Sometimes he still feels the phantom touch of Wei Wuxian's fingers gently brushing away his tears.\nHis brother is too kind. Too good. He forgave Jiang Cheng's hatred with an ease that burns him. Jiang Cheng knows who he is, and he knows himself to be incapable of such forgiveness. If the roles were reversed, he would have seethed in the injustice of it all. He would have despised Wei Wuxian for not standing by his side when he needed him most.\nDespised him exactly as he had the first time.\nThere is too much bitterness in him, and not enough compassion. Even when he was younger, he struggled to give away what little grace he possessed. Now, he has learned that he must do what he can with what he has left. And if anyone deserves grace, it is surely Wei Wuxian. Whether the grace belongs to Jiang Cheng or someone else, it doesn't matter. He deserves all of it.\nAnd perhaps it stings, to know that Jiang Cheng is not the one Wei Wuxian trusts to give him that. Perhaps it grates, to know that he is not the one by his brother's side. \nBut it doesn't matter. It can't. What else is there to be done about it? Wei Wuxian is in love with Lan Wangji, and it would be the most selfish thing, to ask that he stay. Wei Wuxian, too, would never ask that he leave. As Sect Leader, Jiang Cheng has responsibilities. He has built Lotus Pier from the ground up. He has replaced doors broken by swordswing and removed floorboards too soaked with blood to ever be clean again. He has overseen the draining of lotus ponds whose water has been dyed red and the reconstruction of the place where his parents took their last breath.\nHe could no more abandon his home than Wei Wuxian could chain himself to it.\nThere is no point to wallowing in what-ifs and could-have-beens, but this is who he is. He knows that he can't change the past. He can't change what he's already done. But if ever there was a chance, then...\n...then Wei Wuxian would have no cause to doubt him.\nHis regrets are thorns that prick his throat and hands and heart. His guilt is a heavy and bruising weight. If ever he were given the chance to go back and change one thing, he would not turn his back on his brother. He would carry Wei Wuxian's burdens alongside Jiang Cheng's jealousies and heartaches. He would convince Wei Wuxian that he was not alone.\nAnd perhaps, when all was said and done, he could convince himself, too.\nWithout warning, Jin Ling's voice breaks through his thoughts. \"Jiujiu,\" he says, alarm threaded through his voice, \"your hand.\"\nJiang Cheng becomes aware of the slow slide of wetness down his fingers and instinctively looks down to see his palm slicked with blood.\nInstantly, Wei Wuxian pulls to a stop and reaches for him. Jiang Cheng resists the urge to snatch his hand away before he's subject to his brother's careful touch. It's too late to hide the evidence of his emotions; Wei Wuxian knows what it means. Luli Mingzhu had already told them the entirety of the ramifications that come with living under the curse. \n\"It's hurting you,\" Wei Wuxian says, and he sounds as if he's the one who was sliced open.\n\"It's nothing,\" Jiang Cheng says, shortly.\nWei Wuxian presses his sleeve against the cut. His voice comes out quiet. \"This doesn't look like nothing to me.\"\n\"It'll heal. It always does.\" He feels too open, like this. Bleeding out his sorrows under his brother's gentle hands, the possibility of flower petals a palpable sensation that he can't escape.\n\"It always does?\" Wei Wuxian repeats, and Jiang Cheng stiffens, realizing his mistake. \"How often does this happen?\"\nThere is no reply, and Wei Wuxian presses, \"Jiang Cheng. How often does the curse hurt you?\" He steps closer still, forcing Jiang Cheng to meet his gaze. \"Mingzhu-qianbei said that you asked for extra salve. Why didn't you tell me there was more to it than the flowers?\"\nJiang Cheng wants to pull back, to put space between himself and the searching eyes looking up at him, but he is rooted to the ground, he is chained by the warmth of Wei Wuxian's hand cradling his. He does not want to give his brother the answer welling up inside of him. There is too much honesty in it.\nHe thinks, You have borne too much of my pain. You have seen too much of my soul. Am I not allowed to hide even the weakest corners of myself from your sight?\nHe swallows it down, says, curt, \"I didn't want to worry you. The curse is in effect for only a few more days, there's no reason to mention it.\" \n\"There is a reason,\" Wei Wuxian says. \"If you're being hurt, then there is a reason.\"\nJiang Cheng lets out a sharp breath. \"Would you have told me? If you were in my place, would you say anything at all, or would you simply smile while you bled in silence?\"\nSomething flickers across Wei Wuxian's face, and Jiang Cheng's mouth twists. He says, \"You forget that I know you. Lan Wangji is not the only one familiar with your thoughtless, self-sacrificing nature.\"\nThere is a moment of silence.\n\"You're right,\" Wei Wuxian admits, eventually. \"That's exactly what I would do. It's who I am... but it's not what I want us to be.\" He cradles Jiang Cheng's hand against his chest, looking up at him with bright eyes. \"Then, if I vow to tell you when I'm suffering, will you do the same? Even if it's hard? Even if it feels impossible? I want there to be trust between us, Jiang Cheng. I want to help you. And... you want to help me, too, don't you?\"\nWords climb up through his ribcage and spill flowers over his tongue. \"Idiot,\" he says, rough and revealing. \"Of course I do.\"\nJin Ling grasps his other hand, tugging lightly. \"Promise me, too,\" he says, raising his chin. \"I'm here just like dajiu, aren't I? Can't you trust both of us?\"\nThere's a stubborn set to his mouth that could only have come from his father, but Jin Ling's heart comes entirely from his mother. Jiang Cheng has never been able to deny that heart. Not then, and certainly not now.\n\"Who else would I trust?\" he says. He wants to sound irritated, but any attempt is belied by the sincerity that comes out, and the scattered bouquet falling from his lips.\nJin Ling catches a petal in his free hand, looking up at Jiang Cheng with a new awareness in his gaze. \"Jiujiu,\" he says, and that single word sounds humiliatingly soft. \nJiang Cheng is not a man accustomed to being vulnerable, but he has been forced to learn that the armor he thought he'd built is far more fragile than he once imagined it to be. His family breaks him open. He is unclosed as easily as the uncurling of fingers from a closed fist. He is unveiled with a gentleness that he cannot fight, and that, in the end, he does not want to.\n\"Jiang Cheng.\" Wei Wuxian is smiling. There is fondness in his eyes, in his voice. Everything that he does speaks of love. He says, \"Come here.\"\nJiang Cheng knows, then: Wei Wuxian wants to hold him.\nAnd how is Jiang Cheng supposed to resist? How is he supposed to pull away when his brother wants him close? When the hands clasping his are ones that belong to the two people who matter most in the world? \nHe goes. He can do no less.\nWei Wuxian is warm. Jin Ling doesn't let go. He leans into him instead, and Jiang Cheng doesn't want to admit what it means to him, that they care so deeply.\nHe closes his eyes, feels his body lean blindly towards them in return. \nWei Wuxian accepts his weight, welcomes it. \"I really think,\" he says, almost a confession, \"that you were meant to be loved.\"\nJiang Cheng is helpless. His jaw trembles, and he clenches his teeth to stop it. Wei Wuxian's palms press into his shoulders, anchoring him. \"Ah, Jiang Cheng, Jiang Cheng, what's wrong? You're shaking.\"\nJin Ling squeezes his hand. \"Jiujiu?\" He says, quiet.\nHe lowers his head. \"I'm fine,\" he rasps. \"I'm alright.\" \n\"Jiang Cheng,\" Wei Wuxian says, faintly scolding, \"are you breaking your promise so quickly? I thought you were going to trust us.\"\n\"I do trust you,\" he says, sharp as the bursting sweetness overwhelming his senses. \"You complete moron. I'm not suffering. It's not that. I'm not... I'm not suffering.\"\nWei Wuxian is quiet for a moment.\nThen, \"Jiang Cheng. Are you crying?\" he asks, his voice coming out hushed. \"Are you crying because you love us so much?\"\nJiang Cheng squeezes his eyes shut against the mortifying, telling sting behind his eyelids. \"No.\"\nWei Wuxian's arms tighten around him. \"You,\" he says, his voice aching with emotion, \"are so very wonderful. Jin Ling, isn't he wonderful? You are very, very wonderful, Jiang Cheng.\"\nTheir nephew mumbles an embarrassed affirmation. Jiang Cheng knows that if he looked, he'd see a bright red flush suffusing Jin Ling's face. \nAnd yet, his hand is kept in that clinging, almost shy clasp. An idea is forming that he won't be released until he forcibly frees himself.\nI may never be cold again, he thinks, and then leans over his brother's shoulder to pour out enough flower petals to bathe in.\n \n "
}