{
    "id": "23497486",
    "url": "https://archiveofourown.org/works/23497486?view_full_work=true",
    "author": [
        "inexplicifics"
    ],
    "title": "Only Love Proudly and Gladly and Well",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Wiedźmin | The Witcher - All Media Types"
    ],
    "relationships": [
        "Geralt z Rivii | Geralt of Rivia/Jaskier | Dandelion",
        "Eskel & Geralt z Rivii | Geralt of Rivia",
        "Eskel & Jaskier | Dandelion",
        "Cirilla Fiona Elen Riannon & Jaskier | Dandelion",
        "Jaskier | Dandelion & Yennefer z Vengerbergu | Yennefer of Vengerberg",
        "Jaskier | Dandelion & Triss Merigold",
        "Jaskier | Dandelion & Lambert",
        "Cirilla Fiona Elen Riannon & Geralt z Rivii | Geralt of Rivia",
        "Jaskier | Dandelion & Original Female Character(s)",
        "Lambert (The Witcher)/Milena de Roggeven (Accidental Warlord Series - inexplicifics)"
    ],
    "characters": [
        "Jaskier | Dandelion",
        "Geralt z Rivii | Geralt of Rivia",
        "Eskel (The Witcher)",
        "Lambert (The Witcher)",
        "Vesemir (The Witcher)",
        "Yennefer z Vengerbergu | Yennefer of Vengerberg",
        "Cirilla Fiona Elen Riannon",
        "Triss Merigold",
        "Original Female Character(s)",
        "assorted Witchers",
        "Milena de Roggeven (Accidental Warlord Series - inexplicifics)"
    ],
    "additional_tags": [
        "Fluff and Smut",
        "Canon-Typical Violence",
        "Courtship",
        "Found Family",
        "Timeline What Timeline",
        "Alternate Universe",
        "Endearments",
        "Explicit Consent",
        "Singing",
        "Lust Potion/Spell",
        "Kaer Morhen's Fanon Hot Springs (The Witcher)"
    ],
    "language": "English",
    "series": "Part 3 of The Accidental Warlord and His PackPart 4 of The Accidental Warlord and His Pack - Recommended Reading Order",
    "published": "2020-04-05",
    "completed": "2020-04-11",
    "words": "31,101",
    "chapters": "7/7",
    "comments": "1,525",
    "kudos": "17,031",
    "bookmarks": "1,051",
    "hits": "282,292",
    "summary": "<p>Three months into his relationship with the White Wolf, Warlord of the North and terror of the continent, Jaskier goes back to Redania as part of the Warlord's negotiating team. They return with a treaty...but there are unexpected consequences to revealing his place at the White Wolf's side.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>Thank you all so, so much for the comments and kudos and amazing support! This is <i>definitely</i> not the end of the series.</p>",
    "text": "Jaskier never expected to be back in King Vizimir’s halls, not after the way he left them - not after having been dragged out, bound and gagged, to be thrown to the White Wolf like a bone to a hound.\nHe certainly isn’t coming back the same way.\nHe left bound in silk ropes, but he returns clad in elegant silk clothing, his fingers glittering with jewels, the lute in his hands elf-made and priceless, the silver wolf’s-head medallion about his throat gleaming. He left mute and weeping; he returns singing, the chorus of his Ode to Witchers light and merciless on his tongue. He left dragged between two human guards; he returns striding between two Witchers, Aubry on his left and Lambert on his right, and behind him through the portal come Geralt and Eskel and Yennefer, the White Wolf of the North and his right and left hands.\nJaskier left to the raucous relief of the entire court, all of them glad that he was the chosen sacrifice, not someone who mattered, and he returns to the dead silence of stark terror. They’re not afraid of him, he knows that, but frankly he doesn’t care. Seeing all those eyes fixed on him, all those faces that he knows so well twisted in fear and apprehension, is balm to the last few scars on his soul.\n“...They stand beneath the banner of the Wolf!” he finishes with a flourish, and bows to the assembled nobles of Redania with all the elegance he has. None of them seem to appreciate his efforts, though he catches Aubry’s low snort of amusement.\n“Ladies and gentlemen, King of remaining Redania, it is my honor and privilege to introduce the Warlord of the North, the White Wolf, ruler of Kovir, Caingorn, Kaedwen, half of Aedirn, and two-thirds of Redania, Geralt of the Wolf School!” Jaskier carols, and steps to the side with another flourishing bow. Geralt steps forward, and as Jaskier rises he can see the tiny quirk to Geralt’s lips, near-invisible from any distance, that says he’s amused by Jaskier’s antics.\nJaskier will give King Vizimir this much: he rises and greets Geralt without flinching, and welcomes him to the palace with a very good facade of courtesy. Jaskier can see the cracks, and he knows Geralt can smell how much King Vizimir hates and fears him, but it’s a decent act.\nThey’re here for the formal signing of the treaty that Jaskier wrote, the one that makes King Vizimir in fact, if not in name, a vassal of the White Wolf, bound to uphold the White Wolf’s laws and keep faith with him. It’s not much like the treaty the Count de Lettenhove brought to Kaer Morhen, because that treaty was a crock of shit, and Jaskier has taken immense pleasure in tearing it quite literally to shreds and letting Ciri use the scraps as practice for the fire-spells she’s learning from Yennefer. The new treaty is much more plainly written and has a lot fewer traps in it, which means it’s going to be a lot harder for the nobles of Redania to pretend they don’t know what it says.\nJaskier might, possibly, be enjoying knowing that his family is going to have to read his treaty and swear to abide by it a little more than he ought.\nHe and Aubry and Lambert end up at the far end of the high table from King Vizimir and Geralt and Eskel and Yennefer, which means Jaskier can’t eavesdrop on Geralt being imposing and Yen being elegantly nasty and Eskel being diplomatic - a shame, really, they make a great triple act. On the other hand, that does mean Jaskier’s nowhere near the Count and Countess de Lettenhove, so at least he won’t have to deal with that particular bit of nastiness just yet. Not that they’ll dare to do more than sneer or maybe attempt to say something unpleasant - he doesn’t think anyone in Redania is going to be stupid enough to actually lay hands on him.\nHe’s still flanked by the Witchers, too, so the first part of dinner is almost painfully silent, because none of the nobles seated around them quite dare to speak to either of the imposing, grim-faced Wolf warriors. Jaskier talks to the Witchers, of course, but Aubry doesn’t talk much at the best of times and Lambert is busy glaring at everyone, that being something he is good at and also something he was specifically tasked with doing by Geralt, who believes in playing to people’s strengths.\nJaskier is rather impressed, therefore, when as the third course comes around, the pretty noblewoman, dark-haired and dark-eyed and dainty, who had the bad fortune to end up facing Lambert quite clearly screws her courage up and leans forward and replies to Jaskier’s most recent bit of babble - about the food, as it happens - with a tentative, “What sort of meals do you get in - in Kaer Morhen?”\nJaskier beams at her. She’s younger than he is - she wasn’t one of the people who sent him off to be a sacrifice, and both Geralt and Eskel agreed that if Jaskier could get any of the younger generation of Redanian nobles to be even a little less hostile towards the Warlord of the North, it would be a fine use of his time and talents. “Fairly plain ones, my lady,” he says. “Witchers eat a lot, so the cooks make their dishes large rather than fancy.”\nAs Aubry and Lambert have both eaten at least half again what anyone else around them has, the noblewoman nods in understanding. “It sounds very...rustic?”\nJaskier wags a hand back and forth equivocally. “It’s not much like Tretogor, certainly. Louder, often. Fewer stupid plots, more brawls.”\n“We haven’t had a brawl in weeks,” Lambert objects.\n“You had a brawl two days ago,” Jaskier says, frowning at his companion.\n“Oh come on, that was barely a spat!” Lambert leans back in his chair, throwing an arm along the back of Jaskier’s chair and kicking his legs out under the table. The nobles across the table shuffle back a little in their seats in dismay. “It’s not a brawl until you get over two dozen fighters.”\n“I stand - or rather sit - corrected,” Jaskier says, and grins at the wide-eyed noblewoman. “More spats. And also brawls.”\n“Aren’t you scared?” she blurts, and claps a hand over her mouth in dismay.\nJaskier grins wider. “Oh, I was at first,” he says. “They all look so imposing, don’t they? Well, maybe not Lambert,” he adds, and Lambert growls and looks very imposing, actually, all lazy confidence and threat. Aubry snorts, very quietly, in amusement. “But not anymore.” Jaskier directs his grin up the table a bit, to a pair of noblemen he remembers being among the people who agreed that he should be sacrificed to the White Wolf’s lusts, and sees them both flinch. “I’m the White Wolf’s; no one at Kaer Morhen would raise a hand to me.”\n“Oh,” says the noblewoman, eyes wide, and then she leans over the table a little further and says, quiet and desperately curious, “What’s he like? The White Wolf? Is he really -” she breaks off and gestures mutely, an odd jerky motion like she doesn’t quite know what to say.\nJaskier considers all the possible responses to that, from diplomatic to filthy, and settles after a second on, “He is magnificent.”\n“Damn, buttercup, what does a man have to do to put that expression on your face?” Lambert murmurs, and Jaskier can feel his ears burning, but he gives Lambert an arch look.\n“Wouldn’t you like to know,” he returns in the same undertone, and Lambert chuckles.\nThe noblewoman appears to be turning the word magnificent over in her mouth like an unusual sweet. Several of the other people in earshot look as though they’ve just bitten lemons.\n“So you’ve thrown your lot in with the Wolf,” one of the noblemen sneers. “How...predictable.”\nJaskier hums. “That’s supposed to be an insult, isn’t it?” he asks, tapping a finger against his lips. “Let me see, are you trying to insult my intelligence, my loyalty, or my taste in men?”\nMore lemon-biting looks. Jaskier chuckles. “I mean, if it’s my intelligence, I’d have to point out that I am now the White Wolf’s court bard, which is a far better position than any of my contemporaries at Oxenfurt have managed to claim, and I’ve half a song cycle to my name already. If it’s my taste in men, then I’d have to wonder if you’ve gone blind - you have noticed he’s ungodly handsome, right? And if it’s my loyalty -” he drops the pretense of friendliness, and the expression he’s wearing isn’t a grin anymore, it’s the baring of teeth. “I’d have to point out that Redania threw me away.”\n“Their loss, our gain,” Lambert puts in almost idly.\n“You’d rather be court bard to a barbarian than a viscount of Redania?” the nobleman demands. It’s an article of faith for most Redanian nobility that being the lowest baron is far, far better than being even the wealthiest merchant or most famous bard or most triumphant general in the world.\nJaskier touches the medallion about his throat, the silver wolf’s head that marks him as Geralt’s. “Well, the company is better,” he says, keeping his voice light, and it takes a moment for the insult to really register. Once it does, the lemon-biting expressions come back in full force.\nThen the servants come around with the next course, and Jaskier subsides, letting the conversation die off again. The young noblewoman is eyeing him with deep confusion, but she stays silent until the meal is over and the dancing has started - King Vizimir and his queen leading off, with Geralt and Yennefer matching them. Jaskier and his bodyguards - since that’s what Aubry and Lambert are, whether any of the Redanians realize it or not - move to a bench near the dance floor, and the young noblewoman follows them, drifting nearer as if by accident. It’s quite a good act.\n“A dance, my lady?” Jaskier asks when the first dance is over and the rest of the court begins to filter out onto the floor. She nods, and Jaskier claps Lambert and Aubry on the shoulders and bows over her hand properly, and leads her out.\nOne of the nice things about court dances is they give the dancers time to talk privately - it’s part of what they’re for. Jaskier’s partner waits until the music has started before she murmurs, “You like them. The Witchers.”\n“Very much so,” Jaskier says.\n“But they’re -”\nJaskier shakes his head and twirls her. “Forget all the rumors,” he advises her. “Go back to the old stories, from before the fall of Ard Carraigh. And then disregard half of those.” He pauses for a moment to concentrate on a tricky bit of footwork. “Witchers want to protect people. That’s what they’re for.”\nHis partner frowns a little. “But -” she says, and breaks off, and they dance in silence for a bit. It’s near the end of the dance when she says, “Would you be willing to come and talk to my friends, later? We - well, we all came to court after you were - gone, and we’ve got so many questions, and no one wants to answer them!”\n“As long as your friends don’t mind my friends coming along,” Jaskier says, grinning. Oh, this is good - this is exactly what Geralt wanted.\nThe noblewoman darts a quick glance towards Lambert and Aubry. “Alright,” she says, nervous but determined. “I’ll find you after the minuet.”\n“Done,” Jaskier says, and bows over her hand again as the music ends. “A pleasure to share a dance with you, my lady.”\n“And with you, sir,” she says, and dips him a curtsey, and Jaskier hands her off to a hopeful-looking young nobleman and retreats back to the bench.\n“You heard that?” he checks as Aubry hands him a mug of weak ale.\n“Yep,” Aubry says. Witcher hearing, it’s a marvelous thing. “Look out, Yennefer,” he adds, and Jaskier drains the mug and hands it back and turns to bow to Yennefer, who is grinning broadly.\n“Dance with me, little flower,” she says, and Jaskier takes her hand and leads her out onto the floor with a laugh. Yen is a good dancer, and it’s a fast-paced dance; Jaskier enjoys himself immensely, showing off with fancy steps and extra twirls until Yen is laughing and half the court is staring.\nAnd then, as the dance ends, Geralt steps in to claim his partner.\nNot Yen, for the record.\nJaskier grins up into golden eyes as Geralt’s hand catches his, other hand settling warm on Jaskier’s waist. “You’re leading, then, my wolf?” he murmurs.\nGeralt hums in answer, and swings Jaskier into the dance as the music starts. Jaskier taught him this dance - taught all four of the Witchers how to dance, in fact, when the list of people coming to this treaty-signing had been agreed upon, though Lambert and Aubry don’t plan to actually join the ball. Witchers learn any physical skill very fast, and Geralt dances as well as if he’d spent years with a dancing master. Any Redanian nobles watching for signs of barbarian uncouthness will not find it in their dancing.\n“Magnificent, am I?” he murmurs after a few moments.\n“Oh yes,” Jaskier confirms. “Weren’t you supposed to be paying attention to your end of the table?”\nGeralt shrugs a little. “Eskel had it,” he says. “And Yen was having fun scaring everyone.”\nJaskier laughs. Yen loves scaring the shit out of people who really deserve it. “And you just had to sit there and glower, hm?”\nGeralt nods. “One of my finest skills,” he confirms, a tiny quirk at the corner of his lips the only sign that he’s teasing, and Jaskier laughs so hard he misses a step. Geralt doesn’t let him fall, taking his whole weight without any sign of trouble.\nJaskier knows half the room must be staring at them. Men don’t usually dance together, in Redania, so that’s unusual enough, but the fact that he’s laughing in the White Wolf’s arms will cause severe confusion. With a little luck, it’ll give the Count de Lettenhove conniptions. It’s one thing to see your disowned son claimed as the White Wolf’s, another to see him fearless and joyful and thriving. May he choke on it.\nGeralt bows over Jaskier’s hand as he would a lady’s when the dance ends, and Jaskier sweeps an elegant bow in return and turns to see if anyone else would like to dance. There is a little group of noblewomen...most of whom are eyeing Geralt as a dog does a juicy steak. Oops. Jaskier murmurs, quiet enough to be heard only by Witcher ears, “Husband-hunters, my wolf.”\n“Hm,” says Geralt, flat and irritated, but they knew this was coming. Well, Jaskier knew, and he warned Geralt and Eskel, but neither of them really believed him that there would be women willing to pursue the White Wolf, Warlord of the North, terror of the continent.\nThat’ll teach them to doubt his warnings. Jaskier bows to the nearest hopeful-looking noblewoman, who can’t politely turn him down, and leads her into a perfectly correct, utterly unremarkable dance, not bothering to add any flourishes when his partner is watching Geralt over his shoulder anytime the dance allows it. Geralt, poor man, managed to pick one of the old dowagers as his next partner; she’s not interested in another husband, but from Geralt’s expression, she’s probably extolling the virtues of daughters or nieces for the entire length of the dance.\nThis is what you get for being the continent’s most eligible bachelor. Well. Geralt doesn’t officially have a consort, but as far as Jaskier can tell, he hasn’t taken anyone to his bed except Jaskier himself for the last several months, at least - and given that Jaskier spends just about every night in said bed, he’d know about it. Neither of them has actually said anything about what their relationship might be, of course, Jaskier because he’s terrified of the answer, Geralt...for his own reasons, presumably.\nHe does call Jaskier his little lark, though, and treats him with endless affection, in public and private alike, so Jaskier’s not really repining. They’ll figure it out eventually. Jaskier is content to be court bard and advisor, tutor to the princess and lark to the Warlord; he’s in no hurry to add any titles to that collection.\nHe partners three more noblewomen for three more dances before the minuet begins and he finds himself tugged into Eskel’s arms. “Please for the love of fuck,” Eskel mutters, “I need to dance with someone who won’t flirt.”\n“Darling,” Jaskier says, beaming, “I am insulted! Me, not flirt?”\nEskel sighs. He’s as good a dancer as Geralt is, and his lead is easy to follow. “Flirt badly,” he amends. “And not a one of them means it. Most of them can’t even look at my damned face.”\n“Well fuck them,” Jaskier says, and sets himself to making sure this dance is as fancy and full of flourishes as he can contrive. If the noblewomen of Redania are too stupid to see that Eskel is a damned catch - not that he wants to be caught, but still - then Jaskier will rub their noses in their stupidity, see if he doesn’t.\n“Vicious little thing, aren’t you,” Eskel says, chuckling, as Jaskier twirls back into his arms halfway through the dance.\n“You know it,” Jaskier says.\n“No wonder our Wolf adores you,” Eskel says, shaking his head a little in amusement. The words send a sort of warm shock through Jaskier: he’s always a little surprised and a lot pleased when one of the Witchers suggests that they approve of his relationship with Geralt, but it’s quite clear that they do. Even grumpy old Vesemir has given him a nod and a clap on the shoulder and a gruff word of encouragement.\n“I am adorable,” he says, covering pleasure with bragging. Eskel laughs, thoroughly cheered up, and Jaskier’s grin broadens in triumph. Eskel is a sweetheart, and Jaskier doesn’t like him to be unhappy.\n“That you are,” Eskel agrees. “And just as much a menace as the cub, too.”\n“I am flattered that you think I could reach such heights of mischief,” Jaskier informs him. “Truly, I am but an apprentice before her mastery.”\nEskel laughs louder, and they finish the dance in matching high spirits.\nThe pretty young noblewoman is waiting near Lambert and Aubry, eyeing Lambert with understandable wariness. Aubry, for all that he’s broad-shouldered and scarred and hulking as any Witcher, is so quiet that he tends to blend into the background a bit; Lambert has never mastered the art of being unobtrusive. It doesn’t help that he’s playing with a dagger, rolling it across the back of his hand and doing little tricks with it, pretending to do so absent-mindedly. Jaskier snorts. Lambert knows exactly what he’s doing, and is enjoying scaring people. He’s such an asshole, and Jaskier is so absurdly fond of him.\n“Hey, buttercup,” Lambert says as Jaskier reaches them. “We off on an adventure, then?”\nJaskier sighs and punches Lambert on the shoulder - the Witcher doesn’t even flinch, naturally - and bows to the noblewoman. “Lead on, my lady,” he says. “And - forgive me - we have not yet been introduced, and I would know the name of the beautiful lady who gave me the honor of so lovely a dance!”\n“Milena de Roggeven,” she says, curtseying a little. Jaskier carefully doesn’t let his expression change: this is a duke’s daughter. He was not expecting that. A younger daughter, surely, to have been so far down the high table, but still - if he can win her over even a little, that’s quite a foothold for Geralt in the Redanian court.\nShe leads Jaskier and his Witcher guards away from the ballroom and into the gardens, which are well-lit and full of people promenading to see and be seen. Most of them give Jaskier extremely dubious looks as their little party goes by. Their destination is a large gazebo some way off the usual paths, where seven nervous-looking young nobles are clustered, goblets in hand, trying to look like they’re just idly passing the time instead of waiting. Subterfuge is not their strong suit. Jaskier was sneakier than this when he was twelve.\nThey all draw back a little when Milena and Jaskier and Lambert and Aubry step into the gazebo. They’re not scared of Jaskier - no, they’re all looking at Lambert and Aubry warily. Aubry sits down on a bench near the entrance and leans back against the railing and closes his eyes; Jaskier knows he’s probably listening for anyone’s approach, but he looks relaxed and harmless. Lambert, however, drapes an arm over Jaskier’s shoulders and grins at everyone, showing all his teeth. Jaskier sighs at him.\n“I can’t bow like this, you ass,” he grumbles.\nLambert just laughs. Jaskier sighs again and shakes his head before inclining it politely to the little cluster of young nobles. “Well, I would bow, but as you can see, I’ve been prevented,” he says wryly. “My lady de Roggeven, would you be so kind as to introduce me to your charming compatriots?”\nMilena nods and does so, and Jaskier files names and faces away carefully: the noblewomen are Hanna and Natalia and Oliwia, and the men are Piotr and Dawid and Karol and Aleksander. None of them is older than eighteen, by his best guess - Oliwia can’t be more than sixteen. He didn’t know any of them before he was sent to Kaer Morhen, but then, he was at Oxenfurt for a fair bit of his youth. He does know some of their parents. Some of their parents were among the nobles who chose Jaskier to be a sacrifice.\n“So,” Jaskier says, leaning against Lambert - as long as the Witcher is going to be annoying, Jaskier can be annoying right back. “I understand from my lady Milena that you have questions.”\nAll of them nod, but there’s a brief silence before Dawid blurts, “Father said - you were - what really happened? All we ever heard was that there was an - an attempt to placate the Warlord, and it hadn’t worked, and you were...involved somehow, and now the Warlord’s here and there’s supposed to be a treaty and it’s maybe because of you?”\nJaskier’s lips twist. “Oh, is that the story that was put about?” he asks, keeping his voice light with an effort. “Fascinating. ‘Involved.’ What a charming way to put it.”\nLambert makes a soft sound of concern. He actually saw Jaskier brought into Kaer Morhen, bound and dazed with fear, as even Aubry didn’t. Jaskier pats the hand draped over his shoulder absently. “Do you really want to know what happened?” he asks the young nobles. “I warn you, it’s no pretty bard’s tale, and some of you won’t like what you learn of your fathers.”\n“Tell us,” Milena says. “It’s all - whispers, and rumors, and no one will say anything outright. We need to know.”\n“Alright,” Jaskier says, and nudges Lambert back until they can sit down beside Aubry. The quiet Witcher puts a hand on Jaskier’s back, gentle and warm and supportive. “Sit, sit, no point standing about, hm?” The nobles choose benches of their own. “So, this was a year and a half ago, yes? There were all those rumors that the White Wolf was planning to take the rest of Redania; I never did learn who started them, because to the best of my knowledge, he wasn’t. Still isn’t, that I know of, unless King Vizimir does something truly idiotic. Anyhow. Someone - I think it might have been the Duke de Rinde - suggested that Redania should send the White Wolf tribute, to prove that Redania wasn’t a threat. King Vizimir agreed.”\n“That makes a certain amount of sense,” Piotr ventures.\n“Oh, certainly, sending tribute to stronger kings to placate them has a long and illustrious history,” Jaskier agrees easily, giving the younger man an approving smile. “Unfortunately, that was also about a month after a really...remarkably nasty rumor about the White Wolf started gaining a lot of attention.” He hesitates - Oliwia is very young - but nobles learn about this sort of nastiness young; they have to. “The rumor said the White Wolf liked to take young people to his bed,” he says, choosing his words very carefully, “and most of them didn’t make it back out alive.”\nMilena puts a hand over her mouth, eyes wide. Hanna and Natalia clutch at each other’s hands. Oliwia squeaks and shrinks back against Dawid. The men all swear, quietly, and not very well. Jaskier could swear a lot better than that, a lot younger - but then, one learns such a lot at Oxenfurt.\nLambert says, “They fucking what?”\nAh. Jaskier had assumed Lambert knew what he’d been sent for. Oops? Lambert is staring back towards the ballroom, eyes narrowed and a fierce look on his face, like he’s planning on storming back in and doing something violent and unfortunate to someone. Jaskier puts a hand on his knee to hold him in place.\nAubry is growling, very softly, more a vibration than a sound. Jaskier puts his other hand on Aubry’s knee. This was not in the plan: they’re supposed to be guarding him from Redania, not him guarding Redania from them.\n“Anyway,” Jaskier says, “because of that rumor, someone - I genuinely don’t know who - said that King Vizimir should send a…” he pauses and tries to choose a word that won’t set the Witchers off. “A person,” he decides.\n“A fucking sacrifice,” Lambert snarls. “They thought the White Wolf would -” he gets up abruptly and starts to pace, thankfully not anywhere near the young nobles - Jaskier rather thinks they might run if an angry Witcher gets too close. Which is a good survival instinct, to be fair.\n“How did they choose you?” Natalia whispers. “Or - did you volunteer?”\nJaskier grimaces. “No,” he says. “I didn’t volunteer. I was as scared as you can imagine, just like everyone else.” He takes a deep breath. “I. Count de Lettenhove. Decided he could spare a son.”\n“Your fucking father?” Lambert says, rounding to stare at Jaskier. “That smarmy asshole who tried to get that piece of shit treaty past us? Him? He sent you off to be -” he breaks off, snarling under his breath, and paces faster. Aubry’s hand on Jaskier’s back has taken a firm grip on his doublet, as though Aubry is worried that he’ll need to carry Jaskier off to safety at any moment.\n“Do remember that we’re supposed to be diplomatic,” Jaskier says to Lambert. “That means not gutting anyone, in case you didn’t know that.”\nLambert gives him quite a good glare. “I won’t be gutting anyone,” he says. “But I will lay every coin I’ve ever earned that you never told Geralt this. Nor Eskel, neither. Not in so many words.”\nJaskier winces. That’s quite true, actually. He’s never felt it necessary to do so. He wouldn’t be saying it now, but he wants these young nobles to be on Geralt’s side, and the easiest way to do that is to point out exactly how much difference there is between what rumor said was going to happen to Jaskier, and what actually happened.\n“So no, I won’t be gutting anyone,” Lambert finishes. “But they might.”\n“I have great faith in Eskel’s ability to remain diplomatic,” Jaskier says.\nLambert snorts. “I notice you didn’t say anything about Geralt’s,” he points out. “Buttercup, this is the sort of thing we need to know before we step into enemy territory.”\n“It’s fine,” Jaskier says. “It was a year and a half ago, I am notably still alive and also very happy with my current position in life, and the point is that although I got sent off as - yes, alright, a sacrifice -” he turns back to the young nobles and spreads his free hand, the one not still holding Aubry’s knee - “the White Wolf, it turns out, is far nobler in soul than any noble of Redania is in blood.”\n“He is?” Oliwia asks, eyes enormous. Milena is watching Jaskier and Lambert with something like speculation in her eyes.\nJaskier nods to Oliwia. “When I was brought before him, I was asked what skills I had, and when he heard I was educated at Oxenfurt, and had the training to be a bard, he commanded that I should be given all the tools of my trade. And that night, before all his people, he proclaimed that I was under his protection; and so I have been since that day.”\nMilena ventures, “And he - he didn’t -”\n“He did not take me to his bed,” Jaskier says, and then grins. “Not until about three months ago, when I asked him to. And I assure you, he never takes anyone to his bed but those who want to be there. Nor do his bedmates take any harm of his attentions.”\n“You asked him to?” Hanna says incredulously.\n“Have you seen him?” Jaskier says, and fans himself ostentatiously with his free hand. Natalia giggles. “Darlings, even when I thought he was terrifying, I could tell he was the handsomest man I’d ever seen, and once it turned out he’s...well, magnificent in every possible way,” he shrugs, spreading his hand wide. “How could I not?”\nAll of the young nobles are looking scandalized, but Oliwia sighs a little like she finds the whole tale rather romantic, which is exactly the note Jaskier wanted to hit.\n“But,” says Milena, bringing them back to the point with a frown, “none of our parents knew that. They all thought they were sending you off to be -” she hesitates, trying to choose a word.\n“Sacrificed,” Lambert says bitterly. “To the White Wolf’s monstrous and insatiable lusts.”\n“That was downright eloquent,” Jaskier says, rather impressed.\n“I do listen to your songs,” Lambert says.\n“I am very flattered,” Jaskier tells him, and turns back to Milena. “In any case, yes. Your parents - the whole court - were quite sure they were sending me to my death. I believe they’re feeling rather...embarrassed about it now. Especially as I have done so well by the fate which they thought would be my end.”\n“But how could they?” Oliwia asks plaintively. “How could they - how could your father - it’s not right, that they did that!”\n“No, it’s not right,” Jaskier tells her gently. “I have prospered by it, but that is no virtue of their sending me. It is that the White Wolf is - among his many other qualities - a good man, and a good king. King Vizimir sent me into the jaws of the wolf; the Wolf himself has protected me. Which do you think more virtuous?”\n“But why?” Oliwia asks, looking on the verge of tears. “Why would they do that?”\nJaskier sighs. “People do dreadful things when they’re scared.”\nJaskier stays and talks with the young nobles until the ball starts to break up, telling stories of the White Wolf’s general magnificence and answering their questions, and then Lambert and Aubry herd him back into the palace and one of the servants shows them to the suite of rooms that has been set aside for the Warlord’s party. Geralt and Eskel and Yennefer are already there, Yen draped over a chaise longue looking cheerful and elegant, Geralt and Eskel sitting on the hearth whetting their swords. Lambert deposits Jaskier in an armchair and says, “So, o White Wolf, do you know what these fuckers thought was going to happen to your bard when he got to Kaer Morhen?”\n“Lambert,” Jaskier hisses. “You don’t need to -”\n“Oh, but I do,” Lambert says, and Aubry nods.\n“They need to know,” he says, and Jaskier sags back in the chair and sighs, tilting his head back and closing his eyes.\n“What did they think?” Geralt asks, his voice very level, the way it is when he’s deliberately suppressing all emotion.\nLambert starts pacing again, growling between his teeth. “They sent him to you to be fucking raped to death, Geralt. That’s what they thought you’d do.”\n“Ah,” says Eskel, and Jaskier hears the soft clink of a sword being set down on stone. “That would explain how scared you were, wouldn’t it, Jaskier.”\n“It was more than a year ago,” Jaskier says to the darkness behind his eyes, fairly sure whatever he says won’t make a difference at this point. He doesn’t dare open his eyes and see whatever expression Geralt might be wearing. “And I might point out that Geralt didn’t do me any harm. Then or ever.”\n“Little flower,” Yen says, almost gently. “We still needed to know this, because it makes a difference whether we’re negotiating with a king who sent you off as a rather badly-thought-out attempt to bribe the Wolf with a pretty young bard to grace his bed and his feasting hall, or as a frankly insulting offer of a ready-made victim.”\n“Oh,” Jaskier says. He hadn’t quite thought of it like that.\n“Little lark,” Geralt rasps, and Jaskier opens his eyes to see that Geralt is kneeling in front of his armchair, sword set aside, hands hovering over Jaskier’s knees like he’s almost afraid to touch. “Little lark, I -” He breaks off, and there’s genuine pain in those golden eyes. “Did - do you want -”\nJaskier gapes for a moment before he realizes what Geralt is asking, and then he slides out of the chair and into Geralt’s arms, winding his own arms around Geralt’s shoulders and hanging on as hard as he can. “You have never forced me,” he says against Geralt’s throat. “I want to be in your bed, I - I -”\nThis was not quite how he anticipated making this confession. The audience, at least, is a little more attentive than he might have wanted, and Jaskier’s pretty sure Lambert is going to give him all the shit for this. But Geralt is hurting, so Jaskier says, praying Geralt can sense the truth of it, “I love you, Geralt. I haven’t been scared of you in more than a year, and I fell in love with you - a fair while before I kissed you, alright? I chose. I still choose.”\nGeralt’s iron-stiff muscles relax, and his arms wrap around Jaskier in a careful embrace. “You’re sure?”\nJaskier pulls back enough that he can lean their foreheads together and look Geralt square in his golden eyes. “My wolf,” he says, soft enough that maybe even the other Witchers won’t hear. “My wolf, and I am your lark.” He manages a tiny smile. “Can’t you smell love, Geralt?”\nGeralt draws in a long, slow breath, and then, glacially slowly, he smiles - just a tiny upturn of his lips, but it’s there. “Like honey on fresh bread,” he says softly. “Sweet and warm.”\n“There, see,” Jaskier says, almost limp with relief. “That’s me. That’s how I feel about you.”\nGeralt nods a little, and brushes a tiny kiss against Jaskier’s lips, then rises, bringing Jaskier up with him, and sits down in the armchair, pulling Jaskier down into his lap. Jaskier squirms a bit to get comfortable and ends up sort of draped sideways over his Witcher, head resting on Geralt’s shoulder, legs hanging over the arm of the chair, Geralt’s arm warm around his waist to hold him steady.\n“Awww,” says Yen, grinning at them. “Little flower, I know you’re a bard, but you don’t always have to pick the most dramatic possible way of doing something.”\n“Oh, you’re one to talk,” Jaskier grumbles without any heat in the words. Yen laughs.\n“Fair,” she says. “Lambert, stop glowering, you’re as bad as Geralt sometimes. Eskel, stop looking like you want to gut someone. I think we can all agree Jaskier has dibs on that. Or maybe Geralt does, I’m not sure. Now: how does this change our negotiation strategy?”\nEskel frowns and settles back, picking his sword back up and going back to whetting it. “Not much, actually,” he says at last. “It’s an insult to the Wolf, but we already knew they thought Witchers were monsters. We were already planning to shove the treaty down King Vizimir’s throat whether he likes it or not. Which he won’t. This...mostly just gives us a tool to undermine him, if we want to, and to keep a fair number of the great nobles from daring to defy us. Especially if Jaskier’s conversation tonight bears any fruit, and the younger nobles start talking about the...lack of honor inherent in sending a lad off to be killed.”\n“Think it worked pretty well,” Aubry says. “They were proper horrified, but they believed him.”\n“Oh good,” Jaskier says.\n“I vote we write something into the treaty saying the fucking Count de Lettenhove never sets foot in the White Wolf’s lands again,” Lambert says.\n“Yes,” Geralt says before Jaskier can respond. “Yen, warn Vizimir to send him away before tomorrow. If I see him again, he dies.”\n“Um,” Jaskier says. That’s...vicious but sort of sweet. “That’s not terribly diplomatic.”\n“Don’t care,” Eskel says. “Sending you to be the White Wolf’s plaything was bad enough. If he thought he was sending you to die - no. If I ever see him again, he dies.”\n“Or me,” Lambert growls.\n“Or me,” Aubry agrees.\n“I’d probably just curse him into some sort of horrible misshapen monstrosity, to match his soul,” Yen says, rising elegantly from her couch. “I’ll just go talk to King Vizimir, shall I?” She pats Jaskier’s shoulder as she passes. “Don’t worry, little flower; I won’t do anything before I issue a warning. Mind, if I happen to run across him afterward…”\nAubry falls in beside her as she leaves the suite. Jaskier sighs and closes his eyes, nestling a little closer to Geralt. “I didn’t think it was that big a deal,” he says. “You knew they sent me as tribute.”\n“There’s tribute and there’s tribute, little lark,” Geralt rumbles.\n“A king might send a bedwarmer to another king, in mutual respect,” Eskel puts in. “Sending a sacrifice isn’t respect - it’s an insult.”\n“What if it had been Oliwia, buttercup?” Lambert asks. Jaskier goes still. Little Oliwia, barely sixteen and still as naive as any noble child gets - if she had been sent as a sacrifice, that would have been -\n“Monstrous,” he says, through a dry throat. “That would be monstrous, and a grave insult to the Wolf, that anyone would think he would do harm to such an innocent - that he would be that sort of monster.”\n“Exactly,” Geralt rumbles, and brushes a kiss against the top of Jaskier’s head. “Sending you was monstrous - though I am grateful to have you.”\n“Huh,” Jaskier says, and thinks about that for a while. “All’s well that ends well?”\n“It ends when Vizimir signs the treaty and we can go back to Kaer Morhen and never see any of these conniving, monstrous bastards again,” Eskel says firmly.\nJaskier thinks of something abruptly, and sits up, eyes shooting open. “Monstrous or not, please don’t -”\n“They may be monsters, but we won’t start hunting until we have to,” Lambert says, grinning with all his teeth. “Mind you, if they ever do something like this again...” He trails off and draws a dagger from his belt, tossing it idly into the air and catching it again neatly before throwing it with impeccable accuracy to imbed itself in the painting of King Vizimir which hangs above the fireplace. “Then I guess Geralt gets to be warlord of all Redania.”\n“Ugh,” Geralt says, and tugs Jaskier back to curl against him. “We try diplomacy first.”\n“White Wolf,” Lambert and Eskel chorus, and Jaskier sighs in relief. He hadn’t thought -\nWell, he hadn’t thought. He’s put as much of that dreadful episode out of his head as he can, frankly, because the difference between the Julian who rode into the White Wolf’s den, bound and terrified, and Jaskier now, bard and tutor and advisor, lover and (he dares to hope) beloved, is like night and day.\n“Any more nasty little skeletons in the closet we need to know about?” Lambert asks.\nJaskier shakes his head. “None I can think of.”\n“Well thank the gods for that.” Lambert finally sits down on a sofa near the fire and sprawls out. “I need a fucking drink.”\n“No getting drunk in Redania,” Eskel says.\n“Fuck,” Lambert sighs.\n*\nYen comes back about a quarter of an hour later, looking viciously pleased with herself; Aubry, behind her, also looks pleased, if quieter about it. “Well, I’ve put the fear of the Wolf into King Vizimir and the Count de Lettenhove,” Yen says, draping herself back over the chaise longue and grinning. “If that cowardly fuck isn’t halfway back to Lettenhove by dawn, I’ll eat my favorite shoes without salt. How a man like that sired you, little flower, I’ll never know.”\n“Thank you for the compliment, I think,” Jaskier says, woken from drowsing on Geralt’s shoulder. “Did you curse him?”\n“No,” Yen says. “Thought about it, though. I think he’d make a good slug.”\nJaskier can’t help feeling sort of warm all over at the noises of firm agreement from all the Witchers. He’s never felt quite so - well, familial. This is what family is supposed to be, right? People who defend you even when you don’t think you need it, against anyone and for any reason?\n\nThe White Wolf leads a mighty pack, aye a mighty pack he leads / bold and fierce and terrible are the wolves who run behind him / At his right hand runs a wolf as like him as a shadow / at his left hand runs a witch with violet eyes like flames / at his shoulder runs a wolf as wise as any druid / and there above his head there flies a lark to sing his praise.\n\nHm. There’s definitely something there; he’ll have to work on it.\n“You’re composing again, little lark,” Geralt says, sounding fond and amused. “Bed; it’s late. Tomorrow we make Vizimir choke on that treaty.”\n“Why are you most verbose when you’re threatening horrid vengeance?” Jaskier complains as Geralt stands, Jaskier cradled in his arms. Geralt chuckles and nuzzles Jaskier’s hair without answering.\n“Goodnight, I guess,” Jaskier calls over Geralt’s shoulder as Geralt carries him into one of the bedrooms of the suite. Yen waves languidly at him, grinning. Lambert snorts amusement. Eskel shakes his head.\n“Goodnight, Jaskier.”\n*\nJaskier wakes up wrapped up in Geralt’s arms, one heavy leg thrown over both of his, like Geralt is worried he’ll vanish in the middle of the night. It’s not quite dawn; there’s a bird singing outside the shuttered window, chirping its little heart out.\nGeralt’s breath is warm against Jaskier’s throat, its slow rhythm soothing and familiar after three months of sharing a bed. He’ll be awake soon, Jaskier knows; Geralt rarely sleeps past dawn. For now, though, Jaskier can look his fill: Geralt looks much younger in his sleep, all the worry smoothed out of his brow, the beautiful sweep of his eyelashes against his cheekbones like a song too lovely for a human throat to sing. His hair is a little disheveled, like moonlight tangled on the pillow, and the scar across his eye is that perfect note of imperfection that saves him from being too handsome to be real.\n“Little lark,” Geralt says softly, without opening his eyes. “Awake already?”\n“Only if you’re sure you’re not a dream come true,” Jaskier says, lifting one hand to brush a strand of pale hair away from Geralt’s face. “My wolf.”\nGeralt opens his eyes slowly, and Jaskier stares into molten gold like sunrise, and loses his heart all over again. “Your wolf,” Geralt says, and leans in for a kiss, so slow and gentle Jaskier feels like he’s melting into it, becoming as sweet and liquid as honey.\n“I do love you,” Jaskier says as their lips part again, some uncounted minutes later. “I - maybe would have picked a better time to say it, but -”\nGeralt smiles. “Honey and fresh bread,” he says. “I should’ve figured it out sooner, my little lark.” He pauses, and his brow furrows a little. “You can’t smell,” he says, almost to himself.\n“I mean, I have a decent sense of smell for a human,” Jaskier says.\n“Hm,” Geralt says. “I love you.”\nJaskier gapes. He doesn’t know what he was expecting, but - that - just like that? So easily? He hadn’t thought Geralt would just - say it.\n“I think you like rendering me speechless,” he grumbles at last. Geralt chuckles and kisses him, and Jaskier decides that grumbling is much less important than being kissed breathless. He doesn’t know who taught Geralt to kiss, but if he ever meets them - assuming they’re still alive - he owes them thanks, and maybe a ballad or two, because ye gods the man can kiss. It’s a little like being swept away by a particularly amorous ocean wave, overwhelming and disorienting and glorious.\nHe’s not sure how long they might have lain there, kissing languidly, if someone hadn’t knocked heavily on the bedroom door. “Get your damn trousers on, Wolf,” Lambert calls. “Faster we get this fucking treaty signed, faster we can get out of this fucking cesspit of a city.”\nJaskier sighs. “He’s right,” he points out. “If rather rude about it.”\n“Is Lambert ever polite?” Geralt asks, smirking, and kisses Jaskier again, sweet and brief, before rolling away to find his clothing. Jaskier sighs and follows the White Wolf out of bed.\n*\nKing Vizimir is, indeed, not happy with the proposed text of the treaty between what’s left of Redania and the White Wolf’s holdings. He hems and haws and objects to every line, and Geralt, across the table, crosses his arms and looks at King Vizimir, golden eyes like fierce sunlight, and says, “That’s my offer. Take it or leave it,” and smiles like a wolf, all teeth and no humor.\n“Honestly I’d prefer you didn’t take it,” Yennefer says, leaning on Geralt’s left shoulder and inspecting her nails ostentatiously. “I haven’t gotten to turn anyone into a slug in years. I need the practice.”\n“Leave some for me,” Eskel says from his place behind Geralt’s right shoulder, and grins just as wolfishly as his leader. “This treaty’s a lot fairer than what that piece of shit brought to us. Fewer nasty little traps.” He cocks his head. “Wolves don’t like tricks, you know. Makes us downright testy.”\nLambert contributes a low, reverberating snarl. Aubry doesn’t bother to make a sound: he’s glowering as well as the White Wolf at his worst, and when he wants to be, it turns out he can be remarkably imposing.\nAs the only ordinary human in the little group, Jaskier should feel outnumbered and probably terrified, but honestly he’s just impressed. It helps that he’s draped across Geralt’s lap again, lounging at his ease in the arms of the White Wolf, grinning at the flabbergasted counselors on King Vizimir’s side of the table. See? he thinks, twiddling his fingers at them and smirking at their expressions. You sent me as a sacrifice, and instead, here I am again, alive and thriving. He doesn’t know what they think his position in the White Wolf’s court is, and frankly he doesn’t care, as long as they realize that their understanding of the White Wolf - their assumption that the White Wolf, too, would see nothing of worth in Jaskier save an expendable fucktoy - was utterly and contemptibly wrong.\nAnd every word of that treaty is Jaskier’s work, so Jaskier plans to count King Vizimir’s signature on it as Jaskier’s own final revenge. If King Vizimir had kept him, he might not be facing quite as blunt and unbreakable a treaty - might even have gotten the White Wolf to sign the first draft. But no! Here they are, and King Vizimir and all his counselors know that even though the White Wolf and his companions are outnumbered and surrounded, here in the heart of remaining Redania, it is King Vizimir who is quite thoroughly over a barrel. He can sign...or he can lose the rest of Redania, and probably his own head to boot.\nHe signs.\nJaskier takes the treaty when King Vizimir pushes it furiously across the table, examines the signature, blows on the ink to dry it, and rolls it up neatly, all without ever budging from his place in Geralt’s lap. “Looks good,” he says, grinning broad and cruel at the Redanian nobles across the table.\nGeralt nods and stands, letting Jaskier’s feet fall to the floor so he can stand tucked under Geralt’s right arm, sandwiched between Geralt and Eskel. “Then we’ll be on our way,” Geralt says, nodding to King Vizimir curtly. “Keep the treaty, and we won’t come back.” With an army, he doesn’t bother to say, but Jaskier’s pretty sure everyone in the room heard it anyhow.\n“Redania keeps its word,” King Vizimir grits out.\n“Good,” Geralt says, and turns his back on the king, leading the way out of the grand meeting room. As soon as they’re in the corridor, Yen opens a portal to Kaer Morhen. None of them want to spend another moment in this viper’s nest of a palace.\nHm, Jaskier will have to come up with another metaphor; the Viper Witchers are actually quite nice people for the most part. Slugpit, maybe. Cesspit. Dump.\n*\nCiri is overjoyed to have her father - and her Aunt Yen and three uncles and Jaskier - back so soon, and displays this by pouncing on her father as soon as he steps into the great hall. Jaskier steps hastily to the side as Geralt rolls her off his shoulder and follows her down for a very gentle wrestling match, all flailing limbs and white hair and Ciri’s bright laughter.\n“I see the cub found you,” Vesemir observes dryly, coming up to join them.\n“That she did,” Jaskier says, grinning as she ends up sitting on her father’s back and crowing her victory. Geralt sprawls out on the stone floor and pretends he can’t get up under her enormous weight, groaning in mock effort. “I see she didn’t manage to bring the keep down while we were gone.”\n“Not for lack of trying,” Vesemir sighs. “Were you successful?”\nJaskier holds up the rolled parchment. “Got the treaty, and nobody got stabbed,” he says. “I’d call that a success, wouldn’t you?”\nVesemir sighs at him, but he claps him on the shoulder, too. “Good job, lad.”\n“Were you worried someone was going to get stabbed?” Eskel inquires. Geralt rolls over, dislodging Ciri, and catches her before she can scramble away, pinning her to his chest with one arm and tickling her with the other hand. Ciri squirms and kicks, shrieking with laughter.\n“I mean, with Witchers around, this is always a concern,” Jaskier says.\n“Hey now, I behaved myself like a fucking gentleman,” Lambert says, draping an arm over Jaskier’s shoulders. “I didn’t stab anyone even a little bit.”\n“Probably better behaved than most gentlemen,” Jaskier says thoughtfully. “Since as far as I know you didn’t fuck any chambermaids, either.”\n“Well, none of them were interested,” Lambert says, wrinkling his nose and shrugging.\nYen exchanges a glance with Jaskier, both of them clearly more than aware of exactly how rarely that matters to most noblemen. “Truly, you are a paragon of Witchers,” Jaskier assures Lambert, and hums a little, finding a tune after a moment. “There was a Witcher well-behaved / whose tongue was sharp as any blade,” he warbles, and Lambert guffaws.\n“Aw, buttercup, I get my own song and everything?” He tousles Jaskier’s hair and claps Aubry on the shoulder and goes wandering off down the hall, probably heading for the hot springs - all Witchers, as far as Jaskier can tell, are far more fastidious than most humans.\n“How does the rest of it go?” Eskel asks, quirking an eyebrow at Jaskier.\n“Um...His beard was shorn, his eyes were orange, his reputation daily made,” Jaskier extemporizes hastily.\n“I notice you don’t specify what kind of reputation,” Yen says, chuckling.\n“Not orange!” comes echoing back from the other end of the hall. Jaskier sticks his tongue out at Lambert’s back.\n“You try coming up with a rhyme scheme on no notice!” he retorts, not bothering to yell; Witcher hearing is a marvelous thing. Lambert makes a rude gesture as he leaves the hall.\n“Do I get a song?” Ciri asks. She’s draped over her father’s chest, hair wild, pink-cheeked and beaming, and Geralt is smiling up at her, that soft sweet smile that only Ciri ever earns from him.\n“Darling, I will write you as many songs as you like,” Jaskier assures her.\nCiri grins. “I want one about the goose trick!”\nGeralt puts a hand over his eyes and groans. “Don’t remind me,” he mutters, and sits up, lifting Ciri off of him easily.\n“Not the goose trick,” Eskel agrees, looking pained.\nYen laughs. “Oh, do one about the goose trick, it’ll be fun,” she says, and wraps an arm around Ciri’s shoulders. “Show me what you got done yesterday, little menace. Your Papa needs to go wash off the smell of politics.”\nVesemir sniffs pointedly. Geralt sighs at all of them, and takes Eskel’s offered hand up off the floor.\n*\nGeralt announces the treaty at supper that night - or rather, he announces that it has been signed, and has Jaskier read the whole thing out, one sonorous clause after another. There’s a cheer when Jaskier finishes, which is nice, and then Jaskier plays a few songs - not the one he’s already working on about the goose trick - and there is general merriment, and Lambert gripes at him about his eyes not being orange, and Eskel laughs at both of them, and it’s -\nIt’s so good to be home.\nHe and Geralt herd Ciri up to bed when she starts drooping, and Geralt sits on the end of her bed and pets her hair until she falls asleep, while Jaskier leans against the wall and watches the White Wolf care for his cub and thinks entirely in incoherent adoration instead of something useful like lyrics.\nAnd then Geralt herds him down the stairs to Geralt’s rooms. Not that Jaskier takes much herding. He hasn’t slept in his own rooms more than twice in the last three months - both times that Geralt was out hunting something, as it happens - and most of his belongings are in Geralt’s rooms, and there’s a dedicated stand for his lute. He mostly only uses his rooms for composing, because it’s hard to concentrate on writing when he’s in the White Wolf’s den. At least, it’s hard to concentrate on writing anything but really filthy songs, which are fun, but not what he’s supposed to be doing.\nGeralt tugs him down onto the bed as soon as they’re both naked and curls around him, tucking his nose into the curve of Jaskier’s throat. Jaskier strokes his hair, a little worried. Usually if they’re both naked and in private, Geralt doesn’t look so...distressed.\n“Usually I can figure out what’s wrong,” Jaskier says at last, “but you’re going to have to give me something more than silence, my wolf. We got the treaty signed, no one got stabbed, no one got kidnapped by husband-hunters, we’re home safe again...” He trails off, waiting for Geralt to tell him what the problem actually is.\nGeralt sighs. “You thought I was a monster,” he says, softly.\n“Ah,” Jaskier says. “Only until the moment I actually met you, my wolf. Even scared as I was then, I could tell you weren’t - well, you weren’t what all the rumors said.”\n“Hm,” Geralt says, and brushes a feather-light kiss against Jaskier’s throat. Jaskier tries to imagine what the terrified Julian of a year and a half ago would have made of this moment, and comes up utterly blank: he could not even have dreamed of this moment, a year and a half ago, scared and alone and sure he was walking to his death. “Hard to kill rumors,” Geralt adds after a few moments.\n“I grant that silver swords don’t work as well on rumors as on monsters,” Jaskier allows, “but that’s what my song cycle is for, you know.”\nGeralt raises his head and frowns at Jaskier in mild confusion. Jaskier grins. “You have to fight a monster with the proper weapon, right?” he asks. Geralt nods. “Silver for monsters, steel for men, dimeritium for mages: you choose your weapons according to the fight. Well, the proper weapon in this fight is words, my wolf. Songs of the White Wolf in his glory, in his mercy, in his goodness, to kill the rumors where they lie.” He brushes a thumb over Geralt’s cheekbone. “I probably couldn’t even lift your swords, but these are my weapons, and I’m very, very good with them.”\n“Hm,” Geralt says, and turns his head to kiss Jaskier’s thumb. “Yes, you are.”\nJaskier can feel his ears burning. A genuine compliment from this man, spare and blunt as it might be, flusters him far more than the floweriest praise from anyone else. “People sing my songs - sing your praises - across your empire,” he says quietly. Yen’s been helping him get the songs published, send them out to every bard and troubadour in the White Wolf’s lands, and the Witchers who go out to hunt monsters or make sure there’s no trouble starting anywhere bring back fairly regular reports that the songs are often sung, both by professional musicians and by common folk who find the choruses easy to memorize and pleasant to repeat.\n“My little lark,” Geralt says, smiling so sweetly it almost hurts to look at. “Protecting me, hm?”\n“Well, you protect me,” Jaskier says. “It’s only fair.”\n“Hm,” says Geralt, and kisses him, deep and utterly enthralling. Jaskier figures that means the deep conversations are over for the night, and winds his arms and legs around Geralt and kisses back as filthily as he can.\nSome nights, their coupling is fast and fierce and almost vicious; some nights, it’s slow and languid and so torturously good that Jaskier almost weeps with it; often, it’s joyful and easy and full of laughter and - because Jaskier is Jaskier - song. Tonight, apparently, it’s going to be sweet and soft and gentle.\nJaskier’s reasonably sure none of the idiots who spread rumors about what the White Wolf likes in bed would ever guess that Geralt likes being gentle. Not to say he doesn’t occasionally enjoy leaving bruises and bite-marks - and Jaskier certainly enjoys being on the receiving end of such attentions - but it’s far more common for Geralt to be careful of his strength.\nThey’re both too tired to do anything too energetic or involved, but Geralt’s hand wrapped around both their pricks is enormous and warm and so fucking good, and Geralt’s mouth on Jaskier’s throat is an entire series of revelations, each tender kiss like a separate epiphany. Jaskier cards his hands through Geralt’s hair and lets himself make as much noise as he pleases, knowing Geralt likes to hear his moans and whimpers and the occasional snatches of song-lyrics that slip unbidden from his throat.\nWhen he comes, it’s not the white-hot ecstasy that sometimes leaves him breathless, but a slower, sweeter pleasure, like sinking into a perfectly blood-hot bathing pool and feeling all the tension leave him. Geralt groans softly and strokes himself half a dozen more times and kisses the last soft moans from Jaskier’s lips and comes all over both of them with an almost startled gasp.\n“My wolf,” Jaskier murmurs, as Geralt collapses beside him and reaches out for one of the cloths they keep on the bedside table. “And what do we smell like tonight?”\nGeralt hums and noses at the line of Jaskier’s throat, breathing in deeply as he wipes them both mostly clean and tosses the cloth away. “Sex,” he says at last, and Jaskier chuckles. “Happiness. Love.”\nOh, that’s a new addition to the litany. Jaskier rolls over and kisses Geralt thoroughly. “My beloved wolf,” he says as they finally part.\n“Hm,” Geralt says, and smiles, golden eyes warm as embers. “My beloved little lark.”\nJaskier’s heart turns over, and he buries his face against Geralt’s throat and just clings. Fuck, those words, in that voice, and those eyes -\n\nThere was a wolf whose heart was held / beneath a songbird’s wings...\n\nLife in Kaer Morhen settles back into its usual rhythms, and Jaskier devotes himself happily to teaching Ciri and writing songs and advising Geralt and helping Triss and all the other little habits he’s picked up over the last eighteen months. Without a treaty to write, he’s not in the White Wolf’s office quite as often, but that just gives him more time to corner various Witchers and extract stories of their exploits, or read through the ancient books in the library, or bother Yen, so that’s alright.\nAnd then, two weeks after they return from Tretogor, he’s summoned to the White Wolf’s office by Eskel. Geralt is nowhere to be found. Eskel is looking particularly harried, poor man, and Jaskier tugs the parchment Eskel is staring at over so he can read it, and finds himself gaping in dismay.\nIt’s a xenovox-note from one of the Witchers out patrolling the southwestern border between Wolf-controlled Redania and Vizimir’s Redania, and the Witcher in question was clearly utterly baffled as to what to do.\nConvoy of nobles, mostly women, the note reads. Say they want to come to Kaer Morhen. Six Redanian, three Temerian, one Cintran. Overheard them saying they want to court the Wolf. Send them on?\n“Oh,” Jaskier says after a moment. “That’s. Not. Not great.”\n“Wolf took one look at that and ran off to hunt dinner,” Eskel says.\n“Oh no,” Jaskier says, starting to grin. “He panicked again?”\n“He panicked again,” Eskel confirms.\n“Well, let’s try to have some sort of solution before he gets back, then,” Jaskier says, and pulls up a chair.\n“What I want to know,” Eskel says, scowling down at the parchment, “is why now. We haven’t had any trouble with husband-hunters before now.”\nJaskier frowns. That is odd. Geralt’s been the most eligible royal in the northern half of the continent for at least a decade; it’s very strange that Kaer Morhen has not played host to at least a few very ambitious noblewomen.\nIt hits him all at once, and he drops his head into his hands. “Fuck.”\n“What?”\n“It’s me,” Jaskier says. “I’m - I’m proof of concept. That a perfectly ordinary human can walk into the White Wolf’s den and not be devoured.”\n“Not sure I’d call you ‘perfectly ordinary,’ bard,” Eskel says. “But I see what you mean.” He pats Jaskier on the shoulder. “It was bound to happen sooner or later; now we just need to deal with it. Can we just...say these women aren’t welcome?”\n“Well, you can,” Jaskier says, raising his head and sighing. “But it won’t exactly encourage their homelands to like you. It would be better to have a reason to reject them that isn’t - well - that isn’t ‘the White Wolf will hide in the mountains until they all go away.’ Or similar.”\nEskel snorts. “No one outside of Kaer Morhen would believe that,” he says, with a wry smile. “Poor Wolf; at least I don’t have to worry about this shit.”\n“I wouldn’t be so sure,” Jaskier says. “You’re known to be his right hand. There might well be some noblewomen who are willing to try for you.”\nEskel shivers. “Oh fuck no.”\nJaskier props his chin on one hand and gives the scarred Witcher a mischievous smile. “No? You don’t want a charming young noblewoman in your bed?”\nEskel shakes his head and rolls his eyes. “No, I don’t, and neither does anyone else in Kaer Morhen. Nobles are more trouble than they’re worth. Present company excepted.”\n“Pretty sure I’ve been disowned,” Jaskier says. The words don’t hurt at all; he is far, far happier as Jaskier of Kaer Morhen than he ever was as Viscount Julian Alfred Pankratz of Lettenhove. “At this point, the only title I’ve got is ‘bard.’”\n“Court bard,” Eskel points out, and then sighs. “So we can’t just turn them back at the border. Alright, what sort of excuse can we give for rejecting them when they get here?”\nJaskier hums and taps his fingers on the desk, thinking hard. “We need some sort of criteria,” he says at last. “A list of qualities required of the White Wolf’s Consort that none of these ambitious ladies will be able to fulfill, but one that isn’t obviously so arbitrary that we pulled it out of our asses.”\n“Hm,” says Eskel, sounding very much like Geralt for a moment, and pulls a scrap of parchment closer. “Such as?”\nJaskier frowns. “Well, the big one, I think, would be respecting Ciri’s place as Geralt’s heir. A lot of these women, they’re probably hoping they can be the mother of the White Wolf’s dynasty.” He winces. “And we should probably start preparing for Ciri to be getting marriage offers, too.”\n“She’s ten,” Eskel says.\n“Nobles,” Jaskier says, grimacing. “But at least Geralt can definitely make a ruling that no one may offer for her until she’s old enough - that won’t get too much pushback. I hope.”\n“Fucking nobles. Right, so, some sort of oath to respect Ciri’s position,” Eskel says, scribbling it down. “And we’ll know if they lie.”\nJaskier nods. “Beyond that…” he hums in thought.\nThe door opens behind him, and Yen comes in and drapes herself over the back of Jaskier’s chair. “What are we up to, and why did I see Geralt heading up-mountain like there was a dragon on his tail?”\n“Coming up with a list of criteria for the Warlord’s Consort,” Eskel says.\n“...I can guess why Geralt’s out, then,” Yen says wryly. “Panicked, did he?”\n“Yep,” Jaskier confirms.\n“What’ve you got so far?” Yen asks, and scans Eskel’s parchment. “Hm. How about a willingness to give up all other titles? Can’t have the consort having any ties to another country, after all.”\nEskel nods. Jaskier taps a finger on the table. “Loyalty - proven loyalty to the Wolf, above all else,” he supplies.\n“Lack of fear,” Yen puts in. “The Warlord’s Consort can’t fear Witchers. And can you imagine poor Geralt trying to bed someone who was afraid of him?”\nJaskier and Eskel both wince. “He wouldn’t,” Jaskier says, knowing it to be perfect truth.\n“Precisely,” Yen says. “What else can we throw in?”\n“Besides being fearless, loyal, and willing to give up title and ambition for the pleasure of marrying the Wolf?” Eskel asks, grinning.\n“Useful skills,” Yen puts in. “Don’t much care what, but a consort should be good at something.”\n“Unbribeable,” Jaskier says. “Or at least really fucking hard to bribe. Though I suppose that goes with loyalty.”\n“Smart,” Eskel says, frowning. “Warlord’s Consort should be part of his council, I should think.”\n“Good with people,” Yen says. “Somebody’s got to be, and it isn’t Geralt, bless the man.”\n“Oh, put in something about being able to deal with Kaer Morhen,” Jaskier says. “I don’t think Geralt would be willing to turn this keep into a proper court even for true love - hell, I don’t think he could - so whoever it is, she’ll have to deal with - well - communal bathing and semi-regular brawls and general chaos instead of court politics.”\n“Good point,” Yen says, nodding. “Fuck knows I took a while to get used to that. I like it a lot better, honestly - fewer people lying to my face - but it took some getting used to.”\nJaskier nods. “Better, but very different,” he agrees.\nEskel grins. “Alright, we’ll show this to Vesemir - and the Wolf, when he gets back - and see what they say, but I think it’s pretty solid. If there’s a woman in that convoy who meets all of these criteria, I’ll eat my fucking hat.”\n“Add one more thing,” Yen says. “Make it so that anyone who wishes to be the Warlord’s Consort must win the agreement, freely given, of every single member of the Warlord’s council - and his daughter.”\nEskel’s grin gets nastier. “That’s good,” he says. “That’s very good. We’ll let the cub know she can have as much fun as she likes, scaring people off.”\n“Oh dear,” Jaskier says, starting to smile despite himself.\n“Alright,” Eskel says, sounding very satisfied. “I’ll make a clean copy and show it to the Wolf when he gets back, so he knows we’ve got a battle plan, and then we can send word to let the convoy through.” He nods to Jaskier and Yen. “Thanks.”\n“You’re quite welcome, darling,” Yen says, grinning. Jaskier nods.\n*\nThe thing is, Jaskier’s not an idiot, as foolish as he may sometimes act. He noticed Eskel and Yen weren’t specifying women in that list of criteria. He noticed, too, that it could be argued - without even stretching the truth at all - that he himself fits every single qualification. Loyal to the White Wolf. Supportive of Ciri. Unafraid, and with skills that are genuinely useful to the Wolf. And, if he’s not dreadfully mistaken, approved of by the rest of the council, and the White Wolf’s daughter, too.\nIf Geralt wants Jaskier to be his consort, then that list Jaskier just helped draw up won’t provide a single stone to stumble over.\nWarlord’s Consort. Now there’s a title Jaskier doesn’t know if he wants at all.\nHe’d better figure it out fast, though. He doesn’t have the luxury of panicking and retreating into the mountains, even assuming he could survive such a stunt.\nHe settles at his desk, staring out over the mountains, and does his best to lay everything out tidily, the way his tutors despaired of ever teaching him to do.\nA Warlord’s Consort would have to be faithful, as well as loyal; that’s the first problem Jaskier can come up with. Oh, Jaskier hasn’t slept with anyone but Geralt since he got to Kaer Morhen, but he’s looked. There are plenty of absurdly attractive people in the keep. If he were Geralt’s consort, looking would be all he could ever do. Is he built to swear himself to one man alone, for all his days?\nMaybe not any other man. But Geralt…\nWhere else is Jaskier going to find a man like that? And having had such a man, how could he ever be satisfied with less? Oh, he might miss women eventually, though he and Geralt might be able to work something out between them if it turned out they both wanted the same woman, or Geralt gave explicit permission for Jaskier to court some lovely lady, or something like that. But after three months in the White Wolf’s bed, Jaskier just plain can’t imagine settling for any man less beautiful, inside and out, than his magnificent lover.\nWell. Maybe Eskel, if Jaskier ever got the impression that the other Witcher was interested; but then, Eskel is Geralt’s right hand, most trusted advisor and commander of his troops, very nearly as magnificent in his own right as his shining lord, so he definitely counts as very nearly as wonderful as Geralt is, and it wouldn’t be settling at all. Anyone else, though? No. It would just end in disappointment all around.\nHm. The White Wolf’s shadow is as dark as night / his eyes like embers glowing / and at the White Wolf’s right he stands / all truths and secrets knowing… There might be something there. And Eskel should definitely have a song or two. Jaskier will have to work on that.\nBut anyway, some sort of monogamy would probably be fine, though if it starts looking like this is going to become a thing that happens, Jaskier will have to have a talk with Geralt about women.\nSo that’s...doable, probably.\nWhat about actually being the Warlord’s Consort? That would come with certain duties, Jaskier is sure...but then, he’s sort of already doing them, the ones that need doing. He’s making Geralt’s reputation gleam, and helping with diplomatic bullshit, and advising the White Wolf’s council. Being the official consort wouldn’t change much of that. And Geralt certainly doesn’t have some sort of set idea of what a consort ought to do; if he takes Jaskier as his consort, the list of official duties Jaskier already has on his plate isn’t likely to change much. So that’s fine.\nWhat of the other side of it, then, the possible drawbacks to being the Warlord’s Consort?\nWell, the first obvious concern is that the Warlord’s Consort is a far more likely target of assassination attempts than a mere court bard, even one who happens to share the Warlord’s bed. But if someone can get an assassin into Kaer Morhen, past hundreds of protective Witchers, then...well, they’ll have damned well earned their kill, Jaskier supposes.\nThe second obvious concern, at least for Jaskier, is that while the White Wolf’s court bard might, maybe, be able to go out and wander like any other troubadour now and then - he hasn’t yet, but it might yet happen in the future - there’s no way a consort could do the same.\nOn the other hand, Jaskier wanted to be a traveling bard for two reasons: to get the hell out of Lettenhove, and to gather as many stories as he could. Kaer Morhen is definitely nothing like Lettenhove, and the Witchers of the keep have literal centuries of stories for Jaskier to turn into songs. He couldn’t run out of inspiration if he tried. Even if he gets tired of singing about monster hunts and wars, the Witchers have borne witness to at least three centuries of history, and have frankly unique perspectives on it. So though traveling might be nice, it’s maybe not as vital as it seemed at Oxenfurt. And there’s no reason he couldn’t go out with Ciri when she’s older, maybe, to explore the empire that will someday be hers. They’d need guards, but that’s a bearable restriction.\nAlright then, last set of questions: would there be anyone better suited to be the Warlord’s Consort?\nYen, maybe, as the leader of the mages who came to the White Wolf’s banner, but Jaskier has gotten tiny snippets of the story of her failed romance with Geralt, and neither Geralt nor Yen wants to re-float that particular shipwreck. They make far better friends than sweethearts. And the Warlord’s Consort needs to be able to flatter people as well as intimidate or insult them.\nIt could be argued that the Warlord’s Consort should be a princess, but Jaskier’s pretty sure any princess on the continent would be more horrified by Kaer Morhen - and terrified by its lord - than willing to deal with the interesting aspects of living with Witchers, so that’s right out.\nWhich leaves as the only person Jaskier has left to worry about - or compete with, if this is a competition he wants to win - Ciri’s mysterious mother. Because surely the mother of his heir would be the best consort for a warlord, right?\nBut Geralt has never breathed a word - even to Eskel, apparently - of who Ciri’s mother is, or even if she still lives. He certainly has never suggested bringing her to Kaer Morhen.\nSo she’s probably not in the running, even if there is a competition to be had.\nJaskier sighs and puts his face in his hands. And all of this worry - all of this very careful logical sensible laying out of questions and concerns, all of this weighing of advantages and disadvantages, is entirely beside the point. If Geralt ever asks Jaskier to be his consort, Jaskier will say yes before the question is even finished, because he lost his heart to the golden-eyed White Wolf of the North and he would do just about anything if it means he can stay at Geralt’s side forever.\nGeralt may never decide he wants a consort - may, indeed, be perfectly happy to continue as they are, with Jaskier as friend and lover and bard and advisor - and if so, Jaskier will be content with that, no complaints at all from his end, as long as he is Geralt’s little lark he will be the happiest man in Kaer Morhen -\nBut if Geralt ever does decide to choose a consort, by every god there is, Jaskier is going to do his damnedest to be chosen.\nAs soon as Geralt returns from his impromptu hunting trip - thankfully he gets back right before supper on the same day he left, and puts up with Eskel’s teasing with a sort of sheepish grumbling - Jaskier is given free rein to set the stage for the welcoming of the would-be consorts, and he throws himself into the task with a sort of malicious glee. Yen helps, of course - her instinct for drama is impeccable - but Eskel and Geralt and Vesemir just sort of back away as soon as Jaskier and Yen start bouncing ideas off each other, muttering about going hunting.\nWitchers. You’d think that a group of men who go about in black leather would be better at deliberately looking imposing.\nBut that’s why they have Jaskier, right? And Yen, of course, who can do imposing like nobody’s business. Bards and sorceresses: good at setting the stage.\nThe noblewomen step warily into the great hall at midafternoon, three weeks after the note first arrived, and it’s nearly empty - to human eyes, at least. There are Witchers lurking in the shadows, a few from every School, watching silently, but they won’t interfere unless something goes really impressively wrong.\nGeralt is sitting in the throne he almost never uses, the huge silver wolf’s-head medallion shining like a crown behind his head, wearing his spikiest armor and - of course - the two swords that mark a Witcher. Dark stone, dark armor, silver hair and pale skin - the only spots of color are the White Wolf’s golden eyes, and those, as Jaskier well knows, are very hard to meet unless you know him.\nAlso, he’s glowering even more than usual, and though Jaskier thinks he looks so astonishingly attractive that it’s hard to keep from falling at his feet, he’s perfectly aware that newcomers to Kaer Morhen are going to assume that’s the expression that only briefly precedes evisceration.\nThe rest of the council is arrayed on either side of the throne: Eskel, also in the spikiest armor he could find, at Geralt’s right, arms crossed over his chest and scarred face creased in a scowl. Jaskier knows he’s a complete sweetheart, but he has to admit that on first glance, Eskel is almost as intimidating as the White Wolf. Yennefer, to the left of the throne, is wearing her most dramatic black outfit, and she looks coldly beautiful and utterly untouchable, like some sort of goddess of pain. Vesemir, to her left, refused to wear spikes but does look as grim as a winter storm.\nThere was some debate as to what Jaskier should wear. A bard in black just looks wrong, somehow, and anyhow Jaskier isn’t quite willing to get an entire outfit made for one evening. But he does have a gold outfit, very nearly the color of Geralt’s eyes. So he’s all in gold, lute across his back, grinning a little more nastily than he really wants to admit, at Eskel’s right hand.\nHe thinks they make a fairly intimidating display, the five of them: the White Wolf and his Pack.\nTo their credit, none of the ten noblewomen who file into the hall in what Jaskier is willing to lay money is order of precedence actually break and run, but if Jaskier were a Witcher, he’s pretty sure he’d be smelling fear as thick as porridge. The women’s entourages cluster at the end of the hall, looking just as worried: one lady-in-waiting and two guards each, all that Eskel would allow past the border. The guards are all looking very twitchy, as though certain that there’s about to be a bloodbath they won’t be able to do anything about; the ladies-in-waiting are all white-faced and trembling.\nOh, actually, that’s interesting: there is one lady-in-waiting who stands straight-backed and calm, watching the whole tableau with clear interest and no apparent fear. Jaskier squints against the dim lighting - he and Yen ordered that only half the lanterns be lit, so that the Witchers could see clearly but their human guests could not, but unfortunately Jaskier is only human, too - and realizes with a little shock that he recognizes her. Milena de Roggeven, the pretty young duke’s daughter he met in Redania. If she’s here as a lady-in-waiting, then Jaskier guesses that one of the would-be consorts must be another daughter of the Duke de Roggeven, presumably an older one. Well, that’ll be interesting. If the elder de Roggeven daughter is anything like her younger sister, she might actually be able to cope with Witchers.\nGiven that every one of the consort-hopefuls looks like she’s worried Geralt is going to eat her for dinner, he’s not going to bet much money on that, though.\nGeralt waits until they’re all lined up in front of the dais, ten young women in a slightly shaky line, before he deigns to do so much as nod. Given how terrified they all look, it’s probably just as well that the council agreed to let Eskel do the talking; Geralt growling at them might actually cause some of them to faint. Jaskier may not think much of their chances of winning Geralt’s heart and hand, and may want them gone back to their homes as quickly as possible, but he doesn’t wish them any ill - well, at least, not until and unless they actually turn out to deserve it.\n“You may present yourselves to the Wolf, and state your business in Kaer Morhen,” Eskel says coolly.\nOne by one, the ladies state their names and titles. The highest-ranking is actually a Temerian princess, to Jaskier’s surprise; the marchioness de Roggeven is next in rank, and then another duke’s daughter, and the rest are from all the ranks of the nobility, down to the very scared-looking young Cintran woman whose father is a mere baron, and who looks like she would rather be anywhere but here. When they have all introduced themselves, Princess Agata curtsies and says, voice admirably even, “We have come to Kaer Morhen in the hopes that the Warlord of the North may, in his wisdom, be willing to consider us as candidates to become his consort.”\n“Hm,” says Eskel, and Jaskier does not smile at how like the White Wolf Eskel sounds. “Very well. We will provide you with the list of requirements that any candidate for that position must fulfill. You may have a month’s grace to consider them. If you cannot fulfill them, we will provide you with escort to the border of the White Wolf’s lands.”\nA month isn’t very long, but Geralt’s patience is not infinite. And a month is about how long it took Jaskier to forget to be afraid of Witchers in general and the White Wolf in particular, so it’s as fair as any of them care to be to these hopeful young husband-hunters.\nVesemir gestures, and Witchers step from the shadows, fading into view like nightmares; the noblewomen and their entourages flinch in shock. “They will show you to your rooms,” the old Witcher says, and, shakily, the noblewomen nod and curtsey again and beckon their attendants and follow the waiting Witchers out of the hall towards the wing that has been set aside for them.\nMilena de Roggeven looks up as she passes the dais and catches Jaskier’s eye and smiles.\nInteresting.\n*\nSupper that night is a little tense. There’s been a special table brought in for the noblewomen and their ladies-in-waiting, though their guards have been given seats at the various Witchers’ tables - and very unhappy they look about it, too. All of the noblewomen spend significant portions of dinner staring at Ciri, who stares back in clear fascination. As soon as she finishes eating, she slides out of her chair and hurries around her father and Eskel to stand beside Jaskier’s chair, tugging at the sleeve of his doublet.\n“They dress fancier than Aunt Yen,” she murmurs when Jaskier bends his head.\nJaskier laughs. “Yes, they do,” he agrees. “But don’t let your Aunt Yen hear you say that - she might take it as a challenge.”\nCiri giggles briefly, then frowns. “They look really scared,” she says.\nCome to think of it, Jaskier realizes, Ciri doesn’t...actually talk to people outside of Kaer Morhen. That should maybe be fixed. He’ll have to talk to Geralt about bringing her down-mountain and letting her talk to the villagers, or the elves in their sheltered towns, or even all the way to one of the cities to see what life is like there. “A lot of people are very scared of your Papa,” he explains gently. “I was, when I first got here.”\nCiri’s frown deepens. “But why?” she asks.\nJaskier shakes his head in wonder. Growing up among Witchers and sorceresses has made Ciri essentially fearless, he knows that - it occasionally causes problems, though thankfully there’s always a Witcher or two close enough that such problems are easily solved - but he hadn’t quite realized that she doesn’t know how the rest of the continent, the lands outside the Wolf’s empire, view the Warlord of the North. “Well, people say a lot of stupid things,” he says at last. “I had heard - a lot of rumors that it turns out were completely false. I thought he was going to be very mean to me.”\n“Oh,” Ciri says. “And they think he’s going to be mean, too.”\n“Yes,” Jaskier agrees. “He’s...probably going to be rude, because he’s Geralt, and also they’re all here because they want to be the Consort of the Warlord of the North, and I don’t think he likes being courted.”\nCiri wrinkles her nose. “Even though they think Papa is mean, they want to marry him?”\n“People do very stupid things for power, little menace,” Jaskier says.\n“Ain’t that the truth,” Lambert grumbles, and Jaskier is reminded - again - that trying to have private conversations around Witchers is about as productive as lighting candles in a blizzard.\n“Just remember, none of them gets to marry your Papa without your say-so,” Jaskier reminds Ciri gently. “Even if they manage to check off every other item on that list your Uncle Eskel put together, you get to say yea or nay.”\nCiri grins at him. “What if I tell him to marry you?”\nLambert goes off into snorting gales of laughter, and Eskel, who has been politely pretending to ignore the conversation, inhales a mouthful of ale and has a truly undignified coughing fit. Jaskier glances past Eskel to see that Geralt is watching him with, as usual, a nearly unreadable expression - but there’s amusement in the crinkles around his eyes, and the fond quirk of lips that Ciri always brings out. Not offended by the question, then - not offended by the idea.\n“I think that’s something you get to take up with your Papa,” Jaskier says carefully.\n“Hm,” says Ciri, clearly imitating Geralt despite the fact that she can’t quite hit the same low note, and gives Jaskier a speculative look. “Are you going to sing for us tonight?”\n“That was the plan,” Jaskier says. “Any requests, little menace?”\nCiri thinks about it for a long moment, wrinkling her nose adorably. “No love songs,” she decides at last. “Something funny.”\n“Something funny it is,” Jaskier says, and stands, fetching his lute from where he hung it on the back of his chair and slinging it over his chest. The hall hushes, which is flattering as all hell every time it happens: having an entire hall of Witchers fall silent for his performances is fucking addictive, one of the best parts of living in Kaer Morhen.\n“This is an old one,” he says into the waiting silence, “but I’ve always been fond of it. You know the drill: after every line, clap your hands twice, like this!” He claps, sharp and brisk. “This is The Skelliger.”\nSeveral Witchers hoot with anticipatory glee, and Jaskier strikes the first chord and starts to sing, beaming as the music rises to fill the hall.\n*\nJaskier left Yen in charge of organizing entertainment for the noblewomen during their stay, mostly because she seemed so delighted at the prospect. He should maybe have kept a closer eye on her, though, if only to make sure none of her plans end with any noblewomen dead, because the first thing she announces, at breakfast the morning after the women arrive, is that they are invited on a hunt with the White Wolf and his men.\nThis is initially received with great good humor, up until the noblewomen realize that while in almost any other court, a hunt means riding out looking delicate with a hawk on one’s wrist and flying the bird at prey which has been flushed from the bushes ahead of you - or possibly released by servants with caged doves or rabbits - in Kaer Morhen it means going hiking through the mountains, horseless and servantless, looking for deer or boar or, occasionally and mostly accidentally, wyverns.\nJaskier made that mistake once. He has not made it since. He’s mostly lived down the fact that Aubry had to carry him home, but he doesn’t care to be reminded of it. He is not going hunting, thank you very much.\nBlessedly, Ciri’s morning lessons make for a very good excuse for him to refuse.\nOnly one of the noblewomen is smart enough - or possibly scared enough - to back out, and Jaskier, coming down for dinner, sees the young Cintran lady and her attendants carrying their bags out of the keep towards the stables. He follows them, of course.\n“I’m leaving,” the girl says when she spots him leaning on the stable doorframe. “Father said I had to come, but he wouldn’t be the one living in this - this horrid place!”\n“If you think it horrid, then it is not the place for you, my lady,” Jaskier agrees. “I do not find it so.”\nShe gives him a long, curious look. “You’re quite mad,” she says at last. “But I wish you joy of it.”\n“And I hope you find your joy, my lady,” Jaskier says, perfectly willing to be amiable now that she’s leaving.\n“Thank you,” she says, and one of her guards helps her up onto her horse, and she leads her attendants out of Kaer Morhen without a single backwards glance.\nWell, that’s one down.\n*\nJaskier is not surprised when every single one of the noblewomen and their ladies-in-waiting are being carried by Witchers when they return from the hunt, an hour or two before supper. He’s also not surprised that most of them look almost paralyzed with fear from the experience, on top of the exhaustion that has resulted in their unusual method of travel.\nMilena, interestingly, is still looking fairly calm. She’s sitting in Lambert’s arms, and appears to be chatting amiably with the prickly Witcher, who looks somewhere between intrigued and baffled by the experience. Her older sister, in Axel’s arms, is not looking anywhere near as happy.\nYen is looking smug, because of course she is. Jaskier catches her eye as the line of burdened Witchers files into the hall, and she strides over to him with a smirk. “Apparently,” she says, “noble ladies of Redania and Temeria do not enjoy traipsing up and down mountains in their good shoes. I am shocked.”\n“Yen, darling, I don’t enjoy traipsing up and down mountains in my good shoes,” Jaskier points out. “Any casualties?”\n“One twisted ankle - she’ll be fine,” Yen says dismissively. “And a couple of deer, of course.”\n“Of course,” Jaskier says, as Geralt comes in with an entire elk carcass on his shoulders. There’s something deeply primal about the sight of Geralt with blood in his hair and a tiny, feral grin on his face, carrying food back to his people. Jaskier wants to kiss him, and then drag him down to the hot springs and scrub his hair clean, and then kiss him some more.\nWhich he is, in fact, allowed to do these days.\nGeralt hands the elk off to a trio of servants, and Jaskier crosses the hall to take his lover’s face in his hands and kiss him sweetly. Geralt tastes of sweat and a little blood - not the most appetizing flavor in the world - but he kisses back with a quiet, happy hum, so Jaskier doesn’t really mind.\n“Staking your claim, little lark?” he murmurs as their lips part.\n“Maybe I am,” Jaskier replies, and Geralt’s eyes crinkle in a near-invisible smile.\nYen claps her hands, gaining the attention of everyone in the room as the Witchers finish putting down their reluctant burdens. “Kaer Morhen is lucky enough to have hot springs to bathe in,” she informs the noblewomen. “Do please join us there before supper!”\n“Oh, vicious,” Jaskier murmurs, hiding a grin behind his hand as the noblewomen begin to mutter among themselves. “Vicious, vicious Yen.”\n“That she is,” Geralt says, almost ruefully.\n“Dunno why everyone thinks it’s Witchers who are cruel,” Eskel adds, coming up beside Jaskier and clapping Geralt on the shoulder. “Nice work on that elk, Wolf.”\n“Oh, tell me he brought it down single-handedly,” Jaskier sighs, rubbing his forehead.\n“Of course he did,” Eskel says. “With a knife. Not his teeth.”\n“Thank you for specifying,” Jaskier says.\nGeralt sighs.\n*\nThe noblewomen look at the hot springs, which are full of cheerful naked Witchers. Jaskier watches their expressions go from shock to dismay to full-blown horror.\n“You’ll want to use the pools below this one,” Yen says, smiling like she doesn’t see how unhappy the noblewomen are. “The ones the Witchers are in are far too hot for humans.”\n“Are there no private pools?” Princess Agata demands. “Surely the Warlord does not use the common baths -”\nGeralt picks this moment to stride naked as the day he was born past the little clutch of horrified noblewomen and directly into the water, Eskel hard on his heels. Jaskier shakes his head at the chorus of squeaks and gasps that rise from the noblewomen, and follows his wolves into the water. Geralt ducks under briefly, and then stands in the deepest bit of the pool so Jaskier can kneel on the carved rock seat and work the blood out of Geralt’s hair.\nHe’s only paying half his attention to his hands, because the other half is focused firmly on the scandalized noblewomen, who hiss desperate comments at each other until Princess Agata finally decrees that the ladies-in-waiting will hold up bathing sheets around one of the pools to allow their betters to bathe in private. Jaskier feels a bit sorry for the women - some of whom, like Milena, are actually of the same rank as the consort-hopefuls - as they stand around one of the smaller pools with their arms outstretched and toweling draped over them, shielding the pool from prying eyes.\nYen gets into the pool with Geralt and Eskel and Jaskier, nude and unashamed, and grins. “Poor darlings,” she drawls, tilting her head at the ladies-in-waiting and the hidden noblewomen. “I don’t think Kaer Morhen is agreeing with them.”\n“You are a startlingly vicious woman and I never wish to become your enemy,” Jaskier informs her.\n“You are just as vicious, little flower,” Yen says, beaming at him. “You just hide it better.”\nJaskier hums and finishes getting the last of the blood out of Geralt’s hair. “Maybe true,” he allows at last. Geralt chuckles, settles on the seat beside Jaskier, and tugs Jaskier into his lap, tucking his face into the curve of Jaskier’s throat with a contented hum and wrapping his arms around Jaskier’s waist. Jaskier wriggles until he’s properly comfortable and leans back against Geralt’s broad chest, humming his own pleasure in turn.\nLambert splashes into the water beside them, making Geralt rumble irritably, and flops down so only his head is out of the water. “Fucking nobles,” he gripes. “Buttercup, you lucky fucker, you didn’t have to hear ‘em whining the whole way up the mountain and down again.”\nJaskier laughs at him. “You volunteered to go along,” he points out.\n“Yeah, well, catch me being that stupid again,” Lambert grumbles. “Though I guess Milena’s not that bad.”\n“Oh?” Eskel asks, exchanging a thoughtful look with Jaskier.\n“She’s funny,” Lambert says. “And not as afraid of us as all the other noble idiots are.”\n“I’m glad you’ve found a friend,” Jaskier says, carefully keeping any trace of humor out of his voice. Lambert grimaces but doesn’t object.\n“How many do you think we’ll lose tomorrow?” Eskel asks Yen. Yen hums.\n“Three or four,” she says at last. “From what I’ve been able to overhear, about half of them came on their fathers’ orders, and they’ll break easily. The other half...they’re here because they genuinely want to be Consort to the Warlord of the North, and if that means putting up with Geralt and Kaer Morhen, they’ll do it.”\n“Geralt’s not something to put up with, he’s someone to fucking cherish,” Jaskier grumbles, and Geralt makes a soft happy sound and kisses the back of his shoulder. Jaskier turns his head so he can press his lips to Geralt’s temple.\n“Ugh, buttercup, be sappy somewhere else,” Lambert grumbles, splashing water vaguely in Jaskier’s direction - it doesn’t even hit him.\n“I shall be sappy all over this damned keep if I like,” Jaskier says, raising his chin and looking as haughty as he can. “Bard’s privilege. We get to be as dramatic as we please.”\nYen chuckles. Eskel shakes his head and smiles.\n*\nSupper that night is mostly uneventful: good food, good company, a table full of cranky noblewomen studiously ignoring everything around them except for the occasional attempts several of them make to catch Geralt’s eye and look alluring. Geralt doesn’t appear to notice. Jaskier notices, but it’s more amusing than annoying, at least so far. Jaskier sings when the meal is over, picking a couple of cheerful ballads with good catchy choruses and not bothering to ask the ladies what their preferences are. He’s already caught several of them giving him foul looks, clearly not amused by his obvious place in Geralt’s affections. They may well have thought that their only competition was each other, on their way to Kaer Morhen, but now they know he’s in the running too, and so far ahead of the rest of them it’s not even truly a race.\nIf, of course, Geralt wants a consort. He still hasn’t said anything one way or another, either to Jaskier or to anyone else on the council. He did approve the list of requirements they drew up without any emendations, which was moderately flattering, but besides that and his clear unhappiness about being hunted like a particularly appealing stag, he hasn’t really voiced an opinion on the whole matter.\nJaskier doesn’t mind not being consort - as long as nobody else is, either.\nHe and Geralt put Ciri to bed after supper, and then Geralt wraps an arm around his waist and tugs him down the stairs to Geralt’s rooms - it doesn’t take much tugging - and takes his own sweet time undressing Jaskier, kissing every exposed patch of skin as he goes. Jaskier pets Geralt’s hair and murmurs whatever sweet babble comes to his lips - he doesn’t even know what he’s going to say next, most of the time, just that it’ll be sappy and adoring and probably filthy.\nThere’s something about having Geralt knelt before him, moon-white hair tangled between Jaskier’s fingers and golden eyes half-closed in contentment as he nuzzles at the line of Jaskier’s hip, inhaling the scents of love and lust and happiness, that’s downright inspiring.\n\nOh wolf, said the maiden, your eyes they do gleam / your teeth are so sharp and your claws are so keen / have you come to devour me, am I your prey / or will you claim me and bear me away?\n\nNot that Jaskier is a maiden, but being a bard involves a lot of artistic license.\nGeralt laughs softly against Jaskier’s skin and stands. “Always composing,” he says fondly, and kisses Jaskier, slow and thorough, until all the words have vanished under a wave of inarticulate want.\n“You’re very inspiring,” Jaskier manages to squeak out as Geralt scoops him up and carries him over to the bed. “Not my fault if my lover is the most magnificent man on the contin-” He is interrupted by another kiss.\n“Little lark,” Geralt murmurs, voice deep and rich and loving, and it warms Jaskier all the way down to his toes. “Never stop singing.”\nJaskier’s heart turns over. “Darling wolf, how could I?” he asks, and pulls Geralt down into another kiss, and another, until they’re moving against each other in a steady rhythm like the beat of a drum, both too distracted by the press of lips and teeth and tongues to do anything fancier than rub off against each other, Jaskier’s hands tight on Geralt’s shoulders and Geralt’s arms wrapped around him to hold him close, as though Jaskier would ever want to be anywhere but here.\nIn the morning, four more noblewomen take their leave, all looking very footsore and very irritable. Jaskier watches them go from the gateway, and firmly resists the urge to wave after them, before heading up for Ciri’s morning lessons. He’s taking advantage of the current invasion of noblewomen to go over court etiquette with the young princess; she puts up with it with better grace than usual. Mostly, Jaskier learns when the formal lesson is over, because she has an ulterior motive.\n“I want to meet the ladies,” she says. “Aunt Yen said I had to be polite at first.”\n“At first?” Jaskier says, starting to grin. Oh, Yen, vicious as always.\n“She said I have to be polite until they stop being polite to me,” Ciri says, grinning. “And then I can be as rude as I like as long as I don’t use any of Uncle Lambert’s words.”\nJaskier snorts with laughter. “She’s quite correct, Uncle Lambert’s words are not appropriate in polite company. Or impolite company. Or, indeed, any company at all.”\nCiri giggles. “So Aunt Yen’s going to introduce me after dinner. Do you want to come?”\n“I would be honored, if your Aunt Yen doesn’t mind,” Jaskier assures her. “Shall we go down to dinner and ask her?”\nCiri leads the way down to the hall, skipping down the narrow steps with what has always seemed to Jaskier like impossible agility. He takes them carefully, even now: they are a little slick underfoot, and unlike Ciri, he hasn’t been trained in acrobatics since he could walk.\nYen eyes Jaskier thoughtfully when Ciri asks if he can join them for the afternoon, and finally nods. “Triss and I have invited the ladies to join us in the stillroom,” she says.\nJaskier raises an eyebrow. “How many of them think you’ll be making rosewater salve?” he asks. Noble ladies do spend a fair amount of time in stillrooms, but the salves and balms and soaps they make are very little like the potions Triss spends her time concocting.\nYen’s smile grows sharper. “Most of them. Oh, I think they’re clever enough to realize it’s a trap - they just don’t know what kind, yet.”\nJaskier shakes his head at her and grins. “You’re worse than the little menace.”\n“Where do you think she learned it?” Yen asks, draping an arm around Ciri’s shoulders and pressing a kiss to the girl’s messy hair. Ciri giggles.\n“I learned it from Uncle Lambert,” she says, and Yen claps a hand to her mouth in mock offense.\n“Betrayed! By my own apprentice!” she cries, and puts her hand to her forehead, slumping back against her chair in a beautiful false faint. “Alas!”\nCiri laughs harder. “Aunt Yen, you’re so silly!” she says, and clambers into Yen’s lap to hug her. Yen wraps her own arms around the girl and kisses her forehead, laughing softly.\n“Darling vicious little menace,” she says.\nJaskier shakes his head at both of them and retreats to his own chair.\n\nThe sorceress with violet eyes / has never known a day of love / her heart is stone, or so it seems / until you see her with her cub…\n\n*\nPrincess Agata of Temeria. Marchioness Marta de Roggeven. Countess Paulina de Brokilon. Countess Karolina de Rimmar. Viscountess Anastazja de Brenna. Five would-be consorts left, all of them clearly here not at their fathers’ bidding but because they, themselves, are eager for the power and prestige of being the Warlord’s chosen consort. Jaskier looks them over as they come mincing into the stillroom, notes the sharp unhappy glances he and Yen are getting, and decides that he doesn’t like them.\n“Ladies,” Yen says, smiling without any friendliness at all. “May I present to you my colleague, Triss Merigold, whose domain this stillroom is; and the princess Cirilla, daughter and heir of the Warlord of the North.”\nCiri gives quite a creditable curtsey. Jaskier is very proud. She gets five much deeper ones back, because she technically outranks even Princess Agata, by virtue of being Geralt’s heir. Princess Agata doesn’t look happy about this, of course.\nTriss says, “Welcome to my stillroom! As you are all here in the hopes of becoming the Warlord’s consort, I thought perhaps you would be interested in learning about the potions which enable the Witchers to perform such remarkable feats as they do!”\n“Ah,” says Princess Agata, about to object, and Triss beams at her and barrels on, rolling over any and all objections like a runaway cart, showing each noblewoman to a separate set of brewing equipment and giving crisp instructions as to what to do with the truly disgusting ingredients laid out waiting.\nJaskier has spent a large number of afternoons helping Triss with her potions, and has almost gotten used to handling ghoul blood and sewant mushrooms and archespore juice and so on, though he certainly doesn’t enjoy it. Ciri seems not to mind the smell, nor the odd unpleasant viscosity, nor the fact that without proper precautions, several of the ingredients will eat through wood and skin and leave terrible burn scars; but then, Ciri’s been learning alchemy since she was six.\nThe noblewomen, used to rosewater and lavender extract, beeswax and distilled oils, look at the potions ingredients with unconcealed horror. “This is hardly appropriate labor for a princess,” Princess Agata begins, and then stops, mouth open in dismay, as Ciri hops up on a stool beside Triss and begins chopping a bundle of some sort of herb or other without any hesitation.\n“Very well,” says Marta de Roggeven, nose wrinkled in disgust, and steps forward to imitate Ciri. Jaskier decides that he’s reluctantly impressed, and also that if he sticks around much longer he’ll probably have to start dealing with wyvern liver or something equally appealing, and slips quietly out the door, winking at Yen as he goes.\nShe’s got it all under control.\n*\nJaskier could go and try to get some composing done, but instead, he heads for the wing where the noblewomen have been given rooms, and is lucky enough to run across exactly who he was looking for in the hallway, without having to start knocking on doors and disturbing people.\nMilena smiles at him and curtsies a little. “Bard Jaskier! Are you looking for Marta?”\n“Actually, I was looking for you,” Jaskier says. “Would you like to take a little walk, and see more of Kaer Morhen with me?”\n“I would be delighted,” Milena says, and falls in beside him. He’s not going to show her anything particularly secret, of course, but there’s a lovely view from the walltops, all craggy mountains and endless vistas and the training grounds full of Witchers doing impossible feats of acrobatics and strength.\n“And how do you find Kaer Morhen thus far?” Jaskier asks.\nMilena grimaces. “Cold,” she says, a little plaintively. “I had no idea it would be this cold in the summer. We all packed our lightest gowns.”\nJaskier winces. “Oh dear! I can lend you a coat, if you like.”\nMilena nods, looking sheepish and hopeful, and Jaskier leads her first up to his suite, thankful that he has left at least a little of his wardrobe here instead of moving it all to Geralt’s rooms. There’s a coat that’s a little too small for his shoulders but fits Milena quite handily, and she looks much happier as she burrows down into it.\n“Lead on,” she says, smiling at him, and Jaskier offers her his arm in proper courtly fashion, grinning when she laughs.\nIt is, thankfully, not too windy, so the walltops aren’t so bitingly cold as to be utterly uninhabitable by normal humans. Jaskier leads Milena along until they’re overlooking the training grounds and lounges against a merlon as she stares in wonder at the mountains, the deep gorge of the river, and the hundreds of men - and a very few women - sparring below.\n“Ye gods,” she whispers after a moment. “That man just - how?”\nJaskier peers over to see what she’s staring at, and grins at the sight of a pair of Cat Witchers wrestling. The Cats are the most acrobatic, he’s found; these two appear to be competing for how high they can get up the walls before leaping down onto each other like mountain lions pouncing on their prey. Admittedly, the first time he saw a Witcher go bounding ten feet up a sheer wall without any apparent effort, he nearly fell over from the shock.\n“Yep, they do that,” he says, and Milena laughs incredulously. “Oh, hey,” he adds, pointing. “Look, there’s Lambert.”\nTo his utter delight, Milena’s cheeks go pink as she turns to follow his finger. Lambert is facing off against Coën, both of them holding daggers instead of swords, and as Jaskier and Milena watch, Lambert lunges forward into a rolling somersault that brings him up behind Coën, who whirls to meet him in a clash of steel. Milena squeaks and plasters both hands across her mouth, staring in horror that turns slowly into a sort of awed wonder as the mock-battle goes on. Lambert and Coën are reasonably well matched, from what Jaskier has been able to gather; certainly they keep going for a while, as the Witchers around them applaud or wince at particularly clever moves. Milena squeaks again the first time one of them draws blood, and Jaskier pats her on the shoulder.\n“Witchers heal fast,” he assures her. “He’ll be good as new by the time supper rolls around, from a little cut like that, at least.”\n“Oh good,” Milena says, relaxing a little, and gives Jaskier a sort of sidelong hopeful glance. “Lambert’s a - a very strange man,” she offers.\n“He’s an asshole,” Jaskier corrects her. “But I’m very fond of him.”\n“And he of you,” she says. “He was very angry at your father.”\nJaskier winces. “Yes, well, water under the bridge now,” he says. “But yes! I like to think we’re quite good friends by now. He’s a good man, under all the prickles, but gods above, he’s such an ass sometimes.”\n“He does swear a lot,” Milena says. “I think I learned about a dozen new words while he was carrying me back from that dreadful hunting trip yesterday.”\n“Only a dozen? He must have been watching his tongue,” Jaskier says, and Milena giggles incredulously. “I’ve certainly learned several, and I thought Oxenfurt had taught me every filthy word known to man, and most of the elven ones, too.”\nMilena laughs so hard she has to lean on the wall for a bit before she catches her breath. “You like it here,” she says once she’s gotten her composure back. “You like the Witchers, and this incredibly imposing castle. You’re happy.”\n“Yes,” Jaskier says. It’s true. He’s happier here even than he was in Oxenfurt, because no one here expects him to be anything other than exactly what he is - and he is loved for it.\nMilena sighs. “Even if Marta can swear to everything on that list of requirements, she’d never be happy here. She likes court life, and this is nothing like Redania’s court.”\n“Should you really be telling me that?” Jaskier asks. “You must know I don’t want any of the ladies to win Geralt’s hand.”\nMilena snorts. “Marta thinks she’s got a chance, but I’ve got eyes. The White Wolf dotes on you. So do all the other Witchers, and that absolutely terrifying sorceress.”\n“I am going to tell Yen you called her terrifying, and she will immediately adore you,” Jaskier informs her.\n“Thank you, I think.” Milena grins. “But anyhow, there’s no way in the world the White Wolf is going to put you aside, so…” She shrugs. “I don’t think Marta’s going to give up until she has to, but she’s not going to win him, and neither is that dreadful princess or anyone else. So it’s not like I’m ruining her chances by talking to you.”\n“I’m not sure she’d see it that way, but I shan’t tell her,” Jaskier says. Down below, Lambert manages to knock one of Coën’s knives flying, and Milena leans out between the merlons, eyes wide. Jaskier grins and stays silent as the bout comes to an end in a sudden flurry of kicks and punches and another flash of steel, and Lambert ends up sitting on his friend’s chest, knife to Coën’s throat. There’s a brief, breathless pause, and then Coën says something - inaudible at this distance - and Lambert bellows with laughter and rolls to his feet and offers Coën a hand up, and they clap each other on the back as the other Witchers cheer.\n“He’s very skilled,” Milena observes. “He was doing knife tricks at the court, too.”\n“He is that,” Jaskier agrees. He doesn’t want to say too much, lest she or Lambert or both of them realize how dreadfully adorable they’re being, but really, he is absolutely charmed by the fact that they appear to have managed to develop feelings for each other in the course of a single night and a rather disastrous day of hunting. “He dances well, too. Should I play some dancing tunes tonight?”\nMilena blushes. “I wouldn’t dare ask him to dance.”\n“Witchers don’t stand on ceremony,” Jaskier says, which is an understatement of possibly epic proportions. “He wouldn’t mind. And you could tell your sister you’re trying to ingratiate yourself with the Warlord’s court, so as to help her chances.” Which might, indeed, be exactly what she’s doing right now, but Jaskier considers himself a fairly good judge of character, and he’s fairly sure she’s just what she seems: a young woman who has had a rude awakening to the truth of court politics, and also has started to develop an infatuation - or perhaps more - with the least likely Witcher in Kaer Morhen.\nMilena blushes harder, but she also nods. “If - if you do play a dancing tune, then I - I’ll ask him. At least if he’s not interested he’ll probably just say so.”\n“Witchers don’t lie well,” Jaskier says. “But don’t fret. If nothing else, I don’t think Lambert will ever turn down a chance to dance with a pretty lady.”\n*\nThe noblewomen look even less happy with their lives when they sit down for supper. They’ve clearly bathed, but they all look like they can still smell the foul ingredients they’ve been working with all afternoon, and they give Triss and Yen truly unfriendly glares. Yen ignores them, looking like the cat who got the canary, the cream, and the fish set aside for dinner, too; Triss grins at them unrepentantly. Geralt takes a long look at the whole tableau as he takes his place at the table and clearly decides he doesn’t want to know or get involved. Sensible man.\nThis isn’t a war Witchers are equipped to fight, but between Yen, Triss, Ciri, and Jaskier himself, Jaskier’s pretty sure their victory is going to be both inevitable and crushingly thorough.\n“What did Yen do to the ladies?” Eskel murmurs under the general buzz of conversation once the meal starts.\n“Potions,” Jaskier replies, and Eskel winces.\n“Think we’ll lose any more tonight, then?”\nJaskier hums, surveying the remaining five consort-hopefuls thoughtfully. “Not the princess, nor the marchioness,” he decides at last. “Maybe one of the countesses. They’re high enough rank to have good prospects back home, but not high enough that they’re likely to really believe they’ve a chance at Geralt.”\n“Not the viscountess?” Lambert asks.\n“If she hasn’t left by now, she must be so ambitious she’s willing to stick it out all the way to the end,” Jaskier says, shaking his head.\n“Huh,” Lambert says, and subsides into unwonted silence. Jaskier follows his gaze and hides a grin. Over at the noblewomen’s table, Milena de Roggeven is shooting surreptitious looks up towards the Wolf Witchers, and Lambert is watching her like - well, like a wolf eyeing a rustle in the bushes, not sure if it’s predator or prey or nothing but the wind.\nJaskier catches Eskel’s eye and tilts his head, just a little, and Eskel nods very slightly and hides a smile behind his mug of ale. He sees it, too.\nAs soon as the meal is over, Jaskier stands, and into the flattering silence announces that it’s a lovely night for some dancing. The Witchers cheer and start moving tables to make a dancing floor, grabbing preferred partners from among their friends and lovers. Several of the Witchers Jaskier knows have rather pointed senses of humor move towards the noblewomen, who look, for the most part, appalled. Princess Agata glances up towards Geralt, clearly hoping he will partner her, and is instantly furious when Ciri takes her father’s hand and pulls him out to the dance floor.\nAnd Milena squares her shoulders, rises, and comes up to the Wolf table, facing Lambert across the oaken board. “Would - would you do me the honor of this dance?” she asks, voice a little shaky but quite clear.\nLambert makes a noise like a mouse being stepped on, and goes quite red. Jaskier kicks him gently under the table. Lambert swallows hard and says, “Yes!” rather louder than he clearly meant to, and then stands and vaults the table, landing beside Milena with a gentle thump. Milena looks rather startled by this, but she offers her hand, and Lambert takes it.\nJaskier strikes up a dancing tune, grinning fit to burst.\n*\nThe next day, Eskel offers to give the ladies a tour of Kaer Morhen, which involves a great deal of climbing up and down narrow twisty stairs at a pace a Witcher finds comfortable, and all of them choose to spend the afternoon in their rooms rather than see what other delights the keep might have to offer.\nNone of them leave, though. Jaskier’s not sure how many more “friendly” ways of dissuading the consort-hopefuls Yen may have come up with, but he’s starting to run dry. It doesn’t help that he likes Kaer Morhen, and finds the Witchers good company; it’s hard to remember, these days, how terrifying everything was back when he first arrived.\nHe gets to supper a bit early, and finds Geralt already there; the White Wolf smiles almost imperceptibly and beckons Jaskier over with a tilt of his head, and Jaskier perches on the arm of his chair and grins down at him. Geralt wraps an arm around Jaskier’s waist and leans his head against Jaskier’s shoulder contentedly.\n“I see you haven’t run off up the mountains again, my wolf,” Jaskier teases gently, and Geralt rumbles softly in amusement.\n“Not yet,” he agrees. “Soon, maybe.”\nJaskier snickers. “Big strong wolf running from a bunch of husband-hunters,” he murmurs, running a hand through Geralt’s hair and grinning wider when Geralt hums and leans into the caress. “I won’t let them catch you.”\n“My hero,” Geralt says, very dryly, and Jaskier chuckles and shakes his head.\n“I’m honestly happy just being your lark,” he admits.\n“My little lark,” Geralt says, low and sweet. “Always.”\nJaskier shivers with pleasure, and Geralt’s lips tilt up at his reaction.\nThe hall starts to fill, and Jaskier leans down to brush a kiss against Geralt’s lips and slides off the arm of his chair to go find his own seat. Geralt rises to watch his people as they flood into the hall, still wearing that tiny smile, and Jaskier can see the Witchers assessing their leader’s temper and finding it good. Hm, this might be a good night for one of the Wolf Rising songs, something to keep everyone feeling cheerful and upbeat and heroic.\nThe food is brought out, and Jaskier takes a large helping of stew and elbows Lambert to pass him the rolls - seriously, Witcher or not, he doesn’t need the whole basket - and he’s in the middle of a rather silly game of grab-the-rolls when he hears Geralt growl.\nThe entire Wolf table goes still, and Jaskier turns, very carefully, to look at his lover. The tense quiet spreads through the hall, until everyone is staring up at the head table in worry and dismay.\nGeralt’s eyes are blown black, and he’s looking down at his ale with a frown like a thunderstorm. “Yen,” he rumbles, and Yen stands and comes to his side, leaning down to spread a glowing hand over his mug. Her look of worry turns to anger. Oh fuck, angry sorceress, not good.\n“Love potion,” she says bluntly. “Quadruple strength. Go.”\nGeralt nods and stands, and looks at Jaskier. There’s a question in his eyes.\nJaskier swallows hard. Love potion - Triss has told him a bit about those. They’re often nothing more than lust potions with designated targets, and don’t work terribly well against people who are already in love. Witchers are mostly immune to poison, and Jaskier has to assume the targeted nature of this potion has been deflected, either by Witcher metabolism or - flattering thought - by Geralt’s own feelings for Jaskier. But the blown-wide eyes and expression of ravenous hunger under very strained control suggest that the lust portion is working quite well.\nIf Jaskier goes with him, he’ll be going to bed with a Witcher whose inhibitions have been completely dismantled. Geralt won’t blame him if he refuses, he knows; indeed, Geralt is likely to feel hideously guilty even for asking once he gets his wits properly back.\nBut Jaskier is not afraid of the White Wolf anymore. Inhibitions or no, he can’t find even a shred of worry in his soul that Geralt will ever do him harm. He might come out of tonight bruised and sore from a truly epic night, but nothing worse than that.\nHe rises, clapping Eskel on the shoulder, and goes to his lover, proud and unafraid.\nGeralt picks him up, the ridiculous man, scoops him up in his arms and leaves the hall at a brisk trot. Jaskier waves over Geralt’s shoulder before the door closes, and sees that Eskel has risen and he and Yen are clearly starting to get the situation under control. So that’s alright, then; by the time this potion wears off, they’ll doubtless have found the culprit. Jaskier doesn’t have to worry about anything but the Witcher currently carrying him off like a war-prize.\nHe wraps his arms around Geralt’s neck and nuzzles the line of his throat, and Geralt makes a low, happy sound. Yep, Jaskier was completely right. Even like this, the White Wolf of the North is a complete sweetheart.\n*\nGeralt dumps Jaskier fairly gently on the bed, and Jaskier immediately starts scrambling out of his clothing, because he likes this outfit, and even on a good day Geralt is sometimes in a clothes-ripping mood. It’s appealing as hell, of course, but also hard on Jaskier’s wardrobe. Thankfully, Geralt is busy ripping his own clothing off, and Jaskier is down to his smallclothes and chemise by the time Geralt is nude. Those, well, the very nice seamstress who makes his clothes already knows he goes through more chemises than anyone really ought to, and teases him about it regularly.\nGeralt pounces, it’s really the only word for it, and pins Jaskier to the bed without even bothering to strip him, kissing him hungrily. Jaskier winds his arms and legs around Geralt and kisses back, of course. He can’t imagine a situation where he wouldn’t kiss back. “My wolf,” he murmurs, when Geralt pulls away to bite kisses down his throat. “Can you still talk, or have you gone completely feral, my love?”\nGeralt rumbles softly. “Can talk,” he says at last, having worried a spectacular lovebite into the skin of Jaskier’s throat. “Little lark. Lust potion. Won’t hurt you.”\n“Can talk and knows what’s going on,” Jaskier says, delighted. “And I know you won’t hurt me.”\nGeralt takes a deep breath and makes a contented rumbling noise. “No fear.”\n“No, no fear,” Jaskier says, stroking his hair back and grinning up into blown-black eyes, the thin rings of gold like the sun in an eclipse. “I will never fear you again, my wolf.”\n“Good,” Geralt growls, and that’s apparently all the words he’s got left to him, because he takes Jaskier’s lips in a ravenous kiss, ripping Jaskier’s few remaining clothes from him as he quite effectively drives every thought except Oh fuck yes from Jaskier’s mind.\nThe main difference between Geralt sober and Geralt strung out on lust potion, Jaskier decides after a few minutes of incoherent moaning, is that Geralt is a lot bitier like this. He never breaks skin, not Jaskier’s wolf, but he seems very pleased by the marks he leaves scattered over Jaskier’s body. Jaskier lets himself be rearranged and caressed and nibbled on, squeaking or moaning as the occasion seems to require, and then although he really ought to have expected it swears vociferously when Geralt swallows his prick like it’s water in the desert.\nIt is really, really not fair that Geralt can be so good at this even while completely stoned on lust potion. Jaskier tangles his hands in moon-white hair and tries to buck his hips - and fails miserably, Geralt’s hands holding him perfectly still - and swears loudly and creatively. “Someday I am going to get you to tell me how you got so fucking good at this,” he manages to gasp out, and Geralt growls and yep, alright, that’s enough to shove Jaskier over his peak. Geralt seems to enjoy the noise he makes, at least judging by the happy little rumbles.\nAnd then Geralt flips Jaskier over onto his front and tugs at him until Jaskier’s on his knees, ass in the air. This is a good position, Jaskier is fond of it, he has many good memories of very pleasant evenings spent like this, but he’s a little worried that Geralt may have forgotten the use of oil -\nGeralt’s tongue swipes up along his crease, and Jaskier yelps in shock. That’s new, oh fuck that’s new, neither of them has even suggested this before, and apparently that was a really regrettable oversight, because oh fucking gods Geralt has a clever tongue. Jaskier buries his face in a pillow and spreads his legs a little wider and whimpers desperately as Geralt kisses him open as ardently as he’s ever kissed Jaskier’s mouth. Geralt is growling happily, hands gentle but implacable on Jaskier’s ass, and Jaskier isn’t sure he’s ever felt more like the White Wolf’s prey than he does right now.\nFor the record, he is very happy to be devoured.\nHe devolves into incoherent begging a little faster than he’d really like to admit, but Geralt doesn’t seem to notice, just keeps licking, filthy and ravenous, until Jaskier is almost ready to come again - and then a broad, callused hand wraps around Jaskier’s prick and he does come again, so hard it’s almost painful, and flops down against the sheets in a limp heap.\nGeralt purrs with satisfaction.\nAnd then, of course, he finds the oil.\nJaskier spreads his legs as wide as they’ll go and moans quietly into the pillow. It’s too much, and it’s so good, and Geralt’s fingers feel even larger than they usually do, and really he should have guessed that a lust-drunk Geralt would want to wring him completely dry, render him speechless with overwhelming pleasure.\nGeralt takes his time opening Jaskier up, humming happily whenever he hits that one golden spot and Jaskier twitches and moans, until finally - well after Jaskier has come to the same conclusion - he decides Jaskier is loose enough, and ranges over him, prick pressing down and in, his breath hot on the back of Jaskier’s neck. Jaskier whines and wriggles, trying to get Geralt in him already, and Geralt growls and pins him flat with one big hand spread over Jaskier’s back and holds him still as he fucks into him so damn slowly it’s maddening.\nFucking. Witcher. Self-control.\nThank every god, once he’s buried deep in Jaskier, Geralt takes a long slow breath, and plants his elbows on either side of Jaskier’s shoulders, and begins to fuck him properly. It’s overwhelming and astonishing and so fucking good, and Jaskier does his best to push up on his knees to help and finds himself pinned down again by Geralt’s body, Geralt’s teeth against his shoulder, a low growl reverberating from Geralt’s chest. Right, apparently he’s just to hold still and be - oh gods - fucked through the mattress, that’s fine, he can do that, he can absolutely do that -\nOne of Geralt’s arms wraps around his waist, and his hand closes around Jaskier’s prick. “Oh fuck,” Jaskier gasps, “I can’t - three, I can’t -”\n“Little lark,” Geralt rasps.\n“Sweet - fuck - sweet words don’t change the fact that I am only human and - oh fuck -” Jaskier whines through clenched teeth as Geralt hits that spot with distressingly perfect accuracy.\n“For me,” Geralt coaxes, and Jaskier grabs at the sheets and wails with sharp-edged pleasure as he topples over his peak and straight into white unconsciousness.\n*\nJaskier wakes up wrapped in warm blankets and warmer arms, his head pillowed on a broad chest. He is sore, but not nearly as much as he thought he might be. He raises his head to check on Geralt, and meets golden eyes. “Little lark,” Geralt murmurs.\n“My wolf,” Jaskier says, smiling. “Back to yourself, I see.”\n“Hm,” Geralt agrees, and traces a finger over the livid bite-bruise on Jaskier’s throat. “Sorry.”\n“Nope, none of that,” Jaskier says briskly, settling down a little more comfortably. “I knew what I was volunteering for, and I enjoyed every bit of it. You’re a very considerate lover even stoned on lust potion.”\nGeralt hums. “Can’t hurt my lark,” he says simply.\nJaskier sighs happily. “My sweet wolf,” he says.\n“Hm,” Geralt says, and nuzzles Jaskier’s hair gently. “Sleep, lark. Wore you out.”\nJaskier chuckles. “Yes,” he says, letting his eyes fall closed. “Damn Witcher stamina…”\nHe falls asleep before Geralt can reply.\n“Damn, buttercup,” Lambert says at dinner the next day - Jaskier slept right through breakfast and his morning lessons with Ciri; hopefully the little menace didn’t get into too much trouble. “You look ridden hard and put up wet.”\nJaskier gives Lambert his best glare and sits down rather gingerly, discovering that some kind soul has left a cushion on his chair. “I had a very pleasant evening, thank you,” he informs Lambert, who snickers and reaches over to tap a finger very gently against the only mark Jaskier can’t hide, the livid bite-mark on his throat.\n“Wolf marked you right and proper, didn’t he.”\nJaskier raises an eyebrow at him and taps a finger on his own medallion. “So he has.”\nLambert shakes his head. “Good on you, buttercup,” he says, and raises his mug of ale in a little toast.\n“So, did Yen figure out who was stupid enough to try to drug the White Wolf?” Jaskier asks.\n“Oh, yes,” Lambert says, with a sharp and nasty grin. “That viscountess. Snuck into the kitchens while she was supposed to be napping, so she did. Clever. Just not clever enough.”\nJaskier glances over at the noblewomen’s table, seeing that Viscountess Anastazja is, in fact, not there. “Kicked out this morning?”\n“Nope,” Lambert says, grin getting wider and nastier. “Last night, soon as Yen pointed her out. Eskel tossed her out the gates himself. Good luck to her getting down the Trail in the dark.”\nJaskier winces, but only a little. Really, for a stupid trick like that, she’s lucky she’s alive. If she’d tried that on a human monarch…\nWell, if she’d tried that on a human monarch without a good sorcerer in his court, she’d have spent the night in his bed. But having completely failed to grasp the concept that Witchers don’t react like humans do demonstrates a certain level of wilful blindness.\nEskel settles into the seat on Jaskier’s other side. “You doing alright, then?”\n“Just fine, thank you,” Jaskier says, grinning at him. “Hear you tossed the viscountess out the gates?”\n“Should’ve tossed her harder,” Eskel grumbles. “Little idiot. Even if she’d gotten what she wanted, how did she think that was going to go? White Wolf having her in the middle of the damned hall?”\nJaskier imagines that and winces. “Not the best plan in the world,” he agrees dryly.\n“Nobles,” Eskel sighs. “More fucking trouble than they’re worth.”\nJaskier grins. “I resemble that remark.”\n“Hmph,” Eskel says, and shoves a platter of mutton closer to Jaskier. “You’re a fucking lot less trouble than they are. Always have been.”\nThe words warm Jaskier down to his bones, and he turns his attention to the mutton, knowing his cheeks are pink with pleased embarrassment.\nThe rest of the day, thank the gods, is utterly uneventful; Jaskier squirrels himself away in his rooms to compose for the whole afternoon, taking occasional breaks to dab bits of Triss’s miraculous bruise balm on the tenderest marks Geralt left, and at supper nothing untoward happens at all. After supper he plays dance music without getting up - bless whoever left him this cushion, really - and Lambert asks Milena to dance, which is fucking adorable, and Geralt spends the whole evening standing behind Jaskier’s chair toying with his hair, and then carries him off to bed again and spends an hour smoothing bruise balm over what seems like every inch of Jaskier’s skin and then cuddles him close and makes happy rumbling noises until Jaskier falls asleep.\nJaskier is never telling anyone else how cuddly the White Wolf, terror of the continent, Warlord of the North, really is. There’s making Geralt’s reputation more heroic, and there’s completely ruining his terrifying mystique, and Jaskier’s only in the business of doing one of those things.\n*\nSomewhat to Jaskier’s surprise, Yen appears to have put a brief hiatus in her plans to drive the noblewomen away. As best Jaskier can figure out, she’s letting the reality of everyday life in Kaer Morhen suffice as a deterrent: cold stone, plain meals, communal bathing, and the constant company of hundreds of Witchers. (And, of course, dealing with Ciri, who is in fine form. She manages to pull off the goose trick again, paints every horse in the stables green, and sweet-talks the cooks into serving a supper that’s mostly beans, making for a particularly redolent and loud evening in the great hall. And that’s just in the first week. Jaskier suspects Eskel and Lambert are aiding and abetting shamelessly.) It’s a sound strategy, Jaskier thinks: the noblewomen are definitely not getting any fonder of the keep or its inhabitants. Jaskier may not be able to smell fear, but he’s reasonably sure that only one of the ladies currently within Kaer Morhen’s walls has stopped fearing Witchers, and she’s not one of the ones angling for Geralt’s hand.\nPretty much everyone except the noblewomen has noticed that Milena de Roggeven and Lambert spend an awful lot of time making cow eyes at each other. Jaskier thinks it’s adorable; Yen and Eskel think it’s hilarious; Ciri thinks it’s sweet; and Geralt is withholding an opinion until he knows how badly the whole thing is going to blow up, which is fair.\nJaskier himself would be more worried, except that Milena has taken to coming to find him every few days and asking if he’d walk with her, and by the third time they end up leaning on a pair of merlons watching the Witchers beat each other up and laughing at each other’s jokes, he realizes that Milena is, astonishingly and unexpectedly, a friend. It’s sort of nice to have a friend who is younger than he is, for a change, and who looks up to him a little. And it’s positively adorable the way she always seeks out Lambert from their vantage point on the walls, and watches him eagerly as he spars or heckles the others, her hands clasped over her mouth every time it looks like he might get hurt.\n“Do remember he’ll have healed by supper,” he reminds her one afternoon three weeks after the noblewomen first arrived.\n“Yes, but it probably hurts now,” Milena retorts, as Lambert spits blood and - probably, though Jaskier can’t be completely certain given he’s too far away to hear - swears.\n“True,” Jaskier allows. Lambert, across the training fields, punches Cedric in the face, and the sparring match devolves into a sort of very undignified wrestling match instead. Milena giggles.\n“I’ll grant you he doesn’t seem to mind,” she says. “I keep trying to talk to him, you know, and it doesn’t seem to work.”\n“Oh?” Jaskier asks. “While you’re dancing, you mean?”\n“That, but - I asked if there were gardens we could walk in, and he said something about poisonous plants; and I asked if he had a favorite spot in the keep, and he said ‘the baths’ and then went red and ran away; and I asked if he knew any poetry, and he choked a bit and then pretty much flung me at Eskel. I’m not sure what I’m doing wrong.”\n“Oh, darling,” Jaskier says, charmed beyond words. Any nobleman of Redania - or any other court, for that matter - would have been delighted by such encouraging words from a pretty and well-born lady, and would have taken great pleasure in promenading through formal gardens, or escorting her to the library or a particularly scenic balcony, or reciting love sonnets on bended knee. Witchers, however…\n“Witchers don’t court like that,” he tells her gently, and a little imp of mischief - and, admittedly, the strong desire to encourage this truly adorable little love story - has him adding, “Ask him to teach you to use a dagger. And I suppose you could join him in the baths.”\nMilena goes beet-red and claps her hands to her cheeks. “You’re dreadful,” she squeaks. “I couldn’t!”\nJaskier looks at her thoughtfully for a long moment. Finally he settles back against the merlon a little more comfortably and says, “Milena. Is this just a flirtation, or do you actually want a Wolf of your own?”\nMilena swallows hard. “My father would be furious,” she says faintly.\n“Not what I asked,” Jaskier says. “And if you stayed here, your father could be furious all he liked, but he couldn’t do a damn thing about it, not without pissing off an entire keep full of Witchers, which is not a wise choice. Do you want more than a month’s pleasant flirtation?”\nMilena looks away, down at Lambert where he’s flopped out on his back beside Cedric, both of them bloody-nosed and laughing. “He’s such an ass,” she says softly. “He swears worse than anyone else I’ve ever met, and he yells so much, and - oh, fuck it, I really do want him, Jaskier.” She looks taken aback at her own vehemence for a moment, then squares her shoulders and meets Jaskier’s eyes. “He’s honest, and he cares, and he’d never be the sort of - of wicked little sneak that half the people in King Vizimir’s court are, and under all the prickly he’s so kind, even if he refuses to let anyone acknowledge it. He volunteered to carry me down the mountain, you know. And he glares at anyone who tries to dance with me as a joke, or to make me uncomfortable.” She swallows again. “And I like Kaer Morhen better than I do the Redanian court. It’s so much more - straightforward. There’s no nasty little conspiracies and gossip and ugly little secrets that only come out at the worst possible time and - Marta likes playing the game, but I don’t. I hate it. And if I go back, Father will marry me off to some dreadful old count or other, and I’ll have to keep playing the game until I die in childbed or get lucky enough to become a widow, and I -”\nShe breaks off, breathing hard, and Jaskier waits patiently for her to put her thoughts in order.\n“I’d far rather stay here, and be one of the White Wolf’s court, and - and learn to use a dagger, if you think Lambert would teach me, and how to help with those awful potions, and maybe learn how Witchers court,” she says at last. “Maybe it wouldn’t work, me and Lambert - I don’t know what he’d see in me - but -” She gives a little sniffly sort of chuckle. “I don’t suppose you need a lady-in-waiting?”\nJaskier hums. He certainly doesn’t need a lady-in-waiting, but Ciri, now. She’s getting to about the age when she really should have someone to help her with her hair and wardrobe when she wants to be fancy. If Milena is telling the truth - which Jaskier thinks she is, but he’s not fool enough to lay money on it without getting her to say all this again where a Witcher can hear - if Milena is telling the truth, there could be a place for her here, even if she doesn’t end up being Lambert’s lover.\n“You should ask him for dagger lessons,” he says at last. “And I’ll talk to Geralt. I can think of at least one position here that you would fit quite beautifully, and if you’re willing to swear before a Witcher that you’ll be loyal to the Wolf, I think Geralt would let you stay.”\n“Oh, thank you,” Milena squeaks. “Thank you, thank you -”\nJaskier chuckles and pats her on the shoulder. “It’s no trouble,” he assures her. “None at all.”\nHe walks her down to the noblewomen’s wing, and leaves her at the door to her room like a proper gentleman, and heads up to his own rooms to spend a couple of hours composing - maybe something about a particularly growly wolf and a sweet little dove, something like that -\nAnd he’s a corridor away from his own door when a woman’s voice behind him says, “I’ve had enough of this farce.”\nThen there’s just quite a lot of pain.\n*\nJaskier wakes up in Geralt’s bed, which is odd, because he distinctly remembers being on his way to his own rooms. He’s also very sore, and not in the ‘just had energetic and delightful sex’ sort of way. More in a...pointy sort of way.\nHe looks down at himself, and yep, his stomach is wrapped in bandages, and now that he thinks about it, he can smell healing salves, pungent and faintly unpleasant.\nGeralt, interestingly and rather distressingly, is nowhere to be found, but Ciri is sleeping in a chair beside the bed, and Eskel is sitting on the hearth, whetting his steel sword. Jaskier makes a little sound, and Eskel stands in a single smooth motion and comes to the side of the bed.\n“Water?” Jaskier asks quietly, not wanting to wake Ciri, who looks exhausted and unhappy - there are tear-streaks on her cheeks, and her hair is a mess.\nEskel fetches a mug of water from the bedside table and helps Jaskier raise his head enough to sip at it. It’s cool and sweet and good, and Jaskier pouts a little when Eskel takes the mug away.\n“Can’t have too much at once,” Eskel says softly.\n“What happened?” Jaskier asks as Eskel lowers him back to the pillows. “Is Geralt alright?”\n“The Wolf’s just fine,” Eskel assures him. “Furious, but fine. What happened is you were stabbed.”\n“Oh,” Jaskier says. “Ow. No wonder it hurt so much. Who?”\nEskel snarls a little. “Princess Agata.”\n“Oh,” Jaskier says again. “Oops. Is she dead?”\n“I have never seen our Wolf so angry,” Eskel says, sitting down beside Jaskier on the bed. “But he didn’t kill her. He clapped her in irons and had Yen make him a portal to Vizima. I believe he is currently expressing his extreme displeasure to the king.” He pats Jaskier’s hand gently. “He’ll be back soon. He didn’t leave until he knew you’d be alright.”\n“That’s...very kind of him, I think,” Jaskier says. He doesn’t particularly want Agata dead, even now, but imagining her and her father both facing the full fury of the Wolf is very pleasant. “How many did he take with him?”\n“Thirty,” Eskel says, and grins fiercely as Jaskier’s eyes go wide. “He isn’t going to have any trouble.”\nThirty Witchers isn’t a diplomatic envoy or even a pointed expression of distrust, it’s a fucking invasion force, and the current king of Temeria will be perfectly aware of that. If he says even one thing wrong, Jaskier might end up having to amend Geralt’s list of titles again.\nWell, good. Fuck the king of Temeria and his stabby daughter anyhow.\n“The rest of the ladies?” he checks.\n“Leaving tomorrow, if I’ve anything to say about it, which I do,” Eskel growls. “They’re one and all terrified of us anyhow; another week won’t solve that. There’s no way any of them could ever hope to be the Warlord’s Consort. Fuck this charade.”\nJaskier nods, and then thinks of something. “Milena de Roggeven,” he says.\n“What of her?”\n“Have her swear her loyalty to the Wolf, and if she can, let her stay,” Jaskier says. “I think she will.”\n“Huh,” Eskel says, frowning a little. “She doesn’t smell half as scared as the rest of them, come to think of it. And I don’t think she’s after Geralt.”\n“Nope,” Jaskier says, mustering a cheeky grin from somewhere. “She knows he’s all mine.”\n“Hm,” Eskel says. “I’ll give her the chance, then, and if she can swear her loyalty, I’ll say you vouched for her and she can stay.”\n“Thank you,” Jaskier says, and feels his eyelids start to grow heavy. “Triss heal me?”\n“Yes, but you lost a lot of blood. Don’t even think about moving until tomorrow,” Eskel orders him. There’s a soft creak as the door opens, and Jaskier peeks out through lead-heavy lashes to see Aubry enter. “I’ve got to go keep order,” Eskel says softly. “Heal fast, my friend. We can’t lose you.”\nJaskier pats Eskel’s hand clumsily. “I’ll be good, I promise,” he slurs. “Go be scary.”\nEskel chuckles. “I will,” he says, and leans down to brush a kiss against Jaskier’s forehead, and is gone. Aubry settles in the spot he left, warm and solid and comfortingly dangerous, and Jaskier falls asleep thinking how very lucky he is in his friends.\n*\nWhen he wakes again, Geralt is sitting in the armchair beside the bed, Ciri asleep in his lap. Those golden eyes are fixed on Jaskier, and as soon as Geralt sees that Jaskier is awake, he rises and puts Ciri gently down on the armchair’s seat and moves to sit at Jaskier’s side.\n“Water?” he asks, and Jaskier nods, and is gently lifted so he can sip at the mug of water again.\n“How’d Temeria go?” he asks once Geralt lowers him back to the pillows.\nGeralt’s lips peel back in a silent snarl. “I didn’t kill anyone,” he says. “But we definitely put the fear of the Wolf into that fool of a king. With luck, he’ll remember not to piss me off again. And Agata is now an acolyte of Melitele.” His snarl gets toothier. “Under a vow of silence, poverty, and never again touching any sort of blade.”\nJaskier smiles. “Vicious,” he says, pleased. “Thank you.”\nGeralt bends down to brush a very gentle kiss across Jaskier’s lips. “If she had killed you, I would have sacked Vizima,” he says softly. “You mustn’t die, my lark.”\n“I’ll do my best,” Jaskier promises, and yawns. This magical healing business is apparently exhausting. “Hm. Try not to scare Milena out of her wits tomorrow. Or is it today?”\nHis eyes slide closed again, but he does hear Geralt promise, “I’ll try, little lark. For you.”\n*\nThe third time Jaskier wakes up, he actually feels like he might stay awake for more than five minutes, and Ciri is also awake. She’s also playing Gwent with Milena on the wide stretch of bed beside Jaskier - this really is an absurdly large bed, but then, Geralt is a fairly large man, and what’s the point of being a Warlord if you can’t have the nicest bed in three kingdoms?\nJaskier must make some sound, because Ciri looks up from the game and squeals with glee, and comes scrambling over to sit beside him. It jostles the bed a bit, but thankfully Triss does good work; Jaskier doesn’t feel anything worse than a very faint ache from his bandage-covered midsection.\n“You’re alright!” Ciri says. “You are alright, right, Jaskier?”\n“Princess, let him breathe,” Milena says, coming around the bed to help Jaskier sit up. “Water? Are you in pain?”\n“Water would be nice, thank you,” Jaskier says, and makes a quick internal assessment. Still nothing but vague aches. Bless Triss and all her works. “Ciri, I’m fine; Triss fixed me up very well. Are you alright?”\n“I’m fine,” Ciri says. “But you were so - there was so much blood - and you weren’t moving -”\nShe bursts into tears, and Jaskier wraps an arm around her and lets her cry on his shoulder, petting her hair gently. Poor thing; every other person around her could just get up and go about their day after a wound like that, Jaskier knows, maybe with a couple of stitches or a swallow of healing potion. But Jaskier is a poor squishy ordinary human, and could have died of being stabbed, which Ciri is not used to dealing with.\n“I’m alright, cub,” Jaskier murmurs, kissing her messy hair. “I’m alright, and the person who did this will never be anywhere near me again. For that matter, I suspect Geralt’s going to make sure there’s a Witcher within arm’s length of me anytime there’s any strangers in the keep for the rest of my life. Or anytime I leave the keep, but he was doing that anyway - oh, my darling cub, shh, shh, I’m alright, I’m alright, it’s going to be fine.” He rocks her gently, letting the words trail away into a hummed lullaby, and Ciri goes from wretched sobbing to gentle sniffles and at last sits back and wipes her cheeks with the back of her hands. Milena hands her a handkerchief to blow her nose, and then a mug of water, and a second one for Jaskier.\n“Thank you,” Jaskier says, and sips cautiously at it; he’s not sure how much he’s allowed to eat or drink before Triss pronounces him fully healed. Presumably a dagger through the midsection does nasty things to one’s guts, though he doesn’t particularly want to think about that. “So, since you’re here, have your sister and the rest been banished from Kaer Morhen?”\nMilena sits down on the edge of the bed and nods. “They left a few hours ago. Eskel was - well, you know, I’d stopped thinking he was scary, because he’s always so polite, but he was terrifying, almost as bad as the White Wolf. He looked like he wanted to start tearing people’s throats out with his teeth.” She shivers. “He said anyone who wanted to could swear loyalty to the Wolf, but otherwise we had to be gone within the hour, or he’d toss us out the gates himself, and not be careful how we landed.”\nJaskier smiles at her. “So you swore.”\nMilena’s cheeks go pink. “I - he - he gave me this look, and said you’d mentioned my name, and I did, I swore myself to the Wolf and I meant it, and he told Marta to stop sputtering and get gone, and sent me here to sit with you and the young princess while everything got sorted.”\n“I wish I’d been there to hear it,” Jaskier says, grinning. “And I see you’ve been getting on with Ciri.”\n“She’s nice,” Ciri says artlessly. “I like her.”\nJaskier hugs Ciri around the shoulders. “Oh good. How would you like to have a lady-in-waiting, cub? You could use someone to help you with your hair, and court manners, and - women’s things, when you’re a bit older. I’ll have to ask your Papa, but it’s up to you, too.”\nCiri gives Milena an assessing sort of look, and nods. “I like you, and you’re Jaskier’s friend,” she informs the older girl. “If Papa says so, I guess you can be my lady-in-waiting, but I don’t know what one does.”\nMilena is looking astonished and delighted. “Well, I’d help you with your wardrobe and your grooming,” she says. “I’d run errands for you if you needed them, and keep your correspondence in order, and be your - well, your confidant if you wanted one. Someone you could talk to, and I’d be sworn to your service as well as your father’s, to never betray you.”\n“Hm,” says Ciri, sounding rather like her father, if several octaves higher. “What do you get?”\nGood girl, clever girl, Jaskier thinks fondly. A suspicious mind like that is a very good thing for a warlord’s daughter to have.\n“Well, I’d have your protection,” Milena says, settling in a little more comfortably. “That’s nothing to sneeze at. And I’d have a designated place in the court, so I wouldn’t just be depending on the charity of the Warlord. You’d be expected to give me clothing - or at least the materials to make my own - out of your household budget, and perhaps to give me a small allowance of my own to buy whatever I might need.” She shrugs. “I’d be part of your household, not your father’s, so you’d have final say on whether I could marry while under your protection, which - well, in other courts, that’s quite important and valuable. But this court doesn’t seem to have unpleasant old counts looking for their third wives.”\nCiri wrinkles her nose. “Ugh, that sounds dreadful,” she says. “Jaskier, do I have a household budget?”\n“You know, I’m not sure,” Jaskier says. “Witchers do things a bit differently. You maybe should.”\n“Hm,” Ciri says again, and gives Milena a long, searching look. “Well, alright, if Papa says you can, we can try it. And if we don’t get on, you could maybe be Aunt Yen’s lady-in-waiting. She’s got a lot more clothes than I do.”\nMilena’s eyes go wide. “I would much prefer to serve you, princess,” she says, sounding a bit strangled. “Lady Yennefer is rather terrifying.”\nTriss, in the doorway, chuckles, and they all three startle. “She’d be very pleased to hear you say that, lass,” Triss says, coming over to the bedside and giving Milena a friendly smile. “She works hard at it.”\n“She has entirely mastered it,” Milena says faintly.\n“She’ll like you,” Triss says, and turns her attention to Jaskier. “How are you feeling?”\n“Very slightly achy and not at all as though I’ve recently been stabbed,” Jaskier says. “For which I owe you a debt of thanks and probably several songs.”\n“Eh, sing us some proper ballads the next few nights and we’ll call it even,” Triss says, holding a glowing hand above the bandages wrapped around Jaskier’s midsection. “Or better yet, don’t get stabbed again.”\n“You know, I didn’t intend to get stabbed this time,” Jaskier points out. “What the fuck did Agata think stabbing me was going to gain her, anyway?”\n“I haven’t the faintest idea,” Triss says, but Milena makes a sort of uncomfortable noise, and they all turn to look at her.\n“She kept...ranting, during our ‘quiet afternoons’,” Milena says. “About how you had the place one of us ought to. Well, she said one of us, but she obviously meant herself. That the White Wolf wouldn’t look at anyone else as long as he had his -” she darts a look at Ciri and obviously chooses a politer word - “bedmate. I thought it was just sour grapes, because we could all see how much the White Wolf cares for you, but…”\n“Charming,” Jaskier says, as dryly as he can. “See, this is why I don’t miss court life. Witchers don’t try to stab their romantic rivals. Usually.”\n“Witchers have a code of conduct that says who they’re allowed to stab and when,” Triss observes. “Most princesses don’t.”\n“I do!” Ciri says.\n“Yes, but you’re a princess of Witchers, now aren’t you, little menace?” Triss says, grinning down at her.\nThe door opens again, and Geralt comes in. Milena flinches just a little - she’s already much better than she was three weeks ago, and Jaskier’s pretty sure she’ll be over whatever fear remains in the not-too-distant future - but Ciri bounces out of the bed and runs over to hug her father tightly around the waist. “Jaskier’s fine!” she chirps.\nGeralt smiles down at her and picks her up, slinging her over his shoulders, and comes over to the side of the bed. “Well enough for supper?” he asks Triss.\n“Yes, but no singing or dancing for tonight,” Triss says. “I don’t want any of the new bits to tear.”\n“I shall be as docile as a lamb,” Jaskier assures her.\n“Geralt, make sure he doesn’t do anything stupid,” Triss orders. Jaskier squawks in mock offense. Geralt nods gravely. Milena hides her giggle behind her hand.\nJaskier is genuinely astonished by the sudden hush that fills the hall when he walks in at Geralt’s side - and the raucous cheering that replaces it. Geralt hums, low and pleased, and herds Jaskier over to his usual chair between Eskel and Lambert. Several very kind people have apparently brought him cushions, and there’s a goblet of wine waiting for him, too, which suggests Yen is feeling guilty for some reason. Silly of her; nobody really expected a princess to start trying to assassinate people.\n“Oh good, you’re not dead,” Lambert says, which is so very Lambert that Jaskier has to laugh.\n“Did you get to scare the crap out of the entire court of Temeria?” he asks.\nLambert grins. “Oh did I,” he says. “I think I made one idiot piss himself.”\nJaskier grins back. “Only one? I’m disappointed.”\n“Had to leave some for everyone else,” Lambert says, and then looks down the table and makes an odd noise, almost a choking sound. Jaskier turns to follow his gaze and sees Triss settling Milena next to her. Lambert says faintly, “I thought they all left.”\nEskel catches Jaskier’s eye and winks. Jaskier smirks back.\n“She swore to the Wolf,” Eskel says, voice carefully even. “I think she’s going to be the cub’s lady-in-waiting, something like that.”\n“She’s - she’s staying?” Lambert squeaks.\n“You should go and welcome her after the meal,” Jaskier suggests. “Bet she’d be glad of a friendly face.”\nLambert mutters something incomprehensible and turns to grab a platter of stewed carrots, ears a fetching shade of crimson. Eskel makes a face like he’s trying very, very hard not to laugh. Jaskier leans forward a little so he can see Geralt’s expression, and is delighted to see that the White Wolf, too, looks very amused. Well, his eyes are slightly crinkled and he raises one eyebrow a fraction as he sees Jaskier looking, which is as good as a full grin from anyone else. Beyond him, Yen looks over to meet Jaskier’s eyes and gives him a slightly rueful smile, and Jaskier toasts her with his goblet of wine, watching the tension drain out of her shoulders as he does so. Dear Yen; Jaskier will have to find a private moment and give her a proper hug, somewhere no one can see her being so undignified as to let him.\nWhen supper is over, instead of Jaskier singing, Eskel stands. “Two announcements,” he says, as the hall falls silent. “And then I vote we have a proper brawl; I need to punch something.”\nThere’s a roar of cheerful agreement. Jaskier shakes his head a little: Witchers. They’re darling ridiculous creatures.\n“First thing: no more would-be consorts. If they show up, kick ‘em out; if they ask passage through our lands, tell ‘em no,” Eskel says. A number of Witchers bang their mugs on the tables in approval.\n“Second, we got one good thing out of that clutch of fucking idiots, and she’s our cub’s new lady-in-waiting, Milena de Roggeven. Stand up, girl.” Milena stands and curtsies, looking apprehensive but with a stubborn set to her chin. “She’s sworn to the Wolf and his cub, so let her be.”\nThere’s a chorus of “Aye”s, and Eskel surveys the hall briefly and then turns to Geralt. “Well?”\n“Have at,” Geralt says, gesturing to the open space between the tables, and Eskel grins and vaults the high table, landing neatly in the center of the open area and throwing his arms wide.\n“Who wants first crack?” he bellows, and there’s a great whoop that rings from the high ceiling and about a hundred Witchers go pouring into the open space, and in about ten seconds there’s a fairly good brawl going. No one uses blades, of course, and Jaskier has learned that there are rules: no eye-gouging, no broken bones, and if someone goes down hard enough to knock him out, the Witchers around him will heave him out of the fray.\nOther than that, it’s a free-for-all. Jaskier shakes his head at the noise and gets up, shifting down one space into Eskel’s chair. “I think he would have preferred scaring Temerians to keeping order,” he says to Geralt, who hums.\n“Needed him here,” he replies gruffly. “Had to keep people from doing anything stupid.” He frowns a little at Jaskier. “Come here.”\n“What?” Jaskier asks, but he gets up again, and Geralt shoves his chair back a bit and tugs Jaskier down into his lap, cradling him close, arms warm and snug around Jaskier’s waist.\nThis is new. Nice, but new. Jaskier shrugs to himself and snuggles close, tucking his head against Geralt’s shoulder. “What brought this on?”\n“Almost lost you,” Geralt murmurs. “Want you close, little lark.”\n“Well, I shan’t object,” Jaskier says. “Ciri might.”\nCiri, overhearing this, giggles. “We could get you a bigger chair, and you could share, and I could sit on both your laps,” she suggests.\n“Hm,” says Geralt, quite as if he’s actually considering it.\n“That...might be a little inappropriate,” Jaskier says. “Given that officially I’m your court bard, and all.” And not your consort, he doesn’t say. He doesn’t want to push. Geralt has never said he wants a consort, after all; everyone in the various courts across the continent assumes he should have one, but he’s never expressed any desire to do so, that Jaskier knows of. And certainly that decree earlier makes it sound like Geralt isn’t interested in even entertaining the idea.\n“Hm,” Geralt says, with a rather different intonation this time. And then, bafflingly, “Should’ve left that clause in the Redanian treaty.”\nJaskier sits up a bit and blinks at his lover. “What? Which clause?”\n“Redanian consort,” Geralt says, and Jaskier shakes his head as though it will help make sense of the words he’s hearing.\n“You...want...a Redanian consort?” he says carefully.\nGeralt sighs and leans in and kisses him very, very gently. “Little lark,” he says, and those golden eyes are very clear, and the noise of the brawl seems to fade away, until all that Jaskier can hear are the quiet words rumbling from Geralt’s chest. “My little lark. Tutor, advisor, bard, beloved. Already my consort in all but name. Do you want the title?”\nJaskier gapes. That - he - how is Geralt always eloquent when it’s going to make Jaskier fucking speechless? “Do you want me to have it?” he says. He does not squeak. He is a master bard, he has much better control over his voice than to squeak, and anyone who says otherwise is lying.\n“I want to keep you,” Geralt says. “I want you at my side always.” His lips quirk, just a little. “If I were just a Witcher, and you were just a bard, that would be enough. No need for titles. But…” He trails off and shrugs.\n“But you’re the White Wolf, Warlord of the North,” Jaskier says quietly. Geralt nods. Jaskier takes a deep breath. “I have. I have a couple questions we should probably talk about when I’m not still recovering from being stabbed. And maybe when there’s not a brawl going on. But...I want to be at your side always. So.”\nGeralt hums, and nods, and kisses him again, and Jaskier nestles against his shoulder and closes his eyes and listens to the slow, steady beat of Geralt’s heart beneath the noise of the brawl.\n*\nHe’s woken from his quiet reverie - he hasn’t even really been thinking, just basking in the warmth and comfort of Geralt’s embrace - by a tiny chuckle shaking the shoulder beneath his cheek, and the scrape of a chair, and raises his head in time to see Lambert go by along the table, looking determined and nervous and hopeful, which on Lambert looks a lot like irritated. Jaskier turns to watch.\nLambert reaches Milena’s seat and hesitates, which is adorable. Milena looks up at him, and her cheeks go pink, and she says something Jaskier can’t hear over the noise. Damn.\n“‘Not joining the brawl?’” Geralt murmurs in Jaskier’s ear. Oh, now that’s useful. Jaskier presses a kiss to Geralt’s cheek.\n“‘No, I - do you want to go for a walk?’” Geralt continues, voice warm with good humor. “‘It’s - loud. I could. Show you the library?’”\n“Oh, the sweetheart,” Jaskier whispers.\n“‘That sounds lovely,’” Geralt finishes, as Milena stands and Lambert, looking very awkward, offers her his arm. She takes it with a sweet smile, and he leads her out of the room, looking rather as though he did not expect his efforts to bear fruit and doesn’t know what to do now that they have.\n“Awwww,” Jaskier says, beaming. “Good for them. I definitely have to work on that one with the wolf and the dove now.”\n“Hm,” Geralt says. “Swan.”\n“Swan?” Jaskier asks.\n“Quiet and elegant,” Geralt says, and Jaskier blinks for a moment and then grins so hard his cheeks hurt.\n“You big softy,” he says, delighted. “I’ve figured you out: you’re a complete romantic under all that gruffness!”\nGeralt puts a gentle finger across his lips, and his eyes crinkle. “Shh,” he murmurs. “It’s a secret.”\nJaskier kisses Geralt’s finger and settles down again, humming scraps of melody thoughtfully. Down to the shores of a mountain lake came a wolf to quench his thirst / and on the crystal water saw a swan as white as snow…\n*\nHe actually feels fine the next morning - better than fine, rejuvenated, which can only partially be chalked up to having spent a night wrapped up in Geralt’s arms, warm and safe. He makes the concept of a household budget into the morning’s mathematics lesson for Ciri, and actually gets her interested in geography, too, by talking about where the various fabrics for her clothing come from, so he’s feeling downright bouncy by the time they come down for dinner. His mood only gets better when the Witchers come flooding in from their morning practice and baths, most of them shirtless and all of them damp and cheerful, and Jaskier looks down the table to see Milena staring at Lambert with her cheeks bright red and her bottom lip between her teeth, and looks over to see Lambert, shirtless, putting his shoulders back and preening a little at her admiring gaze.\nEskel settles into his chair beside Jaskier, catches Jaskier’s eye, and glances up at the ceiling as though praying for strength. Jaskier tries to suppress his laughter and ends up snorting instead. Lambert growls, though not very well.\n“Yeah, yeah, laugh it up, buttercup,” he mutters. “Like you didn’t spend months pining for our White Wolf.”\n“I can’t smell attraction,” Jaskier points out.\nLambert frowns. “Lust isn’t the same thing as liking someone, buttercup.”\nJaskier ponders that for a few moments. “Alright, I’ll give you that,” he says at last. “I don’t care to break any confidences, mind you, but I think I’m safe enough saying that you should trust what you’re smelling.”\n“Mmmph,” says Lambert, looking warily hopeful, and then, very quietly, “Thanks.”\nJaskier pats his shoulder and pretends to ignore the smile Lambert can’t seem to quite suppress.\n*\nAfter dinner, Geralt catches his eye and beckons him to follow, and they end up in the White Wolf’s office, just the two of them. Geralt leans back against the smaller table and gives Jaskier a long, thoughtful look.\n“Questions,” he says.\nJaskier nods and sits down, leaning back and considering his words carefully. “In no particular order,” he says at last. “Ciri’s mother - is she likely to show up and want her daughter or her rightful position as the mother of your heir?”\n“No,” Geralt says. “She’s dead. Five, six years ago.” He pauses, sighs, and adds, “Be more worried about her father.”\n“...You’re...her...father?” Jaskier says warily.\n“Birth father,” Geralt clarifies. “She’s not my blood. Surprise Child.”\nJaskier’s eyebrows about hit his hairline. “I would not have guessed,” he admits. “She’s so much like you. Alright, I’ll bite, who is the father?”\n“Emhyr var Emreis,” Geralt says. Jaskier looks at him for a long moment, praying this is a particularly stupid joke, and then puts his forehead down on the table.\n“Your daughter is the heir to the two largest empires on the continent,” he says to the wood under his face. “Of course she is. Naturally. Right. So that’s. That’s going to be an interesting bridge to cross if he ever comes looking for her.”\n“Hm,” says Geralt, helpfully.\nJaskier sits up and gives his lover a baleful look. “Right. Well, I probably don’t need to worry about Emhyr var fucking Emreis showing up and demanding to be your consort, so I suppose that’s really the relevant bit of that particular revelation. Out of curiosity, who was her mother?”\n“Pavetta of Cintra,” Geralt says, and Jaskier re-introduces his head to the table.\n“Well, that’ll make conquering Cintra easier,” he says at last. “Just wait until Calanthe finally dies and proclaim Ciri’s right to the throne. Ye gods, Geralt, this is the sort of thing your advisors need to know!”\n“Hm,” says Geralt again, but he’s looking rather sheepish when Jaskier sits up to glare at him. “Didn’t think this Warlord thing was going to last so long,” he admits. “I...should tell everyone.”\n“Eskel and Vesemir and Yen, at least,” Jaskier says. “And Ciri. Whoo. I did not expect that. Alright. Alright. I can deal with this. We can deal with this. Back to my original line of questions, which is about being your consort, not...the distinct possibility of the entire western half of the continent being united under Empress-Warlady-Sorceress Cirilla at some point in the future.”\nGeralt is smiling, just a little. “Can you think of a better empress?”\n“Admittedly she’s a marvel and a wonder, and probably would do a magnificent job,” Jaskier allows. “In, y’know, twenty or thirty years when she’s got some decent life experience and has stopped playing the goose trick on unsuspecting passers-by. Whoo. Right.” He closes his eyes for a moment and tries to haul his scattered brain back in order.\n“Second question,” he says. “If I wanted to go traveling around your empire - possibly with Ciri, when she’s a little older - and with a group of overprotective Witchers, I’m not an idiot - would you...mind?”\n“I’d miss you,” Geralt says. Jaskier opens his eyes to see those golden eyes fixed on him, full of something he can only call fond adoration. “Can’t clip a lark’s wings and keep it happy,” Geralt adds. “Travel as you please. With guards.”\n“With guards. Being stabbed once was plenty,” Jaskier agrees. “And I wouldn’t want to go for more than - well, a season, perhaps, at most. Enough to see a little of the world, get some new songs, sing some of mine for new audiences. I’d always come home.”\nGeralt’s lips quirk in a sweet smile. “Home to Kaer Morhen,” he says softly.\n“Home to you,” Jaskier says. “Right. That was easier than I might have expected. Next thing: Does Ciri mind? Or the rest of the council?”\n“Ciri told me to name you my consort a month ago,” Geralt says dryly. “Eskel was very clear on the fact that you fill every requirement on that damned list. Vesemir asked me what the fuck I was waiting for. And Yen told me to get my head out of my ass and ask you already.”\nJaskier adores his friends, he really does. “Well, that’s definite. Last question.” He takes a deep breath. Geralt raises an eyebrow silently. “If. If you or I happened to find someone else...appealing. Would that.” Fuck, he isn’t even sure how to say this. “I could be happy with no one but you in my bed, ever again,” he says desperately. “But it - I -”\nGeralt hums, low and almost musical, and closes his eyes, leaning back to think. Jaskier watches him, heart in his throat. This was the question he was worried about, because yes, he could be happy sharing his bed with no one but Geralt, but there are so many beautiful people in the world - fuck, just in Kaer Morhen - and he really does like women as well as men, and he knows Geralt does too, and he’d far rather have everything out in the open than either of them starting to sneak around and lie and have it eat away at the trust between them -\nGeralt opens his eyes. “Not in our bed,” he says slowly, “unless it’s both of us.”\n“Agreed,” Jaskier says at once. He wouldn’t bring someone else back to Geralt’s bed, never in a million years. Well. Unless it’s both of us. Isn’t that an appealing thought.\n“Hm,” Geralt says. “You want someone, you tell me. I say no, you don’t bed them. Same for me; you say no, I don’t.”\n“That is completely fair,” Jaskier says. “Agreed.” It makes a lot of sense - Geralt might well know more about someone than Jaskier does, or possibly even vice versa, or there might be personality conflicts, or - well. It makes sense.\nGeralt considers, humming softly to himself, and then shrugs. “You come back to me.”\n“Always,” Jaskier promises. “I am your lark, my wolf. My heart is yours.”\n“My little lark,” Geralt says, and pushes himself off the table, crossing the room to stand beside Jaskier’s chair. “That it?”\nJaskier stands, slowly, and Geralt doesn’t back away. They’re chest to chest, eye to eye - Jaskier always forgets that they’re very nearly the same height, because Geralt is so large, his presence filling any room he enters, but Jaskier can look him square in the eyes, breathing the same air, noses almost brushing. “That’s it,” he says, very quietly. “Are you sure, my wolf? Do you really want to name me your consort?”\n“My little lark,” Geralt says again, just as softly, just as gently. “Already my consort in all but name.” He lifts a hand to tap the medallion about Jaskier’s throat, then curls it gently around the back of Jaskier’s neck. “I’m sure. Are you?”\nJaskier takes a deep breath. This is it, the last chance to back out, to say ‘Nope, I can’t do it,’ to stay nothing more than court bard and lover, tutor and advisor - in other words, all the duties and none of the titles. None of the right to sit beside his beloved and dare the world to try to separate them. None of the surety of knowing down to his bones that the White Wolf has chosen him above all others.\n“I’m sure,” he says. “Keep me, my wolf. I’m yours.”\nGeralt smiles, and pulls him forward into a kiss so sweet and thorough and loving that Jaskier’s knees go weak.\n*\nGeralt meets Jaskier’s eyes and gives a little beckoning motion of his head, and Jaskier stands and crosses behind Eskel’s chair to stand beside Geralt. Geralt pushes his chair back and stands, and puts one hand on Jaskier’s shoulder. Eskel gives a short, sharp whistle, and the hall falls silent, every eye turning to the White Wolf and the bard.\nThis seems familiar. Jaskier finds himself grinning helplessly, a far contrast from the last time he stood here to be claimed.\n“Here is Jaskier of Kaer Morhen,” Geralt says, voice ringing through the hall. “My Consort, from this day on.”\n“White Wolf!” comes the answer from every throat, and then, hard on its heels, someone - Jaskier’s not sure who - yells, “About time!” There’s a sudden roar of laughter, and then cheering, loud and long and merry. Jaskier turns to face his love and loops his arms around Geralt’s neck and pulls him into a kiss, right there in front of everyone, and the cheering turns into whooping and hollering and the sorts of bawdy encouragement that Ciri really shouldn’t be hearing.\n“My little lark,” Geralt murmurs as they break apart. “Will you sing for me tonight?”\n“Do you even have to ask?” Jaskier says, grinning, and turns to reach for his lute where it hangs on the back of his chair.\nGeralt chuckles, low and sweet, and catches him about the waist long enough to murmur in his ear, too low even for Witchers to overhear, “I meant the other sort of singing, Consort mine.”\nJaskier can feel himself flush all the way to the tips of his ears, but he finishes grabbing his lute and slinging it over his chest, pokes Geralt in the chest, and says, “You are dreadful and I love you. Yes. Now let me sing for everyone else, hm?”\n“Go on, then,” Geralt says, and sits down. Ciri climbs into his lap and gives Jaskier an expectant look. Jaskier grins at her, and strikes a chord, and the incoherent hollering of the Witchers turns all at once to a bellowed chorus, hundreds of voices strong, as he plays the Ode to Witchers as loud as his lute will strum.\n*\n“So,” Jaskier asks, putting his lute down carefully on its stand, “how does the White Wolf of the North claim his Consort, hm?”\n“Any way the Consort likes,” Geralt says, and when Jaskier turns to face him, his eyes are crinkled with amusement and blown dark with lust. “How shall I claim my little lark?”\nSo many options. Jaskier licks his lips. “Naked would be a good start,” he suggests.\nGeralt chuckles and starts to strip, and Jaskier stares for a long moment, mesmerized as always by the sheer beauty of his lover, before he gets his wits about him and quickly toes out of his own boots and shucks his clothing, leaving it in a careless heap.\nAnd Jaskier is feeling bold, tonight, bold and claimed and kept, silver medallion and golden eyes and the chorus of the Ode to Witchers all like strong wine in his blood. “I don’t suppose,” he says, eyeing the long lean line of Geralt’s back, the gorgeous strength of him, “that as the White Wolf of the North has, indeed, already claimed his Consort quite thoroughly and many times over, he might enjoy allowing his Consort to claim him?”\nGeralt steps out of his trousers and kicks them to the side, leaving him bare and lovely in the firelight, and turns to smile at Jaskier, a slow toothy smile, predatory and sweet. “He might,” he says, voice deep and rich like distant thunder. “Is that what you want tonight?”\n“If you don’t mind,” Jaskier says. “Or. Well. If you’d enjoy it, too.”\n“I would,” Geralt says, and Jaskier pounces.\nGeralt catches him, of course, but he lets Jaskier’s weight stagger him, lets himself fall backwards onto the bed as though Jaskier ever could pin him. They’re both laughing, Jaskier with wild delight, Geralt with obvious fondness. Geralt shifts back onto the bed until he can sprawl out properly, lifting Jaskier’s weight as though it’s nothing as he moves, and Jaskier laughs harder, muffling his giggles against one brawny shoulder. Geralt hums and cards his fingers through Jaskier’s hair, and that gentle touch is enough to remind Jaskier that he had a plan, or at least a vague outline, or at the very least an intended goal.\nThat being seeing Geralt strung out and moaning with pleasure beneath him.\nHe rolls off of Geralt to kneel beside him, and Geralt grins up at him and laces his hands together behind his head and lounges there looking very smug, and very predatory, and so painfully beautiful it almost hurts. “Hedonist,” Jaskier says fondly, and dives in.\nHe likes to think he was a pretty damn good lover before he started sharing Geralt’s bed, but after three months he’s definitely managed to learn a lot of what specifically works for Geralt, and he uses every bit of it tonight. Gentle kisses here, the scrape of teeth there, and by the time he closes his lips over the tip of Geralt’s prick, the White Wolf is already moaning softly. It’s intoxicating, wholly addictive.\n“Pass me the oil,” he says, raising his head briefly, and Geralt reaches over to the bedside table and tosses the little pot down to him, and spreads his legs, lolling back against the pillows like - well, like the king he is, looking decadent and smug and more than ready for his consort to do him homage. Jaskier makes a soft sound around his mouthful - something between a groan and a whimper, it’s really just as well he is muffled at the moment - and Geralt hums and reaches down to comb his fingers through Jaskier’s hair.\nIt’s quite unfair how sweet the man is, under all the gruffness. Jaskier fumbles for the oil.\nGeralt opens for him with astonishing ease, humming with pleasure as Jaskier introduces one, two, three fingers in swift succession. Jaskier has to assume it’s something to do with Witcher abilities, something about deliberate control of muscles perhaps. Thankfully, Witcher mutations don’t seem to change the presence of that remarkable spot that always makes Jaskier see stars, and it appears to do the same thing for Witchers, judging by the sudden increase in the volume and desperation of Geralt’s moans. Fuck, that’s hot. Jaskier is a musician, but playing his lute has never been quite as satisfying as playing a fucking symphony of Geralt’s lovely sounds.\n“Jaskier,” Geralt rasps at last, and Jaskier scrambles up onto his knees.\n“Yes, alright, fuck, you’re so -” Jaskier babbles, and Geralt laughs, soft and fond, and curls a hand around the back of Jaskier’s neck. The weight of it is oddly calming.\nSliding into Geralt is not calming, but Jaskier hardly expected it to be. It is so fucking good that Jaskier has to bite his own lip so as not to spill like a green boy, and that isn’t helped by the way Geralt’s eyes slip closed and he sighs, long and sweet, and all the tension runs out of his shoulders. Jaskier bites his lip harder and sends a brief prayer up to whichever god looks out for fools and bards that he’ll be able to hold out for more than a handful of thrusts.\n“Little lark,” Geralt rumbles, which does not help at all.\n“My wolf,” Jaskier gasps, and his hips start moving without his really deciding to let them, and Geralt spreads his legs wider, braces his feet on the bed and opens for him, and oh gods, oh fuck, oh help, there’s no way in hell Jaskier’s going to be able to hold out, but he can at least wrap his hand around Geralt’s prick, can at least put his back into it so that he’s hitting that spot just perfectly and making Geralt moan and sigh and gasp, can at least let his clever tongue say whatever it likes, praise and curses and desperate adoration falling from his lips like rain. Geralt soaks it all up, humming in pleasure, and then - gods be praised - Jaskier gets the twist of his wrist and the angle of his hips just right, and Geralt makes an almost startled sound and peaks, and the feeling of him tight around Jaskier’s prick is easily enough to pull Jaskier over, too.\nHe ends up sprawled atop Geralt’s chest, which is fairly normal for the end of a pleasant evening, apart from the fact that he’s still buried in Geralt instead of the other way around.\n“Hm,” Geralt rumbles, sounding immensely pleased with the world, and pets Jaskier’s hair and down his back in long, soothing strokes. Jaskier kisses whichever patch of skin happens to be nearest.\n“My wolf,” he says.\n“Your wolf, my little lark,” Geralt rumbles. “My beloved Consort.”\nJaskier smiles and lifts his head to press a kiss to Geralt’s lips. “Your Consort, my love.”"
}