{
    "id": "23505826",
    "url": "https://archiveofourown.org/works/23505826?view_full_work=true",
    "author": [
        "inkinmyheartandonthepage"
    ],
    "title": "One in a Million",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "The Avengers (Marvel Movies)"
    ],
    "relationships": [
        "Peter Parker & Tony Stark"
    ],
    "characters": [
        "Peter Parker",
        "Tony Stark",
        "Morgan Stark (Marvel Cinematic Universe)",
        "Stephen Strange",
        "Pepper Potts",
        "James Rhodes",
        "Steve Rogers",
        "Bruce Banner",
        "Clint Barton",
        "Thor (Marvel)"
    ],
    "additional_tags": [
        "Mention of Avengers",
        "Post-Avengers: Endgame (Movie)",
        "Fix-It",
        "Post-Endgame",
        "Hurt Peter Parker",
        "Tony Stark Acting as Peter Parker's Parental Figure",
        "Peter Parker Needs a Hug",
        "Peter Parker Has a Family",
        "Hurt/Comfort",
        "Emotional Hurt",
        "Hurt",
        "Family Fluff",
        "The Avengers Are Good Bros",
        "Stephen Strange is a Good Bro",
        "Parent Tony Stark",
        "Protective Tony Stark",
        "Complete",
        "Irondad",
        "spiderson",
        "Sleepwalking",
        "Peter Parker Acts Like a Spider",
        "Pepper Potts Acting as Peter Parker's Parental Figure",
        "Dead May Parker (Spider-Man)",
        "Mentioned May Parker (Spider-Man)",
        "May Parker (Spider-Man) Dies",
        "Injured Peter Parker",
        "Grief/Mourning"
    ],
    "language": "English",
    "series": "",
    "published": "2020-04-06",
    "completed": "2023-03-28",
    "words": "25,156",
    "chapters": "9/9",
    "comments": "805",
    "kudos": "16,155",
    "bookmarks": "4,053",
    "hits": "268,098",
    "summary": "<p>Peter has the gauntlet, the stones already in place. Aliens are beginning to swarm him and in the overwhelming panic that begins to consume, he does the only thing he can think of. He shoves his hand into the gauntlet.</p>\n<p>Peter keeps waking up in strange places</p>\n<p>Peter has a bad day</p>\n<p>Peter didn’t want to ask – he didn’t need to ask really – because everyone was avoiding it, himself included. There was only one reason why May hadn’t come to visit.</p>\n<p>“How did you do it?” Steve asked, making Tony turn.</p>\n<p>“What?” Tony blinked.</p>\n<p>“Thanos, the stones, how did you do it?” Steve asked, eyes trailing over Tony’s armour that still clung to his skin.</p>\n<p>“I could ask you the same question,” Tony nodded at Steve who was filthy but had no burn marks like Bruce had received. “Something a little extra in that bottle you failed to mention?”</p>\n<p>*</p>\n<p>During the final battle, Peter is lost and forgotten amongst the battlefield and it isn't until it's over does Tony realise what he's done.</p>\n<p>Morgan had been looking forward to meeting her big brother ever since her mum and dad had told her about him. Except, Peter just keeps sleeping and she wants him to wake up.</p>\n<p>Peter just wants to be Spiderman again - even if it means breaking into Tony's workshop</p>\n<p>Thing were starting to look up. Things were starting to return to normal.</p>",
    "notes": "<p>Hi everyone! </p>\n<p>It's been quite a while since I have written anything. I had a disastrous March with the loss of my dad and for the first time I have had the creativity to write something. </p>\n<p>I hope this little one-shot gives you something to distract you with everything that is happening in the world. </p>\n<p>Apologies for any mistakes and I hope you enjoy.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>So I wasn't going to write any more for this, happy with my little one shot but then everyone was so lovely and said they'd be cool if there was more and then all of a sudden this popped into my head! </p>\n<p>So I hope you enjoy this little extra bit. </p>\n<p>Sorry for any mistakes and I hope you enjoy :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>I'm pretty sure that this is the end. </p>\n<p>Happy reading :)</p>\n<p>Yeah.... </p>\n<p>Look, I honestly wasn't planning to write more but then I woke up with this idea in my head and here we are. </p>\n<p>Thank for all the love you have given the last two chapter and I hope that you enjoy this one too. </p>\n<p>Apologies for any mistakes.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>Happy reading :)</p>\n<p>Hello! </p>\n<p>I know, I know, it's been a while. For everyone who asked \"what happened to May?\" this is for you. </p>\n<p>Hope you enjoy and apologies for any mistakes :)</p>\n<p>Hello!</p>\n<p>I know it's been a while since I have posted in this fic but I recieved a prompt for my We Forgot Peter Series that fell nicely into this universe I created. This prompt was from Taekwonono on Ao3 - I was wondering if you can make a oneshot about the battle itself and that since everyone forgot and no one was really paying attention to Peter, he ends up snapping before anyone does, before Tony even gets anywhere near Thanos. This will cause everything from thanos's army to disappear allowing everyone to congratulate each other until Tony notices that he can't find Peter and ends up finding him leaning against the rocks with the gantlet (idk how to spell it) in his hands.</p>\n<p>I'm not currently taking prompts for either story/series but I will say that there will be probably more added to this in the future :)</p>\n<p>I hope you all enjoy and apologies for any mistakes.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>Happy reading :)</p>\n<p>Hands up if you are surprised to see an update! My hand is up too because I was not expecting to update this one either! hahahaha! </p>\n<p>I've seen a lot of love for this story lately and this idea popped into my head and here we are! I'm so thankful for all the love that you guys have given this story! This has been so much fun to write and it's nice to come back to it whenever the inspiration strikes for it. </p>\n<p>I hope you all enjoy and I apologize for any mistakes :)</p>\n<p>:D Who want's another chapter?!</p>\n<p>Thank you for those who nominated One In A Million for the Irondad Creator Awards 2023! It means so much to me that you have enjoyed this fic and I hope you will enjoy this chapter as a thank you for the nomination!</p>\n<p>I have also posted this chapter in the We Forgot Peter Series :)</p>\n<p>I hope you will all enjoy and apologies for any mistakes!</p>\n<p>Hey guys!!!!</p>\n<p>Thank you so much for all the love you have given this story :D I'm so glad so many of you are enjoying it!</p>\n<p>I'm adding another chapter thanks to Sirennette on ao3 who prompted for my We Forgot Peter Series: i have and idea for a promt that could follow the “one in a million” series as well as the “we forgot Peter” one. Peter is finally okay and can go back to school, he is exited because he missed being Mj and Ned and now he can finally be with them again. But there’s one tiny little detail they forgot, Gym Class, more exactly the change room. Even if Peter is fine there is still some scars that didn’t fully heal. What will happen if his class saw those scars?</p>\n<p>I hope you all enjoy and apologies for any mistakes.</p>\n<p>Thank you so much for everyone who voted for this fic in the Iron dad-creator Awards! I can't thank you enough for all the love and support you have given me and this story! I'm so glad so many of you have enjoyed this fic! Thank you, thank you, thank you and a massive thank you for those who created these awards! You have put so much effort into this :D</p>\n<p>Happy reading :)</p>",
    "text": " \n \nThe first thing Peter hears is the sound of crickets. It’s not what he is expecting but it’s peaceful and he let’s himself drift back into the darkness.\n \nThe second time he hears voices.\n \nIt takes him a while before the voices fade from indigestible chatter to fully formed words that Peter can understand.\n \n“Why is he still sleeping daddy?”\n \nThe voice is unfamiliar but not threatening. It’s sweet with a definitive child-like lilt to it. It’s not one Peter recognises but the darkness has swaddled him comfortably and he feels he has no need to break free.\n \n“Peter is healing, baby girl.”\n \nThis voice is familiar and Peter sinks deeper into the darkness knowing that he is safe.\n \n*\n \nThe third time Peter wakes it is nothing like the darkness before. This time is all too aware of everything. The noise is the room is too loud and he’s aware of every breath in the room. He counts three separate heart beats, all beating too rapidly. His eyelids are too heavy to lift, and he doesn’t try to pry them open. His mouth is a concoction of something foul, stale and slick. He can feel the fabric of the clothes he is in, and he wondered where his suit is, but the thought is quickly lost as the pain flares.\n \nHis whole left side feels as if it is on fire. His muscles twist and he wanted to scream out in pain but can only manage to part his lips and suck in a harsh breath that makes his throat burn.\n \n“Peter, can you hear me?”\n \nWhile there is pain in his left side, there is a twinge in his right wrist. He flinches, fingers curling tighter around something and he hears a grunt.\n \n“Peter, if you can hear me please let go.”\n \nReflexively his tightens his grip and the voice grunts again.\n \n“Kid, it’s Tony.”\n \nTony. He was here, alive. Peter wanted to talk, wanted to spew his relief and gratitude and apologise for everything but he couldn’t, and his grip tightened.\n \n“Kid, if you can hear me, you have to let go. You are crushing the wizard’s wrist,” Tony said, his voice urgent.\n \nWizard. Doctor Strange was here too? Peter sniffed the air. He could smell the familiar scent of coffee and motor oil that he knew was Tony. He could also smell the faint scent of tea and something that just smelt ancient. He had smelt it before when he was stuck on a ship in space with Doctor Strange.\n \n“Don’t,” Strange’s voice was strained. “Don’t try and pry him off me. He could snap my wrist.”\n \nPeter didn’t want that. He didn’t want to hurt the Doctor and he felt sharp pain through his fingers as he slowly released the doctor.\n \nHe felt his arm drop and thump against what he now knew was the bed. He felt beyond exhausted and when he tried to open his eyes he simply couldn’t. He couldn’t even move his arm’s anymore, not even a twitch in his finger. The pain was still burning through his left side. It was as if someone had shoved a red-hot poker under his fingers and was threading it up his arm and to his neck.\n \n“What the hell was that?” Tony’s voice cracked as he spoke.\n \n“Looks like his reflexes have returned,” Strange said with an audible wince. “His strength, it seems, has not been affected by his time unconscious. His healing is remarkable.”\n \n“Jesus, kid,” Tony breathed.\n \n“Daddy, is Peter going to wake up now?” It was the child voice again, soft and innocent. The third heartbeat in the room.\n \n“Morgan! How long have you been here?” Tony said.\n \nPeter heard the shift of fabric on fabric and the small sound of a kiss being pecked to someone’s cheek.\n \n“I was looking out for him, like you said too,” Morgan said quietly.\n \n“Perhaps best not to be alone with Peter anymore,” Strange said. “His senses appear to be in overdrive and are protecting him from any potential danger.”\n \nWas he in danger? Was it Thanos? Had they lost again?\n \n“Why is he moving now? After all this time?” Tony asked.\n \n“I can’t be certain,” Strange said. “But his body may be allowing him to wake as the healing process begins to slow.”\n \nPeter wanted to listen too more, he wanted to know what happened to him, what was happening now, but the darkness claimed him once more.\n \n \nThe fourth time Peter woke up the pain wasn’t as bad. He could still feel it pulsing through his left arm, but it was if someone had been running a current through his arm for too long, it felt hot, painful and numbing all at the same time.\n \nIt wasn’t the pain that had woken him up though. There was something rest against his right side and there was the scent of something sweet and artificial.\n \n“Don’t tell daddy,” Morgan’s voice was now recognisable, but he wasn’t sure who she was. “I snuck you a grape popsicle.”\n \nSomething cold was pressed into his hand and his cheek muscle twitched.\n \n“I can’t sleep, so I thought I would keep you company,” Morgan said. “I brought you another teddy, too.”\n \nCurious and his right hand starting to go numb with the popsicle, Peter pried his eyes open. He blinked slowly; the room coated in a haze that slowly came into focus. The room was dark much to his relief, the only source of light coming from the hands of who Peter assumed was Morgan. It took him a moment to put it together. She was wearing red knitted gloves that looked like Iron’s man’s hands with a small glowing light in the middle that resembled pulsars.\n \n“This teddy’s name is Tea Cup,” Morgan said.\n \n“Good name,” Peter rasped, his voice barley above a whisper. His mouth felt like it was coated in wet glue and his throat burned but it was good to speak.\n \nMorgan whipped around, her eyes widening and her jaw dropping. “Peter? You’re awake.”\n \n“I guess,” Peter whispered. He grimaced and looked at the popsicle in his hand. Maybe that would sooth his throat. “Think you could open my popsicle?”\n \nMorgan scrambled for the treat, Peter sighing with quiet relief as the coolness left his fingers. She got the wrapping undone and twisted her body until she was on her knees, holding the popsicle in hand.\n \n“Here you go!”\n \nPeter lifted his hand, trembling as he took the popsicle by the stick. He brought it to his lips, aware the Morgan was watching his every move. The treat was cool on his tongue and as he slowly sucked the treat, it trickled down his throat, gently cooling him. It didn’t do much to help the slick coating that filled his mouth but at least it tasted better.\n \n“Thank you,” Peter said.\n \nMorgan beamed, pushing her hair from her face. “I told daddy you would like the popsicle.”\n \n“Whose daddy?” Peter asked before sucking on the popsicle again. He was making quick work of it, unable to stop chewing on the soft ice.\n \n“You don’t remember our daddy?” Morgan’s face fell. “Daddy said you wouldn’t know that I was your little sister ‘coz you were gone for a while. He didn’t say you would forget him too.”\n \nPeter swallowed a chunk of popsicle, nearly choking but managed to get it down. Our daddy? Peter thought. The only father figure Peter had was Tony, but they had never discussed it and after going to space when Tony hadn’t wanted him there, he wasn’t sure if Tony even wanted to mentor him anymore. Looking closer at Morgan though, he could see similar features. The same dark hair, the same intelligent eyes staring at him sadly. If Tony Stark was every going to have a daughter, she was it.  \n \n“Iron man,” Peter rasped. “Dad.”\n \n“Irondad,” Morgan beamed. “He’s our daddy! You remember!”\n \nPeter’s hand dropped as his mind swum. His eyes were getting heavy again and he was struggling to fight off the sleep that wanted to claim him once more.\n \n“Can you tell dad something for me?” Peter asked quietly.\n \n“Uh huh,” Morgan nodded eagerly.\n \n“Tell him I said I’m sorry,” Peter said.\n \n“What are you sorry for?” Morgan titled her head to the side.\n \nPeter shook his head lightly, his vision swimming at the motion. “Tell him I love him.”\n \n“I will,” Morgan said. “He loves you too. He tells you and me every day that he loves us. I love him 3000.”\n \nPeter smiled, his eyes beginning to droop. “Hey Morgan?”\n \n“Yeah?”\n \n“It’s nice to meet my little sister,” Peter told her.\n \n“I love you too, Peter. It’s nice that you’re awake,” Morgan said.\n \n“I’m just going to rest again,” Peter said, his eyes already having slid closed. “Thanks for Tea Cup.”\n \n“I should be asleep too,” Morgan said. “I’ll sleep with you!”\n \nPeter felt her settling down into his side, turning so her head laid on his chest and her little arm coming across his stomach. He had just enough energy to wrap his arm around her shoulders to keep her close before he slipped into sleep once more.\n \n \nTony peeked his head into Morgan’s room but wasn’t surprised to see it empty. There was little that could contain the energy of a four-year-old and the sun only having just risen wasn’t one of them. He and Pepper often found her downstairs watching morning cartoons, waiting for one of them to come and make her breakfast.\n \nContinuing past Morgan’s room, Tony paused at the closed door. When they had first found the lake house, he had made sure to have a room for Peter. He didn’t know how or when he was getting Peter back, but Tony knew that one day he would. He could not stop thinking that because the moment he did was the moment he had given up. Shaking his head to clear those thoughts, he pushed open the door and stepped inside.\n \nAs his eyes adjusted to the dark room, a fond smile took over his face and he sighed. It was nearly impossible to keep Morgan out of Peter’s room. When Tony and Pepper had first explained to her who Peter was when he had returned, she had been thrilled to have an older brother. She went and spoke to him every day, demanding that he wake up and play with her. He didn’t but it didn’t stop Morgan from tyring the next day.\n \nEven after Peter, still unconscious, grabbing Strange’s wrist and nearly snapping it  nearly a month ago hadn’t stopped her from sneaking into Peter’s room with no adult supervision. Tony stepped further into the room. He noted that another teddy bear had joined Peter’s bed and that there was now a giant purple stain on the sheets that Tony knew had once been a popsicle. A dirtied stick was held limp in Peter’s hand and Tony shook his head fondly at Morgan’s antics.\n \nHe moved slowly, praying that Peter’s senses didn’t go off and gently lifted Morgan.\n \n“Daddy,” Morgan yawned, wrapping her arms around his neck and planted a sleepy, wet kiss to his cheek.\n \n“What have I said about sneaking into Peter’s room?” Tony huffed, gently poking her sides.\n \nMorgan squirmed in his arms and giggled quietly. “I couldn’t sleep so I brought Peter a popsicle.”\n \n“I can see that,” Tony eyed the stain again. They would have to change the sheets again. It was easier when Strange used to magic to lift Peter to change the sheets. That way they could avoid causing any more damage to the kids left side. It was a good thing the Wizard was dropping by the check up on Peter. “Did he enjoy it?”\n \n“He did!” Morgan said. “He fell asleep before finishing it though.”\n \n“Oh?” Tony indulged Morgan’s make-believe.\n \n“Yep! He said that he liked Tea Cup’s name too,” Morgan beamed. “He also said to tell you that he was sorry and that he loved you.”\n \nTony froze, eyes snapping to Morgan’s. It felt as if the breath had been knocked out of his lungs. They had never told Morgan exactly what happened to Peter, only that he had been hurt saving the world and that he was a hero. They had shown her videos of Peter and she often imagined what the two of them would do when he woke up but never had she said that he had spoken to her.\n \n“And he said that it was nice to meet me,” Morgan grinned. “Then we went back to sleep.”\n \n“Wait,” Tony’s voice came out hoarse. “Peter said those words? He was awake?”\n \n“That’s what I said, daddy,” Morgan huffed. “He didn’t stay awake for long though. He was still tired. Even after all the sleeping he’s done.”\n \nTony mind was reeling. Peter had woken up. Peter had woken up to his daughter sitting on the bed with him, eaten a popsicle and fallen back to sleep.\n \n“Did he say anything else?” Tony demanded.\n \n“No,” Morgan shook her head. “Daddy, can we make Peter some pancakes?”\n \n“Good idea,” Tony said, placing Morgan on her feet. “Mum’s in the kitchen, you go get started.”\n \nMorgan’s feet slapped against the floor as she raced out the room.\n \nTony staggered forward to Peter’s bed. He removed the wooden popsicle stick, feeling the stickiness and tossed over his shoulder. He gently took Peter’s hands, his own shaking and squeezed.\n \n“Kid?” Tony asked, not daring to make his voice too loud.\n \nPeter’s chest rose and fell but there was no other sign.\n \n“Come on kid,” Tony breathed. “Just, give me something. Please. Just let me know you’re okay.”\n \nHe gently leaned down and kissed Peter’s forehead. Pulling back his hand tightened in Peter’s when the boys head rolled to the side, facing Tony. His lips smacked together in his sleep, not forming words but making a little noise before he resumed a peaceful rest. Tears sprung to Tony’s eyes, a shocked, joy laugh tumbling through his lips.\n \nIt was the most he had seen Peter move in nearly a month.\n \n \nThe fifth time Peter woke up he was alone. It didn’t take him nearly as long to open his eyes and they adjusted fairly quickly. Inhaling sharply, Peter grunted as he heaved himself up into a sitting position. His vision swam for a moment before it settled once again. Moving more slowly, Peter shifted until he was leaning against the headboard.\n \nThe room was lighter, but the curtains blocked the bright natural light he knew would be streaming through if they had been open. Peter was grateful they had remained closed. He took in the room, recognising small things but overall the room was new to him. There was bedside table and a desk in the room along with a bookshelf. Pictures he recognised were scattered around the room and drawings obviously done by Morgan decorated his walls. He smiled at the thought of her colouring something for him.\n \nOn the bedside table there was a bottle of water and Peter reached out to get it. He hissed as his left arms tugged at the movement and glanced at his arm. Black veins worked from his fingers up his arm, disappearing into the sleeve of the t-shirt he was in. Working downwards, Peter saw that his wrist, palm and fingers looked as if they had been submerged in a bath for hours and then coloured grey. It made his stomach churn to look at it and he reached for the bottle again.\n \nHe took small sips, sighing with relief. He really needed to brush his teeth and swirl a gallon of mouth wash. He could hear voices downstairs and the sound of a TV running. Finishing half the bottle, Peter placed it back on the table and took a deep breath. Pushing back the covers, he gently swung his legs off the bed.\n \nHe stood, his knees shaking so badly he had to clutch the bed. He waited several moments for them to stop shaking too badly before he could take a step. Painfully slow, he made his way across the floor, clinging to the wall with his good hand, glad that his powers still worked, and he stuck solidly to the wall. He reached the door and pushed it open.\n \nThe sound of voices grew louder, and Peter heard more voices than before. He could make out Pepper, Tony, Morgan and Strange. Then heard Steve’s voice, Clint’s, Scott’s and Bruce Banner. Even Thor’s deep voice was there. Peter’s heart rate picked up and swallowed thickly. He wanted to crawl back to the bed and hide again but the overwhelming need to see Tony, to hold him and prove to himself that his mentor was okay had him walking silently down the hall.\n \nBy the time he reached the stairs he had to sit down. He knees trembled almost violently and hands shook as he clutched the railing, to keep himself steady. He could smell lunch cooking and it made his stomach tighten. He was starving and the thought of food had him salivating. Licking his lips, Peter slowly scooted down each step, one at a time. He clutched the banister tightly, hoping he didn’t leave any dints along the way and mentally promised to fix them if he did. By the time he reached the bottom he was panting and ready to fall asleep again. He felt hot and sweaty and gross but determined to eat something.\n \n“You’re awake again!” Morgan grinned, suddenly standing in front of Peter.\n \n“Hey,” Peter smiled automatically back. “I guess I am.”\n \n“The Wizard didn’t think you would wake up in time for lunch,” Morgan said, eyeing him curiously. “Or dinner.”\n \n“Well, I’m pretty hungry,” Peter said.\n \n“Come to the kitchen! Mummy is making sandwiches and mac and cheese,” Morgan jumped on the balls of her feet.\n \nPeter winced at the idea of making it all the way to the kitchen. “I don’t think I can.”\n \n“How come?” Morgan pouted. “You said you were hungry.”\n \n“I am,” Peter said. “I’m just, I’m really tired.”\n \n“You’ve been asleep for ages though,” Morgan whined.\n \n“Have you ever sat on your leg for too long and it went really tingly and numb?” Peter asked.\n \nMorgan’s eyes widened. “Yes!”\n \n“That’s what my whole body feels like,” Peter said.\n \n“When I did that, daddy carried me until the pain went away,” Morgan said. “Do you want me to get daddy to help you?”\n \n“Yeah,” Peter nodded. “That would be great.”\n \n“Okay,” Morgan beamed and went running off, loudly calling, “Daddy! Peter needs help to the kitchen! His body is all tingly and he’s really hungry!”\n \nThe chatter in the kitchen stopped, heavy silence filling the air before the sound of a chair scraped across the floor and heavy footsteps came racing out. In an instant Tony was in front of Peter, his mouth open, eyes drinking him in.\n \nPeter swallowed and licked his lips. “I really need to brush my teeth.”\n \nTony choked on a laugh before he was dropping to his knees in front of Peter and pulling him into a tight hug.\n \n“Jesus, Underoos,” Tony gasped in his ear.\n \n“I’m sorry,” Peter whispered and then his was sobbing, shaking as he cried over and over that he was sorry.\n \n“Shhhh,” Tony rubbed his back. “It’s okay kid, I got you. Just try and calm down.”\n \n“I’m sorry,” Peter whimpered. “I didn’t know- know what else to do.” He hiccupped, pain radiating down his left side that only made him cry harder. “I’m sorry, please. I’m sorry.”\n \n“Shhh, Pete,” Tony palm smoothed the back of his head, tucking him into the crook of his neck. “It’s okay. Jesus, nobody’s mad at you. I’m not mad at you. I’m so glad your awake, kid. You have no idea. Jesus, you scared the shit out of me.”\n \n“I’m sorry,” Peter sobbed.\n \n“No more apologies,” Tony said softly in his ear. “You were amazing, Peter. I’m so proud of you.”\n \nMore tears rolled down Peter’s cheeks and he sobbed helplessly into Tony’s shoulder. He must have drifted off onto Tony’s shoulder because when he opened his eyes again, he was on a soft couch nestled in a bunch of pillows. His eyes stung and he could feel how puffy they were. He resisted the urge to rub them and instead swung his feet onto the floor.\n \n“Hold it right there,” Tony voice filtered over his shoulder. “You are not off bed rest young man. I don’t even want to know how you managed to get down the stairs.”\n \n“You are defying all expectations, Peter Parker.”\n \nPeter turned at the husky voice and found Strange standing behind him with Tony. The two of them walked around to his side of the couch and perched on the coffee table.\n \n“How are you feeling?” Strange asked.\n \nPeter pursed his lips. “Tired. Starving. Sore. Gross.”\n \n“We will grab you some food in a minute, kid,” Tony said. “Honestly, on a scale from one to ten how much pain are you in?”\n \nPeter bit his lip. “A seven.”\n \n“Do you know what happened?” Strange asked.\n \nPeter swallowed loudly, dropping his gaze to his lap. He stared at his mutated hands and the black veins that spread up his arm. He hadn’t known this is what would happen. He didn’t realise that once his put the gauntlet on, the pain would nearly white out his vision, that it would sear into his very bones and that snapping his fingers would be nearly impossible. He didn’t know that his left side would be severely damaged and broken and wrong.\n \nAll he had known that there was a swarm of aliens heading for him. He was alone, trapped and about to die and he did the only thing he could think of. He had shoved his hand into the gauntlet and snapped his fingers.\n \n“I,” Peter licked his lips again, voice barely coming out above a whisper. “I did something really stupid.”\n \n“You did something incredibly brave,” Tony said sharply. “and something that stupid doesn’t even begin to cover.”\n \n“I’m sorry,” Peter whispered, tears stinging his eyes again.\n \n“You saved the world,” Strange softly. “You stopped Thanos and returned all those who had been lost.”\n \n“You saved us, kid,” Tony said.\n \n“How – how long have I been asleep for?” Peter asked once he had regained control of himself once more.\n \n“Nearly four months,” Strange answered.\n \n“We thought,” Tony swallowed thickly. “We thought it had killed you. I thought- Jesus, kid I thought I had lost you again. But, by some bloody miracle you started breathing. Strange opened a portal and got you to a hospital and got you stabilised. Eventually we moved you here.”\n \n“Where is here?” Peter asked.\n \n“It’s home,” Tony said.\n \nHome. Peter liked the sound of that. It was best thing he had heard in a long time.\n \n“My arm – will it always be like this?” Peter asked quietly.\n \n“I don’t believe so,” Strange said. “This is a vast improvement from four months ago.”\n \nPeter blinked at his arm. “This is better?”\n \n“Trust us kid. It’s better,” Tony winced and scrubbed a hand down his face.\n \nWincing at Tony’s action, Peter averted his eyes again. He drew his arm in close, attempting to hide it behind a pillow but he hissed as the fabric brushed against his sensitive skin.\n \nStrange cleared his throat and stood. “I’ll find you something to eat. While we have been giving you nutrients and a liquid diet, I think something plain might be best for your stomach to start off with.”\n \nPeter swallowed as he was left with Tony and chanced a look at his mentor. He was surprised that Tony was staring at him with such emotion.\n \n“I can’t believe you’re here, kid,” Tony shook his head. “I thought I had honestly lost you again and it nearly killed me. You’re my kid and I couldn’t protect you.”\n \n“It wasn’t your fault,” Peter insisted. “I choose to be there. I’m sorry I disappointed you.”\n \nTony let out a breath. “Oh kid, you are never a disappointment. You are the bravest kid I have ever met. What you did, I could never be mad at you for saving everyone. I just wish I could have saved my kid from this.” He waved his hand at Peter’s arm.  \n \n“Am I? You kid I mean?” Peter asked quietly. “You have Morgan now and-“\n \nPeter was cut off by Tony lunging across and pulling him into a hug. “You’re my kid. End of story. Morgan needs her big brother, I need you. Don’t ever scare me like that again. I physically cannot cope with you losing you again.”\n \n“I love you,” Peter mumbled against Tony’s neck.\n \n“I love you too.”\n \nPeter embraced Tony’s warmth, sighing at the relief that, for now, everything was okay. That he had a place, a home and that he had saved the people who were most important to him.\n \n \n“Peter?”\n \nGroaning at the too loud voices, Peter curled himself up tighter in a ball.\n \n“Peter!? Shit kid, where are you? PETER!”\n \nThe fear and panic in the voice was so strong that Peter could practically taste it. It made him curl up even tighter, his limbs straining and protesting. The retreating footsteps were to heavy and the force vibrated up his right side and across his cheek bones. Peter whimpered at the stimulation and flinched. White hot pain radiated down his left side, causing him to gasp and his eyes to fly open.\n \nLight filtered through the room and slowly Peter blinked as he came face to face with the wooden floor.\n \n“Wha’?” he slurred as he uncurled his body. His muscle spasmed for a moment before they relaxed and could stretch himself flat on his back. Peter made to sit up, shoulder’s lifting from the floor before his head smacked something hard with a loud bang.\n \n“What the hell?” Peter hissed, his right hand coming to rub at the throbbing pain in his head. Gritting his teeth against the pain, Peter squinted for a few seconds before his brain registered what he was actually seeing.\n \nTurning his head to the right, Peter could make out the bottom half of a door. With a groan, his shuffled himself towards it, mindful of his left side and his head. After a minuet of careful shuffling, the room expanded, and Peter could finally sit up properly without the risk of injuring himself. He shifted and propped himself against the edge of the bed he had just climbed from under and rubbed at his head.\n \n“Where the hell did he go?”\n \n“He can’t have gotten too far.”\n \n“We’ll check the surrounding woods.”\n \n“Tony, I’m sure he’s fine. Maybe he just went for a walk. There is no sign that he was taken.”\n \nPeter frowned at the voices. Why did they think he had been taken? Was there danger? Other than his senses being dialled to about thirteen there was nothing telling him that he was in danger. But Peter knew he couldn’t always rely on it – especially when there didn’t seem to be any immediate threat. Was Tony in danger? Was Morgan? Using his right hand, Peter pushed himself to his feet, needing a second to make sure he was stable. His left arm was encased in a sling, the damaged arm hidden from view.\n \nThe first time he had woken up from a nightmare, he had seen his arm damaged, broken and grey. He immediately flew into a panic, believing that his body was once again turning to ash. He could taste it in his mouth, could smell the decay and he stumbled out of bed, tripping over the blankets. He hadn’t even made it to the door before it banged open and Tony was there.\n \n“I don’t want to go,” Peter sobbed in a panic. “I don’t want to go. I’m sorry, please don’t make me go.”\n \nTony, pale faced had gripped him tightly. “You’re okay, Pete. Breathe. You’re not going anywhere. Okay. Listen to me. You’re on Earth.”\n \n“My arm,” Peter gasped, choking on the words. “Please, Mr. Stark. I’m sorry. I don’t want to go.”\n \nStrong, calloused hands had gripped his face. “Peter. Listen to me kid. You’re okay. It’s over. You aren’t dying. Look at me. Look at me. That’s it. You’re okay. Your arm is from the gauntlet. You saved us. It’s all over kid, your safe.”\n \nIt had taken Tony a while to calm him down, to assure Peter that it was all real. Peter had slumped into Tony’s chest, face pressed against the triangular reactor as his listened to the solid beat of Tony’s heart. Then he vomited down the front of himself and Tony.\n \n“It’s okay, Kid,” Tony rubbed his back, never once pulling away as Peter heaved over their feet. “Let it out.”\n \nSince then they had wrapped his arm in a sling during the night too so that if Peter woke up from a nightmare, it wouldn’t trigger such an epic response.\n \nWorry starting to gnaw at Peter’s stomach, he crossed the bedroom to the door. He pulled it open and stepped out into the hallway. It was empty but it didn’t surprise Peter. He could hear that the voices were outside. He made his way downstairs and through the living room. He looked out the window to the lake. Hovering above the lake he could see Sam flying above but there was no-one else out that way, so he made his way to the front door.\n \nPeter pushed it open, the scent of the lake washing over him. He squinted at the bright light and blinked several times before he adjusted. He stepped out onto the veranda and shut the door quietly behind him. His bare feet made no sound as he padded his way over to Pepper and Morgan.\n \nMorgan was hugging Pepper’s leg as the two of them looked towards the woods in silence. Pepper’s hand was buried in her daughter’s hair, gently massaging as Morgan gently kicked her gumboot encased foot against the pole.\n \n“Mum? Where did Peter go?” Morgan asked.\n \nPeter’s eyebrows flew up.\n \n“He just went for a walk,” Pepper lied.\n \n“Why is everyone so worried?” Morgan asked. “Is it because he didn’t ask for permission first? You told me I always have to ask first before I go outside.”\n \n“You do,” Pepper agreed. “Peter just forgot. He’s still recovering, and we just want to keep an eye on him.”\n \n“So he doesn’t get hurt,” Morgan stated.\n \n“Exactly,” Pepper smiled down at her daughter’s head. “Dad will find him and bring him back for lunch. We should get started on that.”\n \n“I’m pretty hungry,” Peter said, finally alerting the two to his presence.\n \nPepper and Morgan whirled around as one.\n \n“Peter!” Morgan grinned and raced over to him, crashing into his legs.\n \nManaging to keep upright, Peter cradled the back of Morgan’s head as he looked at Pepper’s relieved face. She crossed the veranda until she was right before him and gently cupped his face.\n \n“Oh, Peter, thank god. Are you okay? Where have you been?” Pepper rambled, eyes darting over him, looking for any sign of injury.\n \n“I was inside,” Peter told her quickly. “I just woke up.”\n \n“Woke up?” Pepper frowned. “Where were you sleeping? Tony checked your room and you were gone.”\n \nPeter felt his face flushing. “I – uh- I woke up under the bed.”\n \nPepper’s mouth dropped open but before she could say anything Morgan was giggling loudly and staring up at Peter. “Silly Pete! You sleep in the bed not under it!”\n \n“Ohhhh,” Peter exaggerated, making his eyes wide. “You do? Why didn’t you tell me!”\n \n“Let’s get you two inside,” Pepper said, gently pushing the two of them towards the door.\n \nMorgan took off running to the door, opening it up wide before dashing inside while Pepper gently steered Peter with her hand on the small of his back. As soon as they were back inside, Pepper was talking.\n \n“FRIDAY, please alert everyone that Peter is back at the house and he’s unharmed.”\n \n“Of course,” FRIDAY’s voice filtered above them.\n \n“You aren’t hurt, right?” Pepper asked, steering Peter to the kitchen table.\n \n“I’m okay,” Peter assured her. “Well, I did hit my head on the bed but there’s no pain.”\n \nPepper’s soft hand gently smoothed the curls from his face before she leant forward and placed a soft kiss on his forehead. “There, all better.” She smiled.\n \nPeter beamed and didn’t protest when she pushed him into a chair.\n \n“You gave us all a fright,” Pepper said as she moved to the fridge. She began pulling out ingredients for lunch and a bowl of soup specifically made for Peter as his stomach adjusted to having solid meals again. “Tony went to wake you up for lunch and you had just vanished.”\n \n“Sorry,” Peter winced. “I don’t know why I was under the bed.”\n \n“Maybe you fell out,” Morgan appeared at his side, climbing up onto the chair beside him. “I fell out of bed once!”\n \n“You did?” Peter grinned, assisting Morgan as much as he could.\n \n“Yep! I scraped my elbow too,” Morgan grinned proudly.\n \nPeter heard the whirling of Sam’s wings and the loud thud of him landing on the ground. Peter half listened to Sam taking off his wings and leaving them on the veranda as Morgan happily showed him her elbow and where the graze had been. A few minutes later and Sam was striding into the house.\n \n“You okay?” was the first thing Sam asked.\n \n“I’m fine,” Peter said and watched as Sam’s shoulder’s relaxed.\n \n“Good,” he nodded. “Don’t run off again.”\n \n“He didn’t run off, Sam,” Pepper said, a small smile tugging at her lips now that the worry and uncertainty had disappeared.\n \n“He was under the bed,” Morgan giggled.\n \nPeter’s cheeks flushed as Sam stared at him and he ducked his head.\n \n“Ohhh I can’t wait to hear this explanation,” Sam slowly grinned and he moved into the kitchen to help Pepper.\n \nIt wasn’t long before Peter heard the rest of the team hurrying across the front yard and vaulting up the front steps.\n \n“Peter!”\n \n“We’re in the kitchen,” Pepper called, smiling at Peter.\n \nTony was first through the door, immediately heading to where Peter sat. The younger boy managed to catch a glimpse of Steve and Rhodey before Tony’s worried face was right before him, eyes frantically searching over his face.\n \n“Christ kid, are you okay? Are you hurt?”\n \n“M’ fine,” Peter assured his mentor.  \n \n“Fu-uh-udge,” Tony nearly swore. “You can’t just walk off like that kid. Tell someone. Me, FRIDAY, I don’t care just someone! You could have hurt yourself.”\n \n“Oh, he didn’t run off,” Sam said.\n \nTony looked up sharply and Peter felt his cheeks flush hot and he dropped his eyes to his lap.  \n \n“Peter fell off his bed,” Morgan said brightly. “and he hit his head.”\n \nPeter groaned, wishing he was back under the bed as Tony’s sharp gaze landed back on him.\n \n“I didn’t fall off the bed,” Peter hurried to say. “I just woke up under it.”\n \n“Interesting,” Doctor Strange’s hummed and Peter looked around Tony to see that along with Bruce, Thor and Clint he too stood around the kitchen.\n \n“I’m okay,” Peter said quietly, looking back at Tony. “I’m sorry.” His eyes closed at Tony ducked and pressed a kiss to the top of his head. He leaned into the hand that swept through his curls.\n \n“It’s okay, kid,” Tony said. “As long as you aren’t hurt.”\n \n“M’ not. Promise,” Peter said.\n \n“Lunch is nearly ready,” Pepper said, and her words caused a flurry of movement as everyone moved to take a seat.\n \nTony took a seat next to Peter, dragging his seat almost to close. Peter didn’t mind and allowed himself to be tucked into Tony’s side. The lingering worry all but vanished as he leant into Tony’s side.\n \n \nPeter was currently taking three naps a day since he had woken up from his coma. He was exhausted constantly and was only truly awake for breakfast, lunch and dinner. Peter often woke on the couch with Morgan pressed against his side and a Disney movie playing in the background after his second nap. Sometimes he woke with his feet in Pepper’s lap and more than once he had woken up on Tony’s chest as the man worked on his Stark Tablet.\n \nSo, when Peter woke from his second nap of the day and he was alone his body instinctively screamed at him to get somewhere safe. He was vaguely aware that he was moving but he couldn’t think past the constant get safe, get safe, get safe, that his body was shrieking at him. Eventually the feeling begun to fade, and Peter drifted off once more.\n \n \n“How did he even get up there?”\n \n“Should we move the couch under him in case he falls?”\n \n“Probably not a bad idea.”\n \n“I don’t know, he looks pretty wedged.”\n \n“How do we get him down?”\n \n“Have you got a broom?”\n \n“Don’t even think about it, bird-brain.”\n \n“I believe I can safely get him down.”\n \nThere was silence and Peter was overwhelmed with the distinct smell of magic that he associated with Doctor Strange. Slowly he opened his eyes and blinked when he saw Strange’s head poking out of a portal he had created.\n \n“Hello, Peter. Are you awake?” Strange asked.\n \n“S’loud,” Peter yawned. “What’s s’going on?”\n \n“I just need you to come with me for a moment,” Strange said. “You can go back to sleep afterwards.”\n \n“S’go where?” Peter cracked open an eye. “Tony? He okay?”\n \n“He’s fine. He’s waiting for you to come with me,” Strange said.\n \n“He left?” Peter cracked open his other eye, fighting the tiredness that wanted to claim him back to sleep. “Where did he go? Why didn’t he tell me?”\n \n“He’s still here. We just need you to come down,” Strange quickly placated.\n \n“Down?” Peter repeated.\n \n“You fell asleep in the rafters,” Strange explained.\n \nRolling his head to the right, Peter look down and blinked when he saw a worried crowd below him. “Oh.”\n \n“Can you come down with me?” Strange offered a hand through the portal.\n \nPeter took the hand, allowing Strange to tug him to his feet and sluggishly he stepped through the portal and onto the hardwood floors of the lake house. The portal closed behind him, the scent of magic lingering for a moment before it too vanished.\n \n“There we go,” Strange cooed quietly.\n \n“Tony?” Peter blinked tiredly at the group that now was on his level. He stumbled forward as his mentor pulled him into his arms and shoved his face into Tony’s chest, breathing in the familiar scent of his cologne and motor oil before he was fading into a calming sleep.\n \n \nWhen he woke up next, he was wedged between the couch and Tony, safely tucked into the crook of Tony’s neck.\n \n“You awake again?” Tony asked, a hand gently smoothing over his cheek.\n \n“M’awake,” Peter smacked his lips. “Dinner time?”\n \n“Nearly, buddy. How are you feeling?” Tony asked.\n \n“Feel good,” Peter yawned and snuffled closer into Tony’s neck. “Safe. Warm. Hungry,”\n \n“I bet you are,” Tony huffed out a laugh. “Your little adventure to the roof must have taken a lot out of you.”\n \n“My what?” Peter lifted his head, frowning at Tony.\n \n“You don’t remember?” Tony asked.\n \nPeter shifted through the fog in his brain to recall the last time he had woken up. He remembers the smell of magic and Doctor Strange and there was a lingering feeling of not being safe for a moment.\n \n“I…the wizard woke me up,” Peter frowned. “Said you needed me?”\n \n“We found you asleep up in the rafters,” Tony titled his head back.\n \nPeter followed his gaze and frowned. “I was up there?”\n \n“Yep,” Tony said, popping the ‘p’ sharply. “No idea how you got up there. Gave Pepper quite the fright when she got off the phone to find you missing again.”\n \n“Sorry,” Peter righted his neck. “I – I don’t know why I went up there.”\n \nTony shifted so he could look at Peter properly. He lifted a hand and gently smoothed Peter’s unruly curls before coming to cup his ear. “How’s your arm? Does it hurt at all?”\n \nLooking down at his sling, Peter waited to feel any sharp pain in his arm but found none. “No, I don’t feel any more than usual.”\n \n“Okay, good,” Tony’s thumb brushed against his cheek. “Kid, you’re making me go grey and you know I have a heart condition.”\n \n“Sorry,” Peter said again.\n \n“No, don’t be. I know you aren’t doing this on purpose,” Tony said. “I just want to figure this out, so you don’t end up hurting yourself.”\n \n“Or give you any more grey hairs,” Peter teased.\n \nTony gently tugged on his ear. “They’re all from you. Every single one.”\n \nPeter squawked. “You had them before you met me.”\n \n“Lies,” Tony grinned.\n \n“Do you think something is wrong with me?” Peter asked quietly, picking at his sling. “Because of what I did?”\n \n“Honestly, I don’t know,” Tony said. “But we are going to figure it out.”\n \n \n“Peter? What are you doing in my toy chest?” Morgan asked.\n \nPeter blinked his eyes open and groaned out aloud when he realised that Morgan was right. His limbs were tucked up, bad arm safely tucked against his chest with an array of stuffed animals and toys mostly covering him. He remembered he had eaten pancakes for breakfast and then he must have fallen asleep at the table because he didn’t remember moving.\n \nMorgan giggled. “Did you fall asleep somewhere funny again?”\n \n“I guess,” Peter pouted. “Want to help me up?”\n \n“Okay,” Morgan helped removed the toys that covered Peter’s chest. When they were clear she took his good hand and helped him stand out. Peter was a little shaky as he heaved himself out of the toy chest. He was lucky that Morgan had so many toys that she required a large toy chest.\n \n“Thanks, Mo,” Peter said.\n \n“No worries,” Morgan beamed. “Want to have a tea party with me?”\n \n“Sure,” Peter said. He felt bad that he was always falling asleep on Morgan and so he didn’t mind when she asked him to have a tea party with him or asked him to dress up with her. He liked the idea of having a little sister, his insides feeling warm and safe and happy.\n \nThey set up on Morgan’s rug, and Peter happily played along as she poured them tea and even recruited a couple of her stuffed bears to join them.\n \n“Oh shit, not again,” Peter heard Tony mutter from the level below. “Pep! He’s gone again.”\n \n“Oh dear,” Pepper murmured. “I don’t see him in the roof.”\n \n“Shit, you think he got outside?” Tony asked. “God, Pep my heart can’t take this much more.”\n \n“Hush, he’ll be okay,” Pepper soothed. “He’s just finding places to sleep.”\n \n“What if he hurts himself? He’s sleepwalking and climbing with one good arm,” Tony was working himself up that Peter could almost feel it from where he sat.\n \n“FRIDAY, tell Tony I’m in Morgan’s room,” Peter said.\n \n“Of course, Peter,” FRIDAY responded.\n \nHe heard the AI relay the message downstairs and before she had even finished, Peter could hear Tony rushing up the stairs.\n \n“Good idea!” Morgan was saying. “Daddy should have some tea too. Mum as well.” She picked up two more teacups and placed them in the middle of the circle they had created.\n \n“Hey kids,” Tony appeared in the doorway, trying to look as if he hadn’t just sprinted up the stairs. “What are you doing?”\n \n“Having tea,” Morgan said brightly. “Come play with us.”\n \n“Sure,” Tony said. He crossed the room, shifting one of the bears across so he could sit in between Morgan and Peter. “Right, what are we having?”\n \n“Tea,” Peter said. “It’s pretty good. Very fruity.”\n \n“Ahh, excellent,” Tony picked up the plastic cup and held it out to Morgan. “Alright, little Miss. Fill me up.”\n \nMorgan grabbed the matching plastic tea pot and tilted it over the cup. Nothing came out except for their imaginations.\n \n“Ahh, that’s hot,” Tony faked winced.\n \nPeter sensed Pepper in the doorway and before he could turn, Morgan was smiling brightly and saying, “Mum, come join us for tea!”\n \n“Oh, of course. Thank you,” Pepper crossed the room and folded herself down onto the floor and picking up the last cup.\n \n“You wake up early Pete?” Tony asked as Morgan pretended to fill Pepper’s cup.\n \nPeter winced. “Woke up in Morgan’s toy chest.”\n \nTony glanced over his shoulder and when he turned back his eyebrow was lifted high in amusement, but Peter could sense the worry lingering underneath.\n \n“Well, better than the roof,” Tony quipped. “Unless Morgan mistook you for a toy.”\n \n“Nearly,” Peter laughed.\n \nMorgan giggled. “No! I knew it was Peter.”\n \nPepper small, warm hand gently squeezed his knee. “You do have a lot of stuffed toys. No wonder Peter crawled in there.”\n \nPeter’s cheeks flushed pink and he hurried to take a sip of his imaginary tea.\n \n \n“Sleep walking can be triggered by stressful situations,” Bruce said. “After what we all went through, it’s not surprising or uncommon.”\n \nPeter, Tony, Bruce, Doctor Strange and Steve were all seated around the kitchen table, discussing Peter’s new kick of sleeping in strange places. Pepper had taken Morgan into town to do a grocery run, leaving them to discuss what was happening.\n \n“Have you been dreaming?” Bruce asked.\n \nPeter shook his head. “Sometimes. Not always though. Mostly at night.”\n \nBruce nodded and jotted something down in his notebook.\n \n“Do you think something is triggering it?” Steve asked, looking between the two doctors.\n \n“Perhaps,” Strange said. “Peter, what are you feeling before you sleep?”\n \n“Tired,” Peter answered promptly.\n \nTony snorted and Strange smiled at him. “Other than tired.”\n \nPeter shrugged. “Warm, I guess. Happy, safe.”\n \n“You said that before,” Tony said. “After we found you in the roof.”\n \n“Fell safe with you,” Peter said, cheeks flushing pink. “My senses have been wired high since I woke up. There not as bad with you.”\n \nTony gently smoothed Peter’s hair, tucking him into his side as they sat next to each other. “That’s good, kid.”\n \n“Really good,” Bruce said. “It’s great you are feeling safe here.”\n \n“The time you found yourself in strange places,” Strange said. “You were alone, correct?”\n \n“I guess,” Peter frowned.\n \n“What I mean is, Tony wasn’t near you. Or at least not in the same room when you were gaining consciousness,” Strange elaborated.\n \n“Where are you going with this?” Steve frowned.\n \n“Peter said he was feeling safe with, Tony. Perhaps when he was waking, he wasn’t feeling safe and simply moved somewhere he couldn’t easily be found,” Strange said.\n \n“That would make sense,” Bruce nodded. “Spiders will often find high places or dark corners to hide during winter to save them from the cold. A place where they can’t be hurt or killed.”\n \n“You’re injured too,” Strange continued. “Your instincts are telling you to get somewhere safe while you heal. Obviously you can control it while you are awake but as you have been sleeping most of the time –“\n \n“I’m sleepwalking to places where a spider would hide,” Peter finished. “Awesome.”\n \n“No, not awesome,” Tony huffed. “How do we stop it?”\n \n“It should ease once his arm heals a little more,” Strange said. “And when he stops needing to sleep as much.”\n \n“And until then?” Steve asked. “Tony’s right. He can’t continue sleepwalking all the time.”\n \n“We just need to find a way to convince Peter’s unconscious state that he is safe,” Bruce said. “Peter, you said Tony makes you feel safe. What is it exactly that makes you feel that way?”\n \nPeter shifted uncomfortably. He knew exactly what made him feel safe with Tony, but he wasn’t sure how comfortable Tony would feel sharing it with the whole table. He knew that the older man struggled with the emotional side of things and while they were now in a place where they could hug, Peter wasn’t sure if they were at a talking stage with it.\n \n“It’s okay, Peter,” Tony soothed. “No need to feel embarrassed. Of course, you feel safe with me. I’m Iron Man.”\n \nPeter rolled his eyes at the joke but felt better that Tony was easing his discomfort.\n \n“I lied, I don’t feel safe with you at all,” Peter quipped back.\n \nTony scoffed. “Sure, kiddo. Keeping tell yourself that.”\n \nPeter grinned. “It’s actually Pepper.”\n \nTony mocked glared at him. “Rude.” And he poked Peter in his good side.\n \n“Okay, okay,” Peter squirmed. “It’s your smell. You smell familiar and like home. The sound of your heartbeat and your reactor. It makes a humming sound. It’s too quiet when you’re not there.”\n \nTony’s arm around his shoulder tightened as he spoke.\n \n“That’s great, Pete,” Bruce said. “These are things we can replicate. We can start by you wearing something of Tony’s. Like a hoodie or something so it has his scent on it and we can record his heartbeat so we can play it in your room.”\n \nPeter perked up. “Can I have the MIT hoodie?”\n \n“What? No – how do you know about that?” Tony frowned. “Have you been going through my closet?”\n \n“Noooooooo,” Peter chuckled nervously. “You always talk about MIT.”\n \nTony hummed, unconvinced. “Sure kid.”\n \n \nThe next morning, Tony beamed as Peter came shuffling into the kitchen, curls slicked upwards from sleep and drowning in the too big MIT hoodie. His kid looked adorable as he grinned sleepily at Tony, shuffling over to his side where he stood at the counter cooking pancakes.\n \n“Smells good,” Peter hummed, leaning into Tony’s side.\n \n“You sleep okay?” Tony asked.\n \n“Yeah, great,” Peter grinned. “This hoodie is comfy.”\n \n“Looks good on you, kid,” Tony agreed. “Go sit down. These are nearly ready.”\n \nTony felt a kiss pressed to his cheek before Peter shuffled away to go sit at the table. Tony’s shoulder’s relaxed in relief that his kid was safe and healing.\n \n \n \n \n\n \n\nThe pale blue numbers 3:45 mocked Peter and he sighed in the darkness of his room, rolling his head to stare back at the ceiling. He knew it was going to be a bad day. He knew it when the clocked had flicked over to midnight and he was still awake. It’s not that Peter didn’t want to sleep, he did, except it just wouldn’t come. His body was tired, his eyes were tired but his mind would not stop turning.  So, he had laid there all night, listening to the crickets and the sounds of the lake.\n \nPeter froze when he heard a murmur through the walls that separated his room and Morgan’s. As the murmuring got louder, Peter pushed himself up, listening closer.\n \n“Oh no,” Morgan sniffed.\n \nPeter threw back the covers and lifted himself off the bed. He crossed his room in an instant, opening the door and slipping silently into Morgan’s room. He shut the door behind him with a quiet click, eyes adjusting to the dark room easily.\n \n“Mo?” Peter whispered.\n \n“Peter?” Morgan hiccuped.\n \nCrossing the room, Peter switched on the lamp to brighten the room.\n \nMorgan sat in the middle of her bed, blankets thrown off and onto the floor. She sat utterly dejected, tears flowing down her cheeks and a wet stain spreading across the bottom sheet.\n \n“It’s okay,” Peter soothed instantly, rubbing her back with his good hand. “Shhhh, don’t cry. It’s okay.”\n \n“I – I wet the bed,” Morgan sobbed.\n \n“Shhhh,” Peter soothed. “It’s okay. Nothing to cry about.”\n \n“I didn’t – didn’t mean too,” Morgan hiccuped, rubbing at her eyes.\n \n“I know you didn’t,” Peter kissed her cheek. “Come on, let’s get you cleaned and into some dry clothes.” Making sure that his fingers and palm stuck to Morgan’s back, he used his sticky powers to lift Morgan.\n \nHe grinned when she let out a wet giggle she let out and he carried her over to the door. Opening it up quietly with his foot, Peter crept along the hallway and to the bathroom. He made sure the door was shut first before turning on the light – not wanting to wake up Pepper or Tony. Gently lowering Morgan to the floor, he made sure she was stable on her feet before unsticking his hand from her back.\n \nHe moved to the bath, turning on the taps and putting in the plug. Making sure the temp was okay, he turned to his little sister.\n \n“Alright, which would you like; Magic Bubbles or Soap-tastic-fun?” Peter asked.\n \n“Magic bubbles,” Morgan sniffed. “Please.”\n \n“You got it,” Peter said. “You want to take your PJ’s off while I get the bubbles?”\n \nMorgan nodded with a wet sniff and started pulling off her wet clothes.\n \nPeter rummaged through the cupboard for the bubbles and found them towards the back. He pulled them out, poured a generous amount into the tub before putting them back. He stood back up and paused when he caught his reflection in the mirror.\n \nHis skin was pale and drawn, dark circles under his eyes. His left eye was no longer covered in black and only his earlobe still held a slight bruising tinge to it. If Peter wore a turtleneck you would never know that his left side was disfigured. The greyish, I’ve-been-submerged-in-water-to-long look was gone but now held the look that he had been in a serious fire. But tonight, the black stood out against his too pale skin and it made his stomach churn uncomfortably.\n \n“’m ready,” Morgan said.\n \nPeter tore his gaze away from the mirror and quickly switched off the taps. He tripled checked the temperature of the water before holding his good hand out to his little sister.\n \n“Alright, Mo. In you hop,” Peter said.\n \nHe had just helped her settle into the tub when there was a knock on the bathroom door and they both froze. The person didn’t wait for an answer before the door was gently pushed open and Tony appeared in the doorway.\n \n“Hey kids, whatcha’ doing?” He smirked.\n \n“Having a magic bubble bath,” Peter answered.\n \n“I wet the bed,” Morgan sniffed.\n \n“I know,” Tony stepped into the bathroom. “Don’t worry, mum’s all over it.” At Peter’s questioning frown he added, “FRIDAY alerted us.”\n \n“I was going to change the sheets after we cleaned up,” Peter said, and he blinked at how harshly it came out.\n \nTony seemed taken back too as he blinked at Peter. “I know. You did a good job, kid.” He hesitated for a second before brushing back Peter’s bed-ruffle curls. “Why don’t you go back to bed? You look tired.”\n \n“M’ fine,” Peter mumbled. The frustration of not being able to fall asleep had disappeared as Morgan needed help but now it was back, building in his chest and gritted his teeth.\n \n“Go back to sleep, Pete,” Tony ordered softly.\n \n“Fine,” Peter huffed, rocking back onto his feet and brushed past Tony and into the hallway.\n \nHe didn’t go back to his room, choosing instead to got to Morgan’s. When he got there, Pepper had already stripped the bed and was wiping down the plastic that covered the mattress.\n \n“What can I do?” Peter asked.\n \nPepper startled but smiled when she saw it was just Peter. “I’ve got it, hun. Why don’t you go back to bed? It’s still early.”\n \n“I can help,” Peter said stubbornly. \n \nPeter’s breath caught and his jaw clenched as he saw Pepper’s eyes flicker to his left arm encased in his sling, blackened fingers peeking out.\n \n“I know you can,” Pepper said. “But I have it all –“\n \n“Right,” Peter cut her off and turned around and headed back into his room. He shut the door behind him and crossed to the bed. Instead of hopping into the bed he grabbed his pillow and tossed it under the bed before dropping down and wriggling his way underneath. Maybe the spider in him just wanted somewhere else to sleep?\n \nThe spider in him didn’t and so Peter remained awake, staring at the underside of his bed until the sun had risen and he heard Tony, Pepper and Morgan moving around the house.\n \n \n“What do you feel like for lunch?” Pepper asked, moving to the fridge to peer inside. “We have left over lasagne we could heat up or I can make some sandwiches.”\n \n“Juice pops!” Morgan demanded from the table.\n \n“You can have one after you’ve eaten lunch,” Pepper smirked.\n \n“Daddy would let me have one,” Morgan said.\n \n“Would I?” Tony hummed, striding into the room. “Hmmm, not while mum is in charge of lunch.”\n \n“What do you feel like?” Pepper asked, accepting a kiss on the cheek from her husband.\n \n“Sorry, love, I have to get going,” Tony winced apologetically. “I promise to grab something on the way.”\n \n“Your leaving?” Peter’s head shot up from Tony’s old engineering book he had been flicking through. Something flickered uneasily in his chest. “Where are you going?”\n \n“I need to head to the newly constructed compound,” Tony said, picking up his wallet and phone from the bench. “We have a team meeting.”\n \n“I’ll grab my stuff,” Peter flicked the book close.\n \n“Whoa, slow down,” Tony waved his hand. “Spider-Babies are not needed today.”\n \n“I’m not a Spider-Baby,” Peter huffed.\n \n“Right,” Tony stared at him. “It’s just a boring meeting, kid. Besides, you’re on rest for the foreseeable future.”\n \n“All I do is rest,” Peter cried, voice too loud in the kitchen. “I’m done resting. I’m rested. Over-rested.”\n \n“Pete, I’m only going to be gone for a few hours,” Tony said carefully. “Most of that will be in a car.”\n \n“If Peter goes, can I?” Morgan asked.\n \n“Nobody is going with dad,” Pepper said, pulling out the cold lasagne and shutting the fridge door.\n \n“Kid –“ Tony started but Peter cut him off.\n \n“I’m an Avenger too,” Peter said hotly. “I’m not broken.” \n \n“I know you’re not,” Tony said.\n \n“Then let me come!” Peter snapped.\n \n“No,” Tony said firmly.\n \nThe ache in his chest worsened and Peter felt traitorous tears well up in his eyes. He rubbed at the ache, tearing his gaze from Tony and stared at the book instead. He could feel everyone’s eyes on him, and it made his skin prickle. He grabbed the book and slid off the chair.\n \n“Fine,” Peter mumbled and left the kitchen. He threw himself on the couch, hiding himself from view of the kitchen. He rubbed at his chest, the ache worsening and he sniffed back the tears that threatened to fall.\n \n“Pep, I’m sorry, I have to go,” Tony said.\n \n“It’s okay. I’ll talk to him,” Pepper soothed. “We’ll be fine.”\n \n“I hate leaving like this,” Tony said.\n \n“I know,” Pepper hummed. “Go say goodbye to him.”\n \n“Bye little miss,” Tony said, and he heard Tony give his little sister a kiss. “Be good for your mum, yeah?”\n \n“I will,” Morgan said.\n \nPeter squeezed his eyes shut as Tony approached. He didn’t react to the hand that found its way into his curls or the soft kiss to his forehead that made his chest tighten.  \n \n“We’ll talk later, okay kiddo?” Tony said softly.\n \n“Just go,” Peter whispered, the words cracking as he did.\n\nTony sighed, brushed his hand through Peter’s hair one more time and then he was gone, leaving Peter feeling that maybe he was broken.\n \n \n“Peter?”\n \nPeter blinked, eyes focusing, and his jaw dropped as he took in his best friend. “Ned?”\n \n“Oh my God, Peter,” Ned breathed. He took a shaky step forward, eyes looking glassy. “What are you doing here?”\n \nPeter blinked again, looking left and then right before turning back to Ned. “Am I in Queens?”\n \n“You’re at my house,” Ned frowned. “Are you okay?”\n \nPeter swallowed, giving a full body shiver. “I’m in Queens?” he repeated.\n \n“Come inside the house,” Ned took reached out slowly and brushed his hand against Peter’s right elbow. When Peter didn’t move away, he gripped it and led Peter into the house. He directed his best friend through the house and into his room.\n \n“Peter. Are you okay?” Ned asked once they had settled themselves on Ned’s bed.\n \n“I don’t know,” Peter said honestly. He had no idea how he got himself to Queens and had no memory of anything after Tony had left for his meeting.\n \n“Have you really been living with Tony Stark?” Ned asked.\n \n“Yeah,” Peter said hollowly. “At the lake house. It’s nice. He has a daughter. Morgan. She’s really cute.”\n \n“Dude,” Ned breathed. “Is it true? What they’re saying on the news?”\n \nPeter blinked. “What are they saying on the news?”\n \n“You haven’t heard?” Ned gaped. “Dude, you’re a hero! Everyone’s frothing at you. They’re saying that you saved us.”\n \n“I guess,” Peter mumbled, picking at his sling.\n \n“Can I see?” Ned asked.\n \nPeter looked at his best friend and felt something warm bubble in his chest. He had missed this. Had missed Ned and the way he said what ever came to his mind.\n \n“Yeah, dude,” Peter said. He slid his arm out the sling. He hesitated with his shirt, catching eyes with Ned. “Don’t freak out.”\n \n“I won’t,” Ned promised.\n \nWith a deep breath, Peter slowly began to peel his shirt off. He struggled, body shaking but the trembling stopped when he felt Ned’s hands help him with the rest of it. He stared at his lap, feeling Ned’s eyes trace over his blackened arm.\n \n“Will it always be like that?” Ned asked, his hands twisting in his lap.\n \n“Doctor Strange said it will heal,” Peter glanced back up at Ned. “and it is. It’s not as bad as it was.”\n \n“Here, don’t get cold,” Ned said, handing Peter’s shirt back.\n \nPeter pulled it back on and blinked as Ned offered him a hoodie to put on as well. It was too big, but the familiar scent of Ned and the cosiness of the hoodie made him wriggle into the warmth. He slipped the sling back on, tucking his hand against his chest.\n \n“So, what happened?” Ned asked.\n \nPeter laid back on the bed and as Ned settled beside him, he begun to tell him of the battle. The ache in chest begun to lessen as he spilled it out and by the time he had finished, he felt a little better.\n \n“That’s so messed up,” Ned breathed.\n \n“Yeah,” Peter hummed.\n \n“Hey, Peter?”\n \n“Yeah?”\n \n“Thank you,” Ned said, rolling his head to face his best friend. “For saving us. I love you, man.”\n \n“I love you too,” Peter said. “Hey Ned, do you think we could build some Lego.”\n \n“Yeah, that would be fun,” Ned said, already pulling himself up.\n \nIt was nice, Peter thought, to just sit with Ned and talk about Star Wars like they used to. He didn’t want the moment to end, didn’t want the normalcy of it all to go but Ned’s phone ringing broke it.\n \n“Hello?” Ned answered.\n \n“Ned? It’s Tony Stark,” Peter heard through the phone.\n \n“Whoa, Tony Stark,” Ned breathed, staring at Peter. “You have my number?”\n \n“Sure do. Listen, have you heard from Peter? Has he called you at all?” Tony asked and Peter could hear the panic in his voice.\n \n“He didn’t tell you?” Ned frowned. “Peter’s here with me.”\n \nThere was a pause, the silence thick and heavy. Peter shivered and his shoulder’s hunched over.\n \n“He’s with you? In Queens?” Tony asked.\n \n“Yeah, do you want to speak to him?” Ned asked, looking at Peter for confirmation.\n \nPeter nodded just as Tony said, “Please.”\n \nNed handed over the phone and Peter brought it to his ear, shrinking into the hoodie.\n \n“Hey.”\n \nTony let out a loud breath. “Hey Kid, are you okay?”\n \n“Yeah, I’m okay,” Peter mumbled.\n \n“Shit, kid I know you were mad, but you can’t just run away like this,” Tony begun to rant, the panic audibly leaking through the phone. “I know this hard, I know this whole thing sucks but you can’t just up and leave –“\n \n“Dad, I don’t know how I got here,” Peter cut off, voice wobbling.\n \n“What?”\n \n“Dad, I don’t remember how I got here,” Peter sniffed. “I didn’t run away.”\n \n“Okay. Okay, that’s- shit, okay,” Tony said. “Just, stay with Ned alright. I’m coming to get you.”\n \n“Okay,” Peter mumbled. “M’ sorry.”\n \n“I know you are,” Tony said. “Me too. I’m so sorry, kid.”\n \n“Dad,” Peter whispered, voice breaking again.\n \n“It’s going to be okay,” Tony promised. “I’ll be there soon. Do you want to stay on the phone?”\n \n“Yes please,” Peter whispered.\n \n“Cool. Done,” Tony said. “Put me on speaker so we don’t exclude Ned.”\n \nPeter did as he was told and placed the phone on the floor between him and Ned.\n \n“DAD?” Ned mouth to Peter.\n \nPeter blushed but nodded.\n \n“Dude, that awesome,” Ned grinned.\n \n“What’s awesome?” Tony asked.\n \n“This Lego set we are doing,” Peter answered promptly. “It’s Star Wars.”\n \n“Of course, it is,” Tony drawled.\n \n \nIt was late when Tony arrived.\n \nAfter their complicated and over the top-secret handshake, Ned gave Peter a hug goodbye and waved him from the stoop and didn’t stop until Peter and Tony had pulled into Queen’s traffic.\n \nPeter snuggled into the warm leather seats, now safely wrapped up in Tony’s hoody that the older man had brought him, swapping it out for Ned’s. The ache in his chest had dimmed into almost nothing when Tony had arrived, but now in the car the ache was beginning to build back up again.\n \n“Is Pepper mad at me?” Peter asked, feeling as small as his voice sounded\n \n“Worried,” Tony said. “Very worried. We both are.”\n \nPeter swallowed around the thick lump in his throat. “I’m sorry.”\n \n“What’s the last thing you remember?” Tony asked.\n \n“You were leaving for that meeting,” Peter said.\n \n“Me leaving, that the last thing you remember?” Tony repeated.\n \n“Is that bad?” Peter looked to the older man.\n \nTony let out a breath, finger clenching tightly on the steering wheel. “That was hours ago, buddy.”\n \n“What happened?” Peter stressed again.\n \n“You had lunch, rather sulky I might add according to Pepper,” Tony chanced a look a Peter before looking back at the road. “Afterwards while Morgan had a nap, she tried to talk to you. Said you were all fidgety and agitated and then you said you needed air and were going for a walk around the lake. You never came back.”\n \nPeter squirmed in his seat, searching his memory for any of this but was coming up blank. He rubbed his eyes, a small headache starting to bloom.\n \n“How did I get to Ned’s?” Peter asked.\n \n“I had FRIDAY scan all the cameras in the area. Eventually she found that you got on a bus,” Tony said.\n \nPeter shivered.\n \nTony reached out and fiddled with the controls on the dashboard and soon enough hot air was filtering from the vents.\n \n“I knew it was going to be a bad day,” Peter mumbled, leaning his head back against the seat.\n \n“Say that again,” Tony said.\n \n“I knew it was going to be a bad day,” Peter repeated louder. “Felt all wrong.”\n \n“Wrong how?”\n \nPeter shrugged. “Just wrong. Like my senses could figure out what was going in. Skin was all prickly and the ache in my chest.”\n \n“Like dread?” Tony asked.\n \n“Yeah,” Peter nodded. “How did you know?”\n \n“That’s anxiety kid,” Tony said. “We’ve all been feeling that way since – since it happened.”\n \n“I want it stop,” Peter whispered, knowing his sounded like a whining child be he was tired. “I’m tired of healing. I just want to be normal again. I want to be Spider-Man again.”\n \n“I know you do,” Tony reached across the console and took Peter’s hand in his. “I really want that for you too. I hate seeing you like this, and I wish I could make this go faster for you. But we will get you there, kid. I promise, we will get you better and back to being Spider-Man. But in the meantime, do you think it would be okay if you could just focus on being a big brother and just being Peter.”\n \nPeter squeezed Tony’s hand. “Yeah. I can do that.”\n \n“And next time you’re having a bad day, just tell us,” Tony said. “Just say it’s a bad day.”\n \n“K,” Peter whispered.\n \n“I don’t want to have Pepper frantically calling me that your gone again,” Tony said. “I won’t come home to a missing kid.”\n \n“M’ sorry.”\n \nTony’s hand left his and buried in his hair instead. “I know buddy. Not your fault.”\n \n \nHe must have fallen asleep in the car because Peter felt something under his knees and the swoop of his body being lifted, a small grunt in his ear.\n \n“I’m getting too old to carry sleeping Spider-Babies,” Tony muttered. “Not a good sign.”\n \n“M’not Spider-Baby,” Peter mumbled.\n \n“Sure thing, Spiderling,” Tony adjusted his grip on Peter before the sound of the car door shut.\n \nPeter adjusted his good arm so that it rested on Tony’s shoulder, sticking the jacket that he wore. Satisfied he wouldn’t fall, he nuzzled into his dad’s neck and breathed in his scent. He must have dozed off again as he jolted awake again as he felt himself being laid down. He whined in the back of this throat, grip tightening on Tony’s jacket.\n \n“I’m just putting you on the couch, buddy,” Tony said. “Ease up on the sticky powers.”\n \nPeter whined again but did as he said. He sunk down into the couch cushions, blinking tiredly up at Tony.\n \n“Don’t go again,” Peter made to reach out for Tony’s arm, but the older man evaded it.\n \n“Just a minute,” Tony hushed. “Let me grab the blanket and we can go to sleep.”\n \n“You staying?” Peter slurred.\n \n“I’m staying kid,” Tony promised.\n \nPeter’s eyes slipped close and he felt the couch jostle as Tony sat down. Sluggishly, Peter moved until he was sprawled against Tony’s lap, head resting in the crook of his neck.\n \n“Whoa, okay Spider-Octopus,” Tony’s breath rushed out of him as Peter slumped against his chest. He rubbed his hand up and down the younger boys back. As best he could he draped the blanket over them both, shifting until he was comfortable.\n \nPeter fell asleep to the soothing motion of Tony’s hand running up and down his back and the beat of his heart, the ache in his chest finally leaving.\n \n \n \n \n \n \n \nPeter didn’t want to ask.\n \nThere was a lot to process since waking up from his coma; putting his hand in the gauntlet and being the one who snapped, that Tony Stark thought of him as a son, the little sister he suddenly had and the long recovery he had for his basically useless arm (for the time being Strange assured him).\n \nPeter didn’t need to ask, not really, because everyone was avoiding the question, including himself. There was only one reason why May Parker wasn’t at the lake house with him, helping him recover, holding him in her arms and whispering against his curls how proud she was but also how incredibly mad she was and how he was going to be grounded until your 50.\n \nPeter didn’t think he was ready for that confirmation. So, Peter ignored it as best he could.\n \nInstead he focused on being a good big brother to Morgan. He watched the Disney shows she liked on repeat, joined her tea parties and crawled into her tent that was situated by a tree that looked over the lake. He ate the broccoli she not-so-subtle pushed onto his plate at dinner when she thought Tony and Pepper weren’t watching and joined in for the bedtime stories, she insisted he be a part of at her bedtime.\n \nHe focused on healing. He ate regularly and a lot to keep up with his metabolism so that his healing factor could continue to heal his arm and he slept regularly (though he didn’t have much of a choice because he was still exhausted). He hadn’t done anything Spider-Man related (and that was the hardest part. He loved being Spider-Man) and tried not to crawl around in his sleep but there was only so much he could do when his instincts kicked in when he slept much to Tony and Pepper’s terror when they found his room empty and the mad dash to find him begun.\n \nThese things though didn’t stop him from hearing the whispered conversations that happened in the house when they thought he couldn’t hear.\n \n \n“Have you told Peter yet?” Peter heard across the yard where he was playing with Morgan in her tent and while the Avengers stood around the barbeque, cooking up burgers for dinner.\n \nA ritual had started whenever the heroes managed to band together at the lake house. If the weather was good, they would set up a large table in the front yard and would barbeque burgers for dinner and the salad that Bruce always brought with him (which was one of the tastiest and only salad that Peter would eat willingly). A playful fight would always break out on who had the better grilling skills that Rhodey usually won when he took over as everyone else squabbled.\n \n“No,” Tony sighed heavily over the hiss of the meat on the barbeque.\n \n“You’re going to have to tell him eventually,” Steve said.\n \n“Yeah, I know,” Tony sighed again. “We will. When he’s ready.”\n \n“You think he’s not?” Bruce asked.\n \nPeter held out his hand for Morgan, who stuck her tongue out in concentration as she tried to paint Peter’s nails with nail polish she had snuck from Pepper’s bathroom. It was a pinkish colour, one that Peter often saw Pepper wearing. He hoped it wasn’t expensive.\n \n“He hasn’t mentioned her. Hasn’t asked why she isn’t here or when she’s coming,” Tony explained. “I think he knows but I don’t think he’s ready to admit it.”\n \nPeter focused on Morgan painting his nails until Rhodey appeared in the tent doorway and called them out for dinner. He placed a hand on Peter’s shoulder as they walked back to the group, squeezing him firmly while lightly admiring his new coloured nails.\n \n“I can do yours too!” Morgan beamed, hopping and jumping by her Uncle’s side.\n \n“Yeah? Think you can do some red and blue for me?”\n \n“Yeah!”\n \n(Pepper didn’t have any blue, but she did have a nice purple that matched the large stain on his pants where Morgan knocked over the bottle in her haste to get his nails done).\n \n \n“Mummy? Why did dad call Peter, Parker?”\n \nPeter froze on the couch.\n \nUpstairs he could hear Tony in the shower, washing away the ice cream Morgan had managed to spill down the front of her father when her overzealous cheer for dessert got the best of her and Tony. Peter had laughed loudly and Tony had responded with “zip it, Parker, or no ice cream for you.”\n \nPepper and Morgan were upstairs in her room, getting her ready for bed while Peter was supposed to be picking a movie for them to watch ( “anything but Star Wars.” “but dad!” “Anything that doesn’t involve space, kiddo.”).\n \n“Well, that’s because it was his parents last name,” Pepper explained gently.\n \n“But, you’re his mum and dad,” Morgan said, and Peter could picture the confused frown on her face.\n \n“We weren’t always his mum and dad,” Pepper explained. “Before you were born, before Peter even met us, he lived with his parents, the Parker’s. But, when Peter was your age, there was an accident and Peter went to live with his Aunt and Uncle.”\n \n“But Peter lives with us now,” Morgan stated.\n \n“He does. Just because Peter’s last name isn’t the same as ours, doesn’t make him any less your brother or our son.”\n \n“What happened to his Aunt and Uncle?” Morgan asked.\n \nPepper was silent for a moment and Peter heard the shower switch off.\n \n“They were in an accident too and so now Peter lives with us,” Pepper said softly.\n \n“Good,” Morgan said. “I love Peter, lots and lots. I love him 3000.”\n \n“We love Peter too,” Pepper said.\n \nPeter didn’t hear the rest, finding himself pushing open the door and leaping off the porch and striding across the front yard. As the cool night of the air hit his face, he realised that there were tears streaming down his face and he sucked in a breath that sounded a lot like a sob.\n \nHis feet kept walking until he reached the edge of the dock and couldn’t go any further unless he wanted to fall into the lake. His legs gave out and he all but collapsed onto his butt. He swung his legs over the edge of the docks, feet dangling just above the water as he tried to even his breathes and banish the ache in his chest.\n \nHe stared at the blurry reflection of the moon on the lake through the tears that flowed down his cheeks. He wiped them away frequently, shoulder’s shaking as he sobbed.\n \n\n“They were in an accident so now Peter lives with us.” \n\n\n \n\nMorgan was a curious child and incredibly bright so it shouldn’t have come as any surprise that she would eventually start asking questions about Peter and why he didn’t share their last name. But Peter wasn’t ready. He wasn’t ready to admit to himself why he was living with the Starks on a permeant basis.\n \nHe hunched over, wiping his eyes desperately as heard the front door open and heard his name being called. He pressed his lips together in an attempt to suppress his sobs, but it only made him release an odd squeaking noise instead.\n \nHe heard Tony’s feet hit the dock and his body practically folded in half in attempt to make himself look smaller.\n \n“Pete? What happened to you choosing a movie?”\n \nPeter felt Tony coming up behind him, gently laying a hand on his back. He felt the moment Tony realized he was crying, body crouching down beside him and his big palm running up and down his spine.\n \n“Hey, Pete. What’s going on?” Tony asked.\n \nPeter hiccupped, squeezing his eyes shut tightly as his body shuddered with his supressed sobs.\n \n“Did you really want to watch Star Wars that badly?” Tony attempted to lighten the mood.\n \nIt only made him cry harder, sobs gasping out of him as he could no longer keep them in.\n \n“Whoa, okay! Come on, kid take it easy. You’re okay,” Tony’s palm swept up and down Peter’s back, knees hitting the deck as he pulled Peter into his arms.\n \nPeter went willingly, pressing his face into Tony’s chest, good hand curling tightly into the well-worn t-shirt as he cried so hard his body shook.\n \n“Come on Peter, you have to breathe,” Tony pleaded.\n \nPressing himself closer to Tony, Peter tried to calm down, but he couldn’t.\n \n\nMay was gone. May was gone. May was gone. \n\n\n \n\n“I’ve got you,” Tony held him close. “Just breathe with me Pete, come on kiddo.”\n \nUnsure of how long they sat on the dock, Peter eventually ran out of tears, the sobs turning to hiccups, breathes coming out easier until they were matching Tony’s.\n \n“You with me, Bambino?” Tony asked, hand carding through Peter’s curls.\n \n“Yeah,” Peter croaked out, keeping his face pressed against Tony’s chest, refusing to release his good hand grip.\n \n“That’s good,” Tony hummed, the relief evident in the kiss he pressed to the top of Peter’s head. Felt the relief in his fingers that never stopped gently massaging his curls. Another kiss was pressed to his head and Tony’s voice was soft. “You’re freezing, Bambino. Think you could come inside?”\n \nPeter nodded and let Tony get him to his feet. He burrowed into Tony’s side as they headed back to the house, relying on his Spider-Sense and Tony’s strong grip to keep him from tripping.\n \nAs they stepped into the house, the door shutting quietly behind them, Peter realised how cold he was. He shivered, nearly pushing Tony off his feet as he burrowed further into his father’s side.\n \n“Where did you boys get too?” Pepper asked as Tony half carried Peter into the living room. “I thought we were watching a movie?”\n \n“Pep, love, pass us the blanket please,” Tony said.\n \nPeter heard the blanket being thrown and then it was wrapped around his shoulders and he was lowered onto the couch. Soft hands were gently brushing away the remaining tears that clung to his eyelashes before they started rubbing up and down his good arm. The blanket was gently tucked around his bad arm that was cradled against his chest in its usual sling.\n \n“Peter, you’re freezing,” Pepper exclaimed.\n \n“M’sorry,” Peter mumbled.\n \n“Pete, what happened?” Tony asked gently. “Is it a bad day?”\n \nIt’s the worst day all over again, Peter thought miserably.\n \n“Sweetheart?” Pepper’s voice was soft and encouraging. “Come on, talk to us.”\n \nPeter sniffed, squeezing his eyes shut as his throat threatened to become consumed by the lump forming there. He hiccupped as he tried to speak.\n \n“Breathe, kiddo,” Tony coached.\n \nPeter could feel the concerned looks Tony and Pepper were giving one another over the top of his head but he couldn’t get the words out. Didn’t want to make them real.\n \n“Peter, honey, your starting to scare us,” Pepper smoothed his hair back from his face. “Please talk to us.”\n \n“May’s gone,” Peter finally choked the words out.\n \nThe words were out there. They were real. May Parker was gone.\n \nPeter was gently tucked into Pepper’s side, head coming to rest on her collar bone as Tony pressed against his bad side, anchoring him as he pressed a kiss to his temple and catching the fresh tears the dribbled down his chin. They didn’t say anything. They simply held Peter as he cried and let him pour out his grief that he had been keeping bottled up inside him.\n \n \nPeter woke up not in his room.\n \nThe bed he lay on was much larger than his own and held the distinct smell of both Pepper and Tony blended into one comforting scent. He didn’t remember getting there but judging how dry and scratchy his face felt he had exhausted himself crying and had been carried there. It made a small part of his heart bloom with warmth while the rest remained somewhere in the bottom of his stomach.\n \nA strong scent of coffee and tea wafted into the room and Peter felt the bed shift as the body next to him sat up. Another weight added to the bed on his other side, the blankets gently lifted before settling down again.\n \n“Thanks,” Pepper hummed. “Did Happy get Morgan okay?”\n \n“Yeah,” Tony said. “Said he’d take her to the aquarium. I expect another stuffed toy will be joining the family by the end of the day.”\n \n“I wouldn’t be surprised,” Pepper chuckled. “Happy spoils her.”\n \n“Do I get one too?” Peter mumbled against the pillow his face was pressed into, voice rough.\n \n“Sure thing, Bambino,” Tony hummed. “I’ll get Happy to get you a penguin.”\n \n“A real one?”\n \n“No, not a real one,” Tony huffed. “Where we would put it?”\n \n“It could swim in the lake,” Peter offered. “Gerald needs a friend.”\n \n“Gerald does not need a friend,” Pepper said firmly, slender fingers working into Peter’s messy curls.\n \nPeter hummed at her touch, feeling his body starting to drift again.\n \n“Don’t fall asleep again,” Pepper hummed. “You need to eat and wash your face.”\n \n“S’too late,” Peter slurred, body lulled by the rhythmic, relaxing movements of her fingers against his scalp and he drifted back to sleep.\n \n \nPeter somehow felt better and worse when he woke up again.\n \nTony and Pepper were still on either side of him and he wondered how long he had been out for.\n \n“You really awake this time?” Tony asked.\n \nPeter pried opened his eyes, cringing as his eyelashes stuck together and he blinked until the room came into focus. He hummed a note of confirmation that he was awake and smacked his lips together. The bed dipped as Tony left the bed and shuffled into their bathroom. The tap ran for a moment before it was switched off and Tony came back with a damp cloth in hand.\n \n“Sit up,” he said, sitting back on the bed.\n \nDoing as asked, Peter managed to sit up. He sat still as Tony gently pressed the cool cloth against his face and Peter sighed as it offered some relief. His eyes were gently wiped before the soft cloth was swiped against his cheeks, nose, chin and then over his forehead before it was gone.\n \n“Face me, sweetheart,” Pepper said.\n \nPeter turned his face and hummed quizzically as she smoothed cream over his face, the stinging immediately disappearing.\n \n“Better?” Pepper smirked softly.\n \n“Yeah,” Peter nodded. “That feels awesome.”\n \n“Alright, time to eat something. I swear you stomach growling woke me up,” Tony playfully huffed as he placed a tray in Peter’s lap.\n \nRealising how hungry he actually was, Peter devoured the plate of toast, eggs and bacon that he was offered. When the plate was empty, Tony took the tray and Peter was manoeuvred until he was tucked against both of them.\n \n“Are you okay to talk about last night?” Pepper asked.\n \nPeter nodded, looking down at his blackened fingers that peeked out of his sling. “M’ sorry about that.”\n \n“Hey, you don’t have anything to be sorry about,” Tony said firmly.\n \n“I – I knew she was gone,” Peter whispered. “I just didn’t want to admit it.”\n \n“I’m so sorry kiddo,” Tony took Peter’s good hand in his. “So sorry.”\n \n“What happened to her?” Peter asked, glancing up at Tony.\n \n“When you were gone,” Tony started carefully. “When we were able to, we went looking for her. Went to your apartment and then went to her work when she wasn’t there. I’m so sorry kiddo. She was in an accident. Someone driving a car was dusted and the car went out of control and ended up hitting May’s car.”\n \n“Did she – did she suffer?” Peter asked quietly.\n \n“No,” Pepper said, soft hands tucking a stray curl behind his ear. “No, she didn’t suffer. The accident – she didn’t feel a thing.”\n \nPeter nodded, not trusting himself to speak without breaking into sobs again. Tony and Pepper let him compose himself, Peter using their touches to anchor himself.\n \n“Did you bury her?” Peter finally managed to ask.\n \n“Right next to Ben,” Tony said. “When you’re ready we’ll take you up to see her.”\n \n“I’d like that,” Peter whispered.\n \nThey fell into silence again, each of them taking a moment to sort through their thoughts, to remember May and the amazing woman that she was. What it now meant that Peter had finally admitted to himself that he was never going to see her again.\n \n“Thank you,” Peter broke the comfortable silence. “For taking me in.”\n \n“You don’t have to thank us,” Tony squeezed his hand.  \n“I do,” Peter insisted. “I love you, mum and dad. Love you 3000.”\n \n“We love you too,” Pepper smiled, kissing his temple. “You’ll always have us. No matter what. And the Avengers.”\n \n“And if, god forbid, anything did happen to us, which it won’t,” Tony stressed. “You will go into the safe, caring and very capable hands of Rhodey. Because he is the only sensible Avenger I trust my Spider-Baby with. Can’t have you and Morgan becoming team Cap.” Tony shuddered theatrically.\n \nPeter snorted.\n \n“I honestly think Rhodey would have to pry you both out of Happy’s hands,” Pepper laughed.\n \n“Maybe we should do that next time they’re round,” Tony grinned. “A fight! Whoever wins gets the kids.”\n \n“Wow, trying to get rid of us already,” Peter said deadpanned. He grinned though when Tony ruffled his hair.\n \n“Nope. You’re my kid now. You aren’t going anywhere,” Tony said seriously.\n \nPepper pressed another kiss to his temple. “and we wouldn’t have it any other way.”\n \nPeter sighed happily, burrowing himself into their warmth. Though he missed May terribly and would every day, he didn’t feel as though he was drowning because he had the Stark's to keep him afloat.\n \n \n \n \n \n \n \nThe battlefield was a mess.\n \nThere are creatures and superheros scattered across the remains of the demolished Compound gripped in battles, fighting for their lives. Lights of magic scatter across the air like fireworks, drowned out by the alien shrieks as they rush at the Avengers. The Avenger’s don’t back down though, running just as fast, shouting battle cries that carry the promise of payback for what they took.  \n \nTony can barely hear himself think over the noise and thunder beat of his heart, working on instinct as he fought of alien after alien. He felt a moment of relief when he saw Pepper in the Rescue suit. She joined him in fight, back-to-back, as they blasted one alien after another. They were no match for their weapons. They collapsed on the ground in puddles of blood and vacant eyes. Yet they still kept coming; like a dog with its bone, they refused to give up.\n \nBut so did Tony. He moved with determination; his aims targeted for maximum damage. He took out the aliens from above, flying in and around Sam, Rhodey and Hope. At point he veered off to stop colliding with a flying horse, something he put at the back of his mind for later.\n \nThis was the final battle. Tony could feel it, as could everyone. This would determine who was the strongest and Tony was not about to lose.\n \nAn alien caught Pepper off guard, and she slammed to the ground with a painful thud.\n \nTony saw red and physically snarled through his teeth. He blasted the alien away in a spray of blood before falling over Pepper, firing every weapon he had as she collected herself.\n \n“Pepper!” Tony yelled, blasting an alien straight in the teeth.\n \n“I’m okay,” came Pepper’s breathy reply over the coms. “Tony, I’m okay.”\n \n“Thank god,” Tony said.\n \n“Boss, alien approaching fast on your right,” FRIDAY said.\n \nTony spun, lifting up his hands to fire –\n \nThe alien body started to fall, disintegrating into ash before his very eyes. Tony kept his hands up, not believing what he saw.\n \n“Tony?” Pepper’s voice filled his ear as he looked wildly around the field.\n \nAll around them, the aliens they had been fighting were starting to fall.\n \nJust like on Titan, one by one Tony watched them float away into nothing. The battlefield grew emptier and emptier until all that was left was Thanos. The titan sat on a rock, surrounded by Thor and Steve, their weapons still raised and ready to strike. Thanos looked across the field, eyes locking with Tony. The titan smiled, a cruel twist of his lips before he too faded into nothing.\n \nAt first, nobody moved.\n \n“Did we win?” Pepper breathed, her face plate retracting.\n \nTony retracted his own mask, blinking and breathing harshly. Had they done it? Had they really defeated Thanos?\n \n“I think we did,” Tony swallowed, hardly daring to say the words in case he jinked them all.\n \nAround them, people started to shake out of their shock and were moving to one another. Taking Pepper’s hand (his grip maybe too tight but he was not letting his wife go), Tony dragged her across the field towards Thor and Steve who were embraced in a hug.\n \n“Tony,” Steve said, face alight with happiness beneath the grime he was covered in. It was happiness that Tony hadn’t seen in over five years.\n \n“Steve,” Tony nodded and the two embraced.\n \n“We did it,” Thor cheered loudly, thrusting his axe into the air. It crackled with power, seemingly reflecting Thor’s overwhelming joy.\n \nSam and Bucky approached, Steve pulling them both into a hug when they were close enough. Clint slapped Tony on the shoulder as he approached with Wanda who was using her magic to support Bruce as he ambled over. Scott gave a joyful shout, pulling the closest person (Sam who tried to push the ever-changing sized man off him) while T’Challa shook hands with Bucky and Steve.\n \nAll around, cheers went out as they celebrated. They had won. They had done the impossible. After everything, Thanos had lost.\n \n“How did you do it?” Steve asked, making Tony turn.\n \n“What?” Tony blinked.\n \n“Thanos, the stones, how did you do it?” Steve asked, eyes trailing over Tony’s armour that still clung to his skin.\n \n“I could ask you the same question,” Tony nodded at Steve who was filthy but had no burn marks like Bruce had received. “Something a little extra in that bottle you failed to mention?”\n \nSteve frowned. “Tony, it wasn’t me.”\n \n“Well, it wasn’t me,” Tony huffed. He paused. “You didn’t touch the stones?”\n \n“No,” Steve shook his head.\n \n“Then who did?” Tony demanded. He looked around the group that was gathered, eyes flicking quickly over each and every person. His heart thundered in his chest he spun around, searching the field.\n \nA lump formed in his throat as he saw a familiar red cloak across the field, Carol standing guard, her face pinched with worry.\n \n“Tony?” Pepper’s hand touched his shoulder, but he barely felt it.\n \n“No,” Tony whispered, heart dropping in his chest and he could feel the blood draining from his cheeks.\n \nWithout a word he was blasting into the air, flying across the distance between him and Strange, landing heavily on the ground. No, it couldn’t be. He did not wait five years for his kid to return only to have been lost and forgotten about in the battle. He did not invent time travel for him to lose his kid all over again.\n \nBut as he stumbled towards Strange, his armour falling away, he saw Peter’s too pale face staring blanky ahead. Burn marks stretched up his neck, his arm a blackened mess, laying limply in his lap.\n \n“Peter!” Tony dropped to his knees beside Strange.\n \nThere was flicker in Peter’s eyes as he looked to Tony, a slow breath rising his chest slightly. Strange was carefully peeling away the broken, crumpled glove, the stones no longer glowing. He passed it to Carol who tucked it under her arm, her lips pressed together as she watched on.\n \n“Hey, Pete,” Tony cooed softly, hands hovering, not knowing where to touch.\nThe fact that Strange wasn’t pushing him away was telling and Tony swallowed down the bile that threatened to fill his mouth.\n \n“’ony,” Peter croaked out in a barely-there whisper.\n \n“Shhh, it’s okay, Underoos,” Tony said, hand coming to cup his un-injured cheek. His thumb smoothed over the cheekbone. “I’ve got you now buddy.”\n \nPeter whimpered, trying to say something but he could barely move his lips.\n \n“It’s okay,” Tony soothed, fighting back his tears. “You’re going to be okay. I’m here and I’ve got you. You’re safe now.”\n \nPeter head lolled; eyes flickering shut. His chest fell and Tony’s breath hitched as it did not rise again.\n \nHe felt Pepper’s hand squeezing his shoulder tightly, anchoring him to her as grief rose steadily inside him. No, he couldn’t not lose his kid again. Not a second time.\n \n“Tony,” Rhodey murmured behind him.\n \n“No,” Tony growled through clenched teeth. He shoved his glasses onto his face, scratching the bridge of his nose as he did. “No, not again. FRIDAY, scan him.”\n \n“Scanning Boss,” came FRIDAY’s voice. “Karen is informing me that Peter’s heart is still beating.”\n \nStrange looked up sharply. “What?”\n \n“His heart rate it too slow but still beating,” FRIDAY said. “Karen informs me he will not last much longer.”\n \nBefore Tony can bark at Strange to do something, to save his kid, the Wizard’s hands were already moving. Magic encased Peter’s form, yellow sparking symbols encasing his body and forming a barrier around him.\n \n“It’s a magical coma,” Strange explained before Tony could ask. “It will keep his heart beating while he heals. We need to get him to a hospital. Wong!”\n \nA portal opened behind them, the sterile halls of a hospital a stark contrast to the filthy carnage that surrounded them. Shouts could be heard through the portal and Strange was getting to his feet.\n \n“You can lift him,” Strange said.\n \nTony wasted no time. He scooped Peter into his arms, cradling him close to his chest. He couldn’t feel the magic around Peter, but it lingered, the symbols never fading around him.\n \n“Go,” Pepper said when Tony caught his eye.\n \n“We’ll take it from here,” Rhodey nodded.\n \n“This way,” Strange said, striding purposefully into the portal.\n \nTony followed, his grip on Peter painfully tight, tucked as close to his chest as possible, as he stepped through the portal and prayed to every god he could think of that Peter made it through. He would not lose his kid again.\n \n \n \n \n \n\n \n\nEver since her mum and dad had told Morgan about having a big brother, she had been dying to meet him. Morgan had stumbled upon a picture in the kitchen of her dad and a teenage boy, arms wrapped around each other, an upside-down piece of paper between them. They had big smiles on their faces and dad seemed younger.\n \n“Who is that?” Morgan asked curiously, turning when her dad came over to see what she was looking at.\n \n“That’s your…brother. Peter,” her dad had said, his voice oddly soft and cracked.\n \n“I have a brother?” Morgan gasped, excitement thrumming under her skin. In her kindergarten, her friend Molly said that she had a new baby brother and Morgan had decided she had wanted one too. It turns out, she already did! “Where is he?”\n \nHer dad had scooped her up into his arms, settling her on his lap as they sat at the kitchen table. They looked at the picture, her dad’s thumb carefully stroking the edge of the frame. “Peter….I lost him. This was before you were born”\n \nMorgan’s brows twisted in confusion. “And you haven’t found him yet? Daddy, you’re not very good at hide and seek, are you?”\n \nHer dad barked a laugh, his body shaking against hers. He pulled her closer, kissing the top of her head. “No, no I’m not very good at it, am I.”\n \n“That’s okay,” Morgan said. “I’ll help you find him. I’m excellent at hide and seek!”\n \n“Thanks, sweetheart,” Tony said. “I appreciate all the help I can get.”\n \n“Petey must be very good at hide and seek,” Morgan said, more excitement building up inside her. “I can’t wait to play with him!”\n \n“Yeah,” Tony said softly, his voice turning sad. “Yeah, he would have loved that I think.”\n \nMorgan had spent that afternoon searching the house for Peter. She checked all her usual hiding spots, but Peter was nowhere to be seen. But that was okay. Morgan liked a challenge, and she would find Peter for her daddy.\n \nIt turns out, her dad manages to find Peter before she does. Uncle Happy is looking after her, her mum and dad having to rush out the door on a last-minute errand they had told her. Uncle Happy watches her for a couple of days before her mum comes home alone.\n \n“Mummy!” Morgan cheered, throwing herself into her mother’s arm.\n \nHer mum scoops her up, hugging her tightly to her chest. Kisses are peppered all over Morgan’s face; her cheeks, her nose, her eyes, her chin and Morgan giggles at the sensation.\n \n“I missed you so much,” Pepper sighed, inhaling deeply.\n \n“Missed you too,” Morgan beamed up at her mum. “Where’s daddy?”\n \n“Your dad is with Peter,” her mum said, her voice trembling slightly.\n \n“Peter?” Morgan gasped, bouncing up and down in her mother’s arms. “Daddy found Peter? He found him?”\n \n“Yes,” her mum’s smile was so bright. “Yes, he found him.”\n \n“Peter’s back?” Uncle Happy asked, his voice choked.\n \nMorgan turned to find him watching the two of them, his face pale and his hands trembling by his side.\n \n“Yes, Happy.” Her mum took a shuddering breath. “Everyone’s back. We got everyone.”\n \n“Tony? He’s, okay?” Happy asked, shuffling forward, his eyes wide.\n \nPepper nodded. “Fine. He’s fine.”\n \n“And Peter?”\n \nHer mum hesitated. “Peter’s hurt. He used the stones. He was the one who snapped everyone back.”\nHappy gasped and Morgan looked at her mum in confusion. Stones? What stones? Was it some type of game they had been playing? What was so special about a bunch of stones?\n \n“He snapped?” Happy asked, horror seeping into his voice. “How badly is he injured?”\n \nPepper tightened her hold on Morgan. “He’s,” she looked down at Morgan before looking back to Happy. “Sleeping. It’s touch and go. We won’t know until he wakes up for sure.”\n \n“Where is he?” Happy asked.\n \n“At the hospital. Doctor Strange is looking after him and we got Helen Cho to fly in too.”\n \n“Hospital,” Morgan frowned. “Mum, is Petey okay? Why is he at the hospital?”\n \n“Peter’s not feeling very well,” her mum said soothingly. She smoothed Morgan’s hair back from her face, pressing a kiss to her forehead. “We’re trying to make him feel better.”\n \n“Did he get hurt playing hide and seek?” Morgan asked. Molly had skinned her knee playing hide and seek the last time when she had crawled into a cupboard. It had left a scab that had taken weeks to heal.\n \n“Yes,” her mum said. “Your dad is going to help him get better.”\n \n“Would Petey like a picture?” Morgan asked, hopefully. Her mum and dad always liked the pictures she drew, and Morgan had been drawing so many for Peter for when he came home. She had her mum and dad tell her all about Peter and Morgan was thrilled to know that he was a superhero like her daddy. Her dad even let her watch some videos!\n \n“I think Peter would love that very much,” her mum said.\n \nWhile Morgan went to her colouring table to draw a new picture for Peter, her mum and Uncle Happy moved to the kitchen, their voices low as they spoke. Morgan could only just hear them, and she didn’t really understand what they were saying.\n \n“His heart was barely beating,” her mum was saying. “Doctor Strange has him in some magical coma. I don’t really understand it.”\n \n“What does that mean? Will Peter wake up?” Happy asked.\n \n“They’re hoping but it’s a very low chance,” her mum said. “As soon as he is stable enough, we are going to move him here. The hospitals are overwhelmed with everyone returning and it will be good before anyone finds him. Tony’s wants him close as well encase…”\n \n“How’s Tony taking it?” Happy asked.\n \nHer mum sighed heavily. “He’s worried but he’s Tony. He will do anything to help Peter. You know that. If Peter doesn’t….” her mum’s breath hitched and there was a small sob. “Tony can’t lose him again. We can’t go through that again.”\n \n“Peter’s a tough kid,” Happy said, his voice choked. “He’ll pull through.”\n \n“I hope your right,” her mum said.\n \nMorgan turned her focus back onto her picture and frowned. Petey would need a really big one if he was going to get better soon.\n \n \nMorgan’s excitement was barely containable. Peter was coming home today. She had helped her mum make up Peter’s room, putting several teddy bears on the bed to make him feel welcomed and hanging her pictures she had drawn him up on the walls.\n \nMorgan tried to distract herself, watching movies and playing in her tent. It wasn’t until lunch time, when her mum had called her in the house to come eat, did she find out that Peter had already arrived. \n \nHer dad was home and had brought a man with a strange red cloak with him too. They both looked at her as she came inside, Morgan running to her dad.\n \n“He’s here! He’s here!” Morgan cried, jumping into her dad’s waiting arms. “You brought Petey home!”\n \n“That’s right,” her dad beamed. “Hey, say hello to the wizard.”\n \nMorgan turned to the other man, and grinned. “Hello wizard!”\n \nHer dad laughed while the wizard heaved a big sigh. “It’s Doctor Stephen Strange. And I am not a wizard.”\n \n“He is,” her dad winked at her. “If you ask nicely, he might even make you a balloon animal.”\n \nMorgan gasped. “Please?”\n \nStephen shot her dad a glare, but he moved his hands and gold spark appeared until the formed a beautiful butterfly. Morgan gasped, eyes tracking the movement of the butterfly as it fluttered over to her. She squealed as it landed on her nose, flapping its golden wings and then it disappeared in a shower of sparks that made her sneeze.\n \n“Wow!” Morgan whispered with awe, staring at Stephen with wide eyes. “You’re so cool!”\n \nStephen shot her dad a smug look and her dad bounced her in his arms.\n \n“Hey! What about me?” her dad asked, voice teasing.\n \n“I love you 3000,” Morgan said.\n \nHer dad’s smile softened, and he kissed her cheek. “Love you too, sweetheart.”\n \n“Can I see Petey now?” Morgan asked, her eyes pleading. “I want to see my brother.”\n \n“Alright,” her dad said. “But this is really important okay. Are you listening?”\n \nMorgan nodded. “Peter was injured and so he might look a little different to what you have seen in the pictures,” her dad said, his voice and face serious. “But’s he’s not going to hurt you. Peter’s sleeping too so he won’t wake up, but I know he will be very happy you came to see him.”\n \nMorgan excitement slowed and her stomach churned funnily. “Okay.”\n \n“Alright, come on. He’s in his room.”\n \nHer dad carried up the stairs, Stephen following behind them. Peter’s door was open, and they stepped inside. The curtains were drawn and there was very little light filtering in the room. Morgan’s eyes were quickly drawn to the figure in the middle of the bed.\n \nMorgan gasped.\n \nPeter was tucked under the covers. Half of him looked normal but the other half it what made Morgan gasp. Peter’s face was covered in black marks, all the way up the side of his temple and across his eyes. The burns travelled down his neck and his arm, ending all the way to his fingertips.\n \n“It’s okay,” her dad murmured in her ear, his hand rubbing soothing circles on her back.\n \n“Daddy,” Morgan whispered, not able to make her voice any louder. “What happened to Petey’s face?”\n \n“He was injured,” her dad explained gently. “Peter did something very brave to save a lot of people.”\n \n“Does it hurt?” Morgan asked, unable to take her eyes off the burns that covered Peter. It made her stomach churn uncomfortably as she looked at them.\n \n“Peter doesn’t feel anything.” Stephen’s voice was deep and reassuring.\n \nThat made Morgan feel better and the knots in her stomach loosened.\n \nHer dad carried her over, perching them on the edge of the bed. Peter didn’t move as the bed jostled under their weight, his chest just slowly rose and fell with each breath.\n \n“When will he get better?” Morgan asked.\n \n“It could take a while,” her dad said. “We aren’t sure when he will feel better, but we will be here for him to make sure he does.”\n \nMoran nodded, still looking at her brother. “Petey is the best-test superhero. He’ll wake up.”\n \n“I’d be offended but your right,” her dad said. “Spiderman is the best superhero.”\n \n \nPeter doesn’t wake up and Morgan just wants to play with him. Her dad said that they had to be patient and when Peter was ready, he would.\n \nMorgan had taken to playing in Peter’s room, not wanting to miss when Peter did eventually wake up. She had brought nearly all her toys into his room, adding more teddies to Peter’s bed. They seemed to help because over time, Peter’s face had started to look better. The black burns had slowly faded from across his eye and were now starting to fade from his temple. His arm still looked bad, but it wasn’t as black as before.\n \nThe first time Peter had made any movement it had scared Morgan. She had been playing in Peter’s room, tucked away in a corner when her dad and the wizard entered the room. They hadn’t seen her, their focus on Peter. Her dad stood on one side while Stephen went to the other.\n \nAs usual, they were there to change Peter’s bandages. Stephen reached for Peter’s arm, going to lift it when Peter’s hand shot up and grabbed Stephen’s wrist.\n \nStephen let out a startled gasp that ended in a painful grunt.\n \nMorgan froze, her mouth dropping open. Her heart had started to beat fast in her chest and as much as she wanted to run to her dad, she was frozen.\n \n“Holy shit!” her dad yelped. “Peter?”\n \nStephen let out a hiss as he tried to pull away, but Morgan could see that Peter’s grip had tightened. When he spoke, his voice was strained. “Peter, can you hear me?”\n \nPeter made no indication that he had heard Stephen.\n \n“Peter, if you can hear me you need to let go.”\n \nStephen let out another grunt, his face twisting with pain.\n \n“Kid, it’s Tony,” her dad said, inching closer to Stephen’s side. “If you can hear me, you have to let go. You’re crushing the wizard’s wrist.”\n \nStephen let out another strained noise and her dad went to reach for Peter’s hands.\n \n“No don’t,” Stephen said through gritted teeth. “Don’t try and pry him off. He could snap my wrist.”\n \nHer dad opened her mouth to say something, but Peter finally moved again. He released his grip on Stephen, his arm thumping back against the bed before falling still once more.\n \n“What the hell was that?” her dad asked, turning to face Stephen.\n \nStephen cradled his wrist to his chest, his face pinched with pain. “Looks like his reflexes have returned. His strength, it seems, has not been affected by his time unconscious. His healing is remarkable.”\n \n“Jesus, kid,” her dad scrubbed a hand down his face.\n \n“Daddy, is Peter going to wake up now?” Morgan asked, managing to find her voice now that Peter has gone still.\n \nBother men whirled around to face her and she blinked innocently up at them.\n \n“Morgan! How long have you been there?” her dad asked.\n \nMorgan got to her feet and hurried over to her dad. When she was close enough, he swung her up into his arms and pressed a kiss to her cheek.\n“I was looking out for him, like you told me too,” Morgan said.\n \n“Perhaps best not to be alone with Peter anymore,” Strange said, rubbing his wrist. “His senses appear to be in overdrive and are protecting him from any potential danger.”\n \n“Why is he moving now? After all this time?” Tony asked, shifting Morgan in his arms.\n \n“I can’t be certain,” Strange said. “But his body may be allowing him to wake as the healing process begins to slow.”\n \nHer dad let out a sharp breath. “That’s good news, right? He might wake up soon?”\n \n“I’ll have to do some more tests,” Stephen said. He stretched out his arm, hissing at the movement.\n \n“Let’s get your wrist checked out first,” Tony said. “I know how strong Peter is. FRIDAY, x-ray the wizard, make sure the kid didn’t break anything.”\n \nThere was silence and then FRIDAY’s voice filtered into the room. “There are no fractures of breaks detected.”\n \nStephen was looking at Peter curiously. “He may have been aware it was us. His strength was there. He could have easily broken it, but his senses were still acting on instinct to protect himself.”\n \n“That’s good news, right?” her dad asked.\n \n“If I’m right, then yes. It’s good news.”\n \n“Is Petey going to wake up now?” Morgan asked, hope rising in her chest.\n \n“Not yet,” her dad said. “Soon. Hopefully.”\n \nMorgan let out a big sigh. She just wanted her big brother to wake up so they could play.\n \n \nA lot of people come to visit Peter.\n \nMorgan recognises a couple of faces but doesn’t remember their names. She sits on the bed beside Peter as they float in and out of the room. Her dad stays with them, chatting in low voices with everyone as Morgan chews on her snacks. While her dad is preoccupied with the visitors, Morgan focuses on Peter.\n \nShe pressed a cracker into Peter’s good hand, watching as his fingers twitch around it. She leans over eagerly to see if he’s awake, but Peter doesn’t stir. She frowns.\n \n“Daddy?”\n \nHer dad turns from where he is speaking to a man named Steve. Her daddy had called him Captain America and that he was the one who used the shield that had been sitting in the garage. Morgan had really wanted to use that a sled but now it was gone.\n \n“Yeah, sweetheart?”\n \n“Does Petey like crackers?” Morgan asked.\n \n“Yeah. Peter will eat pretty much anything,” Tony chuckled, looking fondly at Peter.\n \n“But are they his favourite?” Morgan pressed. She didn’t want to give Peter things he didn’t like.\n \n“No, they’re not his favourite snack,” Tony said, looking amused.\n \nMorgan nodded and turned back to Peter. Maybe Peter would wake up if she brought him his favourite snack. It had to be much better than the bags of liquid they were giving him.\n \n“Don’t worry Petey,” Morgan whispered, taking the cracker from Peter’s hand. “I’ll bring you something else.”\n \n“Morgan seems to be taking this well,” She heard Steve mumble as she munched on her cracker.\n \n“Yeah. Better than we expected.”\n \n \nMorgan could hardly believe her brother was awake! She had waited so long for him to finally wake up. Morgan entered the kitchen, her mum there just as her dad had promised.\n \n“Morning sweetheart,” Her mum said, swopping down to press a kiss on her cheek. “How did you sleep?”\n \n“Good! I slept with Petey. He’s very comfy,” Morgan babbled happily. Her heart felt as if it was soaring. Peter was finally awake! “Can we make Peter some pancakes for breakfast?”\n \n“We can do that,” her mum smiled at her.\n \n“I hope he wakes up again soon,” Morgan said, jumping up and down. “He’s been asleep for ages.”\n \n“Peter will wake up when he’s ready, sweetheart,” her mum soothed. “I know you are excited to see him, but Peter is still healing.”\n \n“But he said he was it was nice to meet me,” Morgan pouted.\n \nHer mum froze and slowly turned to face her. “Peter spoke to you?”\n \nMorgan nodded. “Last night. We had a popsicle together. Do you think he likes chocolate chips in his pancakes too?”\n \nBefore her mum could answer, her dad came into the room.\n \n“Tony?” her mum asked, a shake in her voice. “Morgan said Peter woke up?”\n \n“He moved,” her dad said with a laugh. “He moved, Pep!”\n \nHer mum crossed the room to her dad, wrapping her arms around him and pulling him into a kiss. Morgan scrunched her nose as they kissed. They pulled apart, their eyes sparkling with tears.\n \n“He woke up,” her mum half laughed half sobbed.\n \n“Is Petey in trouble?” Morgan asked, looking between the two, not understanding why her mum was crying.\n \n“Come here, baby,” her dad. Morgan rushed to him, letting him lift her up to settle on his hip. “Peter’s not in trouble. Not at all. These are happy tears. We’re really happy he woke up.”\n \n“Oh,” Morgan said. “Does he still want pancakes? ‘Coz I’m hungry.”\n \n“He’s still asleep,” her dad said. “It might be a while before he wakes up again. FRIDAY, call the Strange and tell him to get his ass here. Peter woke up.”\n \nHer mum had started on breakfast when golden sparks filled the kitchen. A portal opened and Stephen walked through, his face serious.\n \n“Peter woke up?” he demanded.\n \n“Last night. Morgan was with him,” her dad said immediately.\n \nMorgan shrunk against her dad as Stephen turned his attention to her. His face softened and smiled at her. “Hello, Morgan.”\n \n“Hello.”\n \n“You were with Peter when he woke up?” Stephen asked.\n \nMorgan nodded. “We had a popsicle together.”\n \nStephen’s lips twitched. “What flavour did you have?”\n \n“Grape!” Morgan beamed. “It’s my favourite.”\n \n“Mine too,” Stephen winked at her. “Did Peter enjoy the popsicle?”\n \n“I think so,” Morgan said, cocking her head thoughtfully. “He didn’t finish it. He fell asleep again. He was really tired still, even after all the sleeping he has done”\n \nStephen nodded. “And did he say anything to you?”\n \n“He asked me to tell daddy that he was sorry and that he loved him,” Morgan said. “And that he thought Teacup was a good name.”\n \n“Teacup is a great name,” Stephen said. “Thank you for telling me that. Is there anything else you two did?”\n \nMorgan hummed with thought. “He didn’t remember daddy at first but when I told him I was his little sister he remembered.”\n \n“Good job sweetie,” her dad said, pressing a kiss to her forehead.\n \n“I’ll go see Peter now,” Stephen said and then he was sweeping out of the room.\n \nHer dad put her down, slowly pushing her towards her mum.  “Stay with mum while I go with him.”\n \nBy the time the two of them returned to the kitchen, Morgan had eaten two pancakes and had dribbled syrup down the front of her.\n \n“Is Petey ready for pancakes?” Morgan asked hopefully.\n \n“Not yet,” Stephen said.\n \n“What about lunch?” Morgan asked. She turned to her mum. “Can we have pancakes for lunch?”\n \n“Peter may not wake up for lunch or dinner,” Stephen said. “But he will again soon.”\n \nMorgan pouted, slumping in her seat. She just wanted Peter to wake up again.\n \n \nMorgan squealed as Peter chased her around the front yard. He was chasing her, trying to tag her. Morgan pumped her arms and legs as she ran as fast as she could.\n \n“Gotcha ya!”\n \nMorgan squealed as she felt Peter’s hand land on her back. She was suddenly lifted off the ground and spun around. She laughed, the wind tugging at her hair as she was spun around.\n \n“Uh oh,” Peter mumbled and then suddenly the two of them were laying on the ground, staring up at the sky. “Ugh, sorry Mo.”\n \nMorgan giggled, sitting up and peering at Peter as he blinked up at the sky. “Can we do that again?”\n \n“Maybe in a bit?” Peter panted slightly. “M’ a bit dizzy.”\n \n“Okay,” Morgan chirped.\n \nHer mum and dad said that she had to be easy with Peter while he healed. He still fell asleep a lot, but he was awake more often. Morgan loved having a big brother. He was always there, playing with her and watching movies together.\n \n“Peter! Morgan!”\n \nMorgan turned at the frantic voice of her dad and saw him dashing across the yard towards them.\n \n“Hi daddy!” Morgan beamed.\n \nTheir daddy dropped on his knees beside Peter. “Pete?”\n \n“M’ good,” Peter gave a lazy thumbs up. “Just a bit dizzy.”\n \n“We spun around really fast,” Morgan beamed up at her dad and sniggered. “Then we fell down.”\n \nTheirs dad shoulder slumped and relaxed onto the ground beside them. “Was it fun?”\n \n“Yeah,” Peter grinned lazily. “We were playing tag. I was it.”\n \n“Petey nearly couldn’t catch me!” Morgan preened proudly. “I was too fast for him.”\n \n“I bet,” their dad hummed.\n \n“Don’t be mad,” Peter said. “It was fun. I just…want to be normal.”\n \n“I know, kiddo,” their dad smoothed back Peter’s curls. “Just…don’t push yourself. Okay. Anyway, mum sent me out here to collect you. Snacks are ready.”\n \nMorgan jumped to her feet and grabbed Peter’s good hand. She hauled him up, using all her strength. “Come on Petey! Mum said she was making us something special! That it was a surprise.”\n \nAs she watched their dad help Peter to his feet, her heart tumbled in her chest. It was good to have her brother awake. And it was even nice to see their mum and dad smiling brighter than they had in months.\n \n \n \n \n \n \n \n \n \n \nPeter felt a little guilty for the harsh, “I can do it,” and the push of Tony’s outreached hand that had been coming for his plate, but his frustration was starting to reach boiling point.\n \n“Sure, kid.” Tony pulled his arm back, settling into his seat. He gave Peter a quick look that the younger boy ignored before focusing on the conversation around him. \n \nThey Stark family had a full house tonight. The Avengers had all come by the lake house for a fortnightly meeting (Tony now including Peter on some of them after what happened the last time he left Peter at home) which usually turned into a food and games night. Tony had spent the morning making lasagnas (while Morgan and Peter supervised and snuck pieces of cheese) and Pepper had prepped some salads and other meats. They were now crammed around the kitchen table, plates and plates of food covering every available surface. \n \nPeter ignored this though and instead focused on his knife and fork. Taking a deep breath, he picked up the fork in his right hand. Slowly he brought his still injured left arm up onto the table and placed it close to his plate. It had been just over a week that Peter had finally been allowed out of his sling. His arm was still healing but it had improved since he had woken up and was now wrapped in a bandage, one that he had changed daily.\n \nOnce, when Tony had to duck away in the middle of changing Peter’s bandage, Peter had run his fingers over the skin. It had been an odd sensation, the skin puckered and dry. It had left him feeling queasy and he had been silent for the rest of the day, ignoring the worried looks Tony had sent them.\n \nAs much as Doctor Stephen Strange assured Peter that he would heal and regain full use of his arm eventually, Peter was tired of healing. He wanted to be normal again. He wanted to be able to go through a full day without having a nap. He wanted the nightmares he had developed to go away. He wanted to be able to hang out with the Avengers without their eyes drifting to his injuries with a haunted look in their eyes.\n \nHe wanted to be Spiderman again.\n \nTilting his palm up, Peter pushed the fork gently into his left hand. Gritting his teeth, he attempted to curl his fingers around the metal. He could do this. He was going to eat his dinner normally, using both hands. He could do this.\n \nHis arm shook, rattling the plate but Peter ignored it. He also ignored the side-eyed stare he was getting from Tony and the non-subtle look that Strange was giving him from across the table. Sucking his bottom lip between his teeth, Peter used his right hand to help the tortuous slow curl of his fingers around the metal. He pulled away but jerked back as the fork begun to slip. \n \nHis left hand wasn’t sticky. \n \nPanic flooded his body, causing him to slam his right hand down over his knife. The table rattled with the force, cutlery clattering and liquid rippling inside the glasses. \n \n“Peter? You okay there?” Tony asked, making an aborted move to help.\n \n“Fine,” Peter snapped out, wrenching his hand back and out of Tony’s reach.\n \nThe knife stuck to his hand. Flicking his wrists, the knife stayed firmly attached to his right hand. The panic that had flooded his system eased back by like a receding wave from the shore. \n \nStill sticky. I’m still sticky, Peter thought as he used the edge of the table to pry the knife from his hand. \n \nIt was just his left side, the arm he had used to snap the stones and save the world, that wasn’t sticky. His powers still worked.  \n \nShaking his head, Peter took a deep breath. Going for the fork again, Peter adjusted his loose grip on the metal. Satisfied that it wasn’t going to fall, Peter lifted his arm by the elbow and positioned himself so that his fork now sunk into the hot lasagna that was on his plate. It sunk into the cheesy skin and Peter grinned. Placing his arm on the edge of the plate, Peter grabbed the knife in his good hand and started to cut his food. \n \nThe plate wobbled under his shaking and the veggies that adorned his plate slid about but Peter paid no mind. The knife cut easily through the cheese and soon enough he had a bite size piece speared onto his fork. \n \nRiding the high of successfully cutting his own food, Peter placed his knife on the table and gripped his left wrist. Slowly, he brought the shaking limb closer to his body, mouth automatically opening in preparation for the food. \n \nThe fork slipped from his grip, landing directly into Peter’s lap. Hot sauce smeared across the MIT hoodie he wore, sliding slowly until the fork fell from his lap and onto the floor with a loud clatter. \n \nThe conversation around the table died as everyone stared at Peter. \n \n“Shit,” Peter swore. \n \n“That’s mummy’s word,” Morgan piped up with a giggle and a large grin.\n \nPeter felt Tony shift beside him, heard him draw in a breath to no doubt tell him it was okay, but he didn’t want to hear it. Instead, he shoved his chair back, the legs scraping across the floor and stood, striding out of the kitchen and to the door. It flung open at his push, and he strode across the veranda until he was leaping down the front steps and crossing the front yard. \n \n“Stupid arm,” Peter hissed. “Stupid, stupid, stupid.” \n \nHis stomach growled and he groaned. He was so hungry, and Tony’s lasagna was incredible. With an angry huff, Peter turned on his heel and walked back to the house. Nobody said a word as he re-entered the kitchen, snatched his plate off the table with his good hand and then stormed back outside again. \n \nHe plopped himself down on the wicker chair, balancing his plate in his lap. He snatched a carrot stick from his plate and used it to scoop up some lasagne. The taste of melting cheese and rich tomato sauce soothed some of the frustration that was bubbling inside his chest, but it was still there, and Peter was tired of feeling it.\n \n \nThe reflection of the moon shimmered on the surface of the inky black lake. The water was mostly still, only disturbed by the whispering breath of wind that lazily swept across the land. The air was still warm from the hot summer day and Peter Parker found it the perfect night to sneak into Tony’s workshop.\n \nPeter strained his hearing, listening to the sounds of the lake house that had become familiar over the months he had been living there. The chirping of the crickets had taken some time to get used to, Peter so used to the sounds of the city. He found it soothing now, although sometimes he missed the city. There was the occasional creak of the house settling and the steady breathes of Tony, Pepper, and Morgan fast asleep.  \n \nEasing himself up off the bed, Peter quietly stood. He moved quietly to the window, pausing to listen. His heart pounded loudly in his chest, pumping so fast he thought that it would wake the whole house. But nobody stirred and Peter let out a shaky breath. He reached for the window, carefully sliding it open.\n \nThe warm air hit his face and he shivered. Glancing around his empty room and taking one more moment to listen for any signs of movement, Peter then climbed out the window.\n \nCarefully, Peter made his way down off the roof and landed on the ground softly. He remained in his crouch positioned, body tense and holding his breath. He half expected an alarm to go off the minuet his feet touched the ground (and some days he wouldn’t put it past Tony to do just that) but the lake house remained silent.\n \nStraightening, Peter licked his lips and cautiously started to move. He rounded the back of the house, following the veranda around and keeping low. The picturesque lake was lost on Peter as he crept around the edge of the house until he came to a stop by the back steps. There was small, paved pathway that led away from the house and to the workshop that Tony had built.\n \nWhen he had first woken up from his coma and was on steadier feet, Tony had given Peter a tour of the property.\n \n“It’s hard to imagine you being out here,” Peter had commented as they had walked around, nose scrunched. He had looked at Tony and when he caught the man’s arched brow, he hastily added. “Not that – I mean – you look happy out here. I just, it’s hard to picture you not surrounded by technology.”\n \n“I am,” Tony had said, taking pity on Peter. He had looked away, his gaze firmly on the lake. “When you…. On Titan. Being back in the city was too hard. I kept looking for you, swinging between the buildings. There were too many memories of you there and I was going to drown in them if I let myself. The world was in turmoil and when we found out that Pepper was pregnant with Morgan… I didn’t want her growing up in all of that.”\n \nPeter had swallowed back the emotion that had climbed up his throat. He had been surprised that Tony was being so open and honest with him. While he was still the same man that Peter remembered, he was softer, more open, less shark-like smiles and sharp quips.\n \n“I’m sorry,” Peter had said, guilt swirling around his stomach.\n \n“Hey,” Tony said, pausing in his steps making Peter stop too. Tony turned his full attention to Tony, biting his lip. “None of that was any of your fault. What you did, coming with me to Titan, snapping the stones. I’ve never been prouder of you.”\n \nThey had hugged it out there and when Tony pulled away, his eyes sparkling. “Besides, there is still plenty of technology out here.”\n \nThen Tony had led Peter down the path to the workshop.\n \nThe same workshop Peter now stood out the front of. Glancing at the house, he saw no lights and heard no movement. With trembling fingers, Peter punched in the code that Tony had used and heard the snick of the lock opening. As quietly as he could he slid open the door and stepped inside.\n \nFrom the outside you would think that the workshop would be full of wood shavings, farm tools and wooden work benches. This workshop was like stepping into the future. It reminded Peter of the workshop back at the Tower. It had the same set up, the large space filled with monitors, steel benches, computers, and the latest technology that geeks would kill for.\n \nStepping into the workshop had been overwhelming the first time and the effect hadn’t lessened this time around. Peter swallowed down his awe and moved deeper into the workshop. He moved with purpose, ignoring the itch that wanted him to sit down and examine everything closer without Pepper or Tony trying to drag him away to rest.\n \nPeter moved towards the edge of the workshop where a long, stainless steel work bench was. He moved along it, eyes searching the bench until he found what he was looking for. There, on the edge of the worktable was a small, engraved plaque:\n \n\nPeter’s Workspace \n\n\n \n\nThe first time Tony had shown him the words he had broken down into tears and had cried until he had drifted off to sleep in Tony’s arms. The words now still brought the stinging tell of tears. He sniffed, swallowing thickly and tore his gaze away. Instead, his eyes fell on the familiar web shooters.\n \nPeter reached for them with trembling fingers, exhaling out a stuttered breath. He slipped one onto his good wrist first before clumsily slipping it on to his other. Joy spread through Peter as he admired the familiar weight. It felt like a piece had been missing from him and there was still one more he needed to feel complete. He turned, wondering Tony would have stashed his suit –\n \n“Baaaaaaaaaaa.”\n \nPeter froze. Slowly, he spun on the spot to find Gerald the Alpaca standing in the doorway of the workshop. The woolly giant was looking at Peter was narrowed eyes, giving Peter the distinct impression that he was glaring at Peter.\n \n“Baaaa.”\n \nEven his baying sounded sinister.\n \n“Gerald,” Peter whispered. “Shhhhh. You’re going to wake everyone up and hey! No, don’t come in here!”\n \nIt was too late. Gerald had already stepped into the workshop, making his way towards Peter. His hoofs clicked against the floor, filling the silence, and making Peter wince.\n \nGerald had been another (delightful) surprise. He had never thought of Tony as an animal lover and the first time Peter met the alpaca, he had fallen in love. Gerald had immediately pushed his head into Peter’s good hand, eager for a pat.\n \n“Great,” Tony had huffed. “Of course, he loves you already. Will probably be your best friend while he keeps eating my berries.”\n \nGerald had nuzzled into Peter neck, shooting Tony what could only be described as a smug smile, making Peter laugh loudly. Over the few months that Peter had been living at the lake house, he had learned that Gerald really liked to mess with Tony. He continued to eat the man’s berries, no matter what contraption Tony set up to keep him away. The alpaca liked to steal the washing that Tony had hung up, sneak into the house and had even on one memorable occasion, pushed Tony into the lake.\n \nGerald was like an overgrown puppy. He was gentle, cheeky, and overall, a very loyal pet.\n \nBut Peter had also forgotten that Gerald had also taken over the role of guard dog. Peter had seen it in action when a reporter had tried to sneak on to the property to get some photos and had been chased all the way back to the main road by a very angry alpaca.\n \n(Gerald had been given as many berries as he liked in return for his good job.)\n \n“No, Gerald, go back outside,” Peter hissed, trying to herd the alpaca out of the workshop.\n \nThe alpaca didn’t listen. As soon as he was close enough, Gerald shoved his head into Peter’s stomach and pushed him. “Baaa.”\n \n“What?! Hey! Gerald! Stop!”\n \nPeter suddenly found the roles reversed and he was being herded out of the garage and back towards the house. Every time he tried to break away and rush back to the workshop, Gerald was there, shoving him in the back until he had grabbed Peter’s pyjama top and started tugging him back towards the house.\n \n“Alright! Alright!” Peter cried, throwing his hands up with defeat. “You win!”\n \n“Good boy, Gerald.”\n \nPeter’s head snapped up and he felt the blood drain from his face. Tony was there, leaning on the railing of the veranda, looking smug.\n \nGerald let out a baying noise that sounded very satisfied.\n \n“Did you set Gerald on me?” Peter blurted out, a mixture of shock and panic flooding his system.\n \nTony snorted. “As if that walking bag of wool listens to me. No, I didn’t tell him, but you should know how protective he is of the family.”\n \nGerald nudged Peter, gently nibbling at his ear.\n \nPeter jerked away, feeling himself softening and with his good hand he reached up to give him a pat.\n \n“Kind of late to be in the workshop, isn’t it?” Tony asked, his voice lite.\n \nPeter shifted from foot to foot, knowing that he had been caught. Tony had known exactly what he was up too. “Sorry.”\n \n“It couldn’t have waited until the morning?”\n \n“Would you have let me?” Peter asked, looking up to Tony. The frustration was back, making his words come out bitter and harsh.\n \nTony was silent for a beat before he pushed himself off the railing. “Come up here, Underoos. FRIDAY, lock up the workshop.”\n \nPeter heard the door of the workshop slide shut, and the lock click back into place. With one more pat to Gerald, Peter made his way up the steps. He made his way to Tony who was sitting on the outdoor couch and dropped down beside him, drawing his knees up to his chest.  \n \n“I want to be Spiderman,” Peter said, hearing the pout in his voice but not caring. “I’m sick of healing. I want things to be normal. I want to be able to eat dinner without you cutting up my food like I’m a baby.”\n \n“I know,” Tony sighed. He wrapped an arm around Peter’s shoulder, dragging Peter to his chest. Peter shifted until he was comfortable, laying his head over Tony’s heart and felt himself relaxing under the familiar beat. “You’ve been doing so well, Pete. I’m proud of you.”\n \nPeter sniffed, feeling tears well up. “I want to be normal. I’m tired of being tired. I want to be Spiderman.”\n \n“You will be,” Tony said soothingly.\n \n“When?” Peter demanded.\n \n“I was going to tell you this tomorrow, but if it stops you from breaking into the workshop in the middle of the night, I suppose I can tell you now,” Tony said, nudging Peter lightly.\n \nPeter perked up, lifting his head from Tony’s chest. “Tell me what?”\n \n“Stephen is coming by tomorrow. He’s going to start some physical therapy on your arm to help you get back your strength,” Tony said.\n \n“Really?”\n \n“Yeah,” Tony smiled softly. His grew serious, fixing Peter with a firm look. “It’s not going to happen overnight, and I know this is frustrating for you, but I need you to hang in there for me.”\n \nPeter swallowed more guilt filling him. He knew that tonight he hadn’t been at his best, snapping at those who were only trying to help. “I’m sorry for snapping.”\n \n“Hey, this isn’t easy for you Peter,” Tony said. “And we know that. We just all want to help you as much as we can.”\n \n“And I haven’t thanked you guys enough for that,” Peter said.\n \nTony shook his head. “You saved us all Peter. You never have to thank us for anything.”\n \nPeter settled into Tony’s side again, letting out a little sigh and snuggling in to get comfortable. Peter knew it was going to be tough and that there would be more bad days then good, but he had the greatest family supporting him the whole way.\n \nHe even had Gerald looking out for him, the best guard alpaca a family could ask for.\n \n \n \n \n \n \n“Great job, Peter,” Doctor Stephen Strange’s shout echoed somewhere from behind Peter.\n \nCheeks aching from how much he was smiling, Peter flicked himself off his web. He soared through the air, twisting his body so that was landing lightly on a thick tree branch. The branches shook and creaked under his sudden weight, but it held strong. Over the last few months, Peter had become over familiar with the trees that surrounded the Lake House. He knew which ones could hold the weight of his webs and which ones he needed to avoid.\n \nStephen drifted into view, hovering mid-air, the Cloak of Levitation fluttering behind him. He was smiling at Peter, his eyes glittering under the canopy of shade. “Well done.”\n \nPeter smile grew as the adrenalin of swinging on his webs still coursed through his blood. “Thanks!”\n \n“How does your arm feel?” Stephen asked, eyes darting to Peter’s left arm.\n \nPeter looked down at his arm, giving it a little twist. “Yeah. Yeah, it feels really good.”\n \n“And the adjustment in the suit Tony made?” Stephen asked.\n \nWith his good hand, Peter ran his fingers over the left sleeve of his Spiderman suit. While you couldn’t see it on the outside, Peter could feel the extra support that it now had. It was enough to keep his wrist and elbows supported without restricting the movement that he needed. It was the perfect upgrade to his suit and Tony had really outdone himself.\n \nPeter had come a long way with his physical therapy. The progress had been slow. Peter was often left tired and irritable, but not once had Tony or his family let him wallow in it. Each milestone he passed was celebrated and not once did Peter have to do it alone. It had started out with daily exercises to strengthen his arm and gain movement, then he had progressed to lifting weights until he was finally able to try swinging on his webs again.\n \nThe first few times had been disastrous. Peter hadn’t fallen that much since he had first started out. It took months of practice, of training until Peter was finally able to swing the way he once had.\n \n“Yeah, it’s awesome!” Peter bounced slightly on the branch with his enthusiasm. “I couldn’t feel anything.”\n“I could tell,” Stephen nodded. “You weren’t favouring one arm over the other this run.”\n \nPeter felt a warmth spread through his chest at the praise. It was something that Peter had been trying to work on, to get out of the mindset that his arm wouldn’t be able to support him. While the burns had faded from his face and neck, his arm still held the brunt of the damage. The skin was scarred with burns marks, no longer black and grey but pink and puckered. With a long sleeve on you would never be able to tell and Peter was able to forget, just for a moment, that he was fine.\n \n“We should head back,” Stephen said with a smirk. “Tony will be anxious to hear how it went.”\n \n“Race you!” Peter shot a web to the nearest tree, flinging himself off the branch, leaping over Stephen who dropped to avoid being hit. Peter let out a whoop as he flung himself around and through the trees, pushing himself harder and faster towards the Lake House. He could hear Stephen behind him, racing to catch up with him and it only made Peter giddier.\n \nThe Lake House came into view and Peter shot one last web, flinging himself out into the open and onto the front lawn. He landed on his feet, letting out another loud whoop as Morgan cheered for him.\n \n“Petey!” Morgan dashed to him and when she was close enough, Peter scooped her up into his arms, spinning her around until she was letting out a shriek of laughter. He stopped, setting her down gently.\n \nStephen had landed onto the ground, already beside Tony and Pepper who were waiting patiently, smiles on their face.\n \n“I won!” Peter beamed.\n \n“Just,” Stephen said, his eyes narrowed playfully.\n \nTony came forward, eyes running over Peter critically. “How did it feel, kiddo?”\n \n“Amazing,” Peter gushed, his emotions brimming to the surface. He blinked back the sting of tears and fell into Tony, hugging him tightly. “Thank you,” he whispered into Tony’s chest. “For everything.”\n \nTony’s arms came around him and hugged him tightly, his big palm sweeping up and down Peter’s back. “Anything for my kids.”\n \nPeter took a shuddering breath, surrendering to the warmth of Tony. Thing were starting to look up. Things were starting to return to normal.\n \n \nSchool hadn’t crossed Peter’s mind. With being busy healing, catching up on the last five years that he had missed and desperate to be Spiderman again, he hadn’t put much thought into it. Of course, he talked about it with Ned and MJ when they caught up together, wondering what it would be like and who would be in their class. They had learnt that several people they had class with hadn’t been dusted and were now in college, getting their degrees. It was sad and something that they were all struggling to wrap their heads around.\n \nSo, it came as a surprise when Tony had brought it up as they cleaned up after dinner, Pepper giving Morgan her bath before bedtime.\n \n“I got an email from Midtown today.” Tony glanced as Peter as he loaded the dirty dishes into the dishwasher.\n \nPeter paused from where he was wiping down the kitchen bench. “You did?”\n \nTony let out a small hum. “The schools are beginning to re-open. There’s going to be an information night for the parents and the students before you go back. To explain how it’s going to be done.”\n \n“Oh,” Peter blinked. He shifted from foot to foot, his brows creasing. “Can I – am I still able to go there?”\n \nTony straightened, looking surprised at the question. “Yeah, of course. Why would you think you couldn’t go to Midtown?”\n \nPeter gave a small shrug. “We live out here. I thought, you might want to pick a school closer to us.”\n \nTony expression softened. “Pete, you love Midtown. Your friends are there and it’s one of the best schools. We aren’t going to take you away from that.”\n \nTension bled from Peter’s shoulders that he hadn’t even realised he had been holding. “Oh. That’s cool.”\n \n“Besides, Morgan’s going to be starting kinder soon and we were thinking that we might move back to the city for that.”\n \n“Really?”\n \nTony nodded. “It’s something that we will discuss as a family. Obviously, we would still keep this place, come out here on weekends and for holidays. But for work, school, Spiderman and Ironman, the city is a more central location.”\n \nPeter nodded. It made sense but he hadn’t realised that Tony and Pepper had been discussing this. It should have surprised him that they were changing their life around him, including him in their plans. They told him often enough that he was their kid and he knew they were family but sometimes Peter’s anxiety got the better of him, that he was just a burden to the family.\n \n“We want to do this for you,” Tony said, guessing where Peter’s thoughts had gone to. “For the family. We will do whatever is best for the whole family. Is that something you would be open to discuss?”\n \nPeter nodded, giving Tony a watery smile. “Yeah. I’d be open to that. Like a lot.”\n \nTony chuckled and had gone back to loading the dishwasher.\n \nThings had moved quickly after that. The information night had come and gone and then they were packing up the lake house and moving into the repurchased Tower. It had been a whirlwind of activity and then just as suddenly Peter was being dropped off at Midtown Highschool of Science and Technology for his first day of school.\n \n“Can I please go with Petey?” Morgan asked with a whine.\n \nMorgan had been begging to go to school with Peter ever since she learned he was going. It had made Peter feel gooey with the amount of love he had for his little sister.\n \n“You’re going to your own school,” Tony said penitently. “You and Peter can swap notes at the end of the day.”\n \nMorgan let out a big sigh that was too big for a five-year-old. “Fine.”\n \nTony and Pepper laughed from the front seat, their grins matching Peter’s.\n“Have a good day, Peter,” Pepper said when their laughter had subsided. “Call us if you need anything okay.”\n \n“I will,” Peter promised with an eyeroll. They had had this conversation many times over the past week. Peter made a show of it, but he was pleased that Pepper was looking out for him. It made him love her even more.\n \n“Alright, enough sass,” Tony said. “Get out.”\n \nPeter laughed, giving Morgan had high-five before he pushed open the door and slid out of the car. He shut the door, giving a wave before bounding up the stairs to where he found Ned waiting for him.\n \nThe day was like falling into an old routine. There were new people in their classes and around the school and it made Peter feel a little out of step. His old classmates stuck together, sitting with one another in class and at lunch. It was going better then Peter expected. It was easier with Ned and MJ by his side, and he appreciated his best friends so much.\n \nAs the day had worn on, Peter had let his guard down. It had all been too easy. He should have known that there would be a trigger somewhere. That trigger was gym class. He and Ned were in the locker room getting changed, talking about a new Lego set they were wanting when a sharp inhale had them both pausing their conversation.\n \n“What happened to your arm?”\n \nIt was a new kid in their class who had pointed it out and Peter had frozen. He had forgotten to wrap it in a bandage before coming to school. He had been wearing a jacket all day and this was the first time had taken it off. The injury was easier to forget at home, where he didn’t have to hide it, didn’t have to lie about how he got it. \nThe day had been familiar, but this moment was a sharp reminder as to why everything had changed.\n \n“Did you get that from being dusted?” the kid pressed on.\n \n“Nick,” another new kid hissed. “You can’t ask that.”\n \n“Why not?” Nick asked, shooting the other kid a look. “I’m curious! We’re never allowed to talk about it.”\n \n“Maybe because it was traumatic,” Flash snarked back, glaring at Nick.\n \nPeter blinked with surprise.\n \n“Maybe we don’t want to talk about it and maybe you should mind your own damn business,” Flash continued, his words getting angrier and angrier. \nNick opened his mouth to say something, but the other kid shoved him. He looked at Peter, giving him an apologetic look. “Sorry.” Then he was pushing Nick out of the locker room.\n \nPeter swallowed, shoving his jacket back on.\n \n“Are you okay?” Ned asked quietly.\n \nPeter nodded; his mouth pressed into a thin line. He didn’t want to lie to his befriend but Ned seemed to understand. He wasn’t okay, none of them were and it would be a long time before they were. It was a comfort to know that Peter wasn’t alone, and he gave Flash a small smile of thanks and a nod. They weren’t okay but they would be.\n \n \n\n\n"
}