{
    "id": "23743363",
    "url": "https://archiveofourown.org/works/23743363?view_full_work=true",
    "author": [
        "aileenrose"
    ],
    "title": "A Blessing, A Curse",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "The Witcher (TV)",
        "Wiedźmin | The Witcher - All Media Types"
    ],
    "relationships": [
        "Geralt z Rivii | Geralt of Rivia/Jaskier | Dandelion"
    ],
    "characters": [
        "Yennefer z Vengerbergu | Yennefer of Vengerberg",
        "Cirilla Fiona Elen Riannon"
    ],
    "additional_tags": [
        "Angst with a Happy Ending",
        "Pining",
        "Curses",
        "Post-Episode: s01e06 Rare Species",
        "Geralt z Rivii | Geralt of Rivia Apologizes",
        "Jaskier | Dandelion Whump",
        "Emotional Hurt/Comfort"
    ],
    "language": "English",
    "series": "",
    "published": "2020-04-19",
    "completed": null,
    "words": "12,672",
    "chapters": "1/1",
    "comments": "366",
    "kudos": "13,504",
    "bookmarks": "3,297",
    "hits": "103,673",
    "summary": "<p>\"For a while, Jaskier doesn’t know he’s cursed. It feels like free will, going back down that mountain, just as dangerous down as the way up, and alone this time, too. The descent is fast, maybe even reckless, but Jaskier’s feeling numb and out-of-sorts anyways, Geralt’s words simmering in his mind, and at the time it doesn’t feel like he’s being pulled on by anything but his own desire to get away.\"</p>\n<p>Based off a post that Geralt's words on the mountain are granted by the djinn.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>Disclaimer, have only seen the show, just wanted to write some angst.<br>Credit goes to the_authors_exploits for the idea!</p>",
    "text": "For a while, Jaskier doesn’t know he’s cursed. It feels like free will, going back down that mountain, just as dangerous down as the way up, and alone this time, too. The descent is fast, maybe even reckless, but Jaskier’s feeling numb and out-of-sorts anyways, Geralt’s words simmering in his mind, and at the time it doesn’t feel like he’s being pulled on by anything but his own desire to get away.\nIt’s not until a day or two later, when he rounds a curve in the road and the bulk of the mountain is suddenly eclipsed by the tree line, that he feels completely free of it. He’s hungry, he realizes. He could use a nap. Some things got lost in—whatever that was, a primitive need to put distance between the hurt and that which is hurting you. But he feels much better now, he thinks, as he finds a log near the road and stretches his exhausted legs in front of him. Soon it will be like it all happened a long time ago.\n~\nJaskier forgets about it, because life returns to something like normal. Normal is walking the roads, town to town, finding inns where he can play for a meal and a place to sleep for the night. Normal is falling in with a group on the road, if he can find one, or walking with a dagger up his sleeve if he can’t. Normal is hearing warnings about bandits haunting this road, rumors of Nilfgaardian soldiers on this one, and making extravagant detours around those places, just in case. It’s spending his evenings at the inns in a tankard of ale, and spending his evenings on the road fireside, carefully darning the snags in his silks by firelight.\nHe hasn’t written much new material, since it happened. But it feels like the words are pulling themselves together in his mind, the chords working themselves out before he even touches his lute. He isn’t worried. In terms of new material, he’s always been told that heartbreak is the best thing that can happen for a bard.\n~\nHe’s playing a set at a tavern in backwoods Redania when it happens. One moment, he’s working the crowd, all in poor spirits about some nearby drowners, into cheer with “The Fishmonger’s Daughter,” the next moment there’s a sharp pull, like a hook, right behind his belly button. He stumbles from where he’d been standing, one leg propped on a chair. The lute strings make a sharp, discordant noise.\n“Sorry,” Jaskier says brightly. “Where were we?”\nBut he finds he can’t resume the song, even though his hands are tightly gripping the instrument—it’s his legs, pulling him forward, it’s this sudden pressure in his head, all over, this mindless need to go. It’s like being in a tight vise, squeezing everything out of him, even his breath.\n“I—intermission, everyone,” he says, because what else can he do, when his legs are walking him out of the room? He’s lucky that he hasn’t taken a room in the village, has just the time to loop his pack onto his back, grab up his open lute case, which is sadly still mostly bereft of coin—he’d only just started.\nThere’s grumbling now, around him, especially as he ricochets off of a couple bodies on his way to the door. He can’t help it, this lack of control, but he can hear the disgruntled muttering, the boos.\n“Hey, you’ve got the chorus from here on out,” he says over his shoulder. “—Fishmonger’s daughter, ba, ba, and repeat—”\nAt that point, the tavern’s door has already slammed shut behind him.\nHis legs carry on, walking him west. He wasn’t initially planning on that—he was going to try north, which seemed safer—but it seems the right way to go, now. The only way. As he keeps on, that terrible vise feeling slowly relents, the pressure easing up. A couple hours later, it’s gone, and it’s past midnight and the road is dark and he finally stumbles to the nearest clearing to sleep, and to not think, to very purposefully not think at all.\nWhen he wakes the next morning, he chalks it up to performance anxiety.\n“Every bard gets it from time to time,” he tells himself, because talking aloud silences other thoughts. “Even the most well-beloved. Especially those. As they say, even the sun gets a cloud sometimes.”\nAnd then he can forget about it, mostly, because it doesn’t happen again for weeks to come.\n~\nIn many ways, Jaskier is doing well. Better than well—excellent. After holding off, he finally debuts “Her Sweet Kiss,” and as his travels continue, he has more than once heard its familiar notes being played by another instrument, from another bard, as he walks through another town. It is perhaps because of this that a letter somehow finds him, waiting at an inn in a backwater corner of Redania, from Oxenfurt, asking if he’d want to come there and teach for a year. He also has had several memorable nights in beds shared by others, particularly one occupied by two lovely twins.\nJaskier should be happy by this—he is. But his mind returns more than he’d like to a time, several months before, when he still had a traveling companion. He thinks about the easy habit of unrolling his bedroll next to Geralt’s. How Geralt patiently talked him through his different vials, the one time he’d been so injured that Jaskier had had to lug him against his shoulder back to camp, and uncomplainingly let him unclothe him, clean the blood away. He thinks about those nights when Geralt would feed twigs into the fire while Jaskier would sit with the lute on his knee, fingering out a new composition.\nSometimes, for a diversion, Jaskier would ask Geralt for a word, any word, and he’d try to make a tune to it. Geralt would do his typical glare, his typical silence, but sometimes he would unexpectedly throw out a word after a few minutes—guts or purple or Roach—nothing overly inspired, but still, he had.\nOther times, Jaskier would come up with most of the words himself, something like, Even if she can scratch the itch/ nothing in the world’s worth a—\n“Jaskier.”\n“What’s the word?” Jaskier said, strumming his fingers. “There’s a word, a perfect word—”\n“Jaskier.”\nAnd he’d laugh, because it only proved Geralt had been paying attention.\nBut.\n\nIf life could give me one blessing, it would be to take you off my hands. \n\nNot just the words themselves, painful as they were, but the delivery (Jaskier should know, as the performer): the pointed finger, the venom sunk into you, the way he’d pivoted away afterward, a wordless dismissal.\nWhat else is a man to do with that? All along, the bedrolls side by side, the help after hunts, the nights of listening to Jaskier playing lute fireside—Geralt must have been seething, stuck with a presence he’d never wanted burdened with in the first place. They must have been words he’d wanted to say for a very long time, built to their boiling point. Jaskier might not always be a reasonable man, but he’s not so stupid as everyone assumes him to be. He’d thought Geralt had come around, but that was just as likely as trips to the coast together, wasn’t it?\nStupid, yes. But not anymore, he promises himself. He can be reasonable. He can stay gone.\n~\nIt happens again. It wakes him up from a deep sleep and, bleary-eyed and confused, forces him from the bed he’d paid good coin for.\nIt happens another time—this time, halfway up a woman’s skirts behind the stable, and she laughs breathlessly, thinking he’s not serious, when he suddenly extricates himself and takes several backward strides away.\n“What are you—” she calls, when the distance continues to grow.\nAnd Jaskier tries to move his legs, to reverse course, and finds it’s like they’re made of lead, and his head is pounding as bad as mornings after drinking, and he can barely see—\n“My lady,” he says, trying valiantly to act as if this is in the plan. “My sweet, dear Adrianna—”\nBut he can’t stop for her, his body wheeling him around the corner and marching him down the road, and he hears her voice calling pig’s ass somewhere in the distance.\nAnd it happens again, only a few days later, the pressure, the vise-feeling, forcing him off the road and into a jerky lock-step through the woods, fighting it every step of the way, and when the feeling suddenly lifts away he finds himself so lost it takes him hours to find civilization again.\nHe is scared now, he can admit this to himself. He is scared of not knowing when it will happen, why it happens at all. He sleeps with his clothes on, with all of his belongings an easy reach away. The next large town he finds, in Temeria, he asks around until he finds the old woman, herbs hanging in bundles from her ceiling, who he thinks can help him.\n“Payment first,” the old woman croaks, holding out a hand, and he tries not to be aghast about how much money exits his bag for her palm. He only has enough to buy an hour.\nThen she makes him drink a terrible tea, filled with ingredients she won’t divulge, and sit for a while as she feels over his head with her fingers.\nHe’s just about lulled into sleep with that when she suddenly whistles through what teeth she has left.\n“That’s some curse,” she says.\n“A curse?” he says. “On me?”\n“Maybe not a curse,” she says, “but a wish. But a wish that may as well be a curse.”\n“What?”\nShe only looks at him.\n“Could you, perhaps—dear, dear woman—be clearer in what that means?” Jaskier finds his voice is rising, tries to tamp it down.\nShe thinks about it. “It’s not a question of why,” she says, “but who.”\n“Who—” he sputters. “It doesn’t matter. Can you help me make it go away?”\n“This is powerful stuff. Not something I can hope to act against.”\n“I’m doomed,” Jaskier says. He feels hot and cold all over. “You may as well poison me and be done with it here. Someone wants me to walk my feet off, right to death, and the crone says—beg your pardon—that nothing can be done.”\nThe woman lifts a hand. “Well, maybe something can be—”\nBut Jaskier never knows the rest of that sentence, because he’s suddenly lurched to his feet, the dregs of the tea spilling to the floor, and his feet moving themselves all on their own.\n“Hey, wait a second,” he says. “Please, what’s the something? What can be done?” At this point he’s clinging to the doorframe with his fingernails, trying to stay in the room with her. And when she only looks at him again, he says, “Never mind, never mind. I paid for a full hour—won’t you give me the rest back? I’ll need it.”\nThe woman smiles and holds out her palm, still filled with his coin. “Surely,” she says. “Come and take back what’s yours.”\nAnd Jaskier can only swear at her up and down three octaves when he makes a desperate grab and is immediately yanked the opposite direction, as if by a hand at the scruff of his neck, and his body is good for nothing but moving away, away, no matter what he wishes otherwise.\n~\nHe’d tried to be safe—as safe as he could be, all considering. He doesn’t want to go any closer to the border, to Nilfgaard and its soldiers, than he has to. So on top of his worries about the sudden and unexpected moments that his body moves him senselessly from place to place, he’s getting concerned about where his body won’t let him go—away from there. If anything, it seems to be dragging him closer and closer.\nThere comes a night, at a falling-apart tavern with the wind whistling through a hole in the eaves, that he sees them—three Nilfgaardian soldiers. Cloaks obscure their armor, but he knows. He’s only got a partial view of them, tucked next to a broad man on the table beside him, but he can hear them well enough as they speak to the barmaid.\nThey want to know if a bard’s been through recently. Their hands sketch the air around how tall he is. Brown hair, they say. Flashy clothes. Carries a lute.\nJaskier hastily kicks his lute case beneath the table. The broad man beside him, nearly asleep, doesn’t notice.\nHe’s lucky that he hadn’t played yet, turning over nearly the last of his coin for something nearly stew instead. He’s lucky that his clothes haven’t been so flashy recently, not after being forcibly blundered through muddy trails and all manner of vegetation. He’s lucky that the barmaid didn’t look closely at him, that the man beside him is nearly comatose. Still, his heart is jackrabbiting in his chest, and he waits only as long as to see the Nilfgaardians depart before he does so, too, his knees shaky, sticking close to shadows.\n~\nJaskier has to wonder how a humble bard could manage to accrue both a curse on his body and a headhunt from Nilfgaardian soldiers. He’s not been without his enemies—he thinks of the beds he’s stolen into, taking the place of absent husband and wives. Surely there were those out there with grudges against him for this (even Geralt had witnessed this, once, yet another night when Jaskier had shoveled shit, he has since learned), and the coin to exact some kind of revenge, but somehow he can’t see that anyone would—not like this, in this way. But it seems there are no more answers, at least not the kind he could pay money for.\nHe aims himself north, avoids the road as much as possible. He makes camp beneath a large, dead oak, and is in better spirits the next day as he scuffs out the ashes of his fire. He even brings out his lute as he walks, and fiddles out a few different ditties as he goes—nothing serious, but something to walk to. He can do this on his own, he knows. He just needs to get away from the soldiers, make his way to Oxenfurt, chain himself to a classroom wall there if he needs to, just to keep his body where it’s supposed to be.\nIt’s around sunset when he pushes his way through a bramble and then fumbles his grip on his lute, fingers suddenly grown loose.\n“Fuck,” he says. Because there’s the large, dead oak, there’s the fire he scuffed out this morning. It seems a particularly nasty trap of the world’s making, putting him no further from danger, no closer to safety. He has walked all day only for his body to steer him in a circle back to where he began, with him none the wiser—that he hasn’t been in control, even when he thought he was.\nJaskier doesn’t bother with a fire that night, or dinner. He lays very still on top of his bedroll and tries to run through a list of people he has known who would do this to him, and then a list of people he has known who would be willing and able to help him undo it, and is chilled in the morning to find both lists empty of names, answers.\n~\nA happy memory: the sharp edge of glass that went clear through the sole of his boot. Only because at the time, he’d been walking along next to Roach, tuning the lute and telling Geralt a running list of who held grudges against who in Oxenfurt’s faculty—he would have done better to have a map to draw it all out, but Geralt, although not remarking, had his head tilted to the side like he was listening—\n“—But she, of course, can’t stand him, because he dismissed her last song cycle as trite, if you can believe—fuck!”\nAnd also because, at the time, Geralt immediately (and gratifyingly) leapt down from Roach, boots heavy on the dirt, and caught Jaskier by the arm as he hopped around on one foot and swore.\n“You’re bleeding,” Geralt said, not a question, because Jaskier had learned long since that witcher senses knew such things.\nAnd although Geralt’s bedside manner was virtually nonexistent, he had sat Jaskier down on a nearby boulder, pulled off his boot—thrown it over his shoulder—and immediately started probing at the tender arch of Jaskier’s foot.\n“—go green with rot and infection, eventually lose my whole leg—”\n“It’s not bad,” Geralt grunted.\n“—the one-legged bard, that’s what I’ll be known as, and it’s not like I lost it even for a romantic reason—”\n“I’m pulling it out now,” Geralt said, and then did. Jaskier yelped and then stopped talking, realizing there was something much better about watching Geralt knelt before him, rooting through his pack in concentration, his other hand cupping Jaskier’s heel.\n“Why, Geralt,” he said. “I don’t know what to say.”\n“Hmm,” said Geralt, knowing better.\n“But I would say, if pressed, that it warms the heart to see how quickly you jump to the aid of your very best friend—”\n“Not your friend.”\n“Your closest fellow traveler—hey, ow—” He reflexively tried to pull his foot back, but Geralt’s grip was iron, keeping his foot in place as he rubs a salve of some kind over the broken skin, and there was just a brief flash of gold eyes as Geralt glanced up at him—the message of stay put obvious—before he returned to his work.\n“Or, if you prefer, your most trusted compatriot, your loyal bard?” Jaskier continued lightly, watching as Geralt made quick work of binding his foot, his expression one of complete concentration.\n“You’re not my anything,” Geralt said shortly.\nWhy does this remain a happy memory for Jaskier, despite all the signs—Geralt’s dismissal of them as friends, as anything at all? Wasn’t it just another moment in a long series: that Jaskier had caused another problem, however slight, that Geralt felt obligated against his will to fix?\nMaybe because he had been convinced that day, and for many days after, that Geralt’s actions at the time had shown some kind of care, or concern—like with the djinn, but without the accusation of shoveling shit. And also because, afterward, there was no Yennefer, but still just the two of them. Geralt had steadied him as he hopped on one foot over to Roach. Geralt had grabbed him around the waist and effortlessly boosted him up onto the horse. Geralt had efficiently swung up behind him, the bulk of him steady against Jaskier’s back, pressing against his legs, one hand reaching around him for the reins.\n“Whoo,” Jaskier said, a little faintly. And then, “It’s a whole different world up here on Roach, isn’t it? Even the air seems a little thinner.” Roach chuffed, her ears flicking back and forward again.\n“Jaskier,” Geralt said in his ear, the shut up implied. But maybe it’s also because, in that moment, since Jaskier couldn’t see him, he could imagine whatever he wanted, and not be proven wrong. So he imagined that Geralt’s lips had quirked against his ear when he said it, a smile he never had for him in real life. He imagined he heard a warmth in Geralt’s voice when he said it, a fond kind of exasperation—he could have sworn to it. But—he sees now— he must have never really heard it then, and wouldn’t again.\n~\nJaskier does get one answer. He does find out who cursed him.\nFor days he’d been camped just past a small village in Sodden, a small pinnacle of land that dropped off into cliffs on either side. There, he thought he might at least see someone—bandits, Nilfgaardian soldiers, or whoever else— from above if they came for him. There, remaining rations and coin had been slowly running out. He’s been mostly without a plan, too. He can’t seem to move any further north—toward safety, away from renegade Nilfgaard patrols. But the only other directions he seems to be able to go are closer to such a danger, and playing for money would likely alert Nilfgaard or any informants to his whereabouts, so he remains where he is, stuck, going nowhere.\nHe only has one plan, if it could be called that, and it is to try to find a way to contact Yennefer. The prospect does not excite him. He doesn’t know if it can easily be done, or done at all, and there is no love lost between them. Yennefer could just as likely make him grovel and beg and then still not help him. But the witch—the sorceress, Geralt had corrected him multiple times—is the only person he can think of who might have the power to help him.\nIt happens again. He is eating a stale heel of bread when his body suddenly and urgently pulls him to his feet, and he is run at a frantic speed through the woods and along a cliff’s edge. He is sick several times over, vomit down the front of his clothes, but nevertheless he is pulled like a helpless marionette until, suddenly, he isn’t.\nHe doesn’t have the energy to question it then. He has a brief, cold, miserable nap along the cliff’s edge, and when he wakes he slowly tracks his way back to his camp—expecting the same resistance, getting none. Apparently it is safe to return to where he was. When he gets back to his campsite, it appears undisturbed.\nHe doesn’t know what he’s expecting when he walks into the village. He’s on the receiving end of several odd glances, probably because of the vomit all down his front, which puts him on edge—he doesn’t want the wrong set of eyes to notice him. However, most of the villagers are out, talking loudly and excitedly, many bristling with weapons, their attention pulled elsewhere.\nJaskier tugs on a man’s sleeve. “What’s all this about?”\n“Witcher,” the man says, and spits. “Came here demanding to be let through, but we gave him exactly the kind of welcome he deserves.”\nJaskier knows, he already knows. But still he asks. “White hair? Yellow eyes?”\n“That’s the one. There he was, promising he wasn’t going to harm any of us, but we knew better, Butcher of Blaviken that he is,” says the man, who, along with his village, obviously hadn’t heard “Toss a Coin” come to these parts yet. “But he wanted something desperately, that was obvious. Nearly feral to get at something—someone, if you ask me.”\n“Where—” Jaskier says. He’s starting to feel faint. “Where did he go?”\n“Back where he came from,” the man says, and jerks his thumb north—north, the direction that Jaskier can’t go in recently, where his body won’t let him go. “He didn’t take no well, so we’ll be waiting for him if he does choose to come back.”\nJaskier turns away. They’d all be killed, of course. Stupid, thinking a couple pitchforks, a crossbow, could stand against Geralt if Geralt had really wanted to do harm against them. The old habit to defend Geralt against the hatred of humans comes easily, but he doesn’t voice it.\nHe walks back to his campsite, feeling each realization sink like a rock in his stomach. He remembers the first time it ever happened—merrily singing “The Fishmonger’s Daughter” all those months ago—a village plagued by drowners. And the other times since, at villages and waysides that two frequent travelers could, by chance, intersect at, each for their own reasons. There could be no coincidence that Geralt would come here and it would happen again.\nHe remembers what the old woman he’d paid had said—that it wasn’t a question of why, but who. Was it Geralt who cursed him? Was it Geralt who wanted him so far away him from that, whenever opportunity brought them close together, he was forced elsewhere, beyond the possibility of encountering each other?\nHe wants to feel angry, but he only feels empty. Had he been that much of a pest, a nuisance, that Geralt couldn’t have believed Jaskier would, without this, stay gone?\nWhatever reason had brought Geralt in this direction—Jaskier would leave in the morning, so that Geralt could return and do what he needed without nearly running Jaskier off a cliff.\nHe slowly wrestles out of his soiled clothing. He realizes that’s the only plan he’s got. He can’t ask Yennefer for help, after all—she’s probably the one Geralt asked to do this. Jaskier doubts she’d undo something that benefits her just as much Geralt, in the end.\n~\nThere’s a switchback trail that takes him down the cliffside early the next morning, nearly as treacherous as the descent down the mountain all those months ago. He has a few hours of peace.\nAfter that, it gets bad, and stays that way.\nIt happens again and again and again, an increased frequency that he can’t make sense of, even if he wasn’t exhausted. If he stops to eat, sleep, or relieve himself, he is quickly pulled on again, his feet stumbling over themselves, lurching him onward. Even when there’s a stitch in his side, when he’s crying for breath, when every muscle in his body is shaking and weak.\nWhy doesn’t Geralt stop this? Doesn’t he understand Jaskier is trying already to leave him be?\nHe is forced up rocky hillsides, his hands cut and bleeding from the scree, the footing so dubious that Roach would probably not be able to climb it swiftly, or at all. Along perilous outcroppings of rock, where his doublet catches a snag and he has no choice but to leave it behind, swinging ghostly in the breeze. Into circuitous routes that sometimes, as it did before, return him to places where he just was. His body forces him across cold rivers, shivering, as if to throw Geralt off his scent there. Fighting the pull of it seems dangerous when his body is already in danger, so he simply lets it happen, feeling like he is watching someone else’s body attempt these hazards. In this way, two days pass—but it doesn’t seem to help. Geralt still seems close at his heels, no matter what he tries. He keeps on having to keep going.\nThis can’t be what Geralt wants, he thinks hazily. He knows Geralt—knows he wouldn’t play with him like this, a cat with a mouse. He must not realize how he is driving Jaskier before him, like a fox flushed from its hole, and the trap is slowly tightening around him—the territory more dangerous, the stakes even higher.\nOn the third day, his feet lead him past a group of traveling musicians, and in desperation he grabs at them—he sees they are frightened by him, by his dirtied clothes, his unkempt appearance.\n“A song for you to perform at your stops,” he says. “Please.”\nHis feet are dancing beneath him; he feels like he’s standing on hot coals, the longer he resists, screaming at him to move on.\nThe musicians take pity on him. It’s not his best work—he doesn’t feel that he can leave too obvious of a communication for anyone else’s ears—but he hopes the message is clear:\n\nThe white wolf and his prey go round and round/Does he realize his prey will be run into the ground?\n\n\nIf not the wolf’s teeth at his heels/His prey will be caught beneath an empire’s wheels. \n\nIt seems, that night, that Geralt has heard his message. Jaskier sits, exhausted beyond measure, at a creek in the dark, resting his aching body in the cold water. He imagines Geralt stopping at one of the inns Jaskier passed by, hearing that scrap of song meant for him, or perhaps catching up with the musicians on the road and, upon listening, turning Roach in the opposite direction. He wishes for it, fervently. At that moment, he wishes to never see Geralt again, to never be within even ten miles of him.\nBut no—with a gasp, he is pulled awake only moments after unrolling his bedroll, already shambling up to stand.\n“No, no no no,” he says, but it’s no use. He grabs onto a tree, wraps his arms around it. He holds on as hard as he can, his head swimming. His bedroll, his pack— his lute. They’re still there, only a couple paces away, but they might as well be across the continent. He can only watch his arms shake with the strain until he can’t resist the draw anymore, and he’s off again, lurching away. He wants to cry in frustration, he wants to shout, but he knows now that soon enough he’ll be gasping for breath, so he saves it while he can.\n~\nIt seems, if anything, that the song has only redoubled Geralt’s efforts.\nThere isn’t time anymore for him to stumble to a halt, or rest. At one point he falls, his legs giving out beneath him, and still he is forced to crawl on, the vise-feeling tightening, a stranglehold around him.\nSeveral times he passes out while walking, but when he comes to, he’s still moving, still doggedly going forward. His eyes feel rubbed raw, his tongue bone-dry in his mouth, the last of his bread crumbling to dust in his mouth. His boots are peeling away from their soles; he walks right out of them.\nIt is mindless, the kind of instinctual need to run that a predator’s quarry feels—the need to get away. But he can’t. It’s Geralt, the White Wolf. Of course he can’t get away.\n~\nA happy memory: one night, many months ago—before the mountain, before all of this. A cold night, despite the fire, and both of their bedrolls pushed close together for warmth.\nSometime in the night, Jaskier woke, finding himself pleasantly warm: Geralt against his back, his arm across his waist. He was too drowsy to be surprised, or to comment on it. But when he leaned his head back, he saw Geralt was awake too: those handsome features traced by firelight, in much the same way his poet’s heart wanted to trace those features with his fingers. He was awake, and looking right back at Jaskier.\n“Did I—wake you?” Jaskier asked.\n“No,” Geralt said. He didn’t move to draw his arm back, or put inches between their bodies where there currently were none.\n“Oh,” Jaskier said. He felt a yawn coming on but his hands are pinned by Geralt’s arm, so he ended up turning his head into his shoulder—Geralt’s shoulder—to muffle it.\nSomething else he had imagined: that he had seen Geralt’s features soften in the firelight at that.\nJaskier was used to voicing his feelings to his lovers, but this was different. There was always that tender part in him that feared that Geralt didn’t feel the same—the tender part that ached, that whole way down the mountain—and what did he have to pin it on? A listening ear, a foot bandaged, an arm around his waist as he slept. It wasn’t enough for Jaskier to ever know for sure.\n“Go to sleep, Jaskier,” Geralt rumbled.\nThere was that part of Jaskier that yearned for Geralt to know how he felt. He hoped that Geralt could, somehow—those witcher senses—parse out his love, his lust, his devotion, all bursting forth in a flourish whenever he was around him. Rather than withering, they only seem to strengthen with time. There were moments, like then, when he was sure Geralt could sense it. That tender part in him waited to see what Geralt could do with that knowledge, which could be wielded against him as expertly as any weapon Geralt might use.\nAnd then, softer, “Jaskier, go to sleep.” The arm cinched tighter. Jaskier slept.\n~\nJaskier’s not sure what day it is the day he leaves the forest and sees the keep, standing high on the plain, the setting sun casting it red. The vise-feeling still simmers beneath his skin, softly burning, but it has lost its urgency, and for the first time in more hours than he can count, he is aware of his surroundings. As if from the end of a long tunnel, he sees a trickle of people walking through the door set into the wall around the castle. He sees a soldier turn, spot him, and wave a hand, high and insistent, over his head, gesturing him over. He discovers there’s nothing pushing him forward now except for the desire for shelter. On quivering legs, he pushes himself forward, crossing the shorn fields to where the soldier stands.\n“You just made it,” the soldier tells him. “We’re barring the gates now.”\nJaskier is too exhausted to ask. He must nod, he must be told next where to go. He doesn’t remember. He leans his shoulder heavily against the wall within as he trudges further into the keep. His breath is rasping up from his throat, and he doesn’t realize until someone lays a hand gently on his arm, gives him a waterskin. He drains it, find his head is still fuzzy, and a distant pain like a blanket over his whole body. He just wants to sleep.\n“Where am I?” he asks.\nA voice at his elbow answers, but it’s too hard to focus his eyes on any one image. “Lord Kosma’s keep.”\nAnother voice says, “You must have walked far to get here.”\n“Yes,” Jaskier says. He pats over himself, feeling that he’s all still there. His stomach pulses with hunger beneath his palm. His chin is covered over with bristles—he can’t remember, in all of this, the last time he used a razor.\n“Will you be able to hold a weapon, son?” The voice is brusque. Jaskier’s swimming eyes try to find the speaker.\n“A… weapon?”\nThis is how he learns that Nilfgaardian soldiers are waiting at the southern border, that Lord Kosma’s keep is all that’s standing between them. The doors have been barred, the high walls packed shoulder to shoulder with Kosma’s soldiers, able civilians, all that can keep them from being annihilated one and all.\nThis is how the trap around Jaskier has been sprung: that Geralt has pushed him to here, where he can go no further, where the other jaw of a pincer waits for him. He wonders in a detached way if he’ll be recognized and captured, questioned for whatever reason Nilfgaard has been searching for him, or killed outright. Either way, death seems imminent.\n“This man can’t hold a weapon,” someone says. “He can barely stand upright. Put him in the banquet hall with the rest.”\nA long time seems to pass. Around him, in the guttering light of the torches lining the banquet hall, people shift uneasily, crying and cursing. An elderly man sits quiet, mumbling to himself. A small girl pushes herself into her mother’s arm, her sobs muffled. Outside, there’s a slowly growing barrage of noise. The Nilfgaardians must be attacking them now. It is only a matter of time.\nThere’s a sudden, unpleasant clenching that comes down around his entire body.\n“Ah, bollocks,” Jaskier says, but without any real heart. He’s been half-expecting this. He’s propelled to his feet, pushed as if by a gale-force wind against the opposite side of the banquet hall—the side furthest from Geralt, he guesses. But Geralt can’t really be here, can he? They’re all about to be slaughtered.\n“What are you doing?” The voice is harsh; one of the few soldiers that is not on the walls, left behind to protect them.\n“I don’t,” Jaskier says. “I don’t know.”\n“He’s scared,” someone says. “He’s running away.”\n“I am not running away,” Jaskier says, as his body meanwhile repeatedly slams itself against the unmoving stone walls. His fingers scrabble uselessly at the rock, as if they could dig himself through the stone and out.\n“He’s trying to escape,” another voice chimes in.\nAnother, hysterically: “He’s a spy! He’s trying to go back to Nilfgaard now.”\n“I’m not,” Jaskier starts to say, and his voice chokes away. The vise twists tighter, tighter. It pushes him to his knees. There’s a pain all over, as if from standing too close to a hot flame, but he can’t move away from it. There’s nowhere else to go.\nThe soldier snaps his fingers at two others standing by the doors. Together they drag Jaskier out of the banquet hall and up the stairs, where he won’t be inciting further hysteria. His feet kick out beneath him, his arms twist.\n“Stop resisting,” the guard says.\n“I’m not—trying—to,” he gasps out, as his body jerks violently in their grasp, and he gets a blow across his face for his troubles.\nThey chain him to a bed on one of the upper floors, the chain looped around his wrists and one of the bedposts. They stand there for a moment, satisfied that their work seems to be holding, and then they leave. A bolt slides into place—they have locked him in.\nJaskier can understand, now, the mindless need of a rabbit whose leg has been caught in a trap. How it could be driven to gnaw off its own leg if it means freedom. The bed is shuddering beneath him as his body throws itself away from the bedpost, again and again. The chains are rubbing his wrists raw, and still—the vise-feeling is too much, driving his body to panic. There are loud sounds in the corridor outside—screams, blades screeching against each other. The vise-feeling is so strong he feels like a dishrag, wrung impossibly taut. He feels like he could snap apart.\nThe bedpost suddenly gives way beneath him, sending him to the floor. He stumbles back up immediately, and drags the chain and the bedpost to the window. He watches as he wildly flings his caught hands out, sending the bedpost through the glass of the window, shattering around him. He watches as first one leg, then another, step onto the window’s ledge. Vaguely, he can see motion beneath him—flame, the writhing of armor, swords, from those fighting beneath him. His teeth are chattering. He can’t stop.\nBehind him, the locked door suddenly, violently opens, splinters flying like sparks. There is Geralt, filling the doorway. It is amazing, nearly magic, to see Geralt after all these months, that he’s remembered nothing wrong. He’s got a sword tight in one hand, a slash of red against one cheek. His hair in disarray, snarled mouth—he looks feral, a true wolf. His eyes snap to Jaskier’s, and they are like flame from across the room, bright enough to burn.\n“Jaskier,” he says. “Get out of the fucking window.”\nA hysterical sound, almost a laugh, climbs Jaskier’s throat. “I would like to.”\nGeralt takes one step into the room, and immediately Jaskier’s legs cramp, wanting to take that one step forward, away from Geralt in the only possible direction—out the window, a sure drop to death.\n“Go away,” Jaskier moans. “Please—I can’t—”\nHe can’t see anymore. It seems like Geralt’s voice is further away. The voice is saying, “Jaskier, Jaskier,” but the tone is all wrong—sharp, but worried, powerless. It doesn’t sound like Geralt at all.\nJaskier’s legs buckle beneath him. He grasps onto the window frame with both hands. He knows he can’t hold on forever, that he can only buy these few seconds, shaking in fear as his fingers unpeel themselves from their grip on the frame, one by one. But there is something in him, a hidden well of strength he’s always had, and he funnels every last bit of himself into that thread of willpower, steeling himself against the curse, fighting it harder than he ever has. His heart, wanting him closer to Geralt. His body, forcing him further away. It’s his last stand, he thinks. Geralt is saying something to him, but he can’t hear it, not over the rush of noise in his ears.\nThen.\nHe doesn’t know how he notices, but he does. He lifts his chin from where it’s tucked into his chest, and it’s like his head weighs more than a boulder, trembling on his neck. But he looks, because there’s a crackling feeling like static, or lightning, in the air. A shift, like the drop in pressure before a storm. He looks over his shoulder—another finger gives up its grip—and sees Yennefer walking across the bedroom toward him. Her dress floats behind her, her purple eyes fixed on Jaskier.\nIs this what she’s here for? A chance to gloat, before the end of it all? But her voice is gentle as she says, her voice echoing strangely in his ears, “Poor little bard. You’ve gone a long way, haven’t you?”\nHe hasn’t the strength anymore to answer. One of his hands wrenches itself entirely from the window frame, the chain pulling against his other wrist; he is listing forward into the void; it is all his body has the power to do. But Yennefer is closer, and her hand is incredibly soft as it comes down upon his forehead. After that, he doesn’t know. All he sees is black.\n~\nHe wakes up to someone humming one of his songs.\nIt is an older song of his, not one he’s circulated in his repertoire recently, about a siren who cries as she sings her prey to their watery sleep. He remembers Valdo Marx calling it melodramatic. Jaskier had always been proud of the particular transition into the second stanza—\nJaskier feebly hums the next few notes, forcing his eyelids open.\n“Oh good,” says a high, girlish voice. “You’re finally awake.”\nHe’s in a high-ceilinged room, filled with sunlight from the open window. The bed is wide and white. Beside him, a girl is perched on a chair, regarding him with solemn green eyes. She looks somewhat familiar to him, but he isn’t sure why.\n“Finally?” Jaskier repeats, his voice croaking.\n“Here.” She turns to the table next to the bed, and fills a cup from a pitcher before handing it to him. She continues to watch silently as he takes three large gulps, draining the cup.\n“Where am I?”\nThe girl shrugs. “Yennefer brought us here. You needed time to rest.”\nAt the mention of Yennefer, Jaskier remembers—the window, the cool hand on his forehead. Geralt’s eyes blazing at him from across the room.\n“Ah,” Jaskier says faintly. After a moment, he hitches himself up onto his elbows, looks around the room again. The kind of furnishings befitting nobility. It has Yennefer all over it. He runs a hand over his chest, his shoulders, checking he’s all still there. He might need a few good meals, now, but all feels in order. It’s only when he touches his jaw, feels the smoothness of it, that it really sinks in—the curse is gone. It wouldn’t have let him stay still long enough to be shaved, before.\nThe girl stands up from her chair, leans over to refill his cup again. He watches as she does so, bemused.\n“I’m afraid I don’t have your acquaintance,” he says, raising the cup to his lips.\n“You can call me Ciri,” she says, and then pauses, as if to give him time to figure it out. The green eyes, the blonde hair—Pavetta’s face, he realizes, and promptly chokes on the water, sputtering it back into the glass.\n“You’re the princess,” he coughs out, and Ciri gives him the ghost of a smile.\n“And you’re Geralt’s bard,” she says.\n“Oh, well,” Jaskier says. “I’m not Geralt’s anything, really.”\nCiri doesn’t reply, but cocks her head a little. Jaskier fiddles his fingers over the blanket, creasing it and smoothing it back over. “Is he here then? Geralt?” Even though he already knows the answer.\nCiri nods. “He’ll be back again soon.”\nJaskier moves to sit up further, and winces. He feels sore all over: his legs, his arms. He notices, on the hand holding his cup, healing cuts, ragged nails, red circles around his wrists where the chains were. The right side of his face gives a tender throb—probably the place where the guard had hit him when dragging him upstairs at the keep.\n“Yennefer said you nearly walked yourself to death,” Ciri says, her eyes round with the gravity of her words.\n“Well, maybe,” Jaskier says. “It’s hard to say for sure.”\n“She said you walked the skin off your feet. That you were horrible to look at, like a living corpse.”\n“Well,” Jaskier says again, faintly. “The sheets aren’t a pool of blood, so I’m assuming she put all that right.”\n“Yennefer said all that’s left now is for you to rest and feel better,” Ciri says primly.\n“And do you?” A new, familiar voice rumbles. “Feel better?”\nGeralt had entered the room on silent feet. His hair looks freshly washed, neatly tied back, and he’s wearing a loose black linen shirt. Despite the water, Jaskier’s mouth seems to instantly go dry at the sight of him.\n“I’m sure I’m on the mend,” he says. Geralt’s eyes are looking at the bed—more specifically, his hand on the bed, worrying the blanket between his fingers again. He quickly stops.\n“Ciri,” Geralt says, still looking at Jaskier’s hand. “We have some things we need to talk about.”\nIt becomes clear that the we Geralt speaks of is himself and Jaskier as Ciri gives him another small smile and stands from her chair. A moment later, the door closes behind her. Geralt stays standing there, at the threshold.\nJaskier has never felt awkward in Geralt’s presence before, always happy to fill in the silences. This feels different, the quiet unbroken. Finally, he blurts, “You found her, then. Your Child Surprise.”\n“Yes,” Geralt says. He takes a step further into the room.\n“Good, good,” Jaskier says. “I’m glad.”\nThere is a muscle moving in Geralt’s jaw. Finally, he speaks. “It was me, Jaskier.”\n“What was? The curse?” Jaskier asks. “Yes, I figured as much.”\n“It was what I said, that day on the mountain,” Geralt says. And then, like the words are being unwillingly dragged from him, “If life could give me one blessing, it would be to take you off my hands.”\n“Yes,” Jaskier says, with an edge to his voice. “I remember that just fine.”\n“The djinn,” Geralt says, with his characteristic scarcity of words. “When I said those words, I didn’t realize—the djinn. Took it as a wish. Made the words into—” He makes an aborted hand gesture, glares murder at the bedspread. “A curse.”\nJaskier thinks back, as much as he doesn’t want to, to that day on the mountain. Remembers Geralt spitting those words at him, and not long afterward, the uncontestable desire to get away, as quickly as possible. Heartbreak had masked its very origin, until now. The whole time, this whole mess, was never Yennefer, but the djinn, taking Jaskier off Geralt’s hands whenever such a chance presented itself, forcing distance between them.\n“Over the last few months, there were a few times we had near misses,” Geralt goes on grudgingly. “That I would come to a place just as you left it. I didn’t think anything of it. But then there was a bounty on your head, Nilfgaardians wanting to find you to find me.”\nJaskier looks up. “Why?”\n“Because of Ciri. They knew I had her,” Geralt replies. “I knew I had to find you first, and I couldn’t.”\n“That must have been… exasperating,” Jaskier says.\n“I can normally track down what I’m looking for very easily,” Geralt agrees.\nJaskier thinks. “So… outside of Sodden—”\n“I had tracked you to there,” Geralt says. “But the villagers wouldn’t let me through, so I had to double back around the cliffs.”\n“And you heard my song?”\n“Yes,” Geralt says. “At a traveler’s rest. But you were too close to Nilfgaard by then for me to stop.”\nJaskier closes his eyes. “And all the days after?”\n“Chased you across every cliff, forest, and river in all of Sodden,” Geralt says, sounding exhausted. “Even with your song, I had no idea what it was doing to you, to keep you ahead of me.”\nIt seems like years ago, remembering the terrible vise-feeling, the stumbling and crawling, the dry heaves, or how his eyes rolled back in his head, taking him to something like sleep, as his body horribly shambled on.\n“And you found me at the keep,” Jaskier says. It is easier to talk to Geralt with his eyes still closed, without seeing his beautiful, remote face.\n“By then I’d left Ciri with Yennefer,” Geralt says. “When I realized where you were, I was able to contact her to come help me. Without her, you would have—”\nJaskier, clinging to the window frame with nothing but his fingernails and his stubbornness. The steep drop below.\n“Jaskier,” Geralt says roughly. “I nearly killed you.”\nJaskier finally opens his eyes. “Oh, everyone deserves at least one crack at it,” he says. His eyes skirt across Geralt. “The only real loss here was my doublet. Cost me two months of work—real Redanian purple silkworms, if you believe it. And—and my lute,” he continues bravely. “Beautiful, sexy girl that she was. If there was ever a tragedy—some one-toothed hermit’s firewood as we speak.”\n“Hmm,” Geralt says. He steps further into the room, leans down, and grabs something from beneath Jaskier’s bed. To his astonishment—it’s his lute case. He quickly opens it, his hands fervent over the familiar wood.\n“But—she’s fine,” he says. “She’s perfect. How?”\n“I was tracking you, Jaskier,” Geralt says. Of course he’s imagining it—the fondness in Geralt’s voice? “I went right through your abandoned campsite. I wouldn’t just leave your lute behind.”\nJaskier brushes a thumb over the strings, a light burst of sound. Geralt is standing so close now, right against the bed, but after all these months apart it feels too overwhelming, to meet that gold gaze head-on, so he doesn’t.\n“Of course not,” Jaskier agrees, still looking at his lute.\nHe senses that Geralt’s about to say something else, but there’s a light tap on the door, a formality he wouldn’t have expected from Yennefer, who is the kind of witch—sorceress, he reminds himself— who normally would stride right in. Surprisingly, the sight of her doesn’t bring up the usual mix of animosity, jealousy. She gracefully sinks into the chair Ciri left, arranging her gray dress across her knees.\n“Well, bard,” she says. “You certainly led us on a merry chase.”\n“I live to surprise,” he says.\n“And I am surprised you lived,” she answers, a smile quirking her lips.\n“All the thanks to you,” he says, and one of her eyebrows ascends her forehead in disbelief.\n“Are you hearing this, Geralt?” she asks.\n“I’m hearing it,” he replies.\n“And to what do I owe you?” Jaskier asks. “Servitude? My undying devotion?”\n“I believe the latter is already directed elsewhere,” she says. “And I have enough of the first. No, bard, nothing is owed.” She sits back in her chair. “Only an end to the business of you and djinns.”\n“Oh, to that I can emphatically agree.”\n“This interlude aside,” Yennefer says, waving her hand dismissively, “our plan was to winter in Kaer Morhen. Nilfgaard still has a price on your head…” she trails off delicately.\nJaskier understands the unsaid offer. To travel with Geralt and Yennefer and Ciri to a place where he would be protected. But haven’t the past few months been punishment enough? Having to see Geralt and Yennefer together would wear away any good feeling to the situation. No, he would have to be far away from that whole heartbreak in order to ever get over it—and no djinn has to force him there.\n“I received a letter from Oxenfurt, months ago,” Jaskier says. “If not for this, it’s where I would have been, anyways.”\nHe feels, rather than sees, Geralt stiffen next to the bed.\n“And your safety?” Yennefer asks.\n“I have plenty of acquaintances there,” Jaskier says. “And places to go aground if I need to. Really, I think it would be—best for everyone.”\nGeralt lets out a long, slow breath, like he’s centering himself, or trying to.\nYennefer pauses, then says, “We can accompany you as far as there.”\n“Oh, you don’t have to—” Jaskier says, at the same time Geralt grits out, “If that’s what Jaskier wants—”\n“It’s for your own wellbeing,” Yennefer says. Her eyes are on Geralt as she says it, a strangely quelling look. “So it’s settled.”\n~\nTraveling with Geralt again is odd. Aside from Geralt and Roach—who gave him a not-so-gentle shove on the shoulder with her nose when they were reunited—there are now Ciri and Yennefer and their horses, too. Jaskier gets a horse as well, which he is grateful for—his feet still feel too tender to walk far.\nThe arrangement has Geralt leading the procession of horses, then Ciri and Jaskier in the middle—the two soft humans needing protection—and the rear brought up by Yennefer. Jaskier is able to sing a little as they go, and entertain Ciri with scraps of stories. Sometimes Yennefer will laugh—not always unpleasantly, or at him, although the time he was too engrossed in telling a story to see the branch coming at him at nose-height was definitely both—and give some edifying remark meant for Ciri. Geralt says nothing.\nGeralt says nothing when they stop to eat, or rest the horses, or make camp for the night: three tents that Yennefer magics out of the air. Ciri and Geralt share one, as opposed to Yennefer and Geralt, but Jaskier can only assume they are keeping pretenses where they can. They are out in the wilderness, and Ciri is a child, and they will have time to share close quarters again once they’re in Kaer Morhen. They are, at least, less maddeningly heartsick for each other. In fact, if Geralt’s staring intensely at anyone during this journey, it’s as Jaskier, not that Jaskier can figure out why.\nOr—Jaskier does know, but he doesn’t want to think about it too much. He remembers in their last conversation that Geralt had mentioned being aware he’d several times been in places that Jaskier had recently vacated. Geralt had known they’d been in proximity and had never tried to close that distance, to willingly seek him out. He’d never tried to find Jaskier then, was happy to keep from seeing him until it became a necessity to do so. It can only mean that Geralt still bristles at the fact of Jaskier’s company—hadn’t wanted it then or now. But it was Yennefer who forced them together this time, Jaskier defends himself, if only in his own thoughts. It hadn’t been his idea at all. He’s been set perfectly straight on the matter.\nIt goes on like this for days. The only time Geralt is not silent is when he says something in a low voice to Ciri, who he seems to slightly soften around. Once, looking for firewood, Jaskier stumbles across Yennefer and Geralt in some kind of lovers’ quarrel—they must be trying to be out of earshot of Ciri—but as soon as they see him, Yennefer throws her hands up and walks away. Jaskier gets the sense his presence is only making things worse, more stifling. It will probably be better when they leave him at Oxenfurt. It will be better for him, too—it already hurts enough, seeing how well-matched they are when they stand so close together. He is already missing Geralt, and Geralt isn’t even gone—he’s in his heady presence for the first time in months.\nBut Geralt has said all he’s needed to say to Jaskier, and that’s that. So Jaskier steers a wide circle around him, converses with Ciri when he can, and sleeps hugging his lute, grateful that Geralt, if nothing else, saved it for him.\nOn the rainy day they cross the border into Redania, Yennefer calls up to Geralt, leading the way: “Tonight, Geralt, I want an inn.”\nGeralt doesn’t show by any outward sign that he’s heard, but several hours later they are stabling their horses in a perfectly adequate town. Jaskier, in his enthusiasm to get out of the drizzle, leads the group of them to the inn, where the innkeeper is standing in the doorway.\n“Hello, there,” he calls. “Does your fine establishment have any--?”\nThe man gasps at the sight of Geralt, presumably scowling from under his cloak, and slams the door shut in their face. Yennefer must send a pulse of magic, because it promptly springs open again, hinges rattling.\n“—Rooms available?” Jaskier continues brightly, as if nothing had happened. “We’ll need three.”\n“Two,” Geralt growls, from behind him.\nJaskier gives him a look of confusion. “But—”\n“Two,” Geralt repeats menacingly, and the innkeeper hands the keys over with shaking hands as Yennefer exchanges the money.\nBut of course the past days have probably upset their usual arrangement. Jaskier presumes the both of them wanted the inn, if only for a way to more discretely scratch the itch while on the road. No wonder Geralt’s been in such a mood. Jaskier’s used to being left behind by them, though. At least he has Ciri now, and the knowledge he can get away from this nightmare in a few more days.\nJaskier walks up the stairs next to Ciri, who is wringing her hair dry with one hand, and is so sure that he’s sharing a room with her that he’s in the act of following her in when Yennefer holds up a hand.\n“You’re with Geralt,” she says simply. And then closes the door in his face.\nJaskier and Geralt have shared plenty of rooms in their travels in the past, plenty of beds. This should be nothing out of the ordinary. He follows Geralt into the room and slings his pack down on the bed, sets his lute case on the chair. Steels himself. When he turns around, Geralt is leaning against the door, staring at him.\n“Love the way you just—” Jaskier flexes his wrist, tries to affect unconcern—\"Stand there at the threshold and brood.”\n“I want to do it again,” Geralt says. “I must have done it wrong.”\n“Do what, again?”\n“Apologize,” Geralt grunts, like the word has an unpleasant taste to it. It probably does—he’d probably rather fight three consecutive selkiemores.\n“Apologize?” Jaskier repeats.\n“Yes.”\n“And what do you mean, again?” Jaskier cries, his voice higher.\n“So, fine then, I didn’t do it right,” Geralt says. “Because you’re not coming with me. And normally I wouldn’t have to ask.”\n“Of course I’m not coming with you,” Jaskier says, aghast. “Why would you want me to?”\nGeralt stares at him, as if equally uncomprehending. “I didn’t mean any of those things I said on the mountain,” he finally says. “I was angry. I didn’t mean—”\n“The djinn, yes, I know,” Jaskier says. “The words themselves felt like you did mean them, though. Very much.”\nGeralt lifts a shoulder and drops it. “I’ve said a lot of things I didn’t mean. It never kept you from staying with me before.”\n“Again,” Jaskier says, blowing out a breath, “is this an apology?”\n“You’re not the reason for my problems, Jaskier,” Geralt says. “And it would not be a blessing to have you gone.”\n“And you’re…?”\n“Sorry,” Geralt says in a low voice. “I am sorry.”\n“I can see this whole scenario is foreign and uncomfortable to you, so we can wrap it up,” Jaskier says. “Apology accepted. Now come away from the door, please. You’re reminding me of a prison warden.”\nGeralt uncrosses his arms and steps closer. “So you’ll come to Kaer Morhen with us?”\n“Ah, well. The answer to that—I’m afraid—is still no.”\nJaskier turns away, trying to seem busy with unearthing his smallclothes from his pack, but Geralt is there at his shoulder, all but breathing down his neck. He turns back around.\n“Jaskier.”\n“Yes?”\n“Jaskier.”\n“I presume you would like to know why. Well—the answer is simple. I don’t play second fiddle as well as I play the lute.”\n“Second fid—” Geralt says, and then his scowl morphs into something else. “You don’t mean Yennefer?”\n“What do you mean, you don’t mean Yennefer?” Jaskier says, doing a passable imitation of Geralt’s rougher voice. “It is quite the cozy little family you’ve built with her, Geralt. I will wish you all well from afar.”\n“There’s nothing there with Yennefer.”\n“Oh ho ho ho, here we go—”\n“Jaskier, there’s not. We both wanted it that way. The djinn, and her—it wasn’t real. I trust her, and need her help with Ciri. But I’m not in love with her.”\n“All right, well,” Jaskier says. There are several loud thoughts banging around in his head at this revelation, but he chooses to ignore them. “Good to know.”\nGeralt is looking closely at him. Jaskier wonders if he’s doing that thing—sensing him, scenting him. He certainly seems like he’s concentrating.\n“With you, things always moved—slower,” Geralt says, hesitating over the words.\n“Yes, whole empires have risen and fallen,” Jaskier says blithely. Geralt’s words register. “Wait—with me?”\n“You know that I do want you around for more than…” Geralt says, which answers nothing. He looks at Jaskier helplessly. “You know that I’ve… felt the same way.”\n“I didn’t—know,” Jaskier says.\n“The djinn brought Yennefer to me. And the djinn pushed you away. And none of it was what I really wanted,” Geralt says, still speaking slowly. His hair is still faintly damp with rainwater. His head is slightly cocked to the side, to meet Jaskier’s gaze, an almost entreating look. It feels like too much.\n“You didn’t try to find me after,” Jaskier says. “All those times you could have tried to see me, to apologize, and you didn’t.”\n“I was giving you space afterward. I thought it would sort itself out, that I wouldn’t have to—\" Geralt winces—”Apologize.”\n“Such care for my heart!” Jaskier says, because it is easier to stray into overdramatics. “Just leaving me to nurse my heartbreak on my own.”\n“Was it that bad for you?” Geralt’s asking about the mountain, but there’s something in Geralt’s tone that leaves the you, too implied. He’s asking about everything since, those months apart. Days and days and days of chasing him across the country. Sleepless nights. Jaskier remembers Geralt standing helpless in the doorway, Jaskier poised to jump and nothing he could do to stop it. Did he really think Jaskier’s feelings could be so fickle, that he wouldn’t care for long? Well, Jaskier can jump again.\n“Well, look, if you must know what you did to it—” Jaskier says, a little worked up now, and mimes out for him exactly what Geralt did to his heart that day: stomping his foot a few times on the ground, twisting his heel into the imaginary heart for good emphasis, and then finishing it up by pretending to flip said heart onto the toe of his boot and giving it a good kick, tracing its high arc with his eyes, angling his head down and wincing exaggeratedly like he’s watching the heart go tumbling down a cliff’s face, catching every crevice and sharp point on the way—\n“There,” Jaskier says, breathing a little heavily, turning to look back at Geralt. “I think that’s a pretty good demonstration of the course of ev—”\nHe stops talking. It’s not because anything has forced him to—no djinn tumor on his throat, no hand over his mouth. But he turns back to Geralt and Geralt—yes, he has a quirk to his lips, he’s smiling, the bastard, he’s really smiling at Jaskier, fondly, like he finds him amusing, and before Jaskier can think of anything to say, Geralt crosses the distance between them and pushes the fringe of Jaskier’s hair back, lips meeting Jaskier’s forehead. He stands there for a moment, arm hard around Jaskier’s shoulders, and then he leans back, kissing Jaskier’s eyes, his nose, his mouth.\n“Oh,” Jaskier says. “Oh.”\nGeralt’s free hand comes up to Jaskier’s jaw, turning Jaskier’s face further into his kiss.\n“I—” Jaskier says.\n“Hmm,” Geralt says, kissing down his throat.\n“I’ve wanted this since—”\n“Be quiet, Jaskier,” Geralt says, his voice deep, but he soothes away the command by licking a stripe across his collarbone.\nHis pack is swiped to the floor. Geralt backs Jaskier onto the bed, his hands heavy and urgent on Jaskier’s body. His shoulders are broad beneath Jaskier’s palms, his teeth teasing sharp against Jaskier’s lips. It is overwhelming in all the best of ways.\nGeralt plants a knee between Jaskier’s thighs, sits up to drag his shirt up over his head. Jaskier’s hands go to the revealed skin, the thick bulk of his muscle, his fingers clenching into the meat of his back as Geralt lowers his head to the crook of Jaskier’s neck and sucks.\n“I want to have you,” Geralt says, which is happily just what Jaskier wants, too. Some delirious time later, after Geralt’s stripped his clothing from him, and picked him up like he’s nothing, palmed his hips to turn him where he’d like, Jaskier finds himself sitting naked between Geralt’s powerful thighs, his back against Geralt’s chest. His hair is tickling Jaskier’s cheek, falling forward over Jaskier’s shoulder. Otherwise, the rest of his body is bared to his sight.\n“Hmm,” Geralt says, even lower, a rumble that Jaskier can feel through his back. Geralt’s hands rub up and down over Jaskier’s thighs, scratch at his chest hair. He catches the lobe of Jaskier’s ear in his lips as he brings a hand to Jaskier’s cock, long since hard, and pumps it over the length, slowly.\n“Fuck,” Jaskier says, throwing his head back against Geralt’s shoulder. He squirms his head there, his voice flying and breaking through at least three octaves, as Geralt continues to touch him, torturously slow, bringing him to the near edge and back again.\n“Watch,” Geralt says, tilting Jaskier’s head forward, hooking his own chin over Jaskier’s shoulder, and they both look as Jaskier’s cockhead moves in and out of Geralt’s fist, spurts wet. Jaskier’s breath shudders at the sight.\nGeralt’s other hand, slick with oil, sneaks down without Jaskier noticing, reaching further between his legs, pushing the slightest bit in, and Jaskier’s body seems to go alight at that. He’s deliciously stuck like that, played like an instrument between Geralt’s hands, pushing further into Geralt’s fist, and down again onto the breadth of his fingers. He spreads his legs as large as Geralt will let him, all of him open to Geralt for the taking. The whole time, Geralt’s chest is working like a bellows against his back, and Jaskier can tell Geralt is near the edge himself, that he can probably smell how close Jaskier is, but he holds himself back.\n“Jas…” Geralt says, and curls his fingers a certain way, and, well. Jaskier is happy, now, to let his body take control of him, jerking in Geralt’s arms as he comes hard against his stomach and chest, a blooming ache of orgasm that leaves him shivering all over. He moans as Geralt moves his hand slower over his cock, coaxing him through the last of it.\n“Geralt,” he gasps.\n“I still want to have you,” Geralt reminds him. Jaskier’s manhandled around again, Geralt’s hands ironsure against his skin, and he finds himself against the blanket, breathing hard into the coarseness of it. Geralt’s still against his back, kissing down his spine, the slightest hint of bite. Jaskier woozily regards him over his shoulder, watching as Geralt pushes his fingers, slick with Jaskier’s release, back into him. Geralt meets his eyes, and it’s there—the feralness in the golden eyes, but also the want for him, the desire. It makes Jaskier go boneless beneath him, watching as Geralt takes his cock in hand, slowly push in.\nGeralt’s big. He wraps an arm around Jaskier’s hips, tilts them up. Slowly, slowly, he takes him in inches. His free hand meanwhile move over Jaskier’s skin, grounding touches, and his face is back in Jaskier’s neck, pulling in deep breaths.\n“Is it good?” Jaskier gasps. There’s no pain for him, not with Geralt’s care in preparing him, only fullness, the leftover sweetness of orgasm. But for Geralt, he wants this. He wants him to want it again.\nGeralt doesn’t answer, at least not in so many words. His hips snap forward, and then he’s fucking in earnest, his hips pushing Jaskier up the bed. Jaskier has to grasp onto the headboard, gasping, pushing back against it for leverage. Geralt’s hand grips his ass, pushes him wider, and it surprises a gasp from Jaskier’s throat.\n“Gods, Geralt—I’m going to—again—” Because yes, his cock is full again, grinding against the blankets every time Geralt thrusts in, a delicious kind of agony.\n“Good,” Geralt rasps, and his thrusts grow slower, long and deep, a languorous kind of fuck. Jaskier arches his back, pushes up from the headboard. Like this, he can turn his head to kiss Geralt—which he does, sloppily, on the chin, and Geralt guides him back on the next thrust, kissing him full on the mouth. Like this, Geralt can lift his arm from his hips to sash across his chest, a firm grip that keeps their bodies close again—no distance—as Geralt goes deep and stays there, savoring the stretch. There are no words left for Jaskier to describe the pleasure in this, so he doesn’t try, just moans every time Geralt grinds slow against that place inside him just right.\n“Jaskier,” Geralt says, on a great exhale, and then he pulls his hips back flush against him and comes, pressed deep, circling his hips, and Jaskier drops a hand to his cock and finishes himself off in two jerks, crying out. He pants, exhausted, as Geralt sill comes, slowly grinding the last of it into him. Geralt sighs against the knob of his back.\nThey fall forward onto the bed, Geralt’s sweat-slick chest pressing him deeper. He’s still inside Jaskier, which makes Jaskier wonder about witchers and how much time they need between, and he’s also realizing that Geralt’s grip on him is still strong, just this side of bruising. Even as he realizes it, Geralt’s grip lets up, turns soft. He slips out, making Jaskier groan, and once again manhandles Jaskier—this time onto his side, so he can see his face.\n“Mister witcher,” Jaskier says, turned a little loopy, and points down. “Put that thing back where you found it.”\n“Later, Jaskier,” Geralt says. His hair is mussed, and he’s smiling again, enough to show the edge of his teeth. Jaskier smirks back.\n“I’ll want to have you again,” Geralt says, blunt. “Many times.”\n“Maybe I’ll want to have you a few times, too,” Jaskier says, his voice slurring a bit.\n“Hmm,” Geralt says, brushing his knuckles down Jaskier’s side—his ribs, the curve of his hips. “Come to Kaer Morhen, then.”\nJaskier knows how much Geralt leaves unsaid. He knows what Geralt really means, saying that.\n“I will,” Jaskier says, and falls asleep to Geralt’s lips on his forehead again, like a blessing.\n~\nBreakfast the next morning, while Geralt is out in the stables, Yennefer comes to sit by him at the long table where he’s eating.\n“Seems everything has been sorted out between you two, then,” she says briskly.\n“Oh?” Jaskier says, and only turning red a little.\n“Yes,” Yennefer says. “And thank the gods for it. More fodder for your songs, I assume? The white wolf and his--?”\nCiri sits down then, and Yennefer breaks off.\n“Not everything has to become a song,” Jaskier says, breaking off a hunk of bread for Ciri, slathering it with butter.\n“Really? Nothing from these past few weeks?”\n“A curse would make a good song,” Ciri says. “The djinn, and the Nilfgaardians, and Geralt coming to save you. All of it.”\n“Yes,” Yennefer says, turning to look at Jaskier, her purple eyes intense. “A curse broken by true love is definitely the stuff of songs.”\n“It wasn’t—” Jaskier begins, and stops. He remembers how he was able to fight the curse with the last of his strength, how, upon seeing Geralt, he was able to hold it off long enough for Yennefer to come. But it couldn’t just be chalked up to true love. He returns her gaze, levelly. It was also broken by compassion, mercy. Goodness where he’d expected none. It was Yennefer, too. “Technically, it wasn’t a curse, anyways,” he says. “it was a wish.”\n“Well, maybe you should,” Yennefer says. “Write a song about it. Your songs have done wonders for Geralt’s reputation, but I can’t say much for mine. What’s it called? ‘Her Sweet Kiss?’”\n“Oh, I love that one,” Ciri breaks in.\n“First of all, you’re inferring,” Jaskier says brightly. “And, dear Yennefer, if you’re asking for a nice song about you, you only had to ask.” Yennefer rolls her eyes, but she smiles as she turns to her breakfast.\nAfter they eat, they go out into the yard, where Geralt already has the horses saddled and ready. Geralt holds the horse’s reins steady as Jaskier swings up, only a little gingerly, and seats himself.\n“We’ll want to take the Merchant’s Road to Novigrad—” Yennefer is saying.\n“Change of plans,” Geralt breaks in. He is looking up into Jaskier’s face, and Jaskier is wondering how he’d ever thought the face was expressionless, remote. He’s looking harder, now, and sees all he needs to. “We’ll not be going to Oxenfurt, after all.”\nCiri is the only one who seems surprised by this, clapping her hands in eagerness.\n“It’ll be nice to have you there, too,” she says. “We can have songs on those dreadfully cold nights, dances, even.”\nGeralt shakes his head, leaps onto Roach. “We’ll see,” he says.\n“That’s a no,” Jaskier whispers to Ciri.\n“It was a we’ll see,” Geralt says, more loudly.\nThat night, as they wait for a rabbit to roast, Jaskier plays a few bits on his lute, slowly retuning it. His fingers move easily over the strings.\n“Hey, here’s a bit of a new one,” Jaskier says. “Tell me what you think.” He strikes the opening chords.\n\nAnd though the road is long and the way is hard/even destiny could not separate a wolf and his—\n\nJaskier does not know what will happen after Kaer Morhen. He doesn’t know what will happen with Nilfgaard, the bounty on his head, Ciri’s future—all of their likely futures. Jaskier is only human. He does not know a lot.\nCiri claps a hand over her mouth, giggling, and Yennefer groans and leans back on her elbows.\n“There’s a word,” Jaskier says, winking at Ciri. “A perfect word, on the tip of my tongue, if only I knew it—”\nGeralt is sitting silent close by him, poking the fire, his brow furrowed. Jaskier waits, gives him the time to work it out, figure out the missing word. Geralt doesn’t know it yet, but then—Jaskier sees the corner of his mouth soften, turns up—like magic, he does."
}