{
    "id": "24280306",
    "url": "https://archiveofourown.org/works/24280306?view_full_work=true",
    "author": [
        "Annacharlier"
    ],
    "title": "Don't Go",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/F"
    ],
    "fandoms": [
        "She-Ra and the Princesses of Power (2018)"
    ],
    "relationships": [
        "Adora/Catra (She-Ra)",
        "Bow/Glimmer (She-Ra)"
    ],
    "characters": [
        "Adora (She-Ra)",
        "Catra (She-Ra)",
        "Glimmer (She-Ra)",
        "Bow (She-Ra)",
        "Entrapta (She-Ra)",
        "Horde Prime (She-Ra)"
    ],
    "additional_tags": [
        "Hurt/Comfort",
        "Missing Scene",
        "Post-episode: S05Ep05 Save the Cat",
        "Emotional Hurt/Comfort"
    ],
    "language": "English",
    "series": "",
    "published": "2020-05-20",
    "completed": null,
    "words": "5,414",
    "chapters": "1/1",
    "comments": "1,368",
    "kudos": "43,225",
    "bookmarks": "7,743",
    "hits": "600,464",
    "summary": "<p>They stay that way for a long time, Catra’s face tucked into Adora’s shoulder, Adora gently cradling Catra’s head. Adora is careful not to hug Catra too hard or make her feel restrained, anticipating the moment that Catra will start to pull away — but Catra doesn’t. She hangs on so tightly it hurts, her claws digging through Adora’s jacket and into her back, latching into her like she did when she was a kitten and didn’t know how much her claws could hurt. Adora tries not to wince, tries not to move a single muscle, worried that if she does the spell will break and Catra will struggle away, appalled at having shown weakness.</p>\n<p>But Catra doesn’t let go. And so neither does Adora.</p>",
    "notes": "",
    "text": "They stay that way for a long time, Catra’s face tucked into Adora’s shoulder, Adora gently cradling Catra’s head. Adora is careful not to hug Catra too hard or make her feel restrained, anticipating the moment that Catra will start to pull away — but Catra doesn’t. She hangs on so tightly it hurts, her claws digging through Adora’s jacket and into her back, latching into her like she did when she was a kitten and didn’t know how much her claws could hurt. Adora tries not to wince, tries not to move a single muscle, worried that if she does the spell will break and Catra will struggle away, appalled at having shown weakness.\n \nBut Catra doesn’t let go. And so neither does Adora.\n \nAt some point Glimmer and Bow slip away to give them their privacy — Adora is dimly aware of them moving in and out of the room, having hushed conversations with Entrapta. Finally, Bow comes over and crouches down next to Adora.\n \n“We cleared out the boxes in the brig and set up a cot,” he says, as quietly as possible. “Do you want to try moving Catra in there?”\n \nAdora flinches a little bit at him calling it the brig — she doesn’t want Catra to feel like a prisoner — but she also knows it’s more or less the same as all the other rooms on the ship, and it’s warm and dark and private. Catra will be comfortable there.\n \nIf Catra heard Bow, she doesn’t show it. Adora gives Bow a slight nod, then cautiously shifts to bring some life back into her legs that have long since fallen asleep. “Hey, Catra?” she whispers, as gently as possible. Catra doesn’t respond or move. Adora almost wonders if she’s fallen asleep, except that her grip on Adora hasn’t relaxed at all. Adora tries again. “Catra,” she breathes. “Bow and Glimmer set up a bed for you. Do you want to go there so you can rest?”\n \nFor a long moment, Catra still doesn’t respond — then finally, Adora feels her nod into the crook of her neck. “Okay,” whispers Catra, muffled by the fabric of Adora’s jacket. But she still doesn’t move, and her arms still don’t loosen. Adora gives her a moment, then decides to take charge. “I’m going to carry you, okay?” she says, running a hand gently over the back of Catra’s head in an attempt to rouse her. Catra’s only response is another faint nod into her shoulder.\n \n“Need a hand?” says Bow, but Adora shakes her head. “I’ve got her.” Carefully, she shifts Catra in her arms, slipping one arm behind Catra’s knees and the other around the small of her back. Catra still doesn’t let go. Her head stays buried in Adora’s shoulder, like it’s the last safe place in the world.\n \nAdora lifts Catra as gently as she can, wobbling a bit on her numb legs as she stands. It’s more difficult than she anticipated — her limbs are weakened by the deep, burning ache that she’s come to understand as a side effect of She-Ra’s healing powers. Her skin is always whole again, her wounds gone without a trace, when she shifts back after even the hardest-won battles — but she can always still feel a dull ghost of them weighing on her bones. Sometimes, she thinks it would be easier if they would stay.\n \nBow hovers nearby, ready to help if needed, but Adora gets her footing and stubbornly grips Catra to her chest as she staggers past him.\n \nThe brig is dark, but faintly lit by the soft glow of the First Ones’ tech that studs the wall. It’s the smallest room on the ship, but Adora thinks that’s a good thing — it feels cozy, safe. She lowers Catra onto the cot, her muscles screaming, waving Bow away once she’s made it. He backs respectfully out of the room and shuts the door.\n \n“We’re here,” Adora murmurs to Catra, and only then does Catra start to hesitantly unfold, extricating herself from Adora’s arms. Adora winces as her claws slide free from her back. Catra looks around the dim room, blinking as if it’s too bright. Her eyes are unfocused, confused. Her movements are sluggish. Adora feels a pang of sympathy — if her body is sore, Catra must be feeling it ten times more after the beating she took. The memory of Catra’s broken body lying still on the cold floor of Prime’s ship flashes back into her mind, and she swallows the lump in her throat.\n \nCatra hasn’t been in her life for a long time, but she hadn’t known how unbearable it would be to lose her for good until that moment.\n \nThen Catra’s nails sink into the mattress, and her whole body goes rigid. She looks up at Adora, her pupils shrinking to pinpricks, her fur bristling, and Adora recognizes the first signs of panic.\n \n“Catra, it’s okay,” Adora instinctively tries to soothe her, reaching out a comforting hand.\n \nCatra’s face crumples and she recoils away from Adora as if she’s seen a ghost. “No.” It comes out like a sob — there’s no anger in her voice, just fear and despair. Catra tries to get up off the bed but her legs are too weak to support her, dumping her unkindly to the ground.\n \n“Catra!” Adora yelps, reaching again to help her, but Catra scrambles backwards, wedging herself against the wall like a cornered animal, breathing hard. Her tail is bushy. Adora hasn’t seen her like that since they were small children, before Catra learned to hide her vulnerability behind a mask of indifference.\n \n“Get out of my head,” Catra whimpers. “Just leave me alone. Don’t you have enough already?”\n \nIt takes Adora a moment to understand.\n \nThen she gets it, and her blood turns to ice.\n \nCatra curls up into a ball and sobs, her claws tearing at her head as if the pain will wake her up, as if she can rip the ghost of Horde Prime out of her mind. Adora launches forward, grabbing Catra’s wrists and wrestling them away from her head. “Catra, no, this is real. It’s okay, you’re safe now, I’m here —“\n \nCatra thrashes, slashing blindly at her, howling. “Just get it over with,” she wails. “Please. I told you, she’s not coming back, just let me go. Please.”\n \nAdora has never heard Catra plead like that. She resolves in that moment that she’s going to kill Horde Prime with her own hands, and she’s going to enjoy it.\n \nAdora throws herself bodily on top of Catra, tackling her to floor. She gets her flailing hands pinned, but not before taking a claw to the face. Catra squeezes her eyes shut, turning her face desperately away, her chest still heaving with sobs.\n \n“Catra.” Adora speaks as firmly as she can. “Catra. Stop. This isn’t a Horde Prime mind trick. I’m really here. And you’re being a major pain in my ass right now.”\n \nCatra opens her eyes, looking up at Adora’s face in confusion. Adora cracks a weak grin. “I came back for you, dumbass. I saved you. And you can bet I’m never going to let you live it down.”\n \nCatra hesitates. Then she shakes her head slowly, eyes unfocused with tears. “She wouldn’t come back for me.”\n \n“Well, tough luck, because I did. So can you please stop with the scratching and just lie down on the stupid bed and rest?” Catra isn’t fighting her anymore, but there’s still distrust in her eyes. Adora tries another tact. “Also, can I just say that Horde Prime is a major loser? I thought he’d be like, a scarier Hordak, but at least Hordak knew when to shut up.”\n \nCatra actually laughs, the same strained chuckle from when she was tottering on the edge of the platform, fighting with everything she had against Prime’s control. Her body has gone limp underneath Adora. Adora carefully lets Catra’s hands go and flops down beside her. “Would fake Adora say that?” she says smugly. She wants to hold Catra and comfort her, but she figures that gentle touches aren’t what Catra needs right now. They would remind her too much of Prime’s possessive gestures.\n \nCatra lies still for a long time, the only sound her ragged breathing. Then, finally, she rolls her head to the side, scanning Adora’s face incredulously. “It’s really you,” she whispers hoarsely. “You came back for me.”\n \n“Yeah,” Adora responds simply.\n \nAdora helps her sit up. Catra’s muscles are still tense, but her fur has smoothed — her eyes scan the room as if searching for any inconsistencies that would give away the illusion. She looks down at her own body. Then her hand goes to the back of her neck — her ears flatten as she feels the chip still clamped onto her spine. Her claws scrabble at her skin, her clothes, tearing into herself, drawing blood — it all happens so fast Adora barely has time to react.\n \n“Catra, stop! Stop it!” Once again, Adora has to wrestle Catra’s claws away, but she’s already managed to open a few slashes in her own flesh, the red blooming across the snowy white of her uniform. Adora keeps Catra’s wrists in a tight grip as she struggles. “Let go,” hisses Catra, straining against her, but Adora doesn’t relent.\n \n“Look at me,” Adora commands. She waits for a long moment until Catra finally does. “I’ll let you go, but you have to promise you won’t hurt yourself again. Catra, promise.”\n \nShe figures that will get through to her, and it does. After a moment, Catra retracts her claws and nods. She tugs weakly against Adora’s hands, but Adora doesn’t let go just yet.\n \n“Take it off,” Catra pleads quietly, and Adora understands.\n \nShe lets go of Catra’s hands, which curl into fists against the floor, and moves around to Catra’s back. She runs her hands over the white uniform covering Catra’s back, searching for some kind of zipper or closure, but it all seems to be made in one seamless piece of smooth, glossy fabric. Of course Prime wouldn’t make it easy to remove. Catra feels Adora fumbling around, and the hackles on her neck rise as she suddenly shouts. “Take it off! Adora, please, take it off!”\n \nAdora can’t bear the desperation in her voice. Without hesitation, she grips the edges of the uniform and pulls as hard as she can. The fabric is stiff and heavy, but clearly not designed with the protection of the wearer in mind, and it comes apart in Adora’s hands surprisingly easily — or maybe it’s another burst of She-Ra’s strength. Adora rips the uniform all the way down, exposing Catra’s shivering back, then helps her struggle out of it.\n \nFree of the uniform, Catra finally seems to relax. Her muscles go slack as she leans back against Adora’s chest, breathing steadily now. She looks so small, Adora thinks. In her mind, Catra has been so big for so long — a looming shadow of rage and spite and darkness, its shape so unfamiliar to her.\n \nBut this shape — Catra’s narrow, curled up form — this shape she knows better than anything.\n \nAnd then with a shock, Adora realizes that she’s staring at Catra’s naked body, and that she probably shouldn’t be doing that. She looks away, grabbing the shredded uniform and crushing it up into a ball.\n \n“I’m going to throw this out the airlock,” she announces, and she feels the slightest rumble of Catra’s chuckle in response. Adora carefully extricates herself from Catra and stands up, still averting her eyes. “I’ve got some extra clothes, I’ll bring them to you. Do you need water? I’ll bring water too.” With that, Adora rushes out.\n \nShe practically sprints through the ship — she doesn’t want to leave Catra alone for more than a moment. She bursts into the bigger bunkroom where they’ve all been sleeping, and catches Bow and Glimmer cuddling on Bow’s bed. Glimmer’s head snaps straight up from where it had been nestled on Bow’s shoulder, blushing furiously.\n \nAdora doesn’t have time to get into whatever that is. She gives them a quick, knowing smirk, then raids her bag of clothes, pulling out a clean gray top and matching shorts. They look just like the standard-issue ones she had once worn in the Horde; she had the Bright Moon tailors make them to her specifications. The familiarity had brought her comfort, and she figures they will for Catra too.\n \n“Everything okay?” asks Bow.\n \n“Fine,” Adora responds. “Hey, this ship has an incinerator, right?”\n \n“Yeah, it’s right outside the cargo hold. What —“\n \nBut Adora’s already off. As she rushes out of the bunkroom, she feels something soft hit her head, and realizes Glimmer has thrown a blanket at her. “Take this too,” Glimmer shouts after her.\n \nAdora finds the incinerator, a small square door in the hallway intended for garbage, and shoves the Horde uniform inside. She closes the door, imagining the white fabric going up in flames, burning away to a crisp, and with it every trace of Prime’s cruel, lingering touch. When she’s satisfied that the garment is definitely destroyed, Adora sprints back to Catra’s room, stopping only briefly in the galley to grab a bottle of water.\n \nWhen she steps back into the brig, she finds Catra on the bed, curled up into tight ball. The brig is right next to the engine room and so it’s one of the warmest places on the ship, but Catra is shivering. Her head shoots up at the sound of the door, eyes wide with terror.\n \n“It’s okay, it’s me,” Adora soothes. She crosses to the bed and lays the clothes out next to Catra. Seeing her eye the bottle of water, Adora hands it to her, then waits as Catra drinks greedily. She resists the urge to try and help her as Catra slips on the clothes with clumsy, shaking fingers. The last thing Catra needs right now is for Adora to act possessive.\n \n“How are you feeling?” Adora ventures.\n \nCatra sighs, laying her head back down on the mattress. “Like shit.”\n \nAdora nods in sympathy. “I know. I’m sorry. Magic or not, the healing process sucks. You should try to sleep, it’s really the only thing that helps.”\n \n“I don’t suppose you have some other magical power that would keep me from dreaming,” grumbles Catra.\n \nShe’s still shivering, but she looks calmer than she has since she woke up. The scratches she left on herself aren’t deep and have stopped bleeding, so they’ll probably be fine without treatment. Adora gently draws the blanket over her and starts to stand up, intending to give Catra some privacy so she can sleep. But Catra’s hand closes on Adora’s wrist before she can pull it back, hanging on tight. Her eyes meet Adora’s. Where before they were dim and unfocused, now they are clear and piercing. She holds Adora’s gaze unrelentingly.\n \n“Why did you come back for me?” she demands.\n \n“I —“ Adora’s voice trails off in the silence. Catra doesn’t let go. The only sound is the soft, muffled humming of the ship’s engines as it moves through space, away from Horde Prime. “Because…” She trails off again.\n \nWhat is she supposed to say?\n \n“Because…you’re Catra,” she finishes weakly.\n \nCatra flinches. Her hand slips from Adora’s and she rolls away, so small under the blanket that she almost disappears. Adora listens to the ship’s beating heart in the silence, not sure what else to say.\n \n“You should sleep,” says Adora, once it’s become clear that Catra isn’t going to answer.\n \nCatra doesn’t respond. Doesn’t even move. “I won’t be far,” Adora adds. “If you need anything, just call for me.”\n \nStill nothing. Adora’s heart is pounding. She doesn’t want to leave Catra alone. She doesn’t want to let her out of her sight ever again. She wants to lie down on the mattress next to her and pull her against her chest and stroke her hair until she falls asleep, she wants to be there if Catra has a nightmare or tries to hurt herself again, she wants to wrap Catra in her arms and absorb her into her chest where she’ll be safe and never feel pain or fear again.\n \nBut she can’t. She’s never been able to do that for Catra, as much as she’s wanted to. And every time she tried, it just made things worse.\n \nAdora stands and leaves the room, pressing the panel to close the door behind her. She walks far enough away that Catra will be able to hear her footsteps retreating, then slips her shoes off and tiptoes back as quietly as she can. She lowers herself to the ground and leans against the door, listening as hard as she can for any sound of distress within.\n \nIf Catra needs anything, she’ll be there.\n \nShe’s not leaving her again.\n \nThe ship rumbles and creaks as it moves through space, away from Horde Prime.\n \n*****\n \nCatra stays in the room for a long time. She doesn’t sleep, much. When she does, she sees horrible things. She sees the inside of a tank full of green fluid, the sea of glowing clone eyes in the darkness, the cruel twist of Prime’s lips as he rips through her mind. She feels the breathing tube crammed down her throat, Prime’s unyielding grip holding her head steady as the chip is planted, the searing full body pain followed by the terrifying numbness.\n \nBut as horrible as it is, the worst thing she sees is Adora’s face, over and over, eyes bright and glowing with hope, all reaching hands and awkward smiles.\n \nThere isn’t a window in Catra’s room, but even if there was, there’s no day or night to make sense of the passage of time. There hasn’t been for a while. How long has she been in space? How long was she under Prime’s control? How long since Adora carried her to safety? It’s all melting together, a mix of cold emptiness and feverish dreams. Catra thrashes from side to side in the bed, kicks the blanket onto the floor, grips her head, but she doesn’t cry out. She knows that if she does, Adora will come to help her. And she can’t bear to see Adora’s stupid, hopeful face again.\n \nAfter a while (Catra has no idea how long), Adora comes back to check on her. Catra pretends to be asleep. She hears Adora set another water bottle on the ground beside the bed, feels her pull the blanket back over her. She’s angry at that, the familiarity of it all when she should be glaring at Catra through the bars of a prison cell. But she doesn’t stir. She can’t look Adora in the eyes again.\n \nAdora keeps coming back to check on her, and Catra feigns sleep every time. She doesn’t touch the water bottle even though her dry throat aches, because then Adora would know that she had been awake. But eventually, she slips into shallow dreams again — the green fluid, Prime’s smirk, the pain, his voice — and that’s when Adora happens to check in on her again. At the sound of the door Catra sits bolt upright, her heart pounding out of her chest and a terrified scream bursting from her mouth before she can choke it down. And just like that, her cover’s blown. And Adora’s looking at her with that same stupid, hopeful look, like Catra hasn’t spent years trying to burn her and everything she loved.\n \nAnd she can’t stand it.\n \nSo Catra does what she always does. She retreats behind her walls, lashes out, needles Adora where she knows it stings the most. It’s what she is. She’s an animal, nothing more than base instincts and rotten heart, just as everyone has always said she was. She’s poison, she’s fire, she’s broken glass, and all she knows how to do is hurt and be hurt in turn.\n \nAdora leaves, angry, and something in Catra, some small childish piece that somehow hasn’t been completely stamped out, wants to call after her, wants to run after her into the bright hallway.\n \nShe doesn’t. She stays in the dark.\n \nShe doesn’t know how to leave it.\n \n*******\n \nIt’s not until Adora is staring down at her coldly and offering her the choice to go, to leave them all behind, to never see her again, that Catra finally realizes that she can’t do it.\n \nShe’s spent years alone, empty, angry. Her rage was the only fire that warmed her, but now she’s just cold. Her bones are aching with it. And she can’t do it for a moment longer.\n \nShe reaches for Adora.\n \n“Stay.”\n \n \n********\n \n \n“You should have seen me,” Bow is saying. “There were two coming from behind, and one cutting me off in front, and I was like PEW! WHOA! BARREL ROLL! And I totally dodged them, it was dope.”\n \n“And you only hit three asteroids on the way,” smirks Glimmer. “Just, smashed straight through them. It was almost impressive.”\n \n“Fine, you can drive next time then,” huffs Bow.\n \n“We could have been depressurized and died instantly, but Darla’s shielding held up perfectly!” chirps Entrapta. “Ohhh, I’m so proud of her!”\n \nAdora’s face is brimming with excitement as she watches Catra take another bite of the bun. “So? What do you think?” she urges, her eyes glowing with anticipation for Catra’s reaction.\n \n“It’s…good,” mutters Catra. Then, seeing Glimmer shoot her a reproachful look, she adds, “Really good. Thank you.”\n \nAdora’s face falls a little with disappointment. “Just good?”\n \n“I mean, Sparkles isn’t exactly a five-star chef,” smirks Catra, earning herself an elbow in the ribs from Glimmer. “What? I said it was good!”\n \n“I just thought you’d have a bigger reaction than that,” mumbles Adora. “The first time I tried real food outside of ration bars, it blew my mind. I couldn’t stop eating it.”\n \nCatra raises an eyebrow. “Adora, you know I’ve had food besides ration bars before, right? There was a ton of contraband in the Fright Zone if you knew where to find it. You were the only one square enough to not even try.”\n \nBow and Glimmer laugh, and Catra feels a little flicker of warmth. She’s not used to people laughing at her. Not in a good way, anyway. Adora flushes, embarrassed. “Are you kidding?\" she mutters. \"I’ve been waiting for years for you to join the Rebellion so I could see you try real food. And you’ve been eating it the whole time?”\n \nJust like that, the flicker of warmth vanishes, and all that’s left is a surge of crushing cold. Bow makes another joke, but his voice sounds muffled and far away. She feels like she’s drowning. Without a word, she stands and leaves the circle.\n \n“Catra…?” Adora’s voice is the only one that pierces the roaring in her ears, but she doesn’t turn back. She can hear Glimmer murmur something, and she knows she’s telling Adora to give her space.\n \nAs soon as she’s out of the room, her legs get weak. She’s almost made it back to her room when they give out altogether, and she stumbles against the wall. It feels like her lungs are being constricted by the heavy pressure on her chest; it feels like all the blood has been drained from her body. She slides down the wall to the floor, gasping for breath, and then her gasps turn to wracking sobs, so deep and heaving that they’re almost soundless.\n \n\nI’ve been waiting years for you to join the Rebellion…\n\n \nShe’d said it so casually, like it had really been that simple. Like Catra could have just chosen to walk away from the ceaseless misery of the Fright Zone any time she wanted, chosen to eat good food and be with Adora and be happy. And she could have, couldn’t she? Every sleepless night, every torment inflicted by Shadow Weaver or Hordak, every rage-filled breakdown clawing at the walls and her bed and her own body. It had all been pointless. It was all just wasted time. She could have walked away from her pride and her rage and her need to destroy. Instead she’d let herself be consumed by it until there was nothing good left in her and the world was burning around her.\n \nWhat if it's too late?\n \nThe pressure in her chest has settled in her stomach; it makes her feel like she’s going to throw up. She’s retching with every breath, but nothing comes up, just more sobs. She lets them come.\n \nShe cries until she's empty. Her eyes ache and her body is sore and heavy; she lies there, too exhausted to move. She hears someone coming around the bend in the hall, and she tenses — she doesn’t want Adora to see her like that. But it’s not Adora.\n \nEntrapta’s eyes are fixed on her tracker pad — she almost steps on Catra before noticing her.\n \n“Oh, sorry,” she says brightly. “I was just on my way to see how Darla’s reboot is going.” Then she notices Catra’s tear-streaked face and her eyes widen. “Oh. Um. Are you…all right?”\n \nCatra doesn’t answer right away. Entrapta fidgets, clearly incredibly uncomfortable with the situation. “Do you need medical attention? I’ll just, uh, go get someone…”\n \n“Entrapta,” says Catra at last, raising her head. “How’d you do it?”\n \nEntrapta cocks her head quizzically. “How’d I do what?”\n \n“How’d —“ Catra swallows, her throat raw. “…how’d you get them to forgive you? How did you forgive yourself?”\n \nEntrapta considers the question, playing with the ends of her pigtails. “I don’t know,” she admits. “Adora and Bow came to rescue me even after I messed with the Runestones. Even after I made robots to hurt them. Even when my portal machine almost destroyed reality.”\n \nCatra flinches and looks away, curling in on herself, shivering. Entrapta sees the reaction and panics — she does the first thing she can think of and lunges for Catra’s hand, holding it in an awkward grip. Catra’s teary eyes meet hers, shocked. Entrapta looks shocked too, then she decides that she needs to commit and squeezes Catra’s hand a little more firmly.\n \n“I think they came back for me because they believed that I could be better,” she says, clearly choosing each word as carefully as she can. “They wouldn’t leave me, even when I asked them to. So I decided I wanted to be the person they thought I was. At first, I didn’t know how. I kept messing it up. But they didn’t give up on me. I don’t think they’ve given up on you, either. I think you just have to…keep trying.”\n \nThere’s a long moment of silence, Entrapta doing her best to hold Catra’s gaze even though it’s clearly killing her. She doesn’t let go until Catra gives her a small, wavering smile, and squeezes her hand slightly in return. Satisfied that her gesture was successful, Entrapta extricates herself and steps back. Catra watches her.\n \n“You’ve come a really long way,” murmurs Catra.\n \n“Thank you!” says Entrapta proudly. “I learned the hand thing from Bow, it seems to really comfort people.” She sizes Catra up, then nods decisively. “You need new clothes. I’ll make you some. A spacesuit, too. Do you want your helmet to have ears? I’m giving it ears.” With that, Entrapta shoots off down the hall, jabbering happily into her voice recorder about \"another successful emotional connection!\"\n \nCatra is too tired to stand. But her chest doesn’t hurt anymore. The sick feeling in her stomach has abated. She feels numb, sore, heavy…but also…better, somehow.\n \nFor the first time in a long time, she thinks she can see a way forward.\n \nHer eyes drift closed and she falls asleep, not fifteen feet from the door to her room. She’s sleeping so heavily that she doesn’t even wake up when Adora finds her some time later and lifts her in her arms, but when she lays her carefully on the bed, she stirs, her eyes cracking open drowsily.\n \n“Hey, Adora,” she mutters.\n \nAdora grins that stupid, dopey grin. Idiot. “Are you okay?”\n \n“Yeah. I’m okay. Really tired, though. I think I need to sleep.”\n \nAdora nods and starts to pull away, then stops. Catra’s hand is wrapped around hers — gentle, claws retracted, but firm. She doesn’t say anything, doesn’t even meet Adora’s eyes, but she doesn’t let go, either.\n \nAdora takes a risk.\n \n“Hey, Catra?” she whispers at last. “Is…is it okay if I sleep in here tonight? I think Bow and Glimmer are making out in the bunkroom and I don’t want to go back there.” Catra chuckles, a low rumble, almost a purr. Adora smiles. She likes making Catra laugh.\n \n“If you want,” Catra murmurs. Adora stands up, triumphant.\n \n“I’ll go get another blanket. I can take the floor.” She’s heading for the door when Catra’s voice stops her.\n \n\n“Adora.” \n\n \nAdora looks back questioningly. Catra’s looking at her now, her blue and gold eyes bright in the dim room.\n \n“Don’t be an idiot,” Catra says at last. “The bed is huge.”\n \n\nWow.\n\n \nSlowly, carefully, Adora lowers herself onto the bed beside Catra. She lies stiffly on her side facing Catra, but they don’t touch. She stares at Catra, eyes wide, as if she’ll move too quickly and scare Catra away. After a tense beat, the corner of Catra’s mouth curls up in a small smirk, baring one pointed fang.\n \n“Take your stupid ponytail out, dummy,” she says. “You’re going to lose all your hair before you’re thirty if you keep sleeping with it.”\n \nAdora glares at her, but relaxes, yanking out her hair elastic and slipping it around her wrist. Her hair falls around her face, messy and sweaty. She shoots Catra a there, happy now? look.\n \nShe looks tired, too. Catra holds her gaze. She blinks slowly, wondering if Adora even remembers what that means.\n \nAdora reaches out suddenly, and brushes the short bangs framing Catra’s face. Catra jumps a little at the unexpected touch — Adora quickly withdraws her hand, self-conscious. “Sorry,” she says. “I just…I like it. The hair.”\n \nCatra rolls her eyes, trying to be nonchalant. “I guess that’s one thing I should thank Prime for, at least. Giving me a nice haircut.”\n \n“No.” Adora sounds horrified at the thought. “I just meant —“\n \n“Adora. It’s okay.” Catra curls towards Adora, just a little, still not touching her. “It was just a joke. I’m glad you like it. It feels…lighter.” They’re holding each other’s eyes, unwavering, neither wanting to be the first to look away. Not sure what to say next. Then…\n \n“Thanks,” whispers Catra in the silence. “For saving me. Thanks for coming back.”\n \nAdora’s eyes widen in shock. She’s so dumb. Every emotion she feels written across her face, easy for anyone to read. Maybe Catra could learn to be a little more like that.\n \n“I couldn’t leave you,” Adora whispers back.\n \n“I’m going to be better,” says Catra, squeezing her eyes shut. “I’ve hurt you a lot. I’m sorry. I’m not going to do it again. But I know sorry doesn’t fix everything. And if you ever want me to go, I’ll go.”\n \nCatra feels the mattress shift as Adora shuffles closer, close enough that Catra can feel her breath on her face. “I don’t want you to go,” she says. “I want you here. With me. I really missed you, Catra.”\n \nThat's when Catra bridges the gap. It’s not much — a slight brush of her tail on Adora’s leg. Light enough that it could’ve been accident. But she doesn’t move it. She leaves it there, an unspoken request, until Adora gets the point.\n \nAdora slides closer and curls around Catra, draping an arm around her, pulling her close. Catra tucks her head under Adora’s chin, nestling into the warmth of her chest. The embrace is a little awkward, not as easy and careless as it had been when they were children. But it doesn’t matter. It’s a start.\n \nCatra can’t keep her eyes open anymore. And as she drifts off into the deepest sleep she’s had in years, Adora can feel the soft, creaky buzz of Catra’s purr vibrating against her chest. She can’t believe this is happening. But she’s too tired to question it. She buries her face in Catra’s hair and lets her purring lull her to sleep.\n \n \n \nThe ship moves quietly, peacefully, through space, on its way home.\n \n "
}